{"url": "https://web.archive.org/web/20171120145725/https://www.dickclark.com/news/christina-aguilera-honor-whitney-houston-amas/", "text": "MULTI-PLATINUM SELLING ARTIST CHRISTINA AGUILERA TO HONOR WHITNEY HOUSTON AND THE\n\n25TH ANNIVERSARY OF THE FILM “THE BODYGUARD” WITH MUSICAL TRIBUTE\n\nAT THE “2017 AMERICAN MUSIC AWARDS®”\n\nWORLD’S LARGEST FAN VOTED AWARDS SHOW TO\n\nCELEBRATE 45 YEARS OF GIVING FANS THE VERY BEST IN MUSIC\n\nThe Live Broadcast Will Air Sunday, November 19th at 8:00pm ET on ABC\n\nFor digital assets and nominee gif galleries, please go to: http://bit.ly/AMAsMedia17\n\nLos Angeles, CA (October 30, 2017) – dick clark productions and ABC announced today that singer, songwriter and actress, Christina Aguilera, will pay tribute to Whitney Houston and music from the successful film turned pop culture phenomenon, “The Bodyguard,” at the “2017 American Music Awards.” The multi-talented songstress’ tribute, which will feature memorable tracks from The Bodyguard: Original Soundtrack Album, comes on the eve of the 25th anniversary of the film, which was released on November 25, 1992 and starred one of Aguilera’s all-time favorite artists, the late Whitney Houston. Houston won 22 American Music Awards, including eight in a single year, making her the most awarded female vocalist of all time. A fan-favorite and true pop icon, Aguilera has treated fans to an array of American Music Awards performances throughout the years including her first AMA performance in 2000 with the hit singles “What a Girl Wants” and “I Turn to You,” her knockout medley of “Ain’t No Other Man,” “Beautiful,” “Dirrty,” “Genie in a Bottle” and “Keeps Gettin’ Better” in 2008, as well as her most recent performance of the moving piano ballad “Say Something” with A Great Big World in 2013. Viola Davis will be on hand to introduce Aguilera for this unforgettable homage. The “2017 American Music Awards,” the world’s largest fan-voted awards show where music enthusiasts watch their favorite artists and pop culture icons come together to honor idols, newcomers and record-breakers in the contemporary music scene, will celebrate 45 years of music live from the Microsoft Theater in Los Angeles on Sunday, November 19, 2017 at 8:00pm ET on ABC.\n\n“Whitney herself stated in 2001 that Christina Aguilera sang the best version of her song ‘Run To You,’” said the Estate of Whitney E. Houston. “It is with great appreciation and honor that she is returning to participate on the American Music Awards for a special tribute honoring the 25th anniversary of ‘The Bodyguard.’ Whitney said that Christina is without a doubt one of the best voices she enjoyed in this generation of music. From the Estate of Whitney E. Houston, we thank you with great joy!”\n\n“I am honored and humbled to be asked to participate in such a special tribute of a timeless soundtrack that has been a huge inspiration not only in my own personal life and career, but to countless aspiring singers – touching music lovers worldwide and influencing the history of music itself,” said Christina Aguilera. “To be honoring THE one and only, Whitney Houston, is a blessing and I am grateful to celebrate the spirit of her songs and legend that lives on. I feel eternally fortunate to have personally met her on and off the stage. My deep appreciation for her kindness to me while coming up in the business – her graciousness, generosity, humanity and beauty – lived up to everything I could have hoped for in meeting my idol and will forever be cherished in my memory of her.”\n\nOriginally released on November 17, 1992, The Bodyguard: Original Soundtrack Album–co-executive produced by Whitney Houston and Clive Davis–was the first album verified by SoundScan to sell more than one million copies in a single week, won the Grammy Award for Album of the Year, has sold more than 45 million copies worldwide (and is certified 17x Platinum in the US by the RIAA) and is the top-selling soundtrack album of all-time. “The Bodyguard” marked Whitney’s debut as a movie star while the soundtrack–driven in part by Whitney’s monumental interpretation of “I Will Always Love You”–became of one of the best-selling albums of any genre in history. Legacy Recordings (in cooperation with The Estate of Whitney E. Houston) is celebrating the 25th anniversary with the release of Whitney Houston – I Wish You Love: More From The Bodyguard on November 17, 2017 which includes never-before-released live recordings from Whitney’s historic The Bodyguard Tour (1993-1995); alternate versions of the audio recordings from the “The Bodyguard” film; an alternate version of a remix of “I’m Every Woman”; additional artwork and more.\n\nSinger, songwriter, performer, producer, director and actress, Christina Aguilera, is one of the most accomplished performers of the last decade. She has sold more than 43 million albums worldwide, achieved four #1 singles on the Billboard Hot 100 chart, three top five albums in the United States, and has won six Grammy Awards. She has collaborated with other legendary artists including Herbie Hancock, Andrea Bocelli, Tony Bennett, Elton John and The Rolling Stones. Aguilera was also the only artist under 30 to make Rolling Stone Magazine’s list of 100 greatest singers of all time and was named one of Time Magazine’s Most Influential People in 2013. The New York native’s trajectory from performing in local talent shows in Pennsylvania, where she grew up, to getting her big break on “Star Search” in 1992 to landing a part on the Disney Channel’s “The New Mickey Mouse Club,” is well known. It was her song, “Reflection,” for Disney’s “Mulan,” that led to a record deal with RCA and the release of her self-titled debut album in the summer of 1999. The album quickly hit #1 on the strength of its first dance/pop single, “Genie In A Bottle” (which dominated the charts for five weeks and broke records worldwide) and other chart toppers including “What A Girl Wants” and “Come on Over.” She has gone on to win multiple awards including a Grammy Awards for Best New Artist, Best Pop Collaboration with Vocals, Best Female Pop Vocal Performance to name a few. Among countless other honors, she is also the recipient of a 2001 Latin Grammy Award for Mi Reflejo (Best Female Pop Vocal Album), a 2000 Billboard Music Award for Female Artist of the Year, and two 2004 Rolling Stone Music Awards (Best Female Performer, Readers’ Pick; and Best Tour, Readers’ Pick, “Justified and Stripped”). In 2010 Christina added a new role to her list of accomplishments, the role of actress. She starred in her first feature film Burlesque, opposite Cher and Stanley Tucci which earned a Golden Globe Nomination for her Original Song, “Bound to You” which she co-wrote and performed. In 2011 Aguilera made her way to television showcasing her mentoring side as she coached young hopefuls in the effort to beat out her fellow coaches on the NBC series The Voice. The show was an immediate success breaking television ratings records and winning multiple Emmy Awards. In 2015, she made her way back to acting starring as Jade St. John in the ABC hit series “Nashville.” In addition, in 2017 she wrapped shooting “Zoe” starring Ewan McGregor and appeared as the voice of Akiko Glitter in the Summer Sony release, “The Emoji Movie.”\n\nAs previously announced, music legend, Diana Ross, will take the stage at the “2017 American Music Awards” for a rare performance, where she will also be honored with the “American Music Award for Lifetime Achievement” in recognition of her remarkable career and her outstanding artistic contributions to the entertainment industry and popular culture. Additionally, multi-platinum pop superstar Selena Gomez will treat fans to the world television premiere of her brand new single “Wolves.”\n\nNominations for the “2017 American Music Awards” were announced earlier this month. Bruno Mars leads with eight nominations, including Artist of the Year, Video of the Year, and Favorite Male Artist – Pop/Rock. The Chainsmokers, Drake, Kendrick Lamar, Ed Sheeran and The Weeknd tied with five nominations each, while Justin Bieber, Daddy Yankee and Luis Fonsi received four nominations each. Additionally, Keith Urban earned three nominations, and Rihanna and Halsey earned two nominations each.\n\nThe American Music Awards winners are voted entirely by fans. Voting is open in all categories except New Artist of the Year presented by T-Mobile and Collaboration of the Year presented by Xfinity, which will both open on Wednesday, November 1.\n\nThe Artist of the Year nominees are Bruno Mars, The Chainsmokers, Drake, Kendrick Lamar and Ed Sheeran. Voting for Artist of the Year will close on Thursday, November 16 at 8:59:59pm PT. Voting for all other editorial categories closes on Monday, November 13 at 8:59:59am PT.\n\nFor New Artist of the Year presented by T-Mobile and Collaboration of the Year presented by Xfinity, fans can vote for each award 100 times per day, per voting platform in one or both of the ways below. Fans can vote for all other awards once per day, per voting platform.\n\nVia web at com/amas and theamas.com/vote\n\nPosting a tweet on Twitter that includes the nominee’s name or Twitter handle, the category name and #AMAs within the tweet\n\nAmerican Music Awards nominees are based on key fan interactions as reflected in Billboard Magazine and on Billboard.com, including album and digital song sales, radio airplay, streaming, social activity and touring. These measurements are tracked by Billboard and its data partners, including Nielsen Music and Next Big Sound. The eligibility period for the “2017 American Music Awards” was September 9, 2016 to September 14, 2017.\n\nSponsors for the “2017 American Music Awards” include Comcast’s Xfinity and T-Mobile. Media partners include Cumulus Media/ Westwood One and Music Choice.\n\nThe “2017 American Music Awards” is produced by dick clark productions. Allen Shapiro and Mike Mahan are Executive Producers. Larry Klein, Barry Adelman and Mark Bracco are Producers.\n\nFor the latest American Music Awards news, exclusive content and more, be sure to follow the AMAs on social and join the conversation by using the official hashtag for the show, #AMAs.\n\nFacebook: Facebook.com/AMAs\n\nTwitter: @AMAs\n\nInstagram: @AMAs\n\nSnapchat: TheAMAs\n\nTumblr: amas.tumblr.com\n\nCheat tweet: .@xtina will honor Whitney Houston and the 25th Anniversary of “The Bodyguard” with a musical tribute at the @AMAs! amas.news/christina\n\nTickets are now on sale at www.axs.com.\n\nSHOW MEDIA CREDENTIALS\n\nTo apply for media credentials to cover the “2017 American Music Awards” please go to here. Submissions for credentials will stay open until 6pm PT on Friday, November 3, 2017.\n\nAbout the American Music Awards\n\nThe American Music Awards, the world’s biggest fan-voted award show, features performances from today’s hottest artists and presents fan-voted awards in the music genres of Pop/Rock, Alternative Rock, Country, Rap/Hip-Hop, Soul/R&B, Adult Contemporary, Contemporary Inspirational, Latin, EDM and Soundtrack, and the categories of Artist of the Year, New Artist of the Year presented by T-Mobile, Collaboration of the Year presented by Xfinity, Tour of The Year and Video of the Year. The American Music Awards pays tribute to today’s most influential and iconic artists. The show is produced by dick clark productions and is seen in more than 200 countries around the world. For more information, visit www.theamas.com, www.dickclark.com or abc.go.com/shows/american-music-awards.\n\nAbout dick clark productions\n\ndick clark productions (dcp) is the world’s largest producer and proprietor of televised live event entertainment programming with the “Academy of Country Music Awards,” “American Music Awards,” “Billboard Music Awards,” “Golden Globe Awards,” “Dick Clark’s New Year’s Rockin’ Eve with Ryan Seacrest,” “Hollywood Film Awards” and the “Streamy Awards.” Weekly television programming includes “So You Think You Can Dance” from 19 Entertainment and dcp. dcp also owns one of the world’s most unique and extensive entertainment archive libraries with over 60 years of award-winning shows, historic programs, specials, performances and legendary programming. For additional information, visit www.dickclark.com.\n\nMedia Contacts\n\ndick clark productions:\n\nKelly Striewski 310-255-4602 KStriewski@dickclark.com\n\nGina Sorial 310-255-0308 GSorial@dickclark.com\n\nSlate PR\n\nAndy Gelb 310-461-0111 Andy@slate-pr.com\n\nRachael Trager 212-235-6817 Rachael@slate-pr.com\n\nABC Media Relations:\n\nNicole Gonzales 818-460-7421 Nicole.J.Gonzales@abc.com\n\nNate Reeves 818-460-6422 Nate.Reeves@abc.com\n\nLatin Press Inquiries:\n\nDiana Baron 310-315-5444 diana@dbaronmedia.com\n\n# # #\n\nDOWNLOAD PRESS RELESE", "images": ["https://web.archive.org/web/20171120145725im_/https://www.dickclark.com/wp-content/themes/basetheme16/images/logo_main.png", "https://web.archive.org/web/20171120145725im_/https://www.dickclark.com/wp-content/uploads/2017/10/Christina-Aguilera.png", "https://web.archive.org/web/20171120145725im_/https://b.scorecardresearch.com/p?c1=2&c2=18157917&cv=2.0&cj=1", "https://web.archive.org/web/20171120145725im_/https://www.dickclark.com/news/christina-aguilera-honor-whitney-houston-amas/", "https://web.archive.org/web/20171120145725im_/https://www.dickclark.com/wp-content/themes/basetheme16/images/ripple.gif"], "top_img": "https://web.archive.org/web/20171120145725im_/https://www.dickclark.com/wp-content/uploads/2017/10/Christina-Aguilera.png", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20171120145725/https://www.dickclark.com/news/christina-aguilera-honor-whitney-houston-amas/", "title": "Christina Aguilera to Honor Whitney Houston at the AMAs", "meta_data": {"description": "Christina Aguilera will pay tribute to Whitney Houston and music from the successful film turned pop culture phenomenon, “The Bodyguard,” at AMAs.", "viewport": "width=device-width,initial-scale=1.0,user-scalable=no,minimal-ui", "fb": {"pages": 113498369176}, "og": {"locale": "en_US", "type": "article", "title": "Christina Aguilera to Honor Whitney Houston at the AMAs - dick clark productions", "description": "Christina Aguilera will pay tribute to Whitney Houston and music from the successful film turned pop culture phenomenon, “The Bodyguard,” at AMAs.", "url": "https://web.archive.org/web/20171120145725/https://www.dickclark.com/news/christina-aguilera-honor-whitney-houston-amas/", "site_name": "dick clark productions", "updated_time": "2017-10-30T14:36:18-08:00", "image": {"identifier": "https://web.archive.org/web/20171120145725im_/https://www.dickclark.com/wp-content/uploads/2017/10/Christina-Aguilera.png", "secure_url": "https://www.dickclark.com/wp-content/uploads/2017/10/Christina-Aguilera.png", "width": 1920, "height": 1080}}, "article": {"publisher": "https://www.facebook.com/dickclarkproductions", "section": "American Music Awards", "published_time": "2017-10-30T14:31:31-08:00", "modified_time": "2017-10-30T14:36:18-08:00"}, "twitter": {"card": "summary_large_image", "description": "Christina Aguilera will pay tribute to Whitney Houston and music from the successful film turned pop culture phenomenon, “The Bodyguard,” at AMAs.", "title": "Christina Aguilera to Honor Whitney Houston at the AMAs - dick clark productions", "site": "@dclarkp", "image": "https://web.archive.org/web/20171120145725im_/https://www.dickclark.com/wp-content/uploads/2017/10/Christina-Aguilera.png", "creator": "@dclarkp"}, "generator": "WordPress 4.8.3"}, "movies": [], "publish_date": 1509402691.0, "source": "https://web.archive.org", "summary": ""}