{"url": "https://www.celebritynetworth.com/richest-celebrities/actors/yvonne-strahovski-net-worth/", "text": "What is Yvonne Strahovski's Net Worth and Salary?\n\nYvonne Strahovski is an Australian actress who has a net worth of $12 million. Yvonne Strahovski is best known for her roles on the hit television series \"Chuck,\" \"Dexter,\" and \"The Handmaid's Tale.\" She received an Emmy Award nomination for her work on the latter program. On the big screen, Strahovski has appeared in such films as \"Killer Elite,\" \"I, Frankenstein,\" and \"He's Out There.\"\n\nEarly Life and Career Beginnings\n\nStrahovski was born as Yvonne Jaqueline Strzechowski in Werrington Downs, New South Wales, Australia in 1982. Her parents are Piotr, an electronic engineer, and Bozena, a lab technician; they are both Polish immigrants from Warsaw. At twelve years of age, Strahovski began taking acting lessons, and played Viola in her school's production of Shakespeare's \"Twelfth Night.\" Later, she attended Santa Sabina College in Strathfield, and in 2003, attended the University of Western Sydney's Theatre Nepean. Subsequently, she co-founded her own small theater company.\n\nStrahovski continued her career with film and television roles in Australia. She appeared on the satirical program \"Double the Fist\" and the nautical drama \"Sea Patrol,\" and played the role of Freya Lewis in the university-set \"Headland,\" which ran from 2005 to 2006.\n\n\"Chuck\" and Mainstream Success\n\nWhile auditioning for roles in the United States, including for NBC's revival of \"Bionic Woman,\" Strahovski sent her audition tape in for the network's \"Chuck,\" a spy comedy. The next day, the producers invited her to come in to run lines with the show's star, Zachary Levi. A week later, she was cast as female lead Sarah Walker, a CIA agent tasked with protecting Levi's Chuck Bartowski. Strahovski utilized her fluency in Polish on the show, speaking the language in brief exchanges in three episodes.\n\nStrahovski's mainstream success continued with her credits in the popular role-playing video games \"Mass Effect Galaxy,\" \"Mass Effect 2,\" and \"Mass Effect 3.\" Voicing the character Miranda Lawson, Strahovski had her face scanned and animated so she could appear \"in the flesh\" in the second edition of the series. Other voiceover roles include Aya Brea in \"The 3rd Birthday,\" and Batwoman in the 2016 animated movie \"Batman: Bad Blood.\"\n\nFurther TV Roles\n\nAfter \"Chuck,\" Strahovski was cast in the seventh season of the hit Showtime crime drama \"Dexter.\" Playing Hannah McKay, a woman caught up in the criminal investigation of her deceased lover, Strahovski reprised the role for the show's eighth season. In 2014, the actress appeared as CIA agent Kate Morgan on \"24: Live Another Day,\" a limited-event television series on Fox. That same year, she was cast on the ABC limited series \"The Astronaut Wives Club,\" which was based on the book of the same name.\n\nStarting in 2017, Strahovski played Serena Joy Waterford on the critically acclaimed Hulu series \"The Handmaid's Tale.\" In 2018, her performance garnered her a Primetime Emmy Award nomination for Outstanding Supporting Actress in a Drama Series. The next year, she received additional nominations from the Golden Globe and Critics' Choice Awards.\n\nOn the Big Screen\n\nAfter starring in a number of smaller films such as \"Gone,\" \"The Plex,\" \"The Canyon,\" and \"Matching Jack,\" Strahovski appeared in the big-budget 2011 action thriller \"Killer Elite.\" Based on the 1991 novel \"The Feather Men,\" the film starred Robert De Niro, Clive Owne, and Jason Statham, with Strahovski playing the grown-up childhood acquaintance of the latter. The next year, she showed up opposite Barbra Streisand and Seth Rogen in the comedy \"The Guilt Trip.\" Later film credits include the fantasy film \"I, Frankenstein\" in 2014; crime thriller \"Manhattan Night,\" costarring Adrien Brody; psychological drama \"All I See Is You\"; and 2018's \"The Predator,\" the fourth installment in the eponymous science-fiction film series.\n\nPersonal Life and Real Estate\n\nIn 2009, Strahovski purchased a renovated 1,545-square-foot home in LA's Laurel Canyon. The single-family, double-story residence featured two bedrooms and two bathrooms, along with large glass doors and windows and an open plan layout. Later, in 2012, she purchased another property in Beverly Hills with four beds and four baths.\n\nIn 2017, Strahovski married actor and producer Tim Loden, who had been her partner for six years. They had their first child, William, in 2018.", "images": ["https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/wp-content/uploads/2010/06/Yvonne-Strahovski-1.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2010/06/Yvonne-Strahovski-1.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/yvonne-strahovski-net-worth/", "title": "Yvonne Strahovski Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Yvonne Strahovski Net Worth and salary: Yvonne Strahovski is an Australian actress who has a net worth of $12 million. Yvonne Strahovski earned her net worth", "cnw_share_fb_count": 103, "cnw_share_tw_count": 35, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Yvonne Strahovski Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/yvonne-strahovski-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/06/Yvonne-Strahovski-1.jpg", "site_name": "Celebrity Net Worth", "description": "Yvonne Strahovski Net Worth and salary: Yvonne Strahovski is an Australian actress who has a net worth of $12 million. Yvonne Strahovski earned her net worth"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2022-08-22T16:28:51+00:00", "published_time": "2021-03-19T11:55:05+00:00", "section": "Actors", "tag": "Yvonne Strahovski salary"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/06/Yvonne-Strahovski-1.jpg", "title": "Yvonne Strahovski Net Worth", "description": "Yvonne Strahovski Net Worth and salary: Yvonne Strahovski is an Australian actress who has a net worth of $12 million. Yvonne Strahovski earned her net worth"}}, "movies": [], "publish_date": 1616154905.0, "source": "https://www.celebritynetworth.com", "summary": ""}