{"url": "https://www.nbcwashington.com/news/national-international/Andy-Spade-Breaks-Silence-After-Wife-Kate-Spades-Death-484772961.html?_osource=AMP", "text": "What to Know Andy Spade has released a statement on the death of his wife, designer Kate Spade\n\nHe says she suffered from depression and anxiety for many years, and was seeking help in the last five years\n\n\"There was no indication and no warning that she would do this,\" Spade said of his wife's death by suicide. \"It was a complete shock.\"\n\nAndy Spade, the husband and business partner of designer Kate Spade, who died in an apparent suicide in her New York City apartment Tuesday, said she suffered from depression and anxiety for many years.\n\nShe was seeking help during the last five years, \"seeing a doctor on a regular basis and taking medication for both depression and anxiety,\" Andy Spade said in a statement released on Wednesday.\n\nHe said there were \"personal demons she was battling.\"\n\nThe designer was found by a housekeeper hanged in the bedroom of her Park Avenue apartment on Tuesday. She was 55 years old and had a 13-year-old daughter. While investigators were still in the early stages of their inquiry, the NYPD's chief of detectives, Dermot Shea, said evidence including a note pointed to \"a tragic suicide.\"\n\n[NY-NATL] Remembering NYC Fashion Icon Kate Spade\n\nSpade was working as an accessories editor at Mademoiselle magazine when she launched her company with her husband in their apartment in 1993.\n\nAndy Spade, the brother of comedian David Spade, said she \"sounded happy\" the night before her suicide.\n\n\"There was no indication and no warning that she would do this,\" he said. \"It was a complete shock.\"\n\nHe said he and his wife had been living separately for the past 10 months but saw each other or spoke every day. He said they were not legally separated and never discussed divorce.\n\nCoach, now known as Tapestry, bought the Kate Spade brand last year for $2.4 billion. The couple recently had started a new handbag company, Frances Valentine.\n\n\"We were best friends trying to work through our problems in the best way we knew how,\" Andy Spade said.\n\nKate Spade's sister, Reta Saffo, released her own statement late Tuesday saying she believed that Kate Spade had bipolar disorder and had a hard time with it. Those comments sparked backlash within hours, with a source close to the family saying Spade's relatives were \"disgusted\" by Saffo's remarks, and that Saffo had been estranged from the \"entire family\" for a decade.\n\nSaffo said of her sister, however: \"My little sister Katy was a precious, precious little person. Genuine in almost every way.\"\n\nThe sudden death of the iconic designer left fans, celebrities and fashion industry insiders reeling. Brother-in-law David Spade posted a photo on Instagram of him with Kate, writing, \"She was so sharp and quick on her feet. She could make me laugh so hard. I still can't believe it.\"\n\nRead Andy Spade's entire statement below, as provided to NBC News:\n\n\"Kate was the most beautiful woman in the world. She was the kindest person I’ve ever known and my best friend for 35 years. My daughter and I are devastated by her loss, and can’t even begin to fathom life without her. We are deeply heartbroken and miss her already.\n\nKate suffered from depression and anxiety for many years. She was actively seeking help and working closely with her doctors to treat her disease, one that takes far too many lives. We were in touch with her the night before and she sounded happy. There was no indication and no warning that she would do this. It was a complete shock. And it clearly wasn’t her. There were personal demons she was battling.\n\nFor the past 10 months we had been living separately, but within a few blocks of each other. Bea was living with both of us and we saw each other or spoke every day. We ate many meals together as a family and continued to vacation together as a family. Our daughter was our priority. We were not legally separated, and never even discussed divorce. We were best friends trying to work through our problems in the best way we knew how. We were together for 35 years. We loved each other very much and simply needed a break.\n\nThis is the truth. Anything else that is out there right now is false. She was actively seeking help for depression and anxiety over the last 5 years, seeing a doctor on a regular basis and taking medication for both depression and anxiety. There was no substance or alcohol abuse. There were no business problems. We loved creating our businesses together. We were co-parenting our beautiful daughter. I have yet to see any note left behind and am appalled that a private message to my daughter has been so heartlessly shared with the media.\n\nMy main concern is Bea and protecting her privacy as she deals with the unimaginable grief of losing her mother. Kate loved Bea so very much.\"\n\n***\n\nHere is information on suicide prevention from the National Institute of Mental Health. If you are in crisis, call the National Suicide Prevention Lifeline at 800-273-8255 or reach out to the Crisis Text Line by texting ‘Home’ to 741741.\n\n", "images": ["https://media.nbcwashington.com/2022/10/AP22281349654135.jpg?quality=85&strip=all", "https://media.nbcwashington.com/2021/09/William-Bradford-Bishop-and-Kathy-Gillchrist.jpg?quality=85&strip=all&resize=100%2C56", "https://media.nbcwashington.com/2019/09/OTT-Washington-DC.png?fit=1920%2C1080&quality=85&strip=all&w=400&h=44&crop=1", "https://media.nbcwashington.com/2019/09/NBC@3x-7.png?fit=5761%2C3240&quality=85&strip=all", "https://media.nbcwashington.com/2022/10/Suspect-Fired-Shots-Crashed-During-Chase-Police-1.jpg?quality=85&strip=all&resize=100%2C56", "https://media.nbcwashington.com/2022/10/Jazmin-Valentine-with-Jamiyah.jpg?quality=85&strip=all&resize=100%2C56", "https://media.nbcwashington.com/2019/09/DC_On_Light@3x.png?fit=558%2C120&quality=85&strip=all", "https://media.nbcwashington.com/2022/10/AP22281414206795.jpg?quality=85&strip=all", "https://sb.scorecardresearch.com/p?c1=2&c2=6035083&cv=2.0&cj=1", "https://media.nbcwashington.com/2022/10/StoneColburn-Blur.png?resize=100%2C56&quality=85&strip=all", "https://media.nbcwashington.com/2019/09/DC_On_Dark@3x-1.png?fit=558%2C120&quality=85&strip=all&w=186&h=40", "https://media.nbcwashington.com/2022/10/GettyImages-1243822858-e1665251677151.jpg?quality=85&strip=all&resize=100%2C56"], "top_img": "https://media.nbcwashington.com/2019/09/NBC@3x-7.png?fit=5761%2C3240&quality=85&strip=all", "keywords": [], "authors": [], "canonical_link": "http://www.eonline.com/news/942009/andy-spade-breaks-his-silence-after-wife-kate-spade-s-death", "title": "Andy Spade Breaks Silence After Wife Kate Spade's Death", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "max-image-preview:large", "generator": "WordPress 5.8.5", "og": {"site_name": "NBC4 Washington", "type": "article", "description": "Andy Spade, the husband and business partner of designer Kate Spade, who died in an apparent suicide, said she suffered from depression and anxiety for many years.", "title": "Andy Spade Breaks Silence After Wife Kate Spade's Death", "url": "https://www.nbcwashington.com/news/national-international/andy-spade-breaks-silence-after-wife-kate-spades-death/2029205/", "image": "https://media.nbcwashington.com/2019/09/NBC@3x-7.png?fit=5761%2C3240&quality=85&strip=all"}, "google-site-verification": "V-1N4cprg5uHAuJD5dPgh6lkKjRpqioG6aoxsXIEZfc", "fb": {"app_id": 168641655540}, "twitter": {"card": "summary_large_image", "site": "@nbcwashington", "creator": "@nbcwashington", "description": "Andy Spade, the husband and business partner of designer Kate Spade, who died in an apparent suicide, said she suffered from depression and anxiety for many years.", "title": "Andy Spade Breaks Silence After Wife Kate Spade's Death", "url": "https://www.nbcwashington.com/news/national-international/andy-spade-breaks-silence-after-wife-kate-spades-death/2029205/", "image": "https://media.nbcwashington.com/2019/09/NBC@3x-7.png?fit=5761%2C3240&quality=85&strip=all"}, "article": {"opinion": "false", "content_tier": "free", "publisher": "http://www.facebook.com/nbcwashington"}, "description": "Andy Spade, the husband and business partner of designer Kate Spade, who died in an apparent suicide, said she suffered from depression and anxiety for many...", "keywords": "some, statement, concern, reports, record, world, one, suicide.In, demons, shock, anxiety, depression, life, lives, help, indication, loss, disease, touch, depression, depression, anxiety, anxiety, problems, Anything, priority, help, businesses, substance, statements, vacation, divorce, way, Celebrity Deaths, warning, blocks, meals, basis, alcohol abuse, break, privacy, statement, apartment, passing, tribute, memories., tragedy, suicide, record, reports, press, needs, New York Times, business problems, concern, Manhattan, suicide, media, National Suicide Prevention Lifeline, note, message, grief, fashion icon, 1-800-273-TALK, privacy, 1-800-273-TALK, 1-800-273-TALK (8255), 800-273-8255, accessories editor, Andy Spade, COACH, comedian, David Spade, Dermot Shea, designer", "sailthru.title": "Andy Spade Breaks Silence After Wife Kate Spade's Death", "sailthru.description": "Andy Spade, the husband and business partner of designer Kate Spade, who died in an apparent suicide, said she suffered from depression and anxiety for many...", "sailthru.tags": "some, statement, concern, reports, record, world, one, suicide.In, demons, shock, anxiety, depression, life, lives, help, indication, loss, disease, touch, depression, depression, anxiety, anxiety, problems, Anything, priority, help, businesses, substance, statements, vacation, divorce, way, Celebrity Deaths, warning, blocks, meals, basis, alcohol abuse, break, privacy, statement, apartment, passing, tribute, memories., tragedy, suicide, record, reports, press, needs, New York Times, business problems, concern, Manhattan, suicide, media, National Suicide Prevention Lifeline, note, message, grief, fashion icon, 1-800-273-TALK, privacy, 1-800-273-TALK, 1-800-273-TALK (8255), 800-273-8255, accessories editor, Andy Spade, COACH, comedian, David Spade, Dermot Shea, designer", "sailthru.type": "article", "sailthru.date": "2018-06-06T18:58:17+00:00", "taboola_lead": "video", "msapplication-TileImage": "https://media.nbcwashington.com/2019/09/cropped-NBC_Washington.png?fit=270%2C270&quality=85&strip=all"}, "movies": [], "publish_date": 1528311497.0, "source": "https://www.nbcwashington.com", "summary": ""}