{"url": "http://www.cq.com/doc/newsmakertranscripts-4310502", "text": "Sen. Paul Interviewed on Fox News\n\nBOLLING:\n\nHere with reaction to the crisis in Cairo and more, Kentucky Senator Rand Paul. Senator, thank you for joining us. Senator, let's start this out right away. Was this a coup in Cairo, in Egypt?\n\nPAUL:\n\nAbsolutely. When the military takes over and they depose an elected government, that's the definition of a military coup. The interesting thing is, though, Mubarak, a year or two ago was toppled also by a coup. We have a law on the books that says, you don't give foreign aid to military coups when they topple an elected leader and give you a military junta and yet, we continue to do it and we think somehow we're going to influence these people by continuing to throw money at them. And I think it's a real mistake.\n\nBOLLING:\n\nSo, Senator, why hasn't the Obama administration called it a coup?\n\nPAUL:\n\nYou know, I think they are confused on this. They like so many supporters of foreign aid think that that's how we buy friendship around the world, that's how we influence people. But the interesting thing is, there was a Gallup poll in Egypt last year, and 70 percent of Egyptians don't want our money. So, they burn our flag, they don't want our money and we say, oh here, you must take it or we want you to behave and act like Americans, but there isn't a whole lot of real democracy going on over there.\n\nBOLLING:\n\nSenator, maybe this has something to do with that section 508 of the Foreign Assistance Act stipulates said, quote, \"None of the funds appropriated otherwise made available pursuant to this act will be obligated or expended to finance directly any assistance country who's duly elected, check -- head of government is deposed by a military coup or decree, check also. Maybe they just don't want to be put into that box?\n\nPAUL:\n\nYes. And the thing is, as you hear the President's response, and he says, oh, we have a democratically elected government acting undemocratically. Well, democracy is where people vote and a majority wins. We have something different in our country. We have a democratic republic, where the majority gets to decide policy within the constraints of the constitution. That's the real problem over there. There don't seem to be any constraints other than rule of the mob and that's why you have chaos going on in Egypt because I don't they have the same sort of history of a constitution that we have in our country.\n\nBOLLING:\n\nSenator, would it be different if this happened in another country?\n\nPAUL:\n\nWell, you know, the thing is, as you wonder in our country, if the military took over and let's say we deposed a democrat president and we put a republican in, that's essentially what's happening in Egypt. Would anybody not call that a military coup in the United States if that happened? I think if it happened in Germany, we'd call it a military coup. I think somehow they seem to think there is a different standard for the third world or the developing world. And I think that's a mistake.\n\nI think, you know, we shouldn't be sending money, we have a lot of problems in our country. We don't need to be sending money to people who are burning our flag, and people who hate America. They don't hate us any less, they just look at us with derision when we do it.\n\nBOLLING:\n\nI think it is meeting the definition of military coup. Senator, a couple of months ago, Senator John McCain, he disagreed with where you are. He seems to be agreeing with you now, but let's take a listen to what he said in January.\n\n(BEGIN VIDEO CLIP)\n\nSEN. JOHN MCCAIN (R), ARIZONA:\n\nOne of the major stabilizing forces today. If God forbid, the current unrest worsens and Egypt tips deeper into civil conflict, the one force in that country that might be capable of pulling Egypt back from the abyss is the Egyptian military. If the Senate were to adopt the amendment proposed by the senator from Kentucky, we would not only be harming the effectiveness of the Egyptian military which by the way is not objected to by the Israelis who probably understand better than anyone what defense capabilities might be used someday to threaten their security.\n\nBOLLING:\n\nSenator, so back then, keep the aid coming, now he's agreeing with you.\n\nPAUL:\n\nYes. Well, the bottom line is, we don't have the money. We have to borrow the money from China to send it to Egypt. The other point is, is that what are you seeing over there is you're seeing this mass revolt of people who don't want to be dictated to by anyone who is not elected, so the military finally got rid of Mubarak, because they are unhappy with unconstitutional and military rule of Mubarak and now they're unhappy with sort of the same Islamic kind of rule for the Muslim Brotherhood. But I think instituting another un-elected government that's forced out by the military, the American taxpayer shouldn't be forced to support that.\n\nBOLLING:\n\nAll right. Senator, let's talk about leadership very quickly. I don't have a lot of time before we move on. Secretary of State John Kerry said to be yachting during this military coup going on. And then two days later while the bloodshed was happening in Cairo, President Obama hit the links, hit the golf course. Your thoughts?\n\nPAUL:\n\nYou know, I've asked Secretary Kerry directly about this, and I asked him, should foreign aid be dependent on behavior? And he said no. And if you're not going to make it dependent on behavior, what kind of leverage do you have on these countries? If they think we're a sap and we'll continue to give them money no matter what they do, they'll just going to laugh at us as they cash their check. And that's why I disagree with President Obama and Secretary Kerry. That really, if you are going to give money at all, which probably not a good idea. But if you're going to give it, it should be dependent on behavior at the very least.\n\nBOLLING:\n\nAll right. Senator, quick question I want to get in here before we let you go. Obamacare, the delay to 2015 for the employer mandates. Your thoughts?\n\nPAUL:\n\nI'm for a permanent delay. And permanent delay would sit real well with the American people. I'm afraid this is going to cost us a fortune. Individually, I have no idea what my insurance is going to cost. I think it's going to be a real problem, I think we're going to lose jobs and the people they intended to help, the people who are poor and struggling, and don't have insurance, I think what they will have after this, is they may not have a job.\n\nBOLLING:\n\nAll right. Senator, one quick question before I'll let you go. Governor Perry from Texas announced that he will not seek re- election as governor. Maybe looking towards 2016, do you want to welcome him to the fold? Are you announcing your run?\n\nPAUL:\n\nWell, I don't know about what I've decided yet, but if Governor Perry decides to run for president, I think there are three good reasons he could be president. You know, Texas is a bit successful state, he's a long-term governor. And I can't remember the third one but --\n\n(LAUGHTER)\n\nBOLLING:\n\nVery good. Very good, sir. Well done. Well done. We say thank you to Senator Rand Paul. Thank you for your time tonight. Very good.\n\nSEN. RAND PAUL, R-KY.\n\nERIC BOLLING, FOX NEWS ANCHOR", "images": ["http://www.cq.com/images/cq-logo-white-new.png", "http://www.cq.com/versioned/MjAyMjA5MTZfMTYyNTIwMjQ0/images/app-icon.png"], "top_img": "http://www.cq.com/versioned/MjAyMjA5MTZfMTYyNTIwMjQ0/images/app-icon.png", "keywords": [], "authors": [], "canonical_link": "", "title": "Sen. Paul Interviewed on Fox News", "meta_data": {"build-version": "unknown-TAG", "build-time": "unknown-1664650855511", "viewport": "initial-scale=1", "apple-itunes-app": "app-id=1022591312"}, "movies": [], "publish_date": null, "source": "http://www.cq.com", "summary": ""}