{"url": "https://variety.com/2016/tv/news/agents-of-shield-finale-season-3-episode-21-22-lincoln-dead-ward-hive-season-4-spoilers-1201777449/", "text": "SPOILERS: Do not read on unless you’ve seen the “Agents of SHIELD” Season 3 finale, Episodes 21 and 22, titled “Absolution” and “Ascension.”\n\n“Marvel’s Agents of SHIELD” capped off its Season 3 finale with a heartbreaking twist, which saw Lincoln (Luke Mitchell) sacrifice himself to take down Hive (Brett Dalton) — leaving both characters dead and Daisy (Chloe Bennet) devastated. But in true “SHIELD” fashion, the shocks didn’t stop there, as the episode then jumped ahead six months, revealing that Daisy was no longer with SHIELD, and Coulson (Clark Gregg) was no longer Director of the agency — with him and Mack (Henry Simmons) on the hunt for their former operative, who was traveling incognito and leaving a trail of seismic destruction in her wake. Elsewhere, Holden Radcliffe (John Hannah) was celebrating the “birth” of his Artificial Intelligence creation AIDA, in the form of a Life Model Decoy — a concept that Marvel fans have been anticipating ever since the show debuted.\n\nVariety spoke to showrunners Jed Whedon and Maurissa Tancharoen about losing Lincoln and Ward/Hive, the future of FitzSimmons and what’s ahead for the show in Season 4 following that time jump.\n\nBrett Dalton has certainly gone through the wringer over the past three seasons – with Hive being obliterated, are we finally losing him for good?\n\nTancharoen: In the Marvel universe, you can never say that you lose anyone for good; our entire series is centered around a man who was brought back from the dead. But we sustained Brett Dalton’s character as an antagonist for the past three seasons and that’s just a testament to how much we love and respect the actor as well as what he’s given to the character. But as with everything, we don’t want any story to ever lose steam; we don’t want any character’s arc to ever lose steam. We felt like we could give Grant Ward/Hive his glorious ending that he deserved, because Grant Ward essentially died halfway through Season 3, but we didn’t want to let go. [Laughs.]\n\nWhedon: We definitely want to leave people wanting more – we don’t want them to lose steam and we don’t want anybody to get burnt out on people always turning up, but I think that by the end, you’ll wish that he was around, which is our goal.\n\nTancharoen: It’s never an easy decision to kill off any of our characters.\n\nWhedon: Unless the actors were pricks, which in this case they aren’t, so that makes this very difficult. [Laughs.]\n\nIt was very poetic to see Daisy’s two love interests go out in a blaze of glory together, at least visually, even if Ward’s technically been gone for a while. Why did you decide to sacrifice Lincoln, out of all the possibilities?\n\nWhedon: The idea of sacrificing someone came up in talking about how to give Ward/Hive a glorious end. We didn’t want it to be just a victory, because you feel connected to Ward and to Brett as an actor – he was the first person we ever shot on the pilot, and so we wanted to give him a sort of poetic and worthy death, so we started talking about someone making the true hero’s sacrifice play, and in rattling around that idea, we landed on Lincoln because we find that there’s something sort of beautiful about someone doing the truly heroic act because they don’t believe that they’re a hero. He thinks the other people need to stay around to do good, so he’s doing it because he doesn’t think he’s a hero and in doing that, he becomes the ultimate hero. We loved that. And then there’s obviously the connection to Daisy and the emotional impact it’ll have on her, and the idea of him being a lost soul finally finding his purpose, all these things sort of led to [us thinking] it was the right thing to do for story, even though we like hanging out with Luke all the time.\n\nWhy did you decide to cap the finale off with a time jump rather than waiting until the Season 4 premiere?\n\nWhedon: We’ve done a time jump each new season and so we just thought “hey, let’s do it early!” We thought it was a fun way to get people excited and also to see the way the game will change without knowing totally what all of it means.\n\nDaisy is back on her own again – why was it the right time to take her back out of SHIELD?\n\nTancharoen: When we first met Daisy, formerly Skye, she came from a place of isolation, so we’re sort of returning her back to that point. She kept her distance from people; she grew up through the foster care system where she kept feeling like she was being either abandoned or hurting others, and in the events of our season finale and everything that led up to it, I think she has not only guilt but shame, so she has once again isolated herself.\n\nWhedon: But we also wanted to show that she did not curl up into a ball – she’s clearly isolating herself, but also leaving a wake of destruction. And how much good she’s doing as opposed to how much destruction she’s causing, we’ll wait and see, but I think you can tell from her interaction with the little girl that she’s trying to make good on her promise to help Inhumans and trying to [honor] what Lincoln said when he said he believed she was meant for more than this — I think she’s trying to honor his version of her.\n\nTancharoen: I think the audience can glean from that jump that we can have faith in the fact that she’s still out there doing good work.\n\nWith Daisy out in the cold, will we see much of the Inhumans next year?\n\nWhedon: Yeah, we love all those characters.\n\nTancharoen: We now have a fairly sizeable group to call upon if we need them.\n\nThe last scene also introduced the concept of Life Model Decoys – there’s obviously been a lot of speculation about that aspect of the Marvel universe since before the show even began, so why did it feel like now was right time to introduce them?\n\nWhedon: Partially, we’ve been waiting on it because we knew what was coming in the second “Avengers” movie so we didn’t want to hit that note before them. But it’s also a progression of… this year our theme was “Are you Inhuman?” and dealing with humans without powers and how they react to people given powers, whether or not it ruins them or how that affects their humanity. So now our next progression is “what’s beyond humanity,” and what if you can take those choices into your own hands – what will happen then?\n\nTancharoen: I think over the course of the three seasons, we’ve been exploring what is possibly the next step in human evolution constantly, and with the introduction of Radcliffe as someone who’s already exploring that next step. And it’s also very much a part of our real world right now, body modification is a huge part of popular culture, so it’s our way of opening up that world within the world of “SHIELD.”\n\nDoes that mean we can expect John Hannah to be a major presence in Season 4?\n\nTancharoen: Yeah, it would really be a bummer to see him just disappear. [Laughs.]\n\nIt sounds like we’re also jumping into FitzSimmons finally being in an actual relationship – what will their dynamic be like next season?\n\nWhedon: Obviously, relationships are complicated, especially when you work within a spy organization. We hoped at the end of this year to put them in that position… one of the best things about FitzSimmons was hoping they would get together, and so when you put them together, you lose the hope that they will get together. We have to move on to a new thing and I think we’re trying to give them a relationship that’s based on a friendship, which is what we loved about them initially, but as they move forward, I think things will find themselves to be much more complicated than that.\n\nTancharoen: Our relationships on the show don’t really fare very well. We have many examples, Coulson and Rosalind, May and Andrew, Daisy and Ward and Lincoln… but I think FitzSimmons always gives us hope in the ideal notion of romance and love… But don’t hold on to that hope, ever, I think. [Laughs.]\n\nSince “SHIELD” spinoff “Marvel’s Most Wanted” isn’t going ahead, will we see Bobbi and Lance back next season?\n\nTancharoen: We adore those characters and we’re always open to that possibility, but we can’t say much on that subject right now.\n\nHow would you say this season’s experiences have affected Coulson as a leader, and where does he go from here?\n\nWhedon: He made some decisions as Director that he regrets, and I think heavy is the head that wears the crown – he didn’t enjoy being the one calling the shots and putting people in danger, even at the end, tried to take it all on himself. But now we see in the flashforward that he’s no longer Director, so we’re returning him, as we are with Daisy, a little bit to where we started. He’s in the field as Agent Coulson; how that changes the game or changes how he operates, we’ll have to wait and see.\n\nWhat did you think of the “Agents of SHIELD” Season 3 finale and what do you hope to see in Season 4? Weigh in below!", "images": ["https://variety.com/wp-content/themes/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://variety.com/wp-content/uploads/2016/05/143256_4364.jpg?w=681&h=383&crop=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://variety.com/wp-content/uploads/2016/05/143256_4364.jpg?w=1000"], "top_img": "https://variety.com/wp-content/uploads/2016/05/143256_4364.jpg?w=1000", "keywords": [], "authors": ["Laura Prudom"], "canonical_link": "https://variety.com/2016/tv/news/agents-of-shield-finale-season-3-episode-21-22-lincoln-dead-ward-hive-season-4-spoilers-1201777449/", "title": "‘Agents of SHIELD’ Finale: Bosses Break Down Deaths, Time Jump and Final Scene", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://variety.com/wp-content/themes/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Agents of SHIELD's Season 3 finale left two characters dead before jumping forward in time, setting up big mysteries for Season 4 (SPOILERS)", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199, "pages": 12616252196}, "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1201777449, "author": "Laura Prudom", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2016-05-17T23:00:46"}, "pmc-tag": "ABC,Agents of SHIELD,Jed Whedon,Marvel's Agents of SHIELD", "title": "‘Agents of SHIELD’ Finale: Bosses Break Down Deaths, Time Jump and Final Scene", "pageclass": "article", "pmc-vertical": "tv", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-primary-category": "News", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress 6.0.2", "author": "Laura Prudom", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Variety", "application-name": "Variety", "content_type": "Article", "post_id": 1201777449, "title": "'Agents of SHIELD' Finale: Bosses Break Down Deaths, Time Jump and Final Scene", "published_at": "2016-05-17 23:00:46", "image": "https://variety.com/wp-content/uploads/2016/05/143256_4364.jpg?w=1000", "comment_count": 37, "tags": "Marvel's Agents of SHIELD", "topics": "News", "appeared_in_print": "No", "body": "SPOILERS: Do not read on unless you've seen the \"Agents of SHIELD\" Season 3 finale, Episodes 21 and 22, titled \"Absolution\" and \"Ascension.\"\r\n\r\n\"Marvel's Agents of SHIELD\" capped off its Season 3 finale with a heartbreaking twist, which saw Lincoln (Luke Mitchell) sacrifice himself to take down Hive (Brett Dalton) -- leaving both characters dead and Daisy (Chloe Bennet) devastated. But in true \"SHIELD\" fashion, the shocks didn't stop there, as the episode then jumped ahead six months, revealing that Daisy was no longer with SHIELD, and Coulson (Clark Gregg) was no longer Director of the agency -- with him and Mack (Henry Simmons) on the hunt for their former operative, who was traveling incognito and leaving a trail of seismic destruction in her wake. Elsewhere, Holden Radcliffe (John Hannah) was celebrating the \"birth\" of his Artificial Intelligence creation AIDA, in the form of a Life Model Decoy -- a concept that Marvel fans have been anticipating ever since the show debuted.\r\n\r\nVariety spoke to showrunners Jed Whedon and Maurissa Tancharoen about losing Lincoln and Ward/Hive, the future of FitzSimmons and what's ahead for the show in Season 4 following that time jump.\r\n\r\nBrett Dalton has certainly gone through the wringer over the past three seasons – with Hive being obliterated, are we finally losing him for good?\r\n\r\nTancharoen: In the Marvel universe, you can never say that you lose anyone for good; our entire series is centered around a man who was brought back from the dead. But we sustained Brett Dalton’s character as an antagonist for the past three seasons and that’s just a testament to how much we love and respect the actor as well as what he’s given to the character. But as with everything, we don’t want any story to ever lose steam; we don’t want any character’s arc to ever lose steam. We felt like we could give Grant Ward/Hive his glorious ending that he deserved, because Grant Ward essentially died halfway through Season 3, but we didn’t want to let go. [Laughs.]\r\n\r\nWhedon: We definitely want to leave people wanting more – we don’t want them to lose steam and we don’t want anybody to get burnt out on people always turning up, but I think that by the end, you’ll wish that he was around, which is our goal.\r\n\r\nTancharoen: It’s never an easy decision to kill off any of our characters.\r\n\r\nWhedon: Unless the actors were pricks, which in this case they aren’t, so that makes this very difficult. [Laughs.]\r\n\r\nIt was very poetic to see Daisy’s two love interests go out in a blaze of glory together, at least visually, even if Ward's technically been gone for a while. Why did you decide to sacrifice Lincoln, out of all the possibilities?\r\n\r\nWhedon: The idea of sacrificing someone came up in talking about how to give Ward/Hive a glorious end. We didn’t want it to be just a victory, because you feel connected to Ward and to Brett as an actor – he was the first person we ever shot on the pilot, and so we wanted to give him a sort of poetic and worthy death, so we started talking about someone making the true hero's sacrifice play, and in rattling around that idea, we landed on Lincoln because we find that there’s something sort of beautiful about someone doing the truly heroic act because they don’t believe that they’re a hero. He thinks the other people need to stay around to do good, so he’s doing it because he doesn’t think he’s a hero and in doing that, he becomes the ultimate hero. We loved that. And then there’s obviously the connection to Daisy and the emotional impact it’ll have on her, and the idea of him being a lost soul finally finding his purpose, all these things sort of led to [us thinking] it was the right thing to do for story, even though we like hanging out with Luke all the time.\r\n\r\nWhy did you decide to cap the finale off with a time jump rather than waiting until the Season 4 premiere?\r\n\r\nWhedon: We’ve done a time jump each new season and so we just thought “hey, let’s do it early!” We thought it was a fun way to get people excited and also to see the way the game will change without knowing totally what all of it means.\r\n\r\nDaisy is back on her own again – why was it the right time to take her back out of SHIELD?\r\n\r\nTancharoen: When we first met Daisy, formerly Skye, she came from a place of isolation, so we’re sort of returning her back to that point. She kept her distance from people; she grew up through the foster care system where she kept feeling like she was being either abandoned or hurting others, and in the events of our season finale and everything that led up to it, I think she has not only guilt but shame, so she has once again isolated herself.\r\n\r\nWhedon: But we also wanted to show that she did not curl up into a ball – she’s clearly isolating herself, but also leaving a wake of destruction. And how much good she’s doing as opposed to how much destruction she’s causing, we’ll wait and see, but I think you can tell from her interaction with the little girl that she’s trying to make good on her promise to help Inhumans and trying to [honor] what Lincoln said when he said he believed she was meant for more than this -- I think she’s trying to honor his version of her.\r\n\r\nTancharoen: I think the audience can glean from that jump that we can have faith in the fact that she’s still out there doing good work.\r\n\r\n\r\n\r\nWith Daisy out in the cold, will we see much of the Inhumans next year?\r\n\r\nWhedon: Yeah, we love all those characters.\r\n\r\nTancharoen: We now have a fairly sizeable group to call upon if we need them.\r\n\r\nThe last scene also introduced the concept of Life Model Decoys – there’s obviously been a lot of speculation about that aspect of the Marvel universe since before the show even began, so why did it feel like now was right time to introduce them?\r\n\r\nWhedon: Partially, we’ve been waiting on it because we knew what was coming in the second “Avengers” movie so we didn’t want to hit that note before them. But it’s also a progression of… this year our theme was “Are you Inhuman?” and dealing with humans without powers and how they react to people given powers, whether or not it ruins them or how that affects their humanity. So now our next progression is \"what’s beyond humanity,\" and what if you can take those choices into your own hands – what will happen then?\r\n\r\nTancharoen: I think over the course of the three seasons, we’ve been exploring what is possibly the next step in human evolution constantly, and with the introduction of Radcliffe as someone who’s already exploring that next step. And it’s also very much a part of our real world right now, body modification is a huge part of popular culture, so it’s our way of opening up that world within the world of “SHIELD.”\r\n\r\nDoes that mean we can expect John Hannah to be a major presence in Season 4?\r\n\r\nTancharoen: Yeah, it would really be a bummer to see him just disappear. [Laughs.]\r\n\r\nIt sounds like we’re also jumping into FitzSimmons finally being in an actual relationship – what will their dynamic be like next season?\r\n\r\nWhedon: Obviously, relationships are complicated, especially when you work within a spy organization. We hoped at the end of this year to put them in that position… one of the best things about FitzSimmons was hoping they would get together, and so when you put them together, you lose the hope that they will get together. We have to move on to a new thing and I think we’re trying to give them a relationship that’s based on a friendship, which is what we loved about them initially, but as they move forward, I think things will find themselves to be much more complicated than that.\r\n\r\nTancharoen: Our relationships on the show don’t really fare very well. We have many examples, Coulson and Rosalind, May and Andrew, Daisy and Ward and Lincoln… but I think FitzSimmons always gives us hope in the ideal notion of romance and love... But don’t hold on to that hope, ever, I think. [Laughs.]\r\n\r\nSince \"SHIELD\" spinoff \"Marvel’s Most Wanted\" isn’t going ahead, will we see Bobbi and Lance back next season?\r\n\r\nTancharoen: We adore those characters and we’re always open to that possibility, but we can’t say much on that subject right now.\r\n\r\nHow would you say this season’s experiences have affected Coulson as a leader, and where does he go from here?\r\n\r\nWhedon: He made some decisions as Director that he regrets, and I think heavy is the head that wears the crown – he didn’t enjoy being the one calling the shots and putting people in danger, even at the end, tried to take it all on himself. But now we see in the flashforward that he’s no longer Director, so we’re returning him, as we are with Daisy, a little bit to where we started. He’s in the field as Agent Coulson; how that changes the game or changes how he operates, we’ll have to wait and see.\r\n\r\nWhat did you think of the \"Agents of SHIELD\" Season 3 finale and what do you hope to see in Season 4? Weigh in below!", "fragment": "!", "og": {"type": "article", "title": "‘Agents of SHIELD’ Finale: Bosses Break Down Deaths, Time Jump and Final Scene", "url": "https://variety.com/2016/tv/news/agents-of-shield-finale-season-3-episode-21-22-lincoln-dead-ward-hive-season-4-spoilers-1201777449/", "description": "SPOILERS: Do not read on unless you’ve seen the “Agents of SHIELD” Season 3 finale, Episodes 21 and 22, titled “Absolution” and “Ascension.” “Marvel&…", "site_name": "Variety", "image": {"identifier": "https://variety.com/wp-content/uploads/2016/05/143256_4364.jpg?w=1000", "width": 1000, "height": 667, "alt": "agents of shield finale lincoln dead ward season 4 spoilers"}, "locale": "en_US"}, "article": {"published_time": "2016-05-18T06:00:46+00:00", "modified_time": "2016-05-18T06:05:57+00:00"}, "twitter": {"site": "@variety", "creator": "@lauinla", "card": "summary_large_image", "title": "‘Agents of SHIELD’ Finale: Bosses Break Down Deaths, Time Jump and Final Scene", "description": "Agents of SHIELD's Season 3 finale left two characters dead before jumping forward in time, setting up big mysteries for Season 4 (SPOILERS)", "image": "https://variety.com/wp-content/uploads/2016/05/143256_4364.jpg?w=1000"}}, "movies": [], "publish_date": 1463551246.0, "source": "https://variety.com", "summary": ""}