{"url": "https://people.com/celebrity/harvey-weinstein-scandal-gallery/", "text": "01 of 67 ANNE HECHE Dominik Magdziak Photography/Getty Anne Heche is among the many actresses allegedly victimized by Harvey Weinstein. The Blackout star revealed that she was fired from a film project after refusing to perform oral sex on the disgraced mogul. “I personally did not suck Harvey’s d—, although he showed it to me and I got out of the room before there was any physical contact,” she said on the Allegedly with Theo Vonn & Matthew Cole Weiss podcast. “The fact is, I was fired from a job that I had been hired for in Miramax,” she continued, referring to the production company founded by Weinstein and his brother Bob. “The repercussions of standing up for yourself were as deep and targeted as some of the scars of the women who actually got more physically, unfortunately, involved.” A spokesperson for Weinstein previously told PEOPLE in a statement that “any allegations of non-consensual sex are unequivocally denied by Mr. Weinstein. Mr. Weinstein has further confirmed that there were never any acts of retaliation against any women for refusing his advances.”\n\n02 of 67 SALMA HAYEK J. Vespa/WireImage In an emotional New York Times op ed, the 51-year-old actress detailed her experiences with Weinstein through the course of the making of the 2002 Miramax Frida Kahlo biopic Frida — claiming, among other things, that he had once threatened to kill her when she refused his advances. “The range of his persuasion tactics went from sweet-talking me to that one time when, in an attack of fury, he said the terrifying words, ‘I will kill you, don’t think I can’t,'” she claimed.\n\n03 of 67 PAZ DE LA HUERTA Noam Galai/WireImage; Jason Merritt/Getty De la Huerta, 33, told Vanity Fair that Weinstein, 65, had allegedly raped her twice in 2010. The actress was 26 at the time the alleged incidents occurred. She told Vanity Fair she “did say no” to Weinstein’s advances, adding, “When he was on top of me I said, ‘I don’t want to do this.’ He kept humping me and it was disgusting. He’s like a pig… He raped me.” A rep for Weinstein told PEOPLE in a statement that “any allegations of non-consensual sex are unequivocally denied by Mr. Weinstein.”\n\n04 of 67 SEAN YOUNG Stephen Lovekin/Getty; Neilson Barnard/Getty Blade Runner actress Sean Young claims the movie mogul exposed himself to her in the early 1990s while working on Love Crimes, which was produced by Miramax. “I personally experienced him pulling his you-know-what out of his pants to shock me,” she said on the Dudley and Bob with Matt Show podcast Thursday. “My basic response was, ‘You know, Harvey, I really don’t think you should be pulling that thing out, it’s not very pretty. ‘” The actress said she never worked with Weinstein again after the alleged incident.\n\n05 of 67 BRIT MARLING Joe Scarnici/WireImage Brit Marling, the star and creator of Netflix series The OA wrote a powerful, first-person essay for The Atlantic, detailing an alleged encounter she had with Weinstein after the Sundance Film Festival in 2011, where Marling had co-written and starred in two films. In the piece, Marling claimed Weinstein asked if she wanted to “shower together” — and detailed her “fear” of offending Weinstein, “who could anoint or destroy me.” In her essay, Marling also noted how Weinstein’s alleged sexual misconduct with numerous women should be thought of through the lens of the “economics of consent.” “Weinstein was a gatekeeper who could give actresses a career that would sustain their lives and the livelihood of their families,” she wrote. “He could also give them fame, which is one of few ways for women to gain some semblance of power and voice inside a patriarchal world. They knew it. He knew it. Weinstein could also ensure that these women would never work again if they humiliated him. That’s not just artistic or emotional exile—that’s also economic exile.”\n\n06 of 67 DOMINIQUE HUETT Jamie McCarthy/Getty; Venturelli/WireImage In a lawsuit, actress Dominique Huett claims she first met the disgraced mogul at the bar of the Peninsula Hotel in Beverly Hills in November 2010. She says the producer told her he could help with her acting career and asked to see her breasts, saying it would be beneficial for her career if she did not have implants. The court documents claim that Weinstein asked Huett up to his room for what he said would be a business meeting before disappearing into the bathroom and returning in only a robe. She then says that he began demanding a massage, which she performed for him after some initial back-and-forth. Weinstein asked if he could perform oral sex on her and would not take “no” for an answer, the court documents state. “Weinstein insisted and the Plaintiff froze as Weinstein removed her clothing and performed oral sex on her … for several minutes,” it is claimed in the document. Huett’s lawsuit also targets The Weinstein Company because she claims that prior to the 2010 incident, the company “had actual knowledge of Weinstein’s repeated acts of sexual misconduct with women.” In particular, the suit claims TWC was “aware of Weinstein’s pattern of using his power to coerce and force young actresses to engage in sexual acts with him.”\n\n07 of 67 MIMI HALEYI Seth Wenig/AP Mimi Haleyi, a former production assistant, claimed that Weinstein “orally forced himself” on her in 2006 when she was in her 20s. “He even pulled my tampon out; I was in disbelief,” she said during a press conference alongside her attorney, Gloria Allred.\n\n08 of 67 LUPITA NYONG'O Pascal Le Segretain/Getty;Alexander Koerner/Getty In an emotional op-ed published in The New York Times, the Oscar-winning actress details a series of alleged uncomfortable encounters with the disgraced mogul dating back to her days at the Yale School of Drama. Now, she says, “I am most interested in now is combating the shame we go through that keeps us isolated and allows for harm to continue to be done. I wish I had known that there were women in the business I could have talked to. I wish I had known that there were ears to hear me. That justice could be served. There is clearly power in numbers. I thank the women who have spoken up and given me the strength to revisit this unfortunate moment in my past.”\n\n09 of 67 QUENTIN TARANTINO Jeff Kravitz/FilmMagic In an interview published by The New York Times, the director admitted that he knew about some of the sexual assault allegations leveled against Weinstein long before the producer became embroiled in the recent controversy. He revealed to the paper that his ex-girlfriend Mira Sorvino had once told him about her alleged incident with the movie mogul — and that he also knew about the settlement Weinstein had reportedly reached with Rose McGowan.\n\n10 of 67 MOLLY RINGWALD Brian Killian/WireImage In a personal essay for the New Yorker, Ringwald recounts her first and only experience working with Weinstein on the 1990 film Strike It Back. The low-budget British movie was one of the then-up-and-coming producer’s first efforts, while Ringwald signed on as an established star — a dynamic, the actress writes, which is partly the reason she “wasn’t cajoled into a taxi” or forced “to turn down giving or getting a massage.” (Ringwald is referencing dozens of allegations of sexual misconduct made against Weinstein. Weinstein, through a representative, has denied any allegations of non-consensual sex.) Instead, Ringwald says she witnessed Weinstein’s “volatile” behavior in other ways — the way he “became testy” towards one of their British colleagues, or gradually snatched control of the film away from the director and writer — and had a financial disagreement unpleasant enough to convince her to stay away from him for good. “My lawyer called to tell me that I had been denied the [gross] percentage owed to me,” she writes. “She asked if it was O.K. if she went after the Weinsteins. I ended up suing them for the money, which I got, and I never worked with Harvey or the company again.”\n\n11 of 67 SKEET ULRICH Harmony Gerber/WireImage “I knew. Most people knew,” the actor, who worked with Weinstein on Scream, told Cosmopolitan about the producer's alleged behavior. “I had dinner with someone who is one of the most famous women on the planet — I won’t say who it is — who has not come out, who told me similar things. … There is nothing you can do. I mean, what am I gonna do? I can’t step up, certainly then, on allegations. Honestly, and I think it’s what most people faced: How do you cut your livelihood from a very powerful corporation on something that you don’t know what the facts are?”\n\n12 of 67 WOODY ALLEN Kevin Winter/Getty Image Allen received backlash after he said he was “sad” for everyone involved in the Weinstein scandal. “Tragic for the poor women that were involved, sad for Harvey that [his] life is so messed up,” Allen, 81, told the BBC. “There’s no winners in that, it’s just very, very sad and tragic for these poor women that had to go through that.” The filmmaker has since clarified his comments, calling Weinstein a “sad, sick man.” “When I said I felt sad for Harvey Weinstein I thought it was clear the meaning was because he is a sad, sick man,” Allen said in a new statement to Variety. “I was surprised it was treated differently. Lest there be any ambiguity, this statement clarifies my intention and feelings.”\n\n13 of 67 MARION COTILLARD The Oscar winner expressed \"respect\" for \"the brave women who have spoke up\" and \"are hopefully opening a new chapter,\" in an Instagram post. \"This is the time to unfold and deconstruct a horrifying system,\" wrote the actress. This is the time we, women AND men, denounce it loud so that we create a profound change and those terrifying things never happen again.\"\n\n14 of 67 EMMA THOMPSON Rich Polk/Getty Images for IMDb Thompson labeled Weinstein a \"predator\" in an interview with BBC Newsnight, and said she didn't know about the allegations against the movie mogul before they came to light in the New York Times. “I didn’t know about these things, but they don’t surprise me at all, and they’re endemic to the system,” the Oscar winner said. \"What I find sort of extraordinary is that this man is at the top of a very particular iceberg, you know he’s — I don’t think you can describe him as a ‘sex addict,’ he’s a predator.\" She also seemed to reference President Donald Trump, saying: \"This has been part of our world, women’s world, since time immemorial. So what we need to start talking about is the crisis in masculinity, the crisis of extreme masculinity, which is this sort of behavior, and the fact that it is not only OK, but it also is represented by the most powerful man in the world at the moment.”\n\n15 of 67 RYAN GOSLING Dave M. Benett/Getty Images On Twitter, Gosling — who starred in the Weinstein Company movie Blue Valentine in 2010 — denounced the producer and gave support to the women who spoke out against him. \"Like most people in Hollywood, I have worked with him and I'm deeply disappointed in myself for being so oblivious to these devastating experiences of sexual harassment and abuse,\" he wrote. \"He is emblematic of a systemic problem. Men should stand with women and work together until there is real accountability and change.\"\n\n16 of 67 JULIA ROBERTS Jeff Vespa/Getty Images for PSIFF In a statement to PEOPLE, Roberts spoke out about the Weinstein scandal, saying that she hopes society will do better in standing up to those who commit sexual harassment and assault. “A corrupt, powerful man wields his influence to abuse and manipulate women,\" she said. \"We’ve heard this infuriating, heartbreaking story countless times before. And now here we go again. I stand firm in the hope that we will finally come together as a society to stand up against this kind of predatory behavior, to help victims find their voices and their healing, and to stop it once and for all.\"\n\n17 of 67 KATE BECKINSALE Dave Benett/Getty The Underworld star detailed her own alleged experiences with Weinstein in an emotional Instagram post. She said that when she was 17, she met with the producer at the Savoy Hotel in London, thinking they'd meet in a conference room. Instead, she says that she was directed up to his hotel room, and he answered the door in a bathrobe. \"I was incredibly naive and young and it did not cross my mind that this older, unattractive man would expect me to have any sexual interest in him,\" she wrote. \"After declining alcohol and announcing that I had school in the morning I left, uneasy but unscathed.\" She says that years later, Weinstein spoke to her about their past meeting, and asked if he had \"tried anything.\" She says: \"I realized he couldn't remember if he had assaulted me or not.\" Beckinsale also says that turning down Weinstein professionally often ended in verbal abuse, and she felt, hurt her professionally. \"I said no to him professionally many times over the years-some of which ended up with him screaming at me calling me a cunt and making threats,\" she wrote. \"It speaks to the status quo in this business that I was aware that standing up for myself and saying no to things, while it did allow me to feel uncompromised in myself, undoubtedly harmed my career and was never something I felt supported by anyone other than my family.\"\n\n18 of 67 ANNETTE BENING Jeff Spicer/Getty Images At the premiere of her new movie Film Stars Don't Die at the BFI London Film Festival in Liverpool, Bening told the U.K.'s Press Association that she hopes the Weinstein allegations will inspire change in Hollywood. \"Maybe it's a tipping point, that's my hope, that there is a real cultural shift,\" she said, according to the Birmingham Mail. \"I mean I don't think it's going to be overnight but there is a new and different understanding and awareness of what that kind of behavior means and for women to be able to stand up and be open, that takes such courage and they deserve all the credit and in this case I think the right thing is happening. I just hope it's opened awareness maybe a little bit more, for people to understand how difficult it is when you're in that position as a woman, as a young woman, as a vulnerable woman, as a woman who needs a job.\"\n\n19 of 67 FLORENCE DAREL Pascal Le Segretain/Getty; Alexander Koerner/Getty In the mid-'90s, Weinstein allegedly came on to French actress Darel, she says, with his then-wife Eve Chilton, in the room next door at the Paris Ritz. Darel claims he invited her up to his suite, and though Darel was nervous, her agent encouraged her to go. Though at first, they discussed business, Darel says that Weinstein then told her he wanted to have sex with her, implying that she needed to in order to work as an actress in the U.S. “I was in shock. I was in shock,” Darel told PEOPLE of the alleged incident. “I was astonished. When you have someone so physically disgusting in front of you, continuing and continuing as though this was all perfectly normal… What happened to me may not be illegal but it was inappropriate. Very inappropriate.”\n\n20 of 67 TOM HANKS The Late Show/Twitter Hanks hit back at Weinstein's original statement that he made after the publication of the initial bombshell report in the New York Times. In the statement, Weinstein says that his behavior was partially due to the time he grew up in. “I came of age in the 60’s and 70’s, when all the rules about behavior and workplaces were different. That was the culture then,” he said in the statement. “I have since learned it’s not an excuse, in the office – or out of it. To anyone.” Hanks, who is four years younger than Weinstein, said that he doesn't buy that. “I’ve never worked with Harvey,” said Hanks. “But, aah, it all just sort of fits, doesn’t it? Isn’t it part and parcel to all of society somehow, that people in power get away with this? Look, I don’t want to rag on Harvey but so obviously something went down there. You can’t buy, ‘Oh, well, I grew up in the ’60s and ’70s and so therefore…’ I did, too.”\n\n21 of 67 BLAKE LIVELY Jamie McCarthy/Getty In an interview with The Hollywood Reporter, Lively says that she never had any negative experiences with Weinstein, but that hearing other women's stories has been \"devastating.\" \"That was never my experience with Harvey in any way whatsoever, and I think that if people heard these stories … I do believe in humanity enough to think that this wouldn't have just continued,\" she said. \"I never heard any stories like this — I never heard anything specific — but it's devastating to hear.\" She also encouraged people to listen to those who come forward with allegations of harassment or assault. \"The number one thing that can happen is that people who share their stories, people have to listen to them and trust them, and people have to take it seriously,\" she added. \"As important as it is to remain furious about this, it's important to also say that this exists everywhere so remember to look everywhere. This isn't a single incident. This cannot happen, this should not happen, and it happens in every single industry.\"\n\n22 of 67 ASHLEY JUDD Jim Spellman/WireImage; CJ Rivera/Getty Ashley Judd was one of the women who initally spoke out against Weinstein in an explosive expose published by The New York Times on Thursday. The actress claimed Weinstein showed up to their business meeting at a Los Angeles hotel wearing a bathrobe and later asked her to watch him shower. “I said no, a lot of ways, a lot of times, and he always came back at me with some new ask,\" Judd told the NYT. “It was all this bargaining, this coercive bargaining.”\n\n23 of 67 ROSE MCGOWAN Harvey Weinstein with Rose McGowan in 2007. Jeff Vespa/WireImage Although Rose McGowan —who reportedly reached a settlement with Weinstein after an encounter in a hotel room with him in 1997 during the Sundance Film Festival — declined to comment to the NYT, she’s spoken out against the Hollywood mogul extensively on Twitter since Thursday. “Anyone who does business with __ is complicit. And deep down you know you are even dirtier. Cleanse yourselves.\"\n\n24 of 67 ASIA ARGENTO Denise Truscello/WireImage Argento, an Italian actress, told the New Yorker that Weinstein allegedly performed oral sex on her without her consent. He invited her, she claims, to what she thought was a Miramax party at a hotel. When she got there, she says, only Weinstein was present, and the \"gathering\" was in a hotel room. \"He asks me to give a massage. I was, like, ‘Look man, I am no f—–g fool,’ ” Argento told the New Yorker. “But, looking back, I am a f—–g fool. And I am still trying to come to grips with what happened.\" After she reluctantly agreed to give him a massage, he pried her legs apart and forcibly performed oral sex on her, Argento claims. \"It wouldn’t stop,\" she said. \"It was a nightmare.” She stayed silent for years out of fear and feelings of responsibility, she says, and later had consensual sex with Weinstein multiple times because she felt he would ruin her career if she didn't. \"The thing with being a victim is I felt responsible,\" Argento told the magazine. \"Because if I were a strong woman, I would have kicked him in the balls and run away. But I didn’t. And so I felt responsible.”\n\n25 of 67 GWYNETH PALTROW Dave Benett/Getty In an interview with the New York Times, Paltrow alleged that Weinstein — who gave her what would end up being her breakout role, as the title character in Emma — harassed her at the beginning of her career. She said that he invited her to his room at the Peninsula Beverly Hills hotel for a meeting. After she arrived, she said that he placed his hands on her and suggested they move to the bedroom for massages. She said no and left. “I was a kid, I was signed up, I was petrified,” she told the Times of the experience. Later, she told her then-boyfriend, Brad Pitt of the encounter. Pitt spoke to Weinstein about the alleged incident, and Weinstein \"screamed\" at Paltrow, she said, telling her not to talk to anyone else about it. At the time, she said, she felt she was “expected to keep the secret.” Paltrow decided to come forward because she wants other women to feel less alone. “We’re at a point in time when women need to send a clear message that this is over,” she said. “This way of treating women ends now.”\n\n26 of 67 ANGELINA JOLIE Karwai Tang/WireImage Jolie told the New York Times that she had a negative encounter with Weinstein, in which he allegedly harassed her in a hotel room, in the early years of her career, after the release of her film Playing by Heart. “I had a bad experience with Harvey Weinstein in my youth, and as a result, chose never to work with him again and warn others when they did,” Jolie told the paper. “This behavior towards women in any field, any country is unacceptable.”\n\n27 of 67 ROSANNA ARQUETTE Rosanna Arquette. Tara Ziemba/Getty Arquette opened up about her own alleged experience with Weinstein to both the New York Times and the New Yorker. She said that Weinstein invited her to his hotel room to grab a script for a potential part. She found him, she said, in a bathrobe in his room. He asked her for a massage, and when she tried to rebuff his advances, he pulled her hand toward his penis, Arquette claimed. She pulled away, and he told her that she was making a mistake, naming women that he had supposedly slept with, she told the papers. “My heart was really racing. I was in a fight-or-flight moment,” Arquette told the New Yorker of the experience. She says that her career took a hit after their encounter, and that Weinstein was vindictive. “He’s going to be working very hard to track people down and silence people,” she said. “To hurt people. That’s what he does.”\n\n28 of 67 MIRA SORVINO Billy Farrell/Patrick McMullan/Getty Sorvino won an Oscar for Mighty Aphrodite, a Weinstein film, in 1996. While promoting the film at the Toronto International Film Festival in 1995, she says that Weinstein harassed her in a hotel room, giving her a massage and following her around the room, she told the New Yorker. The actress left the room and told him it was against her religion to date a married man, as Weinstein was married at the time. After a few weeks passed, he then tried to come to her apartment in New York City, she said. Sorvino told him her boyfriend was on his way over when Weinstein arrived, and he left shortly thereafter, according to her story. Sorvino eventually told a female Miramax employee about the encounters; the employee reacted with \"shock and horror.\" Sorvino said that she believes both turning Weinstein down and telling the employee hurt her career. “There may have been other factors, but I definitely felt iced out and that my rejection of Harvey had something to do with it.”\n\n29 of 67 CARA DELEVINGNE Ken McKay/ITV/REX/Shutterstock Model turned actress Delevingne released a statement to reporter Yashar Ali recounting her own alleged negative interaction with Weinstein. She said that early on in her acting career, Weinstein called her and asked if she had ever had sex with any of the women she had been seen with, and told her that if she was gay, she'd never \"make it\" as an actress. At a meeting years later, Delevingne claimed, Weinstein boasted about sleeping with different actresses, and then invited her up to his room. \"I quickly declined and asked his assistant if my car was outside,\" she said of the alleged incident in the statement. \"She said it wasn't and wouldn't be for a bit and I should go to his room.. At that moment I felt very powerless and scared but didn't want to act that way hoping I was wrong about the situation.\" In the room, there was another woman, said the actress, and Weinstein encouraged them to kiss. She quickly left, despite him trying to kiss her on the lips goodbye, said Delevingne. \"I still got the part for the film and always thought that he gave it to me because of what happened,\" she said. \"I was so hesitant about speaking out…I didn't want to hurt his family. I felt guilty as if I did something wrong. I was also terrified that this sort of thing had happened to so many women I know but no one had said anything because of fear.”\n\n30 of 67 VIOLA DAVIS Steve Granitz/WireImage The Oscar winner released a statement on Oct. 10 about Weinstein, calling him a \"predator\" and telling victims of sexual harassment and assault that she is there for them. “The predator wants your silence. It feeds their power, entitlement AND they want it to feed your shame,\" she said in the statement. “Our bodies are not the ‘spoils of war’… a trophy to be collected to fuel your ego. It’s OURS!!! It doesn’t belong to you!! And when you take it without permission, it DESTROYS…… like a virus!!! To the predators.. Weinstein, the stranger, the relative, the boyfriend…. I say to you, ‘You can choose your sin but you don’t get to choose the consequences.’ To the victims…. I see you. I believe you… and I’m listening.\"\n\n31 of 67 HEATHER GRAHAM Matt Winkelmeyer/Getty Graham added her name to the growing list of women who have opened up about alleged inappropriate encounters with Weinstein on Oct. 10, in an article for Variety. She said that in the early aughts, Weinstein called her and said he wanted her to act in one of his movies. He then told her that he had an arrangement with his wife at the time that Weinstein could sleep with other women when he was out of town, according to Graham. The interaction made the Boogie Nights star uncomfortable, she said: \"There was no explicit mention that to star in one of those films I had to sleep with him, but the subtext was there.\" He later invited her for a meeting at his hotel. Feeling nervous to go to his hotel alone, she invited a friend to accompany her. When the friend was no longer able to make it, she told Weinstein she couldn't either. She never ended up acting in one of his films, or spoke out about the alleged incident. \"It wasn’t until Ashley Judd heroically shared her story a few days ago that I felt ashamed,\" she said. \"If I had spoken up a decade ago, would I have saved countless women from the same experience I had or worse? While I still do feel guilty for not speaking up all those years ago, I’m glad for this moment of reckoning. To the countless other women who have experienced the gray areas: I believe you.\"\n\n32 of 67 DONNA KARAN Matt Baron/REX/Shutterstock; Venturelli/WireImage A longtime friend of Weinstein, Karan initially seemed to stand up for Weinstein in a video interview on the Daily Mail, where she said that women might be \"asking\" for the treatment Weinstein is being accused of. “You look at everything all over the world today and how women are dressing and what they are asking by just presenting themselves the way they do. What are they asking for? Trouble,” she said. However, later on, she said her statements had been taken out of context and apologized to anyone she may have offended. “My statements were taken out of context and do not represent how I feel about the current situation concerning Harvey Weinstein,\" she said. \"I believe that sexual harassment is NOT acceptable and this is an issue that MUST be addressed once and for all regardless of the individual. I am truly sorry to anyone that I offended and everyone that has ever been a victim.”\n\n33 of 67 NATHAN LANE David M. Benett/Getty Images; David Fisher/REX/Shutterstock Amid the allegations of sexual harassment against Harvey Weinstein, Nathan Lane said Weinstein threw him against a wall at Hillary Clinton’s birthday party. During an interview at the New Yorker Festival on Saturday night, Lane recalled firing back, “You can’t hurt me, I don’t have a film career.”\n\n34 of 67 REBECCA TRAISTER Nicholas Hunt/Getty On Thursday, journalist Rebecca Traister wrote a story for New York Magazine about how in 2000 Weinstein allegedly called her a “c—t” and pushed her coworker down the steps after he tried to intervene on her behalf.\n\n35 of 67 LINDSAY LOHAN E. Charbonneau/WireImage One person in Weinstein's corner is Lohan, who said in a now-deleted Instagram story video that she feels bad for Weinstein, and thinks his wife, Georgina Chapman (who has announced she is leaving him), should defend him. \"I feel very bad for Harvey Weinstein right now, I don't think it's right what's going on,\" Lohan said. \"I think Georgina needs to take a stand and be there for her husband,\" she continued. In another video, with the word \"Harvey\" and an angel emoji over it, she said: \"He’s never harmed me or did anything to me. We’ve done several movies together. I think everyone needs to stop. I think it’s wrong. So, stand up.”\n\n36 of 67 MERYL STREEP Frazer Harrison/Getty On Monday, Meryl Streep spoke out against her frequent collaborator saying, “the disgraceful news about Harvey Weinstein has appalled those of us whose work he championed and those whose good and worthy causes he supported...the intrepid women who raised their voices to expose this abuse are our heroes.”\n\n37 of 67 EMMA WATSON Taylor Hill/Getty The outspoken feminist never mentioned Weinstein by name on Twitter, where she spoke out, but offered her support to the women who claim they were sexually harassed by the movie mogul. \"I stand with all the women who have been sexually harassed, and am awestruck by their bravery,\" she wrote. \"This mistreatment of women has to stop. In this instance, it was women affected but I also stand with all the men, indeed any person, who has suffered sexual harassment.\"\n\n38 of 67 COLIN FIRTH Dave M. Benett/Getty The actor, who won an Oscar for the Weinstein film The King's Speech, spoke out against his former boss on Oct. 10. He released a statement to The Guardian about his experiences with Weinstein, and said reading the stories of women who have been allegedly harassed by Weinstein left him with \"a feeling of nausea.\" He also spoke about Weinstein's influence in the industry, and how that made him a tough person to defy. “It’s with a feeling of nausea that I read what was going on while I was benefiting from Harvey Weinstein’s support,\" he wrote. \"He was a powerful and frightening man to stand up to. It must have been terrifying for these women to step up and call him out. And horrifying to be subjected to that kind of harassment. I applaud their courage.\"\n\n39 of 67 EWAN MCGREGOR Michael Loccisano/FilmMagic McGregor spoke out about Weinstein on Twitter, saying that he'd heard talk of Weinstein’s alleged behavior for years. \"Weinstein,\" he wrote. \"It's about time this came to light ... Heard rumors over the years but this is awful. Bye Bully!\" When another Twitter user asked McGregor why he didn't speak up earlier, he wrote back: \"The rumors I heard at the time were of inappropriate behavior, nothing close to what we are reading about now.\"\n\n40 of 67 BENEDICT CUMBERBATCH GP Images/WireImage The actor worked with Weinstein on the film The Imitation Game (which earned him an Oscar nomination) and on The Current War, which is due out later this year (Weinstein has removed his name from the title). He condemned Weinstein and commended the women who were speaking out about allegations of sexual harassment and assault. \"I am utterly disgusted by the continuing revelations of Harvey Weinstein’s horrifying and unforgivable actions,\" he said in a statement on Tuesday, according to Metro UK. \"We need to collectively stand up and support victims of abuse such as the brave and inspiring women who have spoken out against him and say we hear you and believe you. That way others may be emboldened by our support to come forward and speak. But we shouldn’t wait until there are any more stories like this. We, as an industry and as a society at large need to play our part. There has to be zero tolerance of any such behavior in any walk of life. We owe that to these women’s bravery in coming forward.\"\n\n41 of 67 HILLARY CLINTON Sylvain Gaboury/FilmMagic Weinstein was a prolific donor to the Democratic Party and several prominent Democratic politicians, including Clinton. She released a statement on Tuesday, stating, \"I was shocked and appalled by the revelations about Harvey Weinstein. The behavior described by women coming forward cannot be tolerated. Their courage and the support of others is critical in helping to stop this kind of behavior.\" She did not address the donations he'd made to her campaign.\n\n42 of 67 BRAD PITT Kevin Winter/Getty Though Pitt has not released a statement, his representative did confirm Paltrow's account and his own part in the situation to the New York Times. After Paltrow told Pitt of Weinstein's harassment, Pitt approached him at a premiere and told him not to touch Paltrow again, according to sources.\n\n43 of 67 LEONARDO DICAPRIO Dan MacMedan/WireImage DiCaprio released a statement on social media: \"There is no excuse for sexual harassment or sexual assault - no matter who you are and no matter what profession. I applaud the strength and courage of the women who came forward and made their voices heard.\"\n\n44 of 67 MATT DAMON Eric Charbonneau/REX/Shutterstock Amid the mounting revelations of sexual harassment or abuse against Weinstein, The Wrap founder Sharon Waxman on Sunday claimed Damon and Russell Crowe meddled in a 2004 story she was writing for the New York Times about behavior by Weinstein and the the-head of Miramax Italy, Fabrizio Lombardo. Waxman claimed Damon and Crowe called her “directly” to vouch for Lombardo. Her story was ultimately killed by the NYT. In an interview with Deadline, Damon said that he thought the article was a negative piece on Lombardo, a producer on The Talented Mr. Ripley. He also said that he never saw this behavior from Weinstein, and that he will try to look out for it more now. The actor also championed the women speaking out. \"I did five or six movies with Harvey. I never saw this,\" he told Deadline. \"I think a lot of actors have come out and said, everybody’s saying we all knew. That’s not true. This type of predation happens behind closed doors, and out of public view. If there was ever an event that I was at and Harvey was doing this kind of thing and I didn’t see it, then I am so deeply sorry, because I would have stopped it. And I will peel my eyes back now, farther than I ever have, to look for this type of behavior. Because we know that it happens. I feel horrible for these women and it’s wonderful they have this incredible courage and are standing up now.\"\n\n45 of 67 GLENN CLOSE Sylvain Gaboury/FilmMagic Close said in a statement that though Weinstein had been \"decent\" to her, she'd heard rumors about his behavior. \"I’m angry, not just at him and the conspiracy of silence around his actions, but also that the 'casting couch' phenomenon, so to speak, is still a reality in our business and in the world: the horrible pressure, the awful expectation put on a woman when a powerful, egotistical, entitled bully expects sexual favors in exchange for a job,\" she said in a statement. \"Ours is an industry in which very few actors are indispensable and women are cast in far fewer roles than men, so the stakes are higher for women and make them more vulnerable to the manipulations of a predator. I applaud the monumental courage of the women who have spoken up. I hope that their stories and the reportage that gave them their voices represents a tipping point, that more stories will be told and that change will follow.\"\n\n46 of 67 CHARLIZE THERON Noam Galai/Getty In an Instagram post on Tuesday, Theron spoke out about the Weinstein allegations, and said she sadly wasn't shocked to hear them. \"I unfortunately cannot say I'm surprised,\" she wrote. \"This culture has always existed, not just in Hollywood but across the world. And many men in positions of power have gotten away with it for far too long. We cannot blame the victims here. A lot of these women are young, just starting out in their respective fields, and have absolutely no way to stand up to a man with so much influence, much greater than theirs. If they speak up, they are shut down, and that could be the end of their career.\"\n\n47 of 67 GEORGE CLOONEY Evan Agostini/Getty Images George Clooney spoke out against the film producer who gave him his first big break in the 1996 film From Dusk till Dawn in an extensive interview with The Daily Beast. “It’s indefensible. That’s the only word you can start with. Harvey’s admitted to it, and it’s indefensible,” Clooney said. The Suburbicon director said he had heard “rumors” about Weinstein since the 1990s, but only that “certain actresses had slept with Harvey to get a role” and dismissed the gossip as something said to diminish the actresses’ talent. “I’ve known Harvey for 20 years. … But I can tell you that I’ve never seen any of this behavior — ever,” Clooney said, adding that he was not aware of how Weinstein reportedly reached settlements with at least eight women, as first revealed by The New York Times. “I didn’t hear anything about that and I don’t know anyone that did. That’s a whole other level and there’s no way you can reconcile that. There’s nothing to say except that it’s indefensible,” Clooney explained.\n\n48 of 67 CATE BLANCHETT David Fisher/REX/Shutterstock “Any man in a position of power or authority who thinks it’s his prerogative to threaten, intimidate or sexually assault any woman he encounters or works alongside needs to be called to account. It is never easy for a woman to come forward in such situations and I wholeheartedly support those who have,” Blanchett said in a statement to Variety.\n\n49 of 67 BEN AFFLECK Mireya Acierto/WireImage Ben Affleck also strongly denounced the man who gave him his start with Good Will Hunting. The actor issued a statement on his social media, saying that he was \"saddened and angry that a man who I worked with used his position of power to intimidate, sexually harass and manipulate many women over decades.\" Affleck then referenced the New Yorker reports that further alleged that Weinstein had committed sexual assault. \"The additional allegations of assault that I read this morning made me sick. This is completely unacceptable, and I find myself asking what I can do to make sure this doesn’t happen to others,\" Affleck said. \"We need to do better at protecting our sisters, friends, co-workers and daughters. We must support those who come forward, condemn this type of behavior when we see it and help ensure there are more women in positions of power.\"\n\n50 of 67 JENNIFER LAWRENCE David M. Benett/Getty Images Jennifer Lawrence added her voice to the chorus of actors who won Oscars for starring in Weinstein films. Lawrence, who won for Silver Linings Playbook and later thanked Weinstein, said she was “deeply disturbed” to hear of the allegations against the Hollywood mogul in a statement to PEOPLE. “I worked with Harvey five years ago and I did not experience any form of harassment personally, nor did I know about any of these allegations,\" she said. This kind of abuse is inexcusable and absolutely upsetting.\" She continued: “My heart goes out to all of the women affected by these gross actions. And I want to thank them for their bravery to come forward.”\n\n51 of 67 NICOLE KIDMAN Charley Gallay/Getty In a statement released to PEOPLE, Nicole Kidman — who has worked with Weinstein on seven films including Lion, Nine, Cold Mountain, and The Others — put her support behind any victims making allegations against the famed film producer. “As I’ve stated before publicly, I support and applaud all women and these women who speak out against any abuse and misuse of power — be it domestic violence or sexual harassment in the workforce,” the actress, 50, said. “We need to eradicate this behavior.”\n\n52 of 67 JUDI DENCH Scott Wintrow/Getty In a statement released on Monday, Judi Dench added her own condemnation of Weinstein. “Whilst there is no doubt that Harvey Weinstein has helped and championed my career for the past 20 years, I was completely unaware of these offences which are, of course, horrifying, and I offer my sympathetic to those who have suffered, and wholehearted support to those who have spoken out.\"\n\n53 of 67 KATE WINSLET Alan Davidson/Silverhub/REX/Shutterstock Kate Winslet released one of the strongest statements against Weinstein. The actress won an Oscar in 2009 for her role in The Weinstein Company’s The Reader “The fact that these women are starting to speak out about the gross misconduct of one of our most important and well regarded film producers, is incredibly brave and has been deeply shocking to hear,” Winslet said on Monday in a statement to Variety. “The way Harvey Weinstein has treated these vulnerable, talented young women is NOT the way women should ever EVER deem to be acceptable or commonplace in ANY workplace,” Winslet added. “I have no doubt that for these women this time has been, and continues to be extremely traumatic. I fully embrace and salute their profound courage, and I unequivocally support this level of very necessary exposure of someone who has behaved in reprehensible and disgusting ways,” Winslet continued. “His behaviour is without question disgraceful and appalling and very, very wrong. I had hoped that these kind of stories were just made up rumours, maybe we have all been naïve. And it makes me so angry. There must be ‘no tolerance’ of this degrading, vile treatment of women in ANY workplace anywhere in the world.”\n\n54 of 67 JULIANNE MOORE On Monday, Julianne Moore shared her thoughts on Twitter writing, “1. Coming forward about sexual abuse and coercion is scary and women have nothing to be gained personally by doing so. 2. But through their bravery we move forward as a culture, and I thank them. Stand with @AshleyJudd @rosemcgowan and others.”\n\n55 of 67 MARK RUFFALO Andrew Toth/WireImage On Sunday, actor Mark Ruffalo spoke out against Weinstein on Twitter, writing, “to be clear what Harvey Weinstein did was a disgusting abuse of power and horrible. I hope we are now seeing the beginning of the end of these abuses.”\n\n56 of 67 LENA DUNHAM Jim Spellman/WireImage \"The woman who chose to speak about their experience of harassment by Harvey Weinstein deserve our awe. It's not fun or easy. It's brave,\" Lena Dunham shared on Twitter on Thursday.\n\n57 of 67 SETH ROGEN John Shearer/WireImage On Friday, Seth Rogen tweeted, \"I believe all the women coming forward about Harvey Weinstein's sexual harassment. It takes bravery to do so.\"\n\n58 of 67 JUDD APATOW Frazer Harrison/Getty On Friday, director Judd Apatow criticized Weinstein's statement to the NYT that the \"rules of behavior\" were different when he came of age in the '60s and '70s. \"The 70's were 37 years ago. You are blaming growing up in the 70's? You haven't picked up anything since then?\"\n\n59 of 67 BRIE LARSON Kevork Djansezian/Getty \"As always, I stand with the brave survivors of sexual assault and harassment. It's not your fault. I believe you,\" Brie Larson tweeted on Thursday.\n\n60 of 67 AMBER TAMBLYN David Livingston/Getty On Thursday, Amber Tamblyn shared the NYT article alongside a Tweet in which she wrote, \"Heed the mantra and never forget: Women. Have. Nothing. To. Gain. And. Everything. To Lose. By. Coming. forward.\"\n\n61 of 67 KEVIN SMITH John Shearer/WireImage On Monday, Kevin Smith wrote on Twitter that Weinstein \"had financed the first 14 years of my career - and now I know while I was profiting, others were in terrible pain. It makes me feel ashamed.\"\n\n62 of 67 JESSICA HYNES Joanne Davidson/Silverhub/REX/Shutterstock; Samir Hussein/French Select/Getty On Friday, British actress Jessica Hynes came forward with her own account about the Hollywood mogul. “I was offered a film role at 19,” she wrote on Twitter. “Harvey Weinstein came on board and wanted me to screen-test in a bikini. I refused & lost the job.”\n\n63 of 67 LAUREN SIVAN Gabriel Olsen/FilmMagic On Monday, TV reporter Lauren Sivan, who claimed the Hollywood mogul had once masturbated in front of her in a New York City restaurant, went on Megyn Kelly Today to talk about why she waited so long to share her story. “He was a titan in Hollywood, he could ruin people’s careers if he didn’t like you,” Sivan said of Weinstein.\n\n64 of 67 CHRISTIAN SLATER On Monday, Christian Slater tweeted his support for the women who've spoken out against Weinstein. \"Women who come forward to speak out against abusers do so at great cost and risk themselves,\" the Mr. Robot star wrote in a statement.\n\n65 of 67 JESSICA CHASTAIN Tara Ziemba/WireImage Jessica Chastain tweeted on Monday that she was \"warned from the beginning\" about Weinstein's behavior toward women and the allegations against him. When asked by a Twitter user why she didn't say anything, the actress replied, \"It wasnt my story to tell. Its the victim's decision.\"\n\n66 of 67 JESSE TYLER FERGUSON David Fisher/Shutterstock Jesse Tyler Ferguson tweeted his support to the women who spoke out against Weinstein, writing, \"My heart breaks for everyone who was hurt by this man.\" He applauded Christian Slater for his statement against the movie mogul, writing, \"I’m so happy to call this guy a friend.\"", "images": ["https://people.com/thmb/ur-CTBD1QNiM_X4DQ9ZEycFvTQg=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(732x0:734x2)/rebecca-traister-2000-b0e66a9aada44dc49bb4b23d73cc3969.jpg", "https://people.com/thmb/R_0mQjCSX0K6s9ojXmgLGiVy__w=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(614x0:616x2)/jessica-chastain6-2000-9e80807c73b04be386a69a724ef727a7.jpg", "https://people.com/thmb/stYL-NaTARpoNh7PJDycNA_FfpA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(676x0:678x2)/harvey-weinstein-1-bd7648718718432da4c3bee38b579144.jpg", "https://people.com/thmb/Zhr-r_E5h_HZFYTH2F43B4os8Ek=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/molly-ringwald-435-5-4453077dffc04cf580d4f70d5bf75257.jpg", "https://people.com/thmb/s95pXQGH8WhLgbrLEQRbhnPgUes=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(653x0:655x2)/angelina-jolie-7-2000-4ff94ceffaf24d4eb5ba766d7c5bab9b.jpg", "https://people.com/thmb/CzGEk0LiI-wlp5O5SxvOKy7x1PE=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(731x0:733x2)/heathergraham-10750cc02d71477ab9c044514174ee16.jpg", "https://people.com/thmb/hEUBnw9zee7t0utY-MZauslzXDs=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/cate-blanchett3-2000-a2401d4ea22f471394afc059690d3041.jpg", "https://people.com/thmb/lAa83PBQoOffAvC8PGt5VR8ScEU=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/amber-tamberlyn1-7f6c80ee91674ddd812905e449f37263.jpg", "https://people.com/thmb/XHWNRdl-PdbsQEkvdw_S_OIVo1k=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/asia-argento-4081ebec76f64acc8c8dbf0971f60614.jpg", "https://people.com/thmb/dzi4mKpDRvCgLMqDuvAQ_GpMMkM=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(726x0:728x2)/lena-dunham4-2000-16a312e546634f46b8b6ebb7c43fea41.jpg", "https://people.com/thmb/py_8t-V4kvSUdb8yDi0O60ly-kc=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/lohan-weinstein-1-2000-aa9214815b554e329bae255ee111d800.jpg", "https://people.com/thmb/tirAKipSkvxdOHsDFI2R68BqQBU=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(808x0:810x2)/ben-affleck2-1-2000-84156f65318f4be8a9d19a4668c31cd5.jpg", "https://people.com/thmb/PRKmKiFXPVfTfP5s5F917mLtkqA=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(649x0:651x2)/nicole-kidman-6a4334760fc647e2a8e33b4acd718de3.jpg", "https://people.com/thmb/8cJmVZc7Ok6w5_4Wwxc14qmMsU4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/people_generic-1885945d8bd544778fbbf4be88a63f00.jpg", "https://people.com/thmb/cs7hB9X3lHRPKEwTU825VTFsmcw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(712x0:714x2)/emma-watson6-6b07d900c2314e78b29ef37034b86fbb.jpg", "https://people.com/thmb/uaQ-DjtBEd7T9NNPST8xloVcXnY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/smithsonian-15-da64e539b3024667b477c3713693237b.jpg", "https://people.com/thmb/c78fP1xVOKLyIsCWnttbg7PjwKU=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/mimi-haleyi-2-a9e507ff47894a3491faef66ac17a293.jpg", "https://people.com/thmb/jsQKgrb4AmhVIQpFhXrcV8aeonE=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/florence-darel-1-7e71a83387d14ab186547a65654b6cba.jpg", "https://people.com/thmb/xE5LgSM1g_Lxovxu9O2DfPT7T4A=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/woody-allen-2000-c9241ad6c6804cd590813606ef734294.jpg", "https://people.com/thmb/Q94NFzDaKet3RYjKDKSram9Cpnc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/harvey-weinstein4-0ac6060a92d94cd0ba6276002444c89e.jpg", "https://people.com/thmb/-UzFfY1QhUWBEBj7yd4LMg04QPY=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(798x0:800x2)/leonardo-dicaprio6-cb343fc14beb46b68bda22078e50e566.jpg", "https://people.com/thmb/bVpaQflxWWij668p7ExTJjIKZ0w=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/clooney-weinstein-2000-99a5ba4b3c5e4f769ad30890460f78b4.jpg", "https://people.com/thmb/7Ea3V7wR2W-f3TzR-EJUWBjsQL4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/lupita-nyongo-harvey-weinstein-f70bbc054c4b4f7eb4f8f421103a16bc.jpg", "https://people.com/thmb/EToQvgMzYPdgSPn2GnqOaaQkTvM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(706x0:708x2)/gwyneth-harvey-1-2000-1c4ee8bb2d864e0b96fa4d84d92655d1.jpg", "https://people.com/thmb/_Xa1nf39vJCAxdxMwm8HQ9p6VVk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/harvey-weinstein1-706087e8b9a746cca4186b1e9e0339af.jpg", "https://people.com/thmb/WMZ6IYe0IOGKD7_E2HYMbYO-6n4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(782x0:784x2)/matt-damon-1-2000-bc41fd664e8a44cd845407dd8d98fde6.jpg", "https://people.com/thmb/DSk9hIxKRKUmhSkIyTEwWn8VkxE=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/seth-rogen-b19be815c1d8415b8aa1cb8a519b5153.jpg", "https://people.com/thmb/QV7SIlWawgq_gotfe88HAjP2aIs=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(709x0:711x2)/glenn-close1-a41009bdc9a148589e79f090bfe8a1c1.jpg", "https://people.com/thmb/msfq2J8-9QvBHUKVnrMBY6NTYr8=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(614x0:616x2)/jtf-2000-11106fef671243f8a6622ce42f57b49c.jpg", "https://people.com/thmb/uDq0CugEcjFyFFgZwigGMnsNZ_A=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(728x0:730x2)/judi-dench-2000-a035a478bb6345b99dfbcdfc8b328125.jpg", "https://people.com/thmb/bDxRpPw0lwLdtnu049sGouyU6oE=/1119x2000/filters:fill(auto,1)/anne-heche-1-2000-288b12a4a4a240159899368e1ce60259.jpg", "https://people.com/thmb/bIA2GYmkZ0qFYn6-c7HuTVL9dtI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(635x0:637x2)/gettyimages-114358286-2000-edd1348b086742e185326d2c074d6aa9.jpg", "https://people.com/thmb/hec83spA3Xs8zhZQa5rcet_bweM=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/kate-beckinsale1-fad7c6d19df549789c37130932f35a40.jpg", "https://people.com/thmb/XPp0jH_okLD3TpimoUFDiOBP4Jc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/harvey-weinstein3-1-92a7ec9ef4fe40e2abfdff1f54637b2c.jpg", "https://people.com/thmb/pniVQvbCijIiaEq-RbKPJkWyooc=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(614x0:616x2)/judd-apatow-2000-397608319118416bb53c336848743230.jpg", "https://people.com/thmb/Lje7sGaj3HgeS-yLg9z5JSNPfrU=/300x150/filters:no_upscale():max_bytes(150000):strip_icc()/people_magazine_sub-e6689738996d40f38f154099e1751481.png", "https://people.com/thmb/X6ZTC6iEO-XN5hQJbrlQ1gxuFLs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(808x0:810x2)/ben-affleck2-1-2000-84156f65318f4be8a9d19a4668c31cd5.jpg", "https://people.com/thmb/wEOGisDKG48wnNS1FXrCYuwNJiU=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/ashley-judd1-68a58926054a4bde88c3307f737e9068.jpg", "https://people.com/thmb/ZMA_mmEHZ_oVXIsgMvm_Kemu6s0=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/paz-de-la-huerta-harvey-weinstein-fda1288fec62439a97792babffe0aeba.jpg", "https://people.com/thmb/gYNR_he4tj9JvmJII0-WrEXrntw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(590x0:592x2)/harvey-weinstein-georgina-chapman-1-2000-0966dce75c0a4fe29c2e1460832ff571.jpg", "https://people.com/thmb/MyFwYJiJngy2ka0qC3yJmJnRK5w=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/brit-marling-1333x2000-d520eaee383a42c2943a9142afd78a93.jpg", "https://people.com/thmb/UENMeDErPNsZZ2hAYTa0y7400gU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(649x0:651x2)/nicole-kidman-6a4334760fc647e2a8e33b4acd718de3.jpg", "https://people.com/thmb/MZZeFb2jUL4FVWnAgottZ_lOiiE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/rose-mcgowan-360effeda2634f0a828f633aa8fdc0d9.jpg", "https://people.com/thmb/4OEzCT6OS9FRrnEY6_tHl0tOH4Q=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/daryl-hannah-annabella-sciorra-dd55a641796c476d95e96068570ec2db.jpg", "https://people.com/thmb/cTvHt7WSwxw_Sq5Lg-XlfHv87AM=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/dominique-huett-harvey-weinstein-d1f9149e97994879b0aae82aad4bb0e9.jpg", "https://people.com/thmb/K8LZcxFw24_UOzNagx8_Qukhl8I=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/gettyimages-460626471-c253ef0ab5e444edbba853c2f3e99b05.jpg", "https://people.com/thmb/YX1TT26HLZ9QGAbk36InCwygERE=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(876x0:878x2)/mark-ruffalo-touts-53a62d45ed1e44f7803068dd5891db56.jpg", "https://people.com/thmb/qsFupoEykGB1HOlfxUUKmlFVhTM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/harvey-cara-1-6fd206cb2cea46909b3b5e0ac33f99e8.jpg", "https://people.com/thmb/-TGdlyRY8I8jfHf4A0nG-pDKpBk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/tom-hanks-obamas-c29f5c2db8bf458d8abca299629887c5.jpg", "https://people.com/thmb/vBnhpxu0hI4pYGXpZNlsdEIXPsI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(916x0:918x2)/gwyneth-paltrow-2-3125e96f8327471ca2a91de188a56e74.jpg", "https://people.com/thmb/lCCBH67bmWNw9hiGWDxBFbP0NA0=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/charlize-theron6-36104155236e49c1bb1c1f81cbe2127d.jpg", "https://people.com/thmb/T_GZpxC5qJFITQnH0jctWrkXSEU=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(612x0:614x2)/sag-davis-2000-8281362c2c824a9e9b08faa265ed3f48.jpg", "https://people.com/thmb/pGPatAGq0SeAI-Bmnx0XzrG34YY=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(680x0:682x2)/brie-larson-2000-18a0e3ae3a1441088386215d9be0fe79.jpg", "https://people.com/thmb/Hp1uma4MgcCwjh86JtgkTHhcZts=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(721x0:723x2)/hillary-clinton-0e5540fc19c8453fb6207162a4ea66f1.jpg", "https://people.com/thmb/bO3qdskbkqvkg0dLBG8ZrtMVKVM=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(530x0:532x2)/kate-winslet-566e83f0977c4eb8bf07d6e55219e8f4.jpg", "https://people.com/thmb/hdfjf2JTGwyOIAr-BGZu_9q7rYI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/skeet-ulrich-1-94173be72ba34a23becb24d7076cc03f.jpg", "https://people.com/thmb/vAVP5O4Gxit4vuIJWWex8P_H-0M=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(752x0:754x2)/salma-hayek-1-da0eb0a9ca1a4d1bb76c6d768be70886.jpg", "https://people.com/thmb/HU5QdrtafhjyQuHaWMfiyb1ql3Q=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/gettyimages-845057528-bd5aa149b4214f48bdb6f62234c13471.jpg", "https://people.com/thmb/OvRz9CypQwbQbzhi4rcmbjAyS4w=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(692x0:694x2)/blake-lively-nyfw-11-2000-68b6c9237b4b4c9b9c0abba472a9e674.jpg", "https://people.com/thmb/bT9O-1ZipbOV2mBvteObMPe-kf8=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(584x359:586x361)/rosanna-arquette-0e65b5e5de2c4b6cbc373b3d525eb2e3.jpg", "https://people.com/thmb/4fGwLhXSeolhhrjrfA3F-sJ9z5I=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/trax-slater-085c28ecf92b4410b73b5a5a05d04e05.jpg", "https://people.com/thmb/IqISa740OuSVJtVRPLWxgLGrQAA=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/lauren-holly-999724e30c0f4059a2145d7eb68ea5dd.jpg", "https://people.com/thmb/7xrVae6_Ox4DE1KrpxLII6p8vGQ=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(614x0:616x2)/julianne-moore-2-2000-087ff615baf6460ca699484a8d7a9f7a.jpg", "https://people.com/thmb/FRCophF1bL8G8fqBlFGEaCdJzIQ=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(705x0:707x2)/cara-delevingne-3-2000-34cb2a0bdf334ce0b08d93d10fd38dd0.jpg", "https://people.com/thmb/CaZWjdjnbO95EanPh4icvFcEwFc=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/kevin-smith-2-16f843854deb438cb36057c3151762ef.jpg", "https://people.com/thmb/-REqHDWWb9EgghG9hIVmkI5BdGM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(685x0:687x2)/gwyneth-paltrow-brad-pitt-1-2000-10acfb4ac17d4541b706bafbfa18309a.jpg", "https://people.com/thmb/2VXtimQ1Ys1ywk_Zo5m0AdePdUc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/kate-beckinsale1-fad7c6d19df549789c37130932f35a40.jpg", "https://people.com/thmb/qhtdBXqcoH0DzKNP6xil-27KW0s=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(777x0:779x2)/benedict-cumberbatch-27aea56337d346af91b33ef2641d67c1.jpg", "https://people.com/thmb/0ZWVWDxqZ4T6rPi3gB_EDV7DFQ8=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(679x0:681x2)/lauren-sivan1-2000-061e41cce42e473093e20226685c7766.jpg", "https://people.com/thmb/ihhgTxj7-Jy4p6a1gQanSjDgbTA=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/sean-young-1-878b1ea8e27344b88556eca8486bfa48.jpg", "https://people.com/thmb/NAnWLhJ-Ddu7s-0X8nAUWL6ev8k=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(784x0:786x2)/marion-cotillard5-bff15f4ef73e42dfb38465b167aa5fa7.jpg", "https://people.com/thmb/mzUEKTcdsl9O4DrODz_HwuoBeHk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(637x0:639x2)/gettyimages-137023389-2000-931eb7c095c0464d9b41c3229315f85e.jpg", "https://people.com/thmb/g4h0D_XUMzXE84CkmOA0lAcbHkE=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(832x0:834x2)/brad-pitt-2-bf9fb24e14ae486996e3a23d5781b3de.jpg", "https://people.com/thmb/Xm2waJWxilHkJNHXGtS14Ts7ZW8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(761x0:763x2)/emm-thompson-2000-250bde7c9805457795c940649e8b29e0.jpg", "https://people.com/thmb/GvwB4M679ZvIgH3tVkOIHayOJMY=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(558x0:560x2)/anne-heche-1-2000-288b12a4a4a240159899368e1ce60259.jpg", "https://people.com/thmb/-8ZrIemjM0HiyIKWCUNDPmSwtP8=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(738x0:740x2)/gettyimages-107016449-2000-c682cdf7032d49c9b2e7c1bf2bd88e85.jpg", "https://people.com/thmb/imeDHzAJsBrJg32Ou5ECm0Z9tjQ=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(755x0:757x2)/mira-sorvino-eab56adb443d4643b3d22aa4a9995864.jpg", "https://people.com/thmb/L_2jCs3ILioxDyvNcsSQ0gkz7Qg=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/donna-karan-520a743469bc46fd9d9a62c96442b6b5.jpg", "https://people.com/thmb/yIJnYPl0KCaledUcj7UiiwWCzXQ=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/colin-firth-kevin-bacon-41cf23786f8844d6ae5f667f900abbf1.jpg", "https://people.com/thmb/HZk1O3D8qd-wGHqVUVaCOuczNL4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/gettyimages-860600470-f87fd839b08d467287087e01e07b256c.jpg", "https://people.com/thmb/-TptkJYjmnUjWbS-NAffsNX4l7k=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/jennifer-lawrence1-1-2000-6daaf7e161a94f82a6f63a084532e297.jpg", "https://people.com/thmb/QAwCHQZZsUUqcEvPDhuwF4Rcooo=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(782x0:784x2)/matt-damon-1-2000-bc41fd664e8a44cd845407dd8d98fde6.jpg", "https://people.com/thmb/FMg7OMVneSVehtGjq7--F1BCwzw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/quentin-tarantino-harvey-weinstein-d143841f3e184fb980508188dfd3e31d.jpg", "https://people.com/thmb/JO59AVxXutauQbazfWdJF1UjlIk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/lane-weinstein-1-2000-17cba2ef715f469dac9ec3f0b29ddd45.jpg", "https://people.com/thmb/uGVu4c4iQ_aD4-39Gb622AO5iOo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/rose-mcgowan-1-56b63cdc46354a98bb03e7293e3b9aa1.jpg"], "top_img": "https://people.com/thmb/bDxRpPw0lwLdtnu049sGouyU6oE=/1119x2000/filters:fill(auto,1)/anne-heche-1-2000-288b12a4a4a240159899368e1ce60259.jpg", "keywords": [], "authors": ["Maria Pasquini", "People Editorial Guidelines"], "canonical_link": "https://people.com/celebrity/harvey-weinstein-scandal-gallery/", "title": "All of the People Who've Spoken Out Against Harvey Weinstein", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Meryl Streep, Judi Dench and all of the women and men who have spoken out against Harvey Weinstein", "emailcontenttype": "LISTSC", "emailvertical": "PEOPLE", "sailthru.author": "Maria Pasquini", "article": {"section": "People", "opinion": "false", "author": "https://www.facebook.com/peoplemag"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "og": {"type": "article", "site_name": "Peoplemag", "url": "https://people.com/celebrity/harvey-weinstein-scandal-gallery/", "title": "All of the People Who've Spoken Out Against Harvey Weinstein", "description": "Meryl Streep, Judi Dench and all of the women and men who have spoken out against Harvey Weinstein", "image": "https://people.com/thmb/bDxRpPw0lwLdtnu049sGouyU6oE=/1119x2000/filters:fill(auto,1)/anne-heche-1-2000-288b12a4a4a240159899368e1ce60259.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "All of the People Who've Spoken Out Against Harvey Weinstein", "description": "Meryl Streep, Judi Dench and all of the women and men who have spoken out against Harvey Weinstein", "image": "https://people.com/thmb/bDxRpPw0lwLdtnu049sGouyU6oE=/1119x2000/filters:fill(auto,1)/anne-heche-1-2000-288b12a4a4a240159899368e1ce60259.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.19.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.19.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.19.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.19.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.19.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}