{"url": "https://web.archive.org/web/20180330032336/https://screenrant.com/westworld-season-2-trailer-breakdown/", "text": "It’s nearly time to return to Westworld, and HBO just dropped a new full-length trailer for the show’s upcoming second season. After the android ‘hosts’ of the sprawling theme park gained self-awareness and massacred their human oppressors in the dramatic season 1 finale, season 2 will see Dolores (Evan Rachel Wood) and her fellow hosts exploring and reshaping their world. However, Delos isn’t going down without a fight, and the humans – including Head of Security Ashley Stubbs (Luke Hemsworth) and the Delos board’s Executive Director, Charlotte Hale (Tessa Thompson) – will be trying to retake the park and get its residents under control.\n\nWestworld season 1 was full of mysteries, secrets, and cleverly-hidden time jumps, and the second season will also go back into the past to uncover answers, with Jimmi Simpson returning as William, a young Robert Ford, and more appearances by Arnold (Jeffrey Wright). Season 2 will also expand the horizon by introducing Westworld’s adjacent park, ShogunWorld. This final trailer offers plenty of intriguing hints about what’s on the way, so here’s a breakdown of the biggest secrets and things you may have missed.\n\nRelated: Westworld Season 2 Trailer: It’s Us Or Them\n\nA Familiar Tune\n\nOne of the things that made Westworld season 1 so memorable was composer Ramin Djawadi’s instrumental arrangements of famous songs – many of them played on the saloon’s old-timey piano. The season, rather appropriately, ended with a cover of Radiohead’s “Exit Music (For a Film)”, which played as everything finally came toa climax and the hosts unleashed violence upon the park’s guests. This latest trailer for Westworld season 2 is scored with Djawadi’s cover of Nirvana’s “Heart-Shaped Box,” and the full version of the song has now been released online via WaterTower Music. Enjoy!\n\n\n\nA Message in Plain Sight\n\nDelos was dealt a considerable blow in the season 1 finale – as evidenced by the bodies washing up on the shore when Bernard wakes up, and the others shown scattered around Westworld. To make matters worse, one shot in the trailer shows Dolores’ group leading around a man who is tied to a horse, who appears to be one of the Delos board members being held hostage. However, the company is fighting back, and Stubbs has set up a new base of operations (complete with a holograph of the park) on this beach. They have boats, vehicles, and lots of guns – and they may also have a secret weapon (more on that later). But the most interesting thing in this screenshot is the box in the lower right corner – which contains a hidden message in binary. The code translates to a URL for a page on the Delos, Incorporated website, which contains another teaser for the upcoming season.\n\n\n\nA Crown of Thorns\n\nAngela (Tallulah Riley) is one of the most intriguing hosts in Westworld – and also the first host that William encountered when he entered the park. She was eventually revealed to be a follower of Wyatt (who is actually Dolores), so this scene where she wears a crown of thorns and bears down on someone with a revolver could be the continued result of her cult-like worship of Wyatt. She is also seen later in the trailer, this time in the Mesa Hub, getting out of bed. This scene appears to be a flashback, as the man in the bed looks like Logan and there are several other naked hosts around – most likely the aftermath of one of Logan’s orgies.\n\n\n\nLogan Returns (Still Naked)\n\nBen Barnes’ wealthy bad boy Logan had a rather humiliating exit at the end of Westworld season 1 – stripped naked with his hands tied, and then sent off on horseback by William. In this trailer, we see him discovered by a Ghost Nation host (played by Bone Tomahawk‘s Zahn McClarnon), still naked, but minus the horse that he rode off on. We also see Logan later in the trailer (full dressed this time) standing by a pool in the central building, with the Peter Abernathy host. If and when he is reunited with William, the two of them are going to have some things to work through.\n\n\n\nYoung William Returns\n\nAlthough last season brought William’s arc to a dramatic close with the reveal that his scenes are actually flashbacks, and he’s really a younger version of the Man in Black, that doesn’t mean we’ve seen the last of Jimmi Simpson’s budding sociopath. In one shot of the trailer he can be seen approaching a nude Dolores in the laboratory – presumably after he has bought a controlling share in Westworld, and has free reign of its facilities. Despite become disillusioned about their love for one another, William’s fascination with Dolores never really ended, and there are many decades of his past still to be uncovered.\n\n\n\nDrone Hosts\n\nIn a voiceover, William/The Man in Black states ominously Delos had other plans for Westworld and the android technology, beyond simply a place for people to commit terrible crimes with impunity. This trailer offers a glimpse of a terrifying new type of host, called a ‘drone host,’ which Nolan has said is part of the corporation’s “secret project.” Delos could be using the AI technology for more dangerous applications – creating militarized robots, for example. Based on this trailer, in which a drone host is seen casually throwing a body into water, it seems like these hosts have all the strength of Westworld’s residents, but none of the humanity.\n\n\n\nThe Mysterious Red Ball\n\nA particularly intriguing shot in the trailer shows a small red ball being constructed by a 3D printer – perhaps an eyeball for one of the hosts, or some new piece of technology. This could, like the drone hosts, be connected to Delos’ secret agenda, but it’s hard to say for sure. Either way, the fact that this shot was included in the trailer indicates that it’s of some significance.\n\n\n\nDelos May Be Using Clementine\n\nPoor Clementine Pennyfeather (Angela Sarafyan) had a rough time in season 1, and was effectively lobotomized after being used to demonstrate how the reveries can make hosts dangerous and capable of harming humans. She joined her fellow hosts in the uprising and slaughter of the humans in the park, but it seems like in season 2 she’ll be used as a puppet by the humans again. A brief clip shows Clementine riding on horseback, followed by Delos security teams in vehicles. It’s possible that they manage to capture Clementine, and use her to lead them to the other hosts – or for some other nefarious purpose.\n\n\n\nMaeve Visits ShogunWorld\n\nLast season, Maeve was handed a piece of paper giving her the location of her “daughter” – in Park 1. Now, the logical assumption might be that Park 1 is Westworld, but it could also be the case that Maeve’s daughter was moved to one of the other parks in order to avoid triggering a reverie if they crossed paths. We know that Maeve has taken Westworld writer Simon Quarterman (Lee Sizemore) captive and is using him to find her daughter, and this shot shows Maeve wearing traditional Japanese garb and visiting ShogunWorld. Is that where her daughter is?\n\n\n\nThe Man in Black Has a Plan\n\nThe Man in Black had a clear goal in season 1: he wanted to find the center of the maze, which he believed was some kind of mystery hidden in the park. He pursued this goal despite repeatedly being told that the maze wasn’t designed for him, and he ultimately never found the center of the maze – because it doesn’t physically exist. The maze is actually a metaphor for the journey inwards, and the center of the maze is the point at which hosts become capable of making their own decisions. In season 2, it seems, the Man in Black’s new goal is to burn Ford’s world to the ground, which makes sense given how delighted he was when he saw the hosts rise up and rebel. So, does this shot of the Man in Black pointing a gun at his own head mean that he reaches a crisis point, or is something else going on?\n\n\n\nCharlotte Discovers Bernard’s Secret\n\nFor most of the trailer we see Bernard hanging out with the humans in Westworld, since they presumably still believe that he’s a human programmer instead of one of the hosts. Speaking in an interview with EW, Wright said that Bernard is “trying to do a high-wire act on a razor blade with the humans on one side and the hosts on the other.” With a trick like that, he’s bound to get hurt eventually, and this brief shot of Charlotte Hale standing in a room full of dormant Bernard-bots reveals that at some point she will discover his true nature. Then again, perhaps she already knew; Charlotte is a pretty enigmatic character.\n\n\n\nDolores in the Real World\n\nThere are several shots of Dolores in modern-day clothing in the trailer, but this is the most intriguing one of all, as it appears to show Dolores looking out over a futuristic cityscape – indicating that she somehow leaves the park. This scene could be depicting Dolores’ eventual escape from Westworld, or it may be a flashback to her time with William. Perhaps the younger William smuggled Dolores out into the world in order to test her reactions, once he gained control of the park.\n\n\n\nTeddy’s New Threads\n\nDolores’ boyfriend Teddy Flood (James Marsden) would follow her to hell and back – though he’s not too happy about all the killing that their path takes them on. “We’ve ridden 10 miles and all we’ve seen is blood,” he laments at one point. However, he and Dolores don’t just travel through the park itself; this blink-and-you’ll-miss-it shot shows Teddy in the tech lab, wearing modern-day clothing, pointing a gun at someone. Are he and Dolores formulating a plan to escape and blend in with humans, or do they just grow tired of wearing old-timey clothing once they find out that Westworld is a lie?\n\n\n\nArnold’s Sessions Continue\n\nThings can get a little confusing now that we know both Arnold and Bernard are played by Jeffrey Wright, but the man interviewing Dolores at the beginning and end of the trailer is almost certainly Arnold. Dolores is wearing the same dress that she wore in all her interviews from last season, and Arnold doesn’t have the scar on his temple that Bernard has. Depending on how confusing season 2 gets, that may be one of the best ways of knowing which character we’re watching in any given scene.\n\nMore: Westworld Season 2’s Shogun World Revealed\n\nWestworld season 2 premieres April 22, 2018 on HBO.\n\nThePremium Network Ad Free Browsing\n\nAd Free Browsing Over 10,000 Videos!\n\nOver 10,000 Videos! All in 1 Access\n\nAll in 1 Access Join For Free! GO PREMIUM WITH SCREENRANT Go Premium!", "images": ["https://web.archive.org/web/20180330032336im_/https://screenrant.com/wp-content/themes/screenrant/assets/images/svg/tp-logo.svg", "https://web.archive.org/web/20180330032336im_/http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1", "https://web.archive.org/web/20180330032336im_/https://screenrant.com/wp-content/themes/screenrant/images/pr-go-premium-white.svg", "https://web.archive.org/web/20180330032336im_/https://screenrant.com/wp-content/themes/screenrant/images/pr-part-of-1.svg", "https://web.archive.org/web/20180330032336im_/https://screenrant.com/wp-content/uploads/2018/03/Westworld-Season-2-Trailer-Man-in-Black.jpg", "https://web.archive.org/web/20180330032336im_/https://www.facebook.com/tr?id=297467373958238&ev=PageView&noscript=1", "https://web.archive.org/web/20180330032336im_/https://screenrant.com/wp-content/themes/screenrant/images/pr-icon-light.svg", "https://web.archive.org/web/20180330032336im_/https://screenrant.com/wp-content/themes/screenrant/assets/images/svg/ad-blocker.svg"], "top_img": "https://web.archive.org/web/20180330032336im_/https://screenrant.com/wp-content/uploads/2018/03/Westworld-Season-2-Trailer-Man-in-Black.jpg", "keywords": [], "authors": ["Hannah Shaw-Williams"], "canonical_link": "https://web.archive.org/web/20180330032336/https://screenrant.com/westworld-season-2-trailer-breakdown/", "title": "Westworld Season 2 Trailer Secrets & Things You Missed", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"pages": 10765693196, "app_id": 1682953215260932}, "syndication-source": "https://screenrant.com/westworld-season-2-trailer-breakdown/", "twitter": {"domain": "ScreenRant.com", "site": "@screenrant", "card": "summary_large_image", "title": "Westworld Season 2 Trailer Secrets & Things You Missed", "description": "The final trailer for Westworld season 2 offers glimpses of the new drone hosts, Dolores in modern clothing, Maeve in ShogunWorld, and much more!", "image": {"src": "https://screenrant.com/wp-content/uploads/2018/03/Westworld-Season-2-Trailer-Dolores.jpg"}}, "news_keywords": "Westworld,SR Originals", "description": "The final trailer for Westworld season 2 offers glimpses of the new drone hosts, Dolores in modern clothing, Maeve in ShogunWorld, and much more!", "og": {"type": "article", "title": "Westworld Season 2 Trailer Secrets & Things You Missed", "url": "https://web.archive.org/web/20180330032336/https://screenrant.com/westworld-season-2-trailer-breakdown/", "locale": "en_US", "description": "Westworld season 2's final trailer is packed full of clues.", "site_name": "Screen Rant", "image": {"identifier": "https://web.archive.org/web/20180330032336im_/https://screenrant.com/wp-content/uploads/2018/03/Westworld-Season-2-Trailer-Man-in-Black.jpg", "width": 620, "height": 310}}, "article": {"publisher": "https://www.facebook.com/ScreenRant", "published_time": "2018-03-29T15:40:18+00:00", "modified_time": "2018-03-29T17:36:09+00:00", "author": "Hannah Shaw-Williams", "section": "SR Originals", "tag": "westworld"}, "robots": "noydir"}, "movies": ["https://web.archive.org/web/20180330032336if_/https://www.youtube.com/embed/LDS8SeO6hyg?feature=oembed"], "publish_date": 1522338018.0, "source": "https://web.archive.org", "summary": ""}