{"url": "https://tvline.com/2018/06/18/supergirl-recap-season-3-finale-ending-explained-red-son/", "text": "Supergirl wrapped its third season on Monday with an explosive final showdown between Reign and the Girl of Steel, setting the stage for an exciting — and very different — fourth outing this fall.\n\nBefore we go inside the episode (via executive producers Robert Rovner and Jessica Queller), here’s a quick recap: Supergirl defeated Reign (and saved Sam!) with help from the Legion Ring; Brainy revealed that one of his “distant relatives” survived the Blight and made the future uninhabitable for all other A.I.s, explaining why he’s sticking around; Winn agreed to take Brainy’s place in the Legion and travel to the future; Mon-El decided to return to the future with him; Alex was promoted to Director of the DEO by J’onn, who’s going to live among the people moving forward; James formally outed himself as Guardian to the world; and Lena proceeded to “phase two” of her mysterious tests on the powerful Kryptonian rock.\n\nRELATED STORIES Walker Independence Premiere Recap: Grade The CW's Prequel Spinoff\n\nWalker Independence Premiere Recap: Grade The CW's Prequel Spinoff Walker's Jared Padalecki Breaks Down Premiere's Kidnapping Twist, Previews Cordell's 'Spiral' -- Plus, Grade It!\n\nThen came the episode’s final scene, which introduced a second Kara — one born from the aura that left Supergirl’s body during the battle with Reign — in Siberia.\n\n“For fans of the comics, I think they might recognize that the story we want to tell is inspired by the iconic DC Comics’ Red Son, which told an alternate origin story for Superman,” Rovner tells TVLine, to which Queller adds, “What happened if — as a baby — Superman landed in Russia and became a hero there instead of in America. It’s an homage to that.”\n\nRead on for more insight from the show’s EPs, including details about Sam and Ruby’s future on the show (or lack thereof):\n\nTVLINE | Let’s start by talking about Winn, who will return next season in a recurring capacity. In your eyes, what made joining the Legion the right next step for him?\n\nQUELLER | We were so excited when that idea came up in the writers’ room, because it seemed so in-character with Winn. We asked what Winn’s dream would be, and that just met it perfectly.\n\nROVNER | We’ve been talking about this ever since the episode where Winn’s mom came back, when he was contemplating his destiny and what his impact would be on the world. We wanted to give him a fitting way to dramatize what we saw for Winn’s future.\n\nQUELLER | He’s really fulfilling his full potential. Just imagine all that he could do in the future with his mind.\n\nTVLINE | We may be losing Winn as a full-time member of the team, but on the plus side, we’re getting more Brainy. What excites you about bringing him into the fold and telling his stories?\n\nQUELLER | Everything excites us. We love Brainy, and we love Jesse Rath. He’s just a magical actor. The character is delightful and brings fresh new eyes to Earth. Everything is brand new to him, which is just great to be around.\n\nTVLINE | With Mon-El gone, is there any chance you’ll be exploring the romantic link between Brainiac-5 and Supergirl from the comics?\n\nROVNER | We did that a little bit when he first arrived. I think he’ll always have affection for Supergirl, but you’ll have to stay tuned.\n\nTVLINE | Odette Annable isn’t going to be a regular next season, and the Reign storyline seems pretty wrapped up. Is this the last we’ve seen of Sam and Ruby?\n\nROVNER | We hope not. We love Odette. She was amazing in this dual role, playing different characters. We fell in love with her as Sam and we were terrified of her as Reign. If it works out, we’d love to have her back for a few episodes next season.\n\nTVLINE | A lot of the fans speculated that Sam wouldn’t survive, leaving Alex to adopt Ruby. Did you ever consider going in that direction?\n\nQUELLER | We discussed all options, but we really felt like we wanted a heartwarming ending after all the trauma we put everyone through. We didn’t want to separate Ruby from her mother. The world is experiencing enough trauma, we wanted to have a happy ending for the little girl.\n\nROVNER | This episode was about our heroes saving Sam, so we thought it was important that we accomplish what we set out to do. We’re really excited that Sam was empowered and able to play a part in all of it.\n\nTVLINE | Still, motherhood remains an important goal of Alex’s, even as she’s heading up the DEO. Can she have it all?\n\nROVNER | We hope so. We’re excited about Alex’s journey, going back in the dating world and exploring options for motherhood and the challenges of taking on this big job at the DEO.\n\nQUELLER | It’s a very universal story. What’s exciting is the process of watching a human being strive to have it all. We all strive to in our different ways, and Alex is a wonderful prototype of that. She’s a powerful career woman, but she wants balance. The process of how she achieves — or doesn’t achieve — that is what we’re excited to tell.\n\nTVLINE | And J’onn? I’m excited to see where this new journey takes him.\n\nROVNER | We thought it was important for his character to take in the teachings his father was trying to impart on him. Our Worldkiller story took us off-world a lot, but what’s great about this show is that we get to tell stories about what’s happening in the world and use National City to reflect that. We want to explore J’onn being on the streets among the people so we can continue to tell those stories.\n\nQUELLER | We’re looking to tell much more grounded stories, like we have in seasons past, that reflect the climate we’re all living in in 2018.\n\nTVLINE | I imagine that James outing himself as Guardian will also affect his future at CatCo…?\n\nQUELLER | You’ll have to wait and see, but it’s very cool and it takes twists and turns. James has great stuff coming up.\n\nTVLINE | And what about Lena? All that talk of testing concerned me. She may be good now, but she’s still a Luthor.\n\nROVNER | Well, what’s exciting about the character is exactly what you mentioned. She has two sides to her, and it’ll be interesting to see exactly where she’ll end up on the good-to-bad spectrum. That’s a story we want to continue to explore next season.\n\nYour thoughts on Supergirl‘s third season finale? Hopes for Season 4? Grade the episode below, then drop a comment with your full review.", "images": ["https://tvline.com/wp-content/uploads/2022/08/october-streaming-2022.jpg?w=280", "https://www.sportico.com/wp-content/uploads/2022/03/transax-copy.jpg?resize=180,101", "https://tvline.com/wp-content/uploads/2022/05/fire-country-cbs-2.jpg?w=620", "https://tvline.com/wp-content/uploads/2018/06/supergirl-recap-season-3-finale.jpg?w=620", "https://tvline.com/wp-content/uploads/2018/06/supergirl-recap-season-3-finale.jpg?w=620&h=420&crop=1", "https://pixel.quantserve.com/pixel?a.1=p-60R-umvc0T-Cw&a.2=p-31f3D02tYU8zY", "https://tvline.com/wp-content/uploads/2018/06/supergirl-jeremy-jordan.jpg?w=300", "https://tvline.com/wp-content/uploads/2018/06/supergirl-finale-guardian.jpg?w=300", "https://tvline.com/wp-content/uploads/2022/09/teen-wolf-movie-release-date.jpg?w=620", "https://www.indiewire.com/wp-content/uploads/2022/10/GettyImages-1094598354.jpg?resize=180,101", "https://spy.com/wp-content/uploads/2022/10/Defrosting-Tray.jpg?resize=180,101", "https://tvline.com/wp-content/uploads/2022/09/walker-recap.jpg?w=210&h=140&crop=1", "https://secure-us.imrworldwide.com/cgi-bin/m?ci=us-203220h&cg=0&cc=1&ts=noscript", "https://variety.com/wp-content/uploads/2022/10/Fire-Country-Firefighters.jpg?resize=180,101", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://tvline.com/wp-content/uploads/2022/10/wheel-of-time-season-2-teaser-photos.jpeg?w=620", "https://tvline.com/wp-content/themes/pmc-tvline-2014/library/images/follow_us_on_facebook_graphic.png", "https://tvline.com/wp-content/uploads/2022/09/walker-independence-recap.jpg?w=210&h=140&crop=1", "https://tvline.com/wp-content/uploads/2018/06/supergirl-finale-reign.jpg?w=300", "https://tvline.com/wp-content/uploads/2022/10/fire-country-bode-freddy.jpg?w=630", "https://tvline.com/wp-content/uploads/2022/10/wolf-pack-trailer.jpg?w=620", "https://deadline.com/wp-content/uploads/2022/04/Screenshot-2022-04-18-at-08.52.07.png?resize=180,101"], "top_img": "https://tvline.com/wp-content/uploads/2018/06/supergirl-recap-season-3-finale.jpg?w=620", "keywords": [], "authors": ["Andy Swift"], "canonical_link": "https://tvline.com/2018/06/18/supergirl-recap-season-3-finale-ending-explained-red-son/", "title": "Supergirl Finale: EPs Break Down Winn's 'Fitting' Exit, Reign's Fate, Kara's Season 4 Twist and More", "meta_data": {"HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width, initial-scale=1.0 maximum-scale=1, user-scalable=no", "p": {"domain_verify": "9ad238c78ee34da2d6d96a41981790d2"}, "description": "The executive producers of The CW's 'Supergirl' break down the biggest moments from the Season 3 finale, including that big cliffhanger.", "news_keywords": "Jessica Queller, Robert Rovner, Supergirl, The CW", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=1377345661", "generator": "WordPress 6.0.2", "author": "Andy Swift", "theme-color": "#fff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "TVLine", "application-name": "TVLine", "content_type": "Article", "post_id": 957028, "title": "<i>Supergirl</i> Finale: EPs Break Down Winn's 'Fitting' Exit, Reign's Fate, Kara's Season 4 Twist and More", "published_at": "2018-06-18 17:59:46", "image": "https://tvline.com/wp-content/uploads/2018/06/supergirl-recap-season-3-finale.jpg?w=300&h=208&crop=1", "comment_count": 161, "tags": "The CW", "topics": "Spoilers", "body": "Supergirl wrapped its third season on Monday with an explosive final showdown between Reign and the Girl of Steel, setting the stage for an exciting — and very different — fourth outing this fall.\r\n\r\n\r\n\r\nBefore we go inside the episode (via executive producers Robert Rovner and Jessica Queller), here's a quick recap: Supergirl defeated Reign (and saved Sam!) with help from the Legion Ring; Brainy revealed that one of his \"distant relatives\" survived the Blight and made the future uninhabitable for all other A.I.s, explaining why he's sticking around; Winn agreed to take Brainy's place in the Legion and travel to the future; Mon-El decided to return to the future with him; Alex was promoted to Director of the DEO by J'onn, who's going to live among the people moving forward; James formally outed himself as Guardian to the world; and Lena proceeded to \"phase two\" of her mysterious tests on the powerful Kryptonian rock.\r\n\r\nThen came the episode's final scene, which introduced a second Kara — one born from the aura that left Supergirl's body during the battle with Reign — in Siberia.\r\n\r\n\"For fans of the comics, I think they might recognize that the story we want to tell is inspired by the iconic DC Comics' Red Son, which told an alternate origin story for Superman,\" Rovner tells TVLine, to which Queller adds, \"What happened if — as a baby — Superman landed in Russia and became a hero there instead of in America. It's an homage to that.\"\r\n\r\nRead on for more insight from the show's EPs, including details about Sam and Ruby's future on the show (or lack thereof):\r\n\r\nTVLINE | Let's start by talking about Winn, who will return next season in a recurring capacity. In your eyes, what made joining the Legion the right next step for him?\r\nQUELLER | We were so excited when that idea came up in the writers' room, because it seemed so in-character with Winn. We asked what Winn’s dream would be, and that just met it perfectly.\r\nROVNER | We've been talking about this ever since the episode where Winn's mom came back, when he was contemplating his destiny and what his impact would be on the world. We wanted to give him a fitting way to dramatize what we saw for Winn's future.\r\nQUELLER | He's really fulfilling his full potential. Just imagine all that he could do in the future with his mind.\r\n\r\nTVLINE | We may be losing Winn as a full-time member of the team, but on the plus side, we're getting more Brainy. What excites you about bringing him into the fold and telling his stories?\r\nQUELLER | Everything excites us. We love Brainy, and we love Jesse Rath. He’s just a magical actor. The character is delightful and brings fresh new eyes to Earth. Everything is brand new to him, which is just great to be around.\r\n\r\nTVLINE | With Mon-El gone, is there any chance you'll be exploring the romantic link between Brainiac-5 and Supergirl from the comics?\r\nROVNER | We did that a little bit when he first arrived. I think he'll always have affection for Supergirl, but you'll have to stay tuned.\r\n\r\nTVLINE | Odette Annable isn't going to be a regular next season, and the Reign storyline seems pretty wrapped up. Is this the last we've seen of Sam and Ruby?\r\nROVNER | We hope not. We love Odette. She was amazing in this dual role, playing different characters. We fell in love with her as Sam and we were terrified of her as Reign. If it works out, we’d love to have her back for a few episodes next season.\r\n\r\nTVLINE | A lot of the fans speculated that Sam wouldn't survive, leaving Alex to adopt Ruby. Did you ever consider going in that direction?\r\nQUELLER | We discussed all options, but we really felt like we wanted a heartwarming ending after all the trauma we put everyone through. We didn't want to separate Ruby from her mother. The world is experiencing enough trauma, we wanted to have a happy ending for the little girl.\r\nROVNER | This episode was about our heroes saving Sam, so we thought it was important that we accomplish what we set out to do. We're really excited that Sam was empowered and able to play a part in all of it.\r\n\r\nTVLINE | Still, motherhood remains an important goal of Alex's, even as she's heading up the DEO. Can she have it all?\r\nROVNER | We hope so. We're excited about Alex’s journey, going back in the dating world and exploring options for motherhood and the challenges of taking on this big job at the DEO.\r\nQUELLER | It's a very universal story. What’s exciting is the process of watching a human being strive to have it all. We all strive to in our different ways, and Alex is a wonderful prototype of that. She's a powerful career woman, but she wants balance. The process of how she achieves — or doesn't achieve — that is what we’re excited to tell.\r\n\r\nTVLINE | And J'onn? I'm excited to see where this new journey takes him.\r\nROVNER | We thought it was important for his character to take in the teachings his father was trying to impart on him. Our Worldkiller story took us off-world a lot, but what's great about this show is that we get to tell stories about what’s happening in the world and use National City to reflect that. We want to explore J’onn being on the streets among the people so we can continue to tell those stories.\r\nQUELLER | We're looking to tell much more grounded stories, like we have in seasons past, that reflect the climate we're all living in in 2018.\r\n\r\nTVLINE | I imagine that James outing himself as Guardian will also affect his future at CatCo...?\r\nQUELLER | You’ll have to wait and see, but it’s very cool and it takes twists and turns. James has great stuff coming up.\r\n\r\nTVLINE | And what about Lena? All that talk of testing concerned me. She may be good now, but she's still a Luthor.\r\nROVNER | Well, what's exciting about the character is exactly what you mentioned. She has two sides to her, and it'll be interesting to see exactly where she'll end up on the good-to-bad spectrum. That's a story we want to continue to explore next season.\r\n\r\nYour thoughts on Supergirl's third season finale? Hopes for Season 4? Grade the episode below, then drop a comment with your full review.", "fb": {"pages": 187516444593639}, "fragment": "!", "og": {"type": "article", "title": "Supergirl Finale: EPs Break Down Winn's 'Fitting' Exit, Reign's Fate, Kara's Season 4 Twist and More", "url": "https://tvline.com/2018/06/18/supergirl-recap-season-3-finale-ending-explained-red-son/", "description": "Supergirl wrapped its third season on Monday with an explosive final showdown between Reign and the Girl of Steel, setting the stage for an exciting — and very different — fourth outing this fall. …", "site_name": "TVLine", "image": {"identifier": "https://tvline.com/wp-content/uploads/2018/06/supergirl-recap-season-3-finale.jpg?w=620", "width": 620, "height": 420, "alt": "Supergirl Recap Season 3 Finale"}, "locale": "en_US"}, "article": {"published_time": "2018-06-19T00:59:46+00:00", "modified_time": "2018-06-20T13:29:58+00:00"}, "twitter": {"site": "@TVLine", "creator": "@AndySwift", "card": "summary_large_image", "title": "Supergirl Finale: EPs Break Down Winn's 'Fitting' Exit, Reign's Fate, Kara's Season 4 Twist and More", "description": "The executive producers of The CW's 'Supergirl' break down the biggest moments from the Season 3 finale, including that big cliffhanger.", "image": "https://tvline.com/wp-content/uploads/2018/06/supergirl-recap-season-3-finale.jpg?w=620"}, "msapplication-TileImage": "https://tvline.com/wp-content/uploads/2018/06/logo-tvline.png?w=270"}, "movies": [], "publish_date": 1529276400.0, "source": "https://tvline.com", "summary": ""}