{"url": "https://www.billboard.com/articles/news/bbma/7801226/Billboard-music-awards-2017-full-show-recap", "text": "Drake stole the show at the 2017 Billboard Music Awards in more ways than one, taking home 13 honors, surpassing Adele‘s mark as the artist with the most BBMA wins in one night, delivering a fiery performance in the middle of the famous Bellagio fountain and, maybe, getting himself a date after hitting on co-host Vanessa Hudgens during his acceptance speech for winning Top Billboard 200 Album for Views.\n\nExplore See latest videos, charts and news Celine Dion Cher Drake See latest videos, charts and news\n\nWatch\n\n“It’s crazy that we’re all here on earth for a limited amount of time, and we gotta show love while we’re here,” he said on stage midway through the telecast, before getting straight to the point: “Vanessa Hudgens, you look incredible tonight.” (Hudgens acknowledged that shortly afterward by asking if she was on the invite list for Drake’s afterparty.)\n\nBy then, Drake had already racked up 12 BBMAs — 10 in the pre-telecast categories, and one earlier in the show for Top Male Artist — on his way to a record-breaking 13 victories, which he achieved with the evening’s final honor, Top Artist, to overtake Adele’s previous record of 12 in 2012. It’s an impressive number for an artist who utterly dominated 2016, shattering streaming records over and over again with the success of his album Views and its monster single “One Dance” featuring WizKid and Kyla.\n\n“Life is like toilet paper,” he said while accepting his final award. “Either you’re on a roll, or taking sh-t from assholes.”\n\nRelated Here Is the Complete List of Winners From the 2017 Billboard Music Awards\n\nCher was presented with the prestigious Icon Award and rolled back the years with a high-powered performance of her iconic songs “Believe” and “If I Could Turn Back Time” — sporting, fittingly, completely different looks for each performance — a day after her 71st birthday. “I’ve wanted to do what I do since I was four years old, and I’ve been doing it for 53 years,” she said with a humble air during her acceptance speech. “I think luck has so much to do with with my success… I think it was mostly luck and a little bit of something thrown in.”\n\nDrake also won Top Hot 100 Artist, Top Billboard 200 Artist and Top Rap Artist, and took home awards for song sales, song streams and several rap and R&B categories on his way to lucky 13. Beyoncé earned Top Female Artist, Zayn was awarded Top New Artist and Blake Shelton (Country), Beyoncé (R&B), Twenty One Pilots (Rock), Juan Gabriel (Latin), The Chainsmokers (Dance/Electronic) and Lauren Daigle (Christian) and Kirk Franklin (Gospel) won top artist honors in their respective genres. Twenty One Pilots and Beyoncé were also big winners on the night, with five BBMAs apiece, while The Chainsmokers earned four.\n\nRelated The 10 Best Moments of the 2017 Billboard Music Awards\n\nThe show spent most of its three hours, fittingly, on performances and awards rather than hosting gimmicks, with 15 performances that ran the gamut of genres from hip-hop to pop to dance to rock to country. Nicki Minaj opened the show with a star-studded medley that included her Remy Ma diss track “No Frauds,” which she performed with Lil Wayne, David Guetta‘s “Light My Body Up,” Jason Derulo‘s “Swalla” and her own “Regret In Your Tears,” bringing out each superstar in turn. Camila Cabello and Miley Cyrus both delivered the live debuts of their new singles — Cabello’s first solo songs since leaving Fifth Harmony, an emotional-yet-brief “I Have Questions” and a heated-up “Crying In the Club,” and Cyrus’ country-tinged comeback release “Malibu” — while Lorde (“Green Light,” performed as if at a goofy and awkward karaoke night), Sam Hunt (“Body Like a Back Road”) and John Legend (“Surefire”), who was then joined by Florida Georgia Line for a surprise joint rendition of FGL’s “H.O.L.Y.,” all chipped in with memorable performances.\n\nHudgens was a natural in her first year as co-host alongside veteran BBMAs host Ludacris, and their monologue would have had her in the headlines regardless of Drake’s unabashed flirting. In hyping the performances to come, Hudgens showed off both her pipes and rapping skills with a cappella versions of Celine Dion‘s “Power of Love” and Nicki Minaj’s verse from “Monster,” impressing both Luda and the crowd in the process.\n\nSpeaking of Dion, the diva performed her iconic song “My Heart Will Go On” 20 years after its initial prominence as the main song from the blockbuster Leonardo DiCaprio–Kate Winslet film Titanic, navigating the challenging track effortlessly and earning an extended standing ovation. (Read Billboard‘s oral history of the song right here.) It was easily one of the standout moments of the night, and impressive in its emotion and vocal dexterity.\n\nDiddy also took the stage to pay tribute to The Notorious B.I.G. on what would have been the rapper’s 45th birthday and debuted the trailer for his upcoming Bad Boy Records documentary Can’t Stop, Won’t Stop. “It all started with the Notorious B.I.G.,” Diddy said, referencing Bad Boy’s creation and the 500 million albums it sold over the past 20-plus years. “Big sold over 25 million records worldwide; his Ready to Die album, his Life After Death album, classics… Biggie was the best rapper I ever had the chance to work with. Watching him and seeing him work is something that words can’t explain.”\n\nBruno Mars, whose recent awards show performances have leaned more towards glitzy funk showstoppers like “24K Magic” and his excellent tribute to Prince alongside The Time during the Grammys earlier this year, took a different route for this one, getting passionate with his latest single “Versace On the Floor” as the show wound towards its conclusion.\n\nBut there was only one way it would end: with Drake complete his record-breaking evening with the top award to go with his new place in BBMA history. His huge night catapulted him into the top 10 of artists who have won the most Billboard Music Awards over the years, though he still has a way to go to catch Taylor Swift at 21. But with the March release of his playlist-album More Life already shattering records he’d set last year with Views, it’s hard to imagine he won’t be gracing BBMA stages for years to come.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.billboard.com/wp-content/uploads/media/drake-bbmas-press-room-2017-a-billboard-1548.jpg?w=1024", "https://www.facebook.com/tr?id=204652553202666&ev=PageView&noscript=1", "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/public/lazyload-fallback.gif", "http://static.billboard.com/files/media/BB-Promo-bbmas.jpg"], "top_img": "https://www.billboard.com/wp-content/uploads/media/drake-bbmas-press-room-2017-a-billboard-1548.jpg?w=1024", "keywords": [], "authors": ["Dan Rys"], "canonical_link": "https://www.billboard.com/music/awards/billboard-music-awards-2017-full-show-recap-7801226/", "title": "Drake Sets Single-Year Record, Celine Dion & Cher Shine at 2017 Billboard Music Awards", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/icons/icon-144x144.png", "msapplication-TileColor": "#eff4ff", "description": "Drake stole the show at the 2017 Billboard Music Awards in more ways than one, taking home 13 honors and surpassing Adele's mark as the artist with the most BBMA wins in one night.", "news_keywords": "2018 billboard music awards, autoplay, BBMA, BBMAs", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "billboard", "pmc-page_type": "article", "articleid": 7801226, "author": "Dan Rys", "pmc-category": "Awards,Music", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-05-21T23:58:57"}, "pmc-tag": "2018 billboard music awards,autoplay,BBMA,BBMAs", "title": "Drake Sets Single-Year Record, Celine Dion & Cher Shine at 2017 Billboard Music Awards", "pageclass": "article", "pmc-is_free": "no", "pmc-always-paywall": "no", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-exclusive": "no", "pmc-breaking-news": "no", "pmc-prime": "no"}, "generator": "WordPress 6.0.2", "author": "Dan Rys", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Billboard", "application-name": "Billboard", "content_type": "Article", "post_id": 7801226, "title": "Drake Sets Single-Year Record, Celine Dion & Cher Shine at 2017 Billboard Music Awards", "published_at": "2017-05-21 23:58:57", "image": "https://www.billboard.com/wp-content/uploads/media/drake-bbmas-press-room-2017-a-billboard-1548.jpg?w=1024", "comment_count": 0, "tags": "BBMAs", "topics": "Music", "body": "Drake stole the show at the 2017 Billboard Music Awards in more ways than one, taking home 13 honors, surpassing Adele's mark as the artist with the most BBMA wins in one night, delivering a fiery performance in the middle of the famous Bellagio fountain and, maybe, getting himself a date after hitting on co-host Vanessa Hudgens during his acceptance speech for winning Top Billboard 200 Album for Views.Watch\"It's crazy that we're all here on earth for a limited amount of time, and we gotta show love while we're here,\" he said on stage midway through the telecast, before getting straight to the point: \"Vanessa Hudgens, you look incredible tonight.\" (Hudgens acknowledged that shortly afterward by asking if she was on the invite list for Drake's afterparty.)By then, Drake had already racked up 12 BBMAs -- 10 in the pre-telecast categories, and one earlier in the show for Top Male Artist -- on his way to a record-breaking 13 victories, which he achieved with the evening's final honor, Top Artist, to overtake Adele's previous record of 12 in 2012. It's an impressive number for an artist who utterly dominated 2016, shattering streaming records over and over again with the success of his album Views and its monster single \"One Dance\" featuring WizKid and Kyla.\"Life is like toilet paper,\" he said while accepting his final award. \"Either you're on a roll, or taking sh-t from assholes.\"Cher was presented with the prestigious Icon Award and rolled back the years with a high-powered performance of her iconic songs \"Believe\" and \"If I Could Turn Back Time\" -- sporting, fittingly, completely different looks for each performance -- a day after her 71st birthday. \"I've wanted to do what I do since I was four years old, and I've been doing it for 53 years,\" she said with a humble air during her acceptance speech. \"I think luck has so much to do with with my success... I think it was mostly luck and a little bit of something thrown in.\"Drake also won Top Hot 100 Artist, Top Billboard 200 Artist and Top Rap Artist, and took home awards for song sales, song streams and several rap and R&B categories on his way to lucky 13. Beyoncé earned Top Female Artist, Zayn was awarded Top New Artist and Blake Shelton (Country), Beyoncé (R&B), Twenty One Pilots (Rock), Juan Gabriel (Latin), The Chainsmokers (Dance/Electronic) and Lauren Daigle (Christian) and Kirk Franklin (Gospel) won top artist honors in their respective genres. Twenty One Pilots and Beyoncé were also big winners on the night, with five BBMAs apiece, while The Chainsmokers earned four.The show spent most of its three hours, fittingly, on performances and awards rather than hosting gimmicks, with 15 performances that ran the gamut of genres from hip-hop to pop to dance to rock to country. Nicki Minaj opened the show with a star-studded medley that included her Remy Ma diss track \"No Frauds,\" which she performed with Lil Wayne, David Guetta's \"Light My Body Up,\" Jason Derulo's \"Swalla\" and her own \"Regret In Your Tears,\" bringing out each superstar in turn. Camila Cabello and Miley Cyrus both delivered the live debuts of their new singles -- Cabello's first solo songs since leaving Fifth Harmony, an emotional-yet-brief \"I Have Questions\" and a heated-up \"Crying In the Club,\" and Cyrus' country-tinged comeback release \"Malibu\" -- while Lorde (\"Green Light,\" performed as if at a goofy and awkward karaoke night), Sam Hunt (\"Body Like a Back Road\") and John Legend (\"Surefire\"), who was then joined by Florida Georgia Line for a surprise joint rendition of FGL's \"H.O.L.Y.,\" all chipped in with memorable performances.Hudgens was a natural in her first year as co-host alongside veteran BBMAs host Ludacris, and their monologue would have had her in the headlines regardless of Drake's unabashed flirting. In hyping the performances to come, Hudgens showed off both her pipes and rapping skills with a cappella versions of Celine Dion's \"Power of Love\" and Nicki Minaj's verse from \"Monster,\" impressing both Luda and the crowd in the process.Speaking of Dion, the diva performed her iconic song \"My Heart Will Go On\" 20 years after its initial prominence as the main song from the blockbuster Leonardo DiCaprio-Kate Winslet film Titanic, navigating the challenging track effortlessly and earning an extended standing ovation. (Read Billboard's oral history of the song right here.) It was easily one of the standout moments of the night, and impressive in its emotion and vocal dexterity.Diddy also took the stage to pay tribute to The Notorious B.I.G. on what would have been the rapper's 45th birthday and debuted the trailer for his upcoming Bad Boy Records documentary Can't Stop, Won't Stop. \"It all started with the Notorious B.I.G.,\" Diddy said, referencing Bad Boy's creation and the 500 million albums it sold over the past 20-plus years. \"Big sold over 25 million records worldwide; his Ready to Die album, his Life After Death album, classics... Biggie was the best rapper I ever had the chance to work with. Watching him and seeing him work is something that words can't explain.\"Bruno Mars, whose recent awards show performances have leaned more towards glitzy funk showstoppers like \"24K Magic\" and his excellent tribute to Prince alongside The Time during the Grammys earlier this year, took a different route for this one, getting passionate with his latest single \"Versace On the Floor\" as the show wound towards its conclusion.But there was only one way it would end: with Drake complete his record-breaking evening with the top award to go with his new place in BBMA history. His huge night catapulted him into the top 10 of artists who have won the most Billboard Music Awards over the years, though he still has a way to go to catch Taylor Swift at 21. But with the March release of his playlist-album More Life already shattering records he'd set last year with Views, it's hard to imagine he won't be gracing BBMA stages for years to come.", "fb": {"pages": 75791669580}, "fragment": "!", "og": {"type": "article", "title": "Drake Sets Single-Year Record, Celine Dion & Cher Shine at 2017 Billboard Music Awards", "url": "https://www.billboard.com/music/awards/billboard-music-awards-2017-full-show-recap-7801226/", "description": "Drake stole the show at the 2017 Billboard Music Awards in more ways than one, taking home 13 honors and surpassing Adele’s mark as the artist with the most BBMA wins in one night.", "site_name": "Billboard", "image": {"identifier": "https://www.billboard.com/wp-content/uploads/media/drake-bbmas-press-room-2017-a-billboard-1548.jpg?w=1024", "width": 1024, "height": 677, "alt": "Drake poses in the press room with his awards at the 2017 Billboard Music Awards at T-Mobile Arena on May 21, 2017 in Las Vegas."}, "locale": "en_US"}, "article": {"published_time": "2017-05-22T03:58:57+00:00", "modified_time": "2018-05-18T19:23:03+00:00"}, "twitter": {"site": "@billboard", "creator": "@danrys", "card": "summary_large_image", "title": "Drake Sets Single-Year Record, Celine Dion & Cher Shine at 2017 Billboard Music Awards", "description": "Drake stole the show at the 2017 Billboard Music Awards in more ways than one, taking home 13 honors and surpassing Adele's mark as the artist with the most BBMA wins in one night.", "image": "https://www.billboard.com/wp-content/uploads/media/drake-bbmas-press-room-2017-a-billboard-1548.jpg?w=1024"}}, "movies": [], "publish_date": 1495425537.0, "source": "https://www.billboard.com", "summary": ""}