{"url": "https://money.cnn.com/2017/10/10/media/late-night-tv-harvey-weinstein/index.html", "text": "Late night TV was slammed by social media and news outlets for not addressing the sexual harassment allegations against Hollywood mogul Harvey Weinstein last week, but late night let loose on Monday.\n\nABC's Jimmy Kimmel opened his Monday night show explaining how he got into a Twitter spat with Donald Trump Jr., who asked him on Twitter about his thoughts on Weinstein.\n\n\"He's speaking, I don't know if you know about this, but there was an expose in the New York Times about decades of sexual harassment accusations made against movie producer Harvey Weinstein, who is not the President, and isn't particularly well-known outside of L.A. and New York,\" Kimmel said. \"But the insinuation was that we, as part of the biased left-wing media propaganda machine, wouldn't say anything about him because he's a Democrat. Never mind the thousands of jokes about Bill Cosby and Bill Clinton and all the other Bills of that ilk.\"\n\nThe host also said that people pointed out that Weinstein was a Hillary Clinton supporter.\n\n\"I'm not defending Hillary Clinton. The fact is, her campaign did take money from what turned out to be a high-profile man who has been accused of sexual harassment multiple times, and not just one of them, by the way. She took money from two of them!\" Kimmel said. \"Harvey Weinstein and Donald Trump, who donated to Hillary's campaign in 2008.\"\n\nHillary Clinton has, so far, not spoken publicly about the controversy.\n\nKimmel then ended his story with a joke about the producer, which he said he promised he would do.\n\n\"What's the difference between Harvey Weinstein and the Pillsbury Doughboy?\" he said. \"When the Pillsbury Doughboy offers you a roll, he doesn't ask you to watch him take a shower for it.\"\n\nStephen Colbert commented on the scandal during Monday night's episode of CBS' \"The Late Show,\" explaining that the producer was fired from his own production company -- The Weinstein Company. This, Colbert joked, forced them to change their name to something more positive: \"Asbestos Child Slappers, Inc.\"\n\nColbert then rattled off a few jokes about the reported allegations against Weinstein, calling the producer's alleged behavior \"monstrous\" and \"indefensible.\"\n\n\"Weinstein's lawyers called him 'a dinosaur learning new ways,'\" Colbert said. \"Okay, A) that's no excuse, B) dinosaurs did not touch themselves in front of the employees. The T-Rex's arms were way too short.\"\n\nRelated: Late night TV slammed for overlooking Harvey Weinstein scandal\n\nJimmy Fallon also made a joke about the subject during his opening monologue on Monday's \"Tonight Show.\"\n\n\"Harvey Weinstein was fired by his company yesterday for being accused of sexual harassment,\" the NBC host said. \"They said if he keeps it up, he'll end up with his own show on Fox News.\"\n\nSeth Meyers, host of NBC's \"Late Night,\" brought out three female writers on the show to talk about the allegations.\n\nHere's what the women of #LNSM have to say about Harvey Weinstein. pic.twitter.com/r4oGo8yFAj — Late Night (@LateNightSeth) October 10, 2017\n\nThe bit showed the women on the \"Late Night\" staff reacting around the office to Weinstein's apology by pantomiming shock by spitting out their coffee in each other's faces, and having what appeared to be their eyes literally pop out of their heads.", "images": ["https://i.cdn.turner.com/money/video/bvp/images/1.gif", "https://i.cdn.turner.com/money/.element/img/8.0/authors/byline-icon/frank-pallotta.png", "https://pixel.quantserve.com/pixel/p-D1yc5zQgjmqr5.gif", "https://i.cdn.turner.com/money/images/1.gif", "https://i2.cdn.turner.com/money/.element/img/8.0/newsletters/reliable_sources/rs-with-button_large1x1.jpg", "https://i2.cdn.turner.com/money/dam/assets/171010040440-stephen-colbert-harvey-weinstein-dinosaur-screengrab-101017-1024x576.jpg", "https://i2.cdn.turner.com/money/dam/assets/171005114609-harvey-weinstein-780x439.jpg", "https://money.cnn.com/.element/cnnm-3.0/img/logo/logo_cnnbusiness.png", "https://money.cnn.com/.element/cnnm-3.0/img/logo/logo_cnn.svg"], "top_img": "https://i2.cdn.turner.com/money/dam/assets/171005114609-harvey-weinstein-780x439.jpg", "keywords": [], "authors": ["Frank Pallotta"], "canonical_link": "https://money.cnn.com/2017/10/10/media/late-night-tv-harvey-weinstein/index.html", "title": "Late night TV lets loose on Harvey Weinstein", "meta_data": {"viewport": "width=1140", "date": "2017-10-10 01:23:03", "title": "Late night TV lets loose on Harvey Weinstein", "description": "Late night TV was slammed for not addressing the sexual harassment allegations against Harvey Weinstein, but late night let loose on Monday.", "keywords": "Harvey Weinstein, sexual harassment", "news_keywords": "Harvey Weinstein, sexual harassment", "author": "Frank Pallotta", "section": "media", "og": {"title": "Late night TV lets loose on Harvey Weinstein", "type": "article", "url": "https://money.cnn.com/2017/10/10/media/late-night-tv-harvey-weinstein/index.html", "image": {"identifier": "https://i2.cdn.turner.com/money/dam/assets/171005114609-harvey-weinstein-780x439.jpg", "width": 780, "height": 439}, "site_name": "CNNMoney", "description": "Late night TV was slammed for not addressing the sexual harassment allegations against Harvey Weinstein, but late night let loose on Monday."}, "fb": {"app_id": 521848191196480}, "twitter": {"card": "summary_large_image", "site": "@CNNMoney", "url": "https://money.cnn.com/2017/10/10/media/late-night-tv-harvey-weinstein/index.html", "title": "Late night TV lets loose on Harvey Weinstein", "description": "Late night TV was slammed for not addressing the sexual harassment allegations against Harvey Weinstein, but late night let loose on Monday.", "image": "https://i2.cdn.turner.com/money/dam/assets/171005114609-harvey-weinstein-540x304.jpg"}, "DC.date.issued": "2017-10-10T01:23:03"}, "movies": ["https://www.youtube.com/embed/5xgX_tNTWgs"], "publish_date": 1507590000.0, "source": "https://money.cnn.com", "summary": ""}