{"url": "https://en.wikipedia.org/wiki/American_Music_Awards", "text": "Annual American music awards show\n\nThe American Music Awards (AMAs) is an annual American music awards show, generally held in the fall, created by Dick Clark in 1973 for ABC when the network's contract to air the Grammy Awards expired, and currently produced by MRC Live & Alternative, which Dick Clark Productions was folded into in the fall of 2021.[1] From 1973 to 2005, both the winners and the nominations were selected by members of the music industry, based on commercial performance, such as sales and airplay. Since 2006, winners have been determined by a poll of the public and fans, who can vote through the AMAs website.[2]\n\nHistory and overview [ edit ]\n\nConception [ edit ]\n\nThe AMAs was created by Dick Clark in 1973 to compete with the Grammy Awards after the move of that year's show to Nashville, Tennessee led to CBS (which has broadcast all Grammy Award shows since then) picking up the Grammy telecasts after its first two in 1971 and 1972 were broadcast on ABC. In 2014, American network Telemundo acquired the rights to produce a Spanish-language version of the American Music Awards and launched the Latin American Music Awards in 2015.[3][4]\n\nFrom 1973 to 2005, both the winners and the nominations were selected by members of the music industry, based on commercial performance, such as sales and airplay. Since 2006, winners have been determined by a poll of the public and fans, who can vote through the AMAs website, while nominations have remained based on sales, airplay, now including activity on social networks, and video viewing. Before 2010, had nominations based only on sales and airplay and nominated every work, even if old. The Grammys have nominations based on vote of the Academy and only nominate a work from their eligibility period that changes often.[5][6][7]\n\nThe award statuette is manufactured by New York firm Society Awards.[8]\n\nHosts [ edit ]\n\nThe first hosts for the first telecast of the AMAs were Helen Reddy, Roger Miller, and Smokey Robinson. Helen Reddy not only hosted the show but also became the first female artist to win an AMA for Favorite Pop/Rock Female artist. For the first decade or so, the AMAs had multiple hosts, each representing a genre of music. For instance, Glen Campbell would host the country portion (Campbell, in fact, has co-hosted the AMAs more times than any other host or co-host), while other artists would co-host to represent their genre. In recent years, however, there has been one single host.\n\nIn 1991, Keenen Ivory Wayans became the first Hollywood actor to host the AMAs.\n\nFrom its inception in 1973 through 2002, the AMAs were held in mid- to late-January, but were moved to November (usually the Sunday before Thanksgiving) beginning in 2003 so as not to further compete with other major awards shows (such as the Golden Globe Awards and the Academy Awards) and allows for ABC to have a well-rated awards show during November sweeps.\n\nFor the 2008 awards, Jimmy Kimmel hosted for the fourth consecutive year. In 2009–2012, there was no host for the first time in history. Instead, the AMAs followed the Grammys' lead in having various celebrities give introductions. However, rapper Pitbull hosted the 2013 ceremony and 2014 ceremony. Jennifer Lopez hosted the 2015 show.[9] Gigi Hadid and Jay Pharoah hosted the 2016 show. Tracee Ellis Ross hosted the show in 2017 and 2018. Ciara hosted the 2019 show.[10]\n\nBetween 2012 and 2014, as part of a marketing strategy for Samsung, the American Music Awards used the lock screen wallpaper of Samsung Galaxy smartphones rather than envelopes to reveal winners. A magnetic screen cover on each phone kept the wallpaper image with the winner's name secret until opened.[11]\n\nIn August 2018, Dick Clark Productions announced a two-year sponsorship and content partnership with YouTube Music.[12]\n\nCeremonies [ edit ]\n\nCategories [ edit ]\n\nCurrent award categories [ edit ]\n\nPast award categories [ edit ]\n\nMost wins [ edit ]\n\nThe record for most American Music Awards won is held by Taylor Swift, who has amassed thirty-four awards.[13] The record for most American Music Awards won by a male artist belongs to Michael Jackson, who has collected twenty-six awards.[14] The record for most American Music Awards won by a group belongs to Alabama, who have collected eighteen awards.[15]\n\nMost wins in a single ceremony [ edit ]\n\nThe record for the most American Music Awards won in a single year is held by Michael Jackson (in 1984) and Whitney Houston (in 1994), each with 8 awards to their credit (including the Award of Merit, with which both artists were honored in the respective years).\n\nMost wins by category [ edit ]\n\nThe following list shows the artists with most wins in each category, adapted from the AMAs official website.[16]\n\nArtist of the Year: Taylor Swift (6 wins)\n\nCollaboration of the Year: Justin Bieber (3 wins)\n\nSong of the Year: Kenny Rogers (5 wins)\n\nThe Song of the Year record holder accounts for all previous single category winners.\n\nThe Favorite Artist – Rap/Hip-Hop record holder accounts for all previous Favorite Male Artist – Rap/Hip-Hop and Favorite Female Artist – Rap/Hip-Hop category winners.\n\nSpecial awards [ edit ]\n\nAward of Merit [ edit ]\n\nThe American Music Award of Merit has been awarded to thirty two artists, the latest being Sting (2016).[17]\n\nInternational Artist Award of Excellence [ edit ]\n\nThe International Artist Award of Excellence is described as \"an award which recognizes artists whose popularity and impact cross national boundaries and is only given when there is a deserving recipient who is worthy of recognition for their accomplishments\" and has been awarded to seven artists:[18]\n\nIcon Award [ edit ]\n\nThe AMAs' producer Larry Klein stated: \"The first-ever Icon Award was created to honor an artist whose body of work has made a profound influence over pop music on a global level.\"[19]\n\nDick Clark Award for Excellence [ edit ]\n\nAt the 2014 award ceremony, the Dick Clark Award for Excellence was given for the first time.[20] It was created to recognize \"an artist who achieves a groundbreaking feat or creates a landmark work. It is to be bestowed upon someone whose spirit and excellence capture the visionary passion that Dick Clark himself incorporated into everything he did.\"[21]\n\nAward of Achievement [ edit ]\n\nLifetime Achievement Award [ edit ]\n\nArtist of the Decade [ edit ]\n\nIn 2000, the year Brooks won the award, the AMAs held a poll to elect the Artist of the Decade for each previous decade of the Rock & Roll era. According to some sources, the result of this poll is not counted in the total of AMAs won by these artists.[25][26][27] The results were Elvis Presley (1950s), The Beatles (1960s), Stevie Wonder (1970s), and Michael Jackson (1980s).\n\nPoll\n\n1950s: Elvis Presley\n\n1960s: The Beatles\n\n1970s: Stevie Wonder\n\n1980s: Michael Jackson\n\nArtist of the Century [ edit ]\n\nMichael Jackson won the Artist of the Century award in the 29th American Music Awards held on January 9, 2002.[28]\n\nRatings [ edit ]\n\nSee also [ edit ]\n\nNotes [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/AMAs_2019.png/220px-AMAs_2019.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Olivia_Rodrigo_with_Dr_Fauci_1.png/136px-Olivia_Rodrigo_with_Dr_Fauci_1.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/191125_Lil_Nas_X_at_the_2019_American_Music_Awards.png/117px-191125_Lil_Nas_X_at_the_2019_American_Music_Awards.png", "https://upload.wikimedia.org/wikipedia/commons/b/b1/AMAs_2019.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Doja_Cat_Planet_Her_Day_Party_2_%28cropped%29.jpg/120px-Doja_Cat_Planet_Her_Day_Party_2_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/45_record.png/16px-45_record.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/BTS_for_Dispatch_White_Day_Special%2C_27_February_2019_01.jpg/160px-BTS_for_Dispatch_White_Day_Special%2C_27_February_2019_01.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/b/b1/AMAs_2019.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/American_Music_Awards", "title": "American Music Awards", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/b/b1/AMAs_2019.png", "width": 640, "height": 640}, "title": "American Music Awards - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}