{"url": "https://www.hollywoodreporter.com/news/bachelor-arie-luyendyk-jr-sets-wedding-date-not-tv-1114318", "text": "One day after his ex-fiancee announced that she is now engaged, former Bachelor Arie Luyendyk Jr. revealed that he and Lauren Burnham have set a wedding date.\n\n“We’re getting married in Hawaii on Jan. 12 next year,” Burnham, with Luyendyk by her side, announced on The View Wednesday. “If we were able to get married tomorrow, we would. We’re just ready for that next step.”\n\nThe pair — who just bought a new house in Scottsdale, Ariz., where Luyendyk, a race car driver and real estate broker, is based — have booked Maui’s Haiku Mill for the nontelevised event. “It’s a private wedding, so not on TV,” he confirmed. “Just a close group of friends, probably 100 guests.”\n\nAs ABC’s most-recent Bachelor, Luyendyk became one of the most controversial stars of the long-running franchise when he swapped his final pick. After he proposed to an accepting Becca Kufrin on the pretaped March 5 episode, it was revealed on the post-finale After the Final Rose special that Luyendyk had changed his mind.\n\nAfter a two-month engagement, Luyendyk called off his relationship with Kufrin during a difficult-to-watch on-camera breakup that played out unedited and ran for nearly an hour. He then turned around and proposed a second time on live television to Burnham, who accepted.\n\n“Going back to that time, it was a big risk to do what I did and I know that it wasn’t a popular decision,” Luyendyk explained, “but it was a decision I had to make for myself. At the end of the day, it’s a TV show but this is the rest of our lives, and Lauren was the person I was supposed to be with.”\n\nThe choices made by Luyendyk and producers to ambush Kufrin, and by ABC to air the breakup footage, sent backlash Luyendyk’s way and turned off some fans of the franchise. Think pieces and takedowns ran in the week that followed and as Kufrin accepted her new role as the next star of The Bachelorette, Luyendyk and Burnham largely disappeared from the spotlight, choosing to keep viewers updated on their relationship via their social media channels.\n\nOn Wednesday, the pair said neither of them has watched the finale to this day.\n\n“They say it was unedited but it was edited,” said Luyendyk. “[As the Bachelor,] you are not in the editing room and you can’t really control what they show.”\n\nHe added, “Going into it, the biggest reason why I wanted it to be filmed was so that everyone could see the story. Not only the good things but also the bad things. Just because [with] the finale, there’s always a lot of questions. When [former Bachelor] Jason Mesnick changed his mind — he’s happy and has kids and a great life — they didn’t film anything and fans were upset by that. I really wanted everyone to see our love story and I think the editing chose to show more of the breakup than the happy parts of that ending.”\n\nBurnham admitted that she knew Luyendyk was going to break up with Kufrin, but that filming the heartbreaks are part of what they signed up for.\n\n“I knew he was going to break up with Becca and I knew that production was involved, so I kind of figured that’s what was happening,” she said. “But the whole thing was taped. My breakup was taped and everyone else’s was, that’s kind of the name of the game.”\n\nUnlike a handful of successful Bachelor couples to come before them, Luyendyk and Burnham are opting to not invite ABC’s cameras to their big day. The Bachelor franchise has aired five TV weddings, including original Bachelorette Trista and Ryan Sutter’s and former Bachelor Sean and Catherine Lowe’s.\n\nWhen speaking to The Hollywood Reporter after the finale in March, the couple had said they hoped to set a date later in the year. At the time, they both said they were open to the idea of a TV wedding, but Luyendyk had added, “I think it’s more about if it works in our timeline.”\n\nLuyendyk’s and Burnham’s live TV appearance — their first since a whirlwind post-finale press week — comes days before Kufrin begins her Bachelorette journey Monday.\n\nWhen asked about the curious timing, Burnham replied with a laugh, “Honestly, I don’t think we really had much control over that.” Luyendyk added, “Our plan just came together so it just happens to be the timing of things. We’re excited to do it privately because everyone asks us, so we were like: Why not just come on here and tell everybody?”\n\nThough Burnham played coy about whether or not she has spoken to Kufrin or if they will appear on the upcoming season, Luyendyk had a solid answer when asked if he would do anything differently: “It’s hard to live in regret. Because of how things ended, I think our relationship is stronger and I wouldn’t change it.”\n\nViewers have been particularly invested in Kufrin’s happily ever after ever since she was subjected to the on-camera breakup, and on Tuesday, she revealed that she does in fact find love at the end of her journey, which wrapped filming weeks ago.\n\n“I’m engaged!” she told People. “I still pinch myself, like, did that all just happen? It’s been a whirlwind.”\n\nAdding, “It feels so good to say it and this time, I think it’s going to stick!”\n\nShe also said that now, having been in Luyendyk’s shoes as the lead of the reality dating show, she does sympathize with his decision-making.\n\n“Looking back, as weird as it sounds, I can really only thank [Arie] because he followed his heart and it allowed me to go on this new journey for myself to find the person who is a better suit, better fit for me,” she said. “He’s just a special one.”\n\nTwenty-eight men compete for Kufrin’s final rose when The Bachelorette premieres Monday, May 28, at 8 p.m. on ABC.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/05/arie_lauren.jpg?w=1296&h=730&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/arie_lauren.jpg?w=1024"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/arie_lauren.jpg?w=1024", "keywords": [], "authors": ["Jackie Strause"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/bachelor-arie-luyendyk-jr-sets-wedding-date-not-tv-1114318/", "title": "Controversial ‘Bachelor’ Arie Luyendyk Jr. Reveals Wedding Won’t Be Televised", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The ABC reality star and fiancee Lauren Burnham plan to marry in January — but ABC viewers aren't invited.", "news_keywords": "The Bachelor, The Bachelorette", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Jackie Strause", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1114318, "title": "Controversial 'Bachelor' Arie Luyendyk Jr. Reveals Wedding Won't Be Televised", "published_at": "2018-05-23 09:18:04", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/arie_lauren.jpg?w=1024", "comment_count": 0, "tags": "The Bachelorette", "topics": "TV News", "body": "One day after his ex-fiancee announced that she is now engaged, former Bachelor Arie Luyendyk Jr. revealed that he and Lauren Burnham have set a wedding date.\r\n\"We're getting married in Hawaii on Jan. 12 next year,\" Burnham, with Luyendyk by her side, announced on The View Wednesday. \"If we were able to get married tomorrow, we would. We're just ready for that next step.\"\r\nThe pair — who just bought a new house in Scottsdale, Ariz., where Luyendyk, a race car driver and real estate broker, is based — have booked Maui's Haiku Mill for the nontelevised event. \"It's a private wedding, so not on TV,\" he confirmed. \"Just a close group of friends, probably 100 guests.\"\r\nAs ABC's most-recent Bachelor, Luyendyk became one of the most controversial stars of the long-running franchise when he swapped his final pick. After he proposed to an accepting Becca Kufrin on the pretaped March 5 episode, it was revealed on the post-finale After the Final Rose special that Luyendyk had changed his mind.\r\nAfter a two-month engagement, Luyendyk called off his relationship with Kufrin during a difficult-to-watch on-camera breakup that played out unedited and ran for nearly an hour. He then turned around and proposed a second time on live television to Burnham, who accepted.\r\n\"Going back to that time, it was a big risk to do what I did and I know that it wasn't a popular decision,\" Luyendyk explained, \"but it was a decision I had to make for myself. At the end of the day, it's a TV show but this is the rest of our lives, and Lauren was the person I was supposed to be with.\"\r\nThe choices made by Luyendyk and producers to ambush Kufrin, and by ABC to air the breakup footage, sent backlash Luyendyk's way and turned off some fans of the franchise. Think pieces and takedowns ran in the week that followed and as Kufrin accepted her new role as the next star of The Bachelorette, Luyendyk and Burnham largely disappeared from the spotlight, choosing to keep viewers updated on their relationship via their social media channels.\r\nOn Wednesday, the pair said neither of them has watched the finale to this day.\r\n\"They say it was unedited but it was edited,\" said Luyendyk. \"[As the Bachelor,] you are not in the editing room and you can't really control what they show.\"\r\nHe added, \"Going into it, the biggest reason why I wanted it to be filmed was so that everyone could see the story. Not only the good things but also the bad things. Just because [with] the finale, there's always a lot of questions. When [former Bachelor] Jason Mesnick changed his mind — he's happy and has kids and a great life — they didn't film anything and fans were upset by that. I really wanted everyone to see our love story and I think the editing chose to show more of the breakup than the happy parts of that ending.\"\r\n\r\nBurnham admitted that she knew Luyendyk was going to break up with Kufrin, but that filming the heartbreaks are part of what they signed up for.\r\n\"I knew he was going to break up with Becca and I knew that production was involved, so I kind of figured that's what was happening,\" she said. \"But the whole thing was taped. My breakup was taped and everyone else's was, that's kind of the name of the game.\"\r\nUnlike a handful of successful Bachelor couples to come before them, Luyendyk and Burnham are opting to not invite ABC's cameras to their big day. The Bachelor franchise has aired five TV weddings, including original Bachelorette Trista and Ryan Sutter's and former Bachelor Sean and Catherine Lowe's.\r\nWhen speaking to The Hollywood Reporter after the finale in March, the couple had said they hoped to set a date later in the year. At the time, they both said they were open to the idea of a TV wedding, but Luyendyk had added, \"I think it’s more about if it works in our timeline.\"\r\nLuyendyk's and Burnham's live TV appearance — their first since a whirlwind post-finale press week — comes days before Kufrin begins her Bachelorette journey Monday.\r\nWhen asked about the curious timing, Burnham replied with a laugh, \"Honestly, I don't think we really had much control over that.\" Luyendyk added, \"Our plan just came together so it just happens to be the timing of things. We're excited to do it privately because everyone asks us, so we were like: Why not just come on here and tell everybody?\"\r\nThough Burnham played coy about whether or not she has spoken to Kufrin or if they will appear on the upcoming season, Luyendyk had a solid answer when asked if he would do anything differently: \"It's hard to live in regret. Because of how things ended, I think our relationship is stronger and I wouldn't change it.\"\r\nViewers have been particularly invested in Kufrin's happily ever after ever since she was subjected to the on-camera breakup, and on Tuesday, she revealed that she does in fact find love at the end of her journey, which wrapped filming weeks ago.\r\n\"I'm engaged!\" she told People. \"I still pinch myself, like, did that all just happen? It’s been a whirlwind.\"\r\nAdding, \"It feels so good to say it and this time, I think it's going to stick!\"\r\nShe also said that now, having been in Luyendyk's shoes as the lead of the reality dating show, she does sympathize with his decision-making. \r\n\"Looking back, as weird as it sounds, I can really only thank [Arie] because he followed his heart and it allowed me to go on this new journey for myself to find the person who is a better suit, better fit for me,\" she said. \"He's just a special one.\"\r\nTwenty-eight men compete for Kufrin's final rose when The Bachelorette premieres Monday, May 28, at 8 p.m. on ABC.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Controversial ‘Bachelor’ Arie Luyendyk Jr. Reveals Wedding Won’t Be Televised", "url": "https://www.hollywoodreporter.com/tv/tv-news/bachelor-arie-luyendyk-jr-sets-wedding-date-not-tv-1114318/", "description": "The ABC reality star and fiancee Lauren Burnham plan to marry in January — but ABC viewers aren’t invited.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/arie_lauren.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2018-05-23T09:18:04+00:00", "modified_time": "2018-05-24T11:33:06+00:00"}, "twitter": {"site": "@thr", "creator": "@jackiedstrause", "card": "summary_large_image", "title": "Controversial ‘Bachelor’ Arie Luyendyk Jr. Reveals Wedding Won’t Be Televised", "description": "The ABC reality star and fiancee Lauren Burnham plan to marry in January — but ABC viewers aren’t invited.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/arie_lauren.jpg?w=1296"}}, "movies": [], "publish_date": 1527067084.0, "source": "https://www.hollywoodreporter.com", "summary": ""}