{"url": "http://www.vulture.com/2018/01/the-x-files-recap-season-11-episode-4.html", "text": "The legendary Darin Morgan returns for one of the best episodes of The X-Files ever made. Much as Morgan did last season with “Mulder and Scully Meet the Were-Monster,” he flips viewer’s expectations, but this time he does so through the filter of the Trump administration and the battle over fake news. How can somebody believe that “the truth is out there” when no one agrees upon the truth? It’s funny, smart, irreverent, and, in keeping with a theme of this season, it playfully comments on the X-Files fanbase, who probably remember an episode or two differently than they actually played out.\n\n“The Lost Art of Forehead Sweat” is about gaps in collective memory, a phenomenon known as the “Mandela effect.” (Not the “Mengele effect,” despite what one of the characters says in the episode, for the record.) The Mandela effect refers to what are essentially shared mistakes in memory. Memory is a pliable, funny thing: People can be convinced they saw movies they didn’t see, such as the Kazaam issue Mulder references in the episode, or that more people attended an inauguration than actually did. It often happens with movie quotes, too: What if I told you Darth Vader never said “Luke, I am your father” or the Queen in Snow White never said, “Mirror, mirror on the wall”? This episode applies this fascinating concept to the history of The X-Files.\n\nWe’re introduced to the Mandela effect through the story of Reggie Something, played by Brian Huskey. We meet him in full Deep Throat mode, chewing sunflower seeds in a parking garage, having a clandestine meeting with Mulder. He knows he’s going to seem crazy, so he gives Mulder a very personal example of the Mandela effect, revealing to him that his favorite episode of The Twilight Zone, “The Lost Martian,” doesn’t really exist. Of course, we know it doesn’t, but Mulder is convinced that he saw it when he was a kid. He rummages through his belongings to find it, leading to the great line when Scully suggests it might be a different series: “Confuse The Twilight Zone with The Outer Limits?! Do you even KNOW ME?!?!”\n\nNow it’s Scully’s time to meet with Reggie and learn what her Mandela Effect is. It’s a Jell-o knock-off called Goop-o ABC, which Reggie hands her before yelling “Just prove that I’m real!” Of course, his fingerprints on the box don’t match anyone’s in the system.\n\nNow Mulder and Scully decide to talk to Reggie together, and we learn his trigger that allowed him to see the falsity of his memory, his “Lost Martian” or his Goop-o ABC. When he was moving his mother, he came across a book by Dr. Wuzzle. The only problem? He remembered his favorite childhood author being named Dr. Wussle. Eager to investigate, he found his way to a nostalgia shop and saw a cartoon drawn by, of course, Dr. Wuzzle. He explains to Mulder and Scully that the Mandela effect is being controlled by someone, quoting George Orwell when he says, “He who controls the past controls the future.” (There’s even a brilliant edit in which Reggie talks about companies controlling their image and it’s meant to appear like a modern brand name got cut out.) There’s a wonderful comedic energy to the scene, as the three characters argue over whether Reggie’s problems are due to government conspiracy (Reggie), faulty memory (Scully), or alternate universes (Mulder). Reggie points out that “they” want you to think all conspiracies are silly. And Darin Morgan has an answer for just who “they” is.\n\nMeet Dr. Thaddeus Q. They, the man who figured out who to manipulate collective memory. While working on Operation Soy Bomb, he made astronauts forget home and was fired for making them think they were chimpanzees. He works for “unknown, mysterious clients,” he was in a movie called Ka-Blaam, and he was last seen at the 2017 inauguration. Reggie latches onto the fact that Dr. They worked in Grenada, where Reggie claims he saw alien land almost four decades ago. Reggie remembers seeing the alien being taken away by mysterious men in black. Then he drops the biggest bomb yet: He started The X-Files. In an amazing montage, we see Reggie cut into old episodes of the show from its original run. It’s a meta reference, telling us, the fans, that we remember these classic episodes differently than they actually played out. It’s an episode about manipulating history that manipulates the history of itself. Brilliant.\n\nWhile Mulder tries to figure out an answer without coming back to alternate universes, he gets a call from Dr. They. In another clandestine meeting, the good doctor of “phony fake news” castigates Mulder for not finding him sooner, telling him that his time has passed. We’re in an era in which powerful leaders don’t need to keep secrets anymore because no one believes or cares when they’re revealed. As he says, “We’re living in a post-cover-up, post-conspiracy age.” The “poco” age, as he calls it, doesn’t need conspiracies if people can’t tell the difference between real and fake — if people only believe what they want to believe. This is an episode that’s about the spread of disinformation, and how it’s going to be a defining characteristic of our time when historians write it.\n\nWhen we get our final parking-garage meeting with Reggie, Scully drops the bomb: She found out about his past. He was just a government employee, a guy who rose the ranks from USPS to IRS to SEC to DOJ to CIA to DOD to NSA, and he was committed to a mental institution a year ago. Is Reggie just a disillusioned employee imagining he still fights for truth and justice? He willingly puts on a straitjacket, but Mulder asks about their last case before he goes.\n\nIt turns out that Reggie, Mulder, and Scully did find the truth. The alien from Grenada came back, as he promised he would, and gave them a book called All the Answers, but only after telling them never to come to outer space again. Lest anyone think there wasn’t already Trump commentary in this episode, the alien in this flashback quotes him deliberately, saying that the Earth isn’t sending outer space “your best people” and that the rest of the universe is going to build a wall to keep humanity out. Mulder throws a tantrum in response. He doesn’t want all the answers. He wants to keep searching.\n\nBack in the present day, Skinner asks where they’re taking Reggie before Scully and Mulder settle in for some TV and snacks. It turns out “The Lost Martian” was on a show called The Dusky Realm and Goop-o ABC looks gross. And that’s when Scully hits us with a melancholy line: “I want to remember how it all was.” We all do, Sculls.\n\nOther Notes\n\n• We’ll get to the other Easter eggs and references in a minute, but here’s a huge one that you might have missed. Two weeks ago, in “This,” as Scully and Mulder were flipping through the electronic X-Files, an ID badge for someone else went by. Guess who? Reggie! Does this mean his story about working with Mulder and Scully is true? Why else would his badge be in the X-Files?\n\nPhoto: Fox\n\n• I love how Reggie calls them Foxy and Sculls.\n\n• Just for the record, Scully says “leprechaun taint” in this episode and I’m willing to bet those two words had never before been put together on television.\n\n• The Mulder flashback with an 8-year-old body and David Duchovny’s head was brilliant.\n\n• Soy Bomb Conspiracy is a real thing.\n\n• The Grenada UFO Stamp is also real.\n\n• Reggie is shown a political cartoon from WWII drawn by Dr. Wuzzle. If you’re wondering, Dr. Seuss drew political cartoons in that era, although I doubt anyone remembers his name as Dr. Seuzz. Maybe they will now.\n\n• Dr. They is played by TV legend Stuart Margolin, who won two Emmys for The Rockford Files.\n\n• Two great quotes: “I’m Fox freaking Mulder, you punks!” and “We’re not alone in the universe, but nobody likes us.”\n\n• There are several classic episodes in the montage of Reggie being in The X-Files, including “Squeeze,” “Clyde Bruckman’s Final Repose,” “Home” (with a shot of last week’s guest star Karin Konoval), and “Small Potatoes.”", "images": ["http://www.vulture.com/media/components/customer-alert-banner/double_chevron.svg", "https://pyxis.nymag.com/v1/imgs/e33/6e7/aed044d06bd5c293490430f400dc112e41-2022Cov4x5-AsianAmericaPkg.w240.jpg", "https://pyxis.nymag.com/v1/imgs/31a/165/7b2cda49d5258316afceb071e56d8d3a8b-women-3.2x.rsquare-zoom.w75.jpg", "http://www.vulture.com/media/components/customer-alert-banner/close_x.svg", "http://www.vulture.com/media/components/customer-alert-banner/alert.svg", "https://pyxis.nymag.com/v1/imgs/43e/8bd/645f0582f1c2e6121d62c03e491251dcbf-24-x-files-reggie.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/5ea/81e/4d3b39a96107c321338c0c9a25557bd47f-zarifa-ghafari.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/c32/3bf/0a393283dc1f3f9257ff8b361ea03216c8-russia-missile.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/3f4/36a/99a2463d495b5b70a891acdd460657352b-24-x-files-1104.1x.rsocial.w1200.jpg", "https://pyxis.nymag.com/v1/imgs/3f4/36a/99a2463d495b5b70a891acdd460657352b-24-x-files-1104.rsquare.w700.jpg"], "top_img": "https://pyxis.nymag.com/v1/imgs/3f4/36a/99a2463d495b5b70a891acdd460657352b-24-x-files-1104.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["Brian Tallerico"], "canonical_link": "https://www.vulture.com/2018/01/the-x-files-recap-season-11-episode-4.html", "title": "The X-Files Recap: All the Answers", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "parsely-tags": "tv, tv recaps, overnights, recaps, the x files, the x files season 11, fox, featuretype:tv recap", "og": {"title": "The X-Files Recap: All the Answers", "url": "https://www.vulture.com/2018/01/the-x-files-recap-season-11-episode-4.html", "description": "“The Lost Art of Forehead Sweat” is one of the best episodes of The X-Files ever made.", "image": "https://pyxis.nymag.com/v1/imgs/3f4/36a/99a2463d495b5b70a891acdd460657352b-24-x-files-1104.1x.rsocial.w1200.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "The X-Files Recap: All the Answers", "description": "“The Lost Art of Forehead Sweat” is one of the best episodes of The X-Files ever made.", "image": "https://pyxis.nymag.com/v1/imgs/3f4/36a/99a2463d495b5b70a891acdd460657352b-24-x-files-1104.2x.rsocial.w600.jpg", "card": "summary_large_image", "site": "@vulture"}, "article": {"published_time": "2018-01-24T21:00:01.087-05:00", "tag": "tv, tv recaps, overnights, recaps, the x files, the x files season 11, fox", "publisher": "https://www.facebook.com/Vulture"}, "description": "“The Lost Art of Forehead Sweat” is one of the best episodes of ‘The X-Files’ ever made. A recap of ‘The X-Files’ season 11 episode 4 written and directed by Darin Morgan.", "robots": "max-image-preview:large", "sailthru.tags": "tv, tv recaps, overnights, recaps, the x files, the x files season 11, fox", "author": "Brian Tallerico", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://assets.nymag.com/media/sites/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1516845601.087, "source": "http://www.vulture.com", "summary": ""}