{"url": "http://www.music-news.com/news/UK/111511/Fergie-returns-to-the-stage-after-National-Anthem-fiasco", "text": "Fergie triumphantly returned to the stage for the first time since her National Anthem fiasco.\n\nThe 42-year-old singer was heavily criticised and mocked after she performed a soulful rendition of the Star-Spangled Banner at the NBA All-Star Game on 18 February (18).\n\nWhile Fergie admitted she took a \"risk\" with her version, basketball players Stephen Curry and LeBron James, along with audience members Chance the Rapper and Jimmy Kimmel, were seen on camera struggling to contain their laughter during her performance.\n\nFergie returned to the stage at The Forum in Inglewood, California, on Friday (02Mar18), with an appearance during DJ Khaled's star-studded set at his concert with Demi Lovato.\n\nKhaled introduced Fergie as \"my sister\" from TV talent show \"The Four (Battle for Stardom)\" before the crowd gave her a warm welcome with cheers and applause, and she performed her hits including Fergalicious, London Bridge and Glamorous.\n\n\"@djkhaled @ddlovato incredible show last night!!! Luv u, thank u so much for having me #TellMeYouLoveMeTour (sic),\" Fergie tweeted on Saturday.\n\nKhaled surprised fans during his set by bringing out special guests including Sean ‘Diddy’ Combs, Tinashe, Jaden Smith and Chris Brown.\n\nFergie's ex-husband Josh Duhamel opened up about her National Anthem backlash during a recent appearance on The Ellen DeGeneres Show, insisting that it wouldn't be long before fans would see Fergie bounce back.\n\n\"It’s hard to see somebody you care about get beat up like that,\" he explained. \"But that’s the business. You’re in this business, you put yourself out there. Sometimes you win and sometimes you don’t.\n\n\"Trust me, she’s fine. She is about as resilient as they come.”", "images": ["http://www.music-news.com/images/news/cover/111511.jpg", "http://www.music-news.com/Content/Images/newsletter-signup.gif"], "top_img": "http://www.music-news.com/images/news/cover/111511.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.music-news.com/news/UK/111511/Fergie-returns-to-the-stage-after-National-Anthem-fiasco", "title": "Fergie returns to the stage after National Anthem fiasco", "meta_data": {"viewport": "width=device-width,maximum-scale=1.0", "description": "Fergie returns to the stage after National Anthem fiasco - The Number One music magazine feat. band & artist news, reviews, interviews, videos & gossip UK & worldwide.", "keywords": "Fergie returns to the stage after National Anthem fiasco - music, news, music news,music-news reviews, Alternative, indie, metal, dance, hardcore, rock, pop, artists, audio, video, classic, hip hop, rap, soul, r&b, lennon, ash, sex pistols, radiohead, blur, hendrix, oasis, muzik, underworld, Limp Bizkit, Backstreet Boys,  U2, Korn,  Eminem,  *NSYNC,  Madonna,  Radiohead,  Marilyn Manson,  Pearl Jam, Britney Spears ,  Nelly , Metallica , Christina Aguilera , Prince, Blink-182,  Blur, Oasis, Travis, REM, Smashing Pumpkins, Manics, Supergrass, Pulp, Beck, Nirvana, Stereophonics, Beatles, U2, Foo Fighters, Suede, Stone Roses, Moby, David Bowie, Prodigy, top, fifty, 100, albums, singles, live, films, books, quotes, competitions, webcasts, webchats, radio, E-cards, angst, gigs, tickets, buy tickets, concerts, Real Audio, Microsoft media player, magazine, free, e-mail, email, shop, my, Cds, Cd's, Cd, contests, hits", "google-site-verification": "bDOS26sz2s-cSAyT3mz9xz63qHr4jxrYbQcimMBBXAw", "verification": "59ce4d17a6a39ea29e3fa8dae1d51917", "apple-mobile-web-app-title": "Music-News.com", "application-name": "Music-News.com", "msapplication-TileColor": "#231f20", "msapplication-TileImage": "/Content/Images/Favicons/mstile-144x144.png", "msapplication-config": "/Content/Images/Favicons/browserconfig.xml", "theme-color": "#ffffff", "og": {"site_name": "Music-News.com", "image": "/images/news/cover/111511.jpg", "url": "https://www.music-news.com/news/UK/111511/Fergie-returns-to-the-stage-after-National-Anthem-fiasco", "title": "Fergie returns to the stage after National Anthem fiasco", "description": "The former Black Eyed Peas singer stirred up controversy after her soulful rendition of the Star-Spangled Banner at the NBA All-Star Game last month."}}, "movies": [], "publish_date": null, "source": "http://www.music-news.com", "summary": ""}