{"url": "https://www.hollywoodreporter.com/live-feed/ian-somerhalder-star-netflix-vampire-drama-series-v-wars-1102716", "text": "Netflix and Ian Somerhalder are ready to fight the V-Wars.\n\nThe streaming giant has handed out a 10-episode, straight-to-series order for vampire drama V-Wars, based on the IDW novel of the same name, with the Vampire Diaries alum set to star. The order comes as another IDW property, the beloved Locke and Key, is awaiting word on a new home after Hulu’s surprising pass on the pilot.\n\nV-Wars revolves around Dr. Luther Swann (Somerhalder), who enters a world of horror when a mysterious disease transforms his best friend, Michael Fayne, into a murderous predator who feeds on other humans. As the disease spreads and more people are transformed, society fractures into opposing camps pitting normal people against the growing number of these vampires. Swann races against time to understand what’s happening, while Fayne rises to become the powerful underground leader of the vampires.\n\nThe series is based on IDW Publishing’s V-Wars franchise, written by New York Times best-selling author Jonathan Maberry. High Park Entertainment produces alongside IDW Entertainment, which will distribute the series worldwide (excluding Canada). 1-800-Missing creators William Laurin and Glenn Davis will serve as showrunners. Brad Turner (Stargate, Stargate Atlantis) will direct and exec produce. High Park’s Eric Birnberg and Thomas Walden will exec produce alongside IDW Entertainment president David Ozer, IDW CEO Ted Adams and Marada Pictures’ James Gibb.\n\n“We could not have dreamed of a better choice than Ian Somerhalder to bring his keen understanding of this genre from his years of starring in The Vampire Diaries to lead the cast of V-Wars as Dr. Luther Swann and to be a creative force on this series, as well as to serve as a director this season. We are thrilled to partner with Netflix to bring the multifaceted world that Jonathan Maberry created to audiences worldwide.”\n\nV-Wars was first announced in 2014 as part of a straight-to-series deal with Entertainment One. That company, as well as the drama’s original writer and producers Circle of Confusion are no longer attached. The pickup comes as IDW’s Locke and Key is being shopped to other streaming outlets, among others, as the company looks to find a new home for the Carlton Cuse drama based on Joe Hill’s beloved comic series. Despite multiple attempts to bring the series to both the big and small screen, IDW remains committed to finding the project a creative home.\n\nFor Somerhalder, meanwhile, V-Wars arrives a year after he signed off of The CW’s Vampire Diaries following its eight-season run. He currently has a pod deal with TVD producers Warner Bros. Television with actress Nikki Reed, his wife, via their Rare Bird Productions banner. He is repped by ICM Partners, Untitled Entertainment and Morris Yorn.\n\nV-Wars arrives as Netflix continues to spend an estimated $8 billion annually on original programming. The genre drama joins a roster of Marvel fare including the recently renewed Jessica Jones and gives the streamer a series vampire drama as The CW is prepping the final season of Vampire Diaries spinoff The Originals, while working on yet another offshoot from the franchise. The genre remains popular with NBC’s Midnight, Texas, and Syfy’s Van Helsing, among others.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/04/gettyimages-862165684_copy_-_h_2018.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/gettyimages-862165684_copy_-_h_2018.jpg?w=1296&h=730&crop=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/gettyimages-862165684_copy_-_h_2018.jpg?w=1024", "keywords": [], "authors": ["Lesley Goldberg"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/ian-somerhalder-star-netflix-vampire-drama-series-v-wars-1102716/", "title": "Ian Somerhalder to Star in Netflix Vampire Drama Series ‘V-Wars’", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The series based on the IDW novel of the same name has landed a 10-episode order at the streaming giant.", "news_keywords": "Ian Somerhalder, IDW", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Lesley Goldberg", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1102716, "title": "Ian Somerhalder to Star in Netflix Vampire Drama Series 'V-Wars'", "published_at": "2018-04-16 06:00:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/gettyimages-862165684_copy_-_h_2018.jpg?w=1024", "comment_count": 0, "tags": "IDW", "topics": "TV News", "body": "Netflix and Ian Somerhalder are ready to fight the V-Wars.\r\nThe streaming giant has handed out a 10-episode, straight-to-series order for vampire drama V-Wars, based on the IDW novel of the same name, with the Vampire Diaries alum set to star. The order comes as another IDW property, the beloved Locke and Key, is awaiting word on a new home after Hulu's surprising pass on the pilot.\r\nV-Wars revolves around Dr. Luther Swann (Somerhalder), who enters a world of horror when a mysterious disease transforms his best friend, Michael Fayne, into a murderous predator who feeds on other humans. As the disease spreads and more people are transformed, society fractures into opposing camps pitting normal people against the growing number of these vampires. Swann races against time to understand what’s happening, while Fayne rises to become the powerful underground leader of the vampires. \r\n\r\nThe series is based on IDW Publishing's V-Wars franchise, written by New York Times best-selling author Jonathan Maberry. High Park Entertainment produces alongside IDW Entertainment, which will distribute the series worldwide (excluding Canada). 1-800-Missing creators William Laurin and Glenn Davis will serve as showrunners. Brad Turner (Stargate, Stargate Atlantis) will direct and exec produce. High Park's Eric Birnberg and Thomas Walden will exec produce alongside IDW Entertainment president David Ozer, IDW CEO Ted Adams and Marada Pictures' James Gibb.\r\n\"We could not have dreamed of a better choice than Ian Somerhalder to bring his keen understanding of this genre from his years of starring in The Vampire Diaries to lead the cast of V-Wars as Dr. Luther Swann and to be a creative force on this series, as well as to serve as a director this season. We are thrilled to partner with Netflix to bring the multifaceted world that Jonathan Maberry created to audiences worldwide.\"\r\nV-Wars was first announced in 2014 as part of a straight-to-series deal with Entertainment One. That company, as well as the drama's original writer and producers Circle of Confusion are no longer attached. The pickup comes as IDW's Locke and Key is being shopped to other streaming outlets, among others, as the company looks to find a new home for the Carlton Cuse drama based on Joe Hill's beloved comic series. Despite multiple attempts to bring the series to both the big and small screen, IDW remains committed to finding the project a creative home.\r\nFor Somerhalder, meanwhile, V-Wars arrives a year after he signed off of The CW's Vampire Diaries following its eight-season run. He currently has a pod deal with TVD producers Warner Bros. Television with actress Nikki Reed, his wife, via their Rare Bird Productions banner. He is repped by ICM Partners, Untitled Entertainment and Morris Yorn.\r\n\r\nV-Wars arrives as Netflix continues to spend an estimated $8 billion annually on original programming. The genre drama joins a roster of Marvel fare including the recently renewed Jessica Jones and gives the streamer a series vampire drama as The CW is prepping the final season of Vampire Diaries spinoff The Originals, while working on yet another offshoot from the franchise. The genre remains popular with NBC's Midnight, Texas, and Syfy's Van Helsing, among others.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Ian Somerhalder to Star in Netflix Vampire Drama Series ‘V-Wars’", "url": "https://www.hollywoodreporter.com/tv/tv-news/ian-somerhalder-star-netflix-vampire-drama-series-v-wars-1102716/", "description": "The series based on the IDW novel of the same name has landed a 10-episode order at the streaming giant.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/gettyimages-862165684_copy_-_h_2018.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2018-04-16T06:00:00+00:00", "modified_time": "2018-04-17T16:57:31+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Ian Somerhalder to Star in Netflix Vampire Drama Series ‘V-Wars’", "description": "The series based on the IDW novel of the same name has landed a 10-episode order at the streaming giant.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/gettyimages-862165684_copy_-_h_2018.jpg?w=1296"}}, "movies": [], "publish_date": 1523858400.0, "source": "https://www.hollywoodreporter.com", "summary": ""}