{"url": "books.google.com/books?id=OyQjXlmg8tMC&pg=PA45&lpg=PA45&dq=Jennifer+Lopez+In+Hospital+,+Claim&source=bl&ots=1GefSSecrN&sig=7Ry1qutiJeE_mSeC5RgENF8uUjE&hl=en&sa=X&ved=2ahUKEwiO2-rLqZbdAhUB-lQKHSb2Ap04ChDoATAAegQIBBAB", "text": "Try the new Google Books\n\nCheck out the new look and enjoy easier access to your favorite features", "images": ["http://books.google.com/googlebooks/images/material/book_icon_color.png", "http://www.google.com/images/cleardot.gif", "https://books.google.co.uk/books/content?id=OyQjXlmg8tMC&printsec=frontcover&img=1&zoom=5&edge=curl&imgtk=AFLRE729KJhvqRCea_5x9Hh9ekSVX82n0akQZpymJfPibC6HBTF1-lx74UoI9Vn9-uxeiwre9s8LaqBJIR4TCuN--U_zw-1lIW7jQ4ZmZxYHUdaXGXrpvbp2D-wmW1KJaO2rGHVt0uSN", "http://books.google.com/googlebooks/images/material/arrow_right_black_24dp.png", "http://books.google.com/googlebooks/images/material/ogen_bookshelf.png", "https://pagead2.googlesyndication.com/pagead/imgad?id=CM7DrpmpibLzWhCmARgyMggAdlzMr8Pykg", "https://books.google.co.uk/books/content?id=OyQjXlmg8tMC&printsec=frontcover&img=1&zoom=1&edge=curl&imgtk=AFLRE72Pfjc3Xk8g6xN9yNKLJhvgI_RK0PMSyYIXjIVrGkUSb_musOemxM8-d28DH1AUBaKIiqvHjFl5TO8JEBcTvjrvzvBbSRv1cmvfogG7pVhJ69WjuqU7R-s0FsHvKSXI9bFU7ly7"], "top_img": "https://books.google.co.uk/books/content?id=OyQjXlmg8tMC&printsec=frontcover&img=1&zoom=1&edge=curl&imgtk=AFLRE72Pfjc3Xk8g6xN9yNKLJhvgI_RK0PMSyYIXjIVrGkUSb_musOemxM8-d28DH1AUBaKIiqvHjFl5TO8JEBcTvjrvzvBbSRv1cmvfogG7pVhJ69WjuqU7R-s0FsHvKSXI9bFU7ly7", "keywords": [], "authors": [], "canonical_link": "https://books.google.com/books/about/Jennifer_Lopez.html?id=OyQjXlmg8tMC", "title": "Jennifer Lopez: A Biography", "meta_data": {"og": {"url": "https://books.google.com/books/about/Jennifer_Lopez.html?id=OyQjXlmg8tMC", "title": "Jennifer Lopez", "type": "book", "site_name": "Google Books", "image": "https://books.google.co.uk/books/content?id=OyQjXlmg8tMC&printsec=frontcover&img=1&zoom=1&edge=curl&imgtk=AFLRE72Pfjc3Xk8g6xN9yNKLJhvgI_RK0PMSyYIXjIVrGkUSb_musOemxM8-d28DH1AUBaKIiqvHjFl5TO8JEBcTvjrvzvBbSRv1cmvfogG7pVhJ69WjuqU7R-s0FsHvKSXI9bFU7ly7"}, "title": "Jennifer Lopez", "description": "One of Hollywood's first openly Latin stars, Jennifer Lopez has held fast to her New York Bronx roots, while rising above them to become the highest paid Latina actress in history. Her expansive body of work-ranging from film, music, and dance to television production and fashion-has broken down long-standing racial barriers and earned her a place in Forbes' 2007 list of the Top 20 Richest Women in Entertainment. In spite of several box office and a dramatic personal life that has made her the frequent target of tabloid gossip, this determined artist has managed to retain her place at the top of her field and stands poised to make more significant contributions to the entertainment industry.Since bursting into the spotlight with her portrayal of deceased Latin superstar Selena in 1997, Jennifer Lopez has captivated the public eye and carved a niche for herself among Hollywood's elite. One of Hollywood's first openly Latin stars, Jennifer Lopez has held fast to her New York Bronx roots, while rising above them to become the highest paid Latina actress in history. Her expansive body of work-ranging from film, music, and dance to television production and fashion-has broken down long-standing racial barriers and earned her a place in Forbes' 2007 list of the Top 20 Richest Women in Entertainment. Her dramatic personal life-highlighted by a relationship with bad-boy Sean Puffy Combs, two divorces, a highly-publicized broken engagement to Ben Affleck, and marriage to Latin singer Marc Anthony-has earned her as much attention as her career and made her a frequent subject of tabloid gossip. Negative press and several box office flops, however, have done little to diminish J.Lo's popularity. This determined artist has managed hold her place at the top of her field and stand poised to make more important contributions to the entertainment industry.Hollywood journalist Kathleen Tracy explores Jennifer Lopez as both an individual and an entertainer, chronicling the triumphs and pitfalls of her groundbreaking career and intriguing personal life. Complete with a chronology of significant events, illustrations, and a bibliography of print and electronic resources, this detailed biography is ideal for general readers looking to learn more about their favorite star or for students researching the role of race in America's entertainment business."}, "movies": [], "publish_date": null, "source": "http://books.google.com", "summary": ""}