{"url": "https://variety.com/2018/music/news/avicii-dead-at-28-1202772767/", "text": "Artist, DJ, and producer Tim Bergling, a.k.a. Avicii, died Friday afternoon in Oman, according to a statement from his rep. He was 28.\n\n“It is with profound sorrow that we announce the loss of Tim Bergling, also known as Avicii,” the statement reads. “He was found dead in Muscat, Oman this Friday afternoon local time, April 20th. The family is devastated and we ask everyone to please respect their need for privacy in this difficult time. No further statements will be given.”\n\nOne of the most popular and successful electronic dance-music artists of all time — he scored a No. 4 hit on the Billboard 200 in 2013 with “Wake Me Up” and regularly appeared in the Top 5 of Forbes’ “Highest-Paid DJs” lists — he retired from live performing in 2016 at the peak of his success, citing health reasons. He had suffered from health problems for several years, including acute pancreatitis, in part due to excessive drinking. He had his gallbladder and appendix removed in 2014.\n\nHe posted the following statement on his website last year:\n\n“WE ALL REACH A POINT IN OUR LIVES AND CAREERS WHERE WE UNDERSTAND WHAT MATTERS THE MOST TO US.\n\nFor me it’s creating music. That is what I live for, what I feel I was born to do.\n\nLast year I quit performing live, and many of you thought that was it. But the end of live never meant the end of Avicii or my music. Instead, I went back to the place where it all made sense – the studio.\n\nThe next stage will be all about my love of making music to you guys. It is the beginning of something new.\n\nHope you’ll enjoy it as much as I do.”\n\nBergling was born in Stockholm on Sept. 8, 1989. He began DJing as a teenager and released his first single in 2007. He released a large number of singles and remixes in the following years and rapidly built a reputation as a live act. He broke through with his 2010 hit “Seek Bromance,” which charted in several European countries; he signed a publishing deal with EMI the same year. He explained his chosen DJ name as “the lowest level of Buddhist hell,” chosen because his real name was already being used by another Tim Bergling on MySpace.\n\nHis 2011 single “Levels,” which was later nominated for a Grammy Award, vaulted him into the mainstream, charting in multiple European countries and topping the chart in his native Sweden. “Sunshine,” his 2012 collaboration with David Guetta, was nominated for a Grammy for best dance recording. In September of that year, he became the first DJ to headline New York’s prestigious Radio City Music Hall; at those two shows, he previewed a new song with Mike Posner titled “Stay with You.”\n\nHis proper debut album, “True,” was released on September 2013, much of which was previewed during his headlining set at the Ultra Music Festival earlier that year. The album featured “Wake Me Up,” a collaboration with Aloe Blacc, which topped the charts in multiple countries across the world and was No. 1 for a record 14 weeks on Billboard’s Dance/Electronic Songs chart; it was also the U.K.’s fastest-selling single of 2013. Other singers on the album included Adam Lambert and Audra Mae. He also worked with Madonna during this period and contributed to two songs on her 2015 album “Rebel Heart,” although both parties seemed unhappy with the collaboration and Avicii said the final versions were quite different from his demos.\n\nThe extent of his popularity was reflected in a 2014 “Saturday Night Live” digital short called “When Will the Bass Drop?,” with comic Andy Samberg playing a fictional mega-DJ named “Davvincii” (although he was made up to look more like David Guetta).\n\nHowever, as his popularity rose, his health declined. He was hospitalized in March 2014 and cancelled several tour appearances; not long after, he collaborated with Carlos Santana and Wyclef on the official FIFA World Cut Anthem “We Will Find a Way.” Also that year, he produced a song on Coldplay’s album “Ghost Stories.” He released his second full-length album, “Stories,” in October 2015.\n\nIn March of 2016, he performed at the Ultra Music Festival, premiering new material, but 10 days later announced that he was retiring from performing. He made a final live appearance in August in Ibiza. In December, he parted ways with longtime manager Ash Pournouri.\n\nIn August of 2017 he released a six-track EP entitled “Avici,” which he said was the first of three installments that would be his next album. He followed a month later with a full-length documentary called “True Stories,” which was largely about his retirement. In it, promoters are seen trying to convince him to continue touring, even though he’s in obvious physical pain. “I looked at myself like, ‘F—, you should’ve really stood up for yourself more there. Come on, Tim!,'” he said of the documentary to Rolling Stone in an interview published last September. “Why didn’t I stop the ship earlier?”\n\n“I needed to figure out my life,” he continued. “The whole thing was about success for the sake of success. I wasn’t getting any happiness anymore. Now that I have more time in the studio, I want to learn as much about other genres as possible. That’s what I love the most – having a session with Nile Rodgers, for instance, and getting an understanding of music that’s invaluable.”\n\nRELATED CONTENT\n\nMusicians, Celebrities Pay Tribute to Avicii\n\nAvicii’s Biggest Hits (Listen)\n\n‘Avicii: True Stories’ Documentary Reveals Star DJ’s Struggles With Health, Fame and Early Retirement\n\nAvicii’s Life and Career in Photos\n\nPOPULAR ON VARIETY", "images": ["https://variety.com/wp-content/themes/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://variety.com/wp-content/uploads/2017/09/avicii.jpg?w=1000", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://variety.com/wp-content/uploads/2017/09/avicii.jpg?w=681&h=383&crop=1"], "top_img": "https://variety.com/wp-content/uploads/2017/09/avicii.jpg?w=1000", "keywords": [], "authors": ["Jem Aswad"], "canonical_link": "https://variety.com/2018/music/news/avicii-dead-at-28-1202772767/", "title": "Avicii Dies at 28", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://variety.com/wp-content/themes/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Artist, DJ and producer Tim Bergling, a.k.a. Avicii, died this afternoon in Oman, according to a statement from his rep. He was 28.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199, "pages": 12616252196}, "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202772767, "author": "Jem Aswad", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-04-20T10:25:09"}, "pmc-tag": "Avicii", "title": "Avicii Dies at 28", "pageclass": "article", "pmc-vertical": "music", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-primary-category": "News", "pmc-primary-vertical": "music", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress 6.0.2", "author": "Jem Aswad", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Variety", "application-name": "Variety", "content_type": "Article", "post_id": 1202772767, "title": "Avicii Dies at 28", "published_at": "2018-04-20 10:25:09", "image": "https://variety.com/wp-content/uploads/2017/09/avicii.jpg?w=1000", "comment_count": 98, "tags": "Avicii", "topics": "News", "appeared_in_print": "No", "body": "Artist, DJ, and producer Tim Bergling, a.k.a. Avicii, died Friday afternoon in Oman, according to a statement from his rep. He was 28.\r\n\"It is with profound sorrow that we announce the loss of Tim Bergling, also known as Avicii,\" the statement reads. \"He was found dead in Muscat, Oman this Friday afternoon local time, April 20th. The family is devastated and we ask everyone to please respect their need for privacy in this difficult time. No further statements will be given.\"\r\nOne of the most popular and successful electronic dance-music artists of all time — he scored a No. 4 hit on the Billboard 200 in 2013 with \"Wake Me Up\" and regularly appeared in the Top 5 of Forbes' \"Highest-Paid DJs\" lists — he retired from live performing in 2016 at the peak of his success, citing health reasons. He had suffered from health problems for several years, including acute pancreatitis, in part due to excessive drinking. He had his gallbladder and appendix removed in 2014.\r\n\r\n\r\n\r\nHe posted the following statement on his website last year:\r\n\r\n\"WE ALL REACH A POINT IN OUR LIVES AND CAREERS WHERE WE UNDERSTAND WHAT MATTERS THE MOST TO US.\r\nFor me it’s creating music. That is what I live for, what I feel I was born to do.\r\n\r\nLast year I quit performing live, and many of you thought that was it. But the end of live never meant the end of Avicii or my music. Instead, I went back to the place where it all made sense – the studio.\r\n\r\nThe next stage will be all about my love of making music to you guys. It is the beginning of something new.\r\n\r\nHope you'll enjoy it as much as I do.\"\r\n\r\nBergling was born in Stockholm on Sept. 8, 1989. He began DJing as a teenager and released his first single in 2007. He released a large number of singles and remixes in the following years and rapidly built a reputation as a live act. He broke through with his 2010 hit \"Seek Bromance,\" which charted in several European countries; he signed a publishing deal with EMI the same year. He explained his chosen DJ name as \"the lowest level of Buddhist hell,\" chosen because his real name was already being used by another Tim Bergling on MySpace.\r\n\r\nHis 2011 single \"Levels,\" which was later nominated for a Grammy Award, vaulted him into the mainstream, charting in multiple European countries and topping the chart in his native Sweden. \"Sunshine,\" his 2012 collaboration with David Guetta, was nominated for a Grammy for best dance recording. In September of that year, he became the first DJ to headline New York’s prestigious Radio City Music Hall; at those two shows, he previewed a new song with Mike Posner titled \"Stay with You.\"\r\n\r\nHis proper debut album, \"True,\" was released on September 2013, much of which was previewed during his headlining set at the Ultra Music Festival earlier that year. The album featured \"Wake Me Up,\" a collaboration with Aloe Blacc, which topped the charts in multiple countries across the world and was No. 1 for a record 14 weeks on Billboard’s Dance/Electronic Songs chart; it was also the U.K.’s fastest-selling single of 2013. Other singers on the album included Adam Lambert and Audra Mae. He also worked with Madonna during this period and contributed to two songs on her 2015 album \"Rebel Heart,\" although both parties seemed unhappy with the collaboration and Avicii said the final versions were quite different from his demos.\r\n\r\nThe extent of his popularity was reflected in a 2014 \"Saturday Night Live\" digital short called \"When Will the Bass Drop?,\" with comic Andy Samberg playing a fictional mega-DJ named \"Davvincii\" (although he was made up to look more like David Guetta).\r\n\r\nHowever, as his popularity rose, his health declined. He was hospitalized in March 2014 and cancelled several tour appearances; not long after, he collaborated with Carlos Santana and Wyclef on the official FIFA World Cut Anthem \"We Will Find a Way.\" Also that year, he produced a song on Coldplay’s album \"Ghost Stories.\" He released his second full-length album, \"Stories,\" in October 2015.\r\n\r\nIn March of 2016, he performed at the Ultra Music Festival, premiering new material, but 10 days later announced that he was retiring from performing. He made a final live appearance in August in Ibiza. In December, he parted ways with longtime manager Ash Pournouri.\r\n\r\nIn August of 2017 he released a six-track EP entitled \"Avici,\" which he said was the first of three installments that would be his next album. He followed a month later with a full-length documentary called \"True Stories,\" which was largely about his retirement. In it, promoters are seen trying to convince him to continue touring, even though he’s in obvious physical pain. \"I looked at myself like, 'F---, you should've really stood up for yourself more there. Come on, Tim!,'\" he said of the documentary to Rolling Stone in an interview published last September. \"Why didn't I stop the ship earlier?\"\r\n\r\n“I needed to figure out my life,\" he continued. \"The whole thing was about success for the sake of success. I wasn't getting any happiness anymore. Now that I have more time in the studio, I want to learn as much about other genres as possible. That's what I love the most – having a session with Nile Rodgers, for instance, and getting an understanding of music that's invaluable.\"\r\n\r\nRELATED CONTENT\r\n\r\nMusicians, Celebrities Pay Tribute to Avicii\r\n\r\nAvicii’s Biggest Hits (Listen)\r\n\r\n‘Avicii: True Stories’ Documentary Reveals Star DJ’s Struggles With Health, Fame and Early Retirement\r\n\r\nAvicii’s Life and Career in Photos\r\n\r\nPOPULAR ON VARIETY", "fragment": "!", "og": {"type": "article", "title": "Avicii Dies at 28", "url": "https://variety.com/2018/music/news/avicii-dead-at-28-1202772767/", "description": "Artist, DJ, and producer Tim Bergling, a.k.a. Avicii, died Friday afternoon in Oman, according to a statement from his rep. He was 28. “It is with profound sorrow that we announce the loss of…", "site_name": "Variety", "image": {"identifier": "https://variety.com/wp-content/uploads/2017/09/avicii.jpg?w=1000", "width": 1000, "height": 575, "alt": "Avicii"}, "locale": "en_US"}, "article": {"published_time": "2018-04-20T17:25:09+00:00", "modified_time": "2018-04-21T20:22:58+00:00"}, "twitter": {"site": "@variety", "creator": "@jemaswad", "card": "summary_large_image", "title": "Avicii Dies at 28", "description": "Artist, DJ and producer Tim Bergling, a.k.a. Avicii, died this afternoon in Oman, according to a statement from his rep. He was 28.", "image": "https://variety.com/wp-content/uploads/2017/09/avicii.jpg?w=1000"}}, "movies": [], "publish_date": 1524245109.0, "source": "https://variety.com", "summary": ""}