{"url": "https://www.psychologytoday.com/us/blog/lesson-plan-love/201607/the-divorce-curse-bravo-s-real-housewives-continues", "text": "Source: Angela George/CC BY-SA 3.0\n\nOne of my favorite guilty pleasures is Bravo’s The Real Housewives franchise. Although my relationship with the show has been on-again/off-again due to the almost unbearable level of cat-fighting, I have probably not missed an episode since the show’s inception in 2006. Over the years, I have followed the “real” lives of women across the nation from New York to Orange County as they publicly aired their dirty laundry. I’ve delighted in their triumphs and sometimes even in their misfortunes. However, the rate of divorce for these Bravo-lebrities (i.e., someone who is famous for appearing on a Bravo TV show) is no laughing matter.\n\nWe all know that divorce is prevalent in the United States, but what you may not know is that the divorce rate for The Real Housewives is up to double that of the general population. To be fair, this elevated rate is not limited to divorces that have occurred since joining the cast, but rather takes into account whether these women have ever been divorced (before or after participating in the show). I will also add that certain casts are more prone to divorce (for example, the Atlanta ladies) than others (such as the New Jersey Housewives).\n\nWhy are these women more likely to divorce?\n\nThere are a host of explanations as to why The Real Housewives are more apt to divorce. For instance, there are personality issues, ranging from neuroticism to narcissism, not to mention dysfunctional attachment styles, low self-esteem, and, for some, even addiction. Quite likely, the stress and lack of privacy associated with the show exacerbate all of these pre-existing vulnerabilities. However, I believe there are situational issues that are contributing to the high rate of divorce. In particular, by focusing on the women, the show may inadvertently be altering relationship dynamics making them more volatile.\n\nDependence\n\nOne particularly important factor in determining relationship outcomes is dependence. How dependent an individual is on his/her relationship is believed to be a function of available alternatives. When people perceive desirable alternatives to their current relationship (be it another partner or just another way of life) they are less dependent on their relationship. Conversely, when there are few alternatives available, people report greater relationship dependence, and by extension greater commitment.\n\nGenerally, when the viewing public meets a new Real Housewives cast member, she is a devoted and dependent wife. These women have often chosen to support their husband’s career pursuits and as a result are relatively reliant on their men, financially and otherwise. Then, as the show progresses an interesting thing happens. The women begin to gain a sense of independence. In some cases, this liberation may stem from their growing fame or economic prosperity. Other times, the autonomy inherent in a new group of friends (i.e., social support) may form the foundation of their newly found independence. In either case, they begin to envision a life or a lifestyle that is different from what they currently have and this usually becomes a source of friction.\n\nLet’s take for instance the marriage of Tamra and Simon from the Real Housewives of Orange County. When Tamra joined the show, she was a self-proclaimed trophy wife who proudly accepted the fact that her husband was not only the bread-winner, but also the decision maker of their relationship. However, over her years, the show appeared to give her options for supporting herself outside of her marriage and viewers watched her embrace her new found freedom. Unfortunately, her autonomy came at a price. It wasn’t long before her changing dependence and shifting priorities created a strain on her marriage, bringing an end to her more than ten year union with Simon.\n\nPower\n\nA related dynamic often altered by the TV show is power. The Principle of Lesser Interest states that the partner who has the least interest in continuing the relationship has more power. And often, it is the person who is the least dependent on the relationship that holds the power position. Before joining the show, the Housewives likely had less power in their relationships, as they often occupied the role of the more dependent partner. However, after becoming Bravo-lebrities they became less dependent and thus, had more power. Although that is not an inherently bad thing, this power shift can be an interesting obstacle to traverse, particularly if it is unanticipated. As a rule, most couples are looking for an equitable distribution of power. In fact, when couples feel that they are relatively egalitarian they show the greatest satisfaction, commitment, and success. However, the instant fame associated with being one of Bravo’s Real Housewives necessarily disrupts a couple’s status quo and can leave both partners feeling uncomfortable.\n\nI think the marriage of NeNe and Gregg from The Real Housewives of Atlanta, demonstrates the role that power can play in a relationship. When this couple met in 1996, Gregg was a real estate investor and NeNe was a stripper. Yet over her years on the show NeNe blossomed to become a successful actor, including roles on popular television shows such as, Glee, and on Broadway. NeNe’s decreased dependence led to an increase in power. Unfortunately, this contributed to their divorce in 2010. Interestingly, as the partners stayed connected through their co-parenting and friendship, this couple was able to restore balance and ultimately remarried in 2013.\n\nIn Summary\n\nAspiring Housewives please take heed of this advice. Quite likely the show will bring you fame (or infamy, depending on your behavior), but you are also likely to stumble upon another consequence: the end of your marriage. Although divorce is not inevitable, let the failed marriages of Taylor, Camille, Adrienne, Luann, Bethenny, NeNe, Porsha, Phaedra, Tamra, Vicki, Jeana, Ramona, Dina, and most recently Cynthia and Jules be cautionary examples of how difficult the transition from a real life housewife to The Real Housewives can be.\n\nReferences\n\nBricker, T., & Nilles, B. (2016). We Calculated the Divorce Rate for Every Real Housewives Show and the Results Will Blow Your Mind. Retrieved from http://www.eonline.com/news/567233/we-calculated-the-divorce-rate-for-e…\n\nNorth, A. (2013). Real housewives’ divorce rate is double the average. Retrieved from http://www.buzzfeed.com/annanorth/real-housewives-divorce-rate-is-double-the-average\n\nSprecher, S., Schmeeckle, M., & Felmlee, D. (2006). The principal of least interest: Inequality in emotional involvement in romantic relationships. Journal of Family Issues, 27, 1255-1280.\n\nThibaut, J. W., & Kelley, H. H. (1959). The social psychology of groups. New York: John Wiley & Sons, Inc.\n\nWaller W. (1937). The rating and dating complex. American Sociological Review, 2, 727-734.\n\n© 2015 Sadie Leder Elder", "images": ["https://cdn2.psychologytoday.com/theme-assets/logo/logo-facebook.svg", "https://cdn2.psychologytoday.com/assets/styles/manual_crop_1_1_50x50/public/field_blog_entry_teaser_image/2022-10/shutterstock_1937034154.jpg?itok=RYH1qIDc", "https://cdn2.psychologytoday.com/assets/styles/manual_crop_1_1_50x50/public/field_blog_entry_teaser_image/2022-10/joice-kelly-38mglmtszyc-unsplash.jpg?itok=UyzRzAw8", "https://cdn2.psychologytoday.com/assets/styles/thumbnail_115x140/public/field_user_blogger_photo/Untitled_40.jpg?itok=yZrPOsgV", "https://cdn2.psychologytoday.com/assets/flags/flag-lg-us.svg", "https://cdn2.psychologytoday.com/theme-assets/icons/icon-share-round-email-md.svg", "https://cdn2.psychologytoday.com/assets/styles/manual_crop_1_1_75x75/public/field_blog_entry_teaser_image/2022-09/couple-sitting-on-sofa-holding-broken-heart-3874118.jpg?itok=5L5Fa_cD", "https://cdn2.psychologytoday.com/assets/styles/magazine_384x504/public/magazine/2022-04/2022-05.png.jpg?itok=A5EnOiN5", "https://cdn2.psychologytoday.com/theme-assets/icons/icon-share-round-twitter-md.svg", "https://cdn2.psychologytoday.com/theme-assets/logo/logo-twitter.svg", "https://cdn2.psychologytoday.com/assets/styles/manual_crop_1_1_75x75/public/field_blog_entry_teaser_image/2022-09/shutterstock_2080533070.jpg?itok=Z6ke2d9U", "https://cdn2.psychologytoday.com/theme-assets/logo/logo-instagram.svg", "https://cdn.psychologytoday.com/sites/default/files/styles/article-inline-half/public/field_blog_entry_images/YolandaFosterHWOFMay2013.jpg?itok=m3zHXH-1", "https://cdn2.psychologytoday.com/assets/styles/manual_crop_1_1_75x75/public/field_blog_entry_teaser_image/2022-09/shutterstock_1883220343ps.jpg?itok=gvpgWzLo", "https://cdn2.psychologytoday.com/theme-assets/icons/icon-share-round-facebook-md.svg", "https://cdn2.psychologytoday.com/assets/styles/manual_crop_1_1_75x75/public/field_blog_entry_teaser_image/2022-09/pexels-matheus-bertelli-1881091.jpg?itok=Xx_QDmdf", "https://cdn2.psychologytoday.com/assets/styles/manual_crop_1_1_75x75/public/field_blog_entry_teaser_image/2017-08/lindaespositolcsw.jpg?itok=u2Z9ZKq4", "https://cdn2.psychologytoday.com/assets/default_images/counseling.jpg", "https://cdn2.psychologytoday.com/assets/styles/magazine_384x504/public/magazine/2021-10/2021-11.png.jpg?itok=wSMTlJLE", "https://cdn2.psychologytoday.com/theme-assets/icons/icon-check-circle-gray.svg", "https://cdn2.psychologytoday.com/assets/styles/manual_crop_4_3_600x450/public/field_blog_entry_teaser_image/2022-03/shutterstock_1227563686.jpg?itok=2PZl9EwU", "https://cdn2.psychologytoday.com/assets/styles/magazine_384x504/public/magazine/2022-02/2022-03.png.jpg?itok=YSPhxyWG", "https://cdn2.psychologytoday.com/assets/styles/magazine_384x504/public/magazine/2021-12/2022-01.png.jpg?itok=WOiZbTlT", "https://cdn2.psychologytoday.com/assets/styles/manual_crop_1_91_1_1528x800/public/field_blog_entry_teaser_image/YolandaFosterHWOFMay2013_0.jpg?itok=Ygh7qYct", "https://cdn2.psychologytoday.com/assets/styles/magazine_384x504/public/magazine/2022-08/2022-09.png.jpg?itok=ZmQtxkcD", "https://cdn2.psychologytoday.com/assets/styles/magazine_384x504/public/magazine/2022-06/2022-07.png.jpg?itok=L06sQvJZ", "https://cdn2.psychologytoday.com/assets/styles/manual_crop_1_1_50x50/public/field_blog_entry_teaser_image/2022-09/kiss_and_make_up_lobsarts.png.jpg?itok=UnOIJLB2", "https://cdn2.psychologytoday.com/assets/styles/manual_crop_1_1_50x50/public/field_blog_entry_teaser_image/2022-10/we-vibe-toys-s9wj_jhec_4-unsplash.jpg?itok=lkc8kHQr", "https://cdn2.psychologytoday.com/assets/styles/profile_teaser_micro/public/field_user_blogger_photo/Untitled_40.jpg?itok=7xiwAkuD", "https://cdn2.psychologytoday.com/assets/styles/manual_crop_4_3_600x450/public/field_blog_entry_teaser_image/Vince_Vaughn_in_Los_Angeles%2C_California_%282015%29_-_4_0.jpg?itok=ik-SMI0d"], "top_img": "https://cdn2.psychologytoday.com/assets/styles/manual_crop_1_91_1_1528x800/public/field_blog_entry_teaser_image/YolandaFosterHWOFMay2013_0.jpg?itok=Ygh7qYct", "keywords": [], "authors": [], "canonical_link": "https://www.psychologytoday.com/us/blog/lesson-plan-love/201607/the-divorce-curse-bravo-s-real-housewives-continues", "title": "The Divorce Curse of Bravo’s Real Housewives Continues", "meta_data": {"description": "Examining why these Bravo-lebrity relationships continue to bite the dust.", "fb": {"app_id": 220580041311284}, "og": {"site_name": "Psychology Today", "type": "article", "url": "https://www.psychologytoday.com/us/blog/lesson-plan-love/201607/the-divorce-curse-bravo-s-real-housewives-continues", "title": "The Divorce Curse of Bravo’s Real Housewives Continues", "description": "Examining why these Bravo-lebrity relationships continue to bite the dust.", "image": "https://cdn2.psychologytoday.com/assets/styles/manual_crop_1_91_1_1528x800/public/field_blog_entry_teaser_image/YolandaFosterHWOFMay2013_0.jpg?itok=Ygh7qYct"}, "twitter": {"card": "summary", "site": "@PsychToday", "description": "Examining why these Bravo-lebrity relationships continue to bite the dust.", "title": "The Divorce Curse of Bravo’s Real Housewives Continues", "creator": {"identifier": "@psychtoday", "id": 27726303}, "url": "https://www.psychologytoday.com/us/blog/lesson-plan-love/201607/the-divorce-curse-bravo-s-real-housewives-continues", "image": "https://cdn2.psychologytoday.com/assets/styles/manual_crop_1_91_1_1528x800/public/field_blog_entry_teaser_image/YolandaFosterHWOFMay2013_0.jpg?itok=Ygh7qYct"}, "viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0", "theme-color": "#F2F2F2", "alexaVerifyID": "ruuD3Gzrr-EaY185APFbxF69Va4", "google-site-verification": "G-wasBQCXXJoehIaVW5BsO9VYKt4oqmWGo155wSSakQ", "y_key": "0f29d521db0a2863", "msvalidate.01": "9AD6650A37790044983CFB6B27D77607", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Psych Today"}, "movies": [], "publish_date": null, "source": "https://www.psychologytoday.com", "summary": ""}