{"url": "www.hollywoodreporter.com/news/alec-baldwin-stepping-away-twitter-criticism-weinstein-payoff-comments-1055005", "text": "Alec Baldwin announced Saturday morning that he will be suspending posting on his personal Twitter account following strong backlash to previous comments he made about Harvey Weinstein’s harassment allegations and the culture of paying women for silence.\n\nBaldwin came under fire for speaking about the culture of payoffs in the context of Weinstein’s numerous settlements with women over the decades in an interview with PBS.\n\n“When you talked about Harvey Weinstein in the business, you knew that he was highly intrusive in the process of making films … you knew that he was a very intense guy … and last but not least, you heard the rumor that he raped Rose McGowan. You heard that over and over — we heard that for decades. And nothing was done,” the actor said.\n\nWhen asked why no one had come forward if they were aware of the alleged incident, Baldwin replied, “Rose McGowan took a payment of $100,000 and settled her case with him. And it was for Rose McGowan to prosecute that case.”\n\nThe actor referenced a New York Times article on the subject of paying off sexual assault victims and posed the question, “Do the settlement of these cases hurt the cause of exposing and bringing us to a place of real change?”\n\nAdded Baldwin, “When women take money, and are silenced by that money — even though they took the money and were silenced because they were told beyond the money it was the right thing for them to do, keep quiet, don’t make too many waves, it’s going to hurt your career — when they do it, nonetheless, does it set back the course of change? That’s an issue, I think.”\n\n.@AlecBaldwin on a culture of complicity in Hollywood after allegations of sexual harassment and assault by fmr movie mogul #HarveyWeinstein pic.twitter.com/jHeWAhEuOg — PBS NewsHour (@NewsHour) November 3, 2017\n\nOne of Weinstein’s numerous accusers, Asia Argento, took to Twitter to slam Baldwin for his comments on victims who are silenced.\n\n“You’re either a complete moron or providing cover for your pals and saving your own rep,” she wrote. In a follow-up tweet, Argento again took aim at the actor, writing, “Alec Baldwin mansplaining ‘the cause’ for women everywhere.”\n\nHey @AlecBaldwin you’re either a complete moron or providing cover for your pals and saving your own rep. Maybe all three. https://t.co/sMERs2Y11y — Asia Argento (@AsiaArgento) November 4, 2017\n\nHours later, Baldwin clarified his interview remarks in a series of tweets, writing that he has chosen to step away from his personal account “in the current climate.”\n\n“It was never my intention, in my public statements, to ‘blame the victim’ in the many sexual assault cases that have emerged recently,” he wrote. “I simply posited that the settlement of such cases certainly delayed justice. … My heart goes out to all such victims. My goal is to do better in all things related to gender equality.”\n\nBaldwin noted that his other Twitter account, @ABFalecbaldwin, will continue posting updates on his foundation’s work with “the arts and environment.”\n\n1- it is w some degree of sadness that I will suspend posting on this a TWITTER account for a period of and in the current climate. — AlecBaldwin (@AlecBaldwin) November 4, 2017\n\n2- It was never my intention, in my public statements, to “blame the victim” in the many sexual assault cases that have emerged recently — AlecBaldwin (@AlecBaldwin) November 4, 2017\n\n3- I simply posited that the settlement of such cases certainly delayed justice, though I am fully aware that those settlements were … — AlecBaldwin (@AlecBaldwin) November 4, 2017\n\n4- entered into w the understanding that settlement is wise, intimidated into believing so. — AlecBaldwin (@AlecBaldwin) November 4, 2017", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/10/gettyimages-655851880_-_h_2017.jpg?w=1296&h=730&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/gettyimages-655851880_-_h_2017.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/gettyimages-655851880_-_h_2017.jpg?w=1024", "keywords": [], "authors": ["Meena Jang"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/alec-baldwin-stepping-away-twitter-criticism-weinstein-payoff-comments-1055005/", "title": "Alec Baldwin Stepping Away From Twitter Following Criticism Over Weinstein Payoff Comments", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "\"It was never my intention, in my public statements, to 'blame the victim' in the many sexual assault cases that have emerged recently,\" he wrote.", "news_keywords": "Alec Baldwin, Harassment in Hollywood", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Meena Jang", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1055005, "title": "Alec Baldwin Stepping Away From Twitter Following Criticism Over Weinstein Payoff Comments", "published_at": "2017-11-04 10:48:21", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/gettyimages-655851880_-_h_2017.jpg?w=1024", "comment_count": 0, "tags": "Harassment in Hollywood", "topics": "TV News", "body": "Alec Baldwin announced Saturday morning that he will be suspending posting on his personal Twitter account following strong backlash to previous comments he made about Harvey Weinstein's harassment allegations and the culture of paying women for silence.\r\nBaldwin came under fire for speaking about the culture of payoffs in the context of Weinstein's numerous settlements with women over the decades in an interview with PBS.\r\n\"When you talked about Harvey Weinstein in the business, you knew that he was highly intrusive in the process of making films … you knew that he was a very intense guy … and last but not least, you heard the rumor that he raped Rose McGowan. You heard that over and over — we heard that for decades. And nothing was done,\" the actor said.\r\nWhen asked why no one had come forward if they were aware of the alleged incident, Baldwin replied, \"Rose McGowan took a payment of $100,000 and settled her case with him. And it was for Rose McGowan to prosecute that case.\"\r\nThe actor referenced a New York Times article on the subject of paying off sexual assault victims and posed the question, \"Do the settlement of these cases hurt the cause of exposing and bringing us to a place of real change?\"\r\nAdded Baldwin, \"When women take money, and are silenced by that money — even though they took the money and were silenced because they were told beyond the money it was the right thing for them to do, keep quiet, don't make too many waves, it's going to hurt your career — when they do it, nonetheless, does it set back the course of change? That's an issue, I think.\"\r\n\r\n\t.@AlecBaldwin on a culture of complicity in Hollywood after allegations of sexual harassment and assault by fmr movie mogul #HarveyWeinstein pic.twitter.com/jHeWAhEuOg\r\n\t— PBS NewsHour (@NewsHour) November 3, 2017\r\nOne of Weinstein's numerous accusers, Asia Argento, took to Twitter to slam Baldwin for his comments on victims who are silenced.\r\n\"You're either a complete moron or providing cover for your pals and saving your own rep,\" she wrote. In a follow-up tweet, Argento again took aim at the actor, writing, \"Alec Baldwin mansplaining 'the cause' for women everywhere.\"\r\n\r\n\tHey @AlecBaldwin you're either a complete moron or providing cover for your pals and saving your own rep. Maybe all three. https://t.co/sMERs2Y11y\r\n\t— Asia Argento (@AsiaArgento) November 4, 2017\r\nHours later, Baldwin clarified his interview remarks in a series of tweets, writing that he has chosen to step away from his personal account \"in the current climate.\"\r\n\"It was never my intention, in my public statements, to 'blame the victim' in the many sexual assault cases that have emerged recently,\" he wrote. \"I simply posited that the settlement of such cases certainly delayed justice. ... My heart goes out to all such victims. My goal is to do better in all things related to gender equality.\"\r\nBaldwin noted that his other Twitter account, @ABFalecbaldwin, will continue posting updates on his foundation's work with \"the arts and environment.\" \r\n\r\n\t1- it is w some degree of sadness that I will suspend posting on this a TWITTER account for a period of and in the current climate.\r\n\t— AlecBaldwin (@AlecBaldwin) November 4, 2017\r\n\r\n\t2- It was never my intention, in my public statements, to “blame the victim” in the many sexual assault cases that have emerged recently\r\n\t— AlecBaldwin (@AlecBaldwin) November 4, 2017\r\n\r\n\t3- I simply posited that the settlement of such cases certainly delayed justice, though I am fully aware that those settlements were ...\r\n\t— AlecBaldwin (@AlecBaldwin) November 4, 2017\r\n\r\n\t4- entered into w the understanding that settlement is wise, intimidated into believing so.\r\n\t— AlecBaldwin (@AlecBaldwin) November 4, 2017\r\n\r\n\t5- my heart goes out to all such victims. My goal is to do better in all things related to gender equality.\r\n\t\tAu revoir.\r\n\t— AlecBaldwin (@AlecBaldwin) November 4, 2017", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Alec Baldwin Stepping Away From Twitter Following Criticism Over Weinstein Payoff Comments", "url": "https://www.hollywoodreporter.com/tv/tv-news/alec-baldwin-stepping-away-twitter-criticism-weinstein-payoff-comments-1055005/", "description": "“It was never my intention, in my public statements, to ‘blame the victim’ in the many sexual assault cases that have emerged recently,” he wrote.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/gettyimages-655851880_-_h_2017.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-11-04T10:48:21+00:00", "modified_time": "2017-11-22T16:54:50+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Alec Baldwin Stepping Away From Twitter Following Criticism Over Weinstein Payoff Comments", "description": "“It was never my intention, in my public statements, to ‘blame the victim’ in the many sexual assault cases that have emerged recently,” he wrote.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/gettyimages-655851880_-_h_2017.jpg?w=1296"}}, "movies": [], "publish_date": 1509792501.0, "source": "http://www.hollywoodreporter.com", "summary": ""}