{"url": "https://www.phrasemix.com/blog/5-steps-to-achieving-your-new-years-resolutions", "text": "5 steps to achieving your New Year's resolutions\n\nI'm a big fan of New Year's resolutions. \"New Year's resolutions\" are yearly goals that you set for yourself at the beginning of a new year. They usually have to do with fitness, saving money, education, etc.\n\nPeople often make New Year's resoltions at the beginning of the year but don't end up keeping them. That used to happen to me too. Then one year I got serious about my resolutions and started using some of the techniques that I'm going to describe below. I ended up achieving all of my New Year's resolutions that year, and it felt great!\n\nSo here are some techniques to help you become a super resolution achiever:\n\n1. Only pick three goals\n\nYou should have one really important goal that you're going to achieve no matter what. You can set two other goals to work toward as well. Just remember to decide which goal is your \"main\" one.\n\nWhy am I being so restrictive? Because if you try to do more than three things at once, you'll get lost. You'll lost track of what's most important. You'll start to neglect one of your goals, and then you'll feel guilty about it. Soon you'll start to lose confidence in yourself.\n\nSo stick with one main resolution and two secondary ones.\n\n2. Write your resolutions down and post them somewhere\n\nThink of a single word to represent each of your resolutions. Write the word in big letters and post it somewhere in your home.\n\nFor example, if you want to lose weight, you can make a sign with the word \"thin\". Hang it on your refrigerator, so that every time you get food you'll be reminded of your resolution.\n\nDon't just write your resolutions down quietly, though. Announce them to your family and friends. Put them on your Facebook page. Make copies of your resolution to hang in your office. The more reminders, the better.\n\n3. Turn each resolution into a habit\n\nNow that you've chosen a goal, find something that you can do every day to work toward it. Working on your resolutions every single day is very, very effective.\n\nFor example, that's how I started PhraseMix: I made a rule for myself that I had to write a lesson every day before I went to sleep. I've missed a few days in the last two years, but mostly I've stuck with it.\n\nIf you do something every day, it becomes a habit. Soon you won't even think about it; you'll just do it naturally, like brushing your teeth.\n\n4. Work on one habit per month\n\nTo achieve an important goal, you'll probably need to pick up several good habits. For example, to get in shape you'll need to exercise, cut down on your drinking, eat more vegetables, and so on.\n\nIf you try to pick up a lot of good habits at once, you're probably going to fail. It's just too hard to focus.\n\nInstead, I suggest focusing on one good habit per month. After you've gotten used to the first one, you can then add the next one, and so on. For example, if you want to save more money this year, you can add habits like this:\n\nJanuary: Write down your expenses each day\n\nFebruary: Make your own lunch each day\n\nMarch: Sell one used item from your home each day on the Internet\n\n...and so on.\n\n5. Use a calendar\n\nA few years ago, I heard about the Jerry Seinfeld calendar technique.\n\nThe way it works is simple: get a calendar to put on the wall. Every day that you keep up your good habits, mark the day with an \"X\" on the calendar. Then try not to miss any days.\n\nSeeing all of the hard work marked on the calendar will motivate you to continue working hard every day.\n\nTo help get you started, I've put together a blank calendar that you can print out and use:\n\nReview\n\nTo review, here's how you can make New Year's resolutions this year and really keep them:\n\nPick one main resolution and one or two secondary ones.\n\nWrite your resolutions down and post them in easy-to-see places.\n\nFind a way to work on your resolutions every day.\n\nStart just one new habit per month.\n\nKeep track of your progress on a calendar.\n\nSo what are your resolutions going to be? Something related to your English studies? What are you going to do each day to achieve your goals?", "images": ["https://www.phrasemix.com/assets/new_04.jpg", "http://resources.phrasemix.com/img/full/2015Calendar.jpg", "https://www.phrasemix.com/assets/new_03.jpg", "https://www.phrasemix.com/assets/new_05.jpg", "https://d356qujqspw52j.cloudfront.net/assets/logo.png", "https://www.phrasemix.com/follow-youtube-2.png"], "top_img": "http://resources.phrasemix.com/img/full/2015Calendar.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "5 steps to achieving your New Year's resolutions", "meta_data": {"csrf-param": "authenticity_token", "csrf-token": "tLtpbIqYXHGOYI8L3BgAy0Bk9Mzq2yUpOe4qIUWMTthH8gyM4p7cfyib+UmuY/YBVQsLwOPm+dM1/+cOABnIWQ==", "rankz-verification": "NX1MQSqgWslP7Pbj", "viewport": "width=device-width,\n                                                      initial-scale=1.0,\n                                                      maximum-scale=2.0,\n                                                      minimum-scale=0.25,\n                                                      user-scalable=1", "author": "PhraseMix", "title": "Learn English Speaking & Grammar like Natives with PhraseMix", "description": "5 steps to achieving your New Year's resolutions - the PhraseMix.com blog", "_mg-domain-verification": "6711ac7070c167c6c281c8e7a80dfc85"}, "movies": [], "publish_date": null, "source": "https://www.phrasemix.com", "summary": ""}