{"url": "www.vanityfair.com/hollywood/2017/07/angelina-jolie-cover-story", "text": "Life in her household is apparently like this—messy, relaxed, normal. The kids are polite but not phony polite. Zahara, 12, whom Jolie describes as “the rock” of the family, comes downstairs. “Zaz!” Jolie cries, midsentence. They discuss the whereabouts of everyone else. Zahara hugs the wet dog. Jolie laughs and tells her daughter about the swim Dusty just took. We move to the kitchen, where Jolie fixes herself a cup of tea. Vivienne, 9, comes in with a friend, having just been at a sleepover. She’s wearing a jean backpack covered with pins. Jolie envelops her in her arms. I ask the girl if she’s called “Viv” or “Vivienne.” “Either one!” she says with a smile. She dumps her stuff on the counter and goes out to play with her friend. Jolie picks up a small piece of a blanket, shredded to death, and explains, laughing, “She has 32 blankets. She is very into her blanket, and she gets very mad if you wash her blanket. She actually said to me the other day, ‘Mom, I can taste my blanket.’ ‘That, honey, is a sign that it really, really needs to be washed.’ ”\n\nJolie tidies up Vivienne’s things and promptly spills her entire mug of tea all over the counter. We step outside and there’s Shiloh, 11, and Knox, 9, hanging out. Shiloh, who likes to dress like a boy, is wearing a camouflage jacket, long shorts, and heavy black sneakers, despite the blazing heat. Knox immediately wants to know when Jolie’s going to put up the waterslide. “How about a ‘Hello, Mom’?” she says, with a hug, sounding like just about every other loving, exasperated mother in America. So far, there’s only one piece of personal artwork up—a black-and-white photograph on the mantelpiece of the six children, smiling and holding their various pets—dogs, reptiles, and rodents.\n\nJolie and Pitt, who’d been together for 12 years and appeared to be the most gloriously evolved couple in Hollywood, split last September. She filed for divorce suddenly “for the health of the family,” according to her lawyer, and announced she was seeking sole custody of the children, three of whom are adopted (Maddox, 15, Pax, 13, and Zahara), three of whom are biological (Shiloh, Vivienne, and Knox). Things had been rocky for some time, but the last straw was a dramatic trip on a private plane, where there was reportedly a physical and verbal altercation between Pitt and Maddox. When they touched down, Jolie went home with the kids, effectively kicking him out. This was no “Conscious Uncoupling.” An anonymous phone call was made to authorities. The F.B.I. and the Los Angeles County Department of Children and Family Services began investigating Pitt for child abuse. He was soon cleared and later said in an interview with GQ Style that he was smarting from the pain of his suddenly broken family and admitted he had a serious drinking problem.\n\nThere were rumors he was having an affair with Marion Cotillard (denied by both Pitt and Cotillard). Jolie got the early jump P.R.-wise. But Pitt won hearts and minds with the mea culpa in GQ Style. The two are still negotiating the terms of their divorce.\n\nAs for Jolie, a life already bursting at the seams—with acting, directing, humanitarian work, parenting six kids, and guest-lecturing on women’s rights at the London School of Economics—just got exponentially bigger and more complicated, because she’s now doing it alone. There’s the chaos surrounding the practical day-to-day—playdates, doctors’ appointments, packing and unpacking, and organizing mealtimes. And there’s the deeper, emotional chaos. “It’s just been the hardest time, and we’re just kind of coming up for air. [This house] is a big jump forward for us, and we’re all trying to do our best to heal our family.”\n\nAs it happens, the personal trauma has coincided with her most personal film yet. Jolie has directed a moving, large-scale adaptation of First They Killed My Father, Loung Ung’s 2000 memoir of the Khmer Rouge genocide, in which Ung’s parents and two of her siblings perished, along with an estimated two million other Cambodians, a quarter of the country’s population. Shot entirely in Cambodia, and in the Khmer language, the film, a Netflix original, is the largest production the country has witnessed since the war, and according to the reports of several Cambodians who’ve seen it, it’s one of the most revelatory pieces of art about that chapter in the country’s history, a history that’s still difficult for Cambodians to discuss. But if Cambodians consider the film to be something of a gift, then it’s surely a thank-you gift. For Jolie, Cambodia is where she started her family, and it’s where she made a cathartic personal transformation, becoming the woman she is today.\n\nRecall, if you can, the Angelina of the late 90s, the era of Angie Peak Crazy. Specializing in dark volatile characters that seemed extensions of her wild-child restless self, Jolie won three Golden Globes for her roles in television movies and a best- supporting-actress Oscar for her portrayal of a young woman with apparent borderline personality disorder in Girl, Interrupted. She talked freely about having dabbled in heroin and self-cutting, and her love of knives. She and new husband Billy Bob Thornton wore each other’s dried blood in pendants around their necks, and publicly bragged about their wild sex. At the 2000 Oscar ceremony, she talked provocatively about being “so in love . . . right now” with her brother, James, and kissed him with unsettling intimacy. To be sure, Jolie had legitimate pain in her early life—her father, actor Jon Voight, had been unfaithful to her mother, Marcheline Bertrand, and the two split up early on. But it was First World pain. Being Hollywood’s newest “It girl” landed Jolie the title role in Lara Croft: Tomb Raider, based on a popular video game. As it happened, the movie, an example of Hollywood’s most vacuous, commercial, shoot-’em-up instincts, was filmed on location in Cambodia. There, Jolie, who’d grown up in privileged bubbles in Los Angeles and New York, witnessed what real suffering looked like: poverty, the loss of limbs from land mines, a generation of relatives wiped out. In this world there was no room for free-floating malaise or self-indulgent antics. And in spite of their profound trials, “I found a people who were so kind and warm and open, and, yes, very complex,” recalls Jolie. “You drive around here you can see a lot of people with many things, but not often expressing happiness. You go there, and you see the families come out with their blanket and their picnic to watch a sunset.”", "images": ["https://media.vanityfair.com/photos/59764e18b5f53c646c2dea5a/master/w_1600%2Cc_limit/angelina-jolie-vf-0917-cover-ss05.png", "https://media.vanityfair.com/photos/632c8e586f1a4000cb33881a/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/631b88369abfd8a85cba4188/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/59764e1790225743bcad6788/master/w_1600%2Cc_limit/angelina-jolie-vf-0917-cover-ss02.png", "https://media.vanityfair.com/photos/597667f81bd71e4b33f10351/master/w_1600%2Cc_limit/a-angelina-jolie-vf-0917-cover-ss03.png", "https://media.vanityfair.com/photos/59764e6d7c67a060584ba8f8/master/w_1600%2Cc_limit/angelina-jolie-vf-0917-cover-ss01.jpg", "https://media.vanityfair.com/photos/632083cdc1df471d836f1c51/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/5978bb411bd71e4b33f103c2/16:9/w_1280,c_limit/t-angelina-jolie-0917-Vf-cover.png", "https://media.vanityfair.com/photos/5978ba1d7c67a060584ba972/master/w_1600%2Cc_limit/angelina-jolie-vf-0917-cover-ss09.png", "https://media.vanityfair.com/photos/596e1c4c7c67a060584ba7ea/1:1/w_350%2Ch_350%2Cc_limit/t-cover-angelina-jolie-vf-1214.png", "https://media.vanityfair.com/photos/59764e181bd71e4b33f10347/master/w_1600%2Cc_limit/angelina-jolie-vf-0917-cover-ss04.png", "https://media.vanityfair.com/photos/59764e461bd71e4b33f10349/master/w_2560%2Cc_limit/angelina-jolie-vf-0917-cover-opener.jpg", "http://www.vanityfair.com/verso/static/hwd/assets/logo-header.ea437ae89b8c3c7aabbb46bb45a04f1a514e5803.svg", "https://media.vanityfair.com/photos/59764e18fe060e64db80eb3f/master/w_1600%2Cc_limit/angelina-jolie-0917-Vf-cover.png", "https://media.vanityfair.com/photos/6335cc8ff3434093ac7356a9/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/6331de85d0fb4a008fafbb05/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/58d972d8993c7e7c827eb7ef/1:1/w_350%2Ch_350%2Cc_limit/angelina-jolie-interview-about-future.png", "https://media.vanityfair.com/photos/6321fd526b745831c4993f95/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/633ca0eca09faa7f075bba48/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/59764e19b5f53c646c2dea5c/master/w_1600%2Cc_limit/angelina-jolie-vf-0917-cover-ss07.png", "https://media.vanityfair.com/photos/59764e19b5f53c646c2dea5e/master/w_1600%2Cc_limit/angelina-jolie-vf-0917-cover-ss08.png", "http://www.vanityfair.com/verso/static/hwd/assets/logo-reverse.6ef96ab8686439a35176e2ff8b2c4487e92fbaae.svg", "https://media.vanityfair.com/photos/633f137e46d7fce1e25ce3d4/1:1/w_350%2Ch_350%2Cc_limit/undefined"], "top_img": "https://media.vanityfair.com/photos/5978bb411bd71e4b33f103c2/16:9/w_1280,c_limit/t-angelina-jolie-0917-Vf-cover.png", "keywords": [], "authors": ["Condé Nast", "Evgenia Peretz", "Mert Alas", "Marcus Piggott", "Jessica Diehl"], "canonical_link": "https://www.vanityfair.com/hollywood/2017/07/angelina-jolie-cover-story", "title": "Angelina Jolie’s Vanity Fair Cover Story", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "width=device-width, initial-scale=1", "referrer": "no-referrer-when-downgrade", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2022", "description": "There’s the Angelina Jolie who’s now a single mother—managing the day-to-day chaos of six kids, and the trauma of her split from Brad Pitt—and there’s the Angelina Jolie whose latest movie, a groundbreaking Netflix original about Cambodia’s genocide, is also a thank-you to the nation that transformed her. At her new L.A. mansion, Jolie reveals the tension between the two Angelinas and the reason her life will never be normal.", "id": "59710a917c67a060584ba879", "keywords": "cover story,angelina jolie,movies & film,brad pitt,cover", "news_keywords": "cover story,angelina jolie,movies & film,brad pitt,cover", "robots": "index, follow, max-image-preview:large", "content-type": "article", "parsely-post-id": "59710a917c67a060584ba879", "parsely-metadata": "{\"description\":\"There’s the Angelina Jolie who’s now a single mother—managing the day-to-day chaos of six kids, and the trauma of her split from Brad Pitt—and there’s the Angelina Jolie whose latest movie, a groundbreaking Netflix original about Cambodia’s genocide, is also a thank-you to the nation that transformed her. At her new L.A. mansion, Jolie reveals the tension between the two Angelinas and the reason her life will never be normal.\",\"image-16-9\":\"https://media.vanityfair.com/photos/5978bb411bd71e4b33f103c2/16:9/w_1000,c_limit/t-angelina-jolie-0917-Vf-cover.png\",\"image-1-1\":\"https://media.vanityfair.com/photos/5978bb411bd71e4b33f103c2/1:1/w_1000,c_limit/t-angelina-jolie-0917-Vf-cover.png\"}", "og": {"description": "There’s the Angelina Jolie who’s now a single mother—managing the day-to-day chaos of six kids, and the trauma of her split from Brad Pitt—and there’s the Angelina Jolie whose latest movie, a groundbreaking Netflix original about Cambodia’s genocide, is also a thank-you to the nation that transformed her. At her new L.A. mansion, Jolie reveals the tension between the two Angelinas and the reason her life will never be normal.", "image": "https://media.vanityfair.com/photos/5978bb411bd71e4b33f103c2/16:9/w_1280,c_limit/t-angelina-jolie-0917-Vf-cover.png", "site_name": "Vanity Fair", "title": "Cover Story: Angelina Jolie Solo", "type": "article", "url": "https://www.vanityfair.com/hollywood/2017/07/angelina-jolie-cover-story"}, "article": {"content_tier": "metered", "opinion": "false", "section": "tags", "published_time": "2017-07-26T16:44:58.988Z", "modified_time": "2017-07-26T16:44:58.988Z", "author": "Evgenia Peretz"}, "twitter": {"card": "summary_large_image", "creator": "@VanityFair", "description": "There’s the Angelina Jolie who’s now a single mother—managing the day-to-day chaos of six kids, and the trauma of her split from Brad Pitt—and there’s the Angelina Jolie whose latest movie, a groundbreaking Netflix original about Cambodia’s genocide, is also a thank-you to the nation that transformed her. At her new L.A. mansion, Jolie reveals the tension between the two Angelinas and the reason her life will never be normal.", "domain": "https://www.vanityfair.com", "image": "https://media.vanityfair.com/photos/5978bb411bd71e4b33f103c2/16:9/w_1280,c_limit/t-angelina-jolie-0917-Vf-cover.png?mbid=social_retweet", "site": "@VanityFair", "title": "Cover Story: Angelina Jolie Solo"}, "fb": {"app_id": 256281040558, "pages": 8810407571}, "google-signin-client_id": "1065629119444-svrqo31taikd2j0ji4dgjs9q3vul4133.apps.googleusercontent.com"}, "movies": [], "publish_date": 1501087498.988, "source": "http://www.vanityfair.com", "summary": ""}