{"url": "https://en.wikipedia.org/wiki/Val_Kilmer", "text": "American actor (born 1959)\n\nVal Edward Kilmer (born December 31, 1959)[1] is an American actor. Originally a stage actor, Kilmer found fame after appearances in comedy films, starting with Top Secret! (1984) and Real Genius (1985), as well as the military action film Top Gun (1986), the fantasy film Willow (1988) and most recently in Top Gun: Maverick (2022).\n\nKilmer gained acclaim for his portrayal of Jim Morrison in Oliver Stone's The Doors (1991). Kilmer's stardom continued, as he was often cast as a main character in critically acclaimed films such as the western Tombstone (1993), and the crime dramas True Romance (1993), and Heat (1995). He replaced Michael Keaton portraying Bruce Wayne/Batman in Joel Schumacher's Batman Forever (1995). He continued acting in films such as The Ghost and the Darkness (1996), The Island of Dr. Moreau (1996), The Saint (1997), The Prince of Egypt (1998), Pollock (2000), Alexander (2004), Kiss Kiss Bang Bang (2005), Déjà Vu (2006), Bad Lieutenant: Port of Call New Orleans (2009), and Song to Song (2017). \"If there is an award for the most unsung leading man of his generation, Kilmer should get it,\" wrote critic Roger Ebert, \"he has shown a range of characters so convincing that it's likely most people, even now, don't realize they were looking at the same actor.\"[2]\n\nSince 2015, Kilmer has privately struggled with throat cancer; he had a procedure on his trachea that damaged his vocal cords to the point where he had extreme difficulty speaking. He also underwent chemotherapy and two tracheotomies.[3][4][5][6] In 2020, he published his memoir titled, I'm Your Huckleberry: A Memoir.[7] His struggle was captured in the 2021 documentary titled Val which documented his career and health issues. The film premiered at the Cannes Film Festival to critical acclaim.[8] In 2022, Kilmer reprised his role as Iceman, reuniting with Tom Cruise, in Top Gun: Maverick (2022). One of the best-paid actors of the 1990s, movies featuring Kilmer have grossed over $3.5 billion at the worldwide box-office.[9]\n\nEarly life [ edit ]\n\nKilmer was born December 31, 1959, in Los Angeles, California,[1] the second of three sons to Gladys Swanette (née Ekstadt; 1928–2019)[10] and Eugene Dorris Kilmer (1921–1993).[11] His mother was of Swedish descent.[12] His other ancestry includes English, Irish, Scots-Irish, German and Cherokee roots.[13] His parents divorced in 1968 when he was 8 years old. His mother later married William Bernard Leach in 1970. Kilmer's grandfather was a gold miner in New Mexico, near the border with Arizona.[14] In 1977, Kilmer's younger brother Wesley, who had epilepsy, drowned in a jacuzzi at age 15.[15][16]\n\nHe attended Chatsworth High School with Kevin Spacey.[1] His high school girlfriend was Mare Winningham.[17] He became the youngest person at the time to be accepted into the Juilliard School's Drama Division, where he was a member of Group 10.[18]\n\nCareer [ edit ]\n\n1980s [ edit ]\n\nKilmer turned down a role in Francis Ford Coppola's 1983 film The Outsiders, as he had prior theater commitments.[19] In 1983, he appeared off Broadway in The Slab Boys with Kevin Bacon, Sean Penn, and Jackie Earle Haley. That same year, his first off-stage acting role (excluding television commercials) came in the form of an episode of ABC Afterschool Special called One Too Many, which was an educational drama on drinking and driving;[20] it also starred a young Michelle Pfeiffer. Also in 1983, Kilmer self-published a collection of his own poetry entitled My Edens After Burns, that included poems inspired by his time with Pfeiffer. The book of poems is difficult to obtain and expensive; known second-hand copies cost $300 and up.[21][22][23]\n\nHis big break came when he received top billing in the comedy spoof of spy movies Top Secret!, in which he played an American rock and roll star. Kilmer sang all the songs in the film and released an album under the film character's name, \"Nick Rivers\".[24] While garnering more substantial roles and prestige, he also gained a reputation as a ladies' man, dating numerous women.[23]\n\nDuring a brief hiatus, he backpacked throughout Europe before going on to play the lead character in the 1985 comedy Real Genius. He turned down a role in David Lynch's Blue Velvet[25] before being cast as naval aviator \"Iceman\" in the action film Top Gun alongside Tom Cruise. Top Gun grossed a total of over $344 million worldwide and made Kilmer a major star.[26] Following roles in the television films The Murders in the Rue Morgue and The Man Who Broke 1,000 Chains, Kilmer played Madmartigan in the fantasy Willow; he met his future wife, co-star Joanne Whalley, on the film's set. Kilmer starred in the Colorado Shakespeare Festival production of Hamlet in 1988. In 1989, Kilmer played the lead in both Kill Me Again, again opposite Whalley, and in TNT's Billy the Kid.\n\n1990s [ edit ]\n\nAfter several delays, director Oliver Stone finally started production on the film The Doors, based on the band of the same name.[27] Kilmer spoke with Oliver Stone early on, concerned about what he might want to do with the story because Kilmer did not believe in or want to promote substance abuse. Kilmer saw Jim Morrison as having picked the wrong heroes, who had different issues, which were not part of the creativity or inspiration. Kilmer saw Morrison's story as one that could be told \"a thousand different ways\" and did not want to tell it by playing the role in the style of drugs, with which Oliver Stone agreed.[citation needed] Kilmer memorized the lyrics to all of lead singer Morrison's songs prior to his audition and sent a video of himself performing some Doors songs to director Stone.[28] Stone was not impressed with the tape, but Paul A. Rothchild (the original producer of the Doors) said \"I was shaken by it\" and suggested they record Kilmer in the studio. After Kilmer was cast as Morrison, he prepared for the role by attending Doors tribute concerts and reading Morrison's poetry.[29]\n\nHe spent close to a year before production dressing in Morrison-like clothes, and spent time at Morrison's old hangouts along the Sunset Strip. His portrayal of Morrison was praised and members of the Doors noted that Kilmer did such a convincing job that they had trouble distinguishing his voice from Morrison's.[27] Paul Rothchild played Kilmer's version of \"The End\" for the band's guitarist, Robby Krieger, who told him, \"I'm really glad they got 'The End'. We never got a recording of that live with Jim and now we've got it.\" However, Doors keyboardist Ray Manzarek was less than enthusiastic with how Morrison was portrayed in Stone's interpretation.[30]\n\nIn the early 1990s, Kilmer starred in the mystery thriller Thunderheart, the action comedy The Real McCoy, and again teamed with Top Gun director Tony Scott to play Elvis Presley in True Romance, which was written by Quentin Tarantino. In 1993, Kilmer played Doc Holliday in the western Tombstone alongside Kurt Russell. In the film, Doc Holliday performs Chopin's Nocturne in E minor, Op.72, No. 1; however, Kilmer does not play the piano and he practiced that one piece for months in preparation.[31] In 1995, Kilmer starred in Wings of Courage, a 3D IMAX film, and that same year, he starred opposite Al Pacino and Robert De Niro in Heat, which is now considered one of the best crime/drama films of the 1990s.[32]\n\nBatman [ edit ]\n\nIn December 1993 Batman Forever director Joel Schumacher had seen Tombstone and was most impressed with Kilmer's performance as Doc Holliday. Schumacher felt him to be perfect for the role of Batman, though at the time, the role was still Michael Keaton's.[33] In July 1994, Keaton decided not to return for a third Batman film after 1992's Batman Returns,[34] due to \"creative differences\".[33] William Baldwin (who previously worked with Schumacher on Flatliners) was reported to be a top contender, though just days after Keaton dropped out, Kilmer was cast.[34] Kilmer took the role without even knowing who the new director was and without reading the script.[33]\n\nReleased in June 1995, Batman Forever was a success at the box office,[35] despite receiving mixed reviews from critics.[36] There was debate about Kilmer's performance: some critics, like The New York Times' Janet Maslin, thought Kilmer was a poor successor to Keaton in the part;[37] while others, such as Roger Ebert, had kind words for Kilmer.[38] Batman creator Bob Kane said in a Cinescape interview that of all the actors to have played Batman up to that point, he felt Kilmer had given the best interpretation. Film critic Leonard Maltin (who criticized the dark tone contained in Batman Returns) complimented Kilmer's portrayal when he reviewed the film for his expanding collection of film reviews.[39] Defenders of Batman Forever praised the film for portraying Batman as a more heroic, less ruthless, and more human character than in the Tim Burton films. The film also brought the film interpretation of Bruce Wayne more into line with his comic book counterpart, showing him as a socialite and a very public figure rather than the neurotic recluse of the previous films.\n\nIn February 1996, Kilmer decided not to return for another Batman feature film, feeling that Batman was being marginalized in favor of the villains[40] and because of scheduling problems with The Saint. George Clooney replaced Kilmer as Batman in 1997's Batman & Robin. There were also reports that Kilmer had not had a good working relationship with Schumacher, as another reason for not reprising the role.[41][42]\n\nIn 1996 he appeared in a largely unknown film, Dead Girl, and starred alongside Marlon Brando in the poorly received[43] The Island of Dr Moreau. That year, Kilmer starred alongside Michael Douglas in the thriller The Ghost and the Darkness. In 1997 he played Simon Templar in the popular action film, The Saint. Kilmer looked forward to the title role as a change toward a more fun, less serious action thriller, while enjoying the \"master of disguise\" chameleon characters like a mad artist, a nerdy British scientist, a cleaner, and a Russian mob boss. Kilmer also wrote the poetry in the film.[citation needed] He received a salary of $6 million for the movie.[40] The Saint was a financial success, grossing $169.4 million worldwide.[44]\n\nIn 1998, he voiced Moses in the animated film The Prince of Egypt, before starring in the independent film Joe the King (1999). Also in 1999, he played a blind man in the drama/romance At First Sight, which he described as being, of then, the hardest role he had ever had.[45]\n\n2000s [ edit ]\n\nKilmer in 2005\n\nKilmer's first role in 2000 was in the big budget Warner Bros. box office disaster[46] Red Planet. That same year, he had a supporting role in the film Pollock and hosted Saturday Night Live for the first time. In 2002, he starred in the thriller The Salton Sea, which was generally well-reviewed,[47] but received only a limited release.[48] The same year, he teamed with his True Romance co-star, Christian Slater to appear in the low-budget film, Hard Cash, also known as Run for the Money.\n\nIn 2003, Kilmer starred alongside Kate Bosworth in the drama/thriller Wonderland, portraying porn star John Holmes. He also appeared in The Missing, where he again worked with Willow director Ron Howard. The next year, he starred in David Mamet's Spartan, where he played a United States government secret agent who is assigned the task of rescuing the kidnapped daughter of the President. He received Delta Force-like training in preparation for the role.[49] Subsequently, he had a role in the drama, Stateside, and starred (again with Slater) in the thriller Mindhunters, which was filmed in 2003 but not released until 2005. Kilmer next appeared in the big budget Oliver Stone production, Alexander, which received poor reviews.[50]\n\nAlso in 2004, Kilmer returned to the theater to play Moses in a Los Angeles musical production of The Ten Commandments: The Musical, produced by BCBG founder Max Azria.[51] The production played at the Kodak Theatre in Hollywood and also featured Adam Lambert. Kilmer had previously played Moses in the animated film The Prince of Egypt. Finally in 2004, Kilmer appeared in an episode of Entourage, where he played a Sherpa whose primary source of income was growing, harvesting and distributing high-quality cannabis, all under a guise of metaphysical insights.\n\nKilmer was in negotiations with Richard Dutcher (a leading director of Mormon-related films) to play the lead role in a film entitled Prophet: The Story of Joseph Smith, although the project never materialized.[52]\n\nKilmer performed in The Postman Always Rings Twice on the London stage from June to September 2005.[53] In 2005, he co-starred with Robert Downey, Jr. in the action-comedy film Kiss Kiss Bang Bang. His performance was praised and the film was well reviewed,[54] but it received only a limited release.[55] It later won the award for \"Overlooked Film of the Year\" from the Phoenix Film Critics Society.\n\nIn 2006 he reunited with director Tony Scott a third time for a supporting role opposite Denzel Washington in the box-office hit Déjà Vu. The song \"Val Kilmer\" was named after him on Bowling for Soup's 2006 album The Great Burrito Extortion Case. The song was later used for a Ford Motors commercial on season 10 of American Idol in 2011. In 2007, he guest-starred on the hit TV series Numb3rs in the episode \"Trust Metric\", portraying torture expert Mason Lancer. That same year, he released a CD, proceeds of which went to his charity interests.[citation needed] In 2008, Kilmer starred alongside Stephen Dorff in the Sony and Stage 6 film Felon. The film was given only a limited theatrical release in New York and Los Angeles in 2008, but it developed into a success secondary to positive word of mouth.[citation needed]\n\nKilmer was the voice of the car KITT for the 2008 Knight Rider TV pilot film and the following television series. He replaced Will Arnett, who had to step down from the role due to contractual conflict with General Motors.[citation needed] In keeping with tradition established by the original Knight Rider series and original KITT actor William Daniels, Kilmer was uncredited for the role on-screen.[citation needed] He next starred alongside Nicolas Cage in the Werner Herzog film Bad Lieutenant: Port of Call New Orleans, and alongside Curtis \"50 Cent\" Jackson in Streets of Blood. Both were released in 2009. He appeared as the main antagonist \"Mongoose\" in a live TV series adaptation of the comic/video game of XIII on NBC in 2009.\n\n2010s [ edit ]\n\nIn 2010 Kilmer starred in Michael Oblowitz's horror film The Traveler, in which he played the vengeful spirit of a man who had been tortured and murdered while in police custody. In November 2010, Kilmer was filming in Kelseyville, California. He was finally able to work with his lifelong friend Francis Ford Coppola and star in the film Twixt. The film was filmed mostly on Coppola's estate in Napa County. The filming was expected to take five weeks and was being independently funded by Coppola. In 2010, Kilmer appeared as the villain Dieter Von Cunth in MacGruber and had a small cameo role in the music video for Tenacious D's \"To Be the Best\".\n\nKilmer spoke at the May 5, 2010, commencement ceremonies of William Woods University in Fulton, Missouri.[56] During his week-long visit on campus, he also performed his one-man play, Citizen Twain.[57][58] He received an honorary doctorate \"in recognition of his creative abilities and his contributions to art and theater.\"[58]\n\nIn 2012 Kilmer received a Grammy nomination for Best Spoken Word. He also starred in Harmony Korine's short film The Lotus Community Workshop, part of the collaborative film The Fourth Dimension. He plays a version of himself from an alternate reality: a former actor turned self-help guru. The Fourth Dimension is a collection of three standalone short films about parallel universes produced by Vice Films in collaboration with Grolsch Film Works, a new division of the namesake beer company. Kilmer notes that his addition to the list of actors, including John Malkovich (Being John Malkovich) and Al Pacino (Jack and Jill), that mock their real-life persona in fictional movies was an accident and says, \"I still love saying the premise because it makes me laugh every time.\"[59]\n\nIn 2002 Kilmer worked on a film about the life of Mary Baker Eddy, the founder of the Christian Science church,[60] and Mark Twain, one of her most famous critics. Kilmer is still working on the film, which is about the lives and relationship of Eddy and Twain as \"a quirky, tender, tragicomic portrait of two contrasting lives, set against the backdrop of Gilded Age America.\"[61] Citizen Twain was initially performed as a one-man show Hollywood workshop in April 2012; it then became the basis of Kilmer's film project, which would be his directorial debut.[59] The 90-minute film version of his one-man stage show was released as Cinema Twain.[62] In 2013, he reunited with his Top Gun co-star Anthony Edwards in the Disney animated movie Planes. Kilmer voiced the character Bravo, while Edwards supplied Echo. Kilmer also played the role of Detective Dobson in the series finale of the television show Psych.\n\nIn 2017, Kilmer appeared in Song to Song opposite Rooney Mara and Ryan Gosling and directed by Terrence Malick.[63][64] Kilmer also appeared in the 2017 film The Snowman, opposite Michael Fassbender and Rebecca Ferguson and directed by Tomas Alfredson.\n\n2020s [ edit ]\n\nIn August 2020, Kilmer shared the screen with his daughter, Mercedes Kilmer, for the first time in Paydirt.[65]\n\nOn June 7, 2018, it was confirmed Kilmer would be reprising his role as Tom \"Iceman\" Kazansky for the upcoming Top Gun sequel Top Gun: Maverick, which was released on May 27, 2022.[66]\n\nPersonal life [ edit ]\n\nIn 2011, Kilmer sold his 6,000-acre (2,400 ha) ranch in New Mexico, where he would track, hike, fish, and raise bison.[60]\n\nKilmer reigning as Bacchus at a 2009 Mardi Gras parade in New Orleans\n\nRelationships and family [ edit ]\n\nKilmer has dated Cher, Cindy Crawford, Angelina Jolie, Daryl Hannah and Ellen Barkin.[67]\n\nKilmer was married to actress Joanne Whalley from March 1988 to February 1996. The two met while working together on the film Willow. They have two children, a daughter, Mercedes (b. 1991), and a son, Jack (b. 1995).\n\nReputation [ edit ]\n\nKilmer is known for being difficult to work with and having feuds with some of the actors with whom he has worked, notably The Island of Dr. Moreau co-star Marlon Brando and Red Planet and Heat co-star Tom Sizemore.[68] Kilmer's Tombstone co-star, Michael Biehn, said: \"People ask me what it's like to work with Val Kilmer. I don't know. Never met him. Never shook his hand. I know Doc Holliday, but I don't know [Kilmer].\"[69]\n\nRichard Stanley, who directed Kilmer for three days in The Island of Dr. Moreau before being fired, recalled, \"Val would arrive, and an argument would happen.\"[70] John Frankenheimer, who replaced Stanley said, \"I don't like Val Kilmer, I don't like his work ethic, and I don't want to be associated with him ever again.\" Batman Forever director Joel Schumacher called Kilmer \"childish and impossible.\"[70]\n\nHowever, other actors have noted that Kilmer prepares for his roles extensively and meticulously. Irwin Winkler (director of At First Sight) talked about his decision to hire Kilmer. \"I'd heard the stories about him, so I checked him out. I called Bob De Niro and Michael Mann, who'd worked with him on Heat, and they both gave him raves... I had a wonderful experience, in spite of all the naysayers.\"[citation needed] When his co-star in the same film Mira Sorvino was asked about Kilmer's reputation as \"difficult to work with\", she responded: \"You know what, he was real easy to work with. I just hate furthering rumors about people being difficult, because it can do such enormous damage to their careers. My experience with him was nothing but positive. He was really professional and gentlemanly, and a terrific actor.\"[71] Jeffrey Katzenberg, producer of The Prince of Egypt, said \"Val was one of the first people cast in The Prince of Egypt. He was there every step of the way; patient, understanding, and phenomenally generous with his time.\"[citation needed]\n\nPolitical views and charity work [ edit ]\n\nKilmer made several trips to New Orleans to help in the 2005 Hurricane Katrina disaster relief.[72] Kilmer is a supporter of Native American affairs and an advocate of environmental protection.[73] He briefly considered running for Governor of New Mexico in 2010, but decided against it.[74]\n\nIn May 2013, Kilmer lobbied Congress on behalf of Equitable Access to Care and Health Act, or EACH Act (H.R. 1814), a bill \"to provide an additional religious exemption from the individual health coverage mandate\" of Obamacare.[75][76]\n\nKilmer is an avid musician; he released a CD called Sessions With Mick in 2007.[77]\n\nHealth [ edit ]\n\nIn January 2015, Kilmer was hospitalized for what his representative said were tests for a possible tumor. Kilmer said on social media, \"I have not had a tumor, or a tumor operations [sic], or any operation. I had a complication where the best way to receive care was to stay under the watchful eye of the UCLA ICU.\"[78]\n\nAfter previously denying persistent rumors that he had been diagnosed with cancer, Kilmer said in April 2017 that he had experienced a \"healing of cancer\".[79]\n\nIn December 2017, The Hollywood Reporter revealed that Kilmer had gone through a \"two-year battle with throat cancer\" and that \"a procedure on his trachea has reduced his voice to a rasp and rendered him short of breath\". In order to speak, Kilmer plugs an electric voice box in his trachea.[3] Due to the cancer, Kilmer underwent chemotherapy and two tracheotomies.[3][4][5][6]\n\nKilmer reported in 2020 that he had been cancer free for four years, but he detailed ongoing struggles with medical treatments including the use of a feeding tube to eat.[80] In 2021, Kilmer worked with Sonantic, a London-based software company, to digitally recreate his voice using AI technology and archived audio recordings of his voice.[81] Over 40 vocal models were generated to find the closest match, which could then be used in future projects.[82][83] For the 2022 film Top Gun: Maverick, director Joseph Kosinski said that despite reports to the contrary, they did not use Sonantic's AI technology in the film.[84] Instead, they used Kilmer's actual voice and digitally altered it for clarity.[84]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nTheatre [ edit ]\n\nVideo games [ edit ]\n\nYear Title Voice role 2011 Spider-Man: Edge of Time Walker Sloan\n\nMusic videos [ edit ]\n\nYear Title Role Notes 2012 \"To Be the Best\" Himself Tenacious D 2016 \"Animals\" Himself Oneohtrix Point Never\n\nAwards and nominations [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/Val_Kilmer_and_50_Cent_%28cropped%29.jpg/220px-Val_Kilmer_and_50_Cent_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/2/22/Val_Kilmer_Cannes.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Wikiversity_logo_2017.svg/27px-Wikiversity_logo_2017.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Hail-Bacchus_Val_Kilmer.jpg/220px-Hail-Bacchus_Val_Kilmer.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Wikinews-logo.svg/27px-Wikinews-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Val-Kilmer.jpg/220px-Val-Kilmer.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Wikisource-logo.svg/26px-Wikisource-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikibooks-logo.svg/27px-Wikibooks-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/22/Val_Kilmer_Cannes.jpg/220px-Val_Kilmer_Cannes.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/0/06/Wiktionary-logo-v2.svg/27px-Wiktionary-logo-v2.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/2/22/Val_Kilmer_Cannes.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Val_Kilmer", "title": "Val Kilmer", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/2/22/Val_Kilmer_Cannes.jpg", "width": 640, "height": 842}, "title": "Val Kilmer - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}