{"url": "https://web.archive.org/web/20100727204056/http://twilightsaga.wikia.com:80/wiki/Jacob_Black_and_Renesmee_Cullen", "text": "From Twilight Saga Wiki\n\nJacob Black\n\nedit] Breaking Dawn\n\nMain article: Breaking Dawn\n\nimprints on, daughter of Bella Swan and Edward Cullen , upon birth.\n\nWhile Bella was pregnant with Renesmee, she felt incredibly drawn to him, and Jacob felt the same. However, neither one of them knew why. In truth, Jacob was drawn to the unborn Renesmee, and vice versa.\n\nRenesmee was born one day earlier than expected and Bella goes through a very painful labor. Jacob was mad, believing that Bella had died from giving birth to Renesmee, and came downstairs to destroy \"the monster\" that killed Bella. Renesmee is in Rosalie's arms, and he didn't mind killing her in the process. Renesmee looked at him, and he imprinted on her: describing it as losing connections to everyone else, and the connection to Renesmee was the only one that matters now. He then felt free from his heartbreak over Bella.\n\nWhen Bella woke up, she went hunting with Edward. Upon returning, she came back to find Jacob out of the house as a test whether she is ready to see her child. She called it ridiculous, passing it, then, indoors, and very cautiously, she was finally able to see her daughter, finding out that Jacob has imprinted on her. Returning the baby to Rosalie, she stalked Jacob across the Cullen's lawn threatening him to stay away from Renesmee, and lunging for his throat after she found out that he had nicknamed the baby \"Nessie\". Seth jumped in the way, breaking his shoulder and collar bone.\n\nThe Cullens prepared to leave Forks to avoid Charlie, Bella's father. Jacob, however, did not want to be away from Renesmee and went to visit him. He phased into a werewolf in front of him to reveal that the world was not what he thought it was, telling him that Bella was sick and changed \"a little\" to get better, but without revealing that his daughter had become a vampire. He also told him that if he could deal with the weird and go back to the way things were, then Bella would be able to stay for a while longer. After telling him all of it, he informed him that Bella and Edward were adopting Renesmee. Charlie requested to be told as little as possible about the supernatural so that he may be able to deal with it.\n\nCharlie wished to see Bella, but Jacob insisted to tell them everything first to give them a head start. Bella did not like what Jacob had done and required full report. After he told her everything and Charlie's request, she finally felt relieved, still anxious about her self-control. After a long day without hurting Charlie, Bella felt amazed at her control and felt thankful to Jacob.\n\nOver the next two months, Jacob had visited the Cullens everyday to play with Nessie. Even though Bella and Edward knew that his imprinting on their daughter was involuntary, they still felt annoyed by it all.\n\nBy early winter, Bella, Jacob and Renesmee went hunting, and Bella caught sight of Irina from the Denali Coven. She mistook Renesmee for an immortal child and reported her to the Volturi. The Cullens then decided to collect as many vampire friends as they can to help them witness that Renesmee was not a full-vampire child. But Alice and Jasper went on a secret mission of their own without as much as a goodbye to their family. Jacob felt anxious with each addition of human-feeding vampire, but did not express it.\n\nOn Christmas Day, Edward, Bella, Renesmee and Jacob visited Charlie to celebrate the occasion. Jacob had braided a bracelet to Renesmee, which was the Quileute version of a promise ring. Edward was annoyed by his gift, but Bella had learned to cope.\n\nDuring the threat of the Volturi, Bella got Jason Scott Jenkins to create fake ID's for Jacob and Renesmee, and said that if anything was to happen, Jacob and Renesmee should run away to start a new life somewhere far away, hopefully in Rio where they might run into Jasper and Alice; she had accepted the relationship. Edward shared his goodbyes with Renesmee and called Jacob his \"son\", proving that he had accepted him as well.\n\nThe trial ends peacefully by the testimony of Nahuel, another vampire hybrid, and everyone was allowed to return to their peaceful lives. After hearing from Nahuel that Renesmee would be fully mature after seven years, Edward was also impressed by Jacob not having thought about her growth. Bella remarked that he was in no hurry of her growing up.", "images": ["https://web.archive.org/web/20100727204056im_/http://images.wikia.com/twilightsaga/images/b/bc/Wiki.png", "https://web.archive.org/web/20100727204056im_/http://images1.wikia.nocookie.net/__cb21710/common/skins/common/blank.gif", "https://web.archive.org/web/20100727204056im_/http://images2.wikia.nocookie.net/__cb20100727151933/common/avatars/c/c0/735919.png?20100727151931", "https://web.archive.org/web/20100727204056im_/http://images4.wikia.nocookie.net/__cb2/messaging/images/1/19/Avatar.jpg", "https://web.archive.org/web/20100727204056im_/http://images2.wikia.nocookie.net/__cb20100727184038/common/avatars/a/ae/2069500.png?20100727184036", "https://web.archive.org/web/20100727204056im_/http://images4.wikia.nocookie.net/__cb20100727172026/common/avatars/1/1d/1534883.png?20100727172024", "https://web.archive.org/web/20100727204056im_/http://b.scorecardresearch.com/p?c1=2&c2=6177433&c3=&c4=&c5=&c6=&c15=&cj=1", "https://web.archive.org/web/20100727204056im_/http://images3.wikia.nocookie.net/__cb20100713013558/twilightsaga/images/thumb/c/ce/250px-Jacob-Black-NewMoon.jpg/156px-250px-Jacob-Black-NewMoon.jpg", "https://web.archive.org/web/20100727204056im_/http://twilightsaga.wikia.com/__onedot?c=5687&lc=en&x=twilightsaga&y=&u=0&a=30632&n=0"], "top_img": "https://web.archive.org/web/20100727204056im_/http://images.wikia.com/twilightsaga/images/b/bc/Wiki.png", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20100727204056/http://twilightsaga.wikia.com/wiki/Jacob_Black_and_Renesmee_Cullen", "title": "Jacob Black and Renesmee Cullen", "meta_data": {"description": "While Bella was pregnant with Renesmee, she felt incredibly drawn to him, and Jacob felt the same. However, neither one of them knew why. In truth, Jacob was drawn to the unborn Renesmee, and vice versa.", "generator": "MediaWiki 1.15.4", "keywords": "Twilight Saga Wiki,twilightsaga,Jacob Black and Renesmee Cullen,Bella Swan,Breaking Dawn,Denali Coven,Edward Cullen,Hybrid,Immortal child,Imprint,Irina,Jacob Black,Nahuel"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}