{"url": "https://en.wikipedia.org/wiki/Manushi_Chhillar", "text": "Indian actress and model\n\nManushi Chhillar (born 14 May 1997)[3] is an Indian actress and model, who was the winner of the Miss World 2017 pageant.[4] She represented her state of Haryana at the Femina Miss India 2017 pageant, which she won, and went on to become the sixth representative from India to be crowned Miss World. She made her acting debut with the role of Sanyogita in the historical drama Samrat Prithviraj (2022).\n\nEarly life and education\n\nChhillar was born on 14 May 1997[4] in Rohtak into a Haryanvi family,[5] although her ancestral home is in Bamnoli village of Jhajjar district.[6][7] Her father, Dr. Mitra Basu Chhillar, is a physician and scientist at Defence Research and Development Organisation (DRDO), while her mother, Dr. Neelam Chhillar, is also a medical doctor and departmental head of neurochemistry at the Institute of Human Behaviour and Allied Sciences.[8][9]\n\nChhillar studied at St. Thomas' School, New Delhi and was the all India CBSE topper in English subject in class 12, and scored 96 percent in her boards.[10] She cleared the All India Pre Medical Test (now, NEET) in her first attempt.[11] She was pursuing a medical degree (MBBS) at the Bhagat Phool Singh Medical College in Sonipat.[12][13]\n\nChhillar is fluent in Hindi and English, apart from her mother tongue, Haryanvi.[14] She is a trained Kuchipudi dancer, and had acquired her training under Raja and Radha Reddy.[15]\n\nPageantry\n\nFemina Miss India\n\nChhillar ventured into pageantry with Fashion Big Bazaar sponsored Campus Princess 2016, where she was crowned as one of the finalists from All India Institute of Medical Sciences in December 2016. It was conducted by the Miss India Organization.[16] Thereafter, she went on to win the title of Femina Miss India Haryana in April 2017. Chhillar represented the state of Haryana in the annual Femina Miss India contest.[17] During the competition, Chhillar was crowned Miss Photogenic.[18]\n\nChhillar, as a top 15 semi-finalist was asked by Karan Johar: \"The government is considering to ban surrogacy in India. What is your opinion regarding this?\"\n\nI feel everyone in the world should have a right to be a parent. So, instead of banning surrogacy in India, the government should focus on preventing it's exploitation.[19]\n\nDuring the final question and answer round of Femina Miss India 2017, the top 5 delegates were asked the same question - \"You have spent 30 days with 30 fellow contestants at Femina Miss India. What lesson will you take back with you?\", to which Chhillar responded:\n\nThese days that I have spent with my fellow contestants has been the most dynamic period of my life. The only thing that was certain during the whole experience was uncertainty. The one belief that I would take back with me is that, yes...I can change the world. When I entered Miss India, there was only passion. However, through this journey, I acquired a vision in life. That vision and the belief that I can change the world, is something I'm going to take back with me.[20][21]\n\nShe later went on to win the contest's main title Femina Miss India World 2017, in the finale event venued in Yash Raj Film Studio, on 25 June 2017. Thereby, she earned the right to represent India at Miss World 2017.[22][23]\n\nMiss World 2017\n\nChhillar represented India at Miss World 2017, where she became a finalist in the Top Model, People's Choice, and Multimedia competitions, and was the winner of the Head-to-Head Challenge from Group Nine and co-winner of the Beauty with a Purpose competition.[25] She is India's fourth Beauty with a Purpose winner at Miss World and the first woman to win Miss World and Beauty with a Purpose jointly. Chhillar's Beauty with a Purpose project was titled Project Shakti. The campaign's goal is to spread awareness about menstrual hygiene.[26] She visited about 20 villages for the project and treated over 5,000 women.[27]\n\nDuring the final question and answer round, Chhillar was asked - \"Which profession should receive the highest salary in the world?\" Responding to the same, she answered:\n\nSince I am very close to my mother, I think that a mother deserves the highest respect. When you talk about salary, I don't think it's just about cash, but the love and respect that you give to someone. My mother has been the biggest inspiration in my life. All mothers, they just sacrifice so much for their kids. So, I believe the profession which deserves the highest salary, respect and love should be of a mother.[28][29][30]\n\nOn 18 November 2017, Chhillar was crowned Miss World 2017 by outgoing titleholder Miss World 2016, Stephanie Del Valle from Puerto Rico in the finals in Sanya, China. She became the sixth Indian woman to win the crown, and the first since Priyanka Chopra, Miss World 2000.[31][32]\n\nReign as Miss World\n\nAs Miss World 2017, Chhillar returned to India on 26 November, where she was greeted by a large crowd.[33][34] She was one of the celebrity speakers at the 2017 Global Entrepreneurship Summit in Hyderabad.[35] Chhillar was announced as the brand ambassador for Anaemia Free Haryana.[36] Her Beauty with a Purpose campaign, 'Project Shakti' was given government aid of ₹18 crore (approximately $2.8 million), ensuring free availability of sanitary napkins for all girls in the government schools of Haryana by Chief Minister of the state Manohar Lal Khattar.[37] She was honoured with the Special Achievement Award at the 2017 CNN-IBN Indian of the Year Awards for winning Miss World.[38] Chillar was also India's top trending personality on Google search in 2017.[39] She received Proud Maker of India award at Six Sigma Healthcare Leadership Summit 2017 in New Delhi.[40] Chillar was also a guest speaker at the 10th C4IO by Hewlett-Packard Enterprise at Pushkar.[41] She made an appearance in SET India's television special, Super Nights With Padman to promote her Beauty with a Purpose project on menstrual hygiene, in association with Akshay Kumar's starring film, Pad Man.[42]\n\nAfter her homecoming ceremony, Chhillar's first visit was to London along with Julia Morley, the chairman and CEO of Miss World. They joined the royal honouring ceremony of Marsha Rae Ratcliff OBE, the Past Master of The Worshipful Company of Carmen.[43][44] Chhillar returned to India and visited the Bennett University in Greater Noida.[45][46] In a Q&A session organised by the university, she interacted with the faculty and students.[47]\n\nIn February 2018, she started the first leg of her Beauty With A Purpose tour with Miss World 2017 continental winners - Magline Jeruto (Africa), Ha Eun Kim (Asia), Annie Evans (Oceania), Stephanie Hill (Europe), Solange Sinclair (Caribbean), Andrea Meza (Americas) and Miss World 2016, Stephanie Del Valle at the 1st global edition of 'Feminine Hygiene Awareness' campaign in Hyderabad in collaboration with Government of Telangana.[48] They continued the campaign at Kolkata, where Bengal Chamber of Commerce and Industry hosted a special adda session on Feminine Hygiene in association with Miss World Beauty With a Purpose world tour team.[49] They visited \"New Light\" NGO in slum area of Kolkata and also learnt to make low cost biodegradable sanitary pads at the Jute Industries Research Association.[50] The team further worked on spreading awareness about menstruation and ensuring the availability of sanitary pads in rural areas.[51] They joined hands with Aakar Innovations, an NGO that works on the same issue, to create more low cost, biodegradable sanitary napkins.[52] She also visited Mumbai's Dharavi slum for 'Save the Girl Child' event.[53]\n\nManushi, along with the Miss World team, also met Muppavarapu Venkaiah Naidu, the Vice-President of India, and Sushma Swaraj, Minister of External Affairs, to discuss her beauty with a purpose project.[54] She visited Indian cities Hyderabad, Kolkata, Mumbai and Delhi for her 42-day beauty with a purpose tour. Chhillar then reached Hong Kong city[55] and was later invited by China Central Television to star in the biggest live event Chinese New Year's Gala at China. The Miss World team landed in Indonesia in continuation with the humanitarian tour.[56] During her stay in Indonesia, Manushi visited The Golden Bridge, a Beauty with a Purpose project which was completed by Miss Indonesia 2014, Maria Rahajeng, participated in humanitarian activities and also crowned Miss Indonesia 2018, the representative of Indonesia for Miss World 2018.[57]\n\nAfter this, Chhillar along with the Miss World team landed in the British Virgin Islands. They met the governor of British Virgin Islands and worked to raise funds for the beauty with the purpose project of Miss British Virgin Islands 2017, Helina Hewlet.[58] They were physically involved in the cleaning campaign of Eslyn Henley Richiez School, the only school for differently abled children in the British Virgin Islands territory which was destroyed by Hurricane Maria and raised money for its restoration.[59] She also met students from Eslyn Henley Richiez School and spent time painting with them. The paintings were auctioned and raised additional funds to reach $1.4 million to rebuild the school.[59] She and the Miss World team later attended a gala dinner and auction at the Moorings Mariner Inn.[60] She also attended the second annual ‘Beauty with A Purpose’ (BWAP) philanthropic award.[60]\n\nShe subsequently visited the United States, where she was a presenter and performer for a 16-hour TV show on channel ABC, the 44th Variety Children's Charity Telethon held at Iowa.[61] They raised $3.5 million in association with Variety Telethon team for the annual fundraiser which donates its proceeds to underprivileged children.[62] She was felicitated at South Asian Women Empowerment gala held on International Women's Day in New York City along with other women achievers[63] and also joined as a presenter for \"South Asian Empowerment Awards\".[64] The first part of her beauty with a purpose tour ended with her United States visit.[65] After returning to India, she was one of the guest speakers at The Economic Times Women's Forum 2018.[66]\n\nChhillar reached Brazil in continuation of her humanitarian tour. She visited the Government Palace in the State of São Paulo, where the First Lady of the State, Professor Lucia Franca discussed various social projects supported by the state with Chhillar.[67] She initiated an awareness program to prevent and fight against leprosy.[68] According to Chhillar, the aim was to teach people about the early signs of the disease and the ways to seek treatment.[69] She also met and interacted with the children from the APAE, an organization that primarily works towards the welfare of children suffering from Down Syndrome.[70] She gave a presentation on behalf of the organization to the Governor of the Federal District of Brasília, Rodrigo Rollemberg, at the Charity Gala arranged by APAE.[71] She highlighted the works done by the organization and requested the Governor to help build a new third floor to the APAE building, so that all the children with Down Syndrome in the state could be helped.[70][72][73] She was invited by Foreign Affairs Chairman, Congressman Nielson Pinto and the National Defense Committee, and was honored by the Parliament of Brazil for her humanitarian works.[70]\n\nIn May 2018, Chhillar reached Manila, Philippines for the press presentation and inauguration of Mister World 2019 contest which was to be venued in the Philippines.[74][75] Chhillar later reached New Zealand as part of the Beauty with a Purpose campaign.[76][77] Chhilar, along with the Miss World team visited the Ronald McDonald House in Auckland, and served in the charity house as volunteers.[78][79] She was named as a judge for the Femina Miss India 2018 contest held on 19 June 2018. She crowned her national successor, Anukreethy Vas at the end of the event.[80]\n\nShe then visited South Africa to take her project on menstrual hygiene forward.[81] During the first day of the visit, she along with the Miss World team visited the Metro Radio in Johannesburg to commemorate the Nelson Mandela cenetary celebrations.[82] As a result of Chhillar's Beauty With A Purpose Project on feminine hygiene, machines that manufacture low cost and compostable sanitary pads were installed in Nelson Mandela's birthplace Mvezo.[83] The President of South Africa, Cyril Ramaphosa, led the official ceremony of unveiling the first Sanitary Pads Unit, on 18 July 2018, which marked the 100th birth anniversary of Nelson Mandela. Chhillar, along with Miss World 2014, Rolene Strauss, inaugurated the first sanitary pad manufacturing unit set up by them in South Africa.[84] Apart from the launch of the sanitary pad unit, Mandela's birthday was celebrated by handing out more than 200 blankets and winter hats to the elderly at the newly opened 'Nosekeni Nongaphi Health Center'.[85] The Miss World team also donated 100 bicycles to school children in Mvezo, Mandela's home village.[86][87]\n\nShe returned to England and joined Stephanie Hill, Miss World Europe 2017 for the presentation of £15,000 raised by the charity projects of Miss England contestants.[88] It was donated to the Mid Derbyshire Riding School for the disabled.[89][90] During her reign, she suffered a leg injury and was unable to perform her duties for a month.[91][92] After her recovery, she landed in Los Angeles, California for Miss World America 2018.[93][94] Chhillar reached Sri Lanka and met John Amaratunga, the Minister of Tourism Development of Sri Lanka.[95] She later visited the Philippines for the second time to attend the coronation event of Miss World Philippines 2018, as one of the judges.[96] She reached France to attend the presentation event of 'Beauty with a Purpose' documentary in Cannes.[97] Chhillar then visited Sanya, China and was a member of the jury in Miss China World 2018.[98] She inaugurated the 'Haryana Film Policy' in the Indian city of Gurgaon, along with the Chief Minister of Haryana, Manohar Lal Khattar.[99][100]\n\nDuring her reign as Miss World, she lived in England and visited China (three times), Hong Kong, Indonesia, the British Virgin Islands, the Philippines (twice), Sri Lanka, South Africa, New Zealand, Brazil, the United States (twice), France and her native country, India.\n\nChhillar crowned her successor Vanessa Ponce of Mexico at the end of Miss World 2018, which took place in Sanya, China on 8 December 2018.[101][102]\n\nActing career\n\nChhillar made her Bollywood debut with Yash Raj Films's project, Samrat Prithviraj directed by Chandraprakash Dwivedi.[103] The film is based on Prithviraj Raso, an epic poem composed in Braj Bhasha language about the life of Prithviraj Chauhan, a Rajput king from the Chahamana dynasty.[104] After several auditions and trails, she was cast in the film as the Princess of Kannauj, Sanyogita, Prithviraj's wife.[105] She will star alongside Akshay Kumar, who will portray the titular role Prithviraj.[106]\n\nThe film was initially scheduled to release on the occasion of Diwali in 2020, but was postponed due to COVID-19 pandemic.[107] Elaborating her role, Chhillar stated: \"It's a huge responsibility to play princess Sanyogita, a powerful personality who stood up for what is right and took the most important decisions of her life herself.\"[108]\n\nChhillar signed a three-film deal contract with Yash Raj Films, and her second film is titled The Great Indian Family, a comedy film backed again by the banner and directed by Vijay Krishna Acharya, where she would work opposite Vicky Kaushal.[109][110] She will also appear alongside John Abraham in Dinesh Vijan's Tehran[111]\n\nOther works\n\nEndorsements\n\nChhillar has modelled for brands like Bata,[112] Fashion Big Bazaar,[113] Cinnamon Hotels & Resorts,[114] Gio watches,[115] and Club Factory.[116] In April 2018, she was announced as the brand ambassador for the retail jewellery group, Malabar Gold and Diamonds.[117][118] She has promoted brands like Audi Q5 and Panasonic.[119][120] She is also the official brand ambassador for Adidas[121][122] and Pantene in India.[123]\n\nSocial works\n\nIn May 2018, Chhillar joined hundreds of women in a 3 km walk through the streets of Delhi to create social awareness on the World Menstrual Hygiene Day.[124][125] Supporting the Fit India Campaign, Chhillar along with the Vice President of India, Venkaiah Naidu waved the flag at the starting line to initiate the race, as thousands of cyclists made it to the streets of Delhi celebrating the World Bicycle Day.[126][127] She is a strong advocate for vegetarianism and has expressed her views on the subject on various platforms.[128][129]\n\nChhillar was appointed as the ambassador for Government of Haryana's campaign to curb Anemia, which was instituted since almost 61 per cent of the women in the state were effected from the disease.[130] She expanded the scope of her Beauty with a Purpose campaign, Project Shakti and initiated awareness programme among rural women for HIV/AIDS in India.[131] On initiating this programme, she expressed:\n\nAIDS awareness among women will be one of the key initiatives of Project Shakti, because I feel women of our country are at risk due to lack of awareness programs. We work with hundreds of women across India and we are looking to educate them about AIDS awareness so that they can convey this message in their respective communities. It is absolutely essential for our country to fight HIV/AIDS and I am looking forward to doing my bit for the cause.[132]\n\nChhillar collaborated with the UNICEF's campaign to raise awareness on the Coronavirus pandemic.[133] In a video released by UNICEF India, she urged people to stay at home and practice social distancing.[134][135] Chhillar also urged state governments in India to distribute sanitary pads, along with daily ration to the female migrant workers who were prone to severe risks due to shortage of funds in their hands during the migrant labourers' crisis in India, which arose as a result of the strict lockdown imposed to contain the spread of SARS CoV-2.[136]\n\nIn 2021, the United Nations Women affiliated with Chhillar in order to raise awareness regarding gender-based violence.[137][138] She supports an initiative titled 'Orange the World', and works towards curbing online harassment of women among other forms of harassment, and spreading more awareness pertaining to this issue.[139][140][141]\n\nIn March 2021, Chhillar along with Dipika Pallikal and Nikhat Zareen, became part of a campaign launched by Adidas called Make A Move, with the vision to encourage and motivate women to overcome psychological and social barriers.[citation needed]\n\nIn the media\n\nSubsequent to her win at Miss World, Chhillar received widespread recognition and attention from the media.[142][143][144] Chhillar was recognised for her achiements by CNN-IBN, and she was awarded at the 2017 Indian of the Year awards, by the organization.[145] She was voted as the Most Desirable Woman of India in the 2018 internet survey conducted by Times of India.[146] In 2019, she was named as the 'Sexiest Vegetarian Personality' in India, by PETA.[147] She reacted to the award by expressing, \"Being a vegetarian has actually been a way of life for me. My parents were vegetarians and while they gave me a choice, I never felt like I was missing on something. I've always been a vegetarian and have never felt like I needed to change that.\"[148] In the annual award show organized by Lokmat newspaper, she was named as the most promising Fresh Face in the industry.[149]\n\nFilmography\n\nKey Denotes films that have not yet been released\n\nFilms\n\nYear Title Role Notes Ref(s) 2022 Samrat Prithviraj Sanyogita Debut film [150][151] 2023 The Great Indian Family TBA Completed [152][153] Tehran TBA Filming [154]\n\nTelevision\n\nAwards\n\nMedia titles\n\nYear Awarding Organisation Title Ref. 2017 The Times of India Most Desirable Woman of India [146] 2019 PETA India's Hottest Vegetarian [158]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Flag_of_Venezuela.svg/15px-Flag_of_Venezuela.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Flag_of_Belgium_%28civil%29.svg/15px-Flag_of_Belgium_%28civil%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/be/Flag_of_England.svg/15px-Flag_of_England.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Manushi-Chhillar_snapped_at_a_press_meet_in_St._Regis%2C_Mumbai.jpg/250px-Manushi-Chhillar_snapped_at_a_press_meet_in_St._Regis%2C_Mumbai.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Flag_of_Australia_%28converted%29.svg/15px-Flag_of_Australia_%28converted%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Flag_of_Laos.svg/15px-Flag_of_Laos.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Flag_of_Bangladesh.svg/15px-Flag_of_Bangladesh.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f3/Flag_of_Russia.svg/15px-Flag_of_Russia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/A_Presidente_do_FUSSESP_Lucia_Fran%C3%A7a_recebe_a_Miss_Mundo%2C_Manushi_Chhilar_%2841472867491%29_%28cropped%29.jpg/220px-A_Presidente_do_FUSSESP_Lucia_Fran%C3%A7a_recebe_a_Miss_Mundo%2C_Manushi_Chhilar_%2841472867491%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/3/37/Dagger-14-plain.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/Flag_of_France.svg/15px-Flag_of_France.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/15px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Flag_of_Mexico.svg/23px-Flag_of_Mexico.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Flag_of_Indonesia.svg/15px-Flag_of_Indonesia.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/70px-Flag_of_India.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Flag_of_South_Africa.svg/23px-Flag_of_South_Africa.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Flag_of_Guatemala.svg/15px-Flag_of_Guatemala.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Flag_of_Mexico.svg/15px-Flag_of_Mexico.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Flag_of_the_Philippines.svg/15px-Flag_of_the_Philippines.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Flag_of_Thailand.svg/15px-Flag_of_Thailand.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Canada_%28Pantone%29.svg/15px-Flag_of_Canada_%28Pantone%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Flag_of_Puerto_Rico.svg/23px-Flag_of_Puerto_Rico.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/15px-Flag_of_India.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Flag_of_Serbia.svg/15px-Flag_of_Serbia.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Flag_of_the_Philippines.svg/23px-Flag_of_the_Philippines.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Flag_of_Greece.svg/15px-Flag_of_Greece.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Flag_of_Scotland.svg/15px-Flag_of_Scotland.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/Flag_of_Nepal.svg/15px-Flag_of_Nepal.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Manushi_Chhillar_signature.jpg/150px-Manushi_Chhillar_signature.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Achintya_Holte_Nilsen_visiting_National_Museum_of_Indonesia_with_Miss_World_Winners_%28cropped%29.jpg/200px-Achintya_Holte_Nilsen_visiting_National_Museum_of_Indonesia_with_Miss_World_Winners_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Anukreethy_Vas_and_Manushi_Chhillar_%28cropped%29.jpg/222px-Anukreethy_Vas_and_Manushi_Chhillar_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Flag_of_the_People%27s_Republic_of_China.svg/15px-Flag_of_the_People%27s_Republic_of_China.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Flag_of_Indonesia.svg/23px-Flag_of_Indonesia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Flag_of_Botswana.svg/15px-Flag_of_Botswana.svg.png", "https://upload.wikimedia.org/wikipedia/commons/e/e4/A_Presidente_do_FUSSESP_Lucia_Fran%C3%A7a_recebe_a_Miss_Mundo%2C_Manushi_Chhilar_%2841472867491%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/59/Flag_of_Lebanon.svg/15px-Flag_of_Lebanon.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/23px-Flag_of_India.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Flag_of_Vietnam.svg/15px-Flag_of_Vietnam.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/9e/Flag_of_Japan.svg/15px-Flag_of_Japan.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/e/e4/A_Presidente_do_FUSSESP_Lucia_Fran%C3%A7a_recebe_a_Miss_Mundo%2C_Manushi_Chhilar_%2841472867491%29_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Manushi_Chhillar", "title": "Manushi Chhillar", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/A_Presidente_do_FUSSESP_Lucia_Fran%C3%A7a_recebe_a_Miss_Mundo%2C_Manushi_Chhilar_%2841472867491%29_%28cropped%29.jpg/640px-A_Presidente_do_FUSSESP_Lucia_Fran%C3%A7a_recebe_a_Miss_Mundo%2C_Manushi_Chhilar_%2841472867491%29_%28cropped%29.jpg", "width": 640, "height": 973}, "title": "Manushi Chhillar - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}