{"url": "https://en.wikipedia.org/wiki/Dear_White_People_(TV_series)", "text": "No.\n\noverall No. in\n\nseason Title Directed by Written by Featured character(s) Original release date\n\n1 1 \"Chapter I\" Justin Simien Justin Simien Samantha April 28, 2017 ( )\n\nSamantha White films a \"Dear Black People\" party hosted by Pastiche, a student magazine group hosted by white students. Holding a black student caucus to discuss the matter, her friends learn she is dating Gabe, a white student and the teaching assistant from her class. The fellow black students start losing faith in her awareness and she is torn about what to do. Lionel talks to her, and tells her he has the truth of who really invited the DBP partygoers. After her radio show was replaced, Samantha barges into the studio and rants on-air about the racism on campus, confessing to hacking into the Pastiche account to send invites to prove something; she also apologizes to Gabe.\n\n2 2 \"Chapter II\" Justin Simien Justin Simien Lionel April 28, 2017 ( )\n\nA timid Lionel learned of Pastiche's Dear Black People party from a randomized invitation, and informed the other Black student groups, who shut it down. After writing the article about the party, his editor points out the flaws of his piece but had it front page because it would sell; encouraging Lionel to find more to the story and improve upon what he already found out. This leads Lionel to following breadcrumbs, which proves Samantha hacked Pastiche's account to send invites; Lionel secretly forewarns Sam, who then confesses on the school radio. Getting a haircut from roommate Troy, Lionel opens up that he's gay.\n\n3 3 \"Chapter III\" Tina Mabry Chuck Hayward Troy April 28, 2017 ( )\n\nTroy Fairbanks, son of the Dean, is running for student body president. While Troy is at a donors party, Lionel texts him about the Dear Black People party. Seeing this, Troy has the campus police peacefully shut it down. Troy brings Lionel along to see his campaign trail, and Kurt (Pastiche's editor) asks Troy for help to get people to stop hating him, but is brushed off. After Troy spends the night with Professor Neika Hobbs, come morning he won the election. At his dorm, Troy receives blackmail from Kurt, forcing his hand. Meanwhile, star running back Thane Lockwood dies at a party.\n\n4 4 \"Chapter IV\" Tina Mabry Njeri Brown Coco April 28, 2017 ( )\n\nIn flashbacks, Coco and Samantha had a starting friendship which broke apart from differing ideas on their social groups; Samantha joined BSU while Coco joined and left a sorority. When trying to get with Troy, Coco finds he was dating Samantha at the time. Today, Colandrea \"Coco\" Conners identifies the least with black identity compared to Samantha, and even defends the Dear Black People party. Confronting Samantha at her radio booth, Coco points out her academic leniency is because she looks more white than herself, whereas she would have been more punished. At the Pegasus Party, Coco gleefully locks out the Sorority leaders she once tried to impress.\n\n5 5 \"Chapter V\" Barry Jenkins Chuck Hayward & Jaclyn Moore Reggie April 28, 2017 ( )\n\nReggie creates an app to measure how woke someone is, secretly to impress Samantha, now needing an investor. At Thane's memorial with Al, Rashid and Joelle, they make a new friend in an Asian girl called Ikumi. After seeing a low-quality movie with Lionel, the group point out the racial stereotypes in cinema. Having a late dinner, Joelle and Reggie argue over Reggie's cyberstalking Samantha, but resolve it by going to a party at Addison's house. When Addison repeats the n-word from a rap song, a drunk Reggie calls him out on it and begins an argument; with Kurt fueling matters. When someone bumps Reggie into Addison, cops arrive just then and demand to see ID. As Reggie refuses, the cops draw arms on him, forcing compliance. After seeing Reggie's ID, everyone is told to leave, leaving Reggie traumatized.\n\n6 6 \"Chapter VI\" Steven Tsuchida Leann Bowen Samantha April 28, 2017 ( )\n\nSamantha berates campus police for drawing a gun on Reggie at the party, while the BSU have a heated debate over campus police and how to make a change. Al calls for the snitch who called the cops found, while Coco calls for managing 'blackness' having grown up in Chicago. Kurt approaches Samantha for something to stop the racial tension, but is shot down. Reggie misses his appointment with the Dean about the matter, so Samantha organizes a blockade of the Student Pep Rally. By meeting Gabe's friends for coffee, Samantha is reminded that the reason Reggie missed his meeting is because he has been made a public victim. After tracking Reggie down, they go to an open mic cafe where Reggie reads his poetry about that experience. Heading home, Reggie opens up about how he sees greatness in Samantha.\n\n7 7 \"Chapter VII\" Nisha Ganatra Jaclyn Moore Gabe April 28, 2017 ( )\n\nGabe goes to Samantha's room to check on her after the Pep Rally blockade fails. Samantha tells him she was taking care or Reggie, and that causes Gabe to suspect something happened between the two. At the next black student caucus Troy announces that a town hall will be held on the issue, which the BSU is quick to call for it to be protested not only by black students, but by all marginalized groups on campus. Joelle and Gabe are tasked with gathering support from these groups and along the way he asks her for advice regarding his doubts with Samantha. Gabe then admits to calling the cops at the Addison party to Joelle. The next morning the Independent releases the audio of Gabe's 911 call which Samantha, as well as the rest of the black students take badly and Gabe no longer welcome with them.\n\n8 8 \"Chapter VIII\" Charlie McDowell Nastaran Dibai Lionel April 28, 2017 ( )\n\nFollowing Gabe's ostracization from Armstrong-Parker, Lionel sits down with Silvio pitches the idea for a cover on Troy. Silvio delegates the assignment to Brooke and tasks Lionel with a fluff piece. Lionel ignores Silvio, tags with Troy to a bar and learns of the pressure Troy feels from being a 'model minority figure'. Later that night in the Independent offices, Silvio tells Lionel off for disobeying his instructions and being absent when Samantha clashed yet again with Pastiche's editors at the parade. With no paper to back the BSU up on the issue, Pastiche has a free pass to spin the events in their favor. Lionel decides to write up his original article anyway about what he has learnt over the course of the evening, effectively painting an image of Troy as a 'Mouthpiece and a mascot\".\n\n9 9 \"Chapter IX\" Nisha Ganatra Chuck Hayward & Jaclyn Moore Coco April 28, 2017 ( )\n\nCoco confronts Lionel on his article, only to be surprised by Troy who seems completely fine with the confession being public. Troy and Coco are invited to attend a party at the home of the Hancocks, a wealthy family who financially support Winchester. While discussing the upcoming town hall, the Hancocks express a desire to Troy, Coco and the Dean to see Armstrong-Parker integrated or risk losing their funding. Coco also finds out about Troy's, now over, affair with Professor Neika Hobbs. Coco, behind Troy's back, goes to Samantha to see if she can get her to drop the protest and fails to do so. Troy happens to show up and sees this, later breaking the truth to Coco that he knows she's only with him because of what he represents and that he no longer wants to see her.\n\n10 10 \"Chapter X\" Justin Simien Justin Simien none April 28, 2017 ( )", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/5/5c/Symbol_template_class.svg/16px-Symbol_template_class.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/f/f5/Dear_White_People_Netflix.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f5/Dear_White_People_Netflix.png/250px-Dear_White_People_Netflix.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/f/f5/Dear_White_People_Netflix.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Dear_White_People_(TV_series)", "title": "Dear White People (TV series)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/f/f5/Dear_White_People_Netflix.png", "width": 640, "height": 314}, "title": "Dear White People (TV series) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}