{"url": "https://en.wikipedia.org/wiki/CMT_Music_Awards", "text": "Fan-voted awards show for country music videos\n\nCMT Music Awards Current: 2022 CMT Music Awards Awarded for Achievements in country music videos voted on by fans Location Nashville, Tennessee Country United States Presented by Various First awarded 1967 (as Music City News Awards) Website www .cmt .com /cmt-music-awards /\n\nThe CMT Music Awards is a fan-voted awards show for country music videos and television performances. The awards ceremony is held every year in Nashville, Tennessee, and broadcast live on the CMT (Country Music Television) channel. Voting takes place on CMT's website, CMT.com.\n\nHistory [ edit ]\n\nBeginning in 1967, the Music City News Awards were presented yearly by the now-defunct Music City News magazine. In 1988, The Nashville Network (TNN) began a fan-voted awards show dubbed the Viewers' Choice Awards to help the network celebrate its fifth anniversary. In 1990, the two awards shows merged to become the TNN/Music City News Country Awards.\n\nThe TNN contract with Music City News ended in 1999, and the magazine ceased publication shortly thereafter. Country Weekly became the presenting sponsor of the awards show in 2000, and the show was known as Country Weekly presents the TNN Music Awards. In 2001, as TNN began to phase out its association with country music, the decision was made to shift the awards show to sister network CMT. The 2001 show was simulcast on both networks and was called the TNN/CMT Country Weekly Music Awards. When the show moved permanently to CMT, Country Weekly ended its brief association with the production. During this era, viewers voted for the nominees by telephone or mail in traditional categories such as \"Entertainer of the Year,\" \"Male/Female Artist of the Year,\" \"Song of the Year,\" etc. Most of the categories mirrored those on the CMA Awards and ACM Awards, except all awards were fan-voted[citation needed].\n\nThe awards show was completely retooled in 2002 to become the CMT Flameworthy Video Music Awards, named for the network's branding concept at the time for its most popular videos. The \"Flameworthy\" name was coined by program development vice president Kaye Zusmann, and aimed to symbolize the waving of lighters or similar lights at concerts. The show became more production-based, rather than awards-based, and was modeled after sister network MTV's Video Music Awards. In the process, the traditional awards were shifted to specifically honor the music videos of country artists.[1]\n\nThe show included several non-traditional categories highlighting especially funny, sexy, and patriotic videos; however, these categories were phased out over the years.[2] The show further differentiated itself from the CMA Awards and ACM Awards by showcasing bluegrass performers such as Alison Krauss and Earl Scruggs.[1]\n\nIn 2003, the show was moved to April but returned to June in 2009 to coincide with the CMA Music Festival (the renamed \"Fan Fair\") and the influx of tourists to Nashville as well as capitalize on a time when many of the artists would already be in Nashville at once.\n\nThe name of the show was changed to CMT Music Awards in 2005, although the format remained largely the same as in previous years.[3]\n\nIn 2020, the awards were delayed until October due to the COVID-19 pandemic, with that year's CMA Fest not going forward. Initially planned for October 14, a scheduling conflict with that year's Billboard Music Awards caused the ceremony to be pushed back to October 21.\n\nOn June 28, 2021, ViacomCBS announced that the CMT Music Awards would move to broadcast television on CBS beginning in 2022, and move back to April. The new scheduling competes directly with the ACM Awards, which had also been typically held in April, and had historically been broadcast by CBS;[4][5] the network subsequently declined to renew its contract to air the ACM Awards, citing declines in viewership in comparison to the rights fees being demanded by Dick Clark Productions.[6][7][8]\n\nMajor awards [ edit ]\n\nWinning records [ edit ]\n\nCarrie Underwood is the most awarded artist overall in CMT Music Awards' history (2005–present), with 25 wins.[9]\n\nBy category [ edit ]\n\nVideo of the Year: Carrie Underwood; ten wins [10]\n\nMale Video of the Year: Kenny Chesney; five wins [11]\n\nFemale Video of the Year: Carrie Underwood; eight wins [10]\n\nCollaborative Video of the Year: Carrie Underwood; four wins\n\nCMT Performance of the Year: Carrie Underwood, Luke Bryan and Jason Aldean (tie); two wins each[10]\n\nCMT Artists of the Year [ edit ]\n\n2010: Jason Alden, Lady A, Taylor Swift, Carrie Underwood, Zac Brown Band\n\n2011: Jason Aldean, Kenny Chesney, Brad Paisley, Lady A, Taylor Swift\n\n2012: Jason Aldean, Luke Bryan, Kenny Chesney, Eric Church, Toby Keith, Miranda Lambert, Carrie Underwood\n\n2013: Jason Aldean, Luke Bryan, Florida Georgia Line, Hunter Hayes, Tim McGraw\n\n2014: Jason Aldean, Luke Bryan, Florida Georgia Line, Miranda Lambert, Keith Urban\n\n2015: Luke Bryan, Florida Georgia Line, Sam Hunt, Little Big Town, Blake Shelton\n\n2016: Luke Bryan, Florida Georgia Line, Thomas Rhett, Chris Stapleton, Carrie Underwood\n\n2017: Jason Aldean, Luke Bryan, Florida Georgia Line, Chris Stapleton, Keith Urban\n\n2018: Kelsea Ballerini, Karen Fairchild, Miranda Lambert, Maren Morris, Kimberly Schlapman, Hillary Scott, Carrie Underwood\n\n2019: Kane Brown, Luke Combs, Dan + Shay, Thomas Rhett, Carrie Underwood\n\n2020: Kelsea Ballerini, Brothers Osborne, Florida Georgia Line, Miranda Lambert, Lady A, Little Big Town, Thomas Rhett,\n\n2021: Kelsea Ballerini, Gabby Barrett, Kane Brown, Luke Combs, Chris Stapleton\n\n2022:", "images": ["https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/CMT_Music_Awards", "title": "CMT Music Awards", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "viewport": "width=1000", "og": {"title": "CMT Music Awards - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}