{"url": "https://www.bustle.com/p/sharknado-6-is-the-last-movie-in-the-franchise-its-officially-the-end-of-era-8642093", "text": "Was there ever a world without Sharknado, and what will a world look like without it? On Wednesday, March 28, SyFy announced on Twitter that the art film series Sharknado is ending with Sharknado 6. It is not yet titled. Based on previous entries in the incredible saga, it wouldn't be a surprise to see the network call Sharknado 6 \"The Last One,\" \"Armageddon\", or just \"Sharknado.\" For those with less time on their hands, here's what you need to know: The SyFy network intentionally made an over-the-top B-movie called Sharknado, which combines the devastation of tornadoes with the horror of airborne sharks. It stars Ian Ziering from Beverly Hills, 90210, and Tara Reid, whose entire career led up to that moment.\n\nIn short, the films are incredible. The five Sharknado movies are wonderful and unwatchable, and if you stare too long into the abyss of a Sharknado, the abyss will surely stare back. In order, the Sharknado series has been titled Sharknado; Sharknado 2: The Second One; Sharknado 3: Oh Hell No!; Sharknado 4: The 4th Awakens, which is a pun on The Force Awakens and is so bad, you wonder how the company wasn't sued, and Sharknado 5: Global Swarming.\n\nThe final Sharknado will air in August 2018, per Twitter and CNN. CNN also reported that \"the new movie's plot will reportedly involve Ziering's character going back in time to try and undo the damage the sharks have done to the world,\" and that had better be true, because it's absolutely breathtaking.\n\nThe SyFy network has often run programming counter to Discovery Channel's annual Shark Week, and one eagle-eyed Twitter user suggests that the Sharknado 6 premiere will coincide with the annual festivities. SyFy upped its own ante in the past, bringing \"Sharknado Week\" to the masses to hype fans up for the release of Sharknado 5. Whether this is truly the end of Sharknado Week, as the same Twitter user hypothesized, remains to be soon. At the very least, fans will always have the six films to reflect on in periods of darkness.\n\nAt the risk of attributing too much science to a television movie whose title is a portmanteau of \"shark\" and \"tornado,\" one has to wonder what a time-travel element will entail. After all, sharks are among the oldest living creatures known today. If Ziering's character is meant to travel back far enough to stop the eventual destructive tendencies of the modern shark, how far back must he travel? Will he attempt to halt evolution? How will he determine when is \"just enough\" for the species? How will he do it in general? After all, time doesn't exist in a vacuum; to press pause on the development of shark-kind will likely have a ripple effect, even if this is Sharknado.\n\nIntroducing time travel to the plot unzips the fabric of the Sharknado universe, too. Sure, the film series defies all reason as is, but they'll at least have to explain how time travel becomes a thing, right? Hopefully, fans will see Ziering in some form of time machine. Or, perhaps, visiting parallel universes wherein Sharknados pose zero threat to humanity? Free idea alert.\n\nHonestly, the Sharknado films are ridiculous, and not in a bad way. They're perfect to leave on in the background at a party, or for a marathon watch session when you're hungover and lost the remote in bed somewhere. Provided you can handle a little CGI gore, that is. Or, a lot of it, depending on which sequel you pick. If you can handle barely-animated aquatic life launching out of the sea, occasionally catching fire, and landing on people's faces in the process, this is the series for you. Sharknado is a joke, and it knows that, but all good jokes come to an end eventually.", "images": ["https://imgix.bustle.com/uploads/image/2021/8/5/bc0182b8-a9fe-466f-a555-273ade8f8302-68a5a089-531a-428c-be2d-40a240f7bca9-g_avengers_infinitywar_06_8355f3d7.webp?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/10/1/1b71d3dd-7757-43bc-9711-44eeb6f8e487-community-trailer-still.jpg?w=159&h=110&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.4733&fp-y=0.2244", "https://imgix.bustle.com/uploads/image/2022/10/4/bb8f2b14-bac8-4a01-a3b4-cb28047fe7e2-velma-2.JPG?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2022/10/7/ee2c977e-15a4-4dce-b29a-4ca9be003046-met0002_101_comp_ste_v0002_r709_bw_8fe3b57a.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2018/3/29/0b290510-28ad-45c5-9f3c-dc948204da13-nup_177325_0023.JPG?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/image/2018/3/29/0b290510-28ad-45c5-9f3c-dc948204da13-nup_177325_0023.JPG?w=800&fit=crop&crop=faces&auto=format%2Ccompress", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/3/29/0b290510-28ad-45c5-9f3c-dc948204da13-nup_177325_0023.JPG?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/sharknado-6-is-the-last-movie-in-the-franchise-its-officially-the-end-of-era-8642093", "title": "‘Sharknado 6’ Is The Last Movie In The Franchise & It’s Officially The End Of An Era", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image", "creator": "@sophyish"}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/sharknado-6-is-the-last-movie-in-the-franchise-its-officially-the-end-of-era-8642093", "type": "article", "title": "‘Sharknado 6’ Is The Last Movie In The Franchise & It’s Officially The End Of An Era", "description": "Was there ever a world without Sharknado, and what will a world look like without it? On Wednesday, March 28, SyFy announced on Twitter that the art film series Sharknado is ending with Sharknado 6. It is not yet titled. Based on previous entries in…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/3/29/0b290510-28ad-45c5-9f3c-dc948204da13-nup_177325_0023.JPG?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "Was there ever a world without Sharknado, and what will a world look like without it? On Wednesday, March 28, SyFy announced on Twitter that the art film series Sharknado is ending with Sharknado 6. It is not yet titled. Based on previous entries in…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}