{"url": "https://www.radiotimes.com/news/on-demand/2018-12-18/the-crown-how-similar-real-life-olivia-colman-helena-bonham-carter/", "text": "So who is in the cast of The Crown season three, and where have we seen them before? And how similar do they look to the real-life royals at the time the drama is set? Let's take a closer look...\n\nOlivia Colman plays Queen Elizabeth\n\nThe Crown's costume designers probably modelled Olivia Colman's debut royal outfit from this portrait of Elizabeth II in her office in 1970, titled \"Royal Globetrotter\". Colman looks pretty convincing as the monarch, though her brown eyes differ from the Queen's blue.\n\nWho previously played Queen Elizabeth? The role was played by Claire Foy in seasons one and two.\n\nTobias Menzies plays Prince Philip\n\nNetflix revealed its first look at new actor Tobias Menzies in costume as Prince Philip at the end of August 2018. The picture of the real Prince Philip on the left was taken during a formal event in Malta in 1967, which falls right in the time frame for series three. The outfit is spot-on!\n\nWho previously played Prince Philip? The role was played by Matt Smith in seasons one and two.\n\nJosh O'Connor plays Prince Charles\n\nWhen it was announced he was joining the Netflix biopic, O'Connor joked that he did have the \"right ears\" for the role. However, he has since told RadioTimes.com that this is where the similarities end. \"The ears is where it stops, really,\" he explained. \"Hopefully I’m not too similar to him. I’m playing a character, I’m not playing real life Prince Charles and hopefully bringing something else to a role in a drama rather than replicating the real man.\"\n\nWho previously played Prince Philip? The last time we saw Prince Charles he was only a kid, played first by the child actor Billy Jenkins and then (towards the end of season two) by Julian Baring.\n\nEmerald Fennell plays Camilla Parker Bowles\n\nWith completely different face shapes and lips, there aren't many physical similarities between Call the Midwife's Emerald Fennell and Prince Charles's love interest (and later second wife) Camilla. But perhaps there's something in the eyes?\n\nMarion Bailey plays the Queen Mother\n\nThe Queen Mother was born in 1900 when Victoria was still on the throne. Here she is at the age of 66, to Marion Bailey's 67 – and looking at their photographs next to each other, you can see why they cast her.\n\nWho previously played the Queen Mother? In seasons one and two, the role was played by Victoria Hamilton.\n\nHelena Bonham Carter plays Princess Margaret\n\nIn most photographs from this era Princess Margaret can be seen smiling – but who knows what kind of haughty glares she gave behind closed doors, as we see in this first image of Helena Bonham Carter. Certainly the Queen's sister loved her eyeliner and lipstick – and a bit of bling.\n\nWho previously played Princess Margaret? The role was previously played by Vanessa Kirby.\n\nBen Daniels plays Tony Armstrong-Jones\n\nPrincess Margaret's husband Tony (aka Lord Snowdon) was a society photographer – and a bit of a rogue. With his piercing blue eyes, you can see why The Crown's casting director chose Ben Daniels.\n\nWho previously played Princess Margaret's husband? Matthew Goode joined the cast when Antony Armstrong-Jones made his debut in season two.\n\nGillian Anderson plays Margaret Thatcher\n\nMargaret Thatcher was elected as a Conservative MP in 1959, and in the sixties and seventies she climbed the ranks of the party, becoming Education Secretary and then Leader of the Opposition. Finally, in 1979, she achieved her ultimate ambition: she was elected Prime Minister of the United Kingdom. Thatcher remained PM until her downfall in 1990.\n\nMore like this\n\nIn September 2019, Netflix finally confirmed the open secret that Gillian Anderson would be playing Margaret Thatcher. The actress said she was \"so excited\" to have the opportunity to play \"such a complicated and controversial woman,\" adding: \"Thatcher was undoubtedly formidable but I am relishing exploring beneath the surface and, dare I say, falling in love with the icon who, whether loved or despised, defined an era.\"\n\nWhat else has Gillian Anderson been in? The American-English actress has starred as FBI Special Agent Dana Scully in The X Files, DSU Stella Gibson in The Fall, and Jean Milburn in Netflix's Sex Education. Some of her many, many screen credits include War & Peace, American Gods, Hannibal, Viceroy's House, and Bleak House.\n\nJason Watkins plays Harold Wilson\n\nMargaret Thatcher may be set to dominate The Crown season four, but before that we'll see plenty of Labour's Harold Wilson in season three. Wilson was Prime Minister from 1964 to 1970, and then – after losing the General Election to Edward Heath's Conservatives – he returned as PM from 1974 to 1976.\n\nErin Doherty plays Princess Anne\n\nGetty\n\nAlso known as \"Anne, Princess Royal\", Queen Elizabeth's second child (and only daughter) was born in 1950 and left school in 1968. Five years later she married fellow horse-enthusiast Mark Phillips and had two kids, but they later separated and eventually divorced.\n\nWho previously played Princess Anne? The role was played in season two by child actress Lyla Barrett-Rye.\n\nFor the latest news and expert tips on getting the best deals this year, take a look at our Black Friday 2021 and Cyber Monday 2021\n\nEmma Corrin plays Diana Spencer\n\nPrince Charles briefly met his future wife Diana until 1977. In 1980 she emerged as a marriage prospect, and they became engaged in 1981 after a brief courtship.\n\nWhat else has Emma Corrin been in? Emma Corrin played Esmé in the TV series Pennyworth, and appeared in series four of Grantchester.\n\nAdvertisement\n\nWill Princess Diana appear in season three? No – it doesn't look like she'll be making her debut until season four.", "images": ["https://images.immediate.co.uk/production/volatile/sites/3/2021/07/radiotimescom-logo2-2c180e8.png?quality=90&resize=120,23", "https://images.immediate.co.uk/production/volatile/sites/3/2019/06/Gillian-Anderson-plays-Margaret-Thatcher-in-The-Crown-fe601e6.jpg?quality=90&fit=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2019/06/Jason-Watkins-plays-Harold-Wilson-in-The-Crown-5a533d8.jpg?quality=90&fit=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2022/05/001-SE-2-3-Cover-page-001-4f5ace0-e1654865469212.jpg?quality=90&resize=75,68", "https://images.immediate.co.uk/production/volatile/sites/3/2018/07/The-Crown-Josh-OConnor-and-Prince-Charles-45a2543.jpg?quality=90&fit=700,466", "https://images.immediate.co.uk/production/volatile/sites/3/2018/10/Camilla-and-Emerald-Fennell-f379c1c.jpg?quality=90&fit=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2018/07/The-crown-comparison-2-2d8f688.jpg?resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2019/06/Emma-Corrin-plays-Diana-in-The-Crown-5163a61.jpg?quality=90&fit=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2018/07/The-crown-comparison-2-2d8f688.jpg?resize=620,413?quality=90&resize=620,414", "https://images.immediate.co.uk/production/volatile/sites/3/2018/08/BeFunky-collage-8-09773f9.jpg?quality=90&crop=51px,43px,1735px,1156px&fit=700,466", "https://images.immediate.co.uk/production/volatile/sites/3/2019/06/Erin-Doherty-plays-Princess-Anne-in-The-Crown-7a6adba.jpg?quality=90&fit=620,413", "https://images.immediate.co.uk/production/volatile/sites/3/2018/07/the-queen--6c3fcc9.jpg?quality=90&fit=700,466", "https://images.immediate.co.uk/production/volatile/sites/3/2018/07/The-Crown-Marion-Bailey-and-the-Queen-Mother-a9d70ea.jpg?quality=90&fit=700,466", "https://images.immediate.co.uk/production/volatile/sites/3/2017/08/cropped-radiotimes-header-logo-ad1202c.png?quality=90&resize=220,46", "https://images.immediate.co.uk/production/volatile/sites/3/2018/07/Princess-Margaret-in-The-Crown-1ab72b2.jpg?quality=90&fit=700,466", "https://images.immediate.co.uk/production/volatile/sites/3/2018/07/Lord-Snowdon-and-Ben-Daniels-in-The-Crown-0fea35a.jpg?quality=90&fit=700,466", "https://images.immediate.co.uk/production/volatile/sites/3/2022/10/Marvellous-square-ee54d11.jpg?quality=90&resize=93,84", "https://images.immediate.co.uk/production/volatile/sites/3/2019/12/ipso-sq-7800070.png?quality=90&resize=80,80", "https://images.immediate.co.uk/production/volatile/sites/3/2021/07/radiotimescom-logo2-2c180e8.png?quality=90&resize=600,113"], "top_img": "https://images.immediate.co.uk/production/volatile/sites/3/2018/07/The-crown-comparison-2-2d8f688.jpg?resize=620,413", "keywords": [], "authors": ["Eleanor Bley Griffiths"], "canonical_link": "https://www.radiotimes.com/tv/drama/the-crown-how-similar-real-life-olivia-colman-helena-bonham-carter/", "title": "How similar do the new cast of The Crown look to their real-life characters?", "meta_data": {"viewport": "width=device-width", "title": "How similar do the new cast of The Crown look to their real-life characters? | Radio Times", "description": "How similar do The Crown cast look to the real people? Who is replacing who?", "twitter": {"creator": "RadioTimes", "site": "Radio Times", "card": "summary_large_image"}, "og": {"title": "How similar do the new cast of The Crown look to their real-life characters?", "description": "Olivia Colman, Helena Bonham Carter and Tobias Menzies are taking over for The Crown season three. Here's how they compare to the people they play...", "type": "article", "site_name": "Radio Times", "url": "https://www.radiotimes.com/tv/drama/the-crown-how-similar-real-life-olivia-colman-helena-bonham-carter/", "image": {"identifier": "https://images.immediate.co.uk/production/volatile/sites/3/2018/07/The-crown-comparison-2-2d8f688.jpg?resize=620,413", "alt": "The crown comparison", "width": 620, "height": 413}}, "google-site-verification": "iUM5QciI_0yvO6R3xDcoZPgevG7nfNhNsNv6zOjlvpU", "fb": {"pages": "u4ylx6xopb5vy1edoq8hy242v9y83x"}, "next-head-count": 45}, "movies": [], "publish_date": 1545091200.0, "source": "https://www.radiotimes.com", "summary": ""}