{"url": "www.yourtango.com/2018314619/7-details-about-taylor-swift-joe-alwyns-relationship-marriage-rumors", "text": "When it comes to Taylor Swift, it’s impossible to talk about her career without also talking about her relationships, as she uses each and every one as inspiration for her songs.\n\n“It’s individual people that come into my life,” Swift has said in the past when talking about where she finds inspiration for her lyrics. “When I first started writing songs, I was always scared that my songs were too personal, like, if I put someone’s name in a song, people won’t relate to it as much. But what I saw happening was, if I let my fans into my life and my feelings and what I’m going through my vulnerabilities, my fears, my insecurities it turns out they have all those things, too, and it kind of connects us.”\n\nNot only has it connected her and her fans, but it also leaves people dissecting each and every one of her songs to find out which of her romances they are about — and there are many to choose from.\n\nMost of Swift’s relationships haven’t been all that long-lasting, but they’ve all been known to fuel the tabloids along with rumors that they’re PR stunts.\n\nHowever, she’s somehow managed to keep her most recent relationship with actor Joe Alwyn under wraps — and they've been dating for over three years now! But that doesn’t mean there isn’t some interesting stuff going on right under our noses.\n\nHere are a few weird details about Taylor Swift and Joe Alwyn's relationship.\n\nBecause behind every talented songstress is a man supporting her (hopefully).\n\nTaylor Swift and Joe Alwyn dated for months without anyone knowing.\n\nIn 2017, Swift all but disappeared from the public eye, which is weird for someone who, until that point, basically had dominated the celebrity news cycle. A source close to Swift had revealed at the time that she stepped away from the spotlight as “she felt like her personal life was spinning out of control.”\n\nDuring this time, Swift and Alwyn reportedly started dating, unbeknownst to just about everyone. News of their relationship broke in May 2017 after they allegedly had already been together for months.\n\n“After what happened with Tom Hiddleston, they were determined to keep it quiet,” a source said at the time. \"Taylor has flown in via private jets and her security has made it a military-like mission to prevent her from being seen.”\n\nSwift and Alwyn started dating right after her breakup with Tom Hiddleston.\n\nOut of all of Swift’s relationships, the one with Tom Hiddleston is probably the most bizarre. Though it only lasted three months, it was quite a whirlwind.\n\nSwift and Hiddleston broke up in September 2016, and it seems her relationship with Alwyn may have started in October of that year.\n\n\"She has been going back and forth between Nashville and the U.K. for the last few months while she has been recording her album,\" a source revealed.\n\nTaylor Swift and Joe Alwyn are rarely seen together.\n\nDespite Swift being “crazy about Joe” and “really excited about their relationship,” it’s been very rare that we even catch a glimpse of them together — which is very unlike the country-pop crossover star.\n\nThis leads us to believe Alwyn has had something to do with the change of pace which, according to an insider, is likely the case.\n\n“Joe doesn't like attention or have any interest in being a celebrity,” the source said in 2017, \"She still intends to keep the relationship as private as possible. It's sacred to her and she feels that keeping it to themselves has worked out for the best.”\n\nTaylor Swift and Joe Alwyn haven't walked the red carpet together.\n\nIt’s one thing to avoid paparazzi, but throughout their relationship so far, Swift and Alwyn have also yet to walk a red carpet together.\n\nAccording to a source, this is a deliberate way for the couple to keep their relationship together. “[Taylor]’s grown up a lot in the last few years and realizes how important it is to avoid being in the limelight 24/7 in order to maintain a stable, secure relationship,” a source reportedly said.\n\nAnd the 2020 Golden Globes was the closest they ever got to actually walking a red carpet together. Although they had both attended the event and were seen together throughout the night, they had made their way down the red carpet separately.\n\nAlwyn doesn’t want to be known as 'Taylor Swift’s boyfriend.'\n\nSwift is about as popular of a celebrity as you can be. And while Alwyn has started to up his status, he’s nowhere near the star Swift is — yet. And according to a source, he doesn’t want Swift’s celebrity to eclipse his talent.\n\n“Joe is determined to make it as an actor in his own right, and not to be known just as Taylor Swift’s boyfriend,” a source close to Joe had reportedly revealed in 2018. “Taylor is really supportive of Joe’s career, and totally understands why he doesn’t want to be a red carpet fixture with her.\n\nAlwyn puts his job over everything.\n\nAlwyn’s acting career is still in its infancy, but he’s determined to make it in the industry. According to one of Alwyn’s former classmates, Alwyn is “married to his work.”\n\nIt seems Swift knows this, though, and so far, doesn’t mind. “Taylor loves that Joe is so dedicated to his career, and to making it big in his own name, and their relationship is all the happier for it,” a source revealed.\n\nAre Taylor Swift and Joe Alwyn married already?\n\nIt seems as though all of Swift’s relationships up to this point have been lighthearted and fun (until they weren’t, of course, as we’ve learned in her lyrics).\n\nHowever, there have been some clues pointing to the fact that Alwyn may be the one she's ready to get more serious with. In fact, a source revealed in 2018 that she had marriage on the brain at the time. “Taylor really believes Joe is the one for her,” the insider said. “She wants to get engaged to him.”\n\nMarriage rumors resurfaced in January 2020 when fans thought they had seen Swift wearing an engagement ring in her new documentary, Miss Americana. However, there was never any official confirmation that they were (or are) actually engaged.\n\nDid Taylor Swift and Joe Alwyn break up?\n\nSwift just recently dropped her newest album, Folklore, and, naturally, fans have taken to dissecting each and every one of her lyrics. In particular, fans have noted that the new album includes a lot of breakup anthems, which has, in turn, caused a lot of wondering.\n\nThe opening track itself references \"lost love.\" However, Swift took to social media to clear some things up about her new songs.\n\nOn Instagram, she wrote, “I found myself not only writing my own stories, but also writing about or from the perspective of people I’ve never met, people I’ve known, or those I wish I hadn’t. In isolation my imagination has run wild and this album is the result, a collection of songs and stories that flowed like a stream of consciousness. Picking up a pen was my way of escaping into fantasy, history, and memory.”\n\nHowever, on other tracks, Swift actually references her relationship with Alwyn in a positive light. In fact, some believe that Alwyn may have even co-written a few of Swift's new songs.\n\nMicki Spollen is a YourTango editor, writer, and traveler. Follow her on Instagram and keep up with her travels on her website.\n\nEditor's Note: This article was originally posted in June 2018 and was updated with the latest information.", "images": ["https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/joe-alwyn-taylor-swift-relationship.jpg?itok=_LkylAc-", "https://sb.scorecardresearch.com/p?c1=2&c2=6035233&cv=2.0&cj=1", "https://www.yourtango.com/sites/all/themes/ytpurple/img/logo-150.png?v2", "https://www.yourtango.com/sites/default/files/styles/header_slider/public/image_blog/joe-alwyn-taylor-swift-relationship.jpg?itok=Qsc7WqJi"], "top_img": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/joe-alwyn-taylor-swift-relationship.jpg?itok=_LkylAc-", "keywords": [], "authors": [], "canonical_link": "https://www.yourtango.com/2018314619/7-details-about-taylor-swift-joe-alwyns-relationship-marriage-rumors", "title": "7 Weird Details About Taylor Swift And Joe Alwyn's Relationship", "meta_data": {"viewport": "width=device-width,initial-scale=1", "fb": {"app_id": 102332647006, "pages": 39475817260}, "keywords": "Taylor Swift, joe alwyn, Relationships, celebrity relationships, entertainment and news, Buzz", "article": {"author": "https://www.yourtango.com/users/micki-spollen", "published_time": "2020-08-06T08:15:03", "modified_time": "2020-08-06T08:15:03"}, "og": {"site_name": "YourTango", "type": "article", "url": "https://www.yourtango.com/2018314619/7-details-about-taylor-swift-joe-alwyns-relationship-marriage-rumors", "title": "7 Weird Details About Taylor Swift And Joe Alwyn's Relationship", "description": "She reportedly thinks he's \"The One.\"", "updated_time": "2020-08-06T08:15:03", "image": {"identifier": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/joe-alwyn-taylor-swift-relationship.jpg?itok=_LkylAc-", "width": 620, "height": 309}}, "description": "Taylor Swift And Joe Alwyn’s Relationship Is Very Unlike The Rest Of Her Relationships. Though They Keep Their Private Life Hidden, There Are A Few Details About Their Love That Explain Why They Are So Great Together.", "abstract": "Whether they do it or not, most celebrities are able to keep their public persona and private relationships separate. Taylor Swift is not one of", "robots": "follow, index, noodp, noydir, max-image-preview:large", "news_keywords": "taylor swift, taylor swift joey alwyn relationship, are taylor swift and joe alwyn married, did taylor swift and joe alwyn break up, taylor swift boyfriend, joe alwyn, joe alwyn and taylor swift, who is taylor swift dating, celebrity relationships", "generator": "Drupal 7 (http://drupal.org)", "twitter": {"card": "summary_large_image", "creator": {"identifier": "@yourtango", "id": 17490866}, "url": "https://www.yourtango.com/2018314619/7-details-about-taylor-swift-joe-alwyns-relationship-marriage-rumors", "title": "7 Weird Details About Taylor Swift And Joe Alwyn's Relationship", "image": {"src": "https://www.yourtango.com/sites/default/files/styles/listing_big/public/image_blog/joe-alwyn-taylor-swift-relationship.jpg?itok=_LkylAc-", "width": 60, "height": 60}}, "parsely-tags": "celebrity relationships,Relationships,Taylor Swift,joe alwyn,entertainment and news,Andrea Zimmerman - peditor,Samantha Maffucci - seditor,Refurb - dept,blog - node,314619 - nid,0 - expert,1 - approve,1 - refurb"}, "movies": [], "publish_date": 1596698103.0, "source": "http://www.yourtango.com", "summary": ""}