{"url": "www.inquisitr.com/3871816/taylor-swift-reportedly-reacts-to-tom-hiddlestons-golden-globes-win/", "text": "Taylor Swift has reportedly reacted to news of her ex-boyfriend Tom Hiddleston's recent win at the 2017 Golden Globe Awards.\n\nShortly after Sunday night's awards show in Los Angeles, a source claimed Taylor Swift has learned news of Hiddleston's award, which he received for his work in The Night Manager and insisted that the singer was completely happy for her former partner.\n\n\"[Taylor Swift] is happy for Tom's win,\" a source told Hollywood Life on January 9. \"She didn't really see his speech or watch the show. It wasn't appointment television for her to see Tom and others she has dated.\"\n\nWhen Taylor Swift and Tom Hiddleston broke up months ago, rumors swirled in regard to possible arguments and tension over their highly-publicized relationship. However, according to the Hollywood Life source, Taylor Swift holds no ill will for her ex-boyfriend.\n\n[caption id=\"attachment_3871876\" align=\"aligncenter\" width=\"395\"] Tom Hiddleston attended the 2017 Golden Globe Awards on January 8, 2017 [Image by Alberto E. Rodriguez/Getty Images][/caption]\n\nAs for Taylor Swift's decision against watching the awards show, the source claimed the Golden Globes simply weren't something she was focused on. That said, she reportedly believes Hiddleston deserved the award he received.\n\n\"[Taylor Swift] likes being part of award shows but if she has no part of it she chooses to not focus much attention on it. But she is happy that Tom won, she feels that it was well deserved,\" the source explained.\n\nTaylor Swift began dating Tom Hiddleston in June of last year, just weeks after her relationship with Calvin Harris came to an end after 15 months, and right away, several photos of the former couple on the beach together hit the web. Then, for weeks, Taylor Swift's romance with Hiddleston continued to be documented with photos of the two of them in several different countries, including the U.K., Italy, and Australia.\n\nTaylor Swift and Tom Hiddleston enjoyed a months-long whirlwind romance until sometime in September when E! News confirmed they had split amid rumors of a potential dispute over their romance and the amount of attention they were getting.\n\n\"Taylor felt he wanted to take the relationship to be too public, and she was not happy about it and thought it was too much publicity,\" a source told the outlet.\n\nDuring Taylor Swift's romance with Tom Hiddleston, the actor was seen wearing an \"I [love] T.S.\" T-shirt during a beach party, and although they dated for just a few months, they were both believed to have met one another's parents.\n\n[caption id=\"attachment_3871883\" align=\"aligncenter\" width=\"391\"] Taylor Swift attended The 57th Annual GRAMMY Awards on February 8, 2015 [Image by Jason Merritt/Getty Images][/caption]\n\nAs Taylor Swift continues to face rumors regarding her potential feelings towards Tom Hiddleston and his recent award win, the singer is rumored to be working on a new album. While Swift has yet to make her future plans for new music official, she has been regularly releasing new music since her first album in 2006 and was reportedly inspired to create new songs after her split from Hiddleston.\n\n\"[Taylor Swift] is handling things well and she is working on music and writing lyrics down all the time especially since she has been involved in so many recent high profile news stories with [Tom Hiddleston] or [Kanye West] and even the Super Bowl speculation,\" a source told Hollywood Life. \"She has a lot of material to work off.\"\n\nA new album is \"still a work in progress because when she puts something out she wants to fully support it with a tour and television appearances,\" the source continued. \"She is enjoying a little break so there is still some time for all of that.\"\n\nSince splitting from Hiddleston last year, Taylor Swift has been keeping a low profile as she focuses on her career and friendships with her popular girl squad, which includes Lily Aldridge and Gigi Hadid.\n\n[Featured Image by Jason Merritt/Getty Images]", "images": ["https://imgb.srgcdn.com/d258d2ec-e52b-4489-9950-908cc366bacf.jpg", "http://www.inquisitr.com/wp-content/uploads/2017/01/taylor-swift-boyfriend-2.jpg", "https://imgb.srgcdn.com/4b4ada48-86be-4e4b-bb9c-5533d3708ba6.jpg", "http://www.inquisitr.com/wp-content/uploads/2017/01/tom-hiddleston-golden-globes-1.jpg", "https://imgb.srgcdn.com/fe42e24b-1fa1-4cf2-b7ef-0bcd25a6f5c9.png", "https://imgb.srgcdn.com/1740626a-9ecf-4723-b66a-d7ca5e1d678c.jpg", "http://www.inquisitr.com/static/inquisitr/images/favicon-32x32.png", "https://imgb.srgcdn.com/14800743-abae-4146-ae2e-3b7a37ab5d23.jpg", "https://imgb.srgcdn.com/a5ba8e20-c5b5-4c82-ae2b-4f343261a07b.jpg", "https://imgb.srgcdn.com/6977b3f9-ffc5-44c5-866c-e80c13668077.jpg"], "top_img": "http://www.inquisitr.com/static/inquisitr/images/favicon-32x32.png", "keywords": [], "authors": [], "canonical_link": "https://www.inquisitr.com/3871816/taylor-swift-reportedly-reacts-to-tom-hiddlestons-golden-globes-win/", "title": "Taylor Swift Reportedly Reacts To Tom Hiddleston's Golden Globes Win", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimal-ui, user-scalable=no", "msapplication-TileImage": "/static/inquisitr/favicon-128x128.png", "robots": "max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Taylor Swift Reportedly Reacts To Tom Hiddleston's Golden Globes Win", "url": "https://www.inquisitr.com/3871816/taylor-swift-reportedly-reacts-to-tom-hiddlestons-golden-globes-win/", "site_name": "The Inquisitr", "description": "Taylor Swift Reportedly Reacts To Tom Hiddleston's Golden Globes Win", "updated_time": "2021-08-16 18:13:43Z"}, "article": {"modified_time": "2021-08-16 18:13:43Z", "published_time": "2017-01-10 12:47:31Z", "section": "Rumors"}, "description": "Taylor Swift Reportedly Reacts To Tom Hiddleston's Golden Globes Win", "keywords": "Rumors", "twitter": {"card": "summary_large_image", "creator": "@GirlWithGossip"}}, "movies": [], "publish_date": 1484052451.0, "source": "http://www.inquisitr.com", "summary": ""}