{"url": "https://penmenpress.com/2017/11/22/bts-brings-house-2017-amas/", "text": "Viewers of the 2017 American Music Awards witnessed history.\n\nIntroduced by The Chainsmokers, BTS made their U.S. television debut at the 2017 American Music Awards on Sunday, November 19th. BTS is taking the U.S over a landslide by being the first Korean Pop Boy Band to perform on a major American awards show.\n\nBTS delivered their latest hit “DNA” with flashy choreography and enormous support from their A.R.M.Y. (a name given to their international fanbase) who accompanied them with chants throughout their performance. Tweets during and after their epic performance took over social media with the hashtag #BTSxAMAs. Fans, attendees and those new to the K-pop boy band fanbase obsessed over their amazing dance moves, voice control, red carpet fashion and physical aspect of the members of the boy band.\n\nBTS (currently standing for ‘Behind the Scenes’) is a seven-member South Korean Pop Band formed by Big Hit Entertainment. While most boy bands in the U.S. have from three to five members in their groups, South Korean bands are internationally known for having more than 10 members in the band.\n\nJin, J-Hope, RM (known as Rap Monster), Suga, Jimin, V and Jungkook are taking over the world as BTS with their latest album “Love Yourself: Her” which has helped them become the highest charting K-pop group on the Billboard Hot 100.\n\nTheir performance at the 2017 AMA’s was highly anticipated by fans of the band when they announced it on social media. ’To call this guys International superstars honestly seems like an understatement’ said Drew Taggart from The Chainsmokers before the boys bounded on stage\n\nDuring their performance, fans were not the only ones freaking out. Almost everyone, including celebrity guests like Ansel Elgort, was on their feet cheering and singing along with the band. Ansel even appeared to be recording the performance on his phone. “I need a moment to recover from that performance. That was incredible” said Jared Leto who joined the BTS mania and who was also left speechless after BTS’s performance.\n\nIt is safe to say that BTS has officially introduced K-pop to the U.S with their mind-blowing AMA’s performance which has left fans and those new to the concept of K-Pop wishing for more. Luckily this will not be the last time we see BTS on our television sets since shows like Jimmy Kimmel and Ellen DeGeneres have already booked BTS for a special performance on their shows which you won’t want to miss.", "images": ["https://penmenpress.com/wp-content/uploads/2017/11/bts.jpg", "https://penmenpress.com/wp-content/uploads/2017/12/David-Bowie.png", "https://penmenpress.com/wp-content/uploads/2017/12/black-mirror-logo.jpg", "https://penmenpress.com/wp-content/uploads/2018/09/PP-Header-August-2018.png", "https://penmenpress.com/wp-content/uploads/2018/03/avatar_user_59_1522090089-132x132.jpeg", "https://penmenpress.com/wp-content/uploads/2018/10/khalid-kt-08-sm_wide-a91a14768f116c3057b5e949c6e528733372405c-s800-c85-464x290.jpg"], "top_img": "https://penmenpress.com/wp-content/uploads/2017/11/bts.jpg", "keywords": [], "authors": ["Samantha Aguilar Hernandez", "Gabe Carrio", "Kyle Griffin", "Nick Klotz", "Sam Is Communication Major With Minors In Digital Media", "Video Production", "Marketing. She Enjoys Watching Animated Shows", "Writing About Them For The Arts", "Entertainment Section Of The Penmen Press. When She Is Not Working On A New Review", "Sam Can Be Found In The Radiosnhu Booth Conducting The First Show In Spanish."], "canonical_link": "https://penmenpress.com/2017/11/22/bts-brings-house-2017-amas/", "title": "BTS Brings Down the House at 2017 AMA’s", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "BTS Brings Down the House at 2017 AMA's | Penmen Press", "description": "Viewers of the 2017 American Music Awards witnessed history. Introduced by The Chainsmokers, BTS made their U.S. television debut at the 2017 American Music Awards on Sunday, November 19th. BTS is taking the U.S over a landslide by being the first Korean Pop Boy Band to perform on a major American awards show. BTS delivered […]", "url": "https://penmenpress.com/2017/11/22/bts-brings-house-2017-amas/", "site_name": "Penmen Press", "image": {"identifier": "https://penmenpress.com/wp-content/uploads/2017/11/bts.jpg", "width": 1660, "height": 1080, "type": "image/jpeg"}}, "article": {"publisher": "https://www.facebook.com/penmenpress/", "published_time": "2017-11-22T15:50:35+00:00", "modified_time": "2017-11-22T15:53:05+00:00"}, "twitter": {"card": "summary_large_image", "creator": "@penmenpress", "site": "@penmenpress", "label1": "Written by", "data1": "Samantha Aguilar Hernandez", "label2": "Est. reading time", "data2": "2 minutes"}, "generator": "WordPress 5.6", "msapplication-TileImage": "https://penmenpress.com/wp-content/uploads/2018/09/cropped-Press-Circle-Logo-Summer-2018-270x270.png"}, "movies": [], "publish_date": 1511308800.0, "source": "https://penmenpress.com", "summary": ""}