{"url": "https://www.chicagotribune.com/news/local/politics/ct-malia-obama-starts-harvard-met-0818-20170818-story.html", "text": "President Barack Obama jokes with his daughter Malia Obama as they walk to board Air Force One from the Marine One helicopter on April 7, 2016. (Jacquelyn Martin / AP)\n\nWASHINGTON — Malia Obama was 10 years old and in the fifth grade when her father became president, and next week she's set to start a new chapter.\n\nShe's off to Harvard.\n\nAdvertisement\n\nThe 19-year-old is ending a gap year that sparked a national conversation about the trend and unfolded across multiple continents. Soon she is decamping for the venerable Ivy League school in Cambridge, Mass.\n\nHarvard's dorms open to freshmen Tuesday, and classes begin Aug. 30. The university is a familiar place for Obama's alumni parents, who both graduated from Harvard Law School. It also is no stranger to celebrity students and is the alma mater of eight U.S. presidents. That President Barack Obama's friends and former administration officials hold faculty posts at Harvard means his daughter won't be entirely on her own. A Secret Service detail will ensure that too.\n\nAdvertisement\n\n\"How time flies,\" said Anita McBride, a chief of staff for former first lady Laura Bush, whose daughters Barbara and Jenna first welcomed Michelle Obama and her daughters into the White House after the 2008 election.\n\nThe White House florist had made bouquets for the Obama girls. The Bush daughters gave them the grand tour, teaching them how to slide down the banister in the solarium. The departing White House daughters also gave the Obama girls a friendly letter full of their well wishes and advice.\n\n\"Here's a girl who's grown up in the public eye and who's been able to maintain a normal, private life and make regular, everyday decisions about her education and life choices,\" McBride said.\n\n\"She took advantage of a very interesting opportunity at a very unique time in her life, an in-between time in her life,\" she added. Delaying her Harvard start meant Malia Obama would arrive on campus with less visibility and pressure than had she started in 2016 during her father's final months in the Oval Office, added McBride, now with American University's School of Public Affairs.\n\nMalia Obama's gap year coinciding with her family leaving the White House in January gave her time and space to unwind with her parents and sister. \"They had precious family time they were able to enjoy as the entire family was going through a transition,\" McBride said.\n\nThe Obamas moved into a home Washington's Kalorama neighborhood, letting Sasha Obama finish Sidwell Friends School, from which Malia Obama graduated in 2016. Sixteen-year-old Sasha will finish Sidwell in 2019.\n\nThe Obamas announced in May 2016 that Malia Obama had been accepted to Harvard but was taking a gap year. Her 12 months of me time, according to news accounts, featured an extended trip last fall to Bolivia and Peru, a journey reportedly organized by a Boulder, Colo., company called Where There Be Dragons. Eva Vanek, director of admissions for the firm, declined to talk about Malia Obama but spoke generally about its gap-year and summer programs, saying they operated in 19 countries in Asia, Africa and South and Central America.\n\nThe aim is a cross-cultural, experiential education, Vanek said. That means no five-star hotels or fancy buses, but rather home stays with local families, volunteer work, trips on public buses and often, language immersion. The small-group trips \"aren't touristic. They aim to broaden students' perspectives about the world and themselves through these really intimate experiences,\" she said.\n\nAdvertisement\n\nThe goal is to let participants become \"competent travelers and more evolved humans,\" Vanek added.\n\nLast February, Malia Obama started an internship with the Weinstein Co., an employee there said. It's a film and television production and distribution company founded by brothers Bob and Harvey Weinstein. She hit the Sundance Film Festival in January, was spotted in Aspen, Colo., in February, traveled in June with her parents and sister to Bali and rocked out with her younger sister in August at Chicago's Lollapalooza.\n\nBecause of her gap year, Malia Obama will join Harvard's Class of 2021, an exclusive group about to get an expensive education.\n\nHarvard's tuition, fees, room and board run $65,509 for the upcoming school year, though many students get need-based financial aid. Only 5.4 percent of the 39,041 students who applied to be in the Class of 2020 were admitted: some 2,110 students. Altogether Harvard has about 6,700 undergraduates and 14,500 graduate and professional students.\n\nThe school boasts nearly 3,900 courses in 49 undergraduate fields of study, or \"concentrations.\" All freshmen must take Expository Writing 20, but otherwise there is no preset curriculum. Those admitted into her 2021 class are, by a slim majority of 50.9 percent, mostly nonwhite, according to university officials, who declined to comment on the former first daughter.\n\nSoon she'll be able to stroll Harvard Yard, shop at the campus store called \"The COOP\" and perhaps take meals with other freshmen at Annenberg Hall, a high-ceiling dining hall that draws comparisons to the Great Hall in the Harry Potter series. And she'll hit the books. University officials tell students to budget up to $1,200 a year for textbooks.\n\nAdvertisement\n\nThe college experience is one the Bush daughters anticipated. As the Obama family prepared to leave the White House, they sent the two teens another letter, previewing life as a former president's kids.\n\n\"Enjoy college. As most of the world knows, we did,\" they said in one passage. \"And you won't have the weight of the world on your young shoulders anymore.\"\n\nkskiba@chicagotribune.com\n\nTwitter @KatherineSkiba", "images": ["https://www.chicagotribune.com/resizer/msKPDllN0c-ewUXuohXd7XDbphw=/1440x1080/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/tronc/DPDNBSOMSVEFFMMCXYZHQ7GPQU.jpg", "https://www.chicagotribune.com/pf/resources/icons/Menu_Icon.svg?d=87", "https://www.chicagotribune.com/resizer/IZhJhVvNulGp_f0qLhweRrFaNEE=/800x0/filters:format(jpg):quality(70)/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/3WQ5HWNF2BBR7OR4QFQMIQV5EM.jpg", "https://static.themebuilder.aws.arc.pub/tronc/1657752787005.svg", "https://www.chicagotribune.com/resizer/9p0gSt2z35Q7MMWAb0Cic3jkAkI=/1200x630/filters:format(jpg):quality(70)/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/3WQ5HWNF2BBR7OR4QFQMIQV5EM.jpg", "https://www.chicagotribune.com/resizer/ZvM1sJwH1WZNKX_pS5whgOqsFPk=/1440x1080/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/tronc/JMFZP35265EI3BHQROJ5IEE63E.jpg", "https://www.chicagotribune.com/resizer/NZ36a5F0B5w2GTkYxBJxI432YOM=/1440x1080/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/tronc/DLY3PC6AORDZVI6A33ZKEVU7KQ.jpg"], "top_img": "https://www.chicagotribune.com/resizer/9p0gSt2z35Q7MMWAb0Cic3jkAkI=/1200x630/filters:format(jpg):quality(70)/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/3WQ5HWNF2BBR7OR4QFQMIQV5EM.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.chicagotribune.com/politics/ct-malia-obama-starts-harvard-met-0818-20170818-story.html", "title": "Malia Obama's gap year about to end as she goes to Harvard", "meta_data": {"language": "English (United States), en-US", "viewport": "width=device-width, initial-scale=1", "content-id": "XLJBCM3KWFBNDDVYEGGBD4ZUMQ", "apple-itunes-app": "app-id=383137151, app-argument=http://www.chicagotribune.com/deeplinkidXLJBCM3KWFBNDDVYEGGBD4ZUMQ", "description": "Malia Obama was 10 years old and in the fifth grade when her father became president, and next week she's set to start a new chapter at Harvard.", "twitter": {"description": "Malia Obama was 10 years old and in the fifth grade when her father became president, and next week she's set to start a new chapter at Harvard.", "title": "Malia Obama's gap year about to end as she goes to Harvard", "image": "https://www.chicagotribune.com/resizer/9p0gSt2z35Q7MMWAb0Cic3jkAkI=/1200x630/filters:format(jpg):quality(70)/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/3WQ5HWNF2BBR7OR4QFQMIQV5EM.jpg", "site": "@chicagotribune", "card": "summary_large_image"}, "og": {"description": "Malia Obama was 10 years old and in the fifth grade when her father became president, and next week she's set to start a new chapter at Harvard.", "title": "Malia Obama's gap year about to end as she goes to Harvard", "image": "https://www.chicagotribune.com/resizer/9p0gSt2z35Q7MMWAb0Cic3jkAkI=/1200x630/filters:format(jpg):quality(70)/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/3WQ5HWNF2BBR7OR4QFQMIQV5EM.jpg", "type": "article", "site_name": "Chicago Tribune", "url": "https://www.chicagotribune.com/politics/ct-malia-obama-starts-harvard-met-0818-20170818-story.html", "locale": "en_US"}, "keywords": "barack obama,malia obama,president,harvard", "robots": "noarchive", "distribution": "global", "rating": "general", "googlebot-news": "index", "copyright": "Copyright © 2022, Chicago Tribune", "fb": {"page_id": "5953023255,104061989632161,330360537007411,264870045299,73734231949,53310156364,40762490776,60569705796,121922684499844,182379588445160,62915602634,1987930441432108,119608021389933,745745225518281", "pages": "https://www.facebook.com/chicagotribune", "app_id": 306836229411287, "admins": 100000786395051}, "fb_title": "Malia Obama's gap year about to end as she goes to Harvard", "y_key": "cee2fe4077f8d050", "msvalidate.01": "AAC9C18F70AC386BC4DCF4DDF9BF1786", "article": {"publisher": "Chicago Tribune", "tag": "Colleges and Universities,Education,Michelle Obama,The Weinstein Company,Barack Obama", "content_tier": "locked"}, "google": "nositelinkssearchbox"}, "movies": [], "publish_date": 1503010800.0, "source": "https://www.chicagotribune.com", "summary": ""}