{"url": "https://en.wikipedia.org/wiki/Regeneration_(Doctor_Who)", "text": "Concept from series Doctor Who\n\nIn the long-running British science fiction television series Doctor Who, regeneration is a biological ability exhibited by the Time Lords, a race of fictional humanoids originating on the planet Gallifrey. This process allows a Time Lord to undergo a transformation into a new physical form and a somewhat different personality after instances which would normally result in death. Regeneration has been used twelve times throughout the history of the show as a device for introducing a new actor for the lead role of its main character, the Doctor. Other Time Lords and similar characters have also regenerated, usually for narrative reasons, rather than casting.\n\nThe current incarnation of the Doctor is played by Jodie Whittaker, following the regeneration of the Twelfth Doctor (portrayed by Peter Capaldi) during the 2017 Christmas special \"Twice Upon a Time\". A new regeneration into Ncuti Gatwa is expected to occur in 2022 during a centenary special, marking 100 years of the BBC, when Jodie Whittaker steps down from the role.[1]\n\nConceptual history [ edit ]\n\nInspiration [ edit ]\n\nThe concept of regeneration was created in 1966 by the writers of Doctor Who as a method of replacing the leading actor. The role of the Doctor had been played by William Hartnell since the programme began in 1963 but, by 1966, it was increasingly apparent that Hartnell's health was deteriorating and he was becoming more difficult to work with. Producer John Wiles had, following several clashes with Hartnell, intended to have the actor replaced in The Celestial Toymaker; during two episodes of that serial, the Doctor is invisible (owing to Hartnell being on holiday during the recording). Wiles' plan was for the character to reappear played by a new actor. This proposal was vetoed by Gerald Savory, the BBC's Head of Serials (and Wiles' superior), which led to Wiles leaving before The Celestial Toymaker was produced.[2] However, it was apparent that it would not be possible for Hartnell to continue for much longer.\n\nOn 29 July 1966, production concluded on the final episode of The Smugglers, the last serial recorded in the third production block.[citation needed] During production, Hartnell and producer Innes Lloyd had reached an agreement that he should leave the role, having starred in one more serial that would see a handover to a new actor, which would be the first one produced as part of Season 4. Script editor Gerry Davis proposed that, since the Doctor had already been established as an alien, the character could die and return in a new body. Lloyd took this further by suggesting that the Doctor could do this \"renewal\" regularly, transforming from an older man to a younger one; this would allow for the convenient recasting of the role when necessary.[citation needed] The process itself was modelled on LSD trips, with the experience being like the \"hell and dank horror\" of taking the drug.[3]\n\nAt the conclusion of The Tenth Planet, the First Doctor collapses from old age, having commented earlier that his body was \"wearing a bit thin\". Then, before the eyes of his companions Ben and Polly, his features shift into that of the Second Doctor, played by Patrick Troughton. In The Power of the Daleks, the Second Doctor's first story, the Doctor draws an analogy between the renewal and a caterpillar turning into a butterfly.[4]\n\nDeveloping the concept [ edit ]\n\nIt was not clear initially whether the renewal was a natural ability of the Doctor's as opposed to a process initiated by technology. In Power of the Daleks, the Second Doctor describes his renewal as a function of his TARDIS time machine, stating that \"without it, [he] couldn't survive.\"[4]\n\nWhen Troughton left the series in 1969, the Doctor was renewed again, but this time the change was forced on him by the Time Lords at the conclusion of The War Games, where it is referred to as a \"change of appearance\". As with the first change, this language suggested only a superficial physical change, not one of personality, although Jon Pertwee's portrayal of the Third Doctor also differed quite substantially from Troughton's. Unlike the previous change, this one is treated as a punishment rather than a natural process: in The War Games the Second Doctor protests, \"You can't just change what I look like without consulting me!\"\n\nAs the series continued, more aspects of the regenerative process were introduced, but the basic concepts of regeneration as accepted by fans of the series today were only firmly established in the final scene of Planet of the Spiders (1974), when Pertwee's Third Doctor turns into Tom Baker's Fourth Doctor. In this scene, the change is referred to with the word \"regenerate\" for the first time, and is explained as a biological process — \"the cells will regenerate\" — that occurs when a Time Lord's body is dying. It is also stated that following the regeneration the Doctor's brain cells would be shaken up and his behaviour would be \"erratic\" for a time, something that would be evident for most subsequent regenerations.\n\nIn the About Time reference series Lawrence Miles and Tat Wood note that the officially licensed magazine, Doctor Who Monthly, stated in a \"Matrix Data-Bank\" column in 1982 that its readers should not confuse the \"regenerations\" of later incarnations with the \"rejuvenation\" of Hartnell into Troughton.[5] However, dialogue within the series itself explicitly includes the First-to-Second \"rejuvenation\" when enumerating the Doctor's regenerations (for example in Mawdryn Undead (1983)).\n\nIn \"The Timeless Children\", it is explained that the Time Lords got their regeneration ability from an unknown person called The Timeless Child, a child found by an explorer called Tecteun. The child has an undefined amount of regenerations. Tecteun splices the regeneration ability from The Timeless Child across all Time Lords. It is revealed The Timeless Child is The Doctor, and that her thirteen lives (by the point of this episode) are not her only ones and she has lived an unknown number of previous lives.\n\nTransitions [ edit ]\n\nLogopolis, 1981, and Castrovalva, 1982) The Fourth Doctor regenerates into the Fifth Doctor (from, 1981, and, 1982)\n\nThe regeneration \"effect\" was accomplished during the series' original run from 1963–1989 primarily through the use of video mixing. Originally, the plan was to have Hartnell collapse at the end of The Tenth Planet with his cloak over his face, which would then be pulled back to reveal Troughton in the next serial. However, vision mixer Shirley Coward discovered and took advantage of a malfunction in the mixing desk which allowed Hartnell's image to be overexposed to the point of almost whiting out the screen, then fading back in to reveal Troughton's face. This also meant that the regeneration scene could take place with both actors at the conclusion of The Tenth Planet, and Troughton was accordingly signed up to participate.[citation needed]\n\nSubsequent regenerations retained essentially the same method, with or without additional video or make-up effects. The transition from the Fourth to the Fifth Doctor used an additional make-up effect representing a transitional form known as the Watcher, but aside from this, other regenerations in the original series run simply mixed the image of the incoming actor on top of the outgoing one. The transition from the Seventh to the Eighth Doctor in the 1996 television movie took advantage of the higher budget and modern computer animation technology to \"morph\" the features of Sylvester McCoy into those of Paul McGann.\n\nWith the exception of the transitions from the Second to Third, each regeneration was shown on-screen, with the previous incumbent in the role symbolically \"handing off\" the character to the next. The Second Doctor was never seen to actually change into the Third, simply fading off into darkness at the end of The War Games and then stumbling out of the TARDIS, already regenerated, at the start of Spearhead from Space (1970).\n\nThe regeneration of the Sixth Doctor into the Seventh is the only time that a single actor took on the roles of two incarnations of the Doctor. Colin Baker declined the invitation to film the regeneration sequence at the start of Time and the Rani (1987) due to the circumstances in which the BBC dismissed him from the role.[citation needed] As a result, Sylvester McCoy had to don his predecessor's costume and a blond curly wig, lying face down, with the mixing effect to the Doctor's \"new\" features occurring as he was turned over.\n\nThe 2005 series, which revived the programme after its cancellation 16 years earlier, began with the Ninth Doctor already regenerated and no explanation given as to the circumstances behind the change (although a scene in the debut episode \"Rose\" when the Doctor commented on his appearance in a mirror indicated that the change had recently occurred). In the documentary series Doctor Who Confidential, producer Russell T Davies explained his reasoning that, after such a long hiatus, a regeneration in the first episode would be not only confusing for new viewers but also lacking in dramatic impact, as there would have been no emotional investment in the character being replaced.[6] The regeneration into the Ninth Doctor was later seen and explained in \"The Day of the Doctor\" (2013). In this episode, the War Doctor automatically begins a regeneration due to old age at the end of the Last Great Time War. However, the full transition is not seen with only the start of the regeneration being shown.\n\nThe regeneration of the Ninth Doctor into the Tenth at the end of \"The Parting of the Ways\" (2005) used computer effects to morph Christopher Eccleston into David Tennant. In the episode of Doctor Who Confidential accompanying the episode \"Utopia\" (2007), where the same effect is used for the Master's regeneration, it is stated that the production team decided that this would be a common effect for all future Time Lord regenerations, rather than each regeneration being designed uniquely at the whim of the individual director. This style of transition is seen again in \"The Stolen Earth\"/\"Journey's End\" (2008) both when the Doctor undergoes an aborted regeneration, and when his hand spawns a clone in the second part; in \"The End of Time\" (2010) during which Matt Smith took over the role as the Eleventh Doctor; in \"The Impossible Astronaut\" when the Doctor is shot twice and seemingly killed; in \"Day of the Moon\" when a young girl regenerates; and in \"Let's Kill Hitler\" when Mels (Nina Toussaint-White) is shot and regenerates into River Song (Alex Kingston). \"The Night of the Doctor\" and \"The Day of the Doctor\" subsequently use the effect to show the Eighth Doctor and War Doctor's regenerations respectively. The Eighth Doctor's regeneration into the War Doctor uses steady beams of light as opposed to the flame effect used for other revived series regenerations. In the Series 10 episode \"The Lie of the Land\", the Twelfth Doctor fakes a regeneration as part of a plan to test if Bill still has free will. The effect used is consistent with the one used in the modern series, with the Doctor's hands glowing and emitting regeneration energy before he enters full regeneration. However, as the regeneration was not real, it did not use up a regeneration and the Doctor did not change bodies.\n\nThe regeneration from the Eleventh to the Twelfth Doctor slightly differs from other regenerations from the revived series. During \"The Time of the Doctor\", the Eleventh Doctor reveals that he has used all his regenerations and is in fact in his thirteenth and final body, leading to his aged appearance during the events of the episode. At the conclusion, the Time Lords grant him a new regeneration cycle, and he begins his thirteenth regeneration in the explosive manner that has become tradition (so explosive that it destroys invading Dalek forces including a ship and the village of Christmas in the process). However, as this regeneration is the first in a new cycle, it initially only \"resets\" his current body back to its youthful appearance (the Doctor referring to this as the cycle \"breaking in\"), and the eventual transition to the Twelfth Doctor happens with a flash and the actor suddenly lurching back, standing back up to reveal the new Doctor.\n\nIn the 2017 Christmas special \"Twice Upon a Time\", the Twelfth Doctor completes his regeneration into the Thirteenth Doctor (played by incumbent actress Jodie Whittaker). The effect used was more akin to the Tenth Doctor's regeneration to the Eleventh, with an explosive energy discharge being released from the Doctor, and steady streams of regeneration energy being emitted from his hands and head before his features were morphed into Whittaker's.\n\nCharacteristics within the series [ edit ]\n\nRelationship with the TARDIS [ edit ]\n\nIt is mentioned that the TARDIS assists the Doctor during the regenerative process, as suggested by the Second Doctor's statement to this effect shortly after regenerating from the First. This is reiterated by Jack Harkness' insistence that the Doctor be taken into the TARDIS having been shot by a Dalek in \"The Stolen Earth\". Of the five occasions on which the Doctor has regenerated outside the TARDIS: one is forced on him by the Time Lords (Second to Third Doctor, The War Games); one requires a Time Lord to give the Doctor's cells a \"little push\" to start the process (Third to Fourth, Planet of the Spiders); one results in his being dependent on the TARDIS's \"Zero Room\", a chamber sealed from all outside forces, to help him recover (Fourth to Fifth, Castrovalva); one occurs a few hours after he has actually \"died\" (Seventh to Eighth, the 1996 television film; the delay at is, however, shown to have been caused by anaesthetic, rather than the Doctor's distance from the TARDIS); one is induced by the Sisterhood of Karn after reviving the Doctor from actual death (Eighth Doctor, \"The Night of the Doctor\"). The Seventh to Eighth regeneration remains the only one that takes place significantly far away from the TARDIS, without any obvious interaction from other Time Lords and results in the Doctor suffering near-complete amnesia for nearly a day until an event inside the TARDIS triggers his memories to return. The future Eleventh Doctor is killed in mid-regeneration, showing he is vulnerable to death while regenerating and as such his need for the TARDIS may be for safety rather than aid. However it is later revealed that this regeneration was indeed a simulation since the Doctor who was shot was actually a Teselecta robot. The Eleventh Doctor starts his regeneration outside the TARDIS though he does end it inside it. In the case of the Twelfth Doctor, he briefly begins his regeneration after being shot by a laser from a Mondasian Cyberman away from the TARDIS, but holds it off. When his actual regeneration starts, he emerges from the TARDIS as he struggles to hold it back. When the Twelfth Doctor finally does regenerate, it is within the TARDIS. As the Doctor contemplates his regeneration, the TARDIS appears to make its opinion on the matter known by flashing its lights at the Doctor, eliciting a response from him.\n\nIn \"The Christmas Invasion\" (2005) it is stated that the regenerative cycle generates a large amount of energy that suffuses the Time Lord's body, and also shown that residual effects from a regeneration allow him to grow back a hand within the first 15 hours after the initial start of the regeneration. Accordingly, in \"Let's Kill Hitler\", River Song is able to repel bullets after regenerating. She is later able to send off an energy wave soon after her regeneration, though this particular feat may be one of the abilities gained during this time.\n\nIn the series four finale of the revived series, \"Journey's End\", an injured Tenth Doctor manages to avert a full regeneration by channelling \"excess regenerative energy\" into his severed hand, allowing him to heal without changing form. The limb ends up developing into a half-human clone when Donna Noble touches it; the event, a \"two-way\" \"Human-Time Lord Meta-Crisis\", also gives Donna a Time Lord's mind.\n\nIncreased strength is sometimes a temporary by-product of regeneration. Shortly after his third regeneration, the Fourth Doctor karate-chopped a brick in half in episode one of Robot, but was unable to repeat the action later in the same serial. In the moments following his regeneration into his eighth incarnation, the Doctor possessed enough physical strength to batter a steel door completely off its hinges. In \"Twice Upon a Time\", the First Doctor's dying of old age had earlier rendered him \"weak as a kitten\", but his oncoming regeneration temporarily provides him with renewed strength and vitality (as explained to him by the Twelfth Doctor).\n\nIn \"The End of Time\" when the Tenth Doctor regenerates into the Eleventh Doctor, the release of energy damages the TARDIS to the extent that components fall, the door's windows smash and the TARDIS then flies uncontrollably over Earth before crash-landing in Amy Pond's garden. Later, when the Eleventh Doctor begins his regeneration into the Twelfth Doctor in \"The Time of the Doctor\", he is able to control his regeneration energy and sends out energy blasts that obliterate nearby Daleks and an entire Dalek saucer. The release of energy also causes a shockwave that severely damages the town where the regeneration took place.\n\nThe Twelfth Doctor's regeneration into the Thirteenth is also quite explosive; while the streams of regeneration energy being emitted from the Doctor cause some minor damage to the console room, the full extent is revealed when it begins to explode immediately after the Doctor attempts to operate it, and she ends up falling from the TARDIS.\n\nPersonality change [ edit ]\n\nWith regeneration also comes a change of personality. The viewing audience sees this most often and most dramatically in the differing quirks and personality traits of the Doctor's various incarnations. The Doctor's core personality traits of heroism and intolerance of injustice are still retained, but in \"The End of Time\" the Tenth Doctor laments that demise of his current incarnation, with its own personality and attributes, makes for something much akin to an actual death. His last words before regenerating are \"I don't want to go.\"\n\nShortly after the regeneration process, the Doctor sometimes goes through a period of physical and psychological instability. The Fourth Doctor described it as \"a new body is like a new house - takes a little bit of time to settle in\". The Second Doctor experiences crippling pain after his first regeneration (in The Power of the Daleks), while the Third Doctor collapses outside the TARDIS following his regeneration (in Spearhead from Space). The Fourth Doctor started rambling random phrases and possessed a higher than usual strength; he could cut a brick in half merely with his hand (in Robot). The Fifth Doctor (in Castrovalva) begins reverting to his previous personalities, and the Sixth Doctor experiences extreme paranoia, flying into a murderous rage and nearly killing his companion (The Twin Dilemma, 1984). The Eighth Doctor experienced amnesia as a result of post-regeneration trauma (the 1996 television film); uniquely, the Doctor was \"not alive\" at the time of this regeneration. The regeneration from the Ninth to the Tenth Doctor sees the Doctor experiencing sudden spasms and great pain (\"Children in Need special\"), and later being unconscious for most of the next fifteen hours (\"The Christmas Invasion\"). The regeneration from the Tenth to the Eleventh Doctor caused the Doctor to experience strange food cravings, only to be disgusted by them upon actually trying them (\"The Eleventh Hour\"). The Twelfth Doctor forgot how to fly the TARDIS (as well as the name of the TARDIS) right after the regeneration process in \"The Time of the Doctor\". The Brain of Morbius implies that Time Lords other than the Doctor may experience difficult regenerations, since the Sisterhood of Karn had been supplying them with an \"elixir of life\" that could assist the process. In \"The Night of the Doctor\", the Sisterhood tell the Eighth Doctor they can provide elixirs to give rise to non-random regenerations, allowing the Doctor to specify either a physical type or personality.\n\nThe Master showed a dramatic personality change upon regenerating into the Mistress/Missy. In that form, she wants nothing more than to renew her bond with the Doctor, even calling him her \"boyfriend\" at one point. (\"Deep Breath, Death in Heaven\") When she met him again, Missy pretended to be an android and kissed him passionately. (\"Dark Water\") Despite still being manic and a psychopath, she later showed a willingness to reform, spending centuries in the Doctor's custody as a show of her commitment. Later, she felt torn between the Doctor, who represented her repentance, and her past incarnation, who represented a return to her old ways; she ultimately chose the Doctor, for which her past incarnation killed her in disgust. In turn, though Missy expressed a love for who she was in her past incarnation, she forced his own regeneration into her to ensure she would become the person she now was (\"The Doctor Falls\").\n\nExtent of physical change [ edit ]\n\nThe Doctor has always regenerated into a humanoid form. However, when explaining the process of regeneration to Rose at the end of \"The Parting of the Ways\", the Ninth Doctor suggests that his new form could have \"two heads\", or even \"no head\", and in the 2005 Children in Need special, which takes place immediately after that episode, the newly regenerated Tenth Doctor, while examining his new body, makes a point of checking that he has two arms, two legs and two hands, implying that regenerations can sometimes result in physically deformed or non-humanoid forms; similarly, the Eleventh Doctor, upon regenerating, shows relief to still have legs and proceeds to check whether he still has fingers and human facial features. This concern seems to extend to internal organs as well; the Twelfth Doctor remarks, after regenerating, that he has new kidneys (although not really liking their colour). It is not clear whether or not these moments are intended as jokes. The beginning of Destiny of the Daleks (1979) featured Romana trying out a number of potential forms, two of which included a blue-skinned pygmy and a giantess.\n\nWhether Time Lords could change gender in regeneration was never addressed onscreen during the classic series and not explicitly focused on for much of the revival. In The Hand of Fear (1976), the Kastrian Eldrad compared his transformation, from female to male, to Time Lord regeneration, possibly suggesting the process could produce a sex change. The concept of Time Lords changing gender upon regeneration was seeded throughout Moffat's tenure as showrunner. In the second part of \"The End of Time\" (2010), the Eleventh Doctor (Matt Smith) briefly checks for an Adam's apple upon regeneration to confirm if he is still a man. In the 2011 episode \"The Doctor's Wife\", the Doctor recalls a Time Lord acquaintance known as the Corsair, who had at least two female incarnations.[7] In the 2013 short \"Night of the Doctor\", the Sisterhood of Karn offer a dying Eighth Doctor (Paul McGann) control over his inevitable regeneration, with \"man or woman\" being touted as possibilities.[8] The first on-screen cross-gender regeneration was shown in the 2015 episode \"Hell Bent\", in which a white male Gallifreyan general (Ken Bones) regenerates into a black woman (T'Nia Miller), who states that her previous incarnation was the only time she had been a man.[9]\n\nThe most notable Time Lord to have appeared in both male and female forms prior to Whittaker's casting is the Doctor's nemesis, The Master, portrayed from 2014 to 2017 by Scottish actress Michelle Gomez. This character was known as Missy, short for \"Mistress\".[10] In \"World Enough and Time\" (2017), the Doctor tells his companion Bill Potts, in reference to Missy, that Time Lords are mostly beyond gender norms and stereotypes; however, Bill points out that the males and females of the species collectively refer to themselves by a male title. From \"Twice Upon a Time\" onward, Jodie Whittaker portrays the Thirteenth Doctor, the Doctor's first female incarnation.\n\nFemale Doctors were previously explored in spin-off productions; Joanna Lumley appeared as a satirical version of the Thirteenth Doctor in the 1999 Comic Relief special The Curse of Fatal Death. Arabella Weir also played an alternate Third Doctor in the Doctor Who Unbound Big Finish episode Exile. Neither portrayal is typically considered to be within the show's main continuity.[11] Spin-off media have also depicted more drastic regenerations than the TV series. For example, in the Big Finish Productions audio Circular Time, a Time Lord known as Cardinal Zero regenerates into an avian life-form after being poisoned.[12]\n\nControl over regeneration [ edit ]\n\nThe Doctor's regenerations are always involuntary, and he has no control over his final appearance. In \"The Parting of the Ways\" (2005), the Ninth Doctor describes the process as \"a bit dodgy\"—i.e., somewhat dangerous or uncertain—and the Tenth Doctor refers to regeneration as \"a lottery\" (\"The Day of the Doctor\", 2013). For example, despite an apparent wish for this to occur, neither the Ninth nor the Tenth Doctors regenerated into redheads. The sole known exception to this is the Eighth Doctor's regeneration into the War Doctor (\"The Night of the Doctor\", 2013), as the Doctor was able to consume a potion made by the Sisterhood of Karn which ensured his next body was a warrior able to fight in the last Great Time War, though he didn't appear to make any specifications about the actual physical appearance. The Doctor was also once given the chance to choose his appearance upon his forced regeneration by the Time Lords in The War Games (1969) but rejected all of the options presented to him. The Time Lords grew tired of his stalling and thus sent him away to regenerate into the Third Doctor, an apparently random result. Alternatively, the Tenth Doctor was shown twice to exert control over regenerating, attributed by the Eleventh Doctor to \"having vanity issues at the time.\" In \"Journey's End\" (2008), after being shot by a Dalek triggered a regeneration, the Tenth Doctor used the regeneration energy to heal his wounds, then channelled the remaining energy into his severed hand and purposely kept his current appearance. When he finally did regenerate into the Eleventh Doctor, he still consciously prevented himself from regenerating to prolong his time as his current incarnation for several hours. Doing this caused a more explosive regeneration that nearly destroyed the TARDIS.\n\nIn contrast, the first episode of Destiny of the Daleks (1979) depicts Romana undergoing a voluntary regeneration, in which she tries out several different forms before choosing to adopt the appearance of Princess Astra, a person she encountered in a previous adventure (The Armageddon Factor). Many writers of spin-off media have attempted to rationalise the difference between the Doctor's and Romana's regenerations. Doctor Who television writer and script editor Eric Saward suggests in his 1985 novelisation of The Twin Dilemma (1984) that Time Lords can control the appearance of their next body if they trigger the regeneration voluntarily, but not if the regeneration is caused by death or injury. The Doctor Who Role Playing Game by FASA suggests that some Time Lords have a special ability to control their regenerations. The fan reference book The Discontinuity Guide suggests that Romana's various \"try-ons\" were projections of potential future incarnations like the K'anpo Rinpoche/Cho Je situation in Planet of the Spiders.[13] Miles and Wood's About Time also mentions this while theorising that the Time Lords had improved the technology of regeneration since the Doctor's time; Romana, being of a later generation than the Doctor, would therefore have finer control over the regenerative process in its early stages.[14]\n\nOther moments in the series suggest that other Time Lords have more control over their regeneration than that usually displayed by the Doctor. Prior to regenerating in the episode \"Utopia\" (2007), the Master expresses a desire to be \"young and strong\" like the Doctor and transforms accordingly. Subsequently, in \"Last of the Time Lords\", the Master is shot by Lucy Saxon and is able to prevent regeneration at will, despite the Doctor's pleas. In \"The Stolen Earth\" (2008), the Doctor begins to regenerate in a cliffhanger moment, but at the start of \"Journey's End\" (the following episode), he interrupts the process after healing his bodily injuries, redirecting the remaining regeneration energy into his preserved hand. In \"Let's Kill Hitler\", when Mels begins to regenerate into River Song, she says she is trying to concentrate so she can come out a particular dress size. In \"Nightmare in Silver\" (2013), the Eleventh Doctor suggests that he can trigger regeneration voluntarily, using the suggestion to threaten the Cyber-Planner invading his body and mind, saying \"I could regenerate now. Big blast of regeneration energy, burn out any little Cyber widgets in my brain, along with everything you're connected to. Don't want to. Use this me up, who knows what we'll get next? But I can.\" (Even though by The Time of the Doctor this was revealed to be a bluff due to the fact that the Eleventh Doctor was actually the final incarnation of his first regeneration cycle.) In \"The Girl Who Died\" (2015), the Twelfth Doctor speculates that he deliberately, if not subconsciously, chose the form of Caecilius (from \"The Fires of Pompeii\") to remind himself that he is a man who always saves people, even if it is just one. In \"The Doctor Falls\" (2017), the Doctor is wounded by Cybermen and starts to regenerate, but is able to hold back his regeneration, refusing to change again.\n\nIn \"Twice Upon a Time\" (2017), the Twelfth Doctor reveals that there is a period of time, what he calls \"a state of grace,\" when a regenerating Time Lord's current incarnation is restored to full health for a time if the incarnation resists regeneration. (This was previously seen when the Tenth Doctor's wounds healed at the onset of the regenerative process in The End of Time, and the aged Eleventh Doctor briefly reverting to a youthful form in The Time of the Doctor.) During this time, the incarnation must choose whether or not to regenerate. Once the period is over, if the Time Lord chooses not to regenerate, they will permanently die. Furthermore, as time passes during this \"state of grace,\" the Time Lord grows weaker as the period nears its end. The First, Tenth and Twelfth Doctors all used this period of time, though in the case of the Tenth Doctor it was to visit all of his former companions a final time before regenerating rather than out of some form of uncertainty. While in his \"state of grace,\" the First Doctor's face got \"mixed up\" due to his resisting regeneration, an effect not seen with his subsequent incarnations who used the period.\n\nRecognition of the regenerated [ edit ]\n\nThe television series is inconsistent on the question of whether Time Lords can recognise each other across regenerations. For example, in The Deadly Assassin an old classmate of the Doctor's, Runcible, is slow to recognise the Doctor in his fourth incarnation, and once he has, it then takes him a while to realise that his appearance has changed. However, in The Armageddon Factor (1978), Drax, another old classmate, recognises the Fourth Doctor immediately although they had not seen each other since the Academy (though the Doctor takes a while to remember Drax).\n\nThere is also inconsistency as to whether the Doctor can recognise his own future incarnations. In the original series, the Doctors usually have no difficulty recognising one another. In The Three Doctors, the First, Second, and Third Doctors all know one another on sight. However, in The Five Doctors, the First Doctor does not recognise the Fifth Doctor as himself and needs to be introduced by the Fifth as his fourth regeneration (though the Second and Third Doctor do recognize the Fifth Doctor immediately). In Time Crash, after the TARDIS is at different points in its own timeline merge due to downed shields, the Fifth Doctor spends much of the mini-episode believing that the Tenth was merely a fan who had somehow gotten into his TARDIS, having somehow altered the 'desktop theme'; the Tenth Doctor constantly tries to convince his younger self that he is his future self, only doing so by using a predestination paradox to cancel out a universe-destroying black hole with a supernova by blowing up the TARDIS. When the Tenth and the Eleventh Doctor meet each other in The Day of the Doctor, the Tenth Doctor appears to sceptically recognise his successor, yet he appears to be fully convinced only after both compare their respective sonic screwdrivers. The War Doctor, on the other hand, is initially completely oblivious to meet two of his future regenerations (initially mistaking them for future companions), again being convinced by their sonic screwdrivers. When the First Doctor meets the Twelfth Doctor, the First Doctor sees his future self as another Time Lord come to take back his TARDIS and requires convincing as to otherwise. The Day of the Doctor provides an explanation as to why the Doctors never fully remember their encounters with one another: when they are together, their individual timelines are \"out of sync\", so they can't retain knowledge about their other incarnations once they part.\n\nThe Daleks' ability to recognise the Doctor also varies: they recognise him outright in The Power of the Daleks but need confirmation from other sources in Revelation of the Daleks, \"Doomsday\" and \"The Pilot\". In \"Asylum of the Daleks\", the Daleks' knowledge of the Doctor is tied to a psychic link among them called the path-web, which is hacked to make them forget him. The Cybermen have their own method of recognising the Doctor, usually through his past incarnations, as seen in Earthshock and \"The Next Doctor\".\n\nIn \"Utopia\", while the Master was under the chameleon arch, the Doctor could not sense that he was a Time Lord. After the Master's personality reasserted itself, the Doctor instantly sensed him and could tell which Time Lord it was without being told. In \"The Sound of Drums\", the Doctor stated that he would be able to recognize the regenerated Master on sight despite having never seen his new incarnation, claiming that Time Lords could always recognize each other. Due to the Master's Archangel Network, the Doctor's ability to sense another Time Lord had been blocked up to that point. During \"The End of Time\", the Master and the Doctor could sense each other's presence when in proximity, with both appearing to sniff each other out. However, this ability has a limited range as stated by the Doctor to Wilfred Mott. While he could sense that the Master was still on Earth, he could not tell where he was as the Master was too far away to track precisely. In \"Dark Water\", The Doctor failed to recognize that Missy was a regeneration of The Master, and may not have been able to tell that she was a Time Lord at all until she revealed her identity to him (surprising the Doctor as the Master was now a women). In \"World Enough and Time\", the disguised Master figured out that Missy was his own future self, but this was due to deduction from her mannerisms rather than any sort of special ability. In turn, Missy did not realize that the disguised Master was another Time Lord, let alone her own past self until he revealed himself.\n\nIn \"Spyfall, Part 1\", the Thirteenth Doctor doesn't recognize the Master until he revealed his identity, then the Doctor realized that the Master was a man again.\n\nMaximum number of regenerations in a cycle [ edit ]\n\nIn The Deadly Assassin (1976), it is established that a Time Lord can only regenerate 12 times, for a total of 13 incarnations. This statement is later repeated in Mawdryn Undead (1983), the 1996 TV film and \"The Time of the Doctor\" (2013). This aspect became embedded in the public consciousness despite not often being repeated, and was recognised by producers of the show as a plot obstacle for when the show finally had to regenerate the Doctor a thirteenth time.[15][16] In the BBC Series 4 FAQ, writer Russell T Davies made a joke that[17] suggested that since the Time Lords were believed to be dead and their rules destroyed, the Doctor may be able to regenerate indefinitely: \"Now that his people are gone, who knows? Time Lords used to have thirteen lives.\"[18] In Death of the Doctor (a 2010 The Sarah Jane Adventures serial), the Eleventh Doctor says he can regenerate 507 times (early news reports, before the episode was broadcast, suggested he would say there is no limit to the number of regenerations).[18] However, writer Russell T Davies explained in an interview with SFX that this line was not intended to be taken seriously and insisted that the \"thirteen lives\" rule was too deeply entrenched in the viewer consciousness for his throwaway line to affect it.[19]\n\nHowever, the series has depicted exceptions to this rule in the career of the renegade Time Lord the Master. When the Master finds himself at the end of his regenerative cycle in The Keeper of Traken (1981), he takes possession of the body of another person to continue living, although he was using the Source of Traken to bind his mind to the body. In The Five Doctors (1983), the Master is offered a new cycle of regenerations by the High Council of the Time Lords in exchange for his help. In the 1996 television movie, the Master temporarily inhabits the body of a human, and attempts to take the Doctor's remaining regenerations. In \"The Sound of Drums\" (2007), the Master is revealed to have been granted a new body by the Time Lords during the Time War. In this new body, the Master appears to have a new regeneration cycle. The Master regenerates in \"Utopia\" (2007) and \"The Doctor Falls\" (2017) with dialogue in the latter episode suggesting he has at least one more regeneration.\n\nThe number of previous incarnations of the Doctor was at first unclear within the series. In the Fourth Doctor story The Brain of Morbius (1976), the Doctor participates in a mental 'duel' with another Time Lord and the machine to which their minds are connected begins to project the faces of the \"losing\" contestant's regenerations in chronologically descending order. As the Doctor is overpowered by Morbius, the images change successively to those of the third, second and first Doctors, then eight further faces appear. It was the intention of producer Philip Hinchcliffe and script editor Robert Holmes that images were even earlier incarnations of the Doctor.[citation needed][20] However, the narrative does not explicitly confirm that the faces do represent incarnations of the Doctor, even though, as the faces are shown, Morbius cries \"How far Doctor? How long have you lived?\", indicating that they are not incarnations of Morbius, but rather that it is the Doctor's past being shown.[21]\n\nIn other episodes, it was firmly established that the William Hartnell incarnation of the Doctor was the very first. In The Three Doctors, the Time Lord President describes the Hartnell incarnation as \"the earliest Doctor\". This is cemented in The Five Doctors when Peter Davison's Fifth Doctor (introducing himself to the First Doctor) says that he is the fourth regeneration, meaning that there have been five of him. The First Doctor also refers to himself as \"the original\". Episodes of the revival series showing the lives of the Doctor -- \"The Next Doctor\", \"The Eleventh Hour\", \"The Day of the Doctor\" and \"The Husbands of River Song\"—all begin with the William Hartnell incarnation. In \"Twice Upon a Time\", the William Hartnell incarnation is depicted as indeed being the very first incarnation with the First Doctor expressing fear about undergoing his very first regeneration throughout the story.\n\nIn \"The Lodger\", after the Eleventh Doctor shows Craig who he is, he points to his face and says, \"Eleventh\". However, in \"The Name of the Doctor\", when the Doctor rescues Clara from inside his own time stream, they both see another figure that Clara doesn't recognise. The Doctor then reveals that this is a past incarnation that he deemed unworthy of the name \"Doctor\" due to the atrocities he committed during the Time War, and only accepted him after learning the truth of how the war ended (\"The Day of the Doctor\").[22] Ultimately, in \"The Time of the Doctor\" the Eleventh Doctor reveals that, counting the War Doctor and the Tenth's aborted regeneration, he is actually in his final incarnation, reaching a point where he is dying of old age after centuries of conflict with the Daleks and others on the planet Trenzalore. However, at the behest of Clara, the Time Lords grant the Doctor a new regeneration cycle, allowing a thirteenth regeneration into an incarnation known as the Twelfth Doctor. The Twelfth Doctor is later able to regenerate into a female incarnation known as the Thirteenth Doctor after suffering fatal injuries during a battle.\n\nIn \"The Time of the Doctor\", the Eleventh Doctor describes his new regeneration ability as the start of a new 'cycle', implying that he's been restored to the customary twelve regenerations. However, in \"Kill the Moon\", the Twelfth Doctor says that he is \"not entirely sure [he] won't keep regenerating forever,\" once again raising the question regarding any limits to this ability. In \"Hell Bent\", Rassilon asks the Doctor \"How many regenerations did we grant you?\", and during \"The Doctor Falls\", two incarnations of the Master express uncertainty about how long it would take them to kill the Doctor, further implying that the Doctor has a finite number of regenerations even as the exact amount remains undetermined.\n\nIn \"The Timeless Children\", it is revealed that the Doctor is the Timeless Child, a being who predated the Time Lords and who can regenerate an unknown amount of times.\n\nTemporary potential future incarnations [ edit ]\n\nIn some cases, future potential incarnations can achieve independent, though temporary, existence. In Planet of the Spiders, a Time Lord, K'anpo Rinpoche, creates a corporeal projection of a future incarnation which has such an existence under the name Cho Je until he regenerates into that incarnation. The Valeyard, an \"amalgamation of the darker sides of [the Doctor's] nature, somewhere between [his] twelfth and final incarnation\", appears in The Trial of a Time Lord (1986) opposite the Sixth Doctor; the Valeyard is promised the remainder of the Doctor's regenerations. Another example is \"The Watcher\", who repeatedly appears to the Fourth Doctor in Logopolis (1981), and ultimately merges with him as part of his regeneration into his fifth incarnation.\n\nThe Time Lords' ability to change species during regeneration is referred to in the television movie by the Eighth Doctor in relation to the Master. Mavic Chen states that the First Doctor's resemblance to an Earth creature is \"only a disguise\" in The Daleks' Master Plan (1965). In Destiny of the Daleks (1979), the Fourth Doctor's Time Lady companion Romana demonstrates an apparent ability to \"try on\" different bodies from a number of different species during her regeneration, before settling on a final, humanoid form which physically resembles Princess Astra of Atrios.\n\nSteven Moffat said that reference would be made to Peter Capaldi's previous appearances in the Whoniverse during his tenure as the Twelfth Doctor: \"The face is not set from birth. It’s not like he was always going to be one day Peter Capaldi. We know that’s the case because in The War Games he has a choice of faces. So we know it’s not set, so where does he get those faces from? They can’t just be randomly generated because they've got lines. They've aged. When he turns into Peter he’ll actually have lines on his face. So where did that face come from?\"[citation needed] In \"Deep Breath\" (2014), the Doctor and several other characters speculate about where his new face came from, given that it has lines from frowning. The Doctor considers aloud that it is a face he recognises from somewhere, but due to post-regenerative trauma, he cannot place it. In \"The Girl Who Died\" (2015), he concludes that he subconsciously chose the face as a reminder of his decision to save the life of Caecilius (also played by Capaldi) in \"The Fires of Pompeii\" (2008) and to remind him to save people even with possible historical consequences by doing so.\n\nRegeneration of non-Gallifreyans [ edit ]\n\nThe fact that the Master is inhabiting a non-Gallifreyan body when he is offered a new cycle of regenerations (see above) implies that it is possible to grant them to a non-Gallifreyan, albeit one inhabited by a Time Lord mind. In addition, River Song is shown to have the ability to regenerate due to altered DNA that has similarities to Time Lord DNA, a side effect of having been conceived on board the TARDIS as it travelled through the spacetime vortex. Non-Gallifreyans are also seen to regenerate in Underworld (1978) and Mawdryn Undead (1983), but with adverse side effects. In Mawdryn Undead, these appear to be the result of mishandling stolen technology, but in Underworld they are implied to be the inevitable result of limited technology that reinvigorates, rather than transforms, the subject's appearance (in this case, the Minyans, with whom the Time Lords shared much of their technology), thereby regenerating 'the body, not the soul'.\n\nFailed/fake regeneration [ edit ]\n\nIt has been suggested in the series many times that regeneration is not guaranteed and can fail. After his cellular structure is decimated by the Metabelis crystals in Planet of the Spiders, the Third Doctor's regeneration requires \"a little push\" from fellow Time Lord K'anpo Rimpoche before it can proceed. As he succumbs to spectrox toxaemia in The Caves of Androzani, the Fifth Doctor says, \"I might regenerate... I don't know... It feels different this time.\" He then hallucinates, seeing his former companions encouraging him to survive, before the Master overwhelms them all, telling him he must die (the Doctor managed to regenerate anyway). The 1996 TV movie showed the Doctor's regeneration delayed for more than three hours, with the Eighth Doctor later remarking that the fact his Seventh incarnation was under anaesthesia at the time of his \"death\" could have \"destroyed the regenerative process\", and that he was \"dead too long this time\" prior to his regeneration. In many episodes, the Doctor doubts his own survival, though it is not always clear whether such statements refer to the death of only that particular incarnation. (The only time he makes a completely unambiguous distinction between these two scenarios – in \"The End of Time\" – he makes it clear that he regards regeneration as nearly as bad as death, because as he sees it, he dies and \"a new man\" walks away). In The Mind of Evil the Master points a conventional firearm at the Doctor and threatens to \"put a bullet through both [his] hearts,\" while in \"Forest of the Dead\", Professor Song warns that electrocution would stop both the Time Lord's hearts, killing him. In \"Turn Left\", in which the Tenth Doctor dies in a parallel world (he drowned without his future companion Donna Noble there to inspire him to leave), a UNIT member speculates that the Doctor's death must have been too quick to allow for regeneration. In \"The End of Time\", the Doctor explains to Wilfred Mott that if he is killed before the regeneration can start, then it will fail.\n\nIn the Series 6 premiere, \"The Impossible Astronaut\", a future version of the Eleventh Doctor is shot twice by the titular astronaut and begins to regenerate. However he is then shot again and dies, showing that not only can he be killed before regeneration, but also during the process (However, the later revelation, in \"The Wedding of River Song\" that what was shot was in fact a mechanical avatar of the Doctor and not the real person calls this into question). In the episode \"Let's Kill Hitler\", the Doctor is poisoned by River Song which disables the ability to regenerate and he seemingly dies, although he is later revived when River gives up her remaining regenerations to save him. \"The Time of the Doctor\" later shows that the Doctor did not have any remaining regenerations at this time anyway.\n\nIn the Doctor-lite episode \"The Girl Who Waited\", the Doctor stays put in the TARDIS, whilst his companion Rory searches for his wife Amy in the tourist planet Apalapucia, because of a fatal plague named Chen-7 that kills two hearted species, such as Apalapucians and Gallifreyans/Time Lords, with \"no regeneration\" in the Doctor's case.\n\nIn the mini-episode \"The Night of the Doctor\", the Eighth Doctor is killed when the ship he is on crashes onto the planet Karn, reinforcing the idea that a sudden, traumatic death may prevent regeneration. The Sisterhood of Karn explain that he was, in fact, dead, but they were able to use their Time Lord-based technology to revive him and force a regeneration anyway.\n\nIn \"Heaven Sent\", the Twelfth Doctor is badly burned by the Veil, preventing him from regenerating properly. However, as his island prison resets itself after leaving a room, he used what was left of his life to download a past version of himself out of the teleporter's hard drive, which also reset. This cycle of bringing himself back to life by burning his current body as energy for the process continued for approximately 4.5 billion years, according to the episode \"Hell Bent.\"\n\nIn \"The Lie of the Land\", the Twelfth Doctor fakes a regeneration after his companion Bill Potts shoots him after he pretends to be siding with the Monks. The bullets that are fired are revealed to have been blanks, and the whole thing was a test by the Doctor to see if Bill was under the Monks' influence.\n\nTransference of regenerative energy [ edit ]\n\nIn Mawdryn Undead, it is first stated that a Time Lord can transfer his regenerative life essence to another being. In that story, the Fifth Doctor is coerced by Mawdryn to give up his future regenerations in order to cure Nyssa and Tegan Jovanka from Mawdryn's disease. Although the transfer does not occur (due to the timely interference of Brigadier Lethbridge-Stewart), the Doctor states that the consequence of the transference would be that he would sacrifice his eight remaining lives and cease to be a Time Lord. It is not until \"Let's Kill Hitler\" that a similar transference is shown; in that instance, River Song sacrifices her own regenerative power in order to revive the dead Eleventh Doctor. The favour is returned in \"The Angels Take Manhattan\" in which River's wrist is repaired by the Doctor, who subsequently gives up a portion of his regenerative energy despite it later being revealed that the Doctor is out of regenerations at that point.\n\nA major plot point of the 1996 TV movie involves the Master scheming to steal the Doctor's remaining regenerations for himself.\n\nThe Tenth Doctor also consciously aborts a regeneration in \"Journey's End\" and instead transfers the energy to his previously severed hand (from \"The Christmas Invasion\"), which had been saved in a container by Captain Jack Harkness; when Donna Noble touches it, it creates an entirely new person - a \"meta-crisis\" half-human Doctor. The Eleventh Doctor confirms, before himself regenerating during the events of \"The Time of the Doctor\", that this action used up a full regeneration.\n\nIn \"The Witch's Familiar\", the Twelfth Doctor offers a small amount of regenerative energy to Dalek creator Davros to sustain him in his dying minutes a bit longer. The Doctor says that doing so \"may cost [him] an arm or a leg down the road\". Davros, however, siphons off much more regeneration energy from the Doctor to revitalize himself and transform the Daleks on Skaro into superior hybrid creatures. His plan backfires when decaying Daleks—incapable of dying, and kept in an underground 'sewer' system when their effective 'lives' have expired—are also reenergized and attack the Daleks on the surface. The Doctor reveals that he expected such a plot and knew it would backfire.\n\nRegenerations depicted in the series [ edit ]\n\nThe Doctor's regenerations [ edit ]\n\nThe Tenth Doctor's explosive regeneration into the Eleventh Doctor.\n\nThe First, War and Eleventh Doctors died from old age. All other incarnations were killed.\n\nRomana's regenerations [ edit ]\n\nRomana's tongue-in-cheek regeneration scene in Destiny of the Daleks (1979) contrasts markedly with the Doctor's transformations. In the first episode of the serial, Romana undergoes regeneration, in the process trying out several different forms before choosing to adopt the appearance of Princess Astra, a character she encountered in a previous adventure (The Armageddon Factor).\n\nMultiple attempts have been made in the spin-off media to explain the necessity for Romana's regeneration.\n\nThe Master's regenerations [ edit ]\n\nThe Master has only been shown to regenerate once onscreen. However, the Master does change appearance several times, often circumventing the limitations ordinarily placed upon Time Lords. Originally played by Roger Delgado, his decrepit later appearance (following Delgado's death) in The Deadly Assassin (1976) is explained as owing to the fact that he is in his final regeneration. He is driven to acquire a new regeneration cycle, but is ultimately able to circumvent the end of his life by possessing the body of Tremas (Antony Ainley) in The Keeper of Traken (1981). Ainley portrays the Master until the conclusion of the classic series, although still plots at several times to obtain a new regeneration cycle. In the 1996 TV movie, the Master is executed but cheats death by possessing a parasitic creature, which in turn possesses a human named Bruce (Eric Roberts), giving the Master another new form.\n\nWhen the Master is reintroduced in 2007, exposition explains he was resurrected by the Time Lords to fight in the Time War, apparently with a new regeneration cycle. In \"Utopia\" (2007), he is fatally shot by his assistant and changes from a form known as Professor Yana, played by Derek Jacobi, into a new incarnation, played by John Simm. Before regenerating, the Master expresses desire to become \"young and strong\" like the Tenth Doctor. A character named Missy first appears in \"Deep Breath\" (2014) before being revealed as the Master in \"Dark Water\" (2014), having regenerated off-screen during the character's absence. For most of Missy's appearances, it is unknown how the Master regenerated into her. It is later revealed in \"The Doctor Falls\" that it was Missy herself who forced the regeneration. In an effort to ensure that she would come into existence and stand with the Doctor, Missy stabbed the Master in the back to trigger his regeneration, but made the wound \"precise\" so that he would have time to reach his TARDIS before the regeneration began. In return, the Master killed Missy with his laser screwdriver and stated that he'd disabled her regeneration so that she would die permanently of the shot. Though the Master's regeneration into Missy was left inevitable, it was not shown on-screen. However, Missy was unsure if that particular incarnation would regenerate into her directly, being afflicted with memory loss resultant from the crossing of their respective timelines.\n\nIn several of the short stories published in the Doctor Who universe, some regenerations for the Master are seen including two separate reasons for the Roger Delgado incarnation's regeneration. In the short story Pandoric's Box, the Master is depicted as regenerating into Missy due to his battle with Rassilon who also regenerated as predicted by the Moment. However, this is contradicted by \"World Enough and Time\" and \"The Doctor Falls\".\n\nRiver Song's regenerations [ edit ]\n\nRiver Song, also known as Melody Pond has regenerated twice throughout the course of the sixth series. Although she is human and the daughter of Amy Pond (hence her surname) and Rory Williams, she was conceived on their wedding night aboard the TARDIS and therefore was born with genetic traits similar to the Doctor's own race, the Time Lords.\n\nIn \"Day of the Moon\" (2011), Melody Pond as a child (Sydney Wade) walks through a New York City alley at the end of the episode in early 1970, suffering from an unknown illness. When a vagrant asks of her condition, she explains that all is well, that she is dying, but she can fix it. She subsequently begins to regenerate in the style of the revived series as the vagrant flees, terrified.\n\nIn \"Let's Kill Hitler\", it is revealed that she regenerated into a toddler (Maya Glace-Green). This form later matured into Amy Pond's best friend, Mels (Nina Toussaint-White), who regenerated into her more widely known River Song (Alex Kingston) identity after being shot. In the aforementioned episode, post-regeneration, Melody is immune to a barrage of gunfire due to her surplus regenerative energy. In that same episode, River Song used all her remaining regeneration energy to revive the Doctor; as Amy put it \"You're safe now. Apparently you used all your remaining regenerations in one go. You shouldn't have done that.\" She was hospitalised as a result and now no-longer possesses the ability to regenerate. In \"The Husbands of River Song\", it is revealed that River possesses an augmented lifespan in her final incarnation, but it is never made clear if this is a side-effect of her part-Time Lord physiology or something she obtained from other means.\n\nOther regenerations [ edit ]\n\nIn \"Hell Bent\" (2015), while threatened with a gun, the General states to the Doctor that he is currently in his tenth regeneration. The Doctor then shoots him, causing him to regenerate from an old white man into a younger black woman. The General later states that her previous incarnation was her only one as a male.\n\nIn \"The Doctor's Daughter\" (2008), the Doctor's DNA is used to create the titular \"daughter\" Jenny (Georgia Tennant), who displays many but not all Time Lord traits. In the episode's close, she is shot in the chest and appears to die. However, long after the Doctor and his companions have departed, she miraculously resurrects and expels energy from her mouth which, ambiguously enough, both resembles regenerative energy and the energy emitted by a planet-restoring plot device in the same episode. The question as to whether this is a true regeneration is left unanswered, since Jenny does not change her appearance.\n\nIn \"The End of Time\" (2009/2010), the Master attacks the Lord President Rassilon with energy bolts, bringing Rassilon to his knees. By the time of his next appearance in \"Hell Bent\", Rassilon has regenerated into a much older incarnation. In the short story Pandoric's Box, it is confirmed that the Master's attack prompted this regeneration as predicted by the Moment.\n\nIn the premiere of the 2009 spin-off series K-9, the original K-9 Mark I (Leeson) is reintroduced and destroyed, but subsequently revealed to have been installed with a \"regeneration circuit\". At this point, the traditional K-9 model \"regenerates\" into a more sophisticated-looking CGI model.\n\nVisual effects [ edit ]\n\nEach new regeneration was also radically different from the previous one, even in terms of the visual effects used to represent the moment of regeneration. The very first regeneration was devised and executed by vision mixer Shirley Coward, who had rather unexpectedly come up with a method of achieving the effect electronically. The original plan of the production team was simply that William Hartnell would fall to the floor at the end of The Tenth Planet and pull his cape over his face. Troughton would then appear at the top of The Power of the Daleks, retracting the cloak. Coward's then-innovative vision mix necessitated that Troughton be hastily contracted for The Tenth Planet, part four. The series' first regeneration sequence was then duly recorded on 8 October 1966, with the cliffhanger resolution filmed two weeks later on 22 October. (REF: The Second Doctor Handbook) Older portrayals of regenerations were either a simple fade between two incarnations, a glowing effect that revealed the next incarnation, or one incarnation morphing into the next.\n\nEach subsequent regeneration was then filmed in a variety of different ways, as dictated by the director on that particular episode. Indeed, no two regenerations were particularly similar until the Russell T Davies era. Only BBC Wales Doctor Who attempted to standardise the way regeneration looked. Ever since \"The Parting of the Ways\" (2005), every regeneration has been portrayed as a \"golden glow explosion\" (although the colour of the explosion is fiery orange in \"The Parting of the Ways\" and is milky white in \"Utopia\"). Rose was the first to describe this type of regenerations, saying \"I saw him sort of explode, and then you replaced him\" to the Tenth Doctor immediately after the Ninth Doctor regenerated. Also, these regenerations are portrayed as violent discharges that could harm anyone nearby, to the point where the most powerful occurrences, seen in \"The End of Time\" and \"The Time of the Doctor\", were able to destroy the Tardis interior and send out a shockwave that destroyed a Dalek ship along with several troops respectively. Each time there was a regeneration with people nearby, either the Doctor or his companions had everyone present get away from the person who was regenerating to avoid them being harmed. In smaller discharges, regeneration was far less harmful and could be emitted from the hand in wisps of golden regeneration energy, which was capable of healing the injuries of others. The subsequent Children in Need special established that there was residual \"regeneration energy\" in a gaseous state after a transformation that had to be expelled through the mouth. This was seen again in \"The Christmas Invasion\", \"The Eleventh Hour\" and \"The Doctor's Daughter\" — though the latter narrative never made quite clear that Jenny actually regenerated. The Tenth Doctor was seen breathing out gaseous regeneration energy shortly after his transformation, as was the Eleventh Doctor. Consciously holding back the regeneration caused a buildup of energy that resulted in a powerful and violent explosive discharge of regeneration energy. Also, gaining a new cycle of regenerations and Time Lords lives being reset resulted in a shockwave and explosion of regeneration energy with the range of a thermonuclear explosion. Directed regeneration energy discharges could destroy anything in its path, even a Dalek Saucer, while the shock wave destroyed any Dalek troops in the vicinity. The actual regeneration of the Eleventh Doctor, following the wild outburst of regeneration energy that only reset his body, is the first time that the revived series differed from the established process of regeneration. When regenerating into the Twelfth Doctor, the process only includes a brief, mostly off-screen (due to the Doctor leaning back out of the camera) blast of energy.\n\nThis visual standardisation has allowed narratives to play around with regeneration. The mere presence of \"regeneration energy\" can now be used to heighten dramatic tension. This visual short cut, unavailable to production teams in the classic era, has been a particular favourite of Steven Moffat, who used the \"golden glow\" liberally throughout the 2011 series; in fact, unlike in the Russell T Davies era, in which nearly every regeneration had subtle differences, every Moffat era regeneration until \"The Time of the Doctor\" is nearly identical. Several of the 2011 episodes used that VFX in a way that wordlessly suggested regeneration.\n\nSee also [ edit ]\n\nNotes [ edit ]\n\n^ World Game (2005) and the upcoming audio series Beyond War Games (2022), allege that the Second Doctor did not regenerate at this time and had further adventures prior to his exile to Earth, including the events of The Five Doctors (1983). This has never been confirmed in the TV series. Various spinoff media, including the novel(2005) and the upcoming audio series(2022), allege that the Second Doctor did not regenerate at this time and had further adventures prior to his exile to Earth, including the events of(1983). This has never been confirmed in the TV series.", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://upload.wikimedia.org/wikipedia/en/thumb/5/5c/Symbol_template_class.svg/16px-Symbol_template_class.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/e/e7/Regeneration_4-5.gif", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e2/Symbol_portal_class.svg/16px-Symbol_portal_class.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/TARDIS-trans.png/50px-TARDIS-trans.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b9/10%27s_regeneration.jpg/220px-10%27s_regeneration.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/BBC_Logo_2021.svg/32px-BBC_Logo_2021.svg.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Regeneration_(Doctor_Who)", "title": "Regeneration (Doctor Who)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "viewport": "width=1000", "og": {"title": "Regeneration (Doctor Who) - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}