{"url": "https://web.archive.org/web/20220831140836/https://www.ktvb.com/article/entertainment/entertainment-tonight/complete-2017-coachella-party-guide-from-katy-perrys-easter-day-brunch-to-kylie-kendall-jenners/430430708", "text": "Celebs like Katy Perry, Kendall and Kylie Jenner and Vanessa Hudgens are known to swarm Indio, Calif. to take in the tunes and enjoy all the star-studded bashes and pop-ups that Palm Springs has to offer. In fact, ET has learned the \"Chained to the Rhythm\" songstress is throwing a soiree of her own this year.\n\nCoachella is not only one of the hottest music festivals of the year, it's also party central.\n\nCoachella is not only one of the hottest music festivals of the year, it's also party central.\n\nCelebs like Katy Perry, Kendall and Kylie Jenner and Vanessa Hudgens are known to swarm Indio, Calif. to take in the tunes and enjoy all the star-studded bashes and pop-ups that Palm Springs has to offer. In fact, ET has learned the \"Chained to the Rhythm\" songstress is throwing a soiree of her own this year.\n\nWhile certain events are invite or VIP-only, tons are open to the public. Check out ET's complete guide below for Coachella weekend one!\n\nFRIDAY, APRIL 14\n\nTHE SEPHORA EXPERIENCE\n\nWHEN: April 14 -16, 11:00am - 7:00pm (YES, all three days!)\n\nWHERE: On festival grounds\n\nWHAT TO EXPECT: In the past, this pop-up shop has offered complimentary perks/treatments to all festival goers with celebs of all sorts stopping by! Go freshen up your make-up or hair with a free sweet treat! And they'll be there weekend two, as well!\n\nOPEN TO THE PUBLIC? Yes!\n\n#HotelREVOLVE Pop-Up Shop\n\nWHEN: April 14 -16, 10:00am - 5:00pm\n\nWHERE: Arrive Hotel: 1551 N Palm Canyon Dr. Palm Springs, CA 92262\n\nWHAT TO EXPECT: Revolve clothing will take over Arrive Hotel to host an influential network of more than 30 of the world's best bloggers and performing artists. Influencers like Olivia Culpo, Aimee Song, A$AP FERG, Natasha Oakley and more are expected. The shop will feature exclusives by Lovers & Friends, For Love & Lemons, Beach Riot, House of Harlow 1960, Chiara Ferragni Collection, and more. You can also pick up a \"Festival V.I.P\" #REVOLVEbeauty kit featuring a curated selection of products from OUAI, ColourPOP and more. You might catch Nicole Richie and Alessandra Ambrosio here on Friday! Basically, this will be a fashion lover's dream stop!\n\nOPEN TO THE PUBLIC? Yes!\n\nAmerican Express Onsite Experience on the Coachella Grounds\n\nWHEN: April 14 -16, 10:00am - 5:00pm\n\nWHERE: On festival grounds\n\nWHAT TO EXPECT: This onsite experience will feature the first-of-its-kind, robot-powered, interactive video activation that allows visitors to star in and share their own mini music videos.\n\nOPEN TO THE PUBLIC? Yes!\n\nGalore x Grinder Queens of the Desert with CharliXCX\n\nWHEN: April 14, 1:00 – 5:00pm\n\nWHERE: The Galore Motel: 210 W. Stevens Rd. Palm Springs, CA 92202\n\nWHAT TO EXPECT: CharliXCX is the star of this bash! But attendees can also expect DJ sets from Orange is the New Black star Taryn Manning, Kylie Jenner's BFF Jordyn Woods, Alie Layus and Simihaze.\n\nOPEN TO THE PUBLIC? Invite only\n\nBUICK at Coachella's Special Wellness Day\n\nWHEN: April 14, 9:00am\n\nWHERE: Ace Hotel: 701 E Palm Canyon Dr., Palm Springs, CA 92264\n\nWHAT TO EXPECT: Harley Pasternak, trainer to celebs like Lady Gaga and Kanye West, will host a workout boot camp session and Q&A; followed by a 5-course lunch with celeb chef Bo O'Connor.\n\nOPEN TO THE PUBLIC? Invite Only\n\nCIROC 'Summer Colada' Take Over at Hard Rock Hotel\n\nWHEN: April 14 -16\n\nWHERE: Hard Rock Hotel Palm Springs\n\nWHAT TO EXPECT: Ciroc is transforming the Hard Rock Hotel Palm Springs into a swanky summer hotspot mixing old-school and new school hip hop. ET has learned Jhene Aiko is set to host a kick-off pool pool party event on Friday. Some of the starlets set to hit the hotel bash throughout the weekend include Lea Michele, Ashley Greene and Ashley Tisdale. And if we could guess – we should expect to see a mini High School Musical reunion as it's likely Vanessa Hudgens is also on the list.\n\nOPEN TO THE PUBLIC? Invite Only\n\nThe H.Wood Group presents: Blind Dragon Pop-Up Desert Experience\n\nWHEN: April 14, 2:00 – 6:00pm\n\nWHERE: Private estate in Vista Santa Rosa, CA\n\nWHAT TO EXPECT: The celeb guest list is under-wraps for this bash but Post Malone will be taking center stage for a performance. Celebs who are fans of Blind Dragon in LA include Kendall Jenner, Patrick Schwarzenegger and more!\n\nOPEN TO THE PUBLIC? Invite Only\n\nREPUBLIC RECORDS, SBE and HUDSON JEANS Present a Coachella Welcome BBQ\n\nWHEN: April 14, 3:00 – 6:00pm\n\nWHERE: Private estate\n\nWHAT TO EXPECT: This exclusive, private event will host a 150-person \"VVIP\" dinner with acoustic performances from Republic's class of 2017, including Hailee Steinfeld, Justine Skye, Post Malone and surprise guests. Guests will experience a curated menu from HYDE Sunset Kitchen + Cocktails and adult beverages inspired by the desert vibes of the Coachella landscape.\n\nOPEN TO THE PUBLIC? Invite Only\n\nPrettyLittleThing and Paper Magazine's Pretty Little Playground\n\nWHEN: April 14, 3:00 - 8:00pm\n\nWHERE: Private estate\n\nWHAT TO EXPECT: An evening of fab festival fashion good vibes, and a special TBD musical guest.\n\nOPEN TO THE PUBLIC? Invite Only\n\nNYLON'S Midnight Garde Party\n\nWHEN: April 14, 10:00pm – \"late\"\n\nWHERE: The NYLON Estate\n\nWHAT TO EXPECT: Special DJ sets by Virgil Abloh, Johnny Wujek, Markus Molinari and Ana Calderon. While NYLON likes to keep the guest list for this bash on the DL, celebs who have attended this soiree in the past include: Katy Perry, Leonardo DiCaprio, Skrillex and Kristen Stewart. Guests will be treated to a Batiste Dry Shampoo hairstyling station where beGlammed artists will give you a festival-inspired look. We're also told to expect a flower crown accessory station and made-to-order ice cream sandwiches provided by Coolhaus. Guests can also cool down with refreshing, specialty Johnnie & Soda cocktails, provided by Johnnie Walker in their exclusive 21+ lounge. VIP gift bags will feature the Guess brand's newest fragrance, GUESS 1981.\n\nOPEN TO THE PUBLIC? Invite Only\n\nVELOCITY BLACK x 1 OAK/Up & Down Beach Club\n\nWHEN: April 14, 2:00pm\n\nWHERE: Private estate\n\nWHAT TO EXPECT: Richie Akiva, known friend to Justin Bieber, Rihanna, Scott Disick, and P. Diddy will transform an elite mega-mansion, complete with its very own lake into a weekend long beach party. Velocity Black, a global membership club known for curating the most memorable experiences, is treating VIP guests to an epic day party with music by DJ Taco (of ODD Future) as partygoers beat the heat with cocktails by Absolut Elyx and food by CATCH LA. ET has learned the annual star-studded pop-up will also feature surprise performances.\n\nOPEN TO THE PUBLIC? Invite Only\n\nSATURDAY, APRIL 15\n\n8th Annual NEON CARNIVAL presented by The Levi's Brand with Tequila Don Julio\n\nWHEN: April 15, 10:00 pm – 4:00 am\n\nWHERE: Jacqueline Cochran Regional Airport: 56-850 Higgins Drive, Thermal, CA 92274\n\nWHAT TO EXPECT: This is Coachella's must star-studded and well-known event. Attendees can expect new games and amusement park rides. Batiste Dry Shampoo will host on-site hair styling stations and offer samples to attendees seeking a quick hair refresh. Showing up single? Tinder will pair you with a new match on their bumper car ride. VIPs can enjoy bottle service with specialty drinks provided by Tequila Don Julio -- we're also told all party-goers can cool off at a customized Bud Light station. While the guest list for this one won't be released until the day of the party, last year's guests included: Taylor Swift, Leonardo DiCaprio, Joe Jonas, Courtney Love, Derek Hough, Nina Dobrev, Jared Leto, Kyle Richards, Scott Disick and Scott Eastwood.\n\nOPEN TO THE PUBLIC? Invite only (Guests will need to present their special Neon Carnival wristbands and a one-of-a-kind Lokai for admittance.)\n\nAmerican Express Platinum House at The Parker Palm Springs\n\nWHEN: April 15-16, 11:00am – 5:00pm\n\nWHERE: The Parker Palm Springs\n\nWHAT TO EXPECT: Guests can enjoy SoulCycle classes (taught by trainer Stacey Griffith), custom flower crown and flash tattoo stations, hairstyling and an assortment of premium food and drinks. ET has learned Bebe Rexha will also be performing while Hannah Bronfman will handle DJ duties.\n\nOPEN TO THE PUBLIC? Open exclusively to platinum card members\n\nThe Lucky Lounge Presents: Desert Jam at The Ingleside Inn\n\nWHEN: April 15 -16, 12:00-6:00pm\n\nWHERE: Private estate in Palm Springs\n\nWHAT TO EXPECT: Noah Cyrus will be the belle of the ball at this bash -- she's slated to perform alongside a slew of \"friends.\" We'd love to see big sis Miley show up to support – perhaps with fiance' Liam Hemsworth?!\n\nOPEN TO THE PUBLIC? Invite only\n\nWINTER BUMBLELAND\n\nWHEN: April 15 -16, 1:00-6:00pm\n\nWHERE: Private estate in Palm Springs\n\nWHAT TO EXPECT: ET can confirm that Kendall and Kylie Jenner will host this soiree on Saturday while Ashley Graham will take over on Sunday.\n\nOPEN TO THE PUBLIC? Invite only\n\nThe Bootsy Bellows Estate with Chevy and PacSun\n\nWHEN: April 15, 2:00-6:00 PM\n\nWHERE: Private estate in Rancho Mirage, CA\n\nWHAT TO EXPECT: After Kendall and Kylie Jenner are done hosting Winter Bumbleland, both ladies are expected to show up to this shindig – after all, they do have their own PacSun line. Coachella queen Katy Perry is also slated to be there -- her BFF Marcus Molinari is a partner at the H.Wood Group. G Eazy is also on the list. We've heard Selena Gomez could also show up.\n\nOPEN TO THE PUBLIC? Invite only\n\nTopshop Topman Presents: The Escape at Korakia\n\nWHEN: April 15 -16, 12:00-5:00pm\n\nWHERE: Korakia Pension: 257 South Patencio Road, Palm Springs, 92262\n\nWHAT TO EXPECT: Topshop Topman will be curating a pop-up personal shopping experience around their exclusive festival edits. Each day guests can relax by the pool and enjoy Korakia massages and meditation sessions along with complimentary laser facials from Skin Laundry. Accessorize with some Kitchhair bands, cosmetic glitter and face jewelry by The Gypsy Shrine, floral head crowns from Miss Daisy jewelry from the Bauble Bar. Guests can sip some CoCo21, Dulce Vida Tequila, Banfi Wines, Chagit health shots and more. Saturday will feature a Mediterranean spread of tapas with candy from Sugarfina along with other snacks to nosh on while Sunday will feature a recovery brunch menu along with Sugarfina and Chagit.\n\nOPEN TO THE PUBLIC? Invite only\n\n#REVOLVEFestival\n\nWHEN: April 15 -16, 1:00-7:00pm\n\nWHERE: Revolve estate in La Quinta, CA\n\nWHAT TO EXPECT: The fashion e-tailer's 2nd annual star-studded bash will kick off Saturday with performances by Rick Ross followed by Migos on Sunday. A few of the confirmed celebs who have RSVP'd to this bash include Olivia Culpo, A$AP Ferg, Rocky Barnes, and Jasmine Sanders. Guests will be served Moët & Chandon Ice Imperial – the first champagne designed specifically to be enjoyed over ice.\n\nOPEN TO THE PUBLIC? Invite only\n\nREPUBLIC RECORDS, SBE and HUDSON JEANS Pool Party\n\nWHEN: April 15, 12:00 – 5:00pm\n\nWHERE: Private estate\n\nWHAT TO EXPECT: This private party will feature DJ sets, acoustic performances and appearances by several Republic artists including Joe Jonas, Giorgio Moroder and other \"major\" surprise guests. We're hoping Joe brings along brother Nick and/or Game of Thrones star Sophie Turner.\n\nOPEN TO THE PUBLIC? Invite Only\n\nSUNDAY, APRIL 16\n\nKaty Perry's Easter Day Brunch\n\nWHEN: April 16, 1:00-6:00pm\n\nWHERE: Private location in La Quinta, CA\n\nWHAT TO EXPECT: Katy Perry will host an Easter Sunday \"recovery\" brunch featuring an exclusive pop-up of her debut Katy Perry Footwear collection! Guests can re-fuel with vitamin elixirs, oxygen bars and reflexology massages, then keep the festivities going with a Cover Girl Easter egg hunt. DJ sets will be provided by Mia Moretti, Balthazar Getty & Bobby French.\n\nOPEN TO THE PUBLIC? Invite Only\n\nThe Happiest of Hours at Nylon Estate\n\nWHEN: Sunday April 16, 12:00pm\n\nWHERE: The NYLON estate\n\nWHAT TO EXPECT: A star-studded pool party to close out music's most celebrated festival weekend. Start the morning with some recovery and relaxation from Liquid IV packets and Health-Ade Kombucha. Float the day away in the pool on a FUNBOY float (one of Taylor Swift's favorites) while sipping on a crisp specialty Johnnie & Soda cocktail or indulge in a one-of-a-kind Johnnie Walker adult root beer float in their exclusive 21+ lounge.\n\nOPEN TO THE PUBLIC? Invite Only", "images": ["https://web.archive.org/web/20220831140836im_/https://media.ktvb.com/assets/KTVB/images/88763b2d-4bad-4458-a0fb-caa2136f8cdc/88763b2d-4bad-4458-a0fb-caa2136f8cdc_16x9.jpg", "https://web.archive.org/web/20220831140836im_/https://www.ktvb.com/article/entertainment/entertainment-tonight/complete-2017-coachella-party-guide-from-katy-perrys-easter-day-brunch-to-kylie-kendall-jenners/430430708", "https://web.archive.org/web/20220831140836im_/https://www.ktvb.com/assets/shared-images/weather-icons/wx-65_8x8.png", "https://web.archive.org/web/20220831140836im_/https://media.ktvb.com/assets/KTVB/images/7e8568fc-da66-4624-83ce-d0446465658b/7e8568fc-da66-4624-83ce-d0446465658b_16x9.jpg", "https://web.archive.org/web/20220831140836im_/https://www.ktvb.com/images/header/arrow.png", "https://web.archive.org/web/20220831140836im_/https://www.ktvb.com/assets/shared-images/backgrounds/blank.png", "https://web.archive.org/web/20220831140836im_/https://media.ktvb.com/assets/KTVB/images/07be314a-d452-4b10-a1f1-b5e04f8b6003/07be314a-d452-4b10-a1f1-b5e04f8b6003_16x9.jpg", "https://web.archive.org/web/20220831140836im_/https://www.ktvb.com/assets/shared-images/logos/ktvb.png", "https://web.archive.org/web/20220831140836im_/https://www.ktvb.com/assets/shared-images/icons/close-menu.svg", "https://web.archive.org/web/20220831140836im_/https://www.ktvb.com/assets/shared-images/icons/twitter.svg", "https://web.archive.org/web/20220831140836im_/https://www.ktvb.com/assets/shared-images/icons/facebook.svg", "https://web.archive.org/web/20220831140836im_/https://www.ktvb.com/assets/shared-images/weather-icons/wx-65_32x32.png", "https://web.archive.org/web/20220831140836im_/http://content.tegna-media.com/photo/2017/04/11/katy_perry_640_9205159_ver1.0.jpg", "https://web.archive.org/web/20220831140836im_/https://media.ktvb.com/assets/KTVB/images/e32576d6-84b1-4e73-8616-6182c9800b1b/e32576d6-84b1-4e73-8616-6182c9800b1b_16x9.jpg", "https://web.archive.org/web/20220831140836im_/https://www.ktvb.com/akam/13/pixel_4caeea35?a=dD0yMzAxOGUxNTI1ZTA2MGYxYjFmYTQ0MGUyMWVlMWQ0M2I4ODA4NTNiJmpzPW9mZg=="], "top_img": "https://web.archive.org/web/20220831140836im_/http://content.tegna-media.com/photo/2017/04/11/katy_perry_640_9205159_ver1.0.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20220831140836/https://www.ktvb.com/article/entertainment/entertainment-tonight/complete-2017-coachella-party-guide-from-katy-perrys-easter-day-brunch-to-kylie-kendall-jenners/277-430430708", "title": "Complete 2017 Coachella Party Guide: From Katy Perry's Easter Day Brunch to Kylie & Kendall Jenner's", "meta_data": {"theme-color": "#d81f32", "category": "entertainment", "og": {"url": "https://web.archive.org/web/20220831140836/https://www.ktvb.com/article/entertainment/entertainment-tonight/complete-2017-coachella-party-guide-from-katy-perrys-easter-day-brunch-to-kylie-kendall-jenners/277-430430708", "title": "Complete 2017 Coachella Party Guide: From Katy Perry's Easter Day Brunch to Kylie & Kendall Jenner's", "description": "Coachella is not only one of the hottest music festivals of the year, it's also party central.Celebs like Katy Perry, Kendall and Kylie Jenner and Vanessa Hudgens are known to swarm Indio, Calif. to take in the tunes and enjoy all the star-studded bashes and pop-ups that Palm Springs has to offer.  In fact, ET has learned the \"Chained to the Rhythm\" songstress is throwing a soiree of her own this year.", "type": "article", "image": {"identifier": "https://web.archive.org/web/20220831140836im_/http://content.tegna-media.com/photo/2017/04/11/katy_perry_640_9205159_ver1.0.jpg", "width": 1140, "height": 641}, "site_name": "ktvb.com", "locale": "en_US"}, "article": {"opinion": "false", "content_tier": "free", "section": "ktvb,entertainment,entertainment-tonight"}, "twitter": {"title": "Complete 2017 Coachella Party Guide: From Katy Perry's Easter Day Brunch to Kylie & Kendall Jenner's", "image": "https://web.archive.org/web/20220831140836im_/http://content.tegna-media.com/photo/2017/04/11/katy_perry_640_9205159_ver1.0.jpg", "card": "summary_large_image", "site": "KTVB", "description": "Coachella is not only one of the hottest music festivals of the year, it's also party central.Celebs like Katy Perry, Kendall and Kylie Jenner and Vanessa Hudgens are known to swarm Indio, Calif. to take in the tunes and enjoy all the star-studded bashes and pop-ups that Palm Springs has to offer.  In fact, ET has learned the \"Chained to the Rhythm\" songstress is throwing a soiree of her own this year.", "domain": "www.ktvb.com/"}, "viewport": "width=1170", "site": "ktvb.com", "description": "Coachella is not only one of the hottest music festivals of the year, it's also party central.Celebs like Katy Perry, Kendall and Kylie Jenner and Vanessa Hudgens are known to swarm Indio, Calif. to take in the tunes and enjoy all the star-studded bashes and pop-ups that Palm Springs has to offer.  In fact, ET has learned the \"Chained to the Rhythm\" songstress is throwing a soiree of her own this year.", "fb": {"app_id": 192179838029342}}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}