{"url": "https://deadline.com/2018/02/ryan-murphy-series-the-politician-netflix-ben-platt-cast-barbra-streisand-gwyneth-paltrow-in-talks-to-star-1202278255/", "text": "EXCLUSIVE: In a very competitive situation, Netflix has landed The Politician, a new hourlong comedy series from longtime collaborators Brad Falchuk, Ian Brennan and Ryan Murphy, I have learned. The project, starring Tony winner Ben Platt (Dear Evan Hansen), with Oscar winners Barbra Streisand and Gwyneth Paltrow in negotiations to co-star, has received a two-season straight-to-series order, I hear.\n\nPrimetime-Panic Your Complete Guide to Pilots and Straight-to-Series orders See All\n\nThe deal, believed to be the biggest TV package sale of the year, came after a weeklong bidding war among top streaming players, including Amazon and Hulu, sources said. It gives prolific creator-producer Murphy two series on Netflix, along with the upcoming Ratched.\n\nRESX/Shutterstock\n\nAs he does on all of his shows, Murphy will direct the pilot for The Politician, described as a one-hour comedy with social commentary. If Streisand and Paltrow’s deals close, Streisand will be part of the production team as well as directing, with Paltrow also expected to produce. It would be the first major TV series role for both feature actress.\n\nDetails about the plot and characters in The Politician are being kept under wraps, but according to a source close to the project, it revolves around the politician aspirations of Platt’s Payton, a wealthy Santa Barbarian, and every season will revolve around a different political race his character is involved in.\n\nRex/Shutterstock\n\nI hear that Platt will have musical numbers in several episodes of the show. That, along with the potential involvement of Paltrow and Streisand, helped drive interest in the project, sparking a heated bidding and leading to the big Netflix deal.\n\nFrequent collaborators Falchuk and Murphy had been quietly working on the script for The Politician for the past year. The two brought in their Glee co-creator Brennan, with the three expected to share co-creator credit. Platt also was attached early on and is heavily involved in the casting of the series, which eyes a potential late summer production start.\n\nThe project hails from Fox 21 TV Studios under Murphy’s overall deal at 20th Century Fox TV. Its packaging was guided by Fox TV Group chairman Dana Walden, a longtime Murphy collaborator who oversees the studio.\n\nPaltrow previously worked on Falchuk, Murphy and Brennan’s Glee. The actress, who is engaged to Falchuk, won an Emmy for her guest-starring role on Fox’s high school musical dramedy.\n\nThe deal for The Politician comes on the heels of the successful launch of Falchuk and Murphy’s latest collaboration, drama series 9-1-1 (co-created with Tim Minear), which has been a breakout hit for Fox and was renewed for a second season only two episodes into its freshman run. The Politician marks Murphy and Falchuk’s fourth television series as co-creators, joining 9-1-1 as well as FX’s American Horror Story and the upcoming Pose (co-created by Steven Canals). Murphy is also the mastermind behind FX’s American Crime Story and Feud as well as Netflix’s upcoming Ratched starring Emmy winner Sarah Paulson (AHS franchise, People v. O.J. Simpson) as a younger version of the diabolical Nurse Ratched from One Flew Over the Cuckoo’s Nest.\n\nNetflix\n\nNetflix has emerged as the streaming home of Murphy by snagging both of his series to hit the premium space in the past five months. The latest development is sure to further fuel speculation about the future of Murphy, one of the top creator-producers working in television today who has pulled off the rare feat of launching commercial and award-winning hits on both broadcast and cable. Netflix has been widely rumored to be among a slew of suitors for Murphy, whose current deal with 20th Century Fox TV expires later this year.\n\n“I haven’t made a decision of where I’m going to go, I’m going to sit back and wait,” Murphy said at TCA last month when asked whether he would stay at the studio, which is in the process of being acquired by Disney. A mega deal at merged Disney-Fox or a streaming giant like Netflix, a production venture, possibly with Walden, are just a few of many possibilities as the uber producer plots the next chapter in his career.\n\nPlatt is known for originating the role of the title character in the Broadway musical Dear Evan Hansen, which earned him the 2017 Tony Award for Best Actor in a Musical. His credits also include the role of Elder Arnold Cunningham in The Book of Mormon, as well as Benji Applebaum in the musical films Pitch Perfect and Pitch Perfect 2.", "images": ["https://deadline.com/wp-content/uploads/2018/02/murphyfalchukbrennan.jpg", "https://deadline.com/wp-content/uploads/2017/11/netflix-logo-print_cmyk.jpg", "https://deadline.com/wp-content/uploads/2018/02/ryan-murphy-ben-platt.jpg?w=630&h=383&crop=1", "https://deadline.com/wp-content/uploads/2018/02/barbra-streisand-gwynett-paltrow.jpg", "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://deadline.com/wp-content/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://deadline.com/wp-content/uploads/2018/02/ryan-murphy-ben-platt.jpg?w=630", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1"], "top_img": "https://deadline.com/wp-content/uploads/2018/02/ryan-murphy-ben-platt.jpg?w=630", "keywords": [], "authors": ["Nellie Andreeva"], "canonical_link": "https://deadline.com/2018/02/ryan-murphy-series-the-politician-netflix-ben-platt-cast-barbra-streisand-gwyneth-paltrow-in-talks-to-star-1202278255/", "title": "Netflix Nabs Ryan Murphy Series ‘The Politician’; Ben Platt Set, Barbra Streisand & Gwyneth Paltrow In Talks To Star", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "Netflix has nabbed 'The Politician', an hourlong comedy series from longtime collaborators Brad Falchuk, Ian Brennan and Ryan Murphy.", "news_keywords": "Barbra Streisand, Ben Platt, Brad Falchuck, Gwyneth Paltrow, Ian Brennan, Netflix, Ryan Murphy, The Politician", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=533209613", "generator": "WordPress 6.0.2", "author": "Nellie Andreeva", "theme-color": "#fff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Deadline", "application-name": "Deadline", "content_type": "Article", "post_id": 1202278255, "title": "Netflix Nabs Ryan Murphy Series 'The Politician'; Ben Platt Set, Barbra Streisand & Gwyneth Paltrow In Talks To Star", "published_at": "2018-02-05 08:05:41", "image": "https://deadline.com/wp-content/uploads/2018/02/ryan-murphy-ben-platt.jpg?w=296&h=166&crop=1", "comment_count": 38, "tags": "The Politician", "topics": "TV", "body": "EXCLUSIVE: In a very competitive situation, Netflix has landed The Politician, a new hourlong comedy series from longtime collaborators Brad Falchuk, Ian Brennan and Ryan Murphy, I have learned. The project, starring Tony winner Ben Platt (Dear Evan Hansen), with Oscar winners Barbra Streisand and Gwyneth Paltrow in negotiations to co-star, has received a two-season straight-to-series order, I hear.\r\n\r\nThe deal, believed to be the biggest TV package sale of the year, came after a weeklong bidding war among top streaming players, including Amazon and Hulu, sources said. It gives prolific creator-producer Murphy two series on Netflix, along with the upcoming Ratched.\r\n\r\n\r\n\r\nAs he does on all of his shows, Murphy will direct the pilot for The Politician, described as a one-hour comedy with social commentary. If Streisand and Paltrow's deals close, Streisand will be part of the production team as well as directing, with Paltrow also expected to produce. It would be the first major TV series role for both feature actress.\r\n\r\nDetails about the plot and characters in The Politician are being kept under wraps, but according to a source close to the project, it revolves around the politician aspirations of Platt’s Payton, a wealthy Santa Barbarian, and every season will revolve around a different political race his character is involved in.\r\n\r\n\r\n\r\nI hear that Platt will have musical numbers in several episodes of the show. That, along with the potential involvement of Paltrow and Streisand, helped drive interest in the project, sparking a heated bidding and leading to the big Netflix deal.\r\n\r\nFrequent collaborators Falchuk and Murphy had been quietly working on the script for The Politician for the past year. The two brought in their Glee co-creator Brennan, with the three expected to share co-creator credit. Platt also was attached early on and is heavily involved in the casting of the series, which eyes a potential late summer production start.\r\n\r\nThe project hails from Fox 21 TV Studios under Murphy's overall deal at 20th Century Fox TV. Its packaging was guided by Fox TV Group chairman Dana Walden, a longtime Murphy collaborator who oversees the studio.\r\n\r\nPaltrow previously worked on Falchuk, Murphy and Brennan’s Glee. The actress, who is engaged to Falchuk, won an Emmy for her guest-starring role on Fox's high school musical dramedy.\r\n\r\nThe deal for The Politician comes on the heels of the successful launch of Falchuk and Murphy's latest collaboration, drama series 9-1-1 (co-created with Tim Minear), which has been a breakout hit for Fox and was renewed for a second season only two episodes into its freshman run. The Politician marks Murphy and Falchuk's fourth television series as co-creators, joining 9-1-1 as well as FX's American Horror Story and the upcoming Pose (co-created by Steven Canals). Murphy is also the mastermind behind FX's American Crime Story and Feud as well as Netflix’s upcoming Ratched starring Emmy winner Sarah Paulson (AHS franchise, People v. O.J. Simpson) as a younger version of the diabolical Nurse Ratched from One Flew Over the Cuckoo’s Nest.\r\n\r\n\r\n\r\nNetflix has emerged as the streaming home of Murphy by snagging both of his series to hit the premium space in the past five months. The latest development is sure to further fuel speculation about the future of Murphy, one of the top creator-producers working in television today who has pulled off the rare feat of launching commercial and award-winning hits on both broadcast and cable. Netflix has been widely rumored to be among a slew of suitors for Murphy, whose current deal with 20th Century Fox TV expires later this year.\r\n\r\n“I haven’t made a decision of where I’m going to go, I’m going to sit back and wait,” Murphy said at TCA last month when asked whether he would stay at the studio, which is in the process of being acquired by Disney. A mega deal at merged Disney-Fox or a streaming giant like Netflix, a production venture, possibly with Walden, are just a few of many possibilities as the uber producer plots the next chapter in his career.\r\n\r\nPlatt is known for originating the role of the title character in the Broadway musical Dear Evan Hansen, which earned him the 2017 Tony Award for Best Actor in a Musical. His credits also include the role of Elder Arnold Cunningham in The Book of Mormon, as well as Benji Applebaum in the musical films Pitch Perfect and Pitch Perfect 2.", "fb": {"pages": 105558754896}, "onesignal": "wordpress-plugin", "fragment": "!", "og": {"type": "article", "title": "Netflix Nabs Ryan Murphy Series ‘The Politician’; Ben Platt Set, Barbra Streisand & Gwyneth Paltrow In Talks To Star", "url": "https://deadline.com/2018/02/ryan-murphy-series-the-politician-netflix-ben-platt-cast-barbra-streisand-gwyneth-paltrow-in-talks-to-star-1202278255/", "description": "EXCLUSIVE: In a very competitive situation, Netflix has landed The Politician, a new hourlong comedy series from longtime collaborators Brad Falchuk, Ian Brennan and Ryan Murphy, I have learned. Th…", "site_name": "Deadline", "image": {"identifier": "https://deadline.com/wp-content/uploads/2018/02/ryan-murphy-ben-platt.jpg?w=630", "width": 630, "height": 423, "alt": "Ryan Murphy Ben Platt"}, "locale": "en_US"}, "article": {"published_time": "2018-02-05T16:05:41+00:00", "modified_time": "2018-02-06T00:16:46+00:00"}, "twitter": {"site": "@DEADLINE", "creator": "@DeadlineNellie", "card": "summary_large_image", "title": "Netflix Nabs Ryan Murphy Series ‘The Politician’; Ben Platt Set, Barbra Streisand & Gwyneth Paltrow In Talks To Star", "description": "Netflix has nabbed 'The Politician', an hourlong comedy series from longtime collaborators Brad Falchuk, Ian Brennan and Ryan Murphy.", "image": "https://deadline.com/wp-content/uploads/2018/02/ryan-murphy-ben-platt.jpg?w=630"}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1517846741.0, "source": "https://deadline.com", "summary": ""}