{"url": "https://www.hollywoodreporter.com/news/logan-paul-speaks-suicide-video-im-a-good-guy-who-made-a-bad-decision-1080866", "text": "“I’m a good guy who made a bad decision,” Logan Paul admitted Thursday during his first public interview since he posted a video in Japan’s so-called Suicide Forest that generated a significant backlash.\n\nThe actor and YouTube star sat down with Good Morning America‘s Michael Strahan for a wide-ranging interview about his decision in late December to publish a video showing a suicide victim. After he was criticized for the post, he issued two apologies before taking a step back from his public persona. Last week, he released his first video in nearly a month and used it to talk about suicide prevention.\n\n“The idea was to just do another fun blog, go camp for a night and make another entertaining piece of content in a forest,” Paul explained to Strahan. “Things obviously changed pretty drastically and quickly.”\n\nPaul’s original Dec. 31 video, which he took down within a day, blurred the face of the suicide victim that he and his friends found in the woods. But many people pushed back on how he reacted to the discovery and his decision to ultimately post the video. “I believe it happened for a reason,” Paul said in the interview that aired Thursday. “I think that reason is so I could take this experience, learn from it, spread the message — the right way — about suicide prevention and suicide prevention awareness.”\n\nPaul also revealed that he’s been receiving death threats. “It’s been tough because, ironically, I’m being told to commit suicide myself,” he said. “Millions of people literally telling me they hate me, to go die in a fire.”\n\nWhen Strahan asked whether Paul feels like the criticism has been fair, he responded, “That’s the thing. I do.”\n\nAlthough Paul’s fans — he has 16 million YouTube subscribers — have largely supported him over the last month, many in the YouTube community have spoken out against him. And YouTube ultimately decided to remove Paul from its premium advertising program, Google Preferred. It also has indefinitely suspended its projects with Paul, including a sequel to his hit YouTube Red movie The Thinning and has said he will not appear on the new season of comedy series Foursome. Executives have said that they will give him an opportunity to learn from his mistakes.\n\n“I understand that they needed to take a stance,” Paul said of YouTube’s actions. “While I don’t necessarily maybe agree with it, I do respect it.”\n\nStrahan asked whether the decision has hurt Paul financially. “Want to know the real answer? It hurts, but it’s not like I’m drowning,” he said. “I try not to live my life thinking about money, because money doesn’t make me happy. Creating and making other people happy makes me happy.”", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/02/logan_paul_gma_2_0.jpg?w=928"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/02/logan_paul_gma_2_0.jpg?w=928", "keywords": [], "authors": ["Natalie Jarvey"], "canonical_link": "https://www.hollywoodreporter.com/news/general-news/logan-paul-speaks-suicide-video-im-a-good-guy-who-made-a-bad-decision-1080866/", "title": "Logan Paul Speaks Out About Suicide Video: “I’m a Good Guy Who Made a Bad Decision”", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The YouTube star sat down with 'Good Morning America's' Michael Strahan for his first interview since a backlash erupted over his video in Japan's suicide forest.", "news_keywords": "Good Morning America, Michael Strahan, YouTube", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Natalie Jarvey", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1080866, "title": "Logan Paul Speaks Out About Suicide Video: \"I'm a Good Guy Who Made a Bad Decision\"", "published_at": "2018-02-01 07:57:59", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/02/logan_paul_gma_2_0.jpg?w=928", "comment_count": 0, "tags": "YouTube", "topics": "News", "body": "\"I'm a good guy who made a bad decision,\" Logan Paul admitted Thursday during his first public interview since he posted a video in Japan's so-called Suicide Forest that generated a significant backlash. \r\nThe actor and YouTube star sat down with Good Morning America's Michael Strahan for a wide-ranging interview about his decision in late December to publish a video showing a suicide victim. After he was criticized for the post, he issued two apologies before taking a step back from his public persona. Last week, he released his first video in nearly a month and used it to talk about suicide prevention. \r\n\"The idea was to just do another fun blog, go camp for a night and make another entertaining piece of content in a forest,\" Paul explained to Strahan. \"Things obviously changed pretty drastically and quickly.\" \r\nPaul's original Dec. 31 video, which he took down within a day, blurred the face of the suicide victim that he and his friends found in the woods. But many people pushed back on how he reacted to the discovery and his decision to ultimately post the video. \"I believe it happened for a reason,\" Paul said in the interview that aired Thursday. \"I think that reason is so I could take this experience, learn from it, spread the message — the right way — about suicide prevention and suicide prevention awareness.\"\r\n\r\nPaul also revealed that he's been receiving death threats. \"It's been tough because, ironically, I'm being told to commit suicide myself,\" he said. \"Millions of people literally telling me they hate me, to go die in a fire.\"\r\nWhen Strahan asked whether Paul feels like the criticism has been fair, he responded, \"That's the thing. I do.\"\r\nAlthough Paul's fans — he has 16 million YouTube subscribers — have largely supported him over the last month, many in the YouTube community have spoken out against him. And YouTube ultimately decided to remove Paul from its premium advertising program, Google Preferred. It also has indefinitely suspended its projects with Paul, including a sequel to his hit YouTube Red movie The Thinning and has said he will not appear on the new season of comedy series Foursome. Executives have said that they will give him an opportunity to learn from his mistakes. \r\n\r\n\"I understand that they needed to take a stance,\" Paul said of YouTube's actions. \"While I don't necessarily maybe agree with it, I do respect it.\" \r\nStrahan asked whether the decision has hurt Paul financially. \"Want to know the real answer? It hurts, but it's not like I'm drowning,\" he said. \"I try not to live my life thinking about money, because money doesn't make me happy. Creating and making other people happy makes me happy.\"", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Logan Paul Speaks Out About Suicide Video: “I’m a Good Guy Who Made a Bad Decision”", "url": "https://www.hollywoodreporter.com/news/general-news/logan-paul-speaks-suicide-video-im-a-good-guy-who-made-a-bad-decision-1080866/", "description": "The YouTube star sat down with ‘Good Morning America’s’ Michael Strahan for his first interview since a backlash erupted over his video in Japan’s suicide forest.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/02/logan_paul_gma_2_0.jpg?w=928", "width": 928, "height": 523}, "locale": "en_US"}, "article": {"published_time": "2018-02-01T07:57:59+00:00", "modified_time": "2018-02-01T11:17:03+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Logan Paul Speaks Out About Suicide Video: “I’m a Good Guy Who Made a Bad Decision”", "description": "The YouTube star sat down with ‘Good Morning America’s’ Michael Strahan for his first interview since a backlash erupted over his video in Japan’s suicide forest.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/02/logan_paul_gma_2_0.jpg?w=928"}}, "movies": [], "publish_date": 1517471879.0, "source": "https://www.hollywoodreporter.com", "summary": ""}