{"url": "https://www.usmagazine.com/entertainment/news/vanderpump-rules-stassi-schroeder-cries-about-her-ex-w458354/", "text": "And they’re off! On the Monday, January 2, episode of Vanderpump Rules, Lisa Vanderpump found herself with an empty restaurant as the cast traveled to different corners of the country for rival birthday celebrations.\n\nAll Aboard the Sonoma Express\n\nAriana Madix and the gang headed off to Northern California for a no-frills birthday bash at a Nascar race. Ariana and her boyfriend, Tom Sandoval, invited Tom Schwartz, Jax Taylor, Brittany Cartwright and Lala Kent to join them for a rowdy weekend of partying — but Lala was a no-show. She sent Ariana a text message to apologize for bailing last minute, but her sudden decision to ditch the trip raised a few eyebrows.\n\n“I never thought Lala would teach me anything in this world, but I was wrong,” Jax declared. “Turns out, you can flake on your friends, and all you have to do is write ‘I’m sorry, boo’ in a text message, and all is forgiven.”\n\nIn an effort to keep Lala’s flakiness from ruining the weekend, Tom Sandoval surprised the rest of the group by rolling up in an RV (“A redneck’s dream!” Kentucky native Brittany exclaimed). The crew dubbed the camper the “Sonoma Express” and excitedly piled into the RV, letting Tom stay behind the wheel. But before Tom could even make it out of the parking lot, he somehow managed to completely scrape the sides of the RV.\n\n“The Sonoma Express does not stop for cosmetic damage,” Schwartz declared, brushing off Tom Sandoval’s minor bump. “Full steam ahead!”\n\nSexless in Sonoma\n\nThe first stop on the Sonoma Express? A winery.\n\nAlthough Jax would’ve preferred a “vodka vineyard,” Ariana arranged for the gang to experience a highbrow wine tasting. Their afternoon of sipping merlot proved to be pretty uneventful (other than Ariana gulping down a glass of disgusting wine backwash after losing a bet). But the real drunken adventures began once the crew arrived to Nascar territory.\n\nAfter setting up their campsite, the boys and girls split off. Brittany and Ariana stayed inside the camper and downed a bottle of tequila while the guys sat around outside for some bro talk. A heavily intoxicated Tom Sandoval started complaining about never having sex with Ariana anymore. “I need to have sex!” drunk Tom shouted. “I want to have sex!”\n\nThe conversation quickly turned emotional when Jax revealed that he’s worried he will end up sabotaging his own relationship with Brittany. “It’s never going to get better than [Brittany],” Jax insisted. “But oh, what do I do? I have to f–k this up somehow because that’s what Jax does.”\n\nBut when Brittany and Ariana stumbled out of the camper, clearly ready to enjoy their weekend with their boos (and, of course, eat half-cooked steak with their hands), the boys pushed their worries aside.\n\nStassi Strikes Out\n\nFor the big 2-8, Stassi Schroeder and the girls jetted to Montauk for a beach getaway. Like a true L.A. transplant, Kristen Doute had a difficult time getting hyped for the Hamptons. “I do nothing all the time, so I don’t really get the appeal,” she stated.\n\nScheana Shay decided to join Stassi for her birthday, despite being on rocky terms with the rest of the group. Scheana told the cameras that she hoped the ladies’ attitudes would stay as sunny and beautiful as the Montauk weather — but she ironically adopted a sourpuss attitude of her own. Scheana refused to kick off the trip with a drink because she didn’t have the “right straw” and even turned down a celebratory shot at dinner.\n\nStassi was visibly annoyed with Scheana. But as the drinks continued to pour, Stassi’s focus shifted away from Scheana’s negativity and onto her failed relationship with ex-boyfriend, Patrick Meagher. Stassi broke down in tears as she condemned her newly single status. She told the cameras that she felt self-conscious being surrounded by a group that included a married friend (Scheana), an engaged friend (Katie Maloney) and a friend who’s in a “90 percent perfect” relationship (Kristen).\n\n“Happy birthday to me,” Stassi flatly remarked.\n\nWhile out for dinner, none of the younger Montauk men seemed to pique Stassi’s interest. But it turned out Stassi was quite the hit among the older Hamptons crowd. Silver foxes made their way up to the bar to chat up Stassi; however, the birthday girl wasn’t having it.\n\n“Gray pubes? Nah, I can’t!” Stassi proclaimed. Womp, womp. Luckily Stassi was able to find a temporary cure for her relationship blues: skinny-dipping in a (very public) body of water.\n\nLisa Looks Into Lala’s Relationship\n\nLisa may have fired James Kennedy from Sur, but she’s constantly running into the DJ, thanks to his friendship with her son, Max.\n\n“I fired James from Sur, but I unfortunately can’t fire him from being friends with my son,” Lisa quipped.\n\nThe Real Housewives star walked into the restaurant one evening to find James hanging out in the kitchen with Max. Curious about Lala and her mysterious disappearance, Lisa decided to strike up a conversation with James and asked him why Lala ditched Ariana.\n\n“The only thing I can think of is her boyfriend.” James told her. “If she’s told not to go to Sonoma, that could’ve been two minutes before the plane [took off], and she wouldn’t have boarded it. She’s completely wrapped around this guy’s finger.”\n\nJames expressed concern for Lala, telling Lisa that he believed the hostess was in a controlling relationship. Lisa was deeply troubled by Lala’s situation.\n\n“I don’t know if she’s dating a married man or not, but she’s dating somebody that’s shrouded in mystery. She’s not allowed to speak his name out loud,” Lisa said. “I think Lala really deserves a little bit better than that.”\n\nTell Us: Will Lala salvage things with Ariana after missing the trip?\n\nVanderpump Rules airs on Bravo Mondays at 9 p.m. ET.", "images": ["https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/bg-subscribe.png", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered-green.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/placeholders/default-usweekly.svg", "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/backup/pump-main-ed313e64-ed03-489c-b059-db0eac6fe07c.jpg?crop=1px%2C75px%2C1999px%2C1049px&resize=1200%2C630&ssl=1&quality=86&strip=all", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/shop-with-us-new.png", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/placeholders/default-usweekly-square.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered.svg"], "top_img": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/backup/pump-main-ed313e64-ed03-489c-b059-db0eac6fe07c.jpg?crop=1px%2C75px%2C1999px%2C1049px&resize=1200%2C630&ssl=1&quality=86&strip=all", "keywords": [], "authors": ["Us Weekly Staff", "Maria Fischer"], "canonical_link": "https://www.usmagazine.com/entertainment/news/vanderpump-rules-stassi-schroeder-cries-about-her-ex-w458354/", "title": "'Vanderpump Rules': Stassi Schroeder Cries About Her Ex", "meta_data": {"viewport": "width=device-width, initial-scale=1", "ir-site-verification-token": "-206090124", "fo-verify": "49e6fc6a-c68d-447f-9978-70e3eac455ac", "post-format": "video", "post-cats": "Entertainment", "theme-color": "#fff", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Stassi Schroeder broke down in tears about her love life during her birthday trip on Vanderpump Rules' Monday, January 1, episode — read Us Weekly's recap", "og": {"locale": "en_US", "type": "article", "title": "'Pump Rules': Stassi Cries About Her Ex, Lala Ditches Ariana's Birthday", "description": "Stassi Schroeder broke down in tears about her love life during her birthday trip on Vanderpump Rules' Monday, January 1, episode — read Us Weekly's recap", "url": "https://www.usmagazine.com/entertainment/news/vanderpump-rules-stassi-schroeder-cries-about-her-ex-w458354/", "site_name": "Us Weekly", "updated_time": "2017-10-15T20:17:32+00:00", "image": {"identifier": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/backup/pump-main-ed313e64-ed03-489c-b059-db0eac6fe07c.jpg?crop=1px%2C75px%2C1999px%2C1049px&resize=1200%2C630&ssl=1&quality=86&strip=all", "secure_url": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/backup/pump-main-ed313e64-ed03-489c-b059-db0eac6fe07c.jpg?crop=1px%2C75px%2C1999px%2C1049px&resize=1200%2C630&ssl=1&quality=86&strip=all", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/UsWeekly", "published_time": "2017-01-03T05:03:00+00:00", "modified_time": "2017-10-15T20:17:32+00:00"}, "author": "Us Weekly Staff", "twitter": {"card": "summary_large_image", "title": "'Pump Rules': Stassi Cries About Her Ex, Lala Ditches Ariana's Birthday", "description": "Stassi Schroeder broke down in tears about her love life during her birthday trip on Vanderpump Rules' Monday, January 1, episode — read Us Weekly's recap", "image": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/backup/pump-main-ed313e64-ed03-489c-b059-db0eac6fe07c.jpg?crop=1px%2C75px%2C1999px%2C1049px&resize=1200%2C630&ssl=1&quality=86&strip=all", "creator": "@usweekly", "site": "@usweekly"}, "spons": "no", "tragedy": "off", "generator": "WordPress 6.0.2", "msapplication-TileImage": "https://www.usmagazine.com/wp-content/uploads/2020/05/cropped-us-logo.png?w=270&quality=86&strip=all"}, "movies": [], "publish_date": 1483419780.0, "source": "https://www.usmagazine.com", "summary": ""}