{"url": "fortune.com/2018/07/13/meghan-markle-aritzia-earnings/", "text": "Women’s clothing brand Aritzia reported record earnings this past quarter, and already, company executives and analysts are crediting the Canadian label’s recent success to a former Toronto resident: Meghan Markle.\n\nFor the first quarter, the Vancouver-based company’s net income jumped by 51.2% to $12.3 million, up from $8.1 million in Q1 the previous year. During the earnings conference call with company executives on Wednesday, CEO Brian Hill elaborated on the brand’s relationship with Markle—specifically, with her stylists—hinting the newly-minted Duchess of Sussex is not only influencing consumers but even members of the Royal Family.\n\nIn the first quarter we secured media placements in top tier outlets and continued to address a number of VIPs and leading celebrities. As a result of our relationship with Meghan Markle stylists who wore beautiful Babaton Trench in April, this subsequently sold out in six hours. By all accounts Meghan remains a huge fan of Aritzia. It seems Meghan’s fashion sense is influencing the royal family as well. Princess Beatrice was recently photographed wearing one of our leather biker jackets.\n\nWhile Aritzia’s balance sheet for the first quarter is a success, and Markle’s appearances in their clothes and accessories probably did help, it would be foolhardy to expect this to recur every quarter—either for Aritzia or any other brand the American former actress happens to wear in the future.\n\nNow, it is very likely that Markle will appear in Aritzia products in the future. As mentioned, Markle lived in Toronto for years while filming the long-running USA Network drama Suits, and brand nationality and representation means a lot for celebrities—and double for royals and foreign dignitaries. (It’s an unofficial courtesy rule—at least for women, for better or worse—to wear brands based either in the country where one is from or the country where one is visiting, in a public nod. First Lady Melania Trump, for instance, prepared for her and President Trump’s arrival in the U.K. this week by wearing Burberry’s signature tan trench coat.)\n\nAnd, similar to Kate Middleton with Alexander McQueen, Erdem, and Jenny Packham (among other—mostly British—designers), Markle and her style team clearly have go-to designers and brands on speed dial. Markle has already demonstrated this by wearing Givenchy in public nearly every week since her Windsor Castle wedding to Prince Harry in May, when she wore a bateaux-neckline white gown by British-born designer Clare Waight Keller, the artistic director of the French fashion house beloved by Audrey Hepburn. Markle has also repeatedly worn items by Roland Mouret, Self Portrait, and Stella McCartney, accompanied by a number of handbags from Strathberry and shoes by Sarah Flint.\n\nHowever, Markle has really only worn Aritzia less than handful of times in the last six months, including this cabernet-tinged leather jacket at the Invictus Games in Toronto last summer, a military green-hued trench coat at trials for the next Invictus Games this past spring, and a black belt for a few other public events in the weeks leading up to her wedding.\n\nKarwai Tang—WireImage\n\nCertainly, compared to custom dresses from Givenchy and Mulberry handbags, Aritzia’s products are some of the most affordable that consumers can buy to replicate Markle’s wardrobe. The high-cost of Markle’s wardrobe has generated headlines in the last few weeks, with some estimates touching the low millions. (It should be noted that members of the Royal Family cannot accept clothing for free, like Hollywood celebrities often do. Royals are required to pay out of their own funds, but Markle came into the marriage with a sizable bank of account of her own given her successful TV career.)\n\nMarkle has worn some more mainstream (or high street, in British parlance) brands, with items from J. Crew and, possibly most notably, Everlane. While Aritzia’s executives might be quick to thank Markle, J. Crew certainly hasn’t seen a similar boost from Markle—or other customers—over the last few quarters.\n\nAs for Everlane, Markle’s use of the San Francisco-based company’s cognac Day Market Tote at last summer’s Invictus Games still generates stories. And yes, it did sell out after Markle was photographed with it. But Everlane—which targets a young, female, mostly millennial audience like Aritzia—already has a substantial cult following through its social channels and pop-up stores around the country. It routinely sells out a variety of products, from flats to t-shirts to “packable” backpacks, much to the chagrin of its customer base from time to time. Recently restocked, even if the Day Market Tote sells out, it will probably sell out again on its own merit and relatively affordable price tag—not because who wore it. The same theory could be applied to plenty of future items that Markle dons, or even past items that have since sold out.\n\nThere has been chatter about whether or not Meghan will generate a “Meghan Effect” similar to the way some analysts have extolled the “Kate Effect” and fans’ zeal for clothing and accessories worn by the Duchess of Cambridge. Certainly, Middleton’s appearances have helped with exposure for brands like British label Reiss and maternity line Seraphine, and much of what she wears (when the cost is within reason for the common folk) often sells out quickly.\n\nBut such sudden attention has caused some online retailers’ sites to crash (and downtime is never good for sales), and global fervor almost definitely contributed to the demise of Issa, the label of the now-iconic sapphire blue wrap dress Middleton wore during her engagement announcement in 2010, which launched the whole Kate Effect in the first place.\n\nIf Markle wears Aritzia, or picks up another mid-market label as a favorite brand, on a routine basis, that could give the prophecy of the Meghan Effect more solid ground. Until then, retailers shouldn’t pin hopes for recurring record quarterly sales on their three-quarter length sleeves based on celebrity, or royal, appearances.", "images": ["https://content.fortune.com/wp-content/uploads/2018/07/meghan-markle-artizia-invictus-games-bath-2017.jpg?resize=1200,600", "https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1242585998-e1665028070836.jpg?w=256&q=75", "https://content.fortune.com/wp-content/uploads/2018/07/meghan-markle-artizia-invictus-games-toronto-2017.jpg?w=1440&q=75", "https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1243767517-e1665076497696.jpg?w=256&q=75", "https://content.fortune.com/wp-content/uploads/2017/07/170719_denver-colorado-skyline.jpg?w=256&q=75", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://content.fortune.com/wp-content/uploads/2018/07/meghan-markle-artizia-invictus-games-bath-2017.jpg?resize=1200,600", "keywords": [], "authors": [], "canonical_link": "https://fortune.com/2018/07/13/meghan-markle-aritzia-earnings/", "title": "Aritzia Says Meghan Markle Boosted Earnings; Will It Last?", "meta_data": {"viewport": "width=device-width", "msapplication-TileColor": "#ffc40d", "theme-color": "#ffffff", "description": "Designers and investors are eager to assume the Duchess of Sussex will produce another \"Kate Effect.\" But are either trends real?", "keywords": "meghan markle, meghan markle aritzia, meghan markle everlane, everlane day market tote, meghan markle clothes, Duchess of Sussex, meghan markle givenchy, aritzia, aritzia clothes, aritzia stock, prince harry", "og": {"url": "https://fortune.com/2018/07/13/meghan-markle-aritzia-earnings/", "type": "article", "title": "Meghan Markle Is Being Credited With Boosting Aritzia's Earnings—But Will It Last?", "description": "The 'Kate Effect' might not have been as effective as you might think, either.", "site_name": "Fortune", "image": "https://content.fortune.com/wp-content/uploads/2018/07/meghan-markle-artizia-invictus-games-bath-2017.jpg?resize=1200,600", "width": 1024, "height": 683}, "twitter": {"card": "summary_large_image", "title": "Meghan Markle Is Being Credited With Boosting Aritzia's Earnings—But Will It Last?", "description": "The 'Kate Effect' might not have been as effective as you might think, either.", "image": "https://content.fortune.com/wp-content/uploads/2018/07/meghan-markle-artizia-invictus-games-bath-2017.jpg?resize=1200,600", "url": "https://fortune.com/2018/07/13/meghan-markle-aritzia-earnings/"}, "next-head-count": 32}, "movies": [], "publish_date": 1531436400.0, "source": "http://fortune.com", "summary": ""}