{"url": "https://deadline.com/2018/01/suits-renewed-season-8-patrick-j-adams-meghan-markle-exit-dule-hill-promoted-7b-premiere-date-usa-network-1202273844/", "text": "USA Network has given a Season 8 renewal to its long-running drama series Suits. The network also officially confirmed the exits of original cast members Patrick J. Adams and Meghan Markle after the end of Season 7.\n\nPrimetime-Panic Your Complete Guide to Pilots and Straight-to-Series orders See All\n\nReturning for Season 8 are fellow original cast members Gabriel Macht (Harvey Specter), Sarah Rafferty (Donna Paulsen) and Rick Hoffman (Louis Litt), joined by Dulé Hill (Alex Williams), who has been promoted to a series regular after recurring this season.\n\nUSA\n\nThe remainder of Season 7 will premiere March 28, culminating in a two-hour season finale on Wednesday, April 25 – an arc in which Suits will bid farewell to characters Mike Ross (Adams) and Rachel Zane (Markle). The arc, which also includes the planted Suits spinoff pilot starring Gina Torres in the season finale, is expected to feature the long-awaited Mike and Rachel wedding just a couple of weeks before Markle’s real-life nuptials to Prince Harry.\n\n“Mike Ross has taught me a lot about commitment, hard work and the power of believing in yourself and I feel blessed that now we both get to walk out into the lives that we never dreamed we would actually be lucky enough to live,” Adams said in a statement about his exit, thanking colleagues and fans. (you can read it in its entirety below the post.)\n\nWhile Adams is departing as a series regular, that does not necessarily mean that we we will never again see Mike Ross on the show, which has featured original cast member Gina Torres as Jessica in multiple guest-starring stints since her exit.\n\n“Both of us are open, under right circumstances, of him coming back,” Suits Aaron Korsh told Deadline, noting how “overcome with emotion” he was when a video of Mike’s best Suits moments was played as they were wrapping production. “Suits is an onscreen and offscreen family, and family members are always welcome back; we just have to come up with the right storyline.”\n\nUSA Network\n\nKorsh provided some clues about where the show will go next season. “Season 8 will have everything from shifting alliances and internal power plays, to secrets, betrayals and fiery relationships,” he said. “Keep an eye out for an adversarial new character that will give Harvey a run for his money.”\n\nThat will be a new series regular Suits will introduce in Season 8, Korsh confirmed to Deadline.\n\nThere are no current plans for Torres’ character Jessica to make appearances in Season 8 as a decision is pending on the the planted spinoff. “I am eagerly awaiting the news of a pickup, and I’m optimistic it would happen,” Korsh told Deadline. “Because of that we are not focusing on Jessica being a significant part of season 8, I assume she will be involved in the spinoff.”\n\nAs for potential crossovers between the two series down the road, “it would be Suits characters visiting the spinoff,” Korsh suggested.\n\n.\n\nSuits started off as a buddy show centered on Harvey and Mike. While it has since evolved into a legal ensemble, “we’ll replace the bromance and mentor-mentee (elements) in a comprehensive approach,” Korsh said. He suggested that Harvey and Alex as well as Harvey and Louis would pick up some of the slack in the bromance department, while admitting that there is no obvious character right now to take on a mentee role.\n\nReflecting on Adams and Markle’s journey on the show, “I would like to thank Patrick and Meghan for their extraordinary contributions over the last seven years,” Korsh said. “Not only have they been outstanding in their roles as Mike and Rachel, they are also superb human beings who will always be beloved members of the Suits family, and we wish them well in their days to come.”\n\nAdams was a fresh-faced young actor who got his big break when he was cast as the co-lead opposite Macht in Suits, which films in Toronto, landing a SAG nomination for the first season. A lot has changed since for him professionally and personally, with Adams getting married last year when he started contemplating a next chapter in his career.\n\nWhen the back half of Season 7 returns, Harvey must deal with the aftermath of Jessica (Torres) losing her license, while trying to process how the kiss with Donna will affect his relationship with Paula (Christina Cole). Mike tries to juggle his commitment to the firm, his passion for pro bono work, and his engagement to Rachel. All the while, Louis struggles with right and wrong as his torrid affair with Sheila (Rachael Harris) deepens.\n\n“After seven seasons, Suits remains one of USA Network’s most beloved and popular series,” said USA president Chris McCumber. “While we’re excited for Season 8, everyone at USA will deeply miss Patrick and Meghan, and are grateful for the talent and commitment they brought to Suits season after season. We wish each of them nothing but the very best.”\n\nFrom Universal Cable Productions, Suits is executive produced by Aaron Korsh as well as Doug Liman, David Bartis and Gene Klein of Hypnotic. Daniel Arkin, Rick Muirragui, Genevieve Sparling and Christopher Misiano also serve as executive producers.\n\nHere is the Season 7B promo followed by Adams’ full statement:", "images": ["https://deadline.com/wp-content/uploads/2017/03/suits-6.jpg", "https://deadline.com/wp-content/uploads/2018/01/download-suits-season-7.jpg?w=900", "https://deadline.com/wp-content/uploads/2017/11/suits-4.jpg", "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://deadline.com/wp-content/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://deadline.com/wp-content/uploads/2018/01/download-suits-season-7.jpg?w=681&h=383&crop=1", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1"], "top_img": "https://deadline.com/wp-content/uploads/2018/01/download-suits-season-7.jpg?w=900", "keywords": [], "authors": ["Nellie Andreeva"], "canonical_link": "https://deadline.com/2018/01/suits-renewed-season-8-patrick-j-adams-meghan-markle-exit-dule-hill-promoted-7b-premiere-date-usa-network-1202273844/", "title": "‘Suits’ Renewed For Season 8 Without Patrick J. Adams & Meghan Markle – Deadline", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "USA Network has given a Season 8 renewal to its long-running drama series Suits &amp; confirmed the exits of Patrick J. Adams and Meghan Markle.", "news_keywords": "Dule Hill, Meghan Markle, Patrick J. Adams, Suits, USA Network", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=533209613", "generator": "WordPress 6.0.2", "author": "Nellie Andreeva", "theme-color": "#fff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Deadline", "application-name": "Deadline", "content_type": "Article", "post_id": 1202273844, "title": "'Suits' Renewed For Season 8 Without Patrick J. Adams & Meghan Markle, Ups  Dulé Hill & Gets 7B Premiere Date By USA", "published_at": "2018-01-30 12:00:06", "image": "https://deadline.com/wp-content/uploads/2018/01/download-suits-season-7.jpg?w=296&h=166&crop=1", "comment_count": 15, "tags": "USA Network", "topics": "TV", "body": "USA Network has given a Season 8 renewal to its long-running drama series Suits. The network also officially confirmed the exits of original cast members Patrick J. Adams and Meghan Markle after the end of Season 7.\r\nReturning for Season 8 are fellow original cast members Gabriel Macht (Harvey Specter), Sarah Rafferty (Donna Paulsen) and Rick Hoffman (Louis Litt), joined by Dulé Hill (Alex Williams), who has been promoted to a series regular after recurring this season.\r\n\r\n\r\n\r\nThe remainder of Season 7 will premiere March 28, culminating in a two-hour season finale on Wednesday, April 25 – an arc in which Suits will bid farewell to characters Mike Ross (Adams) and Rachel Zane (Markle). The arc, which also includes the planted Suits spinoff pilot starring Gina Torres in the season finale, is expected to feature the long-awaited Mike and Rachel wedding just a couple of weeks before Markle's real-life nuptials to Prince Harry.\r\n\r\n\"Mike Ross has taught me a lot about commitment, hard work and the power of believing in yourself and I feel blessed that now we both get to walk out into the lives that we never dreamed we would actually be lucky enough to live,\" Adams said in a statement about his exit, thanking colleagues and fans. (you can read it in its entirety below the post.)\r\n\r\nWhile Adams is departing as a series regular, that does not necessarily mean that we we will never again see Mike Ross on the show, which has featured original cast member Gina Torres as Jessica in multiple guest-starring stints since her exit.\r\n\r\n\"Both of us are open, under right circumstances, of him coming back,\" Suits Aaron Korsh told Deadline, noting how \"overcome with emotion\" he was when a video of Mike's best Suits moments was played as they were wrapping production. \"Suits is an onscreen and offscreen family, and family members are always welcome back; we just have to come up with the right storyline.\"\r\n\r\n\r\n\r\nKorsh provided some clues about where the show will go next season. \"Season 8 will have everything from shifting alliances and internal power plays, to secrets, betrayals and fiery relationships,\"  he said. \"Keep an eye out for an adversarial new character that will give Harvey a run for his money.”\r\n\r\nThat will be a new series regular Suits will introduce in Season 8, Korsh confirmed to Deadline.\r\n\r\nThere are no current plans for Torres' character Jessica to make appearances in Season 8 as a decision is pending on the the planted spinoff. \"I am eagerly awaiting the news of a pickup, and I'm optimistic it would happen,\" Korsh told Deadline. \"Because of that we are not focusing on Jessica being a significant part of season 8, I assume she will be involved in the spinoff.\"\r\n\r\nAs for potential crossovers between the two series down the road, \"it would be Suits characters visiting the spinoff,\" Korsh suggested.\r\n\r\n\r\n\r\nSuits started off as a buddy show centered on Harvey and Mike. While it has since evolved into a legal ensemble, \"we’ll replace the bromance and mentor-mentee (elements) in a comprehensive approach,\" Korsh said. He suggested that Harvey and Alex as well as Harvey and Louis would pick up some of the slack in the bromance department, while admitting that there is no obvious character right now to take on a mentee role.\r\n\r\nReflecting on Adams and Markle's journey on the show, \"I would like to thank Patrick and Meghan for their extraordinary contributions over the last seven years,\" Korsh said. \"Not only have they been outstanding in their roles as Mike and Rachel, they are also superb human beings who will always be beloved members of the Suits family, and we wish them well in their days to come.”\r\n\r\nAdams was a fresh-faced young actor who got his big break when he was cast as the co-lead opposite Macht in Suits, which films in Toronto, landing a SAG nomination for the first season. A lot has changed since for him professionally and personally, with Adams getting married last year when he started contemplating a next chapter in his career.\r\n\r\nWhen the back half of Season 7 returns, Harvey must deal with the aftermath of Jessica (Torres) losing her license, while trying to process how the kiss with Donna will affect his relationship with Paula (Christina Cole). Mike tries to juggle his commitment to the firm, his passion for pro bono work, and his engagement to Rachel. All the while, Louis struggles with right and wrong as his torrid affair with Sheila (Rachael Harris) deepens.\r\n“After seven seasons, Suits remains one of USA Network’s most beloved and popular series,” said USA president Chris McCumber. “While we’re excited for Season 8, everyone at USA will deeply miss Patrick and Meghan, and are grateful for the talent and commitment they brought to Suits season after season. We wish each of them nothing but the very best.”\r\nFrom Universal Cable Productions, Suits is executive produced by Aaron Korsh as well as Doug Liman, David Bartis and Gene Klein of Hypnotic. Daniel Arkin, Rick Muirragui, Genevieve Sparling and Christopher Misiano also serve as executive producers.\r\nHere is the Season 7B promo followed by Adams' full statement:\r\n\r\n\r\nIt’s hard for me to imagine what words, in what order would sufficiently express my love and gratitude to all of the people who have made the last seven years possible. From my unbelievably talented cast mates to our relentlessly committed crew, to the brilliant minds at USA, UCP and Hypnotic, to the legions of fans all over the world, every one of them dedicating so much of their time, energy and talent to make Suits what it is today - one of the most beloved and successful shows on television. So I will choose the simplest words I have. Thank you. From the bottom of my heart, thank you. It has been an honor working with and for each and everyone one of you.\r\n\r\nMike Ross has taught me a lot about commitment, hard work and the power of believing in yourself and I feel blessed that now we both get to walk out into the lives that we never dreamed we would actually be lucky enough to live. I’m excited to now step across the screen and become solely a fan of a show that I know has much more in store in the years to come. I wish everyone involved the best and am excited to see what kind of trouble they’ll get themselves in and out of from here on out.\r\n\r\n- Patrick J. Adams", "fb": {"pages": 105558754896}, "onesignal": "wordpress-plugin", "fragment": "!", "og": {"type": "article", "title": "‘Suits’ Renewed For Season 8 Without Patrick J. Adams & Meghan Markle, Ups  Dulé Hill & Gets 7B Premiere Date By USA", "url": "https://deadline.com/2018/01/suits-renewed-season-8-patrick-j-adams-meghan-markle-exit-dule-hill-promoted-7b-premiere-date-usa-network-1202273844/", "description": "USA Network has given a Season 8 renewal to its long-running drama series Suits. The network also officially confirmed the exits of original cast members Patrick J. Adams and Meghan Markle after th…", "site_name": "Deadline", "image": {"identifier": "https://deadline.com/wp-content/uploads/2018/01/download-suits-season-7.jpg?w=900", "width": 900, "height": 506}, "locale": "en_US"}, "article": {"published_time": "2018-01-30T20:00:06+00:00", "modified_time": "2019-09-06T22:26:08+00:00"}, "twitter": {"site": "@DEADLINE", "creator": "@DeadlineNellie", "card": "summary_large_image", "title": "‘Suits’ Renewed For Season 8 Without Patrick J. Adams & Meghan Markle, Ups  Dulé Hill & Gets 7B Premiere Date By USA", "description": "USA Network has given a Season 8 renewal to its long-running drama series Suits & confirmed the exits of Patrick J. Adams and Meghan Markle.", "image": "https://deadline.com/wp-content/uploads/2018/01/download-suits-season-7.jpg?w=900"}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1517342406.0, "source": "https://deadline.com", "summary": ""}