{"url": "www.hollywoodreporter.com/news/george-clooney-opens-up-parenting-twins-denies-using-fertility-drugs-1034974", "text": "George Clooney is opening up about becoming a father to twins, revealing to The Hollywood Reporter details of the birth and denying that he and wife Amal used fertility drugs to become pregnant.\n\nIn THR’s cover story, the Suburbicon director says the couple never really discussed children while they were dating and didn’t broach the subject until sometime after their 2014 wedding.\n\n“It had never been part of my DNA,” he says. “We didn’t plan on it. We never talked about it until after we were married, which is funny. There was an assumption that we didn’t want them. And then, after the wedding, Amal and I were talking and we just felt we’d gotten very lucky, both of us, and we should share whatever good luck we’ve got. It would seem self-centered to just have that belong to us.”\n\nAmal became pregnant in 2016, and Clooney was with her in London when they went to the doctor for an ultrasound. “He goes, ‘Well, there’s one.’ And I said, ‘Great.’ And then he goes, ‘And there’s the second one.’ And I was like, ‘What?’ We just sat there, staring at that piece of paper they give you, and I kept thinking there was a mistake.”\n\nThe couple welcomed a boy and a girl, named Alexander and Ella, on June 6, a month premature, at St. Mary’s Hospital, the same hospital where Prince William and Kate Middleton’s children were born. Alexander was born one minute and 49 seconds before Ella; Clooney reveals to THR (the first media outlet to see the babies up close) that Alexander weighed five and a half pounds, while Ella was four and a half pounds. The twins have dual British and American nationality.\n\nClooney, at age 56, says of his reaction to the birth: “It was wild. You know, everything is conceptual until it’s real. It’s like, ‘Yeah, we’re going to be parents, yeah.’ And all of a sudden you go: ‘Holy shit. I’m a parent!’?”\n\nWhile Clooney admits that both parents are “unrested,” he was surprised to find that he’s good at changing diapers.\n\nContrary to tabloid reports, Clooney denies that the duo used fertility drugs to become pregnant — speculation that likely arose due to Amal’s age and the multiple births. (Women who are age 35 and older are considered of “advanced maternal age” by the medical community.) Asked if she wants more children, Amal demurred: “I’m 39. I already had them quite late.”\n\nFatherhood is both emotional and scary, “all of those things,” Clooney added. “The first thing you think is, ‘I hope I don’t screw this up.’ I mean, look, we are all responsible for things in life, and Amal and I are responsible for each other in a way — we look out for one another and we care about one another. But you are really responsible for two kids. I want them to be happy. I want them to have a sense of humor. I want them to be interested in things. I want them to be compassionate about other people’s plights. Because that’s the thing, you know? You have to have some sort of empathy.”\n\nMeanwhile, Clooney also has been dealing with invasive paparazzi trying to get photos of the babies. In July, he lashed out after photos of the twins plastered on the cover of France’s Voici magazine and made the rounds online.\n\n“Over the last week photographers from Voici magazine scaled our fence, climbed our tree and illegally took pictures of our infants inside our home,” Clooney said in a statement at the time. “Make no mistake the photographers, the agency and the magazine will be prosecuted to the full extent of the law. The safety of our children demands it.”\n\nThe photos feature blurry images of the Clooneys, each of them carrying one of their infants, that were snapped in Lake Como, Italy, where Clooney has a home. The magazine touts the images as the first photos of the twins. (An official photo has yet to be released.)\n\n“Every single day there’s some crazy sort of infringement,” he tells THR. “And you go, ‘OK, we’ll eat it. That’s what we have to do.’ But when someone breaks the law, that’s beyond what we bargained for, beyond the pact I made: that when you’re famous, you’re going to be followed. I don’t know anyone who wouldn’t be furious.”\n\nNext up: Clooney is promoting his new film, Suburbicon, a drama set in the late 1950s that he directed and co-wrote with Grant Heslov starring Matt Damon and Julianne Moore. The Paramount release debuted Saturday at the Venice Film Festival.\n\nRead more about Clooney in THR’s cover story.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/06/gettyimages-473029800_-_h_2017.jpg?w=1296&h=730&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/gettyimages-473029800_-_h_2017.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/gettyimages-473029800_-_h_2017.jpg?w=1024", "keywords": [], "authors": ["Thr Staff"], "canonical_link": "https://www.hollywoodreporter.com/news/general-news/george-clooney-opens-up-parenting-twins-denies-using-fertility-drugs-1034974/", "title": "George Clooney Opens Up About Parenting Twins, Denies Using Fertility Drugs", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "In The Hollywood Reporter's cover story, the director of upcoming film 'Suburbicon' reveals how he learned he and wife Amal were expecting a boy and a girl, details of the birth, what it's like becoming a father at age 56 and how he deals with trespassing paparazzi.", "news_keywords": "Amal Clooney, George Clooney, Suburbicon", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "THR staff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1034974, "title": "George Clooney Opens Up About Parenting Twins, Denies Using Fertility Drugs", "published_at": "2017-09-06 07:00:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/gettyimages-473029800_-_h_2017.jpg?w=1024", "comment_count": 0, "tags": "Suburbicon", "topics": "News", "body": "George Clooney is opening up about becoming a father to twins, revealing to The Hollywood Reporter details of the birth and denying that he and wife Amal used fertility drugs to become pregnant.\r\nIn THR's cover story, the Suburbicon director says the couple never really discussed children while they were dating and didn't broach the subject until sometime after their 2014 wedding.\r\n\"It had never been part of my DNA,\" he says. \"We didn't plan on it. We never talked about it until after we were married, which is funny. There was an assumption that we didn't want them. And then, after the wedding, Amal and I were talking and we just felt we'd gotten very lucky, both of us, and we should share whatever good luck we've got. It would seem self-centered to just have that belong to us.\"\r\nAmal became pregnant in 2016, and Clooney was with her in London when they went to the doctor for an ultrasound. \"He goes, 'Well, there's one.' And I said, 'Great.' And then he goes, 'And there's the second one.' And I was like, 'What?' We just sat there, staring at that piece of paper they give you, and I kept thinking there was a mistake.\"\r\nThe couple welcomed a boy and a girl, named Alexander and Ella, on June 6, a month premature, at St. Mary's Hospital, the same hospital where Prince William and Kate Middleton's children were born. Alexander was born one minute and 49 seconds before Ella; Clooney reveals to THR (the first media outlet to see the babies up close) that Alexander weighed five and a half pounds, while Ella was four and a half pounds. The twins have dual British and American nationality.\r\nClooney, at age 56, says of his reaction to the birth: \"It was wild. You know, everything is conceptual until it's real. It's like, 'Yeah, we're going to be parents, yeah.' And all of a sudden you go: 'Holy shit. I'm a parent!'?\"\r\nWhile Clooney admits that both parents are \"unrested,\" he was surprised to find that he's good at changing diapers.\r\nContrary to tabloid reports, Clooney denies that the duo used fertility drugs to become pregnant — speculation that likely arose due to Amal's age and the multiple births. (Women who are age 35 and older are considered of \"advanced maternal age\" by the medical community.) Asked if she wants more children, Amal demurred: \"I'm 39. I already had them quite late.\"\r\nFatherhood is both emotional and scary, \"all of those things,\" Clooney added. \"The first thing you think is, 'I hope I don't screw this up.' I mean, look, we are all responsible for things in life, and Amal and I are responsible for each other in a way — we look out for one another and we care about one another. But you are really responsible for two kids. I want them to be happy. I want them to have a sense of humor. I want them to be interested in things. I want them to be compassionate about other people's plights. Because that's the thing, you know? You have to have some sort of empathy.\"\r\n\r\nMeanwhile, Clooney also has been dealing with invasive paparazzi trying to get photos of the babies. In July, he lashed out after photos of the twins plastered on the cover of France's Voici magazine and made the rounds online.\r\n\"Over the last week photographers from Voici magazine scaled our fence, climbed our tree and illegally took pictures of our infants inside our home,\" Clooney said in a statement at the time. \"Make no mistake the photographers, the agency and the magazine will be prosecuted to the full extent of the law. The safety of our children demands it.\"\r\nThe photos feature blurry images of the Clooneys, each of them carrying one of their infants, that were snapped in Lake Como, Italy, where Clooney has a home. The magazine touts the images as the first photos of the twins. (An official photo has yet to be released.)\r\n\"Every single day there's some crazy sort of infringement,\" he tells THR. \"And you go, 'OK, we'll eat it. That's what we have to do.' But when someone breaks the law, that's beyond what we bargained for, beyond the pact I made: that when you're famous, you're going to be followed. I don't know anyone who wouldn't be furious.\"\r\nNext up: Clooney is promoting his new film, Suburbicon, a drama set in the late 1950s that he directed and co-wrote with Grant Heslov starring Matt Damon and Julianne Moore. The Paramount release debuted Saturday at the Venice Film Festival.\r\n\r\nRead more about Clooney in THR's cover story.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "George Clooney Opens Up About Parenting Twins, Denies Using Fertility Drugs", "url": "https://www.hollywoodreporter.com/news/general-news/george-clooney-opens-up-parenting-twins-denies-using-fertility-drugs-1034974/", "description": "In The Hollywood Reporter’s cover story, the director of upcoming film ‘Suburbicon’ reveals how he learned he and wife Amal were expecting a boy and a girl, details of the birth, …", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/gettyimages-473029800_-_h_2017.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-09-06T07:00:00+00:00", "modified_time": "2017-09-06T12:54:42+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "George Clooney Opens Up About Parenting Twins, Denies Using Fertility Drugs", "description": "In The Hollywood Reporter’s cover story, the director of upcoming film ‘Suburbicon’ reveals how he learned he and wife Amal were expecting a boy and a girl, details of the birth, …", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/gettyimages-473029800_-_h_2017.jpg?w=1296"}}, "movies": [], "publish_date": 1504681200.0, "source": "http://www.hollywoodreporter.com", "summary": ""}