{"url": "https://www.etonline.com/ariana-grandes-ex-mac-miller-opens-up-about-their-breakup-and-moving-on-i-am-happy-for-her-106534", "text": "Mac Miller is addressing his split from Ariana Grande for the first time.\n\nOn Monday, the 26-year-old rapper appeared on Zane Lowe's show on Beats 1 on Apple Music, and talked about their breakup after two years of dating. The two split in May, and 25-year-old Grande quickly moved on to Saturday Night Live star Pete Davidson. Grande and Davidson are now engaged.\n\n\"You know, that's the other thing is with the relationship thing is, like, the internet is wild,\" Miller notes about dating someone as famous as Grande. \"I kind of knew, but not really.\"\n\nWhen asked if dealing with the intense scrutiny was \"stressful,\" Miller says he and Grande actually had a normal relationship, and that he was \"in love\" with her.\n\n\"Life is stressful,\" he explains. \"So, of course there were stressful times. It's not that unique. You know, like, I was in love with somebody. We were together for two years. We worked through good times, bad times, stress, and everything else. And then it came to an end and we both moved on. And it's that simple, you know.\"\n\nMiller shares that people have been checking up on him after the breakup, but that he had stopped going on the web to prepare for the release of his upcoming album, Swimming, which drops next month.\n\n\"Like, I haven't been on the internet. So, you know, people have assumed that I'm ... 'Are you OK? Is everything OK?'\" he says. \"Because I was about to drop the album. And also, like, I don't know, it just all seemed kind of unimportant, the need to show people I was OK. Like, what is that? Where does that come from? Why? Why do we have this need to use social media and the internet?\"\n\nMiller says he is happy that he and Grande have both moved on.\n\n\"It's strange. Like, the whole thing is a little strange but it's not negative,\" he says. \"It's just a part of something that's going to continue to help make me who I am. You know, it's all positive energy. I am happy for her and moving forward with her life just as I'm sure she is with me.\"\n\nAs for his arrest on a charge of DUI in May shortly after their breakup -- which led Grande to clap back at a fan who blamed her for it -- Miller calls the incident a blessing in disguise. An official for the Los Angeles Police Department told ET at the time that Miller was the driver involved in a traffic collision with a power pole in the San Fernando Valley in California in the early hours of May 17. According to the official, Miller and his two passengers fled the scene on foot.\n\n\"What you don’t understand is that I lived a certain life for 10 years and faced almost no real consequence at all,\" he says. \"I had no version of the story that didn't end up with me being fine. Yeah, I made a stupid mistake. I'm a human being. Like, drove home drunk. But it was the best thing that could have happened. ... I needed that. I needed to run into that light pole and literally, like, have the whole thing stop.\"\n\nAfter Miller's DUI arrest, Grande called their relationship \"toxic\" when responding to a fan who tweeted, \"Mac Miller totaling his G wagon and getting a DUI after Ariana Grande dumped him for another dude after he poured his heart out on a 10-song album to her called the divine feminine is just the most heartbreaking thing happening in Hollywood.\"\n\n\"How absurd you minimize female self-respect and self-worth by saying someone should stay in a toxic relationship because he wrote an album about them, which btw isn't the case (just 'Cinderella' is ab me),\" Grande replied. \"I am not a babysitter or a mother and no woman should feel that they need to be. I have cared for him and tried to support his sobriety & prayed for his balance for years (and always will of course) but shaming/blaming women for a man's inability to keep his sh** together is a very major problem.\"\n\n\"Let's please stop doing that,\" she continued. \"Of course I didn't share how hard or scary it was while it was happening but it was. I will continue to pray from the bottom of my heart that he figures it all out and that any other woman in this position does as well.\"\n\nFor more on Grande and Miller's breakup, watch the video below:\n\nAriana Grande Opens Up About 'Toxic' Relationship With Mac Miller This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page.\n\nRELATED CONTENT:\n\nAriana Grande's Ex Mac Miller Raps About Lost Love as They Both Release Music Videos on Same Day\n\nAriana Grande Calls Relationship With Mac Miller 'Toxic,' Addresses His Sobriety\n\nAriana Grande Says She Knows Her Instagram PDA With Pete Davidson Is 'Annoying'\n\nRelated Gallery\n\n\n\n", "images": ["https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2016-08/1280_ariana_grande_mac_miller_597571036.jpg?itok=QfaRyKIK", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2016-08/1280_ariana_grande_mac_miller_597571036.jpg?itok=drrNLQlV", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2022-10/Kaye_GettyImages-1429667472_300.jpg?h=6c83441f&itok=79-eWDg7", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2022-10/Screen%20Shot%202022-10-08%20at%202.01.34%20PM.png?h=597e033f&itok=1KV1Fu0Z", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2018-11/eto_news_daily_pete_ariana_110118.jpg?h=c673cd1c&itok=-NOJ0JS3"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2016-08/1280_ariana_grande_mac_miller_597571036.jpg?itok=drrNLQlV", "keywords": [], "authors": ["Antoinette Bueno"], "canonical_link": "https://www.etonline.com/ariana-grandes-ex-mac-miller-opens-up-about-their-breakup-and-moving-on-i-am-happy-for-her-106534", "title": "Ariana Grande's Ex Mac Miller Opens Up About Their Breakup and Moving On: 'I Am Happy for Her'", "meta_data": {"article": {"opinion": "false"}, "apple-mobile-web-app-capable": "yes", "robots": "index", "description": "The rapper candidly talked about the split for the first time.", "keywords": "News, Ariana Grande, Mac Miller", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/ariana-grandes-ex-mac-miller-opens-up-about-their-breakup-and-moving-on-i-am-happy-for-her-106534", "title": "Ariana Grande's Ex Mac Miller Opens Up About Their Breakup and Moving On: 'I Am Happy for Her'", "description": "The rapper candidly talked about the split for the first time.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2016-08/1280_ariana_grande_mac_miller_597571036.jpg?itok=drrNLQlV", "width": 1280, "height": 720}}, "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "twitter": {"card": "summary_large_image", "description": "The rapper candidly talked about the split for the first time.", "site": {"identifier": "@etnow", "id": 23603092}, "title": "Ariana Grande's Ex Mac Miller Opens Up About Their Breakup and Moving On: 'I Am Happy for Her'", "creator": "Antoinette Bueno‍", "url": "https://www.etonline.com/ariana-grandes-ex-mac-miller-opens-up-about-their-breakup-and-moving-on-i-am-happy-for-her-106534", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2016-08/1280_ariana_grande_mac_miller_597571036.jpg?itok=drrNLQlV"}, "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}