{"url": "https://www.billboard.com/articles/news/super-bowl/6867098/super-bowl-national-anthem-performances-whitney-beyonce", "text": "Since the Super Bowl stands at the pinnacle of American sports, it’s no surprise that the nation’s most-high profile competition also boasts an iconic annual music tradition — the singing of “The Star-Spangled Banner” for a global audience in the hundreds of millions.\n\nSince its first inception in 1967, the Super Bowl has included an offering of the national anthem, and in recent decades, the visibility has only increased as music superstars take to the mic to deliver America’s sacred song.\n\nWhile more than 30 performers have undertaken the roughly two-minute challenge, here are Billboard’s top 10 picks for the best Super Bowl performances of “The Star-Spangled Banner” through 2016:\n\n10. Dixie Chicks – 2003\n\nThe reigning country queens with big personalities turned in a surprisingly modest but remarkable “Star-Spangled Banner” in San Diego, opting for a straightforward approach strengthened with alluring harmonies. The Chicks’ patriotic ode ironically preceded a major political backlash: mere weeks later, lead singer Natalie Maines’ comments about President George W. Bush led to a politically-charged controversy that the Chicks’ career has yet to fully recover from.\n\n9. Faith Hill – 2000\n\nThe country diva seized the mic at the turn of the millennium, and offered one of the cleanest vocal renditions to date. The relatively simple backing band — compared with some of the massive orchestras in other years — lets Faith’s voice take center stage, which doesn’t shrink from the challenge. Perhaps the best part, though, is the final flourish: a clenched fist, candid grin and a mouthed “whoo.” She’s nailed it, and she knows it.\n\n8. Choirs of the Armed Forces – 2005\n\nIn a break from the star-studded roster that had honored America for decades, organizers aimed the spotlight on the nation’s military during the 2005 Super Bowl. With choirs from all five branches of the armed forces accompanied by the U.S. Army Herald Trumpets, this poignant version resonates, particularly in the shadow of the escalating conflicts in Afghanistan and Iraq at the time.\n\n7. Lady Gaga – 2016\n\nBy the time Lady Gaga hit the Super Bowl stage in 2016, she’d been preparing audiences for her vocal display for the better part of a year. In addition to various appearances to support Cheek to Cheek, her jazz and standards album with Tony Bennett, she also won praise for a medley of songs from The Sound of Music at the 87th Academy Awards. Little surprise, then, that Gaga painted her rendition of the anthem with a full-throated, theatrical-leaning take that was a nod to her performance roots. And for the Little Monsters who hoped for a bold outfit to complement the booming voice, Gaga rocked a glittery red pantsuit with platform shoes and blue-starred nails in a full-body tribute to the stars and stripes.\n\n6. Mariah Carey – 2002\n\nAs one of the definitive voices in pop music, it’s a little odd that Mimi didn’t score her Super Bowl turn until more than a decade into her career. Still, Mariah’s turn at the microphone held a place in history, coming as the first Super Bowl game after the Sept. 11, 2001 attacks. With the memory still fresh on the American consciousness (and a commorative statue placed in the stadium), the songbird soared with an apt, solemn rendition before cresting on the song’s ending, including a visit to the whistle register on “the land of the free.”\n\n5. Luther Vandross – 1997\n\nEverything Luther sang was smooth, and his “Star-Spangled Banner” is no exception. With a velvety, R&B-laced arrangement backing him, Luther cuts out the most suave rendition since Marvin Gaye’s legendary NBA All-Star interpretation in 1983. For those who prefer a little more gusto with their national anthems, Luther raises the stakes at the end, showing his mastery of both vocal purring and power.\n\n4. Kelly Clarkson – 2012\n\nThe pop superstar offered a soul-tinged interpretation on the country’s standard song in Indianapolis, complete with an angelic backing choir. A decade removed since her American Idol coronation, the original Idol proved she still owned the requisite chops to deliver a stirring rendition of the classic.\n\n3. Beyoncé – 2004\n\nIn 2004, NFL organizers offered Beyoncé this choice for a Super Bowl performance in her native Houston: halftime show or national anthem. She elected to fulfill a childhood dream, and chose the anthem – a smart move. Some six months after her debut solo album Dangerously In Love dropped, the soon-to-be Queen Bey proclaimed herself a bonafide solo star. And, to be fair, Beyonce claimed both musical spotlights eventually: eight years after performing the national anthem, Bey hit the stage for a high-octane halftime show.\n\n2. Jennifer Hudson – 2009\n\nJennifer Hudson sighed heavily as the first notes filled the stadium, and proceeded to blow the crowd away. The Oscar winner’s take — backed by a lush orchestra — continually improves on itself, growing from its opening faintness to the final knockout notes courtesy of Hudson’s trademark powerhouse vocals. For viewers at the time, the diva’s deliver of the lyrics, which champion endurance and resolve, evoked a touching personal significance to this career milestone: Hudson’s appearance marked her first public engagement since the murders of her mother, brother and 7-year-old nephew the previous October.\n\n1. Whitney Houston – 1991\n\nWho else? Whitney, at the peak of her vocal powers, roared through a rousing rendition in 1991 that is widely considered the gold standard. The superstar’s stentorian rendition suited the wave of patriotism flooding the United States at the height of the Persian Gulf War, and public demand for the rendition led Arista Records to release the recording as a commercial single. It subsequently burst onto the Billboard Hot 100, ultimately peaking at No. 20. Yet, the performance remained such a pop culture staple that Houston’s interpretation later climbed into the top 10 — peaking at No. 6 — following its reissue after the Sept. 11, 2001 attacks.", "images": ["http://static.billboard.com/files/media/superbowl-2017-620x90.jpg", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204652553202666&ev=PageView&noscript=1", "https://www.billboard.com/wp-content/uploads/media/whitney-houston-performance-superbowl-1991-billboard-1548.jpg?w=1024", "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/public/lazyload-fallback.gif"], "top_img": "https://www.billboard.com/wp-content/uploads/media/whitney-houston-performance-superbowl-1991-billboard-1548.jpg?w=1024", "keywords": [], "authors": ["Trevor Anderson"], "canonical_link": "https://www.billboard.com/music/music-news/super-bowl-national-anthem-performances-whitney-beyonce-6867098/", "title": "Top 10 Super Bowl National Anthem Performances", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/icons/icon-144x144.png", "msapplication-TileColor": "#eff4ff", "description": "Ahead of Super Bowl 50, Billboard counts down the 10 best Super Bowl national anthem renditions to date.", "news_keywords": "beyonce, Super Bowl", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "billboard", "pmc-page_type": "article", "articleid": 6867098, "author": "Trevor Anderson", "pmc-category": "Music,Music News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-02-06T12:16:47"}, "pmc-tag": "beyonce,Super Bowl", "title": "Top 10 Super Bowl National Anthem Performances", "pageclass": "article", "pmc-is_free": "no", "pmc-always-paywall": "no", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-exclusive": "no", "pmc-breaking-news": "no", "pmc-prime": "no"}, "generator": "WordPress 6.0.2", "author": "Trevor Anderson", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Billboard", "application-name": "Billboard", "content_type": "Article", "post_id": 6867098, "title": "Top 10 Super Bowl National Anthem Performances", "published_at": "2017-02-06 12:16:47", "image": "https://www.billboard.com/wp-content/uploads/media/whitney-houston-performance-superbowl-1991-billboard-1548.jpg?w=1024", "comment_count": 0, "tags": "Super Bowl", "topics": "Music News", "body": "Since the Super Bowl stands at the pinnacle of American sports, it's no surprise that the nation’s most-high profile competition also boasts an iconic annual music tradition -- the singing of “The Star-Spangled Banner” for a global audience in the hundreds of millions.Since its first inception in 1967, the Super Bowl has included an offering of the national anthem, and in recent decades, the visibility has only increased as music superstars take to the mic to deliver America’s sacred song.While more than 30 performers have undertaken the roughly two-minute challenge, here are Billboard’s top 10 picks for the best Super Bowl performances of “The Star-Spangled Banner” through 2016:10. Dixie Chicks – 2003The reigning country queens with big personalities turned in a surprisingly modest but remarkable “Star-Spangled Banner” in San Diego, opting for a straightforward approach strengthened with alluring harmonies. The Chicks’ patriotic ode ironically preceded a major political backlash: mere weeks later, lead singer Natalie Maines’ comments about President George W. Bush led to a politically-charged controversy that the Chicks’ career has yet to fully recover from.9. Faith Hill – 2000The country diva seized the mic at the turn of the millennium, and offered one of the cleanest vocal renditions to date. The relatively simple backing band -- compared with some of the massive orchestras in other years -- lets Faith’s voice take center stage, which doesn’t shrink from the challenge. Perhaps the best part, though, is the final flourish: a clenched fist, candid grin and a mouthed “whoo.\" She’s nailed it, and she knows it.8. Choirs of the Armed Forces – 2005In a break from the star-studded roster that had honored America for decades, organizers aimed the spotlight on the nation’s military during the 2005 Super Bowl. With choirs from all five branches of the armed forces accompanied by the U.S. Army Herald Trumpets, this poignant version resonates, particularly in the shadow of the escalating conflicts in Afghanistan and Iraq at the time.7. Lady Gaga - 2016By the time Lady Gaga hit the Super Bowl stage in 2016, she'd been preparing audiences for her vocal display for the better part of a year. In addition to various appearances to support Cheek to Cheek, her jazz and standards album with Tony Bennett, she also won praise for a medley of songs from The Sound of Music at the 87th Academy Awards. Little surprise, then, that Gaga painted her rendition of the anthem with a full-throated, theatrical-leaning take that was a nod to her performance roots. And for the Little Monsters who hoped for a bold outfit to complement the booming voice, Gaga rocked a glittery red pantsuit with platform shoes and blue-starred nails in a full-body tribute to the stars and stripes.6. Mariah Carey - 2002As one of the definitive voices in pop music, it's a little odd that Mimi didn't score her Super Bowl turn until more than a decade into her career. Still, Mariah's turn at the microphone held a place in history, coming as the first Super Bowl game after the Sept. 11, 2001 attacks. With the memory still fresh on the American consciousness (and a commorative statue placed in the stadium), the songbird soared with an apt, solemn rendition before cresting on the song's ending, including a visit to the whistle register on \"the land of the free.\" 5. Luther Vandross - 1997Everything Luther sang was smooth, and his “Star-Spangled Banner” is no exception. With a velvety, R&B-laced arrangement backing him, Luther cuts out the most suave rendition since Marvin Gaye’s legendary NBA All-Star interpretation in 1983. For those who prefer a little more gusto with their national anthems, Luther raises the stakes at the end, showing his mastery of both vocal purring and power.4. Kelly Clarkson – 2012The pop superstar offered a soul-tinged interpretation on the country’s standard song in Indianapolis, complete with an angelic backing choir. A decade removed since her American Idol coronation, the original Idol proved she still owned the requisite chops to deliver a stirring rendition of the classic.3. Beyoncé – 2004In 2004, NFL organizers offered Beyoncé this choice for a Super Bowl performance in her native Houston: halftime show or national anthem. She elected to fulfill a childhood dream, and chose the anthem - a smart move. Some six months after her debut solo album Dangerously In Love dropped, the soon-to-be Queen Bey proclaimed herself a bonafide solo star. And, to be fair, Beyonce claimed both musical spotlights eventually: eight years after performing the national anthem, Bey hit the stage for a high-octane halftime show.2. Jennifer Hudson – 2009Jennifer Hudson sighed heavily as the first notes filled the stadium, and proceeded to blow the crowd away. The Oscar winner’s take -- backed by a lush orchestra -- continually improves on itself, growing from its opening faintness to the final knockout notes courtesy of Hudson’s trademark powerhouse vocals. For viewers at the time, the diva's deliver of the lyrics, which champion endurance and resolve, evoked a touching personal significance to this career milestone: Hudson’s appearance marked her first public engagement since the murders of her mother, brother and 7-year-old nephew the previous October.1. Whitney Houston – 1991Who else? Whitney, at the peak of her vocal powers, roared through a rousing rendition in 1991 that is widely considered the gold standard. The superstar's stentorian rendition suited the wave of patriotism flooding the United States at the height of the Persian Gulf War, and public demand for the rendition led Arista Records to release the recording as a commercial single. It subsequently burst onto the Billboard Hot 100, ultimately peaking at No. 20. Yet, the performance remained such a pop culture staple that Houston’s interpretation later climbed into the top 10 -- peaking at No. 6 -- following its reissue after the Sept. 11, 2001 attacks.", "fb": {"pages": 75791669580}, "fragment": "!", "og": {"type": "article", "title": "Top 10 Super Bowl National Anthem Performances", "url": "https://www.billboard.com/music/music-news/super-bowl-national-anthem-performances-whitney-beyonce-6867098/", "description": "Ahead of Super Bowl 50, Billboard counts down the 10 best Super Bowl national anthem renditions to date.", "site_name": "Billboard", "image": {"identifier": "https://www.billboard.com/wp-content/uploads/media/whitney-houston-performance-superbowl-1991-billboard-1548.jpg?w=1024", "width": 1024, "height": 677, "alt": "Whitney Houston"}, "locale": "en_US"}, "article": {"published_time": "2017-02-06T17:16:47+00:00", "modified_time": "2017-02-06T16:41:36+00:00"}, "twitter": {"site": "@billboard", "card": "summary_large_image", "title": "Top 10 Super Bowl National Anthem Performances", "description": "Ahead of Super Bowl 50, Billboard counts down the 10 best Super Bowl national anthem renditions to date.", "image": "https://www.billboard.com/wp-content/uploads/media/whitney-houston-performance-superbowl-1991-billboard-1548.jpg?w=1024"}}, "movies": [], "publish_date": 1486401407.0, "source": "https://www.billboard.com", "summary": ""}