{"url": "https://www.hollywoodreporter.com/live-feed/project-runway-returns-bravo-lifetime-1111591", "text": "Designer Zac Posen, Actress Jessica Alba, Supermodel Heidi Klum and Journalist Nina Garcia walk the runway at the Project Runway fashion show during New York Fashion Week: The Shows at Gallery 1, Skylight Clarkson Sq on September 8, 2017 in New York City.\n\nProject Runway is returning to its original home on Bravo.\n\nThe fashion design reality television series is moving back to the NBCUniversal-owned network for its upcoming 17th season. Starting in 2004, the competition series aired its first five seasons on Bravo before moving to A+E Network’s Lifetime in 2008.\n\nAndy Cohen announced the news Monday during NBCUniversal’s upfront presentation at Radio City Music Hall in New York. “Project Runway is coming back where it all started,” he said onstage. “It’s coming home on Bravo.”\n\n“We are beyond excited to reboot Project Runway at the network where it all began. Leaning into the creative process in an entertaining way has always been part of Bravo’s DNA, and Project Runway perfectly captures that,” said Frances Berwick, president of Lifestyle Networks at NBCUniversal Cable Entertainment. “This franchise will be an important cornerstone to complement Bravo’s original premium scripted and unscripted slate, and we expect it to drive the same level of fandom and passion as we experienced last time it was on Bravo.”\n\nProject Runway returns to Bravo through an agreement between Bravo Media LLC and Lantern Entertainment LLC, whose bid to acquire the assets of The Weinstein Co. (which includes Project Runway) was approved by the Delaware bankruptcy court on May 8. The deal is subject to Lantern closing that acquisition. In addition, Bravo and Lantern have agreed to develop other unscripted projects for Bravo and other networks in the NBCUniversal Cable Entertainment portfolio.\n\nIn October, Harvey Weinstein was removed as an executive producer, with Project Runway host Heidi Klum speaking out: “I wish I could say that the horrible stories I read about Harvey Weinstein are a rare occurrence in our society, but that is simply not the case. We would be naive to think that this behavior only happens in Hollywood.”\n\n“As we anticipate formally completing the acquisition process, the opportunity to return Project Runway to its original home at Bravo and foster a long-term and productive partnership with NBCUniversal Cable Entertainment is an exciting first step for Lantern Entertainment,” added co-presidents Andy Mitchell and Milos Brajovic. “We share Bravo’s enthusiasm to reinvigorate the series and are incredibly grateful for everyone who has had a hand in making Project Runway the flagship franchise that it is today.”", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/gettyimages-844128302-embed.jpg?w=928&h=619&crop=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/gettyimages-844128302-embed.jpg?w=928", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/gettyimages-844128302-embed.jpg?w=928", "keywords": [], "authors": ["Bryn Sandberg"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/project-runway-returns-bravo-lifetime-1111591/", "title": "‘Project Runway’ Returning to Bravo", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The reality TV series most recently aired on Lifetime.", "news_keywords": "Project Runway", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Bryn Sandberg", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1111591, "title": "'Project Runway' Returning to Bravo", "published_at": "2018-05-14 08:31:38", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/gettyimages-844128302-embed.jpg?w=928", "comment_count": 0, "tags": "Project Runway", "topics": "TV News", "body": "Project Runway is returning to its original home on Bravo.\r\nThe fashion design reality television series is moving back to the NBCUniversal-owned network for its upcoming 17th season. Starting in 2004, the competition series aired its first five seasons on Bravo before moving to A+E Network's Lifetime in 2008.\r\nAndy Cohen announced the news Monday during NBCUniversal’s upfront presentation at Radio City Music Hall in New York. \"Project Runway is coming back where it all started,\" he said onstage. \"It's coming home on Bravo.\"\r\n\"We are beyond excited to reboot Project Runway at the network where it all began. Leaning into the creative process in an entertaining way has always been part of Bravo's DNA, and Project Runway perfectly captures that,\" said Frances Berwick, president of Lifestyle Networks at NBCUniversal Cable Entertainment. \"This franchise will be an important cornerstone to complement Bravo's original premium scripted and unscripted slate, and we expect it to drive the same level of fandom and passion as we experienced last time it was on Bravo.\"\r\nProject Runway returns to Bravo through an agreement between Bravo Media LLC and Lantern Entertainment LLC, whose bid to acquire the assets of The Weinstein Co. (which includes Project Runway) was approved by the Delaware bankruptcy court on May 8. The deal is subject to Lantern closing that acquisition. In addition, Bravo and Lantern have agreed to develop other unscripted projects for Bravo and other networks in the NBCUniversal Cable Entertainment portfolio.\r\nIn October, Harvey Weinstein was removed as an executive producer, with Project Runway host Heidi Klum speaking out: “I wish I could say that the horrible stories I read about Harvey Weinstein are a rare occurrence in our society, but that is simply not the case. We would be naive to think that this behavior only happens in Hollywood.”\r\n\"As we anticipate formally completing the acquisition process, the opportunity to return Project Runway to its original home at Bravo and foster a long-term and productive partnership with NBCUniversal Cable Entertainment is an exciting first step for Lantern Entertainment,\" added co-presidents Andy Mitchell and Milos Brajovic. \"We share Bravo's enthusiasm to reinvigorate the series and are incredibly grateful for everyone who has had a hand in making Project Runway the flagship franchise that it is today.\"", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Project Runway’ Returning to Bravo", "url": "https://www.hollywoodreporter.com/tv/tv-news/project-runway-returns-bravo-lifetime-1111591/", "description": "The reality TV series most recently aired on Lifetime.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/gettyimages-844128302-embed.jpg?w=928", "width": 928, "height": 619}, "locale": "en_US"}, "article": {"published_time": "2018-05-14T08:31:38+00:00", "modified_time": "2018-05-14T12:38:57+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Project Runway’ Returning to Bravo", "description": "The reality TV series most recently aired on Lifetime.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/gettyimages-844128302-embed.jpg?w=928"}}, "movies": [], "publish_date": 1526286698.0, "source": "https://www.hollywoodreporter.com", "summary": ""}