{"url": "https://www.thesun.co.uk/fabulous/7837277/prince-harry-meghan-markle-romance-in-pictures-anniversary-engagement/", "text": "IT'S the ultimate fairy tale romance - the glamorous American actress marries the handsome British prince.\n\nPrince Harry and Meghan Markle announced their engagement a year ago today and a whole lot has happened since then.\n\n25 Meghan Markle and Prince Harry are celebrating the wedding anniversary of their engagement announcement today Credit: Reuters\n\nThe couple revealed that Harry had proposed on November 27, 2017, just over a year after Kensington Palace first confirmed their relationship.\n\nMeghan, 37, and 34-year-old Harry married at St George's Chapel, Windsor Castle on May 19.\n\nThey're now expecting their first child together, due in spring.\n\nHere, we take a look back at the pair's love story so far...\n\n25 The couple met through mutual friend Markus Anderson, herewith Meghan Credit: Instagram\n\nThe spooning bananas\n\nGlamorous Meghan first met Harry in 2016, after being introduced by mutual friend Markus Anderson at central London's Soho House in early June.\n\nReports claim that Harry - who had 'lusted' after Meghan's Suits character Rachel Zane for two years - was immediately smitten and besieged the American with texts until she agreed to a date.\n\nThe pair met in London several times, with Meghan papped in the Royal Box at Wimbledon, and in Los Angeles after Harry treated her to a weekend at his best friend’s house in the Hollywood Hills.\n\n25 Meghan posted an Instagram snap in which she wore a blue beaded bracelet identical to one of Prince Harry's Credit: Instagram\n\n25 Harry was pictured wearing the same bracelet as Meghan during a summer trip to Africa Credit: Getty - contributor\n\nIn October, the first hint that the couple were dating emerged when Meghan posted a snap on Instagram of her wearing a blue beaded bracelet.\n\nHarry was pictured wearing the same bracelet during his summer trip to Africa, where he reportedly picked it up.\n\nAfter that, the trinket rarely left Meghan's wrist.\n\nOn November 1, 2016, Meghan uploaded a cryptic Instagram post featuring a picture of two canoodling bananas, with the caption: \"Sleep tight xx\".\n\n25 The actress uploaded a cryptic Instagram post featuring a picture of two canoodling bananas Credit: Instagram\n\nIt's official\n\nHarry confirmed their relationship on November 8, 2016 - and made an unprecedented appeal via Kensington Palace for them to be left in peace.\n\nRoyal fans took that as a sign of how serious it is between the pair, with a pal confirming it had \"moved very fast and they can't bear to be apart\".\n\nKensington Palace has issued a statement this morning about the harassment currently being experienced by Meghan Markle and her family. pic.twitter.com/EuFZ4fmUIj — The Prince and Princess of Wales (@KensingtonRoyal) November 8, 2016\n\nThat awkward moment in Antigua…\n\nDuring an official visit to the Caribbean nation on November 21, 2016, Prime Minister Gaston Browne teased Harry by announcing: \"I believe we are expecting a new princess soon.\n\n\"I want know that you are very welcome to come on your honeymoon here… there will be nowhere in the world as special to spend your honeymoon, when that day arrives.\"\n\nApparently the Prince was \"clearly embarrassed\" and \"went bright red\". Aww.\n\n25 Antigua's Prime Minister Gaston Browne teased Harry that he was soon expecting a new princess Credit: Paul Edwards - The Sun\n\nPublic dates\n\nIn December 2016, we brought you the first pictures of the loved-up pair strolling through London on their way to West End show The Curious Incident of the Dog in the Nighttime.\n\nThe day before, they were reportedly spotted buying their first Christmas tree together in south London.\n\nIn January, the couple enjoyed a romantic first holiday together after Harry whisked Meghan to Norway to see the Northern Lights.\n\n25 Meghan had met the Duke and Duchess of Cambridge by January 2017 Credit: Getty - contributor\n\nMeeting the family\n\nHarry was reported to have gained the blessing of Meghan's dad Thomas before the pair went public.\n\nOn January 15, 2017, Harry introduced Meghan to the Duchess of Cambridge and Princess Charlotte at Kensington Palace.\n\nIn March she joined Harry at his mate's wedding in Montego Bay, Jamaica, where he was an usher.\n\nBut onlookers said THEY were the couple behaving most like honeymooners...\n\nWedding bells?\n\nSuggestions that the couple were soon to tie the knot were ramped up a gear when Meghan shut down her lifestyle website The Tig after nearly three years.\n\nHaving described it as her \"passion project\", reports stated that the actress's decision was related to her busy filming schedule and humanitarian work.\n\n25 Meghan and Harry were spied having a smooch in the car park at the polo in Ascot Credit: Paul Edwards - The Sun\n\nThe car park clinch\n\nWhile Harry took part in the annual Audi Polo Challenge in Ascot, Meghan was snapped planting a smacker on his cheek in the car park.\n\nThe same weekend she was spotted cheering on her man from the sidelines.\n\nHarry's desperate dash\n\nDespite being invited, Meghan was notably absent from Pippa Middleton's wedding to James Matthews in May 2017, apparently to avoid upstaging the bride.\n\nBut clearly keen to have his girlfriend by his side, Harry made a 100-mile round trip to pick her up from Kensington Palace and escort her to the party at the Middleton’s home in Bucklebury.\n\nNow, that's romance.\n\n25 Desperate for his girlfriend to be by his side at Pippa Middleton and James Matthews' wedding, Harry made a 100-mile round trip to pick her up Credit: Darren Fletcher - The Sun\n\nThe crown jewels\n\nIn June 2017 it was reported that Harry gave Meghan a gold ring - which turned out to be too big, so she wore it on her thumb.\n\nHe previously gifted her a Cartier Love bracelet, a Maya Brenner necklace with the initials \"M\" and \"H\" and a gold arrow ring.\n\nThe birthday safari\n\nWith both sharing a mutual love of animals, Harry treated Meghan to a romantic African holiday for her 36th birthday in August 2017.\n\nHe was snapped putting a protective arm around his girl as they arrived, while she carried a gift from him swathed in bubble wrap.\n\n25 Harry whisked Meghan off for a romantic safari holiday in Botswana for her 36th birthday Credit: Louis Wood - The Sun\n\nA source said: \"Obviously he wants to show Meghan what an amazing place it is and create new memories together.\n\n\"Harry's done a lot of conservation work in Africa with endangered elephants and black rhinos and he'll show them to the woman he wants to marry.\"\n\nAnother pointed out that he wanted to \"associate August with something joyful\", referring to the anniversary of his mum Princess Diana's death.\n\nThat loved-up interview\n\nIn September 2017, Meghan opened up to Vanity Fair about being \"really happy and in love\" with her prince.\n\nShe confirmed they met in the summer of 2016 and dated quietly for six months.\n\n25 Meghan opened up to Vanity Fair magazine about her love for the prince Credit: Vanity Fair\n\nMeghan also said \"there will be a time\" when they're more prepared to share their life with the public but for now they want to keep things private.\n\nShe added: \"It's part of what makes it so special, that it's just ours. But we're happy. Personally, I love a great love story.\"\n\nSo do we!\n\n\n\nThe first official public appearance\n\nIn September 2017, Meghan joined Harry at the annual Invictus Games in Toronto, where she lived and filmed Suits.\n\nDespite the fact they sat 18 seats apart, she was spotted cheering on her fella during the opening ceremony.\n\n25 Meghan was spotted cheering on Harry at the Invictus Games opening ceremony Credit: Getty - contributor\n\nThe next day they sat together for a Wheelchair Tennis event - and the pictures spoke volumes.\n\nHarry even flew out Meghan's mum Doria 2,500 miles from LA to join them for the occasion – and planted an affectionate kiss on his girlfriend's cheek while watching the closing ceremony.\n\n25 The intimate couple were pictured together at a Wheelchair Tennis event Credit: Getty Images - Getty\n\n25 The besotted pair seemed to only have eyes for each other Credit: Getty - contributor\n\nA big proposal\n\nIt was confirmed on November 27, 2017 that Harry and Meghan were engaged.\n\nMeghan said they were roasting a chicken when Harry got down on one knee at his home, Nottingham Cottage.\n\nIn their engagement interview, she explained: \"[It was] just an amazing surprise, it was so sweet and natural and very romantic. He got down on one knee.\n\n\"As a matter of fact I could barely let you finish proposing, I said: 'Can I say yes now?'\"\n\nHarry replied: \"She didn't even let me finish, she said: 'Can I say yes, can I say yes?' and then there were hugs and I had the ring... and I was like: 'Can I - can I give you the ring?'\"\n\n25 Meghan and Harry announced their engagement on November 27, 2017 Credit: Getty - Contributor\n\nThe first royal outing\n\nOn December 1, 2017, the couple made their first official appearance as an engaged couple.\n\nThey headed to Nottingham, where they greeted excited crowds ahead of a visit to a World Aids Day charity fair hosted by the Terrence Higgins Trust.\n\n25 The couple headed to Nottingham for their first royal engagement as an engaged couple Credit: Getty - Contributor\n\nCelebrating Christmas\n\nMeghan and Harry joined Prince William and Kate Middleton at the Royal Family's traditional Christmas Day service in Sandringham on December 25, 2017.\n\nMeghan also attended the Queen's Windsor Castle Christmas party for staff, in a sign that she'd effectively become a fully-fledged member of the Royal Family.\n\nA guest at the party said: \"She asked everyone she met their names and what they did. It was very natural.\"\n\n25 Meghan and Harry joined Prince William and Kate Middleton in Sandringham for the Royal Family's annual Christmas service Credit: Getty - Contributor\n\nThe wedding\n\nThe couple became husband and wife at St George's Chapel, Windsor Castle on May 19, 2018.\n\nMeghan looked stunning in an off-shoulder gown by Clare Waight Keller for Givenchy, which she paired with Queen Mary's diamond bandeau tiara.\n\n25 Meghan and Harry married on May 19, 2018 Credit: Getty - Contributor\n\nHer father Thomas was unable to make the ceremony, leaving Prince Charles to walk her part of the way down the aisle.\n\nHowever, her mother Doria watched on proudly.\n\nThe newlyweds sealed the deal with a kiss outside the church before embarking on a carriage ride around Windsor.\n\n25 They kissed for the crowds in front of St George's Chapel, Windsor Castle Credit: Getty - Pool\n\n25 The couple embarked on a carriage ride around Windsor Credit: Reuters\n\n25 Meghan changed into a Stella McCartney gown for the reception Credit: Getty - Contributor\n\nMeghan changed into a halterneck Stella McCartney dress for their reception at Frogmore House, which featured a royal dance-off and \"beer pong\" games.\n\nAfter the wedding, the pair were given the titles the Duke and Duchess of Sussex.\n\nVisiting the Emerald Isle\n\nMeghan and Harry embarked on their first official foreign trip as a married couple in July 2018.\n\nThey flew to Ireland, enjoying a short stay in Dublin.\n\nMeghan's Emerald Isle outfits came with eye-watering price tags - in the space 24 hours, the Duchess of Sussex wore an estimated total of £23,000 worth of designer labels.\n\n25 Meghan and Harry's first official trip abroad took them to Ireland Credit: Getty - Pool\n\nA baby announcement\n\nKensington Palace confirmed on October 15, 2018 that Harry and Meghan were expecting their first baby.\n\nA message on the Palace's official Twitter page read: \"Their Royal Highnesses The Duke and Duchess of Sussex are very pleased to announce that The Duchess of Sussex is expecting a baby in the spring of 2019.\n\n\"Their Royal Highnesses have appreciated all of the support they have received from people around the world since their wedding in May and are delighted to be able to share this happy news with the public.\"\n\nTheir Royal Highnesses The Duke and Duchess of Sussex are very pleased to announce that The Duchess of Sussex is expecting a baby in the Spring of 2019. pic.twitter.com/Ut9C0RagLk — The Prince and Princess of Wales (@KensingtonRoyal) October 15, 2018\n\nThe announcement followed weeks of fan speculation about a potential pregnancy.\n\nIt came as the couple landed in Australia for their first royal tour as husband and wife.\n\nHeading Down Under\n\nAs news broke of Meghan's pregnancy, she and Harry were jetting to the South Pacific for their first royal tour.\n\nIn a busy trip that lasted 16 days, the pair visited Australia, New Zealand, Fiji and Tonga. The tour coincided with the Invictus Games, of which Harry is patron.\n\nExcitingly, Meghan gave us our first glimpse of her blossoming baby bump.\n\n25 Meghan and Harry jetted to the South Pacific in October 2018 Credit: PA:Press Association\n\n25 The pair looked more loved-up than ever Credit: AFP or licensors\n\n25 We got our first glimpse of Meghan's baby bump Credit: Getty - Pool\n\nIn more royal news, the Queen 'thinks the word pregnant is vulgar' and prefers to say women are 'in the family way', reveals royal insider.\n\nMeghan 'is regarded as difficult and demanding by family and staff' - but there's 'no big fallout' with Kate Middleton, royal expert reveals.\n\nAnd Harry wore a bizarre sleep tracker ring as he arrived for two-day Zambia tour without Meghan.", "images": ["data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.7 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.9 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.3 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2022/10/cj-newlook-leggings.jpg?1665152899&strip=all&w=300&h=192&crop=1", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.thesun.co.uk/wp-content/uploads/2022/10/RF-COMP-ROYALS.jpg?strip=all&w=300&h=192&crop=1", "https://www.thesun.co.uk/wp-content/uploads/2022/10/cj-laundry-hackl.jpg?1665228443&strip=all&w=300&h=192&crop=1", "https://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.4 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.8 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.6 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2022/10/cj-mands-boots.jpg?1665222221&strip=all&w=300&h=192&crop=1", "https://www.thesun.co.uk/wp-content/uploads/2018/11/pmCOMPOSITEmegs2.jpg?strip=all&quality=100&w=750&h=500&crop=1", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead_mobile.svg", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.6 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.5 1\"%3E%3C/svg%3E"], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2018/11/pmCOMPOSITEmegs2.jpg?strip=all&quality=100&w=750&h=500&crop=1", "keywords": [], "authors": ["Anna Duff"], "canonical_link": "https://www.thesun.co.uk/fabulous/7837277/prince-harry-meghan-markle-romance-in-pictures-anniversary-engagement/", "title": "How Prince Harry fell for Meghan Markle: The story of their romance in pictures on the anniversary of their engagement", "meta_data": {"twitter": {"card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp,max-image-preview:large", "taboola": {"kicker": "SUITS YOU, SIR!", "headline": "Harry and Meghan: Their romance in pictures on their engagement anniversary", "image": {"medium": "https://www.thesun.co.uk/wp-content/uploads/2018/11/pmCOMPOSITEmegs2.jpg?strip=all&quality=100&w=300&h=192&crop=1", "large": "https://www.thesun.co.uk/wp-content/uploads/2018/11/pmCOMPOSITEmegs2.jpg?strip=all&quality=100&w=620&h=413&crop=1"}}, "parsely-post-id": 7837277, "google-site-verification": "C0q6rLPIDXHU7PcyZ9CmiFRLM46bbWgS4qxZ-woBItM", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "How Prince Harry fell for Meghan Markle: the story of their romance in pictures on the anniversary of their engagement", "url": "https://www.thesun.co.uk/fabulous/7837277/prince-harry-meghan-markle-romance-in-pictures-anniversary-engagement/", "description": "IT’S the ultimate fairy tale romance – the glamorous American actress marries the handsome British prince. Prince Harry and Meghan Markle announced their engagement a year ago today and…", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2018/11/pmCOMPOSITEmegs2.jpg?strip=all&quality=100&w=750&h=500&crop=1", "width": 750, "height": 500}, "locale": "en_GB"}, "article": {"published_time": "2018-11-27T17:45:57+00:00", "modified_time": "2018-11-27T18:43:16+00:00", "publisher": 161385360554578, "tag": "Meghan Markle, Prince Harry, Royal Family", "author": "https://www.facebook.com/Fabulous/", "content_tier": "free"}, "fb": {"app_id": 144647118961553, "pages": 8401947179}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "description": "As the couple mark a year since getting engaged, we look back at their love story", "keywords": "meghan markle, prince harry, pictures, anniversary", "news_keywords": "meghan markle, prince harry, pictures, anniversary", "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1543340757.0, "source": "https://www.thesun.co.uk", "summary": ""}