{"url": "https://variety.com/2018/music/news/grammy-chief-neil-portnow-announces-task-force-to-improve-female-advancement-1202684850/", "text": "In the wake of Recording Academy chief Neil Portnow’s ill-worded comments after the Grammy Awards Sunday night — in which he said female artists and executives need to “step up” — and a low number of female nominees and winners, the Academy has announced a new initiative that aims to “overcome the explicit barriers and unconscious biases that impede female advancement in the music community.” While details were scarce at press time — and a letter calling for Portnow’s resignation signed by a group of female music industry senior executives arrived just minutes after the announcement arrived — the organization promised more information in the coming weeks.\n\nPortnow’s letter follows in full:\n\n“To The Music Community…\n\n“After hearing from many friends and colleagues, I understand the hurt that my poor choice of words following last Sunday’s Grammy telecast has caused. I also now realize that it’s about more than just my words. Because those words, while not reflective of my beliefs, echo the real experience of too many women. I’d like to help make that right.\n\n“The Recording Academy is establishing an independent task force to review every aspect of what we do as an organization and identify where we can do more to overcome the explicit barriers and unconscious biases that impede female advancement in the music community. We will also place ourselves under a microscope and tackle whatever truths are revealed.\n\n“I appreciate that the issue of gender bias needs to be addressed in our industry, and share in the urgency to attack it head on. We as an organization, and I as its leader, pledge our commitment to doing that. We will share more information about the steps we are taking in the coming weeks.\n\n“Sincerely, Neil Portnow, President/CEO of the Recording Academy.”\n\nShortly after the show ended on Sunday night, Portnow replied to a Variety reporter’s question about how female artists, who garnered a very low number of nominations and wins, can move forward in years ahead.\n\n“[Women] who want to be musicians, engineers, producers, and want to be part of the industry on the executive level [need] to step up,” he said.\n\nThe outcry on social media was swift and unforgiving, and Portnow issued a statement early Tuesday morning walking back his comments. Yet those two words became a misleading focus of the real problem, which is the low number of female nominees on the ballot — despite an unprecedentedly diverse slate of nominees in terms of race and musical genre, and despite a powerful #MeToo-themed performance from Kesha and speech from Janelle Monae during the show.\n\nAs Variety noted shortly after the nominees were announced, female artists were significantly under-represented in the biggest categories.\n\nWhile three of the five new artist nominees were women — Alessia Cara, Julia Michaels and SZA — solo female artists received exactly two of the 15 total nominations in the other three categories, and even that came with a caveat: Michaels’ “Issues” was nominated for song, a songwriters’ award she would have shared with four other (male) writers. That’s unlike Lorde’s “Melodrama,” up for album, which is awarded to the artist. And though SZA, Cara and Ledisi had strong showings (with five, four and three nods, respectively), three men had five nominations, six men had four and 20 men had three.\n\nSeveral quick answers emerged when examining the situation. The biggest female artists and/or winners in recent years — Beyoncé, Adele, Rihanna, Taylor Swift, Pink, Kelly Clarkson — did not release albums in the eligibility period, although the latter three are nominated for individual songs. Hip-hop, which dominates the top categories, is indisputably ruled by male artists. Recent albums from Katy Perry and Lady Gaga underwhelmed critically and commercially. Miranda Lambert’s “The Weight of These Wings” was expected by some to receive an album nomination, but in another surprise, country music was absent from the top categories for only the second time in 24 years.\n\nYet other categories show how many women qualified for this year’s awards. Clarkson, Pink, Gaga and Kesha comprised four of the five nominees for Best Pop Solo Performance; Lana Del Rey was up for Best Pop Vocal Album. Cardi B, Kehlani and Ledisi scored rap or R&B noms; Alison Krauss and Maren Morris were nominated along with Lambert for country awards. Kesha, who has become a rallying figure against sexual assault for her ongoing lawsuit against former mentor/collaborator Dr. Luke, was nominated twice. And despite their high profiles, with the exception of Best New Artist, females have won relatively few big categories in the 2000s: Album of the Year winners were Adele, the Dixie Chicks, Norah Jones and Swift (and Krauss with Robert Plant); along with the above artists, Song and/or Record has gone to Beyonce, Alicia Keys, Lorde and Amy Winehouse.", "images": ["https://variety.com/wp-content/themes/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://variety.com/wp-content/uploads/2017/04/neil-portnow-grammys.jpg?w=1000", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://variety.com/wp-content/uploads/2017/04/neil-portnow-grammys.jpg?crop=0px%2C17px%2C1000px%2C557px&resize=681%2C383", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif"], "top_img": "https://variety.com/wp-content/uploads/2017/04/neil-portnow-grammys.jpg?w=1000", "keywords": [], "authors": ["Jem Aswad"], "canonical_link": "https://variety.com/2018/music/news/grammy-chief-neil-portnow-announces-task-force-to-improve-female-advancement-1202684850/", "title": "Grammy Chief Neil Portnow Announces Task Force to Improve ‘Female Advancement’", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://variety.com/wp-content/themes/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Grammy Chief Neil Portnow Announces Task Force to Improve 'Female Advancement'", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199, "pages": 12616252196}, "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202684850, "author": "Jem Aswad", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-02-01T15:52:23"}, "pmc-tag": "Grammy Awards,Neil Portnow,Recording Academy", "title": "Grammy Chief Neil Portnow Announces Task Force to Improve ‘Female Advancement’", "pageclass": "article", "pmc-vertical": "music,tv", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-primary-category": "News", "pmc-primary-vertical": "music", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress 6.0.2", "author": "Jem Aswad", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Variety", "application-name": "Variety", "ia": {"markup_url_dev": "https://variety.com/2018/music/news/grammy-chief-neil-portnow-announces-task-force-to-improve-female-advancement-1202684850/?ia_markup=1"}, "content_type": "Article", "post_id": 1202684850, "title": "Grammy Chief Neil Portnow Announces Task Force to Improve 'Female Advancement'", "published_at": "2018-02-01 15:52:23", "image": "https://variety.com/wp-content/uploads/2017/04/neil-portnow-grammys.jpg?w=1000", "comment_count": 3, "tags": "Recording Academy", "topics": "News", "appeared_in_print": "No", "body": "In the wake of Recording Academy chief Neil Portnow’s ill-worded comments after the Grammy Awards Sunday night — in which he said female artists and executives need to \"step up\" — and a low number of female nominees and winners, the Academy has announced a new initiative that aims to \"overcome the explicit barriers and unconscious biases that impede female advancement in the music community.\" While details were scarce at press time — and a letter calling for Portnow's resignation signed by a group of female music industry senior executives arrived just minutes after the announcement arrived — the organization promised more information in the coming weeks.\r\n\r\nPortnow's letter follows in full:\r\n\r\n\"To The Music Community…\r\n\r\n\"After hearing from many friends and colleagues, I understand the hurt that my poor choice of words following last Sunday’s Grammy telecast has caused. I also now realize that it’s about more than just my words. Because those words, while not reflective of my beliefs, echo the real experience of too many women. I’d like to help make that right.\r\n\r\n\"The Recording Academy is establishing an independent task force to review every aspect of what we do as an organization and identify where we can do more to overcome the explicit barriers and unconscious biases that impede female advancement in the music community. We will also place ourselves under a microscope and tackle whatever truths are revealed.\r\n\r\n\"I appreciate that the issue of gender bias needs to be addressed in our industry, and share in the urgency to attack it head on. We as an organization, and I as its leader, pledge our commitment to doing that. We will share more information about the steps we are taking in the coming weeks.\r\n\r\n\"Sincerely, Neil Portnow, President/CEO of the Recording Academy.\"\r\n\r\nShortly after the show ended on Sunday night, Portnow replied to a Variety reporter’s question about how female artists, who garnered a very low number of nominations and wins, can move forward in years ahead.\r\n\r\n“[Women] who want to be musicians, engineers, producers, and want to be part of the industry on the executive level [need] to step up,” he said.\r\n\r\nThe outcry on social media was swift and unforgiving, and Portnow issued a statement early Tuesday morning walking back his comments. Yet those two words became a misleading focus of the real problem, which is the low number of female nominees on the ballot — despite an unprecedentedly diverse slate of nominees in terms of race and musical genre, and despite a powerful #MeToo-themed performance from Kesha and speech from Janelle Monae during the show.\r\n\r\nAs Variety noted shortly after the nominees were announced, female artists were significantly under-represented in the biggest categories.\r\nWhile three of the five new artist nominees were women — Alessia Cara, Julia Michaels and SZA — solo female artists received exactly two of the 15 total nominations in the other three categories, and even that came with a caveat: Michaels’ “Issues” was nominated for song, a songwriters’ award she would have shared with four other (male) writers. That’s unlike Lorde’s “Melodrama,” up for album, which is awarded to the artist. And though SZA, Cara and Ledisi had strong showings (with five, four and three nods, respectively), three men had five nominations, six men had four and 20 men had three. \r\nSeveral quick answers emerged when examining the situation. The biggest female artists and/or winners in recent years — Beyoncé, Adele, Rihanna, Taylor Swift, Pink, Kelly Clarkson — did not release albums in the eligibility period, although the latter three are nominated for individual songs. Hip-hop, which dominates the top categories, is indisputably ruled by male artists. Recent albums from Katy Perry and Lady Gaga underwhelmed critically and commercially. Miranda Lambert’s “The Weight of These Wings” was expected by some to receive an album nomination, but in another surprise, country music was absent from the top categories for only the second time in 24 years.\r\nYet other categories show how many women qualified for this year’s awards. Clarkson, Pink, Gaga and Kesha comprised four of the five nominees for Best Pop Solo Performance; Lana Del Rey was up for Best Pop Vocal Album. Cardi B, Kehlani and Ledisi scored rap or R&B noms; Alison Krauss and Maren Morris were nominated along with Lambert for country awards. Kesha, who has become a rallying figure against sexual assault for her ongoing lawsuit against former mentor/collaborator Dr. Luke, was nominated twice. And despite their high profiles, with the exception of Best New Artist, females have won relatively few big categories in the 2000s: Album of the Year winners were Adele, the Dixie Chicks, Norah Jones and Swift (and Krauss with Robert Plant); along with the above artists, Song and/or Record has gone to Beyonce, Alicia Keys, Lorde and Amy Winehouse.", "fragment": "!", "og": {"type": "article", "title": "Grammy Chief Neil Portnow Announces Task Force to Improve ‘Female Advancement’", "url": "https://variety.com/2018/music/news/grammy-chief-neil-portnow-announces-task-force-to-improve-female-advancement-1202684850/", "description": "In the wake of Recording Academy chief Neil Portnow’s ill-worded comments after the Grammy Awards Sunday night — in which he said female artists and executives need to “step up” — and a…", "site_name": "Variety", "image": {"identifier": "https://variety.com/wp-content/uploads/2017/04/neil-portnow-grammys.jpg?w=1000", "width": 1000, "height": 636, "alt": "Neil Portnow Grammys"}, "locale": "en_US"}, "article": {"published_time": "2018-02-01T23:52:23+00:00", "modified_time": "2018-02-02T08:17:50+00:00"}, "twitter": {"site": "@variety", "creator": "@jemaswad", "card": "summary_large_image", "title": "Grammy Chief Neil Portnow Announces Task Force to Improve ‘Female Advancement’", "description": "Grammy Chief Neil Portnow Announces Task Force to Improve 'Female Advancement'", "image": "https://variety.com/wp-content/uploads/2017/04/neil-portnow-grammys.jpg?w=1000"}}, "movies": [], "publish_date": 1517529143.0, "source": "https://variety.com", "summary": ""}