{"url": "https://www.bustle.com/p/is-robby-single-after-bip-he-brought-a-lot-of-baggage-to-paradise-11857800", "text": "Bachelor In Paradise is all about giving second chances for former Bachelor and Bachelorette contestants, but sometimes it provides members of Bachelor Nation with a third chance as well. Robby Hayes' return to Paradise after his short-lived relationship with Amanda Stanton will have audiences wondering if the third time will be the charm for the Bachelor veteran, or if Robby is still single after Bachelor In Paradise.\n\nAfter being the runner-up on JoJo's season of The Bachelorette, the franchise has been on a mission to get Robby into a relationship. While his Bachelor In Paradise Season 4 relationship with Amanda Stanton seemed to be a positive sign for the social media influencer, the Twitter drama that followed shows that these two were simply not meant to be. The extended break-up involved subtweets about Disneyland annual passes and Amanda going on the record saying that \"I guess what I was so confused about is that it's been eight months, and I have obviously moved on with my life\" on an episode of Bachelor alum Dean Unglert's podcast Help! I Suck at Dating.\n\nWhile Robby's last visit to Bachelor In Paradise may have ended in months of Twitter drama, his second visit may go better. The promos for his arrival indicated that he quickly sets his sights on Jenna upon making his way into Paradise, but little does he know he's walking into the crosshairs of one of Paradise's most outspoken denizens — Jordan.\n\nRobby entered Bachelor In Paradise very late in the game, not showing up until the 2-part season finale, and he immediately set about making up for lost time. Robby didn't waste a minute trying to \"get a feel\" for the relationships already present in Paradise like the other residents of the beachside resort, and tried to kickstart a connection with no concern for Jordan. Robby, perhaps unknowingly, called his shot long before his arrival BiP aired when he retweeted a Twitter user that asked \"Is it me or is Jordan from Becca’s season a poor mans version of Robby?\"\n\nJenna was not about to leave Jordan for Robby, promptly telling him that her heart was taken. She even said to the cameras that she felt that going on a date with another dude would be \"taking a step back\" from her current relationship. Jenna was right. Jordan was a little nervous and went down the beach to tell Robby that he and Jenna were the real deal and to lay off her.\n\nLater, he asked Shushanna on a date and they seemed to have a good time with each other — especially because Shu didn't seem to know about any of the Amanda Stanton drama. Despite Cassandra trying to warn her, Shu seemed to still be into Robby, so they might leave Paradise as friends-with-benefits at the very least.\n\nThere's no indication that Shushanna or Robby are still hanging out together, though they'll likely give and update on the tell-all reunion special right after the finale. Hopefully, Robby will one day find what he's looking for. If that's love on national television, of course. Because if he was just looking for a little fame, sponsored content opps, and Instagram followers, he's already a winner.", "images": ["https://imgix.bustle.com/uploads/image/2018/9/10/59b6f5c2-4513-400b-adbc-cfd2fff9d115-rulebreakers_digitalad_1400x600_v2-1-1.jpg?w=414&h=177&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/9/27/416a87e4-62ab-4b53-902a-24e223594a50-164089_2179.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/10/3/3de56b0e-adf0-4513-8559-4775d762203c-sierra-michael-header001.jpeg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2018/9/11/c2ff4e40-df6e-4a33-838f-a244206d8456-screen-shot-2018-09-11-at-22852-pm.png?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/image/2022/10/4/0c4a197a-7d19-46be-a461-81b263dcd152-164090_3997.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2018/9/11/c2ff4e40-df6e-4a33-838f-a244206d8456-screen-shot-2018-09-11-at-22852-pm.png?w=800&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2022/10/5/e161b174-c882-4c81-8f46-3b1cc0867ade-163674_1140.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress"], "top_img": "https://imgix.bustle.com/uploads/image/2018/9/11/c2ff4e40-df6e-4a33-838f-a244206d8456-screen-shot-2018-09-11-at-22852-pm.png?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/is-robby-single-after-bip-he-brought-a-lot-of-baggage-to-paradise-11857800", "title": "Is Robby Single After 'BIP'? He Brought A Lot Of Baggage To Paradise", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image", "creator": "@JackOakLeaf"}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/is-robby-single-after-bip-he-brought-a-lot-of-baggage-to-paradise-11857800", "type": "article", "title": "Is Robby Single After 'BIP'? He Brought A Lot Of Baggage To Paradise", "description": "Bachelor In Paradise is all about giving second chances for former Bachelor and Bachelorette contestants, but sometimes it provides members of Bachelor Nation with a third chance as well. Robby Hayes' return to Paradise after his short-lived…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/9/11/c2ff4e40-df6e-4a33-838f-a244206d8456-screen-shot-2018-09-11-at-22852-pm.png?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "Bachelor In Paradise is all about giving second chances for former Bachelor and Bachelorette contestants, but sometimes it provides members of Bachelor Nation with a third chance as well. Robby Hayes' return to Paradise after his short-lived…"}, "movies": ["https://www.youtube.com/embed/cLeshg46UVo"], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}