{"url": "https://www.usatoday.com/story/life/entertainthis/2018/01/08/golden-globes-not-camera-telecast/1012134001/", "text": "2018 Golden Globes: 10 things you didn't see on the telecast\n\nShow Caption Hide Caption Stars show solidarity at Golden Globes The question on the red carpet for the 75th Golden Globe Awards was not “who are you wearing?” but rather “why are you wearing?” as most celebrities wore black in solidarity with sex harassment victims worldwide. (Jan. 8) AP\n\nDuring the Golden Globes, TV viewers saw Three Billboards Outside Ebbing, Missouri and Big Little Lies win four trophies each and heard Oprah Winfrey's stirring speech. But what happened away from the cameras Sunday night? We sat inside the Beverly Hilton and saw these 10 things that weren't on the telecast.\n\n1. Announcements encourage shorter speeches\n\nAfter Big Little Lies star Nicole Kidman's (relatively long) two-and-a-half minute acceptance speech, there are announcements during the commercial break for winners to \"please watch the teleprompter (when it says to wrap things up), because we want to make sure everyone gets to speak tonight.\" The Shape of Water director Guillermo del Toro ignores that advice, however, and talks over the music meant to play him off. \"It's taken 25 years, give me a minute!\" he proclaims.\n\n2. There are semi-public displays of affection\n\nAnd the winner for best hug of the night goes to... Saoirse Ronan! #goldenglobes #winner pic.twitter.com/xiKi1D5TnI — Carly Mallenbaum (@ThatGirlCarly) January 8, 2018\n\nAfter Dwayne Johnson's on-air presentation with his daughter, Golden Globe ambassador Simone Garcia Johnson, he hugs her and the two walk to the wings arm in arm. As Kidman and Keith Urban find their seats, they hold hands. During a commercial break, GLOW's Alison Brie and The Disaster Artist's Dave Franco share a sweet kiss from their table. Nominee Kevin Bacon stops texting from the ballroom to embrace Mystic River co-star Laurence Fishburne. After Lady Bird lead Saoirse Ronan's win, she and her friend hug and collapse on an after-party couch.\n\n3. The bar is busy all celebration long\n\nThe Golden Globe Awards is known for its open bar, which can at times be so lively that it drowns out the sound of those presenting. Among those who frequented the bar: Call Me By Your Name's Armie Hammer and Thor: Ragnarok director Taika Waititi, who practically skip and link arms on their way to get drinks; Ray Donovan actor Liev Schreiber, who switches from martini to espresso as the night wears on; actresses Sarah Paulson and Amanda Peet, who sip their beverages and share photos; and nominee Daniel Kaluuya who beat-boxes as he leads his Get Out co-stars to a standing table.\n\n4. Many stars step outside\n\nThe Globes' smoking deck is where celebrities from different shows and movies mingle. For example, Game of Thrones' Kit Harington chats with Joe Jonas, the future husband of his TV sister, Sophie Turner.\n\n5. Selfies are politely granted\n\nWhile many attendees are nominees and other talent, there are plenty of guests and fans, too. Naturally, selfies are often requested. Black-ish star Tracee Ellis Ross poses for one with an admirer who is wearing a dress from Ross' J.C. Penney line. I, Tonya actor Sebastian Stan says it's \"no problem\" for a passerby to snap a pic. And nominee Meryl Streep doesn't smile for a photo, but does listen to a guest who appears to tear up while talking to her.\n\n6. Stars are fans, too\n\nWinner Aziz Ansari makes a point to stop by the Twin Peaks table and compliment Kyle MacLachlan, and at an after-party, Stranger Things' Joe Keery approaches Seth Rogen to say he's a big fan.\n\n7. Trains are dodged\n\nKendall Jenner gets help with her lengthy dress: A man carries the tail for her before she changes into a shorter (also black) ensemble for after-parties. Mariah Carey announces that people nearby should \"Watch the train!\" as she and her long gown pass by.\n\n8. Standing ovations are delivered\n\nA decisive standing O for @Oprah’s #goldenglobes speech. Her third since taking the stage. pic.twitter.com/r6YmB6IPJ3 — Carly Mallenbaum (@ThatGirlCarly) January 8, 2018\n\nBarbra Streisand, Carol Burnett, Frances McDormand and Kirk Douglas all earn standing ovations when they take the mike, but Oprah is the only person to rouse audience members to their feet three times: when she walks onstage, in the middle of her speech and when she exits. The first applause is so lengthy, security has to ask that guests take their seats.\n\n9. Drake deejays an after-party\n\nDrake leaves the InStyle celebration to take control of the music at Netflix's soirée. The dance floor fills up when he plays the Yo Gotti hit Rake It Up.\n\n10. Winners get trophies engraved\n\nOnce the show is over, winners including Allison Janney, del Toro and James Franco head straight to the Hollywood Foreign Press after-party to get their names written on their awards. In Janney's case, dancing also goes down at the InStyle party.\n\nHere’s why no one talked about fashion on the Golden Globes red carpet Stars weren't asked who they were wearing, but why. A movement called Time's Up swept the carpet as stars donned black outfits to stand in solidarity. USA TODAY\n\nContributing: Bryan Alexander", "images": ["https://www.gannett-cdn.com/-mm-/ca41735d002b945e73424163e18774747e6e1d87/c=0-267-2876-1892/local/-/media/2018/01/08/USATODAY/USATODAY/636509848451193916-AFP-AFP-VZ3ZN.jpg?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://media.gannett-cdn.com/29906170001/29906170001_5704751305001_5704746564001-vs.jpg?pubId=29906170001", "https://media.gannett-cdn.com/29906170001/29906170001_5704815662001_5704813667001-vs.jpg?pubId=29906170001", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/ca41735d002b945e73424163e18774747e6e1d87/c=0-267-2876-1892/local/-/media/2018/01/08/USATODAY/USATODAY/636509848451193916-AFP-AFP-VZ3ZN.jpg?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Carly Mallenbaum"], "canonical_link": "https://www.usatoday.com/story/life/entertainthis/2018/01/08/golden-globes-not-camera-telecast/1012134001/", "title": "2018 Golden Globes: 10 things you didn't see on the telecast", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/entertainthis/2018/01/08/golden-globes-not-camera-telecast/1012134001/life/entertainthis", "theme-color": "#ffffff", "og": {"type": "article", "title": "2018 Golden Globes: 10 things you didn't see on the telecast", "description": "Offstage, stars shared selfies, hugs, drinks and smokes.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/ca41735d002b945e73424163e18774747e6e1d87/c=0-267-2876-1892/local/-/media/2018/01/08/USATODAY/USATODAY/636509848451193916-AFP-AFP-VZ3ZN.jpg?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "Offstage, stars shared selfies, hugs, drinks and smokes.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1515369600.0, "source": "https://www.usatoday.com", "summary": ""}