{"url": "https://www.nme.com/news/music/kelly-clarkson-when-i-was-really-skinny-i-wanted-to-kill-myself-2152904", "text": "Kelly Clarkson has spoken about depression, weight and body image in a new interview.\n\nThe singer – who won the first season of American Idol in 2002 – recently spoke to Attitude about the “dark time” in her early career, saying: “When I was really skinny, I wanted to kill myself. I was miserable, like inside and out, for four years of my life. But no one cared, because aesthetically you make sense.”\n\n“It was a very dark time for me,” Clarkson added. “I thought the only way out was quitting. I like wrecked my knees and my feet because all I would do is put in headphones and run. I was at the gym all the time.”\n\nAdvertisement\n\nClarkson went on to say that she realised things needed to change around the release of her third album ‘My December’ in 2007. “There’s a song on ‘My December’ called Sober. There’s this line ‘picked the weeds but kept the flowers’ and I just live my life by that because you are who you surround yourself with,” she said.\n\n“I was around some really negative people, and I got out of it because I had a lot of great people there too. It was a case of turning around, facing them and walking toward the light.”\n\nClarkson has since taken to social media to clarify her comments. “Just to clear something up. I wasn’t ever miserable because I had to be thin. I said I was miserable & as a result I became thin,” she tweeted.\n\n“I’ve never contemplated suicide because of my weight.I said people had no idea I was unhappy oddly enough because I appeared healthy,” the singer added.\n\nJust to clear something up. I wasn’t ever miserable because I had to be thin. I said I was miserable & as a result I became thin. https://t.co/N1uhyOWqMb — Kelly Clarkson (@kellyclarkson) October 24, 2017\n\nNOT TRUEI’ve never contemplated suicide because of my weight.I said people had no idea I was unhappy oddly enough because I appeared healthy https://t.co/Ddvumlrk5b — Kelly Clarkson (@kellyclarkson) October 24, 2017\n\nAdvertisement\n\nMeanwhile, Clarkson recently revealed that she refused a writing credit because she didn’t want her name next to Dr Luke’s. The producer (real name Lukasz Gottwald) has been embroiled in a legal dispute with Kesha since October 2014, when the singer filed a lawsuit citing “mental manipulation, emotional abuse and sexual assault”. He denies the allegations.\n\nIf you are experiencing problems, you can find help from suicide prevention charity SAVE. For more information and advice on eating disorders, visit BEAT.", "images": ["https://www.nme.com/wp-content/uploads/2017/02/GettyImages-630724032_kelly_clarkson_cancer_grammys_630.jpg", "https://www.nme.com/wp-content/uploads/2017/07/2017_kellyclarkson_getty_1000x635.jpg", "https://www.nme.com/wp-content/uploads/2020/01/logo-nme-white.svg", "https://www.nme.com/wp-content/uploads/2017/07/2017_kellyclarkson_getty_1000x635-696x442.jpg", "https://www.nme.com/wp-content/uploads/2019/11/logo-nme.svg"], "top_img": "https://www.nme.com/wp-content/uploads/2017/07/2017_kellyclarkson_getty_1000x635.jpg", "keywords": [], "authors": ["Luke Morgan Britton"], "canonical_link": "https://www.nme.com/news/music/kelly-clarkson-when-i-was-really-skinny-i-wanted-to-kill-myself-2152904", "title": "Kelly Clarkson: “When I was really skinny, I wanted to kill myself”", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Kelly Clarkson speaks about depression, weight and body image in a new interview, saying: \"When I was really skinny, I wanted to kill myself\"", "og": {"locale": "en_GB", "type": "article", "title": "Kelly Clarkson: \"When I was really skinny, I wanted to kill myself\"", "description": "Kelly Clarkson speaks about depression, weight and body image in a new interview, saying: \"When I was really skinny, I wanted to kill myself\"", "url": "https://www.nme.com/news/music/kelly-clarkson-when-i-was-really-skinny-i-wanted-to-kill-myself-2152904", "site_name": "NME", "image": {"identifier": "https://www.nme.com/wp-content/uploads/2017/07/2017_kellyclarkson_getty_1000x635.jpg", "width": 1000, "height": 635, "type": "image/jpeg"}}, "article": {"publisher": "https://www.facebook.com/nmemagazine/", "published_time": "2017-10-24T14:30:40+00:00"}, "author": "Luke Morgan Britton", "twitter": {"card": "summary_large_image", "creator": "@nme", "site": "@nme", "label1": "Written by", "data1": "Luke Morgan Britton", "label2": "Estimated reading time", "data2": "2 minutes"}, "generator": "WordPress 6.0.2"}, "movies": [], "publish_date": 1508855440.0, "source": "https://www.nme.com", "summary": ""}