{"url": "https://web.archive.org/web/20170429223034/http://the-handmaids-tale.wikia.com:80/wiki/Republic_of_Gilead", "text": "The Republic of Gilead, sometimes colloquially referred to as Gilead, is the authoritarian, theocratic regime that takes over the United States of America in The Handmaid's Tale. The regime can be seen as the overall main antagonist of the novel and the television adaptation.\n\nContents show]\n\nOrigins Edit\n\nThe origin of the Republic of Gilead is not entirely clear, mostly because all we know about it told from the perspective of Offred, who has limited knowledge or can be seen as an unreliable narrator. It would seem that Gilead originally began as far-right religious extremist groups in the US, who believed that America needed to be 'saved' from sin and corruption. According to the conference transcript given at the end of the novel, these coalesced into a single conspiracy which referred to itself as \"the Sons of Jacob\".\n\nEventually, they concocted an elaborate plan to take over the United States. They assassinated the President and Congress, pinning the blame on Islamist terrorists, and established marital law. In quick succession, the Constitution was suspended, online bank accounts frozen and all employed women fired from their jobs. Offred recalls that the entire coup happened so fast that the widespread emotion among the general population was bewilderment that it was really happening, stunned to see troops systematically clearing women out of businesses and places of employment. There were a few protest matches at first, but the government immediately responded with blunt, naked aggression, deploying battalions who shot to kill and exterminate, not to disperse. After the first protests were responded to with bullets, the population was too terrified to mount any further action..\n\nThe new government quickly began hunting down anyone they perceived as being 'unGodly' or a threat, including political activists, members of other religious groups and so on. Soon, the United States of America had ceased to exist and in its stead, the Republic of Gilead was born.\n\nGeography Edit\n\nIt isn't even entirely clear if Gilead exerts control over all of the continental United States - the events of The Handmaid's Tale take place in New England. Areas euphemistically termed \"Colonies\" exist, which have been ecologically contaminated - apparently due to a mixture of industrial pollution, chemical/radiological accidents, and chemical/possibly-nuclear warfare. Gilead sends condemned criminals to slave-labor on cleanup projects in the Colonies, which is essentially considered a death sentence.\n\nNot much is known about the international relations of Gilead, due to extreme media censorship. The novel mentions in passing that the overthrow of the United States by a totalitarian regime, understandably, resulted in a massive shakeup of the international political scene, with every country affected to greater or lesser degrees.\n\nRefugees from Gilead try to flee to Canada or to Europe, which are apparently still free societies which it does not exert influence over. Several \"Save the Women\" campaigns exist in England for former Handmaids who have managed to escape.\n\nSociety and Politics Edit\n\nLittle is known of how Gilead's government functions, though given it is named the 'Republic', it can be assumed they have a Senate or similar governing body. In the early years of Gilead, the leaders of Gilead were those who had helped or supported the regime as it came to power. Gilead has a strict class system and hierarchy, with everyone being assigned to a particular class and expected to fulfil certain roles. The high ranking men of Gilead who make decisions in regards to its politics and laws and so on are known as Commanders of the Faithful. The Eyes serve as Gilead's police force and spies. Guardians serve as bodyguards, security officers and personal drivers to Commanders, and the Angels serve as soldiers and can become high-ranking if they serve their country well.\n\nGilead is a patriarchal society, with only men being allowed to access education and hold positions of power and office. Women are regarded as second-class citizens - they cannot hold property or be employed, and must submit to the authority of men. They are not permitted to read or write (with an exception being the Aunts). As such, women are some of lowest ranking members of Gilead. The lowest class of women are probably Econowives, the wives of poor or low-ranking men. Wives are probably the highest ranking, though still oppressed. Unwomen and similar criminals or 'infidels' are not considered citizens at all.\n\nGilead is a strict, totalitarian regime, that bases its laws and customs around a very literal, fundamentalist interpretation of the Christian Bible, in particular the Old Testament. Hence, much of their teachings and laws are influenced by Biblical teachings (or Gilead's interpretation of them). The law is absolute in Gilead. Any rule-breaking or subversion must be reported and will be harshly punished. Criminals are often executed and their bodies displayed; the Eyes also use torture and other brutal interrogation tactics on their prisoners. All citizens must follow Gilead's religious beliefs. No other religion or belief system is tolerated; at the beginning of Gilead, those of different religions were forced to convert on pain of death or imprisonment. Jewish people - known as the 'Sons of Jacob' - were given the choice of converting or leaving for Israel, though it's implied those that chose to leave were actually killed in secret.\n\nExecution is referred to as 'Salvaging' and are held in public. With the execution of women, the condemned are hanged, with Handmaids being given the rope to hang the condemned together, thus sharing in the 'responsibility' of punishing the wicked. Those that aren't executed can be sent to the Colonies, where life is short and brutal. The Colonies are often polluted by rubbish and radioactive waste, and those sent to the Colonies are tasked with cleaning them up, eventually falling ill and dying an often slow, painful death. Some regard being sent to the Colonies as a fate worse than death.\n\nThe media and the news are heavily censored, and often include propaganda to promote the ideals and values of Gilead, whilst demonizing their enemies. As a result, it is difficult to obtain reliable information.\n\nKnown Classes Edit\n\nValues and Beliefs Edit\n\nGilead believes that their interpretation of the Bible is the absolute truth and that in order for people to achieve salvation and live a pure, Godly life, they must strictly follow the laws and teachings of the Bible, or rather Gilead's interpretation of it. To do otherwise means you are living in sin and must either repent, or be eradicated to prevent you from spreading your evil influence to others.\n\nWomen are believed to the 'lesser' sex, who should be subjugated to men. Women's main purpose is bearing and raising children, which is given particular emphasis due to the rampant infertility present in North America at the time. Women are not allowed to participate in the government, be educated, hold property or have a career.\n\nModesty and purity in all areas of life are greatly emphasised, particularly for women, who are believed to be more prone to weakness of character and sin. Abortion and contraception are considered some of the greatest sins. Doctors who performed abortions before Gilead's creation are executed. Adultery or fraternization is punishable by death for all involved. Homosexuality is considered a sin and a crime punishable by death, referred to as 'Gender Treachery'.\n\nThe \"Sons of Jacob\" that founded Gilead were essentially a junta of heterosexual white men who wanted to seize power for themselves in a totalitarian regime, using some warped trappings of Christian religion as propaganda. Some of their most entrenched enemies, however, are actually mainstream Christian denominations that view them as evil: Catholics abhor them for forcibly conscripting nuns to be sexually enslaved as Handmaids, and the novel makes some sporadic mention that Gilead's military is fighting a protracted insurgency by Baptist groups across the American south.\n\nGilead's leaders are largely just using women and minority groups as scapegoats because they can be easily discriminated against. They are also engaged in mass deportation of Jews from America to Israel, cramming them into cargo ships - though in practice many transport ships simply cut corners by dumping their holds once they reach the open sea, leaving them to drown by the hundreds. Gilead also discriminates against African Americans, whom they refer to in their adopted religious rhetoric as the \"Sons of Ham\".\n\nDespite their rhetoric, on a deep level the leaders of Gilead aren't really striving to create a utopia for all heterosexual white Protestant men - anymore than the Nazis of Germany in the 1930's wanted to create a free democratic utopia for all Germans. In truth, they are a fanatical hyper-nationalist junta that wanted to seize power purely for themselves.\n\nHistory Edit\n\nThe Early Gilead Period Edit\n\nThe historical source known as The Handmaid's Tale is described as coming from the \"Early Gilead period\".\n\nLater Gilead Edit\n\nSeveral characters who were alive during the timeframe of The Handmaid's Tale are described as dying during purges which occurred in the \"Middle Gilead Period\". By implication, there was also a \"Late Gilead Period\". It appears that Gilead existed on a scale of decades, but not of centuries.\n\nInspiration Edit\n\nAs Margaret Atwood has explained in various interviews, the \"Sons of Jacob\" and the \"Republic of Gilead\" they created cynically don't actually believe in their own religious propaganda - almost every member of Gilead in a position of power, such as the Commander, is at various points breaking the own rules or expressing that they are simply using this as rhetoric. Atwood didn't conceive of Gilead as a Christian totalitarian regime, but a totalitarian regime rising in the United States which happens to use some empty trappings of religion to justify itself.\n\nAtwood looked at the rise of various totalitarian regimes throughout history and concluded that it always rises around some central trappings of national identity, and that in her estimation, the national character of the United States has always been shaped by religious movements. Similarly, Nazi Germany used trappings of past rhetoric about prior Germanic empires like Charlemagne, or latched onto pre-existing discrimination policies against disempowered groups (Jews, Gypsies, homosexuals, etc.) - but fundamentally this was just a convenient scape-goat for what was at heart a hyper-nationalist junta that wanted to seize power for itself. Atwood tried to imagine what a totalitarian regime would look like if it took over the United States, and as the saying goes, \"When fascism comes to America, it will come carrying a cross and draped in the Stars and Stripes\".\n\nAtwood also said that Gilead was partially inspired by the Conservative reaction in the 1980's to the women's rights movements of the 1970's, during the Reagan administration years. Particularly, Atwood was reacting to large-scale but baseless propaganda being circulated by hard right-wing religious groups that abortion and contraception access was leading to a \"white genocide\", and that the birth-rate among white Americans was sharply declining - despite the fact that there wasn't a shred of evidence to support this, and census data proved it to be blatantly incorrect.", "images": ["https://web.archive.org/web/20170429223034im_/http://pixel.quantserve.com/pixel/p-8bG6eLqkH6Avk.gif", "https://web.archive.org/web/20170429223034im_/http://slot1.images.wikia.nocookie.net/__cb1493363863/common/extensions/wikia/WikiaBar/images/wikiabarIcon.png", "https://web.archive.org/web/20170429223034im_/http://a.wikia-beacon.com/__track/view?cb=1493363863&c=951918&lc=en&lid=75&x=thehandmaidstale&y=c6&u=0&a=2120&s=oasis&beacon=&n=0&nojs=1", "https://web.archive.org/web/20170429223034im_/http://b.scorecardresearch.com/p?c1=2&c2=6177433&c3=&c4=&c5=&c6=&c7=http%3A%2F%2Fthe-handmaids-tale.wikia.com%2Fwiki%2FRepublic_of_Gilead%3Fcomscorekw%3Dwikiacsid_books&c15=&cv=2.0&cj=1", "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D", "https://web.archive.org/web/20170429223034im_/http://slot1.images.wikia.nocookie.net/__cb1493363863/common/skins/common/images/wiki.png", "https://web.archive.org/web/20170429223034im_/http://vignette4.wikia.nocookie.net/the-handmaids-tale/images/8/89/Wiki-wordmark.png/revision/latest?cb=20170214000127"], "top_img": "https://web.archive.org/web/20170429223034im_/http://slot1.images.wikia.nocookie.net/__cb1493363863/common/skins/common/images/wiki.png", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20170429223034/http://the-handmaids-tale.wikia.com/wiki/Republic_of_Gilead", "title": "Republic of Gilead", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, user-scalable=yes", "generator": "MediaWiki 1.19.24", "keywords": "The Handmaid's Tale Wiki,thehandmaidstale,Republic of Gilead,The Handmaid's Tale (Novel),The Handmaid's Tale (TV series),Offred,Commander,The Eyes,Guardian,Angel,Econowife,Wife,Martha", "description": "The Republic of Gilead, sometimes colloquially referred to as Gilead, is the authoritarian...", "twitter": {"card": "summary", "site": "@getfandom", "url": "https://web.archive.org/web/20170429223034im_/http://the-handmaids-tale.wikia.com/wiki/Republic_of_Gilead", "title": "Republic of Gilead | The Handmaid's Tale Wiki | Fandom powered by...", "description": "The Republic of Gilead, sometimes colloquially referred to as Gilead, is the authoritarian, theocratic regime that takes over the United States of America in The Handmaid's Tale. The regime can be..."}, "fb": {"app_id": 112328095453510}, "og": {"type": "article", "site_name": "The Handmaid's Tale Wiki", "title": "Republic of Gilead", "description": "The Republic of Gilead, sometimes colloquially referred to as Gilead, is the authoritarian, theocratic regime that takes over the United States of America in The Handmaid's Tale. The regime can be seen as the overall main antagonist of the novel and the television adaptation. The origin of the Republic of Gilead is not entirely clear, mostly because all we know about it told from the perspective of Offred, who has limited knowledge or can be seen as an unreliable narrator. It would seem that...", "url": "https://web.archive.org/web/20170429223034/http://the-handmaids-tale.wikia.com/wiki/Republic_of_Gilead"}, "apple-itunes-app": "app-id=422467074, app-arguments=http://the-handmaids-tale.wikia.com/wiki/Republic_of_Gilead"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}