{"url": "https://www.usatoday.com/story/life/people/2017/12/05/terry-crews-sues-hollywood-agent-he-says-groped-him/925510001/", "text": "Terry Crews sues Hollywood agent he says groped him\n\nShow Caption Hide Caption Terry Crews files assault and battery lawsuit against WME 'Brooklyn Nine-Nine' star Terry Crews has filed an assault and battery lawsuit against WME and agent Adam Venit, who Crews claims violated him at a party in Hollywood in 2016. USA TODAY\n\nTerry Crews is suing the Hollywood agent he accused of groping him last year at an industry event.\n\nAfter filing a complaint with the LAPD last month, Crews has launched a lawsuit against William Morris Endeavor agent Adam Venit for assault, battery and sexual harassment, among other charges. He is also suing the talent agency.\n\nAfter Crews made his allegation public on Twitter in October (though not naming Venit specifically), the former motion picture head was identified in trade publications and suspended from WME. Venit returned to the company in a demoted role about a month later.\n\nMore: Terry Crews opens up about alleged assault: 'I have never felt more emasculated'\n\nThe \"blatant\" groping occurred on Feb. 4, 2016, according to the complaint obtained by USA TODAY, at an industry event hosted by Adam Sandler.\n\nHaving never met the Brooklyn Nine-Nine actor previously, \"Venit stared at Crews intently, like a rabid dog, sticking his tongue in and out of his mouth provocatively,\" according to the suit.\n\nWhat followed was allegedly physical. \"Venit, upon his first meeting Crews, viciously grabbed Crews’ penis and testicles so hard that it caused Crews immediate pain.\"\n\nThe suit says Crews shoved Venit back \"knocking him into several people who were standing nearby\" causing the actor to yell out. But Venit \"continued to leer at Crews, provocatively wagging his tongue again, and then grabbed and squeezed Crews’ genitals again.\" Crews states he asked the nearby Sandler, with whom he had appeared in several films, for help.\n\n\"Sandler shook his head at Venit in disbelief,\" reads the suit, and later called the actor to see if he was OK. The next day, Venit called Crews to apologize, saying he was not himself.\n\nMore: Terry Crews shares story of sexual assault, receives praise from fellow celebs\n\nCrews, a WME client before he formally left the company in mid-November, says he informed his agent at the company the next day, but the agency took little action \"likely because Venit is a significant moneymaker for WME.\"\n\nVenit's client roster includes several Hollywood names who have been accused of harassment, including Sylvester Stallone, Casey Affleck, Brett Ratner and Dustin Hoffman. He also represents Sandler and Eddie Murphy.\n\nList: All of the Hollywood power players accused of sexual assault or harassment\n\nThe suit also alleges that \"WME agents are knowingly permitted and encouraged to engage in sexually predatory conduct in the assertion of their power and clout over persons similarly-situated to Crews.\"\n\nCrews says he suffered actual pain as well as psychological issues. He is asking for punitive and exemplary damages.", "images": ["https://www.gannett-cdn.com/-mm-/32b91eda7cac4e393b689ebe26df5c2e54b89d50/c=0-438-1992-1564/local/-/media/2017/11/15/USATODAY/USATODAY/636463347966122722-GTY-855607116-94202943.JPG?auto=webp&format=pjpg&width=1200", "https://media.gannett-cdn.com/29906170001/29906170001_5669333559001_5669317315001-vs.jpg?pubId=29906170001", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/32b91eda7cac4e393b689ebe26df5c2e54b89d50/c=0-438-1992-1564/local/-/media/2017/11/15/USATODAY/USATODAY/636463347966122722-GTY-855607116-94202943.JPG?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Andrea Mandell"], "canonical_link": "https://www.usatoday.com/story/life/people/2017/12/05/terry-crews-sues-hollywood-agent-he-says-groped-him/925510001/", "title": "Terry Crews sues Hollywood agent he says groped him", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/people/2017/12/05/terry-crews-sues-hollywood-agent-he-says-groped-him/925510001/life/people", "theme-color": "#ffffff", "og": {"type": "article", "title": "Terry Crews sues Hollywood agent he says groped him", "description": "On Tuesday, Crews filed a lawsuit against power agent Adam Venit.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/32b91eda7cac4e393b689ebe26df5c2e54b89d50/c=0-438-1992-1564/local/-/media/2017/11/15/USATODAY/USATODAY/636463347966122722-GTY-855607116-94202943.JPG?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "On Tuesday, Crews filed a lawsuit against power agent Adam Venit.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1512432000.0, "source": "https://www.usatoday.com", "summary": ""}