{"url": "http://wikinetworth.com/businessman/matt-altman-wiki-age-wedding-wife-twins-family-net-worth-height.html", "text": "Matt Altman is the star of the Bravo TV’s reality show Million Dollar Listing. He is the successful luxury real estate agent in various high profile venues like Beverly Hills and Holmby Hills. The American businessman co-founded the real estate firm, The Altman Brothers in 2002, which has sold luxury properties worth $2.5 billion. With the booming business, the real estate agent is recently blessed with twin children.\n\nMatt Altman is the star of the Bravo TV’s reality show Million Dollar Listing. He is the successful luxury real estate agent in various high profile venues like Beverly Hills and Holmby Hills. The American businessman co-founded the real estate firm, The Altman Brothers in 2002, which has sold luxury properties worth $2.5 billion. With the booming business, the real estate agent is recently blessed with twins.\n\nHow Does Matt Summons Net Worth?\n\nMatt Altman has derived his vast net worth mainly as a real estate agent for various firms as well as a talent agent in leading company. He is enjoying his lavish lifestyle by selling luxury properties to the millionaires and celebrities in Los Angeles, Beverly Hills, Holmby Hills, and Bel Air. His real estate firm sold over $60 million in properties across the nation in 2011. Along with his firm The Altman Brothers, he is also an active broker at Douglas Elliman Real Estate since February 2015.\n\nMatt's business partner and brother, Josh Altman, age 39, has a net worth of $20 million. Their expensive sale on Ocean Dr. for $10.5 million was rated highest deal in the history of Santa Monica for a condo. The witty brothers sold 72 Beverly Hills Park for $16.5 million, which was the sixth largest sale in LA County in 2010.\n\nThe former Hilton and Hyland brokers came into massive limelight when Peter Kliedman sued the real estate brothers for $3.7 million alleging that the brothers made fraud deal and made an illegal profit of at least 10 million. He claimed that he had to file for the bankruptcy as the brothers made a fortune out of his property.\n\nMatt has also gathered massive wealth as a talent agent in the most reputed companies like Creative Artists Agency (CAA) and The Gersh Agency in Beverly Hills, before joining real estate business. He is also a famous cast member on the Bravo TV’s reality series Million Dollar Listing.\n\nMatt Enjoys Married Life As Father Of Twins\n\nApart from the succesful business, the Bravo star is equally fortunate regarding family life. He enjoys a romantic relationship with his girlfriend-turned-wife, Johanna Sicat. She is an associate broker at PLG Estate. The lovebirds exchanged the wedding vows on 12 August 2017 in Beverly Hills. The hasty couple quickly doubled their family of two into four in less than a year.\n\nMatt with his wife Johanna and twin kids on 16th May 2018 (Photo: Instagram)\n\nThe couple is now parents to adorable twins born on 15th and 16th May 2018. They named their baby daughter, London and baby boy, Ashton. In a picture shared by the real estate agent on 16th May 2018, his beautiful wife is seen holding her babies by chest lying down on a hospital bed.\n\nMatt had been planning for the arrival of his kids for a long time. He posted an Instagram pic of two pairs of adorable shoes for his twin kids in New year of 2018.\n\nShort Bio\n\nMatt Altman was born to a Jewish family in Boston, Massachusetts. However, the details about his birthday are secluded. He holds an American nationality and belongs to Israeli-American ethnicity. The Los Angeles native stands with the nearly same height of his brother Josh, whose height is 1.75 m (5' 9'').\n\nMatt graduated with a Bachelor's Degree in Journalism and mass communications from the University of Colorado. Back then, he was placekicker in Colorado Buffaloes Football team. He is inclined to cart, design, culture, and architecture and resides in Los Angeles with his wife and twin kids.", "images": ["https://wikinetworth.com/uploads/matt-altman1.jpg", "http://wikinetworth.com/uploads/matt%20Altman.JPG", "https://wikinetworth.com/userfiles/images/wn/wiki-logo.png", "https://wikinetworth.com/userfiles/images/wn/fav-icon.png", "https://wikinetworth.com/frontend/images/socialmedia/popup.png", "https://images.dmca.com/Badges/dmca_protected_sml_120f.png", "https://wikinetworth.com/userfiles/images/wn/wn-mobile-text-logo.png"], "top_img": "https://wikinetworth.com/uploads/matt-altman1.jpg", "keywords": [], "authors": ["Wn Writer"], "canonical_link": "https://wikinetworth.com/businessman/matt-altman-wiki-age-wedding-wife-twins-family-net-worth-height.html", "title": "Matt Altman Wiki: Age, Wedding, Wife, Twins, Family, Net Worth, Height", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "twitter": {"card": "summary_large_image", "site": "wikinetworth", "creator": "@wikinetworth", "title": "Matt Altman Wiki: Age, Wedding, Wife, Twins, Family, Net Worth, Height", "description": "Find more about Matt Altman's wiki, age, wedding, wife, twins, family, net worth, and height. Matt Altman is the star of the Bravo TV’s reality show Million Dollar Listing. He is the successful luxury real estate agent in various high profile ve", "image": "https://wikinetworth.com/uploads/matt-altman1.jpg"}, "og": {"site_name": "wikinetworth", "type": "blog", "locale": "en_US", "title": "Matt Altman Wiki: Age, Wedding, Wife, Twins, Family, Net Worth, Height", "url": "https://wikinetworth.com/businessman/matt-altman-wiki-age-wedding-wife-twins-family-net-worth-height.html", "description": "Find more about Matt Altman's wiki, age, wedding, wife, twins, family, net worth, and height. Matt Altman is the star of the Bravo TV’s reality show Million Dollar Listing. He is the successful luxury real estate agent in various high profile ve", "image": {"identifier": "https://wikinetworth.com/uploads/matt-altman1.jpg", "secure_url": "https://wikinetworth.com/uploads/matt-altman1.jpg"}}, "google-site-verification": "wz9L4Xrb4KcYidM8zhr7TwrMnCxXjxmIPTQNLI8cgMM", "robots": "all", "description": "Find more about Matt Altman's wiki, age, wedding, wife, twins, family, net worth, and height. Matt Altman is the star of the Bravo TV’s reality show Million Dollar Listing. He is the successful luxury real estate agent in various high profile ve"}, "movies": [], "publish_date": null, "source": "http://wikinetworth.com", "summary": ""}