{"url": "https://hellogiggles.com/reviews-coverage/movies/sophia-vush-voyd-interview-incredibles/", "text": "For many, famous celebrity or not, voicing a character in a Pixar movie is a bucket list item. It’s a dream goal that really means you’ve made it, because the animation wizards behind some of our favorite characters are about to turn you into one, too. While there’s a like a 2% chance it’ll happen to you and me (just speaking the truth), it does happen every now and then to our favorite stars — and when it does, you’re totally allowed to freak out.\n\nBecause that’s exactly what happened to Sophia Bush when she was cast in Incredibles 2 as a brand new dimension-altering super, Voyd.\n\nAhead of the anticipated sequel’s release, Bush sat down with HelloGiggles to talk about why Voyd is so important — not just to the movie, but everyone young and old. Oh, and also about how she absolutely lost her cool joining the Incredibles family.\n\nHelloGiggles: How excited are you to be a new superhero in The Incredibles?\n\nSophia Bush: This is the best thing ever. I am such a huge Pixar fan and The Incredibles has always been my favorite Pixar movie. To get this call, out of the blue, that they wanted me to be in the second one, was insane.\n\nHelloGiggles: You didn’t audition, they just called you?\n\nSB: Mm-hmm.\n\nHelloGiggles: What were your first feelings when that happened?\n\nSB: I was in public and I opened [the e-mail] and screamed really loud. I still have the PDF of it in my phone. [It had] The Incredibles family at the bottom and [it was on] Pixar letterhead. It’s very official and sweet. I opened it and I screamed and an entire restaurant full of people turned and looked at me, which was mortifying, but just so exciting. Kind of an out of body experience. This is a big bucket list thing for me and it happened.\n\nHelloGiggles: You voice Voyd, who’s a pretty awesome new character, and also quite complex. How exciting is it to play a female superhero?\n\nSB: She’s a badass…it’s so gratifying to watch a young woman learn how to step into her power, because she’s nervous in the beginning. By the end of the film she’s really figuring out what she’s capable of, and she’s doing it alongside Elastigirl, who’s been her inspiration her whole life, and that’s amazing.\n\nHelloGiggles: There’s a scene in the movie where Voyd fangirls over Elastigirl, and I was like, “I know I’ve definitely done that before.” Was that how you reacted meeting the whole Incredibles family in real life?\n\nSB: We didn’t all meet until we did our screening of the rough cut of the film in February. Because, you don’t record with anybody. It’s just you and [director] Brad [Bird]. I had to think about who Voyd is. You’ve always gotta figure out where a character’s coming from, and we live in a world today where…unfortunately still so many people are “othered,” whether it’s because of race, or gender, or sexual identity. A lot of people are sort of outcast for who they are, which is ironic because it’s your uniqueness that adds to the fabric of society in such a beautiful way.\n\nI thought about what it would be like for a little girl in a city or a town, where she doesn’t know anybody else who’s like her, who has powers, and there are these famous superheroes who she looks up to, and Elastigirl is her idol. And then, the supers are made illegal. This little girl’s parents say, “You have to hide who you are. You have to dim your light. You cannot tell anybody about your life.” It’s a terrible disservice to a human to deny them the right to their identity.\n\nHere’s this girl who is shrinking herself, figuring out how else to express herself. She has turquoise hair and a side shave. She’s getting radical somehow, someway. Suddenly there’s a movement and maybe she’s going to be, for the first time in her life, accepted by society for who she is, as she is. She walks into a room that could change the course of her existence, and meets the woman who her whole life made her feel like someday things would be okay.\n\nThat’s why I think the movie, in general, is so relatable, because this is a story about family, community, service, activism, identity, welcoming people into society rather than excommunicating them.\n\nHelloGiggles: How excited are you to see little girls dressing up as Voyd?\n\nSB: I honestly will not be able to handle it. I will never recover. It’ll be great. I will be an emotional mess. It was actually really sweet. My girlfriend, Hilarie [Burton], texted me the day that we announced it and then she put it on Twitter because it was such a funny moment, but she was like, “Does this mean I get to dress up as you for Halloween?” I was like, “Oh my God.” I hadn’t even thought of it yet.\n\nHelloGiggles: Did you come up with an elaborate backstory for her, and did that influence anything while you were recording?\n\nSB: No, because you don’t get a script. You show up the day you’re going to record and they show you some things and then Brad shows you the scenes. They want it to be really fresh and spontaneous, which I love. When [Brad] said she’s her ultimate fan, I started to think about what that meant. I started to think about what we knew from the first film, the way that they were publicized, the way that they were in the news, the way that this was a whole big hullabaloo when they got outcast from society. I didn’t want to put a bunch of stuff on her that would then not fit with the film. I knew that would fit, and then it felt right. The biggest indicator, to me, about her identity and her desire to express herself and be who she is was her hair.\n\nHelloGiggles: How do you feel that you’re now part of this and so many people are going to see your contribution to the film?\n\nSB: It’s such a phenomenal film. It’s such a story for everyone, for all people, about family, and belonging, and what service means, and what self sacrifice means, and what purpose means. To look at Helen and Bob [Parr] figuring out what their purpose is. How did they identify? How do they feel whole? How do they feel fulfilled? These are stories that any person can relate to, whether you’re a kid, a parent, you don’t have kids, you’re 15, you’re 25, you’re 85. Every single person can watch this movie and go, “That’s me.”", "images": ["https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/jojo-siwa-1.jpg?quality=82&strip=all&w=183&h=133&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Taylor-Swift.jpg?quality=82&strip=all&w=183&h=133&crop=1", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' width='198' height='178'%3E%3C/svg%3E", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Serena-Williams-Olympia.jpg?quality=82&strip=all&w=198&h=178&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Taylor-Swift.jpg?quality=82&strip=all&w=198&h=178&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2018/06/14/voyd.jpg?quality=82&strip=1&resize=640%2C360", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Woman-Reading-Outside.jpg?quality=82&strip=all&w=183&h=133&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/easy-fall-cocktails-1.jpg?quality=82&strip=all&w=183&h=133&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Zooey-Deschanel.jpg?quality=82&strip=all&w=198&h=178&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/happy-woman-smiling-fall-leaves-1.jpg?quality=82&strip=all&w=198&h=178&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Dog-Halloween-Costume.jpg?quality=82&strip=all&w=183&h=133&crop=1", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' width='183' height='133'%3E%3C/svg%3E", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Serena-Williams-Olympia.jpg?quality=82&strip=all&w=183&h=133&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/happy-woman-smiling-fall-leaves-1.jpg?quality=82&strip=all&w=183&h=133&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/jojo-siwa-1.jpg?quality=82&strip=all&w=198&h=178&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2018/06/14/pixar-2000.jpg", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/easy-fall-cocktails-1.jpg?quality=82&strip=all&w=198&h=178&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Woman-Reading-Outside.jpg?quality=82&strip=all&w=198&h=178&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Dog-Halloween-Costume.jpg?quality=82&strip=all&w=198&h=178&crop=1", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20width='2000'%20height='1111'%3E%3C/svg%3E", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Zooey-Deschanel.jpg?quality=82&strip=all&w=183&h=133&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2018/06/14/voyd.jpg?quality=82&strip=all"], "top_img": "https://hellogiggles.com/wp-content/uploads/sites/7/2018/06/14/voyd.jpg?quality=82&strip=all", "keywords": [], "authors": ["Rachel Paige"], "canonical_link": "https://hellogiggles.com/sophia-vush-voyd-interview-incredibles/", "title": "Sophia Bush Started Screaming When She Was Cast in \"Incredibles 2\"", "meta_data": {"viewport": "width=device-width", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Ahead of the release of \"Incredibles 2,\" HelloGiggles sat down with Sophia Bush who plays a brand new super, Voyd. If you think you're excited for the movie, Sophia can't contain her excitement.", "og": {"locale": "en_US", "type": "article", "title": "Sophia Bush Started Screaming When She Was Cast in \"Incredibles 2\"", "description": "Ahead of the release of \"Incredibles 2,\" HelloGiggles sat down with Sophia Bush who plays a brand new super, Voyd. If you think you're excited for the movie, Sophia can't contain her excitement.", "url": "https://hellogiggles.com/sophia-vush-voyd-interview-incredibles/", "site_name": "HelloGiggles", "image": {"identifier": "https://hellogiggles.com/wp-content/uploads/sites/7/2018/06/14/voyd.jpg?quality=82&strip=all", "width": 1366, "height": 768, "type": "image/jpeg"}}, "article": {"published_time": "2018-06-14T13:00:21+00:00", "modified_time": "2022-09-17T03:42:48+00:00"}, "author": "rachel paige", "twitter": {"card": "summary_large_image", "label1": "Written by", "data1": "rachel paige", "label2": "Est. reading time", "data2": "6 minutes"}, "msapplication-TileColor": "#b58c2c", "msapplication-TileImage": "https://hellogiggles.com/wp-content/themes/hello-giggles/favicon/ms-icon-144x144.png", "msapplication-config": "https://hellogiggles.com/wp-content/themes/hello-giggles/favicon/browserconfig.xml", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1528981221.0, "source": "https://hellogiggles.com", "summary": ""}