{"url": "https://www.celebritynetworth.com/richest-businessmen/reza-farahan-net-worth/", "text": "What is Reza Farahan's Net Worth and Salary?\n\nReza Farahan is an Iranian-American real estate agent and reality television star who has a net worth of $7 million dollars. Farahan works at Keller Williams Realty, and he has starred on the Bravo reality TV series \"Shahs of Sunset\" since 2012. Reza also has his own luxury haircare line, Reza Be Obsessed, which features products that are vegan, eco-friendly, and cruelty-free and include ingredients like gold and crushed diamonds.\n\nNot only is he half Jewish, half Muslim, he is also openly gay. This is an incredibly unique combination within the Persian community. Consequently, Reza has endured a great deal of prejudice throughout his life. After initially turning down the opportunity to appear on Shahs of Sunset, Reza eventually decided to join the cast after hearing too man stories of bullied gay teenagers committing suicide.\n\nThe reality TV series \"Shahs of Sunset\" debuted on Bravo in 2012. Reza Farahan has appeared on all seasons. As an actor he appeared in the TV movie \"Sharknado 3: Oh Hell No!\" in 2015 and in the TV series \"Yours, Mine or Ours\" in 2016. Farahan has also appeared in episodes of the TV series \"Wendy: The Wendy Williams Show\", \"The Jeff Probst Show\", \"Good Day L.A.\", \"Hello Ross!\", \"Wonderview\", \"In Bed with Joan\", \"Bethenny\", \"The Millionaire Matchmaker\", and more.\n\nEarly Life\n\nReza Farahan was born Reza Mehdi Farahan on August 5, 1973, in Tehran, Iran. He moved to the United States as a child and grew up in Beverly Hills, California. Reza is half-Muslim and half-Jewish, and he attended Beverly Hills High School. After graduating in 1991, he enrolled at San Francisco State University, earning his degree in 1995.\n\nCareer\n\n\"Shahs of Sunset\" premiered in March 2012, and as of this writing, the series has aired more than 100 episodes over eight seasons; Farahan has appeared in every season. As an actor, he has appeared in the TV movie \"Sharknado 3: Oh Hell No!\" (2015) and the IFC series \"Comedy Bang! Bang!\" (2015), and in 2016, he starred on the Bravo reality series \"Yours, Mine or Ours\" with Taylor Spellman, \"interior designer to the stars.\" Reza has also appeared on the TV series \"Watch What Happens: Live,\" \"The Wendy Williams Show,\" \"The Jeff Probst Show,\" \"Bethenny,\" \"The Millionaire Matchmaker,\" \"The Dr. Oz Show,\" \"Hollywood Medium with Tyler Henry,\" \"The Real Housewives of Atlanta,\" and \"Celebrity Call Center.\"\n\nPersonal Life\n\nReza, who is openly gay, married Adam Neely on October 3rd, 2015, in Palm Springs, California. Neely is a former fashion model, and he has worked in post-production on several Ryan Murphy projects, including \"Glee,\" \"American Horror Story,\" and \"Scream Queens.\" Farahan has endured a great deal of prejudice throughout his life, and after initially turning down the opportunity to appear on \"Shahs of Sunset,\" he eventually decided to join the cast after hearing too many stories of bullied gay teenagers committing suicide. He serves as a voice for the Persian gay community and hopes to inspire gay teenagers, especially those of Middle Eastern backgrounds. Reza was good friends with his \"Shahs of Sunset\" co-star/Keller Williams coworker Mercedes \"MJ\" Javid, but MJ reportedly soured on their friendship in April 2019 after she ended up in ICU after childbirth and Farahan failed to visit her in the hospital. In October 2019, Reza obtained a three-year restraining order against MJ's husband, Tommy Feight, after Feight allegedly vandalized Reza and Adam's home and \"called and said he was going to kill\" Farahan.\n\nReal Estate\n\nIn 2017, Reza and Adam bought a 1,600 square foot home in North Hollywood's Toluca Woods neighborhood. They spent $400,000 to renovate the house, which was built in the 1940s, and Farahan said of the home's original condition, \"Visually it looked OK. But the layout was very choppy. You walked into a tiny vestibule, but the living room was the master bedroom. There was a small kitchen with one window and a beehive fireplace in one corner, which we nicknamed 'the pizza oven.' The bathroom floor was giving out; if you jumped up and down in there, you'd end up in the crawl space.\"", "images": ["https://vz.cnwimg.com/wp-content/uploads/2012/01/reza.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/wp-content/uploads/2012/01/Reza-Farahan-1.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2012/01/reza.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-businessmen/reza-farahan-net-worth/", "title": "Reza Farahan Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Reza Farahan net worth: Reza Farahan is an Iranian-American real estate agent and reality television star who has a net worth of $7 million dollars. Born in Tehran, Iran, Reza Farahan", "cnw_share_fb_count": 130, "cnw_share_tw_count": 30, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Reza Farahan Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-businessmen/reza-farahan-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2012/01/reza.jpg", "site_name": "Celebrity Net Worth", "description": "Reza Farahan net worth: Reza Farahan is an Iranian-American real estate agent and reality television star who has a net worth of $7 million dollars. Born in Tehran, Iran, Reza Farahan"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2022-07-07T15:56:06+00:00", "published_time": "2021-05-25T05:23:15+00:00", "section": "Richest Business", "tag": "shahs of sunset"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2012/01/reza.jpg", "title": "Reza Farahan Net Worth", "description": "Reza Farahan net worth: Reza Farahan is an Iranian-American real estate agent and reality television star who has a net worth of $7 million dollars. Born in Tehran, Iran, Reza Farahan"}}, "movies": [], "publish_date": 1621920195.0, "source": "https://www.celebritynetworth.com", "summary": ""}