{"url": "https://www.usatoday.com/story/life/movies/2018/01/12/6-things-you-missed-2008-critics-choice-awards/1027209001/", "text": "6 things you missed at the 2018 Critics' Choice Awards\n\nHollywood got back to the business of focusing on awards at Thursday's Critics’ Choice Awards.\n\nThe weeknight event, at an airport hangar in Santa Monica, was more colorful and lower key (airing on the CW network) than Sunday’s Golden Globes. But it still featured plenty of drama.\n\nHere's what you might have missed:\n\n1. 'The Shape of Water' won big.\n\nDirector Guillermo del Toro's The Shape of Water jumped into the awards glory position, taking best picture (along with best director, production design and score) after Three Billboards Outside Ebbing, Missouri dominated at the Globes.\n\nThe show's closing moments found Del Toro onstage, hoisting his best-picture trophy. Even if the play-off music did drown out the end of his speech: \"You don't know what you're missing,\" he said over the music.\n\n2. Color came back on the red (well, blue) carpet.\n\nHollywood donned black at the Globes in solidarity with the Time's Up initiative, which is dedicated to confronting abuse of power and promoting racial and gender equality in the workplace.\n\nBut Thursday's carpet featured Hollywood's finest — Angelina Jolie, Nicole Kidman and Jessica Chastain among them — bringing light and bright back.\n\n\"The decision to wear black at the Golden Globes was the easiest decision I ever made. I wanted to show solidarity. That conversation continues today,\" Rachel Brosnahan (The Marvelous Mrs. Maisel) told USA TODAY.\n\nBut \"I wore this because it makes me feel fabulous,\" she added.\n\n3. Walton Goggins reluctantly filled in for James Franco.\n\nThe Disaster Artist director and star James Franco won an early award during the online portion of the awards show for best actor in a comedy.\n\nEmbroiled in a growing controversy following a bombshell Los Angeles Times report detailing accusations of sexual misconduct, Franco didn't show up to accept his award.\n\nGoggins, who presented the award, had to awkwardly step back to the microphone and accept the award on Franco's behalf.\n\n4. Olivia Munn saved her best barbs for Mark Wahlberg.\n\nThe former Daily Show correspondent didn't bring a biting social or political edge in a hosting performance that missed more than it hit.\n\nBut Munn landed some shots as she hoisted glasses of champagne with Niecy Nash in a sarcastic toast to the \"good guys\" of Hollywood. All the Money in the World star Mark Wahlberg took the best zinger: USA TODAY learned this week that he earned $1.5 million to reshoot his scenes with Christopher Plummer compared to co-star Michelle Williams' $1,000.\n\nMore: Olivia Munn calls out Mark Wahlberg's payday in Critics' Choice 'good guys' toast\n\n\"I want to say 'thank you' to the producers for paying Niecy and I the same amount of money and Mark Wahlberg a million dollars,\" Munn said.\n\n5. Brooklynn Prince cried onstage, stole the show.\n\nPrince, the 7-year-old star of The Florida Project, burst into tears as she walked to the stage to accept her award for best young actor/actress. Wearing a sparkly red dress, Prince cried \"happy tears\" throughout, suggesting that she and her fellow nominees in the category \"go and get ice cream afterward.\"\n\nThe crowd melted.\n\nLater, Prince was spotted speaking with fellow nominee Jacob Tremblay, 11, who gave her a congratulatory hug. \"It was so nice of him to stop by and see how I was,\" Prince told USA TODAY.\n\n6. Rachel Brosnahan nailed her speech.\n\nThe Marvelous Mrs. Maisel continued to bring Brosnahan to the winner's podium: She won best actress in a comedy series and the Amazon show won best comedy series.\n\nAfter pausing during her Globes acceptance speech to nervously say \"Hi, Oprah\" to Oprah Winfrey in the front row, Brosnahan told USA TODAY she was more \"relaxed\" than during \"my now-infamous 'Hi, Oprah' \" moment and gave a soaring oratory.\n\n\"I was still overwhelmed,\" she said. \"But I wanted to thank the critics for the success of our show. They helped us get the word out so quickly.\"\n\nMore: No more black! Our 9 best-dressed stars at the 2018 Critics' Choice Awards\n\nAlso: The 7 worst-dressed stars at the 2018 Critics' Choice Awards\n\nList:Critics' Choice Awards 2018 winners", "images": ["https://www.gannett-cdn.com/-mm-/9578eb76d0b9357ef0fbc799421a678bd88834a6/c=225-0-2294-1169/local/-/media/2018/01/11/USATODAY/USATODAY/636513064250273759-GTY-904014038-96502497.JPG?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/-mm-/c096261ba90994af1fecc45fb18541695959fbd8/c=53-0-3572-2646/local/-/media/2018/01/11/USATODAY/USATODAY/636513069026556376-AP-23RD-ANNUAL-CRITICS-CHOICE-AWARDS---SHOW-96500035-1-.JPG?width=320&height=240", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/9578eb76d0b9357ef0fbc799421a678bd88834a6/c=225-0-2294-1169/local/-/media/2018/01/11/USATODAY/USATODAY/636513064250273759-GTY-904014038-96502497.JPG?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Bryan Alexander"], "canonical_link": "https://www.usatoday.com/story/life/movies/2018/01/12/6-things-you-missed-2008-critics-choice-awards/1027209001/", "title": "6 things you missed at the 2018 Critics' Choice Awards", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/movies/2018/01/12/6-things-you-missed-2008-critics-choice-awards/1027209001/life/movies", "theme-color": "#ffffff", "og": {"type": "article", "title": "6 things you missed at the 2018 Critics' Choice Awards", "description": "'The Shape of Water' dominated, James Franco didn't show, and Brooklynn Prince, 7, stole the night.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/9578eb76d0b9357ef0fbc799421a678bd88834a6/c=225-0-2294-1169/local/-/media/2018/01/11/USATODAY/USATODAY/636513064250273759-GTY-904014038-96502497.JPG?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "'The Shape of Water' dominated, James Franco didn't show, and Brooklynn Prince, 7, stole the night.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1515715200.0, "source": "https://www.usatoday.com", "summary": ""}