{"url": "https://www.hollywoodreporter.com/features/tiffany-haddish-new-queen-comedy-has-a-crazy-story-you-1119446", "text": "We’ve just reached cruising altitude when Tiffany Haddish orders her first drink. “Vodka,” she says, batting her long, thick lashes, “on the rocks.”\n\nIf we were to stop here and get technical, it isn’t actually Haddish’s first drink. Her cocktail of choice — a few ice cubes, fruit if you’ve got it — has been flowing freely since we hit the first-class lounge ahead of our flight from San Francisco (where she was performing stand-up) to New York (where she’s shooting a movie). But Haddish, the hottest comedy star in Hollywood thanks to her breakout role in 2017’s Girls Trip, isn’t the type for whom you’d want to get technical. Doing so would surely take the fun out of hanging with her, which can be a test of one’s composure as she dances, flirts and heckles her way through every encounter. In preparing for my weekend with her, Girls Trip‘s producer Will Packer offered only: “Buckle up.”\n\nAt 38, Haddish is doing celebrity on her own terms, unselfconsciously and filter-free. At times, you may wonder if maybe she didn’t get her copy of the Celebrity Rule Book — but it’s far more likely she did and never bothered to crack it open. She famously repeats red carpet looks — expect her white Alexander McQueen gown to resurface when she hosts the MTV Movie & TV Awards on June 18 — and surfs from talk show couch to talk show couch dishing on adventures with her growing roster of A-list friends. Toss out any famous name, and there’s a decent chance Haddish has a good story.\n\nWith more than five hours ahead of us, I decide to make a game of it. I start easy by asking about Leonardo DiCaprio, since I had heard her joke before about wanting to have his baby.\n\n“Yeah, I met him at a party two, three months ago, and I asked him if he’d let me hit that,” she begins. “He’s like, ‘Tiffany, you’re so funny.’ I’m like, ‘I’m serious.’ And then he goes, ‘I mean, I’d do it, but …’ I was like, ‘Come on, wasn’t you in a squad? The coochie squad or something?’ [Editor’s note: DiCaprio was famously a member of the “pussy posse” with pals Tobey Maguire and Kevin Connolly.] I told him, ‘My only stipulation: I wanna do it with you as your character in What’s Eating Gilbert Grape.’ He starts bustin’ up laughin’. ‘Why?’ he asks, and I say, ‘Cause I feel like that performance deserves a real reward and that reward is this (gestures at her own body).’ He starts goin’ into how he got into the role, how he worked with these kids and all this stuff, and I’m just listenin’ and listenin’, like, ‘Mmm-hmm, mmm-hmm.’ I finally go, ‘All that’s good, I just need to know, When’s this gonna happen?'”\n\nAll right, that’s enough about Leo. How about Roseanne Barr?\n\nHaddish speaks directly into my tape recorder. “I don’t know if you know El Segundo [a coastal California town near LAX], but if you’re black and you’re driving through El Segundo, you’re going to get pulled over. I used to visit my friend Anna there, and it got to a point where I was calling the police officers by name. One day, we were walking around the neighborhood, and Anna says, ‘Oh, Roseanne lives there.’ Now, I loved Roseanne, and the next day we walked by, and she was in her yard. I say, ‘Hiiii, Roseanne.’ She looks at me (makes a disgusted face), and ran in the house. I thought, ‘Maybe she don’t want to be bothered today.’ A week later, we walk by again, and I told Anna — she’s Hispanic, but she looks white — she should say hi this time. So she says, ‘Hi, Roseanne,’ and Roseanne goes, ‘Hey!’ I thought, ‘Maybe she got to know us.’ Then I go back, like, a week later, I wave again and say, ‘Hi, Roseanne! I love your comedy,’ and she (makes the same disgusted face) and turns her head. I think, ‘Fuck that bitch.’ That was 2000, maybe 2001, so it’s not new. She been racist, why’d you all give her a TV show?”\n\nHaddish isn’t done. Somewhere over Nevada, there’s another one about how she tried to take Taylor Swift to her 20-year high school reunion (Swift was game, apparently, but her security shut it down); one about how she almost went on a date with Drake (turns out Joel Edgerton is more her type); and then one she’s told before, about introducing Barbra Streisand to the music of stripper turned rapper Cardi B (“Catchy,” says Haddish, in her best Streisand imitation, “very catchy”). But for all of Haddish’s hilarious stories — and, trust me, there are many more — she also has a serious one to tell.\n\n***\n\nBefore that gut-busting turn in Girls Trip, before she parlayed the buzz into a Saturday Night Live hosting gig, a best-selling memoir, a popular stand-up special, the cover of Time 100 and a series of lucrative pacts with practically every major outlet, from Netflix to HBO, Haddish was just a girl from South Central Los Angeles with lofty goals and little means. Her world changed the first time at 8, when her mother suffered a major brain injury in a car accident. After a few months in the hospital, she returned home an angry, abusive version of her former self. Haddish, whose Eritrean immigrant dad had vanished when she was just 3, recalls honing her comedy as a way to make her mother laugh — not to entertain so much as forestall the next outbreak of abuse. It rarely worked for long. “She’d laugh in the moment,” says Haddish, “and then she’d remember why she was mad later and come back and whoop my ass.”\n\nThe setup lasted half a decade, and then she and her collection of younger half siblings were tossed into the foster care system and bounced around L.A. At 15, a social worker enrolled Haddish, still barely able to read and a frequent guest in the principal’s office, in a comedy camp at the Laugh Factory. It was that or psychiatric therapy, she says, and praises the program for teaching her as much about stand-up as it did about self-confidence. It was there that she met one of her heroes, Richard Pryor, who gave her a piece of advice that’s stuck with her. “People don’t come to comedy shows because they want to hear about your problems,” she remembers him saying. “They come to comedy shows to have fun, so when you’re onstage, have fun.”\n\nHaddish didn’t see comedy as a full-time career until many years later. First, she made ends meet with side gigs as a pimp, a sex phone operator and an “energy producer” at bar mitzvahs, among other jobs, and on three separate occasions found herself without a place to live. The second time (at 21) and the third (at 24), she slept in her car, a Geo Metro, which she kept parked in Beverly Hills. “If I’m gonna be homeless,” she reasoned, “I’m gonna be homeless in the best area.” There was also a messy marriage and an even messier divorce, though she’s no longer able to discuss it since her ex is suing her over the abuse allegations she lobbed in her memoir.\n\nThe Laugh Factory’s Jamie Masada, who attended the wedding, says he still hasn’t shaken the memory he has of Haddish coming into his club with a black eye. “She was crying so much she was gasping for breath,” he says. “The emcee comes over and goes, ‘Tiffany, you’re next,’ and I told him, ‘You gotta put some other comics on first.’ But she says, ‘No, I’m going on, these people paid to see me.'” Masada starts to get emotional. “I’ll never forget it, she went into the bathroom, threw some water on her face, and then went out onstage, and for 30 minutes she made people laugh. There was so much pain inside her, but she didn’t allow any of it to show. In all my years, I’ve never seen anything like it.”\n\n[promo:1118017]\n\nHaddish credits Kevin Hart, another pal from the stand-up circuit, for helping her turn her life around. He famously gave her $300, which she used to put a roof over her head, and told her to make a list of her goals. That list — which included such things as working with Jada Pinkett Smith (check), Whoopi Goldberg (check) and Arsenio Hall (check) — remains in a notebook at her current address, a considerable upgrade from her family’s first but still in South Central L.A. Hart recently joked during a visit to Jimmy Kimmel Live! that Haddish has yet to pay him back, but she says he’s full of it. “I tried to do $50 here, $100 there; once I had the whole $300, he was like, ‘I don’t want that,'” she laughs. “He’s like, ‘Get your car fixed, Tiffany. Why you still in the Geo Metro? Get the fuck out the Geo Metro.'”\n\nWith that boost from Hart, acting gigs came slowly but steadily. There was a role on Tyler Perry’s If Loving You Is Wrong, then jobs on The Carmichael Show and Keanu. “You better jump on the Tiffany Haddish train while you can,” she’d tell anyone who’d listen. “It’s movin’ slow now, but it’s about to pick up steam.” In time, its passengers would see Haddish had a talent for establishing intimacy with her audience. “Most artists, when they’re doing their art, they’re onstage, so they’re always a bit above their audience,” says Chris Rock. “But then you got people like Tiffany, who’s literally in the audience — she’s not above them on any level, she’s right there. You feel like she’s sitting with you watching the show.”\n\nThen came Girls Trip. She read the script and recalls thinking, “Oh my God, they just stole my life.” But unlike her co-stars, Queen Latifah, Regina Hall and Pinkett Smith, she had to audition multiple times for the part of supercharged sidekick Dina. For director Malcolm D. Lee, she did so via Skype. “She kept telling me she’d never auditioned this way, but she’d done other things on Skype that she could probably get in trouble for,” recalls Lee; Haddish is more blunt: “I told him I’m only used to sexting on Skype.” Initially, the team was looking for a “name” to round out the quartet, and Haddish, at that time, was not a name. “But we were also looking for somebody to get as close as they could to Dina,” says Packer. “And Tiffany is Dina.”\n\n***\n\nThe Monday after Girls Trip opened last July to more than $30 million, Haddish seriously considered changing her number.\n\nIn three days, she had logged more than 600 text messages. Some had seen the movie — “[Haddish’s] performance is so good it’s jarring,” raved GQ, as others tried to wedge her into the Oscar race — some the promotional tour, which included a stop on Kimmel, where she famously told the story about taking Will and Jada on a Groupon swamp tour. (She then parlayed the story into a Groupon endorsement deal and, later, a Super Bowl spot.) Pitches, offers and invitations flooded in. In short order, Haddish had pacts with Showtime (for her first comedy special), Netflix (an animated series) and HBO (a first-look deal for her She Ready production company).\n\nThere would be major movies, too, but first she had to fulfill the commitments she’d already made, including Tracy Morgan’s TBS series, The Last O.G., and a batch of suddenly sold-out comedy shows. Haddish did the shows somewhat begrudgingly. “I could’ve been paid $80K, probably $90K, a show, but because we booked those before Girls Trip came out, I was getting paid like $20K, $15K, and it fucking sucked,” she says, polishing off her second vodka somewhere over Colorado. “I said to my manager, ‘I think we should just cancel them all, and then if they want to reinstate them, they gotta pay us this much money.’ He’s like, ‘Tiffany, that’s not a good way to do business.’ He said that’s like being a scoundrel, and I was like, ‘No, I’m being a pirate. I want all the booty.'”\n\nThe situation on The Last O.G. was more complicated. Haddish says the network tried a few times to go back in and make her character — conceived as a kind of serious, straight-woman — more like Girls Trip‘s Dina, and each time she resisted. She suggests her relationship with Morgan changed, too: “When the Jimmy Kimmel thing came out, he’s like (in Morgan’s voice), ‘I saw you on Jimmy Kimmel, you was nervous as fuck, huh?’ I’m like, ‘No …’ ‘Haddish, come on, I could see it in your eyes, you were scared.’ … But you don’t argue with Tracy, you just say, ‘OK, yeah, you’re right.'”\n\nA few days before we meet, Haddish’s former Carmichael co-star Lil Rel Howery tweeted a link to an interview Morgan had just given, in which he shut down a question about Haddish. Rel included a message to Morgan: “Don’t bite the hand that keeps you relevant!” Haddish says she tried to get her friend to take down the post, but he flat-out refused. “That motherfucker’s a hater,” Rel told her. Other comics reached out, too, and she says she told them all the same thing: “You guys, chill. He’s probably just tired of hearing my name. It’s exhausting. I’m tired of hearing my name. I could see how that could be irritating, like, ‘Hello, I died, people. I’m back from the dead. Tiffany’s cool, but it’s me sitting here now.’ So, I get it, I’m not mad about it, I love me some Tracy.”\n\nMorgan and Haddish are scheduled to go back into production on the series’ second season later this summer. But before that happens, she has to finish The Kitchen, a mob drama for New Line that she’s filming now in New York with Melissa McCarthy and Elisabeth Moss; squeeze in a few more stand-up gigs; shoot at least one more magazine cover; promote another movie she made; and host the MTV awards. She tries out a few monologue ideas on me and then reveals that she’s already enlisted her Girls Trip co-stars and a few more famous friends. For MTV, GM Amy Doyle says the choice of Haddish was easy: “Tiffany’s right in the bull’s-eye of pop culture, and everyone is rooting for her.”\n\nStill, those closest to Haddish worry that she may be pushing herself too hard — she says she hasn’t figured out how to ride the wave any other way. Right now, she merely fantasizes about what a day free of professional responsibilities might look like. “I’d wake up,” she muses, “smoke a little weed, have a sip of vodka, eat some food, go back to sleep, wake up again, turn on some cartoons, take a poop, smoke a little more weed, have some water, go back to sleep.” There’s no reference to a relationship because, she insists, there’s not time for one of those either. Her most recent one ended in August, when she realized her boyfriend was trying to take control of her career. The last straw? When she arrived at what she thought would be an intimate dinner to discover he had invited a record executive to discuss a business opportunity. She called it quits that night, and, she tells me, her “coochie’s been closed ever since.”\n\n***\n\nWe’re high above Illinois when Haddish orders her third and final vodka. “I’d take a foot massage, too,” she jokes to a gaggle of star-struck flight attendants.\n\nHaddish is getting more comfortable with the wide-eyed, “Oh my God, it’s really you!” look, which she’s been seeing a lot of lately. Before Girls Trip came out, Pinkett Smith told her she’d know she had made it when people started calling her by her character’s name. But already Haddish has done one better: they see her now and call her by her own name. I witnessed it as we made our way through the San Francisco airport earlier in the day, though it should be noted that Haddish makes no pains to slip by unnoticed. On this afternoon, she wore a camo jacket with the word “Queen” etched in big block letters over a t-shirt with her personal motto, “She Ready,” splashed across her chest. Hanging in both ears were chunky gold hoops with “Tiffany” written in cursive within.\n\nEach time a photo of Haddish is snapped — and she willingly poses for many — she repeats the word, “Success.” Ambition is nothing to be coy about, she says, and she lives her life accordingly. Ask her what she’d like to do with her new platform, and she offers a laundry list: “I want to make a cookbook. I wanna make a gardening book. I want a clothing line. I want a jewelry line. I want a perfume.” You get the sense she’d keep going if you’d let her, and so you do. “And then I want to buy two streets that intersect, Tiffany and Haddish, and I’m gonna build a big youth center, a mental health center, I might do some transitional housing, too. But I’m gonna own it. And I’m gonna have music and all the other stuff they’re taking out of schools. Right now, my mind’s on one street, but it might be in every city, every metropolis, and it might turn into a big thing. It’s gonna be amazing.”\n\nAs for Hollywood, she says she’d like to make at least 50 movies by the time she turns 50, which, if you’re counting, is only 12 years away. “And I want to get $10 million a movie,” she says, “$100 million, eventually.” Predictably, Haddish has plenty of new “friends,” eager to poach her from her longtime reps at APA and Artists First — some of them have even lavished her with gifts, including a custom pair of “She Ready” Gucci slippers. Her response is usually a version of, “Thanks, and I’d love to work with any of your clients, but until my agents mess up and do something really destructive to my career, I’m not goin’ anywhere.”\n\nPresented with a candy shop of career options, Haddish seems to be relying less on a long-term strategy than gut instinct about roles that feel right and creative people she wants to work with, like Carmichael showrunner Danielle Sanchez-Witzel. The women are quietly prepping a sitcom vehicle for Haddish about the life of female comedians. Two episodes already have been written, but it’s yet to be shopped. If all goes as planned, Haddish will also tape a stand-up special for Netflix in the fall and adapt her memoir into a film. Judd Apatow approached her with the idea, and the two now are trying to get on the same page. She’s committed to making it work, she’s just not so sure she wants to revisit those early years. “I don’t wanna watch that shit,” she says. “I wrote it to get it off my chest and let it go.”\n\n[promo:1120494]\n\nNearer term, she’ll star opposite Hart in Universal’s September comedy Night School and Ike Barinholtz in his directorial debut, The Oath. Barinholtz had caught Haddish first in Keanu, and Jordan Peele told him if he could get her in his thriller, he should. “She was definitely everyone’s favorite person on the movie,” Barinholtz says now — and not just because she invited them to tag along to DJ Khaled’s birthday party. “It’s also because she says exactly what’s on her mind and she loves to mess with people. Like, you’d ask for a take, and she’d look right into the camera lens, and she’d start talking to the editor: ‘Yo, Jack, that scene was a good one for me. I think you should really take a look.’ You just fall in love with her.”\n\n***\n\nWith roughly two hours left in our flight, I broach the topic of Beyonce. In case you missed it, and at this point it’s hard to imagine you could have, Haddish recently told an insane story about a private party she’d been at where an actress bit the pop star’s face. The mystery of “Who Bit Beyonce?” all but broke the internet.\n\nHaddish asks whether I know who did it, and I whisper the name that’s been rumored: Sanaa Lathan. She smiles. “I’m super good friends with her stepmom and her dad [Stan, a producer-director], and they were mad at me,” she reveals. “They were like, ‘Why would you do this to the family? You know, black actresses, you guys have to stick together, it’s so hard for you guys to get work as it is, why would you try to ruin her career?’ But I didn’t try to ruin her career. I never said her name! I was just trying to say how Beyonce kept me from goin’ to jail that night. I coulda just shut my whole career down.”\n\nI wonder aloud if there’s been any other fallout, and she insists no, just the opposite. “The other day, someone was saying, like, ‘Oh my God, you should keep your mouth shut ’cause now you’re never gonna be invited to parties,’ but I got invited to way more parties after that,” she tells me. “It’s ridiculous how many parties. ‘Can you come to my party?’ ‘Can you come to my thing?’ They want me to talk about something at their thing ’cause they think, like, ‘This is gonna put me back on if Tiffany says something.'” If only Tiffany Haddish had time to party more.\n\nAnd at that, we agree to turn off the tape recorder and let her get some rest. She flips on a movie, Thor: Ragnarok, but can’t resist turning to me to discuss the genetic gifts that are the Hemsworth brothers and how she’d love to work with — she can’t quite summon Anthony Hopkins’ name — “the guy from Sleeping With the Lambs.” We both burst into laughter. “I guess I’m pretty tired,” she says. “And tipsy.” Then she reclines her seat, pulls a blanket over her body and promptly passes out.\n\nThis story first appeared in the June 13 issue of The Hollywood Reporter magazine. To receive the magazine, click here to subscribe.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/06/180306_tiffanyhaddish_thr_s05_0754-embed_2018_thr.jpg?w=928", "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/screen_shot_2018-06-05_at_3.03.08_pm-embed_2018_0.jpg?w=928", "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/180306_tiffanyhaddish_thr_s01_0171_v2-embed_thr.jpg?w=928", "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/thr_issue_21_tiffany_haddish_cover.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/triplethreat.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/splash_haddish1-thr_2018.jpg?w=1500&h=844&crop=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/splash_haddish1-thr_2018.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/2481_d006_00474r-embed_2018.jpg?w=928", "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/180306_tiffanyhaddish_thr_s05_0706_v3-embed_2018thr.jpg?w=928", "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/180306_tiffanyhaddish_thr_s02_0363_v2-embed_2018_thr.jpg?w=928", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/splash_haddish1-thr_2018.jpg?w=1024", "keywords": [], "authors": ["Lacey Rose"], "canonical_link": "https://www.hollywoodreporter.com/movies/movie-features/tiffany-haddish-new-queen-comedy-has-a-crazy-story-you-1119446/", "title": "Tiffany Haddish, Hollywood’s New Comedy Queen, Has One Crazy Story to Tell", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "On a boozy cross-country trip, Tiffany Haddish opens up about upcoming projects (a Judd Apatow film, her own TV show, 'Girls Trip 2'), hitting on Leonardo DiCaprio, getting blown off by Roseanne Barr (\"She been racist, why'd you all give her a TV show?\") and, yes, who really bit Beyonce and the fallout between her and Sanaa Lathan's family.", "news_keywords": "THR Cover Story, tiffany haddish", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Lacey Rose", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1119446, "title": "Tiffany Haddish, Hollywood’s New Comedy Queen, Has One Crazy Story to Tell", "published_at": "2018-06-13 06:00:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/splash_haddish1-thr_2018.jpg?w=1024", "comment_count": 0, "tags": "tiffany haddish", "topics": "Movies", "body": "We've just reached cruising altitude when Tiffany Haddish orders her first drink. \"Vodka,\" she says, batting her long, thick lashes, \"on the rocks.\"\r\nIf we were to stop here and get technical, it isn't actually Haddish's first drink. Her cocktail of choice — a few ice cubes, fruit if you've got it — has been flowing freely since we hit the first-class lounge ahead of our flight from San Francisco (where she was performing stand-up) to New York (where she's shooting a movie). But Haddish, the hottest comedy star in Hollywood thanks to her breakout role in 2017's Girls Trip, isn't the type for whom you'd want to get technical. Doing so would surely take the fun out of hanging with her, which can be a test of one's composure as she dances, flirts and heckles her way through every encounter. In preparing for my weekend with her, Girls Trip's producer Will Packer offered only: \"Buckle up.\"\r\n\r\nAt 38, Haddish is doing celebrity on her own terms, unselfconsciously and filter-free. At times, you may wonder if maybe she didn't get her copy of the Celebrity Rule Book — but it's far more likely she did and never bothered to crack it open. She famously repeats red carpet looks — expect her white Alexander McQueen gown to resurface when she hosts the MTV Movie & TV Awards on June 18 — and surfs from talk show couch to talk show couch dishing on adventures with her growing roster of A-list friends. Toss out any famous name, and there's a decent chance Haddish has a good story.\r\nWith more than five hours ahead of us, I decide to make a game of it. I start easy by asking about Leonardo DiCaprio, since I had heard her joke before about wanting to have his baby.\r\n\"Yeah, I met him at a party two, three months ago, and I asked him if he'd let me hit that,\" she begins. \"He's like, 'Tiffany, you're so funny.' I'm like, 'I'm serious.' And then he goes, 'I mean, I'd do it, but …' I was like, 'Come on, wasn't you in a squad? The coochie squad or something?' [Editor's note: DiCaprio was famously a member of the \"pussy posse\" with pals Tobey Maguire and Kevin Connolly.] I told him, 'My only stipulation: I wanna do it with you as your character in What's Eating Gilbert Grape.' He starts bustin' up laughin'. 'Why?' he asks, and I say, 'Cause I feel like that performance deserves a real reward and that reward is this (gestures at her own body).' He starts goin' into how he got into the role, how he worked with these kids and all this stuff, and I'm just listenin' and listenin', like, 'Mmm-hmm, mmm-hmm.' I finally go, 'All that's good, I just need to know, When's this gonna happen?'\"\r\nAll right, that's enough about Leo. How about Roseanne Barr?\r\nHaddish speaks directly into my tape recorder. \"I don't know if you know El Segundo [a coastal California town near LAX], but if you're black and you're driving through El Segundo, you're going to get pulled over. I used to visit my friend Anna there, and it got to a point where I was calling the police officers by name. One day, we were walking around the neighborhood, and Anna says, 'Oh, Roseanne lives there.' Now, I loved Roseanne, and the next day we walked by, and she was in her yard. I say, 'Hiiii, Roseanne.' She looks at me (makes a disgusted face), and ran in the house. I thought, 'Maybe she don't want to be bothered today.' A week later, we walk by again, and I told Anna — she's Hispanic, but she looks white — she should say hi this time. So she says, 'Hi, Roseanne,' and Roseanne goes, 'Hey!' I thought, 'Maybe she got to know us.' Then I go back, like, a week later, I wave again and say, 'Hi, Roseanne! I love your comedy,' and she (makes the same disgusted face) and turns her head. I think, 'Fuck that bitch.' That was 2000, maybe 2001, so it's not new. She been racist, why'd you all give her a TV show?\"\r\nHaddish isn't done. Somewhere over Nevada, there's another one about how she tried to take Taylor Swift to her 20-year high school reunion (Swift was game, apparently, but her security shut it down); one about how she almost went on a date with Drake (turns out Joel Edgerton is more her type); and then one she's told before, about introducing Barbra Streisand to the music of stripper turned rapper Cardi B (\"Catchy,\" says Haddish, in her best Streisand imitation, \"very catchy\"). But for all of Haddish's hilarious stories — and, trust me, there are many more — she also has a serious one to tell.\r\n\r\n***\r\nBefore that gut-busting turn in Girls Trip, before she parlayed the buzz into a Saturday Night Live hosting gig, a best-selling memoir, a popular stand-up special, the cover of Time 100 and a series of lucrative pacts with practically every major outlet, from Netflix to HBO, Haddish was just a girl from South Central Los Angeles with lofty goals and little means. Her world changed the first time at 8, when her mother suffered a major brain injury in a car accident. After a few months in the hospital, she returned home an angry, abusive version of her former self. Haddish, whose Eritrean immigrant dad had vanished when she was just 3, recalls honing her comedy as a way to make her mother laugh — not to entertain so much as forestall the next outbreak of abuse. It rarely worked for long. \"She'd laugh in the moment,\" says Haddish, \"and then she'd remember why she was mad later and come back and whoop my ass.\"\r\n\r\nThe setup lasted half a decade, and then she and her collection of younger half siblings were tossed into the foster care system and bounced around L.A. At 15, a social worker enrolled Haddish, still barely able to read and a frequent guest in the principal's office, in a comedy camp at the Laugh Factory. It was that or psychiatric therapy, she says, and praises the program for teaching her as much about stand-up as it did about self-confidence. It was there that she met one of her heroes, Richard Pryor, who gave her a piece of advice that's stuck with her. \"People don't come to comedy shows because they want to hear about your problems,\" she remembers him saying. \"They come to comedy shows to have fun, so when you're onstage, have fun.\"\r\nHaddish didn't see comedy as a full-time career until many years later. First, she made ends meet with side gigs as a pimp, a sex phone operator and an \"energy producer\" at bar mitzvahs, among other jobs, and on three separate occasions found herself without a place to live. The second time (at 21) and the third (at 24), she slept in her car, a Geo Metro, which she kept parked in Beverly Hills. \"If I'm gonna be homeless,\" she reasoned, \"I'm gonna be homeless in the best area.\" There was also a messy marriage and an even messier divorce, though she's no longer able to discuss it since her ex is suing her over the abuse allegations she lobbed in her memoir.\r\nThe Laugh Factory's Jamie Masada, who attended the wedding, says he still hasn't shaken the memory he has of Haddish coming into his club with a black eye. \"She was crying so much she was gasping for breath,\" he says. \"The emcee comes over and goes, 'Tiffany, you're next,' and I told him, 'You gotta put some other comics on first.' But she says, 'No, I'm going on, these people paid to see me.'\" Masada starts to get emotional. \"I'll never forget it, she went into the bathroom, threw some water on her face, and then went out onstage, and for 30 minutes she made people laugh. There was so much pain inside her, but she didn't allow any of it to show. In all my years, I've never seen anything like it.\"\r\n\r\n[promo:1118017]\r\nHaddish credits Kevin Hart, another pal from the stand-up circuit, for helping her turn her life around. He famously gave her $300, which she used to put a roof over her head, and told her to make a list of her goals. That list — which included such things as working with Jada Pinkett Smith (check), Whoopi Goldberg (check) and Arsenio Hall (check) — remains in a notebook at her current address, a considerable upgrade from her family's first but still in South Central L.A. Hart recently joked during a visit to Jimmy Kimmel Live! that Haddish has yet to pay him back, but she says he's full of it. \"I tried to do $50 here, $100 there; once I had the whole $300, he was like, 'I don't want that,'\" she laughs. \"He's like, 'Get your car fixed, Tiffany. Why you still in the Geo Metro? Get the fuck out the Geo Metro.'\"\r\nWith that boost from Hart, acting gigs came slowly but steadily. There was a role on Tyler Perry's If Loving You Is Wrong, then jobs on The Carmichael Show and Keanu. \"You better jump on the Tiffany Haddish train while you can,\" she'd tell anyone who'd listen. \"It's movin' slow now, but it's about to pick up steam.\" In time, its passengers would see Haddish had a talent for establishing intimacy with her audience. \"Most artists, when they're doing their art, they're onstage, so they're always a bit above their audience,\" says Chris Rock. \"But then you got people like Tiffany, who's literally in the audience — she's not above them on any level, she's right there. You feel like she's sitting with you watching the show.\"\r\nThen came Girls Trip. She read the script and recalls thinking, \"Oh my God, they just stole my life.\" But unlike her co-stars, Queen Latifah, Regina Hall and Pinkett Smith, she had to audition multiple times for the part of supercharged sidekick Dina. For director Malcolm D. Lee, she did so via Skype. \"She kept telling me she'd never auditioned this way, but she'd done other things on Skype that she could probably get in trouble for,\" recalls Lee; Haddish is more blunt: \"I told him I'm only used to sexting on Skype.\" Initially, the team was looking for a \"name\" to round out the quartet, and Haddish, at that time, was not a name. \"But we were also looking for somebody to get as close as they could to Dina,\" says Packer. \"And Tiffany is Dina.\"\r\n***\r\nThe Monday after Girls Trip opened last July to more than $30 million, Haddish seriously considered changing her number.\r\nIn three days, she had logged more than 600 text messages. Some had seen the movie — \"[Haddish's] performance is so good it's jarring,\" raved GQ, as others tried to wedge her into the Oscar race — some the promotional tour, which included a stop on Kimmel, where she famously told the story about taking Will and Jada on a Groupon swamp tour. (She then parlayed the story into a Groupon endorsement deal and, later, a Super Bowl spot.) Pitches, offers and invitations flooded in. In short order, Haddish had pacts with Showtime (for her first comedy special), Netflix (an animated series) and HBO (a first-look deal for her She Ready production company).\r\nThere would be major movies, too, but first she had to fulfill the commitments she'd already made, including Tracy Morgan's TBS series, The Last O.G., and a batch of suddenly sold-out comedy shows. Haddish did the shows somewhat begrudgingly. \"I could've been paid $80K, probably $90K, a show, but because we booked those before Girls Trip came out, I was getting paid like $20K, $15K, and it fucking sucked,\" she says, polishing off her second vodka somewhere over Colorado. \"I said to my manager, 'I think we should just cancel them all, and then if they want to reinstate them, they gotta pay us this much money.' He's like, 'Tiffany, that's not a good way to do business.' He said that's like being a scoundrel, and I was like, 'No, I'm being a pirate. I want all the booty.'\"\r\nThe situation on The Last O.G. was more complicated. Haddish says the network tried a few times to go back in and make her character — conceived as a kind of serious, straight-woman — more like Girls Trip's Dina, and each time she resisted. She suggests her relationship with Morgan changed, too: \"When the Jimmy Kimmel thing came out, he's like (in Morgan's voice), 'I saw you on Jimmy Kimmel, you was nervous as fuck, huh?' I'm like, 'No …' 'Haddish, come on, I could see it in your eyes, you were scared.' … But you don't argue with Tracy, you just say, 'OK, yeah, you're right.'\"\r\n\r\nA few days before we meet, Haddish's former Carmichael co-star Lil Rel Howery tweeted a link to an interview Morgan had just given, in which he shut down a question about Haddish. Rel included a message to Morgan: \"Don't bite the hand that keeps you relevant!\" Haddish says she tried to get her friend to take down the post, but he flat-out refused. \"That motherfucker's a hater,\" Rel told her. Other comics reached out, too, and she says she told them all the same thing: \"You guys, chill. He's probably just tired of hearing my name. It's exhausting. I'm tired of hearing my name. I could see how that could be irritating, like, 'Hello, I died, people. I'm back from the dead. Tiffany's cool, but it's me sitting here now.' So, I get it, I'm not mad about it, I love me some Tracy.\"\r\nMorgan and Haddish are scheduled to go back into production on the series' second season later this summer. But before that happens, she has to finish The Kitchen, a mob drama for New Line that she's filming now in New York with Melissa McCarthy and Elisabeth Moss; squeeze in a few more stand-up gigs; shoot at least one more magazine cover; promote another movie she made; and host the MTV awards. She tries out a few monologue ideas on me and then reveals that she's already enlisted her Girls Trip co-stars and a few more famous friends. For MTV, GM Amy Doyle says the choice of Haddish was easy: \"Tiffany's right in the bull's-eye of pop culture, and everyone is rooting for her.\"\r\nStill, those closest to Haddish worry that she may be pushing herself too hard — she says she hasn't figured out how to ride the wave any other way. Right now, she merely fantasizes about what a day free of professional responsibilities might look like. \"I'd wake up,\" she muses, \"smoke a little weed, have a sip of vodka, eat some food, go back to sleep, wake up again, turn on some cartoons, take a poop, smoke a little more weed, have some water, go back to sleep.\" There's no reference to a relationship because, she insists, there's not time for one of those either. Her most recent one ended in August, when she realized her boyfriend was trying to take control of her career. The last straw? When she arrived at what she thought would be an intimate dinner to discover he had invited a record executive to discuss a business opportunity. She called it quits that night, and, she tells me, her \"coochie's been closed ever since.\"\r\n\r\n***\r\nWe're high above Illinois when Haddish orders her third and final vodka. \"I'd take a foot massage, too,\" she jokes to a gaggle of star-struck flight attendants.\r\nHaddish is getting more comfortable with the wide-eyed, \"Oh my God, it's really you!\" look, which she's been seeing a lot of lately. Before Girls Trip came out, Pinkett Smith told her she'd know she had made it when people started calling her by her character's name. But already Haddish has done one better: they see her now and call her by her own name. I witnessed it as we made our way through the San Francisco airport earlier in the day, though it should be noted that Haddish makes no pains to slip by unnoticed. On this afternoon, she wore a camo jacket with the word \"Queen\" etched in big block letters over a t-shirt with her personal motto, \"She Ready,\" splashed across her chest. Hanging in both ears were chunky gold hoops with \"Tiffany\" written in cursive within.\r\nEach time a photo of Haddish is snapped — and she willingly poses for many — she repeats the word, \"Success.\" Ambition is nothing to be coy about, she says, and she lives her life accordingly. Ask her what she'd like to do with her new platform, and she offers a laundry list: \"I want to make a cookbook. I wanna make a gardening book. I want a clothing line. I want a jewelry line. I want a perfume.\" You get the sense she'd keep going if you'd let her, and so you do. \"And then I want to buy two streets that intersect, Tiffany and Haddish, and I'm gonna build a big youth center, a mental health center, I might do some transitional housing, too. But I'm gonna own it. And I'm gonna have music and all the other stuff they're taking out of schools. Right now, my mind's on one street, but it might be in every city, every metropolis, and it might turn into a big thing. It's gonna be amazing.\"\r\n\r\nAs for Hollywood, she says she'd like to make at least 50 movies by the time she turns 50, which, if you're counting, is only 12 years away. \"And I want to get $10 million a movie,\" she says, \"$100 million, eventually.\" Predictably, Haddish has plenty of new \"friends,\" eager to poach her from her longtime reps at APA and Artists First — some of them have even lavished her with gifts, including a custom pair of \"She Ready\" Gucci slippers. Her response is usually a version of, \"Thanks, and I'd love to work with any of your clients, but until my agents mess up and do something really destructive to my career, I'm not goin' anywhere.\"\r\nPresented with a candy shop of career options, Haddish seems to be relying less on a long-term strategy than gut instinct about roles that feel right and creative people she wants to work with, like Carmichael showrunner Danielle Sanchez-Witzel. The women are quietly prepping a sitcom vehicle for Haddish about the life of female comedians. Two episodes already have been written, but it's yet to be shopped. If all goes as planned, Haddish will also tape a stand-up special for Netflix in the fall and adapt her memoir into a film. Judd Apatow approached her with the idea, and the two now are trying to get on the same page. She's committed to making it work, she's just not so sure she wants to revisit those early years. \"I don't wanna watch that shit,\" she says. \"I wrote it to get it off my chest and let it go.\"\r\n\r\n[promo:1120494]\r\nNearer term, she'll star opposite Hart in Universal's September comedy Night School and Ike Barinholtz in his directorial debut, The Oath. Barinholtz had caught Haddish first in Keanu, and Jordan Peele told him if he could get her in his thriller, he should. \"She was definitely everyone's favorite person on the movie,\" Barinholtz says now — and not just because she invited them to tag along to DJ Khaled's birthday party. \"It's also because she says exactly what's on her mind and she loves to mess with people. Like, you'd ask for a take, and she'd look right into the camera lens, and she'd start talking to the editor: 'Yo, Jack, that scene was a good one for me. I think you should really take a look.' You just fall in love with her.\"\r\n***\r\nWith roughly two hours left in our flight, I broach the topic of Beyonce. In case you missed it, and at this point it's hard to imagine you could have, Haddish recently told an insane story about a private party she'd been at where an actress bit the pop star's face. The mystery of \"Who Bit Beyonce?\" all but broke the internet.\r\nHaddish asks whether I know who did it, and I whisper the name that's been rumored: Sanaa Lathan. She smiles. \"I'm super good friends with her stepmom and her dad [Stan, a producer-director], and they were mad at me,\" she reveals. \"They were like, 'Why would you do this to the family? You know, black actresses, you guys have to stick together, it's so hard for you guys to get work as it is, why would you try to ruin her career?' But I didn't try to ruin her career. I never said her name! I was just trying to say how Beyonce kept me from goin' to jail that night. I coulda just shut my whole career down.\"\r\nI wonder aloud if there's been any other fallout, and she insists no, just the opposite. \"The other day, someone was saying, like, 'Oh my God, you should keep your mouth shut 'cause now you're never gonna be invited to parties,' but I got invited to way more parties after that,\" she tells me. \"It's ridiculous how many parties. 'Can you come to my party?' 'Can you come to my thing?' They want me to talk about something at their thing 'cause they think, like, 'This is gonna put me back on if Tiffany says something.'\" If only Tiffany Haddish had time to party more.\r\nAnd at that, we agree to turn off the tape recorder and let her get some rest. She flips on a movie, Thor: Ragnarok, but can't resist turning to me to discuss the genetic gifts that are the Hemsworth brothers and how she'd love to work with — she can't quite summon Anthony Hopkins' name — \"the guy from Sleeping With the Lambs.\" We both burst into laughter. \"I guess I'm pretty tired,\" she says. \"And tipsy.\" Then she reclines her seat, pulls a blanket over her body and promptly passes out.\r\n\r\n\r\nThis story first appeared in the June 13 issue of The Hollywood Reporter magazine. To receive the magazine, click here to subscribe.", "fb": {"pages": 14425952749}, "ia": {"markup_url": "https://www.hollywoodreporter.com/movies/movie-features/tiffany-haddish-new-queen-comedy-has-a-crazy-story-you-1119446/?ia_markup=1"}, "fragment": "!", "og": {"type": "article", "title": "Tiffany Haddish, Hollywood’s New Comedy Queen, Has One Crazy Story to Tell", "url": "https://www.hollywoodreporter.com/movies/movie-features/tiffany-haddish-new-queen-comedy-has-a-crazy-story-you-1119446/", "description": "On a boozy cross-country trip, Tiffany Haddish opens up about upcoming projects (a Judd Apatow film, her own TV show, ‘Girls Trip 2’), hitting on Leonardo DiCaprio, getting blown off by…", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/splash_haddish1-thr_2018.jpg?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2018-06-13T06:00:00+00:00", "modified_time": "2018-06-15T09:58:38+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Tiffany Haddish, Hollywood’s New Comedy Queen, Has One Crazy Story to Tell", "description": "On a boozy cross-country trip, Tiffany Haddish opens up about upcoming projects (a Judd Apatow film, her own TV show, ‘Girls Trip 2’), hitting on Leonardo DiCaprio, getting blown off by…", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/splash_haddish1-thr_2018.jpg?w=1500"}}, "movies": [], "publish_date": 1528869600.0, "source": "https://www.hollywoodreporter.com", "summary": ""}