{"url": "https://news.sky.com/feature/royal-wedding-2018-the-ultimate-guide-to-harry-and-meghans-big-day-11302267", "text": "Bethany Minelle, News Reporter\n\nPrince Harry - the world's most eligible bachelor - and Hollywood starlet Meghan Markle are getting married.\n\nHundreds will attend. Millions will watch on television - including coverage on Sky News and Sky 1. The event will go down in history.\n\nSky News will broadcast live in Windsor the week before the wedding with all the build-up to the big day, with exclusive live coverage of the wedding in UHD in a special programme ‪from 9am to 3pm‬ on Sky News and Sky One ‪on Saturday 19 May.\n\nImage: Prince Harry and Meghan announced their engagement to the public in November\n\nThe couple say they want it to be \"a big shared event\" that is \"modern, inclusive but still adhering to tradition\", and they want \"everyone\" to be part of their big day.\n\nSo what can we expect from the Royal wedding?\n\nWhen?\n\nPrince Harry and Meghan Markle will get married on Saturday 19 May, at noon.\n\nGuests will arrive between 9.30am and 11am, with members of the Royal family to turn up from 11.20am.\n\nThey will enter St George's Chapel via the Galilee Porch, some on foot and others by car, while Ms Markle and her mother will begin their journey from the bride's overnight location.\n\nAdvertisement\n\nImage: Archbishop of Canterbury Justin Welby will marry the couple\n\nArchbishop of Canterbury Justin Welby - who baptised Meghan in March - will officiate the service, which will take around an hour.\n\nIt will be televised from start to finish and will be followed by a carriage procession starting at 1pm and lasting for about half an hour.\n\nPlease use Chrome browser for a more accessible video player 1:32 When Harry met Meghan\n\nThe main part of the parade will pass along The Long Walk - a two-and-a-half mile (4km) path that links Windsor Castle with Snow Hill in Windsor Great Park.\n\nThe inspiration for the procession is believed to have come from the wedding of Prince Edward and the Countess of Wessex who got married at St George's chapel in 1999.\n\nWhere?\n\nThe couple will tie the knot on the High Altar of St George's Chapel, a 15th Century church on the grounds of Windsor Castle.\n\nImage: The pair sought the Queen's permission to wed in George's Chapel\n\nOne of the first things they will hear as a married couple will be a fanfare from 20 silver-plated trumpets.\n\nAfter the service, Prince Harry and Meghan will leave the chapel through the west entrance and embark on a carriage parade through the town.\n\nImage: They make their vows on the on the High Altar of St George’s Chapel\n\nThe steps of the chapel will be lined by members of the Household Cavalry Mounted Regiment, and members of the Queen's Guard Windsor Castle will line the streets within Windsor Castle.\n\nBank holiday\n\nMembers of the Royal Family normally get married in the week, but as Prince Harry and Meghan are getting married on a Saturday, there won't be a bank holiday.\n\nImage: The Diamond Jubilee in June 2012 was a bank holiday\n\nDespite not getting a day off work, there is some good news for well-wishers - pubs will be open late over the wedding weekend.\n\nThe wedding falls on the same day as the FA Cup final at Wembley Stadium, but with the cup final not expected to kick off until around 5.30pm, it is unlikely to clash with the royal big day.\n\nPubs, bars and other licensed premises will be allowed to keep serving until 1am, instead of the usual 11pm, on the nights of Friday 18 May and the following night, after the wedding.\n\nSecurity\n\nThe wedding operation will be \"amongst the largest in Thames Valley Police's history\", with up to 100,000 people expected on the streets.\n\nImage: There was a heavy police presence for the wedding of Prince William and Kate\n\nMeasures will include barriers to prevent vehicle attacks, armed police patrols and airport-style security searches.\n\nPolice dogs, mounted police and the National Police Air Service will all be used in the run up to the wedding, and on the day itself visitors may be stopped and checked and British Transport Police will be patrolling train stations and carriages.\n\nThames Valley, British Transport Police, the Metropolitan Police and Surrey Police will all be involved in policing the event.\n\nWedding invites\n\nThe gilded invites, printed by Bernard and Westwood, were made using American ink on English card and feature the three-feathered badge of Prince Charles in gold ink.\n\nImage: The invitations follow many years of Royal tradition and have been made by @BarnardWestwood. They feature the Three-Feathered Badge of the Prince of Wales printed in gold ink. Pic: Kensington Palace\n\nGuests\n\nUnlike the wedding of Prince William and Kate Middleton, which was held in Westminster Cathedral with 3,000 guests, this will be a much more intimate event.\n\nApproximately 600 guests have been invited to the ceremony.\n\nAdditionally, 2,640 people have been invited to celebrate inside the castle walls. They won't be part of the congregation, but will all receive a sausage roll and a cup of tea.\n\nImage: Palace aides have said the wedding will be a moment of 'fun and joy'\n\nThe guest list will include 1,200 young people and others who have served their communities and shown strong leadership, 200 people from charities and organisations that the couple have a close association with, and 100 pupils from two local schools.\n\nThe couple have asked that people be chosen from a broad range of backgrounds and ages.\n\nWindsor Castle community members and members of the Royal households and Crown Estate have also been invited.\n\nOne couple told Sky what it was like to receive the \"Hogwarts-style\" invite.\n\nWho's in?\n\nThis is a closely guarded secret, and Kensington Palace has issued no formal guestlist to the press or public.\n\nImage: Queen Elizabeth II has given her formal approval to Harry and Meghan\n\nAs Prince Harry's grandmother and head of state, the Queen will certainly be there.\n\nAll close members of the Royal Family will also be in attendance, along with close friends of the happy couple.\n\nSome foreign royals, senior figures from UK establishments, the church and select politicians - both British and foreign - could also attend.\n\nWith Hollywood starlet Meghan Markle as the bride, a host of sparkling celebrities are also expected to attend (see Celebrities).\n\nWho's out?\n\n:: The President of the United States\n\nThere has been much speculation over whether Donald Trump will attend the ceremony.\n\nImage: US President Donald Trump said he hadn't heard about an invite\n\nA past critic of the American President, Meghan Markle formerly called him \"divisive\" and a \"misogynist\".\n\nWhen asked at the beginning of the year by Piers Morgan whether he had received an invite Mr Trump said, \"not that I know of\".\n\nIn an uncharacteristically gracious tone Mr Trump went on: \"I want them to be happy. I really want them to be happy. They look like a lovely couple.\"\n\n:: Estranged members of Meghan's family\n\nAn only child, Meghan has two half-siblings on her father Thomas Markle's side.\n\nPlease use Chrome browser for a more accessible video player 2:06 Royal wedding: Meet the Markles\n\nHer extended family also includes a host of members from whom she appears to be estranged.\n\nWhile her mother - Doria Ragland - and father are both expected to be at the ceremony, it is not known how many other members of Meghan's extended family will be present (see Meghan's family).\n\nImage: Meghan's half-sister Samantha Markle\n\nMeghan's half-sister, Samantha Markle, who is penning a tell-all book on the family entitled The Diary of Princess Pushy's sister, looks like she may have written herself out of an invite.\n\nIt remains to be seen how many of Meghan's family make it to the ceremony, but one thing is for certain - Prince Harry's family is set to outnumber the Markle clan to a massive degree.\n\n:: The ex-husband\n\nMeghan's ex-husband, Hollywood film producer Trevor Engelson, is also unlikely to be there.\n\nImage: Trevor Engelson was married to Meghan for two years\n\nThe couple divorced in 2013 after two years of marriage citing \"irreconcilable differences\".\n\nNew Royal baby\n\nPrince William and Kate had their third child on 23 April 2018, just less than a month before the wedding.\n\nImage: Kate will give birth to the Royal baby in April - the month before the wedding\n\nThe newborn prince has knocked his uncle - Prince Harry - off his spot as fifth in line to the throne, pushing him down the pecking order to number six.\n\nKensington Palace have said that Prince Louis, who will be just weeks old, will not be attending the wedding.\n\nCelebrities\n\nThe fact that Meghan is an actress means there will be plenty of showbiz faces to spot during the day.\n\nImage: Sarah Rafferty is one of Meghan's closest friends on the set of Suits\n\nFor starters, a fair few of the Suits cast could be there including Meghan's co-stars Patrick J Adams, Gabriel Macht and Sarah Rafferty.\n\nTennis star Serena Williams, singer-songwriter Elton John and former footballer David Beckham are all likely to be present.\n\nImage: The Spice Girls are rumoured to have received an invite\n\nRumour has it that the Spice Girls - Victoria Beckham, Geri Horner, Emma Bunton, Mel B and Melanie Chisholm - may all have received invites to the wedding.\n\nAdditionally, Millie Mackintosh, of Made In Chelsea fame, may well be there, with the pair previously having spent time together at an Oxfordshire spa and Millie rumoured to have been invited to Meghan's top secret hen do.\n\nMeghan's family\n\nMeghan's parents, who divorced when she was six, are expected to be at the wedding.\n\nMeghan's mum, Doria Ragland, 61, is a yoga teacher and social worker who lives in California.\n\nImage: Meghan with her mother Doria Ragland\n\nMeghan's dad, Thomas Markle, 73, a retired TV lighting director now lives in a seaside town in Mexico.\n\nIt is possible that Meghan's half-brother, Thomas Markle Jr, could also be part of the congregation.\n\nIt is less likely that her half-sister Samantha Markle will be there (see Who's out).\n\nImage: Meghan with her father Thomas Markle\n\nHowever, Ashleigh - Samantha's daughter - who is estranged from her mother and said to be on good terms with Meghan, could be on the guest list.\n\nMeghan's uncle on her mother's side, graphic designer Joffrey Ragland, 34, may well be in attendance.\n\nIt is unlikely that Meghan's pet beagle Guy, who moved from Toronto to London with her, will be coming along to help the couple celebrate, although he could rock up at the evening reception.\n\nPlease use Chrome browser for a more accessible video player 1:55 Meghan: Campaigner and Trump critic\n\nThe flowers\n\nThe Royal wedding flowers will be designed by self-taught luxury floral designer Philippa Craddock.\n\nImage: Florist Philippa Craddock will create the floral displays for the wedding\n\nArrangements will feature white garden roses - one of Princess Diana's favourite flowers - and peonies - believed to be a favourite of Meghan's.\n\nBranches of beech, birch and hornbeam will also feature in the floral displays, which will reflect \"wild and natural landscapes\".\n\nAfter the wedding the blooms will be given to different charities.\n\nDress code\n\nThe dress code for guests attending the ceremony is uniform, morning coat or lounge suit, or a day dress with a hat.\n\nBest man\n\nOfficially there is no such thing as a best man at a Royal wedding, which instead uses the term \"supporters\".\n\nImage: Will Prince William 'support' his little brother?\n\nHowever, William was asked to be best man, as Harry was his for his big brother's wedding in 2011.\n\nHowever, Harry did not exactly rush to ask his big brother to help him out on his big day...\n\nPlease use Chrome browser for a more accessible video player 2:02 Prince Harry has not asked William to be his best man... yet\n\nWhen asked about the possibility of being best man or supporter in January, William responded: \"He hasn't asked me yet… So, it could be a sensitive issue.\"\n\nThe Bridesmaids\n\nSome of Meghan Markle's celebrity best friends are being touted as possible bridesmaids - among them tennis ace Serena Williams, actress and UNICEF ambassador Priyanka Chopra and British reality TV star Millie Mackintosh.\n\nImage: Maid of honour Pippa Middleton leads the flower girls and page boys down the aisle\n\nBut while one of her pals may be chosen as maid of honour, none of them are likely to make the cut as Meghan's bridesmaid.\n\nThis is because unless Prince Harry and Meghan break with tradition, the precedent is to have children as attendants.\n\nThe flower girls are likely to be chosen from the children of the Royal Family - Princess Charlotte, who will be three by the time of the wedding, the children of Prince Harry's cousins Mia Tindall, three, Isla Phillips, five, and Savanna Phillips, seven, are among the most likely to be picked.\n\nImage: William and Kate with their bridesmaids and pageboys on the day of their wedding\n\nChildren of some of Meghan's closest pals - including the daughter of stylist Jessica Mulroney Ivy Mulroney, four, and brand curator Benita Litt's two little daughters who Meghan has called her \"fairy god-daughters\" - may also be contenders.\n\nIn the offing to be page boys are third in line to the throne Prince George, four, and Jessica Mulroney's twin boys Brian and John, both seven.\n\nImage: Flower girl Grace van Cutsem is not a fan of Royal weddings\n\nWhile it is likely that Grace van Cutsem - the frowning flower girl at Prince William and Kate's wedding - will be at the wedding, she is unlikely to be a flower girl this time, despite her scene-stealing performance on the Buckingham Palace balcony during Will and Kate's first kiss.\n\nSomething borrowed\n\nThere are rumours that Meghan may wear the same tiara Princess Diana wore on her wedding day to Prince Charles.\n\nImage: Princess Diana wearing the Spencer tiara in Australia in 1983\n\nKnown as the Spencer Tiara, it has not been worn in public since Diana's death.\n\nMeghan's engagement ring is also made out of diamonds made from a bracelet which belonged to Princess Diana (see The Ring).\n\nThe dress\n\nThis is top secret, with much speculation over whether Meghan will go traditional, or step out in something with a more modern twist.\n\nImage: Meghan in white at Westminster Abbey in March\n\nHer stylist bestie Jessica Mulroney is said to have assisted her in picking a designer.\n\nDesigners in the frame include Erdem, Ralph & Russo, Roland Mouret, Inbal Dror and Jenny Packham.\n\nAlexander McQueen - who designed Kate Middleton's lace wedding dress - is also a frontrunner.\n\nAnother stylist friend, Misha Nonoo, is also rumoured to be creating something bespoke for Meghan to wear at the evening reception.\n\nPlease use Chrome browser for a more accessible video player 1:34 The Pledge: Can Meghan survive 'The Firm'?\n\nTalking about her character in Suits, ahead of her engagement to Prince Harry, Meghan told Glamour magazine: \"I personally prefer wedding dresses that are whimsical or subtly romantic.\"\n\nMeghan also said that she loved a \"low, ballerina inspired neckline\".\n\nHer first wedding dress - for her marriage to Trevor Engelson in 2011 - was a white, floor-length strapless gown with a sparkling embellished belt to add a touch of colour.\n\nAs a former soldier, Prince Harry - who is now Captain General of Royal Marines - may be in uniform for the ceremony.\n\nDown the aisle\n\nMeghan's father, Thomas Markle, was due to walk his daughter down the aisle.\n\nThere was much initial speculation over whether the 73-year-old - who is said to value his privacy and keeps out of the limelight - would carry out the duty on the big day.\n\nImage: Will Thomas Markle walk his daughter down the aisle?\n\nAlthough Kensington Palace confirmed his attendance, his poor health has meant he has had to drop out, so he can recover from heart surgery.\n\nInstead, Ms Markle will walk through the Nave of the chapel with her pageboys and bridesmaids and then be joined by Prince Charles at the Quire.\n\nMeghan's mother, Doria Ragland, 61, will also be at the wedding, and will travel with her daughter by car to Windsor Castle.\n\nDiana tribute\n\nPrince Harry is keen to involve Princess Diana's family in the wedding.\n\nImage: Princess Diana will be remembered during the ceremony\n\nAll three of his mother's siblings - Lady Jane Fellowes, Lady Sarah McCorquodale and Earl Spencer - will be attending.\n\nLady Fellowes will give a reading during the ceremony in celebration of her life.\n\nThe music\n\nThe couple have chosen musicians including a Christian gospel choir, a teenage cellist and a Welsh soprano to sing at the ceremony.\n\nImage: Karen Gibson and The Kingdom Choir will be performing at the wedding of Prince Harry and Meghan Markle\n\nKensington Palace said: \"Both Prince Harry and Ms Markle have taken a great interest and care in choosing the music for their service, which will include a number of well-known hymns and choral works.\"\n\nCellist Sheku Kanneh-Mason, the BBC Young Musician of 2016, said he was \"bowled over\" when Meghan called him personally to ask him to play in the chapel during the wedding.\n\nThe rings\n\nMeghan's wedding ring will most likely be Welsh gold - a tradition the Royal Family have held since 1923.\n\nImage: Meghan Markle shows off her engagement ring\n\nIt is not known whether Harry will choose to wear a ring or not - his brother Prince William shunned a ring, while his father Prince Charles wears a gold band.\n\nMeghan's all-diamond, yellow gold engagement ring was designed by Prince Harry.\n\nThe large central diamond was sourced from Botswana - a country the couple have twice visited together - and the two smaller side stones have been taken from a £100,000 ($140,000) diamond bracelet that belonged to Princess Diana.\n\nPlease use Chrome browser for a more accessible video player 0:34 Diana would be 'over the moon, so excited'\n\nPrince Harry said the inclusion of his mother's stones was \"to make sure that she's with us on this crazy journey together\".\n\nThe engagement ring is estimated to be worth upwards of £35,000 ($50,000).\n\nRoyal kiss\n\nThe eagerly awaited first public kiss from the married couple will take place after the ceremony but before the carriage parade.\n\nImage: Charles and Diana kiss on the balcony of Buckingham Palace\n\nOne of the defining moments of the wedding, it is likely to take place on the west steps of St George's Chapel.\n\nPrince William and Kate had their first kiss, following their wedding in Westminster Abbey, on the balcony at Buckingham Palace, mirroring the kiss of Prince Charles and Diana after their wedding in St Paul's Cathedral.\n\nThe Photographer\n\nThe official Royal photographer on Prince Harry and Meghan's big day will be Alexi Lubomirski - the same man who took their engagement photos.\n\nImage: Alexi Lubomirski will be capturing the official Royal wedding images for Prince Harry and Meghan\n\nNo stranger to royalty -\"His Serene Highness Prince Alexi Lubomirski\" to use his full title - is himself of royal lineage, having descended from an influential Polish family who received their hereditary title in the 17th century.\n\nLubomirski, 42, who has snapped the likes of Beyonce, Gwyneth Paltrow and Nicole Kidman, has said he is thrilled to be witnessing \"the next chapter in this wonderful love story\".\n\nThe reception\n\nThe wedding will be followed by not one, but two receptions.\n\nImage: The interior of St George's Hall where the first reception will be held\n\nThe first, which is being hosted by the Queen, will be a lunch for the 600 people who attended the wedding ceremony and will be held at St George's Great Hall.\n\nLater that evening, the second reception, hosted by Prince Charles, will be held in the grounds of Frogmore House.\n\nImage: The second reception will be held in Frogmore House\n\nThe venue near Windsor Castle was also the location for the couple's engagement photos.\n\nMusical acts performing at the reception have yet to be confirmed, but they will no doubt be star names.\n\nImage: An official engagement shot taken in the Frogmore House gardens. Pic: Alexi Lubomirski\n\nEd Sheeran, The Spice Girls, James Blunt and Ellie Goulding are all potential candidates.\n\nThe cake\n\nThe Royal wedding cake will be lemon and elderflower flavour, covered in buttercream and decorated with fresh flowers.\n\nImage: Pastry chef Claire Ptak will make the couple's wedding cake\n\nPrince Harry and Meghan wanted the cake to incorporate the \"bright flavours of spring\" for their May wedding.\n\nIt will be made by American pastry chef Claire Ptak, who runs Violet Cakes in Hackney - an organic hipster bakery in east London.\n\nThe price of the cake is unknown, with the bakery website stating that \"wedding cakes are priced on request\".\n\nThe gifts\n\nPrince Harry and Meghan have asked guests and well-wishers not to get them wedding gifts, but instead to donate money to charity.\n\nImage: Wedding gifts are being eschewed in place of donations to charity\n\nThe seven charities they have chosen reflect their joint passions including sport for social change, women's empowerment, conservation, the environment, homelessness, HIV and the Armed Forces.\n\nThe organisations selected are CHIVA (Children's HIV Association), Crisis, the Myna Mahila Foundation, Scotty's Little Soldiers - a charity for bereaved Armed Forces children, StreetGames, Surfers Against Sewage, and The Wilderness Foundation UK.\n\nInformation on how to make donations is on the Royal Family website, with links to each of the charity's websites to make it as easy as possible to give money.\n\nThe honeymoon\n\nNo location has been confirmed, but if tradition is anything to go by, these three locations are in with a good chance:\n\n:: Botswana, Africa\n\nJust a few weeks into their relationship Prince Harry and Meghan \"camped out with each other under the stars\" here.\n\nImage: Prince Harry and Prince William visit Botswana in 2015\n\nThe couple returned for Meghan's 36th birthday later that year.\n\nPrince Harry, who visited Botswana with Prince William and Prince Charles shortly after Diana's death, has called the South African country his \"second home\".\n\n:: Seychelles\n\nImage: Prince William and Kate honeymooned in the Seychelles\n\nPrince William and Kate spent their honeymoon here, enjoying 10 days of sun, sand and local wildlife.\n\nKate and Wills rented the secluded private North Island to avoid the frenzied media speculation around their vacation.\n\n:: Broadlands, Hampshire\n\nImage: Broadlands, Hampshire, is a Royal honeymoon favourite\n\nThis 18th century English country house is a favourite honeymoon destination for the royals, enjoyed by the Queen and Prince Philip after their wedding in 1947, and Prince Charles in 1981 after his wedding to Diana.\n\nPrince Charles returned in 2005 with his second wife, Camilla, Duchess of Cornwall.\n\nThe couple will not go immediately go on their honeymoon, which Meghan is said to be paying for as a gift to Harry.\n\nRoyal titles\n\nDespite marrying Prince Harry, Meghan will not become Princess Meghan. For that title she would have had to be born into the Royal family.\n\nIf Prince Harry retains his current rank as His Royal Highness Prince Henry of Wales, Meghan will become HRH Princess Henry of Wales.\n\nPlease use Chrome browser for a more accessible video player 21:07 Harry and Meghan's relationship - in their words\n\nHowever, if Prince Harry is promoted to the vacant role of Duke of Sussex - as it is widely expected he will be - Meghan will become HRH Duchess of Sussex.\n\nOther available titles are the Duke of Clarence and the Duke of Buckingham.\n\nRoyal coin\n\nThe Royal Mint have designed a commemorative coin to celebrate Prince Harry and Meghan's marriage.\n\nImage: Various versions of the coin are available\n\nThe coin shows the couple \"looking lovingly into each other's eyes\" in a \"relaxed and informal\" setting.\n\nAn uncirculated version of the coin is priced at £13, a silver proof coin is on sale for £82.50, and the gold proof version will set you back £1,980.\n\nMemorabilia\n\nThe Royal Collection Trust has released an official Prince Harry and Meghan china collection which will be sold at the Queen's Gallery shop at Buckingham Palace.\n\nImage: The choice of Royal wedding memorabilia is mind boggling\n\nThe blue and white china Royal wedding commemorative range which includes tea cups, coffee mugs, tankards, pillboxes and plates all decorated with the couple's initials painted in 22 carat gold.\n\nCeramics designer Emma Bridgwater has also created two bone china half-pint mugs at her Stoke-on-Trent factory to celebrate the wedding, one with the Royal crest and the other with the words \"Game changers, Free Spirits, Big hearts and Well Suited\".\n\nUnofficial commemorative merchandise - of varying degrees of quality - are being sold across the world include tea-towels, dress-the-paper doll book and car bumper stickers.\n\nWhat next?\n\nPrince Harry previously told Sky News he was keen to settle down and start a family but said \"there's a process that one has to go through\".\n\nPlease use Chrome browser for a more accessible video player 0:28 Prince Harry talks about settling down in 2015\n\nNow that \"process\" has begun, bookies have begun taking bets on when Meghan and Harry will become proud parents, with the odds of a 2019 or 2020 Royal baby looking good.\n\nWhen visiting Northern Ireland together in March, the pair met a husband and wife team who make baby products such as hypoallergenic Moses baskets and non-slip baths. Meghan joked \"I'm sure at some point we'll need the whole lot.\"\n\nImage: Prince Harry and his fiancée Meghan Markle meeting well-wishers as they leave Brixton\n\nWatch this space…", "images": ["https://e3.365dm.com/17/11/768x432/skynews-prince-harry-meghan-markle_4167951.jpg?20171127144044", "https://e3.365dm.com/18/04/768x432/skynews-karen-gibson-the-kingdom-choir_4291710.jpg?20180424174948", "https://e3.365dm.com/17/11/736x414/skynews-prince-harry-meghan-markle_4168099.jpg?20171127175409", "https://e3.365dm.com/18/03/768x432/skynews-seychelles-beach-royal_4268067.jpg?20180329185102", "https://e3.365dm.com/18/05/768x432/skynews-harry-meghan-markle_4297914.jpg?20180501105731", "https://e3.365dm.com/18/03/768x432/skynews-prince-harry-botswana_4268053.jpg?20180329183427", "https://e3.365dm.com/17/11/768x432/skynews-prince-harry-meghan-markle_4163833.jpg?20171123113813", "https://e3.365dm.com/18/03/768x432/skynews-harry-meghan-wedding_4262000.jpg?20180322145242", "https://e3.365dm.com/17/11/768x432/skynews-meghan-markle-mother_4168406.jpg?20171128092712", "https://e3.365dm.com/18/03/768x432/skynews-royal-memorabilia-mug_4267963.jpg?20180329165122", "https://e3.365dm.com/16/11/768x432/4d20b82ad03d596f0a85c835c468b7cda7ea9e06504566951ea02cd8a2331927_3826842.jpg?20161108171045", "https://news.sky.com/resources/sky-news-logo-dark.svg?v=1", "https://e3.365dm.com/18/03/768x432/skynews-meghan-markle-prince-harry_4267925.jpg?20180329161520", "https://e3.365dm.com/18/03/768x432/skynews-trevor-engelson-meghan-markle_4268034.jpg?20180329181518", "https://e3.365dm.com/18/03/768x432/skynews-meghan-markle-white_4267940.jpg?20180329162702", "https://e3.365dm.com/17/11/768x432/skynews-tom-markle-meghan-brother_4168451.jpg?20171128105617", "https://e3.365dm.com/22/08/192x108/skynews-meghan-markle-please-see-restrictions_5880281.jpg?20220829160841", "https://e3.365dm.com/18/03/768x432/skynews-kate-middleton-catherine_4267934.jpg?20180329162250", "https://e3.365dm.com/17/11/768x432/skynews-meghan-markle-elle-women-in-television_4167721.jpg?20171127104105", "https://e3.365dm.com/18/03/768x432/skynews-st-george-chapel-windsor_4267811.jpg?20180329142504", "https://e3.365dm.com/18/03/768x432/skynews-st-georges-hall-reception_4267955.jpg?20180329164008", "https://e3.365dm.com/18/03/768x432/skynews-philippa-craddock-prince-harry_4270315.jpg?20180331225722", "https://e3.365dm.com/16/01/768x432/pa-13732074-1-2048x1536_3399991.jpg?20160115022605", "https://e3.365dm.com/18/02/768x432/skynews-the-queen-royal_4229236.jpg?20180212121653", "https://e3.365dm.com/18/03/768x432/skynews-royal-kate-william_4267991.jpg?20180329172342", "https://e3.365dm.com/17/11/768x432/Ut_HKthATH4eww8X4xMDoxOjA4MTsiGN_4168820.jpg?20171128184640", "https://e3.365dm.com/18/01/768x432/skynews-donald-trump-us-president_4209038.jpg?20180119090416", "https://e3.365dm.com/22/09/192x108/skynews-meghan-harry_5888867.jpg?20220905195451", "https://e3.365dm.com/18/03/768x432/skynews-grace-van-cutsem-royal_4267994.jpg?20180329172545", "https://e3.365dm.com/18/02/768x432/2371802210112167207_4236955.jpg?20180221164913", "https://e3.365dm.com/17/12/768x432/skynews-prince-harry-meghan-markle_4188902.jpg?20171221140524", "https://e3.365dm.com/18/03/768x432/skynews-kate-william-security_4268105.jpg?20180329193706", "https://e3.365dm.com/17/11/768x432/skynews-meghan-markle-father-tom_4168401.jpg?20171128092520", "https://e3.365dm.com/22/09/192x108/skynews-meghan-tear-prince-harry_5904976.jpg?20220919154606", "https://e3.365dm.com/18/01/768x432/skynews-justin-welby-archbishop_4195761.jpg?20180101033949", "https://e3.365dm.com/17/11/768x432/skynews-samantha-markle-grant_4168435.jpg?20171128102858", "https://e3.365dm.com/17/08/768x432/c2f9b44fa5677995ce9e49228cf64fe26aa285775eb1c6f8b14125910890d69a_4082524.jpg?20170825134541", "https://e3.365dm.com/18/03/768x432/skynews-princess-diana-tiara_4267947.jpg?20180329163343", "https://e3.365dm.com/18/03/768x432/skynews-prince-harry-meghan-markle_4267926.jpg?20180329161727", "https://news.sky.com/resources/sky-news-logo.svg?v=1", "https://e3.365dm.com/18/03/768x432/skynews-sarah-rafferty-suits_4268038.jpg?20180329182322", "https://e3.365dm.com/18/03/768x432/skynews-pippa-middleton-royal-wedding_4268112.jpg?20180329194600", "https://e3.365dm.com/18/03/768x432/skynews-high-alter-st-georges-chapel_4267806.jpg?20180329142346", "https://e3.365dm.com/18/04/768x432/skynews-alexi-lubomirski-photographer_4281537.jpg?20180413140310", "https://e3.365dm.com/18/03/768x432/skynews-frogmore-house-windsor_4267952.jpg?20180329163732", "https://e3.365dm.com/18/01/768x432/skynews-prince-harry-meghan-markle_4201889.jpg?20180109212130", "https://e3.365dm.com/18/05/768x432/skynews-royal-promo-wedding_4298788.jpg?20180502125812", "https://e3.365dm.com/17/11/768x432/skynews-prince-harry-meghan-markle_4168113.jpg?20171127180558", "https://e3.365dm.com/18/01/768x432/Ut_HKthATH4eww8X4xMDoxOjA4MTsiGN_4202832.jpg?20180111073358", "https://e3.365dm.com/18/01/768x432/skynews-prince-william-duke-of-cambridge_4209156.jpg?20180119120440", "https://e3.365dm.com/17/11/768x432/skynews-royal-meghan-markle_4167965.jpg?20171127144658", "https://e3.365dm.com/18/03/768x432/skynews-broadlands-hampshire_4267956.jpg?20180329164245", "https://e3.365dm.com/17/12/768x432/skynews-meghan-markle-prince-harry_4171284.jpg?20171201121622", "https://e3.365dm.com/18/03/768x432/skynews-violet-bakery-royal-wedding-cake_4260252.jpg?20180320102549", "https://news.sky.com/resources/sky-spectrum-logo.png", "https://e3.365dm.com/18/04/768x432/skynews-wedding-present-gift_4281649.jpg?20180413160039", "https://e3.365dm.com/17/11/1600x900/skynews-prince-harry-meghan-markle_4168099.jpg?20171127175409", "https://e3.365dm.com/18/02/768x432/skynews-victoria-beckham-spice-girls_4221011.jpg?20210701171202"], "top_img": "https://e3.365dm.com/17/11/1600x900/skynews-prince-harry-meghan-markle_4168099.jpg?20171127175409", "keywords": [], "authors": ["Sky Uk Limited", "Bethany Minelle", "News Reporter"], "canonical_link": "https://news.sky.com/feature/royal-wedding-2018-the-ultimate-guide-to-harry-and-meghans-big-day-11302267", "title": "Royal wedding 2018: Ultimate guide", "meta_data": {"smartbanner": {"title": "Sky News: Breaking, UK & World", "author": "Sky UK Limited", "price": "FREE", "price-suffix-apple": "- On the App Store", "price-suffix-google": "- In Google Play", "icon-apple": "https://e0.365dm.com/skynews/apple-touch-icon.png", "icon-google": "https://e0.365dm.com/skynews/apple-touch-icon.png", "button": "VIEW", "button-url-apple": "https://apps.apple.com/gb/app/sky-news-breaking-uk-world/id316391924", "button-url-google": "https://play.google.com/store/apps/details?id=com.bskyb.skynews.android", "enabled-platforms": "android", "close-label": "Close", "hide-ttl": 604800000, "include-user-agent-regex": "CriOS", "disable-positioning": "true", "api": "true"}, "apple-itunes-app": "app-id=316391924", "description": "Royal wedding 2018: Ultimate guide", "robots": "NOODP,INDEX,FOLLOW,max-snippet:-1,max-image-preview:large,max-video-preview:-1", "viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "format-detection": "telephone=no", "HandheldFriendly": "True", "twitter": {"card": "summary_large_image", "site": "@skynews", "title": "Royal wedding 2018: Ultimate guide", "description": "Royal wedding 2018: Ultimate guide", "image": {"identifier": "https://e3.365dm.com/17/11/768x432/skynews-prince-harry-meghan-markle_4168099.jpg?20171127175409", "alt": "Prince Harry and Meghan Markle"}, "app": {"country": "GB", "id": {"iphone": 316391924, "ipad": 316391924, "googleplay": "com.bskyb.skynews.android"}}}, "fb": {"app_id": 744976955573926}, "og": {"site_name": "Sky News", "locale": "en_GB", "title": "Royal wedding 2018: Ultimate guide", "description": "Royal wedding 2018: Ultimate guide", "url": "https://news.sky.com/feature/royal-wedding-2018-the-ultimate-guide-to-harry-and-meghans-big-day-11302267", "type": "article", "image": "https://e3.365dm.com/17/11/1600x900/skynews-prince-harry-meghan-markle_4168099.jpg?20171127175409"}}, "movies": [], "publish_date": null, "source": "https://news.sky.com", "summary": ""}