{"url": "https://en.wikipedia.org/wiki/Pitch_Perfect_2", "text": "2015 American film by Elizabeth Banks\n\nPitch Perfect 2 is a 2015 American musical comedy film directed and produced by Elizabeth Banks (in her feature directorial debut) and written by Kay Cannon. It is a sequel to the 2012 film Pitch Perfect and the second installment in the Pitch Perfect film series. The film centers on the fictional Barden University Bellas, an all-female a cappella singing group, who try to beat out a competing German musical group in a world singing championship. The film features Anna Kendrick, Rebel Wilson, Brittany Snow, Skylar Astin, Adam DeVine, Anna Camp, Ben Platt, Hana Mae Lee, Alexis Knapp, Ester Dean, Kelly Jakle, Shelley Regner, John Michael Higgins, and Banks all reprising their roles from the previous film, now joined by Hailee Steinfeld, Katey Segal, Birgitte Hjort Sørensen, and Flula Borg.\n\nIt was released in the United States on May 15, 2015 by Universal Pictures. The film received generally positive reviews from critics and grossed over $287 million worldwide. It surpassed the total gross of the original film ($115.4 million) in five days, and also became the highest-grossing music comedy film of all-time, overtaking School of Rock ($131.3 million).[5] A sequel, Pitch Perfect 3, was released on December 22, 2017.[6][7]\n\nPlot [ edit ]\n\nIn 2015, three years after winning their first championship, the Barden Bellas are now led by senior Beca Mitchell and three-time super senior Chloe Beale. The Bellas have been the ICCA National champions for three consecutive years. However, a national scandal (dubbed \"Muffgate\") erupts when Patricia \"Fat Amy\" Hobart accidentally rips her pants in front of U.S. President Barack Obama during his birthday performance at the Kennedy Center, exposing her genitalia due to her lack of underwear. The incident leads to the Bellas' suspension from the ICCAs.\n\nHowever, they are not stripped of their competitive titles, leading Beca to make a deal that they can be reinstated should they win the A Cappella World Championship. Freshman Emily Junk begins her college career, hoping to follow in the footsteps of her mother, Katherine, by becoming a Bella. At orientation, she watches an A Cappella performance by the Treblemakers, now led by Beca's boyfriend Jesse Swanson. Jesse' best friend, Benjamin \"Benji\" Applebaum, develops a crush on Emily at first sight. The Bellas learn that Das Sound Machine (DSM), a German powerhouse group, has replaced them on their victory tour and is the favorite to win the Worlds. Additionally, Beca has started an internship at recording studio Residual Heat, something only Jesse knows (and Fat Amy later discovers).\n\nAs the Bellas' suspension means they cannot hold auditions, Emily goes directly to their sorority house. She sings her unfinished song \"Flashlight,\" impressing them; they decide she can join, as since she came of her own accord, they technically aren't breaking any rules. The Bellas meet DSM when the latter performs at a car show; the group, led by intimidating duo Pieter Krämer and Kommissar, takes delight in mocking the Bellas. Later, both groups are invited to an exclusive riff-off; also in attendance are the Treblemakers, the Tone Hangers (a group composed of former Treblemakers, including previous leader Bumper Allen, with whom Amy is in a no-strings-attached relationship), and the Green Bay Packers.\n\nThe Bellas make it to the final two, but lose to DSM when Emily panics and sings \"Flashlight\", violating the tradition of singing non-original songs. Bumper surprises Amy with a traditional date and asks her to officially be his girlfriend; she refuses, leaving him devastated. At a practice performance for the Worlds, the Bellas' planned set ends in disaster when their incorporation of pyrotechnics sets Cynthia Rose's hair on fire. In order to rediscover their roots and synchronicity, Chloe takes them to a retreat led by former Bella Aubrey Posen. The truth about Beca's internship comes out, and she starts a heated debate with Chloe over her obsession with the group and accuses the other Bellas of not thinking about their futures. She angrily storms off, only to step into one of the camp's hidden bear traps. In a panic, she apologizes for her harsh words, before being saved by Lilly. Later, the Bellas accept that they must go their separate ways after graduation, and regain harmony by singing \"When I'm Gone\", the song Beca used to audition for the group.\n\nAmy realizes she regrets ending things with Bumper, and the two reconcile the next day. Meanwhile, Beca's boss at her internship has been unimpressed with everything she has presented to him so far, so Beca offers to help Emily produce \"Flashlight\" at the studio to demonstrate her true abilities. When they show him the demo, he expresses envy for their talent and says he looks forward to working with them. The senior Bellas graduate, and the group heads to Copenhagen for the World Finals. Before their performance, Emily and Benji share a kiss. The Bellas deliver a stellar stripped-down performance, ending in a harmonized version of \"Flashlight\" with Aubrey, Katherine, and other past Bellas joining in. They win the championship, repairing their damaged legacy. As the senior Bellas leave Barden, they give Emily a belated initiation ceremony, with Amy demonstrating the last tradition: christening the house by sliding down the staircase.\n\nCast [ edit ]\n\nAdditionally, Keegan-Michael Key appears as Sammy, Beca's boss at Residual Heat, a rude but successful producer, Shawn Carter Peterson appears as Dax, an intern at Residual Heat, David Cross (credited as Sir Willups Brightlysmore) appears as the Riff-Off host, Pentatonix members Scott Hoying, Kirstie Maldonado, Mitch Grassi, Avi Kaplan, and Kevin Olusola appear as Team Canada, Penn Masala appears as Team India, the Naan Stops, and Filharmonic appears as Team Philippines\n\nGreen Bay Packers players Clay Matthews, David Bakhtiari, Don Barclay, Josh Sitton and T. J. Lang play themselves in cameos. Also appearing as themselves are Snoop Dogg, Natalie Morales, Jake Tapper, Joe Scarborough, Mika Brzezinski, Jimmy Kimmel, Rosie O'Donnell, Rosie Perez, Lucas Grabeel, Nicolle Wallace, Jordan Rodgers, Christina Aguilera, Adam Levine, Blake Shelton and Pharrell Williams. Robin Roberts, C.J. Perry and Kether Donohue appear as Legacy Bellas during the finale. Additionally, President Barack Obama, First Lady Michelle Obama and Shonda Rhimes briefly appear via archive footage.\n\nProduction [ edit ]\n\nIn December 2012, Skylar Astin revealed that he and Rebel Wilson had had meetings with Universal Studios about the potential sequel.[8] In April 2013, it was confirmed that a sequel would be released in 2015.[9] Elizabeth Banks directed the sequel, and Kay Cannon returned as screenwriter.[10] Paul Brooks produced for Gold Circle Films with Banks and Max Handelman producing for Brownstone Productions.[10] Deke Sharon returned as vocal producer, and has a brief cameo as a German reporter.[11] As in the first movie, they ran a month of \"a cappella boot camp\" before filming.[12]\n\nCasting [ edit ]\n\nAnna Kendrick and Wilson returned to the cast early in 2014 to play the characters they originated in the first film.[13] Brittany Snow reprised her character.[14] On April 24, Chrissie Fit was added to the cast.[15] On May 1, Hailee Steinfeld was added to the cast, playing a new member of the Barden Bellas.[16] On May 5, Adam DeVine was reported to return in the film.[17] On May 14, Katey Sagal was added to the cast, playing Steinfeld's character's mother.[18] On May 29, Flula Borg was added to the cast,[19] playing the leader of Das Sound Machine.[20] It was confirmed on June 18, 2014 that Christopher Shepard was added to the cast.[21] It was confirmed on June 19, 2014 that Pentatonix would play the role of a rival group to the Barden Bellas.[22] It was later confirmed that The Filharmonic from season 4 of The Sing Off would make a cameo appearance as a rival group from the Philippines.[23] On August 24, 2014 it was announced that Penn Masala,[24] the all-male Hindi a cappella group from director Elizabeth Banks's and producer Max Handelman's alma mater The University of Pennsylvania, would be featured as a team from Southeast Asia.[25] On June 25, Birgitte Hjort Sørensen was confirmed added to the cast.[26]\n\nFilming [ edit ]\n\nOn May 21, 2014, principal photography began at Louisiana State University (LSU) campus in Baton Rouge.[27]\n\nMusic [ edit ]\n\nOn December 3, 2014, Mark Mothersbaugh was hired to compose the music for the film.[28] The official soundtrack was released on May 12, 2015.[29] The special edition soundtrack was later released on August 8, 2015.[30]\n\nThe original album debuted at number one on the Billboard 200, earning 107,000 album-equivalent units (92,000 copies of traditional sales) in the week ending May 17, 2015.[31]\n\nWeekly charts\n\nYear-end charts\n\nChart (2015) Position Australian Albums (ARIA)[44] 27 US Billboard 200[45] 52\n\nRelease [ edit ]\n\nThe film was released on May 7, 2015 in Australia and New Zealand, and May 15 in the United States and Canada.[46]\n\nMarketing [ edit ]\n\nA still from the rehearsals for the film was revealed on May 16, 2014.[47] The poster was released on November 18, 2014 and the trailer came out the following day. A second trailer was aired during Super Bowl XLIX on February 1, 2015.[48]\n\nHome media [ edit ]\n\nDirector Elizabeth Banks stated an additional performance by the Treblemakers was filmed specifically for the DVD release. Also included on the DVD will be deleted scenes.[49] On May 20, 2015, it was announced that FX Networks had acquired U.S. television broadcasting rights to the film.[50]\n\nThe Blu-ray and DVD editions of Pitch Perfect 2 were released on September 22, 2015 in the U.S.[51] with a Target-exclusive edition containing additional bonus features being released the same day.[52] Pitch Perfect 2 was released on 4K UHD Blu-Ray on March 20, 2018.[53]\n\nReception [ edit ]\n\nBox office [ edit ]\n\nPitch Perfect 2 grossed $184.2 million in the United States and Canada, and $103.2 million in other territories, for a worldwide total of $287.5 million, against a production budget of around $29 million.[4] In its first five days, the film surpassed the total gross of the original ($115.4 million), and also overtook School of Rock ($131.3 million) for the highest grossing musical-comedy of all-time and the third greatest musical debut ever (behind Beauty and the Beast's $174.8 million in 2017 and The Lorax's $70.4 million in 2012).[5] Deadline Hollywood calculated the net profit of the film to be $139.6 million, when factoring together all expenses and revenues for the film.[54]\n\nIn the United States and Canada, Pitch Perfect 2 grossed $4.6 million from Thursday night showings and $27.8 million on its opening day, increasing the opening weekend projections from $40 million to $64 million.[55] In its opening weekend, the film grossed $69.2 million, finishing first at the box office.[56] The opening weekend gross was more than the entire North American total gross of the first film ($65 million), is the third biggest PG-13 comedy opening of all-time (behind The Simpsons Movie's $74 million in 2007 and Austin Powers in Goldmember's $73 million in 2002) and the highest grossing opening ever for a musical.[57] The opening weekend audience was 75% female.[58]\n\nOutside North America, the film opened at number one in Australia and New Zealand, earning $7.6 million and $1.2 million respectively.[59]\n\nCritical response [ edit ]\n\nOn Rotten Tomatoes, the film has an approval rating of 65% based on 217 reviews and an average rating of 6/10. The site's critical consensus reads, \"Pitch Perfect 2 sings in sweet comedic harmony, even if it doesn't hit quite as many high notes as its predecessor.\"[60] On Metacritic, the film has a weighted average score of 63 out of 100, based on 39 critics, indicating \"generally favorable reviews\".[61] Audiences polled by CinemaScore gave the film an average grade of \"A−\" on an A+ to F scale.[62]\n\nLeslie Felperin of The Hollywood Reporter wrote: \"Reprising the kind of musical performances, campus hijinks, stinging humor and sassy sisterhood put in place by its eminently likeable predecessor, Pitch Perfect 2 remixes the elements and comes up with something even slicker and sharper.\"[63] Guy Lodge of Variety called it an \"ebulliently entertaining, arguably superior sequel to the 2012 musical comedy hit.\" Lodge added, \"Kay Cannon's script is even lighter on narrative than its predecessor, but fills any resulting void with a concentrated supply of riotous gags, and a renewed emphasis on the virtues of female collaboration and independence.\"[64] Peter Travers of Rolling Stone gave the film 3 out of 4 stars. Travers welcomed the addition of Steinfeld, praised Wilson for her continued scene stealing, and said the scenes with Keegan-Michael Key were gold. He reserved his highest praise for Banks, for both her acting and her feature debut as director, praising her for \"bringing fizz to the tiredest clichés and reveling in a screen full of musical girl power.\"[65]\n\nRichard Roeper of the Chicago Sun-Times gave it a mixed review, saying \"Pitch Perfect 2 strains to find some plot conflicts while balancing the line between satire and rousing musical numbers.\"[66] Michael Phillips of the Chicago Tribune called it \"a two-hour lesson in how to act like a frenemy to your alleged friends. And it's not funny enough.\"[67] David Edelstein of New York Magazine gave the film a negative review and, despite having reviewed the first film positively, thought the sequel was \"A Ca-Terrible\". Edelstein was critical of the script, \"There are good ideas that needed another pass\", and Kendrick's performance \"I've never seen her so flat-out bad — distracted, depressed, conviction-less\" although he does concede that the climactic number was excellent.[68]\n\nRodrigo Perez at IndieWire wrote \"The movie's off-color humor also doesn't connect like it once did either. The casual racism, homophobia and sexism might be tolerable if any of it was remotely funny, but none of it is.\"[69] Kevin Fallon of The Daily Beast liked the film but was critical of the \"tone-deaf racial jokes\", particularly the casual racism in the subplot about Flo, a senior Bella singer from Guatemala. He also did not find the racially charged jokes from the commentators funny.[70][71][72]\n\nAccolades [ edit ]\n\nBillboard Music Awards\n\nTeen Choice Awards\n\nPeople's Choice Awards\n\nKids Choice Awards\n\nFavorite Movie (lost to Star Wars: The Force Awakens )\n\n) Favorite Movie Actress (Anna Kendrick, Rebel Wilson, lost to Jennifer Lawrence)\n\nMTV Movie Awards\n\nGolden Raspberry Awards\n\nSequel [ edit ]\n\nOn April 11, 2015, a month before the release of Pitch Perfect 2, it was announced that Rebel Wilson would return for a third film, although she stated that she did not know if Anna Kendrick or any of the other cast members would also be reprising their roles. She added that she would be \"up for a Fat Amy spin-off,\" although nothing had yet been confirmed.[76] Director, star, and producer Elizabeth Banks acknowledged the possibility of a third film, saying, \"I will say, it would be disingenuous to say that no one's talking about a Pitch Perfect 3; the possibility of it. We are really focused on getting as many butts in seats for this one. If fans embrace it, we are going to seriously think about what the continuing journey would look like, but we don't know what that is yet\".[77]\n\nOn June 10, 2015, a third film was officially confirmed, with Kay Cannon returning to write the script.[78] Several days later it was announced both Kendrick and Wilson would reprise their roles, and later Brittany Snow was also confirmed to return.[6] Banks returned to produce, but in June 2016 it was announced she would not be directing the film.[79]\n\nThe film was originally slated for a July 21, 2017 release, and was later pushed back to August 4, 2017 before moving back to the July 21 slot.[7] In May 2016 it was moved again, this time being pushed back to December 22, 2017.[80]", "images": ["https://upload.wikimedia.org/wikipedia/en/3/3f/Pitch_Perfect_2_poster.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/3/3f/Pitch_Perfect_2_poster.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Pitch_Perfect_2", "title": "Pitch Perfect 2", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/3/3f/Pitch_Perfect_2_poster.jpg", "width": 640, "height": 1012}, "title": "Pitch Perfect 2 - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}