{"url": "https://www.hollywoodreporter.com/live-feed/office-revival-works-at-nbc-1069099", "text": "Hot on the success of the return of Will & Grace, NBC is looking to revive another of its beloved comedies: The Office.\n\nSources confirm to The Hollywood Reporter that the network is looking to bring back the former Steve Carell starrer for another season. Carell, however, will not return. A search is underway to find a new star to take over as the show’s Michael Scott-like regional manager of paper supply company Dunder Mifflin. NBC and producers Universal Television declined comment. TV Line was first to report the news.\n\nSources told THR in August that The Office may be revived with a new cast and creator Greg Daniels attached. At the time, NBC and producers Universal Television said those rumors were not true. That speculation has now grown more real as the network is said to be in talks for a revival.\n\nThe Office ran for nine seasons on NBC as part of the network’s Thursday comedy brand. The show — which made stars out of Carell, Rainn Wilson, John Krasinski, Jenna Fischer, Craig Robinson, Ellie Kemper and Mindy Kaling, among others — was an awards-season staple, taking home multiple Emmys, Golden Globes and other top prizes. Carell exited after season seven, with The Office continuing on for two additional cycles before the star returned for the series finale in 2013.\n\nCreator Greg Daniels, who adapted the show from the British comedy starring Ricky Gervais, told THR in November 2016 that he was happy with how the NBC series ultimately ended. “I feel like I did in the finale what that would have been because I jumped forward in time as, like a reunion of the characters, and so, to me, I think that was it. It said everything that the show had to say,” he told THR when asked if he’d be open to a U.S. follow-up as Gervais was plotting a movie revival of his own. “Personally, I feel like we left on a good note. I’m not that anxious to open it up again myself, but I would be interested to see what David Brent’s up to. But also I think the American show became so much of an ensemble and to not have the whole ensemble there would just feel kind of, I don’t know, less than. So I don’t want to criticize what he’s doing, I think that’s great, but I’m okay with us having had our finale.”\n\nNews of a potential continuation of The Office comes as NBC has found ratings and awards-season fortune with its Will & Grace revival. (The reboot scored an early renewal ahead of its return in September.)", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2015/09/office_us_season2_xmas_0.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2015/09/office_us_season2_xmas_0.jpg?w=2000&h=1126&crop=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2015/09/office_us_season2_xmas_0.jpg?w=1024", "keywords": [], "authors": ["Lesley Goldberg"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/office-revival-works-at-nbc-1069099/", "title": "‘The Office’ Revival in the Works at NBC", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Former star Steve Carell would not be involved.", "news_keywords": "autoplay, NBC, The Office", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Lesley Goldberg", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1069099, "title": "'The Office' Revival in the Works at NBC", "published_at": "2017-12-18 16:36:59", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2015/09/office_us_season2_xmas_0.jpg?w=1024", "comment_count": 0, "tags": "The Office", "topics": "TV News", "body": "Hot on the success of the return of Will & Grace, NBC is looking to revive another of its beloved comedies: The Office.\r\nSources confirm to The Hollywood Reporter that the network is looking to bring back the former Steve Carell starrer for another season. Carell, however, will not return. A search is underway to find a new star to take over as the show's Michael Scott-like regional manager of paper supply company Dunder Mifflin. NBC and producers Universal Television declined comment. TV Line was first to report the news.\r\nSources told THR in August that The Office may be revived with a new cast and creator Greg Daniels attached. At the time, NBC and producers Universal Television said those rumors were not true. That speculation has now grown more real as the network is said to be in talks for a revival.\r\nThe Office ran for nine seasons on NBC as part of the network's Thursday comedy brand. The show — which made stars out of Carell, Rainn Wilson, John Krasinski, Jenna Fischer, Craig Robinson, Ellie Kemper and Mindy Kaling, among others — was an awards-season staple, taking home multiple Emmys, Golden Globes and other top prizes. Carell exited after season seven, with The Office continuing on for two additional cycles before the star returned for the series finale in 2013.\r\nCreator Greg Daniels, who adapted the show from the British comedy starring Ricky Gervais, told THR in November 2016 that he was happy with how the NBC series ultimately ended. \"I feel like I did in the finale what that would have been because I jumped forward in time as, like a reunion of the characters, and so, to me, I think that was it. It said everything that the show had to say,\" he told THR when asked if he'd be open to a U.S. follow-up as Gervais was plotting a movie revival of his own. \"Personally, I feel like we left on a good note. I’m not that anxious to open it up again myself, but I would be interested to see what David Brent’s up to. But also I think the American show became so much of an ensemble and to not have the whole ensemble there would just feel kind of, I don’t know, less than. So I don’t want to criticize what he’s doing, I think that’s great, but I’m okay with us having had our finale.\"\r\nNews of a potential continuation of The Office comes as NBC has found ratings and awards-season fortune with its Will & Grace revival. (The reboot scored an early renewal ahead of its return in September.)", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘The Office’ Revival in the Works at NBC", "url": "https://www.hollywoodreporter.com/tv/tv-news/office-revival-works-at-nbc-1069099/", "description": "Former star Steve Carell would not be involved.", "site_name": "The Hollywood Reporter", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2015/09/office_us_season2_xmas_0.jpg?w=1024", "locale": "en_US"}, "article": {"published_time": "2017-12-18T16:36:59+00:00", "modified_time": "2017-12-19T11:31:05+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘The Office’ Revival in the Works at NBC", "description": "Former star Steve Carell would not be involved.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2015/09/office_us_season2_xmas_0.jpg?w=3000"}}, "movies": [], "publish_date": 1513615019.0, "source": "https://www.hollywoodreporter.com", "summary": ""}