{"url": "https://tv.avclub.com/rupaul-s-drag-race-delivers-10s-across-the-board-with-a-1824004768", "text": "Fear not, squirrelfriends. After a disappointing season of All Stars, RuPaul’s Drag Race is back on its A-game with “10s Across The Board,” a thrilling, hilarious premiere introducing an exciting lineup of new queens while honoring the show’s past for this milestone season. The new girls eliminate the staleness of All Stars 3, and as Drag Race continues, the caliber of contestant is only going to improve as queens create their drag personas with the series in mind. There’s a big difference between a great drag queen and a great Drag Race queen, and being in front of the camera on an international stage adds new challenges that not every queen is ready to face.\n\nBut queens are out there preparing, and they are spending years honing their talents so they can make it on the show and slay the competition. Queens like Mayhem Miller, who has auditioned season after season and arrives on the scene like a freight train of fabulous. Coming from the same drag family as Morgan McMichaels, Raven, Delta Work, and Detox, Miller is one of three queens who already has a strong connection to Drag Race: Miz Cracker is Bob’s drag daughter (part of the House Of The Drag Queen) and Vanessa Vanjie Mateo is Alexis Mateo’s drag daughter. But having family that knows the game doesn’t mean you’ll be good at it, and while Mayhem and Cracker impress, Vanessa crashes and burns in this first challenge.\n\n\n\nAdvertisement\n\nWith season nine and All Stars season three, Drag Race felt like a Logo show on VH1, but season 10 takes advantage of the series’ new home and its much deeper pockets. The move to VH1 has helped the show significantly grow in popularity, and the network is making Drag Race a more prominent part of its programming, expanding each episode’s length to 90 minutes and bringing Untucked back to television. That’s a two-hour block of Drag Race, and this premiere does a lot with that extra space. We get an all-time great mini-challenge where the queens take it to the runway in front of a crowd of Drag Race veterans, and there’s enough time to show off both the new contestants and the returning favorites. It all feels like one big celebration, kicking off this season with a rush of good vibes as we see the future of this series directly interact with its past.\n\nThe mini-challenge bombards us with drag excellence, and then the maxi-challenge tests the queens to see if they can stay at that level when they have to create a look with limited resources. It’s the return of Drag On A Dime, which should really be a challenge every season because it requires so many skills to pull off well. It’s easier to be a drag queen when you can afford expensive garments, and RuPaul wants to see what these girls can do when they’re put in a position where they have to craft something by hand. Knowledge of fashion design and garment construction are key, and the queens have to present themselves with total confidence when they hit the runway, even if they look like shit.\n\n\n\nOver a third of this season’s queens come from the New York City drag scene—Aquaria, Dusty Ray Bottoms, Miz Cracker, Monét X Change, and Yuhua Hamasaki—and they arrive prepackaged with rich dramatic material. You can see the other queens tense up as more and more NYC girls walk into the room and excitedly react to each other, and there’s a reasonable fear that a clique will form. The New Yorkers are mostly supportive of each other right now, but that camaraderie will fade over the course of the season. Some of these relationships are already very tense, and the rivalry between Aquaria and Miz Cracker is a major plot point in this episode and Untucked. That could make for some very good TV, and while Aquaria accuses Cracker of stealing her look, Cracker has a better showing in this episode. Feathers are being ruffled, and it’s only a matter of time before resentment takes over and these queens start coming for each other.\n\nAdvertisement\n\nMiz Cracker’s biggest strength is her sense of humor, and she enters the workroom loaded with one-liners for her competitors and the cameras: “I’m thin, I’m white, and I’m very salty, and that’s what makes me a cracker. As a performer I’m wild, Barbie on bath salts. Come for the face, stay for the crazy.” When she introduces herself to the others, she responds to Eureka and Asia O’Hara’s shocked reactions by clarifying, “Just like the snack and the racial slur.” She’s similarly prepared for the judges, and she responds to their praise with comments that consistently make them all laugh. The judges really like Miz Cracker, but Mayhem’s look is so striking that the judges give her the win, which summons a massive swell of emotion from Mayhem, who has been desperately seeking the validation of this series. She cries a lot in this episode, and the rawness of her emotion makes it easy to root for her. She wants this so bad, and that passion is paired with a high level of craft to make her a formidable competitor.\n\nI generally agree with the judges’ top and bottom picks, but Monique Heart deserves to be in the top with her stunning playing-card look, which is so dramatic and imaginative that it’s being used in the trailers for this season. “Bitch I was stunning,” she says in her cutaway interview. “#Bitter.” And she’s right. She has impressive construction skills; a bold, imaginative design sensibility; and she takes total control of the runway, which is something that can’t be said for Blair St. Clair, a top queen who is also one of the episode’s most boring. Blair is pretty, but there’s no personality there, and she’ll never make it to Broadway with such a bland, demure stage presence.\n\nAdvertisement\n\nYuhua Hamasaki is also in the top for her caution-tape gown, and she takes a concept that has been done in the past and puts her own spin on it. She’s a gorgeous queen with a quick wit and strong sewing ability—an Asian Bianca Del Rio that doesn’t go full-clown—and she has the episode’s most immediately GIF-able moment when she attempts a cartwheel in a kimono and fails miserably. Fellow New Yorker Dusty Ray Bottoms doesn’t fare as well with the judges, and while they mostly like her look, they have issues with her signature dot-based makeup, which does look a lot like a skin condition. We get to hear why Dusty paints her face that way, and one of the things I most enjoy about this episode is that it actually has the queens talking about their process, reinforcing the artistry of drag and using the face and body as a canvas.\n\nAdvertisement\n\nSome queens are better artists than others, but this is also a competition about personality, which is where bottom-two queen Vanessa Vanjie Mateo makes her big impression. She’s far more endearing than her lip-sync opponent, Kalorie Karbdashian Williams, whose looks are as underwhelming as her commentary. Vanessa sounds like Ice-T, and a lot of her charm comes from the contrast of her voice and her appearance. She has clever one-liners, like this line that unfortunately foreshadows her fate: “I ain’t trying to be Porkchop. I’m trying to be fish fillet.” She’s more of a fish stick on the runway with a Barbie-doll bodice that gives her no definition, and she flounders in the lip sync to Christina Aguilera’s “Ain’t No Other Man.” Untucked gives a deeper look at Vanessa’s emotional state heading into the lip sync, and it’s clear that the pressure of the competition is getting to her. She’s caving under the weight of her drag pedigree and the expectations of her fans back home, and she’s not focused on giving the best possible lip-sync performance.\n\nKalorie gives a much more passionate performance, and she makes big choices that get the judges’ attention. She thinks she’s much better at twerking than she actually is, but at least she goes for it. Her money dress may have sucked, especially in comparison to the multiple past queens who have done similar looks much better, but it does give her the opportunity to throw cash into the air like confetti without it coming across as a desperate move. The time to whip out this trick is when you’re wearing a dress covered in bills, and Kalorie wins this lip-sync when she jumps into a split after making it rain. There’s a hunger in her performance that highlights why lip-syncing for your life is so much more entertaining than lip-syncing for your legacy, but after seeing what some of the other queens can do in performance during the mini-challenge, I don’t think Kalorie will survive many more lip-syncs.\n\nAdvertisement\n\nI can’t wait to see where this season goes from this point, because the premiere is jam-packed with promise. There’s considerable drama brewing, and hopefully the extended runtime means that personal conflicts won’t overtake the drag the way they did in All Stars 3. This episode achieves an excellent balance of both elements, and it makes me very optimistic about the future of this series.\n\nStray observations:", "images": ["https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/f5zr3vuc90hrpnmx0nme.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,fl_progressive,g_center,h_264,q_80,w_470/b79608df135ebc4b059a2cdad3a83176.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/kqnkjlylkf7tymsqmoqr.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/52a29fe0001de9a08e76ea6d559528e9.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/u0939doeuioaqhspkjyc.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/j59upeyynundqjvbmcwj.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/v4sckews2f3bzf0ztbkf.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/aqhdzcldymb9mkltfhxh.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/rnxqtvv6advgidzfs6am.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/f2b6295902a8e0a7c4d168840e7b3d51.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/eti2h1r4wg0bqxctxenl.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/muaaluj2wznfomol9ero.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/no63bw902mddhwxtjtxh.png"], "top_img": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png", "keywords": [], "authors": [], "canonical_link": "https://www.avclub.com/rupaul-s-drag-race-delivers-10s-across-the-board-with-a-1824004768", "title": "RuPaul’s Drag Race delivers 10s across the board with an exhilarating premiere", "meta_data": {"google-site-verification": "QDPLbDJXTQNT0n69mvNADCeRmwnbkYyL20OKJAVCKq8", "ir-site-verification-token": "-1270174611", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0,maximum-scale=10.0", "ROBOTS": "INDEX, FOLLOW", "msapplication-square70x70logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/no63bw902mddhwxtjtxh.png", "msapplication-square150x150logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_200,q_80,w_200/no63bw902mddhwxtjtxh.png", "keywords": "rupaul's drag race, rupaul, vh1, The A.V. Club", "news_keywords": "rupaul's drag race, rupaul, vh1, The A.V. Club", "twitter": {"url": "https://www.avclub.com/rupaul-s-drag-race-delivers-10s-across-the-board-with-a-1824004768", "card": "summary_large_image", "site": "theavclub", "title": "RuPaul’s Drag Race delivers 10s across the board with an exhilarating premiere", "description": "Fear not, squirrelfriends. After a disappointing season of All Stars, RuPaul’s Drag Race is back on its A-game with “10s Across The Board,” a thrilling, hilarious premiere introducing an exciting lineup of new queens while honoring the show’s past for this milestone season. The new girls eliminate the staleness of All…", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png"}, "article": {"published_time": "2018-03-23T02:00:00.768Z", "modified_time": "2018-07-20T17:14:51.515Z"}, "description": "Fear not, squirrelfriends. After a disappointing season of All Stars, RuPaul’s Drag Race is back on its A-game with “10s Across The Board,” a thrilling, hilarious premiere introducing an exciting lineup of new queens while honoring the show’s past for this milestone season. The new girls eliminate the staleness of All…", "og": {"title": "RuPaul’s Drag Race delivers 10s across the board with an exhilarating premiere", "type": "article", "url": "https://www.avclub.com/rupaul-s-drag-race-delivers-10s-across-the-board-with-a-1824004768", "description": "Fear not, squirrelfriends. After a disappointing season of All Stars, RuPaul’s Drag Race is back on its A-game with “10s Across The Board,” a thrilling, hilarious premiere introducing an exciting lineup of new queens while honoring the show’s past for this milestone season. The new girls eliminate the staleness of All…", "locale": "en_US", "site_name": "The A.V. Club", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png"}, "fb": {"app_id": 1621890511466174, "pages": 39581755672}}, "movies": [], "publish_date": 1521770400.768, "source": "https://tv.avclub.com", "summary": ""}