{"url": "https://www.rollingstone.com/music/music-news/chris-brown-sued-over-alleged-sexual-assault-at-his-home-629443/", "text": "Chris Brown has been named in a lawsuit filed by a woman who alleges that she was sexually assaulted at the singer’s California home by Brown’s friend.\n\nThe lawsuit, filed on behalf of “Jane Doe” by lawyer Gloria Allred, claims that the “young woman” was raped several times at Brown’s home by Lowell Grissom, a rapper who performs under the names Young Lo and EverybodyKnowsLo.\n\n“The lawsuit alleges that while she was at Brown’s house, plaintiff became the victim of horrific sexual assaults which are described in our lawsuit,” Allred said in a statement. “That is why we have filed this case today alleging sexual battery, gender violence, a violation of Ralph Civil Rights Act, battery, assault, interference with the exercise of civil rights, intentional infliction of emotional distress and negligence.”\n\nDoe also alleges that another woman – named Doe X in the lawsuit as the plaintiff has yet to ascertain the woman’s name – physically forced Jane Doe into giving her oral sex.\n\n“To compound Plaintiff’s horror, Doe X was menstruating at the time,” the complaint reads. “While Doe X was forcing Plaintiff to perform oral sex on her, Grissom molested the lower half of Plaintiff’s body using his mouth and hands. Thus, Plaintiff found herself being sexually battered by two people at the same time.”\n\nThe lawsuit continues, “When Plaintiff realized that Doe X had menstruated on her face, Plaintiff decided that for health reasons, she needed to wash herself immediately. Grissom entered the bathroom while Plaintiff was in the shower, and began to molest her. Plaintiff fled the bathroom, but Grissom pursued her, and pushed her down onto the bed and raped her.”\n\nAccording to the lawsuit, following a concert at Los Angeles’ 1Oak on February 23rd, 2017, Brown hosted an after-party at a recording studio, which Jane Doe and other female friends were invited to attend. Doe added that, upon entering Brown’s home, Grissom allegedly confiscated her cellphone; Brown has previously faced legal issues stemming from a confiscated cellphone at his house.\n\nJane Doe alleges that Grissom refused to return her phone and instead brought the cellphone back to Brown’s residence, forcing Doe and her then-roommate to go to Brown’s house to retrieve their phones.\n\n“This is one of the most horrific cases involving alleged sexual assaults that I have ever seen, and our client, Jane Doe, has been severely traumatized by what she was forced to suffer,” Allred said in a statement. “She filed this lawsuit because she wants justice for herself, but she also wants to warn other young women about the potential danger to themselves if they have their phone taken away and if they go to Chris Brown’s house.”\n\n“Once at Brown’s house, Brown and Grissom continued to refuse to give Plaintiff back her phone and did not allow Plaintiff to leave,” the lawsuit alleges. “At Brown’s house, Brown continued to furnish alcohol and illicit drugs to his guests and/or the guests consumed drugs that they carried onto the premises. Plaintiff believes that the drugs Brown provided to his guests or that were brought by his guests were or included cocaine, ‘Molly,’ and marijuana.” Jane Doe claimed she turned down a “clear pill filled with white powder” that Brown handed her. Doe also “observed Brown carrying one gun in his waistband and brandishing it openly.”\n\nWhen Jane Doe showed reluctance to strip naked and perform sexual acts on Grissom, Doe X, according to the suit, “violently grabbed Plaintiff by the throat and forced Plaintiff to perform oral sex on Grissom.”\n\nAfter Grissom finally gave Jane Doe back her phone, she says she called a ridesharing service. However, Doe claims that Grissom again raped her in a “laundry room” before she exited Brown’s residence. Upon leaving, Doe “went to a rape treatment center and to the police where she reported the aforementioned events.”\n\nThe LAPD declined to confirm any details in the lawsuit, but Officer Norma Eisenman tells Rolling Stone, “At this time, we do not have any open investigations against Chris Brown.” Both Brown’s representative and attorney did not immediately reply to requests for comments. Initial attempts to reach Grissom were unsuccessful.\n\n“[Doe] does not want any other young woman to endure the violent sexual assaults that she was forced to endure in an environment of guns and drugs,” Allred added. “We look forward to our client having the opportunity to have her day in court. We want to hold accountable those who were responsible for the gender violence inflicted upon her.”\n\nComplaint – Jane Doe vs. Chris Brown & Lowell Grissom by mendle44 on Scribd", "images": ["https://www.rollingstone.com/wp-content/uploads/2018/06/9305509ae-2abd1b73-ceb5-4dc1-aedc-da3f4569652e.jpg?w=500&h=375&crop=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2022/assets/public/lazyload-fallback.gif", "https://www.rollingstone.com/wp-content/uploads/2018/06/9305509ae-2abd1b73-ceb5-4dc1-aedc-da3f4569652e.jpg?w=1581&h=1054&crop=1"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/9305509ae-2abd1b73-ceb5-4dc1-aedc-da3f4569652e.jpg?w=500&h=375&crop=1", "keywords": [], "authors": ["Daniel Kreps"], "canonical_link": "https://www.rollingstone.com/music/music-news/chris-brown-sued-over-alleged-sexual-assault-at-his-home-629443/", "title": "Chris Brown Sued Over Alleged Sexual Assault at His Home", "meta_data": {"theme-color": "#df3535", "viewport": "width=device-width, initial-scale=1.0", "description": "Chris Brown has been named in a lawsuit filed by a woman who alleges that she was sexually assaulted at the singer's California home.", "news_keywords": "Chris Brown", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "rollingstone", "pmc-page_type": "article", "articleid": 629443, "author": "Daniel Kreps", "pmc-category": "Music,Music News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-05-09T20:54:00"}, "pmc-tag": "Chris Brown", "title": "Chris Brown Sued Over Alleged Sexual Assault at His Home", "pageclass": "article", "pmc-is_free": "no", "pmc-branded-content": "no", "pmc-evergreen": "no"}, "generator": "WordPress 6.0.2", "author": "Daniel Kreps", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "RS", "application-name": "RS", "content_type": "Article", "post_id": 629443, "title": "Chris Brown Sued Over Alleged Sexual Assault at His Home", "published_at": "2018-05-09 20:54:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/9305509ae-2abd1b73-ceb5-4dc1-aedc-da3f4569652e.jpg?w=1024", "comment_count": 0, "tags": "Chris Brown", "topics": "Music News", "body": "Chris Brown has been named in a lawsuit filed by a woman who alleges that she was sexually assaulted at the singer's California home by Brown's friend.The lawsuit, filed on behalf of \"Jane Doe\" by lawyer Gloria Allred, claims that the \"young woman\" was raped several times at Brown's home by Lowell Grissom, a rapper who performs under the names Young Lo and EverybodyKnowsLo. \"The lawsuit alleges that while she was at Brown’s house, plaintiff became the victim of horrific sexual assaults which are described in our lawsuit,\" Allred said in a statement. \"That is why we have filed this case today alleging sexual battery, gender violence, a violation of Ralph Civil Rights Act, battery, assault, interference with the exercise of civil rights, intentional infliction of emotional distress and negligence.\"Doe also alleges that another woman – named Doe X in the lawsuit as the plaintiff has yet to ascertain the woman's name – physically forced Jane Doe into giving her oral sex.\"To compound Plaintiff's horror, Doe X was menstruating at the time,\" the complaint reads. \"While Doe X was forcing Plaintiff to perform oral sex on her, Grissom \u2028molested the lower half of Plaintiff's body using his mouth and hands. Thus, Plaintiff found herself being sexually battered by two people at the same time.\" \u2028The lawsuit continues, \"When Plaintiff realized that Doe X had menstruated on her face, Plaintiff decided that for health reasons, she needed to wash herself immediately. Grissom entered the bathroom while Plaintiff was in the shower, and began to molest her. Plaintiff fled the bathroom, but Grissom pursued her, and pushed her down onto the bed and raped her.\"According to the lawsuit, following a concert at Los Angeles' 1Oak on February 23rd, 2017, Brown hosted an after-party at a recording studio, which Jane Doe and other female friends were invited to attend. Doe added that, upon entering Brown's home, Grissom allegedly confiscated her cellphone; Brown has previously faced legal issues stemming from a confiscated cellphone at his house. Jane Doe alleges that Grissom refused to return her phone and instead brought the cellphone back to Brown's residence, forcing Doe and her then-roommate to go to Brown's house to retrieve their phones.\"This is one of the most horrific cases involving alleged sexual assaults that I have ever seen, and our client, Jane Doe, has been severely traumatized by what she was forced to suffer,\" Allred said in a statement. \"She filed this lawsuit because she wants justice for herself, but she also wants to warn other young women about the potential danger to themselves if they have their phone taken away and if they go to Chris Brown’s house.\"\"Once at Brown's house, Brown and Grissom continued to refuse to give Plaintiff back her phone and did not allow Plaintiff to leave,\" the lawsuit alleges. \"At Brown's house, Brown continued to furnish alcohol and illicit drugs to his guests and/or the guests consumed drugs that they carried onto the premises. Plaintiff believes that the drugs Brown provided to his guests or that were brought by his guests were or included cocaine, 'Molly,' and marijuana.\" Jane Doe claimed she turned down a \"clear pill filled with white powder\" that Brown handed her. Doe also \"observed Brown carrying one gun in his waistband and brandishing it openly.\"When Jane Doe showed reluctance to strip naked and perform sexual acts on Grissom, Doe X, according to the suit, \"violently grabbed Plaintiff by the throat and forced Plaintiff to perform oral sex on Grissom.\"After Grissom finally gave Jane Doe back her phone, she says she called a ridesharing service. However, Doe claims that Grissom again raped her in a \"laundry room\" before she exited Brown's residence. Upon leaving, Doe \"went to a rape treatment center and to the police where she reported the aforementioned events.\"The LAPD declined to confirm any details in the lawsuit, but Officer Norma Eisenman tells Rolling Stone, \"At this time, we do not have any open investigations against Chris Brown.\" Both Brown's representative and attorney did not immediately reply to requests for comments. Initial attempts to reach Grissom were unsuccessful.\"[Doe] does not want any other young woman to endure the violent sexual assaults that she was forced to endure in an environment of guns and drugs,\" Allred added. \"We look forward to our client having the opportunity to have her day in court. We want to hold accountable those who were responsible for the gender violence inflicted upon her.\"   Complaint - Jane Doe vs. Chris Brown & Lowell Grissom by mendle44 on Scribd", "fb": {"pages": 10664530778}, "onesignal": "wordpress-plugin", "og": {"type": "article", "title": "Chris Brown Sued Over Alleged Sexual Assault at His Home", "url": "https://www.rollingstone.com/music/music-news/chris-brown-sued-over-alleged-sexual-assault-at-his-home-629443/", "description": "“This is one of the most horrific cases involving alleged sexual assaults that I have ever seen,” Gloria Allred says of Jane Doe’s claims", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/9305509ae-2abd1b73-ceb5-4dc1-aedc-da3f4569652e.jpg?w=500&h=375&crop=1", "width": 1024, "height": 683, "alt": "Chris Brown Sued Over Sexual Assault at His Home"}, "locale": "en_US"}, "article": {"published_time": "2018-05-09T20:54:00+00:00", "modified_time": "2018-06-25T15:43:43+00:00"}, "twitter": {"site": "@RollingStone", "card": "summary_large_image", "title": "Chris Brown Sued Over Alleged Sexual Assault at His Home", "description": "Chris Brown has been named in a lawsuit filed by a woman who alleges that she was sexually assaulted at the singer's California home.", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/9305509ae-2abd1b73-ceb5-4dc1-aedc-da3f4569652e.jpg?w=1024"}, "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2022/08/cropped-Rolling-Stone-Favicon.png?w=270"}, "movies": [], "publish_date": 1525899240.0, "source": "https://www.rollingstone.com", "summary": ""}