{"url": "https://www.cbsnews.com/news/dylan-farrow-interview-today-gayle-king-full-transcript-woody-allen-me-too/", "text": "Only on \"CBS This Morning,\" Dylan Farrow is speaking candidly for the first time on television about her sexual assault allegations against her adoptive father, actor and director Woody Allen. At the age of seven, Farrow told her mother, actress Mia Farrow, that Allen had molested her.\n\nAllen has always denied the allegations.\n\nFarrow has stood by her story for more than two decades. She first went public in 2014 with an open letter in the New York Times. Now, she's sharing her story to \"CBS This Morning\" co-host Gayle King who spoke with her at Farrow's Connecticut home.\n\nSome of the details she described are graphic.\n\nDYLAN FARROW: I want to show my face and tell my story. … I want to speak out. Literally.\n\nDylan Farrow shares her story with \"CBS This Morning\" co-host Gayle King CBS News\n\nAt 32, Dylan Farrow has been married for almost eight years. She's the mother of a 16-month-old girl. And she's still carrying the emotional scars she says she got at the hands of her father.\n\nFARROW: I loved my father. I respected him. He was my hero. And that doesn't obviously take away from what he did. But it does make the betrayal and the hurt that much more intense.\n\nGAYLE KING: Let's go to August 4, 1992. And if you could tell us what happened that day.\n\nFARROW: I was taken to a small attic crawl space in my mother's country house in Connecticut by my father. He instructed me to lay down on my stomach and play with my brother's toy train that was set up. And he sat behind me in the doorway, and as I played with the toy train, I was sexually assaulted… As a 7-year-old I would say, I would have said he touched my private parts.\n\nKING: Mmhmm. Okay\n\nFARROW: Which I did say.\n\nKING: Alright. Alright.\n\nFARROW: As a 32-year-old, he touched my labia and my vulva with his finger.\n\nKING: Where was your mother?\n\nFARROW: She went shopping that day.\n\nKING: And then after you told her, what happened?\n\nFARROW: She was upset. … My first impulse was that I had done something wrong.\n\nMia Farrow took Dylan to the pediatrician, but when the doctor asked her where she had been touched, the little girl pointed to her shoulder.\n\nFARROW: She said, \"Why didn't you tell the doctor what you told me?\" And I told her that I was embarrassed. And then we went back in.\n\nKING: You went back in and then you told him.\n\nFARROW: And I told the doctor.\n\nKING: The same thing that you had told your mother.\n\nFARROW: Yes.\n\n(L to R) Actress Mia Farrow, son Satchel, Woody Allen, daughter Dylan David Mcgough/DMI/The LIFE Picture Collection/Getty Images\n\nAllen had suggested that Dylan changed her story because she had been coached by her mother. Months earlier, Mia had found in his apartment nude pictures of her daughter, Soon-Yi, whom she had adopted during an earlier marriage. Allen confessed to an affair with Soon-Yi. The two remain a couple to this day, married for more than 20 years.\n\nKING: You could see why he might make that claim. He would say that she was filled with rage after his affair with Soon-Yi had been discovered, and that she was out for revenge and full of rage.\n\nFARROW: And what I don't understand is how is this crazy story of me being brainwashed and coached more believable than what I'm saying about being sexually assaulted by my father?\n\nKING: Because your mother was very angry, so that she would try to coach you, and try to get you to turn against your father.\n\nFARROW: Except every step of the way, my mother has only encouraged me to tell the truth. She has never coached me.\n\nKING: I wanted to play a clip from \"60 Minutes.\" An interview that he did at the time where he was asked about that incident. Are you okay with looking at it? You're ok?\n\nFARROW: [Nods] Mmhmm.\n\n\"60 MINUTES\" INTERVIEW WITH ALLEN: Isn't it illogical that I'm going to at the height of a very bitter acrimonious custody fight, drive up to Connecticut where nobody likes me and I'm in house full of enemies – I mean Mia was so enraged at me and she had gotten all the kids to be angry at me – that I'm going to drive up there and suddenly on visitation, pick this moment in my life to become a child molester. It's just, it's just incredible. I could if I wanted to be a child molester, I had many opportunities in the past. I could have quietly made a custody settlement with Mia in some way and done it in the future. You know, it's so insane.\n\nKING: What do you say to that?\n\nFARROW: [Crying] I'm really sorry.\n\nKING: Don't apologize, don't apologize.\n\nFARROW: I thought I could handle it. I –\n\nKING: Are you crying because of what he said or seeing him? What is upsetting you?\n\nFARROW: He's lying and he's been lying for so long. And it is difficult for me to see him and to hear his voice. I'm sorry.\n\nAllen had adopted Dylan and her 13-year-old brother, Moses, the previous December. The couple also had a younger son, Ronan. But as Mia Farrow's boyfriend, Allen had been a part of Dylan's life since she was a baby. Dylan says that the incident in the attic wasn't the only time his behavior had been inappropriate.\n\nKING: What would he do?\n\nFARROW: He would follow me around. He was always touching me, cuddling me and if I ever said, you know, like I want to go off by myself, he wouldn't let me.\n\nKING: Some could say that's a very doting and loving father.\n\nFARROW: Except he wasn't this way with Ronan.\n\nKING: What else would he do?\n\nFARROW: He often asked me to get into bed with him when he had only his underwear on and sometimes when only I had my underwear on.\n\nWoody Allen was never charged with a crime in this case. Both New York state child welfare investigators and a report by the Yale New Haven hospital found that the abuse did not happen. The Connecticut state prosecutor on the case, Frank Maco, questioned the Yale New Haven report's credibility saying there was probable cause to charge Allen but he thought Dylan was too fragile to face a celebrity trial.\n\n\n\nKING: Do you wish that they would have gone ahead and filed the charges because then you would have had to taken the stand?\n\nFARROW: You know, honestly yes. I do wish that they had, you know, even if I'm just speaking in retrospect. I was already traumatized. … Here's the thing. I mean, outside of a court of law, we do know what happened in the attic on that day. I just told you.\n\nWe reached out to the former Connecticut prosecutor, Frank Maco. He told us that in his experience, \"There was no manipulation by Mia Farrow.\" He adds nothing in the state police investigation indicated that Farrow was in any way being controlled or manipulated.\n\n\"When this claim was first made more than 25 years ago, it was thoroughly investigated by both the Child Sexual Abuse Clinic of the Yale-New Haven Hospital and New York State Child Welfare. They both did so for many months and independently concluded that no molestation had ever taken place. Instead, they found it likely a vulnerable child had been coached to tell the story by her angry mother during a contentious breakup.\n\n\"Dylan's older brother Moses has said that he witnessed their mother doing exactly that – relentlessly coaching Dylan, trying to drum into her that her father was a dangerous sexual predator. It seems to have worked – and, sadly, I'm sure Dylan truly believes what she says.\n\n\"But even though the Farrow family is cynically using the opportunity afforded by the Time's Up movement to repeat this discredited allegation, that doesn't make it any more true today than it was in the past. I never molested my daughter – as all investigations concluded a quarter of a century ago.\"\n\nFarrow is also speaking up to have her voice included in the Time's Up and #MeToo conversations. Over the past two weeks, several celebrities have voiced their support for Dylan, including actress Natalie Portman.\n\nThis week, Timothée Chalamet announced he's donating his entire salary from his work in an upcoming Woody Allen movie to three charities that fight sexual abuse and harassment, including Time's Up. He wrote on Instagram: \"I want to be worthy of standing shoulder to shoulder with the brave artists who are fighting for all people to be treated with the respect and dignity they deserve.\"\n\nIn an interview on \"CBS Sunday Morning,\" Portman said, \"I believe Dylan. I would want to say that. I believe you, Dylan.\"\n\nDylan was visibly moved by seeing the support from Portman.\n\nFARROW: Now I'm going to start crying but, wow.\n\nShe's been searching for that acknowledgement, most of her life.\n\nFARROW: With so much silence being broken by so many brave people against so many high profile people, I felt it was important to add my story to theirs because it's something I've struggled with for a long time and it was….It was very momentous for me to see this conversation finally carried into a public setting.\n\nAs the #MeToo movement continues, Dylan took to social media to call out celebrities who have starred in Woody Allen's films.\n\nKING: Are you angry with the people, with the celebrities that are starring in his movies, that hold him in high regard and continue to compliment him?\n\nFARROW: I'm not angry with them. I hope that, you know, especially since so many of them have been vocal advocates of this Me Too and Time's Up movement that, um, they can acknowledge their complicity and maybe hold themselves accountable to how they have perpetuated this culture of – of silence in their industry.\n\nKING: And how are they complicit?\n\nFARROW: Because I have been saying this – I have been repeating my accusations unaltered for over 20 years and I have been systematically shut down, ignored or discredited. If they can't acknowledge the accusations of one survivor's how are they going to stand for all of us?\n\nKING: People say it's a family matter. It was many years ago. I don't really know the details of this case.\n\nFARROW: So find out. I mean, it's really like I said, it's so easy in this day and age. It's a family matter but here's another thing. I am a real person and I've been struggling, coping on my good days, with the aftershocks of being sexually assaulted as a small child and that's real. And that matters.\n\nKING: How has this affected your life?\n\nFARROW: It's affected every part of my life. You know, growing up, and like I said, I pushed it to the side, I tried to pretend or tried to convince myself that this was something moving forward that I did not need to bring with me even though it came anyway. It's impacted everything.\n\nMarried and a mother to a 16-month-old daughter, Dylan is an advocate for victims of sexual abuse.\n\nFARROW: I have a wonderful husband and I have this amazing little girl now.\n\nKING: So what will you tell her when the time comes? What will you tell her about how to be in this world?\n\nFARROW: That if she was ever in a position that she's not helpless. Because one of the things I remember very clearly as a small child is this feeling of helplessness.", "images": ["https://assets3.cbsnewsstatic.com/hub/i/r/2020/10/02/507331cd-c0ca-4a5b-854f-6bc1d6eb658f/thumbnail/140x90/1576fbf5b68245c9177cb52b252b7ac4/Harvey.jpg", "https://assets3.cbsnewsstatic.com/hub/i/r/2018/01/18/c5c6461e-0949-4aa9-a5d4-f93c0586b1d5/thumbnail/1200x630/9be67849691305b78f8a55d27c028e15/ctm-0118-dylan-farrow-gayle-king.jpg", "https://assets1.cbsnewsstatic.com/hub/i/r/2022/08/31/1582096d-4a19-4469-9cba-240f1a000187/thumbnail/140x90/c1d948343c21177ca2fdb5ee187b1452/gettyimages-853699560.jpg", "https://assets1.cbsnewsstatic.com/hub/i/2018/01/18/c5c6461e-0949-4aa9-a5d4-f93c0586b1d5/ctm-0118-dylan-farrow-gayle-king.jpg", "https://assets3.cbsnewsstatic.com/hub/i/r/2018/01/18/7b419449-dc2b-4a3c-884f-9fb92a3f70f2/thumbnail/620x415/09aeaea64bcd0db512f5e3ec1347a939/gettyimages-50732284.jpg", "https://assets1.cbsnewsstatic.com/hub/i/r/2022/06/16/cd9d7a0b-0b2b-426e-9287-27fa835b4254/thumbnail/140x90/e70a3f9e0735d7fb220812319837cd35/gettyimages-1403221291.jpg", "https://assets2.cbsnewsstatic.com/hub/i/r/2022/07/14/f0571090-f556-46fd-ba94-bab709910d96/thumbnail/140x90/1da9e1a5771fb69bc51e4914e3201fef/kevin-spacey-ap22195295235816.jpg", "https://assets3.cbsnewsstatic.com/hub/i/r/2018/01/18/c5c6461e-0949-4aa9-a5d4-f93c0586b1d5/thumbnail/620x349/91122462f67a2128db47cf9626c410bd/ctm-0118-dylan-farrow-gayle-king.jpg", "https://assets2.cbsnewsstatic.com/hub/i/r/2022/06/01/1bcc9069-5190-4db7-87bb-e136f4850e90/thumbnail/140x90/9fdd95d9adc7bd31e685ae0f3c5ee23f/gettyimages-1039468646.jpg", "https://www.cbsnews.com/assets/show/cbs-mornings/logo-square-32.svg"], "top_img": "https://assets3.cbsnewsstatic.com/hub/i/r/2018/01/18/c5c6461e-0949-4aa9-a5d4-f93c0586b1d5/thumbnail/1200x630/9be67849691305b78f8a55d27c028e15/ctm-0118-dylan-farrow-gayle-king.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.cbsnews.com/news/dylan-farrow-interview-today-gayle-king-full-transcript-woody-allen-me-too/", "title": "Dylan Farrow details her sexual assault allegations against Woody Allen", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1, user-scalable=0", "color-scheme": "only light", "robots": "index, follow, max-image-preview:large", "description": "The 32-year-old is speaking candidly for the first time on TV about her accusations against her adoptive father", "keywords": "Ronan Farrow", "news_keywords": "Ronan Farrow", "al": {"web": {"url": "https://www.cbsnews.com/news/dylan-farrow-interview-today-gayle-king-full-transcript-woody-allen-me-too/"}, "ios": {"app_name": "CBS News", "app_store_id": 334256223, "url": "cbsnewsapp://cbsnews.com/news/dylan-farrow-interview-today-gayle-king-full-transcript-woody-allen-me-too/"}, "android": {"app_name": "CBS News", "package": "com.treemolabs.apps.cbsnews", "url": "cbsnewsapp://cbsnews.com/news/dylan-farrow-interview-today-gayle-king-full-transcript-woody-allen-me-too/"}}, "og": {"type": "article", "url": "https://www.cbsnews.com/news/dylan-farrow-interview-today-gayle-king-full-transcript-woody-allen-me-too/", "title": "Dylan Farrow details her sexual assault allegations against Woody Allen", "description": "The 32-year-old is speaking candidly for the first time on TV about her accusations against her adoptive father", "image": {"identifier": "https://assets3.cbsnewsstatic.com/hub/i/r/2018/01/18/c5c6461e-0949-4aa9-a5d4-f93c0586b1d5/thumbnail/1200x630/9be67849691305b78f8a55d27c028e15/ctm-0118-dylan-farrow-gayle-king.jpg", "width": 1200, "height": 630}, "video": {"url": "https://splice.amlg.io/api/v2/video/APJttZ5kvkqRajtWed4sP_u5DGAVswaM/preview/", "secure_url": "https://splice.amlg.io/api/v2/video/APJttZ5kvkqRajtWed4sP_u5DGAVswaM/preview/", "type": "application/x-mpegURL", "width": 1920, "height": 1080}}, "fb": {"app_id": 1536620209892267, "pages": 131459315949}, "article": {"publisher": "https://www.facebook.com/CBSMornings/", "content_tier": "free", "opinion": "false"}, "twitter": {"dnt": "on", "app": {"country": "US", "name": {"iphone": "CBS News", "ipad": "CBS News", "googleplay": "CBS News"}, "id": {"iphone": 334256223, "ipad": 334256223, "googleplay": "com.treemolabs.apps.cbsnews"}, "url": {"iphone": "cbsnewsapp://cbsnews.com/news/dylan-farrow-interview-today-gayle-king-full-transcript-woody-allen-me-too/", "ipad": "cbsnewsapp://cbsnews.com/news/dylan-farrow-interview-today-gayle-king-full-transcript-woody-allen-me-too/", "googleplay": "cbsnewsapp://cbsnews.com/news/dylan-farrow-interview-today-gayle-king-full-transcript-woody-allen-me-too/"}}, "site": "@CBSMornings", "title": "Dylan Farrow details her sexual assault allegations against Woody Allen", "description": "The 32-year-old is speaking candidly for the first time on TV about her accusations against her adoptive father", "image": "https://assets3.cbsnewsstatic.com/hub/i/r/2018/01/18/c5c6461e-0949-4aa9-a5d4-f93c0586b1d5/thumbnail/1200x630/9be67849691305b78f8a55d27c028e15/ctm-0118-dylan-farrow-gayle-king.jpg", "player": {"identifier": "https://www.cbsnews.com/video/dylan-farrow-details-her-sexual-assault-allegations-against-woody-allen/?embed=1&ftag=CNM-00-10aag7j", "width": 640, "height": 360, "stream": {"identifier": "https://splice.amlg.io/api/v2/video/APJttZ5kvkqRajtWed4sP_u5DGAVswaM/preview/", "content_type": "application/x-mpegURL"}}, "card": "summary_large_image"}, "theme-color": "#101010", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "CBS News", "apple-mobile-web-app-status-bar-style": "black"}, "movies": [], "publish_date": null, "source": "https://www.cbsnews.com", "summary": ""}