{"url": "www.elle.com/culture/celebrities/a12115489/selena-gomez-and-the-weeknd-relationship-timeline/", "text": "Selena Gomez and The Weeknd's (whose real name is Abel Tesfaye) breakup was reported in October 2017 after nearly 10 months of dating. Theirs was a relationship of worldwide PDA, sweet Instagram stories about the other, and so much more. Here, a look back from start to finish, including Instagram drama with Bella Hadid and the songs he may have written about Gomez.\n\nJanuary 2017\n\nSelena Gomez and The Weeknd are photographed making out just two months after he broke up with Bella Hadid.\n\nThe two start following each other on Instagram, then go on vacation to Italy together (Florence and Venice specifically).\n\nThere, The Weeknd puts the first shot of Gomez in his Instagram story:\n\nInstagram\n\nAnd Gomez puts a video of The Weeknd on her 'gram, though she deletes it hours later. Fan accounts saved a receipt:\n\nThey're also shot showing a lot of PDA over dinner:\n\nMeanwhile, The Weeknd's ex, Bella Hadid, promptly unfollows Gomez on Instagram the day after the initial makeout photos of Gomez and The Weeknd come out. (The Weeknd and Gomez unfollow Hadid later in March.)\n\nFebruary 2017\n\nAt this point, the pair is more subtle about their relationship status. Gomez reportedly paid $30,000 for The Weeknd's Dave & Buster birthday party, although she was in New York City on the actual day for work. Gomez likes The Weeknd's birthday Instagram:\n\nOn her own Instagram, Gomez is caught wearing The Weeknd's clothes, a subtle nod they're together. Here, his jean jacket:\n\nAround Valentine's Day, the paparazzi photographs the two making out on a yacht in California. The Weeknd resumes his tour, and Gomez is spotted out at his concert in Amsterdam on the 24th. In March and April, Gomez continues to follow The Weeknd to his shows. She goes to over 10 different countries with him (Italy, the Netherlands, Germany, Switzerland, France, the U.S., Canada, Colombia, Brazil, and Argentina), and three continents.\n\nMarch 2017\n\nGomez and The Weeknd go on an aquarium date at Ripley's Aquarium in Toronto on a trip there together. The Weeknd posts a video of Gomez on his Insta story, then officially adds her to his grid.\n\nShe likes the post:\n\nInstagram\n\nMeanwhile, The Weeknd releases a song with Nav that seems to have a pointed message to Gomez's ex Justin Bieber, who had been publicly petty about Gomez and Tesfaye's relationship. Some of the verses seem to maybe be about Tesfaye stealing Gomez from Bieber, including:\n\nI think your girl, think your girl, fell in love with me\n\nShe say my f–k and my tongue game a remedy\n\nAnd:\n\nOh yeah, yeah, I just hit a lick and I know you feelin' some way\n\n(nah, nah nah nah, nah nah nah)\n\nI just took that chick, and I know you feelin' some way, oh yeah\n\nShe just want a n–a like me, you feelin' some way, way, way, yeah\n\nShe just want a n–a like me, I play no games\n\nApril 2017\n\nThe two are filmed making out at Coachella:\n\nAnd Gomez posts her Instagram official shot of the two. The Weeknd, of course, likes it:\n\nInstagram\n\nOn April 27th, an Access Hollywood reporter tactfully asks Gomez, who said earlier in the year she will never discuss her love life publicly, about The Weeknd. Gomez gives her first little interview on him.\n\nLiz Hernandez: I know you're taking over the Forum today. Are you gonna be here this weekend for The Weeknd?\n\nSelena Gomez: Ha, I might!\n\nHernandez: I hope to see you, girl. I'm going to be here.\n\nGomez: Well, good. You're gonna love it. You're gonna love it!\n\nMay 2017\n\nGomez and Tesfaye make their red carpet debut at the Met Gala. They are all PDA, inside and on the red carpet:\n\nE! reports on the red carpet itself, Gomez was overheard whispering \"I love you\" in The Weeknd's ear. They posed right before The Weeknd's ex Bella Hadid's mom, Yolanda, and brother, Anwar, arrived.\n\n\n\nGetty Images\n\nDuring a radio interview at the end of the month with Miami's Power 96.5 FM, Gomez talks about how she goes all in with boyfriends (and in this case, Tesfaye). \"I'm the kind of girl that loves tremendously big,\" she said. \"I just have always been that girl. I will give my heart and my soul to the person that I love. It's just how I operate. With that comes a lot, ya know? Clearly you understand.\"\n\nJune 2017\n\nGomez says during a radio interview that The Weeknd won't be influencing any of her music. \"No, I think for me I like to keep that really separate,\" Gomez tells host Zach Sang. \"I feel like for so long, I think you know, being a young woman, I've been single I mean for like, four years? I think it's so important and I spent so much time making sure that everything that I do, I do for myself. So as much as that has been inspiring because I love to be inspired by people that I do love and care about, but I'm a big advocate on making sure that I'm doing it for me. Because the moment I start doing something because I'm influenced by someone else, whoever it may be, it just doesn't work out so believe it or not, I keep that very, very separate, which is good.\"\n\nOn June 6th, Gomez and Tesfaye have a well-documented date night at Rao's restaurant in East Harlem. Gomez tags The Weeknd in her outfit shot for the night:\n\nInstagram\n\nAnd he's photographed checking her out as they arrive at the restaurant:\n\nSplash News\n\nThe two have a second date night in New York City the next day (Tesfaye is in town performing).\n\nBackgrid\n\nHe posts a shot of Gomez on his 'gram. Gomez's assistant leaves a joke in the comments:\n\nInstagram\n\nOn June 12th, Gomez tells Seacrest during a radio interview why she and Tesfaye went public. \"It's really hard when I would want to spend so much time hiding things. It's too much pressure, and I think everyone gets over everything eventually. I just want to be happy. If that's me just being myself, then I don't really care.\"\n\nJuly 2017\n\nThe Weeknd flies 11.5 hours to be with Gomez for her 25th birthday after his Paris show (Gomez celebrates her birthday in L.A.). On his Instagram story, he posts a shot that says \"\"on my way to you.\" \"Abel's on his way home...\" she announced with a smile on her Instagram Live of her initial party night.\n\nThey're photographed the next day having lunch together:\n\nClint Brewer/Splash News\n\nAnd dinner:\n\nAnd the next night, Gomez and The Weeknd are photographed meeting each other out after Gomez starts the night with her friends (they listen to The Weeknd's music, obviously):\n\nSplash News\n\n\n\n\n\nAugust 2017\n\nGomez opens up about The Weeknd in her September interview with InStyle when asked whether she's happy with him. \"I really am. It's great,\" she started. \"[But] I don't depend on one area of my life to make me happy. It's really important for me to love and nourish my friends and family and to make sure that I never get influenced by a guy. I've wanted to be in a strong headspace for years, and I really wasn't. Before, I was so young and easily influenced, and I'd feel insecure. You want someone to add to your life, not to complete you, if that makes sense. I'm lucky because he's more of a best friend than anything else.\"\n\nBoth The Weeknd and Gomez have September issue covers, and they support the other's by posting it on their Instagram story.\n\nInstagram\n\nThe Weeknd posted a shot from her editorial:\n\nInstagram\n\nLater that month, the two are spotted being PDAy on a Disneyland date:\n\nAnd The Weeknd and Gomez document his attempt to teach her video games:\n\nInstagram\n\n\n\n\n\nSeptember 2017\n\nGomez posts a photo of a date night with The Weeknd on her Instagram that appears to be the same one that's her phone background. He likes it:\n\nSelenaGomez // Instagram\n\nSplash News\n\nThe two are spotted playing with puppies and later Gomez buys one, which she names Charlie:\n\nA source tells ET that the two are living together in New York City in a \"a low-rise luxury building in the heart of [Greenwich] Village\" that they're renting while Gomez is shooting her Woody Allen film there temporarily. (The Weeknd is still on tour but traveling back and forth.) This is \"a big deal,\" the source says, as Gomez usually stays in hotels while working on temporary projects.\n\nDuring fashion week, they make their second red carpet appearance at the Harper's Bazaar ICONS party. They're shot kissing on the carpet:\n\nGetty Images\n\nGetty Images\n\nLater that month, they post a photo of their New York City boat date on their Instagram stories:\n\nInstagram\n\nGomez announces that she had a kidney transplant during the summer on the 14th of that month. A source told People that The Weeknd rearranged his tour dates—and kept the summer open—so he could be with her. “It was a super serious operation,” the source said, “and all her friends were worried.”\n\nOctober 2017\n\nThe two's final public date takes place on October 12th, when they're spotted having a Halloween-themed date at Universal Studios Halloween Horror Nights. They're seen making out on a ride:\n\nThe Weeknd goes back on tour, and Gomez returns to Los Angeles after wrapping her Woody Allen project. Gomez's ex, Justin Bieber, is spotted at her house with friends. Bieber first reached out to reconnect after finding out about Gomez's kidney transplant. TMZ reports The Weeknd is fine with them hanging.\n\nMeanwhile, Page Six publishes a report that The Weeknd and Drake are beefing because Drake allegedly had a fling with The Weeknd's ex, Bella Hadid.\n\nThe Sunday before Tesfaye and Gomez's breakup is announced, Gomez and Bieber are spotted having breakfast together, going to church together, and then spending the rest of the day and night at each other's houses, just the two of them.\n\nBACKGRID\n\nThe Weeknd, meanwhile, quietly unfollows members of Gomez's friends and family, including her mom, assistant, friend/kidney donor Francia Raisa, and her close friend and cousin Priscilla Deleon (who's also the mother of Gomez's godchild). Sources insist to TMZ that Tesfaye is fine with Gomez and Bieber hanging out, perhaps because things have already ended.\n\nOn October 30th, People breaks the news that Gomez and The Weeknd are done. They remain in touch, but the distance is ultimately what did them in. “It’s been hard for them to come to the realization that this is the direction things were heading, but it’s been hard for months,” the source told the outlet.\n\nNovember 2017\n\nAbout two weeks after Tesfaye's split with Gomez, E! News spots him leaving ex Bella Hadid's NYC apartment. A source tells the outlet, \"Bella and Abel have been in contact since Abel and Selena split, but they are not back together. Abel reached out to Bella asking to hang out and catch up, and she decided to see him and see where things go. She knows that if they don't date again, they can at least be good friends.\" An Us Weekly insider adds, “Bella really missed him. She’s happy with where things are and he is too. They are still totally in love.”\n\nMeanwhile, Gomez tells Billboard that she and Tesfaye ended their relationship on good terms. \"The best part [of being single]?\" Gomez began. \"It’s actually... you know what, though? Something that I’m really proud of is that there’s such a true friendship [between me and The Weeknd]. I truly have never experienced anything like that in my life. We ended it as best friends, and it was genuinely about encouraging and caring [for each other], and that was pretty remarkable for me.\"\n\nApril 2018\n\nAbout six months after The Weeknd and Gomez's breakup, Us Weekly reports that he's officially back together with Hadid, and they were seen kissing at Coachella. During his setlist at the music festival, The Weeknd is seen getting emotional while performing \"Call Out My Name,\" a song widely-believed to be about G0mez.\n\nKevin Winter // Getty Images\n\nWhile there's no denying The Weeknd's tearful rendition of that song, a source tells Entertainment Tonight that The Weeknd was never actually going to donate his kidney to Gomez in 2017, despite a lyric on his new album My Dear Melancholy. His lyric, \"I said I didn't feel nothing, baby, but I lied/I almost cut a piece of myself for your life\" sparked the speculation. A source tells ET, \"It’s just a lyric, and he knew it would strum up attention and that people would interpret it exactly as they have, but he was never actually going to donate his kidney to Selena. Sure, he was her boyfriend at the time, so it perhaps crossed his mind to get tested to see if he was a match—which is incredibly rare—but it never got anywhere close to actually happening.”\n\nThe insider also explains that Gomez never would've asked Tesfaye to see if he was a match. “Selena would never, ever have asked him,\" the source continued. \"She wouldn’t have even wanted him to even entertain the idea! It was difficult enough for her to allow a lifelong friend [Francia Raisa] to do it, but a new boyfriend? No way.”\n\nMay 2019\n\nAbout a year later, Hadid and The Weeknd are still going strong. And an Instagram like from Hadid seems to prove there's no drama with her and Gomez. She liked a photo that Gomez's makeup artist Hung Vanngo shared of Gomez making her Cannes Film Festival debut.\n\nNovember 2019\n\nSix months after the innocuous like, Gomez finally re-follows Hadid on Instagram. But Hadid never follows Gomez back and three years later, a bit of 'gram drama ensues. It all starts when Gomez comments \"Stunning 😍\" on a Dior photo of Hadid. The model then deletes the Instagram post. When a Gomez fan account points out the deletion, writing,\"She's all about supporting women. You all just can't take it nicely. BTW Ms Hadid deleted the post.\" Gomez seemingly responds: \"That sucks 😢\" she comments on Instagram.\n\nWhen outlets begin reporting on the slight, Gomez clarifies her comment on fan account Selssbrina's Instagram (via TheSelenaRundown). \"I shouldn't of spoken without knowing the truth. I'm sorry,\" Gomez writes. \"Please don't be hurtful. She is a wonderful person, and it was all a misunderstanding.\n\nTMZ then reports the pair talked things out offline. Multiple sources tell the outlet that Hadid \"actually went out of her way to reach out to Selena this weekend to squash any potential beef.\" (Hadid would next like a photo of Gomez's in February 2020.)\n\nThis same month, The Weeknd releases, \"Heartless,\" a song with lyrics that seem to reference his relationship drama with Gomez and Hadid.\n\nMarch 2020\n\nNearly three years after their breakup, a new song from The Weeknd's After Hours album seems to reference both Gomez and Hadid. \"Save Your Tears,\" includes lyrics such as \"I broke your heart like someone did to mine / And now you won't love me for a second time.\" That aligns with The Weeknd and Hadid's reconciliation following his split with Gomez.\n\nOn March 30, Gomez shares a list of movies, TV shows, Instagram accounts, songs, podcasts, and books that she recommends for quarantine. \"Here are some things that I've been watching, listening to, and reading to keep me positive and help pass the time. Hope it helps!!\" she wrote in her Instagram Story. Amid her picks are two shoutouts to The Weeknd—his song \"Snowchild\" and the movie Uncut Gems, which he co-stars as himself in.\n\nApril 2020\n\nThe following month, Gomez spotlights \"Snowchild\" once again on her new Spotify Cooking Together playlist. Another track that makes the list is Niall Horan's \"Slow Hands,\" after their rumored fling.\n\nMay 2020\n\nThen, the reported beef between Hadid and Gomez finally feels over when the model re-follows Gomez on Instagram. Alas, the next day Hadid has unfollowed Gomez once more.\n\nJuly 2020\n\nFans speculate that The Weeknd subtly gifts Gomez the music video for \"Snowchild\" on her 28th birthday, as she publicly praised the song twice. He released the video on her exact birthday.\n\nAugust 2020\n\nThe Weeknd gets candid about his relationships and their influence on his music for the September issue of Esquire interview. The outlet reports that it took Tesfaye only two and half weeks to write, record, and release his six-track EP My Dear Melancholy. (The project came shortly after his split with Gomez and is widely believed to be about her.) \"The reason why it was so short is like, I think I just had nothing else to say on this...whatever....\" he began. \"It was just like this cathartic piece of art. And yeah, it was short, because that’s all I had to say on this situation.\"\n\nWhen asked if releasing the album made him feel better, Tesfaye said, “Yeah, of course. I mean, that would have sucked if I didn’t.” But he wouldn't comment on who the songs were about explicitly.\n\nAlyssa Bailey Senior News and Strategy Editor Alyssa Bailey is the senior news and strategy editor at ELLE.com, where she oversees coverage of celebrities and royals (particularly Meghan Markle and Kate Middleton). She previously held positions at InStyle and Cosmopolitan. When she's not working, she loves running around Central Park, making people take #ootd pics of her, and exploring New York City.", "images": ["https://hips.hearstapps.com/ell.h-cdn.co/assets/17/30/1500996017-spl1544600-021-150.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-and-joe-alwyn-arrive-at-zuma-on-october-06-news-photo-1665150988.jpg?crop=0.591xw:0.531xh;0.226xw,0.0403xh&resize=180:*", "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/33/1503230820-image-uploaded-from-ios-134.jpg?crop=1xw:1xh;center,top&resize=320:*", "https://hips.hearstapps.com/hmg-prod/images/spl1568651-006-1504631691.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1664981510.jpg?crop=1.00xw:0.735xh;0,0.0444xh&resize=180:*", "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/04/1485706138-selweeknd.jpg?crop=1xw:1xh;center,top&resize=320:*", "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/05/1485815624-ag-166133-002-250.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/brad-pitt-and-angelina-jolie-attend-a-private-reception-as-news-photo-1664913566.jpg?crop=0.668xw:1.00xh;0.146xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/rihanna-bgus-2478374-004-1664978615.jpg?crop=0.566xw:0.377xh;0.186xw,0.0331xh&resize=180:*", "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/09/4000x2000/landscape-1488572662-instar-selena-gomez-kisses-the-weeknd-exclusive-3341834131.JPG?resize=1200:*", "https://hips.hearstapps.com/hmg-prod/images/te-le-chargement-1665080515.png?crop=0.505xw:1.00xh;0.162xw,0&resize=180:*", "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/31/1501851085-image-uploaded-from-ios-122.jpg?crop=1xw:1xh;center,top&resize=320:*", "https://hips.hearstapps.com/hmg-prod/images/image-uploaded-from-ios-146-1504631756.jpg?crop=1xw:1xh;center,top&resize=320:*", "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/18/1493681955-gettyimages-675592644.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/backgrid-100917-200-1509384159.jpeg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/prince-charles-prince-of-wales-catherine-duchess-of-news-photo-1665070899.jpg?crop=0.668xw:1.00xh;0.0817xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-844563978-1504959627.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/justin-selena-the-weeknd-1509329465.jpg?crop=1.00xw:1.00xh;0,0&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/sarah-jessica-parker-and-kristin-davis-are-seen-on-the-set-news-photo-1664990757.jpg?crop=1.00xw:0.751xh;0,0&resize=180:*", "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/23/1496755742-spl1513791-002.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/15/1492306604-image-uploaded-from-ios-32.jpg?crop=1xw:1xh;center,top&resize=320:*", "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/23/1496867222-image-uploaded-from-ios-56.jpg?crop=1xw:1xh;center,top&resize=320:*", "https://hips.hearstapps.com/hmg-prod/images/selena-the-weknd-1505162324.jpg?crop=1.00xw:1.00xh;0,0&resize=300:*", "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/23/1496756394-capture-decran-2017-06-06-a-93938-am.png?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/the-weeknd-performs-onstage-during-the-2018-coachella-news-photo-1598380824.jpg?crop=1.00xw:0.804xh;0,0.0682xh&resize=480:*", "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/33/1600x800/landscape-1502990361-elle-justin-bieber-selena-gomez.jpg?resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/leo-gigi-gettyimages-1662584674.jpg?crop=0.492xw:0.984xh;0.508xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/catherine-princess-of-wales-prince-william-prince-of-wales-news-photo-1665073240.jpg?crop=0.668xw:1.00xh;0.269xw,0&resize=180:*", "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/15/1491840031-image-uploaded-from-ios-30.jpg?crop=1xw:1xh;center,top&resize=320:*", "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/23/1496842688-bgus-879592-006-60.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/30/1500901684-elle-the-weeknd-selena-gomez.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/vidthumb/manual_upload/59766295bbddbd0c30bd6f64/thumb_1500930712_204x124.jpg?crop=1xw:1xh;center,top&resize=480:*", "http://www.elle.com/_assets/design-tokens/elle/static/images/logos/network-logo.a5366f4.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-844723778-1504959792.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/catherine-princess-of-wales-smiles-during-her-visit-to-the-news-photo-1665066747.jpg?crop=0.655xw:0.444xh;0.175xw,0.0369xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/jennifer-lopez-and-ben-affleck-are-seen-on-september-04-news-photo-1665077679.jpg?crop=0.758xw:0.569xh;0.143xw,0.0276xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1665078833.jpg?crop=0.388xw:0.259xh;0.304xw,0.0578xh&resize=180:*", "https://hips.hearstapps.com/vidthumb/manual_upload/59f78d8cbbddbd788a4f9047/thumb_1509395855_204x124.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/image-uploaded-from-ios-163-1505740368.jpg?crop=1xw:1xh;center,top&resize=320:*", "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/31/1501852150-image-uploaded-from-ios-115.jpg?crop=1xw:1xh;center,top&resize=320:*"], "top_img": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/09/4000x2000/landscape-1488572662-instar-selena-gomez-kisses-the-weeknd-exclusive-3341834131.JPG?resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.elle.com/culture/celebrities/a12115489/selena-gomez-and-the-weeknd-relationship-timeline/", "title": "Everything That Happened in Selena and Abel Tesfaye's Dating Relationship", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "X-UA-Compatible": "IE=edge,chrom=1", "msapplication-tap-highlight": "no", "title": "Selena Gomez and The Weeknd Relationship Timeline - Everything That Happened in Selena and Abel Tesfaye's Dating Relationship", "description": "From first makeout to their Coachella Instagram official selfie, with all the drama in between.", "keywords": "Selena Gomez,The Weeknd,bella hadid,justin bieber, abelena, selena gomez and the weeknd breakup, abel tesfaye", "theme-color": "#000000", "og": {"site_name": "ELLE", "title": "A Complete Timeline of Selena Gomez and The Weeknd's Relationship, Including His Songs About Her", "description": "From first makeout to their Coachella Instagram official selfie, with all the drama in between.", "image": {"identifier": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/09/4000x2000/landscape-1488572662-instar-selena-gomez-kisses-the-weeknd-exclusive-3341834131.JPG?resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.elle.com/culture/celebrities/a12115489/selena-gomez-and-the-weeknd-relationship-timeline/", "type": "article"}, "fb": {"app_id": 364664413547847, "pages": 31911516300}, "article": {"publisher": "https://www.facebook.com/ellemagazine", "section": "Celebrity News 2022", "modified_time": "2021-11-29T19:17:47Z", "published_time": "2021-04-01T13:48:00Z"}, "twitter": {"site": "@ELLEmagazine", "image": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/09/4000x2000/landscape-1488572662-instar-selena-gomez-kisses-the-weeknd-exclusive-3341834131.JPG?resize=640:*", "card": "summary_large_image"}, "google-site-verification": "W6SOBCzCmb2sA5l3z9YK1yO7I7bPYArVQCP09_e2zck", "thumbnail": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/09/2560x2560/square-1488572662-instar-selena-gomez-kisses-the-weeknd-exclusive-3341834131.JPG?resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/09/2560x2560/square-1488572662-instar-selena-gomez-kisses-the-weeknd-exclusive-3341834131.JPG?resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/ell.h-cdn.co/assets/17/09/2560x2560/square-1488572662-instar-selena-gomez-kisses-the-weeknd-exclusive-3341834131.JPG", "auto-publish": "timely", "sailthru.excerpt": "Selena Gomez and The Weeknd's (whose real name is Abel Tesfaye) breakup was reported in October 2017 after nearly 10 months of dating. Theirs was a relationship of worldwide PDA, sweet Instagram stories about the other, and so much more. Here, a look back from start to finish, including Instagram", "sailthru.tags": "culture,Culture,celebrities,Celebrity News 2022", "sailthru.date": "2021-04-01 13:48:00", "sailthru.socialtitle": "A Complete Timeline of Selena Gomez and The Weeknd's Relationship, Including His Songs About Her", "sailthru.contenttype": "standard-article", "m1": ".content-hed", "m2": ".content-dek p", "next-head-count": 47}, "movies": [], "publish_date": 1617284880.0, "source": "http://www.elle.com", "summary": ""}