{"url": "https://www.billboard.com/articles/columns/country/8338262/acm-awards-2018-what-you-didnt-see-on-tv", "text": "The 2018 ACM Awards are officially wrapped, putting another star-studded night of country music in the books. Starting with a touching tribute to those who lost their lives and were affected by the Route 91 Harvest Festival shooting in October and ending with a heartfelt speech from entertainer of the year winner Jason Aldean, this year’s Las Vegas-based ACMs were particularly bittersweet — yet, there was nothing but positive energy all around as country’s biggest stars embodied #VegasStrong.\n\nBillboard was on the red carpet and inside the show Sunday night (April 15) to catch the happenings that weren’t shown in the live broadcast . Check out some of the action we caught below.\n\nRelated Here Are All the Winners From the 2018 ACM Awards\n\n3:40 p.m. Cam and pop singer Bebe Rexha, who crashed the ACMs to perform “Meant To Be,” her massive hit with Florida Georgia Line, embrace on the red carpet, reuniting after hanging together at “American Idol, The Macy’s Thanksgiving Day Parade, and March For Our Lives.\n\n4:15 p.m. Midland, Jon Pardi and the Brothers Osborne admire each other’s sparkling outfits on the red carpet. “I’m jelly,” declared Jon Osborne of Pardi’s white, sparkly jacket, complete with flowers, instruments, and, touchingly, a tribute to the 58 fans who were killed in the Route 91 Festival massacre with “Honor 58” emblazoned on the sleeve. “It’s very bedazzly,” Pardi said, of his jacket. “We’re Rhinestone Central,“ added Midland’s Mark Wystrach.\n\n5:02 p.m. PT Jason Aldean takes his time walking off stage to head to his seat after the opening Route 91 tribute, waving to fans as he makes his way to his seat.\n\n5:04 p.m. After Reba McEntire takes a shot at former ACM co-hosts Blake Shelton and Luke Bryan saying “One women can do the job of two men, “Blake Shelton and Luke Bryan come together to holler at this year’s host.\n\n5:08 p.m. Kenny Chesney shoots a friendly point across the arena to Reba before the camera goes on him for his first televised performance of “Get Along.”\n\n5:18 p.m. Chris Young gives hugs to a few folks on his way out from his stripped-down performance of “Losing Sleep.”\n\n5:20 p.m. Julia Michaels snaps a picture with Miranda Lambert and Keith Urban during the first commercial break.\n\n5:22 p.m. Florida Georgia Line waves to fans as they take their places and Tyler Hubbard busts a move to get amped for their performance of “Meant To Be” with Bebe Rexha.\n\n5:28 p.m. New male vocalist of the year winner Brett Young applauds Miranda Lambert for winning song of the year for “Tin Man” and turns to watch the acceptance speech as he waits for his performance of “In Case You Didn’t Know.”\n\n5:33 p.m. Keith Urban starts to make his rounds of catching up with his fellow superstars, chatting with Luke Bryan and his wife and snapping a couples pic with his wife Nicole Kidman during the second commercial break.\n\n5:36 p.m. Reba does a quick dance before she resumes her hosting duties.\n\n5:38 p.m. Alan Jackson gets the crowd the most electric yet, getting them on their feet to dance along to his performance of “Chattahoochee” with Jon Pardi.\n\n5:46 p.m. Jake Owen was one of the first to his feet after Lady Antebellum‘s gripping performance of “Heart Break,” looking around like “that was f-ing awesome!”\n\n5:50 p.m. Dierks Bentley takes his seat right after going to his wife during his performance of “Woman, Amen,” hi-fiving Luke Bryan about their hilarious onscreen moment.\n\n6:02 p.m. Lauren Alaina gives Kane Brown a huge hug after they finish introducing the ACM Lifting Lives video that followed their performance of “What Ifs.”\n\n6:14 p.m. Keith Urban excitedly swings his guitar in the air to celebrate his performance with Julia Michaels on their duet “Coming Home,” which makes her jump while laughing at the close call. As the two make their way off stage, Michaels swings her arm around Urban.\n\n6:21 p.m. Kelsea Ballerini runs through her performance with herself quickly before cameras roll, taking a deep breath as the floating heart she started her “I Hate Love Songs” performance in moves her up in the air. After finishing the full performance, she jumps up and down with her hands up and high fives her band.\n\n6:42 p.m. Midland frontman Mark Wystrach passionately sings along to Little Big Town’s rendition of Elton John’s “Rocket Man” while they get ready to perform their own hit “Drinkin’ Problem.”\n\n6:54 p.m. Keith Urban chats it up with Florida Georgia line in their first and second row seats in between segments of the show.\n\n7:09 p.m. RaeLynn sees some people she knows as she walks around the floor, doing a little get down when she sees one friend in particular.\n\n7:21 p.m. Thomas Rhett‘s wife Lauren Akins sings and sways along to his performance of “Marry Me,” and they give a little cute point to each other after he’s done with the song.\n\n7:32 p.m. Luke Bryan fist bumps his band as soon as cameras go off of him after his performance of “Most People Are Good.”\n\n7:35 p.m. The news that Sam Hunt wasn’t in attendance to accept his single record of the year award for “Body Like A Back Road” resulted in a slew of disappointed “awws” from the audience.\n\n7:37 p.m. Lauren Alaina spots her boyfriend Alex Hopkins across the room after she finishes her “Doin’ Fine” performance and they excitedly point at each other as he sends a congratulatory kiss her way.\n\n7:44 p.m. Kelly Clarkson gets in her presenting position before her performance with Reba McEntire by, of course, doing a little dance.\n\n7:59 p.m. Chris Janson‘s performance gets everyone on their feet, but gets Keith Urban and Nicole Kidman particularly pumped as they throw their fists in the air as he finishes. LOCASH‘s Preston Brust may have been the most excited of them all, though, as he stood on his seat to applaud the rocking show closer.", "images": ["http://static.billboard.com/files/media/2018-Academy-of-Country-Music-Awards.png", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.billboard.com/wp-content/uploads/media/keith-urban-julia-michaels-miranda-lambert-2018-ACM-show-billboard-1548.jpg?w=1024", "https://www.facebook.com/tr?id=204652553202666&ev=PageView&noscript=1", "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/public/lazyload-fallback.gif"], "top_img": "https://www.billboard.com/wp-content/uploads/media/keith-urban-julia-michaels-miranda-lambert-2018-ACM-show-billboard-1548.jpg?w=1024", "keywords": [], "authors": ["Taylor Weatherby"], "canonical_link": "https://www.billboard.com/music/country/acm-awards-2018-what-you-didnt-see-on-tv-8338262/", "title": "26 Things You Didn’t See on TV at the 2018 ACM Awards", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/icons/icon-144x144.png", "msapplication-TileColor": "#eff4ff", "description": "Billboard was on the red carpet and inside the show Sunday night (April 15) to catch the happenings that weren't shown in the live broadcast of the show. Check out some of the action we caught below.", "news_keywords": "acm, ACMAs, bbnews", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "billboard", "pmc-page_type": "article", "articleid": 8338262, "author": "Taylor Weatherby", "pmc-category": "Country,Music", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-04-16T01:59:34"}, "pmc-tag": "acm,ACMAs,bbnews", "title": "26 Things You Didn’t See on TV at the 2018 ACM Awards", "pageclass": "article", "pmc-is_free": "no", "pmc-always-paywall": "no", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-exclusive": "no", "pmc-breaking-news": "no", "pmc-prime": "no"}, "generator": "WordPress 6.0.2", "author": "Taylor Weatherby", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Billboard", "application-name": "Billboard", "content_type": "Article", "post_id": 8338262, "title": "26 Things You Didn't See on TV at the 2018 ACM Awards", "published_at": "2018-04-16 01:59:34", "image": "https://www.billboard.com/wp-content/uploads/media/keith-urban-julia-michaels-miranda-lambert-2018-ACM-show-billboard-1548.jpg?w=1024", "comment_count": 0, "tags": "bbnews", "topics": "Music", "body": "The 2018 ACM Awards are officially wrapped, putting another star-studded night of country music in the books. Starting with a touching tribute to those who lost their lives and were affected by the Route 91 Harvest Festival shooting in October and ending with a heartfelt speech from entertainer of the year winner Jason Aldean, this year's Las Vegas-based ACMs were particularly bittersweet -- yet, there was nothing but positive energy all around as country's biggest stars embodied #VegasStrong.Billboard was on the red carpet and inside the show Sunday night (April 15) to catch the happenings that weren't shown in the live broadcast . Check out some of the action we caught below. 3:40 p.m.  Cam and pop singer Bebe Rexha, who crashed the ACMs to perform “Meant To Be,” her massive hit with Florida Georgia Line, embrace on the red carpet, reuniting after hanging together at “American Idol, The Macy’s Thanksgiving Day Parade, and March For Our Lives.4:15 p.m. Midland, Jon Pardi and the Brothers Osborne  admire each other’s sparkling outfits on the red carpet. “I’m jelly,” declared Jon Osborne of Pardi’s white, sparkly jacket, complete with flowers, instruments, and, touchingly, a tribute to the 58 fans who were killed in the Route 91 Festival massacre with “Honor 58” emblazoned on the sleeve. “It’s very bedazzly,” Pardi said, of his jacket. “We’re Rhinestone Central,“ added Midland’s Mark Wystrach.5:02 p.m. PT Jason Aldean takes his time walking off stage to head to his seat after the opening Route 91 tribute, waving to fans as he makes his way to his seat.5:04 p.m. After Reba McEntire takes a shot at former ACM co-hosts Blake Shelton and Luke Bryan saying \"One women can do the job of two men, \"Blake Shelton and Luke Bryan come together to holler at this year's host.5:08 p.m. Kenny Chesney shoots a friendly point across the arena to Reba before the camera goes on him for his first televised performance of \"Get Along.\"5:18 p.m. Chris Young gives hugs to a few folks on his way out from his stripped-down performance of \"Losing Sleep.\"5:20 p.m. Julia Michaels snaps a picture with Miranda Lambert and Keith Urban during the first commercial break.5:22 p.m. Florida Georgia Line waves to fans as they take their places and Tyler Hubbard busts a move to get amped for their performance of \"Meant To Be\" with Bebe Rexha.5:28 p.m. New male vocalist of the year winner Brett Young applauds Miranda Lambert for winning song of the year for \"Tin Man\" and turns to watch the acceptance speech as he waits for his performance of \"In Case You Didn't Know.\"5:33 p.m. Keith Urban starts to make his rounds of catching up with his fellow superstars, chatting with Luke Bryan and his wife and snapping a couples pic with his wife Nicole Kidman during the second commercial break.5:36 p.m. Reba does a quick dance before she resumes her hosting duties.5:38 p.m. Alan Jackson gets the crowd the most electric yet, getting them on their feet to dance along to his performance of \"Chattahoochee\" with Jon Pardi.5:46 p.m. Jake Owen was one of the first to his feet after Lady Antebellum's gripping performance of \"Heart Break,\" looking around like \"that was f-ing awesome!\"5:50 p.m. Dierks Bentley takes his seat right after going to his wife during his performance of \"Woman, Amen,\" hi-fiving Luke Bryan about their hilarious onscreen moment.6:02 p.m. Lauren Alaina gives Kane Brown a huge hug after they finish introducing the ACM Lifting Lives video that followed their performance of \"What Ifs.\"6:14 p.m. Keith Urban excitedly swings his guitar in the air to celebrate his performance with Julia Michaels on their duet \"Coming Home,\" which makes her jump while laughing at the close call. As the two make their way off stage, Michaels swings her arm around Urban.6:21 p.m. Kelsea Ballerini runs through her performance with herself quickly before cameras roll, taking a deep breath as the floating heart she started her \"I Hate Love Songs\" performance in moves her up in the air. After finishing the full performance, she jumps up and down with her hands up and high fives her band.6:42 p.m. Midland frontman Mark Wystrach passionately sings along to Little Big Town's rendition of Elton John's \"Rocket Man\" while they get ready to perform their own hit \"Drinkin' Problem.\"6:54 p.m. Keith Urban chats it up with Florida Georgia line in their first and second row seats in between segments of the show. 7:09 p.m. RaeLynn sees some people she knows as she walks around the floor, doing a little get down when she sees one friend in particular.7:21 p.m. Thomas Rhett's wife Lauren Akins sings and sways along to his performance of \"Marry Me,\" and they give a little cute point to each other after he's done with the song.7:32 p.m. Luke Bryan fist bumps his band as soon as cameras go off of him after his performance of \"Most People Are Good.\"7:35 p.m. The news that Sam Hunt wasn't in attendance to accept his single record of the year award for \"Body Like A Back Road\" resulted in a slew of disappointed \"awws\" from the audience. 7:37 p.m. Lauren Alaina spots her boyfriend Alex Hopkins across the room after she finishes her \"Doin' Fine\" performance and they excitedly point at each other as he sends a congratulatory kiss her way.7:44 p.m. Kelly Clarkson gets in her presenting position before her performance with Reba McEntire by, of course, doing a little dance.7:59 p.m. Chris Janson's performance gets everyone on their feet, but gets Keith Urban and Nicole Kidman particularly pumped as they throw their fists in the air as he finishes. LOCASH's Preston Brust may have been the most excited of them all, though, as he stood on his seat to applaud the rocking show closer.", "fb": {"pages": 75791669580}, "fragment": "!", "og": {"type": "article", "title": "26 Things You Didn’t See on TV at the 2018 ACM Awards", "url": "https://www.billboard.com/music/country/acm-awards-2018-what-you-didnt-see-on-tv-8338262/", "description": "Billboard was on the red carpet and inside the show Sunday night (April 15) to catch the happenings that weren’t shown in the live broadcast of the show. Check out some of the action we caugh…", "site_name": "Billboard", "image": {"identifier": "https://www.billboard.com/wp-content/uploads/media/keith-urban-julia-michaels-miranda-lambert-2018-ACM-show-billboard-1548.jpg?w=1024", "width": 1024, "height": 677, "alt": "Keith Urban Julia Michaels Miranda Lambert"}, "locale": "en_US"}, "article": {"published_time": "2018-04-16T05:59:34+00:00", "modified_time": "2018-04-16T19:33:23+00:00"}, "twitter": {"site": "@billboard", "card": "summary_large_image", "title": "26 Things You Didn’t See on TV at the 2018 ACM Awards", "description": "Billboard was on the red carpet and inside the show Sunday night (April 15) to catch the happenings that weren't shown in the live broadcast of the show. Check out some of the action we caught below.", "image": "https://www.billboard.com/wp-content/uploads/media/keith-urban-julia-michaels-miranda-lambert-2018-ACM-show-billboard-1548.jpg?w=1024"}}, "movies": [], "publish_date": 1523858374.0, "source": "https://www.billboard.com", "summary": ""}