{"url": "https://www.theguardian.com/uk-news/2017/sep/05/topless-photos-of-duchess-of-cambridge-were-invasion-of-privacy", "text": "The Duke and Duchess of Cambridge have welcomed a French court verdict that paparazzi photos of Kate topless on holiday were an invasion of the royal couple’s privacy.\n\nTwenty-four hours after the announcement that Kate and Prince William were expecting their third child, the court in Nanterre, west of Paris, awarded them €100,000 (£91,000) in damages and interest to be paid by the celebrity magazine Closer and two photographers.\n\n\n\nThe magazine’s editor and the CEO of its publisher were each fined a further €45,000 – the maximum allowed. The awards, while high for a French court, are considerably lower than the €1.5m the couple’s legal team had demanded.\n\n\n\nAfter the verdict, royal aides said the couple had suffered an “unjustified intrusion” and were pleased the judge had found in their favour.\n\n“The incident was a serious breach of privacy, and their royal highnesses felt it essential to pursue all legal remedies,” a statement read.\n\nA lawyer for Closer, Paul-Albert Iweins, said the damages award was in line with previous payouts but that the fines were “exaggerated considering it was a simple case of privacy”.\n\n\n\nSix people, including three photographers, were tried this year after long-lens pictures of the couple on holiday in France were published in the French celebrity magazine and a local newspaper, La Provence.\n\nThe photographs were taken in the summer of 2012 and show the royal couple on a terrace by a swimming pool at a private chateau owned by Viscount Linley, the Queen’s nephew, in the Luberon, Provence.\n\nSplashed across the cover of Closer under the headline: “Oh My God [in English]: the photos that will go around the world,” the photos show the duchess wearing only the bottom half of her bikini. There were more topless photographs on the inside pages.\n\n\n\nA week before the Closer pictures were published, La Provence carried a photograph of Kate in the same property wearing a swimsuit.\n\n\n\nThe photographs were reportedly offered to British publications, which turned them down.\n\nAfter Closer hit the newsstands, the couple were granted an immediate injunction preventing the photos being used elsewhere, but they still appeared in several European publications.\n\n\n\nTheir lawyers asked that Closer be ordered to pay €1.5m in damages and compensation for the “shock” of seeing the paparazzi photographs printed, and a further €50,000 from La Provence.\n\n\n\nIn a letter to the court – read at a hearing in May – William wrote that the case was “particularly shocking because it reminded us of the harassment that led to the death of my mother, Diana, Princess of Wales”.\n\n\n\nDiana was killed in a car accident in August 1997 while being chased through a Paris underpass by photographers. Her boyfriend, Dodi Fayed, and the car’s driver, Henri Paul, who had been drinking, were also killed.\n\nIn his declaration, the duke said: “In September 2012, my wife and I thought that we could go to France for a few days in a secluded villa owned by a member of my family, and thus enjoy our privacy. We know France and the French and we know that they are, in principle, respectful of private life, including that of their guests. The clandestine way in which these photographs were taken was particularly shocking to us as it breached our privacy.”\n\n\n\nSt James’s Palace issued a statement at the time describing the incident as being “reminiscent of the worst excesses of the press and paparazzi during the life of Diana, Princess of Wales”.\n\nThe public prosecutor had also asked for “very significant” fines for Closer’s editor, Laurence Pieau, Ernesto Mauri – the CEO of publisher Mondadori – and two Paris picture agency photographers, Cyril Moreau and Dominique Jacovides, suspected of having taken the shots. The pair, along with Valerie Suau from La Provence, faced charges of invading or being complicit to an invasion of William and Kate’s privacy.\n\nMoreau and Jacovides, who denied the charges, were each fined €10,000, of which half was suspended. Suau was given a €1,000 suspended fine and the newspaper director at the time the pictures were published, Marc Auburtin, was given a €1,500 suspended fine. Auburtin and Suau were jointly ordered to pay €3,000 damages to the couple.\n\nSuau admitted taking photographs of the royal couple at the Linley property, but said she did not consider them to be a breach of privacy.\n\n\n\nFrench courts do not usually make large awards in such cases. The former president François Hollande’s partner, Julie Gayet, was awarded €15,000 after Closer published pictures of them, and Florian Philippot, a vice-president of the far-right Front National, received a €20,000 award for the publication of photos of him with another man, said to be his partner.\n\n\n\nDuring the May hearing, Iweins attacked the “Anglo-Saxon reasoning behind punitive damages and compensation” and said the trial was hypocritical.\n\n\n\n“The public and private lives of the royal couple are so closely linked as to be inseparable,” Iweins said, adding that the photographs cast the young couple in a positive light.\n\n\n\n“It’s of public interest to know that future heirs to the throne have a solid relationship and are getting on well. It’s all part of the royal business,” he said.\n\n\n\nCloser is owned by the Italian-based Mondadori Group, one of the biggest publishing companies in Europe, which owns several high-profile glossy magazines including Grazia.", "images": ["https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Catherine%2C+Princess+of+Wales%2CPrince+William%2CPrivacy+%26+the+media%2CFrance%2CPrivacy%2CMonarchy%2CUK+news%2CMedia%2CEurope%2CWorld+news", "https://i.guim.co.uk/img/media/b40f3b99a903eb0072e9fbfb6be157f7117f216a/362_274_3261_1957/master/3261.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctYWdlLTIwMTcucG5n&enable=upscale&s=01d5c4c255c7e1f41911e24d1def0be3", "https://i.guim.co.uk/img/media/b40f3b99a903eb0072e9fbfb6be157f7117f216a/362_274_3261_1957/master/3261.jpg?width=465&quality=85&dpr=1&s=none"], "top_img": "https://i.guim.co.uk/img/media/b40f3b99a903eb0072e9fbfb6be157f7117f216a/362_274_3261_1957/master/3261.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctYWdlLTIwMTcucG5n&enable=upscale&s=01d5c4c255c7e1f41911e24d1def0be3", "keywords": [], "authors": ["Kim Willsher"], "canonical_link": "https://www.theguardian.com/uk-news/2017/sep/05/topless-photos-of-duchess-of-cambridge-were-invasion-of-privacy", "title": "Court awards Duchess of Cambridge damages over topless photos", "meta_data": {"description": "French court rules Kate’s privacy was breached in case over paparazzi shots published in celebrity magazine", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#052962", "og": {"url": "http://www.theguardian.com/uk-news/2017/sep/05/topless-photos-of-duchess-of-cambridge-were-invasion-of-privacy", "image": {"identifier": "https://i.guim.co.uk/img/media/b40f3b99a903eb0072e9fbfb6be157f7117f216a/362_274_3261_1957/master/3261.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctYWdlLTIwMTcucG5n&enable=upscale&s=01d5c4c255c7e1f41911e24d1def0be3", "height": 720}, "title": "Court awards Duchess of Cambridge damages over topless photos", "description": "French court rules Kate’s privacy was breached in case over paparazzi shots published in celebrity magazine", "type": "article", "site_name": "the Guardian"}, "article": {"author": "https://www.theguardian.com/profile/kim-willsher", "publisher": "https://www.facebook.com/theguardian", "modified_time": "2017-11-27T17:30:35.000Z", "section": "UK news", "published_time": "2017-09-05T15:49:48.000Z", "tag": "Catherine, Princess of Wales,Prince William,Privacy & the media,France,Privacy,Monarchy,UK news,Media,Europe,World news"}, "al": {"ios": {"url": "gnmguardian://uk-news/2017/sep/05/topless-photos-of-duchess-of-cambridge-were-invasion-of-privacy?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287}, "twitter": {"dnt": "on", "app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"googleplay": "guardian://www.theguardian.com/uk-news/2017/sep/05/topless-photos-of-duchess-of-cambridge-were-invasion-of-privacy", "iphone": "gnmguardian://uk-news/2017/sep/05/topless-photos-of-duchess-of-cambridge-were-invasion-of-privacy?contenttype=Article&source=twitter", "ipad": "gnmguardian://uk-news/2017/sep/05/topless-photos-of-duchess-of-cambridge-were-invasion-of-privacy?contenttype=Article&source=twitter"}}, "card": "summary_large_image", "image": "https://i.guim.co.uk/img/media/b40f3b99a903eb0072e9fbfb6be157f7117f216a/362_274_3261_1957/master/3261.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctYWdlLTIwMTcucG5n&s=e5e4fb4454d4d8413959ba8897f1a925", "site": "@guardian"}, "robots": "max-image-preview:large"}, "movies": [], "publish_date": 1504566000.0, "source": "https://www.theguardian.com", "summary": ""}