{"url": "https://www.desmoinesregister.com/story/sports/2018/01/22/shawn-johnson-east-usa-gymnastics-failed-protect-athletes-system-needs-change/1056563001/", "text": "Shawn Johnson East: 'If I had a daughter right now, I couldn't' put her in gymnastics\n\nShow Caption Hide Caption Judge to Nassar: These victims are superheroes Ingham County Circuit Judge Rosemarie Aquilina speaks to Larry Nassar after he apologizes at his hearing Wednesday, Nov. 22. Matt Mencarini/Lansing State Journal\n\nOlympic gold medalist Shawn Johnson East criticized USA Gymnastics, the sport's national governing body, for making winning a priority while failing to protect its athletes.\n\nJohnson East posted a video on her YouTube channel, speaking out against the group that has been rocked by sexual abuse allegations against former team doctor Larry Nassar.\n\nThe 2008 Olympian said USA Gymnastics failed to protect female athletes by disregarding their safety, instead pursuing gold medals. She suggested that the organization needs to change.\n\n\"Knowing that USA Gymnastics has failed their athletes so terribly disappoints me and makes me so incredibly angry,\" Johnson East said in the video. \"I think the fact that any of this has ever happened shows that USA Gymnastics has failed as a governing body to protect the athletes that it supports and claims to care about.\"\n\nJohnson East is just the latest athlete to criticize the group.\n\nMore on the USA Gymnastics and Larry Nassar scandals:\n\nShe said in the video that she attempted to film her comments \"countless times\" because she felt angry, confused and cried.\n\n\"It's so wrong,\" Johnson East said. \"You need to change the system.\"\n\nThe allegations made her questioned the sport, too.\n\n\"If I had a daughter right now, I couldn't put her in it,\" Johnson East said. \"I can't even trust USA Gymnastics.\"\n\nThe video posted by Johnson East was titled \"i am disgusted.\"\n\nShe addressed the victims of sexual abuse, including those she characterized as very close friends and women she looks up to: \"Know I'm praying for you, I love you, you have experienced some of the worst evil in the world, and to know that you guys have a voice and that you're standing up for so many people, just know that you are my heroes.\"\n\nAt one point in the video, Johnson East becomes emotional and holds back tears.\n\n\"The fact that a system that is supposed to protect children has failed them so bad is so wrong,\" Johnson East said.\n\nAs a former teammate of some of the women who have spoken against Nassar during a sentencing hearing, Johnson East said she felt for the victims in a personal way.\n\n\"To see the videos of Aly (Raisman) and Jordyn (Wieber) — these girls that, like, I grew up with and love so much — have to face this man who has violated them in the worst way possible is just disgusting,\" she said.\n\nRaisman and Weber were members of the 2012 U.S. Olympic team.\n\nJohnson East grew up in the Des Moines area and trained at Chow's Gymnastics in West Des Moines.\n\nShe started competing in gymnastics in 1995. By the time she turned 13, she participated in international competition.\n\nJohnson East won four Olympic medals in the 2008 Beijing games. She took gold in the balance beam and three silver medals.", "images": ["https://www.gannett-cdn.com/-mm-/ca215a705697662055c6c462e43c1a64bc9ce189/c=272-1571-2243-2685/local/-/media/2017/08/18/IAGroup/DesMoines/636386862594899797-USATSI-3157661.jpg?auto=webp&format=pjpg&width=1200", "https://media.gannett-cdn.com/41075352001/41075352001_5655123572001_5655085008001-vs.jpg?pubId=41075352001", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/ca215a705697662055c6c462e43c1a64bc9ce189/c=272-1571-2243-2685/local/-/media/2017/08/18/IAGroup/DesMoines/636386862594899797-USATSI-3157661.jpg?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["John Naughton"], "canonical_link": "https://www.desmoinesregister.com/story/sports/2018/01/22/shawn-johnson-east-usa-gymnastics-failed-protect-athletes-system-needs-change/1056563001/", "title": "Shawn Johnson East: 'If I had a daughter right now, I couldn't' put her in gymnastics", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=524153305, app-argument=https://www.desmoinesregister.com/story/sports/2018/01/22/shawn-johnson-east-usa-gymnastics-failed-protect-athletes-system-needs-change/1056563001/sports", "theme-color": "#ffffff", "og": {"title": "Shawn Johnson East: 'If I had a daughter right now, I couldn't' put her in gymnastics", "description": "USA Gymnastics needs to change, Olympian Shawn Johnson East says", "site_name": "The Des Moines Register", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/ca215a705697662055c6c462e43c1a64bc9ce189/c=272-1571-2243-2685/local/-/media/2017/08/18/IAGroup/DesMoines/636386862594899797-USATSI-3157661.jpg?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "description": "USA Gymnastics needs to change, Olympian Shawn Johnson East says", "twitter": {"site": "@DMRegister", "creator": "@DMRegister", "card": "summary_large_image"}}, "movies": ["https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FdAyg7C2-mjQ%3Ffeature%3Doembed&url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DdAyg7C2-mjQ&image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FdAyg7C2-mjQ%2Fhqdefault.jpg&key=5ba8761fabe14af29c6cb21d8d3fb1a5&type=text%2Fhtml&schema=youtube"], "publish_date": 1516579200.0, "source": "https://www.desmoinesregister.com", "summary": ""}