{"url": "https://www.instyle.com/reviews-coverage/movies/romy-and-michele-high-school-reunion-20th-anniversary-oral-history", "text": "Back in the '90s, female-driven comedies were a rarity in Hollywood. It wasn't until 2011 that Bridesmaids became a sleeper hit, unsuspectingly breaking box office records and thereby paving the way for everybody else. So when writer-producer and Groundlings alumna Robin Schiff wrote a screenplay about a pair of airheaded girls from the Valley who concoct an elaborate ruse for their ten-year high school reunion, the possibility that the project would come to fruition remained sadly unlikely.\n\nBut after the original incarnation became a play and then, briefly, a short-lived TV pilot, Romy and Michele's High School Reunion—which premiered in theaters on April 25, 1997—amassed a rabid following, thanks to its pithy one-liners (\"I'm the Mary and you're the Rhoda!\"), iconic costumes, a catchy soundtrack, and tender relatability. The film was an ode to the outcasts: Not only do its titular heroines, played impeccably by Mira Sorvino and Lisa Kudrow, conquer their high school demons—they discover a newfound sense of self in the process.\n\nIn honor of Romy and Michele's High School Reunion's 20th anniversary, we reached out to the cast and crew, including Mira Sorvino, Lisa Kudrow, and Alan Cumming, to reminisce about the making of the cult classic.\n\nAlamy\n\nDavid Mirkin (director): It's nightmarish that it's been 20 years. You remember things so vividly, you have no idea the amount of time that has passed.\n\nMira Sorvino (Romy White): The number of years crept up on me, but I've gotten married and had four kids since then, so I guess I can believe it.\n\nLisa Kudrow (Michele Weinberger): I saw it in my mind as something that was 10 years ago, then my husband reminded me that it was 20.\n\nAlan Cumming (Sandy Frink): It's terrifying. But I suppose it does make sense mathematically.\n\nJulia Campbell (Christy Masters): I was shocked when my agent told me. It feels like just yesterday.\n\nElaine Hendrix (Lisa Luder): Twenty years really sneaks up on you.\n\nVincent Ventresca (Billy Christianson): It's crazy. I just turned 50, so there are all these chunks of time that I'm measuring things by.\n\nJacob Vargas (Ramon): I only worked one day on the film—I did two scenes. It's amazing to see what an impression a character can make in such a short period of time.\n\nAlamy; Getty\n\nRobin Schiff (screenwriter): It all started when I went to a club called Carlos 'n Charlie's on the Sunset Strip for research and overheard two women in the bathroom. One of them said, \"Oh my god, I hate my hair.\" And the other one said, \"Your hair? I'd trade your hair for my hair in two seconds.\" There was a musical cadence to it. I went home, and by the time I got there, I had the characters. Two Disney executives thought it could be a female Wayne's World. I started brainstorming what to do with the characters for a movie: Romy and Michele Go to College, Romy and Michele Go to Japan. Then I finally thought, \"What if they get invited to their reunion and don't realize that their lives haven't amounted to anything until they fill out the questionnaire?\" That made me laugh.\n\nDavid Mirkin: We wanted to make a movie that was nastier than your average high school film. There wasn't even a happy ending. Not everyone gets together. It shows a lot of disillusionment. It shows a lot of problems.\n\nMira Sorvino: I was a geek in high school, and [the script] really struck a chord with me, as did the opportunity to do a female buddy comedy. It was like a female Dumb and Dumber, but with a ton of heart. The audience really relates to the pain that they're in—the humiliation of people judging them and being nasty to them and the beauty of their friendship. Most people were not the homecoming king and queen.\n\nLisa Kudrow: To me, it was mostly about two idiots. I knew there was some heart to it because they love each other and they're there for eachother. Everyone's been an outsider, especially in adolescence, so who can't relate to that? And not being aware: \"Wait, what group were we in? What? I didn't realize we were losers.\" That part rang true to me.\n\nRobin Schiff: My original idea was to make the characters super jappy, so [the names] Romy and Michele seemed jappy to me.\n\nLisa Kudrow: I grew up in the Valley, so I drew on girls I knew from school. In junior high, I went through a brief phase of not using any vowels.\n\nDavid Mirkin: Mira's accent was hilarious because she talked like someone who came from Philadelphia. I thought it was wrong in just the right way. It was Valley girl with an odd twist.\n\nAlan Cumming: There was a real wit to [the script]. It subverted the standard Hollywood buddy picture and made the stars two women. I remember talking to Robin [Schiff] one day and saying, \"I'm the girl in this film, aren't I?\"\n\nCamryn Manheim (Toby Walters): I love the fact that the women matured and became resourceful and creative. It proved that kindness and humanity rises to the top.\n\nDavid Mirkin: Originally, the movie didn't have an ending. The girls didn't get a boutique—they flew away with Sandy Frink and that was it. It became important to me that, even though Romy and Michele were idiots, they were also savants: Where they chose to live and what they chose to wear and how talented they were had to result in them having a boutique at the end.\n\nBuena Vista/courtesy Everett Collection\n\nDavid Mirkin: I'd been running The Simpsons and was sent a lot of scripts to direct. I loved working with strong funny women—there wasn't enough of that at the time, and it was so much fun to do. Then I got the script, which had been in development hell for a long time, and I saw immediately that it had enormous potential. It was really original and different.\n\nMona May (costume designer): I was riding the big wave of Clueless and met David Mirkin while working on ABC's The Edge. He wanted to bring someone on to create a style for the film. It's easy to make Valley girls in California look cheesy—he wanted something that was fashion-forward. I thought it would be a great opportunity to marry this fashion flick with great comedy.\n\nMira Sorvino: I had been nominated for an Oscar that year [for Mighty Aphrodite] and was offered the part. I remember reading the script on the subway and cracking up. People were giving me funny looks.\n\nDavid Mirkin: There was a tiny period of time when Toni Collette was being considered for Romy. I think she had a concern about doing the accent. Then I had lunch with Mira. I thought it was a longshot, but we hit it off so well, and I knew that her and Lisa would have great chemistry.\n\nLisa Kudrow: I was in the Groundlings and one of my teachers recommended me to Robin Schiff, who was holding a backer's audition for the play Ladies' Room. It was my first audition ever, and I got it. There were so many funny scenes: Romy would say, \"I hate throwing up in public,\" and Michele would go, \"Oh, me too!\" That must be why we're friends, because we have this one unique thing in common. [Laughs]\n\nRobin Schiff: That line—\"Me too!\"—was the line that got Lisa the job, because of the way she exclaimed it. Even though I'd written it, I didn't realize the true extent of what I had written.\n\nLisa Kudrow: Before the movie, we did a failed pilot, then it went away for a while and nothing really came of it. Then I got Friends and Robin called and said, \"So they want to go ahead with a movie.\" I didn't know if it would really happen. Then they got Mira Sorvino, and I was like, \"Holy crap—she just got nominated for an Oscar!\"\n\nMira Sorvino: I was a big fan of Lisa's, and she was already attached when I signed on.\n\nLisa Kudrow: Mira and I connected immediately. She's a woman with no guile. There's no agenda. And she's smart.\n\nDavid Mirkin: I think you can only sell people on a deep friendship if there's a true connection between the actors. Mira and Lisa started to become genuine friends before we even started to shoot. And of course they iced me completely afterward. [Laughs]\n\nAlan Cumming: I had just come to Hollywood after doing Circle of Friends, and I remember reading Romy and Michele and thinking, \"This is so witty and funny.\" I was told I wasn't going to get [the role]—it's the boy part in a big-budget film and I was new blood. But I really pushed. I had never been in America before. I had never been in a Hollywood movie before.\n\nJulia Campbell: I was doing a comedy playing [actor] Kevin Nealon's wife, and David Mirkin is one of Kevin's best friends and would come to the tapings. After I got the offer, it got pulled because somebody at Disney—I don't remember who—said that I wasn't pretty enough. Then David brought me back for a cast read-through and I got the job.\n\nElaine Hendrix: Interestingly enough, I auditioned to play another member of the A-Group. Then the actress who signed on to play Lisa Luder got let go and I was put in the Lisa Luder role.\n\nVincent Ventresca: I was on a half-hour show on NBC called Boston Common and auditioned during the summer of our first hiatus. I remember the [casting directors] were laughing really hard, and I wasn't really doing anything. Sometimes, when you're right for it, you don't really try anything—it comes out of your mouth and it just works. I read for the drunk scene: \"Romy? Michele? Weren't you guys totally in love with me in high school?\"\n\nCamryn Manheim: I was on The Practice at the time and went on a routine audition for it. It was not a departure for me: I am Toby Walters. I'm always in your face. I always want to schedule everything.\n\nJacob Vargas: I remember auditioning and having a good time with it. I decided to make [Ramon] really sleazy, just a real horndog. I guess it worked.\n\nAlamy\n\nRobin Schiff: I wrote very improvisationally. As soon as I got the idea for Romy and Michele to lie, there were a million things they could lie about. Then one day I was watching The Monkees' TV show and one of their mothers invented liquid paper. I tried to think of something else like that, and I thought of Post-its.\n\nMira Sorvino: The scene where I tell off the A-Group was not in the original script, but I kept telling Robin that we needed to have a big moment there. That was something for all of us who have suffered at the hands of cruel people. They needed that moment of vindication. We came up with that speech together.\n\nLisa Kudrow: If I had an idea, I was definitely allowed to add on. When they're at the reunion and Romy gets upset because everyone laughs at her, I felt like Michele was getting annoyed. So I said, \"Well, do you think you can stop being such a baby?\" I'd been chasing after her the whole reunion!\n\nAlan Cumming: I think Lisa and I improvised quite a lot in the limo scene. She took me to the Groundlings one night while we were filming: People shouted things in the audience and you had to just do them, and the second half is an entirely improvised play. I was like a deer in headlights the entire time.\n\nJacob Vargas: I remember adding in the rolling r: \"Rrrrrramon.\"\n\nAlamy\n\nMona May: Everything came from the page. They're young girls, free-spirited, living by themselves in the Valley. They were smart, but silly. Moschino is prevalent in the film. And I loved Blumarine and Versus Versace. I'd pair it with stuff that I found in thrift stores on Melrose Avenue. Mixing the high and the low was very fresh at the time.\n\nDavid Mirkin: I wanted to create a world where the girls lived inside the pages of a magazine. We shot in places that were very strong in primary colors, and they dressed in primary colors.\n\nRobin Schiff: I love what David did with all the colors. The whole movie is like being inside of a toy box. Because of the way it was shot and styled, it was never trendy. Even when it came out, it was its own thing, like Pee-wee's Big Adventure.\n\nMona May: Using color was very important. There was a very distinct palette. Except Janeane [Garofalo]. She was like, \"I want to wear black. Give me some galoshes.\" And Justin Theroux had to be in all black as her cowboy.\n\nLisa Kudrow: Our wardrobe was like a piece of candy or dessert. We looked like dolls. Or people in drag.\n\nMira Sorvino: A couple of the pieces were actually mine: The silver dress that I wore in the club, when I excused myself because my foot was filling up with blood, and the Armani suit for the business woman outfit.\n\nMona May: We wanted to make the business woman suits look classic, but each girl had their own look: Lisa's was very fitted—it had a shorter jacket with a low neckline. And Mira's was very business-like. Her jacket was longer and the shoulders were stronger.\n\nLisa Kudrow: I loved those suits! It felt like my style. I loved all the job interview suits, too. Those were cute.\n\nMona May: We put Lisa in Moschino skirt suits with funny little buttons for interviews. You had to believe everything was homemade—it could never look like something you got off the rack at Macy's. We hand-stitched the dresses for the dance sequence and used spandex so they could move around and nothing would rip. Each one was the same shape: a very simple A-line cut with an empire waist. The outfits had to be empowering: In that moment, the girls believed it was okay to be who they are. They felt good in their skin and weren't afraid to show it.\n\nLisa Kudrow: Those dresses were surprisingly comfortable and forgiving. Mira had imagined that Romy is kind of a Trekkie, even though it's not anywhere in the script. So her dress was blue and did have certain lines that you'd see in a Star Trek episode. [Laughs]\n\nMona May: I painted that Star Trek detail on Mira's dress.\n\nMira Sorvino: I think that was my idea! I'm a huge Star Trek geek.\n\nMona May: And the gym outfits! Their boobs almost were falling out. Only Romy and Michele would wear slutty club outfits to the gym.\n\nMira Sorvino: Walking on the treadmill with high platform heels was brilliant.\n\nLisa Kudrow: Wearing a bra [in the dream sequence] was not particularly fun for me, even though it probably had more material on it than a bathing suit top. I just thought, \"One day I'm going to have children, and here I am.\" Oh well.\n\nMona May: Romy and Michele's prom outfits were a tribute to Madonna. Mira wore this really short Betsey Johnson dress with a pink tutu, and Lisa had the vintage bustier and lace skirt. The A-Group's outfits looked like bad bridesmaid dresses—horrible lavender and green and peach with ruffles. I designed Elaine to look like she was wearing Chanel. So you see a foreshadowing of someone who separates themselves from the group with her style.\n\nJulia Campbell: The pastels were a signature. I had the lavender skirt when I was in high school, the lavender eye shadow ... all the way through the three main time periods: lavender.\n\nElaine Hendrix: Mona decided that each girl was going to have her own color palette. Mine was neutral because I was on a fashion track, which led to the suit at the end.\n\nMona May: Nobody in that group would ever wear a cream suit. It was a super timeless, Lauren Hutton-inspired suit.\n\nAlan Cumming: My rubber shoes were kind of hard to walk in—it was like wearing platforms. A lot of tripping went down.\n\nMona May: We made Alan's shoes. They had to have thick rubber soles, but also look high fashion and expensive because Sandy had a lot of money.\n\nJacob Vargas: Ramon fancied himself a Romeo—he was very confident. So he had the rolled sleeves, the gold chain, the gold watch.\n\nMona May: We totally focused on Ramon's biceps. [Laughs]\n\nBuena Vista/courtesy Everett Collection\n\nMira Sorvino: The dance number was great. We rehearsed for three weeks for that. My physical visual inspiration was a linebacker in drag.\n\nLisa Kudrow: Mira took ballet, so she brilliantly decided to aggressively pirouette around things. At the rehearsals, it got to a point where I told Smith [Wordes], the choreographer, \"Look, I don't dance, as you can see now.\" It made sense to me that Michele simply poses.\n\nDavid Mirkin: Originally, it was not an emotional dance sequence. It was a disco dance—like [John] Travolta to \"Stayin' Alive.\" But when Billy ditches Romy at the dance in the flashback, I wanted to show the complete breakdown and the importance of Michele helping her by dancing with her. That led to the song \"Time After Time,\" which connects to the dance at the end. You can do intense emotion at the same time you can do comedy.\n\nRobin Schiff: I wanted to take a low moment and make it into a high moment. I was a really visceral way to give them their moment of triumph other than telling off the A-Group.\n\nAlan Cumming: The dance was one paragraph in the script, but it was great to discover that they really wanted to go for it. It was a bit exhausting because we had to do it so many times.\n\nLisa Kudrow: At some point, it stopped being fun, that's for sure.\n\nRobin Schiff: The line in the movie that always makes me laugh out loud is in the flash-forward, when Sandy says, \"Have you been terribly unhappy with me all these years?\" and Michele says, \"No, I've just been lonely with no one to talk to.\" It's such a dark joke, and it encapsulates so much about marriage.\n\nMira Sorvino: Lisa was so brilliant as an old lady. She was a natural. I looked a lot like my elderly Italian relatives. It was kind of scary.\n\nLisa Kudrow: It was assumed that Michele would've had some plastic surgery in her life, so that's how her face would age after that. I thought, \"Well, if this is how I'll look, that's not so bad. Maybe I'll have more dignified hair.\" We also put colored contact lenses in because your eyes get lighter as you get older. Who knew?\n\nAlan Cumming: I'm probably the only person in Hollywood who loved having a turkey neck.\n\nVincent Ventresca: I was like, \"That's what I'm going to look like? Yikes.\" And then at the reunion, my [prosthetic] stomach was insane. When I had it on, I didn't even have to worry about how to play the scene. You just felt it.\n\nJulia Campbell: I loved wearing the prosthetic belly—that was wild. It really did look like a pregnancy belly. And when the helicopter went up in the air and blew my dress up to show my granny panties. I still have those lavender Hanes!\n\nAlan Cumming: I remember the day after that helicopter scene, a bunch of the cast went to IHOP for breakfast. I remember discovering IHOP and thinking, \"What is international about this? It seems pretty American to me.\" Everything about that movie was a crash course: I had never been to a high school reunion, I didn't know how to pronounce \"Tucson\" or what mono was. Back braces were a new concept to me as well.\n\nRobin Schiff: The dream sequence was special. When we initially pitched the movie, it was the original ending, but executives thought that it didn't seem real enough. It's very unconventional to have a 20-minute dream sequence that doesn't advance the plot.\n\nAlan Cumming: The makeup in the dream sequence was funny because I got to choose: I had Alec Baldwin's lips, Brad Pitt's chin, somebody else's forehead. I made this amalgam of handsome Hollywood hunks on my face and attached it to my body.\n\nLisa Kudrow: I don't know how long [Alan] spent with the prosthetic chin. I was like, \"Why'd you have to have that?\" [Laughs]\n\nDavid Mirkin: I wanted the dream sequence to start out normal and then just get odder and odder, so I had the idea of Lisa getting hit by the limo. I'm a fan of violent physical comedy, and Lisa's the perfect person to go flying through the air.\n\nLisa Kudrow: I thought it would be really funny if, after it happened, she says, \"Oh, come on.\" She had to just acknowledge how ridiculous it was.\n\nCamryn Manheim: I love when I fly over the car. I remember them attaching me to some big contraption. I was strapped in and suspended over the car in a crane.\n\nElaine Hendrix: I loved doing the reunion scene, when I got to give the A-Group their comeuppance. I wanted to be even more in-your-face about it, but David wanted to reel it back a little.\n\nJacob Vargas: I remember Mira Sorvino had just gotten nominated for an Academy Award. I was like, \"Hey, congratulations on your Oscar nomination. Let's have fake sex!\"\n\nLisa Kudrow: The wrap gift was a Post-it dispenser. I still have it, and it's still dispensing Post-its.\n\nAlamy\n\nDavid Mirkin: There's so much to relate to in the casual cruelness of a true high school experience. We tried not to pull any punches.\n\nRobin Schiff: The movie shows how it's okay to be different. There's a message that you don't have to be anything but who you are to impress people.\n\nMira Sorvino: There's definitely a relatability factor. People can see themselves as Romy and Michele. They're lovable losers who think they're smart but they're really stupid, in a harmless way. Line by line, the movie is so funny.\n\nLisa Kudrow: It's about people who were outsiders and had each other for support.\n\nAlan Cumming: I think the personalities are universal: There's always the mean girls, the jock, the geeky one, and the girls who are trying to get into the cool group. No matter where you come from, there's always that hierarchy in school. Everybody feels like they're not cool enough. But you realize that the cool people aren't really cool—they're just as weird as you are. If you're competent and have fun, then that's cool. It's a very affirming film for geeks and freaks and people who don't fit in.\n\nJulia Campbell: It's a movie about independence and flying your freak flag and being okay with it, especially when you have your best friend with you. That's really all you need during those awkward years.\n\nElaine Hendrix: I think people relate to the experience: The majority of people identify with this movie's journey—the hell that most people experience in high school, then going to a reunion and seeing how some people are still stuck in that time and others have moved on. People want to innately cheer for the underdogs, and Romy and Michele were the underdogs. And they get validated at the end.\n\nCamryn Manheim: Romy and Michele is the gift that keeps on giving. I've done great work with Anthony Hopkins, Broadway shows, but people still run up to me on the street and say, \"Please don't tell me to f*ck off, because it really hurts my feelings.\"\n\nAlan Cumming: You have no idea how many people say to me, \"I'm so glad you had your notebook.\"\n\nJulia Campbell: I definitely get, \"We're pregnant, you half-wit\" a lot.\n\nVincent Ventresca: I think David Mirkin had a vision. His particular brand of humor is so unique. [The movie] was so ridiculous, then all of a sudden, a Cyndi Lauper song would come on and you were crying. And you knew both of those things did live right next to each other when you were in high school. It felt honest, it felt true, and completely relatable.\n\nCamryn Manheim: We all have those stories. We all know what it feels like to be left out, or be the person that's oppressing other people to make ourselves feel better. We all have stuff happening at home that trickles into our lives. It was told in this fantastical way that was so accessible—we could all see each other in there.\n\nJacob Vargas: I think it touched on everybody's insecure nerd in a sense. In high school, we're all trying to find our way. You feel like there's another crowd that's better than you, or you're trying to impress somebody, but then you realize that everybody's in the same boat. It's still as relevant now as it was 20 years ago.\n\nAlamy; Getty\n\nRobin Schiff: If I could think of something as good as the original, then I would be open to it. We're actually doing a musical adaptation at The 5th Avenue Theatre in Seattle this summer.\n\nDavid Mirkin: I would never say no to working with those women and that cast, but it would have to be material that we all agreed was really good. You don't want to ruin what was there.\n\nMona May: It would be fun to think about what designers they would be into now.\n\nMira Sorvino: I think there's definitely an appetite for it. The fandom seems to be growing in cult popularity rather than diminishing as the years go on, which is a phenomenon to me.\n\nLisa Kudrow: Robin and I were talking about a sequel: Romy and Michele Get Divorced. It would probably be them having a split as well as their marriages. On the other hand, I don't want Sandy and Michele to get divorced.\n\nRobin Schiff: Hilariously, I remember it as Romy and Michele Get Married, and Lisa remembers it as Romy and Michele Get Divorced. The idea was that Romy and Michele had their store, and this woman with a store nearby was getting married before them, so they tell her that they're getting married, and they start planning a double wedding with no fiancés. Sandy was out of the picture. In my mind, Sandy and Michele were ever going to end up together. I don't think they have that much in common. Can you imagine them having a conversation?\n\nAlan Cumming: I'm totally into [a sequel]. There was an alternate ending where Michele and I were married and Romy had come to live with us.\n\nJulia Campbell: If everybody else was down, of course I would be. It was such a well-cast film.\n\nElaine Hendrix: We've all individually talked about it with each other. I don't know if it ever would or could happen, but I'd be down.\n\nJacob Vargas: I would love to revisit Ramon again.\n\nVincent Ventresca: I'm still trying to figure out why we never made another one. How perfect would that be?\n\nCamryn Manheim: I'm surprised they haven't done another film. They should do the 25-year reunion. Contact me directly and I'll organize it. I'll make the name tags!", "images": ["https://www.instyle.com/thmb/V8MZw0frSBzIw_UBlJyC3tCMrwI=/75x75/filters:no_upscale():max_bytes(150000):strip_icc()/Claire-Stern-Claire-Stern-2000-8041377a4c604a8295d384f148252072.jpg", "https://www.instyle.com/thmb/239t52547766bv6p15CX7Z7l94A=/2250x0/filters:no_upscale():max_bytes(150000):strip_icc()/042417-romy-michelle-anniversary-embed-10-3b6d6ccbc5c4447a8f588f57dfda5ae2.jpg", "https://www.instyle.com/thmb/ms7yMeQgrRsTxjVyALNXrLGd-iY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(708x0:710x2)/instyle-melanie-lynskey-social-abc9fa78981b40e0b814ce58eceb9503.jpg", "https://www.instyle.com/thmb/xrkAKvoGrtftG23K1XO-MXHEYjM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/12122_IS_JennaOrtega_Hero_3x2-2000-41631896df534ae6a48b17fa04693d58.jpg", "https://www.instyle.com/thmb/DVeLk97EHc0cB112Pu8S15RgEqo=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1799x0:1801x2)/DOREVENGE_UNIT_029_12282r-a79392cd5e344004bf50bf4e837ee650.JPG", "https://www.instyle.com/thmb/HihYMEygjeNAd6IeJfyo4njjD5s=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(959x531:961x533)/zoe-chao-instyle-03-2000-1596a86ea4d846a582385d00633c5c0a.jpg", "https://www.instyle.com/thmb/tF5t5xYD6q6Sih8uuTD9fCjoC8A=/2250x0/filters:no_upscale():max_bytes(150000):strip_icc()/042417-romy-michelle-anniversary-embed-1-534304ae1282460f8865b713ecb647ca.jpg", "https://www.instyle.com/thmb/yrlcz_CjiQSIpd5A-y2KCzm1SWk=/2250x0/filters:no_upscale():max_bytes(150000):strip_icc()/042417-romy-michelle-anniversary-embed-4-5b243e6d5b06470186e61d765966dfe7.jpg", "https://www.instyle.com/thmb/5FC6oBjx032mlB6xUpESHwIGLQg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/120619-julia-fox-small-talk-01-2000-55ab6387d9b249608dc353de013018fa.jpg", "https://www.instyle.com/thmb/6ZdB32n0uoA6bQRPonQFPdROvHw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1199x0:1201x2)/Camila_1-8deb7569a86742edb836ba748008807e.jpg", "https://www.instyle.com/thmb/OTKFDAMkg_11IFIpLRdGcJ9_lHg=/2250x0/filters:no_upscale():max_bytes(150000):strip_icc()/042417-romy-michelle-anniversary-embed-7-revise-d2d73cd54173453ab5a55a5f6315c1c3.jpg", "https://www.instyle.com/thmb/KmKMTLjXsJ3KIy4tfD7oSO9bSss=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(666x0:668x2)/032620-christine-ko-03-2000-44fa359e583f453a8c47b676d52ee86c.jpg", "https://www.instyle.com/thmb/ANrtNPC6P-tl4cLGKQSeiMNlBMg=/1667x834/filters:fill(auto,1)/romy-michelle-1b2d3c77e68448f2b6ab4836dd7d94b0.jpg", "https://www.instyle.com/thmb/dWrjDCmUMcDOo1ce7sdxNh0zFvI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(734x299:736x301)/InStyle-March-Gigi-Hadid-Lead-2-2000-a0d6c219e54b4f80b4c8c2109e674a70.jpg", "https://www.instyle.com/thmb/Q2LAKyeswqugBFzVsWiaZKVFbIg=/2250x0/filters:no_upscale():max_bytes(150000):strip_icc()/042417-romy-michelle-anniversary-embed-6-ced00da7ccc24e0c8193e7e96319fb00.jpg", "https://www.instyle.com/thmb/ayYZmuNtxlSqvV4JpQS7Ke6VRdE=/2250x0/filters:no_upscale():max_bytes(150000):strip_icc()/042417-romy-michelle-anniversary-embed-3-a8516a7442b94636b0176d7ce6269bc2.jpg", "https://www.instyle.com/thmb/9dI-JRkaOQhvZCGd23I3DuyFWWY=/2250x0/filters:no_upscale():max_bytes(150000):strip_icc()/042417-romy-michelle-anniversary-embed-5-revise-886f42dd59cd47f0b4d2e38911c80a65.jpg", "https://www.instyle.com/thmb/dp8KdWMfEuVfdk_c2zCP0ru73ro=/2250x0/filters:no_upscale():max_bytes(150000):strip_icc():gifv()/042417-romy-michelle-anniversary-lead-2000-ea28e499d16d4c33b3c5cc06ffd2590f.jpg", "https://www.instyle.com/thmb/KYsR6dIoTOABazCVjgTKRsexshs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(533x979:535x981)/Lola_HighRes_second-22-2000-8b9fea6788d749f79ce3ee3d81016dee.jpg", "https://www.instyle.com/thmb/WtJMIoZgavQNuVXwYTO0hWBl4Z8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(831x278:833x280)/021221-lana-condor-social-9282a390909941dc8531b34c9fa12dcf.jpg", "https://www.instyle.com/thmb/s1PWHb2fvykmq-wVxrn3ykjcHaU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(832x0:834x2)/091819-darcy-carden-03_0-2000-75f77837f97a4c59bf31eed210694393.jpg", "https://www.instyle.com/thmb/lw8QJbvDsKuNuZeqzi-edKfd3tI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(679x508:681x510)/InStyle-September-Kristen-Wiig-Lead-1-2000-7f9ebb1079a8409bb7deecb8ade58e99.jpg", "https://www.instyle.com/thmb/B7tSFSn95RpOvyY3iTYddiLbgjw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(799x0:801x2)/111919-alexa-demie-small-talk-02_0-2000-164791f240a44682a17eabe996136802.jpg", "https://www.instyle.com/thmb/Esvq7H3CKtecR636RQdD5Viel_Q=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(635x1019:637x1021)/072122-dove-cameron-01-2000-786a71cb9bcf475ebcd1f91fd9ed83c6.jpg", "https://www.instyle.com/thmb/-E2IAzyksTN6B9tF_77yTyHRHJU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(939x425:941x427)/121621-mackenzie-davis-lead-2000-5ca2d57d81b54a59bca6829cd12b3cc1.jpg", "https://www.instyle.com/thmb/iigilNwf8_FdZIURd2mWlwEuHck=/2250x0/filters:no_upscale():max_bytes(150000):strip_icc()/042417-romy-michelle-anniversary-embed-9-57a9c162b9f3485f8c716ae8fe84d54a.jpg", "https://www.instyle.com/thmb/gzsonnr1m2LW2qkb5PgRZkcSX2k=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/080422-amber-midthunder-social-2000-2c892012f34e4385b030a5694ee5f535.jpg"], "top_img": "https://www.instyle.com/thmb/ANrtNPC6P-tl4cLGKQSeiMNlBMg=/1667x834/filters:fill(auto,1)/romy-michelle-1b2d3c77e68448f2b6ab4836dd7d94b0.jpg", "keywords": [], "authors": ["Claire Stern", "Instyle'S Editorial Guidelines"], "canonical_link": "https://www.instyle.com/reviews-coverage/romy-and-michele-high-school-reunion-20th-anniversary-oral-history", "title": "Time After Time: A Look Back at the Making of 'Romy and Michele's High School Reunion'", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "From the dresses to the dance routine, the cast of Romy and Michele's High School Reunion reminisce about the cult classic film.", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "INSTYLE", "sailthru.author": "Claire Stern", "article": {"section": "instyle", "author": "https://www.facebook.com/InStyle"}, "fb": {"app_id": 1846286175658788, "pages": 18938064984}, "og": {"type": "article", "site_name": "InStyle", "url": "https://www.instyle.com/reviews-coverage/romy-and-michele-high-school-reunion-20th-anniversary-oral-history", "title": "Time After Time: A Look Back at the Making of Romy and Michele's High School Reunion", "description": "From the dresses to the dance routine, the cast of Romy and Michele's High School Reunion reminisce about the cult classic film.", "image": "https://www.instyle.com/thmb/ANrtNPC6P-tl4cLGKQSeiMNlBMg=/1667x834/filters:fill(auto,1)/romy-michelle-1b2d3c77e68448f2b6ab4836dd7d94b0.jpg"}, "twitter": {"card": "summary_large_image", "site": "@InStyle", "title": "Time After Time: A Look Back at the Making of Romy and Michele's High School Reunion", "description": "From the dresses to the dance routine, the cast of Romy and Michele's High School Reunion reminisce about the cult classic film.", "image": "https://www.instyle.com/thmb/ANrtNPC6P-tl4cLGKQSeiMNlBMg=/1667x834/filters:fill(auto,1)/romy-michelle-1b2d3c77e68448f2b6ab4836dd7d94b0.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.31.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.31.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.31.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.31.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.31.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://www.instyle.com", "summary": ""}