{"url": "https://en.wikipedia.org/wiki/Robert_Wagner", "text": "American actor\n\nFor other people named Robert Wagner, see Robert Wagner (disambiguation)\n\nRobert John Wagner Jr. (born February 10, 1930) is an American actor of stage, screen, and television. He is known for starring in the television shows It Takes a Thief (1968–1970), Switch (1975–1978), and Hart to Hart (1979–1984). He later had a recurring role as Teddy Leopold in the TV sitcom Two and a Half Men (2007–2008) and made twelve guest appearances (2010–2019) as Anthony DiNozzo Sr. in the police procedural NCIS.\n\nIn films, Wagner is known for his role as Number 2 in the Austin Powers trilogy of films (1997, 1999, 2002), as well as for A Kiss Before Dying (1956), The Pink Panther (1963), Harper (1966), The Towering Inferno (1974), The Concorde ... Airport '79 (1979) and many more.\n\nEarly life [ edit ]\n\nWagner was born on February 10, 1930, in Detroit, Michigan. He is the son of Hazel Alvera (née Boe), a telephone operator, and Robert John Wagner, a travelling salesman who worked for the Ford Motor Company. Robert Wagner's paternal grandparents were from Germany.[1]\n\nCareer [ edit ]\n\n20th Century Fox and Columbia Pictures [ edit ]\n\nWagner became interested in acting, and after an unsuccessful screen test directed by Fred Zinnemann for his film Teresa (1951), was represented by Albert R. Broccoli.[2] He made his uncredited film debut in The Happy Years (1950); was signed by agent Henry Willson and put under contract with 20th Century Fox.[3]\n\n\"I started off as an ingenue\", recalled Wagner. \"I was 19 years old. I was the boy next door. But you always felt you could work your way up, that you could have a better part in the next picture. [Head of Fox] Darryl Zanuck was always placing me in different positions.\"[3]\n\nWagner's first film for Fox was Halls of Montezuma (1951) a World War II film. Wagner had a supporting role, with Richard Widmark as the star. The studio then had him perform a similar function in another war movie, The Frogmen (1951), again with Widmark; the cast also included another young male under contract to the studio, Jeffrey Hunter, with whom Wagner would often work. Let's Make It Legal (1951) was a comedy where Wagner again supported an older star, in this case Claudette Colbert.[4]\n\nWagner first gained significant attention with a small but showy part as a shell-shocked soldier in With a Song in My Heart (1952).[4]\n\n\"You were part of 20th Century Fox\", he said. \"You felt proud of being part of the organization. When I wasn't working, I was on the road, going out and selling movies or dancing on the stage and meeting the public. They never let you rest.\"[3]\n\nFox started to give Wagner better roles. He was the romantic male lead in Stars and Stripes Forever (1952), a biopic about John Philip Sousa starring Clifton Webb. He supported James Cagney and Dan Dailey in John Ford's version of What Price Glory (1952) and supported Webb again in Titanic (1953). He was in a minor Western, The Silver Whip (1953) with Rory Calhoun.[4]\n\nLeading man [ edit ]\n\nFox gave Wagner his first starring role in Beneath the 12-Mile Reef (1953). Reviews were poor but the movie was only the third ever to be shot in CinemaScope and was a big hit.[5]\n\nAlso popular was a Western, Broken Lance (1954), where Wagner supported Spencer Tracy for director Edward Dmytryk, appearing as Tracy's son. Fox gave Wagner the lead in an expensive spectacular, Prince Valiant (1954). While popular, critical reception was poor and Wagner later joked his wig in the movie made him look like Jane Wyman. He was teamed with Jeffrey Hunter in a Western, White Feather (1955).[4]\n\nWagner was borrowed by Paramount for The Mountain (1956), directed by Dmytryk, where Wagner was cast as Spencer Tracy's brother, having played his son just two years earlier in the same director's Broken Lance. He received more critical acclaim for the lead in A Kiss Before Dying (1956), from the novel by Ira Levin; it was made for Crown Productions, a company of Darryl F. Zanuck's brother in law (the leads were all under contract to Fox) and released through United Artists.[citation needed]\n\nBack at Fox Wagner was in Between Heaven and Hell (1956), a war movie, and The True Story of Jesse James (1957), playing the leading role for director Nicholas Ray (Jeffrey Hunter was Frank). Both movies were box office disappointments and it seemed Wagner was unable to make the transition to top-level star. This appeared confirmed when he was the lead in Stopover Tokyo (1957). In 1959, Wagner disparaged the film:\n\nWhen I started at Fox in 1950 they were making sixty-five pictures a year. Now they're lucky if they make thirty. There was a chance to get some training in B pictures. Then TV struck. Everything went big and they started sticking me into Cinemascope spectacles. One day, smiling Joe Juvenile with no talent was doing a role intended for John Wayne. That was in a dog called Stopover Tokyo. I've really had to work to keep up.[6]\n\nWagner supported Robert Mitchum in a Korean War movie, The Hunters (1958), and appeared with a number of Fox contractees in a World War II drama, In Love and War (1958); the latter was a hit.[citation needed]\n\nAfter a cameo in Mardi Gras (1958), Wagner supported Bing Crosby and Debbie Reynolds in Say One for Me (1959).[citation needed]\n\nTrying to kick-start his career, Wagner appeared with his then-wife Natalie Wood (they married in 1957) in All the Fine Young Cannibals (1960), made for MGM. The film was a flop.[citation needed]\n\nIn January 1961, Wagner and Wood formed their own company, Rona Productions, named after the first two letters of both their first names. Rona signed a three-picture deal with Columbia pictures for Wagner's services, which was to start with Sail a Crooked Ship (1961) and The Interns. He also had a deal to make one more film at Fox, which was to be Solo, the story of a jazz drummer directed by Dick Powell, or The Comancheros with Gary Cooper.[7]\n\nWagner made Sail a Crooked Ship but his part in The Interns went to James MacArthur. Solo was never made, and The Comancheros was made instead with John Wayne and Stuart Whitman. Wagner did make The War Lover (1962) with Steve McQueen that was filmed in England.[8]\n\nEurope [ edit ]\n\nWagner's first marriage to Wood had broken up, and he relocated to Europe. He had a small role in The Longest Day (1962), produced by Daryl Zanuck for Fox. He had a larger part in The Condemned of Altona (1962), a commercial and critical disappointment despite being directed by Vittorio de Sica and co-starring Sophia Loren.[8]\n\nConsiderably more popular was The Pink Panther (1963), a massive hit, although Wagner's part was very much in support to those of David Niven, Capucine, Peter Sellers, and Claudia Cardinale. It was directed by Blake Edwards, who wanted Wagner for the lead in The Great Race (1965), but Jack L. Warner overruled him.[9]\n\nReturn to Hollywood and Universal Pictures [ edit ]\n\nHis return to America found him playing in the theatre for the first time with the lead role in Mister Roberts for one week at a holiday resort just outside Chicago.[10] The disciplines of the theatre were not his forte and Wagner was glad to be back in Hollywood to find a good supporting role in the modern-day private investigator hit, Harper (1966), starring Paul Newman.\n\nWagner signed with Universal Pictures in 1966, starring opposite future wife Jill St. John in the films How I Spent My Summer Vacation, a made-for-TV movie released in the United Kingdom as Deadly Roulette, and Banning (1967). He returned to Italy to make a caper film with Raquel Welch for MGM, The Biggest Bundle of Them All (1968), but it was not a success.[citation needed]\n\nTelevision star [ edit ]\n\nIn 1967, Lew Wasserman of Universal convinced Wagner to make his television series debut in It Takes a Thief (1968–1970) on ABC-TV. \"\"I was opposed to doing Thief\", Wagner said later. \"But Lew Wasserman said: 'I want you to be in TV Guide every week. This is your medium, you've got to try it, you'll be great.' Roland Kibbee wrote the part for me, and I would have missed all that if I hadn't listened to Lew.\"[11]\n\nWhile the success of The Pink Panther and Harper began Wagner's comeback, the successful two-and-a-half seasons of his first TV series completed it. In this series, he acted with Fred Astaire, who played his father. Wagner was a longtime friend of Astaire, having gone to school with Astaire's eldest son, Peter. Wagner's performance would earn him an Emmy nomination for Best TV Actor.[8]\n\nDuring the making of the series he made a film for Universal, the comedy Don't Just Stand There! (1968) with Mary Tyler Moore. It was not a success. More popular was Winning (1969), a racing car drama where Wagner supported Paul Newman and Joanne Woodward. He also guest-starred in The Name of the Game (1970).[citation needed]\n\nWagner's friend and agent Albert Broccoli suggested that he audition to play James Bond, but he decided it was not right for him.\n\nWagner appeared in the series pilot, City Beneath the Sea (1971), that was not picked up. The following year, he produced and cast himself opposite Bette Davis in the made-for-TV film Madame Sin, which was theatrically released overseas as a feature film.[12]\n\nHe was a regular in the BBC/Universal World War II prisoner-of-war drama Colditz (1972–1974) for much of its run. He reunited with McQueen, along with Paul Newman and Faye Dunaway, in the disaster film The Towering Inferno released in the same year. It was a massive hit, although Wagner's part was relatively small.[8]\n\nSwitch [ edit ]\n\nBy the mid-1970s, Wagner's television career was at its peak with the CBS-TV television series Switch (1975–1978, opposite Eddie Albert, Sharon Gless, and Charlie Callas) after re-signing a contract with Universal in 1974. Albert had been a childhood hero of Wagner, after he watched the movie Brother Rat along with a few others. The friendship started in the early 1960s, where he also co-starred in a couple of Albert's movies. After the end of the series, the two remained friends until Albert's death on May 26, 2005. Wagner spoke at his funeral, and gave a testimonial about his longtime friendship with him.[citation needed]\n\nIn partial payment for starring together in the Aaron Spelling and Leonard Goldberg production of the TV movie The Affair, Wagner and Natalie Wood were given a share in three TV series that the producers were developing for ABC.[13] Only one reached the screen, the very successful TV series Charlie's Angels, for which Wagner and Wood had a 50% share, though Wagner was to spend many years in court arguing with Spelling and Goldberg over what was defined as profit.[14]\n\nWagner and Wood acted with Laurence Olivier in Cat on a Hot Tin Roof (1976), as part of Olivier's television series Laurence Olivier Presents for the UK's Granada Television.[15]\n\nWagner had a small role in some all-star Universal films, Midway (1976) and The Concorde ... Airport '79 (1979).[16]\n\nHart to Hart [ edit ]\n\nWagner's third successful series was Hart to Hart, which co-starred Stefanie Powers and Lionel Stander and was broadcast on ABC-TV from 1979 to 1984. No one else was seriously considered for the role. George Hamilton had a high profile at the time and was suggested, but producer Aaron Spelling said that if he was cast \"the audience will resent him as Hart for being that rich. But no one will begrudge RJ [Wagner] a nickel.\"[17]\n\nDuring the series run, Wagner reprised his old Pink Panther role in Curse of the Pink Panther (1983).[18] He also had a supporting role in I Am the Cheese (1983).[19]\n\nHe played an insurance investigator in the short-lived TV series Lime Street (1985).[8]\n\nIn 1985, he reflected, \"Bad-guy roles work if they're really good parts, but they don't come along very often. I think that what I've been doing has worked for me. Sure I'd like to do a Clint Eastwood, grizzled, down-and-out guy, but there aren't many scripts like that... What has been projected for me is an international quality that can take me anywhere and get me into all kind of involvements; to do otherwise would mean a character role.\"[20]\n\nLater career [ edit ]\n\nNCIS and older work on MBN Newsvideoweb in 2013 Wagner interviewed aboutand older work on MBN Newsvideoweb in 2013\n\nWagner appeared in a TV movie with Audrey Hepburn, Love Among Thieves (1987) and in a miniseries with Jaclyn Smith, Windmills of the Gods (1988). He and St. John worked with Pierce Brosnan in the miniseries remake of Around the World in 80 Days (1989). For Tom Mankiewicz he played a supporting part in Delirious (1991). More widely seen was Dragon: The Bruce Lee Story (1993), where Wagner played a producer.[21] Wagner played Love Letters on stage with Stefanie Powers.[22] They also reprised their Hart characters in a series of TV movies.[23]\n\nWagner's film career received a boost after his role in the Austin Powers series of spy spoofs starring Mike Myers. Wagner played Dr. Evil's henchman Number 2 in all three films: Austin Powers: International Man of Mystery (1997), Austin Powers: The Spy Who Shagged Me (1999) and Austin Powers in Goldmember (2002). He also had small roles in Wild Things (1998), Crazy in Alabama (1999), Play It to the Bone (2000), Becoming Dick (2001) and Sol Goode (2001).\n\nWagner became the host of Fox Movie Channel's Hour of Stars, featuring original television episodes of The 20th Century-Fox Hour (1955), a series which Wagner had appeared on in his early days with the studio. In 2005, Wagner became the television spokesman for the Senior Lending Network, a reverse mortgage lender and in 2010 he began serving as a spokesman for the Guardian First Funding Group, also a reverse mortgage lender. As of June 2011, Guardian First Funding was acquired by Urban Financial Group, who continue to use Mr. Wagner as their spokesperson.[24][25]\n\nIn 2007, Wagner had a role in the BBC/AMC series Hustle. In season four's premiere, Wagner played a crooked Texan being taken for half a million dollars. As Wagner is considered \"a suave icon of American caper television, including It Takes a Thief and Hart to Hart\", Robert Glenister (Hustle's fixer, Ash Morgan) commented that \"to have one of the icons of that period involved is a great bonus for all of us\".[26] Wagner also played the pivotal role of President James Garfield in the comedy/horror film Netherbeast Incorporated (2007). The role was written with Wagner in mind. He had a recurring role of a rich suitor to the main characters' mother on the sitcom Two and a Half Men. His final appearances on the show were in May 2008.\n\nWagner has guest-starred in 13 episodes of NCIS[27] as Anthony DiNozzo Sr., the father of Anthony DiNozzo Jr., played by Michael Weatherly. Weatherly had previously appeared as Wagner in the TV movie The Mystery of Natalie Wood.[28]\n\nWagner was set to star as Charlie in the 2011 remake of Charlie's Angels, but had to exit the project due to scheduling conflicts.[29]\n\nDespite his apparent distaste working with Raquel Welch on The Biggest Bundle of Them All,[30] they reunited 50 years later on the 2017 Canadian series Date My Dad.[31]\n\nPersonal life [ edit ]\n\nMarriages and relationships [ edit ]\n\nWagner with Natalie Wood in 1960\n\nIn his memoirs, Wagner claimed to have had affairs with Yvonne De Carlo, Joan Crawford, Elizabeth Taylor, Anita Ekberg, Shirley Anne Field, Lori Nelson, and Joan Collins.[32] He also claimed a four-year romantic relationship with Barbara Stanwyck after they acted together in the movie Titanic (1953).[33] According to Wagner, because of their age differences—he was 22, she was 45—they kept the affair secret to avoid damaging their careers.[34] Wagner is known to also have had affairs with men.[35]\n\nIn 1956, when he was 26 years old, Wagner became involved with 18-year-old actress Natalie Wood. They were married on December 28, 1957, in Scottsdale, Arizona. In the summer of 1961, on a break from filming Splendor in the Grass (1961), Natalie surprised her husband when she caught him having an extramarital affair with a male staff member in the couple's home.[36] They would announce their separation on June 20, 1961, and divorced on April 27, 1962.[37]\n\nWagner and daughter Katie interviewed on MBN Newsvideoweb in 2013\n\nWhile working on location in Europe, Wagner reconnected with an old friend, actress Marion Marshall. After a two-year courtship, Wagner, Marshall and her two sons from her marriage to Stanley Donen moved back to America. Wagner and Marshall married on July 21, 1963 at the Bronx Courthouse. They had a daughter, Katie (born 1964). They separated in June 1970 and divorced on October 14, 1971.[38]\n\nWagner was engaged to Tina Sinatra from June 1970 until January 1972.[39] Immediately afterwards, Wagner rekindled his romance with Wood. They remarried on July 16 aboard the Ramblin' Rose, anchored off Paradise Cove in Malibu.[40] They had a daughter, Courtney (born 1974). Following Wood's death in late 1981, Wagner became the legal guardian of her daughter by producer Richard Gregson, Natasha, then 11. He also gradually cut ties with his former sister-in-law, Lana Wood.[41] Lana has claimed publicly that the reason behind the couple's first divorce was that Natalie caught Wagner in the arms of another man.[42]\n\nOn Valentine's Day[43] 1982, Wagner began dating actress Jill St. John, whom he had known since the late 1950s.[44] Wagner's memoir has an early photo of them together, taken in 1959 when they were contract players at Fox. After eight years together, they married on May 26, 1990.[45] The marriage is the fourth for both Wagner and St. John and it has lasted longer than all of their six previous marriages combined. The couple co-starred in six films between 1967 and 2014 – most of them low-budget – and together in the first episode of Hart to Hart – and also appeared onstage in a 1996 production of Love Letters.\n\nWagner became a first-time grandfather in 2006 when Katie Wagner, his daughter with Marshall, gave birth to her son Riley John Wagner-Lewis.[46]\n\nIn August 2007, Wagner and St. John sold the Brentwood ranchette they'd lived in since 1983 for a reported $14 million.[47] The couple now reside in Aspen, Colorado, where they built a vacation home in 1995.[48] They retain a condo in Los Angeles.\n\nDeath of Natalie Wood (1938-1981) [ edit ]\n\nOn November 29, 1981, Wood died under mysterious circumstances near, within a mile from, or on the yacht Splendour while it was moored near Catalina Island. Wood had been on board the Splendour along with Wagner, Christopher Walken, who was co-starring with her in the motion picture Brainstorm (1983) and Dennis Davern, the Splendour's captain.[41] It has never been explained why Walken's wife Georgianne was not present on the trip.[49] According to Wagner, Wood was not there when he went to bed, and, according to his spokesman, he thought Wood had taken off on a small inflatable boat by herself, as she had done before.[50] Wood's body was found about a mile away from the yacht, while the inflatable boat was found beached nearby.[50] The autopsy report revealed that Wood had 39 fresh bruises on her body, including an abrasion on her left cheek.[51]\n\nLater, in his memoir Pieces of My Heart, Wagner acknowledged that he had an argument with Wood before she disappeared but had calmed down and gone to bed.[50][51] The autopsy found that Wood's blood alcohol content was 0.14% and there were traces of two types of medication in her bloodstream: a motion-sickness pill and a painkiller, both of which increase the effects of alcohol. Two witnesses, who had been on another boat nearby, stated they had heard a woman scream for help during the night.[53] Following his investigation, Los Angeles County coroner Thomas Noguchi ruled her death an accident by drowning and hypothermia.\n\nWagner, Walken, and Davern initially all told detectives that Wood had left in a dinghy to go ashore;[55] the case was reopened in November 2011, however, after Davern publicly stated that he had lied to police during the initial investigation and that Wood and Wagner had had an argument that evening. He alleged that Wood had been flirting with Walken, that Wagner was jealous and enraged, and that following Wood's disappearance, Wagner had prevented Davern from turning on the search lights and notifying authorities. According to Davern, Wagner was responsible for Wood's death and he believed that Wagner had intentionally kept the investigation into Wood's death \"low-profile\".[51][56][57][58]\n\nIn 2012, Los Angeles County Chief Coroner Lakshmanan Sathyavagiswaran amended Wood's death certificate and changed the cause of her death from accidental drowning to \"drowning and other undetermined factors.”[59] The amended document included a statement that the circumstances of how Wood ended up in the water are \"not clearly established.\" On January 14, 2013, the Los Angeles County coroner's office issued a ten-page addendum to Wood's autopsy report. It stated that she may have sustained some of the bruises on her body before she went into the water and drowned.[60]\n\nOn February 1, 2018, the Los Angeles County Sheriff's Department named Wagner a \"person of interest\" in the investigation into Wood's death.[55] Robert Wagner has denied any involvement in Wood’s death.[61][55][62]\n\nIn 2022, Wagner was cleared as a suspect, with a LAPD lieutenant being quoted as saying that “All leads in the Natalie Wood case have been exhausted, and the case remains an open, unsolved case.\"[63]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nBooks [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Jean_peters_broken_lance5.jpg/220px-Jean_peters_broken_lance5.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Robert_Wagner_in_Beneath_the_12-Mile_Reef.jpg/220px-Robert_Wagner_in_Beneath_the_12-Mile_Reef.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Wood_-_Wagner_-_1960.jpg/220px-Wood_-_Wagner_-_1960.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Robert_Wagner_1967.JPG/220px-Robert_Wagner_1967.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Robert_and_Katie_Wagner_on_MBN_Newsvideoweb.jpg/220px-Robert_and_Katie_Wagner_on_MBN_Newsvideoweb.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Robert_Wagner_on_MBN_Newsvideoweb.jpg/220px-Robert_Wagner_on_MBN_Newsvideoweb.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/2/2e/Robert_Wagner_1967.JPG"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Robert_Wagner_1967.JPG", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Robert_Wagner", "title": "Robert Wagner", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Robert_Wagner_1967.JPG/640px-Robert_Wagner_1967.JPG", "width": 640, "height": 853}, "title": "Robert Wagner - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}