{"url": "https://www.nbcdfw.com/news/national-international/Hugh-Hefner-Holly-Madison-Relationships--448535373.html", "text": "Of the many women to come in and out of Hugh Hefner's life, Holly Madison is one of the most famous.\n\nThe late magazine mogul's girlfriend for seven years, Madison was a prominent fixture in Hefner's life. As a 20-year-old college student and aspiring actress living in Los Angeles, Madison frequently visited the mansion. She moved into the house in 2001.\n\nThe Oregon native, who was a fan of Playboy, became Hefner's lead girlfriend, and the two appeared to fall in love.\n\nOver the course of their seven years together, their nontraditional relationship was chronicled on E!'s series, \"The Girls Next Door,\" with Madison the ever-doting and loyal wife figure alongside co-stars and fellow girlfriends Kendra Wilkinson and Bridget Marquardt.\n\nMost Important Women in Hugh Hefner's Life\n\nWhile the magnate expected to spend the rest of his life with her, a point of contention came up between the two when Madison expressed her desire to marry Hefner and start a family. Ultimately, Hefner's refusal to marry for the third time was considered the breaking point of their relationship in 2008.\n\n\"Holly wanted very much to get married and have children, and that wasn't in the cards for us,\" Hefner explained in a video for Playboy at the time. \"I made a noble effort on the children part of it. I was not prepared at this point to marry again.\"\n\nJenny McCarthy, Paris Hilton and More Playboy Models React to Hugh Hefner's Death\n\nHowever, he eventually did. Following his breakup with Madison, he began dating twins Kristina and Karissa Shannon and, later, additionally Crystal Harris. In December 2010, he popped the question to Harris.\n\n\"I'm very surprised,\" Madison told E! News at the time of the engagement. \"I have a lot of different feelings on it. I don't just feel one way. I kind of didn't want to put a generic statement out there like 'Congratulations!' because I felt everyone would see through that.\"\n\nThe eternal bachelor didn't have a smooth trip down the aisle. While his Playboy Playmate bride unexpectedly broke off their engagement five days before their vows, the two ultimately tied the knot in December 2012.\n\nDetermination, $8,000 and an Idea: The Story of How Hugh Hefner Started Playboy\n\nMadison had her own happily-ever-after when she said \"I do\" to longtime beau Pasquale Rotella a year later. However, two years into her married life as a mother and four years without any contact with Hefner, the former Playboy Mansion resident shed new light on her former life in her memoir, \"Down the Rabbit Hole.\" In the no-holds-barred book, the former Playboy cover girl and Hefner's one-time leading lady shared her account of her time at the famous property.\n\nIn her book, Madison recalled her first night with Hef in formerly unheard vivid detail.\n\nHugh Hefner's Movie and TV Cameos\n\nMadison claims in her book that Hefner offered her a Quaalude, told her that orgy-esque activity would take place twice a week, said he disapproved of her short haircut and called her \"old, hard and cheap\" when she wore red lipstick. According to Madison, the women at the mansion were also expected to abide by a curfew, and Hefner fostered competition among the women.\n\n\"I tricked myself into thinking I had feelings for Hef,\" Madison wrote in the book. \"He had this gentlemanly veneer, he was intelligent, and I loved watching old movies with him. I focused on the positive things, not the negative.\"\n\nHowever, after suffering depression, suicidal thoughts and—according to Madison—Hefner's accusations of infidelity and attempts to bribe her with his will, the two broke up.\n\nWatch Hugh Hefner Reflect on Playboy's First Edition With Cover Star Marilyn Monroe in 2008 E! News Interview\n\nWith Kendra Wilkinson-Baskett at his defense, Hefner responded to his ex's allegations.\n\n\"Over the course of my life I've had more than my fair share of romantic relationships with wonderful women. Many moved on to live happy, healthy and productive lives, and I'm pleased to say remain dear friends today. Sadly, there are a few who have chosen to rewrite history in an attempt to stay in the spotlight,\" he told E! News in a statement. \"I guess, as the old saying goes: You can't win 'em all!\"\n\nWhile the two had their differing accounts of how their relationship played out, Madison wanted the public to know that her life has only gotten better.\n\n\"For so many years, I just wanted to move forward with positivity, only say nice things. I wanted to stand on my own two feet, start from scratch, just be me, not talk about Hef,\" she told E!'s Ken Baker. \"But, I would get so many people coming up to me saying, 'Don't you miss the mansion?' or 'I'm sorry Hef didn't marry you.'\"\n\nMadison said people seemed to feel they knew her intimately because of her stint as a reality show star, but they only saw one side. She wanted people to know that \"the best part of my life has been the seven years since I've left the mansion.\"\n\nHefner died this week, on Sept. 27, 2017. He was 91.", "images": ["https://media.nbcdfw.com/2019/09/DFW_On_Light@3x.png?fit=411%2C120&quality=85&strip=all", "https://media.nbcdfw.com/2021/07/Generic-Fort-Worth-Police-Cruiser.jpg?quality=85&strip=all&resize=100%2C56", "https://media.nbcdfw.com/2019/09/DFW_On_Dark@3x-3.png?fit=411%2C120&quality=85&strip=all&w=137&h=40", "https://media.nbcdfw.com/2019/09/NBC@3x-4.png?fit=5761%2C3240&quality=85&strip=all", "https://media.nbcdfw.com/2022/09/107117290-1663863240552-Untitled-8.jpg?quality=85&strip=all&resize=100%2C56", "https://media.nbcdfw.com/2019/09/generic-police-lights1.jpg?quality=85&strip=all&resize=100%2C56", "https://media.nbcdfw.com/2022/10/AP22281414206795.jpg?quality=85&strip=all", "https://media.nbcdfw.com/2022/10/AP22281349654135.jpg?quality=85&strip=all", "https://media.nbcdfw.com/2022/10/Allen-ISD-Mapping.png?resize=100%2C56&quality=85&strip=all", "https://sb.scorecardresearch.com/p?c1=2&c2=6035083&cv=2.0&cj=1", "https://media.nbcdfw.com/2019/09/DFW-1.png?fit=2060%2C847&quality=85&strip=all&w=400&h=44&crop=1", "https://media.nbcdfw.com/2022/10/web-221008-kevin-durant-texas.jpg?quality=85&strip=all&resize=100%2C56"], "top_img": "https://media.nbcdfw.com/2019/09/NBC@3x-4.png?fit=5761%2C3240&quality=85&strip=all", "keywords": [], "authors": ["Samantha Schnurr"], "canonical_link": "http://www.eonline.com/news/883621/revisiting-hugh-hefner-and-holly-madison-s-complicated-relationship", "title": "Revisiting Hugh Hefner and Holly Madison's Complicated Relationship", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "max-image-preview:large", "generator": "WordPress 5.8.5", "og": {"site_name": "NBC 5 Dallas-Fort Worth", "type": "article", "description": "Of the many women to come in and out of Hugh Hefner’s life, Holly Madison is one of the most famous. The late magazine mogul’s girlfriend for seven years–a majority of them as the “#1 girlfriend”–Madison was a prominent fixture in Hefner’s life for nearly a decade. Having frequently visited the mansion while a 20-year-old college student in Los Angeles, the aspiring actress decided to move into the house a year later in 2001. The Oregon native, who was familiar with Playboy and had been a fan, soon became Hefner’s lead girlfriend and the two appeared to fall in love. Over the course of their seven years together, their untraditional relationship was chronicled on E!’s series, The Girls Next Door, with Madison the ever doting and loyal wife figure alongside co-stars and fellow girlfriends Kendra Wilkinson and Bridget Marquardt.", "title": "Revisiting Hugh Hefner and Holly Madison's Complicated Relationship", "url": "https://www.nbcdfw.com/news/national-international/hugh-hefner-holly-madison-relationships/2029583/", "image": "https://media.nbcdfw.com/2019/09/NBC@3x-4.png?fit=5761%2C3240&quality=85&strip=all"}, "google-site-verification": "TulxZlVUPoj7DKPRWGCGsen6t4RRfLKo9TwVr3Z-6x0", "fb": {"app_id": 79562228021}, "twitter": {"card": "summary_large_image", "site": "@nbcdfw", "creator": "@nbcdfw", "description": "Of the many women to come in and out of Hugh Hefner’s life, Holly Madison is one of the most famous. The late magazine mogul’s girlfriend for seven years–a majority of them as the “#1 girlfriend”–Madison was a prominent fixture in Hefner’s life for nearly a decade. Having frequently visited the mansion while a 20-year-old college student in Los Angeles, the aspiring actress decided to move into the house a year later in 2001. The Oregon native, who was familiar with Playboy and had been a fan, soon became Hefner’s lead girlfriend and the two appeared to fall in love. Over the course of their seven years together, their untraditional relationship was chronicled on E!’s series, The Girls Next Door, with Madison the ever doting and loyal wife figure alongside co-stars and fellow girlfriends Kendra Wilkinson and Bridget Marquardt.", "title": "Revisiting Hugh Hefner and Holly Madison's Complicated Relationship", "url": "https://www.nbcdfw.com/news/national-international/hugh-hefner-holly-madison-relationships/2029583/", "image": "https://media.nbcdfw.com/2019/09/NBC@3x-4.png?fit=5761%2C3240&quality=85&strip=all"}, "article": {"opinion": "false", "content_tier": "free", "publisher": "http://www.facebook.com/nbcdfw"}, "description": "Of the many women to come in and out of Hugh Hefner’s life, Holly Madison is one of the most famous. The late magazine mogul’s girlfriend for seven...", "keywords": "aspiring actress, Crystal Harris, Hugh Hefner, Jenny McCarthy, Ken Baker, Los Angeles, Oregon, Paris Hilton, Samantha Schnurr", "sailthru.title": "Revisiting Hugh Hefner and Holly Madison's Complicated Relationship", "sailthru.description": "Of the many women to come in and out of Hugh Hefner’s life, Holly Madison is one of the most famous. The late magazine mogul’s girlfriend for seven...", "sailthru.tags": "aspiring actress, Crystal Harris, Hugh Hefner, Jenny McCarthy, Ken Baker, Los Angeles, Oregon, Paris Hilton, Samantha Schnurr", "sailthru.type": "article", "sailthru.date": "2017-09-28T14:45:09+00:00", "taboola_lead": "video", "msapplication-TileImage": "https://media.nbcdfw.com/2019/09/cropped-NBC_DFW.png?fit=270%2C270&quality=85&strip=all"}, "movies": [], "publish_date": 1506609909.0, "source": "https://www.nbcdfw.com", "summary": ""}