{"url": "https://web.archive.org/web/20171119105318/http://inshapetoday.com/now-official-fda-announced-vaccines-causing-autism/", "text": "The FDA has published conclusive proof on their website that the DTap vaccine can cause autism. According to the FDA’s online Biologics Blood Vaccines document, a vaccine manufacturer admits on its package insert that their vaccination can cause autism as one of many adverse reactions.\n\nThese adverse events reported during post-approval use of Tripedia vaccine include idiopathic thrombocytopenic purpura, SIDS, anaphylactic reaction, cellulitis, autism, convulsion/grand mal convulsion, encephalopathy, hypotonia, neuropathy, somnolence and apnea. Events were included in this list because of the seriousness or frequency of reporting. Because these events are reported voluntarily from a population of uncertain size, it is not always possible to reliably estimate their frequencies or to establish a causal relationship to components of Tripedia vaccine.\n\nIn this sense, it should be noted that:\n\nAcellular Pertussis Vaccine Concentrates (For Further Manufacturing Use) are produced by The Research Foundation for Microbial Diseases of Osaka University (BIKEN), Osaka, Japan, under United States (US) license, and are combined with diphtheria and tetanus toxoids manufactured by Sanofi Pasteur Inc. Tripedia vaccine is filled, labeled, packaged, and released by Sanofi Pasteur Inc.\n\nWhat’s in Tripedia that probably can interfere with brain chemistry and neurology?\n\nAccording to the Tripedia’s package insert, some ingredients include: Bovine extract, formaldehyde used to inactivate microorganisms a couple of times, ammonium sulfate, aluminum potassium sulfate and two growth mediums: modified Mueller and Miller is one; the other is Stainer-Scholte medium.\n\nWhat is the content of these two growth mediums?\n\nMueller and Miller medium, contains:\n\nGlucose, sodium chloride, sodium phosphate dibasic, monopotassium, phosphate, magnesium sulfate hydrate, ferrous sulfate heptahydrate, cysteine hydrochloride, tyrosine hydrochloride, uracil hydrochloride, Ca-pantothenate in ethanol, thiamine in ethanol, pyridoxine-hydrochloride in ethanol, riboflavin in ethanol, biotin in ethanol, sodium hydroxide, beef heart infusion (de- fatted beef heart and distilled water), casein [milk protein] solution. Basically a mixture of sugar, salt, amino acids, vitamins, and minerals.\n\nWhile Stainer-Scholte medium has the following ingredients:\n\nTris hydrochloride, tris base, glutamate (monosodium salt) [MSG], proline, salt, monopotassium phosphate, potassium chloride, magnesium chloride, calcium chloride, ferrous sulfate, ascorbic acid, niacin, glutathione.\n\nThe vaccine is formulated without preservatives, but contains a trace amount of thimerosal [(mercury derivative), (≤0.3 μg mercury/dose)] from the manufacturing process. Each 0.5 mL dose also contains, by assay, not more than 0.170 mg of aluminum and not more than 100 μg(0.02%) of residual formaldehyde. The vaccine contains gelatin and polysorbate 80 (Tween-80), which are used in the production of the pertussis concentrate.\n\n“Probable cause” ingredients for adverse reactions include: casein, to which some children are allergic; MSG—an excitotoxin; thimerosal-ethyl mercury; aluminum; formaldehyde; gelatin; and polysorbate 80.\n\nYou might be wondering:\n\nWhy the doctors don’t say anything about the risk of DTaP Vaccine?\n\nThat is a question that many of us, still wondering! Maybe they just is just not convenient for them that we know about the risk of these vaccine\n\nTo take the vaccine debacle further, most of the mandated vaccines for infants and children, contain many of the above ingredients, which must be stopped from being injected into infants, toddlers, teens and even adults!\n\nIt’s time for Congress to rescind the “Get out of Jail Free” card for vaccine makers and stop the aggressive onslaught of the Autism Spectrum Disorder that is depriving children of a fulfilling life and ruining families emotionally, financially, and physically to the point of parents divorcing because of the stresses of ASD in a family.\n\nIt’s about time vaccines are publicly acknowledged by the feds and the media for all the health damages they have caused. Just check out the CDC’s VAERS reports and the vaccine damage payouts by the HHS/HRSA. According to a new report published on March 1, 2017, by the department of health and human services of the United States, about $ 3,363,282,409.21 have been paid for vaccine adverse reactions and deaths from 1989 to 2017 so far.\n\nTo conclude, what do you think about this? Tell us in the comment section below.\n\nThanks for reading and Share if You Care!\n\nsource: :naturehealthandbeauty.com", "images": ["https://web.archive.org/web/20171119105318im_/http://inshapetoday.com/wp-content/uploads/2017/11/fda-autism-vaccines.jpg", "https://web.archive.org/web/20171119105318im_/https://i0.wp.com/assets.pinterest.com/images/pidgets/pinit_fg_en_rect_gray_20.png?w=640", "https://web.archive.org/web/20171119105318im_/https://i2.wp.com/inshapetoday.com/wp-content/uploads/2017/11/clean-lungs.jpg?resize=177%2C118", "https://web.archive.org/web/20171119105318im_/https://i0.wp.com/inshapetoday.com/wp-content/uploads/2017/02/grow-avocado-at-home.jpg?resize=554%2C305", "https://web.archive.org/web/20171119105318im_/https://i1.wp.com/inshapetoday.com/wp-content/uploads/2017/11/dtap-vaccine-autism.jpg?resize=400%2C191", "https://web.archive.org/web/20171119105318im_/https://i2.wp.com/inshapetoday.com/wp-content/uploads/2017/11/lips-personality-facts.jpg?resize=177%2C118", "https://web.archive.org/web/20171119105318im_/https://i2.wp.com/inshapetoday.com/wp-content/uploads/2017/04/bigshapemore-intellegent.jpg?resize=177%2C118", "https://web.archive.org/web/20171119105318im_/https://i1.wp.com/inshapetoday.com/wp-content/uploads/2016/08/garlic_dont_eat.jpg?resize=177%2C118", "https://web.archive.org/web/20171119105318im_/https://i0.wp.com/inshapetoday.com/wp-content/uploads/2017/11/print-vaccines.jpg?resize=640%2C273", "https://web.archive.org/web/20171119105318im_/https://i1.wp.com/inshapetoday.com/wp-content/uploads/2017/11/eternal-all-jim-carrey.jpg?resize=177%2C118", "https://web.archive.org/web/20171119105318im_/https://i0.wp.com/inshapetoday.com/wp-content/uploads/2016/06/ginger.jpg?resize=554%2C305", "https://web.archive.org/web/20171119105318im_/https://i1.wp.com/inshapetoday.com/wp-content/uploads/2017/11/smjoking-bad-habbit.jpg?resize=177%2C118", "https://web.archive.org/web/20171119105318im_/https://i0.wp.com/inshapetoday.com/wp-content/uploads/2016/11/best-hair-loss-shampoo.jpg?resize=177%2C118", "https://web.archive.org/web/20171119105318im_/http://www.inshapetoday.com/wp-content/uploads/2016/03/inshape_logo.png"], "top_img": "https://web.archive.org/web/20171119105318im_/http://inshapetoday.com/wp-content/uploads/2017/11/fda-autism-vaccines.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20171119105318/http://inshapetoday.com/now-official-fda-announced-vaccines-causing-autism/", "title": "NOW IT’S OFFICIAL: FDA Announced That Vaccines Are Causing Autism!", "meta_data": {"fb": {"pages": 853558898055141, "app_id": 952544184800987}, "p": {"domain_verify": "52bcceb078f4f253baf571a7d3d4c3d5"}, "viewport": "width=device-width, initial-scale=1", "og": {"locale": "en_US", "type": "article", "title": "NOW IT’S OFFICIAL: FDA Announced That Vaccines Are Causing Autism!", "description": "The FDA has published conclusive proof on their website that the DTap vaccine can cause autism. According to the FDA’s online Biologics Blood Vaccines document, a vaccine manufacturer admits on its package insert that their vaccination can cause autism as one of many adverse reactions. These adverse events reported during post-approval use of Tripedia vaccine...", "url": "https://web.archive.org/web/20171119105318/http://inshapetoday.com/now-official-fda-announced-vaccines-causing-autism/", "site_name": "InShapeToday", "updated_time": "2017-11-19T03:59:42+00:00", "image": "https://web.archive.org/web/20171119105318im_/http://inshapetoday.com/wp-content/uploads/2017/11/fda-autism-vaccines.jpg"}, "article": {"tag": "vaccines", "section": "Healthy & Happy", "published_time": "2017-11-15T00:52:37+00:00", "modified_time": "2017-11-19T03:59:42+00:00"}, "twitter": {"card": "summary", "description": "The FDA has published conclusive proof on their website that the DTap vaccine can cause autism. According to the FDA’s online Biologics Blood Vaccines document, a vaccine manufacturer admits on its package insert that their vaccination can cause autism as one of many adverse reactions. These adverse events reported during post-approval use of Tripedia vaccine...", "title": "NOW IT’S OFFICIAL: FDA Announced That Vaccines Are Causing Autism! - InShapeToday", "image": "https://web.archive.org/web/20171119105318im_/http://inshapetoday.com/wp-content/uploads/2017/11/fda-autism-vaccines.jpg"}, "generator": "WordPress 4.9", "ia": {"markup_url": "http://inshapetoday.com/now-official-fda-announced-vaccines-causing-autism/?ia_markup=1"}, "msapplication-TileImage": "https://i1.wp.com/inshapetoday.com/wp-content/uploads/2016/03/cropped-fav_in.png?fit=270%2C270"}, "movies": [], "publish_date": 1510707157.0, "source": "https://web.archive.org", "summary": ""}