{"url": "https://deadline.com/2017/11/the-walking-dead-crossover-character-revealed-lennie-james-fear-the-walking-dead-robert-kirkman-amc-1202214715/", "text": "SPOILER ALERT: This story contains details of tonight’s The Walking Dead episode & Talking Dead, as well as the upcoming Fear The Walking Dead crossover.\n\nThe long awaited crossover between The Walking Dead and spinoff Fear The Walking Dead will see Lennie James’ Morgan Jones character bridging the stories between the two series and moving to the latter.\n\nThis doesn’t mean that the Morgan character will be leaving TWD, even as James prepares to start filming on FearTWD tomorrow morning in Austin, Texas – at least not right away. “Even though Morgan is going to be featured on Fear, he has a lot of story left on The Walking Dead,” said showrunner Scott M. Gimple in a statement read out on Talking Dead on Sunday. “Morgan’s arch on The Walking Dead Season 8 positioned him for the story on Fear,” the EP added. “It was also important to see Fear‘s world and characters through new yet familiar eyes.”\n\nJames’ first day on the FearTWD set will be partially live streamed online it was also announced tonight.\n\nThe revelation of James’ eventual exit from the mother show came tonight on AMC’s post-TWD chat show, the durable Talking Dead with TWD‘s Melissa McBride, new cast member Avi Nash and indefatigable director and Comic Book Men co-star Kevin Smith on the guest couch. Revving up the ratings hopes as well as the hype machine that has been going since executive producer Robert Kirkman first made the crossover official in October at New York Comic-Con, news of the cast announcement was dropped online earlier this weekend as America recovered from its Thanksgiving feast and Black Friday shopping frenzy.\n\nSince the NYCC pronouncement, Kirkman has gone on to specify that the crossover would occur in 2018, which tied off some predictions and opened up others. Kirkman’s statement left the possibility that the crossocer could take place on either the current eighth season of the mother show, the upcoming Season 4 of the prequel of a sorts companion series or the ninth season of the Andrew Lincoln and Norman Reedus starring TWD next fall.\n\nAndrew Lincoln with Kim Dickens – our crossover senses are tingling! #FearTWD #TWD pic.twitter.com/pprHTSAMRb — FearTWD UK (@FearTWD_UK) November 24, 2017\n\nWith production on the fourth season of Fear The Walking Dead about to start in Austin, it made sense for Kirkman, fellow EP Gale Ann Hurd, TWD showrunner Gimple and more of the zombie apocalypse franchise team to get the crossover character news out there ASAP. Once shooting starts on the Kim Dickens, Colman Domingo and Frank Dillane led show in and around the music friendly town, fans and others would undoubtedly start sharing photos online of actors spotted on the FearTWD set, undermining any surprise. Add to that, the link between TWD and the Kirkman and Dave Erickson co-created FearTWD became all the stronger of late with Gimple joining the latter as a producer for the first time.\n\nA tightly held secret, as so many things TWD related are, the crossover prospects received deflective responses from both Walking Dead star Reedus and now former FearTWD showrunner Erickson when Deadline inquired in separate interviews.\n\nHowever, as the city of Houston seemed to be mentioned several times in the FearTWD Season 3 finale back on October 15, fans could not stop speculating. Amidst the probable characters to make the leap, if bookies were taking bets, the good money would have been on Michael Cudlitz’s Abraham Ford not James – even after TWD EP Greg Nicotero appeared to take the juice out of those odds late last month.\n\nWhile killed off along with Steven Yeun’s Glenn Rhee by villain Negan in the TWD Season 7 opener last year, the Texas originating ex-Army sergeant character would perfectly fit into the FearTWD timeline, which is more than an hop, skip and a Walker bite behind the first show.\n\nAnother factor that seemed to warm the multitude of scenarios up was the appearance last week on TWD of a helicopter. Absent from tonight’s mainly somber and then temporarily stereo speaker rich “The King, The Widow and Rick” episode, the helicopter flies over the distance issue that seemingly logistically grounded any crossover between Georgia and Virginia based TWD and the California then Mexico and soon Lone Star State set FearTWD. Whether that bird, so to speak, becomes a factor or not is TBD on TWD.\n\nTWD wraps up its 2017 run in two weeks with a winter finale on December 10. The show will return for the rest of Season 8 in early 2018. Season 4 of Fear The Walking Dead is expected to debut mid-2018.", "images": ["https://deadline.com/wp-content/uploads/2017/11/lennie-james-walking-dead.jpg?w=300", "https://deadline.com/wp-content/uploads/2017/11/walking-dead-feartwd-crossover-logo.jpg?w=1024", "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://deadline.com/wp-content/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://deadline.com/wp-content/uploads/2017/11/walking-dead-feartwd-crossover-logo.jpg?w=681&h=383&crop=1", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://deadline.com/wp-content/uploads/2017/11/the-walking-dead-fear-the-walking-dead.jpg?w=605", "https://deadline.com/wp-content/uploads/2017/11/michael-culditz-twd_701_gp_0504_0004-rt.jpg?w=605", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1"], "top_img": "https://deadline.com/wp-content/uploads/2017/11/walking-dead-feartwd-crossover-logo.jpg?w=1024", "keywords": [], "authors": ["Dominic Patten"], "canonical_link": "https://deadline.com/2017/11/the-walking-dead-crossover-character-revealed-lennie-james-fear-the-walking-dead-robert-kirkman-amc-1202214715/", "title": "‘The Walking Dead’ & ‘FearTWD’ Crossover Will Feature Lennie James On Spinoff", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "The upcoming crossover between 'TWD' &amp; 'FearTWD' will center on the Morgan character, it was revealed tonight on 'Talking Dead'", "news_keywords": "AMC, Fear The Walking Dead, Lennie James, Special Episodes, Talking Dead, The Walking Dead", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=533209613", "generator": "WordPress 6.0.2", "author": "Dominic Patten", "theme-color": "#fff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Deadline", "application-name": "Deadline", "content_type": "Article", "post_id": 1202214715, "title": "'The Walking Dead' & 'FearTWD' Crossover Will Feature Lennie James On Spinoff", "published_at": "2017-11-26 19:44:02", "image": "https://deadline.com/wp-content/uploads/2017/11/walking-dead-feartwd-crossover-logo.jpg?w=296&h=166&crop=1", "comment_count": 35, "tags": "The Walking Dead", "topics": "TV", "body": "SPOILER ALERT: This story contains details of tonight’s The Walking Dead  episode & Talking Dead, as well as the upcoming Fear The Walking Dead crossover.\r\n\r\n\r\n\r\nThe long awaited crossover between The Walking Dead and spinoff Fear The Walking Dead will see Lennie James' Morgan Jones character bridging the stories between the two series and moving to the latter.\r\nThis doesn't mean that the Morgan character will be leaving TWD, even as James prepares to start filming on FearTWD tomorrow morning in Austin, Texas  - at least not right away.  \"Even though Morgan is going to be featured on Fear, he has a lot of story left on The Walking Dead,\" said showrunner Scott M. Gimple in a statement read out on Talking Dead on Sunday. \"Morgan's arch on The Walking Dead Season 8 positioned him for the story on Fear,\" the EP added. \"It was also important to see Fear's world and characters through new yet familiar eyes.\" \r\nJames' first day on the FearTWD set will be partially live streamed online it was also announced tonight.\r\n\r\nThe revelation of James' eventual exit from the mother show came tonight on AMC’s post-TWD chat show, the durable Talking Dead with TWD's Melissa McBride, new cast member Avi Nash and indefatigable director and Comic Book Men co-star Kevin Smith on the guest couch. Revving up the ratings hopes as well as the hype machine that has been going since executive producer Robert Kirkman first made the crossover official in October at New York Comic-Con, news of the cast announcement was dropped online earlier this weekend as America recovered from its Thanksgiving feast and Black Friday shopping frenzy.\r\n\r\nTomorrow!!! An all new episode of #TheWalkingDead and then the big #crossover announcement of which character from #TWD or #FearTWD will be joining the other show on #TalkingDead ! #TWDFamily #FearFamily https://t.co/8QzNoTViHR\r\n— Gale Anne Hurd (@GunnerGale) November 25, 2017\r\nSince the NYCC pronouncement, Kirkman has gone on to specify that the crossover would occur in 2018, which tied off some predictions and opened up others. Kirkman's statement left the possibility that the crossocer could take place on either the current eighth season of the mother show, the upcoming Season 4 of the prequel of a sorts companion series or the ninth season of the Andrew Lincoln and Norman Reedus starring TWD next fall.\r\n\r\nAndrew Lincoln with Kim Dickens – our crossover senses are tingling! #FearTWD #TWD pic.twitter.com/pprHTSAMRb\r\n— FearTWD UK (@FearTWD_UK) November 24, 2017\r\n\r\n\r\nWith production on the fourth season of Fear The Walking Dead about to start in Austin, it made sense for Kirkman, fellow EP Gale Ann Hurd, TWD showrunner Gimple and more of the zombie apocalypse franchise team to get the crossover character news out there ASAP. Once shooting starts on the Kim Dickens, Colman Domingo and Frank Dillane led show in and around the music friendly town, fans and others would undoubtedly start sharing photos online of actors spotted on the FearTWD set, undermining any surprise. Add to that, the link between TWD and the Kirkman and Dave Erickson co-created FearTWD became all the stronger of late with Gimple joining the latter as a producer for the first time.\r\n\r\nA tightly held secret, as so many things TWD related are, the crossover prospects received deflective responses from both Walking Dead star Reedus and now former FearTWD showrunner Erickson when Deadline inquired in separate interviews.\r\n\r\n\r\n\r\nHowever, as the city of Houston seemed to be mentioned several times in the FearTWD Season 3 finale back on October 15, fans could not stop speculating. Amidst the probable characters to make the leap, if bookies were taking bets, the good money would have been on Michael Cudlitz’s Abraham Ford not James - even after TWD EP Greg Nicotero appeared to take the juice out of those odds late last month.\r\n\r\nWhile killed off along with Steven Yeun’s Glenn Rhee by villain Negan in the TWD Season 7 opener last year, the Texas originating ex-Army sergeant character would perfectly fit into the FearTWD timeline, which is more than an hop, skip and a Walker bite behind the first show.\r\n\r\nAnother factor that seemed to warm the multitude of scenarios up was the appearance last week on TWD of a helicopter. Absent from tonight’s mainly somber and then temporarily stereo speaker rich  “The King, The Widow and Rick” episode, the helicopter flies over the distance issue that seemingly logistically grounded any crossover between Georgia and Virginia based TWD and the California then Mexico and soon Lone Star State set FearTWD. Whether that bird, so to speak, becomes a factor or not is TBD on TWD.\r\n\r\nTWD wraps up its 2017 run in two weeks with a winter finale on December 10. The show will return for the rest of Season 8 in early 2018. Season 4 of Fear The Walking Dead is expected to debut mid-2018.", "fb": {"pages": 105558754896}, "onesignal": "wordpress-plugin", "fragment": "!", "og": {"type": "article", "title": "‘The Walking Dead’ & ‘FearTWD’ Crossover Will Feature Lennie James On Spinoff", "url": "https://deadline.com/2017/11/the-walking-dead-crossover-character-revealed-lennie-james-fear-the-walking-dead-robert-kirkman-amc-1202214715/", "description": "SPOILER ALERT: This story contains details of tonight’s The Walking Dead  episode & Talking Dead, as well as the upcoming Fear The Walking Dead crossover. The long awaited crossover between The…", "site_name": "Deadline", "image": {"identifier": "https://deadline.com/wp-content/uploads/2017/11/walking-dead-feartwd-crossover-logo.jpg?w=1024", "width": 1024, "height": 1024}, "locale": "en_US"}, "article": {"published_time": "2017-11-27T03:44:02+00:00", "modified_time": "2017-11-27T14:52:31+00:00"}, "twitter": {"site": "@DEADLINE", "creator": "@DeadlineDominic", "card": "summary_large_image", "title": "‘The Walking Dead’ & ‘FearTWD’ Crossover Will Feature Lennie James On Spinoff", "description": "The upcoming crossover between 'TWD' & 'FearTWD' will center on the Morgan character, it was revealed tonight on 'Talking Dead'", "image": "https://deadline.com/wp-content/uploads/2017/11/walking-dead-feartwd-crossover-logo.jpg?w=1024"}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1511754242.0, "source": "https://deadline.com", "summary": ""}