{"url": "https://en.wikipedia.org/wiki/List_of_awards_and_nominations_received_by_Kendrick_Lamar", "text": "Awards and nominations for rapper and songwriter Kendrick Lamar\n\nKendrick Lamar is an American rapper and songwriter. After releasing several mixtapes and his debut studio album Section.80 (2011), he gained mainstream recognition following the release of his second studio album Good Kid, M.A.A.D City (2012). The album earned Lamar seven nominations at the 56th Annual Grammy Awards, including Album of the Year, Best New Artist and Best Rap Album. He then won his first two Grammy Awards for Best Rap Song and Best Rap Performance for his single \"I\". His third studio album To Pimp a Butterfly (2015) helped him receive the most Grammy nominations by a rapper in one night, with eleven.[1][2] He won five of those awards at the 58th ceremony, including Best Rap Album, Best Rap Song and Best Rap Performance for \"Alright\", and Best Rap/Sung Collaboration for \"These Walls\" with Bilal, Anna Wise and Thundercat.\n\nIn 2015, Lamar received the California State Senate's Generational Icon Award from State Senator Isadore Hall III.[3] He released his fourth studio album Damn in 2017, which went on to win five awards at the 60th Annual Grammy Awards, including Best Rap Album, and become the first non-classical or jazz work to win the Pulitzer Prize for Music.[4][5] His curated soundtrack for the superhero film Black Panther (2018) won the Grammy Award for Best Rap Performance for the single \"King's Dead\" with Jay Rock, Future and James Blake, and receive an Academy Award nomination for the single \"All the Stars\" with SZA. In 2022, Lamar won the Grammy Award for Best Rap Performance for the single \"Family Ties\" with Baby Keem, and the Primetime Emmy Award for Outstanding Variety Special (Live) for co-headlining the Pepsi Super Bowl LVI Halftime Show.\n\nAcademy Awards [ edit ]\n\nThe Academy Awards are a set of 24 awards for artistic and technical merit in the film industry, given annually by the Academy of Motion Picture Arts and Sciences (AMPAS), to recognize excellence in cinematic achievements as assessed by the Academy's voting membership.\n\nAfrican-American Film Critics Association [ edit ]\n\nThe African-American Film Critics Association is a group of African American film critics that give various awards for excellence in film at the end of each year.\n\nYear Nominee / work Award Result Ref. 2018 Best Original Song \"All the Stars\" Won [6]\n\nAICE Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2016 Kendrick Lamar - Compton:Witness Greatness Best Montage Nominated [7] Digital Content (over 90) Nominated 2018 \"Humble\" Best Music Video Won [8] Best Color Grading - Music Video Nominated Element Nominated\n\nAmerican Music Awards [ edit ]\n\nCreated by Dick Clark in 1973, the American Music Awards is an annual music awards ceremony and one of several major annual American music awards shows. Kendrick Lamar has won two awards from eight nominations.\n\nARIA Music Awards [ edit ]\n\nThe Australian Recording Industry Association Music Awards are awarded annually by the Australian Recording Industry Association (ARIA).\n\nYear Nominee / work Award Result Ref. 2017 Himself Best International Artist Nominated [12] \"The Greatest\" (with Sia Song of the Year Nominated\n\nASCAP [ edit ]\n\nThe ASCAP Awards are held by the American Society of Composers, Authors and Publishers to honor its top members. Lamar was a member until 2019.[13]\n\nASCAP Rhythm & Soul Music Awards [ edit ]\n\nASCAP Pop Music Awards [ edit ]\n\nBBC Music Awards [ edit ]\n\nThe BBC Music Awards are the BBC's inaugural pop music awards, first held in December 2014, as a celebration of the musical achievements over the past 12 months.[21]\n\nYear Nominee / work Award Result Ref. 2017 Himself Artist of the Year Nominated [22]\n\nBerlin Music Awards [ edit ]\n\nThe Berlin Music Video Awards (BMVA) is an international festival that puts filmmakers and the art behind music videos in the spotlight. Supporting both unknown and famous artists, it is a primary networking event for the video and music industries in Europe.\n\nYear Nominee / work Award Result Ref. 2016 \"Alright\" Best Director Won [23]\n\nBET Awards [ edit ]\n\nThe BET Awards were established in 2001 by the Black Entertainment Television (BET) network to celebrate African Americans in music, acting, sports and other fields of entertainment. The awards are presented annually and broadcast live on BET.[24] Kendrick Lamar has won seven awards from twenty one nominations.\n\nBET Hip Hop Awards [ edit ]\n\nThe BET Hip Hop Awards are hosted annually by BET for hip hop performers, producers and music video directors. Kendrick Lamar has won twenty-five awards from fifty-two nominations.\n\nBillboard Music Awards [ edit ]\n\nThe Billboard Music Award is an honor given by Billboard, a publication and music popularity chart covering the music business. Kendrick Lamar has won six award from eighteen nominations.\n\nYear Nominee / work Award Result Ref. 2013 Good Kid, M.A.A.D City Top Rap Album Nominated [29] 2016 To Pimp a Butterfly Top Rap Album Nominated [30] 2018 Kendrick Lamar Top Artist Nominated [31] Top Male Artist Nominated Top Billboard 200 Artist Nominated Top Hot 100 Artist Nominated Top Song Sales Artist Nominated Top Streaming Songs Artist Won Top Rap Artist Won Top Rap Male Artist Won Top Rap Tour Nominated \"Humble\" Top Hot 100 Song Nominated Top Streaming Song (Audio) Won Top Rap Song Nominated Damn Top Billboard 200 Album Won Top Selling Album Nominated Top Rap Album Won Black Panther Top Soundtrack/Cast Album Nominated\n\nBlack Reel Awards [ edit ]\n\nThe Black Reel Awards annually recognize and celebrate the achievements of black people in feature, independent, and television films. Lamar received three accumulative nominations from the BRA (Black Reel Awards).\n\nBrit Awards [ edit ]\n\nThe Brit Awards are the British Phonographic Industry's (BPI) annual pop music awards.[33] Lamar won two nominations.\n\nBMI Awards [ edit ]\n\nThe BMI Awards are held annually by Broadcast Music, Inc. to award songwriters in various genres, including Hip-Hop/R&B, country and pop. Lamar joined BMI in 2019.[13]\n\nBMI R&B/Hip-Hop Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2019 \"All the Stars\" 35 Most Performed R&B/Hip-Hop Songs Won [35] \"Pray for Me\" Won\n\nBMI Pop Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2019 \"Pray for Me\" Award Winning Songs Won [36]\n\nCamerimage [ edit ]\n\nThe International Film Festival of the Art of Cinematography Camerimage is a festival taking place in Poland and dedicated to the celebration of cinematography and recognition of its creators, cinematographers. The Camerimage festival spans over a course of one week, with multiple events at one time. Kendrick Lamar has won two awards from four nominations.\n\nYear Nominee / work Award Result Ref. 2015 \"Alright\" Best Music Video Won [37] Best Cinematography in a Music Video Won 2017 \"Humble\" Best Music Video Nominated Best Cinematography in a Music Video Nominated\n\nCannes Lions International Festival of Creativity [ edit ]\n\nYear Nominee / work Award Result Ref. 2018 \"Humble\" Excellence in Music Video Silver Lion [38]\n\nClio Awards [ edit ]\n\nThe Clio Awards is an annual award program that recognizes innovation and creativity in advertising, design and communication.\n\nYear Nominee / work Award Result Ref. 2017 Element Gold Winner for Best Music Video Won [39] 2018 \"All the Stars\" Gold Winner for Best Music Video Won [40] \"Humble\" Silver Winner for Best Music Video Won\n\nCritics' Choice Movie Awards [ edit ]\n\nThe Critics' Choice Movie Awards is an awards show presented annually by the Broadcast Film Critics Association (BFCA) to honor the finest in cinematic achievement.\n\nD&AD Awards [ edit ]\n\nDesign and Art Direction (D&AD, formerly known as British Design & Art Direction) is a British educational charity which exists to promote excellence in design and advertising.\n\nYear Nominee / work Award Result Ref. 2018 \"Humble\" Music Video Graphite Pencil [41] Element Music Video Wood Pencil Cinematography for Music Videos Graphite Pencil Direction for Music Videos Wood Pencil Editing for Music Videos Wood Pencil\n\nDanish Music Awards [ edit ]\n\nThe Danish Music Awards is a Danish award show. The show has been arranged by IFPI since 1989. Kendrick Lamar has won two award from three nominations.\n\nFonogram Awards [ edit ]\n\nFonogram Awards is the national music awards of Hungary, held every year since 1992 and promoted by Mahasz.\n\nGAFFA Awards [ edit ]\n\nGAFFA Awards (Denmark) [ edit ]\n\nDelivered since 1991, the GAFFA Awards are a Danish award that rewards popular music by the magazine of the same name.\n\nYear Nominee / work Award Result Ref. 2015 Himself International Male Artist of the Year Nominated [49] To Pimp a Butterfly International Album of the Year Nominated 2018 Himself International Artist of the Year Nominated [50] Damn International Album of the Year Nominated\n\nGAFFA Awards (Norway) [ edit ]\n\nDelivered since 2012, the GAFFA Awards (Norwegian: GAFFA Prisen) are a Norwegian award that rewards popular music awarded by the magazine of the same name.\n\nYear Nominee / work Award Result Ref. 2017 Himself International Artist of the Year Won [51] Damn International Album of the Year Won \"Humble\" International Song of the Year Won\n\nGAFFA Awards (Sweden) [ edit ]\n\nDelivered since 2010, the GAFFA Awards (Swedish: GAFFA Priset) are a Swedish award that rewards popular music awarded by the magazine of the same name.\n\nYear Nominee / work Award Result Ref. 2018 Himself International Artist of the Year Nominated [52] Damn International Album of the Year Won \"Humble\" International Song of the Year Nominated 2019 \"All the Stars\" (with SZA Nominated\n\nGaon Chart Awards [ edit ]\n\nThe Gaon Chart Awards is an annual awards show in South Korea presented by the national music record chart, Gaon Chart.\n\nYear Nominee / work Award Result 2016 \"Don't Wanna Know\" (with Maroon 5) International Song of the Year Won\n\nGlobal Awards [ edit ]\n\nGlobal Awards are held by Global Media & Entertainment in the UK since 2018.\n\nYear Nominee / work Award Result Ref. 2018 Kendrick Lamar Best RnB, Hip Hop or Grime Nominated [53]\n\nGolden Globe Awards [ edit ]\n\nGrammy Awards [ edit ]\n\nThe Grammy Award are presented annually by the National Academy of Recording Arts and Sciences of the United States for outstanding achievements in the music industry. The awards were established in 1958. Kendrick Lamar has won fourteen awards out of thirty-seven nominations.\n\nHipHopDX Awards [ edit ]\n\nThe HipHopDX Awards are an annual year-end awards given by online Hip-Hop magazine HipHopDX.\n\nYear Nominee / work Award Result Ref. 2011 \"HiiiPower Verse of the Year Won [63] \"Section.80\" Album of the Year Won 2012 Himself Emcee of the Year Won [64] \"Good Kid, m.A.A.d City Album of the Year Won \"Good Kid, m.A.A.d City Readers' Choice Album of the Year Won 2013 Himself Emcee of the Year Won [65] \"Control\" Verse of the Year Won \"Kendrick Lamar Restores Friendly Competition With Control\" Story of the Year Won \"BET Hip Hop Awards Cypher\" Freestyle of the Year Won \"U.O.E.N.O (Remix)\" Collaboration of the Year Won 2014 \"i\" Video of the Year Won 2015 \"To Pimp A Butterfly\" Album of the Year Won [66] Himself Emcee of the Year Won \"Alright\" Video of the Year Won 2017 \"Damn\" Rap Album of the Year Won [67] Himself Rapper of the Year Won \"Duckworth.\" Best Song of the Year Won \"Humble.\" Video of the Year Won\n\nHollywood Music in Media Awards [ edit ]\n\nThe Hollywood Music in Media Awards (HMMA) honors music in film, television, video games, commercials, and trailers. Nominations are determined by an advisory board and selection committee comprised by journalists, music executives, songwriters, and composers.\n\nYear Nominee / work Award Result Ref. 2018 \"All the Stars\" Original Song – Sci-Fi/Fantasy/Horror Film Won Black Panther: The Album Soundtrack Album Won\n\nHouston Film Critics Society [ edit ]\n\nThe Houston Film Critics Society is a non-profit film critic organization in Houston, Texas in the United States.\n\nYear Nominee / work Award Result 2018 \"All the Stars\" Best Original Song Nominated\n\niHeartRadio Music Awards [ edit ]\n\nThe iHeartRadio Music Awards is an international music awards show founded by iHeartRadio in 2014.[68]\n\nJuno Award [ edit ]\n\nThe Juno Award are presented annually to Canadian musical artists and bands to acknowledge their artistic and technical achievements in all aspects of music.\n\nLondon International Awards [ edit ]\n\nThe London International Awards, or LIA (formerly known as London International Advertising Awards, LIAA), are a worldwide awards annually honoring \"pioneers, and embodiments of excellence\" in advertising, digital media, production, design, music & sound and branded entertainment.\n\nYear Nominee / work Award Result 2018 \"All the Stars\" Music Video: Best Music Video Nominated [72] Music Video: Cinematography Nominated Music Video: Visual Effects Bronze\n\nMOBO Awards [ edit ]\n\nThe MOBO Awards were established in 1996 by Kanya King to recognize artists on ethnicity or nationality in black music in the United Kingdom. Kendrick Lamar has been nominated three times, winning one.\n\nYear Nominee / work Award Result Ref. 2013 Himself International Artist Won 2015 To Pimp A Butterfly Best International Album Nominated 2017 Himself International Artist Nominated [73]\n\nMTV Awards [ edit ]\n\nMTV Video Music Awards [ edit ]\n\nThe MTV Video Music Awards were established in 1984 by MTV to celebrate the top music videos of the year. Kendrick Lamar has been nominated twenty eight times, winning eleven.\n\nMTV Europe Music Awards [ edit ]\n\nThe MTV Europe Music Awards were established in 1994 by MTV Europe. Kendrick Lamar has won two awards from ten nominations.\n\nMTV Video Music Awards Japan [ edit ]\n\nThe MTV Video Music Awards Japan is the Japanese version of the American Video Music Awards. Kendrick Lamar has received one award from two nominations.\n\nMTVU Woodie Awards [ edit ]\n\nMTVU, a division of MTV Networks owned by Viacom, broadcasts a 24-hour television channel available on more than 750 college and university campuses across the United States.[85] mtvU holds an annual awards show, the mtvU Woodie Awards,[86] in which winners are determined by online voting.[87] Kendrick Lamar has been nominated twice.\n\nYear Nominee / work Award Result 2012 \"Y.H.N.I.C\" Breaking Woodie Nominated 2013 Himself Woodie of the Year Nominated\n\nMuch Music Video Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2015 \"i\" Best International Video Nominated 2017 Himself International Artist of The Year Nominated Most Buzzworthy International Artist or Group Nominated 2018 Himself Best Hip Hop Artist or Group Nominated [88] Pray For Me (ft. The Weeknd) Best Collaboration Nominated All The Stars (ft. SZA) Nominated\n\nMyx Music Award [ edit ]\n\nThe Myx Music Award is an accolade presented by the cable channel Myx to honor the biggest hitmakers in the Philippines. winning once.\n\nNAACP Image Awards [ edit ]\n\nAn NAACP Image Award is an accolade presented by the American National Association for the Advancement of Colored People to honor outstanding people of color in film, television, music, and literature. Kendrick Lamar has been nominated sixteen times, winning seven.\n\nNickelodeon Kids' Choice Awards [ edit ]\n\nThe Nickelodeon Kids' Choice Awards are annual award shows launched by Nickelodeon. Lamar has received four nominations.\n\nYear Nominee / work Award Result Ref. 2016 \"Bad Blood\" (with Taylor Swift Favorite Song of the Year Nominated [93] Favorite Collaboration Nominated 2018 Kendrick Lamar Favorite Male Artist Nominated \"Humble\" Favorite Song Nominated\n\nNME Awards [ edit ]\n\nThe NME Awards were created by the NME magazine and was first held in 1953.[94] Lamar has received four nominations.\n\nYear Nominee / work Award Result Ref. 2016 Kendrick Lamar Best International Solo Artist Nominated [95] To Pimp a Butterfly Best Album Nominated 2018 Kendrick Lamar Best International Solo Artist Nominated [96] \"Humble\" Best Track Nominated\n\nNRJ Music Awards [ edit ]\n\nThe NRJ Music Awards was established in 2000 by the French radio station NRJ to honor the best in the French and worldwide music industry.\n\nYear Nominee / work Award Result Ref. 2015 \"Bad Blood\" (with Taylor Swift) Video of the Year Won [97]\n\nPLAY - Portuguese Music Awards [ edit ]\n\nPLAY - Portuguese Music Awards are annual awards for the Portuguese music scene, sponsored by Vodafone.It was first awarded 2019. Kendrick Lamar has won two awards from two nominations[98][99]\n\nYear Nominee / work Award Result Ref. 2019 \"All the Stars\" Best International Song Won [100] Kendrick Lamar Best International Artist Won\n\nPeople's Choice Awards [ edit ]\n\nThe People's Choice Awards are presented annually by Procter & Gamble.[101] Lamar has received three nominations.\n\nYear Nominee / work Award Result Ref. 2016 Himself Favorite Hip-Hop Artist Nominated [102] \"Bad Blood\" (with Taylor Swift Favorite Song Nominated 2017 Himself Favorite Hip-Hop Artist Nominated [103]\n\nPrimetime Emmy Awards [ edit ]\n\nThe Primetime Emmy Awards are bestowed by the Academy of Television Arts & Sciences (ATAS), in recognition of excellence in U.S. American primetime television programming.\n\nPulitzer Prize [ edit ]\n\nQ Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2017 \"Humble\" Best Track Nominated [106] Damn Best Album Nominated 2018 Kendrick Lamar Best Act in the World Today Nominated\n\nRTHK International Pop Poll Awards [ edit ]\n\nThe RTHK International Pop Poll Awards is an annual award show presented at RTHK Studio 1 that honors the best in international and national music from Hong Kong. It was established in 1989.\n\nYear Nominee / work Award Result 2017 \"The Greatest\" (with Sia) Top Ten International Gold Songs Nominated\n\nSatellite Awards [ edit ]\n\nThe Satellite Awards are annual awards given by the International Press Academy (IPA) that are commonly noted in entertainment industry journals and blogs.\n\nSoul Train Music Awards [ edit ]\n\nThe Soul Train Music Awards is an annual award show aired in national broadcast syndication that honors the best in African American music and entertainment established in 1987. Kendrick Lamar has won twice from eleven nominations.\n\nSpike Video Game Awards [ edit ]\n\nThe Spike Video Game Awards (also known as the VGAs, and the VGX in its final year) were an annual award show hosted by Spike TV between 2003 and 2013 (a decade long run) that recognized the best computer and video games of the year. Kendrick Lamar was nominated for Best Song in A Game for \"A.D.H.D.\" featured on Grand Theft Auto V.\n\nYear Nominee / work Award Result Ref. 2013 \"A.D.H.D.\" Best Song in A Game Nominated [111]\n\nTec Awards [ edit ]\n\nYear Nominee / work Award Result Ref. 2017 Damn Outstanding Creative Achievement: Record Production/Album Nominated [112]\n\nTeen Choice Awards [ edit ]\n\nThe Teen Choice Awards were established in 1999 to honor the year's biggest achievements in music, movies, sports and television, being voted by young people aged between 13 and 19. Lamar has won twice.\n\nTelehit Awards [ edit ]\n\nThe Telehit Awards are annual award show run by the Mexican music channel Telehit.\n\nYear Nominee / work Award Result Ref. 2015 \"Bad Blood\" (with Taylor Swift) Video of the Year Won [115]\n\nUK Music Video Awards [ edit ]\n\nThe UK Music Video Awards is an annual celebration of creativity, technical excellence and innovation in music video and moving image for music. Kendrick Lamar has won five awards from fourteen nominations.\n\nYear Nominee / work Award Result Ref. 2015 \"Alright\" Video Of The Year Won [116] Best Urban Video-International Won Best Cinematography Won \"Never Catch Me\" (with Flying Lotus) Best Alternative Video Won Best Choreography in a Video Nominated Himself Best Artist Nominated 2017 Won \"Humble\" Best Urban Video - International Nominated Vevo MUST SEE Award Nominated Best Production Design in a Video Nominated \"Element\" Best Urban Video - International Nominated Best Styling in a Video Nominated Best Cinematography in a Video Nominated 2018 \"All the Stars\" Best Urban Video - International Nominated 2022 \"The Heart Part 5\" Best Hip Hop/Grime/Rap Video - International Pending [117] Best Performance in a Video Pending Best Visual Effects in a Video Pending\n\nVariety Hitmakers Awards [ edit ]\n\nVariety launched the Variety Hitmakers event in 2017.\n\nYear Nominee / work Award Result Ref. 2017 Himself Hitmaker of the Year Won [118]\n\nWebby Awards [ edit ]\n\nThe Webby Awards is an awards show which honors websites, interactive advertising, online film & video and mobile content.\n\nYear Nominee / work Award Result Ref. 2017 \"Swimming Pools (Drank)\" (Film & Video) Best Video Remixes/Mashups Won [119]\n\nWorld Soundtrack Awards [ edit ]\n\nThe World Soundtrack Academy (WSA, or World Soundtrack Awards), launched in 2001 by the Film Fest Gent, is aimed at organizing and overseeing the educational, cultural and professional aspects of the art of film music, including the preservation of the history of the soundtrack and its worldwide promotion. The event takes place yearly in Ghent, Belgium with the ceremony usually at the Capitole Concert Hall. Usually, the Brussels Philharmonic conducted by maestro Dirk Brossé performs the awarded music at the ceremony.\n\nXXL Awards [ edit ]\n\nThe XXL Awards recognized the best in Hip-Hop in 2012. The nominees and winners were picked by the XXL staff, excluding the winners in the big five biggest categories which was determined by public vote.[121]\n\nYear Nominee / work Award Result Ref. 2013 Himself Rapper of the Year Won [122] Good Kid, M.A.A.D City Album of the Year Won Himself Breakout Artist of the Year Nominated \"The Recipe (Remix)\" (with Jay Rock, Schoolboy Q, & Ab-Soul) Best Remix Nominated Good Kid, M.A.A.D City Best Debut Album Won \"Power Circle\" (with Gunplay, Stalley, Wale & Meek Mill) Best Posse Cut Nominated \"F**kin' Problems\" (with A$AP Rocky, Drake, & 2 Chainz) Nominated \"Blessed\"(with Schoolboy Q) Best Guest Verse on a Hip-Hop Record Nominated\n\nYouTube Music Awards [ edit ]\n\nThe YouTube Music Awards is an awards show presented by YouTube to honor the best in the music video medium.\n\nYear Nominee / work Award Result Ref. 2013 Himself YouTube Breakthrough Nominated 2015 50 artists to watch Won [123]\n\nNotes [ edit ]\n\n^ Awards in certain categories do not have prior nominations and only winners are announced by the jury. For simplification and to avoid errors, each award in this list has been presumed to have had a prior nomination.", "images": ["https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Kendrick_Lamar_White_House_2016.jpg/246px-Kendrick_Lamar_White_House_2016.jpg", "https://upload.wikimedia.org/wikipedia/commons/c/c2/Kendrick_Lamar_White_House_2016.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/c/c2/Kendrick_Lamar_White_House_2016.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_awards_and_nominations_received_by_Kendrick_Lamar", "title": "List of awards and nominations received by Kendrick Lamar", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/c/c2/Kendrick_Lamar_White_House_2016.jpg", "width": 640, "height": 857}, "title": "List of awards and nominations received by Kendrick Lamar - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}