{"url": "https://www.pastemagazine.com/articles/2018/01/the-50-best-movies-on-hbo-go-and-hbo-now-january-2.html?p=2", "text": "The best movies on HBO Max reflect nothing if not the culmination of our streaming dystopia. Ostensibly, this is a good thing: Below you’ll find masterpiece after masterpiece from the likes of Stanley Kubrick, Agnes Varda, Alfred Hitchcock, David Lynch, Barbara Kopple, Jacques Demy, Akira Kurosawa, the Maysles, Pennebaker, Ingmar Bergman—those looking for a crash course in world cinema can pretty much single-handedly thank Turner Classic Movies’ folding under the HBO banner for the bounties they’re about to inhale. Basically, it’s like Criterion Channel Lite in some of its more highbrow corners.\n\nLike most other streaming services that aren’t owned by, say, the House of Mouse, there is no real overarching theme to what HBO Max presents, which is exactly why HBO Max represents such a powerful urge to just roll over and let it all happen. Even Hayao Miyazaki, notoriously against having his movies available on streaming services, finally gave in. Whereas once these streaming services represented a more accessible alternative to an overpriced cable TV package, now we’re given no alternative, even though pretty much every movie imaginable is available for us to watch right now. Welcome HBO Max: You get a piece of us too.\n\nYou’ll find a lot of French gems here, not to mention an essential selection of documentaries, silent films, sci-fi staples, psychedelic monster movies, musicals and every shade of Oscar bait in between.\n\nHere are the 50 best movies on HBO Max right now:\n\nYear: 1968\n\nDirector: Stanley Kubrick\n\nStars: Keir Dullea, Gary Lockwood, Douglas Rain, William Sylvester\n\nRating: G\n\nRuntime: 139 minutes\n\n\n\n\n\nWatch on HBO Max\n\nFifty years ago, Stanley Kubrick told the story of everything—of life, of the universe, of pain and loss and the way reality and time changes as we, these insignificant voyagers, sail through it all, attempting to change it all, unsure if we’ve changed anything. Written by Kubrick and Arthur C. Clarke (whose novel, conceived alongside the screenplay, saw release not long after the film’s premiere), 2001: A Space Odyssey begins with the origins of the human race and ends with the dawn of whatever comes after us—spinning above our planet, god-like, a seemingly all-knowing, hopefully benevolent fifth-dimensional space fetus—spanning countless light years and millennia between. And yet, despite its ambitious leaps and barely comprehensible scope, every lofty symbolic gesture Kubrick matches with a moment of intimate humanity: the sadness of a mighty intellect’s death; the shock of cold-blooded murder; the minutiae and boredom of keeping our bodies functioning on a daily basis; the struggle and awe of encountering something we can’t explain; the unspoken need to survive, never questioned because it will never be answered. So much more than a speculative document about the human race colonizing the Solar System, 2001 asks why we do what we do—why, against so many oppositional forces, seen and otherwise, do we push outward, past the fringes of all that we know, all that we ever need to know? Amidst long shots of bodies sifting through space, of vessels and cosmonauts floating silently through the unknown, Kubrick finds grace—aided, of course, by an epic classical soundtrack we today can’t extricate from Kubrick’s indelible images—and in grace he finds purpose: If we can transcend our terrestrial roots with curiosity and fearlessness, then we should. Because we can. That the end of Kubrick’s odyssey returns us to the beginning only reaffirms that purpose: We are, and have always been, the navigators of our destiny. —Dom Sinacola\n\nYear: 1999\n\nDirector: Martin Scorsese\n\nStars: Nicolas Cage, Patricia Arquette, John Goodman, Ving Rhames, Tom Sizemore\n\nRating: R\n\nRuntime: 121 minutes\n\n\n\n\n\nWatch on HBO Max\n\nA blisteringly dispiriting drama about the toll taken upon medical workers, Bringing Out the Dead naturally has plenty to say about martyrs and morality. Martin Scorsese isn’t letting anyone’s literal faith or that in the broken American healthcare system go unexamined. Nicolas Cage’s dead-eyed and desperate ambulance driver cycles through jaded partners (brilliantly painted by John Goodman, Ving Rhames and Tom Sizemore) as he tries to put some goddamn good into this seemingly godforsaken corner of New York. Will he be saved by Mary (Patricia Arquette), daughter of a heart attack patient? Or will he sink deeper into the hallucinatory madness that has already seemingly claimed everyone around him? Paul Schrader pens another sleazy and sad script as he adapts Joe Connelly’s novel, depicting the timeless twilight world of medical emergencies with all its grimy detail and psychological ghosts. All those night shoots were worth it: The film looks as nightmarish as it feels. It is a world of imperfection, a world of good intentions, a world just a phone call (or improbable, but not impossible, accident) away. Bringing Out the Dead is a movie about the end of life in its most harrowingly realistic form—where Narcan and mouth-to-mouth supersede spirituality—but Scorsese’s light-bringing touch and Cage’s nuanced performance offer the possibility of absolution at the end.—Jacob Oller\n\nYear: 2001\n\nDirector: Hayao Miyazaki\n\nStars: Rumi Hiiragi, Miyu Irino, Mari Natsuki, Yumi Tamai\n\nRating: PG\n\nRuntime: 125 minutes\n\n\n\n\n\nWatch on HBO Max\n\nWhat is it about Hayao Miyazaki’s Spirited Away that makes it one of his greatest—if not the greatest—films he has ever made? Perhaps it’s because it represents the best expression of his most defining themes and concepts—the strength and perseverance of a young woman, the rapturous glory of flight, the spiritual struggle of personal and cultural amnesia with Japanese society, the redeeming power of love. Maybe it has something to do with the crux of the film’s story being so archetypically identifiable, not so much a modern reimagining as it is a spiritual evocation of Lewis Carroll’s Alice in Wonderland, a childhood odyssey in a world that feels both familiar and foreign at the same time. Whatever the case, there is nothing quite like watching Spirited Away for the first time. The image of Chihiro (Rumi Hiiragi), having discovered her parents transformed into pigs, running frantically through the streets as the town surrounding her comes to life, lights flickering into existence and spirits rising up from the earth, is nothing short of magical. Films like Nausicaä, Princess Mononoke and My Neighbor Totoro introduced the world to Hayao Miyazaki, but it was Spirited Away that secured his name among the canon of the greatest animators to have ever lived, ensuring his legacy for decades to come. —Toussaint Egan\n\nYear: 1928\n\nDirector: Carl Theodor Dreyer\n\nStars: Renée Jeanne Falconetti, Eugene Silvain, Antonin Artaud, Maurice Schultz\n\nRating: NR\n\nRuntime: 82 minutes\n\n\n\n\n\nWatch on HBO Max\n\nRenée Jeanne Falconetti’s face is in your brain, whether you’re aware of it there or not. Its contours and stipples, topped by hair shorn of substance or style—her head centered by two wide eyes rimmed with tears, in superposition between ecstasy and misery even though we’re staring at her—consumes boundless space in Danish director Carl Th. Dreyer’s silent masterpiece, seemingly suspended over the long course of history between now (whenever now happens to be) and when Dreyer first envisioned this immersive, expressionist experience. Dreyer wrote of his film, “What counted was getting the spectator absorbed in the past,” and then, “A thorough study of the documents from the rehabilitation process was necessary; I did not study the clothes of the time, and things like that. The year of the event seemed as inessential to me as its distance from the present.” Though The Passion of Joan of Arc Dreyer based on the 1491 transcripts of its titular saint’s trial for heresy (the director welcomed by the Société Générale des Films to make a film in France, his choice of subject bolstered by France’s canonization of Joan of Arc after World War I), he provides little visual detail or historical context. Instead he submerges the viewer in Joan’s perspective, keeps his hand on our heads as we drown in the torment of what she’s subjected to, rarely releasing his weight except for in the film’s final moments, when Joan’s execution at the stake unleashes violence throughout the citizenry. But mostly: that face, awestruck throughout time. Most notably, in Jean-Luc Godard’s Vivre sa vie, the director watches as his protagonist, Nana (Anna Karina), watches Joan of Arc, lighting her tear-streaked face in close-up as she experiences something of the same images before her. Godard reflects Falconetti’s face in Karina’s, spanning more than three decades as if they’re nothing. There is perhaps no better ode to the power of what Dreyer achieved: Timelessness borne by the tragedy of our all too weak, all too human, flesh. —Dom Sinacola\n\nYear: 1963\n\nDirector: Federico Fellini\n\nStars: Marcello Mastroiani, Claudia Cardinale, Anouk Aimee\n\nRating: NR\n\nRuntime: 140 minutes\n\n\n\n\n\nWatch on HBO Max\n\nWith Fellini we wander through a shadow of his psyche, wondering where his memories begin and where Guido’s (Marcello Mastroiani) psychoses end. Perhaps Fellini’s most impressive blending of dreams and fantasies, of moral truth and oneiric fallacy, of space and time, 8 ½ tells its story in Möbius strips, wrapping realities into realities in order to leave audiences helplessly buried within its main character’s self-absorption. Guido’s obsession is so inward-looking he can’t help but destroy every single close relationship in his life, and yet, in hanging the film’s narrative on the struggle of one filmmaker to make his latest film—the title refers to the fact that this was Fellini’s eighth-and-a-half feature—the iconic Italian director seems to claim that artistic genius practically demands such solipsism. It’s a brazen statement for a film to make, but Fellini does so with such grace and vision, with such seamless intent, 8 ½ becomes a bittersweet masterpiece: Clear, aching and steeped in nostalgia, it celebrates the kind of glorious life only cinema can offer. —Dom Sinacola\n\n\n\nYear: 1964\n\nDirector: Jacques Demy\n\nStars: Catherine Deneuve, Nino Castelnuovo, Anne Vernon\n\nRating: G\n\nRuntime: 92 minutes\n\n\n\n\n\nWatch on HBO Max\n\nJacques Demy’s masterpiece is a soaring, vibrant, innately bittersweet story of love lost, found and forever disbanded, another wartime casualty in a country scarred by military conflict. The Umbrellas of Cherbourg is lived-in, a story derived from Demy’s life experience, and that keyword—“experience”—is essential to making the film click. Take away its musical cues, and you’re left with a narrative about a young man (Nino Castelnuovo) and a young woman (Catherine Deneuve) who fall deeply in love with one another, only to be torn apart when he’s drafted to fight overseas. The story remains rooted in Demy’s pathos, and pathos gives Umbrellas’ gravity. The music, of course, is a critical part of its character, a dose of magic Demy uses to buttress the rigors of life in wartime with grandeur and meaning. It’s a film about people in love falling out of love, and then falling in love all over again with new partners and altered sentiments, a beautiful picture as likely to make you swoon as to crush your heart. —Andy Crump\n\nYear: 1956\n\nDirector: Akira Kurosawa\n\nStars: Toshiro Mifune, Takashi Shimura, Yoshio Inaba, Kuninori Kodo\n\nRating: R\n\nRuntime: 207 minutes\n\n\n\n\n\nWatch on HBO Max\n\nThe heart’s favorite Akira Kurosawa film is Ikiru, while the brain’s is always dead-set on Seven Samurai. Forget the myriad of official and unofficial remakes and re-imaginings, just think of practically any ambitious action/adventure yarn, of rousing tales of underdogs battling seemingly unbeatable forces threatening their existence, with only bravery, wits and bravado on their side: Seven Samurai is built into that DNA. From the smallest details of its structure, right down to specific framing, design and choreography, Kurosawa’s choices solidify it as easily one of the greatest films ever made. —Oktay Ege Kozak\n\nYear: 1942\n\nDirector: Michael Curtiz\n\nStars: Humphrey Bogart, Ingrid Bergman, Paul Henreid, Claude Rains, Peter Lorre\n\nRating: PG\n\nRuntime: 102 minutes\n\n\n\n\n\nWatch on HBO Max\n\nThere are probably a decent number of auteur-theorist types who’d quibble with me for saying Casablanca is a perfect film. The production team didn’t consider it a big deal, in fact; just one of hundreds of films being made that year (despite a major league cast and great writers). It performed solidly at the box office, though not spectacularly. Then it won a bunch of Academy Awards. Then its reputation began to grow. One of the many interesting things about Casablanca is its epic durability – the story feels as fresh and real today as it did in 1945. A romantic drama with political tones and a ton of wit, it features superb performances by Humphrey Bogart and Ingrid Bergman, Peter Lorre, Sydney Greenstreet, and Paul Henreid (for starters). Doomed love, self-sacrifice, Bogie one-liners galore, and one of the most quintessential cinematic moments of its age (both of my kids were born after 9/11 and even they cheered when that chorus of La Marseillaise drowned out the Nazis). Smart, sweet, and witty; probably the quintessential film of the 1940s, and one of the best feel-good movies of the 20th century. —Amy Glynn\n\nYear: 1980\n\nDirector: Jim Abrahams\n\n\n\n\n\nWatch on HBO Max\n\nThe writing trio of Jerry Zucker, Jim Abrahams and David Zucker (ZAZ) defined a genre with their disaster-movie spoof in 1980. The jokes fly fast and furious, from the “Who’s on First” confusion of a crew that includes Roger and Captain Oveur (“Roger, Roger. What’s our vector, Victor?”) to Oveur (Peter Graves) asking a kid in the cockpit, “Joey, do you like movies about gladiators?” to an old lady translating jive (“Jive-ass dude don’t got no brains anyhow! Shiiiiit!”) to “stop calling me Shirley!” Ridiculous and ridiculously quotable, it’s the funniest spoof film of all time. —Josh Jackson\n\nYear: 1941\n\nDirector: Orson Welles\n\nStars: Orson Welles, Joseph Cotten, Dorothy Comingore\n\nRating: PG\n\nRuntime: 120 minutes\n\n\n\n\n\nWatch on HBO Max\n\nObviously, Citizen Kane is no stranger to any list of movies like this, but there’s no denying that part of what makes this film ostensibly the “greatest of all time” is the way it uses the process of journalism to create a style and structure of storytelling that felt totally unique at the onset of the 1940s. We experience much of the film through the eyes of a reporter (the great Joseph Cotten) attempting to understand the life and death of newspaper magnate Charles Foster Kane (director Orson Welles): In a sense, it is film-as-investigative journalism, which enables Welles to take an innovative approach, dissecting Kane’s life in flashbacks, newsreels and interviews from not-always reliable sources. See only: its visually stunning newspaper montage—just one example of the film’s spectacular editing, which even today seems ahead of its time. —Maura McAndrew\n\nYear: 1962\n\nDirector: François Truffaut\n\nStars: Jeanne Moreau, Oskar Werner, Henri Serre, Michel Subor\n\nRating: R\n\nRuntime: 107 minutes\n\n\n\n\n\nWatch on HBO Max\n\nWidely regarded as a French touchstone, François Truffaut’s classic WWI-era love triangle is based on a semi-autobiographical novel of the same title by Henri-Pierre Roche, which Truffaut stumbled across in a Paris bookstore in the 1950s. The adaptation tells the tragic story of Jim (Henri Serre), a French Bohemian, Jules (Oskar Werner), his Austrian friend, and Catherine (Jeanne Moreau), Jules’ girlfriend/wife. The two men are besotted with Catherine, who bears an eerie resemblance to a statue they both love. She marries Jules. The war breaks out, and the two men, on opposing sides of the conflict, struggle with the fear that one might unwittingly kill the other in battle. (What actually happens is arguably worse.) Both survive, and later, Jim visits Jules and Catherine in their Black Forest cottage. Jules confides he’s miserable, that Catherine has constant affairs, has left him and their baby, Sabine, for months at a time, and that he lives in terror of losing her. Catherine tries to seduce Jim. The three try an experimental situation where Catherine is with both men, but tragedy only ensues from there. Perhaps a definitive example of the French New Wave, the film incorporates a vast lexicon of cinematic techniques—newsreel footage, stills, wipes, panning shots, freeze-frames, voiceover narration (by Michel Subor)—though shades of its towering influence in subsequent films, television and music are almost innumerable. —Amy Glynn\n\nYear: 2021\n\nDirector: Wes Anderson\n\nStars: Benicio del Toro, Adrien Brody, Tilda Swinton, Léa Seydoux, Frances McDormand, Timothée Chalamet, Lyna Khoudri, Jeffrey Wright, Mathieu Amalric, Stephen Park, Bill Murray, Owen Wilson\n\nRating: R\n\nRuntime: 108 minutes\n\n\n\n\n\nWatch on HBO Max\n\nAs was the case with 2014’s The Grand Budapest Hotel, The French Dispatch is a story within a story—or, in this case, multiple stories within a story, and there are stories within those stories as well. Wes Anderson remains a creative force to be reckoned with. Frequently rebuked by naysayers for his commitment to his finely-tuned, “quirky” filmmaking style, The French Dispatch proves he is more interested than anything in how to play around with the medium of film and find new ways to tell his stories. Here, he challenges himself to a far more intricate means of storytelling, which is occasionally convoluted but fosters an eagerness to return to the film—to revisit and discover something new. Additionally, he trades previous forays in stop-motion animation for an extended 2D animated chase scene, and even briefly swaps his prototypically stationary, symmetrical camerawork for a dinner table sequence in which the camera slowly revolves around the seated characters, creating a novel and striking dimensionality to his cinematography. Timothée Chalamet, Jeffrey Wright and Benicio del Toro, in their respective first collaborations with the director, could not have been more perfectly attuned to Anderson’s highly specified wavelength. Even minor roles from new Anderson inductees like Elisabeth Moss, Henry Winkler, Christoph Waltz and Rupert Friend are, as could be expected from a perfectionist like Anderson, a snug fit. The precision with which Anderson once effortlessly deployed anguish, familial strife, love, insecurity and, perhaps above all, loss, within his carefully constructed signature filmmaking is largely absent from his newest endeavor. The various storytelling gimmicks take center stage, while the characters are forced into the back seat. The film becomes a wry showcase for the director’s evolution as a creative who has been refining an unparalleled style for over two decades, with a sharper humor but without the more deeply felt pulse of films like The Darjeeling Limited, Fantastic Mr. Fox or most recently, and most effectively, The Grand Budapest Hotel. Still, it’s not to say that The French Dispatch’s bones are absent of any meat at all. “What happens next?” ends up a proportional sentiment to that of the film’s titular publication, the disappearing town it’s set in and the overall theme within Wes Anderson’s tenth feature: The eternal battle between art and capital. The question of “What happens next?” is less an inquiry as to the future of a shuttered, fictitious publication than a worrying, real-life prophecy, and The French Dispatch acts as a dialogue with this fear of the future of art. In this respect, it’s hard to argue that this latent dissolution of character depth is a net negative, when Anderson is clearly interested in, more than anything, growing and evolving as an artist.—Brianna Zigler\n\nYear: 2022\n\nDirector: Tia Lessin, Emma Pildes\n\nRating: TV-MA\n\nRuntime: 101 minutes\n\n\n\n\n\nWatch on HBO Max\n\nIn the spring of 1972, seven women were arrested for breaking a law that 1973’s landmark Roe v. Wade decision would summarily dissolve. Before that arrest was officially deemed unjust, those women were integral pieces of a Chicago-based collective that helped those who couldn’t wait for policy change to permit their actions. The Janes, a straight-forward, engaging HBO Documentary directed by Tia Lessin and Emma Pildes, has intimate access to collective members who saw their underground abortion network as a duty, a calling and the only thing that made sense in the face of a total ban on reproductive autonomy. The film opens with as dramatic a hook as a largely talking-head-based documentary can. One collective member describes her harrowing experience with a mob-arranged abortion provider; one of the only options available at the time, aside from self-induced methods. Accompanied by archival and wisely chosen stock footage, she relays the textural flashes of the event: The seedy motel, the clinical procedure totally devoid of any comfort or anesthetic, the shocking levels of blood and the unexpected presence of another girl in the room, a stranger whose procedure was done with the same callousness as to whether either of them survived. It was only thanks to that double procedure—and that they both had someone else to make sure the other didn’t bleed out—that she lived to tell the tale. This is only one of the horror stories that makes The Janes, the collective that provided thousands of women with a means to life-saving yet illegal services, so insoluble. Throughout the film, collective members give firsthand accounts of what drew them to each other and eventually bound them together, even through major burnout and stays in mental hospitals. Those telling their stories aren’t from a completely alien era, and the knowledge that they share, in tones frank and thoughtful by turn, is incredibly valuable. If anything, The Janes is a call to find and form networks in one’s own community. It’s a reminder, as the inevitability of another abortion ban inches closer and closer every day, there will always be people who disregard what is lawful in favor of what is right—and documentary can be a tool in teaching what, who and how to effectively parse and evade that lawful, undeniably wrong side of history. —Shayna Maci Warner\n\nYear: 1954\n\nDirector: Ishiro Honda\n\nStars: Sachio Sakai, Takashi Shimura, Momoko Kochi, Akira Takarada\n\nRating: NR\n\nRuntime: 95 minutes\n\n\n\n\n\nWatch on HBO Max\n\nEarly in Godzilla, before the monster is even glimpsed off the shore of the island of Odo, a local fisherman tells visiting reporter Hagiwara (Sachio Sakai) about the play they’re watching, describing it as the last remaining vestige of the ancient “exorcism” his people once practiced. Hagiwara watches the actors “sacrifice” a young girl to the calamitous sea creature to satiate its hunger and cajole it into leaving some fish for the people to enjoy—at least until the next sacrifice. Ishiro Hondo’s smash hit monster movie—the first of its kind in Japan, the most expensive movie ever made in the country at the time, not even a decade after the atomic bombing of Hiroshima and Nagasaki—is, after 20-something sequels over three times as many years, a surprisingly elegiac exorcism of its own, a reminder of one nation’s continuing trauma during a time when the rest of the world jonesed to forget. As J Hoberman describes in his essay for the film’s Criterion release, much of Honda’s disaster imagery is “coded in naturalism,” a verite-like glimpse of the harrowing destruction wrought by the beast but indistinguishable from the aftermath of the Americans’ attacks in 1945, especially when the U.S. and Russia, among other powers, were testing H-bombs in the Pacific in the early 1950s, bathing the Japanese in even more radiation than that in which they’d already been saturated. And yet, Godzilla is a sci-fi flick, replete with a “mad” scientist in an eye patch and a human in a rubber dinosaur suit flipping over model bridges. That Honda handles such goofiness with an unrelentingly poetic hand, purging his nation’s psychological grief in broadly intimate volleys, is nothing short of astounding. Shots of Godzilla trudging through thick smoke, spotlights highlighting his gaping maw as the Japanese military’s weapons do nothing but shock the dark with beautiful chiaroscuro, have been rarely matched in films of its ilk (and in the director’s own legion of sequels); Honda saw gods and monsters and, with the world entering a new age of technological doom, found no difference between the two. —Dom Sinacola\n\nYear: 1991\n\nDirector: James Cameron\n\nStars: Arnold Schwarzenegger, Linda Hamilton, Robert Patrick, Edward Furlong, Joe Morton\n\nRating: R\n\nRuntime: 137 minutes\n\n\n\n\n\nWatch on HBO Max\n\nThat rare sequel that trumps its predecessor, James Cameron and co-writer William Wisher Jr. crafted a near-perfect action-movie script that flipped the original on its head and let Ahnold be a good guy. But it’s Linda Hamilton’s transformation from damsel-in-distress to bad-ass hero that makes the film so notable. Why should the guys get all the good action scenes? —Josh Jackson\n\nYear: 1953\n\nDirector: Henri-Georges Clouzot\n\nStars: Yves Montand, Charles Vanel, Peter Van Eyck\n\nRating: NR\n\nRuntime: 149 minutes\n\n\n\n\n\nWatch on HBO Max\n\nAbout an hour has passed before Henri-Georges Clouzot’s film reaches its real plot—a whole hour before our four impoverished expatriates take on the death-defying gig of driving two trucks filled with nitroglycerine across 300 treacherous miles, from the South American oil town of Las Piedras to the site of an oil field explosion overseen by an American corporation. Clouzot sets his stakes simply: Because nitroglycerine is so volatile, and because the corporation does not have the proper transportation equipment available, volunteers must, with exquisite care, drive trucks full of the chemical across mountainous terrain to be used to damper the oil fire with a huge controlled explosion. But that journey doesn’t begin until after Clouzot has waded through the stagnant world of our drivers, introducing us to the kind of men who rarely deal in the currency of hope: Corsican lothario Mario (Yves Montand), warm-hearted Italian Luigi (Folco Lulli), slippery ex-gangster Jo (Charles Vanel) and stoic German cool guy Bimba (Peter van Eyck) are each trapped in the town, wasting away their interminable time there with odd jobs, liquor and local women. With almost effortless allegorical control, Clouzot strands the men at the mercy of American capitalism, giving them the choice to continue to die slowly in Las Piedras, or risk their lives for enough money to finally get out (which is really no choice at all). Rather than cast them as heroes and future martyrs, Clouzot’s wallowing with them in Las Piedras exposes their ne’er-do-well natures, such as Mario’s womanizing, Bimba’s near-sociopathic aloofness and Jo’s latent cowardice. Even with such unpleasantness, we grit our teeth and hold our breath as these anti-heroes teeter over the maw of their own inevitable obliteration, Clouzot knowing full well he’s got us by our throats. In its unbelievable tension, The Wages of Fear can be a harrowing watch, but it’s shot with such a total dearth of sentimentality that the bleakness of the landscape Clouzot’s created forces us to care about those who don’t deserve it. We have affection not because Clouzot’s manipulated us, but simply because these broken men are as much at the mercy of an indifferent universe as we are, ruled by fate and classism and whatever else we’ll never control, whether we know it or not. —Dom Sinacola\n\nYear: 1940\n\nDirector: Charles Chaplin\n\nStars: Charles Chaplin, Paulette Goddard, Jack Oakie, Reginald Gardiner\n\nRating: G\n\nRuntime: 126 minutes\n\n\n\n\n\nWatch on HBO Max\n\nCharlie Chaplin’s first “talkie” was a biting satire that he wrote, directed, produced, scored, and starred in-as both of the lead roles, a fascist despot who bears a rather marked resemblance to Adolf Hitler and a persecuted Jewish barber. Good satire can be powerful, and this film was: Released while the United States was still formally at peace with Germany, it stirred greater public attention and condemnation of the Nazis and Mussolini, anti-Semitism and fascism. (That said, Chaplin later recounted that he could never have made the satirical film even a year or two later, as the extent of the horrors in German concentration camps became clearer.) The choice to play both the tyrant and the oppressed man was an inspired one, underscoring the frightening but inescapable truth that we all contain a little bit of both characters. This is a strikingly pertinent film for our particular moment in history, and well worth dusting off and queueing up not only for its incredible craft but for its resonance as a study in projection. —Amy Glynn\n\nYear: 1946\n\nDirector: Jean Cocteau\n\nStars: Jean Marais, Josette Day, Mila Parély\n\nRating: G\n\nRuntime: 93 minutes\n\n\n\n\n\nWatch on HBO Max\n\nBefore there were Jerry Orbach and Angela Lansbury voicing animated animate household items, there was Jean Cocteau. This story’s been with us since the 18th century and rendered in countless iterations, so I’ll forego the plot summary and just say: From the fourth-wall-breaking preamble, in which the director entreats the audience to approach the film with inner-child-forward faith in the magic of fairy tales, to the end, Beauty and the Beast remains a treasure of subtle imagery, mesmerizing music, baroque opulence, sexual intensity and total indulgence in fantasy, aided by Jean Marais (Beast) and Josette Day (Belle) delivering enchanting performances. The themes explored here are traditional fairy tale tropes: innocence and greed, the transformative power of love, the fear of the unknown, magic. Cocteau was a celebrated poet as well as a filmmaker, and this is a strong example of how the two crafts inform one another, in the way it harnesses imagery to create metaphorical connections. Weird and powerful filmmaking. —Amy Glynn\n\nYear: 1972\n\nDirector: Andrei Tarkovsky\n\nStars: Donatas Banionis, Natalya Bondarchuk, Jüri Järvet\n\nRating: PG\n\nRuntime: 168 minutes\n\n\n\n\n\nWatch on HBO Max\n\nIn 2002, Steven Soderbergh adapted Stanislaw Lem’s classic science fiction novel into a perfectly fine and handsome movie. It’s the one time that the story of a Tarkovsky film has been duplicated, sharing source material, and it illustrates an important truth: Andrei Tarkovsky’s vision is singular, inimitable; it towers over all others. Where an accomplished director like Soderbergh made a serviceable sci-fi flick, Tarkovsky made visual poetry of the highest order. Tarkovsky’s artistic instincts rarely failed him, and even though it was a big budget genre picture, Solyaris takes risks with the same confidence of expression and the same depth of resonance as any other Tarkovsky film. The science fiction concept of the titular planet-entity allows Tarkovsky a new angle at the same themes pondered in many of his works: the pivotal roles of history and memory in our present and future; the fraught responsibility of the individual in responding to the calls of the sublime; the struggle to know truth. Tarkovsky’s long-take, free-associative aesthetic was predicated on his philosophy of filmmaking as “sculpting in time,” and in Solyaris there is a fascinating confluence between the way time and perception is manipulated by Tarkovsky, and the way those things are manipulated by Solyaris itself. Solyaris gives back the protagonist, astronaut psychologist Kris Kelvin (Donatas Banionis), his dead wife Hari (Natalya Bondarchuk), for what purpose is unclear. But Tarkovsky’s films work in a similar fashion; difficult to say exactly why they do what they do, yet they pull at the deepest roots of ourselves. They elicit emotional, meditative realities unlike any other. Like Kelvin’s resurrected Hari, the stimuli are simulacrums, symbols mined from a collective dream, but this does not diminish the worth of experiencing them. Sometimes they lead you to a place like Solyaris leads Kelvin: an island of lost memory—or perhaps of an impossible future, awash in the waters of some Spirit. That makes the unreal real; that gives the dream life. —Chad Betz\n\nYear: 1997\n\nDirector: Abbas Kiarostami\n\nStars: Homayoun Ershadi\n\nRating: PG\n\nRuntime: 100 minutes\n\n\n\n\n\nWatch on HBO Max\n\nAn existential tone poem of exasperating pace and deliberation, Taste of Cherry takes the long way in almost every conceivable fashion. Kiarostami stages a bare minimum of plot in his favorite setting—a moving vehicle—his middle-aged protagonist driving around the dusty roads of the Northern Iranian village of Koker. Mr. Badii (Homayoun Ershadi), a Range Rover-driving stoic, surveys stranger after stranger, inviting a few into his car to discuss a low-effort, high-paying job. He needs help committing suicide. The ensuing conversations are uncomfortable, philosophical, layered, sometimes labored. When Kiarostami isn’t taking viewers on a physical journey of unflinching confrontation, he’s likewise keeping us at a literal distance—behind windows and from wide, curiously flat shots, the isolation of the car contrasted with expansive landscapes of industrial machinery. Mr. Badii’s voice is at times obscured behind glass; we strain to see him through semi-sheer curtains or a ticket booth—we don’t even get a first name. We are denied the slightest of intimacy, determinacy or logic. In turn, there’s something transient and yet immemorial to Taste of Cherry, a confounding, transcendental bridge between extremes and experiences, cultures and politics, passenger and driver, viewer and Kiarostami himself, between our respective unknowns. —Amanda Schurr\n\nYear: 1936\n\nDirector: Charles Chaplin\n\nStars: Charles Chaplin, Paulette Goddard, Henry Bergman\n\nRating: G\n\nRuntime: 88 minutes\n\n\n\n\n\nWatch on HBO Max\n\nIf time is a flat circle, then Modern Times is like a flat sprocket—the travails of the Little Tramp navigating a mechanical world being so incessant and repetitive that elements like luck and hope only serve to spur along Chaplin’s farce even though they hold little grip on his characters’ futures. Not much changes for the Little Tramp throughout: He tries to survive, and yet the institutional system craps him back out to where he started, desperately hungry and penniless, left with nothing to do but try again. This was also Chaplin’s last go as the Tramp, and it’s easy to imagine that, throughout the film’s many misadventures—joined by equally good-natured partner in crime, the gamin (Paulette Goddard)—as he gets sucked up and sublimated into the modern industrial machine, this “disappearance” was kind of by design. It’s a weird way for Chaplin’s beloved character to go out, but so are the many ways in which Chaplin shows how the modern industrial machine becomes part of the Tramp, too. He may get squeezed through a giant, sprocket-speckled apparatus, becoming one with its schematics, but so too does the assembly line—with all that twisting, wrenching, and spinning—impress itself onto the Tramp, leaving him unable after a long shift to do anything but waggle his arms about as if he’s still on the assembly line. It’s no wonder, then, that the President of Modern Times’ factory setting bears a striking resemblance to Henry Ford: Chaplin, who toured the world following the success of City Lights, witnessed the conditions of automobile lines in Detroit, how the drudgery of our modern times weighed on young workers. The Great Depression, Chaplin seems to be saying, was the first sign of just how thoroughly technology can kill our spirits, not so much discarding us as absorbing our individuality. Modern Times, then, is a film with a conscious far beyond its time, a kind of seamless blending of special effects, sanguine silent film methods and radical fury.—Dom Sinacola\n\nYear: 1952\n\nDirector: Akira Kurosawa\n\nStars: Takashi Shimura, Yunosuke Ito, Miki Odagiri\n\nRating: NR\n\nRuntime: 144 minutes\n\n\n\n\n\nWatch on HBO Max\n\nWatching Ikiru, you get the feeling that Leslie Knope would love it: The film is as much a celebration of life as it is of one life in particular, but it’s also an affirmation of what local government can do if just one dogged public servant can grease the wheels of bureaucracy. Ikiru is one of Akira Kurosawa’s finest, a big-scale movie built to house a small-scale story, clocking in at just under two and a half hours as it details the final days of section chief Kenji Watanabe (Takashi Shimura), an aging government employee reeling from a stomach cancer diagnosis. (The doctors give him less than a year to live.) Over the course of Kurosawa’s film, he is guided by two very different figures—a debauched novelist (Yunosuke Ito), and the cheery Toyo (Miki Odagiri), one of Kenji’s subordinates—toward purpose and meaning. A simple life lived in service to others isn’t a life wasted, the film tells us as it throws jabs and japes at the hypocrisy of Kenji’s callous, apathetic peers. A sentimental message, maybe, but one that’s earnestly felt and well earned through the stature of Kurosawa’s craft. —Andy Crump\n\nYear: 1987\n\nDirector: Louis Malle\n\nStars: Gaspard Manesse, Raphael Fejto, Francine Racette\n\nRating: PG\n\nRuntime: 105 minutes\n\n\n\n\n\nWatch on HBO Max\n\nAu revoir les enfants portrays one French schoolboy’s (very limited) view of the Holocaust in a manner both reserved yet devastating. Set in a Catholic boarding school in France, Louis Malle’s Golden Lion-winning film follows a pampered rich boy (Gaspard Manesse) as he befriends a new classmate who is secretly a Jew (Raphaël Fejtö) harbored by the boarding school’s benevolent priest (Philippe Morier-Genoud). Malle based the film on his own childhood, effortlessly imbuing it with a quiet simplicity that allows its saddest, potentially melodramatic moments to be gut-wrenchingly real. Along with cinematographer Renato Berta, Malle merely lets the camera linger; in one scene, in particular, he films an empty passageway, beautifully emphasizing a terrible moment that his main character—and his audience—will never forget. —Jeremy Mathews\n\nYear: 1996\n\nDirector: Mike Nichols\n\nStars: Robin Williams, Gene Hackman, Nathan Lane\n\nRating: R\n\nRuntime: 119 minutes\n\n\n\n\n\nWatch on HBO Max\n\nYou know what’s awkward? When you’re a middle-aged gay Jewish South Beach drag club owner (Armand, played by Robin Williams) and your straight son shows up and asks for your blessing to marry his girlfriend who is the daughter of a Neocon senator (Gene Hackman) who heads something called “The Coalition for Moral Order.” You want to support your kid, but you don’t love being closeted by him, and the dinner meet-up ends up meaning you and your partner, Albert (Nathan Lane), are forced into a whole new level of drag in which you are straight, a cultural attaché to Greece, and married to the one-night stand straight-sexperiment (Katherine, played by Christine Baranski) that led to the conception of your son. Your partner’s offended, the Senator’s being investigated by the tabloids, tensions are running high and your houseboy Agador (Hank Azaria) has agreed to transform into a Greek butler named “Spartacus,” but let’s face it, tensions are running high on all sides-and that’s before your baby-mama gets caught in traffic and Albert sees the opportunity for the drag role of a lifetime. Fully Shakespearean hijinks ensue. The 1996 Mike Nichols remake of Edouard Molinaro’s La Cage Aux Folles was not really blistering social commentary, but beneath its glib feel-good star-vehicle exterior there are some depths you could easily miss while you’re distracted by the batshit-crazy and heavily sequined antics of Williams and Lane. It’s actually not only rambunctious and witty but, as with many of Robin Williams’ film roles, The Birdcage has a serious streak where a genuine investigation of personal identity is underway, and hypocrisy, acceptance, snobbery, and most of all, everyone’s individual style of “drag” (and hey, we all have one, even if we don’t always express it by putting on fake lashes and singing Sondheim) gets taken out for a much-needed exam. —Amy Glynn\n\nYear: 1964\n\nDirector: Masaki Kobayashi\n\nStars: Rentaro Mikuni, Tatsuya Nakadai, Katsua Nakamura, Osamu Takizawa, Noboru Nakaya\n\nRating: NR\n\nRuntime: 184 minutes\n\n\n\n\n\nWatch on HBO Max\n\nGhost stories don’t get much more gorgeous than the four in Masaki Kobayashi’s sprawling Kwaidan. Between two acerbically political and widely lauded samurai epics, Hara-kiri (1962) and Samurai Rebellion (1967), Kobayashi led what was then Japan’s most expensive cinematic production ever, an anthology film with its parts loosely connected by Lafcadio Hearn’s collection of Japanese folk tales and Kobayashi’s intuitive penchant for surreal, sweepingly lush sets. In “The Black Hair,” a selfish, impoverished ronin (Rentaro Mikuni) abandons his wife to marry into wealth, only to realize he made a dire mistake, plunging him into a gothic nightmare of decay and regret. “The Woman of the Snow” follows a craftsman (the always welcome Tatsuya Nakadai) doomed to have everything he loves stolen from him by a patient bureaucratic specter. The movie-unto-itself, “Hoichi the Earless,” pits the titular blind monk musician (Katsua Nakamura) against a family of ghosts, forcing the bard to recite—in hushed, heartbreaking passages on the biwa—the story of their wartime demise. Rapt with indelible images (most well known, perhaps, is Hoichi’s skin completely covered in the script of The Heart Sutra to ward off the ghosts’ influence), “Hoichi the Earless” is both deeply unnerving and quietly tragic, wrung with the sadness of Kobayashi’s admission that only forces beyond our control hold the keys to our fates. The fourth, and by far the weirdest, entry, “In a Cup of Tea,” is a tale within a tale, purposely unfinished because the writer (Osamu Takizawa) who’s writing about a samurai (Noboru Nakaya) who keeps seeing an unfamiliar man (Kei Sato) in his cup of tea is in turn attacked by the malicious spirits he’s conjuring. From these disparate fairy tales, plenty of fodder for campfires, Kobayashi creates a mythos for his country’s haunted past: We are nothing if not the pawns of all those to come before. —Dom Sinacola\n\n\n\nYear: 1985\n\nDirector: Jackie Chan\n\nStars: Jackie Chan, Maggie Cheung, Brigitte Lin\n\nRating: PG-13\n\nRuntime: 101 minutes\n\n\n\n\n\nWatch on HBO Max\n\nRemember that scene in The Blues Brothers where Jake and Elwood drive the Bluesmobile through a mall and wreck it up good? That’s basically what Jackie Chan does to a shopping center in Police Story, except it’s with his own two hands. Seriously, there’s enough breakaway glass in that one, nine-minute fight scene for ten martial arts movies. Chan plays a cop (again) who goes after bad guys (again). Why complicate the plot synopsis any more than that? The only sensible way to rank Jackie Chan movies is simply to focus on the action and the death-defying stunts. Chan has called Police Story his greatest film, and who are we to argue? —Jim Vorel\n\nYear: 1953\n\nDirector: Kenji Mizoguchi\n\nStars: Mitsuko Mito, Masayuki Mori, Eitaro Ozawa, Kinuyo Tanaka\n\nRating: NR\n\nRuntime: 98 minutes\n\n\n\n\n\nWatch on HBO Max\n\nDuring an incredibly prolific point at the end of his career, Kenji Mizoguchi released Ugetsu between The Life of Oharu (1952) and Sansho the Bailiff (1954), only three years before his death. Like in those two films, Mizoguchi set Ugetsu in feudal Japan, using the country’s civil war as a milieu through which he could explore the ways in which ordinary people are kept from seeing to their basest needs, ground instead to dirt by forces far beyond their control. So it goes with two couples: Genjuro (Masayuki Mori), a potter hoping to profit from wartime, and his wife Miyagi (Kinuyo Tanaka); Tobei (Eitaro Ozawa) and Ohama (Mitsuko Mito), who rightly indicts her husband’s dreams of being a well-decorated samurai as foolish, especially considering that Tobei shows no signs of physical mettle, let alone a brain with any sense of militaristic prowess. Ignoring both their wives’ grave concerns and the ecliptic tide of war, the two men set out to make one last big bid for fame and fortune, setting out only to find a country haunted, literally sometimes, by casualties. Ugetsu is a lushly elemental film, epitomized by Mizoguchi’s long takes and aloof mise-en-scene, highlighted the callousness of what he was trying to capture. Seamlessly shifting between ethereal setpieces—the iconic rendezvous between boats, set amidst a hellish waterscape of mist and portent is perhaps the crux around which the film unwinds—and grittier clusterfucks of mass pain in progress, Mizoguchi conjures up a sense of inevitability: No matter how much these characters learn about love or family or themselves, they are doomed. Misery unfolds supernaturally and pointlessly in Ugetsu—so much so that by the time anyone’s noticed that tragedy’s struck, it’s already well-burrowed into the bones of those at its mercy. —Dom Sinacola\n\nYear: 1962\n\nDirector: Agnès Varda\n\nStars: Corinne Marchand, Dorothy Blank, Antoine Bourseiller\n\nRating: NR\n\nRuntime: 90 minutes\n\n\n\n\n\nWatch on HBO Max\n\nHalfway through Agnès Varda’s sophomore film, the titular Cléo (Corinne Marchand), a pop singer awaiting the potentially devastating results of some sort of medical test, looks directly into the camera, weeping as she sings a song during an otherwise typical practice session. It’s a revelatory moment: Varda addresses her audience directly through her character addressing her audience directly, all while on the precipice of total dissolution. Cléo, a beautiful, burgeoning celebrity, seems to understand that she may be empty without her looks, just as she rails against the forces that put her in such an untenable position. In other words, realizing in that moment of melodrama, of the heightened emotion she knows all too well is the stuff of pop music at its most marketably patronizing, that her attractiveness may be soon over, she’s driven to tears, unable to reconcile her talent with her face, or her fragility with her livelihood, leaving it to the audience to decide whether she deserves our sympathy or not. If not, Varda wonders, then why not? Shot practically in real time, Cléo from 5 to 7 waits along with our character as she waits for life-changing news, floating from coffee shop to home to park to wherever, not doing much of anything with the life she has, the life she may find out she’s losing soon enough. She watches a silent film featuring cameos by Jean-Luc Godard and Anna Karina, meets a soldier on leave from the Algerian front (Antoine Bourseiller) who confesses he believes people are dying for nothing, drives past a murder scene and senses that the universe maybe has misdirected her bad luck towards another soul. One of the defining films of the Left Bank branch of the French New Wave (as opposed to those of the “Right Bank,” the more famous films of Truffaut and Godard, the movement’s more commercial, cosmopolitan cinephiles), Cléo from 5 to 7 is a fever dream of the ordinary, a meditation on the nothingness of everyday living, as existential as it is blissfully bereft of purpose. —Dom Sinacola\n\nYear: 2003\n\nDirector: Fernando Meirelles, Kátia Lun\n\nStars: Alexandre Rodrigues, Leandro Firmino da Hora, Phellipe Haagensen, Douglas Silva, Alice Braga, Seu Jorge\n\nRating: R\n\nRuntime: 129 minutes\n\n\n\n\n\nWatch on HBO Max\n\nOriginally released in January 2003 to critical praise, Fernando Meirelles’ masterful yet brutal City of God receded from view until Miramax re-released it for Oscar consideration. And while it failed to even garner a foreign-language-film nomination that year, the alternately intense and intimate depiction of Rio’s desperate favelas has only grown in stature and power. Based on the novel by Paulo Lins (and adapted by Bráulio Mantovani), Meirelles turned an unflinching eye on a world forgotten by the wealthy and powerful, ignored by police and indifferent to law and order. City of God set the template for other shocking urban films to follow (not to mention a revival of “favela funk” by music-marauders like Diplo and M.I.A.), but whereas other cinematic studies like Gomorrah (about modern Sicily) and the documentary Dancing with the Devil wallow in such viciousness, this film plunges deeper, grips harder, and yet always allows glints of humanity into such darkness. City of God’s harrowing depiction of daily violence in the favelas exemplifies in shocking detail the Hobbesian view of life as “nasty, brutish and short,” but the film never casts judgment. While chaos and bloodshed rule the world of protagonist Rocket and those of his generation—psychotic druglord Li’l Zé, groovy playboy Benny and solemn Knockout Ned (singer Seu Jorge, in his breakout role)—City of God elucidates an underlying symmetry, exhibiting if not poetic justice, then the street version of the same. —Andy Beta\n\nYear: 2021\n\nDirector: Jon M. Chu\n\nStars: Anthony Ramos, Corey Hawkins, Leslie Grace, Melissa Barrera, Olga Merediz, Daphne Rubin-Vega, Gregory Diaz IV, Jimmy Smits\n\nRating: PG-13\n\nRuntime: 143 minutes\n\n\n\n\n\nWatch on HBO Max\n\nIn 2018, director Jon M. Chu imbued the standard rom-com plot of his Crazy Rich Asians adaptation with classical Hollywood decadence, hanging it all on a framework of well-constructed cultural specificity. It was big, spectacular and embarrassingly novel for an American movie of its kind. Now, in 2021, we’re getting Chu’s version of In the Heights, the musical that put Lin-Manuel Miranda on the map (and won him his first Tony). It’s incredible. The exciting electricity of a non-white blockbuster cast becoming superstars before your eyes, the maximalist style of a modern smash updating its influences, the intertwining of hyper-specific and broad themes—Chu’s strengths and his cast soar, bringing In the Heights as high as it’s ever been. It’s the best Hollywood musical in years. Tracking a few sweltering days in New York’s Washington Heights, the film meshes Do the Right Thing’s hot summer tension with School Daze’s teasing affection for its song-slinging genre. It just so happens that the corner we’re on is the collision point for the intersecting lives and romances of two couples—bodega boss Usnavi (Anthony Ramos) and aspiring designer Vanessa (Melissa Barrera), and dispatcher Benny (Corey Hawkins) and recent Stanford dropout Nina (Leslie Grace)—who serve as the neighborhood’s most vocal examples of those that life’s rigged lottery left putting their patience and faith in a daily scratcher. There’s no real pivotal struggle (especially not between Sharks and Jets, though wouldn’t it be incredible if Steven Spielberg’s West Side Story gave 2021 two great NYC musicals?) aside from the ever-present and myriad anxieties of Nth generation Americans living in a racist country. Yes, those familiar with the themes of Miranda’s Hamilton will find a similar rhythm and thematic flavor here—though with the showtunes’ style slipping into a salsa or bolero as easily as the rap bars dip in and out of Spanish—but with a purity of form and meaning that’s lyrical critiques and observations are even sharper than those mired in the phenomenon’s historical metaphor. In fact, almost all the songs are bangers that keep emotions high—you’ll weep, you’ll cheer, you’ll hum the songs to yourself on the way out of the theater—bolstered by orchestration that, while restrained when limited to its lovers, explodes when the choruses finally incorporate the neighborhood at large. Head-bobbing bops and moving melodies match rhythmic editing and a vibrant, fittingly populous background that’s constant choreography sustains the perpetual, organic flow of a community. In the Heights is great, and its greatness is amplified by the joy that it will inspire in theaters full of people for years to come.—Jacob Oller\n\nYear: 1959\n\nDirector: Alfred Hitchcock\n\nStars: Cary Grant, Eva Marie Saint\n\nRating: NR\n\nRuntime: 137 minutes\n\n\n\n\n\nWatch on HBO Max\n\nWhen a mild-mannered ad man (Cary Grant, in some seriously natty threads) is mistaken for a secret agent and finds himself in the crosshairs of a dangerous spy, suspense is a given. Add a romantic entanglement with the epically gorgeous Eva Marie Saint, who might or might not be in cahoots with the spies, and you’ve got Hitchcock at his tongue-in-cheek best, turning a surrealist fever dream of a plot into something light-handed and smooth. North by Northwest might also be his most utterly entertaining and arguably his most visually stunning, with some of the most iconic scene compositions in film history (particularly, though not solely, the incredibly shot sequence at the top of Mount Rushmore). Saint’s cool and intriguing, and if Grant ever had one day in his life where he wasn’t unbelievably charming, it was not captured on film. This is definitely a thriller, too, but it’s also witty as hell (maybe even a little self-satisfied, but this viewer isn’t complaining—if anyone’s earned that, Alfred Hitchcock has). Skillful, clever, charming—if for some reason you don’t already know why Hitchcock is an enduring god of cinema, this film ought to clear it up for you. —Amy Glynn\n\nYear: 2004\n\nDirector: Martin Scorsese\n\nStars: Leonardo DiCaprio, Cate Blanchett, Kate Beckinsale, John C. Reilly, Alec Baldwin, Alan Alda, Ian Holm, Jude Law\n\nRating: PG-13\n\nRuntime: 170 minutes\n\n\n\n\n\nWatch on HBO Max\n\nWith Howard Hughes’ larger than life personality and those action-packed scenes of him flying (and crashing) planes, it’s hard not to first think of the famous businessman and aviator as a sort of superhero: A man capable of almost any feat, of withstanding any sort of struggle. But a movie that only captures that side of Hughes’ life would be an incomplete one. A hollow one. What makes The Aviator one of the greatest biopics of all time is that it shows Hughes’ vulnerabilities as well, most notably of which was his battle with Obsessive-Compulsive Disorder. Leonardo DiCaprio’s portrayal of Hughes at his lowest, during Hughes’ anxiety-ridden spirals is far more compelling and suspenseful than the Beverly Hills plane crash scene itself.—Anita George\n\nYear: 1955\n\nDirector: Satyajit Ray\n\nStars: Runki Banerji, Kanu Banerji, Subir Banerji\n\nRating: NR\n\nRuntime: 126 minutes\n\n\n\n\n\nWatch on HBO Max\n\nSatyajit Ray’s Pather Panchali is, depending on who you ask, either the saddest movie ever made or one of the saddest—though whether the film makes you weep more or less is, perhaps, besides the point. Pather Panchali’s influence may be best evinced on a micro scale, in specific relation to Indian cinema, presenting a watershed moment that sparked the Parallel Cinema movement and altered the texture of the country’s films forevermore. Which isn’t proof of Pather Panchali’s actual substance, though let’s be realistic here: Ray’s masterpiece is an aching, vital movie crafted to transmute the harshest rigors of a childhood lived in rural India into narrative. Maybe it’s presumptuous for an American critic with no frame of reference for Pather Panchali’s cultural context to describe the film as “true to life,” but Ray is so good at capturing a small, specific world with his camera that we come to know, to understand, the life of young Apu, regardless of who we are or where we come from. Isn’t that just the absolute definition of cinema’s transporting power? —Andy Crump\n\nYear: 1977\n\nDirector: David Lynch\n\nStars: Jack Nance, Charlotte Stewart, Allan Joseph\n\nRating: R\n\nRuntime: 90 minutes\n\n\n\n\n\nWatch on HBO Max\n\nIt can be a painful experience to watch a film and have no idea what it’s about—to have the film’s meaning nagging at the core of you, always out of reach. Yet, that’s exactly the molten, subterranean fuel that pushes David Lynch’s visions forward, and with his debut, the perplexing and terrifying Eraserhead, the director offers no consolation for the encroaching feeling that with him we’ll never find any sort of logical mooring to keep our psyches safe. A simple tale about a funny-haired worker (Jack Nance) trundling nervously through a phantasmagoric industrial landscape, in the process fathering a mutant turtle-looking baby who he’s left to raise after his new wife abandons her “family,” Eraserhead is an astounding act of burying independently-minded cinematic experimentation in the popular consciousness. You may not know much about Eraserhead, but you probably know what it is. And whether or not it’s a meditation on the horrors of fatherhood, or a glimpse of the weird devolution of physical intimacy in a dying ecosystem, or a groundbreaking work of DIY sound design, or whatever—Eraserhead is a black hole of influence. It’s gross, it’s soul-stirring, it’s a visceral nightmare, and to this day, it’s unlike anything I’ve ever seen before. Which may or may not be a compliment. I can’t be sure. —Dom Sinacola\n\nYear: 1969\n\nDirector: George Roy Hill\n\nStars: Paul Newman, Robert Redford\n\nRating: PG\n\nRuntime: 110 minutes\n\n\n\n\n\nWatch on HBO Max\n\nThe top-grossing film of 1969 and four-time Oscar winner was an anachronistic wonder that poked at the stoic bravura of the traditional Western: Consider the broad buddy humor between its pitch-perfect leads, Paul Newman and Robert Redford; the poppy, Burt Bacharach-Hal David-penned score and that theme song, “Raindrops Keep Fallin’ on My Head”; and William Goldman’s wry, self-aware script. From the first sepia-saturated moments of George Roy Hill’s take on the Old West, Butch Cassidy and the Sundance Kid rewrote history, literally: Author Goldman famously wanted to tell the story of the titular outlaws’ flight to South America but didn’t want to do sufficient research for a novel-length treatment. And thus, “Most of what follows is true,” the film winks at its start. Gorgeously shot by Conrad Hall, the film is a deftly balanced mix of reverential genre elegy and sometimes deadpan, sometimes slapstick comedy. At its heart is then box office superstar Newman and comparatively small-potatoes actor Redford, the latter taking over after Steve McQueen backed out, balking over whose name would be billed first in the credits. As the Kid’s girlfriend, Katharine Ross complicates the duo’s relationship and lends nuance to what is essentially a love story. Curiously, Butch and Sundance’s posse, the Hole in the Wall Gang, was known as the Wild Bunch in real life but was changed for the screen to avoid confusion with another Western set for release a few months prior to its own premiere. —Amanda Schurr\n\nYear: 1941\n\nDirector: John Huston\n\nStars: Humphrey Bogart, Mary Astor, Peter Lorre, Sydney Greenstreet\n\nRating: PG\n\nRuntime: 101 minutes\n\n\n\n\n\nWatch on HBO Max\n\nReferred to by many as the first major noir (after the more obscure 1940 film Stranger on the Third Floor), this John Huston classic set the bar for the archetypal detective, the subgenre as a whole, and the rest of star Humphrey Bogart’s career. On the surface a murder mystery revolving around yet another archetype, that of the titular MacGuffin, The Maltese Falcon is in essence a character study, a definitive assurance of masculinity and the cool objectivity it entails, by way of one Sam Spade. Bogart’s antihero is a man of honor, as it suits him—he has no qualms about kissing his dead partner’s widow while the body’s still warm, or turning in the guilty woman he loves to the police. He’s nobody’s “sap.” Interestingly, Spade’s creator, Dashiell Hammett—who once worked as a P.I.—called the character “a dream man in the sense that he is what most of the private detectives I worked with would like to have been, and, in their cockier moments, thought they approached.” In Bogart’s brusque yet smooth hands, that sounds about right. Likewise, this is the adaptation to which vastly inferior attempts, including a 1931 version of the same name and 1936’s Satan Met a Lady, could only aspire. It is impeccable in every sense. Huston also penned the screenplay, on Howard Hawks’ advice, almost verbatim from Hammett’s hard-boiled novel. He painstakingly storyboarded the drama to include complex camerawork and lighting schemes, evocative POVs, and an uninterrupted seven-minute take whose logistics boggle the mind. The violent, stylized set pieces are as visceral as the verbal confrontations. Aside from Bogie’s legendary turn, the other performances are spot-on: among them, an already scandalized Mary Astor as the femme fatale; Sydney Greenstreet (Casablanca) as hulking baddie Kasper “Fat Man” Gutman—astonishingly, his film debut; and Peter Lorre as an obviously gay associate of Gutman’s whose homosexuality was muted for the folks at the Hays Code. One of the first titles to be preserved in the Library of Congress’ National Film Registry, The Maltese Falcon is landmark filmmaking. —Amanda Schurr\n\nYear: 2021\n\nDirector: Dan Lindsay, TJ Martin\n\nRuntime: 117 minutes\n\n\n\n\n\nWatch on HBO Max\n\nTina Turner’s story is one of promise: Promises kept and broken, promise stifled then fulfilled. A vow of loyalty to her abusive ex-husband Ike suppressed her own potential. She might not be a comeback story, but she’s certainly a story of escape, growth and self-actualization in the face of personal and industrial adversity. The singer’s status in musical history is unimpeachable, but those recounting her story tend to drift towards its most lurid tabloid tellings. Tina directors Dan Lindsay and TJ Martin attempt to subvert this legacy of salacious headlines by examining it from the inside out. The documentary doesn’t fully escape the exploitative feeling of the talk show circuit it critiques, but putting it in context with new interviews and archival material of Turner explains what it’s all got to do, got to do with it. Performances of soaring freedom, where Turner struts and shakes on stage like the rock god she truly is, convert new disciples with every long-legged kick and howl. Martin, Lindsay and editors Taryn Gould and Carter Gunn crosscut live performances over tracks with an energy that isn’t random or erratic, but with the same glowing confidence of their subject. Her voice may be a raw force of nature, but her performances are all skill and professionalism. Together, combined across stages and eras to find the biggest and best movements to emphasize the songs, her magnetism is inescapable. Just when we’ve comfortably settled into a concert doc’s rhythms, hypnotized by her charisma and ability, bang—we’re back on her past. It took her the whole first half of the film to leave and now what she’s left is dragged back out for her. It’s a sharp mimic of Tina’s career. Even soaring as the biggest pop star in the world, people focused on the scars. Despite its pain, Tina is a feel-good epic, an escape from the systemic internal and external forces that conspired to corrupt and consume one of the most influential individuals of a generation. Its association and inherent need to power through a lifelong link with Tina’s abusive ex-partner can sometimes feel a bit hypocritical, even knowing that by doing so, Tina offers more freedom than pain. It has, in some ways, the same purpose as What’s Love Got to Do with It. It is educational, leading to equanimity. Where What’s Love Got to Do with It was a midlife coming-of-age—a “Hello, here’s my story”—Tina is a redefining, empowering farewell that adds perspective as she tips her hat and has her happily ever after out of the limelight.—Jacob Oller\n\nYear: 1940\n\nDirector: George Cukor\n\nStars: Katharine Hepburn, Cary Grant, James Stewart, Ruth Hussey, John Howard\n\nRating: NR\n\nRuntime: 112 minutes\n\n\n\n\n\nWatch on HBO Max\n\nCan you believe there was a time when Katharine Hepburn was known in Hollywood as “box office poison”? This adaptation of a Broadway hit was a vehicle to get her career back on track after a series of flops. Her performance as icy heiress Tracy Lord in this “remarriage” comedy is a force of nature. Happily, her no-longer-drunken ex is played by Cary Grant, who is a fabulous foil. Jimmy Stewart and Ruth Hussey round out the cast as reporters in not-so-clever disguise. Pretty much everything about this movie is a pure delight, and the script is a masterpiece. —Amy Glynn\n\nYear: 1997\n\nDirector: Hayao Miyazaki\n\nStars: Yôji Matsuda, Yuriko Ishida\n\nRating: PG-13\n\nRuntime: 134 minutes\n\n\n\n\n\nWatch on HBO Max\n\nOne persistent theme across all of Studio Ghibli’s work, in particular Miyazaki’s, is that there rarely are any true villains. This sentiment is perhaps most apparent in Princess Mononoke, Miyazaki’s seventh film and notably one of his darkest. Set during the early 16th century, the film follows the story of Ashitaka (Yôji Matsuda), the last remaining prince of a small eastern village who is wounded while defending his home from a wild boar overtaken by a malicious spirit. Mortally cursed with no hope of a cure, Ashitaka takes it upon himself to journey to the West to discover (and halt) whatever malevolent force is causing this havoc. What he finds there is more complicated than he could have imagined: a settlement of humans mining the region to build a home while fending off the forces of the nearby forest who see their world being destroyed. Later he meets San (Yuriko Ishida), a young woman raised by the clan of wolves who defend the forest as he attempts to broker an uneasy peace between the two sides. Accordingly, Princess Mononoke is the epitome of Miyazaki’s appeal to environmentalism, melding traditional fantasy and Japanese folklore to create one of the director’s most serious and adult-oriented works. The film’s violence is a sharp divergence from Miyazaki’s relatively goreless body of work, with limbs severed with callous abandon and wild boar gods weeping blood as they trudge on a death march through the forest. It’s an exhilarating, heartbreaking and colossal film whose message will leave audiences changed by its final scene. Quite simply, it is everything that one would come to expect from the pedigree of Hayao Miyazaki. —Toussaint Egan\n\nYear: 1973\n\nDirector: René Laloux\n\nStars: Jennifer Drake, Eric Baugin, Jean Topart\n\nRating: PG\n\nRuntime: 71 minutes\n\n\n\n\n\nWatch on HBO Max\n\nIt doesn’t matter if you’re watching René Laloux’s excellent, eccentric Fantastic Planet for the first time or the fortieth, under the influence or stone sober: The film is such a one-of-a-kind oddity in cinema that each viewing feels like its own wholly unique experience. Put simply, there’s nothing quite like it. If you’ve yet to see this masterwork of 1970s psychedelia-meets-social-commentary, you’re missing out. If you have seen it, chances are you haven’t seen anything quite like it since, because there isn’t much in animated cinema to match it. The closest you’ll get is Terry Gilliam’s paper strip animation stylings in Monty Python’s Flying Circus, or maybe the still painting approach of Eiji Yamamoto’s Belladonna of Sadness. Neither of these equate with Fantastic Planet’s visual scheme, though, which just underscores its individuality. Where does a movie like Fantastic Planet come from? How does it even get made? Laloux has offered few answers over the years, though the documentary Laloux Sauvage holds some insight into how his mind works. Maybe the answers aren’t worth pursuing in the first place, and maybe the best way to understand Fantastic Planet is just to watch it, and then watch it again. —Andy Crump\n\nYear: 2015\n\nDirector: George Miller\n\nStars: Tom Hardy, Charlize Theron, Nicholas Hoult, Hugh Keays-Byrne, Rosie Huntington-Whiteley, Riley Keough\n\nRating: R\n\nRuntime: 120 minutes\n\n\n\n\n\nWatch on HBO Max\n\nThree decades since we last visited George Miller’s arid, dystopian world, the latest installment stars Tom Hardy as Max Rockatansky with Charlize Theron as his co-lead—a casting coup. But the long wait had Miller swinging for the fences. Try naming a modern blockbuster that has as much chutzpah as Mad Max: Fury Road. You can’t, because there isn’t one. This is what happens when you lay out all your crazy on the screen at once: glorious, crackling entertainment. Every single dollar of its reported $150 million budget is in the frame at all times, but Miller is so unpretentious that you won’t catch the price tag. Real people cruise in real vehicles across real expanses of desert. When the film does lean on computers, it’s to fill in the margins or summon the occasional dust storm. Miller defines his aesthetic through physical texture, tells story through action, and shows no interest in the routine of contemporary Hollywood spectacle. What’s more, Mad Max: Fury Road is an inclusive effort that invites us to join its heroes in breaking down gender dichotomies. George Miller has made a phenomenal action film with a righteous cause, a movie that layers smart commentary atop jaw-dropping set pieces. May he ride eternal, shiny and chrome.—Andy Crump\n\nYear: 1969\n\nDirectors: Albert Maysles, David Maysles, Charlotte Zwerin\n\nRating: NR\n\nRuntime: 91 minutes\n\n\n\n\n\nWatch on HBO Max\n\nThe Maysles’ ode to the can-do attitude of the so-called “Greatest Generation” is an ever-saddening study in charisma: who has it, what it is and just how deeply, unintentionally ingrained it is in our whole model of the American Dream. In following four Bible salesmen, each with an animalistic nickname to handily keep them apart, we’re able to observe the pitch process from seemingly every persuasive angle. Some salesmen are wise and respectful, others enthusiastic and joking, and still others resort to bullying nervous stay-at-home moms or emasculated husbands into signing a pay stub. Couple that ethical conundrum with the product they’re hocking—the original “Good Book,” apparently—and it’s no surprise when one of the salesmen (Badger, who hits a streak of shitty luck, never living up to his name) loses all hope in his vocation and spends every night in his shared hotel room complaining to his fellow salesmen that what they’re doing is existentially bound to fail. And yet, Rabbit has no trouble keeping his sales up, and the Bull always walks out with scribbled-on chits. Badger just happens to be a dying breed of salesman, a guy whose charisma refuses to adapt. What’s worse: He’s got no one to blame but himself. And capitalism. —Dom Sinacola\n\nYear: 2013\n\nDirector: Hayao Miyazaki\n\nStars: Hideaki Anno, Naoko Satomi, Hidetoshi Nishijima\n\nRating: PG-13\n\nRuntime: 127 minutes\n\n\n\n\n\nWatch on HBO Max\n\nOf all of Miyazaki’s most persistent tropes and motifs, there are none more consistently threaded throughout the whole of his body of work than that of the depiction of flight. So it’s no surprise that The Wind Rises, his 11th and final feature film as of this writing, would focus squarely on the life of Japanese aviation engineer Jiro Horikoshi and the complicated legacy of his creations. A story of how a creator cannot control what their work becomes, only the dedication and craft to which they pour into the work itself, The Wind Rises relates not only to the pacifist cultural identity of contemporary Japan but also, on a personal level, to Miyazaki himself. The film is nothing short of Miyazaki’s final artistic testament to humanity’s paradoxical capacity for both the redemptive act of creation and dogged pursuit of self-annihilation. It is in no uncertain terms a conclusion—if not to Miyazaki’s venerable career as one of the undisputed patriarchs of modern Japanese animation, then a thematic coda that ties an elegant knot at the end of his storied career as a director. —Toussaint Egan\n\nYear: 1966\n\nDirector: Ingmar Bergman\n\nStars: Liv Ullmann, Bibi Andersson\n\nRating: NR\n\nRuntime: 84 minutes\n\n\n\n\n\nWatch on HBO Max\n\nIngmar Bergman didn’t seem to have any answers to the questions he raised in this film—or those raised in many others—but he kept asking them, bringing his stories to appropriately dramatic conclusions without cauterizing all of his characters’ wounds. He was a smooth, precise director, but one who worked within the conventions of ?lm grammar rather than pressing at the medium’s edges—most of the time. Persona not only acknowledges this medium but rips it wide open. Liv Ullmann and Bibi Andersson—who both worked with Bergman many times—play a stage actress and a nurse, respectively. The actress has had a breakdown—rendered mute in the middle of a performance—and she’s recuperating at a seaside cottage. This simple plot is the skeleton for a very complex examination of identity and psychology. The two women seem to merge at certain points—perhaps they’re two sides of the same woman—and their histories bleed into the present through a variety of cinematic techniques, from the ?rst shot of a projector lighting up and the infamous, dazzling montage that seems to unearth the unconscious, to the moment in the middle of the film, when the stock seems to burn and run in reverse. Persona doesn’t reveal its meaning easily; Bergman was forever balancing the world of the theater with the world of ?lm, an artist with a split personality. —Robert Davis\n\n\n\nYear: 1976\n\nDirector: Elaine May\n\nStars: Peter Falk, John Cassavetes, Ned Beatty, William Hickey\n\nRating: R\n\nRuntime: 107 minutes\n\n\n\n\n\nWatch on HBO Max\n\nEveryone’s got a friend like Nicky (John Cassavetes), though the Nickys of the world exist on a sliding scale. Not every Nicky works for the mob, or womanizes, or betrays the mob, or generally acts like a large diameter asshole at any provocation or under any amount of strain. But strip Mikey and Nicky of its genre particulars, its gangster trappings, and what remains is a recognizable story of two friends at loggerheads, joined by the history of their lifetimes, inseparable, and yet chemically volatile when standing in arm’s reach of each other. Mikey (Peter Falk) and Nicky go way back. They’ve been pals since always, since before they became small time crooks, since before their parents shuffled their mortal coils. Mikey’s the equanimous one, Nicky the hothead, though Mikey’s only cool and composed when stood next to Nicky. “You give me that in 30 seconds or I’ll kill you, you hear me?” he roars at a diner counterman, desperate for a cup of cream to help soothe Nicky’s ailing stomach. Neither is especially good to women, and both are in boiling water, though Mikey’s only up to his toes and Nicky’s waist-deep, having ripped off his boss and earned a hit on his forehead. The most honest move Mikey can make is to leave Nicky to the mob’s mercies, but he’s not an honest man and honestly, male relationships aren’t all that honest. Elaine May understands how quickly men oscillate between emotion and violence, rancor and play. One minute Mikey’s fretting over Nicky catching a cold. The next, they’re scrapping in the street, as if their friendship never mattered in the first place. Amazing how easily men can transgress from adults to boys, whether they’re trading blows or just gleefully racing one another down the sidewalk. Even when they’re all grown up, they’re still children at heart. Over 40 years later, Mikey and Nicky has aged better than both of them. —Andy Crump\n\nYear: 1977\n\nDirector: Nobuhiko Obayashi\n\nStars: Kimiko Ikegami, Miki Jinbo, Kumiko Ohba\n\nRating: NR\n\nRuntime: 88 minutes\n\n\n\n\n\nWatch on HBO Max\n\nMovies are rarely, if ever, as whirringly rich and strange as House. The 1977 fairy-tale-as-fever-dream from Japanese director Nobuhiko Obayashi was the debut of a guy who was known mostly for his TV commercials. Given a shot at making his first feature by a struggling studio that had nothing to lose, Obayashi did what any aspiring auteur would do: He went to his 11-year-old daughter Chigumi for ideas. What they came up with is a tragi-comic festival of the uncanny about a posse of seven Japanese schoolgirls, a maiden aunt with heartbreaking secret, her freaky-ass white cat named Snowflake and the house of the title, an ooky-spooky hallucination out of gothic myth and Japanese folklore, jazzed by an animated, ADD-afflicted spirit like something from the minds of Tex Avery and Busby Berkeley on crack. Though: No summary really does House justice, and every little thing about it demands attention, from the schoolgirls themselves—precocious archetypes who go by the nicknames Gorgeous, Melody, Fantasy, Prof, Sweet, Mac and Kung Fu—to the anything-goes flourishes of gimmick and technique, which evoke everything from silent film to children’s shows, classic surrealist cinema to Italian giallo. Obayashi crams every frame with a surplus of mad ideas, as if his background in 30-second spots demanded he never let the screen remain calm for an instant. House suggests that the nitrous-oxide hyperdrive of Japanese pop culture—as vivid now as ever—is a brilliantly imagined, if not in fact transcendental brand of therapy. —Steve Dollar\n\nYear: 1933\n\nDirectors: Merian C. Cooper, Ernest B. Schoedsack\n\nStars: Fay Wray, Robert Armstrong, Bruce Cabot\n\nRating: NR\n\nRuntime: 100 minutes\n\n\n\n\n\nWatch on HBO Max\n\nThere had been monster movies or “creature features” before Kong, but it became the key reference point for that entire film demographic from the time of its release until the genre underwent an atomic-age reimagining with the likes of The Beast from 20,000 Fathoms in 1953 and Them! in 1954. Likewise, it set the bar on its special effects at such a high level that in many instances, shots and sequences from King Kong weren’t suitably duplicated for decades to come. Much of the credit belongs to pioneering stop-motion animator Willis O’Brien, who was inventing new techniques on the set of Kong on a daily basis, laying a foundation for an entire field of visual effects that are still being refined by studios such as Laika today. Those techniques were likewise carried on and further refined by O’Brien’s arguably more famous protege, Ray Harryhausen, who used them to great effect in the second golden age of the monster movie, from the 1950s through the 1970s. Kong, though, stands as an unparalleled achievement for its time—far grander and more ambitious in scope than most anything you can compare it to back then. On one hand it’s a rollicking adventure film, with a classic “journey into the unknown” plot that is still being recycled for modern monster installments like Kong: Skull Island. At the same time, though, it was likewise an interesting experiment in genre-blending—an FX-driven adventure-drama film with horror elements and no clear-cut, traditional “antagonist.” Carl Denham might fit the bill, but he’s better described as a naive dreamer with stars in his eyes, oblivious to the ethical quandary of shanghaiing a huge beast to display in the middle of New York City. Kong, meanwhile, is a misunderstood creature, operating on the sense of self preservation he learned in a home where he’s only ever known a daily fight for survival against a neverending stream of monsters. The film’s empathy for Kong, and its condemnation of the hubris that led to his ascent of the Empire State Building, are what helped make the story such an emotionally affecting classic. —Jim Vorel\n\n\n\nYear: 1988\n\nDirector: Hayao Miyazaki\n\nStars: Noriko Hidaka, Chika Sakamoto, Shigesato Itoi\n\nRating: G\n\nRuntime: 87 minutes\n\n\n\n\n\nWatch on HBO Max\n\nMy Neighbor Totoro is not only Miyazaki’s most iconic film to date, it’s also an all but perfect family film that manages to distill the essence of childhood whimsy down to its purest state. Set in 1958, the film follows university professor Tatsuo Kusakabe (Shigesato Itoi) and his daughters Satsuki (Noriko Hidaka) and Mei (Chika Sakamoto) as they move into an old house along the countryside in order to be closer to their mother, who is recovering from a long illness. We see the world through the girls’ eyes: leaping through the fields along the house, chasing skittering dust mites, tumbling down holes in the base of trees to land safely on the bulbous stomach of a benevolent spirit animal. My Neighbor Totoro was revolutionary for its time for luxuriating on quiet contemplative moments in a time when most of anime was otherwise dominated by the chase from one flash to the next spectacle. In this way, the film has a sort of timeless appeal, disarming audiences new and old of their cynicisms and suspicions with beautiful settings, empathetic characters and an infectious marching band theme. The late film critic Roger Ebert described it best, “My Neighbor Totoro is based on experience, situation and exploration—not on conflict and threat.” It’s a film sprung fully formed from the imagination of a master animator, a movie about the everyday magic of being a child and the simple power of meeting the world with an open heart. —Toussaint Egan\n\nYear: 1959\n\nDirector: Georges Franju\n\nStars: Édith Scob, Pierre Brasseur, Francois Guerin\n\nRating: NR\n\nRuntime: 91 minutes\n\n\n\n\n\nWatch on HBO Max\n\nI remember seeing my first Édith Scob performance back in 2012, when Leos Carax’s Holy Motors made its way to U.S. shores, in which she donned a seafoam mask, every bit as blank and lacking in expression as Michael Myers’, in the film’s ending. I thought to myself, “Gee, that’d play like gangbusters in a horror movie.” What an idiot I was: Scob had already appeared in that movie, Georges Franju’s Eyes Without a Face, an icy, poetic and yet lovingly made film about a woman and her mad scientist dad, who just wants to kidnap young ladies that share her facial features in hopes of grafting their skin onto her own disfigured mug. (That’s father of the year material right there.) Of course, nothing goes smoothly in the film’s narrative, and the whole thing ends in tears—plus a frenzy of canine bloodlust. Director Franju plays Eyes Without a Face in just the right register, balancing the unnerving, the perverse and the intimate, as the most enduring pulpy horror tales tend to do. If Franju gets to claim most of the credit for that, at least save a portion for Scob, whose eyes are the single best special effect in the film’s repertoire. Hers is a performance that stems right from the soul. —Andy Crump\n\nYear: 1957\n\nDirector: Ingmar Bergman\n\nStars: Max von Sydow, Bengt Ekerot, Bibi Andersson\n\nRating: NR\n\nRuntime: 97 minutes\n\n\n\n\n\nWatch on HBO Max\n\nLike any cultural touchstone, any ubiquitous landmark of the arts more mitotically absorbed than actually experienced, The Seventh Seal is bound to be misremembered. We know well the chess game with Death (Bengt Ekerot), as well as Death’s get-up—a sort of gothic mix between Musketeer and monk—etched into the firmament of our pop obsessions (for most my age, it was in Bill and Ted’s Bogus Journey that the bone-white face and cape were first encountered), even if we’ve never actually seen the film. We know well the name of director Ingmar Bergman or that of star Max von Sydow, even if we aren’t familiar with their work, so ingrained into any working conception of “international cinema” are they, much of which is due to The Seventh Seal. We know well the dour chiaroscuro of Swedish cinema, the arch-symbolic pretension of art house stuff that squeezes all mirth from every orifice of the viewer. But do we forget how little of this movie is the chess game—how dimwitted Death can be? How funny The Seventh Seal actually is? “Is it so cruelly inconceivable to grasp God with the senses?” asks knight Antonius Block (von Sydow). “What is going to happen to those of us who want to believe but aren’t able to?” With The Seventh Seal, a simple story about a jaded knight returning from the Crusades to find that the world he fought for has seemingly been abandoned by God, Bergman sought clarity in the problem of faith—he wanted to map the vast spiritual terrain between experiencing and knowing, between feeling and believing. The reason why today the film still resonates, why we know the movie without having to experience it, is because of that clarity in Bergman’s vision: The Seventh Seal is all symbol, metaphor, allusion—but what it’s symbolic of, a metaphor for or alluding to isn’t too hard for any of us to figure. When the knight asks a question, God answers with silence—and there’s little humans understand better than how that feels. —Dom Sinacola", "images": ["https://cdn.pastemagazine.com/www/articles/2021/05/18/spirited-away-header-low.jpg"], "top_img": "https://cdn.pastemagazine.com/www/articles/2021/05/18/spirited-away-header-low.jpg", "keywords": [], "authors": ["Garrett Martin", "Paste Staff", "Jim Vorel", "Dianna Shen", "Reuben Baron", "Anna Govert", "Tv Writers", "Josh Jackson", "The Paste Tv Staff", "Allison Keene"], "canonical_link": "https://www.pastemagazine.com/movies/hbo-max/best-movies-on-hbo-max/", "title": "The 50 Best Movies on HBO Max, Ranked (October 2022)", "meta_data": {"title": "50 Best Movies on HBO Max Ranked - Paste Magazine", "description": "HBO Max settles in with a cinematic smorgasbord of French New Wave, documentaries, silent films, sci-fi staples, psychedelic monster movies and, of course, Studio Ghibli masterpieces.", "keywords": "agnes varda, francois truffaut, hayao miyazaki, hbo max, stanley kubrick, alfred hitchcock, barbara kopple, david lynch, andrew dominik, the dark knight, terrence malick, 50 Best Movies on HBO Max Ranked, Lists, Lists, Articles, Paste", "news_keywords": "agnes varda, francois truffaut, hayao miyazaki, hbo max, stanley kubrick, alfred hitchcock, barbara kopple, david lynch, andrew dominik, the dark knight, terrence malick", "fb": {"admins": 1185614656, "app_id": 127550380613969, "pages": 18512903240}, "apple-mobile-web-app-title": "Paste Magazine", "og": {"image": {"identifier": "https://cdn.pastemagazine.com/www/articles/2021/05/18/spirited-away-header-low.jpg", "width": 678, "height": 381}, "type": "article", "url": "https://www.pastemagazine.com/movies/hbo-max/best-movies-on-hbo-max/", "title": "The 50 Best Movies on HBO Max, Ranked (October 2022)", "site_name": "pastemagazine.com", "description": "HBO Max settles in with a cinematic smorgasbord of French New Wave, documentaries, silent films, sci-fi staples, psychedelic monster movies and, of course, Studio Ghibli masterpieces."}, "article": {"tag": "terrence malick", "section": "Movies", "published_time": "2020-05-30T00:19:00-07:00", "modified_time": "2022-10-03T11:45:10-07:00", "publisher": "https://www.facebook.com/PasteMagazine"}, "twitter": {"card": "summary_large_image", "site": "@pastemagazine", "title": "The 50 Best Movies on HBO Max, Ranked (October 2022)", "description": "HBO Max settles in with a cinematic smorgasbord of French New Wave, documentaries, silent films, sci-fi staples, psychedelic monster movies and, of course, Studio Ghibli masterpieces.", "image": "https://cdn.pastemagazine.com/www/articles/2021/05/18/spirited-away-header-low.jpg"}, "p": {"domain_verify": "8f36922bc91ba221f10d82c407d8b6a9"}, "viewport": "viewport-fit=cover, width=device-width, initial-scale=1.0, maximum-scale=1.0"}, "movies": [], "publish_date": 1590823140.0, "source": "https://www.pastemagazine.com", "summary": ""}