{"url": "https://sg.theasianparent.com/kate-middleton-raising-kids/", "text": "The timeless question that every parent must confront: how do we want to raise our children? To be happy, down-to-earth, and well-adjusted to the real world, most of us would say. Turns out that’s exactly what the Duchess and Duke of Cambridge would say too.\n\nRaising them her way\n\nMum Kate Middleton is definitely taking a no-nonsense approach to parenting, according to RadarOnline.com’s palace sources. Far from being spoilt by attention, 3-year-old Prince George and 2-year-old Princess Charlotte “have absolutely no idea that they’re royals”.\n\n“They might look like perfect tots in photos, but at home they play in the mud, fall off ponies, and have screaming tantrums!” That’s a description that no mum of toddlers would be surprised at.\n\nThe plucky mum is making sure her tots are raised with all the discipline and levelheadedness that normal children receive — royal tradition be damned. Kate shields her babies from the public as much as possible, according to one source. She has also told palace aides that “her kids will be raised her way”.\n\n“It would absolutely horrify Elizabeth. But Kate insists the kids should be allowed to be normal children. Never in royal history have the children in direct line to the throne been raised in such a modern way.”\n\nKate is clearly drawing lessons from her own middle-class upbringing — her mum Carol was an air hostess with British Airways while her father Michael was a flight dispatcher.\n\nAnd the dauntless mum is proving that she isn’t shy about defying centuries of royal tradition, all for the sake of her kids. Kate and William have reportedly enrolled little George in a normal middle-class school in suburban London.\n\nA more orthodox choice would have been William’s first school, Wetherby Prep — a much more “posh” school.\n\nIn today’s fast-changing world, many of us worry about how to prepare our kids for success. Sounds like Kate is taking charge of her little ones’ futures early on!\n\nParenting rules Kate and William live by\n\nAll parents aspire to bring up humble, well-mannered children, and Kate and William certainly have a tougher job than most. So far, it’s been amazing to see the couple’s dedication to making sure their kids will grow up down-to-earth and gracious — royal or not.\n\nHere are some great insights that the royal mum and dad have given into their parenting approach over the years:\n\nTaking a break\n\n“Time out” is a common method of discipline that parents turn to — Kate calls it “taking a break” instead. When little George does something naughty, he sits in a corner of his room and plays with a special calming toy or fuzzy book.\n\nPlaying music\n\nWhen prince George throws a royal screaming fit, his parents play his favourite African drumming music. Sounds like a great way to calm down wailing toddlers without exhausting yourself!\n\nImitating his tantrums\n\nKate has an even more creative solution to little George’s tantrums. When he throws a tantrum on the floor, the Duchess doesn’t hesitate to get down and scream along. (Which mum hasn’t been tempted to do that?) George finds this hilarious and it calms him right down.\n\nHelping to clean up\n\nLike all parents, Kate and William are no stranger to mealtime battles — flinging food on the floor, barfing sounds, the works. If George does this, the rule is that he must help clean up and won’t get a replacement meal, only milk.\n\nLess things, please\n\nPrince William refused to divulge what gifts three-year-old Prince George received on his birthday in 2016, “I am not telling, he got too many things, he’s far too spoiled.”\n\nWhile they certainly have the means to pamper their tots with material goods, the royal parents are clearly determined that George and Charlotte will grow up to value more important things in life.\n\nGiving them a normal life\n\nSpeaking to GQ last month, William revealed how dearly he valued normalcy for his children. “I want George to grow up in a real, living environment, I don’t want him growing up behind palace walls, he has to be out there. The media make it harder but I will fight for them to have a normal life.”\n\nLike all parents, family is the centre of his world for this dad. “I could not do my job without the stability of the family. Stability at home is so important to me. I want to bring up my children in a happy, stable, secure world.”\n\nBeing a Modern Old-Fashioned Mom\n\nOne of Kate’s go-to parenting guides is apparently The Modern Mother’s Handbook: How To Raise A Happy, Healthy, Smart, Disciplined and Interesting Child, Starting From Birth. The anonymous author calls herself a Modern Old-Fashioned Mom, and her book offers no-nonsense tips for raising kids from bubs to teens.\n\nSome gems include “set a good example and then stand back and watch” and “don’t force your kids to do things”. Definitely a page-turner if you’re wondering how to square up traditional values with modern changes for your little ones.\n\nALSO READ: Princess Charlotte, Prince George got up to mischief at Pippa’s wedding!", "images": ["https://s3.theasianparent.com/cdn-cgi/image/width=700,quality=10/tap-assets-prod/wp-content/uploads/sites/12/2017/06/rsz_1prince_william.jpg", "https://s3.theasianparent.com/cdn-cgi/image/width=700,quality=10/tap-assets-prod/wp-content/uploads/sites/12/2017/06/rsz_prince_george.jpg", "https://s3.theasianparent.com/cdn-cgi/image/width=700,quality=10/tap-assets-prod/wp-content/uploads/sites/12/2017/06/rsz_kate_middleton_playing.jpg", "https://s3.theasianparent.com/cdn-cgi/image/width=700,quality=10/tap-assets-prod/wp-content/uploads/sites/12/2017/06/Webp.net-resizeimage-3.jpg", "https://s3.theasianparent.com/cdn-cgi/image/width=700,quality=10/tap-assets-prod/wp-content/uploads/sites/12/2017/06/kate-middleton-feature.jpg", "https://s3.theasianparent.com/tap-assets/default.jpg", "https://s3.theasianparent.com/cdn-cgi/image/width=10/tap-assets/article-bottom-app-download-widget/App-Download-Article-Bottom-Widget.png", "https://s3.theasianparent.com/cdn-cgi/image/width=700,quality=10/tap-assets-prod/wp-content/uploads/sites/12/2017/06/rsz_kate_middleton_and_george.jpg", "https://s3.theasianparent.com/tap-assets/glass-featured-prime-block.png", "https://s3.theasianparent.com/tap-assets-prod/wp-content/themes/tap-redesign/logos/TAP_Thickerlogo.png", "https://s3.theasianparent.com/cdn-cgi/image/width=700,quality=10/tap-assets-prod/wp-content/uploads/sites/12/2017/06/rsz_kate_middleton_window.jpg", "https://s3.theasianparent.com/tap-assets/country-sprites3.png", "https://s3.theasianparent.com/tap-assets-prod/wp-content/uploads/sites/12/2017/06/kate-middleton-feature-1.jpg", "https://s3.theasianparent.com/cdn-cgi/image/height=250/tap-assets-prod/wp-content/uploads/sites/12/2017/06/kate-middleton-lead-1.jpg"], "top_img": "https://s3.theasianparent.com/tap-assets-prod/wp-content/uploads/sites/12/2017/06/kate-middleton-feature-1.jpg", "keywords": [], "authors": ["Jolene Hee"], "canonical_link": "https://sg.theasianparent.com/kate-middleton-raising-kids", "title": "Kate Middleton is set on raising her kids HER way: Here's how!", "meta_data": {"viewport": "width=device-width,initial-scale=1,minimum-scale=1,maximum-scale=5", "theme-color": "#3498db", "apple-mobile-web-app-capable": "yes", "msapplication-TileImage": "https://s3.theasianparent.com/tap-assets-prod/wp-content/uploads/sites/12/2016/02/cropped-default-2-270x270.png", "apple-mobile-web-app-title": "theAsianparent", "application-name": "theAsianparent", "description": "Kate Middleton ditches royal tradition when it comes to parenting. Here's her no-nonsense approach, with tips on how to handle royal tantrums!", "al": {"android": {"url": "tap://app/article/257493", "package": "com.tickledmedia.ParentTown", "app_name": "theAsianparent"}, "ios": {"url": "tap://app/article/sg/kate-middleton-raising-kids", "app_store_id": 1042523855, "app_name": "theAsianparent"}}, "og": {"title": "Kate Middleton Is Set On Raising Her Kids HER Way: Here's How! | theAsianparent", "image": {"identifier": "https://s3.theasianparent.com/tap-assets-prod/wp-content/uploads/sites/12/2017/06/kate-middleton-feature-1.jpg", "alt": "https://s3.theasianparent.com/tap-assets-prod/wp-content/themes/tap-redesign/logos/TAP_Thickerlogo.png", "height": 332, "width": 670}, "lead": "https://s3.theasianparent.com/tap-assets-prod/wp-content/uploads/sites/12/2017/06/kate-middleton-lead-1.jpg", "type": "article", "url": "https://sg.theasianparent.com/kate-middleton-raising-kids", "description": "Kate Middleton ditches royal tradition when it comes to parenting. Here's her no-nonsense approach, with tips on how to handle royal tantrums!", "site_name": "theAsianparent - Your Guide to Pregnancy, Baby & Raising Kids"}, "article": {"author": "Jolene Hee", "published_time": "2017-06-07T06:35:46+0000", "publisher": "https://www.facebook.com/theasianparent", "tag": "parenting rules"}, "fb": {"app_id": 256895297680995, "pages": 53462200688}, "twitter": {"card": "summary", "title": "Kate Middleton Is Set On Raising Her Kids HER Way: Here's How! | theAsianparent", "description": "Kate Middleton ditches royal tradition when it comes to parenting. Here's her no-nonsense approach, with tips on how to handle royal tantrums!", "image": "https://s3.theasianparent.com/tap-assets-prod/wp-content/uploads/sites/12/2017/06/kate-middleton-feature-1.jpg"}, "ahrefs-site-verification": "31c7de52701f0ff69f8b3e5bc68cc3ac74b42af28052b7eed063c913ceef9c5b", "p": {"domain_verify": "314b67239a517635a2319b5c0d7d6de9"}, "robots": "index, follow", "google-site-verification": "z4B1ury8xbKcAi-Zy5GmGmoaT71FAui-7NYphWwYeT8"}, "movies": [], "publish_date": 1496817346.0, "source": "https://sg.theasianparent.com", "summary": ""}