{"url": "https://www.celebritynetworth.com/richest-celebrities/singers/lisa-marie-presley-net-worth/", "text": "What is Lisa Marie Presley's Net Worth?\n\nLisa Marie Presley is an American actress and singer who has a net worth of -$16 million. Although she is probably best known for being the daughter and only child of Elvis Presley, Lisa Marie is also an accomplished singer-songwriter in her own right. Her negative net worth is a reflection of various financial issues related to the Presley estate, which she inherited at age 25. More details on these financial issues later in this article.\n\nShe is also known for being a former member of the Church of Scientology, and she was once married to Michael Jackson.\n\nEarly Life\n\nLisa Marie Presley was born on February 1st of 1968 in Memphis Tennessee. After Priscilla Presley and Elvis divorced, Lisa lived with her mother.\n\nMusic Career\n\nLisa Marie Presley released her debut album, \"To Whom It May Concern,\" in 2003. She followed up with \"Now What\" in 2005. Just like her debut album, her second album charted well. In 2012, she released a third album called \"Storm & Grace.\" Outside of her solo work, Presley has collaborated with a number of high-profile musicians such as Kylie Minogue, Michael Buble, and Coldplay. In addition, she has appeared in music videos for songs by Michael Jackson and other musicians.\n\nRelationships\n\nIn 1988, Lisa Marie Presley married Danny Keough. They had two children before divorcing in 1994. Their son Benjamin committed suicide in 2020 at the age of 27. After divorcing Keough, Presley quickly married Michael Jackson. Although she helped Jackson deal with a number of personal issues, she filed for divorce in 1996. Lisa then became engaged to a musician named John Oszajca before abandoning the relationship to marry Nicholas Cage. Cage and Presley were married in 2002 and divorced later that year.\n\nIn 2006, she married Michael Lockwood and in 2008 she gave birth to twins. In 2016, she filed for divorce and sole custody of the children, claiming that she had discovered child pornography on Lockwood's computer.\n\nInheritance\n\nLisa was 9 years old when her father died. Elvis was not concerned with financial responsibility, and he was famous for excessive spending throughout his lifetime. That being said, the Rock 'N Roll icon was also completely robbed by his manager, Colonel Tom Parker, who was basically taking half of Elvis' earnings. At the time of his death, Elvis' estate was worth $5 million, which is the equivalent of $14 million in today's money.\n\nHis wife Priscilla (and Lisa's mother) acted as sole executor of his estate, which was to be left to Lisa. However, Lisa Marie was just nine years old at the time. Priscilla saw that Lisa's inheritance had dwindled to just $1 million after all expenses and fees were taken into account, so she set about rebuilding the estate and dealing with its dire situation. She took the innovative step of turning Graceland (Elvis' mansion) into a museum, and 4 days after its creation she had paid off all debtors and owed expenses. By the time Lisa inherited her father's estate at age 25, it was worth $100 million (the equivalent of $295 million in today's money).\n\nHowever, instead of inheriting the money directly, she chose to establish a revocable living trust and appointed Barry Seigel to manage the funds. In February 2005, Seigel chose to sell 85% of EPE (Elvis Presley Enterprises), an organization that managed all of Elvis' image rights and royalties. Although EPE was worth $100 million, Seigel's deal only netted Lisa Marie $40 million after taxes. On the other hand, the deal included $25 million worth of stock in the future holding company of American Idol, so it wasn't all bad.\n\nUnfortunately, the money completely dried up between 2005 and 2015. Part of this was due to Lisa's excessive spending habits, but it was also probably due to mismanagement by Seigel and other financial managers (who were earning salaries of $700,000 per year, incidentally). When everything was said and done, Lisa Marie was left with just $14,000 in the trust she had established. She also reportedly had over $500,000 worth of credit card debt.\n\nLisa Marie Financial Problems\n\nBy 2015, Lisa Marie Presley had fired Barry Siegel. Two years later, she filed a lawsuit against her former business manager for allegedly squandering $100 million of her fortune and leaving her broke. She argued that the EPE deal was ill-advised and that he failed to inform her about the true condition of the Presley estate.\n\nIn his defense, Barry Siegel claimed that Lisa Marie's excessive spending habits were the real reason behind the estate's massive losses. He also claimed to have had regular business meetings with her, during which he explained the developing situation and reminded her repeatedly to limit her spending. In addition, Seigel stated that Lisa's extreme spending habits actually put her estate $20 million in debt by 2003, which he corrected.\n\nLisa Marie countered by pointing out that she had no idea about the condition of her estate, and that if Seigel had told her what was really going on, she would have limited her spending and immediately reduced his salary of $700,000. She argued that if she had been given access to only the estate's income, she would have been able to live comfortably on $1.5 to $2.5 million per year. In 2020, the ongoing legal battle was put on hold due to Covid-19.\n\nIn 2018, court documents from Lisa Marie's divorce proceedings with Michael Lockwood revealed that she was $16 million in debt. An estimated $10 million of the debt was related to unpaid taxes dating from 2012 to 2015. The rest of the debt was credit card bills and unpaid attorney fees. Lisa filed the paperwork after her ex demanded $450,000 to cover his own legal fees.", "images": ["https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://vz.cnwimg.com/thumb-900x/wp-content/uploads/2010/01/lisa.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/wp-content/uploads/2010/01/GettyImages-169991751.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2010/01/GettyImages-169991751.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/singers/lisa-marie-presley-net-worth/", "title": "Lisa Marie Presley Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Lisa Marie Presley is an American actress and singer who has a net worth of -$16 million. Although she is probably best known for being the daughter and only child of Elvis Presley, Lisa Marie is also an accomplished singer-songwriter in her own right.", "cnw_share_fb_count": 82, "cnw_share_tw_count": 42, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Lisa Marie Presley Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/singers/lisa-marie-presley-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/01/GettyImages-169991751.jpg", "site_name": "Celebrity Net Worth", "description": "Lisa Marie Presley is an American actress and singer who has a net worth of -$16 million. Although she is probably best known for being the daughter and only child of Elvis Presley, Lisa Marie is also an accomplished singer-songwriter in her own right."}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2021-12-27T22:53:01+00:00", "published_time": "2020-07-14T23:52:36+00:00", "section": "Singers", "tag": "lisa marie presley net worth"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/01/GettyImages-169991751.jpg", "title": "Lisa Marie Presley Net Worth", "description": "Lisa Marie Presley is an American actress and singer who has a net worth of -$16 million. Although she is probably best known for being the daughter and only child of Elvis Presley, Lisa Marie is a..."}}, "movies": [], "publish_date": 1594770756.0, "source": "https://www.celebritynetworth.com", "summary": ""}