{"url": "https://www.hollywoodreporter.com/live-feed/big-little-lies-season-2-all-details-far-1078626", "text": "Once billed as a limited series, HBO is bringing Big Little Lies back for a second season.\n\nThe Reese Witherspoon and Nicole Kidman vehicle was originally developed as a movie, with both actresses (and exec producers) buying the rights to Liane Moriarty’s book. Following the critical response — the seven-episode season covered all of Moriarty’s source material — HBO put a second season in development with showrunner David E. Kelley set to return. After taking home an Emmy and Golden Globe for best limited series, Big Little Lies season two will now compete in the drama category when it returns in 2019.\n\nHere are all the details about season two of Big Little Lies.\n\nWHY THERE’S A SECOND SEASON\n\nWhy would HBO bring back a show designed as a closed-ended limited series? In a scripted landscape that is expected to top 500 originals this year, it’s increasingly hard for any program to cut through that sort of clutter. Big Little Lies became a critical and watercooler favorite and gave HBO a timely series with top talent attached and awards cache. So while season one covered all of Moriarty’s book, the cast and creator (and author) all were good to reunite for a second season. Bringing back the Emmy- and Golden Globe-winner is also a surefire way to keep HBO’s subscribers paying for the channel at a time when they have endless options (Netflix, Hulu, Amazon, CBS All Access, to name a few).\n\nTHE NEW PREMISE\n\nHere’s HBO’s official logline for season two: “The subversive, darkly comedic drama Big Little Lies will explore the malignancy of lies, the durability of friendships, the fragility of marriage and, of course, the vicious ferocity of sound parenting. Relationships will fray, loyalties will erode … the potential for emotional and bodily injury shall loom.”\n\nThe second season will pick up where the first left off and, according to the HBO description, will focus on how the tragic events of the finale fundraiser impact the main characters’ seemingly picture-perfect lives: On the surface, in the tranquil seaside town of Monterey, Calif., everything seems the same. The mothers continue to dote, the husbands support, the children remain adorable and the houses are just as beautiful. But the night of the school fundraiser changed all that, leaving the community reeling as the “Monterey Five” bond together to pick up the pieces of their shattered lives.\n\nRETURNING CAST\n\nSources tell THR that HBO had to ink the cast to new deals for season two, as the stars’ deals treated Big Little Lies as a limited series and did not have an option for a sophomore run. As such, HBO has needed to close new pacts with everyone on the show. Here’s a roundup of the returning faces.\n\nReese Witherspoon as Madeline Martha Mackenzie\n\nNicole Kidman as Celeste Wright\n\nShailene Woodley as Jane Chapman\n\nLaura Dern as Renata Klein\n\nAlexander Skarsgard, whose Perry Wright was (spoiler alert!) revealed to have been the one who died during the Emmy-winning first season, is expected to return in some capacity as well.\n\nZoe Kravitz, who played whose Bonnie Carlson, is confirmed to return having inked a sizable new deal for season two, sources say.\n\nAdam Scott, who as Ed, will confront major challenges in his marriage to Madeline (Witherspoon) in season two.\n\nJames Tupper will see his Nathan Carlson cope with a complicated turn of events in his marriage and with his eldest daughter Abby.\n\nJeffrey Nordling‘s Gordon will face the consequences of a big mistake and risks losing everything along the way.\n\nIain Armitage, aka the actor now starring as young Sheldon on CBS’ Big Bang Theory spinoff, will return as Ziggy Chapman, who starts the second grade and continues to be the light of Jane’s life.\n\nKathryn Newton will reprise her role as Abigail Carlson, Madeline and Nathan’s daughter. She returns as a series regular.\n\nRobin Weigert will reprise her role as Dr. Amanda Reisman, Celeste and Perry’s therapist. She returns as a recurring guest star.\n\nMerrin Dungey returns as a recurring guest star to reprise her role as Detective Adrienne Quinlan.\n\nSarah Sokolovic returns as a series regular, reprising her role as Tori Bachman, the wife to Joseph Bachman (Santiago Cabrera), with whom Madeline was having an affair.\n\nTHE NEW CAST\n\nGoing beyond the source material will provide writers the opportunity to grow the world of Big Little Lies. “In general, I don’t think anybody involved is thinking we’re going to do the same thing. In any second season of a show, people want to see growth in the characters and storylines. I don’t think anyone involved is trying to do the same thing. We’re trying to progress everybody’s lives in the storytelling,” Bloys said of the new faces coming for season two. Here are the new additions who will appear on-screen in season two.\n\nMeryl Streep. Yes, the 21-time Oscar-nominee is going to be a series regular in season two. She will take on the role of Mary Louise Wright, who is described as a woman concerned for the well-being of her grandchildren following her son Perry’s death. She arrives in Monterey searching for answers. Fun fact: Kelley told THR in October that Streep — and Tom Hanks — were his dream casting goals for Big Little Lies.)\n\nDouglas Smith (The Alienist) will play Corey Brockfield, an off-beat surfer and aspiring marine biologist who becomes Jane’s co-worker.\n\nCrystal Fox joins the cast in a series regular role of Elizabeth Howard, Bonnie’s mother. She’s described as having passed on her outward zen to her daughter but ultimately reveals herself to be controlling and emotionally abusive.\n\nMartin Donovan will recur as Martin Howard, Bonnie’s father.\n\nMo McRae (Pitch) joins the cast as a recurring guest star, playing Michael Perkins, a new second-grade teacher at Otter Bay Elementary School who tries to cultivate global and social consciousness in his students but Renata becomes furious when his lesson on global warming causes her daughter to have a panic attack.\n\nTHE CREATIVE TEAM\n\nNearly the entire creative team is poised to return for season two. The biggest behind-the-scenes difference will be the director. Jean-Marc Vallée, who helmed every season one episode, will return only as an executive producer. In his place, Andrea Arnold — who won an Oscar for writing and directing her short film, Wasp — will direct all seven episodes. Writer/showrunner David E. Kelley, who was attached to Big Little Lies when it was a film set to star Kidman and Witherspoon, will again write all seven episodes partially based on a story by Liane Moriarty. Kelley exec produces alongside Kidman and her Blossom Films topper Per Saari; Witherspoon through Hello Sunshine banner; Bruna Papandrea; Vallée; Nathan Ross; Gregg Fienberg; and Arnold.\n\nPREMIERE DATE\n\nThe seven-episode second season of Big Little Lies will debut June 9 at 9 p.m.\n\nTRAILER\n\nA teaser trailer provided the first look at Streep’s Mary Louise, who spars with Madeline (Witherspoon) in her search for answers. The full trailer (below) provides a deeper look at how the aftermath of the group’s shared trauma will be explored.\n\nTHE FUTURE\n\nWhile HBO had to re-sign the cast for season two, Bloys would not say whether the new contracts included language for a potential third cycle. “Everybody involved is so busy that it’s hard to imagine aligning everybody’s schedule again,” he said. “The fact that we were able to get season two together is a small miracle. Could we do it again? Who knows?! It’s a great group. They love working together and they’re really fun to work with. But everybody is really busy. So let’s see.”", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2019/04/5f20e7cc70c2fe6a108e4b13c4c1d3bbe0d4a82e06097a11cfba087baf8deae0_copy.jpg?w=1296&h=730&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2019/04/5f20e7cc70c2fe6a108e4b13c4c1d3bbe0d4a82e06097a11cfba087baf8deae0_copy.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2019/04/5f20e7cc70c2fe6a108e4b13c4c1d3bbe0d4a82e06097a11cfba087baf8deae0_copy.jpg?w=1024", "keywords": [], "authors": ["Lesley Goldberg"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/big-little-lies-season-2-all-details-far-1078626/", "title": "‘Big Little Lies’ Season 2: All the Details", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Yes, including Meryl Streep.", "news_keywords": "Big Little Lies", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Lesley Goldberg", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1078626, "title": "'Big Little Lies' Season 2: All the Details", "published_at": "2018-01-26 05:15:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2019/04/5f20e7cc70c2fe6a108e4b13c4c1d3bbe0d4a82e06097a11cfba087baf8deae0_copy.jpg?w=1024", "comment_count": 0, "tags": "Big Little Lies", "topics": "TV News", "body": "Once billed as a limited series, HBO is bringing Big Little Lies back for a second season.\r\nThe Reese Witherspoon and Nicole Kidman vehicle was originally developed as a movie, with both actresses (and exec producers) buying the rights to Liane Moriarty's book. Following the critical response — the seven-episode season covered all of Moriarty's source material — HBO put a second season in development with showrunner David E. Kelley set to return. After taking home an Emmy and Golden Globe for best limited series, Big Little Lies season two will now compete in the drama category when it returns in 2019.\r\nHere are all the details about season two of Big Little Lies. \r\n\r\nWHY THERE'S A SECOND SEASON\r\nWhy would HBO bring back a show designed as a closed-ended limited series? In a scripted landscape that is expected to top 500 originals this year, it's increasingly hard for any program to cut through that sort of clutter. Big Little Lies became a critical and watercooler favorite and gave HBO a timely series with top talent attached and awards cache. So while season one covered all of Moriarty's book, the cast and creator (and author) all were good to reunite for a second season. Bringing back the Emmy- and Golden Globe-winner is also a surefire way to keep HBO's subscribers paying for the channel at a time when they have endless options (Netflix, Hulu, Amazon, CBS All Access, to name a few).\r\n\r\nTHE NEW PREMISE\r\nHere's HBO's official logline for season two: \"The subversive, darkly comedic drama Big Little Lies will explore the malignancy of lies, the durability of friendships, the fragility of marriage and, of course, the vicious ferocity of sound parenting. Relationships will fray, loyalties will erode … the potential for emotional and bodily injury shall loom.\"\r\nThe second season will pick up where the first left off and, according to the HBO description, will focus on how the tragic events of the finale fundraiser impact the main characters' seemingly picture-perfect lives: On the surface, in the tranquil seaside town of Monterey, Calif., everything seems the same. The mothers continue to dote, the husbands support, the children remain adorable and the houses are just as beautiful. But the night of the school fundraiser changed all that, leaving the community reeling as the “Monterey Five” bond together to pick up the pieces of their shattered lives.\r\nRETURNING CAST\r\nSources tell THR that HBO had to ink the cast to new deals for season two, as the stars' deals treated Big Little Lies as a limited series and did not have an option for a sophomore run. As such, HBO has needed to close new pacts with everyone on the show. Here's a roundup of the returning faces.\r\n\r\nReese Witherspoon as Madeline Martha Mackenzie\r\n\t\r\n\tNicole Kidman as Celeste Wright\r\nShailene Woodley as Jane Chapman\r\nLaura Dern as Renata Klein\r\nAlexander Skarsgard, whose Perry Wright was (spoiler alert!) revealed to have been the one who died during the Emmy-winning first season, is expected to return in some capacity as well.\r\nZoe Kravitz, who played whose Bonnie Carlson, is confirmed to return having inked a sizable new deal for season two, sources say.\r\nAdam Scott, who as Ed, will confront major challenges in his marriage to Madeline (Witherspoon) in season two.\r\nJames Tupper will see his Nathan Carlson cope with a complicated turn of events in his marriage and with his eldest daughter Abby. \r\nJeffrey Nordling's Gordon will face the consequences of a big mistake and risks losing everything along the way.\r\nIain Armitage, aka the actor now starring as young Sheldon on CBS' Big Bang Theory spinoff, will return as Ziggy Chapman, who starts the second grade and continues to be the light of Jane's life.\r\nKathryn Newton will reprise her role as Abigail Carlson, Madeline and Nathan's daughter. She returns as a series regular.\r\nRobin Weigert will reprise her role as Dr. Amanda Reisman, Celeste and Perry's therapist. She returns as a recurring guest star.\r\nMerrin Dungey returns as a recurring guest star to reprise her role as Detective Adrienne Quinlan.\r\nSarah Sokolovic returns as a series regular, reprising her role as Tori Bachman, the wife to Joseph Bachman (Santiago Cabrera), with whom Madeline was having an affair.\r\nTHE NEW CAST\r\nGoing beyond the source material will provide writers the opportunity to grow the world of Big Little Lies. \"In general, I don't think anybody involved is thinking we're going to do the same thing. In any second season of a show, people want to see growth in the characters and storylines. I don't think anyone involved is trying to do the same thing. We're trying to progress everybody's lives in the storytelling,\" Bloys said of the new faces coming for season two. Here are the new additions who will appear on-screen in season two.\r\nMeryl Streep. Yes, the 21-time Oscar-nominee is going to be a series regular in season two. She will take on the role of Mary Louise Wright, who is described as a woman concerned for the well-being of her grandchildren following her son Perry's death. She arrives in Monterey searching for answers. Fun fact: Kelley told THR in October that Streep — and Tom Hanks — were his dream casting goals for Big Little Lies.)\r\nDouglas Smith (The Alienist) will play Corey Brockfield, an off-beat surfer and aspiring marine biologist who becomes Jane's co-worker. \r\nCrystal Fox joins the cast in a series regular role of Elizabeth Howard, Bonnie's mother. She's described as having passed on her outward zen to her daughter but ultimately reveals herself to be controlling and emotionally abusive.\r\nMartin Donovan will recur as Martin Howard, Bonnie's father.\r\nMo McRae (Pitch) joins the cast as a recurring guest star, playing Michael Perkins, a new second-grade teacher at Otter Bay Elementary School who tries to cultivate global and social consciousness in his students but Renata becomes furious when his lesson on global warming causes her daughter to have a panic attack.\r\n\r\nTHE CREATIVE TEAM\r\nNearly the entire creative team is poised to return for season two. The biggest behind-the-scenes difference will be the director. Jean-Marc Vallée, who helmed every season one episode, will return only as an executive producer. In his place, Andrea Arnold — who won an Oscar for writing and directing her short film, Wasp — will direct all seven episodes. Writer/showrunner David E. Kelley, who was attached to Big Little Lies when it was a film set to star Kidman and Witherspoon, will again write all seven episodes partially based on a story by Liane Moriarty. Kelley exec produces alongside Kidman and her Blossom Films topper Per Saari; Witherspoon through Hello Sunshine banner; Bruna Papandrea; Vallée; Nathan Ross; Gregg Fienberg; and Arnold. \r\nPREMIERE DATE\r\nThe seven-episode second season of Big Little Lies will debut June 9 at 9 p.m.\r\nTRAILER\r\nA teaser trailer provided the first look at Streep's Mary Louise, who spars with Madeline (Witherspoon) in her search for answers. The full trailer (below) provides a deeper look at how the aftermath of the group's shared trauma will be explored. \r\n\r\nTHE FUTURE\r\nWhile HBO had to re-sign the cast for season two, Bloys would not say whether the new contracts included language for a potential third cycle. \"Everybody involved is so busy that it's hard to imagine aligning everybody's schedule again,\" he said. \"The fact that we were able to get season two together is a small miracle. Could we do it again? Who knows?! It's a great group. They love working together and they're really fun to work with. But everybody is really busy. So let's see.\"", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Big Little Lies’ Season 2: All the Details", "url": "https://www.hollywoodreporter.com/tv/tv-news/big-little-lies-season-2-all-details-far-1078626/", "description": "Yes, including Meryl Streep.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2019/04/5f20e7cc70c2fe6a108e4b13c4c1d3bbe0d4a82e06097a11cfba087baf8deae0_copy.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2018-01-26T05:15:00+00:00", "modified_time": "2019-05-31T13:20:12+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Big Little Lies’ Season 2: All the Details", "description": "Yes, including Meryl Streep.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2019/04/5f20e7cc70c2fe6a108e4b13c4c1d3bbe0d4a82e06097a11cfba087baf8deae0_copy.jpg?w=1296"}}, "movies": [], "publish_date": 1516943700.0, "source": "https://www.hollywoodreporter.com", "summary": ""}