{"url": "https://en.wikipedia.org/wiki/Mary_Chieffo", "text": "American actress (born 1992)\n\nMary Elizabeth Chieffo (born November 7, 1992) is an American actress known for portraying the Klingon L'Rell on the television series Star Trek: Discovery.[3]\n\nBiography [ edit ]\n\nChieffo was born and grew up in the neighborhood of Valley Village, Los Angeles in California, only daughter of actors Michael Chieffo and Beth Grant.[2] Her acting debut was at the age of three when she played a sleeping girl in Sandra Bullock's short film Making Sandwiches, in which her mother also had a role, and later acted in various TV shows and short and feature films.[citation needed] As a child, she attended Shakespeare theater camp at the Theatricum Botanicum, where she performed in a variety of shows including Antony and Cleopatra.\n\nShe attended the Drama division of Juilliard School in New York City, earning a Bachelor of Fine Arts degree in 2015.[citation needed] One of her classmates was future Star Trek: Discovery castmate Mary Wiseman.[4] Her first high profile acting position was on Star Trek: Discovery, where she played the recurring character of L'Rell, a Klingon warrior and spy who becomes leader of the Klingon Empire at the end of Season 1.[5] Her writing and producing debut was Operation Othello, a virtual reality adaptation of Shakespeare's Othello, where she also plays Lt. Iago in a gender twist from the original play.[6]\n\nPersonal life [ edit ]\n\nChieffo came out publicly as a lesbian on the red carpet prior to the Star Trek Day event held September 8, 2021, at the Skirball Cultural Center in Los Angeles, California.[7] A few days later, she confirmed via her Twitter feed that she was dating writer and actor Madi Goff.[8]\n\nFilmography [ edit ]\n\nFilm and television Year Title Role Notes 1998 Making Sandwiches Sleeping baby (Uncredited) Short 2007 Welcome to Paradise voice actress 2008 Natural Disasters Young Beth 2009 Herpes Boy Patch 2009 Jack and Janet Save the Planet Tina Grotunski Television movie 2011 Girls! Girls! Girls! 2012 The Perfect Fit Shop Girl Short 2013 Miss Dial Teenage Girl Stranger 2013 Odyssea Daughter Short 2017 Shelby's Vacation Gillian Short 2017 The Mindy Project Micaela chapter: \"Jeremy & Anna's Meryl Streep Costume Party\" (season 6 episode 5) 2018 On the Day You Were Born Mary Animated short 2017–19 Star Trek: Discovery L'Rell[9] recurring character (13 episodes) 2020 Heartbeats Clare / Alicia Ayoub 4 chapters 2021 Slay Dr. Elizabeth Diamond 2 chapters 2022 Girls5eva June chapter \"Who U Know\" (season 2 episode 3) N/A Operation Othello Ensign Iago VR TV movie, she was also the writer and producer.[6]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/Mary_Chieffo_by_Gage_Skidmore.jpg/1200px-Mary_Chieffo_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/Mary_Chieffo_by_Gage_Skidmore.jpg/220px-Mary_Chieffo_by_Gage_Skidmore.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/Mary_Chieffo_by_Gage_Skidmore.jpg/1200px-Mary_Chieffo_by_Gage_Skidmore.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Mary_Chieffo", "title": "Mary Chieffo", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/Mary_Chieffo_by_Gage_Skidmore.jpg/640px-Mary_Chieffo_by_Gage_Skidmore.jpg", "width": 640, "height": 837}, "title": "Mary Chieffo - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}