{"url": "https://www.avclub.com/riverdale-s-the-tell-tale-heart-explores-the-code-of-1822832349", "text": "As Riverdale’s take on the mob movie genre, “Chapter Twenty-Five: The Wicked And The Divine” was a visually striking episode. Naturally, “Chapter Twenty-Six: The Tell-Tale Heart” is a comedown from that. It’s not as big, it’s not as opulent; the event-of-the-week is dead body disposal. That’s not to say the show no longer looks special, because it always does. But this week, it looks notably different for another reason: The Vampire Diaries creator Julie Plec directed the episode. In the world of The CW, that’s quite the get. It’s also morbidly appropriate, considering all the blood.\n\nReviews Riverdale Reviews Riverdale “Chapter Twenty-Six: The Tell-Tale Heart” C+ C+ “Chapter Twenty-Six: The Tell-Tale Heart” Episode 13\n\nPrior to the title card, the Cooper scenes even look like they could fit perfectly into an episode of Vampire Diaries, with or without the blood. Going from typical Riverdale dark blue tint (which we were originally left with at the end of “Chapter Twenty-Five”) to the bright gold is like a sudden crash back to reality. At least, Riverdale’s version of “reality.” Riverdale loves to keep things like this in the dark, except for here, where the bloody scene is as bright as it possibly can be. But it’s the shot where Betty lays her head down to sleep and it goes from night to day that most owes itself to Plec’s past work, as there is nothing less Riverdale—yet so very Vampire Diaries—than Betty waking up, greeted by rays of sunshine through her window. It’s the most sun there’s ever been on this show, and it’s a devilishly cheeky choice, due to what happened the night before.\n\n\n\nAdvertisement\n\nThis episode features the best version of Betty we’ve seen in a long time. It also serves as a reminder of Betty’s strength that made her the clear hero of this series: her need to get things done, even in the worst circumstances. While it seems like a bad idea at first, taking the shady man’s phone leads to her finding out Chic called him in the first place. She’s finally starting to see him for the manipulator he is, and the only thing preventing her from getting to the bottom of Chic is Alice. To quote “The Tell-Tale Heart”: “The disease had sharpened my senses—not destroyed—not dulled them.” Only, in Betty’s case, she hasn’t actually gone mad.\n\n\n\nHowever, this is getting dangerously close to me suggesting trauma makes Betty sharper, which is almost as bad of a take as Riverdale’s entire approach to mental illness. Even though she gets stuff done here, Betty’s far from 100%. Don’t forget the bizarre moment of her wiping down every individual apple for possible fingerprints… right after Alice tells her the shady man didn’t touch them at all. (Also, of the two lines Chic has this episode, neither of mention what his dealer’s name was. So we’re stuck with “The Shady Man.”) She’s also flashing back to the bloody murder scene almost every waking moment. The good news is, she asks Jughead for help. So many things happening on this show right now could be solved if these characters just asked each other for help.\n\n\n\nThis is all follow-up to Jughead and Betty having sex for the first time, and in all the stress, Betty basically forgets it happened until Jughead brings it up. But that’s only the first in a long line of actual communication between these two in this episode! That sounds normal, but this entire season has proven that’s apparently a novel concept. “Chapter Twenty-Six” is a good episode for this plot’s core four—Reinhart, Sprouse, Amick, and Ulrich—who all give compelling performances and have something substantial to work with. The code of silence between these four has a weight to it that is severely lacking in the plot that actually mentions the very concept. Jughead is still in crusader mode here, but it’s at a bearable level, especially since he has a leg to stand on for once and figures out the Lodge/McCoy land conspiracy.\n\nMadelaine Petsch is again given very little to do as Cheryl, but since her small parts intersect with this plot, it’s worth noting that she makes a lot out of the little she has. Would that she could threaten a disappointing Riverdale parent every episode. She even has the line of the episode:\n\n“You’re destroying families with your courtesan ways.”\n\nThen there’s the rest of the episode, which works hard not to work at all, on multiple levels. From the smallest moments to the biggest picture, all the absurd enjoyment that last week’s love letter to cinematic organized crime provided is nonexistent here. Instead, all that’s left are questionable choices (from characters, the story itself) and even more questionable characterizations. While there’s obviously great suspense in the A-plot, the Archie/Veronica/Lodge stuff exists and fails based on quite the opposite.\n\n\n\nAdvertisement\n\nFor example, take the simple concept of Archie’s soundproof garage. With this episode, it’s suddenly no longer soundproof… because there needs to be something to spook Alice and Betty even more, while also possibly waking Fred Andrews up and ruining Archie’s weird thing with Agent Adams. Keep in mind, the entire point of the garage scenes between Archie and Adams was so no one would ever know about their meetings, because it’s soundproof. So because of a supposed plot need, it becomes the setting of the series’ worst attempt at creating suspense. Then, the episode doubles down on trying to make Adams seem scary—which was impossible after last week’s “crime family” line—by cranking up the pressure. How does it do that? Well, it adds a brand new quality to the character: He’s a hat guy. Now he wears a hat that’s conspicuous by nature, to meetings where he’s attempting to be inconspicuous. That’s weird, right? But it’s necessary for the absolute shock when Archie comes home and see Adams’ hat. It’s a “suspenseful” moment that couldn’t have existed before, because the writers didn’t think to give Adams any distinguishing characteristic until this episode. Kind of like how they almost didn’t think to introduce Mr. Svenson until right before they revealed he was the Black Hood.\n\n\n\nAt one point in this episode, Archie tells Hiram Lodge that he “likes” him. What is there for Archie to like about Hiram, especially after the past two episodes? Archie knows for a fact he’s a criminal on a major scale, because even Veronica confirmed it. So at first, when Archie says he can’t think of anyone who could be a “capo” for Hiram (despite Andre’s existence), one can chalk it up to him not putting two and two together. But as the episode progresses, it’s clear from scene-to-scene that Archie genuinely believes Hiram isn’t the monster he’s made out to be. Even though he is. This episode doesn’t for once suggest that Archie is only thinking with his heart and pledging loyalty to Hiram to protect Veronica either. Speaking of, even Veronica doesn’t buy her own father’s alleged innocence. In fact, even though Archie tells Hiram that Veronica is spiraling over the possibility that he had Papa Poutine killed, she seems pretty put together when she fire back a lie of her own (mirroring Hiram’s lie) right to Hiram’s face.\n\nAdvertisement\n\nSo is Archie just a terrible judge of character? With the exception of her tipping Mayor McCoy off about a possible scandal—no doubt to prove to the audience she hasn’t fully gone “Dark Veronica” or whatever they’ll call her—Veronica’s only issues with her family’s methods are that fragile Archie might get hurt. Veronica is 100% on-board with and complicit in her parents’ villainy otherwise. In this episode alone, Veronica’s reaction to her father being responsible for the statue head isn’t anger that Hiram intentionally fanned the flames of Riverdale’s class war and worked to evict Southside families; it’s to try to “manage” Jughead as a result of that. Basically, Veronica’s attempts at peace between the Northsiders and the Southsiders are even hollower than they appeared. Then again, Veronica doesn’t care that her father tries to blackmail one of her “friends” right in front of her, just like Archie doesn’t care that his “best friend” is at risk of losing his home because of the man he “likes.”\n\nIn keeping with the Lodges suddenly being mafiosos, Andre the driver/security guard/doorman now only says “boss” when he’s talking about his employer. Because Riverdale is a glorious live-action cartoon. Also, it wants the surprise reveal to really land when it happens. Early in this episode, I found myself thinking how disappointing it is that Hiram’s increased role as the villain has essentially pushed Hermione into the background in comparison. Hiram’s the one who has the heart-to-hearts with Veronica; Hiram’s the one who has meetings to broker peace; everyone tries to woo or take down Hiram. Even when Hermione has scenes with Veronica, Hiram is usually also part of them. So the reveal that “the boss” is Hermione works to put the pair back on equal footing, with Hermione possibly being even higher. However, as the Lodges get more intimidating, it only becomes that much more unbelievable that they’re putting so much trust into Archie. That they trust him with their omertà, their code of silence.\n\nAdvertisement\n\nLess surprising and more believable, however—as pretty much everyone who comments here guessed—is the reveal that Agent Adams isn’t an FBI agent at all and was instead a test from the Lodges. It’s a disappointment that he didn’t end up being a massive hallucination on Archie’s end… but considering how many reviews/recaps I saw that treated this reveal like it was a genuine surprise, perhaps most Riverdale viewers just aren’t ready to crank it up to that next level.\n\n\n\n“Chapter Twenty-Six” is an episode that relies heavily on illogical behavior and unearned tension, without at least bringing along the fun that “Chapter Twenty-Five” did in the process. You know something’s wrong when the plot that makes the most sense is the one where the Cooper women cover up a murder. In fact, that plot is exceptional and the highlight of this episode, despite it all spawning from Chic. And while the Lodges are good villains, they’re anchored by a weak character like Archie, a devolving character like Veronica, and the simple fact the Riverdale has worked hard this season to make the audience want to root for anyone Jughead is against.\n\nAdvertisement\n\nThe Lodges and their reach are also in nearly every part of the show at the moment, with the Coopers and Blossoms currently existing as the only characters not affected by them. Which is why the Cooper family plot (and Blossom family mini-plot) still doesn’t save this episode—it’s a small life raft in comparison.\n\nStray observations", "images": ["https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/f5zr3vuc90hrpnmx0nme.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,fl_progressive,g_center,h_264,q_80,w_470/b79608df135ebc4b059a2cdad3a83176.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/kqnkjlylkf7tymsqmoqr.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/52a29fe0001de9a08e76ea6d559528e9.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/u0939doeuioaqhspkjyc.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/j59upeyynundqjvbmcwj.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/v4sckews2f3bzf0ztbkf.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/aqhdzcldymb9mkltfhxh.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/rnxqtvv6advgidzfs6am.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/f2b6295902a8e0a7c4d168840e7b3d51.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/eti2h1r4wg0bqxctxenl.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/muaaluj2wznfomol9ero.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/no63bw902mddhwxtjtxh.png"], "top_img": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png", "keywords": [], "authors": [], "canonical_link": "https://www.avclub.com/riverdale-s-the-tell-tale-heart-explores-the-code-of-1822832349", "title": "Riverdale’s “The Tell-Tale Heart” explores the code of silence, to mixed results", "meta_data": {"google-site-verification": "QDPLbDJXTQNT0n69mvNADCeRmwnbkYyL20OKJAVCKq8", "ir-site-verification-token": "-1270174611", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0,maximum-scale=10.0", "ROBOTS": "INDEX, FOLLOW", "msapplication-square70x70logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/no63bw902mddhwxtjtxh.png", "msapplication-square150x150logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_200,q_80,w_200/no63bw902mddhwxtjtxh.png", "keywords": "Riverdale, Recap, The A.V. Club", "news_keywords": "Riverdale, Recap, The A.V. Club", "twitter": {"url": "https://www.avclub.com/riverdale-s-the-tell-tale-heart-explores-the-code-of-1822832349", "card": "summary_large_image", "site": "theavclub", "title": "Riverdale’s “The Tell-Tale Heart” explores the code of silence, to mixed results", "description": "As Riverdale’s take on the mob movie genre, “Chapter Twenty-Five: The Wicked And The\nDivine” was a visually striking\nepisode. Naturally, “Chapter Twenty-Six: The Tell-Tale Heart” is a comedown\nfrom that. It’s not as big, it’s not as opulent; the event-of-the-week is dead\nbody disposal. That’s not to say the show no…", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png"}, "article": {"published_time": "2018-02-08T15:15:00.349Z", "modified_time": "2018-07-20T17:14:54.560Z"}, "description": "As Riverdale’s take on the mob movie genre, “Chapter Twenty-Five: The Wicked And The\nDivine” was a visually striking\nepisode. Naturally, “Chapter Twenty-Six: The Tell-Tale Heart” is a comedown\nfrom that. It’s not as big, it’s not as opulent; the event-of-the-week is dead\nbody disposal. That’s not to say the show no…", "og": {"title": "Riverdale’s “The Tell-Tale Heart” explores the code of silence, to mixed results", "type": "article", "url": "https://www.avclub.com/riverdale-s-the-tell-tale-heart-explores-the-code-of-1822832349", "description": "As Riverdale’s take on the mob movie genre, “Chapter Twenty-Five: The Wicked And The\nDivine” was a visually striking\nepisode. Naturally, “Chapter Twenty-Six: The Tell-Tale Heart” is a comedown\nfrom that. It’s not as big, it’s not as opulent; the event-of-the-week is dead\nbody disposal. That’s not to say the show no…", "locale": "en_US", "site_name": "The A.V. Club", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png"}, "fb": {"app_id": 1621890511466174, "pages": 39581755672}}, "movies": [], "publish_date": 1518102900.349, "source": "https://www.avclub.com", "summary": ""}