{"url": "https://www.beyonce.com/article/homecoming-scholars-awards-program/", "text": "HOMECOMING SCHOLARS AWARD PROGRAM\n\nToday, Beyoncé, through her BeyGOOD initiative, announces the four schools to receive the newly established Homecoming Scholars Award Program for the 2018-2019 academic year. The Universities, Xavier, Wilberforce, Tuskegee and Bethune-Cookman, are all Historically Black Colleges and Universities (HBCUs). HBCUs are institutions of higher education in the United States that were established before the Civil Rights Act of 1964 with the intention of primarily serving the African-American community.\n\n\n\nOn Saturday, April 14, Beyoncé made history at the 2018 Coachella Valley Music and Arts Festival by becoming the first Black woman to headline in the festival's 19-year run.\n\n\n\nThe jubilant set, housed on a pyramid stage with 150-plus cast members, dutifully in-sync, was the first time the icon returned to her home, the stage, in over one year.\n\n\n\nThe show, with its homage to excellence in education, was a celebration of the homecoming weekend experience, the highest display of college pride. The energy-filled production put the spotlight on art and culture, mixing the ancient and the modern, which resonated masterfully through the marching band, performance art, choir and dance. It was the impetus to mark her second scholarship program.\n\n\n\n\n\n\"We salute the rich legacy of Historically Black Colleges and Universities,\" states Ivy McGregor, Director of Philanthropy and Corporate Relations at Parkwood Entertainment which houses BeyGOOD. \"We honor all institutions of higher learning for maintaining culture and creating environments for optimal learning which expands dreams and the seas of possibilities for students.\"\n\n\n\nOne winner from each school will receive $25K for the 2018-2019 academic year for study in various fields. This is the second year for a scholars program created by Beyoncé.\n\n\n\nThe Formation Scholars Awards Program, a merit scholarship program was established in April 2017 in celebration of the one-year anniversary of LEMONADE, Beyoncé's critically-acclaimed and globally-lauded 2016 visual album. The Formation Scholars awards encouraged and supported young women who are bold, creative, conscious, confident and unafraid to think outside of the box.\n\n\n\nThe Homecoming Scholars Award Program for 2018-2019 will expand to all qualifying students at the four universities, regardless of gender. The disciplines will include literature, creative arts, African- American studies, science, education, business, communications, social sciences, computer science and engineering. All applicants must maintain a 3.5 GPA or above. All finalists and winners will be selected by the universities. Winners will be announced this summer.\n\n\n\n", "images": ["https://www.beyonce.com/static/images/icon-twitter.svg?v=d227f41", "https://www.beyonce.com/static/images/icon-close.svg?v=d227f41", "https://www.beyonce.com/static/images/logo-new.svg?v=d227f41", "https://www.beyonce.com/static/images/magnifying-glass-small.png", "https://www.beyonce.com/uploads/2019/07/badge-small.png", "https://www.facebook.com/tr?id=167157767310271&ev=PageView&noscript=1", "https://www.beyonce.com/static/images/icon-facebook.svg?v=d227f41", "https://www.beyonce.com/uploads/2018/04/cache/sZtMuLCqTv7q_800x800_74tHK9Wi.png", "https://www.beyonce.com/static/images/magnifying-glass-med.png", "https://www.facebook.com/tr?id=1447330645497320&ev=PageView&noscript=1", "https://www.beyonce.com/static/images/icon-pinterest.svg?v=d227f41", "https://www.beyonce.com/static/images/grid-sizer.gif?v=d227f41"], "top_img": "https://www.beyonce.com/uploads/2018/04/cache/sZtMuLCqTv7q_800x800_74tHK9Wi.png", "keywords": [], "authors": [], "canonical_link": "https://www.beyonce.com/article/homecoming-scholars-awards-program/", "title": "Beyoncé: Homecoming Scholars Award Program", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, user-scalable=no", "URL": "http://www.beyonce.com", "copyright": 2022, "og": {"site_name": "Beyoncé", "type": "website", "url": "https://www.beyonce.com/article/homecoming-scholars-awards-program/", "title": "Homecoming Scholars Award Program", "description": "Homecoming Scholars Award Program", "image": "/uploads/2018/04/cache/sZtMuLCqTv7q_800x800_74tHK9Wi.png"}, "fb": {"app_id": 863803020305145, "admins": 537141755}, "twitter": {"card": "summary", "site": "@beyonce", "creator": "@beyonce", "title": "Homecoming Scholars Award Program", "description": "Homecoming Scholars Award Program", "image": "/uploads/2018/04/cache/sZtMuLCqTv7q_800x800_74tHK9Wi.png"}, "description": "Homecoming Scholars Award Program"}, "movies": [], "publish_date": null, "source": "https://www.beyonce.com", "summary": ""}