{"url": "https://www.celebritynetworth.com/richest-celebrities/actors/ellie-kemper-net-worth/", "text": "What is Ellie Kemper's Net Worth?\n\nEllie Kemper is an American actress, comedian, and writer who has a net worth of $9 million. Kemper is best known for playing Erin Hannon on the NBC sitcom \"The Office\" (2009–2013) and Kimmy Schmidt on the Netflix series \"Unbreakable Kimmy Schmidt\" (2015–2019).\n\nShe has more than 60 acting credits to her name, including \"Get Him to the Greek\" (2010), \"Bridesmaids\" (2011), and \"Sex Tape\" (2014), and she has lent her voice to animated projects such as \"The Secret Life of Pets\" (2016), \"The Lego Batman Movie\" (2017), and \"Sofia the First\" (2013–2018). In 2018, Ellie published the book \"My Squirrel Days,\" which is described as \"a hilarious essay collection about one pale woman's journey from the Midwest to Hollywood.\" She has also written for \"The Onion,\" \"McSweeney's,\" and \"The Huffington Post.\"\n\nEarly Life\n\nEllie Kemper was born Elizabeth Claire Kemper on May 2, 1980, in Kansas City, Missouri. She grew up in St. Louis with mother Dotty, father David, and three siblings. David is a member of one of Missouri's wealthiest families and served as the CEO and chairman of Commerce Bancshares. Ellie's great-great-grandfather is railroad magnate and banker William Thornton Kemper Sr., and the Mildred Lane Kemper Art Museum in St. Louis is named after her grandmother. Kemper's younger sister Carrie is an Emmy-nominated TV writer and producer who has worked on \"The Office\" and \"Silicon Valley.\" Ellie attended Conway Elementary School and John Burroughs School, where future \"Mad Men\" star (and \"Unbreakable Kimmy Schmidt\" co-star) Jon Hamm was her acting teacher. After graduation, Ellie enrolled at Princeton University, and she earned a Bachelor of Arts degree in English in 2002. While attending Princeton, she joined the field hockey team as well as the school's improv group and touring musical-comedy troupe. Kemper also spent a year at Worcester College, Oxford, when she was studying toward a graduate degree in English Literature.\n\nCareer\n\nEllie earned her Screen Actors Guild card after appearing in a 2006 Kmart commercial that involved a tarantula crawling across her face. Kemper interned at \"Late Night with Conan O'Brien,\" as did her future \"The Office\" castmates Mindy Kaling, John Krasinski, and Angela Kinsey, and she appeared in sketches on the show in 2007 and 2008. Around that time, Ellie appeared in the TV movie \"Redeeming Rainbow\" (2007), the Comedy Central series \"Important Things with Demetri Martin\" (2009–2010), and the films \"Cayman Went\" (2009) and \"Mystery Team\" (2009). Kemper also worked with the People's Improv Theatre and Upright Citizens Brigade; at UCB, she performed with the improv teams fwand and Mailer Daemon, appeared in shows such as \"Death and/or Despair\" and \"The Improvised Mystery,\" and put on the one-woman show \"Dumb Girls,\" which she also wrote. Kemper auditioned for \"Saturday Night Live\" in 2008, and \"Variety\" named her one of \"10 Comics To Watch\" in 2009.\n\nAn audition for \"Parks and Recreation\" led co-creators Greg Daniels and Michael Schur to cast Ellie on their other series, \"The Office.\" She began playing Erin Hannon during the show's fifth season and went on to appear in more than 100 episodes. She also appeared in \"The Office\" web series \"Subtle Sexuality\" (2009), \"The Mentor\" (2010), \"The 3rd Floor\" (2010), \"The Podcast\" (2011), and \"The Girl Next Door\" (2011). While appearing on \"The Office,\" Kemper guest-starred on \"NTSF:SD:SUV::\" (2012) and \"The Mindy Project\" (2012–2013), and appeared in several films, including 2010's \"Get Him to the Greek\" and \"Somewhere\" and 2012's \"21 Jump Street.\" She also co-starred with Kristen Wiig, Maya Rudolph, Rose Byrne, Wendi McLendon-Covey, and Melissa McCarthy in the blockbuster comedy \"Bridesmaids,\" which grossed $288.4 million at the box office and earned a Golden Globe nomination for Best Motion Picture – Musical or Comedy. Ellie had an uncredited role in the Jason Bateman-Melissa McCarthy film \"Identity Thief\" (2013), and the following year, she appeared in the films \"Laggies,\" \"Sex Tape,\" and \"They Came Together.\"\n\nIn 2015, Kemper began starring on \"Unbreakable Kimmy Schmidt,\" which was created by Tina Fey and Robert Carlock; the show consists of 51 episodes and the 2020 interactive special \"Kimmy vs. the Reverend.\" In 2016, Kemper voiced Katie in \"The Secret Life of Pets,\" and she reprised her role in the 2019 sequel; both films were hits, grossing $875.5 million and $434 million worldwide. Ellie guest-starred on \"Julie's Greenroom\" in 2017 and \"At Home with Amy Sedaris\" in 2018, and she played Gloria Stivic on 2019's \"Live in Front of a Studio Audience: Norman Lear's All in the Family and The Jeffersons.\" In 2019, she was cast in the sixth film in the \"Home Alone\" franchise, and in 2020, she appeared in the Drew Barrymore film \"The Stand In.\" In recent years, Kemper has done voice acting in numerous projects, including the films \"Smurfs: The Lost Village\" (2017) and \"We Bare Bears: The Movie\" (2020) and the TV series \"WordGirl\" (2015), \"All Hail King Julien\" (2016), and \"The Simpsons\" (2020).\n\nPersonal Life\n\nOn July 7, 2012, Ellie married comedy writer Michael Koman, who has written for \"Late Night with Conan O'Brien,\" \"The Colbert Report,\" and \"Saturday Night Live.\" They welcomed son James in July 2016 and gave him a little brother, Matthew, in September 2019. Though Koman is Jewish, the couple married in the Catholic Church and are raising their children Roman Catholic.\n\nAwards and Nominations\n\nKemper received Primetime Emmy nominations for Outstanding Lead Actress in a Comedy Series for \"Unbreakable Kimmy Schmidt\" in 2016 and 2017. The series also earned her a Gracie Allen Award and a Webby Award as well as nominations from the Broadcast Film Critics Association Awards, Critics Choice Television Awards, Gold Derby Awards, Online Film & Television Association, Satellite Awards, and Screen Actors Guild Awards. Ellie also received Screen Actors Guild Award nominations as a member of \"The Office\" and \"Bridesmaids\" casts, and she earned a nomination for Outstanding Actress – Comedy Series for \"The Office\" at the Monte-Carlo TV Festival. Kemper and her \"Bridesmaids\" castmates won an MTV Movie Award for Best Gut-Wrenching Performance and ensemble awards from the Alliance of Women Film Journalists, New York Film Critics Online, and Washington D.C. Area Film Critics Association.\n\nReal Estate\n\nIn 2016, Kemper and Koman paid $2.8 million for a pre-war co-op in the Upper West Side area of New York City. The home includes three bedrooms and three bathrooms and is just a few blocks away from Tina Fey's home. They listed this home for sale in April 2022 for $2.875 million.", "images": ["https://vz.cnwimg.com/wp-content/uploads/2014/04/GettyImages-886617106.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2014/04/GettyImages-886617106.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/ellie-kemper-net-worth/", "title": "Ellie Kemper Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "cnw_share_fb_count": 83, "cnw_share_tw_count": 30, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Ellie Kemper Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/ellie-kemper-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2014/04/GettyImages-886617106.jpg", "site_name": "Celebrity Net Worth"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2022-04-05T22:49:29+00:00", "published_time": "2021-04-03T06:59:06+00:00", "section": "Actors", "tag": "ellie kemper worth"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2014/04/GettyImages-886617106.jpg", "title": "Ellie Kemper Net Worth", "description": "Ellie Kemper is an American actress, comedian, and writer who has a net worth of $9 million. Kemper is best known for playing Erin Hannon on the NBC sitcom \"The Office\" (2009–2013) and Kimmy Schm..."}}, "movies": [], "publish_date": 1617433146.0, "source": "https://www.celebritynetworth.com", "summary": ""}