{"url": "https://www.hollywoodreporter.com/features/rose-mcgowan-shares-her-secret-being-happier-2018-thr-interview-1109996", "text": "Rose McGowan is camped out at Brother Jimmy’s BBQ, a divey New York institution across the street from Penn Station, waiting for her train to Washington, D.C. The 44-year-old actress turned activist is accompanied by attorney Jennifer Robinson and a publicist from E!, the home of McGowan’s docuseries, Citizen Rose, which returns May 17. Their ultimate destination: Leesburg, Virginia, a 45-minute drive from D.C., where tomorrow, on May 3, McGowan must appear before a judge at the Loudoun County courthouse on a felony cocaine charge she’s facing.\n\nThe train is delayed; it was supposed to be 15 minutes, but now the holdup has been extended long enough that the table is littered with glasses of white wine, baskets of hush puppies, fried pickles, pulled chicken sliders, a half-emptied ramekin of ranch dressing and, for McGowan, a bowl of mashed potatoes with gravy. The waitress arrives to clear and brings a bit of good news — the drinks (McGowan stuck to iced tea) along with half of the food will be comped. Turns out the manager, a bearded guy with big biceps, is a huge fan of McGowan’s films. A moment later, a server from another table arrives. “You’re such an inspiration for speaking out,” she tells McGowan.\n\nIt’s been just over six months since McGowan came forward with allegations of rape by Harvey Weinstein — a man she’ll now refer to only as “the Monster” — helping (along with several other actresses) to expose his decades-long pattern of alleged sexual misconduct and igniting a movement that has fundamentally changed the worlds of entertainment, media and politics. The fallout has swept up everyone from Kevin Spacey to Charlie Rose to, days after this trip, New York Attorney General Eric Schneiderman.\n\nTo some, McGowan remains an actress recognizable from movies like Scream, Jawbreaker and Grindhouse and TV shows including Charmed and Once Upon a Time. To many others, she is now something much more — the most visible and at times most polarizing voice of #MeToo.\n\nIn that role, she has also become a de facto therapist. Other women seek her out to share their stories of sexual assault. “A lot of the time, I’m the first person they are telling,” she says, “and it can be hard being a receptacle for that.” But she always listens, she says, “to honor their journey and their pain.”\n\nFinally, after waiting more than three hours, McGowan and crew board the Acela. In the course of the three-hour journey, she will speak openly and expansively about how the past six months have reshaped her life — on the repercussions of being among the first to speak out in a series of articles last October, on her critics and the public undoing that led to her canceling her book tour, on her new plan to leave Los Angeles for good. In fact, there’s only one subject she has asked to keep off the record: the identity of her new romantic partner of about a month, who’s also on the train.\n\n“I’m with an activist and a very awake individual,” says McGowan, choosing her words — and pronouns — carefully. “When the wreckage of the past gets cleared away, you can see your future a lot more clearly. There are things I didn’t really know about myself. I’ve been a lot happier in this last month than I have been in a long time,” she says, adding with a laugh, “It takes a very complex and adventurous human to want to be with me.”\n\nMcGowan has a complicated relationship with the press. Being accompanied by a journalist today was her idea (as was this profile), yet she feels generally unhappy with the way she is portrayed. “If I was Reese Witherspoon, would I be treated like I am? The answer is no. But [the press] feels I’m fair game. I think it’s because [Weinstein] paid off the media for 20 years to savage me.”\n\nShe generally prefers to tell her own story, whether that’s on Twitter, where she has 915,000 followers (the #RoseArmy), in her memoir-meets-manifesto Brave, which came out in January, or via her E! docuseries. Reality vet Jonathan Murray (Keeping Up With the Kardashians) says producing McGowan’s show reminds him of friends who were members of the AIDS activist group Act Up. “Every movement has that person who lights the fuse and speaks truth to power,” he explains. “There are other parts of the movement that are gentler, but most need a spark plug. That’s Rose.” Producer Andrea Metz adds: “We seldom get to see a hero in today’s world who is so authentic and unafraid to show her flaws. Rose isn’t someone you can confine in a box.”\n\nOccasionally, though, the sparks lead to self-immolation. Throughout her January press blitz promoting Brave, McGowan was asked repeatedly to recount in detail her alleged assault, which she says was traumatic and caused her to become unhinged. During a much-maligned Jan. 31 appearance on The Late Show With Stephen Colbert, wearing an orange hoodie, McGowan veered from the host’s questions and blasted men who wear khakis. The taping was just a few hours after a disastrous stop at a New York Barnes & Noble, where a trans woman berated McGowan for comments she made on RuPaul’s podcast (McGowan had said that just “because [a trans person] felt like a woman on the inside, that’s not developing as a woman”). The interaction escalated and within seconds was a full-on shouting match.\n\nMcGowan, who maintains that the woman was a paid plant (though she won’t say by whom), was criticized for her role and for blasting back confusing rebuttals like, “I’m not from your planet!” She was “on the ropes,” as she puts it. She abruptly canceled all press engagements, fired her publicist and retreated from the public eye.\n\n“At first, I was staying at a farm with miniature ponies, but they had a wedding. So I had to leave and went to a retirement community in Florida called The Villages, which had golf carts with Trump stickers. It was like paradise for old people.” She found a mother-son therapist team nearby and did a five-day “intensive trauma” session, parts of which will be featured on Citizen Rose. Capturing moments like these and giving McGowan a platform was “a no brainer” for E! says network president Adam Stotsky. “It’s highly topical, buzzworthy and the ultimate true Hollywood story in some ways.”\n\nHer recent public interactions have been more measured. For example, after Bill Cosby was convicted April 26 of three counts of sexual assault in a Pennsylvania courtroom, McGowan’s subsequent tweet was noticeably restrained: “His victims can now exhale. Thank you judge and jury. Thank you society for waking up.” While she still loves the extra punch profanity provides on Twitter, she admits she put a lot of thought into the Cosby tweet because, as a survivor, she had to wade through her own emotions while watching the news from London. “It felt like we’d won the Super Bowl of all Super Bowls,” she says of the verdict. Even simply recalling the experience brings tears, which she doesn’t hold back. “When I saw those brave women crying and breaking down afterwards, I felt a sense of shame because I was both thrilled for them, but I was also jealous.”\n\nDoes she think she will ever be able to face down Weinstein in the same way? “I hope I’m wrong when I say that I don’t think he will go to prison,” she says “People do have to gather evidence, and that takes time. But if two women pointed somebody out that stole our purses, he’d be arrested. So how many women does it take to say he stole us? He stole our careers, stole our lives, stole our reputations. He stole how my family treats me, how men treat me, he stole all that.” (Wesintein has denied all allegations of non-consensual sex. He declined to comment specifically for this story.)\n\n“Sometimes you’re just earmarked for weirdness from birth,” McGowan writes in Brave, referring to her own delivery — in Certaldo, Italy — at a Children of God commune by a blind midwife. Her parents were faithful followers of the cult’s founder, David Berg, and McGowan’s father, Daniel, eventually became a leader of the group’s Italian chapter. “I would watch him, he would turn on his light and his energy and just take people on a journey,” she explains. “I know I can do that too, and I know where I get it from, but I don’t have that male Achilles’ heel of needing to be worshipped.”\n\nHer family fled the group before she hit her teens because Children of God began advocating sex with children as a way of achieving spiritual enlightenment. Given her background, one wonders what McGowan makes of the current headlines surrounding Nxivm, a cult whose leader Keith Raniere and disciple and former Smallville actress Allison Mack are accused of sex trafficking and branding female members. “My take on [Nxivm] is that it’s doing a very intense version of what a lot of people in Hollywood already do,” says McGowan of the group’s objectification of women. “It’s just a more intensified version, so we can point at it and be like, ‘That’s so wild.’ I’m like, ‘Yes, but what do you do?’ “\n\nAfter leaving Italy, McGowan’s family settled in Eugene, Oregon, where she had a hard time adjusting. On the night of her first (and only) school dance, she tried LSD, which led to a bad trip that landed her in rehab at 13. She escaped, living on the streets for close to a year before returning to live with her strict father, who by then had settled in Seattle. When she was 14, he forced her to get a job to pay her share of the rent, which is what led McGowan to respond to a flyer advertising $35 a day to be a movie extra. In 1992, she landed her first speaking role in the comedy Encino Man, starring Brendan Fraser. Soon after, “a mean agent lady” suggested that since she now was making money, she should emancipate from her parents; at 15, she did.\n\nIn 1995, her performance as a troubled teen in Gregg Araki’s The Doom Generation earned her a Spirit Award nomination and helped her score a scene-stealing role in 1996’s Scream, produced by Dimension Films, Miramax’s genre division run by Harvey’s brother, Bob. The following year, she headed to the Sundance Film Festival with three projects. Harvey attended the premiere of one, Going All the Way, in which she has a topless scene. After it came onscreen, McGowan claims, she saw her then-manager Jill Messick turn and nod to the mogul. It was Messick who set up the meeting the next morning between Weinstein and McGowan at the Stein Eriksen Lodge that McGowan says ended with her being sexually assaulted in a hot tub.\n\nMcGowan struck a $100,000 settlement over the incident, an agreement Messick and her colleagues at the time were involved with. McGowan later would suggest that the manager, who took a job at Miramax less than a year later, was part of Weinstein’s complicity machine.\n\nMessick, who suffered from bipolar disorder, died by suicide in February. After her death, her family provided THR a scathing statement: “Seeing her name in headlines again and again, as part of one person’s attempt to gain more attention for her personal cause, along with Harvey’s desperate attempt to vindicate himself, was devastating for her. It broke Jill, who was just starting to get her life back on track.” While the statement didn’t mention McGowan by name, the implication was clear.\n\nOn Messick’s suicide, McGowan will say only that her death was a tragedy. “We need to look at the real person who’s behind this. That person has blood on his hands, and we all know, once again, who I’m talking about.” (The Messick family declined to comment further on McGowan for this story.)\n\nFor years, McGowan says, she turned down multiple reporters chasing the Weinstein story (including some from THR) because “society wasn’t ready.” It wasn’t until she went searching for her settlement agreement with Weinstein to pass to New York Times reporters Jodi Kantor and Megan Twohey — who would end up breaking the first allegations against him on Oct. 5 — that McGowan says she realized it didn’t contain a confidentiality clause, allowing her to speak out.\n\nDuring the same period, Ronan Farrow was working on his own story about Weinstein, initially for NBC News. Network executives have said the story did not meet its standards to go to air at that point; Farrow has suggested otherwise. He eventually took his material to The New Yorker. “NBC took a lot of heat for killing the story. But I actually served Ronan with a cease and desist — two of them,” says McGowan, who sat for an on-camera interview with Farrow in January 2017; a source who has seen the interview says she did not name Weinstein, but in subsequent on-the-record interviews, she did in fact name Weinstein. Her attorneys then revoked consent.\n\n“I did not want my rape spoken about over breakfast cereal on the Today show,” adds McGowan. “I’d heard about Matt Lauer. You can’t tell me the people at the top of NBC aren’t aware. Come on.” (NBC and Farrow declined comment, though sources close to the story tell THR that McGowan did not express concern at the time about Lauer, who was fired amid sexual harassment allegations in November.)\n\n“I was never going to let my story be on NBC, but I wanted to ensure that the Times would do it, and everybody before had folded. So I pitted [Farrow] against The New York Times. I understand how men work and how Hollywood works and how power works. People are going to be much more interested in going down the line with something if they know they’re competing with somebody else.”\n\nThough she spoke with The New York Times and provided the paper with her account and settlement agreement, she didn’t go on the record in the first round of Weinstein stories, in contrast to Ashley Judd, Gwyneth Paltrow and Angelina Jolie. “I am the first one that spoke [about Weinstein],” she says of her reasons. “I spoke for a long time. I spoke obliquely about it. But in the articles, I let the documents [do the work]. I wanted other people to have a chance to speak because I knew I had a book coming out. I knew I would override other women’s voices, and I didn’t want that to happen.”\n\nNotes fellow Weinstein accuser Asia Argento, “There are people who say she’s doing this for her own glorification. She’s doing this to help other women.” Argento credits McGowan with her own decision to come forward: “When I spoke to Ronan, I heard that Rose had the same experience I did. I reached out to her from Paris on Sept. 28, and we spoke all night. Without her, I wouldn’t have gone on the record. Rose is a hero to me.”\n\nTo other prominent members of the #MeToo and Time’s Up movements, however, McGowan has been both one of their fiercest allies and a thorn in their collective side. She criticized peers who wore black to the Golden Globes in a show of solidarity, tweeting to Argento: “And not one of those fancy people wearing black to honor our rapes would have lifted a finger. … I have no time for Hollywood fakery.” She also blasted Meryl Streep for what she believed was her complicity in covering for Weinstein. Streep responded in a rare open letter, saying, “It hurt to be attacked by Rose McGowan in banner headlines this weekend, but I want to let her know I did not know about Weinstein’s crimes.”\n\nMcGowan doesn’t buy it. “It still makes me mad,” she says. “If I was living next door to someone and I heard them beating up their kid every night, I wouldn’t turn my TV up louder. I would be in there, doing every single thing I could to help that kid and get them out and get them a new life. But that’s me, and I have to come to peace with the fact that not everybody’s like that.”\n\nAs part of her recovery process, she’s learning to take extended breaks from social media, something she now identifies as “self-care” which means more than getting a blowout or a manicure. But she has noticed many online who questioned the fact that she made a movie with director Victor Ronald Salva. He directed her in the 2011 film Rosewood Lane, 13 years after he was convicted for charges relating to sexual abuse of a 12-year-old male actor. I ask her if she knew about it when she took the part. “Nobody told me,” she says. “I didn’t know I was supposed to Google that before I worked with people…(or) look at a sex offender registry before working with a director. So yeah, I take responsibility, I accidentally worked with a child molester. But I’ll bet you that you have too.”\n\nMcGowan says it was not an overnight decision to step out of the shadows. In fact, she had been plotting it for years, she says, even using her career to help configure the pieces of the puzzle. “One of the reasons I did Charmed was not just because it was offered — it was I studied. It was already a hit show when I joined and I realized it was going in all these territories where then I could keep a certain profile just enough to make it newsworthy when it was time. But society wasn’t there yet, they weren’t awake enough yet. [President Donald] Trump really helped. Thanks, Trump.”\n\nMcGowan eventually did go on the record for Farrow, working with him on several investigations, including an explosive 5,300-word New Yorker piece, published in November, about how Weinstein hired two intelligence companies, Kroll and Black Cube, to help silence accusers and the journalists investigating their claims. McGowan says she was a target — that 125 pages of her book were stolen ahead of its release and that she was befriended by former Israeli spies working for Black Cube who attempted to glean information about her plans to come forward.\n\nNow her legal team is using these claims to explain the two baggies filled with cocaine found in McGowan’s left-behind Chanel wallet in the first-class cabin on a United Airlines flight after it landed at Dulles International Airport on Jan. 21, 2017. She claims there were no drugs in her wallet when it was last in her possession. Upon learning that a warrant was issued for her arrest, she tweeted: “Are they trying to silence me?”\n\nIt’s a bit of a scene outside the Loudoun County courthouse. Reporters and camera crews from NBC, Fox and The Washington Post gather on the grass underneath a tree to block the midday sun, all waiting for McGowan. Just before 1 p.m., she arrives, flanked by attorneys Robinson and Jessica Carmichael, who will represent her during the hearing. The three hold hands and don’t let go until they’ve entered the building.\n\nToday’s hearing is to determine whether there is enough evidence to present the case to the grand jury. Carmichael asks the court for the charges to be dismissed on insufficient evidence. In response, the prosecution calls witnesses — cleaning crew, firefighters, police officers — who testify about finding the wallet, discovering baggies of white powder and connecting it with McGowan. Argento remains skeptical of the charges. “Who nowadays would travel with cocaine in their wallet?” she asks. “I’ve met many drug addicts in my life. Even the most tweaked-out crazy meth addict wouldn’t do that. They’d stick it in their bum. Rose is a smart woman. If she was so addicted, she would’ve found a way to find drugs. My hope is that they will leave it as something completely planted.”\n\nThroughout the proceedings, McGowan is stoic, maintaining eye contact with the witness or the presiding judge, Dean Worcester. After about two hours, he rules that enough probable cause exists to go to a grand jury and sets a hearing for June 11. McGowan has lost this round.\n\nIf indicted and convicted, she could face a maximum of 10 years in prison. The irony that she may serve time while her accused rapist gets none is not lost on her. “I’m the only one who’s had handcuffs on me so far in this situation,” she says. “That’s not right.”\n\nCrueler still may be the fact that she can’t escape Weinstein, who has become part of the daily news cycle — most recently when Lantern Capital won the bid to buy The Weinstein Co. in bankruptcy. “I wish it would just all stop and die a quiet, swift death,” says McGowan. “For anybody to profit off it is really egregious and sick.”\n\nTo get a little breathing room, she’s leaving L.A. — she hopes for good. In March, she finalized the sale of her Hollywood Hills home for $2 million and hawked most of her stuff in an estate sale. She had the opportunity to watch all of it on a live feed but couldn’t bring herself to do it. Her art went into storage, and everything else — including a beloved RKO sign that she’d purchased at Off the Wall Antiques on La Cienega — to new owners.\n\n“My house was my cord to Los Angeles,” she says. “It doesn’t mean that I don’t love it as a city, but it was a very unsafe place for me. I mean, people have come up to me on the street and said, ‘Oh, did you get any good Weinstein scripts lately?’ Just to see my reaction. It’s really fucked up.”\n\nShe no longer has a permanent home. “I’ll just roam,” she says, though she’d like to settle in London or New York in the short term. Eventually, she wants to live in India. She visited New Delhi in December to speak at the Hindustan Times Leadership Summit, where she met former President Barack Obama.\n\n“I was disappointed he didn’t acknowledge a global fight, let alone mine,” she admits. “It was after everything had come out,” but he didn’t mention her Weinstein battles. This was especially hard for her because Obama’s daughter Malia had interned at the Weinstein Co. “I was sitting right in front of him, and he would not meet my eyes, and then at the last minute, he asked for Naomi Campbell to be put in a photo with us,” recalls McGowan. She says she was hoping she’d hear, “I’m sorry” or “Keep going, Rose.” “All he said was: ‘You ladies sure know how to pose.’ I wanted him to be better.”\n\nFor now, she’ll live off the money from the sale of her house “for like a year” before getting serious about figuring things out financially. “Of course I’m scared,” she says. SAG-AFTRA health insurance and a retirement plan temper the fear, and there are her other investments — in a medical marijuana company called Beboe and a previous stake in blowout salon Drybar — that also provide a cushion.\n\nSpeaking out has also provided a springboard to another new calling. McGowan, who is proud of a recent DLD Impact Award she accepted in Munich, is part of the initial group of accusers like Judd who have found themselves in-demand as inspirational speakers. Eventually the goal is to balance activism with writing, directing and making music (to promote her upcoming debut album, Planet 9, she’ll play the Le Guess Who? festival in the Netherlands in November). No longer an actress, McGowan mostly sees herself as an artist and a survivor, one who, for the first time in her life, has found her voice through her rage.\n\n“I do torch things,” she says. But now she’s in renewal phase. “If you go into a forest right after a fire, within days, there’s green grass growing underneath the ashes,” she says. “That’s what I’m doing right now. I’m like the grass, growing.”\n\nThis story first appeared in the May 9 issue of The Hollywood Reporter magazine. To receive the magazine, click here to subscribe.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/05/photocredit_liberatuminstagram_29403891_202507570482134_4537864627349880832_n-embed_2018.jpg?w=928", "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/ap_18123725663699-embed.jpg?w=928", "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/20180502_0245-embed_thr.jpg?w=928", "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/splash_mcgowan3.jpg?w=1500&h=844&crop=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/16cover_lores-thr_cover_2018.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/splash_mcgowan3.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/20180502_0283-embed_thr.jpg?w=928", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/book_rose-embed.jpg?w=928"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/splash_mcgowan3.jpg?w=1024", "keywords": [], "authors": ["Chris Gardner"], "canonical_link": "https://www.hollywoodreporter.com/movies/movie-features/rose-mcgowan-shares-her-secret-being-happier-2018-thr-interview-1109996/", "title": "On the Road With Rose McGowan: An Actress Turned Activist Leaves the “Hollywood Bubble” Behind", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Six months since going public with rape accusations about Harvey Weinstein and helping to ignite the #MeToo movement, McGowan has been portrayed as both a fearless hero and flame-throwing narcissist. Now, as her E! docuseries returns and she battles a cocaine charge (she says it's a setup), the actress-activist opens up about why she helped torpedo her story on NBC (\"I'd heard about Lauer\") and her decision to leave Hollywood: \"I've been a lot happier in this last month than I have been in a long time.\"", "news_keywords": "Harassment in Hollywood, nsfs, Rose McGowan, THRX", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Chris Gardner", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1109996, "title": "On the Road With Rose McGowan: An Actress Turned Activist Leaves the \"Hollywood Bubble\" Behind", "published_at": "2018-05-09 06:00:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/splash_mcgowan3.jpg?w=1024", "comment_count": 0, "tags": "THRX", "topics": "Movies", "body": "Rose McGowan is camped out at Brother Jimmy's BBQ, a divey New York institution across the street from Penn Station, waiting for her train to Washington, D.C. The 44-year-old actress turned activist is accompanied by attorney Jennifer Robinson and a publicist from E!, the home of McGowan's docuseries, Citizen Rose, which returns May 17. Their ultimate destination: Leesburg, Virginia, a 45-minute drive from D.C., where tomorrow, on May 3, McGowan must appear before a judge at the Loudoun County courthouse on a felony cocaine charge she's facing.\r\nThe train is delayed; it was supposed to be 15 minutes, but now the holdup has been extended long enough that the table is littered with glasses of white wine, baskets of hush puppies, fried pickles, pulled chicken sliders, a half-emptied ramekin of ranch dressing and, for McGowan, a bowl of mashed potatoes with gravy. The waitress arrives to clear and brings a bit of good news — the drinks (McGowan stuck to iced tea) along with half of the food will be comped. Turns out the manager, a bearded guy with big biceps, is a huge fan of McGowan's films. A moment later, a server from another table arrives. \"You're such an inspiration for speaking out,\" she tells McGowan.\r\nIt's been just over six months since McGowan came forward with allegations of rape by Harvey Weinstein — a man she'll now refer to only as \"the Monster\" — helping (along with several other actresses) to expose his decades-long pattern of alleged sexual misconduct and igniting a movement that has fundamentally changed the worlds of entertainment, media and politics. The fallout has swept up everyone from Kevin Spacey to Charlie Rose to, days after this trip, New York Attorney General Eric Schneiderman.\r\nTo some, McGowan remains an actress recognizable from movies like Scream, Jawbreaker and Grindhouse and TV shows including Charmed and Once Upon a Time. To many others, she is now something much more — the most visible and at times most polarizing voice of #MeToo.\r\nIn that role, she has also become a de facto therapist. Other women seek her out to share their stories of sexual assault. \"A lot of the time, I'm the first person they are telling,\" she says, \"and it can be hard being a receptacle for that.\" But she always listens, she says, \"to honor their journey and their pain.\" \r\n\r\nFinally, after waiting more than three hours, McGowan and crew board the Acela. In the course of the three-hour journey, she will speak openly and expansively about how the past six months have reshaped her life — on the repercussions of being among the first to speak out in a series of articles last October, on her critics and the public undoing that led to her canceling her book tour, on her new plan to leave Los Angeles for good. In fact, there's only one subject she has asked to keep off the record: the identity of her new romantic partner of about a month, who's also on the train.\r\n\r\n\"I'm with an activist and a very awake individual,\" says McGowan, choosing her words — and pronouns — carefully. \"When the wreckage of the past gets cleared away, you can see your future a lot more clearly. There are things I didn't really know about myself. I've been a lot happier in this last month than I have been in a long time,\" she says, adding with a laugh, \"It takes a very complex and adventurous human to want to be with me.\"\r\nMcGowan has a complicated relationship with the press. Being accompanied by a journalist today was her idea (as was this profile), yet she feels generally unhappy with the way she is portrayed. \"If I was Reese Witherspoon, would I be treated like I am? The answer is no. But [the press] feels I'm fair game. I think it's because [Weinstein] paid off the media for 20 years to savage me.\"\r\nShe generally prefers to tell her own story, whether that's on Twitter, where she has 915,000 followers (the #RoseArmy), in her memoir-meets-manifesto Brave, which came out in January, or via her E! docuseries. Reality vet Jonathan Murray (Keeping Up With the Kardashians) says producing McGowan's show reminds him of friends who were members of the AIDS activist group Act Up. \"Every movement has that person who lights the fuse and speaks truth to power,\" he explains. \"There are other parts of the movement that are gentler, but most need a spark plug. That's Rose.\" Producer Andrea Metz adds: \"We seldom get to see a hero in today’s world who is so authentic and unafraid to show her flaws. Rose isn’t someone you can confine in a box.\"\r\nOccasionally, though, the sparks lead to self-immolation. Throughout her January press blitz promoting Brave, McGowan was asked repeatedly to recount in detail her alleged assault, which she says was traumatic and caused her to become unhinged. During a much-maligned Jan. 31 appearance on The Late Show With Stephen Colbert, wearing an orange hoodie, McGowan veered from the host's questions and blasted men who wear khakis. The taping was just a few hours after a disastrous stop at a New York Barnes & Noble, where a trans woman berated McGowan for comments she made on RuPaul's podcast (McGowan had said that just \"because [a trans person] felt like a woman on the inside, that's not developing as a woman\"). The interaction escalated and within seconds was a full-on shouting match.\r\n\r\nMcGowan, who maintains that the woman was a paid plant (though she won't say by whom), was criticized for her role and for blasting back confusing rebuttals like, \"I'm not from your planet!\" She was \"on the ropes,\" as she puts it. She abruptly canceled all press engagements, fired her publicist and retreated from the public eye.\r\n\"At first, I was staying at a farm with miniature ponies, but they had a wedding. So I had to leave and went to a retirement community in Florida called The Villages, which had golf carts with Trump stickers. It was like paradise for old people.\" She found a mother-son therapist team nearby and did a five-day \"intensive trauma\" session, parts of which will be featured on Citizen Rose. Capturing moments like these and giving McGowan a platform was \"a no brainer\" for E! says network president Adam Stotsky. \"It's highly topical, buzzworthy and the ultimate true Hollywood story in some ways.\"\r\nHer recent public interactions have been more measured. For example, after Bill Cosby was convicted April 26 of three counts of sexual assault in a Pennsylvania courtroom, McGowan's subsequent tweet was noticeably restrained: \"His victims can now exhale. Thank you judge and jury. Thank you society for waking up.\" While she still loves the extra punch profanity provides on Twitter, she admits she put a lot of thought into the Cosby tweet because, as a survivor, she had to wade through her own emotions while watching the news from London. \"It felt like we'd won the Super Bowl of all Super Bowls,\" she says of the verdict. Even simply recalling the experience brings tears, which she doesn't hold back. \"When I saw those brave women crying and breaking down afterwards, I felt a sense of shame because I was both thrilled for them, but I was also jealous.\"\r\nDoes she think she will ever be able to face down Weinstein in the same way? \"I hope I'm wrong when I say that I don't think he will go to prison,\" she says \"People do have to gather evidence, and that takes time. But if two women pointed somebody out that stole our purses, he'd be arrested. So how many women does it take to say he stole us? He stole our careers, stole our lives, stole our reputations. He stole how my family treats me, how men treat me, he stole all that.\" (Wesintein has denied all allegations of non-consensual sex. He declined to comment specifically for this story.)\r\n\r\n\"Sometimes you're just earmarked for weirdness from birth,\" McGowan writes in Brave, referring to her own delivery — in Certaldo, Italy — at a Children of God commune by a blind midwife. Her parents were faithful followers of the cult's founder, David Berg, and McGowan's father, Daniel, eventually became a leader of the group's Italian chapter. \"I would watch him, he would turn on his light and his energy and just take people on a journey,\" she explains. \"I know I can do that too, and I know where I get it from, but I don't have that male Achilles' heel of needing to be worshipped.\"\r\nHer family fled the group before she hit her teens because Children of God began advocating sex with children as a way of achieving spiritual enlightenment. Given her background, one wonders what McGowan makes of the current headlines surrounding Nxivm, a cult whose leader Keith Raniere and disciple and former Smallville actress Allison Mack are accused of sex trafficking and branding female members. \"My take on [Nxivm] is that it's doing a very intense version of what a lot of people in Hollywood already do,\" says McGowan of the group's objectification of women. \"It's just a more intensified version, so we can point at it and be like, 'That's so wild.' I'm like, 'Yes, but what do you do?' \"\r\nAfter leaving Italy, McGowan's family settled in Eugene, Oregon, where she had a hard time adjusting. On the night of her first (and only) school dance, she tried LSD, which led to a bad trip that landed her in rehab at 13. She escaped, living on the streets for close to a year before returning to live with her strict father, who by then had settled in Seattle. When she was 14, he forced her to get a job to pay her share of the rent, which is what led McGowan to respond to a flyer advertising $35 a day to be a movie extra. In 1992, she landed her first speaking role in the comedy Encino Man, starring Brendan Fraser. Soon after, \"a mean agent lady\" suggested that since she now was making money, she should emancipate from her parents; at 15, she did.\r\nIn 1995, her performance as a troubled teen in Gregg Araki's The Doom Generation earned her a Spirit Award nomination and helped her score a scene-stealing role in 1996's Scream, produced by Dimension Films, Miramax's genre division run by Harvey's brother, Bob. The following year, she headed to the Sundance Film Festival with three projects. Harvey attended the premiere of one, Going All the Way, in which she has a topless scene. After it came onscreen, McGowan claims, she saw her then-manager Jill Messick turn and nod to the mogul. It was Messick who set up the meeting the next morning between Weinstein and McGowan at the Stein Eriksen Lodge that McGowan says ended with her being sexually assaulted in a hot tub.\r\nMcGowan struck a $100,000 settlement over the incident, an agreement Messick and her colleagues at the time were involved with. McGowan later would suggest that the manager, who took a job at Miramax less than a year later, was part of Weinstein's complicity machine.\r\nMessick, who suffered from bipolar disorder, died by suicide in February. After her death, her family provided THR a scathing statement: \"Seeing her name in headlines again and again, as part of one person's attempt to gain more attention for her personal cause, along with Harvey's desperate attempt to vindicate himself, was devastating for her. It broke Jill, who was just starting to get her life back on track.\" While the statement didn't mention McGowan by name, the implication was clear.\r\nOn Messick's suicide, McGowan will say only that her death was a tragedy. \"We need to look at the real person who's behind this. That person has blood on his hands, and we all know, once again, who I'm talking about.\" (The Messick family declined to comment further on McGowan for this story.)\r\nFor years, McGowan says, she turned down multiple reporters chasing the Weinstein story (including some from THR) because \"society wasn't ready.\" It wasn't until she went searching for her settlement agreement with Weinstein to pass to New York Times reporters Jodi Kantor and Megan Twohey — who would end up breaking the first allegations against him on Oct. 5 — that McGowan says she realized it didn't contain a confidentiality clause, allowing her to speak out.\r\nDuring the same period, Ronan Farrow was working on his own story about Weinstein, initially for NBC News. Network executives have said the story did not meet its standards to go to air at that point; Farrow has suggested otherwise. He eventually took his material to The New Yorker. \"NBC took a lot of heat for killing the story. But I actually served Ronan with a cease and desist — two of them,\" says McGowan, who sat for an on-camera interview with Farrow in January 2017; a source who has seen the interview says she did not name Weinstein, but in subsequent on-the-record interviews, she did in fact name Weinstein. Her attorneys then revoked consent.\r\n\"I did not want my rape spoken about over breakfast cereal on the Today show,\" adds McGowan. \"I'd heard about Matt Lauer. You can't tell me the people at the top of NBC aren't aware. Come on.\" (NBC and Farrow declined comment, though sources close to the story tell THR that McGowan did not express concern at the time about Lauer, who was fired amid sexual harassment allegations in November.)\r\n\"I was never going to let my story be on NBC, but I wanted to ensure that the Times would do it, and everybody before had folded. So I pitted [Farrow] against The New York Times. I understand how men work and how Hollywood works and how power works. People are going to be much more interested in going down the line with something if they know they're competing with somebody else.\"\r\n\r\nThough she spoke with The New York Times and provided the paper with her account and settlement agreement, she didn't go on the record in the first round of Weinstein stories, in contrast to Ashley Judd, Gwyneth Paltrow and Angelina Jolie. \"I am the first one that spoke [about Weinstein],\" she says of her reasons. \"I spoke for a long time. I spoke obliquely about it. But in the articles, I let the documents [do the work]. I wanted other people to have a chance to speak because I knew I had a book coming out. I knew I would override other women's voices, and I didn't want that to happen.\"\r\nNotes fellow Weinstein accuser Asia Argento, \"There are people who say she's doing this for her own glorification. She's doing this to help other women.\" Argento credits McGowan with her own decision to come forward: \"When I spoke to Ronan, I heard that Rose had the same experience I did. I reached out to her from Paris on Sept. 28, and we spoke all night. Without her, I wouldn't have gone on the record. Rose is a hero to me.\"\r\nTo other prominent members of the #MeToo and Time's Up movements, however, McGowan has been both one of their fiercest allies and a thorn in their collective side. She criticized peers who wore black to the Golden Globes in a show of solidarity, tweeting to Argento: \"And not one of those fancy people wearing black to honor our rapes would have lifted a finger. … I have no time for Hollywood fakery.\" She also blasted Meryl Streep for what she believed was her complicity in covering for Weinstein. Streep responded in a rare open letter, saying, \"It hurt to be attacked by Rose McGowan in banner headlines this weekend, but I want to let her know I did not know about Weinstein's crimes.\"\r\nMcGowan doesn't buy it. \"It still makes me mad,\" she says. \"If I was living next door to someone and I heard them beating up their kid every night, I wouldn't turn my TV up louder. I would be in there, doing every single thing I could to help that kid and get them out and get them a new life. But that's me, and I have to come to peace with the fact that not everybody's like that.\"\r\nAs part of her recovery process, she’s learning to take extended breaks from social media, something she now identifies as “self-care” which means more than getting a blowout or a manicure. But she has noticed many online who questioned the fact that she made a movie with director Victor Ronald Salva. He directed her in the 2011 film Rosewood Lane, 13 years after he was convicted for charges relating to sexual abuse of a 12-year-old male actor. I ask her if she knew about it when she took the part. “Nobody told me,” she says. “I didn’t know I was supposed to Google that before I worked with people…(or) look at a sex offender registry before working with a director. So yeah, I take responsibility, I accidentally worked with a child molester. But I'll bet you that you have too.”\r\nMcGowan says it was not an overnight decision to step out of the shadows. In fact, she had been plotting it for years, she says, even using her career to help configure the pieces of the puzzle. \"One of the reasons I did Charmed was not just because it was offered — it was I studied. It was already a hit show when I joined and I realized it was going in all these territories where then I could keep a certain profile just enough to make it newsworthy when it was time. But society wasn't there yet, they weren't awake enough yet. [President Donald] Trump really helped. Thanks, Trump.\"\r\nMcGowan eventually did go on the record for Farrow, working with him on several investigations, including an explosive 5,300-word New Yorker piece, published in November, about how Weinstein hired two intelligence companies, Kroll and Black Cube, to help silence accusers and the journalists investigating their claims. McGowan says she was a target — that 125 pages of her book were stolen ahead of its release and that she was befriended by former Israeli spies working for Black Cube who attempted to glean information about her plans to come forward.\r\nNow her legal team is using these claims to explain the two baggies filled with cocaine found in McGowan's left-behind Chanel wallet in the first-class cabin on a United Airlines flight after it landed at Dulles International Airport on Jan. 21, 2017. She claims there were no drugs in her wallet when it was last in her possession. Upon learning that a warrant was issued for her arrest, she tweeted: \"Are they trying to silence me?\"\r\nIt's a bit of a scene outside the Loudoun County courthouse. Reporters and camera crews from NBC, Fox and The Washington Post gather on the grass underneath a tree to block the midday sun, all waiting for McGowan. Just before 1 p.m., she arrives, flanked by attorneys Robinson and Jessica Carmichael, who will represent her during the hearing. The three hold hands and don't let go until they've entered the building.\r\nToday's hearing is to determine whether there is enough evidence to present the case to the grand jury. Carmichael asks the court for the charges to be dismissed on insufficient evidence. In response, the prosecution calls witnesses — cleaning crew, firefighters, police officers — who testify about finding the wallet, discovering baggies of white powder and connecting it with McGowan. Argento remains skeptical of the charges. \"Who nowadays would travel with cocaine in their wallet?\" she asks. \"I've met many drug addicts in my life. Even the most tweaked-out crazy meth addict wouldn't do that. They'd stick it in their bum. Rose is a smart woman. If she was so addicted, she would've found a way to find drugs. My hope is that they will leave it as something completely planted.\"\r\nThroughout the proceedings, McGowan is stoic, maintaining eye contact with the witness or the presiding judge, Dean Worcester. After about two hours, he rules that enough probable cause exists to go to a grand jury and sets a hearing for June 11. McGowan has lost this round.\r\nIf indicted and convicted, she could face a maximum of 10 years in prison. The irony that she may serve time while her accused rapist gets none is not lost on her. \"I'm the only one who's had handcuffs on me so far in this situation,\" she says. \"That's not right.\"\r\nCrueler still may be the fact that she can't escape Weinstein, who has become part of the daily news cycle — most recently when Lantern Capital won the bid to buy The Weinstein Co. in bankruptcy. \"I wish it would just all stop and die a quiet, swift death,\" says McGowan. \"For anybody to profit off it is really egregious and sick.\"\r\nTo get a little breathing room, she's leaving L.A. — she hopes for good. In March, she finalized the sale of her Hollywood Hills home for $2 million and hawked most of her stuff in an estate sale. She had the opportunity to watch all of it on a live feed but couldn't bring herself to do it. Her art went into storage, and everything else — including a beloved RKO sign that she'd purchased at Off the Wall Antiques on La Cienega — to new owners.\r\n\"My house was my cord to Los Angeles,\" she says. \"It doesn't mean that I don't love it as a city, but it was a very unsafe place for me. I mean, people have come up to me on the street and said, 'Oh, did you get any good Weinstein scripts lately?' Just to see my reaction. It's really fucked up.\"\r\nShe no longer has a permanent home. \"I'll just roam,\" she says, though she'd like to settle in London or New York in the short term. Eventually, she wants to live in India. She visited New Delhi in December to speak at the Hindustan Times Leadership Summit, where she met former President Barack Obama.\r\n\r\n\"I was disappointed he didn't acknowledge a global fight, let alone mine,\" she admits. \"It was after everything had come out,\" but he didn't mention her Weinstein battles. This was especially hard for her because Obama's daughter Malia had interned at the Weinstein Co. \"I was sitting right in front of him, and he would not meet my eyes, and then at the last minute, he asked for Naomi Campbell to be put in a photo with us,\" recalls McGowan. She says she was hoping she'd hear, \"I'm sorry\" or \"Keep going, Rose.\" \"All he said was: 'You ladies sure know how to pose.' I wanted him to be better.\"\r\nFor now, she'll live off the money from the sale of her house \"for like a year\" before getting serious about figuring things out financially. \"Of course I'm scared,\" she says. SAG-AFTRA health insurance and a retirement plan temper the fear, and there are her other investments — in a medical marijuana company called Beboe and a previous stake in blowout salon Drybar — that also provide a cushion.\r\nSpeaking out has also provided a springboard to another new calling. McGowan, who is proud of a recent DLD Impact Award she accepted in Munich, is part of the initial group of accusers like Judd who have found themselves in-demand as inspirational speakers. Eventually the goal is to balance activism with writing, directing and making music (to promote her upcoming debut album, Planet 9, she'll play the Le Guess Who? festival in the Netherlands in November). No longer an actress, McGowan mostly sees herself as an artist and a survivor, one who, for the first time in her life, has found her voice through her rage.\r\n\"I do torch things,\" she says. But now she's in renewal phase. \"If you go into a forest right after a fire, within days, there's green grass growing underneath the ashes,\" she says. \"That's what I'm doing right now. I'm like the grass, growing.\"\r\n\r\nThis story first appeared in the May 9 issue of The Hollywood Reporter magazine. To receive the magazine, click here to subscribe.", "fb": {"pages": 14425952749}, "ia": {"markup_url": "https://www.hollywoodreporter.com/movies/movie-features/rose-mcgowan-shares-her-secret-being-happier-2018-thr-interview-1109996/?ia_markup=1"}, "fragment": "!", "og": {"type": "article", "title": "On the Road With Rose McGowan: An Actress Turned Activist Leaves the “Hollywood Bubble” Behind", "url": "https://www.hollywoodreporter.com/movies/movie-features/rose-mcgowan-shares-her-secret-being-happier-2018-thr-interview-1109996/", "description": "Six months since going public with rape accusations about Harvey Weinstein and helping to ignite the #MeToo movement, McGowan has been portrayed as both a fearless hero and flame-throwing narcissis…", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/splash_mcgowan3.jpg?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2018-05-09T06:00:00+00:00", "modified_time": "2018-05-10T05:30:11+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "On the Road With Rose McGowan: An Actress Turned Activist Leaves the “Hollywood Bubble” Behind", "description": "Six months since going public with rape accusations about Harvey Weinstein and helping to ignite the #MeToo movement, McGowan has been portrayed as both a fearless hero and flame-throwing narcissis…", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/splash_mcgowan3.jpg?w=1500"}}, "movies": [], "publish_date": 1525845600.0, "source": "https://www.hollywoodreporter.com", "summary": ""}