{"url": "https://www.celebritynetworth.com/richest-celebrities/actors/robert-wagner-net-worth/", "text": "Robert Wagner net worth: Robert Wagner is an American actor who has a net worth of $20 million dollars. That is a combined net worth with his wife of several decades, actress Jill St. John. Wagner is best known for starring in television shows like \"It Takes a Thief,\" \"Switch,\" and \"Hart to Hart.\"\n\nEarly Life: Robert John Wagner Jr. was born in Detroit, Michigan, on February 10, 1930. His mother Hazel was a telephone operator. His father, Robert Sr. was a traveling salesman who made a small fortune selling paint to the automotive industry and lacquer to Ford which was used on their dashboards. When he was 7, the family moved to Los Angeles. His father had apparently earned enough money to retire in sunny Southern California. They even custom-built a home in Bel Air, overlooking the Bel Air Country Club, which took over a year to complete.\n\nRobert Jr. was actually sent to California before the family. He was put on a train solo and literally shipped off the Hollywood Military Academy. Robert would attend four different military schools in Southern California, and many of his classmates were the children of famous actors. Wagner graduated from Saint Monica Catholic School in 1949.\n\nCareer: In the 1950s Robert began working as an extra. His film debut was in an uncredited role in 1950's \"The Happy Years.\" He was signed to Twentieth Century Fox when he was just 20 years old. His first film for Fox was \"Halls of Montezuma\", a 1951 World War II film. Richard Widmark starred with Wagner in a supporting role. He played another supporting role later that year in \"The Frogmen,\" also starring Widmark. 1952's \"With a Song in My Heart\" was when Wagner first gained attention when he played a small but effective part as a shell-shocked soldier.\n\nAfter appearing in several more small roles in various movies, he began to gain leading roles, and by 1953, he was starring in such pictures as \"Beneath the 12-Mile Reef\", \"Prince Valiant\", \"A Kiss Before Dying\" (for which he received tons of critical acclaim), and \"Between Heaven and Hell.\" In 1954, he starred in the popular Western \"Broken Lance.\" Wagner was then borrowed by Paramount for 1956's \"The Mountain,\" where he was cast as Spencer Tracy's brother. Back at Fox, he starred in \"Between Heaven and Hell\" and \"The True Story of Jesse James,\" playing the leading role for director Nicholas Ray, both of which were box office let downs. He tried to jumpstart his career by starring in then-wife Natalie Wood's \"All the Fine Young Cannibals\" in 1960.\n\nIn 1961, Wagner and Wood formed their own production company, Rona Productions. Wagner made \"The War Lover\" in 1962 with Steve McQueen, which filmed in England. After Wagner and Wood split, he relocated to Europe for a few years. There, he appeared in \"The Longest Day,\" \"The Condemned of Altona,\" and \"The Pink Panther,\" which was a massive hit in 1963 but Wagner's part was so minor that he was largely overlooked.\n\nIn the late 1960s, he took on the first of three roles that would make him a bonafide star, as Alexander Mundy in the hit series \"To Catch a Thief\". The show ran on ABC from 1968-1970. This marked his comeback, acting with Fred Astaire and earning an Emmy nomination for Best TV Actor.\n\nIn the mid-70s, he would star in another successful television series, as Pete Ryan in \"Switch\". The late 70s saw him starring in the wildly successful series, \"Hart to Hart\". He would be nominated for four Golden Globe Awards for his work on the show. In the 90s, he enjoyed a comeback, playing Number 2 in the \"Austin Powers\" franchise. Since then, he has guest-starred on such shows as \"Seinfeld\", \"Boston Legal\", \"Two and a Half Men\", \"Hustle\", and \"NCIS\", among others.\n\nPersonal Life: Wagner claimed in his memoirs to have had affairs with Joan Crawford, Elizabeth Taylor, Joan Collins, and other highly popular entertainers. He married Natalie Wood in December 1957 and they were divorced in 1962. Wagner married Marion Marshall in July 1963 and had one daughter, Katie. They divorced in 1971. Wagner was engaged to Tina Sinatra from 1970-1972, and after they broke it off, Wagner rekindled his romance with Wood and they remarried on July 16, 1972. They had a daughter, Courtney.\n\nNatalie Wood died when she drowned near the yacht Splendour when it was moored near Catalina Island on November 29, 1981. Also on board were Wagner, Christopher Walken, and Dennis Davern, the captain of the Splendour. It was never explained why Walken's wife Georgianne was not present on the trip. According to Wagner, when he went to bed, Wood was not there. The autopsy report revealed bruises on Wood's body and arms and abrasions on her cheek and that her blood alcohol content was 0.14%, and that two types of medication, a motion sickness pill and a painkiller, were present.\n\nIn his memoir \"Pieces of My Heart,\" Wagner said that he had had an argument with Wood before she disappeared. Two witnesses from a boat nearby stated they had heard a woman screaming for help during the night. The Los Angeles County coroner ruled her death an accident by drowning and hypothermia. The case was reopened in November 2011 when Davern, the captain of the boat, publicly stated that he had lied to police during the first investigation and that he had witnessed Wood and Wagner arguing that evening. He alleged that Wood had been flirting with Walken and that Wagner went into a jealous rage and that after Wood disappeared, Wagner had refused to let Davern turn on the searchlights and notify the authorities. Davern alleged that Wagner was responsible for Wood's death.\n\nIn February 2018, the Los Angeles County Sheriff's Department named Wagner as a person of interest in the investigation into Wood's death. Wagner has denied any involvement. After Natalie's death, Wagner became a stepfather to her then 11-year-old daughter Natasha Gregson Wagner.\n\nA few months after Woods' death, Wagner began dating actress Jill St. John. After eight years together, they married in 1990.\n\nReal Estate: In 1983 Robert paid $220,000 for a 1+ acre property in LA's Brentwood neighborhood that was originally built in 1940 by famed architect Cliff May to be used as his personal family residence. At some point he purchased the property next door and created a 1.6-acre compound complete with a large main house, guest house, tennis courts and horse stables. Wagner also reached out to Cliff May and hired him to complete a full renovation and expansion.\n\nIn August 2007 Wager and St. John sold the property for $14 million. The buyers were Rita Hogan – heiress to a Japanese video game empire and her husband Richard Edlund – an Oscar-winning cinematographer. For some reason, Richard and Rita never moved into the house, which sat empty for the next 12+ years. Unfortunately, Rita died in 2019. The Wagner/St. John mansion was sold in January 2021 for $11 million.\n\nAfter selling the Brentwood mansion, Robert and Jill St. John packed up and moved full-time to Aspen, Colorado where they had owned a house since 1995. They also continue to own a condo in Los Angeles.", "images": ["https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://vz.cnwimg.com/wp-content/uploads/2019/11/Robert-Wagner.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/wp-content/uploads/2019/11/rw.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2019/11/rw.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/robert-wagner-net-worth/", "title": "Robert Wagner Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Robert Wagner net worth: Robert Wagner is an American actor who has a net worth of $20 million dollars. That is a combined net worth with his wife of several decades", "cnw_share_fb_count": 27, "cnw_share_tw_count": 59, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Robert Wagner Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/robert-wagner-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2019/11/rw.jpg", "site_name": "Celebrity Net Worth", "description": "Robert Wagner net worth: Robert Wagner is an American actor who has a net worth of $20 million dollars. That is a combined net worth with his wife of several decades"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2021-02-04T15:18:11+00:00", "published_time": "2021-01-14T01:16:43+00:00", "section": "Actors", "tag": "Robert Wagner salary"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2019/11/rw.jpg", "title": "Robert Wagner Net Worth", "description": "Robert Wagner net worth: Robert Wagner is an American actor who has a net worth of $20 million dollars. That is a combined net worth with his wife of several decades"}}, "movies": [], "publish_date": 1610587003.0, "source": "https://www.celebritynetworth.com", "summary": ""}