{"url": "https://www.oprahmag.com/entertainment/tv-movies/a23853483/jada-pinkett-smith-red-table-talk-season-1-highlights/", "text": "If you're unfamiliar with it, Jada Pinkett Smith's Red Table Talk is one of the realest talk shows streaming today. As the host, and with the help of her 17-year-old daughter, Willow, and her mother, Adrienne Banfield-Jones, Pinkett Smith comfortably covers juicy topics like sex, love, and family while also interviewing celebrities. And now that the trailer for the second season has dropped, we're anxiously waiting for it to return to Facebook Watch on October 22.\n\nSo how successful was the debut? The hit show is a finalist for the 2018 People's Choice Awards Daytime Talk Show category, and the new season promises major interviews with celebrities like Ellen Pompeo, Leah Remini, and the lead host's husband, Will Smith. In a sneak peak of her interview with Will, he reveals that there was a point in their relationship where she cried for 45 days straight. \"It was every morning,\" he said. \"I think that's the worst I've ever felt in our marriage.\"\n\nBut before we dive into the newest episodes, let's not forget the Red Table Talk moments that hooked us in the first place.\n\nWe learned that Tiffany Haddish had a date with Drake. And he canceled.\n\nAs one of Hollywood's busiest stars—she's in four movies and one TV show this year—Haddish doesn't have much time to date. But the man she did clear her schedule for? Aubrey Graham, a.k.a. Drake.\n\nRelated Story Tiffany Haddish Has the Most Unpredictable Talent\n\nHaddish explained that the rapper asked her to dinner after they met on the set of his \"Nice For What\" music video earlier this year, which she's featured in. She said yes and proceeded to make time on her calendar. \"I go get my mustache waxed, get my armpits waxed, got me a nice little dress,\" she told Pinkett Smith.\n\nBut as the two A-listers were texting back and forth, Haddish soon learned it wasn't meant to be. Turns out, Drake had a \"family emergency.\" In Canada. But being the perfectly blunt comedian that we love, Haddish had the greatest reaction: \"I was like, ‘Okay. Okay! I could have made $100,000 today, but I was trying to see what that D do. But all right!'\"\n\nAnd that Pinkett Smith may have been a little too into self-love.\n\nBy the age of nine, her grandmother taught her all about the wonders of masturbation. As Pinkett Smith said, \"She didn't want me to fall into the hands of a man and, if he gave me pleasure, to think that that was him.\"\n\nBut once she further explored her sexuality as a teenager, things got a little out of hand after she learned how to give herself multiple orgasms: \"I was abstaining from men. And I actually think I went through kind of an addiction, too with it…And then one day I was like, ‘Enough. You're having five orgasms a day.'\"\n\nShe also revealed she's experienced hair loss.\n\nIn an episode titled \"Body Confessionals!\" she explained that the reason she almost exclusively wears a pixie cut isn't for style. One day as she was showering, handfuls of hair came out and she recalls \"shaking with fear.\" She took multiple tests and no one could figure out what caused it, so she ended going for the big chop.\n\nWhile Pinkett Smith once found it empowering to take care of her previously long 'do, she soon discovered that out of all the life losses she could experience, losing her mane was something she could handle. Now, she enjoys her short hair or rocks a head scarf, something she said makes her feel like a queen. \"I watch the higher power take things everyday. And by golly, if the higher power wants to take your hair? That's it.\"\n\nWillow admitted to self-harming as a pre-teen.\n\nWillow Smith shocked both her mother and grandmother when she confessed to cutting herself following the success of her 2010 hit song, \" .\"\n\n\"I had just stopped doing singing lessons and I was kind of just in this gray area of, Who am I? Do I have a purpose? Is there anything I can do besides this?\" she said. \"I was just listening to a lot of dark music, and it was so crazy, and I was just plunged into this black hole.\"\n\nThough it's been five years since she stopped, Willow had only told one friend, leaving her family completely in the dark up until the moment she revealed her story on camera. Her mom said she \"had no idea.\" \"I never talk about it because it was such a short, weird point in my life,\" Willow said. \"But you have to pull yourself out of it.\"\n\nJaden Smith actually moved out when he was 15.\n\nPinkett Smith called it \"one of the most heartbreaking moments\" of her life. Back then, she thought her now 20-year-old son was mature enough to make it. And as the child of a celebrity power couple, it was what he felt he needed to do in order to live his life and find a personal identity. \"Being in this lifestyle, in this world, is a bubble. He wanted out and I understood that,\" she said.\n\n\"It just makes you appreciate being at home, being with your parents, spending quality time with your family,” Jaden added. \"You get out into the world and you just understand things.”\n\nWillow caught her parents in the act.\n\nIndeed a real-life nightmare, she walked in on her parents having sex. Explaining this to her mom Pinkett Smith, she said she was just going downstairs to get some juice. But as soon as she saw what was happening, she ran upstairs because she knew she had \"overstepped a boundary. \"It would be like if I walked in on you meditating. When mommy's meditating, don't get in her business,\" she said.\n\nIn addition, Pinkett Smith feels betrayed by Tupac's death.\n\nShe and the late rapper, Tupac Shakur, became fast friends when they met in high school at Baltimore School for the Arts. Pinkett Smith called them \"inseparable,\" and his 1996 death was a huge loss.\n\n\"My upset is more anger because I feel that he left me,\" she said. \" I know that that's not true, and it's a very selfish way to think about it, but I really did believe that he was gonna be here for the long run.\"\n\nWillow called out the silver lining, explaining that the artist left behind a legacy that hasn't been ignored by the generations that came after him. \"He's an icon and that was what he was meant to do,\" Pinkett Smith said.\n\nApparently, Gabrielle Union and Pinkett Smith squashed their beef.\n\nAfter 17 years of tension, Union and Pinkett Smith finally put their feud to rest in an emotional face-to-face. The reconciliation came as a surprise to many because the two kept their issues out of the public eye. The kicker? They had been friendly acquaintances until one day, they just weren't. In fact, they couldn't pinpoint why they stopped speaking in the first place, which Pinkett Smith called \"some petty ass s—.\"\n\nPinkett Smith also brought up Union's 2013 Essence Black Women in Hollywood speech, in which the actress publicly confessed to a past in which she willingly participated in Hollywood gossip, reveling in the negativity that it caused. Union said that she used to be \"a troll,\" but has since recognized that tearing others down didn't make her life any better.\n\n\"I had to see myself clearly,\" Union said. \"It's ugly, it's hard, it's painful to recognize that you are the common denominator for the vast majority of your problems...You have to mourn the death of who you thought you were.\"\n\nMcKenzie Jean-Philippe Editorial Assistant McKenzie Jean-Philippe is the editorial assistant at OprahMag.com covering pop culture, TV, movies, celebrity, and lifestyle. She loves a great Oprah viral moment and all things Netflix—but come summertime, Big Brother has her heart. On a day off you'll find her curled up with a new juicy romance novel.", "images": ["https://hips.hearstapps.com/hmg-prod/images/tracee-ellis-ross-and-oprah-winfrey-speaks-during-oprahs-news-photo-1624992977.jpg?crop=0.668xw:1.00xh;0.162xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/a5a2268-565466a6-ffdf-430d-8fea-fbddb1b2e4f3-20220924123348-jpg-1664299798.jpg?crop=1.00xw:0.668xh;0,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/img-4859-1664546040.jpg?crop=0.752xw:1.00xh;0.248xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/hollywood-ca-original-caption-reads-close-up-photo-of-news-photo-1663775713.jpg?crop=0.691xw:1.00xh;0.155xw,0&resize=180:*", "https://hips.hearstapps.com/vidthumb/images/hocus-pocus-2-1656419233.jpg?crop=0.392xw:0.874xh;0.347xw,0.0228xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/ava-duvernay-and-oprah-winfrey-variety-power-of-women-1000-1664288735.jpg?crop=1.00xw:0.775xh;0,0.207xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/griner-promo-still-92-1665022917.png?crop=0.463xw:0.832xh;0.537xw,0&resize=180:*", "https://hips.hearstapps.com/rover/profile_photos/8a29eaaf-4b51-4a77-9b42-7ca210be8195_1538171707.jpg?fill=1:1&resize=80:*", "https://hips.hearstapps.com/vidthumb/manual_upload/57e2d33cbbddbd4665913297/thumb_1474483008.png?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/diana-thecrowns05-1658760030.jpg?crop=0.563xw:1.00xh;0.0510xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2018-10-17-at-4-19-54-pm-1539807621.png?crop=0.8866171003717472xw:1xh;center,top&resize=640:*", "https://hips.hearstapps.com/hmg-prod/images/tiffanyhaddishnightschool-1536277902.jpg?crop=0.918xw:0.381xh;0.0513xw,0.0915xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/weird-al-yankovic-during-1st-annual-grammy-salute-to-comedy-news-photo-1663789573.jpg?crop=0.734xw:1.00xh;0.135xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/taraji-p-henson-episode-1680-pictured-mr-snuffleupagus-big-news-photo-469586834-1539788633.jpg?crop=1.00xw:0.756xh;0,0.0807xh&resize=300:*", "https://www.oprahmag.com/_assets/design-tokens/fre/static/images/logos/network-logo.77e98e3.svg", "https://hips.hearstapps.com/hmg-prod/images/reginald-hudlin-attends-the-premiere-of-apple-tv-s-sidney-news-photo-1663946942.jpg?crop=0.66699xw:1xh;center,top&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/host-and-producer-oprah-winfrey-arrives-for-the-premiere-of-news-photo-1663856263.jpg?crop=0.620xw:1.00xh;0.191xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/shutterstock-editorial-13407069ci-1663878787.jpg?crop=1.00xw:0.668xh;0,0&resize=180:*", "https://media.hearstapps.com/loop/willowsmith-1539747088.mp4/poster.jpg", "https://hips.hearstapps.com/hmg-prod/images/idris-1539813480.png?crop=1.00xw:1.00xh;0,0&resize=300:*", "https://media.hearstapps.com/loop/jada-1539807529.mp4/poster.jpg", "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2018-10-17-at-4-19-54-pm-1539807621.png?crop=1.00xw:0.570xh;0,0.208xh&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2018-10-17-at-4-19-54-pm-1539807621.png?crop=1.00xw:0.570xh;0,0.208xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.oprahdaily.com/entertainment/tv-movies/a23853483/jada-pinkett-smith-red-table-talk-season-1-highlights/", "title": "8 Highlights From Jada Pinkett Smith's 'Red Table Talk' First Season", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "X-UA-Compatible": "IE=edge,chrom=1", "msapplication-tap-highlight": "no", "title": "8 Highlights From Jada Pinkett Smith's 'Red Table Talk' First Season", "description": "Here's a look back at the most memorable conversations Jada Pinkett Smith had on season one of her Red Table Talk show on Facebook, where she covered topics like sex, addiction, and motherhood.", "keywords": "Jada Pinkett Smith, Jada Pinkett Smith Red Table Talk, Red Table Talk season 1, Red Table Talk season 2", "theme-color": "#000000", "og": {"site_name": "Oprah Daily", "title": "8 of the Biggest Revelations from Jada Pinkett Smith's <i>Red Table Talk</i>", "description": "Season 2 has a lot to live up to.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2018-10-17-at-4-19-54-pm-1539807621.png?crop=1.00xw:0.570xh;0,0.208xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.oprahdaily.com/entertainment/tv-movies/a23853483/jada-pinkett-smith-red-table-talk-season-1-highlights/", "type": "article"}, "fb": {"app_id": 557569598006399}, "article": {"publisher": "https://www.facebook.com/oprahdaily/", "section": "TV & Movies", "modified_time": "2021-11-02T01:20:11Z", "published_time": "2018-10-18T00:30:00Z"}, "twitter": {"site": "@OprahDaily", "image": "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2018-10-17-at-4-19-54-pm-1539807621.png?crop=1.00xw:0.570xh;0,0.208xh&resize=640:*", "card": "summary_large_image"}, "google-site-verification": "82jYkYSOEZ5GE7V8m8gSrd7kxTtY-J37c6cndvl60N8", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2018-10-17-at-4-19-54-pm-1539807621.png?crop=0.875xw:0.987xh;0.103xw,0.0127xh&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2018-10-17-at-4-19-54-pm-1539807621.png?crop=0.875xw:0.987xh;0.103xw,0.0127xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/screen-shot-2018-10-17-at-4-19-54-pm-1539807621.png?crop=0.875xw:0.987xh;0.103xw,0.0127xh", "auto-publish": "timely", "sailthru.excerpt": "If you're unfamiliar with it, Jada Pinkett Smith's Red Table Talk is one of the realest talk shows streaming today. As the host, and with the help of her 17-year-old daughter, Willow, and her mother, Adrienne Banfield-Jones, Pinkett Smith comfortably covers juicy topics like sex, love, and family while also", "sailthru.tags": "entertainment,Culture & News,tv-movies,TV & Movies", "sailthru.date": "2018-10-18 00:30:00", "sailthru.socialtitle": "8 of the Biggest Revelations from Jada Pinkett Smith's <i>Red Table Talk</i>", "sailthru.contenttype": "standard-article", "m1": ".content-hed", "m2": ".content-dek p", "next-head-count": 46}, "movies": [], "publish_date": 1539822600.0, "source": "https://www.oprahmag.com", "summary": ""}