{"url": "https://www.bustle.com/p/this-photo-of-kim-kardashian-chrissy-teigen-kanye-west-john-legend-at-ellen-degeneres-60th-birthday-is-perfect-8187623", "text": "A stacked registrar of Hollywood personnel pulled out all their stops Saturday night in honor of a supremely worthy cause: Ellen DeGeneres' 60th birthday. But, of all the celebrity snapshots to come out of the b-day bash's on-site photo booth, this photo of Chrissy Teigen and Kim Kardashian at Ellen's 60th birthday really take the cake. Post-celebration, Kardashian took to Twitter Saturday night, Feb. 10, to share some awesome snaps from the party — including a smoldering photo from the evening featuring herself and husband Kanye West posing alongside another celebrity power couple —none other than Chrissy Teigen and John Legend.\n\nThe photo, for all its worth, looks a lot like the modern-day pop culture monger's fairytale double-date scenario brought to life. Standing against a silver-grey backdrop (which often serves as the characteristic tip-off that celebrity photobooth-ing is afoot), Teigen and Kardashian are pictured — respective husbands in tow — flaunting all the collective, effervescent glam they can muster. And, unsurprisingly, that's a lot of glam. Kardashian posted the stylish couples' pic to her Twitter Saturday night. And, much to the probable delight of Teigen and Kardashian fans alike, in captioning the photo, the reality star endearingly referred to the group as her \"squad.\"\n\n\"Squad celebrating @TheEllenShow birthday!!!\" Kardashian wrote alongside the photo, which has already begun to make the viral rounds of the internet. It seems like DeGeneres (who celebrated her official birthday on Jan. 26) was feeling the \"squad\" love herself, because the 60-year-old TV host retweeted Kardashian's photo in the wee hours of Sunday morning, Feb. 11. Sweetly, DeGeneres captioned the retweet, \"Having the best birthday.\"\n\nAnd, judging by the slew of glittery snapshots taken throughout the evening — courtesy of the party's well-placed photo booth as well as its star-studded guest list — it seems safe to say that, objectively, DeGeneres' 60th birthday extravaganza was pretty great. In addition to Kimye, Teigen, and Legend, the evening's festivities were also attended by the likes of Olivia Munn, Meghan Trainor, and Jennifer Aniston, DeGeneres' longtime friend.\n\nTeigen also shared a few searing shots of herself (posing alongside her superstar hubby) with her social media following Saturday night. The 32-year-old model, who recently announced that she's expecting her second child with Legend, turned to Instagram with two equally fierce photos from DeGeneres' party: a close-up and a full-length snapshot. The close-up sees Legend flashing a smile while Teigen shoots more of a smize toward the camera (she is a model, after all). \"Happy birthday, @theellenshow!!!!\" Teigen captioned the first of two back-to-back Instagram posts. She continued, writing, \"Here is a picture of me and John!\"\n\nThe full-length, in contrast, pictures the adorable new parents-to-be standing side-by-side. In the photo, Teigen, who was clad in a floor-length, deep-red gown (with a red lip to match), rests her hand on her baby bump while she smiles softly. For parallel syntax's sake, perhaps, Teigen kept the second photo's caption pretty straightforward. \"Happy birthday, @theellenshow!\" she wrote. \"This is a full length of me and John!\"\n\nKardashian also posted several photos from DeGeneres' bash throughout Saturday evening. Because, as fans of Keeping Up With The Kardashians (executive producer: Kris Jenner) know all too well, the Kardashian-Jenner family loves a good photo-booth op. Kardashian, who is also a new mom in 2018 (her and West welcomed the arrival of their third child, Chicago, via surrogate on Jan. 15), shared a photo of her and West looking particularly magnetic — and, as is customary for the high-fashion savants, particularly serious — with her Twitter following earlier Saturday night, pre-release of the couples' shot. And, in an iconic move that might only be helmed by a pop cultural super-mogul with a penchant for family matters, Kardashian captioned the photo with a simple, \"Mom & Dad.\"\n\nBecause, really, what better way to pay homage to six decades of DeGeneres-themed greatness than a glitzy digital catalogue of all those celebs who showed up to celebrate her? As far as 60th birthday parties go, DeGeneres' might be one of the most spectacular this world has ever seen.", "images": ["https://imgix.bustle.com/uploads/getty/2018/2/11/2fd062db-1064-42b4-a1e1-a37c3124a228-getty-462608398.jpg?w=800&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/10/4/04a61fbc-f80e-4eda-94b5-21084faa71d3-165512_6151_605065d4.jpeg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2022/9/29/00918efa-de29-40ae-b077-fc70b5375912-getty-514044750.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/9/29/4817d95b-3906-46f3-8d1d-8418401682e7-tristan-thompson-proposed-to-khloe-kardashians-season-2-episode-2.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2018/2/11/2fd062db-1064-42b4-a1e1-a37c3124a228-getty-462608398.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2022/10/5/18a81ecc-5972-4e59-ac9c-5b93b6d92ebf-getty-1238712243.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/2/11/2fd062db-1064-42b4-a1e1-a37c3124a228-getty-462608398.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/this-photo-of-kim-kardashian-chrissy-teigen-kanye-west-john-legend-at-ellen-degeneres-60th-birthday-is-perfect-8187623", "title": "This Photo Of Kim Kardashian, Chrissy Teigen, Kanye West & John Legend At Ellen DeGeneres' 60th Birthday Is Perfect", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image", "creator": "@@emczachor"}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/this-photo-of-kim-kardashian-chrissy-teigen-kanye-west-john-legend-at-ellen-degeneres-60th-birthday-is-perfect-8187623", "type": "article", "title": "This Photo Of Kim Kardashian, Chrissy Teigen, Kanye West & John Legend At Ellen DeGeneres' 60th Birthday Is Perfect", "description": "A stacked registrar of Hollywood personnel pulled out all their stops Saturday night in honor of a supremely worthy cause: Ellen DeGeneres' 60th birthday. But, of all the celebrity snapshots to come out of the b-day bash's on-site photo booth, this…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/2/11/2fd062db-1064-42b4-a1e1-a37c3124a228-getty-462608398.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "A stacked registrar of Hollywood personnel pulled out all their stops Saturday night in honor of a supremely worthy cause: Ellen DeGeneres' 60th birthday. But, of all the celebrity snapshots to come out of the b-day bash's on-site photo booth, this…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}