{"url": "https://www.cosmopolitan.com/entertainment/celebs/a8589314/emma-stone-andrew-garfield-are-breakup-goals/", "text": "At The Amazing Spider-Man 2 premiere in April 2014. Getty\n\nEmma Stone and Andrew Garfield broke up in 2015, after dating for four years. I don't know Emma or Andrew (although I saw them once at the movies in New York and gave them what I firmly feel was a kind, encouraging smile), but when they broke up, I felt a little sad. Then I was pleasantly surprised. Unlike other young celeb exes, many of whom throw shade or never let the drama die after a breakup, these two have repeatedly proven that it's humanly possible to have a civil — even lovely! — relationship with your ex. Now that awards season is ramping up, we're getting to see their elegance in full swing.\n\nIt helps that the breakup didn't come with any nasty press leaks (I still don't know exactly why they split) or bad words said about one another. When they've been asked about their past relationship, or when the other has come up in interviews, it's all love. Last month, in The Hollywood Reporter's Actors' Roundtable, Andrew was asked who he'd bring with him on a desert island. His answer? \"Emma Stone. I love Emma.\" And no, I don't think that was an \"I love you, Emma, come on the desert island and get back together with me!\" (Although, maybe.) It was more that thing where you date someone and they're fabulous, but it's just not quite the right fit. Despite the genuine love, maybe you're just meant to hang out as friends. (Andrew and Emma were spotted together in London around his birthday this past summer.)\n\nAt the premiere of Magic in the Moonlight in July 2014.\n\nAs for Emma, when she did her 73 Questions video with Vogue in October, she was asked about the best gift she's ever received, and she said it was a rocking chair. In 2015, Andrew did an interview with Vanity Fair where he mentioned making someone a rocking chair. Interesting.\n\n\n\nAnd yet. You'd be naive not to wonder, What if all this \"we're exes, and it's super chill\" is a Hollywood act? Both parties have potential Oscar nods this year (Andrew for Silence, Emma for La La Land), and the fact that they've been able to stay on such positive terms definitely looks great for both of them. I'm charmed, after all; maybe Oscar voters would be too.\n\nSurviving awards season together at the 17th annual AFI Awards this month. Getty\n\nFrom the start, Andrew and Emma have been a massively endearing couple, arguably to the point where you've had to wonder: Is this too good to be true? Did they just get together to promote Spider-Man? Andrew told Teen Vogue of their meeting during casting for the movie, \"It was like I woke up when she came in. She was the last person to screen-test, and I was so bored of it by then that I was mucking about ... And then she came in, and it was like diving into white-water rapids and having no desire to hang on to the side. Throughout shooting, it was wild and exciting. I couldn't help but try to stay with her, keep pace with her, and not let her get away.\" Swoon. Makes you want to see the movie, right?\n\nAt The Amazing Spider-Man premiere party in June 2012.\n\nWhatever the truth of their relationship, you can't argue that they've set a classy example for how to be Hollywood exes — and exes in general, really. Maybe we can't all be friends with our one-time romantic partners, but if Andrew can leap up to give Emma a standing ovation when she wins Best Actress in a Comedy or Musical at the Golden Globes, surely we can find it in our hearts to wish our own exes the best.\n\n\n\nUnless the breakup was a Jelena-level disaster. In which case, feel free to summon your inner Selena Gomez.\n\nFollow Emily on Twitter.\n\n", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-483781627-1484240308.jpg?crop=0.846xw:0.292xh;0.0276xw,0.0292xh&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-483781627-1484240308.jpg?crop=0.846xw:0.292xh;0.0276xw,0.0292xh&resize=1200:*", "keywords": [], "authors": ["Emily C. Johnson"], "canonical_link": "https://www.cosmopolitan.com/entertainment/celebs/a8589314/emma-stone-andrew-garfield-are-breakup-goals/", "title": "How Emma Stone and Andrew Garfield Became Breakup Goals", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=6", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "How Emma Stone and Andrew Garfield Became Breakup Goals", "description": "They prove exes can be real friends, even in Hollywood.", "url": "https://www.cosmopolitan.com/entertainment/celebs/a8589314/emma-stone-andrew-garfield-are-breakup-goals/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-483781627-1484240308.jpg?crop=0.846xw:0.292xh;0.0276xw,0.0292xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2021-11-01T23:39:01Z", "published_time": "2017-01-12T18:12:00Z", "section": "Celebs", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-483781627-1484240308.jpg?crop=0.846xw:0.292xh;0.0276xw,0.0292xh&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "How Emma Stone and Andrew Garfield Became Breakup Goals", "description": "They prove exes can be real friends, even in Hollywood.", "keywords": "andrew garfield, emma stone", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-483781627-1484240308.jpg?crop=1.00xw:0.691xh;0,0&resize=320:*", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrities & Entertainment,entertainment,celebs", "sailthru.date": "2017-01-12T18:12:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-483781627-1484240308.jpg?crop=0.846xw:0.292xh;0.0276xw,0.0292xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-483781627-1484240308.jpg?crop=1.00xw:0.691xh;0,0", "sailthru.socialtitle": "How Emma Stone and Andrew Garfield Became Breakup Goals", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1484244720.0, "source": "https://www.cosmopolitan.com", "summary": ""}