{"url": "https://www.tvguide.com/news/how-to-get-away-with-murder-season-5-spoilers/", "text": "How to Get Away with Murder's Season 4 finale gave us more answers than questions for once, but that doesn't mean we're not still ready and eager for more Murder Club mysteries.\n\nAfter winning her Supreme Court Case, Annalise (Viola Davis) returned home to win Laurel's (Karla Souza) baby back and get her debauched daddy arrested by the FBI. Frankly, there were enough loose ends wrapped up to make the Season 4 finale a series finale, but thankfully ABC disagreed and renewed the show for another year.\n\nYou know what that means... It's time to gather up everything we know about Season 5 to start figuring out how all these puzzle pieces will come together when How to Get Away with Murder returns!\n\nGabriel Maddox is a major player. Rome Flynn has officially been upped to series regular for Season 5, meaning whoever this kid is, he's important. So far, all we know is that Frank (Charlie Weber) recognizes him on sight and apparently knows his mother. But who else was on the end of that call?\n\nHow to Get Away with MurderFinale: Who Is Gabriel Maddox?\n\nBonnie's (Liza Weil) kid could be alive. Thanks to Denver's (Benito Martinez) files, we now know Bonnie's baby (who she thought died in childbirth) might be alive and kicking and walking around out there somewhere. There was a DNA match between Bonnie and an unknown third party in those files with \"kid alive?\" marked in the margins, so the good money is on Gabriel Maddox being her long, lost son.\n\nExpect a different kind of flashback/flash-forward. Showrunner Pete Nowalk has said that there will be a different, \"more fun\" tone to the flashback format next season, which might indicate they won't be quite as full of doom and gloom as they've been in the past season.\n\nNate (Billy Brown) holds all the cards. Nate was the one who ended up with all those files Denver was keeping on Annalise and her team, which means the ball is officially in his court. Recently, he's been on Team Annalise, but his loyalties have always shifted when the moral lines turn grey, which means he could cause some serious destruction with all this new knowledge he has.\n\nViola Davis, How to Get Away with Murder Byron Cohen, ABC\n\nHow to Get Away with Murder: Gabriel Maddox Will Be a Huge Part of Season 5\n\nLaurel might have murdered her mother. The final shot of Laurel in the Season 4 finale revealed that she had some nasty scratches on her arm that were almost definitely made by her mom's nails. She claimed she'd never hurt her own mother, but Sandrine (Lolita Davidovich) went mysteriously missing and has yet to resurface. Paired with the knowledge that Laurel told her to kill herself during their last fight, the evidence is mounting up that Laurel wanted her mom dead.\n\nThere's still story left to tell with Marcus (Cornelius Smith Jr.) from Scandal. During the How to Get Away with Murder/Scandalcrossover, Michaela (Aja Naomi King) hooked up with Marcus while they were on a stakeout. Even though our hearts were broken for Asher (Matt McGorry), there was undeniable chemistry between Michael and Marcus that feels like a major loose end. Smith hasn't officially joined the cast, but showrunner Pete Nowalk has hinted that it's a possibility and Michael and Marcus' story isn't over yet.\n\nA Coliver wedding is still on the books. It feels like we've been waiting forever for this wedding, which is why we were relieved to hear that chances are good we'll finally see Connor (Jack Falahee) and Oliver (Conrad Ricamora) exchange vows next season. Don't expect it to be a run of the mill wedding though. Nowalk warns. \"I will say, I personally kind of hate weddings, and I hate the trope of it, so we're going to do it in our own fun way.\"\n\nMichaela is on a dark path. Now that she's turned Simon over to be deported and cheated her way out of her relationship with Asher, Michaela is headed down a darker path than we've ever seen her on before. She's becoming more and more like Annalise, which could be a great or terrible thing for her depending on how you look at it.\n\nHow to Get Away with Murder's first three seasons are available to stream on Netflix now.", "images": ["https://www.tvguide.com/a/img/resize/432bc4ca4b0dd29912f1d2f2237f25949fee4077/hub/2018/06/13/21fd28f4-7ee6-415c-ad4c-4fc32e0785d1/180613-viola-davis-how-to-get-away-with-murder.jpg?auto=webp&fit=crop&height=1080&width=1920", "https://www.tvguide.com/a/img/hub/2018/06/13/21fd28f4-7ee6-415c-ad4c-4fc32e0785d1/180613-viola-davis-how-to-get-away-with-murder.jpg", "https://www.tvguide.com/a/img/resize/af13d9d8138db87e5774b445399efdbc104da85a/hub/2017/10/01/a2a02e7c-0ade-48e0-9f18-a52e59e6fc4c/instg.png?auto=webp&height=84&width=84"], "top_img": "https://www.tvguide.com/a/img/hub/2018/06/13/21fd28f4-7ee6-415c-ad4c-4fc32e0785d1/180613-viola-davis-how-to-get-away-with-murder.jpg", "keywords": [], "authors": ["Lindsay Macdonald", "June", "P.M. Pt"], "canonical_link": "https://www.tvguide.com/news/how-to-get-away-with-murder-season-5-spoilers/", "title": "How to Get Away with Murder Season 5 Spoilers: Everything We Know", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"app_id": 63084645929}, "google-site-verification": "Od29UEFliEmsUY2XH0kfXxkTNucL0cv_rc0J_RPWXU4", "og": {"site_name": "TVGuide.com", "image": {"identifier": "https://www.tvguide.com/a/img/hub/2018/06/13/21fd28f4-7ee6-415c-ad4c-4fc32e0785d1/180613-viola-davis-how-to-get-away-with-murder.jpg", "height": 850, "width": 850}, "type": "article", "description": "Laurel totally killed her mom, right?", "title": "How to Get Away with Murder Season 5 Spoilers: Everything We Know", "url": "https://www.tvguide.com/news/how-to-get-away-with-murder-season-5-spoilers/"}, "twitter": {"card": "summary_large_image", "site": "@TVGuide", "image": "https://www.tvguide.com/a/img/hub/2018/06/13/21fd28f4-7ee6-415c-ad4c-4fc32e0785d1/180613-viola-davis-how-to-get-away-with-murder.jpg", "description": "Here's everything we know so far about How to Get Away with Murder Season 5!", "title": "How to Get Away with Murder Season 5 Spoilers: Everything We Know", "url": "https://www.tvguide.com/news/how-to-get-away-with-murder-season-5-spoilers/"}, "nuxtstatus": "loaded", "description": "Here's everything we know so far about How to Get Away with Murder Season 5!"}, "movies": [], "publish_date": null, "source": "https://www.tvguide.com", "summary": ""}