{"url": "https://variety.com/2018/tv/recaps/the-bachelorette-recap-becca-kufrin-final-four-1202869106/", "text": "SPOILER ALERT: Do not read if you have not yet watched the July 9 episode of “The Bachelorette.”\n\nAnd then there were six! Week 7 on “The Bachelorette” means Becca Kufrin is falling in love with some of her remaining six suitors, with the final four and hometown dates looming.\n\nFor this season’s first international dates, the show headed to the Bahamas, with Garrett Yrigoyen, Colton, Blake, Wills, Jason and Leo still in the running for the final rose.\n\nAfter admitting to host Chris Harrison that she envisions a happily-ever-after with a couple of the men but still has some reservations, Kufrin kicked off the island adventure with a one-on-one date for Colton. The two took to the water to conch dive, spurred on by a local tour guide advising the couple that conch is an aphrodisiac. Of course, there was a double meaning to the date activity, as Colton admitted on camera that he’s a virgin and wanted to tell the Bachelorette about his lifestyle choice this week.\n\nAfter plenty of sexual puns while out on the open seas, Colton’s confession was delayed until dinner, when he revealed that as professional football player, he always put his career before a relationship and hadn’t had sex. Kufrin seemed to (surprisingly) struggle with the news, leaving dinner to get some air outside. After some discussion, she returned to give him the rose, guaranteeing a visit to meet his family. After dodging two bullets this season — first having previously dated Kufrin’s close friend Tia and now with his lack of sexual history — it seems nothing can bring Colton down. Onto the final four!\n\nGarrett landed the second one-on-one date of week, while the men back at the hotel, most notably Blake, struggled to stay confident in their relationships with the Bachelorette. Garrett, a consistent frontrunner, faced public backlash earlier in the season after it was revealed he had a history of liking posts on Instagram that mocked Parkland high school students, liberal women, trans people, and undocumented immigrants.\n\nOn their date, Kufrin and Garrett explored the Bahamas by seaplane, eventually stopping to frolic on the beach together. At dinner, the couple dove further into Garrett’s past, discussing his former marriage and his family, and he went on to tell the Bachelorette he was falling in love with her. She gave him the rose, locking in another hometown date spot, and then they proceeded to strip off their nice dinner attire and run into the ocean. Wow, love is such a rush.\n\nBlake, after starting to crack early in the week, got the third one-on-one date, which started off with a concert by the Baha Men. Did we take a time machine back to 2000?\n\nFollowing that hot-ticket musical event (which (un)fortunately did not include “Who Let The Dogs Out”), the two drank champagne on the beach, where Blake admitted his struggles and insecurities over her relationships with other men. At dinner, Blake opened up about his family life and told Kufrin that he’s in love with her, becoming the first suitor to hit that milestone. The Bachelorette gave him the rose, and even said in her solo interview that she was in love with him too and could “100% see him as my husband.” And just like that, we’ve got a new frontrunner!\n\nAfter the trio of one-on-ones, Wills, Leo and Jason ended up on a three-on-one date, competing for the last hometown date rose. With another date on the beach — Kufrin has a real golden tan at this point — each man spoke about their families and made a final plea for the fourth spot. After Leo said he wouldn’t be ready to propose in just a few weeks, she sent him home and carried onto the dinner date portion with just Wills and Jason. After much more back-and-forth, Kufrin sent Wills home and gave Jason the fourth rose.\n\nNext week, the final four of Garrett, Colton, Blake and Jason will take the Bachelorette home to meet their respective families, as the race for the final rose really starts to heat up.\n\n“The Bachelorette” airs on Mondays at 8 p.m. on ABC.\n\nRELATED CONTENT:", "images": ["https://variety.com/wp-content/themes/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://variety.com/wp-content/uploads/2018/07/screen-shot-2018-07-09-at-5-45_edited.jpg?w=1024", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://variety.com/wp-content/uploads/2018/07/screen-shot-2018-07-09-at-5-45_edited.jpg?w=681&h=383&crop=1"], "top_img": "https://variety.com/wp-content/uploads/2018/07/screen-shot-2018-07-09-at-5-45_edited.jpg?w=1024", "keywords": [], "authors": ["Kirsten Chuba"], "canonical_link": "https://variety.com/2018/tv/recaps/the-bachelorette-recap-becca-kufrin-final-four-1202869106/", "title": "‘The Bachelorette’ Recap: Becca Kufrin Selects Final Four Ahead of Hometown Dates", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://variety.com/wp-content/themes/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Week 7 on \"The Bachelorette\" means Becca Kufrin is falling in love with some of her remaining six suitors, with hometown dates looming.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199, "pages": 12616252196}, "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202869106, "author": "Kirsten Chuba", "pmc-category": "Recaps", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-07-09T19:32:33"}, "pmc-tag": "Becca Kufrin,The Bachelor Recap,The Bachelorette", "title": "‘The Bachelorette’ Recap: Becca Kufrin Selects Final Four Ahead of Hometown Dates", "pageclass": "article", "pmc-vertical": "tv", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-primary-category": "Recaps", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress 6.0.2", "author": "Kirsten Chuba", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Variety", "application-name": "Variety", "content_type": "Article", "post_id": 1202869106, "title": "'The Bachelorette' Recap: Becca Kufrin Selects Final Four Ahead of Hometown Dates", "published_at": "2018-07-09 19:32:33", "image": "https://variety.com/wp-content/uploads/2018/07/screen-shot-2018-07-09-at-5-45_edited.jpg?w=1024", "comment_count": 38, "tags": "The Bachelorette", "topics": "Recaps", "appeared_in_print": "No", "body": "SPOILER ALERT: Do not read if you have not yet watched the July 9 episode of “The Bachelorette.”\r\n\r\nAnd then there were six! Week 7 on \"The Bachelorette\" means Becca Kufrin is falling in love with some of her remaining six suitors, with the final four and hometown dates looming.\r\n\r\nFor this season's first international dates, the show headed to the Bahamas, with Garrett Yrigoyen, Colton, Blake, Wills, Jason and Leo still in the running for the final rose.\r\n\r\nAfter admitting to host Chris Harrison that she envisions a happily-ever-after with a couple of the men but still has some reservations, Kufrin kicked off the island adventure with a one-on-one date for Colton. The two took to the water to conch dive, spurred on by a local tour guide advising the couple that conch is an aphrodisiac. Of course, there was a double meaning to the date activity, as Colton admitted on camera that he's a virgin and wanted to tell the Bachelorette about his lifestyle choice this week.\r\n\r\nAfter plenty of sexual puns while out on the open seas, Colton's confession was delayed until dinner, when he revealed that as professional football player, he always put his career before a relationship and hadn't had sex. Kufrin seemed to (surprisingly) struggle with the news, leaving dinner to get some air outside. After some discussion, she returned to give him the rose, guaranteeing a visit to meet his family. After dodging two bullets this season -- first having previously dated Kufrin's close friend Tia and now with his lack of sexual history -- it seems nothing can bring Colton down. Onto the final four!\r\n\r\nGarrett landed the second one-on-one date of week, while the men back at the hotel, most notably Blake, struggled to stay confident in their relationships with the Bachelorette. Garrett, a consistent frontrunner, faced public backlash earlier in the season after it was revealed he had a history of liking posts on Instagram that mocked Parkland high school students, liberal women, trans people, and undocumented immigrants.\r\n\r\nOn their date, Kufrin and Garrett explored the Bahamas by seaplane, eventually stopping to frolic on the beach together. At dinner, the couple dove further into Garrett's past, discussing his former marriage and his family, and he went on to tell the Bachelorette he was falling in love with her. She gave him the rose, locking in another hometown date spot, and then they proceeded to strip off their nice dinner attire and run into the ocean. Wow, love is such a rush.\r\n\r\nBlake, after starting to crack early in the week, got the third one-on-one date, which started off with a concert by the Baha Men. Did we take a time machine back to 2000?\r\n\r\nFollowing that hot-ticket musical event (which (un)fortunately did not include \"Who Let The Dogs Out\"), the two drank champagne on the beach, where Blake admitted his struggles and insecurities over her relationships with other men. At dinner, Blake opened up about his family life and told Kufrin that he's in love with her, becoming the first suitor to hit that milestone. The Bachelorette gave him the rose, and even said in her solo interview that she was in love with him too and could \"100% see him as my husband.\" And just like that, we've got a new frontrunner!\r\n\r\nAfter the trio of one-on-ones, Wills, Leo and Jason ended up on a three-on-one date, competing for the last hometown date rose. With another date on the beach -- Kufrin has a real golden tan at this point -- each man spoke about their families and made a final plea for the fourth spot. After Leo said he wouldn't be ready to propose in just a few weeks, she sent him home and carried onto the dinner date portion with just Wills and Jason. After much more back-and-forth, Kufrin sent Wills home and gave Jason the fourth rose.\r\n\r\nNext week, the final four of Garrett, Colton, Blake and Jason will take the Bachelorette home to meet their respective families, as the race for the final rose really starts to heat up.\r\n\r\n“The Bachelorette” airs on Mondays at 8 p.m. on ABC.\r\n\r\nRELATED CONTENT:", "fragment": "!", "og": {"type": "article", "title": "‘The Bachelorette’ Recap: Becca Kufrin Selects Final Four Ahead of Hometown Dates", "url": "https://variety.com/2018/tv/recaps/the-bachelorette-recap-becca-kufrin-final-four-1202869106/", "description": "SPOILER ALERT: Do not read if you have not yet watched the July 9 episode of “The Bachelorette.” And then there were six! Week 7 on “The Bachelorette” means Becca Kufrin is falling in l…", "site_name": "Variety", "image": {"identifier": "https://variety.com/wp-content/uploads/2018/07/screen-shot-2018-07-09-at-5-45_edited.jpg?w=1024", "width": 1024, "height": 567}, "locale": "en_US"}, "article": {"published_time": "2018-07-10T02:32:33+00:00", "modified_time": "2018-07-10T16:14:04+00:00"}, "twitter": {"site": "@variety", "card": "summary_large_image", "title": "‘The Bachelorette’ Recap: Becca Kufrin Selects Final Four Ahead of Hometown Dates", "description": "Week 7 on \"The Bachelorette\" means Becca Kufrin is falling in love with some of her remaining six suitors, with hometown dates looming.", "image": "https://variety.com/wp-content/uploads/2018/07/screen-shot-2018-07-09-at-5-45_edited.jpg?w=1024"}}, "movies": [], "publish_date": 1531189953.0, "source": "https://variety.com", "summary": ""}