{"url": "https://www.vibe.com/2018/04/everything-you-should-know-beyonce-coachella-2018", "text": "We haven’t seen Beyonce on stage in quite a bit. The Queen Bey has been taking some much needed vacation from live performances to rest and tend to her new twins, Rumi and Sir. But thankfully, Mrs. Carter is returning to her rightful place in the spotlight at the 2018 Coachella Valley Music and Arts Festival.\n\nThe singer saddened the Hive in 2017, when she withdrew her headlining position in light of her pregnancy. Despite the letdown, she promised Coachella organizers and fans that she would fulfill her commitment to the annual event, and that it would be the experience of a lifetime.\n\nThe first week of Coachella 2018 kicks off on Friday, Apr. 13. While there are still a couple more days left on the calendar, we have a run down of everything you should know about Beyonce’s return to the main stage.\n\n—\n\n1. Beyonce Has An Intense Rehearsal Schedule\n\nWe all know Beyonce is a perfectionist when it comes to her art, but apparently the performer is taking it to a new level for her headlining gig. According to various reports, Bey has been rehearsing for 11 hours each day in order to be ready for the big performance. Now, that’s what we call dedication.\n\n2. The Singer Is Reportedly On An Even More Rigorous Diet Plan\n\nThe only thing more rigorous than her rehearsal schedule is her diet plan. According to People, the singer has been on a strict diet and taken on the No Master Cleanse to prepare for her comeback. If you’ve been living under a rock: it’s also a known fact that Beyonce is a vegan.\n\n3. She’s Hired A Handful Of Back-Up Dancers\n\nIt isn’t a true Beyonce show if there aren’t stellar vocals, amazing effects, and, of course, killer choreography. And to make sure that she’s good on the latter, the singer has reportedly hired at least 100 back-up dancers and called on them one week before the festival.\n\n4. She’s Got The Late Date and Time Slot\n\nThe organizers of Coachella officially revealed the time slots for the first week, and Beyonce is listed late in the schedule. She will be performing on Saturday (Apr. 14). And since she is the headlining act, she won’t go on until 11:05 p.m. PST. So, hopefully you’ll be well-rested.\n\nMay we have your attention, please? pic.twitter.com/hTZADS6ubg — Coachella (@coachella) April 11, 2018\n\n5. Rumor Has It, Bey Is Bringing Guests\n\nWhile the reports have not been confirmed, many fans believe Bey has a couple of surprises up her bedazzled sleeve. One thing we have reason to believe is that the star will be reuniting with members of Destiny’s Child – all fix of its past members. The rumors began swirling after a series of posts and cryptic messages on social media. Most recently, LaTavia Roberson – a member of the group’s original four – posted a sweet throwback pic on social media, suggesting that there was no bad blood between her and the other girls (she was reportedly kicked out of the group). Nothing has been validated, but we’ll all just have to cross our fingers and see.\n\n6. You Can Stream It All Online\n\nIf you can’t make the festival in Indio, California, no worries! YouTube will be exclusively streaming all of your favorite performances, including Beyonce’s. So grab some popcorn and don’t miss a single minute and watch it here!", "images": ["https://www.vibe.com/wp-content/themes/vip/pmc-vibe-2021/assets/public/lazyload-fallback.gif", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.vibe.com/wp-content/uploads/2018/04/everything-you-should-know-beyonce-coachella-2018-1523464170.jpg?w=910&h=511&crop=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=710947549794527&ev=PageView&noscript=1", "https://www.vibe.com/wp-content/uploads/2018/04/everything-you-should-know-beyonce-coachella-2018-1523464170.jpg?w=1024"], "top_img": "https://www.vibe.com/wp-content/uploads/2018/04/everything-you-should-know-beyonce-coachella-2018-1523464170.jpg?w=1024", "keywords": [], "authors": ["Jessica Mckinney"], "canonical_link": "https://www.vibe.com/music/music-news/everything-you-should-know-beyonce-coachella-2018-578992/", "title": "Everything You Need To Know About Beyonce’s Long-Awaited Return At Coachella", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.vibe.com/wp-content/themes/vip/pmc-vibe-2021/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.vibe.com/wp-content/uploads/2021/03/cropped-VIBE_favicon.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "From set times to big surprises, we've got the run down.", "news_keywords": "Beyoncé, Coachella 2018", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Jessica McKinney", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "VIBE.com", "application-name": "VIBE.com", "content_type": "Article", "post_id": 578992, "title": "Everything You Need To Know About Beyonce's Long-Awaited Return At Coachella", "published_at": "2018-04-11 12:34:48", "image": "https://www.vibe.com/wp-content/uploads/2018/04/everything-you-should-know-beyonce-coachella-2018-1523464170.jpg?w=1024", "comment_count": 0, "tags": "Coachella 2018", "topics": "Music News", "body": "We haven't seen Beyonce on stage in quite a bit. The Queen Bey has been taking some much needed vacation from live performances to rest and tend to her new twins, Rumi and Sir. But thankfully, Mrs. Carter is returning to her rightful place in the spotlight at the 2018 Coachella Valley Music and Arts Festival.\r\n\r\nThe singer saddened the Hive in 2017, when she withdrew her headlining position in light of her pregnancy. Despite the letdown, she promised Coachella organizers and fans that she would fulfill her commitment to the annual event, and that it would be the experience of a lifetime.\r\n\r\nThe first week of Coachella 2018 kicks off on Friday, Apr. 13. While there are still a couple more days left on the calendar, we have a run down of everything you should know about Beyonce's return to the main stage.\r\n---\r\n1. Beyonce Has An Intense Rehearsal Schedule\r\n\r\nWe all know Beyonce is a perfectionist when it comes to her art, but apparently the performer is taking it to a new level for her headlining gig. According to various reports, Bey has been rehearsing for 11 hours each day in order to be ready for the big performance. Now, that's what we call dedication.\r\n\r\n2. The Singer Is Reportedly On An Even More Rigorous Diet Plan\r\n\r\nThe only thing more rigorous than her rehearsal schedule is her diet plan. According to People, the singer has been on a strict diet and taken on the No Master Cleanse to prepare for her comeback. If you've been living under a rock: it's also a known fact that Beyonce is a vegan.\r\n\r\n3. She's Hired A Handful Of Back-Up Dancers\r\n\r\nIt isn't a true Beyonce show if there aren't stellar vocals, amazing effects, and, of course, killer choreography. And to make sure that she's good on the latter, the singer has reportedly hired at least 100 back-up dancers and called on them one week before the festival.\r\n\r\n4. She's Got The Late Date and Time Slot\r\n\r\nThe organizers of Coachella officially revealed the time slots for the first week, and Beyonce is listed late in the schedule. She will be performing on Saturday (Apr. 14). And since she is the headlining act, she won't go on until 11:05 p.m. PST. So, hopefully you'll be well-rested.\r\n\r\nhttps://twitter.com/coachella/status/983888035304517632\r\n\r\n5. Rumor Has It, Bey Is Bringing Guests\r\n\r\nWhile the reports have not been confirmed, many fans believe Bey has a couple of surprises up her bedazzled sleeve. One thing we have reason to believe is that the star will be reuniting with members of Destiny's Child – all fix of its past members. The rumors began swirling after a series of posts and cryptic messages on social media. Most recently, LaTavia Roberson – a member of the group's original four – posted a sweet throwback pic on social media, suggesting that there was no bad blood between her and the other girls (she was reportedly kicked out of the group). Nothing has been validated, but we'll all just have to cross our fingers and see.\r\n\r\nhttps://www.instagram.com/p/BhUdkLmhaB_/?taken-by=iamlatavia\r\n\r\n6. You Can Stream It All Online\r\n\r\nIf you can't make the festival in Indio, California, no worries! YouTube will be exclusively streaming all of your favorite performances, including Beyonce's.  So grab some popcorn and don't miss a single minute and watch it here!", "fb": {"pages": 123159412963}, "fragment": "!", "og": {"type": "article", "title": "Everything You Need To Know About Beyonce’s Long-Awaited Return At Coachella", "url": "https://www.vibe.com/music/music-news/everything-you-should-know-beyonce-coachella-2018-578992/", "description": "We haven’t seen Beyonce on stage in quite a bit. The Queen Bey has been taking some much needed vacation from live performances to rest and tend to her new twins, Rumi and Sir. But thankfully…", "site_name": "VIBE.com", "image": {"identifier": "https://www.vibe.com/wp-content/uploads/2018/04/everything-you-should-know-beyonce-coachella-2018-1523464170.jpg?w=1024", "width": 1024, "height": 681}, "locale": "en_US"}, "article": {"published_time": "2018-04-11T16:34:48+00:00", "modified_time": "2018-04-11T17:12:17+00:00"}, "twitter": {"site": "@vibemagazine", "creator": "@jigga_jess", "card": "summary_large_image", "title": "Everything You Need To Know About Beyonce’s Long-Awaited Return At Coachella", "description": "From set times to big surprises, we've got the run down.", "image": "https://www.vibe.com/wp-content/uploads/2018/04/everything-you-should-know-beyonce-coachella-2018-1523464170.jpg?w=1024"}}, "movies": [], "publish_date": 1523464488.0, "source": "https://www.vibe.com", "summary": ""}