{"url": "https://en.wikipedia.org/wiki/Kate_Plus_8", "text": "American reality television series\n\n\"The Gosselins\" redirects here. For people, see Gosselin\n\nJon & Kate Plus 8 Also known as Kate Plus 8 Genre Reality Starring The Gosselin family Composers David Imhof\n\nScott Pearson Country of origin United States Original language English No. of seasons 11 No. of episodes 174 list of episodes) Production Executive producer Bill Hayes Producer Jennifer Stocks Editors Joshua Steadman\n\nKeith Shea\n\nStacie Schwarz Running time 20–44 minutes[1] Production companies Figure 8 Films\n\nAdvanced Medical Productions Release Original network Discovery Health (2007–08)\n\nTLC (2008–2017) Original release April 10, 2007 ( ) –\n\nJuly 24, 2017 ( 2017-07-24 )\n\nJon & Kate Plus 8, later known as Kate Plus 8, is an American reality television series starring Kate Gosselin, Jon Gosselin, and their eight children, which ran from April 4, 2007 to July 24, 2017.\n\nHistory [ edit ]\n\nFormer logo of the show, from before 2010\n\nAfter the success of two one-hour specials chronicling Kate Gosselin and her then-husband Jon, Surviving Sextuplets and Twins and One Year Later, the series aired on the Discovery Health Channel for the first two seasons before being moved to TLC. During its run, the series was one of the network's highest-rated programs,[2] with the fifth-season premiere seen by a record 9.8 million viewers, the most watched show of that evening including broadcast television, twice as many viewers as the show's previous series high.[3]\n\nAfter the Gosselins' divorce in 2009, the final episode of Jon & Kate Plus 8 aired on November 23, 2009, announced by TLC three days earlier.[4][5]\n\nThe series was later renamed Kate Plus 8 on June 6, 2010,[6] focusing on Kate as a divorced mother raising the children, with Jon appearing less frequently.[7] However, filming was later suspended due to Jon's lawyers delivering letters to TLC demanding that they cease and desist production and barred production crews from the couple's Pennsylvania property on October 1, 2009.[8][9][10] This led to putting the show's revamping on hold. TLC planned for \"a series of specials\" if the series did not go into production.[11]\n\nThe second season of Kate Plus 8 premiered on April 4, 2011, though on August 15, TLC announced that the series would be cancelled after it reached 150 episodes. The last episode aired on September 12, 2011.[12]\n\nOn March 19, 2014, it was announced that Kate and her eight would return in a reunion special, scheduled to air in June.[13]\n\nIn August 2014, it was announced that Kate Plus 8 would return for another season (its third, and first after an almost three-year hiatus) on January 13, 2015 on TLC.[14]\n\nSeason 4 of Kate Plus 8 started on December 8, 2015.[15]\n\nSeason 5 of Kate Plus 8 started on November 22, 2016.[16]\n\nSeason 6, with three episodes, started July 10, 2017.[17]\n\nCast [ edit ]\n\nThe twins\n\nCara Nicole Gosselin\n\nMadelyn \"Mady\" Kate Gosselin\n\nThe sextuplets\n\nAlexis Faith Gosselin\n\nHannah Joy Gosselin\n\nAaden Jonathan Gosselin\n\nCollin Thomas Gosselin\n\nLeah Hope Gosselin\n\nJoel Kevin Gosselin\n\nProduction [ edit ]\n\nBetween the specials and the series, permanent light fixtures were installed in the Gosselins' second home to make filming easier and prevent the kids from tripping over the wires and cables from temporary lighting. Jon & Kate Plus 8 filmed three days per week, with one day used for interview sessions where Jon, Kate and occasionally the children, discussed events occurring in each episode. In the family's first house, the \"interview corner\" was located in the basement, and was transformed from the playroom when needed. It was painted green, unlike the rest of the playroom. In their new house, the interview set was reproduced in an unfinished area of the basement. At season four's finale, Jon and Kate said they would make a new set for season five.\n\nCriticisms were raised regarding Kate's intentions of continuing with the show, as well as whether or not the children were being exploited or were under emotional distress.[18] According to lawyer Gloria Allred, \"Every state does regulate to protect the health, the safety and welfare of little child performers [...] And these little ones are only eight years old and five years old, they can’t protect themselves, so the state has to be sure that they are safe in their workplace.\"[18] In the case of the show, the children's workplace is their home. At this point there are no clear laws in Pennsylvania (where the Gosselins reside) regarding a child's appearance on a reality show.[19] However, Pennsylvania law permits children who are at least seven years old to work in the entertainment industry, as long as certain guidelines are followed and a permit is obtained. For example, children may not work after 11:30 p.m. under most circumstances, or perform in any location that serves alcohol.[19]\n\nKate and Jon Gosselin in 2008\n\nKate says that the children were happy and healthy and were never in any danger from doing the show. Jon stated they were \"in talks\" regarding ensuring the children's happiness,[18] and that there is no truth to any reports that the children have been hurt by the series.[20] TLC released a statement saying that the network \"fully complies with all applicable laws and regulations\" to produce the show. The statement also said that \"for an extended period of time, we have been engaged in cooperative discussions and supplied all requested information to the Pennsylvania Department of Labor and Industry\".[19]\n\nAn investigation by the Pennsylvania Bureau of Labor Law Compliance found that \"The activity being filmed was spontaneous. However, children introduced episodes of the television show and transitions. DVDs and other merchandise were sold involving the children's appearance. Lighting was placed in the home for the show and there was product placement in some episodes.\"[21] Because of these reasons, the children were considered to be working on the show, and the show was required to obtain work permits for the children, which it did not do.[21] An agreement was reached that no charges would be filed immediately as long as no further violations would occur.[21]\n\nMultimedia [ edit ]\n\nBooks [ edit ]\n\nThe Gosselins were managed by Media Motion International in Los Angeles.[22]\n\nKate Gosselin has written four books: Multiple Blessings (co-authored with Beth Carson and Jon), which was released November 1, 2008, Eight Little Faces in April 2009, I Just Want You to Know on April 13, 2010 and Love Is in the Mix, a cookbook, on September 13, 2013.\n\nDVDs [ edit ]\n\nTitle Region 1 Region 2 Discs Jon & Kate Plus 8: Seasons 1 & 2 September 9, 2008 2008 2 Jon & Kate Plus 8: Season 3 February 3, 2009 2009 4 Jon & Kate Plus 8: Season 4, Volume 1 - The Wedding May 5, 2009 2010 3 Jon & Kate Plus 8: Season 4, Volume 2 - The Big Move July 21, 2009 2 Jon & Kate Plus 8: Season 5 - Big Changes January 12, 2010\n\nOnline releases [ edit ]\n\nEpisodes of the series are available for download from the iTunes Store, Google Play, Amazon Video, and Microsoft Zune Marketplace. Every episode is also available on Discovery+.", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Kate_plus_8_logo.svg/1200px-Kate_plus_8_logo.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Kate_plus_8_logo.svg/250px-Kate_plus_8_logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Jon_%26_Kate_Plus_Eight_logo.svg/220px-Jon_%26_Kate_Plus_Eight_logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Jon_%26_Kate_~_minus_the_eight%21.jpg/220px-Jon_%26_Kate_~_minus_the_eight%21.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Kate_plus_8_logo.svg/1200px-Kate_plus_8_logo.svg.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jon_%26_Kate_Plus_8", "title": "Jon & Kate Plus 8", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Kate_plus_8_logo.svg/640px-Kate_plus_8_logo.svg.png", "width": 640, "height": 459}, "title": "Jon & Kate Plus 8 - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}