{"url": "https://www.sportsbettingdime.com/news/entertainment-props/bachelor-winter-games-odds-predictions/", "text": "Bachelor alumni Ben Higgins, Ashley Iaconetti, and Dean Unglert. (ABC Television Studios)\n\nOn February 9th, NBC is set to premiere one of the biggest television events of the year : the PyeongChang 2018 Winter Olympics. For just over two weeks, the eyes of the world will be watching as the top athletes from around the globe compete for gold. If you are not lucky enough — or financially blessed enough — to be South Korea-bound, chances are you will be watching these fierce competitors from the comfort of your own home.\n\nThe other major networks are aware that, for 17 days (Feb. 9th-25th), their regular programming is going to be up against one of the biggest sporting events in the world. ABC is embracing the Olympic ethos creating original, Olympic-themed content to compete with the PyeongChang games. But don’t expect to see the same mind-boggling feats of athleticism, because ABC’s Olympic offering is focused on love, or the TV version of it.\n\nOn February 13th, the network will be premiering The Bachelor Winter Games.\n\nThe latest iteration of the hit reality-romance franchise will see currently-single Bachelor alumni from all over the world going head-to-head in wintery challenges. ABC is billing the four-episode series as a “global celebration of unity and love,” a beautifully optimistic description of a television show renowned for its tears, drama, and short-lived romances.\n\nThe ultimate goal for the contestants is the same as it has always been: to fall deeply and sincerely in love. Except this time, as a press release from ABC states, the competitions will test the contestants’ perseverance in pursuing relationships, as they will be faced with language barriers and cultural differences. Now, we don’t know exactly what those “tests” are going to look like, but do not be surprised if it means seeing Dean Unglert shirtless on a ski hill.\n\nNot all 24 cast members have been revealed yet, however, we do know there will be ten former US Bachelor contestants (including Unglert, Eric Bigger, Ben Higgins, and Ashley Iaconetti), and 14 international contestants (including Benoit Beausejour Savard from Canada and Jordan Mauger of New Zealand).\n\nThere will also be numerous guest appearances. World figure skating champions Tai Babilonia and Randy Gardner are set to appear, as is former Tonya Harding nemesis Nancy Kerrigan. We’ll also see guest spots from former Bachelorettes Rachel Lindsay (especially spicy considering two of her former bachelors are a part of the Winter Games cast) and JoJo Fletcher, as well as current Bachelor Arie Luyendyk Jr.\n\nThe Bachelor franchise’s most successful couple, Trista and Ryan Sutter, will be kicking off the games as “grand marshals.” What that means is not entirely clear, but hopefully some of their good luck will rub off on the other contestants.\n\nSpeaking of, let’s take a look at how lucky in love our returning contestants may get during the Games.\n\nO/U number of couples at the end of The Bachelor Winter Games: 3.5\n\nDoes that seem low? Really? There could be as many as 12 couples at the end of the mini-season, but the chances of four or more genuinely pairing up are slim. Full-length seasons of Bachelor in Paradise don’t always produce more than a handful of couples, and this four-episode series is much shorter. Expect a lot of flirting, a lot of fun, and a lot of canoodling by the fire, but don’t expect too many true-blue partnerships to blossom out there on the slopes.\n\nOdds Amy Schumer makes a guest appearance on The Bachelor Winter Games: 4/1\n\nThough she is not slated to appear, it would make things a whole lot more interesting. Back in 2015, when Ben Higgins was our bachelor, he said that he would love for comedian Amy Schumer to appear on the show. Schumer responded by calling in to After Paradise, and after offering her support to Higgins (“I hope you find love”), she jokingly offered a — ahem — spicy phone conversation. It might be three years later, but with Ben returning to the franchise, it would be a guest appearance for the ages. Unfortunately, Schumer seems to be a pretty busy lady, so the odds are fairly long.\n\nOdds that The Bachelor Summer Games premieres in 2020: 15/1\n\nDepending on the ratings success of these Winter Games, a summer version could be in the works for 2020 — this is a franchise that knows how to appeal to the masses, after all. However, the summer already plays host to a large swatch of reality TV programming, and with the 2020 Summer Olympics in the mix, the fight for attention would just be too great.\n\nOdds of another The Bachelor Winter Games in 2022: 7/2\n\nAgain, depending on ratings, a second run might make sense. Competition for reality ratings is less fierce this time of year, and there is a large demographic of people who are not interested in sports, especially niche winter sports, like luge and curling. Just how strong this demographic is, we are about to find out.\n\nOdds that Dean Unglert and Lesley Murphy last all of 2018: 12/1\n\nOops! Cat’s out of the bag that these two pair up, but don’t blame us! The duo were spotted holding hands at the Sundance Festival in Park City, Utah, recently, although there is a sneaking suspicion that they were supposed to wait until after the airing of the Winter Games. According to sources, they seemed really happy, and if there is anything we can trust, it is anonymous sources watching former Bachelor contestants from afar.\n\nIn reality, Bachelor-formed couples do not typically have much staying power, and there is a lot of time left in the year. If Dean and Lesley make it, kudos to them! Unfortunately, the under is the heavy favorite.\n\nOdds Chris Harrison starts the season with a “code of conduct” pep talk: 8/1\n\nFollowing last year’s Bachelor in Paradise scandal, is it possible that Chris Harrison will kick off this year’s games with a strict code of conduct talk? Yes. Those in charge of the franchise are taking whatever measures they can to ensure something of that magnitude does not happen again — including imposing drink limits on contestants. But considering the limited amount of air-time the show is going to enjoy, chances are that the talk will happen off-air.\n\nOdds The Bachelor Winter Games gets higher ratings than the 2020 Olympics: 25/1\n\nWithout knowing the sporting schedule of the PyeongChang Games, it’s hard to say for sure, but if ABC manages to swing a ratings coup, it will be a massive surprise. While they are both technically “international events,” we know which one holds more global clout.\n\nOdds a martini luge is used on The Bachelor Winter Games: 25/1\n\nFortunately, the franchise is learning from past mistakes and has imposed a limit on how many drinks contestants can consume within an hour. So, while it doesn’t really feel appropriate to not have a martini luge during a winter sport-themed Bachelor spin-off, this might be part of that concentrated effort to keep things tidy.\n\nOdds of Eric Bigger winning back Rachel Lindsay: 50/1\n\nHah!", "images": ["https://cdn.sportsbettingdime.com/app/uploads/media/logo-betvictor-dark-2.svg", "https://cdn.sportsbettingdime.com/app/uploads/media/logo-paddypower-light-1.svg", "https://cdn.sportsbettingdime.com/app/themes/SportsBettingDime/dist/images/ico-user-gold.svg", "https://cdn.sportsbettingdime.com/app/uploads/bachelorwintergames-1515456173-e1516924710378.jpg", "https://cdn.sportsbettingdime.com/app/uploads/media/logo-betway-light-3.svg", "https://cdn.sportsbettingdime.com/app/themes/SportsBettingDime/dist/images/ico-info-g.svg", "https://cdn.sportsbettingdime.com/app/themes/SportsBettingDime/dist/images/footer/appstore.svg", "https://cdn.sportsbettingdime.com/app/themes/SportsBettingDime/dist/images/title-badge-small-red.svg", "https://cdn.sportsbettingdime.com/app/themes/SportsBettingDime/dist/images/late-edition-newsletter/sbd-late-newsletter-footer.jpg", "https://cdn.sportsbettingdime.com/app/themes/SportsBettingDime/dist/images/Symbol_SBD_Light.svg", "https://cdn.sportsbettingdime.com/app/themes/SportsBettingDime/dist/images/ico-info-w.svg", "https://cdn.sportsbettingdime.com/app/uploads/media/logo-888sport-light-3.svg", "https://cdn.sportsbettingdime.com/app/uploads/lesley-e1516925798806.png", "https://cdn.sportsbettingdime.com/app/uploads/abc-bachelor-winter-games-coming-soon-e1516925205133.jpg", "https://cdn.sportsbettingdime.com/app/themes/SportsBettingDime/dist/images/footer/playstore.svg", "https://cdn.sportsbettingdime.com/app/plugins/cookiepro-ccpa/assets/images/icon.png", "https://cdn.sportsbettingdime.com/app/themes/SportsBettingDime/dist/images/logo-sbdplay-dark.svg", "https://cdn.sportsbettingdime.com/app/uploads/media/1/logo-unibet-light.svg", "https://cdn.sportsbettingdime.com/app/uploads/IMG_8589.jpg"], "top_img": "https://cdn.sportsbettingdime.com/app/uploads/bachelorwintergames-1515456173-e1516924710378.jpg", "keywords": [], "authors": ["Kaela Napier", "Entertainment Writer"], "canonical_link": "https://www.sportsbettingdime.com/news/entertainment-props/bachelor-winter-games-odds-predictions/", "title": "The Bachelor Winter Games Odds & Predictions", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"app_id": 141070506557502}, "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "description": "ABC's answer to PyeongChang is here! How many couples will hook-up on The Bachelor Winter Games (Feb. 15th) and will the show trump the real Olympics?", "og": {"locale": "en_US", "type": "article", "title": "The Bachelor Winter Games Odds & Predictions", "description": "ABC's answer to PyeongChang is here! How many couples will hook-up on The Bachelor Winter Games (Feb. 15th) and will the show trump the real Olympics?", "url": "https://www.sportsbettingdime.com/news/entertainment-props/bachelor-winter-games-odds-predictions/", "site_name": "Sports Betting Dime", "updated_time": "2018-01-26T19:54:51+00:00", "image": {"identifier": "https://cdn.sportsbettingdime.com/app/uploads/bachelorwintergames-1515456173-e1516924710378.jpg", "secure_url": "https://cdn.sportsbettingdime.com/app/uploads/bachelorwintergames-1515456173-e1516924710378.jpg", "width": 680, "height": 340}}, "article": {"publisher": "https://www.facebook.com/SportsBettingDime/", "tag": "odds", "section": "Entertainment", "published_time": "2018-01-28T13:55:09+00:00", "modified_time": "2018-01-26T19:54:51+00:00"}, "twitter": {"card": "summary_large_image", "description": "ABC's answer to PyeongChang is here! How many couples will hook-up on The Bachelor Winter Games (Feb. 15th) and will the show trump the real Olympics?", "title": "The Bachelor Winter Games Odds & Predictions", "site": "@SBD", "image": "https://cdn.sportsbettingdime.com/app/uploads/bachelorwintergames-1515456173-e1516924710378.jpg", "creator": "@kaelamarshall"}, "generator": "WordPress 6.0", "msapplication-TileImage": "https://www.sportsbettingdime.com/app/uploads/media/1/favicon.ico"}, "movies": ["https://www.youtube.com/embed/rWvTRMi657o"], "publish_date": 1517147709.0, "source": "https://www.sportsbettingdime.com", "summary": ""}