{"url": "https://ew.com/recap/the-magicians-season-1-finale/", "text": "We’re all the protagonists of our own lives, but what happens when we learn we’re not the protagonists of the stories to which our lives are tied?\n\nThat’s the hard truth that Quentin Coldwater faces in the season 1 finale of The Magicians, which, while adhering to many of the details of the source material’s showdown with the Beast, takes a wild left turn that could completely alter the trajectory of the characters as they head into season 2.\n\nBut that’s something The Magicians has been doing from the start, primarily by running Julia’s story concurrent with Quentin’s and the other characters at Brakebills. While her entire backstory is covered in the second novel in the series from Lev Grossman, The Magician King, here her story is not just played out simultaneously but interwoven in ways that make her a major player.\n\nJulia’s prominence has been perhaps one of the most fundamentally important and smart choices made in this adaptation because it not only showcases the fallibility of the magical world (which the portions of the show at Brakebills have no qualms about also revealing), but also gives viewers a more tragic, sympathetic character at the heart of the show’s ensemble.\n\nAnd The Magicians has truly grown into fully taking advantage of that ensemble, even if the dual Quentin/Julia narratives are at the show’s heart. The Syfy series has made sure to give Eliot, Margo, Penny, and Alice the spotlights they deserve as they too are shaped and irrevocably changed by their steps into a magical world.\n\n“Have You Brought Me Little Cakes” focuses on those literal steps as the entire Brakebills crew finds their way into Fillory to take on the Beast, who they assume is Christopher Plover. They all don’t arrive together, of course. While most of the Brakebills students take a path via the fountains of the Neitherlands, Quentin and Julia head back in time to 1942, following Jane Chatwin into the magical land they once thought was the stuff of fiction (and where the air is 0.2 percent opium).\n\nQuentin and Julia even learn that they themselves are in the Fillory and Further books, helping Jane out of a trap and discovering Martin Chatwin has followed them. Martin helps them create the very blade that will be required to fell the Beast, but it will require ages to cobble. Luckily, he agrees, helping the duo to make further progress, only to run into the Watcherwoman…who is actually Eliza…who is, of course, also Jane Chatwin..\n\nYes, the great villainess of the books is actually a good friend (who they have to break the news to that she has died in her 40th time loop, each a separate attempt to slightly alter the world and hopefully kill the Beast). She helps them along their way to the present, where they reunite with Quentin’s friends in a rundown, hollowed-out shell of Fillory.\n\nUnfortunately, everyone still hates one another, and they’re not too pleased to see Julia, either, after almost killing Quentin earlier in the season. But despite the bad vibes permeating the entire group, they find their way back to the knifemaker from decades earlier. He died long ago (as has much of Fillory, including High King Martin Chatwin), but his son has been waiting for them. He gives them the blade so long as they agree to the one condition they promised.\n\nOne of the men in their group is set to become the High King of Fillory (only non-Fillorians can assume the throne), and he wants whoever that is to marry his daughter. That new High King just so happens to be Eliot, who has gone from drinking himself silly for fun to drinking himself half to death to escape after his disastrous Beast lackey Mike. It means never being with Margo again, a revelation played out in a beautiful scene that offers a wonderful distillation of Eliot and Margo’s relationship thanks to the work of Hale Appleman and Summer Bishil.\n\nNEXT: A wedding, a revelation, and a revolting jar from Ember\n\nAs the wedding (and subsequent consummation) commences, almost everyone else’s focus is on finding the Beast, particularly after they discover none of them can touch the vanquishing blade. It may only be held by master magicians, and sadly none who pick it up (all of the men in the group) choose to pick it up. Someone needs to be more powerful, as powerful as a god.\n\nJulia and Quentin follow that possible lead, heading off to summon Ember and Umber while the rest rescue Victoria, the traveler trapped by the Beast, and her fellow mystery captive. They succeed, as do Quentin and Julia, who find Ember, the one remaining satyr-esque god of Fillory (his brother, Umber, unfortunately was decimated by the Beast). Ember is so impressed with Quentin’s undying faith in this magical land that he believes he may just be its savior, the One. So he gives Quentin a jar of his essence to consume and therefore assume the god’s power.\n\nUnfortunately, that jar is a generous helping of Ember’s semen, which the two take back to the group to discover Victoria resting, as well as the other captive, Christopher Plover. Yes, Plover is indeed not the Beast, who is actually Martin Chatwin. Plover, still believing he and Martin are meant for each other (a disturbing revelation uncovered from Martin’s childhood earlier in the season), reveals that each day Martin heads off to the Wellspring of Fillory, the world’s source of magic. He drinks from it, robbing himself of his humanity while becoming all the more powerful.\n\nSo while they have a better sense of their enemy, Ember’s gift came with another fracturing of the group as he unseals the mental block inside Julia’s mind first noticed by Eliza earlier in the episode. In doing so, he lets flood back into her consciousness the truth of her dealings with Our Lady Underground.\n\nAnd the truth is the god was not Our Lady at all but Reynard the Fox, a trickster of a god who wanted to be set free into the world, and Julia’s group gave him exactly that. He repaid them by killing almost every member, save for Kady, who is able to flee thanks to Julia’s protection.\n\nJulia reveals all of this to Quentin, as well as what Reynard did to her. He tells her he chose her, and in doing so, he rapes Julia (during which Kady makes her escape). The revelation of what happens to Julia in The Magician King is perhaps the series’ most harrowing sequence and one the show does not shy away from portraying. It’s a moment that drives the rest of her actions in the finale and will certainly continue to in season 2. Julia chooses to handle the atrocities committed against her and her friends by calling upon Marina to block out her memory. (Unfortunately, while Julia briefly grapples with the act in the finale, we’ll have to wait until the next season to see whether the show fully addresses what has happened to Julia or whether the horrible act falls into the more trope-ish use of rape on TV that has seemed to occur more and more often in recent years. But the end card pointing viewers to a helpline at the very least underlines how seriously those behind the show take the subject.) As she tells Quentin, her only desire now is to find and kill Reynard.\n\nBut before they do, there is the Beast to vanquish. Quentin has been living his life, believing he is meant for something bigger, and his acceptance to Brakebills confirmed that in his mind. When he learns of the Beast and the task before him, he knows he must be the one to kill it, and Ember calling upon him to be Fillory’s savior only reaffirms that, as well.\n\nQuentin says as much in the episode’s voiceover, given by a future Quentin writing Fillory and Further: Book 7. But despite all those tales of destiny, wish fulfillment, and heroism Quentin believes his own life is meant to sit alongside, he comes to realize he very likely isn’t the hero of this particular book. He asks Alice instead to take that responsibility, knowing her to be a better person and magician than he.\n\nGranted, their relationship isn’t at its best, considering Quentin’s threesome with Eliot and Margo, but Alice takes Quentin’s admission as genuine and drinks of Ember’s seed (which is still very, very gross) before they head off to the Wellspring.\n\nNEXT: A showdown with the Beast\n\nInside they find an approximation of Plover’s writing room, another clear sign Martin is haunted by his past. Martin almost immediately shows up, and Quentin works to distract their foe so that Alice can strike. He pretends to have a gift from Jane for her brother, but as Alice goes to use the blade, she finds it missing. Martin retaliates, causing Alice to bleed out (possibly to death, though that’s left murky), knocking Eliot and Margo aside, and slicing off Penny’s hands.\n\nThough the setting may be different, many of those particulars adhere to the book, but there’s one variable the show throws into play: Julia. Being raped by Reynard left her infused with the power of a god (via his ejaculation), and she uses it to threaten Martin with the blade. But rather than kill him, she wants to make a deal. Martin can deal with gods, as he did with Umber, and she has designs on Reynard in mind. The two disappear, leaving Quentin to watch two of his friends lying unconscious, another bleeding profusely from the wrists, and the last, the one he loves, possibly dead.\n\nAnd that’s how you do a maddening yet sensible cliffhanger.\n\nWANT MORE? Keep up with all the latest from last night’s television by subscribing to our newsletter. Head here for more details.\n\nSeason 1 of The Magicians ends on a note that leaves nearly every major player’s fate up in the air, but its suspension of their fates doesn’t cheat the viewer from a powerful and unique hour. It is frustrating to not have some culmination of the story of the Beast because he has been the clear and present danger since episode 1. As far as recent television cliffhangers go, however, the Beast’s continued existence at least makes narrative sense considering Julia’s experiences and certainly has repercussions for every major character that should set the stage for the next season.\n\nOf course season 1 has seen its fair share of cliffhangers. Almost every episode of The Magicians has felt different, taking on various tropes or styles, from dream sequences to haunted houses, while putting its characters through the ups and downs of the magical life. Not every episode has been a success. At times the show has been messy in its search of themes, characterization, and more. But the fresh stylistic choices imbued into each episode have made it a ride worth seeing through to its powerful conclusion.\n\nAnd it’s a conclusion that hews so closely to the novels’ penchant for darkness. No one receives a fairy tale ending in season 1’s finale, and really, The Magicians has never been exactly interested in paving a happily ever after for its host of deeply flawed characters. This adaptation makes no attempts to hide both the good and bad facets of its characters. Quentin, the presumed protagonist you should love in any other story is here selfish, cynical, and, well, a bit of a dick. Julia has been cast out by her best friend, but she allows the darkness in her to be brought out by fellow hedgewitches who help her to exact revenge that almost kills Quentin. Penny, despite his penchant for being curt and agitated, wants to do good and is, like all of his fellow students, trying to find his place in the world.\n\nIt’s also an adaptation that adds a completely different paradigm to the showdown with the Beast in the first book in the series. (Spoiler alert for those of you who haven’t read the book: The Beast is ultimately killed at the end of that book, which is obviously the most dramatic shift, but Julia’s presence completely alters the potential for where the next season can go, as well. There are certainly ways the show can play into The Magician King and its plot, especially with everyone finally having made it to Fillory, but the wildcard of Julia and the Beast allows the show’s writers plenty of potential to both utilize and subvert the narrative beats of the second novel. End Spoilers)\n\nThis adaptation’s other biggest top-down alteration is its focus on the ensemble rather than simply Quentin’s plight (or in the case of the season and the second book, the plights of Quentin and Julia.) “Cakes” offers every major character a chance to show off their light and dark sides, their desires to help one another and Fillory and yet to selfishly look out for themselves, as well. While characters like Eliot, Margo (Janet in the books), and Penny are certainly not simple caricatures in Grossman’s novels, the show’s needs, as opposed to those of a novel, have given life to beautiful character-building moments throughout. Meeting Alice’s parents, Margo revealing to Quentin her love of the Fillory books, Penny’s relationship with Kady, and Eliot’s transformation — they all build out the world of The Magicians while offering any number of examples of just how even in a world full of magic, there’s plenty, if not more, darkness, temptation, and questions of morality to reckon with.\n\nYet the transformation into more of an ensemble doesn’t take away from Quentin’s journey, either, particularly as he’s given the opportunity to grow in the finale. As Quentin tells Alice he’s not the protagonist of this tale, she tells him in kind that, while he may not be perfect, he’s a far better person than he believes he is.\n\nThe season 1 finale is told from a future Quentin’s perspective as he writes down what happened to himself and his friends, regardless of who is at the heart of the story. The truth is, the story could not be told without all of them playing their roles — they’re all at the heart of this tale. Ensuring the vitality of each of its characters since the early episodes, The Magicians has made itself a powerful tale of how life, magical or not, requires the help of others to make it through the best and worst of times.\n\nClearly, with his narrating position, Quentin makes it through long enough to survive these particularly horrible times, but everyone else’s fate remains up for grabs. And with the touching work put in during this season, The Magicians offers plenty of reason to return to Fillory — and perhaps even go further.\n\nWe wrote a react for this episode, which means we’ll just be checking in occasionally, but if this is a show you’d like to read about each week, please let us know! You can email chat@ew.com with your feedback and suggestions.", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F04%2Fthemagicians-4-19-171-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F07%2F14%2FJosh-Hartnett-The-Faculty-071422.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F08%2F05%2FBrett-Goldstein-Hannah-Waddingham-Three-Rounds-080522-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2067'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F01%2Fthe-magicians-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2016%2F02%2Frecaps-the-magicians-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2016%2F02%2Fnup_170408_0840-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2016%2F07%2Frecaps-magicians_0.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2016%2F01%2Frecaps-the-magicians-02.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2016%2F02%2Frecaps-the-magicians-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Few.com%2Fimg%2Fmisc%2F300x250_magazines_and_more.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2016%2F04%2Fjdklsfsfs.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2019%2F02%2Fnup_183762_1461-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=800&h=400&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2016%2F04%2Fjdklsfsfs.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F08%2F16%2FBetter-Call-Saul_081622_4.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=800&h=400&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2016%2F04%2Fjdklsfsfs.jpg", "keywords": [], "authors": ["Jonathon Dornbush", "Chancellor Agard", "April", "At Am Edt"], "canonical_link": "https://ew.com/recap/the-magicians-season-1-finale/", "title": "The Magicians finale recap: Have You Brought Me Little Cakes", "meta_data": {"viewport": "width=device-width,initial-scale=1", "theme-color": "#111", "keywords": "entertainment, entertainment news, ew, entertainment weekly", "news_keywords": "entertainment, entertainment news, ew, entertainment weekly", "description": "The showdown with the Beast arrives &mdash; but not without a wedding, loss, and a few devastating revelations first", "robots": "max-image-preview:large", "og": {"title": "'The Magicians' finale recap: Quentin and the gang finally face the Beast", "type": "article", "site_name": "EW.com", "url": "https://ew.com/recap/the-magicians-season-1-finale/", "description": "The showdown with the Beast arrives &mdash; but not without a wedding, loss, and a few devastating revelations first", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=800&h=400&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2016%2F04%2Fjdklsfsfs.jpg", "width": 800, "height": 400}}, "pinterest": {"url": "https://ew.com/recap/the-magicians-season-1-finale/", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2016%2F04%2Fjdklsfsfs.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/recap/the-magicians-season-1-finale/", "title": "'The Magicians' finale recap: Quentin and the gang finally face the Beast", "description": "The showdown with the Beast arrives &mdash; but not without a wedding, loss, and a few devastating revelations first", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=800&h=400&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2016%2F04%2Fjdklsfsfs.jpg"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}, "url": "https://ew.com/recap/the-magicians-season-1-finale/"}, "movies": [], "publish_date": null, "source": "https://ew.com", "summary": ""}