{"url": "https://www.hollywoodreporter.com/live-feed/is-us-creator-everything-involving-jacks-death-will-be-answered-super-bowl-episode-1077863", "text": "[This story contains spoilers from the Jan. 23 “That’ll Be the Day” episode of NBC’s This Is Us.]\n\nFrom the beginning, audiences have known that Milo Ventimiglia’s family man Jack Pearson was not alive in the present day on This Is Us. But now, with the show’s big post-Super Bowl LII episode looming, the father of three’s cause of death was finally revealed during Tuesday’s episode.\n\nThe episode followed Jack in what was, unbeknownst to him or his family, the final day of his life — Super Bowl Sunday. While he and wife Rebecca (Mandy Moore) plotted their future as empty nesters while watching, their kids all eschewed family time to hang out with their friends. And while Kate and Randall both had sweet moments of potential closure with their father, Kevin, who had gotten into a fight with his parents, planned to leave his apology for the morning. In the final moments of the episode, Jack cleaned up the kitchen and went to bed, but didn’t unplug the faulty Crockpot, which sparked and lit the kitchen on fire.\n\nHere, creator Dan Fogelman speaks with The Hollywood Reporter about the lingering mystery surrounding Jack’s death, what audiences haven’t figured out (yet) and where NBC’s time-twisting family drama goes next for Rebecca, Kevin (Justin Hartley), Kate (Chrissy Metz) and Randall (Sterling K. Brown) after the big Jack reveal.\n\nDid you always intend on having Jack’s death be this big mystery people would rally around?\n\nNo, I knew it was going to be part of the conversation about this show. Part of what you have to realize when you’re making a show — you don’t realize at the beginning it’s going to get as big as this has gotten. So I expected that there would be a conversation about how he died — when exactly, how exactly — but the scope of the conversation and the size of it I was not expecting.\n\nAre you annoyed that people clung on to that?\n\nIt doesn’t annoy me at all, no. We’ve been careful to moderate it and try to tease it along in a way where it’s fulfilling for the audience without it overtaking the show, and I think we’ve done a good job of it. [With season two] we were coming to a season where people are going to have to know how he dies. We gave a little clue at the beginning of the season, and that conversation has really gone away quite a bit this season until the last few episodes when we’re heading toward it. I feel like we’ve done a good job by giving people a little of what they want but also not dragging it out longer than it needs to go, because the show is about more than that. Certainly it would be more frustrating if Jack’s death wasn’t such a pinnacle moment for our family. Ultimately this is a family show, and the loss of this amazing patriarch of the family was a defining moment for this family. If everybody was just focused on some element that didn’t really matter, then that would be more concerning.\n\nOnce the the big reveal happens, what’s next? It felt like the show was building to this, so where do you go from here?\n\nIt goes to a lot of places. We’re not even at our halfway mark with the series, and this was always the plan. There’s a big plan for the series, and you’ll see how that relates to Jack and this family in the Super Bowl episode. That all being said, I would argue that this season, outside of our first episode and these last two, we barely touched upon Jack’s death. It’s been almost entirely about the storyline with Kate’s pregnancy, Kevin’s alcohol addiction, Randall and Beth fostering a child, and Jack and Rebecca informing those stories in the past. Many of our best episodes had absolutely nothing to do with Jack’s death, and that will continue to be the case. And then we’re going to new places where people don’t even know quite yet exactly where the show is going and what it’s about, and that’s going to start revealing itself as we move forward.\n\nWas the three-part episode something you plotted out from the beginning or was it also a helpful way to make sure Jack’s death fell on the Super Bowl episode?\n\nNo, we always knew that. We didn’t know how many episodes that would fold out on, but making Jack’s reveal be [after the] Super Bowl — we were always going to reveal Jack’s death around this point in the second season. It was going to be some kind of big [event] — it was maybe Christmas, it was maybe going to be Valentine’s Day, some holiday that holds [significance] to this family. The second the show started getting successful in season one, I started pestering [NBC executives] Jen Salke and Bob Greenblatt a bit and saying, “I understand you guys are going to have the Super Bowl next year.” Because this was a football family and it would make so much sense, karmically, but I think in order to spread out for the schedule we would have shifted our schedule a little bit. We would have created extra episodes.\n\nHow does an episode that’s going to show Jack’s death vibe with post-Super Bowl programming?\n\nIt will remain to be seen. I’m incredibly excited about the episode. I’ve just completed it, all the final touches. It’s very special, and one of if not our best. How people want to watch television after the Super Bowl, I don’t know, but I suspect the way it starts, the opening six minutes of it, it’s going to be hard for people to turn it off. Our director and actors did a tremendous job. It’s pretty spectacular and you can’t really breathe.\n\nThere’s something to be said for the way This Is Us has brought back family drama. It makes you cry but it does make you feel good, too.\n\nThat’s going to be one of our challenges in the Super Bowl episode — it’s one of our biggest storylines if not our biggest storyline. By its inherent nature, it’s very hard not to be sad. The show has gotten a lot of heat for making people cry all the time, but I don’t think people are always just crying out of sadness — it may be melancholy, but our writers and actors are opening people up in a feel-good cry kind of way. Some of the cries next week are hard, sad cries. It’s a different kind of cry, but I think for fans of the show and for people who are coming to the show fresh, they don’t know everything yet. People think they know what’s going to happen with the fire and Jack, but I think if you bear with the sad like we always try to do with the show, there’s a great amount of surprise and uplift.\n\nWhat kind of entry point is there for nonviewers or people who aren’t up to date?\n\nIt’s a difficult one. We’re on a network and it’s the Super Bowl, so we have a limited amount of air time. You try to do a “previously on” to catch up new people to the show but it’s hard to do in 30 seconds, so my recommendation is to, if this is a show that people have been looking forward to trying, to try to watch as fast as possible in the next two weeks. I think the episode can stand on its own because it’s centered around this pinnacle event and every storyline in the present day feeds off of that, so as long as you have a general sense of who’s who … I think that the performances are so strong and it’s equal parts thrilling and heartbreaking and uplifting, that people, if it’s their first time watching, will hopefully go with it.\n\nThe promo for the episode promised to answer everyone’s questions, but what kind of questions will it answer?\n\nThe big question is everything involving and surrounding Jack’s death: How did he die? When did he die? What was the cause of his death? How did it relate to Kate? Anything involving Jack’s death, you get those answers in this episode.\n\nThe past season and a half has shown a lot about how Jack’s death affected his kids, but it wasn’t until the therapy scene in last week’s episode that viewers saw how it affected Rebecca. Will there be more about how his death affects her?\n\nVery much. When you see Rebecca in the present day, the older version of Mandy, I’ve always felt she’s a lovely character, but there’s a general sadness with which she carries herself that Mandy has brought to older Rebecca that younger Rebecca didn’t quite have, and we start exploring that. Mandy is so extraordinary in these next two episodes, it’s really tour de force, highest degree of difficulty stuff, and I’m so incredibly proud of her and I can’t wait. I think she’s consistently underrated and overlooked in our show because the character is always holding down the fort, but the work she’s doing as an actress in two different periods is so extraordinary, and it’s a real showcase for her in the next couple of weeks.\n\nMaybe she’ll get some award recognition too.\n\nWe’re so thrilled that Milo and Chrissy and Sterling got nominations, but this year Justin is doing such incredible work and Mandy is just — I will kind of eat my hat if people don’t stand up and take notice of this work.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/nup_180616_0453_copy_-_embed_2018.jpg?w=928", "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/nup_181159_1160_copy_-_h_2017_0.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/nup_181159_0410_-_embed_2018.jpg?w=928"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/nup_181159_1160_copy_-_h_2017_0.jpg?w=1024", "keywords": [], "authors": ["Jean Bentley"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/is-us-creator-everything-involving-jacks-death-will-be-answered-super-bowl-episode-1077863/", "title": "‘This Is Us’ Creator: Everything Involving Jack’s Death Will Be Answered in Super Bowl Episode", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Dan Fogelman talks with THR about Tuesday's big reveal and how he plans to make the NBC family drama accessible for a post-Super Bowl audience.", "news_keywords": "Dan Fogelman, This Is Us", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Jean Bentley", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1077863, "title": "'This Is Us' Creator: Everything Involving Jack's Death Will Be Answered in Super Bowl Episode", "published_at": "2018-01-24 10:39:48", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/nup_181159_1160_copy_-_h_2017_0.jpg?w=1024", "comment_count": 0, "tags": "This Is Us", "topics": "TV News", "body": "[This story contains spoilers from the Jan. 23 \"That'll Be the Day\" episode of NBC's This Is Us.]\r\nFrom the beginning, audiences have known that Milo Ventimiglia's family man Jack Pearson was not alive in the present day on This Is Us. But now, with the show's big post-Super Bowl LII episode looming, the father of three's cause of death was finally revealed during Tuesday's episode.\r\nThe episode followed Jack in what was, unbeknownst to him or his family, the final day of his life — Super Bowl Sunday. While he and wife Rebecca (Mandy Moore) plotted their future as empty nesters while watching, their kids all eschewed family time to hang out with their friends. And while Kate and Randall both had sweet moments of potential closure with their father, Kevin, who had gotten into a fight with his parents, planned to leave his apology for the morning. In the final moments of the episode, Jack cleaned up the kitchen and went to bed, but didn't unplug the faulty Crockpot, which sparked and lit the kitchen on fire.\r\nHere, creator Dan Fogelman speaks with The Hollywood Reporter about the lingering mystery surrounding Jack's death, what audiences haven't figured out (yet) and where NBC's time-twisting family drama goes next for Rebecca, Kevin (Justin Hartley), Kate (Chrissy Metz) and Randall (Sterling K. Brown) after the big Jack reveal.\r\n\r\nDid you always intend on having Jack's death be this big mystery people would rally around? \r\nNo, I knew it was going to be part of the conversation about this show. Part of what you have to realize when you're making a show — you don't realize at the beginning it's going to get as big as this has gotten. So I expected that there would be a conversation about how he died — when exactly, how exactly — but the scope of the conversation and the size of it I was not expecting.\r\nAre you annoyed that people clung on to that?\r\nIt doesn't annoy me at all, no. We've been careful to moderate it and try to tease it along in a way where it's fulfilling for the audience without it overtaking the show, and I think we've done a good job of it. [With season two] we were coming to a season where people are going to have to know how he dies. We gave a little clue at the beginning of the season, and that conversation has really gone away quite a bit this season until the last few episodes when we're heading toward it. I feel like we've done a good job by giving people a little of what they want but also not dragging it out longer than it needs to go, because the show is about more than that. Certainly it would be more frustrating if Jack's death wasn't such a pinnacle moment for our family. Ultimately this is a family show, and the loss of this amazing patriarch of the family was a defining moment for this family. If everybody was just focused on some element that didn't really matter, then that would be more concerning.\r\n\r\nOnce the the big reveal happens, what's next? It felt like the show was building to this, so where do you go from here?\r\nIt goes to a lot of places. We're not even at our halfway mark with the series, and this was always the plan. There's a big plan for the series, and you'll see how that relates to Jack and this family in the Super Bowl episode. That all being said, I would argue that this season, outside of our first episode and these last two, we barely touched upon Jack's death. It's been almost entirely about the storyline with Kate's pregnancy, Kevin's alcohol addiction, Randall and Beth fostering a child, and Jack and Rebecca informing those stories in the past. Many of our best episodes had absolutely nothing to do with Jack's death, and that will continue to be the case. And then we're going to new places where people don't even know quite yet exactly where the show is going and what it's about, and that's going to start revealing itself as we move forward.\r\nWas the three-part episode something you plotted out from the beginning or was it also a helpful way to make sure Jack's death fell on the Super Bowl episode?\r\nNo, we always knew that. We didn't know how many episodes that would fold out on, but making Jack's reveal be [after the] Super Bowl — we were always going to reveal Jack's death around this point in the second season. It was going to be some kind of big [event] — it was maybe Christmas, it was maybe going to be Valentine's Day, some holiday that holds [significance] to this family. The second the show started getting successful in season one, I started pestering [NBC executives] Jen Salke and Bob Greenblatt a bit and saying, \"I understand you guys are going to have the Super Bowl next year.\" Because this was a football family and it would make so much sense, karmically, but I think in order to spread out for the schedule we would have shifted our schedule a little bit. We would have created extra episodes.\r\n\r\nHow does an episode that's going to show Jack's death vibe with post-Super Bowl programming? \r\nIt will remain to be seen. I'm incredibly excited about the episode. I've just completed it, all the final touches. It's very special, and one of if not our best. How people want to watch television after the Super Bowl, I don't know, but I suspect the way it starts, the opening six minutes of it, it's going to be hard for people to turn it off. Our director and actors did a tremendous job. It's pretty spectacular and you can't really breathe.\r\nThere's something to be said for the way This Is Us has brought back family drama. It makes you cry but it does make you feel good, too.\r\nThat's going to be one of our challenges in the Super Bowl episode — it's one of our biggest storylines if not our biggest storyline. By its inherent nature, it's very hard not to be sad. The show has gotten a lot of heat for making people cry all the time, but I don't think people are always just crying out of sadness — it may be melancholy, but our writers and actors are opening people up in a feel-good cry kind of way. Some of the cries next week are hard, sad cries. It's a different kind of cry, but I think for fans of the show and for people who are coming to the show fresh, they don't know everything yet. People think they know what's going to happen with the fire and Jack, but I think if you bear with the sad like we always try to do with the show, there's a great amount of surprise and uplift.\r\n\r\nWhat kind of entry point is there for nonviewers or people who aren't up to date?\r\nIt's a difficult one. We're on a network and it's the Super Bowl, so we have a limited amount of air time. You try to do a \"previously on\" to catch up new people to the show but it's hard to do in 30 seconds, so my recommendation is to, if this is a show that people have been looking forward to trying, to try to watch as fast as possible in the next two weeks. I think the episode can stand on its own because it's centered around this pinnacle event and every storyline in the present day feeds off of that, so as long as you have a general sense of who's who ... I think that the performances are so strong and it's equal parts thrilling and heartbreaking and uplifting, that people, if it's their first time watching, will hopefully go with it.\r\nThe promo for the episode promised to answer everyone's questions, but what kind of questions will it answer?\r\nThe big question is everything involving and surrounding Jack's death: How did he die? When did he die? What was the cause of his death? How did it relate to Kate? Anything involving Jack's death, you get those answers in this episode.\r\nThe past season and a half has shown a lot about how Jack's death affected his kids, but it wasn't until the therapy scene in last week's episode that viewers saw how it affected Rebecca. Will there be more about how his death affects her?\r\nVery much. When you see Rebecca in the present day, the older version of Mandy, I've always felt she's a lovely character, but there's a general sadness with which she carries herself that Mandy has brought to older Rebecca that younger Rebecca didn't quite have, and we start exploring that. Mandy is so extraordinary in these next two episodes, it's really tour de force, highest degree of difficulty stuff, and I'm so incredibly proud of her and I can't wait. I think she's consistently underrated and overlooked in our show because the character is always holding down the fort, but the work she's doing as an actress in two different periods is so extraordinary, and it's a real showcase for her in the next couple of weeks.\r\nMaybe she'll get some award recognition too.\r\nWe're so thrilled that Milo and Chrissy and Sterling got nominations, but this year Justin is doing such incredible work and Mandy is just — I will kind of eat my hat if people don't stand up and take notice of this work.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘This Is Us’ Creator: Everything Involving Jack’s Death Will Be Answered in Super Bowl Episode", "url": "https://www.hollywoodreporter.com/tv/tv-news/is-us-creator-everything-involving-jacks-death-will-be-answered-super-bowl-episode-1077863/", "description": "Dan Fogelman talks with THR about Tuesday’s big reveal and how he plans to make the NBC family drama accessible for a post-Super Bowl audience.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/nup_181159_1160_copy_-_h_2017_0.jpg?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2018-01-24T10:39:48+00:00", "modified_time": "2018-01-25T12:26:09+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘This Is Us’ Creator: Everything Involving Jack’s Death Will Be Answered in Super Bowl Episode", "description": "Dan Fogelman talks with THR about Tuesday’s big reveal and how he plans to make the NBC family drama accessible for a post-Super Bowl audience.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/nup_181159_1160_copy_-_h_2017_0.jpg?w=1280"}}, "movies": [], "publish_date": 1516790388.0, "source": "https://www.hollywoodreporter.com", "summary": ""}