{"url": "https://en.wikipedia.org/wiki/Arrested_Development_(season_5)", "text": "No.\n\noverall No. in\n\nseason Title Directed by Written by Original release date Prod.\n\ncode\n\nPart 1\n\nAfter Gob forced Michael to take a Forget-Me-Now on Cinco de Cuatro, Michael sleeps for two whole days, after which he goes to break up with Rebel, only to encounter his son George-Michael, who punches him after discovering Michael knew George-Michael was dating the same woman. Michael then returns to the penthouse, while attempting to avoid Lucille 2, whom he does not know is missing. Michael is met by Lt. Toddler of the Newport Beach PD, who questions him about the whereabouts of Lucille, Lucille 2, and the red-haired woman from the penthouse the day prior (George Sr. in a wig). As a way to get back at his family, Michael schemes to get Buster, who is hiding after being named a suspect in Lucille 2's disappearance, declared a missing person. Meanwhile, George-Michael regrets punching Michael, and confides this in Maeby, who is trying to flee after being discovered as a (accidental) sex-offender, and Lucille persuades Tobias to break her out of Austerity with Lucille 2 missing, and the two flee to a beachside cottage.\n\n70 2 \"Self-Deportation\" Troy Miller Richard Day May 29, 2018 ( ) 5AJD02\n\nMaeby and George-Michael go down to Mexico, where Maeby joins a group of Mexican volunteers, while George-Michael joins a group of fellow University of California, Irvine students who are living in Mexico for an intensive language course. Michael, after getting Buster to agree to the scheme, attempts to flee to Mexico in the mapping car, but he is located by the search engine company he is driving for. Michael is taken back to the company's campus, where he begins to work and live. A month later, Michael returns to the model home for a scuba suit, where he finds a letter from Lucille 2, who has forgiven Michael's $700,000 debt. He goes to the penthouse, which he finds empty, but upon entering Lucille 2's penthouse to thank her, Michael finds Lucille, George Sr, Lindsay, Gob, Tobias, and Maeby all there.\n\n71 3 \"Everyone Gets Atrophy\" Troy Miller Mitchell Hurwitz May 29, 2018 ( ) 5AJD03\n\nMichael learns that Lindsay is running for Congress, filling Herbert Love's spot, with Lucille calling the family together so they can accept the Family of the Year award, which is awarded by the Austero-Bluth Company, in order to give Lindsay a boost in the polls. George-Michael returns to Newport Beach, where he is called by Maeby, who is working as Lindsay's campaign manager. Maeby explains that she has been trying to make Lindsay say offensive things to sabotage her campaign, but her efforts have backfired; she wants George-Michael and her to kiss to sabotage Lindsay's campaign further. Buster is arrested after being found by the police and being identified in the security footage on the night of Cinco de Cuatro.\n\n72 4 \"An Old Start\" Troy Miller Jim Vallely May 29, 2018 ( ) 5AJD04\n\nWith Lucille 2 not around, Gob is named president of the Austero-Bluth Company. George-Michael meets Maeby at a senior living community where she is squatting in a room owned by Lucille Austero for trysts with Stan Sitwell. They discuss George-Michael and Michael's ended relationships with Rebel and George-Michael's relationship with Michael. Michael returns to the family cottage where his wife died, finding Lucille there, learning that, contrary to Michael's belief, Lucille and George Sr. did not sell the cottage after his wife's death, per Michael's wishes.\n\n73 5 \"Sinking Feelings\" Troy Miller Jim Vallely & Mitchell Hurwitz May 29, 2018 ( ) 5AJD05\n\nThe Bluths prepare to receive their award in a ceremony by the Banana Stand, even though the Banana Stand is missing. George-Michael goes to break up with Rebel, but the circumstances prevent him from doing so. George-Michael catches Michael before Michael's scuba diving trip, and the two reconcile. The award ceremony goes awry, with Gob giving an awkward speech and Lindsay walking out after realizing Lucille does not truly care for her. George Sr. winds up in the ocean, but Michael and George-Michael save him. Michael discovers that Buster is in prison, revealing this and his scheme to Lucille and George Sr., after which Lucille punches Michael. Michael meets with Buster in jail, learning that Buster attempted to wipe the footage of him with Lucille's body from Cinco. Michael calls Barry Zuckerkorn, the family attorney, to pay off Buster's bail. Tobias reveals an actor the family had paid to actually be his bastard son, Murphy-Brown. At a welcome home party, the Bluths discover that Michael bailed out Barry, who was also in jail, and not Buster.\n\n74 6 \"Emotional Baggage\" Troy Miller Evan Mann & Gareth Reynolds May 29, 2018 ( ) 5AJD06\n\nGob attempts to get the rights to Buster back from Kitty, but is unable to do so. George-Michael is invited by Rebel to a Howard family barbecue, and has Maeby dye his hair pink to make a bad impression. However, the dye is left in too long, leaving his hair \"Howard Red\", making a strong impression on Ron. Michael sneaks into the barbecue to get the rights from Ron, but is also unable to do so. After learning from Bryce Dallas Howard that Rebel is using George-Michael, and after a conversation with Rance Howard about keeping an eye on your son, Michael allows the Bluth project to move forward as a streaming, true crime series. Ron sets up an interview with Buster, but after remembering a conversation with George Sr., Buster attacks Ron, believing him to be a skinhead.\n\n75 7 \"Rom-Traum\" Troy Miller Maggie Rowe May 29, 2018 ( ) 5ADJ07\n\nMichael theorizes that Lucille might know the location of Lucille 2, and he, Barry, and Buster plan to make her believe the district attorney is on to Lucille. This backfires, with Lucille, realizing the scheme. Barry shows Lucille the evidence picture of the stair car, and she tasks him with locating it. George Sr. leaves the cottage, with a suspicious Michael following him. George-Michael, who after a speculative comment from Maeby that Michael may have been with Rebel in Mexico during the two months she was shooting a movie, becomes suspicious of Michael and follows him. Barry also follows, in order to search for Lucille 2 with George Sr. Michael meets with George Sr., where they learn from Tobias, who was searching for Lindsay, that George's lack of sex drive was due to Lucille tricking him into taking estrogen pills. After seeing Lucille 2's car (which George-Michael drives, unbeknownst to Michael), Michael and Tobias chase after George-Michael, with George Sr. and Barry following behind. All three vehicles hit spike strips, after which the five in the vehicles are confronted by a group of cowboys, who now own the land due to Tobias, who was impersonating George Sr, signing ownership to them.\n\n76 8 \"Premature Independence\" Troy Miller Mitchell Hurwitz & Jim Vallely May 29, 2018 ( ) 5ADJ08\n\nOn the night of the Second of July Parade (a local holiday), Lindsay has yet to be found, a situation which Sally Sitwell, who has taken Lucille 2's place in the congressional race, tries to exploit. Michael discovers the evidence picture, which shows Lucille 2 and Oscar in the stair car. However, George-Michael discovers the picture, revealing it was actually him and Maeby in the picture, taken when they went down to Mexico earlier. At the parade, Michael shows the picture to Lottie Dottie, the district attorney. George-Michael then arrives to show Michael the picture, where Michael realizes his mistake. Gob and Tony Wonder perform on a float for a closet company, where they discuss their relationship; however, the conversation abruptly ends when Tony is suddenly and mysteriously cased into his closet on the float with cement. Tobias, unable to find Lindsay, enlists his old flame DeBrie to impersonate Lindsay. George Sr. arrives at the parade, telling Lucille that the cowboys now own the land. Lucille and George both recognize that this prevents their plan to build a wall across the Mexican-American Border and they need Lindsay to lose the election; luckily for Lucille, DeBrie, shy, hides under a sheet, which the public takes to be a show of anti-Muslim sentiments. Buster, who is in a parade float, is broken out by Oscar, who escapes in Sally's new stair car, despite the fact that Buster only has eight days left in prison.\n\nPart 2\n\n77 9 \"Unexpected Company\" Troy Miller Hallie Cantor March 15, 2019 ( ) 5AJD09\n\nBuster misses his own prison release party, revealing that he is on the run with Oscar. While searching for a new prosthetic hand, they meet Stan Sitwell in the hospital and take him hostage. Gob, distraught by the possible loss of Tony Wonder, worries that his homosexuality induced by the botched closet illusion will be permanent. As Rebel is now investing in the fake company Fakeblock, George-Michael asks for the help of paid protesters to dissuade her from visiting the headquarters. His plan is to hire members of Anonymous wearing Guy Fawkes masks but Gob thinks he is referring to \"foxy\" males. The protesters throw a party when Rebel arrives which increases her interest in the company. Meanwhile Michael, after learning that he is a co-president of the Bluth company, catches his father in a suicide attempt provoked by Lucille's relationship with a surfer named Dustin Radler. Looking at the financial records, Michael sees that Gob has purchased a 3D dental printer.\n\n78 10 \"Taste Makers\" Troy Miller Mitchell Hurwitz March 15, 2019 ( ) 5AJD10\n\nStan Sitwell takes Oscar and Buster to Lucille 2's apartment. They blow Maeby's cover prompting her to hit Stan over the head which hospitalizes him again. Michael tries to spend more time with George-Michael and discusses a \"gated community\" file that his parents had tried to 3D print. George-Michael seeks a clueless president to oversee the employees who still work for Fakeblock due to Maeby firing them in the wrong order. The president turns out to be Gob who receives a threat from the Gay Mafia led by Lucille 2's brother. The group tells Gob that, since he has started to live a gay life to preserve the magician's code, any attempt by him to end it before seven years will send a message that conversion therapy works. They task Gob with disposing of a body implied to be Tony Wonder's.\n\n79 11 \"Chain Migration\" Troy Miller Richard Day March 15, 2019 ( ) 5AJD11\n\nGeorge Sr. tries to impress Lucille by helping her search for Buster in the mall. Oscar and Buster arrive at the tent store where Tobias and his makeshift family are squatting only to find out that the chain holding them together has been unlocked the entire time. Now able to walk on his own, Oscar runs into his twin who tells him that he should keep pretending to be on a prison break with Buster so that Lucille can become happy with her marriage again. After the tent store closes, the Fünkes move in with Maeby while Oscar and Buster move into the model home. Gob tells Buster that their prison break is a sham but offers to let him keep bonding with Oscar if he disposes of a body bag. Meanwhile, Michael confronts George Sr. and Lucille about their \"gated community\" file being plans for a U.S. / Mexico border wall which they had promised to a Chinese company.\n\n80 12 \"Check Mates\" Troy Miller Evan Mann & Gareth Reynolds March 15, 2019 ( ) 5AJD12\n\nOscar and Buster confess that each has been trying to spend time with the other under false pretences. Oscar runs away when Buster tries to make him give up marijuana. George Sr. and Lucille meet the Chinese investors and tell them that their money is gone due to an accidental purchase of land owned by the Mexican Romney family. In exchange for their honesty, they receive $3 million which Dusty tells them is a loan to help them save face. Michael finds this money, laundered as coming from the banana stand, which he uses to buy Fakeblock thinking that it will rekindle his son's interest in the company. When it does the opposite, Gob arrives with Buster who is promptly re-arrested on suspicion of having dumped a body into the ocean.\n\n81 13 \"The Untethered Sole\" Troy Miller Chris Marrs March 15, 2019 ( ) 5AJD13\n\nThe Bluths meet at the police station where Buster is charged with first degree murder based on a video of him in the background of a weather report. Barry recommends an elite team of lawyers called the Guilty Guys. To help pay for them and placate the investors, Michael pretends that his purchase of Fakeblock was a commitment to build the wall by announcing a venture that combines border security with Internet security. Despite not being told about it, Gob crashes the groundbreaking ceremony and announces a much shorter completion timeline than Michael had intended. George-Michael fires his father after berating him for giving the company a contract it cannot possibly fulfill.\n\n82 14 \"Saving for Arraignment Day\" Troy Miller Hallie Cantor March 15, 2019 ( ) 5AJD14\n\nThe Guilty Guys find themselves out of their depth, with their entire operation designed to secure slightly shorter sentences in the event of a guilty plea. Barry reveals that the only lawyer known to have beaten Lottie Dottie is her ex-husband Dustin Radler. Lucille tells Dusty she is willing to leave George for him if he goes back to practising law. Dusty agrees to help but continues to sleep at his own home which Lucille learns is worth millions of dollars. Meanwhile, to create a distraction from the fake nature of Fakeblock, George-Michael arranges for Gob to give a magic show at the wall unveiling.\n\n83 15 \"Courting Disasters\" Troy Miller Mitchell Hurwitz & Jim Vallely March 15, 2019 ( ) 5AJD15\n\nGeorge and Lucille learn that the lawyer they hoped to get was the critically ill Dustin Radler Sr. and that the incompetent Dusty, who looks to Lucille as a maternal figure, is Lottie Dottie's stepson. At the model home, George-Michael tells Michael that he has been lying about dating Rebel and having a working Fakeblock product. Having kicked Maeby out of the senior's home shortly before being kicked out himself, Tobias meets George-Michael at the Fakeblock headquarters. Murphy Brown tells the group that he is a programmer who can finish the code. Back in the courtroom, Lottie Dottie convinces the jury that Buster has killed before by playing production footage of the Bluth crime series. The clip shows a reenactment of Buster pushing his grandmother down the stairs after hearing her state that one of the Bluth children is adopted.\n\n84 16 \"The Fallout\" Troy Miller Mitchell Hurwitz March 15, 2019 ( ) 5AJD16", "images": ["https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b5/Arrested_Development_Season_5.jpg/220px-Arrested_Development_Season_5.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/b/b5/Arrested_Development_Season_5.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/b/b5/Arrested_Development_Season_5.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Arrested_Development_(season_5)", "title": "Arrested Development (season 5)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/b/b5/Arrested_Development_Season_5.jpg", "width": 640, "height": 950}, "title": "Arrested Development (season 5) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}