{"url": "https://www.cinemablend.com/news/2402241/the-rock-and-jason-stathams-furious-spinoff-landed-the-perfect-director", "text": "Dwayne Johnson's Luke Hobbs and Jason Statham's Deckard Shaw were adversaries during Furious 7, and their feud continued into The Fate of the Furious, but as that latter movie chugged along, the two found themselves working together to bring down Charlize Theron's Cipher. Rather than keep their dynamic going in another of the main Fast and the Furious movies, Universal gave the green light to a spinoff movie starring Hobbs and Shaw, which is reportedly being called... well, Hobbs and Shaw, and now it's official: Deadpool 2 director David Leitch will helm that spinoff.\n\nIt was reported back in early February that David Leitch was in early talks to direct Hobbs and Shaw, and today EW confirmed that Leitch has officially signed on to the movie. David Leitch spent years in Hollywood as a stuntman/stunt coordinator, but he kicked off his directing career with 2014's John Wick, which he co-helmed with Chad Stahelski. Leitch followed up with Atomic Blonde and next month's Deadpool 2, making Hobbs and Shaw his fourth movie on his directorial resume. He will be working off a script written by Chris Morgan, who has penned all of the Fast and the Furious movies since 2006's Tokyo Drift.\n\nThe Fast and the Furious franchise has changed quite a bit since it launched in 2001, morphing into movies revolving around street races and heists to its protagonists now often working to save the world. But along with cars, one of the constants in this film series has been action, and with Dwayne Johnson and Jason Statham being the stars of Hobbs and Shaw, you need to double down on that particular element. Hiring David Leitch as director is a good step towards ensuring that happens, as he has plenty of experience with stunt-driven action both in front of and behind the camera. While it's reasonable to assume that driving/racing will still factor into this spinoff, given that Luke Hobbs and Deckard Shaw are two of the best fighters among the main Fast and the Furious characters, one would imagine that means there will be even more throwing down of fisticuffs compared to the main series entries.\n\nNo plot details for Hobbs and Shaw have been revealed yet, though as with the previous movies, you can count on the spinoff being packed with craziness. When we last saw these two in The Fate of the Furious, they were celebrating with Dom Toretto and the rest of the crew in having successfully Dom's kid and stopped Cipher's plans. However, Cipher eluded capture, so perhaps the spinoff will see Hobbs and Shaw tracking her down, though I suspect there isn't a shortage of other baddies for them to take on.\n\nHobbs and Shaw will race into theaters on July 26, 2019, and so far has no competition that opening weekend, though that will change eventually. Keep checking back with CinemaBlend for more updates about the Fast and the Furious spinoff and the franchise as a whole, and be sure to look through our 2018 release guide to learn what movies are coming out later this year.", "images": ["https://www.cinemablend.com/media/img/missing-image.svg", "https://cdn.mos.cms.futurecdn.net/HnEDtTHykMGZdHV7Eo24JE-1200-80.jpg", "https://cdn.mos.cms.futurecdn.net/HnEDtTHykMGZdHV7Eo24JE-320-80.jpg"], "top_img": "https://cdn.mos.cms.futurecdn.net/HnEDtTHykMGZdHV7Eo24JE-1200-80.jpg", "keywords": [], "authors": ["Adam Holmes", "Senior Content Producer", "Window.Slicecomponents", "Window.Reliabledomcontentloaded.Then", "Var Componentcontainer", "Document.Queryselector", "Slice-Container-Authorbio", "If Componentcontainer", "Var Data", "Layout"], "canonical_link": "https://www.cinemablend.com/news/2402241/the-rock-and-jason-stathams-furious-spinoff-landed-the-perfect-director", "title": "The Rock And Jason Statham's Furious Spinoff Landed The Perfect Director", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "pub_date": "2018-04-12T17:46:19+00:00", "description": "Racing into theaters next year, The Rock and Jason Statham's Fast and the Furious spinoff has officially landed its director.", "robots": "max-image-preview:large", "msapplication-TileColor": "#000000", "msapplication-TileImage": "https://cdn.mos.cms.futurecdn.net/flexiimages/tbhqzd9bso1619422461.png", "og": {"site_name": "CINEMABLEND", "image": {"identifier": "https://cdn.mos.cms.futurecdn.net/HnEDtTHykMGZdHV7Eo24JE-1200-80.jpg", "width": 1200}, "type": "article", "title": "The Rock And Jason Statham's Furious Spinoff Landed The Perfect Director", "url": "https://www.cinemablend.com/news/2402241/the-rock-and-jason-stathams-furious-spinoff-landed-the-perfect-director"}, "article": {"publisher": "https://www.facebook.com/cinemablendnews/", "published_time": "2018-04-12T17:46:19Z", "modified_time": "2022-09-15T15:45:31.186Z"}, "parsely-type": "post", "parsely-post-id": "rrcsXrfKBnz4QZ5yL77ND2", "parsely-pub-date": "2018-04-12T17:46:19Z", "parsely-title": "The Rock And Jason Statham's Furious Spinoff Landed The Perfect Director", "parsely-link": "https://www.cinemablend.com/news/2402241/the-rock-and-jason-stathams-furious-spinoff-landed-the-perfect-director", "parsely-image-url": "https://cdn.mos.cms.futurecdn.net/HnEDtTHykMGZdHV7Eo24JE.jpg", "parsely-section": "Movies", "parsely-tags": "Category: Movies,Category: News,the rock,Jason Statham,Dwayne Johnson,david leitch,the rock,Hobbs And Shaw,serversidehawk", "parsely-author": "Adam Holmes", "twitter": {"card": "summary_large_image", "site": "@cinemablend", "title": "The Rock And Jason Statham's Furious Spinoff Landed The Perfect Director", "creator": "@cinemablend", "image": "https://cdn.mos.cms.futurecdn.net/HnEDtTHykMGZdHV7Eo24JE-1200-80.jpg", "account_id": 9696142}, "google-site-verification": "Oo3uNFWgI6psN58Pjx7Zjo3yYih1rOwQViWbItBCpyo", "taboola": {"url": "https://www.cinemablend.com/news/2402241/the-rock-and-jason-stathams-furious-spinoff-landed-the-perfect-director"}, "botify-site-verification": "2pzcQZFibLjk9GJgSZgweA8MU9al6utA", "msvalidate.01": "CC462E6DF91492086145CA5EBDCB615E"}, "movies": [], "publish_date": 1523555179.0, "source": "https://www.cinemablend.com", "summary": ""}