{"url": "https://www.howardstern.com/show/2017/6/21/ashton-kutcher-gives-howard-his-side-story-how-he-and-mila-kunis-became-more-just-friends/", "text": "Photo: AP\n\nOn Wednesday’s Stern Show it was Ashton Kutcher’s turn to tell Howard how he met his now-wife Mila Kunis more than two decades ago and how the couple turned a friendship into a marriage. Back in July 2016, Mila told Howard she never found Ashton attractive while playing his girlfriend on their TV series “That ’70s Show.” But on Wednesday Ashton revealed she wasn’t telling the truth.\n\n“She’s lying,” Ashton said with a laugh. He explained a young Mila kept a diary back then and had written about her older on-camera boyfriend in a few of its pages.\n\n“She thought I was cute,” he continued. “At first I think she thought I was good-looking … shortly thereafter, I was just annoying to her because I was like, big brother.”\n\nScripts from the first season had a then 19-year-old Ashton kissing Mila who was only 14. “It was really weird. I was like, ‘Isn’t this illegal?'” Ashton said of having to lock lips with his underage co-star. “She was like my little sister.”\n\nThough the two played each other’s love interests for several years on television, Ashton and Mila never dated while working on “That ’70s Show.” After the series ended, they remained friends and kept in touch but as Ashton remembers, it wasn’t until he saw Mila several years later at an awards show that he felt a spark. However, since he had just split from actress Demi Moore, Ashton knew he wasn’t ready to get into a new relationship.\n\n“I was convinced I was gonna be the single guy. I was all about being the single guy,” he told Howard.\n\nAshton decided to try and set Mila up with one of his friends and planned on introducing them at a party he was throwing at his house. Mila showed up but the friend didn’t. And as the evening went on, it became clear that there was an attraction between Ashton and Mila.\n\n“It was pretty mutual. It was kind of obvious that things were happening,” Ashton said.\n\nHoward wondered who made the first move and while Ashton wasn’t sure who exactly kissed who first, he described how Mila was able to get a bit closer to him.\n\n“I was smoking cigarettes at the time,” Ashton explained. “And she had quit smoking.” Mila asked Ashton if he would “shotgun” a puff into her mouth, just so she could get a hint of smoke without actually having a cigarette. Ashton obliged.\n\n“Gradually, throughout the night, it got closer and closer and closer,” he went on about how he and Mila moved toward one another. She ended up spending the night and the two have been together ever since.\n\nLike Howard and Beth, Ashton and Mila are big fans of “The Bachelor” and “The Bachelorette” and even have a routine for watching the hit ABC reality series – he enjoys a vodka tonic while Mila drinks white wine. When contestants go on a one-on-one date together, Ashton revealed he and Mila will often mute the TV and guess at what’s being said.\n\n“We shut the sound off and like, we imitate what the conversation probably is,” Ashton said.\n\nEarlier this year, Ashton and Mila even guest starred on “The Bachelorette” and gave one of Rachel Lindsay’s suitors a “Hit ’em with the Hein” on national television.\n\nAs seven years have gone by since Ashton’s last visit to the Stern Show, Howard had to ask him what it was like joining the cast of “Two and a Half Men,” a move that surprised many in Hollywood.\n\n“Here’s the thing, I was shocked I took the role in ‘Two and a Half Men,'” Ashton told Howard. That he would even be interested in taking the role only became known due to a nonchalant comment he made while having lunch with his then agent as the two discussed what Charlie Sheen had been making off the CBS sitcom.\n\n“I turn to my agent and sort of flippantly said, ‘If they offered me that job for that kind of money I’d take it,'” Ashton recalled. It wasn’t long before Ashton received a phone call telling him the job was his if he wanted it, a decision he said he never saw coming.\n\n“It was a very, very, very nice payday,” Ashton said of his salary.\n\nThe show remained a success although Ashton said he never felt any pressure in keeping the sitcom’s ratings up. “It wasn’t gonna live or die on me,” Ashton told Howard, expressing that so long as the show could remain funny, it would remain a hit.\n\nIn addition to voicing criticism towards the series’ creator Chuck Lorre, “Two and a Half Men’s” former star Charlie Sheen took some shots at his replacement Ashton. “I didn’t really, like, take it to heart,” Ashton told Howard. Enough time has passed and he revealed there’s no animosity between him and Charlie.\n\n“Face to face he’s always been cool with me,” Ashton added.\n\nAshton is sticking to sitcoms, now starring in his Netflix comedy “The Ranch.” The series was Ashton’s answer to appealing to his fellow Midwesterners (he grew up in Iowa), a part of the country he says isn’t represented nearly enough on TV.\n\n“There really wasn’t anything that was servicing the middle of America,” he told Howard.\n\nGrowing up, Ashton was a big fan of the series “Roseanne” and its blue-collar characters. “For me, that was what I related to,” he said. “It made me feel like my family wasn’t alone in our struggles.”\n\nNow, he hopes his own series can achieve the same thing for those watching at home.\n\nPart 3 of “The Ranch” is streaming now on Netflix.", "images": ["https://www.howardstern.com/wp-content/themes/howardstern/assets/images/clipboard.svg", "https://www.howardstern.com/wp-content/themes/howardstern/assets/images/email.svg", "https://www.howardstern.com/wp-content/uploads/sites/3/2020/07/logo-white.png", "https://www.howardstern.com/wp-content/uploads/sites/3/2017/06/41112-ashton-kutcher-mila-kunis-062117-promo-315-getty.jpg", "https://www.howardstern.com/wp-content/uploads/sites/3/2020/06/logo.png", "https://www.howardstern.com/wp-content/themes/howardstern/assets/images/twitter.svg", "https://www.howardstern.com/wp-content/uploads/sites/3/2020/07/HS-Footer-Logos.png", "https://www.howardstern.com/wp-content/themes/howardstern/assets/images/reddit.svg", "https://www.howardstern.com/wp-content/uploads/sites/3/2017/06/41113-ashton-kutcher-mila-kunis-062117-header-700-ap.jpg?w=700", "https://www.howardstern.com/wp-content/themes/howardstern/assets/images/facebook.svg", "https://www.howardstern.com/wp-content/themes/howardstern/assets/images/instagram.svg"], "top_img": "https://www.howardstern.com/wp-content/uploads/sites/3/2017/06/41112-ashton-kutcher-mila-kunis-062117-promo-315-getty.jpg", "keywords": [], "authors": ["Ryan O'Connell"], "canonical_link": "https://www.howardstern.com/show/2017/06/21/ashton-kutcher-gives-howard-his-side-story-how-he-and-mila-kunis-became-more-just-friends/", "title": "Ashton Kutcher Gives Howard His Side of the Story on How He and Mila Kunis Became More Than Just Friends", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Actor also talks taking over for Charlie Sheen on \"Two and a Half Men\" and the money he made from the sitcom", "og": {"locale": "en_US", "type": "article", "title": "Ashton Kutcher Gives Howard His Side of the Story on How He and Mila Kunis Became More Than Just Friends | Howard Stern", "description": "Actor also talks taking over for Charlie Sheen on \"Two and a Half Men\" and the money he made from the sitcom", "url": "https://www.howardstern.com/show/2017/06/21/ashton-kutcher-gives-howard-his-side-story-how-he-and-mila-kunis-became-more-just-friends/", "site_name": "Howard Stern", "image": {"identifier": "https://www.howardstern.com/wp-content/uploads/sites/3/2017/06/41112-ashton-kutcher-mila-kunis-062117-promo-315-getty.jpg", "width": 315, "height": 400, "type": "image/jpeg"}}, "article": {"publisher": "https://www.facebook.com/thehowardsternshow/", "published_time": "2017-06-21T19:44:26+00:00", "modified_time": "2020-06-25T11:03:27+00:00"}, "twitter": {"card": "summary_large_image", "creator": "@sternshow", "site": "@sternshow", "label1": "Written by", "data1": "Ryan O'Connell", "label2": "Est. reading time", "data2": "5 minutes"}, "generator": "WordPress 6.0.2", "parsely-title": "Ashton Kutcher Gives Howard His Side of the Story on How He and Mila Kunis Became More Than Just Friends", "parsely-link": "http://www.howardstern.com/show/2017/06/21/ashton-kutcher-gives-howard-his-side-story-how-he-and-mila-kunis-became-more-just-friends/", "parsely-type": "post", "parsely-image-url": "https://www.howardstern.com/wp-content/uploads/sites/3/2017/06/41112-ashton-kutcher-mila-kunis-062117-promo-315-getty.jpg?w=150&h=150&crop=1", "parsely-pub-date": "2017-06-21T19:44:26Z", "parsely-section": "News", "parsely-tags": "ashton kutcher,charlie sheen,mila kunis", "parsely-author": "Ryan O'Connell", "msapplication-TileImage": "https://www.howardstern.com/wp-content/uploads/sites/3/2020/06/favicon.png?w=180"}, "movies": [], "publish_date": 1497999600.0, "source": "https://www.howardstern.com", "summary": ""}