{"url": "https://www.hollywoodreporter.com/news/ed-westwick-accused-rape-actor-denies-claim-1055474", "text": "Actress Kristina Cohen has accused Gossip Girl actor Ed Westwick of rape. The television star has denied the claim, saying that he does not know the accuser.\n\nCohen — who posted the claim on Facebook with details of her emotional state over the past month during the flood of sexual misconduct stories in Hollywood (she called the outpouring “both triggering and emotionally exhausting”) — alleges that Westwick sexually assaulted her three years ago, in February 2014, during “a dark time in my life.” Her mother was sick with cancer (she died three months after the alleged assault) and she did not have the support system to deal with “the aftermath of the rape.”\n\nReached by The Hollywood Reporter on Monday night, Cohen detailed the claims she made in her Facebook post. Her sister, Catalina Colgate, and close friend, Blaise Godbe Lipman, separately corroborated that they were told of Cohen’s account three years ago, when the sexual assault was alleged to have taken place.\n\nWestwick responded in a statement on Instagram that read, “I do not know this woman. I have never forced myself in any manner, on any woman. I certainly have never committed rape.”\n\nThe incident allegedly occurred at Westwick’s home in the Hollywood Hills. Cohen said she had been invited to the actor’s home by a producer named Kaine Harling, a man she had briefly dated in 2013. The evening took a turn, she claims, when “Ed suggested ‘we should all fuck.'” Despite wanting to leave, Cohen said she was encouraged to stay for another 20 minutes by Harling “to smooth everything over” while Westwick suggested she nap in a guest bedroom.\n\nAfter falling asleep, Cohen alleges that she woke up to Westwick assaulting her.\n\n“I was woken up abruptly by Ed on top of me, his fingers entering my body. I told him to stop, but he was strong. I fought him off as hard as I could but he grabbed my face in his hands, shaking me, telling me he wanted to fuck me,” Cohen alleges. “I was paralyzed, terrified. I couldn’t speak, I could no longer move. He held me down and raped me.”\n\nShocked and confused, Cohen said she ended up leaving the next morning. “I was so lost and needed someone to pull me out of there,” she told THR, adding that Harling had left earlier in the night.\n\nCohen told her friend Lipman of the encounter and also spoke with Harling, whom she claims blamed her for what happened. She added that Harling told her “I can’t say anything because Ed will have people come after me, destroy me, and that I could forget about an acting career. Saying there’s no way I can go around saying Ed ‘raped’ me and that I don’t want to be ‘that girl.'”\n\nCohen continued that she now realizes “the ways in which these men in power prey on women, and how this tactic is used so frequently in our industry, and surely, in many others.” THR reached out to Harling for comment, but he has yet to respond.\n\nSeeing the flood of stories about everyone from Harvey Weinstein and James Toback to Kevin Spacey and Brett Ratner inspired Cohen to share her story of the alleged incident. Cohen, who is from Atlanta, is an actress, writer and producer whose credits include the series Ladies Like Us and the upcoming film Earthwalkers.\n\n“There is a bigger picture to this — cleaning out the system and creating radical change,” Cohen told THR. “I think that’s what I’m contributing to. That’s the big motivator for having this go out and putting it out there. … I believe in the message of restoration. This will only make us stronger.”\n\nTHR has reached out to Westwick for additional comment, as well as to Cohen for a response to Westwick’s assertion.", "images": ["https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/gettyimages-624122282-h_2017.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/gettyimages-624122282-h_2017.jpg?w=1296&h=730&crop=1", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/gettyimages-624122282-h_2017.jpg?w=1024", "keywords": [], "authors": ["Chris Gardner"], "canonical_link": "https://www.hollywoodreporter.com/news/general-news/ed-westwick-accused-rape-actor-denies-claim-1055474/", "title": "‘Gossip Girl’ Star Ed Westwick Accused of Rape, Actor Denies Claim", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Actress Kristina Cohen claims the sexual assault occurred in February 2014.", "news_keywords": "autoplay", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Chris Gardner", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1055474, "title": "'Gossip Girl' Star Ed Westwick Accused of Rape, Actor Denies Claim", "published_at": "2017-11-07 10:50:08", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/gettyimages-624122282-h_2017.jpg?w=1024", "comment_count": 0, "tags": "autoplay", "topics": "News", "body": "Actress Kristina Cohen has accused Gossip Girl actor Ed Westwick of rape. The television star has denied the claim, saying that he does not know the accuser. \r\nCohen — who posted the claim on Facebook with details of her emotional state over the past month during the flood of sexual misconduct stories in Hollywood (she called the outpouring \"both triggering and emotionally exhausting\") — alleges that Westwick sexually assaulted her three years ago, in February 2014, during \"a dark time in my life.\" Her mother was sick with cancer (she died three months after the alleged assault) and she did not have the support system to deal with \"the aftermath of the rape.\" \r\nReached by The Hollywood Reporter on Monday night, Cohen detailed the claims she made in her Facebook post. Her sister, Catalina Colgate, and close friend, Blaise Godbe Lipman, separately corroborated that they were told of Cohen's account three years ago, when the sexual assault was alleged to have taken place.\r\nWestwick responded in a statement on Instagram that read, \"I do not know this woman. I have never forced myself in any manner, on any woman. I certainly have never committed rape.\" \r\nThe incident allegedly occurred at Westwick's home in the Hollywood Hills. Cohen said she had been invited to the actor's home by a producer named Kaine Harling, a man she had briefly dated in 2013. The evening took a turn, she claims, when \"Ed suggested 'we should all fuck.'\" Despite wanting to leave, Cohen said she was encouraged to stay for another 20 minutes by Harling \"to smooth everything over\" while Westwick suggested she nap in a guest bedroom.\r\nAfter falling asleep, Cohen alleges that she woke up to Westwick assaulting her. \r\n\"I was woken up abruptly by Ed on top of me, his fingers entering my body. I told him to stop, but he was strong. I fought him off as hard as I could but he grabbed my face in his hands, shaking me, telling me he wanted to fuck me,\" Cohen alleges. \"I was paralyzed, terrified. I couldn’t speak, I could no longer move. He held me down and raped me.\"\r\nShocked and confused, Cohen said she ended up leaving the next morning. \"I was so lost and needed someone to pull me out of there,\" she told THR, adding that Harling had left earlier in the night. \r\nCohen told her friend Lipman of the encounter and also spoke with Harling, whom she claims blamed her for what happened. She added that Harling told her \"I can’t say anything because Ed will have people come after me, destroy me, and that I could forget about an acting career. Saying there’s no way I can go around saying Ed 'raped' me and that I don’t want to be 'that girl.'\"\r\nCohen continued that she now realizes \"the ways in which these men in power prey on women, and how this tactic is used so frequently in our industry, and surely, in many others.\" THR reached out to Harling for comment, but he has yet to respond.\r\nSeeing the flood of stories about everyone from Harvey Weinstein and James Toback to Kevin Spacey and Brett Ratner inspired Cohen to share her story of the alleged incident. Cohen, who is from Atlanta, is an actress, writer and producer whose credits include the series Ladies Like Us and the upcoming film Earthwalkers.\r\n\"There is a bigger picture to this — cleaning out the system and creating radical change,\" Cohen told THR. \"I think that's what I'm contributing to. That's the big motivator for having this go out and putting it out there. ... I believe in the message of restoration. This will only make us stronger.\"\r\nTHR has reached out to Westwick for additional comment, as well as to Cohen for a response to Westwick's assertion.\r\n\r\n\t\r\n\t\tThe last month has been incredibly difficult. Like so many women I too have a story of sexual assault, and the...\r\n\t\tPosted by Kristina Cohen on Monday, November 6, 2017", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Gossip Girl’ Star Ed Westwick Accused of Rape, Actor Denies Claim", "url": "https://www.hollywoodreporter.com/news/general-news/ed-westwick-accused-rape-actor-denies-claim-1055474/", "description": "Actress Kristina Cohen claims the sexual assault occurred in February 2014.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/gettyimages-624122282-h_2017.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-11-07T10:50:08+00:00", "modified_time": "2017-11-07T17:02:09+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Gossip Girl’ Star Ed Westwick Accused of Rape, Actor Denies Claim", "description": "Actress Kristina Cohen claims the sexual assault occurred in February 2014.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/gettyimages-624122282-h_2017.jpg?w=1296"}}, "movies": [], "publish_date": 1510051808.0, "source": "https://www.hollywoodreporter.com", "summary": ""}