{"url": "en.wikipedia.org/wiki/Barack_Obama_Day", "text": "For the Kenyan holiday, see Obama Day\n\nBarack Obama Day President Obama Observed by Illinois Type Statewide Date August 4 Frequency Annual\n\nBarack Obama Day refers to two days of recognition in the United States in honor of Barack Obama, who served as the 44th President of the United States from 2009 to 2017.\n\nObama was a member of the Illinois Senate from 1997 to 2004 and represented the state in the United States Senate from 2005 to 2008 before becoming president. Illinois celebrates the day on August 4 of each year. Similar to other commemorative holidays, it is not a legal state holiday, i.e. workplaces are not closed on the day.[1]\n\nPerry County, Alabama, has celebrated the second Monday of November as Barack Obama Day since 2009.[2] County offices and schools are closed for the holiday.[3]\n\nTwitter users unofficially celebrated Obama Day on June 14, 2020, posting pictures of the former president, with some using the hashtag #AllBirthdaysMatter in response to All Lives Matter. June 14 is also Donald Trump's birthday.[4]\n\nHistory [ edit ]\n\nAlabama [ edit ]\n\nThe Perry County Commission approved a resolution sponsored by commissioner Albert Turner, Jr. to establish Barack Obama Day by a vote four-to-one in 2008.[5] The holiday was observed starting in 2009.[2]\n\nIllinois [ edit ]\n\nIn 2017, Illinois State Representatives André Thapedi and Sonya Harper introduced a bill to designate Barack Obama Day as a state holiday. The original measure would have closed schools and state offices for the day. It was rejected by the House in March 2017, citing expense and the lack of a holiday for other presidents from Illinois such as Ronald Reagan.[6]\n\nThat same year, State Senator Emil Jones III and others introduced Illinois Senate Bill 55, which designated August 4 as Barack Obama Day but did not make it an official state holiday. The bill passed both houses of the Illinois General Assembly with no votes against, and was signed into law by Illinois Governor Bruce Rauner on August 4, 2017.[7] The bill amended the State Commemorative Dates Act to include a new section:\n\nBarack Obama Day. August 4th of each year is designated as Barack Obama Day, to be observed throughout the State as a day set apart to honor the 44th President of the United States of America who began his career serving the People of Illinois in both the Illinois State Senate and the United States Senate, and dedicated his life to protecting the rights of Americans and building bridges across communities.[8]\n\nLegislative history [ edit ]\n\nOther recognition days [ edit ]\n\nSince the United States presidential election of 2008, Obama Day is celebrated annually on November 6 in Kenya, the country from which President Obama's father originated.[9][[[Obama Day#{{{section}}}|contradictory]]]", "images": ["http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Official_portrait_of_Barack_Obama.jpg/225px-Official_portrait_of_Barack_Obama.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Official_portrait_of_Barack_Obama.jpg/1200px-Official_portrait_of_Barack_Obama.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Seal_of_the_President_of_the_United_States.svg/100px-Seal_of_the_President_of_the_United_States.svg.png", "http://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/23px-Flag_of_the_United_States.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/55/President_Barack_Obama%2C_2012_portrait_crop.jpg/100px-President_Barack_Obama%2C_2012_portrait_crop.jpg", "http://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Official_portrait_of_Barack_Obama.jpg/1200px-Official_portrait_of_Barack_Obama.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Barack_Obama_Day", "title": "Barack Obama Day", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Official_portrait_of_Barack_Obama.jpg/640px-Official_portrait_of_Barack_Obama.jpg", "width": 640, "height": 871}, "title": "Barack Obama Day - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}