{"url": "https://hellogiggles.com/news/riverdale-lili-reinhart-and-camila-mendes-on-beauty-and-jcpenny-prom-campaign/", "text": "Each product we feature has been independently selected and reviewed by our editorial team. If you make a purchase using the links included, we may earn commission.\n\nRiverdale stars Lili Reinhart and Camila Mendes are real-life BFFs, and right now the duo is proving to be a force in the beauty and fashion world. Not only are they the new faces of Bongo Jeans, share magazine covers, and are killing us with cuteness on Instagram, but the actresses have recently teamed up with JCPenney for its 2018 prom campaign.\n\nSince Camila and Lili both have very different styles, they each put their unique spin on the shoot by styling and creative directing. The Riverdale stars worked with the YMCA to help teens get dolled up and prepped for prom. Luckily for us, we don’t have to wait to see the ensembles the actresses put together. JCPenney’s new prom collection is already here, so you can take a peek at the pieces that speak to your own personal style.\n\nCamila and Lili spoke to HelloGiggles about why it was so important for them to be part of this shoot, the one brow product they’re *both* obsessed with, and the beauty tips they borrow from each other.\n\nHelloGiggles: What beauty tips have you learned from each other?\n\nLili Reinhart: I specifically deal with cystic acne, whereas Camila has otherwise perfect, poreless skin. I couldn’t really take too much away from her beauty routine because she and I are different when it comes to our skin. But I think Cammie and I are both very minimalistic when it comes to our makeup in the real world. We very much wear minimal makeup when we go out to dinner or when we’re not working. We let our skin breathe as much as possible. I know I do. My skin breaks out a lot from wearing makeup for up to 14 hours a day, five to six days a week. I love to be bare-faced and let my skin breathe. And if anything, I just cover up any zits with concealer and then fill in my brows. Lately, I’ve used my Glossier Boy Brow.\n\nCamila Mendes: I’ve learned a lot. Lili’s like a skin expert. So I’ve learned from how much she takes care of her skin. I used to not really have an intense skin regimen. I would just wash my face and go to sleep. My skin wasn’t very problematic, but now that I’m constantly wearing loads and loads of makeup on a daily basis, I see how much Lili takes care of her skin and she has all these different products. She got me hooked on getting facials by Kate Somerville and the drying lotion Mario Badescu.\n\nHG: What’s the most surprising thing about your skin care routine?\n\nLR: I’ve been really trying to change things up to more advanced skin care, more clinical-grade. My skin’s very high maintenance. I break out at the smallest environmental change, anytime I’m slightly stressed, or have lack of sleep. And it causes me to have to change up my skin care routine pretty frequently, and recycle products and see what works at the time, but I’ve always been a supporter of Kate Somerville skin care products. And lately, I’ve been trying ZO Skin Care. That’s pretty clinical-grade for my acne, and they have a really wonderful environmental shield. That, to me, seems to really help with the fact that I live in Vancouver, and the weather is very rainy, cloudy, and dreary. I also love masks. Every night I use a different mask, and I use a lot of Renee Rouleau. She specializes in cystic acne, and I use a lot of her products as well. I’m a skin care junkie and have a little bit of everything.\n\nCM: It’s just gotten so complex. I never thought I would be using toner. I used to not know what toner was, and now I have to use toner before I put anything on my face. I feel like everyone I talk to who’s an expert in skin, they’re like, “Oh my god, toner is the best thing to do because it just balances your PH.” I feel that brings out the most natural healing element to your skin. I have such a strict regimen now. I always wash my face before going to sleep and I do my whole routine. Put on the spot treatment and go to sleep.\n\nHG: What are some under $10 beauty products you swear by?\n\nLR: I’ve talked about it before. It’s the Aztec Indian Healing Clay Mask. I use Carmex chapstick for my lips. My lips get really irritated and dry, especially in this weather, so I use Carmex on set. Neutrogena’s oil blotters are my favorite thing. I have combination skin, so it’s oily and dry, but I’m a big oil-blotter kind of girl. I use the Mario Badescu’s Rose Water spray mist. I use that all the time, and I just use rose water in general for my face as a toner and that stuff’s the best. I dampen my BeautyBlender on set with rose water before I apply my foundation.\n\nCM: I’m a big Burt’s Bees fan. I use so much Burt’s Bees. I’m literally looking at all my Burt’s Bees products right now. I have a Burt’s Bees Facial Cleanser for Sensitive Skin. I have Burt’s Bees Eye Makeup Remover Pads, Burt’s Bees Rosewater Toner, Burt’s Bees Sensitive Daily Moisturizing Cream and then Burt’s Bees Facial Cleansing Towelettes. I should sponsor Burt’s Bees. It’s funny, my makeup artist jokes with me. She’s like, “You love Burt’s Bees,” but it’s funny because I hate bees. I’m terrified of bees. It’s a pretty known thing on set, yet I use entirely bee products.\n\nHG: For Camila, let’s talk brows. What brow products do you personally use?\n\nCM: I’ve had arched eyebrows since forever. Even when you see pictures of me when I was a little kid, my eyebrows were so strong. I had a unibrow too. I’ve always had a lot of hair on my brows. Then, I went through a phase where I was plucking them a lot in junior high because I thought that I was going to be prettier if they were thinner. But now, everyone’s embracing the fuller brow and I’ve just let them grow out. I like to shape them myself, I just kind of pluck around it. I mostly only pluck in the middle because I like to keep it as full as possible. I don’t really touch them too often. I just brush them out and I’ll fill them in a little bit. I use a Chanel brow pencil that’s really nice and I use a clear mascara to keep them in place because they’re wild. If I don’t put gel on them, they’ll go all sorts of places. I like the CoverGirl clear mascara. It’s quick and it does the job. Boy Brow from Glossier is great, too. I like using it when I’m not wearing much makeup and don’t want to fill in my brows.\n\nHG: Why was it important to y’all to team up with JCPenney on this campaign?\n\nLR: It was the charitable aspect of it. The idea that we were being involved in a program that was helping these teens, who otherwise, wouldn’t have had an opportunity to have a really wonderful prom outfit. You know? And JC Penney is so affordable and this kind of gave teens an opportunity to go to a photo shoot and get glammed up. And I thought that was such a cool idea, and immediately something that I wanted to be part of. I never went to prom, I never had a chance to go to prom. I had to switch to online school when I was a junior in high school because I moved across the country and didn’t want to go to a new school when I was a junior, so I didn’t get to go to prom. So, it was kind of like a really nice opportunity for me to help other people in their experience because I didn’t have my own. I was blown away by their aspirations and where they want to go to college and what they wanted to do.\n\nCM: What drew me to it the most was the message behind it. Me and Lili talked about it and we were like, “This is so great that we get to meet these girls who have not only watched our show but are very ambitious, young women and men, too.” We got to talk to them, got to know them, and kind of made them feel empowered and tried to inspire them, even though honestly, they were already such inspiring people. Everyone had such big goals and they were all getting into great schools and it honestly inspired me and Lili more so than we inspired them probably. So that was the best feeling. Kind of helping them realize their dream prom look that they might not have been able to afford otherwise. When you’re a teenager you’re kind of at this critical point in your life where you’re discovering yourself and experimenting with different looks and trying to figure out what works for you. So to be a part of that process for them and helping them guide themselves in a way. I was very grateful to be in that experience.\n\nHG: I’m sure it was nice for them to get dolled up for a day and do something they normally wouldn’t.\n\nLR: Yeah, totally, it gave them a chance to do something that they otherwise never would have been able to do, and just kind of experiencing the spotlight for a second. I think a lot of them had to step out of their comfort zones for sure, but it was so fun to see them do that and to be pampered for a day.\n\nHG: Camila, did you go to prom?\n\nCM: I did, and I found my dress at a thrift store. After a week of looking at department stores and not finding the right one…You what’s funny actually? Now, that I remember it, I did buy a dress. I bought a dress and I took it home, and then the next day, I went to the thrift store and found another dress and I ended up wearing that one. I ended up wearing the $50 dress instead of the $400 dress that I bought.\n\nHG: For Lili, would you go as dark Betty to prom?\n\nLR: My style, I’m still trying to figure out what that is, but I feel like I’m very into classical, Hollywood shapes and looks. I’m always attracted to black dresses. They’re very slimming, classic, and timeless. I probably would stick to an old Hollywood vibe for prom if I went to prom right now. That’s just something I’d love to do. I’ve never really been a ball gown type of girl, but I’m sure some people would love to go all out and do that for their prom. But I think I’m more minimalistic.\n\nHG: Was there a prom dress in a movie or show that you always wanted?\n\nLR: When you said that, a dress from The Devil Wears Prada popped in my head. I think it’s one of the dresses that Anne Hathaway wears in Paris. Maybe it’s one of the black dress that she wears when she’s at an event with Miranda Priestly and Emily. I can’t give you anything more specific than that, but I know it’s a dress that Anne Hathaway wears in Devil Wears Prada when she’s at an event.\n\nCM: I don’t remember any prom looks from shows that I watched. Because I really was into teen dramas as a teen. I loved the OC and Gossip Girl, but I can’t remember any of the prom dresses. But they had events all the time.", "images": ["https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/jojo-siwa-1.jpg?quality=82&strip=all&w=183&h=133&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2018/02/06/camilili.jpg?quality=82&strip=1&resize=640%2C360", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Taylor-Swift.jpg?quality=82&strip=all&w=183&h=133&crop=1", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' width='198' height='178'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20width='600'%20height='745'%3E%3C/svg%3E", "https://hellogiggles.com/wp-content/uploads/sites/7/2018/02/06/jcpennystyle.jpg", "https://hellogiggles.com/wp-content/uploads/sites/7/2018/02/06/betty.jpg", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Serena-Williams-Olympia.jpg?quality=82&strip=all&w=198&h=178&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2018/02/06/camila.jpg", "https://hellogiggles.com/wp-content/uploads/sites/7/2018/02/06/camilalili.jpg", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Taylor-Swift.jpg?quality=82&strip=all&w=198&h=178&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2018/02/06/lili-2000.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20width='1000'%20height='1235'%3E%3C/svg%3E", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Woman-Reading-Outside.jpg?quality=82&strip=all&w=183&h=133&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/easy-fall-cocktails-1.jpg?quality=82&strip=all&w=183&h=133&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Zooey-Deschanel.jpg?quality=82&strip=all&w=198&h=178&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2018/02/06/riverdale.jpg", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/happy-woman-smiling-fall-leaves-1.jpg?quality=82&strip=all&w=198&h=178&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Dog-Halloween-Costume.jpg?quality=82&strip=all&w=183&h=133&crop=1", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' width='183' height='133'%3E%3C/svg%3E", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Serena-Williams-Olympia.jpg?quality=82&strip=all&w=183&h=133&crop=1", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20width='1000'%20height='806'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20width='2000'%20height='1936'%3E%3C/svg%3E", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/happy-woman-smiling-fall-leaves-1.jpg?quality=82&strip=all&w=183&h=133&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/jojo-siwa-1.jpg?quality=82&strip=all&w=198&h=178&crop=1", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20width='900'%20height='600'%3E%3C/svg%3E", "https://hellogiggles.com/wp-content/uploads/sites/7/2018/02/06/camilili.jpg?quality=82&strip=all", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/easy-fall-cocktails-1.jpg?quality=82&strip=all&w=198&h=178&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Woman-Reading-Outside.jpg?quality=82&strip=all&w=198&h=178&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Dog-Halloween-Costume.jpg?quality=82&strip=all&w=198&h=178&crop=1", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20width='1000'%20height='666'%3E%3C/svg%3E", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Zooey-Deschanel.jpg?quality=82&strip=all&w=183&h=133&crop=1"], "top_img": "https://hellogiggles.com/wp-content/uploads/sites/7/2018/02/06/camilili.jpg?quality=82&strip=all", "keywords": [], "authors": ["Alyssa Morin"], "canonical_link": "https://hellogiggles.com/riverdale-lili-reinhart-and-camila-mendes-on-beauty-and-jcpenny-prom-campaign/", "title": "\"Riverdale\" Lili Reinhart and Camila Mendes talk JcPenney prom campaign and fave beauty products", "meta_data": {"viewport": "width=device-width", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "\"Riverdale\" stars, Lili Reinhart and Camila Mendes, talk to us about their fave Glossier makeup product, working with JCPenney's prom campaign, and more.", "og": {"locale": "en_US", "type": "article", "title": "\"Riverdale\" Lili Reinhart and Camila Mendes talk JcPenney prom campaign and fave beauty products", "description": "\"Riverdale\" stars, Lili Reinhart and Camila Mendes, talk to us about their fave Glossier makeup product, working with JCPenney's prom campaign, and more.", "url": "https://hellogiggles.com/riverdale-lili-reinhart-and-camila-mendes-on-beauty-and-jcpenny-prom-campaign/", "site_name": "HelloGiggles", "image": {"identifier": "https://hellogiggles.com/wp-content/uploads/sites/7/2018/02/06/camilili.jpg?quality=82&strip=all", "width": 900, "height": 819, "type": "image/jpeg"}}, "article": {"published_time": "2018-02-06T19:46:03+00:00", "modified_time": "2022-09-17T13:05:48+00:00"}, "author": "alyssa morin", "twitter": {"card": "summary_large_image", "label1": "Written by", "data1": "alyssa morin", "label2": "Est. reading time", "data2": "10 minutes"}, "msapplication-TileColor": "#b58c2c", "msapplication-TileImage": "https://hellogiggles.com/wp-content/themes/hello-giggles/favicon/ms-icon-144x144.png", "msapplication-config": "https://hellogiggles.com/wp-content/themes/hello-giggles/favicon/browserconfig.xml", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1517946363.0, "source": "https://hellogiggles.com", "summary": ""}