{"url": "https://www.hollywoodreporter.com/live-feed/how-get-away-murder-season-4-spoilers-pete-nowalk-interview-1033575", "text": "When How to Get Away With Murder returns for its fourth season in the fall on ABC, the law student acolytes of Annalise Keating (Viola Davis) will, against all odds, be halfway through their second year of law school. Remember, these 20-somethings are responsible for covering up multiple murders.\n\n“We are gonna jump a little bit in time so everyone can start in a more restful, low-key place,” creator Peter Nowalk tells The Hollywood Reporter ahead of the show’s late-September premiere. “We’ll be starting at the beginning of their second semester of their second year in law school. They’re halfway done. It’s their winter semester.”\n\nBut unlike in previous years, there’s no big, life-changing event that starts off the season.\n\n“Everyone’s more in a normal place, probably how most of us live our lives without murders happening all the time. It’s really nice just to be eased into where they are.”\n\nThere is, however, a big question that will be introduced in the season premiere.\n\n“That’s how I always start the writers each year,” Nowalk says. “What is our Who is under the sheet? Who killed Sam? Who shot Annalise? This year, the question is not a ‘who,’ it’s a ‘where.’ It’s very different than the other seasons, which is why I love it, but it’s still a really great mystery.”\n\nMake no mistake, Nowalk says — the reveal of said question will still be a major moment in the episode.\n\n“It’s still a crazyballs, roller-coaster, what-the-fuck-happened mystery. We’ll find out that question — in fact, one of the characters will even say it by the end of the first episode.”\n\nWhen the Shondaland series picks up, the answers to many questions left hanging in the season three finale will be answered.\n\n“Asher and Michaela are going to be living together, Laurel will have made a decision about whether or not to have the baby and Annalise will really have had time to breathe and say, ‘OK, what do I want my life to look like now that I am disgraced and starting at rock bottom? How can I build my life back from that?'”\n\nLaurel’s storyline in particular will see major repercussions from the events of the finale, when the audience learned that it was Laurel’s childhood friend, under orders from her father, who killed Wes (Alfred Enoch).\n\n“We have to start the season wondering does Laurel have any idea that her dad basically killed Wes, and what is she going to do about that if she does? Wes was the heart of the show, and now he’s dead. I think someone has to work to still solve his murder, because it’s unsolved. Annalise feels like that’s just what they have to live with, but I don’t think Laurel wants to give up on that answer yet.”\n\nPlus, the audience will find out what Connor (Jack Fallahee) said to Oliver’s (Conrad Ricamora) proposal.\n\n“The proposal is on the table, and we’ll see them talk about it in a way that I find is kind of fun and unexpected in our premiere, and will come to a mutual decision about what to do,” Nowalk says. “I will say their relationship is just getting deeper, and what’s really fun is for them to each be finding out things they didn’t know about each other, as well as the audience is finding that out. For example, we’re gonna meet one of Connor’s parents, and Oliver will meet one of those parents.”\n\nAnd then there’s Annalise, whose murder charges were dropped but whose reputation was seriously harmed by the allegations. How will she interact with her former students now that she’s no longer teaching — and after pinning Rebecca’s and Sam’s deaths on their dead BFF?\n\n“That is a great question,” he comments. “We’re gonna answer it in the premiere. Does she want them in her life anymore? Does she still think that they all have to band together to protect each other? Or does she feel like it’s time they all go their separate ways? There will be a major decision about that and a major shift in the show in the premiere.”\n\nContinues Nowalk, “When Annalise takes on her first client, you’ll see it’s someone from her past that really works into her emotional story of looking for redemption. All of the clients so far are people that either we know or that are cases that are gonna get her further in her redemption journey.”\n\nAnnalise’s storyline will provide plenty of opportunities for Davis to show off her Oscar-winning chops.\n\n“The best part and also the scariest part about getting to write for Viola is she can do anything. The challenge for me and the writers is always to give her new things to play. I think we’re doing that,” Nowalk says. “We are introducing this Jimmy Smits character, whom she has to interact with a lot. I don’t want to say what his character is, but they have some amazing scenes together that are using all of Viola’s talents and craft to the best of our ability. With every season, it’s like, ‘Oh my God, are we giving Viola enough to do, or are we taking advantage of this gift we’ve been given?’ I think, so far, we’re doing a pretty good job.”\n\nHow to Get Away With Murder returns Thursday, Sept. 28 on ABC.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/03/how_to_get_away_with_murder_go_cry_somewhere_else.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/145766_0444_-_h_2017_0.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/145766_0444_-_h_2017_0.jpg?w=1024", "keywords": [], "authors": ["Jean Bentley"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/how-get-away-murder-season-4-spoilers-pete-nowalk-interview-1033575/", "title": "‘How to Get Away With Murder’: Inside the Road to “Redemption” in Season 4", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The big question of season four is not a \"who\" but a \"where,\" says creator Peter Nowalk.", "news_keywords": "Fall TV Preview, How to Get Away With Murder, Pete Nowalk", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Jean Bentley", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1033575, "title": "'How to Get Away With Murder': Inside the Road to \"Redemption\" in Season 4", "published_at": "2017-08-31 08:35:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/145766_0444_-_h_2017_0.jpg?w=1024", "comment_count": 0, "tags": "Pete Nowalk", "topics": "TV News", "body": "When How to Get Away With Murder returns for its fourth season in the fall on ABC, the law student acolytes of Annalise Keating (Viola Davis) will, against all odds, be halfway through their second year of law school. Remember, these 20-somethings are responsible for covering up multiple murders.\r\n\"We are gonna jump a little bit in time so everyone can start in a more restful, low-key place,\" creator Peter Nowalk tells The Hollywood Reporter ahead of the show's late-September premiere. \"We'll be starting at the beginning of their second semester of their second year in law school. They're halfway done. It's their winter semester.\"\r\nBut unlike in previous years, there's no big, life-changing event that starts off the season. \r\n\"Everyone's more in a normal place, probably how most of us live our lives without murders happening all the time. It's really nice just to be eased into where they are.\"\r\n\r\nThere is, however, a big question that will be introduced in the season premiere.\r\n\"That's how I always start the writers each year,\" Nowalk says. \"What is our Who is under the sheet? Who killed Sam? Who shot Annalise? This year, the question is not a 'who,' it's a 'where.' It's very different than the other seasons, which is why I love it, but it's still a really great mystery.\"\r\nMake no mistake, Nowalk says — the reveal of said question will still be a major moment in the episode.\r\n\"It's still a crazyballs, roller-coaster, what-the-fuck-happened mystery. We'll find out that question — in fact, one of the characters will even say it by the end of the first episode.\"\r\n\r\nWhen the Shondaland series picks up, the answers to many questions left hanging in the season three finale will be answered.\r\n\"Asher and Michaela are going to be living together, Laurel will have made a decision about whether or not to have the baby and Annalise will really have had time to breathe and say, 'OK, what do I want my life to look like now that I am disgraced and starting at rock bottom? How can I build my life back from that?'\"\r\nLaurel's storyline in particular will see major repercussions from the events of the finale, when the audience learned that it was Laurel's childhood friend, under orders from her father, who killed Wes (Alfred Enoch).\r\n\"We have to start the season wondering does Laurel have any idea that her dad basically killed Wes, and what is she going to do about that if she does? Wes was the heart of the show, and now he's dead. I think someone has to work to still solve his murder, because it's unsolved. Annalise feels like that's just what they have to live with, but I don't think Laurel wants to give up on that answer yet.\"\r\nPlus, the audience will find out what Connor (Jack Fallahee) said to Oliver's (Conrad Ricamora) proposal.\r\n\"The proposal is on the table, and we'll see them talk about it in a way that I find is kind of fun and unexpected in our premiere, and will come to a mutual decision about what to do,\" Nowalk says. \"I will say their relationship is just getting deeper, and what's really fun is for them to each be finding out things they didn't know about each other, as well as the audience is finding that out. For example, we're gonna meet one of Connor's parents, and Oliver will meet one of those parents.\"\r\nAnd then there's Annalise, whose murder charges were dropped but whose reputation was seriously harmed by the allegations. How will she interact with her former students now that she's no longer teaching — and after pinning Rebecca's and Sam's deaths on their dead BFF?\r\n\r\n\"That is a great question,\" he comments. \"We're gonna answer it in the premiere. Does she want them in her life anymore? Does she still think that they all have to band together to protect each other? Or does she feel like it's time they all go their separate ways? There will be a major decision about that and a major shift in the show in the premiere.\"\r\nContinues Nowalk, \"When Annalise takes on her first client, you'll see it's someone from her past that really works into her emotional story of looking for redemption. All of the clients so far are people that either we know or that are cases that are gonna get her further in her redemption journey.\"\r\nAnnalise's storyline will provide plenty of opportunities for Davis to show off her Oscar-winning chops.\r\n\"The best part and also the scariest part about getting to write for Viola is she can do anything. The challenge for me and the writers is always to give her new things to play. I think we're doing that,\" Nowalk says. \"We are introducing this Jimmy Smits character, whom she has to interact with a lot. I don't want to say what his character is, but they have some amazing scenes together that are using all of Viola's talents and craft to the best of our ability. With every season, it's like, 'Oh my God, are we giving Viola enough to do, or are we taking advantage of this gift we've been given?' I think, so far, we're doing a pretty good job.\"\r\nHow to Get Away With Murder returns Thursday, Sept. 28 on ABC.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘How to Get Away With Murder’: Inside the Road to “Redemption” in Season 4", "url": "https://www.hollywoodreporter.com/tv/tv-news/how-get-away-murder-season-4-spoilers-pete-nowalk-interview-1033575/", "description": "The big question of season four is not a “who” but a “where,” says creator Peter Nowalk.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/145766_0444_-_h_2017_0.jpg?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2017-08-31T08:35:00+00:00", "modified_time": "2017-08-31T15:28:37+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘How to Get Away With Murder’: Inside the Road to “Redemption” in Season 4", "description": "The big question of season four is not a “who” but a “where,” says creator Peter Nowalk.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/145766_0444_-_h_2017_0.jpg?w=1280"}}, "movies": [], "publish_date": 1504168500.0, "source": "https://www.hollywoodreporter.com", "summary": ""}