{"url": "https://www.theguardian.com/world/2018/oct/08/metoo-one-year-on-hollywood-reaction", "text": "It was always about far more than a hashtag. Tarana Burke should be the first person mentioned in any article about #MeToo, the movement that has amplified a whisper network and caused ructions in the media industry that were well overdue. Burke, a civil rights activist, began using the phrase “me too” on Myspace in 2006 as a campaign for “empowerment through empathy” after she had spoken to a 13-year-old girl who had been assaulted.\n\nA year ago, when the allegations against Harvey Weinstein began to emerge, actor Alyssa Milano tweeted: “If all the women who have been sexually harassed or assaulted wrote ‘me too’ as a status, we might give people a sense of the magnitude of the problem.” Since then, #MeToo has either been used as a statement of solidarity on social media, or attached to harrowing accounts of harassment and abuse recorded by men and women, especially in the film industry – and the most prominent voices belonged to famous actors. Burke told Ebony: “The celebrities who popularized the hashtag didn’t take a moment to see if there was work already being done, but they also were trying to make a larger point.”\n\nThe simplicity of the form of words has probably been very helpful for people trying to discuss a subject that it is not just painful, but that has actively been hidden or dismissed for years. Generations of women were told not to talk about this, even without abusers allegedly silencing their victims with non-disclosure agreements. Now, with #MeToo, and its international variations (#BalanceTonPorc in France, #QuellaVoltaChe in Italy, #YoTambien in Spanish-speaking countries, #TystnadTagning in Sweden), the conversation is inescapable. As Zoe Saldana told Cosmopolitan, the rules have changed: “The high road for a woman for centuries was silence. The new high road is speaking up.”\n\nThat conversation is vital, but a year later, can we begin to assess whether the #MeToo movement has achieved more than just talk? Most obviously, some men have disappeared from the industry. Bill Cosby is in jail, Weinstein is awaiting trial. Kevin Spacey was dropped from House of Cards and replaced with Christopher Plummer in All the Money in the World. Brett Ratner has chosen to “step away” from Warner Bros. Roman Polanski and Cosby were expelled from the Academy. Though some changes are not permanent: Louis CK is already performing standup again; Polanski is working on a new film. Sickeningly, Les Moonves, the CBS CEO who helped found the Commission on Eliminating Sexual Harassment and Advancing Equality in the Workplace last December, is now being investigated himself.\n\nThe practical wing of #MeToo is Time’s Up, an organization founded in Hollywood to end sexual abuse in the industry, with wins in UK and Europe. This organization, has raised millions for legal funds and amassed volunteer lawyers, as well as donating to women’s organizations and sharing support lines and advice for shooting sex scenes. Time’s Up has also been about visibility as well as action, with actors promoting the campaign at awards ceremonies, for example, by bringing activists as their red carpet dates to the Golden Globes.\n\nOscars attendees wearing Time’s Up badges. Photograph: Mario Anzuoni/Reuters\n\nWith Time’s Up’s assistance, the Producers’ Guild of America drew up and issued anti-sexual harassment guidelines – which should be needless as it is illegal in the first place. Similar advice has been drafted in the UK and Europe with the relevant unions. The guidelines include training for all cast and crew and designating people that workers can approach to report any incidents. With a lot of fanfare, the first production to adopt the plan was the superhero sequel Wonder Woman 1984. Other unions, including the Screen Actors Guild, have issued their own guidelines and policies, in the face of criticism that they either stood by for too long or were part of the problem itself.\n\nIn the UK, the actors’ union Equity founded a working group last November and joined other entertainment unions in calling for anti-harassment clauses in contracts. One British actor I spoke to while researching this piece told me that she was recently harassed by a casting director during an audition. While her agents dismissed her complaint, Equity took her report seriously and fed it back to the casting director, who issued an apology at least. Other women in the industry tell me that they now feel more people listen to them in the meetings when they talk about inclusion or harassment, concerns that were previously dismissed.\n\nKate Muir, a screenwriter and campaigner with the UK branch of Time’s Up, says: “Part of Time’s Up is the harassment and the bullying, but another is diversity, women’s roles, equality. Both parts are as important as one another, because the equality and diversity will bring sanity, one hopes.” Gender parity in the film industry, which bodies such as Women and Hollywood have been working towards for years, should create more inclusive, safe workplaces – as well as better jobs for women and people of colour. Director Carol Morley mentioned one bizarre consequence in which the usual rules are reversed: “I get messages from unknown producers wanting to attach a ‘female director’ to a project for no other reason than it seems that they think it will tick a box and help them get their project made.”\n\nFrances McDormand talking about inclusion riders in her speech for winning best actress at the Oscars. Photograph: Chris Pizzello/Invision/AP\n\nStacy Smith of the Annenberg Inclusion Initiative at the University of Southern California devised the “inclusion rider” in 2016, though many people heard about it for the first time when Frances McDormand trumpeted it in her speech at the Oscars. “You can ask for or demand at least 50% diversity in not only the casting and the crew,” she explained backstage. “I just learned that after 35 years in the film business – we aren’t going back.”\n\nWhile many actors vocally supported the concept, it would be more effective studios if adopted a diverse hiring policy to begin with – which is what Warner Bros announced it would do in March, beginning with Just Mercy, starring Michael B Jordan.\n\nWith diverse hiring comes the question of equal pay. Famously, when Mark Wahlberg and Michelle Williams were called back for reshoots after Spacey was deleted from All the Money in the World, Wahlberg was paid vastly more than Williams – and he has since donated the cash to Time’s Up. Williams says she only agreed to such a low fee because she felt the reshoots themselves were a powerful statement against the culture of harassment. Even in a post #MeToo world she risked paying a price for standing up against abuse. Elsewhere, Jessica Chastain led by example, negotiating co-star Octavia Spencer’s fee to match her own on an upcoming film, but this kind of equality shouldn’t be left to individual actors to bargain for.\n\nFilm-maker Amma Asante addresses the crowd at the Share Her Journey rally during the Toronto international film festival. Photograph: Chris Pizzello/Invision/AP\n\nFilm festivals too have been urged to change their ways. The lineups of Cannes and Venice this year were notably male, a pair of sore thumbs in a year dominated by talk of parity. That said, Cannes was the first among its peers to pledge a commitment to gender-balanced programming by 2020. At Toronto, the second year of the Share Her Journey initiative saw more diverse film critics invited to cover the festival and an increased commitment to supporting female filmmakers. At a rally, Mia Kirshner outlined her ambitious #AfterMeToo plan to support people who report sexual harassment, while others including Geena Davis and Stacy Smith spoke about boosting diversity on- and off-screen.\n\nWhile the red carpets at awards ceremonies were dominated by gestures of solidarity, little has changed beyond the speeches. This year’s Oscars saw the first ever cinematography nomination for a woman (she didn’t win), while at the Golden Globes Natalie Portman captured attention simply by introducing a category with the words: “And here are the all-male nominees.”\n\nSo much of the first year of #MeToo has been dominated by the comparatively privileged voices of white female Hollywood actors, by guidelines and plans announced but not necessarily put to the test, and a focus on individual rather than collective action. However, Muir is optimistic about what can be achieved: “It was horrendous yes, but it has galvanized this incredible positive action,” she says. “I think people’s awareness has completely changed.”\n\nNow we face life not only post-#MeToo, but in the wake of the grisly Brett Kavanaugh hearings, the movement is increasingly more important. While certain voices are better than others at getting media attention, as it continues the movement must ensure that it does not perpetuate the kind of culture that let one kind of voice silence others for so long.\n\nArriving just this week, the brand new CEO of Time’s Up, Lisa Borders, began her tenure with a call for inclusivity in the movement: “It’s out here for everybody. This is not a club,” she told Vanity Fair. “I would just offer the invitation to everyone, right here, right now … come join us on this journey.” Or as actor Amanda Brugel put it at the rally in Toronto: “We’re gonna need a bigger boat, y’all. So I invite people of all genders and identifications to hop in and row for your fucking lives.”", "images": ["https://i.guim.co.uk/img/media/71318fef05c5b4a8ca661399131d6135610a14db/0_0_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=75e0695199cabd38f1e754f2935d8c2b", "https://i.guim.co.uk/img/media/5c61b4101eb660a0dda806021327072b97f87803/0_81_3679_2208/master/3679.jpg?width=445&quality=85&dpr=1&s=none", "https://i.guim.co.uk/img/media/74ca0dd6eade37d7ae24855058cd44f36e65025f/0_0_3500_2099/master/3500.jpg?width=445&quality=85&dpr=1&s=none", "https://i.guim.co.uk/img/media/c35cff1e25003b697cd03f4f6e74457779876bcd/0_0_4510_3118/master/4510.jpg?width=445&quality=85&dpr=1&s=none", "https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Film+industry%2C%23MeToo+movement%2CFilm%2CBusiness%2CCulture%2CHarvey+Weinstein%2CRape+and+sexual+assault%2CMichael+B+Jordan", "https://i.guim.co.uk/img/media/71318fef05c5b4a8ca661399131d6135610a14db/0_0_3000_1800/master/3000.jpg?width=465&quality=85&dpr=1&s=none"], "top_img": "https://i.guim.co.uk/img/media/71318fef05c5b4a8ca661399131d6135610a14db/0_0_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=75e0695199cabd38f1e754f2935d8c2b", "keywords": [], "authors": ["Pamela Hutchinson"], "canonical_link": "https://www.theguardian.com/world/2018/oct/08/metoo-one-year-on-hollywood-reaction", "title": "#MeToo and Hollywood: what's changed in the industry a year on?", "meta_data": {"description": "In the past 12 months, talk of change and proposed structural changes within the industry have shifted the pendulum but more work is required", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#052962", "og": {"url": "http://www.theguardian.com/world/2018/oct/08/metoo-one-year-on-hollywood-reaction", "image": {"identifier": "https://i.guim.co.uk/img/media/71318fef05c5b4a8ca661399131d6135610a14db/0_0_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=75e0695199cabd38f1e754f2935d8c2b", "height": 720}, "title": "#MeToo and Hollywood: what's changed in the industry a year on?", "description": "In the past 12 months, talk of change and proposed structural changes within the industry have shifted the pendulum but more work is required", "type": "article", "site_name": "the Guardian"}, "article": {"author": "https://www.theguardian.com/profile/pamelahutchinson", "publisher": "https://www.facebook.com/theguardian", "modified_time": "2020-02-24T18:37:08.000Z", "section": "Film", "published_time": "2018-10-08T07:00:14.000Z", "tag": "Film industry,#MeToo movement,Film,Business,Culture,Harvey Weinstein,Rape and sexual assault,Michael B Jordan"}, "al": {"ios": {"url": "gnmguardian://world/2018/oct/08/metoo-one-year-on-hollywood-reaction?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287}, "twitter": {"dnt": "on", "app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"googleplay": "guardian://www.theguardian.com/world/2018/oct/08/metoo-one-year-on-hollywood-reaction", "iphone": "gnmguardian://world/2018/oct/08/metoo-one-year-on-hollywood-reaction?contenttype=Article&source=twitter", "ipad": "gnmguardian://world/2018/oct/08/metoo-one-year-on-hollywood-reaction?contenttype=Article&source=twitter"}}, "card": "summary_large_image", "image": "https://i.guim.co.uk/img/media/71318fef05c5b4a8ca661399131d6135610a14db/0_0_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=73b28627e268582622dc973739a015de", "site": "@guardian"}, "robots": "max-image-preview:large"}, "movies": [], "publish_date": 1538953200.0, "source": "https://www.theguardian.com", "summary": ""}