{"url": "http://digg.com/2017/how-to-watch-all-of-marvel-cinematic-universe", "text": "​Welcome to Fan Service, a guide to engaging with gargantuan, lore-heavy franchises. In each volume, we'll recommend a watch/read order to approach the given series with and dissect our argument for it. Today: The Marvel Cinematic Universe in film and television.\n\nNote: This article has been updated for the impending release of \"Avengers: Endgame,\" and it contains intentionally vague spoilers for the ending of \"Avengers: Infinity War.\" You've been warned.\n\n\n\nNick Fury popped up in Tony Stark's living room for a chat over a decade ago, and now cinematic universes are the blockbuster business model everyone wishes they could emulate. So far, no company has come within spitting distance of the hype the Marvel Cinematic Universe possesses.\n\nTease us with King Kong versus Godzilla? Peanuts compared to Marvel. Give audiences a Mummy and promise them Dracula and Wolf Man in the future? Nope, that idea's dead. And what about the venerable superhero lineup of DC? There's life in that effort thanks to \"Wonder Woman\" and \"Aquaman,\" but the rest of the \"DCU\" is still dead weight.\n\nLesser superhero movies and cinematic universes might fade from view in the near future, but it looks like there's no stopping Marvel's momentum. As of 2019, there are 20 films in the Marvel Cinematic Universe (MCU) along with a half-dozen TV shows and a bunch of comic book spin-offs. Marvel Studios president Kevin Feige says Marvel has film storylines drafted through 2028. It'd take some kind of cataclysmic event to knock the MCU off track.\n\nThe benefit of Marvel's centrally-planned canon is that, for the most part, it's not too hard to follow the main storyline. Every Marvel movie has been building towards a meeting between our Earth-bound heroes, the aliens and gods who chill in space and a big purple CG Josh Brolin in possession of the powerful Infinity Stones. Now that \"Infinity War\" is out, the timeline is a little trickier — between that and its direct sequel \"Avengers: Endgame,\" we got two prequels.\n\nThanks to hedged bets in earlier movies, recast roles and the decision to reboot a contemporaneous Marvel series — here's looking at you, Spidey — there are a couple other things that might throw you off if you're trying to watch all the Marvel movies without getting lost in a dark dimension of crossover confusion. Our recommendation privileges variety over strict chronology in some places and it doesn't abide by Marvel's awkward attempts to plug movies into the middle of television seasons. Also, we'll do our best to clear up any confusion on what movies are in the Marvel Cinematic Universe (a lot) and which movies aren't (also a lot). Let's go.\n\nInching Towards An Infinitely Hyped-Up Intersection\n\nMarvel's first \"Avengers\" movie was in the works well before Robert Downey Jr.'s smarmy charisma brought Tony Stark to life in 2008's \"Iron Man,\" but the studio was careful to not say anything definitive about a crossover flick until they knew they had an arc-powered hit on their hands. As such, the early Marvel movies are careful to only build up towards 2012's \"The Avengers\" and little more. With Tony Stark's warmly received debut and a lasting narrative hangover caused by him having the most screentime of any Avenger prior to their team-up, Iron Man's narrative arc lays most of the groundwork for \"The Avengers.\" Even though Captain America's debut takes place 50 years earlier, you've gotta start with Stark. With that in mind, here's what order to watch everything in:\n\nIron Man (2008)\n\n\n\nIron Man 2 (2010)\n\n\n\nThe Incredible Hulk (2008)\n\n\n\nThor (2011)\n\n\n\nCaptain America: The First Avenger (2011)\n\n\n\nMarvel's The Avengers (2012)\n\n\n\nIron Man 3 (2013)\n\n\n\nThor: The Dark World (2013)\n\n\n\nGuardians of the Galaxy (2014)\n\n\n\nGuardians of the Galaxy Vol. 2 (2017)\n\n\n\nCaptain America: The Winter Soldier (2014)\n\n\n\nAgents of S.H.I.E.L.D. Season 1 (2013)\n\n\n\nDaredevil Season 1 (2015)\n\n\n\nAvengers: Age of Ultron (2014)\n\n\n\nAgents of S.H.I.E.L.D. Season 2 (2014)\n\n\n\nJessica Jones Season 1 (2015)\n\n\n\nAnt-Man (2015)\n\n\n\nDaredevil Season 2 (2016)\n\n\n\nDoctor Strange (2016)\n\n\n\nLuke Cage Season 1 (2016)\n\n\n\nAgent Carter Seasons 1 and 2 (2015-16)\n\n\n\nCaptain America: Civil War (2016)\n\n\n\nBlack Panther (2018)\n\nAgents of S.H.I.E.L.D. Seasons 3 and 4 (2015-16)\n\n\n\nIron Fist Season 1 (2017)\n\nThe Defenders Season 1 (2017)\n\nThe Punisher Season 1 (2017)\n\nJessica Jones Season 2 (2018)\n\nLuke Cage Season 2 (2018)\n\nDaredevil Season 3 (2018)\n\nThe Punisher Season 2 (2019)\n\nAgents of S.H.I.E.L.D. Season 5 (2018)\n\nSpider-Man: Homecoming (2017)\n\nThor: Ragnarok (2017)\n\nAvengers: Infinity War (2018)\n\nAnt-Man and the Wasp (2018)\n\nCaptain Marvel (2019)\n\nAvengers: Endgame (2019, forthcoming)\n\nIf you're just focusing on the films, this order guides you through the major arcs of the MCU thus far. First, you meet the individual heroes who come together and form the Avengers. Next, you see the sprawling aftermath of the Avengers' first conflict followed by a detour in deep space (where we learn a lot more about the Infinity Stones). The introduction of Ultron leads to division amongst Earth's heroes, putting them on icy terms with one another right as that big purple guy plots to assemble those dang Stones.\n\nJudging by the massive pile of money it made, chances are good you've already seen \"Infinity War.\" Let's just say that \"Infinity War\" definitely leaves the fate of a lot of people up in the air, creating an interesting storytelling problem that Marvel has decided to more-or-less sidestep. Both \"Ant-Man and the Wasp\" and \"Captain Marvel\" take place before the ending of \"Infinity War\" — the former is set right before \"Infinity War,\" while the latter takes place in the '90s. It's better to think of both of these films as flashbacks that will help set up the events of \"Avengers: Endgame\" rather than try to wedge them in the chronological timeline of the films.\n\nSpeaking of that \"Infinity War\" ending, don't hold out too much hope that we're going to see it affect the Marvel TV shows in a big way. \"Agents of S.H.I.E.L.D.\" nearly addressed it, and might in the future, but now that the forthcoming third season of \"Jessica Jones\" is the last we'll be seeing of Marvel from Netflix, you can probably stop holding your breath. At this point, beyond the few \"Agents\" crossovers and the handful of times the events of \"The Avengers\" have been referenced on the Netflix shows, Marvel's TV offerings might as well be quarantined from the movies. That's not to say it won't be a pleasant surprise if a crossover does happen in the future, though…\n\nOkay, What Movies Aren't Part Of Marvel's Cinematic Canon?\n\nMarvel Entertainment predates the MCU by quite a while, and the name is still attached to projects primarily led by other studios that negotiated the rights to certain Marvel characters a long time ago. Marvel Studios is responsible for films in the MCU. You'll never see their name attached to films featuring Marvel characters that don't exist in the same canon as Robert Downey Jr.'s Iron Man and the rest.\n\nThe biggest, most clearly separated example of non-MCU Marvel movies are Fox's \"X-Men\" films, starting with 2000's \"X-Men\" and continuing through films like \"Deadpool,\" \"X-Men: Apocalypse\" and \"Logan.\" The first few \"X-Men\" and subsequent solo endeavors like Wolverine's films can be seen as blueprints for the MCU in reverse — if they hadn't shown that audiences were willing to watch ensemble superhero movies and more focused tie-in films, Marvel Studios likely wouldn't have moved forward with the build-up towards \"The Avengers.\"\n\nMarvel surely appreciates the success of the \"X-Men\" films to an extent, but they'd probably rather have the rights back themselves. Disney, Marvel's parent company, secured approval from the Department of Justice in June of 2018 to buy up most of Fox's assets — now that the deal is complete Kevin Feige hopes work can start on incorporating characters like the X-Men into the MCU in the first half of this year.\n\nThe X-Men aren't the only Marvel characters Fox used to have the rights to: Fox also had The Fantastic Four. They've already rebooted that series once, after two poorly received films (with future Captain America [Chris Evans] as The Human Torch). The 2015 reboot film was panned too (with future \"Black Panther\" antagonist Erik Killmonger [Michael B. Jordan] as The Human Torch). In addition, Fox made the 2003 Ben Affleck \"Daredevil\" film, and that bombed so badly that Fox went ahead and let Marvel have the rights back — and when they did, Marvel rebooted Daredevil as their first Netflix show.\n\nIt's a similar story with Spider-Man, only now the web slinger's already part of the MCU. Sony Pictures holds the rights to that character in a similar fashion to Fox; so long as they keep making Spider-Man movies, they keep those rights. That's why they did \"The Amazing Spider-Man\" and it's sequel a little while back, after the MCU already took off. Unfortunately for Sony, those films didn't do as well as the originals — and then the massive Sony email leak happened. It was shortly after that damaging hit to the company that they announced a new deal with Marvel Studios regarding Spider-Man: Spidey would join the MCU in the next Captain America film, and then get his own solo film as a co-production between Marvel Studios and Columbia Pictures. Sony gets all the profit from solo MCU Spider-Man films and any non-MCU Spider-Man spinoffs (like \"Venom\" and Oscar-winner \"Into the Spider-Verse\") while Marvel Studios makes all the money from films where Spider-Man has a smaller role, like with the character's introduction in \"Captain America: Civil War.\"\n\nSo Wait, Who's Spider-Man Now? Who's The Hulk?\n\nOK, perhaps you're still confused. With so many reboots and recastings over the last decade and change, who could blame you? Let's go through the iterations of a few key Marvel characters to establish which versions are and aren't canon in the MCU.\n\nSpider-Man/Peter Parker\n\n\n\n&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;lt;img src=\"http://static.digg.com/images/c2f43ddb92c74a349cc98db3e5a99142_2ce9f48683ed4673913f75945c5a5965_1_post.jpeg\" alt=\"\" /&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;gt;\n\n\n\nThe three Spider-Man films starring Tobey Maguire as Peter Parker are not canon in the MCU, and neither are the \"Amazing Spider-Man\" reboots with Andrew Garfield. Tom Holland's Peter Parker, introduced midway through \"Captain America: Civil War,\" is the one you've got to know. Hopefully we won't have to deal with any other live-action Spider-Men (and that is how you pluralize \"Spider-Man\") in the near future. Do not cry for Maguire or Garfield — the true loss to Marvel's cinema canon through this double reboot is J.K. Simmons' hilarious version of J. Jonah Jameson, Parker's irritable, cigar chomping boss at the Daily Bugle. If they introduce Jameson to the MCU and cast Simmons again, everyone would be willing to look the other way.\n\nThe Hulk/Bruce Banner\n\n\n\n&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;lt;img src=\"http://static.digg.com/images/e51a5339da0d4a0e877b667642f06706_2ce9f48683ed4673913f75945c5a5965_1_post.jpeg\" alt=\"\" /&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;gt;\n\n\n\nAlright, this is a bit more confusing. Eric Bana starred as Bruce Banner in Universal's 2003 film \"Hulk,\" directed by Ang Lee. The poor reception that film received made it easy for Marvel to work out a deal with Universal, and so they introduced Hulk to the MCU five years later in \"The Incredible Hulk\" starring Ed Norton as Banner. Throughout the production of that film, there were tensions between Norton and the folks at Marvel Studios — the film wasn't too well-received and so Marvel and Norton split, leading to Banner's recasting in \"The Avengers.\" Mark Ruffalo's our Bruce now, and he's great (but don't forget when he spoiled \"Infinity War,\" oops).\n\nWar Machine/James Rhodes\n\n\n\n&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;lt;img src=\"http://static.digg.com/images/8f55ad118aff4a5ab0d85331044816c9_2ce9f48683ed4673913f75945c5a5965_1_post.jpeg\" alt=\"\" /&amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;amp;gt;\n\n\n\nIt's not too hard to follow along here, considering that Terrence Howard only appears as James Rhodes in the first \"Iron Man\" film. Howard left the franchise because of a salary dispute (according to Howard, Marvel went back on their promised salary bump for \"Iron Man 2\" while still increasing Robert Downey Jr.'s paycheck) and Rhodes ended up being recast. Don Cheadle's Rhodes donned Tony Stark's old Iron Man suit in the second film, and he's been in the MCU as Rhodes a.k.a. War Machine ever since.\n\nWhat's The Deal With The TV Shows?\n\nWhile the Marvel movies are generally pretty good at either sticking to self-contained stories or giving you the context you need, there are two flavors of Marvel TV: plotty film-spin offs and isolated, prestige TV solo stories.\n\n\"Agents of S.H.I.E.L.D.\" (ongoing) and \"Agent Carter\" (canceled) are ABC's MCU television shows, and they're both lead by supporting characters plucked from the Marvel films. Of anything in the MCU, these shows are the most stereotypically \"comic-book-y\" — their central pitch is that they're giving your a bigger picture of the world depicted in the films.\n\nNetflix's Marvel shows take the opposite approach: they all focus on super powered New Yorkers whose lives cross paths but who collectively have little to no connection with the heroes we see on the big screen.\n\nWhen it comes to a watch order, the ABC and Netflix shows wedge themselves into the MCU timeline differently. In \"Daredevil,\" \"Jessica Jones\" and \"Luke Cage,\" the climactic New York battle in the first Avengers film is referenced from time to time, placing those stories after the film. Simple enough. \"Agents of S.H.I.E.L.D.\" wants to give the appearance of being more deeply embedded in the MCU, so there are numerous points in the show where audiences are told one of the films takes place between episodes of the show.\n\nOur order follows the Netflix-ian impulse throughout: The assumption is that you're going to binge watch these shows. The Netflix shows have shorter seasons and are more consciously suited for this style of watching, but it holds up with \"S.H.I.E.L.D.\" too. Clearly, the idea is that fans who are deeply committed to the MCU timeline will wedge the movies in between episodes of \"S.H.I.E.L.D.\" where they come, but this would totally disrupt the flow a person has when watching a season of television. You go right from one low-ish budget episode of television (sorry, it's true) to a blockbuster film and back — a little weird. Plus, as integrated as the films are supposed to be in the timeline, \"S.H.I.E.L.D.\" pulls the lazy move of having the critical events of these film interludes summarized with TV news reports at the top of the following episode twice.\n\nSo long as the connective tissue between the shows and the films stays as thin as it is now, it makes more sense to stick whole seasons between movies or to just watch all the films first before doubling back to watch any of the shows that strike your fancy. Oh, and if you're wondering which show you could skip if you want to, hardly anybody liked Netflix's \"Iron Fist.\" Plus, do you really need another story about an über rich guy who becomes a superhero with \"Iron\" in their name?\n\nThe Future\n\nSo, does the ending of \"Infinity War\" spell doom and gloom for the various ongoing narratives in the MCU? Uh, no. I won't say here which sequels to which heroes' films are already confirmed and/or in production but let's just say that after the next \"Avengers\" movie you'll probably be mourning some of the heroes who've been on-screen for around a decade and not the ones who just got their feet wet in this whole superhero business.\n\nAfter Evangeline Lilly's Wasp became the first woman to make the title in an MCU film (only took 20 installments…), Brie Larson is the first to carry an entire MCU movie on her own as Carol Danvers, a.k.a. Captain Marvel. One longtime MCU hero (whose name I've left out for the \"Avengers\" spoiler-averse) is also poised to finally get her own solo picture down the road. Beyond that, we know the studio hopes to introduce another eponymous female hero later on: Kevin Feige has said there are plans for Kamala Khan a.k.a. Ms. Marvel. Khan is a Muslim Pakistani-American and, like good ol' Peter Parker, a teenager who struggles with superhero-ing on top of normal teen stuff. Presumably, a Ms. Marvel story in the MCU would involve her idol Captain Marvel somehow, which is why we probably won't see Khan until Carol Danvers has had plenty of time in the spotlight.\n\nLet's not forget the TV side of things: though the third season of \"Jessica Jones\" will mark the end of the Netflix/Marvel collaboration, the MCU looks like it's only poised to get more episodic. There's still more \"S.H.I.E.L.D.\" on the way and a show with Tom Hiddleston reprising his role as Thor's brother Loki is slated for Disney's streaming service, Disney+, which launches in late 2019. Kevin Feige promises that the Loki series and other, unannounced Disney+ Marvel projects will be produced by Marvel Studios and \"entirely interwoven\" with MCU storylines.\n\nWith new shows coming, Disney's absorption of 21st Century Fox complete and Marvel Studios acting pretty cagey about what comes after \"Avengers: Endgame\" — even though we've known what the next film will be for a long time now — it's hard to nail down what else is coming down the road for the MCU. If the \"Avengers\" build-up has you anxious, just rest assured that there's more to come. Like, a lot more — so just chill, rewatch your favorites, and consider diving into some other series and genres while you wait for whatever the MCU has in store for us next.", "images": ["https://cdn.digg.com/submitted-links/419x224/1664897482-SDY0812nQo.jpg", "https://cdn.digg.com/wp-content/uploads/2022/10/03125946/419x224/maxresdefault-1.jpeg", "https://cdn.digg.com/wp-content/uploads/2022/10/04114718/419x224/maxresdefault-1-6.jpeg", "https://cdn.digg.com/wp-content/uploads/2022/08/09144349/419x224/image-1-3.png", "https://cdn.digg.com/submitted-links/419x224/1664877470-7zN3LDnGCk.jpg", "https://cdn.digg.com/wp-content/uploads/2022/10/04095558/419x224/jacob-batalon.png", "https://cdn.digg.com/submitted-links/419x224/1664876039-V1JmtJOkhN.jpg", "https://cdn.digg.com/wp-content/uploads/2022/10/04112326/419x224/try-guys-ned-fulmer.png", "https://cdn.digg.com/wp-content/uploads/2022/10/03175214/419x224/maxresdefault-1-4.jpeg", "https://cdn.digg.com/wp-content/uploads/2022/10/03143256/419x224/Screen-Shot-2022-10-03-at-10.32.47-AM.png", "https://cdn.digg.com/submitted-links/419x224/1664870740-apJXC12FIm.jpg", "https://cdn.digg.com/wp-content/uploads/2022/10/04160943/419x224/maxresdefault-1-7.jpeg", "https://cdn.digg.com/submitted-links/419x224/1664892719-iPyuug3HzN.jpg", "https://cdn.digg.com/submitted-links/419x224/1664875536-ObpFS00DpF.jpg", "https://cdn.digg.com/submitted-links/419x224/1661527741-lh3Zr1HVvT.jpg", "http://digg.com/static/images/white.svg", "https://cdn.digg.com/submitted-links/419x224/1664895424-n6DUh6dbhb.jpg", "https://cdn.digg.com/wp-content/uploads/2022/10/04103729/419x224/seth-meyers.png", "https://cdn.digg.com/wp-content/uploads/2022/10/03143011/419x224/james-corden-reputation.png", "https://cdn.digg.com/submitted-links/419x224/1664884156-Icgy9d1lDO.jpg", "https://cdn.digg.com/wp-content/uploads/2022/08/04220750/419x224/digg_com_cover_image_3-1.png", "https://cdn.digg.com/submitted-links/419x224/1664886643-qXWAxTcHOC.jpg", "https://cdn.digg.com/submitted-links/419x224/1664875954-UTUyf222an.jpg", "https://cdn.digg.com/submitted-links/419x224/1664880944-50U4A5hkCE.jpg", "https://cdn.digg.com/submitted-links/419x224/1664826064-5MMOfuRKPP.jpg", "https://cdn.digg.com/submitted-links/419x224/1664881857-KdKqJRxUrU.jpg", "https://cdn.digg.com/submitted-links/419x224/1664876336-vQUIOqQG3e.jpg", "https://cdn.digg.com/submitted-links/1664895548-w0qGzjD2OP.jpg", "https://cdn.digg.com/submitted-links/419x224/1664889684-uXwXON1VjQ.jpg", "http://static.digg.com/static/images/x.gif", "https://cdn.digg.com/submitted-links/419x224/1661794836-vHZA8uqcU0.jpg", "https://cdn.digg.com/wp-content/uploads/2022/05/17183042/419x224/filtered-bottle-scaled.jpg", "https://cdn.digg.com/submitted-links/419x224/1664861336-f7cVaCDFmc.jpg", "https://cdn.digg.com/submitted-links/419x224/1664871765-8vqetalnFL.jpg", "https://cdn.digg.com/wp-content/uploads/2022/10/04140902/419x224/hqdefault.jpeg", "https://cdn.digg.com/submitted-links/419x224/1664829927-uqibPFRFBU.jpg", "https://cdn.digg.com/wp-content/uploads/2022/10/03180636/419x224/maxresdefault-3.jpeg", "https://cdn.digg.com/submitted-links/419x224/1664874462-CE3kKz22WH.jpg", "https://cdn.digg.com/wp-content/uploads/2022/10/03174429/419x224/himalayas-from-plane.png", "https://cdn.digg.com/images/d3f0190a17864acb9afb80cf35bf313f_2ttank7_header.jpeg", "https://cdn.digg.com/submitted-links/419x224/1664869806-TM0SjppNvA.jpg", "https://cdn.digg.com/submitted-links/419x224/1664874398-0VYA2FYfQn.jpg", "http://static.digg.com/images/a6e7a1a5c39d4f1e99a920882d6502af_ac1d52af989f405398e896c29141a760_profile.jpeg", "https://cdn.digg.com/wp-content/uploads/2022/10/04085646/419x224/Iliza-Shlesinger-kimmel.png", "https://cdn.digg.com/submitted-links/419x224/1664830190-RQ5vX8pemN.jpg", "https://cdn.digg.com/submitted-links/419x224/1664830104-mSiL2LWj9x.jpg", "https://cdn.digg.com/wp-content/uploads/2022/10/03181111/419x224/alex-rodriguez-interview-mlb-suspension.png", "https://cdn.digg.com/submitted-links/419x224/1664878377-neTSV0H4yB.jpg", "https://cdn.digg.com/images/d3f0190a17864acb9afb80cf35bf313f_2ttank7_1_header.jpeg", "https://cdn.digg.com/wp-content/uploads/2022/10/04122156/419x224/maxresdefault-4.jpeg", "https://cdn.digg.com/submitted-links/419x224/1664822182-p10cvyFCf1.jpg", "https://cdn.digg.com/wp-content/uploads/2022/10/04124638/419x224/iannucci.png", "https://cdn.digg.com/submitted-links/419x224/1664803323-0ZKT9TfmCg.jpg"], "top_img": "https://cdn.digg.com/images/d3f0190a17864acb9afb80cf35bf313f_2ttank7_1_header.jpeg", "keywords": [], "authors": [], "canonical_link": "https://digg.com/2017/how-to-watch-all-of-marvel-cinematic-universe", "title": "The Best Way To Watch The Marvel Cinematic Universe", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "microtip": "33NWbMsckoLcoVX6Tz9o6ksuBrJVeu3en2", "theme-color": "#ffffff", "fo-verify": "086e7e50-6613-44aa-8f1f-16ef9f992a1f", "robots": "max-image-preview:large, max-snippet:-1, max-video-preview:-1", "twitter": {"card": "summary_large_image", "site": "@digg", "title": "The Best Way To Watch The Marvel Cinematic Universe | Digg", "image": "https://cdn.digg.com/images/d3f0190a17864acb9afb80cf35bf313f_2ttank7_1_header.jpeg", "description": "test2"}, "fb": {"app_id": 246440939021950}, "og": {"url": "https://digg.com/2017/how-to-watch-all-of-marvel-cinematic-universe", "type": "article", "title": "The Best Way To Watch The Marvel Cinematic Universe | Digg", "image": "https://cdn.digg.com/images/d3f0190a17864acb9afb80cf35bf313f_2ttank7_1_header.jpeg", "description": "test2"}, "application-name": "Digg", "msapplication-TileImage": "https://digg.com/static/images/digg-logo-144.png", "msapplication-TileColor": "#ffffff", "description": "test2", "keywords": "test", "author": "@mathewolson"}, "movies": [], "publish_date": null, "source": "http://digg.com", "summary": ""}