{"url": "www.latimes.com/entertainment/la-et-entertainment-news-updates-july-robert-pattinson-fka-1501088351-htmlstory.html", "text": "CBS’ ‘S.W.A.T.’ reboot ‘will take on the Trump years,’ #BlackLivesMatter, says Shemar Moore By Meredith Blake Stephanie Sigman and Shemar Moore (Chris Pizzello/Invision/AP) Don’t let the funky theme song or the ‘70s origins fool you. While technically a remake — of both the original series and the subsequent 2003 film based on it — CBS’ upcoming cop drama “S.W.A.T.” is very plugged into the current moment, according to its cast and creators. In the series, former “Criminal Minds” star Shemar Moore plays a native Angeleno who runs a tactical unit for the LAPD and finds his loyalty torn between his fellow officers and the community in which he was raised. As co-creator Aaron Rahsaan Thomas told reporters Tuesday at the Television Critics Assn. press tour, the series was inspired by his experiences growing up in Kansas City, which have helped him understand both sides of the raging debate over police violence. “I grew up in a neighborhood that had a very complicated view towards police officers,” said Thomas, who created the series with veteran showrunner Shawn Ryan. “On one hand, a 12-year-old kid who was a neighbor of mine was shot and killed by a police officer. On the other hand, another neighbor of mine was an actual police officer.” Moore, best known for his long run on the CBS procedural “Criminal Minds,” noted the diversity of the cast and creative team and added that, while the show is primarily designed to entertain, it will also resonate politically. “We’re taking on the Trump years,” he said. “I don’t care who you voted for. It’s just what’s happening today. It’s Black Lives Matter. As much as some people don’t want to hear it, it’s All Lives Matter. It’s not just black versus blue or black versus white. It’s every ethnicity. It’s fear. It’s racism. It’s terrorism. It’s subject matter of today.” Ryan, who created the groundbreaking drama “The Shield,” about corrupt Los Angeles police officers, said he was excited about the chance to examine the often charged relationship between law enforcement and the communities they serve. “Los Angeles is such a diverse, amazing community, and seeing an officer who kind of lives in the city and sort of sees the people that are being policed as humans and as neighbors and as friends was really important to me.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nNetflix getting ‘A Little Help’ from Carol Burnett By Libby Hill What do you get when you pair up a living legend with a bunch of little kids? Comedy gold, if Netflix has its way. The online streaming service announced Monday that comedy icon Carol Burnett will be returning to television with “A Little Help With Carol Burnett,” an original unscripted series that pairs Burnett with children to tackle life’s dilemmas. “Someone once asked me how old I am inside,” Burnett said in a statement Monday. “I thought about it and came up with, ‘I’m about 8.’ So it’s going to be a lot of fun playing with kids my age.” Kids ages 4 to 8 will join Burnett as celebrities and everyday folks bring their real-life problems to the show to get advice in front of a live studio audience. “We’re thrilled Carol is bringing her unique sensibilities to Netflix,” Bela Bajaria, the service’s vice president of content acquisition, said in Monday’s announcement. “Carol is truly a legend in the entertainment industry with unprecedented success and fandom across TV, film and the stage, and we are both honored and excited to work with her.” “A Little Help With Carol Burnett” will be produced by Dick Clark Productions and is the company’s first Netflix project. This is the second television project announced this year for Burnett, 84. In February, ABC ordered a pilot for the multi-camera comedy “Household Name,” starring Burnett, though the series has not been picked up in its current iteration. Debuting in 2018, “A Little Help With Carol Burnett” will feature 12 half-hour episodes. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nKen Burns explains why his Vietnam War documentary is more relevant than ever By Libby Hill Ken Burns in Beverly Hilton on Sunday. (Richard Shotwell / Invision) “History doesn’t repeat itself,” Ken Burns told a room of journalists gathered Sunday at the Television Critics Assn. summer press tour in Beverly Hills “We’re not condemned to repeat what we don’t remember,” Burns explained. “It’s that human nature never changes.” It’s a curious statement from the storied documentarian, particularly given his latest project, the 18-hour, 10-part documentary series “The Vietnam War,” directed with Lynn Novick. But just because humanity isn’t trapped in a constantly repeating cycle doesn’t mean that the echoes of modern strife aren’t plentiful throughout the upcoming PBS series. “This is a story about mass demonstrations all across the country against the current administration,” Burns said in response to a question about what the youth of America will find relevant in “The Vietnam War.” “About a White House obsessed with leaks and in disarray because of those leaks, about a president railing against you, the news media, for making up news. “It’s about asymmetrical warfare, which even the mighty might of the United States Army can’t figure out the correct strategy to take, and it’s about big document drops of classified material that’s been hacked, that suddenly is dumped into the public sphere, destabilizing the conventional wisdom about really important topics and accusations that a political campaign reached out to a foreign power at the time of a national election to influence that election. “This is the film we started in 2006, and every single one of those points are points about the Vietnam War having nothing to do with today,” Burns concluded. By creating a fully-formed picture of Vietnam, Burns hopes to shed light on the rancor and alienation defining this present moment, he explained. For Novick, the thematic relevance only serves to help teachers who have long struggled in tackling the Vietnam War. “We’ve had great response from teachers already that the Vietnam War is difficult to teach because it’s controversial and unsettled history and they’re looking forward to using the film in the classroom,” Novick said. “Those resonances that Ken is talking about, those will be assignments for students. We’re not going to have to work very hard with teachers to come up with those themes, and students are curious about what’s happening now.” “The Vietnam War” premieres Sept. 17 at 8 p.m. PDT Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nGoodbye, MTV Moonman trophy. Hello, ‘Moon Person’ By Emily Mae Czachor MTV’s token space cadet just scored an identity revamp — and gender didn’t make the cut. In a recent interview with the New York Times, MTV President Chris McCarthy said the network’s iconic Moonman trophy has been discontinued. From now on, the metallic figurine — whose impenetrably opaque helmet has become the unofficial “face” of MTV’s Video Music Awards — will go by “Moon Person” instead. Because who knows what’s really going on beneath that lacquered astronaut getup, anyway. “Why should it be a man?” McCarthy told the Times. “It could be a man, it could be a woman, it could be transgender, it could be nonconformist.” This new development is just the latest installment in MTV’s string of efforts to do away with gender norms during its awards proceedings. The network eliminated gender-specific categories at its MTV Movie & TV Awards earlier this year, where all nominees were placed in neutral categories (i.e. best actor in a show, best actor in a movie). And the network isn’t going to stop there. McCarthy also announced a new MTV reality series — still in development —called “We Are They” about a group of gender-nonconforming young adults coming of age. With Katy Perry hosting, the VMAs will broadcast from the Forum in Inglewood on Aug. 27. Here’s the full list of nominees. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nSam Shepard: Pulitzer Prize-winning playwright, actor and ... avant-garde drummer? By Randall Roberts Sam Shepard in 2014. (Jay L. Clendenin / Los Angeles Times) Sam Shepard, whose death at 73 was announced on Monday, will be remembered for his cross-discipline versatility. As a Pulitzer Prize-winning playwright, he penned classic off-Broadway plays including “True West,” “Buried Child” and “Fool for Love.” An Oscar-nominated actor, he starred in films including “Days of Heaven,” “The Right Stuff,” “Crimes of the Heart” and “The Assassination of Jesse James by the Coward Robert Ford.” To fans of underground music, however, Shepard served a lesser-known role as the drummer for seminal New York avant-garde folk band the Holy Modal Rounders, with whom he performed on the crucial late 1960s albums “Indian War Whoop” and “The Moray Eels Eat the Holy Modal Rounders.” The band is best known for its song “If You Want to Be a Bird,” which plays during the classic scene in “Easy Rider” in which Dennis Hopper, Peter Fonda and Jack Nicholson roar down the highway on their motorcycles. That’s Shepard playing drums as Rounders founders Peter Stampfel and Steve Weber whoop and yowl. It was in his capacity as a percussionist, in fact, that he drew the attention of a young Patti Smith, who, in her 2010 memoir “Just Kids,” recounted their first early ‘70s meeting at seminal music club the Village Gate. Escorted to the club by Todd Rundgren, who had just issued his album “Runt,” Smith described the Holy Modal Rounders’ set as “like being at an Arabian hoedown with a band of psychedelic hillbillies. I was fixed on the drummer, who seemed as if he was on the lam and had slid behind the drums while cops looked elsewhere.” Smith, who at the time was freelancing for Crawdaddy magazine, introduced herself to this drummer, who said his name was Slim Shadow. The two started hanging out, wrote Smith, describing his tales as being “even taller than mine. He had an infectious laugh and was rugged, smart, and intuitive. In my mind, he was the fellow with the cowboy mouth.” Only later did she learn Slim’s real identity when a friend pulled her aside after seeing them at a restaurant together. As recounted in “Just Kids,” Smith wrote that her friend asked, “What are you doing with Sam Shepard?” “Sam Shepard?” I said. “Oh, no, this guy’s name is Slim.” “Honey, don’t you know who he is?” “He’s the drummer for the Holy Modal Rounders.” No, corrected her friend, “He’s the biggest playwright off-Broadway. He had a play at Lincoln Center. He won five Obies!” Once she learned of his reputation and acclaim, Smith and Shepard continued to see each other -- despite his being married at the time -- and eventually collaborated on a play called “Cowboy Mouth.” Smith described telling him of nervousness at writing for the stage, which she had never done. But Shepard urged her on, Smith wrote, telling her that “you can’t make a mistake when you improvise.” Replied Smith: “What if I screw up the rhythm?” “You can’t,” Shepard explained. “It’s like drumming. If you miss a beat, you create another.” 7:15 a.m. Updated to correct the title of Smith’s memoir, “Just Kids,” and to identify the Holy Modal Rounders’ co-founders, Stampfel and Weber. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nLady Gaga subpoenaed in producer Dr. Luke’s lawsuit against pop singer Kesha By Randall Roberts The ongoing offstage drama between the pop singer Kesha and her former producer Dr. Luke has entangled another platinum superstar: Lady Gaga. On Saturday, attorneys for Dr. Luke, whose real name is Lukasz Gottwald, issued a statement regarding their attempt to depose Lady Gaga about relevant conversations she may have had with Kesha. The artist, who was born Kesha Sebert, is the subject of a defamation suit filed in New York by Dr. Luke stemming from allegations of sexual misconduct, which the producer vigorously denies. The statement reads: “Dr. Luke’s counsel served a subpoena on Lady Gaga because she has relevant information regarding, among other things, false statements about Dr. Luke made to her by Kesha. This motion has become necessary because Dr. Luke’s counsel has not been able to obtain, despite repeated request [sic], a deposition date from Lady Gaga.” The protracted legal battle between Dr. Luke, left, and Kesha has brought Lady Gaga into the fray. (Kevin Winter / Getty Images) Representatives for Gaga, whose real name is Stefani Germanotta, said in a statement issued to The Times on Monday morning: “As Lady Gaga’s legal team will present to the court, she has provided all of the relevant information in her possession and is at most an ancillary witness in this process. Dr. Luke’s team is attempting to manipulate the truth and draw press attention to their case by exaggerating Lady Gaga’s role and falsely accusing her of dodging reasonable requests.” Among the information Lady Gaga has provided are copies of text messages that were, according to a report on TMZ, heavily redacted. Lady Gaga has been a vocal Kesha supporter. Last year, Gaga wrote about her peer’s plight in an Instagram post: “The very reason women don’t speak up for years is the fear that no one will believe them or their abuser has threatened their life or life of their loved ones/livelihood in order to keep their victim quiet and under control. What happened to Kesha has happened to many female artists, including myself, and it will affect her for the rest of her life.” The news comes at a particularly crucial moment for Kesha’s career. On Aug. 11, she will release her highly anticipated new album, “Rainbow.” The record, featuring songs such as “Learn to Let Go,” will arrive via Dr. Luke’s imprint, Kemosabe, a situation Kesha sought to avoid in a 2014 lawsuit of her own, which she later dropped. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\n‘Ride on, genius’: Celebrities mourn the loss of Sam Shepard By Emily Mae Czachor Acclaimed actor and playwright Sam Shepard died July 27 at age 73. (Charles Sykes / Associated Press) Sam Shepard — Oscar-nominated actor and critically acclaimed playwright, author, screenwriter and director — died on July 27 after suffering complications from ALS (Lou Gehrig’s Disease). When news of his death broke Monday morning, Twitter erupted with posts to mourn, honor and remember one of show business’ beloved renaissance men. View Instagram post This story was updated with additional reactions. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nMacaulay Culkin got his first tattoo with goddaughter Paris Jackson, and it’s a match By Emily Mae Czachor For Paris Jackson, getting inked is nothing out of the ordinary. With more than 50 tattoos already under her belt, the 19-year-old daughter of late pop king Michael Jackson collects body art like postage stamps. According to E! News, the budding actress got her latest over the weekend: an understated sketch of a red spoon, just below the crook of her left arm. A new tattoo might be old-hat for Jackson, but it wasn’t for Macaulay Culkin, Jackson’s 36-year-old godfather -- and first-time tattoo patron -- who emerged from West Hollywood’s Tattoo Mania with a matching spoon on his own forearm. Though neither Jackson nor Culkin spoke to the meaning of the double-inking, the design is supposedly meant to represent a kind of chronic struggle. And that’s not the only news that Culkin made recently. The Internet nearly lost its collective mind last week when a new photo emerged of the “Home Alone” actor looking healthy and happy. E! News even declared that Culkin “definitely just won 2017’s greatest makeover.” Your eyes aren't deceiving you. Macaulay Culkin definitely just won 2017's greatest makeover (thus far, at least). https://t.co/IdKjxii5KZ pic.twitter.com/SOAuSx57oU — E! News (@enews) July 27, 2017 Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAlex Jones’ products are almost as bad as his conspiracy theories, says John Oliver By Meredith Blake Over the last year, conspiracy theorist and influential radio host Alex Jones has come under intense scrutiny for his fringe beliefs, most notably his claim that the massacre at Sandy Hook Elementary School was a hoax perpetrated by the government. On Sunday’s “Last Week Tonight,” John Oliver noted that Jones’ status as a Sandy Hook “truther” qualified him for an Easy Pass to “hell’s version of the champagne room.” But he spent most of his time on a relatively overlooked aspect of Jones’ conspiracy empire -- the wide range of products that he sells in order to fund it. According to Oliver, Jones spends nearly a quarter of his airtime plugging InfoWars-branded merchandise, including Wake Up America Patriot coffee to Combat One Tactical Bath Wipes and a powder called Caveman True Paleo (made from “chocolate and domesticated bird corpses,” Oliver joked). As the comedian pointed out, it just so happens that many of the products Jones sells, often at a significant markup, purport to address the conspiracy theories with equally wild-eyed zeal. Think: water filters to remove chemicals that supposedly turn frogs gay or vitamins to boost your immunity and ward off germs from allegedly disease-ridden refugees. Jones even has his own in-house “expert,” Dr. Edward Group, with dubious qualifications (and equally questionable hair) to back up his various outlandish claims. InfoWars is essentially a “QVC for conspiracy,” Oliver argued. So in the spirit of InfoWars, Oliver decided to introduce his own personal care product, John Oliver Moisture-Armored Tactical Assault Wipes, available via Infowipes.com. The price? A mere $1 million. Worth every penny, we’re sure. You can watch the complete segment here. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nVintage ‘Casablanca’ poster sells for $478,000 By Tre’vell Anderson How much would someone pay for a vintage movie poster? Well, if that film is “Casablanca,” one person’s answer is $478,000. That’s how much a bidder coughed up Saturday for the only known surviving Italian-issue poster for the 1942 film starring Humphrey Bogart and Ingrid Bergman. The poster sold through Heritage Auctions of Dallas. “The buyer has just set a world record and acquired what we in the poster collecting world would equate to a masterpiece,” said Grey Smith, Heritage’s director of vintage posters. “The stunning artistry put into this poster makes it stand head and shoulders above any paper produced for the film.” The poster, measuring 55.5 inches by 78.25 inches, was produced in 1946. The film opened in Italy on Nov. 21 that year, almost four years after its U.S. premiere. Featuring artwork by Luigi Martinati, the poster is considered the best of the picture’s numerous advertisements, Smith said. Previous Italian-issue posters for the film have sold for as much as $203,000. A U.S.-issue of the poster has fetched $191,200. The auction featured other rare posters for the film, with a half-sheet going for $65,725, and a postwar Spanish-release poster selling for $35,850. ---------- For the Record An earlier version of this article misstated the purchase price of the “Casablanca” poster sold Saturday as $487,000. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\n‘There is no Plan B’ for public broadcasting without federal funding, PBS president says By Libby Hill Paula Kerger, chief executive of PBS (Frederick M. Brown / Getty Images) PBS President and Chief Executive Paula Kerger wasn’t pulling any punches Sunday at the Television Critics Assn. summer press tour in Beverly Hills. “When people say, ‘What is the Plan B for [loss of federal funding]?’ There is no Plan B for that,” Kerger said of the potential budget crisis public broadcasting faces under the Trump administration. The Corporation for Public Broadcasting has been under fire for months, with President Trump’s proposed budget axing the institution’s $450-million budget. Though it’s easy to suggest that budget cuts would threaten Big Bird’s livelihood, the true victims of defunding would be far more human. Kerger explained that of PBS’ $450-million budget, one-third goes to radio. Of the television budget, most goes to community service grants that local stations use for up to 50% of their operating budgets. “PBS itself will not go away. But a number of our stations will. If you are a station for whom 30 or 40 or 50% of your funding is suddenly pulled away, there’s no way you can make up that money,” Kerger said. “You will find big parts of the country that will suddenly be without public broadcasting.” The fate of public broadcasting is currently in flux, waiting for the end of Congress’ August recess for resolution. Currently, the House Appropriations Committee has approved the bulk of the PBS budget, while the House Budget Committee recommended doing away with funding altogether. Budget concerns aside, Kerger also addressed other unresolved PBS matters. The second seat of “PBS NewsHour” has been vacant since the untimely death of co-host Gwen Ifill in November 2016, leaving Judy Woodruff as the show’s sole anchor. “We have encouraged [executive producer] Sara Just and Judy Woodruff and the team at ‘NewsHour’ to take their time and think very carefully about who that right person [to replace Ifill] is,” Kerger said. “I’m hopeful that they will be making an announcement sometime over the next few months of a new anchor.” Kerger also announced an upcoming project aimed at inspiring the country to come together in celebration of literature. “The Great American Read” is an eight-part series launching in spring 2018 that explores the nation’s 100 best-loved books, chosen by the American people and culminating in the first-ever national vote to choose “America’s Best-Loved Book.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\n‘AMC Visionaries’ adds Eli Roth, Roots, Gibney for new docu-series By Meredith Woerner Robert Kirkman, left, and Eli Roth at the Television Critics Assn. summer press tour in Beverly Hills. ( Tommaso Boddi/Getty Images for AMC) AMC announced several additions to its upcoming “Visionaries” docu-series Saturday at the Television Critics Assn. summer press tour in Beverly Hills. Writer-director-actor Eli Roth (“Cabin Fever,” “Hostel”) will be offering a deeper look into his signature style of genre filmmaking with “Eli Roth’s History of Horror” (working title) and Ahmir “Questlove” Thompson, Tariq “Black Thought” Trotter (founding members of The Roots) and Alex Gibney (‘Going Clear,” “History of the Eagles”) will executive produce a series called “Rap Yearbook” (another working title). The cable network also has three other installments in development: “History of Video Games,” “Outlaws of the Internet,” and “History of Martial Arts.” The new “Visionaries” members join the previously announced programs “Robert Kirkman’s Secret History of Comics” and “James Cameron’s Story of Science Fiction.” Kirkman and Roth were present at the AMC panel with Cameron appearing via satellite to show sneak peeks from the comics and sci-fi iterations of the series. A sizzle reel for the “Secret History of Comics” utilized plenty of classic panel pages and a sort of motion comic-like animation to illustrate the early days of Marvel Comics, going all the way back to the Stan Lee and Jack Kirby days. But the real treat was a collection of cameos, famous faces opining about their love of the form including Lee himself, J.K. Simmons, Kevin Smith, and Method Man, who earnestly revealed, “You have to be born a comic book fan, I think.” And there are plenty more talking heads to come, the AMC press release promised Patty Jenkins, Lynda Carter, Famke Janssen, Michelle Rodriguez, and Todd McFarlane. The second clip shared a look at Cameron’s love letter to science fiction. “Today, science fiction is mainstream but it didn’t used to be that way,” the director explained. “When I was a kid science fiction wasn’t cool, but I thought it was cool.” Cameron wants to focus on closing the gap between current fans’ knowledge of modern day sci-fi to the pioneering works of literature that inspired the blockbuster offerings of today. The “Terminator” and “Avatar” director noted that without Jules Verne and H.G. Wells there would be no Avengers, “Star Wars” or his own works. The series will be divided by theme -- space travel, time travel etc.-- and include appearances from Paul W. Anderson, Roland Emmerich, Paul Verhoeven, Bryan Singer, Keanu Reeves, Jonathan Nolan, David Gerrold and D.C. Fontana. When asked how their respective series would showcase diversity -- the footage screened was very male-centric -- Kirkman responded that “History of Comics” would have two episodes devoted to diversity. One will focus on the women who helped Wonder Woman creator William Moulton Marston steer the course of the hugely famous female superhero, and another highlighting people of color titled “The Color of Comics.” The episode “explores the history of black characters, and the lack of black characters in the comic book industry,” said Kirkman. “which touches on the creation of Black Panther — the Marvel character — and does a really cool focus on this company called Milestone Comics that was founded by a group of African American comic book creators to create characters that appealed to them and represented them, because there was a huge lack of representation in comics even in the ‘90s.” “You wouldn’t have horror without Mary Shelley and ‘Frankenstein,’” Roth added. He cited the late George Romero as an example of how he wants to break down the themes within the horror genre. “At the height of the civil rights movement [Romero] puts an African American as the lead of ‘Night of the Living Dead’ and at the end of the movie he’s shot by a bunch of rednecks. Not because of the color of his skin, but because they think he’s a zombie. But you can read into the implications of that. What [Romero] was doing with using genre to explore racism was so ahead of its time. it’s just as potent today as it was 50 years ago. It’s absolutely something we’re going to be discussing.” Roth’s urgency to document the horror masters was apparent. It was the death of “Scream” moviemaker Wes Craven that inspired Roth to get involved in “Visionaries.” The panel then took a turn for the analytical when the creators were asked how their series would reflect the world today. “The fact that dystopian science fiction has come back, especially in television and in movies, is very important,” said Cameron. “It means that in the age that we live in right now the challenges that face us are technological. They’re science challenges: climate change, genetics, artificial intelligence, things like that. These are really on our horizon as major, existential threats.” “The best horror reflects what’s going on in our times,” said Roth. He used Jordan Peele’s “Get Out” — which addressed modern day racial tensions— as a reference. “It’s no accident that movie coming out right now is making over $200 million at the box office. You can tell it’s really resonating with people.” Bouncing off Cameron’s dystopia revelation, Roth then turned his lens onto the current political climate, “I don’t think we’ve ever seen a cast of characters like this in our White House that’s straight out of WWF wrestling in the ‘80s. When [Anthony Scaramucci] is coming out with things that would make ‘Rowdy’ Roddy Piper in his heyday blush. This is a farce, is this actually happening?” When will we start seeing this dystopian outlook on the current political climate in the movies? Possibly before Roth’s series, which will air sometime in 2018, after “History of Comics” and the “Story of Science Fiction” in 2017. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nPresident Trump got a fan letter from a young boy this week. Stephen Colbert introduced another young ‘fan’ Friday By Greg Braxton Stephen Colbert, host of CBS’ “The Late Show.” (Michael Loccisano / Getty Images) White House Press Secretary Sarah Huckabee Sanders took time during a White House briefing this week to read a fan letter to President Trump from a 9-year-old boy named Dylan who has the nickname of “Pickle.” Sanders read part of the letter to reporters: “You’re my favorite President ... I don’t know why people don’t like you.” Sanders interjected, “Neither do I, Dylan.” The letter continued, “You seem really nice. Can we be friends?” Sanders assured Pickle that she had spoken directly to Trump about him, and the president would “be more than happy to be your friend.” Stephen Colbert on Friday brought another young “fan” of Trump’s onstage Friday night to read her own letter during his CBS “Late Show.” “Dear President, my name is Norah, but everybody calls me ‘Mustard,’” the little girl recited. She continued, “You’re my favorite current president.” Norah then presented some probing questions to Trump: “I was wondering, does the attorney general enjoy your full support? And how do you plan to implement the ban on transgender people currently serving in the military? Will those on active duty be called home? Sounds like a logistical nightmare.” She continued, “One more thing: Are you a puppet of Vladimir Putin? I love puppets! I made one at camp! Love, Mustard.” The “Late Show” audience cheered. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nBroadway’s ‘Great Comet’ producer apologizes for controversial Mandy Patinkin casting By Nardine Saad (Jeff Schear / Getty Images) The producer behind Broadway’s struggling musical “Natasha, Pierre & the Great Comet of 1812\" has joined the apologetic refrain for the diversity uproar that followed the decision to bring in Mandy Patinkin to replace departing star Okieriete “Oak” Onaodowan, who is black. The production came under fire this week following its move to replace Onaodowan, who was in the original cast of “Hamilton,” with Tony Award winner Patinkin in a titular role. “As part of our sincere efforts to keep ‘Comet’ running for the benefit of its cast, creative team, crew, investors and everyone else involved, we arranged for Mandy Patinkin to play Pierre,” co-producer Howard Kagan said in an official statement posted Friday on Twitter. Kagan said they had the wrong impression of how Onaodowan felt about Patinkin’s casting and how it would be received by members of the theater community, “which we appreciate is deeply invested in the success of actors of color – as are we – and to whom we are grateful for bringing this to our attention.” “We regret our mistake deeply, and wish to express our apologies to everyone who felt hurt and betrayed by these actions,” he said. The legendary Broadway star dropped out of the musical on Friday after the announcement that he would be replacing the African American star was met with disdain. Patinkin was to join the cast for a limited run from Aug. 15 through Sept. 3, but declined the part because he “would never accept a role knowing it would harm another actor.” “I hear what members of the community have said and I agree with them. I am a huge fan of Oak and I will, therefore, not be appearing in the show,” the “Homeland” alum tweeted. Another tweet on the show’s account included an apology to Patinkin “for any misunderstanding” and said they understood his decision to withdraw from the show. Our deepest apologies. pic.twitter.com/Mks7XLGxbq — The Great Comet (@GreatCometBway) July 28, 2017 pic.twitter.com/vSZk6K2KOV — The Great Comet (@GreatCometBway) July 28, 2017 Onaodowan, who had replaced recording artist Josh Groban in the role of Pierre earlier this month, is scheduled to continue to perform through Aug. 13, after which, he stated Friday on Twitter, he will not return to the show. It is unclear if his decision to leave the production was his own or prompted by other factors. Show creator Dave Malloy, whose musical was inspired by a portion of Leo Tolstoy’s “War and Peace,” also apologized Friday on Twitter for “how everything went down” and missing the “racial optics” of their casting decision. They had previously asked actress Brittain Ashford to step aside for the casting of better-known singer-songwriter Ingrid Michaelson during the summer months and they didn’t anticipate that Patinkin’s casting would be viewed differently, Malloy said. Despite 12 Tony Award nominations, “Comet” only received two wins -- for set and lighting -- at the June ceremony and ticket sales ebbed when Groban departed. Malloy said that sales for shows after Aug. 13, when Michaelson’s run would also end, were “catastrophically low.” So they decided to cast Patinkin, hoping that his star power would help boost sales, because the “weird show” was in “desperate shape” and on the brink of closing. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nEagles, Doobie Brothers will play Classic Northwest show Sept. 30 in Seattle By Randy Lewis The reconfigured Eagles, shown during a July 15 performance at Dodger Stadium, will continue with a Sept. 30 Classic Northwest concert with the Doobie Brothers in Seattle. (Kevin Mazur / Getty Images) The Eagles’“Classic” music festival series will continue with at least one more stop, this time in Seattle. But unlike the inaugural Classic West bill July 15-16 at Dodger Stadium, which is having a Classic East encore this weekend in New York, the added Classic Northwest show on Sept. 30 will be just a single day and feature the Eagles and Doobie Brothers only. The Classic West and East shows teamed the Eagles, Steely Dan and Doobie Brothers on one day, with Fleetwood Mac, Journey and Earth, Wind & Fire on the second day of each. Tickets for the Classic Northwest bill go on sale Aug. 5 at 10 a.m. at Ticketmaster. At the outset of the Eagles’ portion of Classic West on July 15, co-founder Don Henley indicated it was still uncertain how much of a future his long-running band might have absent co-founder Glenn Frey, who died last year at 67. To make the Classic West and East shows possible, the group tapped Frey’s son, singer-guitarist Deacon Frey, and country music star Vince Gill to handle the lead vocals on the many Eagles songs that were originally sung by Glenn Frey. “In case this is our last dance,” Henley told the crowd at Dodger Stadium, where he was joined by longtime bandmates Joe Walsh and Timothy B. Schmit, “we want to thank all of you in Southern California for all your support.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nIn her new Hulu series, Sarah Silverman wants to love America -- seriously By Greg Braxton Executive producers Amy Zvi, left, and Adam McKay, star/executive producer Sarah Silverman and executive producer Gavin Purcell at Hulu’s “I Love You, America” panel at the TCA summer press tour. (Willy Sanjuan / Invision/Associated Press) From her stand-up act to her Comedy Central series to her Twitter account, comic-actress Sarah Silverman has a long history of courting laughs and controversy. Her outspokenness and sometimes absurd, sometimes acerbic views on everything from celebrity to culture to politics, particularly President Trump and his administration, have raised eyebrows. On her upcoming Hulu series, “I Love You, America,” Silverman is focused more on forming bonds than being provocative. In surveying the current political landscape and the comedy shows that skewer it, Silverman says she wants to reach out to all on the political spectrum. “For me, [those shows are] great, but they really connect with more like-minded people. They’re brilliant. They’re funny. But I’m hoping to, with this show, connect with un-like-minded people,” Silverman said Thursday during a panel at the Television Critics Assn.'s summer press tour in Beverly Hills. “The mission of the show is that we’re all the same. But what’s important is that it’s funny.” Although the exact format of the show is still being refined, Silverman did reveal some elements, including a monologue, a focus group in the studio and field pieces in which she travels around the country talking to people. For example, Silverman says she plans to go to Slidell, La., to meet a family that says they have never met a Jewish person. “I can’t help but have preconceived notions. They can’t help but have preconceived notions,” said Silverman. “All I can do is just try to be open and brave and go into the situation. And same for them.” Although Silverman and executive producer Adam McKay didn’t make any sharp criticisms about Trump at Thursday’s session, they did take exception to his attacks against so-called entertainment liberals or “the Hollywood elite.” “What is he talking about?” said Silverman. “I’m from ... New Hampshire. Everybody out here is from somewhere else.” The goal of the show will be to seek common ground and understanding, she said: “Ultimately we’re all the same. The thesis of the show is that everybody just wants to be loved.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nJerry Seinfeld is Forbes’ highest-paid comedian; Amy Schumer still only woman to crack the top 10 By Nardine Saad If Jerry Seinfeld is this year’s king of comedy, then Amy Schumer is the queen. The Comedy Central star once again landed on Forbes’ list of highest-paid comedians, the financial magazine announced Thursday. She was the first woman comic to crack the top 10 last year and remains the only woman on the list this year. The “Trainwreck” and “Snatched” star made an estimated $37.5 million between June 2016 and June 2017 thanks to her Netflix show “The Leather Special,” her memoir “The Girl With the Lower Back Tattoo” and endorsement deals with Bud Light and Old Navy. That ranked the raunchy comic No. 5 on the list filled with veteran comedy heavyweights. Meanwhile, the “Seinfeld” and “Comedians in Cars Getting Coffee” star shot back to the top of the list this year, earning an estimated $69 million. Seinfeld was eclipsed last year by Kevin Hart, who this year dropped to the No. 6 spot with $32.5 million. Chris Rock trailed Seinfeld for the second spot on Forbes’ list, earning $57 million. His record-breaking $20 million-per-special contract with Netflix paved the way for several comics, including Seinfeld, to cut lucrative deals with the streaming service, which is poised to become the go-to-destination for comedy specials. In addition to touring, those deals significantly padded the incomes of several stars on Forbes’ list. In the third and fourth spots, funnymen Louis C.K. and Dave Chappelle, who earned $52 million and $47 million, respectively, also made expensive deals with the streaming service to make their millions. To see Forbes’ complete list, click here. For the record, 10:40 a.m.: A previous headline and version of this story said that Schumer was the first woman to make the top 10 list this year. Schumer was the first woman to make the top 10 last year. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\n‘American Horror Story: Cult’ gets sickeningly sweet in official poster By Libby Hill We're just beneath the surface... #AHSCult pic.twitter.com/GvnMD1KieQ — AmericanHorrorStory (@AHSFX) July 27, 2017 What exactly is beneath the surface in “American Horror Story: Cult”? Bees, apparently. The seventh season of FX’s hit horror anthology series is slowly revealing itself via its official Twitter account. On Thursday, the series shared the official poster for the series, and it is super messed up. The poster features a deathly pale woman who happens to be missing the top of her head and, for that matter, her brain. Instead, the inside of her head is a honeycomb, replete with bees and, of course, honey. This is creepy for so many reasons. Here are a few: This poor woman has had the top of her skull removed, bringing to mind that particularly gruesome dinner scene featuring Anthony Hopkins and Ray Liotta in the 2001 film “Hannibal.” Even more horrifying is that this poor, sweet woman is definitely dressed like a clown. The white makeup, lines through the eyes and exaggerated ruby red lips suggest that “AHS: Cult” is drawing inspiration from traditional grotesque whiteface clown makeup. Think more Pennywise, less juggalo. (And if none of that is enough to scare you, please enjoy this clown dating site I stumbled across while researching all of this.) FX’s “American Horror Story: Cult” premieres on Sept. 5. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nStephen Colbert had some [bleeped] thoughts on Anthony Scaramucci’s NSFW rant By Yvonne Villarreal (Richard Boeth / Associated Press) Stephen Colbert took a cue from incoming White House communications director Anthony Scaramucci -- or the Mooch, as he’s called -- by giving Thursday’s episode of “The Late Show’” a decidedly NSFW vibe. “We got an incredible taste of unfiltered Mooch today,” Colbert said during his monologue. He was, of course, referring to Scaramucci’s disapproving -- and often vulgar -- comments about White House Chief of Staff Reince Priebus and chief strategist Steve Bannon in a New Yorker article that sent social media tongues wagging Thursday. But to even discuss the matter, Colbert had to issue a warning to CBS censors: “You’re going to want to break out the extra bleeps for this one,” he said before diving in. (If only we could get our ellipses to put in some overtime!) In his colorful conversation with New Yorker correspondent Ryan Lizza, which took place Wednesday night,Scaramucci was trying to get to the bottom of who leaked that he had dinner at the White House with President Trump, the first lady, Sean Hannity and the former Fox News executive Bill Shine. Scaramucci described Priebus as a “ ... paranoid schizophrenic” who had blocked him from the White House for six months -- prompting Colbert to break out an impression of Scaramucci. “Yes, the guy’s paranoid, OK? He thinks his own communications director is gonna stab him in the back again,” Colbert said with an exaggerated Italian accent. “Front stab!” he added with a knifing gesture. The New Yorker article also detailed how Scaramucci accused Bannon of seeking to “build [his] own brand off the … strength of the president” and made some other inflammatory remarks that we can’t fully detail. So we’ll let Colbert take it from here. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nLongtime Disney imagineer Martin Sklar dies at 83 By Richard Verrier (Jae C Hong / Associated Press) Martin “Marty” Sklar, the pioneering Walt Disney Co. imagineer who played an instrumental role in the design of Disney theme parks, has died, the company announced Thursday night. He was 83. During his 54 years at Disney, Sklar worked closely with Walt Disney and led the creative development of the Burbank company’s theme parks, attractions and resorts around the world, including the company’s ventures in the cruise business, housing development and the redesign of Times Square in New York. “Everything about Marty was legendary – his achievements, his spirit, his career,” Disney Chief Executive Robert Iger said in a statement. “He embodied the very best of Disney, from his bold originality to his joyful optimism and relentless drive for excellence. He was also a powerful connection to Walt himself. No one was more passionate about Disney than Marty and we’ll miss his enthusiasm, his grace, and his indomitable spirit.” Sklar was born in New Brunswick, N.J., and attended UCLA, where he was editor of the Daily Bruin newspaper when he was recruited to create the Disneyland News for Walt Disney’s new Anaheim theme park in 1955. After graduating in 1956, he joined Disney full-time and would become Disney’s lieutenant. He wrote speeches, marketing materials and a film showcasing Walt’s vision for Walt Disney World and the Epcot theme park in Florida. READ MORE> Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nIs a happily ever after coming to ‘The Mindy Project’? By Yvonne Villarreal “The Mindy Project” creator/executive producer/star Mindy Kaling with executive producers Matt Warburton, left, and Ike Barinholtz at the show’s Television Critics Assn. press tour panel. (Willy Sanjuan/Invision/AP) Is there a happily ever after written in the stars for the final season of “The Mindy Project”? Series creator Mindy Kaling, who also plays the titular heroine at the center of the Hulu comedy, took the stage Thursday at the Television Critics Assn. press tour in Beverly Hills to discuss the show’s swan song season. And when asked if Kaling’s rom-com-obsessed character, Mindy Lahiri, would get her storybook ending, the 38-year-old actress suggested it wouldn’t necessarily be in the way viewers expect. “I think that all of us would agree that we do have ‘happily ever after,’ the connotations of it,” said Kaling, who was joined onstage by executive producer and showrunner, Matt Warburton, and producer and star Ike Barinholtz (sporting a neck brace from a recent stunt gone wrong). But “happily ever after” isn’t the same as no loose ends, she said. “That everything is tied up neatly in a bow is something we aren’t super interested in.” “That side of it I think we’re trying to avoid,” Kaling added, “while also leaving the audience with the sense of feeling that it was about something and that it really was a ‘project’ and that she had some growth in the end.” And for fans wondering whether or how Danny Castellano (played by Chris Messina) would factor into all that, the season promises to shed some light on that. For the unitiated, Messina’s Danny is Mindy’s former fiance and the father of her child. Messina, who hasn’t been a series regular since Season 4, is set to return for multiple episodes. And while the Season 5 finale ended with Mindy marrying boyfriend Ben (Bryan Greenberg), hints were thrown that the new episodes would bring some clarity to the Mindy-Danny relationship. “The one thing we can promise the audience is a little bit of clarity about where they stand,” Warburton said. “It’s so great to see him back because we’ve always known they’re always going to be in each other’s lives … but it’s great to actually see what that means this season.” “It’s complicated,” added Kaling. “They’re both married to other people, so we went into that season with all of that, which makes things sort of fun and delicious.” Other familiar faces set to return for the final season are Mark and Jay Duplass, Adam Pally and Glenn Howerton. Kaling, in discussing the decision to end the series, promised a good finale. “The decision to end the show was our decision, and I think that’s always very hard,” Kaling said. “It was like, God, should this be the end? ... I think right now the idea of doing a prequel or something like that just felt — we just have such a good finale. We have such a good finale that we’ve known about for awhile.” The final season of “The Mindy Project” will start its rollout on Hulu in September. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nTiffany Haddish clarifies controversial Bill Cosby remarks: ‘I’m not afraid of the Big Bad Wolf’ By James Reed Actress Tiffany Haddish has clarified her remarks about wanting to work with Bill Cosby. (Christina House / For The Times) A joke that Tiffany Haddish recently told The Los Angeles Times has backfired on the breakout star of the new film “Girls Night.” Talking to The Times’ Tre’vell Anderson, Haddish credited Bill Cosby as a comedy inspiration, seemingly unfazed by the multiple sexual-abuse allegations levied against the beleaguered, 80-year-old TV legend. “I still want to work with Bill Cosby, I don’t care,” she told The Times earlier this month. “I’ll drink the juice. I’ll take a nap. I don’t give a damn. But seriously, I would love for him to play my grandfather in something.” Her remarks raised eyebrows and ire on social media, with some fans questioning her intentions and a New York magazine story noting that the actress “seems to have wandered into ‘problematic fave’ territory.” I've been rooting hard for Tiffany Haddish but I find nothing funny about her making light of Bill Cosby drugging women — Stephanie. (@qsteph) July 26, 2017 Twitter: \"We loved Tiffany Haddish in #GirlsTrip. Sweetie is doing amazing!\"\n\n\n\nTiffany Haddish: \"I'd love to work with Bill Cosby.\"\n\n\n\nTwitter: pic.twitter.com/X23DQWb2wi — hellresidentNY (@hellresidentNY) July 27, 2017 On Thursday, Haddish attempted to clarify those comments while speaking on a panel at the Television Critics Assn.'s summer press tour in Beverly Hills. “What I said was a joke,” she said, noting that when you’re expected to be funny in promotional interviews, there are risks. “You’re going to say some bad jokes.” Haddish said her point had been that “I’m not afraid to do anything. I’m not afraid of any kind of job. I’m not afraid to play any kind of girl as long as it doesn’t compromise my morals.... “I’ve been through things. I’ve been victimized,” she added. “I don’t agree with what he did or anything, but, at the end of the day, I’m not afraid of the Big Bad Wolf. That’s what I was trying to say, and I was trying to do it in a humorous way.” Times staff writer Sarah Rodman contributed to this report. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nTracy Morgan thanks God, and Tiffany Haddish reflects on her success at ‘Last O.G.’ panel at TCA By Sarah Rodman Tracy Morgan, left, Tiffany Haddish and Ryan Gaul of the new TBS comedy “The Last O.G.” at the TCA press tour in Beverly Hills on Thursday. (Frederick M. Brown / Getty Images) “Thank God.” That’s what Tracy Morgan had to say about what it means for the “30 Rock” and “Saturday Night Live” alum to be returning to TV three years after the devastating accident that put him in a coma and resulted in the death of his friend James “Jimmy Mack” McNair. The stand-up comic and actor, whose new TBS comedy, “The Last O.G.” premieres Oct. 24, was full of gratitude and thoughts on starting over during the presentation for the show at the Television Critics Assn. summer press tour Thursday in Beverly Hills. Executive produced by Morgan, Jordan Peele and John Carcieri, “The Last O.G.” chronicles the adventures of Tray (Morgan). Newly sprung from prison after serving 15 years, he has to acclimate to the changed times, his gentrified Brooklyn neighborhood and his former girlfriend (Tiffany Haddish of “Girls Trip”) raising the children he didn’t know existed with another man. “This is a show about humanity, this is a show about second chances, this is a show about redemption,” said Morgan, answering a question about whether it would explicitly explore African American issues. “I wanted to transcend that... I wanted to deal with humanity.” Haddish, naturally, fielded several questions about “Girls Trip,” the new comedy film that has minted her as a star. “I feel like a foster kid who’s been in the system for a long time and then turned 16 and somebody adopted them and said, ‘You can go to college and you ain’t got to pay no school loans or nothing,’ ” she said of how she’s been feeling in the wake of the film’s superb box office. “I’m happy! I’ve been accepted finally after all these years of hard work, blood, sweat and tears.” Haddish said she was looking forward to her role in “The Last O.G.” since it’s a character who has gone through a transition in her life, just as she herself has. Her fellow cast mates, including Cedric the Entertainer, good-naturedly ribbed her about becoming a diva since she’s now a movie star. But Morgan noted seriously that Haddish has been nothing but a pro: “She comes to work.” Haddish joked: “My bank account, it don’t show movie star yet. I’m waiting on it. They say nine months; it’s like a baby. I’m waiting for the delivery.” Morgan said it was important to surround himself with scene stealers such as Haddish and Cedric and was clearly earnest in his appreciation of his collaborators and their sensitivity to his physical needs. “They make sure I sit down... they don’t ask me, they [say] sit down for a little while. So I’m good. I’m taken care of by my people, and I love them with my heart.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nIt can be TGIF every day on Hulu: The service lands popular ABC programming block in SVOD deal By Yvonne Villarreal Every day can be Friday in the ‘90s with help from Hulu. The streaming service announced Thursday it has signed a deal with Warner Bros. Domestic Television Distribution for the exclusive streaming rights to programs that were part of the popular ABC programming block known as TGIF. The announcement was made during the streaming service’s day of panels at the Television Critics Assn. press tour in Beverly Hills. The shows under the deal include “Full House,” “Family Matters,” “Perfect Strangers,” “Step by Step” and “Hangin’ With Mr. Cooper.” Nabbing the rights to “Full House” is particularly noteworthy considering Hulu’s rival Netflix’s success with reviving the comedy, which is returning for a third season in September. With the Hulu deal, more than 800 episodes of the five sitcoms from the bygone family friendly lineup will be available beginning Friday, Sept. 29. “These shows are more than just beloved hits, they were part of a cultural tradition to tune in every Friday night,” said Craig Erwich, Hulu’s senior vice president of content in a statement. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nTV Academy announces which awards will be handed out during Primetime, Creative Arts Emmys By Nardine Saad Get your Emmys ballot ready — the Television Academy has announced which categories will be awarded during this year’s 69th Primetime Emmy Awards and the separate Creative Arts Emmy Awards. The main event will take place at the Microsoft Theater in Los Angeles on Sept. 17 and will be hosted by “The Late Show” star Stephen Colbert. Prizes will be awarded to comedy and drama series, limited series, reality competition, variety talk and sketch, television movie, acting, directing, and writing during the live telecast on CBS. HBO’s “Westworld” and NBC’s “Saturday Night Live” lead the nominees with 22 nods apiece, a total that includes several below-the-line categories to be doled out at the two Creative Arts Emmys ceremonies the week before. Honoring artistic and technical achievements that could make or break your play-at-home ballot, the Creative Arts Emmys will be held in the same venue on two consecutive nights on Sept. 9 and 10. They’ll be put together for one show, produced by Bob Bain, that will air on FXX on Sept. 16. The first night will cover categories that include animation, choreography, cinematography, costuming, make-up, hairstyling, documentary and nonfiction awards, editing, lighting, sound-mixing, technical direction, variety special and some writing awards. The second night will lean more heavily on front-of-the camera talent, awarding the likes of guest actors and actresses and stunt work, in addition to children’s programs, commercials, main title designs and theme music, music composition and supervision, prosthetic makeup and additional sound and editing categories. For a complete list of this year’s nominees, click here. Here’s the complete list of the awards being handed out during the Primetime Emmys telecast: COMEDY SERIES\n\nDIRECTING FOR A COMEDY SERIES\n\nDIRECTING FOR A DRAMA SERIES\n\nDIRECTING FOR A LIMITED SERIES, MOVIE OR DRAMATIC SPECIAL\n\nDIRECTING FOR A VARIETY SERIES\n\nDRAMA SERIES\n\nLEAD ACTOR IN A COMEDY SERIES\n\nLEAD ACTOR IN A DRAMA SERIES\n\nLEAD ACTOR IN A LIMITED SERIES OR MOVIE\n\nLEAD ACTRESS IN A COMEDY SERIES\n\nLEAD ACTRESS IN A DRAMA SERIES\n\nLEAD ACTRESS IN A LIMITED SERIES OR MOVIE\n\nLIMITED SERIES\n\nREALITY-COMPETITION PROGRAM\n\nSUPPORTING ACTOR IN A COMEDY SERIES\n\nSUPPORTING ACTOR IN A DRAMA SERIES\n\nSUPPORTING ACTOR IN A LIMITED SERIES OR MOVIE\n\nSUPPORTING ACTRESS IN A COMEDY SERIES\n\nSUPPORTING ACTRESS IN A DRAMA SERIES\n\nSUPPORTING ACTRESS IN A LIMITED SERIES OR MOVIE\n\nTELEVISION MOVIE\n\nVARIETY SKETCH SERIES\n\nVARIETY TALK SERIES\n\nWRITING FOR A COMEDY SERIES\n\nWRITING FOR A DRAMA SERIES\n\nWRITING FOR A LIMITED SERIES, MOVIE OR DRAMATIC SPECIAL\n\nWRITING FOR A VARIETY SERIES Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nKesha finds redemption in new song: ‘The past can’t haunt me if I don’t let it’ By Emily Mae Czachor For Kesha, “Learn to Let Go” is not just an aptly titled track off her upcoming “Rainbow” LP. “It’s become one of my mantras over the last few years,” she said in a remarkably uplifting letter that the singer published Thursday to accompany a new video for the song. (This is her new M.O., it would seem.) “Learn to Let Go,” which Kesha co-wrote alongside her mother, Pebe Sebert, is a heartrending chronicle of redemption. “Had a boogeyman under my bed/ Putting crazy thoughts inside my head,” she sings, while real home-video footage of a whimsical young Kesha cuts between clips of a grown Kesha frolicking through the forest. The chorus rings like a self-empowered anthem: “The past can’t haunt me if I don’t let it.” “My mom is always telling me how you have to learn to accept that you can’t try to control everything,” she wrote in the letter. “When you realize that you are not the one in control and you stop holding onto regrets ― it’s liberating. “Your past only has as much effect on your future as you want it to,” Kesha continued. “It’s about embracing your past, but not letting it define you.” Her new album, “Rainbow,” will be released Aug. 11. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nStephen Colbert to bring animated Trump series to Showtime By Meredith Blake Stephen Colbert has ridden anti-Trump sentiment to the top of the late-night ratings. Now he’s riding it all the way to premium cable. On Thursday, Showtime announced it had ordered 10 episodes of an as-yet-untitled animated series featuring cartoon renderings of the president, his family and inner circle. The satirical half-hour series, executive produced by Colbert and “The Late Show’s” show runner Chris Licht, will debut on Showtime this fall. According to the network, turnaround on the series will be quick in order to incorporate current events. “Stephen and Chris have an uncanny genius for deconstructing the world of President Trump, and this series opens a new realm for them,” Showtime President David Nevins said in a press statement. Tim Luecke, who co-created the animated version of Trump who frequently appears in “Late Show” bits — including a recent segment from the notorious presidential suite of the Moscow Ritz-Carlton — will serve as lead animator. The announcement caps off a period of good news for Colbert, who racked up six Emmy nominations this month and will be hosting the awards in September. The recently concluded “Russia Week,” in which the comedian traveled to Moscow and St. Petersburg, brought “The Late Show” its biggest margin over “The Tonight Show” since its premiere in 2015. While “The Late Show” airs on CBS, Colbert has also developed ties with his corporate cousins at Showtime. Many point to his riveting election night special “Stephen Colbert’s Live Election Night Democracy’s Series Finale,” which aired on the premium network, as a turning point after an uneven transition from “The Colbert Report.” For its part, Showtime has invested heavily in political content over the last 18 months, most notably the documentary series “The Circus,” from journalists Mark Halperin and John Heilemann. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nMatt Damon gets punched right in the face in George Clooney’s ‘Suburbicon’ trailer By Nardine Saad × Matt Damon, Oscar Isaac and Julianne Moore star in the trailer for George Clooney’s “Suburbicon.” In George Clooney’s latest directorial effort, “Suburbicon,” the pleasantries of a 1950s town are undone when a home invasion exposes the community’s criminal subculture and racial tensions. And Matt Damon’s Gardner Lodge gets stuck in the thick of it -- defending his young son, making death threats, killing mobsters and getting popped square in his bespectacled face at the office -- as seen in the first trailer that Paramount unveiled Thursday. Did we mention this is a comedy? The dark, screwball kind from the minds of screenwriters Clooney and frequent collaborators Ethan and Joel Coen and Grant Heslov? Well, it is, in case that wasn’t clear from the previous description. “These animals took everything from us,” a blood-splattered Gardner tells his son Nicky (Noah Jupe) at the dinner table. “I have to make decisions like what’s best for the family.” After Gardner’s wife is murdered, he invites “Auntie Margaret” (Julianne Moore) to come live in the manicured suburban community to help with his son. Meanwhile, he gets mixed up with a loan shark that sets him on the warpath of a formidable, coffee-swilling collector named Roger (Oscar Isaac). The film is based on a script that the Coen brothers wrote years ago that Clooney found, and they agreed to have him direct it, according to Moore. Paramount acquired the U.S. rights to the film, billed as a comedy, crime and mystery, at the Berlin Film Festival last year. It will be shown at the Toronto International Film Festival in September and hits theaters on Oct. 27. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nWoody Allen’s ‘Wonder Wheel’ to complete Amazon’s turn to full-service distribution By Mark Olsen Woody Allen at the American Film Institute’s Life Achievement Award tribute to Diane Keaton on June 8, 2017, in Los Angeles. (Christopher Polk / Getty Images for Turner) Thursday it was announced that Woody Allen’s latest film, “Wonder Wheel,” will have its world premiere as the closing-night film at this year’s New York Film Festival. The film stars Kate Winslet, Justin Timberlake, Juno Temple and James Belushi in a story set around Coney Island in the 1950s. But that wasn’t the only Allen item of the day. Variety reported that “Wonder Wheel” will also be the first film fully distributed by Amazon when it opens in theaters on Dec. 1. The company has already made fast inroads to the movie business, winning Academy Awards this year for “Manchester by the Sea” and “The Salesman,” but has up to now worked with established distribution partners such as Roadside Attractions or Bleecker Street to help get those movies into theaters. Amazon released Allen’s 2016 film, “Cafe Society,” starring Jesse Eisenberg, Kristen Stewart and Steve Carell, in partnership with Lionsgate. The online giant also released Allen’s six-part “Crisis in Six Scenes,” in which he starred alongside Elaine May and Miley Cyrus, late last year via the Amazon Prime Video streaming service. The move by Amazon is yet another way the company is distinguishing itself in relation to streaming rival Netflix. Where Netflix has been seen as pulling back from theatrical distribution, opting for either extremely limited or no theatrical release at all of its titles to drive viewers to its own platform, this latest push by Amazon renews its commitment to traditional theatrical releases. The New York Film Festival slot for “Wonder Wheel” gives Amazon the three marquee spots at the showcase. Previously announced, Richard Linklater’s “Last Flag Flying” will open the festival, and Todd Haynes’ “Wonderstruck,” which premiered at this year’s Cannes Film Festival, will show in the centerpiece slot. Other upcoming Amazon titles include Mike White’s “Brad’s Status,” starring Ben Stiller, and Luca Guadagnino’s remake of “Suspiria,” starring Dakota Johnson. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nMick Jagger releases two new, politically charged singles By August Brown (Dave Gatley / Los Angeles Times) Mick Jagger has been looking to the past on recent albums and festival dates. But a pair of urgent new singles are firmly set in the present. On Thursday, the Rolling Stones frontman released two tracks, “Gotta Get A Grip” and “England Lost,” that describe, as he put it in a statement, the “anxiety, unknowability of the changing political situation” in a post-Brexit U.K. The production is resolutely modern, built on programmed drums and clanging guitar noise. The London grime artist Skepta even joins him for a verse on “England Lost.” “Ostensibly, it’s about seeing an England football team lose, but when I wrote the title I knew it would be about more than just that. It’s about a feeling that we are in a difficult moment in our history. It’s about the unknowability about where you are and the feeling of insecurity,” Jagger said in a statement. “It’s obviously got a fair amount of humour because I don’t like anything too on the nose but it’s also got a sense of vulnerability of where we are as a country.” The “Girls” actress Jemima Kirke also stars in a new clip for “Gotta Get A Grip.” The songs are Jagger’s first new solo material since 2001’s “Goddess In the Doorway.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nKaty Perry to host 2017 MTV Video Music Awards By Libby Hill The MTV Video Music Awards are returning to California and getting a certified “California Gurl” to host. Katy Perry took to her Twitter feed Thursday to announce her upcoming gig hosting -- and performing -- at the VMAs in August. “I’ve been training with MTV in zero gravity, eating astronaut ice cream, and I’m on a group text with Buzz Aldrin and Neil deGrasse Tyson,” Perry said in a statement. “Come August 27th, I’ll be ready to be your MOONWOMAN! Brace for impact, kids.” Perry will kick off the evening as the first announced performer for the ceremony. On Tuesday, Perry earned five VMA nominations for her video contributions over the last year, tying with the Weeknd, with only Kendrick Lamar earning more. “We’re thrilled to have global phenomenon Katy Perry as the host and a performer at the 2017 VMAs,” said Bruce Gillmer, head of music and music talent for Global Entertainment Group, Viacom, in a statement from MTV. “She is at the forefront of music culture and the perfect person to anchor this year’s show, which promises to be one of the most diverse and music-filled in VMA history.” The 2017 MTV Video Music Awards will air from the Forum in Inglewood on Aug. 27. Find a full list of nominees here. Introducing your MOONWOMAN. Brace for impact! August 27th on @MTV @VMAs pic.twitter.com/WJsIYq7WiM — KATY PERRY (@katyperry) July 27, 2017 Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nTurns out Larry David and Bernie Sanders are related! By Yvonne Villarreal Turns out “Saturday Night Live” was on to something when it cast Larry David to play Sen. Bernie Sanders. During his freewheeling appearance Wednesday at the Television Critics Assn. press tour in Beverly Hills to promote the upcoming ninth season of HBO’s “Curb Your Enthusiasm,” David revealed that the resemblance is rooted in reality: Sanders is a distant relative. “He’s in the line ... like a third cousin, or something,” he said. The genealogical discovery comes courtesy of David’s appearance in an upcoming episode of the PBS series “Finding Your Roots.” “I was very happy about that,” David said. “I figured there was some connection.” David played Sanders on “Saturday Night Live” through the 2015-16 election cycle and also appeared alongside the senator on the late-night sketch show. It’s the kind of family secret that David isn’t ashamed to admit. “I love Bernie, yes,” David said. “I love Bernie.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nTrump’s proposed transgender military ban turns late-night into hostile territory By Libby Hill If there’s one upside to the Trump administration’s early-morning Twitter proclamations, it’s that it gives late-night shows all day to craft their reactions. Wednesday began with President Trump announcing a ban on transgender individuals serving in the United States military and ended with late-night hosts uniformly blasting the policy decision in hilarious fashion. On “The Late Show,” Stephen Colbert had plenty to say about Trump’s tweets, which ended with an uncharacteristic “thank you.” “Thank you?” Colbert responded, shocked, before offering his own profane two-word response to the president. Colbert went on to discuss what he saw as the greatest fallacy of the president’s reasons for banning transgender soldiers: increased medical costs. Though a 2016 study funded by the Pentagon found that military medical spending on transgender soldiers would increase anywhere from $2.4 million to $8.4 million, Colbert wanted to reframe those figures. “To put that number in perspective, the military spends five times as much on Viagra,” Colbert explained, “And if your erection lasts for more than four hours, that’s too bad, because you’re stuck on a submarine for the next six months.” On “The Daily Show” Trevor Noah had similar concerns about the president’s cost-related excuse, pointing out that taxpayers are paying $60 million for Trump to travel to his various properties throughout his presidency. Noah also pondered which of Trump’s generals he’d consulted with, given that the Pentagon was unaware of his proclamation, suggesting that perhaps he’d spoken with The General Online. “Late Night With Seth Meyers” also invoked the cartoon general from the car insurance commercials, when Meyers opted to turn discussion of Trump’s tweets over to four of his female writers. “Today it might be trans people, but tomorrow it’s gay people, and then the next day it’s black people, and after that it’s women, and then it’s immigrants,” the writers pointed out, all of those groups represented between them. On “The Tonight Show” Jimmy Fallon had the good sense to turn over a portion of his monologue to transgender comedian Patti Harrison, who had plenty to say about Trump’s Wednesday announcement. “When I saw the headline this morning, at first I just read, ‘Donald Trump bans transgender people,’ and I was like, ‘Yeah, that sounds like him,’” Harrison deadpanned. “But then I realized it was just in the military and I was shocked, because I assumed he already did that.” But it was James Corden who took a completely different take on the transgender military ban, opting for a stylish and heartfelt song and dance, expressing his love and appreciation for the LGBT community. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nPaul McCartney and Ringo Starr are ‘on the road again’ in new song collaboration By August Brown Ringo Starr’s new LP includes a collaboration with fellow former Beatle Paul McCartney. (Ethan Miller / Getty Images) Any time the surviving Beatles reunite on record is a historic occasion. But a new single from Paul McCartney and Ringo Starr packs in even more classic-rock star power. Starr’s new song “We’re on the Road Again” is one of several collaborations with his former bandmate on his new LP, “Give More Love.” The song also has guest appearances from Joe Walsh, Edgar Winter and Steve Lukather. It’s a slightly goofy ode to life on the road, as Starr boasts that, “We play really tight; we play really loud” and cheekily references his own song “Photograph.” The two Beatles last recorded together on Starr’s 2010 album, “Y Not,” and performed McCartney’s “Queenie Eye” at the 2014 Grammys. Starr announced the McCartney studio collaboration back in February, thanking the fellow Beatle in a Twitter post. Thanks for coming over man and playing Great bass. I love you man peace and love. 😎✌️🌟💖😇☮ pic.twitter.com/Z5kpyLLlkO — #RingoStarr (@ringostarrmusic) February 20, 2017 Set for release on Sept. 15, “Give More Love” will also feature cameos from Peter Frampton, Don Was, Richard Marx and Dave Stewart, among others. You can hear Starr’s new track with Paul McCartney via Rolling Stone. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\n‘Curb Your Enthusiasm’ returns this fall -- and you can expect a ‘Pirates of the Caribbean’ vibe? By Yvonne Villarreal Actor-creator-executive producer Larry David speaks at the “Curb Your Enthusiasm” panel during the Television Critics Assn. summer press tour at the Beverly Hilton. (Chris Pizzello / Invision/AP) Larry David revealed the real reason “Curb Your Enthusiasm” is at last returning after a six-year hiatus: People wouldn’t stop bugging him about it. The “Seinfeld” co-creator took the stage Wednesday at the Television Critics Assn. press tour in Beverly Hills -- joined by his “Curb” cohorts Susie Essman, Jeff Garlin and J.B. Smoove and executive producer Jeff Schaffer -- to discuss the show’s coming ninth season. So, why bring back the show now after all these years? “I’m not a misser,” David told reporters. “I don’t really miss things, people that much, but I was missing it. I thought, yeah, what the hell. And I got tired of people asking me if the show was coming back. I couldn’t get asked that question anymore and I wasn’t ready to say, ‘No, never.’” The often madcap and sometimes hilariously perplexing 30-minute panel -- led by David’s gruff wit and deadpans -- kicked off with a teaser for the season. There was David in a shower, David talking about constipation, David enduring the displeasure of middle-seat status on a flight. “The amount of uncomfortable situations [real Larry David] has been in these last six years,” Schaffer said, “you’re going to see it all. It’s like we’re sitting in the Ft. Knox of awkward.” As for TV Larry David, Schaffer said viewers will learn very quickly what he’s been up to during the years that have passed. “Once the show starts to air, it will be self-evident,” he said. “It goes to this really strange, fun, crazy place.... And you will never expect where it ends.” The trip to that ending begins Oct. 1 when the comedy returns to HBO. The 10-episode season brings back “Curb” favorites like Cheryl Hines, as well as frequent faces Richard Lewis, Bob Einstein, Ted Danson and Mary Steenburgen. And what would a long-awaited return be without some guest stars? Elizabeth Banks, Ed Begley Jr., Carrie Brownstein, Bryan Cranston, Lauren Graham, Jimmy Kimmel, Nick Offerman, Nasim Pedrad and Elizabeth Perkins will get in on the fun. For those who still need something to pin their hopes on about what this season will entail, Garlin offered this absurdly brilliant comparison. “It really thematically follows ‘Pirates of the Caribbean.’ ... It’s more like the last one than the first few.” Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAt TCA 2017, HBO defends ‘Confederate,’ announces Jon Stewart special and says ‘Deadwood’ movie is inching closer By Greg Braxton Casey Bloys, president of HBO programming, addresses reporters at the Television Critics Assn.'s summer press tour at the Beverly Hilton on Wednesday. (Chris Pizzello / Invision / Associated Press) HBO, which has the hottest show on television with “Game of Thrones,” recently came under fire with the announcement of a new series called “Confederate” from a team that includes “Game of Thrones” producers D.B. Weiss and David Benioff. The series revolves around events that lead to the “Third American Civil War” and examines an alternate reality in which the South seceded from the Union and thus, slavery is still legal. Casey Bloys, president of HBO programming, defended the project Wednesday during the premium network’s session at the summer edition of the Television Critics Assn. gathering at the Beverly Hilton. Bloys said that, in hindsight, the announcement was mishandled because it lacked the context and the vision that he received from Benioff and Weiss in discussing the series. He admitted it was “misguided” to believe they could simply announce a series with such a sensitive and volatile subject matter. “We could have done a better job with the press release,” he said. “There was no benefit of context.” “My hope is people will judge the actual material instead of what it could be or should be or might be,” he said. “We’ll rise or fall based on that material.” He added that he felt the series, rather than being divisive, would be able to advance “the racial discussion.” Although the topic is controversial, he said he and the producers of the show “all feel this is a risk worth taking.” Bloys also stressed that the depiction of slavery would not echo “Gone With the Wind” and would not include whips and plantations. In other major HBO news, former “Daily Show” host Jon Stewart will perform a stand-up special at a date and time to be announced, and host the latest “Night of Too Many Stars,” an all-star benefit for autism. Also, a movie reboot of HBO’s western “Deadwood” is closer to reality. Bloys said the show’s creator, David Milch, has completed a script that will please fans of the series while also being accessible to those less familiar with the show. But, he said, reuniting the large cast, which included Timothy Olyphant and Ian McShane, may prove challenging. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nTwo Jon Stewart comedy specials are coming to HBO By Yvonne Villarreal Jon Stewart, seen here presenting at the ESPYS, will return to HBO for his first stand-up special in two decades. (Chris Pizzello/Invision/AP) Jon Stewart will headline two stand-up specials for HBO. The news was announced Wednesday at the Television Critics Assn. press tour in Beverly Hills. The former “Daily Show” host will get a stand-up special — his first since since 1996’s “Jon Stewart: Unleavened” aired on the network. A date and location have not been confirmed. “We’re excited to bring Jon to the network with this pair of specials,” said HBO programming president Casey Bloys in a statement. “We’ve all missed his uniquely thoughtful brand of humor.” “I’m really thrilled to be able to return to stand-up on HBO,” added Stewart in a statement. ”They’ve always set the standard for great stand-up specials. Plus, I can finally use up the last of the Saddam Hussein jokes left over from my first special.” Stewart will also host the latest “Night of Too Many Stars,” the all-star benefit for Next for Autism, a nonprofit organization focused on people living with autism spectrum disorder. The special will air live this fall and will take place from the Theater at Madison Square Garden in New York. The specials are part of Stewart’s four-year deal with the premium cable network. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nAngelina Jolie talks about ‘difficult’ split from Brad Pitt By Nardine Saad A-lister Angelina Jolie is adjusting to the domestic growing pains of life as a single mom — making a proper breakfast, keeping house and picking up dog poop. “I never woke up and thought, I really want to live a bold life. I just can’t do the other. It’s the same as I can’t make a casserole. I cannot sit still,” she said in a sprawling new interview with Vanity Fair, in which she discussed her high-profile split from actor Brad Pitt. “I’ve been trying for nine months to be really good at just being a homemaker and picking up dog poop and cleaning dishes and reading bedtime stories. And I’m getting better at all three. But now I need to get my boots on and go hang, take a trip,” the humanitarian said of her plans to head to Africa for a mission with the preventing Sexual Violence Initiative. Angelina Jolie opens up about putting her family first, life after Brad, health issues & her most personal film yet https://t.co/nKyf4dO8ls pic.twitter.com/WkXCgWR1PV — VANITY FAIR (@VanityFair) July 26, 2017 The Oscar-winning actress explained how and when her marriage devolved, though she didn’t go into great detail about the breakup for the sake of their six kids. The marriage began suffering in the summer of 2016 while she was in post-production on her fifth directorial effort, “First They Killed My Father,” a film about Cambodia’s Khmer Rouge genocide, which hits Netflix in September. “Things got bad,” Jolie said. “I didn’t want to use that word. ... Things became ‘difficult.’” The director became slightly defensive at the mention of the family’s globe-trotting lifestyle, which reportedly had been grating on Pitt. \"[Our lifestyle] was not in any way a negative,” she asserted. “That was not the problem. That is and will remain one of the wonderful opportunities we are able to give our children. ... They’re six very strong-minded, thoughtful, worldly individuals. I’m very proud of them.” After 12 years together and a few years of marriage, Jolie filed for divorce from Pitt in September 2016. While her ex was couch-surfing, she and the kids spent nine months in a rental property before settling into a six-bedroom, 10-bathroom Los Feliz manse once owned by film legend Cecil B. DeMille. “It’s just been the hardest time, and we’re just kind of coming up for air. [This house] is a big jump forward for us, and we’re all trying to do our best to heal our family.” The divorce filing came suddenly “for the health of the family” on the heels of a spat Pitt had with their 15-year-old son, Maddox. They reached a divorce settlement privately in January after battling publicly for months over custody of the kids. The Oscar-winning producer had been vilified with accusations of child abuse and having an affair with his “Allied” costar Marion Cotillard. But he arguably won over public opinion with his introspective GQ Style interview in May in which he admitted to sobering up after “boozing too much.” Last year, Jolie was diagnosed with hypertension and developed Bell’s palsy when nerve damage caused one side of her face to droop. She took up acupuncture to treat it. “Sometimes women in families put themselves last,” she said, “until it manifests itself in their own health.” That’s just the latest in her medical history. Following a preventative double mastectomy in 2013, she had her ovaries and fallopian tubes removed in 2015, which sent her into menopause. “I can’t tell if it’s menopause or if it’s just been the year I’ve had,” she said, quipping about her dry skin and the idea that she could still be considered a sex symbol. “I actually feel more of a woman because I feel like I’m being smart about my choices, and I’m putting my family first, and I’m in charge of my life and my health. I think that’s what makes a woman complete.” For the record, Aug. 4, 12:55 p.m.: A previous version of this story said that “First They Killed My Father” would hit Netflix this month. It debuts in September. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nCaitlyn Jenner questions why Trump isn’t fighting for transgender service members By James Reed (Taylor Jewell / Invision/Associated Press) There are 15,000 patriotic transgender Americans in the US military fighting for all of us. What happened to your promise to fight for them? — Caitlyn Jenner, tweeting in response to President Trump’s transgender military ban announced Wednesday Read More Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nRobert Pattinson confirms he’s ‘kind of’ engaged to singer FKA Twigs By Nardine Saad (Mike Coppola / Getty Images for People) “Twilight” heartthrob Robert Pattinson says he’s “kind of \" engaged to singer FKA Twigs. The actor addressed the engagement rumors Tuesday in a direct response to shock jock Howard Stern’s questioning on Sirius XM’s “The Howard Stern Show.” “You’re engaged, right?” Stern said after calling the edgy English songstress his fiancée. “Yeah, kind of,” Pattinson, 31, responded uneasily. The “Good Time” star, whose relationships have been intensely scrutinized since he dated “Twilight” co-star Kristen Stewart at the height of the teen vampire frenzy, agreed that he’s been a bit protective of his romances. He’s been dating the “Water Me” singer, real name Tahlia Barnett, since 2014 and they’ve been rumored to be engaged since April 2015. Save for public appearances together, Pattinson has kept pretty mum about the relationship. “It’s one of the most frustrating things in the world because you want to be able to” show off a relationship, he told Stern. “You kind of get stuck in this position where you have to make decisions whether you want to let the kind of crazy people in.” Pattinson was referring to the “Twi-hards” or, as he called them, a “crack troupe of crazies” who believe every decision he makes is part of some big conspiracy. “To protect [the relationship] you kind of think, I want to create a big boundary between it. But then it makes it difficult for your actual relationship,” he said. Additionally, Pattinson also discussed the racial disparagement his fiancée faces on social media for dating him. He tries to tune out the hate when he can, but he isn’t always successful. “I think it’s like professional trolls,” he said of rude commenters. “They get so addicted to kind of just wanting to cause hurt and pain on someone and it’s just one of the most difficult things to know how to confront. It’s a faceless enemy. ... It might seem fake to them, but it’s definitely real in your life.” Pattinson said responding to hate can just be feeding into it. “It makes me feel less powerful if you’re trying to attack” and make it go away. “It’s like trying to attack a reflection in the water or something. You just look crazy,” he said. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nDavid Letterman cringes when late-night TV hosts refer to viewers as ‘fans’ By Emily Mae Czachor A profoundly bearded David Letterman made a rare talk-show appearance Monday -- one of just a handful of public ventures since the end of his run on “The Late Show” in 2015. Only this time, Letterman arrived as a guest. In an unusual turn of events, the former late-night host played interviewee on the season premiere of stand-up comedian Norm Macdonald’s podcast, “Norm Macdonald Live.” The longtime pals discussed a number of matters, from Letterman’s first-ever hosting gig (a game show called “Wordbusters”) to the time he found himself face to face with Richard Nixon. The two also discussed late-night TV’s changing landscape and how Letterman never felt comfortable thinking of himself as the star of his own show. “I could not possibly, and still don’t, consider myself a star, because I couldn’t refer to myself as a star,” Letterman said. “Johnny Carson was a star, there’s no question of that. So for me to adopt that -- ‘Starring Dave Letterman’ -- that was just ridiculous. “In the same way, I always cringe a little when people refer to the folks who watch their show as their ‘fans,’” Letterman added. “I just think that’s a little too … you know, you kind of just stepped over the line of basic humility there.” Macdonald commented on late-night’s packed roster of big-name hosts -- none of whom he finds particularly unique, except Conan O’Brien, who he thinks has “changed it up a little.” On any plans for a late-night return to the host seat, Letterman told fans not to expect too much. “I’ve done it for 30 years,” he said. “I don’t want to do it anymore.” Watch the full episode above (warning: some profanity). Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\nOlivia de Havilland, 101, files motion to expedite her ‘Feud’ lawsuit By Nardine Saad Olivia de Havilland at her Paris home in 2003. (Jean-Marc Giboux / Getty Images) Citing her advanced age, legendary actress Olivia de Havilland has filed a motion in her “Feud” lawsuit for a preferential trial date this fall. De Havilland’s attorneys filed in Los Angeles Superior Court on Tuesday, requesting that the jury trial be set in November or no later than 120 days of her motion being granted. The 101-year-old is hoping that a judge will fast track the trial during her Sept. 13 hearing date, which is just days before “Feud” is expected to be a big winner at the Primetime Emmy Awards. (The miniseries is nominated for 18 awards.) The “Gone With the Wind” star sued FX and “Feud” showrunner Ryan Murphy last month over her depiction in the miniseries about rival actresses Bette Davis and Joan Crawford. The two-time Oscar winner, who was played by actress Catherine Zeta-Jones on the show, makes legal claims about violations of her common law and statutory rights of publicity, her right to privacy and unjust enrichment. “Based on her unusually advanced age, resulting particular susceptibility to disease, and recurring health issues, there is a substantial likelihood that she, as with anyone at this advanced age, may not survive for any extended period of time,” the motion said. “It is likely that if a trial preference motion is not granted, Olivia de Havilland will be prejudiced, because on the normal schedule, trial would not be set within the next 120 days.” Her team also argued that because she is the sole plaintiff, De Havilland is crucial to the trial. “Olivia de Havilland has a substantial interest in the litigation as a whole here as her personal statutory right of publicity cause of action does not survive her death. ... Further, should Olivia de Havilland die before her trial date, she will not be able to enjoy the benefits which she would receive in damages,” the motion said. De Havilland’s June 30 lawsuit said the show damaged her “professional reputation for integrity, honesty, generosity, self-sacrifice and dignity.” She claimed that FX, Murphy and Fox producers never sought or obtained her permission to be depicted in the series and that Zeta-Jones’ portrayal of her in an episode about the 1963 Oscars cast her in a “false, hurtful and damaging light.” The defendants have not yet responded to de Havilland’s initial filing. According to Deadline, the Paris-based actress will not be attending the September hearing but may return to Hollywood if the trial is expedited to November. Olivia de Havilland 101: Everything you need to know as the movie legend celebrates her 101st birthday Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nAdvertisement\n\n‘Despacito’s’ Luis Fonsi, Daddy Yankee call out Venezuelan president for using song to push agenda By Nardine Saad Luis Fonsi, left, and Daddy Yankee. (Sergi Alexander / Getty Images) “Despacito” singers Luis Fonsi and Daddy Yankee and co-writer Erika Ender have condemned Venezuela’s President Nicolas Maduro for appropriating their international hit song for political gain. The chart-topping Puerto Rican recording artists and Panamanian songwriter on Monday called out Maduro, currently the subject of violent and sometimes fatal nationwide protests over his policies, for reworking their lyrics to appeal to voters during his weekly television show on Sunday. The revision promoted the leader’s plans for a controversial citizen’s assembly to be elected on July 30 and tasked with rewriting Venezuela’s 1999 constitution and bypassing the opposition-led legislature. “Our call to the Constituent Assembly only seeks to unite the country ... despacito,” Maduro’s version said. The term “despacito” means slowly in Spanish and in the original version of the song refers to the singer’s wooing techniques. Maduro’s supporters swayed to the remix dressed in matching T-shirts and baseball caps that brandished campaign slogans. the Associated Press said. The president was seen clapping along to the remix while the audience danced, according to the BBC. “I DO NOT AGREE WITH THIS,” Ender wrote in Spanish on Instagram, citing a news story about Maduro’s use of the song. “I cannot see so much pain in people I love so much. Warrior people, people with iron will. Good people, who are fighting for freedom of rights and expression. ... I love Venezuela, a land that has given me true brothers and sisters. Brothers who suffer because of the situation that exists.” Ender also lamented seeing the song she co-wrote be used without permission “to advertise campaigns linked to a regime that has sowed so much discontent and suffering.” View Instagram post “On repeated occasions, I have said how much I enjoy the versions of ‘Despacito’ that have been released on a global level. However there has to be a limit,” Fonsi also wrote in Spanish on Instagram. “I have never been consulted, nor have I authorized the use of or the change of lyrics of ‘Despacito’ for political means, much less in the middle of the deplorable situation in a country I love so much, Venezuela.” He added that his music is “for everyone who wants to listen to it and enjoy it, not to use as propaganda that tries to manipulate the will of the people who are crying out loud for their liberty and a better future.” View Instagram post Daddy Yankee took a much more blunt approach in his post, sharing an image of a news article about Maduro with a large red X superimposed on it. “What can you expect of a person who has stolen lives from young dreamers and people who are looking for a better future for their children?” the reggaeton rapper wrote in Spanish. “That you illegally appropriated ‘Despacito’ does not compare to the crimes you commit and have committed in Venezuela. Your dictatorial regime is a mockery not only for my Venezuelan brothers, but for the whole world. With that nefarious marketing plan, you will only continue to highlight your fascist ideology, which has killed hundreds of heroes and injured more than 2,000.” View Instagram post Millions of Venezuelans joined a general strike last week amid economic turmoil and a shortage of food and medicine in the country. Government opponents dealt a symbolic blow on Sunday to Maduro, casting votes in an unofficial referendum that rejected his plan for the constitutional overhaul. The government denounced the opposition balloting as illegal and seditious, according to The Times, but turnout appeared high at thousands of makeshift voting places set up throughout the country and abroad. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\nNetflix invests in Matt Groening’s ‘Disenchantment’ By Libby Hill Matt Groening is ready to take another crack at this television thing. The creator of “The Simpsons,” which debuts its 29th season on Fox this fall, has a new show courtesy of Netflix. The streaming service provider announced Tuesday that it had ordered 20 episodes of “Disenchantment,” an adult animated comedy series set in a deteriorating fantasy kingdom. The show centers around a hard-living young princess named Bean, voiced by Abbi Jacobson (“Broad City”), her elf companion, Elfo (Nat Faxon), and personal demon Luci (Eric Andre). “Ultimately, ‘Disenchantment’ will be about life and death, love and sex, and how to keep laughing in a world full of suffering and idiots, despite what the elders and wizards and other jerks tell you,” Groening said in a statement Tuesday. “Matt Groening’s brilliant work has resonated with generations around the world and we couldn’t be happier to work with him on ‘Disenchantment,’ ” Cindy Holland, vice president of original content for Netflix, said in a statement. “The series will bear his trademark animation style and biting wit, and we think it’s a perfect fit for our many Netflix animation fans.” The series joins Netflix’s “Bojack Horseman” in aiming for an audience unafraid of exploring the less-savory aspects of adulthood. “Disenchantment” will premiere on Netflix 10 episodes at a time, beginning in 2018. Facebook\n\nTwitter\n\nShow more sharing options Share Close extra sharing options Facebook\n\nTwitter\n\nLinkedIn\n\nEmail\n\nCopy Link URL Copied!\n\nPrint\n\n‘Broad City’ stars talk about the decision to bleep President Trump’s name on the show By Yvonne Villarreal Abbi Jacobson, left, and Ilana Glazer of the series “Broad City” speak at the Television Critics Assn. press tour at the Beverly Hilton on Tuesday. (Chris Pizzello / Invision/Associated Press) “Broad City” creators and stars Ilana Glazer and Abbi Jacobson consider the bleeping out of President Trump’s name from the comedy’s upcoming fourth season a different kind of joke. The two appeared onstage Tuesday at the Television Critics Assn. press tour in Beverly Hills to discuss the new season and how they reworked the show in the wake of Trump’s election. “We just got to a point where in real life we’re talking about the current administration, we’re talking about Trump — and it sounds so gross every day saying it so many ", "images": ["https://ca-times.brightspotcdn.com/dims4/default/1f8761b/2147483647/strip/true/crop/2048x1377+0+0/resize/1200x807!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F9b%2F7c%2Fcf5fd795bc70213c61e60ead3691%2Fimg-54822837-turbine-2035808-ca-1021-angela-lansbury-03-rrd-jpg-20141203", "https://ca-times.brightspotcdn.com/dims4/default/2a9fea1/2147483647/strip/true/crop/2048x1366+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa1%2F2b%2F058e7ce49e6265ceac4b50b7544b%2Fimg-597abac0-turbine-la-et-arnold-schwartzenegger-photo", "https://ca-times.brightspotcdn.com/dims4/default/fa6e8c5/2147483647/strip/true/crop/1024x668+0+0/resize/1200x783!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F22%2Fc0be934e96ceab715f0e0bc04e11%2Fimg-5977a26e-turbine-la-abbi-jacobson-left-and-ilana-glazer-20170725", "https://ca-times.brightspotcdn.com/dims4/default/4a43766/2147483647/strip/true/crop/682x1024+0+0/resize/1200x1802!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F23%2Fdf%2F5a96a18aa083f293dbaf7dafa5db%2Fimg-597f65d3-turbine-la-sam-shepard-20170731", "https://ca-times.brightspotcdn.com/dims4/default/32ec793/2147483647/strip/true/crop/1280x719+0+0/resize/1200x674!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F6b%2Fab%2F7548841dabe0040393bea17b63c6%2Fla-1500771308-2q33wqm1wm-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/f970df9/2147483647/strip/true/crop/2048x1457+0+0/resize/1200x854!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F71%2F0b%2F5df586c96dc77cd1c8fb480e346b%2Fimg-596f8405-turbine-la-chris-evans-20170719", "https://ca-times.brightspotcdn.com/dims4/default/9e98808/2147483647/strip/true/crop/750x422+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F86%2Fd5%2F24d096e49e87810199c89c8c9ed2%2F750x422", "https://ca-times.brightspotcdn.com/dims4/default/f4e279f/2147483647/strip/true/crop/750x422+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fcc%2Fa0%2F1b7ecb09f1a50c29b5b4e3a93174%2F750x422", "https://ca-times.brightspotcdn.com/dims4/default/825a441/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fae%2Fd0%2Fabdffd23a682f8bb9f9357528670%2Fla-1500834437-rggxtijc0n-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/c2d7f61/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F3b%2Fac%2F1a9f06254291b194e913ef0b8eb8%2Fla-et-shelley-duvall-close-photo", "https://ca-times.brightspotcdn.com/dims4/default/2516b54/2147483647/strip/true/crop/2048x2048+0+0/resize/1200x1200!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F01%2Fed%2F3fffc43b08826040a860232343a0%2Fla-et-ms-streaming-illo-20170705", "https://ca-times.brightspotcdn.com/dims4/default/e4e58e7/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F35%2Ff0%2F42f6639f42a09d0c9bb476645d45%2F1600x900", "https://ca-times.brightspotcdn.com/dims4/default/aa2cb84/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F15%2F8e%2Fdb4150d3d2a52d11a9db06be5dec%2Fla-et-mg-r-kelly-at-the-forum-20170717", "https://ca-times.brightspotcdn.com/dims4/default/aab8561/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F8c%2F5b%2Fd2a313987f490288a4eb86581998%2Fimg-59582158-turbine-la-1498947924-0ub6tc1gfi-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/801f8f3/2147483647/strip/true/crop/580x400+0+0/resize/1200x828!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fcd%2F7f%2F9d262b28ccfc49dd8f0c44eaee7c%2Fla-et-ms-daddy-yankee-20120806-001", "https://ca-times.brightspotcdn.com/dims4/default/68abd3e/2147483647/strip/true/crop/2048x1151+0+0/resize/1200x674!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F90%2Ffb%2F4af8f730ea9a5c1f3d99cab896b2%2Fla-1500921584-b8tlbx4ljs-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/23d2880/2147483647/strip/true/crop/2048x1280+0+0/resize/1200x750!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F97%2F5b%2Fadbec84950ab890d517d114c04fb%2Fimg-59776a15-turbine-la-1500998160-1dzm559wg8-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/5f50efd/2147483647/strip/true/crop/2048x1442+0+0/resize/1200x845!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F95%2F23%2Fca4f4dc4c05968c1fec7aa2392f2%2Fimg-53e94c69-turbine-la-et-st-emmys-2014-presenters-photos-20140808-024", "https://ca-times.brightspotcdn.com/dims4/default/e40680a/2147483647/strip/true/crop/800x450+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F23%2F8d%2Fb0d7eca582e60868557c3cc7d828%2F800x450", "https://ca-times.brightspotcdn.com/dims4/default/a974aa2/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F56%2F7c%2F7780e4b3535740cff076afa999b5%2Fimg-59726758-turbine-la-lynda-carter-20170721", "https://ca-times.brightspotcdn.com/dims4/default/93f5efe/2147483647/strip/true/crop/1700x1362+0+0/resize/1200x961!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F23%2Ffc%2F3edaa94c6b53c704affae6be4dfc%2Fimg-5975afd3-turbine-la-et-rolling-stones-mick-jagger-photo", "https://ca-times.brightspotcdn.com/dims4/default/afe5f8c/2147483647/strip/true/crop/2000x1215+0+0/resize/1200x729!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F9c%2F4b%2F5585150473f34e56c02fd7635c5f%2Fimg-5975e19c-turbine-la-et-norman-lear-photo", "https://ca-times.brightspotcdn.com/dims4/default/aeaaf02/2147483647/strip/true/crop/1870x1274+0+0/resize/1200x818!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fec%2F42%2F9905eb8b19350390cef18682b323%2Fimg-5962f338-turbine-la-et-richard-simmons-photo", "https://ca-times.brightspotcdn.com/dims4/default/de5d942/2147483647/strip/true/crop/1024x575+0+0/resize/1200x674!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F2d%2Fc7%2Fcf361299c5d5e8f4b5a7d0ebe7b7%2Fla-1501182184-1itm8b17y2-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/87507a9/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F24%2Fd3%2Fe78b486ed95cbfb1418d3a314cfb%2Fla-et-mg-blac-chyna-and-attorney-lisa-bloom-20170719", "https://ca-times.brightspotcdn.com/dims4/default/c892d4e/2147483647/strip/true/crop/1024x682+0+0/resize/1200x799!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fff%2F2e%2F10924ce6252e0cfbbd5626028242%2Fimg-59762eb6-turbine-la-iggy-pop-at-fyf-fest-20170724", "https://ca-times.brightspotcdn.com/dims4/default/379800f/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F47%2Fd4%2F08100a99ee71603763e751a708d4%2Fla-1500784311-bp6fcfupqu-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/6935af3/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F05%2F2b%2F6538d2df390dbb41d69c2a87ba03%2Fla-et-ms-missy-20170722", "https://ca-times.brightspotcdn.com/dims4/default/84d8b92/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "https://ca-times.brightspotcdn.com/dims4/default/75644c0/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc0%2F70%2F84bf35a2ee7b7fc6ddc4de8ec206%2Fla-et-mg-donnie-wahlberg-of-new-kids-on-the-block-20170713", "https://ca-times.brightspotcdn.com/dims4/default/37e6854/2147483647/strip/true/crop/2048x1361+0+0/resize/1200x797!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd0%2F29%2F6251945ce261fb9a6336fbfbb7e7%2Fimg-597ea957-turbine-la-1501473106-tps8p1bkde-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/b0ecccb/2147483647/strip/true/crop/2048x1366+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd5%2Fc1%2F38bb49d77bff755843373b8ee059%2Fimg-597f53da-turbine-la-et-sam-shepard-obit-pictures-20170731", "https://ca-times.brightspotcdn.com/dims4/default/1ced673/2147483647/strip/true/crop/2048x1503+0+0/resize/1200x881!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F52%2F78%2Fe1eef1a42d42d7639193105d5165%2Fimg-5968fd97-turbine-la-dmx-20170714", "https://ca-times.brightspotcdn.com/dims4/default/b198bec/2147483647/strip/true/crop/2000x1333+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F1f%2F54%2F7f586da4c895326509d1aa3fdcc7%2Fla-et-ms-live-kendrick-lamar-brings-kunta-s-groove-session-to-the-wiltern-20151112", "https://ca-times.brightspotcdn.com/dims4/default/db6538b/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F8a%2F8b%2Fa7b0e95863fe96fcbf31ba83c05b%2Fimg-5966cdaa-turbine-la-et-actor-joe-dempsie-photo", "https://ca-times.brightspotcdn.com/dims4/default/89e78a4/2147483647/strip/true/crop/1463x2048+0+0/resize/1200x1680!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F6f%2Fb3%2F6688cad7dd4b98d2a8bc2f9ff9a2%2Fimg-5970c2a7-turbine-la-lena-dunham-20170720", "https://ca-times.brightspotcdn.com/dims4/default/64286de/2147483647/strip/true/crop/682x1024+0+0/resize/1200x1802!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F92%2F8e%2Fda8a99dfd26d69c2c6c59a43340f%2Fimg-595a949f-turbine-la-jim-morrison-of-the-doors-at-hollywood-bowl-in-1968-20170703", "https://ca-times.brightspotcdn.com/dims4/default/4e3cbc8/2147483647/strip/true/crop/2048x1175+0+0/resize/1200x688!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F1e%2Fb1%2F63ba16686002f121b30836dfcebb%2Fimg-597644e4-turbine-la-bbc-20170724", "https://ca-times.brightspotcdn.com/dims4/default/8765f71/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff1%2Fd9%2Faf1ec612a39eed47945ccd2f29eb%2Fimg-5963212e-turbine-la-et-patrick-stewart-photo", "https://ca-times.brightspotcdn.com/dims4/default/65eea5a/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F37%2F3e%2F92e18226f13d8509106dc7f16907%2Fimg-596be57b-turbine-la-1500243318-7ljurx6abo-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/9b1d25f/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd5%2F34%2F6f526f4d20390ad33e5c3d8f9153%2F1600x900", "https://ca-times.brightspotcdn.com/dims4/default/92629fc/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F81%2F0f%2F7b041ead0b638a4b228baef930f9%2Fimg-5900b3f1-turbine-la-1493218283-kmb1ceq4tp-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/4bbafe3/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F6f%2Fc4%2F1859fb383018ea8eac5362cb5753%2Fimg-596f44fe-turbine-la-et-selena-gomez-photo", "https://ca-times.brightspotcdn.com/dims4/default/a1ac8d9/2147483647/strip/true/crop/650x520+0+0/resize/1200x960!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F45%2F90%2Fce53dbadb064841e3771b1aebe81%2Fimg-596f8296-turbine-la-aaron-carter-20170719", "https://ca-times.brightspotcdn.com/dims4/default/36d8aed/2147483647/strip/true/crop/1024x576+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F6a%2F7e%2F496aaedc9a5cf7183407344af47a%2Fimg-538e6bbb-turbine-la-rr-carolina-miranda-to-lead-new-culture-blo-001", "https://ca-times.brightspotcdn.com/dims4/default/4acc159/2147483647/strip/true/crop/1024x575+0+0/resize/1200x674!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F26%2F36%2F01ec7db5186ad463b5787b9c12a8%2Fla-1501203334-kx1snv8sm6-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/5df864f/2147483647/strip/true/crop/750x422+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fbb%2F00%2Fd24a33047a880b253ad7cd513b9f%2F750x422", "https://ca-times.brightspotcdn.com/dims4/default/2842ad1/2147483647/strip/true/crop/2048x1408+0+0/resize/1200x825!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fb9%2F12%2Fd76618f2e7662d0d0d95b6e8fad1%2Fla-et-luisfonsi-daddyyankee-despacito-20170725", "https://ca-times.brightspotcdn.com/dims4/default/97e7fac/2147483647/strip/true/crop/2000x1453+0+0/resize/1200x872!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F46%2Fc1%2F4743b4ba10b274483a122db699d2%2Flat-tour8-lw3ynvpd20111228151650", "https://ca-times.brightspotcdn.com/dims4/default/9dc3fcb/2147483647/strip/true/crop/2048x1333+0+0/resize/1200x781!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F6a%2F12%2F06f896c99cd33825684d7ff532f8%2Fla-et-mn-american-film-institute-s-45th-life-achievement-award-gala-tribute-to-diane-keaton-roaming-show-20170727", "https://ca-times.brightspotcdn.com/dims4/default/06f795e/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F37%2F19%2F7ae163267efbaceef0af1161e460%2Fla-et-hc-amc-eli-roth-robert-kirkman-20170729", "https://ca-times.brightspotcdn.com/dims4/default/a1876fb/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fe0%2Feb%2Fd64de3a0c3fcbcda127556222115%2F1600x900", "https://ca-times.brightspotcdn.com/dims4/default/444e90d/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fea%2F79%2F5197211daf6f744fcc323df42ad4%2Fimg-595365e2-turbine-la-et-lindsay-lohan-photo", "https://ca-times.brightspotcdn.com/dims4/default/3bcfa68/2147483647/strip/true/crop/2048x1331+0+0/resize/1200x780!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F73%2F56%2F1b455d5c49cf101bc6d70f868a1a%2Fla-et-ms-van-morrison-shrine-auditorium-review-001", "https://ca-times.brightspotcdn.com/dims4/default/58ae65b/2147483647/strip/true/crop/2048x1221+0+0/resize/1200x715!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F75%2F7a%2F78901bb540b82c67b71103364bbc%2Fimg-561fff20-turbine-mj", "https://ca-times.brightspotcdn.com/dims4/default/4db5f7f/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F7f%2F0d%2F67eb776cc998756d27766b5ef4bf%2Fimg-597abdb6-turbine-la-et-jk-rowling-photo", "https://ca-times.brightspotcdn.com/dims4/default/f246a2a/2147483647/strip/true/crop/1024x727+0+0/resize/1200x852!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdd%2Ff5%2F16482fddeef394e737b47749ee75%2Fimg-59727c5f-turbine-la-daniel-radcliffe-2012-20170721", "https://ca-times.brightspotcdn.com/dims4/default/f7e694f/2147483647/strip/true/crop/2048x1421+0+0/resize/1200x833!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F15%2Fcf%2F09b2e89dbc6500d8550dd875222a%2Fla-et-ms-ringo-20170707", "https://ca-times.brightspotcdn.com/dims4/default/c4f80a9/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fb9%2Ff7%2F7945bf42cae5d182ebc69bed274b%2Fla-1500506430-0hz4zfuzvl-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/7e6fdf9/2147483647/strip/true/crop/1649x1600+0+0/resize/1200x1164!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fff%2F0c%2Fe4cc64798d0469ba7b6929dbc2e7%2Fimg-5951cf63-turbine-la-et-olivia-de-havilland-photo", "https://ca-times.brightspotcdn.com/dims4/default/a3896ff/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F7b%2F2d%2Fff7ede243ec6de538bc06a35b011%2Fla-et-mg-andrew-garfield-at-the-2017-oscars-20170706", "https://ca-times.brightspotcdn.com/dims4/default/94e6c3a/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F87%2F0e%2F984f34273cc10aa33692f3149c18%2Fla-et-martin-sklar-2-photo", "https://ca-times.brightspotcdn.com/dims4/default/ac10c36/2147483647/strip/true/crop/2048x1344+0+0/resize/1200x788!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F58%2Fee%2Fe674e4de60fd83e81fede9930d3d%2Fimg-595f599d-turbine-la-et-tab-hunter-photo", "https://ca-times.brightspotcdn.com/dims4/default/c07917e/2147483647/strip/true/crop/2048x1287+0+0/resize/1200x754!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F26%2F33%2F1b5856da4a17aabc7b5d4409711e%2Fla-et-mg-chrissy-teigen-raw-cashew-nut-2014071-002", "https://ca-times.brightspotcdn.com/dims4/default/f6e79ef/2147483647/strip/true/crop/1024x575+0+0/resize/1200x674!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F36%2Fe1%2Ff420e6300aa225aa1678b7e3acea%2Fla-1501112873-i87fnkdgmf-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/04fe83b/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F99%2F40%2Fdf66a388b141dabf609b0892e342%2Fimg-595f0aa1-turbine-la-et-courtney-love-20170706", "https://ca-times.brightspotcdn.com/dims4/default/054224a/2147483647/strip/true/crop/1024x682+0+0/resize/1200x799!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F8f%2F73%2Fbd78301ce00aa43148851b03a774%2Fimg-595e658c-turbine-la-kesha-sebert-20170706", "https://ca-times.brightspotcdn.com/dims4/default/f683df6/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fe8%2Fec%2F9c216be2f6d57a12ff2db65fd6f6%2Flat-et-alicecooper-la0036625836-20170724", "https://ca-times.brightspotcdn.com/dims4/default/8d3d5d1/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F67%2F33%2F5b858684918ddb6d40261de7b785%2Fla-et-mg-maria-menounos-at-the-2015-sag-awards-20170721", "https://ca-times.brightspotcdn.com/dims4/default/3db7a3a/2147483647/strip/true/crop/2048x1388+0+0/resize/1200x813!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Faf%2F40%2Fc81cc5ee025ad026235feccffd35%2Fimg-595d310b-turbine-la-musician-beck-hansen-in-1994-20170705", "https://ca-times.brightspotcdn.com/dims4/default/3c6c895/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F24%2F93%2Fa1fc86af2f2ebfcbd17c4649e1d8%2Fla-1501121192-vzz0gpr1wk-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/e1c5e7e/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F03%2Fef%2F30999891c5f618a78a8dd9c15dd4%2Fimg-58017c39-turbine-la-1476379565-snap-photo", "https://ca-times.brightspotcdn.com/dims4/default/417b52f/2147483647/strip/true/crop/2048x1369+0+0/resize/1200x802!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F0b%2Ff2%2F45094b4482797dde9d2b9337c50a%2Fimg-5964e879-turbine-la-1499785330-qy00vzc1f3-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/1b5b728/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F29%2Fc1%2Fe92b289ac0666927e3800942a6be%2Fimg-59641908-turbine-la-et-linda-ronstadt-photo", "https://ca-times.brightspotcdn.com/dims4/default/90714cb/2147483647/strip/true/crop/2048x1151+0+0/resize/1200x674!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F24%2F14%2F1fea41ae6432d5a56d5bcf5a5f5c%2Fla-1500751109-1dogs00lng-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/100f3d9/2147483647/strip/true/crop/2048x1279+0+0/resize/1200x749!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fbb%2Fbb%2Fed87cc40f75943d9a9a8fd4bd8b2%2Fimg-596d19ec-turbine-la-1500322280-ue0lbnkdcr-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/3ce0f18/2147483647/strip/true/crop/2000x1125+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F30%2Fbc%2F0149c42a3d3ebfbe5e60aaed1fa2%2Fimg-594439f8-turbine-la-et-michael-phelps-great-white-shark-20170616", "https://ca-times.brightspotcdn.com/dims4/default/b3ad51c/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F9f%2F74%2F60caceb09a35e6873ec57fd4759b%2Fimg-58a0dc02-turbine-lat-et-grammys-red-carpet-tb1-la0047711441-20170212", "https://ca-times.brightspotcdn.com/dims4/default/34ec03d/2147483647/strip/true/crop/1024x680+0+0/resize/1200x797!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F83%2F54%2Fec1d7ccc68c9a941c10ff8d93fac%2Fimg-595fd43e-turbine-la-jay-z-blue-ivy-carter-and-beyonce-20170707", "https://ca-times.brightspotcdn.com/dims4/default/bf72da5/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F85%2Fd6%2F05739f60e2eb3db4452814bc23db%2Fla-1500759723-4vl0tcnypu-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/145858b/2147483647/strip/true/crop/2040x1485+0+0/resize/1200x874!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F3e%2F9d%2Ffdb3826729ccbd6d82f7389d522a%2Fimg-59727154-turbine-la-illeana-douglas-20170721", "https://ca-times.brightspotcdn.com/dims4/default/d8a3a6a/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd8%2F7e%2F15c54bec724d0bcebf369d974d8d%2Fla-et-mg-jessica-alba-and-cash-warren-20170718", "https://ca-times.brightspotcdn.com/dims4/default/b8324fd/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ffe%2Ff9%2F2f1de1de58cc8954bca9e5915eb3%2Fla-et-mg-nelsan-ellis-in-2016-20170710", "https://ca-times.brightspotcdn.com/dims4/default/6cb2af0/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa4%2F8d%2F012ed7ec79f656b3b1963967f7c7%2Fimg-595636eb-turbine-la-et-eva-marie-saint-photo2", "https://ca-times.brightspotcdn.com/dims4/default/0827388/2147483647/strip/true/crop/1200x800+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2Fb9%2F9d9a886b094c92c7569065d1a0e5%2Fla-et-mg-mandy-patinkin-sag-awards-2014-homela-001", "https://ca-times.brightspotcdn.com/dims4/default/e6fd237/2147483647/strip/true/crop/2000x1536+0+0/resize/1200x922!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F4a%2F56%2Fc29194ee2fd62afa8fc31745cafd%2Fimg-595f1cb1-turbine-la-et-vergara-photo", "https://ca-times.brightspotcdn.com/dims4/default/1d58941/2147483647/strip/true/crop/2048x1541+0+0/resize/1200x903!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fcb%2F97%2Fc7d840ce5319455c73a162ec79b8%2Fimg-595fb60d-turbine-la-jay-z-20170707", "https://ca-times.brightspotcdn.com/dims4/default/cf53dd6/2147483647/strip/true/crop/2048x1361+0+0/resize/1200x797!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F64%2F46%2Fdc88df38f5142aab5765dc0cbbbf%2Fla-stephen-colbert-20170627", "https://ca-times.brightspotcdn.com/dims4/default/c8cf7c4/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fb3%2F69%2F8d0d52cce3e90f384ec89aaf6eb6%2Fimg-5968ae73-turbine-la-et-donald-sutherland-photo", "https://ca-times.brightspotcdn.com/dims4/default/8ad9269/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F6a%2F16%2F9a4110ebd12183420f1779f94319%2Fimg-580917ff-turbine-la-1476991189-snap-photo", "https://ca-times.brightspotcdn.com/dims4/default/7b868cf/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F8c%2Fb0%2F04709d0505d58cffdc58093e197f%2Fla-1500784789-kmsir3y5ti-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/bbb8ad9/2147483647/strip/true/crop/650x366+0+0/resize/1200x676!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fcf%2Fa8%2F165f5719214ff1050e0f196debc4%2F650x366", "https://ca-times.brightspotcdn.com/dims4/default/67feff0/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F2a%2F1a%2F5ef676958c8c0718b065d1ec700b%2Fimg-59689e46-turbine-la-et-will-ferrell-photo", "https://ca-times.brightspotcdn.com/dims4/default/7edaf20/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fe8%2F58%2F0a33f97ebbbcf4a3e027a6332800%2Fla-et-mg-steve-whitmire-with-kermit-the-frog-20170713", "https://ca-times.brightspotcdn.com/dims4/default/74af44c/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F06%2Fb4%2F8cf4000461b85fa60a43a7ae847f%2Fla-et-mg-jada-pinkett-smith-20170720", "https://ca-times.brightspotcdn.com/dims4/default/700f5f6/2147483647/strip/true/crop/1600x899+0+0/resize/1200x674!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff3%2F6d%2F967af9d56fc38f5a17d8a91a6ec8%2Fimg-595817d8-turbine-la-1498945493-pzvw2sktyq-snap-image", "https://ca-times.brightspotcdn.com/0e/c6/b86a8b4b43a793259deb28a32a56/latlogoinverse.svg", "https://ca-times.brightspotcdn.com/dims4/default/0626c00/2147483647/strip/true/crop/2048x1151+0+0/resize/1200x674!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fe1%2F64%2Ffd5734a8c6f7e4942a42420197a5%2Fimg-58598704-turbine-la-dlewis-1482262318-snap-photo", "https://ca-times.brightspotcdn.com/dims4/default/093fa71/2147483647/strip/true/crop/1024x575+0+0/resize/1200x674!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F99%2F7f%2Faec6620cd67776c86eadeafe9099%2Fla-1500824281-swq0lm07ih-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/2de8e31/2147483647/strip/true/crop/2048x1320+0+0/resize/1200x773!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F18%2Ff9%2F2f81aab92bf35b31b61515895767%2Fla-1501612765-0prawfoefq-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/8d2d43c/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd7%2F4f%2F076f5dcf43e8c8c15a385810dedc%2Fla-1495275132-zcncmwyooi-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/9502f21/2147483647/strip/true/crop/2048x1280+0+0/resize/1200x750!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F9c%2F22%2Fc4581f0fecdc907cec95c19ecc9e%2Fimg-595e4bea-turbine-la-1499352037-8aoswzy3zi-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/2804d96/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F31%2F0d%2Fdb65c209029a7ff684eae4125bc3%2Fla-1500702805-gbjdayz5i3-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/2d0e26d/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F64%2F37%2F78a948138c17379eee8df9ca780a%2Fla-et-mg-loretta-lynn-20170712", "https://ca-times.brightspotcdn.com/dims4/default/1023479/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F96%2F0f%2F9ad549477b6ce6cbbecaaafc31f3%2Fla-1500697317-xf1p9ba9hj-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/a249b87/2147483647/strip/true/crop/2048x1151+0+0/resize/1200x674!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fec%2F9e%2Fe442d92efb85e8ef62b56e83b219%2Fla-1500769274-sk6i87h731-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/d9ef8c7/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F81%2Fe9%2Fa8686c7bc9927daba5afc652d75c%2Fimg-5957cebc-turbine-la-1498926777-3b28dxgpdq-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/a64f662/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F73%2F51%2F1d87f3ed6216bd93b7970054bc5f%2Fla-et-mg-david-benioff-and-d-b-weiss-20170719", "https://ca-times.brightspotcdn.com/dims4/default/5c920c7/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fc6%2F44%2F01592e9af1d91702ea873c8b3153%2Fla-1475855061-snap-photo", "https://ca-times.brightspotcdn.com/dims4/default/ca539ac/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F14%2Fa3%2F63f91c786e6512d756f558f76fbf%2Fla-et-ms-fyf-20170724", "https://ca-times.brightspotcdn.com/dims4/default/dc58f0d/2147483647/strip/true/crop/2031x1360+0+0/resize/1200x804!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa8%2Fcf%2F3f3fe3f306202d565d81e5503b67%2Fimg-595a1296-turbine-la-et-sly-stallone-photo", "https://ca-times.brightspotcdn.com/dims4/default/340b8ed/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F4d%2F0e%2Fe28b91c2446a4de5126c06160084%2Fla-1501108964-7638bkmhmu-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/d3cda98/2147483647/strip/true/crop/2048x1621+0+0/resize/1200x950!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F0c%2F78%2F4c8fb8a235e2062efec566702ac8%2Fimg-59693955-turbine-la-stephen-belafonte-left-melanie-brown-right-20170714", "https://ca-times.brightspotcdn.com/dims4/default/3f7283b/2147483647/strip/true/crop/2048x1290+0+0/resize/1200x756!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F02%2F2d%2F134c1e182c1142a38d4f8a0f8f8e%2Fla-et-cm-woody-allen-jazz-los-angeles-20150809", "https://ca-times.brightspotcdn.com/dims4/default/de22d20/2147483647/strip/true/crop/740x518+0+0/resize/1200x840!/quality/80/?url=https%3A%2F%2Flatimesherocomplex.files.wordpress.com%2F2010%2F12%2Fguillermo-del-toro.jpg", "https://ca-times.brightspotcdn.com/dims4/default/797997c/2147483647/strip/true/crop/1024x710+0+0/resize/1200x832!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F0b%2F87%2F504e4bd8207b69388bd29e69ee8d%2Fimg-5967aa36-turbine-la-peyton-manning-espys", "https://ca-times.brightspotcdn.com/dims4/default/475a789/2147483647/strip/true/crop/2048x1423+0+0/resize/1200x834!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F04%2F2f%2Feebe6ecd0346986157392a638ad7%2Fimg-597e309a-turbine-la-1501442195-ry7kao51pj-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/268869c/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F59%2Fb6%2F03f5076d7b6af157e983e06460e0%2Fla-1472223965-snap-photo", "https://ca-times.brightspotcdn.com/dims4/default/6acc7a2/2147483647/strip/true/crop/1000x563+0+0/resize/1200x676!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fec%2F1e%2Fa6a8cc5de1560774e9739f7eebd1%2F1000x563", "https://ca-times.brightspotcdn.com/dims4/default/806beb1/2147483647/strip/true/crop/600x337+0+0/resize/1200x674!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F3d%2F00%2F6c72ba2ce08402037c858d51d11e%2F16x9", "https://ca-times.brightspotcdn.com/dims4/default/095de0c/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F60%2Fe2%2F560824911729a4eccb059fcd2d3a%2Fla-et-mn-gawker-seeks-dismissal-of-quentin-tar-001", "https://ca-times.brightspotcdn.com/dims4/default/5adecad/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F16%2Fda%2F67c66fc9d99231f6e60c94510a80%2Fimg-59772009-turbine-la-et-ken-burns-photo", "https://ca-times.brightspotcdn.com/dims4/default/74709e4/2147483647/strip/true/crop/2048x1330+0+0/resize/1200x779!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fba%2F1a%2F4d427f5b0f20e9dfe58445b27b71%2Fimg-5956449d-turbine-la-et-rza-20170630", "https://ca-times.brightspotcdn.com/dims4/default/5400d40/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2Fce%2F9b313e63e70b571d32d543ba7208%2Fimg-571f9f25-turbine-la-1461690213-snap-photo", "https://ca-times.brightspotcdn.com/dims4/default/ced87f6/2147483647/strip/true/crop/1438x2048+0+0/resize/1200x1709!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fb1%2F7d%2F6ae296e031a75ca6b16f13224692%2Fimg-596cd947-turbine-la-et-black-women-in-comedy-photos-20170710-052", "https://ca-times.brightspotcdn.com/dims4/default/6dcdbc8/2147483647/strip/true/crop/750x422+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fea%2F39%2Fb64144a143adaf3758029d0ca0b8%2F750x422", "https://ca-times.brightspotcdn.com/dims4/default/40a5d90/2147483647/strip/true/crop/2000x1422+0+0/resize/1200x853!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Faf%2F18%2F3aba96ea28d34261c6eca8856e5e%2Fimg-59641790-turbine-la-et-harry-stanton-photo", "https://ca-times.brightspotcdn.com/dims4/default/289d772/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F47%2F45%2Fbe1bc725492a270af337209d13ad%2Fimg-5703eb29-turbine-la-et-mg-rob-kardashian-black-chyna-engaged-20-001", "https://ca-times.brightspotcdn.com/dims4/default/7c014b6/2147483647/strip/true/crop/1024x682+0+0/resize/1200x799!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F48%2Fb3%2F0f0b5a1d111908e62ced1edb0545%2Fimg-59778705-turbine-la-katy-perry-20170725", "https://ca-times.brightspotcdn.com/dims4/default/d02ca25/2147483647/strip/true/crop/2048x1365+0+0/resize/1200x800!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F4d%2F59%2Fd90fbe388064b6d482d3688982af%2Fla-et-mn-oscars-2016-red-carpet-arrivals-pictu-032", "https://ca-times.brightspotcdn.com/a6/d6/eea0f1094fb281dbea09e0aa79cd/art-caltimes-trademark-3x.png", "https://ca-times.brightspotcdn.com/dims4/default/918ebcd/2147483647/strip/true/crop/2000x1992+0+0/resize/1200x1195!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F24%2F66%2F4e339ac163712082fdd07c7eb054%2Fla-et-cm-pedro-aunion-monroy-20170708", "https://ca-times.brightspotcdn.com/dims4/default/64c8182/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F7f%2F4f%2F27bffb1ae47685a40fa6e39f565d%2Fla-et-mg-larry-david-20170710", "https://ca-times.brightspotcdn.com/dims4/default/fa3ed24/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F91%2Fac%2F9bca202a4837a02c495e656748c6%2Fla-1500744553-hinwh7q85f-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/634a1d4/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F27%2F4f%2F3ba0fe328f0755265ebfbcea3dd0%2Fla-1501212085-ltrskt4vtl-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/bb3c3ee/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F40%2Fe9%2Fc2a827be6ea0d20d9c99af26f1b1%2Fimg-5976fec3-turbine-la-et-sally-struthers-photo", "https://ca-times.brightspotcdn.com/dims4/default/a97f907/2147483647/strip/true/crop/1024x681+0+0/resize/1200x798!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fac%2F18%2F5ec16fa7743721b98e58fd762c34%2Fimg-596d4172-turbine-la-wendy-williams-20170717", "https://ca-times.brightspotcdn.com/dims4/default/9297196/2147483647/strip/true/crop/2048x1152+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F4a%2F74%2Fe12da964c2a0e83b1ffecb071734%2Fla-1500841661-0iaumr25ox-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/ee5e7b6/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd8%2F7a%2F122176f3fe3f4b2df79530ae47ab%2Fimg-596f3d2a-turbine-la-et-charlotte-gainsbourg-photo", "https://ca-times.brightspotcdn.com/dims4/default/fae1d83/2147483647/strip/true/crop/1008x1024+0+0/resize/1200x1219!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F61%2F9e%2Fbd6b898fcb978a139384af1cb057%2Fimg-595a938a-turbine-la-the-doors-1966-whisky-a-go-go-20170703", "https://ca-times.brightspotcdn.com/dims4/default/5541627/2147483647/strip/true/crop/682x1024+0+0/resize/1200x1802!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F70%2Fbc%2Fb0861e732816cd05845d3473df23%2Fimg-597661d3-turbine-la-iggy-pop-at-fyf-fest-3", "https://ca-times.brightspotcdn.com/dims4/default/87e5f6c/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F5c%2Ffc%2Fcf636c2bce0a829ad2bd1d197ee8%2F1600x900", "https://ca-times.brightspotcdn.com/dims4/default/9526866/2147483647/strip/true/crop/850x478+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fed%2F71%2Fff1f80f01ff4fa16f7a3b0e66598%2F850x478", "https://ca-times.brightspotcdn.com/dims4/default/c452dcc/2147483647/strip/true/crop/1580x888+0+0/resize/1200x674!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F91%2Fee%2F23af9f205ad77139998ffd0e8166%2Fla-1501218759-znk9g83uyj-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/a46305e/2147483647/strip/true/crop/2048x1605+0+0/resize/1200x940!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F5d%2F0d%2F19ecfb3804203b8d09b77acf9b21%2Fimg-5947e769-turbine-la-1497884514-sdab8b6x57-snap-image", "https://ca-times.brightspotcdn.com/dims4/default/3f3c7ef/2147483647/strip/true/crop/2005x1407+0+0/resize/1200x842!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fb3%2F39%2F7bbc2e6c270e020f4d7e5873126c%2Fimg-596c8388-turbine-la-et-santana4-photo", "https://ca-times.brightspotcdn.com/dims4/default/7155f57/2147483647/strip/true/crop/2048x1340+0+0/resize/1200x785!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F5f%2F2b%2Fc25d1effc33bd0acddb14c4d8250%2Fimg-595d21c9-turbine-la-zeerak-the-afghan-sesame-street-muppet-20170705", "https://ca-times.brightspotcdn.com/dims4/default/74fcbe1/2147483647/strip/true/crop/2048x1363+0+0/resize/1200x799!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F45%2F28%2F21152242df65d2404f4adcdda7e0%2Flat-fkatwigs-pattinson-20170726", "https://ca-times.brightspotcdn.com/dims4/default/17a185a/2147483647/strip/true/crop/698x1024+0+0/resize/1200x1760!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F3a%2Ffa%2F163f121014a0829f535495bdfdcd%2Fimg-596fa8da-turbine-la-claudia-winkleman-20170719", "https://ca-times.brightspotcdn.com/dims4/default/c4fd462/2147483647/strip/true/crop/1680x1291+0+0/resize/1200x922!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F36%2Fde%2Fa5bea53e79f824fad4dbf6f254f2%2Fla-et-st-emmys-2014-presenters-photos-20140808-030", "https://ca-times.brightspotcdn.com/dims4/default/fac4a74/2147483647/strip/true/crop/1600x900+0+0/resize/1200x675!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F99%2F69%2Fe2f70cef5808361b56a2295e0e1d%2Fimg-59543a17-turbine-la-et-tom-cruise-1999-photo", "https://ca-times.brightspotcdn.com/dims4/default/4931330/2147483647/strip/true/crop/2048x2048+0+0/resize/1200x1200!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff6%2F52%2Fc08ca3289cba4bd59b5802031947%2Fimg-596c7db4-turbine-la-et-benedict-cumberbatch-photo"], "top_img": "https://ca-times.brightspotcdn.com/dims4/default/84d8b92/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.latimes.com/entertainment/la-et-entertainment-news-updates-july-2017-htmlstory.html", "title": "Today in Entertainment: Twitter has a field day over Anthony Scaramucci’s exit; Celebrities mourn the loss of Sam Shepard", "meta_data": {"og": {"title": "Today in Entertainment: Twitter has a field day over Anthony Scaramucci's exit; Celebrities mourn the loss of Sam Shepard", "url": "https://www.latimes.com/entertainment/la-et-entertainment-news-updates-july-2017-htmlstory.html", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/84d8b92/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "url": "https://ca-times.brightspotcdn.com/dims4/default/84d8b92/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "width": 1200, "height": 630, "type": "image/jpeg", "alt": "LA Times logo"}, "description": "Here's what's new and interesting in entertainment and the arts:Anthony Scaramucci is out and Twitter is having a field dayGoodbye, MTV Moonman trophy. Hello, 'Moon Person'Sam Shepard: Pulitzer Prize-winning playwright, actor and ... avant-garde drummer?Lady Gaga subpoenaed in producer Dr. Luke's…", "site_name": "Los Angeles Times", "type": "website"}, "twitter": {"card": "summary_large_image", "description": "Here's what's new and interesting in entertainment and the arts:Anthony Scaramucci is out and Twitter is having a field dayGoodbye, MTV Moonman trophy. Hello, 'Moon Person'Sam Shepard: Pulitzer Prize-winning playwright, actor and ... avant-garde drummer?Lady Gaga subpoenaed in producer Dr. Luke's lawsuit against pop singer Kesha'Ride on, genius': Celebrities mourn the loss of Sam Shepard", "site": "@latimes", "title": "Today in Entertainment: Twitter has a field day over Anthony Scaramucci's exit; Celebrities mourn the loss of Sam Shepard"}, "fb": {"app_id": 134435029966155, "pages": 5863113009}, "robots": "max-image-preview:large", "viewport": "width=device-width,initial-scale=1", "description": "Here's what's new and interesting in entertainment and the arts:Anthony Scaramucci is out and Twitter is having a field dayGoodbye, MTV Moonman trophy. Hello, 'Moon Person'Sam Shepard: Pulitzer Prize-winning playwright, actor and ... avant-garde drummer?Lady Gaga subpoenaed in producer Dr. Luke's lawsuit against pop singer Kesha'Ride on, genius': Celebrities mourn the loss of Sam Shepard", "brightspot.contentId": "0000016c-68c4-d4d6-a16e-eaef180c0000", "brightspot.cached": "false"}, "movies": [], "publish_date": null, "source": "http://www.latimes.com", "summary": ""}