{"url": "https://www.tvguide.com/news/sag-awards-moments-1028712/", "text": "Here are our top moments of the 2011 Screen Actors Guild Awards:\n\n10. Most Nurturing: \"It shouldn't be called the SAG award, it should be called the Uplifting Award,\" The King's Speech actor Geoffrey Rush says on behalf of the cast, before giving nods to the movie's supporting actors, including his on-screen family and Freya Wilson, who played the young future Queen Elizabeth. His SAG family must be very proud.\n\n9. The Kanye West Memorial Award: Has someone been enjoying a little post-Prohibition tipple? A spacey, dark-lipped Paz de la Huerta commandeers the mic after Steve Buscemi's speech for Boardwalk Empire's drama ensemble win, to thank the people on her own list.\n\nCheck out all the SAG Awards' fashion hits and misses\n\n8. Worst Delivery: Alec Baldwin still loves boss and 30 Rock co-star Tina Fey, so much so that he includes one of her jokes in his acceptance speech. \"She's doing Poehler,\" Baldwin says perplexingly of Best Supporting Actress winner Melissa Leo. Apparently, Fey had just said to him, \"If you know Amy, she's doing Amy.\" He is met with silence. It's OK, Alec. Jack Donaghy still rules.\n\n7. Funniest Speech: Is there such a thing as too much Betty White? (Answer: No.) \"There wasn't a prayer!\" White says of her chances to win best comedy actress. \"You didn't applaud when I turned 40!\" she snarks. Then she glanced down at her naked SAG statuette and stroked it. Lovingly. We love you too, Betty.\n\nVIDEO: Watch all of our celeb interviews from the SAG 2011 red carpet\n\n6. Best Reaction Shot: Winona Ryder sports a horrified expression when her melodramatic scene plays during the best actress in a TV movie/miniseries category. We wonder if she was thinking what we were thinking: Has it really been that long since Heathers?\n\n5. Biggest Surprise: Winner Christian Bale welcomes Dicky Eklund, the man he portrayed in The Fighter, to join him on stage to accept the Best Supporting Actor trophy. \"The original quacker,\" Bale says, shaking his hand enthusiastically. \"Thank you for living your life and thank you for letting me play you.\" It makes Bale's words about acting -- \"life without empathy is no life at all\" -- mean that much more.\n\n4. Best Commercial Interruption: In this DVR age, we'd almost forgotten these existed! A clip montage saluting broadcast advertising is a humorous look back at bite-sized pop culture ranging from the \"Where's the beef?\" lady, the Old Spice guy and our favorite actors like Dustin Hoffman, John Cleese and Ken Jeong hawking various wares.\n\nSee all the SAG Awards red carpet arrivals\n\n3. Most Unexpected Shout-Out: Julianna Margulies doesn't forget anyone during her thank-you speech for best actress in a drama for The Good Wife, acknowledging the unsung heroes that have kept production up and running during this especially rough winter. She thanks \"all the Teamsters who've been digging us out of the snow for the past two weeks.\"\n\n2. Worst Rewards Program: The King's Speech star (and Best Actor winner) Colin Firth reveals how he once tried to use his SAG card, flashing it around \"hoping it would get me female attention and free into nightclubs and top-level government departments, and it didn't.\" But at least it made him the King of England.\n\n1. Best Parental Advice: Brush your teeth twice a day. And oh yeah, never be an \"a--hole.\" That's one of the lessons that Natalie Portman's parents taught her, as she recalls in her Best Actress acceptance speech. \"It's never acceptable,\" she says. Since we also mind our elders, we're not going to argue.\n\nFor more from the SAGs, check out the Screen Actors Guild Awards Red Carpet Fashion Wrap hosted by Lawrence Zarian on Monday at 8/7c on TVGN.\n\nWhat was your favorite moment of the night?", "images": ["https://www.tvguide.com/a/img/resize/07f2cc5232c1ddea030b12700a8f8ec1efbb6bb3/hub/2015/01/09/4dace82c-2603-4536-8260-35cc564f7930/apple-touch-icon-precomposed.png?auto=webp&height=84&width=84", "https://www.tvguide.com/a/img/hub/2011/01/31/73f0f50c-5174-4346-b3f4-491f62df8a60/110130natalie-portman-sag1.jpg"], "top_img": "https://www.tvguide.com/a/img/hub/2011/01/31/73f0f50c-5174-4346-b3f4-491f62df8a60/110130natalie-portman-sag1.jpg", "keywords": [], "authors": ["Tv Guidenews", "Jan.", "P.M. Pt"], "canonical_link": "https://www.tvguide.com/news/sag-awards-moments-1028712/", "title": "SAG Awards Top Moments: Why Was Natalie Portman's Acceptance Speech Censored?", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"app_id": 63084645929}, "google-site-verification": "Od29UEFliEmsUY2XH0kfXxkTNucL0cv_rc0J_RPWXU4", "og": {"site_name": "TVGuide.com", "image": {"identifier": "https://www.tvguide.com/a/img/hub/2011/01/31/73f0f50c-5174-4346-b3f4-491f62df8a60/110130natalie-portman-sag1.jpg", "height": 850, "width": 850}, "type": "article", "title": "SAG Awards Top Moments: Why Was Natalie Portman's Acceptance Speech Censored?", "url": "https://www.tvguide.com/news/sag-awards-moments-1028712/"}, "twitter": {"card": "summary_large_image", "site": "@TVGuide", "image": "https://www.tvguide.com/a/img/hub/2011/01/31/73f0f50c-5174-4346-b3f4-491f62df8a60/110130natalie-portman-sag1.jpg", "title": "SAG Awards Top Moments: Why Was Natalie Portman's Acceptance Speech Censored?", "url": "https://www.tvguide.com/news/sag-awards-moments-1028712/"}, "nuxtstatus": "loaded"}, "movies": [], "publish_date": null, "source": "https://www.tvguide.com", "summary": ""}