{"url": "https://en.wikipedia.org/wiki/Coco_Austin", "text": "American television personality\n\nNicole Natalie Marrow (née Austin; born March 17, 1979),[1] commonly known as Coco Austin, Coco, Coco Marie Austin, Coco Marie, and Coco-T, is an American television personality and actress. She has been married to rapper Ice-T since 2002.[1]\n\nEarly life [ edit ]\n\nAustin was born in 1979 in Tarzana, California, and raised in nearby Palos Verdes.[1] She has Serbian ancestry through maternal grandparents born in Serbia.[2][3] Austin has a younger sister named Kristy Williams and three younger brothers. As a small child, her brother would mispronounce her name, saying \"Cole Cole\" or \"Co-co\" in place of \"Nicole\". Eventually her family began addressing her as Coco. The family moved to Albuquerque, New Mexico, when she was 10. She grew up as a tomboy, riding all-terrain vehicles and playing football.[1] Austin also began dancing during her childhood (jazz, tap and ballet).[4]\n\nCareer [ edit ]\n\nAt 18, Austin began specializing in swimsuit, lingerie and body modeling for calendars, catalogs and videos.[4] In 1997, she appeared on her first magazine cover for Swimwear Illustrated.[5] She won the 1998 Miss Ujena contest in Mexico.[4] In 2001, Austin began working events and parties at the Playboy Mansion.[4] She appeared in low-budget R-rated films, including Southwest Babes (2001), Desert Rose (2002), and The Dirty Monks (2004).[4]\n\nAustin has made guest appearances on TV shows and specials including Hip-Hop Wives, the Comedy Central Roast of Flavor Flav, RuPaul's Drag Race 5, The Late Late Show with Craig Ferguson, The Dr. Oz Show, and Law & Order: Special Victims Unit.\n\nShe was featured in a layout in the March 2008 issue of Playboy magazine and had a role in the film Thira (a.k.a. Santorini Blue, which co-starred her husband, rapper-actor Ice-T). Austin appeared on NBC's game show Celebrity Family Feud on June 24, 2008 (with winnings donated to charity). She and Ice-T competed against Joan and Melissa Rivers.[6][7]\n\nAustin played the lead role of Bo Peep in the Las Vegas revue Peepshow from December 2012 to September 1, 2013, replacing Holly Madison in the role.[8][9]\n\nAustin and Ice-T starred in the reality television series Ice Loves Coco, which premiered June 12, 2011, on E![10][11] The show ran for three seasons, ending in February 2014. After the show's cancelation, tabloids reported that Austin and her husband were preparing to launch another reality series under Ryan Seacrest's production company. She also made an appearance in rapper Lil' Kim's music video for her single \"Go Awff\" in 2019.[12]\n\nPersonal life [ edit ]\n\nAustin with Ice-T\n\nAustin and rapper-actor Tracy \"Ice-T\" Marrow were married in January 2002.[1] They renewed their vows in Hollywood on June 4, 2011.[13] In 2006, the couple made their home in a penthouse apartment they owned in North Bergen, New Jersey.[14] In 2012, they began building a five-bedroom house in Edgewater, New Jersey, which was expected to be completed by the end of that year.[15] The couple eventually moved into the home during 2018 and 2019. While waiting for completion of their new home, in November 2015, the couple announced that their daughter had been born on November 28.[16][17] Prior to her marriage to Ice-T, Austin was married to Mike Williams from 1999 to 2001.", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Nicole_%22Coco%22_Austin_at_the_Tribeca_Film_Festival.jpg/1200px-Nicole_%22Coco%22_Austin_at_the_Tribeca_Film_Festival.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/Ice-T_and_Coco_at_the_Tribeca_Film_Festival.jpg/190px-Ice-T_and_Coco_at_the_Tribeca_Film_Festival.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Nicole_%22Coco%22_Austin_at_the_Tribeca_Film_Festival.jpg/220px-Nicole_%22Coco%22_Austin_at_the_Tribeca_Film_Festival.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Nicole_%22Coco%22_Austin_at_the_Tribeca_Film_Festival.jpg/1200px-Nicole_%22Coco%22_Austin_at_the_Tribeca_Film_Festival.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Coco_Austin", "title": "Coco Austin", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Nicole_%22Coco%22_Austin_at_the_Tribeca_Film_Festival.jpg/640px-Nicole_%22Coco%22_Austin_at_the_Tribeca_Film_Festival.jpg", "width": 640, "height": 975}, "title": "Coco Austin - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}