{"url": "https://www.usatoday.com/story/life/tv/2017/08/03/nbc-will-grace-revival-eric-mccormack-megan-mullally-debra-messingsean-hayes/537255001/", "text": "NBC's 'Will & Grace' cast on what's changed, and their TWO new seasons\n\nBEVERLY HILLS — Will & Grace & Karen & Jack are back, and NBC has them.\n\nAfter an eight-year run and an 11-year absence, the groundbreaking hit sitcom returns to NBC for a 16-episode run on Sept. 28, and a second, 13-episode season announced at the Television Critics Association Thursday. And it returns with its original stars — Eric McCormack, Debra Messing, Megan Mullally and Sean Hayes — and creators Max Mutchnick and David Kohan.\n\nIf you saw the original series finale, you may remember that it ended with Will and Grace happily partnered — Will with Vince, Grace with Leo — and raising children. Well, when the show returns, the partners and the children will be forgotten.\n\n\"That was more or less a fantasy,\" Kohan says. \"It was a projection into the future. ... What we missed was the dynamic between the four of them more than we missed the possibility of seeing what they were like as parents.\"\n\nAdds Mutchnick, \"We never would have gone in that direction if we weren't ending the show.\"\n\nMORE: What to expect from your favorite TV shows\n\nWhen Will first aired, NBC asked the writers to stress the friendships among the characters and downplay the fact that two of them, Will and Jack, were gay.\n\nThat's all changed, says McCormack. \"Now the message is 'we are us,' and we represent a lot of people in the country, gay and straight, and we're not apologizing for who we are.\"\n\nIt can be hard to try to recapture past glories, but Hayes says the cast immediately fell back into their old groove. \"We've all become brothers and sisters and family. Moving forward with the show, it fits like a glove.\"\n\n\"When we sat down together, it just came to life in ways I'd never seen before or since,\" says Messing. \"I think of comedy as music, and each one of us is a different instrument. And when we play together, we're at our best.\"\n\nThe only difference in the way they play now, says Mullally, is that they have to stretch to warm up before they do the physical comedy — something they didn't have to do when they were 11 years younger.\n\nThere's another difference: Hayes, who was in the closet when Will originally aired, is now out. While he says he wishes he had come out earlier, he just wasn't ready.\n\n\"At the time, I didn't have the DNA to speak for a whole community. I didn't have the words to do that, and I wish I did. But now I find that words come easier.\"\n\nThe world, of course, is a far different place than it was in the '90s, and Mutchnick says the show will reflect what is happening in America today, in politics and otherwise. \"The show has always been relevant,\" says Hayes. \"And under the umbrella of relevancy is everything.\"\n\nSo, are they worried about committing to a second season before the first even airs? No way, says Messing.\n\n\"We all got together and read, and it felt like coming home. For the last year, it's been a confusing time, and I haven't laughed a lot. To come back together and to laugh out loud? .. It's a no brainer.\"\n\nAdds Hayes: \"There's nothing to fear. We've been playing these characters. I play him at the Grove every time I go shopping.\"", "images": ["https://www.gannett-cdn.com/-mm-/22a0b64d06d9100cc98281e371f70d2a2a3bae0e/c=0-147-2886-1778/local/-/media/2017/08/03/USATODAY/USATODAY/636373829094565903-GTY-826102208.jpg?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/-mm-/43bf5c92e42366264df641879f9e0d08ca64c9bd/c=4-0-2995-2249/local/-/media/2017/04/26/USATODAY/USATODAY/636288189642537497-XXX-will-grace-tv.1.jpg?width=320&height=240", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/22a0b64d06d9100cc98281e371f70d2a2a3bae0e/c=0-147-2886-1778/local/-/media/2017/08/03/USATODAY/USATODAY/636373829094565903-GTY-826102208.jpg?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Robert Bianco"], "canonical_link": "https://www.usatoday.com/story/life/tv/2017/08/03/nbc-will-grace-revival-eric-mccormack-megan-mullally-debra-messingsean-hayes/537255001/", "title": "NBC's 'Will & Grace' cast on what's changed, and their TWO new seasons", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/tv/2017/08/03/nbc-will-grace-revival-eric-mccormack-megan-mullally-debra-messingsean-hayes/537255001/life/tv", "theme-color": "#ffffff", "og": {"type": "article", "title": "NBC's 'Will & Grace' cast on what's changed, and their TWO new seasons", "description": "'Will & Grace' & Karen & Jack are back on NBC for a revived 16-episode run, with a second season already greenlit", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/22a0b64d06d9100cc98281e371f70d2a2a3bae0e/c=0-147-2886-1778/local/-/media/2017/08/03/USATODAY/USATODAY/636373829094565903-GTY-826102208.jpg?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "'Will & Grace' & Karen & Jack are back on NBC for a revived 16-episode run, with a second season already greenlit", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": ["https://www.youtube.com/embed/0aSzkUxVEdg?feature=oembed"], "publish_date": 1501714800.0, "source": "https://www.usatoday.com", "summary": ""}