{"url": "https://www.hollywoodreporter.com/bookmark/alec-baldwin-memoir-nevertheless-10-biggest-revelations-991208", "text": "Alec Baldwin is one of the most recognizable and now, with his Donald Trump impersonation, one of the most beloved actors in America. He originated the role of Jack Ryan in The Hunt for Red October (1990) and had an iconic seven-year run as Jack Donaghy on the sitcom 30 Rock. He’s hosted Saturday Night Live more times than anyone else (17) and has been a tabloid target for his acrimonious divorce from Kim Basinger and angry outbursts at his own daughter and at the paparazzi following him around.\n\nNow in Nevertheless (Harper, available today), Baldwin, 59, tells his story for the first time, from his Long Island childhood to his early stardom (and trouble with drugs) to his current renaissance. From the revelations about his drug use to the actors and directors he hates (Harrison Ford, Oliver Stone) and loves (Tina Fey, of course), here are the 10 most interesting things to learn in the book:\n\n1. He’s a lot more like Donald Trump than he lets on.\n\nNot in their politics, of course; Baldwin is as much an old-school liberal Democrat as you’ll find. And not in their humanity, either. For all his faults — and they are many — Baldwin is ultimately a much kinder, decent, more humane person than Trump, if for no other reason than the actor is pretty self-aware about his flaws and genuinely contrite for some of his worst behavior (like that infamous 2007 screaming voicemail left for daughter Ireland). But in other ways, ways that I suspect helps Baldwin play Trump, they are similar. Both are men of great appetites (figuratively speaking). The people they love, they really love. The people they hate, they really hate. Both are easy to anger. Both hold grudges for a long time (see below about Ford and ex-wife Basinger as evidence). Both have daddy issues, trying to live up to what they imagine are the expectations of their larger-than-life fathers (Fred Trump the developer, Alex Baldwin, Jr. the beloved history teacher). And both are homebodies deeply shaped by their New York youth (Queens for Trump, Long Island for Baldwin).\n\n2. He almost killed himself with drugs and booze in the 1980s.\n\nIn the first blush of fame in the early ‘80s, Baldwin became addicted to cocaine and booze and almost died of an overdose while shooting a Knots Landing episode in Oregon, ending up in the hospital for 36 hours. His first crack at AA didn’t stick and he relapsed at the end of 1984. The second try stuck and Baldwin has been sober since Feb. 23, 1985.\n\n3. He’s still angry at Kim Basinger, but sorry about that voicemail.\n\nBaldwin’s 1993 marriage to the actress devolved into an acrimonious divorce in 2002 and a continuing custody battle over daughter Ireland. He’s still bitter about it and her role in 2007 in leaking the infamous angry voicemail where he called Ireland a pig, among other things. But he’s contrite about the voicemail itself. He writes that his relationship with Ireland has healed, but the incident “permanently harmed” their bond.\n\n4. He doesn’t like Harrison Ford.\n\nOne of Baldwin’s breakout movie roles was as Jack Ryan in Hunt for Red October, but when it came time to negotiate a deal for the sequel, he learned the studio was talking to Ford to replace him behind his back. Hunt for Red October director John McTiernan asked Ford if backstabbing Baldwin bothered him. Ford’s reply? “F— him.” Baldwin writes, “He was playing a different game. In the need of the next franchise to keep the flame of his stardom burning bright while earning him tens of millions more, what choice did he have? The carpenter who walked onto a set [Star Wars] and then into movie history knew that these roles were his legacy.”\n\n5. …or Oliver Stone.\n\nBaldwin made Talk Radio with the director and does not mince words about how much he disliked the 1988 experience: “Stone’s ‘technique’ was to generate as much tension on the set as he believed the film required. With sarcastic asides and a passive-aggressive tone throughout, Stone drove the cast and crew to drink a lot.”\n\n6. …or even his own work.\n\nDespite a career that has lasted over 30 years and includes over 120 credits, Baldwin doesn’t think much of his own work. He writes that “the final ten minutes of The Edge are the only piece of my own film work I can ever watch and enjoy.” State and Main “is one of the few of my own movies that I can stand watching.” 30 Rock, though, made an impression on him, more than his graduating from high school or college. “When 30 Rock ended, all of the feelings one associates with the end of something seminal — feelings that I had missed or squandered earlier, that comes from truly investing in an experience — finally came out. That was my graduation.”\n\n7. But he has high praise for other co-stars and actors.\n\nHe fell in love with Michelle Pfeiffer — like everyone else who met her then — during the making of Married to the Mob. Ben Affleck is a “prince.” Miami Blues co-star Jennifer Jason Leigh is a great actor. Matt Damon has “warmth and humanity.” He loved his one day on the set Notting Hill because, “I got to breathe the same air as the remarkable Julia Roberts.”\n\n8. His love of Tina Fey rules all (but he didn’t think much of her husband at first).\n\n“When I first met Tina Fey — beautiful and brunette, smart and funny, by turns smug and diffident and completely uninterested in me or anything I had to say — I had the same reaction that I’m sure many men and women have: I fell in love.” And then Saturday Night Live’s talent coordinator Marci Klein introduced him to Fey’s “travel size” husband Jeff Richmond, leading Baldwin to think: “What’s she doing with him?”\n\n8. Anthony Hopkins does a mean Richard Burton impersonation.\n\nOn the set of 1997’s The Edge, the two actors amused themselves with dueling impersonations of the legendary actor (and Elizabeth Taylor spouse). “The goal was to not only impersonate Burton but to distill the self-destructive genius down to his essence.” Hopkins killed it: “Tony won the game for all time with his almost haiku-like incantation: ‘Elizabeth! Baubles and stones. White wine. Marbella.’ Then he feigned passing out.”\n\n9. His wife Hilaria nails him for his narcissism and has maybe the best line in the book.\n\n“When I’m not with you, I still exist.”\n\n10. Is he running for office?\n\nBaldwin has long denied that he’d run for office, squashing speculation about runs for mayor of New York City, governor, senator or even president. And he repeats it in the book, but one chapter reads like a campaign manifesto where he criticizes voter suppression and Middle East policy, explores why Hillary Clinton lost and offers some thoughts on what a president should do.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/03/alec_baldwin.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/03/alec_baldwin.jpg?w=1296&h=730&crop=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/03/alec_baldwin.jpg?w=1024", "keywords": [], "authors": ["Andy Lewis"], "canonical_link": "https://www.hollywoodreporter.com/lifestyle/arts/alec-baldwin-memoir-nevertheless-10-biggest-revelations-991208/", "title": "Alec Baldwin Memoir ‘Nevertheless’: 10 Biggest Revelations", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The former '30 Rock' star and Donald Trump impersonator reveals the actors he hates (Harrison Ford) and loves (Tina Fey), how he almost died from a drug overdose in the 1980s and the surprising roles he liked the best.", "news_keywords": "Alec Baldwin", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Andy Lewis", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 991208, "title": "Alec Baldwin Memoir 'Nevertheless': 10 Biggest Revelations", "published_at": "2017-04-04 14:58:22", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/03/alec_baldwin.jpg?w=1024", "comment_count": 0, "tags": "Alec Baldwin", "topics": "Lifestyle", "body": "Alec Baldwin is one of the most recognizable and now, with his Donald Trump impersonation, one of the most beloved actors in America. He originated the role of Jack Ryan in The Hunt for Red October (1990) and had an iconic seven-year run as Jack Donaghy on the sitcom 30 Rock. He’s hosted Saturday Night Live more times than anyone else (17) and has been a tabloid target for his acrimonious divorce from Kim Basinger and angry outbursts at his own daughter and at the paparazzi following him around.\r\nNow in Nevertheless (Harper, available today), Baldwin, 59, tells his story for the first time, from his Long Island childhood to his early stardom (and trouble with drugs) to his current renaissance. From the revelations about his drug use to the actors and directors he hates (Harrison Ford, Oliver Stone) and loves (Tina Fey, of course), here are the 10 most interesting things to learn in the book:\r\n1. He’s a lot more like Donald Trump than he lets on. \r\n\tNot in their politics, of course; Baldwin is as much an old-school liberal Democrat as you’ll find. And not in their humanity, either. For all his faults — and they are many — Baldwin is ultimately a much kinder, decent, more humane person than Trump, if for no other reason than the actor is pretty self-aware about his flaws and genuinely contrite for some of his worst behavior (like that infamous 2007 screaming voicemail left for daughter Ireland). But in other ways, ways that I suspect helps Baldwin play Trump, they are similar. Both are men of great appetites (figuratively speaking). The people they love, they really love. The people they hate, they really hate. Both are easy to anger. Both hold grudges for a long time (see below about Ford and ex-wife Basinger as evidence). Both have daddy issues, trying to live up to what they imagine are the expectations of their larger-than-life fathers (Fred Trump the developer, Alex Baldwin, Jr. the beloved history teacher). And both are homebodies deeply shaped by their New York youth (Queens for Trump, Long Island for Baldwin). \r\n\r\n2. He almost killed himself with drugs and booze in the 1980s. \r\n\tIn the first blush of fame in the early '80s, Baldwin became addicted to cocaine and booze and almost died of an overdose while shooting a Knots Landing episode in Oregon, ending up in the hospital for 36 hours. His first crack at AA didn’t stick and he relapsed at the end of 1984. The second try stuck and Baldwin has been sober since Feb. 23, 1985.\r\n3. He’s still angry at Kim Basinger, but sorry about that voicemail. \r\n\tBaldwin’s 1993 marriage to the actress devolved into an acrimonious divorce in 2002 and a continuing custody battle over daughter Ireland. He’s still bitter about it and her role in 2007 in leaking the infamous angry voicemail where he called Ireland a pig, among other things. But he’s contrite about the voicemail itself. He writes that his relationship with Ireland has healed, but the incident “permanently harmed” their bond.\r\n4. He doesn’t like Harrison Ford. \r\n\tOne of Baldwin’s breakout movie roles was as Jack Ryan in Hunt for Red October, but when it came time to negotiate a deal for the sequel, he learned the studio was talking to Ford to replace him behind his back. Hunt for Red October director John McTiernan asked Ford if backstabbing Baldwin bothered him. Ford's reply? “F— him.” Baldwin writes, “He was playing a different game. In the need of the next franchise to keep the flame of his stardom burning bright while earning him tens of millions more, what choice did he have? The carpenter who walked onto a set [Star Wars] and then into movie history knew that these roles were his legacy.”\r\n5. ...or Oliver Stone.\r\n\tBaldwin made Talk Radio with the director and does not mince words about how much he disliked the 1988 experience: “Stone’s ‘technique’ was to generate as much tension on the set as he believed the film required. With sarcastic asides and a passive-aggressive tone throughout, Stone drove the cast and crew to drink a lot.”\r\n6. ...or even his own work.\r\n\tDespite a career that has lasted over 30 years and includes over 120 credits, Baldwin doesn’t think much of his own work. He writes that “the final ten minutes of The Edge are the only piece of my own film work I can ever watch and enjoy.” State and Main “is one of the few of my own movies that I can stand watching.” 30 Rock, though, made an impression on him, more than his graduating from high school or college. “When 30 Rock ended, all of the feelings one associates with the end of something seminal — feelings that I had missed or squandered earlier, that comes from truly investing in an experience — finally came out. That was my graduation.”\r\n\r\n7. But he has high praise for other co-stars and actors.\r\n\tHe fell in love with Michelle Pfeiffer — like everyone else who met her then — during the making of Married to the Mob. Ben Affleck is a “prince.” Miami Blues co-star Jennifer Jason Leigh is a great actor. Matt Damon has “warmth and humanity.” He loved his one day on the set Notting Hill because, “I got to breathe the same air as the remarkable Julia Roberts.”\r\n8. His love of Tina Fey rules all (but he didn't think much of her husband at first). \r\n\t\"When I first met Tina Fey — beautiful and brunette, smart and funny, by turns smug and diffident and completely uninterested in me or anything I had to say — I had the same reaction that I’m sure many men and women have: I fell in love.” And then Saturday Night Live’s talent coordinator Marci Klein introduced him to Fey’s “travel size” husband Jeff Richmond, leading Baldwin to think: “What’s she doing with him?”\r\n8. Anthony Hopkins does a mean Richard Burton impersonation. \r\n\tOn the set of 1997’s The Edge, the two actors amused themselves with dueling impersonations of the legendary actor (and Elizabeth Taylor spouse). “The goal was to not only impersonate Burton but to distill the self-destructive genius down to his essence.\" Hopkins killed it: “Tony won the game for all time with his almost haiku-like incantation: ‘Elizabeth! Baubles and stones. White wine. Marbella.’ Then he feigned passing out.”\r\n9. His wife Hilaria nails him for his narcissism and has maybe the best line in the book. \r\n\t“When I’m not with you, I still exist.”\r\n10. Is he running for office?\r\n\tBaldwin has long denied that he’d run for office, squashing speculation about runs for mayor of New York City, governor, senator or even president. And he repeats it in the book, but one chapter reads like a campaign manifesto where he criticizes voter suppression and Middle East policy, explores why Hillary Clinton lost and offers some thoughts on what a president should do.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Alec Baldwin Memoir ‘Nevertheless’: 10 Biggest Revelations", "url": "https://www.hollywoodreporter.com/lifestyle/arts/alec-baldwin-memoir-nevertheless-10-biggest-revelations-991208/", "description": "The former ’30 Rock’ star and Donald Trump impersonator reveals the actors he hates (Harrison Ford) and loves (Tina Fey), how he almost died from a drug overdose in the 1980s and the su…", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/03/alec_baldwin.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-04-04T14:58:22+00:00", "modified_time": "2017-04-04T19:35:55+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Alec Baldwin Memoir ‘Nevertheless’: 10 Biggest Revelations", "description": "The former ’30 Rock’ star and Donald Trump impersonator reveals the actors he hates (Harrison Ford) and loves (Tina Fey), how he almost died from a drug overdose in the 1980s and the su…", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/03/alec_baldwin.jpg?w=1296"}}, "movies": [], "publish_date": 1491317902.0, "source": "https://www.hollywoodreporter.com", "summary": ""}