{"url": "https://en.wikipedia.org/wiki/Rey_(Star_Wars)", "text": "Fictional character in Star Wars\n\nFictional character\n\nRey is a character in the Star Wars franchise and the main protagonist of the sequel film trilogy. She was created by Lawrence Kasdan, J. J. Abrams, and Michael Arndt for The Force Awakens (2015), the first installment of the trilogy, and is primarily portrayed by Daisy Ridley.[1][14][15][16] She also appears in the film's sequels, The Last Jedi (2017) and The Rise of Skywalker (2019), and related Star Wars media.\n\nRey is introduced as a scavenger who was abandoned on the planet Jakku when she was a child. She becomes involved in the Resistance's conflict with the First Order. Powerfully Force-sensitive, Rey trains to be a Jedi under siblings Luke Skywalker and Leia Organa, and faces adversaries such as Kylo Ren, Supreme Leader Snoke and the resurrected Emperor Palpatine—who is revealed to be her grandfather in The Rise of Skywalker. Despite being enemies, Rey and Kylo Ren share a connection called a 'Force dyad'[17] and eventually become romantically involved with one another.[11][12][13] Following Palpatine's final defeat, Rey adopts the name Rey Skywalker to honor her mentors and their family legacy and renounce her lineage. As the last remaining Jedi, she makes it her mission to rebuild the Jedi Order.[9][18]\n\nDevelopment\n\nCreation and casting\n\nEpisode VII Rey's costume from\n\nScreenwriter Michael Arndt said that he found Lucasfilm President Kathleen Kennedy's offer to write Episode VII daunting in mid-2012, but he became interested when it was explained to him that the tale was about the origin story of a female Jedi and he met with George Lucas.[19] The character was known as Kira in the early stages of production, and Arndt described her as a \"loner, hothead, gear-head, badass\". Arndt said that he struggled with introducing the young woman as the main character in his story while keeping her from being overshadowed after her early meeting with Luke Skywalker, whose role in the film was eventually minimized.[19] Ridley recalled that director and writer J. J. Abrams originally intended to name the character \"Keera\" [sic], but during filming in Abu Dhabi, Abrams revealed to Ridley that he was thinking of going with \"Rey\".[21]\n\nOn creating a female lead for the new trilogy, Abrams stated that from his initial discussions with writer Lawrence Kasdan, he was excited at the concept of having a woman at the center of the story. He said that \"We always wanted to write Rey as the central character\" and that other female representation in the story was also important.[1] Kennedy stated that, \"Rey is the new generation's Luke Skywalker.\"[22] Rey's background as a scavenger was part of the developers attempting to portray her as \"the ultimate outsider and the ultimate disenfranchised person\", due to their belief that a person of that nature would likely experience a prolonged journey compared to other types of people.[23]\n\nDaisy Ridley was largely unknown before being cast for the role of Rey. Ridley said that she auditioned many times for the role over the course of seven months and had to keep her casting a secret for three months.[24] She was announced as part of the cast at the end of April 2014. She only had experience with small parts in TV shows. Her inexperience and lack of exposure were a crucial part of what convinced Abrams to give Ridley the role, as the previous installments had featured relatively unknown talent that would not experience heightened degrees of scrutiny.[25] Abrams stated that Ridley \"was so funny and had a great spark\", as well as having her act out an emotional scene, proclaiming that \"she nailed it on the first take.\" Abrams went on to praise Ridley, saying, \"She was born with this gift to be in a moment and make it her own. She simultaneously works from the inside out and the outside in.\"[26] Kennedy proclaimed, \"Daisy had a physicality and a self-confidence that was so important to the character we were looking for. She epitomizes that optimism where anything is possible.\"[26] Director Dusan Lazarevic, who was present at the casting of Ridley for a role in British drama series Silent Witness, in addition to praising her acting range, stated, \"She showed a combination of vulnerability and strength which gave her a complexity, and there was an intelligence in her eyes that was an indicator she could play quite a complicated part.\"[25] Cailey Fleming was additionally cast to portray a young Rey.[2]\n\nAlthough Ridley said she was \"riddled with doubts and insecurities\", she said that Rey's hopefulness is what she related to most: it \"was something driving me through the auditions—even though it felt so insanely out of anything that I could've imagined.\"[27] Ridley recalled her shooting experience as starting off bumpy, with Abrams telling her that her first few takes were \"wooden\".[28] But Ridley and Abrams had an \"incredibly collaborative\" process creating Rey; Ridley recalled that the character \"changed from when we first began, she became softer. And I think that's probably me, because Americans tend not to understand me, so it helped, slowing down the speech and everything just made it softer than I am.\"[27] Ridley has said that Rey will have \"some impact in a girl power-y way\", adding that the character \"doesn't have to be one thing to embody a woman in a film. It just so happens she's a woman but she transcends gender. She's going to speak to men and women.\"[29] In an interview with Elle, Ridley said, \"She's so strong. She's cool and smart and she can look after herself,\" adding, \"Young girls can look at her and know that they can wear trousers if they want to. That they don't have to show off their bodies.\"[26]\n\nComposer John Williams said he immediately loved Ridley in the film and found composing her theme an interesting challenge. He said that her theme does not suggest a love theme, but rather a strong female adventurer character infused with the Force for a mature, thoughtful theme.[30] He added that the \"musical grammar\" of Rey's theme is not heroic, but conveys \"an adventurous tone that needs to illustrate empathy.\"[31]\n\nCharacterization\n\nRey is introduced as a 19-year-old woman in The Force Awakens.[32] She is stubborn, headstrong, brave, optimistic, and maintains fierce loyalty to her friends. Matthew Yglesias of Vox wrote, \"Rey is considerably less callow than Luke\".[33] Ridley says of the character, \"It's not because Rey is strong that she's amazing. It's all the complexities of a human. It's because she is a well-drawn person who is struggling with things and you're with her.\"[34]\n\nRey is highly Force-sensitive, which is revealed when she is presented with the lightsaber first owned by Anakin Skywalker, then his son Luke.[35] Without training, she is able to use the Force and defeat the powerful (albeit injured) Kylo Ren in a duel.[36]\n\nOn the mirror-invoking vision Rey experiences in The Last Jedi, writer and director Rian Johnson said that it represents the character learning that she has to connect with herself.[37]\n\nIn The Last Jedi, Rey also discovers she has a connection in the Force with Kylo Ren, in which Rian Johnson claims that it was used as a way to make Rey engage with him and get the two characters to talk without fighting each other, to further develop their relationship.[38] Johnson explains that Rey seeing Kylo shirtless during one of these connections shows the increasing intimacy between them during their interactions.[38] In The Rise of Skywalker, it is revealed that this connection makes them two halves of a \"dyad\" in the Force, and the co-writer of the film, Chris Terrio, explains this relationship as being \"sort of soulmate[s] in the Force\"[39] and “twins of fate, twins of destiny.”[40] Both Johnson and director J.J. Abrams described their relationship as a romance.[38][41][12][11] Abrams elaborated about his perception of it during the production of The Force Awakens as having a \"brother-sister thing\" as much as a \"romantic thing\", and that it is not \"literally a sexually romantic kind of thing\", but they are spiritually bound together in way that Abrams claims that it felt romantic to him.[11]\n\nAppearances\n\nFilm\n\nThe Force Awakens (2015)\n\nRey is first introduced as an orphan living alone on the desert planet Jakku, scraping a living through scavenging parts from ships. She rescues the astromech droid BB-8 and encounters Finn (John Boyega), a former stormtrooper. Attacked by First Order troops, Rey steals and pilots the Millennium Falcon to evade them and escape Jakku. Smuggler Han Solo (Harrison Ford) and Wookiee Chewbacca (Peter Mayhew) take back the Falcon in their freighter ship. She saves Finn and they escape the freighter in the Falcon. Impressed with Rey's bravery and piloting skill, Han offers her a job on the Falcon; however, Rey declines his offer, feeling that she has to return to Jakku.\n\nAfter they convene at Maz Kanata's (Lupita Nyong'o) castle on the planet Takodana to return BB-8 to the Resistance, the First Order is alerted to their presence. Rey visits the castle's basement vault in which Maz has stored a lightsaber that once belonged to Luke Skywalker (Mark Hamill) and his father before him. Upon touching it, she experiences a terrifying vision: she sees a battle led by First Order enforcer Kylo Ren (Adam Driver), a flashback of her younger self being left behind on Jakku, and a vision of Luke, the last Jedi Master in the galaxy, who has been missing for several years. Maz debates that whoever abandoned her will never return to Jakku, and her only option is to seek out strength in the Force. Feeling overwhelmed, Rey rejects the lightsaber and flees into the forest.\n\nThe First Order attacks Maz's castle, and Ren captures Rey when the Resistance arrives. Ren takes her to Starkiller Base, where he probes her mind for the map piece that BB-8 showed her. Ren uses the Force to read Rey's mind, revealing Rey feels that Han is like the father she never had. Rey then resists him and reads Ren's emotions, exposing his fear that he will never be as powerful as his grandfather, Darth Vader. Ren reports to his master, Supreme Leader Snoke (Andy Serkis), who commands that Rey should be brought before him. Left alone with a stormtrooper guarding her, Rey uses a Jedi mind trick to get him to help free her. After sneaking around inside the base looking for a way to escape, she is elated to find Finn, Han, and Chewbacca have come for her. They watch in horror as Ren kills his own father, Han.\n\nAs they try to escape the base through the woods, Ren challenges Rey and Finn, using his lightsaber. After Ren seriously injures Finn and disarms him of Luke's lightsaber, Rey uses the Force to retrieve the weapon and battles Ren herself. Initially overpowered, Rey rejects Ren's offer to train her and uses the Force with the lightsaber, disfiguring his face. After escaping the destroyed base in the Millennium Falcon with Chewbacca and the wounded Finn, she returns to the Resistance base. While the Resistance celebrates the victory, Rey mourns Han's death with Leia Organa (Carrie Fisher) and visits Finn, who is still unconscious. She decides to seek out Luke's location, using information provided by BB-8 and the reactivated R2-D2 (Kenny Baker). Rey, Chewbacca, and R2 travel in the Falcon to the oceanic planet of Ahch-To; upon finding Luke, Rey presents him with his longtime lightsaber.\n\nRelated works and merchandising\n\nRey is featured in Star Wars: Before the Awakening (2015) by Greg Rucka, an anthology book for young readers that focuses on the lives of Poe, Rey and Finn before the events of The Force Awakens.[43] Rey's Survival Guide (2015) by Jason Fry is a first-person account from Rey's perspective about herself and her home planet of Jakku.[44] Rey is also a point of view character in the 2015 novelization of The Force Awakens by Alan Dean Foster.[45]\n\nFans noticed a lack of tie-in toys featuring Rey.[46] Hasbro released a version of Monopoly based on The Force Awakens that excluded the Rey character. After receiving criticism, Hasbro stated that they did not include Rey to avoid revealing spoilers, and would be including Rey in future toy releases.[47] Paul Southern, the head of Lucasfilm Licensing, said that they wanted to protect the secrets that \"the Force awakens in Rey\" and that her character carries a lightsaber.[48] He said that demand for Rey products was underestimated.[49][50] Abrams said, \"I will say that it seems preposterous and wrong that the main character of the movie is not well represented in what is clearly a huge piece of the Star Wars world in terms of merchandising.\"[15] Regarding Rey's relative absence in Star Wars merchandising, CBBC presenter and voice actor Christopher Johnson stated: \"It still baffles me to this day that some toy manufacturers don't think that girls want to play with 'superhero' toys and that boys aren't interested in female characters.\"[51]\n\nThe Last Jedi (2017)\n\nRey is one of the key characters of The Last Jedi. Picking up directly where the previous installment left off, Rey presents Luke with his lightsaber, but Luke dismissively throws it aside. Luke eventually agrees to teach Rey the ways of the Force. Rey demonstrates immense raw strength and a clear temptation toward the dark side of the Force that reminds Luke of Kylo Ren, who was once his nephew and student, Ben Solo. All the while, Rey feels a sudden connection through the Force with Ren, who tells her that Luke tried to kill him while he was the Jedi master’s student (Luke later tells her that he was tempted to kill Ben after seeing a vision of the pain and suffering he would cause, but relented). In one of their conversations, Rey and Ren touch hands, and through this Rey swears that she is able to feel conflict within Ren, and becomes determined to turn him back to the light side. Rey asks Luke once more to come with her and rejoin the Resistance, but he declines. So, Rey, Chewbacca, and R2-D2 leave without him, and Rey goes to meet Ren in the Mega-class Star Dreadnought Supremacy.\n\nRen takes Rey prisoner and brings her before Snoke. Snoke tells her that he created the Force connection between her and Ren as a trap to reach Luke. Snoke tortures and taunts Rey, showing her the attack on the Resistance transports, and eventually orders Ren to kill her. Ren instead kills Snoke, and he and Rey fight Snoke's guards side by side. After the duo win, Ren asks Rey to join him and create a new order separate from the legacies of Snoke and Luke. While attempting to get her to join him, Ren gets Rey to admit that her parents abandoned her. Despite the revelation, Rey hesitates but ultimately refuses to join him in the dark side. She uses the Force to summon Luke's lightsaber, but then Ren does the same, resulting in a standoff that ends up breaking the lightsaber. Shortly afterwards, Resistance leader Vice Admiral Holdo (Laura Dern) rams the MC85 Star Cruiser Raddus into Snoke's flagship, separating Rey from Ren. Rey subsequently uses Snoke's escape craft to flee the Mega-Destroyer as later stated by General Hux.\n\nRey is later revealed to have made her way back to the Millennium Falcon, aiding the Resistance in fighting the First Order’s troops during the Battle of Crait. Despite their valiant efforts, the Resistance loses the battle, and Rey focuses her efforts on finding the surviving Resistance fighters to help evacuate them. Eventually, she finds the Resistance fighters behind a dead-end, and uses the Force to move the rocky barrier aside, clearing the path for them to board the Falcon. Rey reunites with Finn and Leia and meets Poe Dameron (Oscar Isaac) for the first time aboard the Falcon. Rey feels Luke’s death through the Force, and reassures Leia that he met his end with \"peace and purpose\". As she holds the leftovers of Luke's lightsaber, Rey asks Leia how they can rebuild the Resistance from what remains, and Leia, gesturing towards Rey, says that they now have all they need. Unbeknownst to Leia, that includes the fact that Rey stole the sacred Jedi texts from Luke before Yoda's (Frank Oz) Force spirit burned the tree cave they were in.[52]\n\nThe Rise of Skywalker (2019)\n\nRey is the main protagonist of the trilogy's final film, The Rise of Skywalker, which is set one year after the events of The Last Jedi. Rey is continuing her Jedi training at the Resistance base under the tutelage of Leia. The Resistance announces that the resurrected Emperor Palpatine (Ian McDiarmid) has been manipulating events from the Sith world Exegol and has built the Sith Eternal's fleet of Xyston-class Star Destroyers—the Final Order. Rey discovers from Luke's old notes that a Sith wayfinder can lead them to Exegol. Rey, Finn, Poe, Chewbacca, C-3PO, and BB-8 leave for Pasaana, where a clue to the wayfinder's location is hidden. Rey locates the clue—a dagger with Sith inscriptions—with the help of Lando Calrissian (Billy Dee Williams). Meanwhile, Rey continues communicating with Ren; through this correspondence, Ren learns where Rey is and comes for her. Rey confronts Ren, inadvertently allowing Chewbacca to be taken aboard a First Order transport. Attempting to save Chewbacca, Rey accidentally destroys the transport with Force lightning, seemingly killing him. Rey is stricken with guilt and reveals to Finn that she has been having visions of herself and Ren sitting on the Sith throne.\n\nRey and the others travel to Kijimi, where programmer Babu Frik extracts the location of the wayfinder—the moon Kef Bir[53]—from C-3PO's memory files. Ren and the First Order follow Rey to Kijimi. Rey senses Chewbacca is alive and the group mounts a rescue mission. Rey retrieves the dagger aboard Ren's Resurgent-class Star Destroyer Steadfast and has visions of her parents being killed with it; Ren informs her that she is Palpatine's granddaughter. Palpatine had fathered a son named Dathan who renounced him; he and his wife, Miramir hid Rey on Jakku, assuming lives as \"nobodies\" to protect her. Palpatine’s assassin Ochi eventually found the couple and killed them, but never found Rey. Ren also reveals that as the grandchildren of Sith Lords, their connection is actually a dyad in the Force. Ren urges her to join him so they can overthrow Palpatine and take the throne of the Sith together, but Rey refuses and escapes aboard the Millennium Falcon with her friends.\n\nTogether, they travel to Kef Bir where Rey retrieves the wayfinder on the remains of the second Death Star; upon touching the artifact, she has a vision of herself as a Sith Lady. Having tracked them, Ren destroys the wayfinder and duels Rey. Leia, dying, calls to Ren through the Force; Rey impales him as he is distracted. Also sensing Leia's death, Rey realizes what she did to Ren and regrets impaling him. She uses the Force to heal him and confesses that she did want to join him as Ben Solo before escaping aboard his TIE whisper. Disturbed by her Sith lineage, Rey exiles herself on Ahch-To. Luke's Force spirit encourages her to face Palpatine and gives her Leia's lightsaber and his old T-65B X-wing Red Five. Rey departs for Exegol with the wayfinder from Ren's ship. Meanwhile, Ren resumes his true identity as Ben Solo.\n\nRey transmits her coordinates to the Resistance, allowing them to launch an offensive against the Sith Eternal forces, including the Sith fleet. Rey confronts Palpatine, who demands she kill him in anger for his spirit to pass into her, which will allow him to possess her body. However, Ben arrives and joins Rey. Palpatine absorbs their life energy to restore his full power and incapacitates Ben. He then attacks the Resistance fleet with Force lightning. Weakened, Rey hears the voices of past Jedi, who restore her strength. Palpatine attacks her with lightning, but Rey deflects it using Luke and Leia's lightsabers, killing him and herself. Ben uses the Force to revive Rey at the cost of his own life; Rey kisses Ben before he vanishes into the Force. Rey then returns to the Resistance base and reunites with her friends, celebrating their victory against Palpatine and the Sith Eternal.\n\nSometime later, Rey visits Luke's abandoned childhood home on Tatooine and buries the Skywalker lightsabers, having built her own with a yellow blade.[54] A passerby asks Rey her name; after seeing the Force spirits of Luke and Leia, she responds, \"Rey Skywalker\".[55]\n\nRelated works and merchandising\n\nThe novelization of The Rise of Skywalker reveals that Rey's father was a nonidentical clone of Palpatine.[56] The novel Star Wars: Resistance Reborn depicts Rey in the lead-up to the film,[57] while an issue of the comic book series Star Wars Adventures will feature a story set after the events of the film featuring Rey, Finn, and Poe continuing to fight the remnants of the First Order.[58]\n\nTelevision\n\nStar Wars Rebels (2014)\n\nRey makes a brief cameo as a disembodied voice in the television series Star Wars Rebels, in the episode \"A World Between Worlds\".[5] In the episode, set 16 years before her birth and 35 years before The Force Awakens, the young Padawan Ezra Bridger briefly hears some of her lines from the film (specifically her speaking to the unconscious Finn at the end) in the World Between Worlds, a dimension that exists outside of time and space.[5][59]\n\nForces of Destiny (2017)\n\nRey stars in the micro-series Star Wars Forces of Destiny, voiced by Daisy Ridley.[3]\n\nThe Lego Star Wars Holiday Special (2020)\n\nRey is the protagonist of The Lego Star Wars Holiday Special, set the Life Day after the events of The Rise of Skywalker.[60][61][62] Now a Jedi Master, Rey unsuccessfully attempts to train Finn as her Padawan after having recognized him as Force sensitive. Meditating before turning to ancient Jedi texts, Rey learns of a Jedi Temple on Kordoku where on Life Day, \"a key to the galaxy's past will help make a Jedi's future clearer\" can be found. Leaving Finn to prepare Life Day preparations with Poe, Rey travels to the temple on Kordoku, where the Force leads her to a mysterious blue-green crystal key lying before a sealed doorway. While pondering as to its purpose, Rey witnesses the door begin revolving, opening a portal to the World Between Worlds, a dimension that exists outside of time and space. Sucked through the doorway, Rey lands in the swamps of Dagobah (during the events of The Empire Strikes Back), where she witnesses a younger Luke Skywalker training under Yoda. Rey watches Luke struggle before reopening the portal with the key, bringing her to back to the Kordoku temple in the present. Realising that she can train Finn by travelling in time to other Life Days and watch other Jedi Masters train their students, Rey convinces a reluctant BB-8 to follow her through time, watching Qui-Gon Jinn and his Padawan Obi-Wan Kenobi as they wait to meet the Trade Federation (during the events of The Phantom Menace), before travelling further to witness an older Kenobi and his own Padawan Anakin Skywalker (the future Darth Vader, during the events of Attack of the Clones). After being noticed by the duo, who ignite their lightsabers, Rey bids the pair farewell before turning the key and reopening the portal, finding her in Luke's cockpit during the Battle of Yavin, inadvertently helping him destroy the Death Star before returning to the present.\n\nExhilarated by her experiences of encountering previous Jedi Masters, Rey insists on seeing one more master and apprentice for Finn against BB-8's wishes. Finding themselves onboard the second Death Star in her grandfather Emperor Palpatine's throne room (during the events of Return of the Jedi), Rey witnesses his apprentice, Darth Vader, give him a mug as a gift, of which Palpatine is dismissive. Uneasy, Rey reactivates the portal and leave through it, unknowingly witnessed by Palpatine, who sends Vader through the portal to investigate. On Kordoku, Rey is shocked as Vader enters through the portal before she can close it, igniting his lightsaber before using the Force to snatch the key out of Rey's hands upon noticing her. While the Sith Lord tries to figure out what the device is, Rey charges at him with her lightsaber, and the pair battle with both lightsabers and Force-thrown rocks. He asks if she is a Jedi and Rey confirms this is so. The two fight over the key, causing it to open another portal, sucking them inside and leaving BB-8 behind.\n\nEmerging at Echo Base during the Battle of Hoth (during the events of The Empire Strikes Back), Vader is impressed by Rey's abilities as the two parry, only to be confused by the entrance of his past self onto the scene. Assuming the other Vader to be an imposter, the past Vader attempts to exert his authority, prompting a lightsaber duel between the two Vaders, before size up their Force powers, realizing that they are the same person from two points in time, and ordering their snowtroopers to destroy Rey. She manages to activate the portal and escape, following by the future Vader and two snowtroopers to Mustafar, where Kenobi is dueling Vader's younger self, who has become Vader (during the events of Revenge of the Sith). After one of the snowtroopers attempts to pass the key to Vader after Rey drops it, Rey snatches it in mid-air with the Force, collapsing the platform and causing herself, Vader, the snowtroopers, Kenobi, and Anakin slide down the time portal as lava flows down a valley. Falling through several portals to Nevarro (The Mandalorian), Tatooine (The Phantom Menace), Saleucami (The Clone Wars), Exegol (The Rise of Skywalker), and several other planets, Rey and Vader continue their duel, rapidly entering and exiting a large number of portals, gathering more and more people with them, before finally crashing again on Tatooine, as an adolescent Luke Skywalker watches. As a battle breaks out between the combatants of the struggle between light and dark throughout galactic history, Rey and Vader notice the watching Luke to have the key, before tackling him and being sucked through another portal, landing back on Kordoku before a waiting BB-8. Vader manages to retrieve the key, destroying BB-8 before reactivating the portal and departing before Rey can follow him.\n\nAs Luke repairs BB-8, Rey regrets her recklessness in setting Vader on the loose with the ability to travel through time, before being confronted by Yoda's Force spirit. Lamenting her failure to teach Finn and stop Vader, Yoda reassures her that she can learn from failure to be a better student or better teacher, showing her a Force vision of her friends celebrating Life Day aboard the Millennium Falcon, and Finn using what she thought him to prevent a tree from being toppled, before showing her visions of various Jedi masters with their students including Qui-Gon Jinn, Obi-Wan Kenobi, Anakin, Yoda, and Luke, leading Rey to realize that these masters and students shared a friendship. After Yoda leaves, Rey meditates and uses the Force to light up the other crystals in the cave surrounding the doorway, creating a new portal which she enters with BB-8 and Luke. Finding herself on the second Death Star again, Rey is shocked to see Kylo Ren, Palpatine having thirty years into the future (after the events of The Last Jedi) learned of his own betrayal and apparent death at Vader's hands (although unaware of his secret survival), and recruited Ren to the past to take Vader's place as his primary apprentice.\n\nRecognizing Rey and the younger Luke, Ren engages her in a lightsaber duel, before Vader returns with the older Luke from the moon of Endor, surprising Ren and allowing Rey the opportunity to throw him into Vader. Enlisting the older Luke's help, a lightsaber battle ensures with Ren fighting Luke and Rey fighting Vader, before Palpatine unleashes Force lightning upon Rey and Vader, planning to kill them both. Avoiding the lightning, Rey charges at Palpatine before being intercepted by Ren; to Rey's surprise, Ren deactivates his lightsaber and invites her again to rule the galaxy alongside him, as BB-8 steals back the key from Palpatine. A saddened Rey looks at Kylo Ren and calls him Ben again, before using the key to send him back to his ship in his time. Rey witnesses Palpatine unleash Force lightning upon Luke and Vader, before inviting her to join him as his newest apprentice, which she rejects. Vowing to rule the galaxy by himself, Palpatine summons the key again and attempts to create a new portal, only to be stopped by Rey, who joined by the older Luke, uses the Force to levitate the key before causing it to slam into the Palpatine and Vader, who crashes into the former's throne. With the Sith distracted, Rey departs through a portal with the younger Luke and BB-8, as the older Luke witnesses Vader fling Palpatine down the reactor shaft. Rey takes the younger Luke back to Tatooine before taking the various combatants back to their now separate-timelines, and returning herself to the Jedi Temple on Kordoku.\n\nReturning to the Life Day celebrations on the Millennium Falcon, Rey tells Finn that she is ready to train him, before seeing the Force spirits of Luke and Leia Organa look on.\n\nRobot Chicken (2021)\n\nRey appears in the eleventh season of Robot Chicken, voiced by Jessica Barden.[8] In addition to appearing in skits parodying The Force Awakens and The Rise of Skywalker, Rey stars in \"The Inconvenient Return of Rey Skywalker\". Set immediately after the events of The Rise of Skywalker, after introducing herself as \"Rey Skywalker\" to Barbara and moving into the former Lars household on Tatooine, Rey remains oblivious as Barbara and her husband Victor attempt to steal back a shipment of spice they had stashed in the household, briefly considering killing her to retrieve it before recognizing her as a Jedi. After several unsuccessful attempts at retrieving the spice, during which Rey disposes of her former scavenging gear and the Lars' family remains, the duo attempt to retrieve the spice during Rey's housewarming party, only to find that Rey had discovered the spice and begun sharing it with her guests. Barbara distracts Rey by asking her about her romantic experiences as Victor attempts to take the spice out of the house, only to be discovered by Rey, who flips over the stash and pulls out her lightsaber. Before Rey can do anything else, Luke's Force spirit shows up to join the \"spice party\", encouraging Rey and the other partygoers to dance, as Barbara and Victor decide it would be best to try and steal their spice back again the next day.\n\nVideo games\n\nThe character of Rey appears in the video games Disney Infinity 3.0 (2015), Lego Star Wars: The Force Awakens (2016), and Star Wars: Battlefront II (2017), all voiced by Ridley,[63] as well as in the strategy video game Star Wars: Force Arena (2017).[64] The character was also introduced as a player \"skin\" in the game Fortnite.[65]\n\nReception\n\nGeneral\n\nThe character and Ridley's portrayal have received critical acclaim. Joe Morgenstern of The Wall Street Journal proclaims that Rey is \"a woman warrior with the stylish ferocity of a kung-fu star,\" praising \"the verve [Ridley] must have been born with plus the skill she must have acquired as a young actress coming up in England,\" and stating, \"It's hard to imagine what the movie—and the sequels to come—might have been if they'd cast the wrong person, but here Daisy Ridley is in all her unassuming glory, and all's right with the galaxy.\"[66] Adam Howard of MSNBC states that \"one of the most pleasant surprises of the film has been the strength of its lead female character,\" adding that some have likened Rey to a \"new feminist icon\".[67] In a personal essay, Nicole Sperling of Entertainment Weekly writes about her daughters feeling empowered after viewing the film, stating, \"They never commented on how pretty Rey is. They never had to flinch because Rey was a sexual object to some man in power. They just felt strong. Equal.\"[68] Megan Garber of The Atlantic writes that Rey \"proves herself to be, in extremely short order, extremely adept as a fighter\".[69]\n\nEmily Rome of HitFix describes Rey as \"more 'strong female character' than strongly written\", saying \"the speed with which Rey mastered Jedi mind tricks and lightsaber fighting with zero training is the stuff of fan fiction. Rey is geek feminist wish-fulfillment\".[70] Rome says Rey is \"everything we wanted in a Star Wars female character,\" praising her for being a character that is \"independent, skilled, scrappy, tough, and doesn't need saving.\"[70] Some have debated whether Rey is too skilled despite her inexperience, making her a Mary Sue. Screenwriter Max Landis posted a series of tweets in 2015 derisively referring to The Force Awakens as \"a fanfic movie with a Mary Sue as the main character\",[71][72] on the basis of Rey's seemingly natural skills as a mechanic, a fighter, a pilot, and a user of the Force.[71] Tasha Robinson of The Verge writes that Rey is \"kind of a Mary Sue character\" who \"keeps falling into standard-issue damsel-in-distress situations, then capably rescuing herself [...] She's a fantasy wish-fulfillment character with outsized skills, an inhuman reaction time, and a clever answer to every question — but so are the other major Star Wars heroes.\"[73] Robinson suggests viewers enjoy these qualities in Rey, saying, \"We wouldn't be worrying about Rey's excessive coolness if she were Ray, standard-issue white male hero\".[71][73] Other outlets, including Ridley herself, have argued that the term Mary Sue carries an inherent gender bias,[74] and that the male characters from the original trilogy did not face comparable criticism.[75] Media critic Caroline Framke argues that Rey's abilities are not necessarily any more impressive than those of the character of Luke Skywalker, writing that fans' \"instinctive\" criticism of characters like Rey reflects a double standard.[71] J. J. Abrams stated that \"the people who are getting freaked out are the people who are accustomed to [male] privilege, and this is not oppression, this is about fairness.\" He elaborated, \"You can probably look at the first [Star Wars] movie that George [Lucas] did and say that Leia was too outspoken, or she was too tough. Anyone who wants to find a problem with anything can find the problem. The internet seems to be made for that.\"[76] Adrienne Tyler of Screen Rant argued that Rey's abilities are explained in The Rise of Skywalker as resulting from the pair forming a dyad in the Force, sharing the same fighting capabilities.[77]\n\nRey's unique hairstyle attracted attention before and after The Force Awakens was released,[78] being compared to Leia's hairdo from the original film, with debate over whether it would become as popular.[79] Rey has also been compared to the titular character from the Hayao Miyazaki anime film Nausicaä of the Valley of the Wind (1984).[80]\n\nRichard Roeper described Ridley's portrayal of Rey as \"a breakout performance\", continuing by calling the character \"tough and resourceful and smart and brave\".[81] Ridley was nominated for a 2016 Saturn Award for Best Actress for her portrayal.[82] The first Reel Women in Technology Award for a fictional character was awarded to the character Rey.[83]\n\nSome fans criticized Rey's trilogy-wide character arc as insufficient. Fan fiction author Ricca said that tension that was built in the first two films never gets resolved in the last film. She wanted a moment at the end of The Rise of Skywalker in which Rey reacts to and reflects on everything that has happened to her.[84]\n\nSome critics and fans have noted a visual resemblance between Rey's character design to that of Bastila Shan from the video game Star Wars: Knights of the Old Republic, and that her character arc shares thematic similarities with that of Bastila's.[85][86][87][88]\n\nParentage\n\nThe question of Rey's parentage was a significant point of discussion for the series, and spawned numerous fan theories.[89][90] The most popular theories were that she is the daughter of Luke Skywalker or Han Solo, or is Obi-Wan Kenobi's granddaughter (because of a scene where Rey hears Kenobi's echoed voice following a vision in The Force Awakens).[89][91][92] The view that she is Luke's daughter was especially prominent, with fans and critics highlighting their story arc similarities, Star Wars being a Skywalker saga, Rey having a strong attachment to Luke's lightsaber, and being exceptionally strong with the Force without any training.[91][92][93] Some fan theories about Rey's parentage pointed to \"Rey's Theme\" featured in John Williams' score of The Force Awakens, as the theme shared similarities with the themes for Darth Vader and Luke.[94]\n\nAbrams stated that he intentionally withheld Rey's last name and background in The Force Awakens.[95] He said that he felt that the origin of Kylo Ren was the only thing that could be revealed in his film and that he knew \"quite a bit\" about Rey's origin but would give courtesy to The Last Jedi director Rian Johnson by not saying any more.[96][97] Former Star Wars: Episode IX director Colin Trevorrow stated that the answer of Rey's origin would be \"deeply and profoundly satisfying\" and that Rey is \"important in this universe, not just in the context of The Force Awakens, but in the entire galaxy. She deserves it.\"[98] Ridley said that she knew who Rey's parents were.[24]\n\nIn The Last Jedi, Rey is coaxed by Kylo Ren into admitting that her parents were \"nobodies\". Emily VanDerWerff of Vox equated this scene with Luke finding out that Darth Vader is his father, which was his greatest nightmare.[99] To VanDerWerff, \"Rey's greatest nightmare is being no one.\" She added that while Kylo Ren \"has every reason to be lying\" about this, to her mind it is a good thing that \"Rey is the child of nobody of particular importance to the story so far.\"[99] Josh Spiegel of The Hollywood Reporter stated that although some fans might be disappointed by Ren's revelation, it \"fits in perfectly\" with the film's through line that one can be \"both exceptionally gifted in the Force and also not a Skywalker\" because \"the spirit of the Jedi extends ... to anyone with a gift and the power to believe.\"[100] Conversely, Casey Cipriani of Bustle opined that while Ren might be right about Rey's parents, he is unreliable and \"we have to take what he says with a grain of salt and look elsewhere [within the story] for hints of Rey's lineage.\"[93]\n\nBefore the release of The Rise of Skywalker, Abrams said that \"there's more to the story than you've seen,\"[101] though, according to Ridley, the facts presented in The Last Jedi would not change.[102] Rey being revealed as a Palpatine in The Rise of Skywalker received a mixed reception. Joanna Robinson of Vanity Fair interprets the twist as a rebuttal to the themes presented in Episode VIII, calling it \"a blow to those fans who eagerly devoured [Rian] Johnson’s message that anyone from anywhere can be a Force-wielding hero.\"[103] Contrarily, Ryan Britt of Fatherly writes that the revelation may be resonant for those with a \"Dark Side-inclined family,\" because Rey decides not to play Palpatine's \"stupid game\", and \"when Palpatine’s face melts off and the dark side disappears into the ether, a lot of emotional family bullshit goes with it.\"[104] Inverse similarly argues that the end of the film sees Rey reject \"any power her grandfather held over her\" and \"bury the past\", in a completion of the hero's journey.[105]\n\nFollowing the release of The Rise of Skywalker, Daisy Ridley revealed that the identity of Rey's parents had been in constant flux over the course of the production of the sequel trilogy. According to Ridley, during the early production of the trilogy, Lucasfilm had been \"toying with an Obi-Wan connection\" before settling on the idea of her character being no one.[106] J. J. Abrams then pitched the idea of Palpatine being Rey's grandfather to Ridley during pre-production on Episode IX, although this aspect of her character \"kept changing\" even into production.[106] James Hunt of Screen Rant argues that the idea of an Obi-Wan connection \"would've been an equally bad decision,\" because it would still mean the character \"is powerful because of her lineage, rather than Rey simply being powerful because the Force chose her. It [would have continued] the focus on nostalgia and trying to connect everything, rather than letting Rey be wholly new.\"[107] Kathleen Kennedy later clarified that \"there were a lot of ideas being thrown around\" but that Obi-Wan having offspring \"was pretty much off the table\".[108]\n\nRelationships\n\nFamily tree\n\nMentorship tree\n\n\n\n\n\nReferences\n\nFootnotes\n\nCitations\n\nSources\n\nSzostak, Phil (2015). The Art of 'Star Wars: The Force Awakens' . New York City: Abrams Books. ISBN 9781419717802 .\n\nFurther reading", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/en/a/af/Rey_Star_Wars.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Dragon-149393.svg/18px-Dragon-149393.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/af/Rey_Star_Wars.png/220px-Rey_Star_Wars.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Rey_Palpatine_at_Madame_Tussauds_London.jpg/220px-Rey_Palpatine_at_Madame_Tussauds_London.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/19px-Video-x-generic.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Star_Wars_and_the_Power_of_Costume_July_2018_27_%28Rey%27s_costume_from_Episode_VII%29.jpg/220px-Star_Wars_and_the_Power_of_Costume_July_2018_27_%28Rey%27s_costume_from_Episode_VII%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/a/af/Rey_Star_Wars.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Rey_(Star_Wars)", "title": "Rey (Star Wars)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/a/af/Rey_Star_Wars.png", "width": 640, "height": 790}, "title": "Rey (Star Wars) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}