{"url": "https://www.tvguide.com/news/will-grace-season-2-changes/", "text": "Are Will Truman (Eric McCormack) and Grace Adler (Debra Messing) about to become a family? It sure looks that way!\n\nThe besties were thrown for a loop in Will & Grace's season finale when Will's mom Marilyn (Blythe Danner) and Grace's dad Martin (Robert Klein) suddenly decided to get married a day after they met. While Grace and Will aren't so keen on becoming in-laws, McCormack says he's excited to see how this uncomfortable situation with their parents plays out for the long-time friends.\n\n\"How Will and Grace define themselves will get completely screwed up by that,\" McCormack told TV Guide. \"They can justify their relationship by saying, 'Hey! We're best friends. You're just jealous of our friendship.' And then the minute they have to think of themselves as siblings-in-law, I think it will completely mess with the way that they look at each other.\"\n\nNBC Orders Another Season of the Will and Grace Reboot\n\nAs they realize that their close-knit relationship is about to get even more incestuous, Will and Grace will look to make a few changes in their lives, like possibly no longer being roommates -- a concept that isn't exactly new to the sitcom.\n\n\"The one thing we're always playing with is the actual living together part of it. The show is at its quirkiest when they're sharing a place. But that may have to change, they are grown-ups,\" added McCormack.\n\nAnd with Seasons 2 and 3 of the revival already ordered by NBC, the show will explore the idea that Will and Grace not only live separately but no longer work together as well. Will currently serves as Grace's lawyer and helps her out with her design company, but according to McCormack, they'll soon need some space from one another. \"It's a little too much of each other,\" he said.\n\nWill's evolving relationship with Grace isn't the only potential change headed to the show in Season 10. Jack (Sean Hayes) may soon take the new role of husband. In Thursday's finale, he quickly rebounded from his cop boyfriend by getting engaged to Estefan (Brian Jordan Alvarez), the snarky flight attendant he met just the day before.\n\nWhile we don't yet know whether or not they'll actually go through with the nuptials, McCormack did rattle off a few ideas on how Jack's fast-moving affair might affect Will.\n\n\"I think it's a fun idea to explore that Jack is the one who gets married and not Will because that [would] drive Will insane,\" he suggested. \"When I think about the possibility of Jack getting married, it's almost like switching places. Like Will becomes the one that's sleeping around all the time, suddenly [becoming] the boy crazy one as a reaction to Jack's stability. Who knows.\"\n\nWill & Grace is expected to return this fall on NBC.", "images": ["https://www.tvguide.com/a/img/resize/56d2e7bb7afcf5930c209ce7a7063ff9008a4dd4/hub/2017/10/09/e7351132-d1b9-4eea-96ff-3d99fb219986/keishahatchettbiopic.jpg?auto=webp&height=84&width=84", "https://www.tvguide.com/a/img/hub/2018/04/05/7dc4f9bf-c6e2-4003-9e26-f7a711ffb770/180405-willandgrace-news.jpg", "https://www.tvguide.com/a/img/resize/5110bd10f06690aa4f721ee967b315f7b709ce65/hub/2018/04/05/7dc4f9bf-c6e2-4003-9e26-f7a711ffb770/180405-willandgrace-news.jpg?auto=webp&fit=crop&height=1080&width=1920"], "top_img": "https://www.tvguide.com/a/img/hub/2018/04/05/7dc4f9bf-c6e2-4003-9e26-f7a711ffb770/180405-willandgrace-news.jpg", "keywords": [], "authors": ["Keisha Hatchett", "April", "P.M. Pt"], "canonical_link": "https://www.tvguide.com/news/will-grace-season-2-changes/", "title": "Will & Grace's Eric McCormack Says Changes Are Coming in Season 10", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"app_id": 63084645929}, "google-site-verification": "Od29UEFliEmsUY2XH0kfXxkTNucL0cv_rc0J_RPWXU4", "og": {"site_name": "TVGuide.com", "image": {"identifier": "https://www.tvguide.com/a/img/hub/2018/04/05/7dc4f9bf-c6e2-4003-9e26-f7a711ffb770/180405-willandgrace-news.jpg", "height": 850, "width": 850}, "type": "article", "description": "Eric McCormack weighs in.", "title": "Will & Grace's Eric McCormack Says Changes Are Coming in Season 10", "url": "https://www.tvguide.com/news/will-grace-season-2-changes/"}, "twitter": {"card": "summary_large_image", "site": "@TVGuide", "image": "https://www.tvguide.com/a/img/hub/2018/04/05/7dc4f9bf-c6e2-4003-9e26-f7a711ffb770/180405-willandgrace-news.jpg", "description": "Here's what we know so far.", "title": "Will & Grace's Eric McCormack Says Changes Are Coming in Season 10", "url": "https://www.tvguide.com/news/will-grace-season-2-changes/"}, "nuxtstatus": "loaded", "description": "Here's what we know so far."}, "movies": [], "publish_date": null, "source": "https://www.tvguide.com", "summary": ""}