{"url": "https://en.wikipedia.org/wiki/Perfect_(Ed_Sheeran_song)", "text": "2017 song by Ed Sheeran\n\n\"Perfect\" is a song by English singer-songwriter Ed Sheeran from his third studio album, ÷ (2017).[1] After the album's release, it charted at number four on the UK Singles Chart.[2] On 21 August 2017, Billboard announced that \"Perfect\" would be the fourth single from the album.[3] The song was serviced to pop radio on 26 September 2017 as the third single from the album in the United States (fourth overall).[4] Originally peaking at number four in March 2017, the song re-entered the UK charts later that year. It eventually reached number one on the UK Singles Chart and the US Billboard Hot 100 in December 2017. \"Perfect\" became the UK Christmas number-one song for 2017 and also peaked at number one in sixteen other countries, including Australia, Canada, Ireland, and New Zealand.\n\nThe second version of the single, titled \"Perfect Duet\", with American singer Beyoncé, was released on 1 December 2017.[5] Another duet with Italian singer Andrea Bocelli, titled \"Perfect Symphony\", was released on 15 December 2017.[6] The song and its official music video received three nominations at the 2018 MTV Video Music Awards.\n\nComposition and production [ edit ]\n\n\"Perfect\" was the first track Sheeran wrote for his third studio album ÷.[7]\n\nThe song is a romantic ballad focusing on traditional marriage, written about his wife-to-be Cherry Seaborn, whom he knew from school and then reconnected with when she was working in New York.[8][9] Sheeran revealed that the inspiration for the lyrics came after visiting James Blunt's house in Ibiza, where the two singers had listened to the rapper Future's music at six in the morning.[10] He said: \"Barefoot on the grass, listening to our favorite song, which happened to be Future's \"March Madness\"... I booked the studio for the day, and I had that and I was like, right, let me just flesh that out. And the song happened and was sort of finished that day. I knew it was special.\"[10][11]\n\nSheeran produced the song himself with help from Will Hicks. It was recorded with strings orchestration from his brother Matthew Sheeran.[10] This is the first time the brothers had collaborated on a song as it was the final wish of their grandmother to see the brothers working together before she died. The full string orchestration was later used for the recording with Andrea Bocelli.[12] Another version with slightly different lyrics featuring Camila Cabello and Nicholas Galitzine is included in the Cinderella (2021 soundtrack).\n\nThe song is written in the key of A♭ major (G major in live performances) with a tempo of 63.5 beats per minute in 12\n\n8 time (if not using triplets) or 4\n\n4 time (if using triplets). \"Perfect\" moves at a chord progression of A♭5–Fm7–D♭sus2–E♭. The vocals span from E♭ 3 to A♭ 4 in the song.[13]\n\nCommercial performance [ edit ]\n\nIn March 2017, Sheeran broke the record set by Frankie Laine in 1953, occupying all of the top five positions in the United Kingdom, and placing nine songs in the top ten of the UK Singles Chart.[14] Also, every single one of the sixteen tracks from his new album ÷ entered the top twenty. \"Perfect\" peaked at number four and the song debuted at that position, selling 62,599 copies.[14] After Sheeran's performance of \"Perfect\" on The X Factor on 26 November 2017, the song reached a new peak in the UK, advancing to number three and selling 32,507 units.[15] The Beyoncé version, released on 1 December 2017, drove consumption of the track to 89,359 sales (including 45,460 from sales-equivalent streams) as it became Sheeran's second number-one song from ÷, following \"Shape of You\" – and his fourth number-one single in total.[16] With UK sales of 1,048,313, \"Perfect\" became Sheeran's tenth million-selling single.[16] It became 2017’s Christmas number one single on December 22, 2017.[17] It beat the likes of Wham!, Eminem ft. Ed Sheeran, Clean Bandit ft. Julia Michaels (Clean Bandit had gotten the previous year’s Christmas number one with “Rockabye”), The Pogues ft. Kirsty MacColl, Rita Ora and Mariah Carey to the Christmas number one spot and held the summit for six consecutive weeks before being displaced by Eminem's \"River\", which features Sheeran as a guest artist.[18] As of 2021, it is the longest runner on the UK Singles top 75, with 130 weeks spent on that chart, breaking a 49 year old record that had previously been held by \"My Way\" by Frank Sinatra (124 weeks).\n\nIn the United States, ten songs from ÷ debuted on the Billboard Hot 100 in March 2017, including \"Perfect\" at number thirty-seven.[19] In October, the song ascended to number eighteen and became the third song from ÷ to reach the country's top twenty.[20] It also lifted 4–3 on Digital Songs (50,000 downloads sold), 34–30 on Radio Songs (45 million) and 46–35 on Streaming Songs (11.5 million).[20] On 30 October 2017, \"Perfect\" soared to the top ten on the Billboard Hot 100.[21] The ballad gained in all metrics, holding at number three on Digital Song Sales (53,000, up 7 percent) and climbing 30–22 on Radio Songs (53 million, up 16 percent) and 35–27 on Streaming Songs (13.1 million, up 14 percent).[21] On 20 November 2017, \"Perfect\" pushed to a new Billboard Hot 100 high (8–7) and reached the Radio Songs top ten (17–10; 73 million, up 16 percent).[22] Sheeran scored his seventh Radio Songs top ten and the third from his album ÷, following \"Shape of You\" and \"Castle on the Hill\".[22] The next week, \"Perfect\" hit top five on the Billboard Hot 100, becoming the second-highest-charting hit from his album ÷, following \"Shape of You\".[23] \"Perfect\" became Sheeran's third top five hit overall; his first, \"Thinking Out Loud\", rose to number two in 2015.[23] \"Perfect\" remained at number three on Digital Song Sales (60,000, down 6 percent) and powered 10–6 on Radio Songs (80 million, up 10 percent) and 38–15 on Streaming Songs (18.9 million, up 61 percent).[23]\n\nOn 4 December 2017, \"Perfect\" pushed to a new number three Billboard Hot 100 high, and became Sheeran's third number one on Digital Song Sales (69,000, down 1 percent).[24] He previously topped the chart for a week in 2015 with \"Thinking Out Loud\" and for ten weeks earlier in 2017 with \"Shape of You\".[24] \"Perfect\" reached number one on Digital Song Sales, aided by the first few hours of tracking for its duet version, released before the end of the sales (and streaming) tracking week at 7 p.m. ET on 30 November.[24] For the full week, the Beyoncé version accounted for 18 percent of the song's sales.[24] On 11 December 2017, after a full tracking week, the single topped the Billboard Hot 100 chart, becoming Sheeran's second number-one song in the United States and Beyoncé's sixth as a solo act.[25] \"Perfect\" remained at number-one on the Digital Songs chart with sales of 181,000 copies (up 202 percent).[25] The duet version accounted for 63 percent of the song's total sales for the week.[25] \"Perfect\" also rose 11–3 on the Streaming Songs chart with 34.9 million US streams, up 87 percent, while on Radio Songs, it pushed 4–3 (102 million in audience, up 14 percent).[25] The duet topped the Hot 100 for five weeks. The original version of the song would later take over at the top on the week ending 20 January 2018. After six total weeks at number one, the song was dethroned by \"Havana\" by Camila Cabello featuring Young Thug.[26] \"Perfect\" was the seventh best-selling song of 2017 in the US, with 1,340,000 copies sold that year.[27] It was the best-selling song of 2018, with 1,300,000 copies sold.[28]\n\nThe original version peaked at number one in Austria, Belgium, France, Luxembourg, Malaysia, Netherlands, Philippines, Poland, Scotland, Slovakia, Slovenia, Switzerland and the United Kingdom. After the Beyoncé duet release, \"Perfect\" also reached number one in Australia, Denmark, Germany, Italy, New Zealand, Sweden and the United States.[29][30] Sales of the original version along with sales of the duet version with Beyoncé and Andrea Bocelli also attributed to the song reaching #1 in the UK in late 2017. The song is Sheeran's fourth to reach number one in Australia,[31] and held the country's top spot for eight consecutive weeks before \"God's Plan\" by Drake displaced it.[32] It went to number one as well in Canada, becoming Sheeran's second number one there and Beyoncé's first.[33][34] As of 3 January 2019, the song has sold 207,000 digital copies in Canada.[35]\n\nMusic video [ edit ]\n\nThe video for \"Perfect\" narrates a romantic story that happened in the Hintertux Mountains , Austria\n\nOn 22 September 2017, a lyric video for \"Perfect\" was released on Sheeran's YouTube channel.[36] The music video for \"Perfect\" was released on Sheeran's YouTube channel on 9 November 2017. The video stars Zoey Deutch and was directed by Jason Koenig, who also directed the video for \"Shape of You\". The video was filmed at the Austrian ski resort of Hintertux[37] and shows Sheeran and Deutch going on a ski trip with friends, with the two dancing in the snow and ending up in a cabin together.[38] Ross McNeilage who writes for MTV UK called the video a \"Christmas dream\" for its wintery visual. While praising the simple story and the video's cinematography, McNeilage noted that Zoey Deutch acts opposite to the superstar as his love interest and we watch as they \"coyly flirt until they realise their love for one another and slow dance in the snow together.\"[39] As of April 2022, the music video has received 3.1 billion views on YouTube,[40] making it the 28th most viewed video on the site.[41] It received nominations for Song of the Year, Best Pop Video and Best Direction at the 2018 MTV Video Music Awards.[42]\n\nRemixes [ edit ]\n\nIn November 2017, Sheeran released an acoustic version of \"Perfect\" and two remixes by Mike Perry and Robin Schulz.[43][44][45]\n\nFormats and track listings [ edit ]\n\nDigital download No. Title Length 1. \"Perfect\" 4:23\n\nDigital download – acoustic[43] No. Title Length 1. \"Perfect\" (acoustic) 4:20\n\nDigital download – Mike Perry remix[44] No. Title Length 1. \"Perfect\" (Mike Perry remix) 3:41\n\nDigital download – Robin Schulz remix[45] No. Title Length 1. \"Perfect\" (Robin Schulz remix) 4:09\n\nGerman CD single[46] No. Title Length 1. \"Perfect\" 4:23 2. \"Perfect\" (acoustic) 4:20\n\nCharts [ edit ]\n\nCertifications [ edit ]\n\nRelease history [ edit ]\n\nPerfect Duet [ edit ]\n\nOn 1 December 2017, a duet by American singer Beyoncé titled \"Perfect Duet\" was made available worldwide.[5][217][218]\n\nThe song is a stripped down, acoustic version of the original, with Beyoncé singing the second verse from a female perspective. Sheeran stated the song was Beyoncé's favorite from the album, and reached out to her to re-record the song. Beyoncé agreed, and the two recorded the song in May 2017.[219]\n\nLive performances [ edit ]\n\nBeyoncé performed her verse as part of the setlist during the On the Run II Tour in 2018. On 2 December 2018, almost exactly a year since the release of the duet version, Ed Sheeran and Beyoncé performed the first-ever live rendition of \"Perfect Duet\" at the 2018 Global Citizen Festival in Johannesburg, South Africa.[220]\n\nTrack listing [ edit ]\n\nDigital download – duet with Beyoncé[217][218] No. Title Length 1. \"Perfect Duet\" (with Beyoncé) 4:19\n\nCharts [ edit ]\n\nWeekly charts [ edit ]\n\nYear-end charts [ edit ]\n\nYear-end chart performance for duet Chart (2018) Position Portugal (AFP)[251] 79 Sweden (Sverigetopplistan)[252] 3\n\nDecade-end charts [ edit ]\n\n2010s-end chart performance for duet Chart (2010–2019) Position US Billboard Hot 100[253] 15\n\nCertifications [ edit ]\n\nCertifications for duet Region Certification Certified units/sales New Zealand (RMNZ)[254] 2× Platinum 60,000 Portugal (AFP)[255] Platinum 10,000 Spain (PROMUSICAE)[256] 7× Platinum 280,000 Sales+streaming figures based on certification alone.\n\nRelease history [ edit ]\n\nPerfect Symphony [ edit ]\n\nAn operatic version of \"Perfect\" with Andrea Bocelli, titled \"Perfect Symphony\" and sung partly in Italian, was released on 15 December 2017.[261][262]\n\nComposition [ edit ]\n\nA fully orchestral version of the song was recorded at Abbey Road Studios although only parts of it were used in the original release of the song.[7][10] The full orchestral version was used in the duet with Andrea Bocelli.[12]\n\nMusic video [ edit ]\n\nOn 15 December 2017, a music video for \"Perfect Symphony\" was also released.[263]\n\nTrack listing [ edit ]\n\nDigital download – duet with Andrea Bocelli[6][260] No. Title Length 1. \"Perfect Symphony\" (with Andrea Bocelli) 4:25\n\nCharts [ edit ]\n\nRelease history [ edit ]\n\nSee also [ edit ]\n\nNotes [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/8/80/Ed_Sheeran_Perfect_Single_cover.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/80/Ed_Sheeran_Perfect_Single_cover.jpg/220px-Ed_Sheeran_Perfect_Single_cover.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/93/Ed_Sheeran_%26_Andrea_Bocelli_-_Perfect_Symphony.jpg/220px-Ed_Sheeran_%26_Andrea_Bocelli_-_Perfect_Symphony.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/3/37/Dagger-14-plain.png", "https://upload.wikimedia.org/wikipedia/commons/f/f9/Double-dagger-14-plain.png", "https://upload.wikimedia.org/wikipedia/en/thumb/7/79/Ed_Sheeran_and_Beyonce_-_Perfect_Duet.png/220px-Ed_Sheeran_and_Beyonce_-_Perfect_Duet.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Hintertux_-_panoramio_%281%29.jpg/220px-Hintertux_-_panoramio_%281%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/8/80/Ed_Sheeran_Perfect_Single_cover.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Perfect_(Ed_Sheeran_song)", "title": "Perfect (Ed Sheeran song)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/8/80/Ed_Sheeran_Perfect_Single_cover.jpg", "width": 640, "height": 640}, "title": "Perfect (Ed Sheeran song) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}