{"url": "https://www.nbcnews.com/storyline/bill-cosby-scandal/closing-arguments-begin-bill-cosby-s-sexual-assault-retrial-n868686", "text": "NORRISTOWN, Pa. — The fate of Bill Cosby was now once again in the hands of a jury after the dramatic retrial at which the comedian was accused of sexual assault by a half-dozen women.\n\nThe jury, which began deliberating Wednesday morning, will decide whether Cosby, 80, is guilty of three counts of aggravated assault against one woman, Andrea Constand, 45, who claims the comedian drugged and sexually assaulted her in his home in January 2004.\n\nDeliberations are to resume Thursday morning. Cosby made no comment as he and his lawyers left court about 9:45 p.m.\n\nAndrew Wyatt, who has served as Cosby's spokesman throughout the trial, told reporters Wednesday night that the lack of a quick verdict led him to believe that jurors \"will find Mr. Cosby not guilty on all charges.\"\n\n\"What we are seeing and what we are appreciating is the fair impartiality that they are showing,\" Wyatt said.\n\nDefense attorneys portrayed Constand as lying about the sexual encounter, which Cosby has claimed was consensual, and jurors returned to the courtroom early Wednesday afternoon to ask, \"What is the legal definition of consent?\"\n\nMontgomery County Common Pleas Judge Steven O'Neill said that he couldn't give them a legal definition and that they would have to answer that question on their own, using their \"common sense.\"\n\nIn this trial, unlike in the first, prosecutors were allowed to call five more accusers in addition to Constand. Prosecutors said that Cosby preyed on Constand and that all the women who testified against him had \"strikingly similar stories.\"\n\nO'Neill issued specific instructions regarding the five additional accusers who testified. He told the jurors that they could only use the evidence for a limited purpose — to show a common plan, scheme or design or to demonstrate that the defendant didn't make a mistake.\n\nHe said the jury couldn't conclude from the five additional accusers that Cosby has \"bad character or criminal tendencies.\"\n\nHe also gave the jury specific instructions about the testimony of prosecution witness Chelan Lasha, one of the five additional accusers. Defense attorneys attacked her testimony by pointing out that she has a prior conviction for making false statements to police. O'Neill told jurors that they could consider her conviction in deciding whether to believe all or part of her testimony.\n\nThe judge also instructed the jury that Constand's testimony alone is enough to convict Cosby.\n\n\"It does not need the support of other evidence,\" he said. He also told the jury that it could convict Cosby based on circumstantial evidence and that it didn't need to determine a specific motive to reach a guilty verdict.\n\nCosby, sitting next to his defense team, appeared solemn as the judge read the charges.\n\nIn two hours of closing arguments, Cosby's defense team painted Constand as a \"con artist\" and a \"pathological liar\" seeking fame and fortune and willing to blackmail Cosby in pursuit of those goals.\n\nDefense attorney Kathleen Bliss suggested that Constand and the other women who testified \"were motivated by a common movement, many of them represented by the same attorney,\" she said, referring to Gloria Allred and her daughter, Lisa Bloom, who is also a lawyer. Bliss emphasized a proposal from Allred for a $100 million settlement fund in 2014.\n\nTom Mesereau, Cosby's lead attorney, told the jury that the case was about a \"blind 80-year-old man with a successful career facing absolute ruin.\"\n\nMesereau walked the jury through a PowerPoint presentation, pointing to what he characterized as 12 inconsistent statements about the nature of Constand's relationship with Cosby, including whether they had flirted before the alleged assault, whether they were ever alone together and whether she had been in bed with him. He said her statements were not simply \"inconsistencies ... they are lies.\"\n\n\"This woman will say anything. She will absolutely say anything. She's a pathological liar,\" he added.\n\nBliss also questioned the prosecution's decision to bring in witnesses to testify that Cosby assaulted them more than 30 years ago.\n\n\"How unfair is that — digging up stuff from three decades ago?\" she asked. She also told the jurors that they shouldn't allow the #MeToo movement, which has exposed scores of men in the media, entertainment and business worlds as sexual harassers, to sway their decision.\n\n\"Don't get me wrong — bad things definitely happen. But, ladies and gentleman, not every accusation is true. Your common sense tells you that,\" Bliss said. \"We do have to deal with sexual assault. It's a worldwide problem, just like we do with sexual harassment, pay disparity, social inequality.\n\n\"But questioning an accuser is not shaming them,\" she added.\n\nBut Assistant Montgomery County District Attorney Kristen Feden told jurors that it was Cosby, not Constand, who was the con artist and that the women who testified against him had \"all strikingly similar stories.\"\n\n\"He preyed on Andrea Constand the same way he preyed on all those five women,\" she said.\n\nShe prosecutor also lambasted Bliss for \"character assassination\" of the accusers.\n\n\"That character assassination that Ms. Bliss put those women through was utterly shameful,\" she said. \"She's the exact reason why women, victims of sexual assault and men don't report these crimes.\"\n\nWhile there have been dozens of sexual misconduct allegations against Cosby, the Constand case is the only complaint that has resulted in criminal charges. Cosby has repeatedly denied all allegations of sexual misconduct, which have ranged from groping to sexual assault to rape, with many of the accusers claiming that he drugged them.\n\nCosby's first trial last year ended in a deadlocked jury, so his retrial has become the first big celebrity court case since the #MeToo movement emerged. In the first trial, the jury deliberated for 52 hours and failed to reach a verdict, resulting in a mistrial.\n\nCosby declined to testify at both trials. If convicted, he could face a maximum sentence of 10 years and a fine of up to $25,000 on each count.\n\nMeredith Mandell and Adam Reiss reported from Norristown. Daniella Silva reported from New York.", "images": ["https://media-cldnry.s-nbcnews.com/image/upload/t_fit-760w,f_auto,q_auto:best/newscms/2018_17/2410756/180425-bill-cosby-al-1008.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-760x428,f_auto,q_auto:best/MSNBC/Components/Video/201804/nn_sgo_cosby_trial_180423_1920x1080.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-760x428,f_auto,q_auto:best/MSNBC/Components/Video/201804/d_ov_feature_Cosby_180417.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_17/2410756/180425-bill-cosby-al-1008.jpg", "https://media2.s-nbcnews.com/j/newscms/2018_15/2393556/180410-bill-cosby-mn-0855_735dbb8eaf077443512dbfe8c192bab8.focal-60x60.jpg"], "top_img": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_17/2410756/180425-bill-cosby-al-1008.jpg", "keywords": [], "authors": ["Meredith Mandell", "Adam Reiss", "Daniella Silva"], "canonical_link": "https://www.nbcnews.com/storyline/bill-cosby-scandal/closing-arguments-begin-bill-cosby-s-sexual-assault-retrial-n868686", "title": "Bill Cosby's sex assault trial now in hands of jury", "meta_data": {"msapplication-config": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/nbcnews/all-other-sizes-PNG.ico/browserconfig.xml", "robots": "max-image-preview:large", "fb": {"app_id": 10150138890205613, "pages": 1508175089456029}, "og": {"site_name": "NBC News", "locale": "en_US", "url": "https://www.nbcnews.com/storyline/bill-cosby-scandal/closing-arguments-begin-bill-cosby-s-sexual-assault-retrial-n868686", "title": "Bill Cosby's sex assault trial now in hands of jury", "description": "The jury will decide whether Cosby, 80, is guilty of three counts of aggravated assault.", "image": {"identifier": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_17/2410756/180425-bill-cosby-al-1008.jpg", "secure_url": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_17/2410756/180425-bill-cosby-al-1008.jpg", "type": "image/jpeg", "width": 1200, "height": 630}, "type": "article"}, "twitter": {"site": "@NBCNews", "creator": "NBCNews", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1024-512,f_auto,q_auto:best/newscms/2018_17/2410756/180425-bill-cosby-al-1008.jpg", "title": "Bill Cosby's sex assault trial now in hands of jury", "description": "The jury will decide whether Cosby, 80, is guilty of three counts of aggravated assault.", "card": "summary_large_image"}, "viewport": "width=device-width, initial-scale=1, user-scalable=yes", "description": "The fate of Bill Cosby is once again in the hands of a jury after the dramatic retrial at which the comedian was accused of sexual assault by multiple women.", "branch": {"deeplink": {"title": "Bill Cosby's sex assault trial now in hands of jury", "description": "The jury will decide whether Cosby, 80, is guilty of three counts of aggravated assault.", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_17/2410756/180425-bill-cosby-al-1008.jpg", "type": "article", "unibrow": "U.S. news", "authorName1": "Meredith Mandell", "authorName2": "Adam Reiss", "authorName3": "Daniella Silva"}}, "article": {"opinion": "false", "content_tier": "free", "published": "Thu Apr 26 2018 01:57:20 GMT+0000 (UTC)", "modified": "Thu Apr 26 2018 01:57:20 GMT+0000 (UTC)"}, "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_social_share_1024x768_scale,f_auto,q_auto:best/newscms/2018_17/2410756/180425-bill-cosby-al-1008.jpg", "next-head-count": 110}, "movies": [], "publish_date": 1524707840.0, "source": "https://www.nbcnews.com", "summary": ""}