{"url": "www.postbulletin.com/watching-britney-spears-fall-apart-is-no-laughing-matter/article_fad4e4e4-aaa7-5cb7-87ef-cf6dde62a5a7.html", "text": "LEONARD PITTS JR.\n\nFor some reason, that picture sticks in my head. The one of Britney Spears attacking a car with an umbrella.\n\nGo ahead and laugh if you want. I won’t blame you.\n\nStill, the picture — it was all over the news — stops me. There she is, this pop princess, newly bald, dressed unglamorously in shorts and sweatshirt, rearing back with an umbrella, ready to give that car what it has coming. Supposedly, the vehicle belongs to a photographer who had been tailing her.\n\nIn that photo, there is something of the spoiled child lashing out. Something of the little girl, broken. Something of the baby crying for help.\n\nADVERTISEMENT\n\nAs I said, I can’t blame you if you laugh. Blaming you would be hypocritical.\n\nBritney Spears doesn’t get a lot of air time in my internal monologue. I don’t listen to her music or watch her videos. She’s a presence at the edge of consciousness, more famous for being pretty and showing skin and sowing scandal than for any intrinsic quality of her singing. Suffice it to say, Gladys Knight’s legacy is safe from her encroachment. Barbra Streisand does not suffer in the comparison.\n\nTo the degree I think about her at all, it’s usually as a laugh line. People ask if I miss being a pop music critic, having spent the first 18 years of my professional life in that capacity. I tell them I give thanks every morning that I don’t have to pretend to take Britney Spears seriously. It’s always good for a chuckle.\n\nThat’s what Spears was to me: a punchline.\n\nAm I the only one? Or isn’t it true that between her two-day first marriage, her Madonna kiss on national television, her panties-optional dress code, she long ago became, even for her fans, a person whose attraction lay less in her modest talents than in the sense you never knew what she might do next? She was a little crazy. A little out of control. A little clueless in ways that made you feel better about the garbage of your own life.\n\nAs in, maybe I ain’t no Nobel Prize winner, but at least I have sense enough to wear underwear when I go out.\n\nAnd you could say this, talk about her like she wasn’t in the room, because she was not, in some sense, real. Spears was an abstract, an idea. Not a troubled young woman who has been in and out of rehab in recent days, a woman for whom fame and fortune have apparently proven inadequate to fill the emptiness inside.\n\nThe abstraction is not surprising: whatever media touch, they objectify. Some years ago, I got an e-mail from an outraged reader who, as the saying goes, called me everything but a child of God. I e-mailed him back and we ended up having a perfectly civil exchange. I remember he seemed embarrassed, as if he had not quite realized that the byline represented an actual human being who might actually read his invective. He had hurled it at an idea of me.\n\nADVERTISEMENT\n\nBut I am not an idea.\n\nIf that can be forgotten about someone whose claim to fame is just that he scribbles in newspapers, how much more easily is it forgotten about those who live in the klieg lights of real fame? What must it be like to have your marriage and divorce, your relationship with your parents and kids, your sagging backside and ballooning thighs, dissected by millions of strangers who think they know you? Does money make that OK? Do luxury and fame?\n\nI wouldn’t think so. Life is not a show. But if we ever knew that, we forgot it in our rush to a day of \"reality\" television, tabloid journalism and famous for nothing celebrities. There is no reverence, no privacy, nothing held back as sacred. We ooh and ahh and laugh and point at the garbage of other lives, and forget that even the most famous person is still a person, not an idea.\n\nBritney Jean Spears is not an idea. She’s a 25-year-old mother of two who is coming apart at the seams. In public.\n\nGo ahead and laugh if you want.\n\nLeonard Pitts Jr. is a columnist for the Miami Herald. His e-mail address is lpitts@miamiherald.com.", "images": ["data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSI0MHB4IiB3aWR0aD0iMTcwcHgiPjwvc3ZnPg==", "https://cdn.forumcomm.com/dims4/default/90f79a4/2147483647/strip/true/crop/1600x778+0+211/resize/1440x700!/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Fpostbulletin%2Fbinary%2Fe6a6d04a7102eea37e1f974aa9714b9d_binary_5052588.jpg", "data:image/svg+xml;base64,PHN2ZyB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciIHZlcnNpb249IjEuMSIgaGVpZ2h0PSIzMjZweCIgd2lkdGg9IjQ5MHB4Ij48L3N2Zz4=", "https://cdn.forumcomm.com/dims4/default/d79919d/2147483647/strip/true/crop/620x220+0+0/resize/225x80!/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.amazonaws.com%2Fbrightspot%2F23%2Fca%2Fbda7544849e8b24b4e3a39532aec%2Fpostbulletin.png", "https://static.forumcomm.com/images/trust-project/trustproject.png"], "top_img": "https://cdn.forumcomm.com/dims4/default/90f79a4/2147483647/strip/true/crop/1600x778+0+211/resize/1440x700!/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Fpostbulletin%2Fbinary%2Fe6a6d04a7102eea37e1f974aa9714b9d_binary_5052588.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.postbulletin.com/news/watching-britney-spears-fall-apart-is-no-laughing-matter", "title": "Watching Britney Spears fall apart is no laughing matter", "meta_data": {"og": {"title": "Watching Britney Spears fall apart is no laughing matter", "url": "https://www.postbulletin.com/news/watching-britney-spears-fall-apart-is-no-laughing-matter", "image": {"identifier": "https://cdn.forumcomm.com/dims4/default/90f79a4/2147483647/strip/true/crop/1600x778+0+211/resize/1440x700!/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Fpostbulletin%2Fbinary%2Fe6a6d04a7102eea37e1f974aa9714b9d_binary_5052588.jpg", "url": "https://cdn.forumcomm.com/dims4/default/90f79a4/2147483647/strip/true/crop/1600x778+0+211/resize/1440x700!/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Fpostbulletin%2Fbinary%2Fe6a6d04a7102eea37e1f974aa9714b9d_binary_5052588.jpg", "width": 1440, "height": 700, "type": "image/jpeg"}, "description": "LEONARD PITTS JR.", "site_name": "Rochester Post Bulletin", "type": "article"}, "article": {"published_time": "2007-03-13T09:00:00", "modified_time": "2013-01-14T04:36:55", "section": "News"}, "twitter": {"card": "summary_large_image", "description": "LEONARD PITTS JR.", "site": "@pb_news", "title": "Watching Britney Spears fall apart is no laughing matter"}, "fb": {"app_id": 639461793855231}, "viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=5", "description": "LEONARD PITTS JR.", "brightspot.contentId": "0000017d-8d52-d9e2-abff-afdf77f3019d", "brightspot.cached": "false"}, "movies": [], "publish_date": 1173776400.0, "source": "http://www.postbulletin.com", "summary": ""}