{"url": "https://www.cosmopolitan.com/style-beauty/fashion/a22854133/zodiac-sign-fall-fashion-outfits/", "text": "Holy sh*t, guys—you’re going to have a great fall. There are tons of astrological reasons why (we’ll get to that in a minute, but it has to do with the fact that Jupiter—the luckiest planet—is hanging out in Sagittarius for the rest of the year; plus, a few retrogrades are finally bowing out, thank God).\n\nTo capitalize on this momentous time for literally everyone, we put Jake Register of Jake’s Astrology to work with our fashion team to find your luckiest look for your peak fall moment.\n\nClick your zodiac sign to find the outfit inspo you need to live your best damn autumn life.\n\nAries Ruben Chamorro Taurus Ruben Chamorro Gemini Ruben Chamorro . John Francis Cancer Ruben Chamorro\n\nLeo Ruben Chamorro Abby Silverman Virgo Ruben Chamorro Libra Ruben Chamorro Scorpio Ruben Chamorro\n\nSagittarius Ruben Chamorro Capricorn Ruben Chamorro John Francis Aquarius Ruben Chamorro Pisces Ruben Chamorro\n\nPack your bags—it’s time to plan a trip. When Jupiter enters Sagittarius on November 8, it’s all about learning. “Aries’ upcoming year essentially has an extra helping of good luck, and the most growth happens in the area of life regarding travel, education, philosophy, and foreign cultures,” Jake says. Meaning? It’s the perfect time to explore a new place and just let loose.\n\nWhen you go, you’ll want to make sure you pack your brightest, most effortless clothes. Consider something with warm colors that accentuate your fire sign vibes, then go for a breezy feel in the spirit of the light, carefree atmosphere of your trip. “Aries wouldn’t want anything too tight-fitting during this time, so keep it loose and flowy and comfortable,” Jake says. “It’s a very relaxed, pleasant recreational time.”\n\n\n\nPro tip: Keep your beauty look low-key too.\n\n\n\n, $56; (Available at Shopbop), $760\n\nBACK TO MENU\n\nYour fall starts off rough, but good news: Venus retrograde is over as of November 16, meaning your world—particularly as it pertains to your career—is about to feel way more purpose-driven and orderly. “Tauruses are very business-minded, but work’s a little funky for them in the fall,” Jake says. “As soon as this retrograde lifts, they’ll feel refreshed and able to conquer—get back at it.”\n\nTo coordinate with your grab-your-career-by-the-reins moment, you need a killer outfit for your next big meeting. “Tauruses don’t have a lot of drama—they’re cut and dry, matter of fact, and that goes all the way to their wardrobe choices,” Jake says. “This time around, though, I think they’d experiment with something that has sharp lines and some architectural flair that’s trendy but still reads office-appropriate.” Consider a neutral jumpsuit, like this one, paired with a striped blouse and mustard turtleneck. These earthy colors pay tribute to your element.\n\nAs for your beauty situation, keep it natural: A bold brow and fresh face will work to accentuate this look without taking away from it.\n\n, $80; , $70; Vivetta Striped Shirt, Price Upon Request; , $70; Socks, Stylist’s Own\n\nBACK TO MENU\n\nAs soon as Jupiter enters Sagittarius on November 8, it’s time to focus on your friendships, because your whole crew is feeling closer and more intimate than ever. “For a bit longer than a year, Jupiter, associated with good fortune and expansion, enters the relationships sector of Gemini’s chart,” Jake says. “The next year of Gemini’s life will see a lot of strong friendships being formed and serious relationships established.” Translation: Y’all need to schedule a girls’ night out for as soon as possible after this astrological event.\n\nAs for your outfit? “You’ll want to wear something with movement, because Geminis are very flexible,” Jake says. “It needs to have not too much going on but a lot going on at the same time—that’s what Geminis are all about.” Try a lacy top with a pair of coordinating wide-leg pants in yellow, the traditional color of the air sign, which makes you stand out from the crowd. Don’t be afraid of accessories, either. “Geminis love to accessorize and really pile it on,” he adds, and this the night for it.\n\nBeauty-wise, think romantic, with a smudge of brown on your lids and a glossy lip.\n\n(Available at Shopbop), $273; (Available at Shopbop), $345; Mona Sultan Honey and White Polka-Dot Large Neckerchief, $85; (Available at What Goes Around Comes Around), Price Upon Request; , $395\n\nBACK TO MENU\n\nGirl, you are in for the chillest fall of your life. In astrology, there are these things called trines, which basically means three planets or other horoscope points are aligned in a triangle, creating harmony. In general, they are going to make you feel like everything is just as it should be in all your relationships—look out for November 6, when the sun is in Scorpio and it trines with Neptune, and December 21, the last day of fall, when Venus is in Scorpio and it trines with Neptune. “These trine moments hone in on Cancer’s relationships and love life, and it’s a great way for them to end the year on a high note, feeling remarkably strong connections to others and lots of emotional satisfaction,” Jake says.\n\nCapitalize on these two days by getting all hygge with your best buds, and either have a wine night in your apartment or grab a low-key coffee around the corner. “Wear something you can get cozy in—but not too comfortable! We don’t want you in a Snuggie or anything,” Jake says. Get yourself an oversize duster sweater you can wear as a dress, and cinch it with a belt bag, topping off the style with a pair of sock booties. Bonus points if your ensemble follows the moody ocean blues associated with your water sign.\n\nAlthough your aesthetic may be casual, feel free to go all-out with your makeup—consider, for instance, a navy winged liner.\n\n, $1,250; , $50; Jennifer Fisher Crystal Earrings, $725; Jennifer Fisher Palm Ring, $250; Necklaces, Model’s Own\n\nBACK TO MENU\n\n\n\nWhen Jupiter enters Sagittarius on November 8, according to Jake, it’s in the part of your zodiac sign’s chart that has to do with love, romance, and sex, so let’s just say you’re going to want to get. it. on.\n\nSo it goes without saying you'll need a killer date-night outfit. Because you’re a Leo, that means something daring, bold, and show-stopping. “Leos like to grab the spotlight—like, she’s going on a date with one person, but that doesn’t mean she doesn’t want all eyes on her,” says Jake. “She’ll wear something sexy—and definitely leather.” Think about sporting a black skirt with flirty cutouts. A bright red top will put the emphasis on your fire sign, as will “look at me!” statement patterns like houndstooth and angled stripes.\n\nIn the beauty department, don’t be afraid to go bold—try emphasizing your lip liner.\n\nSelf-Portrait Satin Eyelet Tie-Sleeve Top, $293; Self-Portrait Black Faux-Leather Wrap Skirt, $282; , Price Upon Request; , $10\n\nBACK TO MENU\n\n“Mars is the planet of passion and energy. When it enters Pisces—the opposite sign of Virgo—on November 15, it brings its fiery touch to Virgo’s relationships,” Jake says, hinting that it’s a great time to spark a bond with a totally new pal. What better way to do that than to head to a concert together? One night, tons of memories, and a solidified friendship? Yes, please!\n\nGoing to a concert means mastering the art of looking chic without trying too hard, something Virgo nails every time. “Virgos aren’t in your face like a Leo or Aries, but she’s still going out and wants to make a splash,” Jake says. “She’ll probably do it by layering some more oversize pieces over sexier, tighter clothes.” With that in mind, take a little risk in a shiny pair of lace-up leggings in a deep teal, a nod to your earth element. That, plus a vintage rocker tee, snakeskin booties, and an oversize jean jacket with funky waxed details are perfect for you.\n\nDon’t overthink your hair and makeup. Instead, go with the flow in a messy low pony with S-waves, face-framing pieces, and a shimmery eye.\n\nMISBHV Denim Jacket, $298; (Available at What Goes Around Comes Around), $500; , $1,111; , $100; Jennifer Fisher Mini Drew Hoops, $265; , $375\n\nBACK TO MENU\n\nLibra season goes from September 22 through October 23. That’s when the sun, the brightest part of the Zodiac, is in Libra, and it is all about you. In particular, it’s all about your love life, so it’s time to get flirty. “In general, Libra season is pleasant, light-hearted, social, and romantic,” Jake says. “There’s a reason this time of year is called ‘cuffing season,’ and that’s because of all the Libra energy in the air!”\n\nSo let’s get you a baller date-night lewk, shall we? “Libras are a little bit extra, but not as extra as Leos—they’ll want to look super glam for this date,” Jake says. “As far as what they should wear, definitely something that has a slit, which conveys how open they are to love.” A maxi dress in your air colors would work great: think blues, purples, whites, and light grays. Top off the style with an unexpected matching leather trench and neutral sock booties, and you’ve got yourself a bangin’ fashion aesthetic.\n\nOn your face, create a fresh look with blush. For hair, big roller curls will add a vampy, retro vibe.\n\nMISBHV FANTASY Leather Trench Coat, Price Upon Request; , $70; Jennifer Fisher Quad Hoops, $395; , $110\n\nBACK TO MENU\n\nScorpio season—a.k.a. when the sun is all up in your zodiac sign—is from October 23 to November 22, and “it’s a time when you’ll feel confident, refreshed, and able to accomplish work,” Jake says. Take that get-sh*t-done attitude, apply it to your job, and just generally kick ass, OK? And dress to kill if you have an interview or a big presentation coming up.\n\n“This look should be powerful. Scorpios aren’t afraid to wear colors that stand out and catch your eye—reds, purples, blacks,” says Jake. Try a body-hugging sweater dress in fuchsia—with striking patterns befitting your intense, work-hard vibes. Even better if your piece has a cool texture, like fringe, to make it stand out.\n\nSince there’s a lot going on fashion-wise, it’s OK to tone down your makeup, but keep it fun with a lip that matches the hues of your outfit.\n\n, Price Upon Request; Anita Berisha Femme Earrings, $90\n\nBACK TO MENU\n\nSure, everyone else is going have a great fall, but you’re going to have, like, the best. fall. ever. That’s because that lucky Jupiter planet is in your sign, which means you stand to benefit the most. “This is the luckiest planet in the luckiest sign,” Jake says. “It’s going to be a time where you feel great and way luckier than normal.” When that happens (November 8, BTW), take off work, and just live your best life: Start with a major brunch, go shopping, explore your city—it’s going to be a good day.\n\nSo…what kind of outfit is worthy of this special, special time for you? “Sagittariuses are really loud and proud, so a bold color, like orange—which is even better because that’s a Jupiter color—would be perfect here,” Jake says. A look-at-me jumpsuit in a flowy silk will do just the trick. Wear a cute thin knit underneath, and you’ve got a comfy, cozy, show-stopping situation going on.\n\nAs for your makeup, get your peachiest blush on, mimic it for your eyes, then create your best version of sexy bedhead hair.\n\nA Peace Treaty Marigold Jumpsuit, Price Upon Request; Orange Top, Stylist’s Own; Dinosaur Designs River Rock 2 Drop Earrings, $220\n\nBACK TO MENU\n\nHear me out: You may not be a Libra, but Libra season (September 22 through October 23) affects your sign, making you super confident in your career and in your general atmosphere at work, according to Jake. “When the sun is in Libra, it’s a significant point in time for Capricorns, because it lights up the part of their chart known as the ‘midheaven’ or the ‘tenth house,’ which is the highest point on an astrology chart,” says Jake. “When there’s action in a chart’s midheaven, it’s a time where the sign is fully in the spotlight, all your hard work and achievements of the past year are on display…it’s a time of recognition and praise from colleagues,” he says. So why not accept those compliments in an updated work wardrobe?\n\nAs an Earth sign, think about pieces that incorporate silver, metallic, grays, and other earthy tones, like deep green, when you’re upgrading to a trendier aesthetic. A cool, glittery dress with an architectural sleeve could work great, especially when toned down and layered beneath a more approachable shirtdress. If the style is pinstriped, more power to you, according to Jake: “Pinstripes are important to a Capricorn, because they’re structured and organized, and this sign is all about things falling in line.” Pair with coordinating ankle booties and a geometric bag, and you’ll be getting compliments on your wardrobe as well as on your work ethic.\n\nAs for beauty, be true to your natural self, and rock a fresh face with emphasized brows and freckles.\n\n, $95, , $358; Jennifer Fisher Convertible Globe Duster, $400; Jennifer Fisher Palm Ring, $250, Jennifer Fisher Male Ring, $295; (Available at Shopbop), $375; , $475\n\nBACK TO MENU\n\nLibra season, which is September 22 through October 23, also has great effects on Aquariuses. For you, that translates to traveling and learning about other cultures, so take a break from the daily grind, and go on a road trip with your best friend. “This is more the kind of trip where you’re not relaxing, you’re involved, exploring cities—it’s a busy feeling,” says Jake.\n\nJake adds that Aquariuses are “the sign of the zodiac that’s most eccentric, most different, and that factors into their wardrobe too. They’re a bit boho and hippie with a hint of edge.” Don’t be afraid to showcase that aspect of your style while hitting the road. Think: comfy, eye-catching pieces in blues, grays and whites, which will honor your air-sign vibes. Why not wear a pair of roomy wide-leg trousers with a netted top accented with jewels? Top with a pale-blue trench and a cool cap to bring it all together.\n\nFor makeup, get a little quirky, and express yourself. Don't be afraid to take risks with geometric liner—or even a different shadow color for each eye.\n\nLou De Betoly Embellished Top, Price Upon Request; Topshop Plisse Robe Duster Coat, $110; Acne Studios Pants, Stylist’s Own; Shoes, Model’s Own; Eugenia Kim Hat, $275; Jennifer Fisher Palm Earrings, $575\n\nBACK TO MENU\n\n\n\nNot going to lie, fall is going to be an emotional time for you, Pisces. For starters, from November 15 until the new year, Mars is hanging out in your sign. And Neptune makes a cameo on December 7, creating a very heightened, passionate trio. “Neptune is Pisces’ ruling planet, so any action happening to Neptune is felt by Pisces…Neptune is dreamy, intuitive, psychic, and passionate—in conjunction with Mars, it’s also energetic, fiery, and explosive,” Jake says. In other words: Hold tight, because December 7 is going to be a wild ride. But if you spend it with people you love, you just might get even closer to them, bonding like you’ve never been able to before. “Mars will be powering up Neptune’s empathetic properties, so having a crazy in-depth heart-to-heart conversation with your girls is likely.” Use this force for good, and have a GNO with your best friends—all while dressing to impress.\n\nPay tribute to Neptune and to your watery roots by wearing deep, sea-green colors, like teal and dark blue, and something roomy on the bottom, like a harem pant or culottes. “With Neptune being dreamy, a looser, flowy trouser is definitely the way to go,” says Jake. Since this is a girls’ night, though, def get your sexy on in a tighter crop top, which you can wear beneath a bold, patterned overcoat.\n\nHave fun with your makeup look, paying tribute to your sign with an ombré eye that mimics the oil-slick vibes of metallic fish scales.\n\nVersus Versace Jacket, Price Upon Request; , Price Upon Request; , $190; Jennifer Fisher Unicorn Hoops, $325; MISBHV Snake Ankle Boots, $705\n\nBACK TO MENU\n\nPhotographer: Ruben Chamorro; Stylist: Yety Akinola; Fashion Editor: Rachel Torgerson; Assistant Fashion Editor: Lauren Adhav; Creative Director: Abby Silverman; Beauty Director: Carly Cardellino; Makeup Artist: Chistyna Kay; Hair Stylist: Jerrod Roberts; Nail Artist: Kayo Higuchi; Special thanks to: Jake Register of Jake’s Astrology and ANYWAY Studio\n\n", "images": ["data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/astrology-backup-new-1537896542.jpg?crop=1.00xw:0.892xh;0,0.0399xh&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/astrology-backup-new-1537896542.jpg?crop=1.00xw:0.892xh;0,0.0399xh&resize=1200:*", "keywords": [], "authors": ["Rachel Torgerson", "Fashion Features Director"], "canonical_link": "https://www.cosmopolitan.com/style-beauty/fashion/a22854133/zodiac-sign-fall-fashion-outfits/", "title": "The One Outfit Your Zodiac Sign Should Wear This Fall", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=6", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "The One Outfit Your Zodiac Sign Should Wear This Fall", "description": "Our astrologer-and-stylist team found your single luckiest look.", "url": "https://www.cosmopolitan.com/style-beauty/fashion/a22854133/zodiac-sign-fall-fashion-outfits/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/astrology-backup-new-1537896542.jpg?crop=1.00xw:0.892xh;0,0.0399xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2022-08-24T20:39:13Z", "published_time": "2018-09-25T18:29:00Z", "section": "Style", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/astrology-backup-new-1537896542.jpg?crop=1.00xw:0.892xh;0,0.0399xh&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Fall Fashion Looks for Every Zodiac Sign - Astrology Outfit Ideas", "description": "Cosmopolitan.com and Jake’s Astrology put together the luckiest fall fashion trends for every zodiac sign.", "keywords": "lucky outfits, best outfits for zodia signs, zodiac outfits, zodiac fashion, astrology outfits, astrology fashion, fall outfits, fall fashion", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/astrology-backup-new-1537896542.jpg?crop=0.498xw:0.886xh;0.250xw,0.0199xh&resize=320:*", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "sailthru.contenttype": "long-form-article", "sailthru.tags": "Beauty & Style,style-beauty,fashion", "sailthru.date": "2018-09-25T18:29:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/astrology-backup-new-1537896542.jpg?crop=1.00xw:0.892xh;0,0.0399xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/astrology-backup-new-1537896542.jpg?crop=0.498xw:0.886xh;0.250xw,0.0199xh", "sailthru.socialtitle": "The One Outfit Your Zodiac Sign Should Wear This Fall", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1537900140.0, "source": "https://www.cosmopolitan.com", "summary": ""}