{"url": "https://www.washingtonpost.com/entertainment/music/is-there-life-after-mmmbop-hanson--yes-that-hanson--turns-25/2017/08/30/1b3b755a-8c00-11e7-91d5-ab4e4bb76a3a_story.html", "text": "1 of 18 Full Screen Autoplay Close Skip Ad × Where is the band Hanson now? View Photos Brothers Isaac, Taylor and Zachary are celebrating their 25th anniversary as a musical group. Caption Brothers Isaac, Taylor and Zachary are celebrating their 25th anniversary as a musical group. Isaac, Zac and Taylor Hanson on Main Street in Tulsa’s Brady Arts District, where the band is renovating a building to house their studio, brewery and performance space. The famed Cain’s Ballroom, once home to Bob Wills and the Texas Playboys, is in the background. Shane Bevel/For The Washington Post Wait 1 second to continue.\n\nUPDATED from August 2017: You can now hear Geoff Edgers’s interviews with Hanson in the “Edge of Fame” podcast. Look for the “play” button below or subscribe on iTunes or Stitcher.\n\nOne day, during a recent rehearsal with his brothers, Zachary Hanson used the “F” word. This, in itself, should not be notable. Hanson has four children. He drives a pickup. He recently shed 35 pounds with Lose It! And lots of people use the “F” word.\n\nExcept, for many, he is still Zac, the adorable, shaggy-haired preteen pounding out “MMMBop.” The drummer in a boy band that sold 10 million copies of its 1997 debut album, performed on “Saturday Night Live” and the Grammys and at the World Series (all in the same year), and appeared on the cover of Tiger Beat with teen heartthrob Jonathan Taylor Thomas.\n\nZac isn’t reminiscing as he talks over a new song, “I Don’t Want to Go Home,” with his brothers, Taylor and Isaac. He’s contemplating the opening verse. The narrator, in a bar during last call, sings, “I’m feeling dangerous.”\n\nCould he switch “feeling” to that more profane word with the same first letter?\n\nIn the end, Zac leaves the lyrics alone.\n\n“You put it in there and it feels really good, but it just colors the whole song,” he says. “There’s a certain point when I’m like, ‘I like this song more than I like singing f---.’ ”\n\nAs Hanson rehearses on this Sunday afternoon, it’s hard to believe the brothers are preparing for a tour celebrating a quarter century as a band. Isaac, the eldest of the brood, is 36. The work, on this afternoon, is not particularly glamorous. They tighten the breaks in “Tragic Symphony.” They smooth out a new song, “I Was Born.”\n\nFinally, as Isaac noodles through the intro to “Johnny B. Goode” and Zac offers up a figure-skating analogy that doesn’t particularly make sense, Taylor grows impatient.\n\n“Let’s not try to reinvent the wheel right now,” he says, and they begin to play again.\n\nAt one time, Hanson’s rise, from flyover Oklahoma to mega stardom, may have seemed stunning in itself. But the band’s greatest feat may be how it has survived — and without a scandal, rehab or “Sharknado 4.” The Hanson way has been marked by the brothers’ special ability to say no — always politely, of course — to record execs who didn’t get it; to a culture desperate for confessions; even, at times, to each other.\n\nAs they embark on the American leg of their anniversary tour, the brothers haven’t so much reinvented themselves as merely grown into older versions of their teenage selves.\n\n“They beat the system,” says Danny Goldberg, who signed Hanson while chairman of Mercury Records and both praises them and laments that they didn’t listen to him more.\n\n“They used it, they got what they wanted out of it and then they’ve done things completely on their own terms, without worrying about any other metrics except their own. They could have done other things to make more money, but they put their personal happiness and contentment first.”\n\n‘Why would you do rock-and-roll?’\n\nIf you were there that summer, you couldn’t avoid it. “MMMBop” arrived April 15, 1997. By May, it had knocked off the Notorious B.I.G. and taken the top slot of the Billboard Hot 100. The single remained at No. 1 for three weeks and topped the charts in 27 countries, from Australia to Sweden.\n\nHanson mania hit. David Spade pretended to be the fourth Hanson brother at the MTV Movie Awards. Oprah had them play her talk show and, as she cut to a commercial, found herself singing the chorus. Will Ferrell and Helen Hunt took the brothers hostage in an elevator, at gunpoint, during a skit on SNL.\n\n“Did you write the song ‘MMMBop?’” Hunt shouts after the doors close.\n\nFerrell hands her a pair of earplugs. He looks at the boys.\n\n“You will now listen to the song as long as it takes for you to feel the pain that we felt this past summer,” he tells them before the music kicks in.\n\nTwenty years later, Hanson doesn’t shy away from “MMMBop,” even if they’ve had to shift it from the key of A to E to accommodate Taylor’s no longer being 14. But they embrace it. After starting a beer company in 2013, they even named their signature pale ale “MmmHops.”\n\n“People will often ask us the question with that tone,” says Isaac. “ ‘Well, do you play that song?’ Of course we do.”\n\nThere is one secret he shares about “MMMBop.” As much as it’s catchy pop candy, the song also is about losing friends and always feeling a bit different. To make his point, he speaks some of the lines.\n\n“So hold onto the ones that really care. In the end they’ll be the only ones there. When you get old and start losing your hair, can you tell me who will still care?”\n\n“That song,” he says, “was basically about getting the stink eye from a bunch of folks at our church because we wanted to do rock-and-roll, and they were like, ‘Why would you do rock-and-roll? Why wouldn’t you just sing gospel songs?’ ”\n\nThis explains an important part of the Hanson dynamic. It’s why they never totally let their guards down, never completely trust outsiders. That’s what happens when you’re always somewhere between embraced (by your still obsessive core of fans) and misunderstood (by the adults). The answer, for Hanson, has been to pull back, compartmentalize, to keep some spaces for themselves. Consider their approach to faith — one of the more polarizing subjects in modern culture and certainly pop music.\n\nAs kids, the boys would overhear the whispers among the mothers at their church. It’s just a phase. They’ll get over it. As teen stars in a secular field, they knew people wouldn’t understand why they still went to church. They dodged when asked whether they prayed. They made it clear that music and religion were separate entities in their lives.\n\nIn 1997, when famed director Gus Van Sant approached Hanson as a fan and proposed making their next video, Goldberg put in a call to their father, Walker. He wanted to make sure they were okay being associated with the director of “My Own Private Idaho.”\n\n“I told them about Gus and explained that he was gay and told them about some of the movies he’s made,” Goldberg says. “Without hesitation, Walker says, ‘If you think he’ll make a great video, that’s the right person.’ ”\n\n\n\nFrom left, Isaac, 11, Taylor, 9, and Zac Hanson, 6, perform in front of a panel of local judges for the chance to do their first public show at the Mayfest Arts Festival in their home town of Tulsa in May 1992. (Walker Hanson)\n\n\n\nThe Hanson Brothers perform at the Arthur Ashe Stadium in the USTA National Tennis Center in New York in 1997. (Adam Nadel/Associated Press)\n\nHanson at a party after hosting the MTV Movie Awards in 2001. (Mark J. Terrill/Associated Press)\n\nHanson approaches interviews and publicity with a guarded warmth. They’ll welcome you to their home town, chat for hours at a restaurant and let you scour their merch room. They won’t take you home to hang with the family or to church on Sunday. They certainly won’t let your reality show in.\n\nThat’s what A&E discovered, 10 years ago, after greenlighting a pilot for a Hanson family show. The deal fell apart when the production company suggested a staged argument between the Hanson wives over what they fed their children.\n\n“The thing that would drive the ratings, all the drama around family and raising their kids, having to share all that was not acceptable to them,” says Jordan Berliant, one of their managers at the time.\n\n“That’s the difference,” Isaac says when explaining why they’ve never been desperate for attention. “I don’t think we were ever trying to be famous. That wasn’t the goal. The goal was, ‘I want people to sing my songs.’ ”\n\nThat dynamic, of keeping things to themselves, extends to the relationship among the brothers. There’s nothing special about sibling strife in rock bands, from the Everlys to the Kinks, Oasis and the Black Crowes. Isaac is loath to discuss it, though, calling it “dirty laundry.” Zac is more open.\n\nFor Hanson, a low point came about four years ago, when the band embarked on what was meant to be a 20th-anniversary celebration. In 2013, after releasing their sixth studio album, “Anthem,” and touring, they were tired of the record/tour/record cycle — and of each other. What exactly happened is unclear.\n\nBut Hanson took most of 2014 off. Ultimately, they decided to regroup.\n\n“I don’t know the Davies brothers,” says Zac. “I don’t know the Kings of Leon and how they hate or love or whatever. I have been training for this job my whole life. The idea of conflict resolution is not some new thing. It is simply what you have to do every day of your life. And so we just do it. When we yell at each other, we yell at each other until we are not yelling at each other. And when somebody says, ‘Maybe I’ll quit today,’ you say, ‘You are an idiot, and I’ll see you tomorrow.’ Because there is so much in it, so much you care about. The answer is not ‘I give up.’ It’s just not.”\n\n\n\nFrom left, Issac, Zac and Taylor Hanson on Main Street in Tulsa. (Shane Bevel for The Washington Post)\n\nTeen heroes to road warriors\n\nPerhaps the most important misunderstanding — and biggest frustration for Hanson — is how their music has been viewed by the wider world. In Wiki-shorthand, they’re still the teeny-boppers who ushered in the boy-band era and, in the process, tortured most of adult America.\n\nThe comparisons to ’N Sync and the Backstreet Boys still bother them. Their music, after all, has always had more in common with Spoon and Squeeze than anything in Lou Pearlman’s stable. And Hanson’s latest song, “I Was Born,” released this summer, is as catchy as anything the band has done. NPR praised it as nothing short of “fantastic.”\n\nThey do know music, having made their most formative connection via a Time/Life anthology of 1958 hits purchased by their parents. When Walker and Diana Hanson took the family to South America for a year in 1989, the boys played that tape — stuffed with Chuck Berry, Little Richard and Eddie Cochran — over and over.\n\nIsaac and Taylor also took piano lessons while abroad and started singing together, which continued when they got back to Tulsa. A family video, circa 1992, shows the boys — 11, 9 and 6 — singing Bobby Darin’s “Splish, Splash.” The Hanson Brothers, as they were called, made their first performance at an arts festival in Tulsa in 1992. By 1996, Hanson had released two self-produced albums and went to the South by Southwest festival in Austin to try to get attention. It didn’t work at first.\n\nBefore their first-ever performance in 1992, Diana Hanson filmed her sons singing \"Splish Splash.\" At the time, Zac was 6, Taylor was 9 and Isaac was 11. (Courtesy of Hanson)\n\n“There was no way I was going to sign them,” says Steve Greenberg, a Mercury talent scout. “We were just coming out of grunge, and everything was so dark and negative.”\n\nBut then Greenberg had an epiphany while in a supermarket checkout line.\n\n“I pulled out one of those teen magazines and realized as I was looking through, there were no pictures of any musicians,” he says. “It was all pictures of Jonathan Taylor Thomas and actors. Of course, you can’t put Eddie Vedder in there. I just realized there was a huge hole here. I thought, ‘I wish there was somebody like that.’ ”\n\nA Mercury colleague slipped Greenberg a tape, which included a rawer version of “MMMBop.” Greenberg signed Hanson and brought in the Dust Brothers, fresh off Beck’s “Odelay,” to give the song a little extra punch. With 1997’s “Middle of Nowhere,” Hanson became the rare teen band on the cover of Teen and topping the Village Voice’s Pazz and Jop critics poll.\n\nEven then, the brothers weren’t afraid to choose their own path.\n\nGreenberg recalls how hard he and Goldberg pushed Hanson to get back into the studio to capitalize on the success of “Middle of Nowhere.” Fame is fleeting, they argued. You have to take advantage of the moment. They refused, wanting instead to prove themselves on the road. Their follow-up, “This Time Around,” didn’t arrive until 2000. It barely cracked the Top 20.\n\n“They never regained their teen audience,” says Greenberg. “What they got was the undying loyalty of the core of their original fans. They’re able to go out, able to tour, and they’re a really excellent band. Instead of looking out and seeing a room of 13-year-old girls, what you see is a room full of 33-year-old women.”\n\n\n\nFrom left, Zac, Taylor and Issac Hanson film an interview with the crew from Signal Factory in the middle of Main Street during their Hop Jam beer and music festival in Tulsa in May. (Shane Bevel for The Washington Post)\n\nBack to Tulsa\n\nTaylor is still deadly handsome, a wearer of skinny jeans and leather boots. He’s not just the lead singer. He also sets the tone in interviews — warm, gracious but never confessional or uncontrolled. At one point, Goldberg expected him to break away from the band.\n\n“There’s just no question that Taylor could have gone solo right away and tried to compete with Justin Timberlake for that slot in the culture,” he says. “It was just [not] going to happen.”\n\nTaylor’s allegiance is on full display in “Strong Enough to Break,” a 2006 documentary, available on YouTube, that details the band’s struggles after “This Time Around.” By the time Hanson was working on their third album, Mercury had been consumed by Island Def Jam Recordings. Goldberg and Greenberg were gone. Instead, they had Jeff Fenster, an executive who rejected almost everything they presented.\n\nWatching Hanson deal with Fenster is a lesson in self-control. Or self-abuse. At one point, during a phone call, the exec dismisses songs they’ve recorded with Greg Wells, who would go on to produce massive hits for Adele and Twenty One Pilots.\n\n“We don’t have an album,” Fenster says.\n\nYou want Taylor to scream, smash the receiver and pull a Wilco, abandoning the major label hacks for an indie. Instead, he and Isaac weakly flip the bird to the phone and then he pleads for another chance.\n\n“We so are trying to get where you’re coming from,” Taylor says. “So help us out here.”\n\nHanson finally split with Island Def Jam in 2003. Five years later, they moved their base of operations back to Tulsa and began releasing albums on their own and having children. (The brothers, all married, have 12 among them.) They also established what is effectively Hanson Inc.\n\n\n\nThe Hanson brothers brew, market and sell their own line of beers. (Shane Bevel for The Washington Post)\n\nFans raise their cellphones to take photos as Hanson takes the stage at Hop Jam. (Shane Bevel for The Washington Post)\n\nThey have offices in a downtown building stuffed with employees, a recording studio and everything from jewelry and T-shirts to the “Hansonopoly” board game. They launched a beer company, and in 2014 started Hop Jam, a craft beer and music festival in Tulsa.\n\nStill, none of it is meant to replace the band’s central mission — music.\n\nBackstage at this year’s Hop Jam, there are Hansons everywhere. Wives, in-laws, Walker and Diana. A baby with a pink ribbon in her hair. And then they’re on.\n\nThe set stretches from “MMMBop” to “I Was Born.” These days, Hanson doesn’t measure success in record sales. They look at their live show. Most of the tour dates are sold out, and at Hop Jam, the street is packed.\n\nIn the front row, a line of women, most between 25 and 35, bop to the beat of “Get the Girl Back” and shout as Taylor emerges from a riser in the center of the crowd to sing “Fired Up.” Zac hops out from behind his kit to perform one of his underappreciated gems, “Juliet.”\n\nThe next morning, at Tulsa International Airport, Jennifer Parks, 32, is still buzzing as she waits to board a flight back to Virginia. She’s with a friend she met at a Hanson show four years ago.\n\nHop Jam was Parks’s 60th Hanson gig since her first — Virginia Beach in 1998. What draws her is more than the music. The guys treat their fans with respect and love. They meet them before shows, pose for pictures, even allow fans to enter a contest to interview them. They’re more than a band, which is why she and her friends have never moved on.\n\n“When we come here every year, it’s not just for Hanson,” she says. “It’s one big family.”", "images": ["https://img.washingtonpost.com/rf/image_60w/2010-2019/WashingtonPost/2017/08/30/Style/Images/sa-hanson_03.JPG?uuid=r6JMuozWEeecU2oWm-sJUw", "https://img.washingtonpost.com/rf/image_60w/2010-2019/WashingtonPost/2017/08/30/Production/Sunday/SunArt/Images/SB052117_WPHanson_707.JPG?uuid=R84JGowQEeeR1atOS7dqOg", "https://img.washingtonpost.com/rf/image_60w/2010-2019/WashingtonPost/2017/08/30/Production/Sunday/SunArt/Images/SB052117_WPHanson_1457.JPG?uuid=TX94MIwQEeeR1atOS7dqOg", "https://img.washingtonpost.com/rf/image_60w/2010-2019/WashingtonPost/2017/08/30/Production/Sunday/SunArt/Images/SB052117_WPHanson_1364.JPG?uuid=WBwDOowQEeeR1atOS7dqOg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://www.washingtonpost.com/pb/resources/img/spacer-gray.png&w=1&h=1", "https://www.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2017/08/30/Style/Images/sa-hanson_03.JPG?t=20170517", "https://img.washingtonpost.com/rf/image_60w/2010-2019/WashingtonPost/2017/08/30/Style/Images/92-MayfestAuditionsHANSON.jpg?uuid=Jta8SowOEeeR1atOS7dqOg", "https://img.washingtonpost.com/rf/image_60w/2010-2019/WashingtonPost/2017/08/30/Style/Images/sa-hanson_04.JPG?uuid=tlBhKIzWEeecU2oWm-sJUw", "https://img.washingtonpost.com/rf/image_606w/2010-2019/WashingtonPost/2017/08/30/Production/Sunday/SunArt/Images/SB052117_WPHanson_1524.JPG", "https://img.washingtonpost.com/rf/image_60w/2010-2019/WashingtonPost/2017/08/30/Production/Sunday/SunArt/Images/SB052217_WPHansonPortrait_2633.JPG?uuid=cwt9TIwQEeeR1atOS7dqOg"], "top_img": "https://www.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2017/08/30/Style/Images/sa-hanson_03.JPG?t=20170517", "keywords": [], "authors": ["Geoff Edgers", "Reporter Covering Movies", "Museums", "Comedy", "Music", "Pop Culture", "March", "The Washington Post'S National Arts Reporter", "Covers Everything Fine Arts To Popular Culture. He'S The Author Of", "Walk This Way"], "canonical_link": "https://www.washingtonpost.com/entertainment/music/is-there-life-after-mmmbop-hanson--yes-that-hanson--turns-25/2017/08/30/1b3b755a-8c00-11e7-91d5-ab4e4bb76a3a_story.html", "title": "Is there life after ‘MMMBop’? Hanson — yes, that Hanson — turns 25.", "meta_data": {"eomportal-uuid": "1b3b755a-8c00-11e7-91d5-ab4e4bb76a3a", "object-hash": 1665251121, "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.5, maximum-scale=2.0", "referrer": "unsafe-url", "keywords": "hanson, MMMBop, boy bands, justin Timberlake, Taylor Hanson, zac hanson, isaac hanson, this time around, tulsa, mmmhops, hanson 20 years, hanson 25 years, hanson anniversary, hanson tour, biggest hit of 1997, hop jam", "news_keywords": "hanson, MMMBop, boy bands, justin Timberlake, Taylor Hanson, zac hanson, isaac hanson, this time around, tulsa, mmmhops, hanson 20 years, hanson 25 years, hanson anniversary, hanson tour, biggest hit of 1997, hop jam", "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "creator": "@geoffedgers"}, "og": {"type": "article", "site_name": "Washington Post", "url": "https://www.washingtonpost.com/entertainment/music/is-there-life-after-mmmbop-hanson--yes-that-hanson--turns-25/2017/08/30/1b3b755a-8c00-11e7-91d5-ab4e4bb76a3a_story.html", "image": "https://www.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2017/08/30/Style/Images/sa-hanson_03.JPG?t=20170517", "title": "Is there life after ‘MMMBop’? Hanson — yes, that Hanson — turns 25.", "description": "They performed their first concert in 1992 and had a No. 1 hit five years later. The best part is the boy band never went away."}, "article": {"publisher": "https://www.facebook.com/washingtonpost", "content_tier": "metered", "opinion": "false", "author": "https://www.facebook.com/geoff.edgers"}, "fb": {"app_id": 41245586762, "admins": 500835072}, "description": "They performed their first concert in 1992 and had a No. 1 hit five years later. The best part is the boy band never went away.", "robots": "index,follow", "theme": "normal", "author": "https://www.facebook.com/geoff.edgers"}, "movies": ["https://www.youtube.com/embed/NHozn0YXAeE"], "publish_date": 1504047600.0, "source": "https://www.washingtonpost.com", "summary": ""}