{"url": "http://empoweringastrology.com/may-2018-horoscopes", "text": "Welcome to Taurus Season, the time in the zodiac calendar when we connect with the earth beneath our feet. Taurus is the fertility of life, the soil the grows the food we eat, the stability that comes with having resources like money and a roof over our head. Taurus is also the pleasure and sensuality that comes with living.\n\nThis Taurus Season, however, will bring a bit of a jolt. Starting May 15 the planet Uranus, after seven years in Aries, will arrive in Taurus, awakening of consciousness to element earth. Uranus in Taurus will be a revolution of value and ownership, a transformation of our relationship with food and money. On its most fundamental level, Uranus in Taurus will give us a radical new understanding of our planet and the fragile balance that everyone and everyone takes for granted.\n\nMars will also change signs on May 15, adding fuel to an already supercharged day. Moving into Aquarius, a sign that it will be in until August, action will now happen on a collective level. Social causes, politics, and activism will all be hot button issues. On a personal level, Mars in Aquarius will inspire us to form community and make friendships or social connection a priority. Mars’s square off with Uranus on May 16, however, may bring a jolt to this new Uranus in Taurus era.\n\nEven though the movements of Uranus and Mars dominate the headlines for May, there are other things going on, namely a Taurus New Moon on May 15. Money, stability, and material needs are at the forefront for the coming lunar month. Additionally, with the energy of the new moon pointing to Venus in Gemini, the coming four weeks will be busy, chatty, and filled with movement.\n\nMercury finally switches signs, too. After two months in Aries, Mercury arrives in Taurus on May 13. Taurus is a slow and chill placement for the usually quick and agile Mercury, but we’ll be acutely aware of the value of our choices. Communication will be practical and down to earth.\n\nVenus also changes sign, moving into Cancer on May 19. We’ll see a shift in Taurus Season after this point too, moving from the restless curiosity of Gemini to the heart and emotional connection of Cancer. Whatever is shaking up with Uranus in Taurus may now have an emotional component. And seeing how Venus will start to face off with Saturn, we may have a serious decision to make around May 26.\n\nWe end the month with a Sagittarius Full Moon, one that will highlight themes we were working on during Saturn’s visit to Sagittarius from 2015 to 2017. Themes like faith, meaning, integrity, right and wrong. Full moons bring matters to a head, but whatever does come about may touch on the spiritual and intuitive with Jupiter harmonizing with compassionate Neptune. Maybe everything is going to work out after all.\n\nRead for your Sun and rising sign.\n\nDATES TO NOTE: 5/6 Sun sextile Neptune; 5/7 Mercury square Pluto, Venus square Neptune; 5/8 Sun opposite Jupiter; 5/11 Sun trine Pluto; 5/12 Mercury square Mars; 5/13 Mercury in Taurus, Mercury conjunct Uranus; 5/15 New Moon 24 Taurus, Uranus in Taurus, Mars in Aquarius; 5/16 Mars square Uranus; 5/18 Mercury trine Saturn; 5/19 Venus in Cancer, Venus sextile Uranus; 5/20 Sun in Gemini, Mars sextile Chiron, Venus square Chiron; 5/22 Mercury sextile Neptune; 5/23 Mercury opposite Jupiter, Sun trine Mars; 5/25 Jupiter trine Neptune, Mercury trine Pluto; 5/26 Venus opposite Saturn; 5/29 Full Moon 8 Sagittarius, Mercury in Gemini.\n\nAries\n\nMarch 21–April 19\n\nAries, did you read your horoscope last month? We had a bit of a chat — a chat about the last seven years and how your life has been in a major state of ups and downs since then. If astrology teaches us about time and our relationship with time, then the planets are like hands on the clock that move into different signs or different hours. In 2011, the planet Uranus moved into the sign of Aries for a seven year stay, pointing you to a new hour — a time of revolution, evolution, breakthrough, and awakening. Now at the end of this story, it’s time to reflect a bit on what’s changed and how you have transformed as a person. You’re the sign of bravery, Aries, so hopefully your courage has seen you through the many times you’ve had to reinvent yourself. This month will straddle two chapters, one where you’re seeing the end of this part of your life and another where you’re stepping into a new story. That’s when Uranus arrives in Taurus on May 15. With the hand of the clock pointing to a new hour, it’s time to evolve your consciousness around the material side of life. As the first earth sign, Taurus teaches us about the physical world, from the money and resources we need to survive to food, pleasure, and fertility. Uranus will be shaking up what you you value. It will be demanding new authenticity around what you own and how you make your money. It will be revolutionizing your awareness around what you need. It will push you to look at your self worth as well as the worth of everything around you . . . for the next seven years. Coincidentally, also on May 15, Mars will change signs. As your ruling planet, it’s arrival in Aquarius will point you towards friends, community, and your hopes and wishes for the future. When Mars changes signs, it will square off with Uranus. You may feel quite restless in the run up to May 15, as if something has to radically change. If Mars’s time in Capricorn during March and April has been any indication, you’ve been working hard, trying to make something of yourself, and thinking about what direction you want to go in life. Maybe May is the month where you really put your ideas and ambitions into motion. (Not that Mars will go retrograde from June 26 until August 27 so whatever new beginnings you’re thinking about may take some time to unfold as you pull back and rework things during the middle of 2018.) Want to learn more about how the astrology of May will affect you? Book your consultation now.\n\nKey Themes: Transformation, breakthrough, change, money, income, value, worth, material needs, material life, stability, security, what you own, assets, self worth, fertility, career, public life, reputation, status, responsibilities, ambitions, recognition, friendships, social network, social circle, community, belonging, the future, hopes, dreams, social issues, humanitarian work, the collective, politics.\n\nTaurus\n\nApril 20–May 20\n\nHold onto your horns, Taurus. You’re starting a new seven year story, one that will mark your life with change, transformation, and revolution. You know, we’ve been talking about this for a few months now, how you were coming up to a big shift. And I get it, Taurus. You’re a sign that doesn’t like to shake things up. You like things calm and predictable because, as an earth sign, you create the energy of stability. But here comes the planet Uranus, arriving in Taurus on May 15, and jolting your whole world. It’s quite possible that you’ve been feeling this coming, this restless feeling that something has to change. Like the mythical Prometheus, Uranus brings the fire of consciousness. You will have new sight on your life as well as yourself. And with new awareness comes the realization of what’s working and not working in your life. It’s safe to say that over the coming seven years — yes, seven — you’re going to reinvent yourself. Maybe it starts with a change of hairstyle or clothes, but by the end it will almost be on a cellular level. Uranus demands authenticity, it demands truth, and it demands a break from the past. So, my dear Taurus, whatever is inauthentic, whatever is not in the truth of who you are, and whatever it is from the past that is holding you back will need to go. Yep, it’s time for change, Taurus. With Uranus dominating the headlines this month, it’s easy to forget that it’s your birthday season. (Sorry, how could I forget???) And you’re getting quite the cosmic gift. It’s important to spend some time reflecting on what you want to create in your coming personal year, especially since the energy is fertile for powerful transformation. On the same day that Uranus changes signs, Mars will also change signs, bringing the energies of change also to your relationships. If you’re in a partnership, you may see a shift, a change of seasons, the arrival of a new chapter, or possibly even a break. If you’re single but wanting to connect with a mate, all these celestial gear shifts may awaken you to a new awareness of the type of partner you want versus what you’ve been reaching for in the past. On May 19, your ruling planet, Venues, will arrive in Cancer, helping you to express your sensitive and caring side into the rest of the month. And since Cancer is one of your travel signs, you may round out the month on the go or planning a trip. By the end of May, a full moon will strike at the heart of your emotions. With everything in flux, you have have to do some soul searching, taking a deep look at your shadow self as well as how you sabotage and hold yourself back. As I mentioned, Uranus will be shining a light on everything, including the deepest parts of yourself. Want to learn more about how the astrology of May will affect you? Book your consultation now.\n\nKey Themes: You, the self, individuality, new beginnings, radical change, transformation, breakdowns, breakthroughs, awakening, new consciousness, new thought, new vision, earthquakes, shake ups, shocks, new you, reinvention, revolution, money, value, stability, security, material possessions, what you own, what you need, relationships, other people, partnerships, career, direction, responsibilities, life direction.\n\nGemini\n\nMay 21–June 20\n\nGemini, if you’ve been paying attention, you’ll know that we’re coming up on a big deal planetary shift on May 15, the day that Uranus, after seven years in Aries, changes signs and enters Taurus. Now, this change will likely be more subtle compared to what other signs are experiencing, but it will shake up a particular part of your chart, bringing Uranus’s patented energy of awakening and transformation to your spiritual life. Let’s unpack that for a moment. As a Gemini, you’re the sign of communication, but you’re also the sign of curiosity and information. While you like to explore, it safe to say that you don’t know everything and that there’s this unknown world out there that can’t be touched — it can only be sensed. Uranus in Taurus will spark a seven year journey of shedding light on the invisible, the spiritual, the mystical. It’s a time to go behind the scenes and delve into the unconscious and the hidden. Your dreams may be more vivid. You may be seeking out new spiritual paths or new ways to find answers to existential questions, too. Don’t forget, it’s Taurus Season this month, a time in your personal calendar when you’re already pulling back and reflecting, preparing for your new personal year. It’s a good time to meditate as well, being open to insights and downloads from the beyond. Also on May 15, Mars will changed signs, moving into your travel and education sign of Aquarius. Later this month you may be setting out a trip to a far flung destination or looking putting a focus on higher education such as university or anything that deepens your understanding of the world. But, paired with Uranus’s change of signs, it’s also a time when you’re having to question a lot — both how you express your truth and faith in the world as well as how you find answers to life’s deepest mysteries. And your view of yourself and the world may need to be rocked a little in order for you to move forward. By the end of the month, a full moon will light up your relationship sign of Sagittarius on May 29, highlighting partnership and connection into June. You may need to make a decision about a relationship then or you may find that it’s easier to meet someone if you’re looking for a partner. The same day, Mercury will finally arrive in Gemini, giving you a bit of a boost after a rather long and soulful May — just in time for your birthday. Want to learn more about how the astrology of May will affect you? Book your consultation now.\n\nKey Themes: Retreat, rest, pulling back, behind the scenes, endings, letting go, shedding, awakenings, spirituality, mysticism, dreams, visions, intuition, existential questions, search, truth, meaning, integrity, beliefs, philosophy, religion, foreign travel, long distance journeys, education, wisdom, morality, moral compass, right and wrong, ethics, relationships, other people, connection, you, the self, new beginnings.\n\nCancer\n\nJune 21–July 22\n\nHas your career changed over the last seven years? Has your life gone in a different direction? Have you professionally reinvented yourself? It’s quite possible that your life is quite different than it was in 2011 — like, radically different. One of the main culprits has been Uranus. It’s been stirring up your career sign of Aries over the last seven years and you’ve had to completely breakthrough into a new way of being in the world. That said, Uranus is poised to leave and it’s hard to believe that you finally made it. (Yes, it was touch and go at times.) So, what’s next? With Uranus saying goodbye to Aries on May 15, it set its sights on shaking up your sense of community and social connection. If you look at the other signs, Uranus’s change doesn’t have some of the same level of disruption. Instead, the planet of revolution and awakenings is helping you to gain a larger view of your life. Think of the next seven years as connecting you with higher vision and awareness. You may be seeing things from a different perspective. And, as your sense of community and social connection change, you may find your friendships transforming over the coming years. You may seek out radically different groups of people. You may feel a powerful need to find your real tribe or the people that truly understand you. You may feel called to align yourself with social, political, or humanitarian causes. That said, May is Taurus Season, the time in your personal calendar when you are already thinking about community and friendships. You’re also in the last leg of a personal year, and this is a month to think about the future and the sort of things you want to create for yourself. Additionally, Mars will change signs on May 15, proving that the middle of this month is going to be a bit of a jolt. And this placement of Mars may be a bit emotionally prickly. It will also activate themes around trust, intimacy, power, and control. The rest of May will be a time to face your fears as well as look at issues around sexuality and identity. You may also be looking at themes around finance and assets, especially anything you share monetarily with a partner. By the end of May, a full moon will light up your chart’s sector of health and wellness, which is always a good time to revisit fitness goals as well as how you take care of your body. You may even think of it as a mid-year check in on your New Year’s resolutions. Want to learn more about how the astrology of May will affect you? Book your consultation now.\n\nKey Themes: Friendships, social circle, community, groups, the future, hopes, wishes, humanity, social causes, the collective, activism, belonging, intimacy, vulnerability, deep emotions, deep self, sexuality, facing fears, the psyche, rebirth, secrets, money, finance, assets, shared resources, your partner’s money, wealth, debt, estate, health, wellness, diet, fitness, nutrition, organization, daily life, schedule, work, how you take care of your body.\n\nLeo\n\nJuly 23–August 22\n\nLeo, again, like last month, we’ve got a lot to talk about. Let’s just say that it hasn’t been a quiet time for you, what with the eclipses bouncing back and forth between Leo and your opposing sign of Aquarius. You’re at a crossroads and it’s safe to say that some things have changed in your life. So, here comes another one of those months. You know, the one that keeps you on your toes. May 15 is a big day because it contains within it three major astrological events. One, Uranus changes signs and brings its energy of revolution and transformation to your career sign of Taurus. Two, Mars changes signs, heating of your relationship sign of Aquarius. Then there’s a new moon, which almost seems like an afterthought. Let’s start with Uranus. As I mentioned, it’s the planet of revolution and transformation. The question for you is, are you ready for a career change or professional reinvention? Are you ready to take your life in a new direction? Uranus demands authenticity and if your public life doesn’t match your values, then you may find yourself feeling quite restless in the coming months. It’s quite possible that you’re already feeling this — this sense that something has to change. Maybe some crazy ideas are percolating, too. Don’t discount them as Uranus has a habit of inspiring a one-eighty. Okay? Then there’s Mars. When it changes signs on May 15, it will activate your relationship sign, which means that, in addition to your career and status, your relationships are getting a lot of action this month. Mars isn’t exactly the softest of influences and if you are in a relationship that has stress in it or prone to arguments, just be aware that Mars will provoke, especially since it’s squaring off of Uranus into May 16. You may feel very emotionally triggered, too, and restless to make a change. Further, the new moon merely underscores the fact that you’re entering a new chapter in life, one that may take you in a very different direction. (I’m reminded of Dorothy getting whisked away to Oz.) This is a lot of astro juju for one day, so just make sure you’re taking care of yourself and making sure you’re in your body. If fact, Saturn’s in the health and wellness part of your chart for the next couple of years, so Saturn is teaching you how to better handle stress and change — diet, exercise, and having a daily schedule or daily rituals to ground yourself in. As the month progresses, keep an eye on Venus’s change of signs on May 19. It may give you further insight to how these big changes are manifesting. Want to learn more about how the astrology of May will affect you? Book your consultation now.\n\nKey Themes: Career, professional life, the world, status, title, reputation, recognition, direction, responsibilities, ambitions, public reinvention, career change, relationships, partnerships, other people, connection, break, breakthrough, restlessness, action, arguments, new season, new life, health, wellness, diet, fitness, nutrition, work, daily life, schedule, service.\n\nVirgo\n\nAugust 23–September 22\n\nIn order to gain wisdom in life, in order to grow, we have to go through difficult experiences. We have to self reflect, digging into the darker parts of ourselves. It’s the alchemical recipe for personal transformation. With Mercury, your ruling sign, spending an extended time amount of time in Aries — plus last month’s retrograde — you’ve done just that. The last couple of months have likely brought a lot of personal reflection on such topics as intimacy, vulnerability, and power as well as facing the parts of ourselves that we don’t want to face. In fact, it’s probably worth mentioning that you’ve had seven years to do this since Uranus was a long term fixture in Aries. If you think back on it, haven’t you had seven years of intense emotional and psychic struggle? The good news is that Uranus will move out of Aries on May 15, but when it arrives in Taurus you’ll begin a new seven year story of transforming what you believe in and how you see the world. Being an earth sign, you can get a little stuck at times. And Uranus will be shaking up your view of yourself and all those engrained limiting beliefs that you’ve been hoarding onto forever. The best of Uranus in Taurus will be an opportunity to fling open the doors of life and get out into the world through travel and exploration. It will be a search for truth and meaning. It will be a time of expressing wisdom after learning some tough life lessons. Uranus will be like a lightning bolt to your mind, opening your awareness of yourself and the world. But — and it’s a big but — you have to get out of your way. I love you, Virgo, but you can often get in the weeds with the details and anxiety that everything isn’t perfect. The day that Uranus changes signs is also the same day as a Taurus New Moon, which is merely underscoring that May is kicking off some powerful new beginnings. Also on the same day (May 15 is really packing it in), Mars changes signs, turning up the heat on how you take care of yourself as well as health and work. I think that, with everything going on, it’s a time for you to do what you do well as a Virgo — get clean, so to speak. There’s a lot of stuff you’re holding onto to and some of it’s emotional. So — and this is just a suggestion — you may want to use the second half of the month to clean out and organize, getting rid of things from the past and the stuff that really doesn’t match who you are anymore. Maybe even try therapy if that’s not something you’ve considered before. Maybe go on a vision quest because the cosmos is really asking that you find your truth right now. And, by the full moon on May 29, you’ll really be getting to the emotional core of things. Want to learn more about how the astrology of May will affect you? Book your consultation now.\n\nKey Themes: Deep emotions, trust, vulnerability, the psyche, the shadow, intimacy, sexuality, facing fears, difficult emotions, power, control, finance, wealth, debt, taxes, beliefs, philosophy, worldview, right and wrong, integrity, morality, compass, truth, search, quest, education, university, law, religion, travel, foreign countries, health, wellness, diet, fitness, nutrition, work, schedule, daily life, service.\n\nLibra\n\nSeptember 23–October 22\n\nLet’s get some basic stuff out of the way, okay Libra? If we look for your ruling planet, Venus, it’s up in Gemini, putting a personal emphasis this month on travel, exploration, and education. It’s a flirty sign for your Venus to be in, one that likes to socialize, charm, and schmooze. And it’s a time when you need to pay closer attention to your choices and how they manifest. No big deal, right? You’re a sign that generally likes to play it breezy, anyway. So let’s not gloss over the fact that not only is it Taurus Season, a sign that touches on deeper emotions and experiences, but that you’ve got some major planetary shifts on the horizon, one designed to get you to delve into your psyche, your fears, your vulnerability. Sometimes you like to maintain a facade that everything is okay. But what’s bubbling beneath the surface? What don’t you want to look at? Or that you only acknowledge in private? It’s important to mention that on May 15 the planet Uranus will change signs after spending seven years in Aries. If you’re in the astrological know, then you’ll realize that Aries is your relationship sign and that Uranus is an agent of change, transformation, and awakening. Think back seven years ago, say around 2010–2011. How have your relationships changed? And I don’t just mean your romantic ones. This includes the quality of connection you forge with other people. If you did your work — or if Uranus did its work — there has been a revolution in your relationships with other people over the last seven years. Something is likely fundamentally different. So, as you get closer to May 15, you may be reflecting on what’s changed and how your consciousness around relationships has evolved. (Keep an eye out for the cosmic report card.) And when Uranus changes signs, you’ll be entering a new seven year chapter of awakening your deeper emotions. Remember when I said that Libra has a tendency to gloss over anything that’s imperfect or emotionally messy? This is a time to delve into your capital S Stuff. This is a time for you to stop pretending that everything is fine. This is a time for you to start pulling apart your psyche, examining your emotions as well as your fears and your deeper self. And this new era may start with a bang as Mars will also change signs on May 15, heating up themes around identity, self expression, and creativity. Who are you on a core level? When you strip all the BS away? Hopefully you’re not too shook, Libra. That’s why I wanted to start light and work our way down. (We’re still friends, right?) Then again you’re already feeling this era. Ever since Saturn moved in with you in December, you’ve been in Get Real mode. Meaning, it’s time to get your life in order … and this includes your emotional and your financial life as well. Want to learn more about how the astrology of May will affect you? Book your consultation now.\n\nKey Themes: Deep self, deep emotions, the psyche, vulnerability, sharing, assets, money, finance, estates, intimacy, sexuality, secrets, taboo, trust, security, facing fears, transformation, the passage, rebirth, travel, foreign shores, journeys, education, philosophy, beliefs, choices, integrity, communication, writing, speaking, news, information, the mind.\n\nScorpio\n\nOctober 23–November 21\n\nOh heyyy, Scorpio. What’s up? How you feeling? Like your whole world is going to turn upside down? No, of course not, Scorpio. You’re in control. You’re always in control. Why are your knuckles white? (Is this a conversation with myself?) Let’s be real Scorpio because you don’t like it any other way. This is a big month for you, one that kicks off a new seven year story around reinvention and transformation — your favorite! That’s the irony about Scorpio, though. For a sign so much about transformation, it really doesn’t like change. Or it only likes change on its own terms. But, as you know, change is inevitable, and starting May 15, your change will be centered on your relationships, from your romantic partnerships to how you interact and open up to everyone in your life. A revolution is coming and, because you’re such a prescient sign, it’s likely you’ve been feeling this coming for the past couple of months, like the distant rumble of thunder. Uranus is not only going to change your world, it’s going to change you. So, get ready to start tearing down all those defensive walls you put up because Uranus isn’t having it anymore. What do you do with this information? Well, for one, be at peace with the reality that you can’t control everything. Let that tension and anxiety leave your body. Two, it’s good to do some creative visioning, especially around relationships. If you’re single and looking for connection, what’s the most radical thing that can change about how you relate to a romantic partner? Can you envision a totally different version of relationship, one that is more authentic to you? If you are in a committed relationship, where are you stuck? What needs to change in you connection? Let’s not forget that Mars also changes signs on May 15, moving into Aquarius. Since Aquarius forms the foundation of your chart, the coming weeks will focus you in the home and with family. It will also get you seriously thinking about your roots and the choices you make about some of the most fundamental things in your life. Mars may bring a change in the home, from superficial and cosmetic changes to a move or a shift in your living situation. It may also bring unexpected news or disruption. Mars in this part of your chart tends to be noisy, but it also pulls you to nest. With so much up in the air and your life at a crossroads, it’s important to get back to basics, focusing on creating a strong base for your life so that you can roll with these powerful transformations. Want to learn more about how the astrology of May will affect you? Book your consultation now.\n\nKey Themes: Relationships, other people, one-on-one connection, partnership, socializing, interpersonal skills, home, family, foundation, roots, emotional needs, emotional core, money, finance, assets, income, salary, trust, security, vulnerability, material needs.\n\nSagittarius\n\nNovember 22–December 21\n\nLet’s set the scene, Sagittarius. First, it’s worth noting that you’re halfway through a year long chapter of pulling back, rest, retreat, and reflection. It’s a more spiritual time for you, one spend more inward than outward. Not that that is suddenly going to change — Jupiter, your ruling planet, is still behind the scenes until November 8 — BUT there’s a big change on the horizon this month. Uranus will enter Taurus, kicking off a seven year chapter of reinventing your daily life. This may read a abstractly, but Uranus’s arrival in Taurus is in sharp contrast to the low key vibe you’ve been cultivating since last October. In short, some of the fundamental aspects of your daily life are going to change. Like how? Well, you may be getting a restless urge to breakout of patterns or habits. You may be looking to make a radical change in what you eat or how you take care of your body. Your work or something about your schedule may change in a big way. And this is something that’s going to play out for the next seven years. See, Uranus isn’t change for change’s sake. It’s a planet that wants to shake up how you see a certain area of your life because something about it has gotten stale or restrictive. And you should know all about this. Over the last seven years, when Uranus made its way through Aries, you’ve had to reinvent yourself, your identity, and how you express yourself. There’s something about you that’s fundamentally different. It’s not that you are a new person in the sense that you became something that you are not, but rather you (hopefully) gained the confidence to be the person you already were deep down inside. Honestly, Sag, it’s been a liberation, although not without a mess at times. As your daily life gest a switcheroo, there may be a part of you that’s still hanging back. (Jupiter, your ruling planet, is in retrograde until July 10.) That said, when Mars changes signs on May 15, you may have a lot more to say than usual and, to be fair, you’re a sign that’s known for its opinions. Try to exercise some tact and charm. After all, you have Venus in your relationship sign until May 19. It’s a good time to make new partnerships and connections, btw. Just try to make nice as everything goes topsy-turvy. Then, on May 29, a Sagittarius Full Moon will put you in the spotlight, pushing you to take action or make yourself known. It may make for an emotional end to May, one that may inspire you to dream or vision something new for yourself. With Jupiter making a trine to Neptune, maybe miracles do happen. Want to learn more about how the astrology of May will affect you? Book your consultation now.\n\nKey Themes: Health, wellness, diet, fitness, nutrition, schedule, daily life, work, habits, rituals, taking care of the body, service, organization, behind the scenes, rest, retreat, spirituality, searching for answers, existential questions, travel, moment, communication, ideas, information, writing, speaking, learning, class, relationships, other people, partnerships.\n\nCapricorn\n\nDecember 22–January 19\n\nCapricorn, the last seven years have not been easy. They’ve likely coincided with some of the most challenging experiences you’ve been through. Caught between the planets Uranus and Pluto, your life likely looks very different in some way, too. You may also physically look different. You may live in a different home. You may feel light years away from where you were when this decade began. The good news is that come May 15 Uranus will leave Aries, the sign that forms the foundation of your chart. When it moves into Taurus, it will kick off seven years of reinventing your identity, how you express who you are, and even your confidence. And let’s face it, you could use more confidence after all the ups and downs you’ve been through. I would look at it this way. Having been stripped down to your core, what do you intentionally create in its place? That may be a hard question to answer right now, but I think it’s safe to say that Uranus is helping you to think outside of the box. Maybe it’s time to paint? Bake? Anything that gets the creative energy flowing. And the new moon, also on May 15, will give you a powerful restart. On the same day Mars will also change signs. (Yes, May 15 is supercharged with cosmic shifts.) Arriving in Aquarius, Mars will heat up themes around money, income, stability, and your material needs. With so much happening on that day, it’s possible that you may have to confront an issue around value and worth, something that presses on an emotional button. Nevertheless, the rest of May and into the next few months will motivate you to create more material stability in your life. You may be making new purchases or gathering what you need to nest and feel comfortable. Looking ahead to May 19, Venus will arrive in Cancer, bringing attention to your relationships for the rest of the month and helping you to make new connections as well as tend to existing partnerships. By the end of the month, on May 29, a full moon will put the spotlight on your spiritual side. You may feel pulled inward as you arrive in June, needing to rest and relax after an action packed May. Want to learn more about how the astrology of May will affect you? Book your consultation now.\n\nKey Themes: Creativity, self expression, identity, talent, fun, play, romance, children, reinvention, money, income, what you own, material needs, the basics, stability, security, emotional needs, value, worth, spirituality, spiritual connection, letting go, retreat, relax, rest, dreams, the unconscious, growing up, getting older, relationships, other people, partnerships.\n\nAquarius\n\nJanuary 20–February 18\n\nIt’s been kind of a funky time, Aquarius. With both Mars, Saturn, and Pluto all joining up over the last month, you’ve perhaps been more emotional or sensitive than usual, your dreams more intense, your mood more existential. Getting poked and prodded by the cosmos hasn’t been the greatest, but it’s brought up some things about yourself that have heretofore been in your blindspot. Seeing how you’ve been more sensitive, perhaps you’ve been feeling the rumbles of change growing louder, perhaps you’ve been getting restless knowing that you’re at a major cross roads. Already last year and this year have been big years for you. You’ve likely see some powerful shifts, especially in relationship or in your one-on-one connections. But it’s Uranus’s arrival in Taurus on May 15 that will really mark this year, kicking off a seven year story around home and family. Uranus is the planet of reinvention, awakening, and even revolution. So, it’s arrival to one of the most fundamental areas of your chart will mean that the very axis of your life is moving. Over the coming years you may be literally changing home, moving to a place that is quite different from where you live. You may see a transformation in how you emotionally connect with others, opening up some of the more intimate parts of yourself. You may be dealing with issues with family or ancestry. You may need to make a break from the past. With your roots transforming, you may need to seek out new nourishment. Nevertheless, it’s a new season and one that will get an extra jolt when Mars arrives in Aquarius on May 15 — the same day that Uranus changes signs. With Mars in Aquarius, the second half of the month will be active and dynamic. You’ll feel a motivation to move forward, to make changes, and take command of your life. You may find yourself taking on more responsibilities, too. But it’s quite possible that you’re mulling over a career change or a shift in your professional direction. Careful that you’re not too argumentative or aggressive because Mars isn’t exactly known for its diplomatic touch. Instead, channel positive Mars through leadership, exercise, and acts of courage. By the end of May, with the full moon on May 29, you may have a decision to make about your future as well as friendships, community, and social network. In fact an opportunity may be opening for you. Dream big. Want to learn more about how the astrology of May will affect you? Book your consultation now.\n\nKey Themes: Home, family, foundation, roots, the past, ancestors, memories, feelings, emotional core, emotional needs, feelings, living situation, new season, powerful shift, behind the scenes, dreams, intuition, spirituality, sensitivity, you, the self, taking the lead, moving forward, action, courage, aggression, arguments, direction, career, ambitions, responsibility.\n\nPisces\n\nFebruary 19–March 20\n\nWith your ruling planet, Jupiter, riding high in your chart all year long, you may be reading this horoscope while far from home. It’s a year for you to explore, travel, search for answers, and invest in your education. But it’s important to take stock that while you’re out there in the world, that your feet are on the ground. In fact, the last seven years have been a long lesson in you reconnecting with earth. As a Pisces, you have a tendency to float through life, the physical world often feeling too harsh. But what Uranus’s long journey through Aries taught you was the power of resource, from money and income to food and shelter. How has your sense of these things transformed since 2011? Meditate on this question throughout the first half of May because as Uranus closes out it time in Aries, it may give you one last push, one last test to see what you learned about taking care of your material life in a powerful new way. Then, come May 15, Uranus will change signs, kicking off a new seven year story around communication and learning. This will be a revolution for your voice as well as your mind. Since you’re a sensitive sign, Uranus may overload or speed up your thoughts. You may have a million ideas, but not sure where to start. Your natural psychic abilities may be stronger than ever. Again, don’t forget to stay grounded. Make sure you’re breathing and really connected to your body if that happens. Otherwise the restlessness or the anxiety may be too much. (Since you’re a Pisces, your go-to remedies have always been a long bath or time spent in water.) On the same day that Uranus changes signs, Mars will as well. Moving into the last house of your chart, a quiet, contemplative area, you may feel the need to pull back, rest, and retreat for the rest of the month. Mars in this part of your chart is typically low energy, but it looks like you’re getting pulled in different directions in May. Just make sure you’re taking care of your emotional and spiritual needs. By the end of the month, a full moon on May 29 will put the spotlight on your career or professional life. This may be a time to make a change, change positions, or change direction. With a beautiful alignment between Jupiter and Neptune, whatever changes you make may feel divinely led or guided. You may be traveling for work or you may be seeing the world, all to enrich your mind as well as your soul. Want to learn more about how the astrology of May will affect you? Book your consultation now.\n\nKey Themes: Communication, writing, speaking, thinking, learning, movement, travel, education, philosophy, law, religion, publishing, worldview, integrity, morality, pilgrimage, spirituality, mysticism, retreat, rest, dreams, recuperation, behind the scenes, intuition, psychic ability.\n\nPhoto by Anna Voss on Unsplash", "images": ["https://empoweringastrology.com/wp-content/uploads/2013/09/310899259_1258495135001212_6048315777968850820_n.jpg", "https://empoweringastrology.com/wp-content/uploads/2019/03/310034071_626682488937741_7917340255016045739_n.jpg", "http://empoweringastrology.com/wp-content/uploads/2016/06/capricorn-150x150.png", "https://empoweringastrology.com/wp-content/uploads/2010/09/310613677_465777382252017_6253022413749895960_n.jpg", "http://empoweringastrology.com/wp-content/uploads/2016/06/scorpio-150x150.png", "http://empoweringastrology.com/wp-content/uploads/2016/06/leo-150x150.png", "https://empoweringastrology.com/wp-content/uploads/2018/05/anna-voss-642915-unsplash-600x315-cropped.jpg", "http://empoweringastrology.com/wp-content/uploads/2016/06/libra-150x150.png", "http://empoweringastrology.com/wp-content/uploads/2016/06/aries-150x150.png", "http://empoweringastrology.com/wp-content/uploads/2016/06/sagittarius-150x150.png", "https://empoweringastrology.com/wp-content/uploads/2022/09/309875787_850813872750394_6588983256498291271_n.jpg", "http://empoweringastrology.com/wp-content/uploads/2016/06/taurus-150x150.png", "https://c.statcounter.com/5640676/0/04313ac7/1/", "http://0.gravatar.com/avatar/f78e40d718067575d85a649f1b809729?s=110&d=%3Cpath_to_url%3E&r=g", "http://0.gravatar.com/avatar/f78e40d718067575d85a649f1b809729?s=80&d=mm&r=g", "https://empoweringastrology.com/wp-content/uploads/2022/09/310585337_665008965177736_6836310811248615849_n.jpg", "https://empoweringastrology.com/wp-content/uploads/2022/09/310000740_625169865761411_902303227878904170_n.jpg", "http://empoweringastrology.com/wp-content/uploads/2016/06/virgo-150x150.png", "https://empoweringastrology.com/wp-content/uploads/2022/10/311133262_496110518806108_6957730435104780716_n.jpg", "http://empoweringastrology.com/wp-content/uploads/2016/06/gemini-150x150.png", "https://empoweringastrology.com/wp-content/uploads/2022/09/310679402_1466731777138158_8254033920844858763_n.jpg", "http://empoweringastrology.com/wp-content/uploads/2016/06/pisces-150x150.png", "https://empoweringastrology.com/wp-content/uploads/2022/10/310007220_1591331054619034_1367570613676450023_n.jpg", "https://empoweringastrology.com/wp-content/uploads/2016/03/cropped-empowering_astrology_logo_new-1-1024x169.png", "http://empoweringastrology.com/wp-content/uploads/2016/06/cancer-150x150.png", "http://empoweringastrology.com/wp-content/plugins/instagram-widget-by-wpzoom/dist/images/backend/icon-insta.png", "http://empoweringastrology.com/wp-content/uploads/2016/06/aquarius-150x150.png"], "top_img": "https://empoweringastrology.com/wp-content/uploads/2018/05/anna-voss-642915-unsplash-600x315-cropped.jpg", "keywords": [], "authors": ["Katie Sweetman"], "canonical_link": "https://empoweringastrology.com/may-2018-horoscopes", "title": "May 2018 Horoscopes – Empowering Astrology", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "p": {"domain_verify": "db89a86cc262e2a347fc16af66615f84"}, "generator": "WPSSO UM 4.13.1/S", "wpsso-begin": "wpsso meta tags and schema markup begin", "fb": {"app_id": 966242223397117}, "og": {"type": "article", "url": "https://empoweringastrology.com/may-2018-horoscopes", "locale": "en_US", "site_name": "Empowering Astrology", "title": "Empowering Astrology | May 2018 Horoscopes", "description": "Welcome to Taurus Season, the time in the zodiac calendar when we connect with the earth beneath our feet. Taurus is the fertility of life, the soil the grows the food we eat, the stability that comes with having resources like money and a roof over our head.", "updated_time": "2018-05-02T19:32:38+00:00", "image": {"identifier": "https://empoweringastrology.com/wp-content/uploads/2018/05/anna-voss-642915-unsplash-600x315-cropped.jpg", "width": 600, "height": 315}}, "article": {"publisher": "https://www.facebook.com/empoweringastrology/", "published_time": "2018-05-02T14:43:36+00:00", "modified_time": "2018-05-02T19:32:38+00:00", "tag": "Uranus in Taurus"}, "twitter": {"domain": "empoweringastrology.com", "site": "@empoweringastro", "title": "Empowering Astrology | May 2018 Horoscopes", "description": "Welcome to Taurus Season, the time in the zodiac calendar when we connect with the earth beneath our feet. Taurus is the fertility of life, the soil the grows the food we eat, the stability that...", "card": "summary_large_image", "image": "https://empoweringastrology.com/wp-content/uploads/2018/05/anna-voss-642915-unsplash-600x315.jpg?p=8036", "label1": "Written by", "data1": "Katie Sweetman", "label2": "Est. reading time", "data2": "34 minutes"}, "author": "Katie Sweetman", "description": "Welcome to Taurus Season, the time in the zodiac calendar when we connect with the earth beneath our feet. Taurus is the fertility of life, the soil the grows the food we eat...", "thumbnail": "https://empoweringastrology.com/wp-content/uploads/2018/05/anna-voss-642915-unsplash-600x315-cropped.jpg", "robots": "follow, index, max-snippet:-1, max-image-preview:large, max-video-preview:-1", "wpsso-end": "wpsso meta tags and schema markup end", "wpsso-cached": "2022-10-04T11:44:36+00:00", "wpsso-added": "2022-10-08T17:03:54+00:00 in 0.001072 secs for empoweringastrology.com"}, "movies": [], "publish_date": 1525272216.0, "source": "http://empoweringastrology.com", "summary": ""}