{"url": "https://en.wikipedia.org/wiki/Buckingham_Palace", "text": "Official London residence and principal workplace of British monarchs\n\nCoordinates:\n\nAerial view of Buckingham Palace during Queen Elizabeth II 's official 90th birthday celebrations in 2016. The principal façade, the East Front, was originally completed in 1850, and was remodelled in 1913 by Aston Webb\n\nBuckingham Palace ( )[1] is a London royal residence and the administrative headquarters of the monarch of the United Kingdom.[a][2] Located in the City of Westminster, the palace is often at the centre of state occasions and royal hospitality. It has been a focal point for the British people at times of national rejoicing and mourning.\n\nOriginally known as Buckingham House, the building at the core of today's palace was a large townhouse built for the Duke of Buckingham in 1703 on a site that had been in private ownership for at least 150 years. It was acquired by King George III in 1761 as a private residence for Queen Charlotte and became known as The Queen's House. During the 19th century it was enlarged by architects John Nash and Edward Blore, who constructed three wings around a central courtyard. Buckingham Palace became the London residence of the British monarch on the accession of Queen Victoria in 1837.\n\nThe last major structural additions were made in the late 19th and early 20th centuries, including the East Front, which contains the well-known balcony on which the British royal family traditionally congregates to greet crowds. A German bomb destroyed the palace chapel during the Second World War; the Queen's Gallery was built on the site and opened to the public in 1962 to exhibit works of art from the Royal Collection.\n\nThe original early-19th-century interior designs, many of which survive, include widespread use of brightly coloured scagliola and blue and pink lapis, on the advice of Sir Charles Long. King Edward VII oversaw a partial redecoration in a Belle Époque cream and gold colour scheme. Many smaller reception rooms are furnished in the Chinese regency style with furniture and fittings brought from the Royal Pavilion at Brighton and from Carlton House. The palace has 775 rooms, and the garden is the largest private garden in London. The state rooms, used for official and state entertaining, are open to the public each year for most of August and September and on some days in winter and spring.\n\nHistory [ edit ]\n\nIn the Middle Ages, the site of the future palace formed part of the Manor of Ebury (also called Eia). The marshy ground was watered by the river Tyburn, which still flows below the courtyard and south wing of the palace.[3] Where the river was fordable (at Cow Ford), the village of Eye Cross grew. Ownership of the site changed hands many times; owners included Edward the Confessor and Edith of Wessex in late Saxon times, and, after the Norman Conquest, William the Conqueror. William gave the site to Geoffrey de Mandeville, who bequeathed it to the monks of Westminster Abbey.[b]\n\nIn 1531, Henry VIII acquired the Hospital of St James, which became St James's Palace,[4] from Eton College, and in 1536 he took the Manor of Ebury from Westminster Abbey.[5] These transfers brought the site of Buckingham Palace back into royal hands for the first time since William the Conqueror had given it away almost 500 years earlier.[6] Various owners leased it from royal landlords, and the freehold was the subject of frenzied speculation during the 17th century. By then, the old village of Eye Cross had long since fallen into decay, and the area was mostly wasteland.[7] Needing money, James VI and I sold off part of the Crown freehold but retained part of the site on which he established a four-acre (1.6 ha) mulberry garden for the production of silk. (This is at the north-west corner of today's palace.)[8] Clement Walker in Anarchia Anglicana (1649) refers to \"new-erected sodoms and spintries at the Mulberry Garden at S. James's\"; this suggests it may have been a place of debauchery. Eventually, in the late 17th century, the freehold was inherited from the property tycoon Sir Hugh Audley by the great heiress Mary Davies.[c]\n\nFirst houses on the site (1624–1761) [ edit ]\n\nc. 1710 Buckingham House,\n\nPossibly the first house erected within the site was that of Sir William Blake, around 1624.[9] The next owner was Lord Goring, who from 1633 extended Blake's house, which came to be known as Goring House and developed much of today's garden, then known as Goring Great Garden.[10][11] He did not, however, obtain the freehold interest in the mulberry garden. Unbeknown to Goring, in 1640 the document \"failed to pass the Great Seal before Charles I fled London, which it needed to do for legal execution\".[12] It was this critical omission that would help the British royal family regain the freehold under George III.[13] When the improvident Goring defaulted on his rents,[14] Henry Bennet, 1st Earl of Arlington was able to purchase the lease of Goring House and he was occupying it when it burned down in 1674,[11] following which he constructed Arlington House on the site—the location of the southern wing of today's palace—the next year.[11] In 1698, John Sheffield acquired the lease. He later became the first Duke of Buckingham and Normanby.[15] Buckingham House was built for Sheffield in 1703 to the design of William Winde. The style chosen was of a large, three-floored central block with two smaller flanking service wings.[16] It was eventually sold by Buckingham's illegitimate son, Sir Charles Sheffield, in 1761[17] to George III for £21,000.[18][d] Sheffield's leasehold on the mulberry garden site, the freehold of which was still owned by the royal family, was due to expire in 1774.[19]\n\nFrom Queen's House to palace (1761–1837) [ edit ]\n\nUnder the new royal ownership, the building was originally intended as a private retreat for Queen Charlotte, and was accordingly known as The Queen's House. Remodelling of the structure began in 1762.[20] In 1775, an Act of Parliament settled the property on Queen Charlotte, in exchange for her rights to nearby Somerset House,[21][e] and 14 of her 15 children were born there. Some furnishings were transferred from Carlton House and others had been bought in France after the French Revolution[22] of 1789. While St James's Palace remained the official and ceremonial royal residence,[21] the name \"Buckingham-palace\" was used from at least 1791.[23] After his accession to the throne in 1820, George IV continued the renovation intending to create a small, comfortable home. However, in 1826, while the work was in progress, the King decided to modify the house into a palace with the help of his architect John Nash.[24] The external façade was designed, keeping in mind the French neoclassical influence preferred by George IV. The cost of the renovations grew dramatically, and by 1829 the extravagance of Nash's designs resulted in his removal as the architect. On the death of George IV in 1830, his younger brother William IV hired Edward Blore to finish the work.[25][26] William never moved into the palace. After the Palace of Westminster was destroyed by fire in 1834, he offered to convert Buckingham Palace into a new Houses of Parliament, but his offer was declined.[27]\n\nQueen Victoria (1837–1901) [ edit ]\n\nThe palace c. 1837, depicting Marble Arch , a ceremonial entrance. It was moved to make way for the east wing in 1847.\n\nBuckingham Palace became the principal royal residence in 1837, on the accession of Queen Victoria,[28] who was the first monarch to reside there; her predecessor William IV had died before its completion.[29] While the state rooms were a riot of gilt and colour, the necessities of the new palace were somewhat less luxurious. It was reported the chimneys smoked so much that the fires had to be allowed to die down, and consequently the palace was often cold.[30] Ventilation was so bad that the interior smelled, and when it was decided to install gas lamps, there was a serious worry about the build-up of gas on the lower floors. It was also said that the staff were lax and lazy and the palace was dirty.[30] Following the Queen's marriage in 1840, her husband, Prince Albert, concerned himself with a reorganisation of the household offices and staff, and with addressing the design faults of the palace.[31] By the end of 1840, all the problems had been rectified. However, the builders were to return within a decade.[31]\n\nBy 1847, the couple had found the palace too small for court life and their growing family[32] and a new wing, designed by Edward Blore, was built by Thomas Cubitt,[33] enclosing the central quadrangle. The large East Front, facing The Mall, is today the \"public face\" of Buckingham Palace and contains the balcony from which the royal family acknowledge the crowds on momentous occasions and after the annual Trooping the Colour.[34] The ballroom wing and a further suite of state rooms were also built in this period, designed by Nash's student Sir James Pennethorne.[35] Before Prince Albert's death, the palace was frequently the scene of musical entertainments,[36] and the most celebrated contemporary musicians entertained at Buckingham Palace. The composer Felix Mendelssohn is known to have played there on three occasions.[37] Johann Strauss II and his orchestra played there when in England.[38] Under Victoria, Buckingham Palace was frequently the scene of lavish costume balls, in addition to the usual royal ceremonies, investitures and presentations.[39]\n\nWidowed in 1861, the grief-stricken Queen withdrew from public life and left Buckingham Palace to live at Windsor Castle, Balmoral Castle and Osborne House. For many years the palace was seldom used, even neglected. In 1864, a note was found pinned to the fence of Buckingham Palace, saying: \"These commanding premises to be let or sold, in consequence of the late occupant's declining business.\"[40] Eventually, public opinion persuaded the Queen to return to London, though even then she preferred to live elsewhere whenever possible. Court functions were still held at Windsor Castle, presided over by the sombre Queen habitually dressed in mourning black, while Buckingham Palace remained shuttered for most of the year.[41]\n\nEarly 20th century (1901–1945) [ edit ]\n\nThe east wing public façade, enclosing the courtyard, was built between 1847 and 1850; it was remodelled to its present form in 1913.\n\nIn 1901, the new king, Edward VII, began redecorating the palace. The King and his wife, Queen Alexandra, had always been at the forefront of London high society, and their friends, known as \"the Marlborough House Set\", were considered to be the most eminent and fashionable of the age. Buckingham Palace—the Ballroom, Grand Entrance, Marble Hall, Grand Staircase, vestibules and galleries were redecorated in the Belle Époque cream and gold colour scheme they retain today—once again became a setting for entertaining on a majestic scale but leaving some to feel Edward's heavy redecorations were at odds with Nash's original work.[42]\n\nThe last major building work took place during the reign of George V when, in 1913, Sir Aston Webb redesigned Blore's 1850 East Front to resemble in part Giacomo Leoni's Lyme Park in Cheshire. This new refaced principal façade (of Portland stone) was designed to be the backdrop to the Victoria Memorial, a large memorial statue of Queen Victoria created by sculptor Sir Thomas Brock, erected outside the main gates on a surround constructed by architect Sir Aston Webb.[43] George V, who had succeeded Edward VII in 1910, had a more serious personality than his father; greater emphasis was now placed on official entertainment and royal duties than on lavish parties.[44] He arranged a series of command performances featuring jazz musicians such as the Original Dixieland Jazz Band (1919; the first jazz performance for a head of state), Sidney Bechet and Louis Armstrong (1932), which earned the palace a nomination in 2009 for a (Kind of) Blue Plaque by the Brecon Jazz Festival as one of the venues making the greatest contribution to jazz music in the United Kingdom.[45][46]\n\nDuring the First World War, which lasted from 1914 until 1918, the palace escaped unscathed. Its more valuable contents were evacuated to Windsor, but the royal family remained in residence. The King imposed rationing at the palace, much to the dismay of his guests and household.[47] To the King's later regret, David Lloyd George persuaded him to go further and ostentatiously lock the wine cellars and refrain from alcohol, to set a good example to the supposedly inebriated working class. The workers continued to imbibe, and the King was left unhappy at his enforced abstinence.[48]\n\nGeorge V's wife, Queen Mary, was a connoisseur of the arts and took a keen interest in the Royal Collection of furniture and art, both restoring and adding to it. Queen Mary also had many new fixtures and fittings installed, such as the pair of marble Empire-style chimneypieces by Benjamin Vulliamy, dating from 1810, which the Queen had installed in the ground floor Bow Room, the huge low room at the centre of the garden façade. Queen Mary was also responsible for the decoration of the Blue Drawing Room.[49] This room, 69 feet (21 metres) long, previously known as the South Drawing Room, has a ceiling designed by Nash, coffered with huge gilt console brackets.[50] In 1938, the northwest pavilion, designed by Nash as a conservatory, was converted into a swimming pool.[51]\n\nSecond World War [ edit ]\n\nExternal video Buckingham Palace Bombed (1940) – Newsreel of damage to the palace and chapel (1:08)\n\nDuring the Second World War, which broke out in 1939, the palace was bombed nine times.[52] The most serious and publicised incident destroyed the palace chapel in 1940. This event was shown in cinemas throughout the United Kingdom to show the common suffering of the rich and poor. One bomb fell in the palace quadrangle while George VI and Queen Elizabeth (the future Queen Mother) were in the palace, and many windows were blown in and the chapel destroyed.[53] War-time coverage of such incidents was severely restricted, however. The King and Queen were filmed inspecting their bombed home; it was at this time the Queen famously declared: \"I'm glad we have been bombed. Now I can look the East End in the face\".[54] The royal family were seen as sharing their subjects' hardship, as The Sunday Graphic reported:\n\nBy the Editor: The King and Queen have endured the ordeal which has come to their subjects. For the second time a German bomber has tried to bring death and destruction to the home of Their Majesties ... When this war is over the common danger which King George and Queen Elizabeth have shared with their people will be a cherished memory and an inspiration through the years.[55]\n\nOn 15 September 1940, known as Battle of Britain Day, an RAF pilot, Ray Holmes of No. 504 Squadron RAF rammed a German Dornier Do 17 bomber he believed was going to bomb the Palace. Holmes had run out of ammunition and made the quick decision to ram it. Holmes bailed out and the aircraft crashed into the forecourt of London Victoria station.[56] The bomber's engine was later exhibited at the Imperial War Museum in London. The British pilot became a King's Messenger after the war and died at the age of 90 in 2005.[57] On VE Day—8 May 1945—the palace was the centre of British celebrations. The King, the Queen, Princess Elizabeth (the future queen) and Princess Margaret appeared on the balcony, with the palace's blacked-out windows behind them, to cheers from a vast crowd in The Mall.[58] The damaged Palace was carefully restored after the war by John Mowlem & Co.[59]\n\nMid 20th century to present day [ edit ]\n\nMany of the palace's contents are part of the Royal Collection, held in trust by King Charles III; they can, on occasion, be viewed by the public at the Queen's Gallery, near the Royal Mews. The purpose-built gallery opened in 1962 and displays a changing selection of items from the collection.[60] It occupies the site of the chapel that was destroyed in the Second World War.[15] The palace was designated a Grade I listed building in 1970.[61] Its state rooms have been open to the public during August and September and on some dates throughout the year since 1993. The money raised in entry fees was originally put towards the rebuilding of Windsor Castle after the 1992 fire devastated many of its staterooms.[62] In the year to 31 March 2017, 580,000 people visited the palace, and 154,000 visited the gallery.[63]\n\nThe palace used to racially segregate staff. In 1968, Charles Tryon, 2nd Baron Tryon, acting as treasurer to Queen Elizabeth II, sought to exempt Buckingham Palace from full application of the Race Relations Act 1968.[64][65] He stated that the palace did not hire people of colour for clerical jobs, only as domestic servants. He arranged with Civil servants for an exemption that meant that complaints of racism against the royal household would be sent directly to the Home Secretary and kept out of the legal system.[65]\n\nThe palace, like Windsor Castle, is owned by the reigning monarch in right of the Crown. Occupied royal palaces are not part of the Crown Estate,[66] nor are they the monarch's personal property, unlike Sandringham House and Balmoral Castle.[67] The Government of the United Kingdom is responsible for maintaining the palace in exchange for the profits made by the Crown Estate.[68] In 2015, the State Dining Room was closed for a year and a half because its ceiling had become potentially dangerous.[69] A 10-year schedule of maintenance work, including new plumbing, wiring, boilers and radiators, and the installation of solar panels on the roof, has been estimated to cost £369 million and was approved by the prime minister in November 2016. It will be funded by a temporary increase in the Sovereign Grant paid from the income of the Crown Estate and is intended to extend the building's working life by at least 50 years.[70][71] In 2017, the House of Commons backed funding for the project by 464 votes to 56.[72]\n\nBuckingham Palace is a symbol and home of the British monarchy, an art gallery and a tourist attraction. Behind the gilded railings and gates that were completed by the Bromsgrove Guild in 1911,[41] lies Webb's famous façade, which was described in a book published by the Royal Collection Trust as looking \"like everybody's idea of a palace\".[41] It has not only been a weekday home of Elizabeth II and Prince Philip but is also the London residence of the Duke of York and the Earl and Countess of Wessex. The palace also houses their offices, as well as those of the Princess Royal and Princess Alexandra, and is the workplace of more than 800 people.[73][74] Every year, some 50,000 invited guests are entertained at garden parties, receptions, audiences and banquets. Three garden parties are held in the summer, usually in July.[75] The forecourt of Buckingham Palace is used for the Changing of the Guard, a major ceremony and tourist attraction (daily from April to July; every other day in other months).[76]\n\nIn March 2022, it was reported that Elizabeth II would no longer reside at Buckingham Palace, preferring instead to live and conduct business at Windsor Castle.[77] She died on 8 September 2022 at Balmoral Castle, after which large crowds assembled outside of the palace.[78]\n\nInterior [ edit ]\n\nPiano nobile of Buckingham Palace. The areas defined by shaded walls represent lower minor wings. Note: This is an unscaled sketch plan for reference only. Proportions of some rooms may slightly differ in reality. of Buckingham Palace. The areas defined by shaded walls represent lower minor wings.: This is an unscaled sketch plan for reference only. Proportions of some rooms may slightly differ in reality.\n\nThe front of the palace measures 355 feet (108 m) across, by 390 feet (120 m) deep, by 80 feet (24 m) high and contains over 830,000 square feet (77,000 m2) of floorspace.[79] There are 775 rooms, including 188 staff bedrooms, 92 offices, 78 bathrooms, 52 principal bedrooms and 19 state rooms. It also has a post office, cinema, swimming pool, doctor's surgery[73] and jeweller's workshop.[80]\n\nThe Picture Gallery\n\nThe principal rooms are contained on the piano nobile behind the west-facing garden façade at the rear of the palace. The centre of this ornate suite of state rooms is the Music Room, its large bow the dominant feature of the façade. Flanking the Music Room are the Blue and the White Drawing Rooms. At the centre of the suite, serving as a corridor to link the state rooms, is the Picture Gallery, which is top-lit and 55 yards (50 m) long.[81] The Gallery is hung with numerous works including some by Rembrandt, van Dyck, Rubens and Vermeer;[82] other rooms leading from the Picture Gallery are the Throne Room and the Green Drawing Room. The Green Drawing Room serves as a huge anteroom to the Throne Room, and is part of the ceremonial route to the throne from the Guard Room at the top of the Grand Staircase.[81] The Guard Room contains white marble statues of Queen Victoria and Prince Albert, in Roman costume, set in a tribune lined with tapestries. These very formal rooms are used only for ceremonial and official entertaining but are open to the public every summer.[83]\n\nA state banquet in the Ballroom\n\nDirectly underneath the State Apartments are the less grand semi-state apartments. Opening from the Marble Hall, these rooms are used for less formal entertaining, such as luncheon parties and private audiences. Some of the rooms are named and decorated for particular visitors, such as the 1844 Room, decorated in that year for the state visit of Tsar Nicholas I of Russia, and the 1855 Room, in honour of the visit of Emperor Napoleon III of France.[84] At the centre of this suite is the Bow Room, through which thousands of guests pass annually to the monarch's garden parties.[85] The Queen used a smaller suite of rooms in the north wing.[86]\n\nBetween 1847 and 1850, when Blore was building the new east wing, the Brighton Pavilion was once again plundered of its fittings. As a result, many of the rooms in the new wing have a distinctly oriental atmosphere. The red and blue Chinese Luncheon Room is made up of parts of the Brighton Banqueting and Music Rooms with a large oriental chimneypiece designed by Robert Jones and sculpted by Richard Westmacott.[87] It was formerly in the Music Room at the Brighton Pavilion.[87] The ornate clock, known as the Kylin Clock, was made in Jingdezhen, Jiangxi Province, China, in the second half of the 18th century; it has a later movement by Benjamin Vulliamy circa 1820.[88] The Yellow Drawing Room has wallpaper supplied in 1817 for the Brighton Saloon, and a chimneypiece which is a European vision of how the Chinese chimney piece may appear. It has nodding mandarins in niches and fearsome winged dragons, designed by Robert Jones.[89]\n\nAt the centre of this wing is the famous balcony with the Centre Room behind its glass doors. This is a Chinese-style saloon enhanced by Queen Mary, who, working with the designer Sir Charles Allom, created a more \"binding\"[90] Chinese theme in the late 1920s, although the lacquer doors were brought from Brighton in 1873. Running the length of the piano nobile of the east wing is the Great Gallery, modestly known as the Principal Corridor, which runs the length of the eastern side of the quadrangle.[91] It has mirrored doors and mirrored cross walls reflecting porcelain pagodas and other oriental furniture from Brighton. The Chinese Luncheon Room and Yellow Drawing Room are situated at each end of this gallery, with the Centre Room in between.[92]\n\nThe 1844 Room\n\nWhen paying a state visit to Britain, foreign heads of state are usually entertained by the monarch at Buckingham Palace. They are allocated an extensive suite of rooms known as the Belgian Suite, situated at the foot of the Minister's Staircase, on the ground floor of the north-facing Garden Wing. It contains the 1844 Room, a sitting room that also serves as an audience room and is often used for personal investitures. Narrow corridors link the rooms of the suite, one of them is given extra height and perspective by saucer domes designed by Nash in the style of Soane.[93] A second corridor in the suite has Gothic-influenced cross-over vaulting.[93] The Belgian Rooms themselves were decorated in their present style and named after King Leopold I of Belgium, uncle of Queen Victoria and Prince Albert. In 1936, the suite briefly became the private apartments of the palace when King Edward VIII occupied them.[73]\n\nThe original early-19th-century interior designs, many of which still survive, included widespread use of brightly coloured scagliola and blue and pink lapis, on the advice of Sir Charles Long. King Edward VII oversaw a partial redecoration in a Belle Époque cream and gold colour scheme.[94]\n\nCourt ceremonies [ edit ]\n\nInvestitures, which include the conferring of knighthoods by dubbing with a sword, and other awards take place in the palace's Ballroom, built in 1854. At 120 feet (36.6 m) long, 60 feet (18 m) wide and 45 feet (13.5 m) high,[73] it is the largest room in the palace. It has replaced the throne room in importance and use. During investitures, the King stands on the throne dais beneath a giant, domed velvet canopy, known as a shamiana or a baldachin, that was used at the Delhi Durbar in 1911.[95] A military band plays in the musicians' gallery as award recipients approach the King and receive their honours, watched by their families and friends.[96]\n\nExternal video Transforming the Ballroom for a State Banquet (timelapse)\n\nState banquets also take place in the Ballroom; these formal dinners are held on the first evening of a state visit by a foreign head of state.[96] On these occasions, for up to 170 guests in formal \"white tie and decorations\", including tiaras, the dining table is laid with the Grand Service, a collection of silver-gilt plate made in 1811 for the Prince of Wales, later George IV.[97] The largest and most formal reception at Buckingham Palace takes place every November when the King entertains members of the diplomatic corps.[98] On this grand occasion, all the state rooms are in use, as the royal family proceed through them,[99] beginning at the great north doors of the Picture Gallery. As Nash had envisaged, all the large, double-mirrored doors stand open, reflecting the numerous crystal chandeliers and sconces, creating a deliberate optical illusion of space and light.[100]\n\nSmaller ceremonies such as the reception of new ambassadors take place in the \"1844 Room\". Here too, the King holds small lunch parties, and often meetings of the Privy Council. Larger lunch parties often take place in the curved and domed Music Room or the State Dining Room.[101] Since the bombing of the palace chapel in World War II, royal christenings have sometimes taken place in the Music Room. Queen Elizabeth II's first three children were all baptised there.[102] On all formal occasions, the ceremonies are attended by the Yeomen of the Guard, in their historic uniforms, and other officers of the court such as the Lord Chamberlain.[101]\n\nFormer ceremonial [ edit ]\n\nCourt dress [ edit ]\n\nPresident Nixon with members of the royal family in the ground floor Marble Hall\n\nFormerly, men not wearing military uniform wore knee breeches of 18th-century design. Women's evening dress included trains and tiaras or feathers in their hair (often both). The dress code governing formal court uniform and dress has progressively relaxed. After the First World War, when Queen Mary wished to follow fashion by raising her skirts a few inches from the ground, she requested a lady-in-waiting to shorten her own skirt first to gauge the King's reaction. King George V disapproved, so the Queen kept her hemline unfashionably low.[103] Following his accession in 1936, King George VI and Queen Elizabeth allowed the hemline of daytime skirts to rise. Today, there is no official dress code.[73] Most men invited to Buckingham Palace in the daytime choose to wear service uniform or lounge suits;[73] a minority wear morning coats, and in the evening, depending on the formality of the occasion, black tie or white tie.[104]\n\nCourt presentation of débutantes [ edit ]\n\nDébutantes were aristocratic young ladies making their first entrée into society through a presentation to the monarch at court. These occasions, known as \"coming out\", took place at the palace from the reign of Edward VII. The débutantes entered—wearing full court dress, with three ostrich feathers in their hair—curtsied, performed a backwards walk and a further curtsey, while manoeuvring a dress train of prescribed length. The ceremony, known as an evening court, corresponded to the \"court drawing rooms\" of Victoria's reign.[105] After World War II, the ceremony was replaced by less formal afternoon receptions, omitting the requirement of court evening dress.[106] In 1958, Queen Elizabeth II abolished the presentation parties for débutantes,[107] replacing them with Garden Parties,[f] for up to 8,000 invitees in the Garden. They are the largest functions of the year.[109]\n\nGarden and surroundings [ edit ]\n\nAt the rear of the palace is the large and park-like garden, which together with its lake is the largest private garden in London.[110] There, Queen Elizabeth II hosted her annual garden parties each summer and also held large functions to celebrate royal milestones, such as jubilees. It covers 17 ha (42 acres) and includes a helicopter landing area, a lake and a tennis court.[73]\n\nAdjacent to the palace is the Royal Mews, also designed by Nash, where the royal carriages, including the Gold State Coach, are housed. This rococo gilt coach, designed by Sir William Chambers in 1760, has painted panels by G. B. Cipriani. It was first used for the State Opening of Parliament by George III in 1762 and has been used by the monarch for every coronation since George IV. It was last used for the Golden Jubilee of Elizabeth II.[111] Also housed in the mews are the coach horses used at royal ceremonial processions.[112]\n\nThe Mall, a ceremonial approach route to the palace, was designed by Sir Aston Webb and completed in 1911 as part of a grand memorial to Queen Victoria. It extends from Admiralty Arch, across St James's Park to the Victoria Memorial. This route is used by the cavalcades and motorcades of visiting heads of state, and by the royal family on state occasions—such as the annual Trooping the Colour.[113]\n\nSecurity breaches [ edit ]\n\nThe boy Jones was an intruder who gained entry to the palace on three occasions between 1838 and 1841.[114][115] At least 12 people have managed to gain unauthorised entry into the palace or its grounds since 1914,[116] including Michael Fagan, who broke into the palace twice in 1982 and entered Queen Elizabeth II's bedroom on the second occasion. At the time, news media reported that he had a long conversation with her while she waited for security officers to arrive, but in a 2012 interview with The Independent, Fagan said she ran out of the room, and no conversation took place.[117] It was only in 2007 that trespassing on the palace grounds became a specific criminal offence.[118][g]\n\nSee also [ edit ]\n\nNotes [ edit ]\n\nReferences [ edit ]\n\nBibliography [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Buckingham_House_1710.jpeg/220px-Buckingham_House_1710.jpeg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e7/President_Nixon_visiting_Buckingham_Palace_with_Britain%27s_royal_family_-_NARA_-_194606.tif/lossy-page1-220px-President_Nixon_visiting_Buckingham_Palace_with_Britain%27s_royal_family_-_NARA_-_194606.tif.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Royal_Standard_of_the_United_Kingdom.svg/100px-Royal_Standard_of_the_United_Kingdom.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/48/P_history.svg/31px-P_history.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Royal_Standard_of_the_United_Kingdom_%28in_Scotland%29.svg/100px-Royal_Standard_of_the_United_Kingdom_%28in_Scotland%29.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Buckingham_Palace_from_side%2C_London%2C_UK_-_Diliff.jpg/220px-Buckingham_Palace_from_side%2C_London%2C_UK_-_Diliff.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Nuvola_apps_kaboodle.svg/16px-Nuvola_apps_kaboodle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Wikivoyage-Logo-v3-icon.svg/40px-Wikivoyage-Logo-v3-icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Victoria_Memorial_from_within_Buckingham_Palace.jpg/170px-Victoria_Memorial_from_within_Buckingham_Palace.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Buckingham_Palace_west_facade_%28panoramic%29.jpg/800px-Buckingham_Palace_west_facade_%28panoramic%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Plan_of_Buckingham_palace.gif/220px-Plan_of_Buckingham_palace.gif", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Buckingham_Palace_engraved_by_J.Woods_after_Hablot_Browne_%26_R.Garland_publ_1837_edited.jpg/220px-Buckingham_Palace_engraved_by_J.Woods_after_Hablot_Browne_%26_R.Garland_publ_1837_edited.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Buckingham_Palace_aerial_view_2016_%28cropped%29.jpg/390px-Buckingham_Palace_aerial_view_2016_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/1910_Buckingham_Palace.png/220px-1910_Buckingham_Palace.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/ae/Flag_of_the_United_Kingdom.svg/32px-Flag_of_the_United_Kingdom.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Cscr-featured.svg/20px-Cscr-featured.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/P052411LJ-0751_%285835926297%29.jpg/220px-P052411LJ-0751_%285835926297%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/48/Picture_Gallery%2C_Buckingham_Palace.jpg/220px-Picture_Gallery%2C_Buckingham_Palace.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Obama_and_Duke_Duchess_of_Cambridge.jpg/220px-Obama_and_Duke_Duchess_of_Cambridge.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/b/be/Flag_of_England.svg/32px-Flag_of_England.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Clock_Tower_-_Palace_of_Westminster%2C_London_-_May_2007_icon.png/16px-Clock_Tower_-_Palace_of_Westminster%2C_London_-_May_2007_icon.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Buckingham_Palace_aerial_view_2016_%28cropped%29.jpg/1200px-Buckingham_Palace_aerial_view_2016_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/P_parthenon.svg/31px-P_parthenon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Crown_of_Saint_Edward_Heraldry.svg/30px-Crown_of_Saint_Edward_Heraldry.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Openstreetmap_logo.svg/16px-Openstreetmap_logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Buckingham_Palace_aerial_view_2016_%28cropped%29.jpg/1200px-Buckingham_Palace_aerial_view_2016_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Buckingham_Palace", "title": "Buckingham Palace", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Buckingham_Palace_aerial_view_2016_%28cropped%29.jpg/640px-Buckingham_Palace_aerial_view_2016_%28cropped%29.jpg", "width": 640, "height": 480}, "title": "Buckingham Palace - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}