{"url": "https://www.businessinsider.in/these-are-the-tricks-that-zara-uses-to-figure-out-the-styles-you-want-before-you-even-do/articleshow/66490141.cms", "text": "Advertisement\n\nZara and its parent company, Inditex, have their global headquarters in Arteixo, Spain. There are over 300 designers working here.\n\nThese designers are at the center of Zara's business, turning around new styles quickly and enabling the company to bring new items to its stores twice a week.\n\nIn a recent visit to the company's headquarters, we chatted with a group of designers about how their process works.\n\nHidden away in the depths of Zara's sprawling headquarters in northern Spain, 300 designers are hard at work trying to discover the next big fashion trend.\n\nDuring our visit to the offices in August, we were introduced to a group of four designers who were huddled around an iPad and trend-forecasting books as they put together the final pieces of the end-of-year collection, which hits stores in November.\n\nThis collection had been in the works since April, they said, beginning with mood boards, sketches, and then, finally, sourcing fabrics from suppliers.\n\nZara's army of designers is at the core of its business model, which is centered on newness and speed. While its slick supply chain and distribution process enable the company to turn around new items quickly and bring them to its 2,238 stores twice a week, it is the designers who are burdened with the responsibility of coming up with new styles that enable Zara to stay ahead of the pack in the global fast-fashion arms race.\n\nAdvertisement\n\nRead more: We went inside one of the sprawling factories where Zara makes its clothes. Here's how the world's biggest fashion retailer gets it done.\n\nThe power of the Instagram influencer\n\nFast-fashion stores have historically been known to mimic trends from the runway, offering similar products at lower prices than high-fashion labels. Both Zara and Forever 21 have come under scrutiny for this practice in the past, being accused of selling copycat products and ripping off designs.\n\nWhile the runway shows are still an important part of its design process today, Zara has remained steadfast that these shows act only as places of inspiration.\n\nToday, the design process has expanded beyond the realms of runway shows and spread to social media and, specifically, Instagram.\n\nAdvertisement\n\n\"We go to the fairs in Paris and Italy and then have a look at the books and decide what is the good content for us,\" one designer, whose name Zara did not share, told Business Insider. It's Zara's company policy not to allow employees to be quoted in news stories.\n\nFrom here, the designers check social media to determine the most opportune moment to launch new products. This, the designer said, is partly determined by Instagram influencers.\n\nIf an influencer chooses to dress in a certain way, that trend will likely take off, one designer said.\n\n\"Suddenly everyone wants the same, and you say, 'We had a dress last year and it was the worst seller,'\" she said.\n\nInstagram has given these designers access to a massive pool of inspiration.\n\nAdvertisement\n\n\"You can find everything on your phone now - you can see everything that is being worn in New York, Shanghai, Tokyo at one time - that was something that didn't happen 15 years ago,\" another designer said.\n\nThis is both a blessing a curse, they say, as they are now tasked with sorting through all of this information and deciding which trends will really stick.\n\nTo try and get a perspective on this, the company hires designers of all ages, who can give their own personal view on what works for each age group. Each collection is created with a specific shopper in mind - the woman who likes minimalist clothing, the risqué dresser - and is often inspired by individual influencers.\n\nZara's e-commerce platform also plays a part in the design process as designers are able to see what customers are searching for online and determine what trends they are after.\n\nAdvertisement\n\n'We are constantly correcting ourselves'\n\nAll of Inditex's brands are built around the notion that if specific styles aren't working, they should change them.\n\n\"The company is not hierarchical,\" Jesús Echeverría, Inditex's chief communication officer, told Business Insider. \"We are constantly correcting ourselves.\"\n\nTo do so, the designers work closely with local sales managers in each country to find out what's working and what isn't, checking sales data and customer feedback. If they need to make changes to the designs, they will; nothing is set in stone. If some trends are working, they will lean into this in the next collection.\n\n\"We have all kind of customers, we have to give them everything they need,\" one designer said. That can mean adapting styles or selection for each of its 96 markets.\n\nThis trial-and-error system is made easy because of Zara's slick supply chain. Pattern cutters sit just meters away from the design teams in its headquarters, with rows and rows of sewing machines ready to make up new prototypes with different cuts and fabrics.\n\nAdvertisement\n\nIt also won't do a massive production of one item.\n\n\"If it's finished, it's finished,\" Echeverría said.", "images": ["https://www.businessinsider.in/thumb/msid-94723134,width-54,height-54,imgsize-79852/94723134.jpg", "https://www.businessinsider.in/thumb/msid-94676235,width-54,height-54,imgsize-36166/12000-facebook-employees-15-of-its-workforce-may-lose-jobs-amid-quiet-layoffs-report.jpg", "https://www.businessinsider.in/thumb/msid-94722513,width-54,height-54,imgsize-20974/94722513.jpg", "https://www.businessinsider.in/thumb/msid-94724098,width-54,height-54,imgsize-37616/94724098.jpg", "https://www.businessinsider.in/photo/66490141/these-are-the-tricks-that-zara-uses-to-figure-out-the-styles-you-want-before-you-even-do.jpg", "https://static-ssl.businessinsider.com/image/5bd209a671f7ce20b8792942-800/img7468.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=9900186&cv=2.0&cj=1", "https://static-ssl.businessinsider.com/image/5bdcb97b0591f27609360f86-800/zara shopwindowteam.jpg", "https://www.businessinsider.in/photo/50740876/downarrow.jpg", "https://www.businessinsider.in/thumb/msid-94723235,width-54,height-54,imgsize-75316/94723235.jpg", "https://www.businessinsider.in/thumb/msid-94722437,width-54,height-54,imgsize-177550/94722437.jpg", "https://www.businessinsider.in/thumb/msid-60085318,width-600,resizemode-4/default-businessinsider-india.jpg", "https://www.businessinsider.in/thumb/msid-94544273,width-54,height-54,imgsize-521206/a-mans-cancer-vanished-after-he-was-injected-with-a-weakened-herpes-virus-in-a-promising-clinical-trial.jpg", "https://media-bii.businessinsider.com/images/5bd071e7756c100d6806f5f6-960-192.png", "https://static-ssl.businessinsider.com/image/5bdcbde25f1f7574a645e857-800/28a9517.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=13194393&cv=2.0&cj=1", "https://www.businessinsider.in/thumb/msid-60085318,width-65,height-47/default-thumb.jpg", "https://www.businessinsider.in/thumb/msid-94724119,width-54,height-54,imgsize-37616/pakistani-rupee-becomes-worlds-best-performing-currency.jpg"], "top_img": "https://www.businessinsider.in/photo/66490141/these-are-the-tricks-that-zara-uses-to-figure-out-the-styles-you-want-before-you-even-do.jpg", "keywords": [], "authors": [], "canonical_link": "http://www.businessinsider.com/zara-design-process-beats-trends-2018-11", "title": "These are the tricks that Zara uses to figure out the styles you want before you even do", "meta_data": {"description": "Courtesy of ZaraA Zara employee arranges the store window.Zara and its parent company, Inditex, have their global headquarters in Arteixo, Spain. There are", "keywords": "retail", "twitter": {"card": "summary_large_image", "site": "@BiIndia", "url": "https://www.businessinsider.in/these-are-the-tricks-that-zara-uses-to-figure-out-the-styles-you-want-before-you-even-do/articleshow/66490141.cms", "title": "These are the tricks that Zara uses to figure out the styles you want before you even do", "description": "Courtesy of ZaraA Zara employee arranges the store window.Zara and its parent company, Inditex, have their global headquarters in Arteixo, Spain. There are", "image": {"identifier": "https://www.businessinsider.in/photo/66490141/these-are-the-tricks-that-zara-uses-to-figure-out-the-styles-you-want-before-you-even-do.jpg", "alt": "These are the tricks that Zara uses to figure out the styles you want before you even do"}}, "news_keywords": "retail", "og": {"site_name": "Business Insider", "type": "article", "title": "These are the tricks that Zara uses to figure out the styles you want before you even do", "url": "https://www.businessinsider.in/these-are-the-tricks-that-zara-uses-to-figure-out-the-styles-you-want-before-you-even-do/articleshow/66490141.cms", "image": {"identifier": "https://www.businessinsider.in/photo/66490141/these-are-the-tricks-that-zara-uses-to-figure-out-the-styles-you-want-before-you-even-do.jpg", "alt": "These are the tricks that Zara uses to figure out the styles you want before you even do"}, "description": "Courtesy of ZaraA Zara employee arranges the store window.Zara and its parent company, Inditex, have their global headquarters in Arteixo, Spain. There are"}, "fb": {"app_id": 645465345465774, "admins": 556964827}, "website": "https://www.businessinsider.in", "snapchat": {"snapchat": "biindia", "sticker": "https://snapchat-bi-s3.tilc.in/snapchat-bi/sticker_66490141.png"}, "robots": "NOODP", "google-site-verification": "NpZv5Qfl0TuFiebbwMualP_h2a3QtmQGFjE9hhw9um8", "HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "https://www.businessinsider.in", "summary": ""}