{"url": "https://www.vladtv.com/article/237586/gofundme-page-for-bullied-teen-keaton-jones-suspended-amid-backlash", "text": "Bullied teen Keaton Jones went viral over the weekend after his mother Kimberly Jones posted a video of the tearful boy asking why people, including himself, were bullied.\n\nAfter various media outlets started posting images of Kimberly holding a Confederate flag and screenshots of her posts making disparaging comments about the NFL national anthem protests, the GoFundMe page started for Keaton has been paused. The page, which raised $57,171 in one day, was started by Joseph Lam, who says he doesn't know Keaton or Kimberly.\n\nLam wrote on the GoFundMe page, \"I came across this video on facebook of Kim Jones and her son Keaton. Keaton is being bullied at school. This video really touched my heart. I decided to do this GoFund Me to help with this childs future.\"\n\nHe continued, \"I know that money may not be the answer for this problem that we are facing in our communities with bullying. One of my biggest fears as a parent is that my children will be bullied in school. I know its a big task to tackle but it starts inside of our walls and the values that we teach our children. This is just one case of thousands out there. How many of our children stay in silence out of fear for their safety or for the fear of being further unaccepted. Over 3.2 million kids are bullied annually. 160,000 kids on a daily basis skip school out of fear from being bullied. They just want to be accepted and to be able to learn in a safe environment. Im so glad Kim posted this video of her son. It shows how bullying can really impact a child. The video that she posted really touched my heart and felt compelled to help. This is best way that I knew how.\"\n\nAfter the backlash started rolling in about Kimberly, Lam made the decision to pause the GoFundMe page, as he explained, \"As many of you know I paused the donations as well as the comments. As I sit back and read these comments and watched the video again I feel I have to make this update. THIS IS NOT ABOUT THE MOM!! However passing judgement on her before you know her is a form of bullying. Condemnation before evaluation is the ultimate form of ignorance. I can't even say for sure that any of whats being said is true. I don't know the family personally and never claimed to have known them.\"\n\nHe ended the statement by saying, \"I'm hoping that we can turn the money into something good whether it be for private school or college fund. I'm in touch with GFM on how to proceed at this point. Thank you everyone that donated.\"\n\nSource: eonline.com", "images": ["https://www.vladtv.com/images/size_th/admin-000073.jpg", "https://www.vladtv.com/images/size_fs/video-237586.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6685975&c3=&c4=&c5=&c6=&c15=&cj=1", "https://www.vladtv.com/images/site/logo-vladtv.png"], "top_img": "https://www.vladtv.com/images/size_fs/video-237586.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.vladtv.com/article/237586/58k-gofundme-page-for-bullied-teen-keaton-jones-suspended-amid-backlash", "title": "$58K GoFundMe Page for Bullied Teen Keaton Jones Suspended Amid Backlash", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "Bullied teen Keaton Jones went viral over the weekend after his mother Kimberly Jones posted a video of the tearful boy asking why people, includin...", "og": {"type": "article", "title": "$58K GoFundMe Page for Bullied Teen Keaton Jones Suspended Amid Backlash", "description": "Bullied teen Keaton Jones went viral over the weekend after his mother Kimberly Jones posted a video of the tearful boy asking why people, includin...", "image": "https://www.vladtv.com/images/size_fs/video-237586.jpg", "url": "https://www.vladtv.com/article/237586/58k-gofundme-page-for-bullied-teen-keaton-jones-suspended-amid-backlash", "locale": "en_US"}, "twitter": {"card": "summary_large_image", "site": "@vladtv", "title": "$58K GoFundMe Page for Bullied Teen Keaton Jones Suspended Amid Backlash", "description": "Bullied teen Keaton Jones went viral over the weekend after his mother Kimberly Jones posted a video of the tearful boy asking why people, includin...", "image": "https://www.vladtv.com/images/size_fs/video-237586.jpg", "url": "https://www.vladtv.com/article/237586/58k-gofundme-page-for-bullied-teen-keaton-jones-suspended-amid-backlash"}, "msapplication-TileColor": "#d2232a", "msapplication-TileImage": "/images/favicon/mstile-144x144.png", "theme-color": "#d2232a"}, "movies": [], "publish_date": null, "source": "https://www.vladtv.com", "summary": ""}