{"url": "https://en.wikipedia.org/wiki/East_High_School_(Salt_Lake_City)", "text": "Public high school in Salt Lake City, Utah, United States\n\nSalt Lake High School East or simply East High School is a public high school in the Salt Lake City School District in Salt Lake City, Utah, United States. It serves grades nine through twelve in general and special education. East High School was founded in 1913[3] and currently has an enrolled student body of around 1,900. It is located at 840 South 1300 East in the East Bench neighborhood. The original building was completed in 1913, and the current structure was built in 1997.[3]\n\nMost of the Disney Channel film High School Musical was filmed at East High School. The opening scenes of its first sequel High School Musical 2 (including the film's opening number, \"What Time Is It?\") were also filmed at East High. Additional filming took place in St. George. The filming of the second sequel High School Musical 3: Senior Year began at East High on May 3, 2008.\n\nHistory [ edit ]\n\nIn 1972, a fire destroyed the interior of the main building.[4]\n\nIn 2017 the school re-purposed two locker rooms below the gymnasium and installed washing machines in order to accommodate homeless students.[5] The non-profit organization Chapman-Richards Cares donated two washing machines and two dryers to the school. About 100 students at the time were homeless.[6]\n\nIn July 2017, a flood caused about $3 million in damages to the school.\n\nHigh School Musical [ edit ]\n\nMuch of the Disney Channel film High School Musical and parts of its two sequels, High School Musical 2 and High School Musical 3: Senior Year, were filmed at East High. As a result, the school has become a destination for some tourists. In the summer of 2007, the school received 40 to 50 visitors per day who wanted to visit the location of the film.[7]\n\nIn November 2007, the school performed its own production of High School Musical.[7] Demand for tickets was so strong that the school added an extra performance.[8]\n\nThe school is the setting of the Disney+ show, High School Musical: The Musical: The Series.[9]\n\nThe exterior grounds of the school were used in the 1990 film Dream Machine, starring the late Corey Haim.\n\nSexual misconduct and assaults [ edit ]\n\nIn 2007, three members of the football team were arrested and charged with various offences including forcible sodomy, attempted forcible sodomy and sexual abuse. Incidents similar to this occurred three times during the same season. The players were removed from the football team[10] and expelled from school.[11] In March 2008, one of the defendants was found guilty of two first degree felonies: forcible sexual abuse and attempted forcible sodomy, in addition to a misdemeanor charge of lewdness; he also faces additional sex and assault charges for an incident with two children he was babysitting.[12] He was ordered into custody, where he was sentenced to mandatory therapy, and was directed to write apology letters to his victims.\n\nIn December 2008, five students were suspended and \"referred to police\" after assaulting a classmate.[13][14]\n\nEast High School\n\nNotable alumni [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Open_Access_logo_PLoS_transparent.svg/9px-Open_Access_logo_PLoS_transparent.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://maps.wikimedia.org/img/osm-intl,13,a,a,270x200.png?lang=en&domain=en.wikipedia.org&title=East+High+School+%28Utah%29&revid=1107539509&groups=_f31a25cdb6e5557c8a2cc2ecf112a5258929571b", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Salt_Lake_City_East_High_School_3.jpg/220px-Salt_Lake_City_East_High_School_3.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Salt_Lake_City_East_High_School_3.jpg/1200px-Salt_Lake_City_East_High_School_3.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/East_High_School%2C_Salt_Lake_City%2C_Utah.jpg/1000px-East_High_School%2C_Salt_Lake_City%2C_Utah.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Salt_Lake_City_East_High_School_3.jpg/1200px-Salt_Lake_City_East_High_School_3.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/East_High_School_(Utah)", "title": "East High School (Utah)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Salt_Lake_City_East_High_School_3.jpg/640px-Salt_Lake_City_East_High_School_3.jpg", "width": 640, "height": 480}, "title": "East High School (Utah) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}