{"url": "https://www.elitedaily.com/p/selena-gomezs-birthday-message-for-taylor-swift-is-the-sweetest-thing-ever-7590561", "text": "Taylor Swift's 28th birthday was Wednesday, Dec. 13, and lots of the singer's famous friends took to social media to wish her a happy birthday. Selena Gomez's birthday message for Taylor Swift is one of the sweetest things you'll see all week and shows that their friendship is still going strong, despite rumors they aren't as close as they used to be. Gomez posted a throwback video of her and Swift smiling and laughing, and captioned it,\n\nI’m glad you were born. You write all the thoughts some aren’t able to articulate. (ME!) Thank you for giving a voice to this world that is authentic and inspiring. I wish some knew how big your heart actually is.. it’s fierce, bold and freaking wild with light. I’m glad you protect that. Love you @taylorswift\n\nFans swooned over the sweet message and left comments like, \"This is the cutest thing ever,\" \"I STAN THIS,\" \"my queens,\" and \"I love you both so much.\" There were some questions raised before Reputation came out as to whether or not Taylor Swift and Selena Gomez were still friends, but Swift cleared that up in the \"Look What You Made Me Do\" music video. At the end of the video, one of the \"old Taylors\" is wearing a T-shirt with the names of the people she loves written on it. Selena's name is right in plain sight, so yeah, they're good.\n\nGomez's birthday Instagram for Swift is seriously sweet.\n\nAnd she's not the only celebrity who wished the singer a happy birthday yesterday.\n\nHAIM, who opened for Swift on the 1989 tour, tweeted at Swift.\n\nThe tweet said, \"happy birthday @taylorswift grateful to have someone that shares the same love of most of the emo catalogue from 2003-2005.\"\n\nYouTuber/singer/broadway star Todrick Hall posted a series of photos of him and Swift together.\n\nHis caption read, \"Happy Birthday @taylorswift LOVE YOU TONZ.\" Some of Hall's pictures were of him and Swift in the \"Look What You Made Me Do\" music video. Yes, he was in it. And yes, you should know who Todrick Hall is because his voice sounds the way velvet feels.\n\nLily Aldridge posted a photo of her daughter, Dixie, sitting on a couch with Swift and one of her cats.\n\nShe captioned the post, \"We love you So So So So So Soooo MUCH!!! Happy Birthday @taylorswift!!!!! 🎂🎈🎉🎁😻\"\n\nKarlie Kloss posted a birthday tweet for Swift, shocking fans in the process.\n\nThe model tweeted, \"Happy happy birthday @taylorswift13!\" Fans thought their friendship had gone a bit to the wayside, but this tweet proved they're still good.\n\nCamila Cabello posted on her Snapchat story in honor of Swift.\n\nWhile wearing some of Swift's Reputation merch, Cabello said, \"representing.... happy bday tay.\"\n\nEllen DeGeneres posted a throwback video of Swift's first appearance on her show.\n\nShe said, \"Happy birthday, @taylorswift13! Remember the first time you were here?\"\n\nRyan Seacrest also got Swift's cats involved in his birthday message.\n\nHe tweeted what looks like a boomerang of Swift handing her cat, Olivia, to him. The tweet said, \"Happy bday @taylorswift13! Enjoy today. If you need a cat sitter for Olivia, you know where to find me.\"\n\nRuby Rose also posted on Instagram to say happy birthday to her friend.\n\nShe posted a simple, \"Happy birthday magical unicorn!!!\"\n\nAnd last but not least, Swift's buddy Martha Hunt posted a funny photo of the two of them goofing off.\n\nShe tweeted, \"Baby girl does not judge my funky chicken. HBD sis @taylorswift13.\"\n\nOne birthday post for Swift we didn't see was from her boyfriend, Joe Alwyn. But he doesn't have social media, so we were obviously never going to see it in the first place. But what we did get to see was Swift and Alwyn cozy up at iHeartRadio's Jingle Ball last week.\n\nFans swooned when they saw Swift and Alwyn swaying and singing along while Ed Sheeran was on stage performing \"Perfect.\"\n\nThen they freaked out even more when they saw Swift and Alwyn singing along while Sheeran performed \"Thinking Out Loud.\"\n\nAccording to sources, Swift and Alwyn are planning on spending the holidays together. He's apparently also going on tour with her! A source told People that Alwyn might even be ~the one~. The source said,\n\nIt’s a great relationship that everyone hopes will last. Joe could definitely be the one. Their relationship is very different from Taylor’s past ones. Just like Taylor, Joe is a homebody. He loves being an actor but doesn’t like the celebrity part of it. It’s pretty special to find someone you’re on the same page with.\n\nHope you're OK, Swifties!", "images": ["https://imgix.bustle.com/uploads/image/2022/9/28/b0f43f37-1fd9-4607-9040-390f9b68c1e7-f7819749-01e9-4a30-8d29-0d948716e7b7-getty-1418888016.jpeg?w=138&h=138&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2017/12/14/cf4762b1-9f29-4f49-8384-80ac5b3d412c-getty-107893891.jpg?w=374&h=276&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2022/10/5/6376db86-d033-4190-bcea-0976d51d275e-getty-1243081800.jpg?w=138&h=138&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.456&fp-y=0.3218", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2022/9/29/ae9996bd-4d72-4097-9cdb-83628bd5ae35-taylor_swift_sweatshirts.webp?w=138&h=138&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2017/12/14/cf4762b1-9f29-4f49-8384-80ac5b3d412c-getty-107893891.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg"], "top_img": "https://imgix.bustle.com/uploads/getty/2017/12/14/cf4762b1-9f29-4f49-8384-80ac5b3d412c-getty-107893891.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/selena-gomezs-birthday-message-for-taylor-swift-is-the-sweetest-thing-ever-7590561", "title": "Selena Gomez’s Birthday Message For Taylor Swift Is The Sweetest Thing Ever", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image", "creator": "@kellixboyle"}, "article": {"publisher": "https://www.facebook.com/EliteDaily"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/selena-gomezs-birthday-message-for-taylor-swift-is-the-sweetest-thing-ever-7590561", "type": "article", "title": "Selena Gomez’s Birthday Message For Taylor Swift Is The Sweetest Thing Ever", "description": "Taylor Swift's 28th birthday was Wednesday, Dec. 13, and lots of the singer's famous friends took to social media to wish her a happy birthday. Selena Gomez's birthday message for Taylor Swift is one of the sweetest things you'll see all week and…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2017/12/14/cf4762b1-9f29-4f49-8384-80ac5b3d412c-getty-107893891.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "Taylor Swift's 28th birthday was Wednesday, Dec. 13, and lots of the singer's famous friends took to social media to wish her a happy birthday. Selena Gomez's birthday message for Taylor Swift is one of the sweetest things you'll see all week and…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}