{"url": "https://en.wikipedia.org/wiki/Joe_Alwyn", "text": "English actor\n\nJoseph Matthew Alwyn (born 21 February 1991) is an English actor. He made his feature film debut as the titular character in Ang Lee's 2016 war drama, Billy Lynn's Long Halftime Walk, and has since played supporting roles in films such as The Favourite (2018), Boy Erased (2018), Mary Queen of Scots (2018), and Harriet (2019). His accolades include a Trophée Chopard, a Critics' Choice Movie Award, a Satellite Award, and a Grammy Award.\n\nBorn in Tunbridge Wells, Kent, England, and raised in North London, Alwyn developed an interest in acting during his teenage years and joined the National Youth Theatre in 2009. He made his acting debut in two student productions at Edinburgh Festival Fringe, and graduated with a BA degree in English literature and drama from the University of Bristol (2012). He received another BA in acting from the Royal Central School of Speech and Drama (2015). He won the Trophée Chopard at the 2018 Cannes Film Festival, following his appearance in various critically acclaimed films.\n\nDuring the COVID-19 pandemic in 2020, Alwyn began co-writing songs with American singer-songwriter Taylor Swift, such as \"Exile\" and \"Betty\" from her eighth studio album, Folklore, and \"Champagne Problems\", \"Coney Island\" and \"Evermore\" on its follow-up, Evermore. \"Exile\" charted inside the top 10 in eight countries. For his contributions to Folklore, Alwyn won the Album of the Year at the 63rd Annual Grammy Awards. In 2022, he appeared in a lead role of Hulu series Conversations with Friends, starred in the romantic thriller film Stars at Noon, which won the Grand Prix at the 2022 Cannes Film Festival, and featured on the Time 100 Next list.\n\nEarly life and education\n\nJoseph Matthew Alwyn was born on 21 February 1991 in Tunbridge Wells, Kent, England.[2][3] Raised in Tufnell Park and Crouch End areas of North London,[4][5] Alwyn is the son of a psychotherapist mother and a documentary filmmaker father.[6] He is the great-grandson of composer William Alwyn.\n\nAlwyn was educated at the City of London School.[4] He briefly took guitar lessons, and was part of the school band called \"Anger Management\" around the age 13. He later played football and rugby in school.[7] Although an \"introverted\" child,[8] Alwyn secretly wanted to be an actor[9] and became a member of the National Youth Theatre in his late teens.[10] While pursuing Bachelor of Arts (BA) in English literature and drama at the University of Bristol,[8] he acted in two student productions at the Edinburgh Fringe Festival.[11] He graduated in 2012, and applied for four drama schools, but got rejected by all except one—the Royal Central School of Speech & Drama,[12] where he completed a BA, in acting.[10] During the third year of the course, Alwyn signed with an agent who had come across Alwyn at a student showcase. Soon after, the agent informed Alwyn that a production company was looking to cast the title character of Billy Lynn's Long Halftime Walk (2016), which would go on to mark Alwyn's debut in a feature film.[7]\n\nCareer\n\nActing\n\nWithin a fortnight of his graduate showcase, in early 2015,[13][14] Alwyn was cast in the lead role of Taiwanese director Ang Lee's 2016 war drama film, Billy Lynn's Long Halftime Walk,[15][16] which is a film adaptation based on the 2012 novel of the same name by American writer Ben Fountain.[17] Lee stated he selected Alwyn because of his \"ability to communicate the book's paradox of war with just his facial expressions\".[18] In the film's reviews, critics praised Alwyn's performance for its naturalism.[12] Journalists went on to describe the film as his \"breakout\".[19][14] He then played a supporting role in the 2017 mystery drama film, The Sense of an Ending, directed by Indian filmmaker Ritesh Batra.[19]\n\nOperation Finale in August 2018 Alywn in an interview forin August 2018\n\nAlwyn appeared in a number of 2018 films. He played the British nobleman Samuel Masham, alongside actors Olivia Colman, Rachel Weisz, Emma Stone and Nicholas Hoult, in the period black comedy film, The Favourite,[20] directed by Greek filmmaker Yorgos Lanthimos.[21] The film garnered 10 nominations at the 91st Academy Awards.[22] He portrayed Klaus Eichmann, son of German Nazi official Adolf Eichmann, in Chris Weitz's historical drama Operation Finale, featuring Oscar Isaac and Ben Kingsley in the lead roles,[23][24] and a minor role in Joel Edgerton's Boy Erased—a biographical drama film based on a 2016 memoir by American LGBT+ activist Garrard Conley.[23] Alwyn then appeared as English statesman Robert Dudley, the favourite of Queen Elizabeth I, in the historical drama Mary Queen of Scots, alongside Saoirse Ronan as Queen Mary and Margot Robbie as Elizabeth.[25][26] Acknowledging his talent, Alwyn was awarded the Trophée Chopard alongside Australian actress Elizabeth Debicki at the 2018 Cannes Film Festival.[27]\n\nIn 2019, Alwyn played a slave owner named Gideon Brodess in Harriet, a biographical drama about American abolitionist Harriet Tubman, starring Cynthia Erivo and Janelle Monáe.[28] He appeared as Bob Cratchit in the dark fantasy television miniseries A Christmas Carol, based on the 1843 novella of the same name by English writer Charles Dickens.[29] In 2021, he had a minor role in drama film The Souvenir Part II,[30] and played a 1960s industrialist in the film adaptation of English novelist Jojo Moyes' 2008 romantic novel, The Last Letter from Your Lover, alongside Felicity Jones, Callum Turner and Shailene Woodley.[31]\n\nLeading opposite Jemima Kirke and Sasha Lane, Alwyn appeared in the 2022 drama series Conversations with Friends—a Hulu adaptation of the 2017 novel of the same name by Irish author Sally Rooney.[32] He also appeared in two 2022 films: paired with Margaret Qualley in the romantic thriller film Stars at Noon, directed by French filmmaker Claire Denis,[33] and as the uncle of the titular character (played by Bella Ramsey) in Lena Dunham's medieval comedy film, Catherine Called Birdy, based on the 1994 children's novel of the same name by American writer Karen Cushman;[34] both the films were met with generally positive reviews,[35][36] with the former premiering at the 2022 Cannes Film Festival and winning the Grand Prix.[37] Alwyn has been cast alongside Riz Ahmed and Morfydd Clark in Aneil Karia's modern adaptation of William Shakespeare's Hamlet.[38]\n\nMusic\n\nAlwyn co-produced the songs \"Exile\", \"Betty\", \"My Tears Ricochet\", \"August\", \"This Is Me Trying\" and \"Illicit Affairs\" on American singer-songwriter Taylor Swift's eighth studio album, Folklore (2020);[39] he also co-wrote \"Exile\" and \"Betty\", under the pseudonym William Bowery.[40] \"Exile\" reached the top 10 of the charts in various countries, including number six on the US Billboard Hot 100[41] and number eight on the UK Singles Chart.[42] At the 63rd Annual Grammy Awards in 2021, \"Exile\" was nominated for the Grammy Award for Best Pop Duo/Group Performance, while Folklore won the Album of the Year, garnering Alwyn his first Grammy win.[43] He (as Bowery) also co-wrote \"Champagne Problems\", \"Coney Island\" and the title track on Swift's second 2020 album, Evermore.[44] In April 2022, Alwyn revealed to The Wall Street Journal that the name \"William Bowery\" was derived from the first name of his great grandfather William Alwyn, who was a music composer, and the last name in honor of the New York City neighbourhood Bowery, where he had spent \"a lot of time\" when he first arrived to the U.S.[7] Alwyn also explained that he had not planned on working with Swift, but \"it came about from messing around on a piano, and singing badly,\" and then \"being overheard by Swift, and being, like, 'Let's see what happens if we get to the end of it together'.\"[45]\n\nPersonal life\n\nAlwyn keeps his personal life mostly discreet, which he self-described as a \"knee-jerk response to the culture we live in\".[7] He dislikes media's invasion of privacy.[46] GQ labelled Alwyn a \"notoriously low-key actor\".[47] The Wall Street Journal went on to call him \"Hollywood's Most Private Leading Man\".[7] Since 2016, Alwyn has been in a relationship with Taylor Swift.[note 2][51][52] Media outlets have taken note of the privacy Alwyn and Swift maintain about their relationship, as Swift was more open about her romantic life in the past.[53]\n\nIn April 2022, when Elle questioned Alwyn about his discretion, he replied \"It's not really [because I] want to be guarded and private, it's more a response to something else. We live in a culture that is so increasingly intrusive... the more you give—and frankly, even if you don't give it—something will be taken.\"[54] Commenting on rumors about alleged engagement with Swift, Alwyn told The Wall Street Journal: \"If I had a pound for every time I think I've been told I've been engaged, then I'd have a lot of pound coins. I mean, the truth is, if the answer was yes, I wouldn't say, and if the answer was no, I wouldn't say.\"[7]\n\nFilmography\n\nKey Denotes productions that have not yet been released\n\nFilm\n\nTelevision\n\nYear Title Role Notes 2019 A Christmas Carol Bob Cratchit Miniseries; 3 episodes 2022 Conversations with Friends Nick Conway Main role; 12 episodes\n\nDiscography\n\nAccolades\n\nAlwyn has won 12 awards from 16 nominations. He appeared in the 2022 Time 100 Next, a listicle by Time recognizing \"100 rising stars from across industries and around the world.\"[55][56]\n\nSee also\n\n^ Songwriting pseudonym ^ Reputation (2017), Lover (2019), Folklore and Evermore (both 2020).[48][49] Alwyn stated he finds it \"flattering\" that Swift writes songs about him.[50] He has been referenced in much of Swift's music since 2016, such as her albums(2017),(2019),and(both 2020).Alwyn stated he finds it \"flattering\" that Swift writes songs about him.", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/Joe_Alwyn_during_an_interview%2C_August_2018.png/170px-Joe_Alwyn_during_an_interview%2C_August_2018.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/3/37/Dagger-14-plain.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/W_Joe_Alwyn.jpg/220px-W_Joe_Alwyn.jpg", "https://upload.wikimedia.org/wikipedia/commons/9/9a/W_Joe_Alwyn.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/9/9a/W_Joe_Alwyn.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Joe_Alwyn", "title": "Joe Alwyn", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/W_Joe_Alwyn.jpg/640px-W_Joe_Alwyn.jpg", "width": 640, "height": 815}, "title": "Joe Alwyn - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}