{"url": "https://en.wikipedia.org/wiki/List_of_Modern_Family_characters", "text": "Modern Family is an American TV comedy series revolving around three families interrelated through Jay Pritchett, his son Mitchell Pritchett, and his daughter Claire Dunphy. The families meet for family functions (usually around their three neighborhoods or while traveling during vacations) and cross-family bonding.\n\nMain cast [ edit ]\n\nThe Dunphy family [ edit ]\n\nPhil Dunphy [ edit ]\n\nFictional character\n\nPhil Dunphy First appearance \"Pilot\"\n\n1x01, September 23, 2009 Last appearance \"Finale\"\n\n11x17 & 11x18, April 8, 2020 Portrayed by Ty Burrell In-universe information Gender Male Occupation Realtor and magic store owner Family Frank Dunphy (father; deceased)\n\nGrace Dunphy (mother; deceased)\n\nLorraine Dunphy (stepmother)\n\nRay (stepbrother) Spouse Claire Dunphy ​ ( m. 1993) ​ 1993) Children Haley Dunphy (daughter)\n\nAlex Dunphy (daughter)\n\nLuke Dunphy (son) Relatives George Marshall (grandson)\n\nPoppy Marshall (granddaughter)\n\nDylan Marshall (son-in-law)\n\nJay Pritchett (father-in-law)\n\nDeDe Williams (mother-in-law; deceased)\n\nGloria Delgado-Pritchett (stepmother-in-law)\n\nMitchell Pritchett (brother-in-law)\n\nJoe Pritchett (half-brother-in-law)\n\nManny Delgado (stepbrother-in-law)\n\nCameron Tucker (brother-in-law)\n\nLily Tucker-Pritchett (niece by marriage)\n\nRexford Tucker-Pritchett (nephew by marriage)\n\nPhilip Humphrey \"Phil\" Dunphy (Ty Burrell) is Claire's husband of 15 years who sees himself as the \"cool dad\". He dotes on his wife Claire and constantly tries to find ways to bond with his three kids. He is seen as very competitive, one example being his always beating his son at basketball. He has a very juvenile attitude and is referred to by Claire as the \"kid [she's] married to.\" He uses a parenting method that he calls \"peerenting\", which is a combination of talking like a peer but acting like a parent.[2]\n\nTy Burrell portrays Phil Dunphy, the father of three children and Claire's husband.\n\nPhil is a real estate agent who is very confident in his work, once saying, \"I could sell a fur coat to an Eskimo.\" Phil has a severe case of coulrophobia, which is first revealed when despite Mitchell's objection, Cameron comes to Luke's party dressed as a clown. This may stem from Phil's having found a dead clown in the woods when he was a child. Phil once dresses up as a clown for a kids' party but has a panic attack when he catches his reflection in multiple mirrors. Phil appears to love home repair yet never seems to get around to any of the jobs requested by Claire. Throughout season 1, his ongoing project is fixing the step. He at times shows a sort of crush-like affection for Gloria. However, he says he \"would never stray from Claire,\" although Gloria did kiss him during a \"kiss cam\" segment at a basketball game in the final episode of season 1, \"Family Portrait.\" He is also staring at her when she does something that makes Phil think she is sexy.[2] In college, he was a cheerleader at Fresno State and his birthday is on April 3.[3]\n\nPhil seems oblivious as to what he says by miscalculating (if at all) the consequences of his expressions, such as \"Phil Dunphy is no straight guy\" (when he is referring to not being a straight man)[4] or \"If you ain't white, you ain't right\" (referring to the color of a team that he was playing on).[5] He often seeks approval from Jay, who generally does not openly show approval of anyone. In the Season 3 episode \"Dude Ranch,\" Phil shows considerable skill both on horseback and with a shotgun, notably shooting two clay pigeons on one foot.\n\nIn moments of acute adversity or shock in which most people would curse or swear, Phil utters humorous exclamations: references to food such as, \"Sweet Potato Fries!\" or \"Chicken in a basket!\", etc. or he might make a historical reference such as \"John Philip Sousa!\" It is revealed in \"Tableau Vivant\" that Phil had once tried to break up with Claire but didn't dare to do so.\n\nA running gag in the show has Phil running up the stairs (often when carrying an object) and tripping on a loose step, which causes him to quickly and hastily say: \"Gotta fix that step!\"\n\nCritical reception [ edit ]\n\nTy Burrell had received many positive reviews for his performance. Hank Stuever from The Washington Post wrote, \"A standout performance from Ty Burrell's new twist on the doofus-dad stereotype.\"[6] Paige Wiser, a reporter for the Chicago Sun Times, wrote, \"Ty Burrell is a genius as a dad who stays hip by keeping up with the numbers from High School Musical.\"[7] Robert Canning of IGN in a review of the season loved Ty Burrell's performance of Phil Dunphy and named him one of two characters that stood out to him saying \"actor Ty Burrell owned this part, and his well-intended faux pas throughout the season were stellar.\"[8]\n\nAccolades [ edit ]\n\nIn 2010, Ty Burrell received a nomination for the Television Critics Association Award for Individual Achievement in Comedy, winning in 2011. In 2011 and 2014, Burrell won the Primetime Emmy Award for Outstanding Supporting Actor in a Comedy Series, also receiving nominations in 2010, 2012, and 2013. In 2012, Burrell won the Critics' Choice Television Award for Best Supporting Actor in a Comedy Series. In 2014, Burrell won the Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Comedy Series, receiving nominations in 2011, 2012, 2013, 2015, and 2016. In 2010 and 2011, Burrell was nominated for the Satellite Award for Best Supporting Actor – Series, Miniseries or Television Film.\n\nOther appearances [ edit ]\n\nOn May 4, 2016, Phil appeared in the first commercials for the National Association of Realtors telling about his \"Phil's-osophies.\" Arnold Worldwide executive creative director Sean McBride said Phil was written as a Realtor on his show and \"embodies many of the attributes that are important in a Realtor: He's honest, he's helpful, he's sincere.\"[9]\n\nClaire Dunphy [ edit ]\n\nFictional character\n\nClaire Pritchett Dunphy First appearance \"Pilot\"\n\n1x01, September 23, 2009 Last appearance \"Finale\"\n\n11x17 & 11x18, April 8, 2020 Portrayed by Julie Bowen In-universe information Gender Female Occupation Former President of Pritchett Closets and Blinds. Family Jay Pritchett (father)\n\nDeDe Williams (mother; deceased)\n\nGloria Delgado-Pritchett (stepmother)\n\nMitchell Vincent Pritchett (brother)\n\nJoe Pritchett (half-brother)\n\nManny Delgado (stepbrother) Spouse Phil Dunphy ​ ( m. 1993) ​ 1993) Children Haley Dunphy (daughter)\n\nAlex Dunphy (daughter)\n\nLuke Dunphy (son) Relatives George Marshall (grandson)\n\nPoppy Marshall (granddaughter)\n\nDylan Marshall (son-in-law)\n\nLucas Williams (grandfather; deceased)\n\nDonnie Pritchett (uncle)\n\nIrene Pritchett (aunt)\n\nBecky Pritchett (aunt)\n\nMelissa Pritchett (grand-cousin)\n\nBeBe Williams (aunt)\n\nCeCe Williams (aunt)\n\nLily Tucker-Pritchett (niece)\n\nRexford Tucker-Pritchett (nephew)\n\nCameron Tucker (brother-in-law)\n\nFrank Dunphy (father-in-law, deceased)\n\nGrace Dunphy (mother-in-law; deceased)\n\nLorraine Dunphy (step-mother-in-law)\n\nRay (step-brother-in-law)\n\nClaire Melinda Dunphy (Julie Bowen), née Pritchett, is the wife of Phil Dunphy, the daughter of Jay, Mitchell's older sister, Gloria's step-daughter, Manny's step-sister, Joe's half-sister and the helicopter soccer mom of the Dunphy family and its three very different kids.[10] She was once a wild child who made a great deal of mistakes over the years, and she is fearful that her children could make the same mistakes, especially her oldest daughter, Haley. She is often exhausted from the stress created by her family but is still a loving mother.[10] When it comes to her kids, she has difficulty controlling Haley's independence and irresponsibility, Alex's sarcasm and perfectionism, and Luke's lack of common sense.[10] She also gets annoyed with her husband, Phil, constantly.\n\nJulie Bowen portrays Claire Dunphy, the mother of three and Phil's wife.\n\nClaire is very competitive, especially in her obsession with being right, and has a brittle personality that causes her to get angry, paranoid, and freak out easily. She is very strict about a clean house. She is seen as an experienced parent by Cameron and Mitchell, so she is called upon for her parenting advice. She enjoys running and reading. She could also come across as uptight or arrogant at times, especially during her scenes with Gloria. She is also very attached to Halloween and describes it as her \"crazy lady holiday.\" In the episode \"Open House of Horrors,\" it is revealed that the neighbors are frightened of Claire's very graphic and realistic decorations around the house. Claire is also the most active family member when organizing family get-togethers. When a former co-worker (Minnie Driver) visits, it is revealed that Claire had a successful job in hospitality management but left her job and married Phil a few months after she became pregnant with Haley. She shows resentment towards the abandonment of her working career due to seeing one of her former peers' success but later realizes her family is more important.[11]\n\nClaire is a perfectionist; according to Phil, \"when everybody else sees something beautiful, all she sees is the teeny-tiny flaw.\" She is also terrible at giving gifts. As her husband Phil once bought her a bracelet for their anniversary, she made him coupons for five free hugs, which she was very proud of.\n\nHer step-brother is Manny Delgado. Claire received another sibling through Jay's second wife, Gloria – Fulgencio \"Joe.\" She often despises the attention that Gloria gets for her voluptuous figure and is thrilled to learn that Gloria was pregnant because of all the weight that Gloria would be gaining. But generally she has a good relationship with Gloria and they sometimes do yoga or spa days together.\n\nCritical reception [ edit ]\n\nJulie Bowen's performance was praised by Ken Tucker of Entertainment Weekly who said, \"Bowen's Claire could have been a blank blonde cipher. Far from it: Bowen's wide array of silent gazes at the camera, her slow-burns at her clan's bad behavior, and her ability to freak out without seeming nutso crazy makes her an essential, stand-out part of TV's best freshman ensemble cast.\"[12]\n\nAccolades [ edit ]\n\nIn 2011 and 2012, Julie Bowen won the Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series, receiving nominations in 2010 and 2013. In 2012, Bowen won the Critics' Choice Television Award for Best Supporting Actress in a Comedy Series. She has also been nominated twice for the Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Comedy Series in 2012 and 2014. In 2009, Bowen was nominated for the Satellite Award for Best Actress in a Television Series – Musical or Comedy, and then for Best Supporting Actress – Series, Miniseries, or Television Film in 2010.\n\nHaley Dunphy [ edit ]\n\nFictional character\n\nHaley Dunphy First appearance \"Pilot\"\n\n1x01, September 23, 2009 Last appearance \"Finale\"\n\n11x17 & 11x18, April 8, 2020 Portrayed by Sarah Hyland In-universe information Gender Female Occupation Assistant Fashion Designer at Gavin Sinclair\n\nStyle editor for Nerp\n\nStudent in marketing and photography in a Community College (formerly, graduated)\n\nUniversity Student (formerly) Family Philip Humphrey \"Phil\" Dunphy (father)\n\nClaire Melinda Pritchett (mother)\n\nAlexandra Anastasia Dunphy (younger sister)\n\nLucas \"Luke\" Philip Dunphy (younger brother) Spouse Dylan Marshall ​ ( m. ) ​ Significant other Andy Bailey (ex-boyfriend)\n\nRainer Shine (ex-boyfriend)\n\nDr. Arvin Fennerman (ex-boyfriend) Children George Marshall (son)\n\nPoppy Marshall (daughter) Relatives Frank Dunphy (paternal grandfather; deceased)\n\nGrace Dunphy (paternal grandmother; deceased)\n\nJay Francis Pritchett (maternal grandfather)\n\nDeDe Williams (maternal grandmother; deceased)\n\nGloria Delgado-Pritchett (step-grandmother)\n\nLucas Williams (maternal great-grandfather; deceased)\n\nMitchell \"Mitch\" Vincent Pritchett (maternal uncle)\n\nFulgencio Joseph \"Joe\" Pritchett (maternal half-uncle)\n\nManny Delgado (step-uncle)\n\nLily Tucker-Pritchett (cousin)\n\nRexford Tucker-Pritchett (cousin)\n\nDonnie Pritchett (maternal great-uncle)\n\nBecky Pritchett (maternal great-aunt)\n\nBeBe Williams (maternal great-aunt)\n\nCeCe Williams (maternal great-aunt)\n\nCameron \"Cam\" Scott Tucker (uncle by marriage)\n\nLorraine Dunphy (step-grandmother)\n\nRay (step-uncle)\n\nFarrah Marshall (mother-in-law)\n\nHaley Gwendolyn Dunphy (Sarah Hyland) is the elder daughter of Claire and Phil, who is portrayed as the stereotypical teenager.[13] Haley was born on December 10, 1993.[14] At the start of the series, Haley is a high school sophomore. Haley is depicted as being a flirt, who focuses more on social status than studies. She is a little naive, especially when it comes to arguing with her parents.[13]\n\nSarah Hyland portrays Haley Dunphy, one of the daughters\n\nShe is concerned about her social standing at school, including her sex life, and is frequently embarrassed by her parents' conduct.[13] Haley contemplates moving in with Dylan before learning that she got into college in the final episode of the third season. After a run-in with the law on campus in Season 4, she is expelled from college and moves back into the Dunphy home. She begins a fashion blog and goes to community college to study business and photography, eventually showing and selling her photos in an exhibit. In Season 6, she gets a job working for fashion designer Gavin Sinclair as his assistant, doing some of her design work. In season 9, episode 13, she starts working at a lifestyle company called Nerp.\n\nThroughout Season 6, Haley develops feelings for Jay and Gloria's hired nanny, Andy, with whom she comes to spend much of her time and with whom she begins a relationship in \"White Christmas.\" At the end of Season 7, Andy is offered a job in his hometown in Utah and initially turns it down, but Haley encourages him to pursue it, insisting that they will figure out a way to be together. As they say goodbye at the airport, she admits that Andy is the first man she has ever really loved. As of \"Weathering Heights,\" she is dating weatherman Rainer Shine, though they break up later in the season after he proposed, and they both realized they weren't ready. In season 9's \"In Your Head,\" she starts dating Dr. Arvin Fennerman, Alex's astrophysics teacher at Caltech. However, a divorced Dylan reappears in the season 10 premiere and confesses that he is still in love with her and wants to be worthy. They sleep together, and Haley finds herself in love with both men. Later that season in \"Torn Between Two Lovers,\" she finally decides Dylan is \"the one\" and breaks up with Arvin.\n\nIn the episode \"Did the Chicken Cross the Road?\", she finds out she is pregnant. In the episode \"Can't Elope,\" she marries Dylan. In the episode \"A Year of Birthdays,\" she gives birth to twins, Poppy and George.\n\nAlex Dunphy [ edit ]\n\nFictional character\n\nAlex Dunphy First appearance \"Pilot\"\n\n1x01, September 23, 2009 Last appearance \"Finale\"\n\n11x17 & 11x18, April 8, 2020 Portrayed by Ariel Winter In-universe information Gender Female Occupation Student Family Phil Dunphy (father)\n\nClaire Dunphy (mother)\n\nHaley Dunphy (sister)\n\nLuke Dunphy (brother) Significant other Sanjay Patel (ex-boyfriend)\n\nBen (ex-boyfriend)\n\nBill (ex-boyfriend)\n\nArvin Fennerman (boyfriend) Relatives Frank Dunphy (grandfather; deceased)\n\nGrace Dunphy (grandmother; deceased)\n\nJay Pritchett (grandfather)\n\nDeDe Williams (grandmother; deceased)\n\nGloria Delgado-Pritchett (step-grandmother)\n\nLucas Williams (great-grandfather; deceased)\n\nGeorge Marshall (nephew)\n\nPoppy Marshall (niece)\n\nDylan Marshall (brother-in-law)\n\nMitch Pritchett (uncle)\n\nJoe Pritchett (half-uncle)\n\nLily Tucker-Pritchett (cousin)\n\nRexford Tucker-Pritchett (cousin)\n\nDonnie Pritchett (great-uncle)\n\nBecky Pritchett (great-aunt)\n\nBeBe Williams (great-aunt)\n\nCeCe Williams (great-aunt)\n\nManny Delgado (step-uncle)\n\nCameron Tucker (uncle by marriage)\n\nLorraine Dunphy (step-grandmother)\n\nRay (step-uncle)\n\nAlexandra Anastasia \"Alex\" Dunphy (Ariel Winter) (born January 14, 1996) is the younger daughter of Claire and Phil. Characteristically nerdy but still cute, Alex is the most intelligent of the three siblings and a polar opposite of Haley. She is very bright and cares much more about her studies than friends/social life and boys.[15] As the middle child to a shallow older sister and a goofy younger brother, she enjoys messing with them.[15] Often taking advantage of their naïveté by fooling them into believing unrealistic things, she at one time convinced Haley and Luke that they could charge electronics by rubbing the battery on their heads (Haley) and putting it in their mouths (Luke).[13] She also convinced Luke that he was Phil's old girlfriend's son and that Jay was dying.\n\nAriel Winter portrays Alex Dunphy, one of the daughters\n\nAs a stereotypical precocious kid, Alex displays a sense of superiority due to her intelligence, continually putting her accomplishments on display and demanding recognition for them. An overachiever, she plays the cello; she chose to play the cello because she would have a better chance at being in a university orchestra than if she played the violin as cellos are more in demand. While she has sometimes felt isolated from her peers (once sadly telling her parents \"I have no friends\"), she has a group of nerdy fans at school who idolize her. Haley sincerely tells Alex at one point that she is smart and attractive in a successful effort to get her to give a light-hearted graduation speech instead of a harsh one (it worked well enough that her classmates invited her to a post-ceremony party). At the beginning of Season 3, she was in a long-distance relationship with a boy she met in Wyoming. Later in the season, she went to her prom with a classmate who everyone knows is gay.\n\nIt was established in the episode \"Tableau Vivant\" that Alex is a light sleeper, as she was surprisingly energetic when staying awake nearly a whole night thinking about her upcoming art project. The episode \"Heart Broken\" reveals that Alex suffers from hemophobia. In the second episode of Season 5 onwards, she started wearing new glasses. In Season 6, Alex is currently seeking the best college to enroll in and thinking about getting away from her family for a while. While Alex was not accepted into Harvard, she was accepted into Caltech, where she has been attending since the start of Season 7. She had to leave for a little due to getting mono. She was dating Sanjay Patel until he broke up with her in \"The Closet Case.\"\n\nIn season 8, she has a relationship with Ben (Joe Mande), who works at Pritchett's Closets & Blinds, but later breaks up with him. As of the season 9 episode \"Royal Visit,\" she's dating Bill (Jimmy Tatro), a firefighter who rescued her when she burned a bagel in her room's microwave. Though he is handsome and muscular, Alex is a bit ashamed because he is not very smart, although they later break up.\n\nLuke Dunphy [ edit ]\n\nFictional character\n\nLuke Dunphy First appearance \"Pilot\"\n\n1x01, September 23, 2009 Last appearance \"Finale\"\n\n11x17 & 11x18, April 8, 2020 Portrayed by Nolan Gould In-universe information Gender Male Occupation Student Family Phil Dunphy (father)\n\nClaire Dunphy (mother)\n\nHaley Dunphy (sister)\n\nAlex Dunphy (sister) Relatives Frank Dunphy (grandfather; deceased)\n\nGrace Dunphy (grandmother; deceased)\n\nJay Pritchett (grandfather)\n\nDeDe Williams (grandmother; deceased)\n\nGloria Delgado-Pritchett (step-grandmother)\n\nLucas Williams (great-grandfather; deceased)\n\nGeorge Marshall (nephew)\n\nPoppy Marshall (niece)\n\nDylan Marshall (brother-in-law)\n\nMitch Pritchett (uncle)\n\nJoe Pritchett (half-uncle)\n\nLily Tucker-Pritchett (cousin)\n\nRexford Tucker-Pritchett (cousin)\n\nDonnie Pritchett (great-uncle)\n\nBecky Pritchett (great-aunt)\n\nBeBe Williams (great-aunt)\n\nCeCe Williams (great-aunt)\n\nManny Delgado (step-uncle)\n\nCameron Tucker (uncle by marriage)\n\nLorraine Dunphy (step-grandmother)\n\nRay (step-uncle)\n\nLucas Philip \"Luke\" Dunphy (Nolan Gould) (born November 28, 1998) is Claire and Phil's rambunctious son, who is often doing his own thing.[16] He was named after his great-grandfather, Lucas (DeDe's father). At times, he can be a troublemaker, once shooting his sister with a toy gun and getting into a fight with Manny at school. Luke is playful, very innocent, and does not always understand the repercussions of his actions; he once announced at a family gathering that his mom thought her dad's new wife was a \"gold digger,\" although he had misheard it as \"coal digger.\"[16] Unlike his sister Alex, Luke never wins any awards at school except once when Claire meddles to get him the Integrity Award by moving the car of the first choice nominee in the disabled parking.\n\nNolan Gould portrays Lucas Dunphy, the son\n\nLuke is also thought to be rather vacuous because of many questionable actions, such as getting his head stuck in the railing and jumping on the trampoline wearing only underwear and a box on his head.[16] Both parents agree that they \"dropped the ball\" with raising Luke; this is exemplified when Luke states that he was still wearing diapers when he was five years old.[17] Phil once tells Claire that he considers Luke to be their dumbest child (although he conceded to Claire's assertion that Haley was, in fact, dumber than Luke). A psychologist who evaluated him said his type of behavior was normal for someone with above-average intelligence; afterward, Phil and Claire accidentally left a wandering Luke behind when they left the psychologist's office, but they ended up being impressed by how calmly he made his way back home (in a limo) and decided he would do just fine in life. Subsequent events have borne this out, as he only got into one college he applied to (and did so because Phil gave up some magic secrets to his former rival-turned-Dean of Admissions) but has become a well-paid social fixture at Jay's country club and shows he can use his connections to help his family. He is frequently seen playing a Nintendo 3DS. Throughout the series, he is often seen playing with Manny. Often, they do not just play but develop plans, plots, and ploys. Being that Luke's birthday is November 28, it sometimes coincides with Thanksgiving.[19]\n\nDylan Marshall [ edit ]\n\nFictional character\n\nDylan Marshall First appearance \"Pilot\"\n\n1x01, September 23, 2009 Last appearance \"Finale\"\n\n11x17 & 11x18, April 8, 2020 Portrayed by Reid Ewing In-universe information Gender Male Occupation Musician, cowboy (formerly), Disneyland employee (formerly), limo driver (formerly), sign spinner (formerly), T-shirt designer (formerly)\n\nNursing student Family Farrah Marshall (mother)\n\nUnnamed sibling(s)\n\n1 unnamed nephew Spouse Elaine Kolchek ​ ​ ( m. 2016; div. 2018) ​ 2016;2018)\n\nHaley Dunphy ​ ( m. ) ​ Children George Marshall (son)\n\nPoppy Marshall (daughter) Relatives Phil Dunphy (father-in-law)\n\nClaire Dunphy (mother-in-law)\n\nAlex Dunphy (sister-in-law)\n\nLuke Dunphy (brother-in-law)\n\nJay Francis Pritchett (grandfather-in-law)\n\nDeDe Williams (grandmother-in-law; deceased)\n\nGloria Delgado-Pritchett (step-grandmother-in-law)\n\nFrank Dunphy (grandfather-in-law; deceased)\n\nGrace Dunphy (grandmother-in-law; deceased)\n\nLucas Williams (great-grandfather-in-law; deceased)\n\nMitchell \"Mitch\" Vincent Pritchett (uncle-in-law)\n\nFulgencio Joseph \"Joe\" Pritchett (half-uncle-in-law)\n\nManny Delgado (step-uncle-in-law)\n\nLily Tucker-Pritchett (cousin-in-law)\n\nRexford Tucker-Pritchett (cousin-in-law)\n\nDonnie Pritchett (great-uncle-in-law)\n\nBecky Pritchett (great-aunt-in-law)\n\nBeBe Williams (great-aunt-in-law)\n\nCeCe Williams (great-aunt-in-law)\n\nCameron \"Cam\" Scott Tucker (uncle-in-law by marriage)\n\nLorraine Dunphy (step-grandmother-in-law)\n\nRay (step-uncle-in-law)\n\nDylan Stardust Marshall (Reid Ewing), sometimes called \"D-Money\" by Phil, is the on-and-off boyfriend (and eventual husband) of Haley Dunphy, introduced as a senior in high school who plays guitar, sings in a band, and has no plans for college. He is often put into awkward situations by Phil, who wishes for the two to be friends.[13] He has diverse interests that are often surprising, such as his love of old western films. He also sometimes reveals a sort-of attraction to Claire when he gives her a rose on Valentine's Day, saying that \"every mom should look as tasty as you when they're old.\" He also had a dream involving a (suggested) sexual encounter involving himself, Haley, and Claire. Claire strongly dislikes him, to the point of trying to introduce other boys to Haley just so that they break up or don't get back together. He loves the confidence Haley gets from being part of such a loving family and does not mind hanging around during family get-togethers.[13] He wrote a song for Haley, \"In the Moonlight (Do Me),\" and performed it for her extended family. The song was about sex, and most of the family were surprised by the suggestive lyrics, but it became stuck in all of their heads the next day. He finds inspiration for his music from Bob Dylan, Sum 41, Blink-182 and New Kids on the Block.\n\nDylan temporarily leaves the cast to work on a ranch after Haley rejects his marriage proposal in the first episode of season three, \"Dude Ranch.\" In the episode \"Virgin Territory\" Alex reveals that Haley had lost her virginity to Dylan before they broke up; she told Claire three months earlier, but not Phil. In the episode \"Disneyland,\" Dylan reveals he lost his job on the ranch and moved back to California, taking a job at Disneyland as a Dapper Dan. He and Haley get back together to Claire's dismay and Phil's delight. In the season finale, \"Baby on Board,\" Haley discovers she was accepted to college. She and Dylan maintain their relationship, and Dylan lives with the Dunphys for a few months. In Season 4, Dylan is invited to move in with Cam and Mitch after his job as a limo driver led him to their Valentine's Day party. He ends up getting fired, and while Cam and Mitch separately tell him he can stick around, Lily angrily tells him he isn't welcome there and shouts at him until he leaves the house. In Season 8, he marries a doctor named Elaine Kolchek and has three step-kids, much to Haley's dismay as she feels she lost her \"romantic safety net.\" Dylan finally married Haley in the season 10 episode \"Can't Elope,\" and in the episode \"A Year of Birthdays,\" delivered twins Poppy and George.\n\nThe Pritchett-Delgado family [ edit ]\n\nJay Pritchett [ edit ]\n\nFictional character\n\nJay Pritchett First appearance \"Pilot\"\n\n1x01, September 23, 2009 Last appearance \"Finale\"\n\n11x17 & 11x18, April 8, 2020 Portrayed by Ed O'Neill In-universe information Gender Male Occupation Retired business owner Family Donnie Pritchett (brother)\n\nBecky Pritchett (sister) Spouse DeDe Williams ​ ​ ( m. 1968; div. 2003) ​ 1968;2003) [note 1]\n\nGloria Delgado-Pritchett ​ ​ ( m. 2009) ​ 2009) Children Claire Pritchett (daughter)\n\nMitch Pritchett (son)\n\nJoe Pritchett (son)\n\nManny Delgado (stepson) Relatives Haley Dunphy (granddaughter)\n\nAlex Dunphy (granddaughter)\n\nLuke Dunphy (grandson)\n\nLily Tucker-Pritchett (granddaughter)\n\nRexford Tucker-Pritchett (grandson)\n\nGeorge Marshall (great-grandson)\n\nPoppy Marshall (great-granddaughter)\n\nDylan Marshall (grandson-in-law)\n\nMichael Pritchett (nephew)\n\nBrian (nephew)\n\nMelanie Pritchett (great-niece)\n\nIrene Pritchett (sister-in-law)\n\nPhil Dunphy (son-in-law)\n\nCameron Tucker (son-in-law)\n\nJay Francis Pritchett (Ed O'Neill) is the father of Claire, Mitchell, and Joe; husband of Gloria; maternal grandfather of Haley, Alex, Luke; and paternal grandfather of Lily; father-in-law of Phil and Cam; and step-father of Manny. He is the owner of a closet company and is presumably the wealthiest family member and, occasionally, the family's chieftain in many situations. Jay has a dry and sarcastic sense of humor. As with his son and daughter, Jay is generally more realistic, mild-mannered, and sensible than his partner, Gloria, who is unashamed because Jay is many years her senior. A recurring plot involves Jay's relationship with his son Mitchell, which became more complicated due to Jay's reaction to Mitchell's sexual orientation. Humor and plot points are also derived from Jay's relationship with his son-in-law Phil; Jay often mistreats and antagonizes him despite Phil's constant attempts to gain Jay's approval. Nevertheless, Jay thinks very highly of Phil, despite their differences, and said so in Season 3.\n\nJay has several masculine character attributes, including a fondness for sports and model airplanes. Jay is also shown to be compassionate occasionally, showing affection for members of the extended family, particularly to Manny, his step-son; their relationship seems to become more positive as the series progresses, eventually becoming a typical father-son relationship, and Jay eventually comes to see Manny as his third child. The third season's finale reveals that Gloria is pregnant, but Jay does not know yet. In the first episode of the fourth season, Gloria tells Jay and tells her that it's the greatest news he has heard. The baby was male, which relieved Jay because it says in the episode \"Snip\" that he was afraid of having a girl. Jay is a dog-lover. He sometimes goes overboard in treating his dog Stella as his favorite member of the family, much to Gloria's chagrin, and Jay was thrilled when he realized that Joe was not allergic to Stella, but to Gloria's face cream, in the episode \"Rash Decisions.\" Jay is farsighted (hyperopia). Jay served in the United States Navy during the Vietnam War. His birthday is April 1, as shown in the episode \"Grill, Interrupted.\"\n\nAccolades [ edit ]\n\nO'Neill was consecutively nominated for the Primetime Emmy Award for Outstanding Supporting Actor in a Comedy Series in 2011, 2012, and 2013. In 2011, he was nominated for the Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Comedy Series and Critics' Choice Television Award for Best Supporting Actor in a Comedy Series.[20]\n\nGloria Delgado-Pritchett [ edit ]\n\nFictional character\n\nGloria Delgado Pritchett First appearance \"Pilot\"\n\n1x01, September 23, 2009 Last appearance \"Finale\"\n\n11x17 & 11x18, April 8, 2020 Portrayed by Sofía Vergara In-universe information Gender Female Occupation Hairdresser (formerly)\n\nTaxi driver (formerly)\n\nHousewife (formerly)\n\nRealtor Family Fulgencio Ramírez (father; deceased)\n\nPilar Ramírez (mother)\n\nSonia Ramírez (sister)\n\n2 unnamed brothers Spouse Javier Delgado ​ ​ ( m. 1995; div. 2006) ​ 1995;2006)\n\nJay Pritchett ​ ( m. 2009) ​ 2009) Children Manuel Delgado (son)\n\nJoe Pritchett (son)\n\nClaire Dunphy (stepdaughter)\n\nMitch Pritchett (stepson) Relatives Haley Dunphy (step-granddaughter)\n\nAlex Dunphy (step-granddaughter)\n\nLuke Dunphy (step-grandson)\n\nLily Tucker-Pritchett (step-granddaughter)\n\nRexford Tucker-Pritchett (step-grandson)\n\nDylan Marshall (step-grandson-in-law)\n\nGeorge Marshall (step-great-grandson)\n\nPoppy Marshall (step-great-granddaughter)\n\nDonnie Pritchett (brother-in-law)\n\nBecky Pritchett (sister-in-law)\n\nPhil Dunphy (step-son-in-law)\n\nCameron Tucker (step-son-in-law)\n\nRosa Marina (cousin)\n\nArmando (cousin) Religion Roman Catholic Nationality Colombian/American\n\nGloria Maria Ramírez Delgado Pritchett (Sofía Vergara), formerly Delgado and née Ramírez, is Jay's second wife and mother to Manny and Joe. She is from Barranquilla, Colombia (as is Sofía Vergara herself). She is a very loving wife and mother.[21] At first, the family (specifically Claire) does not accept her because of her age difference to Jay. In the episode \"Coal Digger,\" Luke calls her a coal digger, a mishearing of when Claire called her a gold digger. The most frequent running gag involving the character is her mispronunciation of common English words and phrases. Vergara confirmed that many of these mispronunciations are improvised.[22]\n\nSofía Vergara portrays Gloria Ramírez-Pritchett, wife of her second husband Jay, mother of two, and step-mother of two\n\nGloria often supports Manny when Jay tries to tell him to be less sensitive or hide his cultural background. However, she does occasionally display some odd parenting techniques. For example, when Manny was first born, she had wanted a daughter, and therefore for the first year of his life, she dressed him like one and told all her friends he was a girl. She later told Manny (after he found the pictures of himself like this) that the child in question was his \"twin sister who died at the age of one.\" In the sixth episode of Season One, she chastises Jay for forcing Manny to remove his poncho for school. When they get to the school to return the poncho and realize that Manny has a plan to play folk music to his classmates with his pan flute (which was inside the poncho), Gloria tells Jay to break the flute, saying in her interview that \"the poncho by itself is fine. The poncho, plus the flute, plus the stupid dance? My son will die a virgin.\"\n\nGloria is a terrible driver, though she is oblivious to this. She is also very comfortable with death (on one occasion killing and beheading a rat with a shovel right before she left for church and leaving the head \"as a warning to the other rats\"), on account of a couple of her relatives being butchers.[21] She is an excellent marksman, often just using one hand and never misses a shot, even saying to Manny that she could have unbuttoned his shirt if she wanted to with her gun (formerly Manny's BB gun). She has a very high tolerance for spicy food and has perhaps the strongest religious views of any family member.[citation needed] She loves her family and spends a great deal of time with Lily because she fixates on having a daughter. Mitchell and Cameron asked her and Jay to become guardians of Lily if anything were to happen to them.\n\nGloria has something of a shady past. Doubts have also been raised about her income: her only mentioned employment was as a hairdresser (and later as a taxi driver), and Claire, Jay's daughter, originally labeled Gloria as a \"gold-digger\" for marrying her wealthy father. It seems likely that Jay is her major source of income. However, in the Season 5 episode \"A Hard Jay's Night,\" the hair shop where she used to work is shown, and it is clarified that Jay is indeed her major current source of income. In the final episode of Season 3, it was revealed that she is pregnant. Her newest son Fulgencio a.k.a. Joe, was born in the Season 4 episode \"Party Crasher.\" In the episode \"Fifteen Percent,\" she reveals that she comes from a neighborhood of prostitutes after she said her neighborhood had a saying that \"Love is just around the corner.\" The Hispanic American character of Gloria was based on the character of Angela in the Jim Jarmusch film Night on Earth (1991), played by American actress Rosie Perez.[23] In season 6, Gloria officially became an American citizen.\n\nAccolades [ edit ]\n\nSofía Vergara has been nominated four times for the Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series and the Golden Globe Award for Best Supporting Actress – Series, Miniseries, or Television Film. In 2011, Vergara was nominated for the Best Supporting Actress – Series, Miniseries, or Television Film and Critics' Choice Television Award for Best Supporting Actress in a Comedy Series. She was also nominated for the Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Comedy Series in 2011, 2012, and 2013.\n\nManny Delgado [ edit ]\n\nFictional character\n\nManny Delgado First appearance \"Pilot\"\n\n1x01, September 23, 2009 Last appearance \"Finale\"\n\n11x17 & 11x18, April 8, 2020 Portrayed by Rico Rodriguez In-universe information Gender Male Occupation Student Family Javier Delgado (father)\n\nGloria Delgado-Pritchett (mother)\n\nJay Pritchett (stepfather)\n\nJoe Pritchett (half-brother)\n\nClaire Dunphy (stepsister)\n\nMitch Pritchett (stepbrother) Relatives Fulgencio Ramírez (grandfather; deceased)\n\nPilar Ramírez (grandmother)\n\nSonia Ramírez (aunt)\n\nPhil Dunphy (stepbrother-in-law)\n\nCameron Tucker (stepbrother-in-law)\n\nHaley Dunphy (step-niece)\n\nAlex Dunphy (step-niece)\n\nLuke Dunphy (step-nephew)\n\nLily Tucker-Pritchett (step-niece)\n\nRexford Tucker-Pritchett (step-nephew)\n\nDylan Marshall (step-nephew-in-law)\n\nGeorge Marshall (step-great-nephew)\n\nPoppy Marshall (step-great-niece) Nationality Colombian-American\n\nManuel Alberto Javier Alejandro Ramirez \"Manny\" Delgado (Rico Rodriguez), (born January 16, 1999) Gloria's son from her first marriage to Javier, is very outgoing and rather self-conscious.[24] He is brilliant, probably second after Alex, but in a street smart way. He is also mature and intuitive for his age and is often shown doing adult-like things, such as writing precocious poetry for his crushes who are mostly older than him, having conversations with Claire about her marriage and kids, and drinking coffee. He even engaged in the stock market business and briefly considered following his biological father's footsteps by becoming a professional gambler.[24]\n\nManny has inherited his mother's passion for life (although he is terrified of butterflies), though Gloria has also said, \"Manny is passionate, just like his father.\"[21] This causes Manny to be very romantic.[24] Manny is not afraid to take chances, leading him to ask out older girls, and develops a crush on his step-niece Haley, to whom he gave flowers on \"Pilot\" and even kissed in \"Three Turkeys.\"[24] He idolizes his absentee father, often speaking about him in a positive light, even after being repeatedly disappointed by his father's broken promises. He plays for a football team, fences, and is a skilled chess player. He is often seen wearing or intending to wear his \"burgundy dinner jacket.\" Manny was in the fifth grade in Season 1, the ninth grade in Season 5, and attends his first year of college Season 9. Manny and his step-nephew Luke are good friends who each admire the strengths of the other, although they spend a great deal of scheming against/fighting with each other as well.\n\nJoe Pritchett [ edit ]\n\nFictional character\n\nJoe Pritchett First appearance \"Party Crasher\"\n\n4x12, January 16, 2013 Last appearance \"Finale\"\n\n11x17 & 11x18, April 8, 2020 Portrayed by Rebecca and Sierra Mark (uncredited) (season 4)\n\nPierce Wallace (season 5–6)\n\nJeremy Maguire (season 7–11)[25] In-universe information Gender Male Family Jay Pritchett (father)\n\nGloria Delgado-Pritchett (mother)\n\nClaire Dunphy (half-sister)\n\nMitch Pritchett (half-brother)\n\nManny Delgado (half-brother) Relatives Fulgencio Ramírez (grandfather; deceased)\n\nPilar Ramírez (grandmother)\n\nSophia Ramírez (aunt)\n\nDonnie Pritchett (uncle)\n\nBecky Pritchett (aunt)\n\nPhil Dunphy (half-brother-in-law)\n\nCameron Tucker (half-brother-in-law)\n\nHaley Dunphy (half-niece)\n\nAlex Dunphy (half-niece)\n\nLuke Dunphy (half-nephew)\n\nLily Tucker-Pritchett (half-niece)\n\nRexford Tucker-Pritchett (half-nephew)\n\nGeorge Marshall (half-grand-nephew)\n\nPoppy Marshall (half-grand-niece)\n\nDylan Marshall (half-nephew-in-law)\n\nFulgencio Joseph \"Joe\" Pritchett (Jeremy Maguire) is Gloria and Jay's son. Gloria discovered she was pregnant with him in the final episode of season 3, his existence was revealed to the rest of the cast in the first episode of season 4, and he was born in \"Party Crasher.\" Throughout the series, Joe is shown to be a mature, street-smart child, inheriting his wit from his father. Joe's christening took place in \"Fulgencio.\" In the Season 5 episode \"Spring-a-Ding-Fling\" he begins walking. In the episode \"Larry's Wife\" Gloria calls over the priest, believing that there is evil in Joe. The priest does a blessing on Joe but leaves when Joe pick-pocketed the priest's wallet. Gloria returns the wallet and apologizes. Later in the Season 5 episode \"And One to Grow On,\" it is Joe's birthday, and Jay wants to reuse birthday decorations from Manny's birthday party the day before, but Gloria refuses. In the episode \"Queer Eyes, Full Hearts\" Manny's Spanish teacher teaches Joe to swim.\n\nStella [ edit ]\n\nStella (Brigitte) is the French bulldog of the Pritchett family, introduced in \"Good Cop Bad Dog\" (season 2, episode 22). She was the dog of a man named Guillermo (Lin-Manuel Miranda), an inventor, but when Jay convinced him to abandon his idea and return to school, Guillermo gave Stella to the family. Jay wanted to get rid of her but eventually came around. She is very problematic and often destroys things, mostly Gloria's belongings. However, Jay has a great affection for her (letting her sleep in his bed and feeding her from the dinner table), which infuriates Gloria because Jay seems to pay more love and attention to the dog than to her.\n\nThe Tucker-Pritchett family [ edit ]\n\nMitchell Pritchett [ edit ]\n\nFictional character\n\nMitchell Vincent Pritchett First appearance \"Pilot\"\n\n1x01, September 23, 2009 Last appearance \"Finale\"\n\n11x17 & 11x18, April 8, 2020 Portrayed by Jesse Tyler Ferguson In-universe information Gender Male Occupation Lawyer Family Jay Pritchett (father)\n\nDeDe Williams (mother; deceased)\n\nClaire Dunphy (sister)\n\nJoe Pritchett (half-brother)\n\nGloria Delgado-Pritchett (stepmother)\n\nManny Delgado (stepbrother) Spouse Cameron Tucker ​ ( m. 2014) ​ 2014) Children Lily Tucker-Pritchett (daughter)\n\nRexford Tucker-Pritchett (son) Relatives Lucas Williams (grandfather; deceased)\n\nDonnie Pritchett (uncle)\n\nMichael Pritchett (cousin)\n\nBecky Pritchett (aunt)\n\nBeBe Williams (aunt)\n\nCeCe Williams (aunt)\n\nPhil Dunphy (brother-in-law)\n\nHaley Dunphy (niece)Phil Dunphy (brother-in-law)Alex Dunphy (niece)\n\nLuke Dunphy (nephew)\n\nDylan Marshall (nephew-in-law)\n\nGeorge Marshall (great-nephew)\n\nPoppy Marshall (great-niece)\n\nJesse Tyler Ferguson portrays Mitchell Pritchett, Cameron's husband and Lily's father\n\nMitchell Vincent \"Mitch\" Pritchett (Jesse Tyler Ferguson) is Jay's son; Claire's younger brother, Gloria's step-son, Manny's step-brother, Joe's half-brother, Haley, Alex and Luke's uncle; one of Lily's fathers; and partner of 16 years to Cameron.[26] In the season finale of the fifth season, he and Cam get married. He is a low-key, mild-mannered person but has many sensitive qualities. Most times, he is the exact opposite of Cameron, which usually causes disagreements. Cameron acts as a counterbalance to Mitchell's uptight, worrying ways. Because of his mild-mannered, uptight nature, he is sometimes embarrassed by Cameron's flamboyance, but also takes pride in his many talents. He is uncomfortable with public displays of affection, as well as invasion of his personal space. He is an overprotective and cautious father. He is shown to be a capable lawyer, even representing an entire building full of people one-by-one with no prior notice.[27] A recurring theme on the show is Mitchell's relationship with his father, which was strained by the revelation of Mitchell's homosexuality. Mitchell is a musical theater fan and enjoyed ice skating as a kid, though he later admitted that he liked working with his sister as a team more than the ice skating itself. Although he fancies himself as a handyman, everybody is afraid of him around tools. From his degrees hanging in his office, it is apparent that Mitchell attended undergrad at Cornell University and law school at Columbia University.\n\nCritical reception [ edit ]\n\nTV.com has named Mitchell and Cameron one of the \"Five Best TV Dads,\" saying, \"Cam and Mitchell adopted baby Lily from Vietnam way back in Modern Family's pilot episode, and have been inadvertently Americanizing her ever since.\"[28]\n\nAccolades [ edit ]\n\nJesse Tyler Ferguson has been nominated five times for the Primetime Emmy Award for Outstanding Supporting Actor in a Comedy Series.\n\nCameron Tucker [ edit ]\n\nFictional character\n\nCameron Tucker First appearance \"Pilot\"\n\n1x01, September 23, 2009 Last appearance \"Finale\"\n\n11x17 & 11x18, April 8, 2020 Portrayed by Eric Stonestreet In-universe information Gender Male Occupation Clown\n\nChristmas Caroler\n\nMusic teacher\n\nMiddle school music teacher\n\nHistory teacher\n\nHigh School Football Coach & Physical Education Teacher\n\nHigh school vice principal\n\nCollege Football Head Coach Family Merle Tucker (father)\n\nBarbara \"Barb\" Jammy Tucker (mother)\n\nPameron \"Pam\" Jessica Tucker (sister)\n\n2 unnamed biological siblings Spouse Mitchell Pritchett ​ ( m. 2014) ​ 2014) Children Lily Tucker-Pritchett (daughter)\n\nRexford Tucker-Pritchett (son) Relatives Bitsy (grandmother)\n\nBetsy (aunt)\n\nCarl (uncle)\n\nPat (biological aunt)\n\nCalhoun Johnson (nephew)\n\nJay Pritchett (father-in-law)\n\nDeDe Williams (mother-in-law; deceased)\n\nGloria Delgado-Pritchett (stepmother-in-law)\n\nClaire Dunphy (sister-in-law)\n\nJoe Pritchett (half-brother-in-law)\n\nManny Delgado (stepbrother-in-law)\n\nHaley Dunphy (niece by marriage)\n\nAlex Dunphy (niece by marriage)\n\nLuke Dunphy (nephew by marriage)\n\nDylan Marshall (nephew-in-law by marriage)\n\nGeorge Marshall (great-nephew by marriage)\n\nPoppy Marshall (great-niece by marriage) Nationality American\n\nCameron Scott \"Cam\" Tucker (Eric Stonestreet),[29] (February 29, 1972) is Mitchell's husband of eight years, and one of Lily's fathers, who has a huge dramatic personality. He frequently behaves like a drama queen. His bubbly, outgoing personality contrasts with Mitchell's uptight manner, which often causes the two to bicker between themselves.[30] Cameron was born on February 29, 1972, and grew up on a farm in Missouri. He was a starting center for the University of Illinois football team (which he and Jay bond over, much to Mitchell's envy) and is a huge sports fan.[30] Although Cam has gained weight since college and is not as muscular as he used to be, he is still physically quite imposing, partly owing to his height of 6'1\", and capable of scaring off anyone who threatens Mitchell. Cameron also fosters many unusual hobbies such as collecting antique fountain pens, being adept in Japanese flower arrangement, and is a classically trained Auguste clown named Fizbo.[30] Cameron prides himself in shooting home films, not movies, and takes that role very seriously. At the beginning of the series, he acts as a stay-at-home dad to Lily, though it is mentioned that he had taught music before this. In the later seasons, Cameron begins working as a football coach. Cameron is also an experienced rock drummer and, as a result, was brought in at the last minute to play in Dylan's band when they needed a replacement percussionist. Cameron is overly emotional about Lily, their adoptive daughter and doesn't approve of Mitchell's more strict parenting methods, such as letting her cry herself to sleep if she wakes up in the middle of the night.\n\nIt is also mentioned that Cameron was considerably thinner and in better shape when he first started dating Mitchell. For the first few episodes, his relationship with Mitchell was somewhat strained (as they disagreed on almost everything and showed very different parenting techniques). But in more recent episodes, the relationship is much happier.[30] Cameron and Mitchell met at one of Pepper Saltzman's \"legendary\" soirees, where during a game of charades, Cameron immediately knew the answer, \"Casablanca,\" based on a subtle gesture Mitchell made with his hands. Common interests, like art, led them to form a relationship. Mitchell is impressed by Cameron's quirks, such as speaking French (to which Cameron replies, \"un peu,\" meaning \"a little\"). Cameron is also said to be a huge fan of the movie The Wizard of Oz in the episode \"Leap Day\" when Mitchell plans him a surprise birthday party.[26]\n\nDuring season 4, Cameron goes back to work as a music teacher at Luke and Manny's school. In season 5, his music teacher job is eliminated, but he becomes the freshman football coach and physical education teacher. In season 6, he is promoted to varsity coach, and his undefeated record and open homosexuality earned him a story on the local television news.\n\nCritical reception [ edit ]\n\nEric Stonestreet has received positive reviews for his characters. In a review of the first season, Robert Canning of IGN named Cameron Tucker the best character of the season, saying, \"Cameron's many talents and passions revealed over the course of this first year became an ever-building running gag. But it will be hard to top the sheer joy that was 'Fizbo.'\" He also called Fizbo, the episode and the clown, the highlight of the season.[8] The reception of Cameron and Mitchell led to the idea of a spin-off of the two titled Mitchell and Cam, although this ultimately never happened.[31]\n\nAccolades [ edit ]\n\nIn 2010, Eric Stonestreet was nominated for the Television Critics Association Award for Individual Achievement in Comedy.[32] Stonestreet has won the Primetime Emmy Award for Outstanding Supporting Actor in a Comedy Series twice in 2010 and 2012. He was also nominated for the Golden Globe Award for Best Supporting Actor – Series, Miniseries, or Television Film in 2011, 2012, and 2013, along with receiving nominations for the Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Comedy Series in 2011, 2012 and 2013. In 2011, along with Ed O'Neill and Ty Burrell, Stonestreet was nominated for the Critics' Choice Television Award for Best Supporting Actor in a Comedy Series.\n\nLily Tucker-Pritchett [ edit ]\n\nFictional character\n\nLily Tucker-Pritchett First appearance \"Pilot\"\n\n1x01, September 23, 2009 Last appearance \"Finale\"\n\n11x17 & 11x18, April 8, 2020 Portrayed by Jaden and Ella Hiller\n\n(seasons 1 & 2)\n\nAubrey Anderson-Emmons\n\n(seasons 3–11) In-universe information Gender Female Occupation Student Family Mitch Pritchett (father)\n\nCameron Tucker (father)\n\nRexford Tucker-Pritchett (brother) Relatives Jay Francis Pritchett (grandfather)\n\nDeDe Williams (grandmother; deceased)\n\nGloria Maria Ramírez Delgado-Pritchett (step-grandmother)\n\nMerle Tucker (grandfather)\n\nBarbara \"Barb\" Jammy Tucker (grandmother)\n\nJoe Pritchett (half-uncle)\n\nClaire Melinda Pritchett (aunt)\n\nPameron \"Pam\" Jessica Tucker (aunt)\n\nCalhoun Johnson (cousin)\n\nHaley Gwendolyn Dunphy (cousin)\n\nAlexandra \"Alex\" Anastasia Dunphy (cousin)\n\nLucas \"Luke\" Philip Dunphy (cousin)\n\nDylan Marshall (cousin-in-law)\n\nGeorge Marshall (first cousin once removed)\n\nPoppy Marshall (first cousin once removed)\n\nPhilip \"Phil\" Humphrey Dunphy (uncle by marriage)\n\nManuel \"Manny\" Alberto Javier Delgado (step-uncle) Nationality Vietnamese-American\n\nLily Elizabeth Tucker-Pritchett (Jaden and Ella Hiller seasons 1 and 2; Aubrey Anderson-Emmons season 3 onwards) is the daughter of Cameron and Mitchell. She was adopted by her parents and named after the daughter of Charlotte from the HBO series Sex and the City and Cam's pig \"Aunt Lily.\" When she was introduced to the family, they accepted her with open arms. However, Mitchell originally wanted to wait to tell them about her.[27] She is at times doing activities with both of her fathers but remains with Cam at home while Mitchell works.[30] During the show's early seasons, Cameron often dressed her up as famous people, such as Diana Ross, Olivia Newton-John, Madonna and Stevie Wonder to take photographs. Cameron and Mitchell practiced the Ferber method on Lily when she was a baby. Still, Cameron usually couldn't resist catering to her during the night, sometimes even watching movies such as Scarface, which Cam claims she likes possibly because of the bright colors, particularly the club shooting scene.\n\nLily did not speak for the first two seasons and was portrayed by twins Ella Hiller and Jaden Hiller. For season three, the twins \"retired,\" their mother claiming they did not enjoy acting.[33] The role was recast to Aubrey Anderson-Emmons, who is older, and has a speaking role. Since she has been able to speak, Lily has displayed a penchant for intelligent sarcasm and theatricality, which can be attributed to each of her fathers' influences.\n\nLarry [ edit ]\n\nLarry is the pet cat of Lily, Cameron, and Mitchell. They adopt him in \"Bringing Up Baby\" (season 4, episode 1) after Cameron and Mitchell failed to adopt a second child.\n\nOther family members [ edit ]\n\nOverview [ edit ]\n\nDeDe Pritchett [ edit ]\n\nFictional character\n\nDeDe Pritchett First appearance \"The Incident\"\n\n1x04, October 14, 2009 Last appearance \"Good Grief\"\n\n10x05, October 24, 2018 Portrayed by Shelley Long In-universe information Gender Female Family Lucas Williams (father; deceased)\n\nBeBe Williams (sister)\n\nCeCe Williams (sister) Spouse Jay Francis Pritchett ​ ​ ( m. 1968; div. 2003) ​ 1968;2003)\n\nJerry ​ ( m. 2016) ​ 2016) Significant other Chaz\n\nRobbie Sullivan\n\nCarl Children Claire Dunphy (daughter)\n\nMitch Pritchett (son) Relatives Haley Dunphy (granddaughter)\n\nAlex Dunphy (granddaughter)\n\nLuke Dunphy (grandson)\n\nLily Tucker-Pritchett (granddaughter)\n\nRexford Tucker-Pritchett (grandson)\n\nGeorge Marshall (great-grandson)\n\nPoppy Marshall (great-granddaughter)\n\nPhil Dunphy (son-in-law)\n\nCameron Tucker (son-in-law)\n\nDylan Marshall (grandson-in-law)\n\nDeDe Pritchett (Shelley Long) was Claire and Mitchell's mother, Haley, Alex, Luke, Lily, and Rexford's maternal grandmother, Phil and Cam's mother-in-law, and Jay's ex-wife. It implied that she might be mentally ill due to her somewhat manipulative and sometimes aggressive ways. It is implied that she was initially more accepting of Mitchell's sexual orientation than Jay was when he first came out. She often uses her close relationship with Mitchell to get him to do things he does not want to do. Jay wanted to divorce her after a spectacular fight they had while their kids were still in school (he taped over an episode of Dallas to record an NFL game that, ironically, featured the Dallas Cowboys) but was inspired by an animatronic Abraham Lincoln exhibit at Disneyland to stick things out until Claire and Mitchell reached adulthood. She is still bitter over Jay's remarriage to Gloria and even attempted to ruin their wedding, which she convinced Mitchell to talk Jay and Gloria into inviting her to; she got drunk and made rude and inappropriate toasts and eventually had to be dragged out of the reception, in the process ruining the wedding cake. She is very aggressive towards Gloria, often trying to attack her physically. DeDe is also passive-aggressive toward Cameron about his weight and is often critical of Claire, especially her appearance. She also seems to be terrific friends with Manny as they write letters to each other talking about their issues. DeDe is also a famous author and poet. A running gag throughout the series is that DeDe's arrival is always forewarned by bad omens (birds crashing into the window or peaceful scenarios spontaneously turning chaotic).\n\nHer relationship with Gloria becomes more strained in Season 1 when she wants to apologize to her for the wedding fiasco but ends up physically attacking her saying she can't be nice to her. But this relationship improved in the episode \"Arrested.\" of Season 4. When DeDe sees that Gloria is pregnant, she finds it hilarious that Jay's marriage to a much younger trophy wife has forced him to raise a child in his 60s. She found a new sympathy for Gloria, and the two bonded over Jay-bashing when DeDe tells Gloria that she was always the one having to change diapers, clean spit-up, and buy things for the baby. Gloria, in turn, found a new sympathy for DeDe, suggesting that her lack of support from Jay was what caused her to become \"so crazy.\"\n\nIn the season 10 episode, \"Good Grief\", which takes place on Halloween, DeDe dies peacefully in her sleep while on a trip with her women's group.[34]\n\nFrank Dunphy [ edit ]\n\nFictional character\n\nFrank Dunphy First appearance \"Undeck the Halls\"\n\n1x10, December 9, 2009 Last appearance \"Legacy\"\n\n11x11, January 15, 2020 Portrayed by Fred Willard In-universe information Gender Male Spouse Grace Dunphy ( d. 2013)\n\nLorraine Dunphy ​ ( m. 2017) ​ 2017) Children Philip \"Phil\" Humphrey Dunphy (son)\n\nRay (stepson) Relatives Haley Dunphy (granddaughter)\n\nAlex Dunphy (granddaughter)\n\nLuke Dunphy (grandson)\n\nGeorge Marshall (great-grandson)\n\nPoppy Marshall (great-granddaughter)\n\nClaire Dunphy (daughter-in-law)\n\nDylan Marshall (grandson-in-law)\n\nFrancis Allen \"Frank\" Dunphy (Fred Willard) is Phil's father and Haley, Alex and Luke's paternal grandfather. On Christmas, the family shared a webcam chat with him.\n\nFrank returns in \"Travels with Scout\" when he travels cross country without Phil's mother and shows up with a dog that he says she has allergies to. He ends up taking the dog back with him.[35][36] Frank is kind of a polar opposite of Jay's (Claire's father) grumpiness and dry manner, as he is seen being laid back, funny and cool most of the time. Claire mentions this in \"Closet, You'll Love it!\" when most family members refer to Jay as 'Grump-pa' while Frank is referred to as 'Fun-pa.' His attitude is a near carbon copy of Phil's personality. At the end of season 4, it is revealed that Frank's wife (Phil's mother) had died. In season 8, Frank starts dating Lorraine, Phil's childhood babysitter and crush. Later, he proposes to her, and in episode 19, they get married.\n\nIn the episode \"Legacy,\" Phil visits Frank in Florida after hearing some concerning news about him, and then at the end of the episode, Frank dies.\n\nIn 2010, Willard was nominated for the Primetime Emmy Award for Outstanding Guest Actor in a Comedy Series.\n\nJavier Delgado [ edit ]\n\nFictional character\n\nJavier Delgado First appearance \"Up All Night\"\n\n1x11, January 6, 2010 Last appearance \"Dead on a Rival\"\n\n11x12, January 22, 2020 Portrayed by Benjamin Bratt In-universe information Gender Male Spouse Gloria Ramirez ​ ​ ( m. 1995; div. 2006) ​ 1995;2006) Significant other Trish (fiancée) Children Manny Delgado (son) Nationality Colombian\n\nJavier Delgado (Benjamin Bratt) is Manny's biological father and Gloria's ex-husband. He and Gloria were divorced; in the pilot, Gloria says all they did was \"fight and make love,\" at one point leading them to fall out of a window. Manny looks up to him, but Javier always lets him down, while Jay is left downcast by the reminders that Manny has another dad. He is oddly gifted when it comes to betting on horse racing. In the episode \"Flip Flop,\" he has a girlfriend named Trish (Paget Brewster) and almost marries her.\n\nJavier was formerly a Triple-A baseball player and played alongside such baseball greats as Sammy Sosa and Mark McGwire. He has many connections to matadors and baseball players. He and Jay became close, but Javier lets Jay down just as he does Manny.[37]\n\nBarb Tucker [ edit ]\n\nFictional character\n\nBarb Tucker First appearance \"Mother Tucker\"\n\n2x09, November 24, 2010 Portrayed by Celia Weston In-universe information Gender Female Spouse Merle Tucker Children Cameron Tucker (son)\n\nPam Tucker (daughter)\n\n2 other unnamed children Relatives Lily Tucker-Pritchett (granddaughter)\n\nRexford Tucker-Pritchett (grandson)\n\nCalhoun Johnson (grandson)\n\nBarb Tucker (Celia Weston) is Cameron's mother. She first appeared in the episode \"Mother Tucker.\" In that episode, she visits Cameron and Mitchell. While Cameron earnestly declares that his mother is wonderful, Mitchell is less sure because she has a habit of touching Mitchell inappropriately. When Mitchell finally tells Cameron about this, Barb happens to walk in on them and hears his complaints. Later, she apologizes to Mitchell. Unfortunately, she does this while he is in the bathtub. In \"The Wedding,\" she attends her son's wedding to Mitchell and almost ends it with Merle, but Jay and Gloria manage to reconcile the two.\n\nDonnie Pritchett [ edit ]\n\nFictional character\n\nDonnie Pritchett First appearance \"The Musical Man\"\n\n2x19, April 13, 2011 Portrayed by Jonathan Banks In-universe information Gender Male Family Jay Pritchett (brother)\n\nBecky Pritchett (sister) Spouse Irene Pritchett Children Michael Pritchett (son)\n\nPossibly more children Relatives Melanie Pritchett (granddaughter)\n\nPossibly more grandchildren\n\nClaire Dunphy (niece)\n\nMitch Pritchett (nephew)\n\nJoe Pritchett (nephew)\n\nHaley Dunphy (great-niece)\n\nAlex Dunphy (great-niece)\n\nLuke Dunphy (great-nephew)\n\nLily Tucker-Pritchett (great-niece)\n\nRexford Tucker-Pritchett (great-nephew)\n\nPhil Dunphy (nephew-in-law)\n\nCameron Tucker (nephew-in-law)\n\nGloria Delgado-Pritchett (sister-in-law)\n\nManny Delgado (step-nephew)\n\nDylan Marshall (great-nephew-in-law)\n\nDonnie Pritchett (Jonathan Banks) is Jay's brother. He first appeared in the episode \"The Musical Man\" where he visits Jay, and they soon start bickering, and later, Jay finds out he has cancer.\n\nHe attends Luke and Manny's musical, and there he and Jay share an emotional moment.\n\nMerle Tucker [ edit ]\n\nFictional character\n\nMerle Tucker Barry Corbin (right) First appearance \"The Last Walt\"\n\n3x20, April 18, 2012 Portrayed by Barry Corbin In-universe information Gender Male Spouse Barb Tucker Children Cameron Tucker (son)\n\nPam Tucker (daughter)\n\n2 other unnamed children Relatives Lily Tucker-Pritchett (granddaughter)\n\nRexford Tucker-Pritchett (grandson)\n\nCalhoun Johnson (grandson)\n\nMerle Tucker (Barry Corbin) is Cameron's father. He first appeared in the episode \"The Last Walt.\" In that episode, he visits Cameron and Mitchell. Later in the episode, it is revealed that Jay (Mitchell's father) and Merle dislike each other. Cameron and Mitchell each believe that their father is the stronger of the two. It is made known that Merle wishes that the man his son lives with was \"A little bit of a woman.\" Jay and Merle overcome their differences and bond while fixing the bed frame that Cameron had purchased and attempted to put together. In \"The Wedding,\" he attends his son's wedding to Mitchell and almost ends it with Barb, but Jay and Gloria manage to reconcile the two.\n\nPilar Ramirez [ edit ]\n\nFictional character\n\nPilar First appearance \"Fulgencio\"\n\n4x13, January 23, 2013 Portrayed by Elizabeth Peña In-universe information Gender Female Family Umberto Morales (father; deceased)\n\nAna-Maria Rosa de la Immaculada Jimenez Morales (mother; deceased) Spouse Fulgencio Ramirez (deceased) Children Gloria Pritchett (daughter)\n\nSonia Ramirez (daughter)\n\n2 unnamed sons Relatives Manny Delgado (grandson)\n\nJoe Pritchett (grandson)\n\nJay Pritchett (son-in-law)\n\nJavier Delgado (ex-son-in-law)\n\nClaire Dunphy (step-granddaughter)\n\nMitchell Pritchett (step-grandson)\n\nHaley Dunphy (step-great-granddaughter)\n\nDylan Marshall (step-great-grandson-in-law)\n\nPoppy and George (twin step-great-children)\n\nAlex Dunphy (step-great-granddaughter)\n\nLuke Dunphy (step-great-grandson)\n\nLily Tucker-Pritchett (adoptive step-great-granddaughter) Phil Dunphy (step-grandson-in-law)\n\nCameron Tucker-Pritchett (step-grandson-in-law) Nationality Colombian\n\nPilar Ramirez (Elizabeth Peña) is Gloria's mother. She first appeared in the episode \"Fulgencio.\" In that episode, she and her other daughter Sonia visit Jay and Gloria shortly after their son Joe is born. She reveals that she never liked Jay and wants to name Joe after her husband and father (Fulgencio Umberto).\n\nIn \"The Old Man & the Tree,\" she visits her daughter for Christmas and appears to treat Claire more as a daughter than Gloria after taking a liking to Claire.\n\nSonia Ramirez [ edit ]\n\nFictional character\n\nSonia First appearance \"Fulgencio\"\n\n4x13, January 23, 2013 Portrayed by Stephanie Beatriz In-universe information Gender Female Family Fulgencio Ramirez (father; deceased)\n\nPilar Ramirez (mother)\n\nGloria Pritchett (sister)\n\n2 unnamed brothers Relatives Manny Delgado-Pritchett (nephew)\n\nJoe Pritchett (nephew)\n\nJay Pritchett (brother-in-law)\n\nJavier Delgado (ex-brother-in-law)\n\nClaire Dunphy (step-niece)\n\nMitchell Pritchett (step-nephew)\n\nHaley Dunphy (step-great-niece)\n\nDylan Marshall (step-great-nephew-in-law)\n\nPoppy and George (twin step-great-grandchildren)\n\nAlex Dunphy (step-great-niece)\n\nLuke Dunphy (step-great-nephew)\n\nLily Tucker-Pritchett (adoptive step-great-niece) Phil Dunphy (step-nephew-in-law)\n\nCameron Tucker-Pritchett (step-nephew-in-law) Nationality Colombian\n\nSonia Ramirez (Stephanie Beatriz) is Gloria's sister. She first appeared in the episode \"Fulgencio.\" In that episode, she and her mother, Pilar, visit Jay and Gloria shortly after their son Joe is born. She appears to be wanting to get out of Colombia after a flood occurred there. Later, at Joe's christening, she and Gloria get into a fight over how Jay originally liked Sonia, not Gloria.\n\nShe returns in \"Valentine's Day 4: Twisted Sister\", she visits her sister and her family and tries to make a move on Jay because she is still infatuated with him. She then tries to get Gloria out of the picture, and when Jay tells Gloria, she doesn't believe him. Jay goes to his room to apologize to Sonia, and then she tries to make a move on him there, only to be heard via a baby monitor and then Gloria enters and realizes Jay was right and the sisters resume fighting over him.\n\nPam Tucker [ edit ]\n\nFictional character\n\nPam Tucker First appearance \"Farm Strong\"\n\n5x04, October 9, 2013 Portrayed by Dana Powell In-universe information Gender Female Family Merle Tucker (father)\n\nBarb Tucker (mother)\n\nCameron Tucker-Pritchett (brother)\n\n2 unnamed siblings Significant other Bo Johnson (ex-husband/boyfriend) Children Calhoun \"Cal\" Tucker (son) Relatives Pat (aunt)\n\nLily Tucker-Pritchett (niece)\n\nRexford Tucker-Pritchett (nephew)\n\nMitchell Pritchett (brother-in-law)\n\nPameron Jessica \"Pam\" Tucker (Dana Powell) is Cameron's older sister.\n\nIn \"Farm Strong,\" she comes for a visit from the farm, and Mitchell and Cameron are afraid to tell her that they are getting married because they do not want to hurt her feelings about her still being single and because Cameron claims that Pam is compassionate. Lily is the one who finally tells her. Pam seems extremely happy with the news and shares her news with them; she is engaged to Cameron's first crush, Bo Johnson. Cameron gets upset hearing that, and Pam tells him that no one in the family wanted to say to him because he is too sensitive. They were protecting him, something that contradicts Cameron's earlier assertion and makes Cameron even more upset. When the whole family gathers at Jay and Gloria's house, Cameron wants to prove that he is not that sensitive as Pam accuses him and asks everyone to tell him things they were hiding from him because they were trying to protect him. Everyone says their part, and Cameron, as much as he tries not to break down in tears, after hearing Lily admitting that she pretends to fall asleep when he reads to her so he can leave her alone, breaks down in tears and finishes locking himself in the bathroom. Mitchell and Pam comfort him, and Pam tells him that he may have difficulty with bad news, but everyone always wants to share the good news with him because he would still appreciate it.\n\nIn \"The Wedding,\" she has small cameos at Mitchell and Cameron's wedding.\n\nIn \"Frank's wedding,\" she comes to visit and auditions for a modeling job. By the end of the episode, it is revealed that she is looking for jobs to better take care of herself, as she is revealed to be pregnant, which is hidden by her body and weight. She goes into labor at the house and has her baby.\n\nBecky Pritchett [ edit ]\n\nFictional character\n\nBecky Pritchett First appearance \"The Escape\"\n\n9x21, May 9, 2018 Portrayed by Mary Louise Wilson In-universe information Gender Female Family Jay Pritchett (brother)\n\nDonnie Pritchett (brother) Spouse Unnamed husband (deceased) Children Brian (son) Relatives Mitch Pritchett (nephew)\n\nClaire Dunphy (niece)\n\nJoe Pritchett (nephew)\n\nHaley Dunphy (great-niece)\n\nAlex Dunphy (great-niece)\n\nLuke Dunphy (great-niece)\n\nLily Tucker-Pritchett (great-niece)\n\nRexford Tucker-Pritchett (great-nephew)\n\nMichael Pritchett (nephew)\n\nMelanie Pritchett (great-niece)\n\nPhil Dunphy (nephew-in-law)\n\nCameron Tucker (nephew-in-law)\n\nunnamed niece-in-law\n\nGloria Pritchett (sister-in-law)\n\nIrene Pritchett (sister-in-law)\n\nManny Delgado (step-nephew)\n\nBecky Pritchett (Mary Louise Wilson) is the sister of Jay Pritchett.\n\nShe is first mentioned in \"The Kiss\" when Jay tells everyone that his father only kissed him once his entire life. That was when he came up behind Jay, kissed him on the back of the head, and said \"Goodnight, Becky.\", thinking he was his sister.\n\nBecky has a son named Brian, and it is his wedding which Jay, DeDe, Claire, and Mitchell attend in the episode \"Sarge & Pea.\"\n\nBecky makes her first appearance in \"The Escape,\". It is revealed that Becky is a mean woman and kind of a monster. She and Jay have a troubled relationship and haven't spoken in 9 years. Gloria only met Becky once, at her and Jay's wedding. When Claire and Mitchell were kids, they were terrified of her.\n\nBecky is in a nursing home, recovering from a stroke. Jay, Gloria, Mitchell, Cam, Claire, and Phil all pay Becky a visit. They enter her room to find her sleeping with the \"same mean old puss on her face.\" After she awakes to find them there, a doctor comes in and tells the family that the stroke may have scrambled Becky's memories. She doesn't remember Mitchell coming out as gay and she asks Jay if she can borrow his fishing cabin for the coming summer. But this was her cabin. It had belonged to their father who told Jay he was leaving it to him. But instead, he left it to Becky.\n\nClaire sees that Becky is wearing the necklace she loaned her to wear at Jay and Gloria's wedding and never returned. She told Claire she lost it. Now Becky tells them she got the necklace from a prince in Liechtenstein. Claire brings along Becky's favorite tomato soup and heats it up, hoping the smell will jog her memory.\n\nIn the end, Becky reveals that her memory is fine and the doctor who was tending to her is really just a friend named Fred from next door. He once played a doctor on a soap opera and kept the coat. Claire and Mitchell come back in and Claire attempts to fool Becky into returning the necklace by telling her that she just got off the phone with the prince of Liechtenstein who told her he's in financial trouble and needs the necklace back to feed his people. Then Jay reveals to Claire and Mitchell that there was nothing wrong with Becky's memory and she was messing with them. They are furious and Claire demands Becky return the necklace. But she refuses to give it back until Claire fixes the dent she put in Becky's car back in high school. And when Claire doesn't deny it, she keeps the necklace. In the final scene, Claire is waiting in the car when Phil rushes out with the necklace. He had gone back in, gave Becky a hug goodbye, used his sleight-of-hand, and retrieved the necklace on the third try. This made Claire very happy. As they are leaving, they see Becky coming up behind them on her motorized cart, telling them to give her that necklace.\n\nRachel Bay Jones as Farrah Marshall (Dylan's Mother)\n\nOther characters [ edit ]\n\nIntroduced in season 1 [ edit ]\n\nSal [ edit ]\n\nFictional character\n\nSal First appearance \"Great Expectations\"\n\n1x08, November 18, 2009 Last appearance \"Finale\"\n\n11x17 & 11x18, April 8, 2020 Portrayed by Elizabeth Banks In-universe information Gender Female Family Sammy (son) Spouse Tony ​ (divorced) ​ (divorced) Significant other Eddie (boyfriend)\n\nSal (Elizabeth Banks) is Mitch and Cameron's wild, partying, boozy friend from their younger years in the 1990s. In the episode \"Great Expectations,\" she becomes very jealous of the attention Lily had been getting and threatens to kill her multiple times. In the episode \"Best Men,\" she gets married and enlists Cam and Mitch to be the best men at the wedding. However, in the episode, \"The Wedding (Part 1)\" she tells them that she got divorced and she is pregnant. Sal had declared herself the officiator of the wedding while Cam and Mitch tried to intervene about her drinking. In \"The Wedding (Part 2)\", Sal's water breaks in the middle of the (first) ceremony. She convinces her new boyfriend of four months (who believes he is the father) that when a baby comes so early, sometimes it is black.\n\nIt eventually transpires (in \"Fight or Flight\") that Sal's baby is white, and she is raising the baby alone, having presumably split from the man she saw at the time of Mitch and Cameron's wedding. When Mitch, Cam, Pepper, and friends throw her a baby shower, she is seen as far more mature and responsible due to her baby's birth, despite everyone fearing the worst when she disappears in the middle of the party.\n\nVincent \"Shorty\" [ edit ]\n\nFictional character\n\nVincent First appearance \"Fifteen Percent\"\n\n1x13, January 20, 2010 Last appearance \"A Year of Birthdays\"\n\n10x22, May 8, 2019 Portrayed by Chazz Palminteri In-universe information Nickname Shorty Gender Male Spouse Darlene ​ (divorced) ​ (divorced)\n\nVincent \"Shorty\" (Chazz Palminteri) is Jay's best friend. A stylish dresser and dancer, Jay says they were best friends for as long as he can remember. When Mitchell was born premature, Shorty visited Jay in the hospital and stayed for two days. In his honor, Jay gave Mitchell the middle name \"Vincent\".\n\nIn the episode \"Fifteen Percent,\" Mitchell tricks Jay by telling him Shorty is gay. As a result, Jay agrees to cover Shorty's $20,000 debt to a bookie. In the episode \"Treehouse,\" Jay and Gloria are having Shorty and his girlfriend Darlene (Jennifer Tilly) for dinner, and the next day the couples go Salsa dancing together. Shorty is part of Jay's birthday surprise in \"Bringing Up Baby\".\n\nIn \"Three Dinners\", Shorty and Darlene, now married, announce they are moving to Costa Rica. Jay struggles to come to terms with the move and fights with Shorty, but eventually they share an emotional goodbye. Shorty returns in \"Sex, Lies and Kickball\" and says he started a successful fruit juice business, but later confesses to Jay that his wife left him and that the business was a failure. Jay reassures him he'll help him get back on his feet. He performs in Jay's birthday roast in the episode \"A Year of Birthdays\".\n\nIntroduced in season 2 [ edit ]\n\nPepper Saltzman [ edit ]\n\nFictional character\n\nPepper Saltzman First appearance \"Earthquake\"\n\n2x03, October 6, 2010 Last appearance \"We Need to Talk About Lily\"\n\n10x14, January 30, 2019 Portrayed by Nathan Lane In-universe information Gender Male Occupation Wedding planner Family Chaim Saltzman (father)\n\nKyle Saltzman (son) Lionel Saltzman (Adoptive son) Significant other Ronaldo (boyfriend)\n\nSherman \"Pepper\" Saltzman (Nathan Lane) is one of Mitchell and Cameron's friends. Although he was referred to in the pilot episode and several times after that throughout the first season, Pepper first appeared on camera in the second season.\n\nIn \"Earthquake,\" both Mitch and Cam hate going to Pepper's yearly party, and they decide to try and skip it this time. Since an earthquake happened, they say that Mitch has a sprained ankle and that stuff is broken all over the house as an excuse. Though none of their property had damaged the earthquake, Pepper invited himself over to their home to help. Not long after Pepper comes in, he starts to feel bad because Mitch told him that he does not want to go to the parties. After all, he gets jealous because of Pepper and Cam. He helps plan Mitchell and Cam's wedding.\n\nIn \"Boys' Night,\" he hangs out with Mitch, Cam, Longines, Crispin, and Jay on their \"boys' night out.\"\n\nIn \"Fight or Flight,\" he, Mitch, Cam, Ronaldo, and Longines organize a belated baby shower for Sal.\n\nIn \"I Don't Know How She Does It,\" he mentions his first name, Sherman, saying he has not used that name since he left Lubbock, Texas, decades ago.\n\nBethenny [ edit ]\n\nFictional character\n\nBethenny First appearance \"Dance Dance Revelation\"\n\n2x10, December 8, 2010 Last appearance \"Go Bullfrogs!\"\n\n3x06, October 19, 2011 Portrayed by Artemis Pebdani In-universe information Gender Female Occupation Unknown\n\nBethenny (Artemis Pebdani) is a friend of Claire Dunphy's. In \"Dance Dance Revelation,\" she helps Claire, Gloria, and other mothers organize Luke and Manny's middle school dance.\n\nIn \"Go Bullfrogs!\" she is seen along with Holly and her friend at Holly's house when Claire gives Luke his retainer.\n\nIn \"Disneyland,\" it is revealed that she has a nephew, Ethan, whom Claire invites to go to Disneyland with the rest of the family because she wants her daughter Haley to fall for him.\n\nLongines [ edit ]\n\nFictional character\n\nLongines First appearance \"Dance Dance Revelation\"\n\n2x10, December 8, 2010 Last appearance \"The Last Thanksgiving\"\n\n11x07, November 20, 2019 Portrayed by Kevin Daniels In-universe information Gender Male Occupation Cologne Salesman at the Mall\n\nOwner of a Clothing Store\n\nLongines (Kevin Daniels) is a close friend of Mitchell Pritchett and Cameron Tucker's. Although he was first mentioned in the \"Pilot,\" he made his first on-screen appearance in \"Dance Dance Revelation.\" He sprays Phil with cologne on the face, and Phil, who is very upset, grabs the cologne bottle and goes off on Longines with about a dozen good spritzes to the face, even chasing him around the store.\n\nIn \"Boys' Night,\" he hangs out with Mitch, Cam, Pepper, Crispin, and Jay on their \"boys' night out.\"\n\nIn \"Go Bullfrogs!\" he invites Mitch and Cam to a boutique opening, and they go along with Claire, as she needs a fun night out. Mitch and Cam soon leave the place, leaving Claire with a man called Julian. Mitch and Cam believe that Julian is Longines' date, but Longines tells them via Mitch's cellphone that he's not his date, he's his trainer, and he's also straight.\n\nIn \"Snip,\" after Mitch starts thinking that Cam has to search for a new job, Longines says that he has a vacancy at his clothing store and asks Cam if he wants the job. He finally accepts it, but a friend of Longines', Jeoux, calls out Mitch and Longines' devious plan of giving the job to Cam, and he walks out very upset.\n\nIn the two-part episode \"The Wedding,\" he attends Mitch and Cam's wedding.\n\nIn \"Fight or Flight,\" he, Mitch, Cam, Pepper, and Ronaldo organize a belated baby shower for Sal.\n\nCrispin [ edit ]\n\nFictional character\n\nCrispin First appearance \"Boys' Night\"\n\n2x18, March 23, 2011 Last appearance \"Fulgencio\"\n\n4x13, January 23, 2013 Portrayed by Craig Zimmerman In-universe information Gender Male Occupation Unknown\n\nCrispin (Craig Zimmerman) is one of Mitchell and Cameron's friends.\n\nHe has appeared in the episodes Treehouse and Boys' Night. In \"Boy's Night,\" he mentioned he has a thing for older men and was temporarily infatuated with Jay.\n\nIn \"Fulgencio,\" he has a boyfriend, Brett.\n\nWalt Kleezak [ edit ]\n\nFictional character\n\nWalt Kleezak First appearance \"Boys' Night\"\n\n2x18, March 23, 2011 Last appearance \"Election Day\"\n\n3x19 April 11, 2012 Portrayed by Philip Baker Hall In-universe information Gender Male Occupation Retired fireman Spouse Mrs. Kleezak (?-?) Children unnamed daughter\n\nWalt Kleezak (Philip Baker Hall) was Phil and Claire's next-door neighbor. He first appeared in the episode \"Boys' Night,\" where Luke goes over to his house to retrieve their ball, which had flown into his yard. Phil and Claire find out and are not pleased with Luke because they feel that Walt is not very nice. They then go over to his house to interrogate him, and he snaps at them and tells them to keep Luke. The next morning, Luke reprimands Walt for not being nice to his parents and could not hang out. Walt then makes things up by generously giving Claire and Phil onions from his garden and tells them that he used to be a fireman, so he never hurts kids, and becomes friends with the Dunphys through his friendship with Luke.\n\nIn \"Lifetime Supply,\" he comes over to the Dunphy house with Luke to play video games and, upon entering, tells Gloria to win a war some time, and then they (Americans) would start talking like her. He then plays with Luke and beats him due to Phil always staring at Luke. Phil asks Walt if he thinks about death and Walt replies that he's 85 and death is his roommate. He then leaves to change his oxygen tank.\n\nIn \"Election Day,\" he comes to attend Claire's election vote as Phil was given the task of driving 50 senior citizens to the polls to vote for Claire, but only managed to bring Walt. He kept needing things: his glasses, a new oxygen tank, food, and to take his pills. This results in the polls closing, and Phil gets only one extra vote for Claire instead of fifty.\n\nIn \"The Last Walt,\" it was revealed that Walt died from a heart attack. Luke decided he wants to inherit Walt's television which he does. It was also revealed that Walt had a daughter whom he became estranged from, and he had never fixed his estrangement from her.\n\nIntroduced in season 4 [ edit ]\n\nGil Thorpe [ edit ]\n\nFictional character\n\nGil Thorpe First appearance \"Flip Flop\"\n\n4x20, April 10, 2013 Portrayed by Rob Riggle In-universe information Gender Male Occupation Real Estate Agent Family Gunther Thorpe (father)\n\nMrs. Thorpe (mother) Spouse Mrs. Thorpe (divorced) Children unnamed son\n\nunnamed daughter\n\nunnamed child\n\nunnamed child\n\nGil Thorpe (Rob Riggle) is Southern California's most successful real estate agent and nemesis/arch-rival of Phil Dunphy. Phil is often seen on camera lamenting over constantly coming second to Gil in many real estate competitions. He is mentioned indirectly in \"Not in My House\" \"Diamond in the Rough\" and \"Strangers on a Treadmill.\" He appears for the first time in character in the episode \"Flip Flop\" as he attempts to strike a deal for his buyer through Phil on the home renovated by Claire and Cam. He makes his second appearance on the show in the episode \"Career Day,\" where he shows up for Career Day in Luke and Manny's class during Phil's presentation. Seeing Claire's visible frustration at being a housewife, he offers her a position on his real estate team. He is known for his energetic, lively, and harassing personality as well as his tendency to use his name in replacement of words in conversation (e.g., \"Thorpedoed,\" \"Gil Pickles\"). In the episode \"Career Day,\" Gil mentioned he played quarterback at Texas Tech. It is revealed his daughter is a student in Luke and Manny's class. In \"The Feud,\" he returns, beating Phil at a real estate contest, but Luke wrestles against Thorpe's son. Luke ends up losing to Gil's son in the wrestling match.\n\nIn the episode \"Kids These Days,\" Gil was spotted in a gay bar by Phil and Mitchell and reluctantly admitted to being gay to the pair. He also mentions that he and his wife had divorced.\n\nIntroduced in season 5 [ edit ]\n\nAndy Bailey [ edit ]\n\nFictional character\n\nAndy Bailey First appearance \"The Help\"\n\n5x06, October 23, 2013 Last appearance \"The Escape\"\n\n9x21, May 9, 2018 Portrayed by Adam DeVine In-universe information Gender Male Occupation Manny AKA male nanny, assistant Realtor Family Mr. Bailey (father; deceased)\n\nMrs. Bailey (mother) Significant other Beth (ex-fiancée)\n\nHaley Dunphy (ex-Girlfriend)\n\nAndy Bailey[38] (Adam DeVine) is the Pritchetts' nanny for Joe. He is amiable, cordial, slightly naive at times, but still smart and refuses to use any \"bad language.\" Gloria took an immediate liking to Andy upon meeting him. Still, Jay disapproved of his overly friendly nature, saying, \"He's a weird man. He's like Phil; only I have to pay for him.\" He often butts heads with Haley as she is rude and breaks the rules, and she makes fun of him for his overly amiable nature. He talks about his long-time girlfriend who is in the Coast Guard in Utah, but she breaks up with him in \"The Wedding (Part 1)\". Haley discovers that she has been keeping Andy \"on the hook\" for the last seven years as they have been on-again-off-again, and she does not treat Andy the way he treats her. His father died of cancer when he was 14, as explained in \"The Help.\" Haley begins to appreciate Andy's demeanor and treatment of women in \"Other People's Children\" and tries to perhaps start a relationship with him in the two-part episode \"The Wedding.\" However, Alex convinces Haley that she is not that into him. She stops her pursuit as Andy was ready to jump into it. Afterward, Andy drives away, perhaps to his flight to see his ex-girlfriend. Andy also becomes a quick friend to the Dunphy family.\n\nIn the Season 6 episode \"The Cold,\" Andy and Haley discuss their relationship. They agree that they should stay friends. However, Haley gets upset when Andy claims that if they had kissed, she wouldn't get over him. To try to prove him wrong, Haley kisses him. Andy is unaffected by this, but Haley has a smitten look afterward. In the episode \"Queer Eyes, Full Hearts\" Haley helps Andy get a job as Phil's assistant, and Andy helps her prepare for an interview with a fashion designer. During the episode, they seem completely platonic, and it is also revealed that Andy is back together with Beth. In \"Rash Decisions,\" Luke becomes distant from Phil, and Andy becomes his right-hand man. In the episode \"Connection Lost,\" Claire assumes by mistake that Haley and Andy had gotten married. In \"Closet? You'll Love It!\", Andy ends up at the hospital due to appendicitis which had Haley worried enough to visit him but arrived at him a bit too groggy with the drugs the doctors had given him, leading her to tell his sleeping form that he had a shot with her, unbeknownst to Haley that he had heard everything she said.[39] Andy decides to talk to her about her hospital visit in \"Grill, Interrupted\", but Haley's new boyfriend interrupts them before Andy could bring it up. At the end of the episode, Haley mentions to Andy that she wasn't looking for a serious relationship at the moment, which appeared to disappoint him. In the Season 6 finale \"American Skyper,\" Andy reveals to Phil that he already had the engagement ring that he had been saving up for, but is hesitant to propose to Beth because he's still confused about the feelings he has for someone else. Phil advises him to propose to Beth but later finds out that Andy had feelings for Haley, who was also in love with Andy. The episode ends with Phil attempting to tell Andy and Haley that they loved each other but failing to do so, as Andy leaves the house to propose to Beth at a beach he liked. As of \"White Christmas\" in Season 7, Andy and Haley are in a relationship. In season 8, he and Haley broke up because of a long-distance relationship.[40]\n\nRonaldo [ edit ]\n\nFictional character\n\nRonaldo First appearance \"The Help\"\n\n5x06, October 23, 2013 Portrayed by Christian Barillas In-universe information Gender Male Occupation Wedding Planner, Pepper's Assistant Significant other Pepper Saltzman (boyfriend)\n\nRonaldo is Pepper Saltzman's assistant and later boyfriend. He has mentioned he is from Guatemala. However, it is unknown if he was born there.\n\nRhonda [ edit ]\n\nFictional character\n\nRhonda First appearance \"iSpy\"\n\n5x14, February 5, 2014 Portrayed by Arden Belle In-universe information Gender Female Occupation Student\n\nRhonda (Arden Belle) is a friend of Luke and Manny. In \"iSpy,\" she, Luke, Manny, and some other friends of theirs (mostly boys) make a movie about zombies.\n\nIn \"Spring-a-Ding-Fling,\" Luke has a date with Rhonda for the spring dance in their high school. Claire wants to help him score with her, so she helps Rhonda dress more like a girl and be beautiful, as she always wears filthy and manly clothes. Luke is not happy because he preferred her the way she was and asks Claire to \"fix\" her. However, the two are later seen dancing together, so he may like the new Rhonda.\n\nIntroduced in season 6 [ edit ]\n\nEarl Chambers [ edit ]\n\nFictional character\n\nEarl Chambers First appearance \"Won't You Be Our Neighbor\"\n\n6x05, October 22, 2014 Last appearance \"Halloween 4: The Revenge of Rod Skyhook\"\n\n8x05, October 26, 2016 Portrayed by Jon Polito (season 6-season 7)\n\nRobert Costanzo (season 8) In-universe information Gender Male Occupation Owner of closet company Family Mr. Chambers (son)\n\nMrs. Chambers (daughter-n-law) Spouse Mrs. Chambers (wife)\n\nEarl Chambers (Jon Polito and Robert Costanzo) was Jay's former best friend and longtime enemy. Many years before the events of \"Won't You Be Our Neighbor,\" Earl and Jay worked together. They had formed their closet company, Closet-fornia, and the business became successful. One day, Jay came into work, and Earl's desk had been cleared out. He had badmouthed Jay to half their Rolodex, and Jay had to start all over. In the present, it turns out Manny met Earl's granddaughter Sophie in his theater group, and she is now his new girlfriend. This makes Jay mad when he finds out that his rival is her grandfather after showing a new idea of his for work.\n\nGloria organizes a dinner for the two men to work things out, but they soon start disputing again. Earl is also angered to hear that his granddaughter is groping his rival's stepson.\n\nEarl goes to Jay and Gloria's house because he thinks the rivalry between him and Jay is getting way out of control and wants to work it out. Manny then enters and introduces himself; Earl asks if this is \"the stud who's been groping [his] Sophie,\" Manny tries to assure him that there's nothing untoward between Manny and Sophie. Earl laughs and tells Manny he \"believes\" him (maybe, maybe not). Earl sees the box that Jay had shown earlier to Manny, Gloria, and Sophie, and Earl says he thinks he will call it the Sock 'n Roll, takes the box, and leaves. Jay shouts at him, \"The hell you are!\"\n\nEarl reappears in \"The Closet Case\" where Mitchell has been called to work for him in a consultant job. Earl tricks Mitchell into thinking that Earl wants to bury the hatchet with Jay. A van pulls up in front of Jay's house, and Jay sees what has happened. That night, Jay and Mitchell break into Earl's office, and Earl catches them; Mitchell is disgusted at Earl for tricking him. Earl and Jay start fighting again, and later in Jay's car, Mitchell returns his father's old Rolodex to him. This gesture makes Jay very happy; Mitchell snuck it out of Earl's office while he and Jay had their ten-minute fight.\n\nEarl reappears in \"The Cover-Up\" where it turns out that he is leaving horrible comments on Jay's new web show. Jay and Manny track Earl down to his house and, with help from Alex, find out that he's the one doing it. After a brief fight, Earl suggests that he and Jay could make their collective show, to which Jay refuses. Earl decides to make his show instead and deactivates comments – much to Jay's wrath – so Jay won't be able to troll him back.\n\nEarl briefly reappears in \"Halloween 4: The Revenge of Rod Skyhook\" (now played by Robert Costanzo, because Jon Polito died), dressed as the Devil. He fights with Jay, dressed as Jesus, and asks Manny to steal a picture from Earl's mansion. The two start fighting until Jay looks at his reflection in the mirror and gives up on trying to take the picture.\n\nIn \"In Your Head,\" it was revealed that Earl has died and left his ashes, along with a note, for Jay to complete a mind game to locate where he has to spread his ashes.\n\nRonnie LaFontaine [ edit ]\n\nFictional character\n\nRonnie LaFontaine First appearance \"Won't You Be Our Neighbor\"\n\n6x05, October 22, 2014 Portrayed by Steve Zahn In-universe information Gender Male Occupation Medical Marijuana Vendor Spouse Amber LaFontaine (wife) Children Ronnie LaFontaine Jr. (son)\n\nTammy LaFontaine (daughter)\n\nRonnie LaFontaine (Steve Zahn) is a man who moves next door to the Dunphys with his wife, Amber, and their children, Ronnie Jr. and Tammy. He and his wife both turn out to be loud and obnoxious, and the Dunphys dislike them. Their rivalry soon ends in \"Knock 'Em Down\" when they share a mutual dislike of a pornographic statue in their neighborhood, and they soon go out to dinner and discover the Dunphys and the LaFontaines have many things in common, and later that same night, they are drinking wine together in their neighborhood.\n\nAmber LaFontaine [ edit ]\n\nFictional character\n\nAmber LaFontaine First appearance \"Won't You Be Our Neighbor\"\n\n6x05, October 22, 2014 Portrayed by Andrea Anders In-universe information Gender Female Occupation Unknown Spouse Ronnie LaFontaine (husband) Children Ronnie LaFontaine Jr. (son)\n\nTammy LaFontaine (daughter)\n\nAmber LaFontaine (Andrea Anders) is a woman who moves next door to the Dunphys with her husband, Ronnie, and their children, Ronnie Jr. and Tammy. She and her husband both turn out to be loud and obnoxious, and the Dunphys dislike them. Their rivalry went from their first meeting until the episode \"Knock 'Em Down,\" when they share a mutual dislike of a pornographic statue in their neighborhood, and they soon go out to dinner and discover the Dunphys and the LaFontaines have many things in common and later that same night they are drinking wine together in their neighborhood.\n\nRonnie LaFontaine Jr. [ edit ]\n\nFictional character\n\nRonnie LaFontaine Jr. First appearance \"Won't You Be Our Neighbor\"\n\n6x05, October 22, 2014 Portrayed by Finneas O'Connell In-universe information Gender Male Occupation Student Family Ronnie LaFontaine (father)\n\nAmber LaFontaine (mother)\n\nTammy LaFontaine (sister)\n\nRonnie LaFontaine (Finneas O'Connell) is the son of Ronnie and Amber LaFontaine and the brother of Tammy LaFontaine. They move in next door to the Dunphys. He likes to play music, plays the drum kit, and is currently studying in New York.\n\nTammy LaFontaine [ edit ]\n\nFictional character\n\nTammy LaFontaine First appearance \"Won't You Be Our Neighbor\"\n\n6x05, October 22, 2014 Portrayed by Brooke Sorenson In-universe information Gender Female Occupation Student Family Ronnie LaFontaine (father)\n\nAmber LaFontaine (mother)\n\nRonnie LaFontaine Jr. (brother)\n\nTammy LaFontaine (Brooke Sorenson) is the daughter of Ronnie and Amber LaFontaine and the sister of Ronnie LaFontaine Jr. In \"The Big Guns,\" Luke develops a crush on Tammy; however, every time he tries to flirt with her, she insults him and blows him off. At the end of the episode, Luke passes Tammy without even glancing at her and pretends he no longer cares about her, which bothers Tammy enough that she wants him to come back and talk to her, and it turns out Alex gave Luke this advice.\n\nBeth [ edit ]\n\nFictional character\n\nBeth First appearance \"Closet? You'll Love It!\"\n\n6x17, March 4, 2015 Last appearance \"White Christmas\"\n\n7x09, December 9, 2015 Portrayed by Laura Ashley Samuels In-universe information Gender Female Occupation United States Coast Guard Family unnamed mother Significant other Andy Bailey (ex-fiancé)\n\nBeth (Laura Ashley Samuels) is Andy's ex-fiancée. She was first seen in \"Closet? You'll Love It!\" to visit Andy in the hospital. She reappeared in \"American Skyper\" where she seemed to have been responsible for setting Haley's hair on fire and was last seen in \"Summer Lovin,\" where she makes a cameo and she and Andy walk in the park. He proposes to her, and she accepts. Thus, they become engaged and are being watched by Haley and Claire.\n\nShe reappeared in \"The More You Ignore Me,\" where she and Andy meet Haley and Dylan at the movies, and in \"White Christmas,\" she comes to the cabin where the family is with Andy, and she admits to him that she has been cheating on him behind his back and it looks like they end things.\n\nSanjay Patel [ edit ]\n\nFictional character\n\nSanjay Patel First appearance \"Patriot Games\"\n\n6x17, May 6, 2015 Portrayed by Suraj Partha In-universe information Gender Male Occupation Student Family Vish Patel (father)\n\nNina Patel (mother) Significant other Alex Dunphy (ex-girlfriend)\n\nSanjay Patel (Suraj Partha) is Alex's former academic rival and ex-boyfriend. While they had still been at school, Alex and Sanjay had been competing against each other nonstop. Sanjay had only been mentioned in \"Our Children, Ourselves,\" \"See You Next Fall,\" \"Career Day,\" \"Under Pressure,\" \"Sleeper,\" and \"Integrity.\" He eventually made his first appearance in \"Patriot Games,\" where he and Alex were tied in the first position for valedictorian and only didn't have gym grades completed. Principal Brown organized a race for the two, and the one who did fours laps first wins. Sanjay goes to Alex's house and tells her that he likes her and that she is the reason he can attend Stanford University because she was always pushing him to study more and become better. But when the race happens, Sanjay forfeits it to prove to Alex that he was telling the truth and the two of them end up in a passionate kiss in front of their parents, much to their delight except Sanjay's mother, Nina. Sanjay and Alex are eventually named co-valedictorians of 2015.\n\nSanjay reappears in \"Summer Lovin',\" and he and Alex are now dating. They go up to Alex's room after he asks her to test him on the periodic table, and later, they would break up when Sanjay leaves for school, but in the end, they decide against it. However, in \"The Closet Case,\" Alex reveals that Sanjay broke up with her because he sees someone new.\n\nIntroduced in season 7 [ edit ]\n\nErica [ edit ]\n\nFictional character\n\nErica First appearance \"Summer Lovin\"\n\n6x17, September 23, 2015 Portrayed by Vicki Lewis In-universe information Gender Female Occupation Preschool teacher\n\nErica is a teacher who works at The Learnin' Barn.\n\nShe is Tommy and Joe's teacher and is known to be a hippie. Jay is not very fond of her at first, but Gloria convinces him to let Joe stay at The Learnin' Barn.\n\nJay also points out that he doesn't like the name of the school, although Gloria does. Erica and Jay don't get along very well, but since Erica is a hippie, she is thrilled to pretend she likes him.\n\nJay tells the Feelings Table that he wants to break the table over \"a hippie\" (referring to Erica.) as she was annoying him with his happiness.\n\nIntroduced in season 8 [ edit ]\n\nRainer Shine [ edit ]\n\nFictional character\n\nRainer Shine First appearance \"Weathering Heights\"\n\n8x04, October 12, 2016 Portrayed by Nathan Fillion In-universe information Gender Male Occupation Weatherman Family April Shine (daughter) Significant other Haley Dunphy (ex-girlfriend)\n\nRainer Shine is a weatherman that Phil and Haley meet in \"Weathering Heights.\" Phil tries to make friends with Rainer but accidentally invites him to ask Haley out on a date that ends in Rainer and Haley dating, much to Phil's displeasure.\n\nIn \"Five Minutes,\" Rainer proposes to Haley. She accepts, but the engagement lasts less than five minutes since they both start having doubts after Rainer realizes that he was wrong about that night's weather forecast.\n\nIntroduced in season 9 [ edit ]\n\nArvin Fennerman [ edit ]\n\nFictional character\n\nDr. Arvin Fennerman First appearance \"In Your Head\"\n\n9x13, January 17, 2018 Last appearance \"Baby Steps\"\n\n11x15, March 18, 2020 Portrayed by Chris Geere In-universe information Gender Male Occupation Astrophysics professor at Caltech Family Malcolm Fennerman (father)\n\nIris Fennerman (mother) Significant other Haley Dunphy (ex-girlfriend)\n\nDr. Arvin Fennerman (Chris Geere) is a teacher at Alex's school, The California Institute of Technology a.k.a. Caltech. Arvin first appears in \"In Your Head\" when Haley sneaks into Alex's class to get her to read over her writing sample before she goes to an interview at Nerp. Haley ends up interrupting the class before Alex rushes her out. Arvin later finds both of them in the schoolyard and tells Haley that the two of them will get married one day, that he doesn't understand it, but he just knows because of all the probability scenes he's been running in his head end up with the two of them marrying. Haley later uses a similar speech to get the job she's applying for and later accepts his contact request. It's unclear whether Arvin believes this or if it's just a clever pick-up line.\n\nArvin is a two-time Vanderscoff Grant winner, one for philosophy and one for geometry.\n\nHe and Haley begin dating but break up in \"Torn Between Two Lovers\" when Haley decides to get back together with Dylan. Eventually, Arvin begins dating Alex, when the two of them begin working together in the series finale.\n\nBill [ edit ]\n\nFictional character\n\nBill First appearance \"Royal Visit\"\n\n9x17, March 28, 2018 Last appearance \"The Last Hallowee", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/NathanLane2018_%28cropped%29.jpg/220px-NathanLane2018_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Ariel_Winter_PaleyFest_2015_%2816859744400%29.jpg/170px-Ariel_Winter_PaleyFest_2015_%2816859744400%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Modern_Family_Cast.jpg/1200px-Modern_Family_Cast.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Peg_Phillips_and_Barry_Cobin.jpg/220px-Peg_Phillips_and_Barry_Cobin.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Zahn%2C_Steve_%282008%29.jpg/220px-Zahn%2C_Steve_%282008%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/FredWillardApr2011.jpg/220px-FredWillardApr2011.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Ty_Burrell_2014.jpg/170px-Ty_Burrell_2014.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Sof%C3%ADa_Vergara_at_2015_PaleyFest.jpg/170px-Sof%C3%ADa_Vergara_at_2015_PaleyFest.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/Benjamin_Bratt_-_parade_Grand_Master.jpg/220px-Benjamin_Bratt_-_parade_Grand_Master.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Sarah_Hyland_at_2015_PaleyFest.jpg/170px-Sarah_Hyland_at_2015_PaleyFest.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/Nathan_Fillion_by_Gage_Skidmore_3.jpg/220px-Nathan_Fillion_by_Gage_Skidmore_3.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Jonathan_Banks_2012_2.jpg/220px-Jonathan_Banks_2012_2.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Adam_Devine_2013_%28cropped%29.jpg/220px-Adam_Devine_2013_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Modern_Family_Cast.jpg/300px-Modern_Family_Cast.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Nolan_Gould_at_2015_PaleyFest.jpg/170px-Nolan_Gould_at_2015_PaleyFest.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Eric_Stonestreet_at_2015_PaleyFest.jpg/170px-Eric_Stonestreet_at_2015_PaleyFest.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/Philip_Baker_Hall_at_the_2009_Tribeca_Film_Festival.jpg/220px-Philip_Baker_Hall_at_the_2009_Tribeca_Film_Festival.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Rico_Rodriguez_at_2015_PaleyFest.jpg/170px-Rico_Rodriguez_at_2015_PaleyFest.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Actor_Stephanie_Beatriz.jpg/220px-Actor_Stephanie_Beatriz.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/Elizabeth_Banks_by_Gage_Skidmore.jpg/220px-Elizabeth_Banks_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/Kevin_Daniels_2015.jpg/220px-Kevin_Daniels_2015.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/Ed_O%27Neill_at_2015_PaleyFest.jpg/170px-Ed_O%27Neill_at_2015_PaleyFest.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Julie_Bowen_PaleyFest_2015_%2817045838362%29.jpg/170px-Julie_Bowen_PaleyFest_2015_%2817045838362%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Garden_State_GreenFest%2C_Union%2C_NJ_3-15-14_%2813179555463%29_%28cropped%29.jpg/220px-Garden_State_GreenFest%2C_Union%2C_NJ_3-15-14_%2813179555463%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Jesse_Tyler_Fergeuson_Muppets_Most_Wanted_Premiere_%28cropped%29.jpg/170px-Jesse_Tyler_Fergeuson_Muppets_Most_Wanted_Premiere_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Actress%2C_Elizabeth_Pena_at_the_2009_East_Classic_Theater_Fundraiser.jpg/220px-Actress%2C_Elizabeth_Pena_at_the_2009_East_Classic_Theater_Fundraiser.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Chazz_Palminteri_2011_Shankbone.JPG/220px-Chazz_Palminteri_2011_Shankbone.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Rob_Riggle_SDCC_2014.jpg/220px-Rob_Riggle_SDCC_2014.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Modern_Family_Cast.jpg/1200px-Modern_Family_Cast.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_Modern_Family_characters", "title": "List of Modern Family characters", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Modern_Family_Cast.jpg/640px-Modern_Family_Cast.jpg", "width": 640, "height": 365}, "title": "List of Modern Family characters - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}