{"url": "https://web.archive.org/web/20140717051706/http://www.trashtalktv.com/04/08/married-to-medicine-recap-bowling-alley-blues/310925/", "text": "Last season, Dr. Jackie was a mature woman who survived cancer and sought to be a role model for African-American women. Dr. Simone was a doctor who liked to drink, hated exercise and loved her family. Mariah and her Black-adeshi family were at the center of most fights and Quad tried to avoid having sex with her nerdy husband. Oh, and Toya made Kelly Bundy look like a Pulitzer prize winner. Kari was there but she’s undergoing a very personal struggle with her lips and couldn’t be a part of this season.\n\nQuad is back and looking semi-clownish. Her hair is orange, her lips are red and her eyeshadow looks like something out of Face Maker circa 1983. It could be the fact that I’m watching this on a 13 inch TV but all of this color is making my soul hurt. Anyway, she’s shopping at her friend’s store and he brings up the pressure for her to have a child. Okay, is this scene even in English? Quad and Reco sound like the result of James Brown possessing their bodies – if he was resurrected as a gay Southern man. I think the moral of the story is that Quad doesn’t want to have babies yet but let’s get down to the real story. Reco asked Mariah to pose for his magazine but she said she was busy. He told her he wanted to use Quad but Mariah felt it wasn’t right to use someone else in her circle. Quad cries because her BFF is a selfish moron. I can’t believe she was really crying over this so I choose to believe that there’s more to this story. Maybe Mariah tried to show a family vacation slideshow on Quad’s forehead. I don’t know.\n\nDr. Jackie and Dr. Simone meet and discuss fun facts. For instance, some women forget to remove their IUD for decades and it’s up to these brave souls to remove it. That was just the appetizer for the really fun stuff. Dr. Jackie talks about her husband’s regret over not having a son. The first year of her marriage was when she went through her first bout with cancer. She also had a miscarriage so she wants to discuss using donor eggs with his sperm so he can have a child. Dr. Simone warns her not to do it because she’s busy and she’ll have to give stuff up in order to have a child. The conversation ends abruptly when Dr. Simone has to take off to push the eject button on a patient’s uterus.\n\nMariah ruins her daughter’s self-esteem during a family photo shoot when she tells her that she doesn’t know how to give face and takes her place in the family photo. I see a Lauren Manzo in the making. I don’t know what the Black-adeshi equivalent of provolone and egg salad is but order up a 30 year supply. Stat. Mariah’s family, including her infamous mother, is there for dinner and Mariah asks her nephew Ian about being bullied at school. Mariah’s advice to him is to beat up the girl who’s been hitting him. More specifically, “hit it and quit it!” First of all, the girl probably likes him and secondly, has Mariah not heard of school shootings and suicide? Kids are over the top these days. The last thing they need is permission to act out on whatever impulse they have. Third, “hit it and quit it” definitely refers to sex. Perhaps she wants him to continue the reality tradition and be a star on MTV’s Teen Dad: Reality Offspring. Then again this is Mariah. She’d probably love for the kid to have a full meltdown so he can’t overshadow her own kids.\n\nMariah says that she and Quad don’t speak anymore and her sister says that Mariah created Quad. Actually, Suzuki invented quads. Mariah says that Rico Chapple, the dress shop man, got in Quad’s ear about Mariah being jealous of her. Mariah’s mother must’ve read her hate mail last season because she’s dressed like she’s going to an inauguration and she’s got a Hilary Clinton weave. Mariah’s mom is disappointed in Quad so you know what that means. Quad’s getting a beat down with a purse.\n\nDr. Simone gets home late from work. She missed her kid’s game because a patient was in labor. Her husband, Cecil, was able to cover parental duties. She feels like she’s trying to juggle lots of balls and based on her husband’s facial expression, there’s definitely a couple of blue balls in the house. Dr. Simone switched to a new billing system and she was prepared for a 3 month pay delay but not the 6 month one that she’s going through. I love a doctor who can admit she’s broke right now and can call herself a bitch in a loving way. I should have gone to medical school. I’m always calling myself names and avoiding calls from collections.\n\nQuad is making breakfast for her husband, Greg. He’s surprised and she makes the point that she can do this now that she doesn’t work. She’s brilliant! Quit work, do one menial task and justify leeching for as long as possible. Momma Joyce from RHOA would be relieved to know that Kandi’s not the only ‘victim’. I love that she greets her husband politely but says good morning to her dogs like they got a medical degree and give her an eyeshadow allowance. Plus, her husband speaks in a higher pitch than her dogs bark and he doesn’t need to be walked. He might need to be neutered though. She would give him sexy time but he farts in his sleep. I don’t know why we need to hear about this but it makes me understand my perpetual loneliness. Dr. Gregory brings up the baby subject and fails to get her in the mood by basically saying that she’s old. He tells her that she’s on the back-end of thirty and she needs to get started. She laughs it off, says she’s just starting her thirties and secretly pours laxative into his pancake batter.\n\nToya is a stay at home mom. Bravo basically spends 12 seconds catching up on her life of barely taking care of her kids and then has her go over to her dentist and friend’s house. Dr. Heavenly says that Toya isn’t the sharpest knife in the drawer but she likes her spirit…and role on a TV show. Dr. Heavenly is having a soiree for Atlanta’s medial elite and hopes that everyone is on their best behavior. She questions the behavior of Drs. Jackie and Simone at Toya’s sickle cell event. Dr. Jackie offended a plus-sized pageant winner and Dr. Simone was dancing on Toya’s husband. It sounds to me like the two of them went to reality TV school over the hiatus.\n\nDr. Simone borrows a purse from Dr. Jackie for the party and says she’s putting nothing in it. Andy Cohen, please cut this lady a check.", "images": ["https://web.archive.org/web/20140717051706im_/http://www.trashtalktv.com/wp-content/plugins/social-media-widget/images/cutout/64/twitter.png", "https://web.archive.org/web/20140717051706im_/http://www.trashtalktv.com/wp-content/plugins/social-media-widget/images/cutout/64/tumblr.png", "https://web.archive.org/web/20140717051706im_/http://1.gravatar.com/avatar/d3df8c21e87084ceebc0fb94279e5f5c?s=32&d=http%3A%2F%2F1.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D32&r=R", "https://web.archive.org/web/20140717051706im_/http://www.trashtalktv.com/wp-content/plugins/social-media-widget/images/cutout/64/instagram.png", "https://web.archive.org/web/20140717051706im_/http://www.trashtalktv.com/wp-includes/images/rss.png", "https://web.archive.org/web/20140717051706im_/http://0.gravatar.com/avatar/a6ddc3752d94c7e720634e4c951d6ad1?s=32&d=http%3A%2F%2F0.gravatar.com%2Favatar%2Fad516503a11cd5ca435acc9bb6523536%3Fs%3D32&r=R", "https://web.archive.org/web/20140717051706im_/http://www.trashtalktv.com/wp-content/plugins/social-media-widget/images/cutout/64/googleplus.png", "https://web.archive.org/web/20140717051706im_/http://www.trashtalktv.com/wp-content/uploads/2013/06/trashtalktv-multi-color-logo.gif", "https://web.archive.org/web/20140717051706im_/http://www.trashtalktv.com/wp-content/uploads/2014/02/trash-talk-tv-header.jpg", "https://web.archive.org/web/20140717051706im_/http://www.trashtalktv.com/wp-content/plugins/social-media-widget/images/cutout/64/youtube.png", "https://web.archive.org/web/20140717051706im_/http://ad.linksynergy.com/fs-bin/show?id=vicO2UqtTxw&bids=337034.328&subid=0&type=4&gridnum=13", "https://web.archive.org/web/20140717051706im_/http://www.trashtalktv.com/wp-content/plugins/social-media-widget/images/cutout/64/facebook.png", "https://web.archive.org/web/20140717051706im_/http://www.trashtalktv.com/wp-content/uploads/2014/06/favicon.ico"], "top_img": "https://web.archive.org/web/20140717051706im_/http://www.trashtalktv.com/wp-content/uploads/2014/06/favicon.ico", "keywords": [], "authors": ["Byl Boogie"], "canonical_link": "https://web.archive.org/web/20140717051706/http://www.trashtalktv.com/04/08/married-to-medicine-recap-bowling-alley-blues/310925/", "title": "Married to Medicine Recap: Bowling Alley Blues", "meta_data": {"google-site-verification": "TOUe46FnJJSy-tLXiwGSmR1q-e6a0s2s5ASA-QpSoc8", "twitter": {"card": "summary_large_image", "site": "@trashtweettv", "title": "Married to Medicine Recap: Bowling Alley Blues", "description": "Last season, Dr. Jackie was a mature woman who survived cancer and sought to be a role model for African-American women. Dr. Simone was a doctor who liked", "url": "http://www.trashtalktv.com/04/08/married-to-medicine-recap-bowling-alley-blues/310925/", "image": {"src": "https://web.archive.org/web/20140717051706im_/http://i1.wp.com/www.trashtalktv.com/wp-content/uploads/2014/04/Big-Married-to-Medicine-04.06.2014-Dr-Jackie-and-Simone.png?resize=655%2C509"}, "domain": "TrashTalkTV"}, "description": "Mariah ruins children like Jackie ruins plus sized dreams", "keywords": "gossip, spoilers, best recap, reality tv, funny, tvgasm,andy cohen,atlanta,black-adeshi,bravo,cancer,dentist,dr. heavenly,dr. jackie,dr. simone,funny,infertility,iud,mariah huq,married for money,married to medicine,quad webb-lunceford,reality tv,recap,reproduction,stay at home mom,toya,uterus,wives,tv recaps, news and trash talk", "msvalidate.01": "B8C34D4F3F26394E13DFA248C1649C44", "p": {"domain_verify": "dff99127c79c24d59bc6b3440608d5fe"}}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}