{"url": "https://www.billboard.com/articles/columns/pop/7981924/nick-lachey-vanessa-minnillo-romance-trl-whats-left-of-me-video", "text": "Nick Lachey‘s band 98 Degrees were frequent TRL visitors during the Carson Daly era, but by the time he went solo with his first album, SoulO, Vanessa Minnillo had signed on as one of the show’s VJs in 2003. Back then, Lachey was happily married to Jessica Simpson, and would stop by TRL in support of both his music and his reality show with Simpson, Newlyweds: Nick and Jessica.\n\nExplore Explore Nick Lachey See latest videos, charts and news See latest videos, charts and news\n\nWith Lachey happily married and Minnillo in a long-term relationship, the two remained super cordial whenever they’d run into each other, whether it was on TRL or some other mutual engagement. “It was always about business and it was always nice to see him,” Minnillo (now Vanessa Lachey) tells Billboard.\n\nBut right around the same time that Lachey’s marriage ended in 2006, he recruited Minnillo for the video for the titular single from his sophomore solo effort, What’s Left of Me — and with Minnillo also recently single, their typically cordial involvement began to feel a little more than just friendly. In fact, their chemistry was so undeniable, Minnillo couldn’t even face Lachey when he came through TRL to promote the video that she starred in.\n\nAnyone who tuned in to TRL the day Lachey was on for “What’s Left Of Me” may have noticed that Minnillo was nowhere to be found. But what viewers also may have noticed was that Lachey was clearly onto her, as he picked a girl from the crowd outside holding a sign reading “Move Over Vanessa” to come into the studio.\n\nAlthough Lachey and Minnillo — who married in July 2011 and now have three kids together — weren’t face-to-face that day, it was a pivotal moment in their relationship that took things from friendly to romantic. In celebration of TRL‘s reboot premiering on MTV this week, Billboard chatted with both of the Lacheys to get the full rundown of that fateful day (with a guest appearance from LaLa Anthony, who filled in for Minnillo on that episode). Check out their recount below.\n\nNick: I wouldn’t necessarily say TRL brought us together, but that was definitely part of our time together — me being a musician and her being on-air talent. I saw her multiple times throughout the years when she was on TRL.\n\nVanessa: It wasn’t until, coincidentally, I broke up with my longtime boyfriend and he was getting divorced that we ended up reconnecting. He did a solo album and he asked me to do the video for “What’s Left of Me.” And he’ll joke, “In my grand marketing scheme I thought if I get the girl who is on TRL to do my video, she’ll play it on the show.” Little did he know I had no pull! My joke is I never got paid to do the video. And of course he’s still paying to this day, if you ask him.\n\nBut the video, which was on TRL, was the beginning of our relationship. That’s what made it no longer friends and it got romantic. To the point that if you go back and look at the video, when he came to premiere it, I was so nervous and so crushing him that I didn’t show up for work that day. I called in sick.\n\nNick: [Laughs.] We’d started kind of talking, and I got to the studio fully expecting to be interviewed by her. Probably a little psyched to think I’d be interviewed by her — and instead it was Lala [Anthony]. Not that I have anything against Lala, but I was like, “Oh, where’s Vanessa?” And they were like, “Oh, she called in sick?” And I was like, “Ah…here we go.”\n\nVanessa: We’d gone from friends to [me] starting to feel something for him. So, like a child, I ran from it and called in sick. Lala was like, “Girl, you in love. I’ll fill in for you today but you better come back to work!”\n\nAnthony: I remember that day like it was yesterday. We were so excited for her because she was in that video and she looked beautiful. I was off that day and they were like, “She’s not coming in today. You need to come in.” Come in for what? I’m not in the video! They’re like, “She’s not feeling well.” I’d do anything for her. I knew she liked him.\n\nVanessa: [Nick] was actually offended. He went to the window to pick a fan to come up and this girl had a sign that said “Move Over Vanessa, I’m here.” He said, “Bring her up!”\n\nNick: I just wanted to be like, “How dare you call in sick the day I come on?” So I decided to have a little fun with her, rub it in her nose a little bit — I knew she’d be watching.\n\nVanessa: I told him later I didn’t know what to do. I didn’t know how to confront you. I didn’t know what to say.\n\nNick: But she was like, “I can’t believe you did that.” And I was like, “I can’t believe you didn’t come to work today!” You never know how it’s going to play out, but I thought I’d at least get my shot in there.\n\nAdditional reporting from Mickey Rapkin.", "images": ["https://www.billboard.com/wp-content/uploads/media/Vanessa-Minnillo-Nick-Lachey-billboard-1548.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.billboard.com/wp-content/uploads/media/Vanessa-Minnillo-Nick-Lachey-billboard-1548.jpg?w=942&h=623&crop=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204652553202666&ev=PageView&noscript=1", "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/public/lazyload-fallback.gif"], "top_img": "https://www.billboard.com/wp-content/uploads/media/Vanessa-Minnillo-Nick-Lachey-billboard-1548.jpg?w=1024", "keywords": [], "authors": ["Taylor Weatherby"], "canonical_link": "https://www.billboard.com/music/pop/nick-lachey-vanessa-minnillo-romance-trl-whats-left-of-me-video-7981924/", "title": "He Said, She Said: Nick & Vanessa Lachey Recount the Day ‘TRL’ Helped Turn Their Friendship Into Romance", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/icons/icon-144x144.png", "msapplication-TileColor": "#eff4ff", "description": "Although Lachey and Minnillo -- who married in July 2011 and now have three kids together -- weren't face-to-face that day, it was a pivotal moment in their relationship that took things from friendly to romantic.", "news_keywords": "Vanessa Lachey", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "billboard", "pmc-page_type": "article", "articleid": 7981924, "author": "Taylor Weatherby", "pmc-category": "Music,Pop", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-10-06T17:24:10"}, "pmc-tag": "Vanessa Lachey", "title": "He Said, She Said: Nick & Vanessa Lachey Recount the Day ‘TRL’ Helped Turn Their Friendship Into Romance", "pageclass": "article", "pmc-is_free": "no", "pmc-always-paywall": "no", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-exclusive": "no", "pmc-breaking-news": "no", "pmc-prime": "no"}, "generator": "WordPress 6.0.2", "author": "Taylor Weatherby", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Billboard", "application-name": "Billboard", "content_type": "Article", "post_id": 7981924, "title": "He Said, She Said: Nick & Vanessa Lachey Recount the Day 'TRL' Helped Turn Their Friendship Into Romance", "published_at": "2017-10-06 17:24:10", "image": "https://www.billboard.com/wp-content/uploads/media/Vanessa-Minnillo-Nick-Lachey-billboard-1548.jpg?w=1024", "comment_count": 0, "tags": "Vanessa Lachey", "topics": "Pop", "body": "Nick Lachey's band 98 Degrees were frequent TRL visitors during the Carson Daly era, but by the time he went solo with his first album, SoulO, Vanessa Minnillo had signed on as one of the show's VJs in 2003. Back then, Lachey was happily married to Jessica Simpson, and would stop by TRL in support of both his music and his reality show with Simpson, Newlyweds: Nick and Jessica. With Lachey happily married and Minnillo in a long-term relationship, the two remained super cordial whenever they'd run into each other, whether it was on TRL or some other mutual engagement. \"It was always about business and it was always nice to see him,\" Minnillo (now Vanessa Lachey) tells Billboard.But right around the same time that Lachey's marriage ended in 2006, he recruited Minnillo for the video for the titular single from his sophomore solo effort, What's Left of Me -- and with Minnillo also recently single, their typically cordial involvement began to feel a little more than just friendly. In fact, their chemistry was so undeniable, Minnillo couldn't even face Lachey when he came through TRL to promote the video that she starred in.Anyone who tuned in to TRL the day Lachey was on for \"What's Left Of Me\" may have noticed that Minnillo was nowhere to be found. But what viewers also may have noticed was that Lachey was clearly onto her, as he picked a girl from the crowd outside holding a sign reading \"Move Over Vanessa\" to come into the studio.Although Lachey and Minnillo -- who married in July 2011 and now have three kids together -- weren't face-to-face that day, it was a pivotal moment in their relationship that took things from friendly to romantic. In celebration of TRL's reboot premiering on MTV this week, Billboard chatted with both of the Lacheys to get the full rundown of that fateful day (with a guest appearance from LaLa Anthony, who filled in for Minnillo on that episode). Check out their recount below.Nick: I wouldn’t necessarily say TRL brought us together, but that was definitely part of our time together -- me being a musician and her being on-air talent. I saw her multiple times throughout the years when she was on TRL.Vanessa: It wasn’t until, coincidentally, I broke up with my longtime boyfriend and he was getting divorced that we ended up reconnecting. He did a solo album and he asked me to do the video for “What’s Left of Me.” And he’ll joke, “In my grand marketing scheme I thought if I get the girl who is on TRL to do my video, she’ll play it on the show.\" Little did he know I had no pull! My joke is I never got paid to do the video. And of course he’s still paying to this day, if you ask him. But the video, which was on TRL, was the beginning of our relationship. That’s what made it no longer friends and it got romantic. To the point that if you go back and look at the video, when he came to premiere it, I was so nervous and so crushing him that I didn’t show up for work that day. I called in sick.Nick: [Laughs.] We'd started kind of talking, and I got to the studio fully expecting to be interviewed by her. Probably a little psyched to think I’d be interviewed by her -- and instead it was Lala [Anthony]. Not that I have anything against Lala, but I was like, “Oh, where’s Vanessa?” And they were like, “Oh, she called in sick?” And I was like, “Ah…here we go.” Vanessa: We’d gone from friends to [me] starting to feel something for him. So, like a child, I ran from it and called in sick. Lala was like, \"Girl, you in love. I’ll fill in for you today but you better come back to work!\"Anthony: I remember that day like it was yesterday. We were so excited for her because she was in that video and she looked beautiful. I was off that day and they were like, \"She's not coming in today. You need to come in.\" Come in for what? I'm not in the video! They're like, \"She's not feeling well.\" I'd do anything for her. I knew she liked him.Vanessa: [Nick] was actually offended. He went to the window to pick a fan to come up and this girl had a sign that said \"Move Over Vanessa, I’m here.\" He said, \"Bring her up!\"Nick: I just wanted to be like, “How dare you call in sick the day I come on?” So I decided to have a little fun with her, rub it in her nose a little bit -- I knew she’d be watching.Vanessa: I told him later I didn’t know what to do. I didn’t know how to confront you. I didn’t know what to say.Nick: But she was like, “I can’t believe you did that.” And I was like, “I can’t believe you didn’t come to work today!” You never know how it’s going to play out, but I thought I’d at least get my shot in there.Additional reporting from Mickey Rapkin.", "fb": {"pages": 75791669580}, "fragment": "!", "og": {"type": "article", "title": "He Said, She Said: Nick & Vanessa Lachey Recount the Day ‘TRL’ Helped Turn Their Friendship Into Romance", "url": "https://www.billboard.com/music/pop/nick-lachey-vanessa-minnillo-romance-trl-whats-left-of-me-video-7981924/", "description": "Although Lachey and Minnillo — who married in July 2011 and now have three kids together — weren’t face-to-face that day, it was a pivotal moment in their relationship that took t…", "site_name": "Billboard", "image": {"identifier": "https://www.billboard.com/wp-content/uploads/media/Vanessa-Minnillo-Nick-Lachey-billboard-1548.jpg?w=1024", "width": 1024, "height": 677, "alt": "Vanessa Minnillo, Nick Lachey"}, "locale": "en_US"}, "article": {"published_time": "2017-10-06T21:24:10+00:00", "modified_time": "2017-10-06T21:24:10+00:00"}, "twitter": {"site": "@billboard", "card": "summary_large_image", "title": "He Said, She Said: Nick & Vanessa Lachey Recount the Day ‘TRL’ Helped Turn Their Friendship Into Romance", "description": "Although Lachey and Minnillo -- who married in July 2011 and now have three kids together -- weren't face-to-face that day, it was a pivotal moment in their relationship that took things from friendly to romantic.", "image": "https://www.billboard.com/wp-content/uploads/media/Vanessa-Minnillo-Nick-Lachey-billboard-1548.jpg?w=1024"}}, "movies": [], "publish_date": 1507325050.0, "source": "https://www.billboard.com", "summary": ""}