{"url": "https://betches.com/major-bachelorette-spoiler-report-indicates-becca-may-pull-an-arie/", "text": "If you’ve been watching The Bachelorette this season, then you know it’s been the most dramatic season ever lame AF. Literally the most interesting part of this season has been watching Cary Fetman ruin Becca’s life one sequined evening gown at a time. But shit is about to get a whole lot juicier because this just in, people: there are reports that Becca thinks she might have picked the wrong guy. In other news, the sky is blue!\n\nThis information is shocking for a lot of reasons, but mostly because if you’ll recall, at the start of this season Becca casually announced that she is in fact engaged and, like, soooo in love. Which, in hindsight, should have been a huge red fucking flag. Announcing your engagement before you’ve even watched your fiancé openly weep in front of cameras about not getting chosen for a date one week is like the equivalent of some girl posting an #MCM tribute on Instagram before finding out her boyfriend is best friends with his mom. Yeah, it was never going to last.\n\nSo, like, what went wrong? Here’s what we know: A source told Life & Style that Becca is officially “not thinking about a wedding” and “really has regrets” about the guy she chose. Apparently while we’ve been watching the moving car crash that is this season of The Bachelorette, Becca has been sneaking around behind the scenes with her new man, only to find out that she actually doesn’t know him at all. Considering the men she had to choose from were floor-shitting sex offenders, hateful meme likers, and just generally fame whores, color me SHOCKED that things aren’t working out for her.\n\nSpeaking of the flaming piles of garbage masquerading as human men, after watching this season and finding out that ABC is worse at running a background check than I am at balancing a checkbook, Becca is reportedly starting to think her instincts were off when she chose to spend the rest of her life with one of these dudes. Imagine that!\n\nA source told Life&StyleMag.com that Becca “thought was the right choice from what she knew of him during filming” and that “he charmed her, she fell in love and she thought she could imagine forever with him.” Which, like, makes sense if you think about who her frontrunners are right now.\n\nFirst, we have Garrett, who seems down-to-earth but who also likes homophobic, racist, women-hating memes in his downtime. We can’t have it all, ladies! Then there’s Colton, who I’m starting to think is trying to auction off his virginity to any person with the most Instagram followers. Jason and Blake are definitely the least disgusting of the four, but Jason looks like a used car salesman and Blake is needier than me after I post a thirst-trap picture of myself to Instagram and my ex doesn’t like it immediately. I mean, after breaking it down like that, I think I’d rather spend the rest of my life drinking $10 rose while watching The Cutting Edge: Fire & Ice over and over again than then with any of these guys, but to each their own.\n\nThe source also said that Becca “doesn’t think she had enough of an open mind with the other guys” and spent too much time being obsessed with the winner. So what I’m hearing here is BECCA YOU SHOULD HAVE PICKED WILLS YOU DUMB HOE. I’m sorry that was uncalled for, but you should have picked Wills you dumb hoe fucked up, Becs. That’s all I’ll say.\n\nAnd this. I’ll just leave this here.\n\nNext Monday is Hometowns, and I for one cannot wait to watch all the red flags Becca apparently missed as I drink cheap wine and mock her for putting herself out there from the safety of my own home. Should be a good time!\n\nImages: Giphy (2)", "images": ["https://www.facebook.com/tr?id=588217684700940&ev=PageView\n\t\t&noscript=1", "https://betches.com/app/uploads/2018/07/omg.gif", "https://betches.com/wp-content/themes/betches-2021/assets-img/gif-mascot-articles.gif", "https://betches.com/wp-content/plugins/a3-lazy-load/assets/images/lazy_placeholder.gif", "https://betches.s3.amazonaws.com/app/uploads/2018/06/12143550/becca1.jpg", "https://pixel.quantserve.com/pixel/p-ZqRuYBtPWtPaq.gif", "https://secure.gravatar.com/avatar/0beaa8e61c5242c9769e754776fa4e7e?s=96&d=mm&r=g", "https://betches.com/app/uploads/2018/07/wills-bachelorette.gif"], "top_img": "https://betches.s3.amazonaws.com/app/uploads/2018/06/12143550/becca1.jpg", "keywords": [], "authors": ["Ryanne Probst"], "canonical_link": "https://betches.com/major-bachelorette-spoiler-report-indicates-becca-may-pull-an-arie/", "title": "MAJOR 'BACHELORETTE' SPOILER: Report Indicates Becca May Pull An Arie", "meta_data": {"facebook-domain-verification": "6qqpx3gpczagbs3x011wbysboop762", "viewport": "width=device-width,initial-scale=1", "ahrefs-site-verification": "816d47663ea477d9bb41ce45e2525282b9b6373557042d1d775bf52d9714be81", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "MAJOR 'BACHELORETTE' SPOILER: Report Indicates Becca May Pull An Arie - Betches", "description": "If you’ve been watching The Bachelorette this season, then you know it’s been the most dramatic season ever lame AF. Literally the most interesting part of this season has been watching Cary Fetman ruin Becca’s life one sequined evening gown at a time. But shit is about to get a whole lot juicier because this […]", "url": "https://betches.com/major-bachelorette-spoiler-report-indicates-becca-may-pull-an-arie/", "site_name": "Betches", "image": {"identifier": "https://betches.s3.amazonaws.com/app/uploads/2018/06/12143550/becca1.jpg", "width": 1140, "height": 570, "type": "image/jpeg"}}, "article": {"published_time": "2018-07-12T16:31:19+00:00"}, "author": "Ryanne Probst", "twitter": {"card": "summary_large_image", "label1": "Written by", "data1": "Ryanne Probst", "label2": "Est. reading time", "data2": "3 minutes"}, "fb": {"pages": 197896046906431}, "sailthru.date": "2018-07-12 16:31:19", "sailthru.title": "MAJOR ‘BACHELORETTE’ SPOILER: Report Indicates Becca May Pull An Arie", "sailthru.tags": ",abc,bachelorette,bachelorette becca,bachelorette spoilers,becca k,becca kufrin,engagement,the bachelorette,Pop Culture & News,,website", "sailthru.author": "Ryanne Probst", "sailthru.description": "If you’ve been watching The Bachelorette this season, then you know it’s been the most dramatic season ever lame AF. Literally the most interesting part of this season has been watching Cary Fetman ruin Becca’s life one sequined evening gown at a time. But shit is about to get a whole lot juicier because this […]", "sailthru.image.full": "https://betches.s3.amazonaws.com/app/uploads/2018/06/12143550/becca1.jpg", "sailthru.image.thumb": "https://betches.s3.amazonaws.com/app/uploads/2018/06/12143550/becca1.jpg", "msapplication-TileImage": "https://betches.s3.amazonaws.com/app/uploads/2021/03/11081515/cropped-cropped-FAVICON_512-1-1-270x270.png"}, "movies": [], "publish_date": 1531413079.0, "source": "https://betches.com", "summary": ""}