{"url": "https://www.hollywoodreporter.com/rambling-reporter/golden-globes-inside-tonya-harding-tommy-wiseaus-epic-night-1073381", "text": "Tonya Harding made the trek to Los Angeles last month from her home in Washington state to attend the Dec. 5 premiere of I, Tonya, and just four weeks later, she was coaxed back with an invite to attend the Golden Globes and sit at the film’s table alongside nominees Margot Robbie and eventual winner Allison Janney.\n\nWriter-producer Steven Rogers, who has been developing the project for years, was one of the instrumental forces in getting her to fly back. “She was texting me last night and this morning saying she’s excited to be a part of it, which I thought was interesting because the movie is called I, Tonya,” Rogers told THR on the carpet before the show. “I’m very interested to see what the response is for her. My friend said to me that I literally gave her a Hollywood ending.”\n\nIt looked like that’s exactly what she got after the show at the InStyle/Warner Bros. Pictures bash, where she posed for many selfies (and danced to DJ Michelle Pesce) and even got to hold Janney’s best supporting actress trophy. “I love that she’s here,” Janney said. “I don’t think we exonerate her, but we absolutely make people think twice of what they thought of her when this incident happened, and to have some empathy for her looking at the kind of mother she had. That’s got to feel good for her to have that.”\n\nShe also got some face time with The Disaster Artist himself, Tommy Wiseau. The two posed for photos together while Wiseau also showed up on Joe Jonas’ Instagram. Earlier, on the red carpet, THR asked Wiseau whom he would like to meet in a roomful of stars, but Wiseau swatted away any indication that he gets starstruck.\n\n“I treat everybody the same way. Actors are actors, a lot of people are doing a good job. I support them — ironically, they support me,” Wiseau said, wearing his signature black sunglasses and a Burberry tux. “I’m not like you with what you ask me. A person is a person. You can put President Obama here, it doesn’t affect me like it affects you. I treat everyone equally.”\n\nWiseau was certainly treated like a star during the evening; he was even invited onstage during James Franco’s best actor win for playing a version of him in The Disaster Artist. That was until Franco pushed him away from the microphone. Still, he said Franco deserved the trophy. “It’s not easy to make a movie about a bad movie, whatever you call it. I call it the best movie ever, what about that!“", "images": ["https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/tonya_harding_and_tommy_wiseau_-_split_-_getty_-_h_2018_0.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/tonya_harding_and_tommy_wiseau_-_split_-_getty_-_h_2018_0.jpg?w=1296&h=730&crop=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "http://www.hollywoodreporter.com/sites/default/files/custom/Annie/unnamed-1.png", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/tonya_harding_and_tommy_wiseau_-_split_-_getty_-_h_2018_0.jpg?w=1024", "keywords": [], "authors": ["Chris Gardner"], "canonical_link": "https://www.hollywoodreporter.com/news/general-news/golden-globes-inside-tonya-harding-tommy-wiseaus-epic-night-1073381/", "title": "Golden Globes: Inside Tonya Harding and Tommy Wiseau’s Epic Night Out", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The mastermind of 'The Room' tells THR that he doesn't get starstruck: \"You can put President Obama here, it doesn't affect me like it affects you. I treat everyone equally.\"", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Chris Gardner", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1073381, "title": "Golden Globes: Inside Tonya Harding and Tommy Wiseau's Epic Night Out", "published_at": "2018-01-09 14:30:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/tonya_harding_and_tommy_wiseau_-_split_-_getty_-_h_2018_0.jpg?w=1024", "comment_count": 0, "topics": "News", "body": "Tonya Harding made the trek to Los Angeles last month from her home in Washington state to attend the Dec. 5 premiere of I, Tonya, and just four weeks later, she was coaxed back with an invite to attend the Golden Globes and sit at the film's table alongside nominees Margot Robbie and eventual winner Allison Janney.\r\nWriter-producer Steven Rogers, who has been developing the project for years, was one of the instrumental forces in getting her to fly back. \"She was texting me last night and this morning saying she's excited to be a part of it, which I thought was interesting because the movie is called I, Tonya,\" Rogers told THR on the carpet before the show. \"I'm very interested to see what the response is for her. My friend said to me that I literally gave her a Hollywood ending.\"\r\nIt looked like that's exactly what she got after the show at the InStyle/Warner Bros. Pictures bash, where she posed for many selfies (and danced to DJ Michelle Pesce) and even got to hold Janney's best supporting actress trophy. \"I love that she's here,\" Janney said. \"I don't think we exonerate her, but we absolutely make people think twice of what they thought of her when this incident happened, and to have some empathy for her looking at the kind of mother she had. That's got to feel good for her to have that.\"\r\n\r\nShe also got some face time with The Disaster Artist himself, Tommy Wiseau. The two posed for photos together while Wiseau also showed up on Joe Jonas' Instagram. Earlier, on the red carpet, THR asked Wiseau whom he would like to meet in a roomful of stars, but Wiseau swatted away any indication that he gets starstruck.\r\n\"I treat everybody the same way. Actors are actors, a lot of people are doing a good job. I support them — ironically, they support me,\" Wiseau said, wearing his signature black sunglasses and a Burberry tux. \"I'm not like you with what you ask me. A person is a person. You can put President Obama here, it doesn't affect me like it affects you. I treat everyone equally.\"\r\nWiseau was certainly treated like a star during the evening; he was even invited onstage during James Franco's best actor win for playing a version of him in The Disaster Artist. That was until Franco pushed him away from the microphone. Still, he said Franco deserved the trophy. \"It's not easy to make a movie about a bad movie, whatever you call it. I call it the best movie ever, what about that!\"\r\n\r\n\t\r\n\t\t\r\n\t\t\t\r\n\t\t\t\t \r\n\t\t\r\n\t\tLegenden leben ewig! #tonyaharding #tommywiseau #goldenglobes #awards #iTonya #comingsoon\r\n\t\tA post shared by  I TONYA (@itonya.film) on Jan 8, 2018 at 8:58am PST", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Golden Globes: Inside Tonya Harding and Tommy Wiseau’s Epic Night Out", "url": "https://www.hollywoodreporter.com/news/general-news/golden-globes-inside-tonya-harding-tommy-wiseaus-epic-night-1073381/", "description": "The mastermind of ‘The Room’ tells THR that he doesn’t get starstruck: “You can put President Obama here, it doesn’t affect me like it affects you. I treat everyone eq…", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/tonya_harding_and_tommy_wiseau_-_split_-_getty_-_h_2018_0.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2018-01-09T14:30:00+00:00", "modified_time": "2018-01-10T14:07:53+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Golden Globes: Inside Tonya Harding and Tommy Wiseau’s Epic Night Out", "description": "The mastermind of ‘The Room’ tells THR that he doesn’t get starstruck: “You can put President Obama here, it doesn’t affect me like it affects you. I treat everyone eq…", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/tonya_harding_and_tommy_wiseau_-_split_-_getty_-_h_2018_0.jpg?w=1296"}}, "movies": [], "publish_date": 1515508200.0, "source": "https://www.hollywoodreporter.com", "summary": ""}