{"url": "https://en.wikipedia.org/wiki/Head_of_the_Commonwealth", "text": "Symbolic head of association of independent states\n\nThe head of the Commonwealth is the ceremonial leader who symbolises \"the free association of independent member nations\" of the Commonwealth of Nations, an intergovernmental organisation that currently comprises 56 sovereign states. There is no set term of office or term limit and the role itself involves no part in the day-to-day governance of any of the member states within the Commonwealth. The position is currently held by King Charles III.[1]\n\nBy 1949, the British Commonwealth was a group of eight countries, each having King George VI as monarch. India, however, desired to become a republic, but not to leave the Commonwealth by doing so. This was accommodated by the creation of the title Head of the Commonwealth for the King and India became a republic in 1950. Subsequently during the reign of Queen Elizabeth II, other nations, including Pakistan, Sri Lanka, Ghana, and Singapore also became republics, but, as members of the Commonwealth of Nations, recognised the Queen as Head of the Commonwealth.[2]\n\nHistory [ edit ]\n\nThe Commonwealth Prime Ministers with the King at Buckingham Palace for the Commonwealth Prime Ministers' Conference, 1949\n\nIn 1949, King George VI was king of each of the countries that then comprised the British Commonwealth (later the Commonwealth of Nations): the United Kingdom, Canada, Australia, New Zealand, South Africa, India, Pakistan, and Ceylon. However, the Indian Cabinet desired the country to become a republic, but not to leave the Commonwealth as a consequence of no longer having George VI as king, as happened to Ireland. To accommodate this, the London Declaration, issued in late April 1949,[3][4][5][6] and devised by Canadian Prime Minister Louis St. Laurent, stated that the King, as the symbol of the free association of the countries of the Commonwealth, was the head of the Commonwealth. When India adopted a republican constitution on 26 January 1950, George VI ceased to be its monarch (the president of India, Rajendra Prasad, became head of state), but it did regard him as Head of the Commonwealth.\n\nElizabeth II became Head of the Commonwealth on her accession in 1952, stating at the time, \"the Commonwealth bears no resemblance to the empires of the past. It is an entirely new conception built on the highest qualities of the spirit of man: friendship, loyalty, and the desire for freedom and peace.\"[7] The following year, a Royal Style and Titles Act was passed in each of the Commonwealth realms, adding for the first time the term Head of the Commonwealth to the monarch's titles.\n\nThe Queen had a personal flag created in December 1960 to symbolise her as Head of the Commonwealth without being associated with her role as queen of any particular country. Over time, the flag replaced the British Royal Standard when the Queen visited Commonwealth countries of which she was head of state but did not possess a royal standard for that country,[8] or of which she was not head of state, as well as on Commonwealth occasions in the United Kingdom. When the Queen visited the headquarters of the Commonwealth Secretariat in London, this personal standard—not any of her royal standards—was raised.[9]\n\nFormer Canadian Prime Minister Brian Mulroney said Elizabeth was a \"behind the scenes force\" in ending apartheid in South Africa.[10][11][non sequitur]\n\nAfter the Queen's death on 8 September 2022, King Charles III became Head of the Commonwealth.\n\nTitle [ edit ]\n\nThe title was devised in the London Declaration as a result of discussions at the 1949 Commonwealth Prime Ministers' Conference. It is rendered in Latin as Consortionis Populorum Princeps,[12][13][14] and in French as Chef du Commonwealth.[15]\n\nRoles and duties [ edit ]\n\nThe Head of the Commonwealth is recognised by the members of the Commonwealth of Nations as the \"symbol of their free association\" and serves as a leader, alongside the Commonwealth Secretary-General and Commonwealth Chair-in-Office. Although Queen Elizabeth II was head of state of 15 member-states of the Commonwealth, she did not have any role in the governance of any Commonwealth state by virtue of her role as Head of the Commonwealth. The Queen kept in touch with Commonwealth developments through regular contact with the Commonwealth Secretary General and the Secretariat, the Commonwealth's central organisation.[16]\n\nThe head of the Commonwealth or a representative attends the biennial Commonwealth Heads of Government Meeting (CHOGM), held at locations throughout the Commonwealth. This is a tradition begun by the monarch on the advice of Canadian Prime Minister Pierre Trudeau in 1973,[17] when the CHOGM was first held in Canada. During the summit, the head of the Commonwealth has a series of private meetings with Commonwealth countries' heads of government, attends a CHOGM reception and dinner, and makes a general speech.\n\nThe head of the Commonwealth or a representative has also been present at the quadrennial Commonwealth Games. The Queen's Baton Relay, held prior to the beginning of the Commonwealth Games, carried a message from the head of the Commonwealth to all Commonwealth Nations and territories.[18][19]\n\nEvery year on Commonwealth Day, the second Monday in March, Queen Elizabeth II broadcast a special message to all the peoples of the Commonwealth, about 2.5 billion people.[20] That same day, she attended the inter-denominational Commonwealth Day Service held at Westminster Abbey.[21]\n\nQueen Elizabeth II and Commonwealth Prime Ministers at Windsor Castle, 1960\n\nElizabeth II at the closing ceremony of the Brisbane Commonwealth Games, 1982\n\nElizabeth II passing the Baton to President Patil of India for the Baton relay for the Delhi Commonwealth Games, 2009\n\nElizabeth II arriving at the Commonwealth Games Opening Ceremony at Glasgow, 2014\n\nSuccession [ edit ]\n\nThe Head of the Commonwealth delivering the inaugural address at the CHOGM 2011 in Perth, Australia\n\nThe position of Head of the Commonwealth is not hereditary and successors are chosen by the leaders of the Commonwealth.[22] Once in office, there is no term limit, so the incumbent is practically chosen for life.\n\nBy 2018, with Elizabeth II in her 90s, there had been discussions for some time about whether her eldest son Prince Charles or someone else should become the third Head of the Commonwealth.[23] The London Declaration states that \"The King [acts] as the symbol of the free association of its independent member nations and as such the Head of the Commonwealth\", whereby both republics and kingdoms that are not Commonwealth realms can recognise the monarch as Head of the Commonwealth without accepting the person as the country's head of state. Though each Commonwealth realm's laws on royal titles and styles made Head of the Commonwealth part of the Queen's full title,[citation needed] and Queen Elizabeth II declared in 1958, through the Letters Patent creating Prince Charles as Prince of Wales, that Charles and his heirs and successors shall be future heads of the Commonwealth,[24][25][26][dubious – discuss] there have been conflicting statements on how successors to the position of Head of the Commonwealth are chosen. While the Commonwealth Secretariat asserted any successor would be chosen collectively by the Commonwealth heads of government,[27] Commonwealth heads of government, such as the then Prime Minister of Canada Stephen Harper, had already referred to Prince Charles as \"the future head of the Commonwealth\",[28] and in 2015 the then Prime Minister of New Zealand, John Key, said, \"the title [of Head of the Commonwealth] should just go with the Crown\".[29]\n\nCommentators in British newspapers discussed whether it should be a one-off decision to elect Prince Charles to the headship, whether the British monarch should automatically become head of the Commonwealth, or whether the post should be elected or chosen by consensus.[30][31][32] There was also speculation that a rotating ceremonial \"republican\" headship might be instituted.[33][34] The Daily Telegraph reported that \"the post is not hereditary and many leaders want an elected head to make the organisation more democratic.\"[35]\n\nIn 2018, following the 2018 Commonwealth Heads of Government Meeting, Commonwealth leaders declared that Charles would be the next head of the Commonwealth,[36] while the role remained non-hereditary.[37][38] Consequently, after the Queen's death on 8 September 2022, Charles automatically became Head of the Commonwealth.[1]\n\nList of heads [ edit ]\n\nNo. Portrait Name Term Start End Duration 1 George VI\n\n(1895–1952) 26/28 April 1949[n 1] 6 February 1952 2 years, 284 days 2 Elizabeth II\n\n(1926–2022) 6 February 1952 8 September 2022 70 years, 214 days 3 Charles III\n\n(born 1948) 8 September 2022 Incumbent 29 days\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Commonwealth_Prime_Ministers_in_London_1949.jpg/220px-Commonwealth_Prime_Ministers_in_London_1949.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Charles%2C_Prince_of_Wales_at_COP21.jpg/120px-Charles%2C_Prince_of_Wales_at_COP21.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/d/db/Charles_Prince_of_Wales.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Queen_Elizabeth_II_1959_%28cropped2%29.jpg/120px-Queen_Elizabeth_II_1959_%28cropped2%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/The_President%2C_Smt._Pratibha_Devisingh_Patil_receiving_the_Baton_from_the_Queen_Elizabeth_II%2C_for_Baton_relay_of_XIX_Commonwealth_Games_2010%2C_at_Buckingham_Palace%2C_in_London_on_October_29%2C_2009.jpg/86px-thumbnail.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/Her_Majesty_Queen_Elizabeth_II_at_the_Closing_Ceremony_of_the_XII_Commonwealth_Games%2C_Brisbane.jpg/177px-Her_Majesty_Queen_Elizabeth_II_at_the_Closing_Ceremony_of_the_XII_Commonwealth_Games%2C_Brisbane.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/DSCF6026_Queen_arrives_at_Commonwealth_Games_Opening_Ceremony.jpg/160px-DSCF6026_Queen_arrives_at_Commonwealth_Games_Opening_Ceremony.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/King_George_VI_LOC_matpc.14736_A_%28cropped%29.jpg/120px-King_George_VI_LOC_matpc.14736_A_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/Her_Majesty_Queen_Elizabeth_II_delivering_the_inaugural_address_at_the_CHOGM_2011_at_Perth_Convention_and_Exhibition_Centre%2C_in_Australia._The_Vice_President%2C_Shri_Mohd._Hamid_Ansari_and_other_Heads_of_States_are_also_seen.jpg/220px-thumbnail.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Queen_Elizabeth_II_and_the_Prime_Ministers_of_the_Commonwealth_Nations%2C_at_Windsor_Castle_%281960_Commonwealth_Prime_Minister%27s_Conference%29.jpg/165px-Queen_Elizabeth_II_and_the_Prime_Ministers_of_the_Commonwealth_Nations%2C_at_Windsor_Castle_%281960_Commonwealth_Prime_Minister%27s_Conference%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/Charles_Prince_of_Wales.jpg/220px-Charles_Prince_of_Wales.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/d/db/Charles_Prince_of_Wales.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Head_of_the_Commonwealth", "title": "Head of the Commonwealth", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/d/db/Charles_Prince_of_Wales.jpg", "width": 640, "height": 800}, "title": "Head of the Commonwealth - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}