{"url": "https://www.nhsinform.scot/illnesses-and-conditions/infections-and-poisoning/norovirus", "text": "Norovirus causes diarrhoea and vomiting and is one of the most common stomach bugs in the UK. It's also called the 'winter vomiting bug' because it's more common in winter, although you can catch it at any time of the year.\n\nNorovirus can be very unpleasant but usually clears up by itself in a few days.\n\nYou can normally look after yourself or your child at home.\n\nAvoid going to your GP, as norovirus can spread to others very easily. Phone your GP practice or NHS 24 on 111 if you're concerned or need advice.\n\nSymptoms of norovirus\n\nYou're likely to have norovirus if you experience:\n\nsuddenly feeling sick\n\nprojectile vomiting\n\nwatery diarrhoea\n\nSome people also have a slight fever, headaches, painful stomach cramps and aching limbs.\n\nThe symptoms appear one to two days after you become infected and typically last for up to two or three days.\n\nHow is norovirus spread?\n\nNorovirus spreads very easily in public places such as hospitals, nursing homes and schools.\n\nYou can catch it if small particles of vomit or stools (poo) from an infected person get into your mouth through:\n\nclose contact with someone with norovirus who may breathe out small particles of the virus that you then inhale\n\ntouching contaminated surfaces or objects, as the virus can survive outside the body for several days\n\neating contaminated food, which can happen if an infected person doesn't wash their hands before preparing or handling food\n\nNorovirus is most infectious from the start of symptoms until 48 hours after all symptoms have stopped. You may also be infectious for a short time before and after this.\n\nYou can get norovirus more than once because the virus is always changing and your body is unable to build up long-term resistance to it.\n\nPreventing norovirus\n\nIt's not always possible to avoid getting norovirus, but following the advice below can help stop the virus spreading. You should:\n\nstay off work or school until at least 48 hours after the norovirus symptoms have stopped\n\navoid visiting anyone in hospital during this time\n\nwash your hands frequently and thoroughly with soap and water particularly after using the toilet and before preparing or handling food\n\nbe aware alcohol-based hand gels don't kill the virus\n\nMaintain basic hygiene and cleaning to help stop the spread of norovirus by:\n\ndisinfecting any surfaces or objects that could be contaminated, using a bleach-based household cleaner.\n\nwashing any items of clothing or bedding that could have become contaminated separately on a hot wash (60 °C) to ensure the virus is killed.\n\nnot sharing towels and flannels\n\nflushing any poo or vomit in the toilet and cleaning the surrounding area with a bleach-based household cleaner\n\navoiding eating raw, unwashed food\n\nonly eating oysters from a reliable source as they can carry norovirus\n\nWhat to do if you have norovirus\n\nIf you experience sudden diarrhoea and/or vomiting, the best thing to do is to stay at home until you're feeling better.\n\nThere's no treatment for norovirus, so you have to let it run its course.\n\nYou don't usually need to get medical advice unless there's a risk of a more serious problem.\n\nTo help ease your own or your child’s symptoms drink plenty of fluids to avoid dehydration.\n\nYou need to drink more than usual to replace the fluids lost from vomiting and diarrhoea – as well as water, adults could also try fruit juice and soup.\n\nAvoid giving fizzy drinks or fruit juice to children as it can make their diarrhoea worse. Babies should continue to feed as usual, either with breast milk or other milk feeds.\n\nYou can also:\n\ntake paracetamol for any fever or aches and pains\n\nget plenty of rest\n\nuse special rehydration drinks, available from community pharmacies if you have signs of dehydration, such as a dry mouth or dark urine\n\nIf you feel like eating, try plain foods, such as soup, rice, pasta and bread.\n\nBabies and young children, especially under a year old, have a greater risk of becoming dehydrated.\n\nWhen to get medical advice\n\nYou don't normally need to see your GP if you think you or your child has norovirus, as there's no specific treatment for it.\n\nAntibiotics won't help because norovirus is caused by a virus.", "images": ["https://api-visitor-us-east.velaro.com/20046/4564/button.jpg", "https://www.nhsinform.scot/media/2071/nsssmall.png", "https://www.nhsinform.scot/content/images/logos/nhs-inform-logo--white.svg", "https://www.nhsinform.scot/media/1092/nhsinformlogo.gif?crop=0.061940298507462695,0.0000000000000001203035319805,0.0638592750533047,0&cropmode=percentage&width=1200&height=630&rnd=133089379320000000", "https://www.nhsinform.scot/content/images/bsl-logo.svg", "https://www.nhsinform.scot/content/images/logos/nhs-24--white.svg"], "top_img": "https://www.nhsinform.scot/media/1092/nhsinformlogo.gif?crop=0.061940298507462695,0.0000000000000001203035319805,0.0638592750533047,0&cropmode=percentage&width=1200&height=630&rnd=133089379320000000", "keywords": [], "authors": [], "canonical_link": "https://www.nhsinform.scot/illnesses-and-conditions/infections-and-poisoning/norovirus", "title": "Norovirus", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=2", "umb": {"id": 17469, "docType": "dtArticle"}, "ifmPageId": 17469, "ifmPageTitle": "Norovirus", "referrer": "always", "_info": "NHS inform", "description": "Norovirus is a stomach bug which causes diarrhoea and vomiting. Learn about norovirus treatment and prevention.", "og": {"type": "article", "locale": "en_GB", "title": "Norovirus", "description": "Norovirus is a stomach bug which causes diarrhoea and vomiting. Learn about norovirus treatment and prevention.", "image": "https://www.nhsinform.scot/media/1092/nhsinformlogo.gif?crop=0.061940298507462695,0.0000000000000001203035319805,0.0638592750533047,0&cropmode=percentage&width=1200&height=630&rnd=133089379320000000"}, "twitter": {"card": "summary_large_image", "site": "@NHSinform", "creator": "@NHSinform", "title": "Norovirus", "description": "Norovirus is a stomach bug which causes diarrhoea and vomiting. Learn about norovirus treatment and prevention.", "image": "https://www.nhsinform.scot/media/1092/nhsinformlogo.gif?crop=0.061940298507462695,0.0000000000000001203035319805,0.0638592750533047,0&cropmode=percentage&width=1200&height=630&rnd=133089379320000000"}, "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "/content/images/icons/ms-icon-144x144.png", "theme-color": "#ffffff"}, "movies": [], "publish_date": null, "source": "https://www.nhsinform.scot", "summary": ""}