{"url": "https://www.mayoclinic.org/diseases-conditions/bells-palsy/diagnosis-treatment/drc-20370034", "text": "Diagnosis\n\nThere's no specific test for Bell's palsy. Your health care provider will look at your face and ask you to move your facial muscles by closing your eyes, lifting your brow, showing your teeth and frowning, among other movements.\n\nOther conditions — such as a stroke, infections, Lyme disease, inflammatory conditions and tumors — can cause facial muscle weakness that mimics Bell's palsy. If the cause of your symptoms isn't clear, your health care provider may recommend other tests, including:\n\nElectromyography (EMG). This test can confirm the presence of nerve damage and determine its severity. An EMG measures the electrical activity of a muscle in response to stimulation. It also measures the nature and speed of the conduction of electrical impulses along a nerve.\n\nThis test can confirm the presence of nerve damage and determine its severity. An measures the electrical activity of a muscle in response to stimulation. It also measures the nature and speed of the conduction of electrical impulses along a nerve. Imaging scans. Magnetic resonance imaging (MRI) or computerized tomography (CT) may be needed on occasion to rule out other possible sources of pressure on the facial nerve, such as a tumor or skull fracture.\n\nMagnetic resonance imaging (MRI) or computerized tomography (CT) may be needed on occasion to rule out other possible sources of pressure on the facial nerve, such as a tumor or skull fracture. Blood tests. There is no blood test for Bell's palsy. But blood tests can be used to rule out Lyme disease and other infections.\n\nTreatment\n\nMost people with Bell's palsy recover fully — with or without treatment. There's no one-size-fits-all treatment for Bell's palsy. But your health care provider may suggest medications or physical therapy to help speed your recovery. Surgery is rarely an option for Bell's palsy.\n\nBecause the eye on the affected side doesn't close, it's important to take steps to protect and care for that eye. Using lubricating eye drops during the day and an eye ointment at night will help keep your eye moist. Wearing glasses or goggles during the day and an eye patch at night can protect your eye from getting poked or scratched. In severe cases of Bell's palsy, an eye doctor may need to monitor the eye.\n\nMedications\n\nCommonly used medications to treat Bell's palsy include:\n\nCorticosteroids, such as prednisone. These are powerful anti-inflammatory agents. If they can reduce the swelling of the facial nerve, the nerve will fit more comfortably within the bony corridor that surrounds it. Corticosteroids may work best if they're started within several days of when your symptoms started. Steroids started early improve the likelihood of complete recovery.\n\nsuch as prednisone. These are powerful anti-inflammatory agents. If they can reduce the swelling of the facial nerve, the nerve will fit more comfortably within the bony corridor that surrounds it. Corticosteroids may work best if they're started within several days of when your symptoms started. Steroids started early improve the likelihood of complete recovery. Antiviral drugs. The role of antivirals remains unsettled. Antivirals alone have shown no benefit compared with placebo. Antivirals added to steroids may benefit some people with Bell's palsy, but this is still unproved. Despite this, an antiviral drug, such as valacyclovir (Valtrex) or acyclovir (Zovirax), is sometimes given in combination with prednisone in people with severe facial palsy.\n\nPhysical therapy\n\nParalyzed muscles can shrink and shorten, which may be permanent. A physical therapist can teach you how to massage and exercise your facial muscles to help prevent this from occurring.\n\nSurgery\n\nIn the past, decompression surgery was used to relieve the pressure on the facial nerve by opening the bony passage that the nerve passes through. Today, decompression surgery isn't recommended. Facial nerve injury and permanent hearing loss are possible risks associated with this surgery.\n\nRarely, plastic surgery may be needed to correct lasting facial nerve problems. Facial reanimation surgery helps make the face look more even and may restore facial movement. Examples of this type of surgery include an eyebrow lift, an eyelid lift, facial implants and nerve grafts. Some procedures, such as an eyebrow lift, may need to be repeated after several years.\n\nThere is a problem with information submitted for this request. Review/update the information highlighted below and resubmit the form. From Mayo Clinic to your inbox Sign up for free, and stay up to date on research advancements, health tips and current health topics, like COVID-19, plus expertise on managing health. Email ErrorEmail field is required ErrorInclude a valid email address Learn more about Mayo Clinic’s use of data. To provide you with the most relevant and helpful information, and understand which information is beneficial, we may combine your email and website usage information with other information we have about you. If you are a Mayo Clinic patient, this could include protected health information. If we combine this information with your protected health information, we will treat all of that information as protected health information and will only use or disclose that information as set forth in our notice of privacy practices. You may opt-out of email communications at any time by clicking on the unsubscribe link in the e-mail. Subscribe! Thank you for subscribing! You'll soon start receiving the latest Mayo Clinic health information you requested in your inbox. Sorry something went wrong with your subscription Please, try again in a couple of minutes Retry\n\nLifestyle and home remedies\n\nHome treatment may include:\n\nTaking pain relievers. Aspirin, ibuprofen (Advil, Motrin IB, others) or acetaminophen (Tylenol, others) are available without a prescription and may help ease your pain.\n\nAspirin, ibuprofen (Advil, Motrin IB, others) or acetaminophen (Tylenol, others) are available without a prescription and may help ease your pain. Doing physical therapy exercises. Massaging and exercising your face according to your physical therapist's advice may help relax your facial muscles.\n\nAlternative medicine\n\nAlthough there's little scientific evidence to support the use of alternative medicine for people with Bell's palsy, some people with the condition may benefit from the following:\n\nAcupuncture. Placing thin needles into a specific point in your skin helps stimulate nerves and muscles, which may offer some relief.\n\nPlacing thin needles into a specific point in your skin helps stimulate nerves and muscles, which may offer some relief. Biofeedback training. By teaching you to use your thoughts to control your body, biofeedback training may help you gain better control over your facial muscles.\n\nBy teaching you to use your thoughts to control your body, biofeedback training may help you gain better control over your facial muscles. Botulinum toxin. This medication may help manage symptoms such as facial spasms and tearing. Injections of botulinum toxin may also help improve symmetry of the face.\n\nPreparing for your appointment\n\nYou'll likely start by seeing your family doctor or other health care provider. However, in some cases when you call to set up an appointment, you may be referred immediately to a doctor who specializes in the nervous system (neurologist).\n\nIt's good to prepare for your appointment. Here's some information to help you get ready.\n\nWhat you can do\n\nWrite down any symptoms you're experiencing. Be sure to include any that may seem unrelated to the reason for which you scheduled the appointment.\n\nBe sure to include any that may seem unrelated to the reason for which you scheduled the appointment. Write down key personal information. Have you had any major stresses or life changes recently? Sharing this type of information may help with a diagnosis.\n\nHave you had any major stresses or life changes recently? Sharing this type of information may help with a diagnosis. Make a list of all medications. Include the dosage of any medications you're taking. Write down any vitamins or supplements that you're taking, too.\n\nInclude the dosage of any medications you're taking. Write down any vitamins or supplements that you're taking, too. Take a family member or friend along, if possible. Sometimes it can be difficult to remember all of the information during an appointment. Someone who accompanies you may remember something that you missed or forgot.\n\nSometimes it can be difficult to remember all of the information during an appointment. Someone who accompanies you may remember something that you missed or forgot. Write down questions you want to ask.\n\nPreparing a list of questions will help you make the most of your time with your provider. For Bell's palsy, some basic questions to ask include:\n\nWhat's the most likely cause of my symptoms?\n\nAre there any other possible causes for my symptoms?\n\nWhat kinds of tests do I need?\n\nIs this condition likely temporary or long lasting?\n\nWhat treatments are available for Bell's palsy? Which do you recommend?\n\nAre there alternatives to the primary approach that you're suggesting?\n\nI have other health conditions. How can I best manage these conditions together?\n\nAre there any brochures or other printed material that I can take home with me? What websites do you recommend?\n\nDon't hesitate to ask any additional questions that occur to you during your appointment.\n\nWhat to expect from your doctor\n\nBe prepared to answer questions such as:\n\nWhen did you begin having symptoms?\n\nHave your symptoms been continuous or occasional?\n\nHow severe are your symptoms?\n\nWhat, if anything, seems to improve your symptoms?\n\nWhat, if anything, appears to worsen your symptoms?\n\nHave any of your relatives ever had Bell's palsy or problems with facial paralysis?\n\nHave you had any symptoms of a more generalized infection?\n\nWhat you can do in the meantime\n\nIf you have facial pain:\n\nTake pain relievers. Aspirin, ibuprofen (Advil, Motrin IB, others) or acetaminophen (Tylenol, others) can help with pain.\n\nAspirin, ibuprofen (Advil, Motrin IB, others) or acetaminophen (Tylenol, others) can help with pain. Apply moist heat. Putting a washcloth soaked in warm water on your face several times a day may help relieve pain.\n\nIf your eye won't close completely, try these tips:", "images": ["https://www.honcode.ch/HONcode/Seal/HONConduct636199_hr1.gif", "https://www.mayoclinic.org/styles/img/logo-mayoclinic.png", "https://www.mayoclinic.org/-/media/kcms/gbs/research/images/2013/05/02/10/56/globalnav-patientcare.jpg", "https://www.mayoclinic.org/-/media/web/gbs/shared/images/apple-touch-icon-152x152.png", "https://www.mayoclinic.org/~/media/386AC346D62D46A4944E0923CAF00D28.svg"], "top_img": "https://www.mayoclinic.org/-/media/web/gbs/shared/images/apple-touch-icon-152x152.png", "keywords": [], "authors": [], "canonical_link": "https://www.mayoclinic.org/diseases-conditions/bells-palsy/diagnosis-treatment/drc-20370034", "title": "Diagnosis and treatment", "meta_data": {"application-name": "", "msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "/-/media/web/gbs/shared/images/mstile-144x144.png", "viewport": "width=device-width, initial-scale=1.0", "format-detection": "telephone=no", "PocID": "CON-20370010", "Subject": "Palsy, facial", "Description": "Learn more about Bell's palsy, which causes temporary facial paralysis. Find out why Bell's palsy happens and what to do about it.", "PublishDate": "2022-05-04", "contentLanguage": "en"}, "movies": [], "publish_date": 1651618800.0, "source": "https://www.mayoclinic.org", "summary": ""}