{"url": "en.wikipedia.org/wiki/Leslie_Jones_(comedian)", "text": "American comedian and actress\n\nAnnette \"Leslie\" Jones[1][2] (born September 7, 1967) is an American comedian and actress who was a cast member and writer on Saturday Night Live from 2014 to 2019 and currently the host of Supermarket Sweep. Jones has been a featured performer at the Just for Laughs festival in Montreal and the Aspen Comedy Festival. In 2010, her one-hour comedy special, Problem Child, was broadcast on Showtime. Jones starred in Ghostbusters (2016) as Patty Tolan. In 2017 and 2018, Jones was nominated for a Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series for her work on Saturday Night Live.\n\nEarly life [ edit ]\n\nJones was born on September 7, 1967, in Memphis, Tennessee.[3] She had a younger brother, Rodney Keith Jones (1971–2009).[4] Her father was in the United States Army, and her family relocated frequently.[5] Her family moved to Los Angeles, when her father took a job at Stevie Wonder's radio station, KJLH, as an electronics engineer.[3] Jones attended high school in Lynwood, California, where she also played basketball; her father suggested that she play the sport because she is six feet tall.[6]\n\nJones attended Chapman University on a basketball scholarship. While initially unsure of what she wanted to study, Jones worked as a disc jockey at the student radio station, KNAB,[7] and contemplated playing professional basketball overseas.[8] When her coach, Brian Berger, left Chapman in 1986 for the head-coaching job at Colorado State University, Jones followed.[1][9][10] Once at Colorado State, Jones contemplated pursuing a pre-law degree,[8] but changed her major several times, including for a time to accounting and computer science, before deciding to major in communications.[7]\n\nCareer [ edit ]\n\nJones began doing stand-up comedy in college in 1987, when a friend signed her up for a \"Funniest Person on Campus\" contest.[5][8] After winning the contest, Jones left school for Los Angeles.[8] She performed at comedy clubs while working day jobs at Roscoe's House of Chicken and Waffles and UPS[11] to make ends meet. Comedians Mother Love and Dave Chappelle encouraged her to move to New York City to hone her craft for two years, where she appeared on BET's ComicView before returning to Los Angeles.[7] She performed at The Comedy Store in West Hollywood, but received unfavorable reviews of her shows there.[7] She then went out on tour, opening for Jamie Foxx where she was booed by his audience. Feeling as though she lacked experience, Jones stopped performing for three years.[7] Fearing that she would only ever be known in African American circles, around 2010 she began to stop playing so-called \"black clubs\"[12] One night, Chris Rock saw her perform and gave her name to several of \"the biggest managers in comedy\" all of whom \"didn't get it\".[13] Rock would eventually help Jones get a job at Saturday Night Live.[13]\n\nIn 2008, Jones was part of Katt Williams's It's Pimpin' Pimpin' tour.[5][14]\n\nNetflix signed Jones for a stand-up special slated for 2020.[15]\n\nSaturday Night Live [ edit ]\n\nIn December 2013, Saturday Night Live held a casting call to add at least one African-American woman to the show, and Jones auditioned. Prior to being asked to audition, Jones had criticized the show, saying that the show, and especially cast member Kenan Thompson, was \"not funny\".[16] Sasheer Zamata was added as a featured player, while Jones and LaKendra Tookes were hired as writers.[17] Jones appeared during the Weekend Update segment of the May 3, 2014 episode hosted by Andrew Garfield, where her jokes about her current dating problems and her potential effectiveness as a breeding slave sparked controversy.[9][18]\n\nJones appeared in the first and third episodes of the 40th season, hosted by Chris Pratt and Bill Hader, respectively. On October 20, 2014, Jones was promoted to the cast as a featured player, and made her official debut on the October 25, 2014 episode hosted by Jim Carrey.[19] She became, at age 47, the oldest person to join the show as a cast member (surpassing Michael McKean and George Coe, who were 46 when they joined the show in 1994 and 1975, respectively).[20][21] Jones' addition marked the first time in SNL history that the show's cast included more than one African-American woman;[22] moreover, the 40th season was the first to have five concurrent African-American cast members, beating the previous record of three.[23][24] Jones subsequently returned for Seasons 41, 42 (where she was promoted to Repertory Status), 43, and 44.\n\nIn 2017 and 2018, Jones was nominated for the Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series for her work on SNL.\n\nJones did not return to the 45th season, making the 44th season her last season.[25]\n\nFilm [ edit ]\n\nIn 2006, Jones appeared in Master P's film Repos.\n\nIn 2014, Jones appeared in Chris Rock's directorial film, Top Five; Rock has said a follow-up is in the works,[26] telling Complex Magazine, \"Some people really shine in Top Five. You might want to see a little more Leslie Jones.\"[27]\n\nIn 2015, Jones appeared in the Judd Apatow and Amy Schumer project, Trainwreck; reportedly Apatow and Schumer wrote a part specifically for Jones after seeing her turn in Top Five.[28]\n\nIn 2016, she starred in the reboot Ghostbusters as Patty Tolan, alongside Melissa McCarthy, Kristen Wiig, and Kate McKinnon.[9][29]\n\nJones appeared in Coming 2 America alongside Tracy Morgan, Rick Ross, and KiKi Layne. The film is a sequel to Coming to America, starring Eddie Murphy.[30]\n\nShe has been a member of the Academy of Motion Picture Arts and Sciences in the Actors Branch since 2017.[31]\n\nOlympics coverage [ edit ]\n\nDuring the 2016 Summer Olympics in Rio de Janeiro, Brazil, Jones regularly live-tweeted events and posted videos of her reactions.[32][33] Enthusiasm for Jones' commentary grew, with articles appearing like The Huffington Post's \"Watching Leslie Jones Watch The Olympics Is Better Than The Actual Olympics\".[34] Television producer Mike Shoemaker, one of Jones' Twitter followers, posted on Twitter that his friend Jim Bell, NBC's executive producer of the network's Olympics coverage, should add Jones to NBC's team of commentators covering the Games; Bell responded on Twitter the next day asking Jones to join NBC in Rio de Janeiro. She accepted and flew to Rio de Janeiro, covering swimming, track and field, gymnastics, and beach volleyball for NBC.[35]\n\nJones reprised her duties at the 2018 Winter Olympics in South Korea,[36] and live-tweeted again for the postponed 2020 Summer Olympics in Tokyo, Japan.[37] She live-tweeted for the final time for the 2022 Winter Olympics in Beijing, China. She released a message on Twitter stating that this would be the last Olympics that she would live-tweet, claiming broadcaster NBC is pressuring her to stop.[38]\n\nOther projects [ edit ]\n\nJones and fellow comedian Adam DeVine appeared in a 2016 ad campaign for Allstate Insurance, created by Leo Burnett Worldwide.[39]\n\nJones hosted the BET Awards on June 25, 2017.[40] This marked her hosting debut.\n\nIn 2018, Jones appeared in two advertisements for Amazon's Echo Spot.[41]\n\nIn 2020, Jones hosted a Supermarket Sweep reboot. In 2021, she returned for season 2.[42]\n\nJones was the host for the 2021 MTV Movie & TV Awards.[43]\n\nInfluences [ edit ]\n\nJones has cited as her comedic influences Eddie Murphy,[8] Richard Pryor,[5] Carol Burnett,[44] Lucille Ball,[44] John Ritter,[44] and Whoopi Goldberg.[5]\n\nPersonal life [ edit ]\n\nJones is a fan of the soccer team Seattle Sounders FC.[45]\n\nOnline harassment [ edit ]\n\nAfter the release of Ghostbusters in July 2016, Jones became the subject of racist and misogynistic attacks over Twitter. The social media platform responded by taking action against several users, resulting in the permanent banning of user and Breitbart editor Milo Yiannopoulos, who had described Jones as \"barely literate\".[46]\n\nAfter continuing to receive racist comments, Jones temporarily left Twitter on July 18, 2016.[47] She appeared later in the week on Late Night with Seth Meyers, where she discussed the ordeal and her meeting with Twitter CEO Jack Dorsey. In response to Yiannopoulos' claim that he was targeted for being a \"gay conservative\", she argued that \"hate speech and freedom of speech are two different things.\"[48]\n\nA month later, Jones was again subjected to online harassment. Her personal website was hacked, with its contents being replaced with photos of her passport and driver's license.[49] The site was also changed to display alleged nude pictures of her, as well as a video tribute to Harambe, the Cincinnati Zoo gorilla killed in May 2016 (a reference to the racially charged gorilla remarks hurled at Jones in the earlier attack). Her team took the website down soon after it was hacked.[50]\n\nBoth incidents resulted in outpourings of support for Jones from fans and celebrities alike, via the hashtag #LoveForLeslieJ which trended on both Twitter and Instagram.[51] Those who voiced support include Paul Feig,[52] Gabourey Sidibe, Ellen DeGeneres, Sara Benincasa, Ava DuVernay, Hillary Clinton, Corey Taylor,[53] Katy Perry, Octavia Spencer, Anna Kendrick, Lena Dunham,[54] and Loni Love. Jones responded to the hacks on the October 22, 2016 episode of Saturday Night Live.[55]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nReferences [ edit ]", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Leslie_Jones_at_The_Stress_Factory_%2843785886122%29.jpg/220px-Leslie_Jones_at_The_Stress_Factory_%2843785886122%29.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Leslie_Jones_at_The_Stress_Factory_%2843785886122%29.jpg/1200px-Leslie_Jones_at_The_Stress_Factory_%2843785886122%29.jpg", "http://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Leslie_Jones_at_The_Stress_Factory_%2843785886122%29.jpg/1200px-Leslie_Jones_at_The_Stress_Factory_%2843785886122%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Leslie_Jones_(comedian)", "title": "Leslie Jones (comedian)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Leslie_Jones_at_The_Stress_Factory_%2843785886122%29.jpg/640px-Leslie_Jones_at_The_Stress_Factory_%2843785886122%29.jpg", "width": 640, "height": 800}, "title": "Leslie Jones (comedian) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}