{"url": "https://www.thesun.co.uk/fabulous/2296725/pippa-middleton-pregnant-husband-james-matthews-net-worth-old/", "text": "PIPPA Middleton, the younger sister of the Duchess of Cambridge, Kate, is happily married to hedge fund manager James Matthews.\n\nThe couple have just welcomed their second child. Here's what we know about the mum of two...\n\n7 Pippa Middleton is a socialite and sister to Catherine, Duchess of Cambridge Credit: Handout - Getty\n\nWhat is Pippa Middleton's net worth?\n\nPhilippa Middleton, known to most as Pippa, is a socialite, author and columnist.\n\nAccording to some estimates, Pippa's net worth is approximately £1million.\n\nShe is middle child of Michael Middleton and Carole Goldsmith.\n\nHer older sister is Catherine, the Duchess of Cambridge.\n\nPippa's brother, James William Middleton, is an entrepreneur whose company sells cake-making kits for birthdays.\n\nPippa is 37 years old, having been born on September 6, 1983, and served as older sister Kate's maid of honour when she married Prince William in 2011.\n\n7 Philippa Middleton is 37 years old\n\nWhen was Pippa Middleton's second baby born?\n\nPippa gave birth to a baby girl - Grace Elizabeth Jane Matthews - at 4.22am on March 15, 2021.\n\nA source told HELLO! magazine: \"Mother and baby are doing well.\n\n\"She's perfect, everyone is overjoyed at such a happy arrival.\"\n\nIt was revealed Pippa was pregnant with her second child in December.\n\nThe new baby is Carole and Michael Middleton's fifth grandchild.\n\nThey are already grandparents to Pippa's first son Arthur, and Prince William and Kate's three children, Prince George, Princess Charlotte and Prince Louis.\n\n7 Pippa is married to billionaire James Matthews Credit: EPA\n\nWhat does Pippa Middleton do?\n\nPippa graduated from the University of Edinburgh with a degree in English literature, something she later put to use by releasing her own non-fiction book, Celebrate, in 2012.\n\nThe book - which focused on social etiquette and party organising - was a widely ridiculed flop, due to Pippa’s obvious observations such as: “There is something very British about tea” and “put a pitcher of water and glasses on a nearby table or side table.”\n\nPippa also released a cookbook in September 2016.\n\n7 Pippa released a cookbook in September 2016 Credit: PA:Press Association\n\nIn it, she said a home cooked meal was the way to a man's heart.\n\nThe recipe book, called Heartfelt, was produced to raise money for the British Heart Foundation and features more than 100 healthy recipes.\n\nBut Pippa has previously admitted she hasn't cooked all the recipes herself, despite penning the book.\n\nIn 2015, Pippa filmed a series of reports for US talk programme Today.\n\nBut despite being offered £400,000 by the NBC channel, she decided against working full time in the States.\n\nShe was dropped as a columnist for Waitrose Weekend magazine in July 2019 in a radical shakeup of the publication.\n\nPrior to her wedding, she was once voted the Number 1 Society Singleton by Tatler magazine.\n\n7 Pippa has one child with husband James Matthews Credit: The Mega Agency\n\nHow did James Matthews meet Pippa Middleton?\n\nJames Matthews, 45, is a hedge fund manager and is also the older brother of former Made In Chelsea star Spencer Matthews.\n\nHe first met Pippa back in 2007 while at the luxury Eden Rock hotel on the Caribbean island of St Barts, which is owned by his parents.\n\nAfter dating English cricket player Alex Loudon, Pippa went on a series of dates with James in 2012.\n\nBut in 2013, Pippa was pictured holding hands with stockbroker Nico Jackson. Their relationship lasted more than two years before they split.\n\nAfter reports surfaced of their break-up in 2015, Pippa was seen leaving James' house.\n\nThen, in early 2016, James and Pippa went to a charity event together and were photographed on a ski trip.\n\nHe caught her off-guard by popping the question to her in July 2016, less than a year into their relationship.\n\nJames proposed with the hefty octagonal diamond ring, which comes with a central 4-carat Asscher-cut diamond stone, and a price tag to rival sister Kate’s own luxury ring.\n\n7 Pippa Middleton holds a bouquet of lilies, peonies and sweet peas from the same London florist as her sister Credit: AP:Associated Press\n\nWhen did James Matthews and Pippa Middleton get married?\n\nPippa Middleton became Mrs Pippa Matthews on May 20, 2017.\n\nThe pair enjoyed a relaxed but lavish intimate ceremony at her local church, St Mark’s Church in Englefield.\n\nWe showcased pictures of the stunning venue, which is just six miles from where the Middletons grew up.\n\nThe party was held at her parents’ £5million home in nearby Bucklebury, Berks.\n\nA £100,000 marquee was erected at the Grade II Listed location, as the bride-to-be was determined to keep the rain off her guests.\n\nIt was also revealed that guests were treated to a Spitfire fly-by.\n\nIt is estimated the society wedding of the year cost £250,000 – ten times the UK average - and that the ceremony took place in front of 350 guests.\n\n7 Pippa showed off her growing baby bump during her first pregnancy at the 2018 French Open Credit: Getty - Contributor\n\nHow many children do they have?\n\nPippa and James have one child - with another on the way.\n\nMum Carole confirmed the pregnancy on March 4, 2021.\n\nOn October 15, 2018, Pippa gave birth to the couple's son weighing 8lb 9oz at the Lindo Wing.\n\nPippa and James named their firstborn Arthur Michael William Matthews.\n\nThe second name is of significance as not only is it Pippa's father's name but it also belonged to James' younger brother who died in a tragic mountaineering accident on Everest in 1999, just after becoming the youngest British man to climb to its peak.", "images": ["data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.7 1\"%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1.3 1\"%3E%3C/svg%3E", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 1 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead.svg", "https://www.thesun.co.uk/wp-content/uploads/2022/06/COMP-KE-TWIN-UP-PIPPA.jpg?strip=all&w=300&h=192&crop=1", "https://www.thesun.co.uk/wp-content/uploads/2022/04/crop-18355600.jpg?strip=all&w=300&h=192&crop=1", "https://www.thesun.co.uk/wp-content/uploads/2016/12/nintchdbpict000253188217-e1530799905984.jpg?crop=0px%2C0px%2C1183px%2C789px&resize=1920%2C1080", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.5 1\"%3E%3C/svg%3E", "https://www.thesun.co.uk/wp-content/uploads/2022/09/OFF-LI-MATT.jpg?strip=all&w=300&h=192&crop=1", "https://www.thesun.co.uk/wp-content/uploads/2022/06/COMP-OMF-48.jpg?strip=all&w=300&h=192&crop=1", "https://www.facebook.com/tr?id=752905198150451&ev=PageView&noscript=1", "https://www.thesun.co.uk/wp-content/themes/thesun/images/sunmasthead_mobile.svg", "data:image/svg+xml,%3Csvg xmlns=\"http://www.w3.org/2000/svg\" viewBox=\"0 0 0.6 1\"%3E%3C/svg%3E"], "top_img": "https://www.thesun.co.uk/wp-content/uploads/2016/12/nintchdbpict000253188217-e1530799905984.jpg?crop=0px%2C0px%2C1183px%2C789px&resize=1920%2C1080", "keywords": [], "authors": ["Tilly Pearce", "Mared Parry"], "canonical_link": "https://www.thesun.co.uk/fabulous/2296725/pippa-middleton-net-worth-husband-james-matthews/", "title": "What is Pippa Middleton’s net worth?", "meta_data": {"twitter": {"card": "summary_large_image", "site": "@thesun"}, "robots": "noarchive,noodp,max-image-preview:large", "taboola": {"kicker": "PIP PIP HOORAY", "headline": "Pippa Middleton's net worth and when her second baby is due", "image": {"medium": "https://www.thesun.co.uk/wp-content/uploads/2021/03/NINTCHDBPICT000505170805.1200x800.jpg?strip=all&quality=100&w=300&h=192&crop=1", "large": "https://www.thesun.co.uk/wp-content/uploads/2021/03/NINTCHDBPICT000505170805.1200x800.jpg?strip=all&quality=100&w=620&h=413&crop=1"}}, "parsely-post-id": 2296725, "google-site-verification": "C0q6rLPIDXHU7PcyZ9CmiFRLM46bbWgS4qxZ-woBItM", "msvalidate.01": "E4359034FA254151A3AB2EFAC6D20D80", "p": {"domain_verify": "c061a8052bd9e93315b7f01447fa4124"}, "og": {"type": "article", "title": "What is Pippa Middleton's net worth?", "url": "https://www.thesun.co.uk/fabulous/2296725/pippa-middleton-net-worth-husband-james-matthews/", "description": "PIPPA Middleton, the younger sister of the Duchess of Cambridge, Kate, is happily married to hedge fund manager James Matthews. The couple have just welcomed their second child. Here’s what w…", "site_name": "The Sun", "image": {"identifier": "https://www.thesun.co.uk/wp-content/uploads/2016/12/nintchdbpict000253188217-e1530799905984.jpg?crop=0px%2C0px%2C1183px%2C789px&resize=1920%2C1080", "width": 1920, "height": 1080}, "locale": "en_GB"}, "article": {"published_time": "2021-03-15T17:15:24+00:00", "modified_time": "2021-03-15T17:53:17+00:00", "publisher": 161385360554578, "tag": "Pippa Middleton, Explainers, Net worths, Pippa Middleton's wedding, Royal Family", "author": "https://www.facebook.com/Fabulous/", "content_tier": "free"}, "fb": {"app_id": 144647118961553, "pages": 8401947179}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no, width=device-width, viewport-fit=cover", "description": "PIPPA Middleton, the younger sister of the Duchess of Cambridge, Kate, is happily married to hedge fund manager James Matthews.The couple have just we", "msapplication-TileImage": "https://www.thesun.co.uk/wp-content/uploads/2016/04/icon-e1459786005667.png?strip=all&w=270"}, "movies": [], "publish_date": 1615828524.0, "source": "https://www.thesun.co.uk", "summary": ""}