{"url": "https://www.stoptheclot.org/news/national-womens-health-week-2018/", "text": "May 7, 2018\n\nBirth Control and Blood Clots: Know Your Risk\n\nThere are more than 60 million women of child-bearing age in the United States, and the majority of them report using some form of birth control. In fact, the birth control pill is their number one choice. While research shows that the birth control pill is safe and effective, the pill can carry risks like any other prescription medication. It is important for women to know their risks for blood clots, and to understand their options for birth control.\n\nOne risk associated with birth control pills – or any form of hormonal birth control that contains estrogen, including the pill, patch, or ring – is a deadly blood clot. The use of birth control pills with estrogen increases a woman’s risk for blood clots three-fold, and some of the newer birth control pills women use pose a risk two-times greater than older birth control pills. The use of patches and rings containing estrogen poses a risk double that of birth control pills. Women with a clotting disorder, a previous blood clot, or a family history of blood clots are at an even greater risk for blood clots.\n\nJoin the National Blood Clot Alliance (NBCA) during National Women’s Health Week (NWHW), May 13-19, 2018, as we work together with the Alexandra L. Rowan Memorial Foundation to provide women with life-saving information about birth control and blood clots, and to help them determine, along with their doctor, their risk for blood clots and their best birth control options. Together, we are encouraging women to visit Women & Blood Clots for more information about birth control and blood clots. Even if you are a woman at risk for blood clots, it is still possible for you to plan your family as you choose, by understanding your risk for blood clots and taking these simple steps to reduce your risk:\n\nLearn more about birth control and blood clot risks by visiting Women & Blood Clots\n\nComplete the Risk Assessment and discuss their results and birth control options with their doctor\n\nTalk to their doctor about any personal or family history of blood clots, and their existing risk for blood clot\n\nEach year, up to 900,000 people are affected by blood clots, and about 100,000 people will die because of blood clots. However, many of these deaths can be prevented simply by sharing life-saving information. Women in particular face specific risks for blood clots that span their entire lives. In addition to the risk for blood clots connected to hormonal birth control, women are also at risk during pregnancy and childbirth, and when estrogen is used in the treatment of menopause symptoms later in life.\n\nTo learn more about women and blood clot risks, signs and symptoms, and prevention, please visit and share www.womenandbloodclots.org.\n\nWhat is Women’s Health Week?\n\nNational Women’s Health Week is a special observance led by the U.S. Department of Health and Human Services Office on Women’s Health. The goal is to empower women to make their health a priority. The week also serves as a time to help women understand what steps they can take to improve their health throughout the entire year. National Women’s Health Week kicks off on Mother’s Day, May 13, and is celebrated through May 19, 2018.\n\nNew this Year: Women and Blood Clots on Twitter\n\nTweet, Tweet: NBCA is excited to announce the launch of our brand new Women & Blood Clots Twitter account, where we will share important content singularly focused on information, news, and stories specific to women’s health and blood clots. Follow Women & Blood Clots on Twitter here, and start tweeting with us today about this important topic. Be sure to use the National Women’s Health Week hashtag #NWHW in your tweets.\n\nHelp NBCA Raise Awareness About Blood Clots During NWHW\n\nGet Social: Connect with NBCA on Facebook, Instagram, Pinterest, and our main Twitter account, where we will be sharing special content related to women and blood clots each day during National Women’s Health Week, including new graphics that will feature the personal stories of women who have been directly affected by blood clots. You can help make a difference by sharing our posts, tweets, pictures, and pins with your friends and family.\n\nMake Some Noise: Are you on Facebook or Twitter? NBCA has partnered with the social media sharing platform Thunderclap to deliver one, unified, life-saving message across the social media sites you use every day. Our message seeks to alert women – and the men who care about them – about how hormonal birth control can place them at risk for a deadly blood clot. Click here to be safely directed to Thunderclap and sign up to be a part of this social media sharing initiative, which will automatically update the social media status of your preference on the day the message goes out, May 17, 2017, at 12:30 pm, Eastern. Like any message, the more individuals who come together to share it, the better the message is heard.\n\nConnect with Your Peers: Chat with other people who have experienced a blood clot in NBCA’s peer-to-peer discussion community, powered by Inspire. Our community is continually growing, and now has almost 3,000 members. Join a safe space on the web to talk about your experiences with people who understand.\n\nPlease contact the National Blood Clot Alliance Communications Department via email at info@stoptheclot.org if you have any questions or comments about National Women’s Health Week 2018.", "images": ["data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20247%20207'%3E%3C/svg%3E", "https://www.stoptheclot.org/wp-content/uploads/fly-images/17199/shirt-sneakers-300x200-c.jpg", "https://www.stoptheclot.org/wp-content/themes/stoptheclot/images/donate-btn.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20800%20800'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20282%2046'%3E%3C/svg%3E", "https://www.stoptheclot.org/wp-content/uploads/2017/04/women-blood-clots-glow-logo-300x49.png", "https://www.stoptheclot.org/wp-content/uploads/fly-images/23504/Race-to-STC-Header-2-300x200-c.png", "https://www.stoptheclot.org/wp-content/uploads/2018/04/NWHW18-General-300x251.png", "https://www.facebook.com/tr?id=176722862910201&ev=PageView&noscript=1", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20300%20200'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%2048%2048'%3E%3C/svg%3E", "https://www.stoptheclot.org/wp-content/uploads/2018/04/National-Womens-Health-Week-2018-Graphics.png", "https://pbs.twimg.com/profile_images/969013581441220608/yA_-r9Pv_normal.jpg", "https://www.stoptheclot.org/wp-content/uploads/2018/04/Take-Action-Now-1-300x251.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20249%20209'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20286%20239'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20132%20131'%3E%3C/svg%3E", "https://www.stoptheclot.org/wp-content/uploads/2018/04/NWHW18-Photo-Circles-300x251.png"], "top_img": "https://www.stoptheclot.org/wp-content/uploads/2018/04/National-Womens-Health-Week-2018-Graphics.png", "keywords": [], "authors": [], "canonical_link": "https://www.stoptheclot.org/news/national-womens-health-week-2018/", "title": "Celebrate & Share During National Women’s Health Week", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Join the National Blood Clot Alliance during National Women’s Health Week, May 13-19, 2018, as we work together with the Alexandra L. Rowan Memorial Foundation to provide women with life-saving information about birth control and blood clots.", "og": {"locale": "en_US", "type": "article", "title": "Celebrate & Share During National Women's Health Week - Blood Clots", "description": "Join the National Blood Clot Alliance during National Women’s Health Week, May 13-19, 2018, as we work together with the Alexandra L. Rowan Memorial Foundation to provide women with life-saving information about birth control and blood clots.", "url": "https://www.stoptheclot.org/news/national-womens-health-week-2018/", "site_name": "Blood Clots", "image": {"identifier": "https://www.stoptheclot.org/wp-content/uploads/2018/04/National-Womens-Health-Week-2018-Graphics.png", "width": 800, "height": 800, "type": "image/png"}}, "article": {"publisher": "https://www.facebook.com/stoptheclot", "modified_time": "2019-08-06T16:21:45+00:00"}, "twitter": {"card": "summary_large_image", "site": "@StoptheClot", "label1": "Est. reading time", "data1": "5 minutes"}, "generator": "Performance Lab 1.5.0; modules: site-health/audit-autoloaded-options, site-health/audit-enqueued-assets, site-health/webp-support, object-cache/persistent-object-cache-health-check", "msapplication-TileImage": "https://www.stoptheclot.org/wp-content/uploads/2018/05/cropped-favicon-270x270.png", "facebook-domain-verification": "ps0f1lzhlhd6ohq17zvazqmq5kecag"}, "movies": [], "publish_date": null, "source": "https://www.stoptheclot.org", "summary": ""}