{"url": "https://www.celebritynetworth.com/richest-celebrities/actors/amanda-seyfried-net-worth/", "text": "What is Amanda Seyfried's Net Worth?\n\nAmanda Seyfried is an American actress, singer, and former model who has a net worth of $16 million. Seyfried began her career as a child model, then focused on acting, landing a recurring role on the soap opera \"As the World Turns\" in 1999. She has since transformed into a critically acclaimed actress of film and television. In 2021 she was nominated for a Best Supporting Actress Academy Award for her portrayal of Marion Davies in \"Mank.\" In 2022 she received rave reviews for her portrayal of Elizabeth Holmes in the Hulu series \"The Dropout.\"\n\nShe made her big screen debut in 2004, playing Karen Smith in \"Mean Girls\" which grossed $130 million at the box office. Amanda starred on the HBO drama \"Big Love\" from 2006 to 2011, and she has appeared in more than 30 feature films, including \"Mamma Mia!\" (2008) and its 2018 sequel, \"Les Misérables\" (2012), \"A Million Ways to Die in the West\" (2014), and \"Ted 2\" (2015). Moviefone included Seyfried on their \"25 Under 25: Hollywood's Hottest Young Stars\" list in 2008, 2009, and 2010, and \"Glamour\" magazine ranked her the third-most glamorous woman of 2010. \"People\" magazine featured Amanda in their \"Most Beautiful\" issues in 2009 and 2010, and she was ranked #1 on their \"25 Beauties (and Hotties) at 25\" list in 2011.\n\nEarly Life\n\nAmanda Seyfried was born Amanda Michelle Seyfried on December 3, 1985, in Allentown, Pennsylvania. She grew up with mother Ann (an occupational therapist), father Jack (a pharmacist), and older sister Jennifer, and began modeling when she was 11 years old. Amanda graced the covers of Francine Pascal's book series \"The Victoria Martin Trilogy\" and appeared in campaigns for The Limited Too with Leighton Meester, who would go on to star in \"Gossip Girl.\" As a teenager, she studied opera and attended William Allen High School, graduating in 2003; she had planned on attending Fordham University in New York City, but decided not to go after she was cast in \"Mean Girls.\"\n\nCareer\n\nIn 1999, Seyfried was cast as Lucy Montgomery on CBS' \"As the World Turns.\" She stayed with the soap opera until 2001, appearing in 27 episodes, then guest-starred on 5 episodes on ABC's \"All My Children\" in 2003. In 2004, she found success as Karen Smith in \"Mean Girls,\" which was written by \"Saturday Night Live's\" Tina Fey and co-starred Lindsay Lohan, Rachel McAdams, and Lacey Chabert. That year, Amanda also guest-starred on \"Law & Order: Special Victims Unit\" and began starring on \"Veronica Mars\" as the titular teen detective's murdered best friend; she appeared in 11 episodes between 2004 and 2006. During this period, she also guest-starred on \"House,\" \"Wildfire,\" \"CSI: Crime Scene Investigation,\" and \"Justice\" and appeared in the films \"Nine Lives,\" \"American Gun,\" and \"Alpha Dog.\" In 2006, Seyfried began playing Sarah Henrickson, a member of a polygamous Mormon family, on \"Big Love,\" appearing in 44 episodes during the Emmy-nominated show's run.\n\nWhile starring on \"Big Love,\" Amanda filmed several movies, including \"Jennifer's Body\" (2009), \"Dear John\" (2010), and \"Letters to Juliet\" (2010). In 2008, she co-starred with Meryl Streep in \"Mamma Mia!,\" which featured the songs of ABBA and brought in $615.7 million at the box office. The sequel, \"Mamma Mia! Here We Go Again,\" was also a success with a worldwide gross of $395 million, and Seyfried appeared on the soundtracks for both films (as well as the soundtracks for \"Dear John,\" \"Red Riding Hood,\" and \"Les Misérables\"). In 2011, Amanda played the lead role in \"Red Riding Hood\" and teamed up with Justin Timberlake in the science fiction film \"In Time,\" then starred in the film adaptation of her favorite musical, \"Les Misérables,\" as Cosette. The film earned $441.8 million at the box office and won dozens of awards.\n\nIn 2013, Amanda voiced Mary Katherine \"M.K.\" Bomba in the computer-animated film \"Epic\" and played adult film actress Linda Lovelace in \"Lovelace,\" and the following year, she co-starred with Charlize Theron, Neil Patrick Harris, and Liam Neeson in Seth MacFarlane's \"A Million Ways to Die in the West.\" In 2015, she reunited with McFarlane for \"Ted 2\" and appeared in \"Pan,\" \"Love the Coopers,\" and \"Fathers and Daughters.\" Since then, Seyfried has starred in several films, including \"The Last Word\" (2017), \"The Art of Racing in the Rain\" (2019), and \"You Should Have Left\" (2020), and she voiced Daphne in the most recent Scooby-Doo film, \"Scoob!\" Amanda is also set to appear in \"A Mouthful of Air,\" \"Things Heard and Seen,\" and \"Mank.\"\n\nIn 2022 Amanda starred as Elizabeth Holmes in the Hulu series \"The Dropout.\" The show was a critical and commercial hit, with Amanda receiving rave reviews for her portrayal of Holmes.\n\nPersonal Life\n\nAmanda was in a relationship with Dominic Cooper, her \"Mamma Mia!\" co-star, from 2008 until 2010, and she dated actor Justin Long from 2013 to 2015.\n\nShe began a relationship with Thomas Sadoski, her co-star in \"The Last Word,\" in 2016, and they wed on March 12, 2017. The couple welcomed daughter Nina on March 21, 2017. They welcomed a son in September 2020.\n\nIn 2018, Amanda and Thomas joined the board of INARA (International Network for Aid, Relief and Assistance), a non-profit organization that helps injured refugee children. Seyfried has suffered from panic attacks, anxiety, and obsessive-compulsive disorder throughout her life, and until 2015, she refused to perform in stage productions due to stage fright.\n\nAwards and Nominations\n\nIn 2005, Amanda won a Best Actress award at the Locarno International Film Festival for \"Nine Lives\" and shared an MTV Movie Award for Best On-Screen Team with her \"Mean Girls\" castmates. In 2010, she was named Breakthrough Female Star of the Year at the ShoWest Awards and received the Best Scared-As-Shit Performance award at the MTV Movie Awards. The cast of \"Les Misérables\" earned Best Ensemble awards from the National Board of Review of Motion Pictures, the Satellite Awards, and the Awards Circuit Community Awards as well as nominations from the Screen Actors Guild Awards and the San Diego Film Critics Society Awards.\n\nIn 2021 she was nominated for a Best Supporting Actress Academy Award for her work in the film \"Mank.\"\n\nReal Estate\n\nIn 2010, Amanda paid $1.7 million for a 1,585 square foot condo in NYC's Greenwich Village. She listed this property for sale in April 2022 for $3.25 million.\n\nIn 2019 she paid $2.5 million for an Upper West Side condo.\n\nIn 2011 she bought a home in the Beachwood Canyon area of Los Angeles from her \"Jennifer's Body\" co-star Adam Brody for $1.85 million. Seyfried also owns a rustic farmhouse in the Catskills that includes a barn (which has been turned into a guesthouse) and a stable for her goats and horses.", "images": ["https://vz.cnwimg.com/wp-content/uploads/2010/12/Amanda-Seyfried.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://vz.cnwimg.com/wp-content/uploads/2010/03/Amanda-Seyfried-1.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2010/12/Amanda-Seyfried.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/amanda-seyfried-net-worth/", "title": "Amanda Seyfried Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Amanda Seyfried is an American actress, singer, and former model who has a net worth of $16 million. Seyfried began her career as a child model, then focused on acting, landing a recurring role on the soap opera \"As the World Turns\" in 1999.", "cnw_share_fb_count": 93, "cnw_share_tw_count": 46, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Amanda Seyfried Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/amanda-seyfried-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/12/Amanda-Seyfried.jpg", "site_name": "Celebrity Net Worth", "description": "Amanda Seyfried is an American actress, singer, and former model who has a net worth of $16 million. Seyfried began her career as a child model, then focused on acting, landing a recurring role on the soap opera \"As the World Turns\" in 1999."}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2022-04-09T14:05:11+00:00", "published_time": "2020-08-07T19:29:17+00:00", "section": "Actors", "tag": "richest actors"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/12/Amanda-Seyfried.jpg", "title": "Amanda Seyfried Net Worth", "description": "Amanda Seyfried is an American actress, singer, and former model who has a net worth of $16 million. Seyfried began her career as a child model, then focused on acting, landing a recurring role on ..."}}, "movies": [], "publish_date": 1596828557.0, "source": "https://www.celebritynetworth.com", "summary": ""}