{"url": "https://www.teenvogue.com/gallery/grownish-costume-designer-michelle-cole-interview", "text": "Teen Vogue: grown-ish has definitely taken off and it was renewed for a second season, which is so exciting. How are you feeling about the show’s popularity? Was this something you expected?\n\nMichelle Cole: I’m extremely proud of it. For me personally when I’m doing a show at all — and I’ve been doing this for about thirty-five years — I don’t do a show thinking about what will happen next. I’m always thinking, “How can I do my job?” And I think that has worked well for me, as I’m always giving it one hundred and twenty percent. Fortunately, most of the pilots I’ve worked on have been picked up, but I do it because I enjoy it and I have a love for it. Even if this hadn’t been picked up, I know it would have still looked great. When we were doing the pilot, we were under a little bit of pressure because we were shooting it in four days and we had a lot of setup. And we didn’t quite know the show because we were trying to figure out characters. Every week, you’re trying to develop your characters because every week you get that script that reveals them a little bit more. It’s like dating. The exciting part is that I’m unfolding these different layers of different characters. With Zoey, coming from her parents' home and going to college, we’re seeing her blossom in front of us. When she was on black-ish, she had her other siblings that she was with, but we’re getting to see her blossom on her own in this show. I’m extremely proud of our hard work. Hair and makeup make me look great and I give them a huge shout out because they make the outfits look as I’d like to call it “mo’ better”. And Yara has a lot of input. I didn’t know what to expect, but I know what I expected from me and my team.\n\nTV: It’s one of my favorite new shows, so I’d say all your hard work has absolutely paid off.\n\nMC: And that’s the good part! It pretty much always pays off because whether it’s good or bad, it’s a learning process. Did we know it was going to be so big? Well, I think the best surprise is how successful it is.\n\nTV: And what you said before about black-ish, how Zoey has grown up and that transition going off on her own at school, I’m wondering how you approached that. She’s definitely taking more style risks and it’s noticeable, but it still feels like her. How are you approaching the different phases of her life?\n\nMC: We did a lot of boards on each character and Yara does have a lot of input on how she feels. I’ve also known her since the pilot, when she was fourteen years old. I’ve seen in her own life and how she approaches style personally. When we see her take off to college in the first episode, she tells her father to get a life and that she’s on her own. She hangs up on him and I think we see her start to take these risks. She’s always had beautiful clothes and it’s always been great fun to dress Zoey because she was already very stylish on black-ish. But here she’s grown-up. She’ll wear a robe with a Sade t-shirt underneath and then a scarf and big hoop earrings. We did take a bit more risks with a Gucci loafer and Zara PJ outfit, which was one of my favorites. I love that when she gets up in the morning that she doesn’t really think about it: she just puts it on. She wears what she feels like wearing that day. She’ll go from a sweater with a cotton blouse underneath to a fake fur, jeans, and some boots the next time we see her. We feature a lot of wonderful, big brand names, but it’s more about her look and her style. We like mixing it up. Her risk is showing that she’s growing up. When you see her in the first scenes of the show, she’s trying on different tops when she’s going to her night class. She ends up going with a sweatshirt.\n\nWe also start to see her in really cute dresses coming up. We’ve started to show her legs and her shape in some of these outfits, which we didn’t do on black-ish. She’s in college, so that’s a transition. Her mother is played by Tracee Ellis Ross, so come on. She dresses amazing on black-ish and is wearing all these great clothes as well, so of course she has style when she comes from two fashionable parents on the show. It’s Zoey putting her own look together now. She doesn’t have her parents: it’s just her. And she depends on herself to get the right look.", "images": ["https://assets.teenvogue.com/photos/632c858b34ed4e1e15fc9eb0/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://assets.teenvogue.com/photos/5a84abfe0853d54aeb731201/16:9/w_2580,c_limit/yara-fb.jpg", "https://www.teenvogue.com/verso/static/teen-vogue/assets/logo.ba28e9df68104824291913727893bf4aaf22e564.svg", "https://assets.teenvogue.com/photos/5a847122adfa794183b57470/master/w_320%2Cc_limit/147945_4042.jpg", "https://assets.teenvogue.com/photos/5a846d9ec98c2d46de010826/master/w_320%2Cc_limit/147945_3777.jpg", "https://www.teenvogue.com/verso/static/teen-vogue/assets/logo-reverse.c9fd2ea81f6f84a7d604882e3d5f7ab119aeee5a.svg", "https://assets.teenvogue.com/photos/5a8470e3c98c2d46de010828/master/w_320%2Cc_limit/147945_3466.jpg", "https://assets.teenvogue.com/photos/63220c643a185ccd16675aab/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://assets.teenvogue.com/photos/6321e445a0f6f5da88ae8667/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://assets.teenvogue.com/photos/63237745c9f3a82503992bf6/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://assets.teenvogue.com/photos/5a847ad0c98c2d46de01082a/master/w_320%2Cc_limit/147945_4206.jpg"], "top_img": "https://assets.teenvogue.com/photos/5a84abfe0853d54aeb731201/16:9/w_2580,c_limit/yara-fb.jpg", "keywords": [], "authors": ["Condé Nast", "Faith Cummings"], "canonical_link": "https://www.teenvogue.com/gallery/grownish-costume-designer-michelle-cole-interview", "title": "grown-ish Costume Designer Michelle Cole Talks Style, Inspiration and Career Advice", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "width=device-width, initial-scale=1", "referrer": "no-referrer-when-downgrade", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2022", "description": "In an exclusive interview, grown-ish costume designer Michelle Cole talks style, inspiration and career advice ahead of Zoey's fellowship at Teen Vogue.", "id": "5a8467020853d54aeb7311e8", "keywords": "grownish,yara shahidi,michelle cole,fashion, style", "news_keywords": "grownish,yara shahidi,michelle cole,fashion, style", "robots": "index, follow, max-image-preview:large", "content-type": "gallery", "parsely-post-id": "5a8467020853d54aeb7311e8", "parsely-metadata": "{\"description\":\"In an exclusive interview, grown-ish costume designer Michelle Cole talks style, inspiration and career advice ahead of Zoey's fellowship at Teen Vogue.\",\"image-16-9\":\"https://assets.teenvogue.com/photos/5a846d9ec98c2d46de010826/16:9/w_1000,c_limit/147945_3777.jpg\",\"image-1-1\":\"https://assets.teenvogue.com/photos/5a846d9ec98c2d46de010826/1:1/w_1000,c_limit/147945_3777.jpg\"}", "og": {"description": "Michelle Cole spills all, ahead of Zoey's return to Teen Vogue for a dream fellowship.", "image": "https://assets.teenvogue.com/photos/5a84abfe0853d54aeb731201/16:9/w_2580,c_limit/yara-fb.jpg", "site_name": "Teen Vogue", "title": "The grown-ish Costume Designer Draws Inspiration from HBCU Street Style", "type": "article", "url": "https://www.teenvogue.com/gallery/grownish-costume-designer-michelle-cole-interview"}, "article": {"content_tier": "free", "opinion": "false", "section": "tags", "published_time": "2018-02-14T21:37:16.483Z", "modified_time": "2018-02-14T21:37:16.483Z", "author": "Faith Cummings"}, "twitter": {"card": "summary_large_image", "creator": "@TeenVogue", "description": "Michelle Cole spills all, ahead of Zoey's return to Teen Vogue for a dream fellowship.", "domain": "https://www.teenvogue.com", "image": "https://assets.teenvogue.com/photos/5a84abfe0853d54aeb731201/16:9/w_2580,c_limit/yara-fb.jpg?mbid=social_retweet", "site": "@TeenVogue", "title": "The grown-ish Costume Designer Draws Inspiration from HBCU Street Style"}, "fb": {"app_id": 1013284322017473, "pages": 6636341311}}, "movies": [], "publish_date": 1518644236.483, "source": "https://www.teenvogue.com", "summary": ""}