{"url": "https://people.com/style/best-new-fashion-launches-editors-love/", "text": "01 of 218 Roxy Sister Collection featuring Hailey Bieber and Kelia Moniz There's no one else better to work with than with your best friend! International model Hailey Bieber and pro surfer Kelia Moniz have collaborated with Roxy to debut a swim collection dedicated to empowering and celebrating women. Inspired by the tight-knit bond that the two have, the infamous lifestyle brand created a contemporary, fresh line of staple clothing and swimwear pieced made cater to all shapes and sizes. Make sure you grab yourself (and your BFF!) a swimsuit from this hot new collection for that beach getaway or girls trip coming up. The Sister Collection is available on roxy.com and select shops worldwide.\n\n02 of 218 Roxy Sister Collection featuring Hailey Bieber and Kelia Moniz Buy It! H And K High Leg One-Piece Swimsuit, $90; roxy.com\n\n03 of 218 Roxy Sister Collection featuring Hailey Bieber and Kelia Moniz Buy It! H And K Bra Bikini Top, $50; roxy.com\n\n04 of 218 Roxy Sister Collection featuring Hailey Bieber and Kelia Moniz Roxy Buy It! H And K Mid-Waist Bikini Bottoms, $50; roxy.com\n\n05 of 218 Kim Kardashian West x Carolina Lemke Photography: Mert Alas and Marcus Piggott International eyewear brand Carolina Lemke is making an explosive entrance into the U.S. market with the help of Kim Kardashian West. The trendsetting star, who knows the power of a good pair of sunglasses, teamed up with the label to design her own line of sleek and sporty glasses, which will become available online (starting at just $90!) on March 19.\n\n06 of 218 Erika Jayne x ShoeDazzle Courtesy ShoeDazzle The Real Housewives of Beverly Hills star channeled both her reality show self (Erika Girardi) and her pop star alter ego (Erika Jayne) for a double dose of glam in her latest collection for ShoeDazzle. Whether you’re feeling something fierce (Jayne) or classy (Girardi) Erika personally designed pieces to fit any mood and outfit. Her line of pumps, mules, boots and sandals range from $45 to $63 and are available now. Buy It! Erika Jayne x ShoeDazzle Diamonds are Forever embellished mesh pump, $62.95; shoedazzle.com\n\n07 of 218 Erika Jayne x ShoeDazzle Courtesy ShoeDazzle Buy It! Erika Jayne x ShoeDazzle Power Pointed Toe Pump, $59.95; shoedazzle.com\n\n08 of 218 Erika Jayne x ShoeDazzle Courtesy ShoeDazzle Buy It! Erika Jayne x ShoeDazzle XXPEN$IVE Lace-Up Sandal, $62.59; shoedazzle.com\n\n09 of 218 Erika Jayne x ShoeDazzle Courtesy ShoeDazzle Buy It! Erika Jayne x ShoeDazzle Ca$h Mesh Heeled Sandal, $59.95; shoedazzle.com\n\n10 of 218 Aritzia's New Denim Line Aritzia’s recently-launched in-house line, Denim Forum, is back with its second collection and the styles are just as comfy and flattering as the first. The spring collection is made from organic cottons and Green Screen certified fabric softeners, was designed with a ‘70s flair and uses its special “Best Asset” construction technique to create lift on the backside because who doesn’t want that?\n\n11 of 218 Aritzia's New Denim Line \"Denim Forum\" Courtesy Aritzia Buy It! The \"Bailey\" Crop Flare, $110; aritzia.com\n\n12 of 218 Aritzia's New Denim Line \"Denim Forum\" Courtesy Aritzia Buy It! The Ex Boyfriend Shirt, $88; aritzia.com\n\n13 of 218 Aritzia's New Denim Line \"Denim Forum\" Courtesy Aritzia Buy It! The \"Marianne\" Flare, $110; aritzia.com\n\n14 of 218 Sézane Jewelry Launch The buzzy French fashion brand just launched its first full jewelry line inspired by founder Morgane Sézalory’s own vintage jewelry collection. The earrings, rings, bracelets, necklaces and pendants all come in either solid or plated gold and are designed to wear for years to come.\n\n15 of 218 Sézane Jewelry Launch Courtesy Sézane Buy It! \"Lea\" Earrings, $100; sezane.com\n\n16 of 218 Sézane Jewelry Launch Buy It! \"Louison\" Necklace, $120; sezane.com\n\n17 of 218 Sézane Jewelry Launch Buy It! \"Mona\" Cuff, $160; sezane.com\n\n18 of 218 Target Launches Three New Size Inclusive Brands Colsie: This sleepwear and loungewear line consists of on-trend and versatile designs with nearly 30 loungewear and 20 intimate styles ranging in size from XS-3X and all retailing under $21.99. Auden: Is an intimates line made with every woman and need in mind, consisting of nearly 200 bras in over 40 unique styles and more than 200 underwear options in 50 styles, all retailing for under $22! The collection offers an expansive size range, starting from 32AA to 46G in bras and from XS to 4X in underwear. Stars Above: Created with in extremely comfortable fabrics in soft tones and muted colors, this sleepwear and loungewear line was made with functionality and versatility in mind, perfect for every women of every age and size. The collection consists 125 styles and ranges from XS – 3X with everything retailing for under $21.99.\n\n19 of 218 Colsie Courtesy Target Buy It! Left to right: Oversized Lounge Sweatshirt, $19.99; target.com, Wide Leg Lounge Pants, $16.99; target.com, Sweater T-Shirt, $19.99; target.com, Lounge Sweater Shorts, $16.99; target.com\n\n20 of 218 Auden Courtesy Target Buy It! Left to right: Unlined Balconette Bra, $16.99; target.com, All Over Lace Thong, $6; target.com, Racerback Bralette, $17.99; target.com, Bonded Hipster with Mesh Back, $7; target.com, Unlined Bra, $14.99; target.com, Micro Cheeky with Lace, $7; target.com\n\n21 of 218 Stars Above Courtesy Target Buy It! Left to right, top to bottom: Beautifully Soft Notch Collar Pajama Set, $21.99; target.com, Striped Simply Cool Short Sleeve Button-Up Shirt, $14.99; target.com, Striped Simply Cool Crop Pajama Pants, $16.99; target.com, Striped Perfect Cozy Lounge Sweatshirt, $19.99; target.com, Striped Perfectly Cozy Lounge Jogger Pants, $21.99; target.com\n\n22 of 218 Helen Jon x Draper James Draper James, Reese Witherspoon’s clothing and accessories line, is collaborating with swimwear designer, Helen Jon, to launch the brand’s first-ever swim collection. Staying true to both of their aesthetics, this collaboration combines Draper James’ southern charm with Helen Jon’s reputation for immaculate fit and luxe fabrics. The 20-piece collection includes swimsuits, rash guards, cover-ups and beachside dresses in sizes XS-XL. Starting at $67, you can find all the pieces at draperjames.com and helenjon.com, as well as select swimwear retailers. Buy It! Gingham Island Surf Shirt, $112; draperjames.com & helenjon.com\n\n23 of 218 Helen Jon x Draper James Courtesy Draper James Buy It! Colorblock Shoreline Bra, $110; draperjames.com & helenjon.com, Fold Over Colorblock Hipster, $79; draperjames.com & helenjon.com\n\n24 of 218 Helen Jon x Draper James Courtesy Draper James Buy It! Ruffle Wrap One-Piece, $168; draperjames.com & helenjon.com\n\n25 of 218 Helen Jon x Draper James Courtesy Draper James Buy It! Sisterhood Scoop Back One Piece, $164; draperjames.com & helenjon.com\n\n26 of 218 alice + olivia x SteamLine Luggage Courtesy alice + olivia\n\n27 of 218 alice + olivia x SteamLine Luggage Courtesy SteamLine Luggage Buy It! Staceface Hatbox, $450; aliceandolivia.com & steamlineluggage.com\n\n28 of 218 alice + olivia x SteamLine Luggage Courtesy SteamLine Luggage Buy It! Staceface Vanity, $465; aliceandolivia.com & steamlineluggage.com\n\n29 of 218 alice + olivia x SteamLine Luggage Courtesy SteamLine Luggage Buy It! Staceface Carryon, $895; aliceandolivia.com & steamlineluggage.com\n\n30 of 218 The Clear Cut by Olivia Landau Jewelry Launch The beloved jewelry Instagram account and diamond concierge service has launched its very first collection of diamond jewelry. Founded by fourth generation diamond expert and GIA-graduate gemologist, Olivia Landau, the collection consists of 15 beautiful pieces ranging in various styles from everyday bracelets like this one below, to stunning engagement rings. All pieces are custom-made in NYC and range in price from $375 - $2,550.\n\n31 of 218 The Clear Cut by Olivia Landau Jewelry Launch Courtesy The Clear Cut Buy It! Petite Bezel Studs, $495; theclearcut.co\n\n32 of 218 The Clear Cut by Olivia Landau Jewelry Launch Buy It! Petite Bezel Bracelet, $350; theclearcut.co\n\n33 of 218 The Clear Cut by Olivia Landau Jewelry Launch Courtesy The Clear Cut Buy It! Baby Baguette Ring, $850; theclearcut.co\n\n34 of 218 Herschel Supply's New \"Easy Wear\" Collection Herschel Supply, the brand known for its classic and well-made bags (mostly the beloved backpacks!), is now expanding its functional style offerings with a new clothing category called “Easy Wear.” Continuing to build on the brand’s popular styles, the new collection consists of comfortable knits designed to be your new spring staples, plus comfy pants and classic rainwear options.\n\n35 of 218 Herschel Supply's New \"Easy Wear\" Collection Courtesy Herschel Buy It! \"Voyage\" Wind Jacket, $79.99; herschel.com\n\n36 of 218 Herschel Supply's New \"Easy Wear\" Collection Courtesy Herschel Buy It! Similar: Sweatshirt, $89.99; herschel.com\n\n37 of 218 Herschel Supply's New \"Easy Wear\" Collection Courtesy Herschel Buy It! \"Ashland\" Pants, $99.99; herschel.com\n\n38 of 218 Herschel Supply's New \"Easy Wear\" Collection Courtesy Herschel Buy It! Similar: Fleece Jacket, $149.99; herschel.com\n\n39 of 218 Herschel Supply's New \"Easy Wear\" Collection Courtesy Herschel Buy It! \"Voyage Alta\" Shorts, $74.99; herschel.com\n\n40 of 218 Ban.do’s New Loungewear Collection Courtesy Ban.do The apparel brand just launched its first-ever loungewear collection, aptly named, Leisure Club. It contains eight pieces of super-soft pajamas and roomy tees and sweatshirts to make your next sleep (or Netflix binge) comfy cozy, thanks to the breathable cotton poplin material that gets softer the more you wash it. Buy It! Retro Daisy Sleep Top ($48) and Short ($40); bando.com\n\n41 of 218 Ban.do’s New Loungewear Collection Courtesy Ban.do Buy It! Feelings Sweatshirt, $68; bando.com\n\n42 of 218 Ban.do’s New Loungewear Collection Courtesy Ban.do Buy It! Indigo and Sleepy Pink Sleep Top ($48) and Pant ($50); bando.com\n\n43 of 218 Teva x Herschel Teva, the creator of the original sport sandal, has teamed up with cult-loved backpack and accessories brand, Herschel, for a special limited-edition sandal that merges the best of both brands together. The strappy design is made from the same fabric Herschel uses in its signature backpacks, bringing a sporty addition to the rugged shoe. (This also marks the first time Teva has combined the outsole of their “Hurricane” sandal with the upper crossover straps of the “Alp”.) The sandal is available in men’s, women’s and children sizes and comes in three different colorways.\n\n44 of 218 Teva x Herschel Buy It! Hurricane XLT2 ALP, $120; teva.com\n\n45 of 218 Teva x Herschel Buy It! Hurricane XLT2 ALP Men's, $120; teva.com\n\n46 of 218 Teva x Herschel Buy It! Hurricane XLT2 ALP Men's, $120; teva.com\n\n47 of 218 Good American Good Curve Buy It! Good American Good Curve, $169; goodamerican.com\n\n48 of 218 Khloé Kardashian's New Good American Denim Sizes After two years in the denim market, Khloé Kardashian's Good American brand discovered a major hole in the market. With sizing discrepancies between brands, many women falling between sizes sizes 14 and 16 couldn't find their perfect fit. So Good American just launched size 15 jeans to continue its mission of being both size-inclusive and stylish.\n\n49 of 218 Good American Good Curve Skinny Buy It! Good American Good Curve Skinny, $159; goodamerican.com\n\n50 of 218 Good American Good Curve Buy It! Good American Good Curve, $169; goodamerican.com\n\n51 of 218 Kendall + Kylie for Walmart Kylie Jenner/Instagram The supermodel and the beauty mogul share a joint project in their Kendall + Kylie apparel line - and they're bringing that aesthetic to Walmart at a price point sure to appeal to all their fans.\n\n53 of 218 Westward Leaning X Alexis Bittar You'll be anything but incognito in these head-turning frames, a collaboration between two luxe celeb-loved lines. Jeweler Alexis Bittar added his signature edgy sparkle to Westward Leaning's classic frame shapes for an incredibly glam way to throw shade. Buy It! Westward Leaning x Alexis Bittar, starting at $225; westwardleaning.com\n\n54 of 218 Corinne Foxx x Nasty Gal Courtesy Nasty Gal Corinne Foxx, model and daughter of movie star Jamie Foxx, is making a splash in the fashion industry, from walking the runways in Milan to collaborating with high-profile brands. Now, the 24-year-old rising star is lending her style expertise to a special holiday collection with fast fashion retailer Nasty Gal. \"Nasty Gal was the most online shopping I had ever done, so it's kind of a really full-circle moment for me to be here with them and be a part of this collection,” says Foxx. \"I was shopping them at 18 years old, [after I] had just got my first credit card. My parents were going, 'What is Nasty Gal?' 'What are you ordering?' It's so fun to see how it has evolved, and what pieces I'm now attracted to. It's really just full circle.\" Scroll through to shop some of her favorite picks from the collection!\n\n55 of 218 Corinne Foxx x Nasty Gal Courtesy Nasty Gal Buy It! Back in a Flash Sequin Blazer Dress, $50 orig. $100; nastygal.com\n\n56 of 218 Corinne Foxx x Nasty Gal Courtesy Nasty Gal Buy It! A Kind of Magic Sequin Blazer, $50 orig. $100; nastygal.com\n\n57 of 218 Corinne Foxx x Nasty Gal Courtesy Nasty Gal Buy It! I'm Busy Blazer Dress, $45 orig. $90; nastygal.com\n\n58 of 218 Zero-Waste Public School x Eileen Fisher Eileen Fisher x Public School Highly hyped streetwear brand, Public School, just teamed up with the classically simple and chic sustainable clothing brand Eileen Fisher. The design duo behind Public School, Dao-Yi Chow and Maxwell Osborne, have brought the brand's athletic aesthetic to create a collection of three ready-to-wear designs and a hat, all of which is \"resewn\" and made from recycled Eileen Fisher clothing.\n\n59 of 218 Zero-Waste Public School x Eileen Fisher Eileen Fisher x Public School Downtown-trendy brand Public School and fancy lady-chic brand Eileen Fisher combined their shared love of environmental responbility and design aesthetics for a uniquely cool collection. Buy It! Top and Pants one-of-a-kind; Hat, $125; publicschoolnyc.com\n\n60 of 218 UNIQLO x Alexander Wang Buy It! Ribbed Long-Sleeve Bodysuit, $39.90; uniqlo.com, Ribbed Bikini Shorts, $9.90; uniqlo.com, Ribbed Leggings, $19.90; uniqlo.com, Extra Warm Long-Sleeve Bodysuit, $39.90; uniqlo.com\n\n61 of 218 UNIQLO x Alexander Wang Buy It! Ribbed Sleeveless Top, $14.90; uniqlo.com, Ribbed Leggings, $19.90; uniqlo.com, Bra, $19.90; uniqlo.com, Ribbed Bikini Shorts, $9.90; uniqlo.com\n\n62 of 218 UNIQLO x Alexander Wang Courtesy Uniqlo Alexander Wang brings his signature esthetic to Uniqlo with a line of undergarments made from HeatTech material, which is a technology that generates heat from the body. “UNIQLO are the ideal partners for this collection of innerwear because we share an appreciation of functionality and utilitarianism,\" says Wang. The collection features a variety of tops, bodysuits, bras, leggings and underwear in gray, black, white, tan and neon green and it's available in regular and extra-warm varieties.\n\n63 of 218 Kevin Hart x Tommy John Courtesy Tommy John Actor Kevin Hart has teamed up with underwear brand Tommy John on a new range of men's undergarments and T-Shirts. “I always want to push boundaries and accomplish things that haven’t been done before,\" Hart told PEOPLE of his collaboration with the label. \"I told Tommy John that I wanted to design something unique, something that shows off my elevated personal style.\" The comedian chose to incorporate both rose gold and camo into his \" crazy comfortable collection\" of underwear and tees to make the line stand out. \"I believe that when you’re comfortable you can accomplish anything,\" Hart adds. Scroll through to shop pieces from his collection!\n\n64 of 218 Kevin Hart x Tommy John Courtesy Tommy John Buy It! Second Skin Crew Neck Tee, $55; tommyjohn.com, Go Anywhere French Terry Tapered Pant, $148; tommyjohn.com\n\n65 of 218 Kevin Hart x Tommy John Courtesy Tommy John Buy It! Second Skin V-Neck Tee, $55;tommyjohn.com, Go Anywhere Boxer Brief, $34; tommyjohn.com, Second Skin Trunk, $35; tommyjohn.com\n\n66 of 218 Jason Wu x ELOQUII JASON WU X ELOQUII American designer, Jason Wu, who is known for his clean and elevated feminine aesthetic and empowering women through his collections, has teamed up with Eloquii, a brand that caters to women size 14\" and up, to create a holiday ready capsule. Consisting of party ready tea-length dresses, classic LBDs and gorgeous sequin designs, the collection offers a variety of pieces perfect for any special event. Shop some of our favorites right here.\n\n67 of 218 Splendid x Margherita Missoni Holiday 2018 Capsule Collection SPLENDID X MISSONI Fashion industry heiress Margherita Missoni is bringing her family's famed Italian brand to the fast fashion market via this playful collaboration with casual retailer Splendid. The labels have partnered to create a one-of-a kind holiday collection. The line features ready-to-wear pieces spanning from formal dresses to cozy joggers and tees with an accessible price point ranging from $45 to $248. Scroll through to shop some of our favorite picks!\n\n68 of 218 Jason Wu x ELOQUII JASON WU X ELOQUII Buy It! One Shoulder Sequin Gown, $189.95; eloquii.com, Asymmetrical One Shoulder Dress, $119.95; eloquii.com, Tux Blazer, $119.95; eloquii.com, Tux Pant, $89.95; eloquii.com\n\n69 of 218 Jason Wu x ELOQUII JASON WU X ELOQUII Buy It! Belted Coat Dress, $259.95; eloquii.com, Sequin Wrap Gown, $179.95; eloquii.com, Crepe Embellished Fit and Flare Dress, $189.95; eloquii.com\n\n70 of 218 Splendid x Margherita Missoni Holiday 2018 Capsule Collection SPLENDID X MISSONI Buy It! Similar: Dolce Vita Turtleneck, $98; splendid.com, Veluto Dress, $168; splendid.com, Velluto Daisy Jogger, $158; splendid.com\n\n71 of 218 Wrangler Bohemian Rhapsody Collection Courtesy Wrangler Queen’s getting a movie… and a fashion collaboration! Just in time for the release of Bohemian Rhapsody, the Queen biopic of lead singer Freddie Mercury, Wrangler and Lyric Culture teamed up to create a collection inspired by the band’s charismatic lead singer, who famously wore Wrangler jeans on stage in the ‘80s. The collection consists of jeans, denim jackets, T-shirts and sweatshirts with his famous lyrics incorporated into each piece. Buy It! Don't Stop Me Now Pleated Denim Jacket, $159wrangler.com\n\n72 of 218 Wrangler Bohemian Rhapsody Collection Buy It! Dark Wash Slim Fit Jean, $99; wrangler.com\n\n73 of 218 Wrangler Bohemian Rhapsody Collection Buy It! Killer Queen Cut-Off Tank, $39; wranger.com We Are The Champions Sweatshirt, $59; wrangler.com\n\n74 of 218 NFL Lifestyle Collection Regular season football may be coming down the final stretch, but that’s still plenty of time to gear up in support of your favorite team. For the NFL’s 18-19 season lifestyle collection, the league has released another series of fashion and home items. And for female fans, hoodies, tees and other pieces are getting the celebrity treatment, as Alyssa Milano has returned to partner with the brand on another collection of cool clothing. The size-inclusive line also has maternity wear for football fans in the making. Upgrade your sideline style with one of a dozen new looks. Buy It! Throwback Long Sleeve T-Shirt, $44.99; nflshop.com\n\n75 of 218 Draft Me Lace-Up V-Neck T-Shirt Buy It! Draft Me Lace-Up V-Neck T-Shirt, $54.99; nflshop.com\n\n76 of 218 Goal-Line Full-Zip Jacket Buy It! Goal-Line Full-Zip Jacket, $84.99; nflshop.com\n\n77 of 218 Selena Gomez x Puma The multi-hyphenate star launches, appropriately, Dec. 12 - the first she has helped design for the brand, and full of the relaxed-cool styles she wears in her everyday life.\n\n78 of 218 Dwyane Wade x The Tie Bar Courtesy the Tie Bar Buy It! (from left) Abbey Florals, $25; thetiebar.com Downton Solid, $25; thetiebar.com Rebel Stripe, $25; thetiebar.com\n\n79 of 218 Dwyane Wade x The Tie Bar Bobby Metelus/Courtesy the Tie Bar The basketball superstar (and new dad!) is celebrating his final NBA season with a \"One Last Dance\" tie collection for the menswear retailer, with three styles inspired by his time playing for the Chicago Bulls, Miami Heat and Cleveland Cavaliers.\n\n80 of 218 Lululemon x SoulCycle Both known for their cult following, athleticwear brand Lululemon and fitness spinning empire SoulCycle, have teamed up to bring you a special 20-piece collection inspired by the “energy and passion” of the instructors. Designed specifically with all of the loyal cyclists in mind, these pieces are made with quick-drying Everlux fabric and purposely placed laser cut-outs to keep you cool.\n\n81 of 218 Martha Stewart for Aerosoles Aerosoles Martha Stewart is bringing her stylish eye to Aerosoles with a brand new line of comfortable and versatile boots. \"Whether I’m working in my garden or attending an event, I need shoes that offer support and comfort, and are beautifully designed,\" she said in the release. So with the help of Aerosoles, she's releasing rain boots with an equestrian twist for the holiday season (available for pre-order now). But stay tuned because she has flats, sandals, mules and espadrille wedges in the works for 2019.\n\n82 of 218 Martha Stewart for Aerosoles Aerosoles Buy It! Fairfield knee-high riding boot, $95; aerosoles.com\n\n83 of 218 Martha Stewart for Aerosoles Aerosoles Buy It! Bridgehampton pull-on ankle rainboot, $79; aerosoles.com\n\n84 of 218 Zendaya x PopSockets Charley Gallay/KCA2018/Getty Zendaya is designing PopSockets for a cause! The actress teamed up with the collapsible phone grip company to design three hand-in-heart designs. The capsule is the company's first celebrity \"Poptivism\" campaign, and 50% percent of the proceeds will be donated to FoodCorps, a non-profit that supports getting healthy food in schools. Buy It! Zendaya x PopSockets Poptivism grip, $15; popsockets.com\n\n85 of 218 Disney x Hunter Add a little of that Mary Poppins Returns magic to your wardrobe (and your kids'!) with this limited-edition line of rainy-day gear that, like the boots brand and the beloved nanny herself, is quintessentially British. Buy It! Disney x Hunter umbrella, $80; hunterboots.com Disney x Hunter short rainboots, $150; hunterboots.com Disney x Hunter Mary Poppins bag, $490; hunterboots.com\n\n86 of 218 Sperry x Vineyard Vines The two preppiest brands in the universe got together, and the result is these over-the-top boat shoes you're going to live in on your yacht next summer. Buy It! Sperry x Vineyard Vines chambray seaside silp on sneaker, $75; sperry.com Sperry x Vineyard Vines Heritage patchwork authentic original boat shoe, $100; sperry.com Sperry x Vineyard Vines Heritage patchwork boat shoe, $70; sperry.com\n\n87 of 218 The Reeds x J. Crew A perfect mix of cozy '70s-inspired style and modern cuts, the brand's collaboration with Brooklyn-based designer Wendi Reed is exactly what your throwback-cool high-waist jeans and loafers have been waiting for. Buy It! The Reeds x J. Crew buffalo-check sweater jacket, $268; jcrew.com The Reeds x J. Crew ski sweater, $78; jcrew.com The Reeds x J. Crew cableknit rainbow sweater, $98; jcrew.com\n\n89 of 218 Kipling x Mickey Mouse With the ongoing celebration of Mickey's 90th anniversary, Kipling designed a 25-piece collection of men’s and women’s backpacks, duffels, totes, crossbody bags and zip pouches in honor of the cartoon mouse. You'll find renderings of Mickey in denim, red, black and white motifs.\n\n90 of 218 Gabrielle Union NY & CO Holiday Collection courtesy of New York & Company Buy It! Gabrielle Union Collection Cape Jumpsuit, $99.95; nyandcompany.com\n\n91 of 218 Gabrielle Union NY & CO Holiday Collection courtesy of New York & Company Buy It! Gabrielle Union Collection Silvertone Draped Sheath Dress, $79.95; nyandcompany.com\n\n92 of 218 Keith Haring x alice + olivia Courtesy Alice + Olivia BUY IT! Keith Haring x alice + olivia Demetra Heel, $350; aliceandolivia.com\n\n93 of 218 Keith Haring x alice + olivia Courtesy Alice + Olivia BUY IT! Keith Haring x alice + olivia Chia pullover sweater, $395; aliceandolivia.com\n\n94 of 218 Keith Haring x alice + olivia Courtesy Alice + Olivia BUY IT! Keith Haring x alice + olivia Delora Dress, $350; aliceandolivia.com\n\n95 of 218 Keith Haring x alice + olivia Courtesy Alice + Olivia BUY IT! Keith Haring x alice + olivia Lonnie Bomber, $550; aliceandolivia.com\n\n96 of 218 Keith Haring x alice + olivia The brand's latest collaboration pays homage to the legacy of late Pop Art artist Keith Haring, most famous for doing graffiti in the New York City subways in the '80s. The brand applied Haring's playful, graphic designs and signature characters to a new capsule featuring dresses, bombers, sweaters and shoes. Alice + Olivia tapped newlyweds Tessa and Barron Hilton star in the campaign for the line. Click through to shop some of our favorite pieces and check out the whole collection here!\n\n97 of 218 dELiA*s by Dolls Kill Courtesy of Dolls Kill dELiA*s, the catalog-based fashion brand that captured the hearts of countless teens in the '90s, is making a comeback thanks to a new collaboration with San Francisco brand Dolls Kill. The 70-piece lineup features the brand's signature items — baby tees, butterfly-covered jeans and tops, babydoll dresses and more — all for under $88. \"dELiA*s was an obsession, shaped a culture, and left a permanent tattoo on a generation,\" said Shaudi Lynn, Dolls Kill co-founder. \"We've always been inspired by dELiA*s vintage, original style, and it felt like the right time to introduce it to a whole new generation.” BUY IT! dELiA*s by Dolls Kill Flower Baby Cropped Tee, $25; dollskill.com.\n\n98 of 218 dELiA*s by Dolls Kill Courtesy of Dolls Kill BUY IT! dELiA*s by Dolls Kill Lady Monarch Combat Boots, $88; dollskill.com.\n\n99 of 218 dELiA*s by Dolls Kill Courtesy of Dolls Kill BUY IT! dELiA*s by Dolls Kill Oh Baby Baby Ribbed Dress, $38; dollskill.com.\n\n100 of 218 dELiA*s by Dolls Kill Courtesy of Dolls Kill BUY IT! dELiA*s by Dolls Kill CoolCrazyCute Flared Jean, $68;\n\n101 of 218 ASOS DESIGN x LaQuan Smith Courtesy of Asos Bonus! Beyonce wore a version of this dress in 2017. Buy It! ASOS DESIGN x LaQuan Smith bodycon dress in glitter stripe, $103; asos.com.\n\n102 of 218 ASOS DESIGN x LaQuan Smith Designer LaQuan Smith, a go-to choice for Beyonce and the KarJenner family, teamed up with ASOS DESIGN to bring his confident, sorry-not-sorry, cool-girl vibe to the e-tailer with a collaboration that includes 50-plus pieces for men and women, as well as extended sizing. \"Confidence and being unapologetic in who you are,\" the designer says. \"It’s always about accentuating the body and this concept collection will reinforce that in an affordable and attainable way.\"\n\n103 of 218 ASOS DESIGN x LaQuan Smith Courtesy of Asos Buy It! ASOS DESIGN x LaQuan Smith padded ankle boot in leopard print, $119; us.asos.com.\n\n104 of 218 ASOS DESIGN x LaQuan Smith Buy It! ASOS DESIGN x LaQuan Smith embellished mesh bomber, $198; us.asos.com.\n\n105 of 218 Kendall + Kylie for Walmart Buy It! Women's faux leather silver backpack, $36 walmart.com\n\n106 of 218 Kendall + Kylie for Walmart Buy It! Women's silver sequins fannypack, $18; walmart.com\n\n107 of 218 Kendall + Kylie for Walmart Buy It! Blush faux-Saffiano leather wallet, $21; walmart.com\n\n108 of 218 SKAGEN KULØR Scandanavian-inspired watch brand Skagen applies its brand of elegant, stylish simplicity to a sure-to-make-you-smile collection of primary-hued monochromatic watches, all delivering major outfit inpact for under $100. Buy It! Skagen Kulør silicone watches, $95 each; skagen.com\n\n109 of 218 Abercrombie & Fitch Puffers Buy It! Women's ultra-mini puffer, $120; abercrombie.com\n\n110 of 218 Abercrombie & Fitch Puffers Courtesy Abercrombie & Fitch Buy It! Abercrombie & Fitch lightweight puffer, $100 (orig. $120); abercrombie.com\n\n111 of 218 Baublebar x Chandon And since the brand was already feeling festive, they teamed up with bubbly brand Chandon for a limited-edition bottle and equally sparkling necklace to match. Buy It! Sweet Star layered necklace, $48; baublebar.com and limited-edition bottle, $28; chandon.com\n\n112 of 218 Abercrombie & Fitch Puffers Puffers have become so much more than a way to stay warm - they're a veritable style statement, beloved by supermodels including Kendall Jenner and Gigi Hadid. So if you're looking to add a few to your closet, might as well go for a fashion-forward and wallet-friendly collection like Abercrombie's. Buy It! Abercrombie & Fitch velvet puffer, $140; abercrombie.com\n\n113 of 218 Baublebar x Micaela Erlanger Courtesy Baublebar Super-stylist to the stars Micaela Erlanger (you've seen her work on everyone from Lupita Nyong'o to Constance Wu) collaborated with your favorite affordable bling retailer to create a collection of red carpet-worthy sparkle, all under $60. Buy It! (from left) Date Night drop earrings, $48; baublebar.com and Go Big or Go Home hoops, $42; baublebar.com\n\n114 of 218 Baublebar x Micaela Erlanger Buy It! Sunday Funday earrings, $48; baublebar.com\n\n115 of 218 Baublebar x Micaela Erlanger Courtesy Baublebar Buy It! Weekend Warrior hoops, $38; baublebar.com\n\n116 of 218 Cuyana Capsule Collection What do you get when the ultimate essentials brand launches a capsule of extra-essentials? Cuyana's cool five-piece collection, including this timeless saddle bag comes in five colors and starts at $195. Buy It! Mini saddle bag in calf hair and leather, $295; cuyana.com\n\n117 of 218 Cuyana Capsule Collection Buy It! Modern satchel, $650; cuyana.com\n\n118 of 218 Cuyana Capsule Collection Buy It! Alpaca wool double-face cape, $450; cuyana.com\n\n119 of 218 Marled x Olivia Culpo Buy It! I Love Paris sweater, $78; revolve.com\n\n120 of 218 Marled x Olivia Culpo Another mega-influencer, Olivia Culpo, lends her style sensibilities to a collection designed to garner you all the Instagram likes.\n\n121 of 218 Marled x Olivia Culpo Buy It! Cut out sleeve sweatshirt, $78; revolve.com\n\n122 of 218 Marled x Olivia Culpo Buy It! Rib cuff blazer dress, $158; revolve.com\n\n123 of 218 Vanessa Hudgens x SUISTUDIO Buy It! The Houndstooth Suit, $669; suistudio.com\n\n124 of 218 Vanessa Hudgens x SUISTUDIO Buy It! The Rust Suit, $669; suistudio.com\n\n125 of 218 Vanessa Hudgens x SUISTUDIO Vanessa Hudgens teamed up with with the clothing brand, SUISTUDIO, on a brand new 15-piece collection of anything-but-boring suits. For inspiration, the actress drew upon boho looks from her favorite '70s and '80s stars including Bianca Jagger and David Bowie. “In many ways, I feel as though I stepped into adulthood, through wearing suits that gave me a sense of empowerment, maturity and femininity,\" she said in the press release. So she made sure her pieces make the wearer feel strong and independent as well as comfortable and powerful.\n\n126 of 218 Warby Parker Pupils Project Buy It! Essex by Rosario Dawson, $95; warbyparker.com\n\n127 of 218 Warby Parker Pupils Project Buy It! Tate by Chloë Sevigny, $145; warbyparker.com\n\n128 of 218 Warby Parker Pupils Project Buy It! The Hadley by Iman, $145; warbyparker.com\n\n129 of 218 Sincerely Jules by Scünci Mega-influencer Julie Sariñana is here to to freshen up your hair wardrobe. Didn't think that was a thing? Then you'll have to check out her affordable, fashion-forward accessories (like this print headwrap) for the beauty brand, now at Target.\n\n130 of 218 Sincerely Jules by Scünci Buy It! Open weave metal jaw clip, $7.99; target.com\n\n131 of 218 Sincerely Jules by Scünci Buy It! Satin bow headband, $9.99; target.com\n\n132 of 218 Sincerely Jules by Scünci Buy It! Satin & printed scrunchies, $6.99 for 3; target.com\n\n133 of 218 Kenneth Cole's 35th Anniversary Collection Buy It! Kenneth Cole's The Black Leather Backpack 87, $275; kennethcole.com.\n\n134 of 218 Kenneth Cole's 35th Anniversary Collection Buy It! Kenneth Cole's The Unisex Silver Mesh Watch 96, $148; kennethcole.com.\n\n135 of 218 Kenneth Cole's 35th Anniversary Collection To celebrate Kenneth Cole's 35th anniversary in the business, the brand is re-launching some of its iconic pieces from the past three-plus decades. Each item in the six-piece capsule is named after the year it was created, and features a subtle print with \"Kennethisms,\" such as \"Stand for Something or Step Aside,\" \"How You See the World Depends on How You Look\" and \"We All Walk in Different Shoes.\"\n\n136 of 218 Kenneth Cole's 35th Anniversary Collection Buy It! Kenneth Cole's The Riley Signature Black Leather Pump 83, $150; kennethcole.com.\n\n137 of 218 Draper James for Eloquii For the latest collaboration between Reese Witherspoon's preppy-chic brand and the stylish size-inclusive line (modeled here by Hunter McGrady), the theme is \"It's fall, y'all!\" - with plenty of pumpkin patch-perfect outerwear to match.\n\n138 of 218 Draper James for Eloquii Buy It Draper James for Eloquii buffalo-check cape, $195; draperjames.com or eloquii.com\n\n139 of 218 Draper James for Eloquii Buy It! Draper James for Eloquii scallop-edge coat, $185; draperjames.com or eloquii.com\n\n140 of 218 Draper James for Eloquii Buy It! Draper James for Eloquii double-breasted blazer, $145; draperjames.com or eloquii.com\n\n141 of 218 Knixteen Bra Boss After rethinking undergarments for adult women (revamping them with comfort, performance and inclusivity in mind), Knix launched Knixteen to make getting your period easier than ever. So of course, they had to tackle the \"first bra\" problem next - and to do so, they enlisted five teen \"bra bosses,\" including Jazz Jennings (pictured) and Mo'ne Davis, to design their ideal bras for teens - and we may not be able to resist buying one for ourselves.\n\n142 of 218 Knixteen Bra Boss Buy It! The \"Mo'ne\" bra, $45; knixteen.com\n\n143 of 218 Knixteen Bra Boss Buy It! The \"Jazz\" bra, $45; knixteen.com\n\n144 of 218 Modcloth x Anna Sui The bohemian designer (who frequently features the Hadids in her show) has teamed up with Modcloth for a line of super-romantic dresses in sizes ranging from 0 to 24, featuring all the feminine touches she's known for - like the velvet and flutter sleeves on this burnout floral maxi.\n\n145 of 218 Modcloth x Anna Sui Buy It! \"Authentically Chic\" maxi dress, $199; modcloth.com\n\n146 of 218 Modcloth x Anna Sui Buy It! \"Enigmatic Mood\" A-line dress, $175; modcloth.com\n\n147 of 218 Modcloth x Anna Sui Buy It! \"Thriving Style\" floral dress, $150; modcloth.com\n\n148 of 218 Cole Haan's Stylist Collaborations - Karla Welch's Vesta Pump Buy It! Vesta Pump, $240; colehaan.com.\n\n149 of 218 Cole Haan's Stylist Collaborations - Karla Welch's Hiking Boot Buy It! All Terrain Waterproof Hiker, $270; colehaan.com.\n\n150 of 218 Cole Haan's Stylist Collaborations - Erin Walsh's ZERØGRAND Oxford Buy It! Women's 3.ZERØGRAND Oxford, $250; colehaan.com.\n\n151 of 218 Cole Haan's Stylist Collaborations Cole Haan recruited three top celebrity stylists — Karla Welch (pictured), Erin Walsh and Simone Harouche, to apply their unique, red-carpet worthy aesthetics to the footwear brand's classic silhouettes. The result: Fashion-y, trendy footwear that you'd expect to see on some of the chicest stars that just happens to be infused with Cole Haan's signature comfort.\n\n152 of 218 Tees & Sweatshirts Buy It! Nautical-theme tees and sweatshirts, $42 to $68; emilyandmeritt.com\n\n153 of 218 Emily + Meritt The stylist duo who co-founded (but have since departed) Current/Elliott and currently run celeb-loved line The Great - and who have that Pottery Barn Teen collection you're so obsessed with - just put their names on a cute and extremely giftable line of comfy basics and stationery products - perfect for the collegiate kid in your life (or, you know, for your own home office) - including these \"best-tees.\"\n\n154 of 218 Emily + Meritt Office Supplies Buy It! Emily + Meritt office supplies, starting at $16.99; officedepot.com\n\n155 of 218 The Cashmere Crop Mockneck Buy It! The cashmere crop mockneck, $100; everlane.com\n\n156 of 218 The Cashmere Crew Buy It! The cashmere crew in charcoal/bone-tipped, $100; everlane.com\n\n157 of 218 The Cashmere Shrunken Sweatshirt Buy It! The cashmere shrunken sweatshirt, $100; everlane.com\n\n158 of 218 ROTHY'S SNEAKERS You know those super-comfy flats everyone keeps talking about that are practically a fixture in your Instagram feed? The ones that are washable and made from recycled waterbottles and come in all those fun colors? Yeah, they just made sneakers and they're all of the above. Buy It! Rothy's sneakers, $125; rothys.com\n\n159 of 218 Madewell Men's Finally, your guy will be able to understand why you're so fanatical about your Madewell denim: The brand has introduced a line of their perfect-fit, washed-just-so denim (plus some shoes, tees and more in the mix).\n\n160 of 218 Madewell Men's Buy It! Men's Skinny jeans in Dark Worn, $128; madewell.com\n\n161 of 218 Madewell Men's Buy It! Men's Straight jeans in True Blue, $128; madewell.com\n\n162 of 218 Madewell Men's Buy It! Men's Sherpa classic jean jacket, $175; madewell.com\n\n163 of 218 Everlane's New Day Boot Buy It! The Day Boot in Brick, $225; everlane.com\n\n164 of 218 Everlane's New Day Boot Buy It! The Day Boot in Ecru, $225; everlane.com\n\n165 of 218 Everlane's New Day Boot Buy It! The Day Boot in Bone, $225; everlane.com\n\n166 of 218 Everlane's New Day Boot If you're a fan of ethical fashion brand Everlane, you're probably already familiar with their beloved Day Heel (which once had a 28,000-person waitlist!). Now, they're introducing The Day Boot and it's bound to be your new favorite shoe for fall — and beyond. Made from buttery-soft Italian leather with a low block heel, The Day Boot is not only chic but it's also super comfortable. Available for $225 in five different colors, you're going to want to get your hands on a pair (or three!) right now.\n\n167 of 218 Everlane's New Authentic Stretch Denim Buy It! The Authentic Stretch Mid-Rise Skinny Ankle Jean, $68; everlane.com\n\n168 of 218 Everlane's New Authentic Stretch Denim Buy It! Authentic Stretch High-Rise Skinny Ankle Jean, $68; everlane.com\n\n169 of 218 Everlane's New Authentic Stretch Denim Courtesy Everlane Buy It! The Authentic Stretch High-Rise Cigarette Jean, $78; everlane.com\n\n170 of 218 Everlane's New Authentic Stretch Denim Everlane's Authentic Stretch Denim Collection is the newest addition to their denim offerings. Thanks to a durable and unique yarn that has a high stretchability, they lift and suck you in in all the right places - without losing their fit. For only $68-$78, they’re available in three silhouettes, four washes and a range of inclusive sizes. So scroll through to shop the super affordable (and flattering!) new collection now.\n\n171 of 218 Madewell's New Eco-Friendly Fall Denim Collection Buy It! Cali Demi-Boot Jeans: Eco Edition, $115; madewell.com\n\n172 of 218 Madewell's New Eco-Friendly Fall Denim Collection Buy It! 10\" High-Rise Skinny Jeans in Elinor Wash: Eco Edition, $110; madewell.com\n\n173 of 218 Madewell's New Eco-Friendly Fall Denim Collection Buy It! The Shrunken Stretch Jean Jacket: Eco Edition, $118; madewell.com\n\n174 of 218 Madewell's New Eco-Friendly Fall Denim Collection Madewell's new Eco Collection a 6-piece organic cotton denim collection, features some of Madewell's signature fits, like the 10\" High Rise Skinny Jean and the Skinny Overall, and is produced using 75 percent less water and 65 percent less chemicals. Each style is sustainably-dyed, while the manufacturing waste is turned into bricks for affordable housing. Learn more here and scroll through to shop some of our favorites from the collection just in time for fall! Buy It! Skinny Overalls: Eco Edition, $130; madewell.com\n\n175 of 218 Kipling x Mickey Mouse Buy It! Disney's Mickey Mouse Seoul Go Laptop Backpack, $139; macys.com\n\n176 of 218 Kipling x Mickey Mouse Buy It! Disney's Mickey Mouse Tag Along Duffle bag, $139; macys.com\n\n177 of 218 Kipling x Mickey Mouse Buy It! Disney's 90 Years of Mickey Mouse Creativity Extra Large Pouch, $49; kipling-usa.com\n\n178 of 218 Lululemon x SoulCycle Buy It! “To The Beat” Duffle, $198; shop.lululemon.com\n\n179 of 218 Lululemon x SoulCycle Buy It! \"Ride & Reflect” Jacket, $228; shop.lululemon.com\n\n180 of 218 Lululemon x SoulCycle Buy It! “To The Beat” Tee, $68; shop.lululemon.com\n\n181 of 218 Lululemon x SoulCycle Buy It! “Ride & Reflect” Tight 28”, $128; shop.lululemon.com\n\n182 of 218 Express x Olivia Culpo Buy It! Olivia Culpo High Waisted Track Pant, $69.90; express.com\n\n183 of 218 Express x Olivia Culpo Buy It! Olivia Culpo Track Jacket, $79.90; express.com\n\n184 of 218 Express x Olivia Culpo You know how Olivia Culpo always has the perfect outfit for every occasion? (Seriously, always!) Well now she's bringing her high fashion IQ to a brand new collaboration with Express that combines some athleisure staples with going out looks. \"I'm excited to join forces with Express to introduce a versatile collection that women will feel great wearing whether they are off to an event or to brunch with their friends,\" Culpo shared. \"The designs speak to female empowerment, to this idea that women stick together and become stronger because of it. Fashion has the ability to empower, and I believe this collection does just that.\" Culpo's collection features 32 pieces (from track suits to sequin minis to faux leather biker shorts!), ranging in price from $35-$138, and available in sizes 00-18 (tops in XS-XL). Click through to shop some of our favorite pieces! Buy It! Olivia Culpo Striped Boyfriend Blazer, $138.00; express.com Buy It! Olivia Culpo High Waisted Faux Leather Bermuda Shorts, $69.90; express.com\n\n185 of 218 Express x Olivia Culpo Buy It! Olivia Culpo Utility Jumpsuit, $88.00; express.com\n\n186 of 218 Express x Olivia Culpo Buy It! Olivia Culpo Abbreviated Striped Sweater, $59.90; express.com\n\n187 of 218 Endlesss Summer Holiday Slip Dress Collection Slip dresses are one of the easiest pieces to wear to a holiday party. Which is why Endless Summer designed some chic easy styles that will be at the top of your closet rotation. Just team them with a leather jacket and some boots and you'll feel festive no matter where you are headed. (The best part? A portion of proceeds from all sales on the site are donated to the ASPCA.) Buy It! Berri Slip in Rust, $189; shopendlesssummer.com\n\n188 of 218 Endlesss Summer Holiday Slip Dress Collection Buy It! Harper Slip Dress in Leopard, $168, shopendlesssummer.com\n\n189 of 218 Endlesss Summer Holiday Slip Dress Collection Buy It! Berri Slip in Pot of Gold, $189; shopendlesssummer.com\n\n190 of 218 SG x Puma Buy It! SG x Puma Women's Runner, $120; puma.com\n\n191 of 218 SG X Puma Buy It! SG x Puma mesh jacket, $70; puma.com\n\n192 of 218 SG x Puma Buy It! SG x Puma 7/8 tight, $80; puma.com\n\n193 of 218 The Mighty Company x Ilaria Urbinati Buy It! \"I Need Space\" jacket, $995; themightycompany.com\n\n194 of 218 The Mighty Company x Ilaria Urbinati Buy It! \"Miss Galaxy\" jacket, $995; themightycompany.com\n\n195 of 218 The Mighty Company x Ilaria Urbinati Inspired by a breakup, The Mighty Company designer Jessie Willner teamed up with celebrity stylist Ilaria Urbinati (who styles Rami Malik and Bradley Cooper to name a few) for a capsule collection of celestial-themed jackets. The duo designed three pieces with light-hearted phrases including “I need space” and “Lost” to benefit a great cause. 100% of the profits will go to Unchained at Last, a nonprofit dedicated to stopping forced and child marriages and helping survivors rebuild their lives. Click through to see the three-piece collection (modeled by none other than Riverdale’s Lili Reinhart). Buy It! \"Lost\" jacket, $995; themightycompany.com\n\n196 of 218 Lee x Cushnie Buy It! Lee Body Optix x Cushnie Jumpsuit, $595; lee.com\n\n197 of 218 Lee x Cushnie Buy It! Lee Body Optix x Cushnie Dress, $495; lee.com\n\n198 of 218 Lee x Cushnie Carly Cushnie, the creative director of the celeb-loved label Cushnie, teamed up with the iconic denim brand, Lee, to put her signature sexy, form-fitting spin on all things jeans. The result: A supercool capsule that utilizes Lee's Body Optix technology to deliver celeb-worthy denim designs, like a crop top, jumpsuit, dress, bellbottoms and more, from $250 to $595. Click to see some of our favorites.\n\n199 of 218 Louis Vuitton x UNICEF Campaign The French fashion house teamed up with UNICEF and Game of Thrones star Sophie Turner for its #MakeAPromise campaign. Sophie helped design this limited-edition Silver Lockit bracelet to \"hold luck for the people to whom the funds go to,\" she said in the release. The bracelet retails for $300, and $100 of each sale will be donated to UNICEF to support their work in helping children in emergencies and in vulnerable situations around the world.\n\n200 of 218 Louis Vuitton x UNICEF Campaign Buy It! Silver LockIt Bracelet by Sophie Turner, $300; us.louisvuitton.com\n\n201 of 218 Kendall & Kylie for PacSun Holiday Collection The sisters continue their collaboration with California cool brand PacSun, launching a new line of clothes just in time for the holiday season.\n\n202 of 218 Kendall & Kylie for PacSun Holiday Collection Buy It! Kendall & Kylie Belted Menswear Shift Dress, $23.97; pacsun.com\n\n203 of 218 Summersalt Travelwear Collection Buy It! Summersalt Throw & Go Duster, $95; summersalt.com\n\n204 of 218 Summersalt Travelwear Collection The brand that made a splash all over your Instagram feed with the hottest swimsuits of 2018 is now launching a clothing collection that will make you excited to go to the airport just to capture an #OOTD shot. The small capusle of travelwear essentials, ranging from a duster to a wear-everywhere jumpsuit, will take you \"from the boarding gate to your bucket list getaway\" in style. Click through to shop our favorite pieces.\n\n206 of 218 Summersalt Travelwear Collection Buy It! Summersalt 24 Hour Jumpsuit, $145; summersalt.com\n\n207 of 218 Goop & Universal Standard’s Extended Size Capsule Collection Buy It! goop x Universal Standard brushed-back hi-low dress, $295; goop.com\n\n208 of 218 Goop & Universal Standard’s Extended Size Capsule Collection Gwyneth Paltrow’s lifestyle brand teamed up with Universal Standard (the size-inclusive line known for its elevated basics) for a limited-edition, five-piece capsule that comes in sizes 00-40. The collection includes a dress, tuxedo, jumpsuit and jacket and will be sold exclusively on goop.com, goop Lab and goop’s brick and mortars in L.A. and N.Y.C. starting on November 27. \"I believe we're stronger if all archetypes are included, and we're all able to be seen and lift each other up, which is why we partnered with Universal Standard to create this line of beautifully made pieces,\" Paltrow said in the press release. \"We’re excited to work with them in this new capacity, and hope this collaboration continues to push this conversation into the mainstream.\" Buy It! goop x Universal Standard brushed-back jumpsuit, $295; goop.com\n\n209 of 218 Goop & Universal Standard’s Extended Size Capsule Collection Buy It! goop x Universal Standard wool jacket, $335; goop.com goop x Universal Standard cropped trousers, $225; goop.com\n\n210 of 218 Goop & Universal Standard’s Extended Size Capsule Collection Buy It! goop x Universal Standard wool peacoat, $395; goop.com\n\n211 of 218 Kendall & Kylie for PacSun Holiday Collection Buy It! Kendall & Kylie Jenna Cropped Cable Knit Sweater, 32.86; pacsun.com\n\n212 of 218 Reformation Extended Denim Sizing The brand is extending the size range for its best-selling denim styles, which will now be available in sizes 00 to 24. The Ref Jeans collection ($98 - $128) was produced at the brand's HQ, a sustainable factory in Los Angeles, using Tencel Lyocell, \"the world’s most sustainable virgin fiber that uses 1/10 the amount of water used to produce cotton,\" according the the label. The team of designers worked with fit experts to ensure the new denim range \"fits perfectly on different body types.\" And the inlcusive sizing won't just stop at denim: in early 2019, Reformation is permanently launching into the extended sizing category with an evergreen collection. Buy It! Candice High Bootcut Jean, $98, reformation.com\n\n213 of 218 Reformation Extended Denim Sizing Buy It! Candie High Bootcut Jean, $98; reformation.com\n\n214 of 218 Reformation Extended Denim Sizing Buy It! Liza Hight, Straight Jean, &98; reformation.com\n\n215 of 218 Gabrielle Union NY & CO Holiday Collection Buy It! Gabrielle Union Collection Crop Turtleneck Sweater, $59.95; nyandcompany.com Buy It! Gabrielle Union Collection Sequin Stripe Pencil Skirt, $89.95; nyandcompany.com\n\n216 of 218 Gabrielle Union NY & CO Holiday Collection The new mom has a a lot to celebrate this holiday season, and she'll be doing so in style. Union continued her stylish partnership with NY & CO launching yet another collection with the retailer. She stars alongside friends Raven Goodwin, Essence Atkins, Ajiona Alexus and Valarie Pettiford in the campaign (seen here), and according to the brand her collection is \"all about being inclusive and creating pieces for every women.\" Shop a few of our favorites right here, then RSVP yes to all those holiday parties hitting your inbox.\n\n217 of 218 Jennifer Miller x GILI Jill Martin for QVC G.I.L.I. Creative Director Jill Martin and celebrity jewelry designer Jennifer Miller are both known for their love of statement accessories, and the two just teamed up to create a special line of eye-catching earrings exclusively for QVC. Thanks to this genius mash-up, QVC customers can get Miller’s glam pieces at a budget-friendly price point. Buy It! G.I.L.I. Goldtone and Silvertone Fringe Dangle Earrings, $57.68; qvc.com", "images": ["https://people.com/thmb/1j36aZ09o9DI8W2ski6Ol5DrW9s=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/08_053018_178-v2-2000-918604bfe98a4240ab2e84f26ee0eb20.jpg", "https://people.com/thmb/5QH12brhYfLVE6lUkozbpgY907w=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(629x463:631x465)/hellmanns-spicy-mayo-track-suit-091422-84f2d9ac4a9146299b2f303d4c0ed67a.jpg", "https://people.com/thmb/gVASxF21_erJAUUTWqOG0nR4xrw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(399x0:401x2)/kic_144-8191-0664-511_prod1-ecbf88c8825e411c8b70642c080ce4f2.jpeg", "https://people.com/thmb/cop082KPmAEoOUoEx9LfWJ7FYwM=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/bubble-bath-1-2000-ed977be06e1c4d2b81215ee009a38b66.jpg", "https://people.com/thmb/HnJ9Kh89qrAOgB47a4ROCJJPHHI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/martha-stewart-11-2000-1e2e7c4f0bec46929facd576f1e7b164.jpg", "https://people.com/thmb/T3YlOXsa762v5CkfUR-DUW4Aejo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/2018-05-30_fa18_pow_lookbook2742-1-2000-17151022532c428585a60185dfac9716.jpg", "https://people.com/thmb/06SG1DUIlfC6wqX7U9z0mRgfWS4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/c-001082-01-001_auden_shivani_katie_jovanna_0007-2000-6677d4e6170148c69cb63a34a6e36387.jpg", "https://people.com/thmb/8NW_oV1JiP8jLiGQPbGnHv7q-1Q=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Brooklinen-Holiday-Collection-94-12082022-f829b02ca05d45e5afe4785ff45b5724.jpg", "https://people.com/thmb/dBokVgpO--QCSon8L27qU8r-i_s=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/dsc04921-edit_pp-2_highres-2000-6bd957833c54409da625611982eb58df.jpg", "https://people.com/thmb/V5WpTG5ChRwL-OXtOqbRHct6fKU=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(399x0:401x2)/anf_207906_07_prod2-21e91d15e7c844c8b1f415c0f41bb1ea.jpeg", "https://people.com/thmb/TKi5n5tjonJp9rZ0GWay6qPr3BA=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/herschel-65e2cce93e5e4d7e98e365235f6d5c23.jpg", "https://people.com/thmb/oa9iEZNzVIJOzrteyNG6Hxbb9NA=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/a-o-carryon-front-copy-1-6ecde3029372413a9a90d16d54c7b0c9.jpg", "https://people.com/thmb/XlGLH9fJcjvQDvLMdE9q77OTZXg=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/teva-2000-15353610b45a4010bba63ac1e9e77b9b.jpg", "https://people.com/thmb/9VYhw8OV5dAbc4S_Z0ESD7rx60E=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/181005_ng_look_8_0190-2000-426460177bd04eada9c651a38fd5dd56.jpg", "https://people.com/thmb/zPLE8dZ-1WD6KC2oHNG8M8-zjGo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/goal-line-b61ef09f82784743a8a8eb490d723477.jpg", "https://people.com/thmb/koLuyBTj-FRAWqHxP2-dIDUFVts=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/agg84645_purple_xl-52ee2d3df2e34bccaaa24df7070ecb90.jpeg", "https://people.com/thmb/hN8fzGBIBHGhQTG1oDkfCYdIL6c=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/alice-ac1660494d5a4847acd9c6de51a160c1.jpg", "https://people.com/thmb/YTCZIWF7BmCM-6GJ00cHyraSOvg=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(439x0:441x2)/target-1-44fe9b779f454496894bae7dd7614941.jpg", "https://people.com/thmb/da4ia0O2_XV3s1giWWcrtteWvPc=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/kendall-kylie-jenner-2000-84474ca0a57340a292ea624ce161c3b8.jpg", "https://people.com/thmb/DNE2kDyh1fqAe3EjYJTps7ZJKDk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/41993_01-2000-84034f27073843c2957be3fed146946b.jpg", "https://people.com/thmb/LI3_61Pu56uHisGycHDi07JzZS4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/girardi-look-4-2000-a81de2b48c624c40bd39baff17830f65.jpg", "https://people.com/thmb/MfiwXAFqZh4QZoSiEX94uxdBEqI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/42030_01-2000-096d4bb0384e45158a58bef7fba883d0.jpg", "https://people.com/thmb/GHmGXVRSSjG0uyqzA5DaU0ln2Uc=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/draper-james-x-helen-jon-reese-w-1-2000-b8c80fe306904836ae097f96df07a7a8.jpg", "https://people.com/thmb/khOJ0_AduU0jRnG9YaHyX7su0UE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/Fashion-Launches-people-20-19052022-2000-e7258774df034c1e92e6c7d068ed88a1.jpg", "https://people.com/thmb/zrpggy3MQS5bViYc3WEnLb9mg-Y=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/best-jeans-for-short-women-tout-d76328b9fcaa48e58ccd03be4220bc22.png", "https://people.com/thmb/ENqejsTDRLb8axOu1uJqB7Ot7DY=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/baby-baguette-ring-a203f503ce50491fa41cc3ad3d85662c.jpg", "https://people.com/thmb/QTDxsSqtDsgl66ngzs1GabfulRc=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(565x0:567x2)/eloqui2-8f3e042f00b7449f9fdc952e08959ada.jpg", "https://people.com/thmb/XLMEUVOyVUaGvuNM0DyFwBneb1w=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(701x0:703x2)/daisytee-b44354f5974047d28739754c6ba0ea93.jpg", "https://people.com/thmb/Q8N8p6xJNkQXkmKPFcgVurDJfF8=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/walmart-com2-2000-f83c808fbe5041fea85019d94a754344.jpeg", "https://people.com/thmb/DPvMBr1VfY5wKc-CPWyN0OkUPKE=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(449x0:451x2)/ef-3b1a77bcd5ad443ca750ebcd8d5bce43.jpg", "https://people.com/thmb/8XiQM4JMf-vxEJRPjlhTOX_xRXE=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/cv811s14702g661rose-multichia_intarsia_crwnk_rlxd_pllvr_001-9da979c8314041ee98817b18896bd60a.jpg", "https://people.com/thmb/CLrqnNd9R_Lv36hH6irq7tvrxGw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/luxe-tout-eb7a096da9944a3a9c40cd33ef2e2934.jpg", "https://people.com/thmb/H05yxEm5zC2SzJoF-YlOUN1ZWT0=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/uniqlo2-eaca07533a94483da8e6bd78ec86e821.jpg", "https://people.com/thmb/3wFiJMX9y2ZLpmPQbn2byMV1vo8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(449x0:451x2)/meghan-markle-c83d8dcfceea4b35b79d738df1890a0d.jpg", "https://people.com/thmb/QfVubY9bJwe-39eceCT4-COFpFk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/new-launches-roxy-1-2000-e826eae68cee40b0900bf1dfe34df810.jpg", "https://people.com/thmb/RiCevbul6lw2BUJr71Aykq3Wxag=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(666x0:668x2)/laforce092718_0004-2000-775dc8b85b8f43b687ccec6dd0b970d2.jpg", "https://people.com/thmb/ZopjMBwJy2Eam75G2Yq5M50bBiI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/uniqlo-40dc31ba375f44f5a00d7ea43c5762de.jpg", "https://people.com/thmb/daKBT8KyJWJgNBJ6hGiSxW1wubw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/wrangler-bohemian-rhapsody-collection-4-2000-e3b94bf301044132a8c294ef63457ca4.jpg", "https://people.com/thmb/cLq1C0-i2G4EjJTDxNg76tVyHqU=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/shot_6_skg2600549_ho18_wholesale-2000-f2b76b6db3a744b9ab3dcb91e0d6ad17.jpg", "https://people.com/thmb/PzG8VZqm0L8bWAcvIfTZ3kPoAEA=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(674x0:676x2)/splendid-2-bb97e2b5a52242abbd8461fd6271218c.jpg", "https://people.com/thmb/FtV3JanCdmiJxne9F3pBsQdwdu4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/sperry-vineyard-2000-c8e1d64a551843c7988a2a4c6dac1a92.jpg", "https://people.com/thmb/wua-nzoCegaHSUeamSIXbDg048s=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/micaela_prints_01_170-2000-5e6f325f17f64abfae89e5d1f536d3ed.jpg", "https://people.com/thmb/eyPjEE7TRBzIOYCfaZpsBAVkO5c=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/1810_jf_editorial_model_16_0219_rgb-ext-2000-56d28ce3e15d4b00801801950e61b0de.jpg", "https://people.com/thmb/IkHAVlzh4ZVzj658o3K1XYUyMpY=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(663x0:665x2)/gcs127t_blue189-2000-e71005fb0c464bb1a9c55fff23b0e759.jpg", "https://people.com/thmb/r2he1DEKv_VXPIWL7KQTKhxrwh8=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/a-o-hat-box-small-front-copy-1-5faf18e27a4748c486502c22c55bb2b7.jpg", "https://people.com/thmb/o0dfz6H19AWMkmLvbZLIWHsSImw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(693x0:695x2)/142-2000-9f2b5ce24a894e199dd6ed2800b727dd.jpg", "https://people.com/thmb/nES5XtQeQTD7qIwE2yLyQ0SYeUs=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/girardi-look-3-2000-ca993adad05343cc8061ebd94148e5fb.jpg", "https://people.com/thmb/qAwZgoXNoC_JV4yDBvHjf4wjSY4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(408x0:410x2)/on_figure_687_1024x1024-9ecc924a764c4752a9f3d606ec7c65ab.jpg", "https://people.com/thmb/XedF-GBJJrNr-nepEyJkpbLDLQM=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(759x0:761x2)/18aw_xrt_selena-collection_36130008_rgb-2000-53e0ae87979c41d98a5679aa57840d36.jpg", "https://people.com/thmb/X6oCE_TTZIO3s-gxrH81RDkRlO8=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(663x0:665x2)/gcs126t_black030-2000-51745016c98a45e6af226683e3e89fb5.jpg", "https://people.com/thmb/9chF5M00jRfZrWjmRaAqVWkYiNo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/clear-cut-2000-8807d424dac94b15b8925d45fff99781.jpg", "https://people.com/thmb/S-RbY37B2ieRRn_LoFnIMdcg-mw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/dsc01825-2_highres-2000-e916e667e6c14194a3fedea344fb65b7.jpg", "https://people.com/thmb/CzX6T4ZGsx17MN6C-806awkFFzs=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/asos_34-2000-e465a3a6764245ac9f14dd9574f909c1.jpg", "https://people.com/thmb/AKt_aGa0j6BvzxwzjIedzCDHGZs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/target-fall-designer-collection-sept-25-tout-abf44a9219c94500bb8f13abd7faab61.jpg", "https://people.com/thmb/3jt8KMDIgJGxXIFmue8pTmVcwOg=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/a-o-vanity-front-copy-1-aaee088415ed48099079c399a9324955.jpg", "https://people.com/thmb/bD-l2J6q9mbW1R72-s4Qw0mN-c4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/tango-2000-9a321dbf28524d92a0bb70d62026dbad.jpg", "https://people.com/thmb/ki3suVbTZni2INLN6cnB2ZColbA=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(666x0:668x2)/sc3a9zane_louison-necklace_120-1-2000-c21181340da4472d9fd903c7b244cb3b.jpg", "https://people.com/thmb/l8xw6s2GsN4OMflcGyrBK0Crzts=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(677x0:679x2)/dwayne-wade-tie-bar-2000-293eb454b94b40f495b2c086688c0695.jpg", "https://people.com/thmb/oR5fciH0mGGfPJjFHhlGB7HQ73c=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(511x0:513x2)/bella-kourtney-8ba03c74b2bf409eae7bee5b087f3eb9.jpg", "https://people.com/thmb/Kl9RsmiCoYlxd3jJqzdV_cdThl0=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(701x0:703x2)/dress-b335b9d24af4472abd1f43ec9ec5c88b.jpg", "https://people.com/thmb/JvSsP5z7KOldK8RHSqcmtLnd--Q=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/dwayne-wade-tie-bar-2-2000-a77d1014a250465b833ce203be63512b.jpg", "https://people.com/thmb/LIKt-IEMbcZNuRry3ZSLFZhLvHY=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/1103371_w_hurricanexlt2alp_crsgr_1-88280289e00c45eaa01e1b65cd2d2f7e.png", "https://people.com/thmb/ZRlHkknX64PaMNm2TophVZrQUQs=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(408x0:410x2)/on_figure_518_1024x1024-840a6cc7cb0c44a59eb2bfb274057e80.jpg", "https://people.com/thmb/y3mGNgqvKBFHb9kQw1LV_KyNtuc=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(799x0:801x2)/gloria-steinem2-2000-52861d66bb3947f1b865e86922fa032b.jpg", "https://people.com/thmb/kl79s16QxR3mNvbOehs4tEWxbaQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/draper-james-tretorn-collab-tout-6482a52a0507438eba2f160fa97d9f1d.png", "https://people.com/thmb/rxCv7fN_oOtl9z2VsSu4R0aq7uY=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(666x0:668x2)/tout5-2000-92e883084b114d62af1744c7f3ae8d67.jpg", "https://people.com/thmb/0nFH86r_gjpATIZbLEIR97H3UV0=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/colsie_image_3-2000-1431ca7a941447f2865f5be48e86edca.jpg", "https://people.com/thmb/EUYrKf1m-gN211qUp-qN_0yJu_s=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/aritzia-3-2000-db1f2fca90c64b339f852ebe19f5719a.jpg", "https://people.com/thmb/GFVAVEV03N1T2Fgk7AAMvTh49FQ=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/walmart-com3-2000-0299da8cc46e404b8a18c63e6243d73e.jpeg", "https://people.com/thmb/Lje7sGaj3HgeS-yLg9z5JSNPfrU=/300x150/filters:no_upscale():max_bytes(150000):strip_icc()/people_magazine_sub-e6689738996d40f38f154099e1751481.png", "https://people.com/thmb/IDkWV7rJtYaan3L7FmCfh0CT6Pk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(701x0:703x2)/boots-756c15c3868346ccbe7cf371300cac5c.jpg", "https://people.com/thmb/dFQJ_V_GR5UzuLB99NmYfoUw9Wg=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/throwback-long-sleeve-t-shirt-a33fa2d10b6746f08a467de9d074e406.jpg", "https://people.com/thmb/c5E6CNXt730i6ZN09XzI6-CQs20=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(701x0:703x2)/pants-07875b1c9d57483c88c608fd8d56423b.jpg", "https://people.com/thmb/LmrxoYFvwL2vcUm9W0FW0nUKspw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/zendaya-2000-7016de5dce0a4a959fea114434123fe6.jpg", "https://people.com/thmb/cCcHGdCH5YKIg53TSTKeIQ_LKDo=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/jessica-chastain-3-3851404c699a4f9b936c98dbf0dabd2d.jpg", "https://people.com/thmb/tHfvJ6szZrPJLGA2vUp-0mQ1Jak=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(539x0:541x2)/aiuo3l2b-e507a15a1919498fa902f06fad658925.jpg", "https://people.com/thmb/AnDSayfzJ_Rbg44FEhocz8uGZNg=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/petite-bezel-bracelet-1-de0da021ebe44caa93329e36b777a1c3.jpg", "https://people.com/thmb/3krfxw_eF6ZaLpLf0uvFUejkP88=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(899x0:901x2)/everlane-high-rise-cigarette-8f0b029cb7254fe19e18a423a156262b.jpg", "https://people.com/thmb/DsIXERWKSmG9sCHc32hLYMl7PyA=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(799x0:801x2)/tommy-john-649b31b8888946cd80b654c8a6620b32.jpg", "https://people.com/thmb/EtD59shJX6G1giKcixCcmdkE_2Y=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(658x0:660x2)/wrangler-2-a35e615b28e845e8b152ffede78109f4.jpg", "https://people.com/thmb/arRXTimYobOn-3wj4evuNBnmjb8=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/shot_11_022_f4_rgb-1be7fffbbb374804ae6737b8272d2242.jpg", "https://people.com/thmb/ECSlKu_YT3fNifvgvGKfr9vWXKQ=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(799x0:801x2)/15001-00195-m_02-2000-4d5956e9cb284b21868f4acdf53e01a3.jpg", "https://people.com/thmb/3a14I4rmtZL7hBu6oMThlGQm2Ts=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/aritzia-5ab74101b87a40c5a0ced90f4414c869.jpg", "https://people.com/thmb/F2_RyJKNcsrnu44QyIUHFX2Lk4A=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(666x0:668x2)/181005_ng_look_1_0114-2000-088fa16a546342f38409eaa736867e06.jpg", "https://people.com/thmb/_p7JjsNk1MvFp3-M_9SHHITabo4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(899x0:901x2)/martha-stewart-3-fd03214a8ad94b199fc13e2b7c2f0af7.jpg", "https://people.com/thmb/wTFNDprtAWmQjVIxzcuLNci__8Q=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/draft-me-lace-up-v-neck-t-shirt-cc38ad11e6cb4c0d858144677ef6cefd.jpg", "https://people.com/thmb/HqxHF1YVfP5Y0hQTQX9zqJR18aw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/jayne-2-2000-79a13c345184486b804479d9504c714d.jpg", "https://people.com/thmb/zvst8f_JBhp2780AnyPInNJmkRg=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(731x0:733x2)/aritzia-1-2000-bcde4de29c9f4bfead2b0c90e81813a6.jpg", "https://people.com/thmb/czZ_uF0HOFJIHIzcgMSs1JRsFLQ=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(799x0:801x2)/50037-00187-m_02-5.35.50-pm-2000-b1c59d6d3aa4409db141ddbbe7fef0ff.jpg", "https://people.com/thmb/fUAZ1cvOLhq8jpXF3pdPlyPNGck=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(675x0:677x2)/asos-design-x-laquan-smith-leopard-padded-ankle-boot-c2a365-2000-abf62fe6ea4443f5942a4f70ba6293ed.jpg", "https://people.com/thmb/D0OKwRh0UIh2X7hWpJ-EsneV0wY=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(799x0:801x2)/40032-00173-s_02-2000-dc629ff1b6e8468387466ebfe91ea653.jpg", "https://people.com/thmb/j6CWDjF9oXhlNu0i4udiKxLZ69w=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/target-tout-0ea620fd62e942719031814a8ae1f19c.jpg", "https://people.com/thmb/Az2Th03I3XohHIfXFX9ai5pQkmE=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(748x0:750x2)/180829_01_0136-2000-b2cfd911054f4e2696abffe6f3b4ba46.jpg", "https://people.com/thmb/AnajC-JUnlzKCxgWVpfFbtbUEkU=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(562x0:564x2)/guh18_td_2515-d896a74acbd2446b8502a029893882a2.jpg", "https://people.com/thmb/jgxFhbLGJMqmU5K-mdc59WmfGNk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/marry-poppins-hunter-2000-3e794e0174eb47e8999fa8d1fb876d74.jpg", "https://people.com/thmb/mYLmoyEnI_ndj20zj68DJ948nMM=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(525x0:527x2)/uniqlo31-c69df79eb7814c5e8d418a0b19c2c336.jpg", "https://people.com/thmb/w3lH-j4g2TLT8JhvRFJDsJXgZ2U=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(899x0:901x2)/martha-stewart-21-ba12ee8391de4ac0a9e79de6341638c4.jpg", "https://people.com/thmb/DEVix_soXBRKjqYZ5z6KSFv93js=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/1103370_m_hurricanexlt2alp_gorg_1-bcdad3739e5f440384c57171ad9634f4.png", "https://people.com/thmb/kthKFCFHlCDXfpo6kqHm7DOHgrY=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(743x0:745x2)/guh18_td_2651-2000-799b81a9f2cf47658560e4d875379b0f.jpg", "https://people.com/thmb/A5XjsN-Ue4a-FbYVtzhP_aHeznM=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(799x0:801x2)/50035-00197-m_02-2000-3c43fc6323bd47bdaef07cb1d52626b1.jpg", "https://people.com/thmb/TZSDmNWGdVtP-O-nfzbxwuPtNiA=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(563x0:565x2)/eloqui-421db3ca461049c79dc748d3cbe504ac.jpg", "https://people.com/thmb/rOuI8rOt0fuXFrbOABPPoz_cof4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(663x0:665x2)/gcsk127t_blue191-2000-556850257c97488a82596e9c1d99634c.jpg", "https://people.com/thmb/fcvcnEqg3Y9kk5Nz2w3ojvjNr4U=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/dsc04639-2_highres-2000-6e13d56df2b44a03a10e136feae48a25.jpg", "https://people.com/thmb/psxgMO-WOkhsV7r4xxy0rlarNQ0=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/cv811p43201z981dancing-man-cherry_multiproduct_01-5f438078b59c408bbb5d3ec8e637876d.jpg", "https://people.com/thmb/foj0j_6gu5cClJc8ggNNdcQFTMQ=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(769x0:771x2)/new-launches-roxy-4-2000-67dfd4d844f147d3923484483f4f8d36.jpg", "https://people.com/thmb/TZ0ASR1IQaD2-XVAkMTVk3qp_dA=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(799x0:801x2)/40030-00075-allsizes_02-2000-3e243598e95b401d8040cb5629e3125d.jpg", "https://people.com/thmb/ZOJQppQ4MgRCWjED4A1HTB75PNg=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/disney-882ca9bf6f184a608fd4e8c9e19ce8d1.jpg", "https://people.com/thmb/OsThkOdRBPBCYlBYV-VXuDeXIzI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/1103370_m_hurricanexlt2alp_nyr_1-88c62be40ee94d588aeb43a6897af656.png", "https://people.com/thmb/m8C5BUZfXc8bLWEgn7ENy5Gjap4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/walmart-com-2000-79755491a16e4474a3fa11ed9d0aa7df.jpeg", "https://people.com/thmb/sUQDL_3KRBbLo-2Mk5Bf6NrGGSY=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/wrangler-1-41ade7cb60cf46839e13b4d237245dd3.jpg", "https://people.com/thmb/rH9uJ92bMmutHFHB9kP72ZbgllM=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/sc3a9zane_lc3a9a-earrings_100-2000-f617cedee8ae420cbd569be0383ce6fe.jpg", "https://people.com/thmb/HjrZU9qAg4D4fX9slc-nbqcpPo4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(976x0:978x2)/rose-and-necklace-2000-ded1a32458f2417da01f6c9af05e8171.png", "https://people.com/thmb/Z4TWLpWaZWLArLBkzS5X-B9Yb4g=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/ed-picks-tout-b75c2049591b4239a62130a1d8f97c40.jpg", "https://people.com/thmb/TbYH1PY-zE_9bSC_izGxgB9aTtc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/eds-picks-tout-fb769eab9ea34c43bff9e8d423707ee0.jpg", "https://people.com/thmb/jWjV-sfFwDgAnI9utMLAKcwiDYA=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/the-reeds-j-crew-2000-61370b0c187a4ed59e3e0fadc555acf2.jpg", "https://people.com/thmb/cEbJQKoY-DCS40-JlCY8REWnOGo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/sunnies-c5450a2e79d24dc588dd7ec8a02a95bf.jpg", "https://people.com/thmb/449KhWE0Qo9tIT8RVfr7rlDiZ78=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/cv811p63501b739lg_dancing_man_blk-soft_whitedelora_fitted_crew_nk_dress_002-c06867696e184c5d81e43f907f527958.jpg", "https://people.com/thmb/coxchbQZlkgjkfOGskPXx_IZ4uI=/2000x1333/filters:fill(auto,1)/new-launches-roxy-1-2000-e826eae68cee40b0900bf1dfe34df810.jpg", "https://people.com/thmb/pE40FwreDLwYY6xmPS419o7FOCk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(650x0:652x2)/new-launches-roxy-3-2000-177edbd0268c41b3ba43c10e672a65cf.jpg", "https://people.com/thmb/6zf6O6eOzbPCOqZVYMyydATuUto=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(734x143:736x145)/good-american-denim-1-4249aa09e93a467b9eb9b75174c6dcc4.jpg", "https://people.com/thmb/ImzQZCqapEUv8FrvwVfR-AnVLD8=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(408x0:410x2)/on_figure_121_1024x1024-4a8c952770dc4908be4c680076f20314.jpg", "https://people.com/thmb/ut8pkXyfpnySLmeuj4fdkQxdmJg=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(575x0:577x2)/new-launches-roxy-2-2000-3d02e607b50b4a2183d1269f140cbc22.jpg", "https://people.com/thmb/2jMqc6qcQodWKVMV4cHnYgGMitY=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(624x0:626x2)/lulu-bb404d3efa4e4743aba91c98bf14272a.jpg", "https://people.com/thmb/fGF_pKlWUYCsVUaqHHdQgr065uo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(748x0:750x2)/khloe-k_s2_163v2-copy-2000-a7feb8c4191d4e4e8b7d8c5bca3f49cb.jpg", "https://people.com/thmb/KSIXyPWXmMtVS3leb-INPAqU9kE=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(731x0:733x2)/aritzia-2-2000-04eccb72facc4c628eddf09f4fff7705.jpg", "https://people.com/thmb/lGKXXxl_HnWblESyRScUxazP_N8=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/petite-bezel-studs-061dec08c4224aa3957406ef2d9664b4.jpg", "https://people.com/thmb/_YLHr-fqKRU4_zzbOo77YzlqVuw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/sc3a9zane_mona-cuff_160-1-2000-988d539a92754cc3bd95f0d87269d461.jpg", "https://people.com/thmb/loP8TNVbusJYCIbBbQ3ldfI2apI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/2018-05-30_fa18_pow_lookbook2763-2000-fc66b20abf5640c293aca0d910d46d04.jpg", "https://people.com/thmb/D-k04CZ7PEwqPdWoWH995WSf4NI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/jayne-look-1-2000-3cb2a95cb30b41e6ab567a2d304302a2.jpg", "https://people.com/thmb/JXhAmG5-Op-Y0k4EX3Z1eHWqVjk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/sv811134301d629haring-collageproduct_03-76e43a4a7993412fa5369efd94bfb78c.jpg", "https://people.com/thmb/jK2_anOJK0tLPpsg7nl4436boPI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/jeans-tout3-3974efc7f8bc4d73a8c4254cca7e6488.jpg", "https://people.com/thmb/7cQTl6daQRHxWp9JxXwvH5uBjdo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/08_092-eec08bfd3a6d40bd9867a21f390720a4.jpg", "https://people.com/thmb/zIl-Qx8IesY2fR1agU9fAtzGll0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(764x239:766x241)/Markarian-5a5707585a4f4a408f3c9fd776ade1b5.jpg", "https://people.com/thmb/dt_nRAJ1Tsbedq4f7LhPrQqTk54=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/everlane-5f9f278167c0467bae10f047735ad8f9.jpg", "https://people.com/thmb/9QNbtico8x26hxFVC0Sv1qOFVP8=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(799x0:801x2)/efxpsny7639-2000-feabb0da1a5b4190a4803feff939a7d1.jpg"], "top_img": "https://people.com/thmb/coxchbQZlkgjkfOGskPXx_IZ4uI=/2000x1333/filters:fill(auto,1)/new-launches-roxy-1-2000-e826eae68cee40b0900bf1dfe34df810.jpg", "keywords": [], "authors": ["People Staff"], "canonical_link": "https://people.com/style/best-new-fashion-launches-editors-love/", "title": "The Best New Fashion Launches to Shop Right Now", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Fashion launches and celebrity collaborations to buy right now from your favorite stores. Shop them and more at PEOPLE.", "emailcontenttype": "LISTSC", "emailvertical": "PEOPLE", "sailthru.author": "People Staff", "revenuegroup": "COMMERCE", "article": {"section": "People", "opinion": "false", "author": "https://www.facebook.com/peoplemag"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "og": {"type": "article", "site_name": "Peoplemag", "url": "https://people.com/style/best-new-fashion-launches-editors-love/", "title": "The Best New Fashion Launches to Shop Right Now", "description": "Fashion launches and celebrity collaborations to buy right now from your favorite stores. Shop them and more at PEOPLE.", "image": "https://people.com/thmb/coxchbQZlkgjkfOGskPXx_IZ4uI=/2000x1333/filters:fill(auto,1)/new-launches-roxy-1-2000-e826eae68cee40b0900bf1dfe34df810.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "The Best New Fashion Launches to Shop Right Now", "description": "Fashion launches and celebrity collaborations to buy right now from your favorite stores. Shop them and more at PEOPLE.", "image": "https://people.com/thmb/coxchbQZlkgjkfOGskPXx_IZ4uI=/2000x1333/filters:fill(auto,1)/new-launches-roxy-1-2000-e826eae68cee40b0900bf1dfe34df810.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.19.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.19.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.19.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.19.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.19.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}