{"url": "https://web.archive.org/web/20180206011458/https://www.forbes.com/sites/scottmendelson/2017/09/11/box-office-why-fifty-shades-freed-is-already-a-huge-hit/", "text": "Universal\n\nAt this point in time, the whole “teaser for the trailer” thing is so normalized that it is no longer surprising. But there are two interesting bits right off the bat about this Fifty Shades Freed teaser. First, at 66 seconds, it’s damn well long enough to be the full trailer. At this point, you’re either in or you’re out concerning this third film in E.L. James’ bondage-flavored romantic drama. Aside from maybe Star Wars: The Last Jedi, I can’t think of a movie that needs less of an actual marketing campaign, at least in terms of spoiler-y footage.\n\nSecond, it teases the actual theatrical trailer for November, meaning this is a two-months’ early sneak peak of said trailer. That may be a something of a record. Sony dropped a Ghostbusters trailer teaser on Feb. 14, 2016 in advance of its March 3, 2016 trailer launch, but I can’t think of any movie that debuted their trailer teaser two months in advance. I can only assume we’ll see the trailer attached to STX Entertainment’s A Bad Moms Christmas unless Universal/Comcast Corp. feels like being funny and attaching it to Sony’s The Star. As for the actual teaser, the footage is at least somewhat promising a bit kinky sex than we had the last time out. So at least this time fans might get what they paid for.\n\nFifty Shades Darker was essentially about how Anastasia Steele (still a great name for a 007 villain) molded Mr. Grey into “husband material,” which meant a lot more conventional sex but a lot less kink. Also of note, we get more conventional violence this time out, including a guy who I presume is Steele’s former boss holding a knife to her throat. So for those who want rescue fantasies with their BDSM, there you go.\n\nTwenty dollars says we’ll get far more thinkpieces about Steele’s consensual sexual activities than about the violence directed upon her sans her consent, but that’s a conversation for another day. At this point, the Fifty Shades trilogy is a lot like The Hobbit trilogy, in that the first film made so much money ($571 million worldwide) that the next two are essentially paid for. Sam Taylor-Johnson’s Fifty Shades of Grey cost $40 million and James Foley’s Fifty Shades Darker cost $55m. Assuming Fifty Shades Freed cost around the same (let’s say $65m to potentially over exaggerate just in case), we’re looking at a trilogy that cost Universal and friends $160m.\n\nSo the first film alone made back 3.5x the budget of the entire series. And since the sequel made $379 million worldwide, we’re already at $950m worldwide with one more to go. Even if this installment takes another dive and makes (spitballing it here) $250m worldwide, we’re still looking at a $1.2 billion total gross for these R-rated, female-targeted erotic dramas. Even if it pulls a Divergent, it's still all gravy (and the franchise is over after this one anyway). It’s almost like Universal made a non-tentpole movie into an event by creating an A-level release out of something entirely unlike anything else in the marketplace and targeted at an underserved demographic. Hmm…\n\nFifty Shades Freed, starring Dakota Johnson and Jamie Dornan, opens Feb. 9, 2018.", "images": ["https://web.archive.org/web/20180206011458im_/https://2.gravatar.com/avatar/5e0887272964be6b258946209a00ffa2?s=400&#038;d=mm&#038;r=g", "https://web.archive.org/web/20180206011458im_/https://thumbor.forbes.com/thumbor/600x315/smart/https%3A%2F%2Fblogs-images.forbes.com%2Fscottmendelson%2Ffiles%2F2017%2F09%2Ffifty-shades-freed-FSF_Tsr1Sheet_RGB_0830_1_rgb-1200x861.jpg"], "top_img": "https://web.archive.org/web/20180206011458im_/https://thumbor.forbes.com/thumbor/600x315/smart/https%3A%2F%2Fblogs-images.forbes.com%2Fscottmendelson%2Ffiles%2F2017%2F09%2Ffifty-shades-freed-FSF_Tsr1Sheet_RGB_0830_1_rgb-1200x861.jpg", "keywords": [], "authors": ["Scott Mendelson"], "canonical_link": "https://web.archive.org/web/20180206011458/https://www.forbes.com/sites/scottmendelson/2017/09/11/box-office-why-fifty-shades-freed-is-already-a-huge-hit/", "title": "Box Office: Why 'Fifty Shades Freed' Is Already A Huge Hit", "meta_data": {"viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "apple-itunes-app": "app-id=588647136", "fb": {"app_id": 123694841080850}, "og": {"site_name": "Forbes", "title": "Box Office: Why 'Fifty Shades Freed' Is Already A Huge Hit", "image": "https://web.archive.org/web/20180206011458im_/https://thumbor.forbes.com/thumbor/600x315/smart/https%3A%2F%2Fblogs-images.forbes.com%2Fscottmendelson%2Ffiles%2F2017%2F09%2Ffifty-shades-freed-FSF_Tsr1Sheet_RGB_0830_1_rgb-1200x861.jpg", "updated_time": "2017-09-11T16:23:28-04:00", "url": "https://web.archive.org/web/20180206011458/https://www.forbes.com/sites/scottmendelson/2017/09/11/box-office-why-fifty-shades-freed-is-already-a-huge-hit/", "description": "'Fifty Shades Of Grey' paid for the entire trilogy nearly four times over.", "type": "article"}, "twitter": {"site": "@forbes", "card": "summary_large_image", "title": "Box Office: Why 'Fifty Shades Freed' Is Already A Huge Hit", "description": "'Fifty Shades Of Grey' paid for the entire trilogy nearly four times over.", "image": "https://web.archive.org/web/20180206011458im_/https://thumbor.forbes.com/thumbor/600x300/smart/https%3A%2F%2Fblogs-images.forbes.com%2Fscottmendelson%2Ffiles%2F2017%2F09%2Ffifty-shades-freed-FSF_Tsr1Sheet_RGB_0830_1_rgb-1200x861.jpg", "creator": "@scottmendelson"}, "description": "'Fifty Shades Of Grey' paid for the entire trilogy nearly four times over.", "author": "Scott Mendelson", "article": {"publisher": "https://www.facebook.com/forbes", "author": "Scott Mendelson", "section": "Business", "section_url": "https://www.forbes.com/business/", "id": "blogAndPostId/blog/post/2595-44017", "published": "2017-09-11", "modified": "2017-09-11"}}, "movies": [], "publish_date": 1505084400.0, "source": "https://web.archive.org", "summary": ""}