{"url": "https://en.wikipedia.org/wiki/Chrissy_Teigen", "text": "American model, television personality, executive producer, and author\n\nChristine Diane Teigen[2][3] (born November 30, 1985)[4] is an American model and television personality. She made her professional modeling debut in the annual Sports Illustrated Swimsuit Issue in 2010 and later appeared on the 50th anniversary cover alongside Nina Agdal and Lily Aldridge in 2014. She formerly appeared as a panelist on the syndicated daytime talk show FABLife (2015–2016). She co-hosted the musical competition series Lip Sync Battle (2015–2019) with LL Cool J and was a judge on the comedy competition series Bring the Funny (2019). Teigen has also authored two cookbooks.\n\nEarly life [ edit ]\n\nChristine Diane Teigen was born on November 30, 1985, in Delta, Utah.[5] Her mother, Vilailuck, is from Thailand, while her father, Ron, is an American of Norwegian descent.[5][6] Her surname is usually pronounced ; despite this, she stated that she prefers the pronunciation .[3] After she was born, she and her family relocated to Snohomish, Washington, where her parents ran a tavern.[5]\n\nWhen Teigen was 15, her father relocated them to Huntington Beach, California, after her mother returned to Thailand. During this time, she worked at a surf shop, where she landed a modeling campaign with clothing company Billabong through the shop's clients, and was discovered by a photographer.[5] In her early modeling career, Teigen lived in Miami, Florida, \"for four years, six months out of the year\".[7]\n\nCareer [ edit ]\n\nTeigen was a briefcase model on the game show Deal or No Deal during the pilot and first season.[8] She appeared in the Sports Illustrated swimsuit issue in 2010, and was named \"Rookie of the Year\".[9] Her friend and fellow model Brooklyn Decker had introduced her to the people at Sports Illustrated to cast her.[10] The following year, she designed and debuted a capsule collection with swimwear designer DiNeila Brazil at Mercedes-Benz Fashion Week Swim in Miami as well as appeared as a featured character in the 2011 Electronic Arts video game Need For Speed: The Run.[11] She also filmed a Cooking Channel special titled Cookies and Cocktails.[12]\n\nBattleship in Sydney in 2012 Teigen at the premiere of the filmin Sydney in 2012\n\nTwo years later, Teigen was the host of the competition series Model Employee on VH1.[13] She was also featured on another Cooking Channel special, titled Chrissy Teigen's Hungry, detailing her wedding menu tasting with then-fiancé, John Legend.[14] In October 2013, she appeared in Legend's music video for the song \"All of Me\", which also features footage from their wedding.[15] In April 2014, Teigen played a fictionalized version of herself as a relationship counselor in an Inside Amy Schumer sketch.[16] That same year, she appeared on the 50th anniversary cover of the Sports Illustrated Swimsuit Issue with Nina Agdal and Lily Aldridge.[17][18] In January 2015, Teigen guest starred on the sitcom The Mindy Project as the girlfriend of the man who was the main character's first sexual partner.[19] In April, she became a co-host of the musical competition series Lip Sync Battle alongside LL Cool J.[20] She co-hosted the 2015 Billboard Music Awards with Ludacris.[21]\n\nFrom September 2015 until June 2016, Teigen was a food stylist and panelist on Tyra Banks's syndicated daytime talk show, FABLife.[22] In February 2016, she published a book titled Cravings: Recipes for All of the Food You Want to Eat, which went on to become a New York Times bestseller and the second-best selling cookbook of the year.[23][24] The following year, Teigen released a clothing line in collaboration with the fashion company Revolve.[25] In September 2018, she released her second book, titled Cravings: Hungry For More.[26] Simultaneously, she released a line of cookware through Target.[27] In 2019, she was included on Time's list of the 100 most influential people in the world.[28] Teigen started a YouTube channel in 2019. The channel consists of family cooking content and tutorials featuring Teigen, her mother, her husband, and two children.[29]\n\nThe following year, Teigen appeared as a judge for the comedy competition series Bring the Funny.[30] In November, she launched a cooking website, Cravings by Chrissy Teigen, which features recipes as well as restaurant and entertaining tips.[31] Chrissy's Court, a courtroom-style series starring Teigen, debuted in April 2020 on Quibi. Teigen also serves as executive producer for the series.[32] The series survived the platform's demise later that year, moving to The Roku Channel in May 2021 and premiering its second season in June 2022.[33] It was the platform's most watched unscripted premiere ever. The third season is scheduled to premiere on October 21, 2022.[34]\n\nAs of May 2021, Target had stopped carrying her cookware line, which a company spokesperson said was a \"mutual decision\".[35]\n\nPolitical views and activism [ edit ]\n\nTeigen identifies herself as a feminist and intends raising her children as such.[36] She made donations to nonprofit organization Planned Parenthood in 2015 following the Colorado Springs Planned Parenthood shooting and again in 2017.[37][38] She and her husband donated $25,000 to March for Our Lives, a rally against gun violence, in 2018.[39] A supporter of immigrants' rights, Teigen delivered a speech at a Families Belong Together event in Los Angeles that same year.[40] In May 2020, she donated $200,000 to bail and legal defense funds to aid activists arrested during protests in response to the murder of George Floyd.[41]\n\nTeigen is a vocal critic of former U.S. President Donald Trump.[42] In June 2018, she donated $72,000 to the American Civil Liberties Union, a nonprofit organization, to commemorate Trump's 72nd birthday.[43] Teigen and her husband endorsed Elizabeth Warren during the 2020 Democratic Party presidential primaries.[44] The couple endorsed Joe Biden in the 2020 United States presidential election.[45]\n\nPersonal life [ edit ]\n\nTeigen became engaged to singer John Legend in December 2011, after four years of dating.[46] The couple first met while filming his 2006 music video for the song \"Stereo\", in which she played his love interest.[47] They married in September 2013,[47] celebrating their wedding on September 14 in Como, Italy.[1] Legend's song \"All of Me\" was dedicated to her.[48] They reside in Beverly Hills, California.[5] Teigen and Legend have two children, a daughter born in April 2016 and a son born in May 2018.[49][50] In 2020, the couple were expecting a third child,[51] but Teigen later revealed that she aborted the pregnancy in September due to pregnancy complications which risked her life.[52] On August 3, 2022, she announced on Instagram that she is expecting another child.[53]\n\nIn May 2021, television personality Courtney Stodden said that in 2011, during her marriage as a minor to actor Doug Hutchison, Teigen tweeted and privately messaged them urging them to kill themselves.[54][55] Teigen subsequently apologized to Stodden, saying she was sad and mortified at her past self, whom she described as \"an insecure, attention seeking troll.\"[56] Stodden accepted her apology but deemed it an attempt to save her business partnerships.[56] A month later, Teigen released another apology in a lengthy blog post admitting to cyberbullying.[57] Fashion designer Michael Costello and television personality Farrah Abraham then respectively spoke out about being targets of her attacks, with Costello posting screenshots of taunting messages from Teigen.[58] In response to Costello, Teigen stated that his screenshots had been faked and shared screenshots of praiseful messages from Costello, after which the designer said he had evidence to verify his claims.[59][60]\n\nOn July 18, 2022, Teigen celebrated one year of sobriety from drinking alcohol.[61]\n\nFilmography [ edit ]\n\nFilm and television [ edit ]\n\nMusic videos [ edit ]\n\nVideo games [ edit ]\n\nYear Title Role Notes Ref. 2011 Need for Speed: The Run Nikki Blake Voice [66]\n\nBibliography [ edit ]\n\nTeigen, Chrissy. Cravings: Hungry for More . Random House, 2018 ISBN 9781524759735.\n\n. Random House, 2018 ISBN 9781524759735. Teigen, Chrissy. Cravings: All Together. Random House, 2021. ISBN 9780593135426.", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Chrissy_Teigen_Sydney_2012_%282%29.jpg/170px-Chrissy_Teigen_Sydney_2012_%282%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Christine_Teigen_2012_Shankbone.JPG/1200px-Christine_Teigen_2012_Shankbone.JPG", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Chrissy_Teigen_%40_L.A.%27s_Families_Belong_Together_March_01.jpg/200px-Chrissy_Teigen_%40_L.A.%27s_Families_Belong_Together_March_01.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Christine_Teigen_2012_Shankbone.JPG/220px-Christine_Teigen_2012_Shankbone.JPG"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Christine_Teigen_2012_Shankbone.JPG/1200px-Christine_Teigen_2012_Shankbone.JPG", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Chrissy_Teigen", "title": "Chrissy Teigen", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/56/Christine_Teigen_2012_Shankbone.JPG/640px-Christine_Teigen_2012_Shankbone.JPG", "width": 640, "height": 800}, "title": "Chrissy Teigen - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}