{"url": "https://www.hollywoodreporter.com/news/gladiator-cast-reunites-at-romes-colosseum-charity-screening-1117947", "text": "Rome hosted a very special screening for the 18th anniversary of Ridley Scott’s Gladiator on Wednesday evening for 350 lucky guests. Castmembers Russell Crowe, Connie Nielsen and Tomas Arana reunited to present the film under the stars with the Colosseum as its backdrop.\n\nA live orchestra played the famous Hans Zimmer score with vocals performed by Lisa Gerrard, co-writer of the Gladiator soundtrack.\n\nThe event was a fundraiser for Rotary’s End Polio Now initiative in partnership with CineConcerts, Forum Music Village, and the Parco Archeologico del Colosseo. Guests included Rotary members, Italian officials and Gladiator fans who purchased tickets to support the iniatitve.\n\nCrowe won an Academy Award for best actor for the film, which swept the 2001 Oscars, also taking home best picture, best costume design, best sound and best visual effects, and earning an additional seven nominations.\n\n“Tonight, I will be watching Gladiator for the first time since it premiered. For the people of Rome, they have a special connection to this film, so watching this screening with them will be an emotional experience for me,” Crowe told the crowd before the screening.\n\nThe actor received his own surprise when legendary A.S. Roma football player Francesco Totti presented Crowe with his very owned signed jersey, with the name of his Gladiator character ‘Maximus’ emblazoned on the back.\n\nNielsen was dressed the part of a Roman goddess in a long, black flowing Valentino gown and cape, with a matching gold entwined headdress.\n\n“It is both surreal and exciting to be in Rome to celebrate Gladiator‘s anniversary at the actual Colosseum, a building that represents so much rich history,” Nielsen told THR.\n\n“The event is not just about reuniting with Russell and other castmembers, whom I considered my family for those five months of filming, but also to also raise awareness about Rotary International’s work in ending polio forever,” she said. “I believe we all have the collective power and responsibility to help and empower those around the world, and promoting health care is essential.”\n\nRotary’s mission for a polio-free planet has reduced cases globally by 99.9 percent, helping immunize 2.5 billion children in 122 countries. Every year the organization hosts a World Polio Day on October 24 to further raise awareness.\n\nLast fall, upper levels of the Colosseum were opened to the public for the first time in 40 years, offering unprecedented views of the amphitheatre.\n\nIn ancient times the arena could hold up to 80,000 spectators to view public events and gladiator contests. Rome’s Colosseum is currently undergoing a multi-million-euro restoration funded by Italian fashion house Tod’s, with possible plans to renovate the arena floor, opening it up to further cultural events.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/06/russell_crowe_connie_nielsen_and_tomas_arana_fundraiser.jpg?w=1296&h=730&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/russell_crowe_connie_nielsen_and_tomas_arana_fundraiser.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/russell_crowe_connie_nielsen_and_tomas_arana_fundraiser.jpg?w=1024", "keywords": [], "authors": ["Ariston Anderson"], "canonical_link": "https://www.hollywoodreporter.com/news/general-news/gladiator-cast-reunites-at-romes-colosseum-charity-screening-1117947/", "title": "‘Gladiator’ Cast Reunites at Rome’s Colosseum for Charity Screening", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The cast of 'Gladiator', including Russell Crowe and Connie Nielsen, reunited at Rome's Colosseum for a charity event to raise money for the End Polio Now campaign.", "news_keywords": "international, Russell Crowe", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Ariston Anderson", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1117947, "title": "'Gladiator' Cast Reunites at Rome's Colosseum for Charity Screening", "published_at": "2018-06-06 23:34:54", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/russell_crowe_connie_nielsen_and_tomas_arana_fundraiser.jpg?w=1024", "comment_count": 0, "tags": "Russell Crowe", "topics": "News", "body": "Rome hosted a very special screening for the 18th anniversary of Ridley Scott's Gladiator on Wednesday evening for 350 lucky guests. Castmembers Russell Crowe, Connie Nielsen and Tomas Arana reunited to present the film under the stars with the Colosseum as its backdrop. \r\nA live orchestra played the famous Hans Zimmer score with vocals performed by Lisa Gerrard, co-writer of the Gladiator soundtrack.\r\nThe event was a fundraiser for Rotary's End Polio Now initiative in partnership with CineConcerts, Forum Music Village, and the Parco Archeologico del Colosseo. Guests included Rotary members, Italian officials and Gladiator fans who purchased tickets to support the iniatitve.\r\nCrowe won an Academy Award for best actor for the film, which swept the 2001 Oscars, also taking home best picture, best costume design, best sound and best visual effects, and earning an additional seven nominations.\r\n“Tonight, I will be watching Gladiator for the first time since it premiered. For the people of Rome, they have a special connection to this film, so watching this screening with them will be an emotional experience for me,” Crowe told the crowd before the screening.\r\nThe actor received his own surprise when legendary A.S. Roma football player Francesco Totti presented Crowe with his very owned signed jersey, with the name of his Gladiator character 'Maximus' emblazoned on the back.\r\nNielsen was dressed the part of a Roman goddess in a long, black flowing Valentino gown and cape, with a matching gold entwined headdress. \r\n\"It is both surreal and exciting to be in Rome to celebrate Gladiator's anniversary at the actual Colosseum, a building that represents so much rich history,\" Nielsen told THR.\r\n\"The event is not just about reuniting with Russell and other castmembers, whom I considered my family for those five months of filming, but also to also raise awareness about Rotary International's work in ending polio forever,\" she said. \"I believe we all have the collective power and responsibility to help and empower those around the world, and promoting health care is essential.\"\r\nRotary's mission for a polio-free planet has reduced cases globally by 99.9 percent, helping immunize 2.5 billion children in 122 countries. Every year the organization hosts a World Polio Day on October 24 to further raise awareness. \r\nLast fall, upper levels of the Colosseum were opened to the public for the first time in 40 years, offering unprecedented views of the amphitheatre.\r\nIn ancient times the arena could hold up to 80,000 spectators to view public events and gladiator contests. Rome's Colosseum is currently undergoing a multi-million-euro restoration funded by Italian fashion house Tod's, with possible plans to renovate the arena floor, opening it up to further cultural events.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Gladiator’ Cast Reunites at Rome’s Colosseum for Charity Screening", "url": "https://www.hollywoodreporter.com/news/general-news/gladiator-cast-reunites-at-romes-colosseum-charity-screening-1117947/", "description": "The cast of ‘Gladiator’, including Russell Crowe and Connie Nielsen, reunited at Rome’s Colosseum for a charity event to raise money for the End Polio Now campaign.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/russell_crowe_connie_nielsen_and_tomas_arana_fundraiser.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2018-06-06T23:34:54+00:00", "modified_time": "2018-06-18T09:29:54+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Gladiator’ Cast Reunites at Rome’s Colosseum for Charity Screening", "description": "The cast of ‘Gladiator’, including Russell Crowe and Connie Nielsen, reunited at Rome’s Colosseum for a charity event to raise money for the End Polio Now campaign.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/russell_crowe_connie_nielsen_and_tomas_arana_fundraiser.jpg?w=1296"}}, "movies": [], "publish_date": 1528328094.0, "source": "https://www.hollywoodreporter.com", "summary": ""}