{"url": "https://www.nbcnews.com/news/us-news/gymnastics-doctor-larry-nassar-sentenced-175-years-sex-abuse-n840341", "text": "After a remarkable hearing that featured gut-wrenching statements from 156 of his accusers and an apology that the judge said rang hollow, former Olympic gymnastics doctor Larry Nassar was sentenced Wednesday to 40 to 175 years in prison for molesting young girls under the guise of treatment.\n\n\"You do not deserve to walk outside of a prison ever again,\" Judge Rosemarie Aquilina said in the Ingham County, Michigan, courtroom where Nassar was forced to listen to victims for seven days before learning his fate.\n\n\"I just signed your death warrant,\" she added.\n\nNassar, 54, agreed to a minimum 40-year sentence when he pleaded guilty last year to seven counts of first-degree criminal sexual misconduct in Ingham County. He still faces sentencing in Eaton County for three more counts, and he's already been sentenced to 60 years in federal prison for possession of child pornography.\n\nThe judge could have given Nassar a stiffer sentence than the one he agreed to, but that would have given him the option of withdrawing his plea and asking for a trial.\n\nRelated: What's next in the sex-abuse case of gymnastics doctor Larry Nassar?\n\nBefore the sentence was handed down, Nassar was allowed to speak. Turning to the victims sitting behind him, he tearfully said their statements had shaken him to the core.\n\n\"What I am feeling pales in comparison to [your] pain, trauma and emotional destruction,\" he said. \"There are no words to describe the depth and breadth of how sorry I am for what has occurred. An acceptable apology to all of you is impossible to write or convey.\n\n\"I will carry your words with me for the rest of my days.\"\n\nA victim reacts as Larry Nassar speaks during his sentencing hearing in Lansing, Michigan on Jan. 24, 2018. Brendan McDermid / Reuters\n\nIf Nassar thought the statement would earn him sympathy, it failed.\n\nThe judge took out a six-page letter he sent the court last week in which he insisted what he had done to the victims \"was medical not sexual,\" that he was a \"good doctor\" and the victim of a media frenzy, and that prosecutors had pressured him to to admit to things he had not done.\n\nHe complained that his patients had turned on him. \"'Hell hath no fury like a woman scorned,'\" the judge read aloud, her voice full of scorn.\n\nShe asked him, \"Would you like to withdraw your plea?\"\n\n\"No, your honor,\" he said.\n\n\"Because you're guilty aren't you?\" she pressed.\n\n\"I accept my plea,\" he said.\n\nAquilina said she simply didn't believe that Nassar was owning up to what he pleaded to: penetrating minors with ungloved hands for his own sexual pleasure.\n\n\"I wouldn't send my dogs to you, sir,\" she said.\n\nAfter the hearing, some victims found it difficult to put into words their feelings about the sentence.\n\n\"It's overwhelming,\" victim Sterling Reithman said after the hearing. \"This whole process has been so long and so difficult, and so to finally have some answers and finally have this all culminate into one day: it's a lot to take in.\"\n\nNassar was the team doctor for USA Gymnastics for two decades and had a busy sports medicine practice at Michigan State University — and both institutions have been shaken by criticism for how they handled allegations against him before they became public.\n\nOn Wednesday night, MSU President Lou Anna K. Simon called the accounts \"tragic, heartbreaking and personally gut-wrenching,\" though she noted that the MSU Board had vouched for her \"integrity and the fact that there is no cover-up.\"\n\nNevertheless, despite her support for an investigation into the matter surrounding Nassar's misconduct at MSU, she said she thought it would be best for her to resign.\n\nThroughout my career, I have consistently and persistently spoken and worked on behalf of Team MSU,\" she said. \"I have tried to make it not about me. I urge those who have supported my work to understand that I cannot make it about me now. Therefore, I am tendering my resignation as president according to the terms of my employment agreement.\"\n\nMeanwhile, USA Gymnastics said it supported Nassar's sentence and any further investigation.\n\n\"USA Gymnastics supports an independent investigation that may shine light on how abuse of the proportion described so courageously by the survivors of Larry Nassar could have gone undetected for so long and embraces any necessary and appropriate changes,\" the organization said. \"USA Gymnastics and the [United States Olympic Committee] have the same goal — making the sport of gymnastics, and others, as safe as possible for athletes to follow their dreams in a safe, positive and empowered environment.\"\n\nAn investigation by The Indianapolis Star in September 2016 first disclosed Nassar had been accused by two former patients of sexually assaulting them under the guise of medical treatments, penetrating them with ungloved hands without their permission.\n\nThat unleashed a flood of horrifyingly similar allegations. Nassar pleaded not guilty to all charges and his lawyers insisted his procedures were legitimate, but most of his defenders vanished after the child pornography was found — and he ultimately changed all his pleas.\n\nA year later, some of the most famous names in gymnastics were added to the list: McKayla Maroney, Aly Raisman and Gabby Douglas from the 2012 \"Fierce Five\" Olympics team. Simone Biles, who won gold in 2016, said last week that she also had been abused by Nassar, and Jordyn Wieber of the 2012 team revealed her story at the sentencing hearing.\n\nMore than 150 victims gave impact statements at a marathon sentencing hearing for Larry Nassar. Top row, from left, Mattie Larson, Emma Ann Miller and Megan Ginter; middle row, Jordyn Wieber, Olivia Cowan and Kyle Stephens; bottom row, Jessica Smith, Taylor Cole and Aly Raisman. Reuters; Getty Images\n\nAlthough Nassar admitted he molested seven girls — including a family friend, starting when she was 6 — the judge allowed all accusers to speak before she announced the penalty. She could not have imagined the result: a wall-to-wall outpouring of anger, grief, and demands for accountability from world-famous athletes to unknown teenagers.\n\n\"I feel nauseous even standing in front of you,\" 18-year-old Kaylee Lorincz told Nassar, who sat in the witness box crying. \"Like the feeling as if I'm being assaulted by you all over again.\"\n\nLorincz, who said she was 13 when her innocence was stolen, told Nassar she didn't need an apology. What she and the other victims wanted, she said, was accountability from the institutions that employed him.\n\n\"I only hope that when you get a chance to speak, you tell us who knew what and when they knew it,\" she said. \"If you truly want us to heal, you will do this for us.\"\n\nA day earlier, Brooke Hylek offered another suggestion to Nassar.\n\n\"Enjoy hell,\" she said.", "images": ["https://media-cldnry.s-nbcnews.com/image/upload/t_fit-760w,f_auto,q_auto:best/newscms/2018_04/2302856/180123-nassar-victims-mn-1500.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_04/2302816/180123-nassar-hearing-1420.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-760x428,f_auto,q_auto:best/MSNBC/Components/Video/201801/nassar2.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-760w,f_auto,q_auto:best/newscms/2018_04/2304141/180124-larry-nasser-victim-reacts-se-1243p.JPG", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-760x428,f_auto,q_auto:best/MSNBC/Components/Video/201801/f_mo_NassarFinalVictim_180124.jpg"], "top_img": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_04/2302816/180123-nassar-hearing-1420.jpg", "keywords": [], "authors": ["Tracy Connor"], "canonical_link": "https://www.nbcnews.com/news/us-news/gymnastics-doctor-larry-nassar-sentenced-175-years-sex-abuse-n840341", "title": "Gymnastics doctor Larry Nassar gets 40 to 175 years for sex abuse", "meta_data": {"msapplication-config": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/nbcnews/all-other-sizes-PNG.ico/browserconfig.xml", "robots": "max-image-preview:large", "fb": {"app_id": 10150138890205613, "pages": 1508175089456029}, "og": {"site_name": "NBC News", "locale": "en_US", "url": "https://www.nbcnews.com/news/us-news/gymnastics-doctor-larry-nassar-sentenced-175-years-sex-abuse-n840341", "title": "'I signed your death warrant,' judge tells Larry Nassar at sentencing.", "description": "Judge Rosemarie Aquilina said she did not believe the apology that Larry Nassar gave his sex-abuse victims in the courtroom.", "image": {"identifier": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_04/2302816/180123-nassar-hearing-1420.jpg", "secure_url": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_04/2302816/180123-nassar-hearing-1420.jpg", "type": "image/jpeg", "width": 1200, "height": 630}, "type": "article"}, "twitter": {"site": "@NBCNews", "creator": "NBCNews", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1024-512,f_auto,q_auto:best/newscms/2018_04/2302816/180123-nassar-hearing-1420.jpg", "title": "'I signed your death warrant,' judge tells Larry Nassar at sentencing.", "description": "Judge Rosemarie Aquilina said she did not believe the apology that Larry Nassar gave his sex-abuse victims in the courtroom.", "card": "summary_large_image"}, "viewport": "width=device-width, initial-scale=1, user-scalable=yes", "description": "Judge Rosemarie Aquilina said she did not believe the apology that Larry Nassar gave his sex-abuse victims in the courtroom.", "branch": {"deeplink": {"title": "'I signed your death warrant,' judge tells Larry Nassar at sentencing.", "description": "Judge Rosemarie Aquilina said she did not believe the apology that Larry Nassar gave his sex-abuse victims in the courtroom.", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_04/2302816/180123-nassar-hearing-1420.jpg", "type": "article", "unibrow": "U.S. news", "authorName1": "Tracy Connor"}}, "article": {"opinion": "false", "content_tier": "free", "published": "Thu Jan 25 2018 02:04:03 GMT+0000 (UTC)", "modified": "Thu Jan 25 2018 02:04:03 GMT+0000 (UTC)"}, "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_social_share_1024x768_scale,f_auto,q_auto:best/newscms/2018_04/2302816/180123-nassar-hearing-1420.jpg", "next-head-count": 105}, "movies": [], "publish_date": 1516845843.0, "source": "https://www.nbcnews.com", "summary": ""}