{"url": "www.hollywoodreporter.com/news/sean-spicer-tells-hannity-snl-went-line-melissa-mccarthy-impressions-1023505", "text": "White House press secretary Sean Spicer spoke with Fox News’ Sean Hannity to discuss his decision to resign Friday and his thoughts on Saturday Night Live‘s lauded parodies of President Donald Trump’s administration.\n\nIn an interview that aired Friday night on Hannity, Spicer admitted, “I’m a prankster, I like a good joke. I think when it’s funny, it’s funny,” but added, “Sometimes it goes from funny to mean.”\n\nSpicer, who was famously impersonated on SNL by Melissa McCarthy throughout his time as press secretary, noted, “I think that there were parts of it that were funny, but there’s a lot of it that was over the line. It wasn’t funny. It was stupid, or silly, or malicious.” He added, “But there were some skits on late-night television that I did crack up at. … You have to have a little bit of a thick skin if you’re going to do this.”\n\nWhen asked about his sudden resignation announcement, Spicer explained that though Trump didn’t want him to leave, the two eventually came to an agreement on what would be best for the administration.\n\n“He’s been very gracious throughout this process. He wanted to bring some new folks in to help rev up the communications operation,” Spicer said of Trump, who hired new White House communications director and New York financier Anthony Scaramucci. As his first act on the job, Scaramucci announced that Sarah Huckabee Sanders — who had, up until now, acted as Spicer’s deputy and filled in for him in recent weeks as he worked more behind the scenes — would be the new press secretary.\n\n“After reflection, my decision was to recommend to the president that I give Anthony [Scaramucci] and Sarah [Huckabee Sanders] a clean slate to start from so that they can talk about the president’s agenda and help move it forward,” Spicer continued. “He, after some back and forth, understood that the offer that I was making was something that was in the best interest of this administration. I thanked him for the opportunity, and I’m looking forward to watching Anthony and Sarah do a tremendous job.” Spicer added, “I’m leaving it in capable hands.”\n\nWatch the latest video at video.foxnews.com\n\nAccording to those close to the situation, Spicer’s decision to resign comes after he reportedly objected to the hiring of Scaramucci, whom he considered unfit for the position.\n\nSpeaking with Hannity, however, Spicer said he didn’t feel his role was being “diminished” in any way. He explained that he wanted to give Scaramucci and Sanders “the opportunity to operate without me in the way. … I just thought it was in the best interest of our press organization to not have too many cooks in the kitchen.” On Trump’s reaction, Spicer said, “He’s always thinking of others, and I assured him that I would be just fine. … He assured me that he would continue to be as supportive as he always has been.”\n\n.@seanspicer on @POTUS’ reaction to his resignation: “He assured me that he would continue to be as supportive as he always has been.” pic.twitter.com/9gUQ1AhY2a — Fox News (@FoxNews) July 22, 2017\n\nDuring his explanations, Spicer mentioned the new team continuing “the president’s agenda” several times. He also commented on the state of the media and gave his opinions on Trump’s war against “fake news.”\n\n“I think most people aren’t really privy to how stories are developed and what stories make it to the front page or to mainstream media. … I think they’d be shocked and disappointed to see the bias that exists,” Spicer said, “and how members of the media do their job, or don’t do their job.” He noted that reporters now have a “click-bait mentality.”\n\n“By and large, we’re seeing more and more where it’s about the clip or the click,” he added.\n\nAsked by Hannity whether he believes the American people are being served by the media, Spicer noted, “I wouldn’t paint it with a broad brush; I think some, yes … but in a lot of cases, the answer is no.”\n\n.@seanspicer on media: The stories we hear from around the country aren’t necessarily the stories being covered by those in Washington. pic.twitter.com/FUYwLGcvxw — Fox News (@FoxNews) July 22, 2017\n\nWhite House chief of staff Reince Priebus, who was interviewed later in the segment, echoed similar sentiments about media bias and agreed with Spicer on the “over the top” nature of being parodied on late-night TV and SNL.\n\n“Perhaps they should give equal time to another opinion,” said Priebus of the NBC sketch series, adding that Spicer’s job requires thick skin. “You just don’t care what some of this stuff says because you know it’s garbage.”\n\nSpicer’s resignation ended an oft-maligned six-month tenure. He will remain in the position through August.\n\nIn a statement, Trump said of Spicer, “I am grateful for Sean’s work on behalf of the administration and the American people. I wish him continued success as he moves on to other opportunities. Just look at his great television ratings.”\n\nScaramucci also weighed in, saying of Spicer, “He’s a military serviceman, he’s got a great family, and he’s done a great job,” adding that “this is a difficult situation to be in, and I applaud his efforts.”", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/07/gettyimages-816375396-h_2017.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/07/gettyimages-816375396-h_2017.jpg?w=1296&h=730&crop=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/07/gettyimages-816375396-h_2017.jpg?w=1024", "keywords": [], "authors": ["Lauren Huff Meena Jang", "Lauren Huff", "Meena Jang"], "canonical_link": "https://www.hollywoodreporter.com/news/general-news/sean-spicer-tells-hannity-snl-went-line-melissa-mccarthy-impressions-1023505/", "title": "Sean Spicer Says ‘SNL’ Went “Over the Line” in First Post-Resignation Interview on ‘Hannity’", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Spicer also commented on the current state of the media, saying many outlets are \"biased\" with a \"click-bait mentality.\"", "news_keywords": "saturday night live, Sean Hannity", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Meena Jang", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1023505, "title": "Sean Spicer Says 'SNL' Went \"Over the Line\" in First Post-Resignation Interview on 'Hannity'", "published_at": "2017-07-21 18:42:37", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/07/gettyimages-816375396-h_2017.jpg?w=1024", "comment_count": 0, "tags": "Sean Hannity", "topics": "News", "body": "White House press secretary Sean Spicer spoke with Fox News' Sean Hannity to discuss his decision to resign Friday and his thoughts on Saturday Night Live's lauded parodies of President Donald Trump's administration.\r\nIn an interview that aired Friday night on Hannity, Spicer admitted, \"I'm a prankster, I like a good joke. I think when it's funny, it's funny,\" but added, \"Sometimes it goes from funny to mean.\"\r\nSpicer, who was famously impersonated on SNL by Melissa McCarthy throughout his time as press secretary, noted, \"I think that there were parts of it that were funny, but there's a lot of it that was over the line. It wasn't funny. It was stupid, or silly, or malicious.\" He added, \"But there were some skits on late-night television that I did crack up at. ... You have to have a little bit of a thick skin if you're going to do this.\"\r\nWhen asked about his sudden resignation announcement, Spicer explained that though Trump didn't want him to leave, the two eventually came to an agreement on what would be best for the administration.\r\n\"He's been very gracious throughout this process. He wanted to bring some new folks in to help rev up the communications operation,\" Spicer said of Trump, who hired new White House communications director and New York financier Anthony Scaramucci. As his first act on the job, Scaramucci announced that Sarah Huckabee Sanders — who had, up until now, acted as Spicer's deputy and filled in for him in recent weeks as he worked more behind the scenes — would be the new press secretary.\r\n\r\n\"After reflection, my decision was to recommend to the president that I give Anthony [Scaramucci] and Sarah [Huckabee Sanders] a clean slate to start from so that they can talk about the president's agenda and help move it forward,\" Spicer continued. \"He, after some back and forth, understood that the offer that I was making was something that was in the best interest of this administration. I thanked him for the opportunity, and I'm looking forward to watching Anthony and Sarah do a tremendous job.\" Spicer added, \"I'm leaving it in capable hands.\"\r\nWatch the latest video at video.foxnews.comAccording to those close to the situation, Spicer's decision to resign comes after he reportedly objected to the hiring of Scaramucci, whom he considered unfit for the position.\r\nSpeaking with Hannity, however, Spicer said he didn't feel his role was being \"diminished\" in any way. He explained that he wanted to give Scaramucci and Sanders \"the opportunity to operate without me in the way. ... I just thought it was in the best interest of our press organization to not have too many cooks in the kitchen.\" On Trump's reaction, Spicer said, \"He's always thinking of others, and I assured him that I would be just fine. ... He assured me that he would continue to be as supportive as he always has been.\"\r\n\r\n\t.@seanspicer on @POTUS’ reaction to his resignation: \"He assured me that he would continue to be as supportive as he always has been.\" pic.twitter.com/9gUQ1AhY2a\r\n\t— Fox News (@FoxNews) July 22, 2017\r\nDuring his explanations, Spicer mentioned the new team continuing \"the president's agenda\" several times. He also commented on the state of the media and gave his opinions on Trump's war against \"fake news.\"\r\n\"I think most people aren't really privy to how stories are developed and what stories make it to the front page or to mainstream media. ... I think they'd be shocked and disappointed to see the bias that exists,\" Spicer said, \"and how members of the media do their job, or don't do their job.\" He noted that reporters now have a \"click-bait mentality.\"\r\n\"By and large, we're seeing more and more where it's about the clip or the click,\" he added.\r\nAsked by Hannity whether he believes the American people are being served by the media, Spicer noted, \"I wouldn't paint it with a broad brush; I think some, yes ... but in a lot of cases, the answer is no.\"\r\n\r\n\t.@seanspicer on media: The stories we hear from around the country aren’t necessarily the stories being covered by those in Washington. pic.twitter.com/FUYwLGcvxw\r\n\t— Fox News (@FoxNews) July 22, 2017\r\nWhite House chief of staff Reince Priebus, who was interviewed later in the segment, echoed similar sentiments about media bias and agreed with Spicer on the \"over the top\" nature of being parodied on late-night TV and SNL.\r\n\"Perhaps they should give equal time to another opinion,\" said Priebus of the NBC sketch series, adding that Spicer's job requires thick skin. \"You just don't care what some of this stuff says because you know it's garbage.\"\r\nSpicer's resignation ended an oft-maligned six-month tenure. He will remain in the position through August.\r\nIn a statement, Trump said of Spicer, \"I am grateful for Sean's work on behalf of the administration and the American people. I wish him continued success as he moves on to other opportunities. Just look at his great television ratings.\"\r\nScaramucci also weighed in, saying of Spicer, \"He's a military serviceman, he's got a great family, and he's done a great job,\" adding that \"this is a difficult situation to be in, and I applaud his efforts.\"", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Sean Spicer Says ‘SNL’ Went “Over the Line” in First Post-Resignation Interview on ‘Hannity’", "url": "https://www.hollywoodreporter.com/news/general-news/sean-spicer-tells-hannity-snl-went-line-melissa-mccarthy-impressions-1023505/", "description": "Spicer also commented on the current state of the media, saying many outlets are “biased” with a “click-bait mentality.”", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/07/gettyimages-816375396-h_2017.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-07-21T18:42:37+00:00", "modified_time": "2017-07-21T21:28:33+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Sean Spicer Says ‘SNL’ Went “Over the Line” in First Post-Resignation Interview on ‘Hannity’", "description": "Spicer also commented on the current state of the media, saying many outlets are “biased” with a “click-bait mentality.”", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/07/gettyimages-816375396-h_2017.jpg?w=1296"}}, "movies": [], "publish_date": 1500662557.0, "source": "http://www.hollywoodreporter.com", "summary": ""}