{"url": "https://variety.com/2018/music/news/tom-petty-accidental-overdose-autopsy-1202670558/", "text": "Tom Petty’s cause of death was an accidental overdose, his family said in a statement on his website and social media on Friday.\n\n“Our family sat together this morning with the Medical Examiner – Coroner’s office and we were informed of their final analysis that Tom Petty passed away due to an accidental drug overdose as a result of taking a variety of medications,” read the post, written by his widow, Dana, and eldest daughter, Adria.\n\nPetty died after suffering from cardiac arrest on Oct. 2. According to a statement from the Los Angeles County Department of Medical Examiner, obtained by Variety, the musician was taking several medications, including Fentanyl, oxycodone, Xanax, Restoril, and Celexa. Prince died of an overdose of the painkiller Fentanyl in April of 2016, according to an autopsy report.\n\nThe coroner’s report lists Petty’s official cause of death as “multisystem organ failure due to resuscitated cardiopulmonary arrest due to mixed drug toxicity.”\n\nPetty was found at his unresponsive at his Malibu home on Oct. 2 and was taken to the UCLA Medical Center, where he was placed on life support. However, he could not be revived and died hours later.\n\nIn their statement, Petty’s family named a litany of health problems the musician faced, “including emphysema, knee problems and most significantly a fractured hip.” The hip injury worsened, the family explained, while Petty was on his most recent tour.\n\n“On the day he died he was informed his hip had graduated to a full on break and it is our feeling that the pain was simply unbearable and was the cause for his over use of medication,” the statement went on.\n\n“On a positive note we now know for certain he went painlessly and beautifully exhausted after doing what he loved the most, for one last time, performing live with his unmatchable rock band for his loyal fans on the biggest tour of his 40 plus year career,” it concludes. “He was extremely proud of that achievement in the days before he passed.”\n\nLike most rock musicians who came up in the 1960s and ’70s, Petty experimented with drugs and alcohol — marijuana is prominent in the photos from his and the Heartbreakers’ 1976 debut album, and he told biographer Warren Zanes that he’d faced challenges with cocaine use (particularly in the 1980s), alcohol and, in the wake of his 1996 divorce from Jane Benyo, heroin. He said he became clean in 2001.\n\nPetty was laid to rest in a private funeral in Pacific Palisades, Calif., on Oct. 16. Read the full statement below.", "images": ["https://variety.com/wp-content/themes/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://variety.com/wp-content/uploads/2017/10/tom-petty.jpg?w=1000", "https://variety.com/wp-content/uploads/2017/10/tom-petty.jpg?w=681&h=383&crop=1", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif"], "top_img": "https://variety.com/wp-content/uploads/2017/10/tom-petty.jpg?w=1000", "keywords": [], "authors": ["Alex Stedman"], "canonical_link": "https://variety.com/2018/music/news/tom-petty-accidental-overdose-autopsy-1202670558/", "title": "Tom Petty’s Family Says He Died of Accidental Overdose", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://variety.com/wp-content/themes/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Tom Petty's cause of death was an accidental overdose, his family said in a Facebook post on Friday.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199, "pages": 12616252196}, "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202670558, "author": "Alex Stedman", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-01-19T16:27:19"}, "pmc-tag": "sensitive,Tom Petty", "title": "Tom Petty’s Family Says He Died of Accidental Overdose", "pageclass": "article", "pmc-vertical": "music", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-primary-category": "News", "pmc-primary-vertical": "music", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress 6.0.2", "author": "Alex Stedman", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Variety", "application-name": "Variety", "content_type": "Article", "post_id": 1202670558, "title": "Tom Petty's Family Says He Died of Accidental Overdose", "published_at": "2018-01-19 16:27:19", "image": "https://variety.com/wp-content/uploads/2017/10/tom-petty.jpg?w=1000", "comment_count": 9, "tags": "Tom Petty", "topics": "News", "appeared_in_print": "No", "body": "Tom Petty's cause of death was an accidental overdose, his family said in a statement on his website and social media on Friday.\r\n\r\n\"Our family sat together this morning with the Medical Examiner – Coroner’s office and we were informed of their final analysis that Tom Petty passed away due to an accidental drug overdose as a result of taking a variety of medications,\" read the post, written by his widow, Dana, and eldest daughter, Adria.\r\n\r\nPetty died after suffering from cardiac arrest on Oct. 2. According to a statement from the Los Angeles County Department of Medical Examiner, obtained by Variety, the musician was taking several medications, including Fentanyl, oxycodone, Xanax, Restoril, and Celexa. Prince died of an overdose of the painkiller Fentanyl in April of 2016, according to an autopsy report.\r\n\r\nThe coroner's report lists Petty's official cause of death as \"multisystem organ failure due to resuscitated cardiopulmonary arrest due to mixed drug toxicity.\"\r\n\r\nPetty was found at his unresponsive at his Malibu home on Oct. 2 and was taken to the UCLA Medical Center, where he was placed on life support. However, he could not be revived and died hours later.\r\n\r\nIn their statement, Petty's family named a litany of health problems the musician faced, \"including emphysema, knee problems and most significantly a fractured hip.\" The hip injury worsened, the family explained, while Petty was on his most recent tour.\r\n\r\n\"On the day he died he was informed his hip had graduated to a full on break and it is our feeling that the pain was simply unbearable and was the cause for his over use of medication,\" the statement went on.\r\n\r\n\"On a positive note we now know for certain he went painlessly and beautifully exhausted after doing what he loved the most, for one last time, performing live with his unmatchable rock band for his loyal fans on the biggest tour of his 40 plus year career,\" it concludes. \"He was extremely proud of that achievement in the days before he passed.\"\r\n\r\nLike most rock musicians who came up in the 1960s and '70s, Petty experimented with drugs and alcohol — marijuana is prominent in the photos from his and the Heartbreakers' 1976 debut album, and he told biographer Warren Zanes that he'd faced challenges with cocaine use (particularly in the 1980s), alcohol and, in the wake of his 1996 divorce from Jane Benyo, heroin. He said he became clean in 2001.\r\n\r\nPetty was laid to rest in a private funeral in Pacific Palisades, Calif., on Oct. 16. Read the full statement below.", "fragment": "!", "og": {"type": "article", "title": "Tom Petty’s Family Says He Died of Accidental Overdose", "url": "https://variety.com/2018/music/news/tom-petty-accidental-overdose-autopsy-1202670558/", "description": "Tom Petty’s cause of death was an accidental overdose, his family said in a statement on his website and social media on Friday. “Our family sat together this morning with the Medical E…", "site_name": "Variety", "image": {"identifier": "https://variety.com/wp-content/uploads/2017/10/tom-petty.jpg?w=1000", "width": 1000, "height": 563}, "locale": "en_US"}, "article": {"published_time": "2018-01-20T00:27:19+00:00", "modified_time": "2018-01-20T01:14:45+00:00"}, "twitter": {"site": "@variety", "creator": "@a_sted", "card": "summary_large_image", "title": "Tom Petty’s Family Says He Died of Accidental Overdose", "description": "Tom Petty's cause of death was an accidental overdose, his family said in a Facebook post on Friday.", "image": "https://variety.com/wp-content/uploads/2017/10/tom-petty.jpg?w=1000"}}, "movies": [], "publish_date": 1516408039.0, "source": "https://variety.com", "summary": ""}