{"url": "https://www.thewrap.com/2017-espy-awards-22-things-you-didnt-see-on-tv/", "text": "For all the magical moments seen on the live ABC broadcast of the 2017 ESPYs on Wednesday night, there were plenty more moments that you could only see from the red carpet or inside the Microsoft Theater.\n\nFortunately, TheWrap had access to both. From Peyton Manning’s cheeky jokes and making fun of himself, to Kevin Durant‘s pouting, plus plenty of tear-inducing emotional moments — we had an (almost) front row view of all the action.\n\nSee below for 22 things you didn’t see on TV below:\n\nAlso Read: ESPYs 2017 Winners: Simone Biles, Golden State Warriors, Chicago Cubs and More\n\nPeyton Manning’s flawless comic timing\n\nOnce renown for his perfect passes, the former Colts and Broncos QB annihilated the audience with his swift jokes. Entering the stage to an explosion of cheers, Manning immediately mocked former hosts — especially TV has-beens like Jimmy Smits. “The only difference is I knew when to retire,” Manning said. “The ESPYs finally got it right instead of some comedian or entertainer or Matthew Perry,” he added.\n\n\n\nNo one likes Ryan Lochte …\n\n“John Cena is an athlete the same way Ryan Lochte is a reliable witness,” Manning continued, to cheers of agreement. “You’ve got me, Michael Phelps?” Yep, the multi-gold medal winner agreed. Manning went on to say he wouldn’t rip into other athletes … “but here are the jokes I wouldn’t tell.” And went on to rip all the other athletes in the house.\n\n\n\n“Unfortunately my brother Eli can’t be here — that’s what I told the guys at the door,” he said. Manning wasn’t afraid of making some toilet humor at Mark Sanchez’s expense regarding his infamous butt fumble against the Patriots, either. “They wanted me to say anus on TV. My kids are here, I want it to be classy,” Peyton claimed, before dropping in another “anus” mention.\n\nAlso Read: ESPYs: Kevin Durant Pouts Hard Over Brutal Peyton Manning Monologue Dunk (Video)\n\nKevin Durant was not amused\n\nThe joke about Kevin Durant willing to jump to any winning team — even the women’s gymnastics Olympic team — was a hit with the audience but fell flat with the NBA Finals MVP, who was stony-faced when the cameras fell on him. Was that part of the joke or was Durant really pissed? We’re not sure, but it sure did make it funny either way. Durant was just as straight-faced later in the night when he accepted the award for Best Championship Performance.\n\nAlso Read: 25 Most Memorable ESPYs Moments, From Stuart Scott to Justin Timberlake (Photos)\n\nReluctant respect for the Super Bowl LI champions\n\n“Finally ‘cos I am being forced to say it — I love that Tom Brady and Bill Belichick won their fifth Super Bowl. Enough of that,” Manning said, to united groans from the non-New England fans in the house.\n\n\n\n“The Falcons and Matt Ryan will be back,” Manning assured the Super Bowl LI losers. “I want to say that at the beginning of the show, because I know they’ll stop paying attention three-quarters of the way through.” OUCH!\n\n\n\nFeathered guest of honor\n\nAs part of Manning’s self-mocking of all the products he endorses, from pizza to insurance, the Aflac duck had the best seat in the house — and a very dapper bow tie. He also had a slew of admirers snapping pics of him, just like a true Hollywood celebrity.\n\n“I’m in the insurance game now … I’ve got to compete with that damn Aflac duck,” Manning quipped.\n\nJeremy Renner’s broken wings\n\nElizabeth Olsen and Jeremy Renner were the first hosts of the night, with the “Avengers” actor looked quite recovered from a recent on-set accident that broke both his arms. Ironically,he presented the Breakthrough Athlete of the Year Award to Dallas Cowboys Dak Prescott.\n\nAlso Read: Inside the Plans for Tonight's 25th Anniversary ESPY Awards\n\nMr. Clippers was the entertainer of the night\n\nWhen NBA star DeAndre Jordan came to the stage, a die-hard L.A. Clippers fan — known as Clipper Darrell – stood up in a full Clippers gear and shouted “We love you DJ!” Mr. Clippers also seemed to really like Snoop Dogg … and wasn’t afraid to stand up and dance alone. Later, he showed very vocal love for Michelle Obama as well.\n\n\n\n“Saturday Night Live” worthy skit was a hit\n\nWhile no famous face in the audience was safe, Peyton made fun of himself a lot too, with the best take-down being part of a skit about a retirement home called Sunset Acres.\n\n“I’m retired so I live in a retirement home. I’m a veteran but we have real WWII veterans here too, ” Manning said in the hilarious video.\n\n\n\nOf course, every sports story has a rivalry — and Manning had it out for fellow resident Ruth, who just happened to be Tom Brady‘s grandmother.\n\n“Did you win five Super Bowls too?” she asked Peyton while Facetiming with her famous grandkid. Ouch.\n\nOff-camera award winners\n\nAnnouncements during in the commercial break included LeBron James winning Best NBA Player and Serena Williams nabbing Best Tennis Player, both of which scored huge rounds of applause even as guests made quick bathroom or bar breaks.\n\nSerious Stewart\n\nJon Stewart was uncharacteristically serious when he presented the Pat Tillman Award for Service, and paused during his opening to allow the audience to cheer. “Israel ‘DT’ Del Toro looked me in the eyes and said one thing: ‘Fear me bro,'” Stewart said of his first meeting of the recipient.\n\n\n\n“When he heard he was getting the award he texted and said ‘holy cow, my phone is blowing up. Is this what it’s like to be a celebrity?’ Then moments later, he texted back and said ‘blowing up’ probably wasn’t the right thing to say.”\n\nSparking laughter from the crowd even during the emotional presentation, it soon fell into a quiet hush seeing the extent of DT’s injuries, which burned over more than 80 percent of his body in an IED explosion in Afghanistan.\n\nDT’s walk onto the stage to collect his award — and a hug from Stewart — earned him the first standing ovation of the night. And then he dropped the first F-bomb, saying: “I will never f—ing quit on you.” And then he got the second standing ovation of the night.\n\nAlso Read: ESPYs 2017: Red Carpet Arrivals (Photos)\n\nLove for “Dunkirk”\n\nDT’s speech was followed by a special preview of “Dunkirk” featuring Cillian Murphy to keep with the military theme of the segment. It’s safe to say, that it secured a lot of movie ticket sales.\n\nSweating red carpet\n\nIt was hot, hot, hot in the city. With Los Angeles going through a heatwave, the normally steamy ESPYs red carpet was like a sweat box earlier in the day, with athletes and reporters melting in the sun. While the most frequently asked question at the Oscars and Emmys is “who are you wearing?” at the 2017 ESPYs it was “do you have any water?”\n\nCubs confusion\n\nWhen diehard Cubs fan Nick Offerman came out to present the Best Moment award to the Chicago curse-breakers everyone thought the team would accept the award — and seemed genuinely shocked when Bill Murray joined him instead.\n\n“108 years of waiting is hardly a moment … 108 years is momentum,” the “Groundhog Day” actor said. Proving he really is a talented bartender, Murray then grabbed a bottle of champagne from a “janitor” and opened it with a machete. If they were mystified before, no one guessed it was World Series star and “Dancing with the Stars” alum David Ross cleaning the floors. The trio made such a mess with their bubbly that real janitors had to come out to clean it up.\n\nJulian Edelman beats Manning at his own game — again\n\nWhen the Patriots came out to accept the award for Best Game, Edelman dropped a killer joke of his own. “I never thought I’d say this but Peyton Manning is kinda killing it … but we are indoors though,” he said.\n\n\n\nSat in the audience, Manning looked very unimpressed with the jab — but giggling Katie Couric behind him found it hilarious.\n\n\n\nAlso Read: ESPN the Magazine Body Issue: See Julian Edelman, Javier Baez, Caroline Wozniacki and More Pose Nude (Photos)\n\nDance Cam fails\n\nThe ESPYs version of the Dance Cam planted Snapchat style lips on stars’ faces — and proved that Aaron Rodgers shouldn’t go on “Dancing With the Stars” anytime soon. Talk about awkward moves … Michael Phelps had way more rhythm when it landed on him later and super imposed a football helmet on his head. “DWTS” could be another thing Phelps can beat Ryan Lochte at.\n\nJunior Jimmy V winner brings down the house\n\nThe Jimmy V Perseverance Award has gone to famous broadcasters like Stuart Scott and Craig Sager, but this year it was a 15-year-old cancer patient who got everyone in tears.\n\nJarrius “JJ” Robertson has turned into the sports world’s favorite little New Orleans Saints and WWE fan thanks to his brave fight against liver cancer and multiple transplants. The pint-sized superstar is sharing the message of transplants through his endless energy and infectious smile, which he brought to the ESPYs stage. “There he is!” said surprised guests as he strutted to the stage and quoted Jimmy V.\n\nJJ then thanked the Who Dat nation and Stephanie McMahon of the WWE. “She’s much nicer in person than she is on TV,” he quipped. Now that was a speech worthy of Scott or Sager.\n\n“I’ve got no make up left,” one tearful audience member sobbed afterwards.\n\nAlso Read: Inside Aly Raisman, Julian Edelman, and the Black Eyed Peas' Pre-ESPYs Bash (Photos)\n\nLate arrivals\n\nSometime s the g ame doesn’t start ’til the second quarter, and that was true for ESPN’s NFL guru Adam Schefter, who came in with his family an hour into the show and played usher getting them comfortably seated for the remainder of the ESPYs.\n\nEmotional and thankful Berman\n\nAfter losing his wife in a car crash just a few months ago, there was ripple of sympathy in the audience when Chris Berman came out to pay tribute to late “SportsCenter” host John Saunders. Talking of Saunders losing his battle with cancer before introducing the ESPYs In Memoriam section, Berman’s voice broke as he thanked everyone for the support after his wife’s death.\n\nGallant performed a melodic song over footage of the sports greats lost this year — but it was Craig Sager and Arnold Palmer that prompted eruptions from the audience.\n\nSmooth jazz soundtrack\n\nHouse band Crown and the M.O.B. added some smooth jazz moves to the commercial breaks — and even the king of product endorsements Peyton Manning appreciated that they were more fun to listen to than insurance ads. “Karaoke time,” didn’t quite get Steph Curry or Odell Beckham Jr. up singing to “Gin and Juice,” however.\n\n\n\nVin Scully is the real mayor of L.A.\n\nIn the City of Angels a few miles from both Dodger Stadium and Hollywood, it’s no surprise that the hometown audience adored Bryan Cranston’s monologue on Vin Scully.\n\n“Vin Scully was summer — as refreshing as the smell of cut grass,” the “Breaking Bad” actor said, recalling his first game listening to Scully, whom he dubbed everyone’s “surrogate father.”\n\n“It is my lifetime honor to present the Icon Award to the incomparable Vin Scully,” he concluded.\n\n\n\nThe audience gave Vin a standing ovation and then squealed with delight when he delivered his signature line: “Hi everyone and a very pleasant good evening to you.”\n\nAlso Read: ESPN the Magazine Body Issue Brought to Life in New TV Special\n\nBromance on the front row\n\nThey were utter rivals in Super Bowl XLIX when the Patriots snatched a victory from the Seahawks after a blown call by coach Pete Carroll, but Richard Sherman and Julian Edelman looked like best pals when they hugged it out and chatted on the front row during one break. Edels also seemed to be the most popular person with selfie-hunting young fans too, as he posed for pics with kids during breaks.\n\nMutual respect for Michelle Obama\n\nManning’s announcement of Michelle Obama presenting the Arthur Ashe Courage Award left no one wondering about the political leanings of the crowd, which erupted into cheers, applause and yet another standing ovation as she took to the stage (yep, Mr. Clippers loved her too).\n\nObama looked just as moved when she introduced another female trailblazer, Eunice Kennedy Shriver, for her formation of the Special Olympics — describing its inception in Chicago in 1968 to the groundbreaking 2015 Summer Games in Los Angeles. Eunice’s son, Tim Shriver, accepted the award, after diligently spending hours on the red carpet with Special Olympic athletes.\n\n“Once a great first lady, always a great first lady,” he told Michelle, sparking the loudest scream of the night. “My mother would have loved you.”\n\nSounding like a true politician like his uncle JFK, Shriver said: “We will not stop until there’s true equality,” earning a rousing applause worthy of a campaign rally. On the red carpet, Tim had told TheWrap that the current political reality made it even more important that we should be accepting of all different people.\n\nMeanwhile, the night before Special Olympics gold medalist Daina Shilts told TheWrap that she really hoped to share the stage with Obama — she later got her wish, and stood side-by-side with her icon.", "images": ["https://www.thewrap.com/wp-content/uploads/2017/07/Peyton-Manning-Monologue-ESPYs.jpg", "https://www.thewrap.com/wp-content/uploads/2016/07/ESPYs-Inside.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/tw_red.png", "https://www.thewrap.com/wp-content/uploads/2017/07/ESPYs-25.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/logo-signup2.png", "https://www.thewrap.com/wp-content/uploads/2017/07/Patriots-ESPYs.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/newsletter-filled.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/mobile/account.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/ig_red.png", "https://www.thewrap.com/wp-content/uploads/2017/07/ESPYs-Jimmy-V-Awards.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/mobile/gopro.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/mobile/search.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/mobile/login.png", "https://www.thewrap.com/wp-content/uploads/2022/05/thewrap-film-slate.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/yt_red.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/all-white-logo.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/mobile/newsletter.png", "https://secure.gravatar.com/avatar/9ce4477b0c56f59da5b9aa9017f15852?s=96&d=https%3A%2F%2Fwww.thewrap.com%2Fwp-content%2Fthemes%2Fthewrap-canvas%2Fimgs%2Fthewrap-gravatar.png&r=g", "https://www.thewrap.com/wp-content/uploads/2022/08/0815_TheWrap_Cover_768x922px.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/mobile/mobile-footer-promotion.png", "https://www.thewrap.com/wp-content/uploads/2017/07/Aflac-Duck-ESPYs.jpg", "https://www.thewrap.com/wp-content/uploads/2017/07/Michael-Phelps-ESPYs.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/fb_red.png", "https://www.thewrap.com/wp-content/uploads/2017/07/Aaron-Rodgers-ESPYs.jpg", "https://www.thewrap.com/wp-content/uploads/2022/05/First-Take-Logo_Small.png", "https://www.thewrap.com/wp-content/uploads/2017/07/Jeremy-Renner-and-Dak-Prescott-ESPYs-1.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo-black.svg", "https://www.thewrap.com/wp-content/uploads/2017/07/ESPYs-Icon-Award.jpg", "https://www.thewrap.com/wp-content/plugins/contextual-links/assets/img/loading.gif", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/arw-rt.png", "https://www.thewrap.com/wp-content/uploads/2022/05/First-Take-Logo-Stacked.png", "https://www.thewrap.com/wp-content/uploads/2017/07/Screen-Shot-2017-07-12-at-5.58.50-PM.jpg", "https://www.thewrap.com/wp-content/uploads/2022/05/Image-2022-04-26-at-3.00.43-PM-300x81.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/logo-dark.png", "https://www.thewrap.com/wp-content/uploads/2017/07/ESPYs-Arthur-Ashe-.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo-alt.svg"], "top_img": "https://www.thewrap.com/wp-content/uploads/2017/07/ESPYs-25.jpg", "keywords": [], "authors": ["Debbie Emery"], "canonical_link": "https://www.thewrap.com/2017-espy-awards-22-things-you-didnt-see-on-tv/", "title": "2017 ESPY Awards: 22 Things You Didn’t See on TV", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=6.0, user-scalable=yes", "msapplication-TileColor": "#f9f9f9", "theme-color": "#ffffff", "parsely-title": "2017 ESPY Awards: 22 Things You Didn’t See on TV", "parsely-link": "https://www.thewrap.com/2017-espy-awards-22-things-you-didnt-see-on-tv/", "parsely-type": "post", "parsely-pub-date": "2017-07-12T21:31:27-07:00", "parsely-section": "awards", "parsely-author": "Debbie Emery", "parsely-tags": "adam-schefter, bill-belichick, cillian_murphy, craig-sager, deandre-jordan, eli-can, elizabeth_olsen, espn, espy, eunice-kennedy-shriver, jeremy_renner, john-cena, jon_stewart, julian-edelman, lebron_james, mark_sanchez, michelle_obama, odel-beckham-jr, pat-carroll, peyton_manning, richard-sherman, serena_williams, snoop_dogg, stephanie-mcmahon, tom_brady", "pubexchange": {"image": "https://www.thewrap.com/wp-content/uploads/2017/07/ESPYs-25-160x105.jpg"}, "description": "From Aaron Rodgers' bad dance moves to Kevin Durant's pouting to Julian Edelman's bro-fest, here's what wasn't shown on the ABC broadcast", "robots": "follow, index, max-snippet:-1, max-video-preview:-1, max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "2017 ESPY Awards: 22 Things You Didn't See on TV", "description": "From Aaron Rodgers' bad dance moves to Kevin Durant's pouting to Julian Edelman's bro-fest, here's what wasn't shown on the ABC broadcast", "url": "https://www.thewrap.com/2017-espy-awards-22-things-you-didnt-see-on-tv/", "site_name": "TheWrap", "updated_time": "2017-07-17T22:43:04-07:00", "image": {"identifier": "https://www.thewrap.com/wp-content/uploads/2017/07/ESPYs-25.jpg", "secure_url": "https://www.thewrap.com/wp-content/uploads/2017/07/ESPYs-25.jpg", "width": 618, "height": 412, "alt": "ESPYs 25", "type": "image/jpeg"}}, "article": {"publisher": "https://facebook.com/thewrap", "author": "https://www.facebook.com/thewrap/", "tag": "tom brady", "section": "Awards", "published_time": "2017-07-12T21:31:27-07:00", "modified_time": "2017-07-17T22:43:04-07:00"}, "fb": {"app_id": 228236404181023, "pages": 48941893663}, "twitter": {"card": "summary_large_image", "title": "2017 ESPY Awards: 22 Things You Didn't See on TV", "description": "From Aaron Rodgers' bad dance moves to Kevin Durant's pouting to Julian Edelman's bro-fest, here's what wasn't shown on the ABC broadcast", "site": "@thewrap", "creator": "@debemery", "image": "https://www.thewrap.com/wp-content/uploads/2017/07/ESPYs-25.jpg", "label1": "Written by", "data1": "Debbie Emery", "label2": "Time to read", "data2": "11 minutes"}, "generator": "WooFramework 6.2.0", "BridPlugin": "oauth_token:01110011 01100101 01100011 01110010 01100101 01110100|ver:3.2.2|site:16228|widget:1|disable_video_autosave:|channels:Array|width:640|height:360|autoplay:0|aspect:1|user_id:17159|default_channel:18|ovr_def:1|async_embed:1|google_seo:1|raw_embed:1|unit:13381|unit_width:480|unit_height:270|player:21259|video_image:|onready:", "addsearch-custom-field": "conditional_tag=is_singular", "google-site-verification": "-PpFSIrGHybVDxbndrL6MCngw3j6BXdy0xDVBVVOacI"}, "movies": [], "publish_date": 1499920287.0, "source": "https://www.thewrap.com", "summary": ""}