{"url": "www.womenshealthmag.com/relationships/a19704346/danny-fujikawa-kate-hudson-boyfriend/", "text": "Kate Hudson is now officially engaged to her longtime boyfriend, Danny Fujikawa. He popped the question and Kate later shared the good news on Instagram with an adorable photo. She captioned the kissing selfie, \"Let’s go! 👰‍♀️💒🤵🏻‍♂️.\"\n\nKate kept the proposal news under wraps for a while, but she revealed all on Sept. 13. And, she debuted her sparkling diamond ring at the Met Gala.\n\nNaturally, the IG comments filled with congrats and well wishes from their friends, family, and fans.Trainer Amanda Kloots wrote, \"Omg congratulations!!!!,\" while journalist Katie Couric added, \"SO happy for you two, congratulations!!! XO ❤️.\" And all Gwyneth Paltrow had to say was \"LETS DO THIS❤️❤️❤️.\"\n\nKate's soon-to-be sister-in-law Sara Foster added, \"Whoa. It’s official 😱. Not gonna lie, been a hard secret to keep. I may have slipped and told a few people. ❤️\"\n\nLucky for Kate, Danny makes her busy life brighter, even when they’re not on the best terms. \"He makes me feel beautiful every single moment of the day, even when we have fought,\" she said in a recent People cover story. \"I still feel loved. His devotion to the family unit makes me feel safe and confident and secure.\"\n\nKate, who has two sons from a previous relationship, in addition to her daughter with Danny, explained that they don’t have a \"traditional setup\" family- or relationship-wise. \"And I have to say, I have zero regrets of my life. I’ve never defined myself through the way that a man sees me. But I can define myself in the unit that we can create together,\" she explained.\n\nA partnership like this doesn't happen by accident, though. Kate, 42, and Danny, 35, have a long, adorable history. Here's everything you need to know about Kate's longtime friend—and now fiancé and baby daddy—Danny Fujikawa.\n\nThe two made their red carpet debut as a couple in May 2017...\n\nIt was at the premiere of Snatched in LA, where Kate and Danny first kissed and posed for photos together on a red carpet. “My cute man. He’s the best!” she told Extra at the premiere.\n\nAnd, when asked what she loves most about him, Kate said, “How long do you have? He’s a good man.” But rumors about their relationship started popping up in March of the same year, since the couple was spotted kissing during a lunch date in Los Angeles, according to People.\n\n...But Danny and Kate knew each other for years before they started dating.\n\nKate said in an Instagram post in December 2017 that she first met Danny when she was 23 and pregnant with her son, Ryder. Danny's stepsisters are Kate’s best friends, she says, so they’ve been in the same circles for years.\n\n“A year ago today Danny took me on a hike and what I thought was just a hike with a family friend turned very quickly into an unexpected first date,” Kate wrote in her Instagram caption. “No moves were made on this first date. In fact, it took months for him to make a first move! And as a kiss on this bridge would have been nice, the kiss a year later was so much sweeter. So on our 15th year of knowing each other we were able to open our hearts to each other to feel so much pure love and it’s been truly incredible!\"\n\n\n\nHe's a total family man.\n\nKate has two children, Ryder Russell Robinson, 17, and Bingham Hawn Bellamy, 10, from previous relationships with Chris Robinson and Matt Bellamy, respectively. She also has a daughter, 2, with Danny. Kate and Danny have found a way to make blended family life work for them.\n\n“If I have to go to a dinner meeting, he can be home,” Kate told WH. “His number one priority is family. And when we have our disputes, I feel the thing that allows us to get through them is having the same ultimate goal, and that includes being in each other’s life. It just feels so nice.”\n\nDanny is Kate's support system.\n\nKate Hudson is an absolute powerhouse (see: her interview in the Women's Health December issue for proof). She's an actress, business mogul, and mom of three who still manages to find time for self-care and three to four workouts a week (including pole dancing!). But her crazy schedule wouldn't be nearly as manageable without a little help from her fiancé.\n\n“I’ve got the best man,” Kate previously told Women's Health. “It’s the first time I feel like I have a real teammate in this. We’re able to pick up where the other one has to leave off.”\n\nThey welcomed their first child together in October 2018.\n\nThe actress posted a simple Instagram photo that reads: \"10-2-18\" on top of a pink background. \"She’s here 💕,\" Kate shared in the caption.\n\n\n\nKate also wrote that she and Danny decided to name their daughter Rani Rose Hudson Fujikawa. It's their first baby together, btw!\n\n“We have decided to name our daughter Rani (pronounced Ronnie) after her grandfather, Ron Fujikawa. Ron was the most special man who we all miss dearly. To name her after him is an honor,” Kate wrote in her announcement post.\n\nShe added: “Everyone is doing well and happy as can be. Our family thanks you for all the love and blessings that have been sent our way and we send ours right back.”\n\nThey were very excited for Rani's arrival.\n\nKate told People that she \"[looks] forward to having feminine energy\" around.\n\nAnd her brothers Oliver Hudson and Wyatt Russell confirmed both she and Danny were very excited about their daughter on the way.\n\n“I was teary-eyed because I know how badly she wanted a girl,” he told People in April. “I know Danny, I’m sure in some part of every man’s brain you’re like, ‘I’d love to have a little me.’”\n\nWyatt added: “But when he met my brother’s little girl Rio, who’s the cutest thing in the entire world, she made him be like, ‘Okay, I want a girl.’ So they’re really excited.”\n\nBoth Danny and Kate went into full-blown nesting mode.\n\nIn Kate's Instagram story at the end of September 2018, Kate posted a series of photos that revealed she and Danny were prepping their baby's nursery as they eagerly awaited her arrival.\n\nThe story pics included a poll about wallpaper, a photo of the bassinet they chose for the room, and finally a photo of Danny wearing a baby carrier with the caption \"I think someone's ready to go!\"\n\nThey announced Kate's pregnancy in the cutest (and realest) way.\n\nKate and her honey first announced they were expecting a baby girl together back in April 2018 with an Instagram video. The post showed the couple—along with Kate's sons Ryder and Bingham—popping four huge balloons that contained pink confetti. (Cue everyone screaming.)\n\n“SURPRISE!!! If you’ve wondered why I’ve been so absent on my social channels it’s because I have never been more sick!” Kate wrote in the caption. “[It] was the most sick first trimester of all my children. Boomerangs have made me nauseous, Superzoom is an easy way to have my head in the toilet, food Instagrams make me [queasy] and thinking too much about Insta stories made me even more exhausted than I already had been.”\n\nDanny fits in perfectly with Kate's family.\n\nFollowing the actress's birthday, Kate posted this cute pic with Danny, along with the caption: \"#tbt To my favorite birthday moment. You can’t really see my kiddos in the front but I was getting love from all my boys at once. #FeelingLucky.\"\n\nDanny is a musician.\n\nDanny is another musician—like Kate’s former husband Chris Robinson and ex Matt Bellamy. Danny is the former singer and guitarist for the band Chief.\n\nHe also owns the record label Lightwave Records, which he started in 2013 with The Delta Mirror frontman Chris Acosta, according to the label’s Facebook page.\n\n\n\nHe worked on Kate's promo videos for her clothing line.\n\nDanny can officially add professional Instagram/social media boyfriend to his resume. In a recent post, he shared a video for Kate's clothing line Happy x Nature, that he not only edited but composed the music for too!\n\nHe captioned the video, \"Here lies the teaser I edited and musically composed for my baby’s new “ready-to-wear” clothing line. Of all the clothes in the world that are ready to wear, these are the most ready. #happyxnature #THX\"\n\nAnd of course, Kate looks amazing.\n\nHe clearly has a great sense of humor.\n\nKate's boo seems like a pretty hilarious guy. He regularly posts pics on Instagram of himself doing funny things like posing in a sheet mask and “crying” after he shaved off his long beard.\n\nThey've traveled the world together.\n\nIt's clear from their Instagrams that these two love to travel and share experiences together. The couple have sailed in Cambodia, hit the skii slopes for Valentine’s Day and just recently went to Dubai, where Kate and Danny gave falconry a try.\n\nEven while Kate was six months pregnant with Rani, the couple took a \"babymoon\" trip and traveled through Italy, with friends and family.\n\nAnd they returned to Italy with toddler Rani a few years later, when Kate shared this super cute snap:\n\nNo doubts about it—they're a jet-setting fam.\n\nThey're #workoutbuddy goals, too.\n\nKate's a big fitness fan, and Danny works out right by her side. It's unclear if he joins for all her sweat sessions, but he shared one hilarious gym video on Instagram.\n\nKate's also open to having more kids with Danny.\n\nThe actress chatted about having another baby with Danny on The Ellen Degeneres Show in February. “I don’t know if I’m done. I’m in that place of like, right now, Rani is at that age where you’re like, ‘I want another baby.’ But once she gets like 4 or 5, you’re like, ‘I feel like my life is kinda back a little bit [and] they’re kinda in a groove,’ ” she told Ellen. “It’s weird… it’s like a window.”\n\nPower couple alert!", "images": ["https://hips.hearstapps.com/vidthumb/images/hbz-katehudson-1523397820.jpg?crop=0.564xw:1.00xh;0.212xw,0&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/tom-brady-of-the-tampa-bay-buccaneers-celebrates-with-news-photo-1663094193.jpg?crop=0.548xw:0.776xh;0.324xw,0.0658xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/natalia-verza-wears-vuitton-sunglasses-a-white-t-shirt-and-news-photo-1663013717.jpg?crop=0.668xw:1.00xh;0.167xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/kate-hudson-nursery-images-1537457864.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/gabby-and-rachel-are-each-down-to-one-man-looking-for-news-photo-1663795755.jpg?crop=0.771xw:0.964xh;0.101xw,0.00601xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/following-last-weeks-shocking-canceled-rose-ceremony-gabby-news-photo-1662990094.jpg?crop=0.612xw:0.766xh;0.191xw,0.0261xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/091322-1663356184.jpg?crop=0.502xw:1.00xh;0.240xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/wh-index-2000x1000-relatonship-behati-prinsloo-and-adam-levin-1664559741.jpg?crop=0.502xw:1.00xh;0.250xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/marilyn-monroe-and-joe-dimaggio-circa-1954-news-photo-1664566741.jpg?crop=0.761xw:1.00xh;0.0849xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/gabby-and-rachel-enter-a-crucial-week-of-getting-to-know-news-photo-1663007176.jpg?crop=0.647xw:0.810xh;0.179xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/wh-ptm-hhm-lovea-1661374861.png?crop=0.5xw:1xh;center,top&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/ahead-of-the-season-premiere-of-the-bachelorette-press-news-photo-1660246981.jpg?crop=0.378xw:0.473xh;0.317xw,0.0581xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/kate-hudson-arrives-at-the-the-daily-front-rows-5th-annual-news-photo-1579895675.jpg?crop=0.833xw:0.316xh;0,0.0487xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/danny-fujikawa-and-honoree-kate-hudson-attend-wcrfs-an-news-photo-1573758015.jpg?crop=1.00xw:0.333xh;0,0.0748xh&resize=1200:*", "https://hips.hearstapps.com/hmg-prod/images/woman-having-coffee-and-texting-on-her-phone-at-royalty-free-image-1641918176.jpg?crop=0.668xw:1.00xh;0.167xw,0&resize=180:*", "http://www.womenshealthmag.com/_assets/design-tokens/womenshealthmag/static/images/logos/network-logo.6f764c4.svg", "https://hips.hearstapps.com/hmg-prod/images/bunch-of-red-heart-shaped-balloons-royalty-free-image-1664470945.jpg?crop=0.667xw:1.00xh;0.215xw,0&resize=180:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/danny-fujikawa-and-honoree-kate-hudson-attend-wcrfs-an-news-photo-1573758015.jpg?crop=1.00xw:0.333xh;0,0.0748xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.womenshealthmag.com/relationships/a19704346/danny-fujikawa-kate-hudson-boyfriend/", "title": "Meet Kate Hudson's Fiancé & Baby Daddy", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "X-UA-Compatible": "IE=edge,chrom=1", "msapplication-tap-highlight": "no", "title": "Who Is Danny Fujikawa - Meet Kate Hudson's Fiancé & Baby Daddy", "description": "Who is Kate Hudson engaged to? The actress and fiancé Danny Fujikawa share one daughter together. Here are all the details about their relationship.", "keywords": "Danny Fujikawa, Kate Hudson boyfriend, who is Kate Hudson dating, Kate Hudson dating, Kate Hudson husband, Kate Hudson baby", "theme-color": "#000000", "og": {"site_name": "Women's Health", "title": "Kate Hudson And Her Fiancé Danny Fujikawa Went Hiking For Their First Date", "description": "Here are all the details of their love story.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/danny-fujikawa-and-honoree-kate-hudson-attend-wcrfs-an-news-photo-1573758015.jpg?crop=1.00xw:0.333xh;0,0.0748xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.womenshealthmag.com/relationships/a19704346/danny-fujikawa-kate-hudson-boyfriend/", "type": "article"}, "fb": {"app_id": 223993857646230}, "article": {"publisher": "https://www.facebook.com/womenshealthmagazine/", "section": "Relationships", "modified_time": "2021-11-02T14:53:43Z", "published_time": "2021-09-14T18:09:00Z"}, "twitter": {"site": "@WomensHealthMag", "image": "https://hips.hearstapps.com/hmg-prod/images/danny-fujikawa-and-honoree-kate-hudson-attend-wcrfs-an-news-photo-1573758015.jpg?crop=1.00xw:0.333xh;0,0.0748xh&resize=640:*", "card": "summary_large_image"}, "google-site-verification": "mJMUXwyIdtxgKFgxuJIMK0pLRtYTrhduC6K_LFpAP8Y", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/danny-fujikawa-and-honoree-kate-hudson-attend-wcrfs-an-news-photo-1573758015.jpg?crop=1.00xw:0.668xh;0,0&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/danny-fujikawa-and-honoree-kate-hudson-attend-wcrfs-an-news-photo-1573758015.jpg?crop=1.00xw:0.668xh;0,0&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/danny-fujikawa-and-honoree-kate-hudson-attend-wcrfs-an-news-photo-1573758015.jpg?crop=1.00xw:0.668xh;0,0", "auto-publish": "evergreen", "sailthru.excerpt": "Kate Hudson is now officially engaged to her longtime boyfriend, Danny Fujikawa. He popped the question and Kate later shared the good news on Instagram with an adorable photo. She captioned the kissing selfie, \"Let’s go! 👰‍♀️💒🤵🏻‍♂️.\"Kate kept the proposal news under wraps for a while, but she revealed all", "sailthru.tags": "relationships,Relationships", "sailthru.date": "2021-09-14 18:09:00", "sailthru.socialtitle": "Kate Hudson And Her Fiancé Danny Fujikawa Went Hiking For Their First Date", "sailthru.contenttype": "standard-article", "m1": ".content-hed", "m2": ".content-dek p", "next-head-count": 44}, "movies": [], "publish_date": 1631642940.0, "source": "http://www.womenshealthmag.com", "summary": ""}