{"url": "https://people.com/home/flip-or-flop-christina-el-moussa-boyfriend-ant-anstead-relationship-timeline/", "text": "01 of 24 January 2018: Christina Hall and Ant Anstead reveal they're a couple New year, new love. Hall and Anstead made their relationship public in January 2018, marking the moment on Instagram with a photo of the couple taking a bike ride. The Flip or Flop star and the Wheeler Dealers co-host had been keeping their romance under the radar for a few months, with Hall later sharing they met \"at the end of 2017.\" Anstead also revealed they celebrated a six-month anniversary in April 2018.\n\n02 of 24 February 14, 2018: Christina Hall praises Ant Anstead on social media Christina El Moussa/Instagram Hall posted a sweet tribute to her new love on Valentine's Day 2018 and showed off his homemade gift for her: a picture frame. Anstead echoed her sentiments, writing \"My Valentine is a HOTTIE\" on his Instagram Story.\n\n03 of 24 March 2018: Christina Hall visits Ant Anstead's hometown Christina El Moussa/Instagram Anstead gave his new love a tour of his \"old stomping grounds\" in London in March 2018. \"Within moments of landing in the U.K. I couldn't help it..... we grabbed the G40 and gave @christinaelmoussa a tour of my world.... where I grew up, my school, my town,\" he said.\n\n04 of 24 March 28, 2018: Christina Hall celebrates Ant Anstead on his 39th birthday Christina El Moussa/Instagram In March 2018, Hall posted a heartfelt tribute to the U.K. TV presenter Wheelers and Dealers star on his 39th birthday. \"He has already grounded me in so many ways and I'm so grateful for him,\" she wrote on social media. The HGTV host added that Anstead \"is an amazing dad to his children\" and hers. \"... Driven and talented, humble and kind, patient and a great listener, fun and hilarious, spiritual and to top it all off he's hot AF,\" she continued.\n\n05 of 24 May 1, 2018: Ant Anstead and Christina Hall celebrate their six-month anniversary Time flies! Anstead gushed over Hall on their six-month anniversary, writing, \"I've loved every second I spend with her!\" He added that she is a \"proper travel buddy\" and complimented her sense of humor and her ability to get his \"British sarcasm.\"\n\n06 of 24 May 2018: Ant Anstead and Christina Hall get dating advice from Prince Harry Ant Anstead/Instagram In May 2018, Hall and Anstead celebrated Prince Harry and Meghan Markle's nuptials. Although they hadn't revealed any plans for marriage at the time, Anstead admitted to texting the royal for advice on dating a \"Yank.\" As for Prince Harry's answer? Anstead said, \"His reply will be kept a secret!\"\n\n07 of 24 July 2018: Ant Anstead and Christina Hall tell PEOPLE they're ready for marriage Ant Anstead/Instagram Hall opened up about her future with Anstead in a July 2018 PEOPLE cover story. \"I can see myself getting married to him,\" she said. \"He's so down-to-earth, and we have so much in common. We basically do the same thing, so he gets what my world is like, and he's just rolled with the punches and handled everything so well.\"\n\n08 of 24 July 9, 2018: Ant Anstead sends Christina Hall a message in the sky Ant Anstead Instagram Story Anstead proved the sky is the limit in his love for Hall. After surprising her with a trip to Mexico for her 35th birthday, Anstead made a grand gesture, having \"I [heart] C\" spelled out in sky writing above their oceanfront hotel. He also posted a gallery of photos on Instagram to celebrate the big day. \"HAPPY BIRTHDAY to this absolute LEGEND!!!! 35 today!!! @Christinaelmoussa you make me laugh every single day! You are crazy! In a good way! An inspiration! You saved me! Oh and not too shabby for 35!!!\" he wrote.\n\n09 of 24 August 2018: Christina Hall and Ant Anstead blend their families Ant Anstead Instagram In August 2018, Hall (along with her two children she shares with ex-husband Tarek El Moussa) and Anstead and his two children vacationed together in Hawaii. Together, the party of six braved a travel disaster when, Hall revealed, they missed their flight because of a visit to urgent care and the impending arrival of a hurricane. \"I guess Maui wasn't ready for us to leave,\" she wrote about the incident.\n\n10 of 24 October 2018: Christina Hall and Ant Anstead celebrate one year together Christina El Moussa/Instagram The couple celebrated their one-year anniversary in October 2018, with Hall sharing the story of how they first got together. \"A year ago today [Ant Anstead] called me for the first time and we spoke for 29 mins two days later ... he FaceTimed me (I was thinking who FaceTimes?),\" she wrote on Instagram, alongside a photo of the two showing some PDA while in London. \"Anyways I answered and we spoke for 2.5 hours ... two days later we met for the first time and we've been inseparable ever since.\"\n\n11 of 24 December 2018: Ant Anstead and Christina Hall spark engagement rumors Anstead posted a photo of him and Hall sharing an \"epic\" dessert while \"celebrating something special\" in December 2018. Fans were quick to speculate that \"something\" was an engagement, noting in the comments that Hall's hands were conveniently cropped from the image.\n\n12 of 24 December 22, 2018: Christina Hall and Ant Anstead get married Wedding of Christina El Moussa and Ant Anstead. Rich Lander/CHARD Photo The pair tied the knot in a winter wonderland-theme wedding at their home in Newport Beach, California, on December 22, 2018. To pull off their surprise \"I dos,\" the pair asked 70 of their closest friends and family members to meet at the house, where a charter bus would then transport the group to watch the Newport Beach Christmas Boat Parade. Instead, guests walked into a wedding. Under an altar in their front yard, the couple exchanged vows with their children nearby.\n\n13 of 24 March 2019: Ant Anstead and Christina Hall announce they're expecting their first child together Christina Anstead Instagram In March 2019, the newlyweds revealed they were expecting their first child together. The HGTV star posted a photo of herself hugging her husband and holding up a sonogram on Instagram, \"Ant and I are so excited to announce #babyanstead coming this September!! The kids are all so excited to meet their new sibling,\" she wrote.\n\n14 of 24 September 6, 2019: Ant Anstead and Christina Hall welcome son, Hudson Christina Anstead Instagram And baby makes seven! Hall and Anstead's son, Hudson London, was born on Sept. 6, 2019. \"It's definitely been a big adjustment for all of us having a newborn around again,\" Hall said on an episode of Christina on the Coast, which documented Hudson's arrival. The episode aired in January 2020. She continued, \"But it's so nice to be home, and we're all excited to figure out our new normal with the cutest little British baby.\"\n\n15 of 24 December 22, 2019: Ant Anstead and Christina Hall celebrate their first anniversary Rich Lander/CHARD Photo In December 2019, the couple shared sweet messages to celebrate their one-year anniversary. \"1 year ago today! I still get emotional watching this! What a year it's been. I was 2 weeks pregnant with baby Hudson here and had no idea – ?. @ant_anstead I love you, our blended family and this life with you,\" Hall captioned their wedding video on Instagram. Anstead wrote his own note alongside a highlights from their wedding day. He captioned the series of photos: \"Holy smokes!!!! A year ago! And What a year!? We have done enough for several lifetimes! I am blessed, I am lucky, I am loved, I am full, I am happy, I am yours. You saved me and you complete me!? you are PERFECT!!! My wife!\"\n\n16 of 24 September 18, 2020: Christina Hall and Ant Anstead announce split Christina Anstead Instagram On Sept. 18, 2020, less than two years after their wedding, Hall announced in an Instagram post that the couple had split. \"Ant and I have made the difficult decision to separate,\" she wrote. \"We are grateful for each other and as always, our children will remain our priority. We appreciate your support and ask for privacy for us and our family as we navigate the future.\"\n\n18 of 24 July 2021: Christina Hall began dating Joshua Hall after divorce from Ant Anstead Christina Haack/Instagram Following her divorce from Anstead, Hall was confirmed to be dating Austin-based realtor Joshua Hall in July 2021. The new couple's relationship advanced quickly, with the two getting engaged in September 2021 and tying the knot in April 2022.\n\n19 of 24 April 2022: Christina Hall and Ant Anstead undergo custody battle Michael Kovac/Getty; Allen Berezovsky/Getty PEOPLE confirmed Anstead filed for full custody of the couple's 2-year-old son Hudson London in April 2022. In response to the filing, Hall told PEOPLE, \"What Ant is doing deeply saddens me. If this was really about Hudson, as he says, this should have been handled privately with a private judge or mediation, as myself and my attorney have suggested.\" \"I have had my share of ups and downs, but I am a good mom, and I love my children with all my heart, and I will always protect them,\" she added. PEOPLE reached out to Anstead's rep for comment.\n\n20 of 24 April 27, 2022: Ant Anstead requests full custody of his son with Christina Hall Ant Anstead/ instagram Per Anstead's court order, filed on April 27 and obtained by PEOPLE, the Celebrity IOU Joyride host claimed that he had been the \"primary parent.\" He alleged that Hall had spent an \"average of nine full days each month over the last 20 months and an average of seven full days per month in 2022\" with their son Hudson. Hall shares son Brayden James and daughter Taylor Reese with Moussa. Anstead is dad to daughter Amelie and son Archie from his previous marriage to Louise Storey. Anstead also requested that Hudson not appear in any paid media campaigns. Per his court order, he asked to be \"awarded sole legal custody of Hudson, or, in the alternative, for an order restraining both Hall (and me) from using Hudson or Hudson's likeness or image in any commercial endeavor, social media paid promotion, television or streaming program, or which might otherwise commodify Hudson without the express advanced written consent of both parents in writing.\" The host claimed that Hall featured Hudson in \"paid advertisements to sell products\" during three of the five full days she had their son during March 2022. He also added that Hudson is \"allergic\" to one of the products used in the advertisement.\n\n21 of 24 April 28, 2022: Ant Anstead denied full custody of his son he shares with Christina Hall Getty On April 28, a judge denied Anstead's emergency request for full custody of their son Hudson because he failed to prove there were critical circumstances concerning the child and didn't give Hall enough notice. The ex parte application was to show the custody situation was an emergency and needed to be dealt with urgently. Instead, following the judge's ruling, a hearing was set for June 28 to allow both parties to appear and make their arguments whether the requested change to the custody should be granted. A month later, Anstead replied to an Instagram comment to say that taking his son away from Hall is the \"last thing\" he wants.\n\n22 of 24 April 29, 2022: Christina Hall receives support from husband during custody battle with Ant Anstead Christina Hall/Instagram As the custody battle continued, Halls' husband shared his support for his wife on Instagram. \"Never did I think taking on three kids from two other males would be easy,\" he began, referring to Hudson and Hall's other two children from her previous relationship. He continued: \"Coming from a split home myself, I know it's not easy on youngsters, but in todays world sadly, it's pretty common. So Christina and I will always remain unfazed by any outside noise and save the kids from any unnecessary trauma.\" He then praised his wife as a working mom, calling her \"very driven\" and a \"positive influence\" in her children's lives \"while achieving success in anything she does.\" \"There is a lot that goes on in personal lives that isn't for public consumption, therefore not shared, kept private,\" he added. \"So trust me as someone who likes to keep a low profile, no one except those directly involved knows jack about any situation more than them. 2 sides and the truth.\" He concluded, \"I will always protect her, keep her safe and no one will hurt her with me in the picture. She doesn't bother anyone, she deserves the same in return. I will ensure that's the case.\"\n\n23 of 24 September 27, 2022: Christina Hall responds to Ant Anstead's exploitation accusations regarding their son Hudson In April 2022, Anstead requested that Hall not film paid social media campaigns with their son Hudson. He even went as far as to file a request with the court that would restrain both him and Hall \"from using Hudson or Hudson's likeness or image in any commercial endeavor, social media paid promotion, television or streaming program, or which might otherwise commodify Hudson without the express advanced written consent of both parents in writing.\" Hall's legal team filed a response to Anstead's accusations that the HGTV star was \"exploiting\" their son on social media. \"He appeared in a few of my own Instagram ads that each took less than 5 minutes to film,\" Hall said in the response. \"I have all the footage and they were all fun activities that he enjoyed doing, such as playing with toys or making cookies.\" She added: \"Hudson has not appeared in any of my Instagram endorsements since April 2022, when Ant asked me not to have him in them. I did not have a problem stopping, nor do I care to feature Hudson in any further endorsements.\"", "images": ["https://people.com/thmb/6gW5OpBVNrMaQAf6LNTNX0SONXI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/5-28890b7337ff4ca3b365d3f2aac4ba8a.jpg", "https://people.com/thmb/kJ7ipZlluSVSJzeOujadJEoVMRg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(719x0:721x2)/christina-hall-son-hudson-9622-688bf4a2f97249ebb643cf176a96d50d.jpg", "https://people.com/thmb/fd8XpS1RmDSj_EyEBj9wiSdYcKI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(734x379:736x381)/ant-anstead-christina-haack-2c298998537248e09ac8ea311339d3f9.jpg", "https://people.com/thmb/Sray9F9nTmPG1Ygo6mK3tiTHlok=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(527x479:529x481)/christina-haack-josh-hall-ca495c268c3048d084c6c47c88e5f524.jpg", "https://people.com/thmb/yIMNaitX2D6POCRc0jqKxVlTfpk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(477x0:479x2)/screen-shot-2018-05-21-at-12-49-07-pm-da1d8f851df846d4aad1fbdd15347bec.png", "https://people.com/thmb/C4budttaCV5sK4HtVLZ8MeNOM6E=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(595x0:597x2)/christina-el-moussa-ant-anstead-anniversary-0b80a10f7a8a4ae98440eef83413608e.jpg", "https://people.com/thmb/Qv0q2EseONuiyA9ImrLYKvkapjE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(394x443:396x445)/christina-haack-1-84bf4d107fcf48a19ffc946bc24c01ab.jpg", "https://people.com/thmb/b-SkFLvI7BWjK8037LhP4McAgGE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(734x299:736x301)/renee-zellweger-d10bcf4185144be69c7e3c089be52331.jpg", "https://people.com/thmb/nJLn4xcYWzQ-x0tlTY2HoDslW_A=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(511x0:513x2)/ant-anstead-863c45f5799a46f0a2c3126153837443.jpg", "https://people.com/thmb/DutdqjnkogRlfkidyE7M6W8EwdA=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(596x0:598x2)/christina-ant-anstead-split-divorce-0fce93d04ea549ac8714c7a1f72ce7a3.jpg", "https://people.com/thmb/08ZaR5xox_c38vlZlBFQVnn-gZg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(699x449:701x451)/christina-hall-4th-1-5e40992169c8433faf0599dda38ee4d3.jpg", "https://people.com/thmb/JYen16udrfa1f-ElrvSRC_BqE_s=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/christina-el-moussa1-2000-fd11fd15194b4cb08f2f9b895acbe5ee.jpg", "https://people.com/thmb/sSdMA1tyXkTQ0AiEtoaJo6qMnCI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(742x619:744x621)/Christina-Hall-and-Josh-Hall-Wedding-090422-03-2000-1a5d059b72e34694bac77163cc6c3d6f.jpg", "https://people.com/thmb/1fIG04iunLkmeqfsj0cXwe5FPlE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x269:751x271)/ant-anstead_01-697f53ebe7664622a232cf3961601f07.jpg", "https://people.com/thmb/5X0ywgUH4_kIMDxDajxNuz15f9Y=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(316x143:318x145)/ant-anstead-hudson-109cb069e6f24b68bee37c23d31349ff.jpg", "https://people.com/thmb/cj5ykcpBbNUxxUbLxQzMS9-O_bg=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/christina-el-moussa-ant-anstead-maui-2-2000-32cd3d4ebcaa4414a56fbae3cb5038ea.jpg", "https://people.com/thmb/v0NtuTBp4YVqy8sKiOkPQd-6z7I=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(959x145:961x147)/christina-hall_3-2000-b97f2c56f6164163a9f17c9147449589.jpg", "https://people.com/thmb/woI6-G_VTt_jcnh8_RJnRlVHy88=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(373x0:375x2)/christina-el-moussa-ant-anstead-df9263c6831c4dde8435a64069a465bb.jpg", "https://people.com/thmb/znQTz7sIoGhyncAbju0q3CL3OzY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/christina-hall-ant-anstead-son-hudson-92922-398117d0d08a45baad82a9c9912bca5e.jpg", "https://people.com/thmb/6kR0TtTDiMx1OgDqp7SyjCGjb30=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(539x0:541x2)/ant-anstead-son-hudson-2-3035afb124ff45dc9d0d9d092ecc97db.jpg", "https://people.com/thmb/RghZ9_EUC8OBFjUhpc5C060KoDk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(598x0:600x2)/screen-shot-2018-06-12-at-3-34-54-pm-63f47a7889e94bb892733c9accab18d3.png", "https://people.com/thmb/vvDNQRTH2XQXNUuvX6fIHlrATbc=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/christina-el-moussa-ant-anstead-1-d541be20c27143b5a4a0313c9b37b36f.jpg", "https://people.com/thmb/e--A-_ntsdtLm1jtIziv4hyWfys=/2000x1983/filters:fill(auto,1)/christina-el-moussa-ant-anstead-maui-3-9489ec6543c242869843cabd06396041.jpg", "https://people.com/thmb/emuFHR_-jGiyMlqZC2EmtIxJ6lU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(399x0:401x2)/christina-hall-wedding-1-9522-bd3c94ffc85b42e588ef457a6f2423ac.jpg", "https://people.com/thmb/HbFnIGCna1DEfHOLk-3KsRw74uM=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(595x0:597x2)/screen-shot-2018-06-12-at-3-33-41-pm-9e71616474ab45d0b1fdc8d888539c13.png", "https://people.com/thmb/wlxprwQAFGR0O7YGZvcr7ymbnPM=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(297x0:299x2)/christina-el-moussa-ant-anstead-777a175a6b5e42a2ba4c025521c91919.jpg", "https://people.com/thmb/E0fwj_vURRQPhxZ2e-0AxGYQ5Nk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(477x0:479x2)/christina-ant-anstead-birth-hudson-baby-delivery-2af734a912d143f78e32b50d671b01db.jpg", "https://people.com/thmb/4qp-qVWGyMIML33FFh23xDI22VY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(463x283:465x285)/christina-anstead-39fb2ac5dac34667a7d80fc8c9001f3f.jpg", "https://people.com/thmb/fmpihhTAWwyR-RLFUZihe3TxtOw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(706x89:708x91)/Christina-Haack-Josh-Hall-Family-01-6a03e37c340d4f5584ecc1659345382d.jpg", "https://people.com/thmb/ZKjA1gioJWWWY4s3JMzOCorEY74=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/6-f418856b727f4142926f3412ebd71002.jpg", "https://people.com/thmb/Lje7sGaj3HgeS-yLg9z5JSNPfrU=/300x150/filters:no_upscale():max_bytes(150000):strip_icc()/people_magazine_sub-e6689738996d40f38f154099e1751481.png", "https://people.com/thmb/MrirmR2RfJ-7y60_rM1IZEJ_3k8=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(477x0:479x2)/christina-ant-anstead-baby-sonogram-pregnancy-announcement-ad36546d25ca487d8c63514597272955.jpg", "https://people.com/thmb/1Hcp_KVh_GzmH2LCM7JUTPewFhw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(454x0:456x2)/accent_ant-anstead-1d3667e6300845909357fb4ebb3f4d83.jpg", "https://people.com/thmb/VHci2MsLNX62NaaMpVj_E0L_f2g=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(374x0:376x2)/christina-el-moussa-birthday-sky-writing-ant-anstead-9c27a0188abc4d57a406a338c1a462b7.png", "https://people.com/thmb/lG3XPX5hAJsSBpyW3xQu9oVjwpw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(372x0:374x2)/christina-el-moussa-ant-anstead-kids-hawaii-vacation-7c2f8cb915f7481a830d8fce79de8b55.png", "https://people.com/thmb/sOLIycrpAGhGKz9mpg-Xu0-7RfI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(539x0:541x2)/ant-anstead-son-hudson-2-eff29dbe95dc4450803a89011ce8b496.jpg", "https://people.com/thmb/80N3InWgODlxbQCnFDFoAw5f7_Q=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(165374x37999:165376x38001)/ant-anstead-christina-haack-1-e101c821fc6a4bcea6b713c1ffbf864b.jpg", "https://people.com/thmb/rNWQRGqdwRJ-iLZ6Sl2Wk-dKsm0=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(165374x37999:165376x38001)/ant-anstead-christina-haack-1-e101c821fc6a4bcea6b713c1ffbf864b.jpg"], "top_img": "https://people.com/thmb/e--A-_ntsdtLm1jtIziv4hyWfys=/2000x1983/filters:fill(auto,1)/christina-el-moussa-ant-anstead-maui-3-9489ec6543c242869843cabd06396041.jpg", "keywords": [], "authors": ["Megan Stein"], "canonical_link": "https://people.com/home/flip-or-flop-christina-el-moussa-boyfriend-ant-anstead-relationship-timeline/", "title": "Christina Hall and Ant Anstead's Relationship Timeline", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Christina Hall and Ant Anstead married in 2018 and divorced in 2021. Here is a complete timeline of their relationship.", "emailcontenttype": "LISTSC", "emailvertical": "PEOPLE", "sailthru.author": "Megan Stein", "article": {"section": "People", "opinion": "false", "author": "https://www.facebook.com/peoplemag"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "og": {"type": "article", "site_name": "Peoplemag", "url": "https://people.com/home/flip-or-flop-christina-el-moussa-boyfriend-ant-anstead-relationship-timeline/", "title": "Christina Hall and Ant Anstead's Relationship Timeline", "description": "Christina Hall and Ant Anstead married in 2018 and divorced in 2021. Here is a complete timeline of their relationship.", "image": "https://people.com/thmb/e--A-_ntsdtLm1jtIziv4hyWfys=/2000x1983/filters:fill(auto,1)/christina-el-moussa-ant-anstead-maui-3-9489ec6543c242869843cabd06396041.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "Christina Hall and Ant Anstead's Relationship Timeline", "description": "Christina Hall and Ant Anstead married in 2018 and divorced in 2021. Here is a complete timeline of their relationship.", "image": "https://people.com/thmb/e--A-_ntsdtLm1jtIziv4hyWfys=/2000x1983/filters:fill(auto,1)/christina-el-moussa-ant-anstead-maui-3-9489ec6543c242869843cabd06396041.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.19.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.19.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.19.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.19.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.19.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}