{"url": "https://thetitlemag.com/culture/ranking-avengers-new-looks-avengers-infinity-war-trailer/", "text": "If you have an internet connection and a pulse, you are likely aware that the first trailer for Avengers: Infinity War—the 19th and by all accounts grandest instalment of the Marvel Cinematic Universe—finally dropped earlier this morning. It’s dark and dramatic and surprisingly fluid, despite having to briefly showcase virtually every Marvel superhero we’ve ever seen onscreen, plus Josh Brolin’s grim Thanos and his new cadre of sub-baddies. No fewer than 22 major characters are packed into the two-and-a-half minute preview, many of whom are sporting radically different looks from when we saw them last. Some of these makeovers are awesome, some of them are not. Let’s take a brief run through them all, from worst to best.\n\n11. Peter Parker’s Arm Hair\n\nI understand this shot is meant to signify Peter’s spidey sense going haywire, what with the massive alien Stargate thing floating in the sky behind him and all. But it winds up feeling more like a visual reminder that this kid is still in high school and going through puberty, which is pretty icky overall.\n\n10. Tony Stark’s Rich Guy Tracksuit\n\nTony Stark is rich, and rich guys like wearing matching tracksuits. I have no problem with that. What I do take issue with is the fact that Stark’s tracksuit of choice looks like it was designed by an early-’00s web developer and has the schlubby fit one would expect of an overworked dad driving his kids to hockey practice—not a “genius, billionaire, playboy philanthropist.” Next time, Tony, ask Nas for some pointers.\n\n9. Thanos’ Metal Tanktop\n\nThe brief handful of times we’ve seen Thanos prior to Infinity War, he’s sat menacingly upon a space throne wearing a helmet and full suit of armour. It seems odd, then, that for his first major onscreen action, they’d choose to stick him in a goofy, tight sleeveless number and expose his full bald noggin. Maybe the point was to make him look more like Dom Toretto? Frankly, though, he mostly just reminds me of Grimace.\n\n8. Vision’s Human Disguise\n\nListen, Paul Bettany: I’m happy for you, man. I’m glad you managed to convince Marvel to give you a few scenes where you wouldn’t require the three-and-a-half hour makeup process to turn you nearly as red in the face as the sitting president. But why did you let them make your human form so swagless? In real life, you turned up to a press conference wearing all-cream-everything and a pair of Leon: The Professional sunglasses like you owned the damn place. In Infinity War, save for that Mind Stone-sized pimple on your forehead, you look about as bland as a pack of saltines.\n\n7. Iron Man’s Latest Armour\n\nIt’s better than Tony Stark’s tracksuit, sure, but it’s mostly just boring: Another Marvel movie, another marginally different Iron Man suit. This one is the Mark 48—forty-eight!!!—for those of you still counting. Yawn.\n\n6. The Winter Soldier’s Hockey Flow\n\nThis is pretty minor, all things considered, but I’m reasonably certain that Bucky’s hair is several inches longer this go ’round. I’m into it. It’s got a bit of an Aragorn vibe, especially when he’s standing alongside such a massive army. (More on them later.)\n\n5. Thor’s Eyepatch\n\nIf you’ve seen Ragnarok already—and if you haven’t, you really should—then this isn’t new to you. But it warrants inclusion anyway, because it’s really quite becoming. A rugged and worthy change for the Norse god going forward. Good job by you, Taika Waititi.\n\n4. Black Widow’s Blonde Locks\n\nScarJo looks great as a blonde, because of course she does: it’s her natural hair colour. A vast improvement over the shoddy red dye jobs she’s been forced to endure for more than half a decade now.\n\n3. Captain America’s Beard\n\nOf all the things on this list, Cap’s beard has probably gotten the most buzz on the blogosphere. And rightly so: it’s kind of the anti-Vision-as-a-human, insofar as it takes the generally pretty vanilla-looking Chris Evans and makes him look like a grizzled, salty sea captain. That’s a beard with character; a beard that demands respect; a beard so powerful you might even be able to weaponize it, given that we don’t see Cap’s shield even once in this trailer.\n\n2. The Wakandan Army’s Cape Game\n\nSQUAD GOALS. Son, the Wakandan Army’s uniforms are STRAIGHT FLAMES. The flowy, earthy-toned layers look part-Jedi, part-Engineered Garments SS15, and those boldly patterned, off-the-shoulder capes are the stuff of Pitti Uomo dreams. If y’all want a rough idea of what I’ll be wearing all next summer, look no further than these incredibly badass fellas. To misquote a dumb Killers lyric: They got soul and they are soldiers.\n\n1. Spider-Man’s Iron Spider Suit\n\nWe got a brief glimpse at this bad boy at the end of Homecoming, but my word is it ever glorious to see it in action. The lines! The armoured exterior! The glowing eyes! I’ve got a feeling there’ll be plenty of bang-for-your-buck action crammed into Infinity War, but this suit alone seems worth the price of admission.", "images": ["https://cdn.thetitlemag.com/wp-content/uploads/2017/11/avengers-screengrab-9-1117.jpg", "https://cdn.thetitlemag.com/wp-content/uploads/2017/11/avengers-infintiy-war-1117-2560x1440-c-default.jpg\n", "https://cdn.thetitlemag.com/wp-content/uploads/2017/11/avengers-screengrab-7-1117.jpg", "https://cdn.thetitlemag.com/wp-content/uploads/2017/11/avengers-screengrab-2-1117.jpg", "https://cdn.thetitlemag.com/wp-content/uploads/2017/11/avengers-screengrab-11-1117.jpg", "https://cdn.thetitlemag.com/wp-content/uploads/2017/11/avengers-screengrab-5-1117.jpg", "https://cdn.thetitlemag.com/wp-content/themes/sjm-genus/img/dst/logos/title-lockup.svg", "https://cdn.thetitlemag.com/wp-content/uploads/2017/11/avengers-screengrab-1-1117-1.jpg", "https://cdn.thetitlemag.com/wp-content/uploads/2017/11/avengers-infintiy-war-1117.jpg", "https://cdn.thetitlemag.com/wp-content/uploads/2017/11/avengers-screengrab-3-1117.jpg", "https://cdn.thetitlemag.com/wp-content/uploads/2017/11/avengers-screengrab-10-1117.jpg", "https://cdn.thetitlemag.com/wp-content/themes/sjm-genus/img/dst/logos/title-logo.svg", "https://cdn.thetitlemag.com/wp-content/uploads/2017/11/avengers-screengrab-4-1117.jpg", "https://cdn.thetitlemag.com/wp-content/uploads/2017/11/avengers-screengrab-6-1117.jpg", "https://cdn.thetitlemag.com/wp-content/uploads/2017/11/avengers-screengrab-8-1117.jpg"], "top_img": "https://cdn.thetitlemag.com/wp-content/uploads/2017/11/avengers-infintiy-war-1117.jpg", "keywords": [], "authors": [], "canonical_link": "https://thetitlemag.com/culture/ranking-avengers-new-looks-avengers-infinity-war-trailer/", "title": "Ranking All of the Avengers’ New Looks In the Avengers: Infinity War Trailer", "meta_data": {"description": "Good men are hard to define", "viewport": "width=device-width, initial-scale=1.0, user-scalable=no", "sjm": {"version": "1.8.6"}, "thumbnail": "https://cdn.thetitlemag.com/wp-content/uploads/2017/11/avengers-infintiy-war-1117-900x600-c-default.jpg", "msapplication-config": "/wp-content/themes/sjm-genus/img/favicon/browserconfig.xml", "theme-color": "#ffffff", "og": {"locale": "en_US", "type": "article", "title": "Ranking All of the Avengers' New Looks In the Avengers: Infinity War Trailer - Title Magazine", "description": "Cap has a beard! Black Widow is blonde! Spider-Man grew...body hair?", "url": "https://thetitlemag.com/culture/ranking-avengers-new-looks-avengers-infinity-war-trailer/", "site_name": "Title Magazine", "updated_time": "2017-11-30T11:01:36-04:00", "image": {"identifier": "https://cdn.thetitlemag.com/wp-content/uploads/2017/11/avengers-infintiy-war-1117.jpg", "secure_url": "https://cdn.thetitlemag.com/wp-content/uploads/2017/11/avengers-infintiy-war-1117.jpg", "width": 2000, "height": 1125}}, "article": {"publisher": "https://www.facebook.com/thetitlemag", "tag": "Trailers", "section": "Culture", "published_time": "2017-11-29T15:22:40-04:00", "modified_time": "2017-11-30T11:01:36-04:00"}, "twitter": {"card": "summary", "description": "Cap has a beard! Black Widow is blonde! Spider-Man grew...body hair?", "title": "Ranking All of the Avengers' New Looks In the Avengers: Infinity War Trailer - Title Magazine", "site": "@thetitlemag", "image": "https://cdn.thetitlemag.com/wp-content/uploads/2017/11/avengers-infintiy-war-1117.jpg", "creator": "@thetitlemag"}, "generator": "WordPress 4.9.2"}, "movies": ["https://www.youtube.com/embed/6ZfuNTqbHE8?feature=oembed"], "publish_date": 1511983360.0, "source": "https://thetitlemag.com", "summary": ""}