{"url": "https://web.archive.org/web/20210112112415/https://www.thetalko.com/top-20-most-successful-rupauls-drag-queens-that-ever-sashayed-their-way-to-the-top/", "text": "We have seen some extraordinary queens on Ru's den of drag madness over the years.\n\nIt might have had humble beginnings (as humble as a posse of animated drag queens thrown together on reality TV can be!), but over the years, RuPaul's Drag Race has put a sparkle in practically every American's living room with its hilarious challenges, dramatic runway looks, and queen-on-queen teardowns...all the while being unapologetically fabulous!\n\nAnd while the current season of Drag Race is heating up and nearing the ultimate battle for the crown, we can't help but remember the queens who sashayed onto our TV screens in the past through the show's ten successful seasons and then permanently found a \"Shantay, you stay\" in our hearts.\n\nWhether it was Sharon Needles and her brilliant runway looks that sent shivers down our spine or Bianca Del Rio and her sharp arrows of truth that hilariously left us saying \"ouch\", we have seen some extraordinary queens on Ru's den of drag madness over the years. And while all did not win the ultimate title of America's Next Drag Superstar, they all went on and kept killing it even after their season was officially over.\n\nSo here are the top 20 most successful RuPaul's drag queens that ever sashayed their way to the top. Is your favorite queen on this list? There's only one way to find out...\n\n20 Raven: The Witty & Runwaylicious Queen\n\nInstagram\n\nYou don't always have to be crowned a winner to actually be a winner. And Raven made that absolutely clear on every episode of Season 2. Okay, maybe not every episode, but she clearly was a fan favorite for the crown of America's Next Drag Superstar. And the public's opinion did not change when she again missed the crown by a hair on Season 1 of RuPaul's Drag Race All Stars, earning her the moniker \"Queen of Runner-ups\".\n\nKnown for her witty remarks and her dramatic, perfect-to-the-dot makeup and style, Raven has also appeared in the Drag Race spin-off show, RuPaul's Drag U, where she was portrayed as a nurturing \"drag professor\" to the young female contestants who get makeovers.\n\nWhile she only made 12 appearances on that show, she has the most number of wins, and so became known as the \"Makeover Queen\" of Drag U.\n\nKnowing all this, it shouldn't surprise you that a lot of young and emerging drag queens often copy Raven's iconic looks. She really is that fabulous!\n\nSo what's Raven up to these days? Well, when she is not tooting and booting Drag Race runway looks on the super popular web series Fashion Photo Ruview with Raja, she can be found in drag shows full time in California.\n\n19 BenDeLaCreme: The Terminally Delightful Queen\n\nInstagram\n\nBenDeLaCreme was one of the forerunners of Season 6 of Drag Race. Remember the puppet challenge where she nailed her Bianca impersonation (pun absolutely intended)? That's why it felt like a real victory when, after her \"Lip Sync for Your Life\" battle against Darienne Lake on Episode 7, Ru turned to her and said, \"Shantay, you stay too.\"\n\nWhile BenDeLa eventually had to sashay away on that season after she lost her second lip-sync battle against Darienne Lake, she returned in Season 3 of All Stars where she was bigger, better, and a force to be reckoned with.\n\nIn fact, she was so good on All Stars (she won all challenges except one) that she left the entire nation dumbfounded when she chose to eliminate herself in Episode 6 after she won the power to axe any of the Top 5 contestants.\n\n\"I was honestly dumbfounded by my own performance in the competition so far, and I never envisioned feeling like I'd succeeded this much on the show,\" she told Billboard in an interview. So when she saw that her competitors were very upset one of them would have to go home, she realized they still felt like they needed to prove something to the world.\n\n\"It was like...I have shown the world that I am capable, and I don't have to keep going along with a rule that has never sat well with me.\"\n\n18 Latrice Royale: The Positive Mama-Bear Queen\n\nInstagram\n\nThere are so many things that make Latrice Royale who she is. There's her loud, fully-belly laugh that has the ability to instantly improve the vibe of any room, her chunky yet funky sense of humor, and also her loving, positive mama bear attitude.\n\nBelieve us, this bold and beautiful queen is positively quotable! No wonder fans crowned her \"Miss Congeniality\" of Season 4 of Drag Race.\n\nLatrice also made herstory on Drag Race when she dressed up like an expecting mother and lip-synced while standing in one place on Episode 10's \"Lip Sync for Your Life\". The raw emotions she evoked during her flawless lip sync to Aretha Franklin's \"You Make Me Feel Like A Natural Woman\" left the judges gaping in awe and won her the battle against Kenya Michaels. Maybe that's why her elimination in the very next episode came as such a shocker.\n\nBut true to character, before she sashayed away she thanked RuPaul in her goodbye speech for changing the world of drag, which in turn changed her life. Guest judge Rose McGowan teared up on hearing that.\n\nWanna know what Latrice is up to these days? Well, when she's not doing drag all over the world, she's busy recording music videos and promoting her latest album eXcuse the Beauty.\n\n17 Jinkx Monsoon: The Old-School Hollywood Kitsch Queen\n\nInstagram\n\nWho can forget Jinkx Monsoon from Season 5 of RuPaul's Drag Race? Or as she likes to introduce herself: Seattle's premiere Jewish narcoleptic drag queen. (She really did have a tendency to fall asleep just about wherever on the set.)\n\nHilarious, eccentric, and known for her fabulous impersonations, Jinkx really stood out in her season of Drag Race after she won the \"Snatch Game\" challenge where she impersonated American socialite, Edith \"Little Edie\" Bouvier Beale and left everyone splitting at their seams, especially when she flipped the flatlining performance of Ivy Winters as Marilyn Monroe with a wisecrack about the actress's presidential scandal.\n\nShe was also the only Drag Race contestant to have the highest number of consecutive challenge wins on the show with 9 consecutive weeks of winning.\n\nThroughout her season of Drag Race, Jinkx often found herself bullied by Detox, Alaska, and Roxxxy Andrews with Roxxxy being the meanest of them all. In fact, Roxxxy even mocked her narcoleptic tendency to doze off in odd places during the \"Everybody Loves Puppets\" mini challenge. But she stayed strong through the entire ordeal by repeating \"water off a duck's back\", which has since then become one of her most memorable quotes.\n\n16 Raja: The Runway Queen No One Can Take Down\n\nInstagram\n\nYou probably do not know this, but \"Raja\" means king in many Asian languages. And that name fits this Asian-American queen like a glove not just because she won Season 3 of RuPaul's Drag Race, but also because she believes that just because her drag avatar is more pretty, does not mean her masculine self is not important.\n\nPrior to appearing on Drag Race, Raja was a famed makeup artist who had worked for Tyra Banks on America's Next Top Model and was Adam Lambert's personal MUA.\n\nMaybe that's why none of her fellow contestants could dethrone her on the runway.\n\nFrom her creative, Mario Antoinettesque pantsuit to her serving-it-up-on-the-Serengeti tribal drag, every look she wore on the runway was on pointe and the makeup flawless. And she wasn't bad in the challenges either, especially her impersonation of Tyra Banks in the \"Snatch Games\" for which she received high praise, although she did not win that challenge.\n\nIn an interview with Loverboy magazine, Raja mentioned that she intentionally did not wear paddings for her first entrance in the green room because she wanted to stand out among the queens but still be comfortable as she knew the first challenge was going to be a curveball.\n\n\"I thought of myself as an athlete. I was like “OK I’m ready.”.\"\n\nIt was definitely a smart move because she ended up winning the first challenge...and the final one too.\n\n15 Trixie Mattel: The Queen Who Left Too Early\n\nInstagram\n\nWhen you hear Trixie Mattel's name for the first time, you instinctively picture a tall, blonde, leggy drag queen with the perfect hair, perfect makeup, and perfect outfit. And then you get the shock of your life when you actually see the real Trixie.\n\nDressed like a horrific, \"I am clearly doing this for the gag appeal\" version of the classic Barbie doll, Trixie Mattel can really jar people out of their seats when they encounter her for the first time, either on their screens or in person. But once the shock value wears off, that's when the magic of this drag character really starts to play out.\n\nNo wonder fans got so furious when Trixie was eliminated so early in Season 7 of Drag Race.\n\nIn fact, the public outrage over Ru's decision was so strong that it started a social media hailstorm complete with #justiceforTrixie. So they ended up bringing her back on in a grand manner, although Trixie still did not win her season.\n\nBut this fan favorite \"Miss Congeniality\" finally got what was due to her when she returned for Season 3 of All Stars and ended up winning it by smashing the ultimate lip sync battle to Miley Cyrus's \"Wrecking Ball\".\n\n14 Shea Couleé: The Queen Who Slayed\n\nInstagram\n\n\"My name is Shea Couleé, and I didn't come to play, I came to slay!\"\n\nThis is what Shea said during her grand entrance in the green room in Episode 1. And she definitely slayed 'em all during her season on Drag Race.\n\nKnown for her fierce runway looks and her catty comments that were flat-out quotable, Shea was clearly one of the frontrunners of Season 9, winning four main challenges and sashaying her way to the finale with Peppermint, Trinity Taylor, and Sasha Velour.\n\nSome of her most memorable moments on the show were her impression of Blac Chyna in Episode 5 and the hilarious crime-fighting duo TV pilot she co-created with Sasha in Episode 9's \"Your Pilot's On Fire\" challenge. But the very next episode turned out to be a nightmare for her when she received heavy criticism for the way she transformed her chosen crew member into a drag queen and ended up in the bottom two. Thankfully, she won the lip sync battle in that episode but ultimately lost out to Sasha Velour during the grand finale.\n\nWant to know what Shea's been up to since Drag Race? This fiery queen has been busy recording singles and has also released an album Coulee-d.\n\n13 Shangela: The Queen Who Kept Coming Back\n\nInstagram\n\nHalleloo! It's Shangela. The pretty-as-a-picture drag queen who had an interesting run on RuPaul's Drag Race in not one, not two, but three different seasons of the show.\n\nHer third and final appearance was in Season 3 of Drag Race All Stars where she went all the way to the grand finale. But you never know. She just might pop out of the gift box again!\n\nWhen Shangela first sashayed into Season 2 of Drag Race, she just had 5 months of experience doing drag. Understandably, she couldn't compete against her more experienced competitors and was sent home at the end of Episode 1 to the now-famous Ru line, \"This is RuPaul's Drag Race, NOT RuPaul's School for Girls!\"\n\nBut she returned dramatically in Season 3 when she popped out of a gift box, shouting \"halleloo\". Ru had decided that the one year break had given her enough experience to be worthy of a spot on Drag Race. And she proved Ru right when she fought tooth and nail to reach Episode 11, where she lost the lipsync battle to Alexis Matteo.\n\nShangela popped out of a gift box once again in Season 4 of Drag Race, but this time it was just to tease the new girls. Because everybody likes a good laugh after a scare!\n\n12 Peppermint: The Queen Who's Ready To Change The World\n\nTV Guide\n\nThe LGBTQ community cheered when Peppermint was named as one of the contestants of Drag Race Season 9. It was because she was the first openly transgender contestant to ever sashay onto Ru's stage. And then she proved herself to be the perfect mascot for her community when she went all the way to the grand finale.\n\nDuring her time on the show, Peppermint became known for her warm personality, her feisty side, and her ability to crush the competition in every lip sync battle she had to perform on the show. The latter earned her the moniker \"Lip Sync Assassin\" and made her a true force to be reckoned with on the grand finale day when she crushed Trinity Taylor and sailed into her final battle for the crown with Sasha Velour.\n\nUnfortunately, Sasha Velour turned out to be a \"lipsync assassin in the closet\" (because she never landed in bottom 2 during her time on the show) and Peppermint graciously stepped aside as Ru handed the crown and scepter of America's Next Drag Superstar to Velour.\n\nSince then Peppermint has been busy performing all over the world.\n\nSo if you are wondering when this legend is going to perform in your city, you should follow her on Instagram @peppermint247.\n\n11 Sasha Velour: The Cerebral & Eccentric Queen\n\nInstagram\n\nThere have been very few queens on RuPaul's Drag Race who stood out from the competition from their very first appearance on the show. Raja was one and so was Sharon Needles, and then Sasha Velour joined their league.\n\nYou couldn't put your finger on it, but when Sasha glided onto the stage, there was a certain star quality in her that was not there in any of her competitors. And it wasn't just her hunger for the crown (which was evident right from the first day) or her eccentric style that bordered on villainous. It was something intangible in her spirit and the look in her eye that immediately told you that this queen was going to get far.\n\nAnd get far she did when she shocked the world by shaking out rose petals from under her wig in her powerful performance during her lipsync battle to the song \"So Emotional\". You couldn't watch it and not feel goosebumps prickle your skin. In fact, once the performance was over, I realized I hadn't looked at Shea even once even though she was performing right alongside Sasha!\n\nSasha has been busy touring the world since she won Season 9 of Drag Race, performing her famous drag routine \"Nightgowns\". So if you want some more of her, you should definitely go and see her perform live.\n\n10 Detox: The Queen Of Illusions\n\nInstagram\n\nLet us repeat the catchphrase: you don't need a crown to be a queen. And that's true for Detox because, like Raven, she might have lost the crown in her season, but she was definitely a winner in her own right.\n\nKnown for her high fashion, Avante-garde style and makeup, her love for wearing pieces that generate shock value unexpectedly, and her signature move of shaking her jaw sideways during her lipsync battles, Detox really stood out from the competition during her run in Season 5 of Drag Race because she refused to play nice.\n\nIn fact, she, Alaska, and Roxxxy Andrews even formed an alliance while on the show called the \"Rolaskatox\" that vowed to look out for each other and take down the competition.\n\nThe move was criticized by judge, Michelle Visage, but the three remained strong until she was eliminated in Episode 11.\n\nBut true to style, when the entire cast of Season 5 showed up for the reunion in LA, Detox one-upped everyone by turning herself into a walking black-and-white photograph with the help of makeup and extreme attention to detail.\n\nShe returned again as a contestant on Season 2 of All Stars with the other members of \"Rolaskatox\" but tied in 3rd/4th place with Katya.\n\n9 Bob The Drag Queen: The Party Don't Start Till She Walks In!\n\nInstagram\n\n\"What you see is what you get.\"\n\nThis is how Bob The Drag Queen introduced herself on Season 8 of Drag Race. And she definitely was not faking it because she crushed her competition throughout the season and went on to win the crown of America's Next Drag Superstar.\n\n\"If you want to win Drag Race, you have to win most of the challenges,\" she told Raja when she came on the latter's show, The Pit Shop. \"That seems fair to me. Whoever has the best grades at the end of the year is the Valedictorian. You win. So if you are not winning, what are you doing here?\"\n\nAnd Bob didn't fizzle out after her season finished airing. She actually went on to do even bigger things after Drag Race, which includes landing a big role in the Netflix movie Cherry Pop, releasing visually stunning dance singles, and doing her very own comedy special Suspiciously Large Woman.\n\nWhen she is not touring the world, she fills in for Katya on the Trixie and Katya Show and also has her own show on WOWPresents Bobbin' Around, which features her traveling around the world with her assistant, Luis.\n\n8 Chad Michaels: The Queen Of All Queens\n\nInstagram\n\nPeople were sorely disappointed when Chad Michaels, the famous Cher impersonator, lost the crown of America's Next Drag Superstar to Sharon Needles during Season 4 of Drag Race. And many feel Ru felt the same way (she obviously could not crown both the queens) because she immediately brought Chad back in the very first season of RuPaul's Drag Race All Stars and crowned her the winner, giving her the title of \"Queen of all Queens\".\n\nThroughout Chad's run on the show, she stuck to her character of Cher, which brought her high praise from the judges.\n\nIn fact, her Cher impersonation during the \"Snatch Game\" on the show was so on point (she even switched her wig multiple times through the game stating she gets bored of them in 5 minutes) that she ended up winning that challenge.\n\nNevertheless, Michelle Visage did point out one time that she would like to see the real Chad be vulnerable in drag instead of hiding behind the polished persona of Cher. Not that it stopped the queen from playing her favorite role.\n\n\"Everything I've gone through in my life has been because of Cher... the people I've gotten to meet, the clothes on my back. I basically owe her everything,\" Chad famously said during the show.\n\n7 Alyssa Edwards: The Sassy Tongue-Popping Queen\n\nInstagram\n\nYou cannot talk about Alyssa Edwards and not suck in your cheeks and forcefully pop your tongue against the floor of your mouth. Even the queens cannot resist doing her signature move whenever they talk about her on the show or while hosting their respective web series. That's how legendary Alyssa is.\n\nWhen she was competing on Season 5 of Drag Race, she was a fierce competitor who became famous for her dance moves, the weird faces she used to pull while putting on makeup, and her quotable comments. She was also the last contestant on Drag Race herstory to receive immunity, which saved her after her appalling impersonation of Katy Perry during the \"Snatch Game\" for which RuPaul made her apologize to the star.\n\nAnd though Alyssa did not go all the way to the finale during her season, she did come back again during Season 2 of All Stars. Unfortunately, she didn't win that run either. But that didn't matter in the end because she went on to have huge success after the show through her popular web series Alyssa's Secret and her dance company Beyond Belief, which is based in Texas.\n\nAlyssa is also the drag mother of four Drag Race contestants – Shangela, Laganja Estranja, Gia Gunn, and Logan Hardcore – all of whom belong to the House of Edwards and have mastered their own tongue-popping game.\n\n6 Adore Delano: The Punk Rocker Queen\n\nInstagram\n\nThe name fits the queen here like a leather glove fits a hand. Because Adore Delano is absolutely adorable. Although she might appreciate the tag of \"goth party girl\" more.\n\nWhen she first appeared on Season 6 of RuPaul's Drag Race, Adore was fresh-faced and a little unpolished, which was often pointed out to her by the judges. But she had bucketloads of creativity to make up for it, which she proved by winning the \"Oh No She Betta Don't\" rap battle challenge of Episode 6 and the \"Glamazon by Colorevolution\" challenge on Episode 7. She was also praised highly for her impersonation of Anna Nicole Smith during the \"Snatch Game\" challenge although she did not win that particular round.\n\nDuring her time on Drag Race, Adore eventually became good friends with Bianca Del Rio when the latter took her under her wings and gave her some sewing tips since she did not know how to sew.\n\nThis was probably a big reason why she managed to reach the grand finale with Bianca and Courtney Act, although she lost the crown to Bianca.\n\nAdore returned again in All Stars Season 2 but voluntarily quit the show after she was criticized viciously by Michelle Visage during Episode 2. Not that she really needed the crown. She was already famous on the billboards because of her hit music albums.\n\n5 Sharon Needles: The Queen Of Spook\n\nInstagram\n\nWho can forget that runway spookfest when Sharon Needles walked out dressed like a zombie and then gushed fake blood from her mouth. The disco bloodbath was horrific and awe-inducing at the same time, just like Sharon's unique take on drag.\n\nThroughout her run on Season 4 of Drag Race, Sharon wowed everyone with her Halloween-inspired looks and scary esthetic that was elegant and well-executed at the same time. It was something no one had ever done before on Drag Race and really elevated what drag could be. No wonder she had such a raving fan following once the show was aired, and was eventually crowned the winner of her season, defeating Phi Phi O'Hara, who bullied her throughout the season, and Chad Michaels, who also had a raving fan following.\n\nOther than her appearance on Drag Race, Sharon is also famous for releasing hit singles and music albums that celebrates her dark tastes. Her most famous album is the Billboard favorite PG-13, which also featured RuPaul and Alaska among others.\n\nAnd speaking of Alaska, one of the most talked about relationships in drag herstory was Sharon's 5-year-long relationship with the Season 5 contestant. The two even started their own production company called House of Haunt but aren't together any longer.\n\n4 Courtney Act: The Queen With The Most-Polished Act\n\nInstagram\n\nCourtney Act is to Australia what RuPaul is to America. She singlehandedly made the drag scene popular in the southern continent and even competed in Season 1 of Australian Idol in drag.\n\nNevertheless, Courtney wasn't satisfied with being the biggest fish on a small island and so auditioned for Drag Race and was chosen as one of the 14 contestants on RuPaul's Drag Race Season 6.\n\nIt was her first step to making her American dream come true.\n\nUnfortunately, Courtney lost the crown to Bianca Del Rio in her season, but no one can deny that she was one of the toughest competitors on the show and knew how to demolish the runway with her well-executed costumes and looks. In fact, her massive 10-foot winged look during the animal-themed runway challenge is considered one of the top 10 looks of Drag Race herstory.\n\nAfter Drag Race, Courtney went on to star in Season 21 of the UK reality show Celebrity Big Brother, which she won, finally breaking her curse of reaching the finale of major TV shows and not winning them.\n\nNo wonder Courtney is one of the richest drag queens in the world!\n\n3 Katya: The Queen With The Animated Hands\n\nInstagram\n\nKatya Zomolodchikova is a unique drag queen because when she is out of drag, she is the farthest thing from a Russian. And that's what makes her drag name brilliant because when in drag, she plays a hilarious Russian character who performs in English with a Russian accent, English, and sometimes in Russian.\n\nInterestingly enough, Katya is extremely flexible and so based her drag surname on the surname of her favorite Russian gymnast.\n\nDuring her run on Season 7 of RuPaul's Drag Race, she was a clear fan favorite for the ultimate crown because of her strong sense of humor and her honesty during the \"Untucked\" segment of Drag Race. But she lost the crown to Violet Chachki in the grand finale.\n\nShe returned again on Season 2 of All Stars, but lost the crown once more to Alaska. Nevertheless, the judges praised her for her character sketches during All Stars, which was something she couldn't do convincingly during her main season of Drag Race.\n\nAfter Drag Race, Katya became famous for co-hosting a web series named UNHhhh with Trixie Mattel. The name was later changed to The Trixie and Katya Show when it was picked up for television.\n\n2 Alaska: The Self-Proclaimed Extraterrestrial Queen\n\nInstagram\n\nPeople already knew who Alaska was by the time she appeared on Season 5 of Drag Race. It was because she was in a long-term relationship with Sharon Needles, who won Season 4. Sharon often talked about their relationship during the show because she felt guilty of how Alaska had auditioned for the show since Season 1 but had failed to get on while she got through on her very first try.\n\nSo when Alaska strutted in and took off her horse mask during her entrance in Season 5, people were expecting big things from her. And she did not disappoint them.\n\nFrom her hilarious impersonation of Lady Bunny during the \"Snatch Game\" to her on-point runway looks, Alaska was a forerunner of her season. Unfortunately, her alliance with Roxxxy Andrews and Detox, which they named \"Rolaskatox\", did not endear her to a lot of people because of the way they bullied some of the other contestants of their season, including the season winner, Jinkx Monsoon.\n\nThe three allies returned again on Season 3 of All Stars, which was ultimately won by Alaska.\n\nAlaska's career has been very happening ever since she starred on Drag Race. And currently, when she's not touring the world, she can be found recording singles for her hit music career.\n\n1 Bianca Del Rio: The Clown Queen With A Heart Of Gold\n\nInstagram\n\nBianca Del Rio is a bonafide clown. Actually, scratch that, when you see her in drag, it looks a lot like what you would get if you crossed a clown with a raccoon. But that didn't stop her from killing it in the most entertaining season of Drag Race and ultimately being crowned America's Next Drag Superstar.\n\nIn fact, we think Season 6 probably would have been a lack-luster affair if it weren't for her ability to read people like a book and then shoot sharp arrows of honesty that left you saying \"ouch\" even as you rolled on the floor with laughter.\n\nFrom her hilarious impersonation of Judge Judy during the \"Snatch Game\" to the way she worked up the audience of old people during the stand-up comedy challenge, she was known for just one thing on the show: her sense of humor. And that's not a bad thing. Like she said during her stand-up routine – \"I'll show you versatility when Santino wins a sewing competition and Michelle Visage wears a turtleneck!\"\n\nAnd Bianca has grown into a phenomenon since Drag Race with her Blame It On Bianca international stand-up comedy tour that is performed in front of a stadium full of people, her chart-topping comedy movie Hurricane Bianca, and her recently released book Blame It On Bianca: The Expert On Nothing With An Opinion On Everything.\n\nReferences: Manhattan Digest, E News, Billboard, RuPaul's Drag Race Wiki1, RuPaul's Drag Race Wiki2, Loverboy, Daily Mail, RuPaul's Drag Race Wiki3, RuPaul's Drag Race Wiki4, RuPaul's Drag Race Wiki5\n\nShare Share Tweet Email\n\nNext 10 Best Sitcom Boyfriends Since The 2000s", "images": ["https://web.archive.org/web/20210112112415im_/https://www.thetalko.com/public/build/images/tv-logo-full-colored-light.8d65e7f9.svg", "https://web.archive.org/web/20210112112415im_/https://static0.thetalkoimages.com/wordpress/wp-content/uploads/2018/05/shae1-copy.jpg", "https://web.archive.org/web/20210112112415im_/https://www.thetalko.com/public/build/images/mm-logo-full-colored-light.53763959.svg", "https://web.archive.org/web/20210112112415im_/https://q.quora.com/_/ad/91f52889f6a04390a65ad2591c5 d9986e/pixel?tag=ViewContent&noscript=1", "https://web.archive.org/web/20210112112415im_/https://www.thetalko.com/public/build/images/bg-logo-full-colored-light.2bae128a.svg", "https://web.archive.org/web/20210112112415im_/https://www.thetalko.com/public/build/images/re-logo-full-colored-light.4b543c53.svg"], "top_img": "https://web.archive.org/web/20210112112415im_/https://static0.thetalkoimages.com/wordpress/wp-content/uploads/2018/05/shae1-copy.jpg", "keywords": [], "authors": ["Valeria Black"], "canonical_link": "https://web.archive.org/web/20210112112415/https://www.thetalko.com/top-20-most-successful-rupauls-drag-queens-that-ever-sashayed-their-way-to-the-top/", "title": "Top 20 Most Successful RuPaul's Drag Queens That Ever Sashayed Their Way To The Top", "meta_data": {"robots": "max-image-preview:large", "viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "description": "We have seen some extraordinary queens on Ru's den of drag madness over the years.", "og": {"title": "Top 20 Most Successful RuPaul's Drag Queens That Ever Sashayed Their Way To The Top", "type": "article", "image": {"identifier": "https://web.archive.org/web/20210112112415im_/https://static0.thetalkoimages.com/wordpress/wp-content/uploads/2018/05/shae1-copy.jpg", "width": 1200, "height": 628}, "url": "https://web.archive.org/web/20210112112415/https://www.thetalko.com/top-20-most-successful-rupauls-drag-queens-that-ever-sashayed-their-way-to-the-top/", "locale": "en_US", "description": "We have seen some extraordinary queens on Ru's den of drag madness over the years.", "site_name": "TheTalko"}, "article": {"published_time": "2018-05-29T20:00:12Z", "modified_time": "2018-05-29T20:00:12Z", "section": "Entertainment"}, "twitter": {"card": "summary_large_image", "site": "@thetalko", "title": "Top 20 Most Successful RuPaul's Drag Queens That Ever Sashayed Their Way To The Top", "description": "We have seen some extraordinary queens on Ru's den of drag madness over the years.", "image": "https://web.archive.org/web/20210112112415im_/https://static0.thetalkoimages.com/wordpress/wp-content/uploads/2018/05/shae1-copy.jpg"}, "fb": {"app_id": 1470061169975403}}, "movies": [], "publish_date": 1527624012.0, "source": "https://web.archive.org", "summary": ""}