{"url": "https://www.hollywoodreporter.com/live-feed/lucifer-revived-at-netflix-fox-cancellation-1120632", "text": "Lucifer is getting a second life.\n\nNetflix is reviving the canceled Fox drama for a fourth season. The DC Entertainment series, which hails from Warner Bros. Television, was axed in May. An episode count for the new season has yet to be determined.\n\nThis isn’t the first time the streaming giant has picked up a canceled show from the Time Warner-owned studio. Netflix previously revived Warner Horizon’s Longmire after A&E axed the series. The two companies are also in business together on the Kiernan Shipka starrer Sabrina, a Riverdale offshoot. (Riverdale, meanwhile, remains a monster hit on Netflix, which has SVOD rights after originals air on The CW.)\n\nLucifer joins Brooklyn Nine-Nine as the second Fox series to be canceled this season and move to another outlet (the latter was saved by NBC). The decision to drop both Brooklyn and Lucifer — neither of which were owned by Fox — comes as the network is undergoing a dramatic shift amid its studio counterpart’s pending sale to Disney (or Comcast). Gone are niche comedies like Brooklyn and narrow dramas like Lucifer as Fox plots a shift to broader audiences with a slate of procedurals and multicamera comedies including Tim Allen’s Last Man Standing. (The latter was revived at Fox — whose 20th TV owns the series — a year after it was canceled at ABC.)\n\nLucifer never really set the ratings afire. In its third season, it averaged a 1.3 rating among adults 18-49 and nearly 5 million viewers once all live-plus-7 lifts were factored in. Its live tune-in was a limp 0.8 rating in the key demo, and not for a lack of attempts to give it a fighting chance on the network’s part. Lucifer aired alongside such power players as the original X-Files revival and Gotham.\n\nNetflix revived the DC Comics-inspired drama after a massive fan campaign. Season three ended on a cliffhanger, with creator Joe Henderson tweeting out that the axing “fucking hurts” and that he was sorry for frustrating “the hell out of you fans.” Series star Tom Ellis, for his part, tweeted that he was “gutted” by the cancellation. “It fills me with great sadness to confirm the rumours that some of you have been asking. Fox has indeed cancelled #lucifer I’m so sorry guys,” the actor wrote at the time.\n\nLucifer was one of multiple series to have the proverbial rug pulled out from beneath it amid Fox’s creative shift. Established shows and pilots continue to move beyond their initial homes as the Peak TV era offers more choices where one outlet’s miss is another’s hit. It also is worth noting that Netflix didn’t even have the SVOD rights to Lucifer — Hulu did — meaning that deal had to be reworked, similar to the way Amazon recently revived Syfy’s The Expanse after having to renegotiate SVOD rights as the first three seasons were sold to Netflix.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/09/lucifer_s03e01_still_embed.jpg?w=928&h=619&crop=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/09/lucifer_s03e01_still_embed.jpg?w=928", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/09/lucifer_s03e01_still_embed.jpg?w=928", "keywords": [], "authors": ["Bryn Sandberg Lesley Goldberg", "Bryn Sandberg", "Lesley Goldberg"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/lucifer-revived-at-netflix-fox-cancellation-1120632/", "title": "‘Lucifer’ Revived at Netflix After Fox Cancellation", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Netflix has greenlighted a fourth season of 'Lucifer' following Fox's cancellation.", "news_keywords": "Lucifer, Netflix, Warner Bros. Television", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Lesley Goldberg", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1120632, "title": "'Lucifer' Revived at Netflix After Fox Cancellation", "published_at": "2018-06-15 13:30:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/09/lucifer_s03e01_still_embed.jpg?w=928", "comment_count": 0, "tags": "Warner Bros. Television", "topics": "TV News", "body": "Lucifer is getting a second life.\r\nNetflix is reviving the canceled Fox drama for a fourth season. The DC Entertainment series, which hails from Warner Bros. Television, was axed in May. An episode count for the new season has yet to be determined.\r\nThis isn't the first time the streaming giant has picked up a canceled show from the Time Warner-owned studio. Netflix previously revived Warner Horizon's Longmire after A&E axed the series. The two companies are also in business together on the Kiernan Shipka starrer Sabrina, a Riverdale offshoot. (Riverdale, meanwhile, remains a monster hit on Netflix, which has SVOD rights after originals air on The CW.)\r\nLucifer joins Brooklyn Nine-Nine as the second Fox series to be canceled this season and move to another outlet (the latter was saved by NBC). The decision to drop both Brooklyn and Lucifer — neither of which were owned by Fox — comes as the network is undergoing a dramatic shift amid its studio counterpart’s pending sale to Disney (or Comcast). Gone are niche comedies like Brooklyn and narrow dramas like Lucifer as Fox plots a shift to broader audiences with a slate of procedurals and multicamera comedies including Tim Allen’s Last Man Standing. (The latter was revived at Fox — whose 20th TV owns the series — a year after it was canceled at ABC.)\r\n\r\nLucifer never really set the ratings afire. In its third season, it averaged a 1.3 rating among adults 18-49 and nearly 5 million viewers once all live-plus-7 lifts were factored in. Its live tune-in was a limp 0.8 rating in the key demo, and not for a lack of attempts to give it a fighting chance on the network’s part. Lucifer aired alongside such power players as the original X-Files revival and Gotham.\r\nNetflix revived the DC Comics-inspired drama after a massive fan campaign. Season three ended on a cliffhanger, with creator Joe Henderson tweeting out that the axing \"fucking hurts\" and that he was sorry for frustrating \"the hell out of you fans.\" Series star Tom Ellis, for his part, tweeted that he was \"gutted\" by the cancellation. \"It fills me with great sadness to confirm the rumours that some of you have been asking. Fox has indeed cancelled #lucifer I’m so sorry guys,\" the actor wrote at the time.\r\nLucifer was one of multiple series to have the proverbial rug pulled out from beneath it amid Fox’s creative shift. Established shows and pilots continue to move beyond their initial homes as the Peak TV era offers more choices where one outlet’s miss is another’s hit. It also is worth noting that Netflix didn't even have the SVOD rights to Lucifer — Hulu did — meaning that deal had to be reworked, similar to the way Amazon recently revived Syfy’s The Expanse after having to renegotiate SVOD rights as the first three seasons were sold to Netflix.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Lucifer’ Revived at Netflix After Fox Cancellation", "url": "https://www.hollywoodreporter.com/tv/tv-news/lucifer-revived-at-netflix-fox-cancellation-1120632/", "description": "Netflix has greenlighted a fourth season of ‘Lucifer’ following Fox’s cancellation.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/09/lucifer_s03e01_still_embed.jpg?w=928", "width": 928, "height": 619}, "locale": "en_US"}, "article": {"published_time": "2018-06-15T13:30:00+00:00", "modified_time": "2018-06-17T18:15:08+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Lucifer’ Revived at Netflix After Fox Cancellation", "description": "Netflix has greenlighted a fourth season of ‘Lucifer’ following Fox’s cancellation.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/09/lucifer_s03e01_still_embed.jpg?w=928"}}, "movies": [], "publish_date": 1529069400.0, "source": "https://www.hollywoodreporter.com", "summary": ""}