{"url": "https://en.wikipedia.org/wiki/Better_Call_Saul", "text": "American crime drama television series\n\nBetter Call Saul is an American crime and legal drama television series created by Vince Gilligan and Peter Gould. Part of the Breaking Bad franchise, it is a spin-off, prequel and sequel to Gilligan's previous series, Breaking Bad. Set primarily in the early-mid 2000s in Albuquerque, New Mexico, the series develops Jimmy McGill (Bob Odenkirk), an earnest lawyer and former con artist, into an egocentric criminal defense attorney known as Saul Goodman. Also shown is the moral decline of former police officer Mike Ehrmantraut (Jonathan Banks), who becomes a violent fixer for drug traffickers to support his granddaughter and widowed daughter-in-law. The show premiered on AMC on February 8, 2015, and concluded on August 15, 2022, after six seasons consisting of 63 episodes.\n\nAt the start of the series, Jimmy struggles financially while he mostly works on court-appointed cases as a public defender. His romantic interest and former colleague, Kim Wexler (Rhea Seehorn), is an attorney at Hamlin, Hamlin & McGill (HHM), a law firm co-owned by Jimmy's brilliant but unwell brother, Chuck McGill (Michael McKean) and Chuck's law partner, Howard Hamlin (Patrick Fabian). After hiring Jimmy as legal representation, Mike provides advice and security for Nacho Varga (Michael Mando), an intelligent drug dealer who later becomes a mole for Gus Fring (Giancarlo Esposito), a drug lord and legitimate businessman as owner of the Los Pollos Hermanos fast food establishment. Their operations are disrupted by members of the murderous Salamanca family, including Lalo Salamanca (Tony Dalton). Odenkirk, Banks, and Esposito reprise their roles from Breaking Bad, as do many others who make guest appearances.\n\nBetter Call Saul has received widespread critical acclaim, with particular praise for its acting, characters, writing, direction, and cinematography; many critics have called it a worthy successor to Breaking Bad and one of the greatest television series of all time, with some deeming it superior to its predecessor.[5][6][7] It has garnered many nominations, including a Peabody Award, 46 Primetime Emmy Awards, 15 Writers Guild of America Awards, 14 Critics' Choice Television Awards, six Screen Actors Guild Awards, and four Golden Globe Awards. At the time of its airing, the series premiere held the record for the highest-rated scripted series premiere in basic cable history.\n\nPremise [ edit ]\n\nBetter Call Saul follows the transformation of Jimmy McGill (Bob Odenkirk), a former con artist who is trying to become a respectable lawyer, into the personality of the flamboyant criminal lawyer Saul Goodman (a play on the phrase \"[it]'s all good, man!\"), over the six-year period prior to the events of Breaking Bad, spanning from approximately 2002 to 2008.[8][9]\n\nJimmy is inspired by his older brother Chuck to leave his Chicago-area conman past, when he was known as \"Slippin' Jimmy\". He initially works in the mailroom at his brother's Albuquerque law firm, Hamlin, Hamlin & McGill (HHM), where managing partner Howard Hamlin becomes his nemesis. While at HHM Jimmy befriends Kim Wexler, a fellow mailroom employee who completes law school and becomes one of the firm's associates, and their friendship later turns romantic. Jimmy is motivated by Chuck's success to finish college and complete a Juris Doctor degree through a correspondence law school, the fictitious University of American Samoa.[10]\n\nAfter attaining admission to the bar but being denied employment at HHM, Jimmy's pursuits focus on low paying clients including working as a public defender. He later begins to build a practice in elder law, which leads to a prolonged lawsuit against a nursing home chain he discovers is defrauding its clients. He and Chuck begin working together on a class-action suit, which Chuck quickly punts to HHM, squeezing Jimmy out. Jimmy begins to unravel due to Chuck's constant belittling, sabotage, and vindictive behavior towards him. Jimmy's life and career begin to intersect with the illegal narcotics trade and feature characters and story arcs that continue into Breaking Bad.\n\nAmong these arcs is the uneasy truce between the Salamanca family that serves the Juárez Cartel drug interest, led first by Hector Salamanca and later by his nephews Tuco (Raymond Cruz) and Lalo, and Gus Fring, a fried chicken entrepreneur whose restaurant chain is a front for the drug trade. Those caught up in the ensuing turmoil include Ignacio \"Nacho\" Varga, a Salamanca associate who wants to protect his father from harm, and Mike Ehrmantraut, a former Philadelphia police officer who becomes a fixer for Gus. As his interactions with criminals continue, Jimmy takes on the persona of the flamboyant, colorful Saul Goodman, and he starts to draw on his conman past while his work as an attorney goes from questionable to unethical to illegal.\n\nIn addition to selected scenes that take place within the Breaking Bad timeline, the show includes flashforwards, shown in black and white, to events following Breaking Bad. These scenes, taking place in 2010, show Jimmy living as a fugitive under the identity Gene Takavic, the manager of a Cinnabon store in Omaha, Nebraska.\n\nCast and characters [ edit ]\n\nMain cast [ edit ]\n\nRecurring cast [ edit ]\n\nIntroduced in season 1 [ edit ]\n\nIntroduced in season 2 [ edit ]\n\nIntroduced in season 3 [ edit ]\n\nKimberly Hebert Gregory as Assistant District Attorney Kyra Hay\n\nHarrison Thomas as Lyle, the dedicated assistant manager of Los Pollos Hermanos\n\nTamara Tunie as Anita, a member of Mike and Stacey's support group\n\nBonnie Bartlett as Helen, Irene's friend and member of the affected class in the Sandpiper lawsuit\n\nIntroduced in season 4 [ edit ]\n\nDon Harvey (seasons 4–5) and Pat Healy (season 6) as Jeff, a taxi cab driver in the present that recognizes Gene as Saul Goodman\n\nRainer Bock as Werner Ziegler, an engineer hired by Gus to plan and oversee construction of his meth \"superlab\"\n\nBen Bela Böhm as Kai, a rebellious member of the crew Werner Ziegler assembles for the construction of Gus's meth \"superlab\"\n\nStefan Kapičić as Casper, a member of Werner Ziegler's team\n\nPoorna Jagannathan as Maureen Bruckner, a specialist from Johns Hopkins who flew to Albuquerque to treat Hector after Gus arranged for a \"generous grant\"\n\nKeiko Agena as Viola Goto, Kim Wexler's paralegal\n\nIntroduced in season 5 [ edit ]\n\nMax Bickelhaup as Buddy, Jeff's friend who later helps Gene with his schemes\n\nSasha Feldman and Morgan Krantz as Sticky and Ron, two petty crooks who are among \"Saul Goodman\" 's first clients\n\nfirst clients Barry Corbin as Everett Acker, an old man living on leased property belonging to Mesa Verde whom Kim has to evict to make way for the bank's new call center\n\nIntroduced in season 6 [ edit ]\n\nLennie Loftin as Genidowski, a con man hired by Jimmy and Kim to pose as Howard's private investigator\n\nSandrine Holt as Cheryl Hamlin, Howard's estranged wife\n\nJohn Posey as Rand Casimiro, a retired judge who is mediating the Sandpiper case\n\nJohn Ennis as Lenny, a grocery store employee hired by Jimmy and Kim to impersonate Casimiro\n\nCarol Burnett as Marion, Jeff's mother who takes a liking to Gene\n\nKevin Sussman as Mr. Lingk, a rich man with cancer who is targeted by Gene\n\nIntroduced in Breaking Bad [ edit ]\n\nProduction [ edit ]\n\nConception [ edit ]\n\nBetter Call Saul was developed and co-showrun by was developed and co-showrun by Vince Gilligan (left) and Peter Gould (right). Gould took over as sole showrunner after Gilligan left the writing staff during the third season.\n\nVince Gilligan and Peter Gould began considering a television spinoff of Breaking Bad as early as 2009. While filming the Breaking Bad episode \"Full Measure\", Gilligan asked Bob Odenkirk his thoughts on a Saul Goodman spinoff.[11] In July 2012, Gilligan publicly hinted at a Goodman spinoff,[12] stating that he liked \"the idea of a lawyer show in which the main lawyer will do anything it takes to stay out of court\", including settling on the courthouse steps.[13] During his appearance on Talking Bad, Odenkirk noted that Saul was one of the most popular characters on the show, speculating that the audience likes the character because he is \"the program's least hypocritical figure\", and \"is good at his job\".[14]\n\nGilligan noted that over the course of Breaking Bad, there were a lot of \"what ifs” their team considered, such as if the show won a Primetime Emmy Award, or if people would buy \"Los Pollos Hermanos\" T-shirts. The staff did not expect these events to come to fruition, but after they did, they started considering a spin-off featuring Saul as a thought experiment. Furthermore, Saul's character on Breaking Bad became much more developed than the staff had planned, as he was originally slated to appear in only three episodes. With the growth of Saul's character, Gilligan saw ways to explore the character further.[15]\n\nDevelopment [ edit ]\n\nIn April 2013, Better Call Saul was confirmed to be in development by Gilligan and Gould; the latter wrote the Breaking Bad episode that introduced the character.[16][17] In July 2013, before the second half of Breaking Bad's final season aired, Gilligan said he and Gould were still working out ideas for the spin-off, but a deal had not yet been made.[18] Netflix was one of many interested distributors, but ultimately a deal was made between AMC and Breaking Bad production company Sony Pictures Television.[19] Gilligan and Gould began as co-showrunners, and Gilligan directed the pilot.[20] Former Breaking Bad writers Thomas Schnauz and Gennifer Hutchison joined the writing staff, with Schnauz serving as co-executive producer and Hutchison as supervising producer.[21] Also joining the initial writing staff were Bradley Paul and former Breaking Bad writer's assistant Gordon Smith.[20]\n\nAs Sony and AMC began to commit to a spinoff, Gilligan and Gould worked on what it would be about. They initially considered making it a half-hour show where Saul would see various clients – celebrities in guest roles – in his strip mall office, a format similar to Dr. Katz, Professional Therapist, but they had no idea how to write for this type of format, and fell back to planning for hour-long episodes.[22][16][13] Since they had used this format with Breaking Bad, which Gilligan said was \"25-percent humor, 75-percent drama\", the two considered reversing that for Better Call Saul.[22] While the intent was to add more humor, the show remained heavy with dramatic elements, with Odenkirk calling the first season \"85 percent drama, 15 percent comedy.\"[23]\n\nWhile several of the characters are lawyers in the show, Gilligan and Gould did not want to write a legal show, but instead a crime show, but one that would necessitate some legal elements. To help in these areas, the writers spoke to real lawyers and spent time observing cases at Los Angeles Superior Court, observing that the bulk of the activity in these cases was downtime while waiting for others to complete actions.[24]\n\nGilligan and Gould found that the character of Saul Goodman was insufficient to carry the show by himself, with Gilligan calling the character of Saul \"great flavoring\" for a show but not the substance.[22] They came to realize that Saul, in the Breaking Bad timeframe, was a man that had come to accept himself, and recognized the potential of telling the story of how Saul got to be that person.[22] Gilligan and Gould had already committed to the Better Call Saul title, so that in following this route, they believed they had to quickly get from Jimmy McGill to Saul Goodman, or they would otherwise disappoint their audience. However, as they wrote the show, they realized \"we don't want to get to Saul Goodman … and that's the tragedy\".[22]\n\nGilligan and Gould had learned several lessons related to foreshadowing without writing the foresight for it from Breaking Bad,[25] and so with Better Call Saul, gave themselves more flexibility in how the show's plot would develop over its run, and had no firm idea where it will end up outside the connection to Breaking Bad.[22] For example, Rhea Seehorn's performance as Kim Wexler during the first season significantly altered how the writers used her character in later seasons as well as slowing down the pacing of the transition of Jimmy into Saul, as they gave more focus to the Jimmy–Kim relationship. Gilligan compared this to the impact Aaron Paul's acting had on Breaking Bad's ultimate pacing.[26]\n\nIn writing for Better Call Saul, Gilligan and Gould recognized they were including overlaps with Breaking Bad, and had ideas of characters they would include, such as Gus Fring, though on no set timetable within the show's development. Gilligan described the writing approach as if developing two separate shows, one that centers on Jimmy/Saul, Kim, Chuck, and Howard, and a second on the more familiar Breaking Bad characters like Mike and Gus with some overlap, as if they were giving the audience two shows for one.[22] Where possible, they had written in minor Breaking Bad characters in smaller parts or as Easter eggs to fans, but Gilligan preferred only to include such major Breaking Bad characters as Walter or Jesse if this seemed unconstrained and satisfactory to both the production team and the audiences.[22]\n\nBecause of the closeness to the Breaking Bad storyline, one of the writers was tasked at the start of each season to rewatch all 62 episodes of the show and verify that the scripts for the Better Call Saul season introduced no conflicts.[27] As the show continued, the show's \"brain trust\" consisting of script coordinators Ariel Levine and Kathleen Williams-Foshee reviewed each script to help maintain the continuity with Breaking Bad, including tracking minor character traits and assuring small details from the previous show were kept correct if brought up again.[28]\n\nGilligan's departure from the writing staff and return [ edit ]\n\nGilligan left the Better Call Saul writing staff early in the third season to focus on other projects, resulting in Gould becoming sole showrunner. This transition had been planned since the show's debut, but Gilligan hoped to return to the writers room during the show's final season.[29] He remained involved in the fourth and fifth seasons, but said he had very little to do with developing the show's contents during this period. Instead, Gilligan reduced his role to being a \"director for hire\" for the episodes \"Wiedersehen\" and \"Bagman\", and stated these were the only scripts he read when he was not on the writing staff.[30][31][32] He went on to credit Gould for maintaining the series' high quality.[30] Gould would bring Gilligan back to the writers room for the sixth and final season, calling it \"wonderful to have him there, so we can finish this show that we started together.\"[33]\n\nCasting [ edit ]\n\nBob Odenkirk confirmed he would reprise Saul Goodman in the starring role when the series was first announced, but his character would be introduced as lawyer Jimmy McGill.[17] In January 2014, it was announced that Jonathan Banks would reprise his Breaking Bad role as Mike Ehrmantraut and be a series regular.[34]\n\nNew cast members included Michael McKean as McGill's elder brother Chuck. McKean previously guest-starred in an episode of Odenkirk's Mr. Show and Gilligan's X-Files episode \"Dreamland\".[35][36] Rhea Seehorn auditioned and got the role of Kimberly \"Kim\" Wexler in April 2014, her character being described as \"prestigious attorney ... whose hard life is complicated by her romantic entanglements with somebody else at the firm\". In May 2014, Patrick Fabian was cast on the show as Howard Hamlin, a \"Kennedy-esque lawyer who's winning at life\". After impressing Gilligan and Gould with his audition tape and screen test, Michael Mando was cast as the \"smart and calculating criminal\" Ignacio \"Nacho\" Varga.[37][38][39] Mando's character had been previously mentioned but not seen in the Breaking Bad episode \"Better Call Saul\".[40]\n\nGoing into the third season, Giancarlo Esposito was added to the main cast as Gus Fring, a drug kingpin who previously served as one of Breaking Bad's main antagonists. Esposito was previously a starring cast member in Breaking Bad for the same role.[41] McKean would leave the series at season's end due to his character being written out, but would make appearances in the next season and the series finale.[42] Tony Dalton made his first appearance as Lalo Salamanca in the fourth season, and would be promoted to the main cast for the fifth.[43] Similar to Nacho, Lalo had been a character mentioned only by name in the same Breaking Bad episode \"Better Call Saul\".[40]\n\nGuest appearances from Breaking Bad characters [ edit ]\n\nBefore the second season, Gilligan confirmed that more of the prominent characters from Breaking Bad would be making guest appearances on the spin-off, but remained vague on which characters were likely to be seen.[44] By the next season, Gilligan said that the show had been on long enough that any reuse of Breaking Bad characters would require more than \"just a cameo or an Alfred Hitchcock walkthrough\", and that their appearances would need to be essential to the story.[45]\n\nThroughout the series run, both Bryan Cranston and Aaron Paul regularly said that if asked, they would be open to reappearing on the show as Walter White and Jesse Pinkman, respectively. Both believed that Gilligan would have to find a sufficiently good reason to bring them on the show.[45][46] Paul previously mentioned the possibility of a cameo during the first season but this fell through.[47][48] The two appeared together in the sixth-season episode \"Breaking Bad\", which was named after the original series.[49] Paul would have a separate cameo in the next episode; Cranston would appear again in the series finale.[50][51]\n\nDean Norris, another one of Breaking Bad's cast members, stated he could not be part of the earlier seasons, partly due to his involvement in the CBS series Under the Dome,[52] but was announced as a guest star reprising his role as Hank Schrader by the fifth season, where he appeared in the episodes \"The Guy for This\" and \"Namaste\".[53] Plans were initially made to have Betsy Brandt reprise her role as Marie Schrader, Hank's wife, for a cameo appearance in the second-season finale \"Klick\". However, the writer's room objected, considering the idea to be distracting for audiences.[54] She would eventually appear in the series finale.[55]\n\nOther Breaking Bad actors spoke of the potential of being on Better Call Saul. Before the series began, Anna Gunn mentioned a \"talk\" with Gilligan over possible guest appearances as Skyler White.[56] Bill Burr was set to return as Patrick Kuby in the fifth-season episode \"Dedicado a Max\", but scheduling fell through due to him needing to attend to a personal matter.[57][58] After the series ended, Gould mentioned his desire to bring back Gunn, Norris, Esposito and RJ Mitte for the finale, but he and the writing staff could not find a proper way to have them fit into the story.[59][60]\n\nFilming [ edit ]\n\n(top) and the Old Bernalillo County Courthouse (bottom). The series is shot in Albuquerque, New Mexico. Shooting locations include Cottonwood Mall and the Old Bernalillo County Courthouse\n\nPrincipal photography for Better Call Saul's six seasons took place from June 2, 2014, to February 9, 2022.[61][62][63] Like its predecessor, Better Call Saul is set in and around Albuquerque, New Mexico, with filming primarily taking place at Albuquerque Studios.[64][65] Notable exterior locations include the Twisters restaurant used previously in Breaking Bad for Gus's Los Pollos Hermanos, a parking lot kiosk at the Albuquerque Convention Center for where Mike worked in the first few seasons, the Old Bernalillo County Courthouse as the local courthouse, and two nearby office buildings in the North Valley, including Northrop Grumman's, that collectively are used for the HHM office spaces.[66]\n\nJimmy's back office is located in an actual nail salon, which the producers accommodated by working with the owners. The Salamanca's restaurant is a real business in the South Valley that production modified a bit for the show, but which otherwise remained open. The scenes set in Omaha are filmed at Cottonwood Mall in Albuquerque; production worked with Cinnabon to bring in the period-specific equipment and service items for the segments, and the extras in the store during these scenes are Cinnabon employees.[67] The New Mexico Film Office reported that the first four seasons of Better Call Saul brought over US$120 million into the state, and they have hired 1,600 crew for each season and a total of 11,300 extras.[68]\n\nAdditional filming was done in March 2022, after principal photography for the series ended, for the opening teaser of the season six episode \"Point and Shoot\". With several crew members but no cast members on hand, the scene was filmed in Leo Carrillo State Beach, California. This was the only time the series was filmed outside of New Mexico.[69]: 1:00:01–1:01:29 [70]\n\nBetter Call Saul employs Breaking Bad's signature time jumps.[71] Notably, most seasons' opening episode has started with a black and white flash-forward to a period in the years after the finale of Breaking Bad where Saul has been relocated to Omaha, Nebraska, as \"Gene\", a manager of a Cinnabon store, remaining paranoid about anyone discovering his past identity. This was foreshadowed in the penultimate episode of Breaking Bad, \"Granite State\", in which Saul tells Walter: \"If I'm lucky, a month from now, best-case scenario, I'm managing a Cinnabon in Omaha.\"[72]\n\nThe show's director of photography was Arthur Albert for the first two seasons, and Marshall Adams starting with season 3.[73] Additionally, Paul Donachie served as a cinematographer on episodes \"Namaste\" (2020), \"Carrot and Stick\" (2022) and \"Hit and Run\" (2022).[74] Seasons 1 and 2 was filmed mainly on RED Dragon cameras.[75][76] Starting with season 3, Panasonic VariCam Pure were incorporated due to their extra low-light sensitivity.[77][78] This allowed the crew to shoot extra wide exterior shots at night as well as during the day, and to shoot on sets in near total darkness, such as nighttime in Chuck's unelectrified house.[79] For scenes requiring to film from cramped spaces, Panasonic Lumix GH4 point-and-shoot camera was used.[80] In season 4, three RED and two VariCam Pure cameras were used.[77] For seasons 5 and 6, mostly Arri ALEXA LF was used.[81][82][83]\n\nEpisode title sequences [ edit ]\n\nEach episode's title sequence features a different low-quality image that recalls Saul Goodman's days on Breaking Bad. This includes the inflatable Statue of Liberty balloon that sat atop Saul's office, a drawer of burner phones kept in his desk, and a bus stop bench that advertised his business. Gould and Gilligan were inspired by the poor quality of early VHS tapes and the notoriously low production values of 1980s public-access television, and from the fact that Saul Goodman's ads on Breaking Bad were done in a similar style. They intended for the title sequences to appear \"purposefully shitty\" in order to stand out from those of its contemporaries, which generally had increased visual quality and production standards. Some of the title sequences were put together from unused footage from Breaking Bad, but others were filmed specifically to create new ones. The title sequences were put together by assistant editor Curtis Thurber, and scored by Little Barrie guitarist Barrie Cadogan.[84][85] When Cadogan was putting the music together, he was told the producers wanted a piece of music that would be cut abruptly at 15 seconds.[85]\n\nAs every season except for the last has ten episodes each, the title credits for every season's corresponding episode number would reuse the same image. However, beginning with the second season, each of the episode's title sequences would continue to decline in picture quality by intermittently flashing black and white, and continue to lose color with each passing season. This caused many to theorize that this symbolized Jimmy McGill's storyline gradually transitioning to that of his post-Breaking Bad alter-ego Gene Takavic, whose scenes were entirely in black and white.[86][87]\n\nWith the final season featuring thirteen episodes instead of the usual ten, the title sequences would take a new format. During \"Nippy\", the title sequence features Saul Goodman's \"World's Greatest Lawyer\" mug falling off his desk and shattering on the floor, as was typical during a season's tenth episode. However, the title image and music prematurely stops and is replaced by a blue screen, recreating the effects of a home video recording on a VCR, and then displayed the show's title and creator credits. This is also the first episode to take place entirely after the events of Breaking Bad.[88] The remaining three title sequences retain the blue background, but briefly flash to an image previously unseen in the intro, with a distorted version of the theme song playing underneath. They then revert to the blue background again and display the title and creator credits. Before the show resumes, they again briefly flash to another new image that will be seen later on in the episodes.[50]\n\nEpisodes [ edit ]\n\nSeries overview for Better Call Saul Season Episodes Originally aired First aired Last aired 1 10 February 8, 2015 ( ) April 6, 2015 ( 2015-04-06 ) 2 10 February 15, 2016 ( ) April 18, 2016 ( 2016-04-18 ) 3 10 April 10, 2017 ( ) June 19, 2017 ( 2017-06-19 ) 4 10 August 6, 2018 ( ) October 8, 2018 ( 2018-10-08 ) 5 10 February 23, 2020 ( ) April 20, 2020 ( 2020-04-20 ) 6 13 7 April 18, 2022 ( ) May 23, 2022 ( 2022-05-23 ) 6 July 11, 2022 ( ) August 15, 2022 ( 2022-08-15 )\n\nSeason 1 (2015) [ edit ]\n\nThe first teaser trailer debuted on AMC on August 10, 2014, and confirmed its premiere date of February 2015.[89] In November 2014, AMC announced the series would have a two-night premiere; the first episode aired on Sunday, February 8, 2015, at 10:00 pm (ET), and then moved into its regular time slot the following night, airing Mondays at 10:00 pm.[90] It was released on Blu-ray and DVD in region 1 on November 10, 2015; bonus features include audio commentaries for every episode, uncensored episodes, deleted scenes, gag reel, and several behind-the-scenes featurettes. A limited edition Blu-ray set was also released with 3D packaging and a postcard vinyl of the Better Call Saul theme song by Junior Brown.[91]\n\nFollowing events of Breaking Bad in 2010, Saul Goodman has fled Albuquerque and hides in Nebraska under the name Gene Takavic. He now manages a Cinnabon and reminisces to himself about his time in Albuquerque.\n\nIn 2002, years before Breaking Bad, Saul goes by his original name of Jimmy McGill, encountering psychotic drug lord Tuco Salamanca and his lieutenant Nacho. Afterward, he schemes to represent Craig Kettleman, who is accused of embezzlement. Jimmy cares for his brother Chuck, who is housebound with electromagnetic hypersensitivity. While pursuing elder law cases, Jimmy discovers several seniors being defrauded by the Sandpiper retirement community.\n\nAs the subsequent class action lawsuit against Sandpiper grows, his brother suggests giving it to Chuck's law firm, Hamlin, Hamlin & McGill. Jimmy receives a small of counsel fee and a share of any future settlement, but is blocked from participation. Jimmy learns Chuck had sabotaged his legal career out of resentment. HHM brings in another firm, Davis & Main, to assist with the case. After the death of an old friend, Jimmy finds success when D&M offers to hire him because of his knowledge of the Sandpiper case.\n\nSeason 2 (2016) [ edit ]\n\nIn June 2014, prior to the series' launch, AMC had renewed the series for a second season of 13 episodes to premiere in early 2016;[20] however, it was later reduced to 10 episodes.[92] It premiered on February 15, 2016, and released on Blu-ray and DVD in region 1 on November 15, 2016; bonus features include audio commentaries for every episode and several behind-the-scenes featurettes.[93][94]\n\nIn 2010, Gene accidentally locks himself in the dumpster room when closing out the Omaha Cinnabon for the night. Instead of alerting the police by using the emergency exit, he spends the night waiting for a janitor to open the door.\n\nIn 2002, Jimmy works as an associate at D&M, but quits after his ostentatious legal style doesn't mesh with the firm's corporate demeanor. Kim is demoted by Chuck's partner, Howard Hamlin, because of Jimmy's actions. She secures banking firm Mesa Verde as an HHM client, and Howard is happy to have the business but denies her credit. Kim quits HHM and opens a shared private practice with Jimmy. Jimmy sabotages Chuck's work for Mesa Verde, which drops HHM and hires Kim, but Chuck discovers this and tricks Jimmy into confessing. Nacho hires Mike Ehrmantraut to remove Tuco, but Mike instead arranges his imprisonment. Cartel elder and uncle of Tuco, Hector Salamanca, confronts Mike. Mike attempts to assassinate Hector, but is mysteriously interrupted.\n\nSeason 3 (2017) [ edit ]\n\nIn March 2016, AMC announced that Better Call Saul was renewed for a 10-episode third season which premiered April 10, 2017.[95][96] It was released on Blu-ray and DVD in region 1 on January 16, 2018; bonus features include audio commentaries for every episode and several behind-the-scenes featurettes.[97]\n\nIn 2010, Gene points mall security guards towards a shoplifter during his lunch break. After returning to work, a stressed Gene suddenly collapses.\n\nIn 2003, Jimmy's law license is suspended and Chuck's hypersensitivity condition is revealed to be psychosomatic during the disciplinary hearing. After Jimmy covertly sabotages Chuck's insurance, Howard urges him to retire, but Chuck sues HHM in spite. Howard buys him out of the firm, leading Chuck to commit suicide.\n\nGus prevents Hector's assassination, and Mike attacks Hector's trucks to steal $250,000 on Gus's orders. To help launder the money, Gus arranges for Mike's hire as a contracted security consultant at Madrigal. Hector plans to take over the business of Nacho's father, so his son attempts to kill Hector by sabotaging his angina medication. With the cartel's preference in Gus's drug distribution over Hector's, he suffers a stroke during a confrontation, rendering him comatose.\n\nSeason 4 (2018) [ edit ]\n\nFollowing the third season's end in June 2017, AMC renewed the series for a 10-episode fourth season which premiered on August 6, 2018.[98][99] It was released on Blu-ray and DVD in region 1 on May 7, 2019; bonus features include audio commentary for every episode and several behind-the-scenes featurettes.[100]\n\nIn 2010, Gene is raced to the hospital after his collapse; he is later discharged after doctors confirm he did not suffer a heart attack. Gene becomes uneasy when a taxi driver with an Albuquerque Isotopes air freshener seems to recognize him.\n\nIn 2003, Jimmy regains his outgoing demeanor after Howard shoulder blames for Chuck's death. Jimmy manages a cell phone store during the suspension of his law license but makes more reselling prepaid phones to low-level criminals. A year later, his law license reinstatement is denied over lack of remorse for Chuck. After faking mourning, he successfully appeals and practices as the \"Saul Goodman\" trade name.\n\nGus learns Nacho attempted to kill Hector and blackmails him into undermining the Salamancas. Mike escorts engineers who evaluate Gus's industrial laundry site as a potential underground meth lab. Gus hires Werner Ziegler to oversee construction, but Mike is ordered to kill Werner when he tries to escape. Hector recovers from his stroke, but is mute and can only move his right index finger. His nephew, Lalo Salamanca, arrives to run Hector's business, learning of the construction project.\n\nSeason 5 (2020) [ edit ]\n\nThe series was renewed for a fifth season on July 28, 2018, just prior to the airing of the fourth season.[101] The fifth season was not expected to air until 2020; according to AMC's Sarah Barnett, the delay was \"driven by talent needs\".[102] The 10-episode fifth season would start airing with a special Sunday broadcast on February 23, 2020, with following episodes to air on Mondays.[103] It was released on Blu-ray and DVD in region 1 on November 24, 2020; bonus features include cast and crew audio commentaries on every episode, deleted scenes, and various behind-the-scenes featurettes.[104]\n\nIn 2010, during another lunch break, Gene is approached by the taxi driver, Jeff, and his friend Buddy. Jeff reveals he recognized Gene as Saul Goodman from when he previously lived in Albuquerque. Gene admits he is living with a secret identity.\n\nIn 2004, Jimmy's law practice as Saul Goodman draws him into Albuquerque's drug trade and he is conflicted when Howard offers him a position at HHM. Kim balances her Mesa Verde and pro bono work with her own feelings for Jimmy, and finds herself employing similar conman-style tactics. Jimmy and Kim later devise a plan to ruin Howard to settle the Sandpiper case.\n\nLalo's presence in Albuquerque forces Gus to suspend construction of his meth lab. Nacho and Mike become pawns in the ongoing feud between the Salamancas and Gus. After Lalo is arrested for murder, he hires Jimmy to represent him and arrange bail, which almost kills Jimmy. After an unsuccessful attempt on Lalo's life by Gus's hired assassins after his release, Lalo deduces that Nacho has betrayed him.\n\nSeason 6 (2022) [ edit ]\n\nIn January 2020, AMC renewed the series for a sixth season, with a scheduled premiere in 2021.[105] Showrunner Peter Gould confirmed it would be the show's final season and consist of 13 episodes rather than the usual 10.[106] Production experienced long delays due to COVID-19 and star Bob Odenkirk needing several weeks to fully recover from a heart attack he experienced on set.[107][108] The sixth and final season was split into two halves; the first half premiered on April 18, 2022, while the last half premiered on July 11, 2022.[109] The whole season will be released on Blu-ray and DVD in region 1 on December 6, 2022; bonus features include cast and crew audio commentaries on every episode, deleted scenes, outtakes, and various behind-the-scenes featurettes.[110]\n\nIn 2004, Nacho attempts to flee from the Salamancas after the attempt on Lalo's life, but after Gus falsely implicates him, Nacho sacrifices himself in exchange for his father's safety. Jimmy and Kim smear Howard's reputation, thereby forcing a settlement of the Sandpiper case. Howard confronts them, but is murdered by Lalo. After forcing Kim to act as a diversion, Lalo ambushes Gus to access the meth lab under construction. Gus kills Lalo with a hidden gun. Mike makes Howard's death appear as a suicide, and oversees the burial of Howard and Lalo beneath the lab. A traumatized Kim quits the law and divorces Jimmy. Several years later, Jimmy has fully transformed into Saul Goodman.\n\nIn 2010, Gene approaches Jeff and Buddy with an offer to rob a department store. After reaching out to Kim, who now lives in Florida, Gene devises a scheme to obtain financial identification of several rich single men at bars he can sell for profit. When the scheme goes wrong, Buddy quits the operation, Jeff is arrested, and Gene is eventually caught. He is extradited to Albuquerque for the trial and feigns testimony implicating Kim so she can be summoned to court. He confesses to Kim and those at the trial about his crimes during the events of Breaking Bad and Better Call Saul, getting an 86-year sentence. Jimmy is recognized as Saul in prison and gains popularity with the inmates. Kim visits him and they share a cigarette before parting again.\n\nBroadcast [ edit ]\n\nBetter Call Saul airs on cable network AMC. The series premiere drew in 4.4 million and 4 million in the 18–49 and 25–54 demographics, respectively, and received an overall viewership of 6.9 million.[111] This was the record for the highest-rated scripted series premiere in basic cable history, until it was surpassed later the same year by another AMC series, Fear the Walking Dead.[112]\n\nIn December 2013, Netflix announced that the entire first season would be available for streaming in the U.S. after the airing of the first-season finale, and in Latin America and Europe each episode would be available a few days after the episode airs in the U.S.[113] However, the first season was not released on Netflix in the U.S. until February 1, 2016.[114][115] Internationally, episodes of the second season became available the day after they aired in the U.S.[116]\n\nNetflix is the exclusive video-on-demand provider for the series and makes the content available in all its territories, except for Australia and New Zealand.[113] In Australia, Better Call Saul premiered on the streaming service Stan[117] on February 9, 2015, acting as the service's flagship program.[118] In New Zealand, the show was exclusive to the video-on-demand service Lightbox before moving to Neon in 2020 when both services were merged.[119][120] The episodes were available for viewing within three days of broadcast in the U.S.[121]\n\nIn the United Kingdom and Ireland, the series was acquired by Netflix on December 16, 2013,[122] and the first episode premiered on February 9, 2015, with the second episode released the following day. Every subsequent episode was released each week thereafter.[123] In India, the series was broadcast on Colors Infinity within 24 hours of the U.S. broadcast.[124]\n\nDuring the final season's run in 2022, each episode would be available to stream the day they premiered on AMC+, AMC's streaming service which first launched in June 2020.[125][126] The season premiere resulted in the biggest day of new subscriber sign-ups for AMC+, and by the mid-season finale episodic viewership on the streaming service rose by 61%.[125][127] During the release of the series finale on AMC+, the app experienced an outage, causing many users to be logged out.[128] AMC later reported that first-day viewing numbers for the finale on AMC+ was four times as big as the season premiere, and called the series' final season the highest acquisition driver in the history of the streaming service.[129]\n\nReception [ edit ]\n\nCritical response [ edit ]\n\nBetter Call Saul has received critical acclaim and is considered to be an outstanding example of how to successfully produce a prequel and spinoff work that defies expectations.[142] Many critics have called Better Call Saul a worthy successor to Breaking Bad and some have even deemed it superior to its predecessor. In September 2019, The Guardian ranked the show at No. 48 on its list of the 100 best TV shows of the 21st century, describing it as \"A supremely measured character piece that has steadily improved as its central tragedy has materialised.\"[143] In 2021, Empire ranked Better Call Saul at No. 27 on their list of The 100 Greatest TV Shows of All Time.[144] Also in 2021, it was voted the 23rd-best TV series of the 21st century by the BBC, as picked by 206 TV experts from around the world.[145] In September of 2022, Rolling Stone listed Better Call Saul as the 32nd greatest TV show of all time, in its updated list from 2016.[146]\n\nThe first season has a 97% approval rating on the review aggregator website Rotten Tomatoes, with an average rating of 8.1/10 based on 291 reviews. The website's critical consensus reads, \"Better Call Saul is a quirky, dark character study that manages to stand on its own without being overshadowed by the series that spawned it.\"[130] Metacritic, which uses a weighted average, assigned a \"generally favorable\" score of 78 based on 43 reviews.[131]\n\nThe second season has a 97% approval rating on Rotten Tomatoes, with an average score of 8.7/10 based on 182 reviews. The website's critical consensus reads, \"Better Call Saul continues to tighten its hold on viewers with a batch of episodes that inject a surge of dramatic energy while showcasing the charms of its talented lead.\"[132] On Metacritic, it has a score of 85 out of 100, based on 18 critics, indicating \"universal acclaim\".[133]\n\nThe third season has a 98% approval rating on Rotten Tomatoes, with an average score of 8.75/10 based on 175 reviews. The website's critical consensus is, \"Better Call Saul shows no signs of slipping in season 3, as the introduction of more familiar faces causes the inevitable transformation of its lead to pick up exciting speed.\"[134] On Metacritic, it has a score of 87 out of 100, based on 18 critics, indicating \"universal acclaim\".[135]\n\nThe fourth season has a 99% approval rating on Rotten Tomatoes, with an average score of 8.9/10 based on 185 reviews. The website's critical consensus states, \"Well-crafted and compelling as ever, Better Call Saul deftly balances the show it was and the one it will inevitably become.\"[136] On Metacritic, it has a score of 87 out of 100, based on 16 reviews, indicating \"universal acclaim\".[137]\n\nThe fifth season has a 99% approval rating on Rotten Tomatoes, with an average score of 8.9/10 based on 184 reviews. The website's critical consensus is, \"Grounded by Bob Odenkirk's endlessly nuanced, lived-in performance, Better Call Saul's fifth season is a darkly funny, vividly realized master class in tragedy.\"[138] On Metacritic, it has a score of 92 out of 100 based on 16 critics, indicating \"universal acclaim\".[139]\n\nThe sixth season has a 99% approval rating on Rotten Tomatoes, with an average score of 9.4/10 based on 174 reviews. The website's critical consensus is, \"Better Call Saul remains as masterfully in control as Jimmy McGill keeps insisting he is in this final season, where years of simmering storytelling come to a scintillating boil.\"[140] On Metacritic, it has a score of 94 out of 100 based on 20 critics, indicating \"universal acclaim\".[141]\n\nRatings [ edit ]\n\nViewership and ratings per season of Better Call Saul Season Timeslot (ET) Episodes First aired Last aired Avg. viewers\n\n(millions) Date Viewers\n\n(millions) Date Viewers\n\n(millions) 1 Sunday 10:00 pm (premiere)\n\nMonday 10:00 pm 10 February 8, 2015 6.88[147] April 6, 2015 2.53[148] 3.21[149] 2 Monday 10:00 pm 10 February 15, 2016 2.57[150] April 18, 2016 2.26[151] 2.16[152] 3 10 April 10, 2017 1.81[153] June 19, 2017 1.85[154] 1.64[155] 4 Monday 9:00 pm 10 August 6, 2018 1.77[156] October 8, 2018 1.53[157] 1.49[158] 5 Sunday 10:00 pm (premiere)\n\nMonday 9:00 pm 10 February 23, 2020 1.60[159] April 20, 2020 1.59[160] 1.37[161] 6A Monday 9:00 pm 7 April 18, 2022 1.42[162] May 23, 2022 1.19[163] 1.27[164] 6B 6 July 11, 2022 1.16[165] August 15, 2022 1.80[166]\n\nAccolades [ edit ]\n\nBetter Call Saul has received 46 Emmy Award nominations. It has received six nominations for Outstanding Drama Series. Bob Odenkirk has received five nominations for Outstanding Lead Actor in a Drama Series. Jonathan Banks and Giancarlo Esposito have each been nominated for Outstanding Supporting Actor in a Drama Series; four times for Banks and twice for Esposito. Rhea Seehorn has received a nomination for Outstanding Supporting Actress in a Drama Series. The series has also received six nominations for Outstanding Writing for a Drama Series and one nomination for Outstanding Directing for a Drama Series.[167]\n\nFranchise [ edit ]\n\nBetter Call Saul has its own set of official multimedia spin-offs and related media within the Breaking Bad franchise. This includes a talk show, several web series and digital shorts, comic books, and an insider podcast.[168][169][170][171]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Rhea_Seehorn_by_Gage_Skidmore.jpg/150px-Rhea_Seehorn_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/Michael_McKean_1999.jpg/150px-Michael_McKean_1999.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Vince_Gilligan_by_Gage_Skidmore_3.jpg/144px-Vince_Gilligan_by_Gage_Skidmore_3.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Bob_Odenkirk_by_Gage_Skidmore_2.jpg/150px-Bob_Odenkirk_by_Gage_Skidmore_2.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Patrick_Fabian_by_Gage_Skidmore.jpg/150px-Patrick_Fabian_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Wikivoyage-Logo-v3-icon.svg/27px-Wikivoyage-Logo-v3-icon.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/86/Bob_Odenkirk%2C_Rhea_Seehorn%2C_Patrick_Fabian%2C_Michael_Mando_%26_Giancarlo_Epsosito_%2843602600451%29.jpg/220px-Bob_Odenkirk%2C_Rhea_Seehorn%2C_Patrick_Fabian%2C_Michael_Mando_%26_Giancarlo_Epsosito_%2843602600451%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Giancarlo_Esposito_by_Gage_Skidmore_2.jpg/150px-Giancarlo_Esposito_by_Gage_Skidmore_2.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/13/Old_Bernalillo_County_Courthouse.jpg/208px-Old_Bernalillo_County_Courthouse.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Jonathan_Banks_2012_2.jpg/150px-Jonathan_Banks_2012_2.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/Better_Call_Saul_logo.svg/250px-Better_Call_Saul_logo.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/Better_Call_Saul_logo.svg/1200px-Better_Call_Saul_logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Michael_Mando_by_Gage_Skidmore.jpg/150px-Michael_Mando_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f1/Tony_Dalton_%28cropped%29.jpg/150px-Tony_Dalton_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Peter_Gould_by_Gage_Skidmore.jpg/140px-Peter_Gould_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/07/Cottonwood_Mall_Albuquerque_%28cropped%29.jpg/208px-Cottonwood_Mall_Albuquerque_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/Better_Call_Saul_logo.svg/1200px-Better_Call_Saul_logo.svg.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Better_Call_Saul", "title": "Better Call Saul", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/Better_Call_Saul_logo.svg/640px-Better_Call_Saul_logo.svg.png", "width": 640, "height": 310}, "title": "Better Call Saul - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}