{"url": "https://www.cnn.com/2018/12/06/entertainment/golden-globes-reactions-2019/index.html", "text": "CNN —\n\nHollywood woke up to Golden Globe nominations news on Thursday morning.\n\nThe lucky nominees are celebrating and here’s a sample of their reactions:\n\nNicole Kidman, Best Performance by an Actress in a Motion Picture, Drama for “Destroyer”\n\n“I am so grateful to be nominated for such an untraditional female character. Erin Bell is complicated, raw and dangerous, and it was a privilege to portray her. I share this with Karyn Kusama as well as all of the cast and crew. It was truly a passion project for all of us. A huge thank you to The Hollywood Foreign Press.”\n\nEmily Blunt, Best Actress in a Motion Picture – Musical or Comedy for “Mary Poppins Returns”\n\n“Thank you ever so much to the HFPA! I’m blown away and over the moon. I delighted in playing every aspect of this extraordinary and iconic character. The entire experience working on it was spellbinding and that’s largely to do with the incomparable Rob Marshall who took on this project with great love, depth and courage in his heart. I’m thrilled for Lin and for the recognition for our beautiful score as well as the film as a whole. Thank you again.”\n\nAntonio Banderas, Best Performance by an Actor in a Limited Series or Motion Picture Made for Television for “Genius: Picasso”\n\n“Thanks to the members of the Hollywood Foreign Press for this recognition that I share with the phenomenal team of great professionals that National Geographic put together to create this complicated, controversial and amazing ‘Genius.’ I would love also to mention my home town of Málaga, birth place of Picasso too, for its continual effort to become a referential city of culture.”\n\nJohn David Washington, Nominee, Best Performance by an Actor in a Motion Picture – Drama for “BlacKkKlansman”\n\n“Thank you, Hollywood Foreign Press Association, for this incredible honor and for your support of ‘BlacKkKlansman.’ My deepest appreciation to the legendary Spike Lee – we stand on your shoulders, sir. Thank you to the most talented group of actors and the crew, and to Focus Features for their unwavering support. Most importantly – Ron Stallworth, you’re a hero. Thank you for allowing me to tell your story on screen. This is a surreal moment, wow. Thank you.”\n\nMichael Douglas, Best Performance by an Actor in a Television Series – Musical or Comedy for “The Kominsky Method”\n\n“It is such an honor to be nominated as a comedy actor for ‘The Kominsky Method.’”\n\nConstance Wu, Best Performance by an Actress in a Motion Picture – Musical or Comedy for “Crazy Rich Asians”\n\n“What a morning to have had my phone on Do Not Disturb Mode till now… I’m ecstatic but also in shock! Thank you @goldenglobes !!!”\n\nGlenn Close, Best Performance by an Actress in a Motion Picture – Drama for “The Wife”\n\n“I’m beyond thrilled and especially thankful for Meg Wolitzer who wrote the novel and Jane Anderson who wrote the screenplay fifteen years ago, and for Rosalie Swedlin and Claudia Bluemhuber who had the crazy passion to bring it to the screen. I share this with the brilliant Jonathan Pryce, who was the only one to received a Nobel Prize for literature this year, even if it was just in a movie…. and most of all director Bjorn Runge who made my performance possible.”\n\nSpike Lee, Best Direction – Motion Picture, for “BlacKkKlansman”\n\n“I found out about these Golden Globe Nominations for ‘BLACKkKLANSMAN’ in between advising my NYU Grad School students because I teach on Thursdays. The first word that came to mind was ‘BOOM SHAKALAKA’. Thank you to the HFPA!”\n\nJohn C. Reilly, Best Performance by an Actor in a Motion Picture – Musical or Comedy for “Stan & Ollie”\n\n“I am so honored to receive this nomination from the members of the HFPA. I’m honored on behalf of Sony Classics and our entire film to be included in such an impressive group of actors but most of all, I’m so pleased to see the great Babe himself, Oliver Hardy acknowledged in this way. He’s got a sweet grin on his face this morning wherever he is, just like me. Long live the eternal clowns Laurel and Hardy.”\n\nJed Mercurio, Best Television Series – Drama for “Bodyguard”\n\n“Everyone involved in making ‘Bodyguard’ is immensely flattered by the series being nominated, and congratulations to Richard Madden on being recognized for his incredible performance.”\n\nAdam McKay, Best Director – Motion Picture and Best Screenplay for “Vice”\n\n“I’m so happy for our amazing cast of ‘VICE’ being acknowledged with multiple nominations. Lord knows they deserve it. And the Best Picture nomination is a nod to our entire crew who went way above and beyond to make this film. Thank you to the HFPA and also to Annapurna, Plan B and Gary Sanchez.”\n\nJustin Hurwitz, Best Original Score – Motion Picture for “First Man”\n\nThank you to the Hollywood Foreign Press. Thank you to Damien for making this beautiful film and pushing me to dig deep for the themes and moods of this score. In writing this music and thinking on the subjects of love, loss, loneliness, perseverance, and family, I felt a lot and revealed a lot of myself. I’m grateful to the HFPA for recognizing the work.”\n\nAdam Driver, Best Performance by an Actor in a Supporting Role in a Motion Picture for “BlacKkKlansman”\n\n“I’m very thankful to the HFPA and pretty blown away by all of this. To be at the Golden Globes in January representing ‘BlacKkKlansman’ with Spike and John David means a great deal to me. I’m very proud to be in their company.”\n\nCharlize Theron, Best Performance by an Actress in a Motion Picture – Musical or Comedy for “Tully”\n\n“I honestly didn’t expect this and am completely thrilled. Thank you to the Hollywood Foreign Press for this incredible nomination. I loved playing Marlo, so this is a real honor.”\n\nEmma Stone, Best Actress in a Supporting Role in a Motion Picture for “The Favorite”\n\n“Thank you to the members of the HFPA for this honor! It was an unbelievable joy to get to work alongside my two true loves, Olivia Colman and Rachel Weisz on this film, along with all the other wonderful actors, Tony, Deborah, and our incredible producers. ‘The Favourite’ wouldn’t exist without the visionary that is Yorgos Lanthimos. Thank you especially to Yorgos for your guidance, brilliance, and friendship.”\n\nAmy Adams, Best Performance by an Actress in a Supporting Role in any Motion Picture, for “Vice”\n\n“I am overwhelmed. Thank you so much to the Hollywood Foreign Press Association for the acknowledgments. I am blessed to have been involved in these two amazing productions this year and am grateful to everyone who has contributed for their hard work and dedication.”\n\nBarry Jenkins, Best Motion Picture, Drama and Best Screenplay for “If Beale Street Could Talk”\n\n“On behalf of the entire ‘Beale Street’ family, it’s an honor to have our film recognized by the Hollywood Foreign Press Association, particularly alongside such varied and wonderful work by our peers. It’s a critical time to be telling stories and creating art that reflects the world we live in. We’ll take this recognition as an affirmation to continue to do so.”\n\nMahershala Ali, Best Performance by an Actor in a Supporting Role in any Motion Picture, for “Green Book”\n\n“I’d like to thank the HFPA for this extraordinary honor. I’m humbled that all our work has been recognized in such a broad capacity, especially that of my friends Viggo Mortensen and Peter Farrelly. ‘Green Book’ offered a unique opportunity to embody a man with breadth, virtuosity and complexity. I’m so grateful that our story has resonance in a time that calls for empathy.”\n\nRegina King, Best Performance by an Actress in a Limited Series or a Motion Picture Made for Television for “Seven Seconds”\n\n“I cannot even put into words how I feel right now hearing this exciting news from set. Just elated. So proud of these two amazing and beautiful projects. I’m incredibly lucky and humbled that these roles chose me. For ‘Beale Street,’ honoring the words and legacy of James Baldwin is truly special. Thank you Hollywood Foreign Press!”\n\nThe 76th Annual Golden Globe Awards will be held on January 6, 2019.", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/170620162658-nicole-kidman.jpg?q=x_9,y_112,h_2767,w_4917,c_crop/w_800", "https://media.cnn.com/api/v1/images/stellar/prod/170619101431-sandra-gonzalez.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/180913113039-chloe-melas-headshot.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_100,h_100"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/170620162658-nicole-kidman.jpg?q=x_9,y_112,h_2767,w_4917,c_crop/w_800", "keywords": [], "authors": ["Chloe Melas Sandra Gonzalez", "Chloe Melas", "Sandra Gonzalez"], "canonical_link": "https://www.cnn.com/2018/12/06/entertainment/golden-globes-reactions-2019/index.html", "title": "Nicole Kidman, Emily Blunt and more react to Golden Globe nominations", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Nicole Kidman and more react to Golden Globe nominations | CNN", "description": "Hollywood woke up to Golden Globe nominations news on Thursday morning.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/170620162658-nicole-kidman.jpg?q=x_9,y_112,h_2767,w_4917,c_crop/w_800", "type": "article", "url": "https://www.cnn.com/2018/12/06/entertainment/golden-globes-reactions-2019/index.html", "site_name": "CNN"}, "twitter": {"title": "Nicole Kidman and more react to Golden Globe nominations | CNN", "description": "Hollywood woke up to Golden Globe nominations news on Thursday morning.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/170620162658-nicole-kidman.jpg?q=x_9,y_112,h_2767,w_4917,c_crop/w_800", "card": "summary_large_image", "site": "@CNNent"}, "description": "Hollywood woke up to Golden Globe nominations news on Thursday morning.", "template_type": "article_leaf", "type": "article", "meta-section": "entertainment", "theme": "entertainment", "article": {"published_time": "2018-12-06T17:23:19Z", "modified_time": "2018-12-06T19:51:56Z", "tag": "arts and entertainment, awards and prizes, business and industry sectors, business, economy and trade, celebrity and pop culture, comedians and comedy, entertainment and arts awards, golden globe awards, media industry, movie and video industry, movie awards, movies, television programming, celebrities, emily blunt, nicole kidman", "publisher": "https://www.facebook.com/CNN"}, "keywords": "arts and entertainment, awards and prizes, business and industry sectors, business, economy and trade, celebrity and pop culture, comedians and comedy, entertainment and arts awards, golden globe awards, media industry, movie and video industry, movie awards, movies, television programming, celebrities, emily blunt, nicole kidman", "author": "Chloe Melas,Sandra Gonzalez", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1544054400.0, "source": "https://www.cnn.com", "summary": ""}