{"url": "https://madamenoire.com/1027837/veuve-clicquot-polo-classic/", "text": "1 of 23 ❯ ❮\n\nof 23\n\nEvery year, the Veuve Clicquot Polo Classic takes place in New York City, inviting polo-lovers and all-around fashionistas and fashionistos to watch a polo match and enjoy a day of picknicking in Liberty Sate Park. Thanks to social media, the annual event has become a #Blackmoment, where everywhere comes dressed in their Sunday best. And whether you’re there or not, you’ll spend a lot of time just scramming through the gram, getting your life from these looks. And honestly, the flicks are amazing. There’s a bit of church, a dash of brunch, and a whole lot of Black excellence. Hands down, it’s the best place to catch some dope fashion looks while sitting out on the lawn, sipping on your champagne. And I love any event that turns into a Black family reunion! If you need some fashion inspo for the summer, just look at these fire fits spotted this weekend at the Veuve Clicquot Polo Classic sponsored by Hublot.\n\nhttps://www.instagram.com/p/Bjih2KJg1-KjNmZLmKLcfiQetNBeieZ4HXLXHQ0/ This stylista gave us a case for all pink this summer in this fabulous pantsuit, paired with sneakers to keep it calm and casual-yet-glam on the lawn. Oh, and these cheetah sunglasses? Fierce!\n\nhttps://www.instagram.com/p/BjinwvKBf12/?tagged=vcpoloclassic This stylista gave us floral-themed goodness for the day, pairing a beautiful purple floral dress with some pink flowers.\n\nhttps://www.instagram.com/p/BjlAihhAmbP/?tagged=vcpoloclassic This fashion-savvy duo popped out in frills and a two-piece set (which is also by the poppin’ Black designer, Fenoel.) Which is your favorite look? I can’t choose!\n\nView this post on Instagram Drink Good, Live Well™️ . . . #VCPoloClassic #CliquotStyle #RoséGarden #DrinkGoodLiveWell A post shared by Maxine Lee (@livegoodwithmax) on Jun 3, 2018 at 7:26am PDT I LOVE PINK. This hot pink number has a low plunging neckline and a thigh slit, perfect for a summer night out with your friends or even date night with your boo. This dress is a lewwwwk.\n\nView this post on Instagram #VeuveClicquotPoloClassic 🍾 A post shared by The Non-Influencer (@jaidus) on Jun 2, 2018 at 4:46pm PDT This green pantsuit looked so chic and dapper on this fashionisto, who gave us color for the summer and spring. I never thought I’d like a green pantsuit as much as this, but I am diggin’ this vibe.\n\nView this post on Instagram 🏇🏾🥂 A post shared by ♔Jamaican Canadian♔ (@winnieharlow) on Jun 2, 2018 at 3:52pm PDT Oh, and don’t get it twisted: Celebs come out to the function as well! The beautiful Winnie Harlow was spotted in New York, sporting off those long legs in this dope fit. Winnie never disappoints!\n\nhttps://www.instagram.com/p/BjlCwuCH0FK/ This boss babe wore this beautiful pastel, off-the-shoulder flowy dress, decked out with some nude heels and a matching nude purse.\n\nhttps://www.instagram.com/p/BjlMAJgHb_h/ Even the men came out in their full fits for the polo event! This all-white fit is absolutely dapper, and paired with an orange linen blazer? Yes, Black king. YAAASS.\n\nView this post on Instagram Today was a beautiful day at the polo! 🐎🏑🏆 A post shared by faroukjames (@faroukjames) on Jun 3, 2018 at 10:11am PDT Even the kids came to slay! Farouk James came in this dapper polo fit, and with all that flowy hair? This is a model pose. Put it on a cover!\n\nView this post on Instagram 2018 Veuve Clicquot Polo Classic 🍾 #veuveclicquot #veuveclicquotpoloclassic #blackexcellence #style #fashion A post shared by 🗣 Speak Life (@forever_mistah) on Jun 2, 2018 at 9:05pm PDT These men look so chic in their fits. This all-white LV-esque fit is fire, but also this two-piece set is giving me everything for that beautiful, green lawn. Also everyone had one of these fab yellow umbrellas, and now I’m wondering where I can get one.\n\nView this post on Instagram Champagne & Polo #veuveclicquotpoloclassic #vcpoloclassic A post shared by The Artisan Unique (@amorunique__) on Jun 3, 2018 at 7:45am PDT This look is honestly something so unexpected to me, and that’s why I love it! Who says you can’t pair metallics with non-metallics, or that something with a bit of gold can’t go with silver? Fashion is whatever you want it to be, shine girl!\n\nView this post on Instagram A lovely day to visit the grounds. #VCpoloclassic #goodvibes #summertime A post shared by Brie (@briepyt) on Jun 3, 2018 at 6:51am PDT How mesmerizing is this African-print sundress? Not only is it a super simple fit that can easily be dressed up and down, but it’s just…such an understated statement-maker. This Queen brought it home!\n\nView this post on Instagram Bubble gum 🍭 🍬 #vcpoloclassic #fashion A post shared by J'Lysa (@jlysa_monet) on Jun 2, 2018 at 6:13pm PDT I promise, no more pink suits, but I told y’all it’s a vibe! This longline linen pantsuit is a look that you can wear with the blazer, or you can pair the blazer with some nude heels and wear it as a dress (or maybe some pants underneath.) Love everything about the pink suits coming out to play!\n\nView this post on Instagram Brown Sugar Champagne Mamí x Clicquot Rosé ✨🍾💕 #VCPoloClassic #VeuveClicquotPoloClassic A post shared by Brittany 👑 (@britshaniece) on Jun 2, 2018 at 5:55pm PDT Last but certainly not least, this curvy stylista gave the gram BODY in this super cute yellow two-piece frilly set. Just goes to show that you can rock whatever you want, because nobody can tell me she doesn’t look bomb!", "images": ["https://madamenoire.com/wp-content/uploads/sites/9/2018/06/veuve-clicquot-polo-classic.jpg?strip=all&quality=80", "https://sb.scorecardresearch.com/p?c1=2&c2=6035391&cv=3.6.0&cj=1", "https://madamenoire.com/wp-content/themes/bossip4/images/madamenoire_logo_white.svg", "https://www.facebook.com/tr?id=187138648481959&ev=PageView&noscript=1", "https://madamenoire.com/wp-content/themes/bossip4/images/madamenoire_logo.svg", "https://madamenoire.com/wp-content/uploads/sites/9/2018/06/veuve-clicquot-polo-classic.jpg?w=560&h=320&crop=1&strip=all&quality=80"], "top_img": "https://madamenoire.com/wp-content/uploads/sites/9/2018/06/veuve-clicquot-polo-classic.jpg?w=560&h=320&crop=1&strip=all&quality=80", "keywords": [], "authors": [], "canonical_link": "https://madamenoire.com/1027837/veuve-clicquot-polo-classic/", "title": "22 Of The Flyest Fits We Saw At The 2018 Veuve Clicquot Polo Classic", "meta_data": {"fb": {"admins": 100006356380901, "pages": 123136324375898}, "google-site-verification": "89cYy4uYOnrle-D3H3SPnHJySu32IytBEKjsv1_skZo", "y_key": "637ec967f3cf29ad", "viewport": "width=device-width, initial-scale=1.0", "article-type": "slideshow", "robots": "max-image-preview:large", "description": "It's a bit of church, a dash of brunch, and a whole lot of Black excellence when it comes to the fashion at the Veuve Clicquot Polo Classic.", "twitter": {"card": "summary_large_image", "title": "22 Fly Outfits Spotted At The Veuve Clicquot Polo Classic", "description": "It's a bit of church, a dash of brunch, and a whole lot of Black excellence when it comes to the fashion at the Veuve Clicquot Polo Classic.", "image": "https://madamenoire.com/wp-content/uploads/sites/9/2018/06/veuve-clicquot-polo-classic.jpg?strip=all&quality=80", "creator": "@MadameNoire", "site": "@MadameNoire", "label1": "Written by", "data1": "TheBlondeMisfit", "label2": "Est. reading time", "data2": "6 minutes"}, "generator": "WordPress 6.0.2", "wp-parsely_version": "1.13.0", "sailthru.date": "2018-06-04 15:54:49", "sailthru.title": "22 Of The Flyest Fits We Saw At The 2018 Veuve Clicquot Polo Classic", "sailthru.tags": ",Fashion,Fashionable Looks,Roundup,VC Polo Classic,Fashion", "sailthru.author": "TheBlondeMisfit", "sailthru.description": "There's a bit of church, a dash of brunch, and a whole lot of Black excellence.", "sailthru.image.full": "https://madamenoire.com/wp-content/uploads/sites/9/2018/06/veuve-clicquot-polo-classic.jpg?strip=all&quality=80", "sailthru.image.thumb": "https://madamenoire.com/wp-content/uploads/sites/9/2018/06/veuve-clicquot-polo-classic.jpg?w=50&strip=all&quality=80", "ia": {"markup_url": "https://madamenoire.com/1027837/veuve-clicquot-polo-classic/?ia_markup=1"}, "og": {"type": "article", "title": "22 Of The Flyest Fits We Saw At The 2018 Veuve Clicquot Polo Classic", "url": "https://madamenoire.com/1027837/veuve-clicquot-polo-classic/", "description": "There’s a bit of church, a dash of brunch, and a whole lot of Black excellence.", "site_name": "MadameNoire", "image": {"identifier": "https://madamenoire.com/wp-content/uploads/sites/9/2018/06/veuve-clicquot-polo-classic.jpg?w=560&h=320&crop=1&strip=all&quality=80", "width": 560, "height": 320}, "locale": "en_US"}, "article": {"published_time": "2018-06-04T19:54:49+00:00", "modified_time": "2018-06-07T17:09:27+00:00"}, "msapplication-TileImage": "https://madamenoire.com/wp-content/uploads/sites/9/2017/10/cropped-tab-logo.jpg?w=270&strip=all&quality=80"}, "movies": [], "publish_date": 1528142089.0, "source": "https://madamenoire.com", "summary": ""}