{"url": "https://www.lansingstatejournal.com/story/news/local/2018/04/17/jordyn-wieber-larry-nassar-lawsuit-michigan-state-usa-gymnastics/525730002/", "text": "Jordyn Wieber sues Michigan State University, USA Gymnastics over Larry Nassar's sexual abuse\n\nShow Caption Hide Caption Gold medal winner Jordyn Wieber speaks about sexual assault legislation Gold medal winner Jordyn Wieber speaks about sexual assault legislation during a press conference on Monday, Feb. 26, 2018, at the Michigan state Capitol in Lansing.\n\nLansing area native and Olympic gold medal gymnast Jordyn Wieber has filed a lawsuit against Michigan State University, USA Gymnastics, the U.S. Olympic Committee and others over sexual abuse by Larry Nassar.\n\nFiled today in a California state court, the lawsuit means Wieber joins the more than 260 people suing the MSU, USAG and others for failing to prevent Nassar's abuse of women and girls.\n\nThe lawsuit alleges that USAG \"made a corporate decision to purge or otherwise destroy all medical records of victims of Nassar, including those medical records of Jordyn Wieber, in order to further conceal the sexual abuse of Nassar.\"\n\nMore: Full coverage: Larry Nassar\n\nIn a statement, Wieber said the lack of accountability from MSU and USAG has made her and other victims feel \"shameful, confused, and disappointed.\"\n\n“My teammates and I were subjected Larry Nassar every single month at the national team training center in Texas,\" she said. \"He was the only male allowed to be present in the athlete dorm rooms to do whatever he wanted. He was allowed to treat us in hotel rooms alone and without any supervision.\n\n\"Nobody was protecting us from being taken advantage of. Nobody was even concerned whether or not we were being sexually abused. I was not protected. My teammates were not protected. My parents trusted USA Gymnastics and Larry Nassar to take care of me and we were betrayed by both.\"\n\nA spokeswoman for USA Gymnastics said the organization would not comment on the complaints made in Wieber's lawsuit, but released a statement that said, in part:\n\n“USA Gymnastics recognizes the courage displayed by Jordyn Wieber and others who have shared their experiences with abuse. We are very sorry that any athlete has been hurt by the horrific actions of Larry Nassar. USA Gymnastics first became aware of athlete concerns regarding Nassar in June 2015, which led USA Gymnastics to report Nassar to the FBI and dismiss him from further involvement with the organization. USA Gymnastics is committed to creating a culture that empowers and supports our athletes and focuses on our highest priority, which is the safety and well-being of our athletes. We hope everything we do going forward makes this very clear.\"\n\nMSU spokeswoman Emily Guerrant said in a statement that the university is committed to coming to a resolution for the survivors.\n\n\"We are deeply sorry for abuse the survivors suffered at the hands of Larry Nassar and are working to make sure that something like this can never happen again,\" she said. \"Improvements to our reporting practices, sexual assault investigations and employee training procedures are all underway. In addition, we’re working to add more counseling and therapist staff positions and to reduce the response times for complaints.\"\n\nMany of those suing MSU, including Wieber, have harshly criticized the university's response to Nassar and their lawsuits.\n\nMore: Timeline: Michigan State and its handling of sexual assault cases\n\nWieber first publicly spoke of Nassar's abuse during his Ingham County sentencing hearing where she made a statement on the third day. Fellow Olympian Aly Raisman accompanied her to court and also spoke.\n\nWieber gave a speech at MSU in March and criticized MSU interim President John Engler, calling on him to begin working with the women and girls Nassar abused. She also spoke about process she went through that eventually led her to the decision to publicly say that Nassar abused her.\n\nNassar, 54, formerly of Holt, is serving a 60 year sentence on federal child pornography charges in Tucson, Arizona. He will face an 40 additional years in Michigan prison for 10 sexual assault convictions once his federal sentence is complete.\n\nSince September 2016, following an Indianapolis Star story, hundreds of women and girls have publicly said Nassar abused them, some saying it happened decades ago and many saying it happened at MSU.\n\nNassar, an osteopathic physician who practiced sports medicine, worked at MSU and with USAG for two decades.\n\nWieber's lawsuit, one of several filed in California, says that based on Nassar's MSU contract, which stipulated that a portion of his time be devoted to public outreach such as his work with USAG, the university can be held liable for his actions.\n\nThe lawsuit and the others that have been filed also claim that MSU, USAG and others didn't do enough to protect the women and girls who were treated by Nassar.\n\nMSU fired Nassar in September 2016. The state of Michigan permanently revoked his medical license earlier this year.\n\nCheck back for updates.\n\nContact Matt Mencarini at (517) 267-1347 or mmencarini@lsj.com. Follow him on Twitter @MattMencarini.", "images": ["https://www.gannett-cdn.com/-mm-/4902f10711f0e9461012c2ffce2e2bf25e829ff1/c=0-92-1997-1220/local/-/media/2018/03/22/MIGroup/Lansing/636573456550124047-180322-wieber-044a.JPG?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://media.gannett-cdn.com/41075352001/41075352001_5740949733001_5740938064001-vs.jpg?pubId=41075352001", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/4902f10711f0e9461012c2ffce2e2bf25e829ff1/c=0-92-1997-1220/local/-/media/2018/03/22/MIGroup/Lansing/636573456550124047-180322-wieber-044a.JPG?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Matt Mencarini"], "canonical_link": "https://www.lansingstatejournal.com/story/news/local/2018/04/17/jordyn-wieber-larry-nassar-lawsuit-michigan-state-usa-gymnastics/525730002/", "title": "Jordyn Wieber sues Michigan State University, USA Gymnastics over Larry Nassar's sexual abuse", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=515305181, app-argument=https://www.lansingstatejournal.com/story/news/local/2018/04/17/jordyn-wieber-larry-nassar-lawsuit-michigan-state-usa-gymnastics/525730002/news/local", "theme-color": "#ffffff", "og": {"title": "Jordyn Wieber sues Michigan State University, USA Gymnastics over Larry Nassar's sexual abuse", "description": "Lansing area native and Olympic gymnast Jordyn Wieber has joined more than 260 people suing Michigan State and USAG over sexual abuse by Larry Nassar.", "site_name": "Lansing State Journal", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/4902f10711f0e9461012c2ffce2e2bf25e829ff1/c=0-92-1997-1220/local/-/media/2018/03/22/MIGroup/Lansing/636573456550124047-180322-wieber-044a.JPG?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "description": "Lansing area native and Olympic gymnast Jordyn Wieber has joined more than 260 people suing Michigan State and USAG over sexual abuse by Larry Nassar.", "twitter": {"site": "@LSJnews", "creator": "@LSJnews", "card": "summary_large_image"}}, "movies": [], "publish_date": 1523919600.0, "source": "https://www.lansingstatejournal.com", "summary": ""}