{"url": "https://www.cnn.com/2018/02/20/opinions/protect-mother-pregnancy-williams-opinion/index.html", "text": "Editor’s Note: Serena Williams is a professional tennis player, businesswoman and UNICEF goodwill ambassador. The views expressed in this commentary are her own.\n\nCNN —\n\nI almost died after giving birth to my daughter, Olympia.\n\nYet I consider myself fortunate.\n\nWhile I had a pretty easy pregnancy, my daughter was born by emergency C-section after her heart rate dropped dramatically during contractions. The surgery went smoothly. Before I knew it, Olympia was in my arms. It was the most amazing feeling I’ve ever experienced in my life. But what followed just 24 hours after giving birth were six days of uncertainty.\n\nJohn Russo\n\nIt began with a pulmonary embolism, which is a condition in which one or more arteries in the lungs becomes blocked by a blood clot. Because of my medical history with this problem, I live in fear of this situation. So, when I fell short of breath, I didn’t wait a second to alert the nurses.\n\nThis sparked a slew of health complications that I am lucky to have survived. First my C-section wound popped open due to the intense coughing I endured as a result of the embolism. I returned to surgery, where the doctors found a large hematoma, a swelling of clotted blood, in my abdomen. And then I returned to the operating room for a procedure that prevents clots from traveling to my lungs. When I finally made it home to my family, I had to spend the first six weeks of motherhood in bed.\n\nI am so grateful I had access to such an incredible medical team of doctors and nurses at a hospital with state-of-the-art equipment. They knew exactly how to handle this complicated turn of events. If it weren’t for their professional care, I wouldn’t be here today.\n\nAccording to the Centers for Disease Control and Prevention, black women in the United States are over three times more likely to die from pregnancy or childbirth-related causes. But this is not just a challenge in the United States. Around the world, thousands of women struggle to give birth in the poorest countries. When they have complications like mine, there are often no drugs, health facilities or doctors to save them. If they don’t want to give birth at home, they have to travel great distances at the height of pregnancy. Before they even bring a new life into this world, the cards are already stacked against them.\n\nHere’s the reality of one woman, as documented by UNICEF. In Malawi, Mary James walked hours to reach the closest health center while she was in labor. Exhausted, she made it to the facility and gave birth, only to lose her child later that day. She picked a name for him, but he never opened his eyes. He never cried. She kept the name to herself. Sadly, Mary’s nameless son was not the only one. That same day, approximately 2,600 babies died on their first day of life.\n\nAccording to UNICEF, each year, 2.6 million newborns die, tragically before their lives even really get started. Over 80% die from preventable causes. We know simple solutions exist, like access to midwives and functional health facilities, along with breastfeeding, skin-to-skin contact, clean water, basic drugs and good nutrition. Yet we are not doing our part. We are not rising to the challenge to help the women of the world.\n\nMary’s baby died because there weren’t enough doctors or nurses to save him. This is a chronic problem plaguing the most impoverished countries. But what if we lived in a world where there were enough birth attendants? Where there was no shortage of access to health facilities nearby? Where lifesaving drugs and clean water were easily available to all? Where midwives could help and advise mothers after birth? What if we lived in a world where every mother and newborn could receive affordable health care and thrive in life?\n\nThat world is possible. And we must dare to dream it for every black woman, for every woman in Malawi, and for every mother out there.\n\nAcross the globe, organizations like UNICEF are committed to delivering simple solutions on behalf of every mother and newborn. These solutions include recruiting and training more doctors and midwives, guaranteeing clean and functional health facilities, making the top 10 lifesaving drugs and equipment available, and most importantly, empowering adolescent girls to demand quality care.\n\nEvery mother, everywhere, regardless of race or background deserves to have a healthy pregnancy and birth. And you can help make this a reality.\n\nGet our free weekly newsletter Sign up for CNN Opinion’s newsletter. Join us on Twitter and Facebook\n\nHow? You can demand governments, businesses and health care providers do more to save these precious lives. You can donate to UNICEF and other organizations around the world working to make a difference for mothers and babies in need. In doing so, you become part of this narrative – making sure that one day, who you are or where you are from does not decide whether your baby gets to live or to die.\n\nTogether, we can make this change. Together, we can be the change.", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/180219170248-serena-williams-headshot.jpg?q=x_3,y_0,h_1722,w_3060,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/170913150835-serena-williams-baby.jpg?q=x_2,y_0,h_1072,w_1905,c_crop/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/180110104202-01-serena-williams-and-baby.jpg?q=x_0,y_0,h_926,w_1645,c_fill/w_800", "https://media.cnn.com/api/v1/images/stellar/prod/171108105918-baby-feet-stock.jpg?q=x_46,y_216,h_1646,w_2926,c_crop/h_144,w_256"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/180110104202-01-serena-williams-and-baby.jpg?q=x_0,y_0,h_926,w_1645,c_fill/w_800", "keywords": [], "authors": ["Serena Williams"], "canonical_link": "https://www.cnn.com/2018/02/20/opinions/protect-mother-pregnancy-williams-opinion/index.html", "title": "Serena Williams: What my life-threatening experience taught me about giving birth (Opinion)", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Serena Williams: What my life-threatening experience taught me about giving birth | CNN", "description": "Serena Williams writes that her own childbirth experience taught her we must work harder to ensure every mother and child have access to affordable health care", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180110104202-01-serena-williams-and-baby.jpg?q=x_0,y_0,h_926,w_1645,c_fill/w_800", "type": "article", "url": "https://www.cnn.com/2018/02/20/opinions/protect-mother-pregnancy-williams-opinion/index.html", "site_name": "CNN"}, "twitter": {"title": "Serena Williams: What my life-threatening experience taught me about giving birth | CNN", "description": "Serena Williams writes that her own childbirth experience taught her we must work harder to ensure every mother and child have access to affordable health care", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180110104202-01-serena-williams-and-baby.jpg?q=x_0,y_0,h_926,w_1645,c_fill/w_800", "card": "summary_large_image", "site": "@CNNOpinions"}, "description": "Serena Williams writes that her own childbirth experience taught her we must work harder to ensure every mother and child have access to affordable health care", "template_type": "article_leaf", "type": "article", "meta-section": "opinions", "theme": "opinions", "article": {"published_time": "2018-02-20T13:11:34Z", "modified_time": "2018-02-20T20:32:24Z", "tag": "business and industry sectors, business, economy and trade, children, death and dying, health and medical, health care, health care professionals, infants and toddlers, maternal and child health, medical fields and specialties, medical treatments and procedures, midwives, obstetrics and gynecology, population and demographics, pregnancy and childbirth, serena williams, society, sports figures, surgery, women's health", "publisher": "https://www.facebook.com/CNN"}, "keywords": "business and industry sectors, business, economy and trade, children, death and dying, health and medical, health care, health care professionals, infants and toddlers, maternal and child health, medical fields and specialties, medical treatments and procedures, midwives, obstetrics and gynecology, population and demographics, pregnancy and childbirth, serena williams, society, sports figures, surgery, women's health", "author": "Serena Williams", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1519084800.0, "source": "https://www.cnn.com", "summary": ""}