{"url": "https://www.hollywoodreporter.com/news/big-sick-emilys-illness-is-real-based-a-distressing-true-story-1015698", "text": "It’s not ideal to fall in love with someone who’s in a coma, but that’s what happens to Kumail Nanjiani in The Big Sick — and in real life. The Silicon Valley actor co-wrote the romantic dramedy with wife Emily V. Gordon, based on their actual courtship (Zoe Kazan portrays her onscreen, and Holly Hunter and Ray Romano play her parents).\n\nThe titular sickness remains unnamed throughout most of the movie, as it was to Gordon for much of her life. Ten years ago, she was a therapist in Chicago who was eight months into a relationship with the standup comedian. Gordon initially thought she simply caught a stubborn cold or, at worst, pneumonia. She fainted while getting an X-ray and soon found herself in the emergency room.\n\nAfter eight days of tests while in a medically induced coma, she was diagnosed with adult-onset Still’s disease (AOSD), an extremely rare form of arthritis that can shut down major organs when left untreated — as with Gordon, who had accumulated fluid in her lungs and was having trouble breathing.\n\n“Basically, your organs can start getting inflamed as if they’re under attacked and have an infection, but they’re not,” Gordon tells The Hollywood Reporter during a chat at New York City’s Four Seasons Hotel. “Because I wasn’t diagnosed or being treated for it, it just kept getting worse and worse. My organs kept getting more and more inflamed until I had to be hospitalized.”\n\nThe autoimmune disease is extremely rare — there are an estimated 1.5 cases per 100,000 to 1,000,000 people — and usually manifests when patients are between the ages of 18 and 40. Its cause and ultimate cure are still unknown, though the condition is relatively manageable after diagnosis.\n\n“I just have to practice self-care in the ways we all should be doing — get enough sleep, eat healthy and regularly, exercise and keep my stress and drinking down — but I have to be a little more diligent about it because if I slip on any of those, my immune system can act up,” Gordon explains of controlling her condition, which she does with Nanjiani’s help. “My parents call him my lion, and he really is. At times when I’m not great at self-care, he will force me to be good about it.”\n\nAOSD can either be episodic or chronic, and its symptoms, which can vary and range in severity, include high fever, skin rashes and joint pain. Gordon’s condition is episodic, with relatively manageable flare-ups occurring only a few times each year.\n\nWhen an episode seems imminent, Gordon makes sure to communicate openly with Nanjiani. “When it first happened, [I felt] the guilt of, how could I not see this happening? She was with me, and she got so sick — how could I not know?” he recalls. “Emily can be so stoic about it. She can be super sick and still have a great attitude. So part of the process for us has been Emily telling me, ‘Hey, I feel something coming on,’ and then me trying not to freak out for a little while.”\n\nGordon then cancels all her upcoming commitments so she can rest and take medication. “If I’m sick, I don’t have the ability to work through it — I have to stop,” says Gordon. “It’s not that bad. I just can’t leave the house for a few days.”\n\nNanjiani — who admits that “when I have a 99-degree fever and a sniffling nose, I’m such a baby” — follows suit in solidarity. “I don’t really take care of her in the traditional sense, but what happens is on day two, Emily is cleaning the entire house or trying on dresses!” he laughs. “Let’s try and own this, and have a good time if we can. It’s time to relax, lie on the couch and watch movies. Let’s eat cakes and shit.”\n\nCoincidentally, The Big Sick debuts alongside drafts of Trump’s health care bill, which allows states to opt out of Obamacare’s ban on refusing to cover pre-existing conditions like AOSD. “This movie wasn’t supposed to be political, but [if not for my insurance coverage,] I would still have those astronomical bills,” says Gordon. “We all need to take care of our health, and we all need help to do that.”", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/06/gettyimages-695404740_1_-_embed_2017.jpg?w=928", "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/024a_tbs_sg_30719-h_2017.jpg?w=1296&h=730&crop=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/033_tbs_day_006__4113_r_-_embed_217.jpg?w=928", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/024a_tbs_sg_30719-h_2017.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/024a_tbs_sg_30719-h_2017.jpg?w=1024", "keywords": [], "authors": ["Ashley Lee"], "canonical_link": "https://www.hollywoodreporter.com/news/general-news/big-sick-emilys-illness-is-real-based-a-distressing-true-story-1015698/", "title": "How Kumail Nanjiani and Emily V. Gordon Manage That ‘Big Sick’ Illness in Real Life", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The married co-writers tell THR of dealing with the extremely rare form of arthritis that brought them together 10 years ago.", "news_keywords": "Emily Gordon, kumail nanjiani, The Big Sick", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Ashley Lee", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1015698, "title": "How Kumail Nanjiani and Emily V. Gordon Manage That 'Big Sick' Illness in Real Life", "published_at": "2017-06-22 05:30:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/024a_tbs_sg_30719-h_2017.jpg?w=1024", "comment_count": 0, "tags": "The Big Sick", "topics": "News", "body": "It’s not ideal to fall in love with someone who’s in a coma, but that’s what happens to Kumail Nanjiani in The Big Sick — and in real life. The Silicon Valley actor co-wrote the romantic dramedy with wife Emily V. Gordon, based on their actual courtship (Zoe Kazan portrays her onscreen, and Holly Hunter and Ray Romano play her parents).\r\nThe titular sickness remains unnamed throughout most of the movie, as it was to Gordon for much of her life. Ten years ago, she was a therapist in Chicago who was eight months into a relationship with the standup comedian. Gordon initially thought she simply caught a stubborn cold or, at worst, pneumonia. She fainted while getting an X-ray and soon found herself in the emergency room.\r\nAfter eight days of tests while in a medically induced coma, she was diagnosed with adult-onset Still's disease (AOSD), an extremely rare form of arthritis that can shut down major organs when left untreated — as with Gordon, who had accumulated fluid in her lungs and was having trouble breathing.\r\n\r\n\"Basically, your organs can start getting inflamed as if they're under attacked and have an infection, but they're not,\" Gordon tells The Hollywood Reporter during a chat at New York City's Four Seasons Hotel. \"Because I wasn't diagnosed or being treated for it, it just kept getting worse and worse. My organs kept getting more and more inflamed until I had to be hospitalized.\"\r\nThe autoimmune disease is extremely rare — there are an estimated 1.5 cases per 100,000 to 1,000,000 people — and usually manifests when patients are between the ages of 18 and 40. Its cause and ultimate cure are still unknown, though the condition is relatively manageable after diagnosis.\r\n\"I just have to practice self-care in the ways we all should be doing — get enough sleep, eat healthy and regularly, exercise and keep my stress and drinking down — but I have to be a little more diligent about it because if I slip on any of those, my immune system can act up,\" Gordon explains of controlling her condition, which she does with Nanjiani's help. \"My parents call him my lion, and he really is. At times when I'm not great at self-care, he will force me to be good about it.\"\r\n\r\nAOSD can either be episodic or chronic, and its symptoms, which can vary and range in severity, include high fever, skin rashes and joint pain. Gordon's condition is episodic, with relatively manageable flare-ups occurring only a few times each year.\r\nWhen an episode seems imminent, Gordon makes sure to communicate openly with Nanjiani. \"When it first happened, [I felt] the guilt of, how could I not see this happening? She was with me, and she got so sick — how could I not know?\" he recalls. \"Emily can be so stoic about it. She can be super sick and still have a great attitude. So part of the process for us has been Emily telling me, 'Hey, I feel something coming on,' and then me trying not to freak out for a little while.\"\r\n\r\nGordon then cancels all her upcoming commitments so she can rest and take medication. \"If I'm sick, I don't have the ability to work through it — I have to stop,\" says Gordon. \"It’s not that bad. I just can't leave the house for a few days.\"\r\nNanjiani — who admits that \"when I have a 99-degree fever and a sniffling nose, I'm such a baby\" — follows suit in solidarity. \"I don't really take care of her in the traditional sense, but what happens is on day two, Emily is cleaning the entire house or trying on dresses!\" he laughs. \"Let's try and own this, and have a good time if we can. It's time to relax, lie on the couch and watch movies. Let's eat cakes and shit.\"\r\nCoincidentally, The Big Sick debuts alongside drafts of Trump's health care bill, which allows states to opt out of Obamacare's ban on refusing to cover pre-existing conditions like AOSD. \"This movie wasn't supposed to be political, but [if not for my insurance coverage,] I would still have those astronomical bills,\" says Gordon. \"We all need to take care of our health, and we all need help to do that.\"", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "How Kumail Nanjiani and Emily V. Gordon Manage That ‘Big Sick’ Illness in Real Life", "url": "https://www.hollywoodreporter.com/news/general-news/big-sick-emilys-illness-is-real-based-a-distressing-true-story-1015698/", "description": "The married co-writers tell THR of dealing with the extremely rare form of arthritis that brought them together 10 years ago.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/024a_tbs_sg_30719-h_2017.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-06-22T05:30:00+00:00", "modified_time": "2017-07-15T07:23:08+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "How Kumail Nanjiani and Emily V. Gordon Manage That ‘Big Sick’ Illness in Real Life", "description": "The married co-writers tell THR of dealing with the extremely rare form of arthritis that brought them together 10 years ago.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/024a_tbs_sg_30719-h_2017.jpg?w=1296"}}, "movies": [], "publish_date": 1498109400.0, "source": "https://www.hollywoodreporter.com", "summary": ""}