{"url": "https://www.popbuzz.com/tv-film/news/riverdale-season-3-release-date-cast-trailers/", "text": "'Riverdale' Season 3: News, Spoilers, Release Date, Cast, Trailers And Everything You Need To Know\n\nBy Katie Louise Smith\n\nAll the latest information about the cast, storyline, theories and trailers for Riverdale season 3.\n\nRiverdale season 3 is officially in full swing and there's already so much news and so many spoilers out there to feast your eyes on. Now that season two of Riverdale is firmly in the past, word on the street is that the third season of the show will take on a completely different tone and genre. There's gonna be less murder (apparently!) and more focus on the friendships and relationships - although, we haven't quite seen much of that just yet, thanks to the Gargoyle King.\n\n'Riverdale' Season 3: All The Behind-The-Scenes Spoilers, Pictures And Videos From The Cast On Set\n\nThe latest news about Riverdale season 3?\n\nThe Black Hood is back back BACK AGAIN, BABYYYYY. The return of Hal Cooper has been being teased for quite a while now and it now it appears as though he'll finally be making his grand return to Riverdale.\n\nSpilling the tea on Twitter, Lochlyn Munro revealed that Hal will be back in the January 23rd episode. No other details were revealed but we can all assume that he's still in jail. Does someone visit him? Does he have any scoop on Gryphons and Gargoyles? Is he in cahoots with Hiram? Guess we'll have to wait and see...\n\nIn other news, Skeet Ulrich has been teasing the return of FP's estranged wife Gladys Jones and her arrival in town is not going to be as thrilling as everyone imagined it would be - especially not for FP. In an interview with TV Line, Skeet said that there will be \"a lot to worry about\" when Gladys slides back into the picture - and we're not just talking trouble ahead for FP and Alice Cooper Smith, who recently rekindled their high school romance.\n\n\"I think there's a lot to be worried about,\" Ulrich said. \"[F.P. has just] started to get life by the horns a little bit and find a workable life with Jughead and she's the ex-factor. As [with] most toxic relationships, there's someone that just sets you off. The reunion is certainly not what he would've wanted.\"\n\nThe lives of your favourite characters are also hanging in the balance. It's already been teased that there's death right off the bat this season but by the sounds of things... we might be saying goodbye to a MAIN cast member too. \"Life goes on (for MOST of our series regulars) in Episode #309 of #Riverdale...\" writes Aguirre-Sacasa. Odds on Hiram faking his own death? Time to start theorising!\n\nSo - what can we expect in season three of our favourite show? From the new relationships (*ahem* CHONI! FALICE! VEGGIE! ARCHOSIE?!), to the ongoing mystery surrounding the Gargoyle King, the Sisters of Quiet Mercy, the Farm and the big plan that Hiram has cooked up with new gang of villains (Penny Peabody, Penelope Blossom, Claudius Blossom, Malachai and Sheriff Minetta), there's a lot for the third season to unpack!\n\nWe'll be updating this article throughout the year when we get more information but, in the meantime, here's what we know so far:\n\nIs Riverdale returning for a third season? Has it been confirmed?\n\nYes! Season three has officially been renewed by The CW and was confirmed via Deadline. Several cast members had already teased that Riverdale would be back for a third season.\n\nThe shows ratings for season 2 have been strong (up 58% from the first season) and show creator has just signed a deal with Netflix, who stream Riverdale outside the US, to develop a reboot of The Chilling Adventures Of Sabrina. The whole franchise seems unstoppable at the minute.\n\nWhen is Riverdale season 3 released?\n\nRiverdale returned to our screens on Wednesday October 10th, 2018, one week earlier than the release of season two. It will air in its usual time-slot at 8/7c on The CW.\n\nThe next episode of Riverdale will air on January 16th at 8/7c on The CW. It will be the ninth episode of season 3, titled \"No Exit\".\n\nThe third season premiered on Netflix in the UK on Thursday October 11th. New episodes will drop at 8am, the day after they air on The CW. Episode nine will air on Netflix in the UK on January 17th at 8am GMT.\n\nWhen is the next episode of Riverdale season 3 on Netflix?\n\nHow many episodes will be in Riverdale season 3?\n\nThere will reportedly be 23 episodes in the third season of the show - one more than season two.\n\nWhat’s going to happen in Riverdale season 3?\n\nFirst things first, our main character Archie was arrested for the murder of Cassidy Bullock and is now on the run from the police and Hiram Lodge, who wants him dead. He's also caught up in the town wide game of Gryphons and Gargoyles. That storyline will no doubt be one of the main conflicts of the season.\n\nJughead's mother Gladys and sister Jellybean have now arrived in Riverdale and their arrival isn't quite what either we, or FP and Jughead thought it would be. Gladys' return will also mean some juicy drama ahead for Alice Cooper and FP Jones, who seem to have spent the whole summer rolling around in bed together.\n\nTalking of Falice, just when you thought we were about to set off on a nice cruise aboard our new hot and steamy ship, it looks like it won't last very long - for now. Despite getting back together, the introductions of Gladys and the mysterious cult farm leader Edgar Evernever will surely tear the two apart. And it sounds like the vulnerable Alice might find a potential new love interest in Edgar and also find herself in a bit of danger. (Also, where is their REAL son? Surely that'll pop up at some point in season three, right?)\n\nA lot of new ships will probably be explored in season three too. Cheryl and Toni's relationship will finally have a chance to *ahem* blossom... And Kevin will be in a relationship with Moose when we return. It's also been teased that Veronica will find herself a new love interest too. Reggie, anyone? There's also tea that Archie and Josie are set to become a couple around episode 12 of season 3.\n\nIt's also been said there will be a wedding between two parents in the third season. Speaking at the TCA \"Meet The Parents\" panel on Aug 6, It was revealed that Sheriff Keller and Sierra McCoy might actually be tying the knot this season!\n\nWhich characters will be in Riverdale season 3?\n\nYou can definitely expect the core four of Archie (KJ Apa), Betty (Lili Reinhart), Jughead (Cole Sprouse) and Veronica (Camila Mendes) to stay for season 3. Other main characters and actors that will be returning are: Cheryl Blossom (Madelaine Petsch), Kevin Keller (Casey Cott), Alice Cooper (Mädchen Amick), FP Jones (Skeet Ulrich), Hermione Lodge (Marisol Nichols), Fred Andrews (Luke Perry), Josie McCoy (Ashleigh Murray) and Hiram Lodge (Mark Consuelos).\n\nVanessa Morgan and Charles Melton have both been upgraded to series regulars which means we'll also be seeing more of both Toni Topaz and Reggie Mantle.\n\nRecurring characters such as Polly Cooper (Tiera Skovbye), Ethel Muggs (Shannon Purser), Sweetpea (Jordan Connor), Fangs Fogarty (Drew Ray Tanner), Sierra McCoy (Robin Givens), Penelope Blossom (Nathalie Boltt), Mary Andrews (Molly Ringwald) and Sheriff Keller (Martin Cummins) are also set to return.\n\nHart Denton has also been confirmed as a returning cast member by his (fake) on-screen mum, Amick - so we guess it looks like Chic is not done with the Cooper family just yet. Speaking at an event on May 22, Amick said: \"I'm sure you're all aware of [Denton's] creepy portrayal of the Cooper son and I can't wait to see what he's gonna be up to season three... SPOILER ALERT!\" We guess he's alive and managed to escape the Black Hood in one piece then, huh?\n\nGina Gershon and Trinity Likins will be arriving in Riverdale in episode 8 (Dec 12) as Gladys and Jellybean Jones. Riley Keough has also joined the cast as Laurie Lake and Penelope Ann Miller will be playing Archie prosecutor.\n\nFarm leader Edgar will also be moving to the town along with his daughter Evelyn Evernever (played by Zoe De Grandmaison) but has yet to be cast.\n\nvia Giphy\n\nWho is the Gargoyle King?\n\nAccording to Aguirre-Sacasa, the Gargoyle King is “more of an urban legend, more of the Slenderman. The Black Hood was a serial killer, Hiram is a mob boss, and this guy is almost like, the bad guy in the fairytale.”\n\n“We don't know if he's real or if it's someone in a suit. So there's kind of a sense of myth about him. And he's a lot more dangerous.”\n\nFor what we've seen so far, the Gargoyle King is both a physical being and a hallucination. It is tied to Gryphons and Gargoyles and also seems to be tied to Hiram Lodge and the Sisters of Quiet Mercy. So far, there's plenty of suspects that could be the Gargoyle King. From Hiram and Hermione Lodge, to Edgar Evernever, FP Jones (please god, no) and even Polly Cooper herself, here are all the key suspects in the hunt for the Gargoyle King.\n\nWill the Black Hood return in Riverdale season 3?\n\nSince the Black Hood's identity was revealed at the end of last season (well, well, well, Hal Cooper), we'll probably be seeing the fall out and repercussions of his confession for Alice and Betty come season three. It's been confirmed by Aguirre-Sacasa and Lochlyn Munro that Hal will be sticking around in season three and he will have a juicy storyline.\n\nSpeaking to Entertainment Weekly about Hal's role in season 3, Munro says: \"Roberto came up to me and adamantly said, “No, it’s not over [for] Hal. We have a whole different story arc planned for that.\"\n\n\"I’m really excited to see what they come up with, so I can really jump into it. Because I now have really embraced this situation with him, and I want to see why he became the guy he is. It gives me more to do, and I look forward to it.\"\n\nWhat are the season three episode titles?\n\nHere are all the episode titles we know so far:\n\nEpisode 1 - \"Chapter Thirty-Six: Labor Day\"\n\nEpisode 2 - \"Chapter Thirty-Seven: Fortune And Men's Eyes\"\n\nEpisode 3 - \"Chapter Thirty-Eight: As Above, So Below\"\n\nEpisode 4 - \"Chapter Thirty-Nine: The Midnight Club\"\n\nEpisode 5 - \"Chapter Forty: The Great Escape\"\n\nEpisode 6 - \"Chapter Forty-One: Manhunter\"\n\nEpisode 7 - \"Chapter Forty-Two: The Man In Black\"\n\nEpisode 8 - \"Chapter Forty-Three: Outbreak\"\n\nEpisode 9 - \"Chapter Forty-Four: No Exit\"\n\nEpisode 10 - \"Chapter Forty-Five: The Stranger\"\n\nLife goes on (for MOST of our series regulars) in Episode #309 of #Riverdale... 🎲🥊☠️ pic.twitter.com/9lqwzR59uU — RobertoAguirreSacasa (@WriterRAS) October 2, 2018\n\nHave they started filming Riverdale season 3 yet?\n\nYes! The cast arrived back in Vancouver on Friday July 6th and the first table read of the new season was held. FIlming will likely wrap for the series at the end of March.\n\nThe cast are currently filming around episode 13 of season 3.\n\nDinner with the gang after the first table read of Season 3 of #Riverdale! pic.twitter.com/KfqbMPRBJU — RobertoAguirreSacasa (@WriterRAS) July 7, 2018\n\nWill Riverdale cross over with Sabrina in season three?\n\nAh, the million dollar question. Rumours of the two worlds crossing over have been rife ever since the first season. Now that Sabrina production is in full swing, and with a new show to promote, we wouldn't be surprised if Netflix arranged for a crossover to happen.\n\nBut by the looks of things, the two shows will remain completely separate. In fact, we're not even sure that they exist in the same world. So far, there are no plans to include Sabrina on Riverdale. Instead of a backdoor pilot within the show, Sabrina will be getting her OWN pilot episode. The show will not be a \"spin-off\" of Riverdale either, it'll be a stand alone show.\n\nIn an interview with Vulture, Lili Reinhart appeared to confirm that Sabrina will not exist within the same universe as Riverdale, and that Betty will never make appearance on the Netflix show.\n\n\"I think Betty’s solely in the Riverdale world and it doesn’t make sense for a crossover. That’s why the decision was ultimately made to move to Netflix — to make these Riverdale and Sabrina shows completely separate universes.\"", "images": ["https://images.popbuzz.com/images/19149?width=641&crop=16_9&signature=_eqLtrx_iM52VQytxQHntozMmoQ=", "https://www.popbuzz.com/assets_v4r/gusto/img/twitter-share.png", "https://images.popbuzz.com/images/332469?width=105&crop=1_1&signature=3HxnWZuITxONzAMnwhFLww53yS8=", "https://images.popbuzz.com/images/332228?width=105&crop=1_1&signature=lD1sAE0S4HacLO3NG18JeCp9kjY=", "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAGQAAABkAQMAAABKLAcXAAAABGdBTUEAALGPC/xhBQAAAANQTFRF2NjY5QlMowAAABNJREFUGBljGAWjYBSMglFAVwAABXgAAdxFAhsAAAAASUVORK5CYII=", "https://images.popbuzz.com/images/332384?width=105&crop=1_1&signature=IJ3xbFmNpCjHzislQ5uZztSx9vg=", "https://images.popbuzz.com/images/332229?width=105&crop=1_1&signature=DDZ_bRj9dDN6Wg9i-4CKhnlhWlQ=", "https://images.popbuzz.com/images/332170?width=105&crop=1_1&signature=K-LzUIUEgJseyKIN4ax8USvXIxg=", "https://images.popbuzz.com/images/332165?width=105&crop=1_1&signature=6vFLJuTl5vkiSDiPM0uH63JO31U=", "https://images.popbuzz.com/images/332353?width=105&crop=1_1&signature=c-Db8KGmYKGD3_HJNo-vcgbnFyc=", "https://images.popbuzz.com/images/332398?width=105&crop=1_1&signature=BUmYDXzlhiSGMXKqdEeDA8btCIQ=", "https://www.popbuzz.com/assets_v4r/gusto/img/facebook-share.png", "https://images.popbuzz.com/images/332015?width=105&crop=1_1&signature=qNIpbGRsS7fxsEhDuxT2fXwi4XY=", "https://images.popbuzz.com/images/332497?width=105&crop=1_1&signature=TY7VLTpePIqBopwv7NFENbQ8IO8=", "https://images.popbuzz.com/images/324715?width=105&crop=1_1&signature=Jtm_aAVzfLAOvZ2h_8tXklw6uSY="], "top_img": "https://images.popbuzz.com/images/19149?width=641&crop=16_9&signature=_eqLtrx_iM52VQytxQHntozMmoQ=", "keywords": [], "authors": ["Woodrow Whyte", "Katie Louise Smith"], "canonical_link": "https://www.popbuzz.com/tv-film/news/riverdale-season-3-release-date-cast-trailers/", "title": "'Riverdale' Season 3: News, Spoilers, Release Date, Cast, Trailers And Everything You Need To Know", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "og": {"url": "https://www.popbuzz.com/tv-film/news/riverdale-season-3-release-date-cast-trailers/", "site_name": "PopBuzz", "domain": "www.popbuzz.com", "title": "'Riverdale' Season 3: News, Spoilers, Release Date, Cast, Trailers And Everything You Need To Know", "image": {"identifier": "https://images.popbuzz.com/images/19149?width=641&crop=16_9&signature=_eqLtrx_iM52VQytxQHntozMmoQ=", "height": 361, "width": 641}, "description": "It's official! Riverdale has been renewed for a third season at The CW and will be returning to our screens next fall. But what do we know about the new season? Read all the latest information about the cast, storyline, theories and trailers for Riverdale season 3.", "type": "article"}, "twitter": {"site": "@popbuzz", "url": "https://www.popbuzz.com/tv-film/news/riverdale-season-3-release-date-cast-trailers/", "title": "'Riverdale' Season 3: News, Spoilers, Release Date, Cast, Trailers And Everything You Need To Know", "card": "summary_large_image", "image": "https://images.popbuzz.com/images/19149?width=641&crop=16_9&signature=_eqLtrx_iM52VQytxQHntozMmoQ=", "description": "It's official! Riverdale has been renewed for a third season at The CW and will be returning to our screens next fall. But what do we know about the new season? Read all the latest information about the cast, storyline, theories and trailers for Riverdale season 3."}, "fb": {"admins": "627792841,551351399,716836285,1547481361,837890453,661531116", "app_id": 1590232324531551, "page_id": 1488952944702289, "pages": 1488952944702289}, "pubdate": "2019-01-08T10:27:12", "modified": "2019-01-08T10:31:04", "parsely-type": "post", "robots": "max-image-preview:large", "parsely-author": "Katie Louise Smith", "description": "It's official! Riverdale has been renewed for a third season at The CW and will be returning to our screens next fall. But what do we know about the new season? Read all the latest information about the cast, storyline, theories and trailers for Riverdale season 3.", "keywords": "Riverdale, Season 3, Release Date, Cast, Theories, Characters,", "parsely-link": "https://www.popbuzz.com/tv-film/news/riverdale-season-3-release-date-cast-trailers/", "parsely-section": "/tv-film/news/", "parsely-title": "'Riverdale' Season 3: News, Spoilers, Release Date, Cast, Trailers And Everything You Need To Know", "parsely-post-id": 9856, "parsely-pub-date": "2019-01-08T10:27:12+00:00", "parsely-image-url": "https://images.popbuzz.com/images/19149?width=641&crop=16_9&signature=_eqLtrx_iM52VQytxQHntozMmoQ="}, "movies": [], "publish_date": null, "source": "https://www.popbuzz.com", "summary": ""}