{"url": "https://web.archive.org/web/20170717150420/https://www.forbes.com/sites/insertcoin/2017/07/17/yes-ed-sheerans-game-of-thrones-cameo-was-a-mistake/", "text": "HBO\n\nI was expecting to be talking about X major character’s death after last night’s Game of Thrones premiere.\n\nI was not expecting to be talking about Ed Sheeran.\n\nIn truth, this was one of the least bloody episodes of the entire series (overlooking Arya’s little poisonous dinner party), and mostly served as set up for the conflicts to come. But the one moment that seems to have stuck with everyone was a certain less-than-subtle cameo from world-famous musician, Ed Sheeran.\n\nIf you don’t know who Ed Sheeran is or what he looks like, you probably didn’t think anything was amiss. But if you do, and millions will recognize him on sight, it was a very bizarre moment in a show that seems like it would avoid these kinds of “celebrity guest star” cameos.\n\nSheeran plays a young Lannister soldier, part of a detachment that Arya encounters after dispatching the Freys. He sings a tune that Arya hears from a ways off (“It’s a new one” he says, when Arya asks what the song is. Thankfully it’s not one of his own). And I believe he has one other line about how King’s Landing is the worst. Most of the talking is left to two other members of the party during the scene.\n\nAnd still, his appearance was jarring. I say this not as someone who dislikes Ed Sheeran, but it was handled completely wrong. If you knew who he was, it was all you could focus on in the scene, and especially for the type of show Game of Thrones is, this kind of front-and-center cameo of someone this famous seemed out of place, like Miley Cyrus showing up on The Walking Dead as a survivor or watching The Handmaid’s Tale with special musical guest Drake. Sheeran’s cameo actually reminded me a lot of when Rihanna showed up to play Marion Crane on the last season of Bates Motel, where it was impossible to see anyone but Rihanna during her stint (though she didn’t sing).\n\nThis also isn’t to say that Game of Thrones shouldn’t have musical cameos, as it has done so many, many times in the past. Throughout the last six seasons, members of the bands Snow Patrol, Coldplay, Sigur Ros, Mastadon and Of Monsters and Men all showed up on Game of Thrones at one point, but if you didn’t know that, I wouldn’t blame you. That’s because A) a lot less people would know what these band members look like and B) they were often dressed up so you probably wouldn’t recognize them anyway. Ed Sheeran was just Ed Sheeran…in armor, and he certainly wasn’t hiding in the background.\n\nAnyway, it didn’t ruin the evening or anything, but it was pretty distracting in what was a key scene where Arya gets to see that the Lannister army isn’t some faceless mass of evil, but contains some sweet young boys as well. Knowing Game of Thrones, I wouldn’t be surprised to see these lads show up as corpses later, teaching Arya another valuable lesson. And I know there were plenty of people last night rooting for Arya to stick Ed Sheeran, but that seems a bit extreme to me.\n\nSo yes, this was a misstep from Game of Thrones, to be sure. They’ve done plenty of non-distracting cameos before, but this one was painfully unsubtle to the point where it probably shouldn’t have happened at all.\n\nFollow me on Twitter and on Facebook. Pick up my sci-fi novel series, The Earthborn Trilogy, which is now in print, online and on audiobook.", "images": ["https://web.archive.org/web/20170717150420im_/https://blogs-images.forbes.com/insertcoin/files/2017/07/ed-sheeran-thrones-1.jpg?width=640&height=434", "https://web.archive.org/web/20170717150420im_/https://blogs-images.forbes.com/insertcoin/files/2017/07/ed-sheeran-thrones-1.jpg?width=960", "https://web.archive.org/web/20170717150420im_/https://2.gravatar.com/avatar/eb9deeb63c91b1c16548f2f1e1348a86?s=400&d=mm&r=g"], "top_img": "https://web.archive.org/web/20170717150420im_/https://blogs-images.forbes.com/insertcoin/files/2017/07/ed-sheeran-thrones-1.jpg?width=640&height=434", "keywords": [], "authors": ["Paul Tassi"], "canonical_link": "https://web.archive.org/web/20170717150420/https://www.forbes.com/sites/insertcoin/2017/07/17/yes-ed-sheerans-game-of-thrones-cameo-was-a-mistake/", "title": "Yes, Ed Sheeran's 'Game of Thrones' Cameo Was A Mistake", "meta_data": {"referrer": "origin-when-cross-origin", "description": "I was expecting to be talking about X major character’s death after last night’s Game of Thrones premiere. I was not expecting to be talking about Ed Sheeran.", "author": "Paul Tassi", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "prerender-status-code": "{{meta.code}}", "apple-itunes-app": "app-id=588647136", "og": {"title": "Yes, Ed Sheeran's 'Game of Thrones' Cameo Was A Mistake", "site_name": "Forbes", "url": "https://web.archive.org/web/20170717150420/https://www.forbes.com/sites/insertcoin/2017/07/17/yes-ed-sheerans-game-of-thrones-cameo-was-a-mistake/", "image": {"identifier": "https://web.archive.org/web/20170717150420im_/https://blogs-images.forbes.com/insertcoin/files/2017/07/ed-sheeran-thrones-1.jpg?width=640&height=434", "type": "image/jpeg,image/gif,image/png"}, "description": "I was expecting to be talking about X major character’s death after last night’s Game of Thrones premiere. I was not expecting to be talking about Ed Sheeran.", "updated_time": "2017-07-17T08:52:15-04:00", "type": "article"}, "article": {"publisher": "https://www.facebook.com/forbes", "author": "http://www.facebook.com/https://www.facebook.com/paulttassi", "section": "Business", "section_url": "//www.forbes.com/business", "id": "blogAndPostId/blog/post/1174-35239", "published": "2017-07-17", "modified": "2017-07-17"}, "fb": {"app_id": 123694841080850}, "twitter": {"card": "summary_large_image", "site": "@forbes", "title": "Yes, Ed Sheeran's 'Game of Thrones' Cameo Was A Mistake", "description": "I was expecting to be talking about X major character’s death after last night’s Game of Thrones premiere. I was not expecting to be talking about Ed Sheeran.", "image": "https://web.archive.org/web/20170717150420im_/https://blogs-images.forbes.com/insertcoin/files/2017/07/ed-sheeran-thrones-1.jpg?width=640&height=434", "creator": "@PaulTassi"}}, "movies": ["https://web.archive.org/web/20170717150420if_/https://www.youtube.com/embed/j6KgnTh0SD8"], "publish_date": 1500246000.0, "source": "https://web.archive.org", "summary": ""}