{"url": "https://www.desertsun.com/story/life/entertainment/people/2018/01/26/first-jordan-peele-wasnt-sure-british-kaluuya-could-pull-off-being-black-america-four-oscar-noms-lat/1070115001/", "text": "At first 'Get Out' director Jordan Peele wasn't sure Brit Kaluuya could pull off being black in America\n\nShow Caption Hide Caption Daniel Kaluuya and Jordan Peele talk 'Get Out' in Palm Springs 'Get Out' director Jordan Peele and star Daniel Kaluuya were in Palm Springs Jan. 3 for the Variety Brunch and had lots to say about each other and the Oscar nominated movie. Xochitl Pena/The Desert Sun\n\nI have friends who don’t understand the phenomenon of “Get Out.” They just don’t get it.\n\nWell, for every one of those people who doesn’t “get it.” There are thousands who do. It was made for $4.5 million and has grossed more than $250 million worldwide.\n\nOscar nominations were announced Tuesday and I was both surprised and fist-pumpingly happy over its handful of nominations: Best movie, best original screenplay for Jordan Peele, best directing for Peele and best performance in a leading role for Daniel Kaluuya. The Academy Awards are March 4.\n\nFirst of all, I love horror flicks and historically only a handful of scary movies have ever been nominated by the Academy for best picture. So this is huge for the thriller/horror genre. And secondly, there is an underlying social message that Peele so masterfully weaves into the storyline that touches on the plight of African-Americans and resonates in the heightened discussions about equality today.\n\nIn various interviews and speeches, Peele has likened the “sunken place” to the system that silences the voice of women, minorities and other people.\n\nPeele and Kaluuya were in Palm Springs earlier this month for the Variety Brunch awards held annually during the Palm Springs International Film Festival. Peele was there to present Kaluuya with the Creative Impact in Acting Award. (Not his last, I hope)\n\nI was fortunate to attend the brunch and not only got an opportunity to interview Kaluuya and get his take on being a part of such a surprise hit, but I also got to hear Kaluuya and Peele talk about working with each other.\n\nPeele said he was blown away by Kaluuya’s skills, but initially he wasn’t sure if the British actor was the right person for the role. Kaluuya talked about how grateful he was that Peele believed in him and ultimately took a chance on him.\n\nThe director, who started out in comedy on such sketch shows as \"MADtv\" and \"Key and Peele,\" said he noticed the young actor in an episode of “Black Mirror.” He said Kaluuya delivered one of the most “passionate, primal, beautiful” monologues he’d ever seen.\n\n“It’s a beautiful episode of television and Daniel in it plays a character who really showed me the complete spectrum of emotion that I knew I would need for my movie,” Peele said.\n\nREAD MORE: 'Wonder Woman' director chokes up at Variety brunch when talking role of women in Hollywood\n\n“I watched his performance in awe ... still I admit I had a question in my head whether or not I could hire a British actor for a film about the African-American experience. I wondered if the two cultures would translate. If being a black British person, how it related to being an African-American — what this movie was about.”\n\nOnce the two Skyped for about half an hour, Kaluuya put all of Peele's concerns to rest. He said Kaluuya got the script and really showed that he grasped not only the African-American experience of being black in white spaces and what it means to navigate in a world like that, but that kind of experience overall regardless of nationality.\n\n“He said ‘black is black. Right? You know what I mean? Black is black.’ And that really stuck. I knew what he meant then. And so he won me over there,” said Peele.\n\nAnd then when it came time for Kaluuya to actually audition, Peele said their jaws dropped. They did the scene where Kaluuya’s character (spoiler alert!) is getting hypnotized by Catherine Keener’s character and he delivered the scene as close as possible to what is in the actual movie.\n\nAnd then when it came time to actually film that scene, they did five takes and in each one a tear rolled out of his eye basically at the same minute, at the same second, in each take, said Peele.\n\n“Having him on the actual set of the film was a dream for a first-time director like myself. His process is beautiful. All he asks is that you give him the emotion that he needs to feel. You’re discovering more about this role yourself while you’re talking to him,” he said. “There’s nothing more you can dream of as a director.”\n\nREAD MORE: What the stars had to say on and off the red carpet at the Palm Springs International Film Festival gala\n\nKaluuya, who said he had no idea how huge the film would become, said he owes the film’s success to Peele and his success on screen to Peele’s support.\n\n“There’s so many things that have to happen for me to just do my job. To do acting. There’s so many pieces. So many stars have to align. But a major piece (that) has to be there for me to do my job is belief and someone believed in me,” he said. “I don’t know why we live in a world where because of who I am and the hue I have people don’t. And that’s tough. So when Jordan did it meant the world to me and I just didn’t want to let him down.”\n\nKaluuya saw the movie again just a couple days prior to his Palm Springs visit and said he came away thinking what a special filmmaker Peele is and how impressive the movie was.\n\n“And I felt so privileged that you allowed me to do it with you. And to help me tell your truth,” said Kaluuya to Peele.\n\nHave something for the column? Contact Xochitl Peña, Vibe & Style Columnist at The Desert Sun, at xochitl.pena@thedesertsun.com or at (760) 778-4647.", "images": ["https://media.gannett-cdn.com/41188256001/41188256001_5720344901001_5720338292001-vs.jpg?pubId=41188256001", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://www.gannett-cdn.com/-mm-/3bde9dc0fc764915d821510b77ac18554a20d734/c=614-193-3921-2061/local/-/media/2018/01/04/USATODAY/USATODAY/636506738081793161-Celebs010.JPG?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/3bde9dc0fc764915d821510b77ac18554a20d734/c=614-193-3921-2061/local/-/media/2018/01/04/USATODAY/USATODAY/636506738081793161-Celebs010.JPG?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Xochitl Pena"], "canonical_link": "https://www.desertsun.com/story/life/entertainment/people/2018/01/26/first-jordan-peele-wasnt-sure-british-kaluuya-could-pull-off-being-black-america-four-oscar-noms-lat/1070115001/", "title": "At first 'Get Out' director Jordan Peele wasn't sure Brit Kaluuya could pull off being black in America", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=531366663, app-argument=https://www.desertsun.com/story/life/entertainment/people/2018/01/26/first-jordan-peele-wasnt-sure-british-kaluuya-could-pull-off-being-black-america-four-oscar-noms-lat/1070115001/life/entertainment/people", "theme-color": "#ffffff", "og": {"title": "At first 'Get Out' director Jordan Peele wasn't sure Brit Kaluuya could pull off being black in America", "description": "'Get Out' director Jordan Peele and star Daniel Kaluuya were recently in Palm Springs and had lots to say about each other and the movie.", "site_name": "Palm Springs Desert Sun", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/3bde9dc0fc764915d821510b77ac18554a20d734/c=614-193-3921-2061/local/-/media/2018/01/04/USATODAY/USATODAY/636506738081793161-Celebs010.JPG?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "description": "'Get Out' director Jordan Peele and star Daniel Kaluuya were recently in Palm Springs and had lots to say about each other and the movie.", "twitter": {"site": "@mydesert", "creator": "@mydesert", "card": "summary_large_image"}}, "movies": [], "publish_date": 1516924800.0, "source": "https://www.desertsun.com", "summary": ""}