{"url": "https://web.archive.org/web/20181115110429/https://ew.com/tv/2018/11/15/survivor-jeff-probst-david-vs-goliath-episode-8/", "text": "Each week, host Jeff Probst will answer a few questions about the latest episode of Survivor: David vs. Goliath.\n\nENTERTAINMENT WEEKLY: We saw Mike respond to your catchphrase of “Got nothin’ for you” with “We’ve got nothing for you either.” You actually kind of like it when contestants give it back to you a bit, don’t you? After all, I remember some of those classic Probst–Penner interactions of yesteryear.\n\nJEFF PROBST: Ah, it’s the best! Most of those “Survivor phrases” I say are really silly and yet because we’ve stuck with them they’ve become part of the fabric of the game. I still get a huge kick out of saying them because on one hand it’s tongue in cheek, and on the other hand it’s Survivor gospel. But, it does take a certain storytelling swagger for a player to throw it back to me and have it land. Occasionally players will try to make a similar type of joke and it just doesn’t work. Mike White is obviously a hall-of-fame storyteller and that was a great moment.\n\nAfter Mike had his epiphany that Christian needed to go and everyone got on board, Angelina pointed out that she had pushed for that exact same thing at the prior vote to no avail, while also making a comment that whenever a woman had tried to spearhead a plan this season that she had been ignored. You’ve seen a lot of Survivor in your day. Generally speaking, have you noticed a difference in the way men’s and women’s ideas are received in this game?\n\nYes, absolutely. I think if we went back through old seasons and studied how interactions between women and men have changed over the years we would be shocked. Survivor is a microcosm for life, and what Angelina is referring to reflects what is happening in our culture at large. The way men and women relate to each other is undergoing a dramatic shift. It’s a change that is needed and one that I find very exciting. And this changing landscape is impacting Survivor.\n\nFor instance, I can’t imagine doing another “Men vs. Women” season. It just seems ridiculous right now. And I do find it interesting that Angelina has a lot of fans, but also a lot of detractors. People who think she is too bossy or arrogant. You could list a lot of men who have played similar types of games and they’re often called “threats.” Of course, in this situation there are a myriad of potential mitigating circumstances (like trust issues or bragging rights) that may have contributed to how Angelina was treated. But big picture, I think we’re going to continue to see a shift in how the genders relate to each other. It’s one of the anthropological benefits of this delicious “social experiment” we like to call… Survivor!\n\nSo Davie and Dan both play their idols and then John goes home. Some big reactions from folks when all three of these events happened. Being on the scene, what did you make of it all and what do you think people were most surprised by in this entire chain of events?\n\nMy biggest takeaway from a tribal like this is, “we put the right people on this season!” THAT is how you play this game. People are playing to win and I love it. I truly believe the reason we haven’t seen a resentful jury in years is because of the mutual admiration and respect that everyone has for how most everybody else plays the game. They all know this is a game of deception. The key is, I need to get you before you get me. The complication comes when we realize we could get further in the game by working together. Now we have a relationship and trust starts to develop and the game gets more difficult.\n\nBut when you see this kind of gameplay happening at Tribal Council, you know that it’s coming from players who realize that no matter who I promise or who I align with or who I think I can trust — it’s still a game of “I need to get you before you get me.”\n\nSo Johnny Mundo gets nailed on the double-idol play. He certainly looked the part of a Goliath when he showed up this season. How would you sum up his time on the island?\n\nWe really wanted John on the Goliath tribe but there was a scheduling issue and we were told he couldn’t do it. It was a major disappointment. Then one day, I got a call — “His schedule changed, he can do it!” It was one of the best days in casting because we knew John would bring the physical representation of a Goliath but also many more layers that would surprise people. John’s a deep thinker and a smart guy. We hated to lose him. I think if he played again, he might play a bit more aggressively, but I really enjoyed having him on the island.\n\nIt looks like the shifting continues next week. What can you tell us about what’s coming up?\n\nUh… let’s see… how should I put this? Well, it’s the night before Thanksgiving, you don’t have school the next day and you probably don’t have work… so you should DEFINITELY NOT MISS IT! How’s that? It’s a really fun episode that the audience is going to love.\n\nWatch an exclusive deleted scene above and make sure to read our episode recap. Also take some time to read our in-depth halfway point interview with Probst, and for more Survivor scoop, follow Dalton on Twitter @DaltonRoss.", "images": ["https://web.archive.org/web/20181115110429im_/https://ew.com/img/sign-up-bg.jpg", "https://web.archive.org/web/20181115110429im_/https://secure.gravatar.com/avatar/0dbaad4db035d8905d7589d14592c7ef?s=300&d=blank&r=g", "https://web.archive.org/web/20181115110429im_/https://ewedit.files.wordpress.com/2018/11/112408_6152b.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "https://web.archive.org/web/20181115110429im_/https://subscription-assets.timeinc.com/article-covers/2332_106821743_2017_04_07_205_thumb.jpg", "https://web.archive.org/web/20181115110429im_/https://subscription-assets.timeinc.com/current/2332_top1_205_thumb.jpg"], "top_img": "https://web.archive.org/web/20181115110429im_/https://ewedit.files.wordpress.com/2018/11/112408_6152b.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "keywords": [], "authors": ["Dalton Ross"], "canonical_link": "https://web.archive.org/web/20181115110429/https://ew.com/tv/2018/11/15/survivor-jeff-probst-david-vs-goliath-episode-8/", "title": "Survivor host Jeff Probst says no more men vs. women seasons", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "Fall TV,Jeff Probst", "news_keywords": "Fall TV,Jeff Probst", "description": "The host looks at the shifting gender dynamics on the show and weighs in on that crazy Tribal Council.", "og": {"title": "'Survivor' host Jeff Probst says no more men vs. women seasons", "type": "article", "site_name": "EW.com", "url": "https://web.archive.org/web/20181115110429/https://ew.com/tv/2018/11/15/survivor-jeff-probst-david-vs-goliath-episode-8/", "description": "Each week, host Jeff Probst will answer a few questions about the latest episode of Survivor: David vs. Goliath. ENTERTAINMENT…", "image": {"identifier": "https://web.archive.org/web/20181115110429im_/https://ewedit.files.wordpress.com/2018/11/112408_6152b.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630", "width": 1200, "height": 630}}, "pinterest": {"url": "https://ew.com/tv/2018/11/15/survivor-jeff-probst-david-vs-goliath-episode-8/", "description": "The host looks at the shifting gender dynamics on the show and weighs in on that crazy Tribal Council.", "media": "https://ewedit.files.wordpress.com/2018/11/112408_6152b.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630"}, "twitter": {"card": "summary_large_image", "url": "https://web.archive.org/web/20181115110429im_/https://ew.com/tv/2018/11/15/survivor-jeff-probst-david-vs-goliath-episode-8/", "title": "'Survivor' host Jeff Probst says no more men vs. women seasons", "description": "The host looks at the shifting gender dynamics on the show and weighs in on that crazy Tribal Council.", "site": "@ew", "image": "https://web.archive.org/web/20181115110429im_/https://ewedit.files.wordpress.com/2018/11/112408_6152b.jpg?crop=0px%2C0px%2C2700px%2C1417.5px&resize=1200%2C630"}, "fb": {"pages": 52150999700}}, "movies": [], "publish_date": 1542240000.0, "source": "https://web.archive.org", "summary": ""}