{"url": "https://www.hollywoodreporter.com/live-feed/american-horror-story-cult-finale-explained-1058035", "text": "[Warning: This story contains spoilers from the seventh- season finale of American Horror Story: Cult, “Great Again.”]\n\nOne throwaway line in the season finale of American Horror Story: Cult placed the seventh cycle of the FX horror anthology within the larger AHS world: “If she turned down Lana Winters, why the fuck would she say ‘yes’ to Rachel Maddow?”\n\nThe question came from Beverly Hope (Adina Porter) about her fellow cult survivor, Ally Mayfair-Richards (Sarah Paulson). Once again, franchise leading lady Paulson played a famous survivor, only this time she turned down an offer to be interviewed by the first famous survivor she played in the Ryan Murphy franchise — AHS‘ version of Barbara Walters, Lana Winter. Paulson played Lana in season two, Asylum, and came out of retirement to reprise her Briarcliff journalist last season in Roanoke. The finale stunt was AHS‘ most high-profile season crossover to date, solidifying how all of the seasons exist in one big, twisted universe. Though Cult also resurrected AHS villain Twisty the Clown (John Carroll Lynch) this season, callbacks to the larger AHS universe were slight.\n\nAhead of Roanoke, co-creator and showrunner Murphy confirmed what AHS viewers had long suspected, that all seasons of the franchise are, in fact, connected. When speaking to The Hollywood Reporter last year, Murphy promised of the tie-ins, “You’ll see it this season, and then you’ll really see it after this season. We lay a lot of pipe, and you’ll see it explode in seasons seven and eight.”\n\nRoanoke doubled down on Murphy’s promise with its AHS mythology nods, but now that the finale of Cult has come and gone: Did the election throw a wrench into Murphy’s plans for the larger universe?\n\n“The writers have their finger on the pulse of what’s going on,” star Evan Peters tells THR about Cult delivering a provocative and timely ending, instead of a thematic one. “The writers were ahead of the curve with the riots in Charlottesville [Va.], something Ryan has talked about. And when filming the ending, at the time it did feel relevant. Now, it’s horrible what’s happening, but it’s a good thing that women are getting their power back.”\n\nThis season documented Kai Anderson’s (Peters) rise from a basement-dwelling Trump supporter to a small-town cult leader to a candidate for Michigan’s open Senate seat. In order to accomplish that, Peters morphed into five real-life cult leaders — Charles Manson, Jim Jones, David Koresh, Marshall Applewhite and Andy Warhol — to hammer home Murphy’s point of how a man, like Donald Trump, can rise within a disenfranchised community.\n\nThe finale, titled “Great Again,” also came full circle as the women of the cult came out successful — unlike Trump vs. Clinton — in their resistance. The finale revealed a layered plan enacted by Ally, who was working with the FBI to arrest Kai. Ultimately, the two swapped roles. Kai was sentenced to prison and Ally was now running for the Senate seat he had so desired. Her campaign platform echoed Hillary Clinton’s run for president and rings even more true in the wake of the country’s current climate where women are taking back power and speaking out about stories of sexual harassment and assault.\n\n“All my life I have been told to smile. Stay quiet. Look pretty. Not to stand out from the crowd,” Ally said in a campaign ad. When her approval ratings revealed a distrust from Americans that she could get the job done in a stark Clinton parallel, she noted that the results were code for fear: “They’re scared. Isn’t it sad when a strong woman scares people more than clowns?”\n\nCult then depicted a new kind of post-election America, one different than the world it had created thus far. Though the setting was now two years after the 2016 presidential election, Ally’s first televised debate mimicked moments when Clinton would outwit Trump (“I am tired of being mansplained to,” Ally said to her male opponent). Cult then took the analogy even further when Kai managed to manipulate his way into a well-planned prison escape, and threaten Ally’s life on the debate stage — creating a much larger foe for the aspiring candidate. But the former phobia-ridden Ally was now fearless as she got to Kai’s guard first. After realizing he was duped and left holding an unloaded gun, Beverly shot and killed Kai — illustrating a shocking moment of a woman taking back her power for all other women.\n\n“I don’t know what the ending means, was it that Hillary should have won?” Peters tells tells The Hollywood Reporter about Cult‘s parallels to the election. “I thought it was a great ending. Kai should definitely be killed. Everything that he says represents evil and fear and negativity and he should definitely be stopped.”\n\nBefore Kai was killed, he told Ally, “You symbolize the hope that women will one day win an argument with their husbands. That they won’t be catcalled when they walk down the streets. That their bosses won’t talk about their tits anymore. That they’ll make just as much money as men make. That the fight is winnable…. Women can’t lead.” But Ally brought the season full circle when she recalled Kai’s earlier statement about a humiliated man: “There is something more dangerous in this world than a humiliated man: A nasty woman.”\n\nAlly emerged triumphant. A self-proclaimed Nasty Woman going on to win the Senate seat, reopen a now-thriving restaurant and happily reclaim this new life with her son. But, then, Murphy asks: at what cost?\n\nIn the final moment, it is implied that Ally has begun her own female cult in place of Kai’s all-male regime. After telling her son that she plans to meet with powerful friends to lead, “show them the way, take them to a better place — a better world,” she dons the green velvet cloak previously seen on Bebe Babbitt (Frances Conroy), the ex-girlfriend of Valerie Solanas (Lena Dunham) and the surviving member of Valerie’s SCUM Manifesto (“Society for Cutting Up Men”), in which women were instructed to kill men in order to rise to power.\n\nThe ending, an unleashing of female rage, circles back to Murphy’s promise that the season, at its core, is about identity politics and the cult of personality. Before the first episode, when the election theme was the season headline, the showrunner promised: “It’s not about Trump or Clinton. It really is about the cult of personality that can rise in a divisive society — and I hope that people can figure that out.” (Though Donna Brazile, former DNC chairwoman, did recently describe Clinton’s campaign as a “cult.”)\n\nThe darkness in the end is something Peters can put into perspective when analyzing Ally’s shift in wake of Kai’s demise. “What does that mean, now that she’s a leader of the feminist cult?” he asks. “If you have to do that darkness in order to get what you need? To get fairness, maybe you have to get dark. Is that the lesson? Is that what we’re supposed to take from that? Is that a good thing? I don’t know. Maybe you have to get angry sometimes in order to make it all come to fruition, but I don’t know if a cult is the answer. To me, the takeaway from the whole show is that cults are bad. (Laughs.)”\n\nAnd with that, Murphy — who had promised the season wasn’t only for his liberal viewers — gives his AHS audience much to think about.\n\nWhat did you think of the finale of American Horror Story: Cult? Tell THR in the comments below and keep up with all things AHS here until it returns with season eight.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/screen_shot_2017-11-14_at_12.40.14_pm_-_h_2017.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/screen_shot_2017-11-14_at_12.40.14_pm_-_h_2017.jpg?w=1296&h=730&crop=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/screen_shot_2017-11-14_at_12.40.14_pm_-_h_2017.jpg?w=1024", "keywords": [], "authors": ["Jackie Strause"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/american-horror-story-cult-finale-explained-1058035/", "title": "‘American Horror Story’: How ‘Cult’ Went Beyond Trump vs. Clinton", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Plus, how 'Cult' ties in with all the other seasons of Ryan Murphy's FX anthology.", "news_keywords": "American Horror Story, American Horror Story: Cult, autoplay", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Jackie Strause", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1058035, "title": "'American Horror Story': How 'Cult' Went Beyond Trump vs. Clinton", "published_at": "2017-11-14 20:00:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/screen_shot_2017-11-14_at_12.40.14_pm_-_h_2017.jpg?w=1024", "comment_count": 0, "tags": "autoplay", "topics": "TV News", "body": "[Warning: This story contains spoilers from the seventh- season finale of American Horror Story: Cult, \"Great Again.\"]\r\nOne throwaway line in the season finale of American Horror Story: Cult placed the seventh cycle of the FX horror anthology within the larger AHS world: \"If she turned down Lana Winters, why the fuck would she say 'yes' to Rachel Maddow?\"\r\nThe question came from Beverly Hope (Adina Porter) about her fellow cult survivor, Ally Mayfair-Richards (Sarah Paulson). Once again, franchise leading lady Paulson played a famous survivor, only this time she turned down an offer to be interviewed by the first famous survivor she played in the Ryan Murphy franchise — AHS' version of Barbara Walters, Lana Winter. Paulson played Lana in season two, Asylum, and came out of retirement to reprise her Briarcliff journalist last season in Roanoke. The finale stunt was AHS' most high-profile season crossover to date, solidifying how all of the seasons exist in one big, twisted universe. Though Cult also resurrected AHS villain Twisty the Clown (John Carroll Lynch) this season, callbacks to the larger AHS universe were slight.\r\nAhead of Roanoke, co-creator and showrunner Murphy confirmed what AHS viewers had long suspected, that all seasons of the franchise are, in fact, connected. When speaking to The Hollywood Reporter last year, Murphy promised of the tie-ins, \"You'll see it this season, and then you'll really see it after this season. We lay a lot of pipe, and you'll see it explode in seasons seven and eight.\"\r\nRoanoke doubled down on Murphy's promise with its AHS mythology nods, but now that the finale of Cult has come and gone: Did the election throw a wrench into Murphy's plans for the larger universe?\r\n\"The writers have their finger on the pulse of what’s going on,\" star Evan Peters tells THR about Cult delivering a provocative and timely ending, instead of a thematic one. \"The writers were ahead of the curve with the riots in Charlottesville [Va.], something Ryan has talked about. And when filming the ending, at the time it did feel relevant. Now, it's horrible what's happening, but it's a good thing that women are getting their power back.\"\r\nThis season documented Kai Anderson's (Peters) rise from a basement-dwelling Trump supporter to a small-town cult leader to a candidate for Michigan's open Senate seat. In order to accomplish that, Peters morphed into five real-life cult leaders — Charles Manson, Jim Jones, David Koresh, Marshall Applewhite and Andy Warhol — to hammer home Murphy's point of how a man, like Donald Trump, can rise within a disenfranchised community.\r\n\r\nThe finale, titled \"Great Again,\" also came full circle as the women of the cult came out successful — unlike Trump vs. Clinton — in their resistance. The finale revealed a layered plan enacted by Ally, who was working with the FBI to arrest Kai. Ultimately, the two swapped roles. Kai was sentenced to prison and Ally was now running for the Senate seat he had so desired. Her campaign platform echoed Hillary Clinton's run for president and rings even more true in the wake of the country's current climate where women are taking back power and speaking out about stories of sexual harassment and assault.\r\n“All my life I have been told to smile. Stay quiet. Look pretty. Not to stand out from the crowd,\" Ally said in a campaign ad. When her approval ratings revealed a distrust from Americans that she could get the job done in a stark Clinton parallel, she noted that the results were code for fear: \"They’re scared. Isn’t it sad when a strong woman scares people more than clowns?\"\r\nCult then depicted a new kind of post-election America, one different than the world it had created thus far. Though the setting was now two years after the 2016 presidential election, Ally's first televised debate mimicked moments when Clinton would outwit Trump (\"I am tired of being mansplained to,\" Ally said to her male opponent). Cult then took the analogy even further when Kai managed to manipulate his way into a well-planned prison escape, and threaten Ally's life on the debate stage — creating a much larger foe for the aspiring candidate. But the former phobia-ridden Ally was now fearless as she got to Kai's guard first. After realizing he was duped and left holding an unloaded gun, Beverly shot and killed Kai — illustrating a shocking moment of a woman taking back her power for all other women.\r\n\r\n\"I don't know what the ending means, was it that Hillary should have won?\" Peters tells tells The Hollywood Reporter about Cult's parallels to the election. \"I thought it was a great ending. Kai should definitely be killed. Everything that he says represents evil and fear and negativity and he should definitely be stopped.\"\r\nBefore Kai was killed, he told Ally, \"You symbolize the hope that women will one day win an argument with their husbands. That they won’t be catcalled when they walk down the streets. That their bosses won’t talk about their tits anymore. That they’ll make just as much money as men make. That the fight is winnable…. Women can’t lead.\" But Ally brought the season full circle when she recalled Kai's earlier statement about a humiliated man: \"There is something more dangerous in this world than a humiliated man: A nasty woman.\"\r\n\r\n\tWhat’s more dangerous than a humiliated man? #AHSCult pic.twitter.com/vZAfJm8yU1\r\n\t— AmericanHorrorStory (@AHSFX) November 15, 2017\r\nAlly emerged triumphant. A self-proclaimed Nasty Woman going on to win the Senate seat, reopen a now-thriving restaurant and happily reclaim this new life with her son. But, then, Murphy asks: at what cost?\r\nIn the final moment, it is implied that Ally has begun her own female cult in place of Kai's all-male regime. After telling her son that she plans to meet with powerful friends to lead, \"show them the way, take them to a better place — a better world,\" she dons the green velvet cloak previously seen on Bebe Babbitt (Frances Conroy), the ex-girlfriend of Valerie Solanas (Lena Dunham) and the surviving member of Valerie's SCUM Manifesto (\"Society for Cutting Up Men\"), in which women were instructed to kill men in order to rise to power.\r\nThe ending, an unleashing of female rage, circles back to Murphy's promise that the season, at its core, is about identity politics and the cult of personality. Before the first episode, when the election theme was the season headline, the showrunner promised: \"It's not about Trump or Clinton. It really is about the cult of personality that can rise in a divisive society — and I hope that people can figure that out.\" (Though Donna Brazile, former DNC chairwoman, did recently describe Clinton's campaign as a \"cult.\")\r\nThe darkness in the end is something Peters can put into perspective when analyzing Ally's shift in wake of Kai's demise. \"What does that mean, now that she’s a leader of the feminist cult?\" he asks. \"If you have to do that darkness in order to get what you need? To get fairness, maybe you have to get dark. Is that the lesson? Is that what we’re supposed to take from that? Is that a good thing? I don’t know. Maybe you have to get angry sometimes in order to make it all come to fruition, but I don’t know if a cult is the answer. To me, the takeaway from the whole show is that cults are bad. (Laughs.)\"\r\nAnd with that, Murphy — who had promised the season wasn't only for his liberal viewers — gives his AHS audience much to think about.\r\n\r\n\t#AHSCult pic.twitter.com/FNIXwecs0o\r\n\t— AmericanHorrorStory (@AHSFX) November 15, 2017\r\n\r\nWhat did you think of the finale of American Horror Story: Cult? Tell THR in the comments below and keep up with all things AHS here until it returns with season eight.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘American Horror Story’: How ‘Cult’ Went Beyond Trump vs. Clinton", "url": "https://www.hollywoodreporter.com/tv/tv-news/american-horror-story-cult-finale-explained-1058035/", "description": "Plus, how ‘Cult’ ties in with all the other seasons of Ryan Murphy’s FX anthology.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/screen_shot_2017-11-14_at_12.40.14_pm_-_h_2017.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-11-14T20:00:00+00:00", "modified_time": "2018-07-26T12:28:18+00:00"}, "twitter": {"site": "@thr", "creator": "@jackiedstrause", "card": "summary_large_image", "title": "‘American Horror Story’: How ‘Cult’ Went Beyond Trump vs. Clinton", "description": "Plus, how ‘Cult’ ties in with all the other seasons of Ryan Murphy’s FX anthology.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/screen_shot_2017-11-14_at_12.40.14_pm_-_h_2017.jpg?w=1296"}}, "movies": [], "publish_date": 1510689600.0, "source": "https://www.hollywoodreporter.com", "summary": ""}