{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/11/21/i-am-not-okay-cbs-this-mornings-remarkable-response-to-the-charlie-rose-allegations/", "text": "After the allegations of sexual harassment by Charlie Rose, his colleagues at \"CBS This Morning\" opened up about their feelings of shock and betrayal. (Video: Jenny Starrs/The Washington Post)\n\nGift Article Share\n\nGayle King had slept less than two hours. At times, Norah O’Donnell seemed on the verge of tearing up. Nevertheless, the “CBS This Morning” anchors were there, seated at the glass table where they had hosted the show almost every weekday morning for the past five years. Wp Get the full experience. Choose your plan ArrowRight A chair for Charlie Rose, their third co-host, was missing.\n\nRose, of course, was absent from Tuesday’s edition of the show he had been a part of since its inception: CBS News suspended him shortly after The Washington Post published an extensive report detailing alleged unwanted sexual advances toward women by the 75-year-old broadcaster. The network announced his firing Tuesday afternoon, and PBS and Bloomberg soon followed suit.\n\nOn the morning after the newsman became the newsmaker, the sexual harassment allegations against Rose were the top story on “CBS This Morning.”\n\n“We’re going to begin with news affecting all of us,” O’Donnell said matter-of-factly at the top of the program.\n\nAdvertisement\n\n“This one does hit close to home,” correspondent Bianna Golodryga said in introducing a story about the allegations.\n\nThe “CBS This Morning” package recapped The Post’s reporting: Eight women, who were either employees or prospective employees of Rose’s, told The Post that he made unwanted sexual advances toward them between the late 1990s and 2011.\n\nThose advances included lewd phone calls, walking around naked in their presence, or groping their breasts, buttocks or genital areas, the women said. CBS said that it had spoken to one of Rose’s accusers and that she declined to go on camera but confirmed the accuracy of the report.\n\n“As tough as this story is, it’s important that we cover it,” Golodryga said.\n\nAnd then, in a remarkable segment, Rose’s broadcast partners slipped out of their newswoman roles and spoke as . . . people, full of anger and bewilderment and betrayal.\n\nAdvertisement\n\n“This is a moment that demands a frank and honest assessment about where we stand and more generally the safety of women,” O’Donnell said. “Let me be very clear: There is no excuse for this alleged behavior. It is systematic and pervasive.”\n\nShe added: “This has to end. This behavior is wrong. Period.”\n\nSaid King: “I really am reeling. I got one hour and 42 minutes of sleep last night. Both my son and my daughter called me; Oprah called me and said, ‘Are you okay?’ I am not okay.”\n\nThe Post article, she said, “was deeply disturbing, troubling and painful for me to read.”\n\nOn Nov. 21, \"CBS This Morning\" co-hosts Norah O'Donnell and Gayle King weighed in on the allegations against Charlie Rose. (Video: Reuters)\n\nKing noted that she and Rose “enjoyed a friendship and partnership.”\n\nNow, she said: “I’m really struggling. . . . What do you say, when someone that you deeply care about has done something that’s so horrible? How do you wrap your brain around that?”\n\nAdvertisement\n\nShe added: “I am deeply rocked by this.”\n\nRose, King said, “doesn’t get a pass, because I can’t stop thinking about the anguish of these women . . . that and the pain that they’re going through.”\n\nKing noted that she hadn’t yet spoken to Rose but that she intended to call him at some point on Tuesday.\n\nO’Donnell said she hadn’t spoken with him, either.\n\nRose had co-hosted “CBS This Morning” since the show’s launch in 2012 and was a contributing correspondent for the network’s Sunday night show, “60 Minutes.”\n\nHis suspension was announced less than 90 minutes after The Post’s story published. The suspension was acknowledged Monday on “CBS Evening News,” where interim anchor Anthony Mason said “the wave of sexual abuse allegations we’ve been reporting from Hollywood to Washington have now touched CBS News.”\n\nAdvertisement\n\n“Despite Charlie’s important journalistic contribution to our news division, there is absolutely nothing more important, in this or any organization, than ensuring a safe, professional workplace — a supportive environment where people feel they can do their best work,” CBS News President David Rhodes wrote in a staff memo. “We need to be such a place.”\n\nRose was one of the best-regarded names in TV news. His 2013 interview with Syrian President Bashar al-Assad won him both an Emmy and a Peabody Award, and in 2015 he received the Walter Cronkite Excellence in Journalism Award.\n\nFollowing The Post’s report, PBS and Bloomberg said they were suspending distribution of Rose’s namesake interview program, which is produced by Charlie Rose Inc., an independent television production company. On Tuesday afternoon, PBS, which had aired “Charlie Rose” since its 1991 debut, said it had “terminated its relationship” with Rose.\n\nAdvertisement\n\n“PBS expects all the producers we work with to provide a workplace where people feel safe and are treated with dignity and respect,” the network said in a statement. Less than 30 minutes later, Bloomberg said it had ended its rebroadcast agreement for “Charlie Rose.”\n\nIn a statement provided to The Post on Monday — and later posted on social media — Rose said: “I deeply apologize for my inappropriate behavior. I am greatly embarrassed. I have behaved insensitively at times, and I accept responsibility for that, though I do not believe that all of these allegations are accurate. I always felt that I was pursuing shared feelings, even though I now realize I was mistaken.”\n\nCharlie Rose, host of “Charlie Rose” and “CBS This Morning,” has been accused by multiple women of unwanted sexual advances. (Video: Jenny Starrs/The Washington Post)\n\nThis post has been updated.\n\nMore reading:\n\nGiftOutline Gift Article", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=http://img.washingtonpost.com/rf/image_960w/2010-2019/Wires/Videos/201711/Reuters/Images/2017-11-21T153856Z_1_OV78FBMCF_RTRMADC_0_PEOPLE-CHARLIEROSE-CBS-ROUGH-CUT.jpg&w=1440"], "top_img": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://img.washingtonpost.com/rf/image_960w/2010-2019/Wires/Videos/201711/Reuters/Images/2017-11-21T153856Z_1_OV78FBMCF_RTRMADC_0_PEOPLE-CHARLIEROSE-CBS-ROUGH-CUT.jpg&w=1440", "keywords": [], "authors": ["J. Freedom Du Lac", "Amy B Wang", "Marwa Eltagouri"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/11/21/i-am-not-okay-cbs-this-mornings-remarkable-response-to-the-charlie-rose-allegations/", "title": "‘I am not okay’: The remarkable response to the Charlie Rose allegations, from his CBS colleagues", "meta_data": {"description": "CBS fired Rose after The Post detailed alleged unwanted sexual advances toward eight women by the veteran newsman.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/11/21/i-am-not-okay-cbs-this-mornings-remarkable-response-to-the-charlie-rose-allegations/", "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://img.washingtonpost.com/rf/image_960w/2010-2019/Wires/Videos/201711/Reuters/Images/2017-11-21T153856Z_1_OV78FBMCF_RTRMADC_0_PEOPLE-CHARLIEROSE-CBS-ROUGH-CUT.jpg&w=1440", "title": "‘I am not okay’: The remarkable response to the Charlie Rose allegations, from his CBS colleagues", "description": "CBS fired Rose after The Post detailed alleged unwanted sexual advances toward eight women by the veteran newsman."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "‘I am not okay’: The remarkable response to the Charlie Rose allegations, from his CBS colleagues", "description": "CBS fired Rose after The Post detailed alleged unwanted sexual advances toward eight women by the veteran newsman."}, "last_updated_date": "2021-12-03T05:38:07.637Z", "article": {"published_time": "2017-11-21T12:34:49.000Z", "modified_time": "2021-12-03T05:38:07.637Z", "section": "Arts & Entertainment", "content_tier": "metered"}, "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1", "next-head-count": 71, "apple-itunes-app": "app-id=352509417, app-argument=https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/11/21/i-am-not-okay-cbs-this-mornings-remarkable-response-to-the-charlie-rose-allegations/"}, "movies": [], "publish_date": 1511222400.0, "source": "https://www.washingtonpost.com", "summary": ""}