{"url": "https://www.huffingtonpost.com/entry/divas-live-20th-anniversary_us_5acf57f6e4b0701783ac229a", "text": "The New York air was crisp and calm on the night of April 14, 1998. But inside the Beacon Theater on Manhattan’s Upper West Side, a fire blazed. The faithful had gathered. A religious ceremony was to take place. Six deities waited in the wings, but they needn’t proselytize upon taking the stage. Every sane soul had already kneeled at their altar, and would do so again for several years to come.\n\nThe event, of course, was VH1′s “Divas Live.” The gods were pop prima donnas: Aretha Franklin, Mariah Carey, Céline Dion, Gloria Estefan, Shania Twain and Carole King who, separately and together, performed numbers from their respective catalogs. The worship service was a ratings smash, so the following year, VH1 increased the cause for hosannas. Whitney Houston, Tina Turner, Cher and Brandy headlined “Divas Live ’99,” joined by Mary J. Blige, Chaka Khan, LeAnn Rimes, Faith Hill and “very special guest” Elton John. It became the highest-rated program in the network’s history, a grail for both VH1 and the world at large.\n\nAdvertisement\n\nAs almost any large-scale production can attest, putting at least half a dozen superstars on the same bill doesn’t happen without a few hitches ― and altercations ― along the way. So, ahead of the event’s 20th anniversary, I called up five producers who put together the first three “Divas” shows (2000′s was a Diana Ross tribute featuring Carey, Hill, Donna Summer, Destiny’s Child and RuPaul) to see just how much gossip I could marshal about these glittery exaltations.\n\nGrab some popcorn. Or a little holy water.\n\nGloria Estefan, Mariah Carey, Aretha Franlin, Carole King, Céline Dion and Shania Twain perform at \"Divas Live\" 20 years ago. KMazur via Getty Images\n\n1. The Origins, Or: On The First Day, God Created Céline\n\nHeading into 1998, a VH1 executive by the name of Wayne Isaak, who’d spent more than a decade as a publicity guru at A&M Records, was courting Céline Dion for a “big concert event” that would appeal to the network’s core audience: adults 24 to 35, particularly women, who’d made insidery fodder like “Behind the Music,” “Storytellers” and “Crossroads” appointment viewing.\n\nAround the same time, Isaak and the rest of VH1′s original-programming team was in need of a tentpole to replace the network’s eponymous Honors special, a lackluster ceremony that, between 1994 and 1997, saluted musicians’ philanthropic work. Conveniently, the network had just launched the Save the Music Foundation, a nonprofit that donated instruments to public schools. Top brass seized the opportunity to raise funds for the organization and stage an all-star revue.\n\nAdvertisement\n\nIsaak knew he could get Dion, but Lauren Zalaznick, a former marketing whiz who would go on to run Bravo, pushed for a franchise that would serve as a brand unto itself. So Isaak pitched an idea called “Three Divas,” a twist on the popular opera group known as the Three Tenors. The team thought to capitalize on the banner moment that women in music were enjoying. Sarah McLachlan had recently inaugurated Lilith Fair. Missy Elliott and Lil’ Kim were eating up the hip-hop scene. At the female singer-songwriter apex sat figures like Alanis Morissette and Tori Amos. Madonna and Lauryn Hill were on the cusp of releasing career-defining records. The 1999 Grammys would boast a rare all-female Album of the Year roster.\n\nIsaak pitched Dion on the idea of joining Aretha Franklin and Mariah Carey for “Three Divas,” to which she apparently gave her resounding approval. With that, the concept quickly snowballed. What if we add Gloria Estefan, Isaak asked. “Of course,” everyone responded. And how about Shania Twain? Well, that was a bit iffier.\n\nTwain had a couple of modest pop hits to her name, but she was still predominately a country draw. With her third album, “Come On Over,” released to widespread acclaim in November 1997, her record label was working to turn her into a mainstream crossover virtuoso ― a prospect aided by VH1, which put Twain’s videos in frequent rotation. But she wasn’t quite there yet when Isaak tried to convince his colleagues to place her in the same lineup as Franklin, Carey, Dion and Estefan.\n\n“I didn’t want Shania Twain,” Zalaznick recalled. “I didn’t think she fit the bill as a diva. But he really convinced me that she was going to be the biggest artist of the year that year, and I think he was right.”\n\nBy the time “Divas Live” aired in April, Isaak’s premonition had come true. “You’re Still the One” was a mega-smash, turning Twain into a household name and giving her the third most popular song of 1998, per Billboard’s year-end chart. In fact, Twain’s segment was the highest-rated quarter-hour of the entire “Divas” broadcast, according to Isaak.\n\nAdvertisement\n\nOnce the lineup was intact ― veteran producer Ken Ehrlich recruited Carole King as a last-minute elder-stateswoman addition ― “Three Divas” shifted to “Divas Live.” As presented in the marketing, the women were on equal footing: The poster was designed so that each singer’s head was exactly the same size, down to a millimeter, according to Zalaznick. That helped to curb managers’ hesitations about the word “diva,” a moniker the producers insisted was meant to be empowering. “We guaranteed them we’d be friendly, that we wouldn’t be too acerbic or make fun of them,” Isaak said.\n\nAs such, a genre-agnostic jamboree was born. “In a weird way, we predated the casting of ‘The Voice,’ only in the sense that we were trying to take from each of the biggest genres, which was risky because, like the Grammys, if it’s a show for absolutely everybody sometimes you run the risk that it’s a show for nobody,” Zalaznick said. “We decided it was our best shot at being the most appealing, with the most chances for amazing duets.”\n\nMariah Carey and Aretha Franklin at \"Divas Live.\" Jack Vartoogian/Getty Images via Getty Images\n\n2. Lights, Cameras, Drama!\n\nAll the producers I spoke to agree that piecing together the first “Divas” slate was a cinch. But staging the actual show, which business honcho Jay Peterson estimates cost a hefty $2 million, proved more exhaustive.\n\nWhich is to say: Configuring six different artists’ accouterments was demanding. Rehearsals were a bitch. Each singer ― none of whom got paid for her appearance ― brought her own band, so the set had to be taken apart during commercial breaks. Personal assistants and publicists were flocking throughout the Beacon Theater during the few days before the telecast; Carey’s gofer stayed by her side, holding a bottle of Evian in one hand and a box of tissues in the other, according to Sean Murphy, a producer tasked with sorting out the “nuts and bolts” of the broadcast.\n\nAdvertisement\n\nIn addition to everyone’s solo performance, Carey joined Franklin’s set for “Chain of Fools,” and Dion, Estefan and Twain joined King for a tender “You’ve Got a Friend” collaboration, during which they sat around King’s piano as if conjuring a modern-day “Kumbaya.”\n\nThe production built toward a grand finale that united all the ladies, essentially leaving them to out-belt one another. They performed ”(You Make Me Feel Like) A Natural Woman” and the gospel anthem “Testimony,” a spectacle better described as Aretha Franklin and her five backup singers. Dion, a freshly minted icon thanks to the recent phenomenon that was “My Heart Will Go On,” was the only one who had the chutzpah to try to eclipse Franklin, and it’s a phenomenon to behold.\n\nPreparing the pageant to go live was, in no short order, hectic ― especially by the time Franklin (“Miss Franklin,” as she apparently insisted everyone call her) stormed offstage and threatened not to return.\n\nEvery producer I spoke to related this incredible anecdote, to the point where “I assume you’ve heard the Aretha story” became a common refrain. There’s some dispute as to whether the episode occurred on the day of the show or the day before. Either way, Franklin, who’d taken a bus from Detroit because she famously refuses to fly, had arrived for rehearsals with a firm dictum, via her management: Turn off the building’s air conditioning when Aretha performs; it’s not good for her vocal chords. “‘Miss Franklin must have the air conditioning off,’” Zalaznick said, reciting the mandate she and her cohort consistently heard.\n\nBut when Franklin stepped onstage, she stopped in her tracks. “Please, everybody be quiet,” she commanded, according to Isaak. Holding her hand up to a vent, Franklin realized the AC was indeed running. “She threw a hissy fit and walked out of the backstage into a car and left,” Isaak said.\n\nAdvertisement\n\nAccounts vary as to why Franklin’s ventilation request wasn’t granted. According to Murphy’s telling, the Beacon Theater just so happened to be testing the air-conditioning system that day. From Zalaznick’s perspective, the AC actually was off and the room had turned into a sauna ― “the other performers were horrified” by the temperature, she recalled ― by the time Franklin stormed away. Regardless, no one was sure whether Franklin would be back for the live show. Frantic phone calls ensued. People licked their fingers and held them in the air, looking for encroaching drafts. Eventually, the producers were informed that Franklin had gone to her hotel and was being fitted for dresses, a sign that she would, in fact, perform as scheduled.\n\n“Things were coming down from Mount Sinai,” Zalaznick joked. “We didn’t know [if she’d return], and then all of a sudden the clouds parted, the tablets were delivered, and suddenly we knew. To me, it felt that mysterious and insane.”\n\nBut there was still one problem. “She’s eating powdered donuts, and she’s getting powdered sugar all over the dresses,” the show’s stylist, Cary Fetman, who was fitting Franklin, apparently told Murphy. (Representatives for Franklin did not respond to multiple requests for comment.)\n\nPowered sugar or not, Franklin did, of course, turn up, bringing down the house in what became a de facto tribute to her decades-long tenure. While introducing Carey for “Chain of Fools,” she even landed a possible dig about the debacle: “Now, a little earlier in the evening, we didn’t get a chance to rehearse, so my newest girlfriend came in my trailer, and we sat in the back and we talked a little girl talk.”\n\n“I think we put the house AC on and froze it as best we could,” Zalaznick said. “And I’m telling you I believe that we cut the AC before Aretha Franklin came out to perform, and maybe again for the finale. Or maybe we said we did but we didn’t.”\n\nAdvertisement\n\nBrandy, Faith Hill, Chaka Khan, Whitney Houston, Mary J. Blige and LeAnn Rimes at \"Divas Live '99.\" Jack Vartoogian/Getty Images via Getty Images\n\n3. Bigger Wheels Keep On Turnin’\n\nBy April 15, 1998, a franchise was born. “You know what it’s like: It’s America ― you’ve got to do more,” Isaak said. Zalaznick agreed: “We went crazy,” she said of 1999′s edition. Jeff Gaspin, a well-appointed producer who had green-lighted “Pop-Up Video,” doubled down: “I think we were booking any female artist who had presence. It became about quantity at that point.”\n\nTo plan the second go-round, producers started with the “Mount Rushmore” of contemporary divas: Tina Turner signed on first (after some initial hesitancy because she wasn’t touring at the moment), and Whitney Houston, Cher and Brandy quickly followed as co-headliners, with Houston, who was in the midst of a musical renaissance, serving as the show’s “anchor,” much as Franklin had the previous year. The only major diva VH1 didn’t manage to get, according to the producers’ collective recollection, was Madonna, who’d been a key player at the flashy 1998 VH1 Fashion Awards, where she received a tribute prize.\n\n“So whose idea was that ‘Divas’ thing,” Madonna apparently asked Isaak while prepping for the Fashion Awards at her home. When he admitted responsibility, “she just turned away with a repulsive sort of look,” he said. So Isaak knew better than to “beg” Madonna’s management, just like he knew better than to ask Sheryl Crow, who at the time didn’t want to be held in any sort of “diva” regard. (Crow was more of a Lilith Fair queen.)\n\nToday, Zalaznick has regrets. “We didn’t have Madonna? Heresy!” she said. “What was I thinking?”\n\nOnce the “younger” divas ― LeAnn Rimes, Faith Hill and Mary J. Blige (as well as Chaka Khan and Elton John) ― were added to the slate, the producers opted to stuff the presentation with sizzling duos and trios. John and Turner performed “The Bitch Is Back” (a John song that Turner had covered in 1978), after which Cher joined them for “Proud Mary.” Rimes united with John for “Written in the Stars,” their hit single from the musical “Aida.” Brandy and Hill teamed up for the former’s cover of Bryan Adams’ melodramatic ”(Everything I Do) I Do It For You.” Houston welcomed her pal Blige for “Ain’t No Way,” and her daughter, Bobbi Kristina, sat onstage and recited a few lines on “My Love Is Your Love.” Brandy, Hill, Blige and Rimes joined Houston and Kahn for “I’m Every Woman,” a finale spectacle better described as Whitney Houston and her five backup singers.\n\nAdvertisement\n\nBut collaborations can be complicated things. For example, did you know Elton John and Tina Turner were arranging a joint tour, until a fallout during “Divas Live” rehearsals changed those plans? That’s another saga that every producer remembers.\n\nWhile running through “The Bitch Is Back” and “Proud Mary,” with Turner centerstage at the microphone and John sitting at a piano upstage, Turner offered some notes on John’s instrumentals. As the story goes, the two went back and forth, with Turner asking him to play “Proud Mary” differently. “He gets up and slaps the piano and goes, ‘I am not just some fucking piano player’ and storms offstage,” Murphy said. “He had to be talked down off the ledge. That took about half a day. He was pissed. We’d done other shows with Elton John, and you always wonder: Are we going to get the good Elton or the bad Elton? He’s very mercurial. He was in a snit that day, so when Tina started talking to him like he was just an accompanist, he lost his shit.”\n\nEventually, Turner went to John’s trailer. Exactly what went on inside is anyone’s guess, but soon enough the trailer door opened and the duo returned to the theater. The show would go on. John apologized to the crew, according to Murphy, but in the interim, he and Turner had nixed the tour they were planning to announce after “Divas Live.” Turner addressed the incident during a CBS interview in 2000: “I made a mistake when I needed to show him how to play ‘Proud Mary.’ The mistake is you don’t show Elton John how to play his piano.” (A representative for John did not respond to our request for comment.)\n\nRewatching the performance today knowing the duo was rebounding from an altercation, Turner and John’s acumen is masterful. There’s no indication they’d ever quarreled. John mostly yields the stage to Turner ― he wasn’t a headliner, after all ― and kisses her hand at the end, a sendoff for the ages.\n\nAdvertisement\n\nFeuds be damned, the ratings were dynamite. Disciples had flocked to witness their priestesses’ sermons. After 1998′s “Divas Live” had become the highest-rated program in the network’s history, 1999′s broke that record, netting a reported 2.4 million eyeballs on premiere night.\n\nFaith Hill, Diana Ross and Mariah Carey at \"VH1 Divas 2000: A Tribute to Diana Ross.\" Frank Micelotta Archive via Getty Images\n\n4. The Rest Is History\n\nBy 2000, VH1 had branded “Divas” successfully enough to break slightly from its hodgepodge format, turning the third iteration into an official Diana Ross tribute. Immediately, the event lost some of its pizazz. The producers nixed the live broadcast, which proved to be a blessing because it took a taxing five and a half hours to tape, partly because Ross (referred to specifically as “Miss Ross,” per her mandate) took 20 minutes to change costumes between each number, according to Murphy. Fed-up audience members started leaving. The telecast scaled back on collaborations ― the highlight was Carey and Ross, who sailed through “Baby Love” and “Stop! In The Name Of Love” ― and squandered its fount of religious blessings.\n\nThe producers generally agree the Ross salute was a logistical mess. Ross had requested a sound system that proved glitchy, and she walked through the audience mid-performance, even though the cameras and lights weren’t configured for such mobility. Regardless, the ratings remained impressive. Producers resoundingly agree that Donna Summer and Faith Hill were a delight to work with. Meanwhile, Destiny’s Child, still a year away from releasing “Survivor,” was thrilled just to be included. (It’s nice to hear some pleasant gossip every now and then!) “Destiny’s Child did the show, and they were so excited to do it that Beyoncé told me, ‘We’ve been rehearsing in our hotel room for the last two weeks,’” Isaak said. “That was the secret sauce: to get people to do something they’re really into.”\n\nFrom there, some of the “Divas Live” mojo waned. 2001 was an Aretha Franklin tribute ― been there, done that ― and subsequent years featured folks who were decidedly not divas: Kid Rock, Backstreet Boys, Bobby Brown. Still, the franchise managed to maintain the delicious team-ups: Dixie Chicks and Stevie Nicks doing “Landslide,” Beyoncé and Jewel rolling through “Proud Mary,” Patti LaBelle joining Jessica Simpson and Cyndi Lauper for “Lady Marmalade.”\n\nAdvertisement\n\n“Divas” ran consecutively through 2004, then took a break until 2009, when the lineup gravitated less toward classic chanteuses and more toward contemporary hitmakers. Between 2009 and 2012, Adele, Katy Perry, Kelly Clarkson, Miley Cyrus, Nicki Minaj, Sugarland, Florence Welch and Ciara were among the headliners. And while nothing could recapture the magic of first two “Divas” renditions, in the post-Lilith Fair era it remained one of the few destinations for A-list women converging for a diverse musical extravaganza. (“Divas” returned in 2016 for a holiday special starring Mariah Carey, Chaka Khan, Vanessa Williams, Patti LaBelle and Teyana Taylor.)\n\nFurthermore, today’s overstuffed pop-culture landscape can’t turn an event like “Divas Live” into the miracle it was in the ’90s: Artists don’t rely as heavily on televised promotional appearances, and a network like VH1 can’t sink millions of dollars on broadcasts that aren’t guaranteed to generate exemplary ratings.\n\n“These things are lost to history sometimes,” Zalaznick said. “The straightest and the most long-standing remain in the historical canon, but not these types of experiences, which have incredible value for many, many reasons.”", "images": ["https://img.huffingtonpost.com/asset/633fe09725000039004f7391.jpeg?cache=Zde865g5mA&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/5ad0a0a31f0000270616d128.jpeg?ops=scalefit_1280_noupscale", "https://img.huffingtonpost.com/asset/633e9cf12500003e0056675a.jpeg?cache=YtqCdKhS5j&ops=240_240", "https://img.huffingtonpost.com/asset/633ca01d2400001e006e5afa.png?cache=0pMs7UTFAN&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633c558f2300006d00deba89.jpeg?cache=lvKVxhEBDV&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633d549a2500001f0055793a.jpg?cache=l2c5SSetBX&ops=240_240", "https://img.huffingtonpost.com/asset/633c3f6f2600001e00777202.jpg?cache=M5uHMsHovW&ops=240_240", "https://img.huffingtonpost.com/asset/633c036e2600001b007771a1.png?ops=240_240", "https://img.huffingtonpost.com/asset/634032832600001f005b83be.jpg?cache=of3P4Ovoa9&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/63404c7b2500001f004f73fe.jpg?cache=lNas9Q4Wll&ops=240_240", "https://img.huffingtonpost.com/asset/633c558f2300006d00deba89.jpeg?cache=lvKVxhEBDV&ops=240_240", "https://sb.scorecardresearch.com/p?c1=2&c2=6723616&c3=&c4=&c5=&c6=&c15=&cj=1", "https://img.huffingtonpost.com/asset/633d37552400001b006350e7.jpg?cache=MEdewNlhxa&ops=240_240", "https://img.huffingtonpost.com/asset/633f1083250000640056680d.jpeg?cache=W7SNr5vIpL&ops=240_240", "https://img.huffingtonpost.com/asset/633d4beb2400003400635105.jpeg?cache=Y9jJNdeJCX&ops=240_240", "https://img.huffingtonpost.com/asset/633ebd2a250000380056677f.jpg?cache=2kspG3Phfn&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/634007802500001f0079bec6.jpg?cache=cfcrG2pMn0&ops=240_240", "https://img.huffingtonpost.com/asset/633bf82f27000034005702da.jpeg?cache=ySfBBddvyN&ops=240_240", "https://img.huffingtonpost.com/asset/633e9cf12500003e0056675a.jpeg?cache=YtqCdKhS5j&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/634051842600005f005b83ed.jpeg?ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633dde6a25000035005579d9.jpeg?cache=CbA9J4gdT9&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633d66ab240000cb026e5bae.jpeg?ops=240_240", "https://img.huffingtonpost.com/asset/633c13702600001b0082592d.jpg?cache=RQcnavZE6Q&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/634155432500005f00aa33b4.jpg?cache=HCnGNCDvoe&ops=240_240", "https://img.huffingtonpost.com/asset/633b22052600006200777129.jpeg?cache=hdPgbttus7&ops=240_240", "https://img.huffingtonpost.com/asset/633ddf482600005d0072a718.jpeg?cache=ToA0mdQ7jh&ops=240_240", "https://img.huffingtonpost.com/asset/589b745d25000032080b7c7d.png?cache=5G3yMDcXze&ops=210_120", "https://img.huffingtonpost.com/asset/634007802500001f0079bec6.jpg?cache=cfcrG2pMn0&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633d876c2500003700557965.jpg?cache=haBGsiVmvX&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633afcf62600001e007770fd.jpg?cache=b8W6udTaGF&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633d40e924000020006350f2.jpg?cache=fUPV2S9S4p&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633e7ce52600003a00a09bac.jpg?cache=5Z719xMgme&ops=240_240", "https://img.huffingtonpost.com/asset/630496f02500003100245a26.jpeg?cache=XtvON3KUfF&ops=240_240", "https://img.huffingtonpost.com/asset/630496f02500003100245a26.jpeg?cache=XtvON3KUfF&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633c48192300002f00deba7c.jpeg?cache=DC9LdKuE0r&ops=240_240", "https://img.huffingtonpost.com/asset/634082b82200002e006b4618.jpeg?cache=vKSrxpYsjm&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633b6602240000580088df18.jpeg?cache=MLH91tw03g&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/634007b2250000360079bec8.jpeg?ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633bd62926000059008258ec.jpeg?cache=E3illSdpgs&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/63414e5627000020007084dd.png?ops=240_240", "https://img.huffingtonpost.com/asset/633c3f6f2600001e00777202.jpg?cache=M5uHMsHovW&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633c1ffb2700006300570301.jpeg?cache=HieNdnG2LU&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/6340359b2600001a005b83c3.jpg?cache=WSbcF7Ea6S&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/5ad0a103200000d30ceb4995.jpeg?ops=scalefit_1280_noupscale", "https://img.huffingtonpost.com/asset/633c2a7226000063007771d4.jpeg?cache=Wm8gx8nUja&ops=240_240", "https://img.huffingtonpost.com/asset/633bd62926000059008258ec.jpeg?cache=E3illSdpgs&ops=240_240", "https://img.huffingtonpost.com/asset/633e8a652500002000566744.jpg?cache=50c85RUpVi&ops=240_240", "https://img.huffingtonpost.com/asset/634155432500005f00aa33b4.jpg?cache=HCnGNCDvoe&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633ddf482600005d0072a718.jpeg?cache=ToA0mdQ7jh&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633d40e924000020006350f2.jpg?cache=fUPV2S9S4p&ops=240_240", "https://img.huffingtonpost.com/asset/633c08c22700001b005702e5.png?cache=YyvOIukLJw&ops=240_240", "https://img.huffingtonpost.com/asset/633bf82f27000034005702da.jpeg?cache=ySfBBddvyN&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633f1d502500003d00566816.png?cache=NgrMsPYIB8&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633bf48b2600001e00825906.jpg?cache=VLOE7xsp7j&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633dde6a25000035005579d9.jpeg?cache=CbA9J4gdT9&ops=240_240", "https://img.huffingtonpost.com/asset/633d876c2500003700557965.jpg?cache=haBGsiVmvX&ops=240_240", "https://img.huffingtonpost.com/asset/633c1ffb2700006300570301.jpeg?cache=HieNdnG2LU&ops=240_240", "https://img.huffingtonpost.com/asset/633c13702600001b0082592d.jpg?cache=RQcnavZE6Q&ops=240_240", "https://img.huffingtonpost.com/asset/633db54224000061000a185e.jpeg?cache=cJe9ookqnZ&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633ea3622600003200a09be0.jpeg?cache=OCEXHlVU64&ops=240_240", "https://img.huffingtonpost.com/asset/5908d6db1700001f00dd620c.jpeg?cache=wdOCDh8SFR&ops=210_120", "https://img.huffingtonpost.com/asset/63414e5627000020007084dd.png?ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633c036e2600001b007771a1.png?ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633c2a7226000063007771d4.jpeg?cache=Wm8gx8nUja&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633d6c9c2400001f00635139.png?cache=EtGxh8Ym2M&ops=434_244%2Cquality_75", "https://www.facebook.com/tr?id=1112906175403201&ev=PageView&noscript=1", "https://img.huffingtonpost.com/asset/633ed0e024000031000a19ae.jpeg?ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633fdc462200001c006b4555.png?cache=fxogmTwfa0&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/634007b2250000360079bec8.jpeg?ops=240_240", "https://img.huffingtonpost.com/asset/633f002a2500001f0079bded.jpg?cache=t1onCOBJfF&ops=240_240", "https://img.huffingtonpost.com/asset/633b22052600006200777129.jpeg?cache=hdPgbttus7&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633f1083250000640056680d.jpeg?cache=W7SNr5vIpL&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633b6602240000580088df18.jpeg?cache=MLH91tw03g&ops=240_240", "https://img.huffingtonpost.com/asset/633c08c22700001b005702e5.png?cache=YyvOIukLJw&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/5ad0a1e52000002d00eb4996.jpeg?ops=scalefit_1280_noupscale", "https://img.huffingtonpost.com/asset/633f1d502500003d00566816.png?cache=NgrMsPYIB8&ops=240_240", "https://img.huffingtonpost.com/asset/633d6c9c2400001f00635139.png?cache=EtGxh8Ym2M&ops=240_240", "https://img.huffingtonpost.com/asset/5ad0b7541f0000280616d140.jpeg?cache=7IV1qaSPaq&ops=1200_630", "https://img.huffingtonpost.com/asset/633d4beb2400003400635105.jpeg?cache=Y9jJNdeJCX&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633bf48b2600001e00825906.jpg?cache=VLOE7xsp7j&ops=240_240", "https://img.huffingtonpost.com/asset/633d8e372400005b00635171.jpeg?cache=cc9NJYja2p&ops=240_240", "https://img.huffingtonpost.com/asset/6340396f22000056006b45c3.jpeg?ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633e03052500003500557a1e.jpeg?cache=h0LAeqg1a0&ops=240_240", "https://img.huffingtonpost.com/asset/633f002a2500001f0079bded.jpg?cache=t1onCOBJfF&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633fec47250000360079bea7.jpeg?cache=1MFuMDvaVF&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633d33442500001d0055790e.jpg?cache=B9pRkJ3tJv&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/5ad09fc51e00008e0b7b168b.jpeg?ops=scalefit_1280_noupscale", "https://img.huffingtonpost.com/asset/633db54224000061000a185e.jpeg?cache=cJe9ookqnZ&ops=240_240", "https://img.huffingtonpost.com/asset/633e8a652500002000566744.jpg?cache=50c85RUpVi&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633e03052500003500557a1e.jpeg?cache=h0LAeqg1a0&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633ea3622600003200a09be0.jpeg?cache=OCEXHlVU64&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633d8e372400005b00635171.jpeg?cache=cc9NJYja2p&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633d66ab240000cb026e5bae.jpeg?ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/5c113ccf1d00002e023175d5.png?ops=100_100", "https://img.huffingtonpost.com/asset/633d33442500001d0055790e.jpg?cache=B9pRkJ3tJv&ops=240_240", "https://img.huffingtonpost.com/asset/633e7ce52600003a00a09bac.jpg?cache=5Z719xMgme&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/62deb60b250000839a476ed8.jpg?cache=HiF8LAqxfB&ops=240_240", "https://img.huffingtonpost.com/asset/633d37552400001b006350e7.jpg?cache=MEdewNlhxa&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/63404c7b2500001f004f73fe.jpg?cache=lNas9Q4Wll&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/5ad0b7541f0000280616d140.jpeg?cache=7IV1qaSPaq&ops=scalefit_1280_noupscale", "https://img.huffingtonpost.com/asset/633ebd2a250000380056677f.jpg?cache=2kspG3Phfn&ops=240_240", "https://img.huffingtonpost.com/asset/633c48192300002f00deba7c.jpeg?cache=DC9LdKuE0r&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633ca01d2400001e006e5afa.png?cache=0pMs7UTFAN&ops=240_240", "https://img.huffingtonpost.com/asset/62deb60b250000839a476ed8.jpg?cache=HiF8LAqxfB&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/634082b82200002e006b4618.jpeg?cache=vKSrxpYsjm&ops=240_240", "https://img.huffingtonpost.com/asset/63406f692200002f006b4607.jpeg?cache=akEXLWRYSr&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/63402e432500003a004f73df.jpeg?cache=AdnbRabZJs&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/634048f922000034006b45dd.jpg?ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633fe09725000039004f7391.jpeg?cache=Zde865g5mA&ops=240_240", "https://img.huffingtonpost.com/asset/633d549a2500001f0055793a.jpg?cache=l2c5SSetBX&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633ff8ea2500005e004f73a4.jpeg?cache=Q1MOHMKJiH&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/5a8478142000004d00eaee32.jpeg?cache=l1oX1T3OG5&ops=210_120"], "top_img": "https://img.huffingtonpost.com/asset/5ad0b7541f0000280616d140.jpeg?cache=7IV1qaSPaq&ops=1200_630", "keywords": [], "authors": ["Senior Entertainment Reporter"], "canonical_link": "https://www.huffpost.com/entry/divas-live-20th-anniversary_n_5acf57f6e4b0701783ac229a", "title": "A Peek Inside 'Divas Live,' Pop Music's Greatest Worship Service", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "description": "On the 20th anniversary, here's how all-star women came together for a concert extravaganza filled with as much drama as there was glory.", "keywords": "Arts and Entertainment,Television,media,Mariah Carey ,Celine Dion,Whitney Houston,elton john,aretha franklin,diana ross,vh1,humanities,faith hill,chaka khan ,Tina Turner,Gloria Estefan,Proud Mary,LeAnn Rimes ,Donna Summer,VH1 Divas,Beacon Theatre New York City", "fb": {"app_id": 238320442863988}, "og": {"title": "A Peek Inside 'Divas Live,' Pop Music's Greatest Worship Service", "type": "article", "image": {"identifier": "https://img.huffingtonpost.com/asset/5ad0b7541f0000280616d140.jpeg?cache=7IV1qaSPaq&ops=1200_630", "url": "https://img.huffingtonpost.com/asset/5ad0b7541f0000280616d140.jpeg?cache=7IV1qaSPaq&ops=1200_630", "type": "https://img.huffingtonpost.com/asset/5ad0b7541f0000280616d140.jpeg?cache=7IV1qaSPaq&ops=1200_630", "width": 1200, "height": 630}, "url": "https://www.huffpost.com/entry/divas-live-20th-anniversary_n_5acf57f6e4b0701783ac229a", "site_name": "HuffPost UK", "locale": "en_GB", "description": "On the 20th anniversary, here's how all-star women came together for a concert extravaganza filled with as much drama as there was glory."}, "article": {"tag": "Arts and Entertainment,Television,media,Mariah Carey ,Celine Dion,Whitney Houston,elton john,aretha franklin,diana ross,vh1,humanities,faith hill,chaka khan ,Tina Turner,Gloria Estefan,Proud Mary,LeAnn Rimes ,Donna Summer,VH1 Divas,Beacon Theatre New York City", "section": "Entertainment", "published_time": "2018-04-15T15:39:45Z", "modified_time": "2018-04-15T20:45:20Z"}, "twitter": {"card": "summary_large_image", "site": "@HuffPostEnt", "title": "A Peek Inside 'Divas Live,' Pop Music's Greatest Worship Service", "image": {"identifier": "https://img.huffingtonpost.com/asset/5ad0b7541f0000280616d140.jpeg?cache=7IV1qaSPaq&ops=1200_630", "width": 1200, "height": 630}, "description": "On the 20th anniversary, here's how all-star women came together for a concert extravaganza filled with as much drama as there was glory.", "creator": "@tarantallegra"}, "al": {"ios": {"url": "huffpostnews:///?editionID=uk&entryID=uk_5acf57f6e4b0701783ac229a", "app_store_id": 306621789, "app_name": "HuffPost"}}, "sailthru.title": "A Peek Inside 'Divas Live,' Pop Music's Greatest Worship Service", "sailthru.tags": "Arts and Entertainment,Television,media,Mariah Carey ,Celine Dion,Whitney Houston,elton john,aretha franklin,diana ross,vh1,humanities,faith hill,chaka khan ,Tina Turner,Gloria Estefan,Proud Mary,LeAnn Rimes ,Donna Summer,VH1 Divas,Beacon Theatre New York City", "sailthru.image.thumb": "https://img.huffingtonpost.com/asset/5ad0b7541f0000280616d140.jpeg?cache=7IV1qaSPaq&ops=1200_630", "robots": "max-snippet:-1,max-image-preview:large,max-video-preview:-1", "google-site-verification": "SwSeLtSWlBL7BhzM0utZK77nXk0ojoWmrDJstoXkO9Q", "taboola.category": "entertainment"}, "movies": [], "publish_date": 1523806785.0, "source": "https://www.huffingtonpost.com", "summary": ""}