{"url": "https://www.usatoday.com/story/life/movies/2017/09/21/battle-sexes-how-accurate-movie-infamous-tennis-match/681093001/", "text": "'Battle of the Sexes': How accurate is the movie about the infamous tennis match?\n\nShow Caption Hide Caption Trailer: Emma Stone and Steve Carell star in 'Battle of the Sexes' Emma Stone stars as Billie Jean King and Steve Carell is Bobby Riggs in the 1970s-set sports film 'Battle of the Sexes.' Fox Searchlight\n\nBattle of the Sexes retells an event in American history that's so bizarre, it doesn't quite seem true 40 years later.\n\nThe film focuses on the nationally televised 1973 Battle of the Sexes tennis match in which 29-year-old Billie Jean King (Emma Stone) beat 55-year-old former champion Bobby Riggs (Steve Carell) in three straight sets.\n\n\"The actual match was a pure pantomime, outright silly. Yet what was going on underneath was incredibly serious,\" says the movie's screenwriter, Simon Beaufoy. \"That win had a huge sociological effect.\"\n\nBeaufoy capped his research by sitting down with King for a marathon interview before writing the screenplay. (Riggs died at age 77 in 1995.)\n\n\"I'd say 99% of it they got right,\" says King, 73. \"They certainly captured the essence.\"\n\nSome key points of accuracy:\n\nTheir grand entrance actually was that bizarre\n\nKing really did ride into the Houston Astrodome on a feather-adorned Cleopatra litter carried by four bare-chested hunks. Promoter Jerry Perenchio suggested the absurd entrance.\n\n\"He said to me, 'I know you’re a feminist. So you probably won’t get on this Egyptian litter, will you?' \" King recalls. \"I said, 'Yes, I love it! Let’s go.' He was shocked. I got on it, and we walked out.\"\n\nRiggs entered in a rickshaw drawn by young women.\n\n\"We really brought the entertainment factor to the match and made it exciting to people,\" says King.\n\nThe net exchange of gifts went down\n\nKing found out that Riggs, who was paid $50,000 to wear a Sugar Daddy jacket during the match, intended to give her a giant Sugar Daddy candy on a stick. Perenchio had a small pig for King to present him in exchange.\n\n\"I said, 'Are you kidding, you have that?' That was better than anything I could think of,\" says King. \"I named it Robert Larimore Riggs, Bobby's formal name, and put a little ribbon around his neck. It was so cute.\"\n\nShe made Perenchio promise that the pig would never end up \"as ham on a table. Let it live a long life at a farm. They gave it to an Oklahoma farmer.\"\n\nMore: Billie Jean King really wants Emma Stone to win (another) Oscar\n\nAlso: Review: Emma Stone, Steve Carell hold court in dynamite 'Battle of the Sexes'\n\nThe tennis points ring true\n\nDirectors Jonathan Dayton and Valerie Faris made a 10-minute video of the real periods of play they wanted to depict. Stone and Carell played similar rallies (sequences of back-and-forth shots) under the guidance of an instructor, using the techniques and strategy of their respective players.\n\n\"We experimented with doing the exact points, but it looked fake,\" says Dayton. \"It was important that the players not anticipate where the ball was going. In the end, we played each point like a real match, not knowing who would win.\"\n\nBillie Jean's tennis whites were spot-on\n\nKing's actual match apparel is housed at the Smithsonian National Museum of American History. But she was impressed with the completely correct costume Stone wore — right down to audacious blue-suede tennis shoes.\n\n\"I was so surprised, it was an exact replica,\" says King.\n\nThere was some creative license taken (SPOILER alert!)\n\nKing did get a pre-match haircut from her hairdresser girlfriend Marilyn Barnett (Andrea Riseborough). But it wasn't \"five minutes before the match,\" says King. Nor did King break down and cry alone in the locker room as Stone does after the historic win.\n\n\"They kept me so busy after that, but that’s how I was feeling, such relief,\" says King. \"Emma captured it perfectly.\"\n\nBattle of the Sexes arrives in theaters Friday in New York, Los Angeles, Chicago, Phoenix, San Francisco and Washington. It expands nationwide on Sept. 29.", "images": ["https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://media.gannett-cdn.com/29906170001/29906170001_5581391467001_5581386442001-vs.jpg?pubId=29906170001", "https://media.gannett-cdn.com/29906170001/29906170001_5579434644001_5579417707001-vs.jpg?pubId=29906170001", "https://www.gannett-cdn.com/-mm-/1fecae5856e58374cc9e1c0fd6dcc3c6aae79d4e/c=0-293-5760-3547/local/-/media/2017/09/19/USATODAY/USATODAY/636414206881836632-battle-of-the-sexes-dom-1BOTS-03281-rgb.jpg?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/1fecae5856e58374cc9e1c0fd6dcc3c6aae79d4e/c=0-293-5760-3547/local/-/media/2017/09/19/USATODAY/USATODAY/636414206881836632-battle-of-the-sexes-dom-1BOTS-03281-rgb.jpg?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Bryan Alexander"], "canonical_link": "https://www.usatoday.com/story/life/movies/2017/09/21/battle-sexes-how-accurate-movie-infamous-tennis-match/681093001/", "title": "'Battle of the Sexes': How accurate is the movie about the infamous tennis match?", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/movies/2017/09/21/battle-sexes-how-accurate-movie-infamous-tennis-match/681093001/life/movies", "theme-color": "#ffffff", "og": {"type": "article", "title": "'Battle of the Sexes': How accurate is the movie about the infamous tennis match?", "description": "Emma Stone and Steve Carell faithfully capture Billie Jean King and Bobby Riggs. But does the film get the details right about their tennis showdown?", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/1fecae5856e58374cc9e1c0fd6dcc3c6aae79d4e/c=0-293-5760-3547/local/-/media/2017/09/19/USATODAY/USATODAY/636414206881836632-battle-of-the-sexes-dom-1BOTS-03281-rgb.jpg?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "Emma Stone and Steve Carell faithfully capture Billie Jean King and Bobby Riggs. But does the film get the details right about their tennis showdown?", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1505948400.0, "source": "https://www.usatoday.com", "summary": ""}