{"url": "https://www.rollingstone.com/music/music-news/mariah-carey-to-return-to-dick-clarks-new-years-rockin-eve-special-197593/", "text": "Mariah Carey will return to Dick Clark’s New Year’s Rockin’ Eve on December 31st, exactly a year after the singer staged a disastrous performance at New York’s Times Square on the 2016-ending special.\n\n“Take 2,” Carey tweeted after her return performance was announced. In a joint statement, Carey and Dick Clark Productions said, “We can all agree that last year didn’t go exactly as planned and we are thrilled to move forward together to provide America with an incredible night of music and celebration on Dick Clark’s New Year’s Rockin’ Eve with Ryan Seacrest 2018. See you in Times Square!”\n\nCarey will once again perform at 11:45 p.m. EST on the special despite blaming Dick Clark Productions for turning the New Year’s show into “an opportunity to humiliate me,” the singer said after last year’s mishap.\n\nA faulty in-ear monitor was ultimately blamed as the cause for the nightmarish performance, with Carey unable to hear the backing music among “all the noise, the freezing cold, the smoke from the smoke machines, and thousands of people celebrating,” the singer said. Instead of singing along with her “Emotions” and “We Belong Together,” Carey spoke to the crowd about her technical difficulties while still following the planned choreography.\n\nAt the time, Carey’s management was also upset that Dick Clark Productions didn’t withhold the performance from the West Coast feed. However, Carey has since parted ways with that management team and is now repped by Roc Nation, who championed the “redemptive” performance.\n\nThis year’s Rockin’ Eve performance will follow the template of Carey’s recent Las Vegas residency, where the singer is accompanied by a full band and dancers, Variety reports.\n\nCamila Cabello, Nick Jonas, Sugarland and Britney Spears (via satellite from her Piece of Me show in Las Vegas) are also scheduled to appear on the Ryan Seacrest-hosted special.", "images": ["https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2022/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-630828088-445069d6-dd9f-4e58-86ce-7bb3e1c67db1.jpg?w=500&h=375&crop=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-630828088-445069d6-dd9f-4e58-86ce-7bb3e1c67db1.jpg?w=500&h=375&crop=1", "keywords": [], "authors": ["Daniel Kreps"], "canonical_link": "https://www.rollingstone.com/music/music-news/mariah-carey-to-return-to-dick-clarks-new-years-rockin-eve-special-197593/", "title": "Mariah Carey to Return to ‘Dick Clark’s New Year’s Rockin’ Eve’ Special", "meta_data": {"theme-color": "#df3535", "viewport": "width=device-width, initial-scale=1.0", "description": "Mariah Carey will return to Dick Clark's New Year's Rockin' Eve on December 31st, exactly a year after the singer staged a disastrous performance.", "news_keywords": "Mariah Carey", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "rollingstone", "pmc-page_type": "article", "articleid": 197593, "author": "Daniel Kreps", "pmc-category": "Music,Music News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-12-23T01:17:18"}, "pmc-tag": "Mariah Carey", "title": "Mariah Carey to Return to ‘Dick Clark’s New Year’s Rockin’ Eve’ Special", "pageclass": "article", "pmc-is_free": "no", "pmc-branded-content": "no", "pmc-evergreen": "no"}, "generator": "WordPress 6.0.2", "author": "Daniel Kreps", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "RS", "application-name": "RS", "content_type": "Article", "post_id": 197593, "title": "Mariah Carey to Return to 'Dick Clark's New Year's Rockin' Eve' Special", "published_at": "2017-12-23 01:17:18", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-630828088-445069d6-dd9f-4e58-86ce-7bb3e1c67db1.jpg?w=1024", "comment_count": 0, "tags": "Mariah Carey", "topics": "Music News", "body": "Mariah Carey will return to Dick Clark's New Year's Rockin' Eve on December 31st, exactly a year after the singer staged a disastrous performance at New York's Times Square on the 2016-ending special.\"Take 2,\" Carey tweeted after her return performance was announced. In a joint statement, Carey and Dick Clark Productions said, \"We can all agree that last year didn't go exactly as planned and we are thrilled to move forward together to provide America with an incredible night of music and celebration on Dick Clark’s New Year’s Rockin' Eve with Ryan Seacrest 2018. See you in Times Square!\"Carey will once again perform at 11:45 p.m. EST on the special despite blaming Dick Clark Productions for turning the New Year's show into \"an opportunity to humiliate me,\" the singer said after last year's mishap.A faulty in-ear monitor was ultimately blamed as the cause for the nightmarish performance, with Carey unable to hear the backing music among \"all the noise, the freezing cold, the smoke from the smoke machines, and thousands of people celebrating,\" the singer said. Instead of singing along with her \"Emotions\" and \"We Belong Together,\" Carey spoke to the crowd about her technical difficulties while still following the planned choreography.At the time, Carey's management was also upset that Dick Clark Productions didn't withhold the performance from the West Coast feed. However, Carey has since parted ways with that management team and is now repped by Roc Nation, who championed the \"redemptive\" performance.This year's Rockin' Eve performance will follow the template of Carey's recent Las Vegas residency, where the singer is accompanied by a full band and dancers, Variety reports. Camila Cabello, Nick Jonas, Sugarland and Britney Spears (via satellite from her Piece of Me show in Las Vegas) are also scheduled to appear on the Ryan Seacrest-hosted special.", "fb": {"pages": 10664530778}, "onesignal": "wordpress-plugin", "og": {"type": "article", "title": "Mariah Carey to Return to 'Dick Clark's New Year's Rockin' Eve' Special", "url": "https://www.rollingstone.com/music/music-news/mariah-carey-to-return-to-dick-clarks-new-years-rockin-eve-special-197593/", "description": "“We can all agree that last year didn’t go exactly as planned and we are thrilled to move forward together,” Dick Clark Productions says", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-630828088-445069d6-dd9f-4e58-86ce-7bb3e1c67db1.jpg?w=500&h=375&crop=1", "width": 1024, "height": 662}, "locale": "en_US"}, "article": {"published_time": "2017-12-23T01:17:18+00:00", "modified_time": "2018-06-25T16:16:21+00:00"}, "twitter": {"site": "@RollingStone", "card": "summary_large_image", "title": "Mariah Carey to Return to ‘Dick Clark’s New Year’s Rockin’ Eve’ Special", "description": "Mariah Carey will return to Dick Clark's New Year's Rockin' Eve on December 31st, exactly a year after the singer staged a disastrous performance.", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-630828088-445069d6-dd9f-4e58-86ce-7bb3e1c67db1.jpg?w=1024"}, "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2022/08/cropped-Rolling-Stone-Favicon.png?w=270"}, "movies": [], "publish_date": 1513991838.0, "source": "https://www.rollingstone.com", "summary": ""}