{"url": "https://en.wikipedia.org/wiki/Spice_Girls", "text": "British girl group\n\nThe Spice Girls are a British girl group formed in 1994, consisting of Melanie Brown, also known as Mel B (\"Scary Spice\"); Melanie Chisholm, or Melanie C (\"Sporty Spice\"); Emma Bunton (\"Baby Spice\"); Geri Halliwell (\"Ginger Spice\"); and Victoria Beckham (\"Posh Spice\"). With their \"girl power\" mantra, they redefined the girl-group concept by targeting a young female fanbase.[1][2] They led the teen pop resurgence of the 1990s, were a major part of the Cool Britannia era, and became pop culture icons of the decade.[3][4][5]\n\nThe group formed through auditions held by managers Bob and Chris Herbert, who wanted to create a girl group to compete with the British boy bands popular at the time. They signed to Virgin Records and released their debut single \"Wannabe\" in 1996, which reached number one on the charts of 37 countries.[6][7] Their debut album, Spice (1996), sold more than 23 million copies worldwide,[8] becoming the best-selling album by a female group in history.[9] The follow-up, Spiceworld (1997), sold more than 14 million copies worldwide.[10] Both albums encapsulated the group's dance-pop style and message of female empowerment, with vocal and songwriting contributions shared equally by the members. In 1997, a film starring the Spice Girls, Spice World, was released; it was a commercial success but received poor reviews.\n\nIn May 1998, Halliwell left the Spice Girls, citing exhaustion and creative differences. The group carried on as a four-piece with the 1998 Spiceworld Tour, which was attended by an estimated 2.1 million people to become the highest-grossing concert tour by a female group.[11] Forever (2000), the only Spice Girls album without Halliwell, achieved weaker sales.[12] At the end of 2000, the Spice Girls entered a hiatus to concentrate on their solo careers. They reunited for two concert tours, the Return of the Spice Girls (2007–2008) and Spice World (2019), both of which won the Billboard Live Music Award for highest-grossing engagements, making them the top touring all-female group from 2000 to 2020.[13] Viva Forever!, a musical based on the Spice Girls' music, opened in 2012; it was a critical and commercial failure and closed in 2013.\n\nOther measures of the Spice Girls' success include international record sales, iconic symbolism such as Halliwell's Union Jack dress, and their synonymous nicknames which were given to them by the British press. Under the guidance of their mentor and manager Simon Fuller, their endorsement deals and merchandise made them one of most successful marketing engines ever, with a global gross income estimated at $500–800 million by May 1998.[14][nb 1] Their media exposure, according to Music Week writer Paul Gorman, helped usher in an era of celebrity obsession in pop culture.[19]\n\nThe Spice Girls have sold 100 million records worldwide,[20] making them the best-selling girl group of all time,[21][22][23] one of the bestselling artists, and the most successful British pop act since the Beatles.[24][25][26] They received five Brit Awards, three American Music Awards, four Billboard Music Awards, three MTV Europe Music Awards and one MTV Video Music Award. In 2000, they became the youngest recipients of the Brit Award for Outstanding Contribution to Music. According to Rolling Stone journalist and biographer David Sinclair, they were the most widely recognised group since the Beatles.[27]\n\nBand history [ edit ]\n\n1994–1996: Formation and early years [ edit ]\n\nWANTED: R.U. 18–23 with the ability to sing/dance? R.U. streetwise, outgoing, ambitious, and dedicated? Heart Management Ltd. are a widely successful music industry management consortium currently forming a choreographed, singing/dancing, all-female pop act for a recording deal. Open audition. Danceworks, 16 Balderton Street. Friday 4th March. 11.00am–5.30pm. Please bring sheet music or backing cassette. – Advertisement placed in The Stage[28]\n\nIn the early 1990s, Bob and Chris Herbert, the father-and-son duo of Heart Management, decided to create a girl group to compete with the boy bands who dominated UK pop music at the time.[29] Together with financier Chic Murphy, they envisioned an act comprising \"five strikingly different girls\"[30] who would each appeal to a different audience. In February 1994, Heart Management placed an advertisement in the trade paper The Stage asking for singers to audition for an all-female pop band at London's Danceworks studios.[31] Approximately 400 women attended the audition on 4 March 1994. They were placed in groups of 10 and danced a routine to \"Stay\" by Eternal, followed by solo auditions in which they performed songs of their choice.[32]\n\nAfter several weeks of deliberation, Victoria Adams, Melanie Brown, Melanie Chisholm and Michelle Stephenson were among a dozen or so women who advanced to a second round of auditions in April.[32][33] Chisholm missed the second audition after coming down with tonsillitis.[34] Despite missing the first round of auditions, Geri Halliwell persuaded the Herberts to let her attend the second.[35] A week after the second audition, Adams, Brown, Halliwell and Stephenson were asked to attend a recall at Nomis Studios in Shepherd's Bush, performing \"Signed, Sealed, Delivered I'm Yours\" on their own and as a group.[36] Chisholm was also invited as a last-minute replacement for another finalist.[37] The five women were selected for a band initially named \"Touch\".[38]\n\nThe group moved into a three-bedroom house in Maidenhead, Berkshire, and spent most of 1994 practising songs written for them by Bob Herbert's long-time associates John Thirkell and Erwin Keiles.[39] According to Stephenson, the material they were given was \"very, very young pop\", and none were later used by the Spice Girls.[40] During these first months, the group worked on demos at South Hill Park Recording Studios in Bracknell with producer and studio owner Michael Sparkes and songwriter and arranger Tim Hawes. They were also tasked with choreographing their own dance routines, which they worked on at Trinity Studios in Knaphill, near Woking, Surrey.[41] A few months into the training, Stephenson was fired for a perceived lack of commitment.[nb 2] Heart Management turned to the group's vocal coach, Pepi Lemer, to find a replacement. After Lemer's first recommendation declined the offer, Lemer recommended her former pupil, Emma Bunton, who auditioned for the Herberts and joined as the fifth member.[42]\n\nAs their training continued, the group performed small showcases for a few of Heart Management's associates. On one such performance, the group added a rap section they had written to one of Thirkell and Keiles' songs. Keiles was furious with the changes and insisted they learn to write songs properly. The group began professional songwriting lessons;[43] during one session, they wrote a song called \"Sugar and Spice\" with Hawes, which inspired them to change their band name to \"Spice\".[44]\n\nBy late 1994, the group felt insecure as they still did not have an official contract with Heart Management, and were frustrated with the management team's direction. They persuaded Herbert to set up a showcase performance for the group in front of industry writers, producers and A&R men in December 1994 at the Nomis Studios, where they received an \"overwhelmingly positive\" reaction.[45] The Herberts quickly set about creating a binding contract for them. Encouraged by the reaction they had received at the Nomis showcase, all five members refused to sign the contracts on legal advice from, among others, Adams's father.[45] The following month, in January, the group began songwriting sessions with Richard Stannard, whom they had impressed at the showcase, and his partner Matt Rowe. It was during these sessions that the songs \"Wannabe\" and \"2 Become 1\" were written.[46]\n\nIn March 1995, the group parted from Heart Management due to their frustration with the company's unwillingness to listen to their visions and ideas. To ensure they kept control of their own work, they allegedly stole the master recordings of their discography from the management offices.[47][nb 3] The next day, the group tracked down Sheffield-based songwriter Eliot Kennedy, who had been present at the Nomis showcase, and persuaded him to work with them. Through contacts they had made at the showcase, they were also introduced to record producers Absolute. With Kennedy and Absolute's help, the group spent the next several weeks writing and recording demos for the majority of the songs that would be released on their debut album, including \"Say You'll Be There\" and \"Who Do You Think You Are\".[46] Their demos caught the attention of Simon Fuller of 19 Entertainment, who signed them to his management company in May 1995.[50]\n\nBy this point, industry buzz around Spice had grown significantly and the major record labels in London and Los Angeles were keen to sign them. After a bidding war, they signed a five-album deal with Virgin Records in July 1995.[51] Fuller took them on an extensive promotional tour in Los Angeles, where they met with studio executives in the hopes of securing film and television opportunities.[52] Their name was also changed to \"Spice Girls\" as a rapper was already using the name \"Spice\". The new name was chosen because the group noticed industry people often referred to them derisively as \"the 'Spice' girls\".[53][54] The group continued to write and record tracks for their debut album.[55]\n\n1996–1997: Spice and breakthrough [ edit ]\n\nOn 7 July 1996, the Spice Girls released their debut single \"Wannabe\" in the United Kingdom. In the weeks before the release, the music video for \"Wannabe\" received a trial airing on music channel The Box.[56] The video was an instant hit, and was aired up to seventy times a week at its peak.[57] After the video was released, the Spice Girls had their first live broadcast TV slot on LWT's Surprise Surprise. Earlier in May, the group had conducted their first music press interview with Paul Gorman,[58] the contributing editor of trade paper Music Week, at Virgin Records' Paris headquarters. His piece recognised that the Spice Girls were about to institute a change in the charts away from Britpop and towards out-and-out pop. He wrote: \"JUST WHEN BOYS with guitars threaten to rule pop life—Damon's all over Smash Hits, Ash are big in Big! and Liam can't move for tabloid frenzy—an all-girl, in-yer-face pop group have arrived with enough sass to burst that rockist bubble.\"[59] \"Wannabe\" entered the UK Singles Chart at number three before spending the next seven weeks at number one. The song proved to be a global hit, hitting number one in 37 countries, including four consecutive weeks atop the Billboard Hot 100 in the US, and becoming not only the best-selling debut single by an all-female group but also the best-selling single by an all-female group of all time.[6][60][61]\n\nRiding a wave of publicity and hype, the group released their next singles in the UK and Europe; in October \"Say You'll Be There\" was released topping the charts at number one for two weeks. \"2 Become 1\" was released in December, becoming their first Christmas number one and selling 462,000 copies in its first week,[62] making it the fastest-selling single of the year. The two tracks continued the group's remarkable sales, giving them three of the top five best-selling songs of 1996 in the UK.[63] In November 1996, the Spice Girls released their debut album Spice in Europe. The success was unprecedented and drew comparisons to Beatlemania,[26] leading the press to dub it \"Spicemania\"[64][65][66] and the group the \"Fab Five\".[67][68][69] In seven weeks Spice had sold 1.8 million copies in Britain alone,[70] making the Spice Girls the fastest-selling British act since the Beatles. In total, the album sold over 3 million copies in Britain,[70] the best-selling album of all time in the UK by a female group,[71] certified 10× Platinum,[70] and peaked at number one for fifteen non-consecutive weeks.[72] In Europe the album became the best-selling album of 1997 and was certified 8× Platinum by the IFPI for sales in excess of 8 million copies.[73]\n\n\"Wannabe\" Spice Girls debut single \"Wannabe\" is one of the best-selling singles of all time, topping the charts in 37 countries and selling over 6 million copies Worldwide. Problems playing this file? See media help.\n\nThat same month, the Spice Girls attracted a crowd of 500,000 when they switched on the Christmas lights in Oxford Street, London.[74] At the same time, Simon Fuller started to set up multi-million dollar sponsorship deals for the Spice Girls with Pepsi, Walkers, Impulse, Cadbury and Polaroid.[75] The group ended 1996 winning three trophies at the Smash Hits awards at the London Arena, including best video for \"Say You'll Be There\".[55] In January 1997, \"Wannabe\" was released in the United States. The single proved to be a catalyst in helping the Spice Girls break into the notoriously difficult US market when it debuted on the Hot 100 Chart at number eleven. At the time, this was the highest-ever debut by a non-American act, beating the previous record held by the Beatles for \"I Want to Hold Your Hand\",[74] and the joint highest entry for a debut act alongside Alanis Morissette's \"Ironic\".[76] \"Wannabe\" reached number one in the US for four weeks. In February, Spice was released in the US, and became the best-selling album of 1997 in the US, peaking at number one, and was certified 7× Platinum by the RIAA[77] for sales in excess of 7.4 million copies.[78] The album was also included in the Top 100 Albums of All Time list by the Recording Industry Association of America (RIAA) based on US sales.[79] In total, the album sold over 23 million copies worldwide[8] becoming the best-selling album in pop music history by an all-female group.[9]\n\nLater that month, the Spice Girls performed \"Who Do You Think You Are\" to open the 1997 Brit Awards, with Geri Halliwell wearing a Union Jack mini-dress that became one of pop history's most famed outfits.[80][81] At the ceremony, the group won two Brit Awards; Best British Video for \"Say You'll Be There\" and Best British Single for \"Wannabe\".[82] In March 1997, a double A-side of \"Mama\"/\"Who Do You Think You Are\" was released in Europe, the last from Spice, which once again saw them at number one,[83] making the Spice Girls the first group since the Jackson 5 to have four consecutive number one hits.[74]\n\nGirl Power!, the Spice Girls' first book and manifesto was launched later that month at the Virgin Megastore. It sold out its initial print run of 200,000 copies within a day, and was eventually translated into more than 20 languages.[84] In April, One Hour of Girl Power was released; it sold 500,000 copies in the UK between April and June to become the best-selling pop video ever,[84][85] and was eventually certified 13× Platinum.[70] In May, Spice World, a film starring the group, was announced by the Spice Girls at the Cannes Film Festival.[86] The group also performed their first live UK show for the Prince's Trust benefit concert.[87] At the show, they breached royal protocol when Brown and then Halliwell planted kisses on Prince Charles' cheeks and pinched his bottom, causing controversy.[74] That same month, Virgin released Spice Girls Present... The Best Girl Power Album... Ever!, a multi-artist compilation album compiled by the group. The album peaked at number two on the UK Compilation Chart[88] and was certified Gold by the BPI.[70] At the Ivor Novello Awards, the group won International Hit of the Year and Best-Selling British Single awards for \"Wannabe\".[89]\n\nSpice World began filming in June and wrapped in August.[90] The film was to be set to the songs from the group's second studio album, but no songs had been written when filming began. The group thus had to do all the songwriting and recording at the same time as they were filming Spice World, resulting in a grueling schedule that left them exhausted.[91] Among the songs that were written during this period was \"Stop\", the lyrics for which cover the group's frustrations with being overworked by their management.[92] In September, the Spice Girls performed \"Say You'll Be There\" at the 1997 MTV Video Music Awards at Radio City Music Hall in New York City, and won Best Dance Video for \"Wannabe\".[93] The MTV Awards came five days after the death of Diana, Princess of Wales, with tributes paid to her throughout the ceremony. Chisholm stated, \"We'd like to dedicate this award to Princess Diana, who is a great loss to our country.\"[94] At the 1997 Billboard Music Awards, the group won four awards for New Artist of the Year, Billboard Hot 100 Singles Group of the Year, Billboard 200 Group of the Year and Billboard 200 Album of the Year for Spice.[95]\n\n1997–1998: Groundbreaking success, Spiceworld and Halliwell's departure [ edit ]\n\n\"Spice Up Your Life\" \"Spice Up Your Life\" became the group's fifth consecutive chart-topper, which made them the first act to have its first five singles reach number one in the UK. Problems playing this file? See media help.\n\nIn October 1997, the Spice Girls released the first single from Spiceworld, \"Spice Up Your Life\". It entered the UK Singles Chart at number one, making it the group's fifth consecutive number-one single.[96] That same month, the group performed their first live major concert to 40,000 fans in Istanbul, Turkey.[97] Later, they launched the Royal British Legion's Poppy Appeal,[98] then travelled to South Africa to meet Nelson Mandela, who announced, \"These are my heroes.\"[99] In November, the Spice Girls released their second album, Spiceworld. It set a new record for the fastest-selling album when it shipped seven million copies over the course of two weeks. Gaining favourable reviews,[100] the album went on to sell over 10 million copies in Europe,[101] Canada,[102] and the United States[77] combined, and 14 million copies worldwide.[10] Criticised in the United States for releasing the album just nine months after their debut there, which gave the group two simultaneous Top 10 albums in the Billboard album charts,[103] and suffering from over-exposure at home,[98] the Spice Girls began to experience a media backlash. The group was criticised for the number of sponsorship deals signed—over twenty in total—and they began to witness diminishing international chart positions.[104] Nevertheless, the Spice Girls remained the best-selling pop group of both 1997 and 1998.[105]\n\nOn 7 November 1997, the group performed \"Spice Up Your Life\" at the MTV Europe Music Awards, and won the Best Group award.[106] The morning of the performance, the Spice Girls had also fired their manager Simon Fuller and took over the running of the group themselves.[107][nb 4] To ensure a smooth transition, Halliwell allegedly stole a mobile phone from Fuller's assistant that contained the group's upcoming schedule and Fuller's business contacts.[109][nb 5] The firing was front-page news around the world. Many commentators speculated that Fuller had been the true mastermind behind the group, and that this was the moment when the band lost their impetus and direction.[111][112] Later that month, the Spice Girls became the first pop group to host ITV's An Audience with...;[113] their show was watched by 11.8 million viewers in the UK, one fifth of the country's population.[114] In December 1997, the second single from Spiceworld, \"Too Much\", was released, becoming the group's second Christmas number one and their sixth consecutive number-one single in the UK. December also saw the group launch their film Spice World. The world premiere at the Empire Theatre in Leicester Square was attended by celebrities including Prince Charles, Prince William and Prince Harry.[115] The film was a commercial success but received poor reviews.[86] The group ended 1997 as the year's most played artist on American radio.[116]\n\nIn January 1998, the Spice Girls attended the US premiere of Spice World at the Mann's Chinese Theatre.[117] At the 1998 American Music Awards a few days later, the group won the awards for Favorite Album, Favorite New Artist and Favorite Group in the pop/rock category.[118] In February, they won a special award for overseas success at the 1998 Brit Awards,[119] with combined sales of over 45 million albums and singles worldwide.[120] That night, the group performed their next single, \"Stop\",[119] their first not to reach number one in United Kingdom, entering at number two.[96] In early 1998, the Spice Girls embarked on the Spiceworld Tour, starting in Dublin, Ireland, on 24 February 1998 before moving to mainland Europe and North America, and then returning to the United Kingdom for two gigs at Wembley Stadium.[121] Later that year, the Spice Girls were invited to sing on the official England World Cup song \"(How Does It Feel to Be) On Top of the World\", the last song recorded with Halliwell until 2007.\n\nOn 31 May 1998, Halliwell announced her departure from the Spice Girls through her solicitor.[68][nb 6] The announcement was preceded by days of frenzied press speculation after Halliwell missed two concerts in Norway and was absent from the group's performance on The National Lottery Draws.[68][123] Halliwell first cited creative differences,[68] then later said that she was suffering from exhaustion and disillusionment, although rumours of a power struggle with Brown as the reason for her departure were circulated by the press.[124][125] Halliwell's departure from the group shocked fans and became one of the biggest entertainment news stories of the year, making news headlines the world over.[126][127] The four remaining members were adamant that the group would carry on.[68] The North American leg of the Spiceworld Tour went on as planned, beginning in West Palm Beach, Florida, on 15 June, and grossing $60 million over 40 sold-out performances.[124] Overall, Spiceworld was attended by an estimated 2.1 million people over 97 shows to become the highest-grossing concert tour by a female group.[11] The tour was accompanied by a documentary film titled Spice Girls in America: A Tour Story.[128] \"Viva Forever\" was the last single released from Spiceworld and gave the group their seventh number one in the United Kingdom. The video for the single was made before Halliwell's departure and features all five members in stop-motion animated form.[129]\n\n1998–2000: Forever and hiatus [ edit ]\n\nThe Spice Girls as a four-piece performing \"Holler\" in Cologne , Germany at the Return of the Spice Girls tour\n\nWhile on tour in the United States, the group continued to write and record new material, releasing a new song, \"Goodbye\", before Christmas in 1998.[130] The song was seen as a tribute to Geri Halliwell, although parts of it had originally been written when Halliwell was still a part of the group, and when it topped the UK Singles Chart it became their third consecutive Christmas number one—equalling the record previously set by the Beatles.[131] In November, Bunton and Chisholm appeared at the 1998 MTV Europe Music Awards without their other bandmates, accepting two awards on behalf of the Spice Girls for Best Pop Act and Best Group.[132] That same year, Brown and Adams announced they were both pregnant. Brown was married to dancer Jimmy Gulzer and became known as Mel G for a brief period; she gave birth to daughter Phoenix Chi in February 1999.[133] Adams gave birth a month after to son Brooklyn, whose father was then Manchester United footballer David Beckham; later that year, she married Beckham in a highly publicised wedding in Ireland.[134]\n\nFrom 1998 onwards, the Spice Girls began to pursue solo careers and by the following year, Brown, Bunton, Chisholm, and former member Halliwell, had all released music as solo artists.[135] The group returned to the studio in August 1999 after an eight-month recording break to start work on their third and last studio album. The album's sound was initially more pop-influenced, similar to their first two albums, and included production from Eliot Kennedy.[136] The album's sound took a mature direction when American producers like Rodney Jerkins, Jimmy Jam and Terry Lewis came on board to collaborate with the group. In December 1999, the Spice Girls embarked on a UK-only tour, Christmas in Spiceworld, in London and Manchester, during which they showcased new songs from the third album.[137] Earlier in the year, the group also recorded the song \"My Strongest Suit\" for Elton John and Tim Rice's Aida, a concept album which would later go on to become the musical Aida. The group performed again at the 2000 Brit Awards in March, where they received the Lifetime Achievement award. Despite being at the event, Halliwell did not join her former bandmates on stage.[138]\n\nIn November 2000, the group released Forever; sporting a new edgier R&B sound, the album received a lukewarm response from critics.[139] In the US, the album peaked at number thirty-nine on the Billboard 200 albums chart. In the UK, the album was released the same week as Westlife's Coast to Coast album and the chart battle was widely reported by the media, with Westlife winning the battle and reaching number one, leaving the Spice Girls at number two.[140] The lead single from Forever, the double A-side \"Holler\"/\"Let Love Lead the Way\", became the group's ninth number one single in the UK.[141] However, the song failed to break onto the Billboard Hot 100 singles chart stateside, instead peaking at number seven on the Bubbling Under Hot 100 chart, and at number thirty-one on the Hot Dance Music/Club Play chart. The only major performance of the lead single by the group came at the 2000 MTV Europe Music Awards in November.[142] In total, Forever achieved only a fraction of the success of its two best-selling predecessors, selling four million copies.[12] The Spice Girls ceased all promotional activities for the album in December 2000, as they began an indefinite hiatus to concentrate on their solo careers.[12] Publicly, they insisted that the group was not splitting.[143]\n\n2007–2008: Return of the Spice Girls and Greatest Hits [ edit ]\n\nOn 28 June 2007, the Spice Girls, including Halliwell, held a press conference at the O 2 Arena revealing their intention to reunite for a worldwide concert tour titled the Return of the Spice Girls.[144] The plan to re-form had long been speculated by the media, with previous attempts by the organisers of Live 8[145] and Concert for Diana to reunite the group as a five-piece falling through.[146] Each member of the group was reportedly paid £10 million ($20 million) to do the reunion tour.[147] Giving You Everything, an official documentary film about the reunion, was directed by Bob Smeaton and first aired on Australia's Fox8 on 16 December 2007,[148] followed by BBC One in the UK on 31 December.[149]\n\nTicket sales for the first London date of the Return of the Spice Girls tour sold out in 38 seconds.[150] It was reported that over one million people signed up in the UK alone and over five million worldwide for the ticket ballot on the band's official website.[150] Sixteen additional dates in London were added,[151] all selling out within one minute.[152] In the United States, Las Vegas, Los Angeles and San Jose shows also sold out, prompting additional dates to be added.[153] It was announced that the Spice Girls would be playing dates in Chicago and Detroit and Boston, as well as additional dates in New York to keep up with the demand. The tour opened in Vancouver on 2 December 2007, with group performing to an audience of 15,000 people, singing twenty songs and changing outfits a total of eight times.[154] Along with the tour sellout, the Spice Girls licensed their name and image to Tesco's UK supermarket chain.[155]\n\nThe group's comeback single, \"Headlines (Friendship Never Ends)\", was announced as the official Children in Need charity single for 2007 and was released 5 November. The first public appearance on stage by the Spice Girls occurred at the Victoria's Secret Fashion Show, where they performed two songs, 1998 single \"Stop\" and the lead single from their greatest hits album, \"Headlines (Friendship Never Ends)\". The show was filmed by CBS on 15 November 2007 for broadcast on 4 December 2007.[156] They also performed both songs live for the BBC Children in Need telethon on 16 November 2007 from Los Angeles. The release of \"Headlines (Friendship Never Ends)\" peaked at number eleven on the UK Singles Chart, making it the group's lowest-charting British single to date. The album peaked at number two on the UK Albums Chart. On 1 February 2008, it was announced that due to personal and family commitments their tour would come to an end in Toronto on 26 February 2008, meaning that tour dates in Beijing, Hong Kong, Shanghai, Sydney, Cape Town and Buenos Aires were cancelled.[157]\n\nOverall, the 47-date tour was the highest-grossing concert act of 2007–2008, measured as the twelve months ending in April 2008.[152] It produced some $107.2 million in ticket sales and merchandising, with sponsorship and ad deals bringing the total to $200 million.[158] The tour's 17-night sellout stand at the O 2 Arena in London was the highest-grossing engagement of the year, netting £16.5 million (US$33 million) and drawing an audience of 256,647, winning the 2008 Billboard Touring Award for Top Boxscore.[159][160] The group's comeback also netted them several other awards, including the Capital Music Icon Award, the Glamour Award for Best Band, and the Vodafone Live Music Award for Best Live Return, the last of which saw them beat out acts such as Led Zeppelin and the Sex Pistols.[161]\n\n2010–2012: Viva Forever! and London Olympics [ edit ]\n\nViva Forever! premiere night, 2012 The Spice Girls at thepremiere night, 2012\n\nAt the 2010 Brit Awards, the Spice Girls received a special award for \"Best Performance of the 30th Year\".[162] The award was for their 1997 Brit Awards performance of \"Wannabe\" and \"Who Do You Think You Are\", with Geri Halliwell and Mel B receiving the award from Samantha Fox on behalf of the group.[162]\n\nThat year, the group collaborated with Fuller, Judy Craymer and Jennifer Saunders to develop a Spice Girls stage musical, Viva Forever!. Similar to the ABBA musical Mamma Mia!, Viva Forever! used the group's music to create an original story.[163] In June 2012, to promote the musical, the Spice Girls reunited for a press conference at the St. Pancras Renaissance London Hotel, where music video for \"Wannabe\" was filmed[164] exactly sixteen years earlier.[56] Viva Forever! premiered at the West End's Piccadilly Theatre in December 2012, with all five Spice Girls in attendance.[165] To promote the musical, the group appeared in the documentary Spice Girls' Story: Viva Forever!, which aired on 24 December 2012 on ITV1.[166] Viva Forever! was panned by critics[167] and closed after seven months, with a loss of at least £5 million.[168]\n\nIn August 2012, the Spice Girls reunited to perform a medley of \"Wannabe\" and \"Spice Up Your Life\" at the 2012 Summer Olympics closing ceremony.[169][170] Their performance received acclaim, and became the most tweeted moment of the Olympics with over 116,000 tweets per minute on Twitter.[171]\n\n2016–2019: G.E.M and Spice World tour [ edit ]\n\nOn 8 July 2016, Brown, Bunton and Halliwell released a video celebrating the 20th anniversary of \"Wannabe\" and teased news from them as a three-piece.[172] Beckham and Chisholm opted not to take part but gave the project their blessing.[173] A new song from the three-piece, \"Song for Her\", was leaked online a few months later in November.[174] The reunion project was cancelled due to Halliwell's pregnancy.[175]\n\nOn 24 May 2019, the Spice Girls began the Spice World – 2019 Tour of the UK and Ireland at Croke Park in Dublin, Ireland. Beckham declined to join due to commitments regarding her fashion business.[176] Each of the four participating members was reportedly paid £12 million for the tour.[177] The tour concluded with three concerts at London's Wembley Stadium, with the last taking place on 15 June 2019. Over 13 dates, the tour produced 700,000 spectators and earned $78.2 million in ticket sales.[178] The three-night sellout stand at Wembley Stadium was the highest-grossing engagement of the year, drawing an audience of 221,971 and winning the 2019 Billboard Live Music Award for Top Boxscore.[179] Despite sound problems in the early concerts, Anna Nicholson in The Guardian wrote, \"As nostalgia tours go, this could hardly have been bettered.\"[180]\n\nAlongside the tour, the group teamed up with the children's book franchise Mr. Men to create derivative products such as books, cups, bags and coasters.[181][182] On 13 June 2019, it was reported that Paramount Animation had greenlit an animated Spice Girls film with old and new songs. The project will be produced by Simon Fuller and written by Karen McCullah and Kirsten Smith. A director has not been announced.[183][184]\n\n2020-present: Spice25 and Spiceworld25 [ edit ]\n\nTo mark the 25th anniversary of \"Wannabe\", an EP was released in July 2021 that included previously unreleased demos.[185] On 29 October, the Spice Girls released Spice25, a deluxe reissue of Spice featuring previously unreleased demos and remixes.[186][187] The deluxe release saw the album reenter the UK Albums Chart at number five,[188] number three on the UK Official Vinyl Albums Chart Top 40 and number four on the UK Official Physical Albums Chart.\n\nOn 27 September 2022, the Spice Girls announced the tracklisting for Spiceworld25, the 25th anniversary edition of their 1997 album Spiceworld. The new collection features previously unreleased live versions and remixes, plus previously available B-sides \"Walk of Life\" and \"Outer Space Girls\" and a megamix.[189] Their 1997 song \"Step to Me\" was released digitally for the first time ever on the same day as the album announcement.[190] \"Step to Me\" had originally been released in 1997 as part of a Pepsi promotion, where fans could get the single CD if they collected enough ring pulls.[191][192] Spiceworld25 is slated for a 4 November 2022 release.[193]\n\nArtistry [ edit ]\n\nMusical style [ edit ]\n\nAccording to Allmusic's Stephen Thomas Erlewine, the Spice Girls \"used dance-pop as a musical base, but they infused the music with a fiercely independent, feminist stance that was equal parts Madonna, post-riot grrrl alternative rock feminism, and a co-opting of the good-times-all-the-time stance of England's new lad culture.\"[5] Their songs incorporated a variety of genres, which Halliwell described as a \"melding\" of the group members' eclectic musical tastes,[194] but otherwise kept to mainstream pop conventions.[195] Chisholm said: \"We all had different artists that we loved. Madonna was a big influence and TLC; we watched a lot of their videos.\"[196] A regular collaborator on the group's first two albums was the production duo known as Absolute, made up of Paul Wilson and Andy Watkins. Absolute initially found it difficult to work with the group as the duo was heavily into R&B music at the time, while the Spice Girls according to Wilson were \"always very poptastic\".[197] Wilson said of the group's musical output: \"Their sound was actually not getting R&B quite right.\"[198]\n\nIn his biography of the band, Wannabe: How the Spice Girls Reinvented Pop Fame (2004), Rolling Stone journalist David Sinclair said that the \"undeniable artistry\" of the group's songs had been overlooked. He said the Spice Girls \"instinctively had an ear for a catchy tune\" without resorting to the \"formula balladry and bland modulations\" of 90s boy bands Westlife and Boyzone.[199] He praised their \"more sophisticated\" second album, Spiceworld, saying: \"Peppered with personality, and each conveying a distinctive musical flavour and lyrical theme, these are songs which couldn't sound less 'manufactured,' and which, in several cases, transcend the pop genre altogether.\"[199]\n\nLyrical themes [ edit ]\n\n[200] Beckham and Bunton performing \"2 Become 1\" in Las Vegas on 11 December 2007. The song, which addresses the importance of safe sex , has been praised for its sex-positive message.\n\nThe Spice Girls' lyrics promote female empowerment and solidarity.[5][201][202] Given the young age of their target audience, Lucy Jones of The Independent said the Spice Girls' songs were subversive for their time: \"The lyrics were active rather than passive: taking, grabbing, laying it down – all the things little girls were taught never to do. 'Stop right now, thank you very much'. 'Who do you think you are?' 'I'll tell you what I want, what I really, really want'.\"[203] Musicologist Nicola Dibben cited \"Say You'll Be There\" as an example of how the Spice Girls inverted traditional gender roles in their lyrics, depicting a man who has fallen in love and displays too much emotion and a woman who remains independent and in control.[204] The Spice Girls emphasised the importance of sisterhood over romance in songs such as \"Wannabe\", and embraced safe sex in \"2 Become 1\".[200]\n\nLauren Bravo, author of What Would the Spice Girls Do?: How the Girl Power Generation Grew Up (2018), found that even when the Spice Girls sang about romance, the message was \"cheerfully non-committal\", in contrast to the songs about breakups and unrequited love other pop stars were singing at the time.[205] Writing for Bustle, Taylor Ferber praised the female-driven lyrics as ahead of their time, citing the inclusivity and optimism of songs such as \"Spice Up Your Life\" and the sex-positivity of \"Last Time Lover\" and \"Naked\". Ferber concluded: \"Between all of their songs about friendship, sex, romance, and living life, a central theme in almost all Spice Girls music was loving yourself first.\"[202]\n\nVocal arrangements [ edit ]\n\nFive women in a band together, sharing songwriting credit and vocal duties equally, was a new concept in British pop in 1996. Pitchfork in a retrospective review of Spice.[206]\n\nUnlike prior pop vocal groups, the Spice Girls shared vocals, rather than having a lead vocalist supported by others.[207] The group did not want any one member to be considered the lead singer, and so each song was divided into one or two lines each, before all five voices harmonised in the chorus. The group faced criticism as this meant that no one voice could stand out, but Sinclair concluded that it \"was actually a clever device to ensure that they gained the maximum impact and mileage from their all-in-it-together girl-gang image\".[207]\n\nThe Spice Girls' former vocal coach, Pepi Lemer, described their individual voices as distinct and easy to distinguish, citing the \"lightness\" of Bunton's voice and the \"soulful sound\" of Brown's and Chisholm's.[208] Biographer Sean Smith cited Chisholm as the vocalist the group could not do without.[209] Sinclair noted that while Chisholm's ad libs are a distinctive feature of certain Spice Girls songs, the difference in the amount of time her voice was featured over any other member was negligible.[210]\n\nWhile vocal time was distributed equally, musicologist Nicola Dibben found that there was an \"interesting inequality\" in the way that vocal styles were distributed within the group, which she felt conformed to certain stereotypes associated with race and socioeconomic background.[204] According to Dibben, most of the declamatory style of singing in the group's singles were performed by Brown, the only black member, and Chisholm, whom Dibben classified as white working class; this was in contrast to the more lyrical sections allotted to Beckham, whom Dibben classified as white middle class.[204]\n\nSongwriting [ edit ]\n\nThe Spice Girls did not play instruments,[211] but co-wrote all of their songs.[212][213][214][215] According to their frequent collaborator Richard Stannard, they had two approaches to songwriting: ballads were written in a traditional way with the group sitting around a piano, while songs such as \"Wannabe\" were the result of tapping into their \"mad\" energy.[130] Eliot Kennedy, another regular co-writer, said that songwriting sessions with the Spice Girls were \"very quick and short\".[212] He described his experience working with them:\n\nWhat I said to them was, \"Look, I've got a chorus—check this out.\" And I'd sing them the chorus and the melody—no lyrics or anything—and straight away five pads and pencils came out and they were throwing lines at us. Ten minutes later, the song was written. Then you go through and refine it. Then later, as you were recording it you might change a few things here and there. But pretty much it was a real quick process. They were confident in what they were doing, throwing it out there.[211]\n\nAbsolute's Paul Wilson recalled an experience whereby he and Watkins were responsible for writing the backing track and the group would then write the lyrics. Watkins added: \"I wasn't an 18-year-old girl. They always had this weird ability to come up with phrases that you'd never heard of.\"[212] He said the members would create dance routines at the same time as writing songs,[198] and that \"They knew what they wanted to write about, right from day one. You couldn't force your musical ideas upon them.\"[198]\n\nFrom the onset, the Spice Girls established a strict 50–50 split of the publishing royalties between them and their songwriting collaborators. As with their vocal arrangements, they were also adamant on maintaining parity between themselves in the songwriting credits.[216][nb 7] Sinclair said:\n\nThe deal between themselves was a strict five-way split on their share of the songwriting royalties on all songs irrespective of what any one member of the group had (or had not) contributed to any particular song. Apart from ease of administration, this was also a symbolic expression of the unity which was so much part and parcel of the Spice philosophy.[216]\n\nSinclair identified Halliwell as a major source of ideas for the Spice Girls' songs, including many of the concepts and starting points for the group's songs.[212] Tim Hawes, who worked with the group when they were starting out, said Halliwell's strength was in writing lyrics and pop hooks, and estimated that she was responsible for 60–70% of the lyrics in the songs he worked on.[44] The group's collaborators credit the other members of the group as being more active than Halliwell in constructing the melodies and harmonies of their songs.[44][198][212] Matt Rowe, who wrote several songs with the Spice Girls, agreed that Halliwell was particularly good when it came to writing lyrics and credits the lyrics for \"Viva Forever\" to her. He felt that all five members had contributed equally to the songwriting.[216]\n\nCultural impact and legacy [ edit ]\n\nPop music resurgence and girl group boom [ edit ]\n\nThe Spice Girls broke onto the music scene at a time when alternative rock, hip-hop and R&B dominated global music charts. In the group's first ever interview in May 1996, Halliwell told Music Week: \"We want to bring some of the glamour back to pop, like Madonna had when we were growing up. Pop is about fantasy and escapism, but there's so much bullshit around at the moment.\"[59] The modern pop phenomenon that the Spice Girls created by targeting early Millennials was credited with changing the music landscape by reviving the pop music genre,[217][218][219] bringing about the global wave of late-1990s and early-2000s teen pop acts such as the Backstreet Boys, Britney Spears, Christina Aguilera and NSYNC.[220][221][222][223]\n\nThe Spice Girls have also been credited with paving the way for the girl groups and female pop singers that have come after them.[224][225][226] Unlike previous girl groups such as the Andrews Sisters whose target market was male record buyers, the Spice Girls redefined the girl group concept by going after a young female fanbase instead.[1][2] In the UK, they are further credited for disrupting the then male-dominated pop music scene.[226][227] Prior to the Spice Girls, girl groups such as Bananarama have had hit singles in the UK but their album sales were generally underwhelming.[228] The accepted wisdom within the British music industry at the time was that an all-girl pop group would not work because both girls and boys would find the concept too threatening.[229] Teen magazines such as Smash Hits and Top of the Pops initially refused to feature the Spice Girls on the assumption that a girl group would not appeal to their female readership.[1] The massive commercial breakthrough of the Spice Girls turned the tide, leading to an unprecedented boom of new girl groups in the late 1990s and early 2000s.[2][230]\n\nAs managers and record labels scrambled to find the next Spice Girls, around 20 new girl groups were launched in the UK in 1999, followed by another 35 the next year.[230] Groups that emerged during this period include All Saints, B*Witched, Atomic Kitten, Girl Thing, Girls@Play, Girls Aloud and the Sugababes, all hoping to emulate the Spice Girls' success.[2][230][231] Outside of the UK and Ireland, girl groups such as New Zealand's TrueBliss,[232] Australia's Bardot,[233] Germany's No Angels,[234] Spain's Bellepop,[235] US's Cheetah Girls,[236][237] as well as South Korea's Baby Vox[238] and f(x) were also modelled after the Spice Girls.[239]\n\nTwenty-first-century girl groups continue to cite the Spice Girls as a major source of influence, including the Pussycat Dolls,[240] 2NE1,[241] Girls' Generation,[242] Little Mix,[243][244] Fifth Harmony,[245] and Haim.[246] Solo female artists who have been similarly influenced by the group include Jess Glynne,[247] Foxes,[247] Alexandra Burke,[247] Charli XCX,[248][249] Rita Ora,[250] Billie Eilish,[251] and Beyoncé.[252] During her 2005 \"Reflections\" concert series, Filipina superstar Regine Velasquez performed a medley of five Spice Girls songs as a tribute to the band she says were a major influence on her music.[253] Danish singer-songwriter MØ decided to pursue music after watching the Spice Girls on TV as a child, saying in a 2014 interview: \"I have them and only them to thank—or to blame—for becoming a singer.\"[254] 15-time Grammy Award-winning singer-songwriter Adele credits the Spice Girls as a major influence in regard to her love and passion for music, stating that \"they made me what I am today\".[255][256]\n\nGirl power [ edit ]\n\n\"Girl power\" was a label for the particular facet of feminist empowerment embraced by the band, emphasising female confidence,[203] individuality and sisterhood.[201][257][258] The Spice Girls' particular approach to \"girl power\" was seen as a boisterous, independent, and sex-positive response to \"lad culture\".[259] The phrase was regularly espoused by all five members—although most closely associated with Halliwell—and was often delivered with a peace sign.[260] The \"girl power\" slogan was originally coined by US punk band Bikini Kill in 1991 and subsequently appeared in a few songs in the early and mid-1990s; most notably, it was the title of British pop duo Shampoo's 1996 single which Halliwell later said was her introduction to the phrase.[261][262] Although the term did not originate with them, it was not until the emergence of the Spice Girls in 1996 that \"girl power\" exploded onto the mainstream consciousness.[200] According to Chisholm, the band were inspired to champion this cause as a result of the sexism they encountered when they were first starting out in the music business.[263] Industry insiders credit Halliwell as being the author of the group's \"girl power\" manifesto,[229][264] while Halliwell herself once spoke of former British prime minister Margaret Thatcher as being \"the pioneer of our ideology.\"[nb 8]\n\nIn all, the focused, consistent presentation of \"girl power\" formed the centrepiece of their appeal as a band.[1][266] The Spice Girls' brand of postfeminism was distinctive and its message of empowerment appealed to young girls, adolescents and adult women; by being politically neutral, it did not alienate consumers with different allegiances.[257][19][259] Virgin's director of press Robert Sandall explained the novelty of the group: \"There had never been a group of girls who were addressing themselves specifically to a female audience before.\"[267] Similarly, John Harlow of The Sunday Times believed it was this \"loyal[ty] to their sex\" that set the Spice Girls apart from their predecessors, enabling them to win over young female fans where previous girl groups had struggled.[1] While \"girl power\" put a name to a social phenomenon, it was met with mixed reactions.[257][268] Some commentators credit the Spice Girls with reinvigorating mainstream feminism—popularised as \"girl power\"—in the 1990s,[200][269] with their mantra serving as a gateway to feminism for their young fans.[205][268][270] Conversely, critics dismiss it as no more than a shallow marketing tactic and accuse the group of commercialising the social movement.[203][19] Regardless, \"girl power\" became a cultural phenomenon,[271] adopted as the mantra for millions of girls[205][257] and even making it into the Oxford English Dictionary.[272] In summation of the concept, author Ryan Dawson said, \"The Spice Girls changed British culture enough for Girl Power to now seem completely unremarkable.\"[26]\n\nThe Spice Girls perform \"Wannabe\" as a four-piece on 15 June 2019. The song has become emblematic of the group's girl power manifesto.\n\nIn keeping with their \"girl power\" manifesto, the Spice Girls' songs have been praised for their \"genuinely empowering messages about friendship and sisterhood,\"[201] which set them apart from the typical love songs their pop contemporaries were singing.[205] Billboard magazine said their lyrics \"demonstrated real, noncompetitive female friendship,\" adding that the messages the Spice Girls imparted have held up well compared to the lyrics sung by later girl groups such as the Pussycat Dolls.[200] The group's debut single \"Wannabe\" has been hailed as an \"iconic girl power anthem\".[273][274][275] In 2016, the United Nations launched their #WhatIReallyReallyWant Global Goals campaign by filming a remake of the \"Wannabe\" music video to highlight gender inequality issues faced by women across the world. The video, which premiered on YouTube and ran in movie theatres internationally,[276] featured British girl group M.O, Canadian \"viral sensation\" Taylor Hatala, Nigerian-British singer Seyi Shay and Bollywood actress Jacqueline Fernandez lip-syncing to the song in various locations around the world.[277] In response to the remake, Beckham said, \"How fabulous is it that after 20 years the legacy of the Spice Girls' girl power is being used to encourage and empower a whole new generation?\"[276]\n\nAt the 43rd People's Choice Awards in 2017, Blake Lively dedicated her \"Favorite Dramatic Movie Actress\" award to \"girl power\" in her acceptance speech; she credited the Spice Girls, saying: \"What was so neat about them was that they're all so distinctly different, and they were women, and they owned who they were, and that was my first introduction into girl power.\"[278] In 2018, Rolling Stone named the Spice Girls' \"girl power\" ethos on The Millennial 100, a list of 100 people, music, cultural touchstones and movements that have shaped the Millennial generation.[279] Writing in 2019 about the group's influence on what she called the \"Spice Girls Generation\", Caity Weaver of The New York Times concluded, \"Marketing ploy or not, 'Girl power' had become a self-fulfilling prophecy.\"[54]\n\nCool Britannia [ edit ]\n\nThe term \"Cool Britannia\" became prominent in the media in the 1990s and represented the new political and social climate that was emerging with the advances made by New Labour and the new British prime minister Tony Blair.[280] Coming out of a period of 18 years of Conservative government, Tony Blair and New Labour were seen as young, cool and appealing, a driving force in giving Britain a feeling of euphoria and optimism.[281]\n\nAlthough by no means responsible for the onset of \"Cool Britannia\", the arrival of the Spice Girls added to the new image and re-branding of Britain, and underlined the growing world popularity of British, rather than American, pop music. This fact was underlined at the 1997 Brit Awards; the group won two awards[282] but it was Halliwell's iconic red, white and blue Union Jack mini-dress that appeared in media coverage around the world,[283] becoming an enduring image of \"Cool Britannia\".[81][284] The Spice Girls were identified as part of another British Invasion of the US,[285] and in 2016, Time acknowledged the Spice Girls as \"arguably the most recognisable face\" of \"Cool Britannia\".[3]\n\nImage, nicknames and fashion trends [ edit ]\n\nThe Spice Girls' image was deliberately aimed at young girls, an audience of formidable size and potential. Instrumental to their range of appeal within this demographic was their five distinct personalities and styles, which encouraged fans to identify with one member or another. This rejection of a homogeneous group identity was a stark departure from previous groups such as the Beatles and the Supremes,[19][286][287] and the Spice Girls model has since been used to style other pop groups such as One Direction.[288][289]\n\nThe band's image was inadvertently bolstered by the nicknames bestowed on them by the British press. After a lunch with the Spice Girls in the wake of \"Wannabe\"'s release, Peter Loraine, the then-editor of Top of the Pops magazine, and his editorial staff decided to devise nicknames for each member of the group based on their personalities. Loraine explained, \"In the magazine we used silly language and came up with nicknames all the time so it came naturally to give them names that would be used by the magazine and its readers; it was never meant to be adopted globally.\"[228] Shortly after using the nicknames in a magazine feature on the group, Loraine received calls from other British media outlets requesting permission to use them, and before long the nicknames were synonymous with the Spice Girls.[228][258] Jennifer Cawthron, one of the magazine's staff writers, explained how the nicknames were chosen:\n\nVictoria was 'Posh Spice', because she was wearing a Gucci-style mini dress and seemed pouty and reserved. Emma wore pigtails and sucked a lollipop, so obviously she was 'Baby Spice'. Mel C spent the whole time leaping around in her tracksuit, so we called her 'Sporty Spice'. I named Mel B 'Scary Spice' because she was so shouty. And Geri was 'Ginger Spice', simply because of her hair. Not much thought went into that one.[258]\n\nIn a 2020 interview, Chisholm explained that the Spice Girls' image came about unintentionally when, after initially trying to coordinate their outfits as was expected of girl groups at the time, the group decided to just dress in their own individual styles. According to Chisholm, they \"never thought too much more of it\" until after \"Wannabe\" was released and the press gave them their nicknames. The group embraced the nicknames and grew into caricatures of themselves, which Chisholm said was \"like a protection mechanism because it was like putting on this armour of being this, this character, rather than it actually being you.\"[290]\n\nEach Spice Girl adopted a distinct, over-the-top trademark style that served as an extension of her public persona.[291][292]\n\nFans dressed up as the Spice Girls, replicating their signature looks\n\nThe Spice Girls are considered style icons of the 1990s; their image and styles becoming inextricably tied to the band's identity.[291][301][302] They are credited with setting 1990s fashion trends such as Buffalo platform shoes and double bun hairstyles.[304][305] Their styles have inspired other celebrities including Katy Perry,[306] Charli XCX,[307] and Bollywood actress Anushka Ranjan.[308] Lady Gaga performed as Emma Bunton (Baby Spice) in high school talent shows[309] and Emma Stone chose \"Emma\" name inspired by Emma Bunton after she previously use name Riley Stone.[310] The group have also been noted for the memorable outfits they have worn, the most iconic being Halliwell's Union Jack dress from the 1997 Brit Awards.[311] The dress was sold at a charity auction to the Las Vegas Hard Rock Cafe for £41,320, giving Halliwell the Guinness World Record at that time for the most expensive piece of pop star clothing ever sold.[312][313]\n\nCommercialisation and celebrity culture [ edit ]\n\nAt the height of Spicemania, the Spice Girls were involved in a prolific marketing phenomenon.[15][75][314] Under the guidance of their mentor and manager Simon Fuller, they advertised for an unprecedented number of brands and became the most merchandised group in music history.[262][315] The group were also a frequent feature of the global press.[30][316] As a result, said biographer David Sinclair, \"So great was the daily bombardment of Spice images and Spice product that it quickly became oppressive even to people who were well disposed towards the group.\"[317] This was parodied in the video for their song \"Spice Up Your Life\", which depicts a futuristic dystopian city covered in billboards and adverts featuring the group. Similarly, the North American leg of their 1998 Spiceworld Tour introduced a whole new concert revenue stream when it became the first time advertising was used in a pop concert.[318][319] Overall, the Spice Girls' earnings in the 1990s were on par with that of a medium-sized corporation thanks in large part to their marketing endeavours,[15] with their global gross income estimated at $500–800 million by May 1998.[14][nb 1]\n\nIn his analysis of the group's enduring influence on 21st-century popular culture, John Mckie of the BBC observed that while other stars had used brand endorsements in the past, \"the Spice brand was the first to propel the success of the band\".[19] Christopher Barrett and Ben Cardew of Music Week credited Fuller's \"ground-breaking\" strategy of marketing the Spice Girls as a brand with revolutionising the pop music industry, \"paving the way for everything from The White Stripes cameras to U2 iPods and Girls Aloud phones.\"[75] Barrett further noted that pop music and brand synergy have become inextricably linked in the modern music industry, which he attributed to the \"remarkable\" impact of the Spice Girls.[228] The Guardian's Sylvia Patterson also wrote of what she called the group's true legacy: \"[T]hey were the original pioneers of the band as brand, of pop as a ruthless marketing ruse, of the merchandising and sponsorship deals that have dominated commercial pop ever since.\"[223]\n\nThe mainstream media embraced the Spice Girls at the peak of their success. The group received regular international press coverage and were constantly followed by paparazzi.[320] Paul Gorman of Music Week said of the media interest in the Spice Girls in the late 1990s: \"They inaugurated the era of cheesy celebrity obsession which pertains today. There is lineage from them to the Kardashianisation not only of the music industry, but the wider culture.\"[19] The Irish Independent's Tanya Sweeney agreed that \"[t]he vapidity of paparazzi culture could probably be traced back to the Spice Girls' naked ambitions\",[268] while Mckie predicted that, \"[f]or all that modern stars from Katy Perry to Lionel Messi exploit brand endorsements and attract tabloid coverage, the scale of the Spice Girls' breakthrough in 1996 is unlikely to be repeated—at least not by a music act.\"[19]\n\n1990s and gay icons [ edit ]\n\nMuch as the Spice Girls broke (and still retain) records for chart-climbing in their prime, they remain an anomaly of the pop machine—still household-name famous two decades on. Perhaps it was their original prowess, or the press's continued fascination with them, but the Spice Girls remain a cultural touchstone while their contemporaries ... have struggled to. The Daily Telegraph in a 2018 article.[321]\n\nThe Spice Girls have been labelled the biggest pop phenomenon of the 1990s[28] due to the international record sales,[322] iconic symbolism, global cultural influence[291][316] and apparent omnipresence they held during the decade.[5][314] The group appeared on the cover of the July 1997 edition of Rolling Stone accompanied with the headline, \"Spice Girls Conquer the World\".[323] At the 2000 Brit Awards, the group received the Outstanding Contribution to Music Award in honour of their success in the global music scene in the 1990s.[322] The iconic symbolism of the Spice Girls in the 1990s is partly attributed to their era-defining outfits,[291] the most notable being the Union Jack dress that Halliwell wore at the 1997 Brit Awards. The dress has achieved iconic status, becoming one of the most prominent symbols of 1990s pop culture.[28][80] The status of the Spice Girls as 1990s pop culture icons is also attributed to their vast marketing efforts and willingness to be a part of a media-driven world.[19] Their unprecedented appearances in adverts and the media solidified the group as a phenomenon—an icon of the decade and for British music.[4][226]\n\nA study conducted by the British Council in 2000 found that the Spice Girls were the second-best-known Britons internationally—only behind then-Prime Minister Tony Blair—and the best-known Britons in Asia.[324] The group were featured in VH1's I Love the '90s and the sequel I Love the '90s: Part Deux; the series covered cultural moments from 1990s with the Spice Girls' rise to fame representing the year 1997, while Halliwell quitting the group represented 1998.[325][326] In 2006, ten years after the release of their debut single, the Spice Girls were voted the biggest cultural icons of the 1990s with 80 per cent of the votes in a UK poll of 1,000 people carried out for the board game Trivial Pursuit, stating that \"Girl Power\" defined the decade.[327][328] The Spice Girls also ranked number ten in the E! TV special, The 101 Reasons the '90s Ruled.[329]\n\nSome sources, especially those in the United Kingdom, regard the Spice Girls as gay icons.[330][331] In a 2007 UK survey of more than 5,000 gay men and women, Beckham placed 12th and Halliwell placed 43rd in a ranking of the top 50 gay icons.[332] Halliwell was the recipient of the Honorary Gay Award at the 2016 Attitude Awards[333] and Chisholm was given the \"Celebrity Ally\" award at the 2021 British LGBT Awards.[334] In a 2005 interview, Bunton attributed their large gay following to the group's fun-loving nature, open-mindedness and their love of fashion and dressing up.[335] The LGBTQ magazine Gay Times credits the Spice Girls as having been \"ferocious advocates of the community\" throughout their whole career.[336] According to Bunton, the LGBTQ community was a big influence on the group's music. A desire to be more inclusive also led the group to change the lyrics in \"2 Become 1\"; the lyric \"Any deal that we endeavour/boys and girls feel good together\" appears in their debut album but was changed to \"Once again if we endeavour/love will bring us back together\" for the single and music video release.[336]\n\nPortrayal in the media [ edit ]\n\nThe Spice Girls became media icons in Great Britain and a regular feature of the British press.[5][30] During the peak of their worldwide fame in 1997, the paparazzi were constantly seen following them everywhere[320] to obtain stories and gossip about the group, such as a supposed affair between Emma Bunton and manager Simon Fuller, or constant split rumours which became fodder for numerous tabloids.[5][337][338][339] Rumours of in-fighting and conflicts within the group also made headlines, with the rumours suggesting that Geri Halliwell and Melanie Brown in particular were fighting to be the leader of the group.[14] Brown, who later admitted that she used to be a \"bitch\" to Halliwell, said the problems had stayed in the past.[340] The rumours reached their height when the Spice Girls dismissed their manager Simon Fuller during the power struggles, with Fuller reportedly receiving a £10 million severance cheque to keep quiet about the details of his sacking.[14][338][339] Months later, in May 1998, Halliwell would leave the band amid rumours of a falling out with Brown; the news of Halliwell's departure was covered as a major news story by media around the world,[126] and became one of the biggest entertainment news stories of the decade.[127]\n\nIn February 1997 at the Brit Awards, Halliwell's Union Jack dress from the Spice Girls' live performance made all the front pages the next day. During the ceremony, Halliwell's breasts were exposed twice, causing controversy.[74] In the same year, nude glamour shots of Halliwell taken earlier in her career were released,[5] causing some scandal.[30]\n\nThe stories of their encounters with other celebrities also became fodder for the press;[5][341] for example, in May 1997, at The Prince's Trust 21st-anniversary concert, Brown and Halliwell breached royal protocol when they planted kisses on Prince Charles's cheeks, leaving it covered with lipstick, and later, Halliwell told him \"you're very sexy\" and also pinched his bottom.[342] In November, the British royal family were considered fans of the Spice Girls, including The Prince of Wales and his sons Prince William and Prince Harry.[343][344][345] That month, South African President Nelson Mandela said: \"These are my heroes. This is one of the greatest moments in my life\"[99] in an encounter organised by Prince Charles, who said, \"It is the second greatest moment in my life, the first time I met them was the greatest\".[99] Prince Charles would later send Halliwell a personal letter \"with lots of love\" when he heard that she had quit the Spice Girls.[342] In 1998 the video game magazine Nintendo Power created The More Annoying Than the Spice Girls Award, adding: \"What could possibly have been more annoying in 1997 than the Spice Girls, you ask?\".[346]\n\nVictoria Adams started dating football player David Beckham in late 1997 after they had met at a charity football match.[347] The couple announced their engagement in 1998[348] and were dubbed \"Posh and Becks\" by the media, becoming a cultural phenomenon in their own right.[349]\n\nOther brand ventures [ edit ]\n\nFilm [ edit ]\n\nSpice World (1997) The Spice Girls' bus used in the film(1997)\n\nThe group made their film debut in Spice World with director Bob Spiers. Meant to accompany their sophomore album, the style and content of the movie was in the same vein as the Beatles' films in the 1960s such as A Hard Day's Night. The light-hearted comedy, intended to capture the spirit of the Spice Girls, featured a plethora of stars including Richard E. Grant, Alan Cumming, Roger Moore, Hugh Laurie, Stephen Fry, Elton John, Richard O'Brien, Bob Hoskins, Jennifer Saunders, Elvis Costello and Meat Loaf.[350]\n\nSpice World was released in December 1997 and proved to be a hit at the box office, taking in over $100 million worldwide.[86] Despite being a commercial success, the film was widely panned by critics;[86] the movie was nominated for seven awards at the 1999 Golden Raspberry Awards where the Spice Girls collectively won the award for \"Worst Actress\". Considered a cult classic,[351] several critics have reevaluated the film more positively in the years following its initial release.[86][352] Since 2014, the Spice Bus, which was driven by Meat Loaf in the film, has been on permanent display at the Island Harbour Marina on the Isle of Wight, England.[353]\n\nTelevision [ edit ]\n\nThe Spice Girls have hosted and starred in various television specials. In November 1997, they became the first pop group to host ITV's An Audience with...;[113] their show featured an all-female audience and was watched by 11.8 million viewers in the UK, one fifth of the country's population.[114] The group hosted the Christmas Day edition of Top of the Pops on BBC One in 1996.[354] The following year, a special Christmas Eve edition of the BBC series was dedicated to them, titled \"Spice Girls on Top of the Pops\".[355] The group have also starred in numerous MTV television specials, including Spice Girls: Girl Power A–Z and MTV Ultrasound, Sugar and Spice and Everything Nice.[356] Their concerts have also been broadcast in various countries: Girl Power! Live in Istanbul (1997) was broadcast on ITV,[355] Showtime,[356] and Fox Family Channel;[357] Spiceworld Tour (1998) was broadcast on Sky Box Office;[358] and Christmas in Spiceworld (1999) was broadcast on Sky One and Fox Kids, among others.[359]\n\nThe group have starred in television commercials for brands such as Pepsi,[360] Polaroid, Walkers, Impulse and Tesco.[155] They have also released a few official documentary films, including Spice Girls in America: A Tour Story (1999)[128] and Giving You Everything (2007).[149] Making-of documentaries for their film Spice World were broadcast on Channel 5[355] and MTV.[361] The Spice Girls have been the subject of numerous unofficial documentary films, commissioned and produced by individuals independent of the group, including Raw Spice (2001), Seven Days That Shook the Spice Girls (2002), and Spice Girls: How Girl Power Changed Britain (2021). The group have had episodes dedicated to them in several music biography series, including VH1's Behind the Music, E! True Hollywood Story and MTV's BioRhythm.[362]\n\n[363] Hundreds of different Spice Girls-branded products were put on the market, including cameras and radios.\n\nIn the late 1990s, the Spice Girls were involved in a prolific marketing phenomenon that saw them become the most merchandised group in music history.[315] They negotiated lucrative endorsement deals with numerous brands, including Pepsi, Asda, Cadbury and Target,[315] which led to accusations of overexposure and \"selling out\".[104] The group was estimated to have earned over £300 million ($500 million) from their marketing endeavours in 1997 alone.[16][17] Their subsequent reunion concert tours saw the Spice Girls launch new sponsorship and advertising campaigns with the likes of Tesco and Victoria's Secret in 2007,[155][364] and Walkers and Mr. Men in 2019.[181][365]\n\nViva Forever! [ edit ]\n\nViva Forever! is a jukebox musical written by Jennifer Saunders, produced by Judy Craymer and directed by Paul Garrington. Based on the songs of the Spice Girls, the musical ran at the Piccadilly Theatre in the West End from 11 December 2012 to 29 June 2013.[366]\n\nCareer records and achievements [ edit ]\n\nAs a group, the Spice Girls have received a number of notable awards, including five Brit Awards, three American Music Awards, four Billboard Music Awards, three MTV Europe Music Awards, one MTV Video Music Award and three World Music Awards. They have also been recognised for their songwriting achievements with two Ivor Novello Awards.[89] In 2000, they received the Brit Award for Outstanding Contribution to Music, making them the youngest recipients of the Lifetime Achievement award whose previous winners include Elton John, the Beatles and Queen.[322][367]\n\nThe Spice Girls are the best-selling British act of the 1990s, having comfortably outsold all of their peers including Oasis and the Prodigy.[199] They are, by some estimates, the best-selling girl group of all time.[21][22][23] They have sold 100 million records worldwide,[20] achieving certified sales of 13 million albums in Europe,[73] 14 million records in the US[77] and 2.4 million in Canada.[102] The group achieved the highest-charting debut for a UK group on the Billboard Hot 100 at number five with \"Say You'll Be There\". They are also the first British band since the Rolling Stones in 1975 to have two top-ten albums in the US Billboard 200 albums chart at the same time (Spice and Spiceworld).[103] In addition to this, the Spice Girls also achieved the highest-ever annual earnings by an all-female group with an income of £29.6 million (approximately US$49 million) in 1998.[368] In 1999, they ranked sixth in Forbes' inaugural Celebrity 100 Power Ranking, which made them the highest-ranking musicians.[369]\n\nThey produced a total of nine number one singles in the UK—tied with ABBA behind Take That (eleven), The Shadows (twelve), Madonna (thirteen), Westlife (fourteen), Cliff Richard (fourteen), the Beatles (seventeen) and Elvis Presley (twenty-one). The group had three consecutive Christmas number-one singles in the UK (\"2 Become 1\", 1996; \"Too Much\", 1997; \"Goodbye\", 1998); they only share this record with the Beatles and LadBaby.[370] Their first single, \"Wannabe\", is the most successful song released by an all-female group.[61][312] Debuting on the US Billboard Hot 100 chart at number eleven, it is also the highest-ever-charting debut by a British band in the US, beating the previous record held by the Beatles for \"I Want to Hold Your Hand\" and the joint highest entry for a debut act, tying with Alanis Morissette.[74]\n\nSpice is the 18th-best-selling album of all time in the UK with over 3 million copies sold, and topped the charts for 15 non-consecutive weeks, the most by a female group in the UK.[71] It is also the best-selling album of all time by a girl group, with sales of over 23 million copies worldwide.[9] Spiceworld shipped 7 million copies in just two weeks, including 1.4 million in Britain alone—the largest-ever shipment of an album over 14 days.[371] They are also the first act (and so far only female act) to have their first six singles (\"Wannabe\", \"Say You'll Be There\", \"2 Become 1\", \"Mama\"/\"Who Do You Think You Are\", \"Spice Up Your Life\" and \"Too Much\") make number one on the UK charts. Their run was broken by \"Stop\", which peaked at number two in March 1998.[372]\n\nThe Spice Girls have the highest-grossing concert tours by an all-female group across two decades (2000–2020), grossing nearly $150 million in ticket sales across 58 shows.[13] They are also the most-merchandised group in music history.[315] Their Spice Girls dolls are the best-selling celebrity dolls of all time with sales of over 11 million;[373][374] the dolls were the second-best-selling toy, behind the Teletubbies, of 1998 in the US according to the trade publication Playthings.[375] Their film, Spice World, broke the record for the highest-ever weekend debut on Super Bowl weekend (25 January 1998) in the US, with box office sales of $10,527,222. Spice World topped the UK video charts on its first week of release, selling over 55,000 copies on its first day in stores and 270,000 copies in the first week.[376][377]\n\nIn popular culture [ edit ]\n\nSpice World at the Geri Halliwell's swimsuit fromat the Hard Rock Cafe in Tokyo, Japan\n\nIn February 1997, the \"Sugar Lumps\", a satirical version of the Spice Girls played by Kathy Burke, Dawn French, Llewella Gideon, Lulu and Jennifer Saunders, filmed a video for British charity Comic Relief. The video starts with the Sugar Lumps as schoolgirls who really want to become pop stars like the Spice Girls, and ends with them joining the group on stage, while dancing and lip-syncing the song \"Who Do You Think You Are\".[378] The Sugar Lumps later joined the Spice Girls during their live performance of the song on Comic Relief's telethon Red Nose Day event in March 1997.[379] In January 1998, a fight between animated versions of the Spice Girls and pop band Hanson was the headlining matchup in MTV's claymation parody Celebrity Deathmatch Deathbowl '98 special that aired during the Super Bowl XXXII halftime.[380][381] The episode became the highest-rated special in the network's history and MTV turned the concept into a full-fledged television series soon after.[382]\n\nIn March 2013, the Glee characters Brittany (Heather Morris), Tina (Jenna Ushkowitz), Marley (Melissa Benoist), Kitty (Becca Tobin) and Unique (Alex Newell) dressed up as the Spice Girls and performed the song \"Wannabe\" on the 17th episode of the fourth season of the show.[383] In April 2016, the Italian variety show Laura & Paola on Rai 1 featured the hosts, Grammy Award-winning singer Laura Pausini and actress Paola Cortellesi, and their guests, Francesca Michielin, Margherita Buy and Claudia Gerini, dressed up as the Spice Girls to perform a medley of Spice Girls songs as part of a 20th-anniversary tribute to the band.[384][385] In December 2016, the episode \"Who Needs Josh When You Have a Girl Group?\" of the musical comedy drama series Crazy Ex-Girlfriend featured cast members Rachel Bloom, Gabrielle Ruiz and Vella Lovell performing an original song titled \"Friendtopia\", a parody of the Spice Girls' songs and \"girl power\" philosophy.[386][387] Rapper Aminé's 2017 single \"Spice Girl\" is a reference to the group, and the song's music video includes an appearance by Brown.[388] Other songs that reference the Spice Girls include \"Grigio Girls\" by Lady Gaga,[389] \"My Name Is\" by Eminem,[390] \"Polka Power!\" (a reference to \"Girl Power\") by \"Weird Al\" Yankovic,[391] \"Playinwitme\" by Kyle and Kehlani,[392] \"Kinky\" by Kesha,[393] and \"Spicy\" by Diplo, Herve Pagez and Charli XCX.[394]\n\nIn the late 1990s, Spice Girls parodies appeared in various American sketch comedy shows including Saturday Night Live (SNL), Mad TV[395] and All That. A January 1998 episode of SNL featured cast members, including guest host Sarah Michelle Gellar, impersonating the Spice Girls for two \"An Important Message About ...\" sketches.[396] In September 1998, the show once again featured cast members, including guest host Cameron Diaz, impersonating the Spice Girls for a sketch titled \"A Message from the Spice Girls\".[397][398] Nickelodeon's All That had recurring sketches with the fictional boy band \"The Spice Boys\", featuring cast members Nick Cannon as \"Sweaty Spice\", Kenan Thompson as \"Spice Cube\", Danny Tamberelli as \"Hairy Spice\", Josh Server as \"Mumbly Spice\", and a skeleton prop as \"Dead Spice\".[399]\n\nParodies of the Spice Girls have also appeared in major advertising campaigns. In 1997, Jack in the Box, an American fast-food chain restaurant, sought to capitalise on \"Spice mania\" in America by launching a national television campaign using a fictional girl group called the Spicy Crispy Chicks (a take off of the Spice Girls) to promote the new Spicy Crispy Sandwich. The Spicy Crispy Chicks concept was used as a model for another successful advertising campaign called the 'Meaty Cheesy Boys'.[224][400] At the 1998 Association of Independent Commercial Producers (AICP) Show, one of the Spicy Crispy Chicks commercials won the top award for humour.[401] In 2001, prints adverts featuring a parody of the Spice Girls, along with other British music icons consisting of the Beatles, Elton John, Freddie Mercury and the Rolling Stones, were used in the Eurostar national advertising campaign in France. The campaign won the award for Best Outdoor Campaign at the French advertising CDA awards.[402][403] In September 2016, an Apple Music advert premiered during the 68th Primetime Emmy Awards that featured comedian James Corden dressed up as various music icons including all five of the Spice Girls.[404]\n\nOther notable groups of people have been labelled as some variation of a play-on-words on the Spice Girls' name as an allusion to the band. In 1997, the term \"Spice Boys\" emerged in the British media as a term coined to characterise the \"pop star\" antics and lifestyles off the pitch of a group of Liverpool F.C. footballers that includes Jamie Redknapp, David James, Steve McManaman, Robbie Fowler and Jason McAteer.[405] The label has stuck with these footballers ever since, with John Scales, one of the so-called Spice Boys, admitting in 2015 that, \"We're the Spice Boys and it's something we have to accept because it will never change.\"[406] In the Philippines, the \"Spice Boys\" tag was given to a group of young Congressmen of the House of Representatives who initiated the impeachment of President Joseph Estrada in 2001.[407][408] The Australian/British string quartet Bond were dubbed by the international press as the \"Spice Girls of classical music\" during their launch in 2000 due to their \"sexy\" image and classical crossover music that incorporated elements of pop and dance music. A spokeswoman for the quartet said in response to the comparisons, \"In fact, they are much better looking than the Spice Girls. But we don't welcome comparisons. The Bond girls are proper musicians; they have paid their dues.\"[409][410] The Women's Tennis Association (WTA) doubles team of Martina Hingis and Anna Kournikova, two-time Grand Slam and two-time WTA Finals Doubles champions, dubbed themselves the \"Spice Girls of tennis\" in 1999.[411][412] Hingis and Kournikova, along with fellow WTA players Venus and Serena Williams, were also labelled the \"Spice Girls of tennis\", then later the \"Spite Girls\",[413][414] by the media in the late 1990s due to their youthfulness, popularity and brashness.[415]\n\nWax sculptures of the Spice Girls are currently on display at the famed Madame Tussaud's New York wax museum.[416][417] The sculptures of the Spice Girls (sans Halliwell) were first unveiled in December 1999, making them the first pop band to be modelled as a group since the Beatles in 1964 at the time.[418] A sculpture of Halliwell was later made in 2002,[419] and was eventually displayed with the other Spice Girls' sculptures after Halliwell reunited with the band in 2007. Since 2008, Spiceworld: The Exhibition, a travelling exhibition of around 5,000 Spice Girls memorabilia and merchandise, has been shown in museums across the UK.[420][421] The Spice Girls Exhibition, a collection of over 1,000 Spice Girls items owned by Alan Smith-Allison, was held at the Trakasol Cultural Centre in Limassol Marina, Cyprus in the summer of 2016.[422] Wannabe 1996–2016: A Spice Girls Art Exhibition, an exhibition of Spice Girls-inspired art, was held at The Ballery in Berlin in 2016 to celebrate the 20th anniversary of the group's debut single, \"Wannabe\".[423][424]\n\nDiscography [ edit ]\n\nConcerts [ edit ]\n\nBand members [ edit ]\n\nTimeline [ edit ]\n\nPublications [ edit ]\n\nBooks [ edit ]\n\nMagazines [ edit ]\n\nSpice Girls; Cripps, Rebecca (1997). \"Spice\". Spice: The Only Official Spice Girls Magazine . No. 1. John Brown Publishing.\n\nSpice Girls; Cripps, Rebecca (1997). \"Girl Power!\". Spice: The Only Official Spice Girls Magazine . No. 2. John Brown Publishing.\n\nSpice Girls; Cripps, Rebecca (1997). \"Girl Power to the Max\". Spice: The Only Official Spice Girls Magazine . No. 3. John Brown Publishing.\n\nSpice Girls; Cripps, Rebecca (1997). \"Welcome to Spiceworld\". Spice: The Only Official Spice Girls Magazine . No. 4. John Brown Publishing.\n\nSpice Girls; Cripps, Rebecca (1998). \"Summer Special\". Spice: The Only Official Spice Girls Magazine . No. 5. John Brown Publishing.\n\nSpice Girls; Cripps, Rebecca (1998). \"Win! A VIP Trip to Our Concert in New York\". Spice: The Only Official Spice Girls Magazine . No. 6. John Brown Publishing.\n\nSpice Girls; Cripps, Rebecca (1998). \"Friends Forever!\". Spice: The Only Official Spice Girls Magazine . No. 7. John Brown Publishing.\n\nSpice Girls; Cripps, Rebecca (1998). \"We're Home\". Spice: The Only Official Spice Girls Magazine . No. 8. John Brown Publishing.\n\nSpice Girls; Cripps, Rebecca (1999). \"Spicy Xmas!\". Spice: The Only Official Spice Girls Magazine. No. 9. John Brown Publishing.\n\nSee also [ edit ]\n\nNotes [ edit ]\n\nReferences [ edit ]\n\nCitations [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/timeline/p1ws0iq7dbigdu58port7y5hdyy0iwd.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/42/Spicegirls-holler.JPG/230px-Spicegirls-holler.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Spice_Cam_Polaroid_%28cropped%29.jpg/148px-Spice_Cam_Polaroid_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/Vintage_Spice_Girls_Novelty_Radio%2C_AM-FM_Bands%2C_Made_In_China%2C_Circa_1998.jpg/156px-Vintage_Spice_Girls_Novelty_Radio%2C_AM-FM_Bands%2C_Made_In_China%2C_Circa_1998.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/SpiceGirlWembley150619-122_%2849000557707%29.jpg/220px-SpiceGirlWembley150619-122_%2849000557707%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Spiceworld-gerihalliwell-outfit.jpg/170px-Spiceworld-gerihalliwell-outfit.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/SpiceGirlWembley150619-2_%2848999823438%29.jpg/220px-SpiceGirlWembley150619-2_%2848999823438%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Spice_Girls_Viva_Forever.jpg/220px-Spice_Girls_Viva_Forever.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/Spice_Girls_in_Toronto%2C_Ontario.jpg/225px-Spice_Girls_in_Toronto%2C_Ontario.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Spice_Girls_live_West_MacLaren_1997.jpg/240px-Spice_Girls_live_West_MacLaren_1997.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/The_Spice_Girls_Olympic_Closing_Ceremony_by_David_Jones.jpg/220px-The_Spice_Girls_Olympic_Closing_Ceremony_by_David_Jones.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Victoriaandemmaonpoleslv.jpg/215px-Victoriaandemmaonpoleslv.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/The_actual_Spice_Bus_from_the_film_Spice_World.jpg/220px-The_actual_Spice_Bus_from_the_film_Spice_World.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Gnome-mime-sound-openclipart.svg/50px-Gnome-mime-sound-openclipart.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/Spice_Girls_in_Toronto%2C_Ontario.jpg/1200px-Spice_Girls_in_Toronto%2C_Ontario.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/42/Spicy_spice_girls_%288089395518%29.jpg/220px-Spicy_spice_girls_%288089395518%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Geri_Halliwell_in_concert_cropped.jpg/200px-Geri_Halliwell_in_concert_cropped.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Spice_Girls_2008_01_cropped.jpg/230px-Spice_Girls_2008_01_cropped.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/Spice_Girls_in_Toronto%2C_Ontario.jpg/1200px-Spice_Girls_in_Toronto%2C_Ontario.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Spice_Girls", "title": "Spice Girls", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/Spice_Girls_in_Toronto%2C_Ontario.jpg/640px-Spice_Girls_in_Toronto%2C_Ontario.jpg", "width": 640, "height": 570}, "title": "Spice Girls - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}