{"url": "https://en.wikipedia.org/wiki/Jodie_Whittaker", "text": "English actress (born 1982)\n\nJodie Whittaker (born 17 June 1982) is an English actress who is best known as portraying the thirteenth incarnation of the Doctor in Doctor Who (2017–present) and as Beth Latimer in Broadchurch (2013–2017).\n\nShe came to prominence in her 2006 feature film debut Venus, for which she received British Independent Film Award and Satellite Award nominations. She was later praised for her roles in the cult science fiction film Attack the Block (2011) and the Black Mirror episode \"The Entire History of You\" (2011).\n\nOn 16 July 2017, the BBC announced that Whittaker would play the thirteenth incarnation of the Doctor[2] in Doctor Who. She formally assumed the role from Peter Capaldi in the 2017 Christmas special episode \"Twice Upon a Time\". Whittaker appeared in her first full series as The Doctor in the eleventh series, which premiered in October 2018. She continued in the role in the twelfth series in 2020 and thirteenth series in 2021.[3] It was announced on 29 July 2021 that she would step down after three special episodes in 2022.[4]\n\nEarly life [ edit ]\n\nJodie Whittaker[5] was born on 17 June 1982[5] in Skelmanthorpe, West Yorkshire. She is the second child and only daughter of Yvonne (née Auckland) and Adrian Whittaker.[6][7][8][9] She attended Scissett Middle School and Shelley High School before training at the Guildhall School of Music and Drama, graduating in 2005 with an acting gold medal.[10]\n\nCareer [ edit ]\n\nEarly career [ edit ]\n\nWhittaker made her professional debut in The Storm at Shakespeare's Globe in 2005.[10] She has since worked in film, television, radio and theatre. In 2007, she stood in at short notice for an unwell Carey Mulligan in the Royal Court's production of The Seagull, and appeared in a fundraising play at the Almeida Theatre.\n\nIn Whittaker's first major role, she co-starred as Jessie in the film Venus (2006), receiving British Independent Film Award and Satellite Award nominations. Her radio credits at that time included a 2008 adaptation of Blinded by the Sun by Stephen Poliakoff[11] and playing Lydia Bennett in Unseen Austen, an original drama by Judith French. In 2009, she worked on the films Ollie Kepler's Expanding Purple World and Perrier's Bounty, as well as the BBC Two drama Royal Wedding[12] and the short film Wish 143,[13] which was nominated for Best Live Action Short Film at the 83rd Academy Awards.[14]\n\nIn the early 2010s, Whittaker co-starred in the anthology series Accused (2010) and the adaptation of Sarah Waters's novel The Night Watch, followed by the role of Ffion in the Black Mirror episode \"The Entire History of You\". In film, she starred in the cult science fiction comedy horror Attack the Block, as well as in projects like The Kid (2010), One Day (2011), Hello Carter (2013) and Good Vibrations (2013). She also returned to the stage in the contemporary staging of the classic Greek tragedy Antigone, playing the title role opposite Christopher Eccleston as Creon.[15]\n\nIn 2014, she appeared as Sandra Grimes in the reality-based spy drama miniseries The Assets and as Anna in the BAFTA-nominated short film Emotional Fusebox, later reprising the role in its feature-length version, Adult Life Skills, and earning nominations in the Best Actress category at both the British Independent Film Awards and the National Film Awards.[16] She also took the lead roles in the hit ITV crime drama Broadchurch (2013–2017) and the four-part BBC One medical drama Trust Me (2017).[17]\n\nDoctor Who [ edit ]\n\nOn 16 July 2017, Whittaker was announced as the Thirteenth Doctor in the science fiction television series Doctor Who; she is the first woman to play the title role.[18][19][20] She had previously worked with incoming Doctor Who showrunner Chris Chibnall on Broadchurch.[21] She admitted that she had to \"tell a lot of lies\" after being cast to keep the information secret and used the codeword \"Clooney\" when talking about the role.[21] Whittaker kept her mother in \"the inner circle\" regarding knowledge of the role, as her father, Adrian, \"would have the ability to tell the world\".[22]\n\nShe urged fans not to be afraid of her gender, saying \"Doctor Who represents everything that's exciting about change. The fans have lived through so many changes, and this is only a new, different one, not a fearful one.\"[21] Chibnall said that he always wanted a woman for the part and that Whittaker was their first choice.[23]\n\nReaction to Whittaker's casting was mostly positive, although a \"sizeable minority\" was unhappy.[24] Some said that a female Doctor would be a good role model for young girls, while others felt the Doctor was only ever meant to be male, or criticised the casting as an exercise in political correctness.[25][26] Whittaker debuted in the 2017 Christmas special \"Twice Upon a Time\".[27][28]\n\nIn November 2018, the BBC confirmed that the twelfth series, Whittaker's second series, began production in November 2018.[29][30] Whittaker returned for the thirteenth series,[31] and is set to depart the programme following the series and three associated specials, to air by 2022.[32] She also voiced the Doctor in the 2022 BBC Sounds podcast Doctor Who: Redacted.[33]\n\nPersonal life [ edit ]\n\nWhittaker met Christian Contreras, a Belizean-American actor and writer, in drama school and they married in Arizona in 2008.[6] She gave birth to their daughter in April 2015.[34] They now live in London[2] and are expecting their second child in 2022.[35]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nStage [ edit ]\n\nRadio and podcast [ edit ]\n\nVideo games [ edit ]\n\nDiscography [ edit ]\n\nYear Title Album Notes Ref. 2019 \"Yellow\" BBC Children in Need: Got It Covered Single (#5 on the Official Big Top 40) [61]\n\nAwards and nominations [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Jodie_Whittaker_by_Gage_Skidmore.jpg/1200px-Jodie_Whittaker_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Jodie_Whittaker_by_Gage_Skidmore.jpg/220px-Jodie_Whittaker_by_Gage_Skidmore.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/15/Jodie_Whittaker_2014.jpg/220px-Jodie_Whittaker_2014.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Jodie_Whittaker_by_Gage_Skidmore.jpg/1200px-Jodie_Whittaker_by_Gage_Skidmore.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jodie_Whittaker", "title": "Jodie Whittaker", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Jodie_Whittaker_by_Gage_Skidmore.jpg/640px-Jodie_Whittaker_by_Gage_Skidmore.jpg", "width": 640, "height": 799}, "title": "Jodie Whittaker - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}