{"url": "https://www.drliv.com/avoid-acne-while-sleeping/", "text": "Salut, it’s me again, Dr. Liv Kraemer. I am a dermatologist living and working in Zurich, Switzerland. I have a lot of patients coming in into my office and asking what do to: They are suffering from acne and acne scars. Or they even have no active acne any more, but what is left are scars. So what can you do to prevent acne scars? What are possibilities of removing scars? Which treatment really works for acne scars? Are they painful? Is there hope for getting your smooth skin back? Let me give you some answers!\n\nWhat are scars?\n\nAcne scars are made of tissue that is quickly formed to prevent further damage to the skin. Let me explain it in a different way.\n\nIf you have parts of your skin cut in two pieces, your body thinks: “Alarm, alarm!” I am quite sure that you are probably unhappy about the scars building on your skin. But try to think differently: Your skin is the protection cover of your body, and your body will do everything to keep this cover sealed. Our body is doing some good thinking, right?\n\nSo what happens is this: If something cuts this cover, your body sends an alarm out. It does not want to these parts to stay apart. Because if the cover (your skin) gets damaged, bacteria and fungi can enter your body. The body wants to avoid this under all circumstances. Therefore, it will try everything to glue these parts back together. In any way, as quick as possible.\n\nWhat does this mean? It means the body will not use the best available glue (collagen). Instead, it will use the glue which is quickly formed, but not so high in quality. So instead of using a specific basketweave collagen formation as you find it in normal tissue, the body is using a quick-formed just cross-linked fiber formation. It forms a more pronounced alignment in a single direction. The result: A low quality tissue is being produced – a scar. It does not look great. Scar tissue does not have hair. It doesn’t have any of the great things normal tissue has. So you will never see sweat glands or hair follicles within scar tissue.\n\nBut the body did its job. The the two tissue parts are sticked back together: “Mission accomplished!” Now, the two tissue parts once cut in two will never move farther away from each other. Unfortunately, it does not look good. So let me explain what is possible to do against it.\n\nWhat are acne scars?\n\nFirst, let me say: If you are suffering from acne, try to get help as soon as possible. Why? Because as soon as acne scars are formed, it will not be so easy to remove them.\n\nAs explained before, the body tries everything to keep its superficial protection cover (your skin) to stay sealed, so that it protects your body against harmful things outside.\n\nLet me explain it this way: Your body will not tolerate any disruption of your skin. Therefore, your body does not care if the disruption happens from the inside (as with a pimple) or outside. As soon as your skin gets disrupted, the body will form this inferior quality collagen tissue. So if you are suffering from acne and if you start picking or manipulating around the inflamed tissue, you cause a big disruption to the skin. Suddenly, your body sends out the alarm and scar tissue gets formed to prevent your skin from making the disruption even bigger.\n\nAcne scarring is basically a consequence of a damage around your hair follicle which got inflamed. There are four different stages of scar formation. In dermatology, we call these different stages of scar forming\n\nhemostasis phase,\n\nresorption/ inflammation phase,\n\nproliferation phase (5.-21 day) and\n\nconsolidation/ remodeling phase (21-60 day).\n\nThe redness of scars will ultimately go away after some time, as this is the stage where your skin tries to get remodeling with vessel formation to help the healing process.\n\nWhat kind of acne scars are there?\n\nDepending on the pressure and the pull towards your disrupted skin, different scar tissue can develop. It can be lower than the surrounding tissue – we call that an atrophic scar. Or the scar is hard and bigger than the surrounding tissue. This is what we call hypertrophic tissue in dermatology. If the scar grows above the borders, we dermatologist are calling it a keloid.\n\nWe dermatologists differentiate 3 different types of acne scars that you can see in the table below. The three types of scars are: icepick, boxcar and rolling scars. Each type has a specific form that is best understood visually.\n\nWhere can acne scars occur?\n\nYou can have pimples everywhere you can find hair follicles. This means on all body parts – except your palms, soles or lips. These 3 areas do not have hair follicles. But everywhere else, you can get pimples, particularly on the face, neck and back. Therefore, you can also get acne scars all over these areas as well.\n\nSo please try not to pick on existing inflamed pimples. Because if the bacteria under your nails and on your fingertips are entering the channel around your follicle, then these bacteria can grow in the sebaceous glands. The consequence: The inflamation gets worse, the disruption to your skin gets worse – and so do your acne scars. Why is that? Well, with each manipulation of the pimple the risk is high that bacteria get spread. We in dermatology call this a “superinfection“. If this infection spreads, the bacteria can cause a disruption of the cannel. Hence, the skin tries to heal the disrupted channel and its surrounding tissue. Scar tissue is built.\n\nSo maybe you’re asking yourself now: How to prevent acne scars? The best way is not trying to heal acne by yourself. Try to get help with your acne while it is still active. The main thing you can do yourself to prevent scarring: Do not pick them, try not to squeeze them. Just that! It is so important.\n\nWhat kinds of acne scar treatments are there?\n\nThere are a lot of acne scars treatment advertised and discussed in social media, blogs and magazines, many of them promising to heal the scars. But as I explained above, scars are a special tissue which is not so easy to remove. Like a swiss watch, there are a lot of small wheels which have to be moved in order to move the big hand. What does that mean? There is not one single treatment or cream which will help make acne scars “disappear” from your skin. It is a combination of several treatments that will do the trick!\n\nChemical peels help to remove the top dead skin cells. Therefore, it is a great way to make the skin look smoother. It is also a great way to prepare the skin for further treatment like medical microneedling. In my office, I like to perform a chemical peel prior to a microdeeling RF treatment, in order to remove the dead skin cells before to make it more intense and efficient.\n\nHow does microneedling for acne scars work?\n\nWhat does microneedling mean? “Micro” means small, “needling” means the use of (small) needles. These small needles basically make just very small little wholes in the scar tissue to trick the skin: The skin thinks it get disrupted, but it does not. The skin does not produce the quick bad collagen, because it has enough time. Why? Because we tricked the skin with this treatment. The skin thinks that it gets disrupted but in reality it has enough time to produce new good collagen, as shown in my video above. Together with heat created through radiofrequency, the collagen in the depth shrinks. For this reason, you get a tightening effect on your skin visible from the outside.\n\nBut this process is one in which you “help your skin to help itself”. What does that mean? Your skin needs time to produce new collagen. Therefore you see the results not before 3 month after the first treatment. I normally recommend 3 treatments in a interval of 6-8 weeks. NOT MORE!!! The skin needs its time.\n\nIt is great for people who have sensitive skin and skin which normally gets pigmented easily. It is a very safe method. Because of the fact that people who tend to pigment can use this method, I prefer it to a fractional laser.\n\nSo how is it done? The skin has to be prepared. I never do the procedure if a patient hasn’t used active ingredients in his skin care before. “Your skin has to be trained before you do a “bootcamp”!” – That’s what I tell my patients. As mentioned before, I also love to do a fruit acid peeling before to get the most benefit of the treatment and ideally a jetpeel treatment after – to include the Vitamin C, chichis needed for collagen production afterwards. I also always give my patients special Vitamin C supplements to enhance the collagen production. No Vitamin C, no collagen. And because you are using the treatment for collagen enhancement, it is a great anti-aging treatment for boosting collagen and therefore treating elasticity loss.\n\nAcne scars laser treatment – for whom?\n\nFractional lasers are a lot like microneedling with radiofrequency, but they don’t go as deep. Instead of needles, you make small holes with a laser beam, which can cause pigmentations much easier.\n\nAs I said before, I much prefer microneedling to laser treatments. But if you want to do a laser treatment, please have it done by a dermatologist. It has to be done completely sterile and with sterile one-time adapter needles. A proper before and after treatment care is absolutely neccessary.\n\nAlso remember: Deeper does not mean better. So if someone says: “Oh, 3 mm is soo much better!” NO! Let you dermatologist decide which depth is adequate in your case. Normally, only physicians can do this procedure, if it goes deeper than 0.5 mm.\n\nAnd: You do not have to bleed if it is done right! I always get a heart attack if I see some Instagram or Pinterest picture with a bloody face. You do not want to hurt, and you do not have to. You just want to “trick” your skin, it is quite similar to acupuncture.\n\nFruit acid peelings against acne scars\n\nNo fruit acid peeling will ever remove acne scars. But because you remove dead skin cells and increase the cell turnover, chances are the vitality of acne scars gets reduced. If you want to know how fruit acid peels work, have a look on my other blog post and read more about it!\n\nDo treatments of acne scars make sense when your acne is still active?\n\nDefinetely not. Clearly, if you have acne scars, you might feel the urge to do away with them as soon as possible. But that really doesn’t help much if you still get new pimples causing new scarring. You might even do more harm than good.\n\nTherefore, first the acne must be treated, otherwise you might worsen your acne. Also, with each new pimple you might get a new scar, therefore the acne must be healed and then you start to think about treatments to help to reduce the visibility of your acne scars.\n\nAcne scar removal: What are the costs?\n\nIt really depends on the country you live in and on the area of your body you want to treat. Please look at your dermatologist’s website or call them.\n\nJust to give you one example: In my office in Zurich one region, e.g. the face, costs 800 CHF (approx. 850 US$). It takes about 90 minutes. During this time, you get a numbing cream (local anesthesia cream) under a foil to get really numb. You should not suffer from pain. The procedure itself is quite quick and – honestly – almost without pain.\n\nIs there a way to get rid of acne scars natually?\n\nOf course, this is what we all would like, isn’t it? Scars just disappearing all by themselves? The truth with acne scars is: That will hardly happen. Only if the acne scars are very superficial and you hide from the sun, there is a chance that they will fade by themselves. But most of the time, if there are acne scars, they stay. So you need to do a little more to get rid of them than simply waiting.\n\nHow to get rid of acne scars – home remedies\n\nA lot of people would like to avoid treatments that are what they feel is “artificial”, “technical” or “chemical”. Understandably. But while you can cure a simple cold with natural remedies, there’s so much available in terms of home remedies against acne. The best thing you can do ist: No picking, no scratching… and use suncream to reduce further discoloration of the scarred skin.\n\nCreams to heal acne scars\n\nThere are a lot of creams out there. All of them claiming to heal the scar tissue quick. Most of the scar treatment creams are useful for the first time after scars developed. The creams mostly contain silicons to keep the two separated pieces of tissue together. These kind of creams are helping to seal the two pieces most of the time – they work quite well with things like cuts. But with acne scars, this does not work. It also does not help if your acne scars are already there and prominent visible. Because if the scars are already developed, you can not remove them by just putting a cream on top and hoping on a miracle. To really make acne scars better, you should consider dermatologic help with usage if medical devices such as micro needling or microneedling with radiofrequency.\n\nHow to conceal acne scars\n\nIf acne scars are white, you can try to use camouflage to cover them up – try this one.\n\nIf the scars are still red, you might can use a make-up with green pigments. Green is the complementary color of red and therefore helps to neutralize the red color of the scars.\n\nBut remember: If you are using make-up, always remove it properly. Watch my Youtube video and read my blog how to wash your face right: click here to see the video!\n\nKey advice to share with your friends\n\nOkay, guys, so here it is again, my take away advice you can share with all your friends! If you have acne scars…\n\nTry not to pick your skin while you still get pimples. It’s the ideal prevention for scars.\n\nwhile you still get pimples. It’s the ideal prevention for scars. Try to heal your acne before you are treating the scars – get help asap with your acne!\n\nyou are treating the scars – get help asap with your acne! To get rid of scarring, use medical microneedling , ideally in combination with radiofrequency.\n\n, ideally in combination with radiofrequency. Use suncreams in order to avoid pigmentation while you have active acne and later on! Remember: No sun – no pigment.\n\nYou would like to learn more about healthy food, skin and beauty treatments? Follow me on my social media or give me some feedback on what you want to hear more about! Of course, you can also consult me in person:\n\nClick here for a personal consultation with Dr.Liv\n\nIn case you are not in Switzerland…\n\nRead more about healthy skin here on my social media accounts:\n\nYoutube! ➜ youtube.com/DrLiv\n\nFacebook! ➜ facebook.com/DrLiv\n\nInstagram! ➜ instagram.com/drliv/\n\nPinterest! ➜ pinterest.de/drlivkraemer/\n\nTwitter! ➜ twitter.com/doctorliv/\n\nThanks for your support, either with a comment now or with thumbs up – it helps me a lot!\n\nCheers,\n\nyours\n\nDr. Liv\n\n", "images": ["https://www.drliv.com/wp-content/uploads/2019/02/acne-scars.jpg", "https://www.drliv.com/clinic/wp-content/uploads/2019/02/drliv-acne-scars.jpg", "https://www.drliv.com/clinic/wp-content/uploads/2019/04/cropped-DrLiv-Logo-1.png"], "top_img": "https://www.drliv.com/clinic/wp-content/uploads/2019/02/drliv-acne-scars.jpg", "keywords": [], "authors": ["Liv Kraemer"], "canonical_link": "https://www.drliv.com/clinic/how-to-get-rid-of-acne-scars-tips-by-dr-liv/", "title": "", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "How to remove acne scars ✔ the best treatments ✔ home remedies ✔ prevent acne scars from appearing ➜ Check out the Dr Liv washing foam", "og": {"locale": "en_US", "type": "article", "title": "How to get rid of acne scars - tips by Dr. Liv", "description": "How to remove acne scars ✔ the best treatments ✔ home remedies ✔ prevent acne scars from appearing ➜ Check out the Dr Liv washing foam", "url": "https://www.drliv.com/clinic/how-to-get-rid-of-acne-scars-tips-by-dr-liv/", "site_name": "Dr. Liv Kraemer", "image": {"identifier": "https://www.drliv.com/clinic/wp-content/uploads/2019/02/drliv-acne-scars.jpg", "width": 640, "height": 358, "type": "image/jpeg"}, "video": {"identifier": "https://www.youtube.com/embed/w4VE5D3BcnQ", "type": "text/html", "duration": 433, "width": 480, "height": 270}}, "article": {"publisher": "https://www.facebook.com/DrLiv", "published_time": "2019-03-22T15:20:14+00:00", "modified_time": "2020-12-06T17:25:13+00:00"}, "author": "Liv Kraemer", "twitter": {"card": "summary_large_image", "creator": "@doctorliv", "site": "@doctorliv", "label1": "Written by", "data1": "Liv Kraemer", "label2": "Est. reading time", "data2": "14 minutes"}, "ya": {"ovs": {"adult": "false", "upload_date": "2019-03-22T15:20:14+00:00", "allow_embed": "true"}}, "generator": "WPML ver:4.5.10 stt:1,3;"}, "movies": ["https://www.youtube.com/embed/w4VE5D3BcnQ?feature=oembed&enablejsapi=1&origin=https://www.drliv.com"], "publish_date": 1553268014.0, "source": "https://www.drliv.com", "summary": ""}