{"url": "https://www.rollingstone.com/music/music-news/taylor-swifts-look-what-you-made-me-do-video-decoded-13-things-you-missed-126268/", "text": "Taylor Swift is nothing if not a vengeful lyricist and a pro at image reinvention; her new, darker, self-satirizing persona makes that abundantly clear. The singer, who dropped the music video for her scathing new single “Look What You Made Me Do” at Sunday night’s VMAs, hid numerous details in plain sight for her fans to see, interpret and discuss.\n\nThe song, which is an aural burn book of all of Swift’s past (and current) critics, takes aim at several of her more high-profile detractors with lines like “I don’t like your tilted stage” (a possible jab at West’s tilted stage on his Saint Pablo tour) and moments like her faux phone call announcing that “the old Taylor is dead,” reminiscent of her controversial recorded call with the rapper.\n\nBut Swift’s symbol-drenched music video, directed by Joseph Kahn, adds another layer to her good-girl-gone-bad anthem. Here are 13 things you may have missed during Sunday night’s premiere – and why they matter in the world of Swifties and perpetual shade-throwing.\n\n1. The Nils Sjoberg tombstone in the opening scene. As many will remember, Nils Sjoberg was the pseudonym that Swift used for a songwriting credit on her ex-boyfriend Calvin Harris’ 2016 summer hit, “This Is What You Came For.” When it was revealed that Swift was, in fact, the creative mind behind the single, some short-lived drama ensued, with Harris slamming his ex and bringing up her ongoing beef with Katy Perry.\n\n2. The “Out of the Woods” dress. When the music video opens, Swift bursts through the ground of a graveyard as a fully fledged zombie – wearing the iconic blue dress from her “Out of the Woods” music video. It’s notable that the video for her fairytale-inspired single was the last from her 1989 era, possibly indicating from the get-go that that era is done for good now. (Zombie Taylor is also a nice tribute to Michael Jackson’s “Thriller” video.)\n\n3. The 2014 Met Gala dress. Similarly, the Swift lying prone in the grave is wearing the very Oscar de la Renta gown that the singer wore to the Met Gala in 2014. At the time, the then-24-year-old pop singer called the opportunity to wear the designer’s gown “a daydream realized.”\n\n4. The single dollar bill in a bathtub full of diamonds. Swift’s decision to bathe in jewels and not money – but to feature a single dollar bill just beyond her right shoulder – was a very calculated one. Fans speculate that the single bill represents the $1 she was awarded after she won her sexual assault case against former radio DJ David Mueller.\n\n5. The “Et Tu Brute” etchings on her golden throne. The superstar looks regal sitting atop a gold throne covered in snakes, but there’s one subtle detail that adds a layer to Swift’s haughty posture. On the arm of the throne, as well as on the oversized columns on either side of her seat, is the phrase “Et tu Brute,” a quote from William Shakespeare’s Julius Caesar. The famous line was uttered by Caesar, who was literally stabbed in the back by his former friends.\n\n6. A snake serves Swift tea. One lucky reptile slithered straight up to Swift’s seat and poured the singer some piping hot tea at one point during her snake-charmer scene, a clear nod to the idea of Swift “serving tea” with the symbol-laden music video.\n\n7. Swift transforms into a Katy Perry lookalike. If elements of the scene where Swift crashes a gold sports car into a pole look familiar, it’s because they are. Swift’s hair in the scene looks remarkably similar to nemesis Perry’s ‘do, and the sports car itself is undeniably reminiscent to the car in Perry’s 2009 video for “Waking Up in Vegas.” Relatedly, following the slow-motion crash, the camera zooms in on a Grammy Award the singer is holding up; Swift has 10 Grammys while Perry has been nominated for several but has yet to win one.\n\n8. Swift and crew rob Stream Co. The singer dons a hoodie (that reads, in bedazzled letters, “Blind for love”) and swings a baseball bat to break and enter into a bank vault that boasts the name “Stream Co.” – a clear nod to her previous battle with streaming services. Her full discography was made available to Spotify, Tidal, and other services earlier this year.\n\n9. Swift heads up a class of models at Squad U. The singer has gotten plenty of flack over the years for what some have dubbed her highly manufactured, model-perfect pack of close gal pals, and this scene was a direct hit back at those perceptions. She also writhes next to a pile of unmoving figures at one point during the scene, perhaps giving a nod to the idea that she surrounds herself with “fake” friends.\n\n10. Those “I Heart TS” shirts. There was no missing the spectacle that was Swift’s whirlwind relationship with Tom Hiddleston, and in one particularly damning scene, the singer dances with a group of men (including close friend and YouTube star Todrick Hall) all donning “I Heart TS” crop tops, a nod to the now-infamous tank top that Hiddleston donned at one of Swift’s July Fourth parties. Also of note: There are eight men dancing behind her in this scene – a possible reference to Swift’s eight famous exes? (Joe Jonas, Taylor Lautner, John Mayer, Jake Gyllenhaal, Conor Kennedy, Harry Styles, Calvin Harris and Tom Hiddleston.) One more note about this particular sequence in the video, set in a mansion: While an earlier preview of this scene had many fans comparing it to Beyonce’s “Formation,” which director Kahn downplayed, in full context, it was more reminiscent of Lady Gaga’s baroque “Paparazzi” clip.\n\n11. Swift stands atop a mountain of former selves. The singer looks triumphant as she strikes a pose on top of a large pile of her former iconic personas, including a ballet dancer (“Shake It Off”), a circus marshall (from her Red tour) and even a nerdy high schooler (“You Belong With Me”). At one point, the latter even gets kicked in the head by what looks to be the Vetements boots she wore on the cover of Vogue in May 2016.\n\n12. Her besties make a “cameo” in the video. Swift’s “Junior Jewels” T-shirt from her geeky “You Belong With Me” music video now displays the names of her closest pals: Gigi [Hadid], Martha [Hunt], Abigail [Anderson], Blake [Lively], Ryan [Reynolds], Claire [Kislinger], Ed [Sheeran], Selena [Gomez], Lena [Dunham], Este [Haim], Danielle [Haim], Alana [Haim] and Todrick [Hall], among others. Glaringly absent from that list: Squad mainstays Karlie Kloss, Lorde and Ruby Rose.\n\n13. She quotes some of her most headline-making moments. The multiple Swift clones that stand on the airplane tarmac all begin to squabble with each other during the last 40 seconds of the music video, with several of the Swift personas reciting some now-familiar lines, like “I’d very much like to be excluded from this narrative,” referencing a line from her scathing response to her feud with West and wife Kim Kardashian over his hit “Famous.”\n\nFrom Katy Perry’s spotty debut as host to Kendrick Lamar’s victory to a Chester Bennington tribute, here’s VMAs 2017 highs and lows. Watch here.", "images": ["https://rolingstone-com.go-vip.co/wp-content/uploads/2018/06/ts_shirts_360-98451f6c-583f-4ebd-be91-f536f3882e50.gif", "https://rolingstone-com.go-vip.co/wp-content/uploads/2018/06/tshirt_360-9c65bb0f-d948-4597-99f6-5b00dc903f27.gif", "https://www.rollingstone.com/wp-content/uploads/2018/06/taylow-swift-look-what-you-made-me-do-video-99fa8ad0-b7d5-4e1c-bcd2-03a1dd923120.jpg?w=500&h=375&crop=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "https://rolingstone-com.go-vip.co/wp-content/uploads/2018/06/tay_bat_360-0f993154-8e99-4440-b437-b0d652446e74.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://rolingstone-com.go-vip.co/wp-content/uploads/2018/06/tay_larger1_360-c81b1dc9-46c9-48a6-bf3a-e60f50c64c38.gif", "https://rolingstone-com.go-vip.co/wp-content/uploads/2018/06/et_tu_360-ebb62db4-63da-4222-a30a-b4ffa0af5598.gif", "https://rolingstone-com.go-vip.co/wp-content/uploads/2018/06/ezgif-4-409485e6e8_360-a0f8004d-99fe-491c-9edf-d4c8b8908573.gif", "https://rolingstone-com.go-vip.co/wp-content/uploads/2018/06/katy_360-8973495f-e8c3-42c6-a52a-d9801a681988.gif", "https://rolingstone-com.go-vip.co/wp-content/uploads/2018/06/tay_grave-683411d7-4322-4993-9c62-95409fe3e27d.gif", "https://rolingstone-com.go-vip.co/wp-content/uploads/2018/06/tea2_360-342557e9-a882-41c6-998f-4dc0ee119cce.gif", "https://rolingstone-com.go-vip.co/wp-content/uploads/2018/06/squad_smaller_360-9b9a4da9-f2d4-4d14-99c7-8683aeadc901.gif", "https://rolingstone-com.go-vip.co/wp-content/uploads/2018/06/narrative2_360-ce91b44a-2f0c-4df6-a129-b81b4bf06de9.gif", "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2022/assets/public/lazyload-fallback.gif"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/taylow-swift-look-what-you-made-me-do-video-99fa8ad0-b7d5-4e1c-bcd2-03a1dd923120.jpg?w=500&h=375&crop=1", "keywords": [], "authors": ["Joyce Chen"], "canonical_link": "https://www.rollingstone.com/music/music-news/taylor-swifts-look-what-you-made-me-do-video-decoded-13-things-you-missed-126268/", "title": "Taylor Swift’s ‘Look What You Made Me Do’ Video Decoded – Rolling Stone", "meta_data": {"theme-color": "#df3535", "viewport": "width=device-width, initial-scale=1.0", "description": "Taylor Swift's talked-about music video is filled with symbolic references, and eagle-eyed fans are eagerly decoding its hidden meanings.", "news_keywords": "Taylor Swift", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "rollingstone", "pmc-page_type": "article", "articleid": 126268, "author": "Joyce Chen", "pmc-category": "Music,Music News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-08-28T18:21:00"}, "pmc-tag": "Taylor Swift", "title": "Taylor Swift’s ‘Look What You Made Me Do’ Video Decoded: 13 Things You Missed", "pageclass": "article", "pmc-is_free": "no", "pmc-branded-content": "no", "pmc-evergreen": "no"}, "generator": "WordPress 6.0.2", "author": "Joyce Chen", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "RS", "application-name": "RS", "content_type": "Article", "post_id": 126268, "title": "Taylor Swift's 'Look What You Made Me Do' Video Decoded: 13 Things You Missed", "published_at": "2017-08-28 18:21:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/taylow-swift-look-what-you-made-me-do-video-99fa8ad0-b7d5-4e1c-bcd2-03a1dd923120.jpg?w=1024", "comment_count": 3, "tags": "Taylor Swift", "topics": "Music News", "body": "Taylor Swift is nothing if not a vengeful lyricist and a pro at image reinvention; her new, darker, self-satirizing persona makes that abundantly clear. The singer, who dropped the music video for her scathing new single \"Look What You Made Me Do\" at Sunday night's VMAs, hid numerous details in plain sight for her fans to see, interpret and discuss.The song, which is an aural burn book of all of Swift's past (and current) critics, takes aim at several of her more high-profile detractors with lines like \"I don't like your tilted stage\" (a possible jab at West's tilted stage on his Saint Pablo tour) and moments like her faux phone call announcing that \"the old Taylor is dead,\" reminiscent of her controversial recorded call with the rapper.But Swift's symbol-drenched music video, directed by Joseph Kahn, adds another layer to her good-girl-gone-bad anthem. Here are 13 things you may have missed during Sunday night's premiere – and why they matter in the world of Swifties and perpetual shade-throwing.1. The Nils Sjoberg tombstone in the opening scene. As many will remember, Nils Sjoberg was the pseudonym that Swift used for a songwriting credit on her ex-boyfriend Calvin Harris' 2016 summer hit, \"This Is What You Came For.\" When it was revealed that Swift was, in fact, the creative mind behind the single, some short-lived drama ensued, with Harris slamming his ex and bringing up her ongoing beef with Katy Perry.2. The \"Out of the Woods\" dress. When the music video opens, Swift bursts through the ground of a graveyard as a fully fledged zombie – wearing the iconic blue dress from her \"Out of the Woods\" music video. It's notable that the video for her fairytale-inspired single was the last from her 1989 era, possibly indicating from the get-go that that era is done for good now. (Zombie Taylor is also a nice tribute to Michael Jackson's \"Thriller\" video.)3. The 2014 Met Gala dress. Similarly, the Swift lying prone in the grave is wearing the very Oscar de la Renta gown that the singer wore to the Met Gala in 2014. At the time, the then-24-year-old pop singer called the opportunity to wear the designer’s gown \"a daydream realized.\"4. The single dollar bill in a bathtub full of diamonds. Swift’s decision to bathe in jewels and not money – but to feature a single dollar bill just beyond her right shoulder – was a very calculated one. Fans speculate that the single bill represents the $1 she was awarded after she won her sexual assault case against former radio DJ David Mueller.5. The \"Et Tu Brute\" etchings on her golden throne. The superstar looks regal sitting atop a gold throne covered in snakes, but there's one subtle detail that adds a layer to Swift's haughty posture. On the arm of the throne, as well as on the oversized columns on either side of her seat, is the phrase \"Et tu Brute,\" a quote from William Shakespeare's Julius Caesar. The famous line was uttered by Caesar, who was literally stabbed in the back by his former friends.6. A snake serves Swift tea. One lucky reptile slithered straight up to Swift's seat and poured the singer some piping hot tea at one point during her snake-charmer scene, a clear nod to the idea of Swift \"serving tea\" with the symbol-laden music video.7. Swift transforms into a Katy Perry lookalike. If elements of the scene where Swift crashes a gold sports car into a pole look familiar, it's because they are. Swift's hair in the scene looks remarkably similar to nemesis Perry's 'do, and the sports car itself is undeniably reminiscent to the car in Perry's 2009 video for \"Waking Up in Vegas.\" Relatedly, following the slow-motion crash, the camera zooms in on a Grammy Award the singer is holding up; Swift has 10 Grammys while Perry has been nominated for several but has yet to win one.8. Swift and crew rob Stream Co. The singer dons a hoodie (that reads, in bedazzled letters, \"Blind for love\") and swings a baseball bat to break and enter into a bank vault that boasts the name \"Stream Co.\" – a clear nod to her previous battle with streaming services. Her full discography was made available to Spotify, Tidal, and other services earlier this year.9. Swift heads up a class of models at Squad U. The singer has gotten plenty of flack over the years for what some have dubbed her highly manufactured, model-perfect pack of close gal pals, and this scene was a direct hit back at those perceptions. She also writhes next to a pile of unmoving figures at one point during the scene, perhaps giving a nod to the idea that she surrounds herself with \"fake\" friends.10. Those \"I Heart TS\" shirts. There was no missing the spectacle that was Swift's whirlwind relationship with Tom Hiddleston, and in one particularly damning scene, the singer dances with a group of men (including close friend and YouTube star Todrick Hall) all donning \"I Heart TS\" crop tops, a nod to the now-infamous tank top that Hiddleston donned at one of Swift's July Fourth parties. Also of note: There are eight men dancing behind her in this scene – a possible reference to Swift's eight famous exes? (Joe Jonas, Taylor Lautner, John Mayer, Jake Gyllenhaal, Conor Kennedy, Harry Styles, Calvin Harris and Tom Hiddleston.) One more note about this particular sequence in the video, set in a mansion: While an earlier preview of this scene had many fans comparing it to Beyonce's \"Formation,\" which director Kahn downplayed, in full context, it was more reminiscent of Lady Gaga's baroque \"Paparazzi\" clip.11. Swift stands atop a mountain of former selves. The singer looks triumphant as she strikes a pose on top of a large pile of her former iconic personas, including a ballet dancer (\"Shake It Off\"), a circus marshall (from her Red tour) and even a nerdy high schooler (\"You Belong With Me\"). At one point, the latter even gets kicked in the head by what looks to be the Vetements boots she wore on the cover of Vogue in May 2016.12. Her besties make a \"cameo\" in the video. Swift's \"Junior Jewels\" T-shirt from her geeky \"You Belong With Me\" music video now displays the names of her closest pals: Gigi [Hadid], Martha [Hunt], Abigail [Anderson], Blake [Lively], Ryan [Reynolds], Claire [Kislinger], Ed [Sheeran], Selena [Gomez], Lena [Dunham], Este [Haim], Danielle [Haim], Alana [Haim] and Todrick [Hall], among others. Glaringly absent from that list: Squad mainstays Karlie Kloss, Lorde and Ruby Rose.13. She quotes some of her most headline-making moments. The multiple Swift clones that stand on the airplane tarmac all begin to squabble with each other during the last 40 seconds of the music video, with several of the Swift personas reciting some now-familiar lines, like \"I'd very much like to be excluded from this narrative,\" referencing a line from her scathing response to her feud with West and wife Kim Kardashian over his hit \"Famous.\"From Katy Perry's spotty debut as host to Kendrick Lamar's victory to a Chester Bennington tribute, here's VMAs 2017 highs and lows. Watch here.", "fb": {"pages": 10664530778}, "onesignal": "wordpress-plugin", "og": {"type": "article", "title": "Taylor Swift's 'Look What ...' Video Decoded: 13 Things You Missed", "url": "https://www.rollingstone.com/music/music-news/taylor-swifts-look-what-you-made-me-do-video-decoded-13-things-you-missed-126268/", "description": "Singer’s talked-about music video is filled with symbolic references, and eagle-eyed fans are eagerly decoding its hidden meanings", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/taylow-swift-look-what-you-made-me-do-video-99fa8ad0-b7d5-4e1c-bcd2-03a1dd923120.jpg?w=500&h=375&crop=1", "width": 1024, "height": 484, "alt": "taylor swift look what you made me do video"}, "locale": "en_US"}, "article": {"published_time": "2017-08-28T18:21:00+00:00", "modified_time": "2018-06-25T16:29:08+00:00"}, "twitter": {"site": "@RollingStone", "card": "summary_large_image", "title": "Taylor Swift’s ‘Look What You Made Me Do’ Video Decoded: 13 Things You Missed", "description": "Taylor Swift's talked-about  music video is filled with symbolic references, and eagle-eyed fans are eagerly decoding its hidden meanings.", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/taylow-swift-look-what-you-made-me-do-video-99fa8ad0-b7d5-4e1c-bcd2-03a1dd923120.jpg?w=1024"}, "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2022/08/cropped-Rolling-Stone-Favicon.png?w=270"}, "movies": [], "publish_date": 1503944460.0, "source": "https://www.rollingstone.com", "summary": ""}