{"url": "en.wikipedia.org/wiki/Pretty_Woman", "text": "1990 film by Garry Marshall\n\nPretty Woman is a 1990 American romantic comedy film directed by Garry Marshall, from a screenplay by J. F. Lawton. The film stars Julia Roberts and Richard Gere, and features Héctor Elizondo, Ralph Bellamy (in his final performance), Laura San Giacomo, and Jason Alexander in supporting roles.[1]\n\nThe film's story centers on Hollywood prostitute Vivian Ward and wealthy businessman Edward Lewis. Vivian is hired to be Edward's escort for several business and social functions, and their relationship develops over the course of her week-long stay with him.\n\nThe film's title Pretty Woman is based on the 1964 song \"Oh, Pretty Woman\" by Roy Orbison. It is the first film on-screen collaboration between Gere and Roberts; their second film, Runaway Bride, was released in 1999.\n\nOriginally intended to be a dark cautionary tale about class and prostitution in Los Angeles, the film was re-conceived as a romantic comedy with a large budget. It was widely successful at the box office and was the third-highest-grossing film of 1990. The film saw the highest number of ticket sales in the US ever for a romantic comedy,[2] with Box Office Mojo listing it as the number-one romantic comedy by the highest estimated domestic tickets sold at 42,176,400, slightly ahead of My Big Fat Greek Wedding (2002) at 41,419,500 tickets.[3] The film received mixed reviews, though Roberts received a Golden Globe Award and a nomination for the Academy Award for Best Actress for her performance, which catapulted her to stardom. In addition, screenwriter J. F. Lawton was nominated for a Writers Guild Award and a BAFTA Award.\n\nPlot [ edit ]\n\nEdward Lewis, a high-powered corporate raider from New York, buys and dismantles struggling companies, selling off the assets for profit. He wants his girlfriend Jessica to accompany him during a business trip, but fed up with being his \"beck and call girl\", she breaks up with him. Leaving a business party in the Hollywood Hills, Edward takes his lawyer's Lotus Esprit sports car and accidentally ends up on Hollywood Boulevard in the city's red-light district. There he encounters sex worker Vivian Ward. As he is having difficulties driving a manual transmission car, he pays Vivian to drive him to the Regent Beverly Wilshire Hotel. Edward then impulsively hires her for the night, and despite some awkwardness, finds her charming and gets on well with her.\n\nThe next day, Edward asks Vivian to play his girlfriend that week at a series of business events he is attending while attempting a takeover of shipbuilder James Morse's company. Edward offers Vivian $3,000 and a new wardrobe for six days. Vivian excitedly accepts, but when she attempts to go shopping on Rodeo Drive, she is turned away by the rude, snobbish saleswomen and turns to Barney, the hotel's manager, for help. He teaches her proper etiquette and arranges for her to buy a cocktail dress for an important business dinner that evening. At the dinner meeting Edward introduces Vivian to James and his grandson David; the latter is being groomed to take over the company after his grandfather dies. The business meeting does not go well and James and David are unimpressed by Edward wanting to buy and sell off their company. Edward is impressed by Vivian's transformation and opens up to her, revealing details about his personal and business life, including his turbulent relationship with his late father, Carter, from whom he was estranged at the time of his death.\n\nWhen Edward's attorney, Phillip, suspects Vivian is a corporate spy after seeing her talking to David at a polo game, Edward reveals how they met. Phillip later crudely propositions Vivian for her services after Edward is finished with her. Vivian is hurt and furious at Edward for exposing her. Edward apologizes, revealing he was jealous of Vivian talking to David and realizes Vivian's straightforward personality is rubbing off on him. Edward takes Vivian by private jet to see La traviata at the San Francisco Opera. The story of a sex worker who falls in love with a rich man moves Vivian. She later breaks her \"no kissing\" rule while having sex with Edward. After mistakenly believing Edward is asleep, Vivian admits she loves him.\n\nHis return to New York imminent, Edward offers to help Vivian get off the streets and suggests putting her up in a nice condo and giving her an allowance, promising to visit her regularly. Vivian is offended by the offer, as Edward is still treating her like a sex worker, and recalls a childhood fantasy of being rescued from her abusive home by a knight on a white steed. Edward meets with James but, changed by his experience with Vivian, chooses to work with him to save his company instead of dismantling it. Phillip, furious that Edward's new direction has cost him a fortune, goes to the hotel to confront him but finds only Vivian. Blaming her for Edward's changing character, he attempts to rape her. Edward arrives and punches Phillip, then fires him.\n\nWith his business in Los Angeles complete, Edward asks Vivian to stay with him one more night, but only if she wants to, not because he is paying her. She gently refuses and leaves. Edward re-thinks his life, and while being driven to the airport has the chauffeur detour to Vivian's apartment building. He climbs out through the white limousine's sunroof and ascends the fire escape to rescue Vivian just like the knight in her fantasy.\n\nCast [ edit ]\n\nCast notes:\n\nPretty Woman was Hank Azaria's first film speaking role. He later co-starred with Julia Roberts again in 2001's America's Sweethearts .\n\nwas Hank Azaria's first film speaking role. He later co-starred with Julia Roberts again in 2001's . Gere, Roberts, and Elizondo would later co-star again in 1999's Runaway Bride.\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nThe film was initially conceived as a dark drama about prostitution in Los Angeles in the 1980s.[4] The relationship between Vivian and Edward also originally involved controversial themes, including Vivian being addicted to drugs; part of the deal was that she had to stay off cocaine for a week. Edward eventually throws her out of his car and drives off. The original script by J.F. Lawton, called 3000,[5] ended with Vivian and her prostitute friend on the bus to Disneyland.[4] Producer Laura Ziskin considered these elements detrimental to a sympathetic portrayal of Vivian, and they were removed or assigned to Kit. The deleted scenes have been found, and some were included on the DVD released for the film's 15th anniversary.[4] In one, Vivian tells Edward, \"I could just pop ya good and be on my way\", indicating her lack of interest in \"pillow talk\". In another, she is confronted by a drug dealer, Carlos, then rescued by Edward when the limo driver Darryl gets his gun out.\n\nThough inspired by such films as Wall Street and The Last Detail,[5] the film bears a resemblance to Pygmalion myths: particularly George Bernard Shaw's play of the same name, which also formed the basis for the Broadway musical My Fair Lady. It was Walt Disney Studios then-president Jeffrey Katzenberg who insisted the film be re-written as a modern-day fairy tale and love story, as opposed to the original dark drama. It was pitched to Touchstone Pictures and re-written as a romantic comedy.[6] The title 3000 was changed because Disney executives thought it sounded like a title for a science fiction film.[7]\n\nCasting [ edit ]\n\nCasting of the film was a rather lengthy process. Marshall had initially considered Christopher Reeve, Daniel Day-Lewis, Kevin Kline, and Denzel Washington for the role of Edward, and Albert Brooks,[8] Al Pacino and Burt Reynolds turned it down.[9] Pacino went as far as doing a casting reading with Roberts before rejecting the part.[10] Sam Neill, Tom Conti and Charles Grodin tested for the part along with Roberts.[11] Gere initially refused but when he met with Roberts, she persuaded him and he eventually agreed to play Lewis.[12] He reportedly started off much more active in his role; but Garry Marshall took him aside and said \"No, no, no, Richard. In this movie, one of you moves and one of you does not. Guess which one you are?\"[13] Julia Roberts was not the first choice for the role of Vivian, and was not wanted by Disney. Many other actresses were considered. Marshall originally envisioned Karen Allen for the role; when she declined, auditions went to many better-known actresses of the time including Molly Ringwald,[14] who turned it down because she felt uncomfortable playing a prostitute.[citation needed] Winona Ryder auditioned, but was turned down because Marshall felt she was \"too young\". Jennifer Connelly was also dismissed for the same reason.[4] Emily Lloyd turned it down as it conflicted with her shooting for the film Mermaids.[15] Drew Barrymore, Brooke Shields, Uma Thurman, and Kristin Davis auditioned for the role of Vivian.[16]\n\nMeg Ryan, who was a top choice of Marshall's, turned it down as well. According to a note written by Marshall, Mary Steenburgen was also among the first choices. Diane Lane came very close to being cast (the script was much darker at the time); they had gone as far as costume fittings, but due to scheduling conflicts she could not accept. Michelle Pfeiffer turned the role down, saying she did not like the script's \"tone.\"[17] Daryl Hannah was also considered, but believed the role was \"degrading to women\".[17] Valeria Golino declined, doubting it would work with her thick Italian accent.[citation needed] And Jennifer Jason Leigh had auditioned.[18] Lea Thompson unsuccessfully auditioned for the role as she thought the film was a drama.[19] When all the other actresses turned down the role, 21-year-old Julia Roberts, a relative unknown, with only the sleeper hit Mystic Pizza (1988) and the yet-to-be-released Steel Magnolias (1989), for which she would be nominated for the Academy Award for Best Supporting Actress, won the role of Vivian. Her performance made her a star. J.F. Lawton, writer of the original screenplay, has suggested that the film was ultimately given a happy ending because of the chemistry of Gere and Roberts.[5]\n\nVeteran actor Ralph Bellamy, who plays James Morse, appears in his final acting performance before his death in 1991. Jason Alexander, who had also recently been cast for his role as the bumbling George Costanza in Seinfeld, was cast as Philip Stuckey. A VHS copy of Pretty Woman would appear in Seinfeld's apartment in later seasons of Seinfeld as a homage to Alexander's participation in the film.\n\nFilming [ edit ]\n\nThe film's budget was substantial, at $14 million, so producers could shoot in many locations.[4] Most filming took place in Los Angeles, California, specifically in Beverly Hills, and inside soundstages at Walt Disney Studios in Burbank. The escargot restaurant the \"Voltaire\" was shot at the restaurant \"Rex,\" now called \"Cicada\". Scenes set in the Beverly Wilshire Hotel lobby were shot at the Ambassador Hotel in Los Angeles. Filming commenced on July 24, 1989, but was immediately plagued by problems. These included Ferrari and Porsche declining the product placement opportunity for the car Edward drove, neither firm wishing to be associated with prostitutes.[4] Lotus Cars saw the placement value, and supplied a Silver 1989.5 Esprit SE (which was later sold).[20]\n\nShooting was a generally pleasant, easy-going experience, as the budget was broad and the shooting schedule was not tight.[4] While shooting the scene where Vivian is lying down on the floor of Edward's penthouse, watching reruns of I Love Lucy, Garry Marshall had to tickle Roberts' feet (out of camera range) to get her to laugh.[21] The scene in which Gere playfully snaps the lid of a jewelry case on her fingers was improvised, and her surprised laugh was genuine. The red dress Vivian wears to the opera has been listed among the most unforgettable dresses of all time.[22]\n\nDuring the scene in which Roberts sang to a Prince song in the bathtub, slid down and submerged her head under the bubbles; she emerged to find the crew had left except for the cameraman, who captured the moment on film. In the love scene, she was so stressed that a vein became noticeable on her forehead and had to be massaged by Marshall and Gere. She also developed a case of hives, and calamine lotion was used to soothe her skin until filming resumed.[4] The filming was completed on November 30.[23]\n\nShelley Michelle acted as body double for Roberts in risqué scenes and the film poster.[24]\n\nReception [ edit ]\n\nBox office [ edit ]\n\nIn its opening weekend, the film was at number one at the US box office, grossing $11,280,591 and averaging $8,513 per theater.[25] Despite dropping to number two in its second weekend, it grossed more with $12,471,670.[25] It returned to number one at the US box office in its sixth weekend and was number one for three weeks. It was in the Top 10 movies in the US for 16 weeks.[25] In Australia, it was number one for 12 weeks and was number one for nine consecutive weeks in the UK. It has grossed $178,406,268 in the United States and $285,000,000 in other countries for a total worldwide gross of $463,406,268.[3] It was the fourth highest-grossing film of the year in the United States and Canada[26] and the third highest-grossing worldwide.[27] The film was Disney's highest-grossing film ever, surpassing Three Men and a Baby, and remains Disney's highest-grossing R-rated release.[28][29][30]\n\nCritical response [ edit ]\n\nOn review aggregator Rotten Tomatoes the film holds an approval rating of 65% based on 72 reviews, with an average rating of 6.10/10. The website's critical consensus states, \"Pretty Woman may be a yuppie fantasy, but the film's slick comedy, soundtrack, and casting can overcome misgivings.\"[31] On Metacritic, the film has a weighted average score of 51 out of 100, based on 18 critics, indicating \"mixed or average reviews.\"[32] Audiences polled by CinemaScore gave the film an average grade of \"A\" on an A+ to F scale.[33]\n\nOwen Gleiberman of Entertainment Weekly gave the film a D, saying it \"starts out as a neo-Pygmalion comedy\" and with \"its tough-hooker heroine, it can work as a feminist version of an upscale princess fantasy.\" Gleiberman also said it \"pretends to be about how love transcends money,\" but \"is really obsessed with status symbols.\"[34] On its twentieth anniversary, Gleiberman wrote another article, saying that while he felt he was right, he would have given it a B today.[35] Carina Chocano of The New York Times said the movie \"wasn't a love story, it was a money story. Its logic depended on a disconnect between character and narrative, between image and meaning, between money and value, and that made it not cluelessly traditional but thoroughly postmodern.\"[36]\n\nAccolades [ edit ]\n\nIt ranks on #21 in AFI's 100 Years... 100 Passions.\n\nMusic [ edit ]\n\nThe soundtrack features the song \"Oh, Pretty Woman\" by Roy Orbison, which inspired its title. Roxette's \"It Must Have Been Love\", originally released in December 1987, reached No. 1 on the Billboard Hot 100 in June 1990. The soundtrack also features \"King of Wishful Thinking\" by Go West, \"Show Me Your Soul\" by Red Hot Chili Peppers, \"No Explanation\" by Peter Cetera, \"Wild Women Do\" by Natalie Cole and \"Fallen\" by Lauren Wood. The soundtrack has been certified triple platinum by the Recording Industry Association of America (RIAA).[41]\n\nThe opera featured in the film is La Traviata, which also served as inspiration for its plot. The highly dramatic aria fragment that is repeated is the end of \"Dammi tu forza!\" (\"Give me strength!\"), from the opera. Roberts sings the song \"Kiss\" by Prince while she is in the tub and Gere's character is on the phone. Background music is composed by James Newton Howard. The piano piece Gere's character plays in the hotel lobby was actually composed and performed by him. Entitled \"He Sleeps/Love Theme\", this piano composition is inspired by Bruce Springsteen's \"Racing in the Street\".\n\nMusical adaptation [ edit ]\n\nA stage musical adaptation of the film opened on Broadway on July 20, 2018, in previews, officially on August 16 at the Nederlander Theatre.[42] This follows an out-of-town tryout at the Oriental Theatre in Chicago, which will run from March 13 to April 15, 2018. The musical has music and lyrics by Bryan Adams and Jim Vallance; the late Garry Marshall and J.F. Lawton wrote the book; and Jerry Mitchell is the director and choreographer.[43] The Chicago and Broadway casts featured Samantha Barks, in her Broadway debut as Vivian and Steve Kazee as Edward. Barks finished her run as Vivian on 21 July 2019 and was replaced by Jillian Mueller the following evening, with Brennin Hunt, of ‘Rent’ fame, assuming the role of Edward.[43] Orfeh portrayed Kit, and Jason Danieley played Philip Stuckey. Eric Anderson portrayed the role of Mr. Thompson and Kingsley Leggs played the role of James Morse.[42]", "images": ["http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/b/b6/Pretty_woman_movie.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "http://en.wikipedia.org/static/images/footer/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/en/b/b6/Pretty_woman_movie.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/b/b6/Pretty_woman_movie.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Pretty_Woman", "title": "Pretty Woman", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/b/b6/Pretty_woman_movie.jpg", "width": 640, "height": 969}, "title": "Pretty Woman - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}