{"url": "https://wwd.com/eye/lifestyle/selena-gomez-to-host-we-day-california-10859385/", "text": "This is beginning to look like the year of Selena Gomez. The musician and actress has been revealed as the host for the 2017 WE Day, the annual one-day California event that brings together thousands of young people in promotion of youth advocacy for social issues.\n\n“My first WE Day experience was three years ago and to say I was impressed is an understatement,” Gomez, 24, said in a statement. She was one of the performers at last year’s event. “The electricity of an arena full of thousands of young people who are making real change in the world is like nothing I’ve ever experienced. I am grateful to be a part of such a supportive community and hope I can inspire the kids at WE Day just as they continue to inspire me.“\n\nShe will be joined by Alicia Keys, who will perform. Other VIP appearances are expected to include Demi Lovato, Bryan Cranston, Lily Collins, Magic Johnson, DJ Khaled, Miss Piggy and Alessia Cara. Lovato was also in attendance last year, as were Charlize Theron and Joe Jonas.\n\nGomez has been making a calculated return to the spotlight since releasing her “comeback” record, “Revival,” in October 2015. She scored her first Vogue cover for the April 2017 issue, and has been promoting the Netflix series she produced, “13 Reasons Why.”\n\nWE Day, according to its founder Craig Kielburger, “celebrates the amazing young people who have taken action at home and around the world, to create sustainable change for a better tomorrow. Standing in a stadium full of passionate youth will affirm your belief that real change can happen — and is happening every single day right here in California. This past school year more than 875 California schools in the WE Schools program made an incredible impact in their own backyards and in communities around the world through their commitment and passion for change.”", "images": ["https://wwd.com/wp-content/uploads/2017/04/rexfeatures_8559958b.jpg?w=1024", "https://www.facebook.com/tr?id=1378822052216463&ev=PageView&noscript=1", "https://wwd.com/wp-content/uploads/2017/04/rexfeatures_8559958b.jpg?w=1000&h=563&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.quantserve.com/pixel/p-31f3D02tYU8zY.gif", "https://ct.pinterest.com/v3/?tid=2612680468235&pd[em]=&noscript=1", "https://wwd.com/wp-content/themes/vip/pmc-wwd-2021/assets/public/lazyload-fallback.gif", "https://dc.ads.linkedin.com/collect/?pid=609602&fmt=gif"], "top_img": "https://wwd.com/wp-content/uploads/2017/04/rexfeatures_8559958b.jpg?w=1024", "keywords": [], "authors": ["Leigh Nordstrom"], "canonical_link": "https://wwd.com/eye/lifestyle/selena-gomez-to-host-we-day-california-10859385/", "title": "Selena Gomez to Host WE Day California 2017", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://wwd.com/wp-content/themes/vip/pmc-wwd-2021/assets/app/browserconfig.xml", "msapplication-TileImage": "https://wwd.com/wp-content/uploads/2018/06/a9597fffaf6885dd6f870d1269ef3b72.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Selena Gomez to Host WE Day California 2017; Alicia Keys, Miss Piggy, Demi Lovato, DJ Khaled, Bryan Cranston to attend.", "fb": {"pages": 19457049254}, "news_keywords": "Selena Gomez", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "wwd", "pmc-page_type": "article", "articleid": 10859385, "author": "Leigh Nordstrom", "pmc-category": "Lifestyle", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-04-05T09:48:35"}, "pmc-tag": "Selena Gomez", "title": "Selena Gomez to Host WE Day California 2017", "pageclass": "article", "pmc-vertical": "eye", "pmc-is_free": "no", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-strategiccontent": "no"}, "generator": "WordPress 6.0.2", "author": "Leigh Nordstrom", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "WWD", "application-name": "WWD", "content_type": "Article", "post_id": 10859385, "title": "Selena Gomez to Host WE Day California 2017", "published_at": "2017-04-05 09:48:35", "image": "https://wwd.com/wp-content/uploads/2017/04/rexfeatures_8559958b.jpg?w=1024", "tags": "Selena Gomez", "topics": "Lifestyle", "verticals": "Eye", "body": "This is beginning to look like the year of Selena Gomez. The musician and actress has been revealed as the host for the 2017 WE Day, the annual one-day California event that brings together thousands of young people in promotion of youth advocacy for social issues.\r\n“My first WE Day experience was three years ago and to say I was impressed is an understatement,” Gomez, 24, said in a statement. She was one of the performers at last year's event. “The electricity of an arena full of thousands of young people who are making real change in the world is like nothing I’ve ever experienced. I am grateful to be a part of such a supportive community and hope I can inspire the kids at WE Day just as they continue to inspire me.“\r\nShe will be joined by Alicia Keys, who will perform. Other VIP appearances are expected to include Demi Lovato, Bryan Cranston, Lily Collins, Magic Johnson, DJ Khaled, Miss Piggy and Alessia Cara. Lovato was also in attendance last year, as were Charlize Theron and Joe Jonas.\r\nGomez has been making a calculated return to the spotlight since releasing her \"comeback\" record, \"Revival,\" in October 2015. She scored her first Vogue cover for the April 2017 issue, and has been promoting the Netflix series she produced, \"13 Reasons Why.\"\r\nWE Day, according to its founder Craig Kielburger, \"celebrates the amazing young people who have taken action at home and around the world, to create sustainable change for a better tomorrow. Standing in a stadium full of passionate youth will affirm your belief that real change can happen — and is happening every single day right here in California. This past school year more than 875 California schools in the WE Schools program made an incredible impact in their own backyards and in communities around the world through their commitment and passion for change.”", "fragment": "!", "og": {"type": "article", "title": "Selena Gomez to Host WE Day California 2017", "url": "https://wwd.com/eye/lifestyle/selena-gomez-to-host-we-day-california-10859385/", "description": "Gomez will be joined by Alicia Keys, Demi Lovato and Bryan Cranston at the annual one-day youth event.", "site_name": "WWD", "image": {"identifier": "https://wwd.com/wp-content/uploads/2017/04/rexfeatures_8559958b.jpg?w=1024", "width": 1024, "height": 1546, "alt": "Selena Gomez at the '13 Reasons Why' premiere"}, "locale": "en_US"}, "article": {"published_time": "2017-04-05T13:48:35+00:00", "modified_time": "2017-04-05T13:48:35+00:00"}, "twitter": {"image": "https://wwd.com/wp-content/uploads/2017/04/rexfeatures_8559958b.jpg?w=678", "site": "@wwd", "card": "summary_large_image", "title": "Selena Gomez to Host WE Day California 2017", "description": "Selena Gomez to Host WE Day California 2017; Alicia Keys, Miss Piggy, Demi Lovato, DJ Khaled, Bryan Cranston to attend."}}, "movies": [], "publish_date": 1491400115.0, "source": "https://wwd.com", "summary": ""}