{"url": "www.gq.com/story/chris-pratt-cover-story", "text": "I tell Pratt I have a hunch that very few movie stars Google for acting tips.\n\n\"Maybe they won’t talk about it,\" he says. \"Maybe that’s my next lesson—just stop talking about it and be like, ’Oh, I don’t know what it is.... It’s just a gift, I guess.’ \"\n\nHe concedes that not all his directors encourage his search for new tricks. James Gunn, he says, tells him, \"You always have a new thing you’re doing—just stop.\"\n\nGunn demurs at the \"stop\" part but says, \"Chris is a man of insights, and he’s always having these big insights—he’s got a new idea every day about everything.\"\n\nFor most of their time together, Faris has been the more famous one (a renown that reached its peak with The House Bunny), and I ask Pratt whether it’s weird in a marriage like this how the fame balance keeps readjusting itself.\n\n\"Mmm,\" he considers, \"I think it probably could affect... I think it’s something you have to manage. It’s a little different, because she’s achieved enough to hang her hat on for her life, anyways. She’s done really amazing things—she’s always gonna be known for really funny and great work, critically acclaimed work and successful stuff.\" But he certainly remembers what it was like to be the less feted member of a Hollywood couple. \"I’ve had those moments,\" he says, \"where I was like the guy holding the purse at events and people just looked right through me. And, you know, actors come up and just blatantly hit on my wife in front of me and don’t even look at me. I’m like, ’What the fuck, dude?’ I can think of exactly who they are, too, and I hope they fucking audition for Guardians of the Galaxy.\" (A sequel, the first of at least two that Pratt says are already planned, begins filming next February.) There are others whose transgressions he hasn’t forgotten: \"Also, producers and studio people now who will come up to me and treat me the same way that they were treating Anna. They’re like, ’I always knew...’ I’m like, ’Is that right? That’s interesting, because you fucking stared right through me the last time....’ \"\n\nAn aside about poop photos: You and Nick Offerman really send each other photos of each other’s poop?\n\nPratt laughs. \"Yeah.\"\n\nStill?\n\n\"Not like every poop, but if it’s special enough. I sent him a picture of a giant turd on his birthday, and I said, ’You guys have the same birthday.’ Adam Scott and I send each other goofy shit a lot, too. I’ve sent some dumps to Adam, and he sent some to me.\"\n\nI guess I should ask why.\n\n\"Because we’re buddies and it makes us laugh.\"\n\nWhat makes a particular movement sendable?\n\n\"If it’s shaped like a letter—that qualifies. Like, one time I had one that was three pieces that landed in the shape of an N—I was like, ’Gotta send that to Nick—it’s his first initial!’ If it’s extra...the size. You know, some poops are unremarkable, and some you take pictures of and send them to Nick Offerman.\"\n\nHow do you feel when you receive a new one?\n\n\"Respect. That’s how we are. You know how we know we respect the poops? Because we’ll send them, not even a single square of toilet paper in the photo. We won’t desecrate the art by obscuring even a corner of it with a piece of toilet paper. Which means that we will get up and take the photo before we wipe our ass, just out of sheer respect for the piece.\"\n\nYou feel like this might be a lifetime pursuit?\n\n\"I think so. I’ll probably always send Nick one on his birthday.\"\n\nPratt tells me he hasn’t even seen Jurassic World yet. \"They’ve asked me if I wanted to come see it, and I’m, ’Are all the dinosaurs completely done?’ \" he says. \"You only get to see it for the first time once.\" But mostly he’s looking to the future. He met with James Gunn this week to be briefed on the Guardians sequel for the first time. \"I got teary-eyed,\" he says. \"He’s so fucking smart and peculiar.\" (Gunn declined to share the whole plot, Pratt says: \"He just knows me too well to tell me too much.\")\n\nIn turn, Gunn tells me this: \"I said before we ever started shooting Guardians that Chris Pratt’s the biggest movie star in the world, it’s just that people don’t know it yet. And that’s the case.\" As more people begin to share this opinion, one consequence is the way Pratt is routinely reported to be involved in multiple other new projects, often with a conviction that is confusing to him, given how wrong these reports typically are.\n\nFor instance, there is the widely and confidently reported story that he will be the next Indiana Jones. Pratt was on a four-day hunt on a Texas ranch when his manager and agent called to say that this \"fact\" had exploded all over the Internet. \"And so I came home, and then there was paparazzi asking me about it and people asking me to sign Indiana Jones pictures and Indiana Jones hats,\" he says. The truth, as far as he is concerned, is that someone high up at Disney did mention to him a while back that they were picking up the rights to Indiana Jones, to which Pratt commented that his action-adventure card was fairly full. (If Jurassic World does well, there will be sequels. And for the record, this is how he describes, almost more to himself than to me, his future Guardians of the Galaxy obligations: \"...I’m tied to doing three more, or five more, Guardians of the Galaxy or whatever it is, you know, two more Guardians plus another couple...\" I think this means he is committed to at least two sequels, as well as spin-off projects where his character will appear with other Marvel characters.) But as it happens, he’s also been around Steven Spielberg a fair bit recently (Spielberg produced Jurassic World), both before and after this rumor broke. \"I just didn’t bring it up and he didn’t bring it up,\" he says, \"so I don’t know.\"\n\nWhen asked by GQ to comment on this pastime, Offerman issued the following statement: \"Chris and I merely recognized in one another a formidable, concordant creator. Our ’pieces’ transcend bourgeois notions like ’taste,’ ’decorum,’ and ’NSFW.’ That’s plebeian stuff. He is magnificent—a lavatorial Michelangelo, and I am his Da Vinci. He proffers Rubber Soul, and I reply with Pet Sounds. The notions of ’culture,’ ’good taste,’ ’decency,’ and ’common sense’ are but flotsam to us. Jetsam, even. Our works have honesty in their fiber. His letter N, I met with a lengthy riposte: a twenty-six-inch rejoinder, to be precise, unbroken. From the backstage dressing room of an eldritch Kansas City auditorium. We are Komodo dragons, Christopher and I. We are moray eels, mated for life. Look away—back to your BuzzFeed puppies and falsettos. Ours is an ursine language, of which, if you have to ask—you’ll never know.\"\n\nSimilarly, it’s also been rumored recently that he will appear in a Channing Tatum-produced Ghostbusters remake. Even less likely. \"No one has ever even spoken to me about that,\" he says. \"Never. I’ve even seen Channing a couple times. As far as I know, that’s complete bullshit.\" He ticks off others. \"Knight Rider—bullshit. All of them.\" As we talk, a photo comes through on his phone. His son. \"My son went to the dentist for the first time today,\" he says. \"Oh, my God, he’s smiling. Oh, sweet boy!\" Pratt tells me that he and Faris would like more kids. \"I had siblings, so did Anna—we both dream of it. Jack should have the gift of a little person to push around, whether we have kids or potentially have a surrogate or adopt kids. He was premature, and Anna’s 38, so the idea of going through that again—that was tough, and I think, like, that’s something to truly consider.\"\n\nEither way, he clearly thinks of Jack as a kind of reality check. \"I have a feeling I’ll be tested and I’ll have to prove to him that he’s more important to me than show business,\" says Pratt, \"and I feel I’ll be ready to pass that test. You know, if it means not being Indiana Jones or if it means turning down a big paycheck so that I can go camping for the weekend, being difficult with my contract so that I can be let out, and it means the quality of the film goes down because I’m not there to give everything, then so be it. And if it means retiring early and getting a ranch somewhere and just bird hunting, that’s kind of what I secretly want to do anyways, so\"—he laughs—\"that’ll be sweet.\"\n\nBut how much do you secretly want to do it? Because you can do it if you want to.\n\n\"We’ll see. I don’t know. I think I would do it and then three months later I would be tired of bird hunting and I would be like ’...Guardians Ten?’ \"\n\nCHRIS HEATH is a GQ correspondent.", "images": ["http://www.gq.com/verso/static/gq/assets/logo-header.d739eb0c2af2cf500d0c7ebecd1d6597474e69aa.svg", "https://media.gq.com/photos/564276266ff00fb522b0741b/1:1/w_775%2Cc_limit/obama-tout.jpg", "https://media.gq.com/photos/5582c953e52bc4b477a9d88c/master/w_1600%2Cc_limit/entertainment-2015-06-chris-pratt-june-cover-409.jpg", "https://media.gq.com/photos/632cbe14cb2b02da816ceb43/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.gq.com/photos/631e1696203198c19dff8bf2/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.gq.com/photos/633b2cb81bb4070c67e5a570/1:1/w_350%2Ch_350%2Cc_limit/undefined", "http://www.gq.com/verso/static/gq/assets/logo-reverse.2fe772617ee3b7f2fc81c9f7237c17495b42eaee.svg", "https://media.gq.com/photos/5592cf226abb7583307c4c13/16:9/w_2560%2Cc_limit/0615-GQ-FECP02-01.jpg", "https://media.gq.com/photos/5592cf226abb7583307c4c13/16:9/w_1280,c_limit/0615-GQ-FECP02-01.jpg", "https://media.gq.com/photos/633b61981550cc73eb51f10e/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.gq.com/photos/633f1b9de3db2e41ce8ba50e/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.gq.com/photos/55833e2309f0bee564416d35/master/w_1600%2Cc_limit/copilot-style-201506-1431444034253_chris-pratt-gq-june-2015-02.jpg", "https://media.gq.com/photos/55833e213655c24c6c95f1a4/master/w_1600%2Cc_limit/copilot-style-201506-1431444034252_chris-pratt-gq-june-2015-01.jpg", "https://media.gq.com/photos/564b5985fc144926178b300c/4:3/w_800%2Ch_600%2Cc_limit/amy-schumer-obama-gift.jpg", "https://media.gq.com/photos/55833e253655c24c6c95f1a8/master/w_1600%2Cc_limit/copilot-style-201506-1431444034254_chris-pratt-gq-june-2015-03.jpg", "https://media.gq.com/photos/561c0bcee8a83977119f8388/4:3/w_800%2Ch_600%2Cc_limit/Screen%2520Shot%25202015-10-12%2520at%25203.33.54%2520PM.png"], "top_img": "https://media.gq.com/photos/5592cf226abb7583307c4c13/16:9/w_1280,c_limit/0615-GQ-FECP02-01.jpg", "keywords": [], "authors": ["Condé Nast", "Chris Heath", "Bill Simmons"], "canonical_link": "https://www.gq.com/story/chris-pratt-cover-story", "title": "Chris Pratt Cover Story: From Dadbod Sidekick to Rock-Hard Hero", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "width=device-width, initial-scale=1", "referrer": "no-referrer-when-downgrade", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2022", "description": "The ripped star of Jurassic World reflects on what became of his pudgier, goofier self", "id": "5582c9541177d66d68d589fa", "robots": "index, follow, max-image-preview:large", "content-type": "article", "parsely-post-id": "5582c9541177d66d68d589fa", "parsely-metadata": "{\"description\":\"The ripped star of Jurassic World reflects on what became of his pudgier, goofier self\",\"image-16-9\":\"https://media.gq.com/photos/5592cf226abb7583307c4c13/16:9/w_1000,c_limit/0615-GQ-FECP02-01.jpg\",\"image-1-1\":\"https://media.gq.com/photos/5592cf226abb7583307c4c13/1:1/w_1000,c_limit/0615-GQ-FECP02-01.jpg\"}", "og": {"description": "The ripped star of Jurassic World reflects on what became of his pudgier, goofier self", "image": "https://media.gq.com/photos/5592cf226abb7583307c4c13/16:9/w_1280,c_limit/0615-GQ-FECP02-01.jpg", "site_name": "GQ", "title": "Chris Pratt Cover Story: From Dadbod Sidekick to Rock-Hard Hero", "type": "article", "url": "https://www.gq.com/story/chris-pratt-cover-story"}, "article": {"content_tier": "free", "opinion": "false", "section": "tags", "published_time": "2015-05-18T00:00:00.000Z", "modified_time": "2015-05-18T00:00:00.000Z", "author": "Chris Heath"}, "twitter": {"card": "summary_large_image", "creator": "@gqmagazine", "description": "The ripped star of Jurassic World reflects on what became of his pudgier, goofier self", "domain": "https://www.gq.com", "image": "https://media.gq.com/photos/5592cf226abb7583307c4c13/16:9/w_1280,c_limit/0615-GQ-FECP02-01.jpg?mbid=social_retweet", "site": "@gqmagazine", "title": "Chris Pratt Cover Story: From Dadbod Sidekick to Rock-Hard Hero"}, "fb": {"app_id": 606963029328755, "pages": 7962048097}}, "movies": [], "publish_date": 1431907200.0, "source": "http://www.gq.com", "summary": ""}