{"url": "https://www.cinemablend.com/television/2302551/watch-jimmy-fallon-hilariously-cover-journey-get-heckled-by-will-ferrell", "text": "Will Ferrell appeared on The Tonight Show Starring Jimmy Fallon ahead of him hosting Saturday Night Live, and while sketches are usually SNL's forte, the two former castmates had to get together for a great bit on the late-night talk show. Fallon hilariously covered Journey's \"Don't Stop Believin,\" while Will Ferrell heckled him in a skit that could've been reserved for Saturday Night Live:\n\nIt was a bold move to have Jimmy Fallon, the master of unintentional laughing, play a stone-faced dead-pan singer while someone as funny as Will Ferrell shouted things at him. The host surprisingly maintained his composure and didn't break character until Ferrell stormed the stage with a \"Streetlights,\" and \"People,\" chant. Overall the skit was a hit. Although the costume choice The Tonight Show went with for both actors was rather confusing, until it was revealed at the end of the sketch Fallon's character sold the song to Journey.\n\nSpeaking of that end text, yes, StreetlightswithGabriel.com is a real website. The website for the fictional sports bar contains a submission section for inquiries, and a menu that has everything from \"Bite-Sized Boneless Blue Cheese Buffalo Wings,\" to \"Popsicles.\" The specialty drink menu contains some interesting items as well, as patrons can purchase drinks like the \"1952 Macallan Ice Luge,\" and the \"Surfer On Acid,\" slushie. There are even some reviews from people who have been to the establishment, and their words about the bar fit the description it was given on The Tonight Show:\n\nThis is the definition of a watering hole. Dimly lit, frankly a bit hard to see the drink in front of you. For some reason, they have only the 'Lite' version of beers. But, all in all, all of these features lead to an effective dive bar feel, and make you wanna order more of those yum-tastic chicken wings. -CAPITAL CITY DAILY, December 14, 2007\n\nIt's a fair amount of work to put into such a short but funny sketch on The Tonight Show, but totally worth it. It's not the only time a website has been created for a Will Ferrell related bit, as the actor later shared with Fallon the same thing was done for his fictional character that hosted the Rose Parade on Amazon. Ferrell also brought up another recent stunt he pulled at the Australian Open, and informed the audience that tennis legend Roger Federer had no idea Ferrell was going to interview him after the match. That's probably for the best, as there's a good chance Federer would've shot the idea down if he knew he was going to be asked if he was a vampire just minutes after a match.\n\nThe Tonight Show airs weeknights on NBC at 11:35 p.m. ET. Will Ferrell will attempt to keep his current funny streak at live events alive as he hosts Saturday Night Live on NBC Saturday, January 27 at 11:30 p.m. ET. For more on SNL and late-night talk shows, be sure to listen to Leslie Jones recall on Late Night With Seth Meyers the time she almost vomited all over James Franco live during a sketch last year. For a look at upcoming television that's set to return or premiere for the first time, head on over to our midseason premiere guide and see what's on tap.", "images": ["https://www.cinemablend.com/media/img/missing-image.svg", "https://cdn.mos.cms.futurecdn.net/JL3tJG7G5z9kNkUDV2DYzX-1200-80.jpg", "https://cdn.mos.cms.futurecdn.net/JL3tJG7G5z9kNkUDV2DYzX-320-80.jpg"], "top_img": "https://cdn.mos.cms.futurecdn.net/JL3tJG7G5z9kNkUDV2DYzX-1200-80.jpg", "keywords": [], "authors": ["Mick Joest", "Content Producer", "Window.Slicecomponents", "Window.Reliabledomcontentloaded.Then", "Var Componentcontainer", "Document.Queryselector", "Slice-Container-Authorbio", "If Componentcontainer", "Var Data", "Layout"], "canonical_link": "https://www.cinemablend.com/television/2302551/watch-jimmy-fallon-hilariously-cover-journey-get-heckled-by-will-ferrell", "title": "Watch Jimmy Fallon Hilariously Cover Journey, Get Heckled By Will Ferrell", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "pub_date": "2018-01-26T18:26:55+00:00", "description": "The two former Saturday Night Live co-stars reunited on The Tonight Show for a funny sketch.", "robots": "max-image-preview:large", "msapplication-TileColor": "#000000", "msapplication-TileImage": "https://cdn.mos.cms.futurecdn.net/flexiimages/tbhqzd9bso1619422461.png", "og": {"site_name": "CINEMABLEND", "image": {"identifier": "https://cdn.mos.cms.futurecdn.net/JL3tJG7G5z9kNkUDV2DYzX-1200-80.jpg", "width": 1200}, "type": "article", "title": "Watch Jimmy Fallon Hilariously Cover Journey, Get Heckled By Will Ferrell", "url": "https://www.cinemablend.com/television/2302551/watch-jimmy-fallon-hilariously-cover-journey-get-heckled-by-will-ferrell"}, "article": {"publisher": "https://www.facebook.com/cinemablendnews/", "published_time": "2018-01-26T18:26:55Z", "modified_time": "2018-01-26T18:26:55Z"}, "parsely-type": "post", "parsely-post-id": "cmLvpKi9x2QAxWLgBFjUj7", "parsely-pub-date": "2018-01-26T18:26:55Z", "parsely-title": "Watch Jimmy Fallon Hilariously Cover Journey, Get Heckled By Will Ferrell", "parsely-link": "https://www.cinemablend.com/television/2302551/watch-jimmy-fallon-hilariously-cover-journey-get-heckled-by-will-ferrell", "parsely-image-url": "https://cdn.mos.cms.futurecdn.net/JL3tJG7G5z9kNkUDV2DYzX.jpg", "parsely-section": "Television", "parsely-tags": "Category: Television,Category: News,will ferrell,Saturday Night Live,jimmy fallon,The Tonight Show Starring Jimmy Fallon,journey,serversidehawk", "parsely-author": "Mick Joest", "twitter": {"card": "summary_large_image", "site": "@cinemablend", "title": "Watch Jimmy Fallon Hilariously Cover Journey, Get Heckled By Will Ferrell", "creator": "@cinemablend", "image": "https://cdn.mos.cms.futurecdn.net/JL3tJG7G5z9kNkUDV2DYzX-1200-80.jpg", "account_id": 9696142}, "google-site-verification": "Oo3uNFWgI6psN58Pjx7Zjo3yYih1rOwQViWbItBCpyo", "taboola": {"url": "https://www.cinemablend.com/television/2302551/watch-jimmy-fallon-hilariously-cover-journey-get-heckled-by-will-ferrell"}, "botify-site-verification": "2pzcQZFibLjk9GJgSZgweA8MU9al6utA", "msvalidate.01": "CC462E6DF91492086145CA5EBDCB615E"}, "movies": [], "publish_date": 1516991215.0, "source": "https://www.cinemablend.com", "summary": ""}