{"url": "https://www.celebritynetworth.com/richest-athletes/nfl/nnamdi-asomugha-net-worth/", "text": "What is Nnamdi Asomugha's Net Worth and Salary?\n\nNnamdi Asomugha is an American former professional football player who has a net worth of $30 million. Nnamdi Asomugha played cornerback for the University of California, Berkeley, before being drafted in the first round of the 2003 NFL Draft by the Oakland Raiders. He also played for the Philadelphia Eagles and San Francisco 49ers over his pro career. As we detail later in this article, Nnamdi Asomugha earned a little over $70 million in NFL salary during his career.\n\nEarly Life\n\nNnamdi Asomugha was born in Lafayette, Louisiana, but grew up in Los Angeles, California. He played baseball and football throughout high school and chose to attend the University of California, Berkeley, where he continued to play football. He graduated from UC Berkeley with a degree in Corporate Finance and was drafted by the Oakland Raiders in 2003 to play professional football.\n\nNnamdi Asomugha went relatively unused during his first two seasons with the Raiders, but he broke out in 2005. He played exceptionally well for the Raiders through 2010, regularly appearing on lists of the best players in the NFL. He was an All-Pro selection four times while with the team and a Pro Bowl selection three times. He was Oakland Raiders MVP in 2006 and 2008. Unfortunately, after leaving Oakland, his career started to go downhill. He signed a five-year contract with the Philadelphia Eagles in 2011 and was a Pro Bowl alternate in 2012 but was released when the two sides couldn't come to an agreement on a contract restructure. In 2013, Asomugha signed a one-year deal with the San Francisco 49ers but was waived by the team later that year. He then retired from the NFL as an Oakland Raider in late December of 2013 after 11 years of playing time. In 2016, Pro Football Focus named Nnamdi Asomugha the best Oakland Raiders player of the past decade.\n\nContracts and Career Earnings\n\nNnamdi Asomugha signed his five-year $60 million contract with the Philadelphia Eagles in 2011. The contract came with $25 million of guaranteed money. His one-year deal with the San Francisco 49ers included a base salary of $1.35 million with incentives to earn an additional $1.65 million. During his career, Nnamdi earned $71 million in salary alone.\n\nPersonal Life\n\nIn July 2012, Nnamdi Asomugha announced his engagement to actress Kerry Washington and the couple were married in 2013. They have a daughter, Isabelle, and a son, Caleb, together. He has a form of color-blindness called deuteranomaly in which light colors tend to blend together, but Asomugha said it never affected him on the field\n\nPhilanthropy\n\nOutside of football, Nnamdi has done some acting and producing and has been involved in a lot of charitable work. He serves as Chairman for the Asomugha Foundation that operates Orphans and Widows In Need (OWIN) and the Asomugha College Tour for Scholars (ACTS). Asomugha was named a Home Depot Neighborhood MVP in 2007 for his commitment to the community and presented with the President's Volunteer Service Award in 2008. Fellow members of the NFL Players Association nominated him several times over his career for the the Byron \"Whizzer\" White Award for Outstanding Community Service, and in 2010, Asomugha took home the 44th annual Byron \"Whizzer\" White NFL Man of the Year award, their highest honor. In 2009, Asomugha was named to the \"Dream Team for Public Service\" by the Jefferson Awards for Public Service. In 2010, he became the ambassador for United Way of the Bay Area. Asomugha was named one of three finalists for the Walter Payton Man of the Year award in 2011 and in 2012 received the inaugural \"Role Model of the Year\" Award from the Congressionally chartered National Conference on Citizenship.", "images": ["https://vz.cnwimg.com/wp-content/uploads/2013/07/nnamdi.jpg", "https://vz.cnwimg.com/wp-content/uploads/2013/07/GettyImages-455939488.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2013/07/nnamdi.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-athletes/nfl/nnamdi-asomugha-net-worth/", "title": "Nnamdi Asomugha Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Nnamdi Asomugha net worth and salary: Nnamdi Asomugha is an American former professional football player who has a net worth of $30 million. Nnamdi Asomugha played cornerback for the University of California, Berkeley,", "cnw_share_fb_count": 39, "cnw_share_tw_count": 20, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Nnamdi Asomugha Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-athletes/nfl/nnamdi-asomugha-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2013/07/nnamdi.jpg", "site_name": "Celebrity Net Worth", "description": "Nnamdi Asomugha net worth and salary: Nnamdi Asomugha is an American former professional football player who has a net worth of $30 million. Nnamdi Asomugha played cornerback for the University of California, Berkeley,"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2022-09-23T13:29:51+00:00", "published_time": "2022-09-22T18:19:46+00:00", "section": "NFL Players", "tag": "Nnamdi Asomugha salary"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2013/07/nnamdi.jpg", "title": "Nnamdi Asomugha Net Worth", "description": "Nnamdi Asomugha net worth and salary: Nnamdi Asomugha is an American former professional football player who has a net worth of $30 million. Nnamdi Asomugha played cornerback for the University of ..."}}, "movies": [], "publish_date": 1663870786.0, "source": "https://www.celebritynetworth.com", "summary": ""}