{"url": "https://www.hollywoodreporter.com/live-feed/broad-city-end-season-5-as-ilana-glazer-abbi-jacobson-ink-viacom-pact-1102010", "text": "The end of Broad City is in sight.\n\nThe previously announced fifth season of the Comedy Central critical favorite — set to air in early 2019, more than a year after its fourth cycle ended — will be its last. Meanwhile, stars Ilana Glazer and Abbi Jacobson have signed a first-look television deal with Comedy Central parent company Viacom, with three projects already in development for their soon-to-be former network. The first-look pact covers Glazer and Jacobson together as well as individually.\n\n“Broad City has been our baby and first love for almost 10 years, since we started as a web series. It’s been a phenomenal experience, and we’ve put ourselves into it completely. Broad City’s always had a spontaneous pace and feeling, and ending after season five honors that spirit. We are very excited to bring new voices and points of view to Comedy Central and continue our collaboration together in new ways,” Glazer and Jacobson said Thursday in a joint statement.\n\nWhile none of the three comedies in development are written by or starring either Glazer or Jacobson, Comedy Central president Kent Alterman tells The Hollywood Reporter he’s “taking it as it comes” from the in-demand duo, who now both have film careers and are juggling other projects.\n\nIn development at the cable network are:\n\n• Mall Town USA, an animated comedy about a 13-year-old girl navigating puberty and society in American culture at the mall. The project is written and created by Gabe Liedman (Broad City), with Jacobson and Glazer executive producing.\n\n• Platinum Status, a live-action comedy written by Ilana Glazer’s brother, Eliot Glazer. He stars as a gay man who hooks up with a woman after his boyfriend of 10 years dumps him. Eliot Glazer will write the script and exec produce alongside Ilana Glazer, Principato Young’s Peter Principato and Brian Steinberg and Electric Avenue’s Will Arnett and Marc Forman.\n\n• Young Professionals hails from David Litt, who at 24 became one of the youngest White House speechwriters in history. The comedy is inspired by Litt’s coming of age in the nation’s capital and follows five housemates growing up — personally, politically and professionally — in Washington. Litt will pen the script and exec produce alongside Jacobson and Glazer.\n\nIn a larger sense, UTA-repped Glazer and Jacobson’s deal will allow them to develop projects across Viacom’s television portfolio. Unlike similar Viacom pacts with Trevor Noah and Tyler Perry, it is not exclusive and does not include film. Still, the deal sends a message to the town that Comedy Central is willing to do its part to keep homegrown talent as more of its stars have moved on elsewhere.\n\nBelow, Alterman talks with The Hollywood Reporter about the decision to end the award-winning show, what to expect from the deal and the future of another tentpole series, Inside Amy Schumer.\n\nWhy end Broad City now?\n\nIt’s more of a creative thing than anything. It’s a show about two twenty-somethings in New York, and Abbi and Ilana are smart about not wanting to overstretch it beyond plausibility. They’re telling a particular story about the post-college era in New York. It’s an organic conclusion to the journey that they’ve been on.\n\nWhose decision was it?\n\nUltimately it was their decision — where they want to resolve the characters’ stories. We’d never want them to overstay their welcome. It was really driven by creative storytelling and when is a natural life [of the show over]? We’re thrilled with five seasons of a show like this. The last thing we’d want is them to pretend they’re younger than they are and contrive and force it. The thing that matters to us more than anything is the creative integrity of the storytelling.\n\nThe final season isn’t returning until 2019, at which point it will have been off for more than a year. What’s behind the delay?\n\nThere’s no real delay. We’ve had other breaks with Broad City as well. One thing we did last year that was effective was we had a writing period and then they went off and did other things and came back to have a mini punch-up writing season that really helped. They’ll be doing the same thing this time. It’s about how it lines up with their schedules and not wanting to shoot in the winter. It’s just the way it naturally unfolded.\n\nYou’re signing Glazer and Jacobson to a larger first-look deal across all of Viacom in pacts similar to those with Tyler Perry and Trevor Noah.\n\nThis is more of a traditional first-look deal, and we already have three projects in development as part of it.\n\nNone of the three shows they’re developing for Comedy Central are either written by or star the duo. Is the expectation that they’ll return to TV and topline a show of their own again at some point?\n\nI don’t want to speak for them. They’re unwinding a 10-year intense, deep dive into this show and these characters [counting the web series]. The first stuff coming at us is stuff that they’re bringing from people they’ve collaborated with and new ideas. We’re taking it as it comes. We haven’t even discussed that. But if they had something they wanted to do on-camera, we wouldn’t refuse it. But it has to come organically.\n\nYou’re leveraging the entire Viacom portfolio here. What kind of conversations have you or CEO Bob Bakish had with Glazer and Jacobson to do something broader for other Viacom networks?\n\nI haven’t had that conversation with Bob. I don’t want to put the cart before the horse. To me, it’s like, what are the things that they naturally gravitate toward? When do they make sense for us or other Viacom brands? That’s how we’ll move forward.\n\nAs Netflix continues to poach prolific producers and talent, what’s the sell to Glazer and Jacobson to stay within the Viacom fold?\n\nWe’ve had a great collaboration with them and everyone is excited to continue.\n\nAs they came to you to end the show, what was the larger Viacom pitch to get them to stay? Ryan Murphy loved his time at 20th Century Fox but still signed with Netflix.\n\nIt was more of an organic, mutual conversation. There were no ulterior motives or coercion or anything like that. Like I said, we’ve had this great collaboration and everyone has been motivated to continue it and find whatever ways that make sense for stuff to come down the pike. We’re excited for more from them.\n\nAbbi Jacobson is co-writing and exec producing Amazon’s A League of Their Own. Both have busy film careers. What level of exclusivity will you have here?\n\nIt’s not exclusive. It’s first-look.\n\nDoes that include film?\n\nThere is no specific film component. But if they come to us with ideas that make sense, we’ll do it.\n\nHow much of this deal is a message to the town that you’re going to fight and try to keep more of your homegrown talent after, most recently, losing The Daily Show‘s Hasan Minhaj and Michelle Wolf to Netflix?\n\nWe’re definitely interested in continuing good, creative collaborations with the people that we’re in business with. We’re still bummed that Jon Stewart only gave us 16-plus years. But everyone has their path and we wish Hasan and Michelle well and continued success. With Hasan, we are continuing [our relationship] with him: We’re doing a special with his sketch group and hopefully we’ll have ongoing collaboration with him. Ultimately, we want to continue with people where it makes sense.\n\nHave you had any talks with Glazer and Jacobson about doing any sort of Broad City spinoff or movie to see where they are as they get into their 30s?\n\nWe’re really driven by the creative integrity of the storytelling. The last thing we’d do is start to contrive something for them. We’ll take it as it comes.\n\nAs you look to the end of one of your tentpole shows, what’s the latest on the previously announced fifth season of Inside Amy Schumer?\n\nWe’re in the same situation we’ve always been in: We’re here if and when she wants to use that format for more storytelling.", "images": ["https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/uploads/2016/04/thr_iiana_glazer__abbi_jacobson_thr_david_needleman_b_133-h_2016_copy.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2016/04/thr_iiana_glazer__abbi_jacobson_thr_david_needleman_b_133-h_2016_copy.jpg?w=2000&h=1126&crop=1", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2016/04/thr_iiana_glazer__abbi_jacobson_thr_david_needleman_b_133-h_2016_copy.jpg?w=1024", "keywords": [], "authors": ["Lesley Goldberg"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/broad-city-end-season-5-as-ilana-glazer-abbi-jacobson-ink-viacom-pact-1102010/", "title": "‘Broad City’ to End With Season 5 as Ilana Glazer and Abbi Jacobson Ink Viacom Pact", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The previously announced fifth season will return in early 2019 as its stars have already put three projects in development at Comedy Central under their new first-look deal.", "news_keywords": "Broad City, Comedy Central", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Lesley Goldberg", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1102010, "title": "'Broad City' to End With Season 5 as Ilana Glazer and Abbi Jacobson Ink Viacom Pact", "published_at": "2018-04-12 11:00:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2016/04/thr_iiana_glazer__abbi_jacobson_thr_david_needleman_b_133-h_2016_copy.jpg?w=1024", "comment_count": 0, "tags": "Comedy Central", "topics": "TV News", "body": "The end of Broad City is in sight.\r\nThe previously announced fifth season of the Comedy Central critical favorite — set to air in early 2019, more than a year after its fourth cycle ended — will be its last. Meanwhile, stars Ilana Glazer and Abbi Jacobson have signed a first-look television deal with Comedy Central parent company Viacom, with three projects already in development for their soon-to-be former network. The first-look pact covers Glazer and Jacobson together as well as individually.\r\n\"Broad City has been our baby and first love for almost 10 years, since we started as a web series. It's been a phenomenal experience, and we've put ourselves into it completely. Broad City's always had a spontaneous pace and feeling, and ending after season five honors that spirit. We are very excited to bring new voices and points of view to Comedy Central and continue our collaboration together in new ways,\" Glazer and Jacobson said Thursday in a joint statement.\r\nWhile none of the three comedies in development are written by or starring either Glazer or Jacobson, Comedy Central president Kent Alterman tells The Hollywood Reporter he's \"taking it as it comes\" from the in-demand duo, who now both have film careers and are juggling other projects.\r\n\r\nIn development at the cable network are:\r\n• Mall Town USA, an animated comedy about a 13-year-old girl navigating puberty and society in American culture at the mall. The project is written and created by Gabe Liedman (Broad City), with Jacobson and Glazer executive producing.\r\n• Platinum Status, a live-action comedy written by Ilana Glazer's brother, Eliot Glazer. He stars as a gay man who hooks up with a woman after his boyfriend of 10 years dumps him. Eliot Glazer will write the script and exec produce alongside Ilana Glazer, Principato Young's Peter Principato and Brian Steinberg and Electric Avenue's Will Arnett and Marc Forman.\r\n• Young Professionals hails from David Litt, who at 24 became one of the youngest White House speechwriters in history. The comedy is inspired by Litt's coming of age in the nation's capital and follows five housemates growing up — personally, politically and professionally — in Washington. Litt will pen the script and exec produce alongside Jacobson and Glazer.\r\nIn a larger sense, UTA-repped Glazer and Jacobson's deal will allow them to develop projects across Viacom's television portfolio. Unlike similar Viacom pacts with Trevor Noah and Tyler Perry, it is not exclusive and does not include film. Still, the deal sends a message to the town that Comedy Central is willing to do its part to keep homegrown talent as more of its stars have moved on elsewhere.\r\nBelow, Alterman talks with The Hollywood Reporter about the decision to end the award-winning show, what to expect from the deal and the future of another tentpole series, Inside Amy Schumer. \r\n\r\nWhy end Broad City now?\r\nIt's more of a creative thing than anything. It's a show about two twenty-somethings in New York, and Abbi and Ilana are smart about not wanting to overstretch it beyond plausibility. They're telling a particular story about the post-college era in New York. It's an organic conclusion to the journey that they've been on.\r\nWhose decision was it? \r\nUltimately it was their decision — where they want to resolve the characters' stories. We'd never want them to overstay their welcome. It was really driven by creative storytelling and when is a natural life [of the show over]? We're thrilled with five seasons of a show like this. The last thing we'd want is them to pretend they're younger than they are and contrive and force it. The thing that matters to us more than anything is the creative integrity of the storytelling.\r\nThe final season isn't returning until 2019, at which point it will have been off for more than a year. What's behind the delay?\r\nThere's no real delay. We've had other breaks with Broad City as well. One thing we did last year that was effective was we had a writing period and then they went off and did other things and came back to have a mini punch-up writing season that really helped. They'll be doing the same thing this time. It's about how it lines up with their schedules and not wanting to shoot in the winter. It's just the way it naturally unfolded.\r\nYou're signing Glazer and Jacobson to a larger first-look deal across all of Viacom in pacts similar to those with Tyler Perry and Trevor Noah.\r\nThis is more of a traditional first-look deal, and we already have three projects in development as part of it.\r\nNone of the three shows they're developing for Comedy Central are either written by or star the duo. Is the expectation that they'll return to TV and topline a show of their own again at some point? \r\nI don't want to speak for them. They're unwinding a 10-year intense, deep dive into this show and these characters [counting the web series]. The first stuff coming at us is stuff that they're bringing from people they've collaborated with and new ideas. We're taking it as it comes. We haven't even discussed that. But if they had something they wanted to do on-camera, we wouldn't refuse it. But it has to come organically.\r\n\r\nYou're leveraging the entire Viacom portfolio here. What kind of conversations have you or CEO Bob Bakish had with Glazer and Jacobson to do something broader for other Viacom networks?\r\nI haven't had that conversation with Bob. I don't want to put the cart before the horse. To me, it's like, what are the things that they naturally gravitate toward? When do they make sense for us or other Viacom brands? That's how we'll move forward.\r\nAs Netflix continues to poach prolific producers and talent, what's the sell to Glazer and Jacobson to stay within the Viacom fold? \r\nWe've had a great collaboration with them and everyone is excited to continue.\r\nAs they came to you to end the show, what was the larger Viacom pitch to get them to stay? Ryan Murphy loved his time at 20th Century Fox but still signed with Netflix.\r\nIt was more of an organic, mutual conversation. There were no ulterior motives or coercion or anything like that. Like I said, we've had this great collaboration and everyone has been motivated to continue it and find whatever ways that make sense for stuff to come down the pike. We're excited for more from them.\r\nAbbi Jacobson is co-writing and exec producing Amazon's A League of Their Own. Both have busy film careers. What level of exclusivity will you have here?\r\nIt's not exclusive. It's first-look.\r\nDoes that include film? \r\nThere is no specific film component. But if they come to us with ideas that make sense, we'll do it.\r\nHow much of this deal is a message to the town that you're going to fight and try to keep more of your homegrown talent after, most recently, losing The Daily Show's Hasan Minhaj and Michelle Wolf to Netflix? \r\nWe're definitely interested in continuing good, creative collaborations with the people that we're in business with. We're still bummed that Jon Stewart only gave us 16-plus years. But everyone has their path and we wish Hasan and Michelle well and continued success. With Hasan, we are continuing [our relationship] with him: We're doing a special with his sketch group and hopefully we'll have ongoing collaboration with him. Ultimately, we want to continue with people where it makes sense.\r\nHave you had any talks with Glazer and Jacobson about doing any sort of Broad City spinoff or movie to see where they are as they get into their 30s? \r\nWe're really driven by the creative integrity of the storytelling. The last thing we'd do is start to contrive something for them. We'll take it as it comes.\r\nAs you look to the end of one of your tentpole shows, what's the latest on the previously announced fifth season of Inside Amy Schumer?\r\nWe're in the same situation we've always been in: We're here if and when she wants to use that format for more storytelling.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Broad City’ to End With Season 5 as Ilana Glazer and Abbi Jacobson Ink Viacom Pact", "url": "https://www.hollywoodreporter.com/tv/tv-news/broad-city-end-season-5-as-ilana-glazer-abbi-jacobson-ink-viacom-pact-1102010/", "description": "The previously announced fifth season will return in early 2019 as its stars have already put three projects in development at Comedy Central under their new first-look deal.", "site_name": "The Hollywood Reporter", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2016/04/thr_iiana_glazer__abbi_jacobson_thr_david_needleman_b_133-h_2016_copy.jpg?w=1024", "locale": "en_US"}, "article": {"published_time": "2018-04-12T11:00:00+00:00", "modified_time": "2018-04-14T19:32:32+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Broad City’ to End With Season 5 as Ilana Glazer and Abbi Jacobson Ink Viacom Pact", "description": "The previously announced fifth season will return in early 2019 as its stars have already put three projects in development at Comedy Central under their new first-look deal.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2016/04/thr_iiana_glazer__abbi_jacobson_thr_david_needleman_b_133-h_2016_copy.jpg?w=3000"}}, "movies": [], "publish_date": 1523530800.0, "source": "https://www.hollywoodreporter.com", "summary": ""}