{"url": "https://en.wikipedia.org/wiki/Angelina_Pivarnick", "text": "American television personality (born 1986)\n\nAngelina Marie Pivarnick (born June 26, 1986)[1] is an American reality television personality who is best known for starring in the first two seasons of the MTV reality show Jersey Shore and its spin-off, Jersey Shore: Family Vacation. Pivarnick also appeared on the VH1 show Couples Therapy in 2012.\n\nEarly life [ edit ]\n\nPivarnick was born and raised in Staten Island, New York.[1] She has two sisters. She graduated from Susan E. Wagner High School.[citation needed]\n\nCareer [ edit ]\n\nBefore she joined the cast of Jersey Shore, Pivarnick worked as a waitress. Jersey Shore premiered on December 4, 2009. She was evicted from the shore house in the third episode of season one, after refusing to work her shift at the T-shirt shop.[2][3] She then was on Jersey Shore season two in Miami Beach, Florida and Pivarnick again departed the house during season two after violent confrontations with fellow cast-members Michael Sorrentino and Nicole \"Snooki\" Polizzi. She did not return for season three. Pivarnick made guest appearances during the fifth and sixth season.\n\nIn 2010, Pivarnick released the song \"I'm Hot\".[4] She and her boyfriend appeared in Season 1 of the VH1 reality show Couples Therapy, which premiered March 25, 2012.\n\nIn March 2011, Pivarnick appeared on the professional wrestling promotion Total Nonstop Action Wrestling, competing in a six-person tag team match.[5][6]\n\nIn 2011, Pivarnick made a brief appearance in the music video for rap group Dacav5's song \"Dirty Style\".[7] She also appeared as a contestant on the reality dating series Excused. She made it to the final round and was chosen by Sergio to try dating each other. She later released a new song, \"Gotta Go Out\", under the name Miss AP in August 2011, featuring Tony Hanson \"Fenix\". The song charted at No. 37 in the United States on the Billboard Dance/Club Play Songs list.[8]\n\nIn September 2012, she engaged in a debate with recording artist Adam Barta on the topic of gay marriage, which she said she opposed. She later reversed her position after Jersey Shore co-star JWoww criticized her on Twitter,[9] and issued a public apology via TMZ.[10] In December, Pivarnick announced a single release called \"Serendipity\" with Barta, in the hopes of making amends with the LGBT community.[11]\n\nIn 2018, Pivarnick and fiancé Chris Larangeira appeared on the show How Far Is Tattoo Far?[12]\n\nIn 2019, Pivarnick made a guest appearance on Double Shot at Love\n\nAfter joining Jersey Shore: Family Vacation in 2018 as a recurring guest, Pivarnick later became a full-time cast member in 2019.\n\nPersonal life [ edit ]\n\nOn January 12, 2018, Pivarnick became engaged to Chris Larangeira after a year of dating.[13][14] They married on November 20, 2019.[15][16][17] In February 2022, Larangeira filed for divorce after two years of marriage citing irreconcilable differences.\n\nPivarnick is a registered emergency medical technician and worked for the FDNY in Staten Island.[18] In 2020, she settled a lawsuit against a lieutenant of hers who she accused of sexual harassment.[19][20]\n\nFilmography [ edit ]\n\nReferences [ edit ]", "images": ["https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Angelina_Pivarnick", "title": "Angelina Pivarnick", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "viewport": "width=1000", "og": {"title": "Angelina Pivarnick - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}