{"url": "https://www.hollywoodreporter.com/news/john-dickerson-replacing-charlie-rose-cbs-morning-1073246", "text": "CBS announced Tuesday that John Dickerson will replace the ousted Charlie Rose as the third co-host of CBS This Morning, joining Gayle King and Norah O’Donnell. He begins in the role Wednesday.\n\nDickerson, a CBS News anchor, hosts Face the Nation on Sunday mornings, and the network said he will leave that role “in the coming weeks as CBS News prepares to name his successor.”\n\nCBS cut ties with Rose a day after The Washington Post reported on Nov. 20 that eight women have accused the newsman of sexual misconduct. Rose also lost distribution of his eponymous interview show on PBS and Bloomberg TV, effectively killing it for now.\n\nSince Rose’s departure, King and O’Donnell have been without a third anchor on some days. On other days, members of the CBS family have filled it. On Tuesday morning, CBS Evening News anchor Jeff Glor joined the show.\n\nThe network has largely been mum on the succession process, and some in the industry suggested that the show go without a third co-anchor. In the end, CBS went with one of its most well-respected, high-profile journalists for the important role. (HuffPost first reported that Dickerson would get the job.)\n\n“With John, Gayle, and Norah together we will be doubling down on serious news coverage,” CBS News president David Rhodes said in a memo to staff. “That’s what we’re all committed to at CBS News. Our three co-hosts together will represent those values to the audience every morning.”\n\nDickerson will relocate to New York for the position.\n\nRyan Kadro, who produces the newsy morning show, called Dickerson “the perfect complement to Gayle and Norah.”\n\nAt the time of Rose’s termination, Rhodes said: “Despite Charlie’s important journalistic contribution to our news division, there is absolutely nothing more important, in this or any organization, than ensuring a safe, professional workplace — a supportive environment where people feel they can do their best work.”\n\nRose has largely not been heard from since his much-publicized downfall.\n\nNBC recently named 10 a.m. co-host Hoda Kotb as Matt Lauer’s replacement for the first two hours of Today.\n\nDickerson made his first appearance as co-host on the CBS morning show on Wednesday, where he shared his excitement to be joining King and O’Donnell and the three of them reminisced about his mother Nancy Dickerson’s history at the network.\n\nJan. 10, 8:05 a.m. This story has been updated with Dickerson’s first appearance as co-host on Wednesday’s program.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/01/ctm_official-h_2018.jpg?w=1296&h=730&crop=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/ctm_official-h_2018.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/ctm_official-h_2018.jpg?w=1024", "keywords": [], "authors": ["Jeremy Barr"], "canonical_link": "https://www.hollywoodreporter.com/news/general-news/john-dickerson-replacing-charlie-rose-cbs-morning-1073246/", "title": "John Dickerson Replacing Charlie Rose on ‘CBS This Morning’", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Rose was fired by the network on Nov. 21.", "news_keywords": "CBS This Morning, Charlie Rose", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Jeremy Barr", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1073246, "title": "John Dickerson Replacing Charlie Rose on 'CBS This Morning'", "published_at": "2018-01-09 08:26:45", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/ctm_official-h_2018.jpg?w=1024", "comment_count": 0, "tags": "Charlie Rose", "topics": "News", "body": "CBS announced Tuesday that John Dickerson will replace the ousted Charlie Rose as the third co-host of CBS This Morning, joining Gayle King and Norah O'Donnell. He begins in the role Wednesday.\r\nDickerson, a CBS News anchor, hosts Face the Nation on Sunday mornings, and the network said he will leave that role \"in the coming weeks as CBS News prepares to name his successor.\"\r\nCBS cut ties with Rose a day after The Washington Post reported on Nov. 20 that eight women have accused the newsman of sexual misconduct. Rose also lost distribution of his eponymous interview show on PBS and Bloomberg TV, effectively killing it for now.\r\nSince Rose's departure, King and O'Donnell have been without a third anchor on some days. On other days, members of the CBS family have filled it. On Tuesday morning, CBS Evening News anchor Jeff Glor joined the show.\r\nThe network has largely been mum on the succession process, and some in the industry suggested that the show go without a third co-anchor. In the end, CBS went with one of its most well-respected, high-profile journalists for the important role. (HuffPost first reported that Dickerson would get the job.)\r\n\"With John, Gayle, and Norah together we will be doubling down on serious news coverage,\" CBS News president David Rhodes said in a memo to staff. \"That’s what we’re all committed to at CBS News. Our three co-hosts together will represent those values to the audience every morning.\"\r\nDickerson will relocate to New York for the position.\r\nRyan Kadro, who produces the newsy morning show, called Dickerson \"the perfect complement to Gayle and Norah.\" \r\nAt the time of Rose's termination, Rhodes said: \"Despite Charlie's important journalistic contribution to our news division, there is absolutely nothing more important, in this or any organization, than ensuring a safe, professional workplace — a supportive environment where people feel they can do their best work.\"\r\nRose has largely not been heard from since his much-publicized downfall.\r\nNBC recently named 10 a.m. co-host Hoda Kotb as Matt Lauer's replacement for the first two hours of Today.\r\nDickerson made his first appearance as co-host on the CBS morning show on Wednesday, where he shared his excitement to be joining King and O'Donnell and the three of them reminisced about his mother Nancy Dickerson's history at the network.\r\n\r\nJan. 10, 8:05 a.m. This story has been updated with Dickerson's first appearance as co-host on Wednesday's program.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "John Dickerson Replacing Charlie Rose on ‘CBS This Morning’", "url": "https://www.hollywoodreporter.com/news/general-news/john-dickerson-replacing-charlie-rose-cbs-morning-1073246/", "description": "Rose was fired by the network on Nov. 21.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/ctm_official-h_2018.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2018-01-09T08:26:45+00:00", "modified_time": "2018-01-10T08:35:26+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "John Dickerson Replacing Charlie Rose on ‘CBS This Morning’", "description": "Rose was fired by the network on Nov. 21.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/ctm_official-h_2018.jpg?w=1296"}}, "movies": ["https://www.youtube.com/embed/XQHtkH91qdQ"], "publish_date": 1515486405.0, "source": "https://www.hollywoodreporter.com", "summary": ""}