{"url": "https://www.hollywoodreporter.com/news/duffer-brothers-respond-claims-abuse-by-crew-member-1093610", "text": "Matt and Ross Duffer have responded to claims by an alleged former crewmember on Instagram that the Stranger Things creators/showrunners have doled out “abuse.”\n\n“I guess there’s no better day than #nationalwomensday to say #timesup and announce that I will not be a part of the filming of Season 3 of Stranger Things,” Instagram user @peytonnbrown, a self-described “lady grip” from Atlanta, posted Thursday. “Why, you ask? Because I stand with my sisters. I personally witnessed two men in high positions of power on that set seek out and verbally abuse multiple women. I promised myself that if I were ever in a situation to say something that I would.”\n\nH. Peyton Brown is credited as a member of the camera department for nine episodes of Stranger Things on IMDb. (Netflix representatives declined to comment on Brown’s role on the show.) While Brown never identified the Duffer Brothers in her Instagram post, she did in subsequent comments. The comments have since been hidden, but screenshots are circulating on social media.\n\n“We are deeply upset to learn that someone felt uncomfortable on our set,” the brothers said Saturday in a statement to The Hollywood Reporter. “Due to the high-stress nature of production, tempers occasionally get frayed, and for that, we apologize. However, we think it is important not to mischaracterize our set, where we believe strongly in treating everyone fairly regardless of gender, orientation, race, religion, or anything else. We remain totally committed to providing a safe and collaborative working environment for everyone on our productions.”\n\nAdded Netflix in its own response: “We looked into the concern that was raised when we heard of the allegation on Thursday, and found no wrongdoing. Maintaining a safe, respectful atmosphere on set is important to us, and we know it is to the Duffer Brothers as well.”\n\nWith multiple licensing deals and five Emmy Awards, Stranger Things has become a global phenomenon for Netflix. The streaming platform’s investigation comes as producers, stars and network executives alike are being held under closer scrutiny amid the #MeToo and Time’s Up movements. Netflix, for its part, fired House of Cards star and executive producer Kevin Spacey after multiple allegations of sexual harassment,and did the same with The Ranch star Danny Masterson following claims of sexual assault.\n\nStranger Things was renewed for a third season in December, with a return date yet to be determined.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2016/10/duffer_brothers_-_stranger_things_premiere_-_getty_-_h_-_2016.jpg?w=1296&h=730&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2016/10/duffer_brothers_-_stranger_things_premiere_-_getty_-_h_-_2016.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2016/10/duffer_brothers_-_stranger_things_premiere_-_getty_-_h_-_2016.jpg?w=1024", "keywords": [], "authors": ["Katie Kilkenny"], "canonical_link": "https://www.hollywoodreporter.com/news/general-news/duffer-brothers-respond-claims-abuse-by-crew-member-1093610/", "title": "‘Stranger Things’ Creators Respond to Claims of Verbal “Abuse” by Former Crewmember", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "\"We are deeply upset to learn that someone felt uncomfortable on our set. Due to the high-stress nature of production, tempers occasionally get frayed, and for that, we apologize,\" Matt and Ross Duffer said in a statement.", "news_keywords": "Matt Duffer, nsfs, Ross Duffer, stranger things, THRX", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Katie Kilkenny", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1093610, "title": "'Stranger Things' Creators Respond to Claims of Verbal \"Abuse\" by Former Crewmember", "published_at": "2018-03-10 13:25:18", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2016/10/duffer_brothers_-_stranger_things_premiere_-_getty_-_h_-_2016.jpg?w=1024", "comment_count": 0, "tags": "THRX", "topics": "News", "body": "Matt and Ross Duffer have responded to claims by an alleged former crewmember on Instagram that the Stranger Things creators/showrunners have doled out \"abuse.\"\r\n\"I guess there’s no better day than #nationalwomensday to say #timesup and announce that I will not be a part of the filming of Season 3 of Stranger Things,\" Instagram user @peytonnbrown, a self-described \"lady grip\" from Atlanta, posted Thursday. \"Why, you ask? Because I stand with my sisters. I personally witnessed two men in high positions of power on that set seek out and verbally abuse multiple women. I promised myself that if I were ever in a situation to say something that I would.\"\r\nH. Peyton Brown is credited as a member of the camera department for nine episodes of Stranger Things on IMDb. (Netflix representatives declined to comment on Brown's role on the show.) While Brown never identified the Duffer Brothers in her Instagram post, she did in subsequent comments. The comments have since been hidden, but screenshots are circulating on social media.\r\n“We are deeply upset to learn that someone felt uncomfortable on our set,\" the brothers said Saturday in a statement to The Hollywood Reporter. \"Due to the high-stress nature of production, tempers occasionally get frayed, and for that, we apologize. However, we think it is important not to mischaracterize our set, where we believe strongly in treating everyone fairly regardless of gender, orientation, race, religion, or anything else. We remain totally committed to providing a safe and collaborative working environment for everyone on our productions.\"\r\nAdded Netflix in its own response: \"We looked into the concern that was raised when we heard of the allegation on Thursday, and found no wrongdoing. Maintaining a safe, respectful atmosphere on set is important to us, and we know it is to the Duffer Brothers as well.”\r\nWith multiple licensing deals and five Emmy Awards, Stranger Things has become a global phenomenon for Netflix. The streaming platform's investigation comes as producers, stars and network executives alike are being held under closer scrutiny amid the #MeToo and Time's Up movements. Netflix, for its part, fired House of Cards star and executive producer Kevin Spacey after multiple allegations of sexual harassment,and did the same with The Ranch star Danny Masterson following claims of sexual assault. \r\nStranger Things was renewed for a third season in December, with a return date yet to be determined.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Stranger Things’ Creators Respond to Claims of Verbal “Abuse” by Former Crewmember", "url": "https://www.hollywoodreporter.com/news/general-news/duffer-brothers-respond-claims-abuse-by-crew-member-1093610/", "description": "“We are deeply upset to learn that someone felt uncomfortable on our set. Due to the high-stress nature of production, tempers occasionally get frayed, and for that, we apologize,” Matt…", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2016/10/duffer_brothers_-_stranger_things_premiere_-_getty_-_h_-_2016.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2018-03-10T13:25:18+00:00", "modified_time": "2018-03-11T13:08:10+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Stranger Things’ Creators Respond to Claims of Verbal “Abuse” by Former Crewmember", "description": "“We are deeply upset to learn that someone felt uncomfortable on our set. Due to the high-stress nature of production, tempers occasionally get frayed, and for that, we apologize,” Matt…", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2016/10/duffer_brothers_-_stranger_things_premiere_-_getty_-_h_-_2016.jpg?w=1296"}}, "movies": [], "publish_date": 1520688318.0, "source": "https://www.hollywoodreporter.com", "summary": ""}