{"url": "https://www.theknotnews.com/celebrity-bridesmaids-stars-weddings-17435", "text": "While many of Hollywood’s leading ladies are accustomed to taking center stage, the stars are certainly prepared to step aside to tackle the all-important supporting role of bridesmaid. The Knot looks back on the stars who’ve served in bridal parties, ranging from Mary-Kate and Ashley Olsen to Taylor Swift, and many more.\n\nNina Dobrev\n\nThe Vampire Diaries alum served as a bridesmaid in Julianne Hough’s Idaho nuptials to Brooks Laich, even rehearsing and performing a choreographed dance to one of Sia’s hits.\n\nTaylor Swift\n\nThe Grammy winner has proudly served as the maid of honor in two weddings within the last two years. In February 2016, Swift served as the MOH in childhood best friend Britany Maack’s nuptials. The singer stunned as maid of honor in a flowy, blush, custom gown by Reem Acra with a beaded bodice. “I’m the happiest maid of honor ever,” she shared alongside a post-ceremony Instagram snap.\n\nBritany LaManna Wedding from Britany LaManna Wedding on Vimeo.\n\nThat stint was followed by the Reputation singer accompanying high school best friend Abigail Anderson down the aisle for her Martha’s Vineyard ceremony in September 2017. Swift coordinated with the other bridesmaids in oxblood, floor-length gowns, and even posed for some hilarious photos later posted to a fan account.\n\nNothing will ever compare to the love and support our wedding party provided us on this special day of ours. We 💕you all! #cheerstotheluciers A post shared by Abigail (Anderson) Lucier (@abigail_lauren) on Oct 6, 2017 at 11:55am PDT\n\nMary-Kate and Ashley Olsen\n\nIt takes two… or in this case, dozens. The Olsen twins have served as bridesmaids in the past, but they were particularly floral and festive for a friend’s Hudson Valley nuptials in July 2017. The bride asked her 18 bridesmaids to all wear derivatives of floral prints. Both designers managed to infuse their sophisticated and original style into the wedding party, completing their outfits with oversize dresses and floral crowns.\n\nThe designers doubled up as bridesmaids at their friend’s outdoor wedding in Mangwhai, New Zealand in February 2017. Both girls wore mismatched black dresses for the occasion and styled their hair comfortably.\n\nWe did it ! #mrandmrsflames A post shared by Sarah Staudinger (@staud) on Jul 22, 2017 at 3:50pm PDT\n\nLauren Conrad\n\nIt was a Laguna Beach reunion for the Paper Crown designer, her high school best friend Lo Bosworth, and Christina Sinclair (nee Schuller) in an August 2017 wedding at the Ojai Valley Inn and Spa.\n\nI was lucky enough to be in my dear friend @cassandrabette’s wedding this weekend👰🏻 Not only was she the most stunning bride, but she planned the beautiful wedding herself. So proud of you Mrs. Katz! You amaze me! A post shared by Lauren Conrad (@laurenconrad) on Aug 22, 2017 at 6:26pm PDT\n\nOur @papercrown bridesmaids dresses were perfection. Thank you @laurenconrad and @mauraoehm !! And thank you to my best friends for standing by my side #bridesmaids #cassandrabetteevents #twokatzarebetterthanone #papercrown A post shared by Cassandra Katz (@cassandrabette) on Aug 25, 2017 at 12:43pm PDT\n\nHailey and Ireland Baldwin\n\nThe Baldwin models served as bridesmaids in Alaia Baldwin’s upstate New York wedding in September 2017. The bride’s younger sister, runway model Hailey Baldwin, served as the maid of honor and expertly took on her duties. “Thank you @haileybaldwin for stepping up and slaying as my maid of honor,” her sibling later wrote on Instagram.\n\nTalk about a gorgeous bridal party 😍 | Photo: @christianoth ✨ #almostaronow #wearonowofficial A post shared by Christian Oth Studio (@christianothstudio) on Sep 2, 2017 at 4:11pm PDT\n\nPippa Middleton\n\nPerhaps one of the most famous bridesmaids ever, the younger sister of the Duchess of Cambridge made a splashy debut at the royal wedding in 2011.\n\nRachel Bilson\n\nThe star served as a bridesmaid in the rustic wedding of a close friend held at a ranch in Susana, California. Bilson–and more than a dozen other bridesmaids–all wore derivatives of blush. This wasn’t Bilson’s first time serving in a wedding–she was also in her brother’s wedding in summer 2016.\n\nMy beautiful baby bunns is married. I love you @gegelspot to the moon and back ❤❤❤ #gorgeousbride #youfancy A post shared by @rachelbilson on Mar 25, 2017 at 9:58pm PDT\n\nMy #HOD girls @wipeyoownass @kachtmeyer celebrating @gegelspot @elijah_medge #gelgetsmedged #alwaysabridesmaid 👰🏼 A post shared by @rachelbilson on Mar 25, 2017 at 5:41pm PDT\n\nMargot Robbie\n\nFive months after marrying Tom Ackerley, the Suicide Squad actress served as a bridesmaid in a friend’s wedding in Hawaii.\n\nGoing to the chapel… J❤️N A post shared by @margotrobbie on May 11, 2017 at 8:01pm PDT\n\nBachelorette JoJo Fletcher\n\nBefore the sweat, champagne, and embarrassing dance moves turned formal dining tables into full on dance floors #sorrynotsorry (Also s/o to @austendor and @krisdaswani for the bad ass dark blue tux Gosling inspired, custom made and designed in Dallas for a trim look with plenty of flexibility to shred the dance floor #notanad) A post shared by Jordan Rodgers (@jrodgers11) on Feb 24, 2017 at 3:39pm PST\n\nParis Hilton\n\nThe Simple Life star served as the maid of honor in her younger sister Nicky’s wedding in London, England, in July 2015.\n\nMiranda Kerr\n\nThe supermodel was a mesmerizing bridesmaid at her brother Matthew Kerr’s outdoor Australian wedding in December 2016. Kerr proudly stood beside her sibling as the groom exchanged vows with his partner James Wright in front of 280 guests. In her supporting role, she donned an ivory, sleeveless gown, and swept her long, dark hair into an elegant updo, complete with a flower crown.\n\nThey decided on forever… @mattykerr26 @jimmykerr2611 @mirandakerr @nannakerrs @thedivinecompany #lovewins #loveismattyandjimmy #theydecidedonforever A post shared by Therese Kerr (@theresekerr) on Dec 30, 2016 at 7:45pm PST\n\nDianna Agron\n\nIt was a gleeful occasion when Agron stood in as bridesmaid at friend Megan Mitchell’s nuptials in September 2016. The actress was radiant in a dusty pink-colored, sleeveless piece by Reformation. “Always so honored to be by your side @chefmeganmitch,” Agron gushed in an Instagram post. “I love you. Yesterday was perfect.”\n\nBeyonce\n\nIn April 2015, Beyonce’s mother, Tina Knowles, married her beau on-board a yacht. The “All Night” singer wore a form-fitting lace dress and a floral crown to stand beside her beloved mom.\n\nBeyonce and Jay Z’s adorable daughter Blue Ivy was precious in a white, tulle dress and tiara.\n\nJennifer Lawrence\n\nThe actress has remained close to many of her childhood friends, and they all want her in their weddings! The Hunger Games star has already played the part of bridesmaid on four separate occasions. In October 2013, Lawrence was part of her big brother Blaine’s wedding party.\n\nRecently, she vowed to never be a bridesmaid again. “If anyone asks me again, I’m going to say, ‘No,’” the A-lister said in a 2016 interview with Vanity Fair. “That part of my life is over. I appreciate the ask.”\n\nRyan Seacrest\n\nThis proud big brother served as his sister Meredith’s “man of honor” in her November 2016 wedding. The On Air host and his sibling even fit in a pre-wedding workout on the morning of the nuptials. Seacrest was a handsome addition to the bridal party. He looked dapper in a crisp, blue suit and casual shoes.\n\ntrying to fit in… final countdown! A post shared by Ryan Seacrest (@ryanseacrest) on Nov 5, 2016 at 5:30pm PDT\n\nEmma Slater, Lindsay Arnold, Jenna Johnson, and Brittany Cherry\n\nWhen Dancing With the Stars pro Witney Carson married her high school sweetheart, Carson McAllister, on New Year’s Day 2016, she enlisted fellow dance friends to play a special part in the bridal party. The ladies wore fawn Amsale gowns with matching wraps to keep warm during a snowy, outdoor photo shoot. Carson gifted her gals with leather, monogrammed clutches.\n\nAmy Schumer\n\nShe wrapped filming in Hawaii just in time to serve as her friend Tara Fitton’s bridesmaid in August 2016. Schumer appeared to have a great time with boyfriend Ben Hanisch by her side. The actress wore a long, strapless dress, and her hair in an updo. “Congratulations to @tara_alana and @rustolleum [on] the best wedding ever. Very proud to be a bmaid.” she captioned a shot of she and her beau with the newlyweds.\n\nCongratulations to @tara_alana and @rustolleum in the best wedding ever. Very proud to be a bmaid. A post shared by @amyschumer on Aug 14, 2016 at 10:39am PDT\n\nKelly Rowland\n\nWith her long, black, strapless gown and chic ponytail, Rowland made a breathtaking bridesmaid during Ciara and Russell Wilson’s July 2016 wedding in picturesque Cheshire, England. After the ceremony, the 35-year-old singer shared a group shot in front of Peckforton Castle, where the newlyweds exchanged vows. “This was a magical day for my dear friends!” she captioned the artful image. “CONGRATULATIONS to these lovebirds!”\n\n#TheWilsons This was a magical day for my dear friends! CONGRATULATIONS to these lovebirds! This time last week I was coming down off of my happy with these 2! I LOVE you guys! XO A post shared by kellyrowland (@kellyrowland) on Jul 16, 2016 at 12:32pm PDT\n\nSarah Jessica Parker\n\nThe Sex and the City icon, who looks amazing in just about anything, showed up in a flowy, plum-colored dress as a bridesmaid in her former assistant Melinda’s wedding in August 2014.\n\nParker proudly showed off her look prior to the nuptials, posting a photo of the gown on Instagram.“A quick disco nap before heading towards church and a very joyous day and night,” she captioned the shot.\n\nIts wedding day for Melinda! My bridesmaid dress, stretching, releasing wrinkles and then a quick disco nap before heading towards church and a very joyous day and night. X sj A post shared by SJP (@sarahjessicaparker) on Aug 16, 2014 at 8:03am PDT\n\nJessica Szohr\n\nIt was a tropical celebration when Szohr joined her sister Meg in Jamaica for her seaside nuptials in late 2016. The Gossip Girl alum dazzled in a sparkly, sea-foam green dress.\n\nLove these ladies ;)))))) @meganyanz you captured moments that will be in my heart forever:) ❤ A post shared by Jessica Szohr (@jessicaszohr) on Jan 4, 2017 at 5:39pm PST\n\nWhile recalling her 2016 highlights recently, the actress shared photos from the destination wedding. “I can’t explain the emotions and laughs that occurred on this trip!” she captioned an image of the siblings. To the newlyweds, she added: “Love you both… let’s make 2017 another great year.”\n\nSofia Vergara\n\nIn June 2015, Vergara could hardly stop smiling when she was part of a friend’s bridal party. The Modern Family star looked gorgeous in a strapless, pale yellow gown.\n\n@bui0728 wedding!!!!!!! Congratulations!!!👰 A post shared by Sofia Vergara (@sofiavergara) on Jun 27, 2015 at 6:29pm PDT\n\n“It’s bad luck if you don’t eat wedding cake,” the actress jokingly captioned a photo of herself dining on a piece of cake. She then shared a group shot, which included her now-husband, Joe Manganiello.\n\nEva Longoria\n\nThe actress-turned-producer was effortlessly beautiful during Alina Peralta and Manuel Gutierrez’s May 2015 nuptials–who also knew how to have a good time. Longoria ran barefoot through the streets of Cordoba, Spain, in her tulle, strapless gown. The Desperate Housewives alum posted several Instagram snaps of the post-ceremony celebration, including a candid shot of a friend whose hair got stuck in Longoria’s belt.\n\nMy friend Lorena’s hair is stuck to my belt on my dress! #CantStopLaughing #TooMuchFun A post shared by Eva Longoria Baston (@evalongoria) on May 1, 2015 at 10:09pm PDT\n\nLady Gaga\n\nBack in March 2015, the “Million Reasons” singer traveled to New Orleans to take part in her best friend’s wedding. She wore a lavender gown and kept her long, blonde hair down.\n\n“Watching your best friend get married, these are the specialist times in my life. Seeing happiness in the lives of all my friends,” the artist captioned an Instagram photo of her pink heels.\n\nIn September, 2016, Gaga played the role of bridesmaid once again for another friend’s nuptials in Cabo San Lucas, Mexico. This time, she donned a champagne-pink, halter-style gown and a giant flower in her hair.\n\nKeira Knightley\n\nKnightley made a lovely bridesmaid at her brother Caleb’s nuptials in April 2011. The 31-year-old Collateral Beauty actress donned a short, plum-colored dress with a full skirt to the ceremony in Glasgow, Scotland.\n\nKirsten Dunst\n\nDunst’s stylist friend Leith Clark got married in 2012, and for the occasion, the actress wore a peach and white, floor-length gown paired with a wildflower crown.\n\nThe newly-engaged actress will step into the main role of bride in her upcoming wedding.\n\nJennifer Garner\n\nIn 2006, Garner proudly took part in her assistant’s bridal party. The Mother’s Day actress donned a silver, strapless gown and simple jewelry to the ceremony in Santa Barbara.\n\nSarah Michelle Gellar\n\nRocking a pretty, pink dress and carrying a matching bouquet, Gellar was a picture-perfect bridesmaid at a friend’s wedding back in 2006.\n\nSecure your ideal wedding vision by starting with The Knot’s Style Quiz, here.", "images": ["https://www.theknotnews.com/wp-content/uploads/2020/04/GettyImages-1038262530-120x67.jpg", "https://www.theknotnews.com/wp-content/uploads/2016/12/cropped-the-knot-news-logo@2x.png", "https://media-api.xogrp.com/images/cec381d2-93e9-4201-9271-30f51f4fec94~rs_200.h", "http://www.theknotnews.com/wp-content/uploads/2017/01/Pippa-Middleton-Royal-Wedding-Shutterstock.jpg", "https://www.theknotnews.com/wp-content/uploads/2017/01/Pippa-Middleton-Kate-Middleton-Bridesmaid-1500x1200.jpg", "https://www.theknotnews.com/wp-content/uploads/2020/03/Questions-About-How-Coronavirus-Could-Affect-Your-Wedding_-Read-This-LEAD-shutterstock-120x67.jpg", "https://www.theknotnews.com/wp-content/uploads/2020/03/shutterstock_1554396644-120x67.jpg", "https://www.theknotnews.com/wp-content/uploads/2020/03/89960078_664744544273850_2656838980867194880_o-120x67.jpg", "https://www.theknotnews.com/wp-content/uploads/2017/01/Pippa-Middleton-Kate-Middleton-Bridesmaid.jpg", "http://www.theknotnews.com/wp-content/uploads/2016/01/witney-carson-carson-mcallister-wedding-10-1024x892.jpg", "http://www.theknotnews.com/wp-content/uploads/2017/02/GettyImages-480252754-683x1024.jpg", "https://www.theknotnews.com/wp-content/uploads/2020/03/IMG_2127-120x67.jpg"], "top_img": "https://www.theknotnews.com/wp-content/uploads/2017/01/Pippa-Middleton-Kate-Middleton-Bridesmaid.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.theknotnews.com/celebrity-bridesmaids-stars-weddings-17435", "title": "Celebrity Bridesmaids Photos: Pippa Middleton, Olsen Twins and More", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=no, minimal-ui", "description": "From Taylor Swift to Mary-Kate and Ashley Olsen, see which celebrities have faithfully served as bridesmaids in weddings.", "og": {"locale": "en_US", "type": "article", "title": "Celebrity Bridesmaids Photos: Pippa Middleton, Olsen Twins and More", "description": "From Taylor Swift to Mary-Kate and Ashley Olsen, see which celebrities have faithfully served as bridesmaids in weddings.", "url": "https://www.theknotnews.com/celebrity-bridesmaids-stars-weddings-17435", "site_name": "The Knot News", "updated_time": "2018-08-18T15:51:58+00:00", "image": {"identifier": "https://www.theknotnews.com/wp-content/uploads/2017/01/Pippa-Middleton-Kate-Middleton-Bridesmaid.jpg", "secure_url": "https://www.theknotnews.com/wp-content/uploads/2017/01/Pippa-Middleton-Kate-Middleton-Bridesmaid.jpg", "width": 2000, "height": 1321}}, "article": {"tag": "Taylor Swift", "section": "Celebrity", "published_time": "2018-08-17T21:00:12+00:00", "modified_time": "2018-08-18T15:51:58+00:00"}, "twitter": {"card": "summary", "description": "From Taylor Swift to Mary-Kate and Ashley Olsen, see which celebrities have faithfully served as bridesmaids in weddings.", "title": "Celebrity Bridesmaids Photos: Pippa Middleton, Olsen Twins and More", "image": "https://www.theknotnews.com/wp-content/uploads/2017/01/Pippa-Middleton-Kate-Middleton-Bridesmaid.jpg"}, "generator": "WordPress 4.9.8", "wp-parsely_version": "2.0", "msapplication-TileImage": "https://static.xoedge.com/patterns/images/windows-tile-144x144.png", "HandheldFriendly": "True", "MobileOptimized": 320, "mobile-web-app-capable": "yes", "msapplication-square70x70logo": "https://static.xoedge.com/patterns/images/windows-tile-70x70.png", "msapplication-square150x150logo": "https://static.xoedge.com/patterns/images/windows-tile-150x150.png", "msapplication-square310x310logo": "https://static.xoedge.com/patterns/images/windows-tile-310x310.png", "msapplication-TileColor": "#6CC6F0"}, "movies": ["https://player.vimeo.com/video/156991650"], "publish_date": 1534539612.0, "source": "https://www.theknotnews.com", "summary": ""}