{"url": "https://www.app.com/story/entertainment/music/2018/02/01/justin-timberlake-janet-jackson-not-joining-me-super-bowl-lii/1089352001/", "text": "Justin Timberlake: Janet Jackson will not be joining me at Super Bowl LII\n\nShow Caption Hide Caption Timberlake: No 'N Sync reunion at Super Bowl At a press conference, Super Bowl 52 halftime performer Justin Timberlake says no to 'N Sync reunion, praises Prince and Tom Brady, and endures a reporter's \"Happy Birthday\" song. (Feb. 1) AP\n\nWill Janet Jackson be joining Justin Timberlake at the 2018 Super Bowl halftime show?\n\n“Well, no,” said Timberlake at a pre-Super Bowl press conference, Thursday, Feb. 1 in Minneapolis, Minn., according to NFL.com. “I had a ton of grand ideas about special guests. I think Vegas has a lot of odds on it I heard, from ‘N Sync, to (Jay Z), to Chris Stapleton, to Janet. But this year, I’m just excited, my band, the Tennessee Kids, I feel like they’re my special guest this year and I’m excited to rock the stage.”\n\nTimberlake joined 2004 Super Bowl headliner Jackson on stage during her performance during the halftime show. He ripped off part of Jackson’s top while singing the lyric “gonna have you naked by the end of this song” from his funk-lite hit, “Rock Your Body.”\n\nMore: Justin Timberlake Super Bowl LII: Halftime show right note in #TimesUp era?\n\nHe said it wasn’t intentional and called it a “wardrobe malfunction.” Afterward, his career flourished but Jackson was blacklisted by MTV and parent company Viacom, according to Rolling Stone, and she was to appear on the 2004 Grammys in a tribute to Luther Vandross, but was reportedly dropped from the broadcast in the wake of the scandal.\n\nTimberlake, who’s new album “Man of the Woods,” comes out on Friday, Feb. 2, was not asked about the 2004 halftime show during the 25 minute press conference. He did say that he'll be performing his hit, \"Can't Stop the Feeling!\" from the movie \"Trolls,\" at the upcoming halftime show.\n\nHe was asked about Minneapolis native Prince.\n\n“In my opinion, the greatest all-around musician I can think of in popular culture,” Timberlake said. “He’s a huge influence on me. It seems like maybe braggadocious to say but I’m going to say it anyway: The time I got to spend around him, with him, talking about music, those are memories I’ll keep with me forever. Because he’s always been such a big idol of mine, it feels nice to be here.”\n\nHe also expanded on his friendship with New England Patriots quarterback Tom Brady.\n\n“Tom’s definitely the type of dude you invite over to watch the Super Bowl with you, the problem is that he’s always at the Super Bowl,” Timberlake said.\n\nA group of journalists also sang Happy Birthday to Timberlake, who turned 37 on Wednesday, Jan. 31.\n\nThe Philadelphia Eagles take on the Patriots 6:30 p.m., Sunday, Feb. 4 at U.S. Bank Stadium in Minneapolis. The game starts at 6:30 p.m. and the halftime show should begin around 8:20 p.m.\n\nChris Jordan: cjordan@app.com. Twitter: @chrisfhjordan", "images": ["https://www.gannett-cdn.com/-mm-/017f1aa0b54ef59e04a2adfc9972c6f6794cd5d5/c=0-507-3654-2572/local/-/media/2018/02/01/USATODAY/USATODAY/636531120917551820-AFP-AFP-YJ1NE.jpg?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://media.gannett-cdn.com/29906170001/29906170001_5724300305001_5724297838001-vs.jpg?pubId=29906170001"], "top_img": "https://www.gannett-cdn.com/-mm-/017f1aa0b54ef59e04a2adfc9972c6f6794cd5d5/c=0-507-3654-2572/local/-/media/2018/02/01/USATODAY/USATODAY/636531120917551820-AFP-AFP-YJ1NE.jpg?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Chris Jordan"], "canonical_link": "https://www.app.com/story/entertainment/music/2018/02/01/justin-timberlake-janet-jackson-not-joining-me-super-bowl-lii/1089352001/", "title": "Justin Timberlake: Janet Jackson will not be joining me at Super Bowl LII", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=514649656, app-argument=https://www.app.com/story/entertainment/music/2018/02/01/justin-timberlake-janet-jackson-not-joining-me-super-bowl-lii/1089352001/entertainment/music", "theme-color": "#ffffff", "og": {"title": "Justin Timberlake: Janet Jackson will not be joining me at Super Bowl LII", "description": "No guests during halftime show, Timberlake says", "site_name": "Asbury Park Press", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/017f1aa0b54ef59e04a2adfc9972c6f6794cd5d5/c=0-507-3654-2572/local/-/media/2018/02/01/USATODAY/USATODAY/636531120917551820-AFP-AFP-YJ1NE.jpg?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "description": "No guests during halftime show, Timberlake says", "twitter": {"site": "@asburyparkpress", "creator": "@asburyparkpress", "card": "summary_large_image"}}, "movies": [], "publish_date": 1517443200.0, "source": "https://www.app.com", "summary": ""}