{"url": "https://www.wonderwall.com/celebrity/justin-theroux-vacations-bff-emma-stone-casually-dating-others-plus-more-news-3014570.gallery", "text": "Justin Theroux vacations Emma Stone while 'casually' dating Still \"just BFFs.\" Despite rekindled romance rumors about the nature of \"Maniac\" costars Justin Theroux and Emma Stone, sources tell E! News the two are pals as Justin \"casually\" makes his way back into the dating pool. Justin and Emma were photographed together on Tuesday, May 29, at Hotel du Cap-Eden Rock in the South of France, alongside friends including Sienna Miller. The crew reportedly chilled at a cliffside cabana and enjoyed a swim after sharing lunch. \"They laughed all afternoon long,\" said the source. The day before, both actors were spotted at the Louis Vuitton Cruise fashion show and lunch, although they reportedly did not go together. \"Their friends and colleagues were with them during the day [on Monday] and they are just friends,\" a second source told E! Meanwhile, Justin is relaxing and enjoying his bachelorhood since he split from Jennifer Aniston. \"He's casually dating, but it's nothing more,\" the first source says. \"He's in a great place and very happy. He's enjoying being social and meeting people from all walks of life. He is excited about doing new things and traveling. He's looking forward to a great summer of fun and just seeing where it leads. He is letting loose for the first time in several years. He doesn't have anyone else to be responsible for or to report back to and he's taking advantage of that and having fun. Justin seems single and very much moved on from his marriage. He seems to really be enjoying himself.\" As Justin assured followers on social media last month when he shared a photo of himself with Stone alongside Jonathan Van Ness from \"Queer Eye,\" \"\"Bffffffs. And yes. JUST bfffffs.\" RELATED: Hollywood's 50 hottest unmarried guys\n\nJulia Roberts to present George Clooney with AFI Lifetime Achievement Award The American Film Institute has decided George Clooney will be the recipient of the 2018 AFI Lifetime Achievement Award, which is given each year to someone \"whose talent has in a fundamental way advanced the film art; whose accomplishment has been acknowledged by scholars, critics, professional peers and the general public; and whose work has stood the test of time,\" according to Variety. George's pal and longtime pal, Julia Roberts, is set to present the award at the June 7 ceremony in Los Angeles — which basically means you can count on at least one reference to George's habit of pranking his co-stars, pouring tequila shots at (royal) weddings or hosting boat parties at which famous guests wear shirts that read, \"George Clooney is a beautiful man.\" RELATED: George Clooney's life in pictures\n\nKendall Jenner and Ben Simmons double date with Jordyn Woods and Devin Booker Kendall Jenner still seems intent on keeping her lips sealed when it comes to her rumored new beau, 76s star Ben Simmons. But as TMZ points out, the two aren't trying too hard to deny there's something between them. On Wednesday, May 30, Kendall and Ben stepped out for some fun at Nice Guy in West Hollywood. They reportedly dodged cameras by arriving separately. Kendall even pretended to leave at one point — then ducked back in and hung out with the basketball player for a few more hours. According to TMZ, they left around 1 a.m. in an SUV with Kylie Jenner's best friend, Jordyn Woods, who also happened to have been out for the evening with an NBA star — the Phonex Suns' Devin Booker. RELATED: New celebrity couples of 2018\n\nKendrick Lamar gets a standing ovation as he accepts his Pulitzer Prize for 'DAMN.' Kendrick Lamar made history on Wednesday, May 30, when became the first rapper to take home the Pulitzer Prize for music. He earned a well deserved standing ovation when he approached the stage at Columbia University in New York City to accept the award, according to Page Six. The luncheon that followed the awards ceremony was understandably energetic and emotional, according to reports, with celeb fans and well-wishers like Mia Farrow, whose son Ronan Farrow won a Pulitzer for his reporting on Harvey Weinstein's sexual misconduct scandal, hugging the \"DAMN.\" artist and smiling for cameras at a table. Kendrick, 30, follows in the footsteps of artists including Duke Ellington and Bob Dylan with his win. \"It's an honor,\" he later said in a Facebook Live video shared by ET. \"Been writing my whole life, so to get this type of recognition is beautiful.\"\n\nVin Diesel gets an honorary PhD from his would-be alma mater That's Dr. Vin Diesel to you. Three decades after he dropped out of Hunter College in New York City, the school bestowed an honorary Doctor of Humane Letters in English degree upon the \"Fast & Furious\" star this week. According to JustJared, the actor told the graduation audience at Radio City Music Hall in New York City how much his education there meant to him, praising the school for its diversity and assuring 2018 graduates their Hunter experience could help them make a difference going forward. \"While I was in Hollywood I always had this pride of Hunter College. I would tell everybody that I learned and took so much away from my experience at Hunter College. I was young, I was a bouncer, when I wasn't bouncing I was in these classrooms with the most diverse student body on the planet,\" he said, letting his acceptance speech double as a commencement address. \"We're strivers. We can overcome anything. You learn that here and you take into the world. And then you can look at Hollywood and change the face of Hollywood,\" Vin continued. \"You can literally change the face of Hollywood because of that dignity and pride and willingness to fight.\"\n\nOffset buys a car for the man who helped him after his accident When a passerby spotted Migos rapper Offset trapped inside his crumpled car and injured following an accident in Atlanta two weeks ago, he raced over to help. The man, whom Page Six identifies only as Jamar, was walking to work at the time. Once Jamar managed to rescue Offset, he walked the rapper to safety since he reportedly did not own wheels of his own. Now, Jamar's enjoying the karma payback from that good deed. \"THANK YOU [JAMAR] FOR HELPING SAVE MY LIFE,\" Offset posted on social media, sharing a photo of a new-looking Nissan Altima. In another post, he shared a photo of himself with Jamar and the car. \"HE WAS WALKING FROM WORK WHEN HE SEEN ME CLIMBING OUT MY CAR,\" he captioned the shot. \"SO I BOUGHT HIM A CAR.\"\n\nFans spot something fishy about Portia de Rossi's 'Arrested Development' scenes Was there some sort of compromise arrangement between Portia de Rossi and the producers of \"Arrested Development\" that got her back on the show for Season 5 despite her retirement plans? It seems feasible, given the complaints lodged by viewers this week, who called out the show for using \"sloppy editing\" and seemingly using a green screen for many of the scenes in which Portia appeared. \"I'm not sure who did the green screen work for the new series of Arrested Development but I'm assuming it was some sort of dog in a hat,\" griped one user on Twitter (via the Daily Mail). Others pointed to the fact that the storyline had Portia's character, Lindsey, covered by a sheet repeatedly as more potential evidence that the actress didn't shoot her scenes with the rest of the cast. \"Was Portia de Rossi green screened into every scene? Good god I love me some Lindsey but this isn't subtle,\" another Twitter user posted. Portia recently appeared on \"Ellen,\" where she told her wife, Ellen DeGeneres, she'd decided to quit acting but got talked into doing one more season as a Bluth by the show's creator. \"I called Mitch Hurwitz … and I said if there is a Season five, I wont be doing it because I quit acting and he seemed really understanding and he totally got it,' Portia said at the time. \"We had a great conversation and then he wrote me into five episodes.\" RELATED: Long-lasting celebrity couples\n\nIs Shailene Woodley changing her stance on feminism? Four years ago, Shailene Woodley seemed to be using a skewed definition of feminism when she told Time she wasn't a feminist because she loves men and she doesn't think \"[taking] the men away from the power\" was the right approach. She was asked about the controversial quotes in a recent interview about her new film \"Adrift.\" It's unclear whether she now understands that feminism is defined not as the practice of man-hating but as \"the theory of the political, economic, and social equality of the sexes.\" But she does seem to be changing her tune a bit. Asked by Vulture if the quote was taken out of context, Shailene implies that it was. \"And that quote was so long ago,\" she says. \"It was also in a different time of feminism. You know, feminism has had so many forms over its many, many decades of being around. To me, I say today that I resonate as a feminist. But take that word out of it — a word is a word, a movement is a movement — practice and action are what actually makes a difference. So I can call myself a feminist all day long. Or I can say I'm not a feminist all day long. But if my daily interaction with the world is taking steps to uplift, empower — not only women, but also men in their relationships with women, and women and their relationships with men, and women to women, and improving sisterhood with women, and changing our judicial system to reflect that which society is asking for — that, to me, is where my greatest interest lies.\" She adds: \"But for the sake of the movement, and also for my beliefs, I think at this point it is important to use that word as a tool just for means of other people understanding who you are.\" Huh. Vulture seems to read the lengthy and roundabout response as evidence of Shailene having \"taken stock of how her passions have been chopped into sound bites.\" Uh, if that's the case, it worked.\n\nKeegan-Michael Key dishes on his wedding plans with Elisa Pugliese Keegan-Michael Key is about to be off the market for real. Speaking to Us Weekly, the longtime \"Key & Peele\" star recently shared some of the details around plans to marry producer Elisa Pugliese early next month. \"So I'm getting married in nine days in my home. My fiancée is the most wonderful and passionate and sensible woman at the same time,\" he told Us. \"Why would we get married in any place else if we love our home? Let's have a reception upstairs and then we're having a party the next day. A big party. So, very intimate wedding, very big party.\" Keegan-Michael, who was previously married to Cynthia Blaise, and Elisa announced their engagement last fall when the groom-to-be tweeted that he was \"the luckiest man ever\" and gushed: \"She shows me every day that each of us has the ability to help make the world a better place.\" Congrats!", "images": ["https://www.wonderwall.com/wp-content/uploads/sites/2/2018/05/1028978-pjimage-17.jpg?crop=0px,0px,1000px,525px&resize=1200,630", "https://i0.wp.com/www.wonderwall.com/wp-content/uploads/sites/2/2018/05/1028978-pjimage-17.jpg?crop=0px%2C0px%2C1000px%2C525px&resize=1200%2C630&ssl=1", "https://www.wonderwall.com/wp-content/uploads/sites/2/2022/10/brenda-song-son-dakota-culkin.jpg?h=800", "https://www.wonderwall.com/wp-content/uploads/sites/2/2020/04/whalerock-logo.svg", "https://www.wonderwall.com/wp-content/uploads/sites/2/2020/04/ww-logo.svg", "https://www.wonderwall.com/wp-content/themes/wonderwall/assets/images/download.png"], "top_img": "https://www.wonderwall.com/wp-content/uploads/sites/2/2018/05/1028978-pjimage-17.jpg?crop=0px,0px,1000px,525px&resize=1200,630", "keywords": [], "authors": ["Wonderwall.Com Editors"], "canonical_link": "https://www.wonderwall.com/celebrity/justin-theroux-vacations-bff-emma-stone-casually-dating-others-plus-more-news-3014570.gallery", "title": "Justin Theroux hangs with pal Emma Stone, is 'casually dating'", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Justin Theroux hangs with pal Emma Stone, is \"casually\" dating others, plus more celebrity news for May 31, 2018.", "og": {"locale": "en_US", "type": "article", "title": "Justin Theroux hangs with pal Emma Stone, is 'casually dating'", "description": "Justin Theroux hangs with pal Emma Stone, is \"casually\" dating others, plus more celebrity news for May 31, 2018.", "url": "https://www.wonderwall.com/celebrity/justin-theroux-vacations-bff-emma-stone-casually-dating-others-plus-more-news-3014570.gallery", "site_name": "Wonderwall.com", "image": "https://i0.wp.com/www.wonderwall.com/wp-content/uploads/sites/2/2018/05/1028978-pjimage-17.jpg?crop=0px%2C0px%2C1000px%2C525px&resize=1200%2C630&ssl=1"}, "article": {"publisher": "https://facebook.com/Wonderwall", "published_time": "2018-05-31T18:38:00+00:00", "modified_time": "2020-04-26T14:55:10+00:00"}, "twitter": {"card": "summary_large_image", "image": "https://www.wonderwall.com/wp-content/uploads/sites/2/2018/05/1028978-pjimage-17.jpg?crop=0px,0px,1000px,525px&resize=1200,630", "creator": "@Wonderwall", "site": "@Wonderwall", "label1": "Written by", "data1": "Wonderwall.com Editors"}, "generator": "WordPress 6.0.2", "msapplication-TileImage": "https://www.wonderwall.com/wp-content/uploads/sites/2/2020/04/cropped-favicon-96x96-1-192x192-1.png?w=192"}, "movies": [], "publish_date": 1527791880.0, "source": "https://www.wonderwall.com", "summary": ""}