{"url": "https://popculture.com/reality-tv/2018/05/22/kim-zolciak-biermann-rings-in-her-40th-birthday-in-a-thong-bikini/", "text": "Kim Zolciak-Biermann is showing off her curves on her 40th birthday. The Real Housewives of Atlanta cast member took to Instagram during a \"short getaway\" to the beach to flaunt her toned body.\n\nIn a photo taken by her husband, NFL free agent Kroy Biermenn, Zolciak-Biermann poses in a thong bikini, standing with her feet in the calm waters. In the foreground, a shirtless Biermann gives the camera a smug smile.\n\nHer fans drooled over the photo in the comments section.\n\n\"Whatever you doing looks fabulous, and most of all it seems like the man you love, loves every second of it,\" someone wrote.\n\n\"Power couple,\" another gushed.\n\n\"Yasssss look at that booty!!!\" someone else wrote.\n\nBut some of Zolciak-Biermann's followers criticized the photo after Zolciak responded to a fan who asks how she gets a booty like that, with Zolciak-Biermann saying she \"runs 5 days a week.\" Some wondered if instead she has had plastic surgery to thank for her curves.\n\n\"You run 5 days a week to your surgeon?\" someone wrote.\n\n\"Why are y'all acting like Kim didnt pay for that booty???!!! That's the answer! She's paid to 'adjust' most of her body parts, so stop acting like it's all natural!\" someone else said.\n\n\"Wonder what you'd look like if you aged naturally without the surgeries,\" one person asked. \"Still gorgeous though.\"\n\nBut some defended the mom of six and said she should be able to go under the knife if she so chooses.\n\n\"Bought booty or not she still looks freaking amazing! She carried how many children!? She deserves a little nip and tuck! Haters!\" one person said.\n\nZolciak-Biermann is no stranger to controversy; the 40-year-old spent much of this season of Real Housewives of Atlanta embroiled in an ongoing feud with fellow cast member NeNe Leakes, who called her \"racist.\" Zolciak-Biermann said earlier in the season that Leakes was \"sick and disgusting\" for living in a \"roach nest.\" This term, many of the women told Zolciak-Biermann at the RHOA reunion in April, appears to be racist for its cultural implications of impoverished black women living in the projects.\n\n\"You're reaching. Reaching,\" Zolciak-Biermann said in her defense. \"Don't try it. It has nothing to do with the projects or none of that s—. A roach is a roach.\"\n\nShe claimed during the reunion episode that racism \"wasn't f— all that real\" — and then apologized after the episode aired for her words that she said were taken out of context.\n\nShe said: \"Racism is a sad reality in the United States. It has been prevalent throughout our country's history. Let me be very clear, I do NOT support, tolerate or put up with any form of racism, hate or other discrimination. My love for ALL people runs deep - I am open to all and always have been.\"\n\nShe claimed that her remarks were part of a longer conversation with host Andy Cohen that didn't make the show.\n\n\"I was heartbroken when I watched the last few minutes of the episode and saw how my words were taken out of context. My comment that seemingly 'racism didn't exist 10 years ago' was made as part of a larger, emotional 45-minute conversation about how, sadly, social media has become a hub for hate. Immediately following my confusing comment, I also said that 'it's not as real as it is now' referring to the power of social media. But those remarks didn't make the show.\"\n\nBut fans in the comment section didn't take her lengthy statement well, accusing her of a non-apology.\n\n\"Racism is real for us everyday,\" one user wrote. \"The threat is real for people of color. For you a white person to seemingly dismiss that threat, given the history of your people especially, it's beyond frustrating.\"\n\n\"Sounds like she's saying when racism was hidden then it didn't exist,\" another added. \"Lol girl go kick rocks.\"", "images": ["https://media.popculture.com/2018/05/kim-zolciak-biermann-kroy-biermann-20035700.jpeg", "https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200"], "top_img": "https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/reality-tv/news/kim-zolciak-biermann-rings-in-her-40th-birthday-in-a-thong-bikini/", "title": "Kim Zolciak Biermann Rings in Her 40th Birthday in a Thong Bikini", "meta_data": {"description": "Kim Zolciak-Biermann is showing off her curves on her 40th birthday. The Real Housewives of [...]", "keywords": "Instagram,The Real Housewives of Atlanta,Kim Zolciak-Biermann", "news_keywords": "Instagram,The Real Housewives of Atlanta,Kim Zolciak-Biermann", "robots": "index, follow, max-image-preview:large", "twitter": {"card": "summary_large_image", "site": "PopCulture", "creator": "PopCulture", "title": "Kim Zolciak Biermann Rings in Her 40th Birthday in a Thong Bikini", "description": "Kim Zolciak-Biermann is showing off her curves on her 40th birthday. The Real Housewives of [...]", "image": "https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200"}, "og": {"title": "Kim Zolciak Biermann Rings in Her 40th Birthday in a Thong Bikini", "type": "article", "url": "https://popculture.com/reality-tv/news/kim-zolciak-biermann-rings-in-her-40th-birthday-in-a-thong-bikini/", "image": {"identifier": "https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200", "width": 640, "height": 320}, "site_name": "Reality TV", "description": "Kim Zolciak-Biermann is showing off her curves on her 40th birthday. The Real Housewives of [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#263240", "apple-mobile-web-app-capable": "yes"}, "movies": [], "publish_date": 1526943600.0, "source": "https://popculture.com", "summary": ""}