{"url": "http://liverampup.com/entertainment/william-levy-wife-gay-married.html", "text": "Mexican telenovela actor, William Levy is a family man with a longtime girlfriend and kids...Often seen as an inspiration for fathers and lovers, the Cuidado con el angel star has a dark history of disloyalty towards his partner...William, who cheated on his wife-like partner multiple times has now repented on his previous acts but still can't make a lifetime commitment to his lover...With fans questioning his sexuality, William knows exactly how to shut down the haters who accuse him of being gay.\n\nMexican telenovela actor William Levy leads a fascinating family life with his longtime girlfriend and kids. Still, despite being seen as an inspiration for fathers and lovers, the Cuidado con el angel star has his own dark history.\n\nWilliam previously cheated on his wife-like partner multiple times and currently repents on his previous acts, but he still seems unable to make a lifetime commitment to his lover.\n\nCheated On Longtime Girlfriend; Secretly Dating Mexican Actresses\n\nWilliam's relationship with his model-girlfriend, Elizabeth Gutiérrez, goes way back to 2003. Crossing more than a decade together, the couple is currently the parents to two adorable kids; a son named Christoper and a daughter, Kailey.\n\nYou May Also Like:- Cree Summer Gushes Over Keeper Husband - Kids Are Add-Ons To Happiness\n\nConsidering their longtime dating, William and his wife-like-girlfriend are content with their relationship and children; however, this has not always been the case since William allegedly cheated on his girlfriend multiple times.\n\nWilliam, along with partner Elizabeth and children, Christopher and Kailey in May 2018 (Photo: William Levy's Instagram)\n\nIn September 2014 when Ximena Navarrete, William's co-star from the Mexican telenovela La Tempestad, revealed that the two were secretly dating.\n\nXimena reportedly confessed her relationship to some of her closest friends and mentioned that she was madly in love with William. The revelation followed the rumors of the Mexican actor cheating on his longtime partner that initiated after the photos of him and Ximena hanging out in a Miami hotel surfaced in the media.\n\nFollowing the incident, Elizabeth broke up with her boyfriend in December 2014.\n\nAlthough the pair didn't reveal the reason for their split, it was apparent that the trigger was William's adultery. The couple eventually got back together and resumed their romance until 2017, when another incident of William's past infidelity was disclosed.\n\nBut that was hardly the end of William's cheating incident!\n\nEarlier in 2017, Mexican actress Jacqueline Bracamonte revealed that she had an affair with William after they starred together in a soap opera in 2009. She mentioned that William had lied to her about breaking up with Elizabeth and said that he was single at the time.\n\nJacqueline added that once she found out that her partner was in a relationship and had even fathered a child, she immediately broke up with him.\n\nEven though Elizabeth was shocked by her boyfriend's infidelity, she didn't break up with him as it was a thing of the past, and William had vowed never to commit these transgressions again.\n\nAfter that, William shared a loving relationship with Elizabeth, but the two have not mentioned their intention of getting married. Although he proposed to her several years before in 2013 on Christmas Eve, the pair has not talked about their plans to getting married.\n\nThis has left many wondering if William ever intends to make Elizabeth his wife. With some even accusing him of secretly being gay due to his lack of commitment.\n\nFamily Of Four\n\nWilliam is a family man who plans different activities together. In August 2017, William's children and partner showed their unconditional love for him when they prepared a surprise birthday party for William. Similarly, William also adores his kids and has flaunted his love for them through social media on several occasions.\n\nHis first-born, Christopher, is a prolific baseball player and may even take up a career in the sport.\n\nOn 8 October 2020, William shared an Instagram post calling his son Christopher a leader, who also won a baseball championship while playing for local team Clutch Miami.\n\n15-year-old Christopher had an accident in Weston on 4th October 2020, flipping over an electric golf cart and getting pinned underneath. William, while posting a lovely photograph with his son post the accident, captioned the picture.\n\n“Christopher is a child of Faith. We know that God was there with him and the other children and we have nothing but words of gratitude to God who never fails us !!”\n\nSimilarly, William's daughter, Kailey, is the apple of his eye, whom he considers to be his everything. On 6 March 2018, he posted a picture of his youngest kid and wished Kailey for her birthday.\n\nWilliam Levy's daughter Kailey in 2018 (Photo: William Levy's Instagram)\n\nAnd on 10 March 2020, William shared his daughter Kailey’s photograph wishing her Happy Birthday.\n\nA deep look at his Instagram profile suggests that he has a deep love for his children and he William doesn't shy away from flaunting his love for his children.\n\nAre William Levy & Elizabeth Gutiérrez Still Together?\n\nIt's been a while since the couple hasn't made it to the social networks which have raised questions about their relationship.\n\nIt seems like since April 2019, when the actor celebrated his birthday, the Levy family has not shared any family pictures showing love and happiness.\n\nAdding more to it, William received wishes from his two children on the occasion of Father's Day, but his partner was nowhere to be seen.\n\nCompared to the previous years, when she never forgot to share her wishes for him, this time she was out of reactions. This raised speculations on their relationship.\n\nMoreover, both this couple has stopped sharing pictures of each other on their respective social media accounts. Since 2019, they are nowhere to be seen on each other's Instagram handle. As of now, their Instagram is filled with pictures of themselves and their children.\n\nChances are high that the couple might have gone separate ways but who knows what the couple has decided. Maybe they have taken a break for a while to understand their relationship better.\n\nWell, either William or Elizabeth could clear this confusion out. Till then, we hope the couple is still together.\n\nOpen For Gay Roles; Gay In Real Life?\n\nWilliam, who is often called the \"Cuban Brad Pitt,\" revealed in a 2014 interview with Fox News Latino that he had grown tired of being portrayed as the muscular hunk and wanted to do some serious acting.\n\nHe even mentioned that he was open to playing gay roles if the character was profound and inspirational. When asked if he would perform as a gay man in a movie, William answered,\n\n\"I'll have to see. I'm not against that — not at all. But, it'll ultimately be up to the script and whether the character shows a depth of emotion and is inspirational.\"\n\nHowever, this doesn't mean that he is gay in real life. It would be absurd even to think that the who cheated on his partner with multiple women would be secretly a gay man hiding in the closet.", "images": ["http://liverampup.com/uploads/celebrity/william-levy-girlfriend-children.JPG", "http://liverampup.com/uploads/celebrity/william-levy-daughter-kailey.JPG", "https://liverampup.com/userfiles/images/lru/favicon.png", "https://images.dmca.com/Badges/dmca_protected_sml_120f.png", "https://liverampup.com/uploads/celebrity/william-levy-wife.jpg", "https://liverampup.com/userfiles/images/lru/logowhite.png", "https://liverampup.com/userfiles/images/lru/logo.png"], "top_img": "https://liverampup.com/uploads/celebrity/william-levy-wife.jpg", "keywords": [], "authors": [], "canonical_link": "https://liverampup.com/entertainment/william-levy-wife-gay-married.html", "title": "William Levy Allegedly Cheated On Wife-Like Girlfriend; Gay Rumors True?", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "twitter": {"site": "LIVERAMPUP", "creator": "@LIVERAMPUP", "title": "William Levy Allegedly Cheated On Wife-Like Girlfriend; Gay Rumors True?", "description": "Know All About William Levy's Allegedly Cheating Incident On Wife-Like Girlfriend. Learn About His Dating History And Whether His Gay Rumors Are True?", "image": "https://liverampup.com/uploads/celebrity/william-levy-wife.jpg"}, "og": {"site_name": "LIVERAMPUP", "type": "blog", "locale": "en_US", "title": "William Levy Allegedly Cheated On Wife-Like Girlfriend; Gay Rumors True?", "url": "https://liverampup.com/entertainment/william-levy-wife-gay-married.html", "description": "Know All About William Levy's Allegedly Cheating Incident On Wife-Like Girlfriend. Learn About His Dating History And Whether His Gay Rumors Are True?", "image": {"identifier": "https://liverampup.com/uploads/celebrity/william-levy-wife.jpg", "secure_url": "https://liverampup.com/uploads/celebrity/william-levy-wife.jpg"}}, "google-site-verification": "SJfUZ8auQJW9fK2EuDQ6SiLGX3vk2ujMkcPkCxsxcRE", "robots": "all", "syndication-source": "https://liverampup.com", "fb": {"app_id": 154965615127429, "admins": "liverampup"}, "p": {"domain_verify": "a4bb87e3ebd48c10b9a45c64b7976bc3"}, "description": "Know All About William Levy's Allegedly Cheating Incident On Wife-Like Girlfriend. Learn About His Dating History And Whether His Gay Rumors Are True?"}, "movies": [], "publish_date": 1614272898.0, "source": "http://liverampup.com", "summary": ""}