{"url": "https://www.newyorker.com/culture/culture-desk/tina-feys-mean-girls-is-now-a-fetch-broadway-musical", "text": "Girl culture didn’t exactly have a banner year in 2004. Britney Spears, the era’s reigning queen of pop, married Kevin Federline. (It was her second wedding that year.) Paris Hilton gallivanted with Nicole Richie on “The Simple Life.” Barbie came out with a Juicy Couture line, or vice versa. And the Simpson sisters, Ashlee and Jessica, faced the respective indignities of being caught lip-synching on “Saturday Night Live” and endorsing George W. Bush for reëlection. With these spray-tanned glamazons dominating the land, it’s no wonder that a character like Regina George sprang from the mind of Tina Fey, whose screenplay for “Mean Girls” gave 2004 something to crow about: a witty and withering comedy for the ages.\n\nInspired by Rosalind Wiseman’s nonfiction book “Queen Bees and Wannabes,” “Mean Girls” told the Faustian tale of Cady (Lindsay Lohan, truly great), a homeschooled math whiz who relocates from Africa to Illinois, where she must navigate the wilds of an American high school. At first, she falls in with a jaded, alt girl-boy duo, who persuade her to infiltrate the Plastics: a cabal of popular girls ruled by the glossy tyrant Regina (Rachel McAdams, also brilliant), whose first name gives away her unimpeachable stature. Only too late does Cady realize that she’s adopted the catty behavior she was sent to undermine. Trained in the ways of the jungle, she sees girl world as a lion’s den like any other, and it’s up to the school’s beleaguered math teacher—played by Fey—to set things right. As in “All About Eve” (1950), the urtext of cinematic female backbiting, our heroines get beaten up but turn out the wiser for it, just as a newer model arrives to take their place.\n\n“Mean Girls” is now a Broadway musical, at the August Wilson Theatre, with an updated script by Fey and music by her husband, Jeff Richmond. (The lyrics are by Nell Benjamin.) The show’s awareness of the ways in which teen life has changed since 2004 is evident from the preshow announcement, which asks us to turn off our phones, because “Instagram is a thirst trap and Snapchat is over.” In 2004, Snapchat wasn’t even a glimmer in a programmer’s eye, and TheFacebook.com was newly hatched. Thankfully, the musical doesn’t overload the story with social-media references, but there are a couple of well-placed additions. Now when Regina humiliates herself at the Christmas talent show, Twitter erupts with GIFs of her derrière, and her subsequent run-in with a bus also goes viral. The script accounts for a few other post-Bush-era novelties, among them the poop emoji, the Left Shark meme, and “basic AF.” In the taxonomy of cafeteria cliques, Fey has wisely traded “Unfriendly Black Hotties” for “Woke Seniors.”\n\nSadly, we don’t hear much from the Woke Seniors, who these days would be taking their cues not from Paris Hilton but from Emma González. There are a few pointed suggestions of the resurgent feminism of 2018, and only one mention of the Mean Boy in the White House, who we’re told has blocked Regina on Twitter. Who can blame him? As played by Taylor Louderman, she’s a fearsome presence. In her first number, she barely needs to open her mouth to be heard—the Broadway-belting equivalent of vocal fry—as a teen chorus hoists her up to the lunch table. Cady (Erika Henningsen) quickly identifies her as the “apex predator” and joins her coterie, which includes the insecure Gretchen (Ashley Park) and the bubble-headed Karen (Kate Rockwell, an absolute scene-stealer). The cast is all-around good, but special credit goes to Kerry Butler, who does triple duty in the adult roles originally played by Fey, Ana Gasteyer, and Amy Poehler. Also convincing are the “art freaks,” Janis (Barrett Wilbert Weed) and the “too gay to function” Damian (Grey Henson), who in Fey’s rewrite function as narrators. Damian tap-dances with abandon, while Janis is unflappably deadpan, which is exactly how this pair would respond to being in a Broadway musical—unlike Regina, who would roll her eyes if she only knew.\n\n“Mean Girls” is far from the only film comedy from the aughts to reach Broadway—we’ve had “Legally Blonde,” “School of Rock,” “Bring It On,” and “Elf,” to name a few—but it’s one of the sturdiest. Fey’s screenplay is so taut and quotable that the addition of songs seems almost gratuitous, and Richmond’s music has the interchangeable pop-anthem sound that’s become standard on Broadway. But who needs Tina Fey to reinvent musical comedy? She does just fine with the help of Casey Nicholaw, the director and choreographer, previously responsible for “The Book of Mormon.” In moments of pure fan service, we get the one-liners we’ve been waiting for, like “On Wednesdays, we wear pink”—sung twice, for good measure. Members of the audience, some of whom were barely sentient when Amanda Seyfried first uttered the line, lap it up.\n\nIf “Mean Girls” has anything new to tell us, fourteen years after its original iteration, it’s that meanness can be just as morally ambiguous as niceness. Fey has added a poignant scene, late in Act II. Regina, now in a spinal halo, meets Cady, now contrite, in the bathroom at the Spring Fling. “I know I was harsh,” Regina says. “And people say I’m a bitch. But you know what they would call me if I was a boy?” “Strong?” Cady guesses. “Reginald,” Regina answers. During this moment of sisterhood, I thought about another teen hero on Broadway, the titular geek of “Dear Evan Hansen.” Like Cady, he’s a social underdog who uses fraud to work his way to the top, only to learn a valuable lesson about authenticity. Both are awkward outsiders who become complicit in the pursuit of status—appropriate for an era in which the alpha blonde is no longer Britney Spears but Ivanka Trump. As for Fey, I suspect that there’s a little bit of both Cady and Regina in her—on “30 Rock,” she managed to play the hapless heroine while literally running the show. And why not? She’s the boss. After all, sometimes a Mean Girl is just a Nasty Woman in training.", "images": ["https://media.newyorker.com/photos/59095b2b6552fa0be682d8c7/1:1/w_270%2Cc_limit/schulman.png", "https://dwgyu36up6iuz.cloudfront.net/heru80fdn/image/upload/c_fill%2Cd_placeholder_thescene.jpg%2Cfl_progressive%2Cg_center%2Ch_360%2Cq_80%2Cw_480/v1519330810/thenewyorker_teens-lead-fight-for-gun-reform.jpg", "https://media.newyorker.com/photos/5ab421560a0c3835c789a75c/4:3/w_480%2Cc_limit/Tolentino-Teen-Boss-Magazine.jpg", "https://media.newyorker.com/photos/5ac794b31018e26bd33e48c4/16:9/w_1280,c_limit/Schulman-Mean-Girls-Musical.jpg", "https://www.newyorker.com/verso/static/the-new-yorker/assets/logo.f1893bac6dafe13d6d5bad671a5bee2345efa44d.svg", "https://media.newyorker.com/photos/5ac794b31018e26bd33e48c4/master/w_2560%2Cc_limit/Schulman-Mean-Girls-Musical.jpg", "https://media.newyorker.com/photos/631a4a96e5204f6cca594df5/4:3/w_480%2Cc_limit/undefined", "https://www.newyorker.com/verso/static/the-new-yorker/assets/logo-reverse.f915b516b6ca9c0c2a9bdf9b749519365b2b2e4a.svg", "https://media.newyorker.com/photos/5a90489568dffb7f58f4f091/4:3/w_480%2Cc_limit/Schulman-The-Spring-Awakening-of-the-Stoneman-Douglas-Theatre-Kids.jpg", "https://www.newyorker.com/verso/static/the-new-yorker/assets/logo-header.6e34c81346bc43475ffd572e6c2eb3e125927148.svg"], "top_img": "https://media.newyorker.com/photos/5ac794b31018e26bd33e48c4/16:9/w_1280,c_limit/Schulman-Mean-Girls-Musical.jpg", "keywords": [], "authors": ["Condé Nast", "Michael Schulman"], "canonical_link": "https://www.newyorker.com/culture/culture-desk/tina-feys-mean-girls-is-now-a-fetch-broadway-musical", "title": "Tina Fey’s “Mean Girls” Is Now a Fetch Broadway Musical", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "width=device-width, initial-scale=1", "referrer": "no-referrer-when-downgrade", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2022", "description": "Michael Schulman writes about Tina Fey's \"Mean Girls,\" now a musical on Broadway.", "id": "5ac78d833ceaa266c39ee9c5", "keywords": "broadway musicals,mean girls,teen-agers", "news_keywords": "broadway musicals,mean girls,teen-agers", "robots": "index, follow, max-image-preview:large", "content-type": "article", "parsely-post-id": "5ac78d833ceaa266c39ee9c5", "parsely-metadata": "{\"description\":\"Michael Schulman writes about Tina Fey's \\\"Mean Girls,\\\" now a musical on Broadway.\",\"image-16-9\":\"https://media.newyorker.com/photos/5ac794b31018e26bd33e48c4/16:9/w_1000,c_limit/Schulman-Mean-Girls-Musical.jpg\",\"image-1-1\":\"https://media.newyorker.com/photos/5ac794b31018e26bd33e48c4/1:1/w_1000,c_limit/Schulman-Mean-Girls-Musical.jpg\"}", "og": {"description": "The beloved teen movie has made its way to the New York stage, teaching us that meanness can be just as morally ambiguous as niceness.", "image": "https://media.newyorker.com/photos/5ac794b31018e26bd33e48c4/16:9/w_1280,c_limit/Schulman-Mean-Girls-Musical.jpg", "site_name": "The New Yorker", "title": "Tina Fey’s “Mean Girls” Is Now a Fetch Broadway Musical", "type": "article", "url": "https://www.newyorker.com/culture/culture-desk/tina-feys-mean-girls-is-now-a-fetch-broadway-musical"}, "article": {"content_tier": "metered", "opinion": "false", "section": "tags", "published_time": "2018-04-09T02:00:00.000Z", "modified_time": "2018-04-09T02:00:00.000Z", "author": "Michael Schulman"}, "twitter": {"card": "summary_large_image", "creator": "@NewYorker", "description": "The beloved teen movie has made its way to the New York stage, teaching us that meanness can be just as morally ambiguous as niceness.", "domain": "https://www.newyorker.com", "image": "https://media.newyorker.com/photos/5ac794b31018e26bd33e48c4/16:9/w_1280,c_limit/Schulman-Mean-Girls-Musical.jpg?mbid=social_retweet", "site": "@NewYorker", "title": "Tina Fey’s “Mean Girls” Is Now a Fetch Broadway Musical"}, "fb": {"app_id": 1147169538698836, "pages": 9258148868}, "google-signin-client_id": "275906274807-b4eqbdqr511u9msdpj8mh0pf77fcciv7.apps.googleusercontent.com"}, "movies": [], "publish_date": 1523239200.0, "source": "https://www.newyorker.com", "summary": ""}