{"url": "https://www.hollywoodreporter.com/news/what-demi-lovato-has-said-addiction-mental-health-1129746", "text": "Demi Lovato was hospitalized for an apparent drug overdose on Tuesday. Hours later, the pop star’s representative confirmed to The Hollywood Reporter that she was “awake and with her family” following the health scare.\n\n“Demi is awake and with her family, who want to express thanks to everyone for the love, prayers and support,” the statement read. “Some of the information being reported is incorrect, and they respectfully ask for privacy and not speculation, as her health and recovery is the most important thing right now.”\n\nLos Angeles police said, earlier on Tuesday, that they responded to a call at 11:39 a.m. to a home on the 8000 block of Laurel View Drive in the Hollywood Hills, where Lovato lives, for a female victim of a possible overdose. The 25-year-old was reportedly administered Narcan, which is used to treat narcotic overdoses in emergency situations.\n\nThe incident occurred just weeks after the former Disney Channel star and reformed addict wrote about breaking her sobriety in her latest track, “Sober.” In the song, Lovato details her experience with withdrawals and the emotional aftermath of a relapse. The singer had been sober for six years.\n\n“Momma, I’m so sorry, I’m not sober anymore/ And daddy, please forgive me for the drinks spilled on the floor,” she sings. “To the ones who never left me/ We’ve been down this road before/ I’m so sorry, I’m not sober anymore.”\n\nLovato posted a video of an early performance of the song on Twitter with the message, “Tonight I took the stage, a new person with a new life. Thank you to everyone who has supported me throughout this journey. It will never be forgotten.”\n\nShe most recently performed the song live at the California Mid-State Fair in Paso Robles on July 22. Lovato reportedly got emotional onstage and forgot some of the lyrics at the end of the song. “Fuck, I forgot the words,” Lovato said before walking offstage, an eyewitness recalled to Us Weekly, adding that the entertainer also “had tears in her eyes.”\n\nYears before the release of “Sober,” Lovato — who first checked in to rehab at the age of 18 in 2010 and then entered a sober house for approximately a year in 2013 — had been open about facing her demons. In 2011, Lovato was diagnosed with bipolar disorder after years of struggling with an eating disorder and self harm, in addition to her drug addiction.\n\nDuring a 2013 interview with Access Hollywood, Lovato revealed the moment of reckoning she had at age 19. “I was going to the airport and I had a Sprite bottle just filled with vodka, and it was just 9 in the morning. And I was throwing up in the car, and this was just to get on a plane to go back to L.A. to the sober living house that I was staying at,” she recounted. “I had all the help in the world, but I didn’t want it.”\n\nIn 2015, Lovato — who co-owns the L.A. treatment facility CAST Centers — explained to Women’s Health why she decided to speak openly about her experience in rehab and become a mental health advocate. According to the Camp Rock actress, she had hoped her honesty would help others going through similar situations.\n\n“I remember sitting with my manager and my family and talking to them about whether or not to speak out about the issues that I was dealing with,” she said about using her platform to raise awareness. “I knew that there were two options: I could either not talk about my stint in rehab and hope that it went away, or I could talk about it and inspire people to get help for their issues, as well, so that’s exactly what I did.”\n\nShe also discussed her diagnosis and the work she has put in to maintain a healthy mind: “For years, people said I was depressed, and I actually didn’t know myself why I was so upset and why I would have these episodes of mania — what I now know is mania.”\n\nWhile appearing on the U.K.’s The Jonathan Ross Show in 2017, the “Sorry Not Sorry” singer said that her parents’ tough love had helped her stay on track in recent years. “I knew that I had a lot of life ahead of me, but one of the main reasons of getting sober was so that I could be around my little sister because my mom and dad [said I couldn’t be around her] if I was doing stuff,” she said, adding that she was also thankful for the support from her fans and inner circle.\n\n“I had family and really close friends and my manager — they all were by my side through everything,” Lovato continued. “I wouldn’t be here without them. My fans too. I feel they gave me a reason to live and I’m forever grateful.”\n\nLast year, the Grammy nominee was the recipient of the Spirit of Sobriety Award at the annual Brent Shapiro Foundation for Drug Prevention Summer Spectacular. In her acceptance speech, Lovato admitted that “every day is a battle.”\n\n“You just have to take it one day at a time; some days are easier than others and some days you forget about drinking and using, but for me, I work on my physical health, which is important, but my mental health as well,” she said. “I make sure I stay on my medications. I go to AA meetings. I do what I can physically in the gym. I make it a priority.”\n\nIn her 2017 documentary, Simply Complicated, Lovato offered insight into her initial attraction to drugs and alcohol. “I felt out of control the first time I did it,” she said. “My dad was an addict and an alcoholic. Guess I always searched for what he found in drugs and alcohol, because it fulfilled him, and he chose that over a family.”\n\nElsewhere in the film, Lovato said that she “wasn’t ready to get sober” during her first rehab stint as a teen: “I was sneaking it on planes, sneaking it in bathrooms, sneaking it throughout the night.”\n\nIn the wake of her apparent overdose on Tuesday, a multitude of stars — including Lady Gaga, Ellen DeGeneres and Ariana Grande — have taken to Twitter to express their well wishes for Lovato and have urged the public to be kind as she recovers.\n\n“We should all wrap our arms of love around Demi Lovato. I am so happy you’re alive. Thank God,” wrote Gaga. “If I know my monsters as well as I believe I do, we all wish you self-compassion and inner peace. And may you receive the love so many have for you. #ImConfidentinDemi Demi, I love you.”", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/07/f1469ec1-ab14-4a3e-add5-fd79f09c860a.png?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/07/f1469ec1-ab14-4a3e-add5-fd79f09c860a.png?w=1024", "keywords": [], "authors": ["Evan Real"], "canonical_link": "https://www.hollywoodreporter.com/news/general-news/what-demi-lovato-has-said-addiction-mental-health-1129746/", "title": "Demi Lovato Has Been Open About Her Sobriety, Mental Health", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Demi Lovato's hospitalization for an apparent drug overdose follows years of the singer being candid about her struggle with sobriety and mental health, including in her new single, \"Sober.\"", "news_keywords": "demi lovato", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Evan Real", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1129746, "title": "Demi Lovato Has Been Open About Her Sobriety, Mental Health", "published_at": "2018-07-25 10:07:41", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/07/f1469ec1-ab14-4a3e-add5-fd79f09c860a.png?w=1024", "comment_count": 0, "tags": "demi lovato", "topics": "News", "body": "Demi Lovato was hospitalized for an apparent drug overdose on Tuesday. Hours later, the pop star's representative confirmed to The Hollywood Reporter that she was \"awake and with her family\" following the health scare.\r\n\"Demi is awake and with her family, who want to express thanks to everyone for the love, prayers and support,\" the statement read. \"Some of the information being reported is incorrect, and they respectfully ask for privacy and not speculation, as her health and recovery is the most important thing right now.\"\r\nLos Angeles police said, earlier on Tuesday, that they responded to a call at 11:39 a.m. to a home on the 8000 block of Laurel View Drive in the Hollywood Hills, where Lovato lives, for a female victim of a possible overdose. The 25-year-old was reportedly administered Narcan, which is used to treat narcotic overdoses in emergency situations.\r\nThe incident occurred just weeks after the former Disney Channel star and reformed addict wrote about breaking her sobriety in her latest track, \"Sober.\" In the song, Lovato details her experience with withdrawals and the emotional aftermath of a relapse. The singer had been sober for six years.\r\n\"Momma, I'm so sorry, I'm not sober anymore/ And daddy, please forgive me for the drinks spilled on the floor,\" she sings. \"To the ones who never left me/ We've been down this road before/ I'm so sorry, I'm not sober anymore.\"\r\nLovato posted a video of an early performance of the song on Twitter with the message, \"Tonight I took the stage, a new person with a new life. Thank you to everyone who has supported me throughout this journey. It will never be forgotten.\"\r\nShe most recently performed the song live at the California Mid-State Fair in Paso Robles on July 22. Lovato reportedly got emotional onstage and forgot some of the lyrics at the end of the song. \"Fuck, I forgot the words,\" Lovato said before walking offstage, an eyewitness recalled to Us Weekly, adding that the entertainer also \"had tears in her eyes.\"\r\n\r\nYears before the release of \"Sober,\" Lovato — who first checked in to rehab at the age of 18 in 2010 and then entered a sober house for approximately a year in 2013 — had been open about facing her demons. In 2011, Lovato was diagnosed with bipolar disorder after years of struggling with an eating disorder and self harm, in addition to her drug addiction. \r\nDuring a 2013 interview with Access Hollywood, Lovato revealed the moment of reckoning she had at age 19. \"I was going to the airport and I had a Sprite bottle just filled with vodka, and it was just 9 in the morning. And I was throwing up in the car, and this was just to get on a plane to go back to L.A. to the sober living house that I was staying at,\" she recounted. \"I had all the help in the world, but I didn't want it.\"\r\nIn 2015, Lovato — who co-owns the L.A. treatment facility CAST Centers — explained to Women's Health why she decided to speak openly about her experience in rehab and become a mental health advocate. According to the Camp Rock actress, she had hoped her honesty would help others going through similar situations.\r\n\"I remember sitting with my manager and my family and talking to them about whether or not to speak out about the issues that I was dealing with,\" she said about using her platform to raise awareness. \"I knew that there were two options: I could either not talk about my stint in rehab and hope that it went away, or I could talk about it and inspire people to get help for their issues, as well, so that's exactly what I did.\"\r\nShe also discussed her diagnosis and the work she has put in to maintain a healthy mind: \"For years, people said I was depressed, and I actually didn't know myself why I was so upset and why I would have these episodes of mania — what I now know is mania.\"\r\n\r\nWhile appearing on the U.K.'s The Jonathan Ross Show in 2017, the \"Sorry Not Sorry\" singer said that her parents' tough love had helped her stay on track in recent years. \"I knew that I had a lot of life ahead of me, but one of the main reasons of getting sober was so that I could be around my little sister because my mom and dad [said I couldn't be around her] if I was doing stuff,\" she said, adding that she was also thankful for the support from her fans and inner circle.\r\n\"I had family and really close friends and my manager — they all were by my side through everything,\" Lovato continued. \"I wouldn't be here without them. My fans too. I feel they gave me a reason to live and I'm forever grateful.\"\r\nLast year, the Grammy nominee was the recipient of the Spirit of Sobriety Award at the annual Brent Shapiro Foundation for Drug Prevention Summer Spectacular. In her acceptance speech, Lovato admitted that \"every day is a battle.\"\r\n\"You just have to take it one day at a time; some days are easier than others and some days you forget about drinking and using, but for me, I work on my physical health, which is important, but my mental health as well,\" she said. \"I make sure I stay on my medications. I go to AA meetings. I do what I can physically in the gym. I make it a priority.\"\r\nIn her 2017 documentary, Simply Complicated, Lovato offered insight into her initial attraction to drugs and alcohol. \"I felt out of control the first time I did it,\" she said. \"My dad was an addict and an alcoholic. Guess I always searched for what he found in drugs and alcohol, because it fulfilled him, and he chose that over a family.\"\r\nElsewhere in the film, Lovato said that she \"wasn't ready to get sober\" during her first rehab stint as a teen: \"I was sneaking it on planes, sneaking it in bathrooms, sneaking it throughout the night.\"\r\nIn the wake of her apparent overdose on Tuesday, a multitude of stars — including Lady Gaga, Ellen DeGeneres and Ariana Grande — have taken to Twitter to express their well wishes for Lovato and have urged the public to be kind as she recovers.\r\n\"We should all wrap our arms of love around Demi Lovato. I am so happy you're alive. Thank God,\" wrote Gaga. \"If I know my monsters as well as I believe I do, we all wish you self-compassion and inner peace. And may you receive the love so many have for you. #ImConfidentinDemi Demi, I love you.\"", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Demi Lovato Has Been Open About Her Sobriety, Mental Health", "url": "https://www.hollywoodreporter.com/news/general-news/what-demi-lovato-has-said-addiction-mental-health-1129746/", "description": "Demi Lovato’s hospitalization for an apparent drug overdose follows years of the singer being candid about her struggle with sobriety and mental health, including in her new single, “So…", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/07/f1469ec1-ab14-4a3e-add5-fd79f09c860a.png?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2018-07-25T10:07:41+00:00", "modified_time": "2018-07-26T09:59:32+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Demi Lovato Has Been Open About Her Sobriety, Mental Health", "description": "Demi Lovato’s hospitalization for an apparent drug overdose follows years of the singer being candid about her struggle with sobriety and mental health, including in her new single, “So…", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/07/f1469ec1-ab14-4a3e-add5-fd79f09c860a.png?w=1920"}}, "movies": [], "publish_date": 1532513261.0, "source": "https://www.hollywoodreporter.com", "summary": ""}