{"url": "https://www.indiewire.com/2017/09/this-is-us-season-2-review-premiere-episode-a-fathers-advice-recap-spoilers-1201880543/", "text": "The Big Three turned 37 and a major piece fell into place regarding Jack’s death, but the Season 2 premiere succeeded because it didn’t try to recreate the past.\n\n[Editor’s Note: The following review contains spoilers for the “This Is Us” Season 2 premiere, Episode 1, “My Father’s Advice.”]\n\nWhen “This Is Us” premiered, it not only took the nation by storm, but quickly established a reputation for being a twist-driven family drama. The pilot pulled off a major last-second reveal — that Randall (Sterling K. Brown), Kate (Chrissy Metz), and Kevin (Justin Hartley) were all children of Jack (Milo Ventimiglia) and Rebecca (Mandy Moore) — and permanently hooked an audience who was already wooed by the emotional melodrama driving each individual story. With each new episode came the expectation for another twist, another secret, another layer to be revealed.\n\nBut as the season progressed, that expectation grew tiring. The characters were so full of life, the plots didn’t need to depend on any flashback reveals or present-day shocks. The best episodes played out naturally, like “Memphis,” when Randall’s biological father passed away during a road trip to his hometown. Viewers came to understand William’s (Ron Cephas Jones, who made a nice cameo in the Season 2 premiere) backstory, but it wasn’t shared to pull the rug out from the present; just to enhance it.\n\nThe Season 2 premiere arrived Tuesday night, for better or worse, with light pressure to recreate the magic from Season 1 — including the final twist — but there’s only one big question left: How did Jack die? We’ve known he passed away when the kids were young for a long time, and the persistent query has been pushed again and again by fans and the media. Though Episode 1 didn’t answer the big question in its entirety, “This Is Us” flashed forward to the day Jack died and gave just enough of a taste that maybe people will stop asking for a bit. Better yet, the episode showed greater maturity in setting up multiple upcoming stories, all of which look ready to play out without manipulation.\n\nSuch growth is fitting given the episode took place on the Big Three’s 37th birthday. Randall celebrates by taking his wife to a meeting with an adoption agent. Kate and Toby (Chris Sullivan) are planning a double date with Kevin and his girlfriend (/ex-wife), Sophie (Alexandra Breckenridge), but only after she auditions for a singing gig. And all this is framed by the tumultuous state of Jack and Rebecca’s relationship, only a day after their ruthless fight in the Season 1 finale.\n\nAs usual, Randall’s story is the best. Beth’s (Susan Kelechi Watson) hesitancy toward adoption is quickly and earnestly addressed instead of dragged out for multiple episodes. As soon as the husband makes a misstep by telling his wife she “needs to get her head around” what he wants, Randall apologizes with the sincerity and passion only a “perfect” couple could create with any form of authenticity. Yes, their mini-fight was just to set up a sterling speech by Brown, but that’s OK; that’s why a lot of people tune in, and if you have an actor of Brown’s (Emmy-winning) abilities, let him loose on lines like these. He can handle it.\n\nPlus, it moves the story forward, incrementally but believably, to the couple adopting an older child. It’s the kind of baby step we want to see, both in a challenge facing our iron-clad couple and in their slow build toward growth.\n\nKate, meanwhile, is a bit of a guessing game. Her entire arc began as nothing but stalling. The tension between her boyfriend and brother was obvious from the start, and it took until episode’s end for them to address it. Her bailing on the audition is another stretch, as there’s barely a good reason for her to do it. Is her timidity plausible? Sure, but it bogs down the story more than it adds to her character.\n\nThat being said, if it was all so Kate could be called out for only talking about her weight, it’s all worth it. Too many of Kate’s stories focused on her weight in Season 1, so much so that the audience barely knew anything else about her. So, if the band leader proves not everything is about her weight, thus pushing her on an exploration of her talent, passion, and commitment, then her plot line would be the most valuable of the entire episode. Kate deserves to do far more than she’s been allowed to thus far, and if this is how Season 2 sets up a year of non-weight-related arcs, bring it on.\n\nKevin, who creator Dan Fogelman has repeatedly promised will shock people in Season 2, didn’t get the chance just yet. A Ron Howard cameo and a sweet surprise from Sophie to end the episode couldn’t quite make his story stand out, but it wasn’t supposed to; someone has to play the supporting role, and Kevin did so well, yet again, in the premiere.\n\nThat only leaves Jack and Rebecca, and their storyline survived more than a few scares. The first came when it was unveiled that Randall walked in on his parents’ epic fight from the Season 1 finale. The heartbreaking revelation could still come up again later on, but here it subtly informed why Randall sees his mom’s interpretation of her first marriage as rose-colored. He saw what they said behind close doors, and he knows he never wants that for his marriage. So when he starts to edge closer to his father’s worse tendencies — bossing around his wife — he retreats. It motivates him to give his “perfect, imperfect” speech, and better informs Randall’s character.\n\nThe other traps in Jack and Rebecca’s plot were nimbly avoided. Think about the opportunities for emotional manipulation: Jack revealing he’s drunk to his wife, right when she asks him to come home, could’ve been played up to an obnoxious degree. Instead, he just said it. He told her, which was rewarding because we got to see Jack accept responsibility (reinforcing his reputation as the perfect man), but it got right to the heart of the matter.\n\nRebecca, in turn, did the same. Though the cut to black after Jack closed the door was a little much, Rebecca making him come home felt like the right step. “That’s not us,” she says, after he shut her out. The line, an inverse of the show’s title, defines the couple — and the show — as one not built on disconnect, but intimate understanding, acceptance, and honesty. Just as Rebecca needs to work through things directly with Jack, the show needs to tackle its tales head-on — as it did repeatedly in Episode 1.\n\nHer choice moves the story quickly toward a revelation that we now know is only a few months away. Jack’s death is imminent, and while the episode shared a few more clues (or red herrings) toward what will happen before we find out the cause of the fire — Kevin’s cast, Rebecca’s Steelers’ Jersey, Randall’s girlfriend — they weren’t laid out like twists. It felt more like preparation, preparation the audience very much needs after all this build up.\n\n“This Is Us” remains an occasionally cloying melodrama, but the Season 2 premiere exhibited honest emotional reactions much more than manipulated ones. Better yet, it’s set up a season that should do the same. Happy second birthday, “This Is Us.” You’re growing up just fast enough.\n\nGrade: B+\n\n“This Is Us” airs new episodes Tuesdays at 9 p.m. ET on NBC.\n\nSign Up: Stay on top of the latest breaking film and TV news! Sign up for our Email Newsletters here.", "images": ["https://www.indiewire.com/wp-content/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://www.indiewire.com/wp-content/uploads/2016/05/ben-travers.jpeg?resize=96%2C96", "https://www.indiewire.com/wp-content/themes/indiewire/sprites/logo/Logo_IndieWire.png", "https://www.indiewire.com/wp-content/uploads/2017/09/nup_179168_2729.jpg", "https://www.indiewire.com/wp-content/uploads/2017/09/nup_179168_1011.jpg?w=780", "https://www.indiewire.com/wp-content/uploads/2017/09/nup_179168_3630.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.indiewire.com/wp-content/themes/indiewire/images/indiewire-color.png", "https://pixel.quantserve.com/pixel?a.1=p-60R-umvc0T-Cw&a.2=p-31f3D02tYU8zY"], "top_img": "https://www.indiewire.com/wp-content/uploads/2017/09/nup_179168_1011.jpg?w=780", "keywords": [], "authors": ["Ben Travers"], "canonical_link": "https://www.indiewire.com/2017/09/this-is-us-season-2-review-premiere-episode-a-fathers-advice-recap-spoilers-1201880543/", "title": "‘This Is Us’ Season 2 Review: NBC Drama Grows Up in a Premiere That Wisely Refuses to Get Too Twisted", "meta_data": {"msvalidate.01": "87B78205BB25666E656DA3EB49F3FD42", "viewport": "width=device-width, initial-scale=1", "st": {"robots": "follow, index"}, "description": "A major piece fell into place re Jack’s death, but the \"This Is Us\" Season 2 premiere succeeded because it didn’t try to recreate the past.", "news_keywords": "Sterling K. Brown, This Is Us, TV Reviews", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=1400654071", "generator": "WordPress 6.0.2", "author": "Ben Travers", "theme-color": "#ffffff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "IndieWire", "application-name": "IndieWire", "content_type": "Article", "post_id": 1201880543, "title": "'This Is Us' Season 2 Review: NBC Drama Grows Up in a Premiere That Wisely Refuses to Get Too Twisted", "published_at": "2017-09-26 22:47:32", "image": "https://www.indiewire.com/wp-content/uploads/2017/09/nup_179168_1011.jpg?w=300", "comment_count": 3, "tags": "TV Reviews", "topics": "Television", "body": "[Editor’s Note: The following review contains spoilers for the “This Is Us” Season 2 premiere, Episode 1, “My Father’s Advice.”]\r\n\r\nWhen “This Is Us” premiered, it not only took the nation by storm, but quickly established a reputation for being a twist-driven family drama. The pilot pulled off a major last-second reveal — that Randall (Sterling K. Brown), Kate (Chrissy Metz), and Kevin (Justin Hartley) were all children of Jack (Milo Ventimiglia) and Rebecca (Mandy Moore) — and permanently hooked an audience who was already wooed by the emotional melodrama driving each individual story. With each new episode came the expectation for another twist, another secret, another layer to be revealed.\r\n\r\nBut as the season progressed, that expectation grew tiring. The characters were so full of life, the plots didn’t need to depend on any flashback reveals or present-day shocks. The best episodes played out naturally, like “Memphis,” when Randall’s biological father passed away during a road trip to his hometown. Viewers came to understand William's (Ron Cephas Jones, who made a nice cameo in the Season 2 premiere) backstory, but it wasn't shared to pull the rug out from the present; just to enhance it.\r\n\r\n\r\n\r\nThe Season 2 premiere arrived Tuesday night, for better or worse, with light pressure to recreate the magic from Season 1 — including the final twist — but there’s only one big question left: How did Jack die? We’ve known he passed away when the kids were young for a long time, and the persistent query has been pushed again and again by fans and the media. Though Episode 1 didn’t answer the big question in its entirety, “This Is Us” flashed forward to the day Jack died and gave just enough of a taste that maybe people will stop asking for a bit. Better yet, the episode showed greater maturity in setting up multiple upcoming stories, all of which look ready to play out without manipulation.\r\n\r\nSuch growth is fitting given the episode took place on the Big Three’s 37th birthday. Randall celebrates by taking his wife to a meeting with an adoption agent. Kate and Toby (Chris Sullivan) are planning a double date with Kevin and his girlfriend (/ex-wife), Sophie (Alexandra Breckenridge), but only after she auditions for a singing gig. And all this is framed by the tumultuous state of Jack and Rebecca’s relationship, only a day after their ruthless fight in the Season 1 finale.\r\n\r\n\r\n\r\nAs usual, Randall’s story is the best. Beth’s (Susan Kelechi Watson) hesitancy toward adoption is quickly and earnestly addressed instead of dragged out for multiple episodes. As soon as the husband makes a misstep by telling his wife she “needs to get her head around” what he wants, Randall apologizes with the sincerity and passion only a “perfect” couple could create with any form of authenticity. Yes, their mini-fight was just to set up a sterling speech by Brown, but that’s OK; that’s why a lot of people tune in, and if you have an actor of Brown’s (Emmy-winning) abilities, let him loose on lines like these. He can handle it.\r\n\r\nPlus, it moves the story forward, incrementally but believably, to the couple adopting an older child. It’s the kind of baby step we want to see, both in a challenge facing our iron-clad couple and in their slow build toward growth.\r\n\r\nKate, meanwhile, is a bit of a guessing game. Her entire arc began as nothing but stalling. The tension between her boyfriend and brother was obvious from the start, and it took until episode’s end for them to address it. Her bailing on the audition is another stretch, as there’s barely a good reason for her to do it. Is her timidity plausible? Sure, but it bogs down the story more than it adds to her character.\r\n\r\nThat being said, if it was all so Kate could be called out for only talking about her weight, it’s all worth it. Too many of Kate’s stories focused on her weight in Season 1, so much so that the audience barely knew anything else about her. So, if the band leader proves not everything is about her weight, thus pushing her on an exploration of her talent, passion, and commitment, then her plot line would be the most valuable of the entire episode. Kate deserves to do far more than she’s been allowed to thus far, and if this is how Season 2 sets up a year of non-weight-related arcs, bring it on.\r\n\r\nKevin, who creator Dan Fogelman has repeatedly promised will shock people in Season 2, didn’t get the chance just yet. A Ron Howard cameo and a sweet surprise from Sophie to end the episode couldn’t quite make his story stand out, but it wasn’t supposed to; someone has to play the supporting role, and Kevin did so well, yet again, in the premiere.\r\n\r\n\r\n\r\nThat only leaves Jack and Rebecca, and their storyline survived more than a few scares. The first came when it was unveiled that Randall walked in on his parents’ epic fight from the Season 1 finale. The heartbreaking revelation could still come up again later on, but here it subtly informed why Randall sees his mom’s interpretation of her first marriage as rose-colored. He saw what they said behind close doors, and he knows he never wants that for his marriage. So when he starts to edge closer to his father’s worse tendencies — bossing around his wife — he retreats. It motivates him to give his “perfect, imperfect” speech, and better informs Randall’s character.\r\n\r\nThe other traps in Jack and Rebecca’s plot were nimbly avoided. Think about the opportunities for emotional manipulation: Jack revealing he’s drunk to his wife, right when she asks him to come home, could’ve been played up to an obnoxious degree. Instead, he just said it. He told her, which was rewarding because we got to see Jack accept responsibility (reinforcing his reputation as the perfect man), but it got right to the heart of the matter.\r\n\r\nRebecca, in turn, did the same. Though the cut to black after Jack closed the door was a little much, Rebecca making him come home felt like the right step. \"That's not us,\" she says, after he shut her out. The line, an inverse of the show's title, defines the couple — and the show — as one not built on disconnect, but intimate understanding, acceptance, and honesty. Just as Rebecca needs to work through things directly with Jack, the show needs to tackle its tales head-on — as it did repeatedly in Episode 1.\r\n\r\nHer choice moves the story quickly toward a revelation that we now know is only a few months away. Jack’s death is imminent, and while the episode shared a few more clues (or red herrings) toward what will happen before we find out the cause of the fire — Kevin’s cast, Rebecca’s Steelers’ Jersey, Randall’s girlfriend — they weren’t laid out like twists. It felt more like preparation, preparation the audience very much needs after all this build up.\r\n\r\n“This Is Us” remains an occasionally cloying melodrama, but the Season 2 premiere exhibited honest emotional reactions much more than manipulated ones. Better yet, it’s set up a season that should do the same. Happy second birthday, “This Is Us.” You’re growing up just fast enough.\r\nGrade: B+\r\n\"This Is Us\" airs new episodes Tuesdays at 9 p.m. ET on NBC.", "fb": {"pages": 9800035481}, "fragment": "!", "og": {"type": "article", "title": "‘This Is Us’ Season 2 Review: NBC Drama Grows Up in a Premiere That Wisely Refuses to Get Too Twisted", "url": "https://www.indiewire.com/2017/09/this-is-us-season-2-review-premiere-episode-a-fathers-advice-recap-spoilers-1201880543/", "description": "The Big Three turned 37 and a major piece fell into place regarding Jack’s death, but the Season 2 premiere succeeded because it didn’t try to recreate the past.", "site_name": "IndieWire", "image": {"identifier": "https://www.indiewire.com/wp-content/uploads/2017/09/nup_179168_1011.jpg?w=780", "width": 780, "height": 520, "alt": "THIS IS US -- \"A Father's Advice\" Episode 201 --  Pictured: Milo Ventimiglia as Jack  -- (Photo by: Ron Batzdorff/NBC)"}, "locale": "en_US"}, "article": {"published_time": "2017-09-27T02:47:32+00:00", "modified_time": "2018-07-17T20:35:13+00:00"}, "twitter": {"site": "@indiewire", "creator": "@BenTTravers", "card": "summary_large_image", "title": "‘This Is Us’ Season 2 Review: NBC Drama Grows Up in a Premiere That Wisely Refuses to Get Too Twisted", "description": "A major piece fell into place re Jack’s death, but the \"This Is Us\" Season 2 premiere succeeded because it didn’t try to recreate the past.", "image": "https://www.indiewire.com/wp-content/uploads/2017/09/nup_179168_1011.jpg?w=780"}, "msapplication-TileImage": "https://www.indiewire.com/wp-content/uploads/2018/04/cropped-iw_favicon.png?w=270"}, "movies": [], "publish_date": 1506480452.0, "source": "https://www.indiewire.com", "summary": ""}