{"url": "https://www.theguardian.com/tv-and-radio/2017/nov/07/do-we-really-need-a-twilight-zone-revival-in-the-era-of-black-mirror", "text": "TV executives love to revive famous old shows. And who can blame them when the X-Files is currently enjoying a new lease on life, the recent return of Twin Peaks proved such an unexpected joy and even the new version of the 80s shoulderpad-fest Dynasty seems to have found its audience?\n\nThe Twilight Zone, however, might well be a different matter entirely. According to the Hollywood Reporter, Jordan Peele, the director of Get Out, has been selected to revive the venerable, spooky old sci-fi show for CBS All Access, which one would have to admit makes a certain sort of sense. Peele’s biting, horror-fuelled satire on race and richness would have made a fine episode of Rod Serling’s classic anthology series, as Serling delighted in using pulpy scenarios to brutally satirise the whirling cultural maelstrom of early 1960s society.\n\nThe question is whether The Twilight Zone can ever return to the intellectual heights that the original series reached over five seasons and a staggering 156 episodes between 1959 and 1964. A previous 1980s revival floundered despite featuring work from celebrated writers such as George RR Martin and Harlan Ellison, and perhaps because it lacked Serling’s knack for balancing shock tactics with a strident morality and subtle liberal message.\n\nEven with the presence of American Werewolf in London’s John Landis in the director’s chair and Steven Spielberg as a hands-on producer, the 1983 big screen reworking also failed to pass muster, and is now little-remembered. The most recent revival, on TV between 2002 and 2003, also largely left critics unimpressed despite having recruited Oscar-winner Forest Whitaker to take over Serling’s dutiful presentation and narration. So why should Peele’s efforts to restore The Twilight Zone to its former glories, more than half a century after the original show ruled the airwaves, fare any better than those of his predecessors?\n\nTV is not short on quality sci-fi anthology shows in 2017. Charlie Brooker’s Black Mirror is a relentlessly spiky and unforgiving cultural rectal probe, while Electric Dreams is a cerebrum-twistingly bonkers riff on the late great Philip K Dick’s blend of deep thinking and futuristic whimsy. Does either bite down quite so hard on its subject matter as Serling did with episodes such as 1960’s Eye of the Beholder, which imagined a world in which the contemporary standard of beauty is turned on its head? Black Mirror certainly has its moments, such as the ruthless 2011 episode The National Anthem, in which Britain’s prime minister is forced to have sex with a pig in order to save the life of a princess captured by terrorists. Electric Dreams, while a wonderfully engaging dip into sci-fi fancifulness, is perhaps too in love with its own big ideas to truly shock us.\n\nHow can Peele make The Twilight Zone stand out? He could start by following Electric Dreams’ lead and recruiting lavish acting talent of the calibre of Bryan Cranston, Terrence Howard, Anna Paquin and Steve Buscemi. By contrast, the 2002 revival of Serling’s show featured Showgirls’ Elizabeth Berkley and American Pie’s Shannon Elizabeth.\n\nBut the real key to success here is bravery. Peele needs to delve deep into America’s cultural underbelly to examine the kind of subject matter that has traditionally been out of bounds on TV. Race, inequality, a divisive political settlement, rightwing conspiracy theorists and the 1%: all should be on his radar. It’s often forgotten that Serling’s was a powerful voice for anti-war sentiment at a time when such sentiments were likely to lead to one being branded a communist; perhaps Peele might consider delving into such controversial areas as the leaking of sensitive military documents, not to mention the behaviour of American troops abroad.\n\nSerling’s Twilight Zone flourished because it disguised its regular ventures into taboo territory behind a comforting veil of science fiction, horror and fantasy tropes, and because its writing was absolutely top notch. If the show is coming back for good this time, it cannot afford to slip for even a moment below the majestic standards of its gilded predecessor.", "images": ["https://i.guim.co.uk/img/media/bdb1dd530a80cd86e0398f445dfe65e89ea17791/116_213_4520_2710/master/4520.jpg?width=465&quality=85&dpr=1&s=none", "https://i.guim.co.uk/img/media/bdb1dd530a80cd86e0398f445dfe65e89ea17791/116_213_4520_2710/master/4520.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9fb152efc11c7faddc85dd03f7983b0d", "https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Television%2CScience+fiction+and+fantasy+films%2CCulture%2CTelevision+%26+radio%2CBlack+Mirror%2CPhilip+K+Dick"], "top_img": "https://i.guim.co.uk/img/media/bdb1dd530a80cd86e0398f445dfe65e89ea17791/116_213_4520_2710/master/4520.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9fb152efc11c7faddc85dd03f7983b0d", "keywords": [], "authors": ["Ben Child"], "canonical_link": "https://www.theguardian.com/tv-and-radio/2017/nov/07/do-we-really-need-a-twilight-zone-revival-in-the-era-of-black-mirror", "title": "Do we really need a Twilight Zone revival in the era of Black Mirror?", "meta_data": {"description": "The Get Out director, Jordan Peele, is being lined up to bring back the classic sci-fi anthology show, but should it be left alone?", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#052962", "og": {"url": "http://www.theguardian.com/tv-and-radio/2017/nov/07/do-we-really-need-a-twilight-zone-revival-in-the-era-of-black-mirror", "image": {"identifier": "https://i.guim.co.uk/img/media/bdb1dd530a80cd86e0398f445dfe65e89ea17791/116_213_4520_2710/master/4520.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9fb152efc11c7faddc85dd03f7983b0d", "height": 719}, "title": "Do we really need a Twilight Zone revival in the era of Black Mirror?", "description": "The Get Out director, Jordan Peele, is being lined up to bring back the classic sci-fi anthology show, but should it be left alone?", "type": "article", "site_name": "the Guardian"}, "article": {"author": "https://www.theguardian.com/profile/benchild", "publisher": "https://www.facebook.com/theguardian", "modified_time": "2018-02-22T20:23:15.000Z", "section": "Television & radio", "published_time": "2017-11-07T18:55:01.000Z", "tag": "Television,Science fiction and fantasy films,Culture,Television & radio,Black Mirror,Philip K Dick"}, "al": {"ios": {"url": "gnmguardian://tv-and-radio/2017/nov/07/do-we-really-need-a-twilight-zone-revival-in-the-era-of-black-mirror?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287}, "twitter": {"dnt": "on", "app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"googleplay": "guardian://www.theguardian.com/tv-and-radio/2017/nov/07/do-we-really-need-a-twilight-zone-revival-in-the-era-of-black-mirror", "iphone": "gnmguardian://tv-and-radio/2017/nov/07/do-we-really-need-a-twilight-zone-revival-in-the-era-of-black-mirror?contenttype=Article&source=twitter", "ipad": "gnmguardian://tv-and-radio/2017/nov/07/do-we-really-need-a-twilight-zone-revival-in-the-era-of-black-mirror?contenttype=Article&source=twitter"}}, "card": "summary_large_image", "creator": "@BenChildGeek", "image": "https://i.guim.co.uk/img/media/bdb1dd530a80cd86e0398f445dfe65e89ea17791/116_213_4520_2710/master/4520.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=a753aaaf013565df16f73e37f3773674", "site": "@guardian"}, "robots": "max-image-preview:large"}, "movies": ["https://www.youtube-nocookie.com/embed/IbB_zTHE9JA?wmode=opaque&feature=oembed"], "publish_date": 1510012800.0, "source": "https://www.theguardian.com", "summary": ""}