{"url": "https://www.vulture.com/2018/02/network-tv-reboot-obsession-roseanne-murphy-brown.html", "text": "Photo: ABC\n\nTV has long loved recycling its past glories: Six months after I Love Lucy signed off the air in May 1957, the show’s stars were back on CBS with The Lucille Ball–Desi Arnaz Show, a monthly series of hour-long specials featuring the same characters from the beloved sitcom. But even for a medium known for its nostalgia fetish, 2018 seems destined to test audiences’ affection for throwback TV. Within the space of 48 hours last week, CBS — no doubt mindful of NBC’s successful relaunch of Will & Grace and ABC’s buzz-generating Roseanne return — green-lit a revival of its classic Candice Bergen comedy Murphy Brown and announced plans to reinvent 1980s detective dramas Magnum, P.I. and Cagney & Lacey. The Eye was hardly alone in jumping on 2018’s revival bandwagon: Already this year, ABC has ordered up pilots for reimagined versions of The Greatest American Hero and Get Christie Love!, CW confirmed it was moving forward with new takes on Roswell and Charmed, and History said it was bringing back the unscripted paranormal docuseries In Search Of…. Those projects joined previously announced reboots of Party of Five (Freeform), Muppet Babies (Disney Channel), Jersey Shore (MTV), Queer Eye for the Straight Guy (Netflix), and Amazing Stories (Apple), as well as a slew of rumored revivals in various stages of development (The Office, The Munsters, Miami Vice). Forget Peak TV: The era of Peak Reboot has arrived.\n\nHistorically, whenever Hollywood leans too heavily on reboots and remakes, critics and (more recently) social-media scolds are quick to kvetch about How Awful This Is. Reboots are almost always painted as a sign of creative bankruptcy or transparent attempts to cash in on old successes. My former Variety colleague Michael Schneider, executive editor of IndieWire, captured perfectly the jaded response many had to last month’s reboot news: “Anyone else getting the sense that broadcast TV is embarking on its Farewell Tour by playing all the hits one last time?” he tweeted. Schneider is not entirely wrong that this latest nostalgia bender is driven as much by network marketing departments as creative execs. Broadcast networks in particular are desperate for attention these days, and reboots and revivals are great ways to stand out.\n\nStill, even if it’s worth being a little bit cynical about Peak Reboot, reflexive eye rolls at TV’s thirsty nostalgia play aren’t warranted. More than a few TV pundits (myself included) greeted news of the Will & Grace revival with groans, in no small measure because the show limped off the air after eight seasons and seemed to have nothing more to say. Yet it’s actually turned out to be really good, and really welcome viewing in the age of Trump. Its success will not be duplicated by all of these future reboots, of course. But the near certainty that some — perhaps most — reboots will crash and burn is no reason to dismiss the trend. With that in mind, here are three arguments in defense of TV nostalgia.\n\nNetwork TV is all about establishing relationships between a show and its audience, so why not revisit beloved characters?\n\nOne of biggest creative advantages TV offers over movies is the ability to explore characters and story lines with the sort of depth impossible in a two-hour film. Stories that take two hours to tell in a feature film unfold over the course of hundreds of episodes and many, many years. The weekly intimacy of network TV creates a massive emotional bond with its audience: It’s why the finales of shows such as Friends, Seinfeld, or Breaking Bad end up being the top-rated episodes in their respective runs, and why old episodes of those same shows do so well in syndicated reruns or on Hulu. Reviving well-loved shows seem symptomatic of creative bankruptcy, but for audiences literally programmed to connect with TV characters, continuations of Will & Grace or Roseanne are the small-screen equivalent of family or high-school reunions. It’s a chance to see how everyone looks now, to catch up with how their lives have changed (for better or worse). Why not take the chance to check back in on the old gang, particularly at a time when the real world is so anxiety-inducing? “I have always subscribed to [writer Les Brown’s] concept that TV is the electronic fireplace, and we are at a moment where many Americans are seeking comfort from the daily assault on our lives,” says TV industry veteran Preston Beckman, who spent three decades overseeing scheduling at NBC and, later, Fox. “Returning to the shows that made us comfortable in an earlier time is either an intended or unintended consequence of all these reboots.”\n\nIt’s also worth noting the recent revival boomlet is just the evolution of something that used to be fairly common in TV. Back in the late 1970s and early 1980s, just as Nick at Nite started popularizing cable reruns, networks realized there was a market in nostalgia. The economics of that era — i.e., networks weren’t nearly as desperate for ratings as they are now — generally precluded doing full-on series revivals. Instead, viewers reconnected with TV reunion movies like Rescue from Gilligan’s Island, The Return of the Beverly Hillbillies, The Munsters Revenge. If the movies did well enough, they’d result in full-on resurrections, as happened with The Brady Bunch and Perry Mason. Also common back then: prime-time specials featuring reunited casts as they reminisced and introduced clips from classic episodes. To be sure, most of the scripted reunion movies and series were straight-up garbage, so much so that they probably scared off an entire generation of TV producers and actors from the idea of a reunion. But just as TV in general is so much better now than 20 years ago, the current incarnation of Will & Grace suggests that revivals can be much more than quick money grabs and scratch that nostalgic itch.\n\nReboots don’t stop better shows from getting made.\n\nAs noted earlier, upticks in reboots, remakes, and spinoffs are almost always accompanied by complaints about how they supposedly strangle original ideas. This critique is certainly valid in the feature film business, where big studios (particularly Disney) are overwhelmingly interested in sequels and franchises, leaving new ideas to smaller players. Until about five years ago, you could also make a plausible case that networks’ reliance on recycled material deprived more interesting ideas of creative oxygen. But in the midst of the Peak TV, it’s tough to see how ABC’s decision to bring back Roseanne would kill off some new comedy that might up becoming the next Roseanne.\n\nFor one thing, there’s little evidence broadcast networks are cutting back their new-series-development budgets in order to spend outrageous sums for the cast of Murphy Brown. Plenty of original ideas are still getting green-lit. Obviously, network budgets aren’t limitless (that would be the Netflix model), so a reboot of Cagney & Lacey or Get Christie Love! technically means a few less pilot slots for new ideas. But any actually good concept that’s passed over by broadcasters shouldn’t have much problem finding a home elsewhere — not in an age when Apple, YouTube, and Facebook are joining the Big Three streamers and a slew of cable networks in making scripted shows.\n\nRemember: Unlike most cable networks or streamers, broadcasters intentionally make a whole bunch of pilots each year that never end up airing. They’ll even order pilots for two projects with remarkably similar themes — hot doctors! Sexy FBI agents! — and then pick the best one to turn into a series. CBS seems to be doing just that with the female police detective genre: In addition to a reboot of Cagney & Lacey (about two female cops working in Los Angeles), the Eye has ordered a pilot called Chiefs (about three female cops working in L.A.). It’s doubtful both projects will make it to series, but if CBS ultimately picks Cagney & Lacey over Chiefs, will TV fans really suffer all that much?\n\nOld TV shows aren’t sacred texts, and reinterpreting them isn’t sacrilege.\n\nTV fans aren’t usually as precious about their favorite shows as film nerds, but as the online outcry over CW’s upcoming Charmed reboot has made clear, they won’t hesitate to speak out if they’re worried about how a beloved franchise is being handled. And that’s fine! Because TV is all about those deep bonds, it’s logical that folks will feel protective. (I’ve been known to whine about game-show revivals that don’t meet my expectations, so I’m not one to judge.) But preemptive outrage at the very idea of a remake is almost never justified. Broadway revivals are such an enshrined and respected part of the business, the theater world hands out specific Tony Awards to the best ones. Some film critics thought last year’s Blade Runner 2049 was better than the original. Why shouldn’t modern writers and producers look to TV’s past for inspiration, too?\n\nI loved One Day at a Time when it first aired on CBS in the 1970s and 1980s, and I was initially a bit bummed when Netflix said it was bringing back the show but not making it a continuation of the original. My fears were misplaced: The revival was one of 2017’s best new shows. It succeeded because, even if producers didn’t overtly acknowledge the Romano clan’s existence, they respected what made the first show so great and updated it for our times. Similarly, if the producers of CBS’s new Cagney & Lacey can make their reboot a show about the sexism faced by female cops and the challenges they face working in a male-dominated world — and not just a grittier Mysteries of Laura — then it could end up being the cop show we need in the age of #MeToo. Bottom line: Reboots are not inherently bad. It’s fine to be wary whenever network execs go overboard with any sort of programming genre. But judge the results, not the trend.", "images": ["https://pyxis.nymag.com/v1/imgs/e33/6e7/aed044d06bd5c293490430f400dc112e41-2022Cov4x5-AsianAmericaPkg.w240.jpg", "https://pyxis.nymag.com/v1/imgs/31a/165/7b2cda49d5258316afceb071e56d8d3a8b-women-3.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/8e7/21f/303c8fbd1fe9373d5035deca7869d5475a-01-rosanne-1.1x.rsocial.w1200.jpg", "https://pyxis.nymag.com/v1/imgs/8e7/21f/303c8fbd1fe9373d5035deca7869d5475a-01-rosanne-1.rsquare.w700.jpg", "https://www.vulture.com/media/components/customer-alert-banner/close_x.svg", "https://www.vulture.com/media/components/customer-alert-banner/alert.svg", "https://pyxis.nymag.com/v1/imgs/5ea/81e/4d3b39a96107c321338c0c9a25557bd47f-zarifa-ghafari.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/c32/3bf/0a393283dc1f3f9257ff8b361ea03216c8-russia-missile.2x.rsquare-zoom.w75.jpg", "https://www.vulture.com/media/components/customer-alert-banner/double_chevron.svg"], "top_img": "https://pyxis.nymag.com/v1/imgs/8e7/21f/303c8fbd1fe9373d5035deca7869d5475a-01-rosanne-1.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["Josef Adalian"], "canonical_link": "https://www.vulture.com/2018/02/network-tv-reboot-obsession-roseanne-murphy-brown.html", "title": "Why Network TV’s Obsession With Reboots Isn’t a Bad Thing", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "parsely-tags": "the industry, reboots, will & grace, roseanne, murphy brown, queer eye, jersey shore, tv, tv revivals, tv reboots, vulture homepage lede, vulture section lede, featuretype:feature", "og": {"title": "Why Network TV’s Obsession With Reboots Isn’t a Bad Thing", "url": "https://www.vulture.com/2018/02/network-tv-reboot-obsession-roseanne-murphy-brown.html", "description": "Forget Peak TV: The era of Peak Reboot has arrived.", "image": "https://pyxis.nymag.com/v1/imgs/8e7/21f/303c8fbd1fe9373d5035deca7869d5475a-01-rosanne-1.1x.rsocial.w1200.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "Why Network TV’s Obsession With Reboots Isn’t a Bad Thing", "description": "Forget Peak TV: The era of Peak Reboot has arrived.", "image": "https://pyxis.nymag.com/v1/imgs/8e7/21f/303c8fbd1fe9373d5035deca7869d5475a-01-rosanne-1.2x.rsocial.w600.jpg", "card": "summary_large_image", "creator": "@tvmojoe", "site": "@vulture"}, "article": {"published_time": "2018-02-01T11:44:08.031-05:00", "tag": "the industry, reboots, will & grace, roseanne, murphy brown, queer eye, jersey shore, tv, tv revivals, tv reboots, vulture homepage lede, vulture section lede", "publisher": "https://www.facebook.com/Vulture"}, "description": "Forget Peak TV: The era of Peak Reboot has arrived. From Will & Grace and Roseanne to Murphy Brown and Magnum, P.I., network TV is obsessed with reboots. Here are three reasons why that isn’t such a bad thing.", "robots": "max-image-preview:large", "sailthru.tags": "the industry, reboots, will & grace, roseanne, murphy brown, queer eye, jersey shore, tv, tv revivals, tv reboots, vulture homepage lede, vulture section lede", "author": "Josef Adalian", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://assets.nymag.com/media/sites/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1517503448.031, "source": "https://www.vulture.com", "summary": ""}