{"url": "http://www.nfib-sbet.org/", "text": "SMALL BUSINESS ECONOMIC TRENDS\n\nThe NFIB Small Business Optimism Index rose 1.9 points in August to 91.8, marking the eighth consecutive month below the 48-year average of 98 but reversing some of the declines in the first half of the year. Twenty-nine percent of owners reported that inflation was their single most important problem in operating their business, a decrease of eight points from July’s highest reading since the fourth quarter of 1979.\n\n“The small business economy is still recovering from the pandemic while inflation continues to be a serious problem for owners across the nation,” said NFIB Chief Economist Bill Dunkelberg. “Owners are managing the rising costs of utilities, fuel, labor, supplies, materials, rent, and inventory to protect their earnings. The worker shortage is impacting small business productivity as owners raise compensation to attract better workers.”\n\nKey findings include:\n\n– Small business owners expecting better business conditions over the next six months improved 10 points from July to a net negative 42%, the highest level since February 2022, but a dismal outlook.\n\n– The net percent of owners raising average selling prices decreased three points to a net 53% (seasonally adjusted), still a very inflationary outcome.\n\n– The net percent of owners who expect real sales to be higher increased 10 points from July to a net negative 19%, but owners still want to hire.\n\n– The Uncertainty Index increased seven points to 74.\n\nAs reported in NFIB’s monthly jobs report, 49% of owners reported job openings that were hard to fill, unchanged from July and remaining historically high. Owners’ plans to fill open positions remain elevated, with a seasonally adjusted net 21% planning to create new jobs in the next three months.\n\nFifty-two percent of owners reported capital outlays in the last six months, up one point from July. Of those making expenditures, 36% reported spending on new equipment, 18% acquired vehicles, and 14% improved or expanded facilities. Thirteen percent spent money for new fixtures and furniture and 6% acquired new buildings or land for expansion. Twenty-five percent of owners plan capital outlays in the next few months, up three points from July. Overall, spending and plans to spend are still historically weak.\n\nA net negative 8% of all owners (seasonally adjusted) reported higher nominal sales in the past three months, down three points from July. The net percent of owners expecting higher real sales volumes improved by 10 points to a net negative 19%.\n\nThe net percent of owners reporting inventory increases fell seven points to a net negative 6%. Fifteen percent of owners reported increases in stocks and 19% reported reductions as solid sales reduced inventories at many firms.\n\nThirty-two percent of owners reported that supply chain disruptions have had a significant impact on their business. Another 33% report a moderate impact and 23% report a mild impact. Only 11% report no impact from recent supply chain disruptions.\n\nA net 3% of owners viewed current inventory stocks as “too low” in August. Shortages are reported most frequently in the manufacturing (24%), transportation (23%), retail (19%), agriculture (14%), and construction (11%) industries. A net 4% of owners plan inventory investment in the coming months, up three points from July. Auto dealers and other durable goods merchants are still low on inventory.\n\nThe net percent of owners raising average selling prices decreased three points from July to a net 53% (seasonally adjusted). Unadjusted, 8% reported lower average selling prices and 60% reported higher average prices. Price hikes were the most frequent in construction (71% higher, 3% lower), retail (67% higher, 7% lower), transportation (62% higher, 0% lower), and manufacturing (61% higher, 3% lower). Seasonally adjusted, a net 32% of owners plan price hikes, down five points.\n\nSeasonally adjusted, a net 46% of owners reported raising compensation, down two points from July. A net 26% plan to raise compensation in the next three months, up one point from July and historically very high. Ten percent of owners cited labor costs as their top business problem and 26% said that labor quality was their top business problem. Labor quality remains in second place behind “inflation” by three points.\n\nThe frequency of reports of positive profit trends was a net negative 33%, down seven points from July. Among the owners reporting lower profits, 36% blamed the rise in the cost of materials, 23% blamed weaker sales, 12% cited labor costs, 7% cited lower prices, 6% cited the usual seasonal change, and 4% cited higher taxes or regulatory costs. For owners reporting higher profits, 38% credited sales volumes, 35% cited usual seasonal change, and 13% cited higher prices.\n\nFour percent of owners reported that all their borrowing needs were not satisfied. Twenty-three percent reported all credit needs were met and 60% said they were not interested in a loan. A net 6% reported their last loan was harder to get than in previous attempts. One percent reported that financing was their top business problem. A net 21% of owners reported paying a higher rate on their most recent loan.", "images": ["http://www.nfib-sbet.org/wp-content/themes/nfib/img/homespinner.gif", "http://www.nfib-sbet.org/wp-content/themes/nfib/img/spinner-page.gif"], "top_img": "http://www.nfib-sbet.org/wp-content/themes/nfib/img/spinner-page.gif", "keywords": [], "authors": [], "canonical_link": "", "title": "NFIB", "meta_data": {"viewport": "width=1024"}, "movies": [], "publish_date": null, "source": "http://www.nfib-sbet.org", "summary": ""}