{"url": "https://www.hollywoodreporter.com/thr-esq/dr-luke-subpoenas-lady-gaga-deposition-kesha-defamation-case-1025234", "text": "The lawyers for producer Dr. Luke filed court papers Friday night demanding Lady Gaga to set a deposition date for his defamation case about singer Kesha.\n\nGaga, who has been subpoenaed in the case, has been an outspoken supporter of Kesha during the latter‘s legal battle against Luke over claims he drugged, raped and emotionally abused her.\n\nLuke’s lawyers claim Gaga joined Kesha’s “smear campaign” against the producer and “spread negative messages,” including a statement urging Sony Music to cut ties with Luke, according to court docs.\n\nThe move comes after Gaga failed to appear for her deposition on an earlier date and chose not to provide an alternative deposition date. Court documents state that Luke’s side had offered to limit the deposition to three hours and conduct it at a location of Gaga’s choosing. Instead, the singer proposed the use of a “sword affidavit from her in lieu of deposition testimony.”\n\n“Dr. Luke’s counsel served a subpoena on Lady Gaga because she has relevant information regarding, among other things, false statements about Dr. Luke made to her by Kesha,” Luke’s lawyers wrote in a statement. “This motion has become necessary because Dr. Luke’s counsel has not been able to obtain, despite repeated request, a deposition date from Lady Gaga.”\n\nA representative for Lady Gaga released the following statement: “As Lady Gaga’s legal team will present to the court, she has provided all of the relevant information in her possession and is at most an ancillary witness in this process. Dr. Luke’s team is attempting to manipulate the truth and draw press attention to their case by exaggerating Lady Gaga’s role and falsely accusing her of dodging reasonable requests.”\n\nThis story first appeared on Billboard.com.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/02/lady_gaga.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/02/lady_gaga.jpg?w=1296&h=730&crop=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/02/lady_gaga.jpg?w=1024", "keywords": [], "authors": ["Mitchell Peters", "Billboard Thr Staff", "Thr Staff"], "canonical_link": "https://www.hollywoodreporter.com/business/business-news/dr-luke-subpoenas-lady-gaga-deposition-kesha-defamation-case-1025234/", "title": "Dr. Luke Subpoenas Lady Gaga for Deposition in Kesha Defamation Case", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Luke's lawyers claim Gaga joined Kesha's \"smear campaign\" against the producer and “spread negative messages.\"", "news_keywords": "Lady Gaga", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "THR staff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1025234, "title": "Dr. Luke Subpoenas Lady Gaga for Deposition in Kesha Defamation Case", "published_at": "2017-07-29 12:31:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/02/lady_gaga.jpg?w=1024", "comment_count": 0, "tags": "Lady Gaga", "topics": "Business News", "body": "The lawyers for producer Dr. Luke filed court papers Friday night demanding Lady Gaga to set a deposition date for his defamation case about singer Kesha.\r\nGaga, who has been subpoenaed in the case, has been an outspoken supporter of Kesha during the latter's legal battle against Luke over claims he drugged, raped and emotionally abused her.\r\nLuke's lawyers claim Gaga joined Kesha's \"smear campaign\" against the producer and “spread negative messages,\" including a statement urging Sony Music to cut ties with Luke, according to court docs.\r\nThe move comes after Gaga failed to appear for her deposition on an earlier date and chose not to provide an alternative deposition date. Court documents state that Luke's side had offered to limit the deposition to three hours and conduct it at a location of Gaga's choosing. Instead, the singer proposed the use of a \"sword affidavit from her in lieu of deposition testimony.\"\r\n\"Dr. Luke's counsel served a subpoena on Lady Gaga because she has relevant information regarding, among other things, false statements about Dr. Luke made to her by Kesha,\" Luke's lawyers wrote in a statement. \"This motion has become necessary because Dr. Luke's counsel has not been able to obtain, despite repeated request, a deposition date from Lady Gaga.\"\r\nA representative for Lady Gaga released the following statement: \"As Lady Gaga's legal team will present to the court, she has provided all of the relevant information in her possession and is at most an ancillary witness in this process. Dr. Luke's team is attempting to manipulate the truth and draw press attention to their case by exaggerating Lady Gaga's role and falsely accusing her of dodging reasonable requests.\"\r\nThis story first appeared on Billboard.com.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Dr. Luke Subpoenas Lady Gaga for Deposition in Kesha Defamation Case", "url": "https://www.hollywoodreporter.com/business/business-news/dr-luke-subpoenas-lady-gaga-deposition-kesha-defamation-case-1025234/", "description": "Luke’s lawyers claim Gaga joined Kesha’s “smear campaign” against the producer and “spread negative messages.”", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/02/lady_gaga.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-07-29T12:31:00+00:00", "modified_time": "2017-07-30T14:55:47+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Dr. Luke Subpoenas Lady Gaga for Deposition in Kesha Defamation Case", "description": "Luke’s lawyers claim Gaga joined Kesha’s “smear campaign” against the producer and “spread negative messages.”", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/02/lady_gaga.jpg?w=1296"}}, "movies": [], "publish_date": 1501331460.0, "source": "https://www.hollywoodreporter.com", "summary": ""}