{"url": "https://www.bustle.com/p/the-trailer-for-keshas-new-documentary-revealed-rainbow-literally-saved-her-life-video-9938962", "text": "Kesha has had quite a year. Her third album, Rainbow, was released last August, and it's way more than just music. After an ongoing legal battle with producer Dr. Luke, Rainbow was Kesha's first album in five years. The album's songs are vulnerable, honest, and moving — and according to the trailer for her new documentary, Kesha says Rainbow \"saved [her] life.\"\n\nIn the minute-long trailer, Kesha says that she knows what it feels like to be \"trapped.\" She says in the clip,\n\nSometimes things feel like... like they're too much to handle. You may be able to pull it together and put on a front in front of others, but inside, you're trapped, suffocating slowly... This record has, quite literally, saved my life.\n\nThe trailer also shows Kesha on stage, telling a crowd, \"You don't own me,\" to much applause. There's also footage of her standing on a red carpet, breathing underwater, and singing in front of a huge audience.\n\nThe documentary about Rainbow will be released on Aug. 10, a day before the album's one-year anniversary. It will be streaming exclusively on Apple Music, too, so now's the time to sign up for the service or find a friend or family member who uses it.\n\nKesha has said that she wrote the song \"Rainbow\" while she was being treated for an eating disorder. As Bustle previously reported, Kesha checked herself into a treatment center in 2014, before filing the lawsuit against Dr. Luke.\n\n\"'Rainbow' was just my promise, my letter to myself that things would get better,\" Kesha told NPR last year. \"It was my mantra, because at the end of a storm comes a rainbow.\"\n\nKesha's song \"Praying,\" another track from Rainbow, also calls the Dr. Luke lawsuit to mind, though she didn't specifically say the song was about the producer during the NPR interview. The song gives a message of hope to survivors of any number of abuses, with Kesha suggesting that she prays for those who've harmed her. It's heartbreaking and empowering at the same time, much like Kesha's own story.\n\nIn October 2014, Kesha filed a lawsuit against Dr. Luke, alleging that he had abused her verbally and sexually. Kesha also claimed that Dr. Luke raped her in 2005, Billboard reported. That same month, Dr. Luke filed a defamation lawsuit against Kesha's mom, Pebe Sebert, which was dismissed in June 2017. (Dr. Luke has denied all allegations.)\n\nThen, in February 2016, a New York judge denied Kesha an injunction that would have let her record music without Dr. Luke. The ruling sparked the #FreeKesha movement, but Kesha dropped her California case against Dr. Luke later that year.\n\nWith everything she's gone through, though, it sounds like Kesha is in a much better place than she's been in the past. The Rainbow documentary will likely shed more light on everything that's gone into her album, including both the happy moments and the painful ones. Still, Kesha's experience is a reminder to fans that things can always get better, even if it doesn't seem that way at first.", "images": ["https://imgix.bustle.com/uploads/image/2020/12/4/b770b369-d92f-4f86-b3a0-99ee150e4b1c-marvel-studios-chadwick-boseman-as-black-panther.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2022/10/5/f00f77d9-681e-4a00-9203-db492952afb4-getty-1410516870.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2018/7/30/b874cbbe-c0fe-4e59-9b90-bfabf3b192ea-getty-917997064.jpg?w=800&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2018/7/30/b874cbbe-c0fe-4e59-9b90-bfabf3b192ea-getty-917997064.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2022/10/8/5fb538e8-5711-418d-b6a8-6dc96a2319bd-getty-1154845796.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2022/9/29/8902c879-38f9-4554-9753-3cf99222347e-conjuring-kesha-press-release-image-orbs.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/7/30/b874cbbe-c0fe-4e59-9b90-bfabf3b192ea-getty-917997064.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/the-trailer-for-keshas-new-documentary-revealed-rainbow-literally-saved-her-life-video-9938962", "title": "The Trailer For Kesha's New Documentary Revealed 'Rainbow' Literally Saved Her Life — VIDEO", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image", "creator": "@meghandemaria"}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/the-trailer-for-keshas-new-documentary-revealed-rainbow-literally-saved-her-life-video-9938962", "type": "article", "title": "The Trailer For Kesha's New Documentary Revealed 'Rainbow' Literally Saved Her Life — VIDEO", "description": "Kesha has had quite a year. Her third album, Rainbow, was released last August, and it's way more than just music. After an ongoing legal battle with producer Dr. Luke, Rainbow was Kesha's first album in five years. The album's songs are vulnerable,…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/7/30/b874cbbe-c0fe-4e59-9b90-bfabf3b192ea-getty-917997064.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "Kesha has had quite a year. Her third album, Rainbow, was released last August, and it's way more than just music. After an ongoing legal battle with producer Dr. Luke, Rainbow was Kesha's first album in five years. The album's songs are vulnerable,…"}, "movies": ["https://www.youtube.com/embed/eUNJTi_jU8A"], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}