{"url": "https://en.wikipedia.org/wiki/Phil_Elverum", "text": "American musician (born 1978)\n\nPhilip Whitman Elverum (né Elvrum;[1] born May 23, 1978)[2][3] is an American musician, songwriter, record producer and visual artist, best known for his musical projects The Microphones and Mount Eerie. Based in Anacortes, Washington, in the mid-2000s he began to spell his surname Elvrum as \"Elverum\".\n\nLife [ edit ]\n\nThe Track House as seen in 2010\n\nElverum and Castrée, his wife of 12 years, playing together in 2006\n\nPhil Elverum was born on May 23, 1978, in Anacortes, Washington.[2] Growing up, Elverum's father regularly made mixtapes for him and his sister. He soon started to play the tuba but after three years moved onto drums.[2] At age 14, he started his own band \"Nubert Circus\", playing the drums and writing lyrics.[2] Elverum attended Anacortes High School.[4] After graduating, he traveled across Canada with his then-girlfriend.[4] In the summer of 1997, during his \"punk rock experience\", he moved to Olympia, Washington, where he lived until 2002.[4][5] Elverum briefly attended Evergreen State College.[4][6] He expressed little interest in college, favoring the music scene, although he remained a relative unknown. Elverum would later cite the music scene as the reason he moved.[7] Elverum's primary source of income was music, performing small tours.[7]\n\nIn his adolescence, Elverum worked at Anacortes-based record store The Business where he would record music in the backroom after hours.[4] During his time there, he met Beat Happening member Bret Lunsford who offered him a job as the drummer of the band D+ alongside Karl Blau.[2] While living in Olympia, he would periodically return when low on money.[7] Elverum described his time at The Business as his \"entry point to alternative music\", noting how it helped him become immersed in the scene.[5] Also during his adolescence, Elverum expressed a desire to become a filmmaker, frequently making movies with his friends and screening them at a coffee shop.[8]\n\nBy January 2000, he was living at the \"legendary Track House\", after living in various other houses, such as the \"House Of Doom\" in Quincy, Washington, which was according to Elverum, \"Legitimately haunted. Raccoons and rats would eat your food right off the shelf. Poison barrels buried in the yard.\"[9][10] A black house surrounded by forests, the Track House was used by prominent independent musicians in the Olympia music scene.[10] In his free time, Elverum would record music across the street at Dub Narcotic Studio and volunteer at the local food co-op.[9] Elverum moved out of the Track House by 2002.[10]\n\nIn 2002, Elverum spent a winter in northern Norway, two hours from Bodø. He kept a log of his time there which became Dawn: Winter Journal and the songs composed for Dawn.[9] In 2003, Elverum met Canadian artist and musician Geneviève Castrée through mutual friends.[2] They married on February 29, 2004.[4] They originally intended to move to Canada, but after searching for residency decided to remain in the United States, in the town of Anacortes, where both Castrée and Elverum would become influential in the local music scene, in particular the forming of the What The Heck festival.[11][12] Castrée was diagnosed with inoperable pancreatic cancer following the birth of the couple's first child in 2015[13] and died on July 9, 2016.[14][15][16][17]\n\nElverum married actress Michelle Williams in July 2018 in a private ceremony in the Adirondacks.[18] Around the same time, he moved from his long-time residence in Anacortes to Williams' home in Brooklyn.[17] The couple separated in January 2019, and filed for divorce in April 2019.[19] Following the split, Elverum moved back to Washington, after having lived in New York for about nine months.[17] By November 2019, it was reported that they were no longer married.[17] In 2020, Elverum, with help from his brother, was building a house off the coast of Anacortes. Elverum had previously intended to build the house with Castrée.[20]\n\nElverum has described his parents as \"mystical about nature\", although these beliefs were not tied to a specific religion.[2] In an interview from 2012, he stated that \"a lot of the ideas that I’m trying to enunciate reflect a more or less Buddhist ideology. Even though I’m not Buddhist, at all, I come across these same ideas... I’m taking things from that tradition and reframing them in my world.\"[21] Elverum has expressed disdain for religion in general.[22]\n\nMusic career [ edit ]\n\nDub Narcotic Studio in 2013\n\nElverum is best known for having recorded and performed under the band names The Microphones (1996–2003, 2019–present) and Mount Eerie (2003–present). While the projects are distinct, Elverum views them as \"one progression\" stating that his goal is to make a varying body of work with a cohesive theme running through it, although there is a \"dividing line between pre-Geneviève dying and post-Geneviève dying\".[8][23] He is known for his prolific recordings with both projects; in 2019, The National reported that Elverum had created 40-plus albums.[24] He uses mostly analog recording equipment and often works in his own studio spaces, where he has the time and freedom to experiment with sounds.[25]\n\nIn 2004, Elverum created the label P.W. Elverum & Sun, Ltd.,[26] through which he has released records by Mount Eerie and The Microphones, as well as The Spectacle, Thanksgiving, Woelv, Nicholas Krgovich, Key Losers and Wyrd Visions. Prior to this, he was closely linked to K Records, working with artists like Mirah, Kyle Field, Karl Blau, Calvin Johnson and The Blow.[27] Though influenced by the sense of community, his releases from that time were primarily made by himself.[27] Elverum personally prints, packages, and ships his own vinyl and merchandise.[27] He explained his reasoning for doing so as wanting to \"understand the process holistically, and then maybe grow into more complex forms of organization later.\"[22] Elverum also creates all of the visual art for his musical releases.[27] In 2012, he helped establish a studio and venue called \"The Unknown\" at a disused church in his hometown of Anacortes.[28]\n\nElverum has also performed with other bands, worked as a producer for other artists, and released music under different names. In 1996, he joined D+ as the drummer. That same year, Elverum released a cassette under the title X-Ray Means Woman. In 1998, he became the drummer for Old Time Relijun, a position he held until 2002. In 2000, Elverum produced Mirah's debut, You Think It's Like This But Really It's Like This. He went on to produce her next three records as well as performing on The Old Days Feeling. His production credits would extend to 2004 when he produced Adrian Orange's Thanksgiving and Castrée's Pamplemoussi. Castrée's next album was also created with Elverum's involvement.[2]\n\nHis musical influences include Eric's Trip, Will Oldham, Björk, Nirvana, Popol Vuh, Sunn O))), Angelo Badalamenti, Tori Amos, The Cranberries, Sinead O'Connor, Red House Painters, Sonic Youth, This Mortal Coil and Stereolab.[29][30][31] Both Eric's Trip and Stereolab, in particular, were important to Elverum. A self-described fan of Eric's Trip, he has called Julie Doiron his favourite singer and stated that meeting and playing shows with her \"was a dream come true.\"[32][33] He also recalled how he would send fan mail to the band.[32] In the song \"Microphones in 2020\", he described seeing Stereolab perform \"one chord for fifteen minutes\" in a show at Bellingham, Washington, and stating that \"something in me shifted\" and that \"I brought home belief that I could create eternity.\"[31] He has also called grunge a \"formative influence.\"[5] Elverum's non-music influences include zen poetry, specifically the work of Eihei Dōgen and Gary Snyder.[34]\n\nIn a 2014 interview, Elverum discussed how he almost always composes songs as he records them, with songs created outside of a studio setting usually recorded not long afterward.[35] In that same interview, he talked about his desire to record music that was \"deep sounding enough that a listener could potentially inhabit the world of sound totally.\"[35]\n\nUnder both Mount Eerie and The Microphones, Elverum has recorded multiple versions of and sequels to his songs, such as demos or auto-tuned re-recordings and condensed albums.[35][36] Common themes and motifs in his work include the Moon, humanity's relationship to nature and technology, health, relationships, the human condition, impermanence, loneliness and the fleetingness of life,[37][38][39] although he denies that any of his songs are about \"sadness or isolation\".[40] According to Elverum, nature within his work is \"just the version of the world that I use to represent a neutral, non-human place where we're living out our weird adventures.\"[34] Before meeting Castrée, his songs would be dictated by \"whatever specific turmoil I was going through.\"[41] After meeting her, he became more withdrawn and intentionally chose not to discuss their relationship, until Mount Eerie's 2017 album A Crow Looked at Me, which is centered around her death.[41]\n\nMusical style [ edit ]\n\nOn the topic of his musical style, Elverum has said: \"You can easily find out what my music sounds like. I will not try to describe it\".[42] He has, however, described the aesthetics of his music as an attempt to replicate \"a dark presence in nature\" found in shows such as Twin Peaks.[43] Elverum's writing has been described as Lynchian.[44] Erin Vanderhoof of Vanity Fair described Elverum's aesthetics as \"acoustic...stripped-down and ponderous.\"[45] Sam Lewis of The Skinny described it as \"dreamlike, morbid and transcendent.\"[34] Brea Acton noted that it \"displays a fine balance between digital and analogue processes\", with Elverum \"drawing on digital techniques as a distancing mechanism as well as using it to enact intimacy.\"[46]\n\nElverum's music incorporates elements of ambient, folk, and black metal.[47] Despite this, Elverum's music has also been said to elude an exact genre.[48] His songs frequently \"alternate and shift\", \"transitioning from beautifully delicate melodies to pounding, fuzzy riffs\".[34] They also frequently feature \"skittering rhythms\" and the \"merging of drum machines\".[45] His lyrics have been described as \"confessional\", \"sparse\", \"tersely poetic\" and \"conversational\", his singing \"speak-sing\" and his storytelling \"free-flowing.\"[47][49][50]\n\nThe Believer magazine described his work as \"delicately sparse or layered and noisy, often in the same song. Lyrically, he focuses on memory, first-person storytelling, myth, naturalism, the everyday as sacred, and sense of place (in and out of Washington state)\".[51] Slate described it as \"fairly subdued yet intense and solipsistic, with a kind of American transcendentalist aesthetic (Emerson, Thoreau, Whitman) combined with a distinctly Pacific Northwest naturalist mysticism.\"[52] Todd Van Luling of HuffPost noted that despite Elverum's \"noise experimentation\", \"the cores of the songs are still straightforwardly affecting.\"[53]\n\nHis style has been praised for its personal and grounded nature. Rachel Laitman wrote: \"The effectiveness of Elverum’s style reminds us about the injury, and profound misunderstanding, incurred when we put the form of expression called singing in a box.\"[50]\n\nLegacy [ edit ]\n\nUnder both The Microphones and Mount Eerie, \"Elverum has been instrumental in shaping the landscape of current indie rock.\"[54] Isabel Zacharias claimed that Elverum, \"to a pocket of Pacific Northwesterners, is more folkloric deity than musician\" with his releases under The Microphones propelling him to \"indie-god status\".[55]\n\nVisual art and other work [ edit ]\n\nAn example of Elverum's photography\n\nElverum is also known for his artwork and photography. Early in his career, he produced limited-run fanzines and song booklets which were sold during Microphones tours. Since establishing P.W. Elverum & Sun, Ltd., he began to experiment with letterpress printing and other elaborate packaging ideas for his releases.[56] In 2007, he published a hardcover book of film photography with a 10\" picture disc titled Mount Eerie pts. 6 & 7.\n\nIn 2009, Elverum hosted his first art show, In Dreams, at Stumptown Coffee in Portland. The exhibition consisted of landscapes Elverum photographed in Norway, France, and rural Washington, using antique cameras and expired film.[57] In 2014, Elverum released Dust, a book of digital photography bound in stamped linen. He sells large-scale photographic prints and ink paintings through his online store.[58] His album Microphones in 2020 was accompanied by a lyric video consisting of over 800 photos.[59] In 2020, Elverum stated that he was working on an art book of Castrée's unpublished work.[60]\n\nIn 2001, while on tour, Elverum wrote a \"paper opera\" play[61] as part of a magazine centering around the theme of death.[62] In 2005, he created a 365-day comic calendar titled Fancy People Adventures, which was later syndicated by music website Tiny Mix Tapes.[63] In 2017, after finishing his eighth studio album as Mount Eerie, Elverum created a book about Anacortes, Washington.[64]\n\nElverum has also experimented with filmmaking, producing background visuals for his shows (released as a limited-edition DVD entitled Fog Movies) and promotional videos for several Mount Eerie songs.[27] He has stated that he does wish to one day make movies, viewing them as the \"ultimate art form\" and as such the culmination of his creativity.[8]\n\nDiscography [ edit ]\n\nThe Microphones [ edit ]\n\nMount Eerie [ edit ]\n\nD+ (1997)\n\n(1997) Dandelion Seeds (1998)\n\n(1998) Mistake (2002)\n\n(2002) Deception Pass (2003)\n\n(2003) No Mystery (2006)\n\n(2006) On Purpose (2008)\n\n(2008) What Is Doubt For? (2008)\n\n(2008) Destroy Before Listening (2018)\n\nPhil Elverum [ edit ]\n\nThe Fidalgo Island Beautiful Issue #5 1/2 (2007)\n\n(2007) Ditherer (2007)\n\n(2007) Weary Engine Blues (2013)\n\nOther projects [ edit ]\n\nMostly Clouds and Trees – Beautiful Face (1996)\n\n(1996) Tugboat – The Tugboat Fiasco (1996)\n\n(1996) X-Ray Means Woman – Face Shapes (1996)\n\n(1996) Old Time Relijun – Witchcraft Rebellion (2001)\n\n(2001) Peace – On Earth (2007)\n\n(2007) DJ Microphone – The Fidalgo Island Beautiful Issue #5 1/2 (2007)\n\n(2007) Mirah – (a)spera (2008)", "images": ["https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/48/Phil_Elverum%2C_2008.jpg/1200px-Phil_Elverum%2C_2008.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/The_Track_House.jpg/220px-The_Track_House.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/48/Phil_Elverum%2C_2008.jpg/550px-Phil_Elverum%2C_2008.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/42/Phil_Elverum%2C_Photo.jpg/220px-Phil_Elverum%2C_Photo.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Phil_Elverum%2C_Genevi%C3%A8ve_Castr%C3%A9e_%28retouch%29.jpg/220px-Phil_Elverum%2C_Genevi%C3%A8ve_Castr%C3%A9e_%28retouch%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Dub_Narcotic_Studio.jpg/220px-Dub_Narcotic_Studio.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/48/Phil_Elverum%2C_2008.jpg/1200px-Phil_Elverum%2C_2008.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Phil_Elverum", "title": "Phil Elverum", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/48/Phil_Elverum%2C_2008.jpg/640px-Phil_Elverum%2C_2008.jpg", "width": 640, "height": 428}, "title": "Phil Elverum - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}