{"url": "https://simple.wikipedia.org/wiki/Snow_White_and_the_Seven_Dwarfs_(1937_movie)", "text": "Snow White and the Seven Dwarfs is a 1937 American-German animated musical fantasy movie. It was made by Walt Disney Productions and released by RKO Radio Pictures. It is based on the German fairy tale Snow White by the Brothers Grimm. It is the first full-length cel animated movie and the earliest in the Walt Disney Animated Classics series. The story was adapted by storyboard artists Dorothy Ann Blank, Richard Creedon, Merrill De Maris, Otto Englander, Earl Hurd, Dick Rickard, Ted Sears and Webb Smith. David Hand was the supervising director, while William Cottrell, Wilfred Jackson, Larry Morey, Perce Pearce, and Ben Sharpsteen directed the movie's different sequences.\n\nSnow White was first shown at the Carthay Circle Theatre on December 21, 1937. It was released across the United States on February 4, 1938. With international earnings of $8 million during its initial release, the movie for a bit had the record of highest grossing sound movie at the time. The popularity of the movie has led to it being re-released theatrically many times, until its home video release in the 1990s. Adjusted for inflation, it is one of the top ten performers at the North American box office.\n\nAt the 11th Academy Awards, Walt Disney was awarded an honorary Oscar. The movie was nominated for Best Musical Score. It was added to the United States National Film Registry in 1989 and is ranked in the American Film Institute's list of the 100 greatest American films, who also named the movie as the greatest American animated movie of all time in 2008. Disney's take on the fairytale has had a huge cultural impact, resulting in popular theme park attractions, a video game, and a Broadway musical.\n\nAn evil queen has a mirror and asks \"Mirror, mirror, on the wall, who's the fairest of them all?\" The mirror answers \"Snow White\". Snow White is lost in the woods, and comes across the home of seven little men, or dwarves. She cleans their home, and they allow her to stay with them. The queen eventually finds out that the heart in the box is of a pig so she goes and changes herself onto an old hag. She goes to the dwarfs' cottage the next day while they're out and gets Snow White to bite into an apple with makes her fall dead. Suddenly, the dwarfs chase the old hag up a cliff and trap her. She tries to roll a boulder over them but lightning strikes and she dies. Snow White is awakened by the kiss of a handsome prince.\n\nSnow White theatrical trailer. Walt Disney introduces each of the Seven Dwarfs in a scene from the original 1937theatrical trailer.\n\nDevelopment on Snow White and the Seven Dwarfs began in early 1934, and in June 1934, Walt Disney announced the production of his first feature to the New York Times.[2] Before Snow White, the Disney studio had been mainly involved in the production of highly successful animated shorts in the Mickey Mouse and Silly Symphonies series. Disney hoped to enlarge his studio's reputation and money by moving into features, and estimated that Snow White could be produced for a budget of $250,000 - ten times the budget of an average Silly Symphony.\n\nWalt Disney had to fight to get the movie produced. Both his brother Roy Disney and his wife Lillian attempted to talk him out of it, and the Hollywood movie industry mockingly referred to the movie as \"Disney's Folly\" while it was in production. He even had to mortgage his house to help finance the movie's production, which eventually ran up a total cost of just over $1.5 million, a huge sum for a movie in 1937.\n\nUnvoiced characters include Snow White's animal friends, the Queen's raven, and the vultures who follow the Witch. However, although the animals did not have human speaking voices, their natural calls were very lifelike, and were all voiced by champion whistler and animal mimic A. Purves Pullen, who would provide bird and animal calls for Disney movies (including numerous Pluto cartoons) for several decades. Pullen also produced the bird calls for the Enchanted Tiki Room attractions at Disney theme parks. During the 1940s and 1950s, he performed as \"Dr. Horatio Q. Birdbath\" with the comedy band Spike Jones & His City Slickers.\n\nSnow White and the Seven Dwarfs was first shown in cinemas on December 21, 1937. It was released across the United States on February 4, 1938. It has been re-released many times since. The first time was in 1944, in order to raise money for the Disney studio during World War II. This set a tradition of re-releasing Disney animated features every seven to ten years. Snow White was re-released to theaters in 1952, 1958, 1967, 1975, 1983, 1987 and 1993.\n\nDisney's wife, Lillian, told him that no one will go pay anything to see a dwarf picture.[3] Snow White and the Seven Dwarfs premiered at the Carthay Circle Theater on December 21, 1937 to a very impressed audience, many of the same people who called the movie \"Disney's Folly.\" The movie received a prasie from many child actors audience that included Charlie Chaplin and Paulette Goddard, Shirley Temple, Mary Pickford, Douglas Fairbanks, Jr., Judy Garland, Ginger Rogers, Jack Benny, Fred MacMurray, Clark Gable and Carole Lombard, Burns and Allen, Ed Sullivan, Milton Berle, John Barrymore, and Marlene Dietrich. Six days later, Walt Disney and the seven dwarfs appeared on the cover of Time magazine. The New York Times said \"Thank you very much, Mr. Disney.\" RKO Radio Pictures put the movie into general release on February 4, 1938, and it went on to become a huge box-office success, making more money than any other movie in 1938. In fact, for a short time, Snow White was the highest-grossing movie in American cinema history, until it was beat by Gone with the Wind in 1939. When taking inflation into account, and including rereleases, the movie still remains one of the top ten American movie moneymakers of all time.[4]\n\nSnow White and the Seven Dwarfs was the first full-length animated feature movie made in English and Technicolor (not counting the Academy Award Review of Walt Disney Cartoons), and won an Academy Award for Walt Disney as a huge movie which has charmed millions and started a great new form of entertainment. Disney won a full-size Oscar statuette and seven small ones, given to him by 10-year-old child actress Shirley Temple.\n\nThe movie was also nominated for Best Musical Score. \"Some Day My Prince Will Come\" has become a jazz standard that has been performed by numerous artists, including Buddy Rich, Lee Wiley, Oscar Peterson, and Miles Davis.\n\nNoted moviemakers such as Sergei Eisenstein and Charlie Chaplin praised the movie as a huge achievement in cinema.[5] The movie inspired Metro-Goldwyn-Mayer to produce its own fantasy movie, The Wizard of Oz in 1939. The 1943 Merrie Melodies short Coal Black and de Sebben Dwarfs, directed by Bob Clampett, parodies Snow White by presenting the story with an all-black cast singing a jazz score.\n\nIn June 2008, the American Film Institute revealed its \"Ten top Ten\"—the best ten movies in ten \"classic\" American movie genres. After polling over 1,500 people from the creative community, Snow White and the Seven Dwarfs was acknowledged as the best movie in the animation genre.[6]\n\n\"I'm Wishing/One Song\" - Snow White, The Prince\n\n\"With a Smile and a Song\" - Snow White\n\n\"Whistle While You Work\" - Snow White\n\n\"Heigh-Ho\" - The Dwarfs\n\n\"Bluddle-Uddle-Um-Dum\" (a.k.a. \"The Washing Song\") - The Dwarfs\n\n\"The Silly Song\" (a.k.a. \"The Dwarfs' Yodel Song\") - The Dwarfs\n\n\"Some Day My Prince Will Come\" - Snow White\n\n\"One Song\" - The Prince and Chorus\n\n\"Some Day My Prince Will Come\"\n\nTheme parks [ change | change source ]\n\nSnow White's Scary Adventures is a popular theme park ride at Disneyland (an opening day attraction dating from 1955), Walt Disney World's Magic Kingdom, Tokyo Disneyland, and Disneyland Paris. Snow White, her Prince, and the Seven Dwarfs are also featured in parades and character appearances throughout the parks.\n\nVideo game [ change | change source ]\n\nA video game was released for the Game Boy Color system. Snow White appears in the popular PlayStation 2 game Kingdom Hearts as one of the seven fabled Princesses of Heart.", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/59/Flag_of_Lebanon.svg/23px-Flag_of_Lebanon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9e/Flag_of_Japan.svg/23px-Flag_of_Japan.svg.png", "https://simple.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Flag_of_Mexico.svg/23px-Flag_of_Mexico.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/12/Flag_of_Poland.svg/23px-Flag_of_Poland.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Flag_of_Brazil.svg/22px-Flag_of_Brazil.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Flag_of_Denmark.svg/20px-Flag_of_Denmark.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Flag_of_Portugal.svg/23px-Flag_of_Portugal.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/78/Flag_of_Chile.svg/23px-Flag_of_Chile.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Wikiquote-logo-en.svg/40px-Wikiquote-logo-en.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Flag_of_Yugoslavia_%281946-1992%29.svg/23px-Flag_of_Yugoslavia_%281946-1992%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Flag_of_the_United_States.svg/23px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Flag_of_Germany.svg/23px-Flag_of_Germany.svg.png", "https://simple.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Walt_Disney_Snow_white_1937_trailer_screenshot_%2813%29.jpg/200px-Walt_Disney_Snow_white_1937_trailer_screenshot_%2813%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Flag_of_Ireland.svg/23px-Flag_of_Ireland.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Flag_of_Argentina.svg/23px-Flag_of_Argentina.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Flag_of_Turkey.svg/23px-Flag_of_Turkey.svg.png", "https://simple.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Snow_white_1937_trailer_screenshot_%282%29.jpg/220px-Snow_white_1937_trailer_screenshot_%282%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/Flag_of_Hungary.svg/23px-Flag_of_Hungary.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Flag_of_France.svg/23px-Flag_of_France.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Flag_of_Italy.svg/23px-Flag_of_Italy.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Flag_of_Hong_Kong.svg/23px-Flag_of_Hong_Kong.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Canada_%28Pantone%29.svg/23px-Flag_of_Canada_%28Pantone%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/34/Flag_of_El_Salvador.svg/23px-Flag_of_El_Salvador.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Flag_of_the_United_Kingdom.svg/23px-Flag_of_the_United_Kingdom.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Flag_of_Finland.svg/23px-Flag_of_Finland.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Flag_of_the_Czech_Republic.svg/23px-Flag_of_the_Czech_Republic.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_Sweden.svg/23px-Flag_of_Sweden.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Norway.svg/21px-Flag_of_Norway.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Flag_of_Switzerland.svg/16px-Flag_of_Switzerland.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Flag_of_Israel.svg/21px-Flag_of_Israel.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Flag_of_Kuwait.svg/23px-Flag_of_Kuwait.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Flag_of_Belgium_%28civil%29.svg/23px-Flag_of_Belgium_%28civil%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/0/09/Snow_white_1937_trailer_screenshot_%282%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Flag_of_Australia_%28converted%29.svg/23px-Flag_of_Australia_%28converted%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Flag_of_Austria.svg/23px-Flag_of_Austria.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Flag_of_Russia.svg/23px-Flag_of_Russia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Flag_of_Guyana.svg/23px-Flag_of_Guyana.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/0/09/Snow_white_1937_trailer_screenshot_%282%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://simple.wikipedia.org/wiki/Snow_White_and_the_Seven_Dwarfs_(1937_movie)", "title": "Snow White and the Seven Dwarfs (1937 movie)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/0/09/Snow_white_1937_trailer_screenshot_%282%29.jpg", "width": 640, "height": 497}, "title": "Snow White and the Seven Dwarfs (1937 movie) - Simple English Wikipedia, the free encyclopedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://simple.wikipedia.org", "summary": ""}