{"url": "www.theatlantic.com/politics/archive/2017/11/grading-president-trump/544985/", "text": "Supporters of President Trump like to say that despite all the tumult, the commander in chief is doing just fine. While the pundits rant and rave about whatever the “unprecedented” action of the day happens to be as he seems to move from one scandal to the next, the president’s allies dismiss the fireworks as nothing more than passing noise.\n\nEven many cynical Democrats conclude in frustration that the president is simply distracting the public while he moves forward with an aggressive deregulatory agenda. After all, they say, when push comes to shove Donald Trump still is president of the United States despite all the controversy. Barring impeachment, he will be at least until 2020. Both his staunch supporters and cynical opponents love to dig into the polling data so that they can point out that his base still loves him, proof that Trump is succeeding.\n\nBut both of these measures tell us very little about whether his presidency is succeeding. Indeed, these are pretty ridiculous standards by which to measure the progress of any commander in chief. The “he’s still the president” standard would mean that anyone who serves a full term without voluntarily resigning or being impeached is successful. In this way of judging presidents, James Buchanan, Herbert Hoover, and Jimmy Carter would be on the same level as Franklin Roosevelt or Ronald Reagan.\n\nThe obsession with “the base” is equally misleading. By definition, the “base” of a president’s support is the part of the electorate that is so passionate about the victor on election day that it takes immense problems and a long time to shake their support. Most presidents, including Richard Nixon, don’t lose their base. In a look at Watergate, Iran-Contra, and the Monica Lewinsky scandals, Julia Azari, Perry Bacon Jr., and Harry Enten found that the party base remained loyal to the president until the very end. Using the “base is still with him” standard is a little like saying that in a bad season the 30-year NFL season-ticket holder who never misses a game, who hosts a massive tailgate party every Sunday, who owns every piece of team paraphernalia sold at the team store, and who spends most of the non-working day checking his or her smartphone to see the latest injury report, still loves his or her team.\n\nThere are much better ways through which to evaluate the president that offer us a better understanding of how Trump has performed thus far.\n\nWhat are some ways in which Trump can claim that the critics have been wrong? In terms of using executive power to pursue his policy agenda, the president has a pretty stellar record. This is one area in office where he has boldly used presidential power to fulfill the promises that he has made on the campaign trail. His number one target has been regulations to curb climate change and high-risk financial investments. Starting from his first days in office, he has issued a series of executive orders that roll back actions taken under President Obama. Scott Pruitt at the EPA has moved aggressively against environmental protections and courted business interests who want more development. While his plan to build a wall along the southern border has stalled in Congress, Trump has relied on executive power to ramp up the detention and deportation of illegal immigrants. When the repeal and replace of ACA floundered, the Department of Health and Human Services has used all of its administrative power to render the Affordable Care Act ineffective. President Trump also ended vital subsidies for health-insurance providers that kept state-insurance markets stable. He declared an end to the Deferred Action for Childhood Arrivals program through executive fiat, eliminating the protections that Obama had granted to undocumented immigrants brought to the U.S. as children. To be sure, some of his efforts have been turned back by the courts, such as his early attempts to implement a ban on travelers from several mostly Muslim nations. Overall, however, the president receives high marks from his success at deploying this power.\n\nThe economy is also doing well. Though the president has not crafted any policies that diminish the middle- and working-class insecurity that motivated so many of his core supporters in states like Wisconsin, the stock market is booming; unemployment remains low. His critics rightfully point out that much of the rebound stems from the policies that President Obama put into place after the 2008 crash as well as the natural rhythm of the economic cycle. The trends that Trump boasts about already started under Obama. Wages also remain stagnant, the chief source of concern for much of Trump’s base. But politically these distinctions don’t matter. At least in the first year, Trump can tell voters that he is governing over a robust economy.\n\nAnd the last factor that he can promote before voters, if he wants to, is that we have not yet entered into any major, unnecessary protracted military conflict. At this point in his presidency, there is no Vietnam or Iraq. Obviously, it is very early in his term, and the fact that the nation has not been drawn into a war is extraordinarily fortunate given how the president has worsened tensions through his haphazard and aggressive approach to dealing with the nation’s adversaries.\n\nBy most other measures, President Trump is currently receiving failing marks. The most important measure that we have of presidential success is legislation. Great presidents are able to persuade Congress to pass major bills that fundamentally change the policy landscape. This has always been one of the best marks of success. Franklin Roosevelt had the New Deal, Lyndon Johnson had the Great Society, Ronald Reagan had his unnamed mix of tax cuts, military spending, and deregulation.\n\nRight now, President Trump has nothing to show after nine months of united Republican government. Legislating is always hard, but these are the best circumstances that a party can ask for, with little disagreement on most major issues. President Trump has repeatedly fumbled the opportunity to create a record on Capitol Hill. The way that he has handled the legislative process on issues like health care has been a fiasco. Congress might pass the tax cut, and this would be an important achievement, though it remains a problem for the administration that this low-hanging fruit in a moment of unified Republican control would be his only major bill.\n\nTrump assured voters on the campaign trail that he would “drain the swamp” of Washington influence. He has done just the opposite. The conflict-of-interest problem that stems directly out of the intersection between his business empire and the nation’s political interests epitomizes why so many Americans don’t trust the government. Then there are the stories about cabinet officials such as former Health and Human Services Secretary Tom Price’s lavish spending on private planes, which led to his resignation. As Brink Lindsey and Steve Teles argued in a trenchant piece for The New York Times, “the Beltway wetlands are now wilder and murkier than ever.”\n\nTrump has failed when it comes to winning broad public support. The most recent ABC News/Washington Post poll identifies his 59 percent disapproval rating as the worst for any president at the nine month mark since they began tracking it. A stunning 65 precent of people who responded do not think he can be trusted while only 44 percent said he is doing a good job with the economy. In Tuesday’s elections, Republican losses in Virginia and New Jersey indicated that there is a price to pay for Trump’s low public approval.\n\nNational approval ratings do matter. They give us some sense of whether the president is able to broaden his political support beyond the base and how large portions of the public are responding to what he does in office. There is no way to look at the numbers we have, unless you believe that they are “fake news,” and avoid the conclusion that Trump is struggling. His numbers have consistently been weak, and as we reach this anniversary, they are at historically low levels. He is looking at the kind of approval ratings that the most embattled, struggling presidents receive toward the end of their terms and at their worst moments. There was no honeymoon period for Trump.\n\nTrump is damaging the standing of the presidency within our polity.\n\nThe president has not improved international stability for the U.S. Despite his not starting a war, we have moved closer to serious military conflict as a result of his incendiary words and his systematic efforts to undercut the diplomatic apparatus of government. His Twitter wars with North Korea have left the U.S. in a volatile situation with an adversary eager to flex its nuclear muscle. His efforts to dismantle the nuclear deal with Iran could rekindle the country’s nuclear program and increase the clout of their government in international circles. The president’s refusal to even acknowledge Russian interference with the electoral processes of the U.S. and its allies has resulted in a weak-kneed response that leaves the nation just as vulnerable to foreign hack attacks in 2018 and 2020. The absence of any clear foreign-policy agenda, along with the dearth of first-rate foreign-policy advisers to surround him, leaves the nation moving from one problem to the next without a strong game plan. The possibility of his making a serious miscalculation or mistake is immense. Much more experienced and wise presidents have taken us in disastrous directions.\n\nAnother measure of presidential success is strength of his or her own party. This is one place where President Obama often fares poorly given the condition that Democrats found themselves in when he left office. Without question, the Republicans are struggling under Trump. Facing a series of major retirements, several polls indicating the possibility of a wave election, and open rhetorical infighting within the party, the state of the Republican Party is not good. If Republicans can survive politically over the next few years it will be despite President Trump, not because of him. Strong partisanship and the institutional advantages that the GOP enjoys, such as tightly gerrymandered congressional districts, would be the party’s only saving grace. So too might be the tragic incompetence of many Democratic leaders. But the president has made the party weaker and for this his grade suffers. In an increasingly pluralistic and diverse electorate, the party now has to carry the baggage of a president who refused taking a strong stand against white-nationalist extremists and who seems deeply invested in defending General Robert E. Lee and the Confederacy he served.\n\nIf we believe that the standing of the presidency as an institution is relevant to how the current holder of the position is doing, then here too is another place where Trump’s grades are at rock bottom. Trump is damaging the standing of the presidency within our polity. He has used the position as a platform to make misleading statements and outright lies. He has used vicious and childish rhetoric, in person and via tweets, that demean the prestige of the office and associate him with some of the worst demagogues we have seen emerge in the American political process. He has continually slammed the legitimacy of other major institutions, from the courts to the media, in ways that will permanently generate distrust for all instruments of government—including the one he now holds. Younger Americans will now expect that this kind of behavior is possible from the most powerful leader of the free world. Decorum, gravitas, and respect for institutions will never again be assumed.\n\nBy most measures, President Trump is not doing well. Added to these problems is the fact that, with the intensification of Special Counsel Robert Mueller’s investigation into the possibility that the Trump campaign aided Russian interference in the 2016 election, the odds for the administration to survive the full term have fallen. We have entered a realm where the odds of impeachment, though low, are very real. And one of the greatest reasons behind Mueller’s investigation was Trump himself—his decision to surround himself with shady figures like Mike Flynn and Paul Manafort, and his rash move to fire FBI Director James Comey so that he could get rid of the pressure from this “Russia thing.” When an investigation of this magnitude unfolds under the supervision of his own Justice Department and a Republican Congress this early in a term, the president is doing something wrong.\n\nA truly loyal supporter of President Trump would acknowledge the trouble that he faces and resist the simplistic defense that everything is going just fine. With their heads buried in the sand, Republicans are courting political disaster with the midterms approaching. Only if President Trump sees and acknowledges the kind of problems he has faced and the kind of trouble that he caused for our political institutions will he be capable of improving. Until then, he will remain on the road of chaos and dysfunction.", "images": ["https://cdn.theatlantic.com/thumbor/AFuEByWA2RLxKkYbhWMkuyIpEOA=/861x0:2967x2106/90x90/media/img/mt/2017/10/RTS1CWG7/original.jpg", "https://cdn.theatlantic.com/media/files/archive-thumbnail.png", "https://cdn.theatlantic.com/_next/static/images/nav-crossword-promo-71e9c22fbca07267d82afb8cca81ec00.png", "https://cdn.theatlantic.com/thumbor/6rSJeuc9Ng74ab5BNI3u-XQQIaE=/3x352:2399x1600/1200x625/media/img/mt/2017/11/RTX2SVNX/original.jpg", "https://www.theatlantic.com/magazine/images/current-issue.large.jpg", "https://cdn.theatlantic.com/media/files/YourSubscription_300x300.jpg", "https://cdn.theatlantic.com/thumbor/8Aw3boZqgy0x3A-t5ky1R-fuxF8=/570x0:1695x1125/90x90/media/img/2020/12/CC_Thompson_Suzman/original.png", "https://cdn.theatlantic.com/media/img/specialreports/lead/2020/10/14/Thumbnail.jpg", "https://cdn.theatlantic.com/assets/media/files/nav-crossword.png", "https://cdn.theatlantic.com/thumbor/wwaZtZd4ledpTU4oeK4R07-GTpE=/953x0:2641x1688/90x90/media/img/mt/2021/10/unnamed_1/original.jpg", "https://cdn.theatlantic.com/_next/static/images/nav-archive-promo-5541b02ae92f1a9276249e1c6c2534ee.png", "https://cdn.theatlantic.com/thumbor/z-xB85AHZHcPgsN9wdS4Il8CXuc=/0x125:2399x1474/960x540/media/img/mt/2017/11/RTX2SVNX/original.jpg"], "top_img": "https://cdn.theatlantic.com/thumbor/6rSJeuc9Ng74ab5BNI3u-XQQIaE=/3x352:2399x1600/1200x625/media/img/mt/2017/11/RTX2SVNX/original.jpg", "keywords": [], "authors": ["Julian E. Zelizer"], "canonical_link": "https://www.theatlantic.com/politics/archive/2017/11/grading-president-trump/544985/", "title": "Grading President Trump", "meta_data": {"viewport": "width=device-width,initial-scale=1", "application-name": "theatlantic", "msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "https://cdn.theatlantic.com/_next/static/images/apple-touch-icon-default-b504d70343a9438df64c32ce339c7ebc.png", "og": {"site_name": "The Atlantic", "locale": "en_US", "title": "Grading President Trump", "description": "While he gets high marks for using his executive power to enact policy changes, by most measures, he is not doing well.", "url": "https://www.theatlantic.com/politics/archive/2017/11/grading-president-trump/544985/", "type": "article", "image": "https://cdn.theatlantic.com/thumbor/6rSJeuc9Ng74ab5BNI3u-XQQIaE=/3x352:2399x1600/1200x625/media/img/mt/2017/11/RTX2SVNX/original.jpg"}, "fb": {"admins": "577048155,17301937", "app_id": 100770816677686, "pages": "29259828486,1468531833474495,1061579677251147,457711054591520,370457103090695,1631141167169115,148681772342453,1510507419185410,128344747344340,128377530562508,236061986423933"}, "p": {"domain_verify": "68e1a0361a557708fefc992f3309ed70"}, "twitter": {"site": "@theatlantic", "domain": "theatlantic.com", "card": "summary_large_image"}, "description": "While he gets high marks for using his executive power to enact policy changes, by most measures, he is not doing well.", "krux": {"title": "How Successful a President Really Is Donald Trump?  - The Atlantic", "description": "While he gets high marks for using his executive power to enact policy changes, by most measures, he is not doing well."}, "author": "Julian E. Zelizer", "article": {"publisher": "https://www.facebook.com/TheAtlantic/", "opinion": "false", "content_tier": "metered", "tag": "politics", "section": "Politics", "published_time": "2017-11-08T11:00:00Z", "modified_time": "2017-11-08T18:02:51Z"}, "robots": "index, follow, max-image-preview:large", "referrer": "unsafe-url", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-status-bar-style": "black", "apple-mobile-web-app-title": "The Atlantic", "keywords": "President Trump", "news_keywords": "President Trump", "next-head-count": 58}, "movies": [], "publish_date": 1510138800.0, "source": "http://www.theatlantic.com", "summary": ""}