{"url": "https://www.billboard.com/articles/news/grammys/8096861/2018-grammy-awards-lorde-accessorized-gown-feminist-poem-flask", "text": "Though she didn’t perform at Sunday night’s (Jan. 28) Grammy Awards, everyone was talking about Lorde.\n\nThe 21-year-old New Zealander was the only woman nominated for album of the year for her 2017 hit Melodrama — however, of the nominees, she was the only artist that was not asked to perform solo. Outraged fans called out the injustice on Twitter. “We champion women one award weekend & pull this shit the next,” wrote Modern Family‘s Jesse Tyler Ferguson.\n\nWe champion women one award weekend & then pull this shit the next. @lorde should be singing from her genius album. #2stepsforward3stepsback https://t.co/UTGjOV2eQK — Jesse Tyler Ferguson (@jessetyler) January 29, 2018\n\nExplore Explore Lorde See latest videos, charts and news See latest videos, charts and news\n\n[Editor’s Note: speaking after the broadcast Billboard Recording Academy President Neil Portnow and Grammys executive producer Ken Ehrlich explained the awkward situation. “These shows are always a matter of choices, and we know we have a box and the box gets full and filled up,” Ehrlich told reporters. “She had a great album, album of the year is a big honor, but there’s no way we can really deal with everybody. Sometimes people get left out that shouldn’t, but on the other hand, we did the best we can to make sure that it’s a representative and balanced show.”\n\nEarlier, Lorde reportedly declined an offer to perform as part of a of a group tribute to Tom Petty involving his song “American Girl,” though she did take the stage Friday night to cover Fleetwood Mac’s “Silver Springs” at the pre-Grammys MusiCares Person of the Year.]\n\nBut while Lorde didn’t take the stage to share her message during the Grammys broadcast, the singer-songwriter still managed to make her voice heard once inside Madison Square Garden (she noticeably skipped the red carpet), affixing a poem by conceptual artist Jenny Holzer to the back of her fluffy tulle Valentino gown.\n\n“My version of a white rose — THE APOCALYPSE WILL BLOSSOM — an excerpt from the greatest of all time, jenny holzer,” wrote Lorde on Instagram, referencing the white roses worn by a handful of men and women on the carpet to show solidarity with the Time’s Up movement. “The old & correct must be laid to waste,” reads the excerpt. “Before the just can triumph. Contradiction will be heightened. The reckoning will be hastened by the staging of seed disturbances. The apocalypse will blossom.”\n\nBut Lorde didn’t let the controversy dampen her mood. Once inside the venue, she pulled a Rihanna, reaching for a flask that just happened to perfectly match the vibrant red hue of her gown. Because sometimes a little booze is needed to take the edge off the patriarchy.\n\nLorde’s mother, the NZ poet Sonja Yelich, shared her thoughts on her daughter’s apparent snub with a Twitter post, highlighting a New York Times article which addressed gender inequality among Grammy winners.\n\nthis says it all –@nytimes January 26, 2018 pic.twitter.com/R3YdHwieXf — Sonja Yelich (@sonjayelich1) January 26, 2018\n\nOf her nomination, Lorde told Billboard this month, “It’s crazy I’m the only woman in my category, and I feel very proud of that. I’m wearing that mantle for sure. But I’m also stoked that I’m in there with four incredible artists of color — it’s a big moment for the Grammys. It’s exciting when these institutions move in the right way. To me, that is a huge victory.”\n\nRead the full excerpt from the poem below:\n\nRejoice! Our times are intolerable. Take courage, for the worst is a harbinger of the best. Only dire circumstance can precipitate the overthrow of oppressors. The old & correct must be laid to waste. Before the just can triumph. Contradiction will be heightened. The reckoning will be hastened by the staging of seed disturbances. The apocalypse will blossom.\n\nThis article originally appeared on THR.com.", "images": ["https://www.billboard.com/wp-content/uploads/media/lorde-grammys-red-show-audience-2018-billboard-1548.jpg?w=942&h=623&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.billboard.com/wp-content/uploads/media/lorde-grammys-red-show-audience-2018-billboard-1548.jpg?w=1024", "https://www.facebook.com/tr?id=204652553202666&ev=PageView&noscript=1", "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/public/lazyload-fallback.gif"], "top_img": "https://www.billboard.com/wp-content/uploads/media/lorde-grammys-red-show-audience-2018-billboard-1548.jpg?w=1024", "keywords": [], "authors": ["Sam Reed"], "canonical_link": "https://www.billboard.com/music/awards/2018-grammy-awards-lorde-accessorized-gown-feminist-poem-flask-8096861/", "title": "Lorde Accessorized Her Grammys Gown with Feminist Poem & Flask", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/icons/icon-144x144.png", "msapplication-TileColor": "#eff4ff", "description": "Lorde didn't perform, but she made a loud noise with Jenny Holzer's powerful poem sewn into her gown.", "news_keywords": "2018 grammys, bbnews, Grammys", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "billboard", "pmc-page_type": "article", "articleid": 8096861, "author": "Sam Reed", "pmc-category": "Awards,Music", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-01-29T09:04:36"}, "pmc-tag": "2018 grammys,bbnews,Grammys", "title": "Lorde Accessorized Her Grammys Gown with Feminist Poem & Flask", "pageclass": "article", "pmc-is_free": "no", "pmc-always-paywall": "no", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-exclusive": "no", "pmc-breaking-news": "no", "pmc-prime": "no"}, "generator": "WordPress 6.0.2", "author": "Sam Reed", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Billboard", "application-name": "Billboard", "content_type": "Article", "post_id": 8096861, "title": "Lorde Accessorized Her Grammys Gown with Feminist Poem & Flask", "published_at": "2018-01-29 09:04:36", "image": "https://www.billboard.com/wp-content/uploads/media/lorde-grammys-red-show-audience-2018-billboard-1548.jpg?w=1024", "comment_count": 0, "tags": "Grammys", "topics": "Music", "body": "Though she didn't perform at Sunday night's (Jan. 28) Grammy Awards, everyone was talking about Lorde.     The 21-year-old New Zealander was the only woman nominated for album of the year for her 2017 hit Melodrama — however, of the nominees, she was the only artist that was not asked to perform solo. Outraged fans called out the injustice on Twitter. \"We champion women one award weekend & pull this shit the next,\" wrote Modern Family's Jesse Tyler Ferguson.        We champion women one award weekend & then pull this shit the next. @lorde should be singing from her genius album. #2stepsforward3stepsback https://t.co/UTGjOV2eQK— Jesse Tyler Ferguson (@jessetyler) January 29, 2018[Editor's Note: speaking after the broadcast Billboard Recording Academy President Neil Portnow and Grammys executive producer Ken Ehrlich explained the awkward situation. \"These shows are always a matter of choices, and we know we have a box and the box gets full and filled up,” Ehrlich told reporters. “She had a great album, album of the year is a big honor, but there's no way we can really deal with everybody. Sometimes people get left out that shouldn't, but on the other hand, we did the best we can to make sure that it's a representative and balanced show.\"     Earlier, Lorde reportedly declined an offer to perform as part of a of a group tribute to Tom Petty involving his song “American Girl,” though she did take the stage Friday night to cover Fleetwood Mac’s “Silver Springs” at the pre-Grammys MusiCares Person of the Year.]But while Lorde didn't take the stage to share her message during the Grammys broadcast, the singer-songwriter still managed to make her voice heard once inside Madison Square Garden (she noticeably skipped the red carpet), affixing a poem by conceptual artist Jenny Holzer to the back of her fluffy tulle Valentino gown.  My version of a white rose — THE APOCALYPSE WILL BLOSSOM — an excerpt from the greatest of all time, jenny holzer ----A post shared by  Lorde (@lordemusic) on Jan 28, 2018 at 6:09pm PST\"My version of a white rose — THE APOCALYPSE WILL BLOSSOM — an excerpt from the greatest of all time, jenny holzer,\" wrote Lorde on Instagram, referencing the white roses worn by a handful of men and women on the carpet to show solidarity with the Time's Up movement. \"The old & correct must be laid to waste,\" reads the excerpt. \"Before the just can triumph. Contradiction will be heightened. The reckoning will be hastened by the staging of seed disturbances. The apocalypse will blossom.\"But Lorde didn't let the controversy dampen her mood. Once inside the venue, she pulled a Rihanna, reaching for a flask that just happened to perfectly match the vibrant red hue of her gown. Because sometimes a little booze is needed to take the edge off the patriarchy.Big mood: @lorde clapping with her flask #GRAMMYs #Grammys2018 pic.twitter.com/PsuauoKuWk— satan (@mega_intense) January 29, 2018Lorde's mother, the NZ poet Sonja Yelich, shared her thoughts on her daughter’s apparent snub with a Twitter post, highlighting a New York Times article which addressed gender inequality among Grammy winners.this says it all -@nytimes January 26, 2018 pic.twitter.com/R3YdHwieXf— Sonja Yelich (@sonjayelich1) January 26, 2018Of her nomination, Lorde told Billboard this month, \"It’s crazy I’m the only woman in my category, and I feel very proud of that. I’m wearing that mantle for sure. But I’m also stoked that I’m in there with four incredible artists of color — it’s a big moment for the Grammys. It’s exciting when these institutions move in the right way. To me, that is a huge victory.\"Read the full excerpt from the poem below: Rejoice! Our times are intolerable. Take courage, for the worst is a harbinger of the best. Only dire circumstance can precipitate the overthrow of oppressors. The old & correct must be laid to waste. Before the just can triumph. Contradiction will be heightened. The reckoning will be hastened by the staging of seed disturbances. The apocalypse will blossom.This article originally appeared on THR.com.", "fb": {"pages": 75791669580}, "fragment": "!", "og": {"type": "article", "title": "Lorde Accessorized Her Grammys Gown with Feminist Poem & Flask", "url": "https://www.billboard.com/music/awards/2018-grammy-awards-lorde-accessorized-gown-feminist-poem-flask-8096861/", "description": "Lorde didn’t perform, but she made a loud noise with Jenny Holzer’s powerful poem sewn into her gown.", "site_name": "Billboard", "image": {"identifier": "https://www.billboard.com/wp-content/uploads/media/lorde-grammys-red-show-audience-2018-billboard-1548.jpg?w=1024", "width": 1024, "height": 677, "alt": "Lorde, 2018"}, "locale": "en_US"}, "article": {"published_time": "2018-01-29T14:04:36+00:00", "modified_time": "2018-01-29T15:09:04+00:00"}, "twitter": {"site": "@billboard", "card": "summary_large_image", "title": "Lorde Accessorized Her Grammys Gown with Feminist Poem & Flask", "description": "Lorde didn't perform, but she made a loud noise with Jenny Holzer's powerful poem sewn into her gown.", "image": "https://www.billboard.com/wp-content/uploads/media/lorde-grammys-red-show-audience-2018-billboard-1548.jpg?w=1024"}}, "movies": [], "publish_date": 1517234676.0, "source": "https://www.billboard.com", "summary": ""}