{"url": "www.washingtonpost.com/news/the-fix/wp/2017/10/18/trumps-alleged-knew-what-he-signed-up-for-remark-to-military-widow-is-worth-caution-but-fits-a-clear-pattern/", "text": "Gift Article Share\n\nUpdate: Sgt. Johnson's mother, Cowanda Jones-Johnson, has now spoken with The Washington Post, and she says Wilson's account is accurate. \"President Trump did disrespect my son and my daughter and also me and my husband,\" Jones-Johnson said. She said she was in the car at the time but declined to elaborate on the specifics of Wilson's claim.\n\nA Democratic congresswoman says she was in the car with the widow of a soldier killed in Niger when President Trump made comments that upset the widow. Rep. Frederica S. Wilson (Fla.) says Trump told Myeshia Johnson that her husband, Sgt. La David T. Johnson, “knew what he signed up for.” Appearing on MSNBC's “Morning Joe” on Wednesday, Wilson added that the widow was in tears after the call and lamented that Trump “didn't even remember his name.”\n\nAnd Trump has now hit back at the congresswoman, saying he has “proof” that her account is wrong.\n\nAdvertisement\n\nHere's what we can say:\n\nAfter-the-fact accounts can be flawed, and people can hear things in the worst possible way when they come from the mouths of their political opponents. Wilson may be totally honest in what she says, but if she believes Trump is a bad person, her recollection will not be charitable. If Trump has proof that Wilson is wrong, he needs to produce it immediately. The idea that Trump said this is — unfortunately — completely believable, given his track record of handling sensitive situations has ranged from awkward to offensive.\n\nThis is hardly the first time we've seen Trump wrapped up in a dispute involving a Gold Star family. In fact, it's the second day in a row in which Trump's comments about the relatives of dead service members have been at issue. On Monday, he suggested that his chief of staff, retired Marine general John Kelly, had not received a phone call from President Barack Obama after his son's death. White House officials have only elaborated on the matter anonymously.\n\nThe body of Sgt. La David Johnson arrived in Miami on Oct. 17. President Trump called the soldier's family that same day to give his condolences. According to a Florida congresswoman, Trump told Johnson's grieving widow, \"He knew what he signed up for.\" (Video: Monica Akhtar/The Washington Post)\n\nGoing back to the 2016 presidential campaign, Trump showed very little compunction about attacking the Khans, a Gold Star family that criticized him, and publicly questioned the war hero status of Sen. John McCain (R-Ariz.), who was a prisoner of war for seven years in Vietnam. While most politicians treat these matters very, very delicately — or steer clear of them altogether — Trump has repeatedly declined to do so. He has often proactively politicized them.\n\nAdvertisement\n\nThere is a tendency to think that some of this is just Trump being provocative and trying to rile up the media by pushing the boundaries of acceptable and presidential behavior. The simpler — and not mutually exclusive — alternative is that he just doesn't know how a president should act in these instances.\n\nIn this case, we have alleged Trump comments that were never meant for public consumption. If accurately relayed, they were just Trump being careless, not provocative. But they completely track with everything he has done and said publicly about tragedy before. It's not even difficult to imagine Trump saying these things at a lectern in the Rose Garden.\n\nSo again, it's worth waiting to see what “proof” Trump produces. But the benefit of the doubt went out the window a long time ago, and Trump has himself to blame.\n\nGiftOutline Gift Article", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=http://img.washingtonpost.com/rf/image_960w/2010-2019/WashingtonPost/2017/09/01/National-Politics/Images/Trump_72591-e943d.jpg&w=1440"], "top_img": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://img.washingtonpost.com/rf/image_960w/2010-2019/WashingtonPost/2017/09/01/National-Politics/Images/Trump_72591-e943d.jpg&w=1440", "keywords": [], "authors": ["Aaron Blake", "Staff Writer"], "canonical_link": "https://www.washingtonpost.com/news/the-fix/wp/2017/10/18/trumps-alleged-knew-what-he-signed-up-for-remark-to-military-widow-is-worth-caution-but-fits-a-clear-pattern/", "title": "Trump’s alleged ‘knew what he signed up for’ comment to widow is worth caution, but fits a clear pattern", "meta_data": {"description": "Rep. Frederica S. Wilson says Trump told the widow that her husband “knew what he signed up for.\"", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/the-fix/wp/2017/10/18/trumps-alleged-knew-what-he-signed-up-for-remark-to-military-widow-is-worth-caution-but-fits-a-clear-pattern/", "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://img.washingtonpost.com/rf/image_960w/2010-2019/WashingtonPost/2017/09/01/National-Politics/Images/Trump_72591-e943d.jpg&w=1440", "title": "Analysis | Trump’s alleged ‘knew what he signed up for’ comment to widow is worth caution, but fits a clear pattern", "description": "Rep. Frederica S. Wilson says Trump told the widow that her husband “knew what he signed up for.\""}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Analysis | Trump’s alleged ‘knew what he signed up for’ comment to widow is worth caution, but fits a clear pattern", "description": "Rep. Frederica S. Wilson says Trump told the widow that her husband “knew what he signed up for.\""}, "last_updated_date": "2021-11-25T13:55:12.264Z", "article": {"published_time": "2017-10-18T13:08:14.000Z", "modified_time": "2021-11-25T13:55:12.264Z", "section": "The Fix", "content_tier": "metered"}, "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1", "next-head-count": 70, "apple-itunes-app": "app-id=352509417, app-argument=https://www.washingtonpost.com/news/the-fix/wp/2017/10/18/trumps-alleged-knew-what-he-signed-up-for-remark-to-military-widow-is-worth-caution-but-fits-a-clear-pattern/"}, "movies": [], "publish_date": 1508281200.0, "source": "http://www.washingtonpost.com", "summary": ""}