{"url": "https://www.bustle.com/p/sanaa-lathan-shaved-her-head-for-nappily-ever-after-it-let-her-embrace-her-natural-hair-like-never-before-11968532", "text": "Over the course of her 20-year career, Sanaa Lathan has transformed herself to play many different roles. Yet while she became an athlete for Love & Basketball and a cop for Shots Fired, she's never had to do anything quite like what her newest film demanded of her. Lathan shaved her head for Nappily Ever After, streaming on Netflix now, and the change pushed her to embrace her natural hair in a way she hasn't been able to before.\n\n\"It definitely changes your relationship with yourself and how you feel walking around in the world and it makes you — or at least it made me — kind of re-think my beliefs about myself, about beauty, about what I expect from other people and how they think about me,\" Lathan tells Bustle over the phone.\n\nThe actor may have only shaved her head for the movie, but as she explains, her new hairstyle affected her real sense of self. And a year later, with Lathan now rocking what she calls a \"teeny weeny afro,\" the effects are still ongoing. \"There's been a lot of inner soul searching that's happened in the past year, and I really think a lot of it has to do with this new thing — this physical thing,\" she says.\n\nTina Rowden / Netflix\n\nWhen Lathan first signed on to Nappily Ever After years ago as both actor and producer, she \"[didn't] think that I would actually shave my head. I thought that maybe we were gonna do something, kind of like a smoke and mirrors thing, with a prosthetic bald cap.\" But, after sitting with the character for a few years and dealing with what she calls \"hair exhaustion\" — years of intense worrying about her hair — Lathan realized she just wanted to let it all go.\n\n\"I've been an actress in this business forever, and obviously, a woman forever,\" she explains. \"The whole hair journey of being an actress and being a black woman with very thick, kinky hair — it can get exhausting sometimes.\"\n\nTo film the heart-wrenching scene in which Lathan's character, Violet Jones, shaves her head after a bad breakup and drunken night out, the actor was first given a wig so she could practice — \"I'd never used clippers!\", she explains. But when it was time for the real thing, she stood in front of a camera and shaved every hair off of her head. \"It was really emotional,\" she recalls. \"I didn't decide anything that I was gonna do as the character or portray as Violet during the scene. I just kind of let everything happen and was just kind of blown away by how many emotions I went through.\" And as emotionally difficult as the experience was, the actor says \"it was kind of life changing.\"\n\nTina Rowden / Netflix\n\nIn Nappily Ever After, Violet is a successful businesswoman who grew up equating straight hair with perfection. Every morning, she straightens her hair and puts on makeup so she can look perfect when her boyfriend, Clint, wakes up. It's a narrative that, unfortunately, Lathan says she used to relate to. When she was first starting out in the industry in the mid-'90s, the actor explains, there was an expectation for black women to change their hair to be, for a lack of a better term, more white.\n\n\"You were kind of always getting the message over and over again, especially as an actress, that you wouldn't work if you were having your own natural hair,\" Lathan says. \"Like how many times did I, even if I pressed it, and even if I did a blowout... I would get the feedback, several times, 'Oh, can she have her hair more look like this girl?' And that girl would have like, long straight hair, or she would have a long weave.\"\n\nThis constant negativity around her hair affected how the actor saw herself. \"You can't work with your natural hair, and then you're not as beautiful with your natural hair,\" she recalls feeling. Now, however, she sees that things are starting to change, even in her own career. After filming Nappily Ever After, Lathan booked a role on Season 4 of Showtime's The Affair, a role she was ready to wear a wig for. She did two screen tests, one with a long, straight wig, and one with her natural hair, which was just starting to grow back in. \"And I just asked the crew, and that day happened to be crew of mainly men, and I just knew they were gonna say 'We like the long hair,'\" Lathan remembers. \"And they were like, 'Oh no, we like your short hair much better, your natural hair looks really good.'\" So that's what she went with.\n\nIt's one of only a handful of times the actor has been on screen with natural hair — others include her breakout in Love & Basketball and, of course, Nappily Ever After. Different parts call for different hairstyles, and it's likely that, sooner or later, Lathan will choose to wear a wig for a part in the future. But ideally, it will be because the character calls for it, not because Hollywood has deemed her own natural hair to be somehow undesirable.", "images": ["https://imgix.bustle.com/uploads/image/2018/9/19/7b3fb908-f7bd-4ab5-ac0c-74aae18c4295-nappily_ever_after.jpg?w=414&h=276&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2018/9/19/06041b96-80ad-4a62-8c34-f5ec7880faaa-nea_unit_09563_r.jpg?w=414&h=276&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2018/9/19/9193bb25-9ad9-4c1c-92bc-d5c548a19ea8-nea_unit_05196.jpg?w=800&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/10/3/5e832f56-7962-4c2d-a9d3-ee0f0d5043c7-mean-girls-day-october-3.webp?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/9/27/70e63706-f2da-49ee-99fd-46732dc30604-bustlebooth_teaser.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/9/26/5ff0fbf6-d823-4ca6-8a57-c2d23e1bbe0c-28-hilaryswank-teaser.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2022/9/28/d37ffda8-d965-4fe0-84cc-33458387286c-gettyimages-1373943961.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2018/9/19/9193bb25-9ad9-4c1c-92bc-d5c548a19ea8-nea_unit_05196.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/9/19/9193bb25-9ad9-4c1c-92bc-d5c548a19ea8-nea_unit_05196.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/sanaa-lathan-shaved-her-head-for-nappily-ever-after-it-let-her-embrace-her-natural-hair-like-never-before-11968532", "title": "Sanaa Lathan Shaved Her Head For 'Nappily Ever After' & It Let Her Embrace Her Natural Hair Like Never Before", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image", "creator": "@iwatchiam"}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/sanaa-lathan-shaved-her-head-for-nappily-ever-after-it-let-her-embrace-her-natural-hair-like-never-before-11968532", "type": "article", "title": "Sanaa Lathan Shaved Her Head For 'Nappily Ever After' & It Let Her Embrace Her Natural Hair Like Never Before", "description": "Over the course of her 20-year career, Sanaa Lathan has transformed herself to play many different roles. Yet while she became an athlete for Love & Basketball and a cop for Shots Fired, she's never had to do anything quite like what her newest film…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/9/19/9193bb25-9ad9-4c1c-92bc-d5c548a19ea8-nea_unit_05196.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "Over the course of her 20-year career, Sanaa Lathan has transformed herself to play many different roles. Yet while she became an athlete for Love & Basketball and a cop for Shots Fired, she's never had to do anything quite like what her newest film…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}