{"url": "en.wikipedia.org/wiki/Sofia_Richie", "text": "American model and fashion designer\n\nSofia Richie (born August 24, 1998)[1] is an American social media personality, model, and fashion designer.[2] She has been featured in campaigns by a number of major brands including Tommy Hilfiger, Michael Kors, and Adidas.[3] She is the youngest daughter of singer Lionel Richie and sister of television personality Nicole Richie.[4]\n\nEarly life [ edit ]\n\nSofia Richie was born in Los Angeles, California to parents Lionel Richie and his second wife Diane Alexander. She is the younger sister of Nicole Richie and Miles Richie.[1] Sofia Richie's godfather was singer Michael Jackson. She reported that the visits to Jackson's Neverland Ranch were some of her favorite memories as a child, and she became close friends with his daughter, Paris.[5]\n\nRichie grew up with an affinity for music like her father. She learned to sing at age five and play the piano at age seven.[6] She made occasional appearances at her father's shows[5] and took vocal lessons from vocal coach, Tim Carter, when she was 14, as well.[6] She also worked in the studio with her brother-in-law (and Good Charlotte lead vocalist) Joel Madden.[7][6] She decided to move away from a music career, however, because of the pressure of living up to her father's stature in the music industry.[8] She made several appearances in her sister Nicole's reality television series Candidly Nicole in 2014.[9]\n\nRichie spent some time at Oaks Christian School—nicknamed \"Celebrity High\"—before being educated at home for several years while her father was on tour. She played soccer until age 16 when she broke her hip in a Segway accident.[8]\n\nCareer [ edit ]\n\nModeling career [ edit ]\n\nRichie began modeling at age 14 with a feature in Teen Vogue[7] and at 15 she got her first fashion contract with Los Angeles-based swimwear company Mary Grace Swim.[10] The next year, Richie signed with London-based modeling agency Select Model Management.[11] In 2014, Richie was featured on Who What Wear and NationAlist Magazine, and teamed up with Teen Vogue and Olay for that year's \"Fresh to School\" online campaign. In early 2015, she appeared in editorials for Elle Girl, Nylon, Dazed, Fault, Unleash'd and Love Culture.[12]\n\nShe made her runway debut in February 2016 at the American Heart Association's Go Red For Women Red Dress Collection fashion show during New York Fashion Week.[13][14] Richie has since walked the runway for Chanel,[15] Jeremy Scott, Philipp Plein, Kanye West's Yeezy line, Samantha Thavasa and Dolce & Gabbana. Richie has featured in advertising campaigns for a number of brands including DL1961,[16] Madonna's Material Girl line,[5] Jacquie Aiche,[17] Adidas, Michael Kors,[19] PrettyLittleThing[20] and Tommy Hilfiger.[21] She has appeared in editorials for Tings,[22] Elle, Seventeen[23] and Vanity Fair.[8]\n\nRichie has graced the covers of numerous international fashion magazines, including Mexico's InStyle;[24] US' Complex,[8] Cosmopolitan[25][26] and Billboard magazine's style issue,[6] Sweets! Magazine, Manifesto, Galore,[27] Remix,[28] Dujour and Es Magazine; UK's Cosmopolitan,[29] Tatler and Asos Magazine;[30] Japan's Vogue and Popular;[31] Brazil's L'officiel;[32] and Singapore's L'Officiel.[33]\n\nFashion design career [ edit ]\n\nRichie teamed up with Frankie's Bikinis to launch a colorful swimwear collection, released on July 8, 2019 by Francesca Aiello.[34][35] The collection included tie-dye bathing suits, neon colors and bright florals.[36] Richie designed a clothing collection called \"Sofia Richie x Missguided\" for UK-based retailer Missguided, which was released on September 17, 2019.[37] The 60-piece collection included tailored pieces, mini dresses and classic coordinating sets, and all the items were priced between $20 to $100.[38] In February 2020, she released a collaboration titled \"Rolla's x Sofia Richie\" with denim brand Rolla Jeans.[39][40]\n\nIn March 2020, she announced her plans to launch a line of swimwear later that year.[41][42] Richie wants to eventually expand her collection into a fashion line and launch a beauty company focusing on hair and body.[42][43] In May 2021, Richie teamed up with her sister Nicole's lifestyle brand House of Harlow 1960 and launched a clothing collection Sofia Richie x House of Harlow 1960.[44] It was a 57-piece line sold at Revolve's online store.[45] In July 2021, she created a capsule collection with 8 Other Reasons consisting of 61 pieces, including jewelry, anklets, bucket hats, tops, metal bags, rings, scarves and eyewear.[46] Her clothing collection with Macy's brand Bar III was released in November 2021. The collection was priced from $39.50 to $149.50.[47]\n\nRichie in February 2017\n\nSocial media [ edit ]\n\nRichie endorses products such as beauty and wellness on Instagram. She has partnered with numerous brands, including Darya Hope, Lulus,[48] Suspicious Antwerp,[49] Nip + Fab,[50] Coca-Cola Zero Sugar, Cotton On and Cheetos.[51]\n\nPersonal life [ edit ]\n\nRichie was in a relationship with Justin Bieber from August to December 2016.[52][53] Richie began dating media personality Scott Disick in May 2017.[54][55] The couple confirmed their relationship in September 2017 and had an on again, off again relationship until August 2020.[56][57][58][59][60] Disick is 15 years older than Richie, for which they received criticism.[61] As of April 2021, Richie has been in a relationship with music executive Elliot Grainge,[62][63] the son of Lucian Grainge, the chairman and CEO of Universal Music Group.[64] On April 20, 2022, she announced her engagement to Grainge on her Instagram.[65]\n\nFilmography [ edit ]\n\nTelevision roles Year Title Role Notes 2014 Candidly Nicole Herself 3 episodes 2016 Red, White and Bootsy TV movie 2019 Flip It Like Disick Episode: \"The Race to Finish\" Keeping Up with the Kardashians Episode: \"Three's Company\"\n\nFilm roles Year Title Role Notes 2018 Ocean's 8 Herself Cameo", "images": ["http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Sofia_Richie_by_Eric_Longden_1.jpg/220px-Sofia_Richie_by_Eric_Longden_1.jpg", "http://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/5/5d/Sofia_Richie_by_Eric_Longden_1.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Sofia_Richie_by_Eric_Longden_3.jpg/150px-Sofia_Richie_by_Eric_Longden_3.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/5/5d/Sofia_Richie_by_Eric_Longden_1.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Sofia_Richie", "title": "Sofia Richie", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/5/5d/Sofia_Richie_by_Eric_Longden_1.jpg", "width": 640, "height": 579}, "title": "Sofia Richie - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}