{"url": "http://womenfashiontrends.info/seeing-double-kate-middleton-sports-similar-coat-dresses-in-belgium/", "text": "If it ain’t broke, do not fix it!\n\nIt appears Duchess of Cambridge Kate Middleton is adhering to that mantra considering she’s been on a coat gown kick for the previous 2 days. Ever the stylish attire recycler, the royal marched on Sunday in Belgium sporting the Alexander McQueen coat gown she initially used at child Princess Charlotte’s christening in 2015.\n\nA day later on, the mom of 2 is back in the shape, rocking a brand-new coat gown by Catherine Walker with a print decorating the hem. The Melrose coat retails for approximately $8,571. Her ruffled fascinator likewise made its launching on Monday and style blog sites think the style is by Jane Taylor.\n\nMiddleton invested the day with her hubby, Prince William, at Tyne Cot cemetery, where more than 5,000 World War I servicemen are buried. The couple consulted with Commonwealth War Graves Commission interns, who usually share stories of the buried servicemen with visitors.During their journey, the Duchess of Cambridge took a minute to lay a posey at the Grave of the Unknown Soldier while Prince William recited the engraving on the tomb, “A Soldier of The Great War Known Unto God.”\n\nTheir see becomes part of continuous celebrations prepared to mark the centenary of the Battle of Passchendaele.", "images": ["https://womenfashiontrends.info/wp-content/uploads/2018/05/rs_600x600-170731080636-600.kate-middleton.cm_.731117.jpg", "https://womenfashiontrends.info/wp-content/uploads/2018/05/071217-ariana-grande-lead-150x150.jpg", "https://womenfashiontrends.info/wp-content/uploads/2018/05/47573F2500000578-0-image-a-1_1513294339371-150x150.jpg", "https://womenfashiontrends.info/wp-content/uploads/2018/05/636360508276536993-EPA-GERMANY-BRITAIN-ROYALTY-150x150.jpg"], "top_img": "https://womenfashiontrends.info/wp-content/uploads/2018/05/rs_600x600-170731080636-600.kate-middleton.cm_.731117.jpg", "keywords": [], "authors": [], "canonical_link": "https://womenfashiontrends.info/seeing-double-kate-middleton-sports-similar-coat-dresses-in-belgium/", "title": "SEEING DOUBLE! KATE MIDDLETON SPORTS SIMILAR COAT DRESSES IN BELGIUM – Women Fashion Trends", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "max-image-preview:large", "google-site-verification": "k36Htp7_YXtuH6W0yalRoPLR3ZYr702MIAG9FYArF5o"}, "movies": [], "publish_date": 1527809694.0, "source": "http://womenfashiontrends.info", "summary": ""}