{"url": "https://web.archive.org/web/20220901171157/https://www.thetalko.com/25-behind-the-scenes-secrets-of-13-reasons-why/", "text": "13 Reasons Why pushes the envelope on teen drama in ways that most other shows have feared to tread. Why? Because it deals with the consequences of a teenager who gets in deep trouble. The lead character, Hannah Baker, chooses a controversial escape from reality. Two weeks after those closest to Hannah lose her, a classmate by the name of Clay goes out to his porch and discovers a box. When he opens it, he finds a series of recordings that Hannah made, which provide 13 reasons why she decided to walk away from everyone who loved her.\n\nBy playing the recordings, Clay discovers that something he did pushed Hannah over the edge. The show — based on a popular young adult novel — offers a heart-wrenching look into the inner struggles that many teens endure. Aside from loss, the show also tackles other things, like bullying and troubled relationships. But as complicated and emotionally devastating as the series can be, it also has a lot of behind-the-scenes secrets that have remained a mystery during the show's 13-episode first season. So, before you start binging on this show in preparation for the second season, here are some tidbits that fans might not be aware of.\n\nTHETALKO VIDEO OF THE DAY\n\n25 Hannah Baker Is Not Perfect, According To The Director\n\nMedium.com\n\nAccording to Jay Asher, the author of the novel Thirteen Reasons Why, Hannah Baker is not perfect. In the last episode of season one, Hannah met with Mr. Porter, who's her school's guidance counselor. Clearly, the conversation the two have about depression and about having negative thoughts didn't dissuade Hannah from being so distraught. Shortly after she left his office, she sadly chooses what she believes is the only way out of her situation.\n\nAsher points out that \"Hannah's an imperfect person\".\n\nAs viewers get the bigger picture with each episode, they realize that Hannah could have reached out to the people who loved her, but she didn't\n\n. Asher noted that Hannah did everything to push people to the side, so no one actually realized what had happened to her until it was too late. In some ways, he felt as though Hannah had set Mr. Potter up to fail because she knew what she was going to do even before she walked in to talk to him.\n\nIn the end, you might ask yourself, did she really do everything she could to get some help? According to Asher, the answer to that would be no. There were other venues she could have explored before deciding to escalate things in such a sad way.\n\n24 Katherine Langford Thinks Hannah Baker Could Have Handled Things Differently\n\nWallpaperSite.com\n\nBeautiful actress Katherine Langford plays Hannah Baker, and when it comes to her character's decision to walk away from this earth, she simply can't see her point of view. Langford admits that she would have handled things a lot differently in her place. She also believes that the fault may lie in the fact that Hannah wasn't really in touch with her own feelings, but that if she had been able to express the way she was feeling, then things would have turned out a lot better.\n\nAdmittedly, those who have watched the series or read the book can appreciate the devastating circumstances Hannah had gone through. After all, it wasn't like she woke up one day and decided she couldn't cope with life. The trauma she had experienced brought understandable shame and pain. But the outcome could have been totally different if she had found a way to tackle each and every one of those feelings, much like Langford claims she would have done in Hannah's place.\n\nBut Dr. Rebecca Hedrick, a child psychiatrist at Cedars' Sinai Medical Center voiced her concern in the documentary \"Beyond the Reasons\". She felt that most young people aren't able to verbalize or recognize how they're really feeling, and that was Hannah's biggest obstacle, which led her to do what she did.\n\n23 There Were Mental Health Professionals Present\n\nMashable.com\n\nGiven the nature of the show's premise, it was important to hire mental health consultants to advise producers and writers on how to best go about weaving the intricate storyline. Clinical psychologist Helen Hsu was one of those mental health consultants. Given how Hannah dealt with her trauma and crisis, it became very important for the show's producers to handle everything in an extremely delicate way.\n\nThe biggest concern was that the controversial concept of the show would have led to viewers who were seeing how Hannah coped with her trauma as a cool thing. If that happened, it might have made young viewers follow her example, and that's not what the author of the book or the director of the show wanted.\n\nTo avoid turning something disturbing into something interesting, Dr. Hsu and the others were there to offer any input necessary.\n\nIn the end, the show is more of a cautionary tale, and Hsu asks that because of the mature nature of the subject matter, young people should only watch the show if they're accompanied by an adult. That way if they have any questions, they'll have someone who can guide them better. A grown-up can determine if the show is appropriate for that particular child. In some cases, it may not be.\n\n22 Katherine Langford Had To Watch The Comedy Show, 'The Office' To Put Up With Difficult Scenes\n\nPinterest.com\n\nThe show's heavy material may have been as traumatic to Katherine Langford as it was to her character Hannah Baker. The Australian actress was able to deal with the material she was given like a true professional, but many viewers don't realize that some scenes can be intense because the actor or actress playing a role has to go to a dark place in order to perform perfectly. So while Langford herself may have looked like a real trooper in front of the camera, she was certainly affected by some of the scenes on a real emotional level.\n\nIt's difficult to shrug off the stress and pain that such an intense character can produce, but Langford had her ways of dealing with things too. To cope with the darkness of the show, she told E! News: \"I watched a lot of The Office as a way to handle the bleak scenes.\" Langford also turned to music to provide her some relief.\n\nBut did she buy a Walkman or listen to music on her Smartphone? No. In order to chill with some beats, the first thing she did was get herself an apartment that had a piano in it. She admitted that she probably made a lot of her fellow neighbors very angry when she played her piano at odd hours of the night. But playing those keys and making some music helped her immensely whenever the scenes she filmed started to tear down those emotional barriers.\n\n21 There Were Therapy Dogs On Set\n\nMovieStillsDB.com\n\nThe sheer presence of a pet has a calming effect on some people. It's why some mental health experts are using dogs to treat people who are suffering from anxiety. And on this show, the actors definitely needed a little TLC from their four-legged friends.\n\nTherapy dogs provide a sense of comfort, and since most people can't resist the urge to pet and hug animals, this interaction releases endorphins like oxytocin, which lower depression and lift's people's spirits.\n\nAccording to Glamour, Dylan Minnette, who plays Clay Jensen — the teen who discovers Hannah Baker's cassette tapes — says \"There was a puppy per hour,\" and that \"They really tried to help out. The puppies helped\". The producers felt that it was necessary to have them around, particularly during scenes that were emotionally exhausting. The puppies helped the performers to stay positive and to catch their breath every now and then.\n\nTherapy dogs are both supportive and engaging and help reduce feelings of loneliness, which is something a lot of teenagers (and the actors who play them) can relate to. When you're filming scenes that pack so much emotion, these therapy dogs have the ability to help the actors to remember that their TV roles are just roles and that there are beautiful things in this world.\n\n20 The Whole Cast Would Often Cry After Table Reads, Hugging It Out\n\nPopsugar.com\n\nTable reads are known as read-throughs. Essentially, the actors get together and read the parts before acting out the scene in front of the cameras. This way, if there are any changes to be made, the actors, writers, directors, or producers can go ahead and make them ahead of time.\n\nBut when you're doing a show that tests the limits of everyone's emotional spectrum, it's difficult not to let feelings get the best of you. To that end, when the cast were present during the table read, it wasn't easy to stop themselves from crying. Just ask Devin Druid, who plays a loner high school photographer named Tyler Down.\n\nDruid recalls that in some instances, certain scenes were so difficult to get through. So, after every table read, the cast would all just sit around and cry. Kleenex must have made a lot of money from this crew! But then the actors got up, walked to the middle of the room, and gave each other one huge hug in order to make themselves feel better. This made it a little easier to cope with the scene they were about to shoot. But even with a group hug, Druid admits that there were a lot of feelings some scenes caused which he called scary. Why? Because he felt like the emotions were simply piling up on him.\n\n19 Selena Gomez, Along With Alisa Boe And Tommy Dorfman, Got Semicolon Tattoos\n\nNews.sumgratitude.com\n\nIn 2013, actress/singer Selena Gomez — along with Tommy Dorfman, who plays Ryan, and Alisha Boe, who plays Jessica — got matching semi-colon tattoos. The tattoos are a symbol of Project Semicolon, a movement intended to promote awareness of mental health issues.\n\nDorfman also wrote on his Instagram that: \"The ';' symbol stands for an end of one thought and a beginning of another. Instead of a period, authors use the semicolon to continue a sentence. For us, it means a beginning of another chapter in life.\"\n\nSince Dorfman can relate to the struggles teens have endured, he wanted everyone to know that it's important to reach out and get help.\n\nThe project's mission statement is to prevent people from making a tough decision the way Hannah Baker did. It not only provides people who are going through a difficult time with support from their own community, but it provides information and other forms of outside help that can make a difference. The site doesn't just ask for donations, but also provides fundraisers and encourages people to participate in different areas of the world. They claim to have helped 5.2 million people since 2013.\n\nSince 13 Reason Why provides a flood of emotions, it's important to remember that there's help out there. The project offers inspiration and hope to those who feel they've lost their way and as the site itself says, \"Your story isn't over yet.\"\n\n18 Speaking Of Selena, She Was Supposed To Be On The Show\n\nTheexpresstribune.com\n\nBefore Katherine Langford took on the role of Hannah Baker, there was another actress who was supposed to play her. The role would have gone to Selena Gomez, who, as you know, has the semicolon tattoo for Project Semicolon.\n\nThe singer/actress was dedicated to taking on the role for almost a decade before the show began production. This was when Jay Asher was trying to adapt his book into a film, and Gomez was going to star in it.\n\nWhen the movie idea eventually converted into a Netflix series, Asher, the production team, and even Gomez herself decided that she was way too famous for the role, according to Cosmopolitan. But had the movie made it to the big screen, Gomez's July Moon Productions would have been behind its inception.\n\nAnother reason Gomez never took on the role was the fact that at the time, Asher claimed on his blog post that selling the rights to his book so it could be turned in to a movie made him uneasy, and he felt that he didn't need his book turned into a movie to be satisfied as a writer. So that was that, however, Selena Gomez did stay on as an executive producer of the show.\n\n17 Many Of The Actors Didn't Read The Book\n\nSecuritysolutionny.wordpress.com\n\nKatherine Langford had one advantage over the other lead actors on the show. She actually read the original book before production of the show began. The 2007 young adult novel was a bestseller. But neither Langford nor Dylan Minnette, who played Clay Jensen, took the time to read the book before the audition.\n\nThe reason they didn't read the book was that they felt that it would have added unnecessary pressure to the way they wanted to portray the roles during their audition; well, it turns out that their judgment call was spot on because it helped them to land the lead roles.\n\nLike any novel that's been turned into a movie or a show, there are some subtle differences, and the actors wanted to treat the new series as something completely new. Of course, as we mentioned earlier, Langford did read it once she won the role.\n\nAccording to an interview with Radio Times, Dylan Minnette mentions that there are differences between his character in the book versus the show. \"I will say, particularly in Clay’s case, [in the book] he listens in one night to all the tapes. In the show he listens to the tapes in the course of like a week-and-a-half, two weeks. There’s a lot more to Clay in the show than in the book.”\n\n16 Katherine Langford Was Cast Via Skype\n\nPinterest.com\n\nUnlike some of her other co-stars, Katherine Langford, who's a native of Perth, Australia, was on the other side of the globe when the production team began looking for an accomplished actress to take on the role of Hannah Baker. The role itself proved to be quite challenging, as it called for a lot of dramatic scenes, and the lead character would have to face some horrible events. It's perfectly reasonable to understand how Langford would have been nervous to have to read out her lines via Skype. It's not exactly the way most actors and actress intend to get a role, but it worked.\n\nThis was Langford's first lead role and she never expected to be cast using Skype. Another interesting trivia fact was that she didn't even get to meet the producers of the show face to face, at least not right away. She also didn't get to meet any of her cast mates either. She did, however, get a chance to Skype with Dylan Minnette while she was still in Perth and he was in Northern California. Right away, she realized that she and Minnette would have a great working relationship, according to Deadline. \"As for the rapport, I felt like it was an easy thing to build. We get along so naturally and so easily,\" said Langford.\n\n15 Dylan Minnette Chose The Posters You See In Clay's Bedroom\n\nNetflix.com\n\nYou can thank Dylan Minnette for the way Clay's room looks, particularly the posters. Minnette had a chat with showrunner Brian Yorkey about what type of songs should be used on the show's soundtrack and Yorkey was very open to it. The collaboration actually helped the show pick which posters to place on Clay's bedroom wall. So now when you look at an episode that shows Clay's room you'll find posters of some of Minnette's favorite bands like Bon Iver, The Shins, The Cure, and even a few posters of Arcade Fire.\n\nAccording to PopSugar, Minnette admits that there are other artists he would love to have, but that he doesn't necessarily feel that it would be the kind of music that would fit his character Clay's personality.\n\nOne thing he did want was to ensure that the room had the appropriate vibe to it.\n\nMinnette certainly feels that the show was designed in such a way that it doesn't come off as dated. Yes, the music is modern and hip and takes place in a high school, but Minnette feels that the show has provided an environment that allows adults to relate to the series just as much as young people do. \"Everyone can connect to it, either by sight or by sound. They connect to it somehow, and feel involved,\" he said.\n\n14 Some Of The Shots Were Filmed At a Real School, Others Scenes Got Shot Inside A Replica\n\nNetflix.com\n\nIn the States, school is out for the summer, unless you happen to go to summer school. But for the most part, this serves as a major advantage for Hollywood because it allows producers of shows like 13 Reason Why to film at an actual school full of teen drama.\n\nBoth the interior and exterior shots are seen on the show are from an actual high school located in Northern California, according to Seventeen Magazine. This is perfect during the summer because the school is virtually empty, so the series doesn't have to deal with any interruptions by the actual students, faculty, or the parents when they come to pick up their real-life kids from school.\n\nUnfortunately, the show ran into a bit of a snag when classes began in the fall. But using a bit of Hollywood magic, the production team was able to overcome this obstacle. Since the real school was no longer an option, the show decided to build a replica of the hallways and classrooms inside a warehouse. According to Hannah Payne, a UCLA sophomore who got to play Stephanie in two episodes of the series: \"I shot in both locations, and honestly, once you were inside, it was uncanny.\" It just goes to show that when you watch something on the TV, the lines between reality and Hollywood reality blur.\n\n13 There Were Some Evening Scenes That Got Shot At 4 AM\n\nYouTube.com\n\nShooting a scene can be difficult, and not just because of the emotional aspect of the show, but because of scheduling conflicts. The cast and crew's schedules differed during production, so a single scene wound up taking hours. Coordinating with everyone was also pretty difficult. So, in some instances, they had to fake certain nighttime scenes. How? By filming right before sunset.\n\nHannah Payne, who played Stephanie dished the following: \"Sometimes, we'd shoot from four to six in the morning on a summer day because we needed it to look like it was seven o'clock on a fall night.\"\n\nBut 13 Reasons Why isn't the only show that's had scheduling conflicts, but not all of them are because of the cast and crew. Just ask Game of Thrones showrunners David Benioff and Dan Weiss, who had to delay production on season 7 because of issues with Mother Nature.\n\n\"We don't have an air date yet. We're starting a bit later because, you know, at the end of the season, winter is here, and that means that sunny weather doesn't really serve our purposes anymore. We kind of pushed everything down the line so we could get some grim, gray weather even in the sunnier places that we shoot,\" they candidly shared in Refinery 29.\n\n12 The Cast Previously Knew Each Other\n\nNotey.com\n\nHannah Payne may have been seen on the show briefly, but she and Dylan Minnette worked on an NBC pilot called Save Me, when they were both 16. The premise of that show was about a mom who returned to the world of the living with the ability to hear God. Unfortunately, the show didn't get picked up by NBC and the two actors lost touch. But time flies and opportunity knocked on both their doors as a new show was about to cast this duo once again. That's when 13 Reasons Why came along, and they were reunited.\n\n\"We worked together when we had just gotten our drivers' licenses,\" Payne shared with Seventeen Magazine. \"Four years later, I saw his name on the 13 Reasons Why call sheet, and it was like, oh my goodness, what are the odds? It was great to have a reunion when I signed on.\"\n\nTwo other actors who weren't on this show but who knew each other way before they worked together were B.J. Novak and John Krasinski. The two went to high school and even played Little League baseball. Years later they went on to play Ryan and Jim on \"The Office\". So who knows? Maybe Payne could be the Novak to Minnette's Krasinski.\n\n11 Some Characters From The Book Are Missing On The Show\n\nWetpaint.com\n\nWhen the writers of the series decided to turn the book into a television series, the world of 13 Reasons Why expanded beyond author Jay Asher's original concept. No one could've predicted how big this show was going to get, particularly Asher. When you have a season with thirteen episodes, a 288-page book doesn't always provide enough material. That's why the writers added new characters to the mix. \"The new characters help out flesh out this world,\" Payne told Seventeen.\n\nAccording to Hannah Payne, the sophomore who plays Stephanie in just two episodes, Asher gave the show his blessing to add extra plots and details to the series, which included her character, Stephanie.\n\nThis meant that Payne was able to mold and shape this character as she saw fit, but of course, the writers already gave her a few hints on how she should play her.\n\nSo Payne had the honor of playing \"a ditzy take on the typical mean girl,\" who also happens to be best friends with Courtney Crimsen, played by Michele Selen Ang. When Payne first got the script, it described her character as pretty and dumb, which she found funny. Some people would have found playing a character this shallow a bit unsettling, but Payne was cool with it.\n\n10 The Executive Producer Thinks The Shower Scene Is The Most Powerful One\n\nNetflix.com\n\nExecutive producer Brian Yorkey considered the scene where we see Clay crying in the shower as very powerful. The scene happened in episode 5. The soundtrack playing was called \"Thirteen\" and was sung by the late Elliott Smith.\n\nA lot of the issues that Clay has is his difficulty with expressing how he's feeling with others, which was ironically the issue that the character, Hannah Baker had. The scene spoke volumes to many because watching someone crying alone in the shower will tug at anyone's heartstrings. According to Cosmopolitan Magazine, Yorkey felt like he could relate to this particular moment. “This scene is one of the most powerful moments of the show for me because it rings so true to who I was when I was a teenager,” explained Yorkey. “When you have so much going on inside of you and so little ability to share it with anybody.”\n\nBeing a teen can be difficult because you're vulnerable and there are times when you feel as though you just can't win. Plus, you also have to deal with the side effects of physically turning into an adult and coping with mood swings brought on by hormonal changes, which are all factors that are taken into consideration on this show.\n\n9 Alisha Boe Thinks The Show Is Going To Help People Understand Just How Much Tough Experience Can Change A Person\n\nTwitter.com\n\nThe show has been quite a conversation starter because of all the controversy surrounding it. Many think the subject matter glorifies Hannah Baker's decision. But as difficult as viewers have found it to come to grips with Hannah Baker's decision on the show, she wasn't the only one to undergo a life-altering situation. Actress Alisha Boe plays Jessica, who can definitely relate to what Hannah had gone through and how she felt. As a matter of fact, many teens around the world can definitely understand the inner turmoil these two are dealing with.\n\nThe younger people are, the worst they seem to treat one another — but some folks are capable of standing up for themselves.\n\nUnfortunately, that's not always the case with every student. There are a lot of tense moments the go on at a school and even after school. This often leads to unacceptable situations and conflicts that can leave someone feeling belittled. These are feelings that Boe's character Jessica can relate to after experiencing a life-altering situation, which seemingly changed her forever.\n\nAs for Boe, she hopes that viewers will get a deeper appreciation for the effect that their actions have on others because even the slightest thing can lead someone down a path that no one intended for them to go.\n\n8 Katherine Langford Auditioned For More Than One Role\n\nMashable.com\n\nAs you now know, the role of Jessica — a character who would endure a major setback on the show — was played by Alisha Boe. She's now scheduled to be back on TV for an upcoming season that follows her closely. Apparently, there's so much more about Jessica than we could've imagined. But Katherine Langford, who went on to play the lead role of Hannah Baker, had originally tried out for the role too.\n\nLangford admitted to The Daily Telegraph: \"I didn't pick Love, Simon or 13 Reasons Why with any social agenda in mind [but] it is wonderful to see how these have both resonated.\" The Aussie actress has definitely managed to shoot to fame since the Netflix series began. She even earned a Golden Globe nomination for her performance as Hannah.\n\nWhile she was filming 13 Reasons Why, the actress also managed to get a role in the film Love, Simon, which is a coming of age story that also takes place in high school. As far as what she thinks about what teenagers go through, Langford had this to say: \"16, 17, 18 is such a tumultuous time in anyone's life. There are some really excellent stories to be told.\"\n\n7 Christian Navarro Never Drove A Car Before The Show\n\nYahoo.com\n\nChristian Navarro plays the character Tony, and if you've seen the show then you know that he loves to drive a Mustang. He's rough around the edges and seems to be hiding a big secret, which is a constant on the show. There was only one small problem when Christian got the role.\n\nHe's a talented actor, but he actually didn't know how to drive; as soon as he got to Northern California, producers decided to change that.\n\n\"I landed, they took me to a driving lesson, and I said, 'You guys made a mistake here,'\" he told PopSugar. \"But they were very generous and they really wanted me for the role. They got me driving lessons and my license, and now I'm a licensed California driver, much to my dad's horror!\"\n\nAt least Navarro beats out other celebs, some of whom still don't know how to drive like \"Mad Men's\" Vincent Kartheiser. He used to take the LA Metro or the bus in order to get to work. Also, Underworld actress Kate Beckinsale can defeat vampires, but the thought of driving a car is terrifying. This means Navarro definitely got lucky because once the show is over, he'll drive off with a valuable life skill.\n\n6 The Dance Scene At The Winter Formal Took About A Week To Shoot\n\nNetflix.com\n\nOn the show, the Winter Formal is a major back-to-school dance held every year at Liberty High School. You probably feel connected to this moment as most high schools across the world actually feature some sort of dance, festivity or formal. There was a lot that went on in that crucial scene. For example, Clay had to attend the dance after losing a bet with Jeff Atkins. Clay was then manipulated into asking Hannah, who was just sitting on the bleachers minding her own business, to dance with him. The two ended up dancing together for the first time. Meanwhile, Montgomery de la Cruz confronts Courtney Crimsen over a photo of two girls sharing a tender moment. This leads Courtney to spread rumors about Hannah, which sets the stage for more drama as the series progresses.\n\nThe Winter Formal takes place in episode 5, the very same episode where we end up seeing Clay crying in the shower. It turns out that the scene was very complex to film. Why? Because the film crew wanted to shoot the scenes from a variety of angles. They believed that this would allow the viewers to focus more on the various plots that were unfolding during the scene. Unfortunately, this also meant that it took over a week to finish.\n\n5 The Lighting Is Hiding A Secret Meaning\n\nPopBuzz.com\n\nWhen you lose a friend or a loved one, the world can seem as though it's gotten a little darker. Many of us often feel like the world is coming to an end, but then one day, you finally see the light and start to cope with your feelings in a healthy way.\n\nWell, the producers of the series wanted to reflect the pain that goes with losing a loved one, so in the scenes where Hannah is around, the lighting on the set has warmer tones, but when she's no longer around, the scenes tend to show cooler colors, like blue and gray.\n\nAccording to researchers Andrew Elliot and Markus Maier, \"Given the prevalence of color, one would expect color psychology to be a well-developed area. Surprisingly, little theoretical or empirical work has been conducted to date on color's influence on psychological functioning, and the work that has been done has been driven mostly by practical concerns, not scientific rigor.\"\n\nWarm colors like red, orange, and yellow can leave people feeling comfortable. However, darker colors can also have the opposite effect and make people feel indifferent or sad, which is what the show was probably trying to evoke in its viewers when they watched the show.\n\n4 Hannah's Tapes Can Be Found Online\n\nBustle.com\n\nIt's always nice when a show goes out of its way to allow the audience to interact with some of the elements of the show. For 13 Reasons Why, Hannah's tapes, which are found on Clay's porch play a very important role throughout the rest of the season. They allow us to get an inside look into Hannah's head. But the producers wanted to give viewers a more in-depth experience. To that end, they posted Hannah's tape recordings on the show's website. Anyone can listen to them, but given the nature of the show and what Hannah says on the tape, you have to enter your age before you can listen to them.\n\nIf you missed any details of the show, these tapes will clear things up. You'll also feel safe in the knowledge that while those who received a tape were all blamed for doing something to Hannah, your conscience is clear because you know you didn't do anything wrong! The tapes may understandably bring a tear or two because you almost feel like Hannah is a real person. And in a sense, she is because there are a lot of teens who can relate to what Hannah and other lead characters have gone through on the show.\n\n3 Dylan Minnette Knows How To Rock After Work\n\nYoutube.com\n\n\"Wallows\" is the name of the pop-rock music band fronted by the Netflix star of 13 Reasons Why, Dylan Minnette. The band is a trio that consist of Minnette, and his longtime friends Braeden LeMasters, and Cole Preston. The three of them have been friends for over a decade.\n\nMinnette first met LeMasters when they were both nine and Minnette says that they, “shared a love for classic rock music and wrote their funny songs with a day of having our own rock band one day.”\n\nLeMasters also starred on a television series, Men of Certain Age. However, the two stars do not let the television fame influence their band’s success. They are happy with whatever crossover notice they get from Minnette’s current stardom from 13 Reasons Why. Wallows is currently on their first headlining tour across the United States. They are recording songs for their new album and dropping singles like, \"Pulling Leaves Off the Trees\". They sold out venues like \"The Roxy and Troubadour\". Some say that they sound like a mix of \"Weezer and The Strokes\". So, if you don’t see much of Minnette in the second season of 13 Reasons Why, he’s maybe making his own music tapes on the West Coast with his band, Wallows.\n\n2 Bryce Is The \"Mean Guy\", But He Was Also Portrayed As Successful\n\nPopsugar.com\n\nBryce Walker is the twelfth reason why Hannah did what she did. Walker is the co-captain of Liberty High’s football and baseball team. Throughout the season he is shown as the guy everyone wants to be around. \"Mr. Popular\" should be his name. He is always throwing parties and is always surrounded by friends. He comes from a rich family so it kind of hides his true nature and it keeps the audience uncertain of why he did what he did. The writers incorporated Walker's success with his attitude towards others in such a way that it helped make his character more believable.\n\nWalker’s personality traits make it clear to viewers early on that anyone who has been damaged by his actions would be afraid to tell on him because no one would believe them. So that’s why Hannah, Jessica, and others keep quiet. This fact helps Bryce Walker get away with being not so nice in season one of 13 Reasons Why. With season two in development, viewers may get a chance to witness some of the backstory as to why Bryce is the way he is. The show will also introduce his parents too.\n\n1 The Second Season Will Focus On Jessica's Story\n\nOdyssey.com\n\nIf the theme of season one of 13 Reasons Why wasn’t controversial enough for you, then get ready for season two. The new season of the hit show will focus on Jessica Davis’ storyline. Jessica was the second person on the list of tapes that Hannah made. Hannah and Jessica were pushed to become buddies in school. In the process, they became great friends too...at least for a while. After Alex, a new boy, enters the picture, Jessica and Hannah end their friendship because Jessica thought that Hannah was dating Alex too. They never mend their friendship after that, in classic teenage fashion.\n\nSeason one dealt with the loss of someone due to the pressures of being a teen; season two will focus on Jessica’s loss of self without giving consent and her journey of survival.\n\nEven though the subject is heartbreaking, some teenagers and young adults can relate to the loss of innocence at the hands of someone else. With the #MeToo movement making its way across America, the show might pick up on some of that female empowerment, which might boost the show’s rating. Hopefully, Jessica’s story will be as groundbreaking as Hannah’s from the first season. Make sure you see season two of 13 Reasons Why to see if Jessica finally gets heard.\n\nReferences: Cosmo, CNN, E! Online, Psyquiatry, PopSugar, Lithium, Project Semicolon, Elle, Elite Daily, Jay Asher, Radio Times, Deadline, PopSugar, Seventeen, Cinema Blend, The Popular Teen, The Guardian, Daily Mail, Huffpost, Wiki, OK UK, Teen Vogue\n\nShare Share Tweet Email", "images": ["https://web.archive.org/web/20220901171157im_/https://www.thetalko.com/public/build/images/re-logo-full-colored-light.4b543c53.svg", "https://web.archive.org/web/20220901171157im_/https://www.thetalko.com/public/build/images/tv-logo-full-colored-light.8d65e7f9.svg", "https://web.archive.org/web/20220901171157im_/https://www.thetalko.com/public/build/images/bg-logo-full-colored-light.2bae128a.svg", "https://web.archive.org/web/20220901171157im_/https://www.thetalko.com/public/build/images/mm-logo-full-colored-light.53763959.svg", "https://web.archive.org/web/20220901171157im_/https://static1.thetalkoimages.com/wordpress/wp-content/uploads/2018/05/BeFunky-Collage9222-copy.jpg"], "top_img": "https://web.archive.org/web/20220901171157im_/https://static1.thetalkoimages.com/wordpress/wp-content/uploads/2018/05/BeFunky-Collage9222-copy.jpg", "keywords": [], "authors": ["Camilla Villafane"], "canonical_link": "https://web.archive.org/web/20220901171157/https://www.thetalko.com/25-behind-the-scenes-secrets-of-13-reasons-why/", "title": "25 Behind-The-Scenes Secrets Of '13 Reasons Why'", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "robots": "max-image-preview:large", "description": "Just in time as we prep for the second season...", "og": {"title": "25 Behind-The-Scenes Secrets Of '13 Reasons Why'", "type": "article", "image": {"identifier": "https://web.archive.org/web/20220901171157im_/https://static1.thetalkoimages.com/wordpress/wp-content/uploads/2018/05/BeFunky-Collage9222-copy.jpg", "width": 1200, "height": 628}, "url": "https://web.archive.org/web/20220901171157/https://www.thetalko.com/25-behind-the-scenes-secrets-of-13-reasons-why/", "locale": "en_US", "description": "Just in time as we prep for the second season...", "site_name": "TheTalko"}, "article": {"published_time": "2018-05-11T22:00:27Z", "modified_time": "2018-05-11T22:00:27Z", "section": "Entertainment"}, "twitter": {"card": "summary_large_image", "site": "@thetalko", "title": "25 Behind-The-Scenes Secrets Of '13 Reasons Why'", "description": "Just in time as we prep for the second season...", "image": "https://web.archive.org/web/20220901171157im_/https://static1.thetalkoimages.com/wordpress/wp-content/uploads/2018/05/BeFunky-Collage9222-copy.jpg"}, "fb": {"app_id": 1470061169975403}}, "movies": [], "publish_date": 1526076027.0, "source": "https://web.archive.org", "summary": ""}