{"url": "https://people.com/style/emmys-2017-stars-getting-ready/", "text": "The Emmy Awards mark the official kick off to awards season. The biggest stars in television make sure to pull out all the style stops on the carpet. And leading up to the show, celebs tap their army of stylists, makeup artists, estheticians and hair stylists to get them primped and ready to go for biggest night in television. Everyone from Heidi Klum to Oprah can’t help but share behind-the-scenes sneak peeks at what it’s like to get ready for a big awards show, from getting their nails primped to sneaking in a quick facial to look red carpet ready.\n\nOutstanding Lead Actress nominee (she’s also up for Outstanding Drama Series) Elisabeth Moss started her Sunday morning early with celeb-loved skincare specialist Joanna Vargas. The master facialist massaged in a depuffing sheet mask over the actress’s eyes so any dark circles will disappear by the time she hits the red carpet tonight.\n\nWATCH: Fabulous Feathers and Radiant Rainbow Gowns Dominate the 2017 Emmy Awards Red Carpet\n\n“Totally normal Sunday, nothing unusual happening here… 💁🏼 @joannavargasnyc #emmys#handmaidstale,” Moss captioned the photo.\n\nProject Runway host Heidi Klum always loves sharing getting ready Instagram videos with her fans as she preps for shows. So of course, she didn’t hold back for the Emmys. Klum showed off her bare skin at the start of the video, then hyperlapsed through her lengthy glam routine with makeup artist Linda Hay and hair stylist Lorenzo Martin (who used Kenra Professional haircare products to style her locks!).\n\nLooking for more style content? Click here to subscribe to the PeopleStyle Newsletter for amazing shopping discounts, can’t-live-without beauty products and more.\n\nIt’s been nine years since Oprah Winfrey last attended the Emmys, so for her big return tonight, the star’s primped to perfection from head-to-toe. And Winfrey’s all about keeping it real, admitting “it’s a process y’all” on an Instagram shot getting a pedicure. “Now onto the nail and feet thang with @footnanny,” she said.\n\nNot long after, the star sat in the makeup chair getting glam on for the show. Her makeup artist Derrick Rutledge used a light nude pencil to highlight under Winfrey’s brow bones and down the center of her nose. “Let the facebeat begin!” she said.\n\nRELATED PHOTOS: Editors’ Picks! Our Favorite Emmys Gowns Of All Time\n\nThere’s no doubt getting draped in the most expensive jewels is the highlight of the Emmys for many stars, including Sofia Vergara, who showed off her “candy tray” of turquoise, blue and diamond jewelry pieces she’s deciding between tonight.\n\nStranger Things star and nominee Caleb McLaughlin may only be 15 years old, but he’s still a style star years beyond his age. Before hitting the red carpet, the star showed off his dapper purple paisley suit jacket to his fans on Twitter, then posed for a quick photo op with his dad, who’s his date for the evening.\n\n“I’m getting ready for the Emmys. See I haven’t really got my bow tie on yet, but I got the jacket on, the pants, the shoes, yeah. So we’re gonna have time right? And hopefully we get an award!” McLaughlin said.\n\nInstead of simply showing us how she got ready for the Emmys, Black-ishstar Tracee Ellis Ross took a different approach by singing an impromptu song on Instagram about how she got prepped.\n\n“Good morning. Hello. I wanted to do a little song. I have done a mask. I’ve done two. I have hydrated. I’ve shaved. I’ve bathed. I am making a video. Making a video! Cause I wanna be like Titus when I grow up. Black-ish is coming for you Emmys!” she sang.\n\nhttps://www.instagram.com/p/BZJhUPKhuDT/\n\nAfter getting her hair and makeup done, 13 Reasons Why actress Kate Walsh took a moment to show off her silly side with her glam squad’s “Emmy weekend shenanigans.”\n\nIt’s not as easy as you may think to hop into limousine wearing a glamorous designer gown, which Allison Janney experienced on her way to the show tonight.\n\nWatch the full episode of People & Entertainment Weekly Red Carpet Live, streaming now on PeopleTV. Go to People.com/peopletv, or download the app on your favorite streaming device.\n\n“On my way #stuffin‘me in my car,” the star tweeted.\n\nRachel Bloom couldn’t hold back a joke, making fun of all the getting ready photos stars have been sharing on social media. Her biggest red carpet prep starts on the toilet. “My number one step for the red carpet prep is number one. #Emmys,” the Crazy Ex-Girlfriend actress said while sitting on the toilet.\n\nIt takes a village to get Big Little Lies actress Shailene Woodley into her Emmys gown, which her stylist Ilaria Urbinati shared with the world on Instagram.\n\nMakeup artist Fiona Stiles posted a sneak peek at Gabrielle Union‘s hair look for the Emmys tonight. And from the looks of it, the Flawless by Gabrielle Union mogul is keeping her hair big, bold and au naturale.\n\nModern Family actress Sarah Hyland’s been an Emmys regular for years, and looks calm, cool and collected sitting in her kitchen with her “favorite people” getting hair and makeup done before the show.\n\nIf there’s one star we can’t wait to see tonight at the Emmys, it’s Jessica Biel. Hair stylist Adir Abergel posted the star’s hairstyle mid-way through, captioning the photo, “Can’t wait to share the final look with you.”\n\nBut once Biel headed to the carpet, she faced a dilemma in her car: the AC went out! “When the AC is broken en route to the Emmy’s you thank God for the ice in your drank. #emmys” the actress shared as she struggled to stay cool in the L.A. heat.\n\nLea Michele couldn’t hold back her excitement for the show, posting a selfie with her BFF and hair stylist Sarah Potempa and makeup artist Mélanie Inglessis getting her ready for the show by blending in her foundation with the MakeupDrop silicone sponge. “It’s almost time! ✨ #GlamSquad #Emmys,” Michele captioned the photo.\n\nIt looks like Orange Is The New Black star and nominee Uzo Aduba‘s keeping her hair coily and natural, just like Union, but posted a Boomerang on Instagram as she got her brows touched up. “It’s that time, ladies and gentlemen! Follow me as I get ready for the big show!” she said. Only time will tell what her final hair and makeup look will be!\n\nSaturday Night Live comedian Aidy Bryant fuels up on some pre-carpet chips while wearing her romantic long sleeved gown and getting her final touch-ups before the show.\n\nDove celebrity hair stylist Mark Townsend gave Anna Faris‘ textured beachy waves some finishing touches and showed a preview of the backside of actress’ vibrant magenta Marc Jacobs gown featuring flower appliqués.\n\nLaverne Cox showed off her sparkly two-toned nails on Instagram before hitting the red carpet. The OITNB star used two Orly polishes she created with the brand for its new Celebrate Yourself collection, available for purchase now.\n\nWho are you hoping wins big at the Emmys tonight? Sound off in the comments below!", "images": ["https://people.com/thmb/I4rCZAj_L8AwMOYGoschzIgTBlo=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(336x0:338x2)/slack-imgs-1-49f8222f53c64194b671f3674d87d6af.jpg", "https://people.com/thmb/Lje7sGaj3HgeS-yLg9z5JSNPfrU=/300x150/filters:no_upscale():max_bytes(150000):strip_icc()/people_magazine_sub-e6689738996d40f38f154099e1751481.png", "https://people.com/thmb/Rw_0BYzQ3ByR9fzZSqg8WvpjTT4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(797x0:799x2)/stars-getting-ready-met-gala-chrissy-john-2000-48bb3f91f7cd4b06ab04fdd760f39276.jpg", "https://people.com/thmb/V5Euc3fnisdPCkQDXe6sblXGL84=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(374x0:376x2)/img_6053-5ed65819d28f44639a444027d70f9bb7.png", "https://people.com/thmb/Tx4Wn6G_OkjxAslx37lmfhK0mKg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(306x316:308x318)/Kourtney-Kardashian-0e37a631c9c748798850f4d7a9f382e3.jpg", "https://people.com/thmb/O0pSVnHW5jorhXcdgvyUG8z_9Ow=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(605x0:607x2)/kelly-ripa3-8eee2410eea0471796c4e6f2082903fd.jpg", "https://people.com/thmb/dhN9b1i-Rnyt1DkOlqXB6GexkHM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(307x0:309x2)/screen-shot-2020-02-09-at-5.26.13-pm-9456a35f4f2d477d9a7ef7d6c17a8ca5.png", "https://people.com/thmb/8cJmVZc7Ok6w5_4Wwxc14qmMsU4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/people_generic-1885945d8bd544778fbbf4be88a63f00.jpg", "https://people.com/thmb/AzSedHfjvdIsuF9KbqsIvOBI_3c=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/james-corden-2000-69c6de6f98464d1caae46afe4878a1f1.jpg", "https://people.com/thmb/4aWCr7jo9ItVl0L5fjzfApH4dBk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(317x0:319x2)/screen-shot-2019-01-06-at-5.16.11-pm-180d6e3b3d4149a2b40d651034846ee2.png", "https://people.com/thmb/3DqNwERsPslU8BEmFbk7AexyndM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(558x0:560x2)/issaraye-2000-976365687ba745f9a5941a2087eaef31.jpg", "https://people.com/thmb/4mfivRR4naKk2clIHnzFsi5q7pg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(557x611:559x613)/tyra-banks-278b5e5c3e50469585d58d095d9c4d66.jpg", "https://people.com/thmb/DjWMofhLMiV9UEk2yXNlUWzvjPU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(355x41:357x43)/glenn-close-dd08262bbb674a71b999dca1f72f1e5f.jpg", "https://people.com/thmb/q68G3robiaZRgdUdoO7xLisLe8Q=/75x75/filters:no_upscale():max_bytes(150000):strip_icc()/Headshot-2000-ca8c28b4e983413d8ad4635965a0a09e.jpg", "https://people.com/thmb/OKGoryn_smr47aDT5oBCvhfOTTo=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(565x313:567x315)/mandy-moore-d8be13727dc54a96a139bde5518890b4.jpg", "https://people.com/thmb/nvqLlA6XYQOg-WUX-5DCEURmw5k=/1186x1188/filters:fill(auto,1)/sarah-hyland2-570694eba2f94d24850305eb23f95543.jpg", "https://people.com/thmb/8ONZFzyCeurZ1z1vIe-aQ1TT1sc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Jennie-Kim-Black-Pink-New-Hair-ea30d507faee4f70ae6ddb6ac1abf070.jpg", "https://people.com/thmb/vptH5F-EVm_3IG6C4GzPnnazU-E=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(796x0:798x2)/nicole-kidman8-b9a438c867a645a4b2915f1b37545baa.jpg", "https://people.com/thmb/t2bPebfPH2_TEJVfVAtwu4RLz6s=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/jane-fonda-2000-64715fb8d45144b28b38a2bae7e90813.jpg", "https://people.com/thmb/PjhTWgjgv3OCH51Wyt6Vzp98_TY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(310x0:312x2)/screen-shot-2019-02-24-at-6.28.46-pm-966dcf0382b44cef9cebf4588d8863d1.png"], "top_img": "https://people.com/thmb/nvqLlA6XYQOg-WUX-5DCEURmw5k=/1186x1188/filters:fill(auto,1)/sarah-hyland2-570694eba2f94d24850305eb23f95543.jpg", "keywords": [], "authors": ["Kaitlyn Frey", "People Editorial Guidelines"], "canonical_link": "https://people.com/style/emmys-2017-stars-getting-ready/", "title": "Emmy Awards 2017 Stars Getting Ready", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Heidi Klum, Sofia Vergara and more stars share behind-the- scenes photos of how they get ready for the Emmy Awards", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "PEOPLE", "sailthru.author": "Kaitlyn Frey", "revenuegroup": "COMMERCE", "article": {"section": "People", "opinion": "false", "author": "https://www.facebook.com/peoplemag"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "og": {"type": "article", "site_name": "Peoplemag", "url": "https://people.com/style/emmys-2017-stars-getting-ready/", "title": "Emmy Awards 2017 Stars Getting Ready", "description": "Heidi Klum, Sofia Vergara and more stars share behind-the- scenes photos of how they get ready for the Emmy Awards", "image": "https://people.com/thmb/nvqLlA6XYQOg-WUX-5DCEURmw5k=/1186x1188/filters:fill(auto,1)/sarah-hyland2-570694eba2f94d24850305eb23f95543.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "Emmy Awards 2017 Stars Getting Ready", "description": "Heidi Klum, Sofia Vergara and more stars share behind-the- scenes photos of how they get ready for the Emmy Awards", "image": "https://people.com/thmb/nvqLlA6XYQOg-WUX-5DCEURmw5k=/1186x1188/filters:fill(auto,1)/sarah-hyland2-570694eba2f94d24850305eb23f95543.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.19.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.19.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.19.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.19.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.19.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}