{"url": "https://www.theguardian.com/film/2017/nov/23/battle-of-the-sexes-review-emma-stone-steve-carell-billie-jean-king-tennis", "text": "This is a seductively enjoyable, smart and well-acted film based on the most deadly serious sporting contest of modern times: the Battle of the Sexes tennis match of 1973 in a packed Houston Astrodome. It stars Emma Stone and Steve Carell, respectively women’s No 1 Billie Jean King and fiftysomething ex-champ and self-proclaimed “male chauvinist pig” Bobby Riggs – fighting to prove that men are better at tennis and better, full stop.\n\nThe film crucially faces the same challenge as the participants from real life: the challenge of tone. How unseriously should this match be taken? How strenuously should the attitude of casual jokiness be maintained? No one involved in this encounter could be certain of its outcome; neither side could be sure of avoiding humiliation, and thus everyone had a vested interest in keeping it light. Up to a point. But only one side was facing jokiness as a weapon, the same weapon of boorish condescension and toxic bantz that they faced outside the sporting arena every day of their lives. The movie displays the same gracious good humour as its heroine.\n\nIn 1973, King was enraged by the fact that female players on the grand slam circuit were paid a tiny fraction of what the men got, despite pulling in the same number of paying customers. She formed the breakaway Women’s Tennis Association, and having duly punished King with excommunication from their club, the male tennis establishment was quietly scandalised to discover that, far from failing ignominiously, the women were finding support from the American public who rather liked them as rebels and pioneers. They got sponsorship and even some sympathetic press coverage.\n\nThen the sociopathically reckless has-been and Wimbledon veteran Riggs discovered that he was deeply irritated by King’s success, by his own absence from the limelight and by the uppity presumption of what were once known as “women’s libbers”. He challenged King to an exhibition prizefight – in roughly the same spirit that some men today will brayingly challenge you to name five funny women comedians – conceding his own age disadvantage to level the playing field. After some hesitation, King took him on. Sarah Silverman is entertainingly raucous as the women’s promoter Gladys Heldman.\n\nStone has intelligence and candour as King. She is instantly sympathetic and humanly vulnerable; her address to the camera has a cartoony clarity and vigour, a distinctive kind of wide-eyed openness, accentuated by the trademark glasses. (This is surely history’s only premier sports event in which both players have worn glasses.) And her Billie Jean is sensual and vulnerable when she discovers that, despite being married, she is falling in love with a woman: LA hairdresser Marilyn Barnett – another unassumingly excellent performance from Andrea Riseborough.\n\nExcellent performance … Andrea Riseborough, left, as King’s lover Marilyn Barnett. Photograph: Allstar/Fox Searchlight Pictures\n\nAs for Carell, he is the only possible casting for Riggs: the humourless, belligerent guy thinking that he is the life and soul of the party, dressing up in silly costumes. It’s a variation on his David Brent manager Michael Scott from the American TV version of The Office or his weatherman Brick Tamland from Anchorman. And he is that certain kind of middle-aged guy who by wearing shorts makes his buttocks look unsexily gigantic, like barrage balloons. (Brad Pitt did the same thing, wearing unflattering jogging shorts as the fitness-mad General McMahon in the Netflix feature War Machine.)\n\nIn real life, Riggs was supposed to have a skill in lobs and drop shots that would counter King’s hitting power. Yet in acting terms, it’s Stone who is subtly floating shots over the net, and comedy star Carell who is going for the double-fisted line readings and visual laughs.\n\nScreenwriter Simon Beaufoy creates a winning script, smoothly handled by directors Valerie Faris and Jonathan Dayton, although the movie is maybe a little rough on Margaret Court (Jessica McNamee), whose current reputation for reactionary politics has been backdated into the action to make her the obvious unsisterly baddie.\n\nAnd what remains of this argument now? Jimmy Connors won against Martina Navratilova in 1992, at a younger age than Riggs but with rule handicaps. John McEnroe grumbles away at the subject in the present day. But King’s point remains the same: meaningful equality is what she wanted. Nowadays, sport and sports careers are too disciplined and careful to allow for these wacky Barnumesque contests. But pay disparity remains, and not every workplace has access to the Houston Astrodome to put them to the test.", "images": ["https://i.guim.co.uk/img/media/0745d9411b86de1c4e87030e9b7f664e8f85ac16/0_0_5760_3456/master/5760.jpg?width=465&quality=85&dpr=1&s=none", "https://i.guim.co.uk/img/media/0745d9411b86de1c4e87030e9b7f664e8f85ac16/0_0_5760_3456/master/5760.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctcmV2aWV3LTQucG5n&enable=upscale&s=d18f5b11901fdc68d813f91e62c574aa", "https://i.guim.co.uk/img/media/ca66decc1ec9550d1cf856ea3d15887663c8af3b/113_73_1160_696/master/1160.jpg?width=445&quality=85&dpr=1&s=none", "https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Biopics%2CFilm%2CCulture%2CDrama+films%2CTennis%2CSport%2CEmma+Stone%2CSteve+Carell%2CComedy+films", "https://i.guim.co.uk/img/uploads/2018/01/10/Peter_Bradshaw,_L.png?width=300&quality=85&auto=format&fit=max&s=6d421d09a037265190e3742912ce98ca"], "top_img": "https://i.guim.co.uk/img/media/0745d9411b86de1c4e87030e9b7f664e8f85ac16/0_0_5760_3456/master/5760.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctcmV2aWV3LTQucG5n&enable=upscale&s=d18f5b11901fdc68d813f91e62c574aa", "keywords": [], "authors": ["Peter Bradshaw"], "canonical_link": "https://www.theguardian.com/film/2017/nov/23/battle-of-the-sexes-review-emma-stone-steve-carell-billie-jean-king-tennis", "title": "Battle of the Sexes review – Emma Stone aces it in tennis's biggest grudge match", "meta_data": {"description": "Steve Carell is well cast as the ex-champ who tried to prove men’s superiority on court, but Stone calls the shots as women’s No 1 Billie Jean King", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#052962", "og": {"url": "http://www.theguardian.com/film/2017/nov/23/battle-of-the-sexes-review-emma-stone-steve-carell-billie-jean-king-tennis", "image": {"identifier": "https://i.guim.co.uk/img/media/0745d9411b86de1c4e87030e9b7f664e8f85ac16/0_0_5760_3456/master/5760.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctcmV2aWV3LTQucG5n&enable=upscale&s=d18f5b11901fdc68d813f91e62c574aa", "height": 720}, "title": "Battle of the Sexes review – Emma Stone aces it in tennis's biggest grudge match", "description": "Steve Carell is well cast as the ex-champ who tried to prove men’s superiority on court, but Stone calls the shots as women’s No 1 Billie Jean King", "type": "article", "site_name": "the Guardian"}, "article": {"author": "https://www.theguardian.com/profile/peterbradshaw", "publisher": "https://www.facebook.com/theguardian", "modified_time": "2018-12-03T15:16:47.000Z", "section": "Film", "published_time": "2017-11-23T15:30:05.000Z", "tag": "Biopics,Film,Culture,Drama films,Tennis,Sport,Emma Stone,Steve Carell,Comedy films"}, "al": {"ios": {"url": "gnmguardian://film/2017/nov/23/battle-of-the-sexes-review-emma-stone-steve-carell-billie-jean-king-tennis?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287}, "twitter": {"dnt": "on", "app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"googleplay": "guardian://www.theguardian.com/film/2017/nov/23/battle-of-the-sexes-review-emma-stone-steve-carell-billie-jean-king-tennis", "iphone": "gnmguardian://film/2017/nov/23/battle-of-the-sexes-review-emma-stone-steve-carell-billie-jean-king-tennis?contenttype=Article&source=twitter", "ipad": "gnmguardian://film/2017/nov/23/battle-of-the-sexes-review-emma-stone-steve-carell-billie-jean-king-tennis?contenttype=Article&source=twitter"}}, "card": "summary_large_image", "creator": "@PeterBradshaw1", "image": "https://i.guim.co.uk/img/media/0745d9411b86de1c4e87030e9b7f664e8f85ac16/0_0_5760_3456/master/5760.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctcmV2aWV3LTQucG5n&s=a435c84bbf026d255044718de3d597f5", "site": "@guardian"}, "robots": "max-image-preview:large"}, "movies": ["https://www.youtube-nocookie.com/embed/5AWP1K7FaFI?wmode=opaque&feature=oembed"], "publish_date": 1511395200.0, "source": "https://www.theguardian.com", "summary": ""}