{"url": "https://www.cnn.com/2017/09/20/health/ivanka-trump-postpartum-depression-dr-oz/index.html", "text": "Story highlights Ivanka Trump and Jared Kushner have one daughter, 6, and two sons, 3 and 1 Trump described her experience with postpartum depression as \"a very challenging emotional time\"\n\nCNN —\n\nIvanka Trump, daughter of and senior adviser to President Donald Trump, revealed that she had postpartum depression after the births of her children in an interview for “The Dr. Oz Show.” The program, filmed Monday, will air Thursday.\n\nTrump, 35, and her husband, Jared Kushner, 36, have three children: Arabella, 6, Joseph, 3, and Theodore, 1.\n\n“With each of my three children, I had some level of postpartum depression,” Trump said. Symptoms of the condition, which affects some women after giving birth, can include extreme sadness and anxiety.\n\n“It was a very challenging emotional time for me because I felt like I was not living up to my potential as a parent or as an entrepreneur and executive,” Trump said. “I had had such easy pregnancies that in some way, the juxtaposition hit me even harder.”\n\nWhen host Dr. Mehmet Oz asked, why talk about postpartum depression? Trump laughed and said that she hadn’t planned to discuss the topic until he asked.\n\n“It’s incredibly important,” she said. “Look, I consider myself a very hard-charging person. I am ambitious. I’m passionate. I’m driven, but this is something that affects parents all over the country.”\n\nResearch from the US Centers for Disease Control and Prevention shows that about one in nine women experiences postpartum depression. With the reveal, Trump joins actress Lena Headey, model Chrissy Teigen and singer Adele, who all went public with their postpartum struggles.\n\nMothers who have a personal or family history of depression and those who abuse alcohol are more likely than others to experience postpartum symptoms. Other factors – including stress, low social support, and pregnancy or birth complications – also place women at higher risk of postpartum depression.\n\nThe US Preventive Services Task Force recommends cognitive behavioral therapy or counseling for women with the condition.\n\nTrump told Oz that her decisions “weigh much heavier” now that they are “impacting people’s lives.”\n\n“One thing that I continue to do is meditate,” Trump said. “It’s been enormously helpful to me.”\n\nShe added that it is difficult to find the time since her children wake early but that an investment of 15 or 20 minutes every morning “recharges” her and is “almost the equivalent” of hours of sleep.\n\n‘I don’t view it as my obligation to moderate’\n\nIn January, Ivanka Trump’s family relocated to Washington from New York City so that both Trump and Kushner could accept positions as senior advisers in her father’s administration. Though at first her position was voluntary, as of March 30, she has served as an unpaid employee in the White House, as has Kushner.\n\nTrump has voiced support for women’s rights and a paid family leave program, yet some critics say she has not exerted enough of a positive influence on her father’s agenda, particularly his health care policy.\n\nWhen Oz asked for her response to the expectation that she be a “voice of moderation” in the White House, Trump said, “where I disagree with the agenda, I’ll share it with him quietly, but I don’t view it as my obligation to moderate.”\n\nOne of Trump’s causes: fighting human trafficking. This week, she delivered a speech on the issue at the United Nations General Assembly.\n\nJoin the conversation See the latest news and share your comments with CNN Health on Facebook and Twitter.\n\n“We cannot stand by in silence,” Trump said, referring to human trafficking as “the greatest human rights issue of our time.”\n\nTrump, who participated in the UN session as a guest of British Prime Minister Theresa May, has made combating human trafficking in the US and around the world a key aspect of her White House portfolio. She organized a listening session with survivors and advocates alongside her father in late February, and in May held a roundtable discussion on the topic.", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/170707125541-lena-headey.jpg?q=x_5,y_161,h_2767,w_4917,c_crop/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/170906171135-trump-ivanka-daddy-north-dakota.jpg?q=x_386,y_77,h_845,w_1502,c_crop/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/170920132319-ivanka-trump-postpartum-depression-dr-oz.jpg?q=x_2,y_0,h_1072,w_1905,c_crop/w_800", "https://media.cnn.com/api/v1/images/stellar/prod/161129183609-newborn-bracelet.jpg?q=x_560,y_316,h_1539,w_2736,c_crop/h_144,w_256"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/170920132319-ivanka-trump-postpartum-depression-dr-oz.jpg?q=x_2,y_0,h_1072,w_1905,c_crop/w_800", "keywords": [], "authors": ["Susan Scutti"], "canonical_link": "https://www.cnn.com/2017/09/20/health/ivanka-trump-postpartum-depression-dr-oz/index.html", "title": "Ivanka Trump reveals struggle with postpartum depression", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Ivanka Trump reveals struggle with postpartum depression | CNN", "description": "After the births of each of her three children, Ivanka Trump says during an interview for \"The Dr. Oz Show,\" she struggled with postpartum depression.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/170920132319-ivanka-trump-postpartum-depression-dr-oz.jpg?q=x_2,y_0,h_1072,w_1905,c_crop/w_800", "type": "article", "url": "https://www.cnn.com/2017/09/20/health/ivanka-trump-postpartum-depression-dr-oz/index.html", "site_name": "CNN"}, "twitter": {"title": "Ivanka Trump reveals struggle with postpartum depression | CNN", "description": "After the births of each of her three children, Ivanka Trump says during an interview for \"The Dr. Oz Show,\" she struggled with postpartum depression.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/170920132319-ivanka-trump-postpartum-depression-dr-oz.jpg?q=x_2,y_0,h_1072,w_1905,c_crop/w_800", "card": "summary_large_image", "site": "@CNN"}, "description": "After the births of each of her three children, Ivanka Trump says during an interview for \"The Dr. Oz Show,\" she struggled with postpartum depression.", "template_type": "article_leaf", "type": "article", "meta-section": "health", "theme": "health", "article": {"published_time": "2017-09-20T18:09:26Z", "modified_time": "2017-09-21T05:41:46Z", "tag": "business and industry sectors, business figures, business, economy and trade, celebrities, crime, law enforcement and corrections, crimes against persons, criminal offenses, depression, diseases and disorders, donald trump, government and public administration, government bodies and offices, health and medical, health care, health care policy and law, health insurance, human rights, human rights violations, human trafficking, insurance, international relations and national security, ivanka trump, jared kushner, law and legal system, maternal and child health, medical fields and specialties, mehmet oz, mental health, mental illnesses, obstetrics and gynecology, political figures - us, postpartum depression, pregnancy and childbirth, slavery, us federal government, white house, women's health", "publisher": "https://www.facebook.com/CNN"}, "keywords": "business and industry sectors, business figures, business, economy and trade, celebrities, crime, law enforcement and corrections, crimes against persons, criminal offenses, depression, diseases and disorders, donald trump, government and public administration, government bodies and offices, health and medical, health care, health care policy and law, health insurance, human rights, human rights violations, human trafficking, insurance, international relations and national security, ivanka trump, jared kushner, law and legal system, maternal and child health, medical fields and specialties, mehmet oz, mental health, mental illnesses, obstetrics and gynecology, political figures - us, postpartum depression, pregnancy and childbirth, slavery, us federal government, white house, women's health", "author": "Susan Scutti", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1505862000.0, "source": "https://www.cnn.com", "summary": ""}