{"url": "https://ew.com/tv/2018/10/09/this-is-us-three-kate-scene-jack-rebecca-reunion/", "text": "This Is Us producers break down the three-Kate scene, Jack and Rebecca's reunion\n\nThis Is Us season 3’s third episode made good use of the show’s time machine, tripping viewers through the ’50s, ’60s, ’70s, ’80s, and 2010s before mashing up the ’80s, ’90s, and 2010s in one trippy scene featuring Kate at three different ages.\n\nIn the past, “Katie Girls” picked up where the season 3 premiere left off, with fans learning the identity of that mystery man Rebecca (Mandy Moore) kissed the day after her first date with Jack (Milo Ventimiglia). The non-threateningly named Alan (Hunter Parrish) was an old boyfriend who had known her since woodworking class, and she did not follow him to London; now he was back, recycling lines from high school and asking her to start a new life with him in New York. She agreed to, but couldn’t loose memories of Jack from her head, and after a talk with Alan’s chill mom (Jane Kaczmarek!) and a chance re-meeting at the supermarket (her to pick up champagne to celebrate the move; him to pick up a thank-you coffee cake for his mother to bring to a friend’s house to escape her abusive husband), Rebecca dropped by this house on a whim and a prayer, cementing the beginning of an epic-but-cut-too-short relationship with Jack.\n\nBack in the present day, Randall (Sterling K. Brown) wasn’t seeing any changes to William’s neighborhood as promised by Councilman Brown (Rob Morgan). After the daughter of one of William’s friends wound up in the hospital, he decided to effect change by being it — namely, running against the councilman. After sharing this news, he received some of his own: Beth (Susan Kelechi Watson) had lost her job. Kate (Chrissy Metz) was also in distress, but pushed through her fears and learned that she had a successful egg-retrieval procedure (and a trippy dream), for which Randall flew across the country. Meanwhile, Kevin (Justin Hartley) received rave reviews for Hill 400 and was stumped by Terry Gross when she asked about his dad’s war experience, planting the seeds for that fact-finding mission to Vietnam as flash-foreshadowed in the season 2 finale.\n\nIt’s time to break up with Stink-Eye Sharon, grab a banana pudding ice cream so we’re not empty-handed, and check in with two people have — what’s the word? oh, yes — gravitas: This Is Us executive producers Elizabeth Berger and Isaac Aptaker to discuss “Katie Girls.”\n\nENTERTAINMENT WEEKLY: Jack and Rebecca have, of course, a great love story, yet one can’t help but have a tinge of sadness for her hearing more about her dreams. She told Alan that she did not want to stay in Pittsburgh, which she wound up doing, and she told his mother that she did not plan to be a traditional housewife, which she turned out to be in many ways. Later, she says that she did not regret her choices because of wonderful children and life with Jack, but when she finally had a chance to play trumpet instead of bass, if you will, and pursue that music career, it’s hard to see Jack not being supportive. What were those conversations like in the writers’ room?\n\nELIZABETH BERGER: It led to really complex, interesting conversations, because you make choices in life and you follow your heart, and we think in no way does Rebecca regret the beautiful love story that she has with Jack and the incredible family that they built together. But it doesn’t mean that life is perfect and that you don’t have regrets and you don’t make sacrifices along the way. We hope that everyone would consider the whole picture. There are beautiful parts and there are heartbreaking parts in everyone’s life, and that includes Rebecca.\n\nHow did you decide to end the episode — and the beginning of their true connection — on something so small and sweet, with the two of them washing Jack’s mother’s dishes?\n\nISAAC APTAKER: That was a moment that came out of that opening sequence, where you see Rebecca soaking in what a marriage is, in the context of her parents, and it was so one-sided with her mom putting dinner on the table, and her mom cleaning up after her dad, who would just kind of check out and sit by the TV. And that was clearly very much not what she wanted for herself. So after she takes that huge gamble on Jack — because when she walks away from Alan, she really doesn’t know him, they’ve had that one disastrous date and that one great moment of connection in the car, she doesn’t really know what she’s walking into — it’s just this beautiful, quiet moment where her risk that she just took is instantly affirmed by him. Where she sees, “Oh, this is a guy who in so many ways might just be the partner that I really, really need and want.”\n\nWhen are we back in this early courtship phase? Do we next pick up with road trip to California?\n\nAPTAKER: Yeah, we’re going to see them going to L.A. We’re very, very excited to be doing ’70s Los Angeles. It’s going to be later this season. It’s not right away, but it’s coming up soon.\n\nDuring that domestic fight, Jack’s dad says something awful, implying that Jack let him down by not looking out for his little brother in the Vietnam War. What can you hint about the guilt that Jack carried around from that? We’re going to learn more as we get into the Vietnam storyline.\n\nAPTAKER: A lot of the heaviness and the sort of angst and burden that Jack carries around him throughout his life is very much connected to that line and what happened to his brother, and we’re going to start exploring that next week.\n\nThe situation with Jack’s mother is far from resolved. You can see the dad showing up at this friend’s house, saying, “You’ve proved your point, you’re coming home now.” Does some kind of confrontation loom ahead, also involving Jack?\n\nBERGER: It’s definitely not a problem that can be solved overnight, but it did feel like a huge step in terms of getting her out of that house, which seemed long overdue.\n\nAPTAKER: Making that clean break, that first step is really the hardest part. Getting her was a huge victory for Jack, but as you’re saying, it’s far from resolved between them. It’s a very complicated situation. We’ve been waiting for him to do that for so long, and to see that he finally gets that woman out of that man’s house is huge.\n\nDo you think Randall needed to apologize to Kate? That scene didn’t unfold like we thought it would. She seemed to turn that around on him quickly and made him feel like he had to apologize for what he said, when she never really apologized for choosing some pretty damaging words.\n\nAPTAKER: It’s so interesting. We’ve had a lot of debate about that scene internally over here, and I think what makes it such an interesting one is that they really are both making valid points, and you can see it from both sides. On one hand, that implication that Randall doesn’t have Jack in him is an incredibly hurtful one. But at the same time, Randall has two biological daughters and had the experience of going through pregnancy with his wife, and why should he be telling Kate that she doesn’t deserve that?\n\nBERGER: And I think Randall also ultimately knows that his sister believes him to be every bit a Pearson. That doesn’t mean she didn’t choose her words terribly, but I think he knows that she’s coming from such an emotional place and from a place of pain. But I think it is interesting that even with loving your brother so much, you can still choose such foolish words. So as Isaac said, you really can see both points of views.\n\nAPTAKER: Personally, I think they should be mad at Kevin because he didn’t have any discretion and decided that he should repeat that to Randall, which is an insane thing to do. [Laughs]\n\nRandall has decided he wants to run against Councilman Brown. How realistic is that given that he doesn’t even live in the state and has no experience? Is the family moving into the building to establish residency?\n\nAPTAKER: [Laughs] No. We will explain how he’s able to establish residence in Philadelphia, which is, as you can probably guess, via William and owning that building. But I think Randall has so many qualities that will make him an incredible leader and advocate for this community. He’s certainly good at a monologue.\n\nBERGER: We’re seeing that people in our days throwing themselves into the political world often come from different walks of life, but it doesn’t mean that he’s not going to have an uphill battle ahead of him given that he’s never been in a political space before.\n\nAPTAKER: And given that person he’s running against has been in this position for over a decade.\n\nShouldn’t rehabbing the building be enough to honor his father’s memory? He has his hands full. Doesn’t he have enough challenges already?\n\nBERGER: Probably for most people it would be enough. But I think for Randall there is always that little flicker of “What’s next? What ultimately am I supposed to be doing with my life? Can I go further?” So that’s where that little flicker is taking him now.\n\nNEXT PAGE: The producers on that scene with the three Kates\n\nBeth fiddles with the wedding ring, seemingly remembering their conversation, and then she musters up the courage to push forward and tell him in that tough moment that she got fired. Is it a plausible theory that Beth will wind up running for that position instead of him, and he will play bass while she plays trumpet?\n\nAPTAKER: That’s a cool theory. Maybe. Yeah, sure, anything’s plausible. So much of the first two seasons, we’ve seen Beth is so incredible and is so solid. She’s unflappable. She’s Randall’s rock. The Beth we’ve known is so unflappable and solid, and she’s held down this job for such a long time, and she’s really been Randall’s support system and Randall’s rock as he’s had a pretty tumultuous two years with William and leaving his job. And now there’s a shift in the dynamic where Beth has had something happen that has really rattled her confidence and turned her world upside down, and we’re going to see whether or not Randall can rise to the occasion and be that support for her while simultaneously embarking on a very ambitious new path.\n\nWe learned that Kevin feels guilt for never asking his dad about the war when he was growing up. What was it about their relationship that Kevin felt that he couldn’t explore that with him? Jack did open the door one time, but as we know, Jack was a closed-off man when it came to that.\n\nAPTAKER: It was a combination of two things. Jack was not an easy person to ask questions about parts of life that he didn’t want to talk about. Rebecca, who was a full-grown woman, had great difficulty approaching those topics. And then Kevin was a bit of a selfish kid, especially as a teenager. [Laughs] He had a lot going on. He was very much all about Kevin, the football star, and then Kevin with the broken leg. He was very wrapped up in himself and not necessarily thinking, “Oh, I wonder what my dad’s backstory is.”\n\nWith Kevin’s curiosity piqued about Vietnam, and him sending an email to Robinson, we now know that we are headed toward the flash-forward with Kevin and Zoey going to Vietnam. How much more do we have to learn before they actually get on that plane?\n\nAPTAKER: A bit more. I don’t think that the first thing you do is instantly get on a plane and go to Vietnam. There’s a bit of the story and a mystery for Kevin to explore stateside, but they’re certainly heading there quickly.\n\nBERGER: By the time he gets on that plane, we wanted him to be armed with enough specific questions that really makes this journey satisfying and still worthwhile to him.\n\nAPTAKER: When we were breaking these stories, we always came to it from a place of, what would you do if you were wondering this about your parents? How would you go about it with very limited resources and very limited leads answering the questions? So we did a lot of, “Well, if it was us, first we’d probably hit Google because you’re not just buying a ticket to nowhere.” So it’s a very practical approach to investigating a parent’s origin story.\n\nWe’ve seen Jack interact with the adult Big Three, but this was even more trippy than what happened with Randall and the mushroom smoothie. How long have you been playing around with that device — and what was it like to shoot that?\n\nAPTAKER: Oh, it was so cool to shoot it. Our team built the hospital nursery right off our kitchen set, so that moment where they walk from that room where Kate was delivered into the kitchen was real. It was so surreal to walk down to that house that we’ve been filming in for three years and all of a sudden there’s a hospital to connected to it. You felt like you were in a dream. And then Hannah [Zeile] and Mackenzie [Hancsicsak] and Chrissy are all there, they’re never together on set. The whole thing was just very like, “Wait, what show is this?”\n\nBERGER: We went to the rehearsal and we were surprised how moving it was to see them all together, just because it isn’t a combination that we ever get t see together because why would we? And we’re always looking for those combinations we haven’t seen before and looking to find ways to put them on screen. And it felt like this dream would be such a natural time to do it that it unfolded origanically from there.\n\nAPTAKER: And then for Chrissy to get to work with Milo — she’s only gotten to do it with him in old-age makeup, so she’s never really gotten a scene with classic Jack. And putting them in that iconic ice cream parlor together — the whole thing was really exciting for us.\n\nIt’s poignant to see the wide-eyed enthusiasm of 9-year-old Kate for her life juxtaposed with how hurt and jaded and angry teenage Kate is — and an interesting dynamic to play out.\n\nAPTAKER: Putting them side by side, you really realize, “Wow, the death of her father really turned her into such a different person.” And then you look at adult Kate, and in a lot of ways, she really was able to overcome it and bounce back from that. I think that Chrissy and Mackenzie’s characters — little Kate and adult Kate — are a lot more similar than that teen Kate, because that’s the true essence of her.\n\nRelated links:", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F03%2F08%2FThis-Is-Us-02.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F10%2Fnup_183778_1829-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F11%2F17%2Fdan-snierson-image.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F05%2F02%2FThis-is-us_02.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F04%2F26%2FThis-is-Us-The-Night-Before-the-Wedding_07.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F04%2F01%2FThis-is-Us-Clip-02.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F01%2F05%2FNUP_195181_00127.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2021%2F05%2F24%2FNUP_194012_2862.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F01%2F25%2FNUP_195770_01004.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F05%2F17%2FNUP_197544_00351.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F02%2F22%2FTHIS-IS-US-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Few.com%2Fimg%2Fmisc%2F300x250_magazines_and_more.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F03%2F26%2FNUP_196039_01114.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F01%2F19%2FNUP_195631_00367.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2021%2F03%2F23%2Fgriffin-dunne-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F03%2F15%2FThis-is-Us-The-Guitar-Man-002.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F04%2F19%2FThis-Is-Us-Season-6_003.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2019%2F03%2Fnup_185862_1462-2000.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2067'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F05%2F23%2FNUP_197545_01867.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F02%2F01%2FThis-Is-Us-67.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F03%2F21%2FNUP_196038_02832.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2020%2F11%2F17%2Fthis-is-us31-1.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F04%2F11%2FNUP_196856_00213.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F05%2F09%2FThis-Is-Us-05.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2021%2F04%2F12%2FNUP_193563_0009.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F08%2F05%2FBrett-Goldstein-Hannah-Waddingham-Three-Rounds-080522-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2021%2F05%2F10%2FNUP_193564_0042.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F07%2F14%2FJosh-Hartnett-The-Faculty-071422.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F10%2Fnup_183778_1829-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F01%2F12%2FNUP_195463_00952.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F08%2F16%2FBetter-Call-Saul_081622_4.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F10%2Fnup_183778_1829-2000.jpg", "keywords": [], "authors": ["Dan Snierson", "Amanda Ostuni", "October", "At Pm Edt"], "canonical_link": "https://ew.com/tv/2018/10/09/this-is-us-three-kate-scene-jack-rebecca-reunion/", "title": "This Is Us producers on three-Kate scene, Jack and Rebecca's reunion", "meta_data": {"viewport": "width=device-width,initial-scale=1", "theme-color": "#111", "keywords": "entertainment, entertainment news, ew, entertainment weekly", "news_keywords": "entertainment, entertainment news, ew, entertainment weekly", "description": "Elizabeth Berger and Isaac Aptaker give the lowdown on season 3's third episode, 'Katie Girls.'", "robots": "max-image-preview:large", "og": {"title": "'This Is Us' producers break down the three-Kate scene, plus Jack and Rebecca's reunion", "type": "article", "site_name": "EW.com", "url": "https://ew.com/tv/2018/10/09/this-is-us-three-kate-scene-jack-rebecca-reunion/", "description": "Elizabeth Berger and Isaac Aptaker give the lowdown on season 3's third episode, 'Katie Girls.'", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F10%2Fnup_183778_1829-2000.jpg", "width": 2000, "height": 1000}}, "pinterest": {"url": "https://ew.com/tv/2018/10/09/this-is-us-three-kate-scene-jack-rebecca-reunion/", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F10%2Fnup_183778_1829-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/tv/2018/10/09/this-is-us-three-kate-scene-jack-rebecca-reunion/", "title": "'This Is Us' producers break down the three-Kate scene, plus Jack and Rebecca's reunion", "description": "Elizabeth Berger and Isaac Aptaker give the lowdown on season 3's third episode, 'Katie Girls.'", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F10%2Fnup_183778_1829-2000.jpg"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}, "url": "https://ew.com/tv/2018/10/09/this-is-us-three-kate-scene-jack-rebecca-reunion/"}, "movies": [], "publish_date": 1539039600.0, "source": "https://ew.com", "summary": ""}