{"url": "https://en.wikipedia.org/wiki/Jennifer_Garner", "text": "American actress (born 1972)\n\nJennifer Anne Garner (born April 17, 1972) is an American actress. Born in Houston, Texas, and raised in Charleston, West Virginia, Garner studied theater at Denison University and began acting as an understudy for the Roundabout Theatre Company in New York City. She made her screen debut in the television adaptation of Danielle Steel's romance novel Zoya in 1995. She had guest television appearances and supporting film roles, as well as a featured role on the teen drama television series Time of Your Life (1999–2000) and a supporting role in the war drama Pearl Harbor (2001).\n\nGarner gained recognition for her leading performance as CIA officer Sydney Bristow in the ABC spy-action thriller television series Alias (2001–2006). For her work on the series, she won the Golden Globe for Best Actress – Television Series Drama and the Screen Actors Guild Award for Best Actress in a Television Drama, in addition to four consecutive nominations for the Primetime Emmy Award for Outstanding Lead Actress in a Drama Series. She received additional praise for her performance in the romantic comedy 13 Going on 30 (2004), and went on to portray Elektra in the superhero films Daredevil (2003) and Elektra (2005). She continued to achieve commercial success with performances in the comedy-drama Juno (2007), and the romantic comedies Ghosts of Girlfriends Past (2009) and Valentine's Day (2010).\n\nGarner had starring film roles in the fantasy-comedy The Invention of Lying (2009), the fantasy drama The Odd Life of Timothy Green (2012), and the biographic drama Dallas Buyers Club (2013), the latter of which earned her a nomination for the Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture. She went on to star in the family comedy Alexander and the Terrible, Horrible, No Good, Very Bad Day (2014), the drama Miracles from Heaven (2016), the romantic comedy-drama Love, Simon (2018), the HBO comedy series Camping (2018), the action thriller Peppermint (2018) and action-comedy The Adam Project (2022). Garner has also produced and starred in the comedy Butter (2011) and the family adventure Yes Day (2021).\n\nGarner works as an activist for early childhood education and is a board member of Save the Children USA. She is the co-founder and chief brand officer of the organic baby food company Once Upon a Farm. She is also an advocate for anti-paparazzi campaigns among children of celebrities.\n\nEarly life [ edit ]\n\nJennifer Anne Garner was born on April 17, 1972, in Houston, Texas, but moved to Charleston, West Virginia at age three. Her father, William John Garner, worked as a chemical engineer for Union Carbide; her mother, Patricia Ann English, was a homemaker and later an English teacher at a local college.[1][2] She has two sisters.[3][4] Garner has described herself as a typical middle child who sought to differentiate herself from her accomplished older sister.[5][6] While Garner did not grow up in a politically active household,[7] her father was \"very conservative\" and her mother \"quietly blue\".[8] She attended a local United Methodist Church every Sunday and went to Vacation Bible School.[9] As teenagers, she and her sisters were not allowed to wear makeup, paint their nails, pierce their ears, or dye their hair;[10][11] she has joked that her family's \"take on the world\" was \"practically Amish\".[12]\n\nShe attended George Washington High School in Charleston.[13] In 1990, Garner enrolled at Denison University in Granville, Ohio,[14] where she changed her major from chemistry to theater[15] and was a member of Pi Beta Phi sorority.[16] She spent the fall semester of 1993 studying at the National Theater Institute at the Eugene O'Neill Theater Center in Waterford, Connecticut.[17] During college summers, she worked summer stock theatre.[18] In 1994, she graduated with a Bachelor of Fine Arts degree in theater performance.[19]\n\nActing career [ edit ]\n\n1990s [ edit ]\n\nAs a college student, Garner performed in summer stock theatre. In addition to performing, Garner helped sell tickets, build sets, and clean the venues.[20][21] She worked at the Timber Lake Playhouse in Mount Carroll, Illinois, in 1992,[22] the Barn Theatre in Augusta, Michigan, in 1993,[23] and the Georgia Shakespeare Festival in Atlanta, Georgia, in 1994.[24] Garner moved to New York City in 1995.[25] During her first year in the city, Garner earned $150 per week as an understudy for a Roundabout Theatre Company production of A Month in the Country[6][26] and made her first on-screen appearance as Melissa Gilbert's daughter in the romance miniseries Zoya.[27] In 1996, she played an Amish woman in the television movie Harvest of Fire[28] and a shopkeeper in the Western miniseries Dead Man's Walk.[29] She appeared in the independent short film In Harm's Way[30] and made one-off appearances in the legal dramas Swift Justice and Law & Order. Garner also supplemented her income by working as a hostess at a restaurant on the Upper West Side.[31]\n\nAfter moving to Los Angeles in 1997, Garner gained her first leading role in the television film Rose Hill[32] and made her first feature film appearance in the period drama Washington Square.[33] She appeared in the comedy film Mr. Magoo, the independent drama 1999 and Woody Allen's Deconstructing Harry, though most of her performance was cut from the film.[34] In 1998, Garner appeared in an episode of Fantasy Island and was cast as a series regular in the Fox drama Significant Others,[35] but Ken Tucker of Entertainment Weekly thought there was \"no center\" to the character as played by Garner.[36] Fox canceled the series after airing three of six filmed episodes. Garner's most significant role of 1998 was in J. J. Abrams' college drama Felicity.[37] In 1999, Garner was cast as a series regular in another Fox drama, Time of Your Life, but it was canceled midway through the first season.[38] Also in 1999, she appeared in the miniseries Aftershock: Earthquake in New York and in two episodes of the action drama The Pretender.\n\n2000s [ edit ]\n\nGarner played the girlfriend of Ashton Kutcher's character in the comedy Dude, Where's My Car? (2000). In 2001, she appeared briefly opposite her husband Foley in the drama Stealing Time and had a small role as a nurse in the war epic Pearl Harbor.[39] Also in 2001, Garner was cast as the star of the ABC spy thriller Alias.[1] The show's creator, J. J. Abrams, wrote the part of Sydney Bristow with Garner in mind.[40][41] Alias aired for five seasons from 2001 to 2006; Garner's salary began at $40,000 per episode and rose to $150,000 per episode by the series' end.[42] During the show's run, Garner won a Screen Actors Guild Award for Best Actress and a Golden Globe Award for Best Actress (with a further three Globe nominations), and received four nominations for the Emmy Award for Best Actress.\n\nWhile Alias was airing, Garner continued to work in film intermittently. She had an \"other-worldly\" experience when Steven Spielberg called to offer her a role as a high-class call girl in Catch Me if You Can (2002).[43] After seeing her in Alias, Spielberg thought for sure \"she would be the next superstar\".[44] She filmed her scene opposite Leonardo DiCaprio during a one-day shoot.[45] Garner's first co-starring film role was in the action film Daredevil (2003), in which she played Elektra to Ben Affleck's Daredevil.[46] The physicality required for the role was something Garner had discovered \"an aptitude for\" through her work on Alias.[43][47] Elvis Mitchell of The New York Times wrote that she \"realizes Elektra more through movement than by way of her lumpy, obvious lines. She hasn't mastered the combat skill of tossing off bad material.\"[48] While Daredevil received mixed reviews, it was a box office success.[49] Also in 2003, she voiced herself in an episode of The Simpsons.\n\nGarner's first leading film role, in the romantic comedy 13 Going on 30 (2004), was widely praised. She played a teenager who finds herself trapped in the body of a thirty-year-old. Garner chose Gary Winick to direct the film[50] and they continued to look for other projects to do together until his death in 2011.[51][52] Manohla Dargis of the Los Angeles Times found her to be \"startling\": \"Whenever she's on screen you don't want to look anywhere else.\"[53] Owen Gleiberman of Entertainment Weekly called it an \"utterly beguiling\" performance, writing, \"You can pinpoint the moment in it when Garner becomes a star.\"[54] Ann Hornaday of The Washington Post remarked: \"Garner is clearly cut out to be America's next Sweetheart; she has the same magic mix of allure and accessibility that the job calls for.\"[55] 13 Going on 30 grossed $96 million worldwide.[56] Garner reprised the character of Elektra in the 2005 Daredevil spin-off Elektra; it was a box office and critical failure.[57] Claudia Puig of USA Today concluded that Garner \"is far more appealing when she's playing charming and adorable, as she did so winningly in 13 Going on 30\".[58] Garner next starred in the romantic drama Catch and Release. Although filmed in 2005 in between seasons of Alias, it was not released until early 2007 and failed to recoup its production budget.[59] Peter Travers of Rolling Stone praised Garner's ability \"to blend charm and gravity\"[60] but Peter Hartlaub of the San Francisco Chronicle felt that, while her \"natural beauty and likability are still assets, [she] seems occasionally challenged by what should be an easy role\".[61]\n\nThe Invention of Lying in 2009 Garner at a press conference forin 2009\n\nAfter a one-year break following the conclusion of Alias, her wedding to Affleck, and the birth of her first child, Garner returned to work in 2007. Her supporting role in Juno as a woman desperate to adopt a child was described by Kyle Buchanan of New York Magazine as a turning point in her career: \"She came into the movie a steely figure, and left it as the mother you'd give your own child to ... Writer Diablo Cody and director Jason Reitman expertly deploy Garner's innate humanity as a trump card.\"[62] Lisa Schwarzbaum of Entertainment Weekly said Garner had never \"been lovelier or more affecting\".[63] Also that same year, she played an FBI investigator in the action thriller The Kingdom.[64][65] She was nursing her baby during filming in Arizona and was hospitalized on two occasions with heatstroke.[66]\n\nIn late 2007 and early 2008, Garner played Roxanne to Kevin Kline's Cyrano de Bergerac at the Richard Rodgers Theatre on Broadway. In preparation for the role, Garner worked with vocal and movement coaches and took French lessons.[26] Ben Brantley of The New York Times described her performance as \"captivating\": \"Ms. Garner, I am pleased to report, makes Roxane a girl worth pining over ... [She] speaks Anthony Burgess's peppery rhymed translation with unaffected sprightliness. If she's a tad stilted in the big tragic finale, her comic timing is impeccable.\"[67] The New Yorker's theater critic was impressed by her \"feistiness\" and \"lightness of comic touch\".[68] The play was recorded before a live audience and aired on PBS in 2008. In 2007, Garner became a spokesperson of skin care brand Neutrogena.[69]\n\nGarner co-starred in two romantic comedies in 2009. She first appeared in Ghosts of Girlfriends Past, portraying the childhood friend of a famous photographer and womanizer. While the film received lukewarm reviews, it grossed $102.2 million worldwide.[70] Michael Phillips of The Chicago Tribune found Garner \"easy to like and sharp with her timing\"; he was disappointed to see her as \"the love interest, which is not the same as a rounded character\".[71] Similarly, Manohla Dargis of The New York Times was dismayed to see Garner appear as \"less a co-star than a place holder (you can almost see the words \"enter generic female lead\" in [the] screenplay)\".[72]\n\nGarner's second performance of 2009 was in comedian Ricky Gervais's directorial debut The Invention of Lying. Gervais was keen to cast Garner—\"always happy and always pleasant to everyone\"—against type.[73] In the film, she played the love interest of the first human with the ability to lie in a world where people can only tell the truth. Reviews for the movie were mixed and it made $32.4 million worldwide.[74] David Edelstein of New York Magazine said Garner \"proves again (the first time was 13 Going on 30) what a dizzying comedienne she is. She looks as if the wheels in her head are not just turning but falling off and needing to be screwed back on,\"[75] while Mick LaSalle of the San Francisco Chronicle said Garner \"has never been better onscreen ... Garner gets to show a comic facility we haven't seen before.\"[76]\n\n2010s [ edit ]\n\nIn Garry Marshall's ensemble romantic comedy Valentine's Day (2010), Garner shared scenes with Ashton Kutcher, Jessica Biel, and Patrick Dempsey.[77] The film made $56.2 million in its US opening weekend; it eventually grossed $110.4 million domestically and $216.4 million worldwide.[77] In 2011, she had a supporting role as a villainous deranged bride in the comedy Arthur, a remake of the 1981 film of the same name, directed by Jason Winer and co-starring Russell Brand and Helen Mirren.[78][79]\n\nGarner played a mother for the first time in 2012,[5] in the drama The Odd Life of Timothy Green, which followed a magical pre-adolescent boy whose personality and naïveté have profound effects on the people in his town.[80] The film received mixed reviews from critics and made a modest $56 million worldwide.[81]\n\n[82] Claudia Puig of USA Today found Garner \"convincing as a warm-hearted, if tense, mom\"[83] while Michael Phillips of the Chicago Tribune said she brought \"fervent sincerity and a welcome touch of comic eccentricity\" to the role.[84] Also in 2012, Garner starred in the satirical comedy Butter, in which she played an overly competitive and socially ambitious woman participating in a local butter sculpturing competition in a small Iowa town. Distributed for a limited release in certain parts of the United States only, Butter received mixed reviews and grossed $105,018.[85][86] Peter Debruge of Variety praised \"the best bigscreen use of Jennifer Garner's comedy gifts since 13 Going on 30,\"[87] while Peter Travers of Rolling Stone described her as the \"best in show\": \"[She] knows how to play comedy of the absurd.\"[88] However, Scott Bowles of USA Today remarked: \"Garner is a terrific actress, but here she's asked to cackle her lines in a voice a full octave above her natural one.\"[89] Also in 2012, she appeared in the YouTube short Serena,[90] and became a spokesperson for food company Luvo.[91]\n\nGarner reunited with Matthew McConaughey in the 2013 drama Dallas Buyers Club, portraying the role of a doctor treating AIDS patients in Texas during the mid-1980s.[92][93] The film received significant acclaim and was a box office success.[94] Peter Travers of Rolling Stone described Garner as \"a radiant actress of rare spirit and sensitivity\"[95] and Betsy Sharkey of the Los Angeles Times said: \"Garner is once again cast as a quintessentially decent, all-American girl, albeit a doctor. But the question of whether the actress has deeper emotional layers to bring to the screen is not answered here.\"[96] David Edelstein of New York magazine said: \"It's not a well-shaped role, but I've gotten to the point where I'm happy to see Garner in anything. She's incapable of phoniness.\"[97] Also in 2013, Garner became the first celebrity spokesperson of the Italian fashion brand Max Mara.[98]\n\nIn 2014, Garner starred in the sports drama Draft Day, as the fictional salary cap analyst of the Cleveland Browns. Critical reception toward the film was mixed and Mick LaSalle of The San Francisco Chronicle, describing her part, remarked: \"It's not much of a role, but she's perfectly nice in it. Perhaps someday someone will give Garner a chance to be something other than perfectly nice.\"[99] Garner also co-starred with Steve Carell in the 2014 Disney adaptation of the popular children's book Alexander and the Terrible, Horrible, No Good, Very Bad Day, taking on the role of the mother of the titular character. The film grossed $101 million worldwide.[100] Sandie Angulo Chen of the Washington Post said: \"Garner, who has long mastered the art of playing harried and overworked moms, is pleasantly frazzled.\"[101] Her other film role in 2014 was that of an overprotective mother in the dramedy Men, Women & Children, directed by Jason Reitman and co-starring Rosemarie DeWitt, Judy Greer, Dean Norris, and Adam Sandler. The film made $2.2 million worldwide,[102] and Christopher Orr of The Atlantic said: \"Garner does what she can as the Snooping Mom from Hell, but ultimately it's not much. The role is like a caricature of her performance in Juno, minus the ultimate (and essential) redemption.\"[103] In late 2014, Capital One signed Garner as their spokesperson for their Capital One Venture Air Miles credit card.[104]\n\nGarner in 2018\n\nIn 2015's Danny Collins, a drama inspired by the true story of folk singer Steve Tilston and starring Al Pacino and Annette Bening, Garner played the supporting role of the wife of Bobby Cannavale's character. The film was released in selected cinemas and was warmly received by critics; Stephanie Merry of The Washington Post felt Garner gave the movie \"a powerful jolt of emotion\".[105] In 2016, Garner appeared in the Christian drama Miracles from Heaven, playing the mother of a young girl who had a near-death experience and was later cured of an incurable disease. The film grossed $73.9 million worldwide[106] and received generally mixed reviews from critics, who felt it \"makes the most out of an outstanding performance\" from Garner.[107] Ken Jaworowski of The New York Times praised a \"dedicated\" and \"heartfelt\" performance,[108] while Nigel Smith of The Guardian found \"her subtly wrought work ... tremendously effective\" in an otherwise \"crassly manipulative\" film.[109] Also in 2016, Garner starred in the critically panned comedy Nine Lives, playing the second wife of a workaholic father who has his mind trapped inside of his daughter's new cat. Garner made an uncredited cameo appearance in Mother's Day (2016).\n\nGarner appeared in the drama Wakefield, which premiered at TIFF and was released in May 2017.[110] Also in 2017, she starred in The Tribes of Palos Verdes, and in friend Judy Greer's directorial debut A Happening of Monumental Proportions.[111][112] In 2018, she co-starred in Love, Simon, an adaptation of the young-adult novel Simon vs. the Homo Sapiens Agenda.[113] Also that year, Garner voiced the role of Mama Llama for Netflix's original animated preschool series Llama Llama, and starred as the lead in the action-revenge film Peppermint, which was released on September 7.[114]\n\nIn August 2018, Garner was honored with a star on the Hollywood Walk of Fame.[115] Variety praised her \"radiant likability\" and said she was second only to Tom Hanks.[116] Also in 2018, she starred in the HBO television show Camping.\n\n2020s [ edit ]\n\nIn 2020, Garner starred in the Quibi comedy miniseries Home Movie: The Princess Bride, a \"fan made\" recreation of the 1987 film of the same name produced in social isolation during the COVID-19 pandemic. Filmed in a deliberately DIY fashion, it was created to raise money for World Central Kitchen.[117] She also appeared in the Netflix comedy film Yes Day, directed by Miguel Arteta and released in March 2021.[118][119]\n\nIn 2022, she appeared in The Adam Project, which reunited her with her 13 Going on 30 (2004) co-star Mark Ruffalo.\n\nIn May 2022, she started filming The Last Thing He Told Me (miniseries). [120] She is set to be a series regular in the upcoming revival of Starz's Party Down.[121]\n\nOther ventures [ edit ]\n\nKnown singing performances [ edit ]\n\nNot long after the turn of the Twenty-First Century, Garner became one of the fourteen actors, not generally known for singing, who participated in the compilation album Unexpected Dreams - Songs from the Stars, released on April 4, 2006, on which album she sang a solo version of \"My Heart Is So Full Of You\", from Frank Loesser's The Most Happy Fella; the original version had been a duet. (Victor Garber, who had portrayed Sydney Bristow's father Jack Bristow on Alias, was another such actor on the same compilation album; his song on the album was Stephen Sondheim's \"No One Is Alone\", from Into The Woods.) It was neither the first time, nor would it be the last, that Garner had ever done any singing publicly; she had previously sung \"My Funny Valentine\" when hosting a 2003 edition of Saturday Night Live on which Beck was the booked musical guest, and on Alias, in the 2002 episode \"Rendezvous\", she sang a version of \"Since I Fell For You\" to which she wrote her own lyrics; she was not credited for either. Later, in 2016, Garner sang \"Doin' It (All for My Baby)\" in the 2016 Garry K. Marshall comedy-drama Mother's Day, and in 2021, in the family comedy Yes Day, she interpreted the Four Tops's 1964 chart selection \"Baby I Need Your Loving\".[122]\n\nEarly childhood education activism [ edit ]\n\nGarner with a preschooler at a Capitol Hill event in 2013\n\nIn 2009, Garner became an artist ambassador for Save the Children USA, promoting national literacy, nutrition, and early education efforts.[123][124] Since 2014,[125] Garner has served on the board of trustees for the organization,[126][127][128] advocating for early childhood education.[129] As an ambassador, she frequently visits with families involved in the organization's Early Steps to School Success program, which coaches families to help children learn in the early years.[130]\n\nIn 2011, Garner partnered with Frigidaire as part of her work with Save the Children.[131] In 2013, Garner took her eldest daughter Violet to a Save the Children gala in New York: \"My husband and I have never taken our kids to a public event before, but I brought my daughter Violet, because ... I want her to see the passionate commitment Mark Shriver and Hillary Clinton have to make the world a better place for everyone.\"[132] In 2014, she joined the Invest in Us campaign.[127] In 2015, she appeared in A Path Appears, a PBS documentary that focuses on rural poverty among children in West Virginia.[133]\n\nDemocratic political support [ edit ]\n\nIn 2002, Garner filmed a 30-second television advertisement for her childhood friend Corey Palumbo, who was running as a Democratic candidate for the West Virginia House of Delegates.[134] In 2006, she spoke at a rally in support of Democratic congressional candidate Jerry McNerney in Pleasanton, California.[135] In 2008, she hosted two fund-raisers for Barack Obama during the 2008 Democratic Primary.[136][137] In 2007, Garner said she was \"not a particularly outwardly political person\".[66] In 2014, Garner donated $25,000 to the campaign of Democratic politician Wendy Davis.[138] During the 2016 presidential campaign, Garner hosted a fundraiser in support of Hillary Clinton in Bozeman, Montana.[139] Garner also attended voter registration and phone bank events in support of Clinton in Reno, Nevada.[140]\n\nIn 2007, Garner appeared in a global warming awareness video produced by the Center for American Progress Action Fund.[141]\n\nAnti-paparazzi campaigns [ edit ]\n\nGarner has campaigned for laws to protect her children from paparazzi, stating in 2013: \"There's an idea that because our pictures are everywhere that we are complicit in it. When really what happens is they're waiting outside our door every single day.\"[142] In August 2013, Garner testified before the California Assembly Judiciary Committee in support of a bill that would protect celebrities' children from harassment by photographers.[143] Her six-year-old daughter made a speech about her personal experiences at a private event in support of the bill.[144] The bill passed in September 2013 and is now California law.[145] While photographs of children may still be taken, behavior which \"seriously alarms, annoys, torments, or terrorizes\" children is illegal, as is \"lying in wait\" outside their various activities.[146] In 2014, her then-husband Affleck argued in favor of a United Kingdom-style system, where \"you have to blur out the face[s]\" of minor children in published photographs.[147] In 2014, Garner spoke in support of the \"No Kids\" policy, which was adopted by many media organizations and forbids publication of photos of celebrities' children. She described the paparazzi interest as \"gross\": \"Our hope is maybe our kids won't be so recognizable in a few years.\"[148][149]\n\nIn 2019, Garner reflected on \"a solid decade where there were five or six cars minimum, and easily up to 15 or 20 on the weekends, outside of my house at all times\". While she said the situation had improved since the legislation was passed, she noted that \"seven or eight\" photographers still regularly wait outside her children's school to photograph them from a distance and that she sometimes requires police assistance when they get too close.[150]\n\nOnce Upon a Farm [ edit ]\n\nGarner and John Foraker co-founded the organic, fresh baby food company Once Upon a Farm in 2018; Garner is also the company's chief brand officer. In 2019, Once Upon a Farm became the first refrigerated baby food available to WIC-eligible families.[151]\n\nPersonal life [ edit ]\n\nRelationships and family [ edit ]\n\nGarner met co-star Scott Foley on the set of Felicity in 1998.[1] They married in a ceremony at their home on October 19, 2000. The pair separated in March 2003.[152] Garner filed for divorce in May 2003, citing irreconcilable differences, and divorce papers were signed in March 2004.[153][154] She dated her Alias co-star Michael Vartan from August 2003 to mid-2004.[155][156]\n\nGarner began dating Ben Affleck in August 2004,[157] having established a friendship on the sets of Pearl Harbor (2001) and Daredevil (2003).[158] They married on June 29, 2005, in a private Turks and Caicos ceremony.[159] Victor Garber, who officiated the ceremony, and his (later) husband, Rainer Andreesen, were the only guests.[160] Garner and Affleck have three children together: two daughters, Violet Anne Affleck born in 2005 and Seraphina Rose Elizabeth Affleck born in 2009,[161][162] and one son, Samuel Garner Affleck born in 2012.[163] The couple announced their intention to divorce in June 2015,[164] and jointly filed legal documents in April 2017, seeking joint physical and legal custody of their children.[165] The divorce was finalized in October 2018.[166][167] Before dating Affleck, when Garner was filming 13 Going on 30 (2004), \"her director, Gary Winick, suggested she get involved with Al-Anon, a group for people living with addicts.\" This would prove helpful later on, as she supported Affleck's struggles with alcoholism during their marriage and after they separated.[168] She previously used the surnames Foley and Affleck during her marriages to Scott Foley and Ben Affleck, respectively.[169]\n\nShe dated businessman John C. Miller from mid-2018 to early 2020.[170][171][172] According to sources and paparazzi photos, they rekindled their relationship in April 2021 and have been together since.[173][174][175]\n\nReligion [ edit ]\n\nAlthough Garner stopped attending church regularly after moving to Los Angeles,[176] her three children were baptized as members of the United Methodist Church in her hometown of Charleston, West Virginia.[9] In 2015, she and her family began attending weekly Methodist church services in Los Angeles.[9]\n\nStalking incident [ edit ]\n\nGarner was stalked by Steven Burky from 2002 to 2003, and again from 2008 to 2009. Garner, her then-husband Affleck, and their daughter Violet obtained a restraining order in 2008.[177] Burky was arrested in December 2009 outside Violet's preschool.[178] He was charged with two counts of stalking, to which he pleaded not guilty by reason of insanity. In March 2010, he was ruled insane, sent to California's state mental hospital, and ordered to stay away from the Garner-Affleck family for ten years if released.[179]\n\nFilmography [ edit ]\n\nAwards and nominations [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Dallas_Buyers_Club_03_%289765948794%29.jpg/200px-Dallas_Buyers_Club_03_%289765948794%29.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Jennifer_Garner_at_the_Fast_Company_Innovation_Festival_-_44972951114_%28cropped%29.jpg/220px-Jennifer_Garner_at_the_Fast_Company_Innovation_Festival_-_44972951114_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Goldenglobes2013.png/220px-Goldenglobes2013.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Early_Learning_Bill.jpg/220px-Early_Learning_Bill.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Jennifer_Garner_cropped.jpg/209px-Jennifer_Garner_cropped.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Jennifer_Garner_2018_%28cropped%29.png/200px-Jennifer_Garner_2018_%28cropped%29.png", "https://upload.wikimedia.org/wikipedia/commons/c/ce/Jennifer_Garner_at_the_Fast_Company_Innovation_Festival_-_44972951114_%28cropped%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/c/ce/Jennifer_Garner_at_the_Fast_Company_Innovation_Festival_-_44972951114_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jennifer_Garner", "title": "Jennifer Garner", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Jennifer_Garner_at_the_Fast_Company_Innovation_Festival_-_44972951114_%28cropped%29.jpg/640px-Jennifer_Garner_at_the_Fast_Company_Innovation_Festival_-_44972951114_%28cropped%29.jpg", "width": 640, "height": 851}, "title": "Jennifer Garner - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}