{"url": "https://www.independent.co.uk/arts-entertainment/tv/news/the-crown-helena-bonham-carter-princess-margaret-netflix-season-3-release-date-vanessa-kirby-a8452466.html", "text": "Sign up to our free IndyArts newsletter for all the latest entertainment news and reviews Sign up to our free IndyArts newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nIndyArts email {{ #verifyErrors }}{{ message }}{{ /verifyErrors }}{{ ^verifyErrors }}Something went wrong. Please try again later{{ /verifyErrors }}\n\nNetflix has unveiled a first look at Helena Bonham Carter as Princess Margaret in The Crown.\n\nThe actor replaces Vanessa Kirby, who played the royal in the Golden Globe-winning drama's first two seasons.\n\n\"We’re completely terrified,\" Bonham Carter previously said of taking on the role. \"I think also because the first two seasons were such a success, we have the onus of inheriting the responsibility of doing justice to all these genuinely famous people, and then on top of it, inheriting them from this previous generation of actors who’ve done such good jobs.”\n\nEarlier this week, the first image from the third season was released, showcasing Olivia Colman as Queen Elizabeth.\n\nJoining Bonham Carter and Colman for season three are Matt Smith's Prince Philip replacement Tobias Menzies and Jason Watkins, who will appear as British PM Harold Wilson, following on from John Lithgow.\n\nShowrunner Peter Morgan has previously spoken about the recasting, saying that new actors will be brought on every two seasons\n\n12 useful Netflix features you need to know Show all 12 1 /12 12 useful Netflix features you need to know 12 useful Netflix features you need to know Secret codes Netflix has a staggering number of hidden sub-genres, which you can unlock with special codes. You can browse the codes at http://ogres-crypt.com/public/NetFlix-Streaming-Genres2.html. When you find the one you want, paste it at http://www.netflix.com/browse/genre/CODE (replacing “CODE” with the right combination of numbers). Unfortunately, this is only possible on the Netflix website. 12 useful Netflix features you need to know New features Everyone likes getting early access to new features for things they love, and Netflix lets you do just that. All you need to do is go to your Account page and select Test Participation. 12 useful Netflix features you need to know History We all have our guilty pleasures, though some are guiltier than others. If you really don’t want other people to find out what yours is, you can delete it from your viewing history by visiting Netflix’s Viewing Activity page, which you can find in the Account menu. 12 useful Netflix features you need to know Rogue users The Viewing Activity page has an option called See Recent Account Access, which shows you information about your account, such as when it has been used, on what device and where. If you spot any rogue-looking activity, you can knock anyone who isn’t supposed to have access to your account off your account, by going back to your Account page and selecting Sign Out of All Devices. 12 useful Netflix features you need to know Ratings Unless you’re binge-watching a series and therefore don’t care about anything else Netflix has to offer, suggestions are important. You can help Netflix improve the recommendations it gives you by actually rating the things you watch. If you hate a film, tell Netflix you hate it. If you love it, say you love it. This tiny bit of extra effort will soon pay off. 12 useful Netflix features you need to know Manual ordering If you’re not convinced by the suggestions Netflix automatically adds to your My List section, you can choose to manually order suggestions instead by visiting netflix.com/MyListOrder. 12 useful Netflix features you need to know Downloads Netflix pleased a lot of users when it added the ability to download shows for offline viewing. As well as helping yu save mobile data, it’s great for when you’re stuck on a plane or somewhere with terrible reception. Find out what films and TV shows are available to download by opening the menu and selecting Available to Download. 12 useful Netflix features you need to know Keep an eye on your data Phone, computer and TV screens are constantly improving, so it’s worth checking your Playback Settings (in your Account page) to ensure you’re watching Netflix in the best quality you can. On the other hand, however, sometimes your web connection can’t keep up. Because nobody likes buffering, you can make a compromise by lowering the playback quality. Doing so could also help you save data if you’re on a limited plan. Low quality burns through roughly 0.3GB of data per hour, Medium burns through roughly 0.7GB per hour and High gets through roughly 3GB per hour for HD content, and roughly 7GB per hour for 4K content. 12 useful Netflix features you need to know Switch browsers Google Chrome may be the most popular web browser in the world, but it isn’t great for watching Netflix on - the crown belongs to Microsoft Edge. Believe it or not, Netflix even looks better on Internet Explorer than it does on Chrome. The maximum resolution you can watch Netflix on differs depending on which browser you use. You can go up to 4K on Microsoft Edge, up to 1080p on Internet Explorer and Safari, and up to 720p on Google Chrome, Mozilla Firefox and Opera. 12 useful Netflix features you need to know Clearer subtitles You can customise the appearance of subtitles on Netflix to make them easier to read or slightly less prominent - whatever suits you. Go to Subtitle Appearance in your Account menu and play with font, colour, text size and even shadow effects. 12 useful Netflix features you need to know Requests Netflix is constantly refreshing its line-up, but there’s always going to be something you want to watch that isn’t available. You can request a TV show or film by visiting help.netflix.com/en/TitleRequest. It’s an outside shot, but it’s worth a try. 12 useful Netflix features you need to know The end If you decide to cancel your Netflix subscription early, your Viewing Activity, recommendations and ratings will still be saved for 10 months. That essentially means there’s nothing to lose from closing your account down temporarily - you can pick up where you left off as soon as you resurrect it. It’s a good option to have if you’re about to go on holiday for a while or decide that you need to cut down on the amount of Netflix-bingeing you’ve been doing.\n\n“You can’t ask someone to act middle-aged,\" he said. \"Someone has to bring their own fatigue to it. The feelings we all have as 50-year-olds are different than the feelings we all have as 30-year-olds.\"\n\nThe Crown is expected to return to Netflix next year.", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2016/06/30/12/gettyimages-466905380.jpg?quality=75&width=1200&auto=webp", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2016/06/30/12/gettyimages-466905380.jpg?quality=75&width=982&height=726&auto=webp"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2016/06/30/12/gettyimages-466905380.jpg?quality=75&width=1200&auto=webp", "keywords": [], "authors": ["Jack Shepherd"], "canonical_link": "https://www.independent.co.uk/arts-entertainment/tv/news/the-crown-helena-bonham-carter-princess-margaret-netflix-season-3-release-date-vanessa-kirby-a8452466.html", "title": "The Crown season 3: First look as Helena Bonham Carter as Princess Margaret", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, user-scalable=no, minimum-scale=1.0, maximum-scale=1.0", "description": "The character was previously played by Vanessa Kirby", "theme-color": "#EC1A2E", "amp-google-client-id-api": "googleanalytics", "robots": "max-image-preview:large", "fb": {"app_id": 235586169789578, "pages": "https://www.facebook.com/TheIndependentOnline"}, "category": "News", "sitename": "The Independent", "page path": "/arts-entertainment/tv/news", "page type": "Article", "adPageType": "Article Page", "og": {"locale": "en_GB", "updated_time": "2018-07-18T14:12:14.000Z", "site_name": "The Independent", "title": "First look at Helena Bonham Carter as The Crown's new Princess Margaret revealed", "url": "https://www.independent.co.uk/arts-entertainment/tv/news/the-crown-helena-bonham-carter-princess-margaret-netflix-season-3-release-date-vanessa-kirby-a8452466.html", "type": "article", "description": "The character was previously played by Vanessa Kirby", "image": {"identifier": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2016/06/30/12/gettyimages-466905380.jpg?quality=75&width=1200&auto=webp", "secure_url": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2016/06/30/12/gettyimages-466905380.jpg?quality=75&width=1200&auto=webp"}}, "article": {"published_time": "2018-07-18T14:12:14.000Z", "modified_time": "2018-07-18T14:12:14.000Z", "section": "Culture", "subsection": "TV & Radio", "author_name": "Jack Shepherd", "content_type": "story", "word_count": 372, "image_count": 1, "embed_count": 2, "video_count": 0, "internal_link_count": 5, "external_link_count": 0}, "date": "2018-07-18T14:12:14.000Z", "google-signin-client_id": "329250492844-uqochn2f1j5ljkshuap5gc7qphf1refj.apps.googleusercontent.com", "twitter": {"title": "First look at Helena Bonham Carter as The Crown's new Princess Margaret revealed", "site": "@Independent", "card": "summary_large_image", "description": "The character was previously played by Vanessa Kirby", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2016/06/30/12/gettyimages-466905380.jpg?quality=75&width=1200&auto=webp"}, "keywords": "The Crown season 3,Helena Bonham Carter,Princess Margaret,Netflix,The Crown,Internal"}, "movies": [], "publish_date": 1531923134.0, "source": "https://www.independent.co.uk", "summary": ""}