{"url": "en.wikipedia.org/wiki/13_Reasons_Why", "text": "2017 American teen drama television series\n\nThis article is about the television series. For the novel it is based on, see Thirteen Reasons Why\n\n13 Reasons Why is an American teen drama television series developed for Netflix by Brian Yorkey and based on the 2007 novel Thirteen Reasons Why by author Jay Asher. The series revolves around high school student Clay Jensen (Dylan Minnette) and the aftermath of the suicide of fellow high school student Hannah Baker (Katherine Langford).[4] Before her death, she leaves behind a box of cassette tapes in which she details the reasons why she chose to end her life as well as the people she believes are responsible for her death.\n\nThrough its various storylines, the show explores and depicts a wide range of social issues affecting modern youth. The series was produced by July Moon Productions, Kicked to the Curb Productions, That Kid Ed Productions, Anonymous Content and Paramount Television, with Yorkey and Diana Son serving as showrunners for the first season, and Yorkey for the rest of the series. Dylan Minnette and Katherine Langford star as Clay Jensen and Hannah Baker, respectively, alongside an ensemble cast. A film from Universal Pictures based on Thirteen Reasons Why began development in February 2011, with Selena Gomez set to star as Hannah, before being shelved in favor of a television series and Netflix ordering an adaptation as a limited series in October 2015, with Gomez instead serving as an executive producer.[5]\n\nThe first season was released on Netflix on March 31, 2017. It received positive reviews from critics and audiences, who praised its themes, emotional weight, subject matter, character development and acting, particularly the performances of Minnette and Langford. For her performance, Langford received a Golden Globe Award nomination for Best Actress – Television Series Drama.[6] However, its graphic depiction of issues such as suicide, sexual assault, bullying, and rape (along with other mature content) prompted concerns from mental health professionals. In response, Netflix added a warning card in March 2018 that plays at the start of each season warning viewers about the themes of each season.[7] In July 2019, Netflix edited out the suicide scene in the first season's final episode.[8]\n\nIn May 2017, Netflix renewed 13 Reasons Why for a second season due to the success of the initial 13 episodes;[9] the second season was released on May 18, 2018, and was met with generally negative critical reviews. Coinciding with the release of the second season, Netflix released a video with the cast that cautioned viewers on some of the topics covered in the show and provided a support website with crisis numbers for people affected by depression, anxiety and other mental health issues.[10] A third season was ordered in June 2018 and was released on August 23, 2019. In August 2019, the series was renewed for a fourth and final season, which premiered on June 5, 2020.\n\nPlot [ edit ]\n\nThe series is set in the late 2010s in the fictional county of Evergreen, California. Most of the main characters in the series are students of Liberty High School.\n\nThe first season follows Liberty High student Clay Jensen, who receives a set of cassette tapes at his front porch. These tapes were recorded by Hannah Baker, a former Liberty High student who had killed herself and recorded thirteen reasons why she did so on the tapes. Each tape includes a reason for the following people: Justin Foley, Jessica Davis, Alex Standall, Tyler Down, Courtney Crimsen, Marcus Cole, Zach Dempsey, Ryan Shaver, Sheri Holland, Clay himself, Hannah herself, Bryce Walker, and Kevin Porter (a school guidance counselor who is the only non-student among the tape subjects). The season features flashbacks viewed from Hannah's perspective that offer increasing clarity as to the trauma she faced during her time as a student and what ultimately led up to her own death.\n\nIn the second season, Hannah's parents sue the school district, during which Hannah's tapes are released online. The fallout from the events of the first season and the toll it has taken on the lives of Liberty High's students is further shown. At the end of the season, Tyler attempts a school shooting after he is severely traumatized by the bully Monty but is stopped by Clay and Tony. Tyler's gun is given to Clay before Tony drives Tyler away.\n\nIn the third season, which introduces a new main character, Ani Achola, and takes place eight months after the events of the previous season, Clay and his friends struggle to keep Tyler's cover of his attempted school shooting and to help him in his recovery. Tensions rise among the tape subjects after Bryce is killed, with Clay as a suspect. In the wake of his death, Bryce's past actions and the person he has become in the aftermath of the release of Hannah's tapes are examined.\n\nIn the fourth and final season, Clay begins to develop mental health problems following the deaths of Bryce and Monty, while the students of Liberty High are planning for their impending graduation.\n\nCast and characters [ edit ]\n\nMain [ edit ]\n\nRecurring [ edit ]\n\nIntroduced in season one [ edit ]\n\nIntroduced in season two [ edit ]\n\nParminder Nagra as Priya Singh (guest seasons 2, 4; recurring season 3), the school counsellor who replaces Mr. Porter at Liberty High\n\nAnne Winters as Chlöe Rice, a smart, popular girl at Liberty High and the new head cheerleader who is also Bryce's girlfriend. At the end of the second season, it is revealed that she is pregnant but she later undergoes an abortion.\n\nJake Weber as Barry Walker (season 2; guest season 3), Bryce's father\n\nAustin Aaron as Luke Holliday, Quarterback at Liberty High. Caught for steroids in season 3.\n\nMeredith Monroe as Carolyn Standall, Alex's mother\n\nR.J. Brown as Caleb, Tony's boxing trainer and boyfriend\n\nBryce Cass as Cyrus, an edgy, cynical mischief maker who serves as an unexpected champion of the downtrodden. He befriends Tyler and the two together embark on smear campaigns against bullies.\n\nChelsea Alden as Mackenzie (seasons 2–3), Cyrus' sister, an artsy and witty girl who is not afraid to speak her mind. In the second season, she briefly develops a relationship with Tyler, though the latter breaks it up.\n\nAllison Miller as Sonya Struhl (season 2), a smart and ambitious young litigator, who defends the school during the Hannah Baker trial\n\nBrandon Butler as Scott Reed (seasons 2, 4), a student at Liberty High who is on the baseball team\n\nSamantha Logan as Nina Jones (season 2), a well-respected track star who befriends Jessica over shared sexual assault pasts\n\nKelli O'Hara as Jackie (season 2), a passionate advocate for victims of bullying\n\nBen Lawson as Rick Wlodimierz (season 2), the baseball coach at Liberty High, who supports and protects his players\n\nKeon Motakhaveri as Chad Moore, one of Cyrus' friends\n\nSpencer Moore II as Michael (season 2), one of Nina's friends\n\nJames Cretan as Eric Cox, one of Cyrus' friends\n\nMason Guccione as Toby Fletcher, one of Cyrus' friends\n\nMikko Edwards as Jada (season 2), a cheerleader at Liberty High\n\nIntroduced in season three [ edit ]\n\nBex Taylor-Klaus as Casey Ford (season 3), a member of HO and Jessica's friend, though they often clash\n\nHart Denton as Dean Holbrook (season 3), a student at Hillcrest who does not like Bryce\n\nNana Mensah as Amara Josephine Achola (season 3, guest season 4), Ani's strict mother and the Walker's nurse and housekeeper\n\nBenito Martinez as Sheriff Diaz, the head police officer in Bryce's murder case.\n\nMarcus DeAnda as Mr. de la Cruz (season 3), Monty and Estela's abusive father\n\nRaymond J. Barry as Harrison Chatham (season 3), Nora's sick father and Bryce's grandfather\n\nYaYa Gosselin as Graciella Padilla, Tony's younger sister (guest seasons 3–4)\n\nChristine Flores as Rosa Padilla, Tony's mother (season 3)\n\nBrandon Scott as J. J. Kerba, a football coach at Liberty High, who is hard on the players to get them to shape up\n\nJ. Kerba, a football coach at Liberty High, who is hard on the players to get them to shape up Ron Rogge as Morris, the head football coach at Liberty High\n\nBlake Webb as Tim Pozzi (season 3), a drug dealer who sells cheap steroids at the local gym\n\nIntroduced in season four [ edit ]\n\nInde Navarrette as Estela de la Cruz, Monty's younger sister\n\nReed Diamond as Hansen Foundry, the Dean of Discipline at Liberty High School\n\nYadira Guevara-Prip as Valerie Diaz, the daughter of police chief Diaz\n\nMatt Passmore as Ted Wynn, a police officer who takes an interest in Tony and his boxing abilities\n\nEpisodes [ edit ]\n\nSeason Episodes Originally released 1 13 March 31, 2017 ( ) 2 13 May 18, 2018 ( ) 3 13 August 23, 2019 ( ) 4 10 June 5, 2020 ( )\n\nBackground and production [ edit ]\n\nDevelopment [ edit ]\n\nUniversal Studios purchased film rights to the novel on February 8, 2011, with Selena Gomez cast to play Hannah Baker.[20] On October 29, 2015, it was announced that Netflix would be making a television adaptation of the book with Gomez instead serving as an executive producer.[21][5] Tom McCarthy was hired to direct the first two episodes.[22] The series was produced by Anonymous Content and Paramount Television with Gomez, McCarthy, Joy Gorman, Michael Sugar, Steve Golin, Mandy Teefey, and Kristel Laiblin serving as executive producers.[22]\n\nOn May 7, 2017, it was announced that Netflix had renewed the series for a second season, which was released on May 18, 2018.[23]\n\nOn June 6, 2018, Netflix renewed the series for a third season, which was released on August 23, 2019.[24] It was dedicated to executive producer Steve Golin (founder and CEO of Anonymous Content), who died of Ewing's sarcoma on April 21, 2019, four months before the third season's release.[25]\n\nOn August 1, 2019, it was announced that the series had been renewed for a fourth and final season, which was released on June 5, 2020.\n\nCasting [ edit ]\n\nIn June 2016, Dylan Minnette, Katherine Langford, Christian Navarro, Alisha Boe, Brandon Flynn, Justin Prentice, Miles Heizer, Ross Butler, Devin Druid and Brian d'Arcy James were cast as the main leads.[18] In September, Amy Hargreaves, Kate Walsh and Derek Luke were cast.[16][17] Langford exited the show after the second season.\n\nIn August 2017, Jake Weber, Meredith Monroe, R. J. Brown, Anne Winters, Bryce Cass, Chelsea Alden, Allison Miller, Brandon Butler, Samantha Logan, Kelli O'Hara, and Ben Lawson were cast for season two.[26][27]\n\nIn September 2018, Timothy Granaderos and Brenda Strong were promoted to series regulars for season 3 after recurring in the previous seasons.[28] On September 5, 2019, Gary Sinise was cast as a series regular for the fourth season.[19] On February 11, 2020, Jan Luis Castellanos joined the cast as a series regular for the fourth season.[29]\n\nFilming [ edit ]\n\nFilming for the series took place in the Northern Californian towns of Vallejo, Benicia, San Rafael, Crockett and Sebastopol during the summer of 2016.[30][31] The 13-episode first season and the special were released on Netflix on March 31, 2017.[32][33] Therapy dogs were present on set for the actors because of the intense and emotional content of the series.[34]\n\nFilming for the second season began on June 12, 2017,[35] but was briefly halted in October in response to the then-ongoing Northern California wildfires happening around the areas where the series was being filmed.[36] Production on the second season wrapped in December 2017.[37] The second season was released on May 18, 2018.[38]\n\nFilming for the third season began on August 12, 2018, but was halted due to another wildfire until December 17.[39] Filming was scheduled to be completed on February 6, 2019.[40]\n\nThe fourth season began filming in July 2019 and finished in December 2019.[41]\n\nRelease [ edit ]\n\nThe first season was released on Netflix on March 31, 2017. It received positive reviews, who praised its subject matter and acting, particularly the performances of Minnette and Langford. For her performance, Langford received a Golden Globe Award nomination for Best Actress – Television Series Drama.[6] However, its graphic depiction of issues such as suicide and rape (along with other mature content) prompted concerns from mental health professionals. In response, Netflix added a warning card and from March 2018 on, a video plays at the start of each season warning viewers about its themes.[7] In July 2019, Netflix edited out the suicide scene in the first season's final episode.[8]\n\nNetflix renewed 13 Reasons Why for a second season in May 2017 due to the success of the initial 13 episodes; filming of the second season began the next month and concluded that December. The second season was released on May 18, 2018. Coinciding with the release of the second season, Netflix released a video with the cast that cautioned viewers on some of the topics covered in the show and provided a support website with crisis numbers for people affected by depression, anxiety and other mental health issues.[10] A third season was ordered in June 2018 and was released on August 23, 2019. In August 2019, the series had been renewed for a fourth and final season, which premiered on June 5, 2020. Critical and audience reaction to the series has been divided, with the program generating controversy between audiences and industry reviewers alongside acquiring a loyal following.[42][43][44]\n\nReception [ edit ]\n\nCritical response [ edit ]\n\nSeason 1 [ edit ]\n\nThe first season has received positive reviews, with praise for the acting (particularly that of Minnette, Langford, and Walsh), directing, story, visuals, themes, improvements upon its source material, and mature approach to dark and adult subject matter. The review aggregator website Rotten Tomatoes reported a 78% approval rating with an average rating of 7.14/10, based on 63 reviews. The website's critical consensus reads, \"13 Reasons Why complements its bestselling source material with a gripping look at adolescent grief whose narrative maturity belies its YA milieu.\"[45] Metacritic, which uses a weighted average, assigned a score of 76 out of 100, based on 17 critics, indicating generally favorable reviews.[46]\n\nJesse Schedeen of IGN praised 13 Reasons Why, giving it a 9.2 out of 10, \"Amazing\", stating that the series is \"a very powerful and hard-hitting series\" and \"ranks among the best high school dramas of the 21st century\".[52] Matthew Gilbert of The Boston Globe gave a glowing review for the series, saying, \"The drama is sensitive, consistently engaging, and, most importantly, unblinking.\"[53] Maureen Ryan of Variety asserts that the series \"is undoubtedly sincere, but it's also, in many important ways, creatively successful\" and called it \"simply essential viewing\".[54] Leah Greenblatt of Entertainment Weekly gave the entire season a score of B+, calling the series \"a frank, authentically affecting portrait of what it feels like to be young, lost and too fragile for the world\".[55] Daniel Feinberg of The Hollywood Reporter also praised the series, calling it \"an honorably mature piece of young-adult adaptation\", and citing its performances, direction, relevance and maturity as some of the series' strongest points.[56]\n\nThe acting, particularly Katherine Langford as Hannah and Dylan Minnette as Clay, was frequently praised in reviews. Schedeen of IGN praised the cast, particularly Minnette and Langford, stating: \"Langford shines in the lead role ... [and] embodies that optimism and that profound sadness [of Hannah's] as well. Minnette's Clay is, by design, a much more stoic and reserved character ... and does a fine job in what's often a difficult role.\"[52] Gilbert of The Boston Globe praised the chemistry of Langford and Minnette, saying that \"watching these two young actors together is pure pleasure\", while Schedeen of IGN also agreed, saying that they are \"often at their best together, channeling just the right sort of warm but awkward chemistry you'd expect from two teens who can't quite admit to their feelings for one another\". Feinberg of The Hollywood Reporter also praises both actors: \"Langford's heartbreaking openness makes you root for a fate you know isn't possible. The actress' performance is full of dynamic range, setting it against Minnette's often more complicated task in differentiating between moods that mostly go from uncomfortable to gloomy to red-eyed, hygiene-starved despair.\"[56]\n\nRyan of Variety also gave praise to not only the two leads, but also the supporting cast of actors, particularly Kate Walsh's performance as Hannah's mother, which Ryan describes as \"career-best work\".[54] Positive mentions from various critics, such as Ryan, Feinberg and Schedeen, were also given to the supporting cast of actors (most particularly Alisha Boe, Miles Heizer and Christian Navarro's respective performances as Jessica, Alex and Tony). Liz Shannon Miller of Indiewire, who enjoyed the series and gave it a positive score of B+, gave praise to the racial, gender and complex diversity of its supporting cast of teens.[54][52][56][57]\n\nAnother aspect frequently mentioned within reviews was the series's mature and emotional approach to its dark and adult subject matter. This was favorably reviewed by critics, such as Miller of Indiewire, particularly her statement that \"the adult edges to this story ring with honesty and truth.\"[57] Miller, and Feinberg of The Hollywood Reporter, also stated that the series can be difficult to watch at times,[56] while Schedeen of IGN states that it is \"an often depressing and even uncomfortable show to watch ... a pretty emotionally draining experience, particularly towards the end as the pieces really start to fall into place.\"[52]\n\nCritics also praised several other aspects of the series. Feinberg highlighted the series' directors, saying: \"A Sundance-friendly gallery of directors including Tom McCarthy, Gregg Araki and Carl Franklin keeps the performances grounded and the extremes from feeling exploitative\",[57] while Gilbert of The Boston Globe praised the storytelling: \"The storytelling techniques are powerful ... [as it] builds on the world established in the previous hour, as we continually encounter new facets of Hannah's life and new characters. The background on the show keeps getting deeper, richer.\"[53]\n\nConversely, the series has also received criticism over its portrayal of teen angst. Mike Hale of The New York Times wrote a critical review, writing, \"the show doesn't make [Hannah's] downward progress convincing. It too often feels artificial, like a very long public service announcement.\" He also criticized the plot device that has Clay listening to the tapes one by one instead of all in one sitting like the other teens did, which Hale felt was unbelievable: \"It makes no sense as anything but a plot device, and you'll find yourself, like Clay's antagonists, yelling at him to listen to the rest of tapes already.\"[58]\n\nWriting for The Guardian, Rebecca Nicholson praised some aspects of the series, including the performances from Minnette and Walsh, but was troubled by much of the plot, writing, \"a storyline that suggests the love of a sweet boy might have sorted all this out added to an uneasy feeling that stayed with me\". Nicholson was skeptical that the series would appeal to older viewers, unlike other series set in high school such as Freaks and Geeks and My So-Called Life: \"It lacks the crossover wit of its forebears ... It's too tied up in conveying the message that terrible behaviour can have horrible consequences to deal in any subtleties or shades of feeling. It's largely one-note – and that note is horrifying. 'It has to get better,' implores one student towards the end, but given its fairly open ending, an apparent season two setup, it does not seem as if there's much chance of that happening.\"[59]\n\nThe Washington Post television critic Hank Stuever wrote a negative review, finding 13 Reasons Why \"contrived\" and implausible: \"There are 13 episodes lasting 13 super-sullen hours – a passive-aggressive, implausibly meandering, poorly written and awkwardly acted effort that is mainly about miscommunication, delivering no more wisdom or insight about depression, bullying and suicide than one of those old ABC Afterschool Specials people now mock for being so corny.\" He also wrote that he found Hannah's suicide tapes \"a protracted example of the teenager who fantasizes how everyone will react when she's gone. The story ... strikes me as remarkably, even dangerously, naive in its understanding of suicide, up to and including a gruesome, penultimate scene of Hannah opening her wrists in a bathtub.\"[60]\n\nDavid Wiegand of the San Francisco Chronicle gave the series a tepid review, saying that it was plagued by character inconsistencies, particularly in Hannah's character. He praised Langford's \"stunning performance\" but noted, \"There are times when we simply don't believe the characters, when what they do or say isn't consistent with who we've been led to believe they are ... At times, [Hannah] is self-possessed and indifferent at best to the behavior of the popular kids. At other times, though, relatively minor misperceived slights seem to send her into an emotional tailspin. No doubt, teenagers embody a constant whirl of conflicting emotions, but the script pushes the bounds of credibility here and there.\" He noted that overall, the series worked: \"The structure is gimmicky and the characters inconsistent, but there are still at least 13 Reasons Why the series is worthy.\"[61]\n\nSeason 2 [ edit ]\n\nThe second season received generally negative reviews from critics, with many praising the performances (particularly that of Boe, Luke, and Walsh) but criticism aimed at the poor execution of its topics; many declared it unnecessary.[62][63] Rotten Tomatoes reports an approval rating of 27% with an average rating of 5.31/10, based on 51 reviews. The site's critical consensus states, \"By deviating from its source material, 13 Reasons Why can better explore its tenderly crafted characters; unfortunately, in the process, it loses track of what made the show so gripping in the first place.\"[47] On Metacritic, the season has an average score of 49 out of 100, based on 16 critics, indicating \"mixed or average reviews\".[48]\n\nCatherine Pearson from Digital Spy wrote a negative review, calling the season \"even more problematic\" than the first. She ends the review saying that, \"Unrelenting depression seems to shroud the season, briefly lifted only to collapse back down as the show's thirteenth episode, once again, delivers a deeply disturbing scene of suffering.\"[64] Jordan Davidson from The Mighty wrote that he \"felt sick\" after watching the final episode of the season.[65]\n\nA scene in which the character Tyler Down (Devin Druid) is attacked and sexually assaulted with a mop handle by bully Montgomery De La Cruz (Timothy Granaderos) during the finale also caused controversy from fans and critics of the series, with some describing it as \"unnecessary\" and \"traumatizing\".[66] Series showrunner Brian Yorkey defended the scene, saying that it was included in an attempt to \"tell truthful stories about things that young people go through in as unflinching a way as we can\".[67]\n\nSeason 3 [ edit ]\n\nSeason 3 received overwhelmingly negative reviews, with criticism aimed at the lack of necessity and talk about suicide, poor execution of its topics, including the rape of Tyler in the final episode of the previous season,[68][69] the new character of Ani,[70] the sympathetic redemption of Bryce,[71] genre changing from drama to mystery, and the conclusion. However, some praised the technical aspects and the performances (particularly those of Prentice, Druid, and Granaderos).[72]\n\nReview aggregator Rotten Tomatoes reports an approval rating of 12%, with an average rating of 1.43/10, based on 17 reviews. The site's critical consensus reads: \"13 Reasons Why attempts to break away from its first two seasons only to become a melodramatic mess of a murder mystery.\"[49] On Metacritic, the season has an average score of 23 out of 100, based on 4 critics, indicating \"generally unfavourable reviews\".[50]\n\nSeason 4 [ edit ]\n\nSeason 4 received generally negative reviews from critics, who criticized the poor execution of its topics, the writing, time jumps and story, while the ending was met with a divided reception. However, some called it an improvement over its previous season, and praised the performances of the cast – particularly those of Minnette, Navarro, Flynn, and Heizer – the brief return of Hannah Baker, and technical aspects.[73][74][75][76]\n\nReview aggregator Rotten Tomatoes reports an approval rating of 25%, with an average rating of 5.33/10, based on 12 reviews. The site's critical consensus states: \"13 Reasons Why closes with a chaotic final chapter that betrays what little dignity remained in the tragic lives of its central teens.\"[51] Episode six, in which the school runs a \"drill\" where the students are made to believe there is an active shooter was heavily criticized, with many fans and critics describing the episode as \"too realistic\", \"triggering\" and \"traumatising\" although some reviewers noted that the show had tackled a topic that is relevant to many American school students.[77][78] The storyline of Justin Foley being diagnosed with and killed by complications of AIDS generated controversy, with many calling it unfair.[79] Minnette defended the scene, saying that he and Flynn had pushed showrunner Brian Yorkey to kill Justin, as they \"both felt that it would have the biggest emotional impact on the series as [Justin] had the most emotional impact out of all of the characters\".[80]\n\nAudience viewership [ edit ]\n\nThe marketing analytics firm Jumpshot determined the first season was the second-most viewed Netflix season in the first 30 days after it premiered, garnering 48% of the viewers that the second season of Daredevil received, which was the most viewed season according to Jumpshot. The series also showed an 18% increase in week-over-week viewership from week one to week two. Jumpshot, which \"analyzes click-stream data from an online panel of more than 100 million consumers\", looked at the viewing behavior and activity of the company's U.S. members, factoring in the relative number of U.S. Netflix viewers who watched at least one episode of the season.[81] The second season became the eighth most watched English-language television series on Netflix, with 496.1 million hours viewed.[82]\n\nAwards and nominations [ edit ]\n\nControversy [ edit ]\n\nThe release of the show caused public concern about the risk of suicide contagion among teenagers – particularly in those who have suicidal thoughts.[93] The portrayal of sensitive content such as teen suicide, self-harm, rape and bullying raised criticism,[92] especially for its graphic content, primarily the scene in which Hannah kills herself. Some researchers and medical professionals argue that the series violated guidelines for depicting suicide in the media and might trigger \"imitative\" behaviors among high school students and vulnerable people.[94]\n\nPrior to the series' release, scholars had studied the influence of the media on suicide for decades.[95] Evidence to support the existence of a relationship between fictional media exposure and suicide behaviors remained weak and a strict causality had never been established.[96] The effect that fiction can have on suicidal thoughts and behaviors is probably smaller than that of other psychological and social risk factors for suicide.[97][98] It has been argued that censoring fiction may do more harm than good.[97][99]\n\nAfter the series' release, a study published in the Journal of the American Academy of Child and Adolescent Psychiatry found that suicide among teenagers rose by 28.9% in the month after Netflix launched the show.[100][101]\n\nCriticism [ edit ]\n\nSeveral health professionals, educators and advocates linked the show to self-harm and suicide threats among young people. This community also expressed major concerns about the series like romanticizing suicide, not providing adequate resources at the conclusion of each episode, targeting a young vulnerable audience, and painting mental health professionals as unhelpful and not worth seeing.[102][103][104] Mental health experts are also educating the general public on what to do in the situations Hannah Baker goes through, disseminating accurate information surrounding teen suicide, depression, and youth that experience traumatic events through research surrounding the show and mental health resources for help-seeking youth.[112]\n\nThe release of 13 Reasons Why corresponded with between 900,000 and 1.5 million more suicide-related Google searches in the United States, including a 26% increase in searches for \"how to commit suicide,\" an 18% increase for \"commit suicide,\" and a 9% increase for \"how to kill yourself.\"[113] After an initial spike in calls to the Crisis Text Line after the first episode, there was an overall reduction in crisis call volume for the remainder of the series.[114] Although the link between searching for suicide information and suicide risk is unclear,[115] increases in self-harm admissions to one children's hospital were observed.[116][117][118][119][120]\n\nThe superintendent of Palm Beach County, Florida schools reportedly told parents that their schools had seen an increase in suicidal and self-harming behavior from students, and that some of those students \"have articulated associations of their at-risk behavior to the 13 Reasons Why Netflix series\".[121]\n\nThe Australian youth mental health service for 12–25 year-olds, Headspace, issued a warning in late April 2017 over the graphic content featured in the series, due to the increased number of calls to the service following the series' release in the country. Netflix however, demonstrably complied with the Australian viewer ratings system, by branding the series as \"MA15+\" when streamed via its own interface. They accompanied its presentation with additional warnings and viewer advice, and ensured that counselling referrals were included and not easily skipped at the conclusion of each episode. Each warning voice over is read by a different cast member at the end of the episode, with Katherine Langford reading in her native Australian accent in her voice-overs.[122][123][124]\n\nIn response to the graphic nature of the series and New Zealand's high youth suicide rate, which was the highest among the 34[a] OECD countries during 2009 to 2012,[126][127] the Office of Film & Literature Classification in the country created a new rating, \"RP18\", allowing individuals aged 18 and over to watch the series alone and those below having to watch it with supervision from a parent or guardian.[128][129]\n\nIn April 2017, the National Association of School Psychologists (NASP) in the United States released a statement regarding the series, saying: \"Research shows that exposure to another person's suicide, or to graphic or sensationalized accounts of death, can be one of the many risk factors that youth struggling with mental health conditions cite as a reason they contemplate or attempt suicide.\"[130] NASP sent a letter to school mental health professionals across the country about the series, reportedly a first for NASP in response to a television series.[131] The following month, the United States Society of Clinical Child and Adolescent Psychology (SCCAP) released a statement also noting how strongly the series may serve as a trigger for self-injury among vulnerable youth. They lamented the depiction of mental health professionals as ineffective for youth who have experienced trauma and may have been considering suicide.[132] The statement implored Netflix to add a tag following each episode with mental health resources, and a reminder that depression and suicidal thoughts can be effectively treated by a qualified mental health professional, such as a clinical child psychologist, using evidence-based practice.\n\nSimilarly, clinical psychologists such as Daniel J. Reidenberg and Erika Martinez, as well as mental health advocate MollyKate Cline of Teen Vogue magazine, have expressed concerns regarding the risk of suicide contagion.[133][134][135] However, Eric Beeson, a counselor at The Family Institute at Northwestern University noted that \"it's unlikely that one show alone could trigger someone to attempt suicide.\"[130] Mental health professionals have also criticized the series' depiction of suicide itself, much of which violates widely promulgated recommendations for reporting on actual suicides or not depicting them in fiction, in order to not encourage copycat suicides.[136] The season finale, which depicts Hannah's suicide in graphic detail, has been particularly criticized in this regard.[137] Nic Sheff, a writer for the series, has defended it as intended to dispel the myth that suicides \"quietly drift off\", and recalled how he himself was deterred from a suicide attempt by recalling a survivor's account of how painful and horrifying it was.[138]\n\nExecutive producer Selena Gomez, in defense of the controversy surrounding the series, stated:\n\nWe stayed very true to the book and that's initially what Jay Asher created was a beautifully tragic, complicated yet suspenseful story and I think that's what we wanted to do ... We wanted to do it justice and yeah the backlash is gonna come no matter what. It's not an easy subject to talk about, but I'm very fortunate with how it's doing.[139]\n\nThe NASP statement also criticized the series' suggestion that bullying alone led Hannah to take her life, noting that while it may be a contributing factor, suicide far more often results from the bullied person having a \"treatable mental illness and overwhelming or intolerable stressors\", along with a lack of adequate coping mechanisms. Alex Moen, a school counselor in Minneapolis, took issue with the series' entire plotline as \"essentially a fantasy of what someone who is considering suicide might have—that once you commit suicide, you can still communicate with your loved ones, and people will suddenly realize everything that you were going through and the depth of your pain ... That the cute, sensitive boy will fall in love with you and seek justice for you, and you'll be able to orchestrate it, and in so doing kind of still be able to live.\"[137] Other counselors criticized the depiction of Hannah's attempt to reach out to Mr. Porter as dangerously misleading, since not only does he miss obvious signs of her suicidal ideations, but says he cannot report her sexual assault to the police without her identifying the assailant. School counselors are often portrayed as ineffective or clueless in popular culture, Moen says, but Porter's behavior in the series goes beyond that, to being unethical and possibly illegal. \"It's ridiculous! Counselors are not police. We don't have to launch an investigation. We bring whatever information we do have to the police\", she told Slate.[137]\n\nIn May 2017, the Canadian Mental Health Association (CMHA) along with the Centre for Suicide Prevention (CSP) released a statement with similar concerns to the ones raised by NASP. CMHA believed that the series may glamorize suicide, and that some content may lead to distress in viewers, particularly in younger viewers. Furthermore, the portrayal of Hannah's suicide does not follow the media guidelines as set out by the Canadian Association for Suicide Prevention (CASP) and the American Association of Suicidology. CMHA and CASP did praise the series for raising awareness about \"this preventable health concern,\" adding that, \"Raising awareness needs to be done in a safe and responsible manner. A large and growing body of Canadian and international research has found clear links between increases in suicide rates and harmful media portrayals of suicide.\" Ways in which the portrayals of suicide may cause harm, according to CMHA and CASP, include the following: \"They may simplify suicide, such as, by suggesting that bullying alone is the cause; they may make suicide seem romantic, such as, by putting it in the context of a Hollywood plot line; they may portray suicide as a logical or viable option; they may display graphic representations of suicide which may be harmful to viewers, especially young ones; and/or they may advance the false notion that suicides are a way to teach others a lesson.\"[140][141] A 2019 study showed the overall suicide rate among 10- to 17-year-olds increased significantly in the month immediately following the release of the series.[101]\n\nNetflix response [ edit ]\n\nNetflix responded to the criticism surrounding the series by adding strong advisory warnings prior to the ninth, twelfth, and thirteenth episodes in the first season, the first two due to rape and the last due to the suicide scene. In July 2019, before the release of season three, Netflix edited the suicide scene of the season one finale. Originally, the episode included a bloody depiction of Hannah slitting her wrists in a bathtub.[142] However, it has been argued support to vulnerable viewers should be inspired by an ethical commitment toward the audience, rather than the moral panic for suicide contagion.[99]\n\nBeyond the Reasons [ edit ]\n\nWith the release of the first season of the series, Netflix also released 13 Reasons Why: Beyond the Reasons, an aftershow documentary television film. The 29-minute documentary featured the cast and crew of the series and mental health professionals discussing their experiences working on the series and dealing with different issues including bullying, depression and sexual assault. Two more Beyond the Reasons specials were released with the second and third seasons respectively.[143][144][145]\n\nSeason Episodes Originally released 1 1 March 31, 2017 ( ) 2 1 May 18, 2018 ( ) 3 1 August 23, 2019 ( )\n\nSeason 1 (2017) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Original release date 1 1 \"Beyond the Reasons Season 1\" March 31, 2017 ( )\n\nSeason 2 (2018) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Original release date 2 1 \"Beyond the Reasons Season 2\" May 18, 2018 ( )\n\nSeason 3 (2019) [ edit ]\n\nNo.\n\noverall No. in\n\nseason Title Original release date 3 1 \"Beyond the Reasons Season 3\" August 23, 2019 ( )\n\nSoundtrack [ edit ]\n\nCompilation soundtracks have been released for the first three seasons, as well as score albums featuring the show's original score by Eskmo.[146][147][148][149][150]\n\nSeason 1 [ edit ]\n\nTrack listing [ edit ]\n\nSeason 2 [ edit ]\n\n13 Reasons Why: Season 2 (A Netflix Original Series Soundtrack) Soundtrack album by Various artists Released May 18, 2018 ( ) Length 1 : 12 : 17 Label Interscope Records Singles from 13 Reasons Why: Season 2 (A Netflix Original Series Soundtrack)\n\nReleased: April 19, 2018\n\nReleased: May 10, 2018\n\nReleased: May 15, 2018\n\nReleased: December 14, 2018\n\nTrack listing [ edit ]\n\nSeason 3 [ edit ]\n\n13 Reasons Why: Season 3 (A Netflix Original Series Soundtrack) Soundtrack album by Various artists Released August 23, 2019 ( ) Length 1 : 03 : 50 Label Interscope Records Singles from 13 Reasons Why: Season 3 (A Netflix Original Series Soundtrack)\n\nReleased: August 1, 2019\n\nReleased: August 12, 2019\n\nReleased: August 21, 2019\n\nReleased: October 30, 2019\n\nTrack listing [ edit ]\n\nSee also [ edit ]\n\nNotes [ edit ]\n\n^ [125] The 2009–2012 data exclude Latvia, which became the 35th OECD member country on July 1, 2016.", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Katherine_Langford_in_2018.jpg/120px-Katherine_Langford_in_2018.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/7/73/Netflix%27s_13_Reasons_Why_title_screen.png", "http://upload.wikimedia.org/wikipedia/en/thumb/9/99/13-Reasons_Why_Soundtrack_Season_3.jpg/220px-13-Reasons_Why_Soundtrack_Season_3.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/5/5c/Symbol_template_class.svg/16px-Symbol_template_class.svg.png", "http://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Alisha_Boe_in_2018_crop.jpg/128px-Alisha_Boe_in_2018_crop.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/7/73/Netflix%27s_13_Reasons_Why_title_screen.png/250px-Netflix%27s_13_Reasons_Why_title_screen.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/f/fd/13_Reasons_Why_season_2_Soundtrack.jpg/220px-13_Reasons_Why_season_2_Soundtrack.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/0/09/13_Reasons_Why_season_1_Soundtrack.jpg/220px-13_Reasons_Why_season_1_Soundtrack.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://en.wikipedia.org/static/images/footer/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Wikiversity_logo_2017.svg/16px-Wikiversity_logo_2017.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Dylan_Minnette_in_2018.jpg/136px-Dylan_Minnette_in_2018.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/7/73/Netflix%27s_13_Reasons_Why_title_screen.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/13_Reasons_Why", "title": "13 Reasons Why", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/7/73/Netflix%27s_13_Reasons_Why_title_screen.png", "width": 640, "height": 341}, "title": "13 Reasons Why - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}