{"url": "https://www.usatoday.com/story/life/books/2018/09/17/chrissy-teigens-famous-banana-bread-recipe/1283473002/", "text": "Try Chrissy Teigen's famous banana bread recipe that set social media abuzz\n\nBanana bread is having a moment, thanks to the coronavirus quarantine. While self-isolating at home, we're googling recipes that bring back memories of youth and put the \"comfort\" in comfort food. And according to search trends, banana bread is king.\n\nWhen the news cycle continues to be, well, a bummer, we turn to comfort food. One of our favorites? Banana bread. It's easy and delicious, and we can almost convince ourselves it's healthy because it has fruit.\n\nSo we thought we'd re-share one of our favorite comfort foods from our favorite model-turned-cookbook author and social media aficionado, Chrissy Teigen.\n\nTeigen had Twitter going gaga when she sent out a call to action to her followers in the Los Angeles area back in September 2017.\n\nShe needed six brown bananas, \"not four, not five,\" but six brown bananas. She was in the midst of researching and testing recipes for her cookbook, \"Cravings: Hungry for More\" (Clarkson Potter).\n\nAccording to Teigen, \"perfecting this single recipe took me nearly a year. That’s why I needed so many damn bananas.\" Luckily, it will only take you an hour and 15 minutes to actually prepare and bake it.\n\nPANCAKE RECIPE: Dessert for breakfast: Try this recipe for strawberry cheesecake pancakes\n\nEASY BREAD RECIPES: Even if you're out of yeast, milk or butter\n\nSo for those looking for a new twist on an old classic and the perfect recipe for those ripening bananas, we present the recipe that took Twitter, and readers, by storm.\n\nFRENCH TOAST CASSEROLE RECIPE: French toast casserole is easy to make and looks exquisite\n\nTwitter's (And Uncle Mike's) Banana Bread\n\nIngredients:\n\n2 cups mashed very ripe bananas *\n\n4 eggs\n\n2⁄3 cup canola oil, plus a little more to grease the pan\n\n2 cups all-purpose flour, plus a little more for dusting the pan\n\n2 cups sugar\n\n1 (3.5-ounce) box vanilla instant pudding mix **\n\n1 teaspoon baking soda\n\n1½ teaspoons kosher salt\n\n1 cup unsweetened shredded coconut\n\n1 (3.5-ounce) bar dark chocolate, chopped into chunks\n\nSalted butter, for serving\n\nDirections\n\nPreheat the oven to 325°F.\n\nIn a large bowl, combine the mashed bananas, eggs, and oil. In a separate bowl, combine the flour, sugar, pudding mix, baking soda, and salt. Add the dry ingredients to the wet ingredients and combine well BUT GENTLY. I swear this came out differently when I used an aggressive electric mixer. Fold in the coconut and chocolate chunks.\n\nGrease and flour a Bundt pan (that means wipe a little grease all over the inside of the pan, dust it with flour, and tip it upside down to shake out any extra flour). Pour the batter into the pan. (This can also make two 8 × 4-inch loaves, but it’s so much more moist in one Bundt pan!)\n\nBake until the cake springs back when lightly pressed and a toothpick inserted into the center comes out clean, 55 to 60 minutes. (Test it with a toothpick at around 50 minutes.) Let it cool slightly in the pan, then use a butter knife to gently release the cake from the sides of the pan and around the inner circle, then flip it onto a plate.\n\nLet it cool and cut it into slices. Rewarm them and serve them with salty butter!!\n\n* Get six brown bananas. Not four. Not five. Six. You will think you only need five because it looks like enough, but it will not be enough. You will get five, you will mash them, you will be about half an inch short and that makes a difference and you cannot get around it. Trust me.\n\n** I won’t tell you what brand to use, but the right brand rhymes with smello. Don’t use banana-flavored pudding mix. I tried it. It is gross.\n\nRecipes and photographs reprinted from Cravings: Hungry for More. Copyright © 2018 by Chrissy Teigen.\n\nMore recipes to up your kitchen game:", "images": ["https://www.gannett-cdn.com/presto/2018/09/11/USAT/d2bcd6fb-eab6-4a4b-bc49-9b384fefe8c4-Twitters_Banana_Bread.jpg?auto=webp&crop=4356,2451,x0,y1360&format=pjpg&width=1200", "https://www.gannett-cdn.com/presto/2018/09/11/USAT/d2bcd6fb-eab6-4a4b-bc49-9b384fefe8c4-Twitters_Banana_Bread.jpg?crop=4356,3268,x0,y979?width=320&height=240", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/presto/2018/09/11/USAT/d2bcd6fb-eab6-4a4b-bc49-9b384fefe8c4-Twitters_Banana_Bread.jpg?auto=webp&crop=4356,2451,x0,y1360&format=pjpg&width=1200", "keywords": [], "authors": ["Mary Cadden"], "canonical_link": "https://www.usatoday.com/story/life/books/2018/09/17/chrissy-teigens-famous-banana-bread-recipe/1283473002/", "title": "Try Chrissy Teigen's famous banana bread recipe that set social media abuzz", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/books/2018/09/17/chrissy-teigens-famous-banana-bread-recipe/1283473002/life", "theme-color": "#ffffff", "og": {"type": "article", "title": "Try Chrissy Teigen's famous banana bread recipe that set social media abuzz", "description": "Chrissy Teigen shares her popular banana bread recipe that set social media abuzz and took 'nearly a year' to perfect.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/presto/2018/09/11/USAT/d2bcd6fb-eab6-4a4b-bc49-9b384fefe8c4-Twitters_Banana_Bread.jpg?auto=webp&crop=4356,2451,x0,y1360&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "Chrissy Teigen shares her popular banana bread recipe that set social media abuzz and took 'nearly a year' to perfect.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1537138800.0, "source": "https://www.usatoday.com", "summary": ""}