{"url": "https://www.hollywoodreporter.com/live-feed/marvels-new-warriors-squirrel-girl-cast-milana-vayntrub-derek-theler-topline-freeform-comedy-1019588", "text": "Three months after being picked up straight to series by Freeform, Marvel’s New Warriors has found its cast.\n\nMilana Vayntrub (This Is Us) has landed the breakout role of Squirrel Girl, while Baby Daddy grad Derek Theler will stay in business with Freeform after landing the role of Mister Immortal in Marvel’s first live-action scripted comedy.\n\nThe duo lead the ensemble cast in the 10-episode series about six young people learning to cope with their abilities in a world where bad guys can be as terrifying as bad dates. Joining Vayntrub and Theler are Jeremy Tardy as Night Thrasher, Calum Worthy as Speedball, Matthew Moy as Microbe and Kate Comer as Debrii.\n\n“I am thrilled beyond belief to be working with this incredible group of actors. They are funny, sincere, eager, charming and perfectly embody these characters. It’ll be a blast and an honor to create this show with each of them,” said showrunner — and longtime Squirrel Girl superfan — Kevin Biegel (Enlisted).\n\nPicked up straight to series in April, New Warriors hails from Marvel Television and ABC Studios’ cable arm ABC Signature. Marvel head of TV Jeph Loeb and Jim Chory executive produce alongside Biegel.\n\n“We’re so lucky to have assembled such a diverse and incredibly talented cast,” Loeb said. “We can’t wait for the fans to see what’s in store when we unleash these iconic characters into the world!”\n\nThe Squirrel Girl casting caps an extensive process that featured a personal campaign from Stranger Things breakout Shannon Purser (Barb) — who sources say was also in the running. Parenthood grad Mae Whitman — another outspoken fan of the character — was also discussed, sources say, but her series regular commitment to NBC’s upcoming Good Girls made that conversation short, though sources say the character was written with the actress in mind. Other actresses, including Anna Kendrick, had also expressed interest in taking on the character.\n\n“At Freeform, we are committed to finding distinct and entertaining characters that our audience can enjoy and relate to,” said Elizabeth Boykewich, senior vp casting and talent at Freeform. “We are excited to be working with Marvel Television to bring these fiercely average superheroes to life and watch them take on the world.”\n\nNew Warriors will launch in 2018. It is Freeform’s second Marvel series and joins Cloak and Dagger at the Disney-owned network. It is unclear if both series will launch at the same time and whether they would be paired together. For more on how the series fits in with the Marvel universe as well as at Freeform, read THR‘s interview with exec vp programming and development Karey Burke.\n\nRead the full character descriptions below.\n\nVayntrub (who recurred on NBC’s This Is Us as Kevin’s Broadway co-star Sloane) will take on Doreen Green — aka Squirrel Girl. Doreen is a totally empowered fangirl who has the incredible powers of a … squirrel. Her greatest quality is her optimism and her best friend is a pet squirrel, Tippy Toe. Vayntrub is repped by UTA and Ziffren Brittenham.\n\nTheler, who wrapped his six-season starring role on Freeform’s Baby Daddy in May, is Craig Hollis, aka Mister Immortal. Craig can’t die … or so he says. Although Craig’s superpower seems amazing, he hasn’t made use of it at all — he figures if he has all the time in the world to learn how to do anything heroic, what’s the rush? Theler is with Paradigm, Authentic Talent and Literary Management and Sloane Offer.\n\nTardy (Dear White People) takes on the role of Dwayne Taylor, aka Night Thrasher. Brilliant and noble and maybe a bit full of himself, Dwayne is a shameless self-promoter and entrepreneur who also deeply believes in justice. Tardy is with the Kohner Agency and Generate.\n\nWorthy (Austin & Ally, Cassandra French’s Finishing School) will play Robbie Baldwin, aka Speedball. Robbie is an impulsive people-pleaser with a misplaced sense of confidence who throws kinetic balls of energy that are completely out of control. Worthy is repped by CTM International, Principato Young and Myman Greenspan.\n\nMoy will take on the role of Zack Smith, aka Microbe. Zack is a shy hypochondriac who has the ability to talk to germs, which can tell him where you’ve been, what you ate and who you hung out with. It’s impossible to keep secrets around him. Moy is fresh off his six-season run on CBS’ recently canceled 2 Broke Girls, where he played diner owner Han. The actor, who also counts Steven Universe among his credits, is repped by AKA Talent Agency, Management 360 and Lichter Grossman.\n\nComer (The Comeback) rounds out the cast as Deborah Fields, aka Debrii. Deborah is proud, funny and quick-witted. Confidently out as a lesbian, Deborah is a low-level telekinetic — very low. Like, she-can-move-a-paper-cup low. Comer is with Esteemed Artists Talent and CESD.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/07/matthew_moy_-_publicity_-_embed_2017.jpg?w=928", "https://www.hollywoodreporter.com/wp-content/uploads/2017/07/derek_theler_and_milana_vayntrub_-_split_-_getty_-_h_2017.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2017/07/calum_worthy_-_embed_2017.jpg?w=928", "https://www.hollywoodreporter.com/wp-content/uploads/2017/07/new_warriors_art_-_publicity_-_embed_2017.jpg?w=600", "https://www.hollywoodreporter.com/wp-content/uploads/2017/07/kate_comer_-_publicity_-_embed_2017.jpg?w=618", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.hollywoodreporter.com/wp-content/uploads/2017/07/jeremy_tardy_-_publicity_-_embed_2017.jpg?w=663", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/07/derek_theler_and_milana_vayntrub_-_split_-_getty_-_h_2017.jpg?w=1296&h=730&crop=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/07/derek_theler_and_milana_vayntrub_-_split_-_getty_-_h_2017.jpg?w=1024", "keywords": [], "authors": ["Lesley Goldberg"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/marvels-new-warriors-squirrel-girl-cast-milana-vayntrub-derek-theler-topline-freeform-comedy-1019588/", "title": "Marvel’s ‘New Warriors’ Sets Its Cast — Including Squirrel Girl (Exclusive)", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Milana Vayntrub ('This Is Us') and Derek Theler ('Baby Daddy') lead the ensemble cast of the straight-to-series Freeform comedy.", "news_keywords": "Freeform, Marvel Entertainment, New Warriors", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Lesley Goldberg", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1019588, "title": "Marvel's 'New Warriors' Sets Its Cast — Including Squirrel Girl (Exclusive)", "published_at": "2017-07-10 12:00:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/07/derek_theler_and_milana_vayntrub_-_split_-_getty_-_h_2017.jpg?w=1024", "comment_count": 0, "tags": "New Warriors", "topics": "TV News", "body": "Three months after being picked up straight to series by Freeform, Marvel's New Warriors has found its cast.\r\nMilana Vayntrub (This Is Us) has landed the breakout role of Squirrel Girl, while Baby Daddy grad Derek Theler will stay in business with Freeform after landing the role of Mister Immortal in Marvel's first live-action scripted comedy.\r\nThe duo lead the ensemble cast in the 10-episode series about six young people learning to cope with their abilities in a world where bad guys can be as terrifying as bad dates. Joining Vayntrub and Theler are Jeremy Tardy as Night Thrasher, Calum Worthy as Speedball, Matthew Moy as Microbe and Kate Comer as Debrii.\r\n\"I am thrilled beyond belief to be working with this incredible group of actors. They are funny, sincere, eager, charming and perfectly embody these characters. It'll be a blast and an honor to create this show with each of them,\" said showrunner — and longtime Squirrel Girl superfan — Kevin Biegel (Enlisted).\r\nPicked up straight to series in April, New Warriors hails from Marvel Television and ABC Studios' cable arm ABC Signature. Marvel head of TV Jeph Loeb and Jim Chory executive produce alongside Biegel.\r\n\"We're so lucky to have assembled such a diverse and incredibly talented cast,\" Loeb said. \"We can't wait for the fans to see what's in store when we unleash these iconic characters into the world!\"\r\n\r\n\r\nThe Squirrel Girl casting caps an extensive process that featured a personal campaign from Stranger Things breakout Shannon Purser (Barb) — who sources say was also in the running. Parenthood grad Mae Whitman — another outspoken fan of the character — was also discussed, sources say, but her series regular commitment to NBC's upcoming Good Girls made that conversation short, though sources say the character was written with the actress in mind. Other actresses, including Anna Kendrick, had also expressed interest in taking on the character.\r\n\"At Freeform, we are committed to finding distinct and entertaining characters that our audience can enjoy and relate to,\" said Elizabeth Boykewich, senior vp casting and talent at Freeform. \"We are excited to be working with Marvel Television to bring these fiercely average superheroes to life and watch them take on the world.\"\r\nNew Warriors will launch in 2018. It is Freeform's second Marvel series and joins Cloak and Dagger at the Disney-owned network. It is unclear if both series will launch at the same time and whether they would be paired together. For more on how the series fits in with the Marvel universe as well as at Freeform, read THR's interview with exec vp programming and development Karey Burke.\r\nRead the full character descriptions below.\r\nVayntrub (who recurred on NBC's This Is Us as Kevin's Broadway co-star Sloane) will take on Doreen Green — aka Squirrel Girl. Doreen is a totally empowered fangirl who has the incredible powers of a ... squirrel. Her greatest quality is her optimism and her best friend is a pet squirrel, Tippy Toe. Vayntrub is repped by UTA and Ziffren Brittenham.\r\nTheler, who wrapped his six-season starring role on Freeform's Baby Daddy in May, is Craig Hollis, aka Mister Immortal. Craig can't die ... or so he says. Although Craig's superpower seems amazing, he hasn't made use of it at all — he figures if he has all the time in the world to learn how to do anything heroic, what's the rush? Theler is with Paradigm, Authentic Talent and Literary Management and Sloane Offer.\r\nTardy (Dear White People) takes on the role of Dwayne Taylor, aka Night Thrasher. Brilliant and noble and maybe a bit full of himself, Dwayne is a shameless self-promoter and entrepreneur who also deeply believes in justice. Tardy is with the Kohner Agency and Generate.\r\n\r\n\r\nWorthy (Austin & Ally, Cassandra French's Finishing School) will play Robbie Baldwin, aka Speedball. Robbie is an impulsive people-pleaser with a misplaced sense of confidence who throws kinetic balls of energy that are completely out of control. Worthy is repped by CTM International, Principato Young and Myman Greenspan.\r\n\r\nMoy will take on the role of Zack Smith, aka Microbe. Zack is a shy hypochondriac who has the ability to talk to germs, which can tell him where you've been, what you ate and who you hung out with. It's impossible to keep secrets around him. Moy is fresh off his six-season run on CBS' recently canceled 2 Broke Girls, where he played diner owner Han. The actor, who also counts Steven Universe among his credits, is repped by AKA Talent Agency, Management 360 and Lichter Grossman.\r\n\r\nComer (The Comeback) rounds out the cast as Deborah Fields, aka Debrii. Deborah is proud, funny and quick-witted. Confidently out as a lesbian, Deborah is a low-level telekinetic — very low. Like, she-can-move-a-paper-cup low. Comer is with Esteemed Artists Talent and CESD.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Marvel’s ‘New Warriors’ Sets Its Cast — Including Squirrel Girl (Exclusive)", "url": "https://www.hollywoodreporter.com/tv/tv-news/marvels-new-warriors-squirrel-girl-cast-milana-vayntrub-derek-theler-topline-freeform-comedy-1019588/", "description": "Milana Vayntrub (‘This Is Us’) and Derek Theler (‘Baby Daddy’) lead the ensemble cast of the straight-to-series Freeform comedy.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/07/derek_theler_and_milana_vayntrub_-_split_-_getty_-_h_2017.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-07-10T12:00:00+00:00", "modified_time": "2017-07-11T11:51:11+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Marvel’s ‘New Warriors’ Sets Its Cast — Including Squirrel Girl (Exclusive)", "description": "Milana Vayntrub (‘This Is Us’) and Derek Theler (‘Baby Daddy’) lead the ensemble cast of the straight-to-series Freeform comedy.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/07/derek_theler_and_milana_vayntrub_-_split_-_getty_-_h_2017.jpg?w=1296"}}, "movies": [], "publish_date": 1499688000.0, "source": "https://www.hollywoodreporter.com", "summary": ""}