{"url": "https://www.businessinsider.com/13-reasons-why-season-2-problem-mental-health-2018-5", "text": "The Netflix series \"13 Reasons Why\" is back for a second season despite warnings from researchers who say it sends a dangerous message.\n\nThe show's central problem is not simply its depiction of suicide, experts say, but the way the main character is portrayed as having power after her death.\n\nThe executive producer Selena Gomez has defended the show, saying she \"wanted to make something that could hopefully help people.\"\n\nThe Netflix series \"13 Reasons Why\" is back for another season despite warnings from a spate of researchers who say the crux of its plot sends a dangerous message to viewers.\n\nThe show's first 13 episodes trace the tragically short life of a young high-school student named Hannah Baker who is assaulted, raped, and witness to a friend's rape. Viewers learn of this through a series of 13 tapes that Baker records before her death.\n\nIn the season finale, viewers watch Baker take her own life in slow, graphic, and horrifying detail — something that directly contradicts guidelines from mental-health experts about how to depict suicide in a way that doesn't encourage others to follow suit.\n\nBut experts say that portrayal of suicide was not the producers' only dangerous mistake — a far bigger issue is the way Baker is given authority, power, and essentially a second life after her death.\n\n\"There was a kind of romanticization, and at the core of the story was this idea that you can kill yourself and be dead and yet not really be dead,\" Don Mordecai, Kaiser Permanente's national leader for mental health, told Business Insider. \"Because, of course, [Baker] continues to be a character — she's in scenes, and she's still there in many ways.\"\n\nMordecai and other experts warn that the portrayal could mislead viewers into believing that Baker's tale could apply to them. And the new season comes as suicide attempts among young people are rising.\n\nHannah Baker's 2nd life\n\nClay Jensen (Dylan Minnette) finds Hannah Baker's (Katherine Langford) tapes on \"13 Reasons Why.\" Netflix\n\nBy way of the 13 tapes Baker records before she dies, her character lives on throughout the show.\n\nShe's present in nearly every episode, not only as the chief narrator but as the main character recalling and reliving what happened to her. Baker is presented as a victim when she is alive and as powerful and dominant after her death.\n\nAs Baker's friend Clay Jensen listens to her recordings, he learns of the deep wrongdoings his peers committed, and he winds up forcing another student to admit what he did on tape.\n\nIt is a classic tale of revenge — but it's also unrealistic and dangerous, researchers say.\n\nBy giving Baker's character power only in death, the show's creators portray suicide as romantic and vengeful. But the reality is the opposite: When we're gone, we have no self, no agency, and no power.\n\nLast summer's disturbing trends\n\nBaker in \"13 Reasons Why.\" Netflix\n\nTwo recent studies suggest that the show's timing could be particularly dangerous.\n\nA study published Wednesday in the journal Pediatrics found that the rate of hospitalizations for suicidal thoughts or attempts among children and teens nearly tripled from 2008 to 2015.\n\nThe group with the highest rate of increase was teen girls.\n\nAnother more disturbing study published in the Journal of the American Medical Association on the heels of the show's premiere last year found evidence that some viewers went online after watching and typed phrases like \"how to kill yourself\" into Google search.\n\nViewers also appeared to be searching for information about suicide prevention, but the trending searches with the sharpest uptick were about suicidal ideation, or thoughts about how to kill oneself.\n\nThe study found that searches for the phrase \"how to commit suicide,\" for example, were 26% higher than would have been expected, while \"commit suicide\" and \"how to kill yourself\" were 18% and 9% higher, respectively.\n\n\"The time for more debate is over,\" John Ayers, an adjunct professor of behavioral science at San Diego State University who led the study, told Business Insider shortly after the paper was published. \"The makers [of '13 Reasons Why'] must swiftly change their course of action, including removing the show and postponing a second season.\"\n\nAyers this week added: \"Is a warning label enough when the show is actually pushing children to contemplate or commit suicide? I don't think so.\n\n\"This is akin to pushing someone down the stairs but warning the floors are slippery.\"\n\nSelena Gomez, the well-known singer who's one of the show's executive producers, has defended its portrayal of Baker's death, telling \"Good Morning America\" earlier this year that \"we wanted to do it in a way that was honest, and we wanted to make something that could hopefully help people.\"\n\nFor the latest season of \"13 Reasons Why,\" Gomez added a warning that plays before every episode telling viewers about the sensitive content of the show. But that may not be sufficient. The show's first season also contained a warning — though it was shorter and played before only some episodes — advising young people to watch with an adult.\n\n\"I'm sure many parents were there, sitting down watching and talking about it with their kids,\" Mordecai said. \"But I'm sure many were not.\"\n\nIf you or someone you know is struggling with depression or has had thoughts of harming themselves or taking their own life, get help. The National Suicide Prevention Lifeline (1-800-273-8255) provides free, 24/7, confidential support for people in distress, as well as best practices for professionals and resources to aid in prevention and crisis situations.", "images": ["https://i.insider.com/5908c5d92f6ae479018b5ee7?width=700", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 1 1'%3E%3C/svg%3E", "https://www.businessinsider.com/public/assets/BI/US/icons/youtube.svg", "https://www.businessinsider.com/public/assets/subscription/marketing/banner-overlay/bottom-right.svg", "https://www.businessinsider.com/public/assets/BI/US/icons/instagram.svg", "https://www.businessinsider.com/public/assets/badges/app-store-badge.svg", "https://www.businessinsider.com/public/assets/BI/US/icons/twitter.svg", "https://i.insider.com/590f393869e69af1348b4bd2?width=1200&format=jpeg", "https://www.businessinsider.com/public/assets/BI/US/logos/BI-logo-dark-opt.svg", "https://www.businessinsider.com/public/assets/badges/google-play-badge.svg", "data:image/svg+xml,%3C%3Fxml version='1.0' encoding='UTF-8'%3F%3E%3Csvg xmlns='http://www.w3.org/2000/svg' width='1' height='1'/%3E", "https://www.businessinsider.com/public/assets/BI/US/icons/facebook.svg", "https://www.businessinsider.com/public/assets/INSIDER/US/logos/insider-com-trademark-opt.svg", "https://www.businessinsider.com/public/assets/INSIDER/US/logos/Insider-logo-dark-opt.svg", "https://www.businessinsider.com/public/assets/INSIDER/US/logos/insider-inc.svg", "https://www.businessinsider.com/public/assets/shared/light-switch.png", "https://www.businessinsider.com/public/assets/BI/US/logos/Tech-Insider-opt.svg", "https://www.businessinsider.com/public/assets/BI/US/icons/linkedin.svg", "https://www.businessinsider.com/public/assets/subscription/marketing/banner-overlay/top-left.svg", "https://www.businessinsider.com/public/assets/BI/DE/logos/BI-DE-Black-on-Light-final-footer-logo-opt.svg"], "top_img": "https://i.insider.com/590f393869e69af1348b4bd2?width=1200&format=jpeg", "keywords": [], "authors": ["Erin Brodwin"], "canonical_link": "https://www.businessinsider.com/13-reasons-why-season-2-problem-mental-health-2018-5", "title": "Experts say the new season of '13 Reasons Why' has a dangerous problem that the show fails to address", "meta_data": {"viewport": "width=device-width, initial-scale=1", "title": "Experts say the new season of '13 Reasons Why' has a dangerous problem that the show fails to address", "datePublished": "2018-05-18T12:09:00Z", "dateModified": "2018-05-18T16:15:31Z", "news_keywords": "Health, 13 Reasons Why season 2, 13 Reasons Why, Netflix, Suicide, Teenagers, Teens, TV, Selena Gomez, Young People, Psychology, Mental Health, Mental Illness, Depression, Erin Brodwin", "description": "The Netflix series \"13 Reasons Why\" is back for a second season despite warnings from researchers who say it sends a dangerous message. The central problem is not the show's depiction of suicide, they say, but the way the main character is portrayed as having power after her death.", "author": "Erin Brodwin", "article": {"publisher": "businessinsider", "content_tier": "free", "opinion": "false"}, "tbi-vertical": "Science", "og": {"title": "Experts say the new season of '13 Reasons Why' has a dangerous problem that the show fails to address", "description": "The Netflix series \"13 Reasons Why\" is back for a second season despite warnings from researchers who say it sends a dangerous message. The central problem is not the show's depiction of suicide, they say, but the way the main character is portrayed as having power after her death.", "type": "article", "url": "https://www.businessinsider.com/13-reasons-why-season-2-problem-mental-health-2018-5", "image": "https://i.insider.com/590f393869e69af1348b4bd2?width=1200&format=jpeg", "site_name": "Business Insider"}, "sailthru.title": "Experts say the new season of '13 Reasons Why' has a dangerous problem that the show fails to address", "sailthru.date": "2018-05-18", "sailthru.tags": "Health, 13 Reasons Why season 2, 13 Reasons Why, Netflix, Suicide, Teenagers, Teens, TV, Selena Gomez, Young People, Psychology, Mental Health, Mental Illness, Depression, Erin Brodwin", "sailthru.description": "The Netflix series \"13 Reasons Why\" is back for a second season despite warnings from researchers who say it sends a dangerous message. The central problem is not the show's depiction of suicide, they say, but the way the main character is portrayed as having power after her death.", "sailthru.author": "Erin Brodwin", "sailthru.verticals": "science, thewire, thelife", "sailthru.image.full": "https://i.insider.com/5908c5d92f6ae479018b5ee7?width=1200&format=jpeg", "sailthru.image.thumb": "https://i.insider.com/5908c5d92f6ae479018b5ee7?width=160&format=jpeg", "twitter": {"card": "summary_large_image", "site": "@SciInsider"}, "cXenseParse": {"recs": {"bii-imgalt": "13 Reasons Why"}}, "robots": "max-image-preview:large", "fb": {"pages": 20446254070}, "ia": {"markup_url": "https://www.businessinsider.com/13-reasons-why-season-2-problem-mental-health-2018-5?fbia"}, "apple-itunes-app": "app-id=554260576", "linkedin": {"owner": "mid:1d5f7b"}, "ii-ab-test": {"newsletter-email-input": "control"}, "ii-split-test": {"bii-media-show-lock": "variant", "ii-finance-email-lock": "variant", "ii-retail-show-lock": "variant"}, "viking-id": "5afcb3a4e3186e2b008b4e07", "env": "prod", "msapplication-config": "/public/assets/BI/US/favicons/browserconfig.xml?v=2021-08", "theme-color": "#ffffff", "apple-mobile-web-app-title": "Business Insider"}, "movies": [], "publish_date": 1526598000.0, "source": "https://www.businessinsider.com", "summary": ""}