{"url": "https://www.hollywoodreporter.com/live-feed/daily-shows-michelle-wolf-lands-her-own-netflix-late-night-show-1083705", "text": "Michelle Wolf has landed a show of her own.\n\nAfter nearly half a decade working on Late Night With Seth Meyers and The Daily Show With Trevor Noah, Wolf is set to host her own weekly show on Netflix. The streaming giant, which is making a considerable push in the talk-show space with entries from David Letterman and Joel McHale, is billing Wolf’s show as a break from the seriousness of late-night comedy. The planned star vehicle will launch later this year.\n\nThe 32-year-old rising star, whose show does not yet have a name, is expected to make fun of everything and everybody, with no preaching or political agenda — unless, of course, it’s funny. “You can expect the types of jokes my former bosses would tell me we couldn’t do on TV,” Wolf joked in a statement, with Netflix’s vp content Bela Bajaria, adding more earnestly: “We’re thrilled to be working with Michelle, a gifted writer and performer with a singular voice.”\n\nThe announcement comes some two months after Wolf earned raves for her first stand-up special, Nice Lady, which aired on rival HBO. The special gave Wolf her highest-profile platform to date to tackle subjects ranging from feminism (“I want equal pay! And a chardonnay”) to dating and other social issues.\n\nThough Wolf is still a relative fresh face on the stand-up circuit, she has already earned the respect of several comedic heavyweights, or former heavyweights, including Louis C.K., who tapped her to open for him on his 2016 stand-up tour and to act in his celebrated web show Horace and Pete, and Chris Rock, who hired her to write for his Oscars ceremony.\n\nBy jumping to Netflix, Wolf marks the latest star to exit Comedy Central — and in her case, as it was for predecessors like John Oliver, just as her career is taking off. In addition to her contributor duties on the cable network’s Daily Show, Wolf created and starred in two digital series, Now Hiring and Used People, for the Viacom network.\n\nLooking ahead, Wolf’s Netflix show, a rare and much-welcomed female-fronted series in what is still a male-dominated space, will be produced via her Cats in Pants banner. Dan Powell (Inside Amy Schumer) and Christine Nangle (The President’s Show, The Mick) will serve as co-showrunners, with her manager Daniel Bodansky joining them as an executive producer.\n\nWolf is repped by UTA, Dixon Talent and Hansen Jacobson; Powell is with UTA, Odenkirk Provissiero and Hansen Jacobson; and Nangle is repped by UTA and Jackoway Tyerman.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/02/michellewolf-h_2018.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.hollywoodreporter.com/wp-content/uploads/2018/02/michellewolf-h_2018.jpg?w=1296&h=730&crop=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/02/michellewolf-h_2018.jpg?w=1024", "keywords": [], "authors": ["Lacey Rose"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/daily-shows-michelle-wolf-lands-her-own-netflix-late-night-show-1083705/", "title": "‘The Daily Show’s’ Michelle Wolf Lands Her Own Netflix Late-Night Show (Exclusive)", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "“You can expect the types of jokes my former bosses would tell me we couldn’t do on TV,” she says of her forthcoming weekly program.", "news_keywords": "autoplay, Netflix, The Daily Show with Trevor Noah", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Lacey Rose", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1083705, "title": "'The Daily Show's' Michelle Wolf Lands Her Own Netflix Late-Night Show (Exclusive)", "published_at": "2018-02-12 09:00:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/02/michellewolf-h_2018.jpg?w=1024", "comment_count": 0, "tags": "The Daily Show with Trevor Noah", "topics": "TV News", "body": "Michelle Wolf has landed a show of her own.\r\nAfter nearly half a decade working on Late Night With Seth Meyers and The Daily Show With Trevor Noah, Wolf is set to host her own weekly show on Netflix. The streaming giant, which is making a considerable push in the talk-show space with entries from David Letterman and Joel McHale, is billing Wolf’s show as a break from the seriousness of late-night comedy. The planned star vehicle will launch later this year.\r\nThe 32-year-old rising star, whose show does not yet have a name, is expected to make fun of everything and everybody, with no preaching or political agenda — unless, of course, it’s funny. “You can expect the types of jokes my former bosses would tell me we couldn’t do on TV,” Wolf joked in a statement, with Netflix’s vp content Bela Bajaria, adding more earnestly: \"We're thrilled to be working with Michelle, a gifted writer and performer with a singular voice.\"\r\n\r\nThe announcement comes some two months after Wolf earned raves for her first stand-up special, Nice Lady, which aired on rival HBO. The special gave Wolf her highest-profile platform to date to tackle subjects ranging from feminism (\"I want equal pay! And a chardonnay\") to dating and other social issues. \r\nThough Wolf is still a relative fresh face on the stand-up circuit, she has already earned the respect of several comedic heavyweights, or former heavyweights, including Louis C.K., who tapped her to open for him on his 2016 stand-up tour and to act in his celebrated web show Horace and Pete, and Chris Rock, who hired her to write for his Oscars ceremony. \r\nBy jumping to Netflix, Wolf marks the latest star to exit Comedy Central — and in her case, as it was for predecessors like John Oliver, just as her career is taking off. In addition to her contributor duties on the cable network’s Daily Show, Wolf created and starred in two digital series, Now Hiring and Used People, for the Viacom network.\r\n\r\nLooking ahead, Wolf's Netflix show, a rare and much-welcomed female-fronted series in what is still a male-dominated space, will be produced via her Cats in Pants banner. Dan Powell (Inside Amy Schumer) and Christine Nangle (The President’s Show, The Mick) will serve as co-showrunners, with her manager Daniel Bodansky joining them as an executive producer.\r\nWolf is repped by UTA, Dixon Talent and Hansen Jacobson; Powell is with UTA, Odenkirk Provissiero and Hansen Jacobson; and Nangle is repped by UTA and Jackoway Tyerman.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘The Daily Show’s’ Michelle Wolf Lands Her Own Netflix Late-Night Show (Exclusive)", "url": "https://www.hollywoodreporter.com/tv/tv-news/daily-shows-michelle-wolf-lands-her-own-netflix-late-night-show-1083705/", "description": "“You can expect the types of jokes my former bosses would tell me we couldn’t do on TV,” she says of her forthcoming weekly program.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/02/michellewolf-h_2018.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2018-02-12T09:00:00+00:00", "modified_time": "2018-02-12T20:00:21+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘The Daily Show’s’ Michelle Wolf Lands Her Own Netflix Late-Night Show (Exclusive)", "description": "“You can expect the types of jokes my former bosses would tell me we couldn’t do on TV,” she says of her forthcoming weekly program.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/02/michellewolf-h_2018.jpg?w=1296"}}, "movies": [], "publish_date": 1518426000.0, "source": "https://www.hollywoodreporter.com", "summary": ""}