{"url": "https://www.britannica.com/biography/Tiffany-Haddish", "text": "Tiffany Haddish, in full Tiffany Sarac Haddish, (born December 3, 1979, Los Angeles, California, U.S.), American comedian who was known for her unflinching candour and disarming authenticity. She shot to stardom with her no-holds-barred performance as Dina in the raunchy comedy Girls Trip (2017).\n\nHaddish’s father, who was Eritrean, left the family when she was still a toddler. After her mother suffered brain damage in a car accident, Haddish spent several years in foster care before going to live with her grandmother as a teenager. Her penchant for making her classmates laugh led her social worker to point her toward the Laugh Factory Comedy Camp, a free summer program offered by the comedy club chain Laugh Factory to teach underprivileged children how to perform stand-up comedy. The camp proved to be a transformative experience for Haddish.\n\nBritannica Quiz Pop Culture Quiz Are you a princess of Pop? The king of Culture? See if you’re an entertainment expert by answering these questions.\n\nAfter graduating from high school, Haddish focused on forging a career in comedy, using her life as source material. Although she made headway, she earned so little money that at times she was forced to live in her car. Her first big break came in 2006 when she was a contestant on the television comedy competition show Who’s Got Jokes? Two years later she appeared on Def Comedy Jam and the reality-show spoof Reality Bites Back. During this time, Haddish began to be cast in a number of sitcoms, and she also acted in such films as the comedies Meet the Spartans (2008) and The Janky Promoters (2009), which was written by and starred rapper and actor Ice Cube.\n\nHaddish gained a larger audience with recurring roles on the spoof comedy series Real Husbands of Hollywood (2013–14), starring Kevin Hart; Tyler Perry’s If Loving You Is Wrong (2014–15); and The Carmichael Show (2015–17). She became a sought-after guest for talk shows, appearing on Chelsea Lately, hosted by Chelsea Handler; The Tonight Show with Jay Leno; and The Arsenio Hall Show.\n\nIn 2016 Haddish played a street gang member in the comedy Keanu, the feature film debut of comedians Jordan Peele and Keegan-Michael Key. The following year she gave her breakout performance in Girls Trip, in which she costarred with (and stole the show from) Regina Hall, Queen Latifah, and Jada Pinkett Smith. In the wake of that success, Haddish starred in a TV comedy special, Tiffany Haddish: She Ready! From the Hood to Hollywood, became the first female African American comedian to host Saturday Night Live (SNL), and published a memoir, The Last Black Unicorn, all in 2017. For her work on SNL, she won an Emmy Award for outstanding guest actress in a comedy series. From 2018 to 2020 Haddish starred with Tracy Morgan in the TV sitcom The Last O.G. Her movie roles in 2018 included a teacher with unconventional methods in Night School, a long-suffering wife of an outspoken liberal in the holiday farce The Oath, and a recently paroled ex-convict who helps her straightlaced sister with her love life in Tyler Perry’s Nobody’s Fool.\n\nHaddish’s credits from 2019 included the comedy special Kevin Hart’s Guide to Black History, the animated feature The LEGO Movie 2: The Second Part, and the mob drama The Kitchen. That year she emceed the comedy special Tiffany Haddish Presents: They Ready; was cast as the host of the updated TV show Kids Say the Darndest Things; and did the stand-up comedy special Black Mitzvah, which was subsequently adapted into a Grammy Award-winning comedy album. In 2020 Haddish starred in the movie Like a Boss, a comedy about two friends who create a cosmetics company, and appeared in the Netflix miniseries Self Made, which was inspired by the life of pioneering businesswoman Madam C.J. Walker (played by Octavia Spencer). Her films from 2021 included the comedy Bad Trip and Billy Crystal’s Here Today, in which she played a singer who forms a friendship with a comedy writer in the early stages of dementia. Haddish later starred as a detective in the Apple TV+ series The Afterparty (2022– ), about a murder that occurs during a high-school reunion.", "images": ["https://cdn.britannica.com/65/129465-131-8F637272/USA-Annual-Academy-Awards-Closeup-entrance-statue-2009.jpg", "https://cdn.britannica.com/mendel/eb-logo/MendelNewThistleLogo.png", "https://cdn.britannica.com/31/198731-050-9A6FF03F/Tiffany-Haddish-2017.jpg", "https://cdn.britannica.com/96/7796-004-67C1F2DE/Cosby-1995.jpg?w=40&h=40&c=crop", "https://cdn.britannica.com/38/157838-050-285F8B2D/Chris-Rock-NAACP-Image-Awards-Los-Angeles-2010.jpg?w=40&h=40&c=crop", "https://cdn.britannica.com/33/103133-050-31A8786E/Steve-Martin-Actor-magic-tricks-children-group.jpg?w=40&h=40&c=crop", "https://cdn.britannica.com/10/155710-050-13087954/Billy-Crystal-2007.jpg?w=40&h=40&c=crop", "https://cdn.britannica.com/31/198731-050-9A6FF03F/Tiffany-Haddish-2017.jpg?w=400&h=300&c=crop"], "top_img": "https://cdn.britannica.com/31/198731-050-9A6FF03F/Tiffany-Haddish-2017.jpg", "keywords": [], "authors": ["Patricia Bauer", "Edit History"], "canonical_link": "https://www.britannica.com/biography/Tiffany-Haddish", "title": "Tiffany Haddish | Biography, Movies, Book, & Facts", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"pages": 74442380906, "app_id": 1887621861548296}, "description": "Tiffany Haddish, in full Tiffany Sarac Haddish,  (born December 3, 1979, Los Angeles, California, U.S.), American comedian who was known for her unflinching candour and disarming authenticity. She shot to stardom with her no-holds-barred performance as Dina in the raunchy comedy Girls Trip (2017). Haddish’s father, who was Eritrean, left the family when she was still a toddler. After her mother suffered brain damage in a car accident, Haddish spent several years in foster care before going to live with her grandmother as a teenager. Her penchant for making her classmates laugh led her social worker to point her toward", "keywords": "Tiffany Haddish, encyclopedia, encyclopeadia, britannica, article", "twitter": {"card": "summary_large_image", "site": "@britannica", "image": "https://cdn.britannica.com/31/198731-050-9A6FF03F/Tiffany-Haddish-2017.jpg", "description": "Tiffany Haddish, in full Tiffany Sarac Haddish,  (born December 3, 1979, Los Angeles, California, U.S.), American comedian who was known for her unflinching candour and disarming authenticity. She shot to stardom with her no-holds-barred performance as Dina in the raunchy comedy Girls Trip (2017). Haddish’s father, who was Eritrean, left the family when she was still a toddler. After her mother suffered brain damage in a car accident, Haddish spent several years in foster care before going to live with her grandmother as a teenager. Her penchant for making her classmates laugh led her social worker to point her toward"}, "og": {"type": "ARTICLE", "title": "Tiffany Haddish | Biography, Movies, Book, & Facts", "description": "Tiffany Haddish, in full Tiffany Sarac Haddish,  (born December 3, 1979, Los Angeles, California, U.S.), American comedian who was known for her unflinching candour and disarming authenticity. She shot to stardom with her no-holds-barred performance as Dina in the raunchy comedy Girls Trip (2017). Haddish’s father, who was Eritrean, left the family when she was still a toddler. After her mother suffered brain damage in a car accident, Haddish spent several years in foster care before going to live with her grandmother as a teenager. Her penchant for making her classmates laugh led her social worker to point her toward", "site_name": "Encyclopedia Britannica", "url": "https://www.britannica.com/biography/Tiffany-Haddish", "image": {"identifier": "https://cdn.britannica.com/31/198731-050-9A6FF03F/Tiffany-Haddish-2017.jpg", "type": "image/jpeg"}}}, "movies": [], "publish_date": null, "source": "https://www.britannica.com", "summary": ""}