{"url": "https://web.archive.org/web/20180809015304/https://www.babble.com/entertainment/freaky-friday-disney-channel/", "text": "Editor’s Note: Babble is a part of The Walt Disney Company. This post may contain spoilers from Freaky Friday.\n\nActresses Heidi Blickenstaff and Cozi Zuehlsdorff are having a major identity crisis.\n\nWell, at least their characters are!\n\nThe two will be hilariously swapping bodies as the famous mom-and-daughter duo Katherine and Ellie Blake in Disney Channel’s new musical adaptation of Freaky Friday.\n\nTeens and parents can expect all the familiar touches of the original story, with Katherine and Ellie at odds until an encounter with a magical hourglass leads them to spend a day in each other’s shoes — literally. But in this latest version, viewers can expect a fresh, modernized take that they’ll truly relate to, and with some thoroughly enjoyable musical numbers to boot!\n\nFor Zuehlsdorff, who starts off the movie as teenage Ellie, the experience was especially meaningful because she’ll be turning 20 when the film premieres this week. Facing the end of her teen years helped the actress connect deeply with her rebellious character.\n\n“This movie really holds space for a lot of feelings,” Zuehlsdorff tells Babble. “I challenge you to find one teenager who doesn’t feel insecure, including me. It was really important to me to play a teenager honestly … Even in her sassiness and her attitude, [I wanted] to find a way to do it that felt really honest.”\n\nIn her effort to commit fully to Ellie, Zuehlsdorff also embraced a part of the high school experience most movies ignore — the sheer exhaustion teens feel in their changing bodies.\n\n“Teenage years are the sleepiest years of your life, because you’re just full of hormones and so tired and growing,” she says. “That felt very relatable for me, because I still experience that.”\n\nBlickenstaff can attest to her onscreen daughter’s commitment, playfully remembering moments when Zuehlsdorff would pass out during their 14-hour shoot days on set.\n\n“We would find her in various spots, literally sleeping on her face on a table!” Blickenstaff says.\n\nDisney’s Freaky Friday will also boldly dive into the issues of loss and grief, and it gets very real about the painful vulnerability of being in a blended family. When we’re introduced to the Blake family, they’re still dealing with the untimely death of Ellie’s father five years ago, and Katherine’s new fiancé only makes it tougher for them both to cope.\n\n“The whole reason we have to switch bodies, and the whole fight that ensues is because we’re processing his death in different ways,” Zuehlsdorff says. “Ellie wants to let it out, and Katherine wants to rein it in … and neither way is working. They have to really sit and talk and remember, so that they can move forward.”\n\nBlickenstaff thinks the emotional scenes between Katherine and Ellie have the potential to help any teen who has experienced the death of a parent.\n\n“A lot of kids deal with lots of real sadness in their lives and real separation from parents for lots of different reasons,” she tells Babble. “Instead of just sugarcoating that topic, we go there. And I think we give kids a lot of credit for having real feelings and being ready to hear it.”\n\nNavigating a blended family also happens to be a subject close to Blickenstaff’s heart, as she’s officially earned “bonus mom” status in real life with her husband’s two sons.\n\n“I can barely talk about them without crying, because I feel so privileged to intersect with these two human beings,” she says. “They continue to teach me all kinds of lessons all the time.”\n\nSince Blickenstaff’s stepsons are 14 and 17, they were both at the perfect age to help the actress navigate the all-consuming job of playing both mom to a teenager and the teenager!\n\n“They are in the thick of it,” says Blickenstaff. “They are totally in that place where everything is changing, and they are figuring out who they want to be, and we’ve got a front row seat to all of that.”\n\nAdding to the authenticity of the new Freaky Friday is an aim to help create a self-acceptance movement, one teen viewer at a time. Zuehlsdorff screened the movie at a theater festival in the midwest for hundreds of high schoolers recently, and she was surprised to find that one particular moment resonated with every single audience member.\n\nIt’s a point in the film when Ellie’s friends are about to have a dance-off in a bowling alley, but spend the time tearing their bodies down instead of having fun. Ellie, who is being inhabited by Katherine during the scene, gives the girls a self-esteem-boosting pep talk they’ll never forget.\n\nFor the young moviegoers, this was exactly the kind of encouragement they all clearly needed to hear as well.\n\n“The minute my character says, ‘You guys, your bodies — our bodies — are beautiful,’ the entire audience erupted in applause,” Zuehlsdorff shares. “It was very special.”\n\nWhen asked if they could swap with anyone in real life, the duo had some really adorable answers. Zuehlsdorff narrowed her list down to Téa Leoni from Madame Secretary and Spider-Man, but Blickenstaff had a much more unconventional response, saying she’d love to switch places with her dog.\n\n“My husband and I rescued her about a year ago, and she is the apple of our eye, she says. “I would just like a day to have all of that spoiled rotten treatment!”\n\nFreaky Friday will premiere on August 10 at 8 PM EST on the Disney Channel.\n\nArticle Posted 1 day Ago", "images": ["https://web.archive.org/web/20180809015304im_/https://www.babble.com/wp-content/uploads/2018/08/ff-630.jpg"], "top_img": "https://web.archive.org/web/20180809015304im_/https://www.babble.com/wp-content/uploads/2018/08/ff-630.jpg", "keywords": [], "authors": ["Lindsay Wolf"], "canonical_link": "https://web.archive.org/web/20180809015304/https://www.babble.com/entertainment/freaky-friday-disney-channel/", "title": "Disney’s New ‘Freaky Friday’ Musical Tackles the Chaotic Teen Years in a Powerful Way", "meta_data": {"HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "description": "Actresses Heidi Blickenstaff and Cozi Zuehlsdorff play the famous mom-and-daughter duo Katherine and Ellie Blake in Disney Channel’s new musical adaptation of 'Freaky Friday.'", "author": "Lindsay Wolf", "og": {"site_name": "Babble", "type": "article", "locale": "en_US", "url": "https://web.archive.org/web/20180809015304/https://www.babble.com/entertainment/freaky-friday-disney-channel/", "title": "Disney’s New ‘Freaky Friday’ Musical Tackles the Chaotic Teen Years in a Powerful Way", "description": "Disney Channel's 'Freaky Friday' musical airs Friday, August 10!", "image": {"identifier": "https://web.archive.org/web/20180809015304im_/https://www.babble.com/wp-content/uploads/2018/08/ff2-1200.jpg", "width": 1200, "height": 800}}, "fb": {"app_id": 415310475147711}, "article": {"published_time": "2018-08-07T20:29:26+00:00", "modified_time": "2018-08-07T22:47:19+00:00", "author": "https://www.babble.com/contributor/lwolf/", "section": "Entertainment", "tag": "teen"}}, "movies": [], "publish_date": 1533673766.0, "source": "https://web.archive.org", "summary": ""}