{"url": "https://www.fatherly.com/news/justin-timberlake-son-long-hair-instagram/", "text": "Parent-shaming is a mainstay of social media and, on occasion, can actually be helpful. If a commenter tells a celebrity (or a friend) not to do something that might hurt their kid, well, that’s useful. However, the comments section of many celebrity fathers’ accounts are full of deeply unhelpful advice. Take, for instance, Justin Timberlake’s account, which now features a photo of his son, Silas Timberlake, kissing his mom, Jessica Biel, followed by a mass of comments about the length of his son’s hair. According to internet busybodies — mostly male and mostly very certain of their views — having long hair is going to somehow damage the kid long-term.\n\nThe picture was taken in Paris and shows the three-year-old with shoulder length hair and a very loud and boat-themed romper kissing his mom on the lips. The caption reads, “If that pic doesn’t say ‘City Of Love’ then I’m out….” Privileged? Yes. Charming? Absolutely. Nonetheless, the internet did its thing.\n\n“I thought that son was a daughter which is just another reason why it shouldn’t grow out,” wrote one commenter, before another took issue with his romper.\n\n“Long hair and feminine-romper looking thing… sheesh,” wrote another.\n\nAnd then the back and forth begain.\n\n“Who cares if his hair is long!” wrote one JT supporter. “We should focus on raising kind children, so maybe they don’t grow up and become mean grown-ups that usual social media as a bullying platform!”\n\n“Can we stop thinking about his hair fl and marvel in the wonderful opportunity this child has of having loving parents, who on top of that take him to Paris at such a young age,” wrote another. (The likely answer is “no,” but it’s a worthy sentiment.)\n\nParent shaming is always annoying, but this example might be the worst to date as it checks both the “Who cares?” box and the “That’s Not a Thing” box. Also, these people are all failing to appreciate that the kid has very cool hair. Do with it what you will Silas, you’ve been blessed with a rock star mane.", "images": ["https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/fatherly/2019/08/old-fashioned-baby-names-2.jpg?w=130&h=130&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/fatherly/2018/07/Untitled-2.jpg?w=374&h=203&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2022/10/3/563a8c4b-0f96-49d9-a8e2-a51fa28ec4a8-getty-1417997514.jpg?w=130&h=130&fit=crop&crop=faces&auto=format%2Ccompress", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/fatherly/2018/07/Untitled-2.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg"], "top_img": "https://imgix.bustle.com/fatherly/2018/07/Untitled-2.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.fatherly.com/news/justin-timberlake-son-long-hair-instagram", "title": "Justin Timberlake and Jessica Biel Parent-Shamed for Son's Long Hair", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@fatherlyHQ", "card": "summary_large_image"}, "article": {"publisher": "https://www.facebook.com/fatherlyHQ"}, "og": {"site_name": "Fatherly", "url": "https://www.fatherly.com/news/justin-timberlake-son-long-hair-instagram", "type": "article", "title": "Dad-Shamers Are Out In Force After Justin Timberlake Posted This Pic of His Son", "description": "After posting a picture of his son kissing his mother the internet masses attacked Justin Timberlake for the length of his son’s hair.", "image": {"identifier": "https://imgix.bustle.com/fatherly/2018/07/Untitled-2.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "After posting a picture of his son kissing his mother the internet masses attacked Justin Timberlake for the length of his son’s hair."}, "movies": [], "publish_date": null, "source": "https://www.fatherly.com", "summary": ""}