{"url": "https://www.tvguide.com/news/riverdale-jason-blossom-killer-clifford-blossom/", "text": "Jason Blossom's murderer has been found and it was a deeply chilling reveal for Riverdale fans.\n\nIt turns out that Clifford Blossom (Barclay Hope) is the one who pulled the trigger on his own son. A hidden flash drive found in Jason's (Trevor Stines) varsity jacket revealed footage from the Whyte Wyrm's basement that confirmed Clifford Blossom shot his own son in the head.\n\nIt took several twists and turns to get to the truth, though. The first gut punch was FP Jones (Skeet Ulrich) confessing to the crime Archie (KJ Apa) and his friends knew he didn't commit. Then Hal Cooper (Lochlyn Munro) dropped the bomb that his grandfather was actually a Blossom -- meaning that Polly (Tiera Skovbye) and Jason are actually related.\n\nCole Sprouse, Casey Cott and Camilla Mendes, Riverdale Bettina Strauss, Bettina Strauss/The CW\n\nBetty (Lili Reinhart) immediately assumed the incest was motive for the Blossoms to kill their own son. This put her a lot closer to the truth than Archie and Veronica (Camilla Mendes), who continued on their mission to find out if Veronica's imprisoned father, Hiram Lodge, had any connection to the brutal murder. It turns out that Veronica's father is guilty of many things, but murder isn't one of them.\n\nMeanwhile, it turns out FP confessed because Clifford had threatened to harm Jughead (Cole Sprouse) if he didn't take the rap for the crime. While the sheriff knows who really pulled the trigger, FP still has to do time for tampering with evidence and obstruction of justice, which leaves Jughead without a parental unit and staying with the Andrews until further notice.\n\nDear Diary: Why Do I Care More About Riverdale's Parents?\n\nNow the big question heading into the Season 1 finale is, why did Clifford Blossom do it? The entire town knows that he's the man who pulled the trigger, but the Blossom patriarch hung himself before the police could bring him in for questioning. The finale next week will have to dig into what drove Clifford to want his son dead and, of course, set up the next mystery for the show's already-ordered second season.\n\nThe choice to make Clifford Blossom the murderer isn't the darkest route the show could have gone -- that would have been Archie -- but it does leave an open-ended path for the show to follow in their second effort. The mystery of who shot Jason may be wrapped up, but the ghost of the Blossom heir still looms over this sleepy small down, and there are more mysteries to uncover in the months after his fateful death.\n\nRiverdale's first season finale airs Thursday, May 11 at 9/8c on The CW.\n\n(Full disclosure: TVGuide.com is owned by CBS, one of The CW's parent companies)", "images": ["https://www.tvguide.com/a/img/resize/ff98460ea52ff93d461aa94ccbe2b5b622585e33/hub/2015/11/12/7757667f-a65f-4449-be9c-02197213cf71/93407049313130463381390783152n.jpg?auto=webp&height=84&width=84", "https://www.tvguide.com/a/img/resize/9d49c82bc124704d330c4adb30c7a6a855f829c0/hub/2017/05/04/bda88cca-49fc-4e5f-b69e-b938761a4cf9/170504-news-riverdale-cole-sprouse-casey-cott-camilla-mendes.jpg?auto=webp&fit=crop&height=1080&width=1920", "https://www.tvguide.com/a/img/hub/2017/05/04/bda88cca-49fc-4e5f-b69e-b938761a4cf9/170504-news-riverdale-cole-sprouse-casey-cott-camilla-mendes.jpg"], "top_img": "https://www.tvguide.com/a/img/hub/2017/05/04/bda88cca-49fc-4e5f-b69e-b938761a4cf9/170504-news-riverdale-cole-sprouse-casey-cott-camilla-mendes.jpg", "keywords": [], "authors": ["Megan Vick", "May", "A.M. Pt"], "canonical_link": "https://www.tvguide.com/news/riverdale-jason-blossom-killer-clifford-blossom/", "title": "Riverdale: Clifford Blossom Killed Jason Blossom", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"app_id": 63084645929}, "google-site-verification": "Od29UEFliEmsUY2XH0kfXxkTNucL0cv_rc0J_RPWXU4", "og": {"site_name": "TVGuide.com", "image": {"identifier": "https://www.tvguide.com/a/img/hub/2017/05/04/bda88cca-49fc-4e5f-b69e-b938761a4cf9/170504-news-riverdale-cole-sprouse-casey-cott-camilla-mendes.jpg", "height": 850, "width": 850}, "type": "article", "description": "It was a chilling review", "title": "Riverdale: Clifford Blossom Killed Jason Blossom", "url": "https://www.tvguide.com/news/riverdale-jason-blossom-killer-clifford-blossom/"}, "twitter": {"card": "summary_large_image", "site": "@TVGuide", "image": "https://www.tvguide.com/a/img/hub/2017/05/04/bda88cca-49fc-4e5f-b69e-b938761a4cf9/170504-news-riverdale-cole-sprouse-casey-cott-camilla-mendes.jpg", "description": "Riverdale finally revealed who killed Jason Blossom in a chilling penultimate episode.", "title": "Riverdale: Clifford Blossom Killed Jason Blossom", "url": "https://www.tvguide.com/news/riverdale-jason-blossom-killer-clifford-blossom/"}, "nuxtstatus": "loaded", "description": "Riverdale finally revealed who killed Jason Blossom in a chilling penultimate episode."}, "movies": [], "publish_date": null, "source": "https://www.tvguide.com", "summary": ""}