{"url": "https://tv.avclub.com/teen-wolf-condition-terminal-1798184341", "text": "Reviews Teen Wolf F \"Condition Terminal\" Episode 4\n\nScott: “Why did you do that?”\n\nDread Doctor: “His condition was terminal.”\n\nScott: “What does that mean? What does that mean?!”\n\nDread Doctor: “Failure!”\n\nNever has an exchange between the hero of Teen Wolf and its season’s villain been more applicable than in the case of that one. “Why did you do that?” and “Failure!“ are absolutely the appropriate reactions to this week’s episode, and quite frankly, they come out of nowhere, even given the season’s weak start. “Condition Terminal” is not just a bad episode of Teen Wolf, it’s a bad episode of television. On the other hand, it’s probably not the worst episode of television to ever exist, but it is absolutely the worst episode of Teen Wolf. This feels strange to say, given that this isn’t even an episode from Teen Wolf’s worst season, season four (check the reviews); even that season never reached the lowest of lows. But the worst episodes of season four were also the big time episodes of the season, the premiere and finale, and they bombed on those scales. “Condition Terminal” is just another episode of the week, and it’s one that could easily be removed from the rest of the series without question, one that probably should be removed from the rest of the series. It’s “Why did you do that?” and “Failure!” in episode form, in a different way than when Derek Hale turned into a wolf and “evolved,” because it’s completely useless in addition to all those complaints.\n\nThe main problem with “Condition Terminal” is that it’s a completely empty, vapid episode of Teen Wolf. There is absolutely nothing of substance or relevance here, despite what the show may have the characters say to pretend that there is. To pretend that this threat is greater than everything they’ve ever known. To pretend this is even a little bit terrifying, even though mad scientists making monsters should absolutely be terrifying. This episode is the ultimate example of telling instead of showing, and while that is bad for any form of storytelling onscreen, it’s especially bad for a horror piece. Deaton tells us all how scary this is. Liam tells us all how scary this is. Melissa tells us all how scary this is. You get the point, and yet the episode tries to drill that in like it is the actual Dread Doctor.\n\nAdvertisement\n\n“Condition Terminal” is on rocky footing from the very beginning. First of all, it opts to begin not with a horror introduction (despite the fact that the past two episodes and most of the show had succeeded in doing so) but instead with a reminder of the very inappropriate relationship between Deputy Parrish and Lydia. Parrish now even either has or simply hallucinates playing cards that resemble Lydia. Sometimes those are scorched—much like Bo of Lost Girl, his “love carries a death sentence”—versions of Lydia, but they’re Lydia nonetheless. With the episode continuing right after last week’s “Dreamcatchers,” Lydia eventually finds herself in recovery, and that also ends up being a reason for more Lydia and Deputy Parrish scenes. Why? Well, in case you were still wondering how Lydia learned all those wrestling moves for the season premiere’s teaser, it’s this episode that answers that question outside of “just banshee powers.”\n\nIt’s also an episode that goes into further detail about Parrish’s fire powers, without really going into details about Parrish’s fire powers. He likes to carry dead bodies to a stump while he’s naked and on fire, because of course he does. This is Teen Wolf.\n\n\n\nI realize that Teen Wolf has constantly gone with its own twists on supernatural folklore, and that’s not unexpected in horror/supernatural/fantasy programs, but this season’s Build-A-Bear Workshop apparently also gives it a license to just choose a couple of choice words from a bestiary, mold them into something unrecognizable, and call that a story. If we’re still assuming Parrish is a phoenix, his part of the episode is all about that, but the Dread Doctors’ monsters are where it really comes into play. There is of course the chimera, which instantly gives this season and episode of Teen Wolf something in common with Mission: Impossible II, as they are both absolutely convoluted stories with terrible fight scenes and kung fu. Then there’s the garuda, which (outside of here) is not a shape shifter, and while Lost Girl season two didn’t do a good job with it, Teen Wolf’s new, long-winded mythology on the matter really isn’t any better.\n\nWith this episode, this season’s combination of creatures is only adding to a more complicated (not necessarily complex) bestiary and mythology, which is really the last thing Teen Wolf needs. No one is pleading for more mythology and monsters in this show outside the ones we already know. Again, last season mashed up Norse Berserkers with Aztec mythology, and at no point did it address the fact or explain it. Beacon Hills being a Hellmouth isn’t a good enough excuse, especially on a show that can barely explain what it means to a banshee or kitsune or werecoyote—and those are just series regulars.\n\nAdvertisement\n\nAt the same time, The Benefactor was one of the most underwhelming and nonsensical reveals of the show, but there was an intrigue that went with that, right to the bitter end. There was constantly a question of who it could be. The mystery was interesting, despite the end result. Of all the things from season four to forget, that was the last one this season should have forgotten. At this point, the Dread Doctors’ motivation isn’t really apparent, but it’s not exactly something that matters. It’s a steam punk villain backed by a dub step soundtrack and slow motion fight scenes. That’s not a joke. It’s all style, no substance—and it’s the case for the episode as a whole. Keep in mind, the synopsis for the episode is the very scant “Stiles tracks a fugitive; and Liam plays wingman for Mason at a nightclub.” That’s not a synopsis that inspires any confidence (and the first part is barely true), especially not for an action teen drama (at the very least) called Teen Wolf. It honestly sounds like fan fiction. In fact, this particular episode comes across as fan fiction. To think about the episode more—to really think about it and not just say “It’s Teen Wolf, don’t take it so seriously”—it hardly rises above that of fan fiction.\n\nThe strange part is that, on the surface, a good portion of this week’s Teen Wolf feels like nothing more than a decent episode, going through the motions until it gets to the big finale. But the longer the episode goes, the more apparent it becomes that it’s not even that. The longer it goes on, the less “decent” even cuts it—because there is nothing even there. Last season, I believe I compared some of the storytelling to a mirage, and that’s exactly what this episode is. The closer you look at this episode, even while watching it, the less it means anything. Even thinking Teen Wolf doesn’t need to “mean anything,” it’s not exactly a good or great character for any of its characters. Deaton looks incompetent, Scott and Stiles do absolutely nothing, Lydia is on bed rest, Malia is completely ignored, despite being the hero of last week’s episode—you get the point.\n\nAdvertisement\n\nSimultaneously, within the main storyline and also somehow outside of it, the biggest of example of the episode’s style over substance is that nightclub plot. From the beginning, Jeff Davis has provided the Teen Wolf with a healthy amount of eye candy and homo-eroticism, but at the same time, he and the show can very much err on the way of being gratuitous. That’s completely the case for this episode’s possibly gay (I believe it’s never classified as such), very much cinema-themed nightclub, Sinema. It’s the literal representation of treating style as substance, with the added bonus of it being 17-year-old boys (who play younger characters in the show) as the targets. As half naked guys gyrate around, we’re eventually introduced to another useless member of the Dread Doctor’s Dr. Moreau-inspired gang, Lucas. In addition to being a hot gay man, he apparently has scorpion venom in his system, and… That’s it. He’s not given a real character introduction or back story, he’s just a hot guy Mason finds at this nightclub (who was also a hospital patient’s hot guy), among the rest of the hot guys at this nightclub. It’s an even less developed henchman than the one from the season premiere, and that’s a fact that at least props up the premiere more in comparison.\n\nThe combination of that gratuitous—the episode really feels like wish-fulfillment above all else, and that’s not in the form of storytelling—eye candy, the “main” storyline for Liam (wingman), and the fact that he’s gone from Scott 2.0 to Stiles 2.0 this season continues the devolution of the character from Scrappy-Doo to character who just so happens to be in the opening credits. Liam spends the majority of the episode standing around on the sidelines after he brings up the holes in the woods, and it’s not like what he is given outside of that is any better. This week, we learn that Liam’s grade school enemy apparently also has money issues, as she is a character living in Beacon Hills. It’s a point we’re supposed to care about despite barely even knowing the character’s name and also knowing that she—for some reason—very much hates one of of the series’ regulars/protagonists. Again, this is a grade school enemy. That’s the most absurd back story on a television series titled Teen Wolf. Because really, who cares? The show barely cares, because if it did, it would address the supernatural aspect of the character introduced last week instead of her constant scowl whenever Liam is nearby. And you know what? It’s very possible that Liam did do something terrible to her, given his anger issues. But instead, we’re seeing a spoiled brat response from a strange new character to a character we’re supposed to (and honestly, do) like. Who. Cares?\n\nAdvertisement\n\nAs for a character we do care about, this episode is worth addressing the fact that Teen Wolf apparently wants things both ways for Scott McCall. The show wants him to be the messiah who dedicates his life to teen wolfing, but it also wants to correct the fact that he was pretty much a human vegetable in the first two seasons. This is the kid of whose user name and password were “Allison” but has since put so much more of an effort into his school work (never forget “ephemeral”), and it makes a lot of sense that he would want to be a vet. But then the show has scenes where he knows he needs to study for a big test in AP Biology—scenes that are just him and Kira hanging out—and not doing that. And despite the fact that Stiles (who, given his habit of spiraling, surprisingly passes out during research) and Lydia usually do the brain work, he still allows all of this chaos to get in the way of the studies. He’s a teen wolf—balance is the key. Otherwise, it shouldn’t be a plot. It’s far from the biggest problem of the episode, but in order to make the audience care as much as the AP Bio teacher does, it has to make sense. One thing has to make sense. Or just get rid of it.\n\nNothing makes sense in this episode, not even something as seemingly inconsequential as that. This is a failure of an episode of Teen Wolf, a show that can usually bring something out of even the most gratuitous slow-motion and shirt removal. No amount of Deaton repeating that the rules are changing will, well, change that. In fact, that’s the one moment where the episode really tries to be scary early on, and it’s absolutely laughable. Sadly, the episode itself is too devoid of anything to really be laughable itself. If this is what things are changing into, then it’s probably for the best if Scott and company just give up now.\n\nAdvertisement\n\nStray observations", "images": ["https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/f5zr3vuc90hrpnmx0nme.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,fl_progressive,g_center,h_264,q_80,w_470/b79608df135ebc4b059a2cdad3a83176.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/kqnkjlylkf7tymsqmoqr.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/52a29fe0001de9a08e76ea6d559528e9.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/u0939doeuioaqhspkjyc.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/j59upeyynundqjvbmcwj.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/v4sckews2f3bzf0ztbkf.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/aqhdzcldymb9mkltfhxh.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/rnxqtvv6advgidzfs6am.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/f2b6295902a8e0a7c4d168840e7b3d51.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/eti2h1r4wg0bqxctxenl.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/muaaluj2wznfomol9ero.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/no63bw902mddhwxtjtxh.png"], "top_img": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png", "keywords": [], "authors": [], "canonical_link": "https://www.avclub.com/teen-wolf-condition-terminal-1798184341", "title": "Teen Wolf: “Condition Terminal”", "meta_data": {"google-site-verification": "QDPLbDJXTQNT0n69mvNADCeRmwnbkYyL20OKJAVCKq8", "ir-site-verification-token": "-1270174611", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0,maximum-scale=10.0", "ROBOTS": "INDEX, FOLLOW, NOIMAGEINDEX", "msapplication-square70x70logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/no63bw902mddhwxtjtxh.png", "msapplication-square150x150logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_200,q_80,w_200/no63bw902mddhwxtjtxh.png", "keywords": "TV, Teen Wolf, Recap, The A.V. Club", "news_keywords": "TV, Teen Wolf, Recap, The A.V. Club", "twitter": {"url": "https://www.avclub.com/teen-wolf-condition-terminal-1798184341", "card": "summary_large_image", "site": "theavclub", "title": "Teen Wolf: “Condition Terminal”", "description": "Scott: “Why did you do that?”Dread Doctor: “His condition was terminal.”Scott: “What does that mean? What does that mean?!”Dread Doctor: “Failure!”", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png"}, "article": {"published_time": "2015-07-14T09:10:00.341Z", "modified_time": "2018-07-20T17:06:58.541Z"}, "description": "Scott: “Why did you do that?”Dread Doctor: “His condition was terminal.”Scott: “What does that mean? What does that mean?!”Dread Doctor: “Failure!”", "og": {"title": "Teen Wolf: “Condition Terminal”", "type": "article", "url": "https://www.avclub.com/teen-wolf-condition-terminal-1798184341", "description": "Scott: “Why did you do that?”Dread Doctor: “His condition was terminal.”Scott: “What does that mean? What does that mean?!”Dread Doctor: “Failure!”", "locale": "en_US", "site_name": "The A.V. Club", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png"}, "fb": {"app_id": 1621890511466174, "pages": 39581755672}}, "movies": [], "publish_date": 1436865000.341, "source": "https://tv.avclub.com", "summary": ""}