{"url": "https://www.indiewire.com/2018/02/the-death-and-life-of-john-f-donovan-jessica-chastain-xavier-dolan-1201924983/", "text": "Dolan says the decision \"has nothing to do with\" her performance.\n\nJessica Chastain has been cut from “The Death and Life of John F. Donovan,” but Xavier Dolan says the decision “has nothing to do with” her performance. Rather, there’s simply too much going on in the movie and the original cut was already more than four hours long. He announced the news on Instagram, where he shared effusive praise for his would-be leading lady.\n\n“What you need to hear from me is that Jessica Chastain’s character, after what was a long period of reflection, had to be cut from the film,” Dolan writes on Instagram. “It was an extremely difficult decision to make. I feel, toward Jessica, a very sincere love, and a great admiration. The decision was editorial and narrative, in that it has nothing to do with a performance, and everything to do with a character, and the compatibility of its storyline.”\n\nDolan goes on to explain that “this ‘villain’ subplot, albeit funny and entertaining, didn’t feel like it belonged to the rest of the story, which ended up not being on heroes or their nemesis, bur [sic] rather on childhood, and its dreams.”\n\n“Jessica has, since the very beginning, defended this project, and defended me on so many occasions,” he continues. “She is a terrific actress, a politically engaged artist, what is more, who relentlessly champions the causes she believes in. She is respected by her peers, and beloved by her public.”\n\nRead the rest of his lengthy, comma-happy statement below, and take solace in the fact that Kit Harington, Ben Schnetzer, Natalie Portman, Bella Thorne, Susan Sarandon, Jared Keeso, Kathy Bates, Thandie Newton, Michael Gambon, and Sarah Gadon are all still in the film.\n\nSign Up: Stay on top of the latest breaking film and TV news! Sign up for our Email Newsletters here.", "images": ["https://www.indiewire.com/wp-content/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://secure.gravatar.com/avatar/da95d074bbf672e8fd8522d0497ca762?s=96&d=mm&r=g", "https://www.indiewire.com/wp-content/themes/indiewire/sprites/logo/Logo_IndieWire.png", "https://www.indiewire.com/wp-content/uploads/2017/06/shutterstock_5669082ia.jpg?w=780", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.indiewire.com/wp-content/themes/indiewire/images/indiewire-color.png", "https://pixel.quantserve.com/pixel?a.1=p-60R-umvc0T-Cw&a.2=p-31f3D02tYU8zY"], "top_img": "https://www.indiewire.com/wp-content/uploads/2017/06/shutterstock_5669082ia.jpg?w=780", "keywords": [], "authors": ["Michael Nordine"], "canonical_link": "https://www.indiewire.com/2018/02/the-death-and-life-of-john-f-donovan-jessica-chastain-xavier-dolan-1201924983/", "title": "‘The Death and Life of John F. Donovan’: Jessica Chastain Cut From Xavier Dolan’s Upcoming Film", "meta_data": {"msvalidate.01": "87B78205BB25666E656DA3EB49F3FD42", "viewport": "width=device-width, initial-scale=1", "st": {"robots": "follow, index"}, "description": "Xavier Dolan announced the decision, which he says has nothing to do with Chastain's performance.", "news_keywords": "Jessica Chastain, The Death And Life Of John F. Donovan, Xavier Dolan", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=1400654071", "generator": "WordPress 6.0.2", "author": "Michael Nordine", "theme-color": "#ffffff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "IndieWire", "application-name": "IndieWire", "content_type": "Article", "post_id": 1201924983, "title": "'The Death and Life of John F. Donovan': Jessica Chastain Cut From Xavier Dolan's Upcoming Film", "published_at": "2018-02-04 20:09:46", "image": "https://www.indiewire.com/wp-content/uploads/2017/06/shutterstock_5669082ia.jpg?w=300", "comment_count": 13, "tags": "Xavier Dolan", "topics": "Film", "body": "Jessica Chastain has been cut from \"The Death and Life of John F. Donovan,\" but Xavier Dolan says the decision \"has nothing to do with\" her performance. Rather, there's simply too much going on in the movie and the original cut was already more than four hours long. He announced the news on Instagram, where he shared effusive praise for his would-be leading lady.\r\n\r\n\r\n\r\n\"What you need to hear from me is that Jessica Chastain's character, after what was a long period of reflection, had to be cut from the film,\" Dolan writes on Instagram. \"It was an extremely difficult decision to make. I feel, toward Jessica, a very sincere love, and a great admiration. The decision was editorial and narrative, in that it has nothing to do with a performance, and everything to do with a character, and the compatibility of its storyline.\"\r\n\r\nDolan goes on to explain that \"this 'villain' subplot, albeit funny and entertaining, didn't feel like it belonged to the rest of the story, which ended up not being on heroes or their nemesis, bur [sic] rather on childhood, and its dreams.\"\r\n\r\n\r\n\r\n\"Jessica has, since the very beginning, defended this project, and defended me on so many occasions,\" he continues. \"She is a terrific actress, a politically engaged artist, what is more, who relentlessly champions the causes she believes in. She is respected by her peers, and beloved by her public.\"\r\n\r\nRead the rest of his lengthy, comma-happy statement below, and take solace in the fact that Kit Harington, Ben Schnetzer, Natalie Portman, Bella Thorne, Susan Sarandon, Jared Keeso, Kathy Bates, Thandie Newton, Michael Gambon, and Sarah Gadon are all still in the film.\r\n\r\nhttps://www.instagram.com/p/Bey2fUjg_AC/", "fb": {"pages": 9800035481}, "fragment": "!", "og": {"type": "article", "title": "‘The Death and Life of John F. Donovan’: Jessica Chastain Cut From Xavier Dolan’s Upcoming Film", "url": "https://www.indiewire.com/2018/02/the-death-and-life-of-john-f-donovan-jessica-chastain-xavier-dolan-1201924983/", "description": "Dolan says the decision “has nothing to do with” her performance.", "site_name": "IndieWire", "image": {"identifier": "https://www.indiewire.com/wp-content/uploads/2017/06/shutterstock_5669082ia.jpg?w=780", "width": 780, "height": 520, "alt": "Jessica Chastain"}, "locale": "en_US"}, "article": {"published_time": "2018-02-05T01:09:46+00:00", "modified_time": "2018-02-05T01:09:46+00:00"}, "twitter": {"site": "@indiewire", "creator": "@slowbeard", "card": "summary_large_image", "title": "‘The Death and Life of John F. Donovan’: Jessica Chastain Cut From Xavier Dolan’s Upcoming Film", "description": "Xavier Dolan announced the decision, which he says has nothing to do with Chastain's performance.", "image": "https://www.indiewire.com/wp-content/uploads/2017/06/shutterstock_5669082ia.jpg?w=780"}, "msapplication-TileImage": "https://www.indiewire.com/wp-content/uploads/2018/04/cropped-iw_favicon.png?w=270"}, "movies": [], "publish_date": 1517792986.0, "source": "https://www.indiewire.com", "summary": ""}