{"url": "https://www.elitedaily.com/p/selena-gomezs-2017-amas-performance-included-a-car-crash-it-was-so-intense-5478398", "text": "Selena Gomez has had exactly the opposite of what I'd call a casual year. She's been consistently churning out some of 2017's best songs, rebounding in a big way after her breakup with The Weeknd, recovering from a life saving surgery, and now she's performing at the American Music Awards as if she hasn't just undergone a truly insane few months. NOT A BIG DEAL. Selena Gomez's 2017 AMAs performance proves this woman can do anything, no matter what life throws at her.\n\nJust when we all thought it was all \"Bad Liar\" music video parties and \"Fetish\" sexy-times for Gomez, we found out that, JK!, she's actually undergone a kidney transplant procedure in the middle of simultaneously pushing her new music to the masses. Talk about intense.\n\nGomez revealed in early September that her best friend Francia Raisa donated her kidney to help save her life, which came as a huge shock to her fans. While Gomez was busy laying low in recovery, the public was oblivious to her situation and soaking up hit after hit. We were just low-key getting down with our bad selves to her new, sultry and sexy tracks.\n\nThen in early October, more shocking news broke that her ten month relationship with The Weeknd had ended, and fans started freaking out all over again. First of all, now everything we've thought to be true about love and relationships feels like a lie, and second... SELENA, ARE YOU OK?\n\nYes, guy. Yes she is. Tonight's performance proves it.\n\nGomez stepped (rolled) onto the stage and sang her heart out to her new hit, \"Wolves.\" The song was in collaboration with DJ Marshmello, and the performance was true fire. This is the first time Gomez has performed since announcing her kidney transplant, and she expertly maneuvered the stage looking as fierce as ever. The audience went crazy for her. While we've had the audio to \"Wolves\" for a little bit of time now, watching her perform it was a totally different animal. (No pun intended.) (Just kidding. Pun intended.)\n\nFans were also keeping their eyes peeled for glimpses of her on-again boyfriend Justin Bieber, who had four AMA nominations himself. Biebs was nominated twice for Collaboration of the Year, and again in categories Favorite Song — Pop/Rock for \"Despacito\" and Favorite Rap/Hip-hop for his song \"I'm The One.\"\n\nOf course, viewers were dying to see Bieber's face when Gomez stepped out on stage in hopes it would finally confirm to the public that they're back together. Earlier this week, photos surfaced of the couple kissing at one of Bieber's hockey games, so we can only imagine that they're 100 percent back on.\n\nHonestly, it looks like their relationship is the real deal and Gomez is giving him another chance. An insider told People magazine,\n\nJustin was Selena’s first love. He will always have a special place in her heart. She’s always held out hope that one day the circumstances and timing would be right.\n\nAnd it's no surprise Justin has wanted her back all along. The source added,\n\nSpending time together makes them both very happy. For Justin, no one ever came close to comparing to Selena. He always thought she was the most special and now seems mature enough to realize Selena deserves the best.\n\nHell yeah, she does.\n\nIf tonight's performance is any indication, she is feeling better than ever and we can't wait to see what 2018 brings for the pop princess and her love life.\n\nCheck out the entire Gen Why series and other videos on Facebook and the Bustle app across Apple TV, Roku, and Amazon Fire TV.", "images": ["https://imgix.bustle.com/uploads/getty/2022/9/26/02fa0add-3382-4344-89c6-a701d27bc64b-getty-1243395808.jpg?w=138&h=138&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2022/10/3/7e2e1dab-5f5e-43b2-aeec-87037aaa3e0b-getty-1429588574.jpg?w=138&h=138&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.4893&fp-y=0.2322", "https://imgix.bustle.com/uploads/getty/2017/11/15/3aae8873-a473-4713-9c86-b6e97dc2fdf0-getty-865609378.jpg?w=374&h=249&fit=crop&crop=faces&auto=format%2Ccompress", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2017/11/15/3aae8873-a473-4713-9c86-b6e97dc2fdf0-getty-865609378.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2022/10/7/383ca242-cc04-4aa6-86b9-2b8b3513ba31-getty-1422401304.jpg?w=138&h=138&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.5133&fp-y=0.456"], "top_img": "https://imgix.bustle.com/uploads/getty/2017/11/15/3aae8873-a473-4713-9c86-b6e97dc2fdf0-getty-865609378.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/selena-gomezs-2017-amas-performance-included-a-car-crash-it-was-so-intense-5478398", "title": "Selena Gomez Performed “Wolves” At The AMAs & It Was Seriously Intense", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image", "creator": "@jamieleelo"}, "article": {"publisher": "https://www.facebook.com/EliteDaily"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/selena-gomezs-2017-amas-performance-included-a-car-crash-it-was-so-intense-5478398", "type": "article", "title": "Selena Gomez Performed “Wolves” At The AMAs & It Was Seriously Intense", "description": "Selena Gomez has had exactly the opposite of what I'd call a casual year. She's been consistently churning out some of 2017's best songs, rebounding in a big way after her breakup with The Weeknd, recovering from a life saving surgery, and now she's…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2017/11/15/3aae8873-a473-4713-9c86-b6e97dc2fdf0-getty-865609378.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "Selena Gomez has had exactly the opposite of what I'd call a casual year. She's been consistently churning out some of 2017's best songs, rebounding in a big way after her breakup with The Weeknd, recovering from a life saving surgery, and now she's…"}, "movies": ["https://www.youtube.com/embed/kMafJ-zcP6M"], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}