{"url": "https://www.billboard.com/articles/columns/pop/8062552/melanie-martinez-rape-accuser-heller-speaks", "text": "Former Dresses singer Timothy Heller says that a month before she accused former The Voice star Melanie Martinez of rape, Martinez attempted to get in touch with her after a long period of silence.\n\nIn an interview with Newsweek, Heller claims that after she tweeted last month asking “what if I have my own story of abuse but I’m scared to ruin the persons life and I still love them in a fucked up way and the public really loves them and most probably wouldn’t believe me,” Martinez tried to contact her 20 minutes later, after the two hadn’t spoke in more than a year.\n\nExplore Explore Melanie Martinez See latest videos, charts and news See latest videos, charts and news\n\nOn Monday (Dec. 4), Heller posted a lengthy tweet in which she described a night during which she “repeatedly said no” to advances from her “best friend” Martinez, claiming she kept the secret for years and alleging that Martinez performed oral sex on her and used a sex toy without her consent. Martinez adamantly denied the claims, saying she was “horrified and saddened” by them and that “she never said no to what we chose to do together.”\n\nAfter Heller’s original tweet, she told the magazine, “I started sobbing when I saw [Melanie] was calling me, and I blocked her.” She also claimed that Martinez attempted to call Heller’s boyfriend and texted him several times seeking to get in touch with Heller, whom Martinez said she had recently dreamed about. “Her fans see her as this angel who understands them,” Heller told Newsweek. “So I assumed no one was going to take me seriously if I explained what she did. I’ve been reading all the #metoo stories, and though I’m obviously in support of the people coming forward, I wasn’t sure if my story of being assaulted fit.”\n\nIt is one of the rare allegations of sexual assault by a woman in the midst of the torrent of stories surrounding prominent men in entertainment, business, politics and sports assaulting or harassing women that launched the #MeToo movement, which Time Magazine named its Person of the Year on Wednesday (Dec. 6).\n\nHeller’s claims about what she says happened that night in June 2015 — including pictures she gave the magazine of her in a mask and furry handcuffs that were allegedly taken on the night in question — include her admission of being wracked with guilt for years as the pair remained friends.\n\n“I think I was invalidating my own experience for so long because she’s not a man,” Heller said. “Plus, she was my friend, and I sat with what happened in silence because I didn’t want to be malicious.” A representative for Martinez told Newsweek that “Melanie stands by her statement.” Click here to read the full Newsweek story.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204652553202666&ev=PageView&noscript=1", "https://www.billboard.com/wp-content/uploads/media/melanie-martinez-2017-billboard-1548.jpg?w=1024", "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/public/lazyload-fallback.gif"], "top_img": "https://www.billboard.com/wp-content/uploads/media/melanie-martinez-2017-billboard-1548.jpg?w=1024", "keywords": [], "authors": ["Gil Kaufman"], "canonical_link": "https://www.billboard.com/music/pop/melanie-martinez-rape-accuser-heller-speaks-8062552/", "title": "Melanie Martinez Rape Accuser Says ‘I Had This Sick Need to Protect Her’: Report", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/icons/icon-144x144.png", "msapplication-TileColor": "#eff4ff", "description": "Former Dresses singer Timothy Heller says that a month before she accused former The Voice star Melanie Martinez of rape, Martinez tried to get in touch with her after a long period of silence.", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "billboard", "pmc-page_type": "article", "articleid": 8062552, "author": "Gil Kaufman", "pmc-category": "Music,Pop", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-12-07T12:50:54"}, "title": "Melanie Martinez Rape Accuser Says ‘I Had This Sick Need to Protect Her’: Report", "pageclass": "article", "pmc-is_free": "no", "pmc-always-paywall": "no", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-exclusive": "no", "pmc-breaking-news": "no", "pmc-prime": "no"}, "generator": "WordPress 6.0.2", "author": "Gil Kaufman", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Billboard", "application-name": "Billboard", "content_type": "Article", "post_id": 8062552, "title": "Melanie Martinez Rape Accuser Says 'I Had This Sick Need to Protect Her': Report", "published_at": "2017-12-07 12:50:54", "image": "https://www.billboard.com/wp-content/uploads/media/melanie-martinez-2017-billboard-1548.jpg?w=1024", "comment_count": 0, "topics": "Pop", "body": "Former Dresses singer Timothy Heller says that a month before she accused former The Voice star Melanie Martinez of rape, Martinez attempted to get in touch with her after a long period of silence.In an interview with Newsweek, Heller claims that after she tweeted last month asking \"what if I have my own story of abuse but I'm scared to ruin the persons life and I still love them in a fucked up way and the public really loves them and most probably wouldn't believe me,\" Martinez tried to contact her 20 minutes later, after the two hadn't spoke in more than a year.On Monday (Dec. 4), Heller posted a lengthy tweet in which she described a night during which she \"repeatedly said no\" to advances from her \"best friend\" Martinez, claiming she kept the secret for years and alleging that Martinez performed oral sex on her and used a sex toy without her consent. Martinez adamantly denied the claims, saying she was \"horrified and saddened\" by them and that \"she never said no to what we chose to do together.\"After Heller's original tweet, she told the magazine, \"I started sobbing when I saw [Melanie] was calling me, and I blocked her.\" She also claimed that Martinez attempted to call Heller's boyfriend and texted him several times seeking to get in touch with Heller, whom Martinez said she had recently dreamed about. \"Her fans see her as this angel who understands them,\" Heller told Newsweek. \"So I assumed no one was going to take me seriously if I explained what she did. I've been reading all the #metoo stories, and though I'm obviously in support of the people coming forward, I wasn't sure if my story of being assaulted fit.\"It is one of the rare allegations of sexual assault by a woman in the midst of the torrent of stories surrounding prominent men in entertainment, business, politics and sports assaulting or harassing women that launched the #MeToo movement, which Time Magazine named its Person of the Year on Wednesday (Dec. 6). Heller's claims about what she says happened that night in June 2015 -- including pictures she gave the magazine of her in a mask and furry handcuffs that were allegedly taken on the night in question -- include her admission of being wracked with guilt for years as the pair remained friends. \"I think I was invalidating my own experience for so long because she's not a man,\" Heller said. \"Plus, she was my friend, and I sat with what happened in silence because I didn't want to be malicious.\" A representative for Martinez told Newsweek that \"Melanie stands by her statement.\" Click here to read the full Newsweek story.", "fb": {"pages": 75791669580}, "fragment": "!", "og": {"type": "article", "title": "Melanie Martinez Rape Accuser Says ‘I Had This Sick Need to Protect Her’: Report", "url": "https://www.billboard.com/music/pop/melanie-martinez-rape-accuser-heller-speaks-8062552/", "description": "Former Dresses singer Timothy Heller says that a month before she accused former The Voice star Melanie Martinez of rape, Martinez tried to get in touch with her after a long period of silence.", "site_name": "Billboard", "image": {"identifier": "https://www.billboard.com/wp-content/uploads/media/melanie-martinez-2017-billboard-1548.jpg?w=1024", "width": 1024, "height": 677, "alt": "Melanie Martinez"}, "locale": "en_US"}, "article": {"published_time": "2017-12-07T17:50:54+00:00", "modified_time": "2017-12-07T21:19:21+00:00"}, "twitter": {"site": "@billboard", "card": "summary_large_image", "title": "Melanie Martinez Rape Accuser Says ‘I Had This Sick Need to Protect Her’: Report", "description": "Former Dresses singer Timothy Heller says that a month before she accused former The Voice star Melanie Martinez of rape, Martinez tried to get in touch with her after a long period of silence.", "image": "https://www.billboard.com/wp-content/uploads/media/melanie-martinez-2017-billboard-1548.jpg?w=1024"}}, "movies": [], "publish_date": 1512669054.0, "source": "https://www.billboard.com", "summary": ""}