{"url": "https://www.departures.com/gift-guide/editors-shopping-ideas", "text": "Each product we feature has been independently selected and reviewed by our editorial team. If you make a purchase using the links included, we may earn commission.\n\n'Tis the magical season for showing appreciation to your loved ones. And as editors here, we're privileged to be surrounded by beautiful, inspiring and exciting new designs every day, so it feels like we've been researching for this all year.\n\nFor our gift guides this year, we've been busy scouring the depth of the internet for the best gift ideas that will delight everyone on your list—even the pickiest. From the foodie fiend, to the new parents, to the photographer, to the dog-obsessed, or the one on your list who needs a little TLC. But sometimes its the most personal of recommendations that spark the best ideas.\n\nRelated: The Best Luxury Backpacks to Take with You on Your Next Trip\n\nWhich is why we're letting you in on our gift-giving arsenal of ideas to both give (family, friends, and loved ones should look away now) and also the gifts we'd love to receive (you can look back now and take notes, friends).\n\nHere's what our editors are either hoping to score this season or to gift to the favorite people in their life.\n\n2017 Wild Eyes, Red Wine, Napa Valley\n\n“Every year around the holidays, my husband and I make a trip up to Napa. We love that area, and I'm a big fan of experiential gifting, so surprising him with an amazing meal or a private wine tasting is perfect. This year, it just isn't realistic to make the trip because of health concerns, but I wanted to bring the Napa experience into our home—and support the wineries who have seen reduced tourism because of the Glass Fire. I've been eyeing a case Wild Eyes, a Bordeaux-style blend from Tank Garage Winery as a gift for him, so we can have our own Napa-inspired holiday at home.”\n\n– Maya Kachroo-Levine, Contributing Digital Editor\n\nTo buy: $65 to $780, tankgaragewinery.com\n\nSeattle Fir Double Wick Candle\n\nIt may seem basic to opt for candles as a holiday gift, but I really can't help myself. I update my candles with every season, and love to give a small house plant alongside a candle—I just think it will never go to waste. This year, I've been a huge fan of Sukie's Candle Co. For winter gifts, I'd recommend warming scents like her double-wick Brown Sugar and Fig, Amber Noir, and Seattle Fir.\n\n– Maya Kachroo-Levine, Contributing Digital Editor\n\nTo buy: $26, sukiescandleco.com\n\nA Very Dior Holiday\n\n“Two things I’m obsessed with this winter are bold lips and Dior. This five pack lipstick set is the perfect blend of rock’n’roll meets elegant with a sprinkle of holiday magic making it my favorite gift (both for others, and myself!) The leather case is a work of art itself, being adorned with gold snowflakes and the famous Dior logo now becomes a matching set with the stunningly chic new Bobby Bag. “\n\n—Alessandra Amodio, Photo Editor\n\nTo buy: $180, saksfifthavenue.com (lipstick), $3,250, dior.com (bag)\n\nA Champagne Trio: Laurent-Perrier, Veuve Clicquot, Krug\n\nThis year, I've developed a penchant for enjoying a glass of Champagne even when there is nothing, in the traditional sense, to celebrate. I think that's what is so lovely about it: the spontaneity. Each of these three indulgent bottles warrants a celebration in its own right, and the three of them together will make the perfect gift for the bubbly lover in your life.\n\n— Ellie Nan Storck, Associate Digital Editor\n\nTo buy: $150, wine.com (Laurent-Perrier); $90, wine.com (Veuve Clicquot); $220, wine.com (Krug)\n\nThursday Boots: The Knockout\n\nI've always longed for an ankle boot that is both practical and stylish, utilitarian and just a little edgy. There's something undeniably timeless about this leather pair from Thursday Boots. I feel like I could strut down Fifth Ave or weather a rain storm in the English countryside in them—and fit right in. The chunky heel packs a punch in the style department, but these boots do not mess around when it comes to durability.\n\n— Ellie Nan Storck, Associate Digital Editor\n\nTo buy: $168, thursdayboots.com\n\nInternational Cookbook Collection\n\n\"Until we can travel freely around the world again, I’ve been bringing my favorite destinations to my kitchen and home bar instead, finding wanderlust in destination-focused recipe books. This International Cookbook Collection from Phaidon is a winning combo and could be just the ticket for someone in need of a big oomph of inspiration. Bonus: they’ll look great on the Zoom background.\"\n\n\n\n—Tal Dekel-Daks, Audience Engagement Editor\n\nTo buy: From $45; onepartco.com\n\n1pt Cocktail Infusion Kit\n\n“Infuse at lunch and you’ll have cocktails ready for dinner, ” Andrew Hellman, One Part Co.’s Co-founder & CEO, explained to Departures. The Connecticut brand invented a new, aesthetically-pleasing infusion kit for cocktail enthusiasts to experiment with at home, and it really is special. How does it work? The standard One Part Co. infusion kit includes a 375ml bottle (half the size of a typical liquor bottle) with a walnut cap and a stainless steel infusion basket that's ready to hold a single packet of any of the company's all-natural 1pt infusion blends. It’s the perfect gift for a drinks enthusiast who wants to take their home mixes to the next level. You can pick the blends by their favorite alcohol, too (i.e. Gifts for Whiskey Lovers). Pretty neat.”\n\n—Tal Dekel-Daks, Audience Engagement Editor\n\nTo buy: $45; 1stdibs.com\n\nRelated: The Best Spirits to Give This Holiday Season\n\nCeramic Bowls From Jono Pandolfi\n\n“Something tells me this winter is going to be a long one, so I’m preparing for some intense nesting with my holiday gifting. Top of my list: ceramics from Jono Pandolfi. I discovered the studio’s work at the NoMad—their exquisite dishes are on every table at the hotel’s restaurant—and I have since thrown out every last saucer and coffee cup in my kitchen to replace them with these earthy yet chic designs. I plan to add some extra-large bowls from the Coupe Collection; they’re perfect for soups and stews.”\n\n\n\n—Jackie Caradonio, Travel Director\n\n\n\nTo buy: $45; Jonopandolfi.com\n\nSaint Laurent Niki Quilted Shoulder Bag\n\n“Completely obsessed. This green quilted bag from Saint Laurent is just what all of my athleisure wear needs for a pick-me-up this winter. I am gifting this bag in this exact color to myself. I’m so good to me.”\n\n\n\n—Deanne Kaczerski, Digital Executive Editor\n\n\n\nTo buy: $2,290; Net-a-porter.com\n\nNitro Cold Brew Coffee Maker\n\n“My husband is the coffee drinker of this duo. Recently, he’s been ordering cold brews over his hot misos. He’ll love that this has an industrial look while being able to enjoy his morning coffee without leaving the house.”\n\n\n\n—Deanne Kaczerski, Digital Executive Editor\n\n\n\nTo buy: $200; Uncommongoods.com\n\nBrent Neale 18-karat Gold, Emerald And Topaz Ring\n\n“I adore this ring. It reminds me of a trinket my dad bought me from a flea market when I was 8 years old.”\n\n\n\n—Deanne Kaczerski, Digital Executive Editor\n\nTo buy: $7,450; Net-a-porter.com\n\nPaul Arnhold Glass Vases\n\n“This holiday season I think the best any of us can do is to spread a little cheer: Paul Arnhold Glass‘ beautiful hand-blown vases, bowls, and other tabletop finery are just the ticket for livening up my friends’ home office situations for the holiday and beyond.\"\n\n\n\n—Alessandra Codinha, Style Director\n\n\n\nTo buy: from $200; Paularnholdglass.com\n\nAlcohol Gifts For the Connoisseur\n\n“I’m nothing if not reliable, so wines and spirits have always been my go-to holiday gift because it’s easy to find the perfect bottle for everyone. Especially now, with travel being off-limits, giving one of your favorite bottles is also a great way to be mentally transported to one of your favorite destinations. This year, I have a few favorites that I’ve been eyeing for my friends and family. For the whiskey fans, I’m going with the Starward Nova Single Malt Whisky ($56.99). It’s aged in Australian red wine barrels and has a dangerously smooth finish. Sipsmith is my dependable go-to for any gin lover and the VJOP is a premium offering ($52.99). And for winos, I like to have a red, white, and Champagne option. So this year I’m going with Silver Oak Alexander Valley Cabernet Sauvignon 2016 ($84.99), Cakebread Chardonnay 2018 ($44.99), and Laurent-Perrier La Cuvee Brut ($44.99), which are all really standout vintages.”\n\n\n\n—Sean Flynn, Deputy Digital Editor\n\nTiffany T T1 Wide Diamond Hinged Bangle\n\n“This holiday season I’ll be investing in timeless, lasting pieces. The Tiffany T1 bangle is an instant classic and a modern heirloom I can pass down to my children.”\n\n\n\n—Melissa Ventosa Martin, Fashion Director\n\n\n\nTo buy: $19,000 Tiffany.com\n\nJW Anderson Gray Felt Buckle Slipper Loafers\n\n\"After spending months on end in my sweatshirts and gym shorts, it’s hard to part from comfy clothes. These JW Anderson mules are the perfect holiday gift for those of us venturing back into the office, but not ready to leave behind the ease of WFH dressing.\"\n\n\n\n— Davian Rodriguez, Assistant Fashion Editor\n\n\n\nTo buy: $375; Ssense.com\n\nLéa & Nicolas Teapot\n\n\"Goodee is a fantastic and relatively new online source for design objects and everything for the home and it has a socially conscious mission. It was started by the twin brothers who founded WANT Les Essentiels, so the taste level is absolutely superb but also accessible and universally appealing. I'm really into great tabletop pieces nowadays to enhance our everyday rituals. So this hand-thrown ceramic piece speaks to me.\"\n\n\n\n—Dan Rubinstein, Home & Design Director\n\n\n\nTo buy: $240; Goodeeworld.com\n\nSouth Bay Board Co 8.8 Heritage Surfboard\n\n\"A few years ago, I tried surfing in Hawaii for the first time and I was hooked immediately! The feeling of standing up and riding your very first wave—albeit a tiny one—is absolutely intoxicating. Having said that, I am no Stephanie Gilmore and I do have a very, very long way to go until I can do all the turns, snaps, carving, and tail sliding (surfing lingo is amazing, isn’t it?!) you associate with surfing.\n\nI am hoping this longboard will be the first step towards a future full of exciting wave riding. It’s the perfect beginner surfboard—long, wide, and made of foam. The reason you’d like it to be all those three things is that those boards give you maximum stability and surface for paddling and standing up. Oh, and if it ends up hitting you (which I am sorry to say, it will eventually do), it won’t seriously hurt you (or anyone around you) since it’s made from foam.”\n\n— Dobrina Zhekova, Digital Contributor\n\n\n\nTo buy: $529; Southbayboardco.com\n\nDrunk Elephant Dewy Kit\n\n“I'm a big fan of getting (and giving) skincare products around the holidays. Something about the cold weather/dry skin plight makes me want super hydrating night creams, high-end lip balms, and maybe a new eye cream to combat the ill-advised third-glass-of-holiday-wine dark circles. Plus, you throw in the new year approaching, and for me, somehow the New Year, New Me hype manifests in a strong desire to buy luxe face masks. I'm a big proponent of the Drunk Elephant sets—the Dewy set is my favorite—and I always have my eye on a resupply of T.L.C. Sukari Babyfacial and Virgin Marula Luxury Facial Oil, the two together make for a game-changing antidote to dry skin.”\n\n\n\n– Maya Kachroo-Levine, Contributing Digital Editor\n\n\n\nTo buy: $75; Sephora.com", "images": ["https://www.departures.com/assets/img/twitter.b0c9e489.svg", "https://departures-web-va-private-herokuapp-com.freetls.fastly.net/public/assets/_featuredArticleCards/mexico-city-guide-best-shopping-style-art-and-design-13-2.jpg", "https://departures-web-va-private-herokuapp-com.freetls.fastly.net/public/assets/_featuredArticleCards/vollebak-100-year-hoodie.jpg", "https://departures-web-va-private-herokuapp-com.freetls.fastly.net/public/assets/_featuredArticleCards/paris-best-hotels-restaurants-shopping-2.jpg", "https://www.departures.com/assets/img/newsletter-banner.e693c09e.jpg", "https://www.departures.com/assets/img/instagram.4cb6c4e4.svg", "https://departures-web-va-private-herokuapp-com.freetls.fastly.net/public/assets/_featuredArticleCards/guatemala-cas-palopo-hotel-8.jpg", "https://departures-web-va-private-herokuapp-com.freetls.fastly.net/public/assets/_headerFeaturedArticle/448328/Best-Air-Purifier-Molekule-Air-Mini-001.webp", "https://departures-web-va-private-herokuapp-com.freetls.fastly.net/public/assets/_featuredArticleCards/Kyoto-Japan-Best-Ramen-Ryokan-Restaurants-1.jpg", "https://departures-web-va-private-herokuapp-com.freetls.fastly.net/public/assets/_featuredArticleCards/lake-como-italy-15.jpg", "https://departures-web-va-private-herokuapp-com.freetls.fastly.net/public/assets/_featuredArticleCards/where-to-eat-stay-explore-napa-california-3_2.jpg", "https://departures-web-va-private-herokuapp-com.freetls.fastly.net/public/assets/_featuredArticleCards/best-food-drinks-shopping-august-2022-1.jpg", "https://departures-web-va-private-herokuapp-com.freetls.fastly.net/public/assets/_featuredArticleCards/388399/stissing-house-restaurant-pine-plains-new-york-6.webp", "https://departures-web-va-private-herokuapp-com.freetls.fastly.net/public/assets/_featuredArticleCards/Venice-Italy-Travelogue-18_2022-09-08-150323_uwgw.jpg", "https://departures-web-va-private-herokuapp-com.freetls.fastly.net/public/assets/_featuredArticleCards/Best-Air-Purifier-Molekule-Air-Mini-001.jpg", "https://departures-web-va-private-herokuapp-com.freetls.fastly.net/public/assets/_featuredArticleCards/best-books-summer-2022-4.jpg", "https://departures-web-va-private-herokuapp-com.freetls.fastly.net/public/assets/_featuredArticleCards/487746/us-open-carvell-wallace-best-menswear-2.webp", "https://www.departures.com/assets/img/dpicon.d88d410d.svg", "https://departures-web-va-private-herokuapp-com.freetls.fastly.net/public/assets/_featuredArticleCards/Hudson-Valley-Best-Restaurants-Wineries-Breweries-1_2022-08-17-140426_svoe.jpg", "https://departures-web-va-private-herokuapp-com.freetls.fastly.net/public/assets/_featuredArticleCards/best-luxury-knives-to-buy-1.jpg", "https://departures-web-va-private-herokuapp-com.freetls.fastly.net/public/assets/_featuredArticleCards/470807/Best-Cookware-1.webp", "https://departures-web-va-private-herokuapp-com.freetls.fastly.net/public/assets/_featuredArticleCards/masters-2022-shopping-guide-1.jpg", "https://departures-web-va-private-herokuapp-com.freetls.fastly.net/public/assets/_featuredArticleCards/New-York-City-Fifth-Avenue-Anniversary-13.jpg"], "top_img": "https://www.departures.com/assets/img/dpicon.d88d410d.svg", "keywords": [], "authors": ["The Editors", "Published On", "Words Hailey Andresen", "Photography Alex Brodsky", "Words Adam H. Graham", "Words Skye Parrott", "T. Cole Rachel", "Nina Renata Aron", "Sophie Mancini", "Annette Lamothe-Ramos"], "canonical_link": "https://www.departures.com/archive/gift-guide/editors-shopping-ideas", "title": "Must-See Destinations, Hotels, Restaurants, Guides", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "rgb(255, 255, 255)", "generator": "SEOmatic", "keywords": "travel,cuisine,hotels,restaurants,guides,style", "description": "A magazine about exceptional places, people, and things for American Express Platinum Card® and Centurion® Members.", "referrer": "same-origin", "robots": "all", "og": {"locale": "en_US", "site_name": "Departures", "type": "website", "url": "https://www.departures.com/archive/gift-guide/editors-shopping-ideas", "title": "Departures | Must-See Destinations, Hotels, Restaurants, Guides", "description": "A magazine about exceptional places, people, and things for American Express Platinum Card® and Centurion® Members.", "image": {"alt": "A magazine about exceptional places, people, and things for American Express Platinum Card® and Centurion® Members."}, "see_also": "instagram.com/departures"}, "twitter": {"card": "summary_large_image", "site": "@DeparturesMag", "creator": "@DeparturesMag", "title": "Departures | Life From Unexpected Perspectives", "description": "A magazine about exceptional places, people, and things for American Express Platinum Card® and Centurion® Members.", "image": {"alt": "A magazine about exceptional places, people, and things for American Express Platinum Card® and Centurion® Members."}}}, "movies": [], "publish_date": null, "source": "https://www.departures.com", "summary": ""}