{"url": "https://www.usatoday.com/story/life/entertainthis/2018/02/05/bachelor-recap-kendall-takes-krystal-three-women-leave/309913002/", "text": "'The Bachelor' recap: Kendall takes on Krystal, three women leave\n\nShow Caption Hide Caption Arie Luyendyk Jr. is the new 'Bachelor' The former auto racer will be the serial dater for the 22nd season of the show. Wochit\n\nSpoiler alert: This story contains substantial details from Monday's episode of The Bachelor.\n\nHoo boy, what an episode! The team goes to Paris this week for FOUR dates: two one-on-ones, a group date, and a two-on-one that finally wraps up what seemed like a never-ending hell-scape of a plot point. Krystal is eliminated, and on top of that, Jenna departs. But maybe most surprisingly, Chelsea doesn't receive a rose. Our sweet mama is excused. Let's review.\n\nThe Rundown!\n\nYou Like Cheese? Wow.\n\nLauren B is probably a great girl, but there's something about Laurens this season. Maybe it's that they have to carry the date for both Arie and herself. Maybe it's that they don't want to. Either way, when she and Arie end up at a street market, you can't help but notice that the date is painfully, awkwardly quiet. But this time, it's kind of hard to blame Lauren, because the conversation literally went:\n\nARIE: We see cheese like this at home.\n\nLAUREN: Wow.\n\nLauren B is stunning but I may not be able to finish the rest of the episode because this date is putting me to sleeeeep #thebachelor — Christen Whitney (@Christen_mae_) February 6, 2018\n\nThat's not even a joke. But after all the painful silence, the date takes a turn when Arie talks about his previous girlfriend miscarrying their child and then immediately leaving him. Bachelor whiplash, y'all. In response, Lauren reveals she was engaged once, and if you're reading this and thinking \"those aren't similar stories,\" you're totally right. After mustering up some semblance of a personal anecdote, Lauren is gifted a rose anyway for simply managing to stay awake.\n\nDATE PART ONE: *nothing*\n\nDATE PART TWO: *nothing*\n\nDATE PART THREE: My girlfriend got pregnant, then she lost the baby, and then she immediately left me.#TheBachelor pic.twitter.com/w4i7Biv4sH — Justin Kirkland (@justinkirkland4) February 6, 2018\n\nMoulin Rouge\n\nThe group date heads to the historic Moulin Rouge where they learn to dance. Seinne immediately shines and Bekah M loves the costume, because Bekah loves the drama of it all. But the costumes and dancing all leads to a challenge, and whoever wins gets to dance with Arie on stage, which sounds low-key terrifying.\n\nI’m hiding in a hole now — Tia Booth (@tiarachel91) February 6, 2018\n\nTia locks in a real moment of connection with Arie, as does Seinne, who even drops a little bit of French on him because this is Paris, and Paris is sexy and romantic and vaguely exciting. It's Bekah M who lands the rose though and does a little dance number with Arie while the other girls contemplate ways to, you know, maybe kill her.\n\nKrystal v Kindness\n\nKrystal announces her and Kendall's two-on-one like an actual sociopath because intimidation is her game. They head to the French countryside and end up in a maze searching for him, like some twisted bougie white woman version of a horror movie. Krystal finds him, and honestly, I thank God because I wonder if Kendall would have survived if she had made it first.\n\nArie takes Krystal aside to talk about that little temper tantrum she had last week, which she totally flips around, eventually pivoting to how Kendall isn't emotionally available enough for a relationship. Arie immediately brings that up with Kendall, and girlfriend stays cool as a cucumber. When she gets back to Krystal, she very calmly tells her that she needs to let go of her hurt and insecurity because she's a good person who has just lost track of how to be good. It's either the most sympathetic gesture in history or a NEXT LEVEL DRAG.\n\nLove love love Kendall moving towards and to Krystal in this setting and expressing empathy. So beautiful! Yes! #TheBachelor — Taylor Nolan (@taymocha) February 6, 2018\n\nArie decides that he doesn't have enough information, so he pushes his decision to dinner. Later, Krystal tries to explain her way out of the conversation, but Kendall maintains all composure. When the rose comes out, it doesn't go in the way of Krystal. Kendall stays and the reign of terror is over.\n\nJacqueline?\n\nEvery season there's a seemingly great girl who appears five weeks in, and you're like, \"Who's that? Jacqueline? Has she been here this whole time?\" She and Arie take off in a car and go shopping in Paris for her one-on-one, and the whole thing is unfortunate because she is well-spoken and pretty funny, and you know this can't last too long. But in the end, Arie gives her a rose and keeps her around, which is great... for now.\n\nI'm super happy because I want good things for Jacqueline, but I also hope she loses because I want good things for Jacqueline. #TheBachelor pic.twitter.com/xI7oY6QT8N — Justin Kirkland (@justinkirkland4) February 6, 2018\n\nSuperlatives!\n\nMost Likely to Succeed\n\nKendall, who was easy to write off with all her sweet taxidermy talk, rose to the occasion on the Paris two-on-one date. With Krystal playing mad mind games on her, she leaned on the most powerful weapon of all: sincere kindness. By telling Krystal she was beautiful, but she was also imperfect like everyone else, Krystal went into dinner completely shaken while Kendall stayed completely composed.\n\nLeast Likely to Become a Rockette\n\nTia is handily a frontrunner this season, but that dance session? Well, poor girl couldn't carry choreography out if you put it in a bucket for her. Through a couple curse words and irresistible charm, she skates through the challenge, but man. Give the girl her frog legs and let her turn in those dance shoes.\n\nBest Place to Start Over and Realize You Don't Need a Man\n\nTuscany, which is where the gang is headed next week!\n\nMore Recaps:\n\nKrystal snaps on Arie, three women leave\n\nThree dates, two eliminations, only one Krystal\n\nA traumatic night for Annaleise, Bibiana, and Lauren S", "images": ["https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://www.gannett-cdn.com/-mm-/514922ee78c25e2bb90a92cf29ab3e31e5542750/c=0-153-3000-1848/local/-/media/2018/02/05/USATODAY/USATODAY/636534658976824985-147719-5105.jpg?auto=webp&format=pjpg&width=1200", "https://media.gannett-cdn.com/29906170001/29906170001_5567602573001_5567600698001-vs.jpg?pubId=29906170001"], "top_img": "https://www.gannett-cdn.com/-mm-/514922ee78c25e2bb90a92cf29ab3e31e5542750/c=0-153-3000-1848/local/-/media/2018/02/05/USATODAY/USATODAY/636534658976824985-147719-5105.jpg?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Justin Kirkland"], "canonical_link": "https://www.usatoday.com/story/life/entertainthis/2018/02/05/bachelor-recap-kendall-takes-krystal-three-women-leave/309913002/", "title": "'The Bachelor' recap: Kendall takes on Krystal, three women leave", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/entertainthis/2018/02/05/bachelor-recap-kendall-takes-krystal-three-women-leave/309913002/life/entertainthis", "theme-color": "#ffffff", "og": {"type": "article", "title": "'The Bachelor' recap: Kendall takes on Krystal, three women leave", "description": "With the girls heading to Paris, Arie has four dates including the nerve-racking 2-on-1.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/514922ee78c25e2bb90a92cf29ab3e31e5542750/c=0-153-3000-1848/local/-/media/2018/02/05/USATODAY/USATODAY/636534658976824985-147719-5105.jpg?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "With the girls heading to Paris, Arie has four dates including the nerve-racking 2-on-1.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1517788800.0, "source": "https://www.usatoday.com", "summary": ""}