{"url": "https://www.elitedaily.com/p/khloe-kardashians-reported-response-to-tristan-thompson-cheating-reports-is-heartbreaking-8755808", "text": "If you're a big fan of Khloé Kardashian, then the last few days have not exactly been the greatest. On April 10, it was reported that Tristan Thompson cheated on her, at a time when Kardashian was set to give birth any day. And, although Kardashian remained radio silent when the world initially got hold of Thompson's rumored affairs, we're reportedly hearing about her reaction to the whole ordeal. On April 11, E! News reported Khloe Kardashian's response to Tristan Thompson cheating reports, and it is beyond sad.\n\nOn April 10, it came out that Thompson, who was in New York City with his Cleveland Cavaliers teammates for the weekend, was spotted on Saturday, April 7, at a rooftop bar and lounge. According to The Daily Mail, Thompson was seen kissing another woman who wasn't Kardashian. A woman who reportedly filmed Thompson with the mystery woman told The Daily Mail, \"I was there and he was on the table right next to us with a group of friends and some girl who he was obviously making out with all night ... They were holding each other and it was so obvious. They were there when I got there and they were part of a big group of friends.\" Elite Daily reached out to Kardashian and Thompson's teams regarding the report but did not hear back by the time of publication.\n\nFans of the couple were not happy — and for good reason. When all of this came to a head, Kardashian was in Cleveland, getting ready to give birth to their daughter. You know Cleveland? The place that Kardashian moved to from Los Angeles to be with Thompson and prepare for her labor? She even wrote about the relocation on her app, telling her fans why she decided to make the big move. She wrote,\n\nThroughout my pregnancy, I traveled back and forth between L.A. and Cleveland quite a bit, but after a while, it was a little difficult. It was more tiring and my body got swollen, which never used to happen before pregnancy. I obviously love both cities, but I will say I’m happy to be in Cleveland right now.\n\nShe continued,\n\n...I’m with Tristan and I get my home time — cooking, being with my love, and just more of a routine. In L.A., I’m SWAMPED with work. But then again, I love being in L.A. because I get to see my sisters and my mom, and I have my trainer and the people that I’ve grown up with. So there are perks to both cities for me!\n\nBut now, Kardashian has finally weighed in on the matter and responded to the report of Thompson's alleged affairs.\n\nE! News reports from a source that Kardashian is \"distraught\" over the reports. The source continued,\n\nHer entire world has been turned upside down. She cried hysterically all night. She begged to come back to L.A. and tried to find any way to make it work but her doctor wouldn't let her. She just wants to be with her family and leave as soon as possible. Kris is there and completely supporting her.\n\nThe source also said,\n\nShe will obviously never be able to trust Tristan again or look at him the same way ... Her world is shattered. She is in complete disbelief that this is happening. The family absolutely believes it's in Khloe's best interest to end the relationship but will support her either way.\n\nElite Daily reached out to Kardashian's team for comment on the report but did not hear back by the time of publication.\n\nHonestly, this is heartbreaking. It can't be easy to have all of this negative attention surrounding you, especially while pregnant. The source also said, \"Everyone is in crisis mode and is trying to be very calm for Khloe ... They are really worried for her. They are worried about the health of the baby and thinks she will go into labor any second.\"\n\nIt breaks my heart that Kardashian seemed so over-the-moon with Thompson, only to have something like this surface about the man she loves.\n\nBeyond sad.\n\nTo add salt in the wound, TMZ claims to have obtained surveillance footage of Thompson reportedly hanging out with three women at a hookah lounge back in October of 2017, which appears to show Thompson kissing one woman, and provocatively touching another's chest — all of this allegedly happening while Kardashian was three months pregnant with Thompson's child.\n\nSending good thoughts over to Kardashian right now. No matter what happens moving forward, I hope she chooses to do what's best for her and her daughter. Luckily, she has a tight-knit family who will undoubtedly be there for her, regardless of her choice.", "images": ["https://imgix.bustle.com/uploads/image/2018/4/11/81f42b6b-d626-4bc3-9836-db9b4641b381-khloetristan.jpg?w=374&h=210&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2022/10/5/626b0371-b086-434e-af7a-2ed5d0303cd8-getty-1395066425.jpg?w=138&h=138&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.484&fp-y=0.373", "https://imgix.bustle.com/uploads/image/2022/9/29/1f208ab0-8329-4ceb-b9b8-b7fbeb585cd8-untitled-design.png?w=138&h=138&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.512&fp-y=0.2433", "https://imgix.bustle.com/uploads/image/2018/4/11/81f42b6b-d626-4bc3-9836-db9b4641b381-khloetristan.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2022/10/8/4e8798bb-b99d-4ec4-af4a-8b62d04a4927-getty-1395076942.jpg?w=138&h=138&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.5&fp-y=0.3412", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1"], "top_img": "https://imgix.bustle.com/uploads/image/2018/4/11/81f42b6b-d626-4bc3-9836-db9b4641b381-khloetristan.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/khloe-kardashians-reported-response-to-tristan-thompson-cheating-reports-is-heartbreaking-8755808", "title": "Khloé K's Reported Reaction To Tristan Thompson's Cheating Allegations Is Heartbreaking", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image", "creator": "@KarenRuffini"}, "article": {"publisher": "https://www.facebook.com/EliteDaily"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/khloe-kardashians-reported-response-to-tristan-thompson-cheating-reports-is-heartbreaking-8755808", "type": "article", "title": "Khloé K's Reported Reaction To Tristan Thompson's Cheating Allegations Is Heartbreaking", "description": "If you're a big fan of Khloé Kardashian, then the last few days have not exactly been the greatest. On April 10, it was reported that Tristan Thompson cheated on her, at a time when Kardashian was set to give birth any day. And, although Kardashian…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/4/11/81f42b6b-d626-4bc3-9836-db9b4641b381-khloetristan.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "If you're a big fan of Khloé Kardashian, then the last few days have not exactly been the greatest. On April 10, it was reported that Tristan Thompson cheated on her, at a time when Kardashian was set to give birth any day. And, although Kardashian…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}