{"url": "https://www.hollywoodreporter.com/live-feed/failure-is-mandatory-dave-annable-shares-pain-being-recast-cbs-code-1113887", "text": "In yet the latest example of the highs and lows in the television industry, actor Dave Annable shared the roller-coaster adventure that came with finding out his pilot, CBS’ The Code, was being picked up to series — only without him attached.\n\n“To only see this as my loss is limiting and self-centered. It’s so much bigger than me,” Annable wrote in a lengthy Instagram post in which he addressed being fired from the series. “After receiving the call that the show was being picked up and I was being replaced (while I was at Disneyland with my family, ugh) I went to the perspective of the student. What is the lesson here?”\n\nThe actor, whose credits have included Brothers & Sisters and Paramount Network’s upcoming Kevin Costner show Yellowstone, went on to get philosophical about the experience while acknowledging he refused to get angry about the experience.\n\n“I’ve never been fired before and certainly not publicly.… Learning to deal with failure is one of the most important lessons you’ll deal with in your life. Guess what? Failure is mandatory. It’s growth. It’ll never stop. It’s where all the good shit happens that makes you a better person when you are open to seeing the right perspective.”\n\nThe Code explores the military’s brightest minds as they take on the country’s toughest challenges — inside the courtroom and out — where each attorney is trained as a prosecutor, a defense lawyer, an investigator and a Marine. Annable was poised to be the male lead, Capt. John “Sid” Sidney, a driven prosecutor and active-duty Marine. Annable and Mira Sorvino, who played Col. Eisa Turnbull, a high-ranking officer with children serving overseas, were both let go from The Code when CBS picked it up to series.\n\nRecastings have become increasingly common in the Peak TV era. Broadcast networks not only compete with one another to cast the 70-odd comedies and dramas in the same three-month window, but also with cable, premium and streaming services as part of an arms race for talent both in front of the camera and behind the scenes.\n\n“I have a wife and daughter that I have an opportunity to lead by example on how to deal with obstacles and adversity when life throws you a jab that lands right on your face,” Annable continued in the comments section of his post. “I took one on the chin yesterday but this morning I’m gonna stand tall and hold my head up high because that is what I’m CHOOSING to do. I’m not gonna tell my family what to do, I’m gonna show them. On to the next. Watch my friends crush it on The Code on CBS. Thank you.”\n\nAnnable’s post (read it in full below) is reminiscent of a November 2012 blog post from You’re the Worst creator Stephen Falk in which he bared his soul over NBC’s decision to cancel Dane Cook series Next Caller Please before it premiered — and after it was picked up to series and the showrunner moved to New York to launch the comedy.\n\n“You will talk them [the cast] through the tears and confusion — attempt to ameliorate the soon-to-be full-blown PTSD taking root already in them, all the while pre-knowing yours will go untreated and indeed sneak up on you weeks later…. Everything has stopped. This is the moment after the 10.0 earthquake. Suddenly, nothing is the same,” he wrote of the experience.\n\nThe Code cast includes Anna Wood and Phillipa Soo. From CBS Television Studios, Craig Sweeny and Craig Turk penned the story and Carl Beverly and Sarah Timberman — who recently exited the studio for a deal at Lionsgate TV — exec produce the drama, which will premiere midseason.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/05/gettyimages-906978706.jpg?w=1293&h=733&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/gettyimages-906978706.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/gettyimages-906978706.jpg?w=1024", "keywords": [], "authors": ["Lesley Goldberg"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/failure-is-mandatory-dave-annable-shares-pain-being-recast-cbs-code-1113887/", "title": "“Failure Is Mandatory”: Dave Annable Shares Pain of Being Recast on CBS’ ‘The Code’", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The actor learned of his series pickup — and firing — while he was at Disneyland.", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Lesley Goldberg", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1113887, "title": "\"Failure Is Mandatory\": Dave Annable Shares Pain of Being Recast on CBS' 'The Code'", "published_at": "2018-05-21 21:09:35", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/gettyimages-906978706.jpg?w=1024", "comment_count": 0, "topics": "TV News", "body": "In yet the latest example of the highs and lows in the television industry, actor Dave Annable shared the roller-coaster adventure that came with finding out his pilot, CBS' The Code, was being picked up to series — only without him attached. \r\n\"To only see this as my loss is limiting and self-centered. It’s so much bigger than me,\" Annable wrote in a lengthy Instagram post in which he addressed being fired from the series. \"After receiving the call that the show was being picked up and I was being replaced (while I was at Disneyland with my family, ugh) I went to the perspective of the student. What is the lesson here?\"\r\n\t\r\n\tThe actor, whose credits have included Brothers & Sisters and Paramount Network's upcoming Kevin Costner show Yellowstone, went on to get philosophical about the experience while acknowledging he refused to get angry about the experience.\r\n\"I’ve never been fired before and certainly not publicly.… Learning to deal with failure is one of the most important lessons you’ll deal with in your life. Guess what? Failure is mandatory. It’s growth. It’ll never stop. It’s where all the good shit happens that makes you a better person when you are open to seeing the right perspective.\"\r\nThe Code explores the military's brightest minds as they take on the country's toughest challenges — inside the courtroom and out — where each attorney is trained as a prosecutor, a defense lawyer, an investigator and a Marine. Annable was poised to be the male lead, Capt. John “Sid” Sidney, a driven prosecutor and active-duty Marine. Annable and Mira Sorvino, who played Col. Eisa Turnbull, a high-ranking officer with children serving overseas, were both let go from The Code when CBS picked it up to series.\r\n\r\nRecastings have become increasingly common in the Peak TV era. Broadcast networks not only compete with one another to cast the 70-odd comedies and dramas in the same three-month window, but also with cable, premium and streaming services as part of an arms race for talent both in front of the camera and behind the scenes.\r\n\"I have a wife and daughter that I have an opportunity to lead by example on how to deal with obstacles and adversity when life throws you a jab that lands right on your face,\" Annable continued in the comments section of his post. \"I took one on the chin yesterday but this morning I’m gonna stand tall and hold my head up high because that is what I’m CHOOSING to do. I’m not gonna tell my family what to do, I’m gonna show them. On to the next. Watch my friends crush it on The Code on CBS. Thank you.\"\r\nAnnable's post (read it in full below) is reminiscent of a November 2012 blog post from You're the Worst creator Stephen Falk in which he bared his soul over NBC's decision to cancel Dane Cook series Next Caller Please before it premiered — and after it was picked up to series and the showrunner moved to New York to launch the comedy.\r\n\"You will talk them [the cast] through the tears and confusion — attempt to ameliorate the soon-to-be full-blown PTSD taking root already in them, all the while pre-knowing yours will go untreated and indeed sneak up on you weeks later.... Everything has stopped. This is the moment after the 10.0 earthquake. Suddenly, nothing is the same,\" he wrote of the experience.\r\n\r\nThe Code cast includes Anna Wood and Phillipa Soo. From CBS Television Studios, Craig Sweeny and Craig Turk penned the story and Carl Beverly and Sarah Timberman — who recently exited the studio for a deal at Lionsgate TV — exec produce the drama, which will premiere midseason.\r\n\r\n\t\r\n\t\t\r\n\t\t\t\r\n\t\t\t\t \r\n\t\t\r\n\t\tYou may be wondering why the hell is this guy posting this when he was just fired from the show? Great question. There are multiple reasons. The first is that I fucking LOVED the people I worked with and for and wish them NOTHING but success and love on the this great show. To only see this as my loss is limiting and self centered. It’s so much bigger than me. How about all of the other writers, producers, crew and fellow actors that worked so hard and gave everything they had to make this show work? This isn’t just my story. All of my friends and family who have reached out have said “F them! You’ll show them!”. I understand this way of thinking but let me pose a question. How does it serve me to be angry? It would not and does not CHANGE the situation. Me being angry at someone or something would not ultimately make me feel any better. It actually would make me feel much worse. If I chose to be angry that emotion spills over into my relationship with myself, my family and my friends. If I choose anger then I’m taking on the perspective of a victim. I’m not a victim. This is a circumstance. It is my choice and my choice only on how I choose to deal with it. After receiving the call that the show was being picked up and I was being replaced (while I was at Disneyland with my family, ugh) I went to the perspective of the student. What is the lesson here? What can I learn from this experience moving forward? I’ve yet to be given a reason but when I do you bet your ass that I will try and learn from it. Another reason I am posting this is fear. Fear of embarrassment. Fear of Failure. I’ve never been fired before and certainly not publicly. Right now I want to run. I want to hide. I want to quit. The TOUGHER thing to do is face it. To embrace it. Learning to deal with failure is one of the most important lessons you’ll deal with in your life. Guess what? Failure is mandatory. It’s growth. It’ll never stop. It’s where all the good shit happens that makes you a better person when you are open to seeing the right perspective. (Continued in comments section)...\r\n\t\tA post shared by  Dave Annable (@dave_annable) on May 12, 2018 at 8:10am PDT", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "“Failure Is Mandatory”: Dave Annable Shares Pain of Being Recast on CBS’ ‘The Code’", "url": "https://www.hollywoodreporter.com/tv/tv-news/failure-is-mandatory-dave-annable-shares-pain-being-recast-cbs-code-1113887/", "description": "The actor learned of his series pickup — and firing — while he was at Disneyland.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/gettyimages-906978706.jpg?w=1024", "width": 1024, "height": 581}, "locale": "en_US"}, "article": {"published_time": "2018-05-21T21:09:35+00:00", "modified_time": "2018-05-22T11:04:26+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "“Failure Is Mandatory”: Dave Annable Shares Pain of Being Recast on CBS’ ‘The Code’", "description": "The actor learned of his series pickup — and firing — while he was at Disneyland.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/05/gettyimages-906978706.jpg?w=1293"}}, "movies": [], "publish_date": 1526936975.0, "source": "https://www.hollywoodreporter.com", "summary": ""}