{"url": "https://www.celebritynetworth.com/richest-celebrities/bobby-zarin-net-worth/", "text": "What was Bobby Zarin's Net Worth?\n\nBobby Zarin was an American real estate entrepreneur, fabric businessman, and reality TV star who had a net worth of $35 million at the time of his death in 2018. Born Robert Zarin on February 15, 1946, in New York City, Bobby acquired his wealth as the co-founder of Zarin Fabrics and Home Furnishings, New York's biggest discounted designer fabrics warehouse, and he owned a valuable real estate portfolio, including commercial centers and apartment buildings throughout the country. Zarin was the husband of real estate agent Jill Zarin, who joined the cast of the Bravo reality series \"The Real Housewives of New York City\" in 2008.\n\nZarin Fabrics\n\n\n\nZarin's father, Harry, opened Zarin Fabrics in 1936, and Bobby eventually took over; before he began running the store, Zarin was a special education teacher. Zarin Fabrics is frequently used to provide materials for television production sets, including \"Gossip Girl,\" \"Lipstick Jungle,\" \"Sex and the City,\" \"What's Your Sign Design?,\" \"Cashmere Mafia,\" and \"Saturday Night Live.\"\n\nAfter Bobby married Jill, they ran the store together, and after she began starring on \"The Real Housewives of New York City,\" Zarin often appeared on the show as well. Jill was a main cast member from 2008 to 2011 (when she was fired from the show), and Bobby appeared in 35 episodes of the series. In 2014, the couple appeared on \"Celebrity Wife Swap,\" with Jill switching lives with actress Jenna von Oÿ of \"Blossom\" fame.\n\nPersonal Life\n\nBobby married Jill Kamen on January 4, 2000, and he was stepfather to her daughter, Allyson Shapiro. Zarin was previously married to a woman named Eileen, and they had three children, Jonathan, David, and Jennifer. Both Jonathan and Allyson suffer from arthritis, and Jill founded the charitable organization Creaky Joints in 2009.\n\nBobby was diagnosed with thyroid cancer in 2009 and underwent thyroid gland removal and radioactive iodine treatment, but in 2013, he discovered that the cancer had returned and spread to his lungs. In 2016, Zarin was diagnosed with a brain tumor, and he underwent Gamma Knife Radiosurgery at Houston's MD Anderson Cancer Center. Sadly, Bobby passed away from thyroid cancer on January 13, 2018; he was 71 years old. Zarin's family slept in his hospital room with him the day before his death, and his funeral was held at Riverside Memorial Chapel in New York City. At the funeral service, Jill spoke about how she began knitting a blanket for Bobby when he was hospitalized in July 2017 and finally finished it three days before he passed, stating, \"He spent the last days of his life snuggled up in it. The irony is when I draped it over the casket, it fit perfectly. Bobby knew.\"\n\nReal Estate\n\nAt the time of Bobby's death, the Zarins were living in a 2,000 square foot Upper East Side apartment that they'd owned for 18 years. Jill put the three-bedroom home on the market in October 2018, and it sold for $3.25 million in June 2019. The couple also owned a 7,300 square foot home in Sag Harbor, which they sold for $2.85 million in 2007, and an estate in Southampton they referred to as Camp Zarin. In May 2018, Jill listed the home on the rental market, asking $260,000 for the entire summer or $110,000 for July/$125,000 for August to Labor Day.", "images": ["https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://vz.cnwimg.com/wp-content/uploads/2010/07/GettyImages-480458848.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/thumb-900x/wp-content/uploads/2010/07/Bobby-Zarin.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2010/07/GettyImages-480458848.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/bobby-zarin-net-worth/", "title": "Bobby Zarin Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Bobby Zarin Net Worth and wealth: Bobby Zarin was an American real estate entrepreneur, fabric businessman, and reality TV star who had a net worth of", "cnw_share_fb_count": 75, "cnw_share_tw_count": 63, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Bobby Zarin Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/bobby-zarin-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/07/GettyImages-480458848.jpg", "site_name": "Celebrity Net Worth", "description": "Bobby Zarin Net Worth and wealth: Bobby Zarin was an American real estate entrepreneur, fabric businessman, and reality TV star who had a net worth of"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2022-07-15T18:52:57+00:00", "published_time": "2021-01-05T02:14:30+00:00", "section": "Richest Celebrities", "tag": "real housewives net worth"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/07/GettyImages-480458848.jpg", "title": "Bobby Zarin Net Worth", "description": "Bobby Zarin Net Worth and wealth: Bobby Zarin was an American real estate entrepreneur, fabric businessman, and reality TV star who had a net worth of"}}, "movies": [], "publish_date": 1609812870.0, "source": "https://www.celebritynetworth.com", "summary": ""}