{"url": "https://en.wikipedia.org/wiki/Jackson_family", "text": "American family of entertainers\n\nThe Jackson family is an American family of musicians and entertainers from Gary, Indiana. Six children of Joseph Walter (or Joe) and Katherine Esther Jackson form the members of Motown boy band the Jackson 5 (later known as the Jacksons). Joe worked as their manager. The Jackson family, both as a musical group and as solo artists, have achieved success in the field of popular music from the late 1960s and onward. They are sometimes called the \"First Family of Soul\" (a title first bestowed on the Five Stairsteps),[1][2] the \"Imperial Family of Pop\", or the \"Royal Family of Pop\", especially following the success of Michael and Janet Jackson,[3] the former of whom is frequently dubbed the \"King of Pop\".\n\nThe Jackson 5 originally consisted of Jackie, Tito, Jermaine, Marlon, and Michael. In 1975, Randy replaced Jermaine. Regarded as the most popular members of the family are Michael and Janet, both of whom have had highly distinguished solo careers and are often hailed as two of the most influential pop and R&B artists in history.[4][5] All nine of the Jackson siblings have gold records to their credits with La Toya holding the distinction of being the first Jackson sister to attain one (awarded by the Syndicat National de l'Édition Phonographique for \"Reggae Night\", which she co-wrote for Jimmy Cliff). Janet is the first black female to receive the Billboard Icon Award.\n\nThe Jacksons are one of the most influential families in music history.[4][6][7][8] In 1997, the Jackson 5 was inducted to the Rock and Roll Hall of Fame.[9] Michael was inducted as a solo artist in 2001, making him one of the few who have been inducted twice.[10] Joining her brothers, Janet was inducted in 2019.[5] Michael, Janet, and the Jacksons were awarded stars on the Hollywood Walk of Fame in 1984, 1990, and 1980, respectively. In 2009, a television series entitled The Jacksons: A Family Dynasty premiered on A&E, documenting the Jackson brothers dealing with the sudden loss of Michael and preparing for a Jackson 5 reunion tour.[11]\n\nFirst generation [ edit ]\n\nThe Jacksons. Front, from left: Janet, Randy, La Toya, Rebbie. Back, from left: Jackie, Michael, Tito, Marlon. Note: Due to contractual issues, Jermaine was not part of the television program and is not pictured. The Jackson siblings from their television program. Front, from left: Janet, Randy, La Toya, Rebbie. Back, from left: Jackie, Michael, Tito, Marlon.\n\nJoseph Walter Jackson was born on July 26, 1928, in Arkansas, but he grew up in Oakland, California, with his father Samuel Jackson, a school teacher. At age 18, he moved to East Chicago, Indiana, to be with his mother Crystal Lee King and to pursue his dreams of becoming a professional boxer. At age 21, Joseph married Katherine Scruse, 19, immediately starting a family. Even though he wanted to be a success in boxing it was not a job for a family man, so he obtained a job as an overhead crane operator with East Chicago's Inland Steel Company. His family continued to grow steadily and over the course of sixteen years he and Katherine had a house full of nine children. Joe Jackson always wanted to make it big and although he could not in boxing or in his own short musical stint in the 1950s with the band the Falcons, he saw the talent in his children, starting with Tito and his ability to play the guitar.[12]\n\nSoon enough Joe Jackson formed a band of his sons Tito, Jermaine and Jackie called The Jackson Brothers in 1964 and became their manager. After several years of doing local talent shows, Joseph enlarged the band to include Marlon and Michael, two of his younger sons, and then changed the name of the band to The Jackson Five by 1966, remaining the group's manager. As their father he was a very strict disciplinarian[13] and as their manager he enforced long practice sessions of singing and dancing in hopes of preparing them to make it big one day. In August 1967, the group made a debut at the Apollo Theater in Harlem, New York, where they won the Amateur Night contest. Gordon Keith, the owner and producer at Steeltown Records in Gary, Indiana, discovered the Jackson Five and signed them to their first contract in November 1967. \"Big Boy\", the boys' first record which was produced by Keith, was released on January 30, 1968. It became a local hit. In March 1969, they signed a Motown record contract and became known as the Jackson 5. The group enjoyed the fame Joseph Jackson had been longing for in his life. He continued to manage The Jackson 5 into stardom and after the band had many No. 1 hits on the Billboard hot singles charts; Joseph moved them to a mansion in Encino, California, with his own hefty salary he had obtained as their full-time manager. After many years as a band and with Michael as lead singer, the group continued to churn out even more hits and wealth, but tensions grew and in 1979, Michael severed ties with his father/manager and went on to pursue an international solo musical entertainment career. Four years later, in 1983, Michael's siblings fired Joseph Jackson as their manager. In 1993, Michael Jackson accused his father of physical and mental abuse; a few of the other siblings confirmed this claim, but others denied it.[12]\n\nKatherine Jackson (née Kattie B. Scruse) was born on May 4, 1930, in Barbour County, Alabama, the child of Prince Albert Scruse (1907–1997) and Martha Mattie Upshaw (1907–1990). She was left with a permanent limp after acquiring polio syndrome in her childhood. She later recovered from her illness after moving with her family to East Chicago, Indiana, where she would remain until meeting her husband Joseph Jackson. The couple moved and bought a small home in Gary, Indiana, where they birthed and raised nine children and she was a stay-at-home mother.[14] Throughout her life, Katherine remained a devoted Jehovah's Witness and raised her children strictly under the same spiritual teachings she received. Also, as a talented pianist and vocalist who shared her talents with her children, she was later credited for being the foundation of her children's success. After her sons' rise to fame as The Jackson 5, she strongly supported her children and became the costume designer for their shows and performances. Some of the memorable moments of her unconditional support were seen when her son Michael was tried for molestation charges in 1993 and 2005. Katherine now lives in Calabasas, California where she cares for the children of her late son, Michael.[14] After allegations that she may have been held against her will by Randy and Janet Jackson, Katherine lost custody of Michael's children, ultimately regaining it in 2012.[15][16]\n\nSecond generation [ edit ]\n\nTogether, Joe and Katherine Jackson had ten children. Their son Brandon (Marlon's twin) died shortly after birth. The other nine grew up to become professional musicians, among other professions.[17]\n\nThird generation [ edit ]\n\nThere are twenty-seven children who make up the third generation of the Jackson family along with several great-grandchildren. Among them, some have followed in the family's footsteps into the entertainment industry.[20] The three children of Michael Jackson are probably the most well-known of the third generation.[21] Michael Joseph Jackson Jr. (b. February 13, 1997), also known as \"Prince\", Paris-Michael Katherine Jackson (b. April 3, 1998) and Prince Michael Jackson, also known as \"Blanket\", and now called \"Bigi\" (b. February 21, 2002), have been discussed in the press numerous times throughout their lives, particularly since their father's death in 2009.[22]\n\nRebbie, Tito, Jackie and Jermaine have also had children, who have come under varying degrees of media focus. Austin Brown (b. November 22, 1985), the only son of Rebbie Jackson, is a singer-songwriter who has released several successful singles in the pop/R&B genre.[23] Tito Jackson's three sons, Tariano Adaryll \"Taj\" Jackson (b. August 4, 1973), Taryll Adren Jackson (b. August 8, 1975) and Tito Joe Jackson (b. July 16, 1978) make up the R&B/pop music group 3T.[24] 3T has released three studio albums and has gone on to have moderate success in the industry, primarily outside of the United States.[25] Sigmund Esco \"Siggy\" Jackson (b. June 29, 1977), the eldest son to Jackie Jackson, is a hip-hop artist who goes under the name \"Dealz\". Siggy has been a ghostwriter for a number of independent artists and has obtained mild success as a solo artist.[citation needed] Jermaine La Jaune \"Jay\" Jackson, Jr. (b. January 27, 1977), the eldest son to Jermaine Jackson, portrayed his father in the 1992 miniseries, The Jacksons: An American Dream, a biographical film about the Jackson family. On January 3, 2017, at age 50, Janet gave birth to Eissa Al Mana, the newest member of the Jackson family.[26]\n\nGina Freeman July \"Jack\" Gale Gertrude Daniel Samuel King Emeline Williams Israel Nero Martha Upshaw Prince Albert Screws Crystal Lee King Samuel Joseph James Jane Katherine Scruse Joseph Walter Verna Mae Lula Mae Lawrence Luther Maureen Reillette \"Rebbie\" Sigmund Esco \"Jackie\" Toriano Adaryll \"Tito\" Jermaine La Jaune LaToya Yvonne Marlon David Brandon Michael Joseph Steven Randall \"Randy\" Janet Damita Jo Austin Brown Sigmund Esco \"Siggy\" Toriano Adaryll \"Taj\" Jermaine La Jaune \"Jay\" Valencia Michael Joseph ″Prince″ Genevieve Katherine Eissa Al Mana Jared Esco Taylor Aurora Sco Noah\n\nReferences [ edit ]\n\nFurther reading [ edit ]\n\nGiambusso, David (June 25, 2009). \"Michael Jackson memorabilia owner recalls turbulent past with musical family\". The Star-Ledger. New Jersey.\n\nMedia related to Jackson family at Wikimedia Commons\n\n·", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Janet_Jackson_1998.jpg/165px-Janet_Jackson_1998.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/12px-Commons-logo.svg.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Joseph_Jackson_Cannes_2014.jpg/185px-Joseph_Jackson_Cannes_2014.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/Jackson_siblings_1977.jpg/285px-Jackson_siblings_1977.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Michael_Jackson_%281988%29.jpg/140px-Michael_Jackson_%281988%29.jpg"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jackson_family", "title": "Jackson family", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "viewport": "width=1000", "og": {"title": "Jackson family - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}