{"url": "https://www.tvinsider.com/669435/celebrity-big-brother-us-ross-mathews-interview/", "text": "Though much shorter than the original series, the US version of Celebrity Big Brother certainly made the most of its first run with big personalities like Omarosa Manigault, Brandi Glanville, and, of course, Ross Mathews.\n\nThe E! correspondent and former Tonight Show with Jay Leno contributor made quite the impression during the show. In fact, he made a big enough impression to win America’s Favorite Houseguest, and the cash award of $25,000.\n\nThough he didn’t take home top honors, Mathews was thrilled to find out he wasn’t “the villain” of the season. And anyone who watched could tell that he’s is a superfan of the long-running CBS show—he was even in the audience during its first season!\n\nThis season has certainly changed what most viewers know about Big Brother by not sequestering the jury and shortening the play time, so TV Insider was curious what the houseguest thought about it all. Read on to see what Mathews had to say about the once in a lifetime opportunity, his fellow houseguests, and if he’d consider playing again.\n\nSee Also 7 Reality Shows That Produced Celebrity Editions CBS' upcoming 'Celebrity Big Brother' is the latest in a trend of shows pitting stars in head-to-head reality competitions.\n\nHow did this compare to your other TV experiences?\n\nEvery single thing set it apart from anything I’ve ever done in my entire life. It was so discombobulating to be cut off from the outside world, it felt like being dizzy. And then you’re in a house with a bunch of people you don’t know and you can’t trust any of them. It was so unsettling, the entire experience, and the worst part is, it started to feel normal. That was weird.\n\nWhat was the casting process like prior to entering the house? Did it take long? Were there limitations to social media?\n\nThere were discussions earlier on, and then we found out a couple of weeks before that it was official. They didn’t put any restrictions—of course, they said ‘don’t tell anybody,’ but it gave me some time to get my social game in place so that there could be a conversation going on while I was in the house.\n\nThey took us away three days before we went into the house to be sequestered, and it was the Sunday of the Grammys when they made the cast announcement. They didn’t want us to see who else was in the cast. I was cut off from the outside world, no TV, no music, no anything.\n\nYou won two HOH and three Veto competitions. Do you think any of the houseguests underestimated you?\n\nYes, I love that they underestimated me. I knew they would, so I was playing to win in the fourth quarter. I wanted to just sort of stay under the radar as much as I could for as long as I could. Make enough moves to be noticed but never to be a threat. That was my plan, and once it was time to start winning competitions and saving my ass, that’s exactly what I did.\n\nI didn’t want to play to the jury, I wanted to play the Big Brother game that I, for 19 seasons, have said I would play if I ever had the chance. If the jurors wanted to vote on their personal feelings about it, then they’re not true Big Brother superfans.\n\nYour face when Omarosa walked in was priceless. What were you thinking in that moment? Did your opinion of her change over the course of the game?\n\nI thought, ‘Oh, holy good God no.’ That was really what went through my head, like ‘Oh my god, no.’ Because I didn’t want to be in a house full of toxicity, you know? I just don’t play that game very well. And then I quickly understood who Omarosa is and I became fascinated by it. She is able to turn it on and turn it off.\n\nWe were really good at sparring and going back and forth to each other, and as soon as it was over, she would say, ‘That was great TV. Good job.’ It was like, ‘Oh my god, this is what she does.’ And so it just became fascinating to me and I had her number from the get-go and she knew it. So she was trying to get me out and I wanted to get her out first, which I totally did.\n\nMany have said Shannon was the strongest player this season, but your social game was on point. How do you think that worked to your advantage?\n\nWell, you have to have a social game to win Big Brother. Shannon, I think, is the best player in Big Brother history. But the problem is, she told us all way too soon that she was the best player in Big Brother history. Responsibilities? Sixteen-letter words–didn’t need to do that, OK? So, could she have won the whole thing? Absolutely.\n\nAnd it is a huge compliment that we had to get her out right away, because in Big Brother, there are two types of people: people that you can’t beat in the end and people coming after you. Shannon eventually would have been both of those things for me. I don’t know why she’s taking it so personally—for a superfan of the show, she should get it. I honestly thought she would say to me, ‘Great job, great move’… I’m shocked she didn’t do that. She’s still upset about it, and, you know, sorry.\n\nWhat does slop really taste like?\n\nIt’s awful. It’s like a negative flavor. It’s like less than no flavor. But I cooked with it every day and people ate everything I made.\n\nYou and Marissa became really close, and it seems like everyone became friendly. Do you think those relationships will last outside of the house?\n\n[Sunday] night we left the house. [The next day] at 3 p.m., I’m going to Marissa’s house. Omarosa’s coming [Laughs], Brandi’s coming, Ari’s coming, and everyone else is invited. So it’s the truth, we just kind of love each other. We went at it, we were honest with each other, and we went there, but there is great camaraderie between all of us. We feel like people who have been through something together that no one else will ever understand. There’s a bond that we will have forever—even Omarosa and I. Yes it was authentic. I mean, Mark and I… I know we’ll be friends forever now [also].\n\nHave you had a chance to watch any of the episodes from the show? If not, will you?\n\nI haven’t seen anything yet and I don’t know that I will. I lived it, so anything that they put together, I know will be entertaining and cut together funny. I know what happened in that house, I saw it with my own eyes, I know my experience. I might just want to hold onto that.\n\nThere may be clips I want to watch, I’d love to see me win those power of vetos because I was so proud of myself, I really earned them. When I was on the block and when I wanted to get Omarosa out, I won every single time, and so I’d love to see those.\n\nIf asked, would you ever consider going back into the Big Brother house to compete?\n\nWhen I first walked out of the house, I said ‘There’s no way I’m going back in that house.’ But, if they asked me, I’d think about it. I don’t know if I could ever play a better game than I played this season, but you never know.\n\nWhat is one thing viewers don’t know about the Big Brother house that you think they should?\n\nIt’s filthy. Not when you first walk in. But by day two, it is disgusting and there’s not a damn thing you can do about it. It’s the recycled air-conditioned air, there are multiple people who are kind of spoiled and sloppy living in it. It just gets a thick filth—thick and disgusting. I would sweep all the time, we tried to wipe it down, but there’s nothing you can do. It was disgusting.\n\nHow did you feel after finding out that you were voted America’s Favorite Houseguest?\n\nWinning America’s Favorite Houseguest meant more to me than winning the game ever could, because the jury was filled with a bunch of celebrities who had seen everything that went down. So I knew I probably couldn’t win their votes. But the fans saw what I was doing in the house, they knew the kind of game I was playing. I was playing the game a true fan of Big Brother would play if they ever got to go into the house. The fact that they recognized that meant the world to me.", "images": ["https://www.tvinsider.com/wp-content/uploads/2020/03/tvi-white.png", "https://www.tvinsider.com/wp-content/themes/tv/images/logo-channel-guide.png", "https://images.justwatch.com/icon/246478651/s100/image.png", "https://www.tvinsider.com/wp-content/uploads/2022/07/britbox.png", "https://www.tvinsider.com/wp-content/uploads/2022/07/showtime.png", "https://images.justwatch.com/icon/920372/s100/image.png", "https://www.tvinsider.com/wp-content/uploads/2022/07/fox.png", "https://www.tvinsider.com/wp-content/uploads/2022/09/blue-bloods-2-450x289.jpg", "https://www.tvinsider.com/wp-content/uploads/2022/07/peacock.png", "https://www.tvinsider.com/wp-content/themes/tv/images/logo-tv-guide.png", "https://ntvb.tmsimg.com/assets/p15017381_b_h8_ab.jpg?w=240&h=135", "https://www.tvinsider.com/wp-content/uploads/2022/07/amc.png", "https://images.justwatch.com/icon/249324969/s100/image.png", "https://www.tvinsider.com/wp-content/uploads/2022/07/hallmark.png", "https://images.justwatch.com/icon/169478387/s100/image.png", "https://www.tvinsider.com/wp-content/uploads/2022/07/apple-tv-plus.png", "https://www.tvinsider.com/wp-content/uploads/2022/07/pbs.png", "https://www.tvinsider.com/wp-content/uploads/2018/02/ross-cbb-21-1014x570.jpg", "https://www.tvinsider.com/wp-content/uploads/2020/05/starz.png", "https://www.tvinsider.com/wp-content/uploads/2022/07/cbs.png", "https://www.tvinsider.com/wp-content/themes/tv/images/logo-tv-weekly.png", "https://www.tvinsider.com/wp-content/uploads/2022/07/abc.png", "https://www.tvinsider.com/wp-content/uploads/2022/07/acorn.png", "https://www.tvinsider.com/wp-content/uploads/2018/02/ross-cbb-1-380x570.jpg", "https://www.tvinsider.com/wp-content/themes/tv/images/hashtag-lighten.png", "https://images.justwatch.com/icon/252888457/s100/image.png", "https://www.tvinsider.com/wp-content/themes/tv/images/logo-remind.png", "https://www.tvinsider.com/wp-content/uploads/2022/07/discovery-plus.png", "https://www.tvinsider.com/wp-content/uploads/2022/07/netflix.png", "https://pixel.quantserve.com/pixel/p-sRxQ0qKU4hQu4.gif", "https://www.tvinsider.com/wp-content/uploads/2022/07/cw.png", "https://widget.justwatch.com/assets/JW_logo_black_10px.svg", "https://www.tvinsider.com/wp-content/themes/tv/images/logo-on-dish.png", "https://www.tvinsider.com/wp-content/themes/tv/images/top-25-shows1.png", "https://www.tvinsider.com/wp-content/uploads/2020/05/fx.png", "https://www.tvinsider.com/wp-content/uploads/2022/07/disney-plus.png", "https://www.tvinsider.com/wp-content/uploads/2022/09/let-the-right-one-in-trailer-showtime-450x289.png", "https://www.tvinsider.com/wp-content/uploads/2022/07/prime-video.png", "https://www.tvinsider.com/wp-content/themes/tv/images/icon-email.svg", "https://www.tvinsider.com/wp-content/uploads/2018/02/ross-cbb-3-854x570.jpg", "https://www.tvinsider.com/wp-content/uploads/2022/07/hbo-max.png", "https://www.tvinsider.com/wp-content/themes/tv/images/icon-facebook.svg", "https://www.tvinsider.com/wp-content/uploads/2022/07/bbc-america.png", "https://www.tvinsider.com/wp-content/uploads/2022/07/hgtv.png", "https://www.tvinsider.com/wp-content/uploads/2018/02/NUP_177384_0275-1000x570.jpg", "https://www.tvinsider.com/wp-content/themes/tv/images/logo-view.png", "https://www.tvinsider.com/wp-content/themes/tv/images/logo-puzzler.png", "https://www.tvinsider.com/wp-content/uploads/2022/07/paramount-plus.png", "https://images.justwatch.com/icon/430993/s100/image.png", "https://www.tvinsider.com/wp-content/themes/tv/images/most-popular-title.png", "https://images.justwatch.com/icon/190848813/s100/image.png", "https://images.justwatch.com/icon/242706661/s100/image.png", "https://www.tvinsider.com/wp-content/themes/tv/images/icon-youtube.svg", "https://www.tvinsider.com/wp-content/uploads/2022/07/hulu.png", "https://www.tvinsider.com/wp-content/uploads/2022/07/nbc.png", "https://www.tvinsider.com/wp-content/themes/tv/images/icon-twitter.svg", "https://www.tvinsider.com/wp-content/uploads/2018/02/julie-chen-omarosa-big-brother-1-234x155.jpg", "https://www.tvinsider.com/wp-content/uploads/2017/09/Celebrity-Apprentice_0108_1-234x155.jpg", "https://www.tvinsider.com/wp-content/themes/tv/images/icon-instagram.svg"], "top_img": "https://www.tvinsider.com/wp-content/uploads/2018/02/ross-cbb-21-1014x570.jpg", "keywords": [], "authors": ["Meaghan Darwish"], "canonical_link": "https://www.tvinsider.com/669435/celebrity-big-brother-us-ross-mathews-interview/", "title": "Celebrity Big Brother’s Ross Mathews Spills on Being America’s Favorite Houseguest", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "google-site-verification": "it2r-MRipevefeCYWkPlW540pNwHDj9JpbST3-LAA-o", "pocket-site-verification": "c2d9d3d73032bf0b0959f31688efb2", "fb": {"pages": 112199118797264, "app_id": 2128917200700396}, "og": {"site_name": "TV Insider", "description": "The TV personality also spills on his relationship with Omarosa and whether he'll return to the house.", "url": "https://www.tvinsider.com/669435/celebrity-big-brother-us-ross-mathews-interview/", "title": "Celebrity Big Brother's Ross Mathews on Being America's Favorite Houseguest", "type": "article", "image": {"identifier": "https://www.tvinsider.com/wp-content/uploads/2018/02/ross-cbb-21-1014x570.jpg", "width": 1014, "height": 570, "alt": "ross-cbb-21"}}, "theme-color": "#00aeef", "robots": "max-image-preview:large", "title": "Celebrity Big Brother's Ross Mathews Spills on Being America's Favorite Houseguest", "description": "The TV personality also spills on his relationship with Omarosa and whether he'll return to the house.", "author": "Meaghan Darwish", "twitter": {"site": "@tvinsider", "url": "https://www.tvinsider.com/669435/celebrity-big-brother-us-ross-mathews-interview/", "title": "Celebrity Big Brother's Ross Mathews on Being America's Favorite Houseguest", "creator": "@tvinsider", "description": "The TV personality also spills on his relationship with Omarosa and whether he'll return to the house.", "image": {"identifier": "https://www.tvinsider.com/wp-content/uploads/2018/02/ross-cbb-21-1014x570.jpg", "alt": "ross-cbb-21"}, "card": "summary_large_image"}}, "movies": [], "publish_date": null, "source": "https://www.tvinsider.com", "summary": ""}