{"url": "https://www.gaiam.com/blogs/discover/15-easy-ways-to-be-healthier", "text": "15 Easy Ways to Be and Live Healthier\n\nAuthor: Guest Contributor\n\nMore and more research is showing that the key to lifelong good health is what experts call “lifestyle medicine” — making simple changes in diet, exercise, and stress management. To help you turn that knowledge into results, we’ve put together this manageable list of healthier lifestyle tips to help inform others how to have a healthy body!\n\nWe asked three experts — a naturopathic physician, a dietitian, and a personal trainer — to tell us the top five simple-but-significant lifestyle-medicine changes they recommend to improve your health and start living a healthier lifestyle.\n\nBesides giving you three different takes on how to pick your health battles, this list gives you choices you can make without being whisked off to a reality-show fat farm — or buying a second freezer for those calorie-controlled, pre-portioned frozen meals. Read on to discover ways to live healthier.\n\nJames Rouse, N.D.\n\nNaturopathic physician, triathlete, chef, author and host of TV’s “Optimum Wellness,” health-tip segments featured on NBC affiliates in several major cities.\n\n1. Think positive and focus on gratitude\n\nResearch shows a healthy positive attitude helps build a healthier immune system and boosts overall health. Your body believes what you think, so focus on the positive. This is a great first tip for how to ensure you have a healthy body and mind in order to live a healthier lifestyle!\n\n2. Eat your vegetables\n\nShoot for five servings of vegetables a day — raw, steamed, or stir-fried. A diet high in vegetables is associated with a reduced risk of developing cancers of the lung, colon, breast, cervix, esophagus, stomach, bladder, pancreas, and ovaries. And many of the most powerful phytonutrients are the ones with the boldest colors — such as broccoli, cabbage, carrots, tomatoes, grapes, and leafy greens.\n\n3. Set a “5-meal ideal”\n\nWhat, when, and how much you eat can keep both your metabolism and your energy levels steadily elevated, so you’ll have more all-day energy. A \"5 meal ideal\" will help you manage your weight, keep your cool, maintain your focus, and avoid cravings which will lead to living a healthier lifestyle.\n\n4. Exercise daily\n\nDid you know that daily exercise can reduce all of the biomarkers of aging? This includes improving eyesight, normalizing blood pressure, improving lean muscle, lowering cholesterol, and improving bone density. If you want to live well and live longer, you must exercise! Studies show that even ten minutes of exercise makes a difference — so do something! Crank the stereo and dance in your living room. Sign up for swing dancing or ballroom dancing lessons. Walk to the park with your kids or a neighbor you’d like to catch up with. Jump rope or play hopscotch. Spin a hula hoop. Play water volleyball. Bike to work. Jump on a trampoline. Go for a hike. These are all great things to do to improve your health.\n\n5. Get a good night's sleep\n\nIf you have trouble sleeping, try relaxation techniques such as meditation and yoga. Or eat a small bedtime snack of foods shown to help shift the body and mind into sleep mode: whole grain cereal with milk, oatmeal, cherries, or chamomile tea. Darken your room more and turn your clock away from you. Write down worries or stressful thoughts to get them out of your head and onto the page. This will help you put them into perspective so you can quit worrying about them.\n\nChristina Reiter, M.S., R.D.\n\nResident consulting dietitian at the University of Colorado–Boulder Wardenburg Health Center for Nutrition Education and Therapies and former director of the nutrition program at Metropolitan State College of Denver.\n\n1. Check your food ’tude\n\nWhat we eat and how we feel are linked in very complex ways. A healthy approach to eating is centered on savoring flavor, eating to satisfaction, and increasing energy, rather than focusing on weight. Our tip to live a healthy life is to check your balance of low-calorie foods, nutrient-dense foods (providing many nutrients per calorie), and foods that are calorie dense but nutrient poor. Most Americans need to eat more fresh whole foods (in contrast to processed, highly refined foods). Try to add more whole grains, fresh fruits and vegetables, and legumes into your meals. Pair these carbohydrate-rich foods with a healthy fat or lean protein to extend satisfaction.\n\n2. Eat like a kid\n\nIf adding more fruits and vegetables sounds ominous, look to “finger food” versions that preschool kids love — carrot and celery sticks, cherry tomatoes, broccoli florets, grapes, berries, and dried fruits. All are nutritional powerhouses packed with antioxidants which will lead to living a healthier lifestyle. Eating like a kid is one of our tips on how to maintain good health.\n\n3. Be a picky eater\n\nLimit saturated fats and trans fats, and aim to eat more foods rich in anti-inflammatory omega-3 fatty acids to cut your risk of cardiovascular disease and maybe even improve your health and depressed moods. The equivalent of just one gram of EPA/DHA (eicosapentaenoic acid/docosahexaenoic acid) daily is recommended. Eating cold-water oily fish (wild salmon, herring, sardines, trout) two to three times per week will provide both EPA and DHA. Adding up to two tablespoons of ground flaxseed and eating meat, milk, and cheese from grass-fed animals will provide you with a healthy dose of omega-3s.\n\n4. Use foods over supplements\n\nSupplements are not a substitute for a good diet. Although many health experts recommend taking a multivitamin and mineral supplement that provides 100 to 200 percent of your recommended daily value, each and every supplement should be carefully evaluated for purity and safety. Specific supplements have been associated with toxicity, reactions with medications, competition with other nutrients, and even increased risk of diseases such as cancer, heart disease, and diabetes.\n\n5. Get satisfaction\n\nBoth eating and physical activity are fun, sensory experiences! In both, aim for pleasure — not pain. Pay attention to the nutritional value of the foods you choose to eat, as well as your sense of satisfaction, relaxation, tension, exhilaration, and fatigue when you sit down to eat. Check in with yourself as you eat, rekindling your recognition of hunger, fullness, and satisfaction when considering when and how much to eat.\n\nRick Olderman, M.S., P.T.\n\nA physical therapist and owner of Z-Line Training in Denver, Colorado, offering rehabilitation, personal training, Pilates instruction, motivational injury-prevention seminars, employee fitness program development, and custom foot orthotics casting.\n\n1. Give yourself a break\n\n“I spend countless hours doing cardio and never seem to lose that last ten pounds!” is a common complaint I hear from clients. Give yourself permission to shorten your workout. Believe it or not, overtraining could be the problem. Your body can plateau if not given adequate rest to restore itself, ultimately leading to a decline in performance. Fatigue, moodiness, lack of enthusiasm, depression, and increased cortisol (the “stress” hormone) are some hallmarks of overtraining syndrome. Creating a periodization program — breaking up your routine into various training modes — can help prevent overtraining by building rest phases into your regimen. For example, you might weight train on Monday and Wednesday, cycle on Tuesday and Thursday, run on Friday and rest on Saturday and Sunday. You can also help balance your program by simply incorporating more variety.\n\n2. Think small\n\nOften the biggest deterrent to improving health is feeling overwhelmed by all the available advice and research. Try to focus first on one small, seemingly inconsequential, unhealthy habit and turn it into a healthy, positive habit. If you’re in the habit of eating as soon as you get home at night, instead, keep walking shoes in the garage or entryway and take a quick spin around the block before going inside. If you have a can of soda at lunchtime every day, have a glass of water two days a week instead. Starting with small, painless changes helps establish the mentality that healthy change is not necessarily painful change. It’s easy to build from here by adding more healthy substitutions.\n\n3. Keep good company\n\nYou can do all the right things — but if you have personal relationships with people who have unhealthy habits, it is often an uphill battle. The healthiest people are those who have relationships with other healthy people. Get your family or friends involved with you when you walk or plan healthier meals. Making healthy changes with a loved one can bring you closer together as well as motivate you.\n\n4. Make a list…and check it twice\n\nTake a few minutes and write down all the reasons you can’t begin an exercise program. Then look at the basis of each reason. For instance, if you wrote, “No time” as one of your reasons, then perhaps that’s based on a belief that an exercise program takes a lot of time. Starting with even five minutes a day will have a positive effect because you will have created a healthy habit where one didn’t exist before, and that’s a powerful mental adjustment. A closer look at your list will expose those false beliefs hiding behind each excuse.\n\n5. Sign up for an event\n\nLet’s face it, exercising just for the sake of exercising or losing weight can get boring. Spice things up by signing up for an event like a run/walk race or a cycling ride where you can be part of a team. Doing so gives your workouts a new purpose, and it’s fun to be around others who are exercising just like you — not to mention that most events benefit nonprofit organizations, which doubles your feel-good high.", "images": ["https://cdn.shopify.com/s/files/1/1728/2157/files/Meditation_-_20190724_350x.jpg?v=1613580178", "https://cdn.shopify.com/s/files/1/1728/2157/articles/15.jpg?v=1552602870", "https://cdn.shopify.com/s/files/1/1728/2157/files/Recover_-_20190724_350x.jpg?v=1613580178", "https://cdn.shopify.com/s/files/1/1728/2157/articles/amanda_huggins_blog_photo_grande.jpg?v=1602872259", "https://cdn.shopify.com/s/files/1/1728/2157/files/active_sitting_350x.jpg?v=1618514877", "https://cdn.shopify.com/s/files/1/1728/2157/files/kids-active_350x.jpg?v=1620156543", "https://cdn.shopify.com/s/files/1/1728/2157/articles/yoga_for_swimmers_cover_photo_grande.jpg?v=1602696782", "https://cdn.shopify.com/s/files/1/1728/2157/files/logo_gaiam_410W_205x@2x.png?v=1613156828", "https://cdn.shopify.com/s/files/1/1728/2157/articles/Melanie_Klein_grande.jpg?v=1616780977", "https://cdn.shopify.com/s/files/1/1728/2157/files/NEOPRENE_HAND_WEIGHTS3081401_1_350x.jpg?v=1614304651", "https://cdn.shopify.com/s/files/1/1728/2157/files/Mala1_nav_img_350x_9abdbc53-9a6b-46cc-ab86-0373334695cd_350x.jpg?v=1614323612", "http://cdn.shopify.com/s/files/1/1728/2157/articles/15_600x.jpg?v=1552602870"], "top_img": "http://cdn.shopify.com/s/files/1/1728/2157/articles/15_600x.jpg?v=1552602870", "keywords": [], "authors": [], "canonical_link": "https://www.gaiam.com/blogs/discover/15-easy-ways-to-be-healthier", "title": "15 Easy Ways to Be and Live Healthier", "meta_data": {"google-site-verification": "IM-NobzEMoPxfTsHazN70IfVi7FX7E04d3gPVtF5k9U", "robots": "index,follow", "description": "A doctor, nutritionist, and fitness trainer each recommend their top five tips to live healthier including changes in diet, exercise, and stress management. Review our living a healthier lifestyle tips today!", "author": "Gaiam", "og": {"url": "https://www.gaiam.com/blogs/discover/15-easy-ways-to-be-healthier", "site_name": "Gaiam", "type": "article", "title": "15 Easy Ways to Be and Live Healthier", "image": {"identifier": "http://cdn.shopify.com/s/files/1/1728/2157/articles/15_600x.jpg?v=1552602870", "secure_url": "https://cdn.shopify.com/s/files/1/1728/2157/articles/15_600x.jpg?v=1552602870"}, "description": "A doctor, nutritionist, and fitness trainer each recommend their top five tips to live healthier including changes in diet, exercise, and stress management. Review our living a healthier lifestyle tips today!"}, "twitter": {"card": "summary", "title": "15 Easy Ways to Be and Live Healthier", "description": "A doctor, nutritionist, and fitness trainer each recommend their top five tips to live healthier including changes in diet, exercise, and stress management. Review our living a healthier lifestyle tips today!", "image": "http://cdn.shopify.com/s/files/1/1728/2157/articles/15_600x.jpg?v=1552602870"}, "HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width,initial-scale=1", "theme-color": "#ffffff", "shopify-digital-wallet": "/17282157/digital_wallets/dialog", "shopify-checkout-api-token": "85eef41d2cea00216bf281e27354a9e5"}, "movies": [], "publish_date": null, "source": "https://www.gaiam.com", "summary": ""}