{"url": "https://www.cnn.com/2018/03/30/politics/stacey-dash-withdraws-congressional-race/index.html", "text": "Washington CNN —\n\n“Clueless” star and former Fox News commentator Stacey Dash is withdrawing her congressional bid, a representative for the actress confirmed to CNN Friday.\n\n“After much prayer, introspection and discussions with my family, I am withdrawing my candidacy for California’s 44th Congressional District,” Dash said in an email statement to CNN.\n\nThe news comes one month after the actress and outspoken Republican filed paperwork to run in California’s 44th district, which is currently represented by Democrat Nanette Barragán.\n\nHer campaign slogan was “Dash to D.C.”\n\n“I started this run with the intention to address the pressing issues in the district where I live,” Dash said in the statement. “I hoped, and remain hopeful, that I can assist people living here on the national level. My goal was, and remains, to improve the lives of people who have been forgotten for decades by the Democratic Party.”\n\nHowever, Dash added, “At this point, I believe that the overall bitterness surrounding our political process, participating in the rigors of campaigning, and holding elected office would be detrimental to the health and wellbeing of my family. I would never want to betray the personal and spiritual principles I believe in most: that my God and my family come first.”\n\nThe district, which includes Compton, Watts, San Pedro and North Long Beach, has long been represented by a Democrat.\n\nIt overwhelmingly voted for Democratic presidential nominee Hillary Clinton in 2016, 83%-12%.\n\nDash, who wrote a memoir called “There Goes My Social Life: From Clueless to Conservative,” has been a polarizing figure since she made the transition from beloved 1990s actor to conservative pundit. She is known for taking controversial stances on issues affecting people of color.\n\nIn an interview with CNN’s The Point last month, Dash said she jumped in the race because it was “perfect timing.”\n\n“I live in my district and I realized this is home to me, this is where people need the most change to occur,” she said. “I’m going to fight for that change. It’s a labor of love for me. Why I decided to do it now? God. That’s why. It’s perfect timing. We need to keep the House.”\n\nDash said in her statement Friday that pulling out from the race was a “difficult choice.”\n\nHowever, she said she will “continue to speak out” about “problems facing this district, as well as the distractions that take the place of real change.”", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/170628090958-saba-hamedy.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/170515131851-the-point-with-chris-cillizza-logo-large-169.png?q=h_60,w_264,x_0,y_0/w_1280", "https://media.cnn.com/api/v1/images/stellar/prod/160229090308-oscars-stacey-dash.jpg?q=x_0,y_0,h_2580,w_4586,c_fill/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/160229090308-oscars-stacey-dash.jpg?q=x_0,y_0,h_2580,w_4586,c_fill/w_800"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/160229090308-oscars-stacey-dash.jpg?q=x_0,y_0,h_2580,w_4586,c_fill/w_800", "keywords": [], "authors": ["Saba Hamedy"], "canonical_link": "https://www.cnn.com/2018/03/30/politics/stacey-dash-withdraws-congressional-race/index.html", "title": "‘Clueless’ star Stacey Dash withdraws from congressional race", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "'Clueless' star Stacey Dash withdraws from congressional race | CNN Politics", "description": "\"Clueless\" star and former Fox News commentator Stacey Dash is withdrawing her congressional bid, a representative for the actress confirmed to CNN Friday.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/160229090308-oscars-stacey-dash.jpg?q=x_0,y_0,h_2580,w_4586,c_fill/w_800", "type": "article", "url": "https://www.cnn.com/2018/03/30/politics/stacey-dash-withdraws-congressional-race/index.html", "site_name": "CNN"}, "twitter": {"title": "'Clueless' star Stacey Dash withdraws from congressional race | CNN Politics", "description": "\"Clueless\" star and former Fox News commentator Stacey Dash is withdrawing her congressional bid, a representative for the actress confirmed to CNN Friday.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/160229090308-oscars-stacey-dash.jpg?q=x_0,y_0,h_2580,w_4586,c_fill/w_800", "card": "summary_large_image", "site": "@cnnpolitics"}, "description": "\"Clueless\" star and former Fox News commentator Stacey Dash is withdrawing her congressional bid, a representative for the actress confirmed to CNN Friday.", "template_type": "article_leaf", "type": "article", "meta-section": "politics", "meta-branding": "the-point", "theme": "politics", "article": {"published_time": "2018-03-30T19:54:39Z", "modified_time": "2018-03-31T15:39:02Z", "tag": "celebrities, elections and campaigns, government and public administration, government bodies and offices, legislative bodies, politics, stacey dash, us congress, us federal elections, us house elections, us house of representatives", "publisher": "https://www.facebook.com/CNN"}, "keywords": "celebrities, elections and campaigns, government and public administration, government bodies and offices, legislative bodies, politics, stacey dash, us congress, us federal elections, us house elections, us house of representatives", "author": "Saba Hamedy", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1522364400.0, "source": "https://www.cnn.com", "summary": ""}