{"url": "www.vividseats.com/concerts/blake-nation-blake-shelton-tribute-tickets.html", "text": "Blake Nation - Blake Shelton Tribute Concert Experience\n\nBlake Nation - Blake Shelton Tribute has become one of the top Country and Folk artists in the 2022 music scene, delighting fans with a unique Country and Folk sound. Blake Nation - Blake Shelton Tribute tickets provide an opportunity to be there in person for the next Blake Nation - Blake Shelton Tribute concert. So experience it live and be there in person for a 2022 Blake Nation - Blake Shelton Tribute Country and Folk concert.\n\nYou can buy Blake Nation - Blake Shelton Tribute tickets from Vivid Seats with confidence thanks to the Vivid Seats 100% Buyer Guarantee.\n\nAdditionally, Vivid Seats was named No. 1 in the ticketing category on Newsweek's list of Best Customer Service in both 2020 and 2021.\n\nBlake Nation - Blake Shelton Tribute Ticket Prices and Tour Information\n\nHow much are Blake Nation - Blake Shelton Tribute tickets? No matter what you're looking to spend, Vivid Seats has tickets to fit your budget. Currently, Blake Nation - Blake Shelton Tribute tickets at Vivid Seats start at $0, with an average price of $0. How to buy cheap Blake Nation - Blake Shelton Tribute tickets? No matter what you're looking to spend, Vivid Seats has you covered, with options for cheap Blake Nation - Blake Shelton Tribute tickets. Right now, the cheapest price for Blake Nation - Blake Shelton Tribute tickets is $0. When is the next Blake Nation - Blake Shelton Tribute concert? Vivid Seats has full Blake Nation - Blake Shelton Tribute tour info for all announced shows. Scroll up to see the next available Blake Nation - Blake Shelton Tribute concert. Will Blake Nation - Blake Shelton Tribute Tour in 2022? Blake Nation - Blake Shelton Tribute tour dates for 2022 or 2023 may be available now. For any confirmed future Blake Nation - Blake Shelton Tribute tour dates, Vivid Seats will have tickets. View all top 2022 concerts and tour rumor information for top artists. Blake Nation - Blake Shelton Tribute Floor Seats Blake Nation - Blake Shelton Tribute floor seats can provide a once-in-a-lifetime experience. Often, floor seats/front row seats can be some of the most expensive tickets at a show. Sometimes Vivid Seats offers VIP Blake Nation - Blake Shelton Tribute meet and greet tickets, which can cost more than front row seats or floor tickets. The maximum price tickets for Blake Nation - Blake Shelton Tribute could be front row or center stage tickets.\n\nTop Country and Folk Tour Tickets Available Now\n\nIf you're a Blake Nation - Blake Shelton Tribute fan and a Country and Folk lover in general, check out tickets for some of the top Country and Folk acts who have recently announced tours:\n\nCountry Music News From the Blog", "images": ["https://a.vsstatic.com/mobile/app/category/country.jpg", "http://media.vsstatic.com/image/upload/t_performer_hero_image/hero/category/14-country-folk/country-folk-tickets-1.jpg"], "top_img": "https://a.vsstatic.com/mobile/app/category/country.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.vividseats.com/blake-nation-blake-shelton-tribute-tickets/performer/79522", "title": "Blake Nation - Blake Shelton Tribute Tickets", "meta_data": {"description": "Get Blake Nation - Blake Shelton Tribute tickets, 2022 - 2023 tour information and the Blake Nation - Blake Shelton Tribute concert schedule from Vivid Seats. 100% Buyer Guarantee!", "keywords": "Blake Nation - Blake Shelton Tribute tickets", "og": {"image": "https://a.vsstatic.com/mobile/app/category/country.jpg", "site_name": "Vivid Seats", "url": "https://www.vividseats.com/blake-nation-blake-shelton-tribute-tickets/performer/79522", "title": "Blake Nation - Blake Shelton Tribute Tickets | Vivid Seats", "description": "Get Blake Nation - Blake Shelton Tribute tickets, 2022 - 2023 tour information and the Blake Nation - Blake Shelton Tribute concert schedule from Vivid Seats. 100% Buyer Guarantee!"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=5", "application-name": "Vivid Seats", "apple-mobile-web-app-title": "Vivid Seats", "msapplication-TileColor": "#333333", "msapplication-config": "//a.vsstatic.com/common/favicon/browserconfig.xml", "theme-color": "#ffffff", "google-play-app": "app-id=com.vividseats.android", "itunes": "app-id=963355757", "apple-mobile-web-app-capable": "yes", "format-detection": "telephone=yes", "next-head-count": 28}, "movies": [], "publish_date": null, "source": "http://www.vividseats.com", "summary": ""}