{"url": "www.cnn.com/2017/10/06/health/women-react-trump-birth-control-mandate-bn/index.html", "text": "Story highlights Administration will give some employers leeway to exempt birth control coverage Many women use hormonal birth control methods to treat medical conditions \"People are feeling deeply unsettled,\" one doctor says\n\nCNN —\n\nRachel Jarnagin was on her way to a post-surgical checkup Friday when she heard the news: The Trump administration had rolled back Obamacare’s birth control mandate, opening the door for nearly any employer or insurer with religious or moral convictions against contraceptives to exclude those benefits from their health plans.\n\nThe announcement struck close to home: Jarnagin, 30, had an ovary removed because of endometriosis just over a week ago and was prescribed hormonal birth control to keep the disorder in check. Endometriosis is an often-painful condition in which uterine tissue grows outside the uterus.\n\n“My doctor told me, ‘Unless we start you on birth control to manage it, there’s no guarantee that you won’t get endometriosis on the other ovary and lose it, too,’” said Jarnagin, who works at a bath and beauty store in Denver. “It’s a necessity for me.”\n\nHer reaction to the administration’s decision: “I deserve to have affordable medications for a condition that I have no control over. I have always been an advocate for access to health care, and it’s frustrating that I may have to fight or pay more for health care that I’ve already do.”\n\nMuch of the controversy over providing contraception to women centers on its use for family planning. But many medical conditions also require the use of hormonal birth control methods.\n\nAllison Phipps, left and her sister Rachel Jarnagin. Courtesy Allison Phipps\n\n“I saw this announcement, and it made me really angry,” said Jarnagin’s older sister, Allison Phipps, 32. “Endometriosis is a very common problem. My mom had it when she was 27 and had a portion of both of her ovaries removed. I might even have it, because many women don’t even know it’s there until the symptoms start.”\n\nPhipps herself was on the pill for 11 years and believes it might have protected her from developing the condition that has plagued the women in her family.\n\n“Personally, that’s why it’s important to me for birth control to be covered,” said Phipps, who works as an art director in Denver, “but I also believe it’s very important to women as a family planning method.\n\n“I remember when I was in college and having to pay for it,” she said. “For a generic mini pill, it was $30 a month, and with no job and student loans, that was a big deal. That was ramen noodle packages for a month.”\n\nPhipps, like many women, took to social media to express outrage, often using the hashtag #HandsoffmyBC.\n\nJennifer Lawson, 43, a best-selling author and blogger from San Antonio, used the hashtag to share how she used birth control in her youth to control excruciating cramps.\n\nListen. I was on bc pills when I was still a virgin bc it helps with cripplingly painful cramps... https://t.co/RvAZdwZ2fE #handsoffmyBC — Jenny Lawson (@TheBloggess) October 6, 2017\n\nHer cramps, she wrote in an email, were “so severe they made me physically sick. A doctor put me on birth control pills to help and it made a big difference. I still had cramps and nausea but they were finally manageable to the point that I wasn’t missing days of school and falling behind in life.”\n\nChildren’s book author Jessie Talbot had an even stronger reaction. “If I didn’t have BC, I’d be dead now,” she posted.\n\n“My issues came to an abrupt end when I got a hysterectomy 17 years ago,” Talbot said in an interview. “The birth control helped for a while but there was actually too much wrong for it to save the day. At least I had that option at the time.”\n\nAtlanta interactive designer Deb Nilsen has polycystic ovary syndrome, a hormonal imbalance often treated with birth control. If left untreated, it can lead to serious health issues such as heart disease and diabetes.\n\n“I think that the idea of the rollback on birth control is ridiculous and shortsighted,” Nilsen posted on Facebook. “Women like me, who have PCOS, typically do not have regular cycles and take birth control in order to get a period and not to prevent pregnancy. If a woman with PCOS doesn’t have access to birth control, I think it could be a risk factor for her.”\n\nNone of these reactions comes as a surprise to Dr. Anne Davis, an OB-GYN in New York who serves as consulting medical director for the nonprofit Physicians for Reproductive Health. After the 2016 election, she says, she heard women warning each other that their access to birth control might dwindle once the president-elect took office.\n\nBut worry is much different from reality.\n\nFriday, Davis was fitting an intrauterine device for a patient who has a condition that makes it medically dangerous to have more children. “I asked her if she’d seen the news,” Davis said. “She told me that she saw it and it was really hard for her not to cry.”\n\nJust a decade ago, says Davis, most women in her practice never considered using an IUD. “I would tell them, ‘Your insurance isn’t going cover it, and it’s 800 bucks.’ And people just shrugged their shoulders and said, ‘Well, I don’t have 800 bucks.’ It was completely out of reach financially for most of my patients.”\n\nOne of those patients, she recalls, used a condom for contraception but, due to accidents, ended up having an abortion, and then another.\n\n“After the Obamacare mandate, she was able to get an IUD,” Davis said. “Years later, she’s planning a family, in a place and time in her life where she can support children. It was a sea change for her.”\n\nJoin the conversation See the latest news and share your comments with CNN Health on Facebook and Twitter.\n\nWhat’s next for women who find themselves reliant on birth control for their medical conditions?\n\n“People are feeling deeply unsettled,” Davis added. “They don’t know what’s going to happen.”\n\nLawson, the author and blogger, said, “No employer knows me well enough to decide what is or isn’t acceptable for myself, my daughter, or anyone else. And they shouldn’t have to know me well enough because it’s none of their business.”\n\nLawson says she no longer has to take birth control pills but would be terrified of how the Trump decision would affect her if she were still suffering as she did when she was younger.\n\n“But just because it doesn’t affect me personally doesn’t mean I will stop fighting for those who it will negatively impact,” Lawson said. “We’re in this together. Or at least, we should be.”", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/120120101754-birth-control-ts.jpg?q=x_2,y_380,h_972,w_1729,c_crop/w_800", "https://media.cnn.com/api/v1/images/stellar/prod/111103032643-birth-control-generic-pills.jpg?q=x_2,y_381,h_970,w_1726,c_crop/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/171006173202-birth-control-rollback-1006.jpg?q=x_358,y_150,h_619,w_1100,c_crop/h_270,w_480"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/120120101754-birth-control-ts.jpg?q=x_2,y_380,h_972,w_1729,c_crop/w_800", "keywords": [], "authors": ["Sandee Lamotte"], "canonical_link": "https://www.cnn.com/2017/10/06/health/women-react-trump-birth-control-mandate-bn/index.html", "title": "Women speak out Trump removal of birth control mandate", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Beyond just birth control: Rollback leaves some women fearful | CNN", "description": "Women across the US react with concern, anger after Friday's announcement that the Trump administration is giving some employers leeway to exempt birth control coverage on religious grounds.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/120120101754-birth-control-ts.jpg?q=x_2,y_380,h_972,w_1729,c_crop/w_800", "type": "article", "url": "https://www.cnn.com/2017/10/06/health/women-react-trump-birth-control-mandate-bn/index.html", "site_name": "CNN"}, "twitter": {"title": "Beyond just birth control: Rollback leaves some women fearful | CNN", "description": "Women across the US react with concern, anger after Friday's announcement that the Trump administration is giving some employers leeway to exempt birth control coverage on religious grounds.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/120120101754-birth-control-ts.jpg?q=x_2,y_380,h_972,w_1729,c_crop/w_800", "card": "summary_large_image", "site": "@CNN"}, "description": "Women across the US react with concern, anger after Friday's announcement that the Trump administration is giving some employers leeway to exempt birth control coverage on religious grounds.", "template_type": "article_leaf", "type": "article", "meta-section": "health", "theme": "health", "article": {"published_time": "2017-10-07T00:40:05Z", "modified_time": "2017-10-07T00:40:05Z", "tag": "contraception, diseases and disorders, donald trump, females (demographic group), government and public administration, government bodies and offices, health and medical, political figures - us, population and demographics, sexual and reproductive health, society, us federal government, white house, internet and www, social media, technology", "publisher": "https://www.facebook.com/CNN"}, "keywords": "contraception, diseases and disorders, donald trump, females (demographic group), government and public administration, government bodies and offices, health and medical, political figures - us, population and demographics, sexual and reproductive health, society, us federal government, white house, internet and www, social media, technology", "author": "Sandee LaMotte", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1507244400.0, "source": "http://www.cnn.com", "summary": ""}