{"url": "https://www.independent.co.uk/arts-entertainment/tv/news/the-crown-pay-gap-claire-foy-responds-matt-smith-netflix-apology-a8273771.html", "text": "Sign up to our free IndyArts newsletter for all the latest entertainment news and reviews Sign up to our free IndyArts newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nIndyArts email {{ #verifyErrors }}{{ message }}{{ /verifyErrors }}{{ ^verifyErrors }}Something went wrong. Please try again later{{ /verifyErrors }}\n\nClaire Foy has responded to the controversy surrounding the pay gap between her and The Crown co-star Matt Smith.\n\nRecently it emerged that the 33-year-old star of the hit Netflix show was paid less than the former Doctor Who actor, despite having the lead role.\n\nThe Sun reported that Foy, who played Queen Elizabeth II in the first two series of The Crown, received a lower wage than Smith, who starred as Prince Philip, due to his larger reputation in the industry. The report was confirmed by producers Suzanne Mackie and Andy Harries.\n\nFoy told Entertainment Weekly following the uproar: \"I'm surprised because I'm at the centre of it, and anything that I'm at the centre of like that is very, very odd, and feels very, very out of ordinary.\n\n\"But I'm not [surprised about the interest in the story] in the sense that it was a female-led drama,\" she added. \"I'm not surprised that people saw the story and went, 'Oh that's a bit odd'.\n\n\"But I know that Matt feels the same that I do, that it's odd to find yourself at the centre [of a story] that you didn't particularly ask for.\"\n\nProducers at Left Bank Pictures apologised for the pay disparity in a statement which said: \"We want to apologise to both Claire Foy and Matt Smith, brilliant actors and friends, who have found themselves at the centre of a media storm this week through no fault of their own.\n\n\"Claire and Matt are incredibly gifted actors who, along with the wider cast on The Crown, have worked tirelessly to bring our characters to life with compassion and integrity.\n\n\"As the producers of The Crown, we at Left Bank Pictures are responsible for budgets and salaries. The actors are not aware of who gets what, and cannot be held personally responsible. We all have a responsibility to do what we can to ensure that these issues are tackled, and as a leading production company we want to make our contribution to the debate.\"\n\nTV preview 2018: Everything to look out for Show all 16 1 /16 TV preview 2018: Everything to look out for TV preview 2018: Everything to look out for Jessica Jones Starring:​ Krysten Ritter, Rachael Taylor, Carrie-Anne Moss, David Tennant Start date: 8 March, Netflix Netflix TV preview 2018: Everything to look out for The OA Starring: Brit Marling, Emory Cohen, Phyllis Smith, Patrick Gibson, Jason Isaacs Start date: 15 March, Netflix TV preview 2018: Everything to look out for Trust Starring:Hilary Swank, Brendan Fraser, Donald Sutherland, Harris Dickinson, Anna Chancellor Start date: 25 March 2018, AMC (Sky Atlantic air date TBA) FX Productions TV preview 2018: Everything to look out for A Series of Unfortunate Events Starring: Neil Patrick Harris, Malina Weissman, Patrick Warburton, Lucy Punch, Tony Hale, Nathan Fillion Start date: 30 March, Netflix TV preview 2018: Everything to look out for Atlanta Robbin Starring: Neil Patrick Harris, Malina Weissman, Patrick Warburton, Lucy Punch, Tony Hale, Nathan Fillion Start date: 30 March, FOX (UK air date TBA) Matthias Clamer/FX TV preview 2018: Everything to look out for Legion Starring: Dan Stevens, Rachel Keller, Aubrey Plaza, Jean Smart, Jemaine Clement Start date: 17 April, FOX 20th Television TV preview 2018: Everything to look out for The Alienist Starring: Daniel Brühl, Luke Evans, Dakota Fanning, Brian Geraghty Start date: 19 April, Netflix Warner Bros. Television Distribution TV preview 2018: Everything to look out for Westworld Starring: Evan Rachel Wood, Jeffrey Wright, Thandie Newton, Ed Harris, James Marsden Start date: 21 April, HBO TV preview 2018: Everything to look out for Fear the Walking Dead Starring: Kim Dickens, Lennie James, Frank Dillane, Alycia Debnam Carey, Colman Domingo, Maggie Grace Start date: 23 April, AMC on BT TV Richard Foreman, Jr/AMC TV preview 2018: Everything to look out for The Handmaid's Tale Starring: Elisabeth Moss, Joseph Fiennes, Samira Riley, Yvonne Strahovski, Ann Dowd Start date: 25 April, Hulu (Channel 4 air date TBA) Hulu TV preview 2018: Everything to look out for Better Call Saul Start date: TBA, Netflix Netflix TV preview 2018: Everything to look out for Call the Midwife series 7 Starring: Vanessa Redgrave, Kate Lamb, Stephen McGann, Leonie Elliott Vanessa Redgrave, Kate Lamb, Stephen McGann, Leonie Elliott Start date: TBA, BBC One TV preview 2018: Everything to look out for House of Cards Start date: TBA, Netflix Netflix TV preview 2018: Everything to look out for 13 Reasons Why Start date: TBA, Netflix TBA, Netflix TV preview 2018: Everything to look out for This Is Us season 2 Start date: TBA, Channel 4 TBA, Channel 4 Ron Batzdorff/NBC TV preview 2018: Everything to look out for Unforgotten series 3 Start date: TBA, ITV1\n\nSince the controversy, Left Bank Pictures have confirmed they will pay Olivia Colman, who will take over the role of The Queen in series three of The Crown, the same wage as the yet-to-be-announced actor who portrays the older Prince Philip.\n\nMackie pledged: \"Going foward, no one gets paid more than the Queen.\"", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/05/15/22/the-crown-skyline.jpg?quality=75&width=1200&auto=webp", "https://www.independent.co.uk/img/pixels-player-logo.svg", "https://www.independent.co.uk/img/logo-white-out.svg"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/05/15/22/the-crown-skyline.jpg?quality=75&width=1200&auto=webp", "keywords": [], "authors": ["Roisin O'Connor"], "canonical_link": "https://www.independent.co.uk/arts-entertainment/tv/news/the-crown-pay-gap-claire-foy-responds-matt-smith-netflix-apology-a8273771.html", "title": "The Crown: Claire Foy responds to controversy over Matt Smith pay gap", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, user-scalable=no, minimum-scale=1.0, maximum-scale=1.0", "description": "News that 'Doctor Who' actor was paid more than Foy, who starred as the Queen, caused uproar among fans and critics", "theme-color": "#EC1A2E", "amp-google-client-id-api": "googleanalytics", "robots": "max-image-preview:large", "fb": {"app_id": 235586169789578, "pages": "https://www.facebook.com/TheIndependentOnline"}, "category": "News", "sitename": "The Independent", "page path": "/arts-entertainment/tv/news", "page type": "Article", "adPageType": "Article Page", "og": {"locale": "en_GB", "updated_time": "2018-03-26T12:01:16.000Z", "site_name": "The Independent", "title": "Claire Foy responds to The Crown pay controversy", "url": "https://www.independent.co.uk/arts-entertainment/tv/news/the-crown-pay-gap-claire-foy-responds-matt-smith-netflix-apology-a8273771.html", "type": "article", "description": "News that 'Doctor Who' actor was paid more than Foy, who starred as the Queen, caused uproar among fans and critics", "image": {"identifier": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/05/15/22/the-crown-skyline.jpg?quality=75&width=1200&auto=webp", "secure_url": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/05/15/22/the-crown-skyline.jpg?quality=75&width=1200&auto=webp"}}, "article": {"published_time": "2018-03-26T12:01:16.000Z", "modified_time": "2018-03-26T12:01:16.000Z", "section": "Culture", "subsection": "TV & Radio", "author_name": "Roisin O'Connor", "content_type": "story", "word_count": 592, "image_count": 1, "embed_count": 2, "video_count": 1, "internal_link_count": 7, "external_link_count": 2}, "date": "2018-03-26T12:01:16.000Z", "google-signin-client_id": "329250492844-uqochn2f1j5ljkshuap5gc7qphf1refj.apps.googleusercontent.com", "twitter": {"title": "Claire Foy responds to The Crown pay controversy", "site": "@Independent", "card": "summary_large_image", "description": "News that 'Doctor Who' actor was paid more than Foy, who starred as the Queen, caused uproar among fans and critics", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/05/15/22/the-crown-skyline.jpg?quality=75&width=1200&auto=webp"}, "keywords": "Claire Foy,Matt Smith,The Crown,Netflix,Prince Philip,Queen Elizabeth II,Gender pay gap,Internal"}, "movies": [], "publish_date": 1522065676.0, "source": "https://www.independent.co.uk", "summary": ""}