{"url": "https://www.wmagazine.com/story/bella-hadid-instagram-comment-kendall-jenner", "text": "Bella Hadid may be one of the world’s most in-demand models, but she’s also a 21-year-old with a smartphone. She has access to the same Internet as the rest of us; you know, that same Internet where trolls occasionally make rude comments about her and her friends. So it would not be a surprise for Hadid to come across one of these comments, and decide to weigh in. That’s apparently what happened in a story involving Hadid, an Instagram fan account that’s on her radar, and a (maybe?) now repentant troll.\n\nThe story begins with fan account @BallaHadid, one of the largest Hadid tribute accounts on Instagram with 26.7k followers. It seems to be on Hadid’s radar. While she doesn’t follow the account, its bio proclaims “Bella liked x3 commented x1 Hails liked x1.” (We’re assuming the “Hails” is Hailey Baldwin). Over the weekend, the account posted a side-by-side photo of Hadid and her friend and fellow it-girl Kendall Jenner in semi-sheer, “free the nipple”-type tops. “Kenny or Bella?” it asked.\n\n[#Instagram: https://www.instagram.com/p/Bg_dympBZ0S/?taken-by=ballahadid]\n\nOne user decided that the answer to the question was a decided neither and went in on both of the models. “2 fake bitches sitting in a tree, first comes the nose job, then come the lips, oh and don’t forget the built in cheeks,” wrote the user. “lmao y’all tripping fam, money can get you a new face but not a nicer personality which these two girls need.”\n\nHadid saw the comment and decided to comment. Mind you, this all happened on the weekend following the release of an EP from her ex-boyfriend, The Weeknd, that appears to contain several references to their former relationship. Would not any of us in that position feel the need to let off a little steam and let the haters know what’s what? Besides, even with all the (often baseless) rumors out there flying about Hadid and her life, there are none that suggest she has anything but a rather pleasant and chill personality. The modeling industry is full of tall tales of diva behavior, that’s for sure, but none of them point back to Hadid.\n\n“I wish you would know either of our personalities,” wrote Hadid. “And not only that, I wish you would only grasp a heart of your own. Blessings to you sweetheart. Jealousy is a cry for help that I wish I could help you with.”\n\nFeel free to use “Blessings to you sweetheart” as your go-to response to any negative you should encounter in your own life.\n\nThe user deleted the comment, and, with it, Hadid’s reply as well, but the fan account screenshotted the interaction and put it up on Instagram stories.\n\nWhat does remain on the post is the troll’s reply to the incident. Apparently, they had a change of heart. Better living through getting clapped back at by a supermodel?\n\nAs it turned out, it seems the troll also became the victim of trolls and had to temporarily put their Instagram account on lockdown to weather the storm.\n\nThis is not the first time a model has clapped back at her trolls. Cara Delevingne is a master at it and once got in a memorable row with a Twitter user who told her to get a real job. Hadid’s sister Gigi also recently took to Twitter to remind people that even supermodels sometimes read the comment sections. Clearly.\n\nRelated: How Bella Hadid Ruled the World in 2017\n\nRihanna Isn’t The Only Celebrity Obsessed With Sitting Courtside At Basketball Games Kendall Jenner is seen at the game between the Philadelphia 76ers and the Indiana Pacers on March 10, 2019 at the Wells Fargo Center in Philadelphia, Pennsylvania. Photo courtesy of Getty Images. Jesse D. Garrabrant Mindy Kaling and B.J. Novak attend a basketball game between the Los Angeles Lakers and the Golden State Warriors at Staples Center on April 04, 2019 in Los Angeles, California. Photo courtesy of Getty Images. Allen Berezovsky John Legend, Chrissy Teigen, and Gabrielle Union seen courtside during the game between the Philadelphia 76ers and the Miami Heat on April 9, 2019 at American Airlines Arena in Miami, Florida. Photo courtesy of Getty Images. Issac Baldizon Shawn Mendes smiles from his court side seat during Game One of the second round of the 2019 NBA Playoffs between the Philadelphia 76ers and the Toronto Raptors at Scotiabank Arena on April 27, 2019 in Toronto, Canada. NOTE TO USER: User expressly acknowledges and agrees that, by downloading and or using this photograph, User is consenting to the terms and conditions of the Getty Images License Agreement. Photo courtesy of Getty Images. Vaughn Ridley Elisabeth Moss watches the International Friendly Basketball match between Canada and the USA at Qudos Bank Arena on August 26, 2019 in Sydney, Australia. Photo courtesy of Getty Images. Mark Metcalfe Maluma attends the Chicago Bulls game against the New York Knicks on October 28, 2019 at Madison Square Garden in New York City, New York. Photo courtesy of Getty Images. Nathaniel S. Butler Jay-Z and Beyonce watch from courtside during Game Six of the Western Conference Semifinals of the 2019 NBA Playoffs at Toyota Center on May 10, 2019 in Houston, Texas. Photo courtesy of Getty Images. Bob Levey Khloe Kardashian attends a basketball game between the Los Angeles Lakers and the Cleveland Cavaliers at Staples Center on January 13, 2019 in Los Angeles, California. Photo courtesy of Getty Images. Allen Berezovsky Drake attends a game between the Milwaukee Bucks and the Toronto Raptors during Game Four of the Eastern Conference Finals of the 2019 NBA Playoffs on May 19, 2019 at the Scotiabank Arena in Toronto, Ontario, Canada. Photo courtesy of Getty Images. Jesse D. Garrabrant Laverne Cox, James Shani and Issa Rae attend a basketball game between the Los Angeles Lakers and the Golden State Warriors at Staples Center on October 16, 2019 in Los Angeles, California. Photo courtesy of Getty Images. Allen Berezovsky David Beckham and Romeo Beckham attend the game between the Los Angeles Lakers and the Memphis Grizzlies on October 27, 2019 at STAPLES Center in Los Angeles, California. Photo courtesy of Getty Images. Chris Elise Chadwick Boseman attends a basketball game between the Los Angeles Clippers and the Los Angeles Lakers at Staples Center on October 22, 2019 in Los Angeles, California. Photo courtesy of Getty Images. Allen Berezovsky Melissa Forde and Rihanna attend a basketball game between the Los Angeles Lakers and the Utah Jazz at the at Staples Center on October 25, 2019 in Los Angeles, California. Photo courtesy of Getty Images. Kevork S. Djansezian Kourtney Kardashian attends a basketball game between the Los Angeles Lakers and the Philadelphia 76ers at Staples Center on January 29, 2019 in Los Angeles, California. Photo courtesy of Getty Images. Allen Berezovsky Rich Paul and Chance the Rapper attend the game between the LA Clippers and the Milwaukee Bucks on November 6, 2019 at STAPLES Center in Los Angeles, California. Photo courtesy of Getty Images. Andrew D. Bernstein Emilia Clarke attends a game between the Golden State Warriors and the Houston Rockets during Game Six of the Western Conference Semifinals of the 2019 NBA Playoffs on May 10, 2019 at the Toyota Center in Houston, Texas. Photo courtesy of Getty Images. Bill Baptist Pete Davidson attends the Chicago Bulls game against the New York Knicks on October 28, 2019 at Madison Square Garden in New York City, New York. Photo courtesy of Getty Images. Nathaniel S. Butler Rich the Kid, Lil Pump, RD Whittington and Travis Barker attend a basketball game between the Los Angeles Lakers and the Charlotte Hornets at Staples Center on October 27, 2019 in Los Angeles, California. Photo courtesy of Getty Images. Allen Berezovsky Taraji P. Henson sits courtside during a game between the Chicago Bulls and the Los Angeles Lakers at United Center on November 05, 2019 in Chicago, Illinois. Photo courtesy of Getty Images. Stacy Revere Snoop Dogg attends a game between the Los Angeles Lakers and the San Antonio Spurs on November 3, 2019 at the AT&T Center in San Antonio, Texas. Photo courtesy of Getty Images. Logan Riely INFO 1/20", "images": ["https://imgix.bustle.com/wmag/2019/11/08/5dc5bbe60c33a000081b86d1_GettyImages-1139735869.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2019/11/08/5dc5bbe5a5250000086807ce_GettyImages-1136074195.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2016/08/31/57c733477f90a903193dabde_1016.w.VS_.couture.image11.jpg?w=414&h=619&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2019/11/08/5dc5bbeea5250000086807d9_GettyImages-1183876490.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/wmag/2019/11/08/5dc5bbe5a5250000086807cd_GettyImages-1140500660.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2019/11/08/5dc5bbec0e538e000830c8de_GettyImages-1181554480.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2019/11/08/5dc5bbec0e538e000830c8d9_GettyImages-1180497653.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2019/11/08/5dc5bbee0e538e000830c8e0_GettyImages-1183515257A.JPG?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2019/11/08/5dc5bbe20c33a000081b86cf_GettyImages-1093847226.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2019/11/08/5dc5bbe2a5250000086807cb_GettyImages-1126058921.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/10/5/c4a97231-bbed-4b0f-b90d-f26c679b6910-b.jpeg?w=160&h=160&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.4773&fp-y=0.268", "https://imgix.bustle.com/wmag/2019/11/08/5dc5bbe90c33a000081b86d3_GettyImages-1148318622A.JPG?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2019/11/08/5dc5bbec0e538e000830c8db_GettyImages-1179072035A.JPG?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2019/11/08/5dc5bbeb0e538e000830c8d8_GettyImages-1179874824A.JPG?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2019/11/08/5dc5bbeda5250000086807d7_GettyImages-1182812313.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2019/11/08/5dc5bbee0c33a000081b86d5_GettyImages-1185773730.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2016/08/31/57c733477f90a903193dabde_1016.w.VS_.couture.image11.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/wmag/2019/11/08/5dc5bbe8a5250000086807d1_GettyImages-1145421198.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/wmag/2019/11/08/5dc5bbea0e538e000830c8d6_GettyImages-1178670379.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/04/02/5ac2a1490bb770712cd456bc_bella-troll-saga-part-3.jpg?w=374&h=221&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2019/11/08/5dc5bbe9a5250000086807d3_GettyImages-1142704612.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/04/02/5ac2a0eab3fda879f4f559ff_ballahadid-troll-saga-part-2.jpg?w=374&h=135&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2022/9/29/5fe8fd83-565a-4bc4-bcb2-3b26cc1c4b08-getty-1428489277.jpg?w=160&h=160&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.536&fp-y=0.2204", "https://imgix.bustle.com/wmag/2019/11/08/5dc5bbe90e538e000830c8d4_GettyImages-1170276895.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2019/11/08/5dc5bbeaa5250000086807d5_GettyImages-1178670380.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/04/02/5ac2a00d383f9c7c655b55b3_bella-hadid-blessings-to-you-sweetheart.jpg?w=374&h=338&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/wmag/2019/11/08/5dc5bbe30e538e000830c8d2_GettyImages-1129707627.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress"], "top_img": "https://imgix.bustle.com/wmag/2016/08/31/57c733477f90a903193dabde_1016.w.VS_.couture.image11.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.wmagazine.com/story/bella-hadid-instagram-comment-kendall-jenner", "title": "Bella Hadid Claps Back at Troll Who Told Her and Kendall Jenner to Buy a New Personality", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@wmag", "card": "summary_large_image", "creator": "@munzenrieder"}, "article": {"publisher": "https://www.facebook.com/wmagazine"}, "og": {"site_name": "W Magazine", "url": "https://www.wmagazine.com/story/bella-hadid-instagram-comment-kendall-jenner", "type": "article", "title": "Bella Hadid Claps Back at Troll Insulted Her and Kendall Jenner", "description": "\"Blessings to you sweetheart.\"", "image": {"identifier": "https://imgix.bustle.com/wmag/2016/08/31/57c733477f90a903193dabde_1016.w.VS_.couture.image11.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "\"Blessings to you sweetheart.\""}, "movies": [], "publish_date": null, "source": "https://www.wmagazine.com", "summary": ""}