{"url": "http://www.cq.com/doc/newsmakertranscripts-4953962?9", "text": "President Barack Obama Delivers Remarks at Hillary for America Campaign Event in Philadelphia, as Released by the White House\n\nAS RELEASED BY THE WHITE HOUSE\n\nOBAMA:\n\nHello, Philly.\n\nHello, Philadelphia. Oh, it is good to be back in Philly. Can everybody please give Patrick (ph) a big round of applause for that great introduction?\n\n(APPLAUSE)\n\nOh, it is good to be back on the campaign trail. Now, I understand -- I know I'm not the first person from the White House to come to Philly this week. Some of you may have seen Joe Biden at the Eagles game. He told me, Barack, you've got to get on the Wentz wagon. We got a new quarterback. We got hope in Philly.\n\nAnd I had to explain, Joe, I am a Bears fan. And we play Philly next Monday night. So I've got to stick with my team, but I am going to go to Philly and scout out what all the fuss is about.\n\nI also am here because you've got some of the best public servants in America. They work their heart out every day for you. You've got scrim's (ph) favorite son, in addition to Joe Biden. Senator Bob Casey, one of the best senators in the country. Your outstanding governor, Tom Wolf is here.\n\n(APPLAUSE)\n\nYour wonderful mayor, Jim Kenney is here. One of your outstanding members of the House of Representatives, Bob Brady, is in the house. Your candidate for the United States Senate, this is a special woman. She is going to do a great job. Katie McGinty's here.\n\n(APPLAUSE)\n\nAnd your candidate for attorney general, and old friend of mine, somebody who was with me early, early, early on, Josh Shapiro. Give Josh a big round of applause.\n\nNow, I love you too, but we've got some business to do here, so, we've got some business to do. This will be -- this is going to be one of the last times I visit Philly as president. And so my first order of business is to say thank you, for all the support you've given me all these years. And I've got incredible memories here in Philly, most recently, at the Democratic National Convention.\n\nAnd I could not be prouder of the leaders that we have nominated to take my place. So even though I've run my last campaign, I am going to work as hard as I can this fall to elect Hillary Clinton as our next president of the United States of America.\n\n(APPLAUSE)\n\nHillary.\n\nNow, in election season, you will often hear crazy stuff. But I've got to say, this year, we've been hearing a little more crazy than usual.\n\nOBAMA:\n\nHaving said that, after almost two terms as your president, I am here to tell you, I am more optimistic about our future than I have ever been. Look, because I've seen an America, that for all the challenges, for all the noise of the politics, still has the capacity to come together and do great things. You think about it; we fought our way back from the worse recession in 80 years.\n\nWe turned around a declining economy, we helped out auto industry set new records, our businesses created 15 million new jobs, slashed our dependence on foreign oil, doubled our production of clean energy, made marriage equality a reality in all 50 states. We brought more of our troops home to their families, we delivered justice to Osama Bin Laden.\n\nThrough diplomacy rather than war, we shut down Iran's nuclear program. Opened up a new chapter with the people of Cuba, brought nearly 200 nations together around a climate agreement that could save this planet for our kids and our grandkids; that's what we've done. By so many measures, America is stronger and more prosperous than when we started out on this journey together.\n\nIn fact, some of you may have saw there was a new report out just today showing that last year across every age, every race in America, incomes rose and the poverty rate fell. In fact, the typical household income of Americans rose by $2,800, which is the single biggest one-year increase on record. We lifted 3.5 million people out of poverty; that's the largest one-year drop in poverty since 1968.\n\nThe uninsured rate is the lowest it has been since they kept records. The pay gap between men and women shrank to the lowest level ever. So, now, let's face it; the Republicans don't like to hear good news right now.\n\nBut it's important just to understand this is a big deal; more Americans are working, more have health insurance, incomes are rising, poverty is falling, and gas is $2.00 a gallon. I don't even - thank you for reminding me. Thanks, Obama.\n\nSo the steps that we had been taking over these years, they're paying off. We've shown that progress is possible. And of course, none of this was easy. We knew all along that change wasn't going to be quick, we knew that we wouldn't meet all of our challenges in one term or even in one presidency, but we're here today because we know we've got more work to do for every worker who still needs a good job.\n\nFor every worker who still needs a raise or a decent retirement. For every child who still needs a world-class education as a ladder out of poverty. For every family who hasn't yet felt progress these past eight years, we've got more work to do - we know that. And the choice that you make, that we make, just eight weeks from today will determine the direction of this country for a long time.\n\nAnd I've already said this; this is not a choice - this is not the usual choice between parties and policies and left and right. This is more fundamental. This is a fundamental choice about who we are as a people. This is a choice about the very meaning of America.\n\nYou know, Democrats and Republicans - we've always had our differences, there's nothing wrong with that. That's how the country moves forward, right? We had debates, different ideas, compete. We see what's going to make us work.\n\nOBAMA:\n\nBut what we've seen from the other side in this election - this isn't Abraham Lincoln's Republican Party. This isn't even division of freedom that Ronald Reagan talked about.\n\nThis is a dark, pessimistic vision of a country where we turn against each other. We turn away from the rest of the world.\n\nThey're not offering serious solutions they're just fanning resentment, and blame, and anger, and hate. And that is not the America we know, that's not the America I know. The America I know is full of courage and optimism and generosity and ingenuity and innovation.\n\nYes we've got real concerns, we worry about paying the bills, we worry about protecting our kids, we worry about caring for a sick parent. Lord knows we get frustrated about Washington and all the gridlock. We worry about racial division. There are pockets of America that never fully recovered from the factories closing down. There are parents who are worrying about whether their kids are going to have the same opportunities they had.\n\nBut look I've travelled in every state and I've seen more than anything all that is good and right about America. I see people working hard I see folks starting businesses I see teachers just digging in their own pockets to buy school materials and teaching kids just because they love kids.\n\nI see men and women in uniform serving their country making incredible sacrifices. I see engineers inventing new stuff and doctors coming up with new cures, and most of all I see this younger generation that is so full of energy and ideas and aren't going to be held back by the old ideas. Imagine what can be instead of just what is.\n\nAnd I see American's of every party and every background and every faith who ultimately believe we're stronger together, all of us, young, old, men, women, black, white, Latino, Asian, Native American, folks with disabilities, all pledging allegiance to the same proud flag. That is the America I know.\n\nThat's the America you know and believe in. And there is just one candidate in this race who's devoted her life to building that America. A mother and a grandmother who would do anything to help our children do better, a leader who's got real plans to break down barriers and blast through glass ceilings and widen opportunity for every single American, the next President of the United States, Hillary Clinton.\n\nAUDIENCE:\n\nHillary! Hillary! Hillary!\n\nOBAMA:\n\nHillary.\n\nAUDIENCE:\n\nHillary! Hillary! Hillary!\n\nOBAMA:\n\nNow look, look can I just say I am really into electing Hillary Clinton. Like this not me going through the motions here.\n\nI really, really, really want to elect Hillary Clinton. And sometimes folks they're kind of surprised by that because they remember man you guys had a tough fight eight years ago. And it was tough, because Hillary's tough, every time I thought I had that race won, I was like going up the Rocky Steps, I was about to celebrate and then I looked and she's right there.\n\nAnd I got whooped here in Pennsylvania. She whooped me. But you did make it up to me in November when I won. But I have seen what she could accomplish. I've seen how smart and savvy and tough she was.\n\nSo I asked her, I said join my team. And she wasn't sure about it at first. But she ultimately knew that what was at stake was bigger than either of us. That's the kind of patriot she is. And so for four years, I had a front row seat, I watched her intelligence, I watched her judgment, I watched her discipline.\n\nOBAMA:\n\nI saw her in the Situation Room where she argued in favor of the mission for Bin Laden. I watched her pursue diplomacy to open up new partnerships, to help promote Democracy, to help reduce the nuclear threat. And she worked hard, tirelessly, flying around the world again and again. I don't know how many times she lapped the world but she went around a long time. Because she had never forgotten what she was fighting for.\n\nTo make sure every child has the same opportunities as her granddaughter and her daughters and your kids. And if there's one thing I can tell you, Philadelphia, nobody fully understands the demands of my job, this job of the president, until you actually sit behind that desk.\n\nLook, I didn't understand it before I had the job. You think you do --\n\nAUDIENCE:\n\nThank you. Thank you. Thank you.\n\nOBAMA:\n\nNo, no, I appreciate that, but I'm not gone yet, so save the thank you's. I'm not finished yet. I've got a few more months. Listen, what you come to realize when you're in this job is, anybody can pop up. Anybody can fire off a tweet. Everybody's a critic. But that doesn't mean you know what it's like to manage a global crisis. You don't know what it's like to send a group of young people to war knowing some won't come back.\n\nBut the closest you can come to understanding what it's like is to be where Hillary has been. To have been part of those decisions. She knows what it means for working families and senior citizens and small business owners and soldiers and veterans when we make policy in the White House. And in the middle of crises, she'll listen to people and she will keep her cool and she treats everybody with respect.\n\nAnd no matter how daunting the odds, no matter how many times people knock her down and mess with her, she does not quit. She doesn't quit. She doesn't quit. That's the Hillary that I know. And that's why I really want to get her elected. That's the Hillary I've come to admire.\n\nI believe there has never been a man or a woman more qualified than Hillary Clinton to serve as our president.\n\nNow, Hillary actually has plans to address the things that she's heard from you on the campaign trail. Specific ideas to invest in new jobs and to help workers share in their companies' profits and to help put kids in preschool so they get a good start, and to put students through college without taking on a mountain of debt.\n\nAnd I know that these days, in campaigns, sometimes the plans get ignored, but they're there. And they make sense, and they add up. And then there's the other guy, Donald Trump.\n\n(AUDIENCE BOOS)\n\nDon't boo. Vote. Don't boo. Vote. Booing is easy. I need you to vote. Look, let's talk about Mr. Trump. He's not really a plans guy, a fact guy. He calls himself a business guy, but America has got a lot of business men and women who succeeded without hiding their tax returns or leaving a trail of lawsuits, workers who didn't get paid, people feeling like they got cheated.\n\nI mean, look. I keep on reading this analysis that, well, you know, Trump's got support from like working folks. Really? This is the guy you want to be championing working people? This guy who spent 70 years on this earth showing no concern for working people -- this guy's suddenly going to be your champion?\n\nOBAMA:\n\nI mean, he spent most of his life trying to stay as far away from working people as he could. And now this guy is going to be the champion of working people? He wasn't going to let you on his golf course. He wasn't going to let you buy in his condo. And now suddenly this guy is going to be your champion? So yes, if you oppose raising the minimum wage you should vote for Trump, you should also vote for Pat Toomey.\n\nYou've got a Trump-Toomey economy will be right up your alley, but if you are actually concerned about paying your bills, growing the economy, creating opportunity for everybody, keeping the trend of rising incomes going and rising wages going and uninsured going down and poverty going out.\n\nIf that's what you're looking for this shouldn't even be close. If you want higher wages, better benefits, a fairer tax code, a bigger voice for workers, stronger regulations on Wall Street, then you should be voting for Hillary Clinton and Katie McGinty and Bob Brady to stand up for you. And if you're concerned about who's going to keep your family safe in this dangerous world, then the choice is even clearer.\n\nLook, I just came from overseas, talk to the other leaders around the world. They don't even understand how this is close. Hillary's worked with our intelligence teams and our diplomats and our military, she's got the judgment and the temperament and the experience to meet any threat. There's no scenario that she will not have seen before, and she'll see to it that our troops finish the job of defeating ISIL, doing it the right way without resorting to torture.\n\nWithout banning entire religions from our country, she's prepared to be the next Commander in Chief.\n\nAUDIENCE:\n\nHillary! Hillary! Hillary!\n\nOBAMA:\n\nAnd then you got The Donald, who just last week went on Russian state television to talk down our military and to curry favor with Vladimir Putin.\n\n(AUDIENCE BOOS)\n\nHe loves this guy, love this guy. Think about what's happened to the Republican Party. Right? They used to be opposed to Russia and authoritarianism and fighting for freedom and fighting for democracy.\n\nAnd now their nominee is out there praising a guy, saying he's a strong leader because he invades smaller countries, jails his opponents, controls the press and drives his economy into a long recession. No, look I'm actually being serious about - think about this. And when the interviewer asked him well, why do you support this guy? He's a strong guy, look, he's got an 82 percent poll rating.\n\nWell yes, Saddam Hussein had a 90 percent poll rating, I mean if you control the media and you've taken away everybody's civil liberties and you jail dissidents, that's what happens.\n\nYou know the pollsters calls you up and says do you support the guy who if you don't support him he might through you in jail, you say yes I love that guy. But think about the fact that that is Donald Trump's role model, I mean I have to do business with Putin, I have to do business with Russia but that's part of foreign policy.\n\nBut I don't go around saying that's my role model. Can you imagine Ronald Reagan idolizing somebody like that? He saw America as a shining city on a hill; Donald Trump calls it a divided crime scene. He's not offering any real policies or plans, just offering division and offering fear. And he's betting that if he scares enough people he might just scare up enough votes to win this election.\n\nOBAMA:\n\nLook, I believe Americans are not a fearful people. We don't look for being ruled. Our power comes from those ideals first put in to place right here in Philadelphia, that all of us are created equal, that we the people can form a more perfect union. We believe in democracy, that's what we believe in. And we don't believe that one person is going to do it for us. It's what we can do together, achieve by us.\n\nAnd yes, it's hard and slow and sometimes frustrating to persuade people and work with people and form coalitions, but that's the necessary work of self government, and that's what Hillary Clinton understands, because she's been through it.\n\nShe knows that in a Democracy, in a big, diverse country like this one, it doesn't work if we just demonize each other and call each other names. She knows that love trumps hate.\n\n(APPLAUSE)\n\nShe knows that most issues aren't just black and white, and that you've got to compromise to get things done, even when you're 100 percent right. And she knows that for progress to happen, we have to listen to each other.\n\nAnd we have to see ourselves and each other, and we've got to fight for our principles, but also fight to find common ground. And you know, these days, our politics doesn't always lend itself to those ideas.\n\nWe get impatient. We want our progress right away, and we don't want to have to compromise, and we don't want to have to listen to other folks. But I promise you, when we stay at it, progress does happen.\n\nAnd if you don't believe it, ask the 20 million people who got healthcare today who didn't have it. Ask that marine who served his country without hiding the husband that he loves.\n\nDemocracy works. But here's the thing. We've got somebody who fainted, this is what happens. They'll be OK. Just give them a little room. Everybody bend their knees one time. Just don't lock your knees. Keep on bending them a little bit. We'll do a little exercise right now.\n\nEMS, folks, they're right in front, if you can find somebody. Drink some water. I love you too, but bend your knees.\n\nBut listen. Listen to this. You've got to want it. You've got to want Democracy. Not just on election day, but all the days in between. And this is where you come in. We can close the inequality gap in our economy.\n\nHillary has got plans to make sure everybody has a shot, not just those at the top. But you've got to help her by voting for Democrats up and down the ticket. We've got to get a Congress back, and we've got to hold everybody we elect accountable for getting the job done.\n\nWe can reform our criminal justice system, buy you've got to vote. Not just for president, but for mayors and sheriffs and state attorneys and state legislators. We've got to work with police and protesters (ph) until laws and practices are changed.\n\nWe can fix our broken immigration system, but we can't keep on sending Republicans to Congress who stand in the way. We've got to vote for leaders who see immigrants not as criminals or rapists, but as families who came here the same reason ours did, to work and to study and to contribute.\n\nWe need leaders in Congress who know the American dream is not something that a wall can contain. We can keep making progress against climate change. This month was the hottest on record. This year is going to end up being the hottest on record. This is not somebody's imagination. This is not some liberal plot. It's a problem.\n\nBut we've got to vote for people who actually understand that it's real. And we've got to engage not just young people on college campuses, but also single moms who are worried about gas prices, coal miners who are worried about providing for their kids, and Hillary's got real plans to do that.\n\nAnd if you don't think the stakes are high enough, just remember that for months now, the Republicans in the Senate have refused to do their job and fill a vacancy for the Supreme Court.\n\n(APPLAUSE)\n\nOBAMA:\n\nEven though I nominated somebody with more federal judicial experience than any nominee in history, they want to see Donald Trump fill it with somebody who sees the world as he does. Imagine that. Who will that person be? The Supreme Court should be above politics. The people on the bench make monumental decisions that affect every aspect of our daily lives, from a woman's right to choose, to your right to vote.\n\n(APPLAUSE)\n\nSo my most important message is, we cannot take this election for granted. We've got to fight for this thing. There are serious issues at stake in this election. Behind all the frivolous stuff that gets covered every day.\n\nAnd -- and let me just -- let me just make a comment about that. Because, I -- look, I'm not running this time, but I sure do get frustrated with the way this campaign is covered. I -- I'm just telling the truth. Guys in the back, I'm just telling you the truth about how I feel about this. Do you mind if I just vent for a second?\n\n(APPLAUSE)\n\nYou know, the -- you don't grade the presidency on a curve. This is serious business. And when we see folks talking about transparency -- you want to debate transparency? You've got one candidate in this race who's released decades worth of her tax returns. The other candidate is the first in decades who refuses to release any at all.\n\n(BOOING)\n\nYou want to debate foundations and charities? One candidate's family foundation has saved countless lives around the world. The other candidate's foundation took money, other people gave to his charity, and then bought a six-foot-tall painting of himself.\n\nI mean, you know, he had the taste not to go for the 10-foot version, but...\n\n(LAUGHTER)\n\nYou want to debate who's more fit to be our president? One candidate who's traveled to more countries than any secretary of state ever has, has more qualifications than pretty much anyone who's ever run for this job, and the other, who isn't fit in any way, shape, or form to represent this country abroad and be its commander-in-chief.\n\n(APPLAUSE)\n\nSo somehow, as things go on, because we become so partisan, our standards for what's normal have changed. And Donald Trump says stuff every day that used to be considered as disqualifying for being president. And yet because he said it over and over again, the press just gives up, and they say, well yes, you know, OK.\n\nThey just -- I was opposed to the war in Iraq. Well, actually, he wasn't, but they just accept it. So -- so the bottom line is -- is that that we cannot afford, suddenly, to treat this like a reality show. We can't afford to act as if there's some equivalence here.\n\nTo be president, you have to do your homework, and you have to know what you're talking about, and you've got to apply steady judgment, even when things don't go your way, and you've got to make the tough calls even when they're not popular.\n\nEven when they take years to pay off. And you've got to be able to handle criticism without taking it personally. Just brush it off, and then go ahead and get the job done.\n\n(APPLAUSE)\n\nOBAMA:\n\nAnd that's something I learned. And that's what Hillary learned, as a senator and as a secretary of state, and as a first lady. And yes, she's got her share of critics just like I do, and she's been caricatured by the right, and sometimes by the left, and she's been accused of everything you can imagine, and has been subjected to more scrutiny and what I believe is more unfair criticism, than anybody out here.\n\nAnd she doesn't complain about it and you know what, that's what happens when you're under the microscope for 40 years. But, what sets Hillary apart is that through it all she just keeps on going and she doesn't stop caring and she doesn't stop trying and she never stops fighting for us even if we haven't always appreciated it.\n\nAnd look I understand, we're a young country, we are a restless country. We always like the new shiny thing. I benefited from that when I was a candidate, and we take for granted sometimes what is steady and true. And Hillary Clinton is steady and she is true. And the young people who are here, who all you've been seeing is just the nonsense that's been on TV, you maybe don't remember all the work that she has had to do and all the things that she has had to overcome, and all the good that has happened because of her effects.\n\nBut you need to remember, you need to understand this, if you're serious about our democracy then you've got to be with her. She's in the arena and you can't leave her in there by herself, you've got to get in there with her. You can't stay home because, you know, she's been around for a long time. Well you know what, this is not reality TV. Democracy is not a spectator sport. You don't tweet in your vote.\n\nAmerica is not about yes he will it's about yes we can, yes we can, yes we can create more good jobs. Yes we can create better schools. Yes we can create safer streets. Yes we can create a more secure world.\n\nAUDIENCE:\n\nYes we can! Yes we can! Yes we can!\n\nOBAMA:\n\nWe can bring about real change and real progress and the time has come for me to pass the baton on, but I know that Hillary is going to take it and she's going to run that race and she will finish that race and that's why I'm with her, that's why I'm fired up, that's why I'm ready to go. And I need you to join me.\n\n(APPLAUSE)\n\nI need you to work as hard for Hillary as you did for me. I need you to knock on doors, I need you to make phone calls, you've got to talk to your friends including your Republican friends. You need to go to iwillvote.com and register to vote by October 11th, then you've got to go to the polls and you've got to get people to go to the polls. And if you're willing to do that with me we'll win in November. We'll elect Hillary Clinton, the next President of the United States.\n\nWe will continue on this journey to create a better America and a fairer America, a more just America, a more loving America, a brighter America. That's what we're fighting for, that's why I need you, let's get busy, let's get to work. Thank you Philadelphia, God bless you. God bless these United States of America. Come on.\n\nPRESIDENT BARACK OBAMA", "images": ["http://www.cq.com/images/cq-logo-white-new.png", "http://www.cq.com/versioned/MjAyMjA5MTZfMTYyNTIwMjQ0/images/app-icon.png"], "top_img": "http://www.cq.com/versioned/MjAyMjA5MTZfMTYyNTIwMjQ0/images/app-icon.png", "keywords": [], "authors": [], "canonical_link": "", "title": "President Barack Obama Delivers Remarks at Hillary for America Campaign Event in Philadelphia, as Released by the White House", "meta_data": {"build-version": "unknown-TAG", "build-time": "unknown-1664650876993", "viewport": "initial-scale=1", "apple-itunes-app": "app-id=1022591312"}, "movies": [], "publish_date": null, "source": "http://www.cq.com", "summary": ""}