{"url": "https://www.celebritynetworth.com/richest-celebrities/authors/meghan-mccain-net-worth/", "text": "Meghan McCain Net Worth and Salary: Meghan McCain is an American writer and television personality who has a net worth of $10 million. Meghan is the daughter of late United States Senator and former presidential candidate John McCain and businesswoman Cindy McCain. She first gained attention with her blog, \"McCain Blogette,\" in 2007, and she began writing for \"The Daily Beast,\" a website devoted to pop culture and politics, in 2009. McCain served as a co-host on the Fox News talk show \"Outnumbered\" from 2016 to 2017, and she joined ABC's \"The View\" as a co-host in October 2017.\n\nMeghan has earned three Daytime Emmy nominations with her \"The View\" co-hosts: two for Outstanding Entertainment Talk Show Host and one for Outstanding Informative Talk Show Host. McCain signed a six-figure deal with Hyperion Books in 2009 and published \"Dirty Sexy Politics\" the following year. She also released \"My Dad, John McCain\" in 2008 and \"America, You Sexy Bitch: A Love Letter to Freedom\" (which she co-wrote with comedian Michael Ian Black) in 2012.\n\nIn July 2021 Megan announced she was stepping down from \"The View.\"\n\nEarly Life: Meghan McCain was born Meghan Marguerite McCain on October 23, 1984, in Phoenix, Arizona. She grew up with father John, mother Cindy, and younger siblings John IV, James, and Bridget (who was adopted by the family after Cindy visited a Bangladeshi orphanage). Meghan studied at Phoenix Country Day School and Xavier College Preparatory before attending Columbia College of Columbia University. McCain graduated with a bachelor's degree in art history in 2007 and interned at \"Saturday Night Live\" and \"Newsweek.\"\n\nCareer: In 2007, Meghan began documenting John's presidential campaign on \"McCain Blogette,\" as well as writing about pop culture and fashion. In September 2008, she released \"My Dad, John McCain,\" a children's book about her dad's military service and presidential aspirations. The book became a bestseller, and a portion of the proceeds were donated to the Intrepid Fallen Heroes Fund. Meghan began contributing to \"The Daily Beast\" in early 2009, and the following year, she released her political memoir \"Dirty Sexy Politics.\" Around this time, she also began appearing on \"The View\" as a guest co-host.\n\nIn 2011, McCain and Michael Ian Black spent a month traveling across America in an RV, leading to the book \"America, You Sexy Bitch: A Love Letter to Freedom.\" That year, she also began appearing as an analyst on MSNBC, and in 2013, she got her own talk show, \"Raising McCain,\" on the Pivot channel. The show ran from September 2013 until January 2014, then Meghan joined Pivot's \"TakePart Live\" in May. In July 2015, McCain became a Fox News contributor, and she began regularly co-hosting \"Outnumbered\" on the network in November 2016. In 2015, she played herself on an episode of the Showtime series \"House of Lies,\" and she was named a permanent co-host of \"The View\" in September 2017. In August 2019, audiobook platform Audible announced that Meghan would be writing and narrating an audiobook about conservatism to be released as an Audible Original.\n\nPersonal Life: Meghan married writer Ben Domenech on November 21, 2017, at her family Sedona ranch. The couple welcomed daughter Liberty on September 28, 2020. In July 2019, McCain revealed that she had previously suffered a miscarriage and wrote about the tragic experience in a \"New York Times\" piece entitled \"What I Learned From My Miscarriage.\" Meghan was very close to her father, and sadly, Senator McCain passed away from brain cancer in 2018; in her eulogy, McCain called her father's death the \"passing of American greatness.\"\n\nMeghan registered as an independent at the age of 18, and though she changed her political affiliation to Republican in 2008, she is supportive of gay rights and in favor of same-sex marriage. In 2014, GLAAD (Gay & Lesbian Alliance Against Defamation) appointed McCain to their National Board of Directors, and she was nominated for a GLAAD Media Award for Outstanding Talk Show Episode for \"Raising McCain.\" In 2019, she was honored with the Harvey Milk Foundation Lilla Watson Medal for her work as an LGBT rights advocate, and in 2015, she co-hosted the Concert for Love and Acceptance, a charity event put on by GLAAD and country singer Ty Herndon in Nashville.", "images": ["https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://vz.cnwimg.com/wp-content/uploads/2014/11/GettyImages-497080556.jpg"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2014/11/GettyImages-497080556.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/authors/meghan-mccain-net-worth/", "title": "Meghan McCain Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Meghan McCain Net Worth and Salary: Meghan McCain is an American writer and television personality who has a net worth of", "cnw_share_fb_count": 95, "cnw_share_tw_count": 27, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Meghan McCain Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/authors/meghan-mccain-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2014/11/GettyImages-497080556.jpg", "site_name": "Celebrity Net Worth", "description": "Meghan McCain Net Worth and Salary: Meghan McCain is an American writer and television personality who has a net worth of"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2021-07-15T21:46:30+00:00", "published_time": "2020-09-10T17:48:15+00:00", "section": "Authors", "tag": "meghan mccain worth"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2014/11/GettyImages-497080556.jpg", "title": "Meghan McCain Net Worth", "description": "Meghan McCain Net Worth and Salary: Meghan McCain is an American writer and television personality who has a net worth of"}}, "movies": [], "publish_date": 1599760095.0, "source": "https://www.celebritynetworth.com", "summary": ""}