{"url": "https://www.sheknows.com/beauty-and-style/articles/1080324/best-and-worst-hair-removal-techniques-for-skin", "text": "The warm weather does wonders for our souls, but we could certainly do without the extra time it takes to shave, wax and laser off every exposed hair on our bodies. Before you reach for that razor, make sure your preferred hair-removal technique is also kind to your skin.\n\nBecause there’s no point in removing unwanted hair if it’s only going to expose skin that we’re damaging in the process, it’s high time we find out, once and for all, whether we should be shaving, waxing, getting electrolysis treatments — or none of the above.\n\nWe spoke with Dr. Diane De Fiori, consultant and research dermatologist with the Rosacea Treatment Clinic, and esthetician Felicia Alva of Flutter Beauty, and got the scoop on the best and worst ways we can remove hair on our legs, bodies and faces.\n\nHere they are, ranked from worst to best.\n\nMore: The 20 Most Game-Changing Beauty Products of 2018 so Far\n\n7. Shaving\n\nThe easiest, and one of the cheapest, methods we rely on is also one that can leave our skin bumpy, stubbly and even bloody.\n\n“Because the razor cuts the hair at an angle, it has a tendency to regrow inward (causing ingrown hairs), particularly if hair is curly,” De Fiori said. “The result is bumpy and inflamed, infected skin which will not resolve until the ingrown hair is removed.”\n\nDe Fiori adds that possible complications from shaving can include scarring, breaking fine capillaries when removing the hair and permanent dark marks (hyperpigmentation) after healing has completed. One possible benefit? “The razor itself does have a moderate exfoliating effect, removing dead surface skin cells as you shave, which leaves skin smoother.”\n\n6. Hair-removal creams\n\nProducts like Veet and other hair-removal creams are similar to permanent solutions, according to De Fiori, and can dissolve hair at the skin level. Because the hair remains in the follicle and is burned away evenly, there is less chance that ingrown hairs will develop. Sounds great, right? Hold that thought.\n\n“The main risk with these products is chemical burns because they are strongly alkaline,” De Fiori said. “A burn is more likely if you leave the product on for longer than directed on the packaging. Some hair types are not removed effectively within the directed timeframe for use therefore patients will leave them on longer. By the time the hair is dissolved the skin is also burnt.”\n\nKnow your skin — if it’s sensitive, it may be best to stay away from these creams. And, if you do use them, make sure you’re removing them thoroughly or you risk developing a “slow burn.” Ouch!\n\n5. Electrolysis\n\nDe Fiori says electrolysis has pretty much been replaced by lasers, which are “faster and more efficacious.” If you’re still devoted to this method, be aware that risks include “scarring, infection and hyperpigmentation.”\n\n4. Threading\n\nA lot of women are opting to have their eyebrows and/or the little annoying hairs on their faces removed using threading instead of waxing or shaving. De Fiori says this is the method least likely to damage skin, as it is gentler on skin than tweezing, but it has a major downside: It’s only feasible for use on small areas of the skin. Unless, I guess, you’re one of few women who love torture and can deal with the insane pain of getting your legs threaded (we won’t judge you).\n\nMore: 5 Summer Skin Care Tips Black Women Should Keep in Mind\n\n3. Waxing\n\nBoth De Fiori and Alva are in agreement about waxing, especially when it comes to the eyebrow area: It can cause major skin damage.\n\n“Waxing removes a top layer of skin every time you use it,” Alva said, adding that the thin, delicate skin around the eyes has no oil glands and requires as gentle a method as possible. “It’s OK on the body, but it’s too rough on skin in the eye area.”\n\nAlva recommends tweezing, which gives an esthetician more control over your brows and gives you a fuller, more natural brow.\n\nDe Fiori cautions women with rosacea and other inflammatory skin disorders, such as psoriasis and eczema, to avoid waxing altogether because, although it weakens hair growth, it causes hair growth to actually accelerate during the first three to six months, which increases the need to wax more and can lead to hyperpigmentation.\n\n2. Eflornithine hydrochloride cream\n\nWomen who feel they have been plagued by little chin hairs or thick facial hair can now benefit from this effective, but costly, prescription product. After approximately two months of twice daily use, the cream slows down hair growth, according to De Fiori.\n\n“Some possible, more common side effects are temporary redness, stinging, rash or folliculitis (inflamed, bumpy hair follicles),” De Fiori said. “This is a rather expensive product, however it is FDA approved and reduces the need for other hair-removal methods.”\n\n1. Laser treatments\n\nDing, ding, ding — I think we have a winner!\n\nDe Fiori says that, although older lasers can damage darker skin tones and weren’t effective on very light hair, modern lasers can be used to treat an individual’s skin and hair type.\n\nAfter a treatment, hair remains in the skin, but will fall out after four to eight days. And how is this for an incredible added bonus: Depending on the laser used, you may even experience some skin rejuvenation due to the formation of new collagen. A method that removes hair and can fight fine lines? Yes, please.\n\nSo, let’s review\n\nModern lasers are De Fiori’s preferred method, shaving beats out depilatory creams, waxing should only be used on skin types that do not have a history of reacting to it, and a killer, long-lasting combo worth trying on facial hair: threading and eflornithine hydrochloride cream.\n\nAdios, unwanted hair!\n\nA version of this article was originally published in August 2015.", "images": ["https://www.sheknows.com/wp-content/uploads/2018/08/qkxscjvfoxyimug2vgwb.jpeg", "https://www.sheknows.com/wp-content/uploads/2018/08/wied3icbndgxukiyimq4.jpeg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://trc.taboola.com/1394147/log/3/unip?en=page_view", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.sheknows.com/wp-content/uploads/2022/09/BCA-issue-module.gif", "https://www.sheknows.com/wp-content/uploads/2018/08/wied3icbndgxukiyimq4.jpeg?w=1920", "https://www.facebook.com/tr?id=754209411294316&ev=PageView&noscript=1", "https://www.sheknows.com/wp-content/themes/vip/pmc-sheknows-2020/assets/public/lazyload-fallback.gif"], "top_img": "https://www.sheknows.com/wp-content/uploads/2018/08/wied3icbndgxukiyimq4.jpeg?w=1024", "keywords": [], "authors": ["Lisa Fogarty"], "canonical_link": "https://www.sheknows.com/living/articles/1080324/best-and-worst-hair-removal-techniques-for-skin/", "title": "The Best & Worst Hair-Removal Techniques – SheKnows", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Before you reach for that razor, make sure your preferred hair-removal technique is also kind to your skin.", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Lisa Fogarty", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "SheKnows", "application-name": "SheKnows", "content_type": "Article", "post_id": 1080324, "title": "The Best & Worst Hair-Removal Techniques", "published_at": "2018-08-02 12:40:00", "image": "https://www.sheknows.com/wp-content/uploads/2018/08/wied3icbndgxukiyimq4.jpeg?w=1024", "comment_count": 0, "tags": "waxing", "topics": "Living", "body": "The warm weather does wonders for our souls, but we could certainly do without the extra time it takes to shave, wax and laser off every exposed hair on our bodies. Before you reach for that razor, make sure your preferred hair-removal technique is also kind to your skin.\n\nBecause there's no point in removing unwanted hair if it's only going to expose skin that we're damaging in the process, it's high time we find out, once and for all, whether we should be shaving, waxing, getting electrolysis treatments — or none of the above.\n\nWe spoke with Dr. Diane De Fiori, consultant and research dermatologist with the Rosacea Treatment Clinic, and esthetician Felicia Alva of Flutter Beauty, and got the scoop on the best and worst ways we can remove hair on our legs, bodies and faces.\n\nHere they are, ranked from worst to best.\n\nMore: The 20 Most Game-Changing Beauty Products of 2018 so Far\n7. ShavingThe easiest, and one of the cheapest, methods we rely on is also one that can leave our skin bumpy, stubbly and even bloody. \n\n\"Because the razor cuts the hair at an angle, it has a tendency to regrow inward (causing ingrown hairs), particularly if hair is curly,\" De Fiori said. \"The result is bumpy and inflamed, infected skin which will not resolve until the ingrown hair is removed.\"\n\nDe Fiori adds that possible complications from shaving can include scarring, breaking fine capillaries when removing the hair and permanent dark marks (hyperpigmentation) after healing has completed. One possible benefit? \"The razor itself does have a moderate exfoliating effect, removing dead surface skin cells as you shave, which leaves skin smoother.\"\n6. Hair-removal creamsProducts like Veet and other hair-removal creams are similar to permanent solutions, according to De Fiori, and can dissolve hair at the skin level. Because the hair remains in the follicle and is burned away evenly, there is less chance that ingrown hairs will develop. Sounds great, right? Hold that thought. \n\n\"The main risk with these products is chemical burns because they are strongly alkaline,\" De Fiori said. \"A burn is more likely if you leave the product on for longer than directed on the packaging. Some hair types are not removed effectively within the directed timeframe for use therefore patients will leave them on longer. By the time the hair is dissolved the skin is also burnt.\" \n\nKnow your skin — if it's sensitive, it may be best to stay away from these creams. And, if you do use them, make sure you're removing them thoroughly or you risk developing a \"slow burn.\" Ouch!\n5. ElectrolysisDe Fiori says electrolysis has pretty much been replaced by lasers, which are \"faster and more efficacious.\" If you're still devoted to this method, be aware that risks include \"scarring, infection and hyperpigmentation.\"\n4. ThreadingA lot of women are opting to have their eyebrows and/or the little annoying hairs on their faces removed using threading instead of waxing or shaving. De Fiori says this is the method least likely to damage skin, as it is gentler on skin than tweezing, but it has a major downside: It's only feasible for use on small areas of the skin. Unless, I guess, you're one of few women who love torture and can deal with the insane pain of getting your legs threaded (we won't judge you).\n\nMore: 5 Summer Skin Care Tips Black Women Should Keep in Mind\n3. WaxingBoth De Fiori and Alva are in agreement about waxing, especially when it comes to the eyebrow area: It can cause major skin damage. \n\n\"Waxing removes a top layer of skin every time you use it,\" Alva said, adding that the thin, delicate skin around the eyes has no oil glands and requires as gentle a method as possible. \"It's OK on the body, but it's too rough on skin in the eye area.\" \n\nAlva recommends tweezing, which gives an esthetician more control over your brows and gives you a fuller, more natural brow.\n\nDe Fiori cautions women with rosacea and other inflammatory skin disorders, such as psoriasis and eczema, to avoid waxing altogether because, although it weakens hair growth, it causes hair growth to actually accelerate during the first three to six months, which increases the need to wax more and can lead to hyperpigmentation.\n2. Eflornithine hydrochloride creamWomen who feel they have been plagued by little chin hairs or thick facial hair can now benefit from this effective, but costly, prescription product. After approximately two months of twice daily use, the cream slows down hair growth, according to De Fiori. \n\n\"Some possible, more common side effects are temporary redness, stinging, rash or folliculitis (inflamed, bumpy hair follicles),\" De Fiori said. \"This is a rather expensive product, however it is FDA approved and reduces the need for other hair-removal methods.\"\n1. Laser treatmentsDing, ding, ding — I think we have a winner! \n\nDe Fiori says that, although older lasers can damage darker skin tones and weren't effective on very light hair, modern lasers can be used to treat an individual's skin and hair type. \n\nAfter a treatment, hair remains in the skin, but will fall out after four to eight days. And how is this for an incredible added bonus: Depending on the laser used, you may even experience some skin rejuvenation due to the formation of new collagen. A method that removes hair and can fight fine lines? Yes, please.\nSo, let's reviewModern lasers are De Fiori's preferred method, shaving beats out depilatory creams, waxing should only be used on skin types that do not have a history of reacting to it, and a killer, long-lasting combo worth trying on facial hair: threading and eflornithine hydrochloride cream.\n\nAdios, unwanted hair!\n\nA version of this article was originally published in August 2015.", "fb": {"pages": 111589138109}, "onesignal": "wordpress-plugin", "og": {"type": "article", "title": "The Best & Absolute Worst Hair-Removal Techniques", "url": "https://www.sheknows.com/living/articles/1080324/best-and-worst-hair-removal-techniques-for-skin/", "description": "Before you reach for that razor, make sure your preferred hair-removal technique is also kind to your skin.", "site_name": "SheKnows", "image": {"identifier": "https://www.sheknows.com/wp-content/uploads/2018/08/wied3icbndgxukiyimq4.jpeg?w=1024", "width": 1024, "height": 576, "alt": "Woman shaving legs pink and red background"}, "locale": "en_US"}, "article": {"published_time": "2018-08-02T16:40:00+00:00", "modified_time": "2018-08-02T16:40:46+00:00"}, "twitter": {"site": "@sheknows", "creator": "@https://twitter.com/lisacfogarty", "card": "summary_large_image", "title": "The Best & Absolute Worst Hair-Removal Techniques", "description": "Before you reach for that razor, make sure your preferred hair-removal technique is also kind to your skin.", "image": "https://www.sheknows.com/wp-content/uploads/2018/08/wied3icbndgxukiyimq4.jpeg?w=1024", "text": {"title": "The Best & Absolute Worst Hair-Removal Techniques"}}, "msapplication-TileImage": "https://www.sheknows.com/wp-content/uploads/2020/07/cropped-sk-fav-icon.png?w=270"}, "movies": [], "publish_date": 1533228000.0, "source": "https://www.sheknows.com", "summary": ""}