{"url": "https://www.shape.com/celebrities/star-trainers/trainers-reveal-motivational-mantras-get-results", "text": "01 of 23 Give Yourself a Break Westend61/Getty \"The key to weight-loss motivation is similar to the [amount of] fuel in a car — you don't need the motivation tank to be full to drive, you just need to prevent it from running empty,\" says Joshua C. Klapow, Ph.D., a clinical psychologist at the University of Alabama at Birmingham and author of Living SMART: 5 Essential Skills to Change Your Health Habits Forever. \"I tell people not to waste precious time and energy on staying highly motivated because it has a natural rhythm. Most people see a drop in motivation as a signal of failure, but it's not,\" he says. If you notice that your weight-loss motivation is waning, give yourself a break from your diet or exercise plan for one to three days, says Klapow. \"The more people try to ‘catch' it, the more elusive it becomes; by allowing it to run its natural course and at the same time having a set of habit-changing skills (such as a meal plan for the week), you'll stay on track and your motivation levels will run their natural course.\" (Start with this 40-day plan to conquer any goal.)\n\n02 of 23 Quiz Yourself Deborah Kolb/Shutterstock Need an instant dose of weight-loss motivation? Take this quick, healthy-habit quiz. While \"diet\" is the example, feel free to plug in any behavior that you're trying to maintain. \"Answering these questions often helps to boost motivation just enough to remind you of why you started the diet in the first place,\" says Klapow. If I stop my diet, how will I feel in six months or one year from now?\n\nIf I stop my diet, what will my health be like?\n\nIf I stop my diet, how will my family and friends be affected?\n\n03 of 23 Choose an Attainable Goal John Fedele/Getty \"Studies show that most dieters expect to lose as much as four times what they really can in a six-month period,\" says Daniel C. Stettner, Ph.D., a behavioral-medicine specialist at Northpointe Health Center in Berkley, Michigan. Think smaller: Count on losing just 10 percent of your weight within six months, and focus on keeping it off for more than a year. But be careful about relying solely on figures. \"A number on the scale isn't a goal; it's a measurement of success,\" says Bonnie Goodman, a psychotherapist based in Fort Lauderdale, Florida, who specializes in behavioral therapy. Instead, focus on behaviors you wish to change: to reduce your daily fat intake to below 35 percent, or to cut out your afternoon soda or vending-machine snack. Also, consider setting non-weight-related goals, such as entering a 5K race. The pounds you'll automatically lose in the process will seem like a bonus — and may even act as a little weight-loss encouragement.\n\n04 of 23 Design Your Own Plan Kseniia Perminova/Shutterstock Rather than trying every new diet fad, create your own plan that will fit your lifestyle. In theory, you need to cut out only 150 calories a day to lose 15 pounds in a year, so start small to have a better chance at maintaining your weight loss motivation. \"Little changes to your current eating style, such as downsizing portions or preparing foods differently, can add up to big results,\" says Stettner. Think about the foods you can — and can't — live without (ahem, tasty chocolate recipes), then try to work your diet around them. If you're a born snacker, divide your daily calories into six or seven mini meals so you always feel like you're having a nibble. Whatever you do, don't give up your favorite foods. You'll inevitably feel deprived, which will only make your cravings stronger — and your willpower weaker. ( Why the 80/20 Rule Is an Awesome Way to Find Dietary Balance\n\n05 of 23 Then Build Your \"Business Plan\" Jacob Lund/Shutterstock Any successful venture requires a plan that describes its mission and specifics on how to achieve it — without one, you have no idea where you're starting, where you're going, or how you'll get there, says Jenn Walters, a certified personal trainer and co-founder of Fit Bottomed Girls. Treat your goal as a business objective; If you were trying to accomplish something for a client, you probably wouldn't start out without a strategy. Losing weight is a three-part process: Exercising and cutting calories are vital, but your mental outlook can mean the difference between success and failure. Start by listing all the reasons you can think of for slimming down — in other words, define your weight-loss motivation on paper. Highlight any that include other people. Rewrite the list, omitting the highlighted items. Next, inspect each one for phrases like \"have to\" or \"must.\" Such words imply obligation, not desire; eventually, they'll also invite the instinct to rebel (and, thus, weaken your weight-loss motivation). Translate each \"have to\" into a \"want to.\" If your reasons lose their relevance, pare down the list again, until you find two or three of the most compelling motivations to reach your goal. ( These Three Words Are Making You More Negative Once you've determined exactly what you want to achieve and your deadline, work backward to create a monthly plan of action with realistic and specific goals for losing weight (such as committing to healthy snacking).\n\n06 of 23 Clean Out Your Closet Mostovyi Sergii Igorevich/Shutterstock If you're struggling to stick with your weight-loss motivation, practice integrity in other areas of your life, suggests Andre Farnell, a certified strength and conditioning coach and owner of Better Body Expert. Clean out your closet (hi, Marie Kondo!), pay off your debts, make good on your promises to friends, family, or co-workers. Practice sticking with promises or commitments you've made in other areas of your life in order to strengthen your own subconscious belief that you are able to uphold the promise to lose weight that you've made to yourself, says Farnell.\n\n07 of 23 Steer Clear of Comparisons Luis Alvarez/Getty Pinning and posting pictures of super-thin models may seem like good weight-loss motivation, but according to research, it's more likely to hurt your progress. Scientists in the Netherlands divided women who wanted to lose weight into two groups: the first group was given a food journal with photos of thin models on the cover and interior pages, and the second group was given a journal with a neutral logo image on the front. While the neutral group lost weight, those given the journals sprinkled with supermodel images gained weight. (BTW, food journaling is a really effective weight loss tool.) The researchers say that the images of models discouraged the women by creating unrealistic self-standards. Staring at photos of much-thinner women while logging food intake may have made them feel like they'd never be able to achieve that look, so they stopped trying. Instead of comparing yourself to unrealistic fashion models, stay inspired by posting images of you at your healthiest for a serious dose of weight-loss inspiration.\n\n08 of 23 Focus On a Feeling nd3000/Shutterstock Too often we get frustrated by focusing on a specific number on the scale, or even a task we must do to reach our goal (such as working out), which is a pretty quick way to zap your zest, says Simon Rego, Ph.D., director of psychology training at Montefiore Medical Center/Albert Einstein College of Medicine in New York. Concentrate on your mood after you've eaten a healthy meal or how you feel after a great workout — weight-loss motivation doesn't always have to come before an activity, says Rego. \"If you focus on how you feel each time you exercise, you'll get all the benefits of burning calories, plus the reinforcement of remembering how good it felt to do it, which should increase your motivation to do more.\" ( How to Speed Up Your Metabolism By Boosting Your Mood\n\n09 of 23 Plant a Carrot Halfway baranq/Shutterstock Rewarding yourself for reaching your goals is a great idea, but some undertakings can take months or even years to achieve, so you risk knocking the wind out of your sails before you even get close. Instead of waiting until you've reached the big finish line to reward yourself for weight loss, plan something really amazing once you've reached your halfway point (such as a trip to that spa in the Bahamas — and focus on traveling healthier), suggests Susan Bartell, Psy.D., a psychologist and motivational speaker. You'll be less likely to throw in the towel when things get tough around that midpoint marker. \"Rewards reinforce positive behavior, but only if they're meaningful,\" says Goodman. \"When you reach a milestone in your weight-loss or exercise routine, treat yourself to something that celebrates the particular goal you achieved and helps further your progress.\" If you don’t want to wait until halftime to give yourself a high five for maintaining your weight-loss motivation, start small. Logging an extra mile a week on the treadmill? Invest in a pair of top-of-the-line running shoes after a month. Or once you've reached an important weight benchmark, treat yourself to a new pair of leggings.\n\n10 of 23 Act \"As If\" mimagephotography/Shutterstock Don't wait \"until you lose the weight\" to take that vacation, visit that old friend, or try that dance class; live out your goals now, and enjoy them along the way, says Stephanie Merchant, a certified health and lifestyle coach. Imagine you are already at your goal weight. (Here’s how to know if/when you’re there.) How do you feel? What would you eat? What would you drink? How would your day look? What are you putting off doing until you reach that goal? Schedule it now and shift your mindset from \"punishment mode\" to a rewarding and empowering one to maintain weight-loss motivation, she says.\n\n11 of 23 Hang Your Motivation By the Mirror g-stockstudio/Shutterstock Putting a special piece of your wardrobe on display is a great daily weight-loss inspiration. Pick something you'll look forward to wearing and hang it close to your mirror. \"I visualize myself wearing it and think about how good I will feel,\" says Marie-Pier Ouellet, a student in Montreal, Canada. Since it's an item you already own or plan to wear, it's much less likely to be an unrealistic goal (when compared to say, that photo of Gisele Bundchen in a bikini) and will help spike your weight-loss motivation to keep hitting the gym.\n\n12 of 23 Give Yourself Some Tough Love Flamingo Images/Shutterstock Yes, picturing yourself with your goal physique can be motivating, but for some people, imagining what might happen to you if you don't lose weight can be even more inspiring. \"I ask my clients what their lives will be like in five, 10, or even 20 years from now if they stay on the same path that they are currently on,\" says Matthew Richter-Sand, an Air Force veteran, personal trainer, and founder of NX Fit. \"I make them imagine how badly they will feel and how much they've missed out on in life — it's absolutely critical that they're honest with themselves at this point. It's too easy to sugarcoat things and pretend like it's okay. It's not okay!\"\n\n13 of 23 Get Competitive Jacob Lund/Shutterstock When it comes to losing weight, a little competition goes a long way. Social influence of team-based weight-loss competitions can help you lose up to 20 percent more weight than you would if you did it alone, according to a study published in the journal Obesity. Even more interesting is that team captains shed more weight than team members, which the researchers explain is likely due to their position and involvement in the group competition. So next time you find yourself wondering how to stay motivated to lose weight, remember to recruit a group of friends or coworkers and lead your team to victory! ( How Embracing My Competitive Streak Helped Me To Stop Hiding My Achievements\n\n14 of 23 Clarify Your \"Why\" VGstockstudio/Shutterstock If you're really going to stay motivated to lose weight, the first thing you need to do is determine what actually motivates you, says Anne Dranitsaris, Ph.D., author of Who Are You Meant to Be? For example, if you're inspired by your family, focus on how exercising will help you remain in your children's lives well into your old age, she says. Take it one step further by getting your family involved — play tag with the kids, hit the gym with your partner, cook healthy meals for the coming week together on weekends. \"In order to change your patterns of behavior, you first have to recognize your patterns and why they exist. If you can redirect that healthy weight-loss motivation into a new action, your goal will automatically seem more compelling and achievable.\" (Just take it from these super impressive women, many of whom credit their families for providing tons of weight-loss encouragement and inspiration.)\n\n15 of 23 Uncover Emotional Obstacles Monkey Business Images/Shutterstock Sadness and anger are two of the most common reasons people overeat, but food won't quell either one. Your diary can provide valuable insights into what may be causing you to binge occasionally. Once you start evaluating your eating triggers, you'll be able to develop more effective strategies to deal with the underlying emotions. Keep in mind, too, that the very act of committing to a diet plan can bring its own challenges. \"Fear of change is a particularly formidable enemy,\" says Jeffrey Wilbert, Ph.D., author of Fattitudes: Beat Self-Defeat and Win Your War with Weight. \"Altering your lifestyle involves taking a risk, and that can dredge up insecurity.\" As your body changes, so will the way others perceive you, which can be unnerving. The best way to combat any type of fear is to face it head-on. Keep reminding yourself that every change you make brings you one step closer to becoming a bolder, more confident woman. Now, that's some serious diet motivation.\n\n16 of 23 Ditch the Daily Weigh-In olegius/shutterstock The scale can be a helpful tool for measuring your progress, but many people get in the habit of weighing themselves too often. \"While some research shows that people manage (maintain) their weight better by weighing in daily, the same can't be said for losing weight,\" says Nicole Nichols, editor and fitness expert for SparkPeople.com. \"Daily weigh-ins, or multiple weigh-ins per day, will only sap your weight-loss motivation with a roller coaster of emotions and can cause you to freak out by temporary up-ticks in the scale that have nothing to do with body mass or body fat,\" she says. Instead, Nichols recommends stepping on the scale once a week — or even every two weeks — to better track your progress. And in the meantime, paying attention to these non-scale victories can provide some serious weight-loss inspiration.)\n\n17 of 23 Instagram Each Day Jacob Lund/Shutterstock You know what they say: a picture is worth a thousand words. Try tracking your progress by creating an Instagram weight-loss diary. Daily photos after, say, a great workout or during a healthy meal can help you document the changes in your body that you may not otherwise notice — and that the scale won't necessarily show. Not a fan of social media? No problem. Instead of posting pictures to a platform, just keep them for yourself and just scroll through them when you need a little boost of weight-loss inspiration. ( 16 Ways to Rekindle Exercise and Weight-Loss Motivation\n\n18 of 23 Silence Your Inner Critic sunok/Shutterstock Unfortunately, many people have a bad habit of using self-criticism as an inspirational tool, especially when it comes to weight-loss motivation, but not only does it not encourage, it could actually sabotage your efforts, says Vanessa Scotto, a life coach specializing in behavioral changes. \"When we kick into self-critical mode, we are actually engaging the portion of our brain that's linked into our fight-flight survival reflex,\" she says. This increases the secretion of cortisol (the \"stress hormone\"), which in turn causes cravings for fatty and sweet foods. Next time you find yourself in critique mode, place your hand on your heart. Just holding it there and taking a few deep breaths can help change your physiological state, silence the negativity, and allow you to look in the mirror and have a fresh experience, she says.\n\n19 of 23 Surround Yourself with Health photopixel/shutterstock Stage your home to reflect the new you, suggests Tara Zimliki, a personal trainer and bootcamp instructor. Stock and organize the fridge with healthy, prepped foods in clear containers, present fruit in beautiful bowls on countertops, get a shoe rack to display your sneakers right by the front door, keep the dirty laundry off exercise equipment, etc. Adjusting your environment to reflect your weight loss and diet intentions can make it that much easier to stay on track, she says. (Stuck wondering how to get motivated to lose weight? Just one look at Khloe Kardasián's organized fridge will definitely deliver some serious diet motivation.)\n\n20 of 23 Turn to Your Smartphone fiskes/Shutterstock With more free weight-loss apps available than ever, instant weight-loss and diet motivation is just a tap away. Whether you can't muster the drive to cook dinner (try a healthy eating app such as BigOven to find recipes based on what's already in your pantry), need a little support (download Fitocracy to team up with a buddy), or you're just looking for a new way to get moving (try Zombies, Run!), there's a great app to help keep your weight-loss motivation mobile.\n\n21 of 23 Recruit Gift Givers progressman/Shutterstock Rewarding yourself with gifts along the way is great in theory but tough in practice — your schedule is already jam-packed! Make it more fun and realistic by getting your friends involved. \"One of the best ideas I ever heard was from a SparkPeople.com member,\" says Nichols. \"She gave several of her friends $20 each to buy her a surprise gift, wrap it and everything. Then for each 10 pounds she lost, she would open one of the gifts purchased by her friends for a really fun and surprising reward along her journey.\"\n\n22 of 23 Set Goals Beyond the Scale solisimages/shutterstock Even if you do everything right, there will be times when the scale won't budge or the weight just doesn't seem to come off as quickly as it should. Don't let that discourage you! Measure your progress in other ways, says Nichols. Set goals for fitness — running or swimming farther, sticking to your routine each day or week — and celebrate each of these mini accomplishments, she says. \"Or set goals for healthy eating, such as packing your lunch for work each day or drinking 64 ounces of water a day, and celebrate reaching these goals.\" Celebrating these new milestones is a great way to maintain your weight-loss motivation and stay inspired to stick with your program, even on days (or weeks) when the scale doesn't seem to reflect your progress.", "images": ["https://www.shape.com/thmb/7da0hsza9uyfGbun4OjPcOJBi4M=/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/group-selfie-weight-loss-motivation-6b16a6ec588a404f885924ff2e3acde3.jpg", "https://www.shape.com/thmb/yyFosOZOWFdDtXabmt7AW0-J_o0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/happy-weight-65f8b9849c26405f9c06d90d4be760a5.jpg", "https://www.shape.com/thmb/Rm08yBOAzvAI2xmJk_wsYhJJVXI=/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/find-your-why-for-weight-loss-motivation-fdeabfd232584dec92e0671def80b08f.jpg", "https://www.shape.com/thmb/pVbrtRcvp26VOlhFlkLs17RUxn0=/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/woman-meditating-on-self-love-for-weight-loss-motivation-9b9cc9a8de824645b22ff91c4fc27ce4.jpg", "https://www.shape.com/thmb/-eWdJxc8ldyK9uXBASShCNkxLCI=/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/woman-swimming-for-weight-loss-motivation-non-scale-goals-9fd22afdff5f4f8e83f4e25d723e98cd.jpg", "https://www.shape.com/thmb/KLH2fBeu-HxeJPql1FVqRvxrc3E=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1119x558:1121x560)/noom-color-coding-food-a20ef9cfdc9a4e39bfe54317723c3971.jpg", "https://www.shape.com/thmb/h1KakiASCepLOhkIMnZy8MvUIEQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/change-running-route_0-31c8502c80284a1297e9968daf884ea2.jpg", "https://www.shape.com/thmb/6AbbiyiJHbrVkrx_Rff9Th1ivQ8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(621x0:623x2)/bulking-promo-f639433213b7480dbc1e8bbb06cf90bc.jpg", "https://www.shape.com/thmb/y8isUGMlZIEPryB2qqCCXK2gUiY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/height-weight-loss-42aab8035b4b4123af2d2e034fed04ba.jpg", "https://www.shape.com/thmb/zub9oiHRDZa4lX2GmkGcm2mN598=/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/woman-doing-yoga-savasana-body-appreciation-weight-loss-motivation-c0b1c25847234df4a721cb6fff948582.jpg", "https://www.shape.com/thmb/n0zWW13Mq9F5psxIRnj983JzEf0=/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/woman-emotional-eating-weight-loss-motivatiohn-8e6ef1015dcd418fb22a9566311cdd80.jpg", "https://www.shape.com/thmb/GUQdgjwHs1gYuzMCEyarvAWf3lg=/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/woman-happy-feeling-like-she-lost-weight-32747e1add48416cb69c08d62915f41a.jpg", "https://www.shape.com/thmb/mteHiS5eEbGYes0SrmA7G0iFPvw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/weight-loss-rules-woman-39ef2108646345bf862e41d5723f291d.jpg", "https://www.shape.com/thmb/Hh_D5fuxv5Mp3VP5DuMiQsksJnQ=/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/gift-giving-incentive-for-weight-loss-motivation-4475899c89b040b5bff9c26341f3972e.jpg", "https://www.shape.com/thmb/aE0fWTNflPAvUI1myMts7GCguEA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(621x0:623x2)/Erica-Lugo-Feature-b1d8dc62f81641ccbbf1004353bec5af.jpg", "https://www.shape.com/thmb/jZtvCponHmyYcOC9t4Vumd5i-9Q=/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/woman-on-assault-fan-bike-tough-love-weight-loss-motivation-6f241e5fab66440aac5a1da1ec43f633.jpg", "https://www.shape.com/thmb/1Crh5oxDCwf561vVbc0xRo_6tKA=/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/woman-carrying-jeans-cleaned-out-closet-8feaa0cc157045bf8bc14aaf068ceca9.jpg", "https://www.shape.com/thmb/Z9G7ifBSwWaAfVqgAu_jypzAyik=/2000x1052/filters:fill(auto,1)/weight-loss-motivation-fb-2000-7e27e3441e3b4887a166adc59703e192.jpg", "https://www.shape.com/thmb/TAVc7KRRt1PypNY8_5OIH0IuW5Y=/1500x2000/filters:no_upscale():max_bytes(150000):strip_icc()/rock-climbing-2000-0b11f6334fea4be89b899e097cf010f4.jpg", "https://www.shape.com/thmb/MLMmX_013pLrcvX1-GA-bt0jkok=/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/woman-getting-massage-as-reward-weight-loss-motivation-d81271c90804412d89cf63ea23f17525.jpg", "https://www.shape.com/thmb/QTLfiRfbQT5Fte9H-MiciJ4TRH4=/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/woman-looking-in-mirror-for-weight-loss-motivation-bc6e9f56b4f34c0e987740e909b3dc34.jpg", "https://www.shape.com/thmb/tVhgRTGH6EdsICMdhjB3g5arsXc=/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/woman-with-business-plan-for-gym-weight-loss-motivation-248d96556ee04cee8335f84d0b2ff589.jpg", "https://www.shape.com/thmb/1eJQ_ZfLSk3BamXnYaBip_eqp0I=/1500x2000/filters:no_upscale():max_bytes(150000):strip_icc()/woman-relaxing-2000-026369a444ea49ef9168e14238d4a5b1.jpg", "https://www.shape.com/thmb/rItYeJv9sOgv1c-hbDoQJmydbyU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():gifv()/weight-loss-motivation-sq-2000-a953ed1926b94673a1050965be4e684a.jpg", "https://www.shape.com/thmb/XQ6LSwq8K6nX0qiTHQTnWO0043o=/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/woman-eating-ice-cream-as-part-of-weight-loss-plan-f90478fa2255454fb6138fcefcdceb58.jpg", "https://www.shape.com/thmb/Th6VZkMdJ6N-5VpkwOucfEy-q7w=/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/get-competitive-to-help-weight-loss-motivation-547aca4d08604de1aa122e60e05c208d.jpg", "https://www.shape.com/thmb/5BJhq77cT4VIZJnlcAH8deG92kM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1039x798:1041x800)/10-Science-Backed-Strategies-to-Lose-Fat-and-Keep-It-Off-GettyImages-668066982-2000-51f668a29d19413b966218984ee8ff6f.jpg", "https://www.shape.com/thmb/pst-4Xx5jDZxQsEL_sZGqaFxAG4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/best-weight-loss-apps-GettyImages-1148661848-1-2000-9c73bc7d16ae4aaa92d950a2824b259d.jpg", "https://www.shape.com/thmb/jzFVjoc7qbEA3C55TFm_posdvZA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1314x0:1316x2)/scales-trash_0-10bf34b03fbf4b6e99ad797f52a3abba.jpg", "https://www.shape.com/thmb/07lt0NTXqxVEn5qrqErmpm9b7V4=/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/fridge-full-of-healthy-foods-as-weight-loss-motivation_0-7ffb2c24b6904c5db9a15caf47b080b3.jpg", "https://www.shape.com/thmb/mo8u0mBR-drp3QOq_08fFb2EpAo=/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/quiz-yourself-on-weight-loss-motivation-a8cd0e367ebc468e916b7a9c4b1ea3ab.jpg", "https://www.shape.com/thmb/GqVfAt3TqzgXOd7zvLMYD_xs_-Q=/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/focus-on-a-feeling-for-weight-loss-success-e5e72fa5c25f4293ad3738bf73021fa3.jpg", "https://www.shape.com/thmb/xDTtHrGaY_uvBIPoWaLc4ODDn7Q=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(309x0:311x2)/6144_0_0-029b322764454cdda2d35acc1e7bce81.jpg", "https://www.shape.com/thmb/jwluAjWCStUbrWZI9zWvh-WslME=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1299x332:1301x334)/How-to-Build-Your-Own-Workout-Routine-for-Weight-Loss-GettyImages-926978500--2000-ee899a511ee64b30bb7ea218c0e7a938.jpg", "https://www.shape.com/thmb/tI4YDvRpm1kIx4fAiM6JuaktiW0=/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/woman-using-smartphone-apps-for-weight-loss-motivation-a7cb58a7d8514693bcbb0f959dbe177e.jpg", "https://www.shape.com/thmb/QmKwRLuihwXGbXiv2uP04BLYJL4=/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/steop-weighing-yourself-for-weight-loss-motivation-d49f5138197e4219b3c1f46822f288a7.jpg", "https://www.shape.com/thmb/uqd-AYVaTuvhX2Y2z_jAsLkmvg8=/1500x2000/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1220404804-2000-1e7195eba92d45849049bd0b46a3dd8c.jpg", "https://www.shape.com/thmb/Zt4kvWEOhz_KgMe6kGt8_xjARkk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/how-to-stay-motivated-to-lose-weight-dietitian-0589be83182f468ab2db0474e3d6ecf8.jpg", "https://www.shape.com/thmb/9y_LxsAb4XR51mCThyvsy8pU0uw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/TEST-2000-cd90c5571e5d4ca8a2bc5ecaf803e664.jpg", "https://www.shape.com/thmb/h_pb-iKVKbhCq1zE92sdu1QATcs=/75x75/filters:no_upscale():max_bytes(150000):strip_icc()/SplitSession1_IMG_6602-077177e8e05d4cfb88f6b142f4d4d410.jpg"], "top_img": "https://www.shape.com/thmb/Z9G7ifBSwWaAfVqgAu_jypzAyik=/2000x1052/filters:fill(auto,1)/weight-loss-motivation-fb-2000-7e27e3441e3b4887a166adc59703e192.jpg", "keywords": [], "authors": ["Jessica Smith", "Jessica Smith Has Been A Personal Trainer", "Fitness Instructor Since", "Has Taught", "Trained At Some Of The Most Prestigious Gyms In The Country. But Before She Started My Career In This Industry", "She Was Someone Who Was Frustrated Fad Diets", "Extreme Fitness Programs. Exercising Hasn T Always Been Fun For Her", "She'S Endured The Lose-Some-Gain-More Cycle More Times Than She Can Count.One Day", "She Finally Stopped Punishing Her Body", "Started Listening To It Instead. She Learned That Exercise Doesn T Have To Be A Punishment For What You Ate Or Simply A Means Of Burning Calories"], "canonical_link": "https://www.shape.com/weight-loss/tips-plans/22-ways-stay-motivated-lose-weight", "title": "23 Weight-Loss Motivation Tips from Experts", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Wondering how to stay motivated to lose weight after you've been at it for a while? Or how to get motivated to lose weight in the first place? Whatever the case, follow these expert tips for finding weight loss motivation.", "emailcontenttype": "LISTSC", "emailvertical": "SHAPE", "sailthru.author": "Jessica Smith", "sailthru.tags": "lifestyle-mind-and-body,weight-loss-management", "article": {"section": "shape", "author": "https://www.facebook.com/SHAPEmagazine/"}, "fb": {"app_id": 165082593548215, "pages": 10053803772}, "og": {"type": "article", "site_name": "Shape", "url": "https://www.shape.com/weight-loss/tips-plans/22-ways-stay-motivated-lose-weight", "title": "These 23 Weight-Loss Motivation Tips *Actually* Work to Transform Your Mindset", "description": "Wondering how to stay motivated to lose weight after you've been at it for a while? Or how to get motivated to lose weight in the first place? Whatever the case, follow these expert tips for finding weight loss motivation.", "image": "https://www.shape.com/thmb/Z9G7ifBSwWaAfVqgAu_jypzAyik=/2000x1052/filters:fill(auto,1)/weight-loss-motivation-fb-2000-7e27e3441e3b4887a166adc59703e192.jpg"}, "twitter": {"card": "summary_large_image", "site": "@Shape_Magazine", "title": "These 23 Weight-Loss Motivation Tips *Actually* Work to Transform Your Mindset", "description": "Wondering how to stay motivated to lose weight after you've been at it for a while? Or how to get motivated to lose weight in the first place? Whatever the case, follow these expert tips for finding weight loss motivation.", "image": "https://www.shape.com/thmb/xv0GXgeSjBzTVD_ZrMR337A4CIA=/2000x1052/filters:fill(auto,1):focal(1739x503:1741x505)/weight-loss-motivation-fb-2000-7e27e3441e3b4887a166adc59703e192.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.19.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.19.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.19.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.19.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.19.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://www.shape.com", "summary": ""}