{"url": "https://www.bustle.com/p/john-cenas-new-comments-about-nikki-bella-suggest-he-wants-a-reconciliation-video-9084712", "text": "If you're rooting for John Cena and Nikki Bella to get back together, then it sounds like a certain WWE Superstar is right there with you. When John Cena opened up about his and Nikki Bella's breakup on the Monday, May 14 episode of TODAY, he told Hoda Kotb and Kathie Lee Gifford that he still loves his ex-fiancée.\n\nThe Blockers star said,\n\n“It’s been incredibly reflective, which is amazing, but it’s very difficult. I had my heart broken out of nowhere — or, for me, it was out of nowhere — and anyone who's experienced that knows that it comes with a series of bad feelings. I’ve looked at myself every day, and I’ve tried to evaluate myself every day, and the woman I love. For anyone out there speculating on what I’m doing with my life now: I still love Nicole. I would still love to marry Nicole. I still would love to have a family with Nicole.”\n\nThat \"I still would love to have a family with Nicole\" line should throw Total Bellas and Total Divas fans for a loop. Cena has been adamant about not wanting kids for years, while Bella has made it pretty clear that she’d like to settle down and start a family. This point of contention came up over and over again on both E! reality shows, and the WWE power couple never seemed to get to the same page. Many speculate that this failure to see eye to eye might've fueled their breakup. But now they may finally be on the same page about kids but also broken up? Oof, how's that for crummy timing.\n\nCena and Bella began dating in 2012, and as Total Divas and Total Bellas fans know all too well, the topics of marriage and children were recurring issues in their relationship. Bella hoped to wed and have kids with Cena, whereas Cena wasn't on board with either. But then, Cena apparently changed his mind on the whole marriage thing and proposed to Bella at WrestleMania in 2017. Their wedding was scheduled for May 5, but the pair announced their breakup on April 15.\n\nCena told Kotb and Gifford that he is neither happy about being single nor interested in being in a relationship with anyone other than Bella. He said,\n\n“I don’t want anybody else. I love Nicole. And I’m really trying to support her in her trying to find whatever it is that she wants that made this fall apart in the first place … I don’t have any other hopes, other than maybe one day, we can work it out.”\n\nMeanwhile, Bella spent Monday morning at the NBCUniversal upfronts. She did not see Cena's latest TODAY appearance, but she heard all about it when Extra filled her in during the upfronts red carpet. After hearing that Cena said he wanted to be with her and start a family with her, Bella replied, \"Wow, I'm speechless.\" But is it a good speechless, bad speechless, or a \"we're totally getting back together please don't spoil anything\" speechless?\n\nWhen E! News chatted with her at the upfronts, the WWE Superstar said that watching her and Cena's relationship unravel on the upcoming season of Total Bellas will “be definitely very hard to relive,” but she did not want to cut it from the show. She told E! News, \"I feel like I would be cheating [the viewers] if I was to take away all that footage because it's real life.\"\n\nBella added,\n\n“I’ve already seen some of the episodes and I’m watching myself and I’m like, ‘Oh, my gosh.’ I think a lot of people are going to be able to relate to it and it’s also going to give a lot of people courage and bravery to speak up. I think sometimes we go through things because we’re like, ‘OK, this is what we need to do. It’s too late.’ It’s never too late to make a decision, so. Yeah.”\n\nBut does this mean she's done with with Cena for good? Maybe not.\n\nLike Cena, Bella seems relatively open to possibly getting back together at some point down the line. She told E! News,\n\n“John is the love of my life. He’s absolutely an amazing man. I’m so lucky to have these amazing six years with him. There’s some of us that we hope that in the end it can work out. I just think the most important part is you want to make sure live the rest of your life happy. You don’t want people to force things or have to change themselves so much. And so those are the things we’re just stepping away and seeing what we both really want out of life, and when we come back together will it make us happy for the rest of our life? We both don’t want to live in regret. So we’re being very mature, which is great … So we’ll see.”\n\nAnd the gossip magazines sure think a reunion may very well be in the tea leaves. Last Tuesday, Us Weekly reported that a source claimed Bella has been “spending nights” with Cena at his place. And last Monday, a source claimed to People that the WWE Superstars are “on a path to reconciliation.”\n\nKeep those \"You can't see me\" fingers crossed for Cena and Bella to do whatever makes both of them happy for the rest of their lives.", "images": ["https://imgix.bustle.com/uploads/getty/2022/10/4/c7f5cf37-6219-4799-82b6-61516912f7e4-getty-1272975384.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2018/5/14/80089aab-5cbe-487a-8234-83a2a6b4a383-screen-shot-2018-05-14-at-25258-pm.png?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/image/2022/5/11/98d51af3-762a-4bad-9813-1df69e893334-blingempire_unit_01818rc.jpg?w=159&h=110&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.452&fp-y=0.288", "https://imgix.bustle.com/uploads/image/2022/9/26/543b8343-7f10-4467-a946-cfa8a9aab526-80226b11-dd9d-4696-940d-dd0867d507e9-getty-1370976136.jpeg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/image/2018/5/14/80089aab-5cbe-487a-8234-83a2a6b4a383-screen-shot-2018-05-14-at-25258-pm.png?w=800&fit=crop&crop=faces&auto=format%2Ccompress", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2022/10/5/18a81ecc-5972-4e59-ac9c-5b93b6d92ebf-getty-1238712243.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress"], "top_img": "https://imgix.bustle.com/uploads/image/2018/5/14/80089aab-5cbe-487a-8234-83a2a6b4a383-screen-shot-2018-05-14-at-25258-pm.png?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/john-cenas-new-comments-about-nikki-bella-suggest-he-wants-a-reconciliation-video-9084712", "title": "John Cena's New Comments About Nikki Bella Suggest He Wants A Reconciliation — VIDEO", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/john-cenas-new-comments-about-nikki-bella-suggest-he-wants-a-reconciliation-video-9084712", "type": "article", "title": "John Cena's New Comments About Nikki Bella Suggest He Wants A Reconciliation — VIDEO", "description": "If you're rooting for John Cena and Nikki Bella to get back together, then it sounds like a certain WWE Superstar is right there with you. When John Cena opened up about his and Nikki Bella's breakup on the Monday, May 14 episode of TODAY, he told…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/5/14/80089aab-5cbe-487a-8234-83a2a6b4a383-screen-shot-2018-05-14-at-25258-pm.png?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "If you're rooting for John Cena and Nikki Bella to get back together, then it sounds like a certain WWE Superstar is right there with you. When John Cena opened up about his and Nikki Bella's breakup on the Monday, May 14 episode of TODAY, he told…"}, "movies": ["https://www.youtube.com/embed/8XBLuU_4Qgo", "https://www.youtube.com/embed/GKbRBJrlfY8", "https://www.youtube.com/embed/Rc0jKpOMVXY"], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}