{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/02/27/was-the-oscars-best-picture-mix-up-a-jimmy-kimmel-prank-conspiracy-theories-begin/", "text": "Gift Article Share\n\nThere’s only one thing people of the Internet love more than an absolutely epic mistake on live television — conspiracy theories about how it could have happened. Oscars 2017: 10 things you need to know, from the epic mix-up to Viola Davis’s speech A few hours after Faye Dunaway and Warren Beatty announced “La La Land” as best picture at the Academy Awards (when the trophy actually belonged to “Moonlight”), PricewaterhouseCoopers, the longtime accounting firm in charge of the Oscar ballots, took responsibility and released an apology statement. Dunaway and Beatty were apparently given the envelope and card for the best actress category, which read “Emma Stone, ‘La La Land.’ ” Thus, the confusion.\n\nWatch the crazy ending of the Oscars (Video: Clip Courtesy A.M.P.A.S.© 2017)\n\n“The presenters had mistakenly been given the wrong category envelope and when discovered, was immediately corrected,” the statement read in part. “We are currently investigating how this could have happened, and deeply regret that this occurred.”\n\nAdvertisement\n\nOkay. Sure. But social media had other ideas: What if it wasn’t just a simple mix-up? On ABC’s official Oscars “After Party” special, before there was more information, host Anthony Anderson also seemed convinced it was all a conspiracy. Here are some of the theories floated in the early hours of Monday morning:\n\n1. This was an especially mean prank from Oscars host Jimmy Kimmel.\n\nThe late-night host is famous for his practical jokes, from his YouTube hoaxes (the twerking girl on fire, the wolf at the Sochi Olympics); to urging parents to pretend they ate their kids’ Halloween candy; to his holiday prank war with his neighbors, John Krasinski and Emily Blunt. So … couldn’t this just be a way to make his Oscars gig really, really memorable?\n\nhttps://twitter.com/Leqsee/status/836100391314075649\n\n@jimmykimmel that was a really mean prank - to both La La Land and Moonlight. — Charlie Roxbee (@CharlieRoxbee) February 27, 2017\n\nthis was kimmel's best prank tbh — Lana Berry (@Lana) February 27, 2017\n\n2. It’s all Leonardo DiCaprio’s fault.\n\nAdvertisement\n\nSome eagle-eyed viewers noticed that Leonardo DiCaprio, who announced best actress, didn’t give Stone her card when she won. Uh oh — could he be responsible?\n\nLater, Stone said she was in possession of the card; which is actually plausible, as there are two cards printed for each category. Either way, time for some suspicions about DiCaprio’s role in this madness.\n\nLEO CARRIED THAT CARD OFFSTAGE PUT IT DOWN WHEN HE SAW WARREN AND WARREN PICKED IT UP\n\nHey, maybe Leonardo DiCaprio laid the Best Actress card on top of the Best Picture card while walking off stage? It's his fault. #Moonlight — MoonBlossom (@MoZone) February 27, 2017\n\n3. This was a prank from Matt Damon on Jimmy Kimmel.\n\nThroughout the entire ceremony, Kimmel mercilessly teased Damon, extending their years-long “feud.” Toward the end of the show, the announcer referred to Damon as Ben Affleck’s “guest” when they presented an award, and music played over Damon when he started talking. So it looked like Kimmel got the last laugh … or did he?\n\nTheory: Did Matt Damon prank Jimmy Kimmel by giving the wrong envelope to Beatty? Bwahahaha! #Oscars2017 #MerylSaysHi @moonlightmov pic.twitter.com/XeibuVaW1g — Julie Salek (@tampajulie) February 27, 2017\n\n95% sure this was a revenge prank by Matt Damon to finally get @jimmykimmel back — The Gregory Brothers (@gregorybrothers) February 27, 2017\n\n4. The universe.\n\nUltra-dramatic, stunning upset victories and twists for the election, World Series, Super Bowl and now this? Maybe the universe is just having some fun.\n\nAdvertisement\n\nWhat is it with all the surprise endings lately? The elections the Super Bowl & now the Oscars! #Godstryingtotellussomething #dontgotosleep — RenéeEliseGoldsberry (@ReneeGoldsberry) February 27, 2017\n\nThe Super Bowl, the election, the Oscars: say what you want about Americans, we sure know how to do surprise endings. #Oscars #AcademyAwards — Will Presti (@WillPresti) February 27, 2017\n\nI can't believe the Super Bowl and the Oscars were both decided in overtime for the first time this year. — Josh Gondelman (@joshgondelman) February 27, 2017\n\n5. “Liberals.”\n\nAccording to an email I got from a reader, anyway:\n\nRead more:\n\nGiftOutline Gift Article", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=http://img.washingtonpost.com/rf/image_960w/2010-2019/WashingtonPost/2017/02/27/Style/Images/645726652.jpg&w=1440"], "top_img": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://img.washingtonpost.com/rf/image_960w/2010-2019/WashingtonPost/2017/02/27/Style/Images/645726652.jpg&w=1440", "keywords": [], "authors": ["Emily Yahr"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/02/27/was-the-oscars-best-picture-mix-up-a-jimmy-kimmel-prank-conspiracy-theories-begin/", "title": "Was the Oscars best picture mix-up a Jimmy Kimmel prank? Conspiracy theories begin.", "meta_data": {"description": "Wait, maybe it was a Matt Damon prank on Kimmel. Or was it Leonardo DiCaprio's fault?", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/02/27/was-the-oscars-best-picture-mix-up-a-jimmy-kimmel-prank-conspiracy-theories-begin/", "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://img.washingtonpost.com/rf/image_960w/2010-2019/WashingtonPost/2017/02/27/Style/Images/645726652.jpg&w=1440", "title": "Was the Oscars best picture mix-up a Jimmy Kimmel prank? Conspiracy theories begin.", "description": "Wait, maybe it was a Matt Damon prank on Kimmel. Or was it Leonardo DiCaprio's fault?"}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Was the Oscars best picture mix-up a Jimmy Kimmel prank? Conspiracy theories begin.", "description": "Wait, maybe it was a Matt Damon prank on Kimmel. Or was it Leonardo DiCaprio's fault?"}, "last_updated_date": "2021-12-03T07:50:26.948Z", "article": {"published_time": "2017-02-27T11:30:43.000Z", "modified_time": "2021-12-03T07:50:26.948Z", "section": "Arts & Entertainment", "content_tier": "metered"}, "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1", "next-head-count": 70, "apple-itunes-app": "app-id=352509417, app-argument=https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/02/27/was-the-oscars-best-picture-mix-up-a-jimmy-kimmel-prank-conspiracy-theories-begin/"}, "movies": [], "publish_date": 1488153600.0, "source": "https://www.washingtonpost.com", "summary": ""}