{"url": "en.wikipedia.org/wiki/Flip_or_Flop", "text": "American reality television series\n\nFlip or Flop was an American television series that aired on HGTV, hosted by the formerly-married couple Tarek El Moussa and Christina Hall.[1] The program was the original show in the Flip or Flop franchise, debuting in 2013.[2]\n\nThe ninth season premiered on October 15, 2020.[3] On November 5, 2020, the series was renewed for a 15-episode tenth season which will premiere in late 2021.[4][5] On March 9, 2022, it was announced that the series would end after ten seasons on March 17, 2022.[6]\n\nPremise [ edit ]\n\nChristina Haack and Tarek El Moussa were married real estate agents in Orange County, California. After the real estate crash in 2008, they began flipping homes in the Orange County area.\n\nIn 2011, Tarek asked a friend to help him make an audition tape for HGTV, filming an entire episode of the process of house flipping from start to finish. The audition tape was sent to HGTV and in 2012 the couple[7] was signed to make Flip or Flop.[8]\n\nChristina's expertise is primarily in design, and she works with Tarek to find and renovate homes. She handles the designs of the new spaces and keeps the project on schedule. The show follows them as they buy homes, typically bank-owned, short sales or foreclosures, to renovate and resell.[8]\n\nHosts [ edit ]\n\nPersonal lives [ edit ]\n\nTarek El Moussa and his ex-wife turned business partner Christina Hall met while working in the real estate industry. When the housing market plummeted after the October 2008 stock market crash they went from living in a $6,000 per month home to a $700 per month apartment, inspiring them to focus on flipping houses.[9] The couple married in 2009, and their daughter Taylor Reese was born in 2010.[9]\n\nIn 2013, a registered nurse and viewer, Megan R, contacted the network after seeing a lump on Tarek's neck during a Flip or Flop marathon. The network put Reade in touch with the producers, and Tarek was diagnosed with testicular cancer and thyroid cancer.[10][11][12] The El Moussas thanked Reade in a video that can be seen on HGTV.com.[13] When doctors recommended radiation treatment, the couple decided to bank Tarek's sperm and try in-vitro fertilization to have a second child.\n\nAfter a couple of failed attempts, Christina became pregnant and their son, Brayden James, was born August 20, 2015.[14][15]\n\nIn May 2016, the couple separated after an incident at their Southern California home. According to a Yorba Linda police report, Christina called the police after she saw Tarek leave their home with a gun, believing he was suicidal.[16] Tarek was found by the police, and maintained that he was never suicidal and had simply gone for a hike, taking a gun to protect himself from wild animals.[17] In January 2017, Tarek officially filed for divorce from Christina.[18]\n\nReal estate career [ edit ]\n\nTarek and Christina ran a real-estate agency, The El Moussa Group, in Orange County, an area with one of the largest foreclosure rates in the country. Tarek, Christina, and their partner Pete De Best, bought their first investment house in Santa Ana for $115,000. After selling the property for a profit of $34,000, the trio split the money and continued to flip houses, expanding their real estate investing business into Arizona and Nevada[8] Following their divorce, The El Moussa Group was dissolved and is now run under the name Tarek and Associates.[19]\n\nIn 2018, Tarek and Christina co-founded a real estate education course called Real Estate Elevated.[20]\n\nSeries overview [ edit ]\n\nSeason Episodes Originally aired First aired Last aired 1 13 April 16, 2013 ( ) May 28, 2013 ( 2013-05-28 ) 2 14 April 8, 2014 ( ) July 8, 2014 ( 2014-07-08 ) 3 15 October 7, 2014 ( ) July 7, 2015 ( 2015-07-07 ) 4 15 December 3, 2015 ( ) March 24, 2016 ( 2016-03-24 ) 5 15 June 9, 2016 ( ) September 22, 2016 ( 2016-09-22 ) 6 15 December 1, 2016 ( ) March 30, 2017 ( 2017-03-30 ) 7 20 June 15, 2017 ( ) September 6, 2018 ( 2018-09-06 ) 8 18 August 1, 2019 ( ) December 12, 2019 ( 2019-12-12 ) 9 15 October 15, 2020 ( ) February 18, 2021 ( 2021-02-18 ) 10 15 December 2, 2021 ( ) March 17, 2022 ( 2022-03-17 )", "images": ["http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/en/thumb/1/14/Flip_or_Flop_Logo.jpg/250px-Flip_or_Flop_Logo.jpg", "http://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/1/14/Flip_or_Flop_Logo.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/53/Ambox_current_red_Americas.svg/42px-Ambox_current_red_Americas.svg.png", "http://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/1/14/Flip_or_Flop_Logo.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Flip_or_Flop", "title": "Flip or Flop", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/1/14/Flip_or_Flop_Logo.jpg", "width": 640, "height": 359}, "title": "Flip or Flop - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}