{"url": "https://www.celebritynetworth.com/richest-celebrities/models/larsa-pippen-net-worth/", "text": "Larsa Pippen Net Worth: Larsa Pippen is an Assyrian-American former model, TV personality, and fashionista who has a net worth of $10 million. Larsa Pippen rose to fame as the star of the TV reality show The Real Housewives of Miami. Larsa Pippen earned additional fame through her modeling career. She is also well known as the ex-wife of NBA Super Star, Scottie Pippen.\n\nLarsa and Scottie married in 1997. They separated a number of times and officially divorced in 2021.\n\nEarly Life: She was born Larsa Younan on July 6, 1974, in Chicago, Illinois. She attended a local high school in Chicago where she was an average student. Pippen graduated from the University of Chicago where she obtained a degree in Political Science.\n\nCareer: The model and ex-wife of a former NBA star, Scottie Pippen, she earned a spot on the Bravo's reality series Housewives that debuted on February 22, 2011. She did not return for season two. A snarky beauty as she is, Larsa boasts that she is successful at everything she does, including playing the 24/7 role of a wife and mother of four. As she says, when she is not busy turning her three little boys into star athletes or shopping for her princess, Larsa is spending a little time on herself. Following her positive experience on the Housewives, it was announced that she and Scottie will star in their own reality series on WE tv, titled Big Pippen, slated for a 2013 debut. The woman once known as \"Hottest NBA Wife\" also made several appearances on Kourtney and Kim Take Miami, as Kim Kardashian's close friend. Larsa maintains a blog, \"Life with Larsa,\" and is a brand ambassador for Haute Living magazine. She also runs the Pippen Foundation, which raises money for various children's charities.\n\nPersonal Life: Larsa and Scottie Pippen tied the knot in Chicago (sans prenup) on July 20, 1997, when Larsa was just 23 years old. She was thrust into the limelight immediately for being married to the NBA superstar. The couple has four children together: Scottie Pippen Jr., Preston Pippen, Justin Pippen, and Sophia Pippen. At least one of their kids got the basketball gene: Their oldest son Scottie Jr. is a point guard for Vanderbilt University and was on the 2020 All-SEC freshman team.\n\nThe couple announced their separation in 2016. Scottie Pippen decided to file for divorce from Larsa, which came shortly after cops were called to their home for the second time in the span of two days. The cops had been called to the couple's home in Ft. Lauderdale, Florida because of an alleged domestic disturbance.\n\nThe pair finally finalized their divorce in 2018 amid rumors that Larsa had cheated on Scottie with rapper Future, a rumor which she denies. Larsa made headlines in December 2020 when she was spotted with then-married NBA star Malik Beasley. The \"Real Housewives of Miami\" alum was photographed holding hands with the 24-year-old NBA player in Miami and the photos quickly surfaced after. Beasley's wife, Montana Yao, slammed him on social media and then filed for divorce.\n\nReal Estate: In 2004 Larsa and Scottie paid $2.225 million for a 10,000 square foot lakefront home in the Chicago suburb of Highland Park. They listed the home in 2016 for $3.1 million. Even after lowering the price to $1.899 million in 2019, they could not find a buyer.\n\nIn 2000 they paid $1.3 million for a property in Fort Lauderdale, Florida. In 2004 they custom-built a 9,700 square foot, 6 bedroom mansion on the lot. In 2010 they listed the home for $16 million. A decade later they had still not found a buyer, even after lowing to just under $10 million. As of this writing, the property is still listed for sale for $12 million.", "images": ["https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://vz.cnwimg.com/wp-content/uploads/2011/02/larsa.jpg"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2011/02/larsa.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/models/larsa-pippen-net-worth/", "title": "Larsa Pippen Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Larsa Pippen Net Worth: Larsa Pippen is an Assyrian-American former model and TV personality who has a net worth of $10 million. Larsa Pippen", "cnw_share_fb_count": 127, "cnw_share_tw_count": 23, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Larsa Pippen Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/models/larsa-pippen-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2011/02/larsa.jpg", "site_name": "Celebrity Net Worth", "description": "Larsa Pippen Net Worth: Larsa Pippen is an Assyrian-American former model and TV personality who has a net worth of $10 million. Larsa Pippen"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2021-07-15T13:58:20+00:00", "published_time": "2021-07-02T20:49:29+00:00", "section": "Models", "tag": "scottie pippen net worth"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2011/02/larsa.jpg", "title": "Larsa Pippen Net Worth", "description": "Larsa Pippen Net Worth: Larsa Pippen is an Assyrian-American former model and TV personality who has a net worth of $10 million. Larsa Pippen"}}, "movies": ["https://www.youtube.com/embed/c7Uo1YfS6tE"], "publish_date": 1625258969.0, "source": "https://www.celebritynetworth.com", "summary": ""}