{"url": "www.cnn.com/2017/09/13/politics/susan-rice-house-investigators-unmasked-trump-officials/index.html", "text": "Story highlights The crown prince arrived in New York before Trump was sworn into office The Obama administration felt misled by the United Arab Emirates\n\nWashington CNN —\n\nFormer national security adviser Susan Rice privately told House investigators that she unmasked the identities of senior Trump officials to understand why the crown prince of the United Arab Emirates was in New York late last year, multiple sources told CNN.\n\nThe New York meeting preceded a separate effort by the UAE to facilitate a back-channel communication between Russia and the incoming Trump White House.\n\nThe crown prince, Sheikh Mohammed bin Zayed al-Nahyan, arrived in New York last December in the transition period before Trump was sworn into office for a meeting with several top Trump officials, including Michael Flynn, the president’s son-in-law, Jared Kushner, and his top strategist Steve Bannon, sources said.\n\nThe Obama administration felt misled by the United Arab Emirates, which had failed to mention that Zayed was coming to the United States even though it’s customary for foreign dignitaries to notify the US government about their travels, according to several sources familiar with the matter. Rice, who served as then-President Obama’s national security adviser in his second term, told the House Intelligence Committee last week that she requested the names of the Americans mentioned in the classified report be revealed internally, a practice officials in both parties say is common.\n\nRice’s previously undisclosed revelation in a classified setting shines new light on a practice that had come under sharp criticism from the committee chairman, California Rep. Devin Nunes, and President Donald Trump, who previously accused Rice of committing a crime.\n\nBut her explanation appears to have satisfied some influential Republicans on the committee, undercutting both Nunes and Trump and raising new questions about whether any Trump associates tried to arrange back-channel discussions with the Russians.\n\n“I didn’t hear anything to believe that she did anything illegal,” Florida Rep. Tom Rooney, a Republican helping to lead the panel’s Russia invesigation, told CNN of Rice’s testimony. He declined to discuss any of the contents of her classified remarks.\n\nThrough a spokeswoman, Rice declined to comment about her testimony. Nunes refused to answer questions when asked about Rice Tuesday evening.\n\nIt’s unclear precisely which Trump officials Rice discussed at the House meeting. But multiple sources have confirmed to CNN that Zayed met at the time with Flynn, Kushner and Bannon. The three-hour discussion focused on a range of issues, including Iran, Yemen and the Mideast peace process, according to two sources who insisted that opening up a back-channel with Russia was not a topic of discussion.\n\nStill, the fact that the New York meeting occurred prior to the Seychelles session and that the UAE did not notify the Obama administration about why the crown prince was coming to the United States has raised questions in the eyes of investigators on Capitol Hill.\n\nA secret meeting in the Seychelles\n\nBut the Trump Tower meeting came shortly before the UAE brokered a meeting to open lines of communications with the United States and Russia, with a clandestine January meeting in the Seychelles Islands in the Indian Ocean, according to reports in CNN and The Washington Post. That meeting is now under investigation on Capitol Hill, though it’s unclear whether Rice mentioned the Seychelles meeting in the testimony.\n\nA senior Middle East official told CNN that the UAE did not “mislead” the Obama administration about the crown prince’s visit, but acknowledged not telling the US government about it in advance. The meeting, which took place December 15, 2016, the official said, was simply an effort to build a relationship with senior members of the Trump team who would be working in the administration to share assessments of the region.\n\n“The meeting was about ascertaining the Trump team’s view of the region and sharing the UAE’s view of the region and what the US role should be,” the official said. “No one was coming in to sell anything or arrange anything.”\n\nA spokesperson for the crown prince declined to comment.\n\nThe Seychelles meeting – and the circumstances around it – has been a subject of interest to Hill investigators looking at any potential link between the Trump campaign and Russia.\n\nThe Washington Post initially reported in April that the UAE brokered a pre-inauguration meeting between the founder of the security firm Blackwater, Erik Prince, who is a close Trump ally, and an associate of Vladimir Putin’s in the Seychelles Islands. The purpose of the meeting was part of an effort by the UAE to persuade Russia to curtail its relationship with Iran, including in Syria, according to the Post.\n\nAnd it occured shortly after Bannon, Flynn and Kushner also met in Trump Tower with Zayed, whom the Post said helped arrange the Seychelles meeting with Russia government officials to set up the private discussions with the Trump team.\n\nBut the senior Middle East official told CNN this week that Prince’s name was not discussed at the Trump Tower meeting. And Prince himself has said he did nothing wrong, telling CNN’s Erin Burnett last month: “I was there for business.”\n\nBoth the White House and Prince have strongly denied that Prince was working as a liaison for the Trump administration.\n\nPrince said he met with a Russian while at the Seychelles but “I don’t remember his name.”\n\n“It probably lasted about, as long as one beer,” he said about the meeting.\n\nExplaining ‘unmasking’\n\nFor her part, Rice had been called to the House Intelligence Committee to testify partly over what Nunes and other Republicans believed was an abuse in the practice of “unmasking” – or revealing the identities of Americans who were communicating with foreign officials under surveillance by the US intelligence community. Simply unmasking the names of individuals in classified reports does not mean that their identities will be revealed publicly, and Rice denied to the committee that she leaked classified information to the press, sources familiar with the matter said.\n\nBut Rice’s suggestion that she unmasked the names of US individuals – who turned out to be Trump associates – over concerns about the propriety of the crown prince’s visit to the United States could help her fend off attacks that she was out of line in the actions she took.\n\nRep. Trey Gowdy, a South Carolina Republican who is helping lead the House investigation, told the Daily Caller “nothing that came up in her interview that led me to conclude” that she improperly unmasked the names of Trump associates or leaked it to the press.\n\nSarah Sanders, the White House press secretary, did not say explicitly whether Trump still believes Rice committed a crime but added the issue of leaking and unmasking needs to be investigated.\n\n“We’ve seen illegal leaking of classified materials, including the identities of American citizens unmasked in intelligence reports,” Sanders told CNN. “That’s why the President called for Congress to investigate this matter and why the Department of Justice and Intelligence Community are doing all they can to stamp out this dangerous trend that undermines our national security.”\n\nNunes was forced to step aside from running the Russia investigation amid a House ethics inquiry into whether he improperly disclosed classified data. The ethics inquiry came in the aftermath of his bombshell comments that Obama administration officials had improperly unmasked the names of Trump associates, a revelation that Trump used as cover for his unsubstantiated claim that Obama had Trump Tower wiretapped during the election to spy on him. The Justice Department said in a court filing Friday that the DOJ and the FBI have no evidence to support Trump’s claims.\n\nBut on Tuesday, the Republican who took over the investigation from Nunes said there was no reason to bring Rice in for further questioning.\n\n“She was a good witness, answered all our questions,” Rep. Mike Conaway, the Texas Republican now running the House Russia probe, told CNN. “I’m not aware of any reason to bring her back.”", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/170613160719-the-russia-investigation-logo-large-169.png?q=h_36,w_497,x_0,y_0/w_1280", "https://media.cnn.com/api/v1/images/stellar/prod/170403142900-senate-judiciary-committe-feinstein-grassley-0403.jpg?q=x_0,y_0,h_1687,w_2997,c_fill/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/170405102606-01-susan-rice-04.jpg?q=x_6,y_0,h_1684,w_2993,c_crop/w_800", "https://media.cnn.com/api/v1/images/stellar/prod/170522175218-michael-flynn-january-10-2017.jpg?q=x_252,y_269,h_1659,w_2948,c_crop/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/170522175329-michael-flynn-december-5-2016.jpg?q=x_561,y_313,h_1100,w_1955,c_crop/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/160314164813-manu-raju-profile.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/170707144827-01-putin-trump-g20-meeting-07-07-2017.jpg?q=x_5,y_201,h_2756,w_4897,c_crop/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/170522174514-michael-flynn-white-house.jpg?q=x_0,y_208,h_2250,w_3999,c_crop/h_144,w_256"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/170405102606-01-susan-rice-04.jpg?q=x_6,y_0,h_1684,w_2993,c_crop/w_800", "keywords": [], "authors": ["Manu Raju Senior Congressional Correspondent", "Manu Raju", "Senior Congressional Correspondent"], "canonical_link": "https://www.cnn.com/2017/09/13/politics/susan-rice-house-investigators-unmasked-trump-officials/index.html", "title": "Rice told investigators why she unmasked Trump aides", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Exclusive: Rice told House investigators why she unmasked senior Trump officials | CNN Politics", "description": "Former national security adviser Susan Rice privately told House investigators that she unmasked the identities of senior Trump officials to understand why the crown prince of the United Arab Emirates was in New York late last year, multiple sources told CNN.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/170405102606-01-susan-rice-04.jpg?q=x_6,y_0,h_1684,w_2993,c_crop/w_800", "type": "article", "url": "https://www.cnn.com/2017/09/13/politics/susan-rice-house-investigators-unmasked-trump-officials/index.html", "site_name": "CNN"}, "twitter": {"title": "Exclusive: Rice told House investigators why she unmasked senior Trump officials | CNN Politics", "description": "Former national security adviser Susan Rice privately told House investigators that she unmasked the identities of senior Trump officials to understand why the crown prince of the United Arab Emirates was in New York late last year, multiple sources told CNN.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/170405102606-01-susan-rice-04.jpg?q=x_6,y_0,h_1684,w_2993,c_crop/w_800", "card": "summary_large_image", "site": "@cnnpolitics"}, "description": "Former national security adviser Susan Rice privately told House investigators that she unmasked the identities of senior Trump officials to understand why the crown prince of the United Arab Emirates was in New York late last year, multiple sources told CNN.", "template_type": "article_leaf", "type": "article", "meta-section": "politics", "meta-branding": "russia-investigation", "theme": "politics", "article": {"published_time": "2017-09-13T21:20:55Z", "modified_time": "2017-09-19T00:42:18Z", "tag": "africa, devin nunes, donald trump, eastern africa, eastern europe, erik prince, europe, government and public administration, government bodies and offices, intelligence services, international relations and national security, investigations, middle east, middle east and north africa, national security, new york (state), new york city, north america, northeastern united states, political figures - us, russia, russia meddling investigation, seychelles, susan rice, trump tower, united arab emirates, united states, us federal government, white house", "publisher": "https://www.facebook.com/CNN"}, "keywords": "africa, devin nunes, donald trump, eastern africa, eastern europe, erik prince, europe, government and public administration, government bodies and offices, intelligence services, international relations and national security, investigations, middle east, middle east and north africa, national security, new york (state), new york city, north america, northeastern united states, political figures - us, russia, russia meddling investigation, seychelles, susan rice, trump tower, united arab emirates, united states, us federal government, white house", "author": "Manu Raju,Senior Congressional Correspondent", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1505257200.0, "source": "http://www.cnn.com", "summary": ""}