{"url": "www.vanityfair.com/news/2010/12/william-and-kate-201012", "text": "William and Kate were determined to keep their fledgling romance quiet, and behind the closed doors of 13a Hope Street they could. Their bedrooms were on separate landings, but by this stage it was nothing more than pretense. William and Kate had fallen in love and were enjoying a conventional university romance, albeit one involving elaborate cover-ups and decoys. In a bid to keep their relationship below the radar for as long as possible, they would leave the house at different times and arrive at dinner parties separately, and made a pact never to hold hands in public.\n\nBy the end of their second year the relationship was a close one. When William attended Kate’s belated 21st-birthday party, in June 2003, at her family home in Bucklebury, Berkshire, the glance she threw him across the room when he walked into the 1920s-themed party was more than platonic. But then, at William’s 21st-birthday party at Windsor Castle, later that month, it seemed as though Kate was barely registering with William; he seemed preoccupied with a very pretty girl named Jecca Craig.\n\nOut of Africa\n\nWilliam had first met Jecca, daughter of British conservationist Ian Craig and his wife, Jane, in 1998 in Kenya during a school holiday. He had fallen in love with Africa and returned during his gap year to spend several weeks learning about conservation at the Craigs’ 55,000-acre game preserve, situated in the beautiful Lewa Downs, in the foothills of Mount Kenya. William had adored every minute of it and years later would get involved with the Tusk Trust, a conservation charity which finances some of Lewa’s activities and of which William is now a patron. Ian Craig recalled, “William just loves Africa, that’s clear. He did everything from rhino spotting to anti-poaching patrols to checking fences. He’s a great boy.” It was not long before rumors were circulating among their friends that something was going on. William had apparently had a secret crush on Jecca since the first time he met her. She was beautiful, with long blond hair, deep-blue eyes, and legs like a gazelle’s. But when it was reported in British papers that the two had staged a mock engagement ceremony to pledge their love to each other before William returned to England, the prince instructed his aides to deny this had happened.\n\nIt was a rare move—usually the Palace never comments on the princes’ private lives—but on this occasion William wanted the story refuted. “There’s been a lot of speculation about every single girl I’m with, and it actually does quite irritate me after a while, more so because it’s a complete pain for the girls,” he said. The tale had rattled him and embarrassed Jecca, who at the time was dating Edinburgh University undergraduate Henry Ropner, a former Etonian and a friend of William’s. The denial did little to quash the rumors of a romance, however, and as Kate raised her champagne flute to toast the birthday prince at the aptly themed Out of Africa celebration, it was Jecca who had pride of place next to William at the head table.\n\nBy the end of the summer, however, the relationship with Kate seemed back on track. It soon became an open secret at St. Andrews, and William and Kate were desperate for some privacy. While Fergus decided to stay on at 13a Hope Street, they chose to move out to Balgove House, on Strathtyrum, a sprawling private estate a quarter of a mile outside the town center, the property of a wealthy landowner, Henry Cheape, a distant cousin of the prince’s and close friend of the royals’. The impressive four-bedroom cottage was far more private than Hope Street. Unmarked police cars patrolled the estate, and William’s protection officers lived in the assorted outbuildings. As with all his residences, the cottage had been made secure for the prince, complete with bombproof doors and windows. William and Kate intended to entertain frequently: he installed a champagne fridge as soon as they moved in, while Kate set about dressing the kitchen windows with pretty red-and-white gingham curtains. As well as the grounds, where they enjoyed long romantic walks, the couple had the privacy of two acres of wild grassland hidden behind a six-foot stone wall. When it was warm enough, they would pack a picnic hamper and spend pleasant afternoons stretched out on a blanket, sharing a bottle of chilled white wine. They were blissful days, made all the more romantic by the fact that the press was unaware of their relationship. But the secret would soon be out.\n\n“More than Just Friends …”\n\nAgainst a backdrop of snowcapped Alps, William put his arm around Kate. Wrapped up against the cold mountain air in their pants and ski jackets, they waited in line for a ski lift. As the T-bar arrived, William helped Kate on, and they glided up the steep mountain, ski poles in their hands. The shot of William gazing lovingly at Kate that was published in the Sun newspaper on April 1, 2004, was no April Fools’ joke. The rumors, which had been around for months, were confirmed: William and Kate were definitely more than just friends. “If I fancy a girl and she fancies me back, which is rare, I ask her out. But at the same time I don’t want to put them in an awkward situation, because a lot of people don’t understand what comes with knowing me, for one—and secondly, if they were my girlfriend, the excitement it would probably cause,” William had remarked in that 21st-birthday interview. He was right about the excitement. He had chosen to go to Klosters, Switzerland, where the royal family are photographed every year, and he had made no attempt to disguise his affection for Kate. They were with a group of friends that included former nanny Tiggy Legge-Bourke’s brother Harry, Guy Pelly, and William van Cutsem and his girlfriend, Katie James. The Palace was furious and accused The Sun of breaching the embargo that protected Prince William during his university years. But the paper had decided that this was a scoop just too good to turn down. FINALLY …WILLS GETS A GIRL was the headline. The truth was he had had her for many months. Suddenly the floodgates opened, and the world wanted to know everything about this shy, pretty, and unassuming girl.\n\nWhile some at the Palace have snootily pontificated that Kate was not blueblooded enough for the prince (her parents own Party Pieces, an online party-supply company), she had other qualities that were far more important to William. She was polite to the photographers who now pursued her, and she quickly adopted the royal rule of never speaking out. She also insisted that her family never discuss her relationship with William. As Princess Diana’s former private secretary Patrick Jephson noted, “We know very little about her and probably never will, providing they do their job right. Historically a degree of mystery about royalty has been an advantage; we project onto them what we want.” According to one of her friends at St. Andrews, she remained levelheaded and kept her feet on the ground during the early months of their courtship. “She never got above her station, and even though she had secured the most sought-after boy at St. Andrews, she never gloated. She was actually quite insecure about her looks and never considered herself pretty; she was very sweet and very shy.”\n\nLike Diana, Kate quickly had to adapt to being in the spotlight, but her transition into royal life was much smoother—unlike Diana, Kate enjoyed being at Highgrove, Balmoral, and Sandringham, where she would accompany William on shoots during the grouse and pheasant seasons. She had practiced with William on the Strathtyrum estate, where they were allowed to shoot birds for food as part of their rental agreement. Like Charles, who had been given the use of Wood Farm, at Sandringham, while he was at Cambridge, the Queen allowed William to use a cottage called Tam-na-Ghar, at Balmoral, as a getaway. Tucked away in the remote countryside, the 120-year-old cottage, which is surrounded by rolling hills and wild heather as far as the eye can see, underwent a £150,000 renovation, complete with a bathtub big enough for two, before William and Harry were each given a set of keys.\n\nAfter their last class on Friday, William and Kate would speed up to Balmoral from St. Andrews in William’s black Volkswagen Golf, followed by his protection officers. Like William, Kate loved walking across the moors and strolling by the river Dee. In the evenings they would cook a meal, share a bottle of red wine, and keep warm in front of a roaring log fire. Sometimes they were joined by friends from St. Andrews, and often her siblings Pippa and James, whose trophy stag heads line the walls of the Middleton-family house, would be invited for a weekend’s shoot, when they would compete as to who could bag the most birds.\n\n“WE KNOW VERY LITTLE ABOUT KATE MIDDLETON AND PROBABLY NEVER WILL, PROVIDING THEY DO THEIR JOB RIGHT. HISTORICALLY A DEGREE OF MYSTERY ABOUT ROYALTY HAS BEEN AN ADVANTAGE.”\n\nTrouble in Paradise\n\nIt was the summer of 2004 when William and Kate’s love affair underwent its first serious test. With one year to complete before they graduated, the 22-year-old prince needed some space—he told several of his friends at St. Andrews that he was feeling “claustrophobic.” Until now they had chosen not to discuss what would happen after St. Andrews, but with their finals looming, it was an issue that needed addressing.\n\nWilliam decided that a holiday would provide him with some thinking time and planned a boys-only sailing trip to Greece with Guy Pelly and some other friends to take place as soon as they left school for the summer. Kate had had a turbulent relationship with Guy and considered him immature and potentially troublesome. It was Guy who used to buy William porn magazines when they were teenagers, and she had heard all about their drink-fueled weekends at Highgrove. There was also a rumor among their friends that William and Guy, after a night of heavy drinking at Club H, the basement rec room with a bar at Highgrove, had covered one of their girlfriends in chocolate ice cream, which they then licked off, and then there was the occasion when Guy challenged William to a midnight swim at their friend James Tollemache’s 21st-birthday party at Helmingham Hall, in Suffolk. They had both been drinking heavily, but that didn’t stop them from stripping down to their boxer shorts, diving in, and swimming a lap of the murky moat that surrounds the Tollemaches’ country estate, where the Queen is a regular guest. It seemed that wherever there was trouble Guy was not far away, and Kate was wary of him. She was annoyed, if not surprised, when she found out that Guy had arranged for an all-female crew for the yacht. So she packed her bags and headed home to Berkshire to spend the summer with her family.\n\nA number of things had caused her to question William’s commitment, although she had not raised them with him yet. One was William’s friendship with an American heiress named Anna Sloan, whom he had met through mutual friends at Edinburgh University, where Anna was studying. Anna had lost her father, businessman George Sloan, in a tragic shooting accident on the family’s 360-acre estate in Nashville, and she and William had bonded over the loss of their parents. When William accepted an invitation from Anna to accompany her and a group of friends to Tennessee for a holiday before he went to Greece, it hurt Kate deeply. She suspected William might have feelings for the 22-year-old heiress. However, according to her friends, Anna was not romantically interested in William, and the friendship was never anything more than just that.\n\nAnd then there was William’s budding relationship with another stunning heiress, Isabella Anstruther-Gough-Calthorpe. While Kate was girl-next-door pretty, Isabella had cover-girl looks, a title, and a stately pile to boot. That summer William visited the Anstruther-Gough-Calthorpe family home in Chelsea to see her. Isabella, daughter of banking heiress Lady Mary Gaye Curzon, was single at the time. Sadly for William, she had no aspirations to date him and despite his amorous advances declared that she was not interested.\n\nMeanwhile, Kate had accepted an invitation to spend a fortnight in France at Fergus Boyd’s family holiday home in the Dordogne with some friends from St. Andrews. Among the group were Kate’s friends Olivia Bleasdale and Ginny Fraser. She had not told them about the trial separation, but from her downcast mood her friends guessed, and one evening she confided to them that she and William were taking a break. “She got quite drunk on white wine and really let her guard down,” recalled one of the group. “She was debating whether or not she should text or call him. She said how sad she was and how much she was missing William, but she never mentioned it after that.”\n\nBy November they were back at St. Andrews, although they had yet to reconcile their differences. I had reported the news of their separation that summer, and tellingly there was no denial from Clarence House. Privately, William again complained to friends that he was feeling claustrophobic and already thinking ahead to the summer after graduation, when he was planning to return to Kenya to see Jecca Craig, another fly in the ointment as far as Kate was concerned. “The last thing William wants is a high-profile split in the crucial months leading up to his finals,” I was told at the time by a source close to William. On the advice of her mother, Kate gave William some breathing space. It was made all the harder because they were living together, but instead of spending weekends in St. Andrews or traveling to Balmoral, Kate would return home to be with her parents.\n\nIt was obviously the break that William needed, and by Christmas they were back together again, although Kate had a condition. Word had reached her of William’s visits to Isabella, and Kate insisted that William was not to contact her again. With their finals looming in May, they agreed to take things slowly. Kate had stayed away from Edward van Cutsem’s wedding to the Duke of Westminster’s daughter Lady Tamara Grosvenor that November, but she happily accepted an invitation to Prince Charles’s 56th-birthday party at Highgrove later that month. The following March, Prince Charles invited her to Klosters for his pre-wedding holiday. Charles and Camilla Parker Bowles were to be married on April 9, 2005, and the Prince wanted one last skiing holiday with his sons first. It had really been intended as a boys-only trip, but Kate was not left out. She was photographed taking a gondola up the slopes with Charles and enjoying lunch with the princes and their friends. William was a witness at the civil ceremony, together with Camilla’s son, Tom, and had the added responsibility of looking after the wedding rings. But since she and William were not yet engaged, Kate was not invited to the intimate family wedding itself.\n\nPomp and Circumstance\n\nCamilla was now part of the family, and when William graduated on June 23, 2005, she was there along with Charles, the Duke of Edinburgh, and the Queen. William and Kate had dreaded and looked forward to the day in equal measure. They had enjoyed one last party before their finals and, in keeping with tradition, attended the annual May Ball. Uncharacteristically, Kate drank so much that Fergus Boyd had to carry her out before the night ended. Now, as William and Kate walked into Younger Hall, they exchanged a smile and took their seats. The Queen smiled broadly as William knelt before the chancellor’s wooden pulpit to collect his parchment. Minutes later Kate was called to the stage as Catherine Middleton. When it came to the end of the ceremony, the words of vice-chancellor Dr. Brian Lang must have seemed particularly poignant. “You will have made lifelong friends,” he told the graduates. “You may have met your husband or wife. Our title as the top matchmaking university in Britain signifies so much that is good about St. Andrews so we rely on you to go forth and multiply.”\n\nFollowing graduation, William traveled to New Zealand, where he represented the Queen at events commemorating the 60th anniversary of the end of the Second World War and spent time with the British & Irish Lions rugby team, who were there on tour. Then he visited Jecca in Kenya, but this time he took Kate with him. He wanted her to experience the wild beauty of the country and reassure her that she had no cause to worry about Jecca. William whisked Kate off for a romantic holiday where they stayed at the £1,500-a-night, Masai-owned Il Ngwesi Lodge, in the Mukogodo Hills of central Kenya. During the day William worked on the Craig family’s Lewa Wildlife Conservancy. In the evenings he and Kate would sip cocktails and dine alfresco. The post-graduation holiday had been a blissful fortnight.\n\nIn the New Year, which William and Kate had seen in together at a cottage on the Sandringham estate, it was William’s turn to prove he could rise to the challenge of Sandhurst, the Royal Military Academy, where Harry was already in his seventh month. Knowing he would not see Kate for more than a month, William had taken Harry’s advice and whisked her off on yet another holiday to Klosters after the New Year celebrations. Just two years earlier the couple’s romance had been revealed on these slopes as William put his arm around Kate in an unthinking show of intimacy. This time, in spite of the cameras, there was no holding back. Standing together in the deep-powder snow, William pulled Kate toward him and kissed her.\n\nApparently, a number of dates have been penciled in the royal calendar in anticipation of an engagement announcement. Such planning might seem a touch premature, but for the royal family this was quite normal. The Palace works months and sometimes years in advance: preparations for the Queen Mother’s funeral started in 1969. “It’s being talked about within the Palace very openly,” a well-placed source insisted to me. “The word is that there might be an announcement in the spring.” Clarence House was quick to deny that any concrete plans were in place. But there was definitely something to the story, which was picked up by royal commentators and newspapers around the world. William had yet to pop the question, but as far as insiders at the Palace and his inner circle were concerned, it was only a matter of time. There was no escaping the fact that in Kate Middleton Prince William had found a potential bride.\n\nKate had arranged a farewell drinks party for William at Clarence House and had been dreading the moment they would have to say good-bye. William would miss her 24th birthday, and she wanted to make sure they could at least celebrate before he left for Sandhurst. The 23-year-old prince arrived in Camberley to begin his army officer training in driving rain on January 8, 2006, accompanied by his father and Jamie Lowther-Pinkerton, William’s private secretary. After being introduced to Major General Ritchie, William signed into Blenheim Company, bade farewell to his father, and was shown to his room overlooking Old College, which would be home for the next 44 weeks.\n\nBoot Camp\n\nSandhurst was unlike anything William had ever known. Echoing the message he expressed upon Harry’s arrival, Major General Ritchie told the waiting media that William would be treated exactly the same as every other cadet: “Everyone is judged on merit. There are no exceptions made.” Yet on certain occasions William was afforded special treatment. As the only cadet to be president of the Football Association, he was given leave during his second term to travel to Germany to support England during the World Cup, much to the envy of his fellow cadets. Such privileges were rare, however, and when it came to the training, neither prince was coddled.\n\nBy spring, with William knee-deep in trench training, it was time for Harry to graduate. He had spent weeks preparing for the parade and, apart from the occasional blip, proved himself a model soldier. Just days before the graduation ceremony, however, Harry was back on the front pages. He and four other cadets had visited Spearmint Rhino, a lap-dancing club in the nearby town of Colnbrook, and while he had not technically broken any rules (cadets are allowed out as long as they do not socialize within three miles of the academy), the details of their drink-fueled night on the town made for rather unsavory reading in the next day’s tabloids. With his girlfriend of two years, Chelsy Davy, on her way from Cape Town, where she was studying at university, to celebrate his graduation, it was embarrassing and very poor timing.", "images": ["https://media.vanityfair.com/photos/632dc5bfd0fb4a008fafbae4/1:1/w_350%2Ch_350%2Cc_limit/undefined", "http://www.vanityfair.com/verso/static/vanity-fair/assets/logo-header.ea437ae89b8c3c7aabbb46bb45a04f1a514e5803.svg", "https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/16:9/w_1280,c_limit/image.jpg", "https://media.vanityfair.com/photos/625d833d330189422634d876/16:9/w_748%2Cc_limit/VF0522_Royals_Camilla.jpg", "https://media.vanityfair.com/photos/62fe7ae3f9f2d6c81700a52c/1:1/w_90%2Cc_limit/A_Headshots_KatieNicholl_Revise.png", "https://media.vanityfair.com/photos/63289e6c9abfd8a85cba4478/1:1/w_350%2Ch_350%2Cc_limit/undefined", "http://www.vanityfair.com/verso/static/vanity-fair/assets/logo-reverse.6ef96ab8686439a35176e2ff8b2c4487e92fbaae.svg", "https://media.vanityfair.com/photos/63407937d495f33c1bec4a49/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/63370d0bb02ed9e1f657fa60/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/61d3359bd385fcb2e0e1ffb3/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/master/w_2560%2Cc_limit/image.jpg", "https://media.vanityfair.com/photos/6328d4009abfd8a85cba4488/16:9/w_748%2Cc_limit/Oct2022-New-Royals-Opener.jpg", "https://media.vanityfair.com/photos/633dac5a42c2d8adf3fa7d9c/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/62b1dbeafa5c67611b2c4679/16:9/w_748%2Cc_limit/prince-william-40th-birthday.jpg", "https://media.vanityfair.com/photos/633e045546d7fce1e25ce391/1:1/w_350%2Ch_350%2Cc_limit/undefined"], "top_img": "https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/16:9/w_1280,c_limit/image.jpg", "keywords": [], "authors": ["Condé Nast", "Katie Nicholl", "September", "April", "June"], "canonical_link": "https://www.vanityfair.com/news/2010/12/william-and-kate-201012", "title": "Wills and the Real Girl", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "width=device-width, initial-scale=1", "referrer": "no-referrer-when-downgrade", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2022", "description": "Royal expert Katie Nicholl surveys the breakups, the other women, and the growing bond between a future King and a country girl.", "id": "54cc225a0a5930502f5fb97b", "keywords": "royals,magazine,archive,kate middleton,prince william,society,royal watch", "news_keywords": "royals,magazine,archive,kate middleton,prince william,society,royal watch", "robots": "index, follow, max-image-preview:large", "content-type": "article", "parsely-post-id": "54cc225a0a5930502f5fb97b", "parsely-metadata": "{\"description\":\"Royal expert Katie Nicholl surveys the breakups, the other women, and the growing bond between a future King and a country girl.\",\"image-16-9\":\"https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/16:9/w_1000,c_limit/image.jpg\",\"image-1-1\":\"https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/1:1/w_1000,c_limit/image.jpg\"}", "og": {"description": "Royal expert Katie Nicholl surveys the breakups, the other women, and the growing bond between a future King and a country girl.", "image": "https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/16:9/w_1280,c_limit/image.jpg", "site_name": "Vanity Fair", "title": "Wills and the Real Girl", "type": "article", "url": "https://www.vanityfair.com/news/2010/12/william-and-kate-201012"}, "article": {"content_tier": "metered", "opinion": "false", "section": "tags", "published_time": "2010-11-04T04:00:00.000Z", "modified_time": "2010-11-04T04:00:00.000Z", "author": "Katie Nicholl"}, "twitter": {"card": "summary_large_image", "creator": "@VanityFair", "description": "Royal expert Katie Nicholl surveys the breakups, the other women, and the growing bond between a future King and a country girl.", "domain": "https://www.vanityfair.com", "image": "https://media.vanityfair.com/photos/54cbf68cba5e6f1344ad4d72/16:9/w_1280,c_limit/image.jpg?mbid=social_retweet", "site": "@VanityFair", "title": "Wills and the Real Girl"}, "fb": {"app_id": 256281040558, "pages": 8810407571}, "google-signin-client_id": "1065629119444-svrqo31taikd2j0ji4dgjs9q3vul4133.apps.googleusercontent.com"}, "movies": [], "publish_date": 1288843200.0, "source": "http://www.vanityfair.com", "summary": ""}