{"url": "https://en.wikipedia.org/wiki/Tonya_Harding", "text": "American former sportswoman (born 1970)\n\nThis article is about the American figure skater. For the Australian softball player, see Tanya Harding . For the Sufjan Stevens song, see Tonya Harding (song)\n\nTonya Maxene Price (née Harding; born November 12, 1970) is an American former figure skater, retired boxer and a reality television personality. Born in Portland, Oregon, Harding was raised primarily by her mother, who enrolled her in ice skating lessons beginning at three years old. Harding spent much of her early life training, eventually dropping out of high school to devote her time to the sport. After climbing the ranks in the U.S. Figure Skating Championships between 1986 and 1989, Harding won the 1989 Skate America competition. She became the 1991 and 1994 U.S. champion before being stripped of her 1994 title, and 1991 World silver medalist. In 1991, she became the first American woman and the second woman in history (after Midori Ito) to successfully land a triple Axel in competition. Harding is a two-time Olympian and a two-time Skate America Champion.\n\nIn January 1994, Harding became embroiled in controversy when her ex-husband, Jeff Gillooly, orchestrated an attack on her fellow U.S. skating rival Nancy Kerrigan. Both women then competed in the February 1994 Winter Olympics, where Kerrigan won the silver medal and Harding finished eighth. On March 16, 1994, Harding accepted a plea bargain in which she pleaded guilty to conspiracy to hinder prosecution. As a result of her involvement in the aftermath of the assault on Kerrigan, the United States Figure Skating Association banned her for life on June 30, 1994.\n\nFrom 2003 to 2004, Harding competed as a professional boxer. Her life has been the subject of many books, films, documentaries, and academic studies. In 2014, two television documentaries were made about Harding's life and skating career (Nancy & Tonya and The Price of Gold), inspiring Steven Rogers to write the film I, Tonya in 2017, in which Harding was portrayed by Australian actress Margot Robbie. In 2018, she was a contestant on season 26 of Dancing with the Stars, finishing in third place. In 2019, she won season 16 of Worst Cooks in America: Celebrity Edition.\n\nEarly life [ edit ]\n\nIce Chalet at Portland's Lloyd Center , where Harding began skating at age four\n\nTonya Maxene Harding was born on November 12, 1970, in Portland, Oregon, to LaVona Golden (b. 1940) and Albert Harding (1933–2009).[2] During Harding's youth, her father held various odd jobs (managed apartments, drove a truck, and worked at a bait & tackle store), yet was often underemployed due to poor health.[3] She was raised in East Portland and began skating at age three, training with coach Diane Rawlinson. During her youth, Harding also hunted, drag raced and learned auto mechanics from her father. LaVona struggled to support the family while working as a waitress and hand-sewed her daughter's skating costumes to save money.[4] Harding's parents divorced after 19 years of marriage in 1987, when she was 16 years old.[5] She dropped out of Milwaukie High School during her sophomore year to focus on skating, and earned a General Educational Development (GED) Certificate in 1988.\n\nHarding claimed she was frequently abused by her mother. She stated that by the time she was seven years old, physical and psychological abuse had become a regular part of her life. LaVona admitted to one instance of hitting Harding at an ice rink.[7] In January 2018, Harding's childhood friend and filmmaker, Sandra Luckow, spoke in defense of Harding's mother because she felt that the 2017 film I, Tonya stretched some truths about LaVona's character. Luckow said that although Harding's mother could be \"egregious\" towards her daughter, LaVona funded and appreciated Harding's skating lessons and had \"a huge amount of humanity\".[8]\n\nIn Harding's 2008 authorized biography, The Tonya Tapes (written by Lynda D. Prouse from recorded interviews with Harding), she said she was the victim of acquaintance rape in 1991[9] and that her half-brother, Chris Davison, molested her on several occasions when she was a child. In 1986, Harding called the police after Davison had been sexually harassing and terrorizing her. He was arrested and spent a short time in prison. Harding said her parents were in denial about Davison's behavior and told her not to press criminal charges against him. Davison was killed in an unsolved vehicular hit-and-run accident in 1988.[10][11] On May 3, 1994, during an interview with Rolonda Watts, Harding said that Davison was the only person in her life unworthy of forgiveness and \"the only person I've ever hated.\"[12]\n\nSkating career [ edit ]\n\nHarding trained as a figure skater throughout her youth with coach Diane Rawlinson. In the mid-1980s, she began working her way up the competitive skating ladder. She placed sixth at the 1986 U.S. Figure Skating Championships, fifth in 1987 and 1988, and third in 1989. After competing in the February 1989 Nationals Championship, Harding began training with Dody Teachman as her coach.[13] She then won the October 1989 Skate America competition, and was considered a strong contender at the February 1990 U.S. Figure Skating Championships. However, she was experiencing the flu and asthma and had a poor free skate. After the original program, she dropped from second place and finished seventh overall. Harding's breakthrough year came in 1991 when, at the U.S. Championships, she completed her first triple Axel in competition on February 16 – the first American woman to execute the jump.[15] She landed seven triple jumps in the long program including the triple Axel.[16] She won the 1991 U.S. Ladies' Singles title with the event's first 6.0 technical merit score since Janet Lynn's 1973 performance at the U.S. Championships.[17] She won the long program when seven of the nine judges gave her first place, and won the competition.[18] She scored eight 5.9s and one 6.0 for technical merit and six 5.9s, one 5.8 and two 5.7s for composition and style.[18] At the March 1991 World Championships, an international event, she again completed the triple Axel. Harding would finish second behind Kristi Yamaguchi and in front of Nancy Kerrigan, marking the first time one country swept the ladies medal podium at the World Figure Skating Championships.[19]\n\nAt the September 1991 Skate America competition, Harding recorded three more firsts:\n\nThe first ever woman to complete a triple Axel in the short program\n\nThe first woman ever to successfully execute two triple Axels in a single competition\n\nThe first ever to complete a triple Axel in combination (with the double toe loop)\n\nDespite these record-breaking performances, after 1991, Harding was never again able to successfully complete the triple Axel in competition; her competitive results began to decline. She and Dody Teachman had briefly parted ways in April 1991, but had reunited in June;[20] Harding was still training under Teachman for the upcoming 1992 season.[21] She placed third in the January 1992 U.S. Figure Skating Championships despite twisting her ankle during practice, and finished fourth in the February 1992 Winter Olympics. On March 1, 1992, Harding gave Teachman a summary dismissal and returned to Diane Rawlinson to be coached by her.[13][22] On March 29, Harding placed sixth in the 1992 World Championships, although she had a better placement at the November 1992 Skate Canada International event finishing fourth.[23][24]\n\nIn January 1994, Harding won the U.S. Championships, but was later stripped of her title: the USFSA disciplinary panel voted to vacate the title in June 1994, following an investigation of the attack on Nancy Kerrigan. In February 1994, Harding was permitted to remain a member of the U.S. Olympic ice skating team, despite brief legal controversy.[25][26] In Lillehammer, after an issue with a broken skate lace in the long program, she was given a re-skate by the judges and finished in eighth place, behind Oksana Baiul (gold) and Nancy Kerrigan (silver).[27] Despite her USFSA ban, however, she did later compete at the professional level, placing second at the ESPN Pro Skating Championship in 1999.[28]\n\nCompetitive highlights [ edit ]\n\n^† In June 1994, Claire Ferguson, the President of the USFSA, voted to strip Harding of her 1994 title. However, the competition results were not changed and the title was left vacant rather than moving all the other competitors up one position.[33]\n\nAssault of Nancy Kerrigan and legal proceedings [ edit ]\n\nNancy Kerrigan [ edit ]\n\nOn January 6, 1994 ( ), one day before the U.S. Figure Skating Championship first Ladies' Singles competition, Nancy Kerrigan was attacked in a corridor after a practice session at the Detroit Cobo Arena. The aftermath of the attack was recorded on a news camera and broadcast around the world. The assailant was Shane Stant, contracted to break her right knee; he turned himself in to the FBI in Phoenix on January 14.[34] Stant and his uncle, Derrick Smith, were hired for this assault by Harding's ex-husband, Jeff Gillooly, and her bodyguard Shawn Eckardt.[35] After failing to find Kerrigan in Massachusetts, Stant had taken a 20-hour bus trip to Detroit.[36] Nancy Kerrigan was walking behind a curtain when Stant rushed behind her. Using both hands, he swung a 21-inch (53 cm) ASP telescopic baton at her right leg, striking above her knee. The attack was intended to seriously injure Kerrigan so that she could not compete in the Nationals (Kerrigan was the defending 1993 Champion) nor the Winter Olympics. Kerrigan's leg was not broken but severely bruised, forcing her to withdraw from the Championships and forgo competing to retain the U.S. Ladies' title.[37] On January 8, Harding won the U.S. title; she and Kerrigan were then both selected for the 1994 Olympic team.[36]\n\nOn January 11, Harding was interviewed for KOIN-TV in Portland, Oregon. Harding was asked whether someone she knew could have planned the attack. Harding replied, \"I have definitely thought about it.\" Gillooly stood in her view behind the camera during the interview. The interview ended with Harding saying, \"No one controls my life but me...if there's something in there that I don't like, I'm going to change it.\"[38][39][40] Harding also confirmed she had spoken with FBI agents in Detroit and again in Portland.[41] On January 13, Eckardt and Smith were arrested.[42][43] On January 14, the United States Figure Skating Association (USFSA) made a statement on whether Eckardt's arrest affected Harding's Olympic placement: \"We will deal only with the facts.\"[44][45] Harding and Gillooly's separate lawyers confirmed the couple were in daily contact and cooperation with law enforcement.[46] On January 15, Harding and Gillooly spoke with reporters, but declined to comment about the investigation.[47] On January 16, Harding's lawyer held a press conference in which he read a statement denying Harding's involvement in the attack on Kerrigan.[48][49] Harding left her home that evening to practice with her coaches, where she spoke with reporters and performed a triple Axel.[50][51][52]\n\nHarding's confession [ edit ]\n\nHarding's practice sessions at Clackamas Town Center , in preparation for the 1994 Winter Olympics, were attended by thousands of spectators and dozens of reporters and film crews.\n\nOn January 18, 1994, Harding was with her lawyers when she submitted to questioning by the DA and FBI.[53] She was interviewed for over ten hours. Eight hours into the interview, her lawyer read a statement declaring her separation from Gillooly: \"I continue to believe that Jeff is innocent of any wrongdoing. I wish him nothing but the best\".[54] Her full FBI transcript was released on February 1. The Seattle Times reported on the transcript, stating that Harding had \"changed her story well into a long interview...After hours of denying any involvement in trying to cover up the plot, an FBI agent finally told [her] that he knew she had lied to him, that he would tell her exactly how she had lied to him.\"[55] In the transcript's final passage, Harding stated \"I hope everyone understands. I'm telling on someone I really care about. I know now [Jeff] is involved. I'm sorry.\"[1] On January 19, Gillooly surrendered to the FBI.[56] On January 20, Diane Sawyer asked Harding on Primetime about the case. Harding said she had done nothing wrong.[57] On January 27, it was reported Gillooly had been testifying about the attack plot since January 26; possibly implicating Harding as allegedly assisting. Harding's close friend Stephanie Quintero, with whom she was living, spoke to reporters on her behalf: \"[Tonya] was shocked, very hurt. She was believing in [Jeff].\"[58][59][60] Harding later held a press conference to read a prepared statement. She said she was sorry Kerrigan was attacked, that she respected Kerrigan, and claimed not to know in advance of the plot to disable her. Harding took responsibility \"for failing to report things [about the assault] when I returned home from Nationals [on January 10]. Failure to immediately report this information is not a crime.\"[61][62] Many states' laws, including Oregon's, state that the act of concealing criminal knowledge alone is not a crime.[63]\n\nThe attack on Kerrigan received a substantial amount of publicity, and news media crews camped outside Harding's home.[64] In January 1994, the story was on the covers of Sports Illustrated, Newsweek, and TIME.[65] There was now much speculation about Harding's alleged involvement in the assault plot.[66][67][68][69] Because Harding and Kerrigan would be representing the US in the February Lillehammer Olympics, speculation reached a media frenzy.[70][71] Abby Haight and J.E. Vader, reporters for The Oregonian, wrote a biography of Harding called Fire on Ice, which included excerpts of her January 18th FBI interview.[72]\n\nMen's guilty pleas and sentencing [ edit ]\n\nOn February 1, Gillooly's attorney negotiated a plea bargain in exchange for testimony regarding all involved parties in the attack. In July, he was sentenced to two years in prison and publicly apologized to Kerrigan – adding \"any apology coming from me rings hollow.\"[73] Gillooly and Eckardt pleaded guilty to racketeering; Stant and Smith (who drove the getaway car and funneled money) pleaded guilty to conspiracy to commit second-degree assault.[74][28] Judge Donald Londer noted the attack could have injured Kerrigan more seriously.[75] Eckardt died in 2007.[76]\n\nUSFSA disciplinary panel [ edit ]\n\nOn February 5, the USFSA disciplinary panel stated there were reasonable grounds to believe Harding had violated the sport's code of ethics.[77] Her admitted failure to report about an assault on a fellow competitor, supported by her FBI transcripts, led to Harding being formally charged with \"[making] false statements about her knowledge\". The USFSA recommended that she face a disciplinary hearing. Claire Ferguson, president of the USFSA, decided not to suspend Harding's membership before a hearing took place. If she had been suspended, she likely still would have competed at the Olympics after filing suit, seeking an injunction against the USFSA, and asserting her rights under the Amateur Sports Act of 1978.[78] The panel examined evidence including the testimonies of Stant and Smith, Harding and Gillooly's telephone records, and notes found in a Portland saloon trash bin on January 30.[79] Harding was given 30 days to respond.[80]\n\nHarding and Connie Chung travel to Norway [ edit ]\n\nNews media began attending Harding's Portland practices, also filming her on February 7, running barefoot to stop a tow truck from hauling her illegally parked vehicle.[81] On February 10, Connie Chung interviewed Harding. When asked about Gillooly, Harding said: \"I never did anything to hurt [Jeff]. If I ever did anything, it was to stick up for him and protect him.\"[82] Chung also negotiated to fly on the same airplane with Harding to Oslo, leaving on February 15. Chung admitted she would not have travelled to Norway were it not for the scandal.[83][84]\n\nKerrigan and Harding share ice, Harding's eighth-place finish [ edit ]\n\nFigure skating competitions for the 1994 Winter Olympics were held in the Hamar Olympic Amphitheatre, now known as the CC Amfi\n\nOn February 17, 1994, Harding and Kerrigan shared the ice at a practice session in the Hamar Olympic Amphitheatre. Approximately 400 members of the press were there to document the practice.[85] Scott Hamilton thought the sport was depicted as a \"tabloid event\".[86] It was noted that Nancy Kerrigan chose to wear the same skating costume at the practice session that she was wearing when Stant attacked her.[87][88] Kerrigan later confirmed that her choice of dress that day was deliberate: \"Humor is good, it's empowering.\"[89] The tape-delayed broadcast of the February 23 Ladies' Olympic technical program is one of the most watched telecasts in the US.[90][91] On February 25, Harding finished eighth in the Olympics; Nancy Kerrigan, having recovered from her injury, won the Olympic silver behind gold medalist Oksana Baiul from Ukraine.[27]\n\nGuilty plea, admissions [ edit ]\n\nOn March 9, Judge Owen Panner granted Harding a requested stay until June on her disciplinary hearing.[92][93][94] Meanwhile, Portland authorities stated the criminal investigation would conclude by March 21 with any indictments and a grand jury report to be made at that time.[95]\n\nOn March 16, 1994, Harding pleaded guilty to conspiracy to hinder prosecution as a Class C felony offense at a Multnomah County court hearing. She and her lawyer, Robert Weaver, negotiated a plea bargain ensuring no further prosecution.[96] Judge Donald Londer conducted routine questioning to make certain Harding understood her agreement, that she was entering her plea \"knowingly and voluntarily\". Harding told Londer she was. Her plea admissions were knowing of the assault plot after the fact, settling on a cover story with Gillooly and Eckardt on January 10, witnessing pay phone calls to Smith affirming the story on January 10 and 11, and lying to FBI with the story on January 18.[97][98][99] Law enforcement investigators had been following and videotaping the co-conspirators since January 10; they knew about the pay phone calls.[100][101] Her penalties included three years of probation, a $100,000 fine, and 500 hours community service. She agreed to reimburse Multnomah County $10,000 in legal expenses, undergo a psychiatric examination, and volunteered to give $50,000 to the Special Olympics Oregon (SOOR) charity.[102] Oregon sentencing guidelines carried a maximum penalty of five years in prison.[103]\n\nHarding's plea conditions imposed her U.S. Figure Skating Association resignation, necessitating her withdrawal from the 1994 Worlds (for which she was scheduled to leave on March 17).[104] District attorney Norman Frink said if Harding had not agreed to the plea, she would have faced \"an indictment on all possible charges...punishment was taking away [skating] privilege.\"[97][105]\n\nResponse from defense and USFSA [ edit ]\n\nPhil Knight, CEO of Nike, donated $25,000 toward Harding's legal fees.[106][107] She had also made approximately $600,000 from an Inside Edition deal.[108][109]\n\nWeaver said the plea agreement was satisfactory to Harding, partly because she avoided prison: \"we would have prevailed at trial.\"[102][110] An executive of the USFSA commented \"[We] don't know if Tonya is innocent or guilty...if [she was involved before] the national championship.\"[111] On March 18, Claire Ferguson decided Harding's disciplinary hearing would proceed in June. The USFSA's executive committee met to discuss Harding seeking reinstatement and whether they might strip her of the 1994 National Championship title. Neither issue was decided at that time.[112]\n\nGrand jury indictment [ edit ]\n\nHarding arriving at Portland International Airport amid a crush of reporters after the 1994 Olympics.\n\nOn March 21, 1994, a Portland grand jury issued an indictment stating there was evidence Harding participated in the attack plot. The indictment concluded more than two months of investigation and witness testimonies from Diane Rawlinson; Harding's choreographer Erika Bakacs; freelance figure skating writer Vera Marano; and Eckardt's college instructor and classmates.[113][97][114][115] It stated there was evidence Harding fraudulently used USFSA-provided skating monies to finance the assault. It also read that Harding, Gillooly, Eckardt, Smith, and Stant agreed to \"knowingly cause physical injury ... by means of a dangerous weapon.\" The grand jury said the evidence implied Harding was \"involved from the beginning or very close.\" She was not charged in the indictment due to the terms of her March 16 plea agreement.[93][116]\n\nUSFSA disciplinary panel meeting in June [ edit ]\n\nOn June 29, the USFSA disciplinary panel met for nine hours over two days to consider Harding's alleged role in the attack.[117] On June 30, chairman William Hybl stated,\n\n\"By a preponderance of the evidence, the panel did conclude that she had prior knowledge and was involved prior to the incident. This is based on civil standards, not criminal standards ... bank records, phone records – the way they came together to establish a case.\"\n\nThe panel decided that pertinent FBI reports, court documents, and Harding's March 16 plea agreement presented\n\n\"a clear disregard for fairness, good sportsmanship, and ethical behaviour.\"[92]\n\nHarding did not attend or participate in the two-day hearing. Weaver said the decision disappointed her but was not a surprise, and that she had not decided on an appeal.[33][118] Harding was stripped of her 1994 U.S. Championship title and banned for life from participating in USFSA events as either a skater or coach. The USFSA has no authority over professional skating events, yet Harding was persona non grata on the pro circuit. Few skaters and promoters would work with her, and she did not benefit from the ensuing boom in professional skating after the scandal.[119]\n\nLater interviews [ edit ]\n\nShortly before the 1998 Winter Olympics, the CBS and Fox news divisions re-examined the scandal for two televised special reports.[120][121] Harry Smith hosted the CBS special. He reported that Harding still held to her statement from her press conference given on January 27, 1994: \"I had no prior knowledge of the planned assault on Nancy Kerrigan.\" Smith then interviewed Kerrigan, asking how she responded to that statement. Kerrigan referred to transcripts she had read from Harding's FBI interview on January 18, 1994. After reading through the interrogation of that day, she concluded that \"[Tonya] knew more than she admits.\"[122][114][123] The Fox special report was called Breaking the Ice: The Women of '94 Revisited, hosted by James Brown with interviews of Harding, Gillooly, and Kerrigan.[124] Gillooly (granted a name change to Jeff Stone in 1995) said Harding avoiding prison did not anger him, and that he felt his own punishment was just. Stone reflected on Harding's position of \"limited involvement\" in Kerrigan's attack and speculated that a \"guilty conscience\" still troubled her. Brown then mediated a joint interview with both Kerrigan and Harding present. The two former competitors shared sincere desires for happy families and general well-wishes. Kerrigan said that she hoped Harding could learn from past mistakes and \"find happiness\".[125] Harding said she was grateful to personally express remorse to Kerrigan again.[126]\n\nIn Harding's 2008 biography, The Tonya Tapes (transcribed by Lynda D. Prouse from recorded interviews), she stated that she wanted to call the FBI in 1994 to reveal what she knew, but decided not to when Gillooly allegedly threatened her with death following a gunpoint gang rape by him and two other men she did not know. Gillooly responded with surprise that \"groundless claims\" against him could be published and specifically contended her gang rape accusation to be \"utterly ridiculous\".[127] In 2013, Deadspin sought Gillooly for an interview and he again defended himself against the gunpoint gang rape allegation. He expressed regret that Harding is often \"remembered for what I talked her into doing,\" meaning allegedly plotting to injure Kerrigan.[128][123][129][34][1][130] Gillooly admitted that his past \"stupidity\" was part of Harding's 1994 ruin and maintained that he still considered her a great figure skater. He also said \"I've had it easy, compared to poor Tonya...she tends to be the butt of the joke. It's kind of sad to me.\"[131]\n\nIn 2014, Nancy Kerrigan addressed the scandal during a brief interview with sportscaster Bob Costas: \"Whatever apology Tonya has given, I accept it. It's time for all us – I've always wished [Tonya] well – she has her own family, I have my family. It's time to make that our focus and move on with our lives.\"[132]\n\nLater career [ edit ]\n\nHarding in 2006\n\nOn February 15, 1994, an explicit 1991 videotape clip of Harding topless was shown on A Current Affair; three still frames from this clip were also published in The Sun (a British tabloid newspaper).[133][134] The New York Post reported that Gillooly had supplied the videotaped fragment for an undisclosed sum of money.[135]\n\nOn July 26, 1994, Penthouse announced that its September issue would feature different stills of Harding and Gillooly having sex from the same extended videotape.[136] This 35-minute sex tape would also be copied and marketed exclusively by Penthouse.[137] Both Gillooly and Harding used the same agent to negotiate equal payment on the Penthouse sale.[138]\n\nOn June 22, 1994, in Portland, Oregon, Harding appeared on an AAA professional wrestling show as the manager for wrestling stable Los Gringos Locos. The night's performance included Art Barr and Eddie Guerrero. A promotional musical event was unsuccessful when Harding and her band, the Golden Blades, were booed off the stage at their only performance, in 1995 in Portland.[140][141]\n\nIn 1994, Harding was cast in Breakaway, an action film, the plot centered on Harding being unwittingly involved in an organized crime syndicate's attempt to violently recover $300,000 of stolen money, alongside Teri Fruichantie and Joseph \"Joe\" Estévez. The film was released in 1996.[142]\n\nHarding has also appeared on television, on the game show The Weakest Link: \"15 Minutes of Fame Edition\" in 2002 along with Kato Kaelin,[143] and in March 2008 became a commentator for TruTV's truTV Presents: World's Dumbest....[144]\n\nSince leaving skating and boxing, Harding has worked as a welder, a painter at a metal fabrication company, and a hardware sales clerk at Sears.[145] As of 2017, she stated that she worked as a painter and deck builder.[146] She lives in Vancouver, Washington.[147]\n\nIn August 2019, Harding was seen in a television commercial in the United States promoting Direct Auto Insurance.[148]\n\nBoxing career [ edit ]\n\nIn 2002, Harding boxed against Paula Jones on the Fox Network Celebrity Boxing event, winning the fight. On February 22, 2003, she made her official women's professional boxing debut, losing a four-round split decision against Samantha Browning on the undercard of Mike Tyson vs. Clifford Etienne. Harding's boxing career came about amid rumors that she was having financial difficulties and needed to fight in the ring to earn money.[149] She did another celebrity boxing match, on The Man Show, and won against co-host Doug Stanhope. Stanhope later claimed on his podcast that the fight was fixed because Harding refused to \"fight a man\".[150]\n\nOn March 23, 2004, it was reported that she canceled a planned boxing match against Tracy Carlton in Oakland, California, because of an alleged death threat against her.[151]\n\nOn June 24, 2004, she was defeated by Amy Johnson in a match held in Edmonton, Alberta. Fans reportedly booed Harding as she entered the ring and cheered wildly for Johnson when she won in the third round.[152]\n\nHer boxing career was cut short by her asthma.[153] Her overall record was three wins and three losses.[154]\n\nProfessional boxing record [ edit ]\n\n6 fights 3 wins 3 losses By knockout 0 2 By decision 3 1\n\nOther appearances [ edit ]\n\nAutomobile racing land speed record [ edit ]\n\nOn August 12, 2009, Harding set a new land speed record for a vintage gas coupe with a speed of 97.177 mph (156.391 km/h; 43.442 m/s) driving a 1931 Ford Model A, named Lickity-Split, on the Bonneville Salt Flats.[155][156][157] Her setting of that land speed record was featured on an episode[which?] of TruTV Presents: World's Dumbest... that focused on \"Record Breakers\".[citation needed]\n\nDancing with the Stars [ edit ]\n\nIn April 2018, Harding was announced as one of the celebrities competing on season 26 of Dancing with the Stars. It was a special four-week season only featuring athletes. She was partnered with professional dancer Sasha Farber. The couple reached the finals of the competition, where Harding finished in third place, behind Adam Rippon and Josh Norman.[158]\n\nWorst Cooks in America [ edit ]\n\nIn August 2018, Harding was announced as one of the celebrities who would compete in the fifth celebrity edition of Food Network's Worst Cooks in America, set to broadcast in April 2019. Harding, learning under Chef Anne Burrell, ultimately won the competition. The US$25,000 prize went to her chosen charity of St. Jude Children's Research Hospital.[159]\n\nPersonal life [ edit ]\n\nHarding is the only child of Albert Gordon Harding and LaVona Golden, who had been married three times before and had four other children. The two divorced in 1987. Harding had a tumultuous relationship with her mother, alleging both physical and emotional abuse. She cites one occasion where her mother threw a knife at her, leaving a permanent scar on her arm.[160]\n\nHarding began a relationship with 17-year-old Jeff Gillooly in September 1986 when she was 15. They moved into a home together in 1988 when he worked in distribution at the Oregon Liquor Control Commission.[162] They married on March 18, 1990, when she was 19 and he was 22. In January 1992, Harding told Terry Richard of The Oregonian, \"Jeff always put food on the table and a roof over my head. He paid for my skating for a couple of years. If it hadn't been for him during that time, I wouldn't have been skating.\"[163] They divorced on August 28, 1993.[1] During the autumn of 1993, Gillooly was working part-time managing Harding's career and taking real estate classes.[164][165] Harding and Gillooly had been continuing to see each other since early October 1993 and were sharing a rented chalet[166] in Beavercreek, Oregon until January 18, 1994.[56]\n\nOn October 29, 1996, Harding received media attention after using mouth-to-mouth resuscitation to help revive an 81-year-old woman who collapsed at a bar in Portland while playing video poker.[167]\n\nHarding married Michael Smith in 1995; they divorced in 1996.[168]\n\nOn February 22, 2000, Harding attacked her then-boyfriend Darren Silver, repeatedly punching him in the face and throwing a hubcap at his head. The attack left Silver with a bloodied face and Harding was arrested. She initially pleaded not guilty to misdemeanor charges, but in a May trial in Clark County District Court admitted to attacking Silver and was sentenced to three days in jail, 10 days of community service and a suspended jail sentence of 167 days.[169][170]\n\nShe married 42-year-old Joseph Price on June 23, 2010, when she was 39 years old. She gave birth to a son named Gordon on February 19, 2011.[171]\n\nHarding stated on The Ellen DeGeneres Show on February 26, 2018, that she is still active in skating and practices three times a week. She performed several jumps and spins on the show. She trains with her former coach Dody Teachman.[172]\n\nCultural effects [ edit ]\n\nHarding's life, career, and role in the 1994 attack have been widely referenced in popular culture, including a 2007 primary campaign speech by then-Democratic Presidential nominee Barack Obama in which he said, \"Folks said there's no way Obama has a chance unless he goes and kneecaps the person ahead of us, does a Tonya Harding.\"[173] In 2014, Matt Harkins and Viviana Olen created the Nancy Kerrigan and Tonya Harding Museum in their Brooklyn apartment, collecting and archiving memorabilia related to Nancy Kerrigan and Harding.[174] A contemporaneous Vogue article noted that Harding had developed a \"cult following\" through the years.[175]\n\nRepresentation in other media [ edit ]\n\nAcademic assessment [ edit ]\n\nIn 1995, the book Women on Ice: Feminist Essays on the Tonya Harding/Nancy Kerrigan Spectacle was published, containing numerous essays analyzing Harding's public image. For example, Abigail Feder wrote that there existed \"overdetermined femininity in Ladies' Figure Skating...femininity and athleticism are mutually exclusive concepts in American culture.\"[202] Sam Stoloff wrote that, during the scandal, the media placed a greater emphasis on Harding's class rather than her gender (femininity). He noted how she was subjected to a \"litany of vaguely pejorative or mocking expressions\" associated with \"low class\" cultural attributes, sometimes due to Harding's personal interests and hobbies. Stoloff theorized that Harding represented an American social class that required interpretation (\"the class Other\") as he referenced the anthropological tone of Susan Orlean's 1994 essay \"Figures in a Mall,\" written for The New Yorker.[203][166]\n\nIn academic Sarah Marshall's 2014 essay entitled \"Remote Control: Tonya Harding, Nancy Kerrigan, and the Spectacles of Female Power and Pain\", she noted the pervasive role of the media in the 1994 scandal: \"Somehow, in the scandal's aftermath, the form of the Tonya-bash was able to alchemize even the most chilling details of Tonya's life into tabloid gold.\" Marshall also examined the role of Harding's \"tomboy\" persona in the context of figure skating. She theorized that Harding was rejected by the figure skating ethos because she did not conform – as Marshall believed many figure skaters, including Nancy Kerrigan, did – to appearing as \"beautiful without being sexual, strong without being intimidating, and vulnerable without being weak.\"[204]\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/ba/Flag_of_Germany.svg/23px-Flag_of_Germany.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/23px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Flag_of_Ukraine.svg/23px-Flag_of_Ukraine.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Flag_of_South_Korea.svg/23px-Flag_of_South_Korea.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Hamar_Olympic_Amfi_2006_%28cropped%29.JPG/220px-Hamar_Olympic_Amfi_2006_%28cropped%29.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/EC1835_C_cut.jpg/16px-EC1835_C_cut.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/Tonya_Harding_Olympic_practice_at_Clackamas_Town_Center_1994_3.jpg/220px-Tonya_Harding_Olympic_practice_at_Clackamas_Town_Center_1994_3.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/Tonya_Harding_2006_crop.png/170px-Tonya_Harding_2006_crop.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b9/Flag_of_Oregon.svg/21px-Flag_of_Oregon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Ice_chalet_lloyd_center_portland_oregon_lec_by_andrew_parodi.jpeg/220px-Ice_chalet_lloyd_center_portland_oregon_lec_by_andrew_parodi.jpeg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Sports_icon.png/21px-Sports_icon.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Split-arrows.svg/50px-Split-arrows.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d1/Tonya_harding_returning_from_norway_1994.jpg/220px-Tonya_harding_returning_from_norway_1994.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/Flag_of_France.svg/23px-Flag_of_France.svg.png", "https://upload.wikimedia.org/wikipedia/commons/d/db/Tonya_harding_mac_club_1994_by_andrew_parodi.jpeg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Canada_%28Pantone%29.svg/23px-Flag_of_Canada_%28Pantone%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/Tonya_harding_mac_club_1994_by_andrew_parodi.jpeg/220px-Tonya_harding_mac_club_1994_by_andrew_parodi.jpeg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Silver_medal_icon_%28S_initial%29.svg/16px-Silver_medal_icon_%28S_initial%29.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f3/Flag_of_Russia.svg/23px-Flag_of_Russia.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/9e/Flag_of_Japan.svg/23px-Flag_of_Japan.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/d/db/Tonya_harding_mac_club_1994_by_andrew_parodi.jpeg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Tonya_Harding", "title": "Tonya Harding", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/d/db/Tonya_harding_mac_club_1994_by_andrew_parodi.jpeg", "width": 640, "height": 637}, "title": "Tonya Harding - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}