{"url": "https://www.irishcentral.com/culture/entertainment/ed-sheeran-finally-releases-galway-girl-vid-featuring-saoirse-ronan", "text": "It’s here! Ed Sheeran has finally released the video for his hit song “Galway Girl” featuring none other than Ireland’s own twice Oscar-nominated actress Saoirse Ronan.\n\nShot in the first-person perspective by Sheeran himself as Ronan drags him as a more than willing victim through a hectic night on the town, the latest music video from the international pop star has already racked up close to four million views since its release this morning.\n\nWhile the clip opens with shots of Ed’s recent performances in Dublin, it runs quickly along to Temple Bar where he meets with the infamous Galway Girl (Ronan) who's about to show him the night out of a lifetime.\n\nSomehow magically transported across the country to Galway, the pair race through bars; singing, dancing, playing music and drinking Guinness as the warm pubs, welcoming atmosphere, and great music of the future 2020 European City of Culture are in abundance throughout.\n\nRead more: Saoirse Ronan gave Ed Sheeran a tattoo that was SUPPOSED TO say Galway Girl...\n\nSheeran stopped by Galway to film during his tour dates in Dublin last month and crowds flocked to several city locations when rumors started that he was filming there. The 26-year-old Grammy-award winner was even spotted taking a selfie with some Irish dancers and stopping on Shop Street in Galway to watch a busker, all of which was caught on camera and featured in the video.\n\nNot only that, but the dancers in question were none other than the Hession School of Dance and World champion dancers Matthew Gardiner and Claire Greaney who wowed us earlier this year with their choreography to Sheeran’s songs. The dancers were taking part in a campaign run by Irish dance influencers Fusion Fighters, who started off #Step4Sheeran to get the global Irish dance community involved in the bid for Sheeran to include dancers in the video.\n\nRead more: Ed Sheeran’s Irish granny hears his song about her for the first time (VIDEO)\n\nThe campaign worked down to a tee and the Hession School dancers, who have regularly featured alongside Fusion Fighters this year, look more than excited to dance for the English singer in the video.\n\nMost importantly, however, “Galway Girl” also shows off the now infamous tattoo that Ronan pranked Sheeran into acquiring. You may remember that the singer wished to have “Galway Girl” in the the 23-year-old actress’s handwriting tattooed on his arm but in the spirit of the fun-loving, slightly reckless character she was playing, the New-York born Carlow woman gave him “Galway Grill” instead.\n\ned got a galway girl tattoo and it actually says 'galway grill' :)) pic.twitter.com/yQ0jUSJZVY — amy (@leg0_h0use) April 16, 2017\n\nWhat do you think of Ed Sheeran’s Galway Girl video? Have you ever had this kind of experience in Galway? Let us know all about it in the comments section, below.", "images": ["https://www.irishcentral.com/assets/logo-16e39b7fe5b98d81b41aadfeaec922fdd9601db0321cc52f00e84b8476a103c6.png", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.irishcentral.com/uploads/article/119368/cropped_ed-sheeran-saoirse-ronan.jpg?t=1631896247", "https://www.irishcentral.com/uploads/article/119368/ed-sheeran-saoirse-ronan.jpg?t=1631896247"], "top_img": "https://www.irishcentral.com/uploads/article/119368/ed-sheeran-saoirse-ronan.jpg?t=1631896247", "keywords": [], "authors": ["Frances Mulraney"], "canonical_link": "https://www.irishcentral.com/culture/entertainment/ed-sheeran-galway-girl", "title": "Ed Sheeran releases \"Galway Girl\" video featuring Saoirse Ronan", "meta_data": {"description": "The Irish actress plays the role of Sheeran's perfect Galway girl in this fun-loving video shot on the streets of Galway itself.", "keywords": "IrishCentral, Irish news, Irish entertainment", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "520CEC14D14C6516505096D4F2852213", "google-site-verification": "k1tcCCArJ_qH6ttglDaIGOxsPf4CYCobpgeghCLGdps", "fb": {"pages": 136720375047, "app_id": 108884142471393}, "twitter": {"card": "summary_large_image", "site": "@IrishCentral", "creator": "@IrishCentral"}, "og": {"title": "Ed Sheeran releases \"Galway Girl\" video featuring Saoirse Ronan | IrishCentral.com", "type": "article", "description": "The Irish actress plays the role of Sheeran's perfect Galway girl in this fun-loving video shot on the streets of Galway itself.", "url": "http://www.irishcentral.com/culture/entertainment/ed-sheeran-finally-releases-galway-girl-vid-featuring-saoirse-ronan", "image": "https://www.irishcentral.com/uploads/article/119368/ed-sheeran-saoirse-ronan.jpg?t=1631896247", "site_name": "IrishCentral.com"}, "news_keywords": "Music", "article": {"author": "https://www.irishcentral.com/author/frances-mulraney", "publisher": "https://www.facebook.com/IrishCentral", "published_time": "2017-05-04T14:00:00-04:00", "modified_time": "2021-09-17T12:30:47-04:00", "section": "Entertainment", "tag": "Music"}, "msapplication-TileColor": "#ffffff", "msapplication-TileImage": "/assets/favicons/ms-icon-144x144-0397662ab62ab66ee3c7adda2315b7dd5e80170177dad430460f7428a1c52931.png", "theme-color": "#ffffff", "csrf-param": "authenticity_token", "csrf-token": "Ka568cLxW5zn0bi197nA63Gbdh3xWr/Z6Go5gD9kjtWWEvs/66V3qHHSblAtqsV3YkUJQIjHs74rwApFr3qYBA=="}, "movies": [], "publish_date": 1493920800.0, "source": "https://www.irishcentral.com", "summary": ""}