{"url": "en.wikipedia.org/wiki/Julia_Roberts", "text": "American actress (born 1967)\n\nThis article is about the American actress. For other people with the same name, see Julia Roberts (disambiguation) . For the American country music singer, see Julie Roberts . For the British jazz, rock and house music singer, see Juliet Roberts\n\nJulia Fiona Roberts (born October 28, 1967)[1] is an American actress. One of Hollywood's most bankable stars, she is known for her leading roles in films of several genres, from romantic comedies and dramas to thrillers and action films. Many of her films have earned over $100 million worldwide, and six have ranked among the highest-grossing films of their respective years.[2] Her top-billing films have collectively brought in over $3.8 billion globally.[2] She has received various accolades, including an Academy Award, a British Academy Film Award, and three Golden Globe Awards.\n\nFollowing an early breakthrough with appearances in Mystic Pizza (1988) and Steel Magnolias (1989), Roberts established herself as a leading actress when she headlined the romantic comedy Pretty Woman (1990), which grossed $464 million worldwide. She went on to star in numerous successful films, including Sleeping with the Enemy (1991), Hook (1991), The Pelican Brief (1993), My Best Friend's Wedding (1997), Notting Hill (1999), Runaway Bride (1999), Erin Brockovich (2000), Ocean's Eleven (2001), Ocean's Twelve (2004), Charlie Wilson's War (2007), Valentine's Day (2010), Eat Pray Love (2010), August: Osage County (2013), and Wonder (2017). For her performance in Erin Brockovich, Roberts won the Academy Award for Best Actress. She received a Primetime Emmy Award nomination for her performance in the HBO television film The Normal Heart (2014) and had her first regular television role in the first season of the Amazon Prime Video psychological thriller series Homecoming (2018).\n\nRoberts was the world's highest-paid actress throughout the majority of the 1990s,[3][4] as well as the first half of the 2000s.[5] Her fee for Pretty Woman (1990) was $300,000,[6] while she was paid an unprecedented $25 million for her role in Mona Lisa Smile (2003). As of 2020 , Roberts' net worth was estimated to be $250 million.[7] People magazine has named her the most beautiful woman in the world a record five times.[8]\n\nEarly life and family\n\nRoberts was born on October 28, 1967, in Smyrna, Georgia, a suburb of Atlanta,[9][unreliable source?] to Betty Lou Bredemus and Walter Grady Roberts.[9][unreliable source?][10] She is of English, Scottish, Irish, Welsh, German, and Swedish descent.[11][12] Her father was a Baptist, her mother a Catholic,[13] and she was raised Catholic.[14][15] Her older brother Eric Roberts (born 1956), from whom she was estranged for several years until 2004, older sister Lisa Roberts Gillan (born 1965), and niece Emma Roberts, are also actors. She also had a younger half-sister named Nancy Motes.\n\nRoberts's parents, one-time actors and playwrights, met while performing in theatrical productions for the armed forces. They later co-founded the Atlanta Actors and Writers Workshop in Atlanta, off Juniper Street in Midtown. They ran a children's acting school in Decatur, Georgia, while they were expecting Julia. The children of Coretta and Martin Luther King Jr. attended the school; Walter Roberts served as acting coach for their daughter, Yolanda.[16] As a thank-you for his service, Mrs. King paid Mrs. Roberts's hospital bill when Julia was born.[17]\n\nHer parents married in 1955. Her mother filed for divorce in 1971; the divorce was finalized in early 1972.[18] From 1972, Roberts lived in Smyrna, Georgia, where she attended Fitzhugh Lee Elementary School, Griffin Middle School, and Campbell High School.[19] In 1972, her mother married Michael Motes, who was abusive and often unemployed; Roberts despised him.[20] The couple had a daughter, Nancy, who died at 37 on February 9, 2014, of an apparent drug overdose.[21] The marriage ended in 1983, with Betty Lou divorcing Motes on cruelty grounds; she had stated that marrying him was the biggest mistake of her life.[20] Roberts's own father died of cancer when she was ten.[22]\n\nRoberts wanted to be a veterinarian as a child.[23] She played the clarinet in her school band.[24][25] After graduating from Smyrna's Campbell High School, she attended Georgia State University but did not graduate. She later headed to New York City to pursue a career in acting. Once there, she signed with the Click Modeling Agency and enrolled in acting classes.[26][27]\n\nCareer\n\nEarly work and breakthrough (1987–1989)\n\nFollowing her first television appearance as a juvenile rape victim in the first season of the series Crime Story, with Dennis Farina, in the episode \"The Survivor\", broadcast on February 13, 1987, Roberts made her big screen debut with an appearance in the dramedy Satisfaction (1988), alongside Liam Neeson and Justine Bateman, as a band member looking for a summer gig. She had filmed a small role in 1987 opposite her brother Eric, in Blood Red, though she only had two words of dialogue, and it was not released until 1989. In 1988, Roberts had a role in the fourth-season finale of Miami Vice and her first critical success with moviegoers came with the independent romantic comedy Mystic Pizza,[28] in which she played a Portuguese-American teenage girl working as a waitress at a pizza parlor. Roger Ebert found Roberts to be a \"major beauty with a fierce energy\" and observed that the film \"may someday become known for the movie stars it showcased back before they became stars. All of the young actors in this movie have genuine gifts\".[29]\n\nIn Steel Magnolias (1989), a film adaptation of Robert Harling's 1987 play of the same name, Roberts starred as a young bride with diabetes, alongside Sally Field, Dolly Parton, Shirley MacLaine and Daryl Hannah. The filmmakers were looking at both Laura Dern and Winona Ryder when the casting director insisted they saw Roberts, who was then filming Mystic Pizza.[30] Harling stated: \"She walked into the room and that smile lit everything up and I said 'that's my sister', so she joined the party and she was magnificent\".[30] Director Herbert Ross was notoriously tough on newcomer Roberts, with Sally Field admitting that he \"went after Julia with a vengeance. This was pretty much her first big film\".[30] Nevertheless, the film was a critical and commercial darling when it was released,[31] and Roberts received both her first Academy Award nomination (as Best Supporting Actress) and first Golden Globe Award win (Motion Picture Best Supporting Actress) for her performance.[28]\n\nWorldwide recognition (1990–1999)\n\nCatapulting on her 1989 Academy Award nomination, Roberts gained further notice from worldwide audiences when she starred with Richard Gere in the Cinderella–Pygmalionesque story, Pretty Woman, in 1990, playing an assertive freelance hooker with a heart of gold.[28] Roberts won the role after Michelle Pfeiffer, Molly Ringwald, Meg Ryan, Jennifer Jason Leigh, Karen Allen, and Daryl Hannah (her co-star in Steel Magnolias) turned it down.[32] The role also earned her a second Oscar nomination, this time as Best Actress, and second Golden Globe Award win, as Motion Picture Best Actress (Musical or Comedy).[28] Pretty Woman saw the highest number of ticket sales in the U.S. ever for a romantic comedy,[33] and made $463.4 million worldwide.[34] The red dress Roberts wore in the film has been considered one of the most famous gowns in cinema.[35][36][37]\n\nHer next film release following Pretty Woman was Joel Schumacher's supernatural thriller Flatliners (also 1990), in which Roberts starred as one of five students conducting clandestine experiments that produce near-death experiences. The production was met with a polarized critical reception, but became a profit at the box office and has since been considered a cult film.[38] In 1991, Roberts played a battered wife attempting to begin a new life in Iowa in the thriller Sleeping with the Enemy, a winged, six-inch-tall tomboyish Tinkerbell in Steven Spielberg's fantasy film Hook and an outgoing yet cautious nurse in her second collaboration with director Joel Schumacher, the romance drama Dying Young. Although negative reviews greeted her 1991 outings, Sleeping with the Enemy grossed $175 million, [39] Hook $300.9 million[40] and Dying Young $82.3 million[41] globally.\n\nRoberts took a two-year hiatus from the screen, during which she made no films other than a cameo appearance in Robert Altman's The Player (1992). In early 1993, she was the subject of a People magazine cover story asking, \"What Happened to Julia Roberts?\".[42] Roberts starred with Denzel Washington in the thriller The Pelican Brief (1993), based on John Grisham's 1992 novel of the same name.[28] In it, she played a young law student who uncovers a conspiracy, putting herself and others in danger. The film was a commercial success, grossing $195.2 million worldwide.[43][44] None of her next film releases —I Love Trouble (1994), Prêt-à-Porter (1994) and Something to Talk About (1995)— were particularly well received by critics nor big box office draws.[45][46][47] In 1996, she guest-starred in the second season of Friends (episode 13, \"The One After the Superbowl\"),[48] and appeared with Liam Neeson in the historical drama Michael Collins,[28] portraying Kitty Kiernan, the fiancée of the assassinated Irish revolutionary leader. Stephen Frears' Mary Reilly, her other 1996 film, was a critical and commercial failure.[49][50]\n\nBy the late 1990s, Roberts enjoyed renewed success in the romantic comedy genre. In P. J. Hogan's My Best Friend's Wedding (1997), she starred opposite Dermot Mulroney, Cameron Diaz and Rupert Everett, as a food critic who realizes she's in love with her best friend and tries to win him back after he decides to marry someone else. Considered to be one of the best romantic comedies of all time, Rotten Tomatoes gave the film an approval rating of 73% based on 59 reviews, with the critical consensus reading, \"Thanks to a charming performance from Julia Roberts and a subversive spin on the genre, My Best Friend's Wedding is a refreshingly entertaining romantic comedy.\"[51][52][53] The film was a global box-office hit, earning $299.3 million.[54] In her next film, Richard Donner's political thriller Conspiracy Theory (1997), Roberts starred with Mel Gibson as a Justice Department attorney. Mick LaSalle of San Francisco Chronicle stated: \"When all else fails, there are still the stars to look at—Roberts, who actually manages to do some fine acting, and Gibson, whose likability must be a sturdy thing indeed.\"[55] The film, nevertheless, grossed a respectable $137 million.[56] In 1998, Roberts appeared on the television series Sesame Street opposite the character Elmo, and starred in the drama Stepmom, alongside Susan Sarandon,[57] revolving around the complicated relationship between a terminally-ill mother and the future stepmother of her children. While reviews were mixed,[57] the film made $159.7 million worldwide.[58]\n\nRoberts paired with Hugh Grant for Notting Hill (1999), portraying a famous actress who falls in love with a struggling book store owner. The film displaced Four Weddings and a Funeral as the biggest British hit in the history of cinema, with earnings equalling $363 million worldwide.[59] An exemplar of modern romantic comedies in mainstream culture, the film was also received well by critics. CNN reviewer Paul Clinton called Roberts \"the queen of the romantic comedy [whose] reign continues\", and remarked: \"Notting Hill stands alone as another funny and heartwarming story about love against all odds.\"[60] In 1999, she also reunited with Richard Gere and Garry Marshall for Runaway Bride, in which she played a woman who has left a string of fiancés at the altar. Despite mixed reviews,[61][62][63][64] Runaway Bride was another financial success, grossing $309.4 million around the globe.[65] Roberts was a guest star in \"Empire\", a Season 9 episode of the television series Law & Order, with regular cast member Benjamin Bratt, who at the time, was her boyfriend. Her performance earned her a nomination for Primetime Emmy Award for Outstanding Guest Actress in a Drama Series.[66]\n\nEstablished actress (2000–2007)\n\nRoberts became the first actress to be paid $20 million for a film,[67] when she took on the role of real-life environmental activist Erin Brockovich in her fight against the Pacific Gas and Electric Company (PG&E) of California, in Erin Brockovich (2000). Peter Travers of Rolling Stone wrote, \"Roberts shows the emotional toll on Erin as she tries to stay responsible to her children and to a job that has provided her with a first taste of self-esteem\",[68] while Entertainment Weekly critic Owen Gleiberman felt that it was a \"delight to watch Roberts, with her flirtatious sparkle and undertow of melancholy\".[69] Erin Brockovich made $256.3 million worldwide,[70] and earned Roberts the Academy Award for Best Actress, among numerous other accolades. In 2000, she also became the first actress to make The Hollywood Reporter's list of the 50 most influential women in show business since the list had begun in 1992,[3] and her Shoelace Productions company received a deal with Joe Roth.[71]\n\nHer first film following Erin Brockovich was the road gangster comedy The Mexican (2001), giving her a chance to work with long-time friend Brad Pitt. The film's script was originally intended to be filmed as an independent production without major motion picture stars, but Roberts and Pitt, who had for some time been looking for a project they could do together, learned about it and decided to sign on. Though advertised as a typical romantic comedy star vehicle, the film does not focus solely on the actors' relationship and the two shared relatively little screen time together. The Mexican earned $66.8 million in North America.[72] In Joe Roth's romantic comedy America's Sweethearts (2001), Roberts starred as the once-overweight sister and assistant of a Hollywood actress, along with Billy Crystal, John Cusack, and Catherine Zeta-Jones. Critics' felt that despite its famous cast, the production lacked \"sympathetic characters\" and was \"only funny in spurts.\"[73] A commercial success, it grossed over $138 million worldwide, however.[74] In her last film released in 2001, Roberts teamed with Erin Brockovich director Steven Soderbergh for Ocean's Eleven, a remake of the 1960 film of the same name, featuring an ensemble cast including George Clooney, Brad Pitt, and Matt Damon. Roberts played Tess Ocean, the ex-wife of leader Danny Ocean (Clooney), originally played by Angie Dickinson. A success with critics and at the box office alike, Ocean's Eleven became the fifth highest-grossing film of the year with a total of $450 million worldwide.[75]\n\nRoberts in 2002\n\nRoberts received a record $25 million, the highest ever earned by an actress at that time, to portray a forward-thinking art history professor at Wellesley College in 1953, in Mike Newell's drama Mona Lisa Smile.[76] The film garnered largely lukewarm reviews by critics, who found it \"predictable and safe\", but made over $141 million in theaters.[77] In 2004, Roberts replaced Cate Blanchett in the role of an American photographer for Mike Nichols's film Closer, a romantic drama written by Patrick Marber, based on his award-winning 1997 play of the same name,[78] co-starring Jude Law, Natalie Portman and Clive Owen.[78] She next reprised the role of Tess Ocean in Ocean's Twelve, which was deliberately much more unconventional than the first film, epitomized by a sequence in which Roberts's character impersonates the real-life Julia Roberts, due to what the film's characters believe is their strong resemblance.[79] Though less well reviewed than Eleven, the film became another major success at the box office, with a gross of $363 million worldwide.[80][81] In 2005, she was featured in the music video for the single \"Dreamgirl\" by the Dave Matthews Band. It was her first music video appearance.[82] Roberts appeared in The Hollywood Reporter's list of the 10 highest-paid actresses every year from 2002 (when the magazine began compiling its list) to 2005.[5]\n\nIn 2006, Roberts voiced a nurse ant in The Ant Bully and a barn spider in Charlotte's Web.[83][84] She made her Broadway debut on April 19, 2006, as Nan in a revival of Richard Greenberg's 1997 play Three Days of Rain opposite Bradley Cooper and Paul Rudd. Although the play grossed nearly $1 million in ticket sales during its first week[85] and was a commercial success throughout its limited run, her performance drew criticism. Ben Brantley of The New York Times described Roberts as being fraught with \"self-consciousness (especially in the first act) [and] only glancingly acquainted with the two characters she plays.\"[86] Brantley also criticized the overall production, writing that \"it's almost impossible to discern its artistic virtues from this wooden and splintered interpretation, directed by Joe Mantello.\"[86] Writing in the New York Post, Clive Barnes declared, \"Hated the play. To be sadly honest, even hated her. At least I liked the rain—even if three days of it can seem an eternity.\"[87] In Mike Nichols' biographical drama Charlie Wilson's War (2007), Roberts starred as socialite Joanne Herring, the love interest of Democratic Texas Congressman Charles Wilson, opposite Tom Hanks and Philip Seymour Hoffman .[88] The film received considerable acclaim,[89] made $119.5 million worldwide,[90] and earned Roberts her sixth Golden Globe nomination.[91]\n\nCareer fluctuations (2008–2016)\n\nThe independent drama Fireflies in the Garden, in which Roberts played a mother whose death sets the story in motion, was screened at the 2008 Berlin International Film Festival before being shown in European cinemas—it did not get a North American release until 2011.[92] Roberts played a CIA agent collaborating with another spy to carry out a complicated con, opposite Clive Owen, in the comic thriller Duplicity (2009).[93] Despite mixed reviews and moderate box office returns,[94] critic A. O. Scott praised her performance: \"Ms. Roberts has almost entirely left behind the coltish, America's-sweetheart mannerisms, except when she uses them strategically, to disarm or confuse. [...] She is, at 41, unmistakably in her prime\".[95] She received her seventh Golden Globe nomination for her role.\n\nEat Pray Love in 2010 Roberts at the French premiere ofin 2010\n\nIn 2010, Roberts played a U.S. Army captain on a one-day leave, as part of a large ensemble cast, in the romantic comedy Valentine's Day, and starred as an author finding herself following a divorce in the film adaptation of Eat Pray Love. While she received $3 million up front against 3 percent of the gross for her six-minute role in Valentine's Day,[96] Eat Pray Love had the highest debut at the box office for Roberts in a top-billed role since America's Sweethearts.[97][98] She appeared as the teacher of a middle-aged man returning to education in the romantic comedy Larry Crowne, opposite Tom Hanks, who also served as the director.[99] The film was poorly received by critics and audiences,[100] although Roberts's comedic performance was praised.[101] In Mirror Mirror (2012), the Tarsem Singh adaptation of Snow White, Roberts portrayed Queen Clementianna, Snow White's evil stepmother, opposite Lily Collins.[102] Peter Travers of Rolling Stone felt that she tried \"way too hard\" in her role,[103] while Katey Rich of Cinema Blend observed that she \"takes relish in her wicked [portrayal] but could have gone even further with it\".[104] Mirror Mirror made $183 million globally.\n\nIn 2013, Roberts starred alongside Meryl Streep and Ewan McGregor in the black comedy drama August: Osage County, about a dysfunctional family that re-unites into the familial house when their patriarch suddenly disappears.[105] Her performance earned her nominations for the Golden Globe Award, Screen Actors Guild Award, Critics' Choice Award, and Academy Award for Best Supporting Actress, amongst other accolades.[106][107][108][109] It was her fourth Academy Award nomination.[110] In 2014, Roberts starred as Dr. Emma Brookner, a character based on Dr. Linda Laubenstein,[111][112] in the television adaptation of Larry Kramer's AIDS-era play, The Normal Heart, which aired on HBO; the film was critically acclaimed and Vanity Fair, in its review, wrote: \"Roberts, meanwhile, hums with righteous, Erin Brokovich-ian anger. Between this and August: Osage County, she's carving out a nice new niche for herself, playing brittle women who show their love and concern through explosive temper\".[113] Her role garnered her a nomination for the Primetime Emmy Award for Outstanding Supporting Actress in a Miniseries or a Movie.[114]\n\nRoberts narrated \"Women in Hollywood\", an episode of the second season of Makers: Women Who Make America, in 2014,[115] and appeared in Givenchy's spring–summer campaign in 2015.[116][117] She starred as a grieving mother opposite Nicole Kidman and Chiwetel Ejiofor in Secret in Their Eyes (2015), a remake of the 2009 Argentine film of the same name, both based on the novel La pregunta de sus ojos by author Eduardo Sacheri.[118] Unlike the original film, the American version received negative reviews and failed to find an audience.[119] Donald Clarke of Irish Times concluded that a \"sound job\" by the cast \"can't quite shake the whiff of compromise that hangs around the project\".[120] In 2016, Roberts reunited with Garry Marshall and reportedly received a $3 million fee for a four-day shoot, playing an accomplished author who gave her child for adoption, in the romantic comedy Mother's Day, which had a lackluster critical and commercial response.[121] Her next film release was Jodie Foster's thriller Money Monster, in which she starred as a television director, alongside George Clooney and Jack O'Connell.[122] Sandra Hall of The Sydney Morning Herald stated: \"It may be Hollywood melodrama but it's top of the range, giving Clooney and Roberts every opportunity to demonstrate the value of star power.\"[123] The film made a respectable $93.3 million worldwide.[124][125]\n\nRecent roles (2017–present)\n\nIn Wonder (2017), the film adaptation of the 2012 novel of the same name by R. J. Palacio, Roberts played the mother of a boy with Treacher Collins syndrome.[126] The Times felt that she \"lifts every one of her scenes in Wonder to near-sublime places\".[127][128] With a worldwide gross of $305.9 million, Wonder emerged as one of Roberts's most widely seen films.[129] In 2017, she also voiced a motherly Smurf leader in the animated film Smurfs: The Lost Village.[130]\n\nRoberts portrayed the mother of a troubled young man in Peter Hedges's drama Ben Is Back (2018). Shaun Kitchener of Daily Express remarked: \"Roberts is often the best, or one of the best, things about any film she's in —and Ben Is Back is no different\".[131] The role of a caseworker at a secret government facility, in the first season of the psychological thriller series Homecoming, was Roberts' first regular television project.[132] The series, which premiered on Amazon Video in November 2018, garnered acclaim from critics, who concluded it was an \"impressive small-screen debut\" for Roberts that \"balances its haunting mystery with a frenetic sensibility that grips and doesn't let go.\"[133][134] She received a Golden Globe nomination for Best Actress in a Television Series – Drama.[135]\n\nRoberts will reunite with George Clooney for the romantic comedy Ticket to Paradise, which is set to be released by Universal Pictures on October 21, 2022.[136] She also signed on to play Martha Mitchell, a controversial figure throughout the Watergate scandal, in the political thriller television series Gaslit, based on the first season of the podcast Slow Burn by Leon Neyfakh.\n\nRoberts will also appear as Amanda in the upcoming film Leave the World Behind, appearing alongside Ethan Hawke. The movie is an adaptation of a novel by Rumaan Alam. Moreover, the film is produced by Barack and Michelle Obama’s company, Higher Grounds Productions.[137]\n\nOther ventures\n\nPhilanthropy\n\nRoberts has contributed to UNICEF as well as other charitable organizations. Her six-day visit to Port-au-Prince, Haiti in 1995, as she said, \"to educate myself\",[138][139] was expected to trigger an outburst of donations —$10 million in aid was sought at the time— by UNICEF officials.[138][139] In 2006, she became a spokeswoman for Earth Biofuels as well as chair of the company's newly formed advisory board promoting the use of renewable fuels.[140] In 2013, she was part of a Gucci campaign, \"Chime for Change\", that aims to spread female empowerment.[141]\n\nIn 2000, Roberts narrated a documentary about Rett syndrome, a neurodevelopmental disorder,[142] designed to help raise public awareness about the disease, and in 2014, she was the voice of Mother Nature in a short film for Conservation International intended to raise awareness about climate change.[143]\n\nProduction company\n\nRoberts runs the production company Red Om Films (Red Om is \"Moder\" spelled backwards, after her husband's last name[144]) with her sister, Lisa Roberts Gillan, and Marisa Yeres Gill.[145] Through Red Om, Roberts has served as an executive producer for various projects she has starred in such as Eat Pray Love and Homecoming, as well as for the first four films of the American Girl film series (based on the American Girl line of dolls), released between 2004 and 2008.[146]\n\nEndorsements\n\nIn 2006, Roberts signed an endorsement deal with fashion label Gianfranco Ferre, valued at $6 million. She was photographed by Mario Testino in Los Angeles for the brand's advertising campaign, which was distributed in Europe, Asia and Australia.[147] Since 2009, Roberts has acted as Lancôme's global ambassador, a role in which she has been involved in the development and promotion of the brand's range of cosmetics and beauty products.[148] She initially signed a five-year extension with the company for $50 million in 2010.[149]\n\nPersonal life\n\nRelationships and family\n\nRoberts had romantic relationships with actors Jason Patric, Liam Neeson, Kiefer Sutherland, Dylan McDermott, and Matthew Perry.[150][151] She was briefly engaged to Sutherland; they broke up three days before their scheduled wedding on June 11, 1991.[152] On June 25, 1993, she married country singer Lyle Lovett; the wedding took place at St. James Lutheran Church in Marion, Indiana.[153] They separated in March 1995 and subsequently divorced.[154] From 1998 to 2001, Roberts dated actor Benjamin Bratt.[155]\n\nRoberts and her husband, cameraman Daniel Moder, met on the set of her film The Mexican in 2000 while she was still dating Bratt. At the time, Moder was married to Vera Steimberg. He filed for divorce a little over a year later, and after it was finalized, he and Roberts wed on July 4, 2002,[156] at her ranch in Taos, New Mexico.[157] Together, they have three children: twins, a daughter and a son, born in November 2004,[158] and another son born in June 2007.[159]\n\nReligion\n\nIn 2010, Roberts said she was Hindu, having converted for \"spiritual satisfaction\".[160][161] Roberts is a devotee of the guru Neem Karoli Baba (Maharaj-ji), a picture of whom drew Roberts to Hinduism.[162]\n\nIn September 2009, Swami Daram Dev of Ashram Hari Mandir in Pataudi, where Roberts was shooting Eat Pray Love, gave her children new names after Hindu gods: Laxmi for Hazel, Ganesh for Phinnaeus and Krishna Balram for Henry.[163]\n\nFilmography and accolades\n\nRoberts' films that have earned the most at the box office, as of 2021 , include:[164]\n\nRoberts has received four Academy Award nominations, winning for Best Actress at the 73rd Academy Awards, for her titular portrayal in Erin Brockovich, which additionally earned her a Golden Globe, a BAFTA Award and a Screen Actors Guild Award. She won Golden Globe Awards for her performances in Steel Magnolias and Pretty Woman,[165] and as of 2019, has garnered eight nominations. Roberts received two Primetime Emmy Awards nominations, one for Outstanding Guest Actress in a Drama Series, for her guest-role on Law & Order, and the other for Outstanding Supporting Actress in a Limited Series or Television Movie, for her performance in The Normal Heart.[166]\n\nReferences", "images": ["http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/d1/Julia_Roberts_2010.jpg/170px-Julia_Roberts_2010.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Julia_Roberts_in_May_2002.jpg/170px-Julia_Roberts_in_May_2002.jpg", "http://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/80/JuliaRoberts90.jpg/170px-JuliaRoberts90.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Julia_Roberts_2011_Shankbone_3.JPG/220px-Julia_Roberts_2011_Shankbone_3.JPG", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Julia_Roberts_%2843838880775%29.jpg/170px-Julia_Roberts_%2843838880775%29.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://en.wikipedia.org/static/images/footer/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Julia_Roberts_2011_Shankbone_3.JPG/1200px-Julia_Roberts_2011_Shankbone_3.JPG", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Julia_Roberts_2011_Shankbone_3.JPG/1200px-Julia_Roberts_2011_Shankbone_3.JPG", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Julia_Roberts", "title": "Julia Roberts", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a6/Julia_Roberts_2011_Shankbone_3.JPG/640px-Julia_Roberts_2011_Shankbone_3.JPG", "width": 640, "height": 964}, "title": "Julia Roberts - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}