{"url": "http://fortune.com/2018/01/19/watch-gold-medalist-aly-raismans-powerful-statement-at-larry-nassers-sentencing/", "text": "Olympic gymnastics gold medalist Aly Raisman delivered a stirring statement at the week-long sentencing hearing of former USA Gymnastics team doctor Larry Nassar, who was convicted last year of sexual abuse.\n\n“You do realize now the women you so heartlessly abused over such a long period of time are now a force, and you are nothing.” said Raisman, who has also accused Nassar of abuse along with fellow gymnasts, at the Ingham County courthouse in Michigan.\n\nNassar has been accused of sexually abusing more than 140 women and girls in his capacity as a sports doctor for both USA Gymnastics and at Michigan State University. In December, he was sentenced to 60 years in prison on federal child pornography charges, and he pleaded guilty to sexual assault charges.\n\n“You are so sick,” Raisman said with Nassar sitting in the court. “You took advantage of our passions and our dreams. I am here to face you, Larry, so you can see I have regained my strength. That I am no longer a victim, I am a survivor.”\n\nRaisman also directed her fury at USA Gymnastics (USGA) and the U.S. Olympic Committee (USOC), calling USGA an organization “rotting from the inside,” and urging both the USGA and USOC to conduct an independent investigation into “how this happened.”\n\n“I have represented the USA in two Olympics and have done so successfully,” Raisman said in her statement. “And both USA Gymnastics and the U.S. Olympic Committee have been very quick to capitalize and celebrate my success, but did they reach out when I came forward? No.”\n\nAs of Friday morning, Raisman was one of 70 women to deliver victim impact statements including teammate Jordyn Wieber, CNN reported. In all, up to 120 women are expected to deliver statements.\n\nFour out of the Fierce Five, the team members who won the team gold medal in 2012, have accused Nassar of sexual abuse. McKayla Maroney wrote an impact statement letter, which was read to the court earlier this week, while Gabby Douglas has also spoken out about Nassar.\n\nOf the Final Five, the nickname for the 2016 gymnastics team, Raisman and Simone Biles have come out with allegations against Nassar.\n\nRaisman’s full testimony is below:", "images": ["https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1242585998-e1665028070836.jpg?w=256&q=75", "https://content.fortune.com/wp-content/uploads/2017/11/gettyimages-498074902.jpg?resize=1200,600", "https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1243767517-e1665076497696.jpg?w=256&q=75", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1243581035-e1665068106964.jpg?w=256&q=75"], "top_img": "https://content.fortune.com/wp-content/uploads/2017/11/gettyimages-498074902.jpg?resize=1200,600", "keywords": [], "authors": [], "canonical_link": "https://fortune.com/2018/01/19/watch-gold-medalist-aly-raismans-powerful-statement-at-larry-nassers-sentencing/", "title": "Watch Gold Medalist Aly Raisman’s Powerful Statement at Larry Nasser’s Sentencing", "meta_data": {"viewport": "width=device-width", "msapplication-TileColor": "#ffc40d", "theme-color": "#ffffff", "description": "In her victim impact statement Raisman also addresses USA Gymnastics and the U.S. Olympic Committee.", "keywords": "Larry Nassar, Aly raisman, Simone Biles, McKayla Maroney, Jordyn Wieber, USA Gymnastics, Me Too, Michigan State University", "og": {"url": "https://fortune.com/2018/01/19/watch-gold-medalist-aly-raismans-powerful-statement-at-larry-nassers-sentencing/", "type": "article", "title": "Watch Gold Medalist Aly Raisman's Powerful Statement at Larry Nasser's Sentencing", "description": "She also called out USA Gymnastics and the U.S. Olympic Committee", "site_name": "Fortune", "image": "https://content.fortune.com/wp-content/uploads/2017/11/gettyimages-498074902.jpg?resize=1200,600", "width": 1024, "height": 683}, "twitter": {"card": "summary_large_image", "title": "Watch Gold Medalist Aly Raisman's Powerful Statement at Larry Nasser's Sentencing", "description": "She also called out USA Gymnastics and the U.S. Olympic Committee", "image": "https://content.fortune.com/wp-content/uploads/2017/11/gettyimages-498074902.jpg?resize=1200,600", "url": "https://fortune.com/2018/01/19/watch-gold-medalist-aly-raismans-powerful-statement-at-larry-nassers-sentencing/"}, "next-head-count": 32}, "movies": ["https://www.youtube.com/embed/aeoeECXFksI?feature=oembed"], "publish_date": 1516320000.0, "source": "http://fortune.com", "summary": ""}