{"url": "https://www.harpersbazaar.com/beauty/makeup/a12780118/yara-shahidi-makeup/", "text": "The new generation of #WomenWhoDare are those who refuse to conform. They dare to do the impossible, encouraging young visionaries to break—not just push—boundaries, inspiring people around the world to fight for what they believe in. Here, black-ish star Yara Shahidi joins our 2017 Women Who Dare series.\n\nYara Shahidi can hold her own in any conversation. When it comes to topics of fashion and beauty, the 17-year-old’s eyes light up (she’s a fan); and she’s just as comfortable chatting about superhero movies (she’s dying to play X-Men’s Storm, Nightcrawler, or Ms. Marvel) as she is popular music (her father was Prince’s photographer for years and her cousin is the rapper Nas, so she’s practically encyclopedic on the subject). But what sets Shahidi apart from many young women her age is not only her ability to engage in more serious discussions surrounding race, gender, and identity issues, but the fact that she's actually leading those conversations.\n\nShahidi is more than an actress—she’s an activist. The college-bound star of black-ish, and the new spin-off series grown-ish, is fearless when it comes to using her voice to effect change and shed light on social injustices. “To be in this industry, as fabulous as it is, it can seem very trivial if there is no grounding meaning behind why you’re doing what you’re doing,” says Shahidi, who will head to Harvard sometime next year when she has a break from filming. “When you’re driven by a certain purpose, for me, it’s helping better anyone’s life. Whether it’s via Twitter or whether it’s choosing my sociology major. I know ultimately I want to help effect change, otherwise I would look at myself in the mirror everyday and think, ‘what in the world am I doing with my life?’”\n\nWhile most celebrities—regardless of age—tip-toe around divisive topics like intersectional feminism, Shahidi boldly addresses them head-on. It’s her passion for knowledge and hunger for education that hasn’t just landed the actress two hit television shows, but also a letter of recommendation from former First Lady Michelle Obama, and her upcoming spot at Harvard University. “I am just a history nerd. That has motivated a whole lot, for me to just understand my society. I have always loved school, but what made it fascinating was finding the ways I was connected to the world around me,” she explains. “I am constantly listening to podcasts, but I do not know everything that there is to know. But I would like to try to. The more you learn about someone, how could you not want to protect them and their rights? The more you learn about a culture or a certain identity, it’s hard to not feel empathy.”\n\nOn Instagram, Shahidi curates a mix of behind-the-scenes video footage from her on-set antics; favorite red carpet fashion and makeup moments; and call-to-action posts for her 1.3 million followers. In the current political climate, how does Shahidi see the role of fashion and beauty? “With everything going on, [fashion and beauty] has actually become more important in my life,” she admits. “I was just going through my closet, and I have so many political T-shirts. It’s ridiculous. It’s all I own right now,” she laughs, listing some of her favorites, like the shirts with senators’ numbers on them, or the shirts about funding Planned Parenthood. Shahidi is of the belief that fashion, makeup, and hair are more than just a visual statement. “It’s really important and there’s a huge conversation around everyone having a safe space. Fashion is one of those places in which when you’re wearing something that feels like a representation of you, it does create, in a matter of speaking, a space for you to exist. Even if it’s just in a two-inch radius of where you are. It’s a walking personalized area in which you can live.”\n\nIt can be easy to forget that Shahidi is only 17, given her bubbly confidence, fierce work ethic, and intrinsic wisdom. It’s why she’s keenly aware of making sure she at least looks her age whenever possible, with the help of her go-to makeup artist Emily Cheng. When she’s not on-set as Zoey Johnson, Shahidi is often in jeans and an aforementioned political T-shirt, usually with natural makeup and hair. “My everyday routine is primarily skincare,” says the actress, who works with Clean & Clear. “I start the day with a cleanser, then I use rose hip oil on my face, then I usually raid my cabinet of goodies that Emily has given me: eye patches or a full face mask. I usually go downstairs and freak my brother’s out with a face mask.” Shahidi is also a huge fan of Glossier, noting that the only makeup she’ll use on a day off is the Boy Brow gel and Balm Dot Com lip balm.\n\nEven on the red carpet, Shahidi and Cheng strive to create fun, fresh looks that strike a balance between wearing couture and being college-bound. That typically translates to a nude lip (Shahidi says Cheng has developed a mix of four colors to create “the perfect nude lipstick for my shade of brown”) and a colorful flick of eyeliner or shadow. For this story, we pushed Shahidi out of her comfort zone with the challenge of wearing some of the season’s boldest takes on classic makeup looks. Game to try—and learn—about anything and everything, Shahidi’s excitement at wearing layers of glitter, yellow eyeliner, and a metallic-and-glossy red lip was contagious. “I am not scared to try much,” she says.\n\nThe New Glitter\n\nGlitter will always be in style. But the new way to wear it involves not just tiny flecks of shimmer strewn across the face, but layer-upon-layer of glittery embellishment. After prepping your lids, use lash or cosmetic glitter glue to stick the first layer of silver flecks and then the silver confetti. Then, using a Tweezer, carefully apply Swarovski crystals (or simple rhinestones) across your eyelid like eyeliner.\n\nGlitters in Silver 2 Make Up For Ever, $15, sephora.com SHOP . Koral Korali Ring Misahara, Price upon request, misahara.com SHOP\n\n.\n\nRed Reinvented\n\nYou'll rarely catch Shahidi rocking a dark or red lipstick. That's because she's a lipgloss aficionado. \"I have every single Chanel color. I am not very possessive over much...take my bed! Take my house! Whatever. But I am oddly possessive over this large box [of gloss]. This is the first time I have felt a twinge of possessiveness.\" To get this liquid metallic, deep-red lip look, Cheng first applied a red metallic pigment on Shahidi's lips, then layered two different Rouge Coco Gloss shades to create the ultimate red lipstick upgrade.\n\nRouge Coco Gloss Moisturizing Glossimer in 772 Chanel, $30, nordstrom.com SHOP . Rouge Coco Gloss Moisturizing Glossimer in 768 Chanel, $30, nordstrom.com SHOP . Star Lit Powder in 8 Antic Red Make Up For Ever, $21, makeupforever.com SHOP . Suspended Earrings Closer by WWAKE, $374, closerbywwake.com SHOP\n\n.\n\nLoud Lashes\n\nAs lash extensions become cartoonishly longer by the minute, it suddenly feels fresh again to go mod with false lashes. Use individual segments or cut-up a strip of lashes and place them across just your bottom lashline. These aren't even trying to pass for natural—and that's precisely the point. On darker skin, a swipe of metallic silver eyeshadow underneath your lower lashes will help the effect really pop.\n\nDido Double Hoop Swarovski Crystal Earrings Dannijo, $289, farfetch.com SHOP . The New Glitter Chanel Ombre Premiére Longwear Powder Eyeshadow in Titane, $30, nordstrom.com SHOP .\n\nGood As Gold\n\n\n\nBlame Rihanna. Ever since her Fenty Beauty Trophy Wife highlighter dropped, we don't want to use any other metallic makeup but classic yellow-gold. Don't be afraid to sweep Trophy Wife (or any other metallic gold pigment) all over your face. Trace it across your eyelids, cheekbones, Cupid's bow, and lips. Sweep it down your neck and across your collarbone and shoulders. Then pop-on a pair of classic gold hoops to amplify the all-golden vibes.\n\nOmbre Premiére Longwear Powder Eyeshadow in Poudre D'Or Chanel, $30, nordstrom.com SHOP\n\n. Kate Gold-Plated Hoop Earrings Jennifer Fisher, $365, net-a-porter.com SHOP . Jamaika String Bodysuit Wolford, $195, neimanmarcus.com SHOP\n\n.\n\nWell Rounded\n\nAt both the Tom Ford and Jason Wu spring 2018 runway shows, cat-eye liner took on a bold new shape. The rounded flick lends a bit of edge to an otherwise classic makeup look. Cheng used two formulas to nail this liner: a liquid formula to first draw the shape, then a cream to reach the most intense black pigment.\n\nCalligraphie de Chanel Longwear Intense Cream Eyeliner Chanel, $35, nordstrom.com SHOP\n\n. McKinley Oval-Frame Acetate Sunglasses Elizabeth and James, $185, net-a-porter.com SHOP .\n\nColor Pop\n\nThe beauty world is having a love affair with the color yellow, but Shahidi doesn't have one favorite color. \"I like bright, light colors. I am really excited about this yellow eye, because yellow is currently my favorite color,\" she says. On set for this shoot, the actress played music from her \"yellow\" playlist—or songs that fit the vibe of the color yellow.\n\nDuo Eyeshadow in Fashion Rebel Nars Cosmetics, $36, narscosmetics.com SHOP . Goldie round-frame gold-tone sunglasses Sunday Somewhere, $340, net-a-porter.com SHOP\n\n.\n\nThe New Flush\n\nIf your blush begins and ends on the apples of your cheeks, you're doing blush wrong. That's because the way you'll want to wear blush in 2018 is the same way people wore it in 1982: swept high across the cheekbones for major impact. To keep the look from veering too costume-y, keep your skin fresh and dewy (so no powder!) and use a blush in a blend-able cream formula. Tap it on lightly, at first, with your finger, warming it into your skin slowly and working from your cheekbones, toward your temples, and across your outer eyelids.\n\nSmall Impatiens Flower Drop Earrings Oscar de la Renta, $350, net-a-porter.com SHOP .\n\nDirected by Carissa Gallo ◦ Director of Photography by Andrew Gallo ◦ Assistant Camera by Keon Javanshir ◦ Hair by Naivasha Johnson for Oribe Haircare ◦ Makeup by Emily Cheng for NARS ◦ Manicure by Emi Kudo ◦ Special Thanks to Smashbox Studios", "images": ["https://hips.hearstapps.com/hmg-prod/images/gretchen-1572986844.png?crop=0.502xw:1.00xh;0.250xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/fallback-1538776437.png?crop=0.466xw:0.933xh;0.250xw,0.0673xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/1-1519249192.jpg", "https://media.hearstapps.com/loop/yellow-glasses-1-1508643832.mp4/poster.jpg", "https://hips.hearstapps.com/hmg-prod/images/1-1519250818.jpg", "https://hips.hearstapps.com/hmg-prod/images/jameela-1572984243.png?crop=0.502xw:1.00xh;0.255xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/jane-patrisse-lead-1537802548.png?crop=0.5624xw:1xh;center,top&resize=180:*", "https://media.hearstapps.com/loop/yaragolden-1508644178.mp4/poster.jpg", "https://hips.hearstapps.com/hmg-prod/images/2-1519249705.jpg", "https://hips.hearstapps.com/hmg-prod/images/3-1519247918.jpg", "https://hips.hearstapps.com/hmg-prod/images/rachel-1572988081.png?crop=0.502xw:1.00xh;0.237xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/laverne-edna-index-1538584100.png?crop=0.502xw:1.00xh;0.245xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/amanda-1572981179.png?crop=0.502xw:1.00xh;0.304xw,0&resize=180:*", "https://media.hearstapps.com/loop/red-lip-1-1508643807.mp4/poster.jpg", "https://hips.hearstapps.com/hmg-prod/images/1-1519250339.jpg", "https://hips.hearstapps.com/hmg-prod/images/header2-1508767615.jpg", "https://hips.hearstapps.com/hmg-prod/images/1-1519250189.jpg", "https://hips.hearstapps.com/hmg-prod/images/maralaison-emmabrown2-1540578388.jpg?crop=1.00xw:0.729xh;0,0.00948xh&resize=180:*", "https://media.hearstapps.com/loop/lashes-1-1508643794.mp4/poster.jpg", "https://hips.hearstapps.com/hmg-prod/images/3-1519249767.jpg", "https://hips.hearstapps.com/hmg-prod/images/1-1519249692.jpg", "https://hips.hearstapps.com/hmg-prod/images/lauren-1572982473.png?crop=0.502xw:1.00xh;0.236xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/2-1519248386.jpg", "https://hips.hearstapps.com/hmg-prod/images/anamaria-mariaarch2-1540578294.jpg?crop=1.00xw:0.730xh;0,0.00948xh&resize=180:*", "https://hips.hearstapps.com/vidthumb/manual_upload/59f10bffe694aa3c4bdce81f/thumb_1508969474.png?crop=1xw:1xh;center,top&resize=480:*", "https://media.hearstapps.com/loop/blush-1-1508643846.mp4/poster.jpg", "https://hips.hearstapps.com/hmg-prod/images/2-1519249173.jpg", "https://hips.hearstapps.com/hmg-prod/images/2-1519250176.jpg", "https://hips.hearstapps.com/hmg-prod/images/1-1519247865.jpg", "https://hips.hearstapps.com/hmg-prod/images/index2-1508767578.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "https://media.hearstapps.com/loop/glitter-1-1508643765.mp4/poster.jpg", "https://hips.hearstapps.com/hmg-prod/images/1-1519248372.jpg", "https://hips.hearstapps.com/hmg-prod/images/2-1519250350.jpg", "https://www.harpersbazaar.com/_assets/design-tokens/harpersbazaar/static/images/logos/network-logo.a5366f4.svg", "https://hips.hearstapps.com/hmg-prod/images/2-1519247901.jpg", "https://hips.hearstapps.com/hmg-prod/images/candace-precious-1-1540817061.png?crop=1.00xw:0.730xh;0,0.0385xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/4-1519247931.jpg", "https://hips.hearstapps.com/hmg-prod/images/chanel-1572986770.png?crop=0.502xw:1.00xh;0.0513xw,0&resize=180:*", "https://media.hearstapps.com/loop/white-sunglasses-1-1508643819.mp4/poster.jpg", "https://hips.hearstapps.com/rover/profile_photos/a5b794e4-ba0e-4527-9e9d-e98142b9fbef_1526586861.jpg?fill=1:1&resize=80:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/index2-1508767578.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.harpersbazaar.com/beauty/makeup/a12780118/yara-shahidi-makeup/", "title": "Yara Shahidi Makeup Routine", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "X-UA-Compatible": "IE=edge,chrom=1", "msapplication-tap-highlight": "no", "title": "Yara Shahidi Makeup Routine - Yara Shahidi Interview", "description": "Yara Shahidi interview about her favorite makeup and skincare products.", "keywords": "Yara Shahidi, blask-ish, grown-ish, Yara Shahidi actress, Yara Shahidi  activist", "theme-color": "#000000", "og": {"site_name": "Harper's BAZAAR", "title": "Yara Shahidi Wears the Coolest Makeup Looks of the Year", "description": "Yara Shahidi goes for bold in this season's new versions of makeup classics.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/index2-1508767578.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.harpersbazaar.com/beauty/makeup/a12780118/yara-shahidi-makeup/", "type": "article"}, "fb": {"app_id": 227018747326504, "pages": 8327967561}, "article": {"publisher": "https://www.facebook.com/HarpersBazaar", "section": "Makeup", "modified_time": "2021-03-10T12:20:46Z", "published_time": "2017-11-06T14:00:00Z"}, "twitter": {"site": "@harpersbazaarus", "image": "https://hips.hearstapps.com/hmg-prod/images/index2-1508767578.jpg?crop=1.00xw:1.00xh;0,0&resize=640:*", "card": "summary_large_image"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/index2-1508767578.jpg?crop=0.501xw:1.00xh;0.250xw,0&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/index2-1508767578.jpg?crop=0.501xw:1.00xh;0.250xw,0&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/index2-1508767578.jpg?crop=0.501xw:1.00xh;0.250xw,0", "auto-publish": "never", "sailthru.excerpt": "The new generation of #WomenWhoDare are those who refuse to conform. They dare to do the impossible, encouraging young visionaries to break—not just push—boundaries, inspiring people around the world to fight for what they believe in. Here, black-ish star Yara Shahidi joins our 2017 Women Who Dare series.Yara Shahidi can", "sailthru.tags": "beauty,Beauty,makeup,Makeup", "sailthru.date": "2017-11-06 14:00:00", "sailthru.socialtitle": "Yara Shahidi Wears the Coolest Makeup Looks of the Year", "sailthru.contenttype": "longform-article", "m1": ".content-hed", "m2": ".content-dek p", "next-head-count": 48}, "movies": [], "publish_date": 1509976800.0, "source": "https://www.harpersbazaar.com", "summary": ""}