{"url": "https://www.billboard.com/articles/news/television/7965993/2017-emmys-announcer-jermaine-fowler-comedian", "text": "There were plenty of winners at the 69th Annual Primetime Emmy Awards Sunday night (Sept. 17), but one of the most-talked about breakout stars hardly got any screen time: comedian Jermaine Fowler.\n\nOn a night filled with endless zingers aimed at Pres. Trump and heartfelt speeches about serious topics, the 29 year-old stand-up was one of the front-runners when it came to commentary about the show hosted by The Late Show‘s Stephen Colbert. Fowler acted as the night’s announcer, adding irreverent quips about the night’s winners and audience members in between segments.\n\nAnd while it was not Fowler’s first appearance on CBS — he stars on the network’s new series Superior Donuts — it was likely his biggest exposure to date and plenty of people had a lot to say about the job he did keeping the show moving along and lively:\n\n— i want Jermaine Fowler to do the voiceover for my life #Emmys — BuzzFeed (@BuzzFeed) September 18, 2017\n\nWhen I hear @jermaineFOWLER I can’t help but smile. So much enthusiasm. #Emmys — Joe Dorvil (@JoeDorvil) September 18, 2017\n\nIt wasn’t all positive reviews, though, which is to be expected when an unknown voice appears unabashedly on a traditional platform. Fowler’s flare should not have come as a surprise given how he is on every other platform. His Instagram bio reads simply, “I do what I want.” According to Entertainment Tonight, Fowler told Kevin Frazer that “they only hired me to be myself. It’s the best job ever. I don’t have to do anything but just talk like this.”\n\nRelated Here Are All the Winners From the 2017 Emmys\n\nFowler made noise on Sunday night by giving the traditionally staid show a fun makeover, interjecting often silly asides into his voiceover work coming in and out of awards speeches and commericals. Among his best bits:\n\n— After John Lightgow took home prize for Best Supporting Actor in a Drama Series for his work on The Crown and thanked the British statesman he portrayed in the show, Fowler enthusiastically quipped: “shout out to Winston Churchill!”\n\n— Celebrating Kate McKinnon’s win for Outstanding Supporting Actress in a Comedy Series, Fowler noted that that she is “a mult-talented musician who can play the guitar, cello and piano… damn!”\n\n— “This is Laura Dern’s first Emmy win in six nominations, get it Laura!” he said when Laura Dern won Best Supporting Actress in a Limited Series or Movie for her work on Big Little Lies.\n\n— Fowler got especially hyped when Aziz Ansari and Lena Waithe won for Best Writing for a Comedy Series, with Waithe becoming the first black woman to win that award. After sharing that distinction, Fowler yelped simply, “LENA!”\n\n— When Don King won for Best Directing for a Variety Series Fowler informed us, “Don’s first national directing job was on the Michael Douglas Show. My grandmother loved that show.”\n\n— He was also psyched for Riz Ahmed’s first Emmy win for Lead Actor in a Limited Series or Movie, for his role in HBO’s The Night Of. “He’s also known by his hip-hop alias Riz MC. And I’m also known by my hip-alias: Jermaine Ahmed.”\n\nOutside of Superior Donuts, Fowler has credits in The Eric Andre Show, BoJack Horseman, Family Guy and his own television special from 2015 titled Give Em Hell Kid. Fowler’s foundation is in stand-up comedy, which explains why he was so comfortable in his role on Sunday (Sept. 17) night.\n\nWhen discussing how white CBS has been in the past in a Complex interview earlier this year — the piece’s title “Meet Jermaine Fowler, the First Black Sitcom Lead on CBS in a Generation” — Fowler told the outlet, “I feel like they had to shake things up in a way. They did with this show… Personally, I can’t tell you why CBS chose right now, but I’ll tell you right now the world around us right now is changing, and I feel like they wanted me in a comedy that reflected that.”\n\nThe same reasoning can be applied to why Fowler was tapped to infuse the Emmys.\n\nMore personally, Fowler is romantically tied to makeup artist Meagan Hester, who gave birth to the couple’s first child — a daughter named Thebe — in July.", "images": ["https://www.billboard.com/wp-content/uploads/media/jermaine-fowler-2017-emmys-billboard-1548.jpg?w=942&h=623&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204652553202666&ev=PageView&noscript=1", "https://www.billboard.com/wp-content/uploads/media/jermaine-fowler-2017-emmys-billboard-1548.jpg?w=1024", "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/public/lazyload-fallback.gif"], "top_img": "https://www.billboard.com/wp-content/uploads/media/jermaine-fowler-2017-emmys-billboard-1548.jpg?w=1024", "keywords": [], "authors": ["Megan Armstrong"], "canonical_link": "https://www.billboard.com/culture/tv-film/2017-emmys-announcer-jermaine-fowler-comedian-7965993/", "title": "Get to Know Jermaine Fowler, the Comedian Who Killed It As the 2017 Emmys Announcer", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/icons/icon-144x144.png", "msapplication-TileColor": "#eff4ff", "description": "There were plenty of winners at Sunday night's (Sept. 17) 69th Annual Primetime Emmy Awards, but one of the most-talked about breakout stars hardly got any screen time: comedian and the night's announcer Jermaine Fowler. Here's what you need to know about him.", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "billboard", "pmc-page_type": "article", "articleid": 7965993, "author": "Megan Armstrong", "pmc-category": "Culture,TV/Film", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-09-18T11:43:39"}, "title": "Get to Know Jermaine Fowler, the Comedian Who Killed It As the 2017 Emmys Announcer", "pageclass": "article", "pmc-is_free": "no", "pmc-always-paywall": "no", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-exclusive": "no", "pmc-breaking-news": "no", "pmc-prime": "no"}, "generator": "WordPress 6.0.2", "author": "Megan Armstrong", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Billboard", "application-name": "Billboard", "content_type": "Article", "post_id": 7965993, "title": "Get to Know Jermaine Fowler, the Comedian Who Killed It As the 2017 Emmys Announcer", "published_at": "2017-09-18 11:43:39", "image": "https://www.billboard.com/wp-content/uploads/media/jermaine-fowler-2017-emmys-billboard-1548.jpg?w=1024", "comment_count": 0, "topics": "TV/Film", "body": "There were plenty of winners at the 69th Annual Primetime Emmy Awards Sunday night (Sept. 17), but one of the most-talked about breakout stars hardly got any screen time: comedian Jermaine Fowler.On a night filled with endless zingers aimed at Pres. Trump and heartfelt speeches about serious topics, the 29 year-old stand-up was one of the front-runners when it came to commentary about the show hosted by The Late Show's Stephen Colbert. Fowler acted as the night's announcer, adding irreverent quips about the night's winners and audience members in between segments.And while it was not Fowler's first appearance on CBS --  he stars on the network's new series Superior Donuts -- it was likely his biggest exposure to date and plenty of people had a lot to say about the job he did keeping the show moving along and lively: .@jermaineFOWLER may be the best #Emmys announcer ever!!— Perez (@ThePerezHilton) September 18, 2017-- i want Jermaine Fowler to do the voiceover for my life #Emmys— BuzzFeed (@BuzzFeed) September 18, 2017The #Emmys hero we didn't know we needed: @jermainefowler— Netflix US (@netflix) September 18, 2017When I hear @jermaineFOWLER I can't help but smile. So much enthusiasm. #Emmys— Joe Dorvil (@JoeDorvil) September 18, 2017It wasn't all positive reviews, though, which is to be expected when an unknown voice appears unabashedly on a traditional platform. Fowler's flare should not have come as a surprise given how he is on every other platform. His Instagram bio reads simply, \"I do what I want.\" According to Entertainment Tonight, Fowler told Kevin Frazer that \"they only hired me to be myself. It's the best job ever. I don't have to do anything but just talk like this.\"Fowler made noise on Sunday night by giving the traditionally staid show a fun makeover, interjecting often silly asides into his voiceover work coming in and out of awards speeches and commericals. Among his best bits:-- After John Lightgow took home prize for Best Supporting Actor in a Drama Series for his work on The Crown and thanked the British statesman he portrayed in the show, Fowler enthusiastically quipped: \"shout out to Winston Churchill!\"-- Celebrating Kate McKinnon's win for Outstanding Supporting Actress in a Comedy Series, Fowler noted that that she is \"a mult-talented musician who can play the guitar, cello and piano... damn!\" -- \"This is Laura Dern's first Emmy win in six nominations, get it Laura!\" he said when Laura Dern won Best Supporting Actress in a Limited Series or Movie for her work on Big Little Lies.-- Fowler got especially hyped when Aziz Ansari and Lena Waithe won for Best Writing for a Comedy Series, with Waithe becoming the first black woman to win that award. After sharing that distinction, Fowler yelped simply, \"LENA!\"-- When Don King won for Best Directing for a Variety Series Fowler informed us, \"Don's first national directing job was on the Michael Douglas Show. My grandmother loved that show.\"-- He was also psyched for Riz Ahmed's first Emmy win for Lead Actor in a Limited Series or Movie, for his role in HBO's The Night Of. \"He's also known by his hip-hop alias Riz MC. And I'm also known by my hip-alias: Jermaine Ahmed.\" Outside of Superior Donuts, Fowler has credits in The Eric Andre Show, BoJack Horseman, Family Guy and his own television special from 2015 titled Give Em Hell Kid. Fowler's foundation is in stand-up comedy, which explains why he was so comfortable in his role on Sunday (Sept. 17) night.When discussing how white CBS has been in the past in a Complex interview earlier this year -- the piece's title \"Meet Jermaine Fowler, the First Black Sitcom Lead on CBS in a Generation\" -- Fowler told the outlet, \"I feel like they had to shake things up in a way. They did with this show… Personally, I can't tell you why CBS chose right now, but I'll tell you right now the world around us right now is changing, and I feel like they wanted me in a comedy that reflected that.”The same reasoning can be applied to why Fowler was tapped to infuse the Emmys.More personally, Fowler is romantically tied to makeup artist Meagan Hester, who gave birth to the couple's first child -- a daughter named Thebe -- in July. At the Emmys with my boo #myboo #2monthpostpregnancy #emmys #jermainefowlerandmeaganhester #powercouple #makeupartistA post shared by Meagan Hester (@meaganhestermakeup) on Sep 17, 2017 at 7:28pm PDT", "fb": {"pages": 75791669580}, "fragment": "!", "og": {"type": "article", "title": "Get to Know Jermaine Fowler, the Comedian Who Killed It As the 2017 Emmys Announcer", "url": "https://www.billboard.com/culture/tv-film/2017-emmys-announcer-jermaine-fowler-comedian-7965993/", "description": "There were plenty of winners at Sunday night’s (Sept. 17) 69th Annual Primetime Emmy Awards, but one of the most-talked about breakout stars hardly got any screen time: comedian and the night…", "site_name": "Billboard", "image": {"identifier": "https://www.billboard.com/wp-content/uploads/media/jermaine-fowler-2017-emmys-billboard-1548.jpg?w=1024", "width": 1024, "height": 677, "alt": "Jermaine Fowler attends the 69th Annual Primetime Emmy Awards"}, "locale": "en_US"}, "article": {"published_time": "2017-09-18T15:43:39+00:00", "modified_time": "2017-09-18T15:51:58+00:00"}, "twitter": {"site": "@billboard", "creator": "@meganKarmstrong", "card": "summary_large_image", "title": "Get to Know Jermaine Fowler, the Comedian Who Killed It As the 2017 Emmys Announcer", "description": "There were plenty of winners at Sunday night's (Sept. 17) 69th Annual Primetime Emmy Awards, but one of the most-talked about breakout stars hardly got any screen time: comedian and the night's announcer Jermaine Fowler. Here's what you need to know about him.", "image": "https://www.billboard.com/wp-content/uploads/media/jermaine-fowler-2017-emmys-billboard-1548.jpg?w=1024"}}, "movies": [], "publish_date": 1505749419.0, "source": "https://www.billboard.com", "summary": ""}