{"url": "https://en.wikiquote.org/wiki/Last_words", "text": "Last words or final words are a person's final articulated words, stated prior to death or as death approaches. Often they are recorded because of the decedent's fame, but sometimes because of interest in the statement itself.\n\nA B C D E F G H I J K L M N O P Q R S T U V W X Y Z ? See also External links\n\nSorted alphabetically by last name (with some monarchs and leaders sorted by their first names, e.g. William the Silent). This article refers only to last words of persons who actually lived or are believed to have actually lived. Last words of fictional characters can be found in Fictional last words.\n\nA [ edit ]\n\nNo comment.\n\nI hid a million dollars under the...\n\nI did what I could. Who: Edward Abbey, an American author and essayist. Note: The first quote was a response as to whether he had any last words. (The epitaph on his memorial stone was \"No Comment\".) The second is an alternative as noted in the reference work Last Words of Notable People citing Epitaph for a Desert Anarchist: The Life and Legacy of Edward Abbey by James Bishop. Brahms, William B. (2010). Last Words of Notable People: Final Words of More than 3500 Noteworthy People Throughout History . Haddonfield, NJ: Reference Desk Press, Inc. p. 1. ISBN 978-09765325-2-1. ; Bishop, James. (2010). Epitaph for a Desert Anarchist: The Life and Legacy of Edward Abbey . New York: Atheneuem. ISBN 978-06891219-5-1. .\n\n\n\nVan Halen! Who: Darrell Abbott A.K.A Dimebag Darrel, former guitarist of Pantera and Damageplan. Note: Said while playing with Damageplan at a club minutes before he was shot and killed onstage.\n\n\n\nCome Lord Jesus, come quickly, finish in me the work that Thou hast begun; into Thy hands, O Lord, I commend my spirit, for Thou hast redeemed me. O God of truth, save me Thy servant, who hopes and confides in Thee alone; let Thy mercy, O Lord, be shewn unto me; in Thee have I trusted, O Lord, let me not be confounded for ever. Who: Robert Abbot, English prelate. Note: Last Words of Notable People citing The life of Dr. George Abbot, Lord Archbishop of Canterbury by Arthur Onslow (Guildford, England, 1777). Brahms, William B. (2010). Last Words of Notable People: Final Words of More than 3500 Noteworthy People Throughout History . Haddonfield, NJ: Reference Desk Press, Inc. p. 1. ISBN 978-09765325-2-1. .\n\n\n\nيام السرور التي صفت لي دون تكدير في مدة سلطاني، يوم كذا من شهر كذا من سنة كذا فعدت تلك الأيام فوجدت أربعة عشر يومًا ( Yam al-surur alati sifat li dun takdir fi mudat sultani, yawm kadha min shahr kadha min sunat kadha fa'idat tilk al-ayām fawajadat 'arba'at 'ashar yawman. ) Translation: In this situation, I have diligently numbered the days of pure and genuine happiness which have fallen to my lot... they amount to fourteen! Who: Abd al-Rahman III, founder of the Caliphate of Córdoba.\n\n)\n\nمن در حال رفتن هستم و شما مي خواهيد غذا بخورم؟ ( Man dar hâl raftan hastam, va shomâ mey khâhid ghazâ békhoram? ) Translation: You wish Me to take some food, and I am going? Who: `Abdu'l-Bahá, son of Bahá'u'lláh and one of three central figures of the Bahá'i Faith. Note: Spoken when food was offered to him on his deathbed.\n\n)\n\nI don't know. [ Attributed ] Who: Peter Abelard, a medieval French scholastic philosopher, theologian and preeminent logician.\n\n]\n\nשלף חרבך ומותתני פן-יאמרו לי, אשה הרגתהו ( Shelof charbecha umoteteni pen-yomeru li, ishah haragatehu ) Translation: Draw thy sword, and kill me, that men say not of me: 'A woman slew him.' Who: Abimelech Note: Abimelech was besieging the town of Thebaz when a woman threw a millstone from a fortified tower and struck him in the head. Realizing the wound was mortal, he quickly told his armor-bearer to kill him so that his death would not be at the hands of a woman.\n\n)\n\nMay the Most High God preserve thee from destruction, and from all the paths of error may He deliver thee. Who: Abraham, first of the three patriarchs of Judaism, according to the pseudepigraphic Book of Jubilees. See also: Abraham\n\n\n\nIt's okay! Gun's not loaded... see? Who: Johnny Ace, 1950s rhythm and blues singer. Note: Ace was playing Russian roulette (or something similar; exact accounts vary) with his revolver on Christmas Day 1954, during a backstage break in his concert that day. Someone told him \"Be careful with that thing...\" and he replied \"It's okay! Gun's not loaded... see?\" Contrary to Ace's assertion, there was a bullet in the chamber, which, when he pulled the trigger with the barrel of the gun to his face, killed him instantly.\n\n\n\nJa, maar niet te veel. Translation: Yes, but not too many. Who: Gerrit Achterberg, Dutch poet. Note: Achterberg had just parked his car, when his wife asked: \"Zal ik wat aardappelen bakken?\" (\"Shall I bake some fried potatoes?\") After answering the question he suffered a fatal heart attack. Note: Last Words of Notable People citing Het refrein is hein: Leven en sterven in een verpleeghuis by B. Keizer Brahms, William B. (2010). Last Words of Notable People: Final Words of More than 3500 Noteworthy People Throughout History . Haddonfield, NJ: Reference Desk Press, Inc. p. 3. ISBN 978-09765325-2-1. ; Keizer, Bert (1997). Het refrein is hein: Leven en sterven in een verpleeghuis . Amsterdam: Nijmegen. ISBN 978-90616862-1-7. .\n\n\n\nOh, yes; it is the glorious Fourth of July. It is a great day. It is a good day. God bless it. God bless you all. [ He then lapsed into unconsciousness; he awakened later, and mumbled, ] Thomas Jefferson... Who: John Adams, 2nd President of the United States. Note: John Adams died on July 4, 1826, exactly fifty years after the signing of the Declaration of Independence. He is often quoted as having said \"Thomas Jefferson survives\" or \"Thomas Jefferson still survives\" with some depictions indicating he might have not expressed the entire statement before dying, i.e.: \"Thomas Jefferson... still survi—\", but some research indicates that only the words \"Thomas Jefferson\" were clearly intelligible among his last. Adams was unaware that Jefferson, his great political rival—and later friend and correspondent—had died a few hours earlier that same day.\n\n] Thomas Jefferson...\n\nThis is the last of Earth. I am content. Who: John Quincy Adams, 6th President of the United States. Note: John Quincy Adams suffered a cerebral hemorrhage on the floor of the U.S Capitol Building, as he had become a U.S. Representative from the 11th District of Massachusetts after his presidency. He died two days later. As quoted in The Truly Great: A Discourse Appropriate to the Life and Character of John Quincy Adams (1848) by Edwin Hubbell Chapin and \"Illness and Death of John Quincy Adams\" ( Little's Living Age , No. 201, March 18, 1848), citing an account published in The New York Courier and Enquirer , February 25, 1848 and other sources. Brahms, William B. (2010). Last Words of Notable People: Final Words of More than 3500 Noteworthy People Throughout History . Haddonfield, NJ: Reference Desk Press, Inc. p. 6. ISBN 978-09765325-2-1. .\n\n\n\nPrincipally, and first of all, I recommend my soul to the Almighty Being who gave it, and my body I commit to the dust, relying on the merits of Jesus Christ for the pardon of my sins. Who: Samuel Adams, politician and Founding Father of the United States, in his last will.\n\nSee in what peace a Christian can die. Who: Joseph Addison, writer, d. June 17, 1719. Note: Spoken to his stepson, the Earl of Warwick. As quoted in Conjectures on Original Composition: In a Letter to the Author of Sir Charles Grandison (1759) by Edward Young and Samuel Richardson. Variation: I have sent for you to see how a Christian can die. As quoted in A New Biographical Dictionary: Containing a Brief Account of the Lives and Writings of the Most Eminent Persons and Remarkable Characters in Every Age and Nation (1805) by Stephen Jones. Variations of Addison's last words compared and discussed. Brahms, William B. (2010). Last Words of Notable People: Final Words of More than 3500 Noteworthy People Throughout History . Haddonfield, NJ: Reference Desk Press, Inc. p. 7. ISBN 978-09765325-2-1. .\n\n\n\nהפך ידך והוציאני מן-המחנה—כי החלית ( Hafoch yadecha vehotzi'eni min-hammachaneh—ki hocholeiti ) Translation: Turn your hand, and carry me out of the battle — I am wounded Who: Ahab, seventh king of Israel\n\n)\n\nThe bastards tried to come over me last night. I guess they didn't know I was a Marine. Who: Private First Class Edward H. Ahrens Note: During the Battle of Tulagi, Private Ahrens was mortally wounded while single-handedly fighting back a group of Japanese soldiers attempting to infiltrate Allied lines. After his superior officer discovered Ahrens the next morning surrounded by dead Japanese troops, he whispered these words and died.\n\n\n\nשמע ישראל אדני אלהינו אדני אחד ( Shema Yisrael Adonai Eloheinu Adonai Echad ) Translation: Hear, O Israel! The Lord is our God! The Lord is One! Who: Rabbi Akiba ben Joseph (Akiva) Note: These words (the Shema, from Deuteronomy 6:4) were stated as R. Akiva was being flayed by a Roman executioner for his continuing to teach the Torah, despite the Roman prohibition on doing so (Talmud Berachot 61b). It is said that Akiva lengthened his saying of the word \"אחד\" ( echad , \"one\") until he expired. Because of R. Akiva, it is customary for Jews to recite the Shema as their last words.\n\n( )\n\nIs it not meningitis? Who: Louisa May Alcott, an American novelist and poet best known as the author of the novel Little Women . Note: Alcott had been in ill health for many years and took a turn for the worse after she visited her father. She did not have meningitis. She may have died of mercury poisoning, the after-effect of an earlier treatment for typhoid fever. Brahms, William B. (2010). Last Words of Notable People: Final Words of More than 3500 Noteworthy People Throughout History . Haddonfield, NJ: Reference Desk Press, Inc. p. 12. ISBN 978-09765325-2-1. . As quoted in Louisa May Alcott: Her Life, Letters and Journals (1805) by Ednah D. Cheney.\n\n\n\nYou be good. See you tomorrow. I love you. Who: Alex, African Grey Parrot used in comparative psychology research at Brandeis University. Note: Spoken to his handler, Dr. Irene Pepperberg, when she put him in his cage for the night; he was found dead the next morning. This wasn't said due to Alex's knowledge of his impending death, but simply because that was what Alex said to Pepperberg every night before being locked in his cage. \"Milestones\". Time : p. 24. 24 September 2007 .\n\n\n\nτῷ κρατίστῳ ( tô kratístō ) [ Attributed ] Translation: To the strongest! Who: Alexander the Great, King of the Ancient Greek kingdom of Macedon and a member of the Argead dynasty. Note: In response to his generals asking the heirless Alexander which one of them would get control of the empire. When asked on his deathbed who was to succeed him, his voice may have been indistinct. Alexander may have said \"Krateros\" (the name of one of his generals), but he was not around, and the others may have chosen to hear \"Kratistos— the strongest\".\n\n) [ ]\n\nНесите меня во дворец… там… умереть… ( Nesite menya vo dvorets… tam… umeret… ) Translation: Take me to the palace... there... to die... Who: Alexander II of Russia Note: His guards heard him utter this phrase when they found his maimed body under a seat from his carriage after he was attacked with bombs by anarchists in an assassination attempt. He lost his left leg and was taken home where he died hours after his wound.\n\n)\n\nAspetta un minuto... Translation: Wait a minute... Who: Pope Alexander VI Note: His last words have also reported to have been: Va bene, va bene, arrivo. Aspettate un momento. (Okay, okay, I'll come. Just give it a moment.)\n\n\n\nChiudi la mia mano, cara amica, sto morendo. Translation: Clasp my hand, dear friend, I am dying. Who: Vittorio Alfieri, was an Italian dramatist and poet, considered the \"founder of Italian tragedy.\"\n\n\n\nI'm in no pain. No pain. Don't cry for me, Rahaman. I'm going to be with Allah. I made peace with God, I'm okay... Rahaman, how do I look? Who: Muhammad Ali Note: Rahaman Ali, a former heavyweight boxer, was Muhammad Ali's younger brother. As quoted in \"Muhammad Ali told family he was 'in no pain and going to Allah'\" by Nick Allen, The Telegraph (4 June 2016)\n\n\n\nI'm sorry, boys. I'm all wet. Who: Gracie Allen, wife and comedy partner of George Burns.\n\n\n\nMás pronto que tarde, las grandes avenidas se abrirán de nuevo y los hombres libres caminarán a través de ellas para construir una sociedad mejor. ¡Larga vida a Chile! Larga vida a la gente! ¡Larga vida a los trabajadores! Estas son mis últimas palabras, y estoy seguro de que mi sacrificio no será en vano, estoy seguro de que, al menos, será una lección moral que castigará la felonía, la cobardía y la traición. Translation: Sooner rather than later, the great avenues will open again and free men will walk through them to construct a better society. Long live Chile! Long live the people! Long live the workers! These are my last words, and I am certain that my sacrifice will not be in vain, I am certain that, at the very least, it will be a moral lesson that will punish felony, cowardice, and treason. Who: Salvador Allende, was a Chilean physician and politician. d. September 11, 1973. Note: Last speech given before he committed suicide before the military forces entered the La Moneda palace when the 1973 coup d'etat took place.\n\n\n\nFuck y'all. Who: August Ames, Canadian pornographic actress. d. December 5, 2017. Note: This was Ames' final tweet before she committed suicide the following day. Over the past few days Ames had been subject to intense cyberbullying after another Twitter post where she stated her reluctance to work with a male co-worker who'd done gay porn due to risk of HIV or AIDS. Her comments were perceived as homophobia (despite the fact that Ames herself was bisexual), but in reality she was just taking a health precaution.\n\n\n\nThank you all for helping to making my life the incredible tale it was. I'm sorry it had to end on such a heartbreaking note. Though I know for SURE hella people are gonna prolly laugh at it LOL I just hope there's at least some fresh me-me's that come of it. I'm dying as a guy hated by a lot of people, so I know you all won't let me down haha. Well, that's my cue. Time for me to go. I mean this with every bit of my heart... Take care of yourselves, and of course, as usual, please have yourself a damn good one.\n\nUm, Poki, sorry for scaring you so much. I really am sorry for that, I apologize. I was being stupid. Christine, sorry for being so hard-headed, and all the other horrible things I did. I mean, hey, two...two wrongs don't make a right, but I mean, y'know. Hmm. Who: Desmond Daniel Amofah, aka Etika Note: The first quote comes from the end of the description of his pre-recorded suicide note, titled \"I'm sorry\". The second quote is the final words spoken by Amofah in the video. Amofah disappeared later that night, leaving his belongings at the Manhattan Bridge, and was found dead from drowning five days later.\n\n\n\nSpørg mig ikke, hvordan jeg er! Jeg forstår intet mere. Translation: Don't ask me how I am! I understand nothing more. Who: Hans Christian Andersen, Danish author of The Ugly Duckling , The Little Mermaid , The Emperor's New Clothes , The Snow Queen , and The Princess and the Pea .\n\n\n\nI pray you to bear me witness that I meet my fate like a brave man. Who: Major John André, a British Army officer. Note: According to James Thatcher's book The American Revolution , André raised the handkerchief from his eyes and said these words when given an opportunity to speak, moments before he was hanged as a British spy.\n\n\n\nPardonnez-moi, monsieur. Je ne l'ai pas fait exprès. Translation: Pardon me, sir. I did not do it on purpose. Who: Marie Antoinette, Queen of France and Archduchess of Austria. Note: As she approached the guillotine, convicted of treason and about to be beheaded, she accidentally stepped on the foot of her executioner.\n\n\n\nAequanimitas. Translation: Equanimity. Who: Emperor Antoninus Pius Note: When tribune of the night watch came to ask for the password.\n\n\n\nWell, gentlemen, you are about to see a baked Appel. Who: George Appel, executed by electric chair in 1928.\n\n\n\nMennyi az idő? Különben mindegy... Translation: What is the time? Never mind, it's not important... Who: János Arany, Hungarian poet.\n\n\n\nΜη μου τους κύκλους τάραττε ( Mè mou tous kuklous taratte ) Translation: Don't disturb my circles! Alternate: Don't disturb my equation. Who: Archimedes, an Ancient Greek mathematician, physicist, engineer, inventor, and astronomer. Note: In response to a Roman soldier who was forcing him to report to the Roman general after the capture of Syracuse, while he was busy sitting on the ground proving geometry theorems. The soldier killed him, despite specific instructions not to, resulting in his execution.\n\n( )\n\nZeg de mensen dat homoseksuelen niet per definitie zwakkelingen zijn. Translation: Let it be known that homosexuals are not necessarily cowards. Who: Willem Arondeus, Dutch artist and writer, member of the Anti-Nazi resistance. Note: He led a group in bombing the Amsterdam Public Records Office, destroying thousands of files to prevent the Nazis from identifying Jews. Within a week, Arondeus and the other members of the group were arrested. Twelve, including Arondeus, were executed by firing squad.\n\n\n\nTali segreti sono stati rivelati a me che tutto quello che ho scritto ora appare come tanta paglia. Translation: Such secrets have been revealed to me that all I have written now appears as so much straw. Who: Thomas Aquinas, philosopher, theologian and jurist in the tradition of scholasticism.\n\n\n\nLet me die in the old uniform in which I fought my battles for freedom, May God forgive me for putting on another. Who: Benedict Arnold, general during the American Revolutionary War who defected from the Continental Army to the British. Note: He wanted to wear his old Continental Army uniform.\n\n\n\nI love you too, honey. Good luck with your show. Who: Desi Arnaz, an American musician, actor, television producer, writer and director. Note: He was speaking on the telephone to his former wife Lucille Ball, regarding her TV series, Life with Lucy . Neither Arnaz nor Ball had yet been informed that Life with Lucy had already been canceled.\n\n\n\nLife is not worth living. Who: Chester A. Arthur, 21st president of the United States.\n\n\n\nI didn't want to leave this world without knowing who my descendant was; thank you, Michael. Who: Fred Astaire, American entertainer best known for his dancing skills. The \"Michael\" is Michael Jackson.\n\n\n\nThe ladies have to go first. Goodbye, dearie. I'll see you later. Who: John Jacob Astor IV, an American businessman, real estate builder, investor, inventor, writer, lieutenant colonel in the Spanish–American War, and a prominent member of the Astor family. Note: The accuracy of this report is disputed. Astor and his wife were traveling on the Titanic when it struck an iceberg and began to sink. As Astor prepared to enter a lifeboat with his wife, a group of female passengers appeared on deck. He gave up his seat and spoke his final words to his wife; he was later found floating in the ocean, dead.\n\n\n\nAm I dying, or is this my birthday? Who: Lady Nancy Astor, an American-born English socialite. Note: In her final illness, she awoke on her deathbed to see her family at her bedside.\n\n\n\nNobody move please, we are going back to the airport, don't try to make any stupid moves. Who: Mohamed Atta, American Airlines Flight 11 hijacker-pilot. Note: This was the second transmission Atta intended to say to the passengers that he transmitted to air traffic control after he pressed the wrong button several minutes earlier.\n\n\n\nActa est fabula, plaudite. Translation: Have I played the part well? Then applaud as I exit. Who: Augustus, the first emperor of the Roman empire Note: His last words are also reported to be: Marmoream se relinquere, quam latericiam accepisset – \"I found Rome a city of clay, but left it a city of marble\".\n\n\n\nI want nothing but death. Who: Jane Austen, an English novelist known principally for her five major novels which interpret, critique and comment upon the life of the British landed gentry at the end of the 18th century. Note: In response to her sister Cassandra who had asked her if she wanted something. As quoted in Last Words of Notable People: Final Words of More than 3500 Noteworthy People Throughout History (2010) by William B. Brahms which discusses a letter from Cassandra to her niece Fannie Knight after the death of Jane Austen on July 18, 1817. Brahms notes the letter is reprinted in Letters of Jane Austen (1884) by Jane Austen.\n\n\n\nI ask you all to forgive me. I ask the people of Samford to forgive me. I ask my mother to forgive me. May you all live long and die happy. God save the King! God save the King! God be with you all! Send a wire to my mother and tell her I died happy, won't you. Yes tell her I died happy with no fear. Goodbye all! Goodbye all! Who: Ernest Austin Note: Austin made this statement before being hanged for rape and murder, the last two as he fell through the trap door. He was the last person in Queensland to be hanged.\n\n\n\nI love you. Who: Avicii, Swedish DJ and musician. Note: Spoken to his girlfriend, Tereza Kacerova, the day that he committed suicide.\n\n\n\nB [ edit ]\n\nمودند اى مردم اگر مرا ميشناختيد مثل اين جوان که ّ اجل از شماست در اين سبيل قربان ميشديد من آن ظهور موعودى هستم که آسمان کمتر مثل او را ديده سيصد و سيزده تن از نقباء خود را فداى من کردند اين ( Ay mardom, agar marâ mí-shenâkhtid mesl in javân keh ajal az shomâst dar in sabil ghorbāne mí-shodid man ân zohur maw'ūd hastam ke âsmân kamtar mesl u râ dide estad va sizah tan az nuqaba' khod râ fidā'iyy man kárdand in. ) Translation: Had you believed in Me, O wayward generation, every one of you would have followed the example of this youth, who stood in rank above most of you, and willingly would have sacrificed himself in My path. The day will come when you will have recognised Me; that day I shall have ceased to be with you. Who: The Báb, founder of Bábism, and one of three central figures of the Bahá'í Faith. Note: His final words were shouted at the spectating crowd during His execution by a firing squad. The words \"this youth\" refer to the young Mirza Muhammad-'Ali, who was being executed along with him.\n\n)\n\nWeine nicht für mich, denn ich gehe dahin, wo Musik geboren wird. Translation: Don't cry for me, for I go where music is born. Who: Johann Sebastian Bach, German Baroque composer. Note: Said to his wife on his deathbed.\n\n\n\nMy name and memory I leave to man's charitable speeches, to foreign nations, and to the next age. Who: Francis Bacon, Renaissance scientist.\n\n\n\nOh God, here I go! Who: Max Baer, American boxer. Note: Spoken after a fatal heart attack.\n\n\n\nMy Florida water. Who: Lucille Ball, an American actress, comedian, model, film studio executive and producer. Note: Her response when asked if she wanted anything. Ball's last written words, to Carol Burnett along with her annual birthday gift to her, were Happy birthday, kid. Love, Lucy. Burnett received the message and gift the day after Ball had died.\n\n\n\nOh, you young people act like old men. You have no fun. Who: Josephine Baker, an American-born French dancer, jazz and pop music singer, and actress. Note: The famed starlet was reportedly attempting to seduce a man several decades younger than she was. She died of a stroke later that night.\n\n\n\nI'm in the hands of Jesus... Who: Tammy Faye Messner, an American Christian singer, evangelist, entrepreneur, author, talk show host, and television personality. Note: As told by her husband Roe Messner on CNN's Larry King Live. Roe was with Tammy Faye at the moment of her death.\n\n\n\nCodeine...bourbon... Who: Tallulah Bankhead, an American actress of the stage and screen, and a reputed libertine. Note: Her response when asked if she wanted anything.\n\n\n\nYou know. Bill and I have working on Hanna-Barbera studios since many years ago. We've did cartoons such as Yogi Bear, Huckleberry Hound, Quick Draw McGraw, the Flintstones and more. That was very perfect at all. Who: Joseph Barbera, American animator, director, producer, storyboard artist, and cartoon artist\n\n\n\nStay loyal, remain free, and always value honor. Who: Sonny Barger, founder of the Oakland Hells Angels motorcycle club, as part of a note he wrote to be released upon his death.\n\n\n\nI would rather be a servant in the House of the Lord than to sit in the seats of the mighty. Who: Alben W. Barkley, former Vice President of the United States. Note: He suffered a fatal heart attack in the middle of a speech. His last words were caught on tape.\n\n\n\nHow were the receipts today at Madison Square Garden? Who: P. T. Barnum, circus entrepreneur.\n\n\n\nI can't sleep. Who: J.M. Barrie, author of works including Peter Pan .\n\n\n\n.توكلت على الله. توكلت على الله. توكلت على الله. توكلت على الله. توكلت على الله. توكلت على الله. توكلت على الله. توكلت على الله. توكلت على الله. توكلت على الله توكلت على الله. ( Tawakalt ala Allah. Tawakalt ala Allah. Tawakalt ala Allah. Tawakalt ala Allah. Tawakalt ala Allah. Tawakalt ala Allah. Tawakalt ala Allah. Tawakalt ala Allah. Tawakalt ala Allah. Tawakalt ala Allah. Tawakalt ala Allah. ) Translation: I rely on God. I rely on God. I rely on God. I rely on God. I rely on God. I rely on God. I rely on God. I rely on God. I rely on God. I rely on God. I rely on God. Who: Gameel Al-Batouti, EgyptAir pilot Note: Batouti continually repeated these words while at the controls of EgyptAir Flight 990 moments before the plane crashed into the Atlantic Ocean shortly after leaving New York City for Cairo. The NTSB said that Batouti deliberately crashed the plane while Egyptian investigators said that mechanical failure caused the crash.\n\n)\n\nIs everybody happy? I want everybody to be happy. I know I'm happy. Who: Ethel Barrymore, an American actress regarded as the \"First Lady of the American Theater.\" Note: Spoken to her housekeeper before her passing.\n\n\n\nDie, I should say not, dear fellow. No Barrymore would allow such a conventional thing to happen to him. Who: John Barrymore, an American actor on stage, screen and radio.\n\n\n\nNow we can cross the Shifting Sands. Who: L. Frank Baum, author of The Wonderful Wizard of Oz. Note: Baum was referring to the Shifting Sands, the impassable desert surrounding the Land of Oz.\n\n\n\nAre you guys ready? Let's roll. Who: Todd Beamer, passenger on United Flight 93, September 11, 2001. Note: These are his last recorded words, coming at the end of a cell phone call before Beamer and others attempted to storm the airliner's cockpit to retake it from hijackers who were part of the 9/11 terrorist attacks. The plane crashed near Shanksville, Pennsylvania.\n\n\n\nRain had always been a harbinger of tragedy for me. Who: George Beard, an American neurologist who popularized the term neurasthenia. Note: His death occurred during a rainstorm.\n\n\n\nIch denke an frühere Zeiten. Translation: I am thinking of earlier times. Who: Ludwig Beck, German general, committing suicide after the failed attempt to kill Hitler, 20 July 1944.\n\n\n\n[ To his murderers ] If all the swords in England were pointed against my head, your threats would not move me.\n\n] If all the swords in England were pointed against my head, your threats would not move me. I am ready to die for my Lord, that in my blood the Church may obtain liberty and peace. Who: Thomas Becket, Archbishop of Canterbury, d. 1170.\n\n\n\nNow comes the mystery. Who: Henry Ward Beecher, evangelist, d. March 8, 1887.\n\n\n\nPlaudite, amici, comedia finita est. Translation: Applaud, my friends, the comedy is finished.; the formula traditionally used to end a performance of commedia dell'arte. Who: Ludwig van Beethoven, German composer. Note: His final words are subject to historical debate, and vary with many biographies. Among those that have been reported to be his last words are: [ Upon the arrival from his publisher of 12 bottles of wine ] Pity, pity, too late! I shall hear in Heaven. [ To his friend, composer Johann Nepomuk Hummel, who was at his bedside ] Is it not true, Hummel, that I have some talent after all? I feel as if up to now I had written no more than a few notes. There, do you hear the bell? Don't you hear it ringing? The curtain must drop. Yes! My curtain is falling. [ To a priest, after he received his last rites ] I thank you, Reverend Sir. You have brought me comfort. Another biographer states him saying nothing; simply shaking his fists defiantly at the heavens as a thunderstorm raged outside his window. This is taken from the report of composer Anselm Hüttenbrenner, a close friend of Beethoven who was present at his death.\n\n\n\nTodo mortal... Translation: All mortal... Who: Gustavo Adolfo Bécquer, a Spanish post-romanticist poet and writer, also a playwright, literary columnist, and talented in drawing. Note: He was delirious because of high fever and illness.\n\n\n\nNo. Who: Alexander Graham Bell, a Scottish-born scientist, inventor, engineer and innovator who is credited with patenting the first practical telephone. Note: While Alexander Graham Bell was dying, his deaf wife whispered to him, \"Don't leave me.\" Bell responded by signing the word, \"No.\"\n\n\n\nI'd rather die watching football than in my bed with my boots off. Who: Bert Bell, founding owner of the Philadelphia Eagles football team and commissioner of the National Football League. Bell indeed died of a heart attack watching an Eagles game that day.\n\n\n\nJust don't leave me alone. Who: John Belushi, an American comedian, actor, and musician.\n\n\n\nThe dogs are in the enclosed pool area. Garage side door is open. Who: Chris Benoit, a professional wrestler who worked for WWE. Note: This was a text sent to fellow wrestler and longtime friend Chavo Guerrero after Benoit had murdered his wife and children and shortly before he hung himself.\n\n\n\nHow did the Mets do today? Who: Moe Berg, an American baseball catcher and World War II spy. Note: The Mets won that day.\n\n\n\nMy name is Nick Berg, my father's name is Michael, my mother's name is Suzanne. I have a brother and sister, David and Sarah. I live in West Chester, Pennsylvania, near Philadelphia. Who: Nick Berg, American contractor Note: Berg identifies himself at the beginning of a video posted on an Islamic website that ends with Berg being beheaded by terrorists in Iraq.\n\n\n\nAnd where do you come from? Who: Isaiah Berlin, a Latvian-British social and political theorist, philosopher and historian of ideas. Note: To the nurse caring for him. Hardy, Henry (2001). \"Review of The Legacy of Isaiah Berlin \". The Isaiah Berlin Virtual Library.\n\n\n\nEnfin, on va jouer ma musique. Translation: At last, they are going to play my music. Who: Hector Berlioz, French composer Note: These words were reputedly his last, but other reports include him saying: [ Bidding farewell to composer Mily Balakirev ] One thousand greetings to Balakirev. [ Speaking to his dead wife ] Oh, Mère Recio, it is finished. [ Quoting from Macbeth's final soliloquy in Shakespeare's play of the same name ]: \"Life's but a walking shadow, a poor player, that struts and frets his hour upon the stage, and then is heard no more. It is a tale told by an idiot, full of sound and fury, signifying nothing.\" That is my signal.\n\n\n\nJag behöver den. Translation: I'll need it. Who: Count Folke Bernadotte of Wisborg, Swedish diplomat and nobleman. Note: In response as he drove away after he inspected a bullet in his vehicle's wheel and a newspaper man shouted \"Good luck!\"\n\n\n\nCette fois il me servira pour le voyage d'où il n'y a pas de retour, le voyage de l'éternité. Translation: This time it will serve me for the voyage from which there is no return, the voyage of eternity. Who: Claude Bernard, a French physiologist. Note: Spoken when he began to feel cold and a cover was placed on his feet.\n\n\n\nNever fear; if you will but have patience I don't doubt we shall get through; but take care how you ever get in such a scrape again. Who: Sir Francis Bernard, 1st Baronet, a British colonial administrator who served as governor of the provinces of New Jersey and Massachusetts Bay.\n\n\n\nDon't die like I did.\n\nBestie, you've got to help me. They're having a fucking party in here. I heard them last night, Bestie. They were having drinks and there were girls. Who: George Best, a Northern Irish professional footballer who played as a winger for Manchester United and the Northern Ireland national team. Note: Best died as a result of a lung infection and multiple organ failure caused by years of alcoholism. The first line was published in News of the World with a picture of Best lying in his hospital bed, five days before his death. The second line, heard by his son Calum, came during after the beeping machines in his ward sent him hallucinating that he was at a club.\n\n\n\nDear God. Dear God. Why is this happening? I just want to go home. Who: Cassie Bernall, victim of the Columbine High School massacre. Note: According to Emily Wyant, a close friend of Cassie's, she was heard praying in these last words before Eric Harris yelled \"Peek-a-boo!\" and fatally shot her in the face. This account disproves the myth that Bernall said \"yes\" to Dylan Klebold before he shot her dead (it was actually Valeen Schnurr who got terribly shot before being asked by Klebold if she believed in God and surviving the whole ordeal). [1]\n\n\n\nCombien lent est mon agonie. Translation: How slow my death agony is. Who: Sarah Bernhardt, a French stage and early film actress.\n\n\n\nاے رب، میری مدد کریں ... کیونکہ میں معصوم ہوں. ( Ae rab, meri madad karen...kyunkay mein masoom hon. ) Translation: O Lord, help me... for I am innocent. Who: Zulfikar Ali Bhutto, Prime Minister of Pakistan. Note: Said shortly before his hanging.\n\n)\n\nDêem-me café, vou escrever! Translation: Give me coffee, I'm going to write. Who: Olavo Bilac, Brazilian poet.\n\n\n\nI will love you forever. Who: Bushwick Bill, American rapper Note: Spoken to his son on his deathbed.\n\n\n\n¿Quién es? ¿Quién es? Translation: Who is it? Who is it? Who: Billy the Kid, an American Old West gunfighter who participated in New Mexico's Lincoln County War. Note: When Billy saw sheriff Pat Garrett, he failed to recognize him due to the poor lighting. Garrett then shot him to death.\n\n\n\nلا تضيء الضوء! ( la tudi' alduwa! ) Translation: Don't turn on the light. Who: Osama bin Laden, founder of Al-Qaeda.\n\n)\n\nI'm sorry from the bottom of my heart. I want to thank all of my family and friends for my prayers and who supported and believed in me. My Father, I'm being paroled to heaven. I will now spend all my holidays with my Lord and Savior, Jesus Christ. Peace be with you all. Amen. Who: Kenneth Biros, first person executed by a one-drug lethal injection in Ohio on December 8, 2009.\n\n\n\nHaus. Translation: Home.; Literally: House. Who: Otto von Bismarck, German statesman and Chancellor of Germany. Note: Scrawled on a piece of paper; there is debate as to whether Bismarck meant to convey that he was returning to the afterlife or was simply delirious or intoxicated.\n\n\n\nÀ moi! Translation: Help!; Literally: To me! Who: Sophie Blanchard, a French aeronaut and the wife of ballooning pioneer Jean-Pierre Blanchard. Note: Blanchard, a balloonist, said these words when her balloon crashed, killing her.\n\n\n\nI die in the faith of my people. May the German people be aware of its enemies! [1] Who: Paul Blobel, a German SS officer Note: Blobel said these words before his execution.\n\n\n\nGoodbye, kid. Hurry back. Who: Humphrey Bogart, an American screen actor who performed in iconic 1940s films noir such as The Maltese Falcon , Casablanca , and The Big Sleep. Note: The line was spoken to his wife, Lauren Bacall, as she left his bedside to pick up her children. She returned to find Bogart in a coma, from which he never regained consciousness.\n\n\n\nÀ Jésus-Christ je recommande mon âme! Jésus recevez mon âme! Jésus recevez mon âme! Jésus recevez– Translation: To Jesus Christ I commend my soul. Jesus have pity on me. Jesus have pity on me. Jesus have pity– Who: Anne Boleyn\n\n\n\nDamn it! How will I ever get out of this labyrinth? Who: Simon Bolivar, a Venezuelan military and political leader. Note: His last words are also recorded as \"Fetch The Luggage, They do not want us here\"\n\n\n\nFrance, armée, tête d'armée, Joséphine. Translation: France, Army, Head of the Army, Joséphine. Who: Napoleon Bonaparte, French military leader and emperor who conquered much of Europe in the early 19th century. He died in exile in Saint Helena on 5 May 1821.\n\n\n\nو مع الإسلام... ( Wa mael'iislam... ) Translation: And of Islam... Who: Mohamed Boudiaf, President of Algeria. Note: In 1992, he was conducting a televised speech in Arabic to an audience at a newly-opened cultural centre in Annaba, when his assassin struck. [2]\n\n)\n\nAh, das schmeckt gut. Vielen Dank. Translation: Ah, that tastes nice. Thank you. Who: Johannes Brahms, a German composer and pianist. Note: Spoken after he had a small glass of wine.\n\n\n\nSurgite! Translation: Push on! Who: General Sir Isaac Brock, British Army officer and administrator. Note: Said after being shot by American sharpshooters during the Battle Of Queenston Heights.\n\n\n\nTell my mother I died for my country...Useless... useless... Who: John Wilkes Booth, American stage actor and assassin of President Abraham Lincoln. Note: He said these words as he laid mortally wounded after being shot during a manhunt three hours earlier.\n\n\n\nكيف تتوقع مني أن أعيش؟ ( Kayf tatawaqae miniy 'an 'aeish? ) Translation: How do you expect me to make a living? Who: Mohamed Bouazizi, Tunisian street vendor. Note: Bouazizi set himself on fire on 17 December 2010, in response to the confiscation of his wares and the harassment and humiliation that he said was inflicted on him by a municipal official and her aides. At 11:30 AM local time, he shouted these words while standing in the middle of traffic, then doused himself with gasoline and set himself alight with a match. He later died at the Ben Arous Burn and Trauma Centre on 4 January 2011. This act of self-immolation became a catalyst for the Tunisian Revolution, and eventually the wider Arab Spring.\n\n)\n\nJe vais ou je vas mourir, l'un et l'autre se dit ou se disent. Translation : I am about to – or I am going to – die: either expression is correct. Who: Dominique Bouhours, French grammarian.\n\n\n\nHe's got several units of Phoenix police on his tail right here and, uh, Jim, stay with him, looks like he's gonna try and take another vehicle here. We'll see if they block him in there. Looks like they've got him blocked in there, but he did get h- Who: Scott Bowerbank, pilot for KTVK's Newschopper3 involved in the Phoenix mid-air collision Note: While covering a police chase, Bowerbank's chopper was struck by KNXV-TV's Chopper15. Both choppers crashed to the ground, killing all four occupants on both aircraft.\n\n\n\nMusic has been my doorway of perception and the house that I live in. Who: David Bowie, English rock musician.\n\n\n\nI don't feel well. I don't think we should go on. Who: Stephen Boyd, actor Note: Boyd was playing golf with his wife when he suffered a massive heart attack that took his life.\n\n\n\nI didn't murder the Hodges family. I've never murdered anybody. I'm going to my death with a clear conscience. I am going to my death having had a great life because of my two great sons, Mike and Doug. Who: Earl Bramblett Note: Spoken prior to his death in the state of Virginia's electric chair. Contrary to his claim, overwhelming evidence proved that he did indeed kill William Hodges, his wife Teresa and their two children Winter and Anah, ages 11 and 4.\n\n\n\nBut all the same, long live France! Who: Robert Brasillach, author\n\n\n\nNo. I have no final statement. Who: Lawrence Russell Brewer Note: Executed for the murder of James Byrd, Jr.\n\n\n\nSarah I miss and need you. Who: Bobbi Kristina Brown, an American reality television and media personality, singer, and actress. Note: Last known tweet to her friend Bess Beckmann before she went into a coma and died months later.\n\n\n\nC'mon, let's get this day over and done with. Who: Peter Brock, Australian motor racing driver. Note: Said to a track marshal before being killed instantly when he crashed into a tree at the Targa West rally. Brock's ex-wife believes that this comment showed that he should not have been racing.\n\n\n\nI'm going away tonight. Who: James Brown, American singer, songwriter, musician, and recording artist. Source: Charles Bobbit, Brown's longtime personal manager and friend. Note: James Brown uttered his last words minutes before his death, and then he took three, long quiet breaths and closed his eyes. His very last words were: \"I want you to look after my wife... and little man. I'm on fire. I'm burning up. Burning up.\", as quoted in Icon: James Brown, GQ Magazine , 3 January 2013.\n\n\n\nI, John Brown, am now quite certain that the crimes of this guilty land will never be purged away but with blood. I had, as I now think vainly, flattered myself that without very much bloodshed it might be done. Who: John Brown, an American abolitionist. Note: These words were not spoken, but written on a note and handed to a guard right before his execution. His spoken last words are usually considered to be: This is a beautiful country.\n\n\n\nContinuing to move the game forward @KingJames. Much respect my brother 💪🏾 #33644 Who: Kobe Bryant, American basketball player Note: Those were Bryant's final public words, sent as a Tweet congratulating LeBron James for surpassing him for third place among the National Basketball Association's all-time leading scorers on January 25, 2020. The following day, Bryant and four other people were killed in a helicopter crash near Los Angeles.\n\n\n\nOh, Lord, God Almighty, as thou wilt! Who: James Buchanan, 15th President of the United States.\n\n\n\nI'd like you to give my love to my family and friends. Who: Ted Bundy, an American serial killer, kidnapper, rapist, and necrophile who assaulted and murdered numerous young women and girls. Note: Those were Bundy's last words before being executed in the electric chair.\n\n\n\nI'm the problem. Who: David A. Burke Note: Burke replied to the captain of Pacific Southwest Airlines Flight 1771, who inquired what \"the problem\" was after Burke fired a gun in the cabin of the plane. Burke shot the pilots and himself, deliberately crashing the flight.\n\n\n\nOn that subject I am coy. Who: Aaron Burr, 3rd Vice President of the United States. His last words were a response to the efforts of his friend, Reverend P.J. Van Pelt, to get Burr to state that there was a God. Reported in Holmes Moss Alexander, Aaron Burr: The Proud Pretender‎ (1937), p. 356.\n\n\n\nBack in no time. Who: William S. Burroughs, American novelist, short story writer, essayist, painter, and spoken word performer. Note: Spoken to a friend as he was being loaded into an ambulance after suffering a heart attack; he was comatose upon arrival at the hospital and never regained consciousness. Reported in Barry Miles, Call Me Burroughs: A Life (2014).\n\n\n\nI love you, too. Who: George H. W. Bush, American politician, 41st president of the United States Note: Spoken to his eldest son, George W. Bush, via speakerphone, before his death.\n\n\n\nThe corruption of the state shall fall. Governor Taft, you will not be re-elected. The rest of you, you know where you can go. Who: John William Byrd, Jr. Note: Byrd told his family he loved them and that they should keep fighting the death penalty. [3]\n\n\n\nNow I shall go to sleep. Goodnight. Who: Lord Byron, British poet.\n\n\n\nI went the distance. Who: Steve Byrnes, an American television announcer and producer. Note: Final words sent from a tweet.\n\n\n\nمن قبل رب الكعبة، لقد كنت ناجحة. ( Min qibal rabi alkaebati, laqad kunt najihatan. ) Translation: By the Lord of the Ka'bah, I have been successful. Who: Ali ibn Abi Talib, cousin and son-in-law of the Islamic prophet Muhammad, ruling over the Islamic caliphate from 656 to 661. Note: This was spoken after being hit on the head with a poisoned sword, while leading the Morning Prayer, by Ibn Maljam, a fundamentalist.\n\n)\n\nC [ edit ]\n\nDamn, hang on Ronnie! Who: James Caddell Note: Referring to passenger Ronald Wilmond, after his Cessna L-19 stalled and plummeted into a forest near Tabernash, Colorado, in 1984. The crash site remained undiscovered until 1987, when it was found by backpackers. Footage of the crash had been captured on the Cessna's mounted VHS camcorder, the tape of which was recovered and repaired by a sheriff. The footage, secured by the FAA, was kept from the public at the Caddell family's request and was shown only to flight instructors. After the expiry of the moratorium, the footage became public and was later uploaded to YouTube.\n\n\n\nΚαὶ σύ, τέκνον; ( Kaì sú, téknon? ) Translation: You too, my child? Who: Julius Caesar Note: Et tu, Brute? (often translated as \"and you, Brutus?\") is attributed to him by Shakespeare's famous play; his last words according to claims reported by Suetonius, were καὶ σύ, τέκνον; (pronounced \"Kaì sú, téknon?\") which means \"You too, my child?\" in Greek, though his native tongue was Latin [De Vita Caesarum Liber I Divus Iulius, LXXXII]). Suetonius himself, however, actually discounts these claims, and asserts that Caesar said nothing as he died, apart from a groan. His definite last words according to Suetonius were instead, \" Ista, quidem vis est! \" (Why, this is violence!).\n\n)\n\nVivo! Translation: I live! Who: Caligula (Gaius Julius Caesar Augustus Germanicus), Roman Emperor, as he was being assassinated by his own soldiers (as reported by Roman historian Tacitus).\n\n\n\nI can't see anything. I've got the bows up... I'm going! Uh– Who: Donald Campbell, British speed record breaker who broke eight absolute world speed records. Context: Final radio transmission from Bluebird K7 as she lifted from the surface of Conniston Water, flipped bow over stern and smashed to pieces on the lake surface in January 1967. Campbell was attempting to set a new world water speed record exceeding 300mph. His first run was 297mph. The crash occurred on the return run. Had he completed it, it would have been fast enough to set a record exceeding 300mph.\n\n\n\nThis is not the end of me. Who: Henry Campbell-Bannerman, Prime Minister of the United Kingdom.\n\n\n\nBei letzter Vernehmung Nase gebrochen. Meine Zeit ist um. War kein Landesverräter. Habe als Deutscher meine Pflicht getan. Sollten Sie weiterleben, grüßen Sie meine Frau. Translation: Badly mishandled. Nose broken at last interrogation. My time is up. Was not a traitor. Did my duty as a German. If you survive, please give my regards to my wife. Who: Wilhelm Canaris, member of the July 20 plot, his last note before execution to the man in the cell next to him. Last words also reported as \" Ich sterbe für mein Vaterland, ich habe ein reines Gewissen. \" – \"I am dying for my Fatherland. I have a clear conscience.\"\n\n\n\nIt's me, it's Buddy... I'm cold. Who: Truman Capote, writer. Note: 'Buddy' was Capote's aunt's nickname for him.\n\n\n\n26th October last year, not 10 meters from where these men are now entombed, you had a 400-tonne rock fall. Why is it, is it the strength of the seam, or the wealth of the seam, that you continue to send men into work in such a dangerous environment? Who: Richard Carleton, reporter for National Nine News. Note: During a media conference that was held at Beaconsfield, Tasmania on 7 May 2006, Richard Carleton asked this question to Matthew Gill (mine manager of the Beaconsfield mine), in light of the Beaconsfield mine collapse. When Gill declined to answer the question, Carleton walked away and suffered a heart attack; he was pronounced dead on the way to the hospital.\n\n\n\nSo, this is death. Well! Who: Thomas Carlyle, Scottish philosopher, satirical writer, essayist, historian and teacher.\n\n\n\nI hope so. Who: Andrew Carnegie, steel magnate and philanthropist. Note: Spoken to his wife whom had bid him goodnight.\n\n\n\nMilan: What a beautiful place to die. Who: John Carradine, an American actor, best known for his roles in horror films, Westerns and Shakespearean theatre. Note: He died from multiple organ failure at Fatebenefratelli Hospital in Milan, Italy at age 82. Hours before he was stricken, he had climbed the 328 steep steps of Milan's Gothic cathedral, the Duomo.\n\n\n\n¡No abandonéis a mis indios! Translation: Don't abandon my Indians! Who: Felipe Carrillo Puerto, Mexican revolutionary, governor of Yucatán (executed)\n\n\n\nTake away these pillows, I won't need them any longer. Who: Lewis Carroll, English author and poet best known as the author of Alice's Adventures in Wonderland. Quoted in Stuart Dodgson Collingwood, The Life and Letters of Lewis Carroll (1898), pp.347-8\n\n\n\nI just wish I had time for one more bowl of chili. Who: Kit Carson, American frontiersman. Note: His final words have also been reported as \"Adios, compadres.\"\n\n\n\nI think I'll sleep now. Who: George Washington Carver, an American botanist and inventor.\n\n\n\nHo vissuto come filosofo, e morto come cristiano. Translation: I have lived as a philosopher, and die as a Christian. Who: Giacomo Casanova, an Italian adventurer and author from the Republic of Venice.\n\n\n\nI hear the train a-comin. Who: Johnny Cash, American country music singer.\n\n\n\nSo much wasted time. Who: David Cassidy, an American actor and singer known for The Partridge Family .\n\n\n\nWe got a bad fire! Let's get out - we're burning up... Who: An Apollo 1 astronaut, probably Roger Chaffee. All three crew members perished in a launchpad fire, 1967.\n\n\n\nVous voyez, c'est comme ça que vous mourez. Translation: You see, this is how you die. Who: Coco Chanel, French fashion designer of women's clothes and founder of the Chanel brand.\n\n\n\nApproaching dissolution brings relief. Who: Neville Chamberlain, British prime minister.\n\n\n\nHello. Who: Graham Chapman, comedian of Monty Python fame. Note: Spoken to his adopted son who had just arrived at the hospital.\n\n\n\nTell [Carl] Mays I'm okay. Who: Cleveland Indians' baseball player Ray Chapman. Note: Chapman had been accidentally hit in the head by a pitch from Carl Mays, and died from complications of a skull fracture (1920). This was thirty-two years before batting helmets were first worn (Pittsburgh Pirates, 1952), and fifty years before Major League Baseball had made them mandatory (1970). To this day, Chapman is the only Major League Baseball player ever to die as a direct result of injuries sustained during a game.\n\n\n\nIn thine hendi, bevelhi ik minin geist. Translation: Into Thy hands, I commend my spirit. Who: Charlemagne\n\n\n\nI go from a corruptible to an incorruptible Crown, where no disturbance can be, no disturbance in the world. Remember! Who: Charles I, King of England, on the executioner's block, 30 January 1649.\n\n\n\nYou must pardon me, gentlemen, for being a most unconscionable time a-dying. Who: Charles II, son of the above, 1685.\n\n\n\nQuel meurtre! Quel sang! J'ai mal agi... Dieu, pardonne-moi! Translation: What murder! What bloodshed! I have done wrong... Oh God, forgive me. Who: Charles IX of France Note: Referring to his massively violent suppression of the Huguenot Protestants during his reign.\n\n\n\nVar inte rädd! Translation: Do not be afraid! Who: Charles XII of Sweden.\n\n\n\nAy Jesus. Who: Charles V, Emperor of the Holy Roman Empire and King of Spain , d. 1558.\n\n\n\nWhy not? After all, it belongs to him. Who: Comedian Charlie Chaplin, d. 1977, said this after a priest was reading him his last rites and said \"May the lord have mercy on your soul\".\n\n\n\nYo no quiero morir, por favor no me dejen morir. Translation: I don't want to die. Please don't let me die. Who: Hugo Chávez, President of Venezuela. Note: Due to a severe respiratory infection, he was unable to speak for several days before his death. According to Venezuelan general Jose Ornella, he mouthed these words before suffering a massive heart attack and dying.\n\n\n\nΔιδόναι ἄκρατον ἐπιρροφῆσαι τῷ ὄνῳ! ( Didónai ákraton epirrofísai tó óno ) Translation: Now give the ass a drink of pure wine! Who: Chrysippus, Stoic philosopher Note: Chrysippus was drunk off undiluted wine when he spied a donkey eating wild figs. He then shouted this humorous command at an old woman, laughed heartily, and died. Other sources simply claim he drank the undiluted wine and died because of it.\n\n)\n\nУ меня не было шампанского в течение долгого времени. ( U menya ne bylo shampanskogo v techeniye dolgogo vremeni. ) Translation: I haven't had champagne for a long time. Who: Anton Chekhov, playwright, 1904. Note: His doctor had given him champagne after all other attempts to ease the symptoms of death from tuberculosis failed.\n\n)\n\nTake a step forward lads - it'll be easier that way. Who: Robert Erskine Childers, last words, to his firing squad, Irish Civil War, 1922.\n\n\n\nGdy ta ziemia mnie udusi, błagam cię, abyś otworzył moje ciało, abym nie został pogrzebany żywcem. Translation: As this earth will suffocate me, I implore you to have my body opened so that I will not be buried alive.\n\nNigdy więcej. Translation: Not any more.\n\nZagraj w Mozarta na moją pamiątkę, a ja cię usłyszę. Translation: Play Mozart in memory of me—and I will hear you. Who: Frederic Chopin, Polish composer and pianist. Note: He had a neurotic fear of being buried alive. The first quote was written on a note some hours before his death. The second quote was spoken to his physician when asked if he was suffering greatly; he died about two hours later. The third quote is what Chopin reportedly murmured on his death-bed ( The opera reader , Biancolli, 1953, p. 271).\n\n\n\nIn keeping with the WXLT practice of presenting the most immediate and complete reports of local blood and guts news, TV-40 presents what is believed to be a television first: in living color, exclusive coverage of an attempted suicide. Who: Christine Chubbuck, 30-year-old anchorwoman who, on July 15, 1974, during technical difficulties during a broadcast on WXLT-TV in Sarasota, Florida, said these words on-air before producing a revolver and shooting herself in the head (While she drew the gun on camera, the technicians quickly cut the video feed, but the gunshot could be clearly heard). She was pronounced dead in hospital fourteen hours later. Reported in Kristine Bertini, Understanding and Preventing Suicide: The Development of of Self-Destructive Patterns and Ways to Alter Them (2009), p. 134 (under the mistaken surname, Hubbock). Note: This quote is taken from the transcript of the tape obtained by the Sarasota County Sheriff's Department. Though its legitimacy is unconfirmed, audio featuring an uncanny resemblance of Chubbuck's voice reading the transcript was leaked online in April of 2021.\n\n\n\nI'm so bored with it all. Who: Winston Churchill, a British statesman who was the Prime Minister of the United Kingdom Note: This was spoken before slipping into a coma and dying nine days later.\n\n\n\nNihil propriis quid facis, latro, autem non tentant recte ut interficias me. Translation: There is nothing proper about what you are doing, soldier, but do try to kill me properly. Who: Cicero, Roman statesman and orator. Note: These words are directed at Herennius, his assassin by order of Marc Antony, triumvir and co-ruler of Rome. Herennius was a centurion.\n\n\n\nSo remember, just when you think all the sounds of dogs barking, people mowing their lawns and children screaming are driving you mad, they may just be keeping you sane! Who: Dick Clark, American radio and television personality. Note: From a blog post nine days before his death. While not his last spoken words (Clark had difficulty speaking due to a stroke he experienced seven years prior), they were the last words he made to the public.[4]\n\n\n\nThomas, I am dying. Telegraph Mr. Harrison. Who: Henry Clay, an American lawyer and planter, politician, and skilled orator. Note: Spoken to his son. Mr. Harrison appears to be J.O. Harrison, Clay's executor. (Source: \"The Century Magazine\", vol. 33).\n\n\n\nΤόσο εδώ! ( Tóso edó! ) Translation: So here it is! Who: Cleopatra VII Philopator, the last active pharaoh of Ptolemaic Egypt. Note: \"It\" was the small asp which she allowed to bite her. Historians dispute the cause of her death. Many believe it was not an asp that she used to commit suicide, but rather some makeshift poison. (Source: Stacy Schiff's Cleopatra: A Life )\n\n)\n\nI have tried so hard to do right. Who: Grover Cleveland, 22nd and 24th President of the United States.\n\n\n\nAbsolutely not! Who: Montgomery Clift, actor. Note: His private nurse, Lorenzo James, asked him if he wanted to watch the movie The Misfits (in which he appeared) on TV.\n\n\n\nThank God. I'm tired of being the funniest person in the room. Who: Del Close, improviser, teacher and comedian, d. 1999.\n\n\n\n...it's better to burn out than to fade away. Who: Kurt Cobain, an American musician who was best known as the lead singer, guitarist, and primary songwriter for Nirvana Note: Cobain was quoting Neil Young lyrics when he wrote this line in his suicide note. The full context of the note is available online.\n\n\n\nDepuis le jour de ma naissance, ma mort a commencé sa marche. Il marche vers moi, sans se presser. Translation: Since the day of my birth, my death began its walk. It is walking towards me, without hurrying. Who: Jean Cocteau, French writer, designer, playwright, artist and filmmaker.\n\n\n\nI love you all. Who: Natalie Cole, an American singer-songwriter, and actress. Note: Spoken to her younger twin sisters.\n\n\n\nI love you and my head hurts. Who: Gary Coleman, an American actor, voice artist, and comedian.\n\n\n\nFive Zulu Alpha just had a midair. Both planes are going down in the, ah, one mile to the, ah, two miles to the west of the power plant Who: Bob Collins, Chicago Morning DJ. Note: On 8 February 2000, Collins was piloting a light aircraft into Waukegan, Illinois when his aircraft suffered a mid-air collision with another aircraft due to pilot error by Collins. Collins reported the mid-air collision before the aircraft crashed, killing both him and his passenger. The other aircraft also crashed, killing the pilot aboard.\n\n\n\nCan you get a shot of this gun? Who: Harry Collinson, Chief Planning Officer for Derwentside District Council. Note: On 20 June 1991, Collinson was supervising the demolition of a bungalow that had been built by Albert Dryden without planning permission. After a BBC camera crew arrived, Dryden produced an unlicensed pistol, and Collinson invited the crew to focus on it. Several seconds later, Dryden opened fire, killing Collinson and injuring BBC reporter Tony Belmont and PC Stephen Campbell; the Council's solicitor, Mike Newell, was shot at four times but not injured. Dryden was subsequently arrested after a stand-off and was found guilty by a jury of murder and three counts of attempted murder, being sentenced to life imprisonment with a tariff of 13 years.\n\n\n\nHeaven has turned against me. No wise ruler arises, and no one in the Empire wishes to make me his teacher. The hour of my death has come. Who: Confucius, Chinese philosopher and politician\n\n\n\nMore weight.\n\nI curse you Corwin and all of Salem! Who: Giles Corey, while being crushed during the Salem witch trials because he would not answer the court. Note: The first line was said while being crushed during the Salem Witch Trials for refusing to answer the court. After long hours of pain, Corey then uttered the second quote and died.\n\n\n\nLady, you shot me! Who: Sam Cooke, lethally wounded after being shot at the Hacienda Motel (now the Star motel).\n\n\n\nGood morning, Robert. Who: Calvin Coolidge, 30th President of the United States, to a carpenter working on his home. Coolidge is also said to have been quoted near his death: \"I feel I no longer fit in with these times.\" Coolidge, a staunch fiscal conservative and small-government federalist, was at odds with incoming President Franklin Delano Roosevelt, whose New Deal marked a major expansion of the federal budget.\n\n\n\nI am guilty. My sentence is just: I deserve my fate. And may God have mercy on my soul. Who: William Corder, moments before he was hanged on August 11, 1828, for the murder of Maria Marten at the Red Barn.\n\n\n\nI love you.\n\nI'm just tired. Who: Chris Cornell, an American musician and lead singer of Soundgarden and Audioslave. Note: The first line was the last thing Cornell said to his fans after performing his last song with Soundgarden at a concert. Within 60 minutes later, he was on the phone with his wife, slurring his words and repeatedly saying the second line before hanging up. He committed suicide by hanging shortly after.\n\n\n\nHello. We're looking in... we're overlooking the Financial Center. Three of us. Two broken windows. OH, GOD! OH- Who: Kevin Cosgrove, a victim of the September 11 attacks. He was connected to a 9-1-1 dispatcher, and he said the above phrase when the South Tower collapsed after it'd been hit by one of the airplanes used in the attacks.\n\n\n\nThat was the best ice-cream soda I ever tasted.\n\nI think I'll be more comfortable. Who: Lou Costello, American actor and comedian. Note: Reports vary as to whether his last words were the former to visitors upon finishing an ice-cream soda, or the latter to his nurse after asking to be moved onto his side.\n\n\n\nGoodnight, my darlings, I'll see you tomorrow. Who: Noel Coward, playwright. Died of natural causes.\n\n\n\nNo, my pain is too much, Fazila.\n\nI can't make it, I'm in too much pain. Who: Jo Cox, British Labour Party politician Note: Either one was spoken to her assistant, Fazila Aswat, after she tried to encourage Cox to stand after an attack. She later died of her injuries.\n\n\n\nIt don't matter; I figure I licked the Rock anyway. Who: Bernard Coy, convicted criminal, shot while trying to escape Alcatraz prison (known as \"The Rock\")\n\n\n\nGoodbye, everybody. Hart Crane, spoken as he committed suicide by jumping from a cruise ship. Reported in Kristine Bertini, Understanding and Preventing Suicide: The Development of of Self-Destructive Patterns and Ways to Alter Them (2009), p. 134.\n\n\n\nDammit, don't you dare ask God to help me! Who: Joan Crawford. Note: This comment was directed towards her housekeeper who began to pray aloud.\n\n\n\nThat was a great game of golf, fellas. Let's get a Coke. Who: Bing Crosby, American singer and actor. Note: He was playing the whole 18 holes of golf, even when his doctor said to only do nine. 20 minutes after the game, he suffered a fatal heart attack when heading back to the clubhouse.\n\n\n\nWhat is life? It is the flash of a firefly in the night. It is the breath of a buffalo in the wintertime. It is the little shadow which runs across the grass and loses itself in the sunset. Who: Crowfoot, chief of the Siksika First Nation.\n\n\n\nI am confound.\n\n(also quoted as I am perplexed.) Who: Aleister Crowley. British occultist, mystic, poet, mountain climber. This is open to debate, because some sources report Crowley dying alone, and others claim that he said Sometimes I hate myself. [5] [6]\n\n\n\nYou sons of bitches, give my love to Mother! Who: Francis \"Two Gun\" Crowley, an American murderer and career criminal.\n\n\n\nIt's not real. Who: John Crawford III Note: Spoken regarding a toy gun he was holding, in the toy section of a Wal-Mart in Beavercreek, Ohio.\n\n\n\nJe ne le veux pas. Translation: I don't want it. Who: Marie Curie, Polish and naturalized-French physicist and chemist. Note: She had been offered an injection to ease her pain.\n\n\n\nHurrah Boys! Let's get these last few reds then head on back to camp. Hurrah! [ Attributed ]\n\n] We've caught them napping! [ Attributed ] Who: George Armstrong Custer, a United States Army officer and cavalry commander in the American Civil War.\n\n]\n\nI killed the President because he was the enemy of the good people, the good working people. I am not sorry for my crime. [ Through clenched teeth ]: I am sorry I could not see my father. Who: Leon Czolgosz, American anarchist and assassin of President William McKinley. Note: He said the second line as he was being strapped on the electric chair.\n\n]: I am sorry I could not see my father.\n\nD [ edit ]\n\nRemember, my brain goes to Boston. Straight to Boston. Who: Daffney, professional wrestler and actress. Note: Said in a live video on Instagram, reading a suicide note while holding what appeared to be a pistol, referring to the chronic traumatic encephalopathy (CTE) testing center on the campus of Boston University. The following day, Daffney's death was announced; an investigation determined she had shot herself in the chest.\n\n\n\nYou know, I'm not frightened. It's just that I'll miss you all so much... Ow, fuck! Who: Roald Dahl, Welsh novelist, short story writer, poet, screenwriter, and fighter pilot. Note: First line said to his family. He then appeared to have lost consciousness, and the nurse decided to inject him with a lethal dose of morphine to ease his passing. After she did, Dahl said the second line right before dying.\n\n\n\nI don't care if I live or die. Go ahead and kill me. Who: Jeffrey Dahmer, serial killer. Note: According to fellow prisoner Christopher Scarver, who admitted to beating Dahmer to death with a \"preacher bar\" (part of a weight machine), these were his last words.\n\n\n\nOn és el meu rellotge? Translation: Where is my clock? Who: Salvador Dalí, a prominent Spanish surrealist painter\n\n\n\nIf all goes well, about a week. If not, about an hour and a half. Who: Rodney Dangerfield, American comedian. In response to how long he would be hospitalized.\n\n\n\nOne last drink, please. Who: Jack Daniel, an American distiller and businessman, the founder of the Jack Daniel's Tennessee whiskey distillery.\n\n\n\nMon seul regret est que je parte devant ce rat, Robespierre! N'oublie pas de montrer ma tête aux gens; ça vaut le coup d'être vu. Translation: My only regret is that I'm going before that rat, Robespierre! [to his executioner] Don't forget to show my head to the people; it's well worth seeing. Who: Georges Danton, a leading figure in the early stages of the French Revolution and the first President of the Committee of Public Safety. The last line is a humorous comment on his famous ugliness.\n\n\n\nI am not the least afraid to die. Who: Charles Darwin, an English naturalist and geologist, best known for his contributions to evolutionary theory.\n\n\n\nואיש יגע בהם ימלא ברזל ועץ חנית ובאש שרוף ישרפו בשבת ( Ve'ish yigga bahem, yimmalei varzel ve'etz chanit; uva'esh sarof yissarefu bashavet ) Translation: But the man who touches them (the worthless) must be armed with iron, and the shaft of a spear, and with fire they shall be utterly burned in their place! Who: David, third king of the United Monarchy of Israel\n\n)\n\nWell, first of all I'd like to address the MacPhail family. I'd like to let you all know, despite the situation -- I know all of you are still convinced that I'm the person that killed your father, your son and your brother, but I am innocent. The incident that happened that night was not my fault. I did not have a gun that night. I did not shoot your family member. But I am so sorry for your loss. I really am -- sincerely. All I can ask is that each of you look deeper into this case, so that you really will finally see the truth. I ask my family and friends that you all continue to pray, that you all continue to forgive. Continue to fight this fight. For those about to take my life, may God have mercy on all of your souls. God bless you all. Who: Troy Anthony Davis, high-profile death row inmate. Notes: Davis was executed by lethal injection in Georgia on September 21, 2011 for the murder of Officer Mark Allen MacPhail, despite serious doubts about his guilt that lingered on prior to his death.[7]\n\n\n\nIt's good to be king. Wait, maybe. I think maybe I'm just like a little bizarre little person who walks back and forth. Whatever, you know. Who: Terry A. Davis, programmer, creator of TempleOS. Note: Words were spoken on his last video before being struck and killed by a Union Pacific train.\n\n\n\nThat guy's got to stop... He'll see us. Who: James Dean, American actor. Note: Words said before dying in a car accident.\n\n\n\nMiss, I got what I really went for. Who: Jeremy Wade Delle Note: After this troubled teenager left his Texas classroom under the pretenses of obtaining a late pass, he returned with a gun, uttered these words, and committed suicide in front of his classmates. The incident was later immortalized in the Pearl Jam song \"Jeremy.\"\n\n\n\nDo you have it now? Who: John Denver Note: Spoken via cockpit radio after transmitting a four digit code. On October 12, 1997, Denver was killed when his Experimental Rutan Long-EZ plane crashed into the Pacific Ocean near Pacific Grove, California.\n\n\n\nOn the ground! Who: Charles Dickens Note: He suffered a stroke on a walk near his home, and asked to be laid down on the ground.\n\n\n\nMais comment le diable pensez-vous que cela pourrait me faire du mal? Translation: But how the devil do you think this could harm me? Who: Denis Diderot, French encyclopedist, upon being warned by his wife not to eat too much.\n\n\n\nLittle Cousins, Called back. Who: Emily Dickinson. Letter to Louise and Frances Norcross, May 1886. Source: Johnson, Thomas H., ed. Emily Dickinson Selected Letters. Cambridge: Belknap, 1971.\n\n\n\nI'm going to heaven. Who: Bo Diddley as he lay dying on his deathbed with his family surrounding him.\n\n\n\nDamn! Who: First Officer James Dillard Note: During take-off of American Airlines Flight 191, the engine separated. Prior to the black box failing, Dillard was heard saying these words. Shortly afterward, the plane crashed into the ground, killing all onboard including Dillard.\n\n\n\nYou got me. Who: John Dillinger, infamous American bank robber. This may be an apocryphal quote. Dillinger died when a bullet passed through his brain, leaving him little opportunity for final speeches.\n\n\n\nI'll finally get to see Marilyn. Who: Joe DiMaggio, talking about his former wife, Marilyn Monroe.\n\n\n\nישוע אתדכריני מריא מא דאתא אנת במלכותכן ( Yeshu eitdakrain marya ma dathei ant b'malkutach )\n\n) Translation: Jesus, remember me when you come into your Kingdom Who: Saint Dimas, a.k.a. the pentient thief\n\n\n\nShit! Shit! Stop! No! Who: Kyle Dinkheller, deputy of the Laurens County Sheriff's Office, Georgia Note: Said while being shot by Andrew Howard Brannan, whom he had pulled over for speeding. The enraged Brannan argued with Dinkheller and then began shooting him with an Iver Johnson M1 Carbine. Brannan fatally shot Dinkheller in the eye shortly after. The incident was caught on Dinkheller's dashcam and continues to be used to train law enforcement officers when confrontations become dangerous.\n\n\n\nGo, go. I'll be fine. Who: Ronnie James Dio, heavy metal singer. Note: Spoken to his wife while he was in the hospital with stomach cancer, but she stayed with him. A few days later he went into a coma and he was dead by the end of the week.\n\n\n\nKurt Russell. Who: Walt Disney Note: Scrawled on a piece of paper. To this day, nobody knows what he meant by it, not even Kurt Russell, who was 15 at the time.\n\n\n\nИоанн же удерживал Его и говорил: мне надобно креститься pour Тебя, и Ты ли приходишь ко мне? Но Иисус сказал ему в ответ: оставь теперь, ибо так надлежит нам исполнить всякую правду. Услышьте это сейчас, позвольте! Не сдерживай меня! ( Ioann zhe uderzhival Yego i govoril: mne nadobno krestit'sya pour Tebya, i Ty li prikhodish' ko mne? No Iisus skazal yemu v otvet: ostav' teper', ibo tak nadlezhit nam ispolnit' vsyakuyu pravdu. Uslysh'te eto seychas, pozvol'te! Ne sderzhivay menya! ) Translation: But John forbad him, saying, I have need to be baptised of thee, and comest thou to me? And Jesus answering said unto him, Suffer it to be so now: for thus it becometh us to fulfil all righteousness. Hear now—permit it. Do not restrain me! Who: Fyodor Dostoyevsky. The majority of the quote is the verses Matthew 3:14-15.\n\n)\n\nMike Bloomberg can get it done. Who: Kirk Douglas.\n\n\n\nDon't let them put me in one of those bags, I might suffocate. Who: Darragh Doyle spoken before dropping a live grenade at Omaha Beach.\n\n\n\nHit the water, hit the water, hit the water! Who: Jane Dornacker as she was giving a traffic report for radio station WNBC via helicopter. The helicopter stalled and plummeted into the Hudson River while Jane was still on the air, unintentionally broadcasting her final moments all across the metropolitan New York City area. The helicopter's other occupant was seriously injured, but survived.\n\n\n\nShakespeare, I come! Who: Theodore Dreiser.\n\n\n\nI don't know why Marta Glass wasn't allowed in here. I love you all. Keep the faith. Remember the death penalty is murder. They are taking the life of an innocent man. My attorney, Ron Kuley, will read my letter at a press conference after this is over. That is all I have to say. I love you all. Who: Robert Drew, d. August 2, 1994. Note: Executed by injection, Texas.\n\n\n\nTu vas me faire mal, s'il te plaît, ne me fais pas de mal, juste une minute de plus, je t'en supplie! Translation: You are going to hurt me, please don't hurt me, just one more moment, I beg you! Who: Madame du Barry\n\n\n\nDo you hear the rain? Do you hear the rain? Who: Jessica Dubroff, seven-year-old pilot speaking to her mother by telephone as the engines revved for takeoff, she (and her flight instructor) crashed minutes later in rough weather, April 11, 1996.\n\n\n\nAdieu, mes amis, Je vais à la gloire! Translation: Farewell my friends, I go to glory! Who: Isadora Duncan Note: Said before she got in her car to go home. Her scarf got caught around the wheel and strangled her instantly as the driver took off.\n\n\n\nStopping for a beer, be there when I can. Who: Ryan Dunn Note: Final text sent to Jackass co-worker Bam Margera, before getting involved in a car crash that would claim his life.\n\n\n\nDon't, don't, don't! This... this will hurt someone! Do not... Who: R. Budd Dwyer, Treasurer of the Commonwealth of Pennsylvania, before he placed the barrel of a .357 Magnum revolver into his mouth and pulled the trigger in front of TV news cameras that were videotaping what was originally presumed to be a press conference (Dwyer had been found guilty of accepting bribes, and professed his innocence to the literal last moments of his life. The press conference was held on what was to be the day before his sentencing). William Smith (the witness whose testimony was critical to Dwyer's conviction) said he lied under oath to get a lighter sentence.\n\n\n\nE [ edit ]\n\nWe are running on line north and south. Who: Amelia Earhart Note: Earhart famously disappeared on a flight over the Pacific. The above is the last confirmed radio transmission to her headquarters before vanishing.\n\n\n\nOkay, just wondering. Who: Dale Earnhardt, 7 time NASCAR Champion Note: Radioed to Andy Pilgrim while driving caution laps with 21 laps to go in the Daytona 500, waiting for the last start in the race that took his life. The rest of the conversation was as follows: Earnhardt- \"So, you got any advice for me here coming up?\"; Pilgrim- \"No, man, I haven't got any advice for you, just keep doing what you're doing.\"; Earnhardt-\"Okay, just wondering\"; Pilgrim- \"Cheers, talk to you later.\" http://www.aolnews.com/2011/02/10/ten-years-after-sharing-final-moments-and-a-drivers-seat-with/.\n\n\n\n[to his wife] Suppose, suppose. Who: Wyatt Earp, American Old West gambler, a deputy sheriff in Pima County, and deputy town marshal in Tombstone, Arizona Territory, who took part in the Gunfight at the O.K. Corral\n\nSuppose, suppose.\n\nMy work is done. Why wait? Who: George Eastman Note: Written in his suicide letter.\n\n\n\nSo on this day of reflection I say again, thank you for going on this journey with me. I'll see you at the movies. Who: Roger Ebert Note: Final paragraph of his last public blog post, written two days before his passing.\n\n\n\nIt's very beautiful over there. Who: Thomas Edison Note: Spoken to his wife as he lapsed in and out of consciousness. There is debate over if he meant the afterlife, or the view from his window.\n\n\n\nIn einem kurzen Weilchen, meine Herren, sehen wir uns ohnehin alle wieder. Das ist das Los aller Menschen. Es lebe Deutschland. Es lebe Argentinien. Es lebe Österreich. [...] Ich werde sie nicht vergessen. Translation: In a short while, gentlemen, we'll meet each other, anyway. That's every human's fortune. Long live Germany! Long live Argentina! Long live Austria! [...] I won't forget them. Who: Adolf Eichmann Note: Before his execution on June 1, 1962 in Jerusalem.\n\n\n\nCitater fra... Who: Albert Einstein Note: When Einstein died on April 18, 1955 he left a piece of writing ending in an unfinished sentence.\n\n\n\nYeah, how come? Who: Harry \"Parkyakarkus\" Einstein, dialect comic and character actor In response to a quip, made by Milton Berle during a Friars Club roast,asking why he did not have a regular television gig at the time. Einstein slumped over into his chair and died immediately after his response. [2]\n\n\n\nI've always loved my wife, my children, and my grandchildren, and I've always loved my country. I want to go. God, take me. Who: Dwight D. Eisenhower, 34th President of the United States.\n\n\n\nValerie. Who: T. S. Eliot Note: Valerie was the name of his wife at the time of his death.\n\n\n\n?מה־היה הדבר בני ( Meh-hayah haddavar beni? ) Translation: What happened there, my son? Who: Eli Note: A soldier fleeing from a battle found his way to Eli, who then asked what had happened. When the soldier told Eli the Ark of the Covenant had been captured by the Philistines, Eli fell backwards out of his chair and broke his neck.\n\n)\n\nWas ist mit mir geschehen? Translation: What has happened to me? Who: Elisabeth, Empress of Austria, stabbed to death on September 10, 1898.\n\n\n\nAll my possessions for a moment of time. Who: Elizabeth I, Queen of England, d. 1603.\n\n\n\nAre you all right? Who: Belinda Emmett, Australian actress. Note: Spoken to her sister, Lesley Arthur.\n\n\n\nHurrah for anarchy! This is the happiest moment of my life. Who: George Engel, anarchist, union activist Note: Shouted before his execution at the gallows.\n\n\n\nNow why did I do that? Who: General William Erskine Note: Said after he jumped from a window in Lisbon, Portugal in 1813.\n\n\n\nIch sterbe. Translation: I die. Who: Leonhard Euler, Swiss mathematician and physicist.\n\n\n\nFuck off. Who: Tony \"Spaghetti\" Eustace, Australian mobster. Eustace was found by two schoolchildren who were returning home from sports training on 23 April 1985. He had been shot six times in the back outside the Airport Hilton in North Arncliffe and was lying beside his gold Mercedes, bleeding profusely. He was rushed to hospital. Police attempted to speak to him, but Eustace only said those words, and died a short time later.\n\n\n\nF [ edit ]\n\nI've never felt better. Who: Douglas Fairbanks, Sr., actor, d. December 12, 1939\n\n\n\nWe've reached one of our phase lines after the fire fight and it smells bad – meaning it's a little bit suspicious...Could be an amb– Who: Bernard B. Fall, prominent war correspondent, historian, political scientist, and expert on Indochina during the 1950s and 1960s. Notes: Dictated into his tape recorder before stepping on a landmine in Vietnam\n\n\n\n[ Being asked: \"Have you ever pondered by yourself what will be your occupation in the next world?\". ]\n\nI shall be with Christ, and that is enough. Who: Michael Faraday, English chemist and physicist who contributed to the fields of electromagnetism and electrochemistry.\n\n] I shall be with Christ, and that is enough.\n\n[Death is like] going somewhere I've never been before, like Finland or Estonia. Who: Barry Farber, radio host and language enthusiast.[8]\n\n\n\nPlease don't leave me. Please don't leave me. Who: Chris Farley, American actor and comedian. Said to a prostitute as she left his hotel room following a weekend-long drug and sex binge. When she turned around, Chris Farley had collapsed.\n\n\n\nWhy aren't you filming this? This is what cancer is. Who: Farrah Fawcett, American actress, model, and artist. Note: Spoken to her friend Alana Stewart, who was filming a documentary about her struggles with cancer.\n\n\n\nRemember me as a revolutionary communist. Who: Leslie Feinberg, American, butch lesbian and transgender activist, communist, and author.\n\n\n\nFräls mig! Translation: Save me! or rather, Give me salvation! Who: Count Axel von Fersen. Note: Fersen, who was Swedish marshal of the realm, was attacked in a mob riot during the burial procession of the crown prince, whose death wrongly was blamed on Fersen. The Count called for help from the Guard, but was killed before they could do anything.\n\n\n\nI'd hate to die twice. It's so boring. Who: Richard Feynman, American physicist.\n\n\n\nGoddamn the whole fucking world and everyone in it except you, Carlotta. Who: W.C. Fields, American Actor and Comedian. Note: \"Carlotta\" was Carlotta Monti, actress and Fields' mistress.\n\n\n\nSmrt fašizmu, sloboda narodu! (Serbo-Croatian) Translation: Death to fascism, freedom to the people! Who: Stjepan Filipović, Croatian communist who led *Kolubara Company of the Valjevo Partisan Detachment* during the 1941 Partisan uprising.\n\n(Serbo-Croatian)\n\nThe nourishment is palatable. Who: Millard Fillmore, 13th President of the United States. Note: This was his response when his physician inquired about his food.\n\n\n\nNothing soothes pain like human touch. Who: Chess Grandmaster Bobby Fischer Note: Said while dying of kidney failure.\n\n\n\nI don't even know why I'm here. Who: Albert Fish Note: Said before execution [9]\n\n\n\nIf any of you have a message for the Devil, give it to me, for I am about to meet him! Who: Lavinia Fisher, hanged for murder on February 18, 1820, while wearing her white wedding dress gown.[10]\n\n\n\nGood enough. They'll be fine. Who: F. Scott Fitzgerald, Irish-American novelist and short story writer. Note: His response when asked if he wanted anything besides Hershey bars.\n\n\n\nHey, Jimmie! The Chimney Sweeps. Talk to the Sword. Shut up, you got a big mouth! Please come help me up, Henny. Max come over here... French Canadian bean soup... I want to pay, let them leave me alone... Who: Arthur Flegenheimer, mobster, also known as Dutch Schultz. Note: Flegenheimer had been fatally shot by another mobster and taken to the hospital. As police officers interrogated him on his deathbed, he gave them long and frequently incoherent answers, perhaps the most known of which is \"A boy has never wept...nor dashed a thousand kin\" before finally dying.\n\n\n\nI am sorry to trouble you chaps. I don't know how you get along so fast with the traffic on the roads these days. Who: Ian Fleming, British author and journalist. Note: Spoken to the ambulance drivers.\n\n\n\nI can't breathe. Who: George Floyd Note: Said while Derek Chauvin, a white police officer, pressed his knee to Floyd's neck for almost nine minutes while Floyd was handcuffed face down in the street.\n\n\n\nI've had a hell of a lot of fun and I've enjoyed every minute of it. Who: Errol Flynn, Australian-born actor.\n\n\n\nBilly, I've never sung that song and feel the way I do tonight.\n\nI'm awful tired now, Hank. I've got to go to bed. Who: Red Foley, American country singer \"Billy\" was Billy Walker, who had led a prayer of repentance for Foley earlier that night. The song Foley had sung was the gospel number \"Peace in the Valley.\" \"Hank\" was Hank Williams, Jr.; the words to him were the last words attributed to Foley in Williams's song \"I Was with Red Foley (The Night He Passed Away),\" and thus poetic license may have been taken.\n\n\n\nYou can stop now; I'm already dead. Who: Abigail Folger Note: Folger said this to her attackers, members of the Manson Family, after being stabbed repeatedly in the home of her friend Sharon Tate. Folger had first been injured in the house before running to the front lawn and collapsing, where she said her last words and died while being continually stabbed.\n\n\n\nI'll sleep well tonight. Who: Henry Ford, founder of the Ford Motor Company.\n\n\n\nI don't want to leave you guys. Who: Rob Ford, Canadian politician and businessman, and the 64th Mayor of Toronto.\n\n\n\nIt is better to die with honour than live without it. Echo November Alpha.\" Who: Colin Forman Note: Forman, an immigrant from England, had been dismissed as a pilot from Connair after a previous conviction for ticket forgery was discovered. After being fired from another flight company in Wyndham, Forman vowed revenge on Connair's boss, Roger Connellan, whom he believed told the company about his conviction. In January 1977, he stole a Beechcraft 58 Baron from Wyndham, flew to the Alice Springs airfield, and broadcast this final message to ATC before deliberately flying the plane into the Connair complex. Connellan and three other people in the building were killed.\n\n\n\nI've been very, very busy... being ill! Who: Bruce Forsyth, British presenter, when asked of his whereabouts in the year leading up to his demise.\n\n\n\nIch bin dankbar für die freundliche Behandlung während meiner Gefangenschaft und bitte Gott, mich gnädig aufzunehmen.\n\nTranslation: I am thankful for the kind treatment during my captivity and I ask God to accept me with mercy. Who: Hans Frank, German war criminal and lawyer who worked for the Nazi Party during the 1920s and 1930s, and later became Adolf Hitler's personal lawyer. Note: At the gallows, Frank, one of the only two war criminals to show true remorse for his crimes during the Nuremberg trials and sentencing, quietly answered to his name and calmly said these words before he was hanged.\n\n\n\nA dying man can do nothing easily. Who: Benjamin Franklin, one of the Founding Fathers of the United States. Also a leading author, printer, political theorist, politician, postmaster, scientist, inventor, civic activist, statesman, and diplomat. Note: As he lay dying, his daughter suggested that if he lay on his side, he could breathe easier.\n\n\n\nEs ist gar nichts... es ist gar nichts... Translation: It is nothing... it is nothing... Who: Franz Ferdinand Archduke of Austria-Hungary Whispered to Count Harrach as the Archduke fell unconscious after being shot; he died shortly without ever regaining consciousness. His assassination and subsequent death in Sarajevo in 1914 triggered the outbreak of World War I.\n\n\n\nWerfen Sie eine Decke über sie. Translation: Throw a quilt over her. Who: Frederick II of Prussia, who noticed his greyhound shivering and issued this order to his valet.\n\n\n\nDas ist nicht wahr! Ich werde in der Montur sterben? Translation: That's not true! I'm gonna die in this suit? Alternatively: No, not quite naked. I shall have my uniform on. Who: Frederick William I, King of Prussia from 1713 - 1740, d. 31 May, 1740\n\n\n\nDas gute Essen. Translation: The good meal. Who: Fredrik I of Sweden Note: He probably meant the Holy Communion although one of the king's favourite activities was to eat.\n\n\n\nHey, fellas! How about this for a headline for tomorrow's paper? 'French Fries'! Who: James French. Note: French, a convicted murderer, was sentenced to the electric chair. He shouted these words to members of the press who were to witness his execution.\n\n\n\nSag Anna von unserem Vortrag. Translation: Tell Anna of our talk. Who: Sigmund Freud Note: Anna was Freud's daughter. Freud had been in agony for some months due to oral cancer and had previously discussed with his physician that he wished to be euthanized rather than endure prolonged suffering.\n\n\n\nBitte lass es. Translation: Please leave it. Who: Werner von Fritsch\n\n\n\nWhy fear death? It's life's greatest adventure. Who: Charles Frohman, As he stood on the deck of the sinking liner RMS Lusitania with French actress Rita Jolivet, he quoted this line from his friend, J.M. Barrie's \"Peter Pan\" on the 7th May 1915 at 14:28pm. Note: Charles Frohman was standing on deck when the torpedo struck the RMS Lusitania, and 18 minutes later, he was dragged under with the ship by the suction. During then, he saw Rita Jolivet on deck and asked her to hold on to the rail until they knew what to do. His friends escaped and so did Rita, but Charles was among the 1198 people who perished in the disaster.\n\n\n\nShe is squeezing my hand! Who: Buckminster Fuller Note: In the period leading up to his death, his wife had been lying comatose in a Los Angeles hospital, dying of cancer. It was while visiting her there that he exclaimed, at a certain point: \"She is squeezing my hand!\" He then stood up, suffered a heart attack and died an hour later. His wife died 36 hours after he did.\n\n\n\nG [ edit ]\n\nI love you. Who: Zsa Zsa Gabor\n\n\n\nKiss my ass! You'll never find the rest! Who: John Wayne Gacy Note: Gacy's last words before being executed by lethal injection. The \"rest\" refers to the bodies of his other victims, which indeed were all found.\n\n\n\n!لا تطلق النار لي! لا تطلق النار لي ( la tutliq alnaar li! la tutliq alnaar li! )\n\n) !لا تقتلني يا أبنائي ( la taqtulani ya 'abnayiy! )\n\n) ماذا فعلت لك؟ هل تعرف الحق من الخطأ؟ ( madha faealt lak? hal taerif alhaqa min alkhata? )\n\n) !ماذا تفعل؟ حرام. لا يسمح به في الشريعة الإسلامية. حرام. ما تفعلونه ممنوع في الإسلام ( madha tafealu? haram. la yasmah bih fi alshryet al'iislamiat. haram. ma tafealunah mamnue fi al'iislam! ) Translation:\n\n) Don't shoot me! Don't shoot me!\n\nDon't kill me, my sons!\n\nWhat did I do to you? Do you know right from wrong?\n\nWhat are you doing? It's haraam [forbidden]. It's not allowed in Islamic law. Haraam. What you are doing is forbidden in Islam! Who: Muammar Gaddafi Note: All of the above were allegedly heard as Gaddafi was dragged through the streets. As of the 23rd of October 2011, there is no officially accepted version of the death of Gaddafi.\n\n\n\nI'd like to thank my family for loving me and taking care of me. And the rest of the world can kiss my ass. Who: Johnny Frank Garrett, Sr., d. February 11, 1992 Note: Executed by injection, Texas.\n\n\n\nБаатар! Жинхэнэ баатар! ( Bataar! Jinkhene baatar! )\n\n) Миний төгсгөлийг чамаас гуйхгүй, ямар ч шалтгаангүйгээр битгий уйлж, дуулгавартай байгаарай, дайсан минь миний үхлээс сэрэмжлүүлцгээе. ( Minii tögsgöliig chamaas guikhgüi, yamar ch shaltgaangüigeer bitgii uilj, duulgavartai baigaarai, daisan mini minii ükhlees seremjlüültsgeeye. ) Translation:\n\n) Hero! A real hero!\n\nLet not my end disarm you, and on no account weep or keen for me, lest the enemy be warned of my death. Who: Genghis Khan Note: The first set of words were presumably Genghis Khan's last words according to legend, while the second set were supposed to have been spoken after he fell ill as his forces approached the Tangut capital of Ningxia.\n\n\n\nNe pleure pas, Alfred ! J'ai besoin de tout mon courage pour mourir à vingt ans ! Translation: Don't cry, Alfred! I need all my courage to die at twenty! Who: Mathematician Evariste Galois Note: Spoken to his brother Alfred after being fatally wounded in a duel.\n\n\n\nचिंता मत करो, आराम करो! ( chinta mat karo, aaraam karo! ) Translation: Don't worry, relax! Who: Rajiv Gandhi, Indian Prime Minister. Note: To his security staff, allowing the suicide bomber to go near him as if to give flowers.\n\n)\n\nहे राम! ( Hé Ram! ) Translation: O God! Who: Mohandas Gandhi. Note: These words were reportedly spoken after Gandhi had been shot. According to his assassin Godse, Gandhi \"just made a 'Uh ...' kind of sound and slid down\". The above words were inserted by the Congress.\n\n)\n\n[ To his chief of staff, David G. Swaim ] Oh Swaim, there is a pain here. Swaim, can't you stop this? Oh, oh, Swaim! Who: James A. Garfield, 20th President of the United States. As quoted in \"The Last Hours\", Life of President Garfield: The Complete Record of a Wonderful Career (1881), by William Ralston Balch, p. 573.\n\n] Oh Swaim, there is a pain here. Swaim, can't you stop this? Oh, oh, Swaim!\n\nI can't breathe! Who: Eric Garner Note: Said while officer Daniel Pantaleo put him in a chokehold and slammed onto the ground. After a few seconds, Pantaleo uses his hands to push Garner's head down on the sidewalk. As Pantaleo removed his arm from Garner's neck, he said the above line eleven times before going unconscious.\n\n\n\nSave my son first! Who: Shad Gaspard, professional wrestler and actor. Note: Said to a lifeguard at Venice Beach, who tried to rescue Gaspard and his 10-year old son after a rip current had swept them both to sea, insisting that his son be rescued first. The lifeguard was able to rescue his son, but Gaspard was pushed back down under a wave shortly afterwards, disappearing until his body was found three days later washed up on the shore.\n\n\n\nI don't want to lay down! Who: Hank Gathers, college basketball player Note: Gathers collapsed during a tournament game between the Loyola Marymount Lions and Portland Pilots and was later pronounced dead at a nearby hospital. His death was attributed to a heart condition.\n\n\n\nÇa fait mal là. / Ça fait mal ici. Translation: I feel pain here. Who: Charles de Gaulle, French leader.\n\n/\n\nव्अय्अध्अम्म्आ स्अङख्आर्आ अप्प्अम्आद्एन्अ स्अम्प्आद्एथ्आ ( vayadhammā saṅkhārā appamādena sampādethā ) Translation: All compounded things are subject to vanish. Strive with earnestness. Who: Siddhārtha Gautama, a.k.a. the Buddha\n\n)\n\nI got what I wanted... I couldn't do it myself, so I had him do it... it's good, I ran my race, there's no more left in me. Who: Marvin Gaye Note: Moments earlier, Gaye was fatally shot by his father, Marvin Gay, Sr.\n\n\n\nFifty-fifty. Who: Lou Gehrig Note: Mouthed these words to his wife Eleanor.\n\n\n\nGoddamn you! Who: King George V of the United Kingdom Note: Alleged last words, after his nurse administered a sedative. Lord Bertrand Dawson, the royal physician, had given a poor prognosis of the king's worsening bronchitis, and decided to euthanize George V so that his death would reach the press in time for the morning news. George V himself adamantly protested, hence his fervent dying words. Neither Queen Mary or Edward VIII, George's wife and son, were consulted.\n\nOh, Jesus Christ! AAAAAAAHHHHH! AAAAAAAAAHHHHH! AAAAAAAAAHHHHH! [unintelligible] Who: Charles Gilbert, captain of Western Airlines Flight 2605. Note: Said after the flight landed on the incorrect runway and struck a maintenance vehicle, before banking right and flying towards an aircraft hangar. These were the last words captured on the flight's CVR before impact. Gilbert's exact last words are unclear, although it is possible that he may have yelled \"Oh shit! Momma!\"\n\n\n\nThere'll always be a Meersman. Who: Gary Gilmore Before his execution by firing squad in Utah on January 17, 1977. This was first execution in the United States after 10-years moratorium After being asked for any last words, Gilmore simply replied, \"Let's do it.\" The Rev. Thomas Meersman, the Roman Catholic prison chaplain, imparted Gilmore's last rites. After the prison physician cloaked him in a black hood, Gilmore uttered his last words to the Father Meersman:\n\nGary: Dominus vobiscum (Latin translation: \"The Lord be with you.\")\n\nMeersman: Et cum spiritu tuo (\"And with your spirit\")\n\nGary (grinning): There'll always be a Meersman.\n\nTIME Magazine, ed. \"After Gilmore, Who's Next to Die\", Time Magazine 31 Jan. 1977. Time.com. TIME Magazine Publisher: Time Inc. Web. 23 July 2009.\n\n\n\nTake her down! Who: Howard W. Gilmore Note: Gilmore was a submarine commander who chose to stay above water after his vessel inadvertently rammed a Japanese convoy ship and began to list. Grievously wounded, he commanded his crew to leave him behind and get below, and was assumedly swept out to sea as the submarine dove to take cover.\n\n\n\nMy most fervent wish is that I will not be replaced until a new president is installed. Who: Ruth Bader Ginsburg Note: Dictated to her granddaughter. [3] Despite her wishes, her Supreme Court seat was reappointed under the incumbent president at the time of her death.\n\n\n\nI'd rather be fishing. Who: Jimmy L. Glass Note: Before his execution in Louisiana electric chair, 1987\n\n\n\nI always knew what I was doing. Who: Jackie Gleason Note: to Audrey Meadows, via telephone, according to Meadows' book Love, Alice: My Life as a Honeymooner. Gleason died a week later on June 24, 1987.\n\n\n\nWell, I hope Percy ain't going to forget to wet the sponge. Put me on the highway to Jackson and call my Irish buddies. Póg mo thóin , God bless. Who: Robert Gleason Note: Said before execution. \"Póg mo thóin\" is Irish for \"Kiss my arse\".\n\n, God bless.\n\nGrazie, di tutto. Translation: Thank you for everything. Who: Blessed Father Carlo Gnocchi\n\n\n\nI-I don't know- I don't know nobody by that name! Who: Robert Godwin Sr. Note: Godwin Sr. had been randomly chosen by shooter Steve Stephens, who asked if Godwin Sr. could say \"Joy Lane\" (Stephens' girlfriend's name) and that she was the reason he was going to kill him. Perplexed, Godwin Sr. stated his last words immediately before being shot dead. Stephens filmed the entire incident and uploaded it to Facebook. He committed suicide by gunshot after being chased down by police two days later.\n\n\n\nMehr Licht. Translation: More light. Who: Johann Wolfgang von Goethe It is also reported that \"Come my little one, and give me your hand.\" were the last words he declared to his daughter-in-law Ottilie. Another version reported is \"Nichts mehr\" (nothing more)\n\n\n\nNo! I didn't come here to make a speech. I came here to die. Who: Crawford Goldsby, aka Cherokee Bill , when asked if he had anything to say before he was hanged.\n\n\n\nI don't know. Who: Jerry Goldsmith\n\n\n\nהכלב אנכי כי אתה בא אלי במקלות? לכה אלי ואתנה את־בשרך לעוף השמים ולבהמת השדה ( Hakelev 'anokhi, ki-'ata ba-'elai bammaqlot? L'kha 'elay, v'etna et-b'sarkha l'of hashamayim ul'vehemath hassade ) Translation: Am I a dog, that you would approach me with sticks? Come here, and I will give your flesh to the birds of the air and the beasts of the field! Who: Goliath\n\n)\n\nNew york, new york. Big city of dreams, but everything in new york aint always what it seems. (sent via Twitter account on 25 August 2009) Who: Adam Goldstein (aka \"DJ AM\") Note: He was found dead in his apartment three days later on 28 August 2009 after friends called police when they were unable to contact him for several days. While it is not known to be his last words, this was his last contact with friends and family. These are lyrics from a song by Grandmaster Flash and the Furious Five.\n\n\n\nThis is taking a long time. Who: David Goodall, Australian botanist, just after administering his own lethal injection as part of a physician assisted suicide at the age of 104.\n\n\n\n馬鹿者！馬鹿者！ ( Bakamono! Bakamono!! ) (also quoted as Bakayaro! Bakayaro! ) Translation: Idiots! Idiots! Who: Admiral Aritomo Gotō's last words to his staff, believing to have been hit by friendly fire, October 11, 1942\n\n)\n\nI really need a therapist. Who: Christopher Grace, an actor who killed himself during a matinee performance of Grease.\n\n\n\nCriei uma bandeira da dignidade do esporte. Eu supervisiono o nome da minha família com carinho, nervos e sangue constantes. Translation: I created a flag from the sport's dignity. I oversee the name of my family with affection, steady nerves and blood. Who: Hélio Gracie, co-founder of Gracie Jiu-Jitsu, or modern-day Brazilian Jiu-Jitsu.\n\n\n\nWater. Who: Ulysses S. Grant, 18th President of the United States Note: Suffering from throat cancer, Grant could not speak much, but shortly before his death he wrote what is also sometimes considered his last words: \"There was never one more willing to go than I am.\"\n\n\n\nVel, hvis det må være slik. Translation: Well, if it must be so. Who: Edvard Grieg, a Norwegian composer and pianist.\n\n\n\nI did not get my Spaghetti-O's, I got spaghetti. I want the press to know this. Who: Thomas J. Grasso, d. March 20, 1995 Note: Executed by lethal injection, Oklahoma.\n\n\n\nIt's stopped. Who: Joseph Henry Green Note: Said upon checking his own pulse.\n\n\n\nSchnell. Translation: Hurry. Who: Irma Grese Note: Spoken to her executioner, Albert Pierrepoint seconds before she was hanged.\n\n\n\nLord, into thy hands I commend my spirit! Who: Lady Jane Grey\n\n\n\nThe fir", "images": ["https://en.wikiquote.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikiquote.org/static/favicon/wikiquote.ico", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Wiktionary-logo.svg/50px-Wiktionary-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/80/Wikipedia-logo-v2.svg/50px-Wikipedia-logo-v2.svg.png", "https://upload.wikimedia.org/wikipedia/commons/c/c8/Ambox_notice.png", "https://en.wikiquote.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikiquote.org/static/images/footer/wikimedia-button.png"], "top_img": "https://en.wikiquote.org/static/favicon/wikiquote.ico", "keywords": [], "authors": [], "canonical_link": "https://en.wikiquote.org/wiki/Last_words", "title": "Last words", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "viewport": "width=1000", "og": {"title": "Last words - Wikiquote", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikiquote.org", "summary": ""}