{"url": "en.wikipedia.org/wiki/Despacito", "text": "2017 single by Luis Fonsi featuring Daddy Yankee\n\n\"Despacito\" ( American Spanish: [despa'sito]; \"Slowly\") is a song by Puerto Rican singer Luis Fonsi featuring Puerto Rican rapper and singer Daddy Yankee as the lead single from Fonsi's 2019 studio album Vida.[1][2] Released on January 12, 2017, the song was written by Fonsi, Erika Ender and Daddy Yankee, and produced by Mauricio Rengifo and Andrés Torres. A remix version featuring Canadian singer Justin Bieber was released on April 17, 2017, which helped to improve the chart performance of the song in numerous countries, including various number-one positions. \"Despacito\" has been widely credited by music journalists as being instrumental in popularizing Spanish-language pop music in the mainstream market again.\n\nIt is a reggaeton and Latin pop song composed in common time with lyrics about desiring a sexual relationship, performed in a smooth and romantic way. \"Despacito\" received generally favorable reviews from music critics, who praised the fusion between Latin and urban rhythms, its catchiness, and its text painting. It has received Latin Grammy Awards for Record of the Year, Song of the Year, Best Urban Fusion/Performance, and Best Short Form Music Video at the 18th Latin Grammy Awards. \"Despacito\" has been also ranked among the best Latin songs of all time and the best songs of 2017 by various publications, which referred to it as one of the most successful Spanish-language tracks in pop music history.\n\nThe song topped the charts of 47 countries and reached the top 10 of six others. In the United States, it became the first song primarily in Spanish to top the Billboard Hot 100 since Los del Río's \"Macarena\" in 1996, subsequently tying the longest-reigning number one on the Billboard Hot 100 at the time with 16 weeks, as well as becoming the longest-running number-one on the Hot Latin Songs chart with 56 weeks. It also became the first Latin song to receive a diamond certification by the Recording Industry Association of America. The music video shows both artists performing the song in La Perla neighborhood of Old San Juan, Puerto Rico and local bar La Factoría. It was the most-viewed YouTube video of all time from August 2017 to November 2020 and became the first video on the site to reach the milestones of three, four, five, six, and seven billion views. It is now the second most-viewed video on the site, with \"Baby Shark\" by Pinkfong being the first most-viewed.\n\nBackground [ edit ]\n\nOriginal version [ edit ]\n\npictured) co-wrote the song. Panamanian singer and songwriter Erika Ender ) co-wrote the song.\n\nThe lyrics of \"Despacito\" were written in late 2015 in Luis Fonsi's house in Miami because he wanted to record a \"swinging song\" for his new album after two years without releasing new music.[3][4] He woke up mulling about \"a song called 'Despacito'\" and invited Brazilian-Panamanian singer and songwriter Erika Ender to a songwriting session.[5] Fonsi co-wrote the song on a Gibson Emmylou Harris guitar.[6] He originally composed it as a cumbia and pop song with lyrics written as a ballad but decided to give it an \"urban injection\" and sent a demo to reggaeton artist Daddy Yankee.[4] They recorded the song at Noisematch Studios in Miami in late 2016.[7][8] Daddy Yankee improvised his verse in a corner of the studio's control room while thinking about his father playing bongos and wrote the post-chorus.[8][9] It was produced by Mauricio Rengifo and Andrés Torres; the former is known as a member of Colombian pop duo Cali & El Dandee and the latter is known for previously working with David Bisbal, Thalía, and Ricky Martin.[10][11] It was mixed by American engineer Jaycen Joshua at Larrabee Sound Studios in North Hollywood, Los Angeles.[12]\n\nLuis Fonsi does not consider it a reggaeton song but feels that \"it does have a reggaeton energy and an subtle urban beat\".[4] Ender stated that the track \"went through several arrangements\" until Fonsi got \"exactly the arrangement he wanted\".[5] Fonsi described \"Despacito\" as a very melodic song that can adapt well to many other music genres.[13] Due to the sensual nature of the song, they \"needed to be responsible with a good lyric\" and Ender's approach to writing for Fonsi was \"to take care of how to say things with a good taste\".[3] In April 2017, American singer and songwriter Nicky Jam revealed that the original version of \"Despacito\" featured him instead of Daddy Yankee, but had to decline due to the song's release interfering with the launch of his album Fénix.[14]\n\nJustin Bieber remix version [ edit ]\n\nThree months after the release of \"Despacito\", Canadian singer Justin Bieber wanted to record a remix version after hearing the song in a Colombian nightclub during a tour in South America.[15] The following day, Luis Fonsi received a phone call from Universal Latin about the intentions for remix and authorized the label to send the track to Bieber.[16] Bieber's manager Scooter Braun contacted his vocal producer Josh Gudwin to work on the song, who flew to Bogotá and recorded Justin Bieber's vocals at Estudios Audiovisión.[17]\n\nJustin Bieber sang in Spanish for the first time in his career with the help of Colombian musician Juan Felipe Samper.[18][19] What was most difficult for Justin Bieber was the 'ere' (ɾ) sound in words like \"laberinto\" (labyrinth), \"paredes\" (walls) and \"manuscrito\" (manuscript).[19] Samper wrote the Spanish-language lyrics phonetically to ease Bieber's pronunciation, which was \"perfectly\" achieved in two hours.[19] After a four-hour recording session, Gudwin sent Bieber's vocal tracks to Australian sound engineer Chris O'Ryan for vocal tuning.[17] Gudwin concluded the remix's production in Parrot Cay, Turks and Caicos Islands with the mixing of Luis Fonsi's English-language vocals, whose lyrics were written by American songwriter Marty James.[17] The entire process until the release date took six days.[17] In June 2017, English musician Ed Sheeran revealed that he wanted to record a remix version of the song but lost out to Justin Bieber.[20]\n\nComposition [ edit ]\n\n\"Despacito\" is a reggaeton and Latin pop song composed in common time (4\n\n4 time) with a length of three minutes and forty-seven seconds and written in the key of B minor[21] with a tempo of 89 beats per minute and a common chord progression of Bm—G—D—A.[22][23][24] The vocals span from F# 3 to A 4 .[25] Its implicit lyrics are about having a sexual relationship in a smooth and romantic way, making heavy use of allegories.[26] However, Luis Fonsi expressed that some lines are free for interpretation.[27]\n\n\"Despacito\" (original version) sample Partial bridge and partial chorus of \"Despacito\" Problems playing this file? See media help.\n\nMauricio Rengifo and Andrés Torres produced \"Despacito\" using Pro Tools and the final mix consisted of 47 tracks.[28] The song begins with a Puerto Rican cuatro played by Christian Nieves, which is accompanied by an acoustic guitar played by Torres when Luis Fonsi starts performing.[28] Rengifo stated that the guitar \"was actually played, but then [they] chopped it and made it really digital.\"[28] The producers decided to record a cuatro because they wanted \"to feel very Puerto Rican and ethnic\" and that it \"gives the song a really unique character.\"[28] Nieves played salsa-influenced melodies during the chorus and the hook, which contains \"old school pop\" effects based on American producer Dr. Luke.[28] Percussion instruments guache and güira were synchronized with a hi hat in order to highlight the track's cumbia influences.[28]\n\nThe song uses the side-chaining production technique in order to make the chorus \"more prominent,\" silencing the music as the kick drum hits.[29] It also makes heavy use of text painting when the music is slowed down as the word \"despacito\" (slowly) is performed at the beginning of every chorus.[29] Its percussion consists of guache, cowbell, timbales, güira, and sequenced drum patterns.[28] The remix featuring Justin Bieber maintained the original rhythms and Luis Fonsi translated some lines to English, singing a verse in Spanglish, while Daddy Yankee's verses were kept from the original version.[18]\n\nRelease and reception [ edit ]\n\n\"Despacito\" was made available for digital download on January 13, 2017, by Universal Music Latin. Some music publications believed the single's success was influenced by a trend of combining Latin pop and urban music.[30] Fonsi referred to it as \"the new pop\" and Ender said that \"everyone is making this type of fusions.\"[3] Luis Fonsi also stated that two weeks after the release of the song and its music video he started receiving calls from \"people who normally don't call, people who only call when something different is going on.\" He got calls from Ricky Martin, Juan Luis Guerra, Marc Anthony and other artists telling him that the track was a \"home run.\"[31]\n\nSebastian Wernke-Schmiesing of Dance-Charts journal stated that \"a simple 4/4 time, Spanish guitar sounds, a crisp bass, and the excellent vocals by Luis Fonsi and [Daddy Yankee] were enough to get a hit single from the start.\"[32] Leila Cobo of Billboard praised its \"undeniable immediate catchiness\" and wrote that the song \"is a clever blend of romantic Latin pop with a reggaeton beat and subtly naughty lyrics.\"[33][34] Robert Joffred of Medium's culture blog That Good You Need highlighted the use of a steel-string guitar to play flamenco-style melodies instead of a nylon-string guitar, as well as the presence of \"swung rhythms\" when the word \"Despacito\" is sung at the beginning of the chorus[29] He referred to the text painting as \"pretty genius.\"[29] Raisa Bruner of Time magazine described the single as \"an infectious Latin melody amped up with reggaeton grooves and an irresistible dance tune.\"[35]\n\nSpanish record producer Nahúm García stated that \"the way the rhythm breaks before the chorus is genius\" and that this \"trick\" in particular is not common in pop music.[36] Joshua Barrie of Irish Mirror gave a negative opinion about the lyrics, referring to them as \"quite rude and a bit creepy\" and stating that \"some people might find them offensive.\"[37] On the other hand, an editor of Spanish music website Jenesaispop stated that \"the melody is very good, the lyrics are sexy without being vulgar and above all its structure is interesting.\"[38] Felix Contreras of National Public Radio praised the writing, arrangement and performances.[39]\n\nThe remix version featuring Justin Bieber was released on April 17, 2017, by Universal Music Latin, Republic Records, Def Jam Recordings, RBMG and School Boy Records.[40] Its official audio video garnered 20 million views on YouTube on its first 24 hours, making it the third-highest debut for a music-related video in 2017 as of September.[41] Caroline Soriano of Ernstars magazine stated that Bieber's voice \"sounds appealing with the song,\" whose remix version make it sound \"a little bit better.\"[42] Mike Senior of Sound on Sound gave a negative review of the remix's mixing by criticizing its polarity inversion regarding the original version and Justin Bieber's louder vocal track than Daddy Yankee's.[43] As to the original version, Senior referred to the first appearance of the \"Despacito\" hook line as a \"masterstroke\".[43]\n\nIn July 2017, officials from the Government of Malaysia reported that \"Despacito\" was being banned from airing on government-owned broadcast stations as a result of public complaints.[44] Government ministers said that the song was considered un-Islamic and that its lyrics were \"not suitable to be heard.\"[44]\n\nAccolades [ edit ]\n\n\"Despacito\" has received various awards and nominations following its commercial success. In 2017, the original version won three awards at the 18th Latin Grammy Awards including Record of the Year, Song of the Year and Best Short Form Music Video, while the remix version won Best Urban Fusion/Performance.[45] It also won Collaboration of the Year and was nominated for Video of the Year at the 45th American Music Awards.[46] In 2018, the remix version received three nominations for Record of the Year, Song of the Year, and Best Pop Duo/Group Performance at the 60th Grammy Awards.[47] The remix also received six Billboard Latin Music Awards and five Billboard Music Awards.[48][49] Erika Ender became the youngest person to be inducted into the Latin Songwriters Hall of Fame and the first female Latin artist to garner a Grammy Award for Song of the Year nomination.[50][16]\n\nBillboard's critics ranked the original version the fourth best song of 2017 and the fifth best Latin song of all-time, referring to it as \"one of the biggest hits in Latin music history\" and \"one of the biggest singles of all-time.\"[51][52] Rolling Stone and Time selected it as the seventh and third best song of 2017, respectively; the latter stating that \"in a year where xenophobia reared its head worldwide, it inspires hope that the charts were dominated by such a universal, multicultural hit.\"[53][35] Spin magazine ranked the remix version the 38th best song of the year, stating that \"it managed to transcend genre, time, space, and even personal taste in a way that was unprecedented.\"[54] It was also included among the 100 best singles of 2017 by PopSugar,[55] The New York Times,[56] National Public Radio,[39] The Village Voice,[57] and The Guardian.[58] Luis Fonsi and Daddy Yankee were selected as the \"Stars of the Year\" by People en Español.[59]\n\nRolling Stone's critics ranked the track 91st in its \"100 Greatest Songs of the Century So Far\" list and included it among the 50 greatest Latin pop songs of all-time, describing it as \"one of the most successful hits in pop music history.\"[60][61] Billboard selected it among the best Latin summer songs of all-time and included it among the 100 songs that defined the 2010s decade.[62][63] The song was inducted to the 2019 edition of the Guinness World Records for achieving seven milestones.[64]\n\nCommercial performance [ edit ]\n\nUnited States [ edit ]\n\nIn the United States, the single debuted at number two on Billboard's multi-metric Hot Latin Songs chart on February 4, 2017, becoming Fonsi's highest-charting single since \"Aquí Estoy Yo\" on June 13, 2009.[65] \"Despacito\" reached number one on the US Hot Latin Songs chart on February 18, 2017, where it remained there for 35 consecutive weeks until October 14, 2017, when it was dethroned by \"Mi Gente\" by J Balvin and Willy William featuring Beyoncé the following issue.[40] In 2018, it returned to number one in three different runs for 21 non-consecutive weeks.[40] It is the longest-reigning number-one on Hot Latin Songs and surpassed the 41 weeks of 2014's \"Bailando\" by Enrique Iglesias featuring Descemer Bueno and Gente de Zona on February 17, 2018.[66] \"Despacito\" became the list's second longest-charting title and was removed from the chart on March 9, 2019, after 110 weeks due to a recurrent rule.[67]\n\nOn the US Billboard Hot 100 chart, the single debuted at number 88 on February 4, 2017, becoming Fonsi's third entry and Daddy Yankee's seventh.[68][69] It subsequently peaked at number 44 on April 15, 2017, before the release of the remix version featuring Justin Bieber.[70][71] \"Despacito\" reached number one on the Hot 100 on the week ending May 27, 2017, becoming both Fonsi and Daddy Yankee's first number one on the chart and Bieber's fifth.[72] It topped the Hot 100 for 16 consecutive weeks, tying with \"One Sweet Day\" by Mariah Carey and Boyz II Men as the longest-leading number-one single in the chart's history at the time, before being surpassed by \"Old Town Road\" by Lil Nas X featuring Billy Ray Cyrus on August 3, 2019.[73][74] It also became the first mostly-Spanish-language song to lead the all-genre US Digital Songs chart, as well as the first non-primarily-English-language song to top the all-format Radio Songs and Mainstream Top 40 charts.[75][76] On October 21, 2017, \"Despacito\" and \"Mi Gente\" by J Balvin and Willy William featuring Beyoncé marked the first time ever that two non-primarily-English-language songs ranked within the top 10 of the Hot 100 simultaneously.[77] The song spent 52 weeks on the Hot 100 and was removed through a recurrent rule.[78]\n\n\"Despacito\" was the best-selling and most-streamed single of 2017 in the United States, with 2,692,000 downloads sold and 1,322,799,000 streams.[79][80] It was also the sixth most-played song of 2017, with 608,000 spins across US radio stations and an audience of 3,076,935,000.[80] It ranked at number two on the Hot 100 year-end chart and was the best-performing single on Hot Latin Songs for two years in a row in 2017 and 2018.[81][82][83] In the United States, the single sold 2,983,000 downloads as of June 20, 2019[a] and received a 13× platinum certification by the Recording Industry Association of America (RIAA) on January 6, 2020, for units of over 13 million sales plus track-equivalent streams, making it the highest-certified single of all-time in the United States.[87] It became the first Latin and 18th overall single to receive a diamond certification by the RIAA.[88] It was the ninth best-performing single of the 2010s decade on the Hot 100 and was ranked at number one on the Hot Latin Songs chart.[89][90] It is the best-performing track of all-time on Hot Latin Songs and the 33rd best-performing on the Hot 100.[91][92]\n\nInternational [ edit ]\n\nInternationally, \"Despacito\" has topped the charts of 47 countries, including the original version alone and combined chart entries with the remix version featuring Justin Bieber.[93][94] The song spent 26 weeks at number one in Spain,[95] 20 in Switzerland,[96] 18 in France,[97] 17 Germany,[98] 16 in Canada,[99][100] 14 in Italy,[101] 13 in Australia[102] and 11 in the United Kingdom, among others.[103] Across Europe, the song was certified 13× platinum in Sweden[104] and Spain,[105] diamond in France[106] and Italy[107] and 4× platinum in the United Kingdom[108] and Germany, among others.[109] It also received a diamond certification in Canada[110] and a 5× platinum certification in Australia.[111] In Latin America, it was certified 6× diamond in Brazil[112] and 5× diamond and 4× platinum in Mexico.[113] The remix version alone topped the charts of five countries and was certified platinum in New Zealand[114] and Brazil[112] and gold in Germany.[115]\n\nIn the United Kingdom, \"Despacito\" was the second best-selling and most-streamed song of the year, with 2.3 million combined sales.[116][117] It was also the best-selling single of 2017 in Canada, with more than 300,000 digital sales.[118] It topped the 2017 year-end charts of 16 countries and was the second best-performing song in 15 others. In Latin America, it was the most-played radio song of 2017, with 580,450 spins, as well as the best-performing foreign song of the year in Brazil.[119][120] \"Despacito\" was the second best-selling single of 2017 across the world, with 24.3 million sales plus track-equivalent streams.[121][122] In 2018, it was the sixth best-selling song of the year, with 11.8 million sales plus track-equivalent streams, and was the 72nd most-played song in Latin America, with 107,980 spins.[123] \"Despacito\" also peaked at number 114 on the recently inducted Billboard Global 200 chart on the issue date August 7, 2021.[124]\n\n\"Despacito\" became the world's most-streamed song of all-time in July 2017, with 4.6 billion streams between the original and remix version.[125] It was streamed 7.5 billion times as of April 2018.[93] The remix version became the first primarily-Spanish-language song to surpass one billion streams on Spotify in February 2018, while the original became the first non-English single to reach the milestone in June 2019.[126][127] In the United Kingdom, it became the longest-reigning foreign language number-one and is the 30th best-selling single in the country with 1,900,599 combined sales as of September 19, 2017.[103][128] It also became the song with most weeks at number one in Switzerland and Germany.[129]\n\nImpact [ edit ]\n\nThe success of the song and its remix version led Daddy Yankee to become the most listened-to artist worldwide on streaming service Spotify on July 9, 2017, being the first Latin artist to do so.[130] He later became the sixth most listened-to artist of 2017 on Spotify.[131] \"Despacito\" was cited by Billboard's Leila Cobo as the song that renewed interest in the Latin music market from recording labels in the United States.[132] Xander Zellner of Billboard credited the influence of the single's success for the Latin music domination in the US mainstream market during 2017, as 11 primarily-Spanish-language songs debuted on the Hot 100.[77] American songwriter Desmond Child and Cuban musician Rudy Pérez expressed that \"not since Ricky Martin's 'Livin' La Vida Loca' has there been a song in any genre that has had the global impact of 'Despacito', changing the course of pop music forever.\"[50] In 2017, six out of the 10 most-viewed YouTube music videos were for songs performed in Spanish by Latin artists and Billboard's Lars Brandle referred to it as \"the 'Despacito' effect.\"[133]\n\nBritish Official Charts Company recognized it as the song that \"helped Latin pop crossover to the mainstream once again.\"[134] Nielsen's Erin Crawford stated that the track had \"a halo effect on several other Latin hits ripe for crossover success\", most notably on J Balvin and Willy William's \"Mi Gente\"[80] Rolling Stone stated that the song \"hastened a massive historical turn in American music, demonstrating the mainstream viability of Spanish-language pop.\"[60] John Ochoa of Rolling Stone stated that \"the resulting so-called 'Despacito effect' has advanced a wave of subsequent Spanish-language hits and mainstream crossovers.\"[61]\n\nThe Recording Industry Association of America reported that Latin music revenues grew 37% in 2017, mostly due to music streaming.[135] Latin music's consumption in the United States increased 15% between the first half of 2016 and the first half of 2018.[136] The International Federation of the Phonographic Industry (IFPI) reported that revenue in Latin America grew 17.7% in 2017 and described \"Despacito\" as a \"game-changing hit.\"[121] In 2018, eight out of the 10 most-viewed YouTube music videos of the year were for songs performed in Spanish and the Canadian Broadcasting Corporation referred to it as \"the 'Despacito' effect.\"[137][138]\n\nSony/ATV Music Publishing President Jorge Mejía stated that the song marked a \"before and after\" in the global consumption of Latin music.[139] Before its success, Sony \"had a big Latin single roughly every two years,\" a situation that reverted into an \"avalanche of Latin songs around the world.\"[139] Andrew Unterberger of Billboard stated that \"2017 was the year that Latin pop took over the United States\" due to the song and its quick impact on \"Mi Gente\", Camila Cabello's \"Havana\", and the chart performance of acts including Maluma, Ozuna and Bad Bunny, who achieved their biggest hits in the country.[140]\n\nIn July 2017, it was reported that tourist interest in Puerto Rico increased by 45% since the worldwide success of the song.[141][142] Tour operators cite the song's music video for increasing interest in locations such as Club La Factoría and La Perla district in Old San Juan, which were featured in the video.[143]\n\nMusic video [ edit ]\n\nBackground [ edit ]\n\n2006 Miss Universe Zuleyka Rivera also starred in the music video.\n\nThe music video for \"Despacito\" was directed by Puerto Rican director Carlos Pérez and produced by Joanna Egozcue and Roxy Quiñones.[144] Filming took place in December 2016 in La Perla neighborhood and the bar La Factoría in San Juan, Puerto Rico.[144] Carlos Pérez had previously worked with Luis Fonsi on \"Corazón en la Maleta\" (2014) and with Daddy Yankee on clips including \"Gasolina\" (2004), \"Rompe\" (2005), \"Descontrol\" (2010), and \"Ven Conmigo\" (2011), among others.[145] 2006 Miss Universe Zuleyka Rivera co-starred in the video and was contacted by Fonsi to represent \"the powerful Latina woman.\"[31]\n\nJorge Muñíz Ortíz of EFE stated that the music video \"highlights some of the main cultural and folkloric symbols of Puerto Rico\" by showing its \"splendid beaches, the colorful landscape of La Perla, the rattle of the Puerto Rican cuatro and the barrels of the autochthonous genre of bomba, Zuleyka Rivera's hips movement and a pair of men enjoying a game of dominoes.\"[146] On April 10, 2018, Luis Fonsi's YouTube Vevo account was hacked by an anonymous group, who removed the video from his channel for hours before becoming available again.[147]\n\nSynopsis [ edit ]\n\nThe video shows both artists performing the song while participating on different parties on the island, featuring model Zuleyka Rivera.[148] The clip starts with shots of La Perla's coast during daylight while showing Zuleyka Rivera arriving at the shanty town on foot. Luis Fonsi and Daddy Yankee perform the song in a street while elders are playing dominos, a child is getting his hair cut, two people are talking while listening to the radio, and couples are dancing in the background. The video intercalates with shots of Fonsi and Daddy Yankee singing in front of a car with people sitting on it and dancing next to it. As Daddy Yankee is finishing his verse, Zuleyka Rivera enters La Factoría bar while the artists are performing and dancing alongside other people, and men are playing bomba drums.[146] Fonsi proceeds to dance with Rivera as the song ends. The outro consists of Luis Fonsi and Daddy Yankee singing the hook a cappella with the people at the bar.[146]\n\nRelease and reception [ edit ]\n\nThe official music video on YouTube was released on Fonsi's channel on January 12, 2017, and amassed one billion views in 97 days, becoming the second-fastest video on the site to reach the milestone.[149][150][151] It also became the fastest video on YouTube to surpass two billion views, with 154 days.[152] The clip became the first on YouTube to receive three, four, five, and six billion views on August 4, 2017; October 11, 2017; April 5, 2018; and February 24, 2019, respectively (dates are based on UTC).[153][154][155][156] It has received over 7.8 billion views as of April 26, 2022 and was the most-viewed video on the site from August 4, 2017, until November 2, 2020, when Pinkfong's video for \"Baby Shark\" surpassed it, dethroning it to second place.[149][157][158] It is also the site's most-liked video, with over 48 million likes as of April 26, 2022.[159] On Vevo, the music video received 5.14 million views in its first 24 hours of release, which the website reported as being the most for a Spanish-language video's first day on its platform.[65]\n\nThe music video received a Latin Grammy Award for Best Short Form Music Video at the 18th Latin Grammy Awards and a Billboard Music Award for Top Streaming Song (Video) at the 25th Billboard Music Awards, and was nominated for an American Music Award for Video of the Year at the 45th American Music Awards.[45][46][49]\n\nLive performances [ edit ]\n\nLuis Fonsi and Daddy Yankee performed \"Despacito\" live together for the first time at the 2017 Billboard Latin Music Awards on April 27, 2017, and later on The Voice season 12 finals on May 23, 2017.[160][161] The only live performance by Justin Bieber and Luis Fonsi was at the José Miguel Agrelot Coliseum in Puerto Rico on April 18, 2017, during the former's Purpose World Tour.[162] Bieber was not able to sing the song during live performances and was caught replacing portions of the lyrics with the word \"blah\" and nonsensical ramblings during one performance in a much publicized incident.[163] Fonsi has defended him for not knowing the lyrics, saying that he has to be given \"a little bit of a pass\" because Spanish is not Bieber's main language.[164]\n\nLuis Fonsi performed \"Despacito\" on American talk show Conan on June 12, 2017 -his first late-night television appearance in the United States- and on The Ellen DeGeneres Show on September 14, 2017.[165][166] He also performed the song with random lyrics alongside American television host Jimmy Fallon on The Tonight Show Starring Jimmy Fallon on January 30, 2019.[167]\n\nBoth Luis Fonsi and Daddy Yankee included the song on their setlists for the 2017–18 Love + Dance World Tour and the 2017 Tamo En Vivo Europe Tour, respectively.[168][169][170] On November 16, 2017, Luis Fonsi sang \"Despacito\" featuring Puerto Rican singer Victor Manuelle, Colombian band Bomba Estéreo and American disc jockey Diplo at the 18th Latin Grammy Awards.[171] On January 28, 2018, Luis Fonsi and Daddy Yankee performed the song at the 60th Grammy Awards on the Madison Square Garden, becoming the 12th and 13th Latin artists ever to perform at the Grammy Awards.[172][173] Fonsi also participated on United States President Joe Biden's inauguration by performing \"Despacito\" at the Celebrating America special on January 20, 2021.[174]\n\nOther remixes and cover versions [ edit ]\n\nThe first two official remixes for \"Despacito\" were released on March 17, 2017: a solo pop version by Fonsi and a salsa version featuring vocals by Puerto Rican musician Víctor Manuelle.[175] Two other remixes were released on May 5, 2017: an electronic dance version produced by American trio Major Lazer and Colombian DJ MOSKA and an urban version remixed by Colombian producer Sky.[176] A Portuguese-language version written by Erika Ender and performed by Luis Fonsi featuring Brazilian singer Israel Novaes was released on July 14, 2017.[177] A banda version by Luis Fonsi with Mexican group La Bandononona Clave Nueva De Max Peraza was released on September 1, 2017. A Spanish/Mandarin version by Luis Fonsi and Singaporean singer-songwriter JJ Lin was released on January 26, 2018.[178] A Norwegian version was released by Carina Dahl and Adrian Jørgensen in February 2018.[179] This version was certified Gold by IFPI Norway in 2019 and Platinum in 2021.[180]\n\nThe song has been covered by a wide range of artists around the world, including Korean singer J.Fla,[181] a classical crossover by Croatian-based duo 2Cellos,[182] a metal version by Norwegian musician Leo Moracchioli, a piano version by Hungarian pianist and world record-holder Peter Bence,[183] an acoustic version by American band Boyce Avenue[184] and a Broadway-style cover by American musical collective group Postmodern Jukebox.[185] These covers garnered between seven and 47 million views on YouTube except for J.Fla's video, which has 172 million views. Leo Moracchioli's version peaked at number 35 on the Hungarian Single Top 40 chart on August 10, 2017.[186]\n\nPolitical uses [ edit ]\n\nThe song has been used, with altered lyrics, for political purposes. In Argentina, the melody was used by various politicians for their respective TV advertisements for the 2017 midterm elections, by scientists to protest against President Mauricio Macri and by feminists as an initiative to convoke people to a concentration about violence against women.[187][188][189] Venezuelan President Nicolás Maduro used it to call for voting in the controversial Constituent Assembly election.[190] Luis Fonsi, Daddy Yankee and Erika Ender showed their displeasure with the unauthorized use of the song for political purposes in Venezuela, criticizing Maduro's government use of the song as propaganda.[191][192] On August 16, 2017, English television host James Corden remixed the song to comment on American President Donald Trump during his talk show The Late Late Show with James Corden.[193] On September 15, 2020, Democratic presidential nominee Joe Biden played a few bars from the song at a campaign event headlined by Luis Fonsi. In response, Trump tweeted an edited video showing Biden instead playing N.W.A's \"Fuck tha Police\".[194]\n\nДесь по світу (\"Somewhere in the world\") was a Ukrainian version of the song, produced featuring children in Drohobych Raion, to encourage the return of Ukrainians working abroad.[195]\n\nCredits and personnel [ edit ]\n\nOriginal version Credits adapted from Tidal and The Latin Recording Academy.[45][196] Erika Ender – songwriting\n\nLuis Fonsi – songwriting, vocals\n\nJaycen Joshua – mixing\n\nDave Kutch – mastering\n\nChristian Nieves – Puerto Rican cuatro\n\nMauricio Rengifo – producer, recording engineer\n\nJuan Rivera \"Gaby Music\" – recording engineer\n\nLuis Saldarriaga – recording engineer\n\nAndrés Torres – producer, recording engineer, acoustic guitar\n\nDaddy Yankee – songwriting, vocals Justin Bieber remix Credits adapted from Tidal and The Recording Academy.[197] Justin Bieber – songwriting, vocals\n\nJason Boyd – songwriting\n\nJosh Gudwin – producer, recording engineer, remixer, mixing\n\nMarty James – songwriting\n\nChris O'Ryan – recording engineer\n\nJuan Felipe Samper – vocal coach\n\nCharts [ edit ]\n\nWeekly charts [ edit ]\n\nYear-end charts [ edit ]\n\nDecade-end charts [ edit ]\n\nChart (2010–2019) Position Australia (ARIA)[402] 29 Germany (Official German Charts)[403] 2 UK Singles (Official Charts Company)[404] 4 US Billboard Hot 100[89] 9 US Hot Latin Songs (Billboard)[405] 1\n\nAll-time charts [ edit ]\n\nChart Position US Billboard Hot 100[406] 33 US Hot Latin Songs (Billboard)[92] 1\n\nCertifications [ edit ]\n\nSee also [ edit ]\n\nNotes [ edit ]\n\n^ [79][84][85][86] Nielsen SoundScan did not provide data from June 29, 2018 to January 3, 2019. Nielsen SoundScan reported that \"Despacito\" sold 2,692,000 downloads in the tracking period of December 30, 2016 through December 28, 2017, 246,000 downloads in the tracking period of December 29, 2017 through June 28, 2018, and 45,000 downloads in the tracking period of January 4, 2019 through June 20, 2019, adding up a total of 2,983,000 downloads sold.Nielsen SoundScan did not provide data from June 29, 2018 to January 3, 2019. ^ Chart peaks in Australia, Canada, Denmark, Ireland, Japan, Luxembourg, the Netherlands, the Philippines, Scotland, Sweden, the United Kingdom, the US Hot 100, US Digital Songs, US Hot Latin Songs and US Streaming Songs measure combined data between the original and the Justin Bieber remix version. ^ Year-end chart peaks in Australia, Canada, Denmark, the Netherlands, Sweden, the United Kingdom, the US Hot 100, US Digital Songs, US Hot Latin Songs and US Streaming Songs measure combined data between the original and the Justin Bieber remix version.", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Erika_Ender_picby_Raymond_Collazo.jpg/170px-Erika_Ender_picby_Raymond_Collazo.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Wiktionary-logo-en-v2.svg/40px-Wiktionary-logo-en-v2.svg.png", "http://upload.wikimedia.org/wikipedia/commons/3/37/Dagger-14-plain.png", "http://upload.wikimedia.org/wikipedia/en/thumb/c/c8/Luis_Fonsi_Feat._Daddy_Yankee_-_Despacito_%28Official_Single_Cover%29.png/220px-Luis_Fonsi_Feat._Daddy_Yankee_-_Despacito_%28Official_Single_Cover%29.png", "http://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://upload.wikimedia.org/wikipedia/commons/f/f9/Double-dagger-14-plain.png", "http://upload.wikimedia.org/wikipedia/en/thumb/9/97/Luis_Fonsi_Feat._Justin_Bieber_%26_Daddy_Yankee_-_Despacito_Remix_%28Official_Single_Cover%29.png/220px-Luis_Fonsi_Feat._Justin_Bieber_%26_Daddy_Yankee_-_Despacito_Remix_%28Official_Single_Cover%29.png", "http://upload.wikimedia.org/wikipedia/en/thumb/b/b7/Pending-protection-shackle.svg/20px-Pending-protection-shackle.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Zuleyka_Rivera_Mexico_2_%28cropped%29.jpg/170px-Zuleyka_Rivera_Mexico_2_%28cropped%29.jpg", "http://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/c/c8/Luis_Fonsi_Feat._Daddy_Yankee_-_Despacito_%28Official_Single_Cover%29.png", "http://upload.wikimedia.org/wikipedia/en/thumb/9/94/Symbol_support_vote.svg/19px-Symbol_support_vote.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Gnome-mime-audio-openclipart.svg/50px-Gnome-mime-audio-openclipart.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/c/c8/Luis_Fonsi_Feat._Daddy_Yankee_-_Despacito_%28Official_Single_Cover%29.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Despacito", "title": "Despacito", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/c/c8/Luis_Fonsi_Feat._Daddy_Yankee_-_Despacito_%28Official_Single_Cover%29.png", "width": 640, "height": 640}, "title": "Despacito - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}