{"url": "https://en.wikipedia.org/wiki/Jillian_Harris", "text": "Jillian Harris (born December 30, 1979) is a Canadian television personality and interior designer. She is best known for appearing on the television series The Bachelor, The Bachelorette, and Love It or List It Vancouver. She has also appeared on Extreme Makeover: Home Edition,[1] Canada's Handyman Challenge,[1] and The Bachelorette Canada.\n\nCareer [ edit ]\n\nHarris began her interior design career while working at Caban, an interior goods store, which inspired her to begin giving design consultations.[2] She was then hired by Scott Morison, the co-founder of the Canadian restaurant chain Cactus Club Cafe, to design his restaurants.[2] She formalized her interior credentials with a 2006 certificate in interior design from The British Columbia Institute of Technology.[2] She was then re-hired by Morison as the designer for Browns Socialhouse, his new chain of restaurants.[2]\n\nIn early 2009, Harris was a contestant on the thirteenth season of the American TV show The Bachelor, where she competed against 24 other women to win the heart of Jason Mesnick and finished as second-runner-up.[1] In mid 2009, she was selected to be the star of the fifth season of The Bachelorette, making history as the franchise's first Canadian star.[1] She chose Ed Swiderski as the winner of her season, and the two became engaged but later broke up.\n\nIn 2010, she was a designer on Extreme Makeover: Home Edition.[1][3]\n\nIn 2011, she headlined the Calgary Home + Design Show, as part of the HGTV stand.[4] That same year, she hosted season one of the Canadian TV show Canada's Handyman Challenge, which aired in 2012.[1][5][6][7]\n\nSince 2013, Harris has appeared on the Canadian TV series Love It or List It Vancouver, which airs on W Network in Canada and on HGTV in the United States under the title Love It or List It Too.[8] Harris is the show's designer, and competes against real estate agent Todd Talbot by redesigning a family's existing home in hopes that they will decide to stay in the home rather than choose to sell it. As of Spring 2019, the show is in its fifth season.\n\nHarris ran her own brand of interior decor goods, and on 8 July 2013, she launched her e-vintage webstore, Charlie Ford Vintage.[9] Harris closed the business in 2014 [10]\n\nIn 2016, she made a cameo appearance on the first season of The Bachelorette Canada.\n\nIn 2017, Jillian and her boyfriend Justin starred in their own four-episode documentary series, Jillian and Justin, which was aired on W Network in Canada in June.[11] Additionally, she announced on Instagram that she was working on a vegan cookbook.\n\nIn September 2018 Jillian partnered with Canadian based wellness brand Saje Natural Wellness[12] designing a limited edition diffuser for their home collection.\n\nPersonal life [ edit ]\n\nHarris is originally from Peace River, Alberta,[1] but was a longtime Vancouver resident before moving to her current home in Kelowna, British Columbia.[13]\n\nIn 2009, Harris became engaged to Ed Swiderski, who she chose as the winner of her season of The Bachelorette; they broke up in 2010.\n\nOn March 4, 2016, Harris announced that she was expecting her first child with longtime boyfriend Justin Pasutto.[14]\n\nOn August 5, 2016, she gave birth to her first child, a boy, Leo George.[15]\n\nOn Christmas Day of 2016, Jillian announced her engagement to Justin Pasutto through social media.[16]\n\nOn April 18, 2018, Jillian announced she was expecting her second child with fiance Justin Pasutto.\n\nOn May 23, she posted her Gender Reveal video on YouTube announcing that they will be welcoming a baby girl. In June, Passutto, Harris, and her cousin Tori appeared in the music video for Aaron Pritchett's \"Worth a Shot\".[17]\n\nOn September 28, 2018, she gave birth to her second child, a girl, Annie Marjorie Bea.[18]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Text_document_with_red_question_mark.svg/40px-Text_document_with_red_question_mark.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/6/63/Jillian_Harris.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Jillian_Harris.jpg/220px-Jillian_Harris.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/6/63/Jillian_Harris.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jillian_Harris", "title": "Jillian Harris", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Jillian_Harris.jpg/640px-Jillian_Harris.jpg", "width": 640, "height": 845}, "title": "Jillian Harris - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}