{"url": "https://en.wikipedia.org/wiki/Judy_Sheindlin", "text": "American lawyer, judge, television personality, television producer, and author\n\nJudith Susan Sheindlin (née Blum; born October 21, 1942),[1] known professionally as Judge Judy, is an American court show arbitrator, media personality, television producer, author, women's advancement philanthropist and former prosecutor and Manhattan family court judge.\n\nFor 25 seasons from September 16, 1996, to July 23, 2021, Sheindlin presided over her own top Nielsen-rated court show, Judge Judy, for which she is best known.[1][2] Through starring on Judge Judy, Sheindlin became the longest-serving television arbitrator in courtroom-themed programming history, a distinction that earned her a place in the Guinness World Records in 2015.[3] She has additionally received a Lifetime Achievement Emmy in 2019 for her work.\n\nOn November 1, 2021, Sheindlin launched a spin-off streaming series on IMDb TV (now known as Amazon Freevee) Judy Justice, another arbitration-based reality court show featuring her handling of legal disputes.[4][5]\n\nEarly life [ edit ]\n\nSheindlin was born Judith Susan Blum in Brooklyn on Long Island to German-Jewish and Russian-Jewish parents.[6][7][1][8] She described her dentist father Murray[9][10] as \"the greatest thing since sliced bread\" and her mother as \"a meat and potatoes kind of gal.\"[11]\n\nSheindlin graduated from James Madison High School in Brooklyn and American University in Washington, D.C., where she graduated with a Bachelor of Arts degree, majoring in government. She finished her law school education at New York Law School, where she earned her Juris Doctor degree in 1965.[12]\n\nLegal career [ edit ]\n\nSheindlin passed the New York state bar examination in 1965, the same year as her graduation, and was hired as a corporate lawyer for a cosmetics firm. Within two years, she became dissatisfied with her job and left to raise her children Jamie and Adam. In 1972, she became a prosecutor in the New York family court system after hearing about the job from a friend. In her role as a lawyer, Sheindlin prosecuted child abuse cases, domestic violence and juvenile crime.[1]\n\nBy 1982, Sheindlin's \"no-nonsense\" attitude inspired New York mayor Ed Koch to appoint her as a criminal court judge. Four years later, she was promoted to supervising judge in the family court's Manhattan division.[1] She earned a reputation as a \"tough\" judge (though she has disagreed with the labels \"tough\" and \"harsh\").[13]\n\nEntertainment career [ edit ]\n\nIn February 1993, Sheindlin's reputation made her the subject of a Los Angeles Times article, written by Josh Getlin (inspired by his wife Heidi, both of whom Sheindlin credits with her rise to fame)[14] profiling her as a woman determined to make the court system work for the common good. She subsequently was featured in a segment on CBS's 60 Minutes that brought her national recognition. This led to her first book, Don't Pee on My Leg and Tell Me It's Raining, published in 1996. She retired as a family court judge that same year after having heard more than 20,000 cases.[1]\n\nJudge Judy [ edit ]\n\nJudge Judy stands next to a portrait of herself (2005)\n\nA little over a year after the 60 Minutes special, Sheindlin accepted an offer made to her in 1995 to star in a new reality courtroom series, featuring \"real cases with real rulings.\" Her syndicated court show, Judge Judy, debuted on September 16, 1996, and ran for 25 seasons until July 23, 2021, making her the longest serving television court show arbitrator.[15] The program was hosted by Sheindlin, accompanied by her bailiff, Petri Hawkins-Byrd, referred to on the program simply as Byrd or Officer Byrd. Byrd stood by Sheindlin for all of the show's 25 years, thus making him the longest serving bailiff in courtroom programming history alongside her as the longest serving arbitrator in courtroom programming history.[16] His work relationship with Sheindlin predates the program as he was her bailiff in the Manhattan family court system.[17]\n\nThrough its 25-season run, Judge Judy remained the number 1 Nielsen-rated show among all court show programming and regularly drew approximately 9 to 10 million viewers daily.[18] At various points throughout its run, viewership for Judge Judy surpassed frequent daytime ratings leader, The Oprah Winfrey Show.[19] From 2009 to its close in 2021, Judge Judy was the highest rated show in all of daytime television programming and first-run syndication.[20] During the show's active run, Author Brendan I. Koerner commented on the popularity of Judge Judy:\n\nCourt-show viewers don't seem to want moral conundrums or technical wrinkles. They love Sheindlin's show because she offers them a fantasy of how they'd like the justice system to operate—swiftly, and without procedural mishaps or uppity lawyers. They get to see wrongdoers publicly humiliated by a strong authority figure. There is no uncertainty after Sheindlin renders her verdict and bounds off the bench, and there certainly are no lengthy appeals.[21]\n\nA 2013 Reader's Digest poll revealed that Americans trusted Judge Judy more than all nine justices of the United States Supreme Court.[22]\n\nIn 2003, VH1 named Sheindlin one of the \"200 Greatest Pop Culture Icons.\"[23] References to Sheindlin have appeared in many television programs, including Jimmy Kimmel Live!;[22] The Simpsons; Will & Grace; America's Next Top Model; The Weakest Link; The Practice; the Academy Awards;\"Betty White's 2nd Annual 90th Birthday\" celebration;[24] RuPaul's Drag Race, Saturday Night Live and The Amanda Show.\n\nThe Judge Judy courtroom series earned Sheindlin numerous awards and honors, including a star on the Hollywood Walk of Fame in February 2006;[25] induction into Broadcasting & Cable's Hall of Fame in October 2012;[26][27] an award from the vice presidency of the UCD Law Society in April 2013;[28] the Gracie Allen Tribute Award from the Alliance for Women in Media;[23] and the Mary Pickford Award by the Hollywood Chamber Community Foundation at the 2014 Heroes of Hollywood.[29]\n\nOn June 14, 2013, Judge Judy won its first Daytime Emmy Award, having received its 15th nomination. The program won again in 2016 and 2017.[30] In an interview with Entertainment Tonight (ET) on May 3, 2013, Sheindlin was asked about her failure to win after 14 nominations and said:\n\nI don't know. You know, somehow it would sort of break the spell. The show has been such a tremendous success that I'm almost afraid to think about winning—because so many of those shows that did win are no longer with us. So I say to myself 'you want the Emmy or you want a job? (laughing) Which one do you want?'[31]\n\nSheindlin's status as longest-serving judge or arbiter in courtroom-themed programming history and having the longest-running program of the continuous series run court shows rewarded her a place in the Guinness World Records on September 14, 2015.[32]\n\nSheindlin has drawn considerable attention and made significant headlines over her substantial salary from the program. In early 2005, Sheindlin's salary was reportedly US$25 million per year.[21] Her net worth at the beginning of 2007 was $95 million, and she ranked #13 on the Forbes top 20 richest women in entertainment.[33] In January 2008 when Sheindlin's contract was renewed, her salary increased to $45 million per year.\n\nSheindlin briefly considered retirement in early 2010. Her contract at the time was set to end after the 2013/14 television season.[34] She was quoted at the time as stating, \"I think 2013 would be a nice time. It's nice to leave on top. I would consider this a great adventure.\"\n\nOn March 30, 2011, Sheindlin was admitted to the hospital after she fainted on the set of her show while handling a case. She was released the next day, and it was later learned that she suffered a mini-stroke.[35]\n\nIn May 2011, Sheindlin's contract was extended through to the 19th season with an annual salary increase by CBS to $47 million.[36][37] Her $47 million annual salary translated into just over $900,000 per workday (she worked 52 days per year taping cases for Judge Judy).[38] According to Forbes, Sheindlin earned $147 million, pretax, in 2017.[39] It was reported by TV Guide Magazine in October 2013 that Sheindlin was the highest-paid TV star.[40] She later stated that her retirement was up to her viewers and said that fans still seemed to be interested.[41] She said, \"I'm not tired. I still feel engaged by what I do, and I still have people who like to watch it.\"[42]\n\nIn August 2017, CBS Television Distribution and Sheindlin signed a contract extension through the 2020-21 television season.[43] She later revealed in a March 2020 appearance on The Ellen DeGeneres Show that the series would conclude by its 25th season anniversary.[44] The final taped case aired on June 8, 2021, while the show's series finale aired on July 23, 2021.[45] Sheindlin voluntarily ended the series in the midst of discontentment with ViacomCBS and lawsuits from Rebel Entertainment, feeling as well that \"25 is a good round number\" to go out on top with.[46]\n\nTo honor the 25th and final season of the series, Josh Getlin (writer of the 1993 Los Angeles Times article that he said Sheindlin credits as catapulting her television show stardom[47]) wrote another news article on Sheindlin. The publication, posted on June 8, 2021 (the same day the final taped case aired), explained the background of the 1993 article and Getlin's relationship with Sheindlin.[47]\n\nJudy Justice [ edit ]\n\nPremiering on November 1, 2021, with production that commenced in July 2021 (shortly after production of Judge Judy ended in April 2021),[4][5] Sheindlin currently presides over another arbitration-based courtroom series, Judy Justice. The court show is a spin-off of Judge Judy. The program airs first-run episodes through streaming service Amazon Freevee (originally under the name IMDb TV during the show's first season), which is owned and distributed by Amazon Studios. It is the first standard court show to air first-run episodes exclusively through streaming.\n\nThe court show has been characterized as a \"more hip\" rendition of Judge Judy, featuring Gen Z input from Sheindlin's young adult granddaughter, frequent use of a stenographer to quote back Sheindlin and the litigants during moments of discrepancy, Sheindlin's donning a conspicuous robe color, a modern version of the courtroom set from Judge Judy, and what has been described as cases that are more riveting because of less time constraints and advanced monetary award limits than her previous program.[48][49]\n\nWhile Sheindlin has promised to use the same adjudicating techniques that she used on Judge Judy, she has lessened her no-nonsense approach, delving deeper into case details, most episodes focusing on a single long case. Her previous program typically hosted two cases per episode and was known for its aggressive pacing.[50]\n\nAfter a pre-series debut trailer released for the program on September 30, 2021, the spin-off drew early criticism from much of Sheindlin's Judge Judy fanbase over the absence of Judge Judy program's Bailiff Byrd;[51][52][53] Kevin Rasco serves as Sheindlin's Judy Justice bailiff. In October 2021, Byrd addressed fans with public statements that he was \"confused\" and \"dismayed\" by Sheindlin's manner of neglecting all communications with him regarding the spin-off. Byrd reported that when he himself reached out to Sheindlin by phone in July 2021 to finally discuss the spin-off, the series just having begun production by that point, he was told by Sheindlin that he would be omitted from the series for monetary reasons. Byrd later reported his dissatisfaction to multiple media venues. In a public statement, Sheindlin replied by praising Byrd as \"terrific,\" but adding that the show needed a new and exciting direction.[54][55][56] Byrd ultimately expressed that he holds no grudges, is grateful to Sheindlin and wished her all the best with Judy Justice.[57][58][59]\n\nOn April 28, 2022, it was announced that Byrd would be returning to his televised bailiff duties for another courtroom series—one created and produced by Sheindlin and her production team, currently in development and set to be streamed on Amazon Freevee as well. Entitled Tribunal, the upcoming court show will be presided over by now former Hot Bench judges, Tanya Acker and Patricia DiMango, along with Sheindlin's son, former district attorney Adam Levy.[60]\n\nBy the conclusion of season 1, it was reported that Judy Justice had set a record for number of streaming hours viewed on Amazon Freevee, and was thus granted a second season, slated to begin in fall 2022.[61]\n\nExternal media appearances and participation [ edit ]\n\nSince the success of Sheindlin's Judge Judy courtroom series, she has been interviewed on many talk and cable news broadcasts over the course of her career. These talk and cable news programs include Entertainment Tonight, The Ellen DeGeneres Show, The Wendy Williams Show,[62] Katie,[63] Larry King Live,[64] The Roseanne Show, The View, Donny & Marie,[65] The Talk,[66] The Tonight Show, Dateline NBC, 20/20, etc.[67] On October 17, 1998, Sheindlin made a surprise guest appearance on Saturday Night Live, comedically interrupting one of Cheri Oteri's regular parodies of her presiding on Judge Judy.[68] That same year, Sheindlin appeared as herself in a cameo scene presiding over her Judge Judy courtroom show in the 1998 American made-for-television crime drama film CHiPs '99.[69] Also resulting from her Judge Judy show stardom, she served as a judge for the 1999 Miss America pageant.[62]\n\nOn February 21, 2000, the Biography program aired a documentary film on Sheindlin, \"Judge Judy: Sitting in Judgment\" (later released on home video). This 60-minute documentary captured Sheindlin's life story and career. The special also featured input from those closest to Sheindlin and those who knew her best.[70][71] On December 23, 2008, Sheindlin was a guest on Shatner's Raw Nerve.[72] A year later in December 2009, Sheindlin again told her story in a two-hour interview for Archive of American Television.[73] She launched a short-lived advice-sharing website,\"whatwouldjudysay.com,\" in May 2012. In a September 17, 2013 interview with Katie Couric for the 92nd Street Y, Sheindlin elaborated on previously undisclosed facts of her life story and long career in the family court.[74][75]\n\nIn 2014, Sheindlin founded her own production company, entitled Queen Bee Productions. Queen Bee Productions is behind the making of the arbitration-based reality courtroom series Hot Bench.[76] Sheindlin originally desired the title of her personal courtroom series to be Hot Bench before producers ultimately settled on Judge Judy.[77][78][79] The show debuted on September 15, 2014. The courtroom series features a panel of three judges debating and deciding on cases brought to their TV courtroom. Stated Sheindlin, \"When my husband Jerry and I were in Ireland recently, we visited the courts and watched a three-judge bench, which I found both fascinating and compelling. I immediately thought what a terrific and unique idea for a television program that brings the court genre to the next level. We have assembled three individuals with extremely varied backgrounds to serve as the judges. They are smart and talented, with terrific instincts and great chemistry, and are sure to create a hot bench.\" The original panel of judges consisted of New York State Supreme Court judge Patricia DiMango and Los Angeles attorneys Tanya Acker and Larry Bakman. Bakman has since been replaced by Michael Corriero. As with Judge Judy, Hot Bench is executive-produced by Randy Douthit and produced by CBS Television Distribution.[80][81]\n\nOn August 31, 2016, it was reported that CBS has a scripted, semi-autobiographical drama series in the works based on the life of Sheindlin. The program title will be Her Honor. The show has been described as following the youngest judge in New York who, while proficient at handling family court cases, has a personal life that needs work. Executive producers of the program include Sheindlin herself, Chernuchin, Arnold Kopelson and Anne Kopelson. Chernuchin was a writer for the legal drama series Law & Order.[82][83][84]\n\nIn 2017, Sheindlin created a game show called IWitness that debuted on July 10 and ran for 6 weeks. The game show puts the contestant's observational skills to the test, requiring them to view video clips and recall what they have witnessed faster than their competitors.[85] On September 17, 2017, Sheindlin appeared on the series premiere of Fox News Channel's Objectified hosted by Harvey Levin. The program's first episode took an inside look at Sheindlin's life.[86]\n\nThe National Enquirer issued a formal apology in the September 2017 edition of their magazine for false statements, defaming Sheindlin as having cheated on her husband and having suffered from Alzheimer's disease along with brain damage. In addition, they apologized to her daughter Nicole Sheindlin for defaming her as having a jail record.[87]\n\nSheindlin and her program appeared on a November 26, 2017, broadcast of Curb Your Enthusiasm, presiding over a sketch comedy court case with Larry David as the plaintiff. The pseudo-Judge Judy case took the appearance of an actual case from Sheindlin's program, taking place from the show's courtroom set with trademarked voice-over briefs, theme music and audience response.[88]\n\nIn 2018 Sheindlin appeared as a guest on Norm Macdonald Has a Show on Netflix.[89]\n\nNon-media projects and community work [ edit ]\n\nSheindlin, along with her stepdaughter Nicole Sheindlin, is the creator, director, and spokesperson for an alliance designed to empower young women, entitled \"Her Honor Mentoring\".[90][91]\n\nIn September 2017, Sheindlin funded a space for public debate at the University of Southern California. The purpose of the forum was for \"free exchange of ideas by well-meaning people.\"[92]\n\nAuthoring and literature projects [ edit ]\n\nPersonal life [ edit ]\n\nIn 1964, Judy married Ronald Levy, who later became a prosecutor in juvenile court. They moved to New York and had two children, Jamie and Adam,[1] and divorced in 1976 after 12 years of marriage.[1]\n\nIn 1977, she married Judge Jerry Sheindlin, who was an arbitrator on The People's Court from 1999 to 2001.[1] They divorced in 1990, partially as a result of the stress and struggles that Judy endured after her father's death that same year.[1] They remarried a year later. She has three stepchildren with Sheindlin: Gregory, Jonathan and Nicole, and 13 grandchildren.[1] Jonathan is a retinal surgeon,[95] and Greg and Nicole are lawyers. Nicole is the co-creator (along with her stepmother) of the Her Honor Mentoring program.\n\nSheindlin owns homes in several states, including Connecticut,[96] New York,[97] Florida,[98] California, and Wyoming.[99] She commuted to Los Angeles every other week for two to four days to tape episodes of Judge Judy.[42][97] In May 2013, she bought a $10.7 million condominium in the Los Angeles suburb of Beverly Hills.[100] In 2018, Judy and her husband announced spending $9 million on the Bird House, a 9,700-square-foot (900 m2) property on 3.67 acres (1.49 ha) in Newport, Rhode Island once owned by Dorrance Hill Hamilton.[101]\n\nSheindlin holds honorary Doctor of Law degrees from Elizabethtown College and the University at Albany, SUNY.[102] In 2013, she was made vice-president of the law society at University College Dublin, Ireland in recognition of her work in family law.[103]\n\nSheindlin is a registered Independent.[104] She is a supporter of same-sex marriage and,[105] although she has said that she is not a supporter of \"big government\", she believes that the issue of same-sex marriage should be handled at the federal level rather than on a state-by-state basis.[106] Sheindlin has stated that she is in favor of increasing requirements for gun ownership.[107] She prefers not to be labelled by political terms, and states that she is not registered with any political party. When asked about the 2012 presidential elections, Sheindlin stated that while she voted for President Barack Obama in 2008 (as well as voting for Ronald Reagan and Bill Clinton, respectively in 1980 and 1984, and 1992 and 1996), she did not care for either of the leading candidates in the 2012 United States presidential election.[108] In October 2019 Sheindlin penned an op-ed endorsing Michael Bloomberg for president, despite the fact that he had not announced a campaign.[109][110] In January 2020 she released an ad supporting him saying, in part, \"I like to say you can judge someone's character by what they've done; Mike Bloomberg has done amazing things, and will be a truly great president\".[110][111] She later campaigned alongside him.[112]\n\nLawsuits [ edit ]\n\nIn March 2013, a lawsuit was filed against Sheindlin by Patrice Jones, the estranged wife of Randy Douthit (executive producer of Sheindlin's Judge Judy and later Judy Justice court shows). Jones alleged Douthit and Sheindlin had conspired to permit Sheindlin to buy Christofle fine china and Marley cutlery owned by Jones. She said Sheindlin had paid Douthit $50,815 for the items without her knowledge to deprive her of her valuables,[113] and she sought $514,421 from Sheindlin. The suit was settled out of court after Sheindlin returned the tableware to Douthit, and Jones agreed to pay him $12,500 and have the tableware returned to her.[114]\n\nOn March 12, 2014, Sheindlin filed a lawsuit against Hartford, Connecticut personal injury lawyer John Haymond and his law firm. In the lawsuit, Sheindlin accused Haymond and his firm of using her television image without consent in advertisements that falsely suggested she endorsed him and his firm. Sheindlin's producer allegedly told the firm that use of her image is not permitted in March 2013, but ads continued to be produced. The lawsuit filed in federal court sought more than $75,000 in damages. Sheindlin said in her statement that any money she wins through the lawsuit will go toward college scholarships through the Her Honor Mentoring program. Sheindlin further stated, \"Mr. Haymond is a lawyer and should know better. The unauthorized use of my name is outrageous and requires legal action.\"[115][116][117] Haymond later filed a countersuit for punitive damages and attorney's fees, alleging defamation of him and his firm by Sheindlin.[118] Haymond insisted that local affiliates asked him to appear in Judge Judy promos to promote Sheindlin for which he obliged.[119][120] On August 8, 2014, it was reported that the case between Sheindlin and Haymond settled out of court in a resolution that favored Sheindlin. Haymond donated money to Sheindlin's charity, Her Honor Mentoring.[121]\n\nReferences [ edit ]\n\nFurther reading [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/21px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/Balance%2C_by_David.svg/21px-Balance%2C_by_David.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/19px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Judge_Judy_Sheindlin_VF_2012_Shankbone.JPG/220px-Judge_Judy_Sheindlin_VF_2012_Shankbone.JPG", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Judge_Judy_Sheindlin_VF_2012_Shankbone.JPG/1200px-Judge_Judy_Sheindlin_VF_2012_Shankbone.JPG", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/21px-Blank_television_set.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Judge_Judy_next_to_painting.jpg/220px-Judge_Judy_next_to_painting.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Judge_Judy_Sheindlin_VF_2012_Shankbone.JPG/1200px-Judge_Judy_Sheindlin_VF_2012_Shankbone.JPG", "keywords": [], "authors": ["Authoring", "Literature Projects"], "canonical_link": "https://en.wikipedia.org/wiki/Judy_Sheindlin", "title": "Judy Sheindlin", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Judge_Judy_Sheindlin_VF_2012_Shankbone.JPG/640px-Judge_Judy_Sheindlin_VF_2012_Shankbone.JPG", "width": 640, "height": 800}, "title": "Judy Sheindlin - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}