{"url": "https://popculture.com/reality-tv/2017/11/03/bethenny-frankel-birthday-puerto-rico-hurricane-marie-relief/", "text": "Bethenny Frankel's hurricane relief mission is far from over. A month after the business mogul and Real Housewives of New York City star traveled to Puerto Rico with four planes packed with supplies for Hurricane Maria relief efforts, she's planning a return trip.\n\nIn fact, Frankel reveals she will spend her 47th birthday on Saturday on her return trip to help with continued hurricane relief.\n\n\"I'm going this weekend for my birthday to Puerto Rico. I don't usually love my birthday. I think it's an interesting way to give back on your birthday and a good way to reflect on my age and where I am,\" she told E! News.\n\nThe Skinnygirl founder said she plans on returning to Puerto Rico \"multiple times\" and will also pay a visit to the U.S. Virgin Islands.\n\nMore: Jennifer Lopez Donating $1 million to Puerto Rico Hurricane Recovery Effort\n\n\"We're sending a lot of relief to the U.S. Virgin Islands, particularly Dominica. They've been destroyed,\" Frankel said. \"Each disaster is its own sort of baby that needs to be nurtured. People forget about one and then move on to the rest so Puerto Rico is definitely a priority but so is the U.S. Virgin Islands.\"\n\nDuring her first charity trip, Frankel's B Strong organization partnered with Delivering GOod, Feeding America and Global Empowerment Mission to raise $25,000 in Costco giftcards, $25,000 cash and 15,000 pounds of food, water and medical supplies for Hurricane Maria victims in Puerto Rico.\n\nFrankel says she and her team have raised somewhere between $5 and $10 million for disaster relief, and she doesn't plan on slowing down anytime soon.\n\n\"I will not finish that charitable job until they're getting their footing,\" she shared with us.\n\nLast week, it was revealed that hundreds of Puerto Ricans have died since the hurricane, but their deaths were all attributed to \"natural causes.\"\n\nSpokesperson for Puerto Rico's Department of Public Safety, Karixia Ortiz Serrano, said that the 911 reported deaths after Hurricane Maria were not related to the hurricane, but BuzzFeed reports that none of the bodies were \"examined by a medical examiner for consideration to be included in the Maria death toll.\"\n\nSerrano stated that the classifications of death by \"natural causes\" were made by reviewing records and not inspection by medical examiners. She went on to share that the Puerto Rican government has \"no official guidelines on what qualifies as a hurricane-related death.\"\n\nWith the official hurricane-related death toll at 51 in Puerto Rico, more than 900 bodies were cremated before medical examiners got a chance to look at them.\n\nPhoto Credit: Instagram / @bethennyfrankel", "images": ["https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200"], "top_img": "https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/reality-tv/news/bethenny-frankel-birthday-puerto-rico-hurricane-marie-relief/", "title": "Bethenny Frankel Will Spend Her Birthday Helping With Hurricane Relief in Puerto Rico", "meta_data": {"description": "Bethenny Frankel's hurricane relief mission is far from over. A month after the business mogul and [...]", "keywords": "hurricane relief,Bethenny Frankel,Hurricane Maria", "news_keywords": "hurricane relief,Bethenny Frankel,Hurricane Maria", "robots": "index, follow, max-image-preview:large", "twitter": {"card": "summary_large_image", "site": "PopCulture", "creator": "PopCulture", "title": "Bethenny Frankel Will Spend Her Birthday Helping With Hurricane Relief in Puerto Rico", "description": "Bethenny Frankel's hurricane relief mission is far from over. A month after the business mogul and [...]", "image": "https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200"}, "og": {"title": "Bethenny Frankel Will Spend Her Birthday Helping With Hurricane Relief in Puerto Rico", "type": "article", "url": "https://popculture.com/reality-tv/news/bethenny-frankel-birthday-puerto-rico-hurricane-marie-relief/", "image": {"identifier": "https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200", "width": 640, "height": 320}, "site_name": "Reality TV", "description": "Bethenny Frankel's hurricane relief mission is far from over. A month after the business mogul and [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#263240", "apple-mobile-web-app-capable": "yes"}, "movies": [], "publish_date": 1509667200.0, "source": "https://popculture.com", "summary": ""}