{"url": "https://www.etonline.com/jersey-shore-cast-ends-years-long-feud-with-angelina-pivarnick-with-apologies-and-alcohol-103360", "text": "After eight long years of feuding, the cast of Jersey Shorehas finally buried the hatchet with Angelina Pivarnick, the infamous cast member who left the show multiple times during the show's first and second seasons.\n\nOn Thursday's new episode of Jersey Shore Family Vacation, Angelina walked back into the lives of her former roomates, looking to make amends.\n\nAngelina notoriously walked off the show midway through the first season before calling it quits for good the next season after getting into a full-on fight with Nicole \"Snooki\" Polizzi, and generally feuding with everyone else.\n\nHowever, being off TV for the better part of a decade has a way of making people want to get back on TV -- or rather, it made Angelina come back looking to extend an olive branch instead of her fist.\n\nThings started off on shaky ground at first when Jenni \"JWoww\" Farley and Snooki returned to the house to find Angelina waiting for them.\n\nJWoww initially rejected the idea entirely and stormed out, while Snooki called out her former castmate for a litany of insults and offenses. However, Angelina surprised her by candidly apologizing for remarks she'd made in the past, including mocking Snooki's lip injections.\n\nJersey Shore: Family Vacation' Cast on Gym, Tan, Laundry and Who's Changed the Most This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Jersey Shore: Family Vacation' Cast on Gym, Tan, Laundry and Who's Changed the Most\n\nAngelina promised that she'd come back to \"redeem\" herself, and to \"show people I'm not this crazy girl.\" Her persistence paid off, and with Ronnie Ortiz-Magro championing her to Snooki, and convincing her to let Angelina party with them.\n\nThe two former enemies managed to quickly move past their drama and began enjoying each other's company, i.e. getting totally wasted and coming home drunk, hanging off one another like life-long pals.\n\nJWoww was understandably furious when she came home to find them acting like besties, but eventually, she came around herself and accepted Angelina into her good graces.\n\nAddressing the house, Angelina admitted that she had said 'f**ked up s**t\" in the past.\n\n\"I was spiteful, I was immature and I shouldn’t have went that way,\" she said. \"I want a clean slate where from this point forward, no problems.\n\nSnooki Explains Why She Fears Her Marriage Is Over on 'Jersey Shore: Family Vacation' (Exclusive) This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page. Snooki Explains Why She Fears Her Marriage Is Over on 'Jersey Shore: Family Vacation' (Exclusive)\n\nWhile the cast all accepted her back and were on board with the decision to put the feud behind them, they also all agreed that Jersey Shore Family Vacation should really be about the core group who all came to Miami together, and that Angelina should head out.\n\nEventually, the task of breaking the news to Angelina fell to JWoww, who told her former nemesis, \"You are a good person, I would like to get to know you more, but I don’t want to get to know you more here.\"\n\nFans will get to see how Angelina reacts to getting ousted when Jersey Shore Family Vacation returns next Thursday at 8 p.m. ET/PT on MTV.\n\nRecently, ET caught up with Vinny Guadagnino who opened up about what it was like having Angelina return to the house. Check out the video below to hear more.\n\n'Jersey Shore': Vinny Guadagnino Says Angelina's Return is a 'Dump On the House' (Exclusive) This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page.\n\nRELATED CONTENT:\n\n'Jersey Shore' Star Vinny Guadagnino Claps Back at Social Media Trolls\n\n'Jersey Shore' Star Ronnie Ortiz-Magro Celebrates Mother's Day With His Ex-Girlfriend and Baby Daughter\n\n'Jersey Shore: Family Vacation' Premiere: The Most Memorable Moments From the Reunion\n\nRelated Gallery", "images": ["https://www.etonline.com/sites/default/files/styles/60x60/public/images/2022-08/GettyImages-1240426139.jpg?h=05c564aa&itok=Dkqb34Us", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2022-10/GettyImages-1243560296.jpg?h=27af8da9&itok=n9B1yPno", "https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2018-05/angelina_pivarnick_gettyimages-961583076_1280.jpg?h=c673cd1c&itok=G_UygwpU", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-05/angelina_pivarnick_gettyimages-961583076_1280.jpg?h=c673cd1c&itok=AolCFhp9", "https://www.etonline.com/sites/default/files/styles/840x470/public/images/2022-09/GettyImages-523219148.jpg?h=d4a2cb2c&itok=hsRekzjJ"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-05/angelina_pivarnick_gettyimages-961583076_1280.jpg?h=c673cd1c&itok=AolCFhp9", "keywords": [], "authors": ["Zach Seemayer"], "canonical_link": "https://www.etonline.com/jersey-shore-cast-ends-years-long-feud-with-angelina-pivarnick-with-apologies-and-alcohol-103360", "title": "'Jersey Shore' Cast Ends Years-Long Feud With Angelina Pivarnick With Apologies and Alcohol", "meta_data": {"article": {"opinion": "false"}, "apple-mobile-web-app-capable": "yes", "robots": "index", "description": "Thursday's 'Jersey Shore Family Vacation' saw Snooki, JWoww and the rest of the crew reconcile with their former cast member.", "keywords": "TV, News, Jersey Shore, Angelina Pivarnick, Jwoww, Snooki", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/jersey-shore-cast-ends-years-long-feud-with-angelina-pivarnick-with-apologies-and-alcohol-103360", "title": "'Jersey Shore' Cast Ends Years-Long Feud With Angelina Pivarnick With Apologies and Alcohol", "description": "Thursday's 'Jersey Shore Family Vacation' saw Snooki, JWoww and the rest of the crew reconcile with their former cast member.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-05/angelina_pivarnick_gettyimages-961583076_1280.jpg?h=c673cd1c&itok=AolCFhp9", "width": 1280, "height": 720}}, "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "twitter": {"card": "summary_large_image", "description": "Thursday's 'Jersey Shore Family Vacation' saw Snooki, JWoww and the rest of the crew reconcile with their former cast member.", "site": {"identifier": "@etnow", "id": 23603092}, "title": "'Jersey Shore' Cast Ends Years-Long Feud With Angelina Pivarnick With Apologies and Alcohol", "creator": "Zach Seemayer‍", "url": "https://www.etonline.com/jersey-shore-cast-ends-years-long-feud-with-angelina-pivarnick-with-apologies-and-alcohol-103360", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-05/angelina_pivarnick_gettyimages-961583076_1280.jpg?h=c673cd1c&itok=AolCFhp9"}, "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}