{"url": "www.hollywoodreporter.com/live-feed/stranger-things-season-2-who-dies-explained-1052798", "text": "[Spoilers: This story contains full spoilers for season two of Netflix’s Stranger Things.]\n\nGoonies never say die … except when they do.\n\nIn the penultimate installment of the second season of Stranger Things, the life-threatening stakes facing the denizens of Hawkins, Indiana, finally make their full impact known, by killing off one of the beloved main characters — a newbie, sure, but beloved all the same: Bob Newby (Sean Astin). Newby is, in fact, the goodhearted and ultimately ill-fated boyfriend of Joyce Byers (Winona Ryder), and was savagely killed by a pack of demodogs in full view of Joyce, Sheriff Hopper (David Harbour) and even the young party of friends once again caught in the thick of battle against the Upside Down.\n\n“That was a tough one,” says Caleb McLaughlin, who plays Lucas Sinclair, on the subject of losing Astin from the show. “He was so desperate to survive. And when Winona [as Joyce] watches it happen and she’s crying? It was a really good scene. I cried.”\n\n“We all loved him,” adds Noah Schnapp, who worked closely with Astin, thanks to Bob’s role as a hopeful father figure to Will. “He was like a kid. He was hilarious. I remember we were all with Winona, protesting to keep him on set and not have him get killed off. He was the best! He did get a really good kill scene, so that’s pretty good. When I was watching it, I liked those scenes where you don’t expect it. When I was watching, as an audience, you really don’t expect it. It comes out of nowhere.”\n\nAccording to creators the Duffer Brothers, it was always part of the plan to kill off Bob, even if some of the circumstances changed along the way — including the fact that Bob wasn’t always the most likable character.\n\n“He wasn’t supposed to be that big of a character, and he was supposed to die a lot earlier,” says Matt Duffer. “Then we found Sean Astin and met him and fell in love with this guy as a person and as an actor. We really started to fall in love with his character.”\n\nAccording to executive producer Shawn Levy, there was initially some reluctance in hiring Astin as Bob, since The Goonies was already such an influence on season two: “When Sean Astin read this role, it was so immediately compelling. He got the part because he’s a rad actor, not because he’s the guy from Goonies. If anything, that gave us pause because we knew people would assume it was due to that linkage, but it’s just because he gave an incredible audition.”\n\nDuring the course of the season, the Duffers started falling for Astin’s performance as the hapless Bob Newby, once the head of the Hawkins Middle School audio/visual club when he was a kid, known by Hopper and others behind his back as “Bob the Brain.” In his scenes with Joyce, Bob was frequently tickled with surprise over ending up with her all these years later, considering the different lives they led when they were kids. That star-crossed backstory only makes it more upsetting when the Radio Shack employee is ripped into by demodogs, defenseless due to having left one of Hopper’s firearms behind elsewhere in Hawkins Lab.\n\n“Bob wasn’t designed to be the likable character who perishes; he was designed to be kind of just an out-of-it dork,” says Matt Duffer, in terms of how Bob was written. “Sean Astin really transformed that role, to the point where we kept kicking his death down the road. We kept pushing it and pushing it until we could push it no further — when we got to episode eight and we realized narratively we still had to do it. It was the hardest scene to write all year, just because it was hard to lose that character and lose Sean. We had such a great time working with him.”\n\nDescribing Bob’s death as season two’s “central heartbreaker,” Levy thinks the fatal moment serves to fuel the stakes heading into the finale: “It’s an example of really what I hope season two succeeds at — a big emotional idea, told in a really ambitious and cinematic way. That’s really what we’re going with always for this series. Both seasons have a slower burn from everyday life and a desire for normalcy devolving into crazy-ass stuff, forcing heroism among our characters. That was the arc of season one and that was the arc of season two. Bob’s death in the last third of season two was always a big pivot point to be our ramp into the finale action.”\n\nIronically enough, Bob dies shortly before justice for Barb (Shannon Purser) is finally achieved, thanks to Nancy (Natalia Dyer) and Jonathan (Charlie Heaton). Can we expect fans to take up arms with “Justice for Bob,” heading into season three? The Duffers aren’t so sure: “I don’t think you can ever re-create whatever happened with Barb.” Newby nation, I believe that’s your cue.\n\nFollow THR.com/StrangerThings for all of our continuing season two coverage.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/10/wv_publicity_pre_launch_a_still_36.000001.jpg?w=928", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/stranger_things_s02_still_4.jpg?w=1296&h=730&crop=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/stranger_things_s02_still_4.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/stranger_things_s02_still_4.jpg?w=1024", "keywords": [], "authors": ["Josh Wigler"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/stranger-things-season-2-who-dies-explained-1052798/", "title": "‘Stranger Things’ Creators Go Inside Season 2’s Heartbreaking Death", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Creators the Duffer Brothers and executive producer Shawn Levy explain the lethal twist toward the end of the Netflix drama's second season.", "news_keywords": "autoplay, stranger things", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Josh Wigler", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1052798, "title": "'Stranger Things' Creators Go Inside Season 2's Heartbreaking Death", "published_at": "2017-10-30 09:00:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/stranger_things_s02_still_4.jpg?w=1024", "comment_count": 0, "tags": "stranger things", "topics": "TV News", "body": "[Spoilers: This story contains full spoilers for season two of Netflix's Stranger Things.]\r\nGoonies never say die ... except when they do.\r\nIn the penultimate installment of the second season of Stranger Things, the life-threatening stakes facing the denizens of Hawkins, Indiana, finally make their full impact known, by killing off one of the beloved main characters — a newbie, sure, but beloved all the same: Bob Newby (Sean Astin). Newby is, in fact, the goodhearted and ultimately ill-fated boyfriend of Joyce Byers (Winona Ryder), and was savagely killed by a pack of demodogs in full view of Joyce, Sheriff Hopper (David Harbour) and even the young party of friends once again caught in the thick of battle against the Upside Down.\r\n\"That was a tough one,\" says Caleb McLaughlin, who plays Lucas Sinclair, on the subject of losing Astin from the show. \"He was so desperate to survive. And when Winona [as Joyce] watches it happen and she's crying? It was a really good scene. I cried.\"\r\n\r\n\"We all loved him,\" adds Noah Schnapp, who worked closely with Astin, thanks to Bob's role as a hopeful father figure to Will. \"He was like a kid. He was hilarious. I remember we were all with Winona, protesting to keep him on set and not have him get killed off. He was the best! He did get a really good kill scene, so that's pretty good. When I was watching it, I liked those scenes where you don't expect it. When I was watching, as an audience, you really don't expect it. It comes out of nowhere.\"\r\nAccording to creators the Duffer Brothers, it was always part of the plan to kill off Bob, even if some of the circumstances changed along the way — including the fact that Bob wasn't always the most likable character.\r\n\"He wasn't supposed to be that big of a character, and he was supposed to die a lot earlier,\" says Matt Duffer. \"Then we found Sean Astin and met him and fell in love with this guy as a person and as an actor. We really started to fall in love with his character.\"\r\n\r\nAccording to executive producer Shawn Levy, there was initially some reluctance in hiring Astin as Bob, since The Goonies was already such an influence on season two: \"When Sean Astin read this role, it was so immediately compelling. He got the part because he's a rad actor, not because he's the guy from Goonies. If anything, that gave us pause because we knew people would assume it was due to that linkage, but it's just because he gave an incredible audition.\"\r\nDuring the course of the season, the Duffers started falling for Astin's performance as the hapless Bob Newby, once the head of the Hawkins Middle School audio/visual club when he was a kid, known by Hopper and others behind his back as \"Bob the Brain.\" In his scenes with Joyce, Bob was frequently tickled with surprise over ending up with her all these years later, considering the different lives they led when they were kids. That star-crossed backstory only makes it more upsetting when the Radio Shack employee is ripped into by demodogs, defenseless due to having left one of Hopper's firearms behind elsewhere in Hawkins Lab.\r\n\r\n\"Bob wasn't designed to be the likable character who perishes; he was designed to be kind of just an out-of-it dork,\" says Matt Duffer, in terms of how Bob was written. \"Sean Astin really transformed that role, to the point where we kept kicking his death down the road. We kept pushing it and pushing it until we could push it no further — when we got to episode eight and we realized narratively we still had to do it. It was the hardest scene to write all year, just because it was hard to lose that character and lose Sean. We had such a great time working with him.\"\r\nDescribing Bob's death as season two's \"central heartbreaker,\" Levy thinks the fatal moment serves to fuel the stakes heading into the finale: \"It's an example of really what I hope season two succeeds at — a big emotional idea, told in a really ambitious and cinematic way. That's really what we're going with always for this series. Both seasons have a slower burn from everyday life and a desire for normalcy devolving into crazy-ass stuff, forcing heroism among our characters. That was the arc of season one and that was the arc of season two. Bob's death in the last third of season two was always a big pivot point to be our ramp into the finale action.\"\r\nIronically enough, Bob dies shortly before justice for Barb (Shannon Purser) is finally achieved, thanks to Nancy (Natalia Dyer) and Jonathan (Charlie Heaton). Can we expect fans to take up arms with \"Justice for Bob,\" heading into season three? The Duffers aren't so sure: \"I don't think you can ever re-create whatever happened with Barb.\" Newby nation, I believe that's your cue.\r\n\r\nFollow THR.com/StrangerThings for all of our continuing season two coverage.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Stranger Things’ Creators Go Inside Season 2’s Heartbreaking Death", "url": "https://www.hollywoodreporter.com/tv/tv-news/stranger-things-season-2-who-dies-explained-1052798/", "description": "Creators the Duffer Brothers and executive producer Shawn Levy explain the lethal twist toward the end of the Netflix drama’s second season.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/stranger_things_s02_still_4.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-10-30T09:00:00+00:00", "modified_time": "2017-10-30T19:37:12+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Stranger Things’ Creators Go Inside Season 2’s Heartbreaking Death", "description": "Creators the Duffer Brothers and executive producer Shawn Levy explain the lethal twist toward the end of the Netflix drama’s second season.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/stranger_things_s02_still_4.jpg?w=1296"}}, "movies": [], "publish_date": 1509354000.0, "source": "http://www.hollywoodreporter.com", "summary": ""}