{"url": "https://www.hollywoodreporter.com/live-feed/sense8-still-canceled-netflix-tells-fans-1012024", "text": "Netflix has more bad news for fans petitioning to bring back Sense8.\n\nAfter canceling the original series last week, many viewers of the sci-fi drama have been up in arms, flooding social media with a #RenewSense8 campaign and petition to bring back the show for a third season. Netflix has heard the call, but the decision remains.\n\n“To our Sense8 family…We’ve seen the petitions. We’ve read the messages. We know you want to #RenewSense8,” said the streamer in a message posted to the show’s official Facebook page. “We wish we could #BringBackSense8 for you. The reason we’ve taken so long to get back to you is because we’ve thought long and hard here at Netflix to try to make it work but unfortunately we can’t.”\n\nThe message was signed with the hashtag #SensatesForever: “Thank you for watching and hope you’ll stay close with your cluster around the world.”\n\nCo-star Brian J. Smith, who had helped to circulate the #RenewSense8 movement when rumors of the cancellation first began to circulate, also posted his own lengthy letter to fans in hopes of further giving them peace about Netflix’s decision.\n\n“Since you’ve been so extraordinarily passionate,” he began, “I feel it’s only fair that you get more than lip service or a silly tweet from me.” The actor, who makes up one of the eight starring “sensates” who are part of the show’s “cluster,” said he was given the same reason for cancellation that viewers were: viewership. “It may not seem fair in the face of such passionate fan backlash, but it always, ALWAYS boils down to numbers.\n\n“As far as I’m aware there is no shady court intrigue that contributed to Netflix’s decision, and I know that a lot of very smart people had to reach a consensus in order to pull the plug on a show that they had already invested an insane amount of capital in, even if that meant the story would never get an ending,” he writes. “I think the saddest part of finishing a show this way is knowing that future audiences will never pick up a story they know has no resolution. It’s seems like such a waste.”\n\nNetflix canceled Sense8 shortly after canceling Baz Luhrmann’s The Get Down — two of its most expensive series. Though the streamer does not reveal ratings information, the Sense8 news came one day after Netflix founder and CEO Reed Hastings said the streamer should be taking more risk with its content and have a higher cancellation rate. He counted the breakout success of 13 Reasons Why as an example.\n\nSense8, hailed for its inclusiveness, was an ambitious offering from creators Lana and Lilly Wachowski and J. Michael Straczynski that came with a big budget, as the series shot around the world. The series filmed in 13 countries during its two-season run to tell the stories of eight global strangers who find themselves to be emotionally and mentally connected. The ensemble cast was made up of Toby Onwumere, Doona Bae, Jamie Clayton, Tina Desai, Tuppence Middleton, Max Riemelt, Miguel Angel Silvestre and Smith.\n\nRead Smith’s full note below:\n\nI just wanted to take a moment to personally thank all of you for the love and support and fight you’ve put up the last week or so. In the wake of such bad news it was heartening to know that what Sense8 stood for meant so much to so many people.\n\nAnd since you’ve been so extraordinarily passionate I feel it’s only fair that you get more than lip service or a silly tweet from me.\n\nGuys, there are no secrets here. I’ve been given the same reason for the cancelation that you have: viewership. As far as I’m aware there is no shady court intrigue that contributed to Netflix’s decision, and I know that a lot of very smart people had to reach a consensus in order to pull the plug on a show that they had already invested an insane amount of capital in, even if that meant the story would never get an ending. I think the saddest part of finishing a show this way is knowing that future audiences will never pick up a story they know has no resolution. It’s seems like such a waste.\n\nHowever –\n\nDo you remember when I tweeted on May 30, in response to a fan’s concern that the show might get canceled, “This might be a good time to start making some noise”? I had a pretty clear idea by that point that Netflix had made their move, and I also knew from previous experience that once a cancellation is announced there is no going back. It is absolutely final, and the fans are left feeling helpless and angry. I stepped out of my lane and preempted the official announcement because you, our cluster, deserved to have your voices heard. And you came roaring back in a way I wasn’t expecting. It was beyond awesome. I guarantee you, you were seen and you were heard.\n\nPlease know that the fight you all put up in trying to save something that you loved will forever be the “final season” of Sense8. YOU have given the show the ending it deserved. Even if that fight didn’t have a happy ending, it meant something. Don’t ever forget that.\n\nOur Netflix producers Peter, Cindy and Tara were fans of the show from day one. They partied with us, encouraged us, supported us unconditionally. I do not envy the position they are in here. Netflix is a relatively young enterprise and these kinds of growing pains suck. But please remember that they made this strange, gorgeous, unconventional show possible in the first place, and the show would have continued if only the viewership justified the expense. It may not seem fair in the face of such passionate fan backlash, but it always, ALWAYS boils down to numbers.\n\nThere is no anger or bitterness in my heart. This boy from Texas got to see the world, got to work with the Wachowskis and that amazing cast and crew, many of whom are lifelong friends; got to meet so many of you. I think you can tell that I’ve grown a lot as an actor between seasons one and two. That’s all I could ever want out of this experience. The rest is gravy.\n\nYou can all rest easy knowing that even though the show won’t continue you’ve made a difference. You put up a good, hell no, a friggen GREAT fight. I will forever consider Sense8 to be a kind of Unfinished Symphony, a reminder to never take the things we love for granted. I’m going to miss the show and I’m going to miss Gorski, but I’m going forward and I’m never going to be the same.\n\nThank you all from the bottom of my heart.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/uploads/2017/05/sense8_s02e08_still.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/05/sense8_s02e08_still.jpg?w=1296&h=730&crop=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/05/sense8_s02e08_still.jpg?w=1024", "keywords": [], "authors": ["Jackie Strause"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/sense8-still-canceled-netflix-tells-fans-1012024/", "title": "Netflix Apologizes to Viewers: ‘Sense8’ Is Still Canceled", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "\"The reason we've taken so long to get back to you is because we've thought long and hard here at Netflix to try to make it work but unfortunately we can't.\"", "news_keywords": "Netflix, Sense8", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Jackie Strause", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1012024, "title": "Netflix Apologizes to Viewers: 'Sense8' Is Still Canceled", "published_at": "2017-06-09 12:57:10", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/05/sense8_s02e08_still.jpg?w=1024", "comment_count": 0, "tags": "Sense8", "topics": "TV News", "body": "Netflix has more bad news for fans petitioning to bring back Sense8.\r\nAfter canceling the original series last week, many viewers of the sci-fi drama have been up in arms, flooding social media with a #RenewSense8 campaign and petition to bring back the show for a third season. Netflix has heard the call, but the decision remains.\r\n\"To our Sense8 family...We’ve seen the petitions. We’ve read the messages. We know you want to #RenewSense8,\" said the streamer in a message posted to the show's official Facebook page. \"We wish we could #BringBackSense8 for you. The reason we've taken so long to get back to you is because we've thought long and hard here at Netflix to try to make it work but unfortunately we can't.\"\r\nThe message was signed with the hashtag #SensatesForever: \"Thank you for watching and hope you'll stay close with your cluster around the world.\"\r\nCo-star Brian J. Smith, who had helped to circulate the #RenewSense8 movement when rumors of the cancellation first began to circulate, also posted his own lengthy letter to fans in hopes of further giving them peace about Netflix's decision. \r\n\r\n\"Since you've been so extraordinarily passionate,\" he began, \"I feel it's only fair that you get more than lip service or a silly tweet from me.\" The actor, who makes up one of the eight starring \"sensates\" who are part of the show's \"cluster,\" said he was given the same reason for cancellation that viewers were: viewership. \"It may not seem fair in the face of such passionate fan backlash, but it always, ALWAYS boils down to numbers.\r\n\"As far as I'm aware there is no shady court intrigue that contributed to Netflix's decision, and I know that a lot of very smart people had to reach a consensus in order to pull the plug on a show that they had already invested an insane amount of capital in, even if that meant the story would never get an ending,\" he writes. \"I think the saddest part of finishing a show this way is knowing that future audiences will never pick up a story they know has no resolution. It's seems like such a waste.\"\r\nNetflix canceled Sense8 shortly after canceling Baz Luhrmann's The Get Down — two of its most expensive series. Though the streamer does not reveal ratings information, the Sense8 news came one day after Netflix founder and CEO Reed Hastings said the streamer should be taking more risk with its content and have a higher cancellation rate. He counted the breakout success of 13 Reasons Why as an example. \r\nSense8, hailed for its inclusiveness, was an ambitious offering from creators Lana and Lilly Wachowski and J. Michael Straczynski that came with a big budget, as the series shot around the world. The series filmed in 13 countries during its two-season run to tell the stories of eight global strangers who find themselves to be emotionally and mentally connected. The ensemble cast was made up of Toby Onwumere, Doona Bae, Jamie Clayton, Tina Desai, Tuppence Middleton, Max Riemelt, Miguel Angel Silvestre and Smith. \r\n\r\nRead Smith's full note below:\r\nI just wanted to take a moment to personally thank all of you for the love and support and fight you've put up the last week or so. In the wake of such bad news it was heartening to know that what Sense8 stood for meant so much to so many people.\r\nAnd since you've been so extraordinarily passionate I feel it's only fair that you get more than lip service or a silly tweet from me. \r\nGuys, there are no secrets here. I've been given the same reason for the cancelation that you have: viewership. As far as I'm aware there is no shady court intrigue that contributed to Netflix's decision, and I know that a lot of very smart people had to reach a consensus in order to pull the plug on a show that they had already invested an insane amount of capital in, even if that meant the story would never get an ending. I think the saddest part of finishing a show this way is knowing that future audiences will never pick up a story they know has no resolution. It's seems like such a waste. \r\nHowever - \r\nDo you remember when I tweeted on May 30, in response to a fan's concern that the show might get canceled, \"This might be a good time to start making some noise\"? I had a pretty clear idea by that point that Netflix had made their move, and I also knew from previous experience that once a cancellation is announced there is no going back. It is absolutely final, and the fans are left feeling helpless and angry. I stepped out of my lane and preempted the official announcement because you, our cluster, deserved to have your voices heard. And you came roaring back in a way I wasn't expecting. It was beyond awesome. I guarantee you, you were seen and you were heard. \r\nPlease know that the fight you all put up in trying to save something that you loved will forever be the \"final season\" of Sense8. YOU have given the show the ending it deserved. Even if that fight didn't have a happy ending, it meant something. Don't ever forget that. \r\nOur Netflix producers Peter, Cindy and Tara were fans of the show from day one. They partied with us, encouraged us, supported us unconditionally. I do not envy the position they are in here. Netflix is a relatively young enterprise and these kinds of growing pains suck. But please remember that they made this strange, gorgeous, unconventional show possible in the first place, and the show would have continued if only the viewership justified the expense. It may not seem fair in the face of such passionate fan backlash, but it always, ALWAYS boils down to numbers. \r\nThere is no anger or bitterness in my heart. This boy from Texas got to see the world, got to work with the Wachowskis and that amazing cast and crew, many of whom are lifelong friends; got to meet so many of you. I think you can tell that I've grown a lot as an actor between seasons one and two. That's all I could ever want out of this experience. The rest is gravy. \r\nYou can all rest easy knowing that even though the show won't continue you've made a difference. You put up a good, hell no, a friggen GREAT fight. I will forever consider Sense8 to be a kind of Unfinished Symphony, a reminder to never take the things we love for granted. I'm going to miss the show and I'm going to miss Gorski, but I'm going forward and I'm never going to be the same. \r\nThank you all from the bottom of my heart.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Netflix Apologizes to Viewers: ‘Sense8’ Is Still Canceled", "url": "https://www.hollywoodreporter.com/tv/tv-news/sense8-still-canceled-netflix-tells-fans-1012024/", "description": "“The reason we’ve taken so long to get back to you is because we’ve thought long and hard here at Netflix to try to make it work but unfortunately we can’t.”", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/05/sense8_s02e08_still.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-06-09T12:57:10+00:00", "modified_time": "2017-06-09T18:20:11+00:00"}, "twitter": {"site": "@thr", "creator": "@jackiedstrause", "card": "summary_large_image", "title": "Netflix Apologizes to Viewers: ‘Sense8’ Is Still Canceled", "description": "“The reason we’ve taken so long to get back to you is because we’ve thought long and hard here at Netflix to try to make it work but unfortunately we can’t.”", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/05/sense8_s02e08_still.jpg?w=1296"}}, "movies": [], "publish_date": 1497013030.0, "source": "https://www.hollywoodreporter.com", "summary": ""}