{"url": "https://www.capitalfm.com/artists/justin-bieber/news/tattoo-guide/", "text": "Justin Bieber Tattoo Guide And Meanings\n\nJustin Bieber has a VERY interesting tattoo collection but what are they all? And what do they ACTUALLY mean? Here's what you need to know.\n\nJustin Bieber is a massive fan of tattoos, with almost every inch of his skin covered in ink and he's still adding to his collection in 2021.\n\nLast year he showed off a large stencil tattoo of a rose running up the side of his neck, completed by iconic celebrity tattooist, Dr Woo.\n\nEver since he was 16, the 'Yummy' singer has been adding more and more art to his body, and it doesn't look like he's going to slow down anytime soon.\n\nKeep up with Hailey Baldwin's husband's tattoo designs - and what they REALLY mean - by checking out our guide to Justin's tattoo collection here:\n\nFACE\n\nThe Eye Cross\n\nIn May 2016 Justin did the unthinkable and ACTUALLY got a tattoo on his beautiful face. The ‘Sorry’ singer has had a small cross done just under his eye, and his tattoo artist has explained the meaning:\n\n“Yes, I did a tattoo. A small cross near the corner of Justin’s eye,” tattoo artist JonBoy revealed to E! news. “It was a representation of his faith in Jesus and his journey with finding purpose in God.”\n\nBODY\n\n'Purpose'\n\nOctober 2015 arrived and just as Justin seemingly confirmed the title of his NEW album... he only went and got it inked on his abdomen just above his belly button! We think 'Purpose' is pretty self-explanatory... Biebs is feeling MOTIVATED.\n\n\n\n\n\nRoman numerals\n\nBack in early 2013 Justin had his mum Pattie Mallette's birth year, 1975, inked onto the left of his collarbone in honour of the lady who raised him. Naww, you mummy's boy, Biebs!\n\nThe crown\n\nIn August 2012 Justin had a small crown symbol inked onto his chest, which fans believe was done in tribute to one of his musical idols - the late, great Michael Jackson.\n\nPicture: Instagram\n\nThe cross\n\nJustin has made no secret of his faith and religion, so it's not surprising a number of his inkings have faith-related messages. And none more so than the Christian cross in the middle of his torso, done back in early 2014.\n\nThe Yeshua\n\nBoth Justin AND his dad have this design, Justin on the side of his abdomen, of the Hebrew lettering for 'Jesus'.\n\nThe seagull\n\nJustin's first EVER tattoo - done way back in March 2010 to mark his sixteenth birthday - was a seagull inspired by the writer Richard Bach and his novel Jonathan Livingston Seagull. This is another tattoo Biebs' daddy also has!\n\n'Forgive'\n\nIn January 2014 Justin opted to get the phrase 'Forgive' tattooed on the right of his waist. And given the hard time the tabloids were giving the Canadian heartthrob during that period, it perhaps stands to reason it was a message to the world.\n\n'The Bear & the Eagle'\n\nIn 2017, Justin Bieber debuted a brand new tattoo duo in a single Instagram story. The Canadian star showed off a bear's face underneath his right shoulder and a HUGE eagle beneath his 'Son Of God' emblazoned abs.\n\n'The Proud Lion'\n\nA post shared by Justin Bieber (@justinbieber) onMar 29, 2017 at 4:38am PDT\n\n\n\n\n\nJust a week or so after unveiling both the eagle and the bear, JB revealed an Ed Sheeran-esque lion emblazoned across the top left of his chest underneath his shoulder.\n\nLuckily the star has been able to incorporate his longstanding king's crown tat within the design too!\n\nThe angels defeating evil\n\nJustin got two angels on either side of his torso with a church-style motif tying it all together. Legendary tattoo artist Bang Bang who did the ink revealed the meaning behind the two celestial figures, \"We added two angels, one on each side. Below each one, they're dominating the evil. Whenever I do an epic piece, there needs to be the positive and negative. There needs to be a balance... visually there needs to be contrast. Below each of the angels, there is a demon that needs to be defeated. The skeleton on one side and the serpent on the other.\n\n\"It's symbolic of Gothic art and the struggle between the light and dark, the good and the evil, Yin and Yang. I wanted to make sure we had contrast in subject matter and imagery. The thing that made the most sense to me was a tattoo describing his spirituality. The animals he has, his spirit animals as well as the angels, his guardians. I was trying to make it super meaningful and not scattered.\"\n\nA post shared by Justin Bieber (@justinbieber) onOct 21, 2017 at 7:37am PDT\n\nThe American Eagle\n\nJustin has a large eagle in the centre of his stomach, which could be a tribute to his life in America (despite being Canadian) as the animal is symbolic for the country. Bang Bang revealed that Justin referred to it as a \"moustache\", explaining, \"He said he has a moustache on his belly, referring to the eagle, and it just needed more around it so it wasn't so isolated and floating in the middle of his stomach. I don't know why he thought it looked like a moustache. Maybe one of his friends told him that.\"\n\n'Son Of God'\n\nJustin makes no secret of his devotion to his Christian faith and this large inking on the centre of his stomach reaffirms his belief.\n\nBACK & NECK\n\n'Patience'\n\nAround April 2014 Justin had the word 'patience' inked onto his back - which some fans thought was a dig at his on-off romance with Selena Gomez. The jury's still out on the true meaning of this design.\n\nPsalm verse\n\n2013 saw Justin take his Christianity-themed tattoos to another level with a large verse design on his back taken from Psalm 119:105, which reads: \"Your word is a lamp for my feet, a light on my path\".\n\nTreble clef\n\nEarly 2014 saw Justin add another music-themed tattoo to his collection with a simple symbol for treble clef inked onto the back of his neck.\n\nRose\n\nBieber added a huge rose inking on the front of his neck, stretching from below his jaw line to his collarbone.\n\nView this post on Instagram @_dr_woo_ thank you for the A post shared by Justin Bieber (@justinbieber) onSep 7, 2020 at 5:41pm PDT\n\nStratford Cullitons\n\nJustin had the symbol for junior ice hockey team the Stratford Cullitons inked as a large tattoo on his back, all in honour of his grandfather - who used to take him to see the team play.\n\nStop it Biebs, you're breaking our hearts!\n\nLEFT ARM\n\nThe eagle\n\nOne of Justin's biggest tattoos is the giant eagle he has inked onto his left shoulder.\n\nThe tiger\n\nAlso on Justin's left arm, the singer had a tiger head tattooed back in spring 2013 - perhaps to represent his wild side, because we all know he has one!\n\nThe eye\n\nThis design is another tribute to his mum Pattie Mallette - and is said to represent her watching over him.\n\n'Believe'\n\nThe word 'believe' joined Justin's ever-growing collection back in 2012 to mark the release of his album of the same name - and for his fans the 'Beliebers'.\n\nThe castle & prince\n\nPerhaps this design represents Justin's chivalry when it comes to the ladies in his life?\n\nKoi carp\n\nApril 2013 saw Justin add a traditional tattoo when he had a koi inked onto his arm - a symbol of good luck in many cultures!\n\nThe owl\n\nThis tattoo was done back in October 2012, and is a symbol of wisdom - as well as a recurring motif in Justin's pictures and his 'Believe' tour.\n\nThe Selena Gomez portrait\n\nThe face visible at the bottom of his arm is a portrait of Selena Gomez which Justin has previously tried to change the face of, but everyone knows is of his ex!\n\nA post by Justin Bieber (@justinbieber) onJun 14, 2017 at 8:15am PD\n\n\n\nRIGHT ARM\n\n'Trust'\n\nAnother spring 2014 addition, the simple word 'Trust' sits in the crook of Justin's right arm.\n\nThe boombox\n\nKeeping up with the music theme, spring 2014 saw Justin add a boombox to his tattoos - not that Justin was around when they were a thing!\n\nThe 'music' symbol\n\nBack in 2012 Justin added the Japanese Kanji character for music to his huge tattoo collection.\n\nThe jester\n\nFans believe Justin's jester image was supposed to be a stab back at the press.\n\nThe Korean mask\n\nJustin's smiling Korean mask symbol was inked onto the singer's sleeve in March last year, and serves as a reference to Justin's strong faith.\n\nThe fish scales\n\nKeeping up with more traditional tattoo imagery - Justin added fish scales to his sleeve, probably a reference to his star sign being a Pisces.\n\nThe ‘G’ letter\n\n2015 was slow on the new tattoo front for Justin, but he did add the letter 'G' to his sleeve in honour of friends Chad and Julia Veach, and their daughter Georgia who suffers from Lissencephaly.\n\n“She is incredible and has the sweetest soul. You guys make me better and I’m blessed to have you in my life,\" Justin posted to reveal the tattoo.\n\nThe compass\n\nThe start of 2014 saw Justin add a LOT of new tattoos to his body - including a compass which is likely to symbolise guidance and keeping your eye on your destination!\n\nThe ghost\n\nIn March 2014, Justin immortalised PROBABLY one of his favourite video games with a cheeky design of the iconic ghost from Super Mario Brothers.\n\nThe 'Banksy'\n\nAnother spring 2014 addition - on the back of his arm Justin paid tribute to the art of graffiti artist Banksy with a depiction of his famous 'Balloon Girl' work of art.\n\nThe eight ball\n\nIn spring 2014 Justin - ever one to follow traditional tattoo styles - had a small eight-ball added to his arm sleeve for good luck.\n\nThe 'chi' symbol\n\nFebruary 2013 saw Justin add a large 'Chi' symbol - which may be yet another reference to the 'Where Are U Now' star's faith.\n\nAngel, rose and clock\n\nJustin filled out the top of his right arm at the start of 2018 with this elaborate design, of an angel holding a clock with a large rose motif underneath.\n\nWowzers A post shared by Justin Bieber (@justinbieber) onJan 6, 2018 at 4:40pm PST\n\nLEGS\n\nJesus Christ\n\nOn Justin's left leg, back in early 2012, the singer had a depiction done of Jesus Christ himself.\n\nThe praying hands\n\nMarch 2012 saw Justin add another religious themed tattoo, this time on his right leg, when he had a large pair of praying hands inked onto the back of his calf.\n\nSo there you have it! Your guide to the ever-growing collection of Justin Bieber's tattoos. Watch this space for an update when he (inevitably) gets a new design done.", "images": ["https://assets.capitalfm.com/2015/30/justin-bieber-tattoos-instagram-1438007957-custom-0.png", "https://assets.capitalfm.com/2013/09/justin-bieber-owl-tattoo-1362483490-custom-0.png", "https://assets.capitalfm.com/2015/30/justin-bieber-tattoos-instagram-1438007972-custom-0.png", "https://www.capitalfm.com/assets_v4r/gusto/img/facebook-share.png", "https://www.capitalfm.com/assets_v4r/dist/gusto/img/app-store-badge.svg", "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAHoAAABBCAYAAAAe5LCKAAAAoklEQVR4Ae3QMQEAAADCoPVPbQZ/iEBhwIABAwYMGDBgwIABAwYMGDBgwIABAwYMGDBgwIABAwYMGDBgwIABAwYMGDBgwIABAwYMGDBgwIABAwYMGDBgwIABAwYMGDBgwIABAwYMGDBgwIABAwYMGDBgwIABAwYMGDBgwIABAwYMGDBgwIABAwYMGDBgwIABAwYMGDBgwIABAwYMGDBgwMA9MHwpAAE4XV0CAAAAAElFTkSuQmCC", "https://imgs.capitalfm.com/images/332325?width=105&crop=1_1&signature=FmZyHRWwbsPUXTJ-insBUAAxJQ8=", "https://www.capitalfm.com/assets_v4r/dist/gusto/img/google-play-badge.svg", "https://imgs.capitalfm.com/images/326290?width=105&crop=1_1&signature=KGv1ZgTE9I1x4pyWaHCZ5UOofQ4=", "https://imgs.capitalfm.com/images/329657?width=105&crop=1_1&signature=2CRTQzhKpevjtjq-U6AOxOxj-HQ=", "https://assets.capitalfm.com/2013/28/justin-bieber-selfie-instagram-1374242152-custom-0.png", "https://assets.capitalfm.com/2014/43/justin-bieber-topless-1414583573-custom-4.jpg", "https://assets.capitalfm.com/2013/35/justin-bieber-topless-instagram-1378311447-custom-0.png", "https://assets.capitalfm.com/2015/30/justin-bieber-tattoos-instagram-1438007901-custom-0.png", "https://assets.capitalfm.com/2018/09/justin-bieber-tattoo-guide-2018-1520597855-list-handheld-0.png", "https://assets.capitalfm.com/2016/19/justin-bieber-new-tattoo-1462784988-custom-0.png", "https://assets.capitalfm.com/2015/30/justin-bieber-tattoos-instagram-1438007942-custom-0.png", "https://assets.capitalfm.com/2013/09/justin-bieber-tattoo-1362483262-custom-0.png", "https://assets.capitalfm.com/2013/01/justin-bieber-revealed-his-new-tattoo-on-twitter-1357555621-custom-1.jpeg", "https://assets.capitalfm.com/2015/40/justin-bieber-new-tattoo-instagram--1444207787-custom-0.png", "https://assets.capitalfm.com/2015/30/justin-bieber-compass-tattoo-instagram-1438009881-custom-0.png", "https://imgs.capitalfm.com/images/332390?width=105&crop=1_1&signature=-nL2qV5fWMQlTgEorjmk_A88xTI=", "https://imgs.capitalfm.com/images/332377?width=105&crop=1_1&signature=IlkpgP2Uqi7qVGTP3JPXUEMKMtg=", "https://www.capitalfm.com/assets_v4r/gusto/img/twitter-share.png", "https://assets.capitalfm.com/2015/30/justin-bieber-tattoos-instagram-1438008036-custom-0.png", "https://assets.capitalfm.com/2013/09/justin-bieber-foot-tattoo-1362483327-custom-0.png", "https://assets.capitalfm.com/2014/14/justin-bieber-topless-instagram-1397121702-custom-0.png", "https://imgs.capitalfm.com/images/332466?width=105&crop=1_1&signature=qnjOPlD5N9ZiQk9K6002bnTdWWo=", "https://assets.capitalfm.com/2013/28/justin-bieber-new-tattoo-instagram-1374153743-custom-0.png", "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAGQAAABkAQMAAABKLAcXAAAABGdBTUEAALGPC/xhBQAAAANQTFRF2NjY5QlMowAAABNJREFUGBljGAWjYBSMglFAVwAABXgAAdxFAhsAAAAASUVORK5CYII=", "https://imgs.capitalfm.com/images/324964?width=105&crop=1_1&signature=74q1_7RbZAR9LQgcHkrfTA7TojE=", "https://imgs.capitalfm.com/images/332220?width=105&crop=1_1&signature=h7XFnpj2NN8YgYcEcaxKH-lwHQU=", "https://imgs.capitalfm.com/images/330898?width=105&crop=1_1&signature=3ByE2SOQWkEIVBBhCH9CmSDRJ8c=", "https://mediaweb.musicradio.com/player/image.aspx?i=///mediaweb.musicradio.com/artwork/ses/1c93e085-bc3f-427f-b0c7-7c8009fc3b9e&h=144", "https://assets.capitalfm.com/2015/24/justin-bieber-selfie-instagram--1434359214-custom-0.png", "https://assets.capitalfm.com/2015/27/justin-bieber-new-tattoo-instagram-1436515091-custom-0.png"], "top_img": "https://assets.capitalfm.com/2018/09/justin-bieber-tattoo-guide-2018-1520597855-list-handheld-0.png", "keywords": [], "authors": ["Tom Ayres"], "canonical_link": "https://www.capitalfm.com/artists/justin-bieber/news/tattoo-guide/", "title": "Justin Bieber Tattoo Guide And Meanings: From New Face Tattoo To THAT Selena Gomez Inking", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "og": {"url": "https://www.capitalfm.com/artists/justin-bieber/news/tattoo-guide/", "site_name": "Capital", "domain": "www.capitalfm.com", "title": "Justin Bieber Tattoo Guide: All The ‘Sorry’ Star’s Designs & What They Mean", "description": "Hailey Baldwin's husband Justin Bieber has a VERY interesting tattoo collection but what are they all? And what do they ACTUALLY mean? Here's what you need to know.", "type": "article", "image": {"identifier": "https://assets.capitalfm.com/2018/09/justin-bieber-tattoo-guide-2018-1520597855-list-handheld-0.png", "width": 640, "height": 360}}, "twitter": {"site": "@CapitalOfficial", "url": "https://www.capitalfm.com/artists/justin-bieber/news/tattoo-guide/", "card": "summary_large_image", "title": "Justin Bieber Tattoo Guide: All The ‘Sorry’ Star’s Designs & What They Mean", "description": "Hailey Baldwin's husband Justin Bieber has a VERY interesting tattoo collection but what are they all? And what do they ACTUALLY mean? Here's what you need to know.", "image": "https://assets.capitalfm.com/2018/09/justin-bieber-tattoo-guide-2018-1520597855-list-handheld-0.png"}, "fb": {"admins": "551351399,1191061720,506268272,629227116,508902591,544850136,669788254,647915822,516067336,621995612,677149409,61310422,638591731,648380633,621995612,531059714,272200002", "app_id": 184899318222048, "page_id": 113220942069573, "pages": 113220942069573}, "apple-itunes-app": "app-id=1142951331", "pubdate": "2021-03-22T17:31:33", "modified": "2021-03-22T17:31:35", "parsely-type": "post", "robots": "max-image-preview:large", "keywords": "justin, bieber, tattoo, guide, meanings, interesting, collection, radio, fm, dab, music, contemporary", "description": "Hailey Baldwin's husband Justin Bieber has a VERY interesting tattoo collection but what are they all? And what do they ACTUALLY mean? Here's what you need to know.", "parsely-link": "https://www.capitalfm.com/artists/justin-bieber/news/tattoo-guide/", "parsely-section": "/artists/justin-bieber/news/", "parsely-author": "Tom Ayres", "parsely-image-url": "https://assets.capitalfm.com/2018/09/justin-bieber-tattoo-guide-2018-1520597855-list-handheld-0.png", "parsely-post-id": 122846, "parsely-pub-date": "2021-03-22T17:31:33", "parsely-title": "Justin Bieber Tattoo Guide: All The ‘Sorry’ Star’s Designs & What They Mean"}, "movies": [], "publish_date": null, "source": "https://www.capitalfm.com", "summary": ""}