{"url": "https://en.wikipedia.org/wiki/Mia_Farrow", "text": "American actress\n\nMaria de Lourdes Villiers \"Mia\" Farrow ( ; born February 9, 1945) is an American actress. She first gained notice for her role as Allison MacKenzie in the television soap opera Peyton Place and gained further recognition for her subsequent short-lived marriage to Frank Sinatra. An early film role, as Rosemary in Roman Polanski's Rosemary's Baby (1968), saw her nominated for a BAFTA Award and a Golden Globe Award for Best Actress. She went on to appear in several films throughout the 1970s, such as Follow Me! (1972), The Great Gatsby (1974), and Death on the Nile (1978). Her younger sister is Prudence Farrow.\n\nFarrow was in a relationship with actor-director Woody Allen from 1980 to 1992 and appeared in thirteen of his fourteen films over that period, beginning with A Midsummer Night's Sex Comedy (1982). She received numerous critical accolades for her performances in several Allen films, including Golden Globe Award nominations for Broadway Danny Rose (1984), The Purple Rose of Cairo (1985), and Alice (1990), and a BAFTA nomination for Hannah and Her Sisters (1986). After separating from Allen in 1992, she made public allegations that he had sexually assaulted their seven-year-old adopted daughter, Dylan. Allen was never charged with a crime and has vigorously denied the allegation. These claims received significant renewed public attention in 2013 after Dylan recounted the alleged assault in an interview that year.\n\nSince the 2000s, Farrow has made occasional appearances on television, including a recurring role on Third Watch (2001–2003). She has also had supporting parts in such films as The Omen (2006), Be Kind Rewind (2008), and Dark Horse (2011). Farrow is also known for her extensive work as a UNICEF Goodwill Ambassador. She is involved in humanitarian activities in Darfur, Chad, and the Central African Republic. In 2008, Time magazine named her one of the most influential people in the world.[1]\n\nEarly life [ edit ]\n\nFarrow (far left) with her family, 1950\n\nMaria de Lourdes Villiers Farrow[2] was born February 9, 1945, in Los Angeles, California, the third child and eldest daughter of Australian film director John Farrow and his second wife, the Irish actress Maureen O'Sullivan.\n\nShe is one of seven children, with older brothers Michael Damien, Patrick[5] younger brother John Charles;[a] and younger sisters Prudence, Stephanie and Tisa. Her godparents were director George Cukor and columnist Louella Parsons.\n\nFarrow was raised in Beverly Hills, California, in a strict Catholic household.[13] She was described by her family as an eccentric and imaginative child, and would occasionally put on performances with \"toy daggers and fake blood\" for passing celebrity tour buses.[15] Aged two, she made her film debut in a short documentary, Unusual Occupations: Film Tot Holiday (1947). Farrow attended Catholic parochial schools in Los Angeles for her primary education.\n\nAt nine years old, she contracted polio during an outbreak in Los Angeles County reportedly affecting 500 people.[17] She was placed in an isolation ward for three weeks[18] and later said the experience \"marked the end of [her] childhood.\"[15]\n\nIn 1958, the Farrow family temporarily relocated to Spain, where her father was filming John Paul Jones (1959). Farrow, then age 13, made a brief uncredited appearance in the film.\n\nIn September 1958, Farrow and her sister Prudence were sent to attend a convent-operated boarding school in Surrey, England[15][19] while her father completed post-production on John Paul Jones in London.\n\nOn October 28, Farrow's eldest brother Michael died in a plane crash near Pacoima, California.[21] After his burial, Farrow returned to boarding school in Surrey. Her family temporarily lived in the London Park Lane Hotel before renting a home in Chelsea. Farrow's father began drinking heavily, which strained the marriage. In her memoir, Farrow recalls witnessing violent arguments between her parents while visiting their Chelsea residence.\n\nWhen Farrow was 16, she returned with her family to the United States and continued her education at an all-girls Catholic preparatory school in Los Angeles, Marymount High School. (She was among its most famous alumna).[25] During this time, her parents were struggling financially, and her mother relocated to New York City to act in Broadway productions. Farrow's father remained in California, where he died the following year of a heart attack, when she was 17 years old.\n\nThe family was left with little money after her father's death, prompting Farrow to begin working to help support herself and her siblings. She initially found work as a fashion model.[28] She began in theatre as a replacement in a New York stage production of The Importance of Being Earnest.\n\nCareer [ edit ]\n\n1963–1969: Beginnings and breakthrough [ edit ]\n\nFarrow photographed in 1965\n\nFarrow screen-tested for the role of Liesl von Trapp in The Sound of Music (1965), but did not get the part.[30] The footage has been preserved, and appears on the fortieth Anniversary Edition DVD of The Sound of Music.[31] She began her acting career in movies by appearing in supporting roles in several 1960s films, making her first credited appearance in Guns at Batasi (1964).\n\nThe same year, she achieved stardom on the successful primetime soap opera Peyton Place, playing naive, waif-like Allison MacKenzie.[32] Farrow left the series in 1966 at the urging of Frank Sinatra, whom she married on July 19, 1966 when she was 21 and he was 50 years old. She subsequently appeared in her first featured role in the British spy film A Dandy in Aspic (1968).\n\nFarrow's first leading film role was in the psychological horror film Rosemary's Baby (1968), which was a critical and commercial success. It is highly regarded as a classic of the horror genre, and named the second-best horror film of all time by The Guardian in 2010.[36] She won numerous awards, including the Golden Globe Award for New Star of the Year – Actress,[37] and became established as a leading actress. Film critic and author Stephen Farber described her performance as having an \"electrifying impact... one of the rare instances of actor and character achieving a miraculous, almost mythical match\". Film critic Roger Ebert called the film \"brilliant,\" and noted, \"A great deal of the credit for this achievement must go to Mia Farrow, as Rosemary.\"[38]\n\nFollowing Rosemary's Baby, Farrow was to be cast as Mattie in True Grit and was keen on the role. But, prior to filming she made Secret Ceremony in England with Elizabeth Taylor and Robert Mitchum. While filming, Mitchum told her that True Grit director Henry Hathaway had a reputation for being rude to actresses. Farrow asked producer Hal Wallis to replace Hathaway. Wallis refused; Farrow quit the role, which was then given to Kim Darby.[39]\n\nSecret Ceremony divided critics, but has developed a devoted following. Farrow's other late 1960s films include John and Mary (1969) opposite Dustin Hoffman.[40] She earned a Golden Globe nomination for Best Actress in a Comedy or Musical.[37]\n\n1970–1979: Theater work and mainstream success [ edit ]\n\nBeginning in the early 1970s, Farrow appeared onstage in numerous classical plays in London, beginning with the Royal Shakespeare Company's 1971 production of Jeanne d'Arc au bûcher—in which she portrayed Joan of Arc—at the Royal Albert Hall.[failed verification][41] Farrow made history as the first American actress to join the Royal Shakespeare Company.[unreliable source?] The same year, she appeared in the British horror film See No Evil, portraying a blind woman whose family is stalked by a killer.[42] Though he gave the film a mixed review, Roger Greenspun of The New York Times wrote that Farrow \"plays her blind patrician with exactly the right small depth of pathos and vulnerable nobility.\"[42] Farrow also starred in the television film Goodbye, Raggedy Ann (1971), playing an unstable Hollywood starlet.[43] In 1972, Farrow starred in the French black comedy film Dr. Popaul, opposite Jean-Paul Belmondo, as a secretary who marries a womanizer, and in Carol Reed's Follow Me! as a woman suspected of having an affair by her wealthy husband. Onstage, she starred as the lead in a 1972 stage production of Mary Rose,[46] followed by the role of Irina in The Three Sisters,[47] and a dual role in The House of Bernarda Alba (both 1973).[48]\n\nFarrow was cast as Daisy Buchanan in the 1974 Paramount Pictures film adaptation of The Great Gatsby, directed by Jack Clayton.[49] The film was a commercial success, grossing over $25 million in the United States,[50] while Variety deemed it \"the most concerted attempt to probe the peculiar ethos of the Beautiful People of the 1920s.\"[49] In 1975, Farrow was cast as the lead in a stage production of The Marrying of Ann Leete, followed by The Zykovs (1976), both of which were staged at the Aldwych Theatre.[51][52] She again appeared at the Aldwych in the 1976 production of Ivanov, portraying Sasha.[53] She also appeared onscreen, portraying Peter Pan in the television musical film Peter Pan (1976), and as a woman haunted by the ghost of a deceased girl in the horror film Full Circle (1977).\n\nFarrow had a supporting role in Robert Altman's comedy A Wedding (1978), playing the mute daughter of a trucking company tycoon. The same year, she starred with Rock Hudson in the disaster film Avalanche, followed by the British Agatha Christie adaptation Death on the Nile. In 1979, Farrow appeared on Broadway opposite Anthony Perkins in the play Romantic Comedy by Bernard Slade,[57] and in the romance film Hurricane, opposite Jason Robards.\n\n1980–1992: Collaborations with Woody Allen [ edit ]\n\nFarrow in 1980\n\nBeginning in the 1980s, Farrow had a decade-long relationship with director Woody Allen; they collaborated on numerous of his films. Her first film with Allen was the comedy A Midsummer Night's Sex Comedy (1982), in a role originally intended for Diane Keaton. She next appeared in Allen's Zelig (1983), portraying a psychiatrist whose patient, Leonard Zelig (Allen), takes on characteristics of those around him in an effort to be liked.\n\nIn Broadway Danny Rose (1984), Farrow starred as the mistress of a washed-up lounge musician who becomes involved with the mob. Both her character, and the film, were inspired by woman she and Allen had frequently encountered while dining at Rao's, an Italian restaurant in East Harlem. Farrow gained weight for the role and adopted a thick Italian-American accent; Allen biographer John Bailey described her as \"unrecognizable\" in the role. Farrow gained critical notice for this role, and she was nominated for a Golden Globe Award for Best Actress in a Comedy or Musical.[37] Allen subsequently reflected that her performance was a \"very, very brave thing for her to do,\" as the majority of her scenes required her to wear sunglasses that block view of her eyes. Farrow also voiced the title role in the animated film The Last Unicorn (1982).\n\nAfter Broadway Danny Rose, Farrow had a supporting role in Jeannot Szwarc's superhero film Supergirl (1984), playing Alura In-Ze, the mother of Supergirl. The film was considered a box office bomb, earning $13 million against its $35 million budget.[65][66]\n\nFarrow reunited with Allen for his The Purple Rose of Cairo (1985), which follows a film character (portrayed by Jeff Daniels) who emerges from the screen and enters the real world. He falls in love with a waitress (Farrow). Farrow earned a BAFTA nomination for Best Actress[68] and a Golden Globe nomination for Best Actress in a Comedy or Musical.[37] Allen next cast Farrow as the lead in his drama Hannah and Her Sisters (1986), which follows a New York City family over a period of two years between two Thanksgivings. In the film, Farrow starred as the titular Hannah opposite Barbara Hershey and Dianne Wiest (who portray her sisters), and Michael Caine as her husband. Released in the fall of 1986, Hannah and Her Sisters was a box-office hit, grossing $35 million in the United States during its original theatrical release.[70] The film was praised by critic Roger Ebert, who felt it was Allen's best work to date. Farrow earned her third BAFTA nomination, again in the category of Best Leading Actress.[72]\n\nIn 1987, Farrow appeared in two films directed by Allen: the comedy Radio Days, in which she had a supporting role as an aspiring radio star; and the drama September, in which she played a woman haunted by her killing of her mother's abusive lover. Farrow shot the latter film twice, originally with her own mother Maureen O'Sullivan playing her character's mother in the film. Displeased with the final cut, Allen decided to recast several roles and reshoot the film entirely. The second and final version featured Elaine Stritch as Farrow's mother in the film.\n\nFarrow was subsequently cast opposite Gena Rowlands in Allen's drama Another Woman (1988), which follows a philosophy professor (Rowlands) who becomes acquainted with a troubled woman undergoing an existential crisis (Farrow). While the film earned praise from critics such as Roger Ebert,[77] its screenplay and dialogue were criticized by Vincent Canby in The New York Times. He described it as \"full of an earnest teen-age writer's superfluous words.\"[78] In 1989, Farrow starred in a segment of Allen's anthology film New York Stories, playing the shiksa fiancée of a Jewish man (Allen). She appeared in a supporting role in his film Crimes and Misdemeanors (1989), portraying a producer who falls in love with a documentary filmmaker.\n\nShe was next cast by Allen in his fantasy film Alice (1990), marking the couple's 11th collaboration.[80] In Alice, Farrow portrays the title character, an upper-class Manhattan woman who becomes enamored with a jazz musician. Her attraction results in feelings of Catholic guilt that manifest as physical ailments which she attempts to treat with herbal medicine. Vincent Canby praised her portrayal as career-defining, writing: \"Miss Farrow gives a performance that sums up and then tops all of the performances that have preceded it.\"[80] She was nominated for a Golden Globe for Best Actress in a Comedy or Musical,[37] and won a National Board of Review award for Best Actress.[82] The next year, Farrow appeared as a circus performer in Allen's black-and-white comedy Shadows and Fog.\n\nFarrow had a lead role in Allen's drama Husbands and Wives (1992), in which she portrayed the wife of a writer and professor (Allen) having an affair with one of his students. Husbands and Wives marked Farrow's final collaboration with Allen. It was released shortly after the couple's highly publicized separation. Todd McCarthy of Variety noted in his review of the film that much of its audience would watch it \"for the titillation of seeing Allen make out with a 21-year-old and go through a wrenching split from Farrow onscreen. Even those who enter in this frame of mind, however, probably will put these thoughts aside for the most part as they become involved in the romantic longings and verbal crossfire of a host of interesting, difficult, intersecting characters.\"[85]\n\n1993–1999: Film and television; return to stage [ edit ]\n\nCiting the need to devote herself to raising her young children, Farrow worked less frequently during the 1990s. But she appeared in leading roles in several films, including the Irish film Widows' Peak (1994), in which she starred as \"Miss O'Hare\", the mysterious victim of a vengeful, matriarchal figure in a small Irish village.[86] She also appeared in the comedy Miami Rhapsody (1995), playing the mother of a single woman in her thirties (played by Sarah Jessica Parker).[87]\n\nThat year Farrow also had a lead role in the film adaptation of Craig Lucas's Off-Broadway play Reckless (1995), a dark comedy in which she portrayed a woman whose husband arranges a contract killing against her.[88] Critic Stephen Holden praised her performance, writing: \"Ms. Farrow is so perfectly cast as Rachel that the character seems a distillation of nearly every role she has played since she was a teen-ager in Peyton Place.\"[88] In the spring of 1996, Farrow had an uncredited voice role in the Broadway play Getting Away with Murder, appearing in a pre-recorded voice message.[89]\n\nIn 1997, Farrow published her autobiography, What Falls Away.[90] She had a cameo appearance as herself in Howard Stern's biographical comedy, Private Parts.[91] She appeared on television in the 1998 The Wonderful World of Disney segment Miracle at Midnight, a dramatization of the Rescue of the Danish Jews during the Holocaust.[92] Will Joyner of The New York Times credited Farrow's performance in the segment as \"crucial to the production's success.\"[92] Farrow was next cast as a woman suffering Alzheimer's disease in the television film Forget Me Never.[93] Critic Steven Linan of the Los Angeles Times praised Farrow, writing that she \"convincingly conveys the fear and insecurity that accompany such a downward spiral.\"[93] Her portrayal earned her her seventh Golden Globe nomination for Best Actress, in the category of Miniseries or Television Film.[37] Also in 1999, Farrow appeared in the comedy Coming Soon, playing the hippie mother of a high school student.[94]\n\nIn November 1999, Farrow returned to Broadway portraying Honey in a staged reading of Who's Afraid of Virginia Woolf?, opposite Matthew Broderick, Jonathan Pryce, and Uta Hagen.[95] Vincent Canby praised the production in The New York Times, writing that \"as performed by Mr. Broderick and Ms. Farrow, Nick and Honey took on dimensions I have never seen before.\"[95] The reading was subsequently staged in Los Angeles in the spring of 2000.[96]\n\n2000–present: Later film, television, and theater [ edit ]\n\nDuring the 2000s, Farrow appeared on television. She began with a recurring role on the series Third Watch, in which she guest-starred in five episodes between 2000 and 2003.[97] Farrow also appeared in the 2001 LGBT-themed television film A Girl Thing, opposite Kate Capshaw and Stockard Channing,[98] followed by a lead in the Lifetime film The Secret Life of Zoey in 2002.[99]\n\nShe also appeared in a touring stage production of The Exonerated the same year,[100] followed by the lead in Fran's Bed, staged at Connecticut's Long Wharf Theatre in the fall of 2003.[101] She subsequently had a supporting part in the children's television film Samantha: An American Girl Holiday (2004).[102]\n\nFarrow made her first feature film appearance in several years as Mrs. Baylock, a Satanic nanny, in the remake of The Omen (2006). Although the film received a lukewarm critical reception, Farrow's performance was widely praised. The Associated Press declared \"thank heaven for Mia Farrow\" and said her performance was \"a rare instance of the new Omen improving on the old one.\"[103] The Seattle Post-Intelligencer also praised her performance, describing it as \"a truly delicious comeback role... Farrow [is] chillingly believable as a sweet-talking nanny from hell.\"[104]\n\nFarrow subsequently appeared as the mother of a Manhattan attorney (played by Amanda Peet) in the romantic comedy The Ex (2007), also starring opposite Jason Bateman and Zach Braff.[105] The film was poorly received by critics, with several writing that the cast's talents were underserved by the material.[106][107] Farrow next voiced Daisy Suchot in Luc Besson's animated fantasy film Arthur and the Invisibles (2007).[108]\n\nThe following year, Farrow appeared in a supporting role opposite Danny Glover in Michel Gondry's comedy Be Kind Rewind (2008), playing the friend and patron of a video store operator in suburban New Jersey.[109] She also provided voice narration for the documentary film As We Forgive (2008), which recounts the stories of two Rwandan women who confronted the individuals who murdered their families during the Rwandan genocide.[110] In 2009, Farrow reprised her voice role as Daisy Suchot in Arthur and the Revenge of Maltazard,[111] and again for Arthur 3: The War of the Two Worlds (2010).[112] She was subsequently cast in a supporting role in the comedy-drama Dark Horse, directed by Todd Solondz,[113] in which she played the mother of a stunted 35-year-old man.[114]\n\nIn September 2014, Farrow returned to Broadway in the play Love Letters. The play was well received by critics,[115] with Charles Isherwood of The New York Times deeming Farrow's performance \"utterly extraordinary… as the flighty, unstable and writing-averse Melissa Gardner.\"[116] In 2016, Farrow appeared with Faye Dunaway in an episode of the IFC mockumentary series Documentary Now!.[117]\n\nFilmography [ edit ]\n\nSelected credits:\n\nAwards and nominations [ edit ]\n\nHumanitarian activities [ edit ]\n\nFarrow became a UNICEF Goodwill Ambassador in 2000 and is a high-profile advocate for human rights in Africa, particularly for children's rights. She has worked to raise funds and awareness for children in conflict-affected regions and to draw attention to the fight to eradicate polio. Farrow has received several awards for her humanitarian work[118][119] including the Leon Sullivan International Service award,[120] the Lyndon Baines Johnson Moral Courage Award[121] and the Marion Anderson Award.[122] In 2006, Farrow and her son Ronan visited Berlin in order to participate in a charity auction of United Buddy Bears, which feature designs by artists representing 142 U.N. member states.[123] In 2008, Time magazine named her one of the most influential people in the world.[125]\n\nShe has traveled to Darfur several times for humanitarian efforts, first in 2004.[126] Her third trip was in 2007, with a film crew engaged in making the documentary Darfur: On Our Watch.[127] The same year, she co-founded the Olympic Dream for Darfur campaign, which drew attention to China's support for the government of Sudan. The campaign hoped to change China's policy by embarrassing it in the run-up to the 2008 Summer Olympics held in Beijing. In March 2007, China said it would urge Sudan to engage with the international community. The campaign persuaded Steven Spielberg to withdraw as an artistic adviser to the opening ceremony. During the Olympics, Farrow televised via the internet from a Sudanese refugee camp to highlight China's involvement in the region.[128]\n\nLater in 2007, Farrow offered to \"trade her freedom\" for the freedom of a humanitarian worker for the Sudan Liberation Army who was being treated in a UN hospital while under threat of arrest. She wanted to be taken captive in exchange for his being allowed to leave the country.[129] Farrow is also a board member of the Washington, D.C. based non-profit Darfur Women Action Group (DWAG).[130]\n\nIn 2009, Farrow narrated a documentary, As We Forgive, relating the struggle of many of the survivors of the Rwandan genocide to forgive those who murdered family and friends. To show \"solidarity with the people of Darfur\" Farrow began a water-only fast on April 27, 2009.[132] Farrow's goal was to fast for three weeks, but she called a halt after twelve days on the advice of her doctor.[133] In August 2010, she testified in the trial against former Liberian President Charles Taylor in the Special Court for Sierra Leone.[134]\n\nFarrow helped build The Darfur Archives, which document the cultural traditions of the tribes of Darfur.[135] She has filmed some 40 hours of songs, dances, children's stories, farming methods and accounts of genocide in the region's refugee camps that make up the current archives.[136] Since 2011, the Archives have been housed at the Thomas J. Dodd Research Center at the University of Connecticut.[137] In 2013, Farrow criticized President Barack Obama for his lack of address regarding Sudanese genocide during a United Nations General Assembly.[136] In February 2015, Farrow appeared in an episode of A Path Appears, a PBS documentary series from the creators of the Half the Sky movement. In the episode Farrow travels to Kibera, Kenya's largest slum, to share stories from organizations providing education to at-risk girls.[138][139]\n\nFarrow has also participated in environmental activism, in 2014 protesting against Chevron, accusing the oil company of environmental damage in the South American rainforest.[140]\n\nPersonal life [ edit ]\n\nReligious and political beliefs [ edit ]\n\nThough she has been critical of the Catholic Church (in particular, Farrow took issue with the Pope for his failure to intervene in the genocide in Rwanda), Farrow is a devout Catholic (by 2018 Elle magazine was saying that Mia Farrow \"attends an Episcopal church\")[19] and maintained in a 2013 interview with Piers Morgan that she had not \"lost her faith in God\".[141] In 1968, when she was 23 years old, Farrow spent part of the year living at the ashram of Maharishi Mahesh Yogi in Rishikesh, Uttarakhand, India, studying Transcendental Meditation. Her visit received worldwide media attention at the time because of the presence of all four members of the Beatles, Donovan, Mike Love, and her sister, Prudence Farrow. The behavior of her sister Prudence during this trip inspired John Lennon to write the song \"Dear Prudence\".[145]\n\nFarrow has stated that she has long been a registered Independent, though she has consistently voted for Democratic candidates.[146] In the 2016 Democratic presidential election, Farrow publicly endorsed Democratic Party candidate Bernie Sanders,[147][148] though she subsequently stated that \"as a pragmatist\" she planned to vote for Hillary Clinton.[146] Farrow tweeted in support of Joe Biden during the 2020 Democratic Party presidential primaries, but later added that she would vote for Sanders if he was nominated.[149]\n\nRelationships [ edit ]\n\nFrank Sinatra [ edit ]\n\nOn July 19, 1966,[150] she married singer Frank Sinatra at the Las Vegas home of Jack Entratter.[152] Farrow was 21 years old; Sinatra was 50.[32] Sinatra wanted Farrow to give up her acting career, which she initially agreed to do. She accompanied Sinatra while he was shooting several films, but soon grew tired of doing nothing and signed on to star in Roman Polanski's horror film Rosemary's Baby. Filming of Rosemary's Baby ran over its initial schedule, which angered Sinatra, who had cast Farrow in a role in his film The Detective (1968). After Farrow failed to report for filming, Sinatra cast actress Jacqueline Bisset in Farrow's role. In November 1967, while Farrow was filming Rosemary's Baby, Sinatra's lawyer served her with divorce papers. Their divorce was finalized in August 1968.[155] Farrow later blamed the demise of the marriage on their age difference and said she was an \"impossibly immature teenager\" when she married Sinatra. The two remained friends until Sinatra's death.\n\nAndré Previn [ edit ]\n\nOn September 10, 1970, Farrow married conductor and composer André Previn in London. She was 25, and he was 41.[158] Farrow had begun a relationship with Previn while he was still married to his second wife, songwriter Dory Previn. When Farrow became pregnant, Previn left Dory and filed for divorce. Farrow gave birth to twin sons in February 1970,[158] and Previn's divorce from Dory became final in July 1970.[159] Dory Previn later wrote a scathing song, titled \"Beware of Young Girls\", about the loss of her husband to Farrow.[160] Previn and Farrow divorced in 1979.[30]\n\nWoody Allen [ edit ]\n\nIn 1980, Farrow began a relationship with film director Woody Allen.[161][162] During their relationship, Farrow starred in thirteen of Allen's films including, A Midsummer Night's Sex Comedy (1982), Zelig (1983), Broadway Danny Rose (1984), The Purple Rose of Cairo (1985), Hannah and Her Sisters (1986), Radio Days (1987), September (1987), Another Woman (1988), Crimes and Misdemeanors (1989), Alice (1990), Shadows and Fog (1991), and her final film with Allen, Husbands and Wives (1992). Several of her relatives made appearances in Allen's films including her mother, Maureen O'Sullivan in Hannah and Her Sisters.[162] Their relationship ended in 1992 when Allen's intimate relationship with Soon-Yi Previn (Farrow's adopted daughter, who was 21 years old at the time) was publicized.[163]\n\nAbuse allegation against Allen [ edit ]\n\nAccording to court testimony, on August 4, 1992, Allen visited Farrow's farm in Bridgewater, Connecticut, while she was out shopping.[163] The following day, August 5, a babysitter informed Farrow that she had witnessed Allen behaving strangely with the couple's then-seven-year-old adopted daughter, Dylan.[163] When Farrow asked Dylan about the alleged incident, Dylan responded that Allen had touched her \"private part\" while the two were alone in the attic of the home.[163] One of the women employed to care for Farrow's children claimed that for around 20 minutes that afternoon she had not known where Dylan was, while a second said that, at one point, she noticed Dylan had been wearing no underwear beneath her dress.[164] Farrow reported the incident to the family's pediatrician, who in turn reported the allegations to authorities.[163] Allen was informed of the accusations on August 6. A week later, on August 13, Allen sued for full custody of his biological son, Satchel, and two of Farrow's adopted children, Dylan and Moses, with whom Allen had assumed a parental role.[165][166]\n\nIn March 1993, the lead doctor of Yale New Haven Hospital Child Sexual Abuse Clinic, John Leventhal, gave sworn testimony via a deposition that,[167] in his opinion, Dylan \"either invented the story under the stress of living in a volatile and unhealthy home or that it was planted in her mind by her mother\" because of the \"inconsistent\" presentation of the story by Dylan.[168] Leventhal did not meet with Dylan prior to giving his testimony, and instead delivered his findings based on interviews conducted by others.[165] The Yale New Haven Hospital team's findings were criticized by the presiding judge, and later by other experts in the field. In particular, the team's behavior was considered unusual for: making conclusive statements about innocence and guilt, instead of reporting on behavior; refusing to testify in court when asked; and destroying all of their notes.[169][170] Justice Wilk stated that the investigating team's behavior had \"resulted in a report which was sanitized, and therefore, less credible\" and that its recommendations and statements had \"exceed[ed] its mandate.\" He concluded, \"I am less certain, however, than is the Yale-New Haven team, that the evidence proves conclusively that there was no sexual abuse.\"[166]\n\nIn his final decision, in June 1993, Justice Wilk stated that he found \"no credible evidence to support Mr. Allen's contention that Ms. Farrow coached Dylan or that Ms. Farrow acted upon a desire for revenge against him for seducing Soon-Yi. Mr. Allen's resort to the stereotypical 'woman scorned' defense is an injudicious attempt to divert attention from his failure to act as a responsible parent and adult.\"[165] He rejected Allen's bid for full custody and denied him visitation rights with Dylan, stating that even though the full truth of the allegations may never be known, \"the credible testimony of Ms. Farrow, Dr. Coates, Dr. Leventhal and Mr. Allen does, however, prove that Mr. Allen's behavior toward Dylan was grossly inappropriate and that measures must be taken to protect her.\"[166] In September 1993, the state's attorney, Frank Maco, announced he would not pursue Allen in court for the molestation allegations, despite having \"probable cause,\" citing his and Farrow's desire not to traumatize Dylan further.[171]\n\nIn February 2014, Dylan publicly renewed her claims of sexual abuse against Allen, in an open letter published by Nicholas Kristof, a friend of Farrow, in his New York Times blog.[172][173][174] Allen repeated his denial of the allegations.[175]\n\nAbuse allegations against Farrow [ edit ]\n\nSoon Yi Previn and Moses Farrow have defended Allen against the abuse allegations.[176] In 2013, Moses Farrow publicly asserted that Mia had coached her children into believing stories she made up about Allen.[177][178]\n\nIn 2018, Moses published a lengthy blog post arguing for Allen's innocence. In the blog post, Moses recounted a series of instances of alleged physical abuse at the hands of Mia Farrow. Moses wrote in part “It pains me to recall instances in which I witnessed siblings, some blind or physically disabled, dragged down a flight of stairs to be thrown into a bedroom or a closet, then having the door locked from the outside. [Mia] even shut my brother Thaddeus, paraplegic from polio, in an outdoor shed overnight as punishment for a minor transgression”.[176][179]\n\nMoses Farrow also described the relationship between Mia Farrow and Soon-Yi Previn: “Soon-Yi was her most frequent scapegoat (…) When Soon-Yi was young, Mia once threw a large porcelain centerpiece at her head. Luckily it missed, but the shattered pieces hit her legs. Years later, Mia beat her with a telephone receiver. Soon-Yi’s made it clear that her desire was simply to be left alone, which increasingly became the case. Even if her relationship with Woody was unconventional, it allowed her to escape. Others weren’t so lucky”.[180][181][182]\n\nMoses Farrow also recalls, “The summer between first and second grades… my mother came over to my bed and found a tape measure. She gave me a piercing look that stopped me in my tracks and asked if I had taken it, as she had been looking for it all day. I stood in front of her, frozen. She asked why it was on my bed. I told her I didn’t know, that perhaps a workman had left it there. She asked again and again and again. When I didn’t give the answer she wanted, she slapped my face, knocking off my glasses. She told me I was lying and directed me to tell my brothers and sisters that I had taken the tape measure. Through my tears I listened to her as she explained that we would rehearse what should have happened. She would walk into the room and I would tell her I was sorry for taking the tape measure, that I had taken it to play with and that I would never do it again. She made me rehearse it at least a half-dozen times. That was the start of her coaching, drilling, scripting, and rehearsing – in essence, brainwashing. I became anxious and fearful”.[183][184]\n\nMoses Farrow also recalls. \"One summer day, Mia accused me of leaving the curtains closed in the TV room. They had been drawn the day before when Dylan and Satchel were watching a movie. She insisted that I had closed them and left them that way. Her friend Casey had come over to visit and while they were in the kitchen, my mother insisted I had shut the curtains. At that point, I couldn’t take it anymore and I lost it, yelling, “You’re lying!” She shot me a look and took me into the bathroom next to the TV room. She hit me uncontrollably all over my body. She slapped me, pushed me backwards and hit me on my chest, shouting, “How dare you say I’m a liar in front of my friend. You’re the pathological liar.” I was defeated, deflated, beaten and beaten down. Mia had stripped me of my voice and my sense of self. It was clear that if I stepped even slightly outside her carefully crafted reality, she would not tolerate it. It was an upbringing that made me, paradoxically, both fiercely loyal and obedient to her, as well as deeply afraid\".[185]\n\nChildren [ edit ]\n\nFarrow's children[186] Matthew Previn (b. February 26, 1970) Sascha Previn (b. February 26, 1970) Lark Previn (adopted 1973; b. February 15, 1973; died December 25, 2008) Fletcher Previn (b. March 14, 1974) Summer \"Daisy\" Previn (adopted 1976; b. October 6, 1974) Soon-Yi Previn (adopted 1977; b. c. October 8, 1970 ) Moses Farrow (adopted 1980; b. circa 1978) Dylan Farrow (adopted 1985; b. July 11, 1985) Ronan Farrow (b. December 19, 1987) Tam Farrow (adopted 1992; b. 1979; died 2000) Isaiah Farrow (adopted 1992; b. February 3, 1992) Thaddeus Farrow (adopted 1994; b. December 16, 1988; died September 21, 2016) Kaeli-Shea \"Quincy\" Farrow (adopted 1994; b. January 19, 1994) Frankie-Minh Farrow (adopted 1995; b. February 4, 1989) indicates biological child\n\nFarrow has fourteen children: four biological and ten adopted. She and former husband André Previn have three biological sons: twins Matthew and Sascha (born February 26, 1970),[187] and Fletcher (born March 14, 1974).[188] Sascha is a graduate of Fordham University,[189] while Fletcher, a graduate of Connecticut College, became the chief information officer of IBM.[190] Farrow and Previn adopted Vietnamese infants Lark Song Previn and Summer \"Daisy\" Song Previn, in 1973 and 1976, respectively,[191] followed by the adoption of Soon-Yi from Korea in 1977. Soon-Yi's precise birth date is not known, but a bone scan estimated her age as from 5 to 7, at the time of her adoption.[163] The Seoul Family Court established a Family Census Register (legal birth document) on her behalf on December 28, 1976, with a presumptive birth date of October 8, 1970.[192][193]\n\nIn 1980, following her divorce from Previn, Farrow adopted Moses Farrow, a two-year-old Korean orphan with cerebral palsy.[189] In 1985, Farrow adopted Dylan Farrow (born July 1985, adopted at two weeks old).[194] Dylan was known as \"Eliza\" for some time and also as \"Malone\".[195][150] In December 1991, a New York City court allowed Woody Allen to co-adopt Dylan and Moses.[196]\n\nWith Allen, Farrow gave birth to her fourth and final biological child, son Satchel Ronan O'Sullivan Farrow (later known simply as Ronan Farrow),[2] on December 19, 1987.[197] In a 2013 interview with Vanity Fair, Farrow stated Ronan could \"possibly\" be the biological child of Frank Sinatra, with whom she claimed to have \"never really split up\".[198] In a 2015 CBS Sunday Morning interview, Sinatra's daughter Nancy dismissed the idea that her father is also the biological father of Ronan Farrow, calling it \"nonsense\". She said that her children were affected by the rumor because they were being questioned about it. \"I was kind of cranky with Mia for even saying 'possibly,’” she said. \"I was cranky with her for saying that because she knew better, you know, she really did. But she was making a joke! And it was taken very serious and was just silly, stupid.\"[199]\n\nBetween 1992 and 1995, Farrow adopted five more children: Tam Farrow; Kaeli-Shea Farrow, later known as Quincy Maureen Farrow; Frankie-Minh; Isaiah Justus; and Gabriel Wilk Farrow, later known as Thaddeus Wilk Farrow[200] and named after Elliott Wilk, the judge who oversaw Farrow's 1993 legal battle with Allen.[201]\n\nTam Farrow died of heart failure in 2000 at the age of 21.[202] In May 2018, Moses Farrow made claims on his personal blog that Tam had actually died from a prescription medication overdose following a lifelong battle with depression.[203] In 2021, Mia Farrow confirmed Moses' claim that Tam had died after an overdose of a prescription medication.[204] On December 25, 2008, Lark Previn died at the age of 35 from complications of HIV/AIDS.[205] On September 21, 2016, Thaddeus Farrow was found dead at the age of 27 after an apparent car crash in Connecticut,[206] though it was subsequently ruled he had committed suicide by shooting himself in the torso while inside his car.[207]\n\nFarrow has six biological granddaughters from her and Previn's sons (three by Matthew, one by Sascha, and two by Fletcher). She has nine grandchildren from her adopted children.[b]\n\n^ [6] According to Roosevelt, the marriage ended due to the utter lack of compatibility between them.[7] John Charles' pederastic tendencies surfaced in the press in 2012, when he was arrested for molesting two boys in Maryland.[8] As of 2013 he is serving a 10-year prison sentence.[9] For her part, Mia has refused comment on the case involving her brother.[10] In the late 1960s, Mia Farrow's younger brother, John Charles Villiers-Farrow, was briefly wed to Polish countess/model/socialite/authoress Ava Roosevelt (née Fichtner), who later married one of FDR 's grandsons.According to Roosevelt, the marriage ended due to the utter lack of compatibility between them.John Charles' pederastic tendencies surfaced in the press in 2012, when he was arrested for molesting two boys in Maryland.As of 2013 he is serving a 10-year prison sentence.For her part, Mia has refused comment on the case involving her brother. ^ [208][209][210] Farrow apparently does not acknowledge four of her adoptive grandchildren: Soon-Yi's adoptive daughters Bechet and Manzie; and Lark's daughters Sara and Christine, whom she lost touch with since Lark's death in 2008. Based on counts she has relayed to the media,Farrow apparently does not acknowledge four of her adoptive grandchildren: Soon-Yi's adoptive daughters Bechet and Manzie; and Lark's daughters Sara and Christine, whom she lost touch with since Lark's death in 2008.\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/5/52/Mia_Farrow_2012_Shankbone_2.JPG/200px-Mia_Farrow_2012_Shankbone_2.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Dustin_Hoffman_and_Mia_Farrow_-_John_and_Mary_%281969%29.jpg/170px-Dustin_Hoffman_and_Mia_Farrow_-_John_and_Mary_%281969%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Open_Access_logo_PLoS_transparent.svg/9px-Open_Access_logo_PLoS_transparent.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/58/MiaFarrowAfrica.jpg/170px-MiaFarrowAfrica.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/15/Mia_Farrow_and_Andre_Previn_at_Juilliard_%281969%29.jpg/170px-Mia_Farrow_and_Andre_Previn_at_Juilliard_%281969%29.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Wikinews-logo.svg/27px-Wikinews-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Pulitzer2018-mia-farrow-20180530-wp.jpg/1200px-Pulitzer2018-mia-farrow-20180530-wp.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Mia_Farrow_1965_press_photo.jpg/170px-Mia_Farrow_1965_press_photo.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Pulitzer2018-mia-farrow-20180530-wp.jpg/220px-Pulitzer2018-mia-farrow-20180530-wp.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/Mia_Farrow_1998.jpg/200px-Mia_Farrow_1998.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Mia_Farrow_-1980.jpg/170px-Mia_Farrow_-1980.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/Mia_Farrow_in_discussion_with_EUFOR_soldier_%282530868572%29.jpg/220px-Mia_Farrow_in_discussion_with_EUFOR_soldier_%282530868572%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/f/f9/Double-dagger-14-plain.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/John_Farrow_family_1950.jpg/220px-John_Farrow_family_1950.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Pulitzer2018-mia-farrow-20180530-wp.jpg/1200px-Pulitzer2018-mia-farrow-20180530-wp.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Mia_Farrow", "title": "Mia Farrow", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Pulitzer2018-mia-farrow-20180530-wp.jpg/640px-Pulitzer2018-mia-farrow-20180530-wp.jpg", "width": 640, "height": 960}, "title": "Mia Farrow - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}