{"url": "https://en.wikipedia.org/wiki/Stassi_Schroeder", "text": "American television personality, model, and journalist\n\nNastassia Bianca Schroeder Clark (born June 24, 1988[1]) is an American television personality, podcast host, fashion blogger, model and author.[2][3] She is best known for appearing on Bravo's reality television series Vanderpump Rules (2013–2020).[4][5][6]\n\nEarly life [ edit ]\n\nNastassia Bianca Schroeder was born in New Orleans, Louisiana, to an architect father, Mark, and a jewelry designer (Georgi Jules Jewelry) mother, Dayna. She has two younger brothers, Hunter and Nikolai, and a younger sister, Georgianna. Her grandmother, Rosemary died at age 95 in May 2019.[4] When she was 11, Schroeder began taking theater classes at her local high school, Mount Carmel Academy[4] When she turned 18, she moved to Hollywood and attended Loyola Marymount University, where she received a bachelor's degree in English writing.[7]\n\nCareer [ edit ]\n\nTelevision [ edit ]\n\nIn 2005, Schroeder appeared as a contestant on season 8 of the reality game show The Amazing Race, alongside her father Mark, her step-mother Char, and her brother Hunter; the family came in 7th place of 10 teams.[8] After the filming of the show, the Schroeders' house was flooded and destroyed by Hurricane Katrina. They stayed with another family from the show while they rebuilt their house.[9] While going to school in 2008, she was on the television series Queen Bees.[10]\n\nIn 2010, she started working at Lisa Vanderpump's restaurants SUR and Villa Blanca, which earned her a spot on the reality television series Vanderpump Rules. The series follows Vanderpump's employees, as they work on building their futures and become entangled in interpersonal drama.[5][11] She departed the show at the end of season two to move to New York City, then she returned as an Intern to Lisa Vanderpump in season three.[12]\n\nIn 2016, she portrayed Koening in the television film Sharknado: The 4th Awakens. She has also appeared in three episodes of Bravo's reality television series Summer House between 2017 and 2019.[13] In November 2019, Schroeder started a digital series called Basically Stassi, with Beau Clark.[14] The series was released online on Bravo's website and YouTube channel.[15] The show followed Schroeder and her guests at her apartment in Los Angeles while playing games and discussing various topics such as relationships, love and life.[16]\n\nFashion [ edit ]\n\nSchroeder worked as a model for several years, appearing in magazines like Italian Vanity Fair, 944, Glamour,[17] Genlux[18] and Us Weekly.[19] She has graced the covers of numerous magazines, including Millennium,[20] Cliché and Pacific.[21] Schroeder introduced a capsule collection with accessories e-retailer ShopPrimadonna.com which officially launched in December 2014.[22] \"When Shop Prima Donna came to me about designing a line for them, I just knew statement necklaces were what I wanted to do. I wanted to do something that has an Egyptian vibe because I love gold but with a ladylike twist [with] pearls and stones,\" Schroeder said of the collaboration.[23] She released a clothing line in collaboration with JustFab in July 2019.[24][25] The collection has two parts \"Next Level Basics\" and \"#OOTN (Outfit of the Night)\".[26][27][28]\n\nShe has received noteworthy praise for her style from periodicals such as People magazine, who described Schroeder as \"the most fashion-focused of all her castmates\" on Vanderpump Rules.[29]\n\nWriting [ edit ]\n\nSchroeder worked as a style critic writing for Vanderpump's daughter's website, The Divine Addiction.[26] Schroeder's book Next Level Basic: The Definitive Basic Bitch Handbook was released on April 16, 2019, by Gallery Books.[30][31][32][33] The book was third on the New York Times Best Seller list.[34] The book is a humorous celebration of her most basic tendencies and a defense of the basic culture.[35] In the book, she lists her favorite beauty products, a guide to the best Ranch dressings, tips on how to look good on social media and a graph indicating how psycho you are based on the charge of your phone.[35] She wrote a wedding column titled \"Basic Bride\" for Glamour magazine for three months in 2020.[36]\n\nHer second book titled Off with My Head: The Definitive Basic B*tch Handbook to Surviving Rock Bottom was published on April 26, 2022, by Gallery Books.[37][38][39]\n\nOther ventures [ edit ]\n\nSchroeder is popular on social media and endorses products such as beauty and wellness products on Instagram.[40][41] She has partnered with several brands, including Taco Bell food,[42] Botox Cosmetic prescription medicine,[43] Bondi Sands tanning foam[44] and bioClarity skin products.[45]\n\nOn February 1, 2019, Schroeder, Kristen Doute and Katie Maloney-Schwartz launched a wine in partnership with Nocking Point Wines called \"Basic Witch Potion No. 1\".[46][47][48] Their second collaboration with Nocking Point Wines, \"Basic Witch Potion No. 2\" Rosé was launched on June 1, 2019.[49][50] In 2015, she launched a podcast titled Straight Up with Stassi, which she hosted weekly for five years.[51][52] Schroeder announced that she is doing \"Straight Up With Stassi LIVE\" podcast tour in four cities in September 2019.[53]\n\nIn March 2021, Schroeder announced her new venture with husband Beau Clark, a Patreon-hosted parenting podcast entitled The Good The Bad The Baby.[54][55]\n\nPersonal life [ edit ]\n\nSchroeder in 2014\n\nIn July 2019, Schroeder became engaged to casting agent Beau Clark after two years of dating.[56][57] Their engagement photos were published exclusively in People magazine in October 2019.[58] The couple got married in a small ceremony in September 2020.[59] Together they have a daughter, Hartford Charlie Rose, born on January 7, 2021.[60]\n\nShe has publicly spoken about her psoriasis.[61][62]\n\nSchroeder has a fascination with pseudo-science such as Tarot cards and astrology. She shares a birthday with her Vanderpump Rules co-star Ariana Madix (June 24), although Schroeder is three years her junior.\n\nControversy [ edit ]\n\nOn June 9, 2020, Schroeder and co-star, Kristen Doute were fired from the show because they reported former co-star, Faith Stowers, to the police for a crime that she did not commit. Schroeder also was criticized for publicly making racially insensitive remarks and for insensitive remarks about the #metoo movement. She has since stated that she hired a diversity coach.[63]\n\nFilmography [ edit ]\n\nAs actress Year Title Role Notes 2016 Sharknado: The 4th Awakens Koening Television film\n\nPublished works [ edit ]\n\nSchroeder, Stassi. Next Level Basic: The Definitive Basic Bitch Handbook. New York: Gallery Books, 2019.\n\nNew York: Gallery Books, 2019. Schroeder, Stassi. Off with My Head: The Definitive Basic B*tch Handbook to Surviving Rock Bottom. New York: Gallery Book, 2022.", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Stassi_Schroeder_2019_by_Glenn_Francis.jpg/220px-Stassi_Schroeder_2019_by_Glenn_Francis.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Stassi_Schroeder_2019_by_Glenn_Francis.jpg/1200px-Stassi_Schroeder_2019_by_Glenn_Francis.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Stassi-schroeder.png/220px-Stassi-schroeder.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Stassi_Schroeder_2019_by_Glenn_Francis.jpg/1200px-Stassi_Schroeder_2019_by_Glenn_Francis.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Stassi_Schroeder", "title": "Stassi Schroeder", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Stassi_Schroeder_2019_by_Glenn_Francis.jpg/640px-Stassi_Schroeder_2019_by_Glenn_Francis.jpg", "width": 640, "height": 960}, "title": "Stassi Schroeder - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}