{"url": "https://en.wikipedia.org/wiki/Lucky_Charms", "text": "Breakfast cereal made by General Mills\n\nLucky Charms General Mills – Lucky Charms – Frosted Toasted Oat Cereal with Marshmallows – Served with milk Product type Cereal with marshmallows Owner General Mills Country United States Introduced March 20, 1964 ; 58 years ago ( ) Markets United Kingdom, Canada Tagline \"They're magically delicious.\" Website luckycharms.com\n\nLucky Charms is a brand of breakfast cereal produced by General Mills since 1964.[1] The cereal consists of multi-colored marshmallows and pieces of shaped pulverized oat, each resembling one of several objects or symbols associated with good luck. The packaging and marketing features a leprechaun mascot, Lucky.\n\nHistory\n\nLucky Charms was created in 1964 by product developer John Holahan. General Mills management challenged a team of product developers to use the available manufacturing capacity from either of General Mills' two principal cereal products—Wheaties or Cheerios—and do something unique. Holahan came up with the idea after a visit to the grocery store in which he decided to mix Cheerios with bits of Brach's Circus peanuts.[2]\n\nAn advertising company employed by General Mills and Company suggested marketing the new cereal around the idea of charm bracelets.[3] Thus, the charms of Lucky Charms were born. Lucky Charms is the first cereal to include marshmallows in the recipe. These pieces are called \"marshmallow bits\", or \"marbits\", due to their small size. Marbits were invented by Edward S. Olney and Howard S. Thurmon (U.S. patent number 3,607,309, filed November 1, 1968, and assigned September 9, 1971, for \"preparation of marshmallow with milk solids\"),[4] with the patent grant now assigned to Kraftco Corporation.\n\nThe mascot of Lucky Charms, created in 1963, is Lucky the Leprechaun, also known as Sir Charms, and originally called L.C. Leprechaun.[5] The cartoon character's voice was supplied by the late voice actor Arthur Anderson until 1992.[6] Lucky has also been voiced by Eric Bauza, Tex Brashear, Jason Graae, Doug Preis, and Daniel Ross.[7] In 1975, Lucky the Leprechaun was briefly replaced by Waldo the Wizard in New England, while Lucky remained the mascot in the rest of the United States. Envisioned as a forgetful wizard who was kind to children, Waldo initially prevailed in market tests. However, Waldo's creator Alan Snedeker suspects he sealed Waldo's fate by working on TV ads that portrayed a nicer version of Lucky.[8]\n\nThe oat cereal was not originally sugar-coated. After initial sales failed to meet expectations, the oats were sugar-coated, and the cereal's success grew. Piggy banks and plastic watches were introduced as cereal box send-away prizes as a marketing tactic to increase sales. The recipe for the cereal remained unchanged until the introduction of a new flavor: Chocolate Lucky Charms, in 2005. Later in 2012, General Mills introduced \"Lucky Charms Marshmallow Treats\".\n\nFollowing the product launch, the General Mills marketing department found that sales performed dramatically better if the composition of the marbits changed periodically.[3] Various features of the marbits were modified to maximize their appeal to young consumers. Over the years, over 40 limited edition features such as Winter Lucky Charms, Olympic-themed Lucky Charms, and Lucky Charms featuring marshmallow landmarks from around the world were created to drive consumer demands. In focus groups and market research, more brightly colored charms resulted in better sales than did dull or pastel colors.[3] Currently, General Mills conducts \"concept-ideation\" studies on Lucky Charms.[3]\n\nIn April 2022, the FDA opened an investigation into whether Lucky Charms was making people ill after receiving reports from over 100 people that it caused nausea, vomiting and other symptoms. A food safety website iwaspoisoned.com separately documented over 3,000 similar complaints from all over the United States and Canada that started trending upwards in 2021.[9]\n\nMarshmallows\n\nLucky Charms\n\nThe first boxes of Lucky Charms cereal contained marshmallows in the shapes of pink hearts, yellow moons, orange stars, and green clovers. The lineup has changed occasionally, beginning with the introduction of blue diamonds in 1975, followed by purple horseshoes in 1983,[10] red balloons in 1989, green trees in 1991, rainbows in 1992, blue moons in 1995, leprechaun hats in 1997 (temporarily replaced the green clovers), orange shooting stars and around-the-world charms in 1998 (added blue, green, yellow, purple, and red in 2011), a crystal ball in 2001, an hourglass in 2008,[3] and a unicorn in 2019. In 2013, 6 new rainbow swirl moons and 2 new rainbow charms were introduced. From the original four marshmallows, the permanent roster as of 2013 includes eight marshmallows.\n\nOlder marshmallows were phased out periodically. The first shapes to disappear were the yellow moons and blue diamonds, replaced by yellow/orange pots of gold and blue moons respectively in 1994. In 2006, the assortment included purple horseshoes; red balloons; blue crescent-moons; orange and white shooting stars; yellow and orange pots of gold; pink, yellow, and blue rainbows; two-tone green leprechaun hats; pink hearts (the one shape to survive since the beginning); with the most recent addition being the return of the clovers in 2004. In 2018, for the first time in ten years, Lucky Charms retired a marshmallow, the hourglass shape. It was replaced by a unicorn, which was chosen on social media by way of emojis.[11][12] The size and brightness of the marshmallows changed in 2004.[13]\n\nRecent changes to the marshmallows include the star shape taking on a \"star\" design, the orange five-pointed star being complemented by a white \"trail\". In late 2005, another marshmallow shape was added, the \"Hidden Key\". It is a solid yellow marshmallow that resembles an arched door (similar to the shape of a tombstone; flat at the bottom, flat sides with a round top). When liquid is added to the cereal, the sugar in the marshmallow dissolves and the shape of a skeleton key appears \"as if by magic\". The tagline was, \"Unlock the door with milk!\" This \"new\" marshmallow type has been used in other hot and cold cereals, but with mixed success (from characters \"hidden\" inside a bigger marshmallow to letters appearing). In early June 2006, General Mills introduced Magic Mirror marshmallows. In 2008, yellow and orange hourglass marshmallows were introduced with the marketing tagline of, \"The Hourglass Charm has the power to Stop Time * Speed Up Time * Reverse Time\". As of 2011, swirled marshmallows and rainbow-colored stars have been introduced.[citation needed]\n\nThe marshmallows are meant to represent Lucky's magical charms, each with their own special meaning or \"power\". As of April 2021 , the following are explanations of the permanent marshmallows:[14]\n\nHeart Charm – Gives life to objects\n\nStar Charm – Power of flight\n\nHorseshoe Charm – Power of speed\n\nClover Charm – Power of luck\n\nBlue Moon Charm – Power of invisibility\n\nRainbow Charm – Power to teleport\n\nRed Balloon Charm – Power to float\n\nUnicorn Charm – Brings color to the world\n\nLimited edition marshmallows\n\nThere have been more than 30 featured limited edition marshmallow shapes over the years, with the introduction of themed Lucky Charms, such as Winter Lucky Charms. Some of these include:\n\nIn 1986, a whale-shaped marshmallow was temporarily added to the lineup. [15]\n\nIn 1990, a green pine tree-shaped marshmallow was temporarily added to the lineup. [15] During that time, the cereal promoted Earth Day with a free Colorado Blue Spruce seedling with proofs-of-purchase. [16]\n\nDuring that time, the cereal promoted Earth Day with a free Colorado Blue Spruce seedling with proofs-of-purchase. In 1991, the star and balloon shape marshmallows were combined for a short time. The red balloon featured a gold six-pointed star. The star was removed at a later date to make the Red Balloon and Star marshmallows separate. [15]\n\nIn 1994, sprinkles were temporarily added to the marshmallows.\n\nIn 1999, the moon shape marshmallows were modified with the addition of the yellow curve line for a limited time.\n\nIn 2000, a \"New Sparkling Rainbow\" was added to the mix for a limited time. It was described by General Mills as \"a sprinkling of multicolored sugar on a white rainbow marbit\". This marshmallow replaced the original rainbow at this time. [17]\n\nIn 2010, the swirled marshmallows were in Lucky Charms for a limited time.\n\nIn June 2013, two new rainbow marshmallows were added for LGBT Pride Month. [18]\n\nIn 2015, new diamond-shaped marshmallows were added in. [ citation needed ]\n\nIntroduced in 2017, limited edition cinnamon vanilla Lucky Charms include only snowman, snowball, and snowflake-shaped marshmallows.\n\nIn 2018 a unicorn shaped-marshmallow was added; it became a permanent addition later that year. [ citation needed ]\n\nIn 2018 winter-themed marshmallows, including snowmen and snowflakes, were added as part of a limited edition chocolatey winter mix. [19]\n\nIn 2021, a limited edition variant of the cereal was promoted called \"Loki Charms,\" modelled after the Marvel Cinematic Universe Norse God supervillain Loki in promotion of the Disney+ original television series, Loki. All supplies of the cereal were sold out in seconds upon release on June 9, 2021.[20]\n\nMarshmallow-only promotions\n\nFor an advertising campaign in May 2017, General Mills announced they would be promoting 10,000 boxes of cereal that contain only marshmallow pieces.[21] In order to win one of the coveted boxes, consumers would need to purchase a specially marked box of regular Lucky Charms with a code on the inside panel. The code would be entered into an official website to see if the consumer is the winner of one of the 10,000 novelty boxes produced. The sweepstakes ran through December 2017.[22][23]\n\nIn August 2020, General Mills announced it would be selling packages of Lucky Charms marshmallow-pieces-only in retail outlets for a limited time. Each six-ounce bag will contain hearts, stars, horseshoes, clovers, blue moons, rainbows, red balloons, and unicorns.[24]\n\nTheme song\n\nIn the earliest commercials, Lucky Charms cereal had no theme jingle; action was accompanied by a light instrumental \"Irish\" tune. Soon, however, a simple two-line tag was added:\n\nFrosted Lucky Charms, They're magically delicious!\n\nThis simple closer, with the kids usually singing the first line and Lucky singing the second, survived into the 1980s.\n\nThen, with the addition of the purple horseshoe marbit, it was extended into a jingle describing the contents of the box.[25] This was later revised with the addition of red balloons to the now-familiar \"Hearts, stars, horseshoes, clovers, and blue moons, pots of gold, and rainbows, and tasty red balloons!” In 2008, the pot of gold was replaced with the hourglass in the theme song. It was replaced by the Unicorn in 2018.\n\nThe jingle is usually accompanied by mentioning that Lucky Charms contains whole-grain ingredients and is part of a balanced meal. General Mills's market position is centered on cereals that contain \"more whole grain than any other single ingredient, which is significant, because 95 per cent of Americans aren't eating minimally 48 grams of whole grain per day as recommended by the U.S. Dietary Guidelines\".[26]\n\nTaglines\n\n“They're Magically Delicious!” [27]\n\n“Frosted Lucky Charms, They're Magically Delicious!”\n\n“I Love Me Lucky Charms, With 3 New Unicorn Marshmallows, They're Magically Delicious!”\n\n“They're Always After Me Lucky Charms!”\n\n“You'll Never Get Me Lucky Charms!”\n\n“Pink Hearts, Orange Stars, Yellow Moons, and Green Clovers!”\n\n“Pink Hearts, Orange Stars, Yellow Moons, Green Clovers, and Blue Diamonds!”\n\n“Pink Hearts, Orange Stars, Yellow Moons, Green Clovers, Blue Diamonds, and Purple Horseshoes!”\n\n“Pink Hearts, Orange Stars, Yellow Moons, Green Clovers, Blue Diamonds, Purple Horseshoes, and Red Balloons!”\n\n“Hearts, Stars, and Horseshoes, Clovers and Blue Moons, Pots of Gold and Rainbows, and Tasty Red Balloons!”\n\n“Hearts, Stars, and Horseshoes, Clovers and Blue Moons, Hourglasses, Rainbows, and Tasty Red Balloons!”\n\n“Hearts, Stars, and Horseshoes, Clovers, Red Balloons, Hourglasses, Rainbows, and Six New Swirled Moons!”\n\n“Hearts, Stars and Horseshoes, Clovers and Blue Moons, Hourglasses, Rainbows, and Tasty Red Balloons!”\n\n“Hearts, Stars, Horseshoes, Clovers and Blue Moons, Unicorns, Rainbows, and Tasty Red Balloons!”\n\nSee also", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/Nestl%C3%A9_textlogo.svg/120px-Nestl%C3%A9_textlogo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/12px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/6/69/Lucky_charms_brand_logo.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/General_Mills_logo.svg/90px-General_Mills_logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/General_Mills_%E2%80%93_Lucky_Charms_%E2%80%93_Frosted_Toasted_Oat_Cereal_with_marshmalls_%E2%80%93_Served_with_milk.jpg/220px-General_Mills_%E2%80%93_Lucky_Charms_%E2%80%93_Frosted_Toasted_Oat_Cereal_with_marshmalls_%E2%80%93_Served_with_milk.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/52/Lucky_Charms_%2814803357412%29.jpg/220px-Lucky_Charms_%2814803357412%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/6/69/Lucky_charms_brand_logo.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Lucky_Charms", "title": "Lucky Charms", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/6/69/Lucky_charms_brand_logo.png", "width": 640, "height": 473}, "title": "Lucky Charms - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}