{"url": "spinditty.com/genres/Why-Madonna-Succeeded-Where-Cyndi-Lauper-Failed", "text": "LT Wright is the parent of two children. She has bought and borrowed hundreds of kid's books over the years.\n\nMadonna and Cyndi Lauper appeared on the music scene around the same time in the 1980s. Madonna is still going strong and is still very well known. Lauper is still making music and performing, but she isn't a household name. She's remembered for just a few songs. So, why is it that two artists who started out so big took such different career trajectories? And are there Madonna and Cyndi equivalents among modern pop girls?\n\nMadonna Album Cover\n\nShe's So Unusual Album Cover\n\nRecord Sales\n\nNew Yorker Cyndi Lauper, born Cynthia Ann Stephanie Lauper, released her debut album She's So Unusual in 1983. The album produced four megahits, \"Girls Just Want to Have Fun,\" \"Time After Time,\" \"She Bop,\" and \"All Through the Night.\" Her next two albums were also successes. Lauper went on to sell more than 25 million albums. Then she faded away. However, Cyndi is far from being a failure. She has worldwide record sales of more than 50 million and has won Grammy, Emmy, and Tony awards, which is a rare feat.\n\nMichigan native Madonna Louise Ciccone released her first single in 1982 and is still a big name in music 30 years later. She's sold more than 300 million records worldwide. She's the best-selling female recording artist of all time according to the Guinness Book of World Records. Not only is she a successful singer, but she's also an entrepreneur, actress, author, and director. She's become a musical icon and has influenced many of today's young female artists.\n\nSo, why did Cyndi Lauper fade away while Madonna continues to have commercial success and iconic status?\n\nMadonna Wanted Fame More\n\nMadonna was business savvy—aware of the need to continually reinvent herself and her sound. She knew how to market herself. Cher said about Madonna:\n\n\"...she is always riding the crest of the wave. She always saw trends WAY before anyone else...\"\n\nCyndi Lauper wanted to make the music she wanted to make. Not what happened to be hot at the time.\n\nMadonna was also willing to exploit her sexuality to gain attention in much the same way as Miley Cyrus. She created controversy with her book Sex, which had explicit photographs, and with her explicit album Erotica. Madonna also courted religious controversy with her \"Like a Prayer\" video.\n\nLauper was far less controversial than Madonna, which meant less press interest in her. The most controversial part of her career was probably her song \"She Bop,\" making the Parents Music Resource Center's \"Filthy Fifteen\" list because it was about masturbation.\n\nCyndi Wanted to Make Personal Music\n\nMadonna didn't appear to really care about music. She wanted success and fame and the music industry was a means to accomplish that. This is not to say she didn't care about the music she made. She's a perfectionist who has strong visions for how she wants her albums to sound. But her albums were made with a focus on commercial success rather than artistry.\n\nLauper was more of a true artist. She stubbornly wanted to make the music she loved and fought with her label for creative control. Madonna was a businesswoman who followed whatever musical trends would sell.\n\nCyndi changed over time. She left her crazy, colorful image behind and started making personal music. This kind of music was less appealing to her younger fans, and due to her earlier crazy pop girl image, she wasn't taken seriously by the kinds of people who buy \"serious\" music.\n\nImage\n\nIn the 1980s, Madonna clones were a much more common sight than Cyndi clones. Cyndi's image wasn't as attractive to young women and wasn't as easy to imitate. Just like how Katy Perry has a more appealing image to young girls than someone like Adele.\n\nThere was also an age difference. Cyndi was already 30 years old when she had her first hit. This made it more difficult for teenage fans to identify with her. She was already in her mid-30s when her third album was released. Madonna was only 24 years old when she first came on the music scene, making it easier for young girls to identify with her.\n\nAlbum Breaks\n\nCyndi Lauper took big breaks between album releases. This is the release schedule for her first four albums.\n\n1983 - She's So Unusual\n\n1986 - True Colors\n\n1989 - A Night to Remember\n\n1993 - Hat Full of Stars\n\nShe also starred in the flop comedy film Vibes. In that same time period, Madonna released twice as many albums, starred in the hugely successful movie A League of Our Own, and started her own record label, Maverick Records. She was far more productive and always in the public eye while Cyndi disappeared from the music scene for long chunks of time.\n\nAre There Equivalents of Madonna and Cyndi Today?\n\nThe Madonna and Cyndi story is so compelling that people look for comparisons with modern artists. California girl Katy Perry sometimes gets cast as a modern Madonna because she left behind her early pop-rock sound to pursue commercial pop instead. And she's had huge success doing it. Many early fans felt she was a sellout. However, I don't think Katy has the level of ambition Madonna had. It's possible that she'll give up pop music at some point and transition to acoustic music, where her real talent actually lies.\n\nA more recent and much more Madonna-like example is Nashville-born Miley Cyrus. She's using the same kinds of shocking techniques to gain publicity, and it has worked well for her so far. She successfully manipulated the media and the general public to draw attention to herself. However, it's a bit early to cast her as today's Madonna because we don't yet know how she'll fare over the coming years. Time will tell if she's a worthy successor to Madonna.\n\nKesha and Lady Gaga are two artists who have fallen on hard times, so they are sometimes cast as the modern Cyndi equivalents. Kesha's sophomore album Warrior was a major flop. Gaga's experimental Born this Way album sold far less than her debut and produced fewer successful singles.\n\nNew Yorker Lady Gaga (Stefani Germanotta) is compared to Cyndi because she had a massive era with her debut The Fame, and a less successful but still very profitable era with Born This Way. However, her next lead single, \"Applause,\" struggled to get off the ground. She continued to have flop singles, and her album ARTPOP was a critical disaster.\n\nThe Gaga comparison is understandable since she started off huge like Cyndi but then ran into trouble during her second album. However, she does have a massive and very devoted fan base. I don't see Lady Gaga going away any time soon because she has a large enough fan base to sustain her.\n\nIt's tempting to make these comparisons between today's artists and Madonna and Cyndi. The causes of Kesha's and Lady Gaga's troubles were very different from what happened with Cyndi. Many artists go through struggles in their careers and then bounce back. Time will tell if there really is a modern Madonna and Cyndi among us.\n\n© 2013 LT Wright\n\nJersey on August 14, 2020:\n\nBack in the 80s an article was written on both singers (I believe it was Time Magazine) when both were big - the writer said that Cyndi had the great pipes, but Madonna had the look. Madonna took that 'dancer' look with the ripped fishnets and rubber bracelets, teased her hair up, and that was it. Madonna was also very sexual - remember 'Like A Virgin' with her writhing in a gondola in Venice?? And rolling around on the floor singing that song in a wedding dress on the first MTV Awards Show in 1984?? She pushed boundaries to get attention, and it worked. I agree with the poster above - Cyndi appearing at all those wrestling matches was just stupid, and did absolutely nothing for her career, made her look desperate. Madonna was smart, she did everything she could to grab attention, and then she ran with it.\n\nKlu on June 19, 2020:\n\nI grew up in the 80s cyndi lauper was inperational l have so many good memories of her music, growing up as teen her music made us whant to party!\n\nPeter on October 02, 2019:\n\nCyndi waited too long between albums, 1983-86-89 compared to Madonna 1983-84-86 and that killed her momentum. Also Cyndi's each album was weaker than the one before whilst Madonna's got stronger and stronger.\n\nnomadicvision on September 15, 2019:\n\nI think the poll itself shows that Cyndi Lauper has failed well in comparison to Madonna. I was not crazy about either one when they came out, but now listening again with fresh ears and passing of so many years I definitely prefer Cyndi Lauper as a singer and performer. She strikes me as more genuine and I feel more resonance from her singing. She seems stripped of the glitter of glamour that fades with advancing age and I just identify more with her style and prefer the no holds barred abandon in her vocal delivery from soft ballads to harder pop rock that happens to be beautiful and powerful with many True Colors that reflect the texture of life in my opinion too , though of course Madonna is very talented and everyone is entitled to their own opinion. One thing I should thank this article for is it helped me to give Cyndi Lauper's music another chance and I am glad I did. I think it is unfortunate that so many people place so much importance on album sales and popularity when it is the way a singer impacts a person as an individual by striking some personal chord that rings through the spirit down the long corridors of time that should matter most and in this sense Cyndi Lauper is more \"successful\" to me personally. However, it is interesting to note that Girls Just Want to Have Fun and Time After Time have more views than any Madonna video on youtube. Also, Cyndi Lauper has influenced very popular foreign artists like Japanese sensation Namie Amuro, who is one of my favorites, in Girl Talk where she sings Girls Just Want to Have Fun in the chorus, though the song is a hip hop song and sounds very different . https://www.youtube.com/watch?v=qsQdZjjY6mk .\n\nDonna Gonzalez on September 11, 2019:\n\nU have not been a fan of Madonna l do listen to Cyndi. She had a sad beginning. Leaving home at 17. Getting to were she is. Something in its self to be proud of. So I stick by Cyndi.\n\nandy on August 26, 2019:\n\nnelly furtado is a good comparisson to cyndi lauper\n\nRogerio Silva on July 11, 2019:\n\nI've been a Cyndi fan since the beginning of her solo career. Whoever accompanies her knows that Cyndi fought to make music on her own terms and this cost disagreements with executives of the record company that stopped investing in the divulgation of her work, reason why she stopped to have songs in the first places of the charts, nevertheless she continued strong, doing what she loves and with great quality and recognition. That is why Cyndi Lauper achieved true success and today has an incredible and incomparable work. She did achieve success. In addition, there is room for everyone, each one could have a queen. Mine, for sure, is Cyndi Lauper.\n\nEdwin paul on May 24, 2019:\n\nCyndi lauper is the best a true artist., songwritter, fashion , actress, great voice... a talented... so why she loves a musician now and then.. than the other artist... i don't think so.\n\nLT Wright (author) from California on May 07, 2019:\n\nThe Charles Dickens,\n\n\"However, Cyndi is far from being a failure. She has worldwide record sales of 50 million and has won Grammy, Emmy, and Tony awards, which is a rare feat.\"\n\nYou must have missed this part of the article before you launched into personal attacks. I was referring to Madonna having mainstream success long after Lauper. That is a fact whether people like it or not.\n\nBig on May 06, 2019:\n\nI think it’s rather funny to use Madonna as the pillar of success, When she herself has had many, Many low points in her career, Especially in the last decade where she can’t seem to make a hit song or break through to a new audience outside of her Stanbase , Each album she makes sell FAR less than the previous one, Meanwhile Cyndi Lauper is being praised for her musical contributions to the smash broadway show Kinkyboots, And Lady Gaga won critical and commercial acclaim for her acting debut and accompanying soundtrack to A Star is Born, both women are still very much relevant and extremely successful today!\n\nMeanwhile the material girl cries about ageism and how everyone is against her.\n\nPerhaps Madonna should take a que from Cyndi and Lady Gaga and learn how to TRULY reinvent herself and have a long meaningful expanded career instead of the same old shtick she’s been doing since the 90’s ,\n\nAnd by the way , if there was no Marlana Dietrich, Marilyn Monroe, Josephine Baker, Debbie Harry, Grace Jones, Joan Jett, Cher, Carole Lombard, May West or Wendy O\n\nThere would be NO Madonna\n\nTHOSE women broke the ground and paved the way so Madonna could actually exist in the 80’s\n\nPlease give credit where credit is do, Madonna has and will always follow the blueprint laid down by these women incredible women who were truly before there time.\n\nRosieRitcha on May 05, 2019:\n\nYes I've been a Madonna fan since 1986. I admit the instrument that she used on her albums sounds good. The other reason I bought her albums I because she has a \"Short Hair\" . She sports short hairdo. Until when she sang the song \"Frozen\" telling her old fans to accept her in her ling hairdo or you'll be Frozen for the rest of your life. Still Cyndi is still the best. I always thought that Cyndi used Boy Blue as the wrong 4th single for True Colors album. She should have chosen 911 or Far Away Nearby and in the 90s there was a change of chairmanship in SONY that T. Motolla who never paid attention to Cyndi's talent.\n\nDarcy Gilliland on April 25, 2019:\n\n\"Younger people like me can relate to those two Pop Greats better than older ones although I like a lot of older ones as well too personally myself!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\"\n\nF. MDNA. SONG: INTO THE GROVE, F. CDI. LPR. SONG: GIRLS JUST WANT TO HAVE FUN\n\nDarcy Gilliland on April 25, 2019:\n\n\"I hardly know what to say here now after reading about these two artists Madonna and Cyndi Lauper and I really do like both of their music a lot indeed!!!! I picked Cyndi Lauper out of the two for taste since she has that edginess to her voice, she's or has strong resemblance or least in the 80s' to that kind of music which was big in the late 70s' and 80s', \"New Wave\" that is!!!!!!!!!!!!!!!!!!!!!!!!!!! And Madonna(The Queen Of Pop) who was Pop/Soft Rock had that kind of voice where dhe could take it to new levels for every point in her career and she was a chameleon in her videos just like Cyndi was too of course, the exact same as Bono, etc. as well all being ultimate chameleons in their videos!!!!!!!!!!!!!!!!!!! I really do have respect for Madonna though and totally love her music as well and she wins for having instant success as a younger in her early twenties as opposed to Cyndi who was already 30 although they started around the same time in their careers, two Big Pop Greats From The 80s' who are of course far from failures in timeless songs unlike some artists who are hard for younger people like me to relate to, older ones!!!!!!!!!!!!!!!!!!!!!!!!!!!! My favourite Madonna song is Into The Grove and my favourite Cyndi\n\nAnalysis on April 25, 2019:\n\nLady Gaga is not the new \"Queen of Pop.\"\n\nIf anyone has the power to take the crown from Madonna, it is Rihanna; she already is the most certified solo artist in terms of singles sold, which means she has surpassed Elvis in that metric.\n\nI am glad that Lady Gaga flopped with Artpop; her ego was huge in 2011 and she had stopped working with RedOne, who at that time produced almost all of her top 10 hits(Just Dance, Poker Face, Bad Romance, LoveGame, Judas, Alejandro etc...). When Artpop flopped, I knew that Gaga was almost nothing without a good producer, in this case being RedOne; it was also obvious that Gaga was not taking failure well and her ego was blown.\n\nThe same about Katy Perry, I believe she is failing without Dr. Luke producing her hits; the album \"Witness\" had produced many flop singles and Dr. Luke was absent. Dr. Luke produced the majority of Katy's #1 Hot 100 songs and it is obvious that she was successful in part due to Dr. Luke. We all know that Katy and Capitol decided to \"let go\" of Dr. Luke because of the bad PR from the Kesha lawsuit.\n\nRenato on February 03, 2019:\n\nLady Gaga Is not Fading away :) nowadays she's getting some sucess with A STAR IS BORN And refreshing her image. Katy Perry is the New Cyndi Lauper And Lady Gaga New Madonna\n\nLeon on December 19, 2018:\n\nI think you can compare them to Britney Spears and Christina Aguilera, Britney's always aimed for commercial success while Xtina wanted to write her own music and write more personal music. They started out at the same time but Britney has almost double the albums, more than double the singles and more than double the music videos.\n\nSylvinnia on July 22, 2018:\n\nI think someday lady gaga will be name \"the new queen of pop\". She is so much comparable to pop icon such as Michael Jackson and madonna.gaga has won like 6-7 Grammys as well as many other awards. Her hit single \"born this way\" is very similar to Madonna's hit \"express yourself\".\n\nGG Stan on May 13, 2018:\n\nI think that from the 90s there is the story of Britney Spears and Christina Aguilera. Even tho they both aimed for commercial preferences, but the distinction was always set, like with Madonna and Cyndi. Now, 2010's, I think there isn't. Today's music is so fast that no one really lasts. Taylor Swift is not so iconic and Adele is that voice \"of a generation\", not really a persona like Madonna is.\n\nTaylor and her boyfriends on February 06, 2018:\n\nI feel that controversy can also help sell a song. Taylor Swift has been know as the girl who dates many men, there was even a shirt that had to be pulled from Abercrombie & Fitch store because it said \"More boyfriends than TS.\" Taylor Swift switched to a commercial pop sound starting with her album \"Red\" back in 2012.\n\nHer lead single from her 2014 album \"1989\" was \"Shake It Off\" and referenced how she doesn't care about the critics. \"Blank Space\" was a commercial success; she satirizes herself and it lyrically was about how she is a psycho ex-girlfriend and how she has many relationships.\n\nWe can flashback at 2009 from when she was dissed by Kanye West in favor of Beyonce at the VMA's. She referenced the VMA stint her 2016 Grammy Speech for when she won album of the year and caused a whole argument between Kayne and Kim Kardashian West. Kanye has also referenced her as \"I made that B*tch famous\" in his song.\n\nTaylor is also controversial for being a \"fake feminist\" and how she has \"white privilege.\"\n\nTaylor also had a fight with Calvin Harris and how she didn't want him to work with Katy Perry; she was revealed to be a ghostwriter for Rihanna's and Calvin Harris' hit \"This is what you came for\" in 2015.\n\nShe also had a feud with Katy Perry \"supposedly\" over backup dancers and she referenced her in her hit single \"Bad Blood.\"\n\nThen there is her feud with Miley Cyrus where Taylor has this sense that she is morally superior than Miley Cyrus because she twerked half-naked. It is ironic because Miley Cyrus only dated 3 people during her whole \"Bangerz\" album era and is back with the one of them who is her first love, while Taylor Swift has had more boyfriends than her.\n\nTaylor's 2017 started off strong because Katy, Lady Gaga, Miley Cyrus, and Katy Perry had weak commercial success; there was no one to compete against Taylor on the music charts. She sold over 1+ million copies of her album. So far, her singles have been failures and I feel that if she doesn't change her music production next time around, then she will end up like Katy Perry.\n\nControversies only work when the performer has catchy music dominating during that time of said controversy, and it only works once. Madonna was no longer as controversial following her album \"BedTime Stories\" because the songs did not receive success and thus no one cared what Madonna did anymore.\n\nRavelle Nobre on November 17, 2017:\n\nMadonna is more commercially successful than Cyndi, but Cyndi is more talented than Madonna as a singer, songwriter and actress. Quantity is not synonymous with quality. Madonna selling more or being more famous than Cyndi does not make Madonna artfully superior to Cyndi. Cyndi is a more talented artist than Madonna.\n\nHi on October 31, 2017:\n\nTaylor Swift is so comparable to Madonna, but isn’t as deliberately controversial or careless in her writing. Taylor Swift has such huge success but is an actual good person who doesn’t ONLY want fame.\n\nLT Wright (author) from California on October 22, 2017:\n\nsweety,\n\nI beg to differ. Madonna absolutely did exploit her sexuality and while she became more artistic later in her career, her early music was very focused on the charts. I don't think that's necessarily a bad thing. You can make chart focused music that's still great. And overall her music was great. Cyndi simply didn't care for the charts and didn't care if the music she made would reach #1 or not.\n\nsweety on October 21, 2017:\n\nwhat a bunch of horse manure... they're both talented but to say Madonna didnt care about artistry and exploited her sexuality for press... bunch of nonsense. they're both artistic and with things to say, they're different... madonna's made more of an impact bc she was ballsy enough to go against societal standards cos her main goal was to subvert hypocritical morals. cyndi is great cos she's a great musician but a different thing altogether.\n\nMissJanis on October 15, 2017:\n\n27 - Madonna\n\n410 - Lauper\n\nhttp://www.acclaimedmusic.net/Current/Madonna.htm\n\nHarry Glucksberg on October 14, 2017:\n\nWell I was there and nearing middle age when I saw Cyndi ... and my wife was an even bigger fan. About a year later, along comes a guttersnipe calling herself Madonna---and my wife and I both said she was stealing Cyndi's sound, costumes, onstage persona, everything. Madonna had the crazy stamina and the moxy to even steal Cyndi's trademark squeaks.\n\nMadonna had to copy Cyndi's turn as a movie star (Cyndi in the hilarious cult classic VIBES; Madonna in the silly and lifeless DESPERATELY SEEKING SUSAN. Madonna was a Cyndi Lauper copycat for as long as she needed to be....\n\nDon't tell me these two are equals. Cyndi rules, and she always will. Madonna will always just represent the gold-digging media-whore, as far as I'm concerned. Cyndi is a true artist, composer and trendsetter. And Cyndi will always be more beautiful than Madonna!\n\ndes on October 08, 2017:\n\nto me its not about how the a musical artist/singer presents herself or looks. what is important is the music. you either like the music or you don't. thats all there is to it. why bash a good singer just because how she looks. I for one favor Cyndi Laupers songs over Madonna any day. Dong get me wrong Madonna is a good singer but I Just think Cyndi is a lot better. and she seems to mean every word she sings, where Madonna on the other hand is just singing words for fame and the words means nothing to her. In the end it is all about the voice. and truly Cyndi should had made it bigger than she did in my opinion. My only regret is that I never had the chance to see her perform in person.\n\nRayca01 on May 12, 2017:\n\nI'm not sure why all the deep analysis for pop stars, but here's my take. Cyndi was a bit obnoxious back then and the whole wrestling thing made her look like she was bouncing off of walls. Her manager was also a wrestling manager. That was his line of business. They put her in the ring with other wrestlers and made her look cheap and vulgar. So she didn't have good management from the gitgo. Madonna (and Cyndi) were on the cusp of the MTV/video era. Madonna had that dancing experience for basically her whole life, so she was able to add some stylish choreography for those vids. Madonna was really in the right place at the right time. 'Like a Virgin' really was the cannonball for her. She rose straight up from that. It was a song that was peddled to Cher, actually, but she didn't want it. Madonna fell in love with that song. However, this whole business of reinventing herself (to me) is just a change of costume and story for each video. That's what her concerts are too. Four acts with different story lines. Just another bunch of videos. Also, please know that after a few years (I think 5), she felt she needed a manager that would catapult her career and keep it there. That's when she met MJ's manager. That's when the real history was made. King of Pop and Queen of Pop. It's not a stretch to see that her whole career is based on good management. No, great management. They are the only two pop stars in history that have ever achieved the kind of success they have enjoyed. They both had the same management. Period. Cyndi didn't have any of that going on. End.Of.Story.\n\nDavid on January 31, 2017:\n\nThere always seems to be two at a time, Madonna & Cyndi; Debbie Gibson and Tiffany, Britney and Christina, Katy Perry and Taylor, Miley and Selena. I think Lady Gaga was penned as the next Madonna, but Madonna had other ideas and saw her off. I think the difference between the two is that you can see Madonna's influences clearer, Debbie Harry, Bananarama, Chrissy Hynde etc, Cyndi less clear. If anyone is the new Madonna it is Beyoncé, taking elements from all her peers, combining with a baseline of Tina and Janet Jackson.\n\nErik on January 30, 2017:\n\nAs a man (boy in the 80's), Madonna was a treat for the eyes. Cindy just looked dirty.\n\nLola on January 28, 2017:\n\nGaga has talent. Something the other girls can't relate to.\n\nLT Wright (author) from California on November 28, 2016:\n\nChristian,\n\nThese aren't backhanded compliments. They're objective observations. For me, I like their music equally. But it's obvious that Madonna did what it took to succeed in the mainstream while Cyndi didn't. I don't believe it's wrong to want to be a huge artist or a legend. But there's no doubt artistry has to take a backseat when someone wants to be a pop music phenomenon.\n\nChristian on November 27, 2016:\n\nI think there's many back-handed \"compliments\" about Madonna in this article. More than a mere spotter of trends, Madonna is a phenomenally gifted songwriter and artist, always finding something new to say, always consistently good regardless of who she works with. And Madonna has certainly chased her muse as much as the best of artists - there's barely a genre of music she hasn't dabbled in. Rather than a trend spotter, I'd argue she is a bold risktaker whose gambles almost always pay off (except for American Life's war protest / folktronica). And she's the only artist who has had the stamina for a 30+ year career in the spotlight, with no breakdowns, no rehab and no playing the victim, even when the media and the public have been out for her blood. A legend of our times!\n\nLT Wright (author) from California on November 19, 2016:\n\nJustice,\n\nMadonna is definitely an artist. I meant true artist in the sense that she wouldn't have released music that wouldn't have been big on the charts.\n\nJustice on November 11, 2016:\n\nSaying Madonna isn't an artist is wrong. She is an artist. She cared and still cares about her music. She was involved in music making and was willing to experiment.\n\nJust because she is a great business woman, doesn't mean there is no artistic integrity.\n\nShe was good with trends. Not that she followed them, but she could have always sensed what will be huge.\n\nJj on October 27, 2016:\n\nI have problem with your definition of success. Madonna is a business, a perfect example of chasing the emptiness of fame and money. Cyndi and other artists are following their muse and found fame and $$$ along the way.\n\nArtist of the Century on May 11, 2016:\n\nArtist of the Century\n\nJessie on April 24, 2016:\n\nI think both women are amazing! But when Madonna release her album in 1985 with Like A Virgin she became an instant Megastar. Even Cyndi can't match the \"True Blue\" album as Madonna's third. Whilst her (Cyndi) is deminishing in the 80s era alone. I think this concrete the statement of the author why Cyndi fails and Madonna became the \"Artist of the Century\" of the 80s alone which made MJ furious :)\n\nLT Wright (author) from California on April 15, 2015:\n\nAntonio,\n\nI know she was involved in wrestling years ago. I don't know if she's still doing anything like that.\n\nANTONIO on April 15, 2015:\n\nAnd about the choice of Cyndi for wrestling what do you think ?\n\nGreetings from Italy\n\nLT Wright (author) from California on April 14, 2015:\n\nThanks Antonio. Cyndi did have health problems that delayed her albums. It definitely wasn't a choice and it shows how outside factors can influence someone's career direction.\n\nANTONIO on April 14, 2015:\n\nBeautiful analysis! add other observations: about the look I do not think that was less attractive lauper madona, rather I think the look of Madonna was more feasible to dress, how to prepare the lauper it would take a day!\n\nI think the lauper has weighed negatively wrestling in his image, and finally about to break album was unfortunately affects health problems.\n\nC E Clark from North Texas on October 23, 2014:\n\nInteresting analysis and a good read. A shame women have to go to the lengths that Madonna and Miley have to promote their work. I think it's demeaning them and their audience demeans itself by expecting, requiring, and watching that sort of thing. It's more of a freak show than musical talent. People are so shallow . . .\n\nI couldn't answer your poll because I don't really care about either of them.\n\nLT Wright (author) from California on July 17, 2014:\n\nAlina,\n\nIt's true that lots of young people listen to older artists. But most singers are in their teens or early 20's when they have their first hit and then their fans tend to grow up with them. Once those singers hit their early to mid 30's the next generation of teens will have moved onto the next group of young artists that break out. Radio is often reluctant to play songs from artists past the age of 35 because younger audiences find them harder to relate to.\n\nAlina on July 16, 2014:\n\nI don't think age matters. there have been 20 something year old artist who were who did not become famous. and there is young people who enjoy artist who are past 30. nikki minaj for example. and 24 is a grown adult too so I don't get how that makes someone relatable to a teenager. that's more like justin beiber who was only 15 when he started.\n\nLT Wright (author) from California on July 14, 2014:\n\nTreavor,\n\nYou must have missed this part:\n\n\"However, Cyndi is far from being a failure. She has worldwide record sales of 50 million and she has won Grammy, Emmy, and Tony awards, which is a rare feat.\"\n\nBut she is often seen as a \"failure\" in comparison to Madonna. I don't necessarily think this but their different career trajectories are often presented that way.\n\nTreavor on July 13, 2014:\n\nI don't get how you call Cyndi a failure when she is still in the industry and your still writing about her.\n\njonthe1 on July 12, 2014:\n\nMadonna can't sing ,Cyndi can.\n\nkons on July 05, 2014:\n\nMadonna's success it's a unique accomplishment...And that's bc Madonna's career/song/artistic existence has meanings (the right meaning at the right time)...No other artist had any kind of meaning (they were just singers who sang just songs) or if they later had, Madonna had it first. Madonna dared to speak about things that were huge taboos at the time, giving to people the chance to think. That's the reason. Beside that Madonna has a unique artistic way to pass these meanings to the people through her voice, her moves, her looks, her face.\n\nLT Wright (author) from California on May 04, 2014:\n\nBut,\n\nI didn't mean Madonna clones in terms of musicians. I meant there were a lot of fans dressing like Madonna but far fewer dressing like Cyndi. She didn't have an image young girls found appealing. I don't see Gaga being as big as Madonna but she isn't going away either.\n\nBut on May 04, 2014:\n\nNo one was a Madonna clone in the 80s they all copied Debbie Harry and Madonna did too. other than that great article !\n\nI think Gaga could have been a new Madonna if she didn't waste all her ideas at once. but she won't end up like Cyndi because her fanbase is just too big and too devoted (yet somehow can't seem to get her new album to platinum).\n\nRayca on March 17, 2014:\n\nReally well said. It seems like maybe the music execs. may know what's best. You have creative control, you don't sell records. The execs. know what sells. Really nice article.\n\nLT Wright (author) from California on February 04, 2014:\n\nTim,\n\nYes, Madonna is considered to be the queen of pop and had a huge influence on female pop stars like Lady Gaga and Katy Perry.\n\nTim on February 04, 2014:\n\nThat is why Madonna is reigned Queen of Music..but I still love Cyndi Lauer she was great in her time...\n\nLT Wright (author) from California on February 04, 2014:\n\nHector Ponce Cortegana,\n\nShe really does. No one spots trends like Madonna. I can't even think of someone who matches her in today's music scene.\n\nHector Ponce Cortegana on February 03, 2014:\n\nMadonna has been with us for such a long time and she really knows what and how to do it!. Madonna will never stop making music.\n\nLT Wright (author) from California on January 30, 2014:\n\nJoel,\n\nCyndi has definitely held onto her fame in terms of having respect and being able to continue to put out music and do plays and the like. Yet I think she doesn't have the downsides of fame that Madonna experiences from being too well known. It's great that you got to meet her multiple times and that she's so accessible.\n\nJoel on January 29, 2014:\n\nI love both.. I actually got to meet Cyndi twice and I've seen her 3 times. Madonna is \"too big\" to actually ever meet. Although since Kinky Boots Cyndi Lauper has gotten more of her fame back. Let's hope for a brand new album to help her out more.... oh and a collab ... how amazing would that be with the two of them on the stage singing TOGETHER.\n\nLT Wright (author) from California on October 18, 2013:\n\nNed,\n\nI do think the big breaks were a big factor. You can be forgotten very quickly.\n\nNed on October 18, 2013:\n\nMadonna was always a presence on the 80's and 90's music scene. Cyndi wasn't. I think long breaks were a huge factor in her fading over time.", "images": ["https://images.saymedia-content.com/.image/t_share/MTc0OTkxODYxMjQzNDU0OTE2/why-madonna-succeeded-where-cyndi-lauper-failed.jpg", "https://images.saymedia-content.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:eco%2Cw_620/MTc0MTM4OTA0MzYwNzg5Mjc3/the-freddie-mercury-final-performance-with-queen-knebworth-park-1986.jpg", "https://images.saymedia-content.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:eco%2Cw_620/MTkyNzY4NjU1NDUxMjM1NzAw/underrated-guitar-brands.jpg", "https://images.saymedia-content.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:eco%2Cw_620/MTkyODQwNzU4ODI1MzI5ODg1/the-origin-of-bagpipes.jpg", "https://images.saymedia-content.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:eco%2Cw_620/MTkyNjgyMTE0MDA3NzA0NjA1/who-sang-it-best-deck-the-halls.jpg", "https://images.saymedia-content.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:eco%2Cw_620/MTc0OTkwOTA3MjIzOTA5ODI4/gibson-sg-vs-les-paul-whats-the-difference-and-which-is-better.jpg", "https://images.saymedia-content.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:eco%2Cw_620/MTkyODQwNzU3NzUxNTg4NTYw/songs-with-friends-in-the-lyrics.jpg", "https://images.saymedia-content.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:eco%2Cw_620/MTkyNzc2MTQwNzczOTI2NjA4/the-top-scottish-bands-of-all-time-15-of-the-best.jpg", "https://images.saymedia-content.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:eco%2Cw_620/MTczODg1NjMyNTU1MjYzODQx/to-die-for-murder-ballads.jpg", "https://images.saymedia-content.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:eco%2Cw_620/MTkwNzEyNjU2NDg1NzU0ODA2/songs-about-scars-and-wounds.jpg", "https://images.saymedia-content.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:eco%2Cw_620/MTgxODQ3NjgyMTIwMTY0NDgz/pop-rock-and-country-songs-about-oklahoma.jpg", "https://images.saymedia-content.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:eco%2Cw_620/MTkyODQwNzU3NzUxNTg4NTYw/songs-with-friends-in-the-lyrics.jpg", "https://images.saymedia-content.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:eco%2Cw_620/MTkxMTM3ODU3OTgwMTQ3MDU0/20-best-chinese-songs-for-parties.jpg", "https://images.saymedia-content.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:eco%2Cw_620/MTkyODExMDAzNTYwMzM5MTUy/the-very-best-heavy-rock-bands-from-switzerland-15-alpine-giants-of-sound.jpg", "https://images.saymedia-content.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:eco%2Cw_620/MTg1NTAyMDAyNDMwNjgyMjcz/the-beatles-let-it-be-special-edition-super-deluxe-box-set-review.jpg", "https://images.saymedia-content.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:eco%2Cw_620/MTg3OTk1MjMxNDgyODgxODM0/songs-with-ghost-in-the-title.jpg", "https://images.saymedia-content.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:eco%2Cw_620/MTkyNzg5NzQ4MDM1NjI2NzA0/best-metal-guitar-for-beginners.jpg", "https://images.saymedia-content.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:eco%2Cw_620/MTczOTcyNjQ1MzcxNDU0Nzcx/5-how-to-play-piano-and-make-beautiful-music-with-flexibility-excersises.jpg", "https://images.saymedia-content.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:eco%2Cw_620/MTg4MzA4MzMyOTg4MDgxMTY2/the-many-faces-of-acdc-album-review.jpg", "https://images.saymedia-content.com/.image/t_share/MTc3NzE3Nzk2NzI0MDI0OTM2/why-madonna-succeeded-where-cyndi-lauper-failed.jpg", "https://images.saymedia-content.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:eco%2Cw_620/MTkyNzQ2MzQyNTU5MjYxODk2/retro-metal-review-iron-maiden-the-x-factor-1995.jpg"], "top_img": "https://images.saymedia-content.com/.image/t_share/MTc0OTkxODYxMjQzNDU0OTE2/why-madonna-succeeded-where-cyndi-lauper-failed.jpg", "keywords": [], "authors": ["Lt Wright"], "canonical_link": "https://spinditty.com/genres/Why-Madonna-Succeeded-Where-Cyndi-Lauper-Failed", "title": "Why Madonna Succeeded Where Cyndi Lauper Failed", "meta_data": {"author": "LT Wright", "description": "Madonna and Cyndi Lauper appeared on the music scene around the same time. Both were huge, but their singing careers took very different paths. Why did Madonna succeed while Cyndi failed?", "keywords": "Genres,Pop", "section": "Genres", "sub-section": "Pop", "pagetype": "article", "companies": "why-madonna-succeeded-where-cyndi-lauper-failed; why-madonna-succeeded-where-cyndi-lauper-failed", "robots": "max-image-preview:large", "item-id": "ci026b25872001277c", "published": "2013-10-14T20:34:13Z", "modified": "2021-12-02T22:38:44Z", "dcterms.rightsHolder": "The Arena Media Brands, LLC and respective content providers on this website. HubPages® is a registered trademark of The Arena Platform, Inc. Other product and company names shown may be trademarks of their respective owners. The Arena Media Brands, LLC  and respective content providers to this website may receive compensation for some links to products and services on this website.", "dcterms.dateCopyrighted": 2022, "twitter": {"card": "summary_large_image", "url": "https://spinditty.com/genres/Why-Madonna-Succeeded-Where-Cyndi-Lauper-Failed", "image": "https://images.saymedia-content.com/.image/t_share/MTc0OTkxODYxMjQzNDU0OTE2/why-madonna-succeeded-where-cyndi-lauper-failed.jpg", "description": "Madonna and Cyndi Lauper appeared on the music scene around the same time. Both were huge, but their singing careers took very different paths. Why did Madonna succeed while Cyndi failed?", "domain": "spinditty.com"}, "og": {"type": "article", "url": "https://spinditty.com/genres/Why-Madonna-Succeeded-Where-Cyndi-Lauper-Failed", "title": "Why Madonna Succeeded Where Cyndi Lauper Failed", "description": "Madonna and Cyndi Lauper appeared on the music scene around the same time. Both were huge, but their singing careers took very different paths. Why did Madonna succeed while Cyndi failed?", "image": "https://images.saymedia-content.com/.image/t_share/MTc0OTkxODYxMjQzNDU0OTE2/why-madonna-succeeded-where-cyndi-lauper-failed.jpg", "site_name": "Spinditty"}, "fb": {"app_id": 555602214614331}, "p": {"domain_verify": "d8e9d7f62e95e4bd9dc9bb31992e1144"}, "pinterest-rich-pin": "true", "apple-mobile-web-app-title": "Spinditty", "parsely-title": "Why Madonna Succeeded Where Cyndi Lauper Failed - Spinditty", "parsely-link": "https://spinditty.com/genres/Why-Madonna-Succeeded-Where-Cyndi-Lauper-Failed", "parsely-image-url": "https://images.saymedia-content.com/.image/c_fill%2Ccs_srgb%2Cfl_progressive%2Ch_400%2Cq_auto:eco%2Cw_620/MTc0OTkxODYxMjQzNDU0OTE2/why-madonna-succeeded-where-cyndi-lauper-failed.jpg", "parsely-post-id": "ci026b25872001277c", "parsely-pub-date": "2013-10-14T20:34:13Z", "parsely-section": "Genres", "parsely-author": "LT Wright", "parsely-tags": "Genres,Pop", "sailthru.title": "Why Madonna Succeeded Where Cyndi Lauper Failed", "sailthru.image.full": "https://images.saymedia-content.com/.image/t_share/MTc0OTkxODYxMjQzNDU0OTE2/why-madonna-succeeded-where-cyndi-lauper-failed.jpg", "sailthru.date": "2013-10-14T20:34:13Z", "sailthru.author": "LT Wright", "sailthru.tags": "Genres,Pop", "sailthru.description": "Madonna and Cyndi Lauper appeared on the music scene around the same time. Both were huge, but their singing careers took very different paths. Why did Madonna succeed while Cyndi failed?", "phx": {"content-item-id": "ci026b25872001277c", "content-object-type": "ContentArticle", "exclusive-content-type": "free", "site-keyword": "spinditty"}, "viewport": "width=device-width, initial-scale=1", "referrer": "unsafe-url", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-mobile-web-app-capable": "no", "apple-mobile-web-app-status-bar-style": "black", "format-detection": "address=no", "generator": "Tempest - maven.io", "pinterest": "nohover"}, "movies": [], "publish_date": 1381782853.0, "source": "http://spinditty.com", "summary": ""}