{"url": "https://www.essence.com/celebrity/jesse-williams-minka-kelly-dating/", "text": "Antonio de Moraes Barros Filho\n\nNew couple alert! Jesse Williams and Minka Kelly are dating, a source confirms to PEOPLE. “They’re having a good time together,” adds the source of the pair, who are currently working on a video game together. The news comes three months after Grey’s Anatomy star Williams officially split from wife Aryn Drake-Lee. Williams filed for divorce on April 11, according to documents obtained by PEOPLE. The actor first met Drake-Lee, a real estate broker, while working as a schoolteacher in New York. The pair wed in September 2012 after more than five years of dating. Williams and Drake-Lee are currently in court regarding the custody agreement over their two young children: daughter Sadie, 3, and son Maceo, who was born in 2015. Williams, 35, addressed the split — and rumors of infidelity — in JAY-Z‘s short film Footnotes for 4:44, a visual accompaniment to the rapper’s new album, which was released Monday, according to E! News . Without mentioning his ex by name, the father of two subtly referenced the rumors and revealed how difficult the split was. “I was in a relationship 13 years, 13 real years, not 5 years, not 7 years — 13 years,” he said. “All of a sudden motherf—ers are writing think-pieces that I somehow threw a 13-year relationship.” “Like, the most painful experience I’ve had in my life with a person I’ve loved with all of my heart — that I threw a person and my family in the trash because a girl I work with is cute,” he continued. Most recently, Kelly, 37, sparked romance rumors last fall after being spotted in Cabo San Lucas, Mexico, with Wilmer Valderrama, to whom she was briefly linked in 2012. Kelly, however, has maintained the two never actually dated in the past. “He’s not my ex,” she told Power 106 last September. “We are good friends, and we always have been. It’s funny, this whole ‘back with my ex’ thing. We’re not exes!” “It sucks when stories that aren’t true are made up, you know?” she added. “Look, if it’s true and it’s out, then it’s true and it’s out. When it’s not true and it’s out is when it’s really frustrating. You just have to find the comedy in all of it.” Ultimately, the actress acknowledged media scrutiny of her personal life is par for the course. “I think it comes with the territory,” she said. “It’s a small price to pay for the extraordinary life that I live.”", "images": ["https://www.essence.com/wp-content/uploads/2020/02/rgb-TAG-Registered-80px.png", "https://secure.gravatar.com/avatar/?s=96&d=mm&r=g", "https://www.essence.com/wp-content/uploads/2017/05/1493215813/Jesse%20Williams_0-900x600.jpg", "https://www.essence.com/wp-content/uploads/2017/05/1493215813/Jesse Williams_0.jpg?width=400"], "top_img": "https://www.essence.com/wp-content/uploads/2017/05/1493215813/Jesse%20Williams_0-900x600.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.essence.com/celebrity/jesse-williams-minka-kelly-dating/", "title": "Jesse Williams and Minka Kelly Are Dating: 'They're Having a Good Time Together,' Says Source", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "The actor has reportedly moved on.", "og": {"locale": "en_US", "type": "article", "title": "Jesse Williams and Minka Kelly Are Dating: 'They're Having a Good Time Together,' Says Source", "description": "Jesse Williams and Minka Kelly Are Dating: 'They're Having a Good Time Together,' Says Source", "url": "https://www.essence.com/celebrity/jesse-williams-minka-kelly-dating/", "site_name": "Essence", "image": "https://www.essence.com/wp-content/uploads/2017/05/1493215813/Jesse%20Williams_0-900x600.jpg"}, "article": {"publisher": "https://www.facebook.com/essence", "modified_time": "2020-10-26T17:35:14+00:00", "opinion": "false", "content_tier": "free"}, "twitter": {"card": "summary_large_image", "title": "Jesse Williams and Minka Kelly Are Dating: 'They're Having a Good Time Together,' Says Source", "image": "https://www.essence.com/wp-content/uploads/2017/05/1493215813/Jesse Williams_0.jpg", "site": "@essence", "label1": "Est. reading time", "data1": "2 minutes"}, "generator": "WordPress 6.0.2", "fb": {"pages": 68771922854}, "msapplication-TileImage": "https://www.essence.com/wp-content/uploads/2018/04/cropped-essence-fav-icon-270x270.png"}, "movies": [], "publish_date": null, "source": "https://www.essence.com", "summary": ""}