{"url": "https://www.brides.com/story/stevie-wonder-wedding-tomeeka-robyn-bracy", "text": "When Sophie Turner and Joe Jonas met through mutual friends in 2016, they kept most of their relationship out of the private eye. But things started to change after Joe put a ring on it just one year after getting together! From their adorable Manhattan strolls to their crazy epic Vegas wedding, here is everything you need to know about the Queen of the North and her boy band beau.\n\nSophie Turner and Joe Jonas began dating in 2016, after being introduced by mutual friends. In 2017, Joe proposed to Sophie with a $150,000 diamond ring.\n\nThe couple tied the knot during a surprise Las Vegas ceremony after the 2019 Billboard Music Awards—and thanks to Instagram live, fans saw the whole thing!\n\nThey hosted a more formal wedding celebration in France a few months later and took not one, but two envy-inducing honeymoons.\n\nIn July 2020, they welcomed their first child together, a daughter named Willa!\n\nNovember 5, 2016: The First Kiss\n\nThe Game of Thrones actress and DNCE frontman were first linked when a fan spotted them snuggling (and kissing!) at a Kings of Leon concert in Rotterdam ahead of the MTV Europe Music Awards in 2016.\n\nJanuary 1, 2017: An Insta-Official Couple\n\nThe couple presumably rang in the new year together in Miami and Sophie made their relationship Instagram-official when she posted a photo of Joe smoking a cigar on her account. Safe to say the world went wild.\n\nMarch 6, 2017: Front Row for Fashion Week\n\nGetty Images\n\nA few months after going public with their relationship, the pair touched down in Paris for fashion week. They were spotted walking through Charles de Gaulle Airport hand in hand and attended shows together throughout the trip.\n\nMay 1, 2017: No Pictures!\n\nWhile both Joe and Sophie attended the 2017 Met Gala, they did not pose together on the red carpet (cue tears!). The couple did, however, attend the Marc Jacobs after party together following the gala. We are still waiting on cute couple pics from inside the event, Jophie!\n\nJuly 5, 2017: Sophie Is Smittent\n\nIn Marie Claire UK's August 2017 cover story, Sophie revealed some precious information about her relationship with Joe. \"I am very happy,\" she told the outlet. And, when asked if her beau was romantic she responded with, \"Ummmm, yeah…\" Sounds like she knew he was the one from the start!\n\nSeptember 2, 2017: Puppy Parents\n\nGetty Images\n\nAfter almost one year of dating, the pair took a serious step together—they adopted a puppy! Sophie shared a sweet shot of the siberian husky on Instagram, writing, “Meet the newest addition to the krew.” They named him Porky Basquiat Jonas and even created an Instagram account for the pup! If handling a joint Instagram account for your dog isn’t love then we don’t know what is.\n\nOctober 15, 2017: She Said Yes!\n\nWhile we're not sure exactly how the proposal went down, we do know Sophie was caught off-guard. Joe proposed with a pear-shaped, megawatt diamond on a double band, studded with stones, which set him back an estimated $150,000. The newly-engaged couple shared the news via Instagram, posting identical photos on their accounts with the captions, \"I said yes,\" and \"She said yes.\"\n\nCelebrities were quick to congratulate the happy couple including Joe's brothers, Nick and Kevin, and Sophie's Game of Thrones co-star Maisie Williams.\n\nNovember 4, 2017: Engagement Celebrations\n\nA few weeks after Joe popped the question, the duo celebrated their new relationship status with a lavish party at Manhattan restaurant Mamo. Of course, the engagement party included a star-studded guest list, boasting the likes of Ansel Elgort, director Justin Ervin, Ashley Graham, Tom Holland and model Georgia Fowler.\n\nApril 16, 2018: Puppy Parents—Part Two\n\nLooks like one pup just wasn't enough for this couple! In April 2018, Sophie and Joe adopted another husky and lovingly named him Waldo Picasso Jonas. And, just like his big brother, Waldo got his own Instagram account, too!\n\nOctober 28, 2018: Joe \"Sansa Stark\" Jonas\n\nCourtesy of Instagram/@joejonas\n\nIn 2018, Joe redefined the whole \"couple's costume\" concept by instead dressing up as his fiancèe for Halloween. Complete with a red wig and turquoise velvet dress, Joe killed the costume game with his take on Sophie's Game of Thrones character Sansa Stark. Instead of returning the favor and dressing up as Joe for the holiday, she chose a cuddly elephant costume. Honestly, we never thought the Queen of the North and an elephant would look so good together!\n\nFebruary 14, 2019: The Sweetest V-Day Surprise\n\nAhead of Sophie's 23rd birthday on February 21, Joe served up major fiancé goals by throwing his future wife a surprise Valentine's Day birthday party. There were millions of balloons, rounds of shots, and even a steamy makeout sesh. Basically, your Valentine's Day could never.\n\nMay 1, 2019: A Little White Wedding Chapel Wedding\n\nGetty Images\n\nThanks to Diplo, the world saw Joe and Sophie get hitched in real-time when the DJ put the entire surprise ceremony on Instagram live. After the couple attended the Billboard Music Awards in Las Vegas, they gathered all their A-list friends (Khalid, Dan + Shay, and the Jo Bros to name a few) and said \"I do\" in the little white wedding chapel, Elvis impersonator and all. Sophie opted for a chic bridal jumpsuit by Bevza and the two exchanged candy Ring Pops. Following the surprise nuptials, the newlyweds hosted an after-party at their hotel and celebrated by jumping into the hot tub fully clothed.\n\nMay 6, 2019: Matching at the Met\n\nGetty Images\n\nLess than a week after they got hitched in Vegas, the newlyweds hit the 2019 Met Gala pink carpet in coordinating Louis Vuitton by Nicolas Ghesquière looks. Sophie paired her colorful jumpsuit with electric blue eyeshadow and glitter hair gel. This was the couple's first time ever attending the Met Gala together, though they had both been to the event on their own in the past.\n\nMay 30, 2019: A Wild Bachelor Weekend\n\nDespite already being a married man, Joe threw a bachelor party on a yacht in Ibiza. Later, Joe and his brothers appeared on The Tonight Show Starring Jimmy Fallon where Fallon asked Kevin and Nick about the wildest part of Joe's bachelor party. The brothers revealed that the cops were called on them three times, Joe ripped off two of his friend's shirts at the club, and he somehow made a headband out of a 1942 tequila box. Sounds like an unforgettable weekend to us!\n\nJune 10, 2019: Bachelorette in Benidorm\n\nIn June it was Sophie's turn to have some bachelorette party fun! She, along with co-star/BFF/MOH Maisie Williams and friends, hit the Spanish town of Benidorm to celebrate. The group feasted on McDonald's aboard a private plane, threw themselves a wig party and even partied in matching grey sweatsuits!\n\nJune 20, 2019: A Wedding Is Coming\n\nGetty Images\n\nSophie and Joe spent the week leading up to their second nuptials in Paris with family and friends. They shopped along Avenue Montaigne, shared a sweet smooch in front of the Eiffel Tower, hit the streets with their pal Wilmer Valderrama and his new girlfriend, Amanda Pacheco, and hosted a scenic lunchtime boat tour along the river Seine with Priyanka Chopra and Nick Jonas. No cold feet here!\n\nJune 29, 2019: A South of France Bash\n\nAfter their week-long Parisian rendezvous, the couple took their wedding festivities to the south of France where they wed in a gorgeous 18th-century French château (that you can book on Airbnb!). The venue was completely done up in elegant white flowers and glass candles cascading down the aisles—quite the opposite of their very camp Vegas nuptials. The night before, the couple hosted a rehearsal dinner where guests were asked to wear white while they wore red.\n\nJuly 3, 2019: Mr. and Mrs. Jonas\n\nA week after they said \"I do\" in France, the pair finally shared an official wedding photo with the world, writing, \"Mr. and Mrs. Jonas.\" The photo, taken by photographer Corbin Gurkin, showed a smiling Sophie and Joe exiting their wedding ceremony and also revealed details of Sophie's Louis Vuitton bridal gown, which featured lace sleeves, a plunging neckline, an embroidered bodice and a full skirt with a wide belted sash at the waist.\n\nJuly 14, 2019: Honeymoon in the Maldives\n\nFor a casual $10,000, the pair honeymooned in the Maldives. They stayed in an overwater bungalow complete with a waterslide and ate sushi on the beach. Ah, wedded bliss!\n\nJuly 15, 2019: Honeymoon in Italy\n\nBecause one honeymoon isn't enough—especially after two weddings—the couple jetted off to Italy. There they lounged on a yacht and jet skied along the Positano coast. Staying in the bridal spirit, Sophie was photographed wearing an all-white bathing suit as she hung out with her hubby.\n\nFebruary 12, 2020: Baby of the North\n\nOn February 12, 2020, JustJared reported that the couple is expecting a baby! \"The couple is keeping things very hush hush but their friends and family are super excited for them,” a source told the site.\n\nJuly 22, 2020: Their First Daughter Is Born\n\nWhile Joe and Sophie never publicly acknowledge their pregnancy, the pair officially welcomed their daughter on July 22, 2020. According to several reports, the new parents named her Willa.\n\nJune 29, 2021: 2nd Wedding Anniversary\n\nJoe and Sophie celebrated two years of marriage with some adorable, never-before-seen photos from their special day in Paris. Sophie posted a black-and-white photo of her and Joe walking hand-in-hand down the aisle.\n\n\"2 years as your wife, holy moly, I love you, bub,\" she captioned the photo. The musician also posted a rare photo of the two dancing together on their wedding day. Joe is smiling big as he lowers his wife in a dip. With her eyes closed in the photograph, Sophie appears to be soaking up the moment.\n\n\"The best two years of my life. Love you @sophiet,\" the Jonas Brother captioned the photo.\n\nMay 4, 2022: Another Baby Is on the Way\n\nIn an interview with Elle UK, Sophie confirmed that she and Joe were expecting their second child together. “It’s what life is about for me, raising the next generation,” she told the publication. “The greatest thing in life is seeing my daughter go from strength to strength. We’re so excited to be expanding the family. It’s the best blessing ever.”\n\nJuly 14, 2022: Baby Number Two\n\nThe couple welcomed their second daughter together. “Joe and Sophie are happy to announce the arrival of their baby girl,” their reps tell People. The pair has yet to reveal their baby’s name.", "images": ["https://www.brides.com/thmb/JfJzSNhz61dWOsmgqy6FF8dlas8=/1725x0/filters:no_upscale():max_bytes(150000):strip_icc()/sophie-joe-billboard-5f2b7fc5281c4efeadf67dcf45eb9718.jpg", "https://www.brides.com/thmb/RkzIB7GPW0VuxhUwHY81aq1CdyE=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/DominikBindlGetty-a134d1a5300f48a0be6b23e5ef832627.jpg", "https://www.brides.com/thmb/uZ_DWK0b0qHhmB_mSKGcgIx5NPs=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/scarlettandcolinlead-131fd63b489841a49625aefe5577d358.jpg", "https://www.brides.com/thmb/NsTRPRnKWJzrOby7g9E9Ue76qoU=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/kourtney-and-travis-square-aab09d5abb6941439103fcdc0ed5f9c3.jpg", "https://www.brides.com/thmb/Q414DIZBOeX3eexTddIONSf27QE=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/priyanka-nick-cover-photo-d0814b635cd44e1fb6bf6cca4f1b3b53.jpg", "https://www.brides.com/thmb/CpScQR7dZKa7dgURvBl7FdJNsP4=/200x200/filters:no_upscale():max_bytes(150000):strip_icc()/DSC03763-54bce324f1bd48f5af0910efb178cb7e.jpg", "https://www.brides.com/thmb/tylqxKSs4z54koxfUlIixEG9IMw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():gifv()/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__5cd0d8e1254167737e821517__11-5b71710d962641c9959f545ea3ffe0c0.jpeg", "https://www.brides.com/thmb/Us2PMmRlHkJX1DkeEOApih4efOA=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-12022131331-40875f8f4dba41c39b74a3f73ea775c9.jpg", "https://www.brides.com/thmb/0m-XTWxie5R-mzu-Zl50uuynNZw=/1725x0/filters:no_upscale():max_bytes(150000):strip_icc()/sophie-joe-paris-before-wedding-031b8a14d3474be7b61cd83e5bc9adf0.jpg", "https://www.brides.com/thmb/HRnH7dr-1In8Pe4lQqOaqtpza6k=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1205194042-7563933ffffa44caa0f765ae09294db6-6c5145a8cc7a431fbb821b5025f0adb3.jpg", "https://www.brides.com/thmb/80x_hwykBxclI0g_9TfkQn-HjQ8=/1725x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__brides__public__brides-services__production__2018__10__28__5bd6247be4aa8665630e7c3c_Screen20Shot202018-10-2820at205.03.0220PM-94397775aef04ab3a76262da776ee3f4.png", "https://www.brides.com/thmb/NunCZ6jHg8NBXzDZ4fgeXFtI5Ec=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__brides__public__brides-services__production__2019__04__08__5cab9c3ba44ead4f4475b16e_marc-jacobs-wedding-bella-hadid-gigi-hadid-8de6478604554e218cc289797fb6eca7-4b68c4a907694fd1a2d40a888efc2c86.jpg", "https://www.brides.com/thmb/G1y_P_m3hQRdoj0kht4lNp45viQ=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1127280677-92be3ed93eab4d17b23e137ce6f2897c.jpg", "https://www.brides.com/thmb/8YWl03KEa5887z0RqHNSEia1XMM=/1725x0/filters:no_upscale():max_bytes(150000):strip_icc()/sophie-turner-joe-jonas-walking-dog-37aa0d267bce4ba5a23b39e9099857eb.jpg", "https://www.brides.com/thmb/tjyggHEfOWusy8-MRkTHLwMHOu0=/1725x0/filters:no_upscale():max_bytes(150000):strip_icc()/sophie-joe-met-gala-2019-768c4ddb17044f25a8844a9c7a6e0682.jpg", "https://www.brides.com/thmb/rU67Vt-0Kg-m1ajq8i7cWQziTqI=/4000x4000/filters:fill(auto,1)/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__5cd0d8e1254167737e821517__11-5b71710d962641c9959f545ea3ffe0c0.jpeg", "https://www.brides.com/thmb/Li1kBA-C0W7Kiuxqo1RVtG6KAZA=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1169491940-58c564809e4143f2962beff47ecedc12.jpg", "https://www.brides.com/thmb/eCNpw-yxqjj9x09HMPYieJvWDu8=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1267433253-e0603460e85d4648922ce5fafcd71806.jpg", "https://www.brides.com/thmb/NjByaK9SnDE1YylHxPAV6BsWYwk=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-918665014-9336284d493c439b9109c1a527f9b3d7.jpg", "https://www.brides.com/thmb/Mp91LeN4l550hcIMRYWL-CU2muU=/1725x0/filters:no_upscale():max_bytes(150000):strip_icc()/sophie-joe-paris-fashion-week-fe4c1f4dad844622af03833145ae325b.jpg", "https://www.brides.com/thmb/u69TaftmXaIQUzfu20giPKPVJpY=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/square-e13d660eb43a4549a562bb613f0ac1c9.jpg", "https://www.brides.com/thmb/PrvGOUfQFaF4ON04jBpebv6u47Q=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/recirc2-58d2367f54f5495a8d9d7746c95f0180.jpg", "https://www.brides.com/thmb/WeKer0LQ7goA-m5DAq1BrBKEwpA=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1096668774-a91019006bc1456d92635300cc5b64c6.jpg", "https://www.brides.com/thmb/mJJ4JX5BvTnVZD4p4AMh6S4Btuc=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1179298993-016de42ca11d4a25b911999cb8a7db1f.jpg", "https://www.brides.com/thmb/LtHsY7jqTQ_1mTVxaAWyI5zC334=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/square-c6db00789e9f43de8a3adf5a57dd7487.jpg"], "top_img": "https://www.brides.com/thmb/rU67Vt-0Kg-m1ajq8i7cWQziTqI=/4000x4000/filters:fill(auto,1)/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__5cd0d8e1254167737e821517__11-5b71710d962641c9959f545ea3ffe0c0.jpeg", "keywords": [], "authors": ["Maggie Kreienberg", "Maggie Kreienberg Is An Editor At", "Brides'S Editorial Guidelines"], "canonical_link": "https://www.brides.com/sophie-turner-and-joe-jonas-relationship-timeline-4769440", "title": "Sophie Turner and Joe Jonas’s Relationship Timeline", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Here is everything you need to know about actress Sophie Turner and singer Joe Jonas's relationship.", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "BRIDES", "sailthru.author": "Maggie Kreienberg", "sailthru.tags": "news,celebrity-and-royal-weddings", "article": {"section": "Brides"}, "fb": {"app_id": 785196361567992}, "og": {"type": "article", "site_name": "Brides", "url": "https://www.brides.com/sophie-turner-and-joe-jonas-relationship-timeline-4769440", "title": "Sophie Turner and Joe Jonas Welcome Their Second Daughter Together", "description": "Here is everything you need to know about actress Sophie Turner and singer Joe Jonas's relationship.", "image": "https://www.brides.com/thmb/rU67Vt-0Kg-m1ajq8i7cWQziTqI=/4000x4000/filters:fill(auto,1)/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__5cd0d8e1254167737e821517__11-5b71710d962641c9959f545ea3ffe0c0.jpeg"}, "twitter": {"card": "summary", "site": "@Brides", "title": "Sophie Turner and Joe Jonas Welcome Their Second Daughter Together", "description": "Here is everything you need to know about actress Sophie Turner and singer Joe Jonas's relationship.", "image": "https://www.brides.com/thmb/rU67Vt-0Kg-m1ajq8i7cWQziTqI=/4000x4000/filters:fill(auto,1)/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__5cd0d8e1254167737e821517__11-5b71710d962641c9959f545ea3ffe0c0.jpeg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.230.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.230.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.230.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.230.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.230.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://www.brides.com", "summary": ""}