{"url": "https://www.cinemablend.com/news/2314722/why-a-wrinkle-in-time-reminds-oprah-of-the-wizard-of-oz", "text": "Ava DuVernay is set to bring a classic literary tale to life in March when the Selma director's take on A Wrinkle in Time finally hits the big screen. The book is a must-read for many children, but it seems that Oscar-nominee Oprah Winfrey had never actually read it before her casting as Mrs. Which. That said, she was still able to find a way to connect with the narrative by drawing from another beloved tale. In fact, during a visit to the set of A Wrinkle in Time last year, Oprah opened up about the film's story and explained the various parallels that she sees it share with The Wizard of Oz, saying:\n\nI never read it as a kid, so I just discovered it when Ava started talking about it, but for me, it's like doing The Wizard of Oz for a new generation. It is a spaced-out Oz, with Meg as the new Dorothy, and I am Glinda! [laughter] Mrs. Which is a combination, for me, of Glinda the Good Witch and Maya Angelou, so I hear both of them in my head as I'm speaking, and I cannot tell you how aligned I think this film is. I do not think of it as a kid's film. I think of it as a film for generations to come, and will live on in the wisdom empowerment energy field for people in the same way as Oz has.\n\nOprah Winfrey never read A Wrinkle in Time as a child, but it's obvious that she was able to make some thematic and narrative connections between this story and another classic childhood story. Between the ideas of young female heroes (whether it's Meg Murry or Dorothy), witches, and an adventure to a mystical realm, there are numerous elements from A Wrinkle in Time that seem to parallel The Wizard of Oz's classic story. Moreover, both have a timeless sensibility to their narratives in the sense that, while both definitely appeal to children, neither can be wholly classified as just a children's film and both will likely endure for generations to come.\n\nOf course, despite the similarities between A Wrinkle in Time and The Wizard of Oz, it's still worth mentioning that numerous elements of Ava DuVernay's story will help it stand on its own. One such quality is the emphasis on sci-fi over fantasy (or, \"spaced-out Oz,\" as Oprah called it), as A Wrinkle in Time deals heavily in the concept of interdimensional travel and the nature of the cosmos. Beyond that, during the same visit to the set last year, Ava DuVernay herself opened up and emphasized the fact that A Wrinkle in Time will lean heavily into the darker elements from the book and feel distinct from other films produced under the Disney banner -- though it's also worth mentioning that Oz does play to similar, horror-esque story elements.\n\nFor those of you who are looking for a closer look at A Wrinkle in Time, make sure to check out a trailer for the upcoming film, below!\n\nTickets for Ava DuVernay's A Wrinkle in Time will go on sale tomorrow (February 22), and make sure to watch out for the sci-fi adventure when it debuts in theaters next month on March 9!", "images": ["https://www.cinemablend.com/media/img/missing-image.svg", "https://cdn.mos.cms.futurecdn.net/UQKxFkPigRJMuPCKVDuyzd-1200-80.jpg", "https://vanilla.futurecdn.net/cinemablend/media/img/missing-image.svg", "https://cdn.mos.cms.futurecdn.net/UQKxFkPigRJMuPCKVDuyzd-320-80.jpg"], "top_img": "https://cdn.mos.cms.futurecdn.net/UQKxFkPigRJMuPCKVDuyzd-1200-80.jpg", "keywords": [], "authors": ["Conner Schwerdtfeger", "Window.Slicecomponents", "Window.Reliabledomcontentloaded.Then", "Var Componentcontainer", "Document.Queryselector", "Slice-Container-Authorbio", "If Componentcontainer", "Var Data", "Layout", "Default"], "canonical_link": "https://www.cinemablend.com/news/2314722/why-a-wrinkle-in-time-reminds-oprah-of-the-wizard-of-oz", "title": "Why A Wrinkle In Time Reminds Oprah Of The Wizard Of Oz", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "pub_date": "2018-02-21T17:12:14+00:00", "description": "CinemaBlend visited the set of Ava DuVernay's A Wrinkle in Time last year, and Mrs. Which actress Oprah Winfrey opened up about the interesting similarities the film shares with The Wizard of Oz.", "robots": "max-image-preview:large", "msapplication-TileColor": "#000000", "msapplication-TileImage": "https://cdn.mos.cms.futurecdn.net/flexiimages/tbhqzd9bso1619422461.png", "og": {"site_name": "CINEMABLEND", "image": {"identifier": "https://cdn.mos.cms.futurecdn.net/UQKxFkPigRJMuPCKVDuyzd-1200-80.jpg", "width": 1200}, "type": "article", "title": "Why A Wrinkle In Time Reminds Oprah Of The Wizard Of Oz", "url": "https://www.cinemablend.com/news/2314722/why-a-wrinkle-in-time-reminds-oprah-of-the-wizard-of-oz"}, "article": {"publisher": "https://www.facebook.com/cinemablendnews/", "published_time": "2018-02-21T17:12:14Z", "modified_time": "2018-02-21T17:12:14Z"}, "parsely-type": "post", "parsely-post-id": "8T8ChDR4btm8KFpa9dWK2d", "parsely-pub-date": "2018-02-21T17:12:14Z", "parsely-title": "Why A Wrinkle In Time Reminds Oprah Of The Wizard Of Oz", "parsely-link": "https://www.cinemablend.com/news/2314722/why-a-wrinkle-in-time-reminds-oprah-of-the-wizard-of-oz", "parsely-image-url": "https://cdn.mos.cms.futurecdn.net/UQKxFkPigRJMuPCKVDuyzd.jpg", "parsely-section": "Movies", "parsely-tags": "Category: Movies,Category: News,A Wrinkle In Time,oprah winfrey,ava duvernay,serversidehawk,videoarticle", "parsely-author": "Conner Schwerdtfeger", "twitter": {"card": "summary_large_image", "site": "@cinemablend", "title": "Why A Wrinkle In Time Reminds Oprah Of The Wizard Of Oz", "creator": "@cinemablend", "image": "https://cdn.mos.cms.futurecdn.net/UQKxFkPigRJMuPCKVDuyzd-1200-80.jpg", "account_id": 9696142}, "google-site-verification": "Oo3uNFWgI6psN58Pjx7Zjo3yYih1rOwQViWbItBCpyo", "taboola": {"url": "https://www.cinemablend.com/news/2314722/why-a-wrinkle-in-time-reminds-oprah-of-the-wizard-of-oz"}, "botify-site-verification": "2pzcQZFibLjk9GJgSZgweA8MU9al6utA", "msvalidate.01": "CC462E6DF91492086145CA5EBDCB615E"}, "movies": [], "publish_date": 1519233134.0, "source": "https://www.cinemablend.com", "summary": ""}