{"url": "https://www.elitedaily.com/entertainment/celebrity/sarah-hyland-dominic-sherwood-broke-up/2048595", "text": "Another day, another celebrity breakup. According to reports, Sarah Hyland and Dominic Sherwood reportedly broke up after two years of dating. Hyland is one of the stars of ABC's Modern Family and Sherwood is one of the stars of Freeform's Shadowhunters. Fans are wondering: Why did Sarah Hyland and Dominic Sherwood break up? Elite Daily reached out to both Hyland and Sherwood's teams for comment, but did not hear back by time of publication.\n\nAccording to Entertainment Tonight, Hyland and Sherwood's relationship had just run its course. A source told People, \"They aren't dating anymore but they're still in contact and want to remain friends.”\n\nHey, I get that. Relationships don’t always end dramatically. Sometimes, you’re feeling great with your partner for a long time, and then things just fizzle out. It doesn't mean it was a bad relationship, or that you weren’t right for each other while you were together. It's just over now. But their fans sure are going to miss them!\n\nHyland and Sherwood first met when they co-starred in Vampire Academy back in 2014. By the time they went public with their relationship in March 2015, they didn’t hold back when it came to letting the world know they were together. Case in point: The two were seen kissing at a Lakers game in Los Angeles, leaving no room to doubt that they were very much a thing.\n\nThroughout the two-year relationship that followed, Hyland and Sherwood would post pictures of each other on their respective Instagrams all the time. However, Hyland hasn't posted anything about Sherwood since April 15, and Sherwood hasn't posted anything about Hyland since April 22, so maybe that was the first hint their split was on the horizon.\n\nOf course, Instagram posts realistically have nothing to do with the status of any given relationship, but that's just about the only indication fans have had that these two were going to call it quits. Before their Instagrams became rather bae-less, Hyland and Sherwood had celebrated their two-year anniversary in February 2017. Hyland posted about the anniversary on Instagram with a caption that read, \"Happy 2 year to my #1 @domsherwood.\"\n\nAround that same time, Sherwood talked about his love for Hyland in an interview with ET. In the interview, he said, “Sarah makes me want to be a better version of myself. That's what I love most about her. She inspires me to be the best version of me.”\n\nWhen Hyland joined the cast of Shadowhunters earlier in the summer of 2017, it seemed Sherwood couldn’t have been more excited to have her on board.\n\n“Everyone fell in love with her on set. It was a real joy,” he said. “She's been coming in since season one, coming to visit me. Having her on set as an actress was just phenomenal.”\n\nAt this point, it's unclear why Hyland and Sherwood broke up, but it was wonderful while it lasted!\n\nThis post was originally published on Aug. 18, 2017. It was updated on Sept. 5, 2019.", "images": ["https://imgix.bustle.com/elite-daily/2017/08/18122446/sarah-hyland-dominic-sherwood.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2022/10/8/742f4b12-81bc-46ab-b55f-daca4ed685ca-image.jpg?w=138&h=138&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.6413&fp-y=0.3014", "https://imgix.bustle.com/uploads/getty/2022/10/8/5613fe57-3daa-4a55-a3f5-b4cf5ed43fec-getty-1243606260.jpg?w=138&h=138&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.5253&fp-y=0.4101", "https://imgix.bustle.com/uploads/getty/2022/10/8/4e8798bb-b99d-4ec4-af4a-8b62d04a4927-getty-1395076942.jpg?w=138&h=138&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.5&fp-y=0.3412", "https://imgix.bustle.com/elite-daily/2017/08/18122446/sarah-hyland-dominic-sherwood.jpg?w=374&h=187&fit=crop&crop=faces&auto=format%2Ccompress", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1"], "top_img": "https://imgix.bustle.com/elite-daily/2017/08/18122446/sarah-hyland-dominic-sherwood.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/entertainment/celebrity/sarah-hyland-dominic-sherwood-broke-up/2048595", "title": "Sarah Hyland And Dominic Sherwood Reportedly Broke Up, So Love Is Dead", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image", "creator": "@kellixboyle"}, "article": {"publisher": "https://www.facebook.com/EliteDaily"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/entertainment/celebrity/sarah-hyland-dominic-sherwood-broke-up/2048595", "type": "article", "title": "Sarah Hyland And Dominic Sherwood Reportedly Broke Up, So Love Is Dead", "description": "Another day, another celebrity breakup. According to reports, Sarah Hyland and Dominic Sherwood reportedly broke up after two years of dating. Hyland is one of the stars of ABC's Modern Family and Sherwood is one of the stars of Freeform's…", "image": {"identifier": "https://imgix.bustle.com/elite-daily/2017/08/18122446/sarah-hyland-dominic-sherwood.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "Another day, another celebrity breakup. According to reports, Sarah Hyland and Dominic Sherwood reportedly broke up after two years of dating. Hyland is one of the stars of ABC's Modern Family and Sherwood is one of the stars of Freeform's…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}