{"url": "https://www.washingtonpost.com/news/post-politics/wp/2016/01/02/donald-trump-featured-in-new-jihadist-recruitment-video/", "text": "A recruitment video released by the Somali-based al-Qaeda affiliate al-Shabab includes a clip of Republican presidential candidate Donald Trump calling on the United States to bar Muslims. (Video: Monica Akhtar/The Washington Post)\n\nGift Article Share\n\nLast month, The Washington Post reported that white nationalists have begun using Republican presidential candidate Donald Trump as a recruitment tool. Now, the polarizing Republican presidential front-runner has become the recruitment fodder for another group of marginalized extremists. Wp Get the full experience. Choose your plan ArrowRight A propaganda video released by the Somali-based al-Qaeda affiliate al-Shabab includes a clip of Trump calling on the United States to bar Muslims from entering the country, according to news reports. Trump made the statement following the Islamic State-inspired shootings in San Bernardino, Calif., last month.\n\nThe video was produced to look similar to a documentary and calls upon African Americans to join a holy war against the United States, according to the BBC.\n\nClaiming the United States is a hotbed of racial inequality, police brutality and anti-Muslim sentiment, the film is an indictment of U.S. race relations and also includes historical civil rights-era footage of Malcolm X, an unnamed white supremacist and African Americans in prison, according to CNN.\n\n3) New #Shabaab vid shows #Trump proposing Muslim travel ban & Awlaki predicting bigotry & \"concentration camps\" pic.twitter.com/2KMpzYf3ui — Rita Katz (@Rita_Katz) January 1, 2016\n\nThe clip showing Trump, the BBC noted, arrives 10 minutes into the 51-minute propaganda video.\n\nAdvertisement\n\nOn either side of the Trump footage, NBC reported, are clips of Anwar al-Awlaki, the late al-Qaeda recruiter, urging Muslims in the United States to move to Islamic countries or wage war against the West at home. A U.S. citizen, al-Awlaki was killed in a drone strike carried out in Yemen in 2011.\n\n“Yesterday, America was a land of slavery, segregation, lynching and Ku Klux Klan, and tomorrow, it will be a land of religious discrimination and concentration camps,” Awlaki can be heard saying in recorded footage.\n\nHe adds: “The West will eventually turn against its Muslim citizens.”\n\nThe al-Kataib Media Foundation released the video on Twitter on Friday, according to NBC.\n\nTrump’s campaign did not immediately respond to requests for comment. But Saturday afternoon, news of the video did nothing to dim the ardor of supporters gathering for his rally in Biloxi, Miss. They began lining up seven hours before the candidate was scheduled to speak, and they utterly rejected the premise that Trump was providing grist for propagandists.\n\nAdvertisement\n\nSome wondered whether the video was real. More insisted that the al-Qaeda affiliate was attacking Trump out of fear.\n\n“ISIS, Al-Shabaad, al-Qaeda, all those groups — they don’t want Trump in office,” said Richard Coyne, 52, an Army veteran from nearby Gulfport, who retired last year. “They want the status quo, which is unfortunately pro-ISIS, pro-Al-Qaeda, pro-Muslim.” ISIS is another name for the extremist group Islamic State.\n\nSarah Anderson, 57, of Hattiesburg, also an Army veteran who had once worked at the checkpoint at the Berlin Wall, said that any terrorist group that cited Trump was doing so because it is “scared to death of him.”\n\n“He’s a threat to them,” she said. “That’s the opposite of promoting what the terrorists want.”\n\nSome voters were unaware of the video but well aware that Democratic presidential candidate Hillary Clinton had warned of Trump’s rhetoric being promoted to recruit terrorists. Tom Simmons, a 68-year-old Vietnam War veteran from nearby Vancleave, was reminded of a time 45 years ago when liberals worried so much about winning hearts and minds that they did not do what was necessary for victory.\n\nAdvertisement\n\n“I can’t comprehend anything that the Democrats say,” Simmons said. “The terrorists fear Trump right now. They’re going to do anything they can to make him look ridiculous and sound ridiculous.”\n\nIn controversial remarks made after the San Bernardino attack, Trump called for “a total and complete shutdown of Muslims entering the United States until our country’s representatives can figure out what the hell is going on.”\n\nThe propaganda video includes that line, but bleeps out the word “hell,” according to CNN.\n\nIn the wake of the Paris attacks, Trump said he would “strongly consider” shutting down some mosques and heavily surveilling others.\n\n“I would hate to do it, but it’s something that you’re going to have to strongly consider because some of the ideas and some of the hatred — the absolute hatred — is coming from these areas,” Trump said in an interview on “Morning Joe.”\n\nRepublican presidential candidate Donald Trump is saying Democratic candidate Hillary Clinton lied about him at Saturday's debate and is demanding an apology. (Video: ABC News/NBC News)\n\nThe video arrives on the heels of several heated exchanges between Trump and Hillary Clinton, in which Clinton has claimed Trump’s language aids jihadists.\n\nAdvertisement\n\n“If you go on Arabic television, as we have, and you look at what is being blasted out — video of Mr Trump being translated to Arabic,” Clinton said at an Iowa town hall last month. “ ‘No Muslims coming to the United States,’ other kinds of derogatory, defamatory statements — it is playing into the hands of the violent jihadists.”\n\nTrump’s comments, Clinton added, “lights an even bigger fire for them to make their propaganda claims through social media and in other ways.”\n\nTrump responded to Clinton’s assertion by calling her “a liar.”\n\n“It’s just another Hillary lie,” Trump said on NBC News’s “Meet the Press” late last month. “She’s a liar, and everybody knows that.”\n\nDavid Weigel contributed to this report from Biloxi, Miss.\n\nMORE READING:\n\nGiftOutline Gift Article", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=http://img.washingtonpost.com/rf/image_908w/2010-2019/Wires/Videos/201512/Reuters/Images/2015-12-16T184629Z_1_OV3E3SBMN_RTRMADC_0_USA-ELECTION-TRUMP-GOLF_155_x_252.jpg&w=1440"], "top_img": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://img.washingtonpost.com/rf/image_908w/2010-2019/Wires/Videos/201512/Reuters/Images/2015-12-16T184629Z_1_OV3E3SBMN_RTRMADC_0_USA-ELECTION-TRUMP-GOLF_155_x_252.jpg&w=1440", "keywords": [], "authors": ["Peter Holley"], "canonical_link": "https://www.washingtonpost.com/news/post-politics/wp/2016/01/02/donald-trump-featured-in-new-jihadist-recruitment-video/", "title": "Donald Trump featured in new jihadist recruitment video", "meta_data": {"description": "The video includes a clip of Trump calling on the United States to bar Muslims from entering the country", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/post-politics/wp/2016/01/02/donald-trump-featured-in-new-jihadist-recruitment-video/", "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://img.washingtonpost.com/rf/image_908w/2010-2019/Wires/Videos/201512/Reuters/Images/2015-12-16T184629Z_1_OV3E3SBMN_RTRMADC_0_USA-ELECTION-TRUMP-GOLF_155_x_252.jpg&w=1440", "title": "Donald Trump featured in new jihadist recruitment video", "description": "The video includes a clip of Trump calling on the United States to bar Muslims from entering the country"}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Donald Trump featured in new jihadist recruitment video", "description": "The video includes a clip of Trump calling on the United States to bar Muslims from entering the country"}, "last_updated_date": "2021-11-26T08:04:28.611Z", "article": {"published_time": "2016-01-02T18:35:05.000Z", "modified_time": "2021-11-26T08:04:28.611Z", "section": "Politics", "content_tier": "metered"}, "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1", "next-head-count": 71, "apple-itunes-app": "app-id=352509417, app-argument=https://www.washingtonpost.com/news/post-politics/wp/2016/01/02/donald-trump-featured-in-new-jihadist-recruitment-video/"}, "movies": [], "publish_date": 1451692800.0, "source": "https://www.washingtonpost.com", "summary": ""}