{"url": "http://gunnarpeterson.com/keeping-fit-with-the-kardashians/", "text": "[custom_headline type=”left” level=”h5″ looks_like=”h5″]Meet the man who trains Kim – and can give YOU her but[/custom_headline]\n\nPublished on: The Sun\n\nSTRIDING into his Beverly Hills gym at 4.30am, trainer Gunnar Peterson is faced with a perfect reminder of why he gets up in the dark each day – a giant naked photo of Kim Kardashian.\n\nOiled and toned, the framed snap shows Kim at her pneumatic best and is accompanied by a handwritten note of thanks to Gunnar for her “best body yet”.\n\nThe celebrity fitness guru has been training Kim since she was 19 – and he’s clear about where her priorities lie.\n\n[image type=”none” float=”none” src=”https://secureservercdn.net/166.62.112.107/9bq.ea6.mwp.accessdomain.com/wp-content/uploads/2015/04/Gunnar-Peterson1_2260979a.jpg” alt=”Gunnar Peterson invites The Sun into his gym.” title=”Gunnar Peterson invites The Sun into his gym.” info=”popover” info_place=”top” info_trigger=”hover” lightbox_caption=”Gunnar Peterson invites The Sun into his gym. ©Rupert Thorpe” info_content=”©Rupert Thorpe”]\n\n“My brief with Kim is to showcase her curves, not whittle them away,” he says.\n\n“She’s never been one to say, ‘I want that girl’s body, her butt, arms’. She says, ‘I want my own to be this way.’\n\n“You’ve got to put on your seatbelt and buckle up when you are going round those curves.\n\n[image type=”none” float=”none” src=”https://secureservercdn.net/166.62.112.107/9bq.ea6.mwp.accessdomain.com/wp-content/uploads/2015/04/Kim-K-INF2_2260988a.jpg” alt=”Kim Kardashian works out at the beach” title=”Kim Kardashian works out at the beach” info=”popover” info_place=”top” info_trigger=”hover” info_content=”©INFphoto.com” lightbox_caption=”Kim Kardashian works out at the beach. ©INFphoto.com”]\n\n“We make sure we don’t sand down the edges by doing big movements – squats, kettle bell swings, dead lifts – that accentuate her assets.”\n\nGunnar’s gym is not huge and the pricey equipment is packed in tight. But there’s just enough room for his key workout tool – a HUMMER.\n\nThe bright yellow monster sits at the entrance to the gym and Gunnar attaches battle ropes to the bars at the front for one of Kim’s favourite workout moves – the beatdown.\n\n[image type=”none” float=”none” src=”https://secureservercdn.net/166.62.112.107/9bq.ea6.mwp.accessdomain.com/wp-content/uploads/2015/04/Gunnar-Peterson6_2260985a.jpg” alt=”Gunnar demonstrates beatdowns” title=”Gunnar demonstrates beatdowns” info=”popover” info_place=”top” info_trigger=”hover” lightbox_caption=”Gunnar demonstrates beatdowns”]\n\nThe scene is straight out of a Hollywood movie and it’s clear why so many stars have Gunnar on speed dial – he takes exercise seriously but makes it fun.\n\nKim comes to Gunnar five times a week and surprisingly he describes her as one of his hardest workers.\n\n[image type=”none” float=”none” src=”https://secureservercdn.net/166.62.112.107/9bq.ea6.mwp.accessdomain.com/wp-content/uploads/2015/04/Gunnar-Peterson3_2260982a.jpg” alt=”Gunnar poses in his Beverly Hills workout studio” title=”Gunnar poses in his Beverly Hills workout studio” info=”popover” info_place=”top” info_trigger=”hover” info_content=”©Rupert Thorpe” lightbox_caption=”Gunnar poses in his Beverly Hills workout studio. ©Rupert Thorpe”]\n\nHe says: “Kim is hardcore. She does not whine or complain, she just comes in ready to work and she doesn’t stop.\n\n“Kim drives for an hour each day to get here for 7am and she does that because it’s a priority for her. I have other clients who live two minutes away and cancel twice a week.”\n\n[image type=”none” float=”none” src=”https://secureservercdn.net/166.62.112.107/9bq.ea6.mwp.accessdomain.com/wp-content/uploads/2015/04/Gunnar-Peterson4_2260983a.jpg” alt=”Gunnar shows our model the fly” title=”Gunnar shows our model the fly” info=”popover” info_place=”top” info_trigger=”hover” info_content=”©Rupert Thorpe” lightbox_caption=”Gunnar shows our model the fly. ©Rupert Thorpe”]\n\n“She’s really strong. You wouldn’t know it, but she can lift a lot of weight. She did 20 leg presses this morning lifting 300lb weights.”\n\nGunnar trains up to nine star clients a day, including Sylvester Stallone, Jennifer Lopez and Modern Family actress Sofia Vergara.\n\nHe got Angelina Jolie in the form of her life to play Lara Croft in Tomb Raider and helped Matthew McConaughey buff up as stripper Dallas in Magic Mike.\n\n[image type=”none” float=”none” src=”https://secureservercdn.net/166.62.112.107/9bq.ea6.mwp.accessdomain.com/wp-content/uploads/2015/04/social5_2260974a.jpg” alt=”Khloe poses by a signed photo of mum Kris at Gunnar’s studio” title=”Khloe poses by a signed photo of mum Kris at Gunnar’s studio” info=”popover” info_place=”top” info_trigger=”hover” info_content=”©Instagram” lightbox_caption=”Khloe poses by a signed photo of mum Kris at Gunnar’s studio. ©Instagram”]\n\nBut the biggest project in his life is surely the Kardashian clan.\n\nHe has trained every one of the family at some point, including Kris and Rob, but is adamant he treats each as an individual.\n\nHe says: “Kim, Kendall and Khloe have very different bodies. With Khloe we do a lot of stairs and side lunging, while with Kendall it’s upper body strength.\n\n“She is very athletic, very gifted athletically and picks up movements well.\n\n[image type=”none” float=”none” src=”https://secureservercdn.net/166.62.112.107/9bq.ea6.mwp.accessdomain.com/wp-content/uploads/2015/04/social1_2260980a.jpg” alt=”Kendall Jenner shows off her incredible form” title=”Kendall Jenner shows off her incredible form” info=”popover” info_place=”top” info_trigger=”hover” info_content=”©Instagram” lightbox_caption=”Kendall Jenner shows off her incredible form. ©Instagram”]\n\nGunnar is the man behind Khloe’s recent transformation from flab to fab.\n\nThe 30-year-old came to Gunnar for help following unflattering photos of her tummy in a bodycon dress last November.\n\n[image type=”none” float=”none” src=”https://secureservercdn.net/166.62.112.107/9bq.ea6.mwp.accessdomain.com/wp-content/uploads/2015/04/Klhoe-Kardashian-K_2261967a.jpg” alt=”Khloe was mocked for this bodycon dress” title=”Khloe was mocked for this bodycon dress” info=”popover” info_place=”top” info_trigger=”hover” info_content=”©pcn@barcroftmedia.com” lightbox_caption=”Khloe was mocked for this bodycon dress. ©pcn@barcroftmedia.com”]\n\nAnd Gunnar admits helping her shave off the pounds – by pulling a SLEDGElike a cart horse.\n\n“Sledge-pulling is a terrific movement for her. It’s a great resisted pull that drives the legs.\n\n[image type=”none” float=”none” src=”https://secureservercdn.net/166.62.112.107/9bq.ea6.mwp.accessdomain.com/wp-content/uploads/2015/04/social2_2260978a.jpg” alt=”Khloe shows off her new abs on Instagram” title=”Khloe shows off her new abs on Instagram” info=”popover” info_place=”top” info_trigger=”hover” info_content=”©Instagram” lightbox_caption=”Khloe shows off her new abs on Instagram. ©Instagram”]\n\n“You expend a ton of energy on resistance work and I make sure we do lots of moves with ropes and pulling sandbags too. Those are all big metabolic kicks.”\n\n“Khloe has put a lot of distance between her and the body she had in that dress.\n\n[image type=”none” float=”none” src=”https://secureservercdn.net/166.62.112.107/9bq.ea6.mwp.accessdomain.com/wp-content/uploads/2015/04/social4_2260975a.jpg” alt=”Khloe stops for a selfie at Gunnar’s gym” title=”Khloe stops for a selfie at Gunnar’s gym” info=”popover” info_place=”top” info_trigger=”hover” info_content=”©Instagram” lightbox_caption=”Khloe stops for a selfie at Gunnar’s gym. ©Instagram”]\n\n“Now she looks like she could handle whatever comes at her, whether it’s a night in 4in heels or a sprint in flats.”\n\nIt’s impossible to stay downbeat around Gunnar. Pacing around his gym, he’s full of energy. And his positive attitude is infectious.\n\nHe enthuses about all his clients – “Sofia kills it” and “J-Lo is 100% focused” – but saves his biggest compliments for the Kardashians.\n\n[image type=”none” float=”none” src=”https://secureservercdn.net/166.62.112.107/9bq.ea6.mwp.accessdomain.com/wp-content/uploads/2015/04/social3_2260977a.jpg” alt=”Khloe works out with Gunnar” title=”Khloe works out with Gunnar” info=”popover” info_place=”top” info_trigger=”hover” info_content=”©Instagram” lightbox_caption=”Khloe works out with Gunnar. ©Instagram”]\n\n“They are super pleasant,” he says. “I love them as people and their achievements.”\n\nGunnar describes how he went to Kim and Kanye’s opulent Hollywood home last week and the first thing Kim wanted to know was about his 10-year-old daughter Sloan.\n\nHe says: “I have other people I’ve worked with for years who couldn’t even tell you my kids’ names with a lot less going on than her.; But Kim genuinely cares.”\n\n[image type=”none” float=”none” src=”https://secureservercdn.net/166.62.112.107/9bq.ea6.mwp.accessdomain.com/wp-content/uploads/2015/04/social6_2260987a.jpg” alt=”Gunnar puts actress Chloe Moretz through her paces” title=”Gunnar puts actress Chloe Moretz through her paces” info=”popover” info_place=”top” info_trigger=”hover” info_content=”©Instagram” lightbox_caption=”Gunnar puts actress Chloe Moretz through her paces. ©Instagram”]\n\nSpeaking about his biggest success story to date, Gunnar refuses to take all the credit for Kim’s curves.\n\n“Kim’s body has changed because she’s done the work.\n\n[image type=”none” float=”none” src=”https://secureservercdn.net/166.62.112.107/9bq.ea6.mwp.accessdomain.com/wp-content/uploads/2015/04/social7_2260990a.jpg” alt=”Singer Ciara poses with Gunnar Peterson” title=”Singer Ciara poses with Gunnar Peterson” info=”popover” info_place=”top” info_trigger=”hover” info_content=”©Instagram” lightbox_caption=”Singer Ciara poses with Gunnar Peterson. ©Instagram”]\n\n“The celebrities who look great and say they do nothing are either lying, really young or they’re genetic freaks.\n\n“The ones who lie can’t admit to working out because they don’t want to seem narcissistic, but in reality they’re in the gym all day.”\n\nHere Gunnar shows Sun readers the top moves to get his star clients’ best assets.\n\n[custom_headline type=”center” level=”h4″ looks_like=”h4″ accent=”true”]To get Kim’s bum…[/custom_headline]\n\n[image type=”none” float=”none” src=”https://secureservercdn.net/166.62.112.107/9bq.ea6.mwp.accessdomain.com/wp-content/uploads/2015/04/Kim-K-Getty1_2260991a.jpg” info=”none” info_place=”top” info_trigger=”hover” info=”popover” info_place=”top” info_trigger=”hover” info_content=”©GettyImages”]\n\nIn true LaLa Land style, Gunnar uses a giant yellow Hummer for Kim’s workouts.\n\nBut you can just as easily use the Ford Focus parked in your driveway. No big deal.\n\nBeat-downs\n\n*Loop a set of battle ropes (Amazon or eBay sell them) through a bar (or the grille of a car)\n\n*Standing with your legs hip distance apart, lift both hands up high and slam the ropes down between your knees and squat at the same time.\n\n*Stand and repeat. Do between 10/20 reps, or until you cannot do anymore.\n\n*If you don’t have battle ropes you can use a garden hose or a twisted bed sheet.\n\nSingle leg squats\n\n*Holding onto a bar (or the front of your car), bend both knees and taking one bent leg behind you, gently tap the ground with your toe.\n\n*Place your foot back on the ground and repeat 10 times. Then switch sides.\n\nPlyometric jumps\n\n*Holding the bar (or car), bend both knees and bring your bum to the ground, then spring up high and back down into a squat position.\n\n*Do this eight times, or as many as you can do until your legs give out.\n\nWaves\n\n*Holding the rope in each hand, lift one hand and then the other as if you are banging a drum.\n\n*Do this for 30 seconds, working up to 60 seconds.\n\n[custom_headline type=”center” level=”h4″ looks_like=”h4″ accent=”true”]To get J-Lo’s abs…[/custom_headline]\n\n[image type=”none” float=”none” src=”https://secureservercdn.net/166.62.112.107/9bq.ea6.mwp.accessdomain.com/wp-content/uploads/2015/04/J-Lo-getty1_2260992a.jpg” info=”popover” info_place=”top” info_trigger=”hover” info_content=”©GettyImages”]\n\nGunnar says of Jen: “Something both Kim and J-Lo both do is workout with a poker face.\n\n“Nothing will break their concentration or focus. They’re both 100% committed to the work and that shows in their faces.”\n\nBall toss – Abs 1\n\n*Facing a wall, lie down on a mat with both knees bent and a large bouncy ball in both hands.\n\n*Sit up and throw the ball against the wall, then catch it on its return.\n\n*Lie back down and repeat. Repeat full movement ten times.\n\nBall toss – Abs 2\n\n*Repeat Abs 1, but on catching the ball, rotate your torso and tap the floor on your right and then your left side, making sure you twist your waist fully.\n\n*Repeat full movement ten times.\n\nBall toss – Abs 3\n\n*Staying in the same seated position, lift both feet off the ground and throw the ball directly from the chest to a partner and catch it back from them.\n\n*Repeat the full movement ten times.\n\n[custom_headline type=”center” level=”h4″ looks_like=”h4″ accent=”true”]To get Sofia Vergara’s boobs…[/custom_headline]\n\n[image type=”none” float=”none” src=”https://secureservercdn.net/166.62.112.107/9bq.ea6.mwp.accessdomain.com/wp-content/uploads/2015/04/Sofia-Vergara_1300_2261001a.jpg” info=”popover” info_place=”top” info_trigger=”hover” info_content=”©AP”]\n\nGunnar says of the Modern Family star: “Sophia’s extremely focused and works out alone, she doesn’t bring friends, not even (fiancé) Joe (Manganiello).”\n\nThe Fly\n\n*Lie down with your back on a bench wth your legs on the ground and holding 2.5lb dumbbells (or heavier if you can).\n\n*Draw your stomach in and down and open your arms wide.\n\n*Slowly bring your arms back in together as if you’re hugging an invisible overweight friend.\n\n*Repeat 10-12 times.\n\nTurkish sit-up\n\n*Still lying on the bench, stretch your arms straight above you, then sit up and reach to the ceiling and lie back down.\n\n*Do 8-15 reps depending on your choice of weight.\n\n*Hold the weights steady as if you are balancing a glass of red wine on top of each.\n\nLeg raises\n\n*Sit up straight on a stool, holding either side of it.\n\n*Raise your legs to knee level and raise both feet up to the ceiling then back down to knee height, not dropping them to the floor. This also works the lower abdomen.\n\nAdditional reporting: Emma Patterson", "images": ["https://secureservercdn.net/166.62.112.107/9bq.ea6.mwp.accessdomain.com/wp-content/uploads/2020/08/logo_main-100x100.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20800%20344'%3E%3C/svg%3E", "data:image/gif;base64,R0lGODlhAQABAIAAAP///wAAACH5BAEAAAAALAAAAAABAAEAAAICRAEAOw=="], "top_img": "https://secureservercdn.net/166.62.112.107/9bq.ea6.mwp.accessdomain.com/wp-content/uploads/2020/08/logo_main-100x100.png", "keywords": [], "authors": [], "canonical_link": "https://gunnarpeterson.com/keeping-fit-with-the-kardashians/", "title": "Keeping fit with the Kardashians – Gunnar Peterson", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "max-image-preview:large", "facebook-domain-verification": "l0nvziv1gqrmk8e55kzhrr1rn35zy8", "msapplication-TileImage": "https://secureservercdn.net/166.62.112.107/9bq.ea6.mwp.accessdomain.com/wp-content/uploads/2020/08/logo_main.png?time=1653402007"}, "movies": [], "publish_date": null, "source": "http://gunnarpeterson.com", "summary": ""}