{"url": "https://www.today.com/parents/40-last-minute-mother-s-day-gifts-she-ll-really-t90106", "text": "Mother's Day is quickly approaching — seriously, it's on Sunday. If you're still stressing about finding the perfect gift to show Mom just how much you love her, you still have some time.\n\nWhile some of you might not be able to hand-deliver your gifts on the big day, there are plenty of unique, thoughtful gifts that can be delivered to her doorstep. Whether she likes to relax with a glass of wine or enjoys a chic piece of jewelry, we have something for everyone.\n\nRead on for some of the best last-minute Mother's Day gifts that should be on your radar.\n\nLast-minute Mother's Day treats\n\nIf Mom isn't a big wine drinker or is known for trying new things, this non-alcoholic sparkling rosé will be a hit. According to the brand, they work with California winemakers to replicate the process but remove the alcohol without sacrificing the genuine taste. They also offer sparkling white, sauvignon blanc, rosé and pinot noir options.\n\nIf you want to kick it up a notch, you can save 20 percent off your total purchase including any sparkling bottle and a pack of cans with code MOTHERSDAY. For the truly last-minute shoppers in New York, San Francisco and Los Angeles, Surely will be offering same day and next-day delivery in those cities.\n\nIf she has a sweet tooth, she's bound to love this box filled with individually-wrapped brownie pieces from Columbus, Ohio-based Brownie Points. The basket includes a dozen Baby Brownies, 3 Brownie Bruffles and 1 BrowniEmoji in the shape of a sleeping eye mask.\n\nFor the popcorn-loving mom, you can personalize this pink tin with a photo or message of your choice to send some sweet words her way. Each tin is filled with the classic flavors — butter, cheese and caramel popcorn.\n\nIf she's not a fan of traditional bouquets, she might find this one irresistible! Surprise her with this bestselling cookie bouquet of 12 buttercream-frosted \"flowers\" that are delivered in a beautiful gift box.\n\nYou can never go wrong with chocolate, and this giant white chocolate fortune cookie is sure to be a gift that she'll never forget. It's covered in delicious sprinkles and edible florals and includes a personal fortune inside that is just as sweet as the gift itself.\n\nThis tin features Oreos dipped in two different kinds of Belgian chocolates: dark chocolate and white chocolate. Chocolate-coated candy pieces are also placed atop each cookie to resemble spring flowers.\n\nWant to send her a message just as sweet as it will taste? Customize these shortbread cookies with a date and message that means the most to her, and they might just look even better than they'll taste!\n\nSpice things up a little this year with upscale hot sauces from Truff. This white truffle edition is crafted from ripe chili peppers, agave nectar, white truffle and organic coriander, making it a delicious vegan-friendly addition to any meal.\n\nLast-minute Mother's Day jewelry\n\nNo matter what you call her — Mom, Mommy, Teta, Gigi or Nana — you can create a bracelet just for her. You can personalize it with up to nine characters on either a champagne or black base.\n\nThe message on the bracelet is almost as sweet as what it stands for. Each bracelet from the Little Words Project comes with a code that can be registered on its app or website so the recipient can join the Nice Girl Gang — an online community of women just like her who are dedicated to empowering each other.\n\nMonogrammed jewelry will never go out of style, and this disc necklace is perfect for the mom who prefers a subtle statement necklace for daily wear.\n\nChoose up to three special initials that she can keep close to her heart with this necklace. Each necklace also comes with a gift bag and a note card, so all you need to do is fill out your special message and send it her way.\n\nThis gold-plated necklace can be adorned with the letter of your choice to make it a stylish yet personal gift.\n\nThis dainty necklace is a subtle accessory that any mama will love.\n\nWhether she likes to garden or can simply appreciate a pretty piece of jewelry, this birth month flower necklace can combine both of her interests. Each necklace contains a real flower encased in resin that will last forever and is sure to land her some compliments.\n\nPay homage to your mom with a ring engraved with symbols that reference Aphrodite, goddess of love and beauty.\n\nA classic pair of hoops can elevate a basic outfit or complement a dressier one, and Mom will surely love this sparkly set from Jennifer Miller. To make the deal even sweeter for you, save 20 percent off pieces in the brand's Mother's Day Curated Collection with code TODAY20.\n\nLast-minute personalized Mother's Day gifts\n\nWhether she's a puzzle master or a jigsaw novice, she'll love this customizable piece. You can choose the design or image, and frame it once completed for a piece of decor that she will cherish forever. You can explore more custom puzzle options here.\n\nYou can choose the design or photo you know she'll love for this custom puzzle. It even comes in its own matching photo box to make storage easy.\n\nWhether she likes to soak up some sun at the beach or in the comfort of her own backyard, this towel will be essential. Choose the appropriate size and custom print for a gift she can start using this summer.\n\nA personalized addition to her kitchen counter, this monogrammed recipe box will help keep all of her culinary secrets in one place. Each box also comes with 48 recipe cards that match the design you choose so the chef can enjoy the way it looks almost as much as you'll enjoy the way the recipes taste.\n\nFor the fashionista, this palm leaf clutch is the perfect summer accessory. You can monogram it with her initials or personalize it with her name so she can keep all of the essentials at hand in a customized clutch.\n\nThis woven straw tote is the perfect bag for her to keep her valuables. It comes with a detachable magnetic card case and a spacious linen-lined interior to store everything she needs for a beach getaway, or just while running errands.\n\nLast-minute relaxing Mother's Day gifts\n\nThis wine holder is a bath time essential. Whether she prefers to sip pinot noir or chardonnay, her glass will always be within reach.\n\nIf she's in need of a break, you can have this chair delivered just in time for summer. The woven cotton gives it a boho feel and makes it comfortable enough to kick back and relax in while taking in some sun.\n\nThis luxury inflatable lounger from Venice Beach-based brand Funboy will make it easy for her to relax in the pool or in the backyard. How about both?\n\nIf a morning cup of coffee or tea is a must, this smart mug might be a step above her favorite ceramic mug. She'll be able to control the temperature of the mug from her phone, so she can enjoy a piping hot sip every time.\n\nLast-minute Mother's Day beauty gifts\n\nWhether she's into doing full glam or keeps it simple with a minimalist look, a quality mascara is a must-have in every makeup lover's beauty bag. This mascara comes in jet black and a new berry brown shade to lift the lashes and provide a lengthening effect.\n\nMom will appreciate anything that helps her take advantage of the opportunity to catch some zzz's (especially new moms). This satin sleep eye mask from Kitsch will arrive just in time for Mother's Day to help upgrade her night routine with a bit of accessible luxury.\n\nFor an at-home celebration, these affordable eye masks will help give her the ultimate gift — an at-home spa day. The masks are available in gold and rose gold shades, but each one is formulated to relieve the under-eye area and reveal smoother brighter skin.\n\nThis \"magazine\" will make sure she doesn't miss a single step in her skin routine. It contains a nourishing mask for nearly every part of the body, from her hair to her feet.\n\nWhether her skin care routine is a full-blown 11 steps or she simply enjoys a little pampering every now and then, this Mother's Day skin care set will be a treat for her complexion. It features the brand's \"Mirakle Cream\" and a limited edition of their collagen serum that will keep her skin glowing.\n\nIf her daily arm workout has long been her daily blowout, this hair dryer stand might make things a little bit easier. It comes with everything she'll need to put the holder into place, and hopefully make her daily routine simpler.\n\nWhether she prefers to treat herself to a pedicure in the bathroom or on the couch, this home pedicure kit makes it a more manageable task. It includes a pull-out tray, LED light and a foam pad to keep the nail polish bottle in its place, so she'll never have to strain for another DIY pedicure again.\n\nThis lighted vanity mirror doubles as a Bluetooth speaker, so she can listen to her favorite songs while she gets ready for the day. With vertical and horizontal rotation and the spot mirror that boasts 10 times magnification, it'll be a breeze for her to bring all of her looks to life.\n\nWhether she needs a place to store her makeup or skin care essentials, this adorable cosmetic bag from Vera Bradley will help her do it in style. Each bag is crafted from a soft cotton material and can even be personalized with a monogram of her initials or her name for a custom touch.\n\nLast-minute Mother's Day home gifts\n\nShe'll appreciate this cookbook full of ideas for when she's run out of them and doesn't want to work too hard on a meal but still have something delicious. This recent release has 150 recipes that will satisfy anyone's taste buds and is the no. 1 new release in Amazon's \"Cooking for One or Two\" section.\n\nFor the mom who enjoys spending her days experimenting in the kitchen with her favorite little sous chef, this matching apron set is sure to satisfy them both.\n\nPerfect for the mom with a green thumb, this book is full of bright and cheery notes that will bring a smile to her face. Between each page is a flower that flips up from the page, and when each flower in the book \"blooms,\" a vibrant bouquet is formed.\n\nIf she needs her daily cup of joe but wants to save on counter space, this single-serve coffee maker is the gift she's been waiting for. She'll have a fresh cup of coffee ready in minutes with this sleek device.\n\nBonsai trees make a beautiful gift, and this tree will already boast pink flowers, as it arrives in bud form. Upgrade your gift and add a wind-chime to complement this outdoor-dwelling plant.\n\nThese adorable candles are hand-poured in Vancouver, Canada, and boast an aroma just as delightful as they look.\n\nIf you've already got the wine holder on your list, upgrade her self-care bath with this caddy. It can hold all of the essentials she'll need for a bit of me-time and relaxation.\n\nLast-minute Mother's Day style gifts\n\nThis belt bag and its fleece counterpart from Lululemon have been TikTok favorites over the past year. It's perfect for the mom who's always on-the-go to fit essentials while still looking chic.\n\nWhether she's hitting the gym or just running errands, keep her comfortable and in style with these New Balance sneakers. They come in five colorways and are available in sizes 5-12 in standard and wide width. Bonus: Use code NBTODAY to save 15 percent on your purchase of select shoes sitewide.\n\nThese aren't any ordinary pair of readers. In fact, they are specially tinted to help block blue light emission from electronic devices. With all of the time we are spending behind screens, she'll be sure to appreciate you looking out for her.\n\nLet her know she's a \"super mom\" with these gift boxes from Happy Socks that are just as bold as they are adorable. Each box features its own fun print that she'll be excited to wear whether she's at home or heading out.\n\nThis bright tote will brighten her spirits and help her get ready for summer. Whether she needs a bag for her beach gear or something to use daily, she'll love the style and you'll love the price.\n\nStill looking for the perfect gift? Be sure to check out Shop TODAY’s Gift Guide to shop for everyone on your list, including:\n\nSubscribe to our Stuff We Love and One Great Find newsletters, and download our TODAY app to discover deals, shopping tips, budget-friendly product recommendations and more!", "images": ["https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2021_16/1706525/flaherty-woven-cotton-chair-hammock-6082c57f42058.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2020_18/1564375/49575-1-1200px-5eaa1a6c58b4e.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2021_16/1706508/9326221x-6082c07a53594.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-120x180,f_auto,q_auto:best/newscms/2021_41/1787151/web-discovery-style-mc-211012_copy.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2020_18/1564352/93387x.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2020_18/1564354/31a6iq4gnnl-5eaa1433b18fb.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-120x180,f_auto,q_auto:best/newscms/2021_41/1787138/web-discovery-food-mc-211012.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-120x180,f_auto,q_auto:best/newscms/2021_41/1787172/web-discovery-parents-mc-211012.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/w_10000,h_74,q_80,c_fit,f_auto,q_auto:best/newscms/2022_11/1853676/saturday2x.png", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-120x180,f_auto,q_auto:best/newscms/2021_41/1787145/web-discovery-home-mc-211012_copy.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2022_17/1867527/the_better_skin_co_mothers_day_set.PNG", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2022_17/1867522/new_balance_fresh_foam_cruzv1_reissue.PNG", "https://media-cldnry.s-nbcnews.com/image/upload/t_social_share_1200x630_center,f_auto,q_auto:best/newscms/2022_17/1867348/last-min-mothers-day-gifts-vl-2x1-220429.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/w_10000,h_74,q_80,c_fit,f_auto,q_auto:best/newscms/2019_18/1432043/hodaandjenna.png", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2020_18/1564369/16537-37029.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2020_18/1564399/51boyxke5xl-5eaa23021239d.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2020_18/1564365/51385_1_640px.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2020_18/1564376/51gx2vwuykl-5eaa1ac3f1476.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2022_17/1867331/cheryls_cookies_buttercream_frosted_long_stemmed_cookie_flowers.PNG", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-120x180,f_auto,q_auto:best/newscms/2021_42/1790748/web-discovery-video-mc-gradient-211019.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2020_18/1564360/415srra1b5l-5eaa1584ea14c.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2022_17/1867362/vera_bradley_large_cosmetic_bag.PNG", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2022_17/1867521/lululemon_everywhere_belt_bag.PNG", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2020_18/1564370/31hm1myfzul-5eaa1893984a5.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2022_17/1867475/63678-m-v2-626c1c6526114.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2020_18/1564351/51ss-oqvwkl-5eaa120bb464a.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2020_18/1564374/k-mini-coffee-maker-en-general-pdp-general--5eaa1a2a6939e.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2020_18/1564363/31vxyofb-sl-5eaa160d1285a.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-760w,f_auto,q_auto:best/newscms/2021_18/1711916/last-minute-mothers-day-gifts-bd-2x1-210503.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2022_17/1867530/kitsch_satin_sleep_eye_mask.PNG", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2020_18/1564381/palm-leaf-rounded-clutch-1-m-5eaa1cba26109.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-120x180,f_auto,q_auto:best/newscms/2021_41/1787147/web-discovery-pop-culture-mc-211012_copy.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/w_10000,h_74,q_80,c_fit,f_auto,q_auto:best/newscms/2019_18/1432044/today-3rd-hour.png", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2020_18/1564368/v1.jpeg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2020_18/1564364/il_1588xn-1888307585_lxto.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2020_18/1564378/tn_images-d-domino-angle-purple-jpg_w920.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2022_17/1867421/happy_socks_mothers_day_gift_box.PNG", "https://media-cldnry.s-nbcnews.com/image/upload/w_10000,h_74,q_80,c_fit,f_auto,q_auto:best/rockcms/2022-10/TODAY-menu-2022-431ed9.png", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2022_17/1867487/9780593232514-626c23f6e1578.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2022_17/1867499/5061171-626c278fe1986.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-60x60,f_auto,q_auto:best/newscms/2022_13/1858749/mothers-day-gift-for-wife-vl-2x1-220329.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-60x60,f_auto,q_auto:best/newscms/2021_30/1726262/lilolme.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2020_18/1564261/screen_shot_2020-04-29_at_4-21-56_pm.png", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-120x180,f_auto,q_auto:best/newscms/2021_41/1787173/web-discovery-shopping-mc-211012.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2022_17/1867359/51trxurk3gl-_ac_sl1000_.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2020_18/1564372/49852-1-1200px-5eaa1949eff18.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2020_18/1564294/rosegold_2.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2020_18/1564389/screen_shot_2020-04-29_at_8-39-50_pm.png", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2021_16/1706487/51pfwrv2qgl-sl500--6082b0a337e29.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2020_18/1564390/screen_shot_2020-04-29_at_8-41-08_pm.png", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2021_16/1706476/tpf-71259x-6082ab43acc36.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2020_18/1564356/51364-1-1200px-5eaa14bb938a0.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2020_18/1564255/screen_shot_2020-04-29_at_4-12-29_pm.png", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2022_17/1867461/browniepoints-mom-needs-a-nap-626c17df5e79b.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2020_18/1564373/recipe-box-2-o.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2022_16/1864501/screen_shot_2022-04-19_at_10-17-57_am.png", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2021_16/1706519/riviera-straw-beach-tote-o-6082c42388696.jpg", "https://media4.s-nbcnews.com/j/newscms/2022_15/1862635/mothers-day-sale-vl-2x1-220412_10ba8b8c1cb58a4943dff3731881f2ec.focal-60x60.jpg", "https://media3.s-nbcnews.com/j/newscms/2022_17/1866733/mother-figures-gifts-vl-2x1-220427_8db97704e83374ff87bf5633b181f002.focal-60x60.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2022_17/1867447/tile_backdrop.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2022_17/1867512/aphrodite_signet_ring.PNG", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2022_17/1867485/02_tr_mommy_me_bundle_palm_beach_rose_ba1e3218-c2d3-4cef-839d-58b249ba2a15.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2020_18/1564359/41wwjnyjdql-5eaa151d84140.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2020_18/1564400/screen_shot_2020-04-29_at_9-01-25_pm.png", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-720w,f_auto,q_auto:best/newscms/2021_16/1706679/screen_shot_2021-04-23_at_11-35-02_am.png", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-120x180,f_auto,q_auto:best/newscms/2021_41/1787140/web-discovery-health-mc-211012.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/w_10000,h_74,q_80,c_fit,f_auto,q_auto:best/newscms/2018_52/2696491/williegeist.png"], "top_img": "https://media-cldnry.s-nbcnews.com/image/upload/t_social_share_1200x630_center,f_auto,q_auto:best/newscms/2022_17/1867348/last-min-mothers-day-gifts-vl-2x1-220429.jpg", "keywords": [], "authors": ["Https", "Media-Cldnry.S-Nbcnews.Com Image Upload Newscms Lilolme.Jpg", "Jillian Ortiz", "Jillian Ortiz Is An Editorial Assistant For Shop Today."], "canonical_link": "https://www.today.com/shop/mothers-day-gifts-last-minute-arrive-time-t253909", "title": "Still shopping? 48 last-minute Mother's Day gifts that are sure to be a hit", "meta_data": {"msapplication-config": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/today/all-other-sizes-PNG.ico/browserconfig.xml", "robots": "max-image-preview:large", "fb": {"app_id": 122384521533, "admins": 100001657893615, "pages": 157687092983}, "og": {"site_name": "TODAY.com", "locale": "en_US", "url": "https://www.today.com/shop/mothers-day-gifts-last-minute-arrive-time-t253909", "title": "Still shopping? 48 last-minute Mother's Day gifts that are sure to be a hit", "description": "Hey, procrastinators: Mother's Day is almost here!", "image": {"identifier": "https://media-cldnry.s-nbcnews.com/image/upload/t_social_share_1200x630_center,f_auto,q_auto:best/newscms/2022_17/1867348/last-min-mothers-day-gifts-vl-2x1-220429.jpg", "secure_url": "https://media-cldnry.s-nbcnews.com/image/upload/t_social_share_1200x630_center,f_auto,q_auto:best/newscms/2022_17/1867348/last-min-mothers-day-gifts-vl-2x1-220429.jpg", "type": "image/jpeg", "width": 1200, "height": 630}, "type": "article"}, "twitter": {"site": "@TODAYshow", "creator": "TodayShow", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_social_share_1024x512_center,f_auto,q_auto:best/newscms/2022_17/1867348/last-min-mothers-day-gifts-vl-2x1-220429.jpg", "title": "Still shopping? 48 last-minute Mother's Day gifts that are sure to be a hit", "description": "Hey, procrastinators: Mother's Day is almost here!", "card": "summary_large_image"}, "viewport": "width=device-width, initial-scale=1, user-scalable=yes", "description": "Here are the best last-minute Mother's Day gifts that will arrive on time. Browse Mother's Day gift ideas from bracelets, cookie assortments, custom gifts and more.", "branch": {"deeplink": {"title": "Still shopping? 48 last-minute Mother's Day gifts that are sure to be a hit", "description": "Hey, procrastinators: Mother's Day is almost here!", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_social_share_1200x630_center,f_auto,q_auto:best/newscms/2022_17/1867348/last-min-mothers-day-gifts-vl-2x1-220429.jpg", "type": "article", "unibrow": "Gift Guides", "authorThumbnail1": "https://media-cldnry.s-nbcnews.com/image/upload/newscms/2021_30/1726262/lilolme.jpg", "authorName1": "Jillian Ortiz"}}, "article": {"opinion": "false", "content_tier": "free", "published": "Wed May 04 2022 20:47:37 GMT+0000 (UTC)", "modified": "Wed May 04 2022 20:47:38 GMT+0000 (UTC)"}, "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_social_share_1024x768_scale,f_auto,q_auto:best/newscms/2022_17/1867348/last-min-mothers-day-gifts-vl-2x1-220429.jpg", "next-head-count": 79}, "movies": [], "publish_date": 1651697257.0, "source": "https://www.today.com", "summary": ""}