{"url": "https://www.hollywoodreporter.com/bastard-machine/a-crucial-lesson-golden-globes-nominations-emmys-1167083", "text": "Back in the spring of 2016, two months before the Emmy nominations were announced, I wrote a column about how the Television Academy had a golden opportunity to snatch back its relevance. It had to right an egregious wrong — to finally nominate FX’s The Americans for best drama series, which it did. And it had to build upon the nominating successes of the previous year, when it finally began moving in the right direction in a number of categories. It was essential, I noted, to get its house in order, because six months earlier, the Golden Globes had stopped trying to be the Emmys and had reverted to form.\n\nAnd by form I meant that it had no idea or really any interest in taking TV seriously, which the bulk of its nominations that year proved.\n\nBack then, I wrote this sentence, still true: “The Golden Globes had to revert to being the Golden Globes — ridiculous, scattershot, influence-free and pointless (other than being a fine and fun party that can be entertaining when you point a camera at it).”\n\nSo on Thursday, when the Hollywood Foreign Press Association announced its 2018 Golden Globe nominations, I was concerned less with the Globes than I was with the Emmys. And here’s why: The Emmys need to own television, because they were created to celebrate television and television only. As to the Globes’ celebration of film and TV together — fine, whatever. The Emmys as an awards entity needs to stay singularly focused and, most important, it must continue to improve itself — not only through a better-informed voting membership but also in forward-thinking tweaks to its process and then, ultimately, its presentation on the night of its broadcast.\n\nThat’s why the Television Academy should look at Thursday’s Globes nominations and think about the opportunities they present — for the Emmys.\n\nThe Globes don’t really care about television. My colleague Dan Fienberg detailed that pretty clearly by looking at the oddities of the nominations. (And yes, despite knowing in my bones that the Globes are ridiculous, the Atlanta snub and the J.K. Simmons snub for his excellent work on Counterpart, among many other oversights, still infuriated me.)\n\nIf I were someone at the Television Academy, the lesson I would take from the Globes’ television nominations is not “Oh, my God. Those idiots!” It would be this: “Oh, my God. We have to do everything in our power not to be those idiots.” And the only way to do that is something I hammer home at every opportunity (and yes, today is another excellent opportunity): by expanding every single Emmy category to 10 nominees.\n\nThe level of simplicity here should not be lost on anyone. This is an easy fix. It’s a justifiable fix given the glut of the Peak TV era. And there are zero credible reasons not to do it.\n\nExpanding categories to 10 is a no-brainer. Here’s a short list of reasons to make this change:\n\n1. It means you’re not the Golden Globes, which don’t take TV seriously. On Thursday the Globes finally nominated, for the first time, The Americans for best series, which is something the Emmys finally did two years ago. (That gap is too close, in case you’re missing the big picture here.)\n\n2. It means you’re not the Golden Globes, which pick only five shows for best drama, five for a combined category called “comedy or musical,” five for “limited series or motion picture made for television” — in a world where Netflix and Amazon are making movies and blurring the distinction between screen size — and a ludicrous five for supporting categories that encompass dramas, comedies, limited series and movies.\n\n3. Not to put too fine a point on it, but you don’t want to be any of that.\n\n4. OK, granted, this should have been No. 1 on this list, but the reason you expand all Emmy categories to 10 nominees is that there are nearly 500 scripted series, plus thousands of nonscripted series and more than enough talented people to fill every one of those 10 slots and then still have an argument about snubs.\n\n5. Two years ago the Golden Globes gave you an opportunity to not look stupid or slack about your own industry, and you’ve realized maybe 65 percent of that advantage by 2018, because every discussion around Emmy nominations is about legitimate, head-scratching, face-palming snubs, even though you expanded the drama series and comedy series categories to eight (why eight?!), leaving the major acting categories at six, and yet — and yet! — you had seven nominations for supporting actress in a drama and eight nominations for supporting actress in a comedy and seven in the supporting actor in a limited series category. Do you not see the problem here with this baffling inconsistency?\n\n6. And oh, by the way, you have only five nominees for best documentary, which, in 2018, is kind of ludicrous. Last year you didn’t even nominate Ken Burns’ The Vietnam War, which should have been your winner.\n\n7. I mean, do you really want to read something like this again next year?\n\n8. Everyone who watched Killing Eve knows that co-lead Jodie Comer is as essential to that series as the wonderful Sandra Oh, but you didn’t nominate Comer. And guess what — neither did the Golden Globes. Do you want to be the Golden Globes? I thought two years ago we were talking about not repeating this mistake? And Killing Eve is only one example among way too many where the crossover connection to the Golden Globes does you no favors. You could rectify that by having 10 nominees in every single category. Are you sensing the theme here?\n\n9. This list item is technically not about category expansion, but it’s definitely about fixing your business: You really need to do a better job on the Emmys telecast. You’re supposed to be celebrating your industry, not boring it. But hey, that’s a different column for a different time.\n\n10. Ah, 10. Look at that number. Full, inclusive, yet concise. There’s something good about that number. Do you feel the anvil I’m dropping on your head?\n\nI’m not sure the Television Academy will take this advice. I’m also not sure why they wouldn’t. But I hope everyone in power there who can spearhead procedural changes will look at the Golden Globes nominations on the TV side and think, “Let’s not be that.” And I hope those same people don’t look at the Emmys’ random, seemingly pointless expansion from five nominees per category to six, seven or eight and think that’s progress enough.\n\nBecause it’s not.\n\nOn a day when someone else is trying with half-assed intent to “celebrate” creative achievement in the world of TV, I hope the body that’s specifically tasked with honoring the television industry finally takes the next and most obvious step to set itself apart.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/04/the_americans_barry_and_killing_eve_-_publicity_-_h_split_2018.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/the_americans_barry_and_killing_eve_-_publicity_-_h_split_2018.jpg?w=1296&h=730&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "http://www.hollywoodreporter.com/sites/default/files/custom2/Banners/THR_goldenGlobes-embeds2x.png"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/the_americans_barry_and_killing_eve_-_publicity_-_h_split_2018.jpg?w=1024", "keywords": [], "authors": ["Tim Goodman"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/a-crucial-lesson-golden-globes-nominations-emmys-1167083/", "title": "Critic’s Notebook: A Crucial Lesson From the Golden Globes for the Emmys", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Yet another opportunity arises for the Television Academy to truly serve Peak TV in a way that the Globes doesn't get.", "news_keywords": "Golden Globes, HFPA", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Tim Goodman", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1167083, "title": "Critic's Notebook: A Crucial Lesson From the Golden Globes for the Emmys", "published_at": "2018-12-06 12:40:11", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/the_americans_barry_and_killing_eve_-_publicity_-_h_split_2018.jpg?w=1024", "comment_count": 0, "tags": "HFPA", "topics": "TV News", "body": "Back in the spring of 2016, two months before the Emmy nominations were announced, I wrote a column about how the Television Academy had a golden opportunity to snatch back its relevance. It had to right an egregious wrong — to finally nominate FX's The Americans for best drama series, which it did. And it had to build upon the nominating successes of the previous year, when it finally began moving in the right direction in a number of categories. It was essential, I noted, to get its house in order, because six months earlier, the Golden Globes had stopped trying to be the Emmys and had reverted to form.\r\nAnd by form I meant that it had no idea or really any interest in taking TV seriously, which the bulk of its nominations that year proved. \r\nBack then, I wrote this sentence, still true: \"The Golden Globes had to revert to being the Golden Globes — ridiculous, scattershot, influence-free and pointless (other than being a fine and fun party that can be entertaining when you point a camera at it).\"\r\nSo on Thursday, when the Hollywood Foreign Press Association announced its 2018 Golden Globe nominations, I was concerned less with the Globes than I was with the Emmys. And here's why: The Emmys need to own television, because they were created to celebrate television and television only. As to the Globes' celebration of film and TV together — fine, whatever. The Emmys as an awards entity needs to stay singularly focused and, most important, it must continue to improve itself — not only through a better-informed voting membership but also in forward-thinking tweaks to its process and then, ultimately, its presentation on the night of its broadcast.\r\n\r\nThat's why the Television Academy should look at Thursday's Globes nominations and think about the opportunities they present — for the Emmys.\r\nThe Globes don't really care about television. My colleague Dan Fienberg detailed that pretty clearly by looking at the oddities of the nominations. (And yes, despite knowing in my bones that the Globes are ridiculous, the Atlanta snub and the J.K. Simmons snub for his excellent work on Counterpart, among many other oversights, still infuriated me.) \r\nIf I were someone at the Television Academy, the lesson I would take from the Globes' television nominations is not \"Oh, my God. Those idiots!\" It would be this: \"Oh, my God. We have to do everything in our power not to be those idiots.\" And the only way to do that is something I hammer home at every opportunity (and yes, today is another excellent opportunity): by expanding every single Emmy category to 10 nominees. \r\nThe level of simplicity here should not be lost on anyone. This is an easy fix. It's a justifiable fix given the glut of the Peak TV era. And there are zero credible reasons not to do it. \r\n\r\nExpanding categories to 10 is a no-brainer. Here's a short list of reasons to make this change:\r\n1. It means you're not the Golden Globes, which don't take TV seriously. On Thursday the Globes finally nominated, for the first time, The Americans for best series, which is something the Emmys finally did two years ago. (That gap is too close, in case you're missing the big picture here.)\r\n2. It means you're not the Golden Globes, which pick only five shows for best drama, five for a combined category called \"comedy or musical,\" five for \"limited series or motion picture made for television\" — in a world where Netflix and Amazon are making movies and blurring the distinction between screen size — and a ludicrous five for supporting categories that encompass dramas, comedies, limited series and movies.\r\n3. Not to put too fine a point on it, but you don't want to be any of that.\r\n4. OK, granted, this should have been No. 1 on this list, but the reason you expand all Emmy categories to 10 nominees is that there are nearly 500 scripted series, plus thousands of nonscripted series and more than enough talented people to fill every one of those 10 slots and then still have an argument about snubs.\r\n5. Two years ago the Golden Globes gave you an opportunity to not look stupid or slack about your own industry, and you've realized maybe 65 percent of that advantage by 2018, because every discussion around Emmy nominations is about legitimate, head-scratching, face-palming snubs, even though you expanded the drama series and comedy series categories to eight (why eight?!), leaving the major acting categories at six, and yet — and yet! — you had seven nominations for supporting actress in a drama and eight nominations for supporting actress in a comedy and seven in the supporting actor in a limited series category. Do you not see the problem here with this baffling inconsistency?\r\n6. And oh, by the way, you have only five nominees for best documentary, which, in 2018, is kind of ludicrous. Last year you didn't even nominate Ken Burns' The Vietnam War, which should have been your winner.\r\n7. I mean, do you really want to read something like this again next year?\r\n8. Everyone who watched Killing Eve knows that co-lead Jodie Comer is as essential to that series as the wonderful Sandra Oh, but you didn't nominate Comer. And guess what — neither did the Golden Globes. Do you want to be the Golden Globes? I thought two years ago we were talking about not repeating this mistake? And Killing Eve is only one example among way too many where the crossover connection to the Golden Globes does you no favors. You could rectify that by having 10 nominees in every single category. Are you sensing the theme here?\r\n9. This list item is technically not about category expansion, but it's definitely about fixing your business: You really need to do a better job on the Emmys telecast. You're supposed to be celebrating your industry, not boring it. But hey, that's a different column for a different time. \r\n10. Ah, 10. Look at that number. Full, inclusive, yet concise. There's something good about that number. Do you feel the anvil I'm dropping on your head?\r\nI'm not sure the Television Academy will take this advice. I'm also not sure why they wouldn't. But I hope everyone in power there who can spearhead procedural changes will look at the Golden Globes nominations on the TV side and think, \"Let's not be that.\" And I hope those same people don't look at the Emmys' random, seemingly pointless expansion from five nominees per category to six, seven or eight and think that's progress enough.\r\nBecause it's not.\r\nOn a day when someone else is trying with half-assed intent to \"celebrate\" creative achievement in the world of TV, I hope the body that's specifically tasked with honoring the television industry finally takes the next and most obvious step to set itself apart.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Critic’s Notebook: A Crucial Lesson From the Golden Globes for the Emmys", "url": "https://www.hollywoodreporter.com/tv/tv-news/a-crucial-lesson-golden-globes-nominations-emmys-1167083/", "description": "Yet another opportunity arises for the Television Academy to truly serve Peak TV in a way that the Globes doesn’t get.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/the_americans_barry_and_killing_eve_-_publicity_-_h_split_2018.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2018-12-06T12:40:11+00:00", "modified_time": "2018-12-06T14:11:49+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Critic’s Notebook: A Crucial Lesson From the Golden Globes for the Emmys", "description": "Yet another opportunity arises for the Television Academy to truly serve Peak TV in a way that the Globes doesn’t get.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/the_americans_barry_and_killing_eve_-_publicity_-_h_split_2018.jpg?w=1296"}}, "movies": [], "publish_date": 1544100011.0, "source": "https://www.hollywoodreporter.com", "summary": ""}