{"url": "www.inquisitr.com/4004828/courteney-cox-did-not-go-on-a-jealous-tirade-about-pal-jenniferaniston/", "text": "Courteney Cox has found herself the subject of a number of tabloid rumors that also involve her good friend and former Friends co-star Jennifer Aniston. The pair have a longtime friendship, and certain tabloids are set on portraying the actresses as though their friendship is a facade.\n\nThis time around, the rumor that has made headlines due to a false report by the National Enquirer states that Cox went on a jealous tirade over the success and happiness of Aniston. Gossip Cop shares the details about this ludicrous fabrication.\n\n\"A so-called 'source' tells the National Enquirer, in oddly unnatural language, 'A longtime friendship's about to go up in flames! Courteney stunned close pals at a recent dinner, launching into a jealous, un-'Friend'-ly attack on Jen, saying, 'I should have been the movie star!'\"\n\nThe source goes on to claim that Courteney was openly sharing her frustrations about the fact that Jen \"catapulted\" to a whole other level of stardom, while her own career failed to take off. GC continues to relay the words of the source.\n\n\"Slamming Jen for being the more famous one, Courteney grumped that she can't understand how Jen catapulted to huge movie stardom while her own big-screen career never took off! Her sniping behind Jen's back sounded damn nasty and people definitely overheard it.\"\n\nThe celebrity gossip policing site was sure to check in with more reliable sources close to the Friends co-stars and have been assured that Aniston and Cox are great pals and that the raven-haired beauty did not go off on a tirade regarding Jen's stardom and success.\n\n#Friends to the end! Jennifer Aniston & Courteney Cox's enduring friendship in photos https://t.co/tNR4SgeTG1 pic.twitter.com/NVWsC9KqFy — People Magazine (@people) February 17, 2017\n\n— People Magazine (@people) February 17, 2017\n\nAs the publication notes, the tabloid has been the culprit in other false claims regarding the actresses, one of which included a story that Jen and Courteney were set to star in a new TV series together.\n\nOther recent stories about Cox and Aniston that were proven false involved Jen's ex-husband Brad Pitt. Cox and Pitt were at a charity event and were reportedly quite flirtatious with one another, which allegedly made Aniston a bit annoyed with her pal. As stated, this too was stamped out as false.\n\n\"You'll never feel scolded. She's extremely fair, ridiculously loyal and fiercely loving\"- Jennifer Aniston about Courteney Cox pic.twitter.com/qp3Vp9VFJX — mondler trash (@bingandgeller) February 18, 2017\n\n— mondler trash (@bingandgeller) February 18, 2017\n\nIt seems as though ever since Aniston shared her piece in her letter in the Huffington Post last summer in which she shared her frustrations with tabloid rumors regarding false pregnancies focused on her. However, tabloids have been tirelessly trying to gain readership for false stories about the star based on other subjects instead. It's clear that the point was missed entirely, seeing as Aniston's intent was to share that she wanted the fabricated stories and the harassment by paparazzi to stop altogether. This has not been the case.\n\n\"For the record, I am not pregnant. What I am is fed up. I'm fed up with the sport-like scrutiny and body shaming that occurs daily under the guise of 'journalism' the 'First Amendment' and 'celebrity news.'\"\n\nRecently, Jennifer Aniston even shared in an interview that although she was impressed by how well-received her letter in the publication has been, she admitted that she sees it has done little to cause tabloids from churning out falsities about her and other celebrities, while also focusing on aspects of such stars that should not be the primary focus -- pregnancy, weight, appearance, and break-ups, to name a few.\n\nDespite the constant focus on everything other than her career, which is clearly a frustration, Aniston takes it all in stride. Although she appears to be near-perfect in many aspects of her life, she shared in an interview with Marie Claire last fall that she really does not always have it all together, but that it's okay, as the Inquisitr formerly shared.\n\n\"This is a time when I'm not completely sure what I'm doing. I'm at this sort of crossroads trying to figure out what inspires me deep in my core. What used to make me tick is not necessarily making me tick any- more … The most challenging thing right now is trying to find what it is that makes my heart sing.\"\n\n[Featured Image by Jonathan Leibson/Getty Images]", "images": ["https://imgb.srgcdn.com/c2fbdf24-a0a4-40f9-ad23-b0cb57bf8766.jpg", "https://imgb.srgcdn.com/d258d2ec-e52b-4489-9950-908cc366bacf.jpg", "https://secure.gravatar.com/avatar/784fcf0a3514f31a582147119c01ff3d?s=800", "https://imgb.srgcdn.com/fe42e24b-1fa1-4cf2-b7ef-0bcd25a6f5c9.png", "https://imgb.srgcdn.com/1740626a-9ecf-4723-b66a-d7ca5e1d678c.jpg", "http://www.inquisitr.com/static/inquisitr/images/favicon-32x32.png", "https://imgb.srgcdn.com/a5ba8e20-c5b5-4c82-ae2b-4f343261a07b.jpg", "https://imgb.srgcdn.com/6977b3f9-ffc5-44c5-866c-e80c13668077.jpg"], "top_img": "http://www.inquisitr.com/static/inquisitr/images/favicon-32x32.png", "keywords": [], "authors": [], "canonical_link": "https://www.inquisitr.com/4004828/courteney-cox-did-not-go-on-a-jealous-tirade-about-pal-jenniferaniston/", "title": "Courteney Cox Did Not Go On 'Tirade' About Pal Jennifer Aniston [Debunked]", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimal-ui, user-scalable=no", "msapplication-TileImage": "/static/inquisitr/favicon-128x128.png", "robots": "max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Courteney Cox Did Not Go On 'Tirade' About Pal Jennifer Aniston [Debunked]", "url": "https://www.inquisitr.com/4004828/courteney-cox-did-not-go-on-a-jealous-tirade-about-pal-jenniferaniston/", "site_name": "The Inquisitr", "description": "Courteney Cox Did Not Go On 'Tirade' About Pal Jennifer Aniston [Debunked]", "updated_time": "2021-08-16 18:13:43Z"}, "article": {"modified_time": "2021-08-16 18:13:43Z", "published_time": "2017-02-22 16:15:32Z", "section": "Fact Checking"}, "description": "Courteney Cox Did Not Go On 'Tirade' About Pal Jennifer Aniston [Debunked]", "keywords": "Fact Checking", "twitter": {"card": "summary_large_image"}}, "movies": [], "publish_date": 1487780132.0, "source": "http://www.inquisitr.com", "summary": ""}