{"url": "https://www.nbcnews.com/storyline/las-vegas-shooting/las-vegas-police-investigating-shooting-mandalay-bay-n806461", "text": "A lone gunman unleashed a rapid-fire barrage of bullets from the 32nd floor of a Las Vegas hotel late Sunday, killing at least 59 people and injuring more than 500 others attending a country music festival below, officials said.\n\nIt was the worst mass shooting in modern American history, and Stephen Craig Paddock was \"solely responsible for this heinous act,\" Assistant Clark County Sheriff Todd Fasulo told reporters Monday night.\n\nPaddock, 64, of Mesquite, Nevada, fired shot after shot from his room at Mandalay Bay Resort and Casino down on the crowd of about 22,000, sending terrified concertgoers running for their lives.\n\n\"We heard what sounded like firecrackers going off. Then all of a sudden we heard what sounded like a machine gun. People started screaming that they were hit,\" witness Meghan Kearney told MSNBC. \"When we started running out, there were probably a couple hundred [people] on the ground.\"\n\nShe added: \"People kept dropping and dropping. ... People were getting shot one foot away from us. People were trying to save their friends. There were gunshots everywhere. Helping them would've meant that we got shot, too.\"\n\nThe Latest:\n\n59 people were killed and at least 527 others were injured in the deadliest mass shooting in modern U.S. history.\n\nAuthorities identified the gunman as Stephen Craig Paddock, 64, of Mesquite, Nevada. They said he acted alone.\n\nInvestigators found 23 firearms in Paddock's room at Mandalay Bay Resort and Casino and 19 more at his home.\n\nPresident Donald Trump, who will visit Las Vegas on Wednesday, called the shooting \"an act of pure evil.\"\n\nPolice responded to reports of the shooting just after 10 p.m. (1 a.m. ET). Clark County Sheriff Joseph Lombardo told reporters Monday that authorities believe Paddock killed himself before police entered his room. Officials had said earlier that police fatally shot Paddock.\n\nAuthorities were digging into Paddock's history. Other than a citation he received several years ago that was \"handled as a normal practice\" by the courts, he had no criminal background, Lombardo said.\n\nPaddock is believed to have checked into the hotel on Thursday, Lombardo said. Fasulo said that he had 23 firearms in his room and that investigators found 19 more at his home.\n\nIt wasn't clear whether Paddock had specifically requested a room on a high floor that overlooked the concert venue. Hotel employees had been in his room before the shooting and didn't notice anything unusual, according to Lombardo.\n\nTwo broken windows could be seen from the 32nd floor of the hotel, curtains billowing out. Law enforcement officials said Paddock had connecting rooms or a suite and ran between the windows, firing out of both, either to get a different vantage point or to avoid return fire.\n\nThey believe he smashed the windows with a something like a hammer before he started firing.\n\nThe shooting started while performer Jason Aldean was onstage. Witnesses described a chaotic scene of back-to-back bullets raining down from above, lasting for up to 10 minutes.\n\nFellow performer Jake Owen said he was standing about 50 feet from Aldean when the shots started.\n\n\"It got faster and faster, almost like it was an automatic rifle,\" Owen said. \"At that point, everyone on stage started running everywhere.\"\n\nOwen dashed by victims covered in blood and eventually found shelter in his bus. The gunfire still hadn't stopped by the time he got there, he said.\n\n\"It wasn't something that was quick. It was chaos for a pure seven to 10 minutes,\" he said.\n\nA map shows the area of the shooting in Las Vegas. NBC News\n\nFlags at the White House and the U.S. Capitol were lowered at half-staff on Monday. President Donald Trump, who said he would visit Las Vegas on Wednesday, called the shooting \"an act of pure evil.\"\n\n\"Hundreds of our fellow citizens are now mourning the loss of a loved one,\" Trump said at a news conference. \"We cannot fathom their pain. We cannot imagine their loss. To the families of the victims, we are praying for you, and we are here for you.\"\n\nThe shooting isn't believed to be connected to international terrorism. Authorities haven't said what kinds of weapons were found.\n\nA former Clark County sheriff, Bill Young, said his 22-year-old daughter was at the concert. Young told MSNBC that his daughter said that the weapon \"sounded like a machine gun\" and that she and her friends took cover under a desk.\n\nLive Blog: Latest Updates on the Concert Massacre\n\n\"I picked up the phone, my cellphone, and she was screaming and yelling, 'Dad, dad, dad, dad, somebody's shooting at us, and I don't know what to do.' She was hysterical, and I tried to just calm her down,\" Young said.\n\n\"She could hear the gunshots — sounded like a machine gun, she said — and they didn't know where they were coming from,\" Young said. \"She had nowhere to take cover, so I told her just to run as fast as she could, as quick as she could, out of the arena. Get as far away from it as she could where she thought the line of fire might be.\"\n\nRelated: Full Coverage of the Las Vegas Shooting\n\nAt least one off-duty Las Vegas police officer was shot, Lombardo said. Several other off-duty police officers are believed to be among the dead and injured.\n\nThe massacre put the normally bustling Strip at a standstill. Flights in and out of the Las Vegas airport were temporarily halted.\n\nPolice found Paddock's roommate, Marilou Danley, 62, and don't think she was involved, Lombardo said, adding that the investigation is ongoing.\n\nPolice searched their home in Mesquite, about 80 miles from Las Vegas.\n\nRelated: Photos Capture Chaos of Concert Massacre\n\nThe suspect's brother Eric Paddock, of Orlando, Florida, told NBC News that he was \"dumbfounded\" by the shooting.\n\n\"He was just a guy,\" Eric Paddock said of his brother. \"He lives in Mesquite, he went to the hotels, he gambled, he went to shows.\"\n\n\"We are completely at a loss,\" he added.\n\nSenior law enforcement officials and a Las Vegas casino executive said Stephen Paddock had made several large gambling transactions in recent weeks, including some of more than $30,000 a day. It wasn't known whether they were losses or wins.\n\nIn 2012, Paddock sued the Cosmopolitan Hotel in Las Vegas for a slip and fall. Martin Kravitz, the lead attorney for the hotel, described him Monday as \"bizarre\" and said \"he dressed slovenly to the deposition.\"\n\n\"His answers were vague, not very thoughtful,\" Kravitz said. \"He wasn't angry. ... This is not a guy who would have really stood out in your mind.\"\n\nHe added that Paddock was wearing \"crappy flip-flops.\"\n\n\"You wonder what a guy like this is doing at the Cosmo,\" he said.\n\nAldean, who was named the Academy of Country Music's Entertainer of the Year in April, was performing on the final night of the three-day Route 91 Harvest festival at the Las Vegas Village when the shots started. He later said via Instagram that he and his band were safe.\n\n\"I still don't know what to say but wanted to let everyone know that Me and my Crew are safe. My Thoughts and prayers go out to everyone involved tonight,\" he wrote.\n\nVice President Mike Pence tweeted his condolences after the \"senseless violence.\"\n\n\"The hearts and prayers of the American people are with you. You have our condolences and sympathies,\" he wrote. \"To the courageous first responders, thank you for your acts of bravery.\"\n\nHillary Clinton also expressed her grief in a tweet: \"The crowd fled at the sound of gunshots. Imagine the deaths if the shooter had a silencer, which the NRA wants to make easier to get.\"\n\nShe added: \"Our grief isn't enough. We can and must put politics aside, stand up to the NRA, and work together to try to stop this from happening again.\"\n\nPolice urged families looking to locate missing loved ones to call 1-866-535-5654.\n\nRichie Duchon and Andrew Blankstein reported from Los Angeles. F. Brinley Bruton, Rachel Elbaum and Yuliya Talmazan reported from London. Pete Williams reported from Washington. Elizabeth Chuck and Tracy Connor reported from New York. Alex Johnson reported from Los Angeles.", "images": ["https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2017_40/2175121/171002-las-vegas-shooting-run-njs-1127a.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-760x428,f_auto,q_auto:best/MSNBC/Components/Video/201710/-02T145923Z.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-60x60,f_auto,q_auto:best/newscms/2014_04/128581/140116-byline-pete-williams-sq-_j4a8923.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-760w,f_auto,q_auto:best/newscms/2017_40/2175106/171002-las-vegas-shooting-map-njs-1118a.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-760x428,f_auto,q_auto:best/MSNBC/Components/Video/201710/2017-10-02T14-45-06-366Z--1280x720.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-760w,f_auto,q_auto:best/newscms/2017_40/2174611/171002-vegas-shooting-mc-746_3.JPG", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-60x60,f_auto,q_auto:best/newscms/2019_28/2931056/190618-elizabeth_chuck-byline1144.jpg", "https://media4.s-nbcnews.com/j/MSNBC/Components/Video/201710/Las_Vegas_Shooting_62151-jpg-a4630.focal-760x428.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-760x428,f_auto,q_auto:best/MSNBC/Components/Video/201710/running.jpg"], "top_img": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2017_40/2175121/171002-las-vegas-shooting-run-njs-1127a.jpg", "keywords": [], "authors": ["Andrew Blankstein", "Https", "Media-Cldnry.S-Nbcnews.Com Image Upload Newscms", "Pete Williams", "Rachel Elbaum", "Elizabeth Chuck", "Andrew Blankstein Is An Investigative Reporter For Nbc News. He Covers The Western U.S.", "Specializing In Crime", "Courts", "Homeland Security."], "canonical_link": "https://www.nbcnews.com/storyline/las-vegas-shooting/las-vegas-police-investigating-shooting-mandalay-bay-n806461", "title": "Las Vegas Shooting: 59 Killed and More Than 500 Hurt Near Mandalay Bay", "meta_data": {"msapplication-config": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/nbcnews/all-other-sizes-PNG.ico/browserconfig.xml", "robots": "max-image-preview:large", "fb": {"app_id": 10150138890205613, "pages": 1508175089456029}, "og": {"site_name": "NBC News", "locale": "en_US", "url": "https://www.nbcnews.com/storyline/las-vegas-shooting/las-vegas-police-investigating-shooting-mandalay-bay-n806461", "title": "59 people killed, more than 500 hurt in Las Vegas Strip shooting", "description": "At least 59 people were killed when a gunman opened fire during a Jason Aldean performance from the 32nd floor of a Las Vegas hotel, police said.", "image": {"identifier": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2017_40/2175121/171002-las-vegas-shooting-run-njs-1127a.jpg", "secure_url": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2017_40/2175121/171002-las-vegas-shooting-run-njs-1127a.jpg", "type": "image/jpeg", "width": 1200, "height": 630}, "type": "article"}, "twitter": {"site": "@NBCNews", "creator": "NBCNews", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1024-512,f_auto,q_auto:best/newscms/2017_40/2175121/171002-las-vegas-shooting-run-njs-1127a.jpg", "title": "59 people killed, more than 500 hurt in Las Vegas Strip shooting", "description": "At least 59 people were killed when a gunman opened fire during a Jason Aldean performance from the 32nd floor of a Las Vegas hotel, police said.", "card": "summary_large_image"}, "viewport": "width=device-width, initial-scale=1, user-scalable=yes", "description": "At least 59 people were killed when a gunman opened fire during a Jason Aldean performance from the 32nd floor of a Las Vegas hotel, police said.", "branch": {"deeplink": {"title": "59 people killed, more than 500 hurt in Las Vegas Strip shooting", "description": "At least 59 people were killed when a gunman opened fire during a Jason Aldean performance from the 32nd floor of a Las Vegas hotel, police said.", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2017_40/2175121/171002-las-vegas-shooting-run-njs-1127a.jpg", "type": "article", "unibrow": "U.S. news", "authorName1": "Andrew Blankstein", "authorThumbnail2": "https://media-cldnry.s-nbcnews.com/image/upload/newscms/2014_04/128581/140116-byline-pete-williams-sq-_j4a8923.jpg", "authorName2": "Pete Williams", "authorName3": "Rachel Elbaum", "authorThumbnail4": "https://media-cldnry.s-nbcnews.com/image/upload/newscms/2019_28/2931056/190618-elizabeth_chuck-byline1144.jpg", "authorName4": "Elizabeth Chuck", "contributorName1": "Richie Duchon", "contributorName2": ",", "contributorName3": "F. Brinley Bruton", "contributorName4": ",", "contributorName5": "Yuliya Talmazan", "contributorName6": ",", "contributorName7": "Tracy Connor", "contributorName8": "and", "contributorName9": "Alex Johnson"}}, "article": {"opinion": "false", "content_tier": "free", "published": "Tue Oct 03 2017 02:33:30 GMT+0000 (UTC)", "modified": "Tue Oct 03 2017 02:33:30 GMT+0000 (UTC)"}, "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_social_share_1024x768_scale,f_auto,q_auto:best/newscms/2017_40/2175121/171002-las-vegas-shooting-run-njs-1127a.jpg", "next-head-count": 138}, "movies": [], "publish_date": 1506998010.0, "source": "https://www.nbcnews.com", "summary": ""}