{"url": "https://www.self.com/story/blow-dry-mistakes", "text": "Some tasks seem straightforward until you do them. For example, many people don’t know how to blow dry their hair so it looks like the work of a professional stylist, which of course, is totally understandable. You may not realize it, but there’s so much more to the task than simply grabbing a dryer, pointing it at your head, and blasting your hair with heat. In fact, getting a gorgeous at-home blowout requires using the right products, keeping your hair healthy, and getting a little bit of practice.\n\nHere, we asked top stylists and a dermatologist for their tips on how to blow dry your hair at home.\n\n1. Invest in a great blow-dryer if you can.\n\nIf you have the budget, you may want to invest in a tool that offers functions to minimize hair damage and help cut down on your drying time. For example, some dryers offer features like multiple heat settings, a cool shot to close hair cuticles, and ionic air technology. Celebrity hair stylist Jennifer Yepez recommends the T3 Cura Luxe ($230, Sephora) and the Dyson Supersonic ($399, Nordstrom) if you want to purchase a more expensive dryer. But there are plenty of more affordable stylist-recommended options, like the Red by Kiss 2200 Ceramic Tourmaline Dryer ($35, Amazon), if you don’t want to spend a lot of money. (You can find more recommendations here).\n\n2. Start by air or towel drying your hair.\n\nKeeping your hair healthy will help you avoid dry ends, resulting in shinier blowouts. And one of the best ways you can do this is by minimizing the amount of heat you apply to your hair, says Shilpi Khetarpal, M.D., dermatologist at the Cleveland Clinic. She recommends towel drying or air drying your hair to remove as much moisture as possible. “In general, the dryer your hair is the less heat you have to use,” Dr. Khetarpal says.\n\n3. Dry your hair using the right kind of towel.\n\n“Using a heavy, bulky bath towel creates a lot of weight and tension in our hair, and that can make it more likely to break or shed,” Dr. Khetarpal says. She recommends drying your hair using a small microfiber towel, which not only reduces tension but also decreases friction. The result? You’ll have fewer flyaways and less frizz, she says. One of our editors loves the Aquis Lisse Luxe Hair Turban ($30, Ulta), which transforms her hair from soaking wet hair to slightly damp in just five minutes.\n\n4. Avoid using a brush on wet hair.\n\nPlease don’t reach for that round brush when your hair is soaked, Dr. Khetarpal says. Tugging on wet hair with a brush increases your chances of damaging it. Instead, try this tip Dr. Khetarpal often gives people: Use a wide-tooth comb to easily detangle hair when it is still wet. If you skip this step, then your brush is more likely to get caught on knots, which will rip out more hair—even when it’s dry. “That’s just unnecessary stress on the hair,” Dr. Khetarpal says. The Diane Ionic Anti-Static 6” Volume Detangler Comb is a good choice and can work on thick or curly hair ($4, Ulta). (This Felicia Leatherwood Detangler Brush is one of our favorites, $18, Amazon.) If you don’t like combs, brushes made with softer bristles, like the Wet Brush ($9, Amazon), work well too. The Felicia Leatherwood Detangler Brush with widely spaced, flexible teeth is another one of our favorites, ($18, Amazon).\n\nDr. Khetarpal recommends that people with long hair hold it in their hands and lightly comb the ends before moving up toward the roots. This is gentler on your roots and can help you avoid hair breakage.\n\n5. Pick the right brush for your hair type.\n\nYou should pick a brush based on the results you’re looking for and your hair type, says Giovanni Vaccaro, Glasmsquad’s creative director. Typically, stylists like using a round brush to create a voluminous, bouncy style. Then, you have to decide on the material of the bristles. Vaccaro advises his clients with straight hair to use ceramic brushes because they retain heat to offer more volume. He prefers using boar-bristle brushes on people with coarse hair because the material provides the right amount of tension needed to smooth their strands.\n\n\n\nYepez favors brushes with ceramic-coated barrels, such as the T3 Volume 2.5 Round Professional Ceramic-coated Brush ($28, Dermstore) because the material retains heat and dries your hair faster. Otherwise, she recommends the YS Park G Series Curl Shine Styler Round Brush ($51, Amazon) for most people. “The bristles are specially made to help with faster drying and less heat damage,” she says.\n\n6. Always use a heat protectant.\n\nYes, heat protectants work, and you should be as diligent about using them as you hopefully are with your SPF, says Dr. Khetarpal. “Think of it as sunscreen for your hair,” she explains. There are a variety of products that you can use on either wet or dry hair, so read the bottle to understand how to use it. For example, if you’re going to use a spray before blow drying, then you should make sure it’s formulated to be used on wet hair, Dr. Khetarpal says. (Some products are meant to be used with other hot tools, like a curling iron, on already dried hair.)\n\n7. Remember to apply styling products evenly through your hair.\n\n“When some people use a serum for frizzy hair or a thickening spray for volume, they just spray the top of their hair, instead of all around,” Yepez tells SELF. “Sometimes you just forget the back of your hair.”\n\nShe advises parting your hair, creating sections, and working the product from mid-shaft to ends. You can apply the product using either your fingers or a comb, Yepez says.\n\n8. Use your blow-dryer attachments.\n\nYou know that flat, nozzle thing that attaches to the end of your hair dryer? Don’t ignore it. Blow drying with the diffuser on is less traumatic for your hair, Dr. Khetarpal says.", "images": ["https://media.self.com/photos/6324f18d6586e7e0e96d42ac/16:9/w_800%2Ch_450%2Cc_limit/undefined", "https://www.self.com/verso/static/self/assets/logo-header.64f3bdc15b1f321829f9f30c7853a1469f469d71.svg", "https://media.self.com/photos/63220ea73e462ba8f52a78f7/16:9/w_800%2Ch_450%2Cc_limit/undefined", "https://media.self.com/photos/5fbeb25d10a535ecae7b97a9/1:1/w_90%2Cc_limit/IMG_8548.JPG", "https://media.self.com/photos/5a946210fb42c00245b6b7da/4:3/w_2560%2Cc_limit/blowdrying-hair-mistakes.jpg", "https://www.self.com/verso/static/self/assets/logo-reverse.22fddcfca2f2de42711a84ec66a5157a9995d8ab.svg", "https://media.self.com/photos/632dcfe91b0dff9700edf340/16:9/w_800%2Ch_450%2Cc_limit/undefined", "https://media.self.com/photos/5a946210fb42c00245b6b7da/2:1/w_1280,c_limit/blowdrying-hair-mistakes.jpg", "https://media.self.com/photos/633ddb7da17bf2318d99d94d/16:9/w_800%2Ch_450%2Cc_limit/undefined", "https://media.self.com/photos/6333690d31aaaeb99d6e6888/16:9/w_800%2Ch_450%2Cc_limit/undefined", "https://media.self.com/photos/6322049b0af82e2e383c59ed/16:9/w_800%2Ch_450%2Cc_limit/undefined", "https://media.self.com/photos/631f5c63fc741d2bcc6f6026/16:9/w_800%2Ch_450%2Cc_limit/undefined", "https://media.self.com/photos/632cb2ff04a9708c3441d38f/16:9/w_800%2Ch_450%2Cc_limit/undefined"], "top_img": "https://media.self.com/photos/5a946210fb42c00245b6b7da/2:1/w_1280,c_limit/blowdrying-hair-mistakes.jpg", "keywords": [], "authors": ["Condé Nast", "Lauren Levinson", "Melissa Matthews"], "canonical_link": "https://www.self.com/story/blow-dry-mistakes", "title": "How to Blow Dry Your Hair So It Looks Like You Went to a Salon", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "width=device-width, initial-scale=1", "referrer": "no-referrer-when-downgrade", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2022", "description": "If you don't know how to blow dry your hair, don't worry, you're not alone. These 10 tips can help you achieve a great blowout.", "id": "5aa7fdcfb79f332221a948c2", "keywords": "hair,beauty,blow dryer,blow dry,hair care", "news_keywords": "hair,beauty,blow dryer,blow dry,hair care", "robots": "index, follow, max-image-preview:large", "content-type": "article", "parsely-post-id": "5aa7fdcfb79f332221a948c2", "parsely-metadata": "{\"description\":\"If you don't know how to blow dry your hair, don't worry, you're not alone. These 10 tips can help you achieve a great blowout.\",\"image-16-9\":\"https://media.self.com/photos/5a946210fb42c00245b6b7da/16:9/w_1000,c_limit/blowdrying-hair-mistakes.jpg\",\"image-1-1\":\"https://media.self.com/photos/5a946210fb42c00245b6b7da/1:1/w_1000,c_limit/blowdrying-hair-mistakes.jpg\"}", "og": {"description": "You've got this.", "image": "https://media.self.com/photos/5a946210fb42c00245b6b7da/2:1/w_1280,c_limit/blowdrying-hair-mistakes.jpg", "site_name": "SELF", "title": "10 Ways to Make Your At-Home Blowout Look Salon-Level", "type": "article", "url": "https://www.self.com/story/blow-dry-mistakes"}, "article": {"content_tier": "free", "opinion": "false", "section": "tags", "published_time": "2018-03-14T19:27:59.898Z", "modified_time": "2020-12-31T14:00:00.000Z", "author": "Lauren Levinson ,Melissa Matthews"}, "twitter": {"card": "summary_large_image", "creator": "@SELFmagazine", "description": "You've got this.", "domain": "https://www.self.com", "image": "https://media.self.com/photos/5a946210fb42c00245b6b7da/2:1/w_1280,c_limit/blowdrying-hair-mistakes.jpg?mbid=social_retweet", "site": "@SELFmagazine", "title": "10 Ways to Make Your At-Home Blowout Look Salon-Level"}, "fb": {"app_id": 169640983205651, "pages": 8908243810}}, "movies": [], "publish_date": 1521055679.898, "source": "https://www.self.com", "summary": ""}