{"url": "https://www.usatoday.com/story/life/tv/2018/01/17/ann-curry-breaks-silence-matt-lauer-im-not-surprised-allegations/1039446001/", "text": "Ann Curry breaks silence on Matt Lauer: 'I’m not surprised by the allegations'\n\nShow Caption Hide Caption Ann Curry 'not surprised' by Matt Lauer allegations Ann Curry appeared on 'CBS This Morning' to talk about her new PBS series and for the first time, she shared her thoughts on the sexual misconduct allegations against her former 'Today' co-anchor Matt Lauer. USA TODAY\n\nIn her first television interview since leaving NBC in 2015, Ann Curry told CBS This Morning about her former network's \"climate\" of harassment.\n\nCurry, who co-anchored the Today show with disgraced host Matt Lauer from 2011 to 2012 as part of more than 25 years with the company, spoke for the first time Wednesday about the sexual harassment allegations that have rocked the entertainment and media worlds, calling them \"overdue.\"\n\n\"We clearly are waking up to a reality and injustice that has been occurring for some time,\" she said. \"I think it will continue to occur until the glass ceiling is finally broken. This is about a power imbalance, where women are not valued as much as men. I'm not talking about people being attracted to other people. I'm talking about people in a workplace who are abusing their power and women and men are suffering. And I think the fact that people are speaking out is important, and the fact that we are moving against this imbalance of power is absolutely overdue.\"\n\nMore: Matt Lauer's ouster creates problems for NBC leadership, and future of 'Today' show\n\nMore: Katie Couric breaks silence on Matt Lauer firing: 'This was not the Matt we knew'\n\nWhen pressed by CBS This Morning hosts Gayle King and Norah O'Donnell about Lauer, Curry didn't say her former co-host's name, with whom she had a notoriously rocky working relationship, but alluded to her unceremonious departure from the Today show in 2012.\n\n\"I'm trying to do no harm in this conversation,\" she said. \"I can tell you that I'm not surprised by the allegations. That means that, you know, I'm walking down that road I'm trying not to hurt people. I know what it's like to be publicly humiliated; I never did anything wrong to be publicly humiliated, and I don't want to cause that pain to someone else.\"\n\n\"But I can say … I would be surprised if many people, or women, did not understand that there was a climate of verbal harassment that existed,\" she continued. \"I think it would be surprising if someone said they didn't see that.\"\n\nHoda Kotb officially takes Matt Lauer's seat on 'Today' NBC News named Hoda Kotb as Savannah Guthrie's permanent co-anchor on 'Today,' and Kathie Lee Gifford is \"so happy.\" USA TODAY\n\nLauer, 60, who co-anchored the NBC talk show for more than 20 years, was ousted from the company on Nov. 29 following sexual harassment accusations against him.\n\nNBC's handling of Curry's exit from Today made network execs look clumsy and panicky, causing a backlash that also splashed Lauer and even her replacement, Savannah Guthrie. She went on to work with NBCUniversal until 2015.\n\nCurry's CBS This Morning interview also previewed her return to TV as host of new PBS series We'll Meet Again. The six-part series, which premieres Jan. 23 at 8 ET, explores dramatic historic events through the eyes of people who went through them and who now want to reunite with someone who helped them survive.\n\nWhen asked this summer at the Television Critics Association whether she keeps up with her former NBC colleagues, Curry said she \"gets most of my news from print these days.\"", "images": ["https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://www.gannett-cdn.com/-mm-/71134a2faca7534d056b7d9126b9d65a071768bc/c=0-464-4765-3156/local/-/media/2018/01/17/USATODAY/USATODAY/636517732176497548-GTY-824491936-92734913.JPG?auto=webp&format=pjpg&width=1200", "https://media.gannett-cdn.com/29906170001/29906170001_5713651092001_5713653131001-vs.jpg?pubId=29906170001", "https://media.gannett-cdn.com/29906170001/29906170001_5700454604001_5700433920001-vs.jpg?pubId=29906170001", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/71134a2faca7534d056b7d9126b9d65a071768bc/c=0-464-4765-3156/local/-/media/2018/01/17/USATODAY/USATODAY/636517732176497548-GTY-824491936-92734913.JPG?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Maeve Mcdermott"], "canonical_link": "https://www.usatoday.com/story/life/tv/2018/01/17/ann-curry-breaks-silence-matt-lauer-im-not-surprised-allegations/1039446001/", "title": "Ann Curry breaks silence on Matt Lauer: 'I’m not surprised by the allegations'", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/tv/2018/01/17/ann-curry-breaks-silence-matt-lauer-im-not-surprised-allegations/1039446001/life/tv", "theme-color": "#ffffff", "og": {"type": "article", "title": "Ann Curry breaks silence on Matt Lauer: 'I’m not surprised by the allegations'", "description": "Curry appeared on 'CBS This Morning' for her first television interview since leaving NBC in 2015.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/71134a2faca7534d056b7d9126b9d65a071768bc/c=0-464-4765-3156/local/-/media/2018/01/17/USATODAY/USATODAY/636517732176497548-GTY-824491936-92734913.JPG?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "Curry appeared on 'CBS This Morning' for her first television interview since leaving NBC in 2015.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1516147200.0, "source": "https://www.usatoday.com", "summary": ""}