{"url": "https://web.archive.org/web/20190210020945/https://screenrant.com/riverdale-bughead-plot-holes-no-sense/", "text": "If you're a fan of Riverdale, you're familiar with Bughead, the couple name for Betty and Jughead, two of the show's main characters. Surprisingly, Betty Cooper and Jughead Jones have formed the defining romance for the entire show which is strange, given that the story ostensibly centered on Archie Andrews (as it is based on the classic Archie comics, with a darker, stylized edge).\n\nThis, unfortunately, is far from the only thing that is bewildering or illogical about the relationship. Riverdale is not exactly known for its realistic depiction of American teenagers but for displaying a scandalous fantasyland where teenagers find the time to solve crimes, commit crimes, protest against other crimes, and have all kinds of relationship drama in the space of one episode. Bughead is no exception to this; in fact, the couple name being \"Bughead\" might just be the only thing about that does.\n\nFrom its humble beginnings, Betty pushed aside her feelings for the main protagonist Archie Andrew to be in a relationship with his best friend, Jughead Jones. Bughead has frequently been a difficult and puzzling relationship, but always a popular one.\n\nFans love seeing the pair deal with unlikely situation, and the Serpent King and Queen have certainly had their share of those. But just because they're popular doesn't mean they make sense all the time, and this list counts down all those incidents where they veered far, far away from the confines of common sense.\n\nHere are 20 Things That Make No Sense About Bughead.\n\nContinue scrolling to keep reading Click the button below to start this article in quick view Share Tweet Email Copy Link Copied\n\n20 They Never Dated In The Comics\n\nThis won't come as a surprise to anyone who actually read the comics, but Bughead wasn't a thing until Riverdale made it one. When the show's writers described their version of Jughead, they made it clear he wasn't the same kind of guy as he was in the comics, as he'd be getting the girls just like Archie. Well, they made good on that prediction quickly, as he became Betty's significant other in the first season.\n\nThe thing that doesn't make sense is that there is no basis for this in the comics.\n\nBetty was Archie's love interest, along with Veronica.\n\nJughead was always preoccupied with his food to care about being in a relationship.\n\nMaking something up without consulting the comics isn't anything new for Riverdale, but it was still bewildering for anyone who knew anything about the source material.\n\n19 Jughead Isn’t Even Attracted To Betty In The Comics\n\nNot only did Jughead never date Betty in the original comics, there's no real way he ever could have. In his classic canon incarnation, Jughead is a carefree soul who never gave a care about women-- and even expressed derogatory and misogynistic opinions about women. That's just the original; the more recent canon version of Jughead would be even less interested.\n\nIn Chip Zdarsky's run on the character, he took the opportunity to make explicit something that had always made sense for the character-- Jughead was ace; a person not attracted to anyone, of any gender.\n\nThis means that Riverdale's Bughead makes no sense even for readers of the modern comics, not just those that remember the original ones.\n\n18 Betty's Quick Rebound\n\nAs anyone familiar with the source material will tell you, Betty is traditionally the main squeeze of the title character of the comics, Archie. Riverdale nodded to that in its opening episode, showing Betty overwhelmed by her feelings for the red-haired hunk. It all built to an emotional climax, where Archie rejects Betty because he doesn't think he's good enough for her.\n\nIt may have seemed for a moment like the writers were building up Barchie as the one true pairing of Riverdale, but if that was the case, nobody told Betty.\n\nBetty seemed to get over her feelings for Archie remarkably quickly, as she was smooching Jughead just five episodes later. Maybe the writers intended Bughead to be a throwaway relationship before Betty eventually returned to Archie, so they had her move to Jughead. Oh, well.\n\n17 The Birthday Party\n\nYou know how Betty is frequently portrayed as the smartest and most emotionally sensitive member of the main cast of Riverdale? Well, she doesn't always live up to that title. One of the major early tiffs in her relationship with Jughead came when she threw him the a surprise birthday party.\n\nWhile Betty's intentions to throw Jughead a surprise birthday party were pure, she didn't consider how Jughead would feel and dismissed his request not to have a party.\n\nDespite all of her friends telling her that Jughead didn't want a party, Betty went ahead with her plan because she was sure he would love it. Jughead's surprise party was a great way to create conflict in the episode - and it led to a big fight between the two). Betty going through with the party, despite having a dozen good reasons not to, doesn't make sense.\n\n16 They Keep Breaking Up And Getting Back Together\n\nAt this point, anyone who doesn't spend their spare time editing fan wikis is just struggling to keep up. Bughead may have started out as a stable relationship in the first season but that changed by the second season. The pair kept breaking up so much that it was hard to tell whether they were together from one episode to the next.\n\nTheir break-ups were double as result of the Black Hood plotline, as he attacked people he deemed \"sinners.\" Bughead broke up to protect one another from attacks over and over again, and fans couldn't keep up with the nonsense from one episode to the next.\n\nSometimes they were together and everything was fine, then they were split up but wanted to get back together, or they seemed to be glad to be apart. It was exhausting.\n\n15 Their Parents Are Into Each Other\n\nThe parents of Riverdale are responsible for most of the over-arching conflict and weirdness of the show, but FP Jones and Alice Cooper take it to another level. Instead of getting embroiled in embezzlement scandals or illegal substance operations like the other \"normal parents,\" they share a romantic history that they hid from their children.\n\nAlice and FP obviously didn't end up together, but they had more than a fling back in the day and it causes all kinds of consequences in the second season. The first is a long-lost son (more on that in a moment) and the other is that they are still crushing on each other, even though their kids are already in a relationship.\n\nIf FP and Alice ever get together, Bughead wouldn't just be a couple, they'd be step-siblings!\n\n14 They Share A Half-Brother\n\nAs we've already mentioned, Betty and Jughead's parents had a torrid romance of their own in the past. For some reason that's not where the awkwardness stops. A guy shows up in season two claiming to be their long-lost son. While Betty and Jughead are not blood-related, it's still pretty creepy to think that they share a half-brother.\n\nFinding out you share a half-brother with your significant other would definitely make things awkward.\n\nCharles Smith, the son that Alice and FP gave away, presents his own subplot in the second season that has little to do with Jughead, but we've got to wonder: what did Bughead think about this? Chances are, they were just as confused by it as the audience was.\n\n13 They’re Each Constantly Doing Stuff The Other Disapproves Of\n\nWould you stay in a relationship if your significant other always seemed to be doing stuff you weren't comfortable with? What about if you were so worried about what they would think of something you did that you didn't tell them about it? Would you still stay in that relationship if both of those things were happening at the same time?\n\nThose situations accurately describe Bughead; a couple that is comprised of two people constantly doing stuff their partner doesn't approve of. There is a reason they keep breaking up, even disregarding the threats from a vigilante.\n\nThese are two teenagers leading different lives, and to be honest, they do a lot of stuff that would cause them to break up. By this point, it's a miracle they don't stay apart.\n\n12 Betty And The Serpents\n\nThe Southside Serpents figure heavily in both of the first two seasons of Riverdale, but that doesn't mean every character has really decided how they feel about them by now. Betty, however, should have figured out where she stands, as this constant flip-flopping is just tiresome for fans at this point.\n\nJughead is the leader of the Serpents now, but Betty sometimes wants Jughead to leave that life behind and other times wants to join up herself. It all came to a head when she performed a provocative dance number for the gang in a bar.\n\nUp until that point, fans didn't really have any idea what Betty really thought of the gang, as there had no rhyme or reason to it.\n\n11 The Time They Kissed Other People\n\nNobody does relationship drama quite as oddly as Riverdale. During one of the periods when Bughead were broken up, Betty and Archie shared a kiss that made their whole friend dynamic weird. Betty and Jughead (and Archie and Veronica) got back with their respective partners, but to make everything \"fair,\" the couples had a bizarre solution.\n\nAfter Betty and Archie shared a kiss in season 2's mid-season finale, Veronica and Jughead kissed each other to get even.\n\nThey kissed in front of Betty and Archie because that's a normal thing that people do and would obviously solve all the relationship troubles, caused by the first kiss. At some point, we're just going to have to accept that instead of doing anything that makes sense, Riverdale is always going to pile weirdness on top of more weirdness.\n\n10 Archie Is Still Jealous\n\nLook, buddy, get over it. You had your chance! In the very first episode, Archie Andrews made it clear that he wouldn't date Betty Cooper. While she may have gotten over it a little too quickly, he doesn't seem to have gotten over it at all.\n\nDespite being the guy who ensured he wouldn't go out with her, Archie still seems unhappy and jealous that Betty is dating his best friend, Jughead.\n\nThis is a classic television dynamic-- character torpedoes a relationship with another character but still manages to feel bad about it-- but it doesn't make sense anymore.\n\nArchie is still shooting Betty longing glances. If he wanted to be with her he could have just said yes at the beginning of the show. Fans have moved on, so why can't he?\n\n9 Betty's Cam Business\n\nBetty Cooper gets into a lot of trouble in the second season because of her supposed half-brother Chic, but the weirdest part has to be the webcam business they set up together. Betty would chat with strangers over the internet in her bedroom, and fans naturally saw more than a few problems with this.\n\nFirst off, it would be illegal for anyone over the age of 18 to video chat with Betty like this. This means Chic's whole operation would be illicit. Second, Betty seems to neglect to tell Jughead about all of this. Third, she never seems to get paid for it, so maybe it's just a hobby. Lastly, it was completely out of character.\n\n8 The Serpent Dance\n\nThere were more than a few strange moments that left fans wondering what the heck just happened in the second season of Riverdale, but this one just might take the cake.\n\nTo prove her devotion to Jughead and protect him, Betty decides that it would be a good idea to perform a song and dance in a public bar. It made a lot of fans uncomfortable, especially if you think about how old Betty is.\n\nThe catch? Betty performed the Serpent Dance not just for Jug and the gang, but also Jug's father and her mother.\n\nTo top it all off, this incredibly awkward scene is set to a cover of \"Mad World\" by Tears for Fears. This moment was so bizarre. Jughead apparently wasn't into it either, he broke up with Betty later that scene.\n\n7 Their Age\n\nRiverdale writers have been notoriously hush-hush about the age of their protagonists. The characters in Riverdale they consistently portray the characters in unrealistically adult situations for kids who are supposed to be in high school. However, since they start out in their second year, we can assume they're somewhere around the age of 16. This poses some problems.\n\nNot only does the intense, serious tone of their relationship not make sense if they're just 16, but it also makes the whole thing pretty creepy - especially when Betty's Dark Betty wig comes into the picture. At some point, the show crossed the line from trashy fantasy high school show to a very weird, uncomfortable story.\n\n6 That Time They Lived Together\n\nWe've mentioned this already, but the fact that these two characters are teenagers and technically minors (though we don't know their exact age) makes a lot of their relationship unrealistic. One of the moments that clarified this came when Bughead moved in together .for about a minute.\n\nSee, Betty moved in with Jug because she couldn't stand living with her mother and Chic, but once Bughead's parents heard about what they were doing, they put a stop to it. Alice Cooper is still Betty's legal guardian, and with FP in agreement, there was nothing she could do to stop her mom from getting her to come back home.\n\nReally, the question is why she thought it would work in the first place.\n\n5 Their Social Causes\n\nYou know the old saying: the couple that protests, investigates mysteries, saves local businesses, and runs for school president together stays together.\n\nThat's just part of the laundry list of social causes Bughead has undertaken as a couple. Anyone who actually went to high school can see why that would be unrealistic.\n\nIt's great to see Jughead and Betty get involved with various social cause while conducting their investigations, but how do they have so much time on their hands?\n\nThe only way Betty and Jughead could find the time to actually support this many social causes on top of their relationship drama and Serpent subplots would be to never sleep. There just isn't enough time in the day to do all the stuff they're supposed to be getting up to.\n\n4 They Should Be More Famous\n\nThis should be relatively self-explanatory. If your father was one of the most notorious criminals your town had ever seen and you were also dating someone whose father was another notorious criminal, you'd expect some kind of media attention. Add on top of that all the other newsworthy things Betty and Jughead have done and they really should be tabloid celebrities by this point.\n\nDespite being school journalists whose work has apparently gone \"viral,\" their involvement with gangs and crime, and all the other stuff, the most that happens to them by way of the press is the occasional paparazzo outside their house after some event.\n\nIf Betty and Jughead had really gone through all this, they'd be known all over the country, yet the show treats them like they're still average teenagers.\n\n3 They Have Committed Too Many Crimes To Count\n\nRiverdale was always pitched as the dark, edgy version of the Archie comics, but nobody expected them to make even the traditionally squeaky-clean characters into morally ambiguous criminals. Betty and Jughead may start the show acting like they're the conscience of the cast, but we know better by now.\n\nStarting relatively small in the first season, the couple committed crimes like squatting or trespassing for good reasons. Now Betty and Jughead have graduated well beyond normal civil disobedience. They're carrying out violent attacks, joining the webcam industry, and even helping cover up the bodies of the deceased.\n\nAt this point, they're no longer the conscience of the show but the accessories and perpetrators of a shockingly long list of crimes.\n\n2 They’re Apparently Crime Lords Now\n\nJughead was born into a gang since his dad, FP, was the leader of the Southside Serpents. Despite declaring he had no interest in joining up with them at the beginning of the series, he had started running with them by the end of the first season. Somehow, by the end of the second, he and Betty were co-leaders of the same group.\n\nJughead asked Betty to be his \"queen\" in the finale after he became the leader of the Serpents earlier in the season.\n\nThis was a more than a little out of character, given that these are two sensitive teenagers who previously had been characterized by their love of journalism and movies. Not only was it completely unrealistic, even for this stylized version of America, organized crime was way out of character for Bughead.\n\n1 They Don't Get Upset By Things They Should Definitely Get Upset By\n\nFor a couple that was introduced as the moral center of the show, Betty and Jughead sure seem to be fine with some not-so-great stuff. As the second season seemed to spiral further and further out of control and Betty and Jughead were involved in morally questionable acts, fans expected them to call each other on them but that didn't always happen.\n\nJughead once skinned a tattoo off a lady's arm with a knife, Betty got into the webcam business, and they both helped cover up a crime her \"brother\" committed. Amongst all these morally questionable acts, the couple either didn't tell each other or knew and didn't seem to care much.\n\nThese are only some of the morally questionable choices they made, and it just doesn't make sense that they wouldn't have a problem with them.\n\n---\n\nIs there anything that we missed about Bughead on Riverdale? Tell us in the comments!", "images": ["https://web.archive.org/web/20190210020945im_/https://screenrant.com/public/build/images/tt-logo-full-white.04a6f0d4.svg", "https://web.archive.org/web/20190210020945im_/https://screenrant.com/public/build/images/cb-logo-full-white.afca2e29.svg", "https://web.archive.org/web/20190210020945im_/http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1", "https://web.archive.org/web/20190210020945im_/https://screenrant.com/public/build/images/tg-logo-full-white.fc9e742a.svg", "https://web.archive.org/web/20190210020945im_/https://screenrant.com/public/build/images/tq-logo-full-white.7436bde3.svg", "https://web.archive.org/web/20190210020945im_/https://screenrant.com/public/build/images/mm-logo-full-white.fe72c74c.svg", "https://web.archive.org/web/20190210020945im_/https://screenrant.com/public/build/images/bg-logo-full-white.8242bbb9.svg", "https://web.archive.org/web/20190210020945im_/https://www.facebook.com/tr?id=297467373958238&ev=PageView&noscript=1", "https://web.archive.org/web/20190210020945im_/https://screenrant.com/public/build/images/th-logo-full-white.7684e614.svg", "https://web.archive.org/web/20190210020945im_/https://screenrant.com/public/build/images/sr-logo-full-white.b0cc2b44.svg", "https://web.archive.org/web/20190210020945im_/https://static3.srcdn.com/wordpress/wp-content/uploads/2018/06/Betty-and-Jughead-Riverdale-season-1-finale.jpg", "https://web.archive.org/web/20190210020945im_/https://q.quora.com/_/ad/91f52889f6a04390a65ad2591c59986e/pixel?tag=ViewContent&noscript=1", "https://web.archive.org/web/20190210020945im_/https://screenrant.com/public/build/images/ts-logo-full-white.54beb4cf.svg", "https://web.archive.org/web/20190210020945im_/https://screenrant.com/public/build/images/tr-logo-full-white.090c581a.svg", "https://web.archive.org/web/20190210020945im_/https://screenrant.com/public/build/images/tv-logo-full-white.642d3d01.svg", "https://web.archive.org/web/20190210020945im_/https://screenrant.com/public/build/images/hc-logo-full-white.5f66cfe4.svg"], "top_img": "https://web.archive.org/web/20190210020945im_/https://static3.srcdn.com/wordpress/wp-content/uploads/2018/06/Betty-and-Jughead-Riverdale-season-1-finale.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20190210020945/https://screenrant.com/riverdale-bughead-plot-holes-no-sense/", "title": "Riverdale: 20 Things That Make No Sense About Bughead", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "description": "Betty and Jughead stole the spotlight to become Riverdale's most popular couple, but not everything about their relationship makes sense.", "og": {"title": "Riverdale: 20 Things That Make No Sense About Bughead", "type": "article", "image": {"identifier": "https://web.archive.org/web/20190210020945im_/https://static3.srcdn.com/wordpress/wp-content/uploads/2018/06/Betty-and-Jughead-Riverdale-season-1-finale.jpg", "width": 1000, "height": 500}, "url": "https://web.archive.org/web/20190210020945/https://screenrant.com/riverdale-bughead-plot-holes-no-sense/", "locale": "en_US", "description": "Betty and Jughead stole the spotlight to become Riverdale's most popular couple, but not everything about their relationship makes sense.", "site_name": "ScreenRant"}, "article": {"published_time": "2018-07-01T16:07:02Z", "section": "Lists"}, "fb": {"app_id": 822150531210883, "pages": 10765693196}}, "movies": [], "publish_date": 1530461222.0, "source": "https://web.archive.org", "summary": ""}