{"url": "https://en.wikipedia.org/wiki/Demi-Leigh_Nel-Peters", "text": "South African model and former beauty queen\n\nDemi-Leigh Tebow (née Nel-Peters; born 28 June 1995) is a South African model and beauty queen who was crowned Miss Universe 2017. She was crowned Miss South Africa 2017, and is the second Miss Universe winner from South Africa, following Margaret Gardiner who was crowned Miss Universe 1978.\n\nEarly life and education\n\nNel-Peters was born on 28 June 1995 in Sedgefield, Western Cape, to Bennie Peters and Anne-Marie Steenkamp.[2] Her half-sister, Franje, had cerebellar agenesis, and Nel-Peters said that she was the most significant motivator in her life; Franje died on 4 May 2019, which Nel-Peters confirmed on her Instagram.[3][4][5][6]\n\nNel-Peters graduated from university in March 2017, a few days before winning the Miss South Africa 2017 competition.[7] She is fluent in both English and Afrikaans.[8][9]\n\nPageantry\n\nMiss South Africa 2017\n\nNel-Peters began her pageantry career representing Western Cape in the Miss South Africa 2017 competition on March 26, 2017, which she won.[citation needed] As Miss South Africa, she had the right to represent South Africa in both Miss World 2017 and Miss Universe 2017, but since the dates of the two pageants coincided, she was sent only to Miss Universe, held in Las Vegas, Nevada.\n\nMiss Universe 2017\n\nIn the final round Steve Harvey asked Nel-Peters, \"What quality in yourself are you most proud of and how will you apply that quality to your time as Miss Universe?\" She said:\n\nAs a Miss Universe, you have to be confident in who you are as an individual. And Miss Universe is a woman that has overcome many fears, and by that she is able to help other women to overcome their fears. She is a woman that nothing is ever too much to ask for and I think that is exactly who I am.[10]\n\nWhen asked about what she thought was the most important issue regarding women in the workplace, she said:\n\nIn some places, women get paid 75% of what men earn for doing the same job, working the same hours — and I do not believe that this is right. I think we should have equal work for equal pay for women all over the world.[11]\n\nShe went on to win the competition and was crowned Miss Universe 2017 by outgoing titleholder Iris Mittenaere.[12][13][14] Nel-Peters is the second titleholder from South Africa; Margaret Gardiner won Miss Universe 1978.[15][16][17]\n\nNel-Peters said during a segment at Miss Universe that she wants to use her self-defence workshops to help as many women as she can.[6][18] This stems from an incident a month after she was crowned Miss South Africa, when she was carjacked at Hyde Park. She handed over her car keys but was forced into her car by the carjackers.[19][20] She punched one of them in the throat and managed to run away and get help.[19][21][22]\n\nIn her capacity as Miss Universe, Nel-Peters visited the Philippines (twice), Indonesia (twice), Thailand (twice), France, Mexico (twice), Ecuador, India, Lebanon, Egypt, Malaysia, various cities in the United States, and her home country, South Africa.\n\nNel-Peters ended her reign on December 17, 2018, in Bangkok, Thailand, the host nation of the 67th Miss Universe pageant. She eventually crowned Catriona Gray of the Philippines as her successor.\n\nPersonal life\n\nDuring her reign as Miss Universe 2017, Nel-Peters began dating Tim Tebow, a former professional American football quarterback and former professional baseball outfielder for the New York Mets minor league affiliates. She celebrated her first American Thanksgiving with his family at their home.[23] During her farewell as Miss Universe 2017, Nel-Peters thanked Tebow for his support.[24] Nel-Peters and Tebow became engaged on January 9, 2019, at Tebow's family farm in Jacksonville, Florida.[25] They married on January 20, 2020, in Franschhoek, South Africa, about an hour outside of Cape Town.[26] Like Tebow, she is a Christian.[27]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Flag_of_Mpumalanga_Province.svg/23px-Flag_of_Mpumalanga_Province.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/Flag_of_Missouri.svg/23px-Flag_of_Missouri.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/Flag_of_France.svg/23px-Flag_of_France.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Flag_of_the_District_of_Columbia.svg/23px-Flag_of_the_District_of_Columbia.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/b/b2/Demi_Leigh-Nel_Peters_in_2018_%282%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Flag_of_Indonesia.svg/23px-Flag_of_Indonesia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Demi_Leigh-Nel_Peters_in_2018_%282%29_%28cropped%29.jpg/220px-Demi_Leigh-Nel_Peters_in_2018_%282%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Flag_of_the_Philippines.svg/23px-Flag_of_the_Philippines.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Flag_of_South_Africa.svg/80px-Flag_of_South_Africa.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/23px-Flag_of_India.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f1/Flag_of_the_Western_Cape_Province.png/23px-Flag_of_the_Western_Cape_Province.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Flag_of_South_Africa.svg/23px-Flag_of_South_Africa.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/b/b2/Demi_Leigh-Nel_Peters_in_2018_%282%29_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Demi-Leigh_Tebow", "title": "Demi-Leigh Tebow", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/b/b2/Demi_Leigh-Nel_Peters_in_2018_%282%29_%28cropped%29.jpg", "width": 640, "height": 740}, "title": "Demi-Leigh Tebow - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}