{"url": "https://www.marieclaire.com/celebrity/a16646382/dakota-johnson-fifty-shades-freed-interview/", "text": "Marie Claire newsletter Celebrity news, beauty, fashion advice, and fascinating features, delivered straight to your inbox! Contact me with news and offers from other Future brands Thank you for signing up to . You will receive a verification email shortly. There was a problem. Please refresh the page and try again. By submitting your information you agree to the Terms & Conditions (opens in new tab) and Privacy Policy (opens in new tab) and are aged 16 or over.\n\nDakota Johnson just completed her final turn as Anastasia Steele in the incredibly erotic/hilarious Fifty Shades Freed (opens in new tab)—a film that saw Ana and Christian take a break from the \"Red Room\" to get married, get pregnant, and deal with a sinister former publisher named Hyde who's hell bent on killing everyone whilst being incredibly extra.\n\n\"It's sometimes necessary to have a shot of something strong beforehand.\"\n\nBut, don't worry, there's still plenty of passionate sex scenes for your viewing enjoyment. As a result, Johnson spent a ton of time navigating her way through some of the series' most intensely intimate moments (three words: ice cream foreplay). Here, the actress talks to MarieClaire.com about which scene was the hardest to film, the least sexy thing about making this movie, doing shots with Jamie Dornan, and having a thong superglued onto her body. Yes, truly.\n\n(Image credit: Universal Pictures)\n\nYes, there's a specific sex scene shooting schedule:\n\n\"If we could do all of the sex scenes in a day or so, that would truly be in the Guinness Book of World Records. A lot of it was dependent on the locations, and because we shot the second and third film back to back, the sex scenes were kind of grouped in all together for the most part. And some were not in those two weeks.\"\n\nThat intense handcuffing scene in the Red Room (you know the one) was incredibly tough:\n\n\"The most difficult one by far—I think in all three movies—was a sex scene in the third film where I was handcuffed with my arms and legs to the gate. It's like a fence thing that comes down. And I was blindfolded. And it was kind of shocking, because I didn't realize that no matter how prepared or rehearsed I was, when your senses are taken away like that, you can't control the way your nervous system will react. So it was really tricky to navigate that scene. It was kind of difficult.\"\n\nThey do shots before sex scenes, which, understandable:\n\n\"Most of [our preparation] is just really figuring out exactly how were are going to accomplish the scene beforehand—so that there's not a lot of waiting around while we're both vulnerable. But, if something is very, very difficult, it's sometimes necessary to have a shot of something strong beforehand.”\n\nDoing those scenes never gets less awkward:\n\n\"No, it's never easy. It's not casual and it's not fun. It never got easy.\"\n\n(Image credit: Universal Pictures)\n\nUm, she had a thong superglued to her body:\n\n\"Oh yeah, Jamie's little pouch. It's super not glamorous—it's really unsexy. He wore that, and I had these sort of strapless thongs that had glue on them. It's not glue, but it's sticky. They're, like, basically if it were a nipple pastie, but underwear. But it's only sticky at the top, it's not sticky the whole way. It would also come off because the adhesive would wear out, so then they would superglue it to my body so that it wouldn't fall off. And I would wear two of them. It's not painful, I mean, it's barely anything. But I guess you have some sense of being covered. It's f*cking bizarre.\"\n\nGuys, they worked with a \"sex advisor\" so never say this movie wasn't well-researched:\n\n\"Jamie mostly had an advisor that was on set for the first film, not so much for the second. Then we just had people who specialized in knowing how things work, like how to use certain tools and toys. There's a certain method. It's very intricate and the details are really important. The rules are also really important. We didn't want to go make a movie about something we didn't research to the bone. So to really honor the BDSM community and we did it the right way.\"\n\nFifty Shades Freed is in theaters now.", "images": ["https://cdn.mos.cms.futurecdn.net/yMMjLcsF7TXJFZfF4GAGMg-415-80.jpg", "https://vanilla.futurecdn.net/marieclaireus/missing-image.svg", "https://www.marieclaire.com/media/img/missing-image.svg", "https://www.facebook.com/tr?id=756449714459937&ev=PageView&noscript=1", "https://cdn.mos.cms.futurecdn.net/QwyBjtUBDukXvqp7nK2pX-1200-80.jpg"], "top_img": "https://cdn.mos.cms.futurecdn.net/QwyBjtUBDukXvqp7nK2pX-1200-80.jpg", "keywords": [], "authors": ["Alex Warner", "Brooke Knappenberger", "Jenny Hollander", "Mehera Bonner", "The Editors", "Andrea Park", "Iris Goldsztajn", "Katherine J Igoe", "Nicole Briese", "Window.Slicecomponents"], "canonical_link": "https://www.marieclaire.com/celebrity/a16646382/dakota-johnson-fifty-shades-freed-interview/", "title": "Dakota Johnson's Modesty Thong Had to Be Superglued to Her Body During 'Fifty Shades Freed'", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "pub_date": "2018-02-12T11:44:33+00:00", "description": "Dakota Johnson on filming sex scenes in Fifty Shades Freed.", "robots": "max-image-preview:large", "msapplication-TileColor": "#000000", "msapplication-TileImage": "https://cdn.mos.cms.futurecdn.net/flexiimages/l0uowirhzd1627591128.svg", "og": {"site_name": "Marie Claire Magazine", "image": {"identifier": "https://cdn.mos.cms.futurecdn.net/QwyBjtUBDukXvqp7nK2pX-1200-80.jpg", "width": 1200}, "type": "article", "title": "Dakota Johnson's Modesty Thong Had to Be Superglued to Her Body During 'Fifty Shades Freed'", "url": "https://www.marieclaire.com/celebrity/a16646382/dakota-johnson-fifty-shades-freed-interview/", "description": "The actress talks to MarieClaire.com about the least sexy parts of making Freed."}, "article": {"publisher": "https://www.facebook.com/MarieClaire", "published_time": "2018-02-12T11:44:33Z", "modified_time": "2021-09-21T12:32:21.887Z"}, "parsely-type": "post", "parsely-post-id": "KXcujnWyqG4Y9K239z3GwJ", "parsely-pub-date": "2018-02-12T11:44:33Z", "parsely-title": "Dakota Johnson's Modesty Thong Had to Be Superglued to Her Body During 'Fifty Shades Freed'", "parsely-link": "https://www.marieclaire.com/celebrity/a16646382/dakota-johnson-fifty-shades-freed-interview/", "parsely-image-url": "https://cdn.mos.cms.futurecdn.net/QwyBjtUBDukXvqp7nK2pX.jpg", "parsely-section": "Celebrity", "parsely-tags": "Category: Celebrity,Category: News,movies,celebrity,standard-article,serversidehawk", "parsely-author": "Alex Warner", "twitter": {"card": "summary_large_image", "site": "@marieclaireus", "title": "Dakota Johnson's Modesty Thong Had to Be Superglued to Her Body During 'Fifty Shades Freed'", "description": "The actress talks to MarieClaire.com about the least sexy parts of making Freed.", "creator": "@marieclaireus", "image": "https://cdn.mos.cms.futurecdn.net/QwyBjtUBDukXvqp7nK2pX-1200-80.jpg", "account_id": 15469402}, "google-site-verification": "G8uYPAX70T_vfdmDhxnUNSykxtjRTkSvHhloGBWT6R8", "taboola": {"url": "https://www.marieclaire.com/celebrity/a16646382/dakota-johnson-fifty-shades-freed-interview/"}, "botify-site-verification": "gEo2ltw4ZxjJkBcaADHlIGePpMrucY2w", "msvalidate.01": "CC462E6DF91492086145CA5EBDCB615E"}, "movies": [], "publish_date": 1518435873.0, "source": "https://www.marieclaire.com", "summary": ""}