{"url": "https://www.celebritynetworth.com/richest-celebrities/actors/june-thompson-net-worth/", "text": "June Shannon (Thompson) Net Worth: June Shannon, also known as June Thompson or Mama June, is an American reality television personality who has a net worth of $50 thousand. She rose to fame along with her family as cast members of the TLC reality series \"Here Comes Honey Boo Boo\".\n\nEarly Life: June Edith \"Mama June\" Shannon, also known as June Thompson, was born on August 10, 1979, in McIntyre, Georgia. Her parents, Sandra Hundley and Marvin Shannon, divorced when she was two years old. She has three siblings, Joanne Shannon, Joanie Shannon (now McDonald), and James Edward Shannon; and two half-siblings, Michelle Shannon and Nicole Shannon. She suffered from cataracts in her childhood. Because these cataracts went untreated, it resulted in June becoming legally blind.\n\nFamily: June became pregnant with her first daughter, Anna, when she was just fourteen years old. She gave birth a few days after her fifteenth birthday, and ended up dropping out of high school. She was able to earn her GED later. June has three more daughters, Jessica, Lauryn, and Alana.\n\nRise to Fame: June and her family, the Shannons, were first introduced to American television audiences in 2012, on the TLC reality show \"Toddlers & Tiaras\". June's youngest daughter Alana \"Honey Boo Boo\" Shannon would occasionally compete in beauty pageants for fun, and the show followed the mother-daughter duo through various events. Alana's bubbly personality and sense of humor made her a fan favorite, and earned her and her family their own TLC spinoff show. \"Here Comes Honey Boo Boo\" premiered on August 8, 2012, and ran for four seasons. It ran for four seasons, until 2014. Filming on the show was abruptly halted in the middle of the fifth season. The completed episodes from season 5 of the show were later aired in April 2017.\n\nIn 2017, June landed her own reality show on We TV, called \"Mama June: From Not to Hot\". The show first chronicled her weight loss transformation after she underwent major weight loss surgery, as well as other occasions in the family's life such as Pumpkin's (Lauryn) wedding to her boyfriend. After undergoing bariatric surgery and a sleeve gastrectomy, June reportedly lost over 300 pounds and went from 460 pounds to 160 pounds. Additionally, she is reported to have undergone around $75,000 worth of cosmetic surgery to further enhance her appearance. Later seasons document June's deteriorating health and legal issues, and her rocky relationship with boyfriend Geno Doak. In March 2019, June was arrested along with Geno Doak for felony drug possession in Alabama. Following the arrest, \"Mama June: From Not to Hot\" was rebranded as \"Mama June: Family Crisis\".\n\nRelationship History: June previously was in a relationship with Michael Anthony Ford, with whom she had her daughters, Jessica and Lauryn. Ford has since been convicted for trying to exploit oral sex from a minor female online, and is incarcerated and ineligible for parole until 2026. Then, June entered into a relationship with Mark McDaniel, who was later convicted of sexually abusing her eldest daughter Anna. Both Ford and McDaniel are now registered sex offenders. It was June's continued association with McDaniel that prompted the sudden cancellation of \"Here Comes Honey Boo Boo\". June then began dating Mike \"Sugar Bear\" Thompson, the father of her daughter Alana. The couple remained together until 2014.\n\nTrouble with the Law: June's romantic partner, Eugene Edward \"Geno\" Doak, has a criminal history that includes felony charges, and he previously served time at Coastal State Prison. His other charges include misdemeanor domestic violence. On March 13, 2019, the couple were arrested near Tuskegee, Alabama, after officers responded to a call about domestic violence. The pair were allegedly found with crack cocaine and a crack pipe. June was charged with possession of a controlled substance and drug paraphernalia. Doak received the same charges, with the additional charge of third-degree domestic violence.", "images": ["https://vz.cnwimg.com/wp-content/uploads/2014/02/GettyImages-497948812.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://vz.cnwimg.com/thumb-900x/wp-content/uploads/2014/02/June-Shannon.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2014/02/GettyImages-497948812.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/june-thompson-net-worth/", "title": "June Shannon (Thompson) Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "June Shannon net worth and salary: June Shannon, also known as June Thompson, is an American reality television personality who has a net worth of", "cnw_share_fb_count": 76, "cnw_share_tw_count": 52, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "June Shannon (Thompson) Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/june-thompson-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2014/02/GettyImages-497948812.jpg", "site_name": "Celebrity Net Worth", "description": "June Shannon net worth and salary: June Shannon, also known as June Thompson, is an American reality television personality who has a net worth of"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2020-11-06T23:45:35+00:00", "published_time": "2020-10-19T00:23:33+00:00", "section": "Actors", "tag": "june thompson worth"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2014/02/GettyImages-497948812.jpg", "title": "June Shannon (Thompson) Net Worth", "description": "June Shannon net worth and salary: June Shannon, also known as June Thompson, is an American reality television personality who has a net worth of"}}, "movies": [], "publish_date": 1603067013.0, "source": "https://www.celebritynetworth.com", "summary": ""}