{"url": "https://tribune.com.pk/story/1717927/4-17-rules-meghan-markle-follow-now-shes-royal/", "text": "PHOTO: THE SUN\n\nPHOTO: TELEGRAPH\n\nPHOTO: DAILY EXPRESS\n\nPHOTO: DAILY MIRROR\n\nPHOTO: ABC\n\nPHOTO: THE SUN\n\nPHOTO: VANITY FAIR\n\nPHOTO: E! NEWS\n\nPHOTO: TELEGRAPH\n\nPHOTO: ABC\n\nPHOTO: ALEXI L\n\nPHOTO: HARPER'S BAZAAR\n\nPHOTO: BBC\n\nPHOTO: THE SUN\n\nPHOTO: AMAZON\n\nPHOTO: DAILY MIRROR\n\nPHOTO: NDTV FOOD\n\nThe Royal wedding created a lot of buzz worldwide and was followed by many chanting how 'lucky' Meghan Markle is to marry a prince. However, what most may not know is that it isn't all fun and games. Becoming a royal comes with a lot of responsibility and rules.Meghan too, will have to adhere to many of these royal rules to avoid major faux pas and stay in the Queen's good books. Compiled from E! News , here are 17 rules the recently appointed Duchess of Sussex will have to follow.During her first official event with Prince Harry, Meghan revealed that she is no longer able to take selfies with fans. \"We're not allowed to do selfies,\" she stated.The rule was created to encourage people to make eye contact and make conversation with royals, rather than turning their backs to them to take a selfie.The former Suits star most definitely has a pretty big fan following and has probably given out countless autographs in the past. However, under no circumstances is she allowed to sign any more autographs.Along with all her social media accounts, Meghan also had to give up her lifestyle blog The Tig. All social media for her is now handled by the royal family's various accounts, but most updates about her and Harry are handled through the Kensington Palace account, as are the updates about Prince William and Kate Middleton.Meghan's not allowed to have her own social media page, which is why her own lifestyle blog and Instagram, The Tig, went dark last year.Members of the Royal Family are prohibited from wearing dark and coloured nail polish. Meghan wore Essie's Ballet Slippers to the Royal Wedding, which happens to be the Queen's favourite. We are pretty sure that the colour is here to stay.Ever since the then-Princess Elizabeth and Prince Philip had to travel back to England from Africa in regular clothes due to King George's passing, it is imperative that all royals always travel with a set of funeral clothes in order to be respectful.The queen expects female family members, includingKate Middleton and Camilla Parker Bowles, to curtsy when they enter a room in her presence, even when it's an informal occasion. So, Meghan better get used to the curtsy. If she is at an official event, the Duchess must also curtsy to anyone who outranks her title.The queen disapproves of hemlines higher than the knee. Regular female visitors such as Kate, Camilla, Princess Beatrice and Princess Eugenie are already aware of the fashion stipulation. If Meghan hasn't already ditched her little black dresses or her minis, it's time for her to do so.It's frowned upon for Royal family members to cross their legs. You'll never see Kate crossing her legs anywhere other than at her ankles. It's time for Meghan to let go of any such habit.Apparently, the Queen is repelled by wedged heels. So if Meghan owns any such pairs, she will have to throw them out immediately! Although Kate has been seen wearing the despised shoes, you will never find a photo of the Duchess of Cambridge rockin' a wedge in front of her royal highness.When dining with her majesty, Meghan will always have to eat at 8:30pm until 10pm. The Queen is known for strictly adhering to her royal schedule.At a Royal family gathering, Meghan will always have to be seated next to Prince Harry.There is a strict code of conduct for how to enter a room when you are with the royals. Here's the royal order: Queen Elizabeth, Prince Philip, Prince Charles, Camilla, Prince William, Kate, Prince Harry and then Meghan.Meghan cannot begin eating her meal until the Queen has started hers. The former actor also needs to stop eating as soon as the Queen stops eating, even if there is still food left on the plate.If the newly weds stay at the Queen's house, they have to stay up until her majesty falls asleep. Apparently it's considered bad form to call it a night before the monarch.This may seem like an unusual rule but Monopoly is not allowed. Back in 2008, the Leeds Building Society gave the Duke of York Prince Andrewthe board game of Monopoly to which he responded, \"We’re not allowed to play Monopoly at home. It gets too vicious.\"Tea time is a very important time for royals. Etiquette expert Myka Meier shared that the correct way to drink tea is to use your thumb and index finger to hold the top of the handle, while the middle finger supports the bottom.You should also sip from the same spot the entire time so that the rim doesn’t get lipstick stains. If you are a coffee drinker, you should loop your index finger through the handle. But beware—no pinkies out. This is exactly how the royals are expected to drink beverages.It's an ancient royal tradition to say no to shellfish in order to avoid food poisoning. While the Royal family does not always follow this rule, her royal highness the Queen has apparently never touched shellfish in her entire life.Have something to add to the story? Share it in the comments below.", "images": ["https://i.tribune.com.pk/media/images/logos/tribune-logo.webp", "https://c.tribune.com.pk/2018/05/monoopoly-1527229468.jpg", "https://d5nxst8fruw4z.cloudfront.net/atrk.gif?account=UTRSn1QolK10mh", "https://tribune.com.pk/images/logo/express-com-pk-logo.webp", "https://tribune.com.pk/images/footer/apple.webp", "https://tribune.com.pk/images/logo/food-tribune-logo.webp", "https://c.tribune.com.pk/2018/05/9-1527229210.png", "https://c.tribune.com.pk/2018/05/5-1527229074.jpg", "https://i.tribune.com.pk/media/images/1717927-elle-1527157569/1717927-elle-1527157569.jpg", "https://tribune.com.pk/images/logo/campusguru-logo.webp", "https://c.tribune.com.pk/2018/05/13-1527229262.jpg", "https://c.tribune.com.pk/2018/05/16-1527229492.jpg", "https://c.tribune.com.pk/2018/05/11-1527229293.jpg", "https://tribune.com.pk/images/footer/android.webp", "https://c.tribune.com.pk/2018/05/7-1527229149.jpg", "https://c.tribune.com.pk/2018/05/2-1527228975.jpg", "https://c.tribune.com.pk/2018/05/14-1527229425.jpg", "https://i.tribune.com.pk/media/thumbs/tribune-logo-grey-450x300.webp", "https://c.tribune.com.pk/2018/05/1-1527228923.jpg", "https://tribune.com.pk/images/logo/express-pk-logo.webp", "https://c.tribune.com.pk/2018/05/8-1527229182.jpg", "https://c.tribune.com.pk/2018/05/6-1527229105.jpg", "https://c.tribune.com.pk/2018/05/shel-1527229521.jpg", "https://tribune.com.pk/images/logo/express-entertainment-logo.webp", "https://i.tribune.com.pk/media/images/magazine+thumbs/epaper.webp", "https://c.tribune.com.pk/2018/05/harpers-1527229335.jpg", "https://c.tribune.com.pk/2018/05/3-daily-express-1527229007.jpg", "https://i.tribune.com.pk/assets/images/footer-tribune.logo.webp", "https://tribune.com.pk/images/logo/cricketpakistan-logo.webp", "https://c.tribune.com.pk/2018/05/4-1527229038.jpg", "https://c.tribune.com.pk/2018/05/10-1527229368.jpg"], "top_img": "https://i.tribune.com.pk/media/images/1717927-elle-1527157569/1717927-elle-1527157569.jpg", "keywords": [], "authors": [], "canonical_link": "https://tribune.com.pk/story/1717927/4-17-rules-meghan-markle-follow-now-shes-royal", "title": "17 rules Meghan Markle has to follow now that she's a Royal", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "ahrefs-site-verification": "80d91b866834629ca6d4329f97e56e8b3e664a02379ef1426de12c9cf7ce2c34", "fb": {"admins": 503171569, "app_id": 278477199157577, "pages": 111457038871331}, "twitter": {"widgets": {"csp": "on"}, "card": "summary_large_image", "site": "@etribune", "title": "17 rules Meghan Markle has to follow now that she's a Royal", "description": "From no selfies to perfecting the curtsy, the new Duchess will be adjusting to a whole new lifestyle", "image": "https://i.tribune.com.pk/media/images/1717927-elle-1527157569/1717927-elle-1527157569.jpg", "domain": "https://tribune.com.pk", "creator": "@etribune"}, "csrf-token": "mrNjskGqyO2EtxCD9PYlRh7HDYbPSp5tZhdRAdW8", "og": {"locale": "en_US", "url": "https://tribune.com.pk/story/1717927/4-17-rules-meghan-markle-follow-now-shes-royal", "site_name": "The Express Tribune", "type": "article", "title": "17 rules Meghan Markle has to follow now that she's a Royal | The Express Tribune", "description": "From no selfies to perfecting the curtsy, the new Duchess will be adjusting to a whole new lifestyle", "image": "https://i.tribune.com.pk/media/images/1717927-elle-1527157569/1717927-elle-1527157569.jpg", "article": {"section": "News"}}, "description": "From no selfies to perfecting the curtsy, the new Duchess will be adjusting to a whole new lifestyle", "title": "17 rules Meghan Markle has to follow now that she's a Royal", "article": {"tag": "royal rules", "publisher": "https://tribune.com.pk", "author": "https://tribune.com.pk/author/364", "section": "Life & Style", "published_time": "2018-05-25T02:06:04+00:00"}, "keywords": "Prince Harry, Meghan Markle, Latest, Royal Wedding, royal rules"}, "movies": [], "publish_date": 1527213964.0, "source": "https://tribune.com.pk", "summary": ""}