{"url": "https://web.archive.org/web/20170510202821/http://www.forbes.com/sites/maddieberg/2017/05/10/scandal-to-end-after-season-7/", "text": "(ABC/Richard Cartwright)\n\nShonda Rhimes' Scandal will come to an end next year, according to a report from TVLine. The series, which is part of ABC's popular T.G.I.T Thursday night lineup, has been a hit for the network and has helped secure Rhimes' dominance and make a big name out of star Kerry Washington, who plays Washington D.C.'s \"fixer\" Olivia Pope.\n\nThis should not come as a huge surprise to big Shondaland fans, as Rhimes herself said that the show would have a shorter shelf life than her original hit, Grey's Anatomy, which is now in its 13th season. \"I feel like there is a finite amount of Scandal to be told,\" she told NPR in 2013. \"So I know what the end of Scandal will be, and I feel really good about that. And I can see where the end point is.\"\n\nThus the show's conclusion was the decision of Rhimes, not the network. Among the advertiser-coveted 18 to 49 demographic, the show was among the 20 highest-rated shows of 2016. The current season averages 5.699 million viewers and 1.46 viewers in the 18-49 demo. While this marks a drop from the fifth season's average of 7.18 million viewers, the current live number is impressive considering the steady decline of live-viewership. Scandal remains one of ABC's most popular series and a large reason why the network routinely beats the other broadcasters on Thursday nights.\n\nThese ratings, of course, have allowed the network to pull in a hefty amount in ad revenue. At its peak, Scandal was part of a Thursday night block that brought ABC over half a billion dollars. In 2016, Scandal brought in $75 million for ABC--more than How to Get Away with Murder or The Catch, according to iSpot.tv.\n\n\"What Shonda Rhimes possesses is this extraordinary instinct and compass for what our audience needs,\" then-president of ABC Entertainment group Paul Lee told FORBES in 2013. \"That Shonda is free and has a huge amount of power to pursue her vision is precisely how the magic happens.\"\n\nThe network isn't the only beneficiary of Scandal's popularity. The show's stars have risen to prominence--and their wallets have grown--with the series. Washington routinely lands high on Forbes' list of highest-paid TV actresses. Last year, she pulled in $12 million, with about half of that coming from her salary from the show. Being on the show has made her well-known enough to land lucrative endorsement deals with the likes of Neutrogena and a commercial with Apple Music.\n\nAs a black lead on a broadcast series, Washington's star turn has also brought much-needed diversity to prime time. After the success of Scandal, Rhimes brought another African American woman--Viola Davis, the first black woman to ever win the Emmy for Best Lead Actress in a Drama--to the limelight on How to Get Away with Murder. On broadcast TV, only 22.6% of series regulars are of underrepresented racial minorities according to the 2016 Annenberg report on diversity. In dramas, like Scandal, this percentage drops. Unfortunately, that means two dramas with black leads is a big deal for the industry.\n\n“There’s always room for our film and television, for our art, to be more representative of who we are as a culture. I think for me especially, being a person of color and a woman, you really see that intersection,\" she told WWD.\n\nFor the latest on the entertainment industry, follow me on Twitter @MadelinePBerg.", "images": ["https://web.archive.org/web/20170510222151im_/https://blogs-images.forbes.com/files/2015/02/maddieberg_avatar_1425069302.jpg", "https://web.archive.org/web/20170510222151im_/https://blogs-images.forbes.com/maddieberg/files/2017/05/146250_9935-900x600.jpg?width=960", "https://web.archive.org/web/20170510222151im_/https://blogs-images.forbes.com/maddieberg/files/2017/05/146250_9935-900x600.jpg?width=640&height=434"], "top_img": "https://web.archive.org/web/20170510222151im_/https://blogs-images.forbes.com/maddieberg/files/2017/05/146250_9935-900x600.jpg?width=640&height=434", "keywords": [], "authors": ["Madeline Berg"], "canonical_link": "https://web.archive.org/web/20170510222151/https://www.forbes.com/sites/maddieberg/2017/05/10/scandal-to-end-after-season-7/", "title": "'Scandal' To End After Season 7", "meta_data": {"referrer": "origin-when-cross-origin", "description": "The hit series helped solidify Shonda Rhimes' dominance at ABC and made a name out of star Kerry Washington.", "author": "Madeline Berg", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "prerender-status-code": "{{meta.code}}", "apple-itunes-app": "app-id=588647136", "og": {"title": "'Scandal' To End After Season 7", "site_name": "Forbes", "url": "https://web.archive.org/web/20170510222151/https://www.forbes.com/sites/maddieberg/2017/05/10/scandal-to-end-after-season-7/", "image": {"identifier": "https://web.archive.org/web/20170510222151im_/https://blogs-images.forbes.com/maddieberg/files/2017/05/146250_9935-900x600.jpg?width=640&height=434", "type": "image/jpeg,image/gif,image/png"}, "description": "The hit series helped solidify Shonda Rhimes' dominance at ABC and made a name out of star Kerry Washington.", "updated_time": "2017-05-10T17:38:50-04:00", "type": "article"}, "article": {"publisher": "https://www.facebook.com/forbes", "section": "Business", "section_url": "//www.forbes.com/business", "id": "blogAndPostId/blog/post/3609-3585", "published": "2017-05-10", "modified": "2017-05-10"}, "fb": {"app_id": 123694841080850}, "twitter": {"card": "summary_large_image", "site": "@forbes", "title": "'Scandal' To End After Season 7", "description": "The hit series helped solidify Shonda Rhimes' dominance at ABC and made a name out of star Kerry Washington.", "image": "https://web.archive.org/web/20170510222151im_/https://blogs-images.forbes.com/maddieberg/files/2017/05/146250_9935-900x600.jpg?width=640&height=434", "creator": "@@MadelinePBerg"}}, "movies": [], "publish_date": 1494370800.0, "source": "https://web.archive.org", "summary": ""}