{"url": "https://www.romper.com/p/what-is-scooby-doo-papa-all-you-need-to-know-about-the-new-dance-fad-8146690", "text": "There have been dozens of dance crazes that have taken over households through the decades. The 1920s saw the jitterbug and the Charleston. The 1960s had the \"Mashed Potato,\" and the twist. And who can forget about the \"Macarena,\" which came to define the 1990s (I still know how to do the dance, move-by-move). This decade also saw its fair share of fad dances: \"Gangham Style,\" the dab, the Harlem Shake, and \"Hit the Quan,\" to name a few. Now you can add a new one to that list: \"Scooby Doo Papa\"? I know what you're thinking: What is \"Scooby Doo Papa\"? It's an infectious Latin dance track that's become viral thanks to two social media sensations.\n\nNew York-based artist DJ Kass released \"Scooby Doo Papa\" back in September, but it didn't catch fire until YouTubers Lele Pons and Inanna Sarkis featured the song in two Instagram videos, according to The Daily Mail. The two social media stars created a dance routine to go along with \"Scooby Doo Papa,\" which they showed off in their first video posted to Instagram back in December. It became an internet sensation in Latin America, and now has finally reached the United States, The Daily Mail reported.\n\nLele Pons, who has more than 22 million Instagram followers, posted the second video in January (Sarkis has more than seven million Instagram followers). Together, both videos have racked up more than 58 million views, according to E! News.\n\nIn both of the videos, the Instagram stars are dressed up as Daphne Blake and Velma Dinkley from the original Scooby Doo gang. Pons couldn't keep a straight face in the first video, which shows the duo having fun dancing around in a kitchen. The second video has a bit more production, with a crew of backup dancers supporting Sarkis, who took on the Velma persona.\n\nAnd their fans are loving \"Scooby Doo Papa.\" On the December video, one Instagram user commented on Sarkis' expression, saying \"your face, damn love you so much.\" Another wrote, \"Goofy dancing... check.\"\n\nThe video Pons posted to her Instagram account in January received an equal amount of love from her fans and other social media users alike. One Instagram user wrote, \"This is so funny I can't,\" in all caps. Another called the video \"the funniest.\" And others commented on how much they love the song by DJ Kass, who was born in the Dominican Republic.\n\nBut Pons and Sarkis aren't the only ones dancing to \"Scooby Doo Papa.\" Search YouTube, and you'll find a ton of videos of people moving to DJ Kass's hit song. Mexican television hosts, Peru's National Police Department, and students have all filmed themselves dancing the \"Scooby Doo Papa\" routine, according to The Daily Mail.\n\nAs a native New Yorker, it's awesome to see music from a New York-based DJ exploding online. DJ Kass is popular in clubs in the city, particularly in the Bronx, where is based, according to his website. The 26-year-old father comes from a line of DJs; his father was a popular local DJ, too. Now he is making waves across Latin America and the United States.\n\nBack in 2014, DJ Kass wrote on his website about his future plans in music, according to E! News,\n\nFor now, I’m currently involved in learning how to produce and create edits. I just want to be heard, appreciated, and known in this world for giving a great show and best of all, entertaining the crowd because I live through them.\n\n\"Scooby Doo Papa\" and the viral response to the song is definitely proof that DJ Kass has achieved his goal as a musician.\n\nCheck out Romper's new video series, Romper's Doula Diaries:\n\nWatch full episodes of Romper's Doula Diaries on Facebook Watch.", "images": ["https://cdn2.bustle.com/2022/romper/logo-3079c0c267.svg", "https://imgix.bustle.com/uploads/image/2018/2/7/016fba67-d0a4-40f9-ad44-f18577f67210-scooby-do.png?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/image/2022/10/5/119400fe-e1ee-4c28-9f95-2fb5e923258a-scoob.PNG?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2022/10/6/45becc4f-e4f9-41f8-bd18-99ed91fc7c4a-getty-456887240.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2022/10/4/561fb109-a061-411b-9d1e-eeff3ebe26ee-getty-1241465370.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2022/9/26/7748372f-f80f-4942-8b93-6948489cc497-getty-1385861412.jpg?w=159&h=110&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.5987&fp-y=0.3796", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2018/2/7/016fba67-d0a4-40f9-ad44-f18577f67210-scooby-do.png?w=540&fit=crop&crop=faces&auto=format%2Ccompress"], "top_img": "https://imgix.bustle.com/uploads/image/2018/2/7/016fba67-d0a4-40f9-ad44-f18577f67210-scooby-do.png?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.romper.com/p/what-is-scooby-doo-papa-all-you-need-to-know-about-the-new-dance-fad-8146690", "title": "Here's What You Need To Know About The Viral “Scooby Doo Papa” Dance", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@romper", "card": "summary_large_image", "creator": "@annamarya_s"}, "article": {"publisher": "https://www.facebook.com/romperdotcom"}, "og": {"site_name": "Romper", "url": "https://www.romper.com/p/what-is-scooby-doo-papa-all-you-need-to-know-about-the-new-dance-fad-8146690", "type": "article", "title": "Here's What You Need To Know About The Viral “Scooby Doo Papa” Dance", "description": "There have been dozens of dance crazes that have taken over households through the decades. The 1920s saw the jitterbug and the Charleston. The 1960s had the \"Mashed Potato,\" and the twist. And who can forget about the \"Macarena,\" which came to…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/2/7/016fba67-d0a4-40f9-ad44-f18577f67210-scooby-do.png?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "There have been dozens of dance crazes that have taken over households through the decades. The 1920s saw the jitterbug and the Charleston. The 1960s had the \"Mashed Potato,\" and the twist. And who can forget about the \"Macarena,\" which came to…"}, "movies": ["https://www.youtube.com/embed/skJB3MPGzkA"], "publish_date": null, "source": "https://www.romper.com", "summary": ""}