{"url": "https://foreveramber.co.uk/how-to-walk-in-high-heels-without-pain-and-without-falling-over/", "text": "The Awkward Girl’s Guide to Walking in Heels\n\nHow to walk in high heels: tips from a pro…\n\nIt’s no secret that I love my high heels, and while these days you’re more likely to see me in sneakers than stilettos (Having a toddler to run around after will do that for ya…), if you’d run into me a few years ago, chances are I’d have been wearing a pair of very high heels, no matter what the occasion – which meant I got to spend a lot of time answering the question “how do you walk in high heels?”- and sometimes less polite ones, like, “Do you REALLY wear those shoes all the time? Are you crazy, woman?” or “Do you have veiny feet? Can I have a photo of them?” (Answers: Yes, Probably, and YUCK…)\n\nBefore I get around to answering that question (The “how to walk in high heels” one, I mean, not the veiny feet thing: I should probably point out at this point that although I get a lot of messages from foot fetishes, I’m not one myself, so if you’re thinking of commenting or messaging me about your fetish… just don’t.), though, I want to quickly dispel some myths about what some would consider the black art of walking in high heels:\n\n01. Yes, it is totally possible to walk in heels without “tottering”.\n\nAlmost every piece of commentary I read about women in heels includes the word “tottering” – almost always used in a sneering fashion, to imply that women who wear heels always “totter” and are never able to walk normally. Which is absolute rubbish, basically. Until I had my son, I wore heels constantly – for work, for play, and for everything in between. (And I’ll also just quickly add that I didn’t stop wearing them because having a baby made me unable to walk in them: I stopped partly because they were no longer practical for my lifestyle – I loved my heels, but not even I would wear them to a muddy playpark, or a soft-play centre – but also because styles changed, and heels started looking a little bit dated to me, really.) I did not “totter”, and nor did any of my friends, who also used to wear high heels on the regular. Not all people totter in heels. Some people do, sure – that’s why this article exists, after all. But to “totter” is not inevitable if you want to wear heels, so, you know, please stop implying that it is.\n\n02. No, they’re not always comfortable.\n\nOnce I’ve been asked how on EARTH I walk in my heels, the next question is almost always “are they comfortable”? Which never fails to make me smile, because, I mean, do they LOOK comfortable? The fact is, very high heels are not designed for comfort. They’re just not. They’re designed for style, and while some heels can be relatively comfortable, the key word here is “relatively”. They can be comfortable in comparison to other very high heels. They will never be “comfortable” in comparison to slippers, say: or sneakers, or Birkenstocks, or whatever kind of shoes you consider “comfortable”. So, you can learn to walk in heels just fine, but if it’s comfort you’re looking for, these are not the shoes for you. Like, you’re never going to find yourself thinking, “God, my feet are killing me, I can’t wait to slip into my stilettos”, you know?\n\n03. It’s not about sex.\n\nFinally, a lot of people make the assumption that women wear high heels primarily – or SOLELY – because they believed they appeal to men, and they want to look “sexy”. While I’m sure that’s very much the case for SOME people, it’s not the case for ALL of us. I, for instance, love heels because I have short legs, and heels make them look more in proportion to the rest of my body. I don’t care what men think about them. (I mean, I don’t particularly care what women think of them either, to be honest, but there’s a certain kind of man who likes to go around saying things like, “If you girls only knew how much us men love a women in heels you’d wear them all the time!” and I just want to head those comments off at the pass, because, believe it or not, not everything women do revolves around men: imagine!\n\nAnd, with all of that said, here’s everything I know about how to walk in high heels…\n\n01.\n\nWork your way up\n\nIf you’ve never worn heels on a regular basis, a pair of 6″ stilettos probably isn’t the best place to start. Instead, go for something mid-height, and, once you’re used to walking in those, start to gradually work your way up. Thinking about it now, I reckon this is how I “learned” how to walk in high heels: I wasn’t aware of it as a learning process at the time, but I know the heels I considered super-high as a teenager, say, would feel pretty low to me now, so I think I started small and moved up without really noticing.\n\n02.\n\nThe thicker the heel, the easier it is to walk on it\n\nIn general, the thinner the heel, the harder it’ll be to balance on it, so when you’re still getting used to walking in high heels, choose thicker, sturdier heels, which will give the foot more stability and give you more confidence.\n\n03.\n\nPlatform soles make high heels feel lower\n\nPlatform shoes might look crazily high, but they can actually be much easier to walk in than non-platforms, as the platform makes the heel feel shorter. A four-inch heel with a one-inch platform, for instance, will feel like you’re walking on a three-inch heel, which is a lot more reasonable!\n\n04.\n\nWedges feel like flats, but look like heels\n\nIf you’re really struggling to walk in high heels, wedges are your friends. Because of the extra arch support, and the fact that the sole of the shoe is completely flat, they’ll give you height (sometimes a LOT of height) without forcing you to do much in the way of balancing. They’re the most comfortable type of high heels to walk in, and also probably the easiest, so they make an excellent starting point if you can’t walk in high heels, and want to learn.\n\n05.\n\nIf the shoe fits…\n\n…it’ll be a whole lot easier to walk in. Fit is particularly important with heels, because if you’re struggling just to keep them on your feet (or wincing in pain every time your foot hits the ground), you’ll find it practically impossible to walk in them. In fact, shoes that are constantly slipping off your foot can actually be dangerous, because you run the risk of stepping right out of them, or going over on your ankle. It’s almost too obvious to write down, but buy shoes that fit, and you’ll find them much easier to wear. There’s no substitute for shoes which fit perfectly, but if you’re having issues with the heels slipping, you can buy heel grips to make them feel a little more secure.\n\n06.\n\nNever wear new shoes without breaking them in\n\nThis goes for ANY shoes, really (The worst blisters I’ve had have all come from flats!), but if you can’t walk in heels, it could be because you haven’t worn them in properly. A lot of people swear by just wearing them around the house, or while you’re doing the vacuuming or whatever – you might feel a bit like Freddie Mercury in the ‘I Want to Break Free’ video, but it’ll help you get used to walking in heels and, well, there are worse people you could look like.\n\n07.\n\nPlace your heel on the ground first\n\nHigh heels don’t just make you walk taller, they also force you to walk differently. In flats, sneakers or flip flops, your full foot hits the ground more or less at the same time. In heels, however – and particularly in very high heels – this method won’t only feel uncomfortable and awkward, it’ll look like that, too. Instead, you need to adapt the way you walk so that your heel comes into contact with the ground first, followed by the rest of the foot. This might take a bit of getting used to, which brings me to my next point…\n\n08.\n\nPractice. Then practice some more.\n\nIf you’re not used to walking in high heels, it’ll feel very unnatural and awkward the first time you try it. And if you simply give up after that, and don’t try again for a few months or years, it’ll feel awkward and unnatural the NEXT time you try it, too… and the time after that, and the time after that. Practice is the key, and as silly as it might sound, you might find it useful to try to practice in front of a mirror (or get someone to film you, even): sometimes being able to see yourself walk will help you identify anything you’re doing wrong, and work out what you need to change. I know a lot of people who think they can’t walk in high heels because they’ve tried it a couple of times, found it tricky, and given up. Obviously no one is born knowing how to walk in high heels – when you think about it, it’s a really un-natural thing to do, so it makes sense that you might have to train yourself to do it!\n\n09.\n\nBaby steps\n\nI’m not still talking about practising, or working your way up here, I mean literally take baby steps. Like it or not, you can’t really stride or run in heels (well, you can, and once you know how to walk in high heels, running in them won’t seem like a big deal, but you’re probably going to want to wait until you’ve mastered the “walking” bit first!), and if you try to march along with your arms swinging by your sides, it might look a little bit unnatural. Again, being able to see yourself in a mirror will really help with this, and you should instantly be able to see what looks natural, and what doesn’t. In general, though, try to take smaller, slower steps than you would in lower shoes and don’t try to run before you can walk!\n\n10.\n\nRelax\n\nA lot of women have a tendency to hold themselves very stiffly when they’re learning how to walk in high heels. This is partly because of the different way your body moves in heels (your might think your feet and legs are doing all the work, but your lower back and abdomen are working hard too, and are often the first places you’ll feel the strain if you’ve been overdoing it), of course, but it’s also natural to stiffen up if you’re feeling off-balance. Try to relax: not only will it look more natural, it’ll also be more comfortable, and make you less likely to hurt yourself.\n\n11.\n\nRough up the soles\n\nOne of the biggest issues people have when learning how to walk in high heels is slippage: a lot of high heeled shoes have soles which are completely smooth, and don’t offer any grip at all, and that makes them even harder to walk in than would otherwise be the case. (Because it really needs to be even harder, right?) This is particularly true of brand new shoes, and is one of the reasons I’ve talked about breaking shoes in before you wear them: if the soles are slippy, however, wearing them around the house won’t help – they really need to be worn outside for the sole to roughen up enough to make it easier to grip. If you don’t want to wear your new heels outdoors quite yet, you can do it yourself by gently rubbing the soles with sandpaper (yes, really) or using scissors to carefully score the soles: if you’re still worried, you can also buy stick-on soles which will give your shoes more grip.\n\n12.\n\nRemember not all high heels are created equal\n\nYou’d think that if you can walk easily in one pair of heels, you’ll be able to walk easily in them all, but that’s not actually the case. What can look like tiny differences in the design of a shoe can make a huge difference to how it feels to wear it, and how easy it is to balance in it: I have some very high shoes, for instance, which are easier to walk in than shoes that are a bit lower – it’s all down to the design, so just because the first pair of heels you try don’t work for you, it doesn’t mean you should give up: it might just mean you need to shop around a bit and find a pair that’s more suited to your foot /step.\n\n13.\n\nRemember: you don’t have to learn how to walk in high heels if you don’t want to\n\nFor my final point (Which should possibly have been my first point, because it’s an important one…), I just want to make it clear that no one should feel like they HAVE to wear high heels. I’ve written this post in order to (hopefully) help those who WANT to wear them, and who’ve specifically asked how to walk in high heels, but if they’re just not for you, then there’s no reason in the world to force yourself to wear them. It also goes without saying that if you have foot, leg or back issues, or any other kind of physical issue that would make heel-wearing difficult or dangerous, for the love of shoes, don’t wear them. Your feet are more important than any pair of shoes!\n\nWhat about you? Any tips on how to walk in high heels? How did you learn?\n\nHow to walk in high heels: a guide for beginners", "images": ["https://foreveramber.co.uk/wp-content/plugins/patron-plugin-pro/plugin/lib/patron-button-and-widgets-by-codebard/images/become_a_patron_button.png", "https://foreveramber.co.uk/wp-content/uploads/2022/09/Gran-Canaria-itinerary.jpg", "https://secure.gravatar.com/avatar/7d32e2819aa5444bb46cb7e3f092dd48?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/6ee0d0c32ab328125e363ceb5d530c1c?s=96&d=mm&r=g", "https://foreveramber.co.uk/wp-content/uploads/2020/12/forever-amber.png", "https://secure.gravatar.com/avatar/25c028e0d5d45897551717e6be99dfb2?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/a9f650fb10d1e7f641317a3fd673adee?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/f2d22a0e790c04776fe5582b777558e0?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/5d454ebe24202fffb279f3565bb2d48c?s=96&d=mm&r=g", "https://foreveramber.co.uk/wp-content/uploads/2015/05/ALM_6476.jpg", "https://secure.gravatar.com/avatar/d3d2621a4ddeb0e4e0d06b1c53899c18?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/dab5198f0c67c23464adf5427924298c?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/7a5d8304a266b40acfeacd8f3645f604?s=96&d=mm&r=g", "https://foreveramber.co.uk/wp-content/uploads/2015/05/how-to-walk-in-high-heels-3.jpg", "https://secure.gravatar.com/avatar/9f298d8eb621d464802dc3678feda57f?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/7039afdaae7c9b6a1e923952fdcf8ae4?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/4e07b15c13a9be58056bb1f3f5d33318?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/a3a737b867ddf6af824b5a5283970863?s=96&d=mm&r=g", "https://foreveramber.co.uk/wp-content/uploads/2020/02/elective-c-section-advice-2.jpg", "https://secure.gravatar.com/avatar/c35871bcbbbd4a6c0fd9a0f4babbd999?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/ab7a5a97606ee83bd17f975c92b90c1a?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/32a7ac2cfef136b33a2b945b319bdd45?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/d8ced770ceeda786f3b879076c47e5a8?s=96&d=mm&r=g", "https://foreveramber.co.uk/wp-content/uploads/2016/02/get-rid-of-sleep-lines-1.jpg", "https://foreveramber.co.uk/wp-content/uploads/2022/08/classic-white-shirt-1.jpg", "https://secure.gravatar.com/avatar/10b643e70a5dec3c410491dd6fc80356?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/27b835ea141889e894a9c7b365bf32db?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/f6e00fd3f95b38ae482e121950dd3362?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/559d4e272da614a735445a23a64fcd9f?s=96&d=mm&r=g", "https://foreveramber.co.uk/wp-content/uploads/2015/05/how-to-walk-in-high-heels5.jpg", "https://secure.gravatar.com/avatar/f9e0f18e50e3b91da5c4e51ac693787d?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/ab3b36c967cc1b5bdc8f2c1dcec717cb?s=96&d=mm&r=g", "https://foreveramber.co.uk/wp-content/uploads/2015/05/walking-in-high-heels.jpg", "https://secure.gravatar.com/avatar/d69a136a84f91bf2a946c6b747defb8a?s=96&d=mm&r=g", "https://foreveramber.co.uk/wp-content/uploads/2020/05/forever-amber-dark-1.png", "https://secure.gravatar.com/avatar/b176cd6bb5174de6bfed0079c7e012ce?s=96&d=mm&r=g", "https://foreveramber.co.uk/wp-content/uploads/2021/11/forever-amber-white.png", "https://secure.gravatar.com/avatar/7cfe2608744665542f18c08ba82fefe7?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/1016a0ee966f5790730103cf6ca5e7f9?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/bae4ff458d0da8b370a0f2105ae80b86?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/70cbaba69506aa83ef08bf4323102561?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/790e688b30d227b757beeecd24d19bbd?s=96&d=mm&r=g", "https://foreveramber.co.uk/wp-content/uploads/2022/10/romance-tropes.jpg", "https://secure.gravatar.com/avatar/82d741fa9e1a354d0c26405ef304721b?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/baf1049369c95614b93a07c1c12c2981?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/2dda76eb620fe08257519eaf2503e42b?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/fbfca1dec6077857d57d49666e134edf?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/520872a537a208cf63f1d6c15cc58db2?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/2b14ec0341a25ee57c53e381313fa6aa?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/4fe35412a4b71a7bea0e96fa0573ccde?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/16b8ceebe16bc81e27496b3170fc4363?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/7ee90d310a7178ac6c3e2754f4f80e66?s=96&d=mm&r=g", "https://foreveramber.co.uk/wp-content/uploads/2019/06/toy-plane.jpg", "https://foreveramber.co.uk/wp-content/uploads/2015/05/how-to-walk-in-high-heels-5.jpg", "https://secure.gravatar.com/avatar/94d0d89fdd6eb4ca8191c5b5dc49780d?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/0e46429781b97a06b02f27cd86c90d42?s=96&d=mm&r=g", "https://foreveramber.co.uk/wp-content/uploads/2020/05/forever-amber.png", "https://secure.gravatar.com/avatar/e732baaae852e4c5f8aba4b95c9062f8?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/152183683a1ff115b1e0b86ad10b387c?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/9584da8f03e46af97d3f944c28622468?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/316f1537a4e72ee21f3ba499c22e649e?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/f9547f1d84d5558b57bbfa0f4fec000a?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/28958b381d4de435e775a972cf80e0e8?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/f287457a65619529f979fe382f0acbf1?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/f977fb0f912bc67204b493617a8fe8b7?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/5a38d39fb85714a2192831710cb12b4b?s=96&d=mm&r=g", "https://foreveramber.co.uk/wp-content/uploads/2022/09/swim-up-bar.jpg", "https://secure.gravatar.com/avatar/efac352986d5d10da37a00dd6b973b11?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/c1662149033b13e1e8cb874362cad977?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/e60087539448492b16b5901d32b67f7e?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/9704e8df1fad76136a1b818168829585?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/4648371129a79a16481b69d85a33fa36?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/cb507aa401adf868aa54f3a44d1b059c?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/fc1f3d0fed402b5e07427a8c9f64b0b5?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/7937b64fbfe1c8d8e13cb5fdc50c6492?s=96&d=mm&r=g", "https://foreveramber.co.uk/wp-content/uploads/2022/10/the-accidental-impostor-1.jpg", "https://foreveramber.co.uk/wp-content/uploads/2015/05/how-to-walk-in-high-heels-2.jpg", "https://foreveramber.co.uk/wp-content/uploads/2015/05/fashion-tips-1.jpg", "https://secure.gravatar.com/avatar/abaa5513ba484a4342fdabf9d8b77df4?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/89cf84cc619d801dc8069223d42a0d5e?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/150ca4d4df63712d179aeaff03320664?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/72fec79e8fceb2ba457023d485633666?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/cdf9b6b5c20c680197949dc56786470d?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/b4d3a776da7ccfe0f9a91c0a1c836f1c?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/3053ae3c0f0551d5ee070fdb5265c072?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/72b4ef1629932129bcf3b5234e748387?s=96&d=mm&r=g", "https://secure.gravatar.com/avatar/b194409678950457d3a2b886a5936cef?s=96&d=mm&r=g"], "top_img": "https://foreveramber.co.uk/wp-content/uploads/2015/05/fashion-tips-1.jpg", "keywords": [], "authors": [], "canonical_link": "https://foreveramber.co.uk/how-to-walk-in-high-heels-without-pain-and-without-falling-over/", "title": "How to Walk In High Heels Without Pain", "meta_data": {"viewport": "width=device-width,initial-scale=1,user-scalable=yes", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Learn how to walk in high heels in this article filled with tips and advice on how to master the art of the high heel. Help guide for beginners.", "og": {"locale": "en_GB", "type": "article", "title": "The Awkward Girl's Guide to Walking in Heels", "description": "Learn how to walk in high heels in this article filled with tips and advice on how to master the art of the high heel. Help guide for beginners.", "url": "https://foreveramber.co.uk/how-to-walk-in-high-heels-without-pain-and-without-falling-over/", "site_name": "Forever Amber: A Scottish Parenting Lifestyle Blog", "image": {"identifier": "https://foreveramber.co.uk/wp-content/uploads/2015/05/fashion-tips-1.jpg", "width": 1200, "height": 728, "type": "image/jpeg"}}, "article": {"publisher": "https://www.facebook.com/foreveramberUK/", "author": "https://www.facebook.com/foreveramberUK/", "published_time": "2015-05-18T09:30:08+00:00", "modified_time": "2021-07-26T19:01:17+00:00"}, "author": "Amber", "twitter": {"card": "summary", "creator": "@foreveramber", "site": "@foreveramber", "label1": "Written by", "data1": "Amber", "label2": "Estimated reading time", "data2": "10 minutes"}, "generator": "Powered by WPBakery Page Builder - drag and drop page builder for WordPress.", "msapplication-TileImage": "https://foreveramber.co.uk/wp-content/uploads/2020/10/cropped-forever-amber-270x270.jpg"}, "movies": [], "publish_date": 1431941408.0, "source": "https://foreveramber.co.uk", "summary": ""}