{"url": "https://en.wikipedia.org/wiki/Catherine_Lowe", "text": "Catherine Lowe (née Mejia Giudici; born April 29, 1986)[1] is an American graphic designer, reality television star and the winner of the seventeenth season of ABC's The Bachelor. She is married to the former bachelor, Sean Lowe.\n\nEarly life [ edit ]\n\nGiudici was born in Seattle, Washington to Carey Giudici, who is of Swiss-Italian and Scottish descent and Cynthia Mejia, a Filipino American. Her maternal grandparents originated from the Philippine province of Pangasinan.[2] She graduated from Roosevelt High School in 2004, and then from Washington State University in the class of 2008, having gained a B.A. in advertising. She then began a career in advertising, working for Seattle's Wexley School for Girls.[3]\n\nThe Bachelor [ edit ]\n\n\"Sean and Catherine's Wedding\" (Aired: January 26, 2014 - live)\n\nOver a year after proposing to Giudici on his season of The Bachelor, Sean Lowe and his fiancée were finally married on January 26, 2014, in a live ceremony performed by Lowe's father at the Four Seasons Resort Biltmore in Santa Barbara. Many of the Bachelor alumni were in attendance at the wedding, such as The Bachelorette married couples Ashley and J.P. Rosenbaum, Trista and Ryan Sutter, DeAnna and Stephen Stagliano, The Bachelor's Jason and Molly Mesnick as well as the previous season's Bachelorette pair, Desiree Hartsock and Chris Siegfried, who have since also gotten married.\n\nThe Lowes appeared on the first-season finale of Bachelor in Paradise to speak to the final couples and assess the chances that their relationships would succeed.\n\nOther television appearances [ edit ]\n\nGiudici was a guest on Jimmy Kimmel Live! with her fiancé, Sean Lowe, just before their wedding. Kimmel told them that he thought they were lying about waiting until marriage, so he hooked them up to a polygraph test to find out the truth. The couple gladly agreed and the lie detector showed that they were waiting.[4]\n\nThe Lowes were featured in Marriage Boot Camp: Reality Stars as they worked through their marital issues.\n\nThe Lowes also made an appearance on season 3 of Billion Dollar Buyer where they won a bid to sell products in their stationery line, LoweCo.\n\nPersonal life [ edit ]\n\nOn July 2, 2016, the Lowes had their first child, a son.[5] In November 2017, the couple announced that they were expecting their second son. On May 18, 2018 their son was born.[6] In June 2019, the couple announced that they were expecting their third child. On December 23, 2019, they welcomed their third child, a daughter.[7]", "images": ["https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Catherine_Lowe", "title": "Catherine Lowe", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "viewport": "width=1000", "og": {"title": "Catherine Lowe - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}