{"url": "https://www.thrillist.com/entertainment/nation/this-is-us-emotional-moments-make-you-cry", "text": "NBC\n\nThis Is Us wrapped up its powerful sophomore season with Kate and Toby's wedding, which, if you know the show, meant a tear-fueled, emotional gut punch of an episode that we're still reeling from. The show has a reputation for making fans bawl like babies, and it might even feel manipulative if it wasn't so downright moving. The themes of family, of love, of the magical ways we transcend life and death, melt together to create something singular and special; a show that isn't interested in awe and spectacle, but in life's casual beauty and brutality. To celebrate the second season finale, we decided to rank the most tear-inducing moments in This Is Us history. Whether happy or sad, these are the moments that keep us tuning in -- with hanky in hand. (Beware of spoilers if you're not all caught up!)\n\nNBC/Youtube\n\n13. Dr. K comforts Rebecca \"The Car,\" Season 2, Episode 15 A fair warning up front: the death of This Is Us patriarch Jack Pearson (Milo Ventimiglia) factors into several spots on this list. How could it not? His death is the driving force of the series, informing every present-day storyline as his children and wife continue to deal with their grief and revel in the splendor of his life. This moment, from one of the most quietly devastating episodes of television ever, is something of an accessory to other entries on the list, or else it would rank higher. Dr. Katowski, the obstetrician who delivered the triplets and became a father figure to Jack, surprises Rebecca at Jack's wake, and motivates her to press on. \"You are the same woman who lost a child and rolled out of my hospital with three babies just the same,\" Dr. K wisely intones. \"You're as tough as they come, Rebecca Pearson.\"\n\nNBC/Youtube\n\n12. Jack tells Kate he has a drinking problem \"A Manny-Splendored Evening,\" Season 2, Episode 2 Jack's relationship with his daughter is one of the loveliest gifts This Is Us has given us. His utter acceptance and love of the insecure Kate is why her modern-day incarnation is so broken: she lost the one person who could always lift her up. This moment in Season 2 is the pair at their most honest. Jack confesses to Kate that he's an alcoholic, and Kate, though devastated, places her hands on her father's cheeks -- an affectionate gesture Jack uses on his kids in their moments of distress. The role-reversal is significant, and shows how much Kate has grown through and because of her doting dad.\n\nThrillist TV History of The History of the McRib\n\nNBC/Youtube\n\n11. Rebecca talks to her unborn babies \"The Big Day,\" Season 1, Episode 12 From the show's beginning, Rebecca has been hard to decode. Some of that is by design; in the second episode of the series, we see that in the present-day she is married to Jack's best friend. This is before we knew Jack was dead, and before we knew the circumstance surrounding that event. Because of the mystery, Rebecca felt somewhat inaccessible. All we really knew was that she came from a strict family and that she didn't want kids until Jack persuaded her. That's why this moment is so touching. A very-pregnant Rebecca, just hours from delivery, talks to the triplets in her womb. \"I love you so much it hurts and I haven't even met you yet,\" she says through tears. We know that one of those triplets is a stillborn, which tinges her words with an extra melancholy.\n\nNBC/Youtube\n\n10. Kate and Toby get married \"The Wedding,\" Season 2, Episode 18 We always knew Kate and Toby's wedding would be emotional. Kate, the ultimate daddy's girl, has to walk down the aisle without her father, his absence an un-ignorable anecdote to what should be the happiest day of her life. But This Is Us found a way to place him there anyway. \"One day, a long time from now, you're gonna meet someone who is better than me,\" Jack tells his young daughter in a flashback, which is played over the moment her brothers walk her down the aisle in his place. It's all lovely and beautiful, until the gut-punch comes. \"Your mom and I, we're gonna be there,\" he continues. \"I'll get to walk you down the aisle, and I may even cry a little.\" No Jack, we're the ones crying.\n\nNBC/Youtube\n\n9. Beth mourns William \"What Now?\" Season 1, Episode 17 Beth is a This Is Us secret weapon. Funny, acerbic, but strong and loving, she's the perfect match for the anxiety-ridden Randall. Their marriage is the soulmate story of the present timeline -- easygoing, familial, fool-proof. That's why her breakdown over the death of Randall's birth father, William, is so hard to watch. Beth is rarely as vulnerable as she is here, where she recalls their brief time together, and how she never expected to love him so much. She's also angry that he didn't leave her anything behind, like he did for everyone else. By episode's end, we see that's not the case; William mailed her a postcard from Memphis just before he passed on. Still, the layers of Beth's grief -- expressed at his \"fun-eral,\" a celebration of life instead of death that his granddaughters plan -- are so palpable here. It's nice to see her softer side.\n\nNBC/Youtube\n\n8. Kate lets it all out \"Three Sentences,\" Season 1, Episode 13 Kate's weight struggles are a big part of her storyline, and, as we learn, an expression of her grief after Jack's death. As she admits to Toby, her father's death spawned a period of self-hate; she stopped taking care of herself, mentally and physically. She eventually attends a New Age weight loss camp in upstate New York to quell her demons, and though she's indifferent to the experience at first -- she was expecting boot camp, and got self-care yoga seminars instead -- she eventually settles into the groove. In this moment, during an immersive course that includes beating drumsticks and emoting, Kate is able to connect with her grief. As she pounds out the sticks, she flashes to Jack's funeral, seeing in color the hurt that she's buried. It's a beautiful moment of self-realization, and bursts open the damn of self-acceptance Kate so desperately needs.\n\nNBC/Youtube\n\n7. Rebecca sees Jack's body \"Super Bowl Sunday,\" Season 2, Episode 14 This episode was the \"big one.\" The one where Jack dies. And it aired on Super Bowl Sunday with a heavy dose of pre-promotion. Audiences tuned in to finally see what happened that fateful day, and oh boy, was it a doozy. The Pearson house catches fire thanks to a faulty Crock-Pot and a poorly placed towel. Jack discovers the flames in the knick of time and is able to get his family out, but he goes back inside for Kate's dog and some of the family's mementos. This proves a fatal decision: Jack is taken to the hospital for a routine examination, but suffers a fatal \"widow maker\" heart attack from smoke inhalation. Rebecca is in the lobby when it happens, getting snacks out of a vending machine. The doctor comes to tell her that her husband is dead, and she responds with denial. \"Are you out of your mind?\" she asks, then bolts to Jack's room to tell him about their crazy doctor. Instead, she finds his lifeless body. Mandy Moore does career-defining work in this scene. Her face goes through every stage of grief in a flash as she accepts the reality of her husband's death. It's made all the more haunting in that we don't see Jack's body for ourselves, only the hint of it in a hospital window reflection.\n\nNBC/Youtube\n\n6. Jack tells Randall it's OK to be different \"Career Days,\" Season 1, Episode 6 Randall isn't like the other Pearson kids. He's adopted, black, and, it turns out, a genius. As if the first two things aren't hard enough, his intelligence only further others him as a child, when report card As are rewarded with ice cream cones and parental affection. Randall doesn't want to be treated any differently than he already is, and so he lies to his dad about his mathematical abilities. But Jack knows, and puts his son to the test, under the guise of helping him with work. When Randall resists, Jack asks why, and his son lets it be known how ostracized he feels. Jack processes this, before telling Randall that it's OK to be different, and that he is as much his son as his other children are. \"I love you as much as a human heart can, kiddo,\" Jack goes on, cementing his status as the world's best dad. \"You are an exceptional young man.\" Future Randall becomes a millionaire weather trader; we see the seeds of that success planted by his father's words.\n\nNBC/Youtube\n\n5. Kevin runs to Randall \"Jack Pearson's Son,\" Season 1, Episode 15 \"What would Jack Pearson do?\" It's a question the eldest Pearson child, Kevin, asks himself. Kevin is a failed actor making a go of it on Broadway after stepping away from a humiliating and dehumanizing sitcom role. He needs to be taken seriously -- and for the play to be a success -- to resurrect his career. But on opening night, the specter of his father haunts him. Kevin knows that Randall, prone to panic attacks, is having a breakdown across town. And so, moments before curtain call, Kevin flees the play and runs to his brother, with whom he's always had a contentious relationship. In one of his first truly selfless moments, Kevin does exactly what his father would have done: he puts family over ego. It's just what Randall needs, and, in a way, it's just what Kevin needs, too.\n\nNBC/Youtube\n\n4. \"Something resembling lemonade.\" \"Pilot,\" Season 1, Episode 1 Dr. K was there for some of the most salient moments in the Pearson family's lives. The first big one was the delivery of the triplets. Rather, the twins; the third child was stillborn. Dr. K delivers this news to Jack in the hallway of the hospital, while Rebecca recovers in a nearby room. Jack is understandably shaken, and the doctor lets him has his moment. But then he consoles him with a speech that serves as something of a tagline for the series: \"I like to think that maybe one day you'll be an old man like me, talking a younger man's ear off, explaining to him how you took the sourest lemon that life has to offer and turned it into something resembling lemonade.\" It's a phrase Jack passed on to his children, an oft-repeated passage in Pearson family lore. This scene also launched the pilot into its twist ending, when we realize the children Dr. K delivered -- and the baby Jack and Rebecca adopt -- grow up to be the adults we're following in the present.\n\nNBC/Youtube\n\n3. Kevin breaks down on the football field \"Number One,\" Season 2, Episode 8 Kevin is the most misunderstood Pearson child, a pretty boy actor with a self-destructive streak, he's the most damaged by Jack's death. He was the only Pearson absent from the fire, and that guilt haunts him, manifesting in the same addiction his father struggled with. At his lowest moment, he travels home to Pittsburgh to attend an event celebrating his achievements at his old high school. The trip is a painful one for Kevin, who drowns out his pain with alcohol and painkillers. The episode's most tragic moment comes as Kevin visits the football field where he suffered a career-killing injury. He guzzles wine and says his failures aloud, sports-announcer style. \"Kevin Pearson will walk again, just in time to bury his beloved father,\" he says through tears. This is Kevin at his most raw and miserable, our first real insight into the baggage he carries around unprocessed.\n\n\n\nNBC/Youtube\n\n2. William's death \"Memphis,\" Season 1, Episode 16 William was such a great break-from-the-mold type of character. A former drug addict who left his newborn son on the steps of a fire station, he was totally reformed by the time Randall found him. His story was tragic, but William was never disappointing. He didn't relapse, he didn't steal or make his presence in the Pearson household uncomfortable. He defied our pre-conceived expectations by being a wholly good person. That's why losing him was so hard. We knew it was coming; from the pilot, we knew William had terminal cancer. His life had a timestamp. Luckily, he went at the perfect moment, after road-tripping to his hometown of Memphis with the son he barely got to know -- but still knew well enough. There's also a wordless connection of father figures here; William uses the breathing trick Jack taught him for his anxiety to calm his birth father as he passes on, bridging a family divide through a gentle act of love.\n\nNBC/Youtube\n\n1. \"We're gonna be OK.\" \"The Car,\" Season 2, Episode 15 Every moment of \"The Car\" could fit somewhere on this list, but we kept it to only two spots just to be fair. The episode cleans up the mess of Jack's death, allowing the audience a full-on spectacle of grief to help process our devastation. It isn't an easy watch. Every moment with Jack is an arrow to the heart, and every moment without him even worse. The family car is a framing device. Jack buys it to protect his family; what he doesn't know is how it will care for them even after he's gone. We see an array of family moments in the car, both happy and sad: a joyful singalong on the way to a Weird Al concert; an angry fight between brothers; Rebecca driving her kid's to their dad's funeral, trying to ignore her dead husband's coffee in the cup holder. The final montage of the episode ties all of those moments together, in one cathartic, tear-inducing swell of emotion. Rebecca gathers the kids at Jack's favorite tree after his funeral and shows her maternal strength. She insists that Kevin and Randall don't have to take Jack's spot, and that it wasn't Kate's fault her dad went back for the dog. They spread his ashes, and head off, but Rebecca lingers for a moment. \"We're gonna be OK, babe,\" she whispers. \"I promise you, we're gonna be OK.\" It's a quiet pledge -- to Jack, to us -- that though we move on, we never lose sight of the things we've loved and lost.\n\nSign up here for our daily Thrillist email and subscribe here for our YouTube channel to get your fix of the best in food/drink/fun.", "images": ["https://i.ytimg.com/vi/uGPTIgYdrbQ/hqdefault.jpg", "https://i.ytimg.com/vi/jJXDVGIAj6w/hqdefault.jpg", "https://i.ytimg.com/vi/3dtebqFphRI/hqdefault.jpg", "https://i.ytimg.com/vi/bPlKtf2E5GI/hqdefault.jpg", "https://i.ytimg.com/vi/pEsu-bOzqAs/hqdefault.jpg", "https://assets3.thrillist.com/v1/image/2748820/1200x600/scale", "https://i.ytimg.com/vi/LvK1skcg5PM/hqdefault.jpg", "https://i.ytimg.com/vi/ypmrS1h586s/hqdefault.jpg", "https://i.ytimg.com/vi/IDpdtEgMYL8/hqdefault.jpg", "https://i.ytimg.com/vi/uOZVrt1YInA/hqdefault.jpg", "https://i.ytimg.com/vi/dzpEQywYuN4/hqdefault.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.ytimg.com/vi/fJrbCBgAS3o/hqdefault.jpg", "https://i.ytimg.com/vi/Wd8S9xYoDP0/hqdefault.jpg", "https://i.ytimg.com/vi/vg_L2QL5okw/hqdefault.jpg", "https://assets3.thrillist.com/v1/image/2748819/792x528/scale;webp=auto;jpeg_quality=60;progressive.jpg"], "top_img": "https://assets3.thrillist.com/v1/image/2748820/1200x600/scale", "keywords": [], "authors": ["Lindsey Romain", "Published On At Pm"], "canonical_link": "https://www.thrillist.com/entertainment/nation/this-is-us-emotional-moments-make-you-cry", "title": "The 13 Most Tear-Jerking 'This Is Us' Moments, Ranked", "meta_data": {"viewport": "initial-scale=1.0, width=device-width", "keywords": "thrillist editorial, nation, entertainment, lindsey romain, standard, tv, alcohol, season, super bowl, wedding season, wine, movies, twitter, lemonade, nbc, family, history, magical, mystery, sitcom, sports, youtube, food, ice cream, coffee, yoga, seeds, work, weight loss, news, politics, football, other, match, marriage, home, career, chicago, pittsburgh, type, design, driving, memphis", "robots": "max-image-preview:large, follow, index", "description": "The emotional NBC show gets us every time. But these moments REALLY GOT US.", "article": {"publisher": "https://www.facebook.com/Thrillist"}, "parsely-title": "The 13 Most Tear-Jerking 'This Is Us' Moments, Ranked", "parsely-link": "https://www.thrillist.com/entertainment/nation/this-is-us-emotional-moments-make-you-cry", "parsely-type": "post", "parsely-image-url": "https://assets3.thrillist.com/v1/image/2748820/1200x600/scale;", "parsely-pub-date": "2018-03-14T21:33:52.000Z", "parsely-section": "Entertainment", "parsely-author": "Lindsey Romain", "parsely-tags": "tv,entertainment", "fb": {"pages": 101800100890, "app_id": 111767172173562}, "ia": {"markup_url": "https://www.thrillist.com/fbihtml/entertainment/nation/this-is-us-emotional-moments-make-you-cry"}, "og": {"site_name": "Thrillist", "url": "https://www.thrillist.com/entertainment/nation/this-is-us-emotional-moments-make-you-cry", "type": "article", "title": "The 13 Most Tear-Jerking 'This Is Us' Moments, Ranked", "description": "This show gets us every time. But these REALLY got us.", "image": "https://assets3.thrillist.com/v1/image/2748820/1200x600/scale;"}, "twitter": {"card": "summary_large_image", "site": "@thrillist", "image": "https://assets3.thrillist.com/v1/image/2748820/1200x600/scale;", "description": "This show gets us every time. But these REALLY got us.", "title": "The 13 Most Tear-Jerking 'This Is Us' Moments, Ranked"}, "placeholder": {"1": "ph", "2": "ph", "3": "ph", "4": "ph", "5": "ph", "6": "ph", "7": "ph", "8": "ph", "9": "ph"}, "next-head-count": 61}, "movies": [], "publish_date": null, "source": "https://www.thrillist.com", "summary": ""}