{"url": "https://www.indiewire.com/2018/05/kevin-can-wait-erinn-hayes-death-kevin-james-cbs-1201965247/", "text": "Ratings declined this season, as the show shifted focus and brought on Kevin James' former \"King of Queens\" partner Leah Remini.\n\nA year ago, Kevin James told a reporter that his CBS sitcom, “Kevin Can Wait,” had killed off Erinn Hayes’ character on the show in order to give the show a longer life. Last week, CBS canceled the sitcom after two seasons.\n\nOn Wednesday, CBS execs admitted that the choice to make James’ character a widower didn’t go over well with viewers. “Creatively, the show made a choice at the beginning of last year,” said CBS Entertainment senior executive vice president Thom Sherman. “We agreed to go along with it and unfortunately the audience didn’t respond to it.”\n\nCBS first revealed the storyline last summer during the Television Critics Association press tour, after the choice was made to bring James’ “The King of Queens” co-star, Leah Remini, on “Kevin Can Wait” full time.\n\nAs part of a massive shift when “Kevin Can Wait” returned for its sophomore run, about 10 months passed since Hayes’ character’s death, allowing for James’ character to have moved on.\n\nAccording to James, speaking to the New York Daily News in October, the thought process behind Donna’s departure was to bring a new direction to the show, one that would allow for it to run for more seasons and be “lengthier.”\n\n“The plot of the show didn’t have enough drive. If we got through a second season, I wouldn’t see us getting through a third one,” James said before he admitted they “were literally running out of ideas.”\n\nJames said at the time that the original idea for his character was to be portrayed as a single father, but the show later made the decision to add a wife character.\n\nBut this past season, with Hayes gone, and the well-publicized decision to have her character die, ratings dropped. “It was a strong show for us, and it had a lot of decline this year, it was headed in the wrong direction,” said CBS Entertainment president Kelly Kahl. “The numbers were going down. Looking forward it didn’t look like a show that could anchor a night for us.”\n\nSign Up: Stay on top of the latest breaking film and TV news! Sign up for our Email Newsletters here.", "images": ["https://www.indiewire.com/wp-content/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://www.indiewire.com/wp-content/uploads/2017/08/108108_d0996b.jpg?w=780", "https://www.indiewire.com/wp-content/themes/indiewire/sprites/logo/Logo_IndieWire.png", "https://www.indiewire.com/wp-content/uploads/2016/05/mikeheadshot-copy-e1464735337462.jpg?resize=96%2C96", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.indiewire.com/wp-content/themes/indiewire/images/indiewire-color.png", "https://pixel.quantserve.com/pixel?a.1=p-60R-umvc0T-Cw&a.2=p-31f3D02tYU8zY", "https://www.indiewire.com/wp-content/uploads/2018/04/timeless-designated-survivor-criminal-minds.jpg?w=117&h=82&crop=1", "https://www.indiewire.com/wp-content/uploads/2018/04/147571_0233.jpg?w=117&h=82&crop=1"], "top_img": "https://www.indiewire.com/wp-content/uploads/2017/08/108108_d0996b.jpg?w=780", "keywords": [], "authors": ["Michael Schneider"], "canonical_link": "https://www.indiewire.com/2018/05/kevin-can-wait-erinn-hayes-death-kevin-james-cbs-1201965247/", "title": "‘Kevin Can Wait’: CBS Admits That Viewers Were Not Happy With Erinn Hayes’ Character’s Death", "meta_data": {"msvalidate.01": "87B78205BB25666E656DA3EB49F3FD42", "viewport": "width=device-width, initial-scale=1", "st": {"robots": "follow, index"}, "description": "Ratings declined this season, as the show shifted focus and brought on Kevin James' former \"King of Queens\" partner Leah Remini.", "news_keywords": "Erinn Hayes, Kevin Can Wait, Kevin James, Upfronts", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=1400654071", "generator": "WordPress 6.0.2", "author": "Michael Schneider", "theme-color": "#ffffff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "IndieWire", "application-name": "IndieWire", "content_type": "Article", "post_id": 1201965247, "title": "'Kevin Can Wait': CBS Admits That Viewers Were Not Happy With Erinn Hayes' Character's Death", "published_at": "2018-05-16 10:56:27", "image": "https://www.indiewire.com/wp-content/uploads/2017/08/108108_d0996b.jpg?w=300", "comment_count": 36, "tags": "Upfronts", "topics": "Television", "body": "A year ago, Kevin James told a reporter that his CBS sitcom, \"Kevin Can Wait,\" had killed off Erinn Hayes' character on the show in order to give the show a longer life. Last week, CBS canceled the sitcom after two seasons.\r\n\r\nOn Wednesday, CBS execs admitted that the choice to make James' character a widower didn't go over well with viewers. \"Creatively, the show made a choice at the beginning of last year,\" said CBS Entertainment senior executive vice president Thom Sherman. \"We agreed to go along with it and unfortunately the audience didn't respond to it.\"\r\n\r\n\r\n\r\nCBS first revealed the storyline last summer during the Television Critics Association press tour, after the choice was made to bring James' \"The King of Queens\" co-star, Leah Remini, on \"Kevin Can Wait\" full time.\r\n\r\nAs part of a massive shift when \"Kevin Can Wait\" returned for its sophomore run, about 10 months passed since Hayes' character's death, allowing for James' character to have moved on.\r\n\r\nAccording to James, speaking to the New York Daily News in October, the thought process behind Donna’s departure was to bring a new direction to the show, one that would allow for it to run for more seasons and be “lengthier.”\r\n\r\n“The plot of the show didn’t have enough drive. If we got through a second season, I wouldn’t see us getting through a third one,\" James said before he admitted they “were literally running out of ideas.”\r\n\r\nJames said at the time that the original idea for his character was to be portrayed as a single father, but the show later made the decision to add a wife character.\r\n\r\nBut this past season, with Hayes gone, and the well-publicized decision to have her character die, ratings dropped. \"It was a strong show for us, and it had a lot of decline this year, it was headed in the wrong direction,\" said CBS Entertainment president Kelly Kahl. \"The numbers were going down. Looking forward it didn't look like a show that could anchor a night for us.\"", "fb": {"pages": 9800035481}, "fragment": "!", "og": {"type": "article", "title": "‘Kevin Can Wait’: CBS Admits That Viewers Were Not Happy With Erinn Hayes’ Character’s Death", "url": "https://www.indiewire.com/2018/05/kevin-can-wait-erinn-hayes-death-kevin-james-cbs-1201965247/", "description": "Ratings declined this season, as the show shifted focus and brought on Kevin James’ former “King of Queens” partner Leah Remini.", "site_name": "IndieWire", "image": {"identifier": "https://www.indiewire.com/wp-content/uploads/2017/08/108108_d0996b.jpg?w=780", "width": 780, "height": 531, "alt": "CBS"}, "locale": "en_US"}, "article": {"published_time": "2018-05-16T14:56:27+00:00", "modified_time": "2018-05-16T14:56:27+00:00"}, "twitter": {"site": "@indiewire", "creator": "@franklinavenue", "card": "summary_large_image", "title": "‘Kevin Can Wait’: CBS Admits That Viewers Were Not Happy With Erinn Hayes’ Character’s Death", "description": "Ratings declined this season, as the show shifted focus and brought on Kevin James' former \"King of Queens\" partner Leah Remini.", "image": "https://www.indiewire.com/wp-content/uploads/2017/08/108108_d0996b.jpg?w=780"}, "msapplication-TileImage": "https://www.indiewire.com/wp-content/uploads/2018/04/cropped-iw_favicon.png?w=270"}, "movies": [], "publish_date": 1526482587.0, "source": "https://www.indiewire.com", "summary": ""}