{"url": "https://atlantadailyworld.com/2016/05/27/3-real-reasons-why-tamar-braxton-was-fired-from-the-real/", "text": "\n\nSome disturbing, but not surprising, news is billowing out from the set of “The Real” like smoke from an extinguished fire.\n\nThe “fire” was the firing of popular co-host Tamar Braxton for basically five major reasons, including: On-set tantrums, “p-ssing off’ sponsors, and a focus group that revealed Tamar’s “aggressive eye-rolling and mouth-smacking” turned off “educated women” viewers as they are “indicative of behavior African-American women have worked years to overcome.”\n\nExecutives of ‘The Real’ reportedly fired Tamar from “The Real” for three real reasons:\n\nNegative feedback on her ‘ghetto’ persona received from focus groups of the daytime talk show\n\nOn-set insubordination\n\nAdvertiser complaints – (The show’s sales team made it clear that advertisers did not want her in their segments due to her antics and lack of cooperation).\n\nOn Saturday, May 21, Braxton and her co-hosts (Adrienne Bailon, Jeannie Mai, Loni Love and Tamara Mowry) all got phone calls from the show’s parent company Telepictures/Warner Bros. to inform the group that the popular talk show would be moving forward without Braxton.\n\nBraxton was blindsided by the news, as were all of her co-hosts.\n\n“Everyone was caught off guard. None of them saw it coming and everyone was completely blindsided by the decision,” a source close to production tells Daily Mail Online.\n\nThe cast was also taken aback because, as Loni Love stated in her video response, all five cast members had just completed a new photo shoot for images that were supposed to be used to promote their upcoming third season.\n\nThe group was also scheduled to fly to New Orleans together over the July 4th weekend for a rare off-season multi-day taping to occur at this year’s Essence Festival, where they were scheduled to film episodes of their show and premiere them when they returned in September.\n\nBut an alleged flagrant Braxton error in judgement derailed that those plans. The show’s executive producer is said to have cursed her out in earshot of other staffers on set a few weeks ago, after Braxton reportedly sulked over losing a game during the taping, the Daily Mail reports.\n\n“It was an ugly scene. Pinterest was sponsoring the segment and Tamar was genuinely upset she was losing the game.\n\n‘She really acted out during the taping in front of the studio audience and then exploded behind the scenes once the show was done.\n\nProducers had to heavily edit the segment to make it presentable to air on TV, but the sponsor was on set for the segment and witnessed it all,” the source explains. (you can read it in its entirety here).\n\nAccording to production staff, the newspaper continues, Braxton’s outbursts on set were frequent and she regularly blew up at the executive producer and oftentimes her husband, prolific producer Vincent Hubert and/or her co-hosts would have to work to put out the flames.\n\n“Let’s just say she was becoming unbearable to work with,” the source said.\n\nBut the move to finally ax Braxton probably came when she took time off of “The Real” to contend on “Dancing with the Stars” that producers realized the show could survive without her.\n\nFirst off, there was peace on set and, most importantly, the ratings maintained and at times, went up depending on whom was guest co-hosting the show, the source explained.\n\nAfter Telepictures received a two-year renewal of ‘The Real’ on all Fox stations and on BET where it re-airs, execs reportedly wanted to see what they could do to make the show better for Seasons 3 and 4.\n\nHere came the focus groups.\n\nThe research from the focus group was also a major factor in the decision to fire Braxton. She did doesn’t score well with educated women, The Daily Mail reports:\n\n‘The focus group research showed that most educated and working women did not identify with Tamar’s show vernacular and her use of words known to be popular among drag queens and some gay men – phrases like “get your life,” “where they do that at,” “have several seats.”\n\n‘It was even said she seemed more suited to be a judge on RuPaul’s Drag Race on Logo instead of a talk show host on The Real,’ revealed the source.\n\n‘The research went on to say that most educated and working women found her to be ‘ghetto’ and that her aggressive eye-rolling, neck-rolling and the smacking of her mouth were indicative of ‘stereotypical behavior that African American women have worked years to overcome,” the source continued.\n\nThe Real’s executive producer used the aforementioned reasons (the focus group findings, on-set insubordination and the sales team issues about advertisers not wanting Braxton in their segments) to convince Warner Bros. to give Braxton the boot!\n\nVince Herbert, Braxton’s husband and manager, was kept in the dark about these decision to get rid of his wife.\n\n“He knew they were having problems with her and he shielded Tamar from a lot of what was being said and done, but in the end his producer credit on the show was more about vanity and less about control,” the source revealed.\n\nFor the record, Warner Bros. wanted to work out an exit agreement with Braxton that wouldn’t make viewers aware she was being fired but before they could hammer out a joint statement and an agreement that was good for both parties, Tamar had already posted that cryptic message on IG about betrayal and an unnamed person who she feels ‘stabbed’ her ‘in the back.’\n\n‘It’s that type of impulsive behavior and lack of self control that is why she is off the show,’ the source said.", "images": ["https://atlantadailyworld.com/wp-content/uploads/sites/5/2016/05/13320033_1055204587852374_641869300_n.jpg", "https://secure.gravatar.com/avatar/b48259fd3b7c656eeb5914f48637ff3b?s=150&d=mm&r=g"], "top_img": "https://atlantadailyworld.com/wp-content/uploads/sites/5/2016/05/13320033_1055204587852374_641869300_n.jpg", "keywords": [], "authors": [], "canonical_link": "https://atlantadailyworld.com/2016/05/27/3-real-reasons-why-tamar-braxton-was-fired-from-the-real/", "title": "3 ‘real’ reasons why Tamar Braxton was fired from ‘The Real’", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow", "googlebot": "index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1", "bingbot": "index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "3 'real' reasons why Tamar Braxton was fired from 'The Real' | Atlanta Daily World", "description": "Some disturbing, but not surprising, news is billowing out from the set of “The Real” like smoke from an extinguished fire. The “fire” was the firing of popular co-host Tamar Braxton for basically five major reasons, including: On-set tantrums, “p-ssing off’ sponsors, and a focus group  that revealed Tamar’s “aggressive eye-rolling and mouth-smacking” turned off “educated women” viewers … Continued", "url": "https://atlantadailyworld.com/2016/05/27/3-real-reasons-why-tamar-braxton-was-fired-from-the-real/", "site_name": "Atlanta Daily World", "image": {"identifier": "https://atlantadailyworld.com/wp-content/uploads/sites/5/2016/05/13320033_1055204587852374_641869300_n.jpg", "width": 640, "height": 640}}, "article": {"publisher": "https://www.facebook.com/AtlantaDailyWorld/", "published_time": "2016-05-28T01:45:56+00:00", "modified_time": "2020-07-14T19:16:48+00:00"}, "twitter": {"card": "summary_large_image", "creator": "@ADWNews", "site": "@ADWNews"}, "application-name": "", "msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "https://atlantadailyworld.com/wp-content/uploads/sites/5/2017/09/cropped-adwlogo-270x270.png", "msapplication-square70x70logo": "https://atlantadailyworld.com/wp-content/themes/_base-theme/dist/images/favicon/mstile-70x70.png", "msapplication-square150x150logo": "https://atlantadailyworld.com/wp-content/themes/_base-theme/dist/images/favicon/mstile-150x150.png", "msapplication-wide310x150logo": "https://atlantadailyworld.com/wp-content/themes/_base-theme/dist/images/favicon/mstile-310x150.png", "msapplication-square310x310logo": "https://atlantadailyworld.com/wp-content/themes/_base-theme/dist/images/favicon/mstile-310x310.png", "onesignal": "wordpress-plugin", "generator": "Powered by Slider Revolution 6.5.15 - responsive, Mobile-Friendly Slider Plugin for WordPress with comfortable drag and drop interface."}, "movies": [], "publish_date": 1464303600.0, "source": "https://atlantadailyworld.com", "summary": ""}