{"url": "https://www.visitdeepcreek.com/pages/MemberNews1", "text": "Maryland taxpayers have until July 15 to file and pay with no penalty or interest; Federal income tax deadline is April 18\n\nPosted 1/20/22\n\nANNAPOLIS, Md. (January 19, 2022) — Comptroller Peter Franchot announced today the filing and payment deadline for 2021 Maryland state individual income taxes has been extended by three months – to Friday, July 15, 2022 – to assist taxpayers facing financial difficulties due to the COVID-19 pandemic.\n\nThe extension announcement came during a virtual news conference with agency officials to discuss the January 24 start date of the 2022 tax season, which is when federal and state individual income tax returns will be accepted. Federal and state corporate income tax returns are already being processed.\n\nComptroller Franchot’s decision to extend the filing and payment deadlines – essentially a waiver of penalties and interest on outstanding liabilities – from Monday, April 18, 2022 to Friday, July 15, 2022 reflects the pandemic’s continued impact on Maryland individuals and families.\n\n“Many people are still struggling to stay above water, so giving taxpayers more time to file and pay will hopefully ease their financial pressure,” Comptroller Franchot said. “As we approach the two-year mark of the onset of COVID-19, my agency remains as committed as ever to helping Marylanders who still are feeling the pandemic’s impact.”\n\nThe Internal Revenue Service, which already has warned of processing delays for the 2022 tax season due to COVID, has not indicated any plans to extend the federal income tax filing and payment deadline beyond April 18.\n\nThis is the third consecutive year that Comptroller Franchot has extended filing and payment deadlines to July 15. Those extensions have benefitted roughly 600,000 taxpayers each of the past two years, enabling them to hold on to a combined $1.8 billion as an interest-free loan, which may have allowed them to take care of more pressing issues like paying rent or keeping their businesses open.\n\nMaryland taxpayers do not need to request an extension to receive the three-month grace period; it will be automatically granted to all resident and nonresident filers. Taxpayers who expect to receive a refund should file their return as soon as possible and not wait until July 15 to submit.\n\nComptroller Franchot reminded taxpayers that changes made last year to both the federal Earned Income Tax Credit (EITC) and the state Earned Income Credit (EIC) may benefit them, particularly Marylanders who file using an Individual Tax Identification Number (ITIN).\n\n“These important credits are a proven tool to help lift low-to-moderate income earners out of poverty,” Comptroller Franchot said. “All taxpayers should check whether they’re eligible for the programs, which can substantially reduce or even eliminate your federal and state tax liabilities.”\n\nWith the Omicron variant spreading in communities across the state, Comptroller Franchot has instituted several operational protocols to keep employees and the public safe.\n\nAppointments at any of the agency’s 12 branch offices must be scheduled online in advance. Virtual appointments also are available. No walk-ins will be accepted. Masks are required in all branch offices, regardless of vaccination status.\n\nTaxpayers can call 1-800-MD-TAXES or email taxhelp@marylandtaxes.gov. The agency’s branch offices and call centers are both open 8:30 a.m. – 4:30 p.m., Monday through Friday. Beginning February 1, the call center will remain open until 7 p.m., only for personal income tax assistance.\n\nFor questions related to federal taxes, visit https://link.edgepilot.com/s/fe958bef/tUv84BLkAEijTuM_dLUhTA?u=http://www.irs.gov/ or call Taxpayer Advocate Service at 443-853-6000 or 877-777-4778 (outside the Baltimore area). You can also get federal tax help at seven Maryland Taxpayer Assistance Centers.\n\nAs always, taxpayers are encouraged to file their returns electronically and use direct deposit for the fastest possible processing and to ensure they receive all possible refunds and to avoid continued delays with the United States Postal Service. A list of approved vendors for use in filing your electronic return can be found on the Comptroller’s website.\n\nMaryland taxpayers also can use the agency’s free I-File system.\n\nLast year, the agency processed 3.29 million tax returns, distributed 2.61 million refunds with a dollar value of $3.2 billion. Comptroller employees answered nearly 700,000 phone calls, responded to almost 160,000 emails and assisted roughly 22,000 taxpayers through virtual or in-person appointments.", "images": ["https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2018/07/gcchamber_stackedlogo_20210916.jpg", "https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2018/07/248.jpg", "https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2018/07/MountainMarylandLogo_NEWwebsite-3.jpg", "https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2018/07/Annual_AGF_Logo.jpg", "https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2021/12/cropped-SLA_sm-2-32x32.png", "https://www.facebook.com/tr?id=2253073318299933&ev=PageView&noscript=1", "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAALkAAABkAQAAAADydqwAAAAAAnRSTlMAAHaTzTgAAAAZSURBVEjH7cEBDQAAAMKg909tDjegAAB4MwnEAAEAx8GgAAAAAElFTkSuQmCC", "https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2021/12/SLA_sm-2.png", "https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2018/07/Maryland-Tourism-Logo_URL_4C_website2.jpg"], "top_img": "https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2021/12/cropped-SLA_sm-2-32x32.png", "keywords": [], "authors": [], "canonical_link": "https://www.visitdeepcreek.com/member-news/", "title": "Member News", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Member News", "description": "FIRST UNITED BANK & TRUST PROMOTES SEAN R. MCCREERY TO VICE PRESIDENT Posted 10/7/22 Keith R. Sanders, Senior Vice President and Chief Wealth Officer announces that Sean R. McCreery has been promoted to Vice President and Wealth Investment Officer. As Wealth Investment Officer, Sean has overall responsibility for investment research and asset management of First…", "url": "https://www.visitdeepcreek.com/member-news/", "site_name": "Garrett County Chamber of Commerce"}, "article": {"modified_time": "2022-10-07T14:54:22+00:00"}, "twitter": {"card": "summary"}, "generator": "WordPress 6.0.2", "msapplication-TileImage": "https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2021/12/cropped-SLA_sm-2-270x270.png", "google-site-verification": "0ybERtUepYNzK3mfAaYBnaB8PEQIF0svZs4YjZzsDPs"}, "movies": [], "publish_date": null, "source": "https://www.visitdeepcreek.com", "summary": ""}