{"url": "https://www.cheatsheet.com/entertainment/tristan-thompsons-net-worth-is-he-wealthier-than-khloe-kardashian.html/", "text": "Before he began dating Khloé Kardashian in 2016, Tristan Thompson was virtually unknown in popular culture, unless of course, you followed the ins and outs of the National Basketball Association (NBA). The Toronto native seemed to pop out of nowhere when he began seeing the outgoing Kardashian sister, and fans were rooting for the duo when they announced that they were expecting their first child together in December of 2017.\n\nThough Thompson was a member of the Cleveland Cavaliers, which was then led by basketball legend LeBron James, most of us had no clue that when he was drafted into the NBA in 2011, he was the fourth overall pick which at the time was the highest drafted Canadian-born player in NBA history. With such promise in his career, and coming from a family of athletes, we wondered just how wealthy Thompson is, and if his wealth could even touch that of the Kardashian dynasty.\n\nA questionable track record\n\nAt just 27 years old, Thompson has already made quite a name for himself. He’s a 2016 NBA champion and the founder of the Amari Thompson Fund which was created for Thompson’s younger brother who has the neurological disorder and experiences seizures almost daily. With all of that, the 6′ 10″ player seemed to have a lot going for him.\n\nHowever, when Thompson began dating Kardashian, fans of the reality star were shocked to learn that the NBA star had recently broken things off with his ex-girlfriend, a model named Jordan Craig, who also happened to be pregnant at the time. Craig gave birth to her and Thompson’s son, Prince Oliver, on December 12, 2016. A year later, Kardashian announced her own pregnancy. Unfortunately, as the entire world learned in April 2018, just days before Kardashian gave birth to her daughter, True, Thompson isn’t exactly the settling down type. Days before the birth of their first child together, Thompson was caught on video cheating on Kardashian with a slew of women. Video from Oct. 2017 was also released that proved that Thompson had probably never been faithful to the mother of his daughter.\n\nNo comparison\n\nFor the sake of their daughter, it looks like Kardashian and Thompson are determined to work things out. Whatever her other reasons for staying with the Cavaliers star, money certainly isn’t one of the deciding factors. With her salary from her long-running series, Keeping Up With the Kardashians, her clothing line, Good American, and a slew of other ventures, according to People, Kardashian is worth about $40 million.\n\nBy comparison, Thompson’s net worth sits at around $8 million. According to Go Banking Rates, he is currently in the midst of a five-year, $82 million contract with the Cavaliers, that takes him through the 2019-2020 season. Thompson was luckily enough to win a championship ring in 2016. However, with LeBron James now with the Los Angeles Lakers, we’re not sure that Thomson will be seeing another golden statue anytime soon.\n\nThough Kardashian has had to relive her boyfriend’s indiscretions on Keeping Up With the Kardashians, it seems like she’s well on her way to forgiving him. Only time will tell if her fans will ever think Thompson is worthy of her again.\n\nRead more: The Real Reason Why Khloe Kardashian Forgave Tristan Thompson", "images": ["https://pixel.quantserve.com/pixel/p-73816c7sp-TNg.gif", "https://www.cheatsheet.com/wp-content/uploads/2018/04/Khloe-kardashian-and-Tristian-Thompson-e1533151653372.png", "https://www.cheatsheet.com/wp-content/uploads/2018/10/khloekardashiantristanthompsonbirthday.jpg?w=640&h=400", "https://sb.scorecardresearch.com/p?c1=2&c2=27134408&cv=2.0&cj=1", "https://www.cheatsheet.com/wp-content/uploads/2021/09/showbiz_2x.png", "https://www.cheatsheet.com/wp-content/themes/remoter/images/f_logo_RGB-Blue_58.png", "https://www.cheatsheet.com/wp-content/uploads/2018/04/Khloe-kardashian-and-Tristian-Thompson-e1533151653372.png?w=1200", "https://www.cheatsheet.com/wp-content/themes/remoter/images/youtube.png", "https://www.cheatsheet.com/wp-content/themes/remoter/images/instagram.png", "https://www.cheatsheet.com/wp-content/themes/remoter/images/twitter_icon.png"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2018/04/Khloe-kardashian-and-Tristian-Thompson-e1533151653372.png?w=1200", "keywords": [], "authors": ["Aramide Tinubu"], "canonical_link": "https://www.cheatsheet.com/entertainment/tristan-thompsons-net-worth-is-he-wealthier-than-khloe-kardashian.html/", "title": "Tristan Thompson’s Net Worth. Is He Wealthier Than Khloé Kardashian?", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "max-image-preview:large", "description": "What is Tristan Thompson's net worth? The NBA star seemed to pop out of nowhere before stealing Khloe Kardashians's heart, getting her pregnant and then breaking her trust.", "og": {"locale": "en_US", "type": "article", "title": "Tristan Thompson’s Net Worth. Is He Wealthier Than Khloé Kardashian?", "description": "What is Tristan Thompson's net worth? The NBA star seemed to pop out of nowhere before stealing Khloe Kardashians's heart, getting her pregnant and then breaking her trust.", "url": "https://www.cheatsheet.com/entertainment/tristan-thompsons-net-worth-is-he-wealthier-than-khloe-kardashian.html/", "site_name": "Showbiz Cheat Sheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2018/04/Khloe-kardashian-and-Tristian-Thompson-e1533151653372.png?w=1200"}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "published_time": "2018-11-05T14:43:18+00:00"}, "author": "Aramide Tinubu", "twitter": {"card": "summary_large_image", "creator": "@cheatsheet", "site": "@cheatsheet", "label1": "Written by", "data1": "Aramide Tinubu", "label2": "Est. reading time", "data2": "3 minutes"}, "generator": "WordPress 6.0.2"}, "movies": [], "publish_date": 1541428998.0, "source": "https://www.cheatsheet.com", "summary": ""}