{"url": "https://www.hollywoodreporter.com/live-feed/clayne-crawford-apologies-bad-behavior-lethal-weapon-set-1105485", "text": "Lethal Weapon star Clayne Crawford is making amends for his bad behavior on the set of the Fox reboot.\n\nThe actor on Tuesday posted a lengthy apology on his verified Instagram page in which he detailed two incidents that occurred on the Warner Bros. Television procedural. Crawford admitted that he was “reprimanded twice” during the second season of the Fox procedural.\n\nHe said the first incident happened when he became angry with what he deemed unsafe working conditions on the set. After the outburst, Crawford said he met with human resources, apologized for his role in the conflict and completed studio-appointed therapy, while also sharing a “sizable portion” of his paycheck with one of the parties involved — at Warners‘ request. The second incident occurred during an episode Crawford was directing when another actor on set felt unsafe after being hit by a piece of shrapnel from an effect.\n\n“I absolutely love, respect and care for my crew and cast, and would never intentionally jeopardize so many jobs,” Crawford wrote. “I an incredibly sorry if my passion for doing good work has ever made anyone feel less than comfortable on our set, or feel less than celebrated for their efforts. Furthermore, I apologize to all the crew and cast for any negative attention Lethal Weapon is receiving because of these incidents.”\n\nCrawford’s behavior has left Lethal Weapon — one of Fox’s better-performing dramas — on the bubble as many connected with the series have said they would rather not work with the actor. Sources tell The Hollywood Reporter that producer Warner Bros. Television is considering recasting Crawford’s leading role — potentially with an actress — as the independent studio hopes to score a third-season renewal. Fox and Warner Bros. Television have until June 30 — when options on the cast expire — to make a decision on the future of the series.\n\nLoosely inspired by the film franchise starring Mel Gibson and Danny Glover, Fox’s Lethal Weapon follows Riggs (Crawford), coming back to work after the loss of his wife and unborn child, and Murtaugh (Damon Wayans), recovering from a heart attack, as they partner up to work the beat in modern-day Los Angeles. Matt Miller serves as showrunner on the drama, which is exec produced by McG, Dan Lin and Jennifer Gwartz.\n\nRead Crawford’s full post, below.\n\nForgive my delayed response. #truth A post shared by Clayne Crawford (@claynecrawford) on Apr 24, 2018 at 12:53pm PDT\n\nKeep track of all the latest renewals and cancellations with THR‘s scorecard and of all the pilot pickups with our handy guide. For complete coverage, bookmark THR.com/upfronts.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/04/lethal_weapon_s02e16_clayne_crawford_still.jpg?w=1296&h=730&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/lethal_weapon_s02e16_clayne_crawford_still.jpg?w=1024"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/lethal_weapon_s02e16_clayne_crawford_still.jpg?w=1024", "keywords": [], "authors": ["Lesley Goldberg"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/clayne-crawford-apologies-bad-behavior-lethal-weapon-set-1105485/", "title": "Clayne Crawford Apologizes for Bad Behavior on ‘Lethal Weapon’ Set", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The Fox procedural remains on the bubble despite being one of the network's better performing hours.", "news_keywords": "Clayne Crawford, Lethal Weapon", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Lesley Goldberg", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1105485, "title": "Clayne Crawford Apologizes for Bad Behavior on 'Lethal Weapon' Set", "published_at": "2018-04-24 13:58:41", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/lethal_weapon_s02e16_clayne_crawford_still.jpg?w=1024", "comment_count": 0, "tags": "Lethal Weapon", "topics": "TV News", "body": "Lethal Weapon star Clayne Crawford is making amends for his bad behavior on the set of the Fox reboot.\r\nThe actor on Tuesday posted a lengthy apology on his verified Instagram page in which he detailed two incidents that occurred on the Warner Bros. Television procedural. Crawford admitted that he was \"reprimanded twice\" during the second season of the Fox procedural.\r\nHe said the first incident happened when he became angry with what he deemed unsafe working conditions on the set. After the outburst, Crawford said he met with human resources, apologized for his role in the conflict and completed studio-appointed therapy, while also sharing a \"sizable portion\" of his paycheck with one of the parties involved — at Warners' request. The second incident occurred during an episode Crawford was directing when another actor on set felt unsafe after being hit by a piece of shrapnel from an effect.\r\n\"I absolutely love, respect and care for my crew and cast, and would never intentionally jeopardize so many jobs,\" Crawford wrote. \"I an incredibly sorry if my passion for doing good work has ever made anyone feel less than comfortable on our set, or feel less than celebrated for their efforts. Furthermore, I apologize to all the crew and cast for any negative attention Lethal Weapon is receiving because of these incidents.\"\r\n\r\nCrawford's behavior has left Lethal Weapon — one of Fox's better-performing dramas — on the bubble as many connected with the series have said they would rather not work with the actor. Sources tell The Hollywood Reporter that producer Warner Bros. Television is considering recasting Crawford's leading role — potentially with an actress — as the independent studio hopes to score a third-season renewal. Fox and Warner Bros. Television have until June 30 — when options on the cast expire — to make a decision on the future of the series.\r\n\t\r\n\tLoosely inspired by the film franchise starring Mel Gibson and Danny Glover, Fox's Lethal Weapon follows Riggs (Crawford), coming back to work after the loss of his wife and unborn child, and Murtaugh (Damon Wayans), recovering from a heart attack, as they partner up to work the beat in modern-day Los Angeles. Matt Miller serves as showrunner on the drama, which is exec produced by McG, Dan Lin and Jennifer Gwartz.\r\nRead Crawford's full post, below.\r\n\r\n\t\r\n\t\t\r\n\t\t\t\r\n\t\t\t\t \r\n\t\t\r\n\t\tForgive my delayed response. #truth\r\n\t\tA post shared by  Clayne Crawford (@claynecrawford) on Apr 24, 2018 at 12:53pm PDT\r\n\t\r\n\r\nKeep track of all the latest renewals and cancellations with THR's scorecard and of all the pilot pickups with our handy guide. For complete coverage, bookmark THR.com/upfronts.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Clayne Crawford Apologizes for Bad Behavior on ‘Lethal Weapon’ Set", "url": "https://www.hollywoodreporter.com/tv/tv-news/clayne-crawford-apologies-bad-behavior-lethal-weapon-set-1105485/", "description": "The Fox procedural remains on the bubble despite being one of the network’s better performing hours.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/lethal_weapon_s02e16_clayne_crawford_still.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2018-04-24T13:58:41+00:00", "modified_time": "2018-04-24T15:49:20+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Clayne Crawford Apologizes for Bad Behavior on ‘Lethal Weapon’ Set", "description": "The Fox procedural remains on the bubble despite being one of the network’s better performing hours.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/lethal_weapon_s02e16_clayne_crawford_still.jpg?w=1296"}}, "movies": [], "publish_date": 1524578321.0, "source": "https://www.hollywoodreporter.com", "summary": ""}