{"url": "https://stylecaster.com/black-tie-formal-wear/", "text": "Scroll To See More Images\n\nIf you purchase an independently reviewed product or service through a link on our website, STYLECASTER may receive an affiliate commission.\n\nWhether all your friends are suddenly hosting formal weddings or you’ve snagged an invitation to a swanky red carpet event, you’ll likely need some black-tie formal wear—or at least know what it is—in the future. We’re not sure about you, but when we open our mailboxes and find an invitation to a black-tie function, our thoughts immediately turn to what that dress code actually means. Casual wear isn’t going to work, obviously, but is a cocktail dress going to cut it—or do we need something that’s worthy of the Oscars? It’s all a little bit (okay, a lot) confusing.\n\nThat’s why we compiled a guide to black-tie formal wear that’ll help you navigate what to wear to a wedding, event, gala or *literally* anything else that calls for black tie attire. Whether you’re someone who loves to get dressed up in a gown or chic suit or you prefer to stay home in jeans and a tee, you’ll feel like a formalwear pro after perusing our little guide. Though some of the terms might come from traditions that we don’t necessarily adhere to anymore, there are still ways to follow them so you’re dressed appropriately—no matter your personal style.\n\nSo next time you get a fancy invitation in the mail with the words “black-tie formal” printed on it, you’ll know exactly what to wear. Keep reading to learn what black-tie formal really means, whether or not some etiquette rules still hold up and everything else there is to know about dressing for a formal event. You’re welcome.\n\nOur mission at STYLECASTER is to bring style to the people, and we only feature products we think you’ll love as much as we do. Please note that if you purchase something by clicking on a link within this story, we may receive a small commission of the sale.\n\nBlack-Tie Formal Wear: What It Actually Means\n\n\n\nBlack tie is a dress code for social functions that start after 6 PM and basically translates to, “This party is fancy and you should dress accordingly.” Because traditional gender norms have changed through the years, the term is a bit outdated. Originally, when an event was black-tie formal, it meant that men should wear tuxedos. Of course anyone—no matter their gender identity—can wear a suit or a dress, so the functionalities of the term are a little different. We’ll get into the details below.\n\nGown Or No Gown: Do I Have An Option?\n\nApart from white-tie affairs—which aren’t common—black tie is the most formal dress code you’ll probably face when to comes to weddings or galas. For those who wish to wear a dress, it’s customary to wear floor-length gowns, though exceptions can be made.\n\nDon’t own a gown and don’t particularly want to buy one for a one-off occasion? It’s perfectly acceptable to wear a cocktail dress you already have. However, if you do go this route, just make sure to keep the colors rich (black, jewel tones, chic metallics, brown) so as not to look too casual. Conversely, you can wear a floor-length gown in a lighter shade, since the silhouette is inherently dressy.\n\nAnother acceptable option for black-tie affairs: Chic separates, such as a silk blouse with a full satin skirt or an elevated suit (if you’d rather skip the tuxedo), work too.\n\nArt Deco Beaded Gown\n\nThis Art Deco Beaded Gown from Adrianna Papell has major The Great Gatsby energy, don’t you think? The gunmetal shade is great if you’re the kind of person who leans towards all-black but wants something different.\n\nBlack Tie Optional: What It Means\n\nIf you receive an invite with the term “black tie optional” know that it mostly applies to folks (typically, but definitely not limited to, men) who may or may not own or want to wear a tuxedo. For those who prefer dresses, it means you have the option of wearing a full-length gown, or choosing a cocktail dress—so long as the style is relatively conservative. This often means that longer hemlines are preferred and long slits are not. Essentially, if you choose to wear a shorter or cocktail dress, make sure it’ll hold up in a room full of formal tuxedos and gowns.\n\nWearing Red To A Formal Affair: What’s The Deal?\n\nThis dated fashion rule was originally put into place during more conservative times when red was thought to be a way-too-sexy, attention-stealing color. Sure, you might want to stay away from wearing a skin-tight red plunging spandex gown to a wedding or black-tie affair, but in this case, the color isn’t the reason why. These days, there are plenty of high-style red dresses that are perfectly acceptable as formal wear. Celebrities often wear red gowns that look elegant and classic, so go ahead and don a red hot look yourself.\n\nA good rule of thumb: Choose red gowns that are made from rich silky fabrics like chiffon or organza, as opposed to shiny satin or anything too stretchy and always keep embellishments to a minimum.\n\nNiall Midi Dress\n\nYes, cut-outs can work for a black-tie event. This Niall Midi Dress from h:ours is proof! It keeps its formal vibe thanks to the knee-length hemline.\n\nWearing White To A Wedding: Yes or No?\n\nDespite the fact that etiquette books say it’s perfectly fine to wear a white dress to someone else’s wedding so long as it’s not overtly “bridal,” we say proceed with caution. It’s become a pretty big no-no in modern times and you could run the risk of offending the bride—even if it’s a given that you won’t take away any of her attention. Since most folks are usually clued into the fact that wearing white is a don’t, it might look like you made a conscious effort to cause some drama.\n\nYour best bet: Save that ethereal white gown for another formal event that’s not a wedding.\n\nCovering Up: Jackets, Coats & More\n\nSince several formal events take place in colder weather, you’ll need something to keep you warm. However, leave those cardigans, denim jackets and everyday puffers at home and invest in a fur (or faux-fur) jacket or classic overcoat and a chic shawl or cashmere wrap in case you get chilly inside, or for spring and summer affairs.\n\nBelted Double Face Wool Blend Wrap Coat Why would you need a basic black or brown coat when you could wear this light blue option from Bernardo? It’s lightweight yet warm, so it’s great for transitional evenings. Belted Double Face Wool Blend Wrap Coat $265 Buy Now\n\nSiena Noir Coat\n\nDon’t worry, this black coat from APPARIS is covered in faux fur, not the real stuff! Plus, the oversized fit gives this piece a modern edge.\n\nAfter-Party Etiquette: Should I Stick With My Formal Wear?\n\nOccasionally, the festivities won’t stop when the clock strikes midnight, as many couples organize after-parties when it’s a hotel wedding. Is it acceptable to change into jeans, or is keeping your formal wear on a must? This really depends on the location of the wedding. For example, if your hotel room is easily accessible, a lot of people do change. But if it’s another venue, most people won’t. Feel out the situation to see what others are doing—you certainly don’t want to be the only one in jeans when others are still wearing gowns.\n\nA version of this article was originally published in March 2016.", "images": ["https://stylecaster.com/wp-content/uploads/2022/09/charliedixiecrop.png?w=120&h=120&crop=1", "https://stylecaster.com/wp-content/uploads/2022/09/bestfallboots.png?w=120&h=120&crop=1", "https://stylecaster.com/wp-content/uploads/2020/07/banner-newsletter_july2020.jpg?w=670", "https://stylecaster.com/wp-content/uploads/2020/08/formal-gowns-coedition-.jpeg?w=503", "https://stylecaster.com/wp-content/uploads/2020/08/formal-gowns-bhldn-.jpeg?w=405", "https://www.facebook.com/tr?id=146467699155455&ev=PageView&noscript=1", "https://stylecaster.com/wp-content/uploads/2020/08/apparis-.jpeg?w=447", "https://stylecaster.com/wp-content/uploads/2022/08/halloween-costume-trends.png?w=120&h=120&crop=1", "https://stylecaster.com/wp-content/uploads/2013/12/perrie-samotin1.jpg?resize=%2C", "https://stylecaster.com/wp-content/uploads/2020/08/Screen-Shot-2021-08-23-at-1.22.16-PM.png?w=513", "https://trc.taboola.com/1394147/log/3/unip?en=page_view", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://stylecaster.com/wp-content/uploads/2020/08/formal-gowns-la-femme-.jpeg?w=437", "https://stylecaster.com/wp-content/uploads/2022/09/fashionweektrends.png?w=120&h=120&crop=1", "https://stylecaster.com/wp-content/uploads/2022/09/oliviawildeFI.png?w=120&h=120&crop=1", "https://stylecaster.com/wp-content/uploads/2020/08/formal-gowns-bernardo-.jpeg?w=437", "https://stylecaster.com/wp-content/uploads/2018/02/black-tie-formal-wear.jpg", "https://stylecaster.com/wp-content/uploads/2020/08/formal-gowns-ref-.jpeg?w=503", "https://stylecaster.com/wp-content/uploads/2020/08/city-chic-.jpeg?w=437", "https://stylecaster.com/wp-content/uploads/2020/08/formal-gowns-revolve-.png?w=366", "https://stylecaster.com/wp-content/themes/sc-stylecaster-2016/public/assets/images/1x1.trans.gif"], "top_img": "https://stylecaster.com/wp-content/uploads/2018/02/black-tie-formal-wear.jpg", "keywords": [], "authors": ["Perrie Samotin"], "canonical_link": "https://stylecaster.com/feature/black-tie-formal-wear-225061/", "title": "Black Tie Formal Wear: What It Means, What To Wear & More", "meta_data": {"description": "Check out a list of do's and don'ts that explain the basics of black tie formal wear. Then, shop dresses and suits that make the cut!", "keywords": "black tie formal wear, dress code, black tie dress code, black tie attire for women, black tie optional attire for women, black tie", "msvalidate.01": "7A34A1C1904BAFB83691E8B3718CA9A2", "article": {"publisher": "https://www.facebook.com/stylecaster", "published_time": "2021-08-23T18:12:38+00:00", "modified_time": "2022-09-16T15:40:42+00:00", "author": "Perrie Samotin", "section": "Fashion", "tag": "shop"}, "google-site-verification": "yB_5UwT5pPNnn93Mba5HIaFkNtbrafDQWP_Rj34Iw08", "news_keywords": "black tie, formal dresses, shop", "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1, maximum-scale=1", "generator": "WordPress 6.0.2", "author": "Perrie Samotin", "theme-color": "#fff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "StyleCaster", "application-name": "StyleCaster", "og": {"site_name": "StyleCaster", "type": "article", "locale": "en_US", "url": "https://stylecaster.com/feature/black-tie-formal-wear-225061/", "title": "Black Tie Formal Wear: What It Means, What To Wear & More", "description": "Your guide to all things formalwear.", "image": {"identifier": "https://stylecaster.com/wp-content/uploads/2018/02/black-tie-formal-wear.jpg", "width": 960, "height": 540}}, "fb": {"app_id": 134683123322801, "pages": 48566051011, "article_style": "scdefault"}, "twitter": {"card": "summary_large_image", "site": "@stylecaster", "creator": "@stylecaster", "title": "Black Tie Formal Wear: What It Means, What To Wear & More", "description": "Your guide to all things formalwear.", "image": "https://stylecaster.com/wp-content/uploads/2018/02/black-tie-formal-wear.jpg", "account_id": 55678606}}, "movies": [], "publish_date": 1629742358.0, "source": "https://stylecaster.com", "summary": ""}