{"url": "https://www.express.co.uk/news/royal/807049/pippa-middleton-wedding-live-updates-dress-james-matthews-dress-kate-meghan-markle", "text": "Pippa Middleton leaves church after marriage to James Matthews\n\nSUBSCRIBE Invalid email We use your sign-up to provide content in ways you've consented to and to improve our understanding of you. This may include adverts from us and 3rd parties based on our understanding. You can unsubscribe at any time. More info\n\nThe sister of the Duchess of Cambridge married millionaire Mr Matthews in front of about 150 guests at St Mark's Church in Englefield, Berkshire. After the 11:30am service, the wedding party moved to the now Mrs Matthews' parents house in Bucklebury for the reception. Pippa Middleton became known as one of the world's most famous bridesmaids from her sister's wedding in 2011. She was joined by her sister Kate and her royal neice and nephew Prince George and Princess Charlotte. They wore dusky pink and pale green ensembles. Actress Meghan Markle, Prince Harry's girlfriend, was missing from the ceremony, but later arrived at the reception, just in time for a Spitfire flypast at sunset.\n\nIn case you missed all the live coverage of the wedding of the year. Below are all the best pictures and updates as the day unfolded for Pippa Middleton and new husband James Matthews. Monday, May 22 5pm: The extravagant celebrations are estimated to have cost more than £1 million, although thanks to some generous friends her family didn’t have to foot the full bill. The couple started their day with champagne, plus a game of table tennis with Roger Federer before their big day kicked off. 3pm Pippa’s ‘reception dress’ was reportedly a white flowing dress made by the designer Pronovias, which is known for its range of gowns in different styles. It is rumoured that the slinky dress had a thigh-high slit, which would have enabled her to take to the dance floor. Pronovias has a shop in Bond Street, which runs by a request appointment service only. 2pm Pippa and James are reported to be at Los Angeles Airport on the way to their luxurious honeymoon. They will arrive later today at their destination of Tetiaroa, which was once owned by Marlon Brando. The newly-weds were seen chatting with their fellow passengers at Los Angeles International Airport. 1pm The guests may still be recovering from the raucous party as it is revealed that the bash ended at around 4am. It is now also known that a fleet of 50 Land Rovers carried guests from a security check area to the main celebrations. There was a portable Table Tennis table in the marquee, but it isn't known if Wimbledon champion Roger Federer played to show off his skills. 12pm The reports are that 'Party Animal' Prince Harry was on best behaviour at the wedding and he left with his girlfriend, Meghan Markle in the early hours of Sunday morning to return to Kensington Palace. On Sunday, Miss Markle was photographed wearing a baseball cap in the back of a taxi. 11am The wedding was made as elegant as possible as Pippa chose a company that had models as waiters. Pippa had reportedly personally vetted all the waiters and waitresses and all of the staff were forced to sign confidentiality agreements and had to give up their phones before entering the site. The waiters were from the catering company Table Talk. It appears that Pippa's ban of social media at the reception worked as no pictures of inside the marquee have emerged. 10am James Matthews’ best man Justin Johansen compared Pippa to a dog in his best man speech. He said: “Now to the love of James' life: beautiful, energetic, loyal, soft-mouthed, comes on command, great behind. But that is enough about Jame's spaniel, Rafa, I'm here to talk about James' love, Pippa.” He also spoke about her famous bottom with a message from her trainer telling the bride to not forget her \"buttock clench on the star jumps\". 9am Pictures have emerged of inside St Mark's Church in Englefield where Pippa Middleton walked down the aisle with her father, Michael to marry James Matthews. She was watched by 150 of her friends and family as well as royalty and celebrities. Following the church ceremony, the guests enjoyed a wedding reception in Pippa's parents family estate in Bucklebury. 8am The staff serving food and drink at Saturday’s wedding were all understood to be models. Miss Middleton’s careful choreography ­extended to the table plan, which decreed that couples should not sit together. The bawdy best man was said to have stepped over the mark as details emerge about the reception. James Matthews' best man is said to have made crude punchlines about sex and made a lewd gag about the couple's honeymoon at the evening reception on Saturday. It was claimed Justin Johannsen, a long-time friend of Mr Matthews, stepped up to the mic at 11.30pm after a five-course dinner and started with tributes to guests but then compared the bride to a 'dog' which left the room with an awkward silence.\n\nGETTY•WIREIMAGE Pippa Middleton has arrived at the Berkshire church\n\nSunday, May 21 5pm There is now speculation as to who will be the next couple to be engaged; will it be Donna Air and James Middleton? Or, will there be a Prince Harry and Meghan Markle engagement? 3pm The menu last night included haggis, foie gras and King prawns. Pippa’s former employee Table Talk was in charge of the food and feeding the 300 guests. 2pm There are reports that tennis super star Roger Federer enjoyed a game of table tennis during the wedding last night. The wedding has caught the eye of the world and has received global coverage. 12:30pm Although the lucky guests may be nursing their hangovers from last night’s lavish celebrations, they won't be discovering any embarrassing selfies on social media as guests were banned from using their mobile phones. 9am The reports are that Pippa Middleton and James Matthews's honeymoon will be in French Polynesia, on a private island once owned by Marlon Brando. Former US president Barack Obama reportedly touched down a few weeks ago to begin his White House memoirs. Saturday, May 20 11pm A vintage World War 11 spitfire entertained guests with a spectacular flypast above Pippa’s parents home in Berkshire. Neighbours say that they had been warned about the flypast by the Middletons. 10:30pm It seems that Prince Harry left the wedding ceremony to go and pick up her love interest Meghan Markle and bring her back to the party in Bucklebury. The Prince had a round-trip of 100 miles to ensure his girlfriend could attend the bash of the year. Hilarious memes had appeared on Twitter as fans speculated as to why Meghan Markle was not at the ceremony. Piers Morgan said the only reason he was interested in the nuptials was to see \"what Meghan Markle wore\".\n\nBACKGRID Inside St Mark's Church where Pippa married James\n\nFynetPictures Guests enjoyed a spitfire display during the celebrations\n\n10pm It has emerged that Pippa wore the same drop diamond earrings that she wore as a bridesmaid when her sister Kate married Prince William in 2011. 9.40pm Reports emerge over Meghan Markle being spotted at the reception with Prince Harry. 8.40pm About 350 high-profile guests are believed to be at the reception at Carol and Michael Middleton's home on Pease Hill. 8.20pm Guests gushed over the wedding as they began arriving at the reception. A guest, who did not wish to be named, said: \"They looked really happy. It was a wonderful ceremony. They were clearly very much in love.\" 7.30pm Fans of the Royal family are desperately seeking pictures of Meghan Markle at the wedding reception as hilarious memes emerge on Twitter. There is no sign of the Suits actress yet. 6.30pm All eyes are peeled for Meghan Markle, who is currently in the UK, after Prince Harry was spotted leaving the wedding party in his car. It is believed he has gone to collect his girlfriend for the evening party.\n\nFlynetPictures The happy couple leave the church after the ceremony\n\nFlynet Pictures Fans wave the couple off as they leave the church\n\nGETTY The Duke and Duchess of Cambridge after the Royal wedding in a vintage car\n\nThe newly-married couple leave the church venue in Englefield with thier loyal fans wishing them well. As groom James drives the classic car, they both wave at the cameras looking excited for the evening ahead.\n\nSamir Hussein/WireImage Prince George leaves the wedding\n\nGetty The newly-married couple leave the church\n\nPA Prince Harry leaves the church with the other guests\n\nPA Prince George and the other page boys and flower girls", "images": ["https://googleads.g.doubleclick.net/pagead/viewthroughconversion/1068671835/?value=0&label=u9gYCOmHtQYQ28bK_QM&guid=ON&script=0", "https://cdn.images.express.co.uk/img/page/placeholder-horizontal.gif", "https://cdn.images.express.co.uk/img/page/placeholder.gif", "https://cdn.images.express.co.uk/img/dynamic/subnavbanner/desktop/11.jpg", "https://cdn.images.express.co.uk/img/logo/dr/logo.png", "https://cdn.images.express.co.uk/img/page/placeholder-vertical.gif", "https://cdn.images.express.co.uk/theme/Mobile/img/page/placeholder-horizontal.gif", "https://cdn.images.express.co.uk/img/dynamic/106/750x445/807049.jpg", "https://www.facebook.com/tr?id=568781449942811&ev=PageView&noscript=1"], "top_img": "https://cdn.images.express.co.uk/img/dynamic/106/750x445/807049.jpg", "keywords": [], "authors": ["Laura Mowat", "Zoie O'Brien"], "canonical_link": "https://www.express.co.uk/news/royal/807049/pippa-middleton-wedding-live-updates-dress-james-matthews-dress-kate-meghan-markle", "title": "Pippa Middleton wedding: In case you missed it...Pippa marries in lace with Kate & Meghan", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "PIPPA Middleton tied the knot with her hedge fund boyfriend James Matthews in a private wedding dubbed the 'society event of the year', with Meghan Markle arriving for the evening reception on the arm of Prince Harry.", "verify-v1": "EGl3XPBuem43awGwLC1rXGpRHRnmNSwp7VZfnCAAcKE=", "msvalidate.01": "1960193A20395DAD3FCB640BCB0D91D7", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "fb": {"app_id": 823607694325129, "pages": 129617873765147}, "og": {"title": "Pippa Middleton wedding LIVE: Bride arrives at church", "type": "article", "url": "https://www.express.co.uk/news/royal/807049/pippa-middleton-wedding-live-updates-dress-james-matthews-dress-kate-meghan-markle", "image": "https://cdn.images.express.co.uk/img/dynamic/106/750x445/807049.jpg", "site_name": "Express.co.uk", "language": "en", "tags": "headlines,ctp_video,autoplay_video,Pippa Middleton,wedding,James Matthews,Duchess of Cambridge,Berkshire,Bucklebury", "section": "Royal", "description": "PIPPA Middleton tied the knot with her hedge fund boyfriend James Matthews in a private wedding dubbed the 'society event of the year', with Meghan Markle arriving for the evening reception on the arm of Prince Harry."}, "news_keywords": "headlines,ctp_video,autoplay_video,Pippa Middleton,wedding,James Matthews,Duchess of Cambridge,Berkshire,Bucklebury", "article": {"tag": "Bucklebury", "published_time": "2017-05-22T17:19:00+01:00", "modified_time": "2017-05-22T17:30:24+01:00", "expiration_time": "2017-06-21", "section": "Royal", "image_count": 34, "video_count": 3, "word_count": 2603, "internal_link_count": 3, "external_link_count": 0, "opinion": "false", "content_tier": "free"}, "author": "Laura Mowat, Zoie O'Brien", "twitter": {"card": "summary_large_image", "image": "https://cdn.images.express.co.uk/img/dynamic/106/750x445/807049.jpg", "title": "Pippa Middleton wedding LIVE: Bride arrives at church", "description": "PIPPA Middleton tied the knot with her hedge fund boyfriend James Matthews in a private wedding dubbed the 'society event of the year', with Meghan Markle arriving for the evening reception on the arm of Prince Harry."}, "video_autoplay": "false", "headline_short": "Pippa Middleton wedding: In case you missed it...Pippa marries in lace with Kate & Meghan", "vf": {"image": "https://cdn.images.express.co.uk/img/dynamic/106/237x141/807049_1.jpg", "container_id": "express-prod-807049", "site_id": "00000000-0000-4000-8000-0ed77b31aaaf"}, "robots": "noodp,noydir,all", "dataLayer": "{\"page\":{\"attributes\":{\"publicationName\":\"express\",\"ownerSite\":\"express\",\"ownerSiteDomain\":\"www.express.co.uk\",\"platformType\":\"responsive\",\"cmsPlatform\":\"Daily Express CMS\",\"pageType\":\"article\",\"sectionId\":\"106\"}},\"article\":{\"articleId\":\"807049\",\"articleTitle\":\"Pippa Middleton wedding: In case you missed it...Pippa marries in lace with Kate & Meghan\",\"articleAuthor\":\"Laura Mowat, Zoie O'Brien\",\"firstPublishDate\":\"2017-05-22\",\"firstPublishTime\":\"17:19:00\",\"attributes\":{\"primaryTag\":\"Pippa Middleton\",\"allTags\":\"Pippa Middleton|pippa middleton|wedding|james matthews|duchess of cambridge|berkshire|bucklebury\",\"isAdvertorial\":false,\"isNative\":false,\"affiliateLinks\":false,\"activeLegalProceedings\":false,\"nudity\":false,\"isSensitive\":false}}}"}, "movies": [], "publish_date": 1495469940.0, "source": "https://www.express.co.uk", "summary": ""}