{"url": "https://www.usatoday.com/story/life/people/2017/10/17/project-runway-designer-and-finalist-mychael-knight-dies-39/774525001/", "text": "'Project Runway' designer and finalist Mychael Knight dies at 39\n\nShow Caption Hide Caption 'Project Runway' designer Mychael Knight dies at 39 Mychael Knight gained fans as a finalist on the popular fashion design reality show 'Project Runway.' A friend of the Georgia designer said he died \"doing what he loved.\" USA TODAY\n\nGeorgia fashion designer Mychael Knight, who was a finalist on the popular TV competition show Project Runway, died Tuesday at age 39.\n\nKnight died outside Atlanta surrounded by family and friends, said friend Jerris Madison, the editor and photographer of Obvious Magazine, a fashion, lifestyle and cultural publication.\n\nAn official cause of death has not been released, but Knight had extensively shared his five-year struggles with irritable bowel syndrome, writing in now-deleted Facebook posts that he suffered chronic abdominal pain, a \"leaky gut,\" extreme fatigue and exhaustion.\n\n\"He was innovative, unapologetic, kind and giving,\" Madison said of Knight. \"He made sure that anybody who was in his core circle, his family, his friends, didn't have to want for anything. He was just an amazing man.\"\n\nKnight appeared on Season 3 of Project Runway, which aired on Bravo, finishing fourth that year. He returned for Project Runway All-Stars, finishing eighth on the show that now airs on the Lifetime network.\n\n\"We are saddened to hear about the passing of a member of the Project Runway family,\" said Lifetime spokeswoman Dee Perez in a statement. \"It's a loss of a great talent and we wish his family peace and solace during this difficult time.\"\n\nKnight spent his childhood in Montgomery, Alabama, but graduated from Washingtonville Senior High School in Washingtonville, New York, in 1996. Later that same year, he began his freshman year of college at Georgia Southern University in Statesboro, Georgia. In 2001, he earned a Bachelor of Science degree in apparel design and merchandising.\n\nAfter completing his undergraduate studies, Knight broke into the fashion industry in Atlanta by working as an intern at Wilbourn Exclusives in 2001 before becoming a fashion stylist in the music industry in 2002.\n\nIn 2006, Knight became a contestant for Project Runway, and went on to win that season's fan favorite award. The next year, he introduced his label, Mychael Knight, on BET's Rip the Runway and he designed a line of custom tees for the Starbucks Corp.\n\nIn 2008, Knight launched Kitty & Dick, his lingerie label for men and women, and his unisex fragrance, MajK.\n\nMadison said Project Runway definitely helped expand Knight's brand, which caught the eye of celebrities like Toni Braxton, Sheri Shepard and Eva Marcille, who ultimately became his clients.\n\n\"His name was still on people's minds,\" Madison said. \"The industry is very competitive, but he continued to do it his way.\"\n\nMadison said Knight, who had been living in Los Angeles, was always sharp and chic in his personal style and that carried over into his collections.\n\n\"He died doing what he loved,\" Madison said. \"And you can see that in his final collection presented (last month) at New York Fashion Week. It was amazing. The industry has lost a true innovator. Mychael was just getting to that point where people were saying 'Hey, I remember this guy.' He was about to be huge and really wanted to capitalize on affordable sportswear for women of all sizes.\"\n\nIn addition to his parents, Michael Sr. and Pamela Knight, Knight is survived by two sisters.\n\n\"Mychael meant everything to us and we loved him dearly. He was generous and so full of life. This is how we choose to remember his legacy,\" the family said in a statement.\n\nFuneral arrangements were pending.", "images": ["https://media.gannett-cdn.com/29906170001/29906170001_5615930242001_5615931809001-vs.jpg?pubId=29906170001", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://www.gannett-cdn.com/-mm-/5aaaaa652c271f6aae3dc166d527415f6fdd185e/c=0-54-2303-1355/local/-/media/2017/10/17/USATODAY/USATODAY/636438723118011179-AP-Obit-Knight.jpg?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/5aaaaa652c271f6aae3dc166d527415f6fdd185e/c=0-54-2303-1355/local/-/media/2017/10/17/USATODAY/USATODAY/636438723118011179-AP-Obit-Knight.jpg?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/people/2017/10/17/project-runway-designer-and-finalist-mychael-knight-dies-39/774525001/", "title": "'Project Runway' designer and finalist Mychael Knight dies at 39", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/people/2017/10/17/project-runway-designer-and-finalist-mychael-knight-dies-39/774525001/life/people", "theme-color": "#ffffff", "og": {"type": "article", "title": "'Project Runway' designer and finalist Mychael Knight dies at 39", "description": "Mychael Knight appeared on Season 3 of the reality show and finished fourth.", "site_name": "Associated Press", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/5aaaaa652c271f6aae3dc166d527415f6fdd185e/c=0-54-2303-1355/local/-/media/2017/10/17/USATODAY/USATODAY/636438723118011179-AP-Obit-Knight.jpg?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "Mychael Knight appeared on Season 3 of the reality show and finished fourth.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1508194800.0, "source": "https://www.usatoday.com", "summary": ""}