{"url": "https://www.hollywoodreporter.com/heat-vision/power-rangers-green-ranger-theory-sequel-explained-988678", "text": "Naomi Scott as \"Kimberly,\" RJ Cyler as \"Billy,\" Dacre Montgomery as \"Jason,\" Ludi Lin as \"Zack\" and Becky G as \"Trini\" in SABAN'S POWER RANGERS.\n\n[Warning: This story contains spoilers for Power Rangers.]\n\nWant to know if a film might be having a sequel? Then stay seated! Just because the movie’s over and your popcorn is finished doesn’t mean that’s all that’s in store for you.\n\nPower Rangers, which hit theaters Friday, is following the Marvel Studios trend by featuring a little something extra.\n\n“There’s a post-credits scene, so people should stay,” the film’s director, Dean Israelite, tells The Hollywood Reporter, adding, “It teased up the direction of what the next movie could be. For people that know the brand, it’s super exciting. There are so many ideas we’re kicking around in the direction of where the film leads you.”\n\nAnd it looks like the film is hoping to morph toward a sequel by introducing a key character in the story about the Rangers. In the post-credits scene, the teacher in detention does roll call. And there’s one person he can’t find on the list: Tommy Oliver. The teacher repeatedly announces the name Tommy Oliver, and the camera cuts to a green coat sitting on an empty chair in detention.\n\nOliver is no stranger to Power Rangers fanatics. In the original Mighty Morphin Power Rangers TV series, the character was introduced as the Green Ranger, who is actually, at first, an enemy to the other Rangers while he’s a new student at Angel Grove High School. In the franchise, the character has also had a varied amount of story development, including being elevated to being the White Ranger and becoming a love interest for the Pink Ranger. In fact, in the new film, the actor Jason David Frank (who played Oliver) appeared alongside original Pink Ranger actress Amy Jo Johnson in a cameo during the final battle.\n\nAs for the new Tommy, with the green coat in the scene, he will likely be the Green Ranger at the start. But wait a minute: The character doesn’t necessarily need to be a he. And according to Dacre Montgomery, aka the new Red Ranger, the cast is campaigning for Oliver to be female.\n\nMontgomery tells THR, “A lot of the cast and I have discussed that we think it should be a girl. It makes it even: three girls, three boys.”\n\nHe adds that the scene is ambiguous and actually leaves the door open for this to happen.\n\n“It’s left blank. It’s a cliff-hanger. Whoever you’re going to drop into that position — whether it’s a girl — it’s inevitably going to create drama. It’ll be interesting to drop that drama into it and see how we all relate to it and work with it,” says the star.\n\nSo what do you think? Should the new Tommy Oliver be female? And who should play her? Chat about it in the comments section below, and stay tuned to Heat Vision for more Power Rangers coverage.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/03/pr_d051_10706_pr_d051_10705_r14_comp-h_2017.jpg?w=1296&h=730&crop=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/03/pr_d051_10706_pr_d051_10705_r14_comp-h_2017.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.hollywoodreporter.com/wp-content/uploads/2017/03/mmpr_1995_7-embed.jpg?w=928", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/03/pr_d051_10706_pr_d051_10705_r14_comp-h_2017.jpg?w=1024", "keywords": [], "authors": ["Brian Porreca"], "canonical_link": "https://www.hollywoodreporter.com/movies/movie-news/power-rangers-green-ranger-theory-sequel-explained-988678/", "title": "‘Power Rangers’ Cast Lobbying for a Female Green Ranger in Sequel", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "\"A lot of the cast and I have discussed that we think it should be a girl,\" says star Dacre Montgomery of Tommy possibly showing up in the next film.", "news_keywords": "Power Rangers", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Brian Porreca", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 988678, "title": "'Power Rangers' Cast Lobbying for a Female Green Ranger in Sequel", "published_at": "2017-03-25 06:30:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/03/pr_d051_10706_pr_d051_10705_r14_comp-h_2017.jpg?w=1024", "comment_count": 0, "tags": "Power Rangers", "topics": "Movies", "body": "[Warning: This story contains spoilers for Power Rangers.]\r\nWant to know if a film might be having a sequel? Then stay seated! Just because the movie's over and your popcorn is finished doesn't mean that's all that's in store for you.\r\nPower Rangers, which hit theaters Friday, is following the Marvel Studios trend by featuring a little something extra.\r\n\"There's a post-credits scene, so people should stay,\" the film's director, Dean Israelite, tells The Hollywood Reporter, adding, \"It teased up the direction of what the next movie could be. For people that know the brand, it’s super exciting. There are so many ideas we’re kicking around in the direction of where the film leads you.\"\r\n\r\nAnd it looks like the film is hoping to morph toward a sequel by introducing a key character in the story about the Rangers. In the post-credits scene, the teacher in detention does roll call. And there's one person he can't find on the list: Tommy Oliver. The teacher repeatedly announces the name Tommy Oliver, and the camera cuts to a green coat sitting on an empty chair in detention.\r\nOliver is no stranger to Power Rangers fanatics. In the original Mighty Morphin Power Rangers TV series, the character was introduced as the Green Ranger, who is actually, at first, an enemy to the other Rangers while he's a new student at Angel Grove High School. In the franchise, the character has also had a varied amount of story development, including being elevated to being the White Ranger and becoming a love interest for the Pink Ranger. In fact, in the new film, the actor Jason David Frank (who played Oliver) appeared alongside original Pink Ranger actress Amy Jo Johnson in a cameo during the final battle.\r\n\r\nAs for the new Tommy, with the green coat in the scene, he will likely be the Green Ranger at the start. But wait a minute: The character doesn't necessarily need to be a he. And according to Dacre Montgomery, aka the new Red Ranger, the cast is campaigning for Oliver to be female.\r\nMontgomery tells THR, \"A lot of the cast and I have discussed that we think it should be a girl. It makes it even: three girls, three boys.\"\r\nHe adds that the scene is ambiguous and actually leaves the door open for this to happen.\r\n\"It’s left blank. It’s a cliff-hanger. Whoever you’re going to drop into that position — whether it’s a girl — it’s inevitably going to create drama. It’ll be interesting to drop that drama into it and see how we all relate to it and work with it,\" says the star.\r\nSo what do you think? Should the new Tommy Oliver be female? And who should play her? Chat about it in the comments section below, and stay tuned to Heat Vision for more Power Rangers coverage.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Power Rangers’ Cast Lobbying for a Female Green Ranger in Sequel", "url": "https://www.hollywoodreporter.com/movies/movie-news/power-rangers-green-ranger-theory-sequel-explained-988678/", "description": "“A lot of the cast and I have discussed that we think it should be a girl,” says star Dacre Montgomery of Tommy possibly showing up in the next film.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/03/pr_d051_10706_pr_d051_10705_r14_comp-h_2017.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-03-25T06:30:00+00:00", "modified_time": "2017-03-28T08:07:42+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Power Rangers’ Cast Lobbying for a Female Green Ranger in Sequel", "description": "“A lot of the cast and I have discussed that we think it should be a girl,” says star Dacre Montgomery of Tommy possibly showing up in the next film.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/03/pr_d051_10706_pr_d051_10705_r14_comp-h_2017.jpg?w=1296"}}, "movies": [], "publish_date": 1490423400.0, "source": "https://www.hollywoodreporter.com", "summary": ""}