{"url": "https://www.usatoday.com/story/sports/olympics/2018/01/16/chrissy-teigen-offers-pay-100000-fine-mckayla-maroney-larry-nassar/1036339001/", "text": "Chrissy Teigen offers to pay $100,000 fine for McKayla Maroney to speak out against Nassar\n\nShow Caption Hide Caption Sex Abuse Victim Speaks Against Ex-Doctor Kyle Stephens was the first victim of nearly 100 to speak Tuesday at a sentencing hearing for Larry Nassar. Stephens, whose parents were friends with the now disgraced doctor, said he repeatedly sexually abused her when she was a child. (Jan. 16) AP\n\nLarry Nassar, the former USA Gymnastics team doctor who pleaded guilty in November to criminal sexual conduct, is being sentenced this week on seven sexual assault charges. The sentencing began Tuesday and is expected to conclude on Friday in Lansing, Mich. Nassar faces up to a life sentence, with a minimum of 25 to 40 years in prison.\n\nClose to 90 women are slated to read victim impact statements at his hearing this week. But former gymnast and Nassar victim McKayla Maroney — who first shared her story of abuse over Twitter — faces a $100,000 fine if she speaks out. Maroney signed a nondisclosure agreement in December 2016, agreeing to stay quiet about the abuse she experienced as part of a $1.25 million settlement with USA Gymnastics.\n\nChrissy Teigen, a swimsuit model and TV host, does not want Maroney to remain silent. Teigen tweeted on Tuesday that she would \"be absolutely honored to pay\" the $100,000 fine for Maroney. Teigen called Nassar a \"serial monster\" in her tweet, while questioning the \"entire principle\" of the fine.\n\nMaroney is suing USA Gymnastics, the U.S. Olympic Committee and Michigan State University, claiming the nondisclosure agreement she signed was illegal.\n\nUSA Gymnastics said last month that the settlement terms from the 2016 agreement were initially not drawn up by its lawyers but rather by Maroney's attorney.\n\nThe entire principle of this should be fought - an NDA to stay quiet about this serial monster with over 140 accusers, but I would be absolutely honored to pay this fine for you, McKayla. pic.twitter.com/lsBEgEqZpD — christine teigen (@chrissyteigen) January 16, 2018\n\nLater on Tuesday, Michael Schur and Kristen Bell — The creator and star of NBC's \"The Good Place,\" respectively — offered to pitch in as well.\n\nI’ll split it with you. https://t.co/yp00LwJsNQ — Ken Tremendous (@KenTremendous) January 16, 2018\n\nI'll 1/3 it with you guys. https://t.co/XasgyGEg6E — Kristen Bell (@IMKristenBell) January 16, 2018\n\nMaroney claims in her lawsuit filed last month that USA Gymnastics tried to prevent her from publicly accusing Nassar of sexual abuse in order to allow him to quietly leave USA Gymnastics and \"further silencing his victims.\" In the lawsuit filed to Los Angeles Superior Court, Maroney alleges she was forced to sign a confidentiality agreement as part of the financial settlement she needed to pay for psychological treatment.\n\n\"USA Gymnastics has not sought and will not seek any money from McKayla Maroney for her brave statements made in describing her victimization and abuse by Larry Nassar, nor for any victim impact statements she wants to make to Larry Nassar at this hearing or at any subsequent hearings related to his sentencing,\" USA Gymnastics said in a statement.\n\n\"This has been her right and USA Gymnastics encourages McKayla and anyone who has been abused to speak out. USA Gymnastics remains focused on our highest priority — the safety, health and well-being of our athletes and creating a culture that empowers and supports them.\"\n\nOlympic gold medalists Simone Biles, Aly Raisman and Gabby Douglas have also revealed they were molested by Nassar.\n\nMORE: Simone Biles alleges Larry Nassar sexually abused her\n\nMORE: Don't make Simone Biles and other gymnasts return to Karolyi ranch\n\nMORE: Women share devastating reaction to Larry Nassar\n\nNassar was sentenced last month to 60 years in prison on three federal charges related to child pornography.", "images": ["https://www.gannett-cdn.com/-mm-/5844c1425ecaf2bb8f152e6859c8b02aba3a84be/c=663-273-4711-2560/local/-/media/2017/10/18/USATODAY/USATODAY/636439106464210210-b01-b-maroney-06.jpg?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://media.gannett-cdn.com/29906170001/29906170001_5712898323001_5712889627001-vs.jpg?pubId=29906170001", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/5844c1425ecaf2bb8f152e6859c8b02aba3a84be/c=663-273-4711-2560/local/-/media/2017/10/18/USATODAY/USATODAY/636439106464210210-b01-b-maroney-06.jpg?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Scott Gleeson"], "canonical_link": "https://www.usatoday.com/story/sports/olympics/2018/01/16/chrissy-teigen-offers-pay-100000-fine-mckayla-maroney-larry-nassar/1036339001/", "title": "Chrissy Teigen offers to pay $100,000 fine for McKayla Maroney to speak out against Nassar", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/sports/olympics/2018/01/16/chrissy-teigen-offers-pay-100000-fine-mckayla-maroney-larry-nassar/1036339001/sports/olympics", "theme-color": "#ffffff", "og": {"type": "article", "title": "Chrissy Teigen offers to pay $100,000 fine for McKayla Maroney to speak out against Nassar", "description": "Due to nondisclosure agreement, former gymnast McKayla Maroney would be fined $100,000 if she spoke out against Larry Nassar.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/5844c1425ecaf2bb8f152e6859c8b02aba3a84be/c=663-273-4711-2560/local/-/media/2017/10/18/USATODAY/USATODAY/636439106464210210-b01-b-maroney-06.jpg?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "Due to nondisclosure agreement, former gymnast McKayla Maroney would be fined $100,000 if she spoke out against Larry Nassar.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1516060800.0, "source": "https://www.usatoday.com", "summary": ""}