{"url": "https://en.wikipedia.org/wiki/Jesse_Williams_(actor)", "text": "American actor, director, producer, and activist\n\nJesse Wesley Williams is an American actor, director, producer, and activist. He portrayed Dr. Jackson Avery on the ABC series Grey's Anatomy (2009–2022) and has appeared in the films The Cabin in the Woods (2012), The Butler (2013) and Band Aid (2017). He also provided voice acting and motion capture for Markus in Detroit: Become Human (2018). He has also served as an executive producer of the Academy Award-winning short, Two Distant Strangers (2021) and the Tony Award-winning revival of Take Me Out (2022), for the latter of which he was nominated for a Tony Award for Featured Actor in a Play.\n\nEarly life [ edit ]\n\nWilliams was born in Chicago[2] to Johanna Chase, a professional potter, and Reginald Williams.[3] Jesse Williams has said his mother is a Swedish American and his father is an African American from Georgia.[4][5] His two younger brothers specialize and work in the field of visual arts. Williams graduated from Moses Brown School in Providence, Rhode Island in 1998.[3] After he graduated from high school his father began teaching history in northern Maine, while his mother continued to work in pottery.[3][5]\n\nWilliams graduated from Temple University with a double major in African American Studies and Film and Media Arts.[3][6] Following in the footsteps of his parents, he taught high school in the Philadelphia public school system for six years teaching American Studies, African Studies, and English.[7]\n\nActing career [ edit ]\n\nIn 2005, Williams began to study acting and was chosen to participate in the New York Actors Showcase presented by ABC Television, one of 14 actors chosen from among over 800 individuals who auditioned.[3] Since 2006, he has appeared in a number of television series, films and theatre productions. In 2012, he established a production company, farWord Inc.[5]\n\nIn May 2012, a fan campaign was organized to try to influence film executives to cast him in the role of Finnick Odair in The Hunger Games: Catching Fire.[8] This news resulted in some Hunger Games fans protesting casting decisions made by the film executives.[9]\n\nIn 2013, Williams wrote an opinion piece for CNN which analyzed the film Django Unchained.[10] Later that year he narrated the audio version of the book The Bane Chronicles: What Really Happened In Peru, by Cassandra Clare and Sarah Rees Brennan.[11]\n\nIn 2006, Williams appeared in an episode of Law & Order, portraying the character Kwame. He also appeared in the role of Drew Collins, in two episodes of the ABC Family series Greek.[12]\n\nOn October 15, 2009, Williams began appearing as surgical resident Jackson Avery, in the ABC television series Grey's Anatomy.[13] On June 8, 2010, it was announced Williams would be a series regular, starting in season 7.[14] It was announced on May 6, 2021, that he would be exiting the show,[15] his final episode airing May 20 on ABC. In an interview with The Hollywood Reporter in May 2021, Williams said the decision to leave the show was \"a collective thing\" and part of a discussion the actor had with showrunner Krista Vernoff about Jackson's trajectory that ultimately helped solidify 11 seasons of storyline.[16]\n\nBuddyTV ranked him No. 6 on its \"TV's 100 Sexiest Men of 2010\" list[17] and No. 11 in 2011.[18] Jesse was named the TV Actor of the Year at the 2011 Young Hollywood Awards.[19]\n\nIn 2008, Williams made his film debut in the supporting role of Leo in the sequel to the 2005 film The Sisterhood of the Traveling Pants. Two years later, he appeared in Brooklyn's Finest (2010), starring Don Cheadle, Richard Gere, Ethan Hawke, Wesley Snipes, and Ellen Barkin. In 2008, Williams signed on for his first leading role, as Holden McCrea in the MGM/United Artists horror film The Cabin in the Woods. Produced by Joss Whedon and directed by Drew Goddard, it was released April 13, 2012.[20]\n\nOn June 9, 2015, Variety announced Jamie Bamber, Kellan Lutz, Jesse Williams, and Jess Weixler had joined the cast of the thriller film Money, directed by Martin Rosete and produced by Atit Shah.[21]\n\nIn May 2016, Williams was executive producer of the documentary film Stay Woke: The Black Lives Matter Movement.[22] In 2021, Williams produced an American short-film titled Two Distant Strangers, written by Travon Free and Martin Desmond Roe. This short film won an Academy Award for Best Live Action Short Film in 2021.\n\nWilliams has served as a guest director for student productions at the Urban Arts Partnership 24 Hour Plays Off-Broadway, at the request of Rosie Perez and Anna Strout.[7][20]\n\nIn March 2022, Williams made his Broadway debut in the revival of Richard Greenberg’s Take Me Out. Williams stars in the lead role of Darren Lemming. He's been nominated for a Tony Award for Best Featured Actor in a Play.\n\nActivism [ edit ]\n\nWilliams is the youngest member of the board of directors at The Advancement Project, a civil rights think tank and advocacy group. He is also the executive producer of Question Bridge: Black Males, a multifaceted media project, art exhibition, student and teacher curriculum and website,[23] focused on the black male identity and the diversity within the demographic. He has written articles for CNN[24] and The Huffington Post,[25] and has been a guest on Wolf Blitzer's The Situation Room.\n\nIn June 2016, Williams won the humanitarian award at the 2016 BET Awards, delivering a speech highlighting racial injustice, police brutality, and the invention of whiteness.[26] As a result of his speech, dueling petitions were circulated: one to have Williams fired from Grey's Anatomy and one to keep him on the series.[27]\n\nOther work [ edit ]\n\nWilliams occasionally worked as a model during college, but never considered pursuing it as a career. He modeled for Kenneth Cole Productions, Levi's, and Tommy Hilfiger Corporation.[2][28] He can be seen as the love interest of R&B singer Rihanna in the music video for her single \"Russian Roulette\" from her 2009 album Rated R. He also appears in the music video for Estelle's song \"Fall In Love\", from the album All of Me.[20] In 2018, Williams appeared in the video for \"Tell Me You Love Me\" By Demi Lovato. Williams also modeled for Lane Bryant in 2012.\n\nWilliams did the voice acting and performance capture for Markus in the video game Detroit: Become Human, which first released on May 25, 2018, for the PlayStation 4. He also did the voice acting and performance capture for Duke in the video game NBA 2K21, which released worldwide on September 4, 2020, for multiple consoles.\n\nPersonal life [ edit ]\n\nWilliams dated Aryn Drake-Lee for five years before the two married on September 1, 2012. The couple have two children together, a daughter Sadie Williams (b. December 2013) and a son Maceo Williams (b. October 2015). The couple filed for divorce in April 2017.[29] The divorce was finalized in October 2020.[30]\n\nFilmography [ edit ]\n\nKey Denotes works that have not yet been released\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nMusic videos [ edit ]\n\nVideo games [ edit ]\n\nStage [ edit ]\n\nTitle Year Role Notes Take Me Out 2022 Darren Lemming", "images": ["https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/3/37/Dagger-14-plain.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/6/61/Jesse_Williams_in_2008_white_shirt.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Jesse_Williams_in_2008_white_shirt.jpg/220px-Jesse_Williams_in_2008_white_shirt.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/6/61/Jesse_Williams_in_2008_white_shirt.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jesse_Williams_(actor)", "title": "Jesse Williams (actor)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/6/61/Jesse_Williams_in_2008_white_shirt.jpg", "width": 640, "height": 852}, "title": "Jesse Williams (actor) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}