{"url": "www.hollywoodreporter.com/features/jennifer-aniston-reveals-struggles-dyslexia-764854", "text": "This story first appeared in the Jan. 30 issue of The Hollywood Reporter magazine.\n\nJust last week, all around Hollywood the words “Jennifer Aniston” and “Oscar nomination” were being mentioned in the same breath. The Friends star had made a stunning switch to serious drama with Cake, a roughly $7 million indie release that opens Jan. 23; the movie had debuted at the Toronto Film Festival to terrific reviews for the actress, if not for the film itself; she had Harvey Weinstein‘s former awards consultant, Lisa Taback, on the case; and a nomination looked teed up and ready to go.\n\nThen on Thursday, Jan. 15, at 5:40 a.m., the rug was pulled out from under the movie. Hours after Aniston’s triumphant appearance at Cake‘s Los Angeles premiere, with a nomination from every other major voting body in Hollywood under her belt, a swirl of “SNUBBED!” headlines emerged when the best actress nominations were announced and they didn’t include the star. After Selma (which landed just two noms, for picture and song), the Aniston rebuke was the dominant entertainment story du jour.\n\n“I know a lot of people were sorry,” she says, speaking the day after the nominations. “I feel I’ve gotten such wonderful love — I had almost more phone calls and flowers than I did for any other nomination [in the past].”\n\nWhatever pain or anger she may have felt, whatever disappointment or sense of loss (and let’s not kid ourselves: Every Oscar snub feels acute to even the strongest person), Aniston never let on. She even joked about it a few days later on Ellen, calling herself “the number-one snubbed” (an honor that might perhaps belong to Selma director Ava DuVernay). She was exactly what millions of fans who have known her for two decades wanted her to be: funny and self-deprecating and exquisitely human.\n\nOther actresses might have induced a tsunami of schadenfreude. But Aniston’s enduring appeal is rooted in the very fact that she can be hurt, again and again — whether by the Oscars or the Sexiest Man Alive — and she’ll endure. She’s rich and glamorous and famous, but she’s also one of us: a real person with a beating heart.\n\n***\n\nWe sit in Aniston’s cavernous Bel Air living room, with the city spreading out through the floor-length windows. It is Jan. 8, a week before the nominations are to be announced, but right now other things are on her mind.\n\n“I’ve cried deeply,” she says. “I’ve felt immense loss in my life. Anybody who’s felt pain or loss that has sent you to your knees knows [what that’s like].”\n\nHer words catch me by surprise. We’re halfway through a two-hour interview, and the frothy, fizzy woman I thought I knew so well from Friends has shed her professional shell, revealing a more complex and perhaps vulnerable person inside.\n\nShe’s just slid off the long, gray sofa where she was sitting in her somewhat minimalist home and now is kneeling on the floor, one arm propped on a coffee table, in jeans and a T-shirt, looking remarkably young and well-toned. Her hair, the most scrutinized in modern media, is of course perfect; her rather artificial tan, less so — but then she’s fresh from a photo shoot and hasn’t had time to wipe it off.\n\nI hear a hint of regret, though she insists, “I feel very happy. Life is quite extraordinary.” The words “pain,” “anger” and “control” pop up throughout our conversation — and not just in relation to Cake, a heavy drama in which she plays a woman dealing with debilitating pain following a deadly car crash.\n\nPhotos by Ruven Afanador\n\nCake marks a transition for the star, who’s at a point in her life when transitions really matter. It would be wrong to say she’s having a midlife crisis; but it might be fair to say she’s experiencing a midlife contemplation, when questions about her life, and life itself, are paramount.\n\nAt 45 years old, sporting gold-rimmed, aviator-style glasses, Aniston is no longer the ingenue who became a household name at age 25. She has come to terms with a complicated relationship with her mother, has learned to moderate her urge to be always in control and has overcome issues about anger, specifically her longtime history of being “passive-aggressive.”\n\nHer life is enviable: She’s rich enough never to have to work again and has a strong partner in actor-writer Justin Theroux, 43, whom she plans to marry soon. And yet she’s still trying to figure out what it all really means, and as time hurtles by, that’s growing in importance.\n\n“Time moves really quickly these days, I don’t know why,” she says poignantly. “How many times did our parents say, ‘Stop wanting everything to rush’? You want summer to be over, you want Christmas to be over, you want this to be over, you want everything to be over just so you can get to the next thing. And boy, you really wish you’d listened to a lot of the things they said.”\n\nShe’s been through a lot, including her own bout with chronic pain from a pinched nerve in her neck, due to stress, that lasted months and sent her scurrying to specialists. “I saw this amazing doctor named Alison Tunney who changed my life with this thing called directional nonforce technique,” she says. “It’s like peeling an onion, like peeling years of injuries.”\n\nShe’s also had to deal with the premature death of a beloved therapist, a barrage of tabloid stories about her fecundity, or lack thereof; and some withering reviews for movies that may have been beneath her talents (The Bounty Hunter, Horrible Bosses 2).\n\nNot least of her woes is the public’s endless obsession with her split from Brad Pitt, even though it’s been a decade since their divorce. She’s been cast in the role of rejected wife, a Debbie Reynolds for the 2000s, eternally perceived as the victim, even if that’s far from how she sees it.\n\n“We’re not in daily communication,” she says. “But we wish nothing but wonderful things for each other. Nobody did anything wrong. You know what I mean? It was just like, sometimes things [happen].” She throws up her hands in exasperation. “If the world only could just stop with the stupid, soap-opera bullshit. There’s no story. I mean, at this point it’s starting to become — please, give more credit to these human beings.”\n\nDespite the divorce, she says she has no hesitation about getting married again and sports a huge diamond engagement ring given to her by Theroux, who lives with her in Bel Air, though no date has been set for the wedding. “We don’t have a date,” she says, then adds slyly, “I wouldn’t tell you if we did.”\n\nAs to kids: “Listen,” she continues, “that’s a topic that’s so exhausted. I get nervous around that, just because it’s very personal. Who knows if it’s going to happen? It’s been a want. We’re doing our best.”\n\n***\n\nAniston says she’s only now learning to deal with anger — discovering how to express it, rather than keeping it bottled up. “I always thought, if you’re angry you just don’t say anything,” she says. “I would come out passive, things would come out passively. But it doesn’t have to be black or white. You don’t have to be a hysterical human being and have veins popping out of your neck and turn bright red and terrify people — or else keep quiet and put your head in the sand. I used to loathe confrontation. Loathe it. It was absolute. I understood anger, but I didn’t know that you should express it. Which has been something that I’ve really tried to work on.”\n\nShe’s also tried to master her need for order. “I’m a control freak,” she admits. “I like to be in charge of everything. My life was so out of control growing up, it’s very important today for it to be in control.” Even now, she says, “I have to bite my tongue sometimes if I’m on a movie, when I think I can figure out how to make this problem that they’re having go smoothly. I just bite my tongue, especially with a [bad] director. Some directors are just like — oh, God, oh God, oh God! I [have to] just suffer through this.”\n\nYears of therapy have helped, though it took Aniston a long time to find someone to replace her favorite therapist, who died of a heart attack several years ago.\n\n“It was at a crazy time, right when we were going through our divorce and everything,” she recalls. “But I learned so much in the four years I worked with her, that when she did pass away I remember thinking, ‘Wow, everything that we talked about and discussed, it’s allowed me to be really peaceful about it all.’ I mean, there were human moments. But I was really shockingly OK.”\n\nEverything she did with her therapist, a Jungian who also borrowed from other schools of thought, centered on the fundamental issue of self-assertion, returning Aniston to the theme of anger. “Her whole thing with me was really saying, ‘You have to stand up for yourself in life.’ She was really trying to help me deal with anger and learning how to express it without feeling terrified that I was going to get murdered in response.”\n\nMeditation also has helped, she says, and recently she has been meditating a great deal. Mostly she practices at home rather than following any particular guru. “I’m on a really good personal strict regime,” she notes. “These days, I’ve been [doing it] every day. I have a little place at home, and I do it for about 20 minutes, at different times, usually right after a cup of coffee and before the chaos starts.” She’s found inspiration in the Dalai Lama, though they’ve never met. “But I’d love to meet him. From the things I’ve read about him, books and lectures, he seems like pure joy, pure, pure, pure enlightenment.”\n\nIf all this might seem a trifle New Age-y, that’s not the way Aniston comes across. In fact, she seems as self-aware as she is candid, a rather empathetic person struggling to define her life in the glare of a spotlight few of us will ever face.\n\nShe has few heroes she can cite, other than the Dalai Lama. “They’re all dead now,” she observes wistfully, before citing Laurence Olivier, who died in 1989: “Honestly, I was obsessed [with him] when I was a kid. I just remember being so enamored of him. I remember thinking, ‘Maybe someday, if I become an actress, I’ll be able to work with him.’ And I remember the day he died, crying my eyes out.”\n\nShe seems close to Theroux, who briefly interrupts our interview, dressed in a black leather motorbike jacket, and plants a kiss on her lips. The two met while Aniston was on vacation in Hawaii with her former co-star Courteney Cox and have now been together for four years.\n\n“It was his humor, mainly” that drew her to Theroux, she says. “He’s the easiest guy to hang around. He was so completely in his skin. It was the first time I remember being so comfortable [with a romantic interest], like with all my gay friends.”\n\nShe remains very friendly with Cox, with whom she just spent Christmas Eve, and she says she just saw another Friends co-star, Lisa Kudrow, the day before our interview.\n\nOther than these actresses’ shows, she says, she doesn’t watch much television anymore, and the TV she watches is rarely a sitcom. She likes NBC Nightly News With Brian Williams, and favorite programs include 60 Minutes, House of Cards, Breaking Bad and Veep.\n\n“And then there’s junk television,” she says, smiling, noting she’s hooked on The Bachelor. “I’ll say it out loud. Last year, [friends] were saying, ‘It’s The Bachelor, it’s premiering tonight! The Bachelor is premiering tonight!’ And I was like, ‘Oh, guys! Seriously? The Bachelor? That’s been on for 15 years or something.’ And Justin and I, just for fun, watched — and two hours later, we were addicted. It was like junk food. We were sad when it ended.”\n\nShe has a passion for art, and her living room displays paintings by Marc Chagall, Robert Motherwell and conceptual artist Glenn Ligon, the latter of which she bought at a fundraiser for Haiti organized by friend Ben Stiller. “I used to have an art studio and paint and work with clay, and I actually miss it,” she says. “I was moving storage facilities, and I just found my wheel and my easels and all my books. I found all this stuff, so I may build a little art studio off [the house].”\n\nShe doesn’t read much, the result of the dyslexia that impacted her education and self-image, which wasn’t diagnosed until she was in her early 20s.\n\n“The only reason I knew [that I had it] was because I went to get a prescription for glasses,” she recalls. “I had to wear these Buddy Holly glasses. One had a blue lens and one had a red lens. And I had to read a paragraph, and they gave me a quiz, gave me 10 questions based on what I’d just read, and I think I got three right. Then they put a computer on my eyes, showing where my eyes went when I read. My eyes would jump four words and go back two words, and I also had a little bit of a lazy eye, like a crossed eye, which they always have to correct in photos.”\n\nThe revelation that she had dyslexia was life-changing. Until then, “I thought I wasn’t smart. I just couldn’t retain anything,” she says. “Now I had this great discovery. I felt like all of my childhood trauma-dies, tragedies, dramas were explained.”\n\n***\n\nShe gets up and crosses the room to adjust an ottoman a notch. “Sorry, I had to move that,” she says.\n\nAniston grew up largely in New York, the daughter of two actors. (Her father, John, is a longtime star of Days of Our Lives.) Her life was shaken when her parents split, leaving the 9-year-old girl with her mother, Nancy Dow, while her elder brother, John, moved to Los Angeles.\n\nNow, she says regarding her mother, “We’re all fine,” but there were years when they didn’t speak. “She had a temper. I can’t tolerate that. If I get upset, I will discuss [things]. I will never scream and get hysterical like that. [But] I was never taught that I could scream. One time, I raised my voice to my mother, and I screamed at her, and she looked at me and burst out laughing. She was laughing at me [for] screaming back. And it was like a punch in my stomach.”\n\nShe pauses, and then adds: “She was critical. She was very critical of me. Because she was a model, she was gorgeous, stunning. I wasn’t. I never was. I honestly still don’t think of myself in that sort of light, which is fine. She was also very unforgiving. She would hold grudges that I just found so petty.”\n\nAniston herself claims to hold no grudges and is forgiving “probably to a fault. There are people in my life that are like, ‘How do you even talk to that guy?’ But what’s the point of holding on to [anger]? That’s so toxic. We’re human beings. Human beings make mistakes. Human beings are not perfect. And by not forgiving someone, it’s not allowing human beings to evolve and become better people.”\n\nIn her early years, she turned for support to her father’s mother, Stella. “She was a Greek grandmother who just loved me more than anything and was so fun to be around,” she says. “She had the best stories, she made me laugh. Beautiful, funny, gorgeous, hysterical — all the Greeks, all of my Greek family, were.” She spent a year visiting them as a small child, in Athens and Crete, and her grandmother’s death remains one of the most traumatic moments in her life. “I was around 21 years old, and it was the first time I’d had a loss. It was really sad. But then, like anything, you have to move on.”\n\nWhile she grew up Greek Orthodox and was “dunked in St. Sophia’s,” she says she has no strict religion: “I grew up really seeing a lot of negativity around religion. I actually had quite a beautiful upbringing with it, because it was never pounded down my throat, and I had the joy of going to church and experiencing ceremony and ritual and incense, and I thought it was quite beautiful. But other kids who were from Catholic families, or really strict Christian families — there was this ‘You’re going to hell’ sort of thing.”\n\nShe wasn’t a good student, she says, in large part because of the dyslexia. Though that didn’t improve her self-image, it did push her to develop her innate humor. She was funny at school, and people liked it. Her only passions there were an art class and a workshop where she tried out watercolor and charcoal and could carve creatures such as the wooden lions she still keeps — and, of course, drama.\n\nAfter acting at school, she got her first work off-Broadway in 1988, when she was still in her late teens. In her early 20s, she moved to Los Angeles and in her mid-20s landed Friends. “They wanted me to audition for [the part of] Monica, and I read the script and I didn’t want to do the Monica role,” she says. “I wanted to do Rachel.”\n\nThe role made her insanely rich and famous, and in its later years Aniston was paid an astronomical $1 million per episode. But all this is over now, part of another life long gone, and there are no plans for a reunion (though the residuals continue to roll in).\n\n“That’s completely past,” she says, with just a hint of nostalgia.\n\n***\n\nCake, for which Aniston received Golden Globe and SAG nominations, put an exclamation point on the present.\n\nIt was a commitment not just to a role but to work itself, showing that even this woman who has so much still seeks something more than money and fame.\n\n“As an accident victim whose nearly every move is excruciating,” wrote Sheri Linden in the Los Angeles Times, “Aniston lends the role an impressively agonized physicality and brings ace timing to the screenplay’s welcome gallows humor.”\n\nUntil the script came along, the actress had been planning to take it easy. “I’d been working for the past couple years,” she says, “and I was actually thinking: This year would be a nice year to take a break and maybe travel, or do something more on the producorial side, maybe even direct another series of short films.” (She directed an episode of Lifetime’s 2011 anthology Five.)\n\nBut then she fell in love with the material, which came to her through her managers, Aleen Keshishian and Zack Morgenroth. (She’s also repped by CAA’s Kevin Huvane.) To her surprise, the usual suspects of A-list drama stars turned it down, and now Aniston felt she had a chance. She auditioned for director Daniel Barnz, then urged him to give her the role, telling him she would “go to the moon” for him.\n\nDeep in her heart, she was convinced she could pull it off. But she also knew there would be many naysayers, and some of their negativity rubbed off. “I’ve been told so many times ‘You’re not that type’ that part of me went, ‘Am I not? Can I really [do this]?’ So it was like, ‘I’m going to prove it to myself.’ There was a confidence in knowing that I’m capable of doing this after so many years of being able to ‘show up.’ This was the first time I had so many layers to explore. I took out a tool bag I hadn’t used.”\n\nBarnz, who wrote Aniston an encouraging letter before they met, says he embraced her roots in comedy. “When I first heard that Jen was interested, I immediately thought of one of my favorite movies, Ordinary People, which featured a [dramatic] performance by an actress primarily known for comedy, Mary Tyler Moore,” he says. “I really wanted to find an actress who could bring out all of the warmth and humor of this woman.”\n\nAniston spoke to friends who had dealt with pain — and even a therapist who specializes in it, who told her that “people who use drugs with chronic pain, even if the pain has gone, the memory still holds on to it and doesn’t want to let go [of the solace from painkillers].”\n\nThe 25-day shoot in and around Los Angeles wasn’t easy, though Barnz and Aniston spent two months in intense conversations about the role before filming began. Aniston drew on her own memories of anguish. The emotions flooded out of her in a way she had never permitted onscreen.\n\nAt one point, she was paralyzed by fear. In a sequence where she submerges herself in a pool in an attempt to see what it would be like to commit suicide, a water phobia she has had all her life proved overpowering. “I have a terror of water,” she confesses. “It took forever. I kept going in, and I’d have the weirdest Pavlovian thing, and I’d turn around and go right back up. I was starting to cry. I was really having a lot of anxiety. I’m like, ‘Don’t cry! Don’t cry! Don’t cry!’ And the underwater camera guy came over and said, ‘Don’t do this. Don’t do this anymore.’ “\n\nDuring another scene, when the man responsible for the car accident that has left her in so much pain (played by William H. Macy) arrives at her door, Aniston was overwhelmed. “Seeing the face of that man, I just wanted to beat the shit out of him,” she says. “Thankfully, they gave me a stuntman to beat up, because I would have killed Bill. Really. This big guy said, ‘You can punch me as hard as you possibly can.’ And I remember seeing white and just beating him for take after take. And the next day, I woke up and couldn’t move. My body seized [up]. I was like, ‘What the f— did I do?’ “\n\n***\n\nWhat lies next is unclear. “In terms of my career, that’s the thing I’ve always let come to me,” she says. “I’ve never been strategic. I don’t have an agenda. I just go with my gut.”\n\nShe says she’s open to doing theater and even returning to series TV. She also would like to direct a film but hasn’t encountered the right vehicle. “I was trying to find a full-length feature, and that almost happened two years ago, and then an acting job arrived, so I couldn’t do it,” she says. “But I have to get that super-excited feeling, and I really promised myself that, unless I feel with all my heart, ‘Oh, I have to do this,’ then I just can’t. There’s too much to be home for.”\n\nHome, now, is the epicenter of her existence. In some ways, she’s a homebody who gets great joy from restoring houses, just as she has fixed up the house where we sit this late afternoon. That has much more appeal than uprooting herself for the sake of just another job. “When you’re younger and you’re off for three months, four months, doing a movie God-knows-where, it’s fine and it’s a fun experience,” she says. “But when you get to a place where you want to be home, and you have a partner, you have to be selective.”\n\nShe pauses to contemplate what she’s just said. One of her three rescue dogs, an old white shepherd, lopes in and comes up to her, licking her face. She shows him a warmth she rarely reveals to strangers.\n\nThe light is fading. The view from the windows is dark now. One of the two great doors that lead into Aniston’s fortress-like house opens, and her manager, Keshishian, enters with a colleague. It occurs to me that Aniston resembles this house, so protected on the outside, but with great vistas spreading out once one gets within.\n\nHer life is full to overflowing, but she’s still searching for the great big thing that will give it meaning as she enters its next phase. Perhaps it’s a role, perhaps something that has nothing to do with her craft.\n\n“There’s something bigger I’m interested in doing,” she says. “It could be more work, it could be more creativity, or getting more philanthropic in the world. It can look like a baby. It can look like a foundation. I know I have a bigger purpose. It’s a puzzle, and I haven’t quite put the puzzle together. But something greater is calling out to me.”", "images": ["http://www.hollywoodreporter.com/sites/default/files/custom/Kimberly/20150108_HR_JENNIFER_ANISTON_0756.jpg", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "http://www.hollywoodreporter.com/sites/default/files/custom/Meena/Issue_03_Cover_Aniston_Embed.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "http://www.hollywoodreporter.com/sites/default/files/custom/Kimberly/20150108_HR_JENNIFER_ANISTON_0024.jpg", "http://www.hollywoodreporter.com/sites/default/files/custom/Kimberly/crop20150108_HR_JENNIFER_ANISTON_0894.jpg", "https://www.hollywoodreporter.com/wp-content/uploads/2015/01/aniston_a.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2015/01/aniston_a.jpg?w=1024", "keywords": [], "authors": ["Stephen Galloway"], "canonical_link": "https://www.hollywoodreporter.com/news/general-news/jennifer-aniston-reveals-struggles-dyslexia-764854/", "title": "Jennifer Aniston Reveals Struggles With Dyslexia, Anger; Shrugs Off Oscar Snub", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "At home with The Hollywood Reporter, the 'Cake' star gives a very candid interview about everything from being a \"control freak\" to loving 'The Bachelor,' and even her relationships with Brad Pitt and Justin Theroux, as she enters a period of intense midlife contemplation (don't worry, it's not a crisis!): \"I know I have a bigger purpose.\"", "news_keywords": "60 Minutes, Ben Stiller, Brad Pitt, Breaking Bad, cake, Courteney Cox, Friends (TV), Golden Globes, Horrible Bosses 2, House of Cards", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Stephen Galloway", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 764854, "title": "Jennifer Aniston Reveals Struggles With Dyslexia, Anger; Shrugs Off Oscar Snub", "published_at": "2015-01-21 09:15:43", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2015/01/aniston_a.jpg?w=1024", "comment_count": 0, "tags": "William H. Macy", "topics": "News", "body": "This story first appeared in the Jan. 30 issue of The Hollywood Reporter magazine.\r\nJust last week, all around Hollywood the words \"Jennifer Aniston\" and \"Oscar nomination\" were being mentioned in the same breath. The Friends star had made a stunning switch to serious drama with Cake, a roughly $7 million indie release that opens Jan. 23; the movie had debuted at the Toronto Film Festival to terrific reviews for the actress, if not for the film itself; she had Harvey Weinstein's former awards consultant, Lisa Taback, on the case; and a nomination looked teed up and ready to go.\r\nThen on Thursday, Jan. 15, at 5:40 a.m., the rug was pulled out from under the movie. Hours after Aniston's triumphant appearance at Cake's Los Angeles premiere, with a nomination from every other major voting body in Hollywood under her belt, a swirl of \"SNUBBED!\" headlines emerged when the best actress nominations were announced and they didn't include the star. After Selma (which landed just two noms, for picture and song), the Aniston rebuke was the dominant entertainment story du jour.\r\n\"I know a lot of people were sorry,\" she says, speaking the day after the nominations. \"I feel I've gotten such wonderful love — I had almost more phone calls and flowers than I did for any other nomination [in the past].\"\r\nWhatever pain or anger she may have felt, whatever disappointment or sense of loss (and let's not kid ourselves: Every Oscar snub feels acute to even the strongest person), Aniston never let on. She even joked about it a few days later on Ellen, calling herself \"the number-one snubbed\" (an honor that might perhaps belong to Selma director Ava DuVernay). She was exactly what millions of fans who have known her for two decades wanted her to be: funny and self-deprecating and exquisitely human.\r\nOther actresses might have induced a tsunami of schadenfreude. But Aniston's enduring appeal is rooted in the very fact that she can be hurt, again and again — whether by the Oscars or the Sexiest Man Alive — and she'll endure. She's rich and glamorous and famous, but she's also one of us: a real person with a beating heart.\r\n***\r\nWe sit in Aniston's cavernous Bel Air living room, with the city spreading out through the floor-length windows. It is Jan. 8, a week before the nominations are to be announced, but right now other things are on her mind.\r\n\"I've cried deeply,\" she says. \"I've felt immense loss in my life. Anybody who's felt pain or loss that has sent you to your knees knows [what that's like].\"\r\nHer words catch me by surprise. We're halfway through a two-hour interview, and the frothy, fizzy woman I thought I knew so well from Friends has shed her professional shell, revealing a more complex and perhaps vulnerable person inside.\r\nShe's just slid off the long, gray sofa where she was sitting in her somewhat minimalist home and now is kneeling on the floor, one arm propped on a coffee table, in jeans and a T-shirt, looking remarkably young and well-toned. Her hair, the most scrutinized in modern media, is of course perfect; her rather artificial tan, less so — but then she's fresh from a photo shoot and hasn't had time to wipe it off.\r\nI hear a hint of regret, though she insists, \"I feel very happy. Life is quite extraordinary.\" The words \"pain,\" \"anger\" and \"control\" pop up throughout our conversation — and not just in relation to Cake, a heavy drama in which she plays a woman dealing with debilitating pain following a deadly car crash.\r\n\r\nPhotos by Ruven Afanador\r\nCake marks a transition for the star, who's at a point in her life when transitions really matter. It would be wrong to say she's having a midlife crisis; but it might be fair to say she's experiencing a midlife contemplation, when questions about her life, and life itself, are paramount.\r\nAt 45 years old, sporting gold-rimmed, aviator-style glasses, Aniston is no longer the ingenue who became a household name at age 25. She has come to terms with a complicated relationship with her mother, has learned to moderate her urge to be always in control and has overcome issues about anger, specifically her longtime history of being \"passive-aggressive.\"\r\nHer life is enviable: She's rich enough never to have to work again and has a strong partner in actor-writer Justin Theroux, 43, whom she plans to marry soon. And yet she's still trying to figure out what it all really means, and as time hurtles by, that's growing in importance.\r\n\"Time moves really quickly these days, I don't know why,\" she says poignantly. \"How many times did our parents say, 'Stop wanting everything to rush'? You want summer to be over, you want Christmas to be over, you want this to be over, you want everything to be over just so you can get to the next thing. And boy, you really wish you'd listened to a lot of the things they said.\"\r\nShe's been through a lot, including her own bout with chronic pain from a pinched nerve in her neck, due to stress, that lasted months and sent her scurrying to specialists. \"I saw this amazing doctor named Alison Tunney who changed my life with this thing called directional nonforce technique,\" she says. \"It's like peeling an onion, like peeling years of injuries.\"\r\nShe's also had to deal with the premature death of a beloved therapist, a barrage of tabloid stories about her fecundity, or lack thereof; and some withering reviews for movies that may have been beneath her talents (The Bounty Hunter, Horrible Bosses 2).\r\nNot least of her woes is the public's endless obsession with her split from Brad Pitt, even though it's been a decade since their divorce. She's been cast in the role of rejected wife, a Debbie Reynolds for the 2000s, eternally perceived as the victim, even if that's far from how she sees it.\r\n\"We're not in daily communication,\" she says. \"But we wish nothing but wonderful things for each other. Nobody did anything wrong. You know what I mean? It was just like, sometimes things [happen].\" She throws up her hands in exasperation. \"If the world only could just stop with the stupid, soap-opera bullshit. There's no story. I mean, at this point it's starting to become — please, give more credit to these human beings.\"\r\nDespite the divorce, she says she has no hesitation about getting married again and sports a huge diamond engagement ring given to her by Theroux, who lives with her in Bel Air, though no date has been set for the wedding. \"We don't have a date,\" she says, then adds slyly, \"I wouldn't tell you if we did.\"\r\nAs to kids: \"Listen,\" she continues, \"that's a topic that's so exhausted. I get nervous around that, just because it's very personal. Who knows if it's going to happen? It's been a want. We're doing our best.\"\r\n***\r\nAniston says she's only now learning to deal with anger — discovering how to express it, rather than keeping it bottled up. \"I always thought, if you're angry you just don't say anything,\" she says. \"I would come out passive, things would come out passively. But it doesn't have to be black or white. You don't have to be a hysterical human being and have veins popping out of your neck and turn bright red and terrify people — or else keep quiet and put your head in the sand. I used to loathe confrontation. Loathe it. It was absolute. I understood anger, but I didn't know that you should express it. Which has been something that I've really tried to work on.\"\r\nShe's also tried to master her need for order. \"I'm a control freak,\" she admits. \"I like to be in charge of everything. My life was so out of control growing up, it's very important today for it to be in control.\" Even now, she says, \"I have to bite my tongue sometimes if I'm on a movie, when I think I can figure out how to make this problem that they're having go smoothly. I just bite my tongue, especially with a [bad] director. Some directors are just like — oh, God, oh God, oh God! I [have to] just suffer through this.\"\r\nYears of therapy have helped, though it took Aniston a long time to find someone to replace her favorite therapist, who died of a heart attack several years ago.\r\n\"It was at a crazy time, right when we were going through our divorce and everything,\" she recalls. \"But I learned so much in the four years I worked with her, that when she did pass away I remember thinking, 'Wow, everything that we talked about and discussed, it's allowed me to be really peaceful about it all.' I mean, there were human moments. But I was really shockingly OK.\"\r\nEverything she did with her therapist, a Jungian who also borrowed from other schools of thought, centered on the fundamental issue of self-assertion, returning Aniston to the theme of anger. \"Her whole thing with me was really saying, 'You have to stand up for yourself in life.' She was really trying to help me deal with anger and learning how to express it without feeling terrified that I was going to get murdered in response.\"\r\nMeditation also has helped, she says, and recently she has been meditating a great deal. Mostly she practices at home rather than following any particular guru. \"I'm on a really good personal strict regime,\" she notes. \"These days, I've been [doing it] every day. I have a little place at home, and I do it for about 20 minutes, at different times, usually right after a cup of coffee and before the chaos starts.\" She's found inspiration in the Dalai Lama, though they've never met. \"But I'd love to meet him. From the things I've read about him, books and lectures, he seems like pure joy, pure, pure, pure enlightenment.\"\r\nIf all this might seem a trifle New Age-y, that's not the way Aniston comes across. In fact, she seems as self-aware as she is candid, a rather empathetic person struggling to define her life in the glare of a spotlight few of us will ever face.\r\nShe has few heroes she can cite, other than the Dalai Lama. \"They're all dead now,\" she observes wistfully, before citing Laurence Olivier, who died in 1989: \"Honestly, I was obsessed [with him] when I was a kid. I just remember being so enamored of him. I remember thinking, 'Maybe someday, if I become an actress, I'll be able to work with him.' And I remember the day he died, crying my eyes out.\"\r\nShe seems close to Theroux, who briefly interrupts our interview, dressed in a black leather motorbike jacket, and plants a kiss on her lips. The two met while Aniston was on vacation in Hawaii with her former co-star Courteney Cox and have now been together for four years.\r\n\"It was his humor, mainly\" that drew her to Theroux, she says. \"He's the easiest guy to hang around. He was so completely in his skin. It was the first time I remember being so comfortable [with a romantic interest], like with all my gay friends.\"\r\nShe remains very friendly with Cox, with whom she just spent Christmas Eve, and she says she just saw another Friends co-star, Lisa Kudrow, the day before our interview.\r\nOther than these actresses' shows, she says, she doesn't watch much television anymore, and the TV she watches is rarely a sitcom. She likes NBC Nightly News With Brian Williams, and favorite programs include 60 Minutes, House of Cards, Breaking Bad and Veep.\r\n\"And then there's junk television,\" she says, smiling, noting she's hooked on The Bachelor. \"I'll say it out loud. Last year, [friends] were saying, 'It's The Bachelor, it's premiering tonight! The Bachelor is premiering tonight!' And I was like, 'Oh, guys! Seriously? The Bachelor? That's been on for 15 years or something.' And Justin and I, just for fun, watched — and two hours later, we were addicted. It was like junk food. We were sad when it ended.\"\r\nShe has a passion for art, and her living room displays paintings by Marc Chagall, Robert Motherwell and conceptual artist Glenn Ligon, the latter of which she bought at a fundraiser for Haiti organized by friend Ben Stiller. \"I used to have an art studio and paint and work with clay, and I actually miss it,\" she says. \"I was moving storage facilities, and I just found my wheel and my easels and all my books. I found all this stuff, so I may build a little art studio off [the house].\"\r\nShe doesn't read much, the result of the dyslexia that impacted her education and self-image, which wasn't diagnosed until she was in her early 20s.\r\n\"The only reason I knew [that I had it] was because I went to get a prescription for glasses,\" she recalls. \"I had to wear these Buddy Holly glasses. One had a blue lens and one had a red lens. And I had to read a paragraph, and they gave me a quiz, gave me 10 questions based on what I'd just read, and I think I got three right. Then they put a computer on my eyes, showing where my eyes went when I read. My eyes would jump four words and go back two words, and I also had a little bit of a lazy eye, like a crossed eye, which they always have to correct in photos.\"\r\nThe revelation that she had dyslexia was life-changing. Until then, \"I thought I wasn't smart. I just couldn't retain anything,\" she says. \"Now I had this great discovery. I felt like all of my childhood trauma-dies, tragedies, dramas were explained.\"\r\n***\r\nShe gets up and crosses the room to adjust an ottoman a notch. \"Sorry, I had to move that,\" she says.\r\nAniston grew up largely in New York, the daughter of two actors. (Her father, John, is a longtime star of Days of Our Lives.) Her life was shaken when her parents split, leaving the 9-year-old girl with her mother, Nancy Dow, while her elder brother, John, moved to Los Angeles.\r\nNow, she says regarding her mother, \"We're all fine,\" but there were years when they didn't speak. \"She had a temper. I can't tolerate that. If I get upset, I will discuss [things]. I will never scream and get hysterical like that. [But] I was never taught that I could scream. One time, I raised my voice to my mother, and I screamed at her, and she looked at me and burst out laughing. She was laughing at me [for] screaming back. And it was like a punch in my stomach.\"\r\nShe pauses, and then adds: \"She was critical. She was very critical of me. Because she was a model, she was gorgeous, stunning. I wasn't. I never was. I honestly still don't think of myself in that sort of light, which is fine. She was also very unforgiving. She would hold grudges that I just found so petty.\"\r\nAniston herself claims to hold no grudges and is forgiving \"probably to a fault. There are people in my life that are like, 'How do you even talk to that guy?' But what's the point of holding on to [anger]? That's so toxic. We're human beings. Human beings make mistakes. Human beings are not perfect. And by not forgiving someone, it's not allowing human beings to evolve and become better people.\"\r\nIn her early years, she turned for support to her father's mother, Stella. \"She was a Greek grandmother who just loved me more than anything and was so fun to be around,\" she says. \"She had the best stories, she made me laugh. Beautiful, funny, gorgeous, hysterical — all the Greeks, all of my Greek family, were.\" She spent a year visiting them as a small child, in Athens and Crete, and her grandmother's death remains one of the most traumatic moments in her life. \"I was around 21 years old, and it was the first time I'd had a loss. It was really sad. But then, like anything, you have to move on.\"\r\nWhile she grew up Greek Orthodox and was \"dunked in St. Sophia's,\" she says she has no strict religion: \"I grew up really seeing a lot of negativity around religion. I actually had quite a beautiful upbringing with it, because it was never pounded down my throat, and I had the joy of going to church and experiencing ceremony and ritual and incense, and I thought it was quite beautiful. But other kids who were from Catholic families, or really strict Christian families — there was this 'You're going to hell' sort of thing.\"\r\nShe wasn't a good student, she says, in large part because of the dyslexia. Though that didn't improve her self-image, it did push her to develop her innate humor. She was funny at school, and people liked it. Her only passions there were an art class and a workshop where she tried out watercolor and charcoal and could carve creatures such as the wooden lions she still keeps — and, of course, drama.\r\n\r\nAfter acting at school, she got her first work off-Broadway in 1988, when she was still in her late teens. In her early 20s, she moved to Los Angeles and in her mid-20s landed Friends. \"They wanted me to audition for [the part of] Monica, and I read the script and I didn't want to do the Monica role,\" she says. \"I wanted to do Rachel.\"\r\nThe role made her insanely rich and famous, and in its later years Aniston was paid an astronomical $1 million per episode. But all this is over now, part of another life long gone, and there are no plans for a reunion (though the residuals continue to roll in).\r\n\"That's completely past,\" she says, with just a hint of nostalgia.\r\n***\r\nCake, for which Aniston received Golden Globe and SAG nominations, put an exclamation point on the present.\r\nIt was a commitment not just to a role but to work itself, showing that even this woman who has so much still seeks something more than money and fame.\r\n\"As an accident victim whose nearly every move is excruciating,\" wrote Sheri Linden in the Los Angeles Times, \"Aniston lends the role an impressively agonized physicality and brings ace timing to the screenplay's welcome gallows humor.\"\r\nUntil the script came along, the actress had been planning to take it easy. \"I'd been working for the past couple years,\" she says, \"and I was actually thinking: This year would be a nice year to take a break and maybe travel, or do something more on the producorial side, maybe even direct another series of short films.\" (She directed an episode of Lifetime's 2011 anthology Five.)\r\nBut then she fell in love with the material, which came to her through her managers, Aleen Keshishian and Zack Morgenroth. (She's also repped by CAA's Kevin Huvane.) To her surprise, the usual suspects of A-list drama stars turned it down, and now Aniston felt she had a chance. She auditioned for director Daniel Barnz, then urged him to give her the role, telling him she would \"go to the moon\" for him.\r\nDeep in her heart, she was convinced she could pull it off. But she also knew there would be many naysayers, and some of their negativity rubbed off. \"I've been told so many times 'You're not that type' that part of me went, 'Am I not? Can I really [do this]?' So it was like, 'I'm going to prove it to myself.' There was a confidence in knowing that I'm capable of doing this after so many years of being able to 'show up.' This was the first time I had so many layers to explore. I took out a tool bag I hadn't used.\"\r\nBarnz, who wrote Aniston an encouraging letter before they met, says he embraced her roots in comedy. \"When I first heard that Jen was interested, I immediately thought of one of my favorite movies, Ordinary People, which featured a [dramatic] performance by an actress primarily known for comedy, Mary Tyler Moore,\" he says. \"I really wanted to find an actress who could bring out all of the warmth and humor of this woman.\"\r\nAniston spoke to friends who had dealt with pain — and even a therapist who specializes in it, who told her that \"people who use drugs with chronic pain, even if the pain has gone, the memory still holds on to it and doesn't want to let go [of the solace from painkillers].\"\r\nThe 25-day shoot in and around Los Angeles wasn't easy, though Barnz and Aniston spent two months in intense conversations about the role before filming began. Aniston drew on her own memories of anguish. The emotions flooded out of her in a way she had never permitted onscreen.\r\nAt one point, she was paralyzed by fear. In a sequence where she submerges herself in a pool in an attempt to see what it would be like to commit suicide, a water phobia she has had all her life proved overpowering. \"I have a terror of water,\" she confesses. \"It took forever. I kept going in, and I'd have the weirdest Pavlovian thing, and I'd turn around and go right back up. I was starting to cry. I was really having a lot of anxiety. I'm like, 'Don't cry! Don't cry! Don't cry!' And the underwater camera guy came over and said, 'Don't do this. Don't do this anymore.' \"\r\nDuring another scene, when the man responsible for the car accident that has left her in so much pain (played by William H. Macy) arrives at her door, Aniston was overwhelmed. \"Seeing the face of that man, I just wanted to beat the shit out of him,\" she says. \"Thankfully, they gave me a stuntman to beat up, because I would have killed Bill. Really. This big guy said, 'You can punch me as hard as you possibly can.' And I remember seeing white and just beating him for take after take. And the next day, I woke up and couldn't move. My body seized [up]. I was like, 'What the f— did I do?' \"\r\n***\r\nWhat lies next is unclear. \"In terms of my career, that's the thing I've always let come to me,\" she says. \"I've never been strategic. I don't have an agenda. I just go with my gut.\"\r\nShe says she's open to doing theater and even returning to series TV. She also would like to direct a film but hasn't encountered the right vehicle. \"I was trying to find a full-length feature, and that almost happened two years ago, and then an acting job arrived, so I couldn't do it,\" she says. \"But I have to get that super-excited feeling, and I really promised myself that, unless I feel with all my heart, 'Oh, I have to do this,' then I just can't. There's too much to be home for.\"\r\nHome, now, is the epicenter of her existence. In some ways, she's a homebody who gets great joy from restoring houses, just as she has fixed up the house where we sit this late afternoon. That has much more appeal than uprooting herself for the sake of just another job. \"When you're younger and you're off for three months, four months, doing a movie God-knows-where, it's fine and it's a fun experience,\" she says. \"But when you get to a place where you want to be home, and you have a partner, you have to be selective.\"\r\nShe pauses to contemplate what she's just said. One of her three rescue dogs, an old white shepherd, lopes in and comes up to her, licking her face. She shows him a warmth she rarely reveals to strangers.\r\nThe light is fading. The view from the windows is dark now. One of the two great doors that lead into Aniston's fortress-like house opens, and her manager, Keshishian, enters with a colleague. It occurs to me that Aniston resembles this house, so protected on the outside, but with great vistas spreading out once one gets within.\r\nHer life is full to overflowing, but she's still searching for the great big thing that will give it meaning as she enters its next phase. Perhaps it's a role, perhaps something that has nothing to do with her craft.\r\n\"There's something bigger I'm interested in doing,\" she says. \"It could be more work, it could be more creativity, or getting more philanthropic in the world. It can look like a baby. It can look like a foundation. I know I have a bigger purpose. It's a puzzle, and I haven't quite put the puzzle together. But something greater is calling out to me.\"", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Jennifer Aniston Reveals Struggles With Dyslexia, Anger; Shrugs Off Oscar Snub", "url": "https://www.hollywoodreporter.com/news/general-news/jennifer-aniston-reveals-struggles-dyslexia-764854/", "description": "At home with The Hollywood Reporter, the ‘Cake’ star gives a very candid interview about everything from being a “control freak” to loving ‘The Bachelor,’ and ev…", "site_name": "The Hollywood Reporter", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2015/01/aniston_a.jpg?w=1024", "locale": "en_US"}, "article": {"published_time": "2015-01-21T09:15:43+00:00", "modified_time": "2016-09-20T09:56:49+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Jennifer Aniston Reveals Struggles With Dyslexia, Anger; Shrugs Off Oscar Snub", "description": "At home with The Hollywood Reporter, the ‘Cake’ star gives a very candid interview about everything from being a “control freak” to loving ‘The Bachelor,’ and ev…", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2015/01/aniston_a.jpg?w=3000"}}, "movies": [], "publish_date": 1421831743.0, "source": "http://www.hollywoodreporter.com", "summary": ""}