{"url": "https://www.bustle.com/articles/108020-are-chloe-lukasiak-maddie-ziegler-still-friends-the-dance-moms-stars-have-been-through-a", "text": "Maddie Ziegler has gone from a star on Lifetime's Dance Moms to a stand out in popular culture following her appearance in a few very popular Sia music videos. But she does have competitors in the dance world, one of whom is Chloe Lukasiak, a fellow Dance Moms star who was one of Maddie's best friends and her competition on the show. Now that 14-year-old Chloe is no longer at the Abbey Lee Dance Company, are Maddie Ziegler and Chloe Lukasiak still friends?\n\nSadly for Dance Moms fans, it doesn't seem that these two are super close at the moment. At the end of Season 4, Chloe and her mom, Christi, were involved in a huge blow-out with dance company head Abby Lee Miller, which led the Lukasiaks to leave the company and join Studio 19 Dance Complex, also in Pennsylvania. It sounds like Chloe was eager to leave the negativity behind and start fresh, because she shared in a YouTube video, \"My new studio is absolutely amazing. I think I've improved so much. Everyone is so nice and all the teachers are amazing and I love it there so much!\"\n\nAfter looking into the history of Chloe and Maddie's friendship, it seems like the competition side of their relationship was always there. Plus, think about it, these are tween girls and their feelings can change rather swiftly. I know, because I once was one.\n\nBack in April 2014, the two girls appeared on a Dance Moms reunion to talk about their relationship. When asked if they were more like friends or rivals, Chloe answered, \"We're best friends but sometimes it's kind of hard because we're always competing against each other.\" Maddie chimed in, \"One day we're best friends, the next day we have to focus and get in our zone.\" The girls went on to say that they've been best friends since they were four years old.\n\nA few months after this interview, Maddie spoke to In Touch and their friendship was brought up once again. She said, \"Chloe and I are still friends, we just don’t see each other as much when we aren’t filming. She does her own thing, she does [events] with her mom.\" The Season 5 premiere of Dance Moms in January was the first episode without Chloe, and Maddie said on the show:\n\nThe last time I talked to Chloe was before the nationals blowout. I just want to say that I miss her so much but I guess she hasn’t thought to text back... I feel like I’ve definitely lost a friend because, I mean, I’ve been dancing with her since I was 4 years old and it just doesn’t feel right without her.\n\nIn a \"throwback Tuesday\" Dance Moms special in July 2015, Maddie once again commented on her friendship with Chloe. She said, \"We haven’t really talked to each other and things have changed between us... It’s really sad because I obviously miss her.” In an interview with OK! Magazine, Chloe admitted that she keeps in touch with a few of her ex co-stars, but not Maddie. She also said of her and Maddie going up against each other as Choice Dancer at the 2015 Teen Choice Awards, “It’s not really different than anything else... I’ve always competed against her my whole life. She was probably my biggest rival in the competition world.” Soon after that interview, Chloe ended up winning the surfboard.\n\nWith all of Chloe's different projects besides dancing coming up soon and Maddie's continued success on and off the show, there will be plenty of room for the both girls to shine. And hey, maybe one day when their schedules chill out, they'll be back to being the BFFs they once were.\n\nImage: Giphy", "images": ["https://imgix.bustle.com/uploads/getty/2022/10/4/c7f5cf37-6219-4799-82b6-61516912f7e4-getty-1272975384.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/rehost/2016/9/13/e2e7f145-b911-4f80-801c-9c12949bfd24.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/rehost/2016/9/13/e2e7f145-b911-4f80-801c-9c12949bfd24.jpg?w=800&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2022/9/26/543b8343-7f10-4467-a946-cfa8a9aab526-80226b11-dd9d-4696-940d-dd0867d507e9-getty-1370976136.jpeg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/10/4/32527fa5-e87e-4a0a-9873-e44ba138b785-blingempire_season2_episode8_00_07_33_14rc.jpg?w=159&h=110&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.5&fp-y=0.2708", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2022/10/5/18a81ecc-5972-4e59-ac9c-5b93b6d92ebf-getty-1238712243.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress"], "top_img": "https://imgix.bustle.com/rehost/2016/9/13/e2e7f145-b911-4f80-801c-9c12949bfd24.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/articles/108020-are-chloe-lukasiak-maddie-ziegler-still-friends-the-dance-moms-stars-have-been-through-a", "title": "Are Chloe Lukasiak & Maddie Ziegler Still Friends? The 'Dance Moms' Stars Have Been Through A Lot", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image"}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/articles/108020-are-chloe-lukasiak-maddie-ziegler-still-friends-the-dance-moms-stars-have-been-through-a", "type": "article", "title": "Are Chloe Lukasiak & Maddie Ziegler Still Friends? The 'Dance Moms' Stars Have Been Through A Lot", "description": "Maddie Ziegler has gone from a star on Lifetime's Dance Moms to a stand out in popular culture following her appearance in a few very popular Sia music videos. But she does have competitors in the dance world, one of whom is Chloe Lukasiak, a fellow…", "image": {"identifier": "https://imgix.bustle.com/rehost/2016/9/13/e2e7f145-b911-4f80-801c-9c12949bfd24.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "Maddie Ziegler has gone from a star on Lifetime's Dance Moms to a stand out in popular culture following her appearance in a few very popular Sia music videos. But she does have competitors in the dance world, one of whom is Chloe Lukasiak, a fellow…"}, "movies": ["https://www.youtube.com/embed/Lgcx_zJFkSk", "https://www.youtube.com/embed/eO66mu5pMvs", "https://www.youtube.com/embed/oJpfSvw2XQA"], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}