{"url": "www.wonderwall.com/celebrity/new-romance-rumors-hit-caitlyn-jenner-and-sophie-hutchins-plus-more-news-3013833.gallery", "text": "Caitlyn Jenner takes rumored girlfriend to the GLAAD Awards The romance rumors that have swirled around Caitlyn Jenner, 68, and her 21-year-old college student pal, Sophie Hutchins, are intensifying this month after Cait brought Sophie as her date to the GLAAD Awards last week. Despite a recent denial — Caitlyn's rep has said Sophie is Caitlyn's \"love coach\" — In Touch reports the two have seemed pretty inseparable since their 2017 getaway to Mexico, Sophie frequently sharing photos taken from Cait's bed and referring to her friend's pup as her \"baby.\" Sophie, a finance student at Pepperdine, opened up about her decision to transition in her school paper in 2016. \"I've always had the question of, 'Do I want to transition from male to female?' I never thought a lot about doing it until I got into college because I was able to break away from my family and started to establish my own identity,\" Sophie wrote at the time. \"College gave me the time to deal with a lot of issues that had always been there.\" RELATED: Celebrity PDA of 2018\n\nFun fact: Beyonce's Coachella shorts are under $100 and relatively easy to find Good news, Beyhive! While most of the fashion Beyonce wore during her groundbreaking Coachella set was custom Balmain — created in a collaborative effort by Bey, Balmain designer Olivier Rousteing and stylist Marni Senofonte — most non-millionaire bees in the hive can probably afford (and find) Bey's cutoffs. According to THR, the shorts were Coal N Terry's $90 Ragged Blue Mad Cuttoff. They're even customizable, although, to be fair, telling a website how much fray you want on your jorts might be less thrilling than telling Balmain's Creative Director how much fringe you want on your sparking, knee-high Louboutin boots. RELATED: Beyonce's best looks\n\nKanye West is writing a philosophy book 'in real time' on Twitter Troll-worthy or not, Kim Kardashian West better get used seeing to her husband's deep thoughts on Twitter. It turns out Yeezy's writing a philosophy book \"in real time\" on the social media platform. Midway through a stream of posts similar to the \"sometimes you have to get rid of everything\" tweet Kim and Chrissy Teigen went to town on earlier this week, Kanye announced his stream-of-consciousness had a greater, literary purpose. \"When you first wake up don't hop right on the phone or the internet or even speak to anyone for even up to an hour if possible. Just be still and enjoy your own imagination. It's better than any movie,\" he offered on Wednesday, April 18. \"You have the best ideas. Other people's opinions are usually more distractive than informative. Follow your own vision. Base your actions on love. Do things you love and if you don't absolutely love something stop doing it as soon as you can,\" he continued. Eventually, he alerted his followers to his new project: \"Oh by the way this is my book that I'm writing in real time,\" Kanye tweeted. \"No publisher or publicist will tell me what to put where or how many pages to write. This is not a financial opportunity this is an innate need to be expressive.\" He went on to say he will \"work on this 'book' when I feel it\" before noting that he didn't like all of his own uses of \"I\" \"so I changes the I's to We's.\" (Except, um, he didn't.) Since then, the tweets have touched on the nature of original ideas, the importance of authenticity, whether enemies are real things and gems like \"truth is my goal. Controversy is my gym. I'll do a hundred reps of controversy for a 6 pack of truth,\" which he may or may not have lifted from an inspirational poster hanging in the locker of his local SoulCycle teacher. The jury's still out on how this book — which Kanye also alluded to in a March interview with THR, sharing that the working title is \"Break the Simulation\" — will go over with critics or the public. So far, a handful of reactions on social media suggest some may be skeptical. (Case in point: Kanye: \"Cars have four wheels. Hoodies have hoods. It's amusing to me when some one says this is an original hoodie. Bro… it's a hoodie.\" Dude on Twitter: \"Then why did you charge me $200 for a hoodie?\") The Washington Post, however, seemed optimistic about the rapper and designer's urge to \"contemplate the mysteries of time and space.\" The paper also cautioned that some of his tweets \"project the gravitas of a stoned 21-year-old holding court at a high school party.\" RELATED: Books becoming movies in 2018\n\nPrince's memoir to be released by the end of the year After months of delay, it seems the world may actually get a Prince memoir by the end of the year. According to Vulture, ICM Partners publishing agent Esther Newberg discussed the project on Variety's Strictly Business podcast this week, announcing that she expected the book to be available in time for the 2018 holiday shopping season. On the podcast, Esther said that Prince, who reportedly signed a deal with Random House's Spiegel & Grau imprint shortly before his death in April 2016, wrote 50 manuscript pages by hand, reproductions of which could be included in the book. The music legend reportedly told an audience at Avenue in New York City that he was working on the project with Dan Piepenbring of the Paris Review. \"It's going to be called 'The Beautiful Ones,'\" Prince said.\n\nTiffany Haddish has some more to say about that Alexander McQueen dress … \"And I might wear it again.\" So says a defiant Tiffany Haddish in the new issue of W when asked about that white Alexander McQueen dress she's now worn to multiple red carpet events. \"Here's the story of that dress,\" she explains. \"I hired a stylist for 'Girls Trip,' and she said, 'Girl, if you're trying to make it to the next level in your career, you're going to have to spend a little money.' I said, 'I'm down to look my best. Whatever it takes.'\" Then reality sunk in. \"I should've known,\" she says, \"… wasn't no price tag on that dress. So I wear it for 'Girls Trip,' and then they give me the receipt. When I saw the receipt, I cried. The dress was $4,122! So I'm wearing it multiple f—— times. I don't care what nobody say—that's a down payment on a car, that's a medical bill,\" Tiffany exclaims. \"So, even though everyone says I shouldn't wear the dress in public again, I'm wearing it.\" As the \"Girls Trip\" star has said previously in defense of her dress, \"I feel like I should be able to wear what I want, when I want, as many times as I want as long as I Febrezed it.\" Indeed.\n\nPink says she's the bad cop and Carey Hart is 'Mr. Fun' with their kids The \"Most Beautiful Woman in the World\" for 2018 has a different title when she's at home with her husband, Carey Hart, and their kids, Willow and Jameson — and it's a bit less flattering. \"My husband promised me that I wouldn't be bad cop, and he has failed me in that way,\" the singer jokes in her cover story for People's Beautiful issue. \"He's fun guy, Mr. Fun! And then I come in with the rules.\" At the end of the day, Pink says she's learned there's no rule book for being a mom. \"The thing about parenting is you never know if anything you're doing is working,\" she explains. \"That's been the most humbling thing for me. In my head, I sound amazing and then I turn around and [Willow's] eyes are completely glazed over.\" That doesn't seem to stop her from trying, though. Speaking to the Mirror last year, she said she's \"100 percent\" focused on being a mom. \"They are my everything,\" she said at the time. \"It's the two best decisions I ever made. Every decision I make is a choice because it affects my family. I do bake sales and lemonade stands. I take my kid to school and try to get there on time. I'm a … grown up now, it's so weird. [Inside] I'm still a 12-year-old boy.\"\n\nJesse Williams responds to girl who told her mom he was her prom date Jesse Williams is gorgeous, 36, the winner of a BET Humanitarian Award and a star on one of the longest-running shows on network television. But none of these things apparently registered with the mother of a high school Twitter user named Ella who convinced the aforementioned mom that Jesse was her prom date. In screenshots of a text conversation Ella posted this week (via UsWeekly), the teen's mom gets a photo of Jesse's face from her daughter. \"A picture of my prom date,\" Ella says in the thread. Her mom's first question? \"Is he smart??\" That's when Ella starts having some fun. \"Yeah, he's very smart. He's an activist and very woke. He likes history class so that's good and he likes Grey's Anatomy, too,\" Ella replies. She eventually shared pics of the texts on social media, captioning them, \"I don't know what's funnier…the fact that my mom actually thought that he was my prom date or the fact that she asked me if he was smart… 😂😂 @iJesseWilliams.\" Turns out that wasn't the end of it, though. At some point, Jesse himself noticed the post. \"Well done mom,\" he tweeted. \"Ask the right questions.\" From there, Ella and others tried to get Jesse to actually go to the prom with the jokester by using the hashtag, \"#JesseandEllaProm2k18 @iJesseWilliams.\" As of Thursday morning, he had yet to say \"yes.\"\n\nTina Turner makes rare red carpet appearance at 'Tina: The Tina Turner Musical' It's been five years since Tina Turner made a red-carpet appearance, but the rock icon looked comfortable and content as she and her husband, producer Erwin Bach, greeted fans and photographers on the red carpet for the opening night of a new production about her life on Wednesday, April 18. Starring Adrienne Warren, \"Tina: The Tina Turner Musical\" earned strong reviews after its debut at the Aldwych Theater in London's West End. The show got a thumbs-up from Tina, as well. \"Well first of all, it's difficult to see someone else do what we did for 40 years. I'm a perfectionist, so I look a little bit critically,\" the 78-year-old singer recently told the BBC (via E! News). \"But when I look and see it done so well, I feel proud. And I feel like I'm sending someone — sorry, I'm getting emotional—I'm really sending someone out that's going to do a good job and make me proud.\" Tina closed the curtain on her music career — and her U.S. citizenship — a few years ago around the same time she married Erwin, her longtime partner. The couple resides in Switzerland. Tina came out of retirement briefly to work with Adrienne and the producers on the show, which is slated to run through June 16.\n\nBill Murray opens a new 'Caddyshack' restaurant Bill Murray's \"Caddyshack\"-themed restaurant in Florida has spawned a sister establishment. Bill, along with his brothers, Joel, Johnny, Ed, Andy and Brian Murray, celebrating the opening of the new eatery, Caddyshack, in Rosemont, Illinois, outside Chicago on Tuesday, April 17. \"The fact that it is called 'Caddyshack' means it has something to do with golf — that feeling of casual fun, I think is what it is,\" Bill said at a press conference this week, according to the Chicago Tribune (via Page Six). The menu features items like \"crispy potato golf balls,\" a \"double bogey cheeseburger\" and \"Caddyshakes.\" The restaurant's tag line is equally fitting: \"eat, drink and be Murray.\"", "images": ["https://www.wonderwall.com/wp-content/uploads/sites/2/2018/04/1025804-1524161853.jpg?crop=0px,0px,462px,242px&resize=1200,630", "https://i0.wp.com/www.wonderwall.com/wp-content/uploads/sites/2/2018/04/1025804-1524161853.jpg?crop=0px%2C0px%2C462px%2C242px&resize=1200%2C630&ssl=1", "https://www.wonderwall.com/wp-content/uploads/sites/2/2020/04/whalerock-logo.svg", "https://www.wonderwall.com/wp-content/uploads/sites/2/2020/04/ww-logo.svg", "https://www.wonderwall.com/wp-content/uploads/sites/2/2022/10/wip-kate-hudson.jpg?h=800", "https://www.wonderwall.com/wp-content/themes/wonderwall/assets/images/download.png"], "top_img": "https://www.wonderwall.com/wp-content/uploads/sites/2/2018/04/1025804-1524161853.jpg?crop=0px,0px,462px,242px&resize=1200,630", "keywords": [], "authors": ["Wonderwall.Com Editors"], "canonical_link": "https://www.wonderwall.com/celebrity/new-romance-rumors-hit-caitlyn-jenner-and-sophie-hutchins-plus-more-news-3013833.gallery", "title": "More romance rumors hit Caitlyn Jenner and Sophie Hutchins", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Caitlyn Jenner and Sophie Hutchins face a new round of romance rumors. Plus, more celebrity news for April 19, 2018.", "og": {"locale": "en_US", "type": "article", "title": "More romance rumors hit Caitlyn Jenner and Sophie Hutchins", "description": "Caitlyn Jenner and Sophie Hutchins face a new round of romance rumors. Plus, more celebrity news for April 19, 2018.", "url": "https://www.wonderwall.com/celebrity/new-romance-rumors-hit-caitlyn-jenner-and-sophie-hutchins-plus-more-news-3013833.gallery", "site_name": "Wonderwall.com", "image": "https://i0.wp.com/www.wonderwall.com/wp-content/uploads/sites/2/2018/04/1025804-1524161853.jpg?crop=0px%2C0px%2C462px%2C242px&resize=1200%2C630&ssl=1"}, "article": {"publisher": "https://facebook.com/Wonderwall", "published_time": "2018-04-19T14:18:03+00:00", "modified_time": "2020-04-26T14:46:27+00:00"}, "twitter": {"card": "summary_large_image", "image": "https://www.wonderwall.com/wp-content/uploads/sites/2/2018/04/1025804-1524161853.jpg?crop=0px,0px,462px,242px&resize=1200,630", "creator": "@Wonderwall", "site": "@Wonderwall", "label1": "Written by", "data1": "Wonderwall.com Editors"}, "generator": "WordPress 6.0.2", "msapplication-TileImage": "https://www.wonderwall.com/wp-content/uploads/sites/2/2020/04/cropped-favicon-96x96-1-192x192-1.png?w=192"}, "movies": [], "publish_date": 1524147483.0, "source": "http://www.wonderwall.com", "summary": ""}