{"url": "http://fortune.com/2017/05/02/met-gala-2017-cost-to-attend/", "text": "The annual avant-garde meets mainstream event, colloquially known as the Met Gala, can cost thousands of dollars in jewels, clothes, and work hours — not that celebrity attendees have to pay for much of it.\n\nJust think of supermodel Gigi Hadid’s nails for the Manus x Machina-themed Costume Institute Gala in 2016 for a sliver of the price tag. Hadid wore a show-stopping Tommy Hilfiger creation, but what really got the social media engine pumping was her $2,000 artificial, chrome nails dotted with crystals on the underside.\n\nHere’s the catch — Hadid didn’t have to foot that bill.\n\nIt was Kiss Nail Products, the company that made the nails based on Hadid’s and her manicurist’s specifications that paid the $2,000 — crystals and all — according to a representative from Kiss on Tuesday (it was also Kiss that gave the original estimate for the nails in 2016).\n\nIt’s unclear who paid for her silvery Tommy Hilfiger outfit, a brand Hadid has a working relationship with and wore again at 2017 “Commes Des Garcons”-themed Met Gala.\n\nMoreover, while a gown by a designer can be worth around $35,610, it’s common practice for the designer to pay for the material and man hours, said Michael O’Connor, who has helped put jewelry on the likes of Eva Longoria and Amy Adams. For brands, its a great way to to get their name out there and associated with a well-liked face. For red carpet events, O’Connor says he’s approached certain designers on behalf of a celebrity, or certain celebrities on behalf of a designer about wearing a piece of jewelry.\n\nTickets for the event Monday, which was attended by roughly 550 people, cost about $30,000 this year according to the Metropolitan Museum of Art, or about $275,000 for a table.\n\nBoth are towering figures — the cost of an individual ticket is enough to put a family of four over the poverty line — but it’s again, not the celebrities who always eat the cost. According to the New York Times, at least some celebrities don’t have to buy the ticket, with brands often paying for the table.\n\nWhile rumors say A-list celebrities can be offered up to a million dollars to wear a designer’s jewelry, the artist performing at the Met Gala may also compensated for their appearance. Rihanna, who performed at the 2015 event for instance, was paid a figure at least in the thousands after some negotiating between her team and Vogue in “The First Monday in May,” a documentary about organizing the star-studded event. The actual figure was bleeped out.\n\n“We can’t lose her,” says Vogue’s head of special projects Sylvana Ward Durrett of Rihanna ahead of the 2015 Met Gala. “It’s about twice as much as any performer we’ve ever had.”\n\nThis year, the star on stage was Katy Perry — who can charge about $1.5 million for an appearance, said Robert Familetti of third party booking firm Platinum Rye Entertainment, although that figure can be different with Perry being a co-chair at this year’s Met Gala.\n\nNot that the Met can complain too much about the costs.\n\nIt likely needed the starry performance to pull in the $16.5 million it received this year. According to the New York Times, the financially challenged museum had to postpone a $600 million wing last month, with a deficit now approaching $40 million.", "images": ["https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1242585998-e1665028070836.jpg?w=256&q=75", "https://content.fortune.com/wp-content/uploads/2017/05/met.gif?resize=1200,600", "https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1243767517-e1665076497696.jpg?w=256&q=75", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1243581035-e1665068106964.jpg?w=256&q=75"], "top_img": "https://content.fortune.com/wp-content/uploads/2017/05/met.gif?resize=1200,600", "keywords": [], "authors": [], "canonical_link": "https://fortune.com/2017/05/02/met-gala-2017-cost-to-attend/", "title": "How Much It Costs for Celebrities to Attend the Met Gala", "meta_data": {"viewport": "width=device-width", "msapplication-TileColor": "#ffc40d", "theme-color": "#ffffff", "description": "A table at the gala costs a quarter of a million dollars.  But A-list celebs, such as Gigi Hadid, may not have to pay thanks to sponsorships", "keywords": "What was the met gala theme 2017, kendall jenner met gala 2017, met gala, met gala gig hadid, bella hadid met gala 2017, katy perry met gala 2017, katy perry, gigi hadid, met gala tickets, how much does met gala cost", "og": {"url": "https://fortune.com/2017/05/02/met-gala-2017-cost-to-attend/", "type": "article", "title": "How Much It Costs for Celebrities to Attend the Met Gala", "description": "Thanks to sponsorships, it may not cost them a cent", "site_name": "Fortune", "image": "https://content.fortune.com/wp-content/uploads/2017/05/met.gif?resize=1200,600", "width": 1024, "height": 683}, "twitter": {"card": "summary_large_image", "title": "How Much It Costs for Celebrities to Attend the Met Gala", "description": "Thanks to sponsorships, it may not cost them a cent", "image": "https://content.fortune.com/wp-content/uploads/2017/05/met.gif?resize=1200,600", "url": "https://fortune.com/2017/05/02/met-gala-2017-cost-to-attend/"}, "next-head-count": 32}, "movies": [], "publish_date": 1493679600.0, "source": "http://fortune.com", "summary": ""}