{"url": "https://deadline.com/2017/12/terry-crews-sues-agent-adam-venit-sexual-assault-ari-emanuel-adam-sandler-wme-1202220752/", "text": "A week after Adam Venit went back to work as an agent at WME, Terry Crews is taking the uber-agency and the former head of its Motion Picture Group to court for sexual assault and sexual battery. The nine-claim complaint also claims this isn’t the first time Venit has acted in such an inappropriate manner, and the company run by Ari Emanuel and Patrick Whitesell knows it.\n\n“It is now time to hold Venit accountable for his sexual predatory behavior and to hold WME accountable for its conduct in condoning, ratifying, and encouraging Venit’s sexual predatory behavior,” says the Brooklyn Nine-Nine star and ex-WME client in a complaint filed yesterday in Los Angeles Superior Court (read it here), stemming from Crews’ allegation that Venit grabbed Crews’ genitals at a party in February 2016. “Indeed, a message needs to be sent to those in power who abuses those over whom they can exert influence and control that abuse and sexual predatory behavior will not be tolerated.”\n\nRelated Story National Enquirer Editor Worked With Harvey Weinstein To Undermine Accusers: Report\n\n“Crews is informed and believes that Venit has a long history of bizarre behavior and has engaged in prior sexual predatory acts all of which WME was fully aware,” added the filing, which seeks unspecified but widespread damages. “Yet, WME did not take any action to deal with Venit’s misconduct and allowed him to prey on WME clients, like Crews.”\n\nWME did not respond to request for comment on the filing and the allegations in Crews’ complaint. After going public with the matter in early October on social media, Crews went to LAPD Hollywood division in early November to file a sexual assault report. He dropped WME as his agency the next day.\n\nWhile Crews has been vocal about the alleged assault for almost two months now, Monday’s court filing offers a much more vivid vision of what happened that night. “As soon as Crews saw Venit, he knew something was not right with him,” lawyers at L.A. firm Early Sullivan Wright Gizer & McRae LLP state. “Venit stared at Crews intently, like a rabid dog, sticking his tongue in and out of his mouth provocatively. This behavior was extremely concerning, especially considering that Crews had never met Venit before.”\n\nWith what is described as a “leer” in the complaint, the agent squeezed Crews’ genitals repeatedly even as the muscular ex-NFL player tried to push him away and get the attention of others at the event. “Adam, come get your boy! He’s grabbing my nuts!” the filing claims Crews yelled to nearby Venit client Adam Sandler, who “shook his head at Venit in disbelief as Venit just stood there giggling and smirking at Crews and his wife.”\n\nThe 23-page complaint said Sandler reached out to Crews later that evening in sympathy.\n\n“Notwithstanding Adam Sandler’s apology, Venit’s sexual assault had an immediate negative impact on Crews in addition to the actual pain it caused, ” the filing reads. “He also suffered from psychological issues as a result of the sexual assault and has stated that he has never felt more emasculated and objectified.”\n\nThe December 4 lawsuit comes after Venit apologized to Crews for the incident that night, after the actor laid out what happened on the phone to his own now former agent Brad Slater. It also follows WME boss Emanuel supposedly apologizing too in person last month, telling Crews that Venit couldn’t hurt his career because he lacked the power despite his prestige position at the uber-agency and repping the likes of Sandler, Dustin Hoffman, Sylvester Stallone and more.\n\n“As if realizing the ridiculousness of his comments, Emanuel then quickly changed the subject and described his plan to suspend Venit for thirty days without pay, loss of his title, and he would have to enter some sort of rehab or treatment for addiction,” the suit says of the Hollywood power player.\n\nThe document then says that the 6-foot-4, African-American Crews asked Emanuel if the law would have punished him if he “hurt” 5’7” Venit if he defended himself. “Emanuel agreed with Crews, but still would not punish Venit for Venit’s sexual assault on Crews,” the suit adds. After more conversation in which Crews compared Emanuel’s seemingly muted reaction to how he let loose on Mel Gibson for his 2011 anti-Semitic tirade, the exec said, “WME would do an internal investigation, and should WME find any other sexual assault, Venit would be terminated.”\n\nClearly that didn’t happened, and now the courtroom is the new arena for this.\n\nBTW – if you still shake your head and think what is a guy built like Crews so upset about, consider two things. One, the canvas of public use that African-American bodies have been reduced to time and time again in our society in the degradation of institutionalized racism. Two, imagine someone painfully squeeze your genitals over and over in public and acted like it was a big joke – seem funny or OK? Now, you see.\n\nWhile not addressing the lawsuit, Crews has been vocal today about the industry’s behind-the-scenes moves on social media:", "images": ["https://deadline.com/wp-content/uploads/2017/11/terry-crews-adam-venit-2-shot.jpg?w=628", "https://deadline.com/wp-content/uploads/2017/11/terry-crews-adam-venit-2-shot.jpg?w=628&h=383&crop=1", "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1"], "top_img": "https://deadline.com/wp-content/uploads/2017/11/terry-crews-adam-venit-2-shot.jpg?w=628", "keywords": [], "authors": ["Dominic Patten"], "canonical_link": "https://deadline.com/2017/12/terry-crews-sues-agent-adam-venit-sexual-assault-ari-emanuel-adam-sandler-wme-1202220752/", "title": "Terry Crews Sues WME & “Rabid Dog” Adam Venit For Sexual Assault", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "Almost 2-years after an alleged sexual assault by the WME agent at a H'wood party, Terry Crews is now taking Adam Venit &amp; the uber-agency to court", "news_keywords": "Adam Sandler, Adam Venit, Ari Emanuel, Harassment, Terry Crews, WME", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=533209613", "generator": "WordPress 6.0.2", "author": "Dominic Patten", "theme-color": "#fff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Deadline", "application-name": "Deadline", "content_type": "Article", "post_id": 1202220752, "title": "Terry Crews Sues WME & \"Rabid Dog\" Adam Venit For Sexual Assault", "published_at": "2017-12-05 16:18:43", "image": "https://deadline.com/wp-content/uploads/2017/11/terry-crews-adam-venit-2-shot.jpg?w=296&h=166&crop=1", "comment_count": 30, "tags": "WME", "topics": "TV", "body": "A week after Adam Venit went back to work as an agent at WME, Terry Crews is taking the uber-agency and the former head of its Motion Picture Group to court for sexual assault and sexual battery. The nine-claim complaint also claims this isn’t the first time Venit has acted in such an inappropriate manner, and the company run by Ari Emanuel and Patrick Whitesell knows it.\r\n\r\n“It is now time to hold Venit accountable for his sexual predatory behavior and to hold WME accountable for its conduct in condoning, ratifying, and encouraging Venit’s sexual predatory behavior,” says the Brooklyn Nine-Nine star and ex-WME client in a complaint filed yesterday in Los Angeles Superior Court (read it here), stemming from Crews' allegation that Venit grabbed Crews' genitals at a party in February 2016. “Indeed, a message needs to be sent to those in power who abuses those over whom they can exert influence and control that abuse and sexual predatory behavior will not be tolerated.”\r\n\r\n“Crews is informed and believes that Venit has a long history of bizarre behavior and has engaged in prior sexual predatory acts all of which WME was fully aware,” added the filing, which seeks unspecified but widespread damages. “Yet, WME did not take any action to deal with Venit’s misconduct and allowed him to prey on WME clients, like Crews.”\r\n\r\nWME did not respond to request for comment on the filing and the allegations in Crews’ complaint. After going public with the matter in early October on social media, Crews went to LAPD Hollywood division in early November to file a sexual assault report. He dropped WME as his agency the next day.\r\n\r\nWhile Crews has been vocal about the alleged assault for almost two months now, Monday's court filing offers a much more vivid vision of what happened that night. “As soon as Crews saw Venit, he knew something was not right with him,” lawyers at L.A. firm Early Sullivan Wright Gizer & McRae LLP state. “Venit stared at Crews intently, like a rabid dog, sticking his tongue in and out of his mouth provocatively. This behavior was extremely concerning, especially considering that Crews had never met Venit before.”\r\n\r\nWith what is described as a “leer” in the complaint, the agent squeezed Crews' genitals repeatedly even as the muscular ex-NFL player tried to push him away and get the attention of others at the event. “Adam, come get your boy! He’s grabbing my nuts!” the filing claims Crews yelled to nearby Venit client Adam Sandler, who “shook his head at Venit in disbelief as Venit just stood there giggling and smirking at Crews and his wife.”\r\n\r\nThe 23-page complaint said Sandler reached out to Crews later that evening in sympathy.\r\n\r\n“Notwithstanding Adam Sandler’s apology, Venit’s sexual assault had an immediate negative impact on Crews in addition to the actual pain it caused, \" the filing reads. \"He also suffered from psychological issues as a result of the sexual assault and has stated that he has never felt more emasculated and objectified.”\r\n\r\n\r\n\r\nThe December 4 lawsuit comes after Venit apologized to Crews for the incident that night, after the actor laid out what happened on the phone to his own now former agent Brad Slater. It also follows WME boss Emanuel supposedly apologizing too in person last month, telling Crews that Venit couldn’t hurt his career because he lacked the power despite his prestige position at the uber-agency and repping the likes of Sandler, Dustin Hoffman, Sylvester Stallone and more.\r\n\r\n\r\n\r\n“As if realizing the ridiculousness of his comments, Emanuel then quickly changed the subject and described his plan to suspend Venit for thirty days without pay, loss of his title, and he would have to enter some sort of rehab or treatment for addiction,” the suit says of the Hollywood power player.\r\n\r\nThe document then says that the 6-foot-4, African-American Crews asked Emanuel if the law would have punished him if he “hurt” 5’7” Venit if he defended himself. “Emanuel agreed with Crews, but still would not punish Venit for Venit’s sexual assault on Crews,” the suit adds. After more conversation in which Crews compared Emanuel’s seemingly muted reaction to how he let loose on Mel Gibson for his 2011 anti-Semitic tirade, the exec said, “WME would do an internal investigation, and should WME find any other sexual assault, Venit would be terminated.”\r\n\r\nClearly that didn’t happened, and now the courtroom is the new arena for this.\r\n\r\nBTW – if you still shake your head and think what is a guy built like Crews so upset about, consider two things. One, the canvas of public use that African-American bodies have been reduced to time and time again in our society in the degradation of institutionalized racism. Two, imagine someone painfully squeeze your genitals over and over in public and acted like it was a big joke - seem funny or OK? Now, you see.\r\n\r\nWhile not addressing the lawsuit, Crews has been vocal today about the industry's behind-the-scenes moves on social media:\r\n\r\nThe same guy who runs @radar_online and @NatEnquirer who threatened me with the false prostitute story 1 day after my @GMA interview now accused of SEXUAL MISCONDUCT.\r\nABUSERS PROTECT ABUSERS. https://t.co/7RMw26sz9w\r\n\r\n— terrycrews (@terrycrews) December 5, 2017", "fb": {"pages": 105558754896}, "onesignal": "wordpress-plugin", "fragment": "!", "og": {"type": "article", "title": "Terry Crews Sues WME & “Rabid Dog” Adam Venit For Sexual Assault", "url": "https://deadline.com/2017/12/terry-crews-sues-agent-adam-venit-sexual-assault-ari-emanuel-adam-sandler-wme-1202220752/", "description": "A week after Adam Venit went back to work as an agent at WME, Terry Crews is taking the uber-agency and the former head of its Motion Picture Group to court for sexual assault and sexual battery. T…", "site_name": "Deadline", "image": {"identifier": "https://deadline.com/wp-content/uploads/2017/11/terry-crews-adam-venit-2-shot.jpg?w=628", "width": 628, "height": 422}, "locale": "en_US"}, "article": {"published_time": "2017-12-06T00:18:43+00:00", "modified_time": "2019-09-06T22:24:05+00:00"}, "twitter": {"site": "@DEADLINE", "creator": "@DeadlineDominic", "card": "summary_large_image", "title": "Terry Crews Sues WME & “Rabid Dog” Adam Venit For Sexual Assault", "description": "Almost 2-years after an alleged sexual assault by the WME agent at a H'wood party, Terry Crews is now taking Adam Venit & the uber-agency to court", "image": "https://deadline.com/wp-content/uploads/2017/11/terry-crews-adam-venit-2-shot.jpg?w=628"}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1512519523.0, "source": "https://deadline.com", "summary": ""}