{"url": "https://web.archive.org/web/20181204005658/https://lionking.fandom.com/wiki/The_Lion_King", "text": "\n\n\n\n“ Set deep in the heart of Africa, The Lion King tells the story of the noble young Simba, who's destined to become king of the jungle. Only his ruthless uncle Scar stands between him and the throne. ―Film trailer[2] ”\n\nThe Lion King is a 1994 American animated feature film, produced by Walt Disney Feature Animation and released by Walt Disney Pictures. It is the 32nd animated feature in the Walt Disney Animated Classics, as well as the highest-grossing traditionally-animated film of all-time in North America. The film focuses on a lion cub in Africa named Simba, who learns to find his place in the great Circle of Life while struggling to become the rightful king of Pride Rock.\n\nThe story, which was influenced by the Bible stories of Joseph and Moses, and the William Shakespeare play Hamlet, takes place in a kingdom of anthropomorphic animals in Africa.[3] The film was the highest-grossing animated film of all time until the release of Finding Nemo (a Disney/Pixar computer-animated film). The Lion King still holds the record as the highest-grossing traditionally animated film in history[4] and belongs to an era known as the Disney Renaissance.[5]\n\nThe Lion King is the highest-grossing 2D animated film of all time in the United States,[6] and received positive reviews from critics, who praised the film for its music and story. During its release in 1994, the film grossed more than $774 million worldwide,[7] becoming the most successful film released that year, and it is currently the 19th highest-grossing feature film of all time.\n\nThe Lion King garnered two Academy Awards for its achievement in music and the Golden Globe Award for Best Motion Picture - Musical or Comedy. Songs were written by composer Elton John and lyricist Tim Rice, with an original score by Hans Zimmer.[8] Disney later produced two related movies: a sequel, The Lion King II: Simba's Pride; and a part prequel-part parallel, The Lion King 1½, as well as two spin-off television series': The Lion King's Timon & Pumbaa; and The Lion Guard.\n\nA Broadway adaptation of the film opened in 1997 and won six Tony Awards, including one for Best Musical.\n\nContents show]\n\nPlot\n\nA large number of animals gather around Pride Rock in Africa witnessing the arrival of King Mufasa and Queen Sarabi's newborn cub Simba. The king's brother Scar is displeased with the birth of Simba, the future king.\n\nAs a young cub, Mufasa teaches Simba about being king. While touring Pride Rock, Simba asks about a shadowy place, and Mufasa tells him it is forbidden. The lesson is stopped when Zazu, the king's majordomo hornbill adviser, informs him that hyenas have entered the Pride Lands. Mufasa tells Zazu to take Simba home while he gets rid of the hyenas.\n\nLater that day, Scar tells Simba that the shadowy place is in fact an elephant graveyard. Simba's curiosity is piqued, and he convinces his best friend Nala, a lioness cub, to come with him. Sarabi sends Zazu to keep an eye on the two cubs, but they soon leave him behind.\n\nThey finally reach the elephant graveyard, where they come upon three spotted hyenas, Shenzi, Banzai and Ed. The hyenas chase after the cubs, but Mufasa rescues them. Mufasa sends Nala and Zazu back to Pride Rock, and admonishes Simba before teaching him about the stars. Simba learns that these stars represent the great kings of the past who will always be there to guide him, including his father.\n\nMeanwhile, Scar plots with the hyenas to take over Pride Rock by killing both Mufasa and Simba. On Scar's orders, the hyenas cause a stampede by chasing a herd of wildebeest into a gorge where Scar tells Simba to wait. Mufasa learns of Simba's predicament and braves the wildebeests by leaping into the gorge and carrying Simba to safety.\n\nHowever, as Mufasa attempts to flee by climbing the gorge's walls, he is stuck and ask his younger brother for help, but Scar grabs Mufasa's paws and says, \"Long live the king.\" He then lets go of his brother, causing him to fall back into the stampede. When Simba sees his father falling, he, unaware of Scar's actions, is completely horrified and then goes back into the gorge to find him once the stampede has past. The cub yells for his father and spots him lying on the ground. He tries to wake Mufasa up, but soon realizes that his father is dead.\n\nScar, meanwhile seeing his nephew still alive, approaches him and tricks Simba into thinking that Mufasa's death resulted from the cub's carelessness. Ashamed, Simba flees the Pride Lands, intending to never return. Scar then orders the hyenas to kill Simba, but he manages to escape through a pack of thorn bushes. The hyenas then yell to him that if he ever returns, they'll kill him.\n\nLater in the night, Scar returns to Pride Rock and breaking the terrible news of Mufasa and Simba's death. In Simba's absence, Scar steps forward announcing Mufasa and Simba's death to the pride, and becomes the new king.\n\nSimba collapses in the wasteland after his escape, but is found by Timon and Pumbaa, a meerkat and warthog. The duo nurse him back to health and take him in, teaching him their motto, \"Hakuna Matata\" (interpreted as \"No Worries\"). He then grows up with them.\n\nDuring Scar's reign, the Pride Lands becomes a wasteland. Rafiki, the baboon who baptized Simba, finds out that Simba is alive in the jungle.\n\nOne day, Timon and Pumbaa are walking through the jungle singing \"The Lion Sleeps Tonight\". Pumbaa notices a dung beetle walking by and stalks it in preparation to eat it, but sees a lioness stalking him in the grass and runs for his life.\n\nWhen Timon finds Pumbaa, he asks whats wrongs and sees the lioness chasing him. Simba rescues Timon and Pumbaa just in time from the lioness and discovers that she is Nala. Simba learns from Nala that Scar's irresponsibility as the Great King of Pride Rock is leading to the suffering of its inhabitants. Still feeling guilt over Mufasa's death, Simba refuses to return.\n\nThe wise Rafiki tracks Simba down and summons Mufasa's ghost for Simba. His ghost informs Simba that he must return to Pride Rock and become king; Simba refuses, but Mufasa's ghost tells him to remember that he is his son and the one true king.\n\nSimba returns to Pride Rock with Nala, Timon, and Pumbaa, who all agree to help him fight. While Timon and Pumbaa distract the hyenas, Simba confronts Scar on Pride Rock. Scar forces Simba towards the edge of Pride Rock to kill him, informing him that he killed King Mufasa. Enraged at this realization, Simba leaps back up and pins Scar, forcing his uncle to reveal the truth to the rest of the pride.\n\nA fight ensues with the lionesses, Timon, Pumbaa, Rafiki and Zazu against the hyenas while Simba confronts Scar alone at the top of Pride Rock. Scar begs Simba for mercy, accusing the hyenas of planning Mufasa's death. Despite Simba sparing Scar, the lions fight, resulting in Simba throwing Scar off the cliff. Scar survives the fall, but is attacked and killed by the hyenas, who overheard his attempt to betray them.\n\nWith Scar and the hyenas gone with the flames, Simba is greeted by Nala, the pride, Timon, Pumbaa, Zazu, and Rafiki. Simba walks up Pride Rock and heard Mufasa's ghost appears in the clouds, then Simba roars in which all the lionesses join. Sometime later, Pride Rock is restored to its former glory and Simba looks down happily at his kingdom with Nala, Timon, and Pumbaa by his side; Rafiki presents Simba and Nala's newborn cub to the inhabitants of the Pride Lands.\n\nCharacters\n\nProduction\n\nStory development\n\nAlso see: Original Concepts and Documentations.\n\nThe idea for The Lion King started in late 1988 during a conversation between Jeffrey Katzenberg, Roy E. Disney, and Peter Schneider on a plane to Europe to promote the film Oliver and Company. During the conversation, the topic of a story set in Africa came up, and Katzenberg immediately jumped at the idea.[9] Katzenberg also decided to add elements involving coming of age and death, and ideas from his personal life experiences, such as some of his trials in his bumpy road in politics, saying about the film, \"It is a little bit about myself.\"[10] In November of that same year, the original treatment, inspired by Hamlet, was written by Thomas Disch (author of The Brave Little Toaster), as \"King of the Kalahari\" in late 1988. Since his treatment was written as work-for-hire, Disch didn't received credit or royalties.[11] The following year, Beauty and the Beast screenwriter Linda Woolverton did the first draft of the script, which was entitled King of the Beasts and then King of the Jungle.\n\nHowever, the plot was centered in a battle being between lions and baboons with Scar being the leader of the baboons, Rafiki being a cheetah.[10] Oliver and Company director George Scribner was the initial director of the film,[12] alongside Roger Allers who joined the project as its initial director in October 1991.[13] After the 6 months of story development work, Scribner resigned from his post as director, as he clashed with Allers with his intention of making a documentary-like film more focused on natural aspects, and also disagreed on turning the film into a musical. Allers was joined by a co-director, Rob Minkoff and Beauty and the Beast producer and directors Don Hahn, and Kirk Wise and Gary Trousdale in two days' worth of meetings to retool the story, revising the lead character of Simba and rewriting the second half of the film.[13]\n\nDuring the summer of 1992, the production team included screenwriter Irene Mecchi, along with another screenwriter, Jonathan Roberts, joining a few months later. Mecchi and Roberts took charge of the story revision process, fixing unresolved emotional issues in the script and adding comic business for Pumbaa, Timon, and the hyenas.[13]\n\nAnimation\n\nThirteen supervising animators, both in California and Florida, were responsible for establishing the personalities and setting the tone for the film's main characters. The animation leads for the main characters included Mark Henn on young Simba, Ruben A. Aquino on young adult Simba, Andreas Deja on Scar, Aaron Blaise on young Nala, Anthony DeRosa on young adult Nala, and Tony Fucile on Mufasa [13] Nearly 20 minutes of the film, including the \"I Just Can't Wait to Be King\" sequence, were animated at the Disney-MGM Studios facility.[13] Ultimately, more than 600 artists, animators and technicians contributed to The Lion King over the course of its production schedule.[13]\n\nThe character animators studied real-life animals for animation reference, as was done for the 1942 Disney film, Bambi.[15] Jim Fowler, a renowned wildlife expert, visited the studios on several occasions with an assortment of lions and other jungle inhabitants to discuss behavior and help the animators give their drawings an authentic feel.[13] During pre-production in 1991, several of the lead crew members, including the directors, producer, story supervisor Brenda Chapman, and production designer Chris Sanders, took a trip to Hell's Gate National Park in Kenya, in order to study and gain an appreciation of the environment for the film. The Pride Lands are modeled on the national park.[13]\n\nThe use of computers helped the filmmakers present their vision in new ways. The most notable use of computer animation is in the \"wildebeest stampede\" sequence. Several distinct wildebeest characters were created in a 3D computer program, multiplied into hundreds, cel shaded to look like drawn animation, and given randomized paths down a mountainside to simulate the real, unpredictable movement of a herd. [16] Five specially trained animators and technicians spent more than two years creating the two-and-a-half minute stampede sequence.[13]\n\nDuring production of The Lion King, most of the Disney Feature Animation staff and studio head Jeffrey Katzenberg felt The Lion King was a less important project than Pocahontas which was in production at the studio at the same time. Most of the staff preferred to work on Pocahontas, believing it would be the more prestigious and successful of the two. The enthusiastic audience reception to The Lion King trailer, which consisted solely of the opening sequence with the song \"Circle of Life\", suggested that the film would be very successful. Though both films were commercial successes, The Lion King received more critical acclaim and earned box office grosses than Pocahontas.[17][18][19]\n\nMusic\n\nLyricist Tim Rice, who was working with composer Alan Menken on songs for Aladdin, was invited to write the songs, and accepted on the condition of finding a composing partner. As Menken was unavailable, the producers accepted Rice's suggestion of Elton John,[13] after Rice's invitation of ABBA fell through due to Benny Andersson being busy with the musical, Kristina från Duvemåla.[10] John expressed an interest of writing \"ultra-pop songs that kids would like; then adults can go and see those movies and get just as much pleasure out of them\", mentioning a possible influence of The Jungle Book, where he felt the \"music was so funny and appealed to kids and adults\".[20]\n\nTogether, Elton John and Tim Rice wrote five original songs for this film, with Elton John performing \"Can You Feel the Love Tonight\" during the end credits in The Lion King. The film's score was composed by Hans Zimmer and supplemented with traditional African music and choir elements arranged by Lebo M.\n\nSongs\n\nThese are the musical numbers of the film, listed in order of appearance.\n\nAdditionally, a song which was not present in the original theatrical film, was later added to the IMAX theater and Platinum Edition releases:\n\n\"The Morning Report\", a song originally not in the film (it was created for the live musical version), was added with an accompanying animated sequence in the 2003 Platinum Edition home video release. Sung by Zazu, Mufasa and young Simba, the song is an extension of the scene in the original 1994 film where Zazu delivers a morning report to Mufasa, and later gets pounced on by Simba. (This song was removed for the 3-D or Diamond Edition releases)\n\nOther songs\n\nThe following songs that are sung in the film, but are not included on the soundtrack :\n\nSung by Zazu during his captivity:\n\nSung by Timon and Pumbaa:\n\n\"The Lion Sleeps Tonight\" - Written by Solomon Linda, Hugo Peretti, Luigi Creatore, George David Weiss, and Albert Stanton\n\n\"Hawaiian War Chant (Tahuwa-Huwai)\" - Melody originally written by Prince Leleiohoku II\n\nSoundtrack and other albums\n\nThe film's original motion picture soundtrack was released on July 13, 1994.\n\nOn February 28, 1995, Disney released an album entitled Rhythm of the Pride Lands, a sequel to the original soundtrack which featured songs and performances inspired by, but not featured in, the film. Most of the tracks were composed by African composer Lebo M and focused primarily on the African influences of the film's original music, with most songs being sung either partially or entirely in various African languages. Several songs featured in the album would later have incarnations in other The Lion King-oriented projects, such as the stage musical and the direct-to-video sequels. Some examples being \"Lea Halalela\" used as the song for \"Shadowland\" in the Broadway musical; and a reincarnation of \"Warthog Rhapsody\", called \"That's All I Need\", in The Lion King 1½. Rhythm of the Pride Lands was initially printed in a very limited quantity. However, it was re-released in 2003 and included in some international versions of the film's special edition soundtrack with an additional track, \"The Morning Report\".\n\nRelease\n\nBox office\n\nAs of July 2012, The Lion King has earned $422,783,777 in North America, and an estimated $528,800,000 in other foreign territories for a worldwide total of $951,583,777.[1] It is the second highest-grossing animated film of all time worldwide and the highest-grossing film of Walt Disney Animation Studios. It is also the highest-grossing motion picture of 1994 worldwide.[21] The Lion King held the record for the highest-grossing animated feature film (in North America, overseas and worldwide) until 2003 when it was surpassed by the computer animated Finding Nemo, which the The Lion King later surpassed in 2011. As of 2011, it remains the highest-grossing hand-drawn animated feature film[22] and the biggest animated movie of the last 50 years in terms of estimated attendance.[23]\n\nNorth America\n\nThe Lion King had a limited release in North America on June 15, 1994 and then a wide release on June 24, 1994.[1] During the weekend June 17–19, it was playing in only two theaters from which it earned $1,586,753 for a per theater average of $793,377. This is the largest per theater average ever achieved during a weekend.[24] By the end of its theatrical run, in spring 1995, it had earned $312,855,561,[1] being the second-highest-grossing 1994 film in North America behind Forrest Gump.[25] The worldwide total was $772.6 million, placing it as the highest-grossing film of the year.[7]\n\nThe film was re-released on December 25, 2002 for the IMAX re-release and large-format theaters (from which it earned $15,686,215) and re-released on September 16, 2011 for the 3D re-release (from which it earned $94,242,001),[26] bringing the film's domestic total to $422,739,465.[1] It is the third highest-grossing animated feature of all time in North America[27] and the 12th highest-grossing film in North America overall.[28]\n\n3D release\n\nDuring the first week of its 3D release, The Lion King grossed an estimated $29.3 million beating all the new releases, which was far beyond its expected $15 million take.[29] It also became the first film reach the #1 spot at the box-office during a re-release since Star Wars: Episode VI - Return of the Jedi back in March 1997.[30] During the second weekend, the film managed to remain #1 at the box office with a 27% decline to $21.9 million.[31] Due to the unprecedented success, Disney plans to leave it in theaters longer than the two-week run the studio initially planned, said Dave Hollis, Disney's head of distribution, though it has not been decided how long or how widely the film would play theatrically after the Blu-ray release after October 2011.[32]\n\nCritical reviews\n\nThe Lion King garnered critical acclaim and at Rotten Tomatoes, based on 96 reviews collected, the film has an overall approval rating of 90%, with a weighted average score of 8.2/10.[18] Among Rotten Tomatoes' Cream of the Crop, which consists of popular and notable critics from the top newspapers, websites, television and radio programs,[33] the film holds an overall approval rating of 94%.[34] By comparison, Metacritic, which assigns a Standard score 0-100 rating to reviews from mainstream critics, calculated an average score of 83 from the 14 reviews it collected.[35]\n\nChicago Sun-Times film critic Roger Ebert called the film \"a superbly drawn animated feature\" and, in his print review wrote, \"The saga of Simba, which in its deeply buried origins owes something to Greek tragedy and certainly to Hamlet, is a learning experience as well as an entertainment.\"[36] However, on the television program At the Movies the film was praised but received a mixed reaction when compared to previous Disney films. Gene Siskel and Roger Ebert both gave the film a \"Thumbs Up\" but Siskel said that it was not as good as earlier films such as Beauty and the Beast and was \"a good film, not a great one\".[37] Hal Hinson of The Washington Post called it \"an impressive, almost daunting achievement\" and felt that the film was \"spectacular in a manner that has nearly become commonplace with Disney's feature-length animations\", but was less enthusiastic toward the end of his review saying, \"Shakespearean in tone, epic in scope, it seems more appropriate for grown-ups than for kids. If truth be told, even for adults it is downright strange.\"[38] Owen Gleiberman, film critic for Entertainment Weekly, praised the film and wrote that it \"has the resonance to stand not just as a terrific cartoon but as an emotionally pungent movie\".[39] Rolling Stone]] film critic Peter Travers praised the film and felt that it was \"a hugely entertaining blend of music, fun and eye-popping thrills, though it doesn't lack for heart\".[40]\n\nThe staff of TV Guide wrote that \"The film has some of Disney's most spectacular animation yet—particularly in the wildebeest stampede—and strong vocal performances, especially by skilled Broadway comedian Nathan Lane. However, it suffers from a curiously undeveloped story line.\"[41] James Berardinelli, film critic for ReelViews, praised the film saying, \"With each new animated release, Disney seems to be expanding its already-broad horizons a little more. The Lion King is the most mature (in more than one sense) of these films, and there clearly has been a conscious effort to please adults as much as children. Happily, for those of us who generally stay far away from 'cartoons', they have succeeded.\"[42] In June 2008, the American Film Institute revealed its \"10 Top 10\"—the best ten films in ten \"classic\" American film genres—after polling over 1,500 people from the creative community. The Lion King was acknowledged as the fourth best film in the animation genre.[43]\n\nAwards and nominations\n\nThe Lion King received many award nominations, including the Academy Award for Best Original Score (by Hans Zimmer) and the Golden Globe award for Best Motion Picture – Musical or Comedy, both of which it won. Most notably, the song \"Can You Feel the Love Tonight\" by Elton John and Tim Rice won the Academy Award for Best Original Song, the Golden Globe for Best Original Song, the BMI Film Music Award, and the Grammy Award for Best Vocal Performance Male.\n\nThe awards were as follows:\n\nAcademy Awards [44] Best Original Score (Won) Best Original Song for \"Can You Feel the Love Tonight\" (Won) Best Original Song for \"Circle of Life\" (Nominated) Best Original Song for \"Hakuna Matata\" (Nominated)\n\nGolden Globe Awards [45] Best Motion Picture - Musical or Comedy (Won) Best Original Score (Won) Best Original Song for \"Can You Feel the Love Tonight\" (Won) Best Original Song for \"Circle of Life\" (Nominated)\n\nAnnie Awards [46] Best Animated Feature (Won) Best Achievement for Voice Acting to Jeremy Irons for voicing Scar (Won) Best Individual Achievement for Story Contribution in the Field of Animation (Won) Best Individual Achievement for Artistic Excellence in the Field of Animation (Nominated, lost to The Nightmare Before Christmas .)\n\nSaturn Awards [47] [48] Best Fantasy Film (Nominated, lost to Forrest Gump .) Best Performance by a Younger Actor to Jonathan Taylor Thomas for voicing young Simba (Nominated, lost to Kirsten Dunst for Interview with the Vampire: The Vampire Chronicles .) Best DVD Classic Film Release in 2004 (Nominated, lost to The Adventures of Robin Hood .)\n\nBritish Academy Film Awards [49] BAFTA Award for Best Sound (Nominated, lost to Speed .) Anthony Asquith Award for Film Music (Nominated, lost to Backbeat .)\n\nBMI Film & TV Awards [50] BMI Film Music Award for \"Can You Feel the Love Tonight\" (Won) Most Performed Song from a Film \"Can You Feel the Love Tonight\" (Won)\n\nGrammy Award [51] [52] Best Vocal Performance Male to Elton John for \"Can You Feel the Love Tonight\" (Won) Grammy Award for Song of the Year|Song of the Year for \"Can You Feel the Love Tonight\" (Nominated, lost to \"Streets of Philadelphia\" from Philadelphia .) Best Song Written for a Motion Picture, Television or Other Visual Media for \"Can You Feel the Love Tonight\" (Nominated, lost to \"Streets of Philadelphia\" from Philadelphia .) Best Song Written for a Motion Picture, Television or Other Visual Media for \"Circle of Life\" (Nominated, lost to \"Streets of Philadelphia\" from Philadelphia .) Best Instrumental Composition Written for a Motion Picture or for Television (Nominated, lost to Schindler's List .)\n\n1995 MTV Movie Awards [53] Best Villain for Jeremy Irons (Nominated, lost to Dennis Hopper for Speed .) Best Song From A Movie for \"Can You Feel the Love Tonight\" (Nominated, lost to \"Big Empty\" from The Crow .)\n\nKids' Choice Awards [54] Favorite Movie (Won)\n\n\n\nHome media\n\nThe Lion King was first released on VHS and Laserdisc in the United States on March 3, 1995, under the \"Walt Disney Masterpiece Collection\" series. In addition, Deluxe Editions of both formats were released. The VHS Deluxe Edition included the film, an exclusive lithograph of Mufasa, Sarabi, and Rafiki holding newborn cub Simba and Scar (in some editions), a commemorative \"Circle of Life\" epigraph, 6 concept art lithographs, another tape with the half-hour TV show The Making of The Lion King, and a certificate of authenticity. The CAV Laserdisc Deluxe Edition also contained the film, six concept art lithographs and The Making of The Lion King, and added storyboards, character design artwork, concept art, rough animation, and a directors' commentary that the VHS edition did not have, on a total of four double sided disks.[55][56]\n\nOn October 7, 2003, the film was re-released on DVD for the very first time ever, titled The Lion King: Special Edition, as part of Disney's Platinum Edition line of animated classic DVDs. The DVD release featured two versions of the film on the first disc, a remastered version created for the 2002 IMAX re-release and an edited version of the IMAX re-release purporting to be the original 1994 theatrical version.[57] A second disc, with bonus features, was also included in the DVD release. The film's soundtrack was provided both in its original Dolby 5.1 track and in a new Disney Enhanced Home Theater Mix, making this one of the first Disney DVDs so equipped.[58] By means of seamless branching, the film could be viewed either with or without a newly-created scene — a short conversation in the film replaced with a complete song (\"The Morning Report\"). A Special Collector's Gift Set was also released, containing the DVD set, five exclusive lithographed character portraits (new sketches created and signed by the original character animators), and an introductory book entitled The Journey.[56]\n\nThe Platinum Edition of The Lion King was criticized by fans for its false advertising: producer Don Hahn had earlier stated that the film would be in its original 1994 theatrical version, but it was confirmed after release that it was the \"digitally enhanced\" IMAX version instead, which is slightly different from the original theatrical cut. One of the most noticeable differences is the re-drawn crocodiles in the \"I Just Can't Wait to Be King\" sequence.[57] Despite this criticism, more than two million copies of the Platinum Edition DVD units were sold on the first day of release.[55] A DVD boxed set of the three The Lion King films (in two-disc Special Edition formats) was released on December 6, 2004. This film and these two sequels were out-of-print, since went back into the Disney Vault in January 2005,[59] but new and used copies still sell very well.[60]\n\nThe Walt Disney Company announced The Lion King is being re-released in theaters in 3D on September 16, 2011 for two weeks only as said by the official Disney site.[61][62] Also, Disney announced that the Diamond Edition release of The Lion King will be released on October 4, 2011.[63] The 4-disc combo pack includes a Blu-ray 3D, Blu-ray 2D, DVD, and \"Digital Copy\" of The Lion King.[62] In accordance with the release of the film, a soundtrack will be released, titled Best of The Lion King.\n\nFollowing the release of the Diamond Edition, a 1-Disc DVD Edition of The Lion King will also be available November 15, 2011.[64] Overall, the Diamond Edition release topped the Blu-ray charts with over 1.5 million copies sold.[65]\n\nThe Lion King was re-released as part of the Walt Disney Signature Collection. It was scheduled to be released on Digital HD on August 15, 2017 and Blu-Ray and DVD on August 29.[66]\n\nA 4K UHD version of The Lion King will be released on December 4, 2018.[67]\n\nControversies\n\nStory origin\n\nThe Lion King was said to be the first Disney animated feature to be an original story, rather than being based on an already-existing story.[3][13] The filmmakers have said that the story of The Lion King was inspired by the Joseph and Moses stories from the Bible and William Shakespeare's Hamlet.[3] Certain elements of the film, however, bear a resemblance to a famous 1960s Japanese anime television show, Kimba the White Lion.[68] One similarity is the protagonists' names: Kimba and Simba, although the word \"simba\" means \"lion\" in Swahili.[69] Many characters in Kimba have an analogue in The Lion King and various individual scenes are nearly identical in composition and camera angle. Matthew Broderick, the voice of Simba, believed initially that he was in fact working on a remake of Kimba, since he was familiar with the Japanese original.[70] Early production artwork on the film's Platinum Edition DVD even includes a white lion.[71] Disney's official stance is that the similarities are all coincidental.[72]\n\nYoshihiro Shimizu, of Tezuka Productions, which created Kimba the White Lion, has refuted rumours that the studio was paid hush money by Disney but explains that they rejected urges from within the industry to sue because, 'we're a small, weak company. It wouldn't be worth it anyway... Disney's lawyers are among the top twenty in the world!'[73]\n\nChristopher Vogler, in his book The Writer's Journey: Mythic Structure for Writers, described Disney's request that he suggest how to improve the plot of The Lion King by incorporating ideas from Hamlet.[74] It has also been noted that the plot bears some resemblance to the West African Epic of Sundiata.[75]\n\nList of similarities and differences\n\nThe Lion King Similarity Picture Difference Kimba the White Lion\n\nSimba Both stories follow their life from childhood to adulthood.\n\nBoth characters are involved in a rivalry between two species; for Leo, humans and animals and for Simba, lions and hyenas. Leo (Kimba) was born on a ship. Simba is born in the Pride Lands. Leo\n\nMufasa Both are kings of their respective kingdoms. Mufasa is killed by Scar in order to usurp the throne. Panja (Caesar) is killed by Viper Snakely (Ham Egg) in an attempt to rescue Eliza (Snowene) and Leo (Kimba) from being shipped to a zoo. Panja\n\nScar Both characters have a black mane and a scarred eye.\n\nBoth characters want the main character killed in order to gain power.\n\nBoth characters receive assistance from comical hyenas. Bubu (Claw in the English dub) also works with Cassius (Sylvester), a black panther, to overthrow Kimba. Scar works only with the hyenas. Bubu\n\nRafiki Both are wise baboons. Buzura (Dan'l in the English dub) mentors Kimba after Kimba's parents die. Rafiki mentored Simba both before and after the death of Simba's father. Buzura/Mandy\n\nZazu Both Zazu and Pauly mentor the main character even when they are in trouble. Pauly always mentored Kimba throughout Kimba's journey in Africa. Zazu mentored Simba until Mufasa's death. He remained as Scar's prisoner until Simba returned as an adult. Coco\n\nShenzi, Banzai, and Ed Both are comical hyenas that assist the main character's enemies. Dick and Do (Tom and Tab in the English dub) also work for Cassius (Sylvester), a black panther. Shenzi, Banzai, and Ed work exclusively for Scar. Dick and Do\n\nPumbaa Both are comical warthogs. Gargoyle stands alone. Pumbaa has a meerkat named Timon by his side. Gargoyle T. Warthog\n\nSimba dangling off a cliff Belladonna pretends to be Kimba's aunt, but later asks forgiveness for her wrongdoings. Scar is Simba's uncle, but does not repent after admitting to the lionesses about murdering Mufasa when Simba was a cub. Kimba dangling off a cliff\n\nMufasa visits Simba as a ghost Both Caesar and Mufasa appear to their sons as a ghost in the sky at night. Panja (Caesar in the English dub) was not alive when Kimba was born. He teaches life lessons to Kimba after his death. Mufasa teaches life lessons to Simba both before and after his death. Panja as a ghost\n\nAlleged subliminal messaging\n\nIn one scene of the film's original VHS and LaserDisc releases, it appears as if the word \"SEX\" might have been embedded into the flowers and grass leaves flying in the sky when Simba flops down in the grass,which conservative activist Donald Wildmon asserted was a subliminal message intended to promote sexual promiscuity.The film's animators, however, have stated that the letters spell \"SFX\" (a common abbreviation of \"special effects\"), and was intended as an innocent \"signature\" created by the effects animation team.Due to the controversy it had caused, the scene was edited for the film's 2003 DVD and VHS releases, and the flowers and grass leaves no longer formed any letters.\n\nThe use of the song \"The Lion Sleeps Tonight\" in a scene with Timon and Pumbaa has led to disputes between Disney and the family of South African Solomon Linda, who composed the song (originally titled \"Mbube\") in 1939. In July 2004, the family filed suit, seeking $1.6 million in royalties from Disney. In February 2006, Linda's heirs reached a legal settlement with Abilene Music, who held the worldwide rights and had licensed the song to Disney for an undisclosed amount of money.[79]\n\nHamas propaganda\n\nIn August 2007, the Hamas organization produced an animated propaganda film that resembled the style of The Lion King. The program was aired via their television station, Al-Aqsa TV. Hamas was portrayed as a lion that chased and killed rats that bore the likenesses of members of the secular Fatah organization in Gaza. The program was briefly aired but was pulled off the air for revision.[80][81]\n\nPortrayal of hyenas\n\nA number of Disney studios artists spent two days observing and sketching captive Spotted Hyenas maintained at the Field Station for Behavioural Research in the hills above the University of California's Berkeley campus. Dr. Laurence Frank, and other scientists who had organized the visit, expressed a strong request that the portrayal of the hyenas featured in The Lion King be positive. The artists responded that they would do their best to make the hyenas appear more comical than evil.[82] The resulting portrayal did not impress most hyena biologists: one hyena researcher sued Disney studios for defamation of character,[83] and in conclusion to a spotted hyena fact sheet written for African Geographic in May 2006, Dr. Frank included boycotting The Lion King as a way of helping preserve hyenas in the wild.[84] Hyena researcher Stephen Glickman wrote: \"In both Hemingway and The Lion King there is an emphasis on greed, gluttony, and stupidity that is ultimately designed to be comical. This reaches its \"pinnacle\" when a hyena [Ed] feeds on its own body, as described in The Green Hills of Africa and in the American children's computer game based on the movie.\"[82]\n\nCondemnation was also launched by film critics and cultural analysts, some of whom saw the portrayals of the hyenas as underlying a low class and that their upholding of cultural stereotypes by sporting African American (Shenzi) and Latin American (Banzai) accents, as opposed to the American and British accents of the main characters, was racist.[85][86][87] Film analyst Matt Roth described the film as a \"the spadework for the ugly principles it [Disney] feels it must implant in each new generation.\"[88]\n\nLegacy\n\nSequels and spin-offs\n\nThe success of the film of The Lion King led to several sequels and spin-offs. Debuting in 1995 was a spin-off television series called The Lion King's Timon & Pumbaa, which focused on the titular meerkat and warthog duo and their Hakuna Matata lifestyle. They are seen hunting bugs, singing songs, and going on wacky, hijinx-filled adventures.[89] The series also had stories about Rafiki, Zazu, and the hyena trio Shenzi, Banzai, and Ed.\n\nIn addition, a direct-to-video sequel, The Lion King II: Simba's Pride was released in 1998, and finally, a direct-to-video prequel/parallel, The Lion King 1½ (also known as The Lion King 3: Hakuna Matata in other countries), was released in 2004, showing the timeline of the original Lion King film from Timon and Pumbaa's perspective.\n\nAlong with other Disney characters, several characters from The Lion King were featured in the 2001-2003 TV series Disney's House of Mouse, as well as its spin-off film Mickey's Magical Christmas: Snowed in at the House of Mouse. Shenzi, Banzai and Ed were part of the Disney villains in the show's other film adaptation Mickey's House of Villains.\n\nAnother spin-off television series called The Lion Guard began as a TV film in November 2015 and later a series in January 2016. The series is a midquel to The Lion King II: Simba's Pride and centers around Simba and Nala's son Kion, as he becomes the leader of The Lion Guard, a team of animals who protect the Pride Lands and defend the Circle of Life.\n\nRemake\n\nOn 28 September 2016, it was confirmed by Disney that a remake of The Lion King will begin production in May of 2017,[90] with Jon Favreau as director. [91] In February 2017, Favreau announced that Donald Glover would portray Simba and James Earl Jones would reprise his role of Mufasa. [92]\n\nIn April 2017, it was confirmed by Favreau that the film would be released on July 19, 2019.[93]\n\nVideo games\n\nTwo video games based on the film have been released. The first, entitled, The Lion King, was published in 1994 by Virgin Group and was released on NES, SNES, Game Boy, Sega Master System, Sega Genesis, Game Gear, Personal computer and Amiga. The second, entitled Simba's Mighty Adventure, was published in 2000 by Activision and was released on PlayStation and Game Boy Color.\n\nIn 1996, Disney Interactive and 7th Level released Timon & Pumbaa's Jungle Games for the PC. It was later seen on the SNES. Games include one where Pumbaa uses his gas to destroy fruits and bugs (and even a kitchen sink) that fall out of trees, a variation on a pinball game, a game where you use a peashooter to hit enemy creatures in the jungle, a game where Timon has to jump onto hippos over a river to deliver bugs to Pumbaa, and a variation on Tetris.\n\nA third game was published in 2004 simply called The Lion King for Game Boy Advance in Europe and Asia, but was in fact a game based on the direct-to-video prequel/midquel The Lion King 1½ with Timon and Pumbaa as the playable characters.\n\nPart of the main plot of The Lion King is retold in the 2005 Square Enix PlayStation 2 game Kingdom Hearts II. The characters of the film appear in \"Pride Land\", one of the many Disney \"worlds\" in the game. The plot is altered and new dialogue was recorded to accommodate the presence of the three main protagonists (Sora, Donald Duck and Goofy). King Simba also appears as a Summon and Summon Card in Kingdom Hearts and Kingdom Hearts: Chain of Memories, respectively.\n\nMusical adaptation\n\nA musical adaptation with the same name premiered in Minneapolis, Minnesota in July 1997, and opened on Broadway in October 1997 at the New Amsterdam Theatre. It won six Tony Awards including Tony Award for Best Musical. The show moved to the Minskoff Theatre in 2006 and is still running there to this day. It is now Broadway's seventh longest-running show in history. The show's financial success on Broadway lead to other productions in North America and all over the world.\n\nAttractions\n\nIn 1994, a 70mm film entitled Circle of Life: An Environmental Fable was released. It promoted environmental friendliness and was shown in the Harvest Theater at Epcot in Walt Disney World.\n\nTrivia\n\nThe story is loosely inspired by the Bible stories of Joseph and Moses as well as William Shakespeare's theatrical play, Hamlet .\n\n. A wildlife expert brought in a lion, baboon and some vultures to the film studios so the animators could study certain behaviors. For example, in the movie Rafiki carries a walking stick or staff, so the animators had the baboon walk around with a stick so they could sketch him in different positions.\n\nThe Lion King was the highest grossing animated film of all time until the release of Disney and Pixar's Finding Nemo in 2003. However, the film remains the highest grossing traditionally animated film in history, and the sixth highest grossing animated film.\n\nwas the highest grossing animated film of all time until the release of Disney and Pixar's in 2003. However, the film remains the highest grossing traditionally animated film in history, and the sixth highest grossing animated film. The Lion King is frequently mentioned in Tyler Perry's plays. [94]\n\nis frequently mentioned in Tyler Perry's plays. The Lion King is similar to Bambi because of one of the parents' death, and Bambi and Faline have known each other since childhood, and, Later they are mates like Simba and Nala. Interestingly, screenwriter Irene Mecchi called The Lion King \"Bambi in Africa\".\n\nis similar to because of one of the parents' death, and Bambi and Faline have known each other since childhood, and, Later they are mates like Simba and Nala. Interestingly, screenwriter Irene Mecchi called \"Bambi in Africa\". The Lion King is interestingly similar to the anime cartoon show known as Kimba The White Lion. The story of The Lion King follows Kimba so closely that the writers have been accused of ripping off the story of Kimba The White Lion which first aired in 1965.[5]\n\nis interestingly similar to the anime cartoon show known as Kimba The White Lion. The story of follows Kimba so closely that the writers have been accused of ripping off the story of Kimba The White Lion which first aired in 1965.[5] In the film Hotel Transylvania, the character Johnny refers to his and another character called Mavis' love as being the same as \"Simba and Nala in The Lion King\" during the final song.\n\nthe character Johnny refers to his and another character called Mavis' love as being the same as \"Simba and Nala in The Lion King\" during the final song. In the Disney TV Show Gargoyles , the character Hudson is shown flicking through TV channels during Episode 4 and flicks past The Lion King as well as other well-known films and shows.\n\n, the character Hudson is shown flicking through TV channels during Episode 4 and flicks past The Lion King as well as other well-known films and shows. In The Father of the Pride the two characters Sierra and Hunter watch a film related to The Lion King.\n\nthe two characters Sierra and Hunter watch a film related to The Lion King. The Lion King was Disney's first animated movie that does not give any sign of existence of people. The only thing that could break this theory is Zazu's line: \"He'd make a very handsome throw rug,\" but it isn't counted as an official counterargument.\n\nOther\n\nA list of the mistakes and continuity errors in this movie can be found here.\n\nInformations about original concepts for the film can be found here.\n\nMedia\n\nLion King official trailer (HQ) Official trailer for The Lion King The Lion King - 1993 Teaser Trailer 1993 trailer for The Lion King The Lion King - Platinum Edition Trailer The Lion King Special Edition trailer The Lion King 2011 - Blu-ray Trailer HQ The Lion King Blu-Ray trailer The Lion King Disney Junior The Lion King Walt Disney Signature Collection trailer The Lion King 4K Ultra HD™Trailer Official Trailer The Lion King 4K Ultra HD trailer The Making of The Lion King The Making of The Lion King The Lion King BTS The Voices The Lion King Behind-the-Scenes: The Voices The Lion King Inside The Story Room The Lion King Inside the Story Room The Lion King Visualizing A Villain The Lion King Visualizing a Villain\n\nAdd a photo to this gallery", "images": ["https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/diepio/images/3/32/Spotlight.png/revision/latest/zoom-crop/width/100/height/56?cb=20180227151035", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/2/22/Mo%C5%BEdaSli%C4%8Dno3%3F.png/revision/latest/scale-to-width-down/300?cb=20140122213259", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/5/5d/Every_Lion_King_Project_Ever.png/revision/latest/scale-to-width-down/250?cb=20170429193003", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/8/8a/Lion-king-disneyscreencaps.com-7314.png/revision/latest/scale-to-width-down/250?cb=20170121023543", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/9/9a/Earlypresentationreelwhitelionking.png/revision/latest/scale-to-width-down/250?cb=20181110174639", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/wearewarriors/images/e/e7/124961.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20181027141254", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/d/d5/Mo%C5%BEdaSli%C4%8Dno719.png/revision/latest/scale-to-width-down/350?cb=20140830085555", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/f/f8/Lion-king-disneyscreencaps.com-4159.png/revision/latest/scale-to-width-down/250?cb=20170110074513", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/a/a7/TLKcast.png/revision/latest/scale-to-width-down/250?cb=20110701050634", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/0/00/The_Lion_King_Disney_Junior/revision/latest/scale-to-width-down/185?cb=20170910153502", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/c/ca/The_Lion_King_Special_Edition_DVD.png/revision/latest/scale-to-width-down/250?cb=20181110174052", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/0/00/Mo%C5%BEdaSli%C4%8Dno725.png/revision/latest/scale-to-width-down/350?cb=20140830112425", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/c/cb/Lion-king-disneyscreencaps.com-7906.png/revision/latest/scale-to-width-down/250?cb=20170122022615", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/6/67/The_Lion_King_Signature_Collection.png/revision/latest/scale-to-width-down/250?cb=20181110174306", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/0/0e/The_Lion_King_3D_poster.png/revision/latest/scale-to-width-down/250?cb=20181110173921", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/1/10/Mo%C5%BEdaSli%C4%8Dno733.png/revision/latest/scale-to-width-down/350?cb=20140830190004", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/4/4f/SFX_TLK.png/revision/latest/scale-to-width-down/240?cb=20181110175318", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/c/c5/Tlkingargoyles.png/revision/latest/scale-to-width-down/224?cb=20130314211755", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/5/57/The_Lion_King_-_Platinum_Edition_Trailer/revision/latest/scale-to-width-down/185?cb=20171226193444", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/d/d8/The_Lion_King_-_1993_Teaser_Trailer/revision/latest/scale-to-width-down/185?cb=20161205222858", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/e/e3/The_Making_of_The_Lion_King/revision/latest/scale-to-width-down/185?cb=20180308170926", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/2/2e/The_Lion_King_4K_Ultra_HD%E2%84%A2Trailer_Official_Trailer/revision/latest/scale-to-width-down/185?cb=20181112163541", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/c/cb/Lion-king-disneyscreencaps.com-5229.png/revision/latest/scale-to-width-down/250?cb=20170113030114", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/8/81/Lion_King_official_trailer_%28HQ%29/revision/latest/scale-to-width-down/185?cb=20140504111138", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/4/44/Mo%C5%BEdaSli%C4%8Dno%3F.png/revision/latest/scale-to-width-down/350?cb=20140119191310", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/b/be/Mo%C5%BEdaSli%C4%8Dno713.png/revision/latest/scale-to-width-down/350?cb=20140830080059", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/2/2c/The_Lion_King_Poster.png/revision/latest/scale-to-width-down/300?cb=20131017213547", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/d/d3/The_Lion_King_2011_-_Blu-ray_Trailer_HQ/revision/latest/scale-to-width-down/185?cb=20171226193550", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/c/ca/Lion-king-disneyscreencaps.com-2904.png/revision/latest/scale-to-width-down/250?cb=20160530233204", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/8/89/Wiki-wordmark.png/revision/latest?cb=20180117042146", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/b/bb/Final.png/revision/latest/scale-to-width-down/250?cb=20181110174213", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/2/22/Mo%C5%BEdaSli%C4%8Dno4%3F.png/revision/latest/scale-to-width-down/300?cb=20140122213323", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/5/56/Mo%C5%BEdaSli%C4%8Dno728.png/revision/latest/scale-to-width-down/350?cb=20180820040406", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/2/24/The_Lion_King_BTS_The_Voices/revision/latest/scale-to-width-down/185?cb=20170910153647", "https://web.archive.org/web/20181204005658im_/https://slot1-images.wikia.nocookie.net/__cb7770017770012/common/extensions/wikia/WikiaBar/images/wikiabarIcon.png", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/e/ec/Lion-king-disneyscreencaps.com-9471.png/revision/latest/scale-to-width-down/250?cb=20170124065853", "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/0/04/Lion-king-disneyscreencaps.com-386.png/revision/latest?cb=20160521233819", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/3/30/The_Lion_King_Visualizing_A_Villain/revision/latest/scale-to-width-down/185?cb=20170910154038", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/theedgechronicles/images/3/3b/Descenderscropped.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20171221184206", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/0/04/Lion-king-disneyscreencaps.com-386.png/revision/latest/scale-to-width-down/250?cb=20160521233819", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/d/db/Mo%C5%BEdaSli%C4%8Dno722.png/revision/latest/scale-to-width-down/350?cb=20140830090531", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/5/55/BigLovableChunkOfWarthogHere.png/revision/latest/scale-to-width-down/75?cb=20141025014425", "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/5/5a/The_Lion_King_Inside_The_Story_Room/revision/latest/scale-to-width-down/185?cb=20170910153934"], "top_img": "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/0/04/Lion-king-disneyscreencaps.com-386.png/revision/latest?cb=20160521233819", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20181204005658/https://lionking.fandom.com/wiki/The_Lion_King", "title": "The Lion King", "meta_data": {"viewport": "width=device-width, user-scalable=yes", "generator": "MediaWiki 1.19.24", "keywords": "The Lion King Wiki,lionking,The Lion King,The Lion King (2019 film),The Lion King (musical),The Lion King (game),The Lion King (Original Motion Picture Soundtrack),Roger Allers,Rob Minkoff,Irene Mecchi,Jonathan Roberts,Linda Woolverton,Lebo M", "description": "The Lion King is a 1994 American animated feature film, produced by Walt Disney Feature Animation and released by Walt Disney Pictures. It is the 32nd animated feature in the Walt Disney Animated Classics, as well as the highest-grossing traditionally-animated film of all-time in North America...", "twitter": {"card": "summary", "site": "@getfandom", "url": "https://web.archive.org/web/20181204005658im_/https://lionking.fandom.com/wiki/The_Lion_King", "title": "The Lion King | The Lion King Wiki | FANDOM powered by Wikia", "description": "The Lion King is a 1994 American animated feature film, produced by Walt Disney Feature Animation and released by Walt Disney Pictures. It is the 32nd animated feature in the Walt Disney Animated..."}, "fb": {"app_id": 112328095453510}, "og": {"type": "article", "site_name": "The Lion King Wiki", "title": "The Lion King", "description": "The Lion King is a 1994 American animated feature film, produced by Walt Disney Feature Animation and released by Walt Disney Pictures. It is the 32nd animated feature in the Walt Disney Animated Classics, as well as the highest-grossing traditionally-animated film of all-time in North America. The film focuses on a lion cub in Africa named Simba, who learns to find his place in the great Circle of Life while struggling to become the rightful king of Pride Rock. The story, which was...", "url": "https://web.archive.org/web/20181204005658/https://lionking.fandom.com/wiki/The_Lion_King", "image": "https://web.archive.org/web/20181204005658im_/https://vignette.wikia.nocookie.net/lionking/images/0/04/Lion-king-disneyscreencaps.com-386.png/revision/latest?cb=20160521233819"}, "apple-itunes-app": "app-id=422467074, app-arguments=https://lionking.fandom.com/wiki/The_Lion_King"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}