{"url": "https://deadline.com/2018/05/e-ashlee-simpson-ross-evan-ross-busy-philipps-series-e-true-hollywood-story-return-among-series-greenlights-1202380387/", "text": "E! has announced six new series, including a talk show hosted by Busy Philipps, and a new docuseries featuring Ashlee Simpson-Ross and her husband Evan Ross. In addition, E! is bringing back long-running franchise E! True Hollywood Story with new episodes. The network also set three unscripted projects in development, including a competition elimination series for stuntwomen from the team behind American Ninja Warrior, a twins docuseries and a comedy that brings celebrity autobiographies to the small screen.\n\nTalk show Busy Tonight, hosted by Philipps, will feature comedic commentary, interviews, and segments that go behind her most popular Instagram stories. Philipps executive produces with Julie Darmody and Eric Gurian for Little Stranger.\n\nAshlee and Evan (working title will follow actress and singer Ashlee Simpson-Ross and her husband actor and artist Evan Ross as they try to balance life as new parents. Ashlee’s sister Jessica became a household name with her reality series featuring her and her husband, Newlyweds: Nick and Jessica on MTV. Ashlee and Evan is produced by Citizen Jones and Cinema Giants with Jonah Bekhor, Jonas Bell Pasht, Jessy Terrero, Angela Aguilera, Ashlee Simpson-Ross and Evan Ross serving as Executive Producers.\n\nThe network is bringing back E! True Hollywood Story, which originally began as a series of specials beginning in March 1996, but evolved into a weekly biographical documentary series. The regular run as a series began in October 1996. The first True Hollywood Story focused on the murder of Rebecca Schaeffer. The series was nominated for Emmy Awards in 2001, 2002, and 2003, and Prism Awards in 2009. Wilshire Studios is producing.\n\nSee complete details of projects below.\n\n“Ashlee and Evan” (working title)\n\nThis new docu-series will follow actress and singer Ashlee Simpson-Ross and her husband actor and artist Evan Ross. We’ll get an inside look into this young millennial couple as they try to balance life as new parents with a solid foundation of humor and love. Coming from two famous music families, Ashlee and Evan will take viewers inside the recording of their first duet album. Fans will see Evan’s rising star in music and Ashlee cautiously jumping back into the music world. We will watch as they face challenges and success in their marriage and music while receiving the unwavering support from their legendary families and life-long friends. “Ashlee and Evan” is produced by Citizen Jones and Cinema Giants with Jonah Bekhor, Jonas Bell Pasht, Jessy Terrero, Angela Aguilera, Ashlee Simpson-Ross and Evan Ross serving as Executive Producers.\n\n“Busy Tonight” (working title)\n\nHosted by actress Busy Philipps, “Busy Tonight” features comedic commentary, interviews, and segments that go behind her most popular Instagram stories. Unfiltered, in-the-know and always entertaining, Busy will give us her unique and hilarious point of view on literally everything. Executive Producers for “Busy Tonight” are Busy Philipps, Julie Darmody and Eric Gurian for Little Stranger.\n\n“E! True Hollywood Story”\n\nThe series that told Hollywood’s most compelling stories is back. “E! True Hollywood Story” is taking a modern approach, and providing a voice to the moments that are reshaping popular culture. Each self-contained documentary will explore a topic, headline, or person that became the ground zero for a revolution, change or shift in culture, told by the people who were on the frontlines of the story. “E! True Hollywood Story” is produced by Wilshire Studios.\n\n“The Funny Dance Show” (working title)\n\nFor more than a year, “Stand Up 2 the Streets” has played to sold-out crowds at the #1 Comedy Club in the country, The Comedy Store. Created and hosted by comedians Justine Marino and Heidi Heaslet, this one-hour format harnesses the conventions and spectacle of dance pop culture found in movies like the wildly popular “Step Up” franchise and TV shows like “So You Think You Can Dance” and “Dancing with the Stars” but with a comedic POV. In each stand-alone episode, four comic celebrities compete for a donation to the charity of their choice. Anchored by comedian and pop culture expert, Justin Martindale, an irreverent judging panel critiques the performances so that the audience can ultimately vote on the winning team. The series is produced by Ugly Brother with Mike Duffy, Tim Duffy, Justine Marino and Heidi Heaslet serving as Executive Producers.\n\n“The LadyGang” (working title)\n\nWhat happens when you mix the “Girls Trip” sense of female community with juicy pop culture commentary, no-holds-barred celebrity interviews, and three equally gorgeous and hilarious LA ladies? You not only get a “Podcast of the Year” winner with over 22 million listens, but a phenomenon that graced People Magazine and made Entertainment Weekly’s “Must List.” Welcome to the LadyGang, the TV show based on the podcast created by Keltie Knight, Becca Tobin, and Jac Vanek. “The LadyGang” is produced by Purveyors of Pop and Entertainment One (eOne) with Matt Anderson, Nate Green, and Cooper Green for Purveyors of Pop, Tara Long for eOne, Keltie Knight, Becca Tobin, and Jac Vanek serving as Executive Producers.\n\n“Nat & Liv” (working title)\n\nNatalie Halcro and Olivia Pierson are influencers, designers, and fashion & beauty bloggers that have over five million followers on Instagram alone. But more importantly they are family. Cousins and best friends, this docu-series will take us to a part of their lives that we’ve never seen before from Vancouver to Los Angeles. From their hilariously direct older brothers, to Nat’s hippy sister, to their hysterical parents, Nat and Liv’s family will make you laugh and cry… sometimes at the same time. “Nat & Liv” is produced by Machete Productions & Cineflix with Amber Mazzola, Kim Bondi and Dave Hamilton serving as Executive Producers.\n\nThree unscripted projects in development include:\n\n“The Twins Project” (working title)\n\nThree vibrant sets of twins all have their sights set on conquering each of their own worlds. From radio DJs, to pop artists and social media fame, the docs-series will explore their dynamics as siblings, best friends and co-workers while reaching new heights in their careers and choosing to do so together, rather than alone. “The Twins Project” is produced by World of Wonder with Fenton Bailey, Randy Barbato and Tom Campbell serving as Executive Producers.\n\n“Written by the Stars” (working title)\n\n“Written by the Stars” takes the most ridiculous first-hand excerpts from celebrity autobiographies and transports them from the page to the screen. Quoting directly from the books and with the help of a hilarious SNL-esque troop, the most epic celebrity stories come to life – viewers will see their favorite celebrities’ hazy nights, crazy affairs, behind the scene antics, and Hollywood secrets. “Written by the Stars” is produced by Haymaker with Aaron Rothman and Irad Eyal serving as Executive Producers.\n\n“Wonder Women” (working title)\n\nThe need for stuntwomen in the entertainment industry has never been greater. This competition-elimination docu-series will follow a stunt director on a journey to ﬁnd the next great stuntwoman. Each week, hopefuls will face challenges that test their physical, mental, and emotional strength – requiring them to give their all if they want to become the next breakthrough female stunt performer. “Wonder Women” is produced by A. Smith & Co. Productions, with Arthur Smith and Toby Gorman serving as executive producers.", "images": ["https://deadline.com/wp-content/uploads/2018/05/ashlee-and-evan-simpson.jpg?w=681&h=383&crop=1", "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://deadline.com/wp-content/uploads/2018/05/ashlee-and-evan-simpson.jpg?w=694", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1"], "top_img": "https://deadline.com/wp-content/uploads/2018/05/ashlee-and-evan-simpson.jpg?w=694", "keywords": [], "authors": ["Denise Petski"], "canonical_link": "https://deadline.com/2018/05/e-ashlee-simpson-ross-evan-ross-busy-philipps-series-e-true-hollywood-story-return-among-series-greenlights-1202380387/", "title": "E!: Ashlee Simpson-Ross & Evan Ross, Busy Philipps Series, ‘E! True Hollywood Story’ Return Among Series Greenlights", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "E! has announced new series", "news_keywords": "E!", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=533209613", "generator": "WordPress 6.0.2", "author": "Denise Petski", "theme-color": "#fff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Deadline", "application-name": "Deadline", "content_type": "Article", "post_id": 1202380387, "title": "E!: Ashlee Simpson-Ross & Evan Ross, Busy Philipps Series, ‘E! True Hollywood Story’ Return Among Series Greenlights", "published_at": "2018-05-01 10:28:21", "image": "https://deadline.com/wp-content/uploads/2018/05/ashlee-and-evan-simpson.jpg?w=296&h=166&crop=1", "comment_count": 1, "tags": "E!", "topics": "TV", "body": "E! has announced six new series, including a talk show hosted by Busy Philipps, and a new docuseries featuring Ashlee Simpson-Ross and her husband Evan Ross.  In addition, E! is bringing back long-running franchise E! True Hollywood Story with new episodes. The network also set three unscripted projects in development, including a competition elimination series for stuntwomen from the team behind American Ninja Warrior, a twins docuseries and a comedy that brings celebrity autobiographies to the small screen.\r\n\r\n\r\n\r\nTalk show Busy Tonight, hosted by Philipps, will feature comedic commentary, interviews, and segments that go behind her most popular Instagram stories. Philipps executive produces with Julie Darmody and Eric Gurian for Little Stranger.\r\n\r\nAshlee and Evan (working title will follow actress and singer Ashlee Simpson-Ross and her husband actor and artist Evan Ross as they try to balance life as new parents. Ashlee's sister Jessica became a household name with her reality series featuring her and her husband, Newlyweds: Nick and Jessica on MTV. Ashlee and Evan is produced by Citizen Jones and Cinema Giants with Jonah Bekhor, Jonas Bell Pasht, Jessy Terrero, Angela Aguilera, Ashlee Simpson-Ross and Evan Ross serving as Executive Producers.\r\n\r\nThe network is bringing back E! True Hollywood Story, which originally began as a series of specials beginning in March 1996, but evolved into a weekly biographical documentary series. The regular run as a series began in October 1996. The first True Hollywood Story focused on the murder of Rebecca Schaeffer. The series was nominated for Emmy Awards in 2001, 2002, and 2003, and Prism Awards in 2009. Wilshire Studios is producing.\r\n\r\nSee complete details of projects below.\r\n“Ashlee and Evan” (working title)\r\n\r\nThis new docu-series will follow actress and singer Ashlee Simpson-Ross and her husband actor and artist Evan Ross. We’ll get an inside look into this young millennial couple as they try to balance life as new parents with a solid foundation of humor and love. Coming from two famous music families, Ashlee and Evan will take viewers inside the recording of their first duet album. Fans will see Evan’s rising star in music and Ashlee cautiously jumping back into the music world. We will watch as they face challenges and success in their marriage and music while receiving the unwavering support from their legendary families and life-long friends. “Ashlee and Evan” is produced by Citizen Jones and Cinema Giants with Jonah Bekhor, Jonas Bell Pasht, Jessy Terrero, Angela Aguilera, Ashlee Simpson-Ross and Evan Ross serving as Executive Producers.\r\n\r\n“Busy Tonight” (working title)\r\n\r\nHosted by actress Busy Philipps, “Busy Tonight\" features comedic commentary, interviews, and segments that go behind her most popular Instagram stories. Unfiltered, in-the-know and always entertaining, Busy will give us her unique and hilarious point of view on literally everything. Executive Producers for “Busy Tonight” are Busy Philipps, Julie Darmody and Eric Gurian for Little Stranger.\r\n\r\n“E! True Hollywood Story”\r\n\r\nThe series that told Hollywood’s most compelling stories is back. \"E! True Hollywood Story\" is taking a modern approach, and providing a voice to the moments that are reshaping popular culture. Each self-contained documentary will explore a topic, headline, or person that became the ground zero for a revolution, change or shift in culture, told by the people who were on the frontlines of the story. “E! True Hollywood Story” is produced by Wilshire Studios.\r\n\r\n“The Funny Dance Show\" (working title)\r\n\r\nFor more than a year, \"Stand Up 2 the Streets\" has played to sold-out crowds at the #1 Comedy Club in the country, The Comedy Store. Created and hosted by comedians Justine Marino and Heidi Heaslet, this one-hour format harnesses the conventions and spectacle of dance pop culture found in movies like the wildly popular “Step Up” franchise and TV shows like “So You Think You Can Dance” and “Dancing with the Stars” but with a comedic POV. In each stand-alone episode, four comic celebrities compete for a donation to the charity of their choice. Anchored by comedian and pop culture expert, Justin Martindale, an irreverent judging panel critiques the performances so that the audience can ultimately vote on the winning team. The series is produced by Ugly Brother with Mike Duffy, Tim Duffy, Justine Marino and Heidi Heaslet serving as Executive Producers.\r\n\r\n“The LadyGang” (working title)\r\n\r\nWhat happens when you mix the “Girls Trip” sense of female community with juicy pop culture commentary, no-holds-barred celebrity interviews, and three equally gorgeous and hilarious LA ladies? You not only get a \"Podcast of the Year\" winner with over 22 million listens, but a phenomenon that graced People Magazine and made Entertainment Weekly's \"Must List.” Welcome to the LadyGang, the TV show based on the podcast created by Keltie Knight, Becca Tobin, and Jac Vanek. “The LadyGang” is produced by Purveyors of Pop and Entertainment One (eOne) with Matt Anderson, Nate Green, and Cooper Green for Purveyors of Pop, Tara Long for eOne, Keltie Knight, Becca Tobin, and Jac Vanek serving as Executive Producers.\r\n\r\n“Nat & Liv” (working title)\r\n\r\nNatalie Halcro and Olivia Pierson are influencers, designers, and fashion & beauty bloggers that have over five million followers on Instagram alone. But more importantly they are family. Cousins and best friends, this docu-series will take us to a part of their lives that we’ve never seen before from Vancouver to Los Angeles. From their hilariously direct older brothers, to Nat’s hippy sister, to their hysterical parents, Nat and Liv’s family will make you laugh and cry… sometimes at the same time. “Nat & Liv” is produced by Machete Productions & Cineflix with Amber Mazzola, Kim Bondi and Dave Hamilton serving as Executive Producers.\r\n\r\nThree unscripted projects in development include:\r\n\r\n“The Twins Project\" (working title)\r\n\r\nThree vibrant sets of twins all have their sights set on conquering each of their own worlds. From radio DJs, to pop artists and social media fame, the docs-series will explore their dynamics as siblings, best friends and co-workers while reaching new heights in their careers and choosing to do so together, rather than alone. “The Twins Project” is produced by World of Wonder with Fenton Bailey, Randy Barbato and Tom Campbell serving as Executive Producers.\r\n\r\n“Written by the Stars” (working title)\r\n\r\n\"Written by the Stars\" takes the most ridiculous first-hand excerpts from celebrity autobiographies and transports them from the page to the screen. Quoting directly from the books and with the help of a hilarious SNL-esque troop, the most epic celebrity stories come to life - viewers will see their favorite celebrities' hazy nights, crazy affairs, behind the scene antics, and Hollywood secrets. “Written by the Stars” is produced by Haymaker with Aaron Rothman and Irad Eyal serving as Executive Producers.\r\n\r\n“Wonder Women” (working title)\r\n\r\nThe need for stuntwomen in the entertainment industry has never been greater. This competition-elimination docu-series will follow a stunt director on a journey to ﬁnd the next great stuntwoman. Each week, hopefuls will face challenges that test their physical, mental, and emotional strength – requiring them to give their all if they want to become the next breakthrough female stunt performer. “Wonder Women” is produced by A. Smith & Co. Productions, with Arthur Smith and Toby Gorman serving as executive producers.", "fb": {"pages": 105558754896}, "onesignal": "wordpress-plugin", "fragment": "!", "og": {"type": "article", "title": "E!: Ashlee Simpson-Ross & Evan Ross, Busy Philipps Series, ‘E! True Hollywood Story’ Return Among Series Greenlights", "url": "https://deadline.com/2018/05/e-ashlee-simpson-ross-evan-ross-busy-philipps-series-e-true-hollywood-story-return-among-series-greenlights-1202380387/", "description": "E! has announced six new series, including a talk show hosted by Busy Philipps, and a new docuseries featuring Ashlee Simpson-Ross and her husband Evan Ross.  In addition, E! is bringing back long-…", "site_name": "Deadline", "image": {"identifier": "https://deadline.com/wp-content/uploads/2018/05/ashlee-and-evan-simpson.jpg?w=694", "width": 694, "height": 425}, "locale": "en_US"}, "article": {"published_time": "2018-05-01T17:28:21+00:00", "modified_time": "2019-09-06T22:29:43+00:00"}, "twitter": {"site": "@DEADLINE", "card": "summary_large_image", "title": "E!: Ashlee Simpson-Ross & Evan Ross, Busy Philipps Series, ‘E! True Hollywood Story’ Return Among Series Greenlights", "description": "E! has announced new series", "image": "https://deadline.com/wp-content/uploads/2018/05/ashlee-and-evan-simpson.jpg?w=694"}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1525195701.0, "source": "https://deadline.com", "summary": ""}