{"url": "https://web.archive.org/web/20171030102231/https://www.businessinsider.com.au/stranger-things-2-details-analysis-v2-2017-10", "text": "Netflix ‘Stranger Things’ season two is streaming on Netflix now.\n\nWarning: Spoilers ahead for the entire second season of “Stranger Things.”\n\n“Stranger Things 2” is now streaming on Netflix, and we’ve parsed through every scene to find the biggest callbacks to season one or revelations hidden in the corners of sets or spelled out through dialogue. For this roundup, we’re looking at important moments within the “Stranger Things” universe itself, and leaving all the references to 80s movies and pop culture for another time.\n\nKeep scrolling for a look at 11 details you might have overlooked on the second season of “Stranger Things.”\n\nLucas teased Dustin about not getting the princess when he played 'Dragon's Lair,' foreshadowing how Lucas would wind up with Max by the end of the season. Netflix Dustin (Gaten Matarazzo) and Lucas (Caleb McLaughlin) in the arcade. 'You're just not nimble enough,' Lucas said. 'You'll get there one day, but until then Princess Daphne is still mine.' The rest of the season played out a small love triangle between Dustin, Lucas, and Max, but Dustin was left alone and without a love interest by the end of the season. He'll get there one day, right? It was ironic to hear Murray Bauman say he thought Eleven was a Russian child, since Eleven was being used by Hawkins Lab to spy on Russians. Netflix Actor Brett Gelman played the conspiracy theorist. On the opening episode of the second season, Bauman harasses Chief Jim Hopper about his theory involving a Russian child (Eleven) and an elaborate conspiracy with international consequences. Bauman had pieces of the story correct, but the things he got wrong were telling. The Russians are mentioned by various characters, but often as a vague allusion to the Cold War, but no one knows how they connect to Hawkins Lab. Netflix Eleven (Millie Bobby Brown) listening to a Russian man speak on season one. No one seems to realise Dr. Brenner and Hawkins lab seemed to first plan on using Eleven to spy on Russians by showing her their picture and having her listen to them with her powers. Eleven herself is likely unaware of what her temporary involvement in the Cold War was, given how limited her understanding of the world is. Mike paused when he picked up his dinosaur toy because it reminded him of Eleven's first time in his bedroom. Netflix Mike (Finn Wolfhard) and the T-rex on season two, episode one, 'Madmax.' After Mike continues acting out, his parents make him sell his old toys as punishment. He tells his mum they have 'emotional value,' but gets dismissed. Mike wasn't joking -- some of the toys in his basement are direct connections he still has with Eleven. 'This is my dinosaur, Roary, he has a speaker in his mouth so he can roar,' Mike told Eleven back on season one. Netflix Eleven was unimpressed by Roary. In that same season one scene, Mike told Eleven about Yoda and how he could move things with his mind. Later Dustin tried to get Eleven to make Mike's toy Millennium Falcon move. Will's 'Ghostbusters' costume was slightly different from the others, subtly signalling that he's not as well off as his friends. Netflix The boys on episode two, 'Trick or Treat, Freak.' On the first episode of season two, Joyce was sewing the 'Ghostbusters' patch onto Will's Halloween costume. When we saw them altogether, it was clear that Will's was a different colour and slight less 'realistic,' likely because Joyce had to make more of it by hand. You can already tell based on their houses and other mentions of family wealth that the Byers aren't on the same socioeconomic plane as Dustin, Lucas, and Mike's families. But this was a subtle way of showing how it affects Will's day-to-day life with his friends. When Eleven broke back through the Upside Down, she entered through the same Wall the Demogorgon used on season one. Netflix Eleven was trapped in the Upside Down temporarily after killing the Demogorgon. After season one, a popular fan theory posited that Eleven and Demogorgon were the same being, almost as if the Demogorgon was Eleven's alter-ego. By mirroring the way the Demogorgon broke into Hawkins Middle School with Eleven's return, the Duffer Brothers might have been nodding to this theory. Netflix The Demogorgon on the season one finale. By the end of season two, it's made clear that Eleven is definitely not a Demogorgon but instead is the only human (we know of) capable of keeping the evil Shadow Monster/Mind Flayer at bay. Once again, though, a connection was drawn between Eleven and the new monster haunting Hawkins. Netflix The Mind Flayer, also called the Shadow Monster by the kids. On the first episode of season two, 'Madmax,' Murray Bauman tells Hopper a story he heard about a girl with 'psionic abilities.' One of the other cops asks what that means, and Bauman says 'psychic.' Psionic is the same term used in 'Dungeons and Dragons,' and Dustin repeats it when describing the Mind Flayer. Netflix Dustin shows this page to the rest of the group on episode eight, 'Mind Flayer.' Though we don't believe this is meant to spark new theories about the Mind Flayer and Eleven being the same person or being. Instead it signifies the importance of Eleven's powers and how her presence in Hawkins is clearly triggering a crossover between other dimensions. Eleven opened the first gate into the Upside Down, and now the Mind Flayer knows she's capable of overcoming him (thanks to that epic finale showdown). Will they face off again on season three? Now onto some significant Hopper revelations. His secret knock for Eleven spells 'us' in Morse code. Netflix Hopper (David Harbour) hid Eleven in a remote cabin. Hopper's relationship with Eleven was a tumultuous reckoning for him, given how he lost his own daughter before she could grow up to be Eleven's age. Since Morse code featured so heavily on this season, several people on the 'Stranger Things' subreddit picked up on the knock he created for their signal having added meaning. Hopper would knock twice, pause and knock again, then do three quick knocks, which matches the Morse code for 'us' (•• -- /•••). Hopper was reading a heartbreaking passage of 'Anne of Green Gables' to Eleven. Netflix Eleven had a flashback to this moment on episode three, 'The Pollywog.' Eleven remembered Hopper reading to her. And not only was it the same book he used to read to his daughter, 'Anne of Green Gables,' but the passage chosen for the scene was telling. It was a section of the book where Anne describes her state as a orphan to a friend. Here's the full section Hopper read. 'I would feel so sad if I was a disappointment to her -- because she didn't live very long after that, you see. She died of a fever when I was just three months old. I do wish she'd lived long enough for me to remember calling her mother. I think it would be so sweet to say 'mother,' don't you? And father died four days afterwards from fever too. That left me an orphan and folks were at their wits' end, so Mrs. Thomas said, what to do with me. You see, nobody wanted me even then. It seems to be my fate.' We saw Hopper reading 'Anne of Green Gables' to his daughter when she was in the hospital back on season one. Netflix Hopper and Sara in the finale of season one. Hopper was reading a different passage at the time, but the fact that he chose the same book to read to Eleven really hammers in how much of a surrogate she is for Sara. An even more dramatic connection between Sara and Eleven came on the season two finale when Hopper and Eleven entered the stairwell of Hawkins Lab. Netflix The staircase rail as seen on the season two finale. Hopper and Eleven entered Hawkins Lab to close the gate to the Upside Down, and found Dr. Owens bleeding in the stairwell. The scene triggered a reminder of a quick flashback Hopper had on season one when remembering his daughter's death. On the first season, Hopper was shown crying in the corner of the same stairwell we now know is inside Hawkins Lab. Netflix The handrails are an exact match. While Dr. Owens wasn't sitting in the precise same corner where we saw Hopper curled up, the handrails are a dead match. While it is possible the 'Stranger Things' crew just re-used a set for the flashback and for Hawkins, we believe this might be the first concrete hint that Hopper's past is darker than previously believed. For one, we know Hopper used to be a 'big city' cop and he appears to have a deeper background in government and secrecy. What if Sara's death wasn't an unexpected illness, but instead was connected somehow to Hawkins Lab or another arm of the government? Read our explainer for more on why this was already a running theory after season one. To end on the happiest note of all, the Snow Ball was this season's best callback. Netflix Mr. Clarke hanging up decorations for the Snow Ball. Ending the second season with the Snow Ball was the happiest moment they could have given Mike and Eleven. Right before Mike kissed Eleven for the first time, he invited her to the Snow Ball. Netflix Eleven was pleasantly surprised by the kiss. Mike was fumbling through trying to explain to Eleven how she could be a part of their family, but not like a sister. 'Maybe we can go to the Snow Ball together,' Mike told Eleven on the first season. 'It's this cheesy school dance where you go in the gym and dance to music and stuff. I've never been, but I know you're not supposed to go with your sister.' When she still didn't understand, Mike gave up explaining and just kissed Eleven. Hopper making sure Eleven got one 'normal' night at the Snow Ball was a perfect way to tie up the separation between Mike and Eleven. Netflix Everything came full circle in the sweetest way. Mike finally got to go to the Snow Ball with Eleven, even it was more than a year later. And now that Eleven is 'officially' Hopper's daughter, we hope they aren't separated again on future seasons. For more on 'Stranger Things,' including photos comparing what the cast looks like in real life next to their characters, follow INSIDER's coverage here.\n\nMore from INSIDER:\n\nThis article originally appeared at INSIDER. Follow INSIDER on Facebook. Copyright 2017. Follow INSIDER on Twitter.\n\nNOW WATCH: Briefing videos\n\nBusiness Insider Emails & Alerts Site highlights each day to your inbox. Email Address Join\n\nFollow Business Insider Australia on Facebook, Twitter, LinkedIn, and Instagram.", "images": ["https://web.archive.org/web/20171030102231im_/https://cm.g.doubleclick.net/pixel?google_nid=adaptv_dbm&google_cm&google_sc", "https://web.archive.org/web/20171030102231im_/https://static.businessinsider.com/image/59f4c9549361af099935b453-400/image.jpg", "https://web.archive.org/web/20171030102231im_/https://static.businessinsider.com/image/59f4c9579361af099935b462-400/image.jpg", "https://web.archive.org/web/20171030102231im_/https://static.businessinsider.com/image/59f4c9569361af099935b460-400/image.jpg", "https://web.archive.org/web/20171030102231im_/https://www.businessinsider.com.au/app/themes/allure-network/assets/img/shared/WhatsApp_Logo.png", "https://web.archive.org/web/20171030102231im_/https://static.businessinsider.com/image/59f4c9569361af099935b45e-400/image.jpg", "https://web.archive.org/web/20171030102231im_/https://static.businessinsider.com/image/59f4c9569361af099935b45c-400/image.jpg", "https://web.archive.org/web/20171030102231im_/https://secure-dcr.imrworldwide.com/cgi-bin/m?ci=alluremedia&cg=0&cc=1&ts=noscript", "https://web.archive.org/web/20171030102231im_/https://static.businessinsider.com/image/59f4c9579361af099935b465-400/image.jpg", "https://web.archive.org/web/20171030102231im_/https://edge.alluremedia.com.au/uploads/businessinsider/2017/04/john-winning-chris-pash-photo-120x90.jpg", "https://web.archive.org/web/20171030102231im_/https://sb.scorecardresearch.com/p?c1=2&c2=13194393&cv=2.0&cj=1", "https://web.archive.org/web/20171030102231im_/https://static.businessinsider.com/image/59f4c9579361af099935b467-400/image.jpg", "https://web.archive.org/web/20171030102231im_/https://static.businessinsider.com/image/59f4c9549361af099935b456-400/image.jpg", "https://web.archive.org/web/20171030102231im_/https://static.businessinsider.com/image/59f4c9549361af099935b455-400/image.jpg", "https://web.archive.org/web/20171030102231im_/https://static.businessinsider.com/image/59f4c9559361af099935b45b-400/image.jpg", "https://web.archive.org/web/20171030102231im_/https://edge.alluremedia.com.au/uploads/businessinsider/2016/03/GettyImages-158774104-120x90.jpg", "https://web.archive.org/web/20171030102231im_/https://static.businessinsider.com/image/59f4c9579361af099935b463-400/image.jpg", "https://web.archive.org/web/20171030102231im_/https://edge.alluremedia.com.au/uploads/businessinsider/2017/05/Birley-suit-120x90.jpg", "https://web.archive.org/web/20171030102231im_/https://static.businessinsider.com/image/59f4c9579361af099935b464-400/image.jpg", "https://web.archive.org/web/20171030102231im_/https://static.businessinsider.com/image/59f4c9569361af099935b45d-400/image.jpg", "https://web.archive.org/web/20171030102231im_/https://static.businessinsider.com/image/59f4c9569361af099935b45f-400/image.jpg", "https://web.archive.org/web/20171030102231im_/https://static.businessinsider.com/image/59f4c9559361af099935b458-400/image.jpg", "https://web.archive.org/web/20171030102231im_/https://static.businessinsider.com/image/59f4c9569361af099935b461-400/image.jpg", "https://web.archive.org/web/20171030102231im_/https://static.businessinsider.com/image/59f4c9559361af099935b459-400/image.jpg", "https://web.archive.org/web/20171030102231im_/https://static.businessinsider.com/image/59f4c9579361af099935b466-400/image.jpg", "https://web.archive.org/web/20171030102231im_/https://edge.alluremedia.com.au/uploads/businessinsider/2017/10/GettyImages-866067742-120x90.jpg", "https://web.archive.org/web/20171030102231im_/https://edge.alluremedia.com.au/assets/bi/img/businessinsider/placeholder.png", "https://web.archive.org/web/20171030102231im_/https://static.businessinsider.com/image/59f4c9559361af099935b45a-400/image.jpg", "https://web.archive.org/web/20171030102231im_/https://static.businessinsider.com/image/59f4c9559361af099935b457-400/image.jpg"], "top_img": "https://web.archive.org/web/20171030102231im_/https://static.businessinsider.com/image/59f4c9549361af099935b453-400/image.jpg", "keywords": [], "authors": ["Kim Renfro"], "canonical_link": "https://web.archive.org/web/20171030102231/https://www.businessinsider.com/stranger-things-2-details-analysis-2017-10", "title": "11 details you might have missed on 'Stranger Things' season 2", "meta_data": {"description": "Warning: Spoilers ahead for the entire second...", "viewport": "width=device-width, initial-scale=1, maximum-scale=1", "publisher": "Business Insider Australia", "apple-mobile-web-app-capable": "yes", "apple-touch-fullscreen": "yes", "application-name": "Business Insider Australia", "msapplication-TileColor": "#185f7c", "msapplication-TileImage": "https://edge.alluremedia.com.au/assets/bi/img/businessinsider/ms_144.png", "msapplication-square70x70logo": "https://edge.alluremedia.com.au/assets/bi/img/businessinsider/ms_70.png", "msapplication-square150x150logo": "https://edge.alluremedia.com.au/assets/bi/img/businessinsider/ms_150.png", "msapplication-wide310x150logo": "https://edge.alluremedia.com.au/assets/bi/img/businessinsider/ms_310_wide.png", "msapplication-square310x310logo": "https://edge.alluremedia.com.au/assets/bi/img/businessinsider/ms_310.png", "msapplication-notification": "frequency=30;polling-uri=http://notifications.buildmypinnedsite.com/?feed=http://www.businessinsider.com.au/feed&id=1;polling-uri2=http://notifications.buildmypinnedsite.com/?feed=http://www.businessinsider.com.au/feed&id=2;polling-uri3=http://notifications.buildmypinnedsite.com/?feed=http://www.businessinsider.com.au/feed&id=3;polling-uri4=http://notifications.buildmypinnedsite.com/?feed=http://www.businessinsider.com.au/feed&id=4;polling-uri5=http://notifications.buildmypinnedsite.com/?feed=http://www.businessinsider.com.au/feed&id=5; cycle=1", "robots": "noarchive", "author": "Kim Renfro", "twitter": {"card": "summary_large_image", "site": "@BIAUS", "title": "11 details you might have missed on 'Stranger Things' season 2", "image": "https://web.archive.org/web/20171030102231im_/https://static.businessinsider.com/image/59f4c9549361af099935b453-400/image.jpg", "description": "Warning: Spoilers ahead for the entire second...", "url": "https://web.archive.org/web/20171030102231im_/https://www.businessinsider.com.au/stranger-things-2-details-analysis-v2-2017-10"}, "og": {"type": "article", "title": "11 details you might have missed on 'Stranger Things' season 2", "site_name": "Business Insider Australia", "image": "https://web.archive.org/web/20171030102231im_/https://static.businessinsider.com/image/59f4c9549361af099935b453-400/image.jpg", "description": "Warning: Spoilers ahead for the entire second...", "url": "https://web.archive.org/web/20171030102231/https://www.businessinsider.com.au/stranger-things-2-details-analysis-v2-2017-10"}, "article": {"published_time": "2017-10-30T09:46:19+11:00"}}, "movies": [], "publish_date": 1509317179.0, "source": "https://web.archive.org", "summary": ""}