{"url": "https://www.thefreelibrary.com/Vision+And+Scarlet+Witch+Kiss+On+%27Avengers%3A+Infinity+War%27.-a0518072665", "text": "Vision And Scarlet Witch Kiss On 'Avengers: Infinity War'.\n\nPage/Link: Page URL: Page URL: HTML link: <a href=\"https://www.thefreelibrary.com/Vision+And+Scarlet+Witch+Kiss+On+%27Avengers%3a+Infinity+War%27.-a0518072665</a> HTML link: Citations: MLA style: \"Vision And Scarlet Witch Kiss On 'Avengers: Infinity War'..\" The Free Library . 2017 IBT Media, formerly dba International Business Times 08 Oct. 2022 \"Vision And Scarlet Witch Kiss On 'Avengers: Infinity War'..\". 2017 IBT Media, formerly dba International Business Times 08 Oct. 2022 https://www.thefreelibrary.com/Vision+And+Scarlet+Witch+Kiss+On+%27Avengers%3a+Infinity+War%27.-a0518072665\n\nChicago style: The Free Library. S.v. Vision And Scarlet Witch Kiss On 'Avengers: Infinity War'..\" Retrieved Oct 08 2022 from The Free Library. S.v. Vision And Scarlet Witch Kiss On 'Avengers: Infinity War'..\" Retrieved Oct 08 2022 from https://www.thefreelibrary.com/Vision+And+Scarlet+Witch+Kiss+On+%27Avengers%3a+Infinity+War%27.-a0518072665\n\nAPA style: Vision And Scarlet Witch Kiss On 'Avengers: Infinity War'.. (n.d.) >The Free Library. (2014). Retrieved Oct 08 2022 from Vision And Scarlet Witch Kiss On 'Avengers: Infinity War'.. (n.d.) >The Free Library. (2014). Retrieved Oct 08 2022 from https://www.thefreelibrary.com/Vision+And+Scarlet+Witch+Kiss+On+%27Avengers%3a+Infinity+War%27.-a0518072665\n\nThe Avengers will return on the big screen in the upcoming film \"Avengers: Infinity War.\" And it looks like Paul Bettany's Vision and Elizabeth Olsen's Scarlet Witch will have an intimate moment in the upcoming movie.\n\n\"Avengers: Infinity War\" may still be over a year away, but the hype about the film is growing. On Tuesday, Bettany and Olsen were spotted filming on set in Edinburgh. In one scene, the pair shared a tender moment, (http://www.eonline.com/news/844613/first-look-paul-bettany-and-elizabeth-olsen-s-characters-kiss-in-marvel-s-avengers-infinity-war) E! News reported.\n\nThe said scene began with Vision using his special powers to open the window curtains. Moments later, Scarlet Witch appeared by his side. The pair gets very close and finally locked lips.\n\n(http://www.ibtimes.com/chris-evans-playing-captain-america-after-avengers-infinity-war-my-contract-2519510) READ: Chris Evans' contract for \"Captain America\" is done after \"Avengers 4\"\n\nAccording to the onlooker, it took about eight to nine times for Bettany, 45, and Olsen, 28, to perfect the scene. Vision and Scarlet Witch's romantic tension began when the former became a sentient in 2016's \"Avengers: Age of Ultron.\" It intensified in 2016's \"Captain America: Civil War\" and the awaited kiss will be witnessed by Marvel fans in the next \"Avengers\" film.\n\n\"Avengers: Infinity War\" will be packed with Marvel characters. Aside from Vision and Scarlet Witch, viewers can expect the return of Hulk (Mark Ruffalo) and Thor (Chris Hemsworth), who were both missing in the \"Civil War.\" Iron Man (Robert Downey Jr.), Captain America (Chris Evans), Black Widow (Scarlet Johansson), Spider-Man (Tom Holland), Doctor Strange (Benedict Cumberbatch) and more will also return in the film.\n\n\"Guardians of the Galaxy\" star Chris Pratt is also joining the film as Star-Lord. The \"Passenger\" actor admitted to (http://www.fandango.com/movie-news/there-will-be-an-avengers-vs-guardians-of-the-galaxy-rivalry-in-infinity-war-752179) Fandango that he was intimidated when he saw Hemsworth on the set. \"I was a little secretly intimidated. Chris Hemsworth, he's so tall and handsome -- I had to go home and really look myself in the mirror.\"\n\nMeanwhile, Holland also shared his excitement in joining the \"Avengers\" franchise. According to the \"Spider-Man\" star, the experience was \"mind-blowing.\" In this clip from Marvel's official (https://twitter.com/Marvel/status/830233501123358720) Twitter account, he recalled watching the first \"Avengers\" film with friends and he couldn't believe that he is now joining the movie.\n\n\"Avengers: Infinity War\" hits the big screen on May 4, 2018.", "images": ["https://www.thefreelibrary.com/_/static/Online-Library.gif", "https://www.thefreelibrary.com/_/static/ico_link.gif", "https://www.thefreelibrary.com/_/static/ico_print.gif", "https://www.thefreelibrary.com/_/static/ico_feedback.gif", "https://www.thefreelibrary.com/_/static/ico_email.gif"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "https://www.thefreelibrary.com/Vision+And+Scarlet+Witch+Kiss+On+%27Avengers%3a+Infinity+War%27.-a0518072665", "title": "Vision And Scarlet Witch Kiss On 'Avengers: Infinity War'.", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "description": "Free Online Library: Vision And Scarlet Witch Kiss On 'Avengers: Infinity War'. by \"International Business Times - US ed.\";  Business, international News, opinion and commentary Motion pictures Movies"}, "movies": [], "publish_date": null, "source": "https://www.thefreelibrary.com", "summary": ""}