{"url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DeadArtistsAreBetter", "text": "http://tvtropes.org/pmwiki/pmwiki.php/Main/DeadArtistsAreBetter\n\nnote James Ensor, The Painting Skeleton ...not quite what we meant.\n\n— Thiessen's Law of Art \"The overwhelming prerequisite for the greatness of an artist is that artist's death.\"\n\nAdvertisement:\n\nThe vast majority of shows that mention paintings will mention this trope at one point: Artists are never recognized until after they're dead. Though this has happened in many cases, there have also been a lot of painters, modern and classic, that have been recognized while still alive. Nor has the deceased been recognized immediately after his corpse hits the ground, as it seems to happen when this trope is in effect. (Historically, this has affected composers and writers far less than people assume. Shakespeare was successful during his lifetime, so was Beethoven. It stands to reason - only a few people would continue doing something for a long time without some kind of success. This is glaringly obvious for composers - of the top tier, only Bach and Tchaikovsky comes even remotely close to this trope, and they were still far from starving during their lifetimes.)\n\nAdvertisement:\n\nIn theory, the idea that dead artists are better may result from them dying at their peak: they don't have the time to taint their earlier successes with an Audience-Alienating Era of divisive later works that fail to live up to the masterpieces (whether through being too different or more of the same). The artist's death also introduces scarcity, as it means there will definitely not be any more works produced by the artist, making existing ones more precious.\n\nIn 99% of the cases where this trope is mentioned, one character, either the artist or an associate, will come up with the \"brilliant\" idea of spreading rumors of the artist's death, which immediately causes said artist's work to magically get the recognition that eluded it all these years. Of course, something inevitably goes wrong, the artist is found to be alive, and the status quo is restored. For some reason, fraud accusations are seldom made.\n\nAdvertisement:\n\nThe modern-day sentiment is probably \"Dead Musicians Are Better\", music being arguably the second-most personal media form. Technology has also amplified this trope's effects, with streams of a freshly-deceased artist's songs skyrocketing and social media making people's opinions more apparent. (2016 was a good year-long example.)\n\nSee also Vindicated by History, True Art Is Ancient, and Short-Lived, Big Impact. When a musician's death or departure leads to their group doing better than before, it's an aversion of The Band Minus the Face. When a dead artist is celebrated (through song), it's a Celebrity Elegy. Such celebrities are good candidates to hang out in heaven. Many examples below also fall under Never Speak Ill of the Dead, in that some artists who became greatly celebrated after their death lived miserable and/or ridiculed lives before dying. Compare Posthumous Popularity Potential, which entails real-life artists seeing a boost in popularity/recognition after their death.\n\nAs a Death Trope, all Spoilers will be unmarked ahead. Beware.\n\nExamples:\n\nopen/close all folders\n\nAnime & Manga\n\nThis trope is discussed in Case Closed. In Conan and Kaito Kid's first encounter, Kaito Kid suggests thieves are creative artists while detectives are merely art critics. Later in the case, as Conan attempts to unmask Kaito Kid's disguise: Conan Edogawa : Most talented artists gain fame only after death. I'll make you a renowned master, Kaito Kid... by burying you in a cemetery called prison .\n\nThe plot device with a faked death skyrocketing popularity and recognition is used in Galaxy Angel almost perfectly, although with a military officer instead of an artist. A similar thing happens in Cannon God Exaxxion, though in this case the people playing up the war hero's death actually believed he was dead at first. When it turns out he wasn't, rather than admitting their mistake, they decide to make it come true.\n\nIn Mega Man Star Force, Hyde is under the impression that people will not love his grim, macabre works of art until after he dies. This is a motive for his villainy in the first place, as he tries to find Mu to become immortal so that he may live to see people appreciate him. When this doesn't seem to be working out, he starts an art class for children to get them to appreciate the art when they grow older, but they all ignore him and simply come for the free food. Free food provided by Luna Platz at that, who is perhaps is his sole earnest student.\n\nIn one chapter of Pet Shop of Horrors, a has-been actor whose only success was a small role in a cult-classic sci-fi film dies of suicide by basilisk. At his funeral, people are already starting to speak of him as if he were a great actor whose immense talent was too quickly robbed from the world.\n\nManjimutt from Yo-Kai Watch uses this as an excuse for why he has no friends. It should be noted Manjimutt is already dead and is not even an actual artist. Manjimutt: The snowflakes are my only friends. Artists are never appreciated in their lifetime.\n\nComic Books\n\nIn the Doctor Who comic strip \"Interstellar Overdrive 2\" in Doctor Who Magazine, the manager of a band plans to kill them all in a spaceship 'accident' so the record company can make a fortune reissuing new editions of their back catalogue.\n\nIn Adventure Time: Marceline Gone Adrift, an evil hipster takes advantage of Marceline's apparent death to appoint himself the keeper of her memory, produce unauthorised merch, and eventually loot her house for memorabilia.\n\nIn MAD, in one Melvin and Jenkins feature, Melvin pockets a terminally ill boy's art, hoping that it will increase in value once the kid dies.\n\nComic Strips\n\nThe New Yorker once ran a cartoon with a well-off couple asking a street artist \"And how much more would this be worth if you died?\"\n\nFan Works\n\nIn The Horror! The Horror! Nicolas and Perenelle Flamel, having changed their names and professions after the Philosopher's Stone was (supposedly) destroyed, discuss doing it again in the hope of finding better ones than they currently have. Nicolas: Famous artist?\n\nPerenelle: Maybe, but you'd have to die before your paintings would be worth anything.\n\nNicolas: Famous artist?Maybe, but you'd have to die before your paintings would be worth anything. Done it before. We could do it again.\n\nNicolas and Perenelle Flamel, having changed their names and professions after the Philosopher's Stone was (supposedly) destroyed, discuss doing it again in the hope of finding better ones than they currently have. In No Competition Ally consoles an eight-year-old Harry for his poor grade in art. Ally: No artist is truly famous unless they are dead, so it scarcely matters while you're alive.\n\nAlly consoles an eight-year-old Harry for his poor grade in art. In Claro de Luna it's mentioned that the famous cellist Colccherini wasn't well-recognized until after his death. This also foreshadows Octavia's own fate, as her lover Luna immortalizes her in history after her death.\n\nFilms — Live-Action\n\nThe movie Pauly Shore is Dead shamelessly parodies this trope.\n\nThis trope is the subject of the song performed in the opening sequence of Phantom of the Paradise.\n\nRobin Williams' son in World's Greatest Dad is a terrible person in life, but Robin takes advantage of his death to sell his own book, disguised as a journal the son wrote before death.\n\nTitanic (1997): \"It's a pity we couldn't hold on to that drawing. It'll be worth a lot more in the morning.\" Ironically, he's kind of right — the painting is found in a safe and restored, and given that it's a memento that was brought up from the Titanic it's now a priceless historical artefact. And the artist dies in the sinking, so bonus.\n\nIn She's All That, two girls in Lani's art class compliment her on how wonderful her paintings are. She thinks it's a genuine compliment until they suggest she invoke this trope and \"off herself\" as all the greats did.\n\nThe trope is the whole plot of the '60s movie The Art Of Love, which has Dick Van Dyke staging his own death to increase the value of his paintings.\n\nDiscussed in Die Another Day. Jinx is meeting with a surgeon on the Cuban island, discussing a drastic procedure to change her looks. He says that he considers himself an artist, and she remarks that most great artists aren't celebrated until after their deaths, upon which she shoots him.\n\nIn Bring Me the Head of Mavis Davis, a struggling record producer plots to invoke this trope by murdering his one remaining artist in order to boost flagging sales of her work. It... doesn't go according to plan.\n\nLiterature\n\nLive-Action TV\n\nMusic\n\nBill Drummond (later a member of The KLF) wrote a song that appeared on his solo album The Man dealing with just this. The title: \"Julian Cope Is Dead\". During the song, Julian Cope dies in order to make his band, The Teardrop Explodes, famous. Bill used to be the manager of the band and the song is a parody of Cope's own solo song \"Bill Drummond Said\". Drummond's frustration with the music industry (and Cope in particular) is quite well known.\n\nThe Dire Straits song \"In the Gallery\" relates the story of an artist driven to create but never gaining recognition, until... \"I've got to say he passed away in obscurity / And now all the vultures are coming down from the tree / So he's going to be in the gallery\"\n\nThe title of the Nightwish song \"Kuolema Tekee Taiteilijan\" translates to \"Death Makes an Artist\". They also have \"The Poet and the Pendulum\", which is basically a 14-minute Epic Rocking song about Tuomas dying, which was written by Tuomas himself.\n\nThe whole point of \"Self Suicide\" by Goldie Lookin Chain, the band sing about killing themselves to improve record sales and say how it worked for other celebrities.\n\nby Goldie Lookin Chain, the band sing about killing themselves to improve record sales and say how it worked for other celebrities. \"Schneller Leben\" (Live Faster) by German punk band Die Ärzte is all about parodying this trope.\n\n(Kurt Cobain knew, with age comes loss of face. What do you think Jesus Christ died so young? Jimi Hendrix and Bruce Lee, they never got to grow old. Learn from these great examples, everyone likes you as a corpse.) \"Kurt Cobain hat es gewusst, im alter droht Gesichtsverlust. Was glaubst du warum Jesu Christ, schon so jung gestorben ist. Jimi Hendrix und Bruce Lee , alt geworden sind die nie. Lern von diesen Vorbildern, als Leiche hat dich jeder gern.\"(Kurt Cobain knew, with age comes loss of face. What do you think Jesus Christ died so young? Jimi Hendrix and Bruce Lee, they never got to grow old. Learn from these great examples, everyone likes you as a corpse.)\n\nThe Smiths song \"Paint A Vulgar Picture\" is about the record industry's tendency to do this with dead musicians. At the record company meeting, on their hands a dead star.\n\nThe Christian Rock band Dead Artist's Syndrome is named for this trope.\n\nMentioned in \"If I Die Young\" by The Band Perry: \"Penny for my thoughts? Oh no, I'll sell them for a dollar / They're worth so much more now that I'm a goner / Maybe then you'll hear the words I've been singin' / Funny when you're dead, that's when people start listenin'\"\n\n\"Fake My Own Death and Go Platinum\" by Psychostick. Well you see, I wanna sell a million records / But my music sucks so what am I to do? / They say an artist is appreciated after he's dead / I have no talent, but I bet that it's still true. / The lyrics all suck / and the chords are too funky / We're on a major label cuz / we're just plain lucky / We sold 4 albums to our own mothers / we have a few supporters / (but there aren't many others ) / What if I could live / When they all would think I'm dead / Oh just what if I could have me a cake / and eat it too? / I'd be set for life / No more struggles, no more strife / Let the money do the talking / I'm a dead man walking.\n\nThe Twenty One Pilots song \"Neon Gravestones\" is about how we should stop doing this, especially in regards to romanticizing an artist's suicide.\n\nRadio\n\nInvoked in The Goon Show episode \"Tales of Montmartre:\" Gauguin: You can keep my paintings.\n\nToulouse-Lautrec: What good are they?\n\nGauguin: Nothing now, they'll be worth a fortune after I'm dead.\n\nToulouse-Lautrec: After you're dead... [GUNSHOT] I'm rich! You can keep my paintings.What good are they?Nothing now, they'll be worth a fortune after I'm dead.After you're dead... [GUNSHOT] I'm rich!\n\nThe Hotblack Desiato story arc in The Hitch Hikers Guide To The Galaxy has the universe-famous rock star spend a year dead for \"tax reasons\". It doesn't do his music sales any harm, either.\n\nTheatre\n\nTimberlake Wertenbaker's play Three Birds Alighting on a Field invokes this trope repeatedly. One scene has an art dealer discussing the disappointing sales of a particular painter. The artist had died young, which the dealer mentions as a \"good thing, from a marketing point of view\".\n\nA discovered play by Mark Twain, Is He Dead?, is based on the short story described above with a smattering of Attractive Bent-Gender and some rather funny Melodrama.\n\nIn Pippin, the title character tries to succeed at life by taking up art, only to discover that \"you got to be dead to you find out if you were any good.\"\n\nVideo Games\n\nVisual Novels\n\nThis forms part of the plot of the Visual Novel Hotel Dusk: Room 215 for the Nintendo DS; an artist who is very much alive and his partner had been exploiting this effect, getting high prices for the artist's paintings by making up a dead artist named \"Osterzone\" and saying that Osterzone was the one who painted them.\n\nWeb Comics\n\nWeb Original\n\nThis shirt explains it rather bluntly.\n\nWestern Animation", "images": ["https://tvtropes.org/images/logo-white-big.png", "https://static.tvtropes.org/pmwiki/pub/external_link.gif", "https://tvtropes.org/images/play-button-logo.png", "https://static.tvtropes.org/pmwiki/pub/images/dead_artist_3067.png", "https://pixel.quantserve.com/pixel/p-mEzuYq24VEJ-3.gif"], "top_img": "https://static.tvtropes.org/pmwiki/pub/images/dead_artist_3067.png", "keywords": [], "authors": [], "canonical_link": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DeadArtistsAreBetter", "title": "Dead Artists Are Better", "meta_data": {"description": "The Dead Artists Are Better trope as used in popular culture. The vast majority of shows that mention paintings will mention this trope at one point: Artists …", "twitter": {"card": "summary_large_image", "site": "@tvtropes", "owner": "@tvtropes", "title": "Dead Artists Are Better - TV Tropes", "description": "The Dead Artists Are Better trope as used in popular culture. The vast majority of shows that mention paintings will mention this trope at one point: Artists …", "image": {"src": "https://static.tvtropes.org/pmwiki/pub/images/dead_artist_3067.png"}}, "og": {"site_name": "TV Tropes", "locale": "en_US", "title": "Dead Artists Are Better - TV Tropes", "type": "website", "url": "https://tvtropes.org/pmwiki/pmwiki.php/Main/DeadArtistsAreBetter", "image": "https://static.tvtropes.org/pmwiki/pub/images/dead_artist_3067.png", "description": "The vast majority of shows that mention paintings will mention this trope at one point: Artists are never recognized until after they're dead. Though this has happened in many cases, there have also been a lot of painters, modern and classic, …"}, "article": {"publisher": "https://www.facebook.com/tvtropes"}, "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": null, "source": "https://tvtropes.org", "summary": ""}