{"url": "https://www.wordstream.com/blog/ws/2016/10/19/get-more-instagram-followers", "text": "Things that increase dopamine in the brain:\n\n-Exercise\n\n-Turmeric.\n\n-Leafy greens.\n\n-Getting more followers on Instagram.\n\nAm I right?\n\nBut in all seriousness, growing your Instagram following can help you to raise brand awareness, build relationships, and get more customers to your business. So in this guide, I’m going to share with you 22 free ways (and one paid) to get more followers on Instagram—quality followers, that is.\n\nTable of contents\n\nThe 23 ways to get more followers in this post are broken into the following sections:\n\nHow to get more followers on Instagram: the bio basics\n\nIf you want to get more traffic to your Instagram bio and more followers out of it, you need to treat it like a landing page and optimize it. Here’s how to do it.\n\n1. Give people a reason to follow you\n\nInstead of (or in addition to) just putting your credentials, slogan, or value proposition in your Instagram bio, give potential followers a clear picture of what they can expect if they follow you. For example:\n\nFollow for dog training tips; prepare for cuteness overload.\n\nFollow me if you’re into, you know, securing your financial future and binary options.\n\nYour go-to for quick marketing tips and brilliant, original memes.\n\nCooking tips for the cullinarily challenged.\n\n2. Pick the right handle\n\nFirst thing’s first, make sure your Instagram handle is as close to your business name and to your other social media handles as possible. This ensures your account will be easy to remember, find, and recognize.\n\n3. Make sure it’s a business profile\n\nAn Instagram business profile gives you access to analytics that will show you who your followers are, what content they like best, and whether you’re gaining or losing them. If you haven’t made the switch, go to the hamburger in the top right of your bio, tap Settings, then tap Switch to Professional Account. Select your category, provide your business details, and you’ll be good to go.\n\n4. Nix the boring bio link\n\nThis is prime Instagram real estate. Do you really want it to link to your homepage? Yawn. The best Instagram bios change their bio link up at least bi-weekly and send people to new or popular content, promo codes, landing pages, and more.\n\nBetter yet, you could use an app like Linktree to share multiple links to value-add destinations like website pages, blog posts, deals, and more.\n\nAn effective link tree can show your value and win over followers.\n\n5. Focus on quality followers\n\nThere are a billion Instagram users (literally). But do you want disengaged onlookers who breathe no life into your account? Fickle followers that unfollow just as quickly? Didn’t think so. You want followers who:\n\nComment on, like, and share your posts.\n\nAppreciate your content and give you a sense of purpose.\n\nConvert into leads and customers.\n\nHelp you to get more great followers.\n\nIf Instagram followers are candy, you’re not trying to break open a pinata and pounce. You’re looking to curate a box of fine chocolates and cultivate a community.\n\nHow to get more Instagram followers with your content\n\nNow that your profile is optimized for fruitful and fabulous followership, it’s time to start attracting more people to it. Here’s how to use content and creativity to get more Instagram followers.\n\n6. Make use of all the formats\n\nOne thing that distinguishes Instagram from other popular social media platforms is its different formats. These keep the user’s attention and allow you to show different aspects of your brand. So take advantage of:\n\nThe more facets of your business a person can get familiar with, the more likely they are to develop an affinity for and follow you. Not sure what to do with all those formats? You can get more ideas on what to post on Instagram here.\n\n7. Publish great content—consistently\n\nThis is paramount to your entire social media marketing strategy—not just Instagram. The great content part goes without saying, but the consistency part often gets overlooked. One great post might win you a follow, but now you’re in the spotlight. They’re seeing your content regularly and if you can’t continue delivering what brought them in in the first place, you’ll get the unfollow. So, what makes great content on Instagram?\n\nUseful: relevant to your industry and your audience’s needs. Tips, facts, news, ideas.\n\nrelevant to your industry and your audience’s needs. Tips, facts, news, ideas. Thoughtful: speaks to their values, lifestyles, and personalities.\n\nspeaks to their values, lifestyles, and personalities. Interactive: makes you fun to follow! Polls, questions, Lives, contests, shareable content.\n\nmakes you fun to follow! Polls, questions, Lives, contests, shareable content. Entertaining: captures and keeps attention. Attractive design, movement, emotion, humor, video, boldness.\n\nIn Mailchimp’s account below, we see a beautiful mix of posts that cover it all: useful how-tos, thoughtful customer spotlights and a small business support campaign, an interactive post on personal development, and an entertaining video with DJ Khaled.\n\n8. Focus on entertainment\n\nThe entertainment factor is increasingly important. Last summer, when Instagram revealed how its algorithm works, it stated it was shifting focus to “full screen, immersive, entertaining, mobile-first video” content. Entertaining content doesn’t have to be action-packed or hilarious. It just needs to be interesting. Creative. Original. Expressive. You can get tips on how to make captivating Instagram videos here.\n\n9. Do your Instagram SEO\n\nSEO isn’t just about getting more Google searchers to your website. Social media platforms are search engines too, and Instagram’s search feature now supports regular keyword searches—not just account or hashtag searches. This has made Instagram SEO even more important now so be sure to:\n\nTarget keywords with your captions and bio\n\nAdd your location to Instagram\n\nAdd alt text to images\n\n10. Cross-promote your account\n\nOne of the best ways to promote your Instagram account is to cross-promote. Put links to your social profiles in your website footer, email templates, and signatures. Print out your handle name and put it in a cute frame in your office. Tell your Facebook page visitors where they can find you on Insta. Cross-promote your branded hashtag, too—on your receipts, in print ads, and at relevant events.\n\nDon’t just assume people will find your Instagram account or hashtag. Direct them to it.\n\n11. Develop your own Instagram style\n\nThe beauty of design is that there are infinitely many ways to be unique. Choose a style that is distinctly yours so that your posts can be instantly recognizable in the newsfeed. Users follow accounts whose content they can experience, not just see. Oatly is a great example of this:\n\nTo develop your own style, make sure you have your overall brand developed. Your positioning, voice, brand colors, audience, and offerings will all play into your Instagram aesthetic.\n\n12. Write good captions\n\nThe image may be the focal point of a post, but your Instagram caption can sometimes make or break its impact on your potential followers. What makes a good caption? Originality. What makes something original?\n\nWit\n\nHumor\n\nInspiration\n\nMeaningful stories\n\nSelf-deprecation\n\nRelatability\n\nStorytelling\n\nIntrigue\n\nFor example, National Geographic is fantastic at using storytelling alongside their Instagram photos to generate engagement and sharing. Whatever you choose, try to stick with that style so your followers stick with you.\n\nThere are endless opportunities for originality. Stay away from generic wallpaper captions and paint something that pops. Here are some lists to help you out:\n\n13. Run Instagram giveaways\n\nThese are perhaps the quintessential Instagram follower magnet. First of all, who doesn’t like free stuff or award recognition? Knowing that you run these regularly is sure to get a follow. Second, entry into the contest itself can require following you or tagging a friend. Just make sure the prize is something that is appealing specifically to your ideal customers. Remember, you want to attract a quality following.\n\nAnd would ya look at that. We’ve got just the post for you >> How to Use Instagram Giveaways to Grow Your Following\n\n14. Get local\n\nYour Instagram marketing strategy should seek to gain followers through content that resonates not just with your ideal customers, but also with your local geographic community. People are immediately drawn to things they’re familiar with and like to see parts of their identity represented online. Here are some ways to do it:\n\nPost pictures and videos featuring local landmarks and mainstays.\n\nShare news and niche recommendations.\n\nGet in on local events. Search your town or city, then tap “places” in search results to see what’s going on.\n\nFor even more local social media marketing ideas and tips, head to the LOCALiQ Social Media Marketing Lab. White coat optional.\n\nHow to get more followers on Instagram through hashtags\n\nHashtags on Instagram serve multiple purposes. They provide information, add humor, categorize posts, and create a web of content that can lead users anywhere. Here’s how to lead them to the follow button on your bio.\n\n15. Use a mix of hashtag types\n\nHashtags on Instagram are like keywords on Google. They can be broad or long-tail, high or low-volume, location-based or universal, and can vary in intent. Allow me to show you:\n\nBroad: #dogsofig\n\nLong-tail: #dogtraining101\n\nLocal: #dogsofsouthie\n\nLow intent: #smartdogs\n\nHigh intent: #dogtrainerboston\n\nEvergreen: #clickertraining\n\nTrending: #valentinedogs\n\nBranded: #chewydogs\n\nThe really specific hashtags are like long-tail keywords that have more intent and help you find the right people, but the broad ones can get you in front of more people in general. You need a mix of bo to grow your following on a platform as massive as Instagram.\n\n16. But don’t take them too seriously\n\nSo the big lists of hashtags you see at the bottom of posts do serve a purpose, but should every one of your posts have that? Not if you want your followers to get sick of seeing them and think you’re desperate. Be selective with your hashtags, vary how many you use in each post, and also have fun with them. Some hashtags are purely aesthetic or added for humor or brand voice. Some have nothing to do with your brand but are just fun.\n\nFor example:\n\n#twothingsthatdontmix\n\n#oneoftheseisnotliketheother\n\n#mylifeinanutshell\n\n#youhadonejob\n\n#neveragain\n\n17. Have an intriguing or actionable branded hashtag\n\nSpeaking of having fun, come up with a follower-friendly branded hashtag. In other words, instead of just using your business name or a behind-the-scenes hashtag, come up with something your followers can use in their posts.\n\nTake UPS’s Instagram account, with their brilliant #upsdogs hashtag. Anyone can contribute! More posts with your hashtag = more exposure = more followers.\n\nHow to get Instagram followers with other users\n\nThere are three types of Instagram users that can help you to get more followers: influencers, your customers and followers, and your competitors. Let’s explore.\n\n18. Go all in on influencer marketing\n\nWe all know that getting mentioned by an influencer can win you a score of followers, but this doesn’t happen overnight. Influencer marketing is a careful strategy. You’ll want to:\n\nResearch. Curate a list of influencers who would be the most realistic to reach out to and the most relevant to your following.\n\nCurate a list of influencers who would be the most realistic to reach out to and the most relevant to your following. Star small. Target smaller accounts and use those relationships to work your way up.\n\nTarget smaller accounts and use those relationships to work your way up. Be genuine. Choose one and thoroughly get to know them for a week or two. Turn on notifications for their posts, explore their content elsewhere on the web, and engage with their account. Take your time and build interest in them—not their followers. Then, when you reach out, your ask can be more appealing and your chances of an ongoing relationship are higher.\n\n19. Encourage user-generated content\n\nAs good as a business may be, its own promotional content will never be as powerful as that of its customers. Enter user-generated content—posts from other users that tag your handle and/or location or mention your business name in the captions or hashtags.\n\nWhether a user sees UGC on your account or someone else’s your credibility gets a lift and your chances of gaining their following are that much higher. Here’s how to encourage more of it:\n\nCome up with a fun-to-use branded hashtag as mentioned above.\n\nMake your location Instagram-friendly with a fun photo opp.\n\nEngage with and repost user-generated content (seven different ways to repost on Instagram here).\n\nRun contests where entrants post a picture of them using your product or service.\n\n20. Analyze your competitors\n\nGot a rival that you just can’t seem to catch up to? Do a little social media competitive analysis and find out what they post, how often, when, and in which formats. Follow them closely for a week so you can catch any nuanced strategies they employ. You just might get ideas on what, how, and the best time to post on Instagram to get more followers.\n\nTools to help you get more Instagram followers\n\nSo by now, you know that to get more followers on Instagram, you need to know your audience, engage with them, and create compelling content. The thing is, you’re probably managing more than one social media account for your business, and the more followers you get, the harder it can be to scale your strategy. Here are some free tools that can help you.\n\n21. Social media management tools\n\nIt might feel like automation is the opposite of genuine engagement, but social media management tools are designed to help you streamline your personalized strategy. With them you can stay on top of conversations, post consistently through scheduling, monitor your competitors, and sometimes get deeper insights than what the native platform offers.\n\n22. Design and photo editing tools\n\nInstagram offers its own set of filters, stickers, stamps, and special effects so your visuals can look their best, but external design and editing tools can help you achieve the unique look you want. Plus, you can templatize things to ensure consistency and make more great content efficiently. My number one recommendation here is Canva, but there are other free tools out there like Afterlight and Facetune.\n\n23. Instagram advertising\n\nThis is the only paid strategy of this post. Organic reach on Instagram has always been considered high. But don’t get too excited, we’re talking 9%. Meaning that your posts will only reach 9% of your full following.\n\nAdvertising, on the other hand, gives you the power to get in front of thousands of relevant users. And in addition to your ad’s CTA button, viewers can also view your bio right from your ad. Now, you shouldn’t advertise just to get more followers, but if the platform is right for you, it’s an added bonus.\n\nHow to get more followers on Instagram for free [recap]\n\nThe secret to getting more quality followers on Instagram that will help your business grow? Patience. It takes time, trial and error, and effort to find your niche and cultivate a community—but it is well worth it. To recap, here are the 23 best ways to get more Instagram followers:", "images": ["https://www.wordstream.com/wp-content/uploads/2021/09/tool-2.png.webp", "https://www.wordstream.com/wp-content/uploads/2022/08/ws-megamenu-ppc101-orange.png", "https://www.wordstream.com/wp-content/uploads/2021/07/847A4934-scaled.jpg.webp", "https://www.wordstream.com/wp-content/uploads/2022/02/how-to-get-more-followers-on-instagram-mailchimp-great-content.png", "https://www.wordstream.com/wp-content/uploads/2021/12/WS-Mega-Menu-Promo-Google-Ads-Grader.png.webp", "https://www.wordstream.com/wp-content/uploads/2022/02/how-to-get-more-followers-on-instagram-ups-dogs.png", "https://www.wordstream.com/wp-content/uploads/2022/06/ws-free-keyword-tool-image.png", "https://www.wordstream.com/wp-content/uploads/2022/02/paid-media-strategy-chess-feature.jpg", "https://www.wordstream.com/wp-content/uploads/2021/09/tool-5.png.webp", "https://www.wordstream.com/wp-content/uploads/2022/09/sprout-feature.jpg", "https://www.wordstream.com/wp-content/uploads/2022/02/how-to-get-more-followers-on-instagram-oatly-visual-identity.png", "https://www.wordstream.com/wp-content/uploads/2022/02/how-to-get-more-instagram-followers-ducklings-feature.jpg", "https://www.wordstream.com/wp-content/uploads/2022/07/social-media-advertising-channels-feature.jpg", "https://www.wordstream.com/wp-content/uploads/2021/05/logo-1.svg", "https://www.wordstream.com/wp-content/uploads/2021/12/ws-bottom-rail-marketing-with-emotion.png.webp", "https://www.wordstream.com/wp-content/uploads/2021/11/logo-1-light.svg", "https://www.wordstream.com/wp-content/uploads/2022/02/ws-liq-new-website-grader-mega-menu-offer.png", "https://www.wordstream.com/wp-content/uploads/2022/02/how-to-get-more-followers-on-instagram-dog-smiling-meme.png", "https://www.wordstream.com/wp-content/uploads/2022/08/facebook-audience-targeting-workarounds-pylon.jpg", "https://www.wordstream.com/wp-content/uploads/2022/02/how-to-get-more-instagram-followers-instagram-alt-text.png", "https://www.wordstream.com/wp-content/uploads/2021/09/tool-3-e1638737159414.png.webp", "https://www.wordstream.com/wp-content/uploads/2021/09/tool-1.png.webp", "https://www.wordstream.com/wp-content/uploads/2022/02/how-to-get-more-followers-on-instagram-organic-reach.png", "https://www.wordstream.com/wp-content/uploads/2022/02/how-to-get-more-instagram-followers-natgeo-captions.png", "https://www.wordstream.com/wp-content/uploads/2022/09/best-time-to-post-on-facebook-sundail-feature.jpg", "https://www.wordstream.com/wp-content/uploads/2022/02/how-to-get-more-instagram-followers-linktree-example-expedia.png", "https://www.wordstream.com/wp-content/uploads/2021/12/WS-Menu-Promo-LIQ-Assess.png.webp", "https://www.wordstream.com/wp-content/uploads/2022/08/labor-day-captions-for-instagram-feature.jpg", "https://www.wordstream.com/wp-content/uploads/2022/02/how-to-get-more-instagram-followers-local-search.jpeg", "https://www.wordstream.com/wp-content/uploads/2022/06/facebook-fundamentals-tips-sidebar.png", "https://www.wordstream.com/wp-content/uploads/2022/02/how-to-get-more-instagram-followers-reason-to-follow-rover.png", "https://www.wordstream.com/wp-content/uploads/2022/02/how-to-get-more-followers-on-instagram-warby-parker-user-generated-content.png"], "top_img": "https://www.wordstream.com/wp-content/uploads/2022/02/how-to-get-more-instagram-followers-ducklings-feature.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.wordstream.com/blog/ws/get-more-instagram-followers", "title": "23 Ways to Get More Followers on Instagram [Updated for 2022]", "meta_data": {"robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Updated for 2022! Learn how to get more followers on Instagram with your bio, content, hashtags, influencers, and more!", "og": {"locale": "en_US", "type": "article", "title": "23 Ways to Get More Followers on Instagram [Updated for 2022]", "description": "Updated for 2022! Learn how to get more followers on Instagram with your bio, content, hashtags, influencers, and more!", "url": "https://www.wordstream.com/blog/ws/get-more-instagram-followers", "site_name": "WordStream", "image": {"identifier": "https://www.wordstream.com/wp-content/uploads/2022/02/how-to-get-more-instagram-followers-ducklings-feature.jpg", "width": 701, "height": 507}}, "article": {"modified_time": "2022-06-03T19:25:43+00:00"}, "twitter": {"card": "summary_large_image", "label1": "Written by", "data1": "Kristen McCormick", "label2": "Est. reading time", "data2": "14 minutes"}, "generator": "WordPress 5.8.2", "viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0", "msapplication-TileImage": "https://www.wordstream.com/wp-content/uploads/2021/12/cropped-WS-Favicon-2-270x270.png"}, "movies": [], "publish_date": 1476831600.0, "source": "https://www.wordstream.com", "summary": ""}