{"url": "https://en.wikipedia.org/wiki/Dancing_with_the_Stars_(U.S._season_26)", "text": "Season of television series\n\nSeason twenty-six of Dancing with the Stars, titled Dancing with the Stars: Athletes, premiered on April 30, 2018, on the ABC network. The four-week season, the shortest ever, featured a cast of current and former athletes.[1]\n\nOn May 21, Olympic figure skater Adam Rippon and Jenna Johnson were crowned the champions, while Washington Redskins cornerback Josh Norman and Sharna Burgess, and former Olympic figure skater Tonya Harding and Sasha Farber, were both announced as runners-up during the live finale. It was later revealed that Josh and Sharna had placed second, while Tonya and Sasha had placed third.[2]\n\nCast [ edit ]\n\nCouples [ edit ]\n\nThe professional dancers were announced on April 12, 2018.[3] The eight professionals returning from last season were Lindsay Arnold, Alan Bersten, Sharna Burgess, Witney Carson, Artem Chigvintsev, Keo Motsepe, Gleb Savchenko, and Emma Slater. The two remaining professional dancers were both in the troupe last season, and had previously been professional dancers on the show: Sasha Farber and Jenna Johnson. The dance troupe for season 26 consisted of Artur Adamski, Brandon Armstrong, Hayley Erbert, and Britt Stewart. Additionally, professional dancer Morgan Larson, who performed on the Dancing with the Stars: Light Up the Night tour, joined the troupe for season 26.\n\nThe cast was announced on April 13 on Good Morning America.[4]\n\nCelebrity Notability (known for) Professional partner Status Ref. Olympic snowboarder Eliminated 1st\n\non April 30, 2018 [5] MLB outfielder NBA center Eliminated 3rd\n\non May 7, 2018 [6] Women's basketball player Olympic softball pitcher Eliminated 5th\n\non May 14, 2018 [7] Olympic luger Olympic figure skater Alan Bersten Olympic figure skater Third place\n\non May 21, 2018 [8] NFL cornerback Runners-up\n\non May 21, 2018 Olympic figure skater Winners\n\non May 21, 2018\n\nHosts and judges [ edit ]\n\nTom Bergeron and Erin Andrews returned as hosts, while Carrie Ann Inaba, Len Goodman, and Bruno Tonioli returned as judges.[9] On May 7, season 24 champion Rashad Jennings returned as a guest judge, and on May 14, runner-up David Ross did as well.[6][7]\n\nScoring charts [ edit ]\n\nThe highest score each week is indicated in underlined green . The lowest score each week is indicated in italicized red.\n\nCouple Place 1 2 3 4 Adam & Jenna 1 24 [2] 37 + 37 = 74 [2] 39 +2= 41 [2] 30 + 28 = 58 [2][3] Josh & Sharna 2 24 [2] 30+ 33 =63 36+2=38 27+ 30 =57[2][4] Tonya & Sasha 3 23 33+ 33 =66 33+2=35 26 + 30 = 56 [1][5] Jennie & Keo 4 21 26 + 37 =63 29 [1][6] Chris & Witney 21 33+ 33 =66 33[6] Mirai & Alan 23 37 + 37 = 74 [2] 35[6] Kareem & Lindsay 7 17 [1] 26 + 33 = 59 [1][6] Arike & Gleb 20 33+ 37 =70[6] Jamie & Artem 9 19[6] Johnny & Emma 18[6]\n\nNotes\n\nHighest and lowest scoring performances [ edit ]\n\nThe best and worst performances in each dance according to the judges' 30-point scale are as follows. Scores by guest judges are excluded.\n\nDance Highest scored\n\ndancer(s) Highest\n\nscore Lowest scored\n\ndancer(s) Lowest\n\nscore Cha-cha-cha Josh Norman\n\nAdam Rippon 24 Kareem Abdul-Jabbar 17 Contemporary Adam Rippon 29 Josh Norman 27 Foxtrot Mirai Nagasu\n\nJosh Norman 27 Johnny Damon 18 Freestyle Tonya Harding\n\nJosh Norman 30 Adam Rippon 28 Jazz Adam Rippon 30 Paso doble Josh Norman 23 Quickstep Adam Rippon 28 Tonya Harding 24 Rumba Tonya Harding 24 Salsa Mirai Nagasu 23 Kareem Abdul-Jabbar 19 Viennese waltz Tonya Harding 26 Jamie Anderson 19\n\nCouples' highest and lowest scoring dances [ edit ]\n\nScores are based upon a potential 30-point maximum. Team dances and scores from guest judges are excluded.\n\nCouple Highest scoring dance(s) Lowest scoring dance(s) Adam & Jenna Jazz (30) Cha-cha-cha (24) Josh & Sharna Freestyle (30) Paso doble (23) Tonya & Sasha Freestyle (30) Foxtrot (23) Jennie & Keo Foxtrot & Viennese waltz (21) Cha-cha-cha (19) Chris & Witney Viennese waltz (25) Salsa (21) Mirai & Alan Foxtrot (27) Salsa (23) Kareem & Lindsay Salsa (19) Cha-cha-cha (17) Arike & Gleb Foxtrot (24) Salsa (20) Jamie & Artem Viennese waltz (19) Johnny & Emma Foxtrot (18)\n\nWeekly scores [ edit ]\n\nIndividual judges' scores in the charts below (given in parentheses) are listed in this order from left to right: Carrie Ann Inaba, Len Goodman, Bruno Tonioli.\n\nWeek 1: First Dances [ edit ]\n\nThe couples danced the cha-cha-cha, foxtrot, salsa or Viennese waltz. Couples are listed in the order they performed.\n\nFor the first time in the show's history, viewers were able to vote for the couples online so that the results of the vote could be used to determine the first two eliminations that same evening.\n\nWeek 2: Team Dance Night [ edit ]\n\nIndividual judges' scores in the chart below (given in parentheses) are listed in this order from left to right: Carrie Ann Inaba, Rashad Jennings, Len Goodman, Bruno Tonioli.\n\nThe couples performed one unlearned dance and a team dance celebrating an iconic decade in sports. The paso doble and quickstep were introduced. Couples are listed in the order they performed.\n\nWeek 3: MVP Night (Semifinals) [ edit ]\n\nIndividual judges' scores in the chart below (given in parentheses) are listed in this order from left to right: Carrie Ann Inaba, David Ross, Len Goodman, Bruno Tonioli.\n\nThe couples performed one unlearned dance dedicated to the \"MVP\" in their lives, and participated in paired dance-offs for extra points. Contemporary, jive, and rumba were introduced. Former contestants were brought in to mentor the couples for the dance-offs. Couples are listed in the order they performed.\n\n^ Tonya & Sasha received votes from Carrie Ann, Len, and Bruno. ^ Jennie & Keo received a vote from guest judge David Ross, plus the public vote (60%). ^ Adam & Jenna received votes from Carrie Ann and Bruno, plus the public vote (64%). ^ Mirai & Alan received votes from David and Len. ^ Josh & Sharna received votes from David, Len, and Bruno. ^ Chris & Witney received a vote from Carrie Ann, plus the public vote (55%).\n\nWeek 4: Finals [ edit ]\n\nThe final three couples performed one unlearned dance inspired by their journey on the show and a freestyle. Jazz was introduced. Couples are listed in the order they performed.\n\nDance chart [ edit ]\n\nThe celebrities and professional partners danced one of these routines for each corresponding week:\n\nWeek 1 (First Dances): One unlearned dance\n\nWeek 2 (Team Dance Night): One unlearned dance & team dance\n\nWeek 3 (MVP Night; Semifinals): One unlearned dance & ballroom battles\n\nWeek 4 (Finals): One unlearned dance & freestyle\n\nCouple 1 2 3 4 Adam & Jenna Cha-cha-cha[a] Quickstep[a] Team Freestyle[a] Contemporary[a] Jive[c] Jazz[a] Freestyle[b] Josh & Sharna Cha-cha-cha[a] Paso doble Team Freestyle[b] Contemporary Salsa[c] Foxtrot Freestyle[a] Tonya & Sasha Foxtrot Quickstep Team Freestyle[b] Rumba Cha-cha-cha[c] Viennese waltz[b] Freestyle[a] Jennie & Keo Foxtrot Cha-cha-cha[b] Team Freestyle[a] Viennese waltz[b] Cha-cha-cha[d] Chris & Witney Salsa Viennese waltz Team Freestyle[b] Foxtrot Salsa[d] Mirai & Alan Salsa Foxtrot[a] Team Freestyle[a] Quickstep Jive[d] Kareem & Lindsay Cha-cha-cha[b] Salsa[b] Team Freestyle[b] Arike & Gleb Salsa Foxtrot Team Freestyle[a] Jamie & Artem Viennese waltz Johnny & Emma Foxtrot\n\nNotes\n\n^Note A This was the highest scoring dance of the week.\n\nThis was the highest scoring dance of the week. ^Note B This was the lowest scoring dance of the week.\n\nThis was the lowest scoring dance of the week. ^Note C This couple gained bonus points for winning this dance-off.\n\nThis couple gained bonus points for winning this dance-off. ^Note D This couple gained no bonus points for losing this dance-off.\n\nRatings [ edit ]\n\nViewership and ratings per episode of Dancing with the Stars No. Title Air date Rating/share\n\n(18–49) Viewers\n\n(millions) 1 \"Week 1: Premiere\" April 30, 2018 1.1/5 8.48[14] 2 \"Week 2\" May 7, 2018 1.0/4 7.73[15] 3 \"Week 3: MVP Night (Semifinals)\" May 14, 2018 1.0/4 7.68[16] 4 \"Week 4: The Finals\" May 21, 2018 1.1/5 8.77[17]", "images": ["https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/1/17/DWTSseason26.jpeg/220px-DWTSseason26.jpeg", "https://upload.wikimedia.org/wikipedia/en/1/17/DWTSseason26.jpeg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/1/17/DWTSseason26.jpeg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Dancing_with_the_Stars_(American_season_26)", "title": "Dancing with the Stars (American season 26)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/1/17/DWTSseason26.jpeg", "width": 640, "height": 949}, "title": "Dancing with the Stars (American season 26) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}