{"url": "https://en.wikipedia.org/wiki/Lakewood_Church", "text": "Church in Texas, United States\n\nLakewood Church is an non-denominational evangelical Christian megachurch located in Houston, Texas. It is one of the largest congregations in the United States, averaging about 45,000 attendees per week.[1] The 16,800-seat Lakewood Church building, home to four English-language services and two Spanish-language services per week,[2] is located at the former Compaq Center.[3] Joel Osteen is the senior pastor of Lakewood Church with his wife, Victoria, who serves as co-pastor.\n\nIt has 368 full-time and part-time staff.\n\nHistory [ edit ]\n\nCurrent building in Houston\n\nJoel Osteen at Lakewood Church, September 21, 2018\n\nLakewood Church, originally called \"Lakewood Baptist Church\", was founded by John Osteen and his second wife, Dolores (Dodie) on Mother's Day, May 10, 1959, inside an abandoned feed store in northeast Houston.[4] John was a Southern Baptist minister, but after experiencing baptism in the Holy Spirit, he founded Lakewood as a church for charismatic Baptists. The church soon dropped \"Baptist\" from its name and became non-denominational. By 1979, attendance was over five thousand, and the church was becoming prominent among Pentecostals and Charismatics. John and Dodie created and hosted Lakewood's weekly television program, which could be seen in 100 countries worldwide. Upon John Osteen's death on January 23, 1999, his youngest son, Joel Osteen, became the pastor.[5]\n\nIn 2001, Tropical Storm Allison caused flooding in the Houston area. Lakewood church was opened as a shelter to approximately 5,000 displaced persons.[6][7][8]\n\nUnder Joel Osteen, Lakewood's congregation increased almost fivefold.[9] Attendance increased to 30,000 weekly, prompting a move from its location at 7317 East Houston Road[10][11] to a larger facility.[3] In late 2003, the church signed a long-term lease with the city of Houston to acquire the Compaq Center, a 29-year-old former sports arena.[12]\n\nLakewood Church relocated to the Compaq Center on July 16, 2005. It is a 16,800-seat facility in southwest downtown Houston along U.S. Highway 59, that has twice the capacity of its former sanctuary.[3][13] The church was required to pay $11.8 million in rent in advance for the first 30 years of the lease.[12] Lakewood renovated the new campus at an estimated cost of $100 million.[9]\n\nThe church received $15,000,000 after selling the former building to New Light Christian Center Church.[14]\n\nOn March 31, 2010, the Houston City Council voted 13–2 to sell the property to Lakewood for $7.5 million.[15]\n\nOn December 3, 2021, NBC News, along with other national news services reported that a plumber found cash and checks behind a wall, behind a toilet that was being repaired, the story mentions that it may be related to a 2014 incident where $600,000 in cash and checks disappeared from a safe.[16]\n\nBeliefs [ edit ]\n\nLakewood Church believes that the entire Bible is inspired by God, and the church bases its teachings on this belief. The church also holds in account the belief in the Trinity, as well as the recognition of the death of Christ on the cross and resurrection.\n\nFrom the commands found in the Bible, the church practices the following:\n\nSalvation: Each service offers an Altar call at the end in order for people to accept Christ as Lord and Savior.\n\nWater baptism: The church believes the Bible asks for this as a symbol and a testimony to faith in Jesus Christ – in his cleansing power through his shedding of blood on the cross for us. Baptism is practiced every Saturday night in the church's Chapel.\n\nCommunion: The church believes the Bible asks for this act of remembering what Jesus did on the cross. It is offered every week in the New Beginnings room (just down from the bookstore).\n\nGrowing Relationship with Jesus Christ: Lakewood believes that every believer should be in a growing relationship with Jesus by obeying God's Word, yielding to the Holy Spirit and by being conformed to the image of Christ.[17]\n\nLakewood Church is known for its Word of Faith teaching.[4] It is also known, before every sermon, for a creed (originally led by John and continued by Joel) which the congregation repeats in unison.[18]\n\nChurch organization [ edit ]\n\nLakewood offers different types of ministries, fellowships, and services depending on the age, marital status, and need of its members.\n\nServices [ edit ]\n\nKidslife: Children\n\nChampions Club for Special Needs\n\nLakewood Next Gen: Middle School, High School, and Young Adults\n\nMain Service: all adults\n\n\n\nDuring weekend services, Joel Osteen, Victoria Osteen, or Danilo Montero preach. On Wednesday nights, associate pastors Paul Osteen, Lisa Osteen Comes, Nick Nilson, and Craig Johnson, or guest speakers preach.\n\nLearning [ edit ]\n\nVarious classes are offered through the Compass Classes ministry, meeting before and after weekend services.[19]\n\nTelevision [ edit ]\n\nThe church's weekly services are broadcast on Trinity Broadcasting Network and Daystar Television Network,[20] as well as local channels in most major U.S. markets. Lakewood also appears on secular networks, such as Fox Network, Freeform, and USA Network. In 2007, Lakewood reported spending nearly $30 million every year on its television ministry.[21] Osteen's sermons are also televised in more than 100 countries, with an estimated 7 million viewers each week.[22] Lakewood also hosts a Night of Hope every month. This is when the church hosts a Christian service event in one of the arenas or stadiums all across America.\n\nHispanic ministry [ edit ]\n\nIn 2002, Lakewood began a Hispanic ministry, Iglesia Lakewood, founded by Hispanic Pastor Marcos Witt and his wife, Miriam Witt. In September 2012, Danilo and Gloriana Montero assumed the role of associate pastors for the Hispanic ministry. Lakewood has two services each week in Spanish and translates all English services into Spanish. The weekly attendance at the Spanish services is approximately 6,000 people.[23][24]\n\nCriticism [ edit ]\n\nProsperity gospel [ edit ]\n\nOsteen's sermons and writings are sometimes noted for promoting prosperity theology, or the prosperity gospel, a belief that material gain is a reward for pious Christians.[25][26][27][28][29][30][31] However, when asked if he is a prosperity teacher, Osteen responded that if prosperity means God wants people to be blessed and healthy and have good relationships, then he considers himself a prosperity teacher, but if it is about money, he does not. He has specifically stated that he never preaches about money because of the reputation of televangelists.[32] In an interview with The Christian Post on April 21, 2013, Osteen expressed his sentiments on being perceived as being part of the prosperity gospel. \"I get grouped into the prosperity gospel and I never think it's fair, but it's just what it is. I think prosperity, and I've said it 1,000 times, it's being healthy, it's having great children, it's having peace of mind. Money is part of it; and yes, I believe God wants us to excel ... to be blessed so we can be a bigger blessing to others. I feel very rewarded. I wrote a book and sold millions of copies; and Victoria and I were able to help more people than we ever dreamed of. But when I hear the term prosperity gospel, I think people are sometimes saying, 'Well, he's just asking for money'.\"[33] On October 14, 2007, 60 Minutes ran a twelve-minute segment on Osteen, titled \"Joel Osteen Answers his Critics\", during which Reformed theologian Michael Horton told CBS News correspondent Byron Pitts that Osteen's message is heresy. Horton stated that the problem with Osteen's message is that it makes religion about us instead of about God.[34]\n\nslow response to Hurricane Harvey [ edit ]\n\nDuring the immediate aftermath of Hurricane Harvey in 2017, Osteen received significant criticism in response to not making Lakewood Church, a 606,000 sq. ft., 16,000 seat, former basketball arena, available as an emergency shelter for those displaced by the storm.[35][36][37][38][39] On August 27, posts from the church and a Lakewood Church associate pastor's social media accounts stated that the church was \"inaccessible due to severe flooding,\" and associate pastor John Gray posting further, \"If WE could get there WE WOULD OPEN THE DOORS.\"[40][41] In a subsequent interview, Osteen countered the claim that flood waters closed the church, saying \"the church has been open from the beginning,\" and, \"We've always been open … How this notion got started, that we're not a shelter and we're not taking people in is a false narrative.\"[39][42][43][44] On the evening of August 28, it was announced by Lakewood that it would open at noon the next day as an available shelter, opening to storm victims and emergency personnel on August 29.[39]\n\nOn August 15, 2018, the City of Houston and Mayor Sylvester Turner proclaimed a \"Lakewood Church Day\" in honor of Lakewood's assistance in reconstruction efforts across the Houston area.[45][46] It stated Lakewood has provided \"assistance to more than 1,150 Houston-area families whose homes were damaged or destroyed by floodwaters\" and bought \"1.1 million dollars in building materials, furniture, appliances, and paid labor, as well as through the contribution of more than 2,500 volunteers\".[47]\n\n2021 Texas Freeze Response [ edit ]\n\nLakewood Church quickly opened its doors during 2021 Texas Freeze, when the state also had power failures in many places. Lakewood sent out Internet notices that it was open as a Warming Center.\n\nHowever, perhaps as a hangover from Hurricane Harvey from 2017, rumors circulated on social media that Lakewood was not open, with these rumors often misspelling Joel’s last name as “Olsteen.”[48]\n\nSee also [ edit ]\n\nReferences [ edit ]\n\nCoordinates:", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/23px-Flag_of_the_United_States.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Flag_of_Texas.svg/32px-Flag_of_Texas.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Lakewood_worship.jpg/250px-Lakewood_worship.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Lakewood_worship.jpg/1200px-Lakewood_worship.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Lakewoodchurch.jpg/220px-Lakewoodchurch.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7f/Flag_of_Houston%2C_Texas.svg/23px-Flag_of_Houston%2C_Texas.svg.png", "https://maps.wikimedia.org/img/osm-intl,13,a,a,250x200.png?lang=en&domain=en.wikipedia.org&title=Lakewood+Church&revid=1114360946&groups=_2e295a9ba32546dbe889a793edb532e07219699e", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Joel_Osteen_Preaching_At_Lakewood_Church.jpg/180px-Joel_Osteen_Preaching_At_Lakewood_Church.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/ChristianitySymbolWhite.PNG/23px-ChristianitySymbolWhite.PNG"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Lakewood_worship.jpg/1200px-Lakewood_worship.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Lakewood_Church", "title": "Lakewood Church", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Lakewood_worship.jpg/640px-Lakewood_worship.jpg", "width": 640, "height": 426}, "title": "Lakewood Church - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}