{"url": "https://www.hollywoodreporter.com/live-feed/playing-house-canceled-3-seasons-1052960", "text": "Playing House is closing its doors.\n\nUSA Network has canceled the Jessica St. Clair-Lennon Parham comedy after three seasons, The Hollywood Reporter has learned.\n\n“USA Network and Universal Cable Productions want to thank Jessica, Lennon and the entire cast and crew of Playing House for being amazing partners for three incredible, hilarious seasons,” the network and studio said Monday in a joint statement. “It was an honor and privilege to be part of this best friendship. Once a Jammer, always a Jammer.”\n\nSt. Clair and Parham on Monday released a video message to the show’s fans addressing the show’s end. “We had three beautiful seasons and we wanted to thank you guys,” Parham said.\n\nAdded St. Clair: “We’re so thankful for all of you guys. You made it possible for us to tell the story we were always meant to tell.”\n\nThe single-camera comedy premiered on USA Network in 2014 and hailed from creators, writers and stars St. Clair and Parham. While never a ratings smash for the cabler, the half-hour amassed a devoted following, i.e. “Jammers.” In addition to fellow castmembers Keegan-Michael Key and Zach Woods, Playing House also drew an impressive guest list over its three-year run that include Laurie Metcalf and Michaela Watkins, as well as recurring players like Jane Kaczmarek and Lindsay Sloane.\n\nPlaying House earned a season two renewal that included an early VOD window that let die-hard viewers watch new episodes up to a week early and allowed the network to better capitalize on the show’s fervent fanbase. For season three, USA Network released all eight episodes on VOD the day after the show’s season premiere on June 23.\n\nHowever, there was nearly two-year delay between seasons two and three as St. Clair battled breast cancer. She is now in remission and chose to also write her diagnosis into the third season when her character, Emma, also discovered she had breast cancer. St. Clair opened up about her decision to write her cancer battle into the series for a THR guest column. The storyline earned the show some of its strongest reviews yet.\n\nIn addition to creating, writing and starring on the series, St. Clair and Parham both stepped behind the camera to direct in season three.\n\nWhen speaking with THR in June, St. Clair and Parham revealed some possible ideas for season four, including having Maggie (Parham)’s ex-husband remarry and a possible trip to London. (Parham’s season-three love interest was played by British actor Ben Willbond.)\n\nIn their video Monday, Parham and St. Clair confirmed “we’ve already got some idea cooking up” for future projects.\n\nSt. Clair and Parham executive produced the series with Ravi Nandan of A24 Films. Universal Cable Productions produced.\n\nFor USA, the decision to end Playing House also comes as the cabler has shifted away from comedy series in recent years as it pushes to go darker and edgier with originals like Mr. Robot, Queen of the South and Colony. Playing House was USA’s lone scripted comedy and one of just two half-hour series, the other being reality series Chrisley Knows Best.\n\nWatch the pair’s full joint video below:", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/06/nup_176935_1152-h_2017.jpg?w=1296&h=730&crop=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/nup_176935_1152-h_2017.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/nup_176935_1152-h_2017.jpg?w=1024", "keywords": [], "authors": ["Kate Stanhope"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/playing-house-canceled-3-seasons-1052960/", "title": "‘Playing House’ Canceled at USA Network After 3 Seasons", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The comedy hailed from creators, showrunners and stars Jessica St. Clair and Lennon Parham.", "news_keywords": "Playing House", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Kate Stanhope", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1052960, "title": "'Playing House' Canceled at USA Network After 3 Seasons", "published_at": "2017-10-30 11:00:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/nup_176935_1152-h_2017.jpg?w=1024", "comment_count": 0, "tags": "Playing House", "topics": "TV News", "body": "Playing House is closing its doors.\r\nUSA Network has canceled the Jessica St. Clair-Lennon Parham comedy after three seasons, The Hollywood Reporter has learned.\r\n“USA Network and Universal Cable Productions want to thank Jessica, Lennon and the entire cast and crew of Playing House for being amazing partners for three incredible, hilarious seasons,\" the network and studio said Monday in a joint statement. \"It was an honor and privilege to be part of this best friendship. Once a Jammer, always a Jammer.”\r\nSt. Clair and Parham on Monday released a video message to the show's fans addressing the show's end. \"We had three beautiful seasons and we wanted to thank you guys,\" Parham said.\r\nAdded St. Clair: \"We're so thankful for all of you guys. You made it possible for us to tell the story we were always meant to tell.\"\r\nThe single-camera comedy premiered on USA Network in 2014 and hailed from creators, writers and stars St. Clair and Parham. While never a ratings smash for the cabler, the half-hour amassed a devoted following, i.e. \"Jammers.\" In addition to fellow castmembers Keegan-Michael Key and Zach Woods, Playing House also drew an impressive guest list over its three-year run that include Laurie Metcalf and Michaela Watkins, as well as recurring players like Jane Kaczmarek and Lindsay Sloane.\r\n\r\nPlaying House earned a season two renewal that included an early VOD window that let die-hard viewers watch new episodes up to a week early and allowed the network to better capitalize on the show's fervent fanbase. For season three, USA Network released all eight episodes on VOD the day after the show's season premiere on June 23.\r\nHowever, there was nearly two-year delay between seasons two and three as St. Clair battled breast cancer. She is now in remission and chose to also write her diagnosis into the third season when her character, Emma, also discovered she had breast cancer. St. Clair opened up about her decision to write her cancer battle into the series for a THR guest column. The storyline earned the show some of its strongest reviews yet.\r\nIn addition to creating, writing and starring on the series, St. Clair and Parham both stepped behind the camera to direct in season three.\r\nWhen speaking with THR in June, St. Clair and Parham revealed some possible ideas for season four, including having Maggie (Parham)'s ex-husband remarry and a possible trip to London. (Parham's season-three love interest was played by British actor Ben Willbond.)\r\nIn their video Monday, Parham and St. Clair confirmed \"we've already got some idea cooking up\" for future projects.\r\n\r\nSt. Clair and Parham executive produced the series with Ravi Nandan of A24 Films. Universal Cable Productions produced.\r\nFor USA, the decision to end Playing House also comes as the cabler has shifted away from comedy series in recent years as it pushes to go darker and edgier with originals like Mr. Robot, Queen of the South and Colony. Playing House was USA's lone scripted comedy and one of just two half-hour series, the other being reality series Chrisley Knows Best. \r\nWatch the pair's full joint video below:\r\n\r\n\tFor our beloved fans: Some news about our show, @PlayingHouseUSA. #jammer4life #playinghouseusa #keepingitreal @Jessica_StClair pic.twitter.com/yoPxy5d50p\r\n\t— Lennon Parham (@lennonparham) October 30, 2017", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Playing House’ Canceled at USA Network After 3 Seasons", "url": "https://www.hollywoodreporter.com/tv/tv-news/playing-house-canceled-3-seasons-1052960/", "description": "The comedy hailed from creators, showrunners and stars Jessica St. Clair and Lennon Parham.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/nup_176935_1152-h_2017.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-10-30T11:00:00+00:00", "modified_time": "2017-10-30T12:07:45+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Playing House’ Canceled at USA Network After 3 Seasons", "description": "The comedy hailed from creators, showrunners and stars Jessica St. Clair and Lennon Parham.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/nup_176935_1152-h_2017.jpg?w=1296"}}, "movies": [], "publish_date": 1509361200.0, "source": "https://www.hollywoodreporter.com", "summary": ""}