{"url": "https://www.care.com/c/stories/5992/how-to-get-poop-out-of-everything/", "text": "There’s a good chance you never expected to Google: “How to remove a poop stain from [fill in the blank].” That’s because when you imagined having a baby or a pet, you probably didn’t envision leaky diapers and dog accidents — or the need to clean poop out of carpet or off of your favorite work clothes. But here you are, and you need to know how to clean these things properly.\n\nGetting rid of poop isn’t fun, but it’s not hard, either. (Unless the poop isn’t hard … then it’s hard. Breastfed-baby poop, anyone?)\n\nStart with the basics\n\nRemoving poop usually involves a two-step process. Here’s what to do:\n\nCleaning.\n\nSanitizing or disinfecting.\n\nCleaning comes first because it’s hard to disinfect something that hasn’t been cleaned properly. This means getting rid of the bulk of the poop — whatever you can scrape off or otherwise remove — and washing the item or surface so that you can begin disinfecting (killing the germs).\n\nBut, should you wash the item with warm water or cold water? Depends. If it’s a fabric that could potentially be stained, initially wash with cold water to avoid setting the stain. Warm water can be used if you’re not worried about a permanent stain.\n\nTo quickly clean your basic fabric items (like a stained onesie that has those tell-tale yellow leaks streaking from the seams of the diaper area) follow these steps:\n\nRemove as much of the poop as you can (and work as quickly as possible; cleaning immediately can minimize the potential for staining).\n\nRinse or soak with cold water (blotting helps).\n\nWash in the washing machine using hot water, an enzyme-based cleaner (if suitable for the fabric) and bleach or vinegar (if suitable for the fabric).\n\nLearn to tackle stains on common fabrics and materials\n\nBaby and pet poop can affect any manner of objects from upholstery and carpeting to bedding, silk items, wool sweaters, your baby’s toys, your dog’s bed and on and on. The precise methods of cleaning will depend on the object that’s involved, so try these tricks for specific materials:\n\nCotton\n\nPlastic\n\nFor baby toys and other plastic items, start with hot, soapy water and wash the affected item. Follow up by sanitizing or disinfecting (the Environmental Protection Agency offers a helpful PDF that explains proper procedure for sanitizing and disinfecting children’s toys).\n\nRugs and carpeting\n\nFor your basic baby-poop-on-the-carpet event, clean with a combination of liquid dish soap, warm water and lots of blotting. Vinegar may prove helpful for stain-fighting. For a more complicated dog-poop-on-the-carpet event, a product called Nature’s Miracle (an enzyme-based cleaner) may be effective at removing stains and odors.\n\nYour hands\n\nYou’ve washed your hands repeatedly, but they STILL smell like poop. (It’s OK, we’ve all been there.) Washing your hands with liquid dish soap may help, or trying wiping your hands with rubbing alcohol swabs.\n\nSilk\n\nThe process of cleaning silk is similar to that of cleaning cotton except that you’ll want to avoid enzyme-based cleaners. Sunshine is also recommended for stain removal on silk items.\n\nUpholstery\n\nCleaning upholstery can be similar to cleaning carpeting although initially treating with cold water is preferable to warm water if you want to avoid setting stains. For machine-washable sofa covers, follow up by laundering. Nature’s Miracle may also be effective in the case of pet poop on your furniture.\n\nWool\n\nA cold-water soak is recommended for wool items. Then follow up with a thorough washing (avoid enzyme-based cleaners for wool products). Sunshine can be a good choice for removing stains from wool items.\n\nKeep these items on hand\n\nPaper towels\n\nPerfect for cleaning and disinfecting — paper towels are a lifesaver.\n\nRubber gloves\n\nEspecially helpful when cleaning dog poop. Plastic gloves eliminate the chance of getting poop on your hands, which is aways a plus!\n\nPatience\n\nRemoving stains takes time. Don’t rush the process.\n\nA sense of humor\n\nRemember, this will be funny someday.\n\nA garbage can\n\nThere will come a time (and you’ll know when) that an item is simply too gross to save — not recommended for the disposal of sofas.\n\nBonus cheat sheet of poop-removal and cleaning tips", "images": ["https://www.care.com/c/wp-content/uploads/sites/2/2021/04/CareCrew-201914022014842202None.jpg.optimal.jpg", "https://www.care.com/c/wp-content/uploads/sites/2/2021/04/SamanthaJ89-202107260307091529.jpg.optimal.jpg", "https://www.care.com/c/wp-content/uploads/sites/2/2021/04/SamanthaJ89-202107260307091529-1623x1080.jpg.optimal.jpg", "https://www.care.com/c/wp-content/uploads/sites/2/2021/04/robyncorrell-202017180017960354None.jpg.optimal.jpg", "https://www.care.com/c/wp-content/uploads/sites/2/2021/04/Care_com_classic_logo.svg", "https://www.facebook.com/tr?id=284726028402266&ev=PageView&noscript=1", "https://secure.gravatar.com/avatar/d20e8181d472132a0f67b2b6d0d9fa71?s=150&d=mm&r=g"], "top_img": "https://www.care.com/c/wp-content/uploads/sites/2/2021/04/SamanthaJ89-202107260307091529.jpg.optimal.jpg", "keywords": [], "authors": ["Samantha Johnson"], "canonical_link": "https://www.care.com/c/how-to-get-poop-out-of-everything/", "title": "How to get poop out of everything", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "How to get poop out of everything", "description": "There’s a good chance you never expected to Google: “How to remove a poop stain from [fill in the blank].” That’s because when you imagined having a baby or a pet, you probably didn’t envision leaky diapers and dog accidents — or the need to clean poop out of carpet or off of your favorite work clothes. Read more...", "url": "https://www.care.com/c/how-to-get-poop-out-of-everything/", "site_name": "Care.com Resources", "image": {"identifier": "https://www.care.com/c/wp-content/uploads/sites/2/2021/04/SamanthaJ89-202107260307091529.jpg.optimal.jpg", "width": 2122, "height": 1412, "type": "image/jpeg"}}, "article": {"publisher": "https://www.facebook.com/caredotcom", "published_time": "2022-03-18T18:14:50+00:00", "modified_time": "2021-08-08T23:53:38+00:00"}, "author": "Samantha Johnson", "twitter": {"card": "summary_large_image", "creator": "@CareDotCom", "site": "@CareDotCom"}, "generator": "WPML ver:4.5.7 stt:70,1,66,67,68,69;", "msapplication-TileImage": "https://www.care.com/c/wp-content/uploads/sites/2/2021/04/favicon-0492fe15c89dcc86bb67c2fe6f778af6.png"}, "movies": [], "publish_date": 1647627290.0, "source": "https://www.care.com", "summary": ""}