{"url": "https://www.cnn.com/2017/10/07/entertainment/nelly-arrested-sexual-assault/index.html", "text": "Story highlights A woman says the alleged assault happened on Nelly's tour bus Saturday Nelly was released from custody after a few hours and was not charged. The rapper says it is a \"false allegation\" and he is \"completely innocent\"\n\nCNN —\n\nCornell Haynes Jr., better known as the rapper Nelly, was taken into custody Saturday in Washington state after a woman told police he raped her.\n\nPolice arrested Nelly in the early morning and took him to a jail in Des Moines, Washington, according to a report from the police department in nearby Auburn.\n\nHe was booked for investigation of rape in the second-degree and released a few hours later without charges being filed, according to his lawyer, Scott Rosenblum.\n\nThe report says a woman called 911 at 3:48 a.m. Saturday to report the alleged assault, which she says occurred on Nelly’s tour bus.\n\nPolice said Nelly, 42, had performed at the White River Amphitheater in King County just hours before the phone call was made.\n\nHe was arrested “after patrol officers investigated the incident,” according to the report.\n\nNelly tweeted Saturday afternoon that he is “completely innocent” and confident he will be vindicated.\n\n“I am beyond shocked that I have been targeted with this false allegation,” he wrote. “I am confident that once the facts are looked at, it will be very clear that I am the victim of a false allegation.”\n\nI also want to thank my fans for their unwavering support. They know me. I assure you I will be vindicated. And I assure you, I will pursue every legal option to address this defaming claim. Thank you — Nelly_Mo (@Nelly_Mo) October 7, 2017\n\nRosenblum, the attorney, said the “allegation is devoid of credibility and is motivated by greed and vindictiveness.”\n\n“I am confident, once this scurrilous accusation is thoroughly investigated, there will be no charges,” Rosenblum said in a statement. “Nelly is prepared to address and pursue all legal avenues to redress any damage caused by this clearly false allegation.”\n\nNelly was scheduled to perform a concert in Ridgefield, Washington on Saturday, but he did not attend the show.\n\nRosenblum told CNN via text message that he expects Nelly will be able to make his next scheduled concert, which is slated for October 12 in Jacksonville, Florida.\n\nNelly was once one of the reigning kings of hip-hop. He shot to fame nearly 20 years ago with the track “Country Grammar.”\n\nDuring the height of his career, he won three Grammy awards and regularly appeared on the Billboard 200.\n\nThe rapper has had previous run-ins with the law. In 2015, Nelly pleaded guilty to a misdemeanor possession of marijuana and drug paraphernalia, according to E! News.\n\nUpdated: This article has been updated to add the fact that charges were not filed against Nelly.", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/171007155541-nelly-arrest.jpg?q=x_0,y_208,h_1688,w_3000,c_crop/w_800", "https://media.cnn.com/api/v1/images/stellar/prod/160913163441-nelly-2014.jpg?q=x_0,y_229,h_1441,w_2561,c_crop/h_144,w_256"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/171007155541-nelly-arrest.jpg?q=x_0,y_208,h_1688,w_3000,c_crop/w_800", "keywords": [], "authors": ["Jackie Wattles Carolyn Sung", "Jackie Wattles", "Carolyn Sung"], "canonical_link": "https://www.cnn.com/2017/10/07/entertainment/nelly-arrested-sexual-assault/index.html", "title": "Nelly arrested after allegations of sexual assault", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Nelly arrested after allegations of rape, released with no charges | CNN", "description": "Nelly, the rapper and hip-hop artist, was arrested early Saturday in Washington state after an allegation of sexual assault. He says it's a false allegation and was not charged before being released.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/171007155541-nelly-arrest.jpg?q=x_0,y_208,h_1688,w_3000,c_crop/w_800", "type": "article", "url": "https://www.cnn.com/2017/10/07/entertainment/nelly-arrested-sexual-assault/index.html", "site_name": "CNN"}, "twitter": {"title": "Nelly arrested after allegations of rape, released with no charges | CNN", "description": "Nelly, the rapper and hip-hop artist, was arrested early Saturday in Washington state after an allegation of sexual assault. He says it's a false allegation and was not charged before being released.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/171007155541-nelly-arrest.jpg?q=x_0,y_208,h_1688,w_3000,c_crop/w_800", "card": "summary_large_image", "site": "@CNNent"}, "description": "Nelly, the rapper and hip-hop artist, was arrested early Saturday in Washington state after an allegation of sexual assault. He says it's a false allegation and was not charged before being released.", "template_type": "article_leaf", "type": "article", "meta-section": "entertainment", "theme": "entertainment", "article": {"published_time": "2017-10-07T22:33:31Z", "modified_time": "2017-10-09T01:23:05Z", "tag": "arrests, arts and entertainment, assault and battery, celebrities, crime, law enforcement and corrections, crimes against persons, criminal law, criminal offenses, law and legal system, law enforcement, music, nelly (entertainer), rap and hip-hop music, sex and gender issues, sex crimes, sexual assault, society", "publisher": "https://www.facebook.com/CNN"}, "keywords": "arrests, arts and entertainment, assault and battery, celebrities, crime, law enforcement and corrections, crimes against persons, criminal law, criminal offenses, law and legal system, law enforcement, music, nelly (entertainer), rap and hip-hop music, sex and gender issues, sex crimes, sexual assault, society", "author": "Jackie Wattles,Carolyn Sung", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1507330800.0, "source": "https://www.cnn.com", "summary": ""}