{"url": "http://fortune.com/2018/05/17/royal-wedding-dress-cost-meghan-markle-prince-harry/", "text": "Weddings are known to be money pits. But when the world is watching, no expense will be spared.\n\nEstimates for just how much this Saturday’s royal wedding of Prince Harry and Meghan Markle will cost are all over the map, ranging from an optimistic budget of just $1.4 million upward to as much as $46 million. (Editor’s note: All costs will be converted and presented in U.S. dollars for the purpose of this article.)\n\nThere’s no way to know for sure—and like all weddings, last minute costs always seem to creep out of nowhere—but that’s not stopping event planners, royal watchers, and U.K. taxpayers from trying to figure it out.\n\nAdditionally, since the engagement between the American actress and Britain’s ginger-spiced prince was announced last November, there has been an active debate as to who should be footing the bill. British taxpayers support the Royal Family through the sovereign grant, a percentage of The Crown Estate’s profit that is issued by the treasury. This year’s grant is expected to be worth $105 million, breaking down to less than $1 per year per taxpayer, according to The Boston Globe.\n\nThis week, the BBC reported about a petition circulating, demanding that the government refrain from spending public funds on the Royal Wedding, including security costs. The petition has already garnered more than 32,000 signatures.\n\nBut both Prince Harry and Meghan Markle come to the union with healthy bank accounts of their own. Before we get to the Royal Wedding budget, here’s how the (hopefully) happy couple’s finances look at the moment.\n\nMarkle, who rose to fame on USA Network’s legal drama Suits and also had a loyal following to her online lifestyle site The Tig before it was shutdown ahead of her engagement, reportedly has a net worth of at least $5 million.\n\nPrince Harry’s net worth is a little more difficult to pin down to an exact figure, but with an estimate range between $25 million and $30 million, he’s doing just fine for himself. Now sixth-in-line to the throne after Prince Louis‘s birth in April, Prince Harry does have some expenses covered by the Duchy of Cornwall, the estate bestowed upon and managed by his father, Prince Charles. And like his older brother Prince William, Prince Harry also received millions in a trust from his mother’s (Princess Diana) will when he turned 30. (Not to mention Prince Harry also held a stable job for 10 years with the Royal Army, which reportedly paid $50,000 per year.)\n\nRead More: How to Watch the Royal Wedding: Streaming, Television, or Even in a Theater\n\nThat all said, while even Buckingham Palace garden parties are planned down to the last napkin folded, let’s take a look at some of the guesstimates about some of the most important expenses this weekend.\n\nEddie Mulholland — Reuters\n\nThe Dress\n\nGamblers can place bets on seemingly anything from who will perform at the reception (Elton John? The Spice Girls?) to which color hat Queen Elizabeth II might wear. But no territory is a hotter betting ground than predicting the designer of Meghan Markle’s wedding dress.\n\nSafer bets would be placed on British designers—namely Stella McCartney, Burberry, and Erdem, among others. The Daily Mail recently called it for Ralph & Russo, reporting that the London-based couture house would be designing Markle’s dress, priced at roughly $135,000, to be paid for out of Prince Harry’s accounts.\n\nBy comparison, estimates put Kate Middleton’s wedding dress by Sarah Burton for Alexander McQueen at more than $400,000, so maybe Markle’s dress will be considered a bargain.\n\nThe Ceremony and Reception(s)\n\nWindsor Castle, the longest-occupied castle in Europe and widely reported to be the Queen’s favorite residence, has been chosen as the primary venue for the festivities on May 19. The ceremony will be at St. George’s Chapel. There is no fee for hosting the ceremony, but apparently we can all look forward to seeing some sort of “glass marquee,” which would have a final cost of $400,000, according to CNBC.\n\nThe town of Windsor, just over 25 miles from London, has been busy for months with local renovations in preparation for hosting the world’s media and thousands of tourists descending upon the village with hopes of getting a spot along the parade route. NBC’s Today show, in particular, has been dedicating countless segments (and even part of a primetime special) to how local businesses and infrastructure are shaping up with new coats of paint and freshly paved roads. CNN Money reported that infrastructure improvements and local cleanups to ensure everything looks spotless could cost as much as $3.5 million, but that’s coming out of the purse of the municipal government in the Royal Borough of Windsor and Maidenhead.\n\nRead More: The Royal Family Is Fiercely Protective of Its Brand—Until a Royal Wedding Rolls Around\n\nEven the castle has been outfitted in scaffolding as it undergoes renovations said to cost nearly $32 million. The Royal Mews, the entrance exclusive to the Royal Family, is being prepped for the big day, but the castle’s renovations aren’t expected to be totally completed until the end of the year.\n\nQueen Elizabeth is expected to pick up the tab for the afternoon reception, hosting 600 guests. That includes costs for all of the flowers, the music, the champagne, and lots and lots of canapés.\n\nAnd don’t forget the cake. One of the first wedding details revealed by Kensington Palace in March, Meghan and Harry chose American-born baker and Chez Panisse alum Claire Ptak of East London’s Violet Bakery, who will prepare a “lemon elderflower cake that will incorporate the bright flavours of spring.” The cost wasn’t revealed, but Violet Bakery’s website lists wedding cakes for as much as $1,060 to serve 150 guests. With 600 guests in attendance (and likely some extra slices needed for saving in the freezer as well as auctioning off), the cake could cost well more than $7,000 alone. (Let’s be generous with this estimate as it is a Royal Wedding, after all.)\n\nFor their wedding cake Prince Harry and Ms. Meghan Markle have chosen pastry chef Claire Ptak, owner of the London-based bakery @violetcakes. pic.twitter.com/Rx36WBt7kC — Kensington Palace (@KensingtonRoyal) March 20, 2018\n\nTennis star Serena Williams—Markle’s friend, a possible wedding guest, and the Greatest of All Time—recently revealed her own bit of wedding advice to Markle in an interview with ABC’s Robin Roberts: Enjoy the moment, and eat your cake.\n\nA more intimate reception—for just 200 guests!—will be hosted by Prince Charles later in the evening, paid out of his bank account, again, covered by the Duchy of Cornwall. Meghan and Harry’s wedding planners might have padded the budget here as the meal is expected to be less formal, standing, and served in passed bowls rather than a full sit-down affair. (It would have made for a delightful blog post with Pinterest-worthy photos on The Tig, but we can only dream.) CNBC puts the total costs for food and beverages, at least, at $680,000, citing one royal source testifying Prince Harry really likes whiskey.\n\nSecurity\n\nMuch to the dismay of the aforementioned taxpayers who are probably not royalists, this is where the British public foots the bill AND it’s the true big-ticket item on the registry. The Independent pegs the total security costs at as much as $41 million. That’s considerably less than what it cost for security at Prince William’s wedding to Kate Middleton in 2011. Reports vary there with some citing costs at $13.6 million up to $27 million.\n\nA big difference between the two royal weddings is that William and Kate held theirs in central London, and all accounts suggest securing and locking down Windsor—especially amid heightened counter-terrorism activity in 2018—is a much more costly affair.\n\nSure, the dress is what everyone is speculating about now. But if you want that to be the top trending topic after the big day, too, then security is really the most crucial cost.", "images": ["https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1242585998-e1665028070836.jpg?w=256&q=75", "https://content.fortune.com/wp-content/uploads/2017/11/880273230.jpg?resize=1200,600", "https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1243767517-e1665076497696.jpg?w=256&q=75", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://content.fortune.com/wp-content/uploads/2017/11/rtx3k14o.jpg?w=1440&q=75", "https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1243581035-e1665068106964.jpg?w=256&q=75"], "top_img": "https://content.fortune.com/wp-content/uploads/2017/11/880273230.jpg?resize=1200,600", "keywords": [], "authors": [], "canonical_link": "https://fortune.com/2018/05/17/royal-wedding-dress-cost-meghan-markle-prince-harry/", "title": "The Royal Wedding: How Much Security, Renovations, and Meghan Markle’s Dress Might Cost", "meta_data": {"viewport": "width=device-width", "msapplication-TileColor": "#ffc40d", "theme-color": "#ffffff", "description": "Estimates for just how much this Saturday's royal wedding of Prince Harry and Meghan Markle will cost are all over the map.", "og": {"url": "https://fortune.com/2018/05/17/royal-wedding-dress-cost-meghan-markle-prince-harry/", "type": "article", "title": "The Royal Wedding: How Much Security, Renovations, and Meghan Markle's Dress Might Cost", "description": "A royal wedding or a royal money pit?", "site_name": "Fortune", "image": "https://content.fortune.com/wp-content/uploads/2017/11/880273230.jpg?resize=1200,600", "width": 1024, "height": 683}, "twitter": {"card": "summary_large_image", "title": "The Royal Wedding: How Much Security, Renovations, and Meghan Markle's Dress Might Cost", "description": "A royal wedding or a royal money pit?", "image": "https://content.fortune.com/wp-content/uploads/2017/11/880273230.jpg?resize=1200,600", "url": "https://fortune.com/2018/05/17/royal-wedding-dress-cost-meghan-markle-prince-harry/"}, "next-head-count": 32}, "movies": ["https://www.youtube.com/embed/G27GXnXy5yQ?feature=oembed"], "publish_date": 1526511600.0, "source": "http://fortune.com", "summary": ""}