{"url": "https://en.wikipedia.org/wiki/Descendants_3", "text": "2019 Disney Channel Original Movie directed by Kenny Ortega\n\nDescendants 3 is an American musical fantasy[1][2] television film, and the third installment in the Descendants series, following Descendants and Descendants 2. It is written by Sara Parriott and Josann McGibbon, and is directed by Kenny Ortega. The film premiered on Disney Channel on August 2, 2019, and in other parts of the world on October 12, 2019.\n\nPlot [ edit ]\n\nMal, Evie, Jay, and Carlos visit the Isle of the Lost to choose four new villain kids (VKs) to take to Auradon. They pick Dizzy, granddaughter of Lady Tremaine, Celia, daughter of Dr. Facilier, and Squeaky and Squirmy, the twin sons of Mr. Smee. The day the kids are to be picked up, Ben, Mal's boyfriend and the king of Auradon, proposes to her, and she accepts. Ben's ex-girlfriend Audrey seethes with jealousy, and her grandmother Queen Leah admonishes her for failing to secure the family legacy by marrying Ben. Unable to contain her jealousy, Audrey steals the Queen's crown and Maleficent's scepter from the museum. Following the theft and Hades' escape attempt has Mal, as future Queen, decide that the best way to protect the subjects and restore peace is to close the barrier between the islands permanently.\n\nAudrey curses Mal with Maleficent's scepter, and she and the other VKs go to the Isle to get Hades' ember, the only artifact powerful enough to break the scepter's curse. Upon entering the Isle, Mal is freed of the curse and Celia gets her into Hades' lair, but Hades thwarts their effort to steal the ember. He is revealed to be Mal's absentee father and reluctantly gives her the ember, warning her to avoid it getting wet as it will not exhibit its full powers for her. While leaving the Isle, Mal and the others are intercepted by Uma, Gil, and Harry, who agree to help after Mal agrees to release all the children from the Isle.\n\nMeanwhile, in Auradon, Audrey attacks Jane's birthday party with a sleeping curse; Chad aligns himself with her, while Jane escapes into the enchanted lake. As the entire kingdom falls under Audrey's spell, she offers to reverse it if Ben will marry her. However, he refuses, prompting Audrey to turn him into a beast and begins turning people to stone. Mal and Uma, vying for the leadership of the VKs, return to Auradon with their friends. Despite their conflict, they eventually work together to find and defeat Audrey. After finding Ben in beast form, Carlos calms him while Jane restores him to human form with the enchanted lake water. At Evie's house, Mal and Uma make amends while Evie wakes Doug with true love's kiss. Audrey traps them in the house, but they are able to reverse Audrey's spell by combining their magic, and they and their other friends reunite.\n\nAt the Fairy Cottage, they find only a shell-shocked Chad. When Mal admits her plan to seal off the Isle permanently, the group implodes and Celia, learning she can never see her father again, douses the ember. After Evie confronts Mal for lying to her and their friends, they are all suddenly turned to stone, save for Mal. Audrey takes Celia hostage and attacks Mal, who turns into her dragon form. Realizing she is Mal's only hope, Uma combines their magic to reignite the ember; Mal defeats Audrey, who falls comatose, and the curses are lifted. Mal and her friends reconcile while Ben agrees to allow Hades to use the ember to revive Audrey, but decries the double standard by which Audrey is immediately forgiven as she is not considered a villain, and Mal, Ben and Audrey make amends.\n\nMal declares her refusal of becoming queen of Auradon due to her responsibilities as queen of the Isle. With Ben and Fairy Godmother's approval, Mal replaces the barrier with a bridge, and the people of the newly merged society celebrate. In the end, Evie is with Doug, Carlos is with Jane, Mal and Ben are engaged, Jay and Gil plan to travel the world together, and Audrey becomes romantically attached to Harry after Uma rejects him.\n\nIn a mid-credits scene, Mal, Evie, Jay, and Carlos race across the bridge to the Isle to reunite with their parents.\n\nCast [ edit ]\n\nAdditionally, Judith Maxie reprises her role as Queen Leah, Princess Audrey's grandmother, from the first Descendants film.[10] Christian Convery and Luke Roessler play Squeaky and Squirmy, respectively, the twin sons of Mr. Smee.[6][10] Also appearing are Jamal Sims as Celia's father Dr. Facilier,[7][8] Linda Ko as Dizzy's grandmother Lady Tremaine, and Faustino Di Bauda as Squeaky's and Squirmy's father Mr. Smee.\n\nProduction [ edit ]\n\nOn February 16, 2018, Disney Channel announced the production of Descendants 3, which Disney scheduled to air in mid-2019.[11] Descendants 3 is written and produced by Sara Parriott and Josann McGibbon, and is directed and executive produced by Kenny Ortega.[3] Wendy Japhet is a producer on the film,[5] with Ortega, Sara Parriott, Josann McGibbon, and Japhet also serving as executive producers.[6] Mark Hofeling and Kara Saun return as production designer and costume designer on the sequel, respectively.[5] In addition to playing Dr. Facilier, Jamal Sims also serves as the film's choreographer,[7][8] along with Ortega who has served as choreographer for all three Descendants films.[3]\n\nRehearsals and pre-recording on the film began on April 23, 2018, in Vancouver, British Columbia, Canada.[5] Production began on May 25, 2018.[12] On July 18, 2018, it was reported on social media that production on the film had \"officially wrapped\".[13] Teen Vogue reported that Descendants 3 will be the last film in the series.[14]\n\nRelease [ edit ]\n\nPromotional footage for the film was released on the film series' official YouTube channel in February 2018.[15] In late May 2019, it was announced that the film would premiere on August 2, 2019.[16][3][17]\n\nA related short film, Under the Sea: A Descendants Short Story, which features Mal and Uma facing off in \"an epic underwater showdown\", was released on September 28, 2018.[18][19]\n\nOn July 11, 2019, Disney announced it was canceling a red carpet premiere originally planned for July 22, 2019, in the wake of Cameron Boyce's death. The film's television premiere went on as scheduled, dedicated to Boyce's memory.[20]\n\nReception [ edit ]\n\nDescendants 3 was watched by 4.59 million viewers on its August 2, 2019 premiere,[21] with viewership increasing to 8.43 million viewers after three days of delayed viewing.[22] On Rotten Tomatoes the film has an approval rating of 78% based on nine reviews.[23]\n\nAccolades [ edit ]\n\nSoundtrack [ edit ]\n\nDescendants 3\n\n(Original TV Movie Soundtrack) Soundtrack album by Descendants cast cast Released August 2, 2019 Recorded April—May 2018 Genre Pop Label Walt Disney Descendants soundtracks chronology Descendants 2\n\n(2017) Descendants 3\n\n(Original TV Movie Soundtrack)\n\n(2019) Singles from Descendants 3\n\nReleased: May 31, 2019\n\nReleased: July 19, 2019\n\nReleased: August 2, 2019\n\nDescendants 3 (Original TV Movie Soundtrack) is the soundtrack accompanying the film of the same name. The soundtrack and lead single, \"Good to Be Bad\", was released on May 31, 2019, along with the pre-order of the soundtrack. The soundtrack was released on August 2, 2019. It reached number 7 on the Billboard 200 album chart,[26] and number 1 on the Billboard Kid Albums chart.[27]\n\nTrack listing [ edit ]\n\nNotes\n\n\"VK Mashup\" contains samples of \"Rotten to the Core\", \"Ways to Be Wicked\", and \"Good to be Bad\", from the first, second and third soundtracks.\n\nChart performance [ edit ]\n\nThe album debuted at number 7 on the Billboard 200,[28] and in its second week the album dropped to number 14.[29]\n\nThe single \"Queen of Mean\" reached number 49 on the Billboard Hot 100,[30] number 57 on the Canadian Hot 100,[31] and number 89 on the UK Singles Chart.[32]\n\nCharts [ edit ]\n\nYear-end charts [ edit ]\n\nChart (2019) Position US Soundtrack Albums (Billboard)[42] 15 Chart (2020) Position US Soundtrack Albums (Billboard)[43] 21\n\nCertifications [ edit ]\n\nRegion Certification Certified units/sales United Kingdom (BPI)[44] Silver 60,000 Sales+streaming figures based on certification alone.\n\nHome media [ edit ]\n\nDescendants 3 was released on DVD on August 6, 2019.[45]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/en/b/bd/Descendants_3%2C_poster.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/f/f9/Double-dagger-14-plain.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/b/bd/Descendants_3%2C_poster.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Descendants_3", "title": "Descendants 3", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/b/bd/Descendants_3%2C_poster.jpg", "width": 640, "height": 940}, "title": "Descendants 3 - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}