{"url": "https://www.historyextra.com/period/victorian/royal-wedding-dress-history-unusual-princess-eugenie-meghan-markle/", "text": "Strict protocol governed wedding attire for the bride of a French heir to the throne: a cloth-of-silver dress. Unfortunately, the bride’s growing body was not taken into account when the dress was designed and so the resulting bodice was too small, meaning that Marie Antoinette’s attendants were unable to fasten the back of the gown. According to Elizabeth Seymour Percy, Duchess of Northumberland, there was “quite a broad stripe of lacing and shift quite visible, which had a bad effect between two broader stripes of diamonds [the latter of which were a gift from Marie Antoinette’s mother, Empress Maria Theresa of the Habsburg Empire].”\n\nAs queen of France, Marie Antoinette became a leader of fashion – but as a 14-year-old Austrian archduchess she committed a fashion faux pas on the day she married the future King Louis XVI in the royal chapel at the Palace of Versailles in 1770.\n\nIn addition to the ill-fitting dress, Marie Antoinette’s future hairdresser Léonard Autié considered the bride’s strawberry-blonde hair “badly arranged” for the occasion. The comment, written in his journal, may have reflected his rivalry with the hairdresser Sieur Larsenneur, who styled Marie Antoinette’s hair on the day of her wedding in a low, powdered upsweep adorned with decorative gems. Léonard opted for more elaborate hairstyles for Marie Antoinette when he later became her hairdresser.\n\nFrench queen Marie Antoinette devoted great efforts to her public image, though she committed a fashion faux pas on the day she married the future King Louis XVI in 1770. (Photo by: Universal History Archive/UIG via Getty Images)\n\nDespite the fashion faux pas on her wedding day, queen Marie Antoinette devoted great efforts to her public image. Her milliner (hatter) Rose Bertin and hairdresser Léonard became known as the queen’s ‘Ministers of Fashion’, setting precedents for future celebrity stylists. But Marie Antoinette’s reputation for extravagance (as well as her Austrian origins) contributed to her unpopularity. The French Revolution broke out in 1789; the French monarchy was overthrown in 1792; and Marie Antoinette was executed by guillotine in 1793, a few months after her husband.\n\n2 Queen Victoria\n\nWhen Queen Victoria’s mother, Princess Victoire of Saxe-Coburg-Saalfeld, married King George III’s fourth son – Prince Edward, Duke of Kent and Strathearn – in 1818, she was dressed in an elaborate cloth-of-gold gown. This followed the tradition of Hanoverian brides, who wore court dress or royal robes on their wedding day. And when Queen Victoria’s cousin Princess Charlotte married the future Leopold I of Belgium on 2 May 1816, the bride wore a glittering ensemble of “silver lama on net, over a silver tissue slip, embroidered at the bottom with silver lama in shells and flowers”. The dress, which is the earliest British royal wedding gown that survives to this day, also boasted “manteaux [a loose sleeveless cloak or shawl]... of silver tissue lined with white satin, with a border of embroidery to answer that on the dress.”\n\nQueen Victoria departed from Hanoverian court tradition upon her wedding to Prince Albert of Saxe-Coburg-Gotha, by wearing a comparatively simple wedding dress of white silk satin trimmed with lace and orange blossoms. (Photo by Culture Club/Getty Images)\n\nBut in 1840, for her wedding to Prince Albert of Saxe-Coburg-Gotha in St James’s Palace, the young Queen Victoria departed from Hanoverian court tradition by wearing a comparatively simple wedding dress of white silk satin trimmed with lace and orange blossoms. Victoria described her dress and jewels in her journal: “I wore a white satin dress, with a deep flounce of Honiton lace, an imitation of an old design. My jewels were my Turkish diamond necklace & earrings & dear Albert's beautiful sapphire brooch.”\n\nTechnically, Queen Victoria was not the first royal bride to opt for white – Mary, Queen of Scots wore white on her first wedding day (when she married the future King Francois II of France, in 1558). Queen Victoria’s choice of wedding dress, however, captured the popular imagination and inspired other brides to choose white wedding dresses – a trend that continues today.\n\nMore like this\n\nIn her choice of dress, Victoria was keen to promote British industry and manufacturing during a period when English silk and lace-making were experiencing a period of decline. The silk satin was woven in Spitalfields, East London, and the lace came from Honiton and Beer in Devon. Victoria treasured her wedding lace and wore it on important occasions for the rest of her reign, including her Diamond Jubilee in 1897.\n\nWhile Queen Victoria’s dress set a new trend, Victoria herself wanted to be a conventional bride by taking the same vows as other women of her time. It was asked whether she wanted to vow to obey Prince Albert and to this Victoria answered yes, because she wanted to be married as a contemporary woman, not as queen.\n\nModern royal brides continue to follow Victoria in showcasing British industry in their choice of wedding attire – including Catherine Middleton, says Carolyn Harris. (Photo by Pascal Le Segretain/Getty Images)\n\nModern royal brides continue to follow Victoria in showcasing British industry in their choice of wedding attire – including Catherine Middleton, who wore a dress designed by Sarah Burton for the British fashion house Alexander McQueen when she married Prince William on 29 April 2011. A statement released by Buckingham Palace shortly after the wedding read: “Miss Middleton chose British brand Alexander McQueen for the beauty of its craftsmanship and its respect for traditional workmanship and the technical construction of clothing.” The lace appliqué for the bodice and skirt was hand-made by the Royal School of Needlework, based at Hampton Court Palace, and the lace design was hand-engineered using the Carrickmacross lace-making technique, which originated in Ireland in the 1820s.\n\n3 Queen Maud of Norway\n\nWhen Princess Maud of Wales (granddaughter of Queen Victoria and the youngest daughter of the future King Edward VII) married Prince Charles of Denmark (later King Haakon VII of Norway) on 22 July 1896, she chose a comparatively simple wedding dress that did not incorporate lace. A weekly women’s magazine of the time explained to readers: “The wedding gown, made in Spitalfields, is of pure white English satin, with a long train cut in one with the skirt, and trimmed in one corner with a full bow of mousseline de soie and orange blossoms; a ruche of chiffon and flowers borders the skirt hem at the front and sides.” But Maud acknowledged the tradition for Honiton lace (set by Queen Victoria) by wearing her mother’s Honiton lace wedding veil. As royal biographer Theo Aronson (1929–2003) later observed: “Princess Maud, thanks to her mother’s unerring taste, was considerably better dressed than most royal brides.”\n\nPrince Charles of Denmark marries Princess Maud, the daughter of the Prince of Wales (later King Edward VII). Royal biographer Theo Aronson observed: “Princess Maud, thanks to her mother’s unerring taste, was considerably better dressed than most royal brides.” (Photo by W. and D. Downey/Hulton Archive/Getty Images)\n\nMaud's trousseau [the clothes, linen and other belongings collected by a bride for her marriage] reflected her personal interests, particularly her love of cycling, riding and skiing (which she took up in Norway). Hertrousseau included riding habits and hats, and, according to a fashion magazine of the time, \"A cycling-gown, which is the very model of workmanlike smartness, is of tan cloth lined with a light silk serge and faced with detachable linen collar and lapels\". The trousseau also included \"for yachting, a dainty little blue serge frock\".\n\nMaud was not the only granddaughter of Queen Victoria who opted to limit the amount of lace in her wedding ensemble. When Princess Marie of Edinburgh married the future Ferdinand I of Romania in 1893, she eschewed the traditional Honiton lace veil worn by British royal brides and chose instead a tulle veil to accompany a wedding dress selected by her mother. Later in life, as queen of Romania, Marie developed a unique sense of style, incorporating romantic interpretations of traditional folk costumes.\n\nThe simplicity of Maud’s gown has been an inspiration for subsequent royal brides. When Mette-Marit Tjessem Høiby, the current crown princess of Norway, married Crown Prince Haakon in 2001, she wore a silk crepe dress with long sleeves, a corset waist and a two-metre train. The designer, Ove Harder Finseth, is said to have been influenced by Maud's wedding dress.\n\n4 Princess Irina of Russia\n\nImperial Russian wedding dresses traditionally worn by grand duchesses were so heavy that the bride often found it difficult to move at the ceremony. Tsar Nicholas II’s cousin Grand Duchess Marie Pavlovna recalled wearing “a gown of silver cloth so thick that it seemed to be made of cardboard” when she married Prince Wilhelm of Sweden in 1908.\n\nWhen Nicholas’s niece Princess Irina Alexandrovna married Prince Felix Yusupov – one of the wealthiest men in Russia – at the Anichkov Palace in 1914, she decided not to wear a court dress and instead made her own choice of wedding attire. Felix wrote in his memoirs: “Irina’s wedding dress was magnificent; it was of white satin embroidered in silver, with a long train.” Irina’s veil, held in place by a tiara of rock crystal and diamonds, once belonged to Marie Antoinette. The streamlined style of Irina’s wedding dress influenced future wedding dresses right into the 1920s.\n\nIn addition to the alternative dress, the wedding of Irina and Felix featured an unconventional wedding gift as well. When Tsar Nicholas II (along with his wife, Empress Alexandra) asked Felix what he would like as a wedding present, the bridegroom requested the privilege of sitting in the Imperial box at the theatre. According to Felix, “Nicholas II laughingly agreed”. But the cordial rapport between Felix and the Tsarwas not to last. It came to an abrupt end when Felix (along with the Tsar's cousin Grand Duke Dmitri Pavlovich) organised the murder of Empress Alexandra’s mystic and faith healer Rasputin at the Yusupov Palace (also known as the Moika Palace) in 1916 because they were concerned about Rasputin’s influence over the Imperial family.\n\nFelix and Irina survived the Russian Revolution that followed and fled to the Crimea. The couple eventually settled in Paris, living there from 1920 until their deaths (Felix died in 1967 and Irina followed in 1970).\n\n5 Mary, Princess Royal and Countess of Harewood\n\nPrincess Mary, the only daughter of King George V and Queen Mary, married Henry Lascelles, 6th Earl of Harewood, at Westminster Abbey in 1922. The princess’s decision to marry an Englishman rather than a foreign prince was extremely popular. Mary’s brother Albert (the future King George VI) wrote to their eldest brother David (the future King Edward VIII): “Mary’s wedding is causing a great deal of work to many people & as far as I can make out the 28th is going to be a day of national rejoicing in every conceivable and unconceivable manner… In fact it is now no longer Mary’s wedding, but (this from the paper) it is the ‘Abbey Wedding’ or the ‘Royal Wedding’ or the ‘National Wedding’ or even ‘The People’s Wedding’ (I have heard it called) ‘of our beloved princess.’”\n\nQueen Mary and King George V, with their daughter Mary, the Princess Royal, and Viscount Lascelle, 6th Earl of Harewood, on the wedding day in 1922. The princess’s decision to marry an Englishman rather than a foreign prince was extremely popular. (Photo by W. & D. Downey/Getty Images)\n\nPrincess Mary’s wedding dress design was released to the press, allowing the public to examine in detail the materials and style chosen by the princess. While previous royal brides had honoured England and sometimes Wales, Scotland and Ireland in their wedding dress motifs, Mary was the first royal bride to pay tribute to the British Empire and Dominions: the embroidery of her dress reflected the contributions of these regions to the Allied cause during the First World War. The Associated Press reported: “Princess Mary’s wedding gown is to be of cloth of silver of magnificent design. The material was bought by the Queen from India some years ago and is described as a triumph of native manufacturing.” The hand-woven ivory silk train sourced from Essex was embroidered with floral symbols from the Empire and Dominions including the maple from Canada, the lotus from India, the wattle from Australia and the fern from New Zealand.\n\nWhen Meghan Markle married Prince Harry in May 2018, she honoured the Commonwealth with the floral motifs embroidered on her veil – these included the bunchberry from Canada, the kowhai from New Zealand, and, like Princess Mary, the lotus from India and the wattle from Australia.\n\nWhen Meghan Markle married Prince Harry in May 2018, she honoured the Commonwealth with the floral motifs embroidered on her veil. (Photo by Andrew Matthews - WPA Pool/Getty Images)\n\n6 Queen Elizabeth, the Queen Mother\n\nLady Elizabeth Bowes-Lyon (better known as Queen Elizabeth, the Queen Mother) was one of the bridesmaids at the wedding of Princess Mary, and, like her sister-in-law, she too chose to add personal touches to her wedding gown when she married the Duke of York (the future King George VI) in 1923 at Westminster Abbey.\n\nLady Elizabeth Bowes-Lyon (better known as Queen Elizabeth, the Queen Mother), photographed on the day of her wedding to the Duke of York. (Photo by Time Life Pictures/Pictures Inc./The LIFE Picture Collection/Getty Images)\n\nElizabeth’s short-sleeved ivory chiffon moire (silk) wedding dress reflected the fashion trends of the early 1920s, mimicking the dropped waist and flowing silhouette popularised by the French fashion designer Gabrielle “Coco” Chanel. The dress boasted two trains – one attached at the hips; the other at the shoulders. The veil, loaned to the bride by her future mother-in-law, Queen Mary, was made of Flanders lace. Elizabeth was pleased with her wedding ensemble, noting in her diary that “it looked lovely.”\n\nThree other distinct characteristics of Elizabeth’s wedding gown attracted popular attention. First, the dress included a strip of Brussels Lace worn by one of the bride’s Scottish ancestors at a ball for Charles Edward Stuart, the Bonnie Prince Charlie (who in 1745 had challenged the groom’s ancestor, King George II, for the British throne). Elizabeth also incorporated spring green tulle into the accents on her own dress and those of her bridesmaids, prompting a journalist of the time to observe: “In the trimming the bride has defied all old superstitions about the unluckiness of green.” Elizabeth’s dress also incorporated a silver and rose thistle, emphasising the bride’s Scottish heritage as the daughter of the Earl and Countess of Strathmore.\n\nWhile Elizabeth’s wedding gown was distinctly 1920s in style, with her bouquet she began an important royal wedding tradition that continues to the present day. In honour of her elder brother Fergus, who had been killed at the battle of Loos during the First World War, Elizabeth placed her bouquet on the Tomb of the Unknown Soldier in Westminster Abbey. This tradition is still observed by 21st-century royal brides including Catherine Middleton and Meghan Markle.\n\n7 Wallis Simpson, Duchess of Windsor\n\nThe wedding of the duke of Windsor (the former King Edward VIII) to Wallis Simpson, a twice-divorced American, at the Château de Candéin France in 1937, was one of the most controversial royal weddings of the 20th-century. The royal family boycotted the ceremony and as the woman widely blamed for the Abdication Crisis of 1936, Simpson was under no obligation to follow royal tradition in her choice of wedding attire. There was worldwide speculation about what Wallis would wear on the day.\n\nThere was worldwide speculation about what Wallis Simpson would wear on the day of her wedding to the Duke of Windsor in 1937. (Photo by Central Press/Getty Images)\n\nTIME Magazine reported: “She wore a dress that most U. S. department stores were soon to feature: soft blue crepe with a tight, buttoned bodice, a halo-shaped hat of the same color, shoes and gloves to match. At her throat was a tremendous diamond-&-sapphire brooch. Mrs. Warfield carried a prayer book, had no bouquet but wore a large lavender orchid at her waist.” The colour of the dress matched the bride’s eyes and became known as ‘Wallis Blue’, prompting popular demand for dresses in this colour.\n\nThe duchess of Windsor was aware of the historical and cultural significance of her wedding dress – in 1950, she donated the dress to the Metropolitan Museum of Art in New York. Due to a defect in the dye, the dress has since faded to a cream colour, making it look like a more conventional wedding dress of the time. After her death in 1986, the duchess’s jewellery was auctioned for charity.\n\n8 Sarah Ferguson, Duchess of York\n\nSarah Ferguson married Queen Elizabeth II’s second son, Prince Andrew, Duke of York, at Westminster Abbey in 1986. In the design of her wedding gown, Ferguson was inspired by Norman Hartnell’s richly embroidered design for the future Queen Elizabeth II’s wedding dress in 1947. In contrast to her mother-in-law, however, the duchess chose Italian silk because it was better able to support the embroidery than English silk. She also personalised the embroidery, choosing a bee to represent her own family crest and anchors to represent Andrew’s naval career, in addition to English roses.\n\nFor her wedding to Prince Andrew, Duke of York in 1986, Sarah Ferguson chose Italian silk because it was better able to support the embroidery than English silk, says Carolyn Harris. (Photo by John Shelley Collection/Avalon/Getty Images)\n\nThe duchess described her wedding dress in her memoirs: “I was inserted into my ivory wedding dress, an exquisite creation I’d lost twenty-six pounds to fit into. Lindka [Cierach] was a genius; I knew she could make the most flattering gown ever, and she had. It was amazingly boned, like a corset. We’d chosen duchess satin because it was the creamiest material in the world. It never creases. It is as smooth as glass and hangs beautifully, without a single bulge; it made my reduced figure look even better.” The dress proved cumbersome, however, when the new duchess curtsied to the queen after the ceremony and she appeared to nearly drop to the floor.\n\nThe Duke and Duchess of York separated in 1992 and divorced in 1996.\n\nAdvertisement\n\nDr Carolyn Harris is an instructor in history at the University of Toronto School of Continuing Studies and the author of three books: Raising Royalty: 1000 Years of Royal Parenting (Dundurn Press, 2017); Queenship and Revolution in Early Modern Europe: Henrietta Maria and Marie Antoinette (Palgrave Macmillan, 2016); and Magna Carta and Its Gifts to Canada (Dundurn Press, 2015)", "images": ["https://images.immediate.co.uk/production/volatile/sites/7/2018/10/GettyImages-179794774-b46fc2b.jpg?quality=90&fit=700,466", "https://images.immediate.co.uk/production/volatile/sites/7/2018/10/GettyImages-3303621-f486e51.jpg?quality=90&fit=700,466", "https://images.immediate.co.uk/production/volatile/sites/7/2021/03/Footer-US-91a26bc.jpg?quality=90&resize=93,84", "https://images.immediate.co.uk/production/volatile/sites/7/2018/10/Elizabeth-II-wedding-2-5136340-3615590.jpg?quality=90&resize=374,340", "https://images.immediate.co.uk/production/volatile/sites/7/2018/10/GettyImages-960050830-342b657.jpg?quality=90&fit=700,466", "https://images.immediate.co.uk/production/volatile/sites/7/2018/10/GettyImages-50680446-5e65b78.jpg?quality=90&fit=700,466", "https://images.immediate.co.uk/production/volatile/sites/7/2018/10/GettyImages-113264835-8fe5a51.jpg?quality=90&fit=700,466", "https://images.immediate.co.uk/production/volatile/sites/7/2018/10/GettyImages-51524839-42c13a9.jpg?quality=90&fit=700,466", "https://images.immediate.co.uk/production/volatile/sites/7/2018/10/Podcast-Website-Deborah-Cadbury-3a2550e.jpg?quality=90&resize=375,341", "https://images.immediate.co.uk/production/volatile/sites/7/2018/10/GettyImages-3227593_CROP-0005720-227d90b.jpg?quality=90&resize=413,375", "https://images.immediate.co.uk/production/volatile/sites/7/2018/10/GettyImages-545940497-d54f93a-054daf9-3d81edd.jpg?quality=90&resize=296,269", "https://images.immediate.co.uk/production/volatile/sites/7/2018/10/GettyImages-3311360-5586880.jpg?quality=90&fit=700,466", "https://images.immediate.co.uk/production/volatile/sites/7/2018/10/GettyImages-184254865-7f1576a-e1539100007905.jpg?resize=620,413?quality=90&resize=620,414", "https://images.immediate.co.uk/production/volatile/sites/7/2022/03/HEX_Podcast_100x100-d6773da.jpg?quality=90&resize=93,84", "https://images.immediate.co.uk/production/volatile/sites/7/2018/10/GettyImages-184254865-7f1576a-e1539100007905.jpg?resize=620,413", "https://images.immediate.co.uk/production/volatile/sites/7/2018/10/GettyImages-1041871248-2ab6854.jpg?quality=90&fit=700,466", "https://images.immediate.co.uk/production/volatile/sites/7/2018/10/GettyImages-171102912-06411d0.jpg?quality=90&fit=700,466", "https://images.immediate.co.uk/production/volatile/sites/7/2022/09/Subs-Xmas-2022-3-plus-Side-bar-c796bd3.jpg?quality=90&resize=556,494", "https://images.immediate.co.uk/production/volatile/sites/7/2021/09/HeX-logo-dark-b2d1ee8.png?quality=90&resize=600,155", "https://images.immediate.co.uk/production/volatile/sites/7/2018/09/Victoria-children-dfa5833.jpg?quality=90&resize=767,697", "https://images.immediate.co.uk/production/volatile/sites/7/2022/09/Subs-Xmas-2022-3-plus-Footer-ed49ab2.jpg?quality=90&resize=93,84", "https://images.immediate.co.uk/production/volatile/sites/7/2021/09/HeX-logo-light-9329121.png?quality=90&resize=220,57", "https://images.immediate.co.uk/production/volatile/sites/7/2021/09/HeX-logo-light-9329121.png?quality=90&resize=120,31"], "top_img": "https://images.immediate.co.uk/production/volatile/sites/7/2018/10/GettyImages-184254865-7f1576a-e1539100007905.jpg?resize=620,413", "keywords": [], "authors": [], "canonical_link": "https://www.historyextra.com/period/victorian/royal-wedding-dress-history-unusual-princess-eugenie-meghan-markle/", "title": "8 unconventional royal wedding dresses in history", "meta_data": {"viewport": "width=device-width", "title": "8 Unusual Royal Wedding Dresses From History | HistoryExtra", "description": "Unconventional royal wedding dresses worn by Queen Victoria, Marie Antoinette, Wallis Simpson and the Queen Mother, who broke from the rules of tradition and wore unusual colours, styles and materials on their wedding day", "twitter": {"creator": "HistoryExtra", "site": "HistoryExtra", "card": "summary_large_image"}, "og": {"title": "8 unconventional royal wedding dresses in history", "description": "For centuries, royal women were married in sumptuous garments and glittering jewels intended to announce the bride’s wealth and status rather than reflect her own personal taste. But from the 18th century onwards, royal wedding dresses began to display more personal touches, some of which became traditions for future royal brides. Here, historian Carolyn Harris reveals eight royal wedding dresses that were considered unusual, unconventional or innovative in their time…", "type": "article", "site_name": "HistoryExtra", "url": "https://www.historyextra.com/period/victorian/royal-wedding-dress-history-unusual-princess-eugenie-meghan-markle/", "image": {"identifier": "https://images.immediate.co.uk/production/volatile/sites/7/2018/10/GettyImages-184254865-7f1576a-e1539100007905.jpg?resize=620,413", "width": 620, "height": 413}}, "google-site-verification": "AXEtM3TW9pUp95y9LAm7u9CBH7d0vKQ99CH1POMYJ8E", "next-head-count": 41}, "movies": [], "publish_date": null, "source": "https://www.historyextra.com", "summary": ""}