{"url": "https://popculture.com/reality-tv/2018/06/10/khloe-kardashian-tristan-thompson-unite-friends-birthday/", "text": "Khloe Kardashian and Tristan Thompson made a rare appearance together for a friend's birthday party on Saturday in Cleveland.\n\nClick here to see the photos.\n\nKardashian threw a party for their friend Savas at the Marble Room restaurant. They went to the venue and sat together with a group of about a dozen people in the restaurant's private room, reports E! News.\n\n\"Khloe and Tristan were there together, they were sitting next to each other during dinner and there was no animosity between them,\" a source told the outlet. \"Everybody looked happy, normal and like they were having a great time.\"\n\nAfter dinner, the group left, the source said.\n\nKardashian did not share any photos from the party on Instagram, although she posted a brief clip from the dinner on her Instagram Story. In the brief clip, she wishes Savas a happy birthday and takes a picture of his birthday cake. E! News' source said the cake was brought to the restaurant for the party.\n\nThe Daily Mail published paparazzi photos of Kardashian and Thompson arriving at the restaurant. The 33-year-old is seen wearing a hat, an all-black outfit and thigh-high boots, carrying a leather pink pink handbag.\n\nThompson and Kardashian have remained together, even though photos of him cheating on her with other women while she was pregnant where published just days before Kardashian gave birth to their daughter, True Thompson, in April. However, they are rarely seen together.\n\nLast week, Kardashian did show support for Thompson at the NBA Finals in Cleveland. She was seen wearing a Cleveland Cavaliers sweatshirt during the first game, which the Cavs lost. The Cavs would go on to be swept by the Golden State Warriors.\n\nSince True's birth, Kardashian has remained in Cleveland. Earlier this month, her mother, Kris Jenner, told Us Weekly Kardashian plans to move back to Los Angeles soon.\n\nJenner also recently spoke about Thompson's cheating scandal at a fashion show on Friday.\n\n\"I think you just have to be there for your kid and follow their lead,\" Jenner told E! News. \"I'm not in that relationship or in that situation, so I really trust Khloe. She's so smart and such a great girl and she'll figure it out.\"\n\nSources have said Kardashian wants to keep her family together, especially with a child involved. One source even told PEOPLE last month that she wants to marry him someday.\n\n\"Khloé wants to get married eventually, but there are no serious wedding talks yet,\" the source explained. \"She does talk about a future with Tristan, though. She believes they can figure things out and have a happy life together. True is doing great, too. And Kris [Jenner] is so proud of all her grandkids. She constantly shows pictures of all the babies.\"", "images": ["https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200"], "top_img": "https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/reality-tv/news/khloe-kardashian-tristan-thompson-unite-friends-birthday/", "title": "Khloe Kardashian and Tristan Thompson Unite for Friend's Birthday Party", "meta_data": {"description": "Khloe Kardashian and Tristan Thompson made a rare appearance together for a friend's birthday [...]", "keywords": "Khloe Kardashian,Tristan Thompson", "news_keywords": "Khloe Kardashian,Tristan Thompson", "robots": "index, follow, max-image-preview:large", "twitter": {"card": "summary_large_image", "site": "PopCulture", "creator": "PopCulture", "title": "Khloe Kardashian and Tristan Thompson Unite for Friend's Birthday Party", "description": "Khloe Kardashian and Tristan Thompson made a rare appearance together for a friend's birthday [...]", "image": "https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200"}, "og": {"title": "Khloe Kardashian and Tristan Thompson Unite for Friend's Birthday Party", "type": "article", "url": "https://popculture.com/reality-tv/news/khloe-kardashian-tristan-thompson-unite-friends-birthday/", "image": {"identifier": "https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200", "width": 640, "height": 320}, "site_name": "Reality TV", "description": "Khloe Kardashian and Tristan Thompson made a rare appearance together for a friend's birthday [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#263240", "apple-mobile-web-app-capable": "yes"}, "movies": [], "publish_date": 1528585200.0, "source": "https://popculture.com", "summary": ""}