{"url": "https://www.glaad.org/blog/disney-channels-andi-mack-premiere-networks-first-lgbtq-storyline", "text": "The Disney Channel show “Andi Mack” will break new ground for the network during its second season premiere this Friday, October 27 at 8pm ET/PT when it introduces its first LGBTQ storyline. In the episode, Andi's friend Cyrus lets Buffy know that he has a crush on the same boy Andi does.\n\nFor anyone not yet familiar with the show, \"Andi Mack\" is a contemporary coming-of-age story about a relatable girl (Peyton Elizabeth Lee) who's trying to determine where she fits in and the many amazing ways she can live her life. On the eve of her 13th birthday, Andi learns that her older sister, Bex (Lilan Bowden), is actually her mother. This revelation puts Andi on an unfamiliar path of self-discovery which she navigates with the help of her loving, albeit complicated, family; her two best friends, Cyrus (Joshua Rush) and Buffy (Sofia Wylie); and her middle school crush, Jonah Beck (Asher Angel). Along the way, Andi learns that sometimes the unexpected is what makes life great.\n\nAnd in this season’s premiere episode, Cyrus begins to realize something about himself. Andi is hoping for her parents Bex and Bowie (Trent Garrett) to get married, all while awkwardly sorting out her feelings for classmate Jonah. Meanwhile, a second storyline depicts one of Andi's two best friends, 13-year-old Cyrus, as he's beginning to realize that he too has feelings for Jonah. This realization begins an important part of his journey to self-discovery as a gay teen and ultimately, his self-acceptance.\n\nIn the episode, Cyrus confides in Buffy. The scene, and what Buffy says to Cyrus, makes for positive role models both for kids and adult viewers. In subsequent episodes, Cyrus begins to understand himself, and can count on his supportive friends Buffy and Andi who, as teenagers, are also on a journey to self-discovery. He also grapples with how to tell his new girlfriend, Iris, about his new understanding of himself.\n\nThis story arc is a first for Disney Channel; it's the first time the channel has depicted a character's journey to self-discovery as an LGBTQ individual. However, it won’t be the first time an LGBTQ character has appeared on Disney Channel. Back in 2014, a lesbian couple appeared on an episode of “Good Luck Charlie.”\n\n\"With more and more young people coming out as LGBTQ, Andi Mack is reflecting the lives and lived experiences of so many LGBTQ youth around the country,\" said Sarah Kate Ellis, President and CEO of GLAAD. \"Television reflects the real life world and today that includes LGBTQ youth who deserve to see their lives depicted on their favorite shows. Disney has been a leader in LGBTQ inclusion and there are so many young people who will be excited to see Cyrus' story unfold.\"\n\n“’Andi Mack’ is a story about ‘tweens’ figuring out who they are,” a Disney Channel Spokesperson said. “Terri Minsky, the cast and everyone involved in the show takes great care in ensuring that it’s appropriate for all audiences and sends a powerful message about inclusion and respect for humanity.”\n\n“Andi Mack” was created and is executive produced by acclaimed writer Terri Minsky, also well-known as the creator of \"Lizzie McGuire.” Since its March 2017 premiere, viewer response has been overwhelmingly positive; the series has struck a chord with audiences due to its realistic lead character. The show’s median viewer age is 10 and it’s been the #1 series of the year so far for girls. It’s also been #1 in its time period among Kids 6-14 and the #1 series on Disney Channel VOD and on Disney Channel’s DisneyNOW App. It’s also the #1 series on Disney Channel UK and it will be launching on Disney Channels around the world through mid-2018.", "images": ["https://www.glaad.org/sites/default/files/logo.png", "https://www.glaad.org/sites/default/files/styles/1200px/public/images/2017-01/logo.png?itok=4qtEJGKE", "https://www.facebook.com/tr?id=1868283359864619&ev=PageView\n&noscript=1", "https://www.glaad.org/sites/default/files/styles/750px/public/images/2017-10/Andi%20Mack%20cast%20photo.jpg?itok=rNXeS-Y6&c=69b060810fb085833440b3e434858f77", "https://www.glaad.org/sites/default/files/styles/100px/public/images/2022-02/4Star%20125x125%20BW.jpg?itok=Q9TbGQdR", "https://www.glaad.org/sites/default/files/styles/100px/public/images/2022-06/candid-seal-gold-2022.png?itok=UeAc5kYZ", "https://www.glaad.org/sites/default/files/styles/1200px/public/images/2015-01/Glaad_White_email.png?itok=3IiH_AIo", "https://www.glaad.org/sites/default/files/styles/480x252/public/images/2022-10/Screen%20Shot%202022-10-07%20at%2011.18.38%20AM.png?itok=2wXte20w&c=223058fe85b431290fba1a22adfd1da8", "https://www.glaad.org/sites/default/files/styles/480x252/public/images/2022-10/NUP_198104_00557.jpg?itok=6T1ARysD&c=44265a2af223efc34e020f2f89989b13", "https://www.glaad.org/sites/default/files/styles/1200px/public/Group%20678.png?itok=Io7Eo3oA", "https://www.glaad.org/sites/default/files/styles/480x252/public/images/2022-10/Screenshot%202022-10-06%201.36.10%20PM.png?itok=ZUFy0j43&c=e55c5cab115ce47ca066fa70c75600fa", "http://www.glaad.org/files/glaad-logo-260x260.jpg"], "top_img": "http://www.glaad.org/files/glaad-logo-260x260.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.glaad.org/blog/disney-channels-andi-mack-premiere-networks-first-lgbtq-storyline", "title": "Disney Channel’s ‘Andi Mack’ to premiere the network’s first LGBTQ storyline", "meta_data": {"fb": {"app_id": 325362377501547}, "viewport": "width=device-width, initial-scale=1, maximum-scale=2, minimum-scale=1, user-scalable=yes", "description": "Disney Channel's “Andi Mack” will break new ground on its second season premiere when it introduces its first gay storyline.", "generator": "Drupal 7 (http://drupal.org)", "og": {"site_name": "GLAAD", "type": "article", "url": "https://www.glaad.org/blog/disney-channels-andi-mack-premiere-networks-first-lgbtq-storyline", "title": "Disney Channel’s ‘Andi Mack’ to premiere the network’s first LGBTQ storyline", "description": "Disney Channel's “Andi Mack” will break new ground on its second season premiere when it introduces its first gay storyline.", "updated_time": "2017-10-25T18:51:50-04:00", "image": {"identifier": "http://www.glaad.org/files/glaad-logo-260x260.jpg", "secure_url": "https://www.glaad.org/sites/default/files/GLAAD-Social-Share.jpg", "width": 1200, "height": 630}}, "twitter": {"card": "summary_large_image", "creator": "@glaad", "url": "https://www.glaad.org/blog/disney-channels-andi-mack-premiere-networks-first-lgbtq-storyline", "title": "Disney Channel’s ‘Andi Mack’ to premiere the network’s first LGBTQ", "description": "Disney Channel's “Andi Mack” will break new ground on its second season premiere when it introduces its first gay storyline.", "image": {"identifier": "https://www.glaad.org/sites/default/files/styles/1200x630/public/images/2017-10/Andi%20Mack%20cast%20photo.jpg?itok=oDLcpt9E&1665249447", "width": 1200, "height": 630}}, "article": {"published_time": "2017-10-25T15:28:22-04:00", "modified_time": "2017-10-25T18:51:50-04:00"}, "google-site-verification": "L741OXtQjDFysUojpweHw8Hp4GNiO9zeGMuIEtcoHF0"}, "movies": [], "publish_date": 1508959702.0, "source": "https://www.glaad.org", "summary": ""}