{"url": "https://www.cosmopolitan.com/entertainment/a19856414/cardi-b-offset-relationship-timeline/", "text": "Cardi B and Offset have had one hell of a relationship, amirite or amirite? From cheating rumors to a post-marriage split to a public faux proposal to welcoming a daughter—and now a legitimate divorce filing, to top it all off—Cardi and Offset have been through a lot. Pour out one in their honor and let’s take a look back on all the events that led up to today, shall we?\n\nEarly 2017: Offset and Cardi B meet for the first time after Offset notices her immense talent and requests a dinner. As a Migos profile in Rolling Stone tells it:\n\n“The couple met about a year ago at Offset’s insistence—while he watched her rise as an artist, his interest grew, then exploded. ‘I was like, Damn, I am on her!’ he says. ‘I am like, Shit, I like Cardi B!’ He had a publicist set up a dinner in New York for a select group of women, including Cardi.”\n\nBut their first real date? Keep reading because your S.O. could never.\n\nThis content is imported from {embed-name}. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nFebruary 5, 2017: Offset and Cardi B are spotted at the 2017 Super Bowl—which Offset later says was their first legit date. “That’s a power move!” he tells Rolling Stone.\n\nBecause life is good, Cardi B Insta Stories the date, and some lovely person compiles the whole thing on YouTube.\n\n\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nFebruary 14, 2017: Cardi B makes the relationship Instagram official with some more footage of their first date—and uses the word “babe” to describe Offset.\n\n\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nMay 1, 2017: Cardi B and Offset are spotted at a Met Gala after-party looking, if we may say, FLAWLESS.\n\nSplash News\n\nMay 16, 2017: They release the video for their first collaboration, “Lick.”\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nJuly 24, 2017: Offset buys Cardi B a custom $60K diamond chain, which she adores (who wouldn’t, amirite?):\n\nHere’s a glorious close-up:\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nAugust 27, 2017: Cardi B shuts down engagement rumors after fans read into her wearing a white dress. “It is not true!” she tells reporters at the VMAs: “I’m happy. Looking like I’m getting married. But I’m not there.”\n\nGetty Images\n\nOctober 11, 2017: Offset is out of the country for Cardi B’s birthday so he posts a video on Instagram and writes a highly adorable message.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nOctober 22, 2017: The pair appear to briefly split up when Cardi B posts a photo to Insta Stories captioned “single.”\n\nShe later posts an update, saying she’d exaggerated.\n\nOctober 27, 2017: Cardi B and Offset collaborate again, this time with Migos and Nicki Minaj.\n\nThis content is imported from Third party. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nAlso October 27, 2017: Offset pops the question to Cardi B in the most extra way possible—live onstage during Power 99 radio’s Powerhouse concert at the Wells Fargo Center in Philadelphia. This video of the sweet moment is possibly the best thing your eyeballs will ever have the pleasure of seeing.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nOctober 28, 2017: Cardi B shows off her ring in a series of posts on Instagram, writing, “Thank you for seeing the potential in me since you met me. For giving me advice molding me and loving me. You’re such a amazing man to me, your family, friends, kids and you are extremely talented.”\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nAlso, in case you’re wondering, the ring is a massive 8 carats. We know this because Offset tells everyone on Insta Stories.\n\nDecember 21, 2017: Cardi B debuts her single “Bartier Cardi” and fans criticize her for the many, many, many Offset references—including “Cardi put the pussy on Offset / Cartier, Cardi B brain on Offset.”\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nCardi B’s response?\n\nDecember 24, 2017: A video leaks of a man who appears to be Offset in bed with another woman. The clip was allegedly filmed in September and stolen from Offset’s iCloud. In a surprising twist, The Shade Room reveals that the reason Cardi B had posted about being single back in October was because she’d learned about his infidelity.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nDecember 25, 2017: Cardi B seemingly responds to cheating allegations with a brief yet to-the-point tweet:\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nI still put the pussy on offset 🤷🏽‍♀️Bartier Cardi — Cardi B (@iamcardib) December 25, 2017\n\nDecember 26, 2017: Cardi B and Offset pretend to have sex on Instagram Live, fully clothed. She later clarifies on Instagram Stories, writing, “I was not f–kin on live! Yaaa can’t be that slow.”\n\nJanuary 9, 2018: Cardi B responds to cheating rumors about Offset with a now-deleted tweet. “Why is it a problem that I want to take my time with a decision on my relationship?” she writes. “Why do I have to explain myself? I don’t ask ya why you still with that man that lives with his mom, that don’t pay your bills….Since when you guys had perfect relationship?”\n\nPer Newsweek, she also writes on Instagram, “Well if people are talking about it and keep asking me how I feel about the situation why not let them know? Right or wrong? No, it’s not right for a n---- to cheat…but what you want me to do? Go fuck me another n----? Start all over again and get cheated on again? This shit happens to everyone. People handle they relationship different soo.”\n\nThis content is imported from {embed-name}. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nJanuary 14, 2018: The Shade Room once again comes through and posts footage of Offset’s new Cardi B neck tattoo. Because nothing makes up for a cheating scandal like a public and extremely permanent declaration of love, right?\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nFebruary 27, 2018: Cardi B talks about Offset’s cheating scandal in an interview with Cosmopolitan (*waves hi*) and implies that she’s not guilt-free either. “It’s like everybody is coming down my neck like, ‘Why are you not leaving him? You have low self-esteem.’ I don’t have low self-esteem…I know I look good. I know I’m rich, I know I’m talented. I know I could get any man I want—any basketball player, football player. But I want to work out my shit with my man, and I don’t got to explain why. I’m not your property. This is my life...I’m going to take my time, and I’m going to decide on my decision….It’s not right, what he fucking did—but people don’t know what I did, ’cause I ain’t no angel.”\n\nApril 7, 2018: Cardi B shocks everyone by announcing her pregnancy *live* on SNL, during a performance in a gorgeous curve-hugging white dress:\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nHer manager later shares footage of her screaming “I’m free!” backstage. Lol.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nShe also tweeted about her pregnancy.\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nI started winning when the whole world was doubting on me !think imma lose with my little baby counting on me ? — Cardi B (@iamcardib) April 8, 2018\n\nAs did Offset.\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nC A R D I A N D I L O O K F O R W A R D T O O U R N E X T C H A P T E R T O G E T H E R pic.twitter.com/C1QizKV3Cb — OFFSET (@OffsetYRN) April 8, 2018\n\nApril 19, 2018: Cardi B appears on Ellen and reveals that Offset has already picked out a name for their baby. “My dude named the baby,” she said. “I really like the name. I’m gonna let him say the name since he named the baby.”\n\nThis content is imported from Third party. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nJune 25, 2018: Surprise! Turns out, Cardi and Offset have been married since September 2017. Wait, what?! TMZ was able to obtain the couple’s marriage license from Fulton County in Georgia. So that highly public proposal was…just for show.\n\nFunnily enough, at the BET Awards the night before the news broke, Offset thanked “his wife” onstage when his rap group Migos was accepting an award, which made people wonder if they were already married.\n\nJuly 10, 2018: The baby’s here! In a Beyoncé-esque move, Cardi reveals her daughter’s name via a floral Instagram pic the day after she gave birth. She captioned the photo “Kulture Kiari Cephus.” What a name! Twitter definitely had plenty to say about it.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nBut let’s be real. With parents named Belcalis Marlenis Almanzar and Kiari Kendrell Cephus, Kulture couldn’t have just any regular ol’ name.\n\nSeptember 20, 2018: Cardi B officially confirms that she and Offset have actually been married since September 20, 2017. And in case you were wondering what she wore to her wedding: It was a white tracksuit. Yup. Classic Cardi.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nDecember 5, 2018: In an unexpected twist, Cardi takes to Instagram to address all the people “bugging” her about her relationship. And as it turns out, she and Offset have fallen “out of love.” 😢 In the video, the rapper says, “It’s nobody fault, it’s just like, I guess we just grew out of love but we are not together anymore.” Sad.\n\n\n\nDecember 6, 2018: Cardi shared the first pic of Kulture’s face and the world forgot about her and Offset’s relationship drama for a solid day to focus on Kulture’s cuteness. I mean, look at her!!\n\nInstagram\n\nDecember 9, 2018: Back to our regularly scheduled programming. Offset tweets this:\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nFUCK YALL I MISS CARDI — OFFSET (@OffsetYRN) December 9, 2018\n\nAnd a day later, Cardi denied that their relationship was fake and just for publicity. She told her followers, “Ain’t no type of publicity that I would ever want that would have my daughter looking at me crazy when she gets older…but we never did anything for f*cking publicity, bitch. You think I got f*cking pregnant, could have ruined my career for f*cking publicity?”\n\nDecember 15, 2018: Offset apologized to Cardi on Instagram, saying, “I know I embarrassed you. I was partaking in activity I shouldn’t have been taking in.”\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nDecember 16, 2018: Uhh, so Offset just interrupted Cardi’s festival set and begged her to take him back. At the time, Cardi said, “I get that he’s trying. It’s hard. It’s gonna take a long time to—I don’t know what’s going to happen next…I just feel bad. This is why I don’t like surprises.” But soon after, it became apparent that her team (and maybe even she) knew he was planning to come onstage.\n\nDecember 22, 2018: They’re vacationing together, y’all. But according to Cardi, it’s nothing more than that. “I just had to get f*cked,” she said.\n\nJanuary 6, 2019: Offset and Cardi have reportedly been in constant communication and he even promised to “change his ways.”\n\nJanuary 31, 2019: A week after Cardi B said she missed being home with her family, TMZ reported Cardi B and Offset are getting back together and Cardi is apparently moving back to their Atlanta home.\n\nInstagram\n\nFebruary 10, 2019: Cardi and Offset make their reconciliation red-carpet official at the Grammys.\n\nAmy Sussman Getty Images\n\nMay 1, 2019: Even the Billboard Music Awards got a heavy dose of their red-carpet PDA.\n\nKevin Mazur Getty Images\n\nSeptember 20, 2019: 🎵Do you know what today is?🎵 It’s their anniversary.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nDecember 9, 2019: Cardi opened up to Vogue about forgiving Offset. She told the magazine:\n\n“When me and my husband got into our issues—you know, he cheated and everything—and I decided to stay with him and work together with him, a lot of people were so mad at me; a lot of women felt disappointed in me. But it’s real-life shit. If you love somebody and you stop being with them and you’re depressed and social media is telling you not to talk to that person because he cheated, you’re not really happy on the inside until you have the conversation. Then if you get back with them, it’s like, how could you? You let all of us down. People that be in marriages for years, when they say till death do us part, they not talking about little arguments like if you leave the fridge open. That’s including everything.”\n\nDecember 24, 2019: They bought a mansion, and the tour will make you wish they adopted you yesterday.\n\nMay 11, 2020: Cardi celebrates Mother’s Day, and Offset wrote a super-sweet tribute for her. He gifted her two Birkins and a ton of roses and posted, “Happy Mother’s Day since I met you it’s been love thank you for my beautiful daughter she smart with attitude like you and talented like us both my kids and you help me become a better guy all around Thank You WIFE !!!!”\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nJune 21, 2020: Cardi posts a photo of Offset with his kids and another of Kulture playing with his hair.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nIf these Mother’s Day and Father’s Day pics don’t make you feel all warm and fuzzy, you might wanna do some soul-searching!!\n\nSeptember 15, 2020: Cardi has filed to divorce Offset after nearly three years of marriage after reportedly finding out he was unfaithful to her again, according to People. Cardi and Offset are set to appear in court on November 4. Neither Cardi nor Offset has made a statement about the issue. In the meantime, an Us Weekly source says that “Offset and Cardi both continue to put [their daughter] Kulture first through this troubling time.”\n\nAaand that brings us up to date on Cardi and Offset. I know it’s quite a somber note to end on, but if any other major events happen in their relationship, we’ll be sure to update you.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cardi-offset-1524156381.jpg?crop=1xw:1xh;center,top&resize=1200:*", "https://www.cosmopolitan.com/assets/icons/Instagram.svg", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-845448648-1544006510.jpg?crop=0.567xw:0.425xh;0.196xw,0.139xh&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cardi-offset-1524156381.jpg?crop=1xw:1xh;center,top&resize=1200:*", "keywords": [], "authors": ["Mehera", "Mehera Bonner Is A Celebrity", "Entertainment News Writer Who Enjoys Bravo", "Antiques Roadshow With Equal Enthusiasm", "She Was Previously Entertainment Editor At Marie Claire", "Has Covered Pop Culture For Over A Decade."], "canonical_link": "https://www.cosmopolitan.com/entertainment/a19856414/cardi-b-offset-relationship-timeline/", "title": "A Definitive Timeline of Cardi B and Offset’s Relationship", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=6", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "A Definitive Timeline of Cardi B and Offset’s Relationship", "description": "Major update: Cardi just filed for divorce.", "url": "https://www.cosmopolitan.com/entertainment/a19856414/cardi-b-offset-relationship-timeline/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cardi-offset-1524156381.jpg?crop=1xw:1xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2021-11-01T23:10:47Z", "published_time": "2020-09-15T20:42:00Z", "section": "Celebrities & Entertainment", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cardi-offset-1524156381.jpg?crop=1xw:1xh;center,top&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Rappers Cardi B and Offset's Relationship Timeline - Why Did Cardi B and Offset Split?", "description": "News broke today that Cardi B and Offset have split following a year of marriage. Catch up on all the couple's ups and downs here.", "keywords": "offset, cardi b, offset cardi b, offset cardi b relationship timeline, offset cardi b relationship, cardi b fiance, cardi b engaged, cardi b husband, cardi b boyfriend, cardi b baby daddy", "auto-publish": "never", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cardi-offset-1524156381.jpg?crop=0.5xw:1xh;center,top&resize=320:*", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrities & Entertainment,entertainment", "sailthru.date": "2020-09-15T20:42:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cardi-offset-1524156381.jpg?crop=1xw:1xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cardi-offset-1524156381.jpg?crop=0.5xw:1xh;center,top", "sailthru.socialtitle": "A Definitive Timeline of Cardi B and Offset’s Relationship", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1600202520.0, "source": "https://www.cosmopolitan.com", "summary": ""}