{"url": "https://www.cosmopolitan.com/entertainment/a9661158/miss-usa-interview-kara-mccullough-healthcare-feminism-pageants/", "text": "This content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nKára McCullough, Miss District of Columbia, was crowned Miss USA 2017 during the sparkly pageant Sunday night in Las Vegas. And while it would be wholly reasonable for her to spend this next week in bed (or at least on a couch in sweatpants, maybe sequinned sweatpants) relaxing and eating carbs, in the day and a half since her victory, she's upped and moved to New York City and begun an already-intense round of media appearances. Heavy is the head that wears the crown, after all, even if Kára says that crown is actually super light.\n\nAs her first in-depth interview, Kára spoke with Cosmopolitan.com on Tuesday morning. Read on for her take on the controversy surrounding her Q&A moments, both health care and \"equalism,\" as well as what she's most looking forward to now she's in NYC. OK, it's street food, but guess what kind?!\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nSo, you’re coming off just a kind of busy weekend, you know? How are you feeling this morning?!\n\nI'm well. I feel well-rested! I looked in the mirror this morning, and I was like, Whoa, I am Miss USA. And it just hit me [for the first time] like a ton of bricks. This entire experience has been so life-changing. And it’s just begun! I'm just so excited. I know there'll be tiring days coming up, but I'm really energized. I think the two bags of green tea that went in my cup this morning are really helping.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nWhat does the crown feel like?\n\nOh my goodness. It feels like a halo. If I could really explain it, it’s like that halo Snapchat filter; just imagine that. It’s so light, and I just can’t even believe that I’ve been honored and graced with this opportunity to wear it.\n\nCourtesy of Miss USA\n\nDuring the live broadcast, was there a moment when you went from being “confidently beautiful” to, say, confident you could win?\n\nWell, I showed up to win! But really, I think [that moment] came when they called me for top three. I was the first one [called]. I remember standing on the little box that they had us positioned on, and I just lifted my head and asked God for guidance, and just let him know I was extremely thankful. I think that was like my turning point, like OK, Kára, you could really have this in the bag. You could take this all the way back to D.C.\n\nLast year’s Miss USA, Deshauna Barber, was also Miss District of Columbia. Was that something that ever psyched you out or made you second-guess your chances?\n\nAbsolutely. There were like a lot of naysayers in my ear, saying, \"Ah, bad luck, states don't win back-to-back.\" But I had to let them know Drake put that out there in the universe for us and [D.C.] came back strong. Deshauna is just such a phenomenal person and she really broke so many pageant stereotypes. I'm just so thankful to have her as a sister, a friend, and a mentor — and her crowing me is by far one of the most honorable achievements that I've had.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nIn many respects, I think you’re also breaking some of those “pageant stereotypes” — your career in nuclear sciences, for example. How did you get into that line of work?\n\nI have a degree in chemistry [with a concentration] in radiochemistry from South Carolina State University, and I started my career at the United States Nuclear Regulatory Commission in 2013. My day-to-day job now involves nuclear licensing and regulations; the agency focuses on emergency preparedness for nuclear energy domestically.\n\nI can't even begin to tell you how much [my colleagues] have supported me. Initially I kept it a secret that I ran for Miss D.C. USA, but someone shared it on Facebook, and then the word got out, and there’s been a real outpouring [of love]. Everyone has been great.\n\nWill promoting the sciences be part of your Miss USA platform?\n\nAbsolutely. [I run] a self-funded program called Science Exploration for Kids, which encourages students to find joy in the STEM subjects, as well as a career path. I run after-school programs and tutoring sessions and symposiums. It’s about any or all of the sciences, although I am biased; I love to see people major in chemistry — because the numbers [in that field] are so low. I was actually the only person in my class to graduate with a degree in radiochemistry, and so every summer, I had a phenomenal internship and I got paid! That's why I always try to encourage students to find joy in science, because the opportunities are endless. And I love getting to see children having fun and enjoying their projects, and I just hope to expand their imagination through science.\n\nDo you have a go-to experiment to pique kids’ interest from the get-go?\n\nMy favorite one I call an \"explosion of colors.” It’s about how soap reacts with, like, fatty acids, and what I do is take a plate, fill the plate up with milk, and then put food coloring— your favorite colors, of course— in the middle of the plate. Then I’ll take a Q-tip with some soaps [on it] and put it right smack down in the middle of the plate amid the food coloring, and you'll see how the soap interacts with the milk. Basically, [the chemical reaction happening] makes the colors just spiral everywhere.\n\nI have to confess I hated science in school but I do like pretty colors.\n\nI'm going to make you love it. You'll come over and we're going to do some projects together.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nWhat’s been the response from your friends and family since the big win?\n\nI literally have 500 text messages on my phone right now. It might have gone up to 600 actually — all my family and friends were saying, \"Kára you’ve always been someone who is chasing after their dreams and actually executing them,\" and they're like, \"You're encouraging people in so many ways that you don't even see.\" Hearing comments like that is extremely gratifying, because you often don't realize the [impact] that you have on other people. I’m just on cloud nine. I'm so thankful for all the support.\n\nSomewhat on the flip side though, there’s been some controversy surrounding answers in the Q&A round and the “final word” segment. Is that something you’re aware of?\n\nYou know, social media [functions] at a hyperactive rate, and you can get messages and feedback instantly. I think [the response] is good because it shows that, for one, I’m starting a dialogue with important issues around our nation, right? And two, it’s amazing that people are sharing their opinions. There are going to be pros and cons, and there’s going to be two sides [to every argument], and I’m just thankful that at least there is some conversation.\n\nGetty Images\n\nTotally. I think, in 30 or 45 seconds, it can be really difficult to unpack your opinion on a hot-button issue. Is there anything you’d like to clarify, or expand on, regarding your answers about health care as a privilege, or your stance on feminism vs. “equalism”?\n\nAs a scientist, first of all, we’re very long-winded. If it were up to me that would have been a four-hour long discussion [about health care]. But I own what I say, and I’m thankful for the opportunity to speak on something so important [even for] 30 seconds. But thank you, if I have the opportunity just to clarify, I would definitely love to let people know that, yes I am privileged to have health insurance — it’s a privilege for me, and I’m thankful for that. But I also do believe health insurance is a right for everyone.\n\nAnd I’m all about women’s rights. Yes, I would have to say I am a feminist. But, when I look at the term \"equalism,\" [I used it] because I’ve seen firsthand in the workplace that we need those equal opportunities when it comes to leadership. And you know, the word [feminism] can carry different connotations [depending on what] generation you come from, or what background, but I don’t want anyone to think I’m not an active [supporter of] women’s rights. If anyone wants to challenge me on that, please call me. There are multitudes of women working at the Nuclear Regulatory commission, for example, making so many strides in leadership. And I support them 100 percent. Go to my social media pages and you’ll see I give shout-outs to so many of my colleagues, because I look up to them. They really embody what a hard-working woman is, someone who doesn’t take no for an answer, who’s very unapologetic about her leadership and her abilities.\n\nHave you ever experienced discrimination in the workplace, or while competing in pageants? For many people, the stereotypes of pageants being old-fashioned and, say, a bitchy competitive environment remain.\n\nWell, I believe that I hold my own and I know if I need to speak up for myself, I will do that. If I feel as if something isn’t equal, then I will speak out on my own behalf.\n\n[With pageants], there are those old stereotypes, but what people have to understand, and I know many people do know, is with time comes change. I know that the paradigm has changed — look at this year’s Miss USA, every woman on that stage is accomplished, and when I say accomplished, oh my goodness. [First runner-up] Miss New Jersey is a phenomenal woman! She was actually a friend prior to the competition and just standing up there with her [at the end], I think either of us would have been satisfied [with either outcome].\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nSo when do you start preparing for Miss Universe — you’ve just moved to New York also, right? So much going on!\n\nYes, honestly [I love] just seeing the bodegas everywhere! I love a good cheesesteak — I know that’s [supposed to be] a Philly thing, but New York just seems to have it going on. And I think D.C. is a little bit slower [of a city], so the best part about New York for me is that it just never sleeps. I've wanted to live here for a couple years now so I’ve hit the ground running. I've seen clips [from Miss USA] online but I would love to watch the whole show back to see where I can improve. I don’t think there’s going a moment of down time and I’m excited. If you’re not busy, what are you really getting done?\n\nOK, this is too good: Are we going to see a cheesesteak-themed national costume at Miss Universe, then?! Please say yes.\n\nI’ll be in a gyro-themed suit, with chopped cheese on the side. [Laughs.] That might not actually be a bad idea. I’ll make sure to tag you in the Instagram credits.\n\nThis interview has been edited and condensed.", "images": ["https://www.cosmopolitan.com/assets/icons/Instagram.svg", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/usa2017-01968-1494636684.jpg?crop=1.00xw:0.752xh;0,0.159xh&resize=300:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-683331556-1494952993.jpg?crop=1.00xw:0.625xh;0,0.0902xh&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-683331556-1494952993.jpg?crop=1.00xw:0.625xh;0,0.0902xh&resize=1200:*", "keywords": [], "authors": ["Alex Rees", "Deputy Editor Of News", "I M The News Director Here At Cosmopolitan.Com", "I Could Really Use A Cup Of Tea Right Now."], "canonical_link": "https://www.cosmopolitan.com/entertainment/a9661158/miss-usa-interview-kara-mccullough-healthcare-feminism-pageants/", "title": "Miss USA Kára McCullough: \"Yes, I Would Say I'm a Feminist\"", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=6", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "Miss USA Kára McCullough: \"Yes, I Would Say I'm a Feminist\"", "description": "The new Miss USA responds to the ~controversy~ surounding her Q&A round moment and also explains what her glitzy big crown feels like.", "url": "https://www.cosmopolitan.com/entertainment/a9661158/miss-usa-interview-kara-mccullough-healthcare-feminism-pageants/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-683331556-1494952993.jpg?crop=1.00xw:0.625xh;0,0.0902xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2021-11-01T23:29:55Z", "published_time": "2017-05-16T17:07:00Z", "section": "Celebrities & Entertainment", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-683331556-1494952993.jpg?crop=1.00xw:0.625xh;0,0.0902xh&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Miss USA Kara McCullough Interview — 2017 Miss USA Talks Feminism, Healthcare, and Cheesesteaks", "description": "The new Miss USA responds to the ~controversy~ surounding her Q&A round moment and also explains what her glitzy big crown feels like.", "keywords": "beauty queens, feminism, healthcare, kara mccullough, miss universe, miss usa, pageants, women's rights", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-683331556-1494952993.jpg?crop=0.803xw:1.00xh;0.0995xw,0&resize=320:*", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrities & Entertainment,entertainment,kara mccullough,women's rights,miss universe,beauty queens,miss usa", "sailthru.date": "2017-05-16T17:07:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-683331556-1494952993.jpg?crop=1.00xw:0.625xh;0,0.0902xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-683331556-1494952993.jpg?crop=0.803xw:1.00xh;0.0995xw,0", "sailthru.socialtitle": "Miss USA Kára McCullough: \"Yes, I Would Say I'm a Feminist\"", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1494954420.0, "source": "https://www.cosmopolitan.com", "summary": ""}