{"url": "https://www.wmagazine.com/story/paris-jackson-cara-delevingne-ashley-benson-caroline-damore-rumors", "text": "Now that she’s become a celebrity in her own right, Paris Jackson is a modern-day tabloid fixture. With that, unfortunately, comes having every aspect of her life analyzed. Her relationship status and dating life are part of that, and when a recent report surfaced that alleged Jackson was dating three women at once, the daughter of the pop icon Michael Jackson took it upon herself to set the record straight.\n\nAfter Gossip Cop published a report refuting that Jackson was dating three women at the same time—Cara Delevingne, Ashley Benson, and Caroline D’Amore, according to The National Enquirer—Jackson’s rep also denied it all, saying, “No idea how or why they come up with this stuff. Definitely not true.” Jackson later hopped on Twitter to echo that statement, tweeting, “I’ve never met miss benzo. Caroline is one of my bestest friends who is **straight** and **married**, and also the mother of my godchild. Cara and I were never officially exclusive, you guys made that up.”\n\nThe report, which said “things could get quite nasty if Paris doesn’t choose one of these girls to date exclusively,” is the kind of fan-fiction that has become an annoying reality for celebrities who don’t adhere to heteronormative sexuality. Delevingne, who has spoken out about not wanting to be “pigeonholed” before, has also dealt with overzealous tabloid coverage of her love life.\n\nJust last month, after Delevingne was seen holding hands with Benson as they walked around New York City wearing matching backpacks, some speculated that the pair were an item. Fueling that rumor, or trolling it, or both, Benson later shared the photo on her Instagram, writing, “Cute cute cute.”\n\nAs for D’Amore, it’s somewhat of a mystery how she became entangled in this rumor. The DJ has been married to her husband, Bobby Alt, since 2012, and the couple welcomed their first child, a daughter, Isabella Viking Alt, back in 2015. As Jackson noted, she’s the godmother of their child. The women have flaunted their friendship on social media for quite some time now, with D’Amore recently thanking Jackson on Instagram for her friendship, writing, “Words don’t do this friendship justice but you know how much I love you. Thank you for supporting me as always @parisjackson.” So take it all with a big grain of salt.", "images": ["https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/wmag/2018/06/21/5b2c11270008757085e61679_paris-jackson-on-dating-and-relationship-status.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/wmag/2018/06/21/5b2c11270008757085e61679_paris-jackson-on-dating-and-relationship-status.jpg?w=414&h=276&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2022/10/5/47b5fa0f-fc48-4cb1-9604-6f5821fa832d-getty-1430611960.jpg?w=160&h=160&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.5093&fp-y=0.3502", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2022/8/29/9f122c0b-8ad0-4d04-b2cf-3379547870db-tswifty.jpeg?w=160&h=160&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.532&fp-y=0.228"], "top_img": "https://imgix.bustle.com/wmag/2018/06/21/5b2c11270008757085e61679_paris-jackson-on-dating-and-relationship-status.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.wmagazine.com/story/paris-jackson-cara-delevingne-ashley-benson-caroline-damore-rumors", "title": "Paris Jackson Clarifies Her Dating and Relationship Status With Cara Delevingne, Ashley Benson, and Caroline D’Amore", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@wmag", "card": "summary_large_image", "creator": "@marissagmuller"}, "article": {"publisher": "https://www.facebook.com/wmagazine"}, "og": {"site_name": "W Magazine", "url": "https://www.wmagazine.com/story/paris-jackson-cara-delevingne-ashley-benson-caroline-damore-rumors", "type": "article", "title": "Paris Jackson Just Addressed Rumors She's Dating Three Women at the Same Time", "description": "\"Cara and I were never officially exclusive.\"", "image": {"identifier": "https://imgix.bustle.com/wmag/2018/06/21/5b2c11270008757085e61679_paris-jackson-on-dating-and-relationship-status.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "\"Cara and I were never officially exclusive.\""}, "movies": [], "publish_date": null, "source": "https://www.wmagazine.com", "summary": ""}