{"url": "https://www.cosmopolitan.com/entertainment/books/a9560228/caitlyn-jenner-book-reveals/", "text": "Grand Central Publishing\n\nCaitlyn Jenner's long-in-the-works book has finally arrived, and as you can guess from that title, it is indeed full of secrets — so many secrets, in fact, that it's become a point of contention with Mama Kris on Keeping Up With the Kardashians. There's nothing particularly shocking in the book (except for maybe the part where Caitlyn implies she came up with the idea for KUWTK), but it's easy to see why Kris might not approve of everything she read. Below, the book's 16 biggest reveals.\n\n\n\n1. She felt she didn’t deserve the Arthur Ashe Courage Award. Caitlyn writes that she doesn't necessarily feel \"brave\" because she chose to go public with her gender identity issues, despite the fact that her decision is often described that way. \"For me it was a form of cowardice to wait so long,\" she says, adding that she doesn't think she deserved the award bestowed on her by the ESPYs back in 2015, \"but nobody would turn down such an honor.\"\n\n\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n2. But wants you to know that it was not a prearranged publicity stunt. Because the ESPYs took place so soon after Caitlyn's Diane Sawyer interview and Vanity Fair cover, rumors circulated that she only agreed to do the 20/20 special if she got the award. \"It is 100 percent wrong, complete bullshit,\" Caitlyn writes. \"The actual interview took place months before I was told I would be receiving the Arthur Ashe award.\"\n\n3. Caitlyn’s publicist first killed a story about her gender identity in the 1980s. After finding out that the New York Times had been looking \"to pin down a story\" on Caitlyn wearing women's clothing, Caitlyn told her publicist Alan Nierob about her feelings and had him kill it. \"He pounds the crap out of the Times,\" Caitlyn writes. \"It works.\"\n\n4. She did a screen test for Superman but didn’t want to cut her hair for the role. \"My hair is one of the few ways I can feel my femininity, and it is these tentacles that keep me going, make me feel some tiny piece of my authentic self.\"\n\n5. Caitlyn’s relationship with Khloé remains fractured. This much is obvious if you've seen any recent episodes of KUTWK, but according to Caitlyn, her relationship with Khloé has not fully recovered since her transition. \"Khloé has the hardest time with it,\" she says. \"It is something Khloé and I should talk about privately, as we have on many occasions on other sensitive subjects. But we have not, although I have tried. We have not been the same since.\"\n\n6. The Kardashians were intentionally left out of the first Diane Sawyer special. If you watched 20/20 and thought it seemed like there wasn't very much Kris and the gang, you were right. \"They are right to feel slighted,\" says Caitlyn. \"They were slighted on purpose because of research showing that anytime a Kardashian is on television, many in the public tend to think it is a publicity stunt to make money.\"\n\n7. During her marriage to Kris, Kris had total control over Caitlyn’s finances. According to Caitlyn, she did not have a checking account during the peak KUTWK days and her credit card purchases were \"carefully pored over.\"\n\n8. Caitlyn really did not like O.J. Simpson. Caitlyn got to know him via Kris's friendship with Nicole Brown Simpson and never enjoyed spending time with him: \"He was the most narcissistic, egocentric, neediest asshole in the world of sports I had ever seen, and I had seen a lot of them.\"\n\n9. Caitlyn thought O.J. was guilty, and according to Caitlyn, so did Kris and Robert Kardashian. Caitlyn says that she and Kris \"believed he had done it the minute we heard of her murder and the circumstances surrounding it.\" As for Kardashian, who died in 2003, Caitlyn claims that he once said while in a car, \"I would've been OK with it if they'd gotten him in the first trial.\"\n\n10. Rumors that Caitlyn regretted transitioning are completely untrue. Ian Halperin, who wrote the unauthorized biography Kardashian Dynasty, claimed in 2016 that Caitlyn regretted her transition. Caitlyn slams these rumors as \"100 percent wrong and garbage and swill.\"\n\n11. She may have been the real brains behind the KUTWK operation. In one throwaway line, Caitlyn hints that she's actually the person who came up with the idea to film the Kardashian family. \"The house is awash in puberty and adolescence and young adulthood and two parents with very different styles,\" she writes. \"It seems to me something is there for television.\" Then, in a new paragraph: \"Kris says she is the one who came up with the idea and decided to actively pitch it to Ryan Seacrest.\" Care to weigh in, Ryan?\n\n12. Caitlyn’s family was embarrassed by KUTWK. Caitlyn says her aunt Ellie sent a letter to her and Kris after the show debuted about how Caitlyn had become a \"disappointment\" to her fans. \"The implication is that I have sold myself out, willingly destroyed what positive reputation I have left,\" she writes. \"Pretty much on the mark.\"\n\n13. But Caitlyn says her depiction on the show was more or less accurate. \"I come across in the reality show as a well-meaning but slightly doddering patriarch who has no life of his own and is subsumed by the women who surround him and only does what his wife tells him,\" she writes. \"In other words: a totally true depiction.\"\n\n14. Burt, Brandon, and Brody Jenner hated Caitlyn’s Vanity Fair cover. Caitlyn says it had less to do with the photograph being \"risqué\" and more to do with the fact that she \"did not gauge how a son would feel seeing his father in a cream-colored bustier.\"\n\n15. Kim was a little disappointed that Caitlyn spelled her name with a \"C.\" Caitlyn's recollection of this conversation makes it seem like Kim was joking, but Caitlyn also had this to say about Kim even asking about it: \"Spoken like a true Kardashian.\"\n\n16. Caitlyn had gender confirmation surgery, which she calls \"the Final Surgery,\" in January 2017. While this is not something a transgender person ever has an obligation to discuss (and Caitlyn herself reiterates several times that it's no one's business but the person who's having it), Caitlyn says she chose to include it because she wanted to be able to stop talking about it. \"I feel not only wonderful but liberated,\" she writes. \"I am telling you because I believe in candor. So all of you can stop staring. You want to know, so now you know. Which is why this is the first time, and the last time, I will ever speak of it.\"\n\nFollow Eliza on Twitter.\n\n", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/caitlyn-jenner-01-1493214759.jpg?crop=0.896xw:0.894xh;0,0.106xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/caitlyn-jenner-01-1493214759.jpg?crop=0.896xw:0.894xh;0,0.106xh&resize=1200:*", "keywords": [], "authors": ["Eliza Thompson", "Senior Entertainment Editor", "I M The Senior Entertainment Editor At Cosmopolitan.Com", "Which Means My Dvr Is Always Percent Full."], "canonical_link": "https://www.cosmopolitan.com/entertainment/books/a9560228/caitlyn-jenner-book-reveals/", "title": "The 16 Biggest Reveals From Caitlyn Jenner’s New Memoir", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=6", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "The 16 Biggest Reveals From Caitlyn Jenner’s New Memoir", "description": "She's got a lot of thoughts on the O.J. trial.", "url": "https://www.cosmopolitan.com/entertainment/books/a9560228/caitlyn-jenner-book-reveals/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/caitlyn-jenner-01-1493214759.jpg?crop=0.896xw:0.894xh;0,0.106xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2021-11-01T23:31:11Z", "published_time": "2017-04-25T21:28:00Z", "section": "Books", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/caitlyn-jenner-01-1493214759.jpg?crop=0.896xw:0.894xh;0,0.106xh&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "The 16 Biggest Reveals From Caitlyn Jenner’s Memoir - Caitlyn Jenner Secrets of My Life", "description": "A roundup of the most surprising revelations from Caitlyn Jenner's book The Secrets of My Life.", "keywords": "caitlyn jenner, caitlyn jenner book, secrets of my life, caitlyn jenner transition, caitlyn jenner secrets of my life", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/caitlyn-jenner-01-1493214759.jpg?crop=0.504xw:1.00xh;0.250xw,0&resize=320:*", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrities & Entertainment,entertainment,books", "sailthru.date": "2017-04-25T21:28:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/caitlyn-jenner-01-1493214759.jpg?crop=0.896xw:0.894xh;0,0.106xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/caitlyn-jenner-01-1493214759.jpg?crop=0.504xw:1.00xh;0.250xw,0", "sailthru.socialtitle": "The 16 Biggest Reveals From Caitlyn Jenner’s New Memoir", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1493155680.0, "source": "https://www.cosmopolitan.com", "summary": ""}