{"url": "https://web.archive.org/web/20170821220208/http://www.papermag.com/mariah-carey-las-vegas-2474234371.html", "text": "\n\n\n\nMariah Carey is famous for loving \"moments.\" It could be a \"butterfly moment.\" Or a \"hot tub moment.\" But right now, it's a \"Las Vegas moment.\" The sexy superstar just wrapped up Mariah: #1 to Infinity, her first-ever Vegas residency, where she performed all 18 of her #1 hits at the Colosseum at Caesars Palace. Fans who didn't catch Mimi's Vegas show will get another chance in December when she returns to the Colosseum for All I Want for Christmas Is You, a holiday concert series that, yes, will be sure to feature that iconic, titular hit. (For those unable to head out West for the holidays, you can also catch Mariah's Christmas shows at New York's Beacon Theatre.) On top of these performances, the pop star has her hands in two film projects: the first, All I Want For Christmas Is You, is an animated movie based on her holiday hit and out this November and the second, The Star, is another animated feature out the same month in which she wrote the film's titular song.\n\nAt our cover shoot, Carey's outfits channel the glittery, over-the-top extravagance of her new city. \"I think this is kind of a fairy princess moment,\" she says of one sparkly gold tulle gown. \"And I took off my shoes to be very Cinderella,\" she adds. \"Although I don't know that Cinderella went as plunging in the neckline.\" So, an adult, glamorous Cinderella? \"Adult, glamorous...yeah, I guess so,\" she says. \"If I have to be an adult, sure.\"\n\nClick through for more Mariah photos from our 'Las Vegas' cover story!\n\nWhat made you decide to do a show in Las Vegas?\n\nWell, I just thought it would be something in between albums, because now I'm working on a new album and new singles, and I just thought it was a great place to be able to be. Because I have twins [Moroccan and Monroe], who just turned six...to have them be in one place for a period of time rather than, like, touring for all that time [is great]. They go with me.\n\nAnd they say 'What happens in Las Vegas stays in Las Vegas.' Do you have any of those kinds of moments that you really cut loose?\n\nWell, it's hard because sometimes it's like two nights on back to back so I don't really [go out] -- it's not like, 'WOO HOO,' let's, like, go wild on the Las Vegas strip, but occasionally some of my friends and I will drive around, have fun, go to different places, do whatever.\n\nIf your friend was going to Las Vegas for the first time, besides seeing your wonderful show, are there other things you would suggest they do?\n\nWell, if they have kids they should take them to the dentist that [my kids] go to, because it's a kids' dentist and they have all these games there...I'm sitting here waiting to go to the dentist, like, 'Let me get toVegas so I can get to the dentist!'\n\nI can't imagine many people would recommend going to Las Vegas for a dentist.\n\nDarling, you've got to take care of your teeth.\n\nYour fans love your many 'Mariah moments.' You know, like your 'butterfly moment' or an 'off-the-shoulder moment' is something you're always loving. Are there any moments you're particularly feeling these days?\n\nI like good moments. There's often moments that I'm like, 'This is not a good moment.' But usually when I'm like, 'It's a moment,' I really mean it in a good way.\n\nWhat about a diva moment?\n\nI've never had a diva moment.\n\nNo?\n\nNo...Actually, I have had diva moments, and then people can't handle it. I guess it's a little intense, because I come from a true diva: My mother is an opera singer. And that's a real diva, you know -- Juilliard diva. And so other people that are like, 'I'm a diva,' it's like, 'Honey, you don't know what a diva is, you didn't grow up with my mom.' [Laughs] And I mean it as a compliment, or I wouldn't be the person I am without experiencing that. And so when people hear me say, like, 'Dahling da da da da' and talk that way, it's kinda like I'm channeling my mother. Not that she says 'dahling' all the time, but like that voice is... it's like I inadvertently do it, and I don't do it to be disrespectful, I just do it and it just happens and it's like, [in diva voice] 'I don't even know why.'\n\nSo you can't fight it; it's in your blood.\n\nI can't fight it, no.\n\nIf you could start a rumor about yourself, what would it be?\n\nStart a rumor about myself? Oh, do we have to do that? Can't we just leave it to all the other people who love to start rumors? I don't know. I've already said that I insist on having puppies everywhere I go, which would be great! Like, that would be great, no?\n\nYou're such a huge star, but can you remember the last time you were starstruck?\n\nThere's always people who I admire and when I see them [I get starstruck]. The last time I saw Prince, he came to my dressing room. I had said I wanted to go visit him to say hello because we've met before.When he was living we had had lots of conversations, and he helped me through certain moments that were not easy. I don't want to get too depressing, but I was having a conversation with Prince and then I looked around the room and I noticed that everyone in the room was looking up and staring like they couldn't believe he was standing there. But I would always be a little bit starstruck [when] I [saw] Michael Jackson as well.\n\nFinally, in three words, tell me what it's like to be Mariah Carey.\n\nPshh, three words!?\n\nYou can do more, but that's the challenge.\n\n[Laughs] So many things...Sooo. Many. Things. Those are my three words.\n\nStyling by Robért Behar\n\nHair by Tiger Bautista\n\nMakeup by Kristofer Buckle\n\nManicure by Christina Aviles at Opus Beauty for Dermelect\n\nPhoto Assistants: Eric Larson, Chris Baldwin and Robert Kozek\n\nDigital Capture: Chad Michael Brooks\n\n", "images": ["https://web.archive.org/web/20170821220208im_/https://papermag-img.rbl.ms/simage/https%3A%2F%2Fassets.rbl.ms%2F10252540%2F1200x600.jpg/2000%2C2000/t1IvIm6OqLyPIokN/img.jpg", "https://web.archive.org/web/20170821220208im_/http://www.papermag.com/static/img/whitelabel/papermag/Rainbow_Flag.png", "https://web.archive.org/web/20170821220208im_/http://adserver.adtechus.com/adserv|3.0|5151.1|4474356|0|0|ADTECH;loc=300;key=key1+key2+key3+key4;alias=", "https://web.archive.org/web/20170821220208im_/http://www.papermag.com/static/img/whitelabel/papermag/paper_title.png?2", "https://web.archive.org/web/20170821220208im_/http://adserver.adtechus.com/adserv/3.0/5151/4474355/0/0/ADTECH;loc=300;key=key1+key2+key3+key4", "https://web.archive.org/web/20170821220208im_/https://assets.rbl.ms/10252541/980x.jpg", "https://web.archive.org/web/20170821220208im_/https://adserver.adtechus.com/adserv/3.0/5151/3676213/0/225/ADTECH;loc=300;key=key1+key2+key3+key4", "https://web.archive.org/web/20170821220208im_/http://adserver.adtechus.com/adserv/3.0/5151/3988692/0/16/ADTECH;loc=300;key=key1+key2+key3+key4", "https://web.archive.org/web/20170821220208im_/http://adserver.adtechus.com/adserv/3.0/5151/4485978/0/0/ADTECH;loc=300;key=key1+key2+key3+key4;grp=[group]", "https://web.archive.org/web/20170821220208im_/https://adserver.adtechus.com/adserv/3.0/5151/3676211/0/0/ADTECH;loc=300;key=key1+key2+key3+key4;allowedSizes=728x90,970x250", "https://web.archive.org/web/20170821220208im_/http://www.papermag.com/mariah-carey-las-vegas-2474234371.html", "https://web.archive.org/web/20170821220208im_/https://assets.rbl.ms/10252542/980x.jpg", "https://web.archive.org/web/20170821220208im_/https://adserver.adtechus.com/adserv/3.0/5151/3676210/0/529/ADTECH;loc=300;key=key1+key2+key3+key4", "https://web.archive.org/web/20170821220208im_/https://adserver.adtechus.com/adserv/3.0/5151/3676214/0/16/ADTECH;loc=300;key=key1+key2+key3+key4", "https://web.archive.org/web/20170821220208im_/https://adserver.adtechus.com/adserv/3.0/5151/3742959/0/0/ADTECH;loc=300;key=key1+key2+key3+key4"], "top_img": "https://web.archive.org/web/20170821220208im_/https://papermag-img.rbl.ms/simage/https%3A%2F%2Fassets.rbl.ms%2F10252540%2F1200x600.jpg/2000%2C2000/t1IvIm6OqLyPIokN/img.jpg", "keywords": [], "authors": ["Interview Mickey Boardman", "Photos James White", "Photos Ellen Von Unwerth", "Mickey Boardman", "Michael Cu", "Claire Valentine"], "canonical_link": "https://web.archive.org/web/20170821220208/http://www.papermag.com/mariah-carey-las-vegas-2474234371.html", "title": "Mariah Carey Gets Revealing", "meta_data": {"twitter": {"card": "summary_large_image", "site": {"identifier": "@papermagazine", "id": 11277292}, "image": "https://web.archive.org/web/20170821220208im_/https://assets.rbl.ms/10252540/1200x600.jpg"}, "fb": {"app_id": 1507945686182456, "pages": 16081247185}, "og": {"type": "article", "url": "https://web.archive.org/web/20170821220208/http://www.papermag.com/mariah-carey-las-vegas-2474234371.html", "site_name": "PAPERMAG", "image": {"identifier": "https://web.archive.org/web/20170821220208im_/https://papermag-img.rbl.ms/simage/https%3A%2F%2Fassets.rbl.ms%2F10252540%2F1200x600.jpg/2000%2C2000/t1IvIm6OqLyPIokN/img.jpg", "width": 2000, "height": 1000}, "title": "Mariah Carey is Having a Las Vegas Moment", "description": "The sexy superstar heads to the strip."}, "article": {"published_time": "2017-08-21T15:58:52", "modified_time": "2017-08-21T17:17:13"}, "keywords": "mariah carey, all i want for christmas is you, divas, las vegas issue, las vegas, #1 to infinity", "description": "The sexy superstar heads to the strip.", "viewport": "width=device-width,initial-scale=1,minimum-scale=1.0,maximum-scale=1.0,user-scalable=no", "google-site-verification": "Kl4I7qPKJFthScnWAUSSvwIkK2ftHHrHS5_0PQBnwno"}, "movies": [], "publish_date": 1503327532.0, "source": "https://web.archive.org", "summary": ""}