{"url": "https://www.cnn.com/2017/10/11/politics/eminem-donald-trump-bet-hip-hop-awards/index.html", "text": "Story highlights Eminem slammed Trump in a freestyle rap at the BET Hip Hop awards He added a 'F--- you' to any of his fans who support Trump\n\nCNN —\n\nIn what is perhaps the fiercest and the most exhaustive attack against Donald Trump in hip-hop, Eminem “came to stomp” Tuesday night, calling the President everything from “Donald the b—-” to a “racist grandpa” in an explosive 4.5-minute freestyle rap.\n\nThe Detroit rapper challenged his fans at the BET Hip Hop Awards to “decide who you like more” – Eminem or Trump. He has slammed the President previously in the nine-minute 2016 freestyle “Campaign Speech” and in Big Sean’s “No Favors.”\n\n“And any fan of mine who’s a supporter of his, I’m drawing in the sand a line, you’re either for or against, and if you can’t decide who you like more and you’re split on who you should stand beside, I’ll do it for it for you with this. F— you,” he said toward the end, raising his middle finger.\n\nA request to the White House for comment was not immediately returned.\n\nThe latest freestyle, which Eminem revealed on Twitter is called “The Storm,” comes as anticipation for Eminem’s eighth studio release builds. The rapper decried Trump’s comments following the white supremacist rally in Charlottesville, questioned the President’s own patriotism following his attacks on athletes and Sen. John McCain, and in closing, issued a passionate tribute to Colin Kaepernick.\n\nFOR MORE: Check out the series\n\n“I appreciate you @Eminem,” Kaepernick tweeted, along with a fist emoji.\n\nThe former San Francisco 49ers quarterback is now a free agent after he rose to national prominence last fall when he refused to stand for the national anthem to protest police brutality. Eminem previously expressed his support for Kaepernick in “Campaign Speech.”\n\nHere are the 11 most explosive lines from his newest anti-Trump freestyle in the order that they appear:\n\n1) ‘A kamikaze that will probably cause a nuclear holocaust’\n\nHere’s the full verse: “We better give Obama props ‘cause what we got in office now is a kamikaze that will probably cause a nuclear holocaust while the drama pops, and he waits for s— to quiet down, he’ll just gas his plane up and fly around till the bombing stops.”\n\nRELATED: Hip-hop stars slam Trump amid anthem firestorm\n\nHere, Eminem is likely referencing Trump’s war of words on social media with North Korea’s Kim Jong Un, whom the President referred to as “little rocket man.”\n\n2) ‘Trump, when it comes to giving a s— you’re stingy as I am’\n\nThis line comes after Eminem references rising tensions in America.\n\n3) ‘Racism’s the only thing he’s Fantastic 4 cause that’s how he gets his rock off, he’s orange’\n\nFantastic Four - Heroes Unite Trailer (2015) - Miles Teller, Jamie Bell Superhero Movie HD\n\n4) ‘Cause he cannot withstand the fact we’re not afraid of Trump’\n\nHere’s the full verse: “That’s why he wants us to disband cause he cannot withstand the fact we’re not afraid of Trump. Walking on egg shells, I came to stomp. That’s why he keeps screaming, ‘Drain the swamp,’ cause he’s in quicksand.”\n\nHere, Eminem criticizes those who have been tepid when it comes to expressing their opposition to the President.\n\n5) ‘All these horrible tragedies and he’s bored and would rather cause a Twitter storm’\n\n“But this is his form of distraction, plus he gets an enormous reaction when he attacks the NFL, so we focus on that instead of talking Puerto Rico or gun reform for Nevada. All these horrible tragedies and he’s bored and would rather cause a Twitter storm with the Packers.”\n\nHere, the rapper slams the President for spending days attacking NFL players who take a knee and escalating the feud as a hurricane ravaged Puerto Rico and a massacre occurred in Nevada. Trump visited both Puerto Rico and Las Vegas following each disaster.\n\n6) ‘Who’s going to pay for his extravagant trips’\n\nFull verse: “He says he wants to lower our taxes, then who’s going to play for his extravagant trips back and forth with his fam to his golf resorts and his mansions?”\n\nLast month Trump unveiled a Republican framework for tax reform that calls for sweeping tax cuts and a simplification of the tax code.\n\n7) ‘Same s— that he tormented Hillary for and he slandered then does it more’\n\nFull verse: “Same s— that he tormented Hillary for and he slandered then does it more. From his endorsement of Bannon, support for the Klansman, tiki torches in hand for the solider that’s black and comes home from Iraq and is still told to go back to Africa.”\n\nHere, Eminem is referring to Trump’s former chief strategist Steve Bannon, who is also the executive chairman of the conservative media outlet Breitbart News.\n\n8) ‘This racist 94-year old grandpa’\n\nThis line comes before the rapper says Trump is ignoring America’s racist past.\n\n9) ‘To him, you’re zero cause he don’t like his war heroes captured’\n\n“He says you’re spitting in the face of vets who fought for us you b——-, Unless you’re a POW who’s tortured … cause to him you’re zero cause he don’t like his war heroes captured. That’s not disrespecting the military.”\n\nEminem accuses the President of disrespecting the military – a charge that Trump recently leveled against athletes who take a knee during the national anthem. In this lyric, he references Trump’s previous attacks on Arizona Sen. John McCain, who spent five years as a prisoner during the Vietnam War. In 2015, Trump questioned whether McCain is a war hero, saying, “I like people that weren’t captured, OK?”\n\n10) ‘F— that, this is for Colin, ball up a fist and keep that s— balled like Donald the b—-‘\n\nYou can check out hip-hop’s strongest lyrics on Kaepernick HERE.\n\n11) ‘The rest of America stand up. We love our military and we love our country but we f—— hate Trump’\n\nEminem’s latest attack is part of a larger trend in hip-hop, which turned on Trump in 2016 and largely settled for Democratic presidential nominee Hillary Clinton, after nearly three decades of idolizing his wealth and power in hundreds of lyrics.", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/150512163444-deena-zaru.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_100,h_100", "https://i.ytimg.com/vi/DMEa0CJbAUs/hqdefault.jpg", "https://media.cnn.com/api/v1/images/stellar/prod/170106163954-hip-hop-barack-obama-composite-do-not-use-for-upcoming-story.jpg?q=x_2,y_0,h_898,w_1596,c_crop/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/161025115846-donald-trump-hillary-clinton-hip-hop-politics.jpg?q=x_0,y_0,h_900,w_1599,c_fill/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/171010231422-eminem-trump-split.jpg?q=x_2,y_0,h_898,w_1596,c_crop/w_800", "https://media.cnn.com/api/v1/images/stellar/prod/170810083230-get-political-logo-large-169.png?q=h_80,w_175,x_0,y_0/w_1280", "https://media.cnn.com/api/v1/images/stellar/prod/170927123728-eminem-kendrick-lamar-kaepernick.jpg?q=x_0,y_0,h_900,w_1599,c_fill/h_144,w_256"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/171010231422-eminem-trump-split.jpg?q=x_2,y_0,h_898,w_1596,c_crop/w_800", "keywords": [], "authors": ["Deena Zaru"], "canonical_link": "https://www.cnn.com/2017/10/11/politics/eminem-donald-trump-bet-hip-hop-awards/index.html", "title": "Eminem unleashes on Trump at the BET Awards", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Eminem unleashes on Trump: The 11 fiercest lines | CNN Politics", "description": "In what is perhaps the fiercest and the most exhaustive attack against Donald Trump in hip-hop, Eminem \"came to stomp\" at the BET Awards.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/171010231422-eminem-trump-split.jpg?q=x_2,y_0,h_898,w_1596,c_crop/w_800", "type": "article", "url": "https://www.cnn.com/2017/10/11/politics/eminem-donald-trump-bet-hip-hop-awards/index.html", "site_name": "CNN"}, "twitter": {"title": "Eminem unleashes on Trump: The 11 fiercest lines | CNN Politics", "description": "In what is perhaps the fiercest and the most exhaustive attack against Donald Trump in hip-hop, Eminem \"came to stomp\" at the BET Awards.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/171010231422-eminem-trump-split.jpg?q=x_2,y_0,h_898,w_1596,c_crop/w_800", "card": "summary_large_image", "site": "@cnnpolitics"}, "description": "In what is perhaps the fiercest and the most exhaustive attack against Donald Trump in hip-hop, Eminem \"came to stomp\" at the BET Awards.", "template_type": "article_leaf", "type": "article", "meta-section": "politics", "meta-branding": "get-political", "theme": "politics", "article": {"published_time": "2017-10-11T04:49:26Z", "modified_time": "2017-10-12T08:58:11Z", "tag": "2016 presidential election, arts and entertainment, celebrities, discrimination, donald trump, elections and campaigns, eminem, government and public administration, government bodies and offices, music, political candidates, political figures - us, politics, racism and racial discrimination, rap and hip-hop music, societal issues, society, us federal elections, us federal government, us presidential elections, white house, colin kaepernick, sports figures", "publisher": "https://www.facebook.com/CNN"}, "keywords": "2016 presidential election, arts and entertainment, celebrities, discrimination, donald trump, elections and campaigns, eminem, government and public administration, government bodies and offices, music, political candidates, political figures - us, politics, racism and racial discrimination, rap and hip-hop music, societal issues, society, us federal elections, us federal government, us presidential elections, white house, colin kaepernick, sports figures", "author": "Deena Zaru", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1507676400.0, "source": "https://www.cnn.com", "summary": ""}