{"url": "https://www.bustle.com/p/josh-liza-getting-back-together-in-younger-season-5-would-make-star-nico-tortorella-so-so-happy-9338242", "text": "Secrets were revealed and lives were forever changed in Younger's Season 5 premiere. The game-changing episode was jam-packed with so much intense drama for Liza (Sutton Foster), Charles (Peter Hermann) and Kelsey (Hilary Duff) that in some ways it felt like a season finale. But a certain someone was missing from the beginning of Younger Season 5: Josh (Nico Tortorella). Aside from a brief conversation between Liza and Kelsey in the first few minutes of the Season 5 premiere about Josh's wedding, Liza's newly married ex was nowhere to be seen in the episode.\n\nRest assured, Josh is finally back in this week's episode, and while Tortorella (who uses they/them pronouns) was as sad as all Josh fans were that their character wasn't in the premiere, they think it was for the best. \"There is some big stuff coming and I think it leaves the fans with the exact feeling you're having right now of wanting him even more coming up in the future,\" they tell Bustle. \"I mean, the finale was so Josh-centric that I feel like it needed some air to breathe, you know?\"\n\nThe last time Younger fans saw Josh, he was tying the knot with Claire (Anastasia Barzee) despite only knowing her for one month. He had a mild case of cold feet, and almost got back together with Liza the night before the ceremony, but much to Liza's dismay he ended up going through with the wedding. When he does return to NYC, he'll have his new bride at his side.\n\nTVLand\n\n\"We'll find him back in New York City navigating what it means to be married after a month plus,\" Tortorella teases. \"That obviously comes with its hardships and its struggles.\"\n\nBut what the actor is most excited for fans to see from Josh's storyline this season is how Josh's relationship has evolved with Liza to a place that he's all too familiar with, because it's inspired in part by his real-life love life.\n\n\"We'll get to see a really special relationship between Josh and Liza as they're moving from this heavily romantic relationship to one platonic in nature and almost familial,\" Tortorella says. \"That's something that's really important in my life with any past relationships that I've had, I'm best friends with a lot of my exes. I don't even like calling them exes honestly. It is something that you don't really see on television, like ever. I'm happy to bring a piece of that to the small screen.\"\n\nTVLand\n\nBut fans who root for Josh and Liza to end up together shouldn't worry — Tortorella promises that their will-they-won't-they love story is far from over. \"That question will never go away,\" Tortorella says with a laugh. \"This is a Darren Star show. Claire very much so is a band-aid for a deeply open wound. I don't think the band-aid is quite big enough.\"\n\nWhile they can't go into specifics, Tortorella warns that there is definitely some trouble ahead for Josh. \"Josh has got to do some work on himself and some things happen at the beginning of this season that really smack him in the face,\" Tortorella says. \"I think Josh needs to fall in love with himself a little bit more.\"\n\nTVLand\n\nTortorella wants Josh to find happiness first and foremost in himself, but deep down, they ship their character with Liza. \"For the sake of the show, I want to see Josh and Liza end up together,\" Tortorella says with a laugh. \"That would make me very happy.\"\n\nRight now, it doesn't take much to make Tortorella happy — they're already on cloud nine after the debut of their book All of It Is You, a collection of original poetry exploring \"all of it,\" from the smallest cells in our bodies to the outer limits of our universe. The result of 45 straight days of doing nothing but writing, Tortorella's been overwhelmed by the response the book has gotten so far.\n\n\"It hits me at such a soul level,\" Tortorella says. \"I had a live reading at a bookstore in Brooklyn and it was my first live show. There is this musical component that lives with the poetry where it's almost like this moving meditation sound bath. There were probably 75 people that came to it and when they came to the book signing afterwards, the way that the people looked at me, it was like I'm finally seen. I'm creating work that's mine but is ours to have, ours as in the collective spirit.\"\n\nTVLand\n\nTortorella's voice gets huskier and slows down as they dive deeper into the meaning of All of It Is You. \"It really celebrates this oneness, this divine frequency of love that runs between all of us,\" they say. \"It's the type of thing that once it's recognized and celebrated, you can never un-see it. All over the world, on social media, people are celebrating it and celebrating themselves and that's the whole point, celebrating yourself while reading the book. It's just having this global impact right now that is just beyond any words that I can even comprehend. There's something so much bigger happening than the book – the book is a vehicle for the message. It is the chariot of god in one way or another and I am just a conduit for the message … if that wasn't space cadet enough for you.\"\n\nTortorella emits a self-deprecating laugh, but it's clear that their passion for poetry is real. They've already begun developing a follow-up book inspired by the reaction to All of It Is You, and they have so many ideas that it's hard to narrow it down to just one.\n\n\"I want to hone it in on different sections and explore some different parts of my life and the collective life in longer form prose and verse and essays and nonfiction and fiction,\" Tortorella says. \"I want to keep playing with this mixed media idea.\" But first up for Tortorella is filming another season of Younger, since the TVLand comedy was just renewed for Season 6 ... and they're already campaigning for more Josh, including finally finding out his last name.", "images": ["https://imgix.bustle.com/uploads/image/2022/10/7/5d8f0698-b98b-460f-86bb-87733a815208-164650_6498_rv3.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2018/6/8/7ef1d56a-5ab9-4c06-9a90-73af116f141e-younger5.jpg?w=414&h=276&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2018/6/8/c4f551f1-0117-44e1-bae3-cae660b0c122-younger3.jpg?w=414&h=277&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2018/6/8/58061abf-c18a-4d14-89ea-e78cb922914f-younger4.jpg?w=414&h=276&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2018/6/8/26d1b9f1-1e24-470c-9087-9244f3a16241-younger1.jpg?w=800&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/10/7/242ace90-a761-407f-a76d-5201e9586714-screenshot-2022-10-07-at-180650.png?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2018/6/8/dcd2c300-ab25-4a31-ad1d-9951faf52075-younger2.jpg?w=414&h=276&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/10/7/079a0312-19f7-48f9-9771-fc7f8a1c3e14-screenshot-2022-10-07-at-155119.png?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2022/9/25/24ec8b2c-e550-4953-8d02-95b4dda6cc04-bridgerton_204_unit_03811r.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2018/6/8/26d1b9f1-1e24-470c-9087-9244f3a16241-younger1.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg"], "top_img": "https://imgix.bustle.com/uploads/image/2018/6/8/26d1b9f1-1e24-470c-9087-9244f3a16241-younger1.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/josh-liza-getting-back-together-in-younger-season-5-would-make-star-nico-tortorella-so-so-happy-9338242", "title": "Josh & Liza Getting Back Together In 'Younger' Season 5 Would Make Star Nico Tortorella So, So Happy", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image", "creator": "@SydneyBucksbaum"}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/josh-liza-getting-back-together-in-younger-season-5-would-make-star-nico-tortorella-so-so-happy-9338242", "type": "article", "title": "Josh & Liza Getting Back Together In 'Younger' Season 5 Would Make Star Nico Tortorella So, So Happy", "description": "Secrets were revealed and lives were forever changed in Younger's Season 5 premiere. The game-changing episode was jam-packed with so much intense drama for Liza (Sutton Foster), Charles (Peter Hermann) and Kelsey (Hilary Duff) that in some ways it…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2018/6/8/26d1b9f1-1e24-470c-9087-9244f3a16241-younger1.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "Secrets were revealed and lives were forever changed in Younger's Season 5 premiere. The game-changing episode was jam-packed with so much intense drama for Liza (Sutton Foster), Charles (Peter Hermann) and Kelsey (Hilary Duff) that in some ways it…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}