{"url": "https://web.archive.org/web/20170524125612/http://www.vanityfair.com/hollywood/2017/05/star-wars-the-last-jedi-cover-portfolio", "text": "Star Wars devotees who can’t wait for December need look no further. With exclusive access to writer-director Rian Johnson, plus interviews with Mark Hamill, Daisy Ridley, and others, V.F. presents the ultimate sneak peek at The Last Jedi—and Carrie Fisher’s lasting legacy.\n\nStar Wars devotees who can’t wait for December need look no further. With exclusive access to writer-director Rian Johnson, plus interviews with Mark Hamill, Daisy Ridley, and others, V.F. presents the ultimate sneak peek at The Last Jedi—and Carrie Fisher’s lasting legacy.\n\nStar Wars devotees who can’t wait for December need look no further. With exclusive access to writer-director Rian Johnson, plus interviews with Mark Hamill, Daisy Ridley, and others, V.F. presents the ultimate sneak peek at The Last Jedi—and Carrie Fisher’s lasting legacy.\n\nI. “We’re Going Back?”\n\nThe first trip to Skellig Michael was wondrous: an hour-long boat ride to a craggy, green island off the coast of Ireland’s County Kerry, and then a hike up hundreds of stone steps to a scenic cliff where, a thousand years earlier, medieval Christian monks had paced and prayed. This is where Mark Hamill reprised his role as Luke Skywalker for the first time since 1983, standing opposite Daisy Ridley, whose character, Rey, was the protagonist of The Force Awakens, J. J. Abrams’s resumption of George Lucas’s Star Wars movie saga. The opening sentence of the film’s scrolling-text “crawl,” a hallmark of the series, was “Luke Skywalker has vanished.” Atop Skellig Michael, at the picture’s very end, after an arduous journey by Rey, came the big payoff: a cloaked, solitary figure unhooding himself to reveal an older, bearded Luke, who wordlessly, inscrutably regarded the tremulous Rey as she presented to him the lightsaber he had lost (along with his right hand) in a long-ago duel with Darth Vader, his father turned adversary. It was movie magic: a scene that, though filmed in 2014 and presented in theaters in 2015, is already etched in cinematic history. The second trip to Skellig Michael? Maybe less of a thrill for an aging Jedi. Contrary to what one might have reasonably expected, that Abrams would have kept rolling in ’14, recording some dialogue between Luke and Rey in order to get a jump on the saga’s next installment—especially given that Skellig Michael is a UNESCO World Heritage Site, with access limited to the summer months, and only when the weather is cooperative—once Hamill and Ridley had nailed their epic staredown, that was a wrap. It fell to Abrams’s successor, Rian Johnson, the director of The Last Jedi, the eighth movie in the saga, which opens this December, to painstakingly re-stage the clifftop scene, with the two actors retaking their places more than a year later. Photograph by Annie Leibovitz. “When I read the script for Episode VIII, I went, ‘Oh my God, we’re going back?’ Because I said I was never going back,” Hamill told me when I sat down with him recently at his home in Malibu. He wondered, in vain, if they could drop him in by chopper this time, “which is so clueless of me, because there’s no landing pad, and it would mar the beauty of it all,” he said. Hamill is a youthful 65 but a sexagenarian nevertheless; whereas the fit young members of the crew were given 45 minutes to get up to the now iconic Rey-Luke meeting spot—carrying heavy equipment—Hamill was allotted an hour and a half, “and I had to stop every 10, 15 minutes to rest.” None of this was offered up in the form of complaint. Hamill just happens to be a rambling, expansive talker—in his own way, as endearingly offbeat a character as his friend and on-screen twin sister, Carrie Fisher, who passed away suddenly and tragically last December. Like Fisher, Hamill was put on a diet-and-exercise regimen after he was reconscripted into the Star Wars franchise. (Harrison Ford was under less obligation, having retained his leading-man shape because he never stopped being a leading man.) Over a spartan snack plate of carrot sticks and hummus, the man behind Luke held forth at length on this subject. Watch the video below for a behind-the-scenes look at Annie Leibovitz’s photo shoot with The Last Jedi cast and crew. “You just cut out all the things you love,” he said. “Something as basic as bread and butter, which I used to start every meal with. Sugar. No more candy bars. No more stops at In-N-Out. It’s really just a general awareness, because in the old days I’d go, ‘Well, I’m not that hungry, but oh, here’s a box of Wheat Thins,’ and you don’t put the Wheat Thins in the same category as Lay’s potato chips, and yet I would sort of idly, absentmindedly eat these things while watching Turner Classic Movies, and ‘Oh, I ate the whole box!’ ” Hamill had been dieting and training for 50 weeks before he learned, via the Episode VII script he finally received from Abrams, that he would not appear in the movie until its last scene, and in a nonspeaking part at that. On this, too, he has a lot of thoughts. Though he grants that the delayed-gratification reveal of Luke was a narrative masterstroke, he’d have done things differently if he’d had his druthers. Han Solo’s death scene, for example. Why couldn’t Luke have made his first appearance around then? In the finished film, the witnesses to Han’s death, at the hands of his own son, the brooding dark-side convert Kylo Ren (Adam Driver), are his longtime Wookiee co-pilot, Chewbacca, and the upstart Resistance fighters Rey and Finn (John Boyega). Photograph by Annie Leibovitz. “Now, remember, one of the plots in the earlier films was the telepathic communication between my sister and me,” Hamill said. “So I thought, Carrie will sense that Han is in danger and try to contact me. And she won’t succeed, and, in frustration, she’ll go herself. Then we’re in the situation where all three of us are together, which is one of my favorite things in the original film, when we were on the Death Star. It’s just got a fun dynamic to it. So I thought it would have been more effective, and I still feel this way, though it’s just my opinion, that Leia would make it as far as she can, and, right when she is apprehended, maybe even facing death—Ba-boom! I come in and blow the guy away and the two of us go to where Han is facing off with his son, but we’re too late. The reason that’s important is that we witness his death, which carries enormous personal resonance into the next picture. As it is, Chewie’s there, and how much can you get out of [passable Chewbacca wail] ‘Nyaaarghhh!’ and two people who have known Han for, what, 20 minutes?” Still, Hamill recognizes that the popular response to The Force Awakens—its stirring ending in particular—was overwhelmingly positive, his misgivings be damned. “As I said to J.J.,” he recalled, “I’ve never been more happy to be wrong.” Besides, holding back Luke in VII means that Hamill gets a lot more screen time in VIII. And dialogue. This time, at last, Luke Skywalker talks. Photograph by Annie Leibovitz. II. A Long Way from Tosche Station\n\nRian Johnson, a sandy-haired, baby-faced 43-year-old Californian heretofore best known among cinéastes for his time-bending 2012 science-fiction film, Looper, is not only the director of Episode VIII but also its sole credited screenwriter. (Episode VII was written by Abrams, Lawrence Kasdan, and Michael Arndt.) Earlier this spring, in a screening room in the Frank G. Wells Building at Walt Disney Studios, in Burbank, California, Johnson described to me the approach he took to writing The Last Jedi, the second film of the Rey-centered trilogy. “J.J. and Larry and Michael set everybody up in a really evocative way in VII and started them on a trajectory. I guess I saw it as the job of this middle chapter to challenge all of those characters—let’s see what happens if we knock the stool out from under them,” he said. As it is, none of the main characters in The Force Awakens emerged from that picture in what can be described as a triumphal state. John Boyega’s Finn had been gravely wounded in a lightsaber duel with Kylo Ren. In a telephone interview from China, where he was filming Pacific Rim: Uprising, Boyega told me that, as teased in The Last Jedi’s first trailer, his character, Finn, begins the new movie in a “bacta suit,” a sort of regenerative immersion tank that, in the Star Wars galaxy, heals damaged tissue. Adam Driver, alluding both to Finn’s state and the scar seen on his own face in the trailer, told me, “I feel like almost everyone is in that rehabilitation state. You know, I don’t think that patricide is all that it’s cracked up to be. Maybe that’s where Kylo Ren is starting from. His external scar is probably as much an internal one.” Johnson was surprised at how much leeway he was given to cook up the action. But Johnson, in drawing up his screenplay, decided to raise the stakes further. “I started by writing the names of each of the characters,” he said, “and thinking, What’s the hardest thing they could be faced with?” At the top of Johnson’s list: Luke Skywalker. When he was last glimpsed in Lucas’s original trilogy, at the end of 1983’s Return of the Jedi, Luke was basking in victory and familial warmth, reveling with Princess Leia Organa, Han Solo, and their rebel compatriots at a celebratory Ewok dance party. Turning away for a moment from the festivities, he saw smiling apparitions of his two departed Jedi mentors, Yoda and Obi-Wan Kenobi, along with his late father, Anakin Skywalker, restored to his unscarred, un-Vadered form after redeeming himself in death, sacrificing his own life to save his son’s and slay the evil Emperor Palpatine. You’d have expected Luke to have shortly thereafter found a nice girl and settled into a contented existence on a tidy planet with good schools and dual sunsets, no more than a couple of parsecs from the Organa-Solos and their little boy, Ben. But no. Leia and Han’s romance didn’t last, and something heavy went down with twin bro. The result: the cloak, the hood, and monastic isolation of the damaged, Leonard-Cohen-at-Mount-Baldy variety. Photograph by Annie Leibovitz. So what happened to Luke? What we know from The Force Awakens is that he had been running some sort of Jedi academy when “one boy, an apprentice, turned against him, destroyed it all.” These are the words that Han Solo, prior to his death scene, offers to Rey and Finn—the inference being that the boy was Han and Leia’s son, and Luke’s nephew, Ben, the future Kylo Ren. “People that knew him best,” Han says of Luke, “think he went looking for the first Jedi temple.” That part of Luke’s legend, Johnson confirmed, is accurate. The site of Rey’s Force Awakens encounter with Luke is Ahch-To, the temple’s home planet, which bears a striking resemblance to southwestern coastal Ireland. Though their time on Skellig Michael was brief, the Last Jedi crew returned to the area for additional shooting on the Dingle Peninsula, a ragged spear of land that juts out into the North Atlantic. There, Johnson said, the set builders “duplicated the beehive-shaped huts where the monks lived on Skellig and made a kind of little Jedi village out of them.” Luke, it transpires, has been living in this village among an indigenous race of caretaker creatures whom Johnson is loath to describe in any more detail, except to say that they are “not Ewoks.” That Luke is so changed a person presented Johnson with rich narrative opportunities. The Last Jedi is to a large extent about the relationship between Luke and Rey, but Johnson cautions against any “one-to-one correlation” between, say, Yoda’s tutelage of young Luke in The Empire Strikes Back and old Luke’s tutelage of Rey. “There’s a training element to it,” he said, “but it’s not exactly what you would expect.” This being the spoiler-averse world of Lucasfilm, the production company behind the Star Wars movies, that’s about as specific as the director is willing to get. (No, he won’t tell you if Luke is related to Rey, or, for that matter, what species the super-villain Supreme Leader Snoke happens to be, or which character the title The Last Jedi refers to.) Photograph by Annie Leibovitz. But Johnson was happy to talk about Hamill’s performance, which, he said, “shows a very different side of the Luke character.” In the original Star Wars trilogy, Luke was the de facto straight man, playing off Ford’s rascally Han and Fisher’s tart, poised Leia, not to mention the droid comedy tandem of C-3PO and R2-D2. Hamill? He was cast for his sincere mien and Bicentennial-era dreamboat looks—part Peter Cetera, part Osmond brother. He still catches grief, he noted, for one particularly clunky line reading in the first movie, when Luke responds to his Uncle Owen’s order to polish up their newly purchased droids by complaining, “But I was going into Tosche Station to pick up some power converters!” Though his approach to the line was, he swears, deliberate—“I distinctly remember thinking, I’ve got to make this as whiny and juvenile as I can,” he said—Hamill admitted that his greenness as an actor left him with “somewhere to go later, where I wouldn’t make those kinds of choices.” In his years out of the spotlight, Hamill has flourished as a voice actor, most notably playing the Joker in a series of animated Batman TV shows, films, and video games. He performs the part with a demented brio and an arsenal of evil laughs ranging from Richard Widmark manic to Vincent Price broad—a far cry from the gee-whiz wholesomeness for which he is best remembered. Oscar Isaac, at 38 the senior member of the core cast’s “new kids” (Driver is 33, and Ridley and Boyega are in their mid-20s), is old enough to remember as a child revering Luke Skywalker. “So to be there, and to watch Mark revisit Luke, particularly in these scenes we were shooting towards the end of the film, was bizarre and jaw-dropping,” he told me. “It’s like when you see an old band re-unite and go on the road, and they don’t quite hit those high notes anymore—though in this situation it’s completely the opposite. It’s the fulfillment of where your imagination would take you when you imagine where Luke would go, or what he’s become.” Star Wars celebrates its 40th anniversary this week. Watch the video below to find out six things we wouldn’t have without the franchise. III. Significant New Figures\n\nOn the Disney campus, I sat in on a postproduction meeting in which Johnson was reviewing some scenes from The Last Jedi. Teams from Industrial Light & Magic, Lucasfilm’s visual-effects division, were videoconferencing in from London, San Francisco, and Vancouver. On a big screen, Poe Dameron, Isaac’s heroic X-wing fighter pilot, was back in action, coaching a gunner named Paige, a new character played by a Vietnamese actress named Veronica Ngo. Another scene featured General Hux, the nefarious First Order commander played with spittle-flecked relish by Domhnall Gleeson. Johnson loved what he was seeing but noted the presence of some “schmutz”—smudges around the edges—on the starcraft window that Hux was looking out of. “I don’t know, does the First Order not keep its windows clean?” he asked. “Did you guys play it that way before?” He raised the question more deferentially than critically (and Ben Morris, the movie’s London-based VFX supervisor, said it would be no problem to de-schmutzify the pane). Until The Last Jedi, Johnson had never overseen a picture with a budget above $30 million. But the director betrayed no sign of being overwhelmed. He is a gifted filmmaker whose previous movies, especially Brick (his 2005 debut) and Looper, are visually distinctive and intricately plotted, the assured work of a cinema-drunk U.S.C. film-school grad who, in preparation for Episode VIII, steeped himself in World War II movies like Henry King’s Twelve O’Clock High and “funky 60s samurai stuff” like Kihachi Okamoto’s Kill! and Hideo Gosha’s Three Outlaw Samurai. Photograph by Annie Leibovitz. The anointment of Johnson as Episode VIII’s overseer is emblematic of the direction in which Kathleen Kennedy has taken Lucasfilm since she assumed the presidency of the company, in 2012, the same year that George Lucas, who had personally recruited her to take his place, sold the company to Disney. Though she reached out to Abrams, a proven wrangler of blockbuster series (Mission: Impossible, Star Trek), to initiate the current Star Wars trilogy, Kennedy has since picked filmmakers whose résumés are less important than whether or not she is a fan of their work. Kennedy cut her teeth as a Steven Spielberg protégée—in the early 80s, when she was not yet out of her 20s, he entrusted her with producing E.T.—and now she, too, is keen on giving relative unknowns their big chance. Johnson was someone she’d had her eye on for years, she told me, admiring “how deliberate he is in his storytelling and the way he moves the camera.” The final film of the trilogy, due in 2019 and for the moment assigned the simple working title Episode IX, will be directed by Colin Trevorrow, who did not yet have the big-budget feature Jurassic World under his belt when he crossed Kennedy’s radar; he came to her attention via his first feature, the 2012 indie comedy Safety Not Guaranteed, and a recommendation from her friend Brad Bird, the Pixar auteur. Photograph by Annie Leibovitz. Part of what makes Lucasfilm’s new system work is that Kennedy has set up a formidable support structure for her filmmakers. Upon her arrival, she put together a story department at Lucasfilm’s San Francisco headquarters, overseen by Kiri Hart, a development executive and former screenwriter she has long worked with. The story group, which numbers 11 people, maintains the narrative continuity and integrity of all the Star Wars properties that exist across various platforms: animation, video games, novels, comic books, and, most important, movies. “The whole team reads each draft of the screenplay as it evolves,” Hart explained to me, “and we try, as much as we can, to smooth out anything that isn’t connecting.” What the story group does not do, Hart said, is impose plot-point mandates on the filmmakers. Johnson told me he was surprised at how much leeway he was given to cook up the action of Episode VIII from scratch. “The pre-set was Episode VII, and that was kind of it,” he said. If anything, Johnson wanted more give-and-take with the Lucasfilm team, so he moved up to San Francisco for about six weeks during his writing process, taking an office two doors down from Hart’s and meeting with the full group twice a week. Among Johnson’s inventions for The Last Jedi are three significant new figures: a “shady character” of unclear allegiances, played by Benicio Del Toro, who goes unnamed in the film but is called DJ by the filmmakers (“You’ll see—there’s a reason why we call him DJ,” Johnson said); a prominent officer in the Resistance named Vice Admiral Holdo, played by Laura Dern; and a maintenance worker for the Resistance named Rose Tico, who is played by a young actress named Kelly Marie Tran (and who is the sister of Paige, the character I witnessed in the scene with Poe Dameron). Tran’s is the largest new part, and her plotline involves a mission behind enemy lines with Boyega’s Finn, the stormtrooper turned Resistance warrior. Photograph by Annie Leibovitz. Rose and Finn’s adventure takes them to, among other places, another Johnson innovation: a glittering casino city called Canto Bight, “a Star Wars Monte Carlo–type environment, a little James Bond–ish, a little To Catch a Thief,” the director said. “It was an interesting challenge, portraying luxury and wealth in this universe.” So much of the Star Wars aesthetic is rooted in sandy desolation and scrapyard blight; it appealed to Johnson to carve out a corner of the galaxy that is the complete opposite. “I was thinking, O.K., let’s go ultra-glamour. Let’s create a playground, basically, for rich assholes,” he said. Canto Bight is also where viewers will get their multi-species fix of gnarled aliens and other grotesque creatures, a comic-relief staple of Star Wars movies since Luke Skywalker first met Han Solo amid the cankerous and snouty inhabitants of the Mos Eisley cantina. The Last Jedi is dark enough as it is, so Johnson has made a point of infusing the movie with levity. “I didn’t want this to be a dirge, a heavy-osity movie,” he said. “So one thing I’ve tried really hard to do is keep the humor in there, to maintain the feeling, amid all the heavy operatic moments, that you’re on a fun ride.” Photograph by Annie Leibovitz. IV. Sister Carrie\n\nDaisy Ridley has her own tale to tell of Skellig Michael. Part of the reason she looks so convincingly weary at the conclusion of Episode VII is, she said, “that I had just vomited. I had adrenal exhaustion, and I was very, very sick.” The second time up the cliff, she was in good health and pleased to be re-united with Hamill. But the overall making of Episode VIII proved more psychologically fraught. “When I was doing Episode VII, I was kind of being washed along in a torrent of excitement and unexpectedness,” she said. “When we came around to do the next one, it was a bit more scary, because I knew the expectations, and I understood more what Star Wars means to people. It felt like more of a responsibility.” The conflation of real-life and character narratives is not lost on Hamill. Fortunately for Ridley, she had become acquainted with a woman who knew a thing or two about such issues. There was no human being on earth better equipped to shepherd Ridley through what she was experiencing, as both the star of a movie franchise and a feminist model to young girls, than Carrie Fisher. “Carrie lived her life the way she wanted to, never apologizing for anything, which is something I’m still learning,” Ridley said. “ ‘Embarrassed’ is the wrong word, but there were times through it all when I felt like I was … shrinking. And she told me never to shrink away from it—that it should be enjoyed.” This is a common refrain among the new generation of Star Wars actors: that Fisher was the one who taught them how to deal. Boyega recalled that when there was a backlash against his appearance in the first Force Awakens teaser trailer, released in November 2014—the sight of a black man in stormtrooper armor drew ire from racists and doctrinaire Star Wars traditionalists—Fisher counseled him not to take it to heart. “I remember—and forgive me, I’m going to drop the f-bomb, but that’s just Carrie—she said, ‘Ah, boohoo, who fuckin’ cares? You just do you,’ ” he said. “Words like that give you strength. I bore witness in a million ways to her sharing her wisdom with Daisy too.” Photograph by Annie Leibovitz. Fisher had a bigger role to play in The Last Jedi—General Leia Organa logs significantly more screen time in Episode VIII than she did in VII. Isaac, who filmed several scenes with Fisher, said that, like Hamill, she delivered a rich performance, giving her all as an actor, rather than treating Leia’s part as an exercise in feel-good sentimentalism. “We did this scene where Carrie has to slap me,” he said. “I think we did 27 takes in all, and Carrie leaned into it every time, man. She loved hitting me. Rian found such a wonderful way of working with her, and I think she really relished it.” For his part, Johnson quickly formed a deep bond with Fisher as a fellow writer, spending long hours with her at the eccentric compound she shared with her mother, Debbie Reynolds, in the Coldwater Canyon section of Beverly Hills. “After I had a draft, I would sit down with her when I was working on re-writing,” he said. “Sitting with her on her bed, in her insane bedroom with all this crazy modern art around us, TCM on the TV, a constant stream of Coca-Cola, and Gary the dog slobbering at her feet.” (For visuals on this characteristic state of affairs chez Fisher, I highly recommend Alexis Bloom and Fisher Stevens’s HBO documentary, Bright Lights: Starring Carrie Fisher and Debbie Reynolds.) Fisher completed her part in Episode VIII late last summer, when principal photography on the film wrapped. “She was having a blast,” said Kennedy. “The minute she finished, she grabbed me and said, ‘I’d better be at the forefront of IX!’ Because Harrison was front and center on VII, and Mark is front and center on VIII. She thought IX would be her movie. And it would have been.” Photograph by Annie Leibovitz. When I was conducting the interviews for this story, the Star Wars family was still mourning Fisher’s unexpected death, which occurred on December 27, 2016, four days after she suffered a heart attack on a flight home to Los Angeles from London, and just a day before Reynolds suffered a fatal stroke. (The Star Wars “family” includes family in the literal sense: Fisher’s daughter, the actress Billie Lourd, appears as a Resistance lieutenant in both The Force Awakens and The Last Jedi.) Fisher had celebrated her 60th birthday just two months earlier. “Out of everyone, Carrie was the one I really became friends with and expected to have in my life for years and years,” said Johnson. “I last saw her in November, at the birthday party that she threw at her house. In a way, it was the perfect final, encapsulating image of Carrie—receiving all her friends in the bedroom, with Debbie holding court in the living room.” Fisher’s death doesn’t change anything about The Last Jedi except make it more poignant: the film farewell of both the actress and the character. But it does change Episode IX, for which, as Fisher hoped, a central role for Leia had been planned. Kennedy, Trevorrow, and the Lucasfilm team have been compelled to swing from grieving into pragmatic mode, working out how to reconceive the next film in the saga, which is scheduled to start shooting in January. One option that is not on the table is to reanimate Fisher’s Leia via C.G.I., as was briefly done in Rogue One, last year’s stand-alone, non-trilogy Star Wars film, created when she was alive. More extensively in that film, Grand Moff Tarkin, a character played by the late Peter Cushing in the first Star Wars movie, was brought back to life using C.G.I. jiggery-pokery and motion-capture technology that involved the use of an actor who physically resembles Cushing. Plus, Lucasfilm had the Cushing family’s consent. However, said Kennedy, “we don’t have any intention of beginning a trend of re-creating actors who are gone.” Photograph by Annie Leibovitz. V. A Disturbance in the Force", "images": ["https://web.archive.org/web/20170524125612im_/http://media.vanityfair.com/photos/592457a5dffe772993b30b3f/master/w_1440,c_limit/star-wars-portfolio-06-2017-ss14.jpg", "https://web.archive.org/web/20170524125612im_/http://media.vanityfair.com/photos/59245798b2306f2287537fcf/master/w_1440,c_limit/star-wars-portfolio-06-2017-ss08.jpg", "https://web.archive.org/web/20170524125612im_/http://media.vanityfair.com/photos/5924578a9658080c3abf711b/master/w_1440,c_limit/star-wars-portfolio-06-2017-ss05.jpg", "https://web.archive.org/web/20170524125612im_/http://media.vanityfair.com/photos/592457a5dffe772993b30b3c/master/h_1440,c_limit/star-wars-portfolio-06-2017-ss11.jpg", "https://web.archive.org/web/20170524125612im_/http://media.vanityfair.com/photos/5924578952a3f44dc6f3a8a7/master/w_1440,c_limit/star-wars-portfolio-06-2017-ss04.jpg", "https://web.archive.org/web/20170524125612im_/http://media.vanityfair.com/photos/592457899658080c3abf7119/master/w_1440,c_limit/star-wars-portfolio-06-2017-ss03.jpg", "https://web.archive.org/web/20170524125612im_/http://media.vanityfair.com/photos/59245798dffe772993b30b39/master/w_1440,c_limit/star-wars-portfolio-06-2017-ss06.jpg", "https://web.archive.org/web/20170524125612im_/http://media.vanityfair.com/photos/5924578952a3f44dc6f3a8a5/master/w_1440,c_limit/star-wars-portfolio-06-2017-ss02.jpg", "https://web.archive.org/web/20170524125612im_/http://media.vanityfair.com/photos/592457989658080c3abf711d/master/w_1440,c_limit/star-wars-portfolio-06-2017-ss07.jpg", "https://web.archive.org/web/20170524125612im_/http://media.vanityfair.com/photos/5924972da697a436a685292e/16:9/w_1200,h_630,c_limit/t-star-wars-portfolio-06-2017-longform-a.jpg", "https://web.archive.org/web/20170524125612im_/http://media.vanityfair.com/photos/59245798b2306f2287537fd1/master/h_1440,c_limit/star-wars-portfolio-06-2017-ss09.jpg", "https://web.archive.org/web/20170524125612im_/http://media.vanityfair.com/photos/592457a53695284c0188d4c5/master/w_1440,c_limit/star-wars-portfolio-06-2017-ss13.jpg", "https://web.archive.org/web/20170524125612im_/http://media.vanityfair.com/photos/5924579852a3f44dc6f3a8a9/master/h_1440,c_limit/star-wars-portfolio-06-2017-ss10.jpg", "https://web.archive.org/web/20170524125612im_/http://media.vanityfair.com/photos/592457a5dffe772993b30b3d/master/h_1440,c_limit/star-wars-portfolio-06-2017-ss12.jpg"], "top_img": "https://web.archive.org/web/20170524125612im_/http://media.vanityfair.com/photos/5924972da697a436a685292e/16:9/w_1200,h_630,c_limit/t-star-wars-portfolio-06-2017-longform-a.jpg", "keywords": [], "authors": ["David Kamp", "Annie Leibovitz", "Vanity Fair"], "canonical_link": "https://web.archive.org/web/20170524125612/http://www.vanityfair.com/hollywood/2017/05/star-wars-the-last-jedi-cover-portfolio", "title": "Cover Story: Star Wars: The Last Jedi, the Definitive Preview", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no,width=device-width,initial-scale=1,maximum-scale=1", "parsely-metadata": "{\"rubric\":\"The Last Jedi\"}", "author": "David Kamp", "pubdate": "2017-05-24T08:00:00Z", "copyright": "Copyright (c) Condé Nast 2017", "description": "Star Wars devotees who can’t wait for December need look no further. With exclusive access to writer-director Rian Johnson, plus interviews with Mark Hamill, Daisy Ridley, and others, V.F. presents the ultimate sneak peek at The Last Jedi—and Carrie Fisher’s lasting legacy.", "keywords": "article,star wars,annie leibovitz,the last jedi,portfolio,carrie fisher,mark hamill,daisy ridley,john boyega,adam driver,kathleen kennedy,rian johnson", "fb": {"pages": 8810407571, "app_id": 330433047345504}, "og": {"site_name": "HWD", "image": "https://web.archive.org/web/20170524125612im_/http://media.vanityfair.com/photos/5924972da697a436a685292e/16:9/w_1200,h_630,c_limit/t-star-wars-portfolio-06-2017-longform-a.jpg", "title": "Cover Story: Star Wars: The Last Jedi, the Definitive Preview", "description": "Star Wars devotees who can’t wait for December need look no further. With exclusive access to writer-director Rian Johnson, plus interviews with Mark Hamill, Daisy Ridley, and others, V.F. presents the ultimate sneak peek at The Last Jedi—and Carrie Fisher’s lasting legacy.", "url": "https://web.archive.org/web/20170524125612/http://www.vanityfair.com/hollywood/2017/05/star-wars-the-last-jedi-cover-portfolio", "type": "article"}, "twitter": {"site": "@VanityFair", "domain": "www.vanityfair.com", "card": "summary_large_image", "title": "Cover Story: Star Wars: The Last Jedi, the Definitive Preview", "description": "Star Wars devotees who can’t wait for December need look no further. With exclusive access to writer-director Rian Johnson, plus interviews with Mark Hamill, Daisy Ridley, and others, V.F. presents the ultimate sneak peek at The Last Jedi—and Carrie Fisher’s lasting legacy.", "image": {"src": "http://media.vanityfair.com/photos/5924972da697a436a685292e/16:9/pass/t-star-wars-portfolio-06-2017-longform-a.jpg?mbid=social_retweet"}}}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}