{"url": "https://en.wikipedia.org/wiki/GLOW_(TV_series)", "text": "American comedy-drama television series\n\nFor the original wrestling promotion, see Gorgeous Ladies of Wrestling\n\nGLOW is an American comedy-drama streaming television series created by Liz Flahive and Carly Mensch for Netflix.[1] The series revolves around a fictionalization of the characters and gimmicks of the 1980s syndicated women's professional wrestling circuit Gorgeous Ladies of Wrestling (or GLOW) founded by David McLane.[2]\n\nThe first season consists of 10 episodes and was released on June 23, 2017.[3][4] On August 10, 2017, Netflix renewed the series for a second season of 10 episodes, which was released on June 29, 2018.[5] The series was renewed on August 20, 2018, for a third season, which was released on August 9, 2019.[6] On September 20, 2019, the series was renewed for a fourth and final season.[8] However, in October 2020, that decision was reversed by Netflix, and the final season was canceled due to the COVID-19 pandemic causing a production shutdown.[9]\n\nPremise [ edit ]\n\nIn Los Angeles in 1985, Ruth Wilder, a struggling actress, auditions along with many other women in a fledgling professional wrestling promotion called the Gorgeous Ladies of Wrestling (GLOW). Traditionally minded in her approach to acting and highly idealistic, she clashes with GLOW's director Sam Sylvia due to his cynical demeanor and often unconventional work style. Ruth discovers early on that Sylvia has employed her former best friend, retired soap opera actress Debbie Eagan to star in the show. Ruth and Debbie had fallen out with one another after Ruth had an affair with Debbie's husband, Mark, whom Debbie then divorced. The tension between the two women promises either to make or break the developing show. The series follows the personal and professional lives of the fictional show's numerous cast and crew as they navigate the 1980s in Southern California and Southern Nevada.\n\nCast [ edit ]\n\nMain [ edit ]\n\nRecurring [ edit ]\n\nThe show's cast features several real-life professional wrestlers, most prominently Kia Stevens (Tammé), who has wrestled as Awesome Kong for TNA and AEW while wrestling as Kharma for WWE. Others with formal experience include:\n\nHulk Hogan, Ric Flair, and Gorgeous George appear in archived video footage in episodes 1 and 4.\n\nEpisodes [ edit ]\n\nSeason Episodes Originally released 1 10 June 23, 2017 ( ) 2 10 June 29, 2018 ( ) 3 10 August 9, 2019 ( )\n\nProduction [ edit ]\n\nThe idea for the series came when Flahive and Mensch, who at the time were looking to make a new female-centric show, came across the 2012 documentary GLOW: The Story of the Gorgeous Ladies of Wrestling.[20][21] Before this, neither woman had heard of the GLOW wrestling promotion, and they became intrigued by the premise of producing a fictionalized version of it.[21] Both women found the storyline intriguing as a way of exploring the aftermath of the 1970s Woman's Liberation Movement, with Flahive telling Rolling Stone, \"We wanted to look back on the 1970s, coming out of the women's movement, and into the 1980s, and ask the question: Did it work? Did things get better?\"[20] To this end, it was important for the series to maintain a tension between whether the league was exploiting women or empowering them.[20]\n\nUrsula Hayden, the owner of the GLOW company, served as a consultant on the series and helped Flahive and Mensch with creating the show. Hayden was also on the original 1980s promotion as Babe, the Farmer's Daughter.[22]\n\nChavo Guerrero Jr. of the famous Guerrero wrestling family also served as a consultant on the series and helped train the actresses. His uncle Mando Guerrero had served in the same role for the original series.[23] Guerrero Jr. also appeared in two episodes of the second season, including the season finale.\n\nFilming [ edit ]\n\nThe series has filmed in several locations in Los Angeles; mainly in the San Fernando Valley. Chavo's Boxing Gym, which is GLOW's training grounds, was a combination of two locations: the interior was a studio set while the exterior was the rear of the San Fernando Masonic Lodge. The Pink Motel in Sun Valley was used as a stand-in for The Dusty Spur Motel, GLOW's sleeping quarters. Other notable locations include the Mayan Theater and the Hollywood Palladium.[24]\n\nPrincipal production on season 2 commenced in October 2017.[25]\n\nMarketing [ edit ]\n\nFor the Spain market, Netflix España released a series of promo videos featuring singers Marta Sánchez and Vicky Larraz. The first video, titled \"No Controles\", features Sánchez imitating Ruth's imaginary wrestler scene from the first episode. The second video has Sánchez and Larraz squaring off in the ring.[26][27]\n\nFor the Brazil market, Netflix Brasil released a promo video featuring singers Gretchen and Rita Cadillac auditioning for GLOW.[28]\n\nFunko released Pop! Vinyl figures of Ruth and Debbie in mid-2018.[29]\n\nCanceled final season [ edit ]\n\nIn September 2019, Netflix renewed the show for a fourth and final season.[8] On February 19, 2020, Alison Brie posted a photo from the set on Instagram, signaling that they were beginning production on the final episodes. In March 2020, production was shut down on the season due to the COVID-19 pandemic, which had stopped nearly all TV and film productions in Los Angeles. They had already finished the first episode and were about to start filming the second.[9]\n\nOn October 5, 2020, creators Liz Flahive and Carly Mensch revealed in a statement that the fourth season was canceled and would not be completed or aired. It was explained that the show had some of the biggest obstacles to overcome as Netflix was trying to figure out how to get their shows back to work, mostly due to uncertainty about how to prevent an outbreak on set with its wrestling theme and increased COVID-19 related costs added to an already expensive budget. The earliest the show's final season would have aired was in 2022, which would have been too long of a gap for Netflix to handle, since the previous season aired in 2019.[9]\n\nSoundtrack [ edit ]\n\nThe series features several songs from the 1980s, as well as tracks from the 1950s, 1960s, and 1970s.[30] The opening theme used for the full-length opening titles in episode 1 of each season is \"The Warrior\" by Scandal.\n\nSeason 1 songs\n\nSeason 2 songs\n\nSeason 3 songs[31]\n\nQuiet Riot's cover of \"Cum On Feel the Noize\" was used for the Season 1 trailer, while \"Maniac\" by Michael Sembello was used for the Season 2 trailer and \"Listen to Your Heart\" by Roxette for the Season 3 trailer. Songs covered by the cast include the Thompson Twins' \"Hold Me Now\" and Barbra Streisand's \"This Is One of Those Moments\".[30]\n\nReception [ edit ]\n\nCritical response [ edit ]\n\nGLOW was praised by critics upon its release. On Rotten Tomatoes, season 1 has a 94% approval rating with an average score of 7.66/10 based on 107 reviews. The site's critical consensus reads, \"With spot-on 1980s period detail, knockout writing, and a killer cast, GLOW shines brightly.\"[32] The first season has a Metacritic score of 81 out of 100, based on 37 critics, indicating \"universal acclaim\".[33] Darren Franich of Entertainment Weekly gave the first season an A rating, calling it \"a silly-smart masterpiece, with an ensemble cast entirely made up of breakout characters\".[34] Sophie Gilbert of The Atlantic said, \"...it’s just a blast to watch women having so much fun. GLOW fully owns its campiness and its showy aesthetics, but it’s smart and subversive underneath the glitter.\"[35]\n\nThe second season received even higher critical acclaim. On Rotten Tomatoes, season 2 has a 98% approval rating with an average score of 8.77/10 based on 84 reviews. The site's critical consensus reads, \"Fearlessly led by its excellent ensemble, GLOW's second season adds a new layer of drama without sacrificing its self-effacing, delightfully silly humor.\"[36] The second season has a Metacritic score of 85 out of 100, based on 20 critics, indicating \"universal acclaim\".[37]\n\nOn Rotten Tomatoes, the third season has an 86% approval rating with an average score of 8/10 based on 65 reviews. The site's critical consensus reads, \"GLOW dives even deeper into the lives of its divas to deliver a knock-out third season that solidifies its place as one of TV's most compelling—and hilarious—character studies.\"[38] The third season has a Metacritic score of 80 out of 100, based on 17 critics, indicating \"generally favorable reviews\".[39]\n\nWrestling community response [ edit ]\n\nThe series received mixed reactions from some of the original GLOW wrestlers. Jeanne Basone, who wrestled in the promotion as \"Hollywood\", commented that \"Some of the training and the gym and the outfits they get correct.\" Patricia Summerland, who played \"Sunny the California Girl\" in the promotion, saw Marc Maron's character Sam Sylvia as a stark contrast to original GLOW director Matt Cimber. Eileen O'Hara, who was known as \"Melody Trouble Vixen (MTV)\", felt that the series did not properly acknowledge how groundbreaking they were.[40] Lisa Moretti, who competed as \"Tina Ferrari\" and would go on to the greatest fame among GLOW alumnae as Ivory in the WWF/WWE as a three-time WWF Women's Champion during the Attitude Era, said that she was relieved that the series isn't a documentary because it was more entertaining to have a mix between fact and fiction.[41]\n\nMore positive reception came from mainstream wrestling figures including Kurt Angle.[42] Ethan Sapienza of Slate noted accurate comparisons between the series and WWE as well as the various regional promotions that made up the National Wrestling Alliance during its heyday.[43]\n\nAccolades [ edit ]\n\nComic book [ edit ]\n\nA four-issue comic book series based on the show was released in March 2019 by IDW Publishing, written by Tini Howard and illustrated by Hannah Templer. Flahive and Mensch served as executive producers on the comics.[69][70][71][72] A second four-issue series by IDW Publishing, GLOW vs. The Babyface, co-written by former professional wrestler AJ Mendez and actress Aimee Garcia and illustrated by Templer, published its first issue in November 2019, with issues 2-4 released from December 2019 through February 2020.[73][74]\n\nIn media [ edit ]\n\nSydelle Noel, Britney Young, Kia Stevens, Ellen Wong and Jackie Tohn made a cameo appearance as their GLOW characters in the music video for the 2017 Katy Perry song \"Swish Swish\".[75]\n\nSee also [ edit ]\n\nReferences [ edit ]", "images": ["https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://upload.wikimedia.org/wikipedia/en/thumb/5/5c/Symbol_template_class.svg/16px-Symbol_template_class.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/1/17/Glow_TV_show_logo.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/GLOW_(TV_series)", "title": "GLOW (TV series)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "viewport": "width=1000", "og": {"title": "GLOW (TV series) - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}