{"url": "en.wikipedia.org/wiki/Reese_Witherspoon", "text": "American actress and producer\n\nLaura Jeanne Reese Witherspoon (born March 22, 1976) is an American actress and producer. The recipient of various accolades, including an Academy Award, a British Academy Film Award, a Primetime Emmy Award, and two Golden Globe Awards, she has consistently ranked among the world's highest-paid actresses. Time magazine named her one of the 100 most influential people in the world in 2006 and 2015, and Forbes listed her among the World's 100 Most Powerful Women in 2019. In 2021, Forbes named her the world's richest actress with an estimated net worth of $400 million.[1]\n\nWitherspoon began her career as a teenager, making her screen debut in The Man in the Moon (1991). Her breakthrough came in 1999 with a supporting role in Cruel Intentions, and for her portrayal of Tracy Flick in the black comedy Election. She gained wider recognition for playing Elle Woods in the comedy Legally Blonde (2001) and its 2003 sequel, and for starring in the romantic comedy Sweet Home Alabama (2002). In 2005, she gained critical acclaim and won the Academy Award for Best Actress for portraying June Carter Cash in the musical biopic Walk the Line.\n\nFollowing a career downturn, during which her sole box-office success was the romantic drama Water for Elephants (2011), Witherspoon made a comeback by producing and starring as Cheryl Strayed in the drama Wild (2014), which earned her a second nomination for Best Actress at the Academy Awards. She has since worked primarily in television, producing and starring in several female-led literary adaptations under her company Hello Sunshine. These include the HBO drama series Big Little Lies (2017–2019), the Apple TV+ drama series The Morning Show (2019–present), and the Hulu miniseries Little Fires Everywhere (2020). For the first of these, she won the Primetime Emmy Award for Outstanding Limited Series.\n\nWitherspoon also owns a clothing company, Draper James, and she is involved in children's and women's advocacy organizations. She serves on the board of the Children's Defense Fund (CDF) and was named Global Ambassador of Avon Products in 2007, serving as honorary chair of the charitable Avon Foundation dedicated to women's causes.\n\nEarly life and education\n\nLaura Jeanne Reese Witherspoon was born on March 22, 1976,[2] at Southern Baptist Hospital, in New Orleans, Louisiana, while her father, John Draper Witherspoon, was a student at Tulane University medical school.[3][4] Her father was born in Georgia and served as a lieutenant in the United States Army Reserve.[5][6] He was in private practice as an otolaryngologist until 2012.[7] Her mother, Mary Elizabeth \"Betty\" (née Reese) Witherspoon, is from Harriman, Tennessee. She was a professor of nursing at Vanderbilt University and had a PhD in pediatric nursing.[8][9]\n\nReese Witherspoon has claimed descent from Scottish-born John Witherspoon, who signed the United States Declaration of Independence;[10][11] however, this claim has not been verified by the Society of the Descendants of the Signers of the Declaration of Independence genealogists.[12] Her parents are still legally married, although they separated in 1996.[13]\n\nWitherspoon was raised an Episcopalian, and has said she is proud of the \"definitive Southern upbringing\" she received. She has said it gave her \"a sense of family and tradition\" and taught her about \"being conscientious about people's feelings, being polite, being responsible and never taking for granted what you have in your life\".[14][15][16] At age seven, she was selected as a model for a florist's television advertisements, which motivated her to take acting lessons.[17] At age 11, she took first place in the Ten-State Talent Fair.[17] She received high grades in school,[17] loved reading, and considered herself \"a big dork who read loads of books\".[4] On mentioning her love for books, she said, \"I get crazy in a bookstore. It makes my heart beat hard because I want to buy everything.\"[18] She has been described as a \"multi-achiever\" and was nicknamed \"Little Type A\" by her parents.[19][20] She attended middle school at Harding Academy and graduated from the all-girls' Harpeth Hall School in Nashville, during which time she was a cheerleader.[21][14] She later attended Stanford University as an English literature major,[22] but left prior to completing her studies to pursue an acting career.[14]\n\nCareer\n\nEarly work and breakthrough (1991–2000)\n\nWitherspoon attended an open casting call in 1991 for The Man in the Moon, intending to audition for a bit part;[14] but instead was cast for the lead role of Dani Trant, a 14-year-old country girl who falls in love for the first time with her 17-year-old neighbor. According to The Guardian, her performance made an early impression.[23] Film critic Roger Ebert commented, \"Her first kiss is one of the most perfect little scenes I've ever seen in a movie.\"[17] For her role, Witherspoon was nominated for a Young Artist Award, in the category of Best Young Actress.[24] Later that year, she made her television debut role in Wildflower with Patricia Arquette.[5][10] In 1992, Witherspoon appeared in the television film Desperate Choices: To Save My Child, portraying a critically ill young girl.[5]\n\nIn 1993, Witherspoon played a young wife, Nonnie Parker, in the CBS miniseries Return to Lonesome Dove, appeared in the Disney film A Far Off Place, and had a minor role in Jack the Bear, which garnered her the Young Artist Award for Best Youth Actress Co-star.[5][25] The next year, she had another leading role as Wendy Pfister in the 1994 film S.F.W., directed by Jefery Levy.[26] In 1996, Witherspoon starred in two major films: the thriller Fear alongside Mark Wahlberg,[27][28] as Nicole Walker, a teenager who starts dating a man with obsessive tendencies, and the black-comedy thriller Freeway, alongside Kiefer Sutherland and Brooke Shields, in which she played Vanessa Lutz;[29] a poor girl living in Los Angeles who encounters a serial killer on the way to her grandmother's home in Stockton.[14] The film received positive reviews from critics; San Francisco Chronicle's Mick LaSalle wrote, \"Witherspoon, who does a Texas accent, is dazzling, utterly believable in one extreme situation after the other.\"[30] Witherspoon's performance won her the Best Actress Award at the Cognac Police Film Festival and helped establish her as a rising star.[14][31] The production of the film also gave her significant acting experience; she said \"Once I overcame the hurdle of that movie – which scared me to death – I felt like I could try anything.\"[22]\n\nIn 1998, Witherspoon had major roles in three films: Overnight Delivery, Pleasantville and Twilight.[10][32] In Pleasantville, she starred with Tobey Maguire in a tale about 1990s teenage siblings who are magically transported into the setting of a 1950s television series. She portrayed Jennifer, the sister of Maguire's character who is mainly concerned about appearances, relationships and popularity. Her performance earned her praise and garnered her the Young Hollywood Award for Best Female Breakthrough Performance.[33] Director Gary Ross applauded her efforts saying, \"she commits to a character so completely and she understands comedy\".[22]\n\nA year later, Witherspoon co-starred with Alessandro Nivola in the drama thriller Best Laid Plans; she played Lissa, a woman who schemes with her lover Nick to escape a small dead-end town.[5] Also in 1999, she co-starred with Sarah Michelle Gellar and Ryan Phillippe in the drama Cruel Intentions, a modern version of the 18th-century French novel Les Liaisons Dangereuses. The critic for San Francisco Chronicle praised her performance as Annette Hargrove: \"Witherspoon is especially good in the least flashy role, and even when called upon to make a series of cute devilish faces, she pulls it off.\"[34] She also appeared in a music video by Marcy Playground for the film's soundtrack. Next, she appeared in Election (1999) opposite Matthew Broderick, based on Tom Perrotta's novel of the same name.[5] For her portrayal of Tracy Flick, she earned acclaim and her first nominations in the Golden Globes and in the Independent Spirit Awards. She also won the Best Actress Award from the National Society of Film Critics and the Online Film Critics Society.[35][36] Witherspoon received a rank on the list of 100 Greatest Film Performances of All Time by Premiere.[37] Director Alexander Payne said \"She's [Witherspoon] got that quality that men find attractive, while women would like to be her friend. But that's just the foundation. Nobody else is as funny or brings such charm to things. She can do anything.\"[15]\n\nFollowing the success of Election, Witherspoon struggled to find work due to typecasting.[38] \"I think because the character I played was so extreme and sort of shrewish—people thought that was who I was, rather than me going in and creating a part. I would audition for things and I'd always be the second choice—studios never wanted to hire me and I wasn't losing the parts to big box office actresses but to ones who I guess people felt differently about\", she said.[6] In 2000, Witherspoon had a supporting role in American Psycho as Patrick Bateman's trophy girlfriend, and made a cameo appearance in Little Nicky as the mother of the Antichrist.[32] She also made a guest appearance in the sixth season of Friends as Rachel Green's sister Jill.[39]\n\nWorldwide recognition and critical success (2001–2006)\n\nThe 2001 film Legally Blonde marked a turning point in Witherspoon's career; she starred as Elle Woods, a fashion-merchandising major who decides to become a law student to follow her ex-boyfriend to Harvard Law School. Witherspoon said about the role, \"When I read Legally Blonde, I was like, 'She's from Beverly Hills, she's rich, she's in a sorority. She has a great boyfriend. Oh yeah, she gets dumped. Who cares? I still hate her.' So we had to make sure she was the kind of person you just can't hate.\"[15] Legally Blonde was a box-office hit, grossing US$96 million domestically.[40] Witherspoon's performance earned her praise from critics, and the press began to refer her as \"the new Meg Ryan\".[41] Roger Ebert commented, \"Witherspoon effortlessly animated this material with sunshine and quick wit\",[42] and the critic from Salon magazine wrote \"she [Witherspoon] delineates Elle's character beautifully\".[43] Meanwhile, the Seattle Post-Intelligencer concluded, \"Witherspoon is a talented comedian who can perk up a scene just by marching in full of pep and drive and she powers this modest little comedy almost single-handedly.\"[44] The film earned her a second nomination for Best Actress at the Golden Globes, and an MTV Movie Award for Best Comedic Performance.[45]\n\nIn 2002, Witherspoon starred in several features, such as Greta Wolfcastle in The Simpsons episode \"The Bart Wants What It Wants\", and as Cecily in the comedy The Importance of Being Earnest, a film adaptation of Oscar Wilde's play in which she received a Teen Choice Award nomination.[46][47] Later that year, she starred with Josh Lucas and Patrick Dempsey in Andy Tennant's romantic comedy Sweet Home Alabama, in which she played Melanie Carmichael, a young fashion designer who intends to marry a New York politician but must return to Alabama to divorce her childhood sweetheart, from whom she has been separated for seven years. Witherspoon regarded it as a \"personal role\" as it reminded her of the experience of moving from Nashville to Los Angeles.[48] The film became Witherspoon's biggest live-action box office hit, earning over $35 million in the opening weekend and grossing over $127 million in the U.S.[40][49] Despite the commercial success, critics gave Sweet Home Alabama negative reviews. The Miami Herald called it \"a romantic comedy so rote, dull and predictable\",[50] and the press opined that Witherspoon was the only reason the film attracted such a large audience.[51][52] The Christian Science Monitor wrote of her, \"She is not the movie's main attraction, she is its only attraction.\"[53]\n\nThe next year, Witherspoon followed up the success of Legally Blonde by starring in the sequel Legally Blonde 2: Red, White & Blonde. Elle Woods has become a Harvard-educated lawyer who is determined to protect animals from cosmetics industry science tests. The sequel was not as financially successful as the first film and it generated mostly negative reviews. USA Today considered the movie \"plodding, unfunny and almost cringe-worthy\", but also wrote \"Reese Witherspoon still does a fine job portraying the fair-haired lovable brainiac, but her top-notch comic timing is wasted on the humorless dialogue.\"[54] Meanwhile, Salon magazine concluded that the sequel \"calcifies everything that was enjoyable about the first movie\".[55] Despite being panned by critics, the sequel took in over $39 million in its first five days in the U.S. box office charts and eventually grossed $90 million in the US.[56] Witherspoon was paid $15 million for the role—a starting point which would make her consistently one of Hollywood's highest-paid actresses between 2002 and 2010.[15][57]\n\nIn 2004, Witherspoon starred in Vanity Fair, adapted from the 19th-century classic novel Vanity Fair and directed by Mira Nair. Her character, Becky Sharp, is a poor woman with a ruthless determination to find fortune and establish herself a position in society. Witherspoon was carefully costumed to conceal her pregnancy during filming.[58] This pregnancy was not a hindrance to her work as Witherspoon believed the gestation had helped her portrayal of Sharp's character: \"I love the luminosity that pregnancy brings, I love the fleshiness, I love the ample bosom—it gave me much more to play with\", she said.[59][60] The film, and Witherspoon's performance received mixed reviews; The Hollywood Reporter wrote \"Nair's cast is splendid. Witherspoon does justice to the juicy role by giving the part more buoyancy than naughtiness.\"[61] The Charlotte Observer called her work \"an excellent performance that's soft around the edges\", and the Los Angeles Times concluded that Becky is \"a role Reese Witherspoon was born to play\".[62][63] However, LA Weekly wrote \"[Witherspoon] ends up conveying so little of what's at once appalling and perversely attractive about the would-be mistress of Vanity Fair\" and states that it may have to do with Witherspoon's vanity, \"with an Oscar-less young star's need to be loved more than anyone could conceivably love the \"real\" Becky Sharp.\".[64] Some critics thought she was miscast.[65]\n\nIn late 2004, Witherspoon starred alongside Mark Ruffalo in the romantic comedy Just Like Heaven. Her character, Elizabeth Masterson, is an ambitious young doctor who is involved in a car accident on her way to a blind date and is left in a coma; her spirit returns to her old apartment where she later finds true love.[66] Next, she was cast as June Carter Cash, the second wife of singer-songwriter Johnny Cash (Joaquin Phoenix), in James Mangold's Walk the Line (2005). She never had the chance to meet Carter Cash, as Witherspoon was filming Vanity Fair at the time the singer died.[6] Witherspoon performed her own vocals in the film, and her songs had to be performed in front of a live audience; she was so worried about needing to perform that she asked her lawyer to terminate the film contract.[67] \"That was the most challenging part of the role,\" she later recalled. \"I'd never sung professionally.\"[68] Subsequently, she had to spend six months learning how to sing for the role, including from the help of vocal coach Roger Love.[67][69][70] Witherspoon's portrayal of Carter Cash was acclaimed by critics, with Roger Ebert stating that her performance added \"boundless energy\" to the film.[71] She won Best Actress at the Academy Awards, Golden Globes, British Academy Film Awards, and a Screen Actors Guild award for her performance.[72][73][45]\n\nWitherspoon and Phoenix received a nomination for \"collaborative video of the year\" from the CMT Music Awards.[73][74] Witherspoon has expressed her passion for the film: \"I really like in this film that it is realistic and portrays sort of a real marriage, a real relationship where there are forbidden thoughts and fallibility. And it is about compassion in the long haul, not just the short easy solutions to problems.\"[75] She also stated that she believed Carter Cash was a woman ahead of her time: \"I think the really remarkable thing about her character is that she did all of these things that we sort of see as normal things in the 1950s when it wasn't really acceptable for a woman to be married and divorced twice and have two different children by two different husbands and travel around in a car full of very famous musicians all by herself. She didn't try to comply to social convention, so I think that makes her a very modern woman.\"[75] After the success of Walk the Line, Witherspoon starred in the fantasy Penelope, as Annie, the best friend of Penelope (Christina Ricci), a girl who has a curse in her family. The film was produced by her company Type A Films, and filming began in March 2006.[76] The film premiered at the 2006 Toronto International Film Festival,[67][77] but went unreleased until February 2008.[78][79]\n\nCareer fluctuations and romantic comedy films (2007–2012)\n\nMonsters vs. Aliens in 2009 Witherspoon at the premiere ofin 2009\n\nWitherspoon admits to spending several years \"kind of floundering career-wise\". Reflecting on this period of time in a December 2014 interview, Witherspoon attributed it to the split from her first husband in October 2006 and their subsequent divorce, stating that she spent \"a few years just trying to feel better. You know, you can't really be very creative when you feel like your brain is scrambled eggs.\" She claims that she \"wasn't making things I was passionate about. I was just kind of working, you know. And it was really clear that audiences weren't responding to anything I was putting out there.\"[80]\n\nWitherspoon appeared in the thriller Rendition, in which she played Isabella El-Ibrahim, the pregnant wife of a bombing suspect. The film was released in October 2007 and it was her first film appearance since the 2005's Walk the Line.[81] The film received mostly mixed reviews and was deemed a major disappointment at the Toronto International Film Festival.[82] Witherspoon's performance was also criticized; writing for USA Today, Claudia Puig wrote \"Reese Witherspoon is surprisingly lifeless [...] She customarily injects energy and spirit into her parts, but here, her performance feels tamped down.\"[83] In 2008, Witherspoon starred with Vince Vaughn in the comedy Four Christmases, a story about a couple who must spend their Christmas Day trying to visit all four of their divorced parents.[84] Despite negative reviews from critics, the film was a box office success, earning more than $120 million domestically and $157 million worldwide.[85] In 2009, Witherspoon voiced Susan Murphy, the lead character in the DreamWorks Animation Monsters vs. Aliens, released in March, which grossed $381 million worldwide.[86][87] She also co-produced the Legally Blonde spin-off Legally Blondes, starring Milly and Becky Rosso.[88] However, Witherspoon did not appear in a live-action film for two years after Four Christmases. She told Entertainment Weekly that the \"break\" was unplanned, stating that, \"I just didn't read anything I liked... There are a lot of really, really, really big movies about robots and things—and there's not a part for a 34-year-old woman in a robot movie.\"[89]\n\nWater for Elephants in 2011 Witherspoon at the premiere ofin 2011\n\nWitherspoon returned with three romances released in 2010, 2011 and 2012, all starring her as a woman caught in a love triangle between two men. In the first, she was cast in James L. Brooks' How Do You Know,[90][91][92] in which she played a former national softball player who struggles to choose between a baseball-star boyfriend (Owen Wilson) and a business executive being investigated for white-collar crime (Paul Rudd). Filming took place in Philadelphia and Washington, D.C. during the summer and fall of 2009[93][94][95] and it was released on December 17, 2010. The film was critically and commercially unsuccessful; with a budget of more than $100 million, the film only earned $48.7 million worldwide, leading the Los Angeles Times to call it \"one of the year's biggest flops\".[96] The film received mainly unfavorable reviews, with an approval rating of 35% on Rotten Tomatoes, based on 111 reviews as of December 2010.[97]\n\nWitherspoon's second love-triangle film was the drama Water for Elephants, an adaptation of Sara Gruen's novel of the same name. She began circus training in March 2010 for her role as Marlena, a glamorous performer stuck in a marriage to a volatile husband (Christoph Waltz) but intrigued by the circus' new veterinarian (Robert Pattinson).[98] Principal photography began between May and early August 2010[99][100] in various locations in Tennessee, Georgia, and California. It was released on April 22, 2011, and received mixed critical reviews.[101][102] Her last love-triangle film began production in Vancouver in September 2010. Directed by McG and released by 20th Century Fox, This Means War, saw Witherspoon's character at the center of a battle between best friends (played by Chris Pine and Tom Hardy), who are both in love with her. The film had a \"sneak-peek\" release on Valentine's Day, before fully opening on February 17, 2012.[103][104][105] The film was panned by critics, with a 25% approval rating on Rotten Tomatoes,[106] and fared poorly at the box office, taking fifth place on its opening weekend with sales of $17.6 million. The New York Times remarked that this \"extended the box office cold streak for the Oscar-winning Ms. Witherspoon\".[107] In a 2012 interview with MTV, Witherspoon jokingly referred that 2010–12 was her \"love triangle period\".[108]\n\nResurgence and career expansion (2012–2015)\n\nIn September 2011, a year after beginning work on This Means War, she filmed a small role in Jeff Nichols's coming-of-age drama Mud in Arkansas, playing Juniper, the former girlfriend of a fugitive (Matthew McConaughey), who enlists two local boys to help him evade capture and rekindle his romance with her.[109][110] Mud premiered in May 2012 in competition for the Palme d'Or at the Cannes Film Festival, but did not win.[111][112] Following its American debut at the Sundance Film Festival on January 19, 2013,[113] the film had a limited release in selected North American theaters on April 26, 2013.[114][115]\n\nWitherspoon next starred in Devil's Knot, which was directed by Atom Egoyan, and based on the true crime book of the same name, examining the controversial case of the West Memphis Three. Like Mud, the film is set in Arkansas. She played Pam Hobbs, the mother of one of three young murder victims. In an interview subsequent to her casting in the film, Egoyan noted that although the role requires \"an emotionally loaded journey,\" he \"met with Reese, and... talked at length about the project, and she's eager to take on the challenge.\"[116] Filming took place in Georgia in June and July 2012,[117][118][119] and Witherspoon was pregnant with her third child during filming.[120][121] The film premiered at the 2013 Toronto International Film Festival,[122][123] followed by a release in selected American theaters on May 9, 2014.[124] Although the film received mainly negative reviews; London's Evening Standard thought Witherspoon was \"the strongest, most involving character\".[125]\n\nIn 2012, Witherspoon founded production company Pacific Standard (now part of Hello Sunshine). Her goal was to produce projects with \"strong\" female lead characters, as she felt this was lacking in Hollywood. Through the company, Witherspoon served as a producer for Gone Girl (2014), an adaptation of Gillian Flynn's novel of the same name.[126][127][128] She also produced and starred in the biographical adventure Wild (2014), based on Cheryl Strayed's memoir of the same name.[129] She portrayed Strayed on her 1,000-mile (1,600 km) hike along the Pacific Crest Trail.[130] Wild was released in December 2014 to critical acclaim;[131] Michael Phillips of Chicago Tribune wrote in his review, \"Witherspoon does the least acting of her career, and it works. Calmly yet restlessly, she brings to life Strayed's longings, her states of grief and desire and her wary optimism.\"[132] Wild was considered as Witherspoon's \"comeback\" role following her previous career slump,[133][134] and she earned a second Academy Award nomination for her performance.[135]\n\nWitherspoon appeared in Philippe Falardeau's drama The Good Lie, based on a true story about an employment counselor assigned to help four young Sudanese refugees, known as Lost Boys of Sudan, who win a lottery for relocation to the U.S.[136][137] It was released on October 3, 2014.[138] The film was mostly well-received; The Hollywood Reporter critic praised the touching story and performances of the cast, writing that Witherspoon does not \"upstage\" her colleagues.[139] Next, she appeared in Inherent Vice (2014), an adaptation of Thomas Pynchon's novel of the same name.[140][141] In May 2014, Witherspoon began production in Louisiana on Hot Pursuit, a comedy in which she plays a police officer trying to protect a drug lord's widow (Sofía Vergara).[142] The feature was released on May 8, 2015.[143]\n\nTelevision success (2016–present)\n\nIn 2016, Witherspoon had a voice role in the animated musical comedy film Sing, and served as a performer to the film's soundtrack. Sing became Witherspoon's biggest commercial success, being the first of her films to make over $200 million domestically and $600 million worldwide.[144] That same year, Witherspoon began filming her first television project since 1993's Return To Lonesome Dove, the seven-part miniseries adaptation of the Liane Moriarty bestseller, Big Little Lies. She co-produced the miniseries along with co-star Nicole Kidman and director Jean-Marc Vallée, her second project under his direction. The series premiered on February 19, 2017, on HBO and finished on April 2.[145][146] Witherspoon garnered critical acclaim for her performance, with TV Line proclaiming her as \"Performer of the Week\" in the weeks of February 26 – March 4 in 2017 and June 23–29 in 2019.[147][148] The Washington Post compared her performance to her roles in Election and Legally Blonde.[149] In December 2017, HBO renewed Big Little Lies for a second season, which premiered in June 2019.[150] Witherspoon also starred in the romantic comedy Home Again, the directorial debut of filmmaker Nancy Meyers' daughter, Hallie Meyers-Shyer, which was released on September 8, 2017.[151]\n\nIn 2018, she starred in Disney's A Wrinkle in Time, a film adaptation of Madeleine L'Engle's novel of the same name, in which she plays Mrs. Whatsit. Directed by Ava DuVernay, the feature co-stars Oprah Winfrey and Mindy Kaling, and was released in March 2018.[152] Four months later, Witherspoon began hosting the talk show Shine On with Reese on DirecTV, in which she interviews female guests, focusing on how they achieved their ambitions. The show marks Witherspoon's first unscripted role in television.[153]\n\nWitherspoon currently produces and stars in the Apple TV+ drama series The Morning Show alongside Jennifer Aniston and Steve Carell.[154] The Morning Show has received a two-season order from Apple with the first season premiering in November 2019.[155] Witherspoon was nominated for a Golden Globe Award for Best Actress – Television Series Drama and a Golden Globe Award for Best Television Series for her work in the series.[156] Season two of The Morning Show was set to premiere in 2020 before the production shutdown caused by the COVID-19 pandemic.[157] The first two episodes were in the final stages of being shot before the production shutdown. During the production shutdown, scripts were rewritten to reflect the pandemic. Production on season two of The Morning Show restarted on October 19, 2020 and premiered on Apple TV in September 2021[158].[159] Witherspoon also serves as an executive producer for the Apple TV+ series Truth Be Told starring Octavia Spencer which premiered in December 2019; it was renewed for a second season in March 2020.[160][161][162]\n\nIn 2020, Witherspoon produced and starred in the Hulu drama miniseries Little Fires Everywhere opposite Kerry Washington, the televised adaptation of Celeste Ng's 2017 novel of the same name.[163][164] In that same year, Witherspoon narrated the Quibi nature documentary series Fierce Queens which focuses on female animals in the animal kingdom.[165]\n\nUpcoming projects\n\nIn addition to starring and producing television shows for her own, Witherspoon will serve as an executive producer for six television series, for different streaming services and networks including Apple TV+,[166] Amazon Prime Video, ABC,[167][168] Starz and Netflix.[169][170][171]\n\nWitherspoon will produce and star in three Netflix films; first, Pyros, a science fiction drama directed by Simon Kinberg, secondly, two romantic comedies on Netflix.[172][173] Witherspoon will produce two films including A White Lie set to star Zendaya, and a documentary about Martina Navratilova.[174][175] Witherspoon will also reprise the role of Elle Woods by starring in and producing Legally Blonde 3; the script will be written by Dan Goor and Mindy Kaling. The film will be the fourth collaboration between Kaling and Witherspoon after A Wrinkle in Time, The Mindy Project and The Morning Show.[176] In 2015, it was reported that Witherspoon had signed on to star and produce in a live-action film about Tinker Bell for Disney.[177] Six years later, the project re-entered development as a part of Gary Marsh's overall deal with Disney and Witherspoon still attached as a producer.[178][179]\n\nOther ventures\n\nBusiness and philanthropy\n\nWitherspoon owned a production company called Type A Films, which the media believed was a nickname from her childhood, \"Little Miss Type A\".[19][180] However, when asked about the company by Interview magazine, she clarified the name's origin: \"... people think I named it after myself... It was actually an in-joke with my family because at [age] 7 I understood complicated medical terms, such as the difference between type A and type B personalities. But I just wished I'd named the company Dogfood Films or Fork or something. You carry that baggage all your life.\"[6] In March 2012, Witherspoon merged Type A Films with Bruna Papandrea's \"Make Movies\" banner to form a new production company called Pacific Standard.[181] In 2016, Witherspoon and Papandrea parted ways, and Witherspoon gained full control of the company.[182] Pacific Standard has since become a subsidiary of Hello Sunshine, a firm co-owned by Witherspoon and Otter Media, focused on telling female-oriented stories through film, television and digital channels.[183] Witherspoon also runs the Hello Sunshine book club, where she makes book recommendations.[184]\n\nIn May 2015, Witherspoon launched Draper James, a retail brand focusing on fashion and home décor inspired by the American South. It is named after her grandparents, Dorothea Draper and William James Witherspoon, who are said to be her greatest influences. Some of the products are being manufactured and designed in-house, and the brand was launched online before opening its first retail outlet in 2015 in her hometown of Nashville, Tennessee.[185] In March 2017, Witherspoon became the chief storyteller for Elizabeth Arden, Inc., helping the company to shape the brand's narrative through advertising campaigns and marketing programs. Witherspoon stated that she was \"excited to work as a creative partner alongside the Elizabeth Arden team, producing content that celebrates the spirit of the brand, highlighting female-centric stories that illustrate women's true life experiences which unite us all\".[186]\n\nWitherspoon is involved in children and women's rights advocacy. She is a longtime supporter of Save the Children, an organization that helps provide children around the world with education, healthcare and emergency aid.[187] She also serves on the board of the Children's Defense Fund (CDF), a child advocacy and research group.[187] In 2006, she was among a group of actresses who went to New Orleans, Louisiana in a CDF project to publicize the needs of Hurricane Katrina victims.[188] During this trip, she helped open the city's first Freedom School, as she met and talked with the children.[189] Witherspoon later called this an experience that she would never forget.[189]\n\nIn 2007, Witherspoon made her first move into endorsements, and she signed a multi-year agreement to serve as the first Global Ambassador for cosmetics firm Avon Products.[187][190] She acts as a spokeswoman for Avon and serves as the honorary chair of the Avon Foundation, a charitable organization that supports women and focuses on breast cancer research and the prevention of domestic violence.[191][192] She is also committed to the development of cosmetic products and making appearances in commercials.[191] Explaining her motives for joining the foundation, she said, \"As a woman and a mother I care deeply about the well being of other women and children throughout the world and through the years, I have always looked for opportunities to make a difference.\"[191]\n\nIn 2020, during the COVID-19 pandemic, Witherspoon announced the \"Draper James Loves Teachers\" initiative, offering free dresses from the clothing collection to teachers.[193]\n\nOther work\n\nIn 2013, Witherspoon recorded a cover of the classic Frank Sinatra and Nancy Sinatra duet, \"Somethin' Stupid\" with Michael Bublé for his 2013 album, To Be Loved.[194] In September 2018, she published her first book, Whiskey in a Teacup, which is a lifestyle publication inspired by her southern upbringing.[195] In 2018, she joined approximately 300 other actors, agents, writers and entertainment employees in creating the Time's Up initiative, which seeks to counteract sexual harassment in the workplace.[196]\n\nIn 2017, Witherspoon started Reese's Book Club.[197] The club was born out of her Instagram account, where she posted photos of books she read. Each month she picks books she loves with a woman at the center of the story, with variety of genres, from women's fiction to thrillers to romance. Since 2017, the club's most influential pick has been Where the Crawdads Sing by Delia Owens. Chosen for the club in September 2018, it was adapted into a 2022 feature film by Witherspoon's production company Hello Sunshine, and was a box office hit that summer.[198]\n\nPublic image\n\nWitherspoon hosted Saturday Night Live on September 29, 2001, the first episode to air after the September 11 attacks.[199] In 2005, she was ranked No. 5 in Teen People magazine's list of most powerful young Hollywood actors.[200] In 2006, she was listed among the Time 100.[201] Her featured article was written by Luke Wilson.[202] That year, she was selected one of the \"100 Sexiest Women In The World\" by the readers of FHM.[203] Witherspoon has been featured four times in the annual \"100 Most Beautiful\" issues of People magazine.[204] She has appeared on the annual Celebrity 100 list by Forbes magazine in 2006 and 2007, at No. 75 and No. 80, respectively.[205][206] Forbes also put her on the top ten Trustworthy Celebrities list.[207]\n\nIn 2007, she was selected by People and the entertainment news program Access Hollywood as one of the year's best-dressed female stars.[208][209] The yellow dress she wore to that year's Golden Globe Awards was widely acclaimed.[210] A study conducted by E-Poll Market Research showed that Witherspoon was the most likable female celebrity of 2007.[211] That same year, she established herself as the highest-paid actress in the American film industry, earning $15 to $20 million per film.[212][213] The following years, her appearance in many commercially unsuccessful films caused her to lose this status, and she was noted as one of the most overpaid actors in Hollywood in 2011, 2012 and 2013.[214][215][216] In April 2011, she ranked No. 3 on the 22nd annual People's Most Beautiful issue.[217]\n\nIn June 2013, Witherspoon filed a lawsuit against Marketing Advantages International Inc., claiming they extensively used her name and image in jewelry advertising without permission in the U.S. and internationally. In December 2015, Witherspoon's trademark claims to her name were rejected on the grounds that she had not established secondary meaning to her full name, did not claim \"emotional distress\", and that the \"photos and facts were generally known by the public and the photos were taken in public with Plaintiff's consent\". However, the court ruled that she could proceed with her right of publicity claims against many defendants.[218][219][220] Two months later, she withdrew her lawsuit, having \"come to private agreements with the various defendants, including Centerbrook Sales, Fragrance Hut, Gemvara, and others\".[221] In October 2017, in the wake of the Harvey Weinstein sexual abuse scandal, Witherspoon revealed that she had been sexually assaulted at age 16 by a director and had had \"multiple experiences of harassment and sexual assault\" throughout her career.[222]\n\nIn 2015, Witherspoon made her second appearance on the Time 100 list, with her featured article written by Mindy Kaling.[223] That year, she was awarded, by the committee's unanimous vote, the American Cinematheque for being \"a perfect example of an actress flourishing in today's world\" and \"an active and successful movie producer who is moving her career forward both behind and in front of the camera\".[224][225][226] In 2017, Forbes reported her career earnings were in excess of $198 million, making her the highest-paid primetime Emmy nominee in 2017.[227] In 2019, Forbes listed her among the World's 100 Most Powerful Women.[228]\n\nPersonal life\n\nWitherspoon met actor Ryan Phillippe at her 21st birthday party in March 1997.[229] They became engaged in December 1998[230] and married on June 5, 1999, at Old Wide Awake Plantation in Hollywood, South Carolina.[231][232][233] They have two children together, daughter Ava Elizabeth Phillippe, born on September 9, 1999;[234][235] and son Deacon Reese Phillippe, born on October 23, 2003.[231] On October 30, 2006, Witherspoon and Phillippe announced their separation.[236] She filed for divorce on November 8, 2006, citing irreconcilable differences.[237] In light of their lack of a prenuptial agreement, she requested that the court refuse to grant spousal support to Phillippe, and asked for joint legal custody and sole physical custody of their two children. Phillippe filed for joint physical custody on May 15, 2007, and did not seek any spousal support.[238] The marriage officially ended on October 5, 2007, with final divorce arrangements settled on June 13, 2008, according to court documents. Phillippe and Witherspoon share joint custody of their children.[239]\n\nWitherspoon dated her Rendition co-star Jake Gyllenhaal from 2007 until 2009.[240][241] In February 2010, she was reported to be dating Jim Toth,[242][243][244] a talent agent and co-head of motion picture talent at Creative Artists Agency, where she is a client.[245] They announced their engagement that December,[246] and married on March 26, 2011 in Ojai, California, at Libbey Ranch,[247] Witherspoon's country estate, which she later sold.[248][249] They have a son together, Tennessee James Toth, born on September 27, 2012.[250] On April 19, 2013, Witherspoon was arrested and charged with disorderly conduct after Toth was stopped for suspicion of driving under the influence. She pleaded no-contest to obstruction of an officer and was required to pay court costs.[251]\n\nInfluences\n\nWitherspoon has cited Jodie Foster, Meryl Streep, Holly Hunter, Susan Sarandon, Frances McDormand, Debra Winger, Diane Ladd, Julia Roberts, Nicole Kidman, Jennifer Aniston, Goldie Hawn, Sally Field, Sigourney Weaver, Lucille Ball, Carole Lombard, Judy Holliday, Gena Rowlands, Tom Hanks, Jack Nicholson, and Michael Keaton as influences to her acting career and work.[17][18][252][253][254][255] Her favorite films include Splendor in the Grass, Waiting for Guffman, Broadcast News, Raising Arizona, and Overboard.[253][256][257][258]\n\nFilmography and accolades\n\nWitherspoon's most acclaimed and highest-grossing films, according to the review aggregate website Rotten Tomatoes, include Election (1999), Legally Blonde (2001), Walk the Line (2005), Monsters vs. Aliens (2009), Mud (2013), Wild (2014), and Sing (2016).[259] Witherspoon has been nominated for two Academy Awards, nine Golden Globe Awards,[45] four Screen Actors Guild Awards (SAG Awards), and two British Academy Film Awards (BAFTAs). She won the Golden Globe Award for Best Actress – Motion Picture Comedy or Musical, the SAG Award for Outstanding Performance by a Female Actor in a Leading Role, the BAFTA Award for Best Actress in a Leading Role, and the Academy Award for Best Actress for her performance as June Carter in the film Walk the Line (2005).[73][72] In 2010, Witherspoon received a star on the Hollywood Walk of Fame.[260]\n\nBibliography\n\nWitherspoon, Reese (2018). Whiskey in a Teacup. Touchstone. ISBN 978-1501166273 .", "images": ["http://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Cscr-featured.svg/20px-Cscr-featured.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Wikisource-logo.svg/26px-Wikisource-logo.svg.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Reese_Witherspoon%2C_2009.jpg/170px-Reese_Witherspoon%2C_2009.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Reese_Witherspoon_May_2011.jpg/170px-Reese_Witherspoon_May_2011.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Reese_Witherspoon_2009.jpg/170px-Reese_Witherspoon_2009.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Reese_Witherspoon_Cannes_2012.jpg/170px-Reese_Witherspoon_Cannes_2012.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Sing_29_%2829689607731%29.jpg/170px-Sing_29_%2829689607731%29.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "http://en.wikipedia.org/static/images/footer/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Reese_Witherspoon_2005.jpg/170px-Reese_Witherspoon_2005.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Reese_Witherspoon_at_TIFF_2014.jpg/220px-Reese_Witherspoon_at_TIFF_2014.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Reese_Witherspoon_at_TIFF_2014.jpg/1200px-Reese_Witherspoon_at_TIFF_2014.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Reese_Witherspoon_%2829144489784%29.jpg/175px-Reese_Witherspoon_%2829144489784%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Reese_Witherspoon_at_TIFF_2014.jpg/1200px-Reese_Witherspoon_at_TIFF_2014.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Reese_Witherspoon", "title": "Reese Witherspoon", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Reese_Witherspoon_at_TIFF_2014.jpg/640px-Reese_Witherspoon_at_TIFF_2014.jpg", "width": 640, "height": 840}, "title": "Reese Witherspoon - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}