{"url": "www.hollywoodreporter.com/news/michael-fassbender-is-a-legit-ferrari-race-car-driver-now-1116821", "text": "“What have I learned?” With the din of race cars screaming around the Laguna Seca racetrack outside Monterey, California, Michael Fassbender — wearing a racing suit, hair mussed from the Nomex balaclava and helmet he’s had on his head all morning — leans in as a big grin spreads over his face. “I’ve learned that I’m always two seconds off where I need to be.”\n\nTwo seconds in a line reading might not mean much, but on this 2.2-mile track with 11 turns (on the corkscrew, “head for the tree,” he advises), it’s an awful lot of time. Part of a small club of actors turned race car drivers, from Paul Newman and Steve McQueen to Patrick Dempsey, Fassbender — who spent his childhood in Ireland glued to the TV watching Michael Schumacher win one F1 title after another — is the real deal.\n\nThe 41-year-old star, who picked up the sport in 2016, possesses an encyclopedic, arcane knowledge of 1980s Group B rally racing and has logged more than 120 hours behind the wheel of his 488 Ferrari Challenge car — valued at $330,000, featuring a 670-horsepower, 3.9-liter turbocharged V-8 engine. It’s numbered 133, because, as he says, “three is my lucky number.”\n\nLuck, though, had little to do with Fassbender winning the first of six series (his next race is in Montreal on June 9) in the Ferrari Challenge 2018 season, which opened at Florida’s Daytona Speedway in January, where speeds exceed 190 miles per hour. Says Ferrari Challenge head instructor Didier Theys: “From the start, Michael has shown a great deal of dedication and talent as a competitor.”\n\nRacing is the reward that rounds out a career marked (so far) by two Oscar nominations, for his work in 2013’s 12 Years a Slave and 2015’s Steve Jobs.\n\n“It’s one of the things about the job that I do that’s a huge perk, just an absolute dream come true,” says Fassbender, who lives in Lisbon, Portugal, with Alicia Vikander, whom he married in October. “It was always a goal to do some sort of racing at 40, but I didn’t imagine that I’d be in a series like this with very powerful, very fast 660-odd horsepower machines.” Fassbender adds with a laugh, “It’s a lot more fun prepping for this than learning lines at home,” the downside being, “if you miss an apex or mess up a corner, you don’t get a ‘take two.'”\n\nHe points out the other contrast between his two chosen vocations — the type of risk involved: “It’s a different kind of butterflies. For a film, I’ve usually been putting together this character, but haven’t really shown it to anybody. That first day of shooting, it’s like, ‘God, I hope this works.’ But racing, once you start doing it, focusing on what you have to do, you can’t think of anything else. When you’re driving, literally, if your mind wanders, you’re going to go off the track.”\n\nThere’s a process to maintaining composure while white-knuckling it for four 30-minute races over weekends that begin with Thursday practice laps and end Sunday. Says Fassbender, “When it comes to the first practice day, your brain and body have to assimilate to these high speeds. You get into the car and think, ‘Oh, God, I can’t do this,’ but it’s incredible how the body and mind adapt — it’s just about focusing and trying to get in a rhythm. Racing is something that really does bring that level of forced meditation — it’s very rare in life.”\n\nOver time, the actor, who plays Magneto in February’s X-Men: Dark Phoenix, has reached an understanding about anxiety: “Before my first race here last year, I literally thought I was going to vomit. I was in the toilet beforehand, breathing. I was nervous, but that feeling is pretty special, that first race feeling.”\n\nWith Fassbender, winning really does seem to matter. “Like many of his fellow drivers, he’s something of a perfectionist and determined to win,” says Theys.\n\nNotes the star, making a nod to a perspective that many a fellow Oscar nominee might share: “You race to win, for sure, that’s the goal. Either you’re fastest or you’re not — that’s the allure for me. It’s always great to be on the podium.”\n\nThis story first appeared in the June 6 issue of The Hollywood Reporter magazine. To receive the magazine, click here to subscribe.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/06/michael_fassbender_rave_061-embed_thr.jpg?w=928", "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/michael_fassbender_rave_022-embed_thr.jpg?w=928", "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/michael_fassbender_rave_690-embed_2018_copy.jpg?w=928", "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/michael_fassbender_rave_638-h_2018_thr_0.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/michael_fassbender_rave_959-embed_thr.jpg?w=928", "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/michael_fassbender_rave_305-embed_thr.jpg?w=928", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/michael_fassbender_rave_638-h_2018_thr_0.jpg?w=1024", "keywords": [], "authors": ["Jon Alain Guzik"], "canonical_link": "https://www.hollywoodreporter.com/lifestyle/lifestyle-news/michael-fassbender-is-a-legit-ferrari-race-car-driver-now-1116821/", "title": "“Either You’re the Fastest or Not”: Michael Fassbender on His Car-Racing Obsession", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Michael Fassbender is part of a small club of actors turned race car drivers — from Paul Newman and Steve McQueen to Patrick Dempsey — and is fresh off a first-place finish in the first of six series at the Daytona Ferrari Challenge, with another race on June 9.", "news_keywords": "Michael Fassbender", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Jon Alain Guzik", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1116821, "title": "\"Either You're the Fastest or Not\": Michael Fassbender on His Car-Racing Obsession", "published_at": "2018-06-08 09:00:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/michael_fassbender_rave_638-h_2018_thr_0.jpg?w=1024", "comment_count": 0, "tags": "Michael Fassbender", "topics": "Lifestyle News", "body": "\"What have I learned?\" With the din of race cars screaming around the Laguna Seca racetrack outside Monterey, California, Michael Fassbender — wearing a racing suit, hair mussed from the Nomex balaclava and helmet he's had on his head all morning — leans in as a big grin spreads over his face. \"I've learned that I'm always two seconds off where I need to be.\"\r\nTwo seconds in a line reading might not mean much, but on this 2.2-mile track with 11 turns (on the corkscrew, \"head for the tree,\" he advises), it's an awful lot of time. Part of a small club of actors turned race car drivers, from Paul Newman and Steve McQueen to Patrick Dempsey, Fassbender — who spent his childhood in Ireland glued to the TV watching Michael Schumacher win one F1 title after another — is the real deal.\r\nThe 41-year-old star, who picked up the sport in 2016, possesses an encyclopedic, arcane knowledge of 1980s Group B rally racing and has logged more than 120 hours behind the wheel of his 488 Ferrari Challenge car — valued at $330,000, featuring a 670-horsepower, 3.9-liter turbocharged V-8 engine. It's numbered 133, because, as he says, \"three is my lucky number.\"\r\nLuck, though, had little to do with Fassbender winning the first of six series (his next race is in Montreal on June 9) in the Ferrari Challenge 2018 season, which opened at Florida's Daytona Speedway in January, where speeds exceed 190 miles per hour. Says Ferrari Challenge head instructor Didier Theys: \"From the start, Michael has shown a great deal of dedication and talent as a competitor.\"\r\n\r\nRacing is the reward that rounds out a career marked (so far) by two Oscar nominations, for his work in 2013's 12 Years a Slave and 2015's Steve Jobs.\r\n\"It's one of the things about the job that I do that's a huge perk, just an absolute dream come true,\" says Fassbender, who lives in Lisbon, Portugal, with Alicia Vikander, whom he married in October. \"It was always a goal to do some sort of racing at 40, but I didn't imagine that I'd be in a series like this with very powerful, very fast 660-odd horsepower machines.\" Fassbender adds with a laugh, \"It's a lot more fun prepping for this than learning lines at home,\" the downside being, \"if you miss an apex or mess up a corner, you don't get a 'take two.'\"\r\nHe points out the other contrast between his two chosen vocations — the type of risk involved: \"It's a different kind of butterflies. For a film, I've usually been putting together this character, but haven't really shown it to anybody. That first day of shooting, it's like, 'God, I hope this works.' But racing, once you start doing it, focusing on what you have to do, you can't think of anything else. When you're driving, literally, if your mind wanders, you're going to go off the track.\"\r\n\r\nThere's a process to maintaining composure while white-knuckling it for four 30-minute races over weekends that begin with Thursday practice laps and end Sunday. Says Fassbender, \"When it comes to the first practice day, your brain and body have to assimilate to these high speeds. You get into the car and think, 'Oh, God, I can't do this,' but it's incredible how the body and mind adapt — it's just about focusing and trying to get in a rhythm. Racing is something that really does bring that level of forced meditation — it's very rare in life.\"\r\n\r\n\r\nOver time, the actor, who plays Magneto in February's X-Men: Dark Phoenix, has reached an understanding about anxiety: \"Before my first race here last year, I literally thought I was going to vomit. I was in the toilet beforehand, breathing. I was nervous, but that feeling is pretty special, that first race feeling.\"\r\nWith Fassbender, winning really does seem to matter. \"Like many of his fellow drivers, he's something of a perfectionist and determined to win,\" says Theys.\r\nNotes the star, making a nod to a perspective that many a fellow Oscar nominee might share: \"You race to win, for sure, that's the goal. Either you're fastest or you're not — that's the allure for me. It's always great to be on the podium.\"\r\n\r\nThis story first appeared in the June 6 issue of The Hollywood Reporter magazine. To receive the magazine, click here to subscribe.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "“Either You’re the Fastest or Not”: Michael Fassbender on His Car-Racing Obsession", "url": "https://www.hollywoodreporter.com/lifestyle/lifestyle-news/michael-fassbender-is-a-legit-ferrari-race-car-driver-now-1116821/", "description": "Michael Fassbender is part of a small club of actors turned race car drivers — from Paul Newman and Steve McQueen to Patrick Dempsey — and is fresh off a first-place finish in the first of six seri…", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/michael_fassbender_rave_638-h_2018_thr_0.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2018-06-08T09:00:00+00:00", "modified_time": "2018-06-08T09:00:01+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "“Either You’re the Fastest or Not”: Michael Fassbender on His Car-Racing Obsession", "description": "Michael Fassbender is part of a small club of actors turned race car drivers — from Paul Newman and Steve McQueen to Patrick Dempsey — and is fresh off a first-place finish in the first of six seri…", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/michael_fassbender_rave_638-h_2018_thr_0.jpg?w=1280"}}, "movies": [], "publish_date": 1528448400.0, "source": "http://www.hollywoodreporter.com", "summary": ""}