{"url": "https://www.biography.com/news/american-idol-winners-where-are-they-now", "text": "When Fox began airing American Idol’s self-described “search for a superstar” on June 11, 2002, the reality singing competition instantly earned its rightful place in the pop culture canon. With millions tuning in from week-to-week to laugh at wacky auditions or cry at the hopefuls’ touching backstories, a whole generation of Americans began uttering catchphrases like “check it out, dawg” (just try to not read that in Randy Jackson’s voice) or acted like they knew what “pitchy” really meant. As much as Jackson’s lingo became part of our lexicon, and the heated (or was it flirtatious?) banter between his fellow original judges, the snarky Simon Cowell and fun-loving, sometimes-loopy Paula Abdul kept us transfixed, the show was really about the contestants. A launchpad for many small-town kids with big-time dreams, Idol became a star-making machine that spanned 15 seasons before ending its first run on April 7, 2016.\n\nOff the air for less than two years, the musical mega-hit found a new home on ABC, with new judges Katy Perry, Luke Bryan and Lionel Richie. Take a stroll down memory lane and catch up with lucky winners. Grab your giant red Coca-Cola cups and dim the lights . . . here we go.\n\nKelly Clarkson (Season 1)\n\nLet’s face the music: Our lives (or at least our playlists!) would suck without Kelly Clarkson. In fact, it’s difficult to imagine a time when she — and Idol itself — weren’t part of the pop music conversation. But that was exactly the case in 2002 when the wide-eyed Texan, admitted she didn’t even know she was trying out for a TV show until her third audition, sang her way into our hearts and to the top of the charts as the show’s inaugural winner. With her coronation song, “A Moment Like This” — which she emotionally performed after her season one triumph over runner-up Justin Guarini — Clarkson broke a 38-year-old record for biggest leap (previously held by The Beatles) when it jumped from No. 52 to No. 1 on Billboard’s Hot 100 chart.\n\nIn April 2003, her multiplatinum debut album Thankful and hit single “Miss Independent” followed, charting at No. 1 in their first week of release. With her sophomore effort, 2004’s Breakaway, she won her first Grammys for Best Pop Vocal Album and Best Female Pop Vocal Performance for “Since You’ve Been Gone.” Several bestselling studio albums later (2017’s Meaning of Life was her eighth to crack the top three), the artist made history as the first Idol alum to score 100 total Billboard No. 1s. Along with becoming a mother, Clarkson took over a swivel chair as a coach on The Voice, before launching her own daytime talk show in 2019.\n\nRuben Studdard (Season 2)\n\nBefore he was “sorry for 2004,” Ruben Studdard (aka Idol’s “velvet teddy bear”) became the show's second champ when he narrowly bested Clay Aiken on the May 2003 finale. Just six months post-win, the Alabama native dropped his first album, Soulful, which debuted at No. 1 on the Billboard 200 and earned him a Best Male R&B Vocal Performance Grammy nod for its title track. He switched gears in 2004 and released a gospel album before finding his way back to R&B with 2006’s The Return. But when neither album lived up to his debut’s sales figures, his label, J Records, dropped him in December 2007.\n\nSix months later, he married Zuri McCants, whom he met at a CD signing at an Atlanta Walmart, but his personal life also took a hit when the pair divorced in 2012. The following year he was back on reality TV, tackling health concerns on the weight loss competition, The Biggest Loser. But the focus soon returned to Studdard's music, beginning with his well-received 2014 album, Unconditional Love. He followed in 2018 with Ruben Sings Luther, an homage to the late Luther Vandross, before teaming with Aiken late that year to perform a Christmas show on Broadway.\n\nFantasia Barrino (Season 3)\n\nAs an inspirational 19-year-old single mother, Fantasia Barrino accomplished the seemingly impossible: earning raves from hard-nosed Cowell for her soulful May 2004 finale performance of Gershwin’s jazz classic “Summertime.” Oh yeah, and she obviously won the whole competition, too. Six months after her Idol crowning, the accolades continued when she released her Grammy-nominated platinum debut album, Free Yourself, featuring the hit singles “I Believe” and “Truth Is.” The North Carolina native continued to record music and compile Grammy nominations, eventually taking home a golden gramophone for Best Female R&B Vocal Performance in 2011.\n\nAdditionally, the artist penned the memoir Fantasia: Life Is Not a Fairytale, played herself in Lifetime’s subsequent 2006 adaptation of the book, had her own VH1 reality series (Fantasia for Real) and starred in the Broadway shows (remove parentheses here) The Color Purple and After Midnight. Despite her career highs, Barrino found herself in the depths of depression, admitting a 2010 aspirin overdose that left her hospitalized was indeed a suicide attempt. She's since rebounded by welcoming son Dallas in December 2011 and marrying businessman Kendall Taylor in July 2015, while keeping her career humming along with the release of the albums Christmas After Midnight in 2017 and Sketchbook in 2019.\n\nCarrie Underwood (Season 4)\n\n“Jesus Take the Wheel” was an apt title for the first single off of Carrie Underwood’s 8x-platinum debut album, Some Hearts – because with its November 2005 release, her career catapulted like a rocket. The Oklahoma native — whose powerful country vocals led her to top honors on Idol’s fourth season in May 2005 — has now sold more than 60 million albums around the world, earned seven Grammys, released dozens of hit singles from her best-selling albums and can consistently be found on Forbes’ top-earning musicians lists. Oh, and in addition to a slew of other music awards, she even had time to score a 2010 Guinness World Record for most country No. 1s for a female artist in the U.S.\n\nThat same year, she married pro hockey player Mike Fisher, with whom she shares sons Isaiah and Jacob. In 2013, she made her acting debut as Maria von Trapp in The Sound of Music Live! which netted more than 18.6 million viewers. Underwood did take a tumble in late 2017, though not professionally, announcing that she’d had surgery after sustaining appearance-altering injuries in a fall at her Nashville home. Not one to be kept down (and because if anyone knows a thing or two about winning, it’s her), Underwood released a video for “The Champion,” her Super Bowl anthem featuring Ludacris, in early 2018 (The clip even includes footage from her Idol audition!), before she returned to her customary place atop the charts later that year with the album Cry Pretty.\n\nTaylor Hicks (Season 5)\n\nThe competition’s oldest winner (at a whole 29 years old!) edged out Katharine McPhee in 2006 with the help of his fan army, dubbed “Soul Patrol.” But Taylor Hicks’ supporters seemed to go off-duty when his self-titled December 2006 release became the lowest selling post-win record of any of the show’s previous winners. (The album, which included the songs \"Just to Feel That Way\" and \"Heaven Knows[,]\" did still hit No. 2 on the Billboard 200 chart, however.) When his record label, Arista, proceeded to drop him in 2008, he founded his own label, Modern Whomp, under which he released two albums within two years. The musician later scored a successful Las Vegas residency (the first Idol alum to do so!) from 2012-2013.\n\nHicks has since plunged himself into the restaurant business and showcased his culinary tastes as host of State Plate, a food and travel series on the INSP network. Music also remains on his plate, as evidenced by the 2017 release of \"Six Strings and Diamond Rings\" — his first single in eight years — and his starring role in a 2019 Serenbe Playhouse revival of the Civil War-era musical Shenandoah.\n\nJordin Sparks (Season 6)\n\nMonths after her being named Idol’s 2007 champ, Jordin Sparks blazed onto the music scene with her platinum self-titled debut’s singles “Tattoo” and “No Air.” Two years later, her sophomore effort, Battlefield, peaked at No. 7 on the Billboard album charts, but, even so, the Arizonan decided to take a hiatus from music in favor of acting. During the break, she had several cameos on TV shows (including Disney’s The Suite Life on Deck in 2009 and Nickelodeon’s Big Time Rush in 2010), starred in Broadway’s In the Heights, made a feature film debut in 2012’s Sparkle, alongside the late Whitney Houston, and also released three perfumes. Following a high-profile split from boyfriend of three years Jason Derulo in 2014, she made her musical comeback that same year with a mixtape, #ByeFelicia and later dropped a third studio album, Right Here Right Now, in August 2015.\n\nThe following years brought a bit of everything for Sparks, who had a son with husband Dana Isaiah, landed a leading voice role in the 2018 feature film comedy Show Dogs, teamed with Elijah Blake for the 2019 EP 1990 Forever and joined the production of the hit Broadway musical Waitress.\n\nDavid Cook (Season 7)\n\nSouthern rocker David Cook never intended to audition for Idol. (He only went to the Omaha call to support his brother.) But his rendition of “Livin’ On a Prayer” was the godsend that earned him his ticket to Hollywood, where he ultimately won the 2008 season. His debut single “The Time of My Life,” which debuted at No. 3, was one of a record-breaking 11 songs he had that hit the Billboard Hot 100 after his win. And although his self-titled album David Cook, which he dropped that November, sold more than one million copies and reached No. 3 on the Billboard 200, his following album sold much more modestly. In 2012, he revealed he’d parted ways with his label and began releasing music independently, while also recording with his band Midwest Kings. Cook, who married his longtime girlfriend Rachael Stump in 2015, self-released a new six-song EP, Chromance, in February 2018, before making his Broadway debut as Charlie Price in Kinky Boots that April. He continues to record and perform new music, with his 2020 single, \"Reds Turn Blue,\" delving into his post-Idol battles with an anxiety disorder.\n\nKris Allen (Season 8)\n\nAfter pulling an upset over Adam Lambert in 2009, Kris Allen came alive four months after his win with the release of his first single “Live Like We’re Dying,” which hit No. 10 on the Mainstream Top 40 chart. His subsequent album, 2012’s Thank You Camellia, peaked at No. 26 on the Billboard 200, before Allen was involved in a life-changing car accident. On January 1, 2013, a head-on collision left his wrist shattered, requiring three surgeries over the following years — and forcing him to re-learn how to play the guitar. On a happier note, he and his high-school sweetheart Katy, whom he married in 2008, welcomed a son later that year, before adding to their family with a daughter and another son. The Arkansas native has continued to quietly release new music, both by himself and with a band called The Dames. Following 2016’s Somethin' About Christmas, Allen celebrated a decade in the business with the release of his 2019 album, 10.\n\nLee DeWyze (Season 9)\n\nIllinois singer-songwriter Lee DeWyze covered U2’s “Beautiful Day” for his first release after his 2010 win but waffled on a follow-up single. After settling on “Sweet Serendipity” off of his November 2010 post-Idol debut[,] Live It Up, the album failed to break into the Billboard 200’s Top 10. His next big breakout came four years later when AMC’s hit show The Walking Dead featured his “Blackbird Song,” which went on to accumulate millions of YouTube views and Spotify streams. DeWyze, who married actress Jonna Walsh in 2012, seemed to find his calling, securing additional placements in several other series, including Nashville, Elementary and Suits. Meanwhile, he continued developing as an artist away from the Idol glare: His 2016 album, Oil & Water, debuted in the Top 10 on Billboard’s Folk Music chart, while 2018's Paranoia and the 2019 EP Castles also garnered positive reviews.\n\nScotty McCreery (Season 10)\n\nBaby-faced Scotty McCreery’s deep voice carried his tunes \"I Love You This Big\" and \"The Trouble with Girls\" to the top of the charts following his 2011 Idol triumph. (His platinum-selling debut Clear as Day also hit No. 1 on the Billboard 200.) Since then, he has sold millions of records (with three consecutive No. 1 album chart debuts) and toured with Brad Paisley, The Band Perry and Rascal Flatts. The North Carolina-born country crooner also wrote a memoir, Go Big or Go Home: The Journey Toward the Dream, in 2016, the same year he discovered he was dropped from his label.\n\nBut he found a way to bounce back: After finally notching his first No. 1 single on Billboard's Country Airplay chart in early 2018 with the ballad \"Five More Minutes,\" McCreery delivered his fourth Top 10 album a few weeks later with Seasons Change, before marrying his childhood friend and longtime girlfriend Gabi Dugal in June.\n\nPhillip Phillips (Season 11)\n\n\"Home,\" the song Phillip Phillips performed on the 2012 finale turned out to be a, well, home run, scoring the biggest digital sales week of any Idol coronation song to date and selling more than 5 million copies in the United States. His debut album, The World from the Side of the Moon, reached No. 4 on the Billboard 200, and he went on to drop his sophomore album, Behind the Light, in 2014. But Phillips' career hit a sour note in January 2015, when a legal battle over his contract with Idol’s production company, 19 Entertainment, stalled any new releases. It wasn’t until 2017 when the two parties settled the case that Phillips, who opened for the Goo Goo Dolls that summer and guest-starred as a diamond smuggler on Hawaii Five-O soon afterward, was able to release any new songs. His fresh start musically came via the January 2018 release of Collateral, his first studio album since 2014. Now a husband and father, Phillips returned to American Idol in 2020 to perform his celebrated coronation song from eight years earlier.\n\nCandice Glover (Season 12)\n\nThe third time was the charm for Candice Glover who auditioned for Idol twice before getting her ‘yes’ votes in 2013. Unlike her predecessors, she waited almost a year after her Idol win to drop her debut studio album Music Speaks, which peaked at No. 14 and received lackluster reviews. The reason, Glover claimed, was because she didn’t believe the album was ready and her objections to its release went ignored. The South Carolina-bred powerhouse also maintains that what she has called a “communication issue” between her label and iTunes caused the album to be released by accident.\n\nGlover split with her label and largely began avoiding the spotlight, although she kept her fans happy by uploading remixes of popular songs like Drake's \"Controlla\" to SoundCloud. In November 2017, she made her Broadway debut alongside Bianca Ryan (of America’s Got Talent) and Josh Kaufman (who competed on The Voice) in the Christmas musical Home For The Holidays. Glover continued her comeback in 2018 with the single \"Break Me,\" before appearing on the series G.R.I.T.S.: Girls Raised in the South the following year.\n\nCaleb Johnson (Season 13)\n\nLike Glover, Caleb Johnson auditioned multiple times before winning Idol in 2014. Although he became the only contestant to not land in the bottom three that season, the North Carolina-born rocker didn’t exactly rock the charts after the show. Testify, the 10-track record he released just two months after wrapping up Idol, sold just 28,000 copies. After splitting from Interscope Records the following year, he turned to the crowd-funding website PledgeMusic in 2017 to finance a follow-up project, eventually releasing the EP Born From Southern Ground with his backing band, the Ramblin Saints, in 2019. In the spirit of staying independent, Johnson has also performed new songs for fans live on his official Facebook page.\n\nNick Fradiani (Season 14)\n\nBefore taking the Idol stage in 2015, Nick Fradiani, along with his Beach Avenue bandmates, competed a year earlier on season nine of America's Got Talent. The group didn’t make the cut on that show, but luckily the Idol judges (and America) ruled in his favor as a solo artist in the original series' penultimate season. Still, his finale song and first single, “Beautiful Life,” only climbed as high as No. 93 on the Hot 100 chart, and his debut album, Hurricane, only sold 5,000 copies in its first week. Connecticut-based Fradiani said he left his label, Big Machine Records in 2017 “on good terms” and that “it just wasn’t the right fit.” He released the independent six-song EP Where We Left Off that October, before taking his talents to the theater in a touring production of A Bronx Tale.\n\nTrent Harmon (Season 15)\n\nThe winner of what had been billed as Idol’s farewell season, Trent Harmon earned the distinction of a “hot shot debut” on Billboard’s Hot Country Songs chart in 2016 with his Keith Urban-penned track “Falling.” Instead of releasing a full-length album, the Mississippi native opted to put out a self-titled five-song EP, which included a second Top 30 country hit, “There's a Girl,” that December. Two full years after his win, Harmon finally delivered his debut studio album, You Got 'Em All, its title track inspired by a breakup with his girlfriend.\n\nMaddie Poppe (Season 16)\n\nAmerican Idol's grand return in 2018 introduced the world to Maddie Poppe, the Clarksville, Iowa, native who won over audiences — not to mention runner-up Caleb Lee Hutchinson, who became her boyfriend — with her earnestness and storytelling abilities. Despite her unassuming nature, the 20-year-old chanteuse was no novice when it came to the music business, as she had already released the album Songs from the Basement around the time she graduated high school in 2016. As such, despite receiving what her fans viewed as a lack of a promotional boost from Idol, Poppe plowed forward with the 2019 album Whirlwind, on which she showcased her multi-instrumental abilities and burgeoning songwriting skills.\n\nLaine Hardy (Season 17)\n\nAfter falling short the previous season, Laine Hardy returned to the Idol stage in 2019 to play guitar for friend Ashton Gill's audition. But the judges took note of his new look and more confident delivery, and by the end, the Louisiana country boy was crooning his new single, \"Flame,\" to celebrate a hard-earned win over Alejandro Aranda. Hardy followed with a fall tour and two additional singles in spring 2020 before the coronavirus pandemic threw his life into disarray: Along with postponing another planned tour, the singer announced in June that he had contracted COVID-19, though he reassured fans that he was OK.\n\nSamantha 'Just Sam' Diaz (Season 18)\n\nSpeaking of COVID, the pandemic ignited a massive production overhaul in the middle of season 18, forcing contestants and judges to participate from remote locations. But the unusual circumstances didn't diminish the feel-good win of Samantha Diaz — a.k.a. Just Sam — who was raised by her grandmother and honed her craft by singing on the New York City subway system. After beating out Arthur Gunn for the crown, Diaz revealed that she couldn't wait to reunite with grandma, and announced her equally inspiring plans for the future: \"I am going to try to do what American Idol was trying to do in the beginning and that is bring family and friends together during this time when we need each other most. We shouldn't be alone.\"", "images": ["https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTY2OTg1NzIxMTU0OTA1Nzcz/saved-by-the-bell--photo-by-chris-haston_nbcu-photo-bank.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTg1Mzk3MjE5NDU1NjczNjM1/home-alone-cpph5r.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTU4NTkxMDM3Mzg2Nzk0NTcw/hocus-pocus-sarah-jessica-parker-bette-midler-kathy-najimy-1993-cbuena-vista-pictures_courtesy-everett-collection.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTY3MDU3NTEwOTk2Mzg3NTAx/baywatch-paul-simmons-jackson-charvet-bleeth-hasselhoff-anderson-williams-1989-2001.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTgwMjcwNDY4NjYwNDcxNjYw/gettyimages-651940217.jpg", "https://www.biography.com/.image/cs_srgb%2Cq_auto:good/MTQ1NTM0MTQ5NzA3NDQxNzE5/navbarwhite.png", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTQ5ODIwNDkzNTE0NDE3ODkw/ally_mcbeal_cast_1998_photo_fox_photofest_resized.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTY5NTU2MDgzMjU2MzM3ODgz/gettyimages-180258665.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTU2ODAwNjMxMTQ1NzY4NTYw/gettyimages-141296050.jpg", "https://www.biography.com/.image/t_share/MTU0MDY0MDU0ODgzNzIyMzIy/kelly-clarkson-during-american-idol-season-1-finale---results-show-at-kodak-theatre-in-hollywood-california-united-states-photo-by-sgranitz_wireimage.jpg", "https://www.biography.com/.image/c_fit%2Ccs_srgb%2Cq_auto:good%2Cw_458/MTQ1NTMzOTkyNDA0MjY0NTAz/sitelogowhite.png", "https://www.biography.com/.image/ar_16:9%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_768/MTU0MDY0MDU0ODgzNzIyMzIy/kelly-clarkson-during-american-idol-season-1-finale---results-show-at-kodak-theatre-in-hollywood-california-united-states-photo-by-sgranitz_wireimage.jpg", "https://www.biography.com/.image/ar_8:10%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cg_faces:center%2Cq_auto:good%2Cw_620/MTU1NjYyODY0NTEyNzIyNDI4/cheers-cast-photo-by-paul-drinkwater_nbc_nbcu-photo-bank-via-getty-images.jpg"], "top_img": "https://www.biography.com/.image/t_share/MTU0MDY0MDU0ODgzNzIyMzIy/kelly-clarkson-during-american-idol-season-1-finale---results-show-at-kodak-theatre-in-hollywood-california-united-states-photo-by-sgranitz_wireimage.jpg", "keywords": [], "authors": ["Brad Witter"], "canonical_link": "https://www.biography.com/news/american-idol-winners-where-are-they-now", "title": "‘American Idol’ Winners: Where Are They Now?", "meta_data": {"author": "Brad Witter", "description": "The famed reality singing competition series has spawned some of the music industry’s biggest stars since its 2002 debut.", "keywords": "Nostalgia,Latest Features,Celebrity,In the News", "section": "Latest Features", "sub-section": "Nostalgia", "pagetype": "article", "robots": "max-image-preview:large", "item-id": "ci022356c3b0002452", "published": "2018-03-09T17:58:14Z", "modified": "2020-07-08T20:13:23Z", "dcterms.rightsHolder": "Biography and the Biography logo are registered trademarks of A&E Television Networks, LLC.", "dcterms.dateCopyrighted": 2022, "twitter": {"card": "summary_large_image", "site": "@bio", "creator": "@booradlie27", "url": "https://www.biography.com/news/american-idol-winners-where-are-they-now", "image": "https://www.biography.com/.image/t_share/MTU0MDY0MDU0ODgzNzIyMzIy/kelly-clarkson-during-american-idol-season-1-finale---results-show-at-kodak-theatre-in-hollywood-california-united-states-photo-by-sgranitz_wireimage.jpg", "description": "The famed reality singing competition series has spawned some of the music industry’s biggest stars since its 2002 debut.", "domain": "www.biography.com"}, "og": {"type": "article", "url": "https://www.biography.com/news/american-idol-winners-where-are-they-now", "title": "‘American Idol’ Winners: Where Are They Now?", "description": "The famed reality singing competition series has spawned some of the music industry’s biggest stars since its 2002 debut.", "image": "https://www.biography.com/.image/t_share/MTU0MDY0MDU0ODgzNzIyMzIy/kelly-clarkson-during-american-idol-season-1-finale---results-show-at-kodak-theatre-in-hollywood-california-united-states-photo-by-sgranitz_wireimage.jpg", "site_name": "Biography"}, "fb": {"pages": 123492867697144, "app_id": 104784826244596}, "pinterest-rich-pin": "true", "apple-mobile-web-app-title": "Biography", "parsely-title": "‘American Idol’ Winners: Where Are They Now? - Biography", "parsely-link": "https://www.biography.com/news/american-idol-winners-where-are-they-now", "parsely-image-url": "https://www.biography.com/.image/c_fill%2Ccs_srgb%2Cfl_progressive%2Ch_400%2Cq_auto:good%2Cw_620/MTU0MDY0MDU0ODgzNzIyMzIy/kelly-clarkson-during-american-idol-season-1-finale---results-show-at-kodak-theatre-in-hollywood-california-united-states-photo-by-sgranitz_wireimage.jpg", "parsely-post-id": "ci022356c3b0002452", "parsely-pub-date": "2018-03-09T17:58:14Z", "parsely-section": "Latest Features", "parsely-author": "Brad Witter", "parsely-tags": "Nostalgia,Latest Features,Celebrity,In the News,Randy Jackson,Simon Cowell,Kelly Clarkson,Carrie Underwood", "sailthru.title": "‘American Idol’ Winners: Where Are They Now?", "sailthru.image.full": "https://www.biography.com/.image/t_share/MTU0MDY0MDU0ODgzNzIyMzIy/kelly-clarkson-during-american-idol-season-1-finale---results-show-at-kodak-theatre-in-hollywood-california-united-states-photo-by-sgranitz_wireimage.jpg", "sailthru.date": "2018-03-09T17:58:14Z", "sailthru.author": "Brad Witter", "sailthru.tags": "Nostalgia,Latest Features,Celebrity,In the News", "sailthru.description": "The famed reality singing competition series has spawned some of the music industry’s biggest stars since its 2002 debut.", "phx": {"content-item-id": "ci022356c3b0002452", "content-object-type": "ContentArticle", "exclusive-content-type": "free", "site-keyword": "biography"}, "google-site-verification": "NtA82m_nY0RdVtIFdXEAhFcaqEr43II3Z2UEuVRe4vA", "viewport": "width=device-width, initial-scale=1", "referrer": "unsafe-url", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-mobile-web-app-capable": "no", "apple-mobile-web-app-status-bar-style": "black", "format-detection": "address=no", "msvalidate.01": "565AA37CB662E60BF24DDCABEC686D8F", "generator": "Tempest - maven.io", "pinterest": "nohover"}, "movies": [], "publish_date": 1520618294.0, "source": "https://www.biography.com", "summary": ""}