{"url": "https://www.politico.com/story/2017/05/09/trump-presidents-carter-bush-clinton-238125", "text": "“The immediate former presidents have been more active in their criticism of the current president,” George C. Edwards, a presidential historian at Texas A&M, said. “This kind of thing has been going on throughout history, but normally it’s not very much. This is very early in a tenure and to have former presidents being critical of the president… is pretty unusual.”\n\nAs Obama returns to the public spotlight, his former aides have made it clear he has no intention of talking much about Trump. However, he’s made his displeasure clear.\n\nObama, who campaigned heavily for Hillary Clinton, said he was “heartened” by the protests following Trump’s immigration ban targeting Muslim-majority countries. He also released a lengthy statement defending the Affordable Care Act against Trump’s attempts to repeal it.\n\nAt a speech in Boston on Sunday night, Obama avoided mentioning Trump by name, but again forcefully defended his signature health care legislation and mentioned immigration reform. “I expect to be busy, if not with a second career, at least a second act,” Obama said Sunday.\n\nAnd on Monday, Obama’s aides aggressively pushed back against Trump for trying to blame his predecessor for the woes associated with Trump’s disgraced former national security adviser Michael Flynn. While Trump and White House press secretary Sean Spicer have repeatedly denounced Obama for not revoking Flynn’s security clearance, Obama aides told reporters that Obama tried to warn Trump about Flynn’s erratic nature.\n\nGeorge W. Bush, meanwhile, has lobbed thinly veiled critiques of Trump on his approach to the press and the travel ban from some Muslim-majority countries. “I consider the media to be indispensable to democracy,” Bush said in an interview with “Today” in February. “We need an independent media to hold people like me to account.”\n\nAs for the travel ban, Bush was restrained but clear in his concern. “I am for an immigration policy that’s welcoming and upholds the law,” Bush said.\n\nCarter also voiced concerns after Trump’s inauguration. During an early April appearance at Emory University, he said he wanted to avoid addressing politics but he hoped the women’s movement would be “invigorated” by Trump and that he didn’t see “any glimmer of hope” from the administration on race and gender issues.\n\nBill Clinton, who was harshly critical of Trump during the Manhattan businessman’s presidential campaign, didn’t mince words about Trump when he ran into a local newspaper editor while holiday shopping. “He doesn’t know much,” Clinton said in late December. “One thing he does know is how to get angry white men to vote for him.”\n\nGeorge H.W. Bush, who has been in and out of the hospital, remains the only living president to avoid any political commentary.\n\nCriticism of the current president by former presidents is not completely unprecedented, however. For example, Herbert Hoover criticized Franklin D. Roosevelt, his successor.\n\n“We’ve seen some criticism already of the incumbent president, but that’s not really unprecedented,” Tim Naftali, a presidential historian at New York University, said. “If it continues at a drumbeat from former presidents, then it will be something new.”\n\nCurrent and former aides to the living former presidents say their former bosses are careful in criticizing the current occupant of the West Wing. Stuart Eizenstat, Carter’s chief domestic policy adviser and a former ambassador, said it usually takes an extraordinary occurrence for a former president to criticize a sitting president.\n\n“There’s a recognition that there is something so unique and special about the presidency, that, notwithstanding what might be very deep and serious policy differences and personal understandings, you simply bite your tongue,” he said. “You don’t try to undercut the president because you know what impact that would have had when you were president.”\n\nWhile in office, former presidents occasionally turn to their predecessors for guidance. Former aides say particularly on foreign policy issues, previous presidents and statesmen can be a valuable resource.\n\n“Most of the time President Clinton reached out to former heads of state, or people like Henry Kissinger or James Baker, they were usually foreign policy issues, where you had a perspective there that was pretty unique on dealing with a similar situation,” Mack McLarty, Clinton’s former chief of staff, said.\n\nFor example, Carter worked with former President Gerald Ford on the treaties which turned control of the Panama Canal over to Panama. Eizenstat said Carter instructed negotiator Sol Linowitz to call Ford immediately after the deal was ratified.\n\nOthers primarily use their predecessors for humanitarian trips. Harry Truman famously sent Hoover to address the post-World War II famine, and George W. Bush had his father and Clinton help with relief efforts for the tsunami in Southeast Asia and Hurricane Katrina. Most recently, Obama sent the younger Bush and Clinton to Haiti to help after the 2010 earthquake.\n\n“What would be really unusual is if no former president undertook any missions on behalf of the incumbent president,” Naftali said. “If we see that none of the former presidents want anything to do with the Trump administration, that would be a first in the modern history of the American presidency.”\n\nAll in all, most presidents have made an effort to remain engaged socially with their predecessors. Clinton and H.W. Bush are particularly close despite their hard-fought 1992 election, with Clinton tweeting pictures of the two in April.\n\nBut Trump is no normal president. Trump, who rose politically for questioning the legitimacy of his predecessor, at first appeared to have forged a working relationship with Obama, receiving advice both in person and over the phone. Obama even said he was “encouraged” by their first post-election meeting.\n\nTrump has since leveled unfounded wiretapping accusations against Obama, and the president abruptly ended a recent interview with CBS’ John Dickerson after Dickerson pressed him on his comments about Obama.\n\n“He was very nice to me, but after that, we’ve had some difficulties,” Trump said before referencing his debunked wiretapping allegation and saying that the alleged wiretapping was “inappropriate.”\n\nFormer President Barack Obama speaks at a community event on the Presidential Center at the South Shore Cultural Center, Wednesday, May 3, 2017, in Chicago. The Obama Foundation unveiled plans for the former president's lakefront presidential center, showcasing renderings and a model at an event where former President Barack Obama and first lady Michelle Obama were expected to give more details. (AP Photo/Nam Y. Huh)\n\nHistorically speaking, Trump’s relationship with the living former presidents is more fraught than any of his predecessors’ had been, Laura Belmonte, a presidential historian at Oklahoma State University, said. “That one I think may be a category where Trump is on his own,” she said\n\nAnd Trump hasn’t shied away from criticizing those who came before him. As president, Trump called Obama a “bad (or sick) guy!” as part of his debunked wire-tapping claim. He called George W. Bush “not nice” during the campaign, said the Bush administration “lied” about the Iraq War and called Bill Clinton “the WORST abuser of women in U.S. political history.”\n\nGeorge H.W. Bush and Carter weren’t excluded from Trump’s slights. “Enough is Enough- No More Bushses!” Trump tweeted during the campaign. He alsocriticized Carter as unpresidential for carrying his own luggage.\n\nSteven Hochman, an aide to Carter at the Carter Center who helped the 92-year-old former president write his memoirs, said Carter hopes he and his center will be able to work with the Trump administration.\n\nAnd Carter hasn’t always seized opportunities to knock Trump. The former president appeared with Sen. Bernie Sanders (I-Vt.) Monday to discuss human rights, and — while revealing that he voted for Sanders — Carter said the “downturn” of human rights “preceded 2016.”\n\n“President Carter, I think he hopes that he won’t need to speak out but I would assume that if there were something he needed to say, he would say it,” Hochman said. “Actually, I’m sure he would.”\n\nBoth Bushes are more focused on their nonprofit work than engaging in politics, said Samuel Skinner, who served as the senior Bush’s chief of staff. He’s spoken to both since the inauguration, and neither has mentioned Trump.\n\n“They may have personal opinions, but they’re not going to express them,” Skinner said. “Both 41 and 43 are very measured people, so I think they’ve been both very cautious about what they say.”\n\nMcLarty, Clinton’s former chief of staff, predicted his former boss will continue to weigh in on the politics of the day. “I wouldn’t be surprised at all if he expresses serious differences of opinion on economic, domestic and international policies,” he said.\n\nGetting seriously involved in politics is a no-win scenario for former presidents, Skinner said, adding that the legacies of the former presidents are being shaped by historians, not today’s events in Washington.\n\n“I think any time and energy they have could be better spent working in nonprofits and their libraries,” he said.", "images": ["https://www.politico.com/dims4/default/6042ef2/2147483647/strip/true/crop/1160x629+0+0/resize/630x342!/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fa9%2F3f%2Fa736e04646d0a343e231126e5532%2F170508-george-w-bush-ap-17059623005115.jpg", "https://static.politico.com/a9/3f/a736e04646d0a343e231126e5532/170508-george-w-bush-ap-17059623005115.jpg", "https://www.politico.com/dims4/default/f59d5c1/2147483647/strip/true/crop/786x629+187+0/resize/250x200!/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F15%2F9d%2Fef39843a4e1fb3f01281468f7a8d%2Flede-170506-yates-clapper-0138-js-1160.jpg", "https://www.politico.com/dims4/default/6dd19ee/2147483647/strip/true/crop/1160x629+0+0/resize/630x342!/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F2b%2F4a%2F8bd2adae485a88b88da378b73268%2F270508-barack-obama-ap-17123683642262.jpg", "https://www.politico.com/dims4/default/25e436c/2147483647/strip/true/crop/786x629+187+0/resize/250x200!/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2F1d%2F4e%2F47d3c824488ead66a244fd9b1f86%2F170508-aclu-richmond-ap-1160.jpg"], "top_img": "https://static.politico.com/a9/3f/a736e04646d0a343e231126e5532/170508-george-w-bush-ap-17059623005115.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.politico.com/story/2017/05/09/trump-presidents-carter-bush-clinton-238125", "title": "Former presidents walk fine line in Trump’s America", "meta_data": {"description": "Trump's predecessors are trying to both defend their legacies and respect the unwritten rule of not undermining the current commander in chief.", "brightspot.contentId": "0000015b-e9f7-d192-a75f-fdffb5200001", "brightspot.cached": "false", "viewport": "width=device-width, initial-scale=1", "og": {"title": "Former presidents walk fine line in Trump’s America", "description": "Trump's predecessors are trying to both defend their legacies and respect the unwritten rule of not undermining the current commander in chief.", "type": "article", "url": "https://www.politico.com/story/2017/05/09/trump-presidents-carter-bush-clinton-238125", "image": "https://static.politico.com/a9/3f/a736e04646d0a343e231126e5532/170508-george-w-bush-ap-17059623005115.jpg", "fb_appid": 114037015331397, "site_name": "POLITICO"}, "theme-color": "#ffffff", "fb": {"pages": 62317591679}, "twitter": {"title": "Former presidents walk fine line in Trump’s America", "description": "Trump's predecessors are trying to both defend their legacies and respect the unwritten rule of not undermining the current commander in chief.", "image": "https://www.politico.com/dims4/default/6dd7197/2147483647/legacy_thumbnail/1200x650%3E/quality/90/?url=https%3A%2F%2Fstatic.politico.com%2Fa9%2F3f%2Fa736e04646d0a343e231126e5532%2F170508-george-w-bush-ap-17059623005115.jpg", "card": "summary_large_image", "site": "@politico", "creator": "@politico"}, "msapplication-TileColor": "#da532c", "msapplication-TileImage": "/mstile-144x144.png", "host": "www.politico.com", "build": "1.0.0-SNAPSHOT"}, "movies": [], "publish_date": 1494284400.0, "source": "https://www.politico.com", "summary": ""}