{"url": "https://en.wikipedia.org/wiki/Amanda_Rollins", "text": "Fictional character on Law & Order: Special Victims Unit\n\nFictional character\n\nAmanda Rollins is a fictional character on the NBC police procedural drama Law & Order: Special Victims Unit, portrayed by Kelli Giddish. Rollins is a detective with the Manhattan Special Victims Unit at the 16th Precinct of the New York City Police Department.\n\nBackground [ edit ]\n\nRollins transfers from the Atlanta PD to Manhattan SVU in June 2011. Being from Atlanta, she is a fan of the Braves, whose schedule she keeps on her refrigerator door. She has a dog named Frannie that she dotes on.\n\nRollins grew up in Loganville,[1] and has a bachelor's degree in forensic science.[2] While working for the Atlanta PD, she was stationed at Precinct Zone 8.[3]\n\nRollins comes from a dysfunctional family. Her father Jim (James Morrison) is an alcoholic and a gambling addict who often beat her mother, Beth Anne (Virginia Madsen),[4] and her younger sister, Kim (Lindsay Pulsipher), is a cocaine addict with bipolar disorder whose frequent brushes with the law often cause trouble for Rollins. She has a strained relationship with her mother, who favors Kim and whom Rollins looks down on for not fighting back against the abuse she suffered.[4][5] This has sometimes affected her interactions with domestic abuse victims.\n\nCharacter within SVU [ edit ]\n\nThe character is at first portrayed as wet behind the ears and over-eager, and is frequently chastised by Captain Donald Cragen (Dann Florek) for getting ahead of herself.[6] Over time, however, she grows into the job.\n\nShe shares a good rapport with her partner, Detective Fin Tutuola (Ice-T). Shortly after transferring to the 16th Precinct, Rollins investigates a series of rapes that she believes are being committed by a suspect in one of her cases in Georgia. Rollins tries to prove to Detectives Olivia Benson (Mariska Hargitay) and Nick Amaro (Danny Pino) that the rapist originated in Atlanta and has come to New York for new prey. She nearly falls victim to him while trying to flush him out; the rapist has a preference for blonde, athletic women like her.[7]\n\nIn the season 14 episode \"Poisoned Motive\", Rollins is shot by a sniper in front of the precinct. Her shooting leads back to the daughter of Tutuola's former partner, who is seeking revenge on the NYPD after her father was injured on the job.[8]\n\nIn the season 14 episode \"Deadly Ambition\", Kim shows up at Rollins' door after leaving her abusive boyfriend, Jeff Parker (Theis Weckesser), who is also the father of her unborn child. One day, Rollins returns home to find Parker apparently raping Kim, and she shoots and kills him. Eventually, however, she discovers that Kim staged the rape to manipulate Rollins into killing Parker, all so she could collect on his life insurance policy. Kim makes withdrawals from the policy in both their names, making it look as if Rollins masterminded the plan to kill Parker, and disappears. Rollins is arrested and charged with murder, but is exonerated with help from the SVU squad.[9]\n\nIn the season 16 episode \"Forgiving Rollins\", it is revealed that while Rollins was working for the Atlanta PD, her sister got into trouble with the law, and Rollins was willing to sleep with her boss, Deputy Chief Charles Patton (Harry Hamlin), in order to get the charges dropped. When he started to get too rough with her, Rollins withdrew her consent, but Patton overpowered and raped her. She later helps another of Patton's victims, APD Detective Reese Taymor (Dreama Walker), get justice, resulting in Patton going into forced retirement and being put on the sex offender registry.[10]\n\nIn \"Spousal Privilege\", Rollins expresses the belief that domestic violence should be kept private unless the victim wishes to come forward, feeling that the police have no right to make choices on a woman's behalf. This leads to a conflict with Amaro, who witnessed his father regularly beat his mother, who refused to leave and report him. During an argument, Rollins drunkenly attempts to goad Amaro into hitting her, but he walks away. Much later in \"Great Expectations\", after having a child, she expresses disdain for a mother who did not protect her children from their father's abuse, and says the possibility that the mother is also being abused is no excuse.\n\nIt is implied in several episodes that Rollins is in a romantic, or at least sexual, relationship with Amaro. In one episode, a suspect asks if they are sleeping together; they do not answer his question and change the subject.[11] When Amaro beats up a suspect, Rollins blackmails the suspect's wife to get him to drop the charges.[12] In the episode \"Reasonable Doubt\", Amaro comes out of a shower in Rollins' apartment, and joins her on a sofa, clad only in a towel. It is confirmed in season 17 that Amaro and Rollins were romantically involved when Rollins discovers she is pregnant and says Amaro is not the father, meaning they did at least sleep together.\n\nThe father of Rollins' child is later revealed to be Lt. Declan Murphy (Donal Logue), her former commanding officer. Murphy is deep undercover in Eastern Europe when he learns of the pregnancy, but he returns to New York to give her a direct line to him if she ever needs him. While Rollins is in labor, she suffers a placental abruption, almost resulting in her death, but she survives and gives birth to a baby girl she names Jesse. Her partner, Dominick \"Sonny\" Carisi, (Peter Scanavino), who comes from a large family, frequently assists Rollins with the baby.[13]\n\nIn \"Heightened Emotions\", Rollins’ turbulent relationship with her sister is revisited, as Kim is granted parole after having apparently gotten sober and found religion. At this point, Kim begs to stay with Rollins rather than going to a shelter, and Rollins reluctantly agrees. However, near the end of the episode, Rollins finds Kim taking pills and accuses her sister of relapsing, only to learn that the drugs were actually lithium and asenapine, which Kim has been taking for bipolar disorder after being officially diagnosed during her trial. Kim then admits to Rollins that while she misses her former manic energy, this is the first time in her life that she has felt good about herself.\n\nIn \"Service\", it is revealed that she dislikes escorts, to the point of suggesting that an escort rape victim brought the assault on herself. The victim shows up at the station to complain that the investigation is hurting her business, and Rollins gives her $300 out of disgust; insulted, the victim throws the money in Rollins' face. Eventually, however, Rollins comes to see the victim as a human being and is instrumental in bringing her rapist to justice. While having dinner with the victim to apologize for her behavior, Rollins admits that her prejudice against escorts stems from a former boyfriend cheating on her with one.\n\nIn \"The Book of Esther\", she uses deadly force during a hostage situation with a religious cult. Afterward, she finds out that she fired the shot that killed one of the cult members, a young woman she had tried to save from her abusive father, the patriarch of the cult. She is wracked with guilt, but finds some comfort in going to church.\n\nIn \"Man Up\", she reveals to Benson that she is pregnant with her second child. Also, she meets up with Dr. Al Pollack (George Newbern), her ex-boyfriend, for a lunch date and prepares to tell him about her pregnancy, but bolts out when she sees him flirting with a waitress and becomes unsure of balancing her second pregnancy with raising Jesse and with her work at SVU. In \"Zero Tolerance\", she considers getting back together with Pollack and tells him she is pregnant. When she is stunned by his reaction offering to pay for her abortion, after bonding with a girl who is separated from her mother and would like another sibling, she later decides to keep the baby, telling Pollack she does not need anything from him. After Pollack apologizes for his insensitive comments, Rollins decides to give him another chance. He eventually asks her to move in with him at his apartment. She contemplates the situation, seeing as there is barely enough room for her and Jesse in her own apartment, yet is unsure of her own feelings for Pollack. After Carisi tells her to do what she feels is best for herself and her children, however, she agrees to move in with Pollack. She gives birth to a girl she names Billie in \"A Story of More Woe\"; Pollack proposes to her while she is in labor, but she rejects his proposal and breaks up with him, admitting that she does not love him.[14]\n\nIn \"Eternal Relief from Pain\", Rollins is granted temporary custody of Kim's son and allows both of them to stay at her apartment. She reluctantly extends the invitation to her father Jim so that he can visit his grandchildren, even though he is a drug addict and the terms of Kim's parole bar her from associating with known addicts. Jim overdoses on heroin and is rushed to a hospital, but leaves shortly after recovering. The experience unnerves Kim so badly that she voluntarily returns to prison in order to undergo drug treatment, leaving her son in her mother's custody.\n\nIn \"Solving for the Unknowns\", Rollins is promoted to Detective 2nd Grade.\n\nIn the season 23 premiere, “And the Empire Strikes Back”, Rollins and Carisi become a couple.\n\nGambling storyline [ edit ]\n\nThe season 13 episode \"Home Invasions\" reveals not only that Rollins struggles with a gambling addiction, but that she owes money to a suspect in one of SVU’s murder investigations. When her gambling interferes with her job, Cragen offers to get her in a rehabilitation program. During a meeting, she reveals that her father also had a gambling problem.\n\nIn the season 15 episode \"Rapist Anonymous\", Rollins is caught in the middle of a case when a woman from her program claims to have been raped by her sponsor. When the alleged rapist is killed, the woman is put on trial and Rollins testifies on her behalf, alienating her colleagues at SVU. When ADA Rafael Barba (Raúl Esparza) cross-examines her, he forces her to admit that she has been sleeping with her sponsor, Nate Davis (Thomas Sadoski), and reveals that Davis has had sexual relationships with several of his sponsees. This proves too much for her to handle and her gambling addiction relapses.[15] In the episode \"Gambler's Fallacy\", she is caught gambling in an illegal club and forced to work on the wrong side of the law by the criminals who run the club. One of the criminals is in fact an undercover police officer, Lt. Declan Murphy, who enlists Rollins to help him with a sting operation to arrest the club's owners. The sting is successful, and Murphy makes sure that Rollins keeps her detective's shield. Benson, however, says that she no longer trusts Rollins, and would transfer her if the precinct were not so short-staffed while Tutuola and Amaro were also upset at her for not telling them.[16] Fortunately, Rollins managed to gain back their trust once the truth about her rape comes out. [17]\n\nDevelopment [ edit ]\n\nNBC announced on June 27, 2011 that Giddish would join the cast of Law & Order: Special Victims Unit for its thirteenth season along with Cold Case's Danny Pino as Detective Nick Amaro, coinciding with Christopher Meloni's departure from the series.[18] Giddish told TV Guide during summer filming; \"Everybody on the set is really excited and energized. They've lost a family member with Chris Meloni leaving, but they've been very accepting of us. Amanda is thrilled to be here working with these people, and so am I.\"[19]\n\nIn an interview with TV Guide prior to Giddish's debut episode as Rollins, \"Scorched Earth\", Giddish says about her character, \"My character is in complete awe of Olivia, Amanda's really eager to get in there because she knows her stuff and really eager to learn. She has come from Atlanta and there was a ceiling there, so she's come up to New York.\" Giddish felt great about joining the series in its 13th season, \"I couldn't feel better about it. ... There's no intimidation, what attracted me was the prospect of re-invigorating a franchise that's been so well-known and so well-liked, and then to be the shaker and mover.\" Giddish is confident that viewers will warm up to Rollins and Amaro with time. \"They're going to love us because it's not being forced in their faces,\" she says. \"The more you know about us and the more you see us in your living room, the more you're hopefully going to love us.\"[20]\n\nAt the end of season 13 of Law & Order: SVU, she and co-star Danny Pino weighed-in on their first season and both Giddish and Pino say they received not only a \"very warm welcome\" from SVU's cast and crew, but saw their respective characters explored more than they could hope for in their first season. \"They’ve given me a lot to work with — and I hope they give me more next season,\" says Giddish. \"We're still playing 'musical chairs' in terms of partners, and that’s a great way to go about exploring the different characters.\" Pino added, \"That’s what you hope for when you’re putting it down on paper and discussing what you want to play. I had [pre-season] conversations with [showrunner] Warren Leight, and you hope that starts materializing — and it did. And that bodes well going into Season 14.\"[21]\n\nRather than have both newcomers paired together, Rollins is primarily partnered with Detective Odafin \"Fin\" Tutuola, a factor which contributed to the character's positive reception. Ice-T, who has portrayed Tutuola since the show's second season, praised both Giddish and Pino in the wake of Chris Meloni's departure, \"We had to regroup, like a football team,\" said Ice-T. \"The quarterback changed, but we still had to move the ball down the field. And we did well... Danny came in, strong. Kelli came in, strong. And we shut down the doubters.\"[21]\n\nAppearances and crossovers [ edit ]", "images": ["https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Edit-clear.svg/40px-Edit-clear.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/5/5e/Kelli_Giddish_as_Amanda_Rollins.png", "https://upload.wikimedia.org/wikipedia/en/thumb/5/5e/Kelli_Giddish_as_Amanda_Rollins.png/220px-Kelli_Giddish_as_Amanda_Rollins.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/5/5e/Kelli_Giddish_as_Amanda_Rollins.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Amanda_Rollins", "title": "Amanda Rollins", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/5/5e/Kelli_Giddish_as_Amanda_Rollins.png", "width": 640, "height": 888}, "title": "Amanda Rollins - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}