{"url": "https://www.refinery29.com/en-us/2017/01/135337/revenge-body-image-issues-khloe-kardashian", "text": "Khloe sets up both Will and Stephanie with personal trainers. That’s great! Working with a trainer can actually be a life-changing experience, especially if you’re someone for whom working out is scary or unpleasant. A good trainer can teach you how to actually enjoy exercise and do it in a sustainable way. And rational exercise can certainly have a positive impact on your life. But, just to be clear, physical fitness is not happiness and personal trainers are not therapists.I know it may be confusing given that every weight-loss reality show casts the trainers as demigods or father figures, capable of healing all your psychic wounds by shouting, “GIVE ME TEN MORE!” But yeah, your trainer is not your social worker.Will gets paired with celebrity trainer Gunnar Peterson. Will wanders into his first workout session moaning about Kyle and how he drove him away with his heinous chub. (His goal, by the way, is to go from being a “bear” to a “muscle cub,” both of which are terms used to describe body types in the gay male community. As a not-male, not-gay person, I’m not going to get preachy over these terms and their use within the context of this show — but I sure hope someone does.) Losing weight, he is sure, will help get Kyle back — or else get revenge on him for leaving? It’s unclear. Will lays his sob story at Peterson’s feet, and Peterson at least has the gumption to say, “I don’t care.” But that doesn’t stop Will from continuing to overshare about his breakup and all his totally valid hurt feelings. Core strength is rad, but Will clearly needs someone to talk this out with, and — say it with me — your trainer is not your therapist.Nor are they your dietitian, by the way (unless they are an actual registered dietitian, of course, or a PhD in nutrition science — which most trainers aren’t). Stephanie gets paired with Luke Milton, who seems like a super friendly guy and may even be a good trainer. Sure, I couldn’t find his credentials anywhere, but he is quite ripped, not to mention Australian. So. That’s something. I really wanted to like him because he is literally the only person on this show — slash, in Stephanie’s life — who’s being nice to her. But then he prescribes the following nutrition program to her: “If it’s had a life, it’s good for ya.” By this, he means plants, meat, and fish, which is fine. Really, I wish he’d just left food out of it because he’s not a nutrition professional. But, at the very least, I wish he’d been a little more clear on this point rather than relying on his very poetic generalization. It sort of sounds like a cannibal diet.", "images": ["https://www.refinery29.com/assets/a70678be6c693f8a9915bec2fa49ee49.svg", "https://www.refinery29.com/assets/c5a8ae3dd50e6ebe17044593c2c7ee0c.svg", "https://s3.r29static.com/bin/entry/fc2/1,0,3810,2000/x,80/1724194/image.jpg", "https://www.refinery29.com/assets/d27ad8510dcf0eef13f6419f4f9a76e6.svg"], "top_img": "https://s3.r29static.com/bin/entry/fc2/1,0,3810,2000/x,80/1724194/image.jpg", "keywords": [], "authors": ["Nia Shumake", "Jinnie Lee", "Charlotte Lewis", "Mercedes Viera", "Kourtney Pope", "Virgie Tovar", "Brea Baker", "Erika W. Smith", "Khloe Kardashian Revenge Body Image Extreme Weight Loss"], "canonical_link": "https://www.refinery29.com/en-us/2017/01/135337/revenge-body-image-issues-khloe-kardashian", "title": "The Reasons NOT To Watch Revenge Body With Khloe Kardashian", "meta_data": {"title": "Khloe Kardashian Revenge Body Image Extreme Weight Loss", "description": "6 reasons not to tune in to Khloe Kardashian's new show.", "og": {"url": "https://www.refinery29.com/en-us/2017/01/135337/revenge-body-image-issues-khloe-kardashian", "title": "The Reasons NOT To Watch \"Revenge Body With Khloe Kardashian\"", "description": "6 reasons not to tune in to Khloe Kardashian's new show.", "image": {"identifier": "https://s3.r29static.com/bin/entry/fc2/1,0,3810,2000/x,80/1724194/image.jpg", "secure_url": "https://s3.r29static.com/bin/entry/fc2/1,0,3810,2000/x,80/1724194/image.jpg", "width": 3810, "height": 2000}, "type": "article"}, "twitter": {"title": "The Reasons NOT To Watch \"Revenge Body With Khloe Kardashian\"", "card": "summary_large_image", "site": "@refinery29", "description": "6 reasons not to tune in to Khloe Kardashian's new show.", "image": "https://s3.r29static.com/bin/entry/fc2/1,0,3810,2000/x,80/1724194/image.jpg"}, "pinterest": {"image": "https://s2.r29static.com/bin/entry/4f4/112,0,1776,2400/x,80/1724193/image.jpg"}, "fb": {"app_id": 155023867867753, "pages": "86973707921,587074007996399,269626263209765,509115739117952,1562713254009921,583745561686633,656112191237463,284423314989162,974273182666651,192477361634120"}, "article": {"publisher": "refinery29"}, "viewport": "width=device-width, initial-scale=1", "theme-color": "#fd5b4e", "news_keywords": "khloe kardashian, revenge body, khloe kardashian revenge body, revenge body show, khloe kardashian show, body image, weight loss, weight loss show,", "p": {"domain_verify": "b10faeb45f92f5ebf0073a215d615ea9"}, "entry_template": "entry.slideshow", "author": "Kelsey Miller"}, "movies": [], "publish_date": 1484265600.0, "source": "https://www.refinery29.com", "summary": ""}