{"url": "https://ew.com/movies/2018/01/12/daniel-radcliffe-johnny-depp-fantastic-beasts/", "text": "'It's a very hard thing for me...': The Harry Potter star on Depp's involvement in 'Fantastic Beasts: The Crimes of Grindelwald'\n\nFantastic Beasts: The Crimes of Grindelwald Show More About Fantastic Beasts: The Crimes of Grindelwald type Movie\n\nHarry Potter star Daniel Radcliffe is weighing in on the controversy surrounding the casting of Johnny Depp in the spin-off film Fantastic Beasts: The Crimes of Grindelwald.\n\nEW asked the actor about the uproar over Depp playing the infamous wizard Gillert Grindelwald in the upcoming film after the abuse allegations made by his ex-wife Amber Heard. The film’s writer J.K. Rowling, director David Yates, and studio Warner Bros. have all issued statements defending the casting. Some fans have been supportive of Depp’s involvement, while others are rather outraged.\n\n“It’s a very hard thing for me,” Radcliffe said, noting he wants to be supportive of the film’s producers who “gave me a great start in life and an amazing job.”\n\nBut, he added, “I can see why people are frustrated with the response that they were given from that … I’m not saying anything that anybody hasn’t already said — and this is a weird analogy to draw — [but] in the NFL, there are lots of players arrested for smoking weed and there is other people’s behavior that goes way beyond that and it’s tolerated because they’re very famous players. I suppose the thing I was struck by was, we did have a guy who was reprimanded for weed on the [original Potter] film, essentially, so obviously what Johnny has been accused of is much greater than that.”\n\nRadcliffe is referring to actor Jamie Waylett, who played Hogwarts bully Vincent Crabbe. After appearing in six Harry Potter films, Waylett was dropped from the two-part adaptation of Deathly Hallows after being arrested for growing 10 marijuana plants in 2009. Waylett being dropped for his pot offense is sometimes referenced by fans who protest Depp’s casting. The actor was a virtual unknown when he was axed from the Potter franchise and — unlike Depp — was arrested and pleaded guilty to growing pot plants in his mother’s home. Waylett was later arrested for packing a homemade bomb during the 2011 London riots.\n\nRadcliffe next stars in the upcoming TBS anthology series Miracle Workers, an office comedy set in heaven.\n\nDepp’s titular casting in The Crimes of Grindelwald has been a divisive flashpoint issue for the sequel due to his ex-wife Amber Heard’s claim he emotionally and physically abused her during their whirlwind marriage. The couple released a joint statement after their divorce was finalized in 2016. “Our relationship was intensely passionate and at times volatile, but always bound by love. Neither party has made false accusations for financial gain. There was never any intent of physical or emotional harm. Amber wishes the best for Johnny in the future. Amber will be donating financial proceeds from the divorce to a charity,” they said.\n\nRowling weighed in with a defense of keeping Depp on the film, writing, “Based on our understanding of the circumstances, the filmmakers and I are not only comfortable sticking with our original casting, but genuinely happy to have Johnny playing a major character in the movies.”\n\nStudio Warner Bros. also released a statement, noting, “We are of course aware of reports that surfaced around the end of Johnny Depp’s marriage, and take seriously the complexity of the issues involved. This matter has been jointly addressed by both parties, in a statement in which they said ‘there was never any intent of physical or emotional harm.’ Based on the circumstances and the information available to us, we, along with the filmmakers, continue to support the decision to proceed with Johnny Depp in the role of Grindelwald in this and future films.”\n\nThe Crimes of Grindelwald will be released Nov. 16.\n\nRadcliffe spoke to EW while promoting Miracle Workers at the Television Critics Association Winter Press Tour in Pasadena. He noted that he signed on to the project because he wanted to get rich — Simon Rich, the Man Seeking Woman creator. “It’s Simon’s writing and the fact that it’s going to be an anthology series,” explains Radcliffe. “Essentially, I’m getting the chance to ride on his coattails for three years. He’s one of the best writers around. As an actor, to have an opportunity to have a writer of that caliber say, ‘We’re going to work on a new story every year and find a new character to play every year for the next few years,’ that’s just a bit of a dream, really.”", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F07%2F14%2FJosh-Hartnett-The-Faculty-071422.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Few.com%2Fimg%2Fmisc%2F300x250_magazines_and_more.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F08%2F05%2FBrett-Goldstein-Hannah-Waddingham-Three-Rounds-080522-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F01%2Fpotter-grindelwald-2000.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F08%2F16%2FBetter-Call-Saul_081622_4.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F01%2Fpotter-grindelwald-2000.jpg", "keywords": [], "authors": ["James Hibberd", "Dan Snierson", "January", "At Pm Est"], "canonical_link": "https://ew.com/movies/2018/01/12/daniel-radcliffe-johnny-depp-fantastic-beasts/", "title": "Daniel Radcliffe breaks silence on Johnny Depp casting controversy", "meta_data": {"viewport": "width=device-width,initial-scale=1", "theme-color": "#111", "keywords": "entertainment, entertainment news, ew, entertainment weekly", "news_keywords": "entertainment, entertainment news, ew, entertainment weekly", "description": "'It's a very hard thing for me...': The Harry Potter star interviewed on Depp's involvement in 'Fantastic Beasts: The Crimes of Grindelwald'", "robots": "max-image-preview:large", "og": {"title": "Exclusive: Daniel Radcliffe breaks silence on Johnny Depp casting controversy", "type": "article", "site_name": "EW.com", "url": "https://ew.com/movies/2018/01/12/daniel-radcliffe-johnny-depp-fantastic-beasts/", "description": "'It's a very hard thing for me...': The Harry Potter star interviewed on Depp's involvement in 'Fantastic Beasts: The Crimes of Grindelwald'", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F01%2Fpotter-grindelwald-2000.jpg", "width": 2000, "height": 1000}}, "pinterest": {"url": "https://ew.com/movies/2018/01/12/daniel-radcliffe-johnny-depp-fantastic-beasts/", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F01%2Fpotter-grindelwald-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/movies/2018/01/12/daniel-radcliffe-johnny-depp-fantastic-beasts/", "title": "Exclusive: Daniel Radcliffe breaks silence on Johnny Depp casting controversy", "description": "'It's a very hard thing for me...': The Harry Potter star interviewed on Depp's involvement in 'Fantastic Beasts: The Crimes of Grindelwald'", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2018%2F01%2Fpotter-grindelwald-2000.jpg"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}, "url": "https://ew.com/movies/2018/01/12/daniel-radcliffe-johnny-depp-fantastic-beasts/"}, "movies": [], "publish_date": 1515715200.0, "source": "https://ew.com", "summary": ""}