{"url": "https://web.archive.org/web/20220831232327/https://greys.fandom.com/wiki/Callie_Torres", "text": "Calliope Iphegenia Torres Biographical Information Status Alive Alias Callie O'Malley\n\nCalliope Plantain\n\nOrtho Goddess\n\nDr. T\n\nCal\n\nHot Ortho Chick\n\nOrtho God Title(s) M.D. Familial Information Marital Arizona Robbins (ex-wife)\n\nGeorge O'Malley † (ex-husband) Children Sofia Robbin Sloan Torres\n\nMiscarriage (with Arizona) Siblings Aria Torres (half-sister) Parents Carlos Torres\n\nLucia Torres Others Berto (uncle)\n\nAunts\n\nCousin\n\nCousin, once removed Professional Information Profession Current\n\nAttending Orthopedic Surgeon\n\nFormer\n\nHead of Orthopedic Surgery\n\nBoard Director Workplace Former\n\nSeattle Grace Hospital\n\nMercy West Medical Center\n\nSeattle Grace Mercy West Hospital\n\nGrey Sloan Memorial Hospital Appearances First What Have I Done to Deserve This? Last Family Affair Count 239 Seasons GA: 2, 3, 4, 5, 6, 7, 8, 9, 10, 11 , and 12 Portrayed by Sara Ramírez\n\n“ The brain is the human body's most mysterious organ. It learns. It changes. It adapts. It tells us what we see, what we hear. It lets us feel love. I think it holds our soul. And no matter how much research we do, no one can really say how all that delicate grey matter inside our skull works. And, when it's hurt, when the human brain is traumatized, well, that's when it gets even more mysterious. ” — Callie Torres\n\nCallie Torres is the former head of orthopedic surgery and board member at Grey Sloan Memorial Hospital. She was married to George O'Malley, but divorced after he cheated on her. She currently resides in New York with ex-wife Arizona Robbins, with whom she has a daughter, Sofia Robbin Sloan Torres.\n\nHistory [ ]\n\nEarly Life [ ]\n\nCallie grew up in southern Florida. She was one of two daughters in a wealthy family, a fact she doesn't like to share with significant others. She has stated that \"four years of high school, four years of college, four years of medical school\" makes doctors socially inept at times. She has described herself as \"a total freak,\" and \"I'm that girl in the back of the class who eats her hair.\" She had also admitted to Arizona Robbins that she was in the Peace Corps in Botswana, and that is what had convinced her to go to medical school.\n\nCallie attended her high school prom by herself because she didn't want to wait for \"a stupid boy\" to ask her out. She picked out the sexiest dress, which was red. She made a fashionably late entrance and began to dance. She especially liked the part of prom where everybody else's dates tried to hit on her.[1]\n\nRelationship with George [ ]\n\nCallie met George when she reduced his dislocated shoulder. While having a short conversation, George told her he was single. Later that night, Callie ran into George outside the hospital and wrote her phone number on his hand, clearly showing interest in him.[2]\n\nSome time later, George said that he called a few times but hung up every time. During their short conversation, George admitted that she made him a little nervous, which she thought was good. She then invited him to assist her on a cool ortho case. Before the surgery on the patient, she told him the ball was in his court as that was the last invitation she was giving him.[3]\n\nHowever, George didn't call her, so Callie started to ignore him. He realized the same that he should've called her, so while she was working in the ER and he was standing in the same room, he did call her. He said he should've called sooner and asked her out.[4]\n\nShortly after, Callie got to know George's friends. Callie came over to Burke's apartment (as George temporarily lived there) and she, George, Burke and Cristina played a game in teams. In the hospital, Izzie and Meredith assisted her on an ortho case. Izzie asked her a lot of questions, and Callie confessed she saw more in George than they did. George also discovered Callie lived in the hospital basement. There, she cut his hair, as he tried to do it himself earlier but totally messed it up, and they shared their first kiss.[5]\n\nThe two also had sex for the first time. They decided to spend the next night at Meredith's. Izzie did not welcome Callie and was upset that George had brought her to their house.[6]\n\nAfter having spent the night at Meredith's, Callie went to the bathroom naked while Izzie and Meredith were there. She left without having washed her hands in the bathroom, leading to Izzie and Meredith making mean comments about her. However, unbeknownst to them and George, she did wash her hands downstairs in the kitchen. George later asked her if she did wash her hands, which angered Callie because she thought he chose Izzie's side. In the basement, Callie told George she washed her hands in the kitchen and not in the bathroom because Izzie and Meredith were staring at her in the bathroom, which made her feel uncomfortable. She said George had to stand up for her, and George apologized.[7]\n\nLater, in Joe's bar, it was clear Cristina, Meredith, and especially Izzie still didn't like Callie. When George came over to them, they greeted him exuberantly, while they only greeted her shortly. The following day, Meredith was on Callie's service and seemed to like her a little more. She asked Callie if she could ask something about bone cancer in her dog, but Callie turned her down. George later told her that he got why she asked her, as Doc really meant a lot to Meredith. Callie was surprised George defended her as Meredith really hurt him, but George said it was normal for him to forgive her as they were family, and he suggested Callie did the same. So she paged Meredith to a room to show her scans of a human with bone cancer, and explained some more to her about the disease. Meredith honestly thanked Callie for that. Later that day, Callie told George that she loved him, when suddenly Izzie came in, saying she really needed George's help. George left with Izzie, saying he'd call Callie.[8]\n\nCallie later asked George what happened, but he didn't want to tell her. Therefore, she said no when he asked her to go to the prom with him. Later that day, when he saw her in a dress, he was surprised because he thought she wasn't going to the prom, but she said that she didn't want to go with him, because he avoided her after she said that she loved him. Callie wanted him to say that he loved her to prove that he wasn't avoiding her, but George said if he told her that, it was only because she wanted him to, and not because he really meant it. They kissed to make up.\n\nA nurse asked Callie to go find Meredith because there was something going on with Izzie. She walked in on Meredith and Derek, who just had sex. Callie was in the room where the other interns discovered that Izzie was lying in bed with a deceased Denny.[9]\n\nThe day after the prom, Callie came over to Meredith's house with food, because she was worrying about Izzie. When Meredith let her in, Callie assured her that she wouldn't say anything about Meredith having sex with Derek, saying she wasn't that kind of person. Because of that, Meredith opened up to Callie about things that she doesn't tell everyone. While Callie was cooking, Meredith told her that she had no idea what to say to Izzie, who was lying on the bathroom floor. When Meredith left the kitchen because Finn Dandridge, Meredith's boyfriend came to visit, Callie told him that doctors are just socially retarded. She said that she was in love with a guy and cooking in his kitchen, hoping for him to come home and notice her. They ate together, but Callie left when Meredith came back, so that Finn and Meredith could have a conversation. When George finally came home that night, Callie hugged him and told him that she really, really loved him.[10]\n\nWhen Addison hung Meredith's panties, which she found in Derek's pocket, up on the bulletin board, Callie came to the rescue and claimed them, apologizing for leaving her underwear lying around again. George was later asking how it was possible that her panties were up on the bulletin board, and he questioned if it really were hers, as he had never seen them before. When Meredith came to tell her that she would tell the truth to George about the panties, Callie told her not to because she liked the fact that he was jealous. In the ER, Alex asked Callie how her relationship with George could've happened. Before having given a proper answer, Bailey interfered, saying that she outranked him, as she was a resident. Later that day, while she was dancing in her underwear, Richard discovered that she had been living in the hospital basement. He stayed there to talk with her over a cup of coffee, but he had to throw her out, as living in the hospital was against the rules. While they were talking, George came in, saying that he was jealous and didn't want other guys to touch her panties. He then noticed that the Chief was there, and left awkwardly. Callie then put her pants on, packed all her stuff, and said to George, who had been lying on a bench in front of the hospital ever since he left the hospital, that they weren't her panties. She also told him that the jealousy was insanely hot. George then noticed her suitcase and asked her to move in with him at Meredith's.[11]\n\nAfter more than a week, George wanted Meredith to kick Callie out, because she was using all of his stuff. When she asked for a key, George said it wasn't necessary because he liked leaving the hospital together. During an argument over a patient's surgery, George said that everything went to fast and that he wasn't ready for her to move in. She then moved out and checked into a luxurious hotel.[12]\n\nCallie was mad at him for saying to Meredith and Izzie how he felt, and not to her. He said that he missed her, which charmed Callie. When they crossed each other in the hospital, she invited him to come over to her hotel room and have dinner there. However, in the evening, George told her that he had to go home because there was something going on with Izzie. She then questioned his feelings for her, and it turned that he didn't even know what he was feeling himself. Callie then told him not to even bother trying to figure it out, and broke up with him. She went to Joe's bar and met Mark Sloan. Mark asked what she'd heard about him, and she replied that most things involved the words \"dirty\" and \"bad\". Callie then left the bar to go to her hotel, and asked him to come with her.[13]\n\nThe morning after, George tried to call Callie. She was still lying in bed with Mark and didn't answer her phone. That day at work, Callie avoided George. She confessed to Meredith that she slept with another guy, and Meredith told her that she broke up with Finn, asking whether she should tell Derek or not. That night, George came over to her hotel room with DVDs and fried chicken. She didn't let him in, saying that she broke up with him, even though he hadn't noticed that she did.[14]\n\nAfter that, Callie started to ignore him. He did continue to talk to her though, even though she initially didn't answer. While metaphorically saying that he was ready to commit to her, Callie walked away because he metaphorically called her a pig. However, when Mark proposed to cheer her up again, she declined, and later went to apologize to George for being rude to him. She said not to chase after her anymore, unless he was ready to catch her.[15]\n\nAt the hospital, Addison and Callie were sitting in a hospital lounge together, when Mark came in, creating an awkward silence. Addison and Callie worked together on a case that day, starting off their friendship. Their patient was a pregnant woman whose baby died in the womb, which really saddened Addison. Callie consoled her, and they became even closer when they both confessed having slept with Mark and regretting it. Addison asked to go and have a drink together, but Callie got paged. Later that evening, Callie had to tell George that his father was in the hospital.[16]\n\nWhile George's brothers were visiting George's father in the hospital, Callie was in there telling them about how she first met George. She stayed in the room to talk with George's brothers, but George asked her to have a little chat. He told her that she shouldn't talk to his family as she broke up with him. While watching a surgery, Bailey, Addison and Callie had a conversation about motherhood. Callie said she wanted a dozen of them and she'd use a nanny to raise them, as she wasn't willing to give up the scalpel. During the conversation, Callie realized she wasn't ready to move on. She went to George's father's room, where George was trying to explain Harold's medical condition to his brothers. They didn't understand the doctor talk, and Callie came in and explained it to them in car terms.[17]\n\nCallie kept asking George how his father was doing. George didn't understand why she'd care about his father, as they broke up. Callie said that she still cared about him, but George walked away, sarcastically saying that that was the reason why she slept with Mark. Callie then thought that Meredith told George about this and went looking for her to kick her ass. However, Meredith said that Callie only told her that she slept with someone, and that she didn't know it was Sloan until George told him. Callie said that George thought that she cheated on him, but that he didn't know that she slept with Sloan while they were broken up. She then left the intern locker room to go look for George to tell him that. She found him in the staircase. She told him that she slept with Mark while they were broken up and that she'd never betray him, but George said that he didn't have time for this.[18]\n\nWhile Harold O'Malley was telling George to hide his magazines, Callie came to Harold's room to check the healing of his collarbone. George quickly left when she entered the room. Callie stayed in his room and they had a nice conversation. George later entered the room again, and Callie told him she'd go. Harold told his son that he didn't recognize him, as he was constantly picking fights and asked him why he was so mad at Dr. Torres. They both wanted to go, but George's father told them to stay. Callie then listened to Harold's speech on how angry George had become. At the end of the day, Callie once again asked George how his father was doing, and George replied friendly, seeming to have let go of his anger towards Callie.[19]\n\nWhile his father was in surgery, Callie calmed down George. She wanted him to confess that he was scared, and tried to stare him down like Bailey taught her, and which previously worked on Dr. Shepherd. George said that he was only scared of her because of the staring. After George's dad came out of surgery, Callie went to his room to ask how he was doing. In there, George was staring at his dad's bag with pee. His family members thought he was acting even weirder than usual, but George said to Callie that there was 130 cc of pee in 4 hours, which indicated that his kidney function was good, and they both started cheering and dancing together. While dancing, George kissed her and thanked her.[20]\n\nA day later during lunch time, Callie told Addison that George kissed her. Addison wasn't paying attention, and when Callie made a comment on that, Addison told her that she aborted Mark's baby 8 months ago. She said she told Mark, who marked the due date on the calendar, and the due date was that day. Addison confessed to her that she felt like she ended up alone. While performing a major surgery, Callie noticed that both George and Meredith left after having been paged, and she realized something was wrong with George's dad. She left the OR. She went to a conference room where Bailey was explaining to the O'Malleys that she had to do a complicated procedure on Harold. Callie was looking through the window, but George nodded to make her come in. Bailey told them that they needed to prepare themselves in case the procedure failed. Later that day, Callie looked at Mark, who then realized that Addison told her about the abortion. He asked her if he'd be a terrible father. After some questions about family, Callie said that to some men, family is the most important thing in their life. Mark then asked her if she knew a guy like that, and she said she did, clearly talking about George. At the end of the day, George's father died.[21]\n\nAfter the death of his father, Callie had sex with George constantly, which was getting a little too much for her. When Izzie knocked on his door with muffins, Callie opened the door and left the room. \"This is not grieving, this is my legs being bent in ways my legs do not bend,\" she said. She put Izzie on \"Georgewatch\" 2007 and left Meredith's house. At the hospital, Cristina worked together with Callie. When Callie told her about George's appetite, Cristina said she shouldn't talk to her about it as they weren't friends. Callie said she thought Cristina would be at least a bit concerned. When George walked into her with Izzie, Callie urged Izzie to do something and quickly left. While scrubbing in for a surgery on their patient, Cristina called Callie's work on their patient impressive. They then talked about how they both hadn't talked for a long time with their partners. At the end of the day, George came to Callie's hotel room to have sex again, but Callie told him she couldn't have sex anymore. George then told her how he had been feeling since his father's death. He then told her that watching her made him feel better, so that they didn't have to have sex as watching her from across the room was fine too. He then kneeled in front of her and proposed.[22]\n\nAfter Callie accepted the proposal, the two got married in Vegas. They went to the clinic, where Richard, Mark, Bailey, Cristina, Alex and Izzie were waiting on the first patients to arrive, to tell them about it. \"We got married in Vegas!\" George yelled. Everyone was surprised, except for Alex. He started laughing and called her Callie O'Malley. A bit later, Izzie asked George if he was really happy, but Callie heard the question and assured her that they were. George told her to show Izzie the ring. When she did, Izzie said that tiny diamonds are great as no one would ever try to steal it. Everyone at the clinic heard this, but Bailey then put everyone to work, and she congratulated the newly weds. The same day, Callie noticed that Addison seemed to be interested in Alex. After Callie asking this, Addison said she didn't as he was an intern. Callie then told Addison that she married an intern. At first, Addison asked her why they got married so fast, but then just congratulated and hugged her. Addison then told her her ring was beautiful, which made Callie happy. Later that day, George asked her what her middle name was. Callie didn't tell him as she thought he let his judgy friends get to him. When George fell ill due to a patient with toxic blood, he admitted that he thought he fell ill because of the anxiety he got from their marriage. This deeply hurt Callie, as he basically told her their marriage was as poisonous as the toxic patient. She later went to check on him and told him her middle name was Iphigenia, saying she couldn't wait to hear what his judgy friends had to say about that. At the end of the day, Callie came to intern's locker room to go home with George together. Izzie then asked her what her plans were. \"You're not moving in, are you?\" she said. Callie wanted to leave, but George made her stay and told to Izzie, Cristina and Meredith that they were his friends and that if they wanted to drive her off, they'd drive him off with her. \"Calliope Iphigenia Torres is my wife,\" he said. Izzie then smiled and opened her mouth, but George told her to not do it.[23]\n\nAt the hospital, Callie told Bailey that it was weird being married to someone she was the boss of. She then said that at work, she was giving the orders at work, but in the bedroom, he was. Before she could properly finish that sentence, Bailey told Callie not to tell her about her sex life. At the clinic, Callie overheard Bailey and Sydney Heron talking about the Chief Resident position. Callie also helped out while Bailey was teaching her interns the process of triage. While doing so, George took a picture of her. She then took him apart to tell him not to undermine her authority, especially not in front of the interns. At the clinic, Callie wanted to help out Sydney, who was told by the Chief to bring every minor patient from the ER to the clinic to treat them there. However, Sydney didn't want her to take over. Callie then told her she'd go to the OR to scrub in on a trauma surgery while Sydney was stuck in the clinic with minor injuries. She went to the ER, where she stood outside with Addison, the Chief and Yang, waiting for the first patient to arrive. She later refused to help George when he asked her to, as she had to go scrub in on a surgery.[24]\n\nDuring her surgery on a child, George came in to ask her if her patient was the kid he was looking for. When she took a look at the photo he showed, she recognized him as her patient, saying she'd recognize that goofy ears anywhere. Before he left the OR, he said he couldn't kiss her because she had scrubbed in, but he was about to tell what he'd do that night to her. Everyone in the OR started chuckling, so Callie told him to shut up as she was working.[25]\n\nWhile Bailey was working on Meredith, she put Callie in charge of her interns. George and Izzie were waiting in the hallway until they got news about Meredith, but Callie told them to come with her to the clinic as they could help out there. Izzie initially didn't come, saying she needed to stay. Callie told her to come once again, which she reluctantly did. At the clinic, Izzie was getting blood ready for Meredith. Callie said Meredith was strong, and Izzie reacted harshly on whatever Callie said. Callie then asked if she was doing something specific to piss her off or if it was just stress related. Izzie said that it was because Callie was acting like she knew Meredith, though according to her, only she, Cristina and George really knew Meredith. Callie said she did know Meredith as she was George's wife. Izzie said that that didn't mean anything, that it was just a piece of paper. Callie then told her she needed to accept her, as George choose to have her around. She said that if she didn't accept her and let George choose between them, Izzie would lose another friend.[26]\n\nWhile having breakfast together in the hotel room, George was whining about how Izzie was so compassionate with her patients and not with her friends, but Callie suggested not to talk about it. At the hospital, George came to Callie to ask her about the room service bill. She said she sometimes payed more for it, and George suggested to split the room service bill like they split the rest, but she told him not to worry about it. He asked how much she payed for the food, and she said 800 bucks. She then revealed to him that her parents have a lot of money and that they gave her 25 hundred bucks a week. Callie explained that she didn't tell him about it because the money had affected every relationship she'd had. George then walked away madly because he felt like he payed her 200 dollars a week for nothing. During a surgery, Izzie made reference to Callie being rich. That night, Callie was mad at George for telling Izzie. He said he only told Meredith and that he was disappointed that she didn't even give him the benefit of the doubt to believe him. She once again blamed him for choosing his friends over her. He then said he hadn't talked to Izzie, whom he called his best friend, in weeks while she had been lying about her background and her family. During the argument, Callie said that Izzie dissed their marriage every chance she got because she had feelings for him and wanted him. This surprised him. \"She's a supermodel, and I'm George,\" he said. This hurt Callie. \"So what does that make me?\" she asked. She then told him to get out of the hotel room.[27]\n\nThe next day at work, Callie urged George to pretend like they were a perfect couple because her dad was in town. Izzie then came in, but she left. Seeing her reaction, Callie realized George had told her about their fight. Before she left too, she told George to get in the shower as he smelled. Callie requested another intern besides George, as he still smelled even after showering twice. Bailey picked Izzie, who tried to get away to the clinic with Cristina as she felt awkward because she slept with George the previous night. During lunch with Callie's father at Joe's, Callie assured her father that George wasn't anything like the other guys she had dated. Callie's father noted that George didn't have any money and that thereby the house and the car he'd get his daughter would be on her name. While Callie and her father were arguing about her relationship (her father was disappointed that everything went so fast without he and his wife even knowing she was seeing someone), George remembered the sex he had with Izzie. He then said he wouldn't let them pay for anything and left Joe's bar. Later that day at the hospital, Carlos Torres said he respected that George wanted to care for Callie, but he warned him not to hurt her. Before leaving for the airport, Carlos made Callie agree to let her mother plan a wedding party. Callie then kissed George, saying she was proud because he stood up to her father. She apologized for last night. She then told George to find Izzie and prepare their patient for surgery. That night in their hotel room, Callie told George, who was clearly thinking about Izzie, that she could smell his clothes through the closet doors. He apologized twice, the second time being more for cheating on her with Izzie. However, Callie didn't notice this and continued reading.[28]\n\nCallie had a rough night being on call, so George suggested to have a coffee date, to which she happily agreed. While looking for George in the clinic to have the coffee date, Meredith told her that he was with Izzie. When he left an elevator, he saw Callie standing there, and he realized he had forgetten their coffee date. He apologized, saying he had been busy in the clinic with patients. Callie knew that he was lying as she had been in the clinic to look for him, but she just went home and decided not to tell him that she knew he was lying.[29]\n\nWhile studying for her intern exam, Cristina wanted to get Callie's study cards really badly. She tried to befriend Callie by asking her to taste the different wedding cake samples, however, Callie was on to her and just said she wasn't getting her cards. Later that day, Callie told Addison about George's lie. At first, Addison agreed with her that it was probably nothing. When Callie said she needed to stop thinking about Izzie, Addison told her that when she's obsessing about something like that, there's generally a reason. Callie also watched George feeding Izzie part of his lunch while laughing together. Callie later told Cristina she'd give her cards to George, but Cristina said he'd only share them with Izzie. Callie then decided to let her have the cards instead of giving them to George and told her where they were. At the end of the day, she asked Izzie to stop being so close to George and give her her husband back.[30]\n\nWhen Burke's and Cristina's mothers came to Seattle to help plan the wedding, Cristina told them she and Callie were friends. They then urged her to ask Callie to be her bridesmaid. Without Callie even agreeing, Cristina's mother started measuring Callie's sizes for a dress. Later that day, Callie told Cristina a couple of things she'd definitely not wear, and Cristina commented to Izzie that this was a right attitude, opposed to Izzie, who was all excited about the wedding. Izzie then found out that Callie was a bridesmaid too, which she obviously didn't like. Later that day, Cristina, Meredith, Izzie and Callie went shopping for dresses. At work, Callie asked if Izzie if it wasn't too weird she was a bridesmaid too, but Izzie said it was fine. Izzie also told her that she thought George's plan to transfer to Mercy West was a good idea. Callie then asked her if they were fine, and Izzie assured her they were.[31]\n\nThe day of the intern exam, while asking him medical questions, Callie found out that George got accepted into Mercy West. Callie was excited about this, saying he now could actually tell her about his day as she wouldn't know what happened if they'd work at different hospitals. When Izzie wanted to call George down after Bailey told him how stupid it was to leave the hospital, Callie saw them and she became suspicious again. While Addison was telling Callie about her unfulfilled wish to have a child, Callie confessed she was thinking about having a baby too. In surgery, Callie revealed she used to mountaineer while in high school. In one day, Callie did four osteosynthesis, amputated two hands and she stabilized a spine in two hours, all in three surgeries happening at the same time. When Mark complimented her about this, he said Bailey wasn't the only one having a shot at getting the Chief Resident job. Bailey, who overheard him saying that, was surprised, as she didn't know that Callie was in running for Chief Resident too, and thereby didn't think that she had competition. Callie told her that she was very good at her job. \"We all know you're the Chief's favorite, but that doesn't mean I can't take a shot,\" Callie told her. That night at Meredith's, Cristina was writing her vows, in company of her three bridesmaids. Everyone but Izzie agreed that the vows didn't really matter anymore after the wedding day. Izzie told them that they took love for granted, while she didn't have anyone and couldn't be with the person she loved. She added she could only think about having the man she loved promise her to love, honor and cherish her. Callie and Meredith both realized she was talking about George. \"You're talking about Denny, right?\" Meredith asked, trying to make Callie forget what Izzie said. \"Yeah,\" Izzie answered, obviously lying.[32]\n\nThe evening before the wedding, Cristina and her bridesmaids had fun with dresses made out of toilet paper, while Callie helped Cristina writing her vows. The day of the wedding, Callie told George she could only think about having a baby, even though she didn't really want to house a human being inside of her for 9 months. George left to take care of a patient, but he later told her they could do it if that's what she really wanted. While Izzie was looking for George in the wedding chapel, Callie told her he'd be late as it was a big day for them too. She told her she was named Chief Resident and that they decided to have a baby. This clearly surprised Izzie. Callie later witnessed how Meredith convinced Cristina to walk down the aisle and how Meredith told everyone that the wedding was over. When everybody left, Callie watched how Izzie was sitting on one of the benches.[33]\n\nSome time later, George asked her to talk later that day, as she didn't come home the previous night because she was swamped with paper work. While she was looking for a disappeared baby, Mark asked her if she was okay. She said she wasn't because she blew the task the Chief gave her, and she suddenly said that she was thinking that George was having an affair. \"If that's true, he's an idiot,\" Mark said. He then advised her to talk to him about it, as an alternative for destroying her career. That night, George came over to talk. Callie knew what he was about to say, and begged him not to say it as she was exhausted. \"Not tonight. I'm your wife. Do this for me,\" she said. George then agreed and walked away.[34]\n\nBeing Chief Resident [ ]\n\nOn her first day as Chief Resident, Callie didn't exactly know what to do when a big trauma was about to come in. She asked the Chief about this, who just said she had to make sure her residents take care of the trauma. He then asked where the residents that she assigned to the ER were. She said she paged them, and told Bailey that she paged them but that they didn't come. \"When I page them, they come running,\" Bailey said, jealous of Callie. The Chief told her to get it together and left. At work, by saying she might be pregnant, Callie tried to cheer up George, who was a bit depressed because he was still an intern while the others passed their intern exams. Alex asked Torres to be let off their case, but she didn't allow that. Behind her back, Alex went to ask Dr. Bailey, but she told him to ask Dr. Torres as she was in charge. Callie overheard him asking and sent him back to the ER. She then said to be Bailey that she had no idea how she got them to listen to her and have respect for her, which made Izzie smile. At some point that day, Callie's patient was being operated on by Alex and Bailey without Callie even knowing about it. When she found out, she went to the OR to ask for an explanation, but Bailey defended Alex by saying that his quick thinking saved the patient. In the evening, Callie was sitting outside when Bailey came over. \"You wanna humiliate me some more? Cause I get it, I suck, I suck at my job, I suck as a wife, I suck all around, so... Go ahead, humiliate me some more, please,\" Callie said. \"Hope tomorrow is better,\" Bailey said, and she walked away.[35]\n\nWhen victims of a massive explosion come into the ER, Callie was tested as Chief Resident again. The Chief takes the first patient and tells her to triage the rest. All other residents are taken, so Callie has to work with Izzie, to whom George said that he loved her the previous night. When Bailey asked her to send residents to the clinic to oversee the interns there, Callie told her working at the clinic is voluntary and that she, therefore wouldn't send a resident, but that Bailey was free to take as many interns as she wanted. Her patient, who was asking Mark about his love life, suggested Mark start a relationship with Callie, but she said she was happily married. Callie found out that George was alone with his patient when the patient coded, and George told her that Meredith (his resident) was in the clinic. It turned out that Bailey undermined Callie's authority and sent Meredith to the clinic, even though Callie told her to only take interns. While she was in surgery, Richard came in, blaming her for not delegating well, as one of her residents got attacked and a baby went missing. Izzie told her that she found that Callie was doing a good job as Chief Resident, despite it being difficult. This enervated Callie, who thought Izzie was mocking her, and she sent Izzie out of the OR. That night, the Chief told her he couldn't spend time with his wife because she let a baby disappear from the hospital, making her feel even more miserable.[36]\n\nThe day after, Callie was busy with the administrative side of her job in a lounge at the hospital. Bailey kept coming in to inform her what the residents and interns were doing, but Callie wasn't interested. When Bailey asked her if she was going to come out to do her job, Callie asked why she should as Bailey was clearly doing it so much better. She told her she was doing paperwork because she had no more fight in her. Bailey left without any more comments. In the evening, she came back to tell Callie that was struggling with the fact that she was now number two, while she was used to being number one. She then told Callie she'd be the best number two of the hospital and that she'd help Callie, so they'd act like a team. At night, when George came back to the hotel room, she told him just to say it as she clearly knew what he wanted to tell her. He then confessed he slept with Izzie.[37]\n\nAfter he told her, she kept sitting silently on her bed in the hotel room until it was morning. When he tried to get her to talk, she told him she forgives him, as he made a mistake, but they also took vows. At work, Callie asked Izzie to talk in the cafeteria at noon about what George told her. Izzie thought they were going to fight, a rumor which quickly spread across the hospital. Callie worked together with Bailey that day, who noticed that Callie was thrown off by something. When Callie entered the cafeteria, everyone expected them to fight and while Izzie was getting ready to fight, everyone came to stand around them. \"I wanted to talk,\" Callie says. Izzie was surprised, as she really thought Callie was going to kick her ass. Callie then left without talking, humiliated by Izzie and everyone standing in the cafeteria. Her patient that day had weak bones because her husband urged her to lose weight. When the patient died, Callie went to talk to the patient's husband. She related too much to her personal life and started yelling that he didn't really love his wife, as he pushed her so hard to be skinnier and that you don't destroy the person that you love. George took the man inside, while Bailey asked Callie one more time if she was all right. \"It's nothing,\" Callie said. \"Good. Cause nothing almost cost you your career,\" Bailey says. Izzie later came to apologize for the incident in the cafeteria and for having slept with George. Callie told her she should be humiliated and ashamed and that she shouldn't ask her for forgiveness. George also came to her, saying that she shouldn't forgive him. He told her he knew she said she forgave him because she wanted to pretend it never happened, while she actually didn't forgive him. She said he was right, that she didn't forgive him, and walked away.[38]\n\nIn the morning of Halloween, Callie and Miranda told the residents what they had to do that day. When Izzie asked a question at Callie, Callie told her to redirect her questions to Bailey. Cristina asked if they all had to redirect their questions to Bailey, but Callie told her it was just for Dr. Stevens. When Bailey asked her why Izzie had to redirect her questions, Callie revealed to everyone that Izzie slept with George. Callie worked together with Mark, and he told her he heard about her marriage. He told her he was available all day and night (in particular) to cheer her up. She confessed that after the wedding in a church and the vows, she couldn't believe her life had become like this. In surgery, when Norman Shales commented that people do strange things, Callie said that she had world's shortest marriage. Cristina told her she was literally left in the church, wearing a wedding dress. They laughed together about their marriage problems. At the end of the day, Callie moved in with Cristina in Burke's apartment, but she was not allowed to clean.[39]\n\nIn Burke's apartment, Callie slept on the couch. Despite her efforts to assign him to Mark to keep him away from her, Callie ended up working with George when their patients refused to let go off a wedding dress because of a contest. When Callie told Mark she tried to keep him away from her, Mark told her he'd torture George to make her feel better. He did this by having George act as a proxy when both future brides were convinced to let go off the dress, so George had to carry the dress while the women were being treated for their injuries. Callie told Mark it cheered her up indeed. When her patient woke up after surgery and she asked about the wedding dress first, Callie told her that she should fight for a marriage, and not for a wedding, as a marriage could also be a lost cause. She told her patient she needed to learn to let go. After Mark and George's patient came out of surgery, Callie talked to George. He was glad she was talking to him, and she told him she was letting go.[40]\n\nRichard tells Callie she needs to be a better Chief Resident, but she has back-to-back surgeries so she asks Bailey to take over for her and act as Chief Resident that day. When Cristina, who had been told by Bailey to try other specialties (Bailey pretended it had been Callie's idea), asked to be on Callie's service, Callie was surprised as she didn't know what Cristina was talking about. However, she quickly got that it had been Bailey's idea and let Cristina scrub in. In surgery, Bailey came in to ask her to solve scheduling problems. Callie told her to solve it herself. The Chief found out about that Bailey was the one acting as Chief Resident, and he fired Callie to give the job to Bailey. Callie went home, where she told Cristina she was fired.[41]\n\nThe next day at work, Callie congratulated Bailey with her new job. Sydney Heron came over to congratulate Bailey as well, while she said she felt sorry for Callie, who assured her she was fine with it. Callie had lunch with Cristina, who kept ranting about Hahn. Callie didn't listen to her, as she kept looking at George and Izzie, who started a relationship. Cristina noticed this and told Callie they weren't worth to get hung up over, as they apparently weren't even talking to each other. Callie commented that that made her feel better. When Callie saw how hard Cristina was trying to impress Hahn, Callie told her she was now only annoying Erica and that she should back off. Callie told her patient that she was fired from Chief Resident, and that it was a good, as she could now get back to the part that she liked: surgery.[42]\n\nCallie had to work together with Izzie. When Hahn asked her if she could steal Izzie from her service, Callie said she could have Izzie for free.[43]\n\nDiscovering Her Sexual Orientation [ ]\n\nWhen Mark commented in surgery that Hahn was as mean to herself as she was to others, Callie defended Hahn by making him stop talking. After their surgeries, Hahn asked Callie and Mark if they wanted to have a drink with her. They agreed, although Hahn urged Mark not to hit on her.[44]\n\nThe next day, Erica held the elevator for Callie and greeted her by saying \"Dr. Torres\". Callie told Erica that anyone who can outdrink her and then still kick her butt at darts gets to call her Callie. They agreed that last night was fun, and they both commented that they were not a group person because they generally don't like people. As the elevator opened and Mark greeted them, Erica and Callie started laughing. \"Case in point,\" Erica said as she and Callie walked away. Later that day, Callie met Louise O'Malley, whose calls were never returned by George or Callie. Louise, who didn't know that her son and Callie broke up, showed Callie the baby clothes she knitted, as George told her that he and Callie were trying to get pregnant. She took the clothes and went to George to yell at him for not telling his mother that he cheated on her. \"She's waiting in the lobby,\" Callie told George as she handed over the clothes. When Callie met Louise again, she knew because Izzie told her. Louise is concerned that God would punish George for cheating on her. Callie told Louise that she doubted God was present at their Vegas wedding, and she said that even though George wasn't the one for her, she loved being an O'Malley for the little while it lasted. At the end of the day, Callie and Erica went out together.[45]\n\nShe and Erica went out dancing, and it got late, so they went straight to the hospital together. Cristina then discovered that Callie and Erica were friends. Callie also worked together with Izzie in a professional way. Cristina wanted Callie to put in a good word for her with Erica, but Callie says she and Erica don't talk about Cristina. At the end of the day, Callie and Erica hung out at Cristina's apartment.[46]\n\nTheir friendship grew closer and they did sunrise yoga together, which they both found to be intense. Callie told Erica about Addison, and Erica agreed with her that Addison was nice. Erica informed Addison that Callie got divorced, and Callie completed Erica's sentence by saying it was the best thing that could've happened. They gave each other a look and started laughing, which Addison noticed. At noon, Callie and Addison met outside to have lunch together. While Callie was walking up to Addison, Cristina approached and told Callie that Erica was no longer welcome in her apartment. Callie came to Erica's defense, naming some of Erica's qualities. Addison overheard what she said, and when Callie sat down, Addison asked her if she and Erica were a couple, because it seemed like they were. Callie tried to laugh it away, and said she was a huge fan of penis. Callie later went to the cafeteria where she asked Cristina and Meredith if people ever thought that they were a couple. \"No, because we screw boys like whores on tequila,\" Meredith said. \"And then we either try to marry them or drown ourselves,\" Cristina added. Cristina then told Callie that she had to make Erica let her scrub in on a surgery, and if not, she would make her move out of her apartment. Callie managed to do this by promising Erica to buy drinks at Joe that night. Addison, Erica and Callie had drinks at Joe's that night, and Addison witnessed how Erica removed a hair that was caught in Callie's lipgloss. Callie felt awkward seeing the way Addison was looking at her, and she went to Mark to dance with him. Erica saw how she left the bar with Mark a little later to have sex with him.[47]\n\nTrying to forget Addison's comments, Callie constantly wanted to have sex with Mark in the on-call rooms. Later that day, Erica was reading the article of Burke winning the Harper Avery. \"It's because I don't have a penis,\" Erica said, which made Callie feel awkward because she didn't realize just yet that Erica was talking about Burke. Erica asked to go to Joe's again that night, but Callie said she had this other thing. Mark then came over and asked Callie to talk to the nurses to make them stop boycotting him. Erica and Mark started bickering over whether or not he was a good guy, and they asked Callie's opinion, putting her in the middle. She didn't want to choose between them, so she stayed silent. A disappointed Erica walked away, and Callie asked Mark to go to an on-call room with her. In the scrub room, Erica asked if they were on for tonight, but Callie remember her that she had this other thing. Erica was mad that Callie didn't tell her about sleeping with Sloan (which was the other thing) and that she disappeared now that she got a boyfriend, especially because Callie was her new friend and she doesn't make friends easily. In the evening, Callie wanted to go make out with Mark again, but he was not in the mood because all his surgeries got cancelled. At Joe's bar, Callie confessed that she'd been avoiding Erica because Addison implied that they might be lesbians. Erica started laughing, and so did Callie, but they gave each other somewhat of an awkward look.[48]\n\nSome time later, Callie and Mark were having lunch. Callie asked again to have sex, but Mark (still remembering that Bailey called him a whore) told her that he wasn't interested in sex only. Erica joined them, and they started to seduce Mark by acting as if they wanted to do a threesome. Mark tried to resist by saying that the new Mark wasn't interested, but he eventually walked away. When Callie tried to get Mark into an on-call room, he started to talk about Erica Hahn and his fantasies about her. Callie didn't want to hear him talk about Erica in that way and walked away. That evening, Mark entered the elevator where Callie told Erica that Mark had been thinking about a threesome all day. When he finally admitted that he was, Erica said that he wouldn't be able to handle the two of them, but Mark thought that he would if he wanted to. \"You wouldn't find it intimidating?\" Erica asked, and while he said he wouldn't, Erica kissed Callie. Mark was speechless. \"See, too much for you,\" Erica said, and she left the elevator. Callie was completely speechless too, and she followed Mark to an on-call room.[49]\n\nWhen Callie's father appears in Seattle to visit his daughter, he is angered by the news that George divorced Callie, initially throwing George against a wall, and then throwing Mark against a wall; and was angered even further by the fact that his daughter is now dating a girl. He attempts to take Callie home with him, but she refuses, and her father cuts her off financially.\n\nMeeting Arizona [ ]\n\nCallie met Arizona at the Emerald City Bar. While Callie was wiping tears in the bathroom, Arizona came in and told Callie that the hospital talked about her. Arizona said the talk about her was good and when she was over being upset, there'd be people lining up for her. When Callie asked for the names, Arizona leaned in and kissed her. \"I think you'll know,\" Arizona said. They both smiled and Arizona left.[50]\n\nGeorge's Death [ ]\n\nWhile operating on George, Derek stops working and after a moment Owen asks if anyone knows if George was a donor. George is declared brain dead and Callie stumbles backwards and starts hyperventilating and Owen tries to calm her. Later in the scrub room, Lexie joins Bailey and Callie who look at George and Lexie says the man is too tall to be George. Everyone goes to Meredith to ask her how she knows and not satisfied with her answer, Callie walks into the John Doe's room to see if he has a freckle George had on his hand (shaped like Texas) that Callie used to tease him about. She checks his hand and starts sobbing silently, confirming it is him. Callie and Bailey talk about how it doesn't seem real when George's mother approaches Callie and tells her that it will be too hard for her to decide what happens to George's organs and because in God's eyes Callie is still George's wife then Callie should decide, Callie accepts. She goes to Arizona in the pit for comfort and Arizona advises her to cry, scream, and eat donuts. Callie then decides that she shouldn't choose alone because George loved someone more than her, even while they were married. Callie tries to convince Alex to tell Izzie what happened to George so she can help decide what should happen to his organs and so that she can say goodbye. After Izzie is told, Callie and Izzie go through the forms and decide George would want to give everything. 9 days later, Callie walks into the chief's office and asks him about her application to become an attending but he says that Dr. Chang is still putting off his retirement so it won't happen. Callie complains that Chang is just a figurehead, she is the one who does all the work and is primarily paged and he is just a dinosaur, but the chief yells that he is too. Callie leaves, telling Richard he'll regret it and she deserves to be an attending because she is a superstar. Callie storms into an elevator with Bailey and suddenly breaks down crying. 4 days later, Mark hammers on Callie's apartment door and she comes out sobbing about losing George, having to get a new job and not seeing her friends again and that Arizona keeps bringing her donuts. Mark comforts her and then gets the idea of moving into the same building as Callie.[51]\n\nCallie went into the hall and asked Mark for some wardrobe advice for her first day at Mercy West. After he gave his opinion, she changed in front of him and Lexie, leaving Lexie awkward and shocked. Later at work Callie meets Richard who was admitted after an accident and after confirming there were no big injuries, he just needed sutures, she passed him on to her intern, only on his 8th day of work. She is later approached by Arizona's old patient and her mother that in which Arizona asked her to perform a scan that she had said Mercy West could perform. When she gets home she gives out to Arizona but tells her she did do the tests although nothing abnormal came up. 35 days after George's death, Callie walks into Mark's apartment and into the shower she asks him to find out if the chief is going to take up work at Mercy West because that would be bad for her and he tells her he'll try and find out. She goes to leave but Lexie asks her first how gay she really is on a scale 1 through Gay because she and Mark live next door and Mark is very hot and she just walked on him while he was taking a shower but Callie relaxes her by saying that ever since Mark met Lexie, Callie's breasts were not the first things he looked at when he saw her. After her work day she goes to Joe's bar and relaxes with Arizona.[52]\n\nHospital Merger [ ]\n\nPrior to the merger, Callie got into an argument with Richard and resigned from Seattle Grace Hospital as he rejected her job application for the attending post. She then started working at Mercy West Medical Center. When the news of the merger of Seattle Grace Hospital and Mercy West Medical Center broke, she considered relocating to other states to work as she figured that Richard would fire her again during the merger. After being encouraged by Arizona, she intended ask Richard for her job back, but decided otherwise when she noticed that Richard was feeling down. In the end, Richard offered her the post of an attending surgeon.\n\nWanting Children [ ]\n\nHaving children was always one of Callie's dreams. She and George tried before their divorce. When she brought up children to Arizona, she was shocked to learn that Arizona didn't want kids. They broke up over this issue but later reconciled when Arizona said she wanted to have babies with Callie after the hospital shooting.\n\nArizona Leaving for Africa [ ]\n\nArizona won a prestigious Carter Madison Grant, which would allow her to spend three years in Malawi operating on kids who would otherwise never see a pediatric surgeon. Because Arizona was meant to be gone for three years, Callie planned to go with her. However, while they were at the airport, Arizona realized that Callie didn't really want to go. They fought and ultimately broke up, with Callie staying in Seattle and Arizona going to Malawi and Callie returning to Seattle and having sex with Mark, which resulted in Callie becoming pregnant with Mark's child.\n\nCar Accident [ ]\n\nMoments after Arizona proposed to Callie, they ran into a truck that was stopped in the road and Callie went through the windshield since she had taken her seatbelt off to retrieve her cell phone, which Arizona had tossed back there. Upon their arrival at the hospital, Callie was presented with massive head and chest injuries, and internal hemorrhaging. She crashed in the ER, but the doctors at the hospital were able to resuscitate her and took her into surgery. She had large epidural and subdural hematomas, and severe internal injuries, which caused intensive hemorrhaging. Her pulse was unstable during the surgery, and the doctors agreed on a temporary abdominal closure, so she could become more stable. The question of whether or not to deliver the baby prematurely at 23 weeks remained an issue, as cardiovascular stats could be improved by early delivery. After the first surgery, Derek performed neurological tests on Callie to check her neurological functions, but she didn't respond. Cristina opted for a percutaneous surgical procedure, as seen during a surgery with Preston Burke, but Dr. Altman rejected her suggestion. After Callie's pressure dropped, she was brought back into surgery, during which Dr. Hunt agreed to Cristina's procedure as Callie remained unstable, and they were out of ideas. Pressure and pulse dropped again, causing Callie to crash. Dr. Richard Webber is initially unable to regain her pulse, and Addison was forced to deliver the baby early by C-section. The baby had no heartbeat upon delivery, but Arizona was able to get a heartbeat, and so was Dr. Webber, and both Callie and Sofia survived.[53]\n\nThey named the baby Sofia Robbin Sloan Torres and she and Callie were discharged from the hospital 12 weeks later.[54]\n\nMarriage to Arizona [ ]\n\nAfter a series of unfortunate relationships, Callie got married to Arizona in a beautiful outdoor ceremony where Dr. Miranda Bailey officiated. Callie's mother refused to attend the wedding because she was marrying another woman. Because of this, Callie told her father not to come, so he wouldn't have to choose between his wife and his daughter. At the reception, the newlyweds prepared for the father/daughter dance. Arizona's father danced with her for the dance while Callie tried to hide her disappointment that her father wasn't there for the dance. Mark Sloan offered to dance with Callie since her father wasn't present. Callie's father swooped in during the course of the dance and he cut in to dance with his daughter, saying he'd been waiting for it since he first held her in his arms.\n\nAmputation of Arizona's Leg [ ]\n\nThough Callie wasn't on the plane that crashed in the woods, it had a huge impact on her life. Callie's best friend, Mark Sloan, died because of it and her wife, Arizona, had to have her leg amputated due to a severe infection. While waiting for the infection to get better (before the leg was amputated) Callie promised Arizona that she wouldn't cut off the leg. However, during the surgery in which Callie operated on Derek's hand, Alex came in, saying that Arizona was crashing because of her infected leg. Callie then ordered him to cut it off as Arizona would die if the leg wouldn't be amputated.[55]\n\nFollowing the amputation, Arizona was mad at Callie for a long time. It got so bad that Callie slept at Mark's apartment. Callie stayed with Arizona and helped her whenever she could. Slowly, Arizona allowed Callie back into her life. Yet, Arizona still wasn't comfortable having sex, which is why Callie spent months without having sex. Arizona also refused to let Callie help her when she had problems with her residual limb because she wanted Callie to see her as her wife, not her patient. She ultimately allowed Callie to help by massaging her leg and later that night, they had sex for the first time since the plane crash.[56]\n\nOwning the Hospital [ ]\n\nThe doctors involved in the plane crash used the lawsuit money to buy the hospital at Callie's suggestion. They now serve as the hospital board.\n\nArizona's Miscarriage [ ]\n\nWhile attending Meredith's baby shower, Arizona asked Callie to have another baby and decided she'd like to carry this one. They chose a donor and soon, Arizona was pregnant. However, on the day of their first ultrasound, Callie was unable to come to the appointment because she was operating on Travis Reed and the surgery ran long. After she finished the surgery, Arizona came into the scrub room and told her that the OB did the ultrasound and couldn't find a heartbeat.[57]\n\nMarriage Problems [ ]\n\nDuring the superstorm, Arizona escorted Lauren Boswell to an on-call room after Lauren asked where she could sleep. Arizona was just leaving when Lauren spoke up and asked her to stay there. Arizona shook her head but Lauren was adamant. In the end, Arizona agreed to keep her company, but when Lauren got too close, Arizona realized what was happening and tried once more to leave. This led to Lauren mentioning that it was okay to let loose once in a while. After thinking about this, Arizona locked the door to the on-call room and the two had sex. Callie found out about this when she came to look for Arizona and saw her wedding ring pinned to the scrub top Lauren was wearing. This happened because the two had accidentally switched shirts after sleeping together.\n\nTravis Reed Lawsuit [ ]\n\nAfter having to cut off a famous Olympic athlete's legs due to infection, she was sued for malpractice. Callie had never performed the procedure and had to leave a sponge in the patient due to complications. In the end, she won the lawsuit and everything was okay. Later that night, with the encouragement of her father, Callie went to Arizona's hotel room and asked her to come home. Callie did not know that at the time Dr. Murphy was having sex with Arizona.[58]\n\nDesire for a Second Child [ ]\n\nCallie always wanted many children. At Meredith's baby shower, the couple had an idea of trying for a second child. Arizona got pregnant with their second child but shortly afterward had a miscarriage.\n\nRelationship with Penny [ ]\n\nCallie met Penny online and they started dating. They had been dating for a few months when Callie introduced her to her friends, which led to the revelation that Penny had played a part in Derek's death. This put a serious strain on their relationship, especially with Penny's recent re-match to Grey Sloan Memorial Hospital. Callie attempted to ignore her love for Penny, but was unable to do so. As her friends' hateful feelings towards Penny faded over time, Callie and Penny made up.\n\nCustody Battle over Sofia [ ]\n\nPenny won the Preminger Grant and Callie decided to move to New York after Penny asked her to, taking Sofia along. She informed Arizona about her decision. Upset that Callie did not discuss this issue of uprooting Sofia from Seattle, Arizona decided to file a lawsuit against Callie for custody of Sofia. When trying to get her friends to testify for her in the custody hearing, Callie mentioned to Penny that she thought Meredith would be on Arizona's side because they were in a plane crash together, but by the end of the day she managed to get Owen and Meredith to testify for her.[59]\n\nBefore the custody hearing started, Arizona and Callie's respective lawyers tried to negotiate to prevent going to court but failed to come to a compromise. In court, after hearing both sides, Callie eventually lost the lawsuit as Arizona was granted the sole physical custody of Sofia.[60] Despite this ruling, Arizona, seeing how sad Callie was, agreed to let Callie have her for alternating school years and Christmases.[61]\n\nPersonality [ ]\n\nCallie is portrayed as a friendly and easy-going person who is able to work with everyone. Even the usually icy Bailey eventually warmed up to her and asked her to be her maid of honor. She is well-regarded by her fellow attendings, both professionally and personally.\n\nRelationships [ ]\n\nRomantic [ ]\n\nArizona initially brushed Callie off after kissing her in the bathroom at Emerald City Bar[62], considering her to be a \"newborn\" as far as lesbian relationships go, but when Callie confronted Arizona at Joe's, she embarrassed herself and Arizona in front of Arizona's date, Julie.[63]\n\nArizona later found Callie and admitted she misjudged and asked her to dinner; Callie initially played hard to get, saying she would check her schedule, but gave in quickly, sticking out her arm to stop the elevator and accepting the date.[64] They then entered a relationship. When George O'Malley died, Arizona kept bringing Callie donuts - because that's what helped her when her brother died - which made her more upset.\n\nAfter that, Callie started to work for Mercy West then comes back when both hospitals were merged. During that time, she and Arizona hit a rough patch, when she found out Arizona did not want kids. They soon broke up. They got back together after the shooting at the hospital when Arizona said she wanted kids, but only with Callie.[65] Not long after that, Arizona and Callie moved in together but broke up again when Arizona won a grant to set up a clinic in Africa to help kids and left Callie at the airport after figuring out she didn't really want to go.[66]\n\nAfter a brief stay in Malawi, Arizona came back because she missed Callie, but Callie slammed the door in her face.[67] Arizona spent some time trying to get Callie back unsuccessfully, but when she cornered Callie in an elevator, she found out that Callie was pregnant with Mark's baby.[68] Callie and Arizona got back together and agreed to raise the baby together.[69]\n\nAfter their baby shower, while she and Arizona were on their way to a weekend away, Mark texted Callie when he found out Lexie was in a relationship with Jackson and Arizona threw the phone in the backseat. They started to argue about Mark being involved in their lives and Callie took her seatbelt off to get her phone. While arguing, Callie told Arizona she was trying to do everything to make her, Mark, and the baby happy and would do anything for Arizona to make her happy. Arizona took a moment to think and then looked at Callie and said, \"Marry me.\" Before Callie could answer, she gasped and Arizona turned to see Callie was gasping at a truck in front of them that Arizona had not seen because she had taken her eyes off the road.[70] They rear-ended the truck and while Arizona had minor injuries, Callie was ejected from the vehicle and nearly died. After two surgeries, including the premature delivery of their daughter, Callie woke up and told Arizona she'd marry her.[71]\n\nLater, they married in a ceremony officiated by Miranda Bailey. Callie's parents left before the wedding because of her mother, who didn't approve of her getting married to a woman and having a baby out of wedlock. Mark ended up walking Callie down the aisle. Later, during the reception, there was a father-daughter dance which Arizona said she forgot to remove from the schedule, but Callie said she would sit it out. Mark then danced with her, only to have Callie's father cut in to tell her he's been looking forward to this day ever since he held her in his arms when she was a baby.[72]\n\nArizona cheated on Callie with Lauren Boswell during the superstorm[73] and their marriage was strained. However, after Callie's malpractice suit, she asked Arizona to move back home.[74] After April and Matthew's failed wedding, they bought a house together.[75] They also recently decided to expand their family by having another child. However, the couple struggled to get past previous issues. They tried couples therapy and separation, but Callie discovered that she was happier without Arizona so they got divorced.[76]\n\nEventually, Arizona realized that Sofia needed both her parents and she decided to move back to New York with Sofia. Since Callie had split from Penny, the move rekindled the romance between Callie and Arizona.[77]\n\nMark and Callie were best friends, and Callie once referenced Mark as her \"work-husband\" and herself as his \"work-wife\" while they were both dating other people separately. While she and George were broken up, she met Mark at Emerald City Bar and invited him back to her hotel room. They started sleeping together again after she and George split up permanently. He helped her figure out that she liked Erica Hahn. Mark and Callie had a relationship which started with sex. When Callie starting seeing Erica, they stopped sleeping together and became friends and remained close friends. After Mark broke up with Lexie, Callie was the one who told Mark to get back together with her.\n\nWhen Arizona won the Carter Madison Grant and Callie prepared to move to Malawi with her, Mark told Callie that she shouldn't go to Africa if she doesn't want to. After Arizona realized she didn't want to go, she left Callie in an airport. After the break-up, Callie went to Cristina Yang's party, heartbroken about Arizona. She ended up moving in with Mark temporarily, just until she could get rid of the sub-letter at her place. After a night of drinking to celebrate Derek getting a grant for his Alzheimer's research, Callie approached Mark for a palate-cleansing \"sorbet.\" They started a short fling, which resulted in the conception of their daughter, Sofia.\n\nAfter Arizona returned from Malawi, she decided she was in and the three raised Sofia together until Mark's death.\n\nCallie first met George O'Malley when he dislocated his shoulder after falling down a flight of stairs. She recognized him as the intern who single-handedly performed open-heart surgery in a stalled elevator, saving the patient's life. Clearly interested in getting to know him better, she gave him her number. However, George could not summon the courage to call her, so she started to ignore him.\n\nGeorge eventually called her and asked her out, and began dating her shortly after. While looking for Callie one night, George stumbled onto her \"home\" in the hospital basement. She quickly explained that it was simply easier to stay at the hospital since she was always there, and defended that she wasn't crazy. He kissed her and the two proceeded to have sex.\n\nShortly before the hospital prom, Callie said \"I love you\" to George and later revealed that it was the first time she said that to a man. She was upset that George did not reciprocate her gesture, but he replied saying that he will only say it when he means it. The couple promptly made up after that although Izzie's strong dislike for Callie sometimes made it difficult.\n\nThe Chief later found out about Callie's living arrangements in the hospital and kicked her out because it was against protocol. She temporarily moved in with George at Meredith's, but he was uncomfortable with how quickly their relationship was progressing, so she left and moved into the Archfield Hotel. Callie made an effort toward reconciliation by inviting George to her hotel room one evening, but he stood her up to support Izzie in her time of need. Upset at how George was always placing Izzie and Meredith before her, Callie ended her relationship with George.\n\nThe same night, Callie went to Joe's, where she met Dr. Mark Sloan and invited him back to her room. After a brief fling, she refused Mark's continued advances but also discouraged George from chasing after her out of guilt, even though she was still in love with him. However, Dr. Alex Karev overheard Callie talking about her fling with Mark, and informed George about it. George was furious that Callie had slept with another man, but was distracted when his father was admitted for heart and cancer surgery. He decided to shelve his relationship problems and placed his relationship with Callie on hold.\n\nCallie provided emotional support in spite of her strained relationship with George, bonding with his brothers and communicating the seriousness of their father's illness to his brothers. George rejected her help initially, stating that they had already broken up, but with encouragement from his father, George gradually began allowing Callie back into his life and family circle. When it seemed that Mr. O'Malley's condition was taking a turn for the better, George kissed a confused and stunned Callie. After George's father died, Callie provided physical support as George dealt with his grief through sex, but she was still shocked by George's sudden proposal.\n\nCallie accepted George's proposal, and the couple got married in Las Vegas, leading Alex and Dr. Sydney Heron to dub her “Callie O’Malley”. Although Addison was genuinely happy for Callie, Izzie was less than supportive of Callie's marriage. Callie eventually tired of Izzie's antagonism and threw down the gauntlet saying that if it came down to taking sides, George would definitely side with her. For a while, it seemed like that might be the case - George moved out of Meredith's house and stayed with Callie in her hotel room, paying what he believed to be his share of the expenses - $200 a week. When Izzie insinuated to George that he made a mistake in getting married, he continued to avoid her at the hospital.\n\nHowever, Callie eventually confessed to George that their hotel bill was much more expensive than she'd led him to believe, and she did not receive a discount through family friends, as she had told him. She confessed that her parents \"had money\", making her well-off as well, leading George to accuse her of concealing her wealth from him while using his money to tip housekeeping. Word of Callie's wealth spread among the other interns, and Izzie commented on it during surgery with Callie. Angry that George had told Izzie her secret, Callie confronted him that evening with her suspicions about Izzie's true feelings for George, ultimately throwing him out of their room for the night. Confused, George confided to Izzie about his relationship woes over alcohol, leading to a drunken sexual encounter between the two.\n\nCallie reconciled with George at work the next day and survived a surprise visit from Callie's father - during which George impressed Callie by refusing to allow her father to help them financially - and George was allowed back into the hotel room. However, Callie was still unaware of his drunken one-night stand with Izzie the night before.\n\nCallie became increasingly suspicious of George and Izzie after witnessing the two of them hanging out together on several occasions. Not knowing what else to do, Callie confronted Izzie in an elevator, begging her to return George to her. Subsequently, Callie decided to have a baby with George, a request to which he agrees.\n\nCallie was informed later about George and Izzie's affair leading to George ending the marriage. Callie was angry at first and wanted to talk to Izzie about it and asked her to meet her in the hospital cafeteria, but Izzie thought that Callie actually wanted to beat her up. That day before the lunch break, everyone knew about the \"fight\" that was going to happen. By acting as if the fight was really going to happen in front of everyone in the cafeteria, Callie was severely humiliated by Izzie.\n\nLater on, Callie confessed to Arizona that she wished for Izzie to die when George left her to start a relationship with Izzie, but she deeply regretted this when Izzie was diagnosed with cancer. When she found out that George enlisted in the army, she wanted to stop him and planned an intervention with Bailey and George's friends, not knowing that George was the John Doe trauma patient they just got. When he died, Callie broke down.\n\nAfter Callie and George got a divorce, she started a friends with benefits relationship with Mark Sloan. During this relationship, Callie also started becoming close with Erica Hahn. Mark began to tease the two about how close they were, talking about them kissing and asking Callie if she ever thought about grabbing Erica's hair in surgery and kissing her. This was the start of Callie discovering her sexuality. When Addison Montgomery came back to Seattle Grace for a special case, she asked Callie if she was 'speaking the vagina monologues now', after seeing how close Callie and Hahn were.[78] Callie began using Mark for sex more, to convince herself she wasn't attracted to Hahn, but he eventually let her go and told her to go after Erica.\n\nCallie finally got the courage up and kissed Hahn,[79] and the day afterward, they ignored each other.[80] After talking about it with Hahn, they decided to take their relationship slow and explore together at a pace they were comfortable with.[81] The first time they had sex, Callie didn't enjoy it. She voiced her concerns to Mark, who didn't want to hear about it. Later, Callie and Hahn spoke and Hahn said she had a great night, which confused Callie. She then went back to Mark, and asked him to \"teach her\" his technique, because she wanted to be \"good at this\". After this, Callie and Hahn tried again, and she and Hahn started going out.[82] One morning, Erica looked at Callie and compared her realization that she was a lesbian to when she got glasses and could see everything clearly again. Her emotional confession scared Callie a lot.[83] After Hahn discovered that Izzie Stevens had stolen a heart for Denny Duquette, which resulted in one of her patients missing out on a heart, she told Callie that she was going to report the hospital for not reporting the situation to UNOS. Callie asked her what good it would do, starting a fight between them with Erica complaining that Callie couldn't \"kind of be a lesbian\".[84] After their fight, Erica quit her job as Head of Cardio at Seattle Grace and left Seattle.[85] She hasn't returned since.\n\nAlex and Callie slept together after a big surgery involving reconstruction of a man's legs was successful when Callie was a 4th-year resident. No one knew at the time, but the relations were later revealed when Callie gave her speech at Lecture Day.[86]\n\nCallie was dating Penny Blake. She's the doctor who didn't get a CT for Derek, a decision that ultimately led to his death. Penny never told Callie this as she wasn't aware that Derek and Callie were close. The relationship had Callie feeling really good, right up until the point that Meredith revealed who Penny was. Callie was caught in the middle, as she wanted to be there for Meredith, but also couldn't turn off her feelings for Penny.\n\nWhen Penny started to work at Grey Sloan Memorial and Meredith didn't treat her as she'd treat other residents, Callie tried to help out by talking to Meredith and other attendings, but they just dismissed her as too protective of her girlfriend. Penny also made it very clear that she didn't need Callie to stand up for her as she could that herself.\n\nAfter Penny received a prestigious offer to work in New York for a year,[87] Callie decided to go with her.[88] After a big and nasty custody battle with Arizona, who didn't want Sofia to move to New York with them, Arizona gained full custody of Sofia.[89] This prompted Callie to end her relationship with Penny, as she couldn't leave her daughter behind.[90] Later, Arizona decided to adjust the custody arrangement and allow Callie to take Sofia to New York, so she could go with Penny and be happy.[91] Some time after the move, Callie and Penny broke up.[92]\n\nFriendships [ ]\n\nThey became close when Callie moved in with her after Burke left Yang and George left Callie. Together, they purchased an apartment and lived there until Owen and Cristina moved out. They remained fairly close throughout the years as Yang is the godmother to Sofia. The friendship faded over the years as both became more invested in their relationships.\n\nOwen and Callie became closer after the plane crash, which caused both of their wives to change significantly. After leaving their spouses, they bonded over their shared experience of trying to find new love.\n\nMeredith and Callie has some significant bonding over time after the death of George. They became much closer after Arizona cheated on Callie, as Callie temporarily lived in Meredith's house.\n\nCallie and Addison were good friends while they worked together in Seattle. In fact, Callie was one of the few people to find out that Addison had had an abortion. Addison came back from L.A. when Callie was in a car accident to take care of her and the baby and ended up delivering Sofia.\n\nBailey and Callie became good friends when they worked together in Seattle. In fact, Miranda and Callie had such a tight bond that they enjoyed girls nights, and talked about relationships together. Miranda was the second person Callie went to when she began to see Erica Hahn. Callie was a bridesmaid at Bailey's wedding.\n\nCareer [ ]\n\nCallie was first introduced as the orthopedic resident who fixed George's dislocated shoulder in the ER.\n\nAt the end of Callie's fourth year of residency, she was named the new chief resident but was later demoted and the position of chief resident was given to Dr. Miranda Bailey, who had tried to cover up for her until the ploy was discovered by Chief Webber.\n\nNearing the end of her residency, Callie put in a request for an attending position at Seattle Grace Hospital, but since her superior was putting off retirement, the Chief couldn't agree to her request. Callie, who basically ran the ortho department as the best ortho surgeon on staff, then quit and took an attending position at Mercy West Medical Center, but not long after, she returned to Seattle Grace Hospital, as both hospitals were set to merge to become Seattle Grace Mercy West Hospital, where Callie continued to work as an attending. At some point, after years of being an attending, Callie was promoted to head the orthopedic surgery department.\n\nAfter the plane crash, Callie and 6 other doctors invested the money from the lawsuit and bought the hospital with financial help from the Harper Avery Foundation, creating Grey Sloan Memorial Hospital, where Callie is a board member.\n\nHighlights of Callie's career include making a man with severely misshapen legs walk again, being the first surgeon ever to build cartilage from scratch, saving Derek's hand after the plane crash and building robotic prosthetic limbs to make amputees walk again. Callie has given a speech at the TED conference about her accomplishments.\n\nCallie's current work situation is unknown, but she mentioned to Bailey that she had received offers from NYU and Columbia, amongst others. Wherever she ended up is a step down from her position as Head of Orthopedic Surgery at Grey Sloan Memorial Hospital as all the offers were just for an Attending position.\n\nNotes and Trivia [ ]\n\nGallery [ ]\n\nA more complete gallery with pictures of Callie Torres can be found here.\n\nNotable Episodes [ ]\n\nThese episodes are Callie-centric or are otherwise very informative about her life.\n\nMemorable Quotes [ ]\n\nCallie (to Carlos): You can't pray away the gay![107]\n\nCarlos: Leviticus--\"Thou shall not lie with a man as one lies with a female. It is an abomination. The outcry of Sodom and Gomorrah is great, and their sin is exceedingly grave.\" Callie: Oh, don't do that, daddy. Don't quote the bible at me! Father Kevin: Carlos, this is not what we-- Callie: Jesus--\"A new commandment that I give unto you, that you love one another.\" Carlos: Romans...- Callie: Jesus--\"He who is without sin among you let him cast the first stone.\" Carlos: So you admit, it's a sin. Callie: \"Blessed are the merciful for they shall obtain mercy.\"--Jesus. \"Blessed are the pure and heart for they shall see God.\"--Jesus. \"Blessed are those who have been persecuted for righteousness for theirs is the Kingdom of Heaven.\" Jesus is my savior daddy, not you! And Jesus would be ashamed of you for judging me. He would be ashamed of you for turning your back on me. He would be ashamed.[108]\n\nCallie: Chief, I was just, um...I was just wondering. I, um, haven't heard anything about my application for attending, so... Richard: Well, Dr. Torres, Dr. Chang's 401(k) took a hit, and he's putting off retirement for another year or two. Callie: So... so wait. You're not giving me the job? Richard: There is no job. Not this year. I'm sorry. I assumed you heard. Callie: Okay, um, Dr. Chang is basically a figurehead. You're clear on that, right? When people want the best, they page me. I have basically been running Dr. Chang's department all year. Richard: Dr. Chang has an impeccable record. Callie: He is a dinosaur! Richard: And so am I! Callie: You're...(scoffs) This is cr--You're gonna regret this. Richard: Dr. Torres-- Callie: No, no, no. I am just...(chuckles) No. I am excellent. I am excellent, and any other hospital would be thrilled to have me. Callie: Yeah I am. I'm a superstar. A superstar with a scalpel. Richard: Torres. Callie: No! Don't say my name. Do not. I am too big a star for you to say my name. I build arms out of nothing, and legs, like God. And when I win the Harper Avery and every other prize there is, you will rue this day, Chief Webber. That's right. I said \"rue\".[109]\n\nCallie: It's not a horse. It's a pegasus and it wants to hold your hand.[110]\n\nArizona: Is that coffee? Callie: Yes it is. And here's the thing--I get that things are going to be different now. And, uh, that's why I'm gonna eat that chicken even though the only thing I want right now is a peanut butter sandwich. Arizona: Great. I'm really happy-- Callie: Oh, I'm not done. If we're gonna do this whole \"everybody get a vote\" thing, there's gonna be a new system. We'll still each get one vote, but also, the baby gets a vote. As I house the baby, I'll be speaking for him-slash-her. And since I'll be pushing this baby out of a very small hole in my body, I'll also get an extra-special vagina vote. So that's, uh, three votes for us, two votes for you guys. Oh, we get the final say. Now I'll be using my many votes to say once a day, I will have one cup of regular coffee, which is perfectly fine according to the studies I've read, at least until I begin breast-feeding. Now anybody want to argue with my extra-special vagina vote?[111]\n\nArizona: No. Mark: No, thank you. Callie: Great.\n\nJackson: There is no thing! Callie: Should we clear Trauma One to remove the giant bug from Avery's ass?[112]\n\nCallie: Is no one making small talk because this is Derek Shepherd on the table? This is intricate work. Small talk is what keeps us awake. Shane: Well, a couple days ago, I helped Dr. Kepner extract a malignant mass from the gluteal area of a female patient. It was an impressively sized mass. Callie: Who's gonna tell Dr. Shepherd he'll never operate again because Ross' idea of gossip is, he saw April Kepner take a lump off an ass?[113]\n\nCallie: You didn’t love her, you just didn’t want to be alone. Or maybe, maybe she was good for your ego, or maybe she made you feel better about your miserable life, but you didn’t love her, because you don’t destroy the person that you love![114]\n\nAppearances [ ]\n\n\n\n", "images": ["https://web.archive.org/web/20220831232327im_/https://static.wikia.nocookie.net/greysanatomy/images/4/47/ArizonaAmputatedleg.png/revision/latest/scale-to-width-down/220?cb=20170310141242", "https://web.archive.org/web/20220831232327im_/https://static.wikia.nocookie.net/greysanatomy/images/6/65/Callie%26Arizona.jpg/revision/latest/scale-to-width-down/220?cb=20130128143103", "https://web.archive.org/web/20220831232327im_/https://static.wikia.nocookie.net/greysanatomy/images/e/e6/Site-logo.png/revision/latest?cb=20210530001617", "https://web.archive.org/web/20220831232327im_/https://static.wikia.nocookie.net/greysanatomy/images/e/e3/7x09CallieTorres.png/revision/latest/scale-to-width-down/201?cb=20130828213508", "https://web.archive.org/web/20220831232327im_/https://static.wikia.nocookie.net/greysanatomy/images/9/91/7x20-8.png/revision/latest/scale-to-width-down/180?cb=20130421141756", "https://web.archive.org/web/20220831232327im_/https://static.wikia.nocookie.net/greysanatomy/images/4/4a/304CallieTorres.png/revision/latest/scale-to-width-down/181?cb=20130416050235", "https://web.archive.org/web/20220831232327im_/https://static.wikia.nocookie.net/greysanatomy/images/3/31/CallieCrashAccident.jpg/revision/latest/scale-to-width-down/220?cb=20170310134952", "https://web.archive.org/web/20220831232327im_/https://vignette.wikia.nocookie.net/club57/images/b/b2/Rainbow-Club-57-cover.jpg/revision/latest?cb=20200522172522", "https://web.archive.org/web/20220831232327im_/https://static.wikia.nocookie.net/greysanatomy/images/d/dd/6x01GeorgeDead-CallieShocked.jpg/revision/latest/scale-to-width-down/220?cb=20090929154106", "https://web.archive.org/web/20220831232327im_/https://static.wikia.nocookie.net/greysanatomy/images/0/00/10x09CallieTorres.png/revision/latest/scale-to-width-down/201?cb=20131115180423", "https://web.archive.org/web/20220831232327im_/https://vignette.wikia.nocookie.net/spotlightsimagestemporary/images/0/0e/UC.JPG/revision/latest?cb=20200923195325", "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D", "https://web.archive.org/web/20220831232327im_/https://static.wikia.nocookie.net/greysanatomy/images/d/d2/12x13-12.jpg/revision/latest?cb=20160413120341", "https://web.archive.org/web/20220831232327im_/https://static.wikia.nocookie.net/greysanatomy/images/2/25/4x17-19.jpg/revision/latest/scale-to-width-down/122?cb=20140904181412", "https://web.archive.org/web/20220831232327im_/https://static.wikia.nocookie.net/greysanatomy/images/b/b8/12x22CallieTorres.png/revision/latest/scale-to-width-down/202?cb=20160512180027", "https://web.archive.org/web/20220831232327im_/https://static.wikia.nocookie.net/greysanatomy/images/3/3c/6x01MarckComfortsCallie.jpg/revision/latest/scale-to-width-down/207?cb=20090929161630", "https://web.archive.org/web/20220831232327im_/https://static.wikia.nocookie.net/greysanatomy/images/f/f8/3x18GeorgeandCallie.jpg/revision/latest?cb=20170214001547", "https://web.archive.org/web/20220831232327im_/https://static.wikia.nocookie.net/greysanatomy/images/1/13/Chief_resident.gif/revision/latest/scale-to-width-down/220?cb=20100602233351", "https://web.archive.org/web/20220831232327im_/https://static.wikia.nocookie.net/greysanatomy/images/f/f7/CallierevealsPenny.png/revision/latest/scale-to-width-down/220?cb=20151016110920", "https://web.archive.org/web/20220831232327im_/https://static.wikia.nocookie.net/greysanatomy/images/d/d2/12x13-12.jpg/revision/latest/scale-to-width-down/350?cb=20160413120341", "https://web.archive.org/web/20220831232327im_/https://vignette.wikia.nocookie.net/letsgoluna/images/c/cd/Erik-Luna-article-2-copy.png/revision/latest?cb=20200327133046", "https://web.archive.org/web/20220831232327im_/https://static.wikia.nocookie.net/greysanatomy/images/8/83/Oncallroom.jpg/revision/latest/scale-to-width-down/220?cb=20090607165255", "https://web.archive.org/web/20220831232327im_/https://static.wikia.nocookie.net/greysanatomy/images/5/57/3x02CallieCaught.png/revision/latest/scale-to-width-down/300?cb=20210422075121", "https://web.archive.org/web/20220831232327im_/https://static.wikia.nocookie.net/greysanatomy/images/6/6d/O%27Callie.jpg/revision/latest/scale-to-width-down/250?cb=20090516114902", "https://web.archive.org/web/20220831232327im_/https://static.wikia.nocookie.net/greysanatomy/images/b/b3/6x02CallieMercyWest.jpg/revision/latest/scale-to-width-down/220?cb=20090929154107", "https://web.archive.org/web/20220831232327im_/https://static.wikia.nocookie.net/greysanatomy/images/c/c9/CallieDance2.jpg/revision/latest/scale-to-width-down/300?cb=20220424052911"], "top_img": "https://web.archive.org/web/20220831232327im_/https://static.wikia.nocookie.net/greysanatomy/images/d/d2/12x13-12.jpg/revision/latest?cb=20160413120341", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20220831232327/https://greysanatomy.fandom.com/wiki/Callie_Torres", "title": "Callie Torres", "meta_data": {"generator": "MediaWiki 1.37.4", "format-detection": "telephone=no", "og": {"type": "article", "site_name": "Grey's Anatomy Universe Wiki", "title": "Callie Torres", "url": "https://web.archive.org/web/20220831232327/https://greysanatomy.fandom.com/wiki/Callie_Torres", "description": "Callie Torres is the former head of orthopedic surgery and board member at Grey Sloan Memorial Hospital. She was married to George O'Malley, but divorced after he cheated on her. She currently resides in New York with ex-wife Arizona Robbins, with whom she has a daughter, Sofia Robbin Sloan Torres. Callie grew up in southern Florida. She was one of two daughters in a wealthy family, a fact she doesn't like to share with significant others. She has stated that \"four years of high school, four yea", "image": "https://web.archive.org/web/20220831232327im_/https://static.wikia.nocookie.net/greysanatomy/images/d/d2/12x13-12.jpg/revision/latest?cb=20160413120341"}, "twitter": {"card": "summary", "site": "@getfandom", "url": "https://web.archive.org/web/20220831232327im_/https://greysanatomy.fandom.com/wiki/Callie_Torres", "title": "Callie Torres | Grey's Anatomy Universe Wiki | Fandom", "description": "Callie Torres is the former head of orthopedic surgery and board member at Grey Sloan Memorial Hospital. She was married to George O'Malley, but divorced after he cheated on her. She currently..."}, "description": "Callie Torres is the former head of orthopedic surgery and board member at Grey Sloan Memorial Hospital. She was married to George O'Malley, but divorced after he cheated on her. She currently resides in New York with ex-wife Arizona Robbins, with whom she has a daughter, Sofia Robbin Sloan...", "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.25, maximum-scale=5.0", "fb": {"app_id": 112328095453510}}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}