{"url": "http://www.nbcnews.com/politics/first-read/impeachment-talk-becomes-cynical-game-n168436", "text": "Impeachment talk becomes a cynical game\n\nOn Friday, a top White House aide said it was possible Republicans could impeach President Obama if he decided to take executive action on immigration. Days later, on Tuesday, House Speaker John Boehner fired back at this impeachment chatter: “Listen, it’s all a scam started by Democrats at the White House.” But let’s be honest here: Both sides -- Democrats and Republicans -- believe the impeachment talk is good for motivating their base. The Democratic Congressional Campaign Committee says it’s raked in more than $3 million in online donations since Thursday with solicitations like this one from House Minority Leader Nancy Pelosi (“Boehner is planning a vote to sue the president. The House of Representatives has never sued a sitting President in all of U.S. history. And if they do it, impeachment may very well be the next step”). Democrats also hope the impeachment talk can force a replay of 1998, when the impeachment proceedings against Bill Clinton backfired against the GOP that midterm season. As for Boehner and House Republicans, they’re being disingenuous, too. The GOP base loves the impeachment talk (see Sarah Palin, Allen West, Drudge, and the rhetoric from some sitting House members). Indeed, Boehner’s lawsuit seems intended to tap into that conservative impeachment enthusiasm -- but without going all the way to impeachment. It’s impeachment-lite. The House will vote tonight on that lawsuit against the president, per NBC’s Frank Thorp.\n\nAnd it’s beneath the White House and the speaker\n\nSo both sides are playing this cynical game, turning the midterms into a base election that will be decided by who best motivates their base rather than by trying to fix the country’s problems. (Republicans: “This President is breaking the law!” Democrats: “They want to impeach the president!”) And what’s particularly jarring is that this isn’t taking place on the campaign trail -- but rather from their official capacities at the White House and on Capitol Hill. It’s beneath the White House, and it’s beneath the speaker. And each side can rationalize their actions all they want, but all its doing is reinforcing the decision by MILLIONS of Americans who have chosen not to participate in the political process this year that they made the right decision. The leaders in both parties aren’t taking their frustrations seriously. Instead, leaders in Washington are falling back on base turnout gimmicks.\n\nA Tale of Two Bills\n\nDespite that cynical game of impeachment talk, here is a GOOD story to tell about Washington from earlier in the week: Democrats and Republicans came together to strike a deal on reforming American’s embattled VA hospital system. And what happened was an ACTUAL compromise -- where both sides gave up something to get something. Democrats got increased funding for VA hospitals; Republicans got additional flexibility for veterans to get private care. So that’s on track to become law before Congress departs on its August recess. And a big reason why is that Democrats and Republicans couldn’t afford to look like they were alienating a key constituency -- veterans. And that’s maybe the biggest difference between VA reform (which looks like it will become law) and the emergency relief at the border (which doesn’t). In the case of the border, there just isn’t a major constituency that puts fear into BOTH parties.\n\nHouse GOP “cautiously optimistic” about ability to get 218 votes for border bill\n\nAs for the House GOP’s $659 million border bill, NBC’s Frank Thorp reports that House GOP aides are “cautiously optimistic that the border supplemental can pass with Republican votes, and expect a handful of moderate Democrats to support the measure as well. Leadership is still in the process of whipping the bill, going from member to member during votes trying to quell any concerns they may have. But it was clear that leadership was trying to nip conservative's concerns in the bud Tuesday when Boehner released a statement unequivocally stating that if the Senate tried to add the Gang of Eight comprehensive immigration reform bill to the supplemental, it would hit a ‘brick wall’ in the House.” Then again, it’s truly remarkable that the House GOP leadership has to fight tooth and nail for a bill that has ZERO chance of becoming reality. To expend political capital internally to make a point, welcome to Washington, circa 2014.\n\nLatest on the Highway Trust Fund standoff\n\nMeanwhile, here’s the latest on the Highway Trust Fund legislation: “The Senate Tuesday approved a short-term patch to keep funds flowing to highway projects through Dec. 19, but Speaker John A. Boehner has already promised to strip the Senate provisions and send the House-passed bill right back,” Roll Call reports. “After the Senate’s version of the bill passed 79 to 18 — Finance Committee ranking member Orrin Hatch, R-Utah called it a ‘free vote…because the House is going to send this right back, they are going to strip everything out — after they’ve left’ for the August recess.” So just when it looked like Congress would AVOID a highway trust fund “cliff” of sorts, the threat is back. And this is Senate vs. House stuff -- not necessarily, GOP vs Dem business.\n\nEconomy grew by 4% in 2nd quarter\n\nMore good economic news: “After a dismal winter, the U.S. economy sprang back to life in the April-June quarter, growing at a fast 4 percent annual rate on the strength of higher consumer and business spending,” the AP says. “The Commerce Department says the second-quarter rebound followed a sharp 2.1 percent annualized drop in economic activity in the January-March quarter. That figure was revised up from a previous estimate of a 2.9 percent decline.”\n\nTom Steyer’s TV campaign begins -- against Joni Ernst in Iowa\n\nThe millions of dollars in TV ads that liberal environmentalist Tom Steyer plans to spend in the midterms is beginning -- with the release of NextGen Climate’s multi-million-dollar campaign in Iowa against GOP Senate nominee Joni Ernst. This new TV ad charges that Ernst is tied to Republican special interests. NextGen Climate says this is the first of a series in ads hitting Ernst, and it’s a $2.6 million buy over five weeks in Des Moines, Cedar Rapids, and the Quad Cities markets. A little background on Steyer’s involvement this midterm cycle: A Super PAC funded by Democratic environmentalist billionaire Tom Steyer has announced it will spend as much as $100 million this election season attacking Republicans in seven key states who it says are climate-science ‘deniers,’ elevating the issue of climate change in these contests. Steyer’s group, NextGen Climate, says it will target Govs. Rick Scott of Florida, Paul LePage of Maine and Tom Corbett of Pennsylvania, as well as GOP Senate candidates Cory Gardner in Colorado, Joni Ernst in Iowa, Terri Lynn Land in Michigan and Scott Brown in New Hampshire.\n\nPoll: Kasich still leading in Ohio\n\nA new Quinnipiac poll finds Ohio Gov. John Kasich (R) leading Democratic challenger Ed Fitzgerald by 12 points among registered voters in Ohio’s gubernatorial race, 48%-36%. Of all the 2010 GOP victors, it’s mildly surprising that Kasich now among safer of these incumbents sitting in a swing state. He’s still not out of the woods, but he’s stronger today than any strategist in either party would have thought two years ago.\n\nDueling coal ads in West Virginia\n\nDays after Natalie Tennant (D) released a new TV ad in West Virginia’s Senate race hitting her party’s own president on coal, Republican opponent Shelley Moore Capito is out with her own TV ad on coal -- and trying to one up Tennant. Capito responded immediately, and doesn’t seem to be taking any chances here\n\nThe bombshell in the Bob McDonnell trial\n\nIf you followed former Virginia Gov. Bob McDonnell’s rise and fall -- like we have over the past five years -- this was a stunning story. And talk about a twist: “Lawyers for former Virginia first lady Maureen McDonnell say her marriage had broken down by the time a former CEO began to lavish gifts on her -- and he became her ‘favorite playmate.’ The bombshell was revealed Tuesday during opening statements in a corruption trial against Maureen and her husband, former Virginia Gov. Bob McDonnell,” NBC Washington’s Julie Carey reported. More: “The couple arrived separately at federal court over the past two days, a sharp contrast to the united front they showed when they were indicted 10 days after he left office in January. Before the trial, they often held hands in the courthouse. Maureen's defense attorney, Bill Burck, said during opening statements Tuesday that not only was the couple's marriage a wreck, but that Maureen developed feelings for Williams as he took her on a designer clothes shopping trip and showered her with attention. ‘You'd even hear she had a crush on on him. Unfortunately, unlike the other man in her life, Jonnie Williams paid attention to her,’ Burck said.” Here’s what’s particularly stunning: The defense is trying to PROVE a romantic relationship; usually, it’s the other way around.\n\nClick here to sign up for First Read emails. Text FIRST to 622639, to sign up for First Read alerts to your mobile phone. Check us out on Facebook and also on Twitter. Follow us @chucktodd, @mmurraypolitics, @carrienbcnews", "images": ["https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2014_31/591821/whitehouse.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-760x428,f_auto,q_auto:best/MSNBC/Components/Video/__NEW/f_dc_whimpeach_140729.jpg"], "top_img": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2014_31/591821/whitehouse.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.nbcnews.com/politics/first-read/impeachment-talk-becomes-cynical-game-n168436", "title": "Impeachment Talk Becomes a Cynical Game", "meta_data": {"msapplication-config": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/nbcnews/all-other-sizes-PNG.ico/browserconfig.xml", "robots": "max-image-preview:large", "fb": {"app_id": 10150138890205613, "pages": 1508175089456029}, "og": {"site_name": "NBC News", "locale": "en_US", "url": "https://www.nbcnews.com/politics/first-read/impeachment-talk-becomes-cynical-game-n168436", "title": "Impeachment Talk Becomes a Cynical Game", "description": "Both sides -- Democrats and Republicans -- believe the impeachment talk is good for motivating their base.", "image": {"identifier": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2014_31/591821/whitehouse.jpg", "secure_url": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2014_31/591821/whitehouse.jpg", "type": "image/jpeg", "width": 1200, "height": 630}, "type": "article"}, "twitter": {"site": "@NBCNews", "creator": "NBCNews", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1024-512,f_auto,q_auto:best/newscms/2014_31/591821/whitehouse.jpg", "title": "Impeachment Talk Becomes a Cynical Game", "description": "Both sides -- Democrats and Republicans -- believe the impeachment talk is good for motivating their base.", "card": "summary_large_image"}, "viewport": "width=device-width, initial-scale=1, user-scalable=yes", "description": "Both sides -- Democrats and Republicans -- believe the impeachment talk is good for motivating their base.", "branch": {"deeplink": {"title": "Impeachment Talk Becomes a Cynical Game", "description": "Both sides -- Democrats and Republicans -- believe the impeachment talk is good for motivating their base.", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2014_31/591821/whitehouse.jpg", "type": "article", "unibrow": "First Read"}}, "article": {"opinion": "false", "content_tier": "free", "published": "Wed Jul 30 2014 13:14:31 GMT+0000 (UTC)", "modified": "Thu Jun 11 2015 00:00:00 GMT+0000 (UTC)"}, "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_social_share_1024x768_scale,f_auto,q_auto:best/newscms/2014_31/591821/whitehouse.jpg", "next-head-count": 104}, "movies": [], "publish_date": 1406726071.0, "source": "http://www.nbcnews.com", "summary": ""}