{"url": "https://www.cosmopolitan.com/uk/entertainment/a18229047/sam-smith-13-reasons-why-brandon-flynn-relationship-timeline/", "text": "4th October 2017: Sam Smith and Brandon Flynn are spotted smooching in the street, and it's glorious. The pair are snapped walking arm-in-arm through New York’s West Village, before Sam, 25, leans in for a kiss with 24-year-old Brandon.\n\nThis is the first we've heard that Sam and 13 Reasons Why's Brandon are a couple, as only the month before, Sam had spoken about being \"insanely single.\"\n\n24th October 2017: 'Stay With Me' singer Sam confirms his relationship with Brandon!\n\nHe was chatting to The Ellen Degeneres Show when host Ellen playfully grilled the star by asking: \"You're not single right now anymore, right?\"\n\nSam replied: \"No, I'm not, which is crazy. \"\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nHe continued: \"It's weird bringing out an album and not being single. Because when I brought out In the Lonely Hour I was so lonely. But now I'm singing songs about another guy.\n\n\"I'm quite happy, so it's quite weird.\"\n\n\n\n9th November 2017: Sam reveals that he definitely sees children in his future. So we obviously get carried away and assume he means with Brandon...\n\nHe told The Sun: \"I want kids so bad. I just feel it's nature's way of reminding you that it's not about you. It makes you not selfish.\"\n\n21st December 2017: Brandon makes it Instagram official with this great photo. Nice unicorns...\n\n1st January 2018: Brandon says Sam is one of his favourite things from 2017 in this Instagram gallery, and it's all too much for us to deal with.\n\n3rd January 2018: Sam tells V magazine: \"I'm in a relationship right now and for the first time, I think I deserve to be happy.\"\n\nHe adds: \"I'm actually asking myself if I'm going to be writing some happy love songs soon!\"\n\n30th January 2018: Sam and Brandon go to the Grammys together and seem to have the greatest night of their lives.\n\nGetty Images\n\nGetty Images\n\n9th March 2018: Sam finally breaks his silence on THOSE kissing photos.\n\nBACKGRID\n\nSpeaking on Radio 1, he said: “It was a joke - as a joke we were attacking each other.\n\n“We were just waiting outside the shop while my sister got cigarettes. I was just joking.\n\n“I was literally licking his eyeballs. It’s horrendous. I’m going to have to do something crazy to top it.'\n\nHe then compared Brandon, 24, to The Little Mermaid’s Ursula, saying: “He looks like Ursula sucking the voice out of Ariel. It’s so embarrassing.”\n\nlol.\n\n15th April 2018: Sam has been hanging out with Brandon's family. Serious much?!\n\n17th April 2018: Sam and Brandon are on holiday together! Sam posts an adorable photo of the pair of them at Niagara Falls, and now all we want is to be at Niagara Falls too. Wah.\n\n28th June 2018: Sam and Brandon reportedly split up after nine months together. The Sun reported that they just couldn't make it work with their busy schedules.\n\nA source close to Sam said: \"Sam and Brandon had a real whirlwind romance. They really fell for each other.\n\n\n\n“But they are both so busy with their careers and unfortunately things just haven’t worked out.\n\n“Sam is obviously devastated. This is the most significant relationship he has ever had.\n\nSam has now deleted all photos of him and Brandon from his Instagram. And Brandon has deleted nearly all of them except this one:", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/sam-smith-brandon-flynn-1510227312.jpg?resize=480:*", "https://www.cosmopolitan.com/sites/cosmopolitan/assets/images/logos/ipso_regulated_hires.png", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/sam-smith-brandon-flynn-1510227312.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/sam-smith-brandon-flynn-1510227312.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "keywords": [], "authors": ["Anna Lewis", "News Editor", "Anna Lewis Is The News Editor At Delish Uk", "Which Means She S Always Either Writing About Food", "Cooking Food Or Eating Food."], "canonical_link": "https://www.cosmopolitan.com/uk/entertainment/a18229047/sam-smith-13-reasons-why-brandon-flynn-relationship-timeline/", "title": "Sam Smith and Brandon Flynn: a relationship timeline", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=6", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "Sam Smith and 13 Reasons Why's Brandon Flynn have reportedly split up", "description": "And they've both deleted a bunch of photos of each other from their Instagrams", "url": "https://www.cosmopolitan.com/uk/entertainment/a18229047/sam-smith-13-reasons-why-brandon-flynn-relationship-timeline/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/sam-smith-brandon-flynn-1510227312.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 211620818858710}, "article": {"publisher": "https://facebook.com/cosmopolitanuk", "modified_time": "2018-06-28T09:34:17Z", "published_time": "2018-06-28T09:30:00Z", "section": "Entertainment", "opinion": "false"}, "twitter": {"site": "@CosmopolitanUK", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/sam-smith-brandon-flynn-1510227312.jpg?crop=1.00xw:1.00xh;0,0&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Sam Smith and Brandon Flynn: a relationship timeline", "description": "Sam Smith and Brandon Flynn have called time on their relationship. So let's a take a look back at their nine months together.", "keywords": "sam smith, brandon flynn, 13 reasons why, sam smith brandon flynn, sam smith 13 reasons why, brandon flynn 13 reasons why, 13 reasons why justin, sam smith brits, sam smith boyfriend, sam smith brandon flynn relationship, sam smith brandon flynn instagram, sam smith brandon flynn niagara falls, sma msith brandon flynn split", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/sam-smith-brandon-flynn-1510227312.jpg?crop=0.492xw:0.984xh;0,0.0163xh&resize=320:*", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "sailthru.contenttype": "standard-article", "sailthru.tags": "Entertainment,entertainment", "sailthru.date": "2018-06-28T09:30:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/sam-smith-brandon-flynn-1510227312.jpg?crop=1.00xw:1.00xh;0,0", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/sam-smith-brandon-flynn-1510227312.jpg?crop=0.492xw:0.984xh;0,0.0163xh", "sailthru.socialtitle": "Sam Smith and 13 Reasons Why's Brandon Flynn have reportedly split up", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1530178200.0, "source": "https://www.cosmopolitan.com", "summary": ""}