{"url": "https://www.independent.co.uk/life-style/love-sex/pippa-middleton-james-matthews-wedding-marriage-royal-ceremony-church-a7746276.html", "text": "Stay ahead of the trend in fashion and beyond with our free weekly Lifestyle Edit newsletter Stay ahead of the trend in fashion and beyond with our free weekly Lifestyle Edit newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nLifestyle Edit email {{ #verifyErrors }}{{ message }}{{ /verifyErrors }}{{ ^verifyErrors }}Something went wrong. Please try again later{{ /verifyErrors }}\n\nPippa Middleton is today marrying her fiancé, James Matthews.\n\nThe younger sister of the Duchess of Cambridge had been friends with 41-year-old hedge fund manager Matthews for ten years before he proposed in July 2016 (after a year of dating) with a 3.5 carat engagement ring.\n\nThe wedding, taking place at St Mark's Church in the Berkshire village of Englefield, has been dubbed an “almost royal wedding” - there’s a Snapchat filter marking the occasion and #Pippaswedding is trending on both sides of the Atlantic.\n\nPippa Middleton marries James Matthews Show all 8 1 /8 Pippa Middleton marries James Matthews Pippa Middleton marries James Matthews Pippa Middleton with her father Michael AFP/Getty Pippa Middleton marries James Matthews She wore a bespoke Giles Deacon dress AFP/Getty Images Pippa Middleton marries James Matthews The Duke of Cambridge and Prince Harry were in attendance AFP/Getty Pippa Middleton marries James Matthews As were Roger Federer and his wife Mirka AFP/Getty Images Pippa Middleton marries James Matthews Brother of the groom and former Made In Chelsea star Spencer Matthews AFP/Getty Images Pippa Middleton marries James Matthews The Duchess of Cambridge with the pageboys and bridesmaids AFP/Getty Images Pippa Middleton marries James Matthews Prince George and Princess Charlotte AFP/Getty Images Pippa Middleton marries James Matthews The newlyweds AFP/Getty Images\n\nMany high-profile guests are in attendance: The Duke and Duchess of Cambridge, Prince Harry, former Made In Chelsea star, brother to the groom and best man Spencer Matthews, Princesses Beatrice and Eugenie, and Roger Federer and his wife Mirka.\n\nPrince George and Princess Charlotte have also stolen the hearts of the public with their outfits as two of the pageboys and bridesmaids.\n\nThe bride arrived with her father Michael at around 11.15am in an open-top classic car. She’s wearing a bespoke Giles Deacon dress, designed to create the impression of being seamless.\n\n“I was thrilled to work with Pippa on her wedding dress,” Deacon said. “The dress is constructed with a cap sleeve, high neckline and features a corseted bodice with draping to the front and a heart-shaped detail at the back.\n\n“The bespoke silk cotton lace was hand appliqued to create an illusion of the dress having 'no seams'. The lace bodice is embroidered with pearl detailing over an organza and tulle underskirt, which has layer upon layer to enable a floor sweeping movement.\n\n“It's a privilege to show the craftsmanship that my team produces in London and a real testament to Pippa's support of British fashion.”\n\n33-year-old party planner Pippa accessorised her dress with a Stephen Jones veil, a Maidenhair Fern tiara and Manolo Blahnik ivory satin shoes.\n\nAround 100 guests were expected and hundreds of royal fans have descended on the quiet village for the occasion, some travelling from the other side of the world especially.\n\nMatthews was previously considered one of the most eligible bachelors in the world, and is reportedly worth £2 billion.\n\nComparisons have also been made between Pippa and her sister Kate’s husbands, some pointing out the ‘old money’ vs ‘new money’ distinction.\n\nOn social media, many people are fascinated with the proceedings.\n\nNot everyone is convinced all the fuss is necessary though.\n\nRoyal or not, no doubt people will continue be interested in the marriage of the couple.", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/05/20/12/gettyimages-685746046.jpg?quality=75&width=982&height=726&auto=webp", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/05/20/12/gettyimages-685746046.jpg?quality=75&width=1200&auto=webp"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/05/20/12/gettyimages-685746046.jpg?quality=75&width=1200&auto=webp", "keywords": [], "authors": ["Rachel Hosie"], "canonical_link": "https://www.independent.co.uk/life-style/love-sex/pippa-middleton-james-matthews-wedding-marriage-royal-ceremony-church-a7746276.html", "title": "Pippa Middleton marries financier fiancé James Matthews", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, user-scalable=no, minimum-scale=1.0, maximum-scale=1.0", "description": "She wore a bespoke Giles Deacon dress", "theme-color": "#EC1A2E", "amp-google-client-id-api": "googleanalytics", "robots": "max-image-preview:large", "fb": {"app_id": 235586169789578, "pages": "https://www.facebook.com/TheIndependentOnline"}, "category": "Love & Sex", "sitename": "The Independent", "page path": "/life-style/love-sex", "page type": "Article", "adPageType": "Article Page", "og": {"locale": "en_GB", "updated_time": "2017-05-20T12:10:51.000Z", "site_name": "The Independent", "title": "Everyone is loving the pictures of a party planner marrying a hedge fund manager", "url": "https://www.independent.co.uk/life-style/love-sex/pippa-middleton-james-matthews-wedding-marriage-royal-ceremony-church-a7746276.html", "type": "article", "description": "She wore a bespoke Giles Deacon dress", "image": {"identifier": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/05/20/12/gettyimages-685746046.jpg?quality=75&width=1200&auto=webp", "secure_url": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/05/20/12/gettyimages-685746046.jpg?quality=75&width=1200&auto=webp"}}, "article": {"published_time": "2017-05-20T12:10:51.000Z", "modified_time": "2017-05-20T12:10:51.000Z", "section": "Lifestyle", "subsection": "Love & Sex", "author_name": "Rachel Hosie", "content_type": "story", "word_count": 442, "image_count": 1, "embed_count": 8, "video_count": 0, "internal_link_count": 0, "external_link_count": 0}, "date": "2017-05-20T12:10:51.000Z", "google-signin-client_id": "329250492844-uqochn2f1j5ljkshuap5gc7qphf1refj.apps.googleusercontent.com", "twitter": {"title": "Everyone is loving the pictures of a party planner marrying a hedge fund manager", "site": "@Independent", "card": "summary_large_image", "description": "She wore a bespoke Giles Deacon dress", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/05/20/12/gettyimages-685746046.jpg?quality=75&width=1200&auto=webp"}, "keywords": "Wedding,royalty,Pippa Middleton,Internal"}, "movies": [], "publish_date": 1495282251.0, "source": "https://www.independent.co.uk", "summary": ""}