{"url": "https://en.wikipedia.org/wiki/Jada_Pinkett_Smith", "text": "American actress (born 1971)\n\nPinkett Smith. In this article, the surname is\n\nJada Koren Pinkett Smith ( ; née Pinkett; born September 18, 1971)[1] is an American actress and talk show host. She is co-host of the Facebook Watch talk show Red Table Talk, for which she has received a Daytime Emmy Award. Time named her one of the 100 most influential people in the world in 2021.[2]\n\nPinkett Smith landed her big break on the sitcom A Different World in 1991. She went on to star in films such as Menace II Society (1993), The Nutty Professor (1996), Set It Off (1996), and Scream 2 (1997) before her prominent contributions to The Matrix Reloaded (2003), The Matrix Revolutions (2003) and the animated Madagascar films. She returned to television with starring roles on Hawthorne (2009–2011) and Gotham (2014–2017). Her other acting roles include Magic Mike XXL (2015), Bad Moms (2016), Girls Trip (2017), and The Matrix Resurrections (2021).\n\nIn 2002, Pinkett Smith launched a music career as the lead singer and songwriter for the heavy metal band Wicked Wisdom. In 2004, she published a children's book, Girls Hold Up This World, which landed at number two on The New York Times Best Seller list.[3] Along with her husband Will Smith, she has a production company and has producing credits in films, documentaries, and television series. In 2010, she earned a nomination for the Tony Award for Best Musical as a producer for the Broadway musical Fela!.\n\nEarly life [ edit ]\n\nBorn in Baltimore, Maryland, Jada Koren Pinkett was named after her mother's favorite soap opera actress, Jada Rowland.[1] She is of Jamaican and Bajan descent on her mother's side and African-American descent on her father's side. Her parents are Adrienne Banfield-Norris, the head nurse of a Baltimore inner-city clinic, and Robsol Pinkett Jr., who ran a construction company. Banfield-Norris became pregnant in high school; the couple married but divorced after several months.[4][5] Pinkett was raised by her mother and grandmother, Marion Martin Banfield, a Jamaican-born social worker.[6][7] \"My grandmother was a doer who wanted to create a better community and add beauty to the world,\" she said.[8] Banfield noticed her granddaughter's passion for the performing arts and enrolled her in piano, tap dance, and ballet lessons.[9]\n\nPinkett attended the Baltimore School for the Arts, where she met and became close friends with her classmate, rapper Tupac Shakur. When Pinkett met Shakur, she was a drug dealer.[10] Her mother had been a heroin addict.[11][12] She majored in dance and theatre and graduated in 1989.[13] After graduation, she spent a year at the North Carolina School of the Arts.[14]\n\nFilm and television career [ edit ]\n\nEarly career (1990–1996) [ edit ]\n\nPinkett began her acting career in 1990, when she starred in an episode of True Colors. She received guest roles in television shows such as Doogie Howser, M.D. (1991) and 21 Jump Street (1991), and earned a role on comedian Bill Cosby's NBC television sitcom A Different World in 1991, as college freshman Lena James.[4]\n\nIn 1993, Pinkett appeared in her first film, Menace II Society. She was cast as Ronnie, a single mother, due to a recommendation from her friend Tupac Shakur, who was set to appear in the film before he was fired.[15] Pinkett considered dropping out of the film after Shakur's departure but he convinced her to keep the role.[15]\n\nIn 1994, Pinkett acted with Keenen Ivory Wayans in the action and comedy film A Low Down Dirty Shame. She described her character, Peaches, as \"raw\" with \"major attitude\",[16] and her acting garnered positive reviews. The New York Times wrote, \"Ms. Pinkett, whose performance is as sassy and sizzling as a Salt-N-Pepa recording, walks away with the movie.\"[17] In 1994, she also starred as a title character in Doug McHenry's romantic drama Jason's Lyric, opposite Allen Payne. In his positive review of the film, Roger Ebert wrote, \"[Payne] has powerful chemistry with the enigmatic, teasing, tender character played by Pinkett; they really seem to like one another, which is not a feeling you always pick up in screen romances.\"[18] That year, she also had a role in the romantic comedy-drama The Inkwell.\n\nIn 1995, Pinkett played a convict on work release in the horror film Demon Knight.[19] According to Larenz Tate, Pinkett was set to appear in the film Dead Presidents (1995), but she turned down the role of Delilah due to her loyalty to Shakur.[20][21] The Hughes brothers directed the film and they had fired Shakur from Menace II Society.[22]\n\nPinkett also began directing music videos in 1995. She directed the music video \"I'm Going Down\" by girl group Y? N-Vee.[23] She also directed the music video \"How Many Times\" by Gerald Levert and appeared in the video.[24] \"It was reported that Pinkett would direct the music video for Shakur's song \"Can U Get Away\" but another single was released instead.[25] Pinkett came up with the concept for his \"California Love\" music video which she had intended to direct, but she removed herself from the project.[26] In 1996, Pinkett directed the music video \"Keep On, Keepin' On\" by MC Lyte Feat. Xscape.\n\nRise to prominence (1996–2002) [ edit ]\n\nPinkett starred with actor and comedian Eddie Murphy in the 1996 remake of The Nutty Professor, portraying the love interest of a kindhearted university professor who is morbidly obese. The film was a commercial success, earning $25 million in its first weekend in North America and eventually $274 million worldwide.[27][28] She also had a lead role in Set It Off (1996), a crime drama about four women who rob banks to escape from poverty, opposite Queen Latifah, Vivica A. Fox, and Kimberly Elise. Her acting in the film was noted in the San Francisco Chronicle, which wrote that she was \"the one to watch\".[29] Budgeted at $9 million, Set It Off made $41 million globally.[30]\n\nIn 1997, Pinkett had a cameo role in Scream 2 as a college student who is brutally murdered in front of hundreds of filmgoers. The film made more than $100 million at the North American box office. In 1998, she played a news reporter in the thriller Return to Paradise, with Joaquin Phoenix and Vince Vaughn, and took on the title role of an extroverted woman, alongside Tommy Davidson, in the comedy Woo. While favorably reviewing her performance in Woo, Derek Armstrong of AllMovie wrote that the script was \"formulaic\" and \"not much of a vehicle for its impish starlet\".[31] She next starred in Spike Lee's film Bamboozled (2000) as a personal assistant to the main character, played by Damon Wayans. Although the film met with mediocre reviews, it won the National Board of Review's Freedom of Expression Award.[32]\n\nPinkett Smith circa 2001\n\nIn 2001, Pinkett Smith portrayed a loud-mouthed wife in the moderately successful comedy Kingdom Come, with LL Cool J, Vivica A. Fox, Anthony Anderson, Toni Braxton, and Whoopi Goldberg.[33] In the biographical sports drama Ali (2001), she played Sonji Roi, the first wife of boxer Muhammad Ali, opposite Will Smith. While she loved the final product, she initially did not think she was the right person for the role: \"I felt like because we were a couple off screen, for people to see us together on the screen in a movie like this, would take people out of the movie, that people would see Will and Jada there—they wouldn't see Ali and Sonji\".[34]\n\nCommercial success (2003–2017) [ edit ]\n\nPerhaps her best-known role to date is the part of human rebel Niobe in the films The Matrix Reloaded (2003) and The Matrix Revolutions (2003), sequels to 1999's The Matrix, and the related video game Enter The Matrix (2003). The character was written specifically with Pinkett Smith in mind.[35] Directly after she filmed her scenes for Ali, Pinkett Smith flew to Australia to work on the Matrix sequels. The sequels earned over $91 million and $48 million during their North American opening weekends, respectively.[36][37]\n\nIn the neonoir thriller Collateral (2004), alongside Jamie Foxx and Tom Cruise, Pinkett Smith played a U.S. Justice Department prosecutor and the target of a contract killer. The film was a critical and commercial success, grossing $217.8 million worldwide.[38] She voiced Gloria, a strong, confident, but sweet hippopotamus, in the computer animated film Madagascar (2005).[39] Tom McGrath, one of the film's directors, said they found all these traits in her voice when they listened to her.[40] Despite a mixed response from critics,[41] the film was a commercial success, earning $532 million worldwide,[42] and becoming one of the biggest hits of 2005.[43] In 2007, she played the wife of an affluent dentist in the drama Reign Over Me, with Adam Sandler, Don Cheadle, Liv Tyler, and Donald Sutherland. Entertainment Weekly called the film a \"strange, black-and-blue therapeutic drama equally mottled with likable good intentions and agitating clumsiness\", and found Pinkett Smith \"graceful\" in it.[44]\n\nIn 2008, Pinkett Smith took on the role of a lesbian author in the all-female comedy The Women, opposite Meg Ryan, Annette Bening, Debra Messing, and Eva Mendes.[45] Though a commercial success, The Women was panned by critics, with Pinkett Smith earning a nomination for the Golden Raspberry Award for Worst Actress for her performance. Her directorial debut was the drama The Human Contract (also 2008); she also wrote, and starred as the sister of a successful but unhappy businessman, with Paz Vega and Idris Elba. It debuted at the Cannes Film Festival in May 2008.[46] The success of Madagascar led Pinkett Smith to return to the role of Gloria in the 2008 sequel Madagascar: Escape 2 Africa, which earned US$603 million at the international box office.[47]\n\nPinkett Smith was an executive producer and starred as a Chief Nursing Officer in the TNT medical drama Hawthorne, which premiered on June 16, 2009.[48] USA Today remarked: \"Pinkett Smith's Hawthorne is tired in every sense of the word, and she's not the only one. Every character and event falls under the category of painfully predictable\".[49] Hawthorne ended on August 16, 2011, after three seasons. In 2010, she earned a nomination for the Tony Award for Best Musical as a producer for the Broadway musical Fela!.[50] While she reprised the voice role of Gloria in Madagascar 3: Europe's Most Wanted (2012), which made over US$746 million,[51] she also voiced the character in the NBC Christmas special Merry Madagascar (2009) and the direct-to-DVD film Madly Madagascar (2013).[citation needed]\n\nBeginning in 2014, Pinkett Smith starred in the first season of the FOX crime drama Gotham, as Gotham City gangster Fish Mooney.[52][53] She returned, recurrently, in the second and third seasons of the series. In 2015, she starred in the comedy Magic Mike XXL, as the manager of a star stripper club, opposite Channing Tatum and Joe Manganiello. The film made US$122.5 million worldwide.[54] She starred with Mila Kunis, Kristen Bell and Christina Applegate in the comedy Bad Moms (2016), as the sidekick of a domineering parent-teacher association head.[55] It received mixed reviews from critics, who praised the cast and humor, though did not feel it could \"take full advantage of its assets\".[56] The film, nevertheless, earned more than US$183.9 million.[57]\n\nPinkett Smith next took on the role of a nurse and uptight mom in the comedy Girls Trip (2017), alongside Regina Hall, Queen Latifah and Tiffany Haddish. The film was chosen by Time magazine as one of its top ten films of 2017,[58] and grossed US$140 million worldwide, including over US$100 million domestically, the first comedy of 2017 to do so.[59] In July 2017, Pinkett Smith appeared at the Essence Festival where, on the Empowerment Stage, she appeared to talk alongside Queen Latifah.[60] Pinkett Smith spoke highly of the cast reflecting their characters in real life, stating that they are all women who love other women and work to empower each other, a feature that she notes as rare in Hollywood.[61]\n\nLater career (2018–present) [ edit ]\n\nBeginning in May 2018, Pinkett Smith along with her mother Adrienne Banfield-Norri and her daughter Williow Smith have hosted the Facebook Watch talk show Red Table Talk, which focuses on a wide range of topics.[62] In a positive review, USA Today's Maeve McDermott praised the series for its \"insightful guests, no-holds-barred topics and Smith's magnetic hosting presence\".[63] In 2021, Time magazine named Pinkett Smith and her co-hosts to its list of the 100 most influential people in the world; they were chosen by comedian Tiffany Haddish.[2] In 2021, Red Table Talk won an Daytime Emmy Award in the outstanding informative talk show category.[64]\n\nMusical career [ edit ]\n\nI listened to all kinds of metal as a kid. Metallica, Guns N' Roses. I would always look at Axl Rose and say, \"Why aren't there any chicks out there doing this now?\" I always wanted an opportunity to get out there and rock out. —Pinkett Smith on why she created Wicked Wisdom[65]\n\nUnder the name Jada Koren, Pinkett Smith formed the metal band Wicked Wisdom in 2002.[65] The band consists of Pinkett Smith performing lead vocals, Pocket Honore (guitar, vocals), Cameron \"Wirm\" Graves (guitar, keyboard, vocals), and Rio (bass, vocals). The band is managed by James Lassiter and Miguel Melendez of Overbrook Entertainment, a company co-founded by Pinkett Smith's husband Will Smith.[66]\n\nThe band's self-titled debut album was released on February 21, 2006, by Pinkett Smith's production company 100% Womon and Suburban Noize Records. Will Smith served as the project's executive producer.[67] The album made it to Billboard's Top Heatseekers chart, and peaked at number 44 during the week of March 11, 2006. AllMusic reviewer Alex Henderson said of the album, \"[Pinkett Smith] shows herself to be an expressive, commanding singer\" and that \"[Wicked Wisdom] shows considerable promise\".[68] The band promoted the album in 2006, touring with heavy metal band Sevendust.[69]\n\nOnyx Hotel Tour [ edit ]\n\nWicked Wisdom landed a slot on Britney Spears' Onyx Hotel Tour in 2004, one of the year's highest-profile tours. The band opened for Spears for eight dates in April and May 2004, during the European leg of the tour.[70]\n\nOzzfest 2005 [ edit ]\n\nIn 2005, Sharon Osbourne saw Wicked Wisdom perform at a small nightclub in Los Angeles. She said: \"I was blown away. When you see and hear Jada with her band it's apparent that she has nothing but love and respect for this genre of music\".[66] In May 2005, organizers announced Wicked Wisdom would perform on the second stage of 2005's Ozzfest.[71] Aware of questions about the band's addition to Ozzfest, Pinkett Smith said, \"I'm not here asking for any favors. You've got to show and prove. And not every audience is going to go for it.\"[72] Wicked Wisdom's guitarist Pocket Honore said while early dates of the tour were rocky, \"once word got out that we weren't a joke, people started coming out and by the sixth or seventh gig we were on fire\".[65] Pinkett Smith agreed, saying, \"After seven dates within the Ozzfest tour, the whole attitude of it started to turn around once the word of mouth started getting out.\"[69]\n\nOther ventures [ edit ]\n\nBusiness [ edit ]\n\nAfter opening her music company 100% Women Productions,[48] Pinkett Smith created her own fashion label, Maja, in 1994. The clothing line features women's T-shirts and dresses embellished with the slogan \"Sister Power\", sold primarily through small catalogs.[9]\n\nIn 2003, Pinkett Smith and Smith helped to create the television series All of Us, which aired on UPN/The CW. Pinkett Smith published her first children's book, Girls Hold Up This World, in 2004. \"I wrote the book for Willow and for her friends and for all the little girls in the world who need affirmation about being female in this pretty much masculine world. I really tried to capture different sides of femininity. I want girls in the world to feel powerful, to know they have the power to change the world in any way they wish.\"[73]\n\nIn 2005, Pinkett Smith became one of many celebrities to invest a combined total of US$10 million in Carol's Daughter, a line of beauty products created by Lisa Price.[74] She became a spokesman for the beauty line, and said, \"To be a part of another African American woman's dream was just priceless to me.\"[75]\n\nIn 2015, the Smith couple were among the founding investors of an energy storage company.[76][77]\n\nPhilanthropy [ edit ]\n\nIn 1997, Pinkett Smith was the emcee of the Million Woman March in Philadelphia.[78][79][80]\n\nTogether with Will, Pinkett Smith has created the Will and Jada Smith Family Foundation in Baltimore, Maryland, a charity that focuses on youth in urban inner cities and family support. Her aunt, Karen Banfield Evans, is the foundation's executive director. The charity was awarded the David Angell Humanitarian Award by The American Screenwriters Association (ASA) in 2006. The Will and Jada Smith Family Foundation has provided grants to non-profit organizations such as YouthBuild,[81] and Pinkett Smith has made personal donations to organizations such as Capital K-9s.[82]\n\nAfter meeting Tom Cruise during the filming of Collateral (2004), Pinkett Smith and Will Smith donated $20,000 to the Hollywood Education and Literacy Program (HELP), Scientology's basis for homeschooling.[83][84]\n\nIn 2006, Pinkett Smith donated $1 million to her high school alma mater, the Baltimore School for the Arts, and dedicated the new theater to her classmate and close friend Tupac Shakur.[85][86]\n\nWhen Pinkett Smith's aunt, Karen Banfield Evans, was diagnosed with lupus,[87] the Will and Jada Smith Family Foundation, in association with the Lupus Foundation of America and Maybelline, held the first annual \"Butterflies Over Hollywood\" event on September 29, 2007, at the El Rey Theatre in Los Angeles. The event raised funds for LFA public and professional educational programs.[88] The Will and Jada Smith Family Foundation was presented with an award in 2007 at the 4th Annual Lupus Foundation of America Awards.[89]\n\nIn 2012, on behalf of PETA, Pinkett Smith wrote a letter to Baltimore's mayor, asking that the visiting Ringling Brothers Circus \"comply with Baltimore's absolute prohibition of the use of devices such as bullhooks\" and not harm the elephants.[90] In 2013, she appeared in a video clip for Gucci's \"Chime for Change\" campaign that aims to raise funds and awareness of women's issues globally.[91]\n\nPersonal life [ edit ]\n\nIn the early 1990s, Pinkett Smith dated former basketball player Grant Hill while he attended Duke University.[92][93]\n\nPinkett Smith had a close friendship with rapper Tupac Shakur which was formed when they were both attending the Baltimore School for the Arts.[94] She appeared in his music videos \"Keep Ya Head Up\" (1993) and \"Temptations\" (1995).[95][96] She also came up with the concept for his \"California Love\" (1995) music video and had intended to direct it, but she removed herself from the project.[26] In 1995, she contributed $100,000 towards Shakur's bail as he awaited an appeal on his sexual abuse conviction.[97] Pinkett Smith stated in the 2003 documentary Tupac: Resurrection that he was \"one of my best friends. He was like a brother. It was beyond friendship for us. The type of relationship we had, you only get that once in a lifetime.\"[98]\n\nIn 2018, Pinkett Smith said that she had been diagnosed with the autoimmune disease alopecia areata.[99][100][101] Despite having many medical tests, she said she has not been able to find the cause of her alopecia, and that she suspects it might be stress.[99] She shared a video on her Instagram account in December 2021 showing herself with a shaved head, saying; \"Now at this point, I can only laugh\" (...) \"Mama's gonna have to take it down to the scalp so nobody thinks she got brain surgery or something. Me and this alopecia are going to be friends... period!\".[102]\n\nFamily [ edit ]\n\nPinkett Smith with her husband and children at the 2009 Nobel Peace Prize Concert\n\nPinkett Smith has remained close to her mother Adrienne Banfield-Norris,[103] and said, \"A mother and daughter's relationship is usually the most honest, and we are so close.\" She also added: \"[My mother] understood what I wanted and never stood in my way.\"[104] She participated as the maid of honor in Banfield-Norris's 1998 wedding to Paul Jones, a telecommunications executive.[105]\n\nShe met Will Smith in 1994 on the set of Smith's television show The Fresh Prince of Bel-Air, when she auditioned for the role of his character's girlfriend, Lisa Wilkes. She was considered too short and the role went to actress Nia Long. Will and Jada later began dating after he separated from Sheree Fletcher. Prior to this, Will had developed an attraction to Jada, but did not act on it. Jada eventually moved from her hometown of Baltimore to California to be with him.[106] On December 31, 1997, while Jada was three months pregnant,[106] about 100 guests attended their wedding at The Cloisters, near her hometown of Baltimore, Maryland.[107] Regarding her marriage, Jada said that they are \"private people\" and told one interviewer, \"I will throw my career away before I let it break up our marriage.[108] I made it clear to Will. I'd throw it away completely\".[109] The couple produce films through their joint production company, Overbrook Entertainment and Westbrook Inc.[110][106]\n\nThey have two children, Jaden Christopher Syre Smith (born 1998),[107][111] and Willow Camille Reign Smith (born 2000). She is also the stepmother of Trey Smith, her husband's son from a previous marriage.[7][107] Will commented in 2008 on their parenting styles: \"We're not strict but we definitely believe it's a very important component for rearing children. It creates safety for them. They understand that they need guidance.\"[112] The family resides in a 27,000 square foot (2,500 m2) home, on 100 acres (40 ha), in Malibu.[104] In May 2014, Moisés Arias, who was 20 at the time, was photographed shirtless in a bed with then-13-year-old Willow Smith.[113] The photo triggered an investigation into the family by the Los Angeles County Department of Children and Family Services.[114]\n\nIn April 2013, Pinkett Smith caused many to believe she and her husband were in an open marriage after stating in an interview: \"I've always told Will, 'You can do whatever you want as long as you can look at yourself in the mirror and be okay'. Because at the end of the day, Will is his own man. I'm here as his partner, but he is his own man\". However, she denied such, clarifying her statements on Facebook, writing: \"Open marriage? The statement I made in regard to, 'Will can do whatever he wants', has illuminated the need to discuss the relationship between trust and love and how they co-exist\".[106]\n\nIn June 2020, singer and rapper August Alsina—a friend of Pinkett Smith's son Jaden—said that he and Pinkett Smith had been involved in an adulterous affair in 2016, when he was 23 years old and she was 44.[115] He also claimed that the affair happened with Will Smith's permission.[115] A spokesman for Pinkett Smith denied the claims, saying they were \"absolutely not true\".[115] On July 10, during an episode of Red Table Talk featuring her husband, Pinkett Smith confirmed an \"entanglement\" with Alsina during their separation, although not with his permission.[116] Pinkett Smith said that Alsina misconstrued it as permission because she and her husband were \"separated amicably\". She eventually got back with her husband after breaking off the relationship with Alsina and stated she has not spoken to him since.[117]\n\nAfter Pinkett Smith's use of the word \"entanglement\" went viral on the Internet, Alsina released a collaboration titled \"Entanglements\" with rapper Rick Ross on July 19, 2020, singing lines such as \"the definition of entanglement is when you get tangled in the sheets\" and \"you left your man just to fuck with me and break his heart\".[118] In 2021, Will Smith stated that Pinkett Smith \"never believed in conventional marriage\" and that both of them have had sexual relationships outside of their marriage.[119]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nVideo games [ edit ]\n\nYear Title Role Notes 2003 Enter the Matrix Niobe Live-action cutscenes, voice, and motion-capture performance\n\nAwards and nominations [ edit ]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/94/Symbol_support_vote.svg/19px-Symbol_support_vote.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Jada_Pinkett_Smith_1997.jpg/170px-Jada_Pinkett_Smith_1997.jpg", "https://upload.wikimedia.org/wikipedia/commons/b/bd/Jada_Pinkett_Smith_at_NY_PaleyFest_2014_for_Gotham.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Jada_Pinkett_Smith_at_NY_PaleyFest_2014_for_Gotham.jpg/220px-Jada_Pinkett_Smith_at_NY_PaleyFest_2014_for_Gotham.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/Pinkett-Smith.jpg/170px-Pinkett-Smith.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Nobel_Peace_Price_Concert_2009_Will_Smith_and_Jada_Pinkett_Smith_with_children2.jpg/170px-Nobel_Peace_Price_Concert_2009_Will_Smith_and_Jada_Pinkett_Smith_with_children2.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Jada_Pinkett_Smith_at_NY_PaleyFest_2014_for_Gotham.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jada_Pinkett_Smith", "title": "Jada Pinkett Smith", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Jada_Pinkett_Smith_at_NY_PaleyFest_2014_for_Gotham.jpg/640px-Jada_Pinkett_Smith_at_NY_PaleyFest_2014_for_Gotham.jpg", "width": 640, "height": 960}, "title": "Jada Pinkett Smith - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}