{"url": "https://popculture.com/celebrity/2018/04/02/kardashian-family-not-surprised-by-blac-chyna-six-flags-fight/", "text": "The Kardashian family is reportedly not shocked by Blac Chyna's fist fight at Six Flags on Sunday evening, as the famous family continues their legal feud with Rob Kardashian's ex.\n\nChyna was filmed by multiple witnesses attempting to fight someone at Six Flags Magic Mountain in Valencia, California on Easter Sunday. The videos show her swinging her children's ride-on toy car around, trying to hit someone with it. At various points in the altercation, her friends hold her back. A source close to the Kardashians told E! News that they were not at all surprised to hear that Chyna had blown up.\n\n\"Nobody is surprised to see what happened,\" the insider said. \"They are just glad Dream was not in the stroller and was safe. It's concerning that Chyna behaves this way with Dream around, but this is typical Chyna behavior.\"\n\n\"It's a shame that she can lose control of herself and rage so easily,\" the insider continued. \"The family hopes that she will be better for Dream and will learn from this.\"\n\nRob Kardashian has previously alleged that Chyna had assaulted him and even tried to strangle him with an iPhone charger. She was accused of going on a rampage, destroying walls and fixtures in the house Kardashian was renting from his sister, Kylie Jenner. Chyna later said that all of her actions were in self defense.\n\nThey told Blac Chyna that her boyfriend wasn’t old enough to ride the rides & she set it off at Six Flags. pic.twitter.com/oTSA1PTI2i — ronald isley (@yoyotrav) April 2, 2018\n\n\n\nA representative from Six Flags Magic Mountain spoke to the outlet as well.\n\n\"Last evening, a verbal and physical altercation broke out among two visiting groups,\" the repsaid. \"Our security department responded immediately and both groups were escorted out of the park. The safety and security of our guests and employees is our top priority and we have zero tolerance for this type of behavior.\"\n\nChyna took to her Instagram story, defending her actions without denying any of the rumors about the fight.\n\n\"Being famous is hard enough dealing with scrutiny but when someone feels comfortable to come and touch your child it's a whole other story,\" she wrote. \"I do not condone violence nor am I a violent person but shout out to all of the amazing mothers out there that will protect their children at all cost. Love, King and Dreams Mommy.\"\n\n(Photo: Instagram / @blacchyna)\n\nAn 18-year-old girl claiming to be the one on the other end of the fight emerged on Twitter. In a series of now-deleted tweets, she described the whole confrontation from her perspective.\n\n\"[S]ooo I was having a good little time and I see black chyna's beautiful baby right?\" wrote the woman. \"So I'm like awwwww like omg this baby is so cute (not even knowing this was her f—ing baby) so I'm guessing it was the nanny but she rolled the baby towards me right?\"\n\n\"So a lady comes up to me and she's like 'omg was that you black Chyna was talking about?'\" she went on. \"'She said she was goonna whoop yo a—' so now I'm in tears like lmaoooo for what wtf this b— think cause she black chyna she won't get slapped.\"\n\n\"So y'all know me ..... I just slap TF when I say THEE DOGGGGGGG S— I slapped the dogggg s— out hg,\" the woman continued. \"So when I did her f—ing boyfriend start socking on me and my sister LMAOOOOOO LIKE REALLY SOCKING ON US.\"\n\n\"But I mean I had a blast,\" the user confessed with a shrug emoji. \"I just slapped the s— outa black chyna and fought her boyfriend and all her lil friends but this n— was really socking on us he's really a b— period.\"", "images": ["https://media.popculture.com/2018/04/blac-chyna-instagram-story-touch-child-20030733.jpeg", "https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200"], "top_img": "https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/celebrity/news/kardashian-family-not-surprised-by-blac-chyna-six-flags-fight/", "title": "Kardashian Family 'Not Surprised' by Blac Chyna Six Flags Fight", "meta_data": {"description": "The Kardashian family is reportedly not shocked by Blac Chyna's fist fight at Six Flags on Sunday [...]", "keywords": "Twitter,Viral Video,Viral Videos,Blac Chyna,Dream Kardashian,Keeping Up With the Kardashians,Assault", "news_keywords": "Twitter,Viral Video,Viral Videos,Blac Chyna,Dream Kardashian,Keeping Up With the Kardashians,Assault", "robots": "index, follow, max-image-preview:large", "twitter": {"card": "summary_large_image", "site": "PopCulture", "creator": "PopCulture", "title": "Kardashian Family 'Not Surprised' by Blac Chyna Six Flags Fight", "description": "The Kardashian family is reportedly not shocked by Blac Chyna's fist fight at Six Flags on Sunday [...]", "image": "https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200"}, "og": {"title": "Kardashian Family 'Not Surprised' by Blac Chyna Six Flags Fight", "type": "article", "url": "https://popculture.com/celebrity/news/kardashian-family-not-surprised-by-blac-chyna-six-flags-fight/", "image": {"identifier": "https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200", "width": 640, "height": 320}, "site_name": "Celebrity", "description": "The Kardashian family is reportedly not shocked by Blac Chyna's fist fight at Six Flags on Sunday [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#263240", "apple-mobile-web-app-capable": "yes"}, "movies": [], "publish_date": 1522623600.0, "source": "https://popculture.com", "summary": ""}