{"url": "https://hype.my/2018/151188/jamie-dornan-glued-wig-penis/", "text": "Jamie Dornan has become a sex symbol since taking on the role of Christian Grey in the “Fifty Shades” franchise. While many would assume he’s always been successful with the ladies, that was not the case when he was younger.\n\nDuring his recent appearance at the Graham Norton Show, the 35-year-old actor revealed that he went through great lengths to impress girls in order to “get lucky”. Just like many others, Dornan too had a typical awkward teenager story. Although one might say, his embarrassing story is more R-rated than romantic.\n\nIn “one of the worst stories in my locker”, Dornan recalled, “I was quite small and wasn’t hairy at all – I was 15 and looked seven. On one particular day, I was in an amateur drama play and was going to a party after. For my role, I had bits of a black wig glued to my face for a beard and I decided to keep it for the party so I would look older. I also decided to cut up the rest of wig and glue it to my private parts just in case I got lucky“.\n\nThat reckless move backfired on the young Brit when it came time to remove the improvised pubic hair. “I didn’t get lucky and removing the bits of wig ripped out the very small amount of natural hair I had down there. It was a physically and emotionally painful experience!”\n\nDuring the interview, the handsome star also shared about the “awful” scene to shoot in “Fifty Shades Freed“. In the movie trailer, we see the shirtless Christian Grey in blue shorts walking out of the beach in France. “That was horrendous. If they just tilt the camera down, that whole moment was awful,” Dornan told the host.\n\nADVERTISEMENT\n\n“We had the beach, semi-sort of closed off, but actually there were loads of people that we didn’t have control over.They want me to be sexy coming out of the water. But it’s not a sand beach! It’s one of those wee pebble beaches. Literally, you cannot look cool running out of the water,” he added.\n\nWatch his confessions here:\n\nHonestly, his awkwardness just makes adorable ;)\n\nSources: Just Jared, Daily Mail.", "images": ["https://hype.my/wp-content/uploads/2022/10/HEADER.png", "https://hype.my/wp-content/uploads/2018/01/jamie-dornan-.png", "https://hype.my/wp-content/themes/hype-v2/assets/img/jeg-empty.png", "https://hype.my/wp-content/uploads/2022/10/STICKY-MENU.png", "https://hype.my/wp-content/uploads/2022/10/MOBILE-1.png", "https://hype.my/wp-content/uploads/2018/01/jamie-dornan-2017.jpg", "https://hype.my/wp-content/uploads/2021/02/Hype-Logo-White-275.png"], "top_img": "https://hype.my/wp-content/uploads/2018/01/jamie-dornan-.png", "keywords": [], "authors": [], "canonical_link": "https://hype.my/2018/151188/jamie-dornan-glued-wig-penis/", "title": "Jamie Dornan Once Glued A Wig To His Penis To Impress Girls", "meta_data": {"viewport": "width=device-width, initial-scale=1, user-scalable=yes", "robots": "index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1", "fb": {"app_id": 1297733647011590, "pages": 145834762205864}, "og": {"locale": "en_US", "type": "article", "title": "Jamie Dornan Once Glued A Wig To His Penis To Impress Girls", "description": "Jamie Dornan has become a sex symbol since taking on the role of Christian Grey in the “Fifty Shades” franchise. While many would assume he’s always been successful with the ladies, that was not the case when he was younger. During his recent appearance at the Graham Norton Show, the 35-year-old actor revealed that he went […]", "url": "https://hype.my/2018/151188/jamie-dornan-glued-wig-penis/", "site_name": "Hype Malaysia", "image": {"identifier": "https://hype.my/wp-content/uploads/2018/01/jamie-dornan-.png", "width": 800, "height": 450}}, "article": {"author": "https://www.facebook.com/HypeMalaysia/", "published_time": "2018-01-22T08:46:30+00:00"}, "twitter": {"card": "summary_large_image", "creator": "@https://twitter.com/HypeMY", "label1": "Written by", "data1": "Justin", "label2": "Est. reading time", "data2": "2 minutes"}, "generator": "Powered by WPBakery Page Builder - drag and drop page builder for WordPress.", "msapplication-TileImage": "https://hype.my/wp-content/uploads/2017/07/cropped-hype-ico3-270x270.png"}, "movies": ["https://www.youtube.com/embed/iqQXwovaUJQ?feature=oembed", "https://www.youtube.com/embed/1wZRBJ7PAAs?feature=oembed"], "publish_date": 1516610790.0, "source": "https://hype.my", "summary": ""}