{"url": "https://www.wanttoknow.info/newsstories-0-10000", "text": "News Stories Excerpts of Key News Stories in Major Media\n\nNote: This comprehensive list of news stories is usually updated once a week. Explore our full index to revealing excerpts of key major media news stories on several dozen engaging topics. And don't miss amazing excerpts from 20 of the most revealing news articles ever published.\n\nHundreds of prison and jail deaths go uncounted by the federal government, report finds\n\n2022-09-20, NBC News\n\nPosted: 2022-10-02 22:14:51\n\nThe Justice Department is failing to adequately and efficiently collect data about deaths in state prisons and local jails, with at least 990 incidents going uncounted by the federal government in fiscal year 2021 alone, according to a newly released bipartisan Senate report. The report's findings were the focus of a hearing ... which took the federal Bureau of Prisons and then-Director Michael Carvajal to task this summer over accusations of unsanitary and unsafe conditions at a penitentiary in Atlanta and other allegations of misconduct across the federal prison system. Now, the conclusion of a 10-month investigation into how the Justice Department oversees the federal Death in Custody Reporting Act accuses the agency of missing death counts that are readily available on public websites and in arrest-related databases. The law requires that states and federal agencies report in-custody death information to the attorney general. The information was due at the end of 2016, but the Senate report says it won't be completed until 2024. \"DOJ's failure to implement DCRA has deprived Congress and the American public of information about who is dying in custody and why,\" the report says. \"This information is critical to improve transparency in prisons and jails, identifying trends in custodial deaths that may warrant corrective action – such as failure to provide adequate medical care, mental health services, or safeguard prisoners from violence – and identifying specific facilities with outlying death rates.\"\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on corruption in government and in the prison system from reliable major media sources.\n\nThey Were Entitled to Free Care. Hospitals Hounded Them to Pay.\n\n2022-09-24, New York Times\n\nPosted: 2022-10-02 22:13:09\n\nIn 2018, senior executives at one of the country's largest nonprofit hospital chains, Providence, were frustrated. They were spending hundreds of millions of dollars providing free health care to patients. It was eating into their bottom line. The executives, led by Providence's chief financial officer at the time, devised a solution: a program called Rev-Up. Rev-Up provided Providence's employees with a detailed playbook for wringing money out of patients – even those who were supposed to receive free care because of their low incomes, a New York Times investigation found. If patients did not pay, Providence sent debt collectors to pursue them. More than half the nation's roughly 5,000 hospitals are nonprofits like Providence. They enjoy lucrative tax exemptions; Providence avoids more than $1 billion a year in taxes. In exchange, the Internal Revenue Service requires them to provide services, such as free care for the poor, that benefit the communities in which they operate. But in recent decades, many of the hospitals have become virtually indistinguishable from for-profit companies, adopting an unrelenting focus on the bottom line and straying from their traditional charitable missions. And, as Providence illustrates, some hospital systems have not only reduced their emphasis on providing free care to the poor but also developed elaborate systems to convert needy patients into sources of revenue. The result ... is that thousands of poor patients were saddled with debts that they never should have owed.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on corporate corruption and health from reliable major media sources.\n\nDid a Famous Doctor's Covid Shot Make His Cancer Worse?\n\n2022-09-24, The Atlantic\n\nPosted: 2022-10-02 22:11:31\n\nLast year, Michel Goldman, a Belgian immunologist and one of Europe's best-known champions of medical research, walked into a clinic near his house, rolled up his sleeve, and had a booster shot delivered to his arm. Michel was having night sweats, and he could feel swollen lymph nodes in his neck. It was cancer of the immune system–lymphoma. Michel understood this meant he'd soon be immunocompromised by chemotherapy. He had just a narrow window of opportunity in which his body would respond in full to COVID vaccination. Having received two doses of Pfizer the prior spring, Michel quickly went to get his third. Within a few days, though, Michel was somehow feeling even worse. His night sweats got much more intense, and he found himself–quite out of character–taking afternoon naps. Most worryingly, his lymph nodes were even more swollen than before. Scans ... showed a brand-new barrage of cancer lesions. It looked like someone had set off fireworks inside Michel's body. More than that, the lesions were now prominent on both sides of the body, with new clusters blooming in Michel's right armpit in particular, and along the right side of his neck. When Michel's hematologist saw the scan, she told him to report directly to the nearest hospital pharmacy. He'd have to start on steroid pills right away. Such a swift progression for lymphoma in just three weeks was highly unusual. As he followed these instructions, Michel felt a gnawing worry that his COVID booster shot had somehow made him sicker.\n\nNote: A study of this case was published in Frontiers in Medicine. For more along these lines, see concise summaries of deeply revealing news articles on coronavirus vaccines from reliable major media sources.\n\nRevealed: How scientists who dismissed Wuhan lab theory are linked to Chinese researchers\n\n2021-09-10, The Telegraph (One of the UK's Leading Newspapers)\n\nPosted: 2022-10-02 22:09:29\n\nAll but one scientist who penned a letter in The Lancet dismissing the possibility that coronavirus could have come from a lab in Wuhan were linked to its Chinese researchers, their colleagues or funders, a Telegraph investigation can reveal. The influential journal published a letter on March 7 last year from 27 scientists in which they stated that they \"strongly condemned conspiracy theories\" surrounding Covid-19. It effectively shut down scientific debate into whether coronavirus was manipulated or leaked from a lab in Wuhan. Researchers who tried to investigate a link but were stonewalled and branded conspiracy theorists called it an \"extreme cover-up\". Despite declaring no conflicts of interest at the time, it has since emerged that the letter was orchestrated by British zoologist Peter Daszak, president of the US-based EcoHealth Alliance, which funded research at the Wuhan Institute of Virology, where the leak was suspected. However, The Telegraph can disclose that 26 of the 27 scientists listed in the letter had connections to the Chinese lab, through researchers and funders closely linked to Wuhan. While Mr Daszak eventually declared his involvement in the EcoHealth Alliance, he failed to mention that five other signatories also worked for the organisation. A further three of the signatories were from Britain's Wellcome Trust, which has funded work at the Wuhan Institute of Virology in the past. Out of 27 signatories, only Prof Ronald Corley, of Boston University, appears to have no links to funders or researchers.\n\nNote: Watch an excellent interview in which a former EcoHealth Alliance VP turned whistleblower reveals blatant law-breaking and lies committed by Peter Daszak and EcoHealth Alliance. For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus from reliable major media sources.\n\nUK scientist with links to Wuhan lab 'recuses himself' from inquiry into Covid origins\n\n2021-06-22, The Telegraph (One of the UK's Leading Newspapers)\n\nPosted: 2022-10-02 22:07:58\n\nA controversial British-born scientist has recused himself from an inquiry into the origins of the Covid pandemic. Dr Peter Daszak, president of the US-based EcoHealth Alliance, has \"recused himself\" from the inquiry by leading medical journal the Lancet after he failed to declare ties to the Wuhan Laboratory of Virology, which was conducting research into coronavirus in bats. Dr Daszak was also a member of the WHO investigation into the source of the pandemic that issued its report earlier this year. In February 2020 Dr Daszak, who has strongly condemned any suggestion that the virus came from the institute, co-authored a letter published in the Lancet with 26 other experts \"in support of scientists, public health professionals and medical professionals combating Covid-19 in China\". Dr Daszak has worked closely with Shi Zhengli, known as \"batwoman\", who leads work into bat viruses at the institute. And the EcoHealth Alliance, which has been a world leader in the hunt for animal viruses, has channeled some of its funding towards the institute, which involved collecting samples from bats and people at risk of infection from bat viruses. That grant was stopped in April 2020 on the orders of then president Donald Trump but was reinstated later in the year. Before he recused himself from the Lancet commission, which is supported by the United Nations Sustainable Development Solutions Network, Dr Daszak was one of a 12-strong international team looking at the origins of the pandemic.\n\nNote: Watch an excellent interview in which a former EcoHealth Alliance VP turned whistleblower reveals blatant law-breaking and lies committed by Peter Daszak and EcoHealth Alliance. For more along these lines, see concise summaries of deeply revealing news articles on the coronavirus from reliable major media sources.\n\nFormer NSA Chief Signed Deal to Train Saudi Hackers Months Before Jamal Khashoggi's Murder\n\n2022-09-26, The Intercept\n\nPosted: 2022-10-02 22:06:18\n\nIn early 2018, former National Security Agency chief Keith Alexander worked out a deal with Saudi Crown Prince Mohammed bin Salman and the cyber institute led by one of his closest aides, Saud al-Qahtani, to help the Saudi ruler train the next generation of Saudi hackers. The agreement between IronNet, founded by Alexander, and the cyber school ... faced no scrutiny for its association with Qahtani, after the brutal killing of Jamal Khashoggi he reportedly orchestrated just a few months later. Alexander officially inked the deal with the Prince Mohammed bin Salman College of Cyber Security, Artificial Intelligence, and Advanced Technologies – a school set up to train Saudi cyber intelligence agents – at a signing ceremony in Washington, D.C.. Saudi Arabia's agreement with IronNet was part of a host of moves to step up its cyber capabilities, coinciding with a campaign against the kingdom's critics abroad. Khashoggi, then a Washington Post columnist and prominent Salman critic, received a series of threatening messages, including one from Qahtani, warning him to remain silent. Khashoggi, whose family and close associates discovered listening malware electronically implanted on their smartphones, was then lured to the Saudi Embassy in Istanbul. It was there that a team dispatched by Qahtani detained and tortured the Saudi government critic. Qahtani, according to reports, beamed in through Skype to insult Khashoggi during the ordeal. Khashoggi was then dismembered with a bone saw.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on intelligence agency corruption from reliable major media sources.\n\nPsilocybin as mental health therapy? Here's what I found.\n\n2022-09-05, Washington Post\n\nPosted: 2022-10-02 22:04:26\n\nA few weeks ago, I mentioned to a friend that I was interested in learning more about psychedelics, especially how they might help me with depression and anxiety. That's a broad category of plant medicines including psilocybin (\"magic\") mushrooms, MDMA (ecstasy), DMT (Dimitri or the Businessman's Trip), ketamine (\"special K\") and some others. My friend told me he'd recently taken his first \"trip,\" which he described as life-changing. I asked him – a real estate developer living in Northern California, married with kids – why he decided to try a psychedelic substance. \"My work felt increasingly stale and meaningless,\" he explained to me over a beer. \"Despite a massive amount of reflection and coaching around how to break the rut, I felt as though I was still off track.\" When I confided my interest in psychedelics to a few other friends, several said they had tried the drugs and experienced several benefits: from easing anxiety to finding spiritual insights to combating depression and, among some with cancer, helping to reduce the fear of dying. They are hardly outliers. According to a new YouGovAmerica study, \"one in four Americans say they've tried at least one psychedelic drug,\" amounting to some 72 million U.S. adults. When I queried my psychiatrist about participating to help improve my mental health, he was supportive, with two caveats: Do it with a trained therapist or guide, and do your best to ensure that the substance is what it's said to be.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on the healing potentials of mind-altering drugs from reliable major media sources.\n\nGhostwriters Used in Vioxx Studies, Article Says\n\n2008-04-15, New York Times\n\nPosted: 2022-10-02 22:02:33\n\nThe drug maker Merck drafted dozens of research studies for a best-selling drug, then lined up prestigious doctors to put their names on the reports before publication, according to an article ... in a leading medical journal. The article, based on documents unearthed in lawsuits over the pain drug Vioxx, provides a rare, detailed look in the industry practice of ghostwriting medical research studies that are then published in academic journals. The article cited one draft of a Vioxx research study that was still in want of a big-name researcher, identifying the lead writer only as \"External author?\" Vioxx was a best-selling drug before Merck pulled it from the market in 2004 over evidence linking it to heart attacks. Last fall the company agreed to a $4.85 billion settlement to resolve tens of thousands of lawsuits. The lead author of Wednesday's article, Dr. Joseph S. Ross ... said a close look at the Merck documents raised broad questions about the validity of much of the drug industry's published research, because the ghostwriting practice appears to be widespread. \"It almost calls into question all legitimate research that's been conducted by the pharmaceutical industry with the academic physician,\" Dr. Ross said, whose article ... was published Wednesday in JAMA, the journal of the American Medical Association. Although the role of pharmaceutical companies in influencing medical journal articles has been questioned before, the Merck documents provided the most comprehensive look at the magnitude of the practice.\n\nNote: Vioxx may have been responsible for 500,000 premature deaths. For more along these lines, see concise summaries of deeply revealing news articles on Big Pharma corruption from reliable major media sources.\n\nThe Unexpected Power of Random Acts of Kindness\n\n2022-09-02, New York Times\n\nPosted: 2022-10-02 22:00:37\n\nIn late August, Erin Alexander, 57, sat in the parking lot of a Target store in Fairfield, Calif., and wept. Her sister-in-law had recently died, and Ms. Alexander was having a hard day. A barista working at the Starbucks inside the Target was too. The espresso machine had broken down and she was clearly stressed. Ms. Alexander – who'd stopped crying and gone inside for some caffeine – smiled, ordered an iced green tea, and told her to hang in there. After picking up her order, she noticed a message on the cup: \"Erin,\" the barista had scrawled next to a heart, \"your soul is golden.\" The warmth of that small and unexpected gesture, from a stranger ... moved her deeply. New findings, published in the Journal of Experimental Psychology in August, corroborate just how powerful experiences like Ms. Alexander's can be. Researchers found that people who perform a random act of kindness tend to underestimate how much the recipient will appreciate it. And they believe that miscalculation could hold many of us back from doing nice things for others more often. \"People tend to think that what they are giving is kind of little, maybe it's relatively inconsequential,\" [study co-author Amit] Kumar said. \"But recipients are less likely to think along those lines. They consider the gesture to be significantly more meaningful because they are also thinking about the fact that someone did something nice for them.\" What skills and talents do you already have? And how can you turn that into an offering for other people?\"\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nA little good goes an unexpectedly long way: Underestimating the positive impact of kindness on recipients\n\n2022-08-18, Journal of Experimental Psychology\n\nPosted: 2022-10-02 21:59:06\n\nPerforming random acts of kindness increases happiness in both givers and receivers, but we find that givers systematically undervalue their positive impact on recipients. In both field and laboratory settings (Experiments 1a through 2b), those performing an act of kindness reported how positive they expected recipients would feel and recipients reported how they actually felt. From giving away a cup of hot chocolate in a park to giving away a gift in the lab, those performing a random act of kindness consistently underestimated how positive their recipients would feel, thinking their act was of less value than recipients perceived it to be. Givers' miscalibrated expectations are driven partly by an egocentric bias in evaluations of the act itself (Experiment 3). Whereas recipients' positive reactions are enhanced by the warmth conveyed in a kind act, givers' expectations are relatively insensitive to the warmth conveyed in their action. Underestimating the positive impact of a random act of kindness also leads givers to underestimate the behavioral consequences their prosociality will produce in recipients through indirect reciprocity (Experiment 4). We suggest that givers' miscalibrated expectations matter because they can create a barrier to engaging in prosocial actions more often in everyday life (Experiments 5a and 5b), which may result in people missing out on opportunities to enhance both their own and others' well-being.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nThe Surprise of Reaching Out: Appreciated More than We Think\n\n2022-06-13, Journal of Personality and Social Psychology\n\nPosted: 2022-10-02 21:57:32\n\nPeople are fundamentally social beings and enjoy connecting with others, sometimes reaching out to others–whether simply to say hello and to check in on how others are doing with a brief message, or to send a small gift to show that one is thinking of the other person. Yet despite the importance and enjoyment of social connection, do people accurately understand how much other people value being reached out to by someone in their social circle? Across a series of pre-registered experiments, we document a robust underestimation of how much other people appreciate being reached out to. We find evidence compatible with an account wherein one reason this underestimation of appreciation occurs is because responders (vs. initiators) are more focused on their feelings of surprise at being reached out to; such a focus on feelings of surprise in turn predicts greater appreciation. We further identify process-consistent moderators of the underestimation of reach-out appreciation, finding that it is magnified when the reach-out context is more surprising: when it occurs within a surprising (vs. unsurprising) context for the recipient and when it occurs between more socially distant (vs. socially close) others. Altogether, this research thus identifies when and why we underestimate how much other people appreciate us reaching out to them, implicating a heightened focus on feelings of surprise as one underlying explanation.\n\nNote: You can read the full study at this link. Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nPentagon opens sweeping review of clandestine psychological operations\n\n2022-09-19, Washington Post\n\nPosted: 2022-09-26 22:12:26\n\nThe Pentagon has ordered a sweeping audit of how it conducts clandestine information warfare after major social media companies identified and took offline fake accounts suspected of being run by the U.S. military in violation of the platforms' rules. The takedowns in recent years by Twitter and Facebook of more than 150 bogus personas and media sites created in the United States was disclosed last month by internet researchers Graphika and the Stanford Internet Observatory. U.S. Central Command is among those whose activities are facing scrutiny. Some [takedowns] involved posts from the summer that advanced anti-Russia narratives. One fake account posted an inflammatory tweet claiming that relatives of deceased Afghan refugees had reported bodies being returned from Iran with missing organs. The tweet linked to a video that was part of an article posted on a U.S.-military affiliated website. In 2020 Facebook disabled fictitious personas created by Centcom to counter disinformation spread by China suggesting the coronavirus responsible for covid-19 was created at a U.S. Army lab in Fort Detrick, Md.. The pseudo profiles ... were used to amplify truthful information from the U.S. Centers for Disease Control and Prevention. Congress in late 2019 passed a law affirming that the military could conduct operations in the \"information environment\" to defend the United States. The measure, known as Section 1631, allows the military to carry out clandestine psychological operations.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on intelligence agency corruption and media manipulation from reliable sources.\n\nFat Leonard: Malaysian businessman linked to US Navy scandal escapes\n\n2022-09-06, BBC News\n\nPosted: 2022-09-26 22:10:44\n\nA Malaysian businessman at the heart of the worst scandal to hit the US Navy in modern times has escaped house arrest, the US Marshals Service has said. Leonard Glenn Francis, known as \"Fat Leonard\", cut his ankle bracelet off before disappearing from his home in San Diego, California. His escape comes three weeks before he was due for sentencing after pleading guilty in 2015 to bribing senior US Navy officers. Francis had been the key figure behind a sprawling multi-million dollar bribery scheme that he operated by way of his Singapore-based company which serviced the US Navy's Pacific fleet. The US justice department describes it as a colossal fraud that cost the navy tens of millions of dollars. Francis ... used his influence with senior commanders to secure lucrative military contracts often involving the Indo-Pacific based 7th Fleet - the largest of the Navy's forward deployed fleets. Prosecutors say he overcharged the navy to the tune of $35m (Ł30m) and plied navy officers with cash, gourmet meals, expensive cigars, rare liquor and wild sex parties in upscale hotels to procure the contracts. Arrested in 2013 he pled guilty in 2015 to offering $500,000 in bribes to US Navy officers in an attempt to funnel official work towards his shipyards. Dozens of navy officials have been ensnared in the case, with four officers having been found guilty, and 28 others, including contractors and naval officials, having pleaded guilty so far. Francis [was] placed under house arrest while acting as a co-operating witness.\n\nNote: At one point, Francis bribed officials to redirect an aircraft carrier. For more along these lines, see concise summaries of deeply revealing news articles on military corruption from reliable major media sources.\n\nRevealed: how UK targeted American civil rights leader in covert campaign\n\n2022-09-13, The Guardian (One of the UK's Leading Newspapers)\n\nPosted: 2022-09-26 22:09:11\n\nThe British government targeted the American civil rights leader Stokely Carmichael and sought to weaken the Black Power movement with covert disinformation campaigns, recently declassified documents have revealed. The effort was the work of a secret unit known as the Information Research Department, based in London and part of the Foreign Office, which created and distributed literature from fake sources as part of a broader effort to destabilise cold war enemies. The effort against Carmichael, a firebrand orator who travelled to west Africa in part to escape harassment by US law enforcement agencies, aimed to portray the prominent Black Power leader as a foreign interloper in Africa who was contemptuous of the inhabitants of the continent. Based mainly in Guinea from July 1969, the 28-year-old activist had became a vocal advocate of socialist, pan-Africanist ideologies, which worried British officials. The IRD was particularly worried by the movement's potential influence in the Caribbean. In 1969, the IRD also created a new fake group: The Organisation of African Students for African Power. This was supposedly based in East Germany and adopted contemporary radical New Left ideas, \"proclaiming a plague on both\" the capitalist west and the Soviet bloc. The IRD felt this provided a better platform to \"damage opponents\" than the dated nationalist approach, while being difficult to trace back to Britain because many similar groups had genuinely sprung up in the late 1960s.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on intelligence agency corruption and the erosion of civil liberties from reliable major media sources.\n\nThe FBI monitored Aretha Franklin's role in the civil rights movement for years\n\n2022-09-12, NPR\n\nPosted: 2022-09-26 22:07:36\n\nThe FBI spent years surveilling the \"Queen of Soul\" Aretha Franklin, trying to gauge how involved she was with the civil rights movement, communism and the Black Power movement, a 270-page document shows. Franklin, who died in 2018, was monitored ahead of several performances and attendances she made for civil rights groups, such as the National Association for the Advancement of Colored People and the Southern Christian Leadership Conference, whose first president was Dr. Martin Luther King, Jr. Informants mentioned Franklin, a Detroit native, in separate memos for possibly appearing at the SCLC's 1967 and 1968 national conventions, in Atlanta and Memphis, respectively. The FBI mailed several copies of \"The Atlanta Voice\" newspaper, which reported on her visit to town, to FBI offices around the country, as well as the U.S. attorney general and the Secret Service. During this time, Franklin was, in fact, actively involved in the civil rights movement through her music and personal connections. She was identified in a 1969 memo titled \"Possible Racial Violence, Urban Areas, Racial Matters\" when, in the year before, Denver concertgoers rioted after she refused to perform at the Red Rocks amphitheater due to not being properly paid. In 1971, memos named the Black Panther Party of Los Angeles and the Boston Young Workers Liberation League as organizations who intended to book her for rallies.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on intelligence agency corruption and the erosion of civil liberties from reliable major media sources.\n\nThe US has a ruling class – and Americans must stand up to it\n\n2022-09-02, The Guardian (One of the UK's Leading Newspapers)\n\nPosted: 2022-09-26 22:05:44\n\nThe most important economic and political issues facing this country are the extraordinary levels of income and wealth inequality, the rapidly growing concentration of ownership, the long-term decline of the American middle class and the evolution of this country into oligarchy. We know how important these issues are because our ruling class works overtime to prevent them from being seriously discussed. We now have more income and wealth inequality than at any time in the last hundred years. Wages ... are lower today than they were almost 50 years ago. When I was a kid growing up, most families were able to be supported by one breadwinner. Now an overwhelming majority of households need two paychecks to survive. Since 1975, there has been a massive redistribution of wealth in America that has gone in exactly the wrong direction. Over the past 47 years, according to the Rand Corporation, $50tn in wealth has been redistributed from the bottom 90% of American society to the top 1%, primarily because a growing percentage of corporate profits has been flowing into the stock portfolios of the wealthy and the powerful. During this terrible pandemic ... some 700 billionaires in America became nearly $2tn richer. Just three Wall Street firms (Blackrock, Vanguard and State Street) control assets of over $20tn and are the major stockholders in 96% of S&P 500 companies. In terms of media, some eight multinational media conglomerates control what we see, hear and read.\n\nNote: The above was written by Sen. Bernie Sanders. For more along these lines, see concise summaries of deeply revealing news articles on income inequality from reliable major media sources.\n\nInsurers force change on police departments long resistant to it\n\n2022-09-14, Washington Post\n\nPosted: 2022-09-26 22:03:29\n\nWhere community activists, use-of-force victims and city officials have failed to persuade police departments to change dangerous and sometimes deadly policing practices, insurers are successfully dictating changes to tactics and policies. The movement is driven by the increasingly large jury awards and settlements that cities and their insurers are paying in police use-of-force cases, especially since the 2020 deaths of Breonna Taylor and George Floyd. Those cases led to settlements of $12 million and $27 million, respectively. Insurance companies are passing the costs – and potential future costs – on to their law enforcement clients. Larger law enforcement agencies – like the Los Angeles Sheriff's Department or the New York Police Department – handle it in different ways, often by creating a special fund to finance settlements or by paying those costs from the county's or city's general fund. This insulates them from external demands by insurers. Departments with a long history of large civil rights settlements have seen their insurance rates shoot up by 200 to 400 percent over the past three years, according to insurance industry and police experts. Even departments with few problems are experiencing rate increases of 30 to 100 percent. Now, insurers also are telling departments that they must change the way they police. A Post investigation in March documented more than $3.2 billion spent over the past decade to resolve nearly 40,000 claims at 25 of the nation's largest police and sheriff's departments.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on police corruption from reliable major media sources.\n\nDemocratic National Committee Edited Bylaws to Let it Overrule Convention\n\n2022-09-14, The Intercept\n\nPosted: 2022-09-26 22:02:01\n\nDuring its summer meeting over the weekend, the Democratic National Committee quietly amended its bylaws, giving the narrower body power to override decisions made by its members at its quadrennial convention. The national committee approved language requiring that it must ratify any bylaw amendments that the convention, a broader body, wants to adopt. \"No such Bylaw or amendment shall be effective unless and until it is subsequently ratified by a vote of the majority of the entire membership of the Democratic National Committee,\" the amended measure from the Rules and Bylaws Committee states. \"These decisions are made to move ultimate power from the members of the convention into the hands of the committee, and that can become a dangerous precedent,\" Nevada Democratic Party Chair Judith Whitmer [said]. \"These seem to us as increasingly anti-democratic decisions.\" The amendment removes the authority over DNC decisions from the national convention, which includes thousands of members, and places it instead with the smaller national committee of just under 500. Democratic National Committee Member Jessica Chambers ... called the DNC \"the least democratic organization that I'm involved with,\" in part because paid staff whip votes against members. The recent attempt to suppress dissent is an example of how committee staff undermine elected members \"for someone else's agenda,\" she added. \"And I don't know whose agenda it really is.\"\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on elections corruption from reliable major media sources.\n\nFrom yoga to punk, notorious occultist Aleister Crowley has had a profound influence on modern culture\n\n2004-07-09, The Guardian (One of the UK's Leading Newspapers)\n\nPosted: 2022-09-26 22:00:01\n\nThe Book of the Law [is] an obscure prose poem written 100 years ago by Aleister Crowley, often described as the key to the notorious Magus's vast pantheon of writings. A multi-layered template of a magickal system ... The Book of the Law made Crowley one of the 20th century's hidden prophets. Hysterical press accounts of sex, drugs and sacrifice at his Abbey of Thelema, in Sicily in the early 1920s, remain the core of the myth of Crowley as evil incarnate. It was also Crowley who gave Churchill his famous victory sign, a magickal gesture to counteract the Nazi's use of the swastika. Indeed, his hand appears in many unexpected places ... but his hidden influence was not restricted to the British war effort. In the 1940s, one of his closest followers was a young Californian adept, Jack Parsons, one of the founding fathers of the American space programme. His work at the fledgling Jet Propulsion Laboratories lay the groundwork for the Apollo moon missions. Rocket fuel, space exploration and Crowley's brand of ceremonial sex magick was a powerful mix. Working with Parsons was none other than L Ron Hubbard, who later founded the cult of Scientology, which now attracts so many Hollywood stars. Hubbard would also abscond with Parsons' money and wife, but not before Parsons had written a fourth \"chapter\" of The Book of the Law. His immediate following may have been small, but his influence on modern culture is as pervasive as that of Freud or Jung.\n\nNote: Read more about Jack Parsons in this LA Times article titled, \"Life as Satanist Propelled Rocketeer.\" For more along these lines, see concise summaries of deeply revealing news articles on secret societies from reliable major media sources.\n\nNew York woman loses job, leads pantry feeding thousands\n\n2021-02-25, Associated Press\n\nPosted: 2022-09-26 21:57:29\n\nWhile dozens of New Yorkers lined up outside in the rain, shopping carts at the ready as they waited for free food, Sofia Moncayo led her team in prayer. During the coronavirus pandemic, Moncayo has led the food distribution program through Mosaic West Queens Church in the Sunnyside neighborhood. The initiative began in March; Moncayo took charge a month later, as it expanded to serve hundreds of people. Since then, Moncayo has had her own struggles. She was furloughed from her job at a construction company and remains unemployed. And she also owes five months of rent for the martial arts studio that she owns with her husband in the neighborhood. But she has continued to lead fundraisers and coordinate dozens of volunteers who distribute more than 1,000 boxes of food to families twice a week. \"I think helping others has to do something to your brain chemically because if we had not being doing everything that we're doing, I think this would have been a much scarier time,\" she said. \"Being able to dig in and help others, it really gives you perspective and helps you believe that you're going to be OK too. One of the things that we wanted to make sure is that we don't look at people on the pantry line as people that need food, and really focus on, 'hey, these are our neighbors.'\" Carol Sullivan lost her stage manager job when Broadway theaters closed because of the virus. She was hesitant at first about receiving food from a pantry, but she said that Moncayo and the other volunteers made her feel welcome.\n\nNote: Enjoy a wonderful compilation of inspiring stories from the pandemic times on this webpage. Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nPatagonia founder just donated the entire company, worth $3 billion, to fight climate change\n\n2022-09-14, CNBC News\n\nPosted: 2022-09-26 21:56:01\n\nPatagonia founder Yvon Chouinard, his spouse and two adult children are giving away their ownership in the apparel maker he started some 50 years ago, dedicating all profits from the company to projects and organizations that will protect wild land and biodiversity and fight the climate crisis. The company is worth about $3 billion. In a letter about the decision, published on the Patagonia website on Wednesday, Choiunard wrote of \"reimagining capitalism,\" and said: \"While we're doing our best to address the environmental crisis, it's not enough. We needed to find a way to put more money into fighting the crisis while keeping the company's values intact. One option was to sell Patagonia and donate all the money. But we couldn't be sure a new owner would maintain our values or keep our team of people around the world employed. Another path was to take the company public. What a disaster that would have been. Even public companies with good intentions are under too much pressure to create short-term gain at the expense of long-term vitality and responsibility. Truth be told, there were no good options available. So, we created our own.\" The privately held company's stock will now be owned by a climate-focused trust and group of nonprofit organizations, called the Patagonia Purpose Trust and the Holdfast Collective respectively, the company said in a statement, noting \"every dollar that is not reinvested back into Patagonia will be distributed as dividends to protect the planet.\"\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles which will inspire you to make a difference.\n\nThe inspirational story of how a single mum has toured the world carrying her disabled son on her back - after vowing to give him a life of adventure when she gave birth at 17\n\n2022-01-01, Daily Mail (One of the UK's popular newspapers)\n\nPosted: 2022-09-26 21:54:36\n\nFrom Hawaii to Bali and the ski-slopes of Perisher, 26-year-old Jimmy Antram has seen plenty of the world. But it has all been from the vantage point of his mother's back. Fulfilling a promise she made to herself as a 17-year-old first-time mum to give her disabled son the best life she possibly could, Niki Antram has spent years travelling the globe with Jimmy clinging to her shoulders. Jimmy was born with physical and mental disabilities, including blindness, and requires round the clock care from Ms Antram and his support workers. He has a wheelchair, but Ms Antram has never enjoyed using it. She's content to carry him while she's physically able and helps him walk short distances on his own. Incredible photographs taken around the globe show him clinging on as they hike through mountains and rainforests. 'Planning big holidays, I always make sure I have plenty of nappies, clothes, and even bed pads, sheets and pillowcases,' she [said]. Ms Antram plans a meticulous itinerary and calls ahead for every venue she wants to visit - whether it be a restaurant, hotel or daredevil adventure. 'Even if I know we will be okay I like to inform the companies to give them a heads up about us to make sure they understand and are okay with having us there,' she says. Sometimes, they can't accommodate. This is usually because of risks associated with Jimmy's condition or logistical difficulties. Ms Antram said the exception to this was in Hawaii, where 'everyone wanted [Jimmy] to join'.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring disabled persons news articles.\n\nFDA expected to authorize new Covid boosters without data from tests in people\n\n2022-08-30, NBC News\n\nPosted: 2022-09-19 22:43:16\n\nThe updated Covid vaccine boosters, a reformulated version targeting the BA.5 omicron subvariant [will] be the first Covid shots distributed without results from human trials. Because the Biden administration has pushed for a fall booster campaign to begin in September, the mRNA vaccine-makers Pfizer-BioNTech and Moderna have only had time to test the reformulated shots in mice, not people. That means the Food and Drug Administration is relying on the mice trial data – plus human trial results from a similar vaccine that targets the original omicron strain, called BA.1 – to evaluate the new shots. Federal health officials hope that the new vaccines will provide stronger protection over the existing booster shots, which still target the original coronavirus strain. But the lack of data in humans means officials likely won't know how much better the new shots are – if at all – until the fall booster campaign is well underway. The FDA's decision to move forward without data from human trials is a gamble, experts say, threatening to further lower public trust in the vaccines should the new boosters not work as intended. The U.S. is still on its first iteration of the Covid vaccines, and the mRNA technology has only been in widespread use since late 2020. The agency is making \"huge assumptions\" in its consideration of the new Covid boosters, [Dr. Paul] Offit said, adding that it's possible the new shots may not be any more effective than the existing vaccines.\n\nNote: Read a revealing article with critical information about the new mRNA boosters. To further inquire into this complex topic, explore concise summaries of news articles on coronavirus vaccines and Big Pharma corruption from reliable major media sources.\n\nThe U.S. diet is deadly. Here are 7 ideas to get Americans eating healthier\n\n2022-08-31, NPR (Mississippi affiliate)\n\nPosted: 2022-09-19 22:42:09\n\nDiet-related deaths outrank deaths from smoking, and about half of U.S. deaths from heart disease – nearly 900 deaths a day – are linked to poor diet. The pandemic highlighted the problem, with much worse outcomes for people with obesity and other diet-related diseases. Providing prescriptions for fruit and vegetables can spur people to eat better and manage weight and blood sugar. The idea is for health care systems or insurers to provide or pay for healthy groceries, combined with nutrition education, to help patients change their eating habits. [Nancy] Brown says federal food assistance programs have helped to address hunger. \"However, many U.S. food policies and programs focus on improving access to sufficient quantities of food,\" she says. Instead, it's time to modernize these policies and focus on the quality of food. The Affordable Care Act mandates that diet counseling be covered by insurers as a preventive care benefit for those at higher risk of chronic disease. Too often ... doctors prescribe drugs for conditions before recommending or trying lifestyle changes. The task force recommends that Congress create a Farmer Corps to support new farmers, building on the Beginning Farmers and Ranchers Development Program. \"What we need to sustain agriculture is to incentivize restoring healthy soils and train more farmers to be successful doing that,\" [David Montgomery at University of Washington] says.\n\nNote: For more information on general health and well-being, check out our Health Information Center. To further explore diet-related concerns, consider reading news articles on food corruption to understand how unhealthy diets may also be impacted by the politics of industrial agriculture, leading to contaminants and loss of nutrients in our food.\n\nC.D.C. Virus Tests Were Contaminated and Poorly Designed, Agency Says\n\n2021-12-15, New York Times\n\nPosted: 2022-09-19 22:40:23\n\nThe faulty coronavirus testing kits developed by the Centers for Disease Control and Prevention in the early weeks of the pandemic were not only contaminated but had a basic design flaw, according to an internal review by the agency. Health officials had already acknowledged that the test kits were contaminated, but the internal report ... also documented a design error that caused false positives. In January 2020, the C.D.C. developed a polymerase chain reaction, or P.C.R., test for the virus. P.C.R. tests, which are performed in laboratories, can detect the virus at very low levels. Problems emerged soon after the C.D.C. had begun shipping its test kits out to public health laboratories in early February. Within days, many labs were reporting that the tests were generating inconclusive results. In mid-February, the agency acknowledged that the kits were flawed, and in April, officials at the U.S. Food and Drug Administration said that poor manufacturing practices had resulted in contamination of the test kits. Test kits had been contaminated with synthetic fragments of the virus's genetic material. These synthetic sequences ... were manufactured at the same C.D.C. lab where the test kits were undergoing a quality analysis. It is \"likely\" that the test kits were contaminated there, the agency concluded. The contamination suggests that the agency violated standard manufacturing protocols. Rather than relying on the C.D.C. to be the sole test developer, officials could also enlist clinical and commercial labs to create and deploy tests.\n\nNote: For more along these lines, see concise summaries of news articles on the coronavirus from reliable major media sources and visit our Coronavirus Information Center.\n\nFacebook Tells Moderators to Allow Graphic Images of Russian Airstrikes But Censors Israeli Attacks\n\n2022-08-27, The Intercept\n\nPosted: 2022-09-19 22:38:33\n\nInternal memos show Meta [the parent company of Facebook and Instagram] deemed attacks on Ukrainian civilians \"newsworthy.\" No such carveouts were ever made for Palestinian victims of Israeli state violence. During the recent Israeli attacks on Gaza, between August 5 and August 15, [civil society group] 7amleh tallied nearly 90 deletions of content or account suspensions relating to bombings. In an expanded, internal version of the Community Standards guide obtained by The Intercept, the section dealing with graphic content includes a series of policy memos directing moderators to deviate from the standard rules or bring added scrutiny to bear on specific breaking news events. Meta directed moderators to make sure that graphic imagery of Ukrainian civilians killed in Russian attacks was not deleted on seven different occasions. At the outset of the invasion, the company took the rare step of lifting speech restrictions around the Azov Battalion, a neo-Nazi unit of the Ukrainian military previously banned under the company's Dangerous Individuals and Organizations policy. Reuters reported that Meta temporarily permitted users to explicitly call for the death of Russian soldiers. Critics charge that the company's censorship policies ... tidily align with U.S. foreign policy interests. [Omar] Shakir of Human Rights Watch [states that] \"by silencing many people arbitrarily and without explanation, Meta is replicating online some of the same power imbalances and rights abuses we see in the real world.\"\n\nNote: Read about the increasing issue of censorship that undermines democracy in our Mass Media Information Center. Furthermore, watch a 14-minute interview with a Facebook whistleblower that exposes Facebook censorship techniques.\n\nUS asked British spy agency to stop Guardian publishing Snowden revelations\n\n2022-08-31, The Guardian (One of the UK's leading newspapers)\n\nPosted: 2022-09-19 22:36:23\n\nThe US National Security Agency (NSA) tried to persuade its British counterpart to stop the Guardian publishing revelations about secret mass data collection from the NSA contractor, Edward Snowden. Sir Iain Lobban, the head of Government Communications Headquarters (GCHQ) ... rebuffed the suggestion that his agency should act as a censor on behalf of its US partner in electronic spying. British refusal to shut down publication of the leaks ... caused rifts within the Five Eyes signals intelligence coalition [according to] a new book ... by Richard Kerbaj. Kerbaj reports that the US-UK intelligence relationship was further strained when the head of the NSA, Gen Keith Alexander, failed to inform Lobban that the Americans had identified Snowden ... leaving the British agency investigating its own ranks in the search for the leaker. The Five Eyes allies were outraged that a contractor like Snowden, working as a computer systems administrator, could get access to their secrets, and that because of US government outsourcing, there were 1.5 million Americans with top security clearance like Snowden. Allies were not prepared to challenge the Americans out of anxiety that they could be cut off from the flow of intelligence. British officials also decided to bite their tongues ... because of the value of the intelligence and funding provided by the NSA. Sir Kim Darroch, the former UK national security adviser, is quoted ... saying: \"The US give us more than we give them so we just have to basically get on with it.\"\n\nNote: Read more on how US and UK spy agencies undermine privacy and security in this news article reported by The Guardian. For a guide from The Guardian on how to remain secure against NSA surveillance, click here.\n\nWall Street Giants Set to Smash Profit Records Off Global Hunger, Energy Crisis\n\n2022-09-09, Common Dreams\n\nPosted: 2022-09-19 22:34:02\n\nRussia's war on Ukraine has wreaked havoc on global commodity markets, driving up energy and food prices and exacerbating hunger emergencies around the world. But while disastrous for the global poor ... the chaos has been a major boon for Wall Street giants. \"The 100 biggest banks by revenue are set to make $18 billion from commodities trading in 2022,\" Bloomberg reported Friday. \"The prediction is the latest evidence that the wild swings in energy prices triggered by the war in Ukraine are delivering a boon to commodity traders, even as they push European nations into crisis,\" Bloomberg added. \"Vali, an analytics firm that tracks trading business, compiled data that includes the leading five banks in commodity trading: Macquarie Group Ltd., Goldman Sachs Group Inc., JPMorgan Chase & Co., Citigroup Inc., and Morgan Stanley.\" \"People's misery makes capitalists' superprofit,\" Salvatore De Rosa, a researcher at the Lund University Center for Sustainability Studies. The World Food Program estimates that \"as many as 828 million people go to bed hungry every night\" and ... \"those facing acute food insecurity has soared–from 135 million to 345 million–since 2019.\" \"It's too easy to say the war in Ukraine has unbalanced all these markets, [or that] supply chains and the ports are shot, and that there's a supply and demand reason for these prices going up,\" [Michael] Greenberger added. \"My own best guess is anywhere from 10% to 25% of the price, at least, is dictated by deregulated speculative activity.\"\n\nNote: For more along these lines, see concise news summaries revealing banking corruption from reliable major media sources. You can also visit our Banking Information Center to further explore corruption in the financial industry.\n\nThe super-rich 'preppers' planning to save themselves from the apocalypse\n\n2022-09-04, The Guardian (One of the UK's leading newspapers)\n\nPosted: 2022-09-19 22:32:31\n\nTech billionaires are buying up luxurious bunkers and hiring military security to survive a societal collapse they helped create, but like everything they do, it has unintended consequences. Their extreme wealth and privilege ... make them obsessed with insulating themselves from the very real and present danger of climate change, rising sea levels, mass migrations, global pandemics, nativist panic and resource depletion. For them, the future of technology is about only one thing: escape from the rest of us. What, if anything, could we do to resist it? A former president of the American chamber of commerce in Latvia ... JC Cole had witnessed the fall of the Soviet empire, as well as what it took to rebuild a working society almost from scratch. He believed the best way to cope with the impending disaster was to change the way we treat one another, the economy, and the planet right now. JC's real passion wasn't just to build a few isolated, militarised retreat facilities for millionaires, but to prototype locally owned sustainable farms that can be modelled by others and ultimately help restore regional food security in America. Investors not only get a maximum security compound in which to ride out the coming plague, solar storm, or electric grid collapse. They also get a stake in a potentially profitable network of local farm franchises that could reduce the probability of a catastrophic event. His business would do its best to ensure there are as few hungry children at the gate as possible when the time comes to lock down.\n\nNote: Read about a Cold War U.S. government missile silo that was transformed into a luxury bunker to prepare for the apocalypse in this previously reported news article. You might also consider exploring revealing news articles on food system corruption impacting our economy and environment.\n\nExperimental electromagnetic weaponry may soon see combat use\n\n2003-01-30, The Economist\n\nPosted: 2022-09-19 22:29:45\n\nThe recent use of armed, unmanned drones in Afghanistan and Yemen has shown that America's armed forces have become good at applying new weapons technology in the field. [Electromagnetic] weapons are able to destroy electronic systems and temporarily incapacitate people, all without the mess of explosions and gunfire. Using different types of electromagnetic energy (the same stuff as radio waves, X-rays and light) ... they could disrupt a variety of enemy systems, from missile targeting and launch electronics, to command-and-control systems. So-called \"active denial\" technology (which earns its moniker by actively herding people out of its path) works by using a beam of millimetre-length microwaves to heat up a person's skin. The marines are planning to put a version of the weapon on to a jeep. Range and properties are classified, but military newspapers say it can heat a person's skin to 55°C (130°F) at distances of up to 750 metres. David Fidler, a law professor at Indiana University, says that, because these weapons are most likely to be used on civilians, it is not clear that using them is legal under the international rules governing armed conflict. Steve Goose of Human Rights Watch ... says that too much secrecy still surrounds them. Weapons such as the active denial system could cause severe trauma, or even death, if fired at close range or held on a target for too long. Is it acceptable to shoot or bomb somebody if you have the option only to disable them?\n\nNote: You can read the full article free of charge on this webpage. Did you know that non-lethal weapons have already been developed and used on people, as evidenced in these news articles from the mainstream media? Investigate the series of mysterious attacks on US diplomats in recent years which are likely electromagnetic in nature. To explore even further, read about the history and scope of non-lethal weapons, along with a revealing study of the US Intelligence's use and abuse of these weapons.\n\nFights erupted at a high school in Louisiana. So these dads took matters in their own hands\n\n2021-11-08, CNN\n\nPosted: 2022-09-19 22:26:38\n\nA violent week of fistfights at a Louisiana high school led to the arrests of at least 22 students last month. So a group of concerned fathers decided enough was enough. They formed a volunteer group, Dads on Duty, and began roaming the halls of Southwood High School in Shreveport to calm students, spread positivity and keep the peace. So far it's working. The group of about 40 fathers, wearing Dads on Duty T-shirts, patrol the campus every weekday on different shifts, working as community leaders and liaisons. Since they started the initiative, there's been no fighting at the school. \"I immediately knew that [this violence] ... isn't the community that we're raising our babies in,\" said Michael LaFitte, [one] of the dads. The dads showed up at the school at 7:40 a.m., balancing their work schedules to patrol the campus in the morning, during lunch and after school. Shreveport has seen an uptick in violence and crime in recent months [as a consequence of] socioeconomic issues made worse by the lingering pandemic. The city's mayor, Adrian Perkins, credits the fathers with helping to combat violence involving local youth. He turned up at the school for a Dads on Duty shift when the fathers first started, and said he was impressed by their commitment. Dads on Duty has been working closely with the Caddo Parish School Board and local law enforcement, LaFitte said. The dads say their focus is not criminal justice - they let sheriff's deputies handle that - but an additional layer of parenting. \"We are armed with love,\" LaFitte said.\n\nNote: To further explore stories that help create the world we want to live in, check out our inspiring news articles collection and our Inspiration Center.\n\nCalifornia graduate honors immigrant parents with senior photo shoot in strawberry fields\n\n2021-06-18, USA Today\n\nPosted: 2022-09-19 22:24:41\n\nThroughout high school and college, Jennifer Rocha would plant strawberries with her parents from 6 p.m. to 3 a.m. Then she'd sleep a few hours and get ready for school. On June 13, Rocha graduated from the University of California, San Diego, and she wanted to honor her parents' hard work. So she coordinated a photo shoot in the strawberry fields they worked night after night. \"Through drops of sweat, tears, back aches, they were able to get their three daughters through college. They deserve all the recognition in the world and for them to be an inspiration to other immigrant parents ... that it is not impossible for their kids to chase their dreams,\" Rocha [said]. In her college career, when she felt like quitting Rocha said she'd think back to her work in the fields and what her degree would mean to her family. Rocha hopes her photos bring awareness to the farmworker community and the impact of their work. She said it's easy for Americans to pick up vegetables and fruits from the grocery store without appreciation for the workers who made it possible. \"Farmworkers do not deserve to be paid minimum wage. They worked throughout the whole pandemic risking their health and risking the health of their families not knowing if they would come home with something,\" Rocha said. \"No matter if your parents work in domestic labor jobs where the pay is minimum wage, with hard work, sacrifice, discipline, and dedication it can be done.\"\n\nNote: To further explore stories that help create the world we want to live in, check out our inspiring news articles collection and our Inspiration Center.\n\nMIT researchers develop cost-effective battery made of common materials\n\n2022-09-12, Optimist Daily\n\nPosted: 2022-09-19 22:23:15\n\nThe environmental benefits of using electricity rather than fossil fuels to power our world goes without saying– however, the process of electrifying everything has its obstacles. Many in the tech world are excited about the new A1-S battery ... declaring that \"MIT has produced yet another breakthrough technology that is set to change the world for the better.\" Researchers at the Massachusetts Institute of Technology (MIT) recently innovated batteries that are made of cost-effective and abundant materials. Instead of using lithium, [MIT Professor Donald] Sadoway and the team ... selected aluminum for one electrode, which he asserted is \"the most abundant metal on Earthâ€¦ no different from the foil at the supermarket.\" He combined the aluminum with ... sulfur, which he said is \"often a waste product from processes such as petroleum refining.\" Both the charging and discharging cycles generate enough heat that the battery can heat itself and doesn't require an external source. On top of being a fraction of the price of conventional batteries, they can also be charged very quickly with no risk of forming dendrites. It's important to note that this new battery isn't without problems. For instance, the process of extracting alumina out of bauxite is not the easiest or cleanest, and ... researchers are concerned that we may one day run out of [sulfur]. That said, Sadoway made it clear that these issues don't compare to the problems that come with sourcing ingredients for lithium-ion batteries.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles.\n\nThe Pandemic Erased Two Decades of Progress in Math and Reading\n\n2022-09-01, New York Times\n\nPosted: 2022-09-13 03:04:02\n\nNational test results showed ... the pandemic's devastating effects on American schoolchildren, with the performance of 9-year-olds in math and reading dropping to the levels from two decades ago. Since the National Assessment of Educational Progress tests began tracking student achievement in the 1970s ... scores in reading fell by the largest margin in more than 30 years. The declines spanned almost all races and income levels and were markedly worse for the lowest-performing students. While top performers in the 90th percentile showed a modest drop – three points in math – students in the bottom 10th percentile dropped by 12 points in math, four times the impact. The setbacks could have powerful consequences for a generation of children who must move beyond basics in elementary school to thrive later on. \"The biggest reason to be concerned is the lower achievement of the lower-achieving kids,\" [said Susanna Loeb at Brown University]. Being so far behind, she said, could lead to disengagement in school, making it less likely that they graduate from high school or attend college. The federal government has budgeted $122 billion to help students recover, the largest single investment in American schools, and at least 20 percent of that money must be spent on academic catch-up. Yet some schools have had difficulty hiring teachers, let alone tutors, and others may need to spend far more than 20 percent of their money to close big gaps.\n\nNote: This article fails to mention that it was not the pandemic, but rather the lockdown policies that caused this debacle. Sweden, which never closed it's elementary schools, did not have this problem. Read more about the challenging impacts of lockdown policies in an essay written by a caring school teacher who presents solid evidence that the lockdowns in the U.S. and worldwide had tragic effects not only on low-income and homeless children, but on huge numbers of people around the world.\n\nEnding Big Tech's Laissez-Faire Approach to Child Sexual Abuse Material\n\n2022-02-16, Newsweek\n\nPosted: 2022-09-13 03:01:25\n\nThe EARN IT Act [is] a bill designed to confront the explosion of child sexual abuse material (CSAM) online. EARN IT would help address what is, disturbingly, a common experience for young users: routine exposure to predatory targeting, grooming, sexual violence, prostitution/sex trafficking, hardcore pornography and more. A New York Times investigation revealed that 70 million CSAM images were reported to the National Center for Missing and Exploited Children (NCMEC) in 2019–up from 600,000 in 2008–an \"almost unfathomable\" increase in criminality. The EARN IT Act restores privacy to victims of child sexual abuse material and allows them to sueĂ˘â‚ŹĹ»those who cause them harm online, under federal civil law and state criminal and civil law. It also creates a new commission to issue guidelines to limit sex trafficking, grooming and sexual exploitationĂ˘â‚ŹĹ»online. CSAM still exists because tech platforms have no incentive to prevent or eliminate it, because Section 230 of the Communications Decency Act (passed in 1996, before social media existed) gives them near-blanket immunity from liability. While some in the technology sector [are] claiming EARN IT is a threat to encryption and user privacy, the reality is that encryption can coexist with better business practices for online child safety. We can increase security and privacy while refraining from a privacy-absolutism that unintentionally allows sexual predators to run rampant online.\n\nNote: To understand the scope of child sex abuse worldwide, learn about other major cover-ups in revealing news articles on sexual abuse scandals from reliable major media sources.\n\nSeven Years of Sex Abuse: How Mormon Officials Let It Happen\n\n2022-08-04, U.S. News & World Report/Associated Press\n\nPosted: 2022-09-13 02:59:59\n\nMJ was just 5 years old, when her father admitted to his bishop that he was sexually abusing her. The father, a member of The Church of Jesus Christ of Latter-day Saints [of the Bisbee, Arizona ward], was in counseling with his bishop when he revealed the abuse. The bishop ... followed church policy and called what church officials have dubbed the \"help line\" for guidance. Lawyers for the church, who staff the help line ... told Bishop John Herrod not to call police or child welfare officials. Instead he kept the abuse secret. The Associated Press has obtained nearly 12,000 pages of sealed records from an unrelated child sex abuse lawsuit against the Mormon church in West Virginia. Families of survivors who filed the lawsuit said ... church leaders divert abuse accusations away from law enforcement and instead to church attorneys who may bury the problem, leaving victims in harm's way. \"Child abuse festers and grows in secrecy,\" said [lawyer] Lynne Cadigan. Laws in more than 20 states [assert] that clergy who receive information about child neglect or sexual abuse during spiritual confessions \"may withhold\" that information from authorities ... under church doctrine. [Survivors and their families are trying to] change church policy so that any instance of child sexual abuse is immediately reported to civil authorities. Inaction by the church have raised ethical issues. \"What aspect of your religious practice are you advancing if you don't report something like this?\" [investigator Gerard Moretz] asked.\n\nNote: To understand the scope of child sex abuse worldwide, learn about other major cover-ups in revealing news articles on sexual abuse scandals from reliable major media sources. Furthermore, watch powerful evidence in a suppressed Discovery Channel documentary showing that child sexual abuse rings reach to the highest levels of government. Then watch an excellent segment by Australia's \"60-Minutes\" team \"Spies, Lords and Predators\" on a pedophile ring in the UK which also leads directly to the highest levels of government.\n\nThe Troubling Story Behind Hulu's New Documentary Victoria's Secret: Angels and Demons\n\n2022-07-19, Time Magazine\n\nPosted: 2022-09-13 02:58:18\n\nWhile Epstein's ties to former presidents Bill Clinton and Donald Trump, as well as Prince Andrew and Bill Gates, have been well publicized, his connection with [Les] Wexner flew under the radar until Epstein's 2019 arrest on sex trafficking and conspiracy charges. For nearly two decades, Epstein was Wexner's personal money manager, but few people understood just how close the two were. The Ohio-born Leslie \"Les\" Wexner is the billionaire founder of L Brands Inc., the one-time parent company of The Limited, Bath & Body Works, Abercrombie & Fitch, and Victoria's Secret, the crown jewel of his retail holdings. Epstein was named the billionaire's power of attorney in 1991, which gave Epstein \"unmitigated control over all of [Wexner's] assets,\" according to Washington Post reporter Sarah Ellison. He could sign checks, buy and sell property, and borrow money on Wexner's behalf. \"There wasn't a part of Wexner's empire that Epstein didn't have access to and didn't have some ability to control,\" Ellison says in the docuseries. Anti-trafficking advocate Conchita Sarnoff makes the case that Epstein was able to \"legally bring girls from all over the world into the United States under the guise of modeling thanks to his position as Wexner's financial advisor. The documentary details a culture of complicity at Victoria's Secret, which allowed Epstein to hide in plain sight with Wexner's help. For years, Wexner managed to keep his relationship with Epstein hidden from public view, but now people are looking for answers.\n\nNote: Watch an eye-opening video on the top 10 shocking reveals of this Hulu documentary. For more along these lines, see the timeline of Epstein's case. You can also explore major cover-ups in high places in deeply revealing news articles on sexual abuse scandals from reliable major media sources.\n\n'Victoria's Secret: Angels and Demons' weaves together Jeffrey Epstein and corporate culture\n\n2022-07-14, CNN\n\nPosted: 2022-09-13 02:56:25\n\n\"Victoria's Secret: Angels and Demons\" [is a] fairly standard look at Wexner's business acumen in acquiring the lingerie outfit and transforming it into a multi-billion-dollar enterprise, inspiring cultish devotion among employees while facing ever-escalating pressure to make the marketing more provocative. Yet Wexner's success also brought Epstein into his orbit, eventually leading to allegations that the latter leveraged his affiliation with the company as part of his predatory behavior. As for what Wexner might have known, the executive (who declined to be interviewed for the docuseries) and his representatives staunchly denied any awareness. The hardest-to-explain aspect of the story involve Wexner granting Epstein power of attorney over his assets. With so many projects devoted to the Epstein scandal, including docuseries from Investigation Discovery and Netflix, the emphasis on his role, while understandable, feels like well-trodden territory. Indeed, it tends to obscure insights having to do with Wexner's retail strategy and its broader implications -- turning something as mundane as underwear into a premium item, manufacturing in China to slash costs and from a cultural perspective, feeding unrealistic expectations about women's bodies with heavily photoshopped catalogue spreads. In the final chapter, however, director Matt Tyrnauer deftly weaves the pieces together, conveying how the key men behind Victoria's Secret were blind to the changes sweeping over society while allegedly engaging in their own questionable behavior.\n\nNote: Watch an eye-opening video on the top 10 shocking reveals of this Hulu documentary. For more along these lines, see the timeline of Epstein's case. You can also explore major cover-ups in high places in deeply revealing news articles on sexual abuse scandals from reliable major media sources.\n\nJust 2% of the richest Americans had their taxes audited in 2019, down from 16% in 2010\n\n2022-05-17, CNBC News\n\nPosted: 2022-09-13 02:53:19\n\nThe audit rate for Americans earning more than $5 million a year plunged to just over 2% in 2019 from over 16% in 2010, according to a recent report from the Government Accountability Office, a federal watchdog. The report estimated that taxpayers underreported their income tax by a combined $245 billion a year between 2011 and 2013, and said that \"taxpayers are more likely to voluntarily comply with the tax laws if they believe their return may be audited.\" The main reason for the decline, according to the report, is a lack of IRS funding. In fiscal year 2021, the agency's budget was $11.9 billion – $200 million less than its 2010 budget. The IRS also has seen its staffing levels fall to the same levels as 1973. The decline in funding and auditors means that taxpayers, and especially the top earners, are far less likely to get caught underpaying their taxes than a decade ago. Overall audit rates for American taxpayers fell to 0.2% in 2019 from 0.9% in 2010. The wealthy are still audited at a higher rate than the general taxpayer population. Yet their audit rates have declined at a much higher rate. The audit rate for taxpayers earning between $5 million and $10 million fell to 1.4% from 13.5%. Those earning more than $10 million saw their audit rate fall to 3.9% in 2019 from 21.2% in 2010, while audit rates for $10 million-plus earners ticked up slightly for the 2017 and 2018 tax years due to a Treasury Department mandate to impose audit rates of at least 8% on those making $10 million or more.\n\nNote: For more along these lines, see key news articles on the financial industry from reliable major media sources.\n\nAmerica used to regulate business. Now government subsidises it\n\n2022-08-21, The Guardian (One of the UK's Leading Newspapers)\n\nPosted: 2022-09-13 02:51:11\n\nThe biggest thing the federal government now does with businesses is subsidize them. The Clean Air Act of 1970 authorized the government to regulate air pollution. The Inflation Reduction Act, which Joe Biden signed into law ... allocates more than $300bn to energy and climate reform, including $30bn in subsidies for manufacturers of solar panels and wind turbines. Notice the difference? This shift from regulation to subsidy has characterized every recent administration. Today it's politically difficult, if not impossible, for government to demand that corporations (and their shareholders) bear the costs of public goods. Spending by corporations on lobbying increased from $1.44bn in 1999 to $3.77bn in 2021 and is on track to exceed $4bn this year. This tidal wave of corporate money has occurred at the same time large American corporations have globalized ... demanding government subsidies in return for creating jobs and doing their cutting-edge research in America. The question [is] whether the government should subsidize certain industries that generate large social benefits in the form of new technologies. I argued that the government was already engaged in a hidden industrial policy, disguised, for example, as grants to the aerospace and telecom industries by the Department of Defense and to the pharmaceutical industry by the National Institutes of Health. It would be far better to do industrial policy in the open, so that the public could assess what it was paying for and what it was getting in return.\n\nNote: This article was written by former U.S. Secretary of Labor Robert Reich. For more revealing information on the government sponsoring corporate, financial interests without public input, see concise summaries of news articles on corporate corruption, and corruption in government and the financial industry.\n\nStudents lose access to books amid 'state-sponsored purging of ideas'\n\n2022-08-17, Washington Post\n\nPosted: 2022-09-13 02:49:06\n\nSchool librarians [will] have less freedom to choose books and schoolchildren [will have] less ability to read books they find intriguing, experts say. In the past two years, six states have passed laws that mandate parental involvement in reviewing books, making it easier for parents to remove books or restrict the texts available at school, according to a tally kept by nonprofit EveryLibrary. Policies are proliferating at the district level, too. A Texas system will divide its library into \"juvenile,\" \"young adult\" and \"adult\" sections, with parents choosing the \"level\" their child can access. \"This is a state-sponsored purging of ideas and identities that has no precedent in the United States of America,\" said John Chrastka, EveryLibrary's executive director. \"We're witnessing the silencing of stories and the suppressing of information [that will make] the next generation less able to function in society.\" A flurry of parent-staffed websites reviewing books for inappropriate content have appeared – including \"Between the Book Covers,\" whose website says \"professional review sites cannot be entrusted,\" and BookLook.info, \"a place for taking a closer look at the books in our children's hands.\" There are also Facebook groups like Utah's \"LaVerna in the Library,\" which \"collects naughty children's books.\" As states and districts adjust their reading rules, parents and students are working to change things, too. Teens in Texas, for example, have formed \"banned book clubs\" – while in Missouri, students are suing their district to restore eight pulled books.\n\nNote: For more along these lines, see concise summaries of the disappearance of privacy in our society. Whether in our schools, on social media, or in our news, read about the increasing issue of censorship that undermines democracy in our Mass Media Information Center.\n\nCalifornia to install solar panels over canals to fight drought, a first in the U.S.\n\n2022-08-30, CBS News\n\nPosted: 2022-09-13 02:46:21\n\nIn an effort to combat the devastating drought conditions hitting California, the Golden State will become the first in the nation to install solar panel canopies over canals. It will consist of an estimated 8,500 feet of solar panels installed over three sections of Turlock Irrigation District (TID) canals in Central California. According to TID, the project aims to use water and energy management hand-in-hand. The project is designed to increase renewable power generation, while reducing water evaporation and vegetative growth in canals. A 2021 University of California, Merced study [revealed] that covering all of the approximately 4,000 miles of public water delivery system infrastructure in the state with solar panels could save an estimated 63 billion gallons of water annually, as well as result in significant energy and cost savings. \"According to the study, the 13 gigawatts of solar power the panels would generate each year would equal about one-sixth of the state's current installed capacity,\" TID wrote on its website. TID also says the project will also support California Gov. Gavin Newsom's call for 60% of the state's electricity to come from renewable sources by 2030. California has taken multiple steps to combat drought conditions and climate change impacting the state [including moving] forward with a plan to ban the sale of new gas-powered vehicles by 2035. Officials [also] announced that California would receive $310 million in federal funding to address the drought.\n\nNote: To further explore stories that help create the world we want to live in, check out our inspiring news articles collection and our Inspiration Center.\n\nWork begins to turn 99,000 hectares in England into 'nature recovery' projects\n\n2022-05-26, The Guardian (One of the UK's Leading Newspapers)\n\nPosted: 2022-09-13 02:44:11\n\nUp to 99,000 hectares of land in England, from city fringes to wetlands, will be focused on supporting wildlife in five major \"nature recovery\" projects, the government has said. The five landscape-scale projects in the West Midlands, Cambridgeshire, the Peak District, Norfolk and Somerset aim to help tackle wildlife loss and the climate crisis, and improve public access to nature. They will share an initial Ĺ\u00812.4m pot from the Department for the Environment, Food and Rural Affairs and Natural England, for work to create new habitats, manage land for nature and carbon storage and increase footpaths and connect with communities, with further funding expected from other sources and partners. Work in the projects will range from converting farmland into chalk grassland to restoring \"dewponds\" and managing wetlands and other land sustainably. Projects will also develop plans to work with communities in cities and deprived areas to improve their access to nature, including creating new green areas and improved footpaths and bridleways. The environment minister Rebecca Pow said: \"These five projects across England are superb examples of exciting, large-scale restoration that is critically needed to bring about a step-change in the recovery of nature in this country. \"They will significantly contribute to achieving our target to halt the decline in species abundance by 2030 and our commitment to protect 30% of our land by 2030, enabling us to leave the environment in a better state than we found it.\"\n\nNote: To further explore stories that help create the world we want to live in, check out our inspiring news articles collection and our Inspiration Center.\n\nS.C. Gives Highest Civilian Honor To Principal Who Got A Walmart Job To Help Students\n\n2021-02-09, NPR\n\nPosted: 2022-09-13 02:42:28\n\nIt was supposed to be a secret. But word got out about what North Charleston High School Principal Henry Darby was doing – and the state has now presented him with its highest civilian honor. Darby took on a part-time job at Walmart, stocking shelves from 10 p.m. to 7 a.m., three nights every week. He's been using the paychecks from that work to help make sure kids from his school have food and basic supplies, or help their families pay their bills. Some money has also gone to former students who need help, or to teachers at his school who need a boost. \"Principal Darby personifies the best of South Carolina, a selfless person who goes above and beyond for others,\" Gov. Henry McMaster said on Tuesday. \"It was an honor to present him with the Order of the Palmetto yesterday,\" the governor added. In addition to being a principal, he serves on the Charleston County Council. \"I decided to get another job because the kids, they really need help,\" Darby told the paper, which noted that despite Darby's efforts to stay under the radar, one of his students recognized him on the first night he worked at Walmart. His shifts ended just in time for him to drive to North Charleston High before morning classes started. In the weeks since people realized how much Darby was doing to help others, many have stepped forward both to praise him and to help him raise money for families who need it. Walmart gave his school a $50,000 check. Together, two crowdfunding pages devoted to his cause have raised more than $195,000.\n\nNote: Explore a treasure trove of concise summaries of incredibly inspiring news articles.\n\nCompanies use inflation to hike prices and generate huge profits, report says\n\n2022-05-27, CBS News\n\nPosted: 2022-09-06 14:14:27\n\nSome of the nation's largest retailers have been using soaring inflation rates as an excuse to raise prices and rake in billions of dollars in additional profit, a corporate watchdog group charged. The new figures comes as companies enjoy their most profitable year since the 1950s. Pre-tax profits last year soared 25% from 2020, far outpacing the increase in consumer prices. The report highlights an ongoing debate about the causes of inflation, with some consumer advocates arguing that corporations are using inflation as a justification for passing on even higher price hikes to consumers. Accountable.US said it examined the financial statements of the nation's top 10 retailers over the past two years – including Lowe's and Target – and found that they collectively increased their profits by $24.6 million for a grand total of $99 billion. The report notes, among other examples, that Lowe's recorded $8.4 billion in profit in its most recent quarter as it touted its \"new pricing strategies.\" TJX, parent company of TJ Maxx, Marshalls and Home Goods, saw last year's profits soar to $3.3 billion as the CEO spoke about the company's \"aggressive\" price increases. \"It's time corporations finally help shoulder the burden average Americans have taken on throughout the health crisis,\" [Accountable.US President Kyle] Herrig said. \"Corporations can start by stabilizing prices for consumers instead of pursuing even higher profits – on top of finally paying their fair share in taxes.\"\n\nNote: Just like big Pharma with COVID, the major corporations are profiting hugely from our misery. Here's another revealing report shows major food producing corporations marking up prices while raking in huge profits. You might also explore key excerpts of news articles on corporate corruption from reliable media sources.\n\nBad news: COVID-19 numbers are pretty meaningless\n\n2022-07-19, The Hill\n\nPosted: 2022-09-06 14:12:03\n\nIn general, we rely on organizations like the CDC to conduct surveillance and monitoring of diseases in the United States. Unfortunately, case reporting, which we are relying on now to understand COVID-19 in the United States is the weakest type of surveillance for an ongoing pandemic. Case counts meant something very early on in the epidemic when each case reliably was associated with a certain risk of severe disease, hospitalization or death. Once there was a substantial number of people with immunity to severe outcomes due to recovery or vaccination those case counts became disconnected from expected outcomes. Test positivity also used to be a reliable measure of the community burden of infection with increased positivity correlating with increased spread of infection and hospitalization. But because now many only seek medical testing to confirm a home-based positive test for employment sick-leave or other purposes, the frequency of those testing positive through medical testing is artificially high. Remember the days of \"flatten the curve,\" the idea that we had to preserve hospital capacity through efforts to reduce the spread of infection? That curve was the number of hospital admissions due to COVID-19 and reasonably reflected the number of people admitted to hospitals severely ill with COVID-19. Now, however, due to the continued universal screening of all hospital admissions, a majority of reported COVID-19 hospitalizations are not hospitalized \"for\" COVID-19 but \"with\" COVID-19.\n\nNote: The author of this article, Jeffrey D. Klausner, MD, MPH, is a clinical professor of Medicine and Infectious Diseases at the the University of Southern California. He is a also a former U.S. Centers for Disease Prevention and Control medical officer. For more along these lines, visit our coronavirus news articles collection from reliable major media sources. Then explore the resources provided in our Coronavirus Information Center.\n\nEPA Whistleblowers Provide New Evidence of Ongoing Failure To Assess Dangerous Chemicals\n\n2022-08-01, The Intercept\n\nPosted: 2022-09-06 14:10:35\n\nA group of whistleblowers has provided evidence that the Environmental Protection Agency has not adequately assessed the health risks posed by several new chemicals on the grounds that they are corrosive. Those harms include cancer, miscarriage, and neurotoxicity, according to the whistleblowers, who work as health assessors in the division. In some cases Ă˘â‚Ź¦ the risks were calculated, found to be significant, and later deleted from official documents. In March 2020, Gallagher, the human health assessor, found that another chemical presented risks to workers. Information [about the hazards] was included in a version of the assessment. But a month later, a manager in the New Chemicals Division created a new assessment [that] explained: \"Risks were not evaluated for workers via repeated dermal exposures because dermal exposures are not considered likely due to the corrosivity of the new chemical substance.\" According to the whistleblowers, this statement is false. \"It is intentionally misleading for EPA to put into a report that we did not calculate risk when we did,\" said Martin Phillips, a chemist and human health assessor who works in the EPA's Office of Pollution Prevention and Toxics. \"It's lying about what we did. It's not just that we did the calculations. We did the calculations and found risks, and then they got rid of them and said that we didn't calculate them. It's fundamentally inaccurate.\"\n\nNote: For more along these lines, see concise summaries of news articles on pharmaceutical corruption and science corruption from reliable major media sources.\n\n'The level of sneakiness with Americans hiding money abroad is staggering'\n\n2022-07-22, Yahoo News\n\nPosted: 2022-09-06 14:07:57\n\nWhether dodging taxes or legal peril, wealthy Americans often succeed in concealing assets from the government by hiding their money in offshore bank accounts. Research from the IRS and a group of economists last year found that the top 1% of earners in the U.S. neglect to report 20% of their income – and that random audits almost never detect offshore accounts. Tax havens like Switzerland or the Cayman Islands have traditionally offered Americans a place to hide their assets because they fiercely guard financial privacy and have minimal to no taxes. Often, they also have laws that inhibit scrutiny from foreign tax officials. Prior to his latest book, [author Patrick Radden] Keefe published \"Empire of Pain,\" which chronicled the billionaire Sackler family's connection to the nation's opioid epidemic. The Sacklers, the notorious family that owned the now bankrupt Purdue Pharma, reportedly have much of their wealth hidden in offshore accounts. An audit commissioned by Purdue showed the family withdrew more than $10 billion from their company during the opioid crisis, CNN reported in October 2020. They began drawing especially large amounts of money from the firm after paying $600 million in a 2007 plea deal with the Justice Department for misleading physicians and consumers about the opioid OxyContin, CNN reported. \"The kind of sophistication of the whole industry of financial dissimulation ... such that nobody can put their hands on the money, is really interesting.\" Keefe told Yahoo Finance.\n\nNote: A 2015 Guardian newspaper article further describes how the US helps the super-rich hide assets. For more along these lines, see concise summaries of financial industry corruption news articles from reliable major media sources.\n\nCognitive decline linked to ultraprocessed food, study finds\n\n2022-08-01, CNN\n\nPosted: 2022-09-06 14:02:39\n\nEating ultraprocessed foods for more than 20% of your daily calorie intake every day could set you on the road to cognitive decline, a new study revealed. \"Fifty-eight percent of the calories consumed by United States citizens ... come from ultraprocessed foods,\" [Dr. Claudia] Suemoto said. Studies have found they can raise our risk of obesity, heart and circulation problems, diabetes and cancer. In fact, men and women who ate the most ultraprocessed foods had a 28% faster rate of global cognitive decline and a 25% faster rate of executive function decline compared with people who ate the least amount of overly processed food, the study found. \"The new results are quite compelling and emphasize the critical role for proper nutrition in preserving and promoting brain health and reducing risk for brain diseases as we get older,\" said Rudy Tanzi, professor of neurology at Harvard Medical School and director of the genetics and aging research unit at Massachusetts General Hospital in Boston. Tanzi said the key problem with ultraprocessed foods is that they are usually very high in sugar, salt and fat, all of which promote systemic inflammation, perhaps the most major threat to healthy aging in the body and brain. \"They also replace eating food that is high in plant fiber that is important for maintaining the health and balance of the trillions of bacteria in your gut microbiome,\" he added, \"which is particularly important for brain health and reducing risk of age-related brain diseases like Alzheimer's disease.\"\n\nNote: For more information on health and well-being, including major cover-ups that affect your health, visit our Health Information Center and explore key news articles from the major media related to health.\n\nWhy is so little known about the 1930s coup attempt against FDR?\n\n2022-01-11, The Guardian (One of the UK's Leading Newspapers)\n\nPosted: 2022-09-06 14:01:08\n\n[Very few know about] the 1933 \"Wall Street putsch\" against newly elected Franklin Delano Roosevelt. Roosevelt's bold New Deal experiments inflamed the upper class, provoking a backlash from the nation's most powerful bankers, industrialists and Wall Street brokers. Against the backdrop of charismatic dictators in the world such as Hitler and Mussolini, the sparks of anti-Rooseveltism ignited into full-fledged hatred. Many American intellectuals and business leaders saw nazism and fascism as viable models for the US. There is much evidence that the nation's wealthiest men – Republicans and Democrats alike – were so threatened by FDR's policies that they conspired with antigovernment paramilitarism to stage a coup. The final report by the congressional committee tasked with investigating the allegations ... concluded: \"There is no question that [fascism] attempts were discussed, were planned, and might have been placed in execution when and if the financial backers deemed it expedient.\" [US Marine Corps Maj Gen Smedley Darlington] Butler demanded to know why the names of the country's richest men were removed from the final version of the committee's report. \"Like most committees, it has slaughtered the little and allowed the big to escape,\" Butler said.\n\nNote: Read a revealing two-page summary of General Butler's landmark book \"War is a Racket.\" For more along these lines, explore reliable resources provided in our War Information Center.\n\nReality Winner says she leaked file on Russia election hacking because 'public was being lied to'\n\n2022-07-25, The Guardian (One of the UK's Leading Newspapers)\n\nPosted: 2022-09-06 13:53:16\n\nA former intelligence contractor who was imprisoned for leaking a report about Russian interference in the US presidential election that Donald Trump won in 2016 has insisted she acted out of love for a nation that was \"being lied to\". The 30-year-old ... decided to leave her National Security Agency contractor's office at the Fort Gordon army base in Georgia with an intelligence report about Russian attempts to meddle in the election that saw Trump beat Hillary Clinton for the White House. Working for NSA contractor Pluribus International Corporation, Winner printed the document – labeled \"TOP SECRET\" – that explained how Russian military intelligence officials hacked at least one supplier of voting software and tried to break into more than 100 local election systems before the polls closed in 2016. The Trump administration had her charged under the Espionage Act, which was initially created during the first world war as a means to punish people spying on the US during times of foreign conflict. Winner pleaded guilty ... to be sentenced to five years in prison. Authorities said the sentence was the longest ever handed down by a US federal court to someone convicted of providing government information to the media without permission. Winner said she broke her oath to protect classified material because Americans were being intentionally deceived about Russia's efforts to sow chaos in the presidential election that vaulted Trump into the Oval Office.\n\nNote: Elections fraud and manipulation is by no means a partisan issue. We are very clear that all major political parties in all countries have at times committed elections abuses for many years, if not centuries. Explore top news articles on election fraud, and visit our Elections Information Center for more information from reliable news sources.\n\nCan you hear the Hum? The mystery noise that says a lot about modern life\n\n2022-07-07, The Guardian (One of the UK's Leading Newspapers)\n\nPosted: 2022-09-06 13:52:04\n\nMaybe you hear it. A low frequency hum, almost a vibration, just on the threshold of human hearing. Maybe it keeps you awake. Maybe it causes you headaches, dizziness, even nosebleeds. If you do hear it, you're among the roughly 4% of the world's population affected by \"the Hum\", a frequently reported but little understood global phenomenon. The earliest reliable reports of the Hum date from the UK in the mid-1970s. Numerous reports of the Hum have been made across the UK, usually clustered around specific towns or cities: Hythe, Plymouth and, as recently as last month, Swansea. The fact that the Hum seems to have only really emerged as a documented concern in the past half-century suggests it could be a byproduct of technological advances. As much as our innovations have the capacity to nurture and sustain us, they also have the capacity to assail us. It always comes as a small surprise to remember we are constantly beset by high- and low-pitched frequencies, which our brain actively tunes out. Could the Hum be the background thrum of electricity, gas lines or cell towers? One theory even posits ultra-low frequency radio signals used to communicate with submarines in the depths of oceans might be interacting with soft tissue in our skulls that stimulate the auditory nerve – a phenomenon known as the \"microwave auditory effect\", which, incidentally, has been studied by the Pentagon for use as a sonic weapon.\n\nNote: Could this be some secret experiment with non-lethal weapons? Similar highly strange sounds have affected large numbers of people in other areas.\n\nThis group's wiped out $6.7 billion in medical debt, and it's just getting started\n\n2022-08-15, NPR\n\nPosted: 2022-09-06 13:49:59\n\nSoon after giving birth to a daughter two months premature, Terri Logan received a bill from the hospital. She recoiled from the string of numbers separated by commas. Then a few months ago Ä‚Ë\u0098Ă˘â€šĹą¦ Logan received some bright yellow envelopes in the mail. They were from a nonprofit group [RIP Medical Debt] telling her it had bought and then forgiven all those past medical bills. The nonprofit has boomed during the pandemic, freeing patients of medical debt, thousands of people at a time. Its novel approach involves buying bundles of delinquent hospital bills – debts incurred by low-income patients like Logan – and then simply erasing the obligation to repay them. It's a model developed by two former debt collectors, Craig Antico and Jerry Ashton, who built their careers chasing down patients who couldn't afford their bills. RIP buys the debts just like any other collection company would – except instead of trying to profit, they send out notices to consumers saying that their debt has been cleared. A surge in recent donations – from college students to philanthropist MacKenzie Scott, who gave $50 million in late 2020 – is fueling RIP's expansion. To date, RIP has purchased $6.7 billion in unpaid debt and relieved 3.6 million people of debt. RIP is one of the only ways patients can get immediate relief from such debt, says Jim Branscome, a major donor. \"As a bill collector collecting millions of dollars in medical-associated bills in my career, now all of a sudden I'm reformed: I'm a predatory giver,\" Ashton said.\n\nNote: To understand the corruption in healthcare that results in expensive medical bills, read this revealing 10-page summary of medical doctor Marcia Angell's book The Truth About Drug Companies. To further explore stories that help create the world we want to live in, check out our inspiring news articles collection and our Inspiration Center.\n\nCalifornia man scales Machu Picchu in off-roading wheelchair\n\n2022-01-07, San Francisco Chronicle (San Francisco's Leading Newspaper)\n\nPosted: 2022-09-06 13:47:40\n\nIn 2011, [Ropert Kapen] suffered a brain stem stroke that left him paralyzed. Doctors told his family that he ha", "images": ["https://www.paypalobjects.com/en_US/i/btn/btn_donate_LG.gif", "https://www.wanttoknow.info/m/images/header-mission.png", "https://www.WantToKnow.info/images/news-magnify.jpg", "https://www.wanttoknow.info/m/images/header-logo.png", "https://www.wanttoknow.info/images/rss.gif"], "top_img": "https://www.WantToKnow.info/images/news-magnify.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "News Stories", "meta_data": {"description": "News stories: Excerpts from highly revealing major media news stories suggest major cover-ups of health, energy, media, 9/11, war, elections, and more. Links to original stories provided for easy verification.", "keywords": "news,articles,9/11,911,elections,energy,inventions,financial,global,warming,government,health,mass,media,,information,polls,able,danger,avian,flu,corporate,corruption,dolphins,whales,hurricane,katrina,income,inequality,inspirational,microchips,mind,control,nature,reality,non-lethal,nonlethal,privacy,secrecy,secret,societies,terrorism,ufos,vaccines,war", "viewport": "width=device-width, initial-scale=1", "ROBOTS": "INDEX,FOLLOW", "Revisit-after": "21 days", "rating": "general", "google-site-verification": "93poa4ULbuO4k4m5pcOzlCUyZF-QR_CMpiv-eFUo8sw"}, "movies": [], "publish_date": null, "source": "https://www.wanttoknow.info", "summary": ""}