{"url": "https://www.tennessean.com/story/entertainment/music/bonnaroo/2018/06/10/eminem-bonnaroo-set-criticized-over-blasts-described-gunshot-sound-effects/688507002/", "text": "Deafening blasts during Eminem's Bonnaroo set prompt backlash\n\nA series of deafening blasts during Eminem's Bonnaroo set Saturday night prompted several festival goers to criticize the hip hop artist for what they described as \"gunshot\" sound effects.\n\nShortly after starting his headlining set on the What Stage, three separate blasts rang out during his performance sparking debate on social media over whether such sound effects are appropriate in the context of recent mass shootings.\n\nUpdate: Under fire, Eminem representative defends Bonnaroo performance, sound effects\n\nPyrotechnics imitating a gunshot during Eminem’s Bonaroo set had the crowd shook 😶 pic.twitter.com/ZCWSlI8s3Z — N@ (@natsasss) June 10, 2018\n\nDozens of tweets emerged almost immediately criticizing Eminem for the use of such sound effects.\n\nBonnaroo 2018: Do Eminem’s gunshots, anti-gay lyrics belong here?\n\nMore: Inside look at Bonnaroo 2018 including photos, videos and more\n\nMore: Bonnaroo holds all-star 'wake' for Tom Petty with 'Superjam'\n\n\"Less than a year after Vegas and @Eminem thinks it's a good idea to blast gun shot sfx onstage at a music festival?\" wrote Brad King on Twitter. \"Bad call on this headliner @Bonnaroo.\"\n\nLess than a year after Vegas and @Eminem thinks it’s a good idea to blast gun shot sfx onstage at a music festival? Bad call on this headliner @bonnaroo. What happened to Radiate Positivity? — Brad King (@BradKing32) June 10, 2018\n\nKing, who referenced the October 1 shooting at the Route 91 Harvest country music festival in Las Vegas, wasn't alone:\n\nEminem needs stop poppin off guns during his show.. literally has everyone ducking, weaving AND bobbing — phoenix (@ThatsSoPhoenix) June 10, 2018\n\ncoming from a performing stand point, i get the effect of sound effects on stage, but there’s a certain point that cross’s the line. i’m one of eminem’s number 1 fans but to hear 3 gun shots coming straight from his set had me scared af. not gonna lie. especially in this world... — M (@macykatemusic) June 10, 2018\n\nWorst decision ever to ask @Eminem to play, @bonnaroo. My night was awesome but now I’m in absolute tears and shaking because I thought the multiple gunshots from his performance from across Centeroo were real. This is not OK. — sara (@sarabenyo) June 10, 2018\n\nIn turn, people who have seen the rapper perform said the loud bangs are common for his concerts.\n\ni literally saw eminem less than a week ago NO ONE was triggered / scared of the gunshot noise that has been performed for YEARS LMAO you’re begging for attention go home https://t.co/E9ZCZuFORE — kailey (@kaileypost666) June 10, 2018\n\nThey're really mad at @Eminem for using gun shot sound effects at his concert.\n\n\n\nAt his RAP concert.\n\n\n\nI saw the video and it didn't even sound like somebody shot a real gun, that paired with the song change right on que 😂. If y'all thought that was real you're just dumb 😂 — Jay Williams (@Jaywilliams2500) June 10, 2018\n\nEminem has ended Kill You with the gun shot effects for (at least) 6 years now and this is the first time someone ever complains — Laia (@onlyslimshady) June 10, 2018\n\n58 people died in the Route 91 shooting and this is the first Bonnaroo since the shooting.\n\nFestival organizers have instituted many new safety measures, including metal detectors but while the efforts aim to quell fears, the tragedy of the fatal Las Vegas shooting remains fresh for some attendees.", "images": ["https://www.gannett-cdn.com/-mm-/8a8f155002427aa989cb0d531f5d2cf16953d7cf/c=0-253-2996-1946/local/-/media/2018/04/27/USATODAY/USATODAY/636604610047305139-USP-Entertainment-Coachella-Valley-Music-and-Arts-99385421.JPG?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/8a8f155002427aa989cb0d531f5d2cf16953d7cf/c=0-253-2996-1946/local/-/media/2018/04/27/USATODAY/USATODAY/636604610047305139-USP-Entertainment-Coachella-Valley-Music-and-Arts-99385421.JPG?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Juan Buitrago"], "canonical_link": "https://www.tennessean.com/story/entertainment/music/bonnaroo/2018/06/10/eminem-bonnaroo-set-criticized-over-blasts-described-gunshot-sound-effects/688507002/", "title": "Deafening blasts during Eminem's Bonnaroo set prompt backlash", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=526094470, app-argument=https://www.tennessean.com/story/entertainment/music/bonnaroo/2018/06/10/eminem-bonnaroo-set-criticized-over-blasts-described-gunshot-sound-effects/688507002/entertainment/music/bonnaroo", "theme-color": "#ffffff", "og": {"title": "Deafening blasts during Eminem's Bonnaroo set prompt backlash", "description": "A series of deafening blasts during Eminem's Bonnaroo set Saturday night, prompted several festival goers to criticize the singer for what they described as \\", "site_name": "The Tennessean", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/8a8f155002427aa989cb0d531f5d2cf16953d7cf/c=0-253-2996-1946/local/-/media/2018/04/27/USATODAY/USATODAY/636604610047305139-USP-Entertainment-Coachella-Valley-Music-and-Arts-99385421.JPG?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "description": "A series of deafening blasts during Eminem's Bonnaroo set Saturday night, prompted several festival goers to criticize the singer for what they described as \\", "twitter": {"site": "@Tennessean", "creator": "@Tennessean", "card": "summary_large_image"}}, "movies": [], "publish_date": 1528585200.0, "source": "https://www.tennessean.com", "summary": ""}