{"url": "www.inquisitr.com/4608233/khloe-kardashian-forced-by-tristan-to-follow-strict-pregnancy-diet-after-cookies-ice-cream-binge/", "text": "Khloe Kardashian once was known as the chubby Keeping Up with the Kardashians sister. But after putting herself on a strict diet and fitness plan, Khloe achieved a 40-pound weight loss and a stunning revenge body, as the Inquisitr reported.\n\nAfter facing rumors for years about her desire to become a mom like her sisters Kourtney and Kim Kardashian, Khloe reportedly has become pregnant. Kardashian's boyfriend, Tristan Thompson, who has begun appearing on episodes of Keeping Up with the Kardashians, is her alleged baby daddy. And while Khloe previously has been shown exercising intensely and sticking to her strict diet, now she is rumored to have let go of her weight-loss program. But in response to Kardashian's rumored binges of ice cream and cookies, Tristan has taken action and ordered her to follow a strict pregnancy diet, an insider told OK! Magazine.\n\nSince learning that Khloe is expecting her first baby with Thompson, she reportedly has enjoyed eating all that junk food she surrendered during her 40-pound weight-loss program. The source claims that the NBA star won't tolerate those sugar-and-starch-filled binges.\n\n\"[Tristan] intervened with Khloe Kardashian's pregnancy routine, telling her he won't stand for unhealthy habits!\"\n\nThompson is reportedly giving Kardashian strict guidelines when it comes to what she can eat and what she must avoid. But it's not easy for Khloe, who craves fattening foods, added the insider.\n\nRefusing to indulge Kardashian, Tristan has created a new routine for Khloe after putting himself in charge of her diet, according to the source.\n\nThe insider revealed that Thompson knows of Kardashian's fondness for fattening foods. But he is so into nutrition and fitness that he is now supervising Khloe's diet and exercise. The source also shared what Kardashian was enjoying before Tristan's diet intervention.\n\n\"Khloe was snacking really badly on Kettle chips, chocolate chip cookies, and ice cream.\"\n\nWhile it might sound harsh for Kardashian's baby daddy to force her to avoid her favorite fattening foods, the insider clarified that Thompson doesn't want her to \"beat up on herself by overindulging.\" According to the source, the NBA star has provided a \"great influence\" when it comes to helping Khloe get back on track with a nutritional diet.\n\nTristan even helps Kardashian choose her clothes, she told E! News.\n\n\"Tristan actually has impeccable style.\"\n\nKhloe revealed that she sometimes asks her boyfriend if she should wear certain accessories, including shoes. Thompson is enthusiastic about advising his pregnant girlfriend on her style.\n\n\"Where I'll say, like tonight, 'Babe, should I wear these socks or not?' And he's like, 'No, you look cute,'\" she admitted.\n\nKardashian praised Tristan as having \"such good taste\" that she takes his style tips \"all day long.\" Thompson's style preferences seem to have influenced their cute couple Halloween outfit.", "images": ["https://imgb.srgcdn.com/c2fbdf24-a0a4-40f9-ad23-b0cb57bf8766.jpg", "https://imgb.srgcdn.com/d258d2ec-e52b-4489-9950-908cc366bacf.jpg", "https://secure.gravatar.com/avatar/fa8aa86244d76bf2aee7e2fb5b934ea3?s=800", "https://imgb.srgcdn.com/fe42e24b-1fa1-4cf2-b7ef-0bcd25a6f5c9.png", "https://imgb.srgcdn.com/1740626a-9ecf-4723-b66a-d7ca5e1d678c.jpg", "http://www.inquisitr.com/static/inquisitr/images/favicon-32x32.png", "https://imgb.srgcdn.com/a5ba8e20-c5b5-4c82-ae2b-4f343261a07b.jpg", "https://imgb.srgcdn.com/6977b3f9-ffc5-44c5-866c-e80c13668077.jpg"], "top_img": "http://www.inquisitr.com/static/inquisitr/images/favicon-32x32.png", "keywords": [], "authors": [], "canonical_link": "https://www.inquisitr.com/4608233/khloe-kardashian-forced-by-tristan-to-follow-strict-pregnancy-diet-after-cookies-ice-cream-binge/", "title": "Khloe Kardashian Forced By Tristan To Follow 'Strict' Pregnancy Diet After Cookies & Ice Cream Binge?", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimal-ui, user-scalable=no", "msapplication-TileImage": "/static/inquisitr/favicon-128x128.png", "robots": "max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Khloe Kardashian Forced By Tristan To Follow 'Strict' Pregnancy Diet After Cookies & Ice Cream Binge?", "url": "https://www.inquisitr.com/4608233/khloe-kardashian-forced-by-tristan-to-follow-strict-pregnancy-diet-after-cookies-ice-cream-binge/", "site_name": "The Inquisitr", "description": "Khloe Kardashian Forced By Tristan To Follow 'Strict' Pregnancy Diet After Cookies & Ice Cream Binge?", "updated_time": "2021-08-16 18:13:43Z"}, "article": {"modified_time": "2021-08-16 18:13:43Z", "published_time": "2017-11-08 11:06:20Z", "section": "Rumors"}, "description": "Khloe Kardashian Forced By Tristan To Follow 'Strict' Pregnancy Diet After Cookies & Ice Cream Binge?", "keywords": "Rumors", "twitter": {"card": "summary_large_image"}}, "movies": [], "publish_date": 1510139180.0, "source": "http://www.inquisitr.com", "summary": ""}