{"url": "https://en.wikipedia.org/wiki/Charlie_and_the_Chocolate_Factory", "text": "1964 children's novel by Roald Dahl\n\nThis article is about the novel. For other uses, see Charlie and the Chocolate Factory (disambiguation)\n\nCharlie and the Chocolate Factory is a 1964 children's novel by British author Roald Dahl. The story features the adventures of young Charlie Bucket inside the chocolate factory of eccentric chocolatier Willy Wonka.[1]\n\nThe story was originally inspired by Roald Dahl's experience of chocolate companies during his schooldays at Repton School in Derbyshire. Cadbury would often send test packages to the schoolchildren in exchange for their opinions on the new products.[2] At that time (around the 1920s), Cadbury and Rowntree's were England's two largest chocolate makers and they each often tried to steal trade secrets by sending spies, posing as employees, into the other's factory—inspiring Dahl's idea for the recipe-thieving spies (such as Wonka's rival Slugworth) depicted in the book.[3] Because of this, both companies became highly protective of their chocolate-making processes. It was a combination of this secrecy and the elaborate, often gigantic, machines in the factory that inspired Dahl to write the story.[4]\n\nCharlie and the Chocolate Factory is frequently ranked among the most popular works in children's literature.[5][6][7] In 2012, Charlie Bucket brandishing a Golden Ticket appeared in a Royal Mail first class stamp in the UK.[8] The novel was first published in the US by Alfred A. Knopf, Inc. in 1964 and in the UK by George Allen & Unwin 11 months later. The book's sequel, Charlie and the Great Glass Elevator, was written by Dahl in 1971 and published in 1972. Dahl had also planned to write a third book in the series but never finished it.[9] The book has also been adapted into two major motion pictures: Willy Wonka & the Chocolate Factory in 1971, and Charlie and the Chocolate Factory in 2005. A prequel film exploring Willy Wonka's origins will be released in 2023.\n\nPlot [ edit ]\n\nEleven-year-old Charlie Bucket, his parents, and four grandparents all live in poverty in a small house outside a town which is home to a large, world-famous chocolate factory. One day, Charlie's Grandpa Joe tells him about the legendary and eccentric chocolatier Willy Wonka, who owns the town's chocolate factory, and all the fantasy candies he made until the other chocolatiers sent in spies to steal his secret recipes, forcing Wonka to close the factory. He reopened the factory three years later, but the gates remained locked and nobody is sure who is providing the factory with its workforce.\n\nThe next day, the newspaper announces that Wonka is reopening the factory to the public and has invited five lucky children to come on a tour after they find five Golden Tickets in five Wonka Bars. The first four golden tickets are found by gluttonous Augustus Gloop, spoiled Veruca Salt, chewing gum-addicted Violet Beauregarde, and television addict Mike Teavee. After the fourth ticket is found, the family begins to starve after Charlie's father loses his job at the toothpaste factory and the only job he can find is shoveling snow from the streets during a severe winter. One day, walking home from school, Charlie sees a fifty-pence piece (A dollar bill in the US version) buried in the snow. He buys two Wonka Bars and miraculously finds the last Golden Ticket in the second. The ticket says he can bring one or two family members with him, and Grandpa Joe agrees to go, suddenly regaining his mobility despite being bedridden for almost 20 years.\n\nOn the day of the tour, Wonka welcomes the five children and their parents inside the factory, a wonderland of confectionery creations that defy logic. They also meet the Oompa-Loompas who help him operate the factory. During the tour, the other four children give in to their impulses and are ejected from the tour in darkly comical ways. Augustus gets sucked into the pipe to the Fudge Room after falling into the Chocolate River, Violet blows up into a giant blue ball after chewing an experimental stick of three-course dinner gum, Veruca and her parents are thrown down the garbage chute after she tries to capture one of the nut-testing squirrels, who deem the Salts \"Bad Nuts\", and Mike gets shrunk down to the size of a chocolate bar after misusing the Wonkavision device despite Wonka's warnings, causing him to be \"sent by television\". The Oompa-Loompas sing about the children's misbehaviour each time disaster strikes.\n\nWith only Charlie remaining, Wonka congratulates him for \"winning\" the factory. Wonka explains that the whole tour was designed to help him secure a good person to serve as an heir to his business, and Charlie was the only child whose inherent goodness allowed him to pass the test. They ride the Great Glass Elevator and watch the other four children leave the factory before flying to Charlie's house, where Wonka then invites Charlie's entire family to come and live with him in the factory.\n\nCharacters [ edit ]\n\nPublication [ edit ]\n\nRace and editing [ edit ]\n\nDahl's widow claimed that Charlie was originally written as \"a little black boy.\" Dahl's biographer said the change to a white character was driven by Dahl's agent, who thought a black Charlie would not appeal to readers.[10][11]\n\nIn the first published edition, the Oompa-Loompas were described as African pygmies, and were drawn this way in the original printed edition.[10] After the announcement of a film adaptation sparked a statement from the NAACP, which expressed concern that the transportation of Oompa-Loompas to Wonka's factory resembled slavery, Dahl found himself sympathising with their concerns and published a revised edition.[10] In this edition, as well as the subsequent sequel, the Oompa-Loompas were drawn as being white and appearing similar to hippies, and the references to Africa were deleted.[10]\n\nUnused chapters [ edit ]\n\nVarious unused and draft material from Dahl's early versions of the novel have been found. In the initial, unpublished drafts of Charlie and the Chocolate Factory nine golden tickets were distributed to tour Willy Wonka's secret chocolate factory[12] and the children faced more rooms and more temptations to test their self-control.[12][13] Some of the names of the children cut from the final work include:[14]\n\nClarence Crump, Bertie Upside, and Terence Roper (who overindulge in Warming Candies ) [15] [16]\n\n) Elvira Entwhistle (lost down a trash chute, renamed Veruca Salt) [12] [15]\n\nViolet Glockenberry (renamed Strabismus and finally Beauregarde) [12] [15] [17]\n\nMiranda Grope and Augustus Pottle (lost up a chocolate pipe, combined into the character Augustus Gloop) [12] [15]\n\nMiranda Mary Piker (renamed from Miranda Grope, became the subject of Spotty Powder ) [17] [18]\n\n) Marvin Prune (a conceited boy) [14] [18]\n\nWilbur Rice and Tommy Troutbeck, the subjects of The Vanilla Fudge Room [12] [15] [19]\n\nHerpes Trout (renamed Mike Teavee)[17]\n\n\"Spotty Powder\" was first published as a short story in 1973.[18][20] In 1998 it was included in the children's horror anthology Scary! Stories That Will Make You Scream edited by Peter Haining. The brief note before the story described the story as having been left out of Charlie and the Chocolate Factory due to an already brimming number of misbehaving children characters in the tale. In 2005, The Times reprinted \"Spotty Powder\" as a \"lost\" chapter, saying that it had been found in Dahl's desk, written backwards in mirror writing (the same way that Leonardo da Vinci wrote in his journals).[13][21] Spotty Powder looks and tastes like sugar, but causes bright red pox-like spots to appear on faces and necks five seconds after ingestion, so children who eat Spotty Powder do not have to go to school. The spots fade on their own a few hours later. After learning the purpose of Spotty Powder, the humourless, smug Miranda Piker and her equally humourless father (a schoolmaster) are enraged and disappear into the Spotty Powder room to sabotage the machine. Soon after entering, they are heard making what Mrs. Piker interprets as screams. Mr. Wonka assures her (after making a brief joke where he claims that headmasters are one of the occasional ingredients) that it is only laughter. Exactly what happens to them is not revealed in the extract.[12][13]\n\nIn an early draft, sometime after being renamed from Miranda Grope to Miranda Piker, but before \"Spotty Powder\" was written, she falls down the chocolate waterfall and ends up in the Peanut-Brittle Mixer. This results in the \"rude and disobedient little kid\" becoming \"quite delicious.\"[18][22] This early draft poem was slightly rewritten as an Oompa-Loompa song in the lost chapter, which now puts her in the \"Spotty-Powder mixer\" and instead of being \"crunchy and ... good [peanut brittle]\" she is now \"useful [for truancy] and ... good.\"[13]\n\n\"The Vanilla Fudge Room\" [ edit ]\n\nIn 2014, The Guardian revealed that Dahl had removed another chapter (\"The Vanilla Fudge Room\") from an early draft of the book. The Guardian reported the now-eliminated passage was \"deemed too wild, subversive and insufficiently moral for the tender minds of British children almost 50 years ago.\"[12] In what was originally chapter five in that version of the book, Charlie goes to the factory with his mother (instead of his grandfather, as originally published). At this point, the chocolate factory tour is down to eight kids,[19][23] including Tommy Troutbeck and Wilbur Rice. After the entire group climbs to the top of the titular fudge mountain, eating vanilla fudge along the way, Troutbeck and Rice decide to take a ride on the wagons carrying away chunks of fudge. The wagons take them directly to the Pounding And Cutting Room, where the fudge is reformed and sliced into small squares for retail sale. Wonka states the machine is equipped with \"a large wire strainer ... which is used specially for catching children before they fall into the machine\" adding that \"It always catches them. At least it always has up to now.\"[19]\n\nThe chapter dates back to an early draft with ten golden tickets, including one each for Miranda Grope and Augustus Pottle, who fell into the chocolate river prior to the events of \"Fudge Mountain\".[12][24] Augustus Pottle was routed to the Chocolate Fudge Room, not the Vanilla Fudge Room explored in this chapter,[19][23] and Miranda Grope ended up in the Fruit and Nuts Room.\n\n\"The Warming Candy Room\" [ edit ]\n\nAlso in 2014, Vanity Fair published a plot summary of \"The Warming Candy Room\", wherein three boys eat too many \"warming candies\" and end up \"bursting with heat.\"[25]\n\nThe Warming Candy Room is dominated by a boiler, which heats a scarlet liquid. The liquid is dispensed one drop at a time, where it cools and forms a hard shell, storing the heat and \"by a magic process ... the hot heat changes into an amazing thing called 'cold heat.'\" After eating a single warming candy, one could stand naked in the snow comfortably. This is met with predictable disbelief from Clarence Crump, Bertie Upside, and Terence Roper, who proceed to eat at least 100 warming candies each, resulting in profuse perspiration. The three boys and their families discontinue the tour after they are taken to cool off \"in the large refrigerator for a few hours.\"[16]\n\nRoald Dahl originally planned for a child called Marvin Prune to be included in Charlie and the Chocolate Factory. Dahl submitted the excised chapter regarding Marvin Prune to The Horn Book Review in the early 1970s.[26] Rather than publish the chapter, Horn Book responded with a critical essay by novelist Eleanor Cameron, who called Charlie and the Chocolate Factory “one of the most tasteless books ever written for children”.[27]\n\nReception [ edit ]\n\nIn a 2006 list for the Royal Society of Literature, author J. K. Rowling (author of the Harry Potter books) named Charlie and the Chocolate Factory among her top ten books that every child should read.[28] A fan of the book since childhood, film director Tim Burton wrote: \"I responded to Charlie and the Chocolate Factory because it respected the fact that children can be adults.\"[29][30]\n\nA 2004 study found that it was a common read-aloud book for fourth-graders in schools in San Diego County, California.[31] A 2012 survey by the University of Worcester determined that it was one of the most common books that UK adults had read as children, after Alice's Adventures in Wonderland, The Lion, the Witch and the Wardrobe, and The Wind in the Willows.[32]\n\nGroups who have praised the book include:\n\nIn the 2012 survey published by SLJ, a monthly with primarily US audience, Charlie was the second of four books by Dahl among their Top 100 Chapter Books, one more than any other writer.[37] Time magazine in the US included the novel in its list of the 100 Best Young-Adult Books of All Time; it was one of three Dahl novels on the list, more than any other author.[38] In 2016 the novel topped the list of Amazon's best-selling children's books by Dahl in Print and on Kindle.[39]\n\nAlthough the book has always been popular and considered a children's classic by many literary critics, a number of prominent individuals have spoken unfavourably of the novel over the years.[40] Children's novelist and literary historian John Rowe Townsend has described the book as \"fantasy of an almost literally nauseating kind\" and accused it of \"astonishing insensitivity\" regarding the original portrayal of the Oompa-Loompas as African black pygmies, although Dahl did revise this in later editions.[41] Another novelist, Eleanor Cameron, compared the book to the sweets that form its subject matter, commenting that it is \"delectable and soothing while we are undergoing the brief sensory pleasure it affords but leaves us poorly nourished with our taste dulled for better fare.\"[27] Ursula K. Le Guin wrote in support of this assessment in a letter to The Horn Book Review, saying that her own daughter would turn \"quite nasty\" upon finishing the book.[42] Dahl responded to Cameron's criticisms by noting that the classics that she had cited would not be well received by contemporary children.[43]\n\nAdaptations [ edit ]\n\nCharlie and the Chocolate Factory has frequently been adapted for other media, including games, radio, the screen,[44] and stage, most often as plays or musicals for children – often titled Willy Wonka or Willy Wonka, Jr. and almost always featuring musical numbers by all the main characters (Wonka, Charlie, Grandpa Joe, Violet, Veruca, etc.); many of the songs are revised versions from the 1971 film.\n\nFilm [ edit ]\n\nThe book was first made into a feature film as a musical, titled Willy Wonka & the Chocolate Factory (1971), directed by Mel Stuart, produced by David L. Wolper, and starring Gene Wilder as Willy Wonka, character actor Jack Albertson as Grandpa Joe, and Peter Ostrum as Charlie Bucket, with music by Leslie Bricusse and Anthony Newley. Dahl was credited for writing the screenplay, but David Seltzer was brought in by Stuart and Wolper to make changes against Dahl's wishes, leaving his original adaptation, in one critic's opinion \"scarcely detectable\".[45] Amongst other things, Dahl was unhappy with the foregrounding of Wonka over Charlie, and disliked the musical score. Because of this, Dahl disowned the film.[45] The film had an estimated budget of $2.9 million but grossed only $4 million and was considered a box-office disappointment, though it received positive reviews from critics. Exponential home video and DVD sales, as well as repeated television airings, resulted in the film's subsequently becoming a cult classic.[46] Concurrently with the 1971 film, the Quaker Oats Company introduced a line of candies whose marketing uses the book's characters and imagery.[47]\n\nCharlie and the Chocolate Factory on display at a convention in Spain Golden Ticket from the 2005 filmon display at a convention in Spain\n\nWarner Bros. and the Dahl estate reached an agreement in 1998 to produce another film version of Charlie and the Chocolate Factory, with the Dahl family receiving total artistic control. The project languished in development hell until Tim Burton signed on to direct in 2003. The film, titled Charlie and the Chocolate Factory, starred Johnny Depp as Willy Wonka. It was released in 2005 to positive reviews and massive box office returns, becoming the eighth-highest-grossing film of the year.[48]\n\nIn October 2016, Variety reported that Warner Bros. has acquired the rights to the Willy Wonka character from the Roald Dahl Estate and would be planning a new film centered around the eccentric character with David Heyman producing.[49] In February 2018, Paul King entered final negotiations to direct the film.[50] In May 2021, it was reported that the film would be a musical titled Wonka, with Timothée Chalamet playing a younger version of the titular character in an origin story.[51] King was confirmed as director and co-writer along with comedian Simon Farnaby; the film is set for release in December 2023.[52]\n\nOther adaptations [ edit ]\n\nAudiobook [ edit ]\n\nIn 2002, Monty Python member Eric Idle narrated the audiobook version of the American Edition of Charlie and the Chocolate Factory.[62] Douglas Hodge, who played Willy Wonka in the London production of the stage musical,[63] narrated the UK Edition of the audiobook for Penguin Audio in 2013, and the title was later released on Amazon Audible.[64]\n\nEditions [ edit ]\n\nCharlie and the Chocolate Factory has undergone numerous editions and been illustrated by numerous artists.[65]\n\nBooks [ edit ]\n\n50th anniversary cover controversy [ edit ]\n\nThe cover photo of the 50th anniversary edition, published by Penguin Modern Classics for sale in the UK and aimed at the adult market, received widespread commentary and criticism.[67] The cover is a photo of a heavily made up young girl seated on her mother's knee and wearing a doll-like expression, taken by the photographers Sofia Sanchez and Mauro Mongiello as part of a photo shoot for a 2008 fashion article in a French magazine, for a fashion article titled \"Mommie Dearest.\"[66][68] In addition to writing that \"the image seemingly has little to do with the beloved children's classic\",[69] reviewers and commentators in social media (such as posters on the publisher's Facebook page) have said the art evokes Lolita, Valley of the Dolls, and JonBenet Ramsey; looks like a scene from Toddlers & Tiaras; and is \"misleading,\" \"creepy,\" \"sexualised,\" \"grotesque,\" \"misjudged on every level,\" \"distasteful and disrespectful to a gifted author and his work,\" \"pretentious,\" \"trashy\", \"outright inappropriate,\" \"terrifying,\" \"really obnoxious,\" and \"weird & kind of paedophilic.\"[66][70][71]\n\nThe publisher explained its objective in a blog post accompanying the announcement about the jacket art: \"This new image . . . looks at the children at the center of the story, and highlights the way Roald Dahl’s writing manages to embrace both the light and the dark aspects of life.\"[72] Additionally, Penguin Press's Helen Conford told the Bookseller: \"We wanted something that spoke about the other qualities in the book. It's a children's story that also steps outside children's and people aren't used to seeing Dahl in that way.\" She continued: \"[There is] a lot of ill feeling about it, I think because it's such a treasured book and a book which isn't really a 'crossover book'\" As she acknowledged: \"People want it to remain as a children's book.\"\n\nThe New Yorker describes what it calls this \"strangely but tellingly misbegotten\" cover design thusly: \"The image is a photograph, taken from a French fashion shoot, of a glassy-eyed, heavily made-up little girl. Behind her sits, a mother figure, stiff and coiffed, casting an ominous shadow. The girl, with her long, perfectly waved platinum-blond hair and her pink feather boa, looks like a pretty and inert doll—\" The article continues: \"And if the Stepford daughter on the cover is meant to remind us of Veruca Salt or Violet Beauregarde, she doesn't: those badly behaved squirts are bubbling over with rude life.\" Moreover, writes Talbot, \"The Modern Classics cover has not a whiff of this validation of childish imagination; instead, it seems to imply a deviant adult audience.\"[67]\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Book_collection.jpg/32px-Book_collection.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1d/Tom_Sawyer_1876_frontispiece.jpg/20px-Tom_Sawyer_1876_frontispiece.jpg", "https://upload.wikimedia.org/wikipedia/en/f/f6/Charlie_and_the_Chocolate_Factory_original_cover.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/ExpoSYFY_-_Charlie_and_the_Chocolate_Factory_%288521128271%29.jpg/170px-ExpoSYFY_-_Charlie_and_the_Chocolate_Factory_%288521128271%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/Theatre_Royal_20130408_023.JPG/170px-Theatre_Royal_20130408_023.JPG", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/MCM_2013_-_Willy_Wonka_%26_Mad_Hatter_%288978291669%29.jpg/170px-MCM_2013_-_Willy_Wonka_%26_Mad_Hatter_%288978291669%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/f/f6/Charlie_and_the_Chocolate_Factory_original_cover.jpg/220px-Charlie_and_the_Chocolate_Factory_original_cover.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/f/f6/Charlie_and_the_Chocolate_Factory_original_cover.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Charlie_and_the_Chocolate_Factory", "title": "Charlie and the Chocolate Factory", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/f/f6/Charlie_and_the_Chocolate_Factory_original_cover.jpg", "width": 640, "height": 932}, "title": "Charlie and the Chocolate Factory - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}