{"url": "https://www.rollingstone.com/tv/tv-news/ellen-degeneres-spoofs-taylor-swifts-look-what-you-made-me-do-video-watch-197784/", "text": "Ellen DeGeneres shared some surprising (read: fake) never-before-seen footage from Taylor Swift‘s record-breaking “Look What You Made Me Do” music video during her show Friday – and naturally, it included the talk show host herself.\n\n“So I want to talk about a friend of mine, if you don’t mind, for a minute,” DeGeneres said in the lead-up to the video reveal. “Her name is Taylor Swift. I didn’t know if you’d heard of her, but she’s a friend of mine.”\n\nDeGeneres then pointed to the music video’s success (it’s been viewed more than 425 million times since it premiered during the MTV VMAs late last month), but noted that it “could have been better.”\n\n“I was in the original, because I’m part of her squad,” the comedian explained. “Apparently, she cut me out … I don’t know. She’s threatened by me sometimes. Nice try, Tay-Tay, ’cause I got my hands on the real video. So, I’m gonna share it with all of you for the first time.”\n\nThe video spoof shows DeGeneres edited into several major scenes, including the one of Swift in a bathtub full of diamonds; DeGeneres lounges casually on the opposite end of the tub, playing with strands of glittering jewels as Swift expounds an unnamed nemesis.\n\nAt another point, DeGeneres pretends to be on the other end of the line when Swift delivers her piercing statement: “The old Taylor can’t come to the phone right now.”\n\n“Why not?” DeGeneres demands.\n\n“Why? Oh, ’cause she’s dead,” Swift replies.\n\n“Then who am I playing footsies with?” DeGeneres asks, looking puzzled. “Somebody’s got a little attitude today.”\n\nAt the end of the spoof, DeGeneres shows off her own collection of former selves, including “Tipsy,” “Scarlett Kardashian,” “cowboy Ellen” and “twerking Ellen,” whom she dubs her favorite.\n\nWatch the clip above.", "images": ["https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2022/assets/public/lazyload-fallback.gif", "https://www.rollingstone.com/wp-content/uploads/2018/06/ellen-swift-62f0c614-6b0d-4296-9fbe-1983d0003cd6.jpg?w=500&h=375&crop=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/ellen-swift-62f0c614-6b0d-4296-9fbe-1983d0003cd6.jpg?w=500&h=375&crop=1", "keywords": [], "authors": ["Joyce Chen"], "canonical_link": "https://www.rollingstone.com/tv-movies/tv-movie-news/ellen-degeneres-spoofs-taylor-swifts-look-what-you-made-me-do-video-watch-197784/", "title": "Ellen DeGeneres Spoofs Taylor Swift’s Look What You Made Me Do – Rolling Stone", "meta_data": {"theme-color": "#df3535", "viewport": "width=device-width, initial-scale=1.0", "description": "Ellen DeGeneres inserts herself into Swift's visual narrative, including diamond-filled bathtub scene.", "news_keywords": "Ellen DeGeneres, Taylor Swift", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "rollingstone", "pmc-page_type": "article", "articleid": 197784, "author": "Joyce Chen", "pmc-category": "TV & Movies,TV & Movies News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-09-22T18:19:36"}, "pmc-tag": "Ellen DeGeneres,Taylor Swift", "title": "Ellen DeGeneres Spoofs Taylor Swift’s ‘Look What You Made Me Do’ Video: Watch", "pageclass": "article", "pmc-is_free": "no", "pmc-branded-content": "no", "pmc-evergreen": "no"}, "generator": "WordPress 6.0.2", "author": "Joyce Chen", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "RS", "application-name": "RS", "content_type": "Article", "post_id": 197784, "title": "Ellen DeGeneres Spoofs Taylor Swift's 'Look What You Made Me Do' Video: Watch", "published_at": "2017-09-22 18:19:36", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/ellen-swift-62f0c614-6b0d-4296-9fbe-1983d0003cd6.jpg?w=1024", "comment_count": 0, "tags": "Taylor Swift", "topics": "TV & Movies News", "body": "Ellen DeGeneres shared some surprising (read: fake) never-before-seen footage from Taylor Swift's record-breaking \"Look What You Made Me Do\" music video during her show Friday – and naturally, it included the talk show host herself.\"So I want to talk about a friend of mine, if you don't mind, for a minute,\" DeGeneres said in the lead-up to the video reveal. \"Her name is Taylor Swift. I didn't know if you'd heard of her, but she's a friend of mine.\"DeGeneres then pointed to the music video's success (it's been viewed more than 425 million times since it premiered during the MTV VMAs late last month), but noted that it \"could have been better.\"\"I was in the original, because I'm part of her squad,\" the comedian explained. \"Apparently, she cut me out … I don't know. She's threatened by me sometimes. Nice try, Tay-Tay, 'cause I got my hands on the real video. So, I'm gonna share it with all of you for the first time.\"The video spoof shows DeGeneres edited into several major scenes, including the one of Swift in a bathtub full of diamonds; DeGeneres lounges casually on the opposite end of the tub, playing with strands of glittering jewels as Swift expounds an unnamed nemesis.At another point, DeGeneres pretends to be on the other end of the line when Swift delivers her piercing statement: \"The old Taylor can't come to the phone right now.\"\"Why not?\" DeGeneres demands. \"Why? Oh, 'cause she's dead,\" Swift replies.\"Then who am I playing footsies with?\" DeGeneres asks, looking puzzled. \"Somebody's got a little attitude today.\"At the end of the spoof, DeGeneres shows off her own collection of former selves, including \"Tipsy,\" \"Scarlett Kardashian,\" \"cowboy Ellen\" and \"twerking Ellen,\" whom she dubs her favorite.Watch the clip above.", "fb": {"pages": 10664530778}, "onesignal": "wordpress-plugin", "og": {"type": "article", "title": "Ellen DeGeneres Spoofs Taylor Swift's 'Look What You Made Me Do': Watch", "url": "https://www.rollingstone.com/tv-movies/tv-movie-news/ellen-degeneres-spoofs-taylor-swifts-look-what-you-made-me-do-video-watch-197784/", "description": "Talk show host inserts herself into Swift’s visual narrative, including diamond-filled bathtub scene", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/ellen-swift-62f0c614-6b0d-4296-9fbe-1983d0003cd6.jpg?w=500&h=375&crop=1", "width": 1024, "height": 576, "alt": "ELLEN - Taylor Swift Spoof"}, "locale": "en_US"}, "article": {"published_time": "2017-09-22T18:19:36+00:00", "modified_time": "2018-06-25T14:48:21+00:00"}, "twitter": {"site": "@RollingStone", "card": "summary_large_image", "title": "Ellen DeGeneres Spoofs Taylor Swift’s ‘Look What You Made Me Do’ Video: Watch", "description": "Ellen DeGeneres inserts herself into Swift's visual narrative, including diamond-filled bathtub scene.", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/ellen-swift-62f0c614-6b0d-4296-9fbe-1983d0003cd6.jpg?w=1024"}, "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2022/08/cropped-Rolling-Stone-Favicon.png?w=270"}, "movies": [], "publish_date": 1506104376.0, "source": "https://www.rollingstone.com", "summary": ""}