{"url": "https://www.hollywoodreporter.com/live-feed/outlander-print-shop-reunion-episode-explained-a-malcolm-recap-1050603", "text": "[Warning: This story contains spoilers from the “A. Malcolm” episode of Starz’s Outlander.]\n\nFollowing a prolongued wait, Starz’s Outlander finally delivered its big print shop reunion between Jamie (Sam Heughan) and Claire (Caitriona Balfe) on Sunday, delivering the most iconic moment from Diana Gabaldon’s series in grand fashion.\n\nThe time-travel romance drama slowed from its usual breakneck pace to relish the moment its star-crossed lovers — separated after 20 years apart — finally reunited as the supersized episode brought the key scene from Voyager to life. From Jamie’s fainting at the sight of his long-lost wife to meeting Mr. Willoughby (Gary Young) and Young Ian (John Bell) and the first time he slept with Claire after their long-awaited reunion, “A. Malcolm” played out almost exactly as it does in the book.\n\nThat isn’t to say that there weren’t some changes from the source material. Among them: when Jamie told Claire about his son Willie (Clark Butler) after she showed him photos of Brianna (Sophie Skelton). (That scene doesn’t play out until much later in the book.)\n\nTo hear Outlander executive producer and “A. Malcolm” writer Matthew B. Roberts tell it, that deviation was the biggest challenge when it came to bringing the important moment to life.\n\n“I wanted to stay as close to that median point of the source material as possible and not stray too far to either side of that,” Roberts tells The Hollywood Reporter. “I wanted to keep [things] as faithful to the source material as I could, from beginning to end, because of what has already come before this. We had debates in the writers room about what to keep and what to add and what adding something might do to the scene.”\n\nAlthough he was reluctant to add in the Willie change, Roberts ultimately came around in the end. “It took me a while to figure out how to make that work in the scheme of the scene,” he says. “That was a tough add.”\n\nBut as excited as viewers were for the heavily promoted episode, Roberts says he was “torn” about it actually airing. “I’m both very excited that fans see it and I’m dreading that they see it,” he says, lamenting the fact that the episode was “built up” too much for his liking. “The wedding episode wasn’t built up like this, it just kind of happened, and even ‘Faith’ in season two wasn’t anticipated like this. For this one, there is quite a big build-up and I don’t want people to be disappointed because of that.”\n\nRoberts is quick to remind viewers who may feel disappointed in any changes that while they are making the best adaptation of the Outlander books as possible, they’re not doing a word-for-word re-creation of Gabaldon’s series. “I always like to say that the book is the parent and the television show is the child,” he says. “We’re doing an adaptation with the same DNA but it’s a different, living, breathing creature.”\n\nBelow, Roberts talks with THR about what went into the making the most iconic episode of the series, why he waited three years to write “A. Malcolm” and more.\n\nDid you actively request to write this episode or was it assigned to you?\n\nI picked it. From when we were in the first season, writers were picking episodes, and I just said, “I’ll wait until this one.” I used my big pick for this one, because I knew once we officially got the pick up [for season three] that it was going to be the big episode and I wanted to give it a try. I was lucky enough to get, in the first season, the spanking episode and I knew that that was going to be a big one as well. That was assigned to me and I was really happy about it because I like to write the episodes when it’s really focused on Jamie and Claire and their dynamics, their relationship. Writing battle scenes and sword fights aren’t as exciting to write for this show as the Jamie and Claire scenes. Outlander is literally about Jamie and Claire, so those are the scenes I enjoy.\n\nThere have been major deviations from the book already this season, so did you set out to make any intentional changes in this episode?\n\nNo, this one, for me, was really the one to stay faithful. The way we planned it within the season, we always knew we were going to take a pause. Most episodes have a lot of plot in them to take you through the story. We have 900 pages of book and only 13 episodes, so you have to keep it plotted out with drive for each episode. This particular one we decided to take a step back, take a breather, so to speak, and let the characters get to know each other again. However long that takes, that’s how long it takes. I just let the reunion happen. We rehearsed this episode more than any other, so we did give a lot of time and effort to make this special, especially for the actors, because they hadn’t really spent a lot of time together over the first half of this season. They were in separate scenes almost the whole time until now.\n\nSo this was their reunion offscreen, too? That certainly adds some extra authenticity to it.\n\nYes. Cait and Sam are really great together, but they just didn’t have time onscreen together for the first half. So we rehearsed quite a bit and gave it a couple extra days for filming, too.\n\nDid you know from the start that the episode would be supersized?\n\nWe told Starz that this should be a luxurious episode, one that we let breathe and don’t rush through the scenes, don’t pace things up, just let it be what it is. So we did, and that’s why it came out to 74 minutes.\n\nHow did you decide where to end the episode, with Claire getting attacked by a mysterious man in the brothel after Jamie left?\n\nIt was originally going to end a little bit later where Claire walks into that room and the man, that fight was going to go a little bit farther. We decided to trim the edges off of that and just have it end as more of a cliffhanger. To carry that on further actually diminished the reunion. It started to become another story, and we didn’t want that. With the man there, we let that story start in the next episode.\n\nThe credit sequence for this episode with the names shown on printed pages is beautiful. How did you decide on that method?\n\nI am lucky enough to have been tasked with those episodic title cards, and the printing presses we use on the show actually work. They are practical printing presses. So when I saw one for the first time, I got the idea of incorporating showing how printing works to do the title cards like that. The benefit was I wrote this episode, so I have the printed title card from this episode framed and hanging in my office.\n\nThe episode feels like a follow-up to the wedding installment from season one, especially with the focus on Jamie and Claire’s “first” love scenes. Was it your intention to make this a sequel for the wedding episode?\n\nI wasn’t even thinking about that in the sense of redoing it or paying homage to it. This had to be different. We talked about this with everybody [in the writers room]: How would you feel going back after 20 years and seeing someone you were deeply in love with? This had to feel new and clumsy. There’s the initial anticipation for the audience and characters. Claire was anticipating this for a few weeks, and that’s why we did the reset.\n\nStarting the episode with Jamie’s point of view a few hours before Claire arrives was a bit of a tease for viewers, considering where the last episode left off.\n\nThat was something we planned to do [different from the book]. In the book, sometimes you can get so locked in to just Claire’s point of view, and this is Jamie and Claire’s story. We wanted to show that he was just going to get blindsided. And from that point on, they’re together and it becomes their shared story again. That carries us through. We knew “Droughtlander” took place, we knew it was a long wait, and we knew that for a lot of the fans, it felt like they waited 20 years for this moment too. To give it to them two times, I don’t think it was a bad thing.\n\nNear the end of the episode, Claire comes face-to-face with her nephew Young Ian, and those who have read Voyager know how important of a character he is. What did you need to get right about that first meeting?\n\nTo introduce Young Ian, he becomes such an important character for this season, so that initial meeting, we had to do it right and make it special. John Bell brings a likeability to the character. It was important to build that chemistry because of what happens going forward in the season. If there was no spark and no light there, then the whole drive for the second half of the season gets watered down.\n\nThat final scene was shocking to watch as Claire gets attacked. Where does the next episode will pick up?\n\nWithout giving away too much, as the book did so well, Jamie and Claire get back together and they find a tentative footing in their relationship. We took a breath in this episode to say let’s not throw any obstacles at them. The only obstacles thrown at them is themselves, them getting to know each other again. Episode seven and going forward is, as always, the world against Claire and Jamie. All the obstacles you can throw at them, we do.\n\n***\n\nOutlander airs Sundays at 8 p.m. ET/PT on Starz.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/f5a3bbb5-2c14-4d44-b03e-bb288791c127_-_h_2017.jpg?w=1296&h=730&crop=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/f5a3bbb5-2c14-4d44-b03e-bb288791c127_-_h_2017.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/f5a3bbb5-2c14-4d44-b03e-bb288791c127_-_h_2017.jpg?w=1024", "keywords": [], "authors": ["Sydney Bucksbaum"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/outlander-print-shop-reunion-episode-explained-a-malcolm-recap-1050603/", "title": "‘Outlander’: Inside the Making of the Iconic Print Shop Reunion", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "\"Most scripts we have a certain page count you want to stay around,\" executive producer Matthew B. Roberts tells THR. \"I didn't stick to a page count. I just let the reunion happen — where it ended is where it ended.\"", "news_keywords": "Outlander", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Sydney Bucksbaum", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1050603, "title": "'Outlander': Inside the Making of the Iconic Print Shop Reunion", "published_at": "2017-10-22 18:00:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/f5a3bbb5-2c14-4d44-b03e-bb288791c127_-_h_2017.jpg?w=1024", "comment_count": 0, "tags": "Outlander", "topics": "TV News", "body": "[Warning: This story contains spoilers from the \"A. Malcolm\" episode of Starz's Outlander.]\r\nFollowing a prolongued wait, Starz's Outlander finally delivered its big print shop reunion between Jamie (Sam Heughan) and Claire (Caitriona Balfe) on Sunday, delivering the most iconic moment from Diana Gabaldon's series in grand fashion.\r\nThe time-travel romance drama slowed from its usual breakneck pace to relish the moment its star-crossed lovers —  separated after 20 years apart — finally reunited as the supersized episode brought the key scene from Voyager to life. From Jamie's fainting at the sight of his long-lost wife to meeting Mr. Willoughby (Gary Young) and Young Ian (John Bell) and the first time he slept with Claire after their long-awaited reunion, \"A. Malcolm\" played out almost exactly as it does in the book.\r\nThat isn't to say that there weren't some changes from the source material. Among them: when Jamie told Claire about his son Willie (Clark Butler) after she showed him photos of Brianna (Sophie Skelton). (That scene doesn't play out until much later in the book.) \r\nTo hear Outlander executive producer and \"A. Malcolm\" writer Matthew B. Roberts tell it, that deviation was the biggest challenge when it came to bringing the important moment to life.\r\n\r\n\"I wanted to stay as close to that median point of the source material as possible and not stray too far to either side of that,\" Roberts tells The Hollywood Reporter. \"I wanted to keep [things] as faithful to the source material as I could, from beginning to end, because of what has already come before this. We had debates in the writers room about what to keep and what to add and what adding something might do to the scene.\"\r\nAlthough he was reluctant to add in the Willie change, Roberts ultimately came around in the end. \"It took me a while to figure out how to make that work in the scheme of the scene,\" he says. \"That was a tough add.\"\r\nBut as excited as viewers were for the heavily promoted episode, Roberts says he was \"torn\" about it actually airing. \"I'm both very excited that fans see it and I'm dreading that they see it,\" he says, lamenting the fact that the episode was \"built up\" too much for his liking. \"The wedding episode wasn't built up like this, it just kind of happened, and even 'Faith' in season two wasn't anticipated like this. For this one, there is quite a big build-up and I don't want people to be disappointed because of that.\"\r\nRoberts is quick to remind viewers who may feel disappointed in any changes that while they are making the best adaptation of the Outlander books as possible, they're not doing a word-for-word re-creation of Gabaldon's series. \"I always like to say that the book is the parent and the television show is the child,\" he says. \"We're doing an adaptation with the same DNA but it's a different, living, breathing creature.\"\r\nBelow, Roberts talks with THR about what went into the making the most iconic episode of the series, why he waited three years to write \"A. Malcolm\" and more.\r\n\r\nDid you actively request to write this episode or was it assigned to you?\r\nI picked it. From when we were in the first season, writers were picking episodes, and I just said, \"I'll wait until this one.\" I used my big pick for this one, because I knew once we officially got the pick up [for season three] that it was going to be the big episode and I wanted to give it a try. I was lucky enough to get, in the first season, the spanking episode and I knew that that was going to be a big one as well. That was assigned to me and I was really happy about it because I like to write the episodes when it's really focused on Jamie and Claire and their dynamics, their relationship. Writing battle scenes and sword fights aren't as exciting to write for this show as the Jamie and Claire scenes. Outlander is literally about Jamie and Claire, so those are the scenes I enjoy.\r\nThere have been major deviations from the book already this season, so did you set out to make any intentional changes in this episode?\r\nNo, this one, for me, was really the one to stay faithful. The way we planned it within the season, we always knew we were going to take a pause. Most episodes have a lot of plot in them to take you through the story. We have 900 pages of book and only 13 episodes, so you have to keep it plotted out with drive for each episode. This particular one we decided to take a step back, take a breather, so to speak, and let the characters get to know each other again. However long that takes, that's how long it takes. I just let the reunion happen. We rehearsed this episode more than any other, so we did give a lot of time and effort to make this special, especially for the actors, because they hadn't really spent a lot of time together over the first half of this season. They were in separate scenes almost the whole time until now.\r\n\r\nSo this was their reunion offscreen, too? That certainly adds some extra authenticity to it.\r\nYes. Cait and Sam are really great together, but they just didn't have time onscreen together for the first half. So we rehearsed quite a bit and gave it a couple extra days for filming, too.\r\nDid you know from the start that the episode would be supersized?\r\nWe told Starz that this should be a luxurious episode, one that we let breathe and don't rush through the scenes, don't pace things up, just let it be what it is. So we did, and that's why it came out to 74 minutes.\r\nHow did you decide where to end the episode, with Claire getting attacked by a mysterious man in the brothel after Jamie left? \r\nIt was originally going to end a little bit later where Claire walks into that room and the man, that fight was going to go a little bit farther. We decided to trim the edges off of that and just have it end as more of a cliffhanger. To carry that on further actually diminished the reunion. It started to become another story, and we didn't want that. With the man there, we let that story start in the next episode.\r\nThe credit sequence for this episode with the names shown on printed pages is beautiful. How did you decide on that method?\r\nI am lucky enough to have been tasked with those episodic title cards, and the printing presses we use on the show actually work. They are practical printing presses. So when I saw one for the first time, I got the idea of incorporating showing how printing works to do the title cards like that. The benefit was I wrote this episode, so I have the printed title card from this episode framed and hanging in my office.\r\n\r\nThe episode feels like a follow-up to the wedding installment from season one, especially with the focus on Jamie and Claire's \"first\" love scenes. Was it your intention to make this a sequel for the wedding episode?\r\nI wasn't even thinking about that in the sense of redoing it or paying homage to it. This had to be different. We talked about this with everybody [in the writers room]: How would you feel going back after 20 years and seeing someone you were deeply in love with? This had to feel new and clumsy. There's the initial anticipation for the audience and characters. Claire was anticipating this for a few weeks, and that's why we did the reset.\r\nStarting the episode with Jamie's point of view a few hours before Claire arrives was a bit of a tease for viewers, considering where the last episode left off.\r\nThat was something we planned to do [different from the book]. In the book, sometimes you can get so locked in to just Claire's point of view, and this is Jamie and Claire's story. We wanted to show that he was just going to get blindsided. And from that point on, they're together and it becomes their shared story again. That carries us through. We knew \"Droughtlander\" took place, we knew it was a long wait, and we knew that for a lot of the fans, it felt like they waited 20 years for this moment too. To give it to them two times, I don't think it was a bad thing.\r\nNear the end of the episode, Claire comes face-to-face with her nephew Young Ian, and those who have read Voyager know how important of a character he is. What did you need to get right about that first meeting?\r\nTo introduce Young Ian, he becomes such an important character for this season, so that initial meeting, we had to do it right and make it special. John Bell brings a likeability to the character. It was important to build that chemistry because of what happens going forward in the season. If there was no spark and no light there, then the whole drive for the second half of the season gets watered down.\r\nThat final scene was shocking to watch as Claire gets attacked. Where does the next episode will pick up?\r\nWithout giving away too much, as the book did so well, Jamie and Claire get back together and they find a tentative footing in their relationship. We took a breath in this episode to say let's not throw any obstacles at them. The only obstacles thrown at them is themselves, them getting to know each other again. Episode seven and going forward is, as always, the world against Claire and Jamie. All the obstacles you can throw at them, we do.\r\n***\r\nOutlander airs Sundays at 8 p.m. ET/PT on Starz.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Outlander’: Inside the Making of the Iconic Print Shop Reunion", "url": "https://www.hollywoodreporter.com/tv/tv-news/outlander-print-shop-reunion-episode-explained-a-malcolm-recap-1050603/", "description": "“Most scripts we have a certain page count you want to stay around,” executive producer Matthew B. Roberts tells THR. “I didn’t stick to a page count. I just let the reunion…", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/f5a3bbb5-2c14-4d44-b03e-bb288791c127_-_h_2017.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-10-22T18:00:00+00:00", "modified_time": "2017-10-24T19:03:17+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Outlander’: Inside the Making of the Iconic Print Shop Reunion", "description": "“Most scripts we have a certain page count you want to stay around,” executive producer Matthew B. Roberts tells THR. “I didn’t stick to a page count. I just let the reunion…", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/f5a3bbb5-2c14-4d44-b03e-bb288791c127_-_h_2017.jpg?w=1296"}}, "movies": [], "publish_date": 1508695200.0, "source": "https://www.hollywoodreporter.com", "summary": ""}