{"url": "https://www.interviewmagazine.com/film/penelope-cruz-gwyneth-paltrow", "text": "In 2009, Penélope Cruz became the first Spanish actress to win an Academy Award—a sky-high career peak if ever there was one. Since her film debut in 1992, she made the transatlantic journey from art-house muse to major Hollywood force, mesmerizing audiences with her volcanic on-screen range. Cruz can play many things, but she’s at her best when tapping into her deep well of strength and passion, bringing to life characters on the brink of meltdown: wives and mistresses scorned, lovers in the throes of desire, even the fiery daughter of a pirate. It was her turn as a manic artist in Woody Allen’s Vicky Cristina Barcelona (2008) which earned her the Oscar, but her dozens of roles big and small before that—in Alejandro Amenábar’s Open Your Eyes (1998); Stephen Frears’s The Hi-Lo Country (1998); Pedro Almodóvar’s All About My Mother (1999) and Volver (2006)—secured her status as a peerless, fearless star.\n\nOf late, Cruz has gone a bit under the radar, taking time to raise a family with her husband (and frequent co-star), Javier Bardem. But this fall brings another wave of transformation her way. She will be seen next month in Murder on the Orient Express, Kenneth Branagh’s star-studded adaptation of the Agatha Christie novel. As a missionary named Pilar Estravados, Cruz adds a Spanish twist to the role Ingrid Bergman made famous in the book’s first film adaptation in 1974. A slew of familiar faces round out the cast of the high-speed mystery: Willem Dafoe, Judi Dench, Johnny Depp, and Michelle Pfeiffer, to name a few. And then early next year she will embody the inimitable Donatella Versace in what might be the most anticipated TV event of 2018: Ryan Murphy’s The Assassination of Gianni Versace: American Crime Story.\n\nIn anticipation of her next big moment, Cruz had an intimate phone conversation with a friend who has been there since the early days, before she made history: Oscar winner Gwyneth Paltrow.\n\nGWYNETH PALTROW: I was trying to remember when we first met, but I’m afraid I can’t.\n\nPENÉLOPE CRUZ: We had lunch at Madeo in Los Angeles. We were alone and talking about our deepest secrets, as if we had known each other for 20 years. It was around the time I was doing All the Pretty Horses [2000].\n\nPALTROW: Wow. We’ve been friends for a long time. We’ve been through so much together.\n\nCRUZ: And even though we live so far away and don’t spend nearly enough time together, when I see you, it’s like it was only yesterday.\n\nPALTROW: I was thinking the other day about how you used to study dance. Was your goal to become â\u0080¨a ballerina?\n\nCRUZ: That’s what I wanted as a little girl. By the time I went to ballet school at age 4, I was already asking to play the role of Carmen. I didn’t realize then that the reason I liked dancing was because it was just another form of acting. I was hard-core, training something like five hours a day, six days a week. But when I did my first movie, when I was around 17, I just fell in love with acting. That’s when I stopped dancing.\n\nPALTROW: Do you miss it?\n\nCRUZ: I miss the freedom I felt when I was dancing. I remember it as some kind of trance. I imagine singing is like that for you. You have such an amazing voice.\n\nPALTROW: It’s totally like that. How did you get your first job?\n\nCRUZ: I got an agent when I was 15, and she sent me to a casting for Jamón Jamón [1992]. And I got the job. For both Javier and I, that was the movie that actually started both our careers.\n\nPALTROW: You were 17 when you did that?\n\nCRUZ: I think I was, but I was lying so much about my age that I can’t be sure.\n\nPALTROW: Most actresses try to make themselves younger, but you were making yourself older.\n\nCRUZ: I’ve spent most of my career trying to make myself older, for different reasons. Journalists have been asking me, since I was, like, 22, “Are you afraid of aging?” That is such a crazy question for a 22-year-old girl or, for that matter, for a 42-year-old. I combat that craziness by refusing to answer the question.\n\nPALTROW: It’s amazing, Hollywood’s obsession with the aging of women. And how much scrutiny we get for being whatever age we are.\n\nCRUZ: My mom worked very hard to raise us, as did my dad, without bullshit. I’ve always had a real sense of rootedness in family and reality. It’s not like I’m proud of the values I have, because I don’t feel like they’re up to me—they just come from the way I was raised. I’m rooted by the things I’ve seen in my mom, the things I admire in her. And in my father. When it comes to talking about aging as an actress, I feel like, “What the fuck? I’m not going to give you even two minutes to honor your question. It doesn’t deserve that.” Something changed when I gave birth to my daughter. I started thinking, “Come on, it’s 2017. Why do women still have to be talking about this? It’s crazy.” That sense only got bigger when I had children.\n\nPALTROW: Of all my friends, I think you love acting the most. When you talk about something you’re doing, when you’re preparing for something, you have this enthusiasm and this passion that, from my perspective, has never waned. Speaking for myself, I don’t feel the same passion for it that I used to.\n\nCRUZ: It’s helped, I’m happy to say, that my ego has gotten smaller over time. I used to be so afraid about what people were going to think of me, if I was going to be accepted, if I was going to be loved. I put a lot of energy into the perception of myself. When I became a mother—almost seven years ago—something very deep changed in me, where I really don’t care about a lot of the stuff I used to care about before. That’s part of growing up, and now I have to go through other tests that life will put in front of me. I have new fears now.\n\nPALTROW: Around the time I turned 40, I felt completely liberated from other people’s perceptions or expectations of me.\n\nCRUZ: I wouldn’t for a second change the way I feel now for the way I felt in my twenties. How I see the world, how I look at acting—everything has changed. It has, in a way, brought me back to the beginning, when I was 4 and loving dancing, loving getting in the skin of other characters and exploring the beauty of human behavior. I get so much happiness from being a student again, from exploring. Whatever happens with the result, if I’ve had that process, I feel like it has been something good, that it has taught me something new. If I’m 80 and I have a new character in my hands and a new story to tell, I’m going to feel that same healthy fear. It’s like food for me.\n\nPALTROW: I admire that. It’s so cool to hear how it feeds you like that.\n\nCRUZ: Speaking of food, I admire what you are doing. I wrote you as much in an e-mail a few months ago, saying, “It’s very brave what you do with Goop. You’re opening a lot of people’s eyes.” Sometimes people are resistant to look at those things, but I feel like that’s because, in a way, they know you’re talking a lot of truth. There are very few people in the world who are making real changes. What you’re doing is huge. The ones who don’t know, they will know soon.\n\nPALTROW: Thank you so much, but I need to get back to my interview here. I am so excited for Murder on the Orient Express. I was an Agatha Christie obsessive when I was a teenager.\n\nCRUZ: I love Kenneth Branagh and everybody in this cast. Kenneth called me and said, “I’m thinking about you to play Pilar. Would you like to do this?” I said yes. The 13 of us together on that train, it was incredible.\n\nPALTROW: Were you really on a train?\n\nCRUZ: Even though it was fake, we really felt like we were traveling. Everywhere I looked, I was like, “There’s Judi Dench! And Michelle Pfeiffer! And this one! And that one!” I taught all of them to play Werewolves and Villagers. I would set up a time and place for us all to play, but then I wouldn’t go. And then the next day, everyone would come up to me and say, “It’s your fault we didn’t sleep. We played for seven hours.” It was the perfect game for this cast because it’s all about lying and manipulating.\n\nPALTROW: How does it work when you go on location? Does the whole family come with you?\n\nCRUZ: Yes. We try to take turns when it comes to working, except, of course, when we’re in the same movie, like with Loving Pablo.\n\nPALTROW: Did you shoot that in Colombia?\n\nCRUZ: Yeah, in Bogotá.\n\nPALTROW: I’ve always wanted to go.\n\nCRUZ: It was great being there. The people were so sweet to us. And it was very important to be there, because we had to really master the accent in Spanish and then translate it into English. It’s a very different accent than the way we speak.\n\nPALTROW: The other project of yours that I’m dying over is The Assassination of Gianni Versace. I saw pictures. You look incredible as Donatella.\n\nCRUZ: From the moment I got the call from Ryan Murphy, I thought, “Why did you think of me for that character? That’s very … interesting.” I know her a little bit, and I really like her. I had a few questions about how he was going to handle her portrayal, but he’s so classy, and he’s very respectful to people. This is a delicate story, because I’m playing someone who is alive, someone who lost her brother in a horrible way, and someone who still misses him very much 20 years later. I was not used to the rhythm of doing television.\n\nPALTROW: It’s fast.\n\nCRUZ: Getting four monologues two days before the shoot? And I was doing English with an Italian accent! I was like, “This is impossible.” But then you just do it.\n\nPALTROW: When I did Glee, I was like, “What do you mean we’re shooting a whole musical number in half a day?” I couldn’t believe it. And then after TV, you go back to doing a movie and you’re like, “This is so slow!”\n\nCRUZ: I know! Now I’m shooting a movie with Asghar Farhadi, the director of The Salesman and A Separation, in Spain. I look at my dialogue and I’m like, “Uhh, okay. I got this.” [laughs]\n\nPALTROW: How did you go about preparing to play Donatella Versace? Did you watch interviews?\n\nCRUZ: I worked a lot with a dialogue coach to find the way that Donatella speaks, which is a little different from the way she spoke in the ’90s. The accent that she has, it’s Italian with a very international flavor—very rock ’n’ roll. I didn’t want to do an imitation of Donatella, or a caricature. I wanted to try to capture the essence of who she is.\n\nPALTROW: Did you speak to her about it?\n\nCRUZ: A little bit. I needed that conversation. I really hope that when she sees the show, she’s going to be happy. I’m sure there are going to be scenes that are hard for her to watch, because it’s a lot about the loss of her brother, which, of course, I have so much respect for. I did it with all my love. From that place of devastation, she had to keep this company going in his honor. I don’t know if she ever said this, but it was a way of keeping him alive.\n\nPALTROW: Do you think you’ll do more TV?\n\nCRUZ: Why not? I would love to work with Ryan and his team again.\n\nPALTROW: Have you done a play?\n\nCRUZ: No, I’m not brave enough to do that yet.\n\nPALTROW: Do you want to?\n\nCRUZ: At some point, maybe when my kids are older. Now isn’t the time to commit to something that’s every day at the same time for months. I studied theater for years, and I’ve never been more nervous than when I was in front of the other students. Somebody offered me Tennessee Williams’s The Rose Tattoo on Broadway, and I was really tempted, but I said no. Call me a coward.\n\nPALTROW: It’s scary! I ask because for somebody who loves the craft as much as you do, I think you might really love it—once you get past the fear.\n\nCRUZ: Yes, I think once I do it it’s going to be such an addictive feeling. But not yet. [laughs]\n\nPALTROW: What is it like shooting a movie with Javier?\n\nCRUZ: The first time we worked together as a couple was in Loving Pablo. I was a little worried about playing these characters who are so cruel to one another—like, how was that going to work? But it went great. We were there to help each other and protect each other, and the director is one of our best friends. We felt like it was the three of us together.\n\nPALTROW: What do you like to do when you’re not working?\n\nCRUZ: We infrequently take holidays, because the kids are young and because of our jobs. I try to travel no more than we have to. I’ve only been away from my kids for a day and a half in almost seven years. I’ve had to do that three times, and I’m hoping it can stay that way. When I’m not working, I’m taking time to be a mother. I can manage in the kitchen, although I will never cook as well as you do.\n\nPALTROW: That’s not true.\n\nCRUZ: Yes, it is! I’ve never seen anything like it. When you cook, it’s like I’m eating in the best restaurant in the world. And you do it with such ease, like, “Oh, I’ll just put this gigantic chicken that has 25 different flavors in the oven—I’ve been working on it for the last five hours.” Your house is like a three-Michelin-star restaurant.\n\nPALTROW: You’re sweet, but the truth is that I just really like it. Okay, it’s getting late over there.\n\nCRUZ: Thank you, Gwyneth, so much for doing this.\n\nPALTROW: Oh my god, are you kidding? Te quiero mucho.\n\nCRUZ: Te quiero mucho. Ciao.\n\nGWYNETH PALTROW IS AN ACADEMY AWARD–WINNING ACTRESS, COOKBOOK AUTHOR, AND OWNER OF THE LIFESTYLE COMPANY GOOP. SHE WILL BE SEEN NEXT YEAR IN THE FILM AVENGERS: INFINITY WAR.", "images": ["https://www.interviewmagazine.com/wp-content/themes/interview/images/icon-filled-twitter.png", "https://www.interviewmagazine.com/wp-content/themes/interview/images/icon-hamburger.png", "https://www.interviewmagazine.com/wp-content/uploads/2019/08/Interview_Star-Map_08-29-2019-1-391x308.jpg", "https://www.interviewmagazine.com/wp-content/uploads/2017/10/P1.jpg", "https://www.interviewmagazine.com/wp-content/themes/interview/images/icon-tiktok.png", "https://www.interviewmagazine.com/wp-content/themes/interview/images/icon-filled-facebook.png", "https://www.interviewmagazine.com/wp-content/uploads/2017/09/most-read.gif", "https://www.interviewmagazine.com/wp-content/uploads/2021/09/Screen-Shot-2022-03-17-at-5.56.26-PM-391x308.png", "https://www.interviewmagazine.com/wp-content/uploads/2021/09/divine-balenciaga-2-391x308.jpg", "https://www.interviewmagazine.com/wp-content/themes/interview/images/interview-logo-white.png", "https://www.interviewmagazine.com/wp-content/uploads/2021/11/08ZXpIsA-391x308.jpeg", "https://www.interviewmagazine.com/wp-content/uploads/2019/09/credit_@myles_standish_javier_bardem__W1A9308-Edit-Edit-391x308.jpg", "https://www.interviewmagazine.com/wp-content/uploads/2022/09/homepage-logo-12.png", "https://www.interviewmagazine.com/wp-content/themes/interview/images/icon-instag.png", "https://www.interviewmagazine.com/wp-content/themes/interview/images/icon-twitter.png", "https://www.interviewmagazine.com/wp-content/themes/interview/images/icon-search.png", "https://www.interviewmagazine.com/wp-content/themes/interview/images/icon-filled-email.png", "https://www.interviewmagazine.com/wp-content/uploads/2020/01/Screen-Shot-2020-01-30-at-2.59.45-PM-391x308.png", "https://www.facebook.com/tr?id=465306474449381&ev=PageView&noscript=1", "https://www.interviewmagazine.com/wp-content/uploads/2017/10/PenelopeCruzThumb.jpg"], "top_img": "https://www.interviewmagazine.com/wp-content/uploads/2017/10/PenelopeCruzThumb.jpg", "keywords": [], "authors": ["Trey Taylor", "Gwyneth Paltrow"], "canonical_link": "https://www.interviewmagazine.com/film/penelope-cruz-gwyneth-paltrow", "title": "Interview Magazine", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "google-site-verification": "qgshcNrH-xia3CShCdje3SOMYfZKesrpBM93ORIvNY8", "og": {"locale": "en_US", "type": "article", "title": "Penelope Cruz - Interview Magazine", "description": "In 2009, Penélope Cruz became the first Spanish actress to win an Academy Award—a sky-high career peak if ever there was one. Since her film debut in 1992, she made the transatlantic journey from art-house muse to major Hollywood force, mesmerizing audiences with her volcanic on-screen range.", "url": "https://www.interviewmagazine.com/film/penelope-cruz-gwyneth-paltrow", "site_name": "Interview Magazine", "image": {"identifier": "https://www.interviewmagazine.com/wp-content/uploads/2017/10/PenelopeCruzThumb.jpg", "width": 391, "height": 308, "type": "image/jpeg"}}, "article": {"publisher": "https://www.facebook.com/InterviewMagazineUS/", "published_time": "2017-10-04T16:00:43+00:00", "modified_time": "2017-10-05T20:39:32+00:00"}, "author": "Trey Taylor", "twitter": {"card": "summary_large_image", "creator": "@InterviewMag", "site": "@InterviewMag"}, "msapplication-TileImage": "https://www.interviewmagazine.com/wp-content/uploads/2017/08/cropped-int-favicon-1-500x500.png"}, "movies": [], "publish_date": 1507132843.0, "source": "https://www.interviewmagazine.com", "summary": ""}