{"url": "https://abc.go.com/shows/american-idol/news/updates/luke-bryan-lionel-richie-american-idol-judges", "text": "Country music superstar Luke Bryan and music icon Lionel Richie have signed on as judges for the beloved music competition series American Idol for its first season on ABC. They round out the panel of judges, alongside judge Katy Perry. Ryan Seacrest will return to host the series. The panel will make their debut appearance on ABC's Good Morning America on Wednesday, October 4. \"I'm excited at the chance to help some deserving artists reach their dreams,\" said Bryan. \"To be in a position in my career to help facilitate this along with the other judges is just a complete honor. It's gonna be a blast!\" \"I am very excited to be joining Katy, Luke and Ryan on American Idol,\" said Richie. \"As a singer, songwriter and producer, I feel I can bring a great deal of experience to the table. It's going to be so much fun!\"\n\n\"Luke and Lionel are the perfect additions to round out our panel of judges for American Idol on ABC,\" said Channing Dungey, president, ABC Entertainment. \"In their respective genres of music, both Luke and Lionel possess insurmountable popularity and award-winning talent that are undeniable, and we are lucky that they will help in paving the way for hopefuls pursuing their dreams on our stage.\"\n\nTrish Kinane, president of Entertainment Programming, FremantleMedia North America, executive producer and showrunner of American Idol, said, \"We have taken our time to get the right mix of amazing talent for the new Idol judging panel. Our viewers expect musical credibility, passion and a true concern for the contestants; and with Luke Bryan and Lionel Richie joining the brilliant Katy Perry, we have two more world-class musical powerhouses eager to get to work and identify the next generation of superstars.\"\n\nPeter Hurwitz, CEO and president of 19 Entertainment-parent Core Media Group, said, \"This extraordinary panel of judges speaks volumes about the continued power of the iconic American Idol brand. We are thrilled to have Lionel Richie and Luke Bryan join Katy Perry and, ultimately, millions of viewers as we begin this new era on ABC.\"\n\nYesterday, Bryan kicked off his ninth annual Farm Tour performing in six cities through October 7. Since the tour's inception in 2009, Bryan has awarded 50 scholarships to a local student from a farming family within the communities the tour has played. Bryan will also continue his Huntin', Fishin' and Lovin' Every Day Tour through October.\n\nBryan is a two-time Academy of Country Music and Country Music Association Entertainer of the Year, a five-time host of the ACM Awards and the 2017 Super Bowl LI national anthem performer. Luke has placed 18 singles at No.1, sold over 10 million albums and more than 40 million tracks with three billion music streams, and has performed for millions of fans on tour. He recently debuted a new single, \"Light It Up,\" which is the first song off a new album due out later this year.\n\nSinger-songwriter, record producer and international superstar Lionel Richie has a discography of albums and singles that are second to none. His music is part of the fabric of pop music; in fact, Richie is one of only two songwriters in history to achieve the honor of having No. 1 records for nine consecutive years. With more than 100 million albums sold worldwide, an Oscar®, a Golden Globe®, four Grammy Awards®, the distinction of MusicCares person of the year in 2016, and Kennedy Center Honoree in 2017, the Tuskegee, Alabama, native is a true music icon.\n\nRichie is known for his mega-hits such as \"Endless Love,\" \"Lady,\" \"Truly,\" \"All Night Long,\" \"Penny Lover,\" \"Stuck on You,\" \"Hello,\" \"Say You, Say Me,\" \"Dancing on the Ceiling,\" and one of the most important pop songs in history, \"We Are the World,\" written with Michael Jackson for USA for Africa. His song catalog also includes his early work with The Commodores, where he developed a groundbreaking style that defied genre categories, penning smashes such as \"Three Times a Lady,\" \"Still\" and \"Easy.\"\n\nRichie launched his Las Vegas headlining residency show, Lionel Richie – All the Hits, at The AXIS at Planet Hollywood Resort & Casino in April 2016. In an unforgettable evening featuring his brightest and best anthems which have defined the music icon's unparalleled career, Richie takes his fans on a spectacular musical journey, performing a variety of his seminal hits. With his most recent All the Hits, All Night Long Tour, Richie sold out arenas worldwide with a set list of his brightest and best anthems. In recent years, he also headlined festivals including Bonnaroo, Outside Lands and Glastonbury, drawing the festival's biggest crowd ever with more than 200,000 attendees.\n\nWhen American Idol debuted in the U.S., the series revolutionized television, pioneering the reality-competition genre and holding an unmatched record for being the highest-rated series for nearly a decade. The series also ushered in second-screen audience participation, being the first to introduce text-based and mobile voting. The Idol format has taken on original versions in 55 countries around the world, and American Idol itself has played to a worldwide audience of over 460 million across 53 countries. At its new home on ABC, American Idol will continue to be a force in the television landscape, reaching every corner of the country in its search for the next great music sensation.\n\nAmerican Idol is produced by FremantleMedia North America and 19 Entertainment, a division of CORE Media Group. Executive producers include FremantleMedia North America's Trish Kinane and Jennifer Mullin along with co-executive producer, Megan Wolflick. FremantleMedia International distributes the series worldwide.", "images": ["https://assets-cdn.watchdisneyfe.com/delta/assets/common/close.png", "https://assets-cdn.watchdisneyfe.com/delta/assets/common/search.png", "https://assets-cdn.watchdisneyfe.com/delta/assets/common/account.png", "https://assets-cdn.watchdisneyfe.com/delta/assets/abc/abc-nav.png", "https://cdn1.edgedatg.com/aws/v2/abc/AmericanIdol/blog/2076030/4a82397661c57680a74a921af2ed72f9/652x368-Q70_4a82397661c57680a74a921af2ed72f9.jpg", "https://assets-cdn.watchdisneyfe.com/delta/assets/common/ENT-Icon-Menu.svg", "https://cdn1.edgedatg.com/aws/migrated/cms/ABC/AmericanIdol/LBLRidol/06a36d43-e872-4e27-84c3-439cb62ac5b6.jpg", "https://cdn1.edgedatg.com/aws/v2/abc/AmericanIdol/showimages/946ff662a65b3192b1094729acd3d10e/700x234-Q80_946ff662a65b3192b1094729acd3d10e.png", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://assets-cdn.watchdisneyfe.com/delta/assets/common/ENT_heroLogo_Hulu@2x.png"], "top_img": "https://cdn1.edgedatg.com/aws/v2/abc/AmericanIdol/blog/2076030/4a82397661c57680a74a921af2ed72f9/652x368-Q70_4a82397661c57680a74a921af2ed72f9.jpg", "keywords": [], "authors": [], "canonical_link": "https://abc.com/shows/american-idol/news/updates/luke-bryan-lionel-richie-american-idol-judges", "title": "New American Idol Judges Announced for 2018 Season", "meta_data": {"og": {"url": "https://abc.com/shows/american-idol/news/updates/luke-bryan-lionel-richie-american-idol-judges", "app_id": 137585909851, "site_name": "ABC", "image": "https://cdn1.edgedatg.com/aws/v2/abc/AmericanIdol/blog/2076030/4a82397661c57680a74a921af2ed72f9/652x368-Q70_4a82397661c57680a74a921af2ed72f9.jpg", "description": "Country music superstar Luke Bryan and music icon Lionel Richie have signed on as judges for \"American Idol\" for its first season on ABC!", "title": "New American Idol Judges Announced for 2018 Season | American Idol", "locale": "en_US"}, "twitter": {"card": "summary_large_image", "site": "@{twitter.account}", "image": "https://cdn1.edgedatg.com/aws/v2/abc/AmericanIdol/blog/2076030/4a82397661c57680a74a921af2ed72f9/652x368-Q70_4a82397661c57680a74a921af2ed72f9.jpg"}, "fb": {"app_id": 137585909851}, "apple-itunes-app": "app-id=364191819, app-argument=https://abc.com/watch-live", "keywords": "New American Idol Judges Announced for 2018 Season, American Idol blogs", "description": "Country music superstar Luke Bryan and music icon Lionel Richie have signed on as judges for \"American Idol\" for its first season on ABC!", "google-play-app": "app-id=com.disney.datg.videoplatforms.android.abc", "msApplication-PackageFamilyName": "ABC.ABCPlayer", "msvalidate.01": "0EABD001D404EA9DDE2025E9E4F14CAF", "msApplication-ID": "App", "msapplication-TileColor": "#2D2D2D", "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "msapplication-TileImage": "//cdn1.edgedatg.com/tml/assets/content/abc/abc-icon-2021.png", "google-site-verification": "J8rQKaTUp41LleWIqACFUI7j_iS4bNJvNc2KwTwOcQ8", "format-detection": "telephone=no"}, "movies": [], "publish_date": null, "source": "https://abc.go.com", "summary": ""}