{"url": "https://www.celebritynetworth.com/richest-celebrities/actors/jenna-bush-hager-net-worth/", "text": "What is Jenna Bush Hager's Net Worth and Salary?\n\nJenna Bush Hager is an American teacher, author and television news correspondent who has a net worth of $14 million. That is a combined net worth with her husband, private equity managing director Henry Hager.\n\nJenna Bush Hager is probably best known for being the younger of the non-identical twin daughters of the 43rd U.S. President George W. Bush and former First Lady Laura Bush. Jenna is a granddaughter of the 41st U.S. President George H. W. Bush and former First Lady Barbara Bush. She and her sister Barbara were the first twin children of a U.S. president. Hager is an author, an editor-at-large for Southern Living magazine, correspondent for NBC's Today Show and a contributor to NBC Nightly News.\n\nEarly Life\n\nJenna Bush was born November 25, 1981 in Dallas, Texas. In 1994, after her father was elected Governor of Texas and the family moved to Austin, Bush was a student at St. Andrew's Episcopal School. She then attended Austin High School between 1996 and 2000.\n\nCollege + Alcohol Arrests\n\nJenna Bush Hager attended the University of Texas at Austin and took summer classes at New York University. While living in New York City, Jenna and her sister Barbara made national headlines when they were both arrested for alcohol-related charges twice within 5 weeks. On April 29, 2001, Jenna was charged with a misdemeanor for possession of alcohol under the age 21 in Austin, Texas. On May 29, 2001, Jenna was charged with another misdemeanor—attempting to use a fake ID (with the name Barbara Pierce, her paternal grandmother's maiden name) to purchase alcohol. She pleaded no contest to both charges.\n\nJenna Bush graduated from UT Austin with a degree in English in 2004.\n\nTeaching and Writing\n\nJenna spent a year and a half teaching at a charter school in Washington D.C.. She also spent time working in Panama for UNICEF in an Education Policy role. Jenna turned her experiences working for UNICEF into a book titled \"Ana's Story: A Journey of Hope.\" She donated her share of the book's profits to UNICEF.\n\nIn 2008 she published a second book titled \"Read All About it!\".\n\nTelevision Career\n\nIn 2009 Jenna Bush Hager was hired as a correspondent for NBC News. She was soon also added as a correspondent for \"The Today Show.\" On April 8, 2019 Jenna began co-hosting the fourth hour of The Today Show with Hoda Kotb, essentially taking over for Kathie Lee Gifford. When she was given this new co-hosting job, her salary was bumped to $4 million.\n\nPersonal Life\n\nDuring her father's 2004 Presidential campaign Jenna met Henry Chase Hager. They married in a private ceremony on May 10, 2008 at her parents' Prairie Chapel Ranch near Crawford, Texas.\n\nOn December 12, 2012, Henry and Jenna Hager announced on The Today Show that they were expecting their first child. They now have three children together.\n\nHenry Hager is a managing director at a private equity firm called Waterous Energy Fund which makes oil and gas investments.\n\nReal Estate\n\nIn 2015, Jenna and Henry paid$4.58 million for a New York City condo.\n\nThey also own a home on Long Island and a home in Fairfield County, Connecticut.", "images": ["https://vz.cnwimg.com/wp-content/uploads/2014/06/jenna-bush-hager.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/wp-content/uploads/2014/06/jenna-bush.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2014/06/jenna-bush-hager.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/jenna-bush-hager-net-worth/", "title": "Jenna Bush Hager Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Jenna Bush Hager is an American teacher, author and television news correspondent who has a net worth of $14 million. She is probably best known for being the younger of the non-identical twin daughters of the 43rd U.S. President George W. Bush and former F...", "cnw_share_fb_count": 141, "cnw_share_tw_count": 36, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Jenna Bush Hager Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/jenna-bush-hager-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2014/06/jenna-bush-hager.jpg", "site_name": "Celebrity Net Worth", "description": "Jenna Bush Hager is an American teacher, author and television news correspondent who has a net worth of $14 million. She is probably best known for being the younger of the non-identical twin daughters of the 43rd U.S. President George W. Bush and former F..."}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2022-05-05T23:06:43+00:00", "published_time": "2022-05-04T22:54:02+00:00", "section": "Actors", "tag": "jenna bush hager worth"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2014/06/jenna-bush-hager.jpg", "title": "Jenna Bush Hager Net Worth", "description": "Jenna Bush Hager is an American teacher, author and television news correspondent who has a net worth of $14 million. She is probably best known for being the younger of the non-identical twin daug..."}}, "movies": [], "publish_date": 1651704842.0, "source": "https://www.celebritynetworth.com", "summary": ""}