{"url": "en.wikipedia.org/wiki/Vince_Vaughn", "text": "American actor\n\nVincent Anthony Vaughn[1] (born March 28, 1970)[2] is an American actor. Vaughn began acting in the late 1980s, appearing in minor television roles before attaining wider recognition with the 1996 comedy-drama film Swingers. He has appeared in a number of films in the 1990s, including the sports film Rudy (1993), the sci-fi adventure dinosaur film The Lost World: Jurassic Park (1997), the drama-thriller Return to Paradise (1998) and the remake of psychological thriller Psycho (1998).\n\nOther than his dramatic role in The Cell (2000), and Domestic Disturbance (2001), in the 2000s he acted primarily in comedies, including Old School (2003), Dodgeball: A True Underdog Story (2004), Wedding Crashers (2005), The Break-Up (2006), Fred Claus (2007), and Four Christmases (2008). He continued his comedic roles in the 2010s with The Dilemma (2011), The Watch (2012), and The Internship (2013). In 2015, he starred as Frank Semyon in the second season of the HBO anthology crime drama television series True Detective alongside Colin Farrell, Taylor Kitsch, and Rachel McAdams, and since then has taken dramatic roles such as in Hacksaw Ridge, Brawl in Cell Block 99, and Dragged Across Concrete.\n\nEarly life\n\nVaughn was born in Minneapolis, Minnesota,[1] to a wealthy family.[3] His mother, Sharon Eileen (née DePalmo; born in Brantford, Ontario, Canada),[4] is a real estate agent and stockbroker who was once ranked as one of the United States' top money managers by Bloomberg Wealth Manager magazine. His father, Vernon Lindsay Vaughn, worked as a salesman for a toy company.[5] As a child, he was raised both Protestant and Catholic by his Catholic mother and Protestant father.[6][7] He has Lebanese, Italian, Irish, English, and German ancestry.[8]\n\nVaughn grew up in Buffalo Grove, Illinois, where he played football and baseball and wrestled, although he has called himself \"unathletic\" and \"very average\" at high school sports.[9] He then moved to Lake Forest, where he graduated from Lake Forest High School in 1988. He was introduced to musical theater at a young age and decided to become an actor in 1987. He has credited his mother as the inspiration behind his career, saying that \"I saw her overcome stuff, and I thought if you worked hard at something you'd give yourself a chance\".[10]\n\nCareer\n\nVaughn in 2006\n\nIn 1988, Vaughn was cast in a Chevrolet television commercial and subsequently moved to Hollywood. He appeared in the 1989 season of the television series China Beach and in three CBS Schoolbreak Specials in 1990. His first film role was 1993's Rudy playing Notre Dame football tailback Jamie O'Hara, where he also struck up a friendship with Jon Favreau, who was also a first-time actor. Two years later, he was cast in a lead role in a proposed revival of 77 Sunset Strip that was to air on the fledgling WB Television Network, but the project ceased development after initial testing. Vaughn did not receive wider success until his role in 1996's Swingers with Jon Favreau. Swingers was released in July 1996 and became a successful independent film. Vince's father Vernon also did a cameo in this film.\n\nAfterwards, director Steven Spielberg cast Vaughn in the blockbuster The Lost World: Jurassic Park which gave him increased exposure. In 1998, he starred in the critically acclaimed drama Return to Paradise with Anne Heche, and starred in Clay Pigeons with Janeane Garofalo and Joaquin Phoenix. In 2000, he starred in The Cell with Jennifer Lopez and in 2001, appeared in Made, another film penned by Favreau. Vaughn also appeared in Dwight Yoakam's directorial debut movie South of Heaven, West of Hell. Vaughn's role in the successful 2003 comedy Old School skyrocketed his popularity.\n\nIn 2004, Vaughn appeared alongside Ben Stiller in the hit films Starsky & Hutch and Dodgeball. After this series of roles, Vaughn was dubbed one of the Hollywood \"Frat Pack\", a group of actors who frequently co-star in film comedies. He subsequently appeared in 2005's Thumbsucker, Be Cool, and Mr. & Mrs. Smith. Also in 2005, Vaughn starred alongside Owen Wilson in Wedding Crashers, which grossed over $200 million at the United States box office. In 2006, Vaughn starred with Jennifer Aniston in the comedy drama The Break-Up.\n\nIn 2007, Vaughn starred in the Christmas comedy Fred Claus, as a sarcastic, wild-at-heart older brother of Santa Claus (Paul Giamatti). The film was directed by David Dobkin, who previously directed Vaughn in Wedding Crashers, and co-starred Elizabeth Banks and Kevin Spacey. Next, he momentarily moved from comedy to drama in Sean Penn's critically acclaimed film Into the Wild, a film about the adventures of Christopher McCandless, which was also a best-selling book by Jon Krakauer.\n\nIn 2009, Vaughn starred in Couples Retreat, a comedy chronicling four couples who partake in therapy sessions at a tropical island resort. Malin Åkerman played his wife.[11] Vince's real-life father Vernon portrayed his father in the film. In February 2010, Vaughn was among the nearly 80 musicians and actors to sing on the charity-single remake of We Are the World.\n\nVaughn starred in Ron Howard's comedy, The Dilemma, released in January 2011. It was produced by Wild West Picture Show Productions, his production company.[12][13] On July 31, 2012, it was announced that Vaughn would be developing a reboot produced by CBS to the sitcom The Brady Bunch, which was taken off the air in 1974.[14]\n\nIn 2013, Vaughn co-wrote and starred alongside Wedding Crashers co-star Owen Wilson in The Internship. In 2015, he starred in Unfinished Business, which grossed $4.8 million in its opening weekend, a career low for Vaughn. He also starred in the second season of True Detective alongside Colin Farrell, which premiered on June 21. In 2016, he starred in the crime thriller Term Life, which featured friend and frequent collaborator Jon Favreau in a supporting role and was directed by another frequent collaborator, Peter Billingsley.[15]\n\nIn 2018, Vaughn co-starred alongside Mel Gibson in Dragged Across Concrete, his second collaboration with S. Craig Zahler, whom he previously worked with the year before on Brawl in Cell Block 99. In 2020, he starred with Kathryn Newton in the well-reviewed horror-comedy film Freaky, in which they play a serial killer and a teenage girl, respectively, who switch bodies.\n\nOn January 20, 2022, it was announced that Vaughn will produce a sequel to the 1983 film A Christmas Story entitled A Christmas Story Christmas with Peter Billingsley (who will reprise his role as Ralphie) through his production company Wild West Picture Show Productions for Warner Bros. Pictures and HBO Max.[16]\n\nIn March 2022, Vaughn, along with Greg Olsen and Ryan Kalil, launched a podcast network and production company named Audiorama.[17] The first podcast available from the network, called Youth, Inc., focuses on youth sports.[18]\n\nPersonal life\n\nIn 2005, Vaughn began dating Jennifer Aniston, his co-star in The Break-Up.[19] In late 2006, Vaughn filed a lawsuit against three tabloid magazines accusing them of falsely claiming that he had been unfaithful to Aniston.[20] They broke up in November 2006.[19]\n\nIn March 2009, it was reported that Vaughn was engaged to Canadian realtor Kyla Weber.[21] They married on January 2, 2010,[22] in the historic Armour House at Lake Forest Academy in Lake Forest, Illinois. The couple have two children, a daughter born in 2010 and a son born in 2013.[23][24]\n\nVaughn describes himself as a libertarian.[25] He supported Republican presidential candidate Ron Paul in both the 2008 and 2012 elections,[26] and Rand Paul in the 2016 election.[27] In June 2015, Vaughn expressed his opposition to gun control.[28]\n\nIn 2016, Vaughn began training Brazilian Jiu-Jitsu at the Gracie Academy in Torrance, California[29] and received his blue belt in February 2018.[30]\n\nOn June 10, 2018, Vaughn was arrested on suspicion of drunken driving and resisting arrest in Manhattan Beach, California after failing a sobriety test at a police checkpoint.[31] In May 2019, Vaughn was convicted of a reduced charge of reckless driving after he entered into a no contest plea and sentenced to three years' probation and ordered to undergo a three-month alcohol abuse program.[32]\n\nFilmography\n\nFilm\n\nTelevision\n\nProducer\n\nYear Title Role Notes 2022 A Christmas Story Christmas Producer Post-production[34]\n\nMusic videos\n\nVideo games\n\nYear Title Voice role Notes 1997 Chaos Island: The Lost World Nick Van Owen\n\nAwards and nominations", "images": ["http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Vince_Vaughn_in_Los_Angeles%2C_California_%282015%29_-_1.jpg/1200px-Vince_Vaughn_in_Los_Angeles%2C_California_%282015%29_-_1.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Vince_Vaughn_by_Gage_Skidmore_2.jpg/220px-Vince_Vaughn_by_Gage_Skidmore_2.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Vince_Vaughn.jpg/220px-Vince_Vaughn.jpg", "http://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://en.wikipedia.org/static/images/footer/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Vince_Vaughn_in_Los_Angeles%2C_California_%282015%29_-_1.jpg/220px-Vince_Vaughn_in_Los_Angeles%2C_California_%282015%29_-_1.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Vince_Vaughn_in_Los_Angeles%2C_California_%282015%29_-_1.jpg/1200px-Vince_Vaughn_in_Los_Angeles%2C_California_%282015%29_-_1.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Vince_Vaughn", "title": "Vince Vaughn", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Vince_Vaughn_in_Los_Angeles%2C_California_%282015%29_-_1.jpg/640px-Vince_Vaughn_in_Los_Angeles%2C_California_%282015%29_-_1.jpg", "width": 640, "height": 819}, "title": "Vince Vaughn - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}