{"url": "en.wikipedia.org/wiki/Sean_Penn", "text": "American actor\n\nSean Justin Penn (born August 17, 1960)[1][2] is an American actor and director. He has won two Academy Awards, for his roles in the mystery drama Mystic River (2003) and the biopic Milk (2008).\n\nPenn began his acting career in television, with a brief appearance in episode 112 of Little House on the Prairie on December 4, 1974, directed by his father Leo Penn. Following his film debut in the drama Taps (1981), and a diverse range of film roles in the 1980s, including Fast Times at Ridgemont High (1982) and Bad Boys (1983). Penn garnered critical attention for his roles in the crime dramas At Close Range (1986), State of Grace (1990), and Carlito's Way (1993). He became known as a prominent leading actor with the drama Dead Man Walking (1995), for which he earned his first Academy Award nomination and the Silver Bear for Best Actor at the Berlin Film Festival. Penn received another two Oscar nominations for Woody Allen's comedy-drama Sweet and Lowdown (1999) and the drama I Am Sam (2001), before winning his first Academy Award for Best Actor in 2003 for Mystic River and a second one in 2008 for Milk. He has also won a Best Actor Award at the Cannes Film Festival for the Nick Cassavetes-directed She's So Lovely (1997), and two Volpi Cups for Best Actor at the Venice Film Festival for the indie film Hurlyburly (1998) and the drama 21 Grams (2003).\n\nPenn made his feature film directorial debut with The Indian Runner (1991), followed by the drama film The Crossing Guard (1995) and the mystery film The Pledge (2001); all three were critically well received. Penn directed one of the 11 segments of 11'09\"01 September 11 (2002), a compilation film made in response to the September 11 attacks. His fourth feature film, the biographical drama survival movie Into the Wild (2007), garnered critical acclaim and two Academy Award nominations.\n\nIn addition to his film work, Penn has engaged in political and social activism, including his criticism of the George W. Bush administration, his contact with the Presidents of Cuba and Venezuela, and his humanitarian work in the aftermath of Hurricane Katrina in 2005 and the 2010 Haiti earthquake.[3]\n\nEarly life\n\nPenn was born in Santa Monica, California,[4] to actor and director Leo Penn and actress Eileen Ryan (née Annucci).[4][5] His older brother is musician Michael Penn. His younger brother, actor Chris Penn, died in 2006.[6] His father was Jewish, the son of emigrants from Lithuania, Merkinė[7][8][9][10][11] while his mother is a Catholic of Irish and Italian descent.[11][12] Penn was raised in a secular home in Malibu, California,[9] and attended Malibu Park Junior High School and Santa Monica High School, as Malibu had no high school at that time.[13][14] He began making short films with some of his childhood friends including actors Emilio Estevez and Charlie Sheen, who lived near his home.[15]\n\nCareer\n\nActing\n\nPenn appeared in a 1974 episode of the Little House on the Prairie television series as an extra when his father, Leo, directed some of the episodes.[16] Penn launched his film career with the action-drama Taps (1981), where he played a military high school cadet.[15] A year later, he appeared in the hit comedy Fast Times at Ridgemont High (1982), in the role of surfer-stoner Jeff Spicoli; his character helped popularize the word \"dude\" in popular culture.[15] Next, Penn appeared as Mick O'Brien, a troubled youth, in the drama Bad Boys (1983).[15] The role earned Penn favorable reviews and jump-started his career as a serious actor.\n\nPenn played Andrew Daulton Lee in the film The Falcon and the Snowman (1985), which closely followed an actual criminal case.[15] Lee was a former drug dealer, convicted of espionage for the Soviet Union and originally sentenced to life in prison, but was paroled in 1998. Penn later hired Lee as his personal assistant, partly because he wanted to reward Lee for allowing him to play Lee in the film; Penn was also a firm believer in rehabilitation and thought Lee should be successfully reintegrated into society, since he was a free man again.[17]\n\nPenn starred in the drama At Close Range (1986) which received critical acclaim.[15] He stopped acting for a few years in the early 1990s, having been dissatisfied with the industry, and focused on making his directing debut.[15]\n\nThe Academy Awards first recognized his work in nominating him for playing a racist murderer on death row in the drama film Dead Man Walking (1995).[18] He was nominated again for his comedic performance as an egotistical jazz guitarist in the Woody Allen film Sweet and Lowdown (1999).[19] He received his third nomination after portraying a mentally handicapped father in I am Sam (2001).[20] Penn finally won for his role in the Boston crime drama Mystic River (2003).[21] In 2004, Penn played Samuel Bicke, a character based on Samuel Byck, who in 1974 attempted and failed to assassinate President Richard Nixon, in The Assassination of Richard Nixon (2004). The same year, he was invited to join the Academy of Motion Picture Arts and Sciences.[22] Next, Penn portrayed governor Willie Stark (based on Huey Long) in an adaptation of Robert Penn Warren's classic 1946 American novel All the King's Men (2006). The film was a critical and commercial failure, named by a 2010 Forbes article as the biggest flop in the last five years.[23]\n\nIn November 2008, Penn earned positive reviews for his portrayal of real-life politician and gay rights icon Harvey Milk in the biopic Milk (2008), and was nominated for Best Actor for the 2008 Independent Spirit Awards.[24] The film also earned Penn his fifth nomination and second win for the Academy Award for Best Actor. In Fair Game (2010), Penn starred as Joseph C. Wilson, whose wife, Valerie Plame, was outed as a CIA agent by Bush advisor Scooter Libby in retaliation for an article Wilson wrote debunking Bush's claim that Iraq was building a nuclear bomb as a rationale for invading the country. The film is based upon Plame's 2007 memoir Fair Game: My Life as a Spy, My Betrayal by the White House.\n\nHe co-starred in the drama The Tree of Life (2011), which won the Palme d'Or at the 2011 Cannes Film Festival. In 2015, Penn starred in The Gunman, a French-American action thriller based on the novel The Prone Gunman, by Jean-Patrick Manchette. Jasmine Trinca, Idris Elba, Ray Winstone, Mark Rylance, and fellow Oscar-winner Javier Bardem appear in supporting roles. In The Gunman, Penn played Jim Terrier, a sniper on a mercenary assassination team who kills the minister of mines of the Congo. In 2021, Penn portrayed Jack Holden, an actor based on William Holden, in the comedy-drama Licorice Pizza.\n\nDirecting\n\nPenn made his directorial debut with The Indian Runner (1991), a crime drama film based on Bruce Springsteen's song \"Highway Patrolman\", from the album Nebraska (1982).[15] He also directed music videos, such as Shania Twain's \"Dance with the One That Brought You\" (1993), Lyle Lovett's \"North Dakota\" (1993), and Peter Gabriel's \"The Barry Williams Show\" (2002). He has since directed three more films, all well received by critics: the indie thriller The Crossing Guard (1995), the mystery film The Pledge (2001), and the biographical drama survival film Into the Wild (2007).[25] Penn's fifth directorial feature The Last Face (2016) premiered at the 2016 Cannes Film Festival.\n\nWriting\n\nIn March 2018, Atria Books published Penn's novel Bob Honey Who Just Do Stuff.[26] After the book's release, Penn went on a highly publicized press tour.[27][28][29] He claimed that he no longer had \"a generic interest in making films\", and being a writer will \"dominate my creative energies for the foreseeable future.\"[30]\n\nPersonal life\n\nRelationships\n\nPenn was engaged to actress Elizabeth McGovern, his co-star in Racing with the Moon (1984). He also had a brief relationship with Susan Sarandon.[31]\n\nPenn met singer-songwriter Madonna on set of her \"Material Girl\" music video in January 1985.[32] On August 16, 1985, they married on Madonna's 27th birthday; Penn turned 25 the next day.[33] The two starred in the panned Shanghai Surprise (1986), directed by Jim Goddard, and Madonna dedicated her third studio album True Blue (1986) to Penn, referring to him in the liner notes as \"the coolest guy in the universe\".[34] Their marriage was marred by Penn's violent outbursts against the press.[35] Madonna filed for divorce in December 1987, but withdrew the papers two weeks later.[36] In January 1989, Madonna filed for divorce again and reportedly withdrew an assault complaint against Penn following an incident at their Malibu, California home during the New Year's weekend.[37][38] Penn was alleged to have struck Madonna on multiple occasions during their marriage.[39][40] However, Madonna stated the allegations were \"completely outrageous, malicious, reckless, and false\" in 2015.[41][32]\n\nIn 1989, Penn began dating actress Robin Wright, and their first child, a daughter named Dylan Frances, was born April 13, 1991.[42] Their second child, son Hopper Jack, was born August 6, 1993.[43] Penn and Wright separated in 1995, during which time he developed a relationship with Jewel, after he spotted her performing on Late Night with Conan O'Brien. He invited her to compose a song for his film The Crossing Guard (1995) and followed her on tour.[44]\n\nPenn reconciled with Wright and they married on April 27, 1996.[45] They lived in Ross, California.[46] The couple filed for divorce in December 2007 but reconciled several months later, requesting a court dismissal of their divorce case.[47] In April 2009, Penn filed for legal separation, only to withdraw the case once again when the couple reconciled in May.[48][49][50] On August 12, 2009, Wright filed for divorce again.[51][52] The couple's divorce was finalized on July 22, 2010; the couple reached a private agreement on child and spousal support, division of assets, and custody of Hopper, who was almost 17 at the time.[53]\n\nIn December 2013, Penn began dating South African actress Charlize Theron.[54] Their relationship ended in June 2015.[55] Despite reports that they were engaged, Theron stated that they were never engaged.[56] Theron starred in Penn's film The Last Face (2016), which they filmed while still a couple.[54]\n\nPenn began a relationship with Australian actress Leila George in 2016.[57] They married on July 30, 2020.[58] George filed for divorce on October 15, 2021.[59] Their divorce was finalized on April 22, 2022.[60]\n\nLegal issues\n\nIn October 1985, Penn pled no contest to charges that he assaulted two journalists when they tried to photograph him and Madonna in Nashville in June 1985.[61] He was fined $50 on each of two misdemeanor charges of assault and battery.[61]\n\nIn January 1986, Penn was charged for allegedly assaulting Leonel Borralho, Macao correspondent for the Hong Kong Standard newspaper, after he photographed Madonna and Penn as they arrived at their hotel room.[62]\n\nIn June 1986, Penn was charged with misdemeanor battery for assaulting songwriter David Wolinski at Helena's nightclub in Los Angeles.[63] Wolinski said Penn accused him of trying to kiss Madonna. Penn pled not guilty to the charge.[64]\n\nIn April 1987, Penn violated probation and was arrested for punching a film extra, Jeffrey Klein, on set of the movie Colors.[65] Penn was sentenced to 60 days in jail for this assault and reckless driving in June 1987, of which he served 33 days.[66][67]\n\nIn May 2010, Penn pleaded no contest to a misdemeanor charge stemming from an altercation with photographer Frank Mateljan in October 2009.[68] He was sentenced to perform 300 hours of community service and undergo 36 hours of anger management counseling.[69]\n\nPolitical views and activism\n\nPenn has been outspoken in supporting numerous political and social causes.[70] On December 13–16, 2002, he visited Iraq to protest the Bush Administration's apparent plans for a military strike on Iraq. On June 10, 2005, Penn made a visit to Iran. Acting as a journalist on an assignment for the San Francisco Chronicle, he attended a Friday prayer at Tehran University.[71] On January 7, 2006, Penn was a special guest at the Progressive Democrats of America, where he was joined by author and media critic Norman Solomon and activist Cindy Sheehan. The \"Out of Iraq Forum\", which took place in Sacramento, California, was organized to promote the anti-war movement calling for an end to the War in Iraq.[72]\n\nOn December 18, 2006, Penn received the Christopher Reeve First Amendment Award from the Creative Coalition for his commitment to free speech.[73] In August 2008, Penn made an appearance at one of Ralph Nader's \"Open the Debates\" Super Rallies. He protested the political exclusion of Nader and other third parties.[74] In October 2008, Penn traveled to Cuba, where he met with and interviewed President Raúl Castro.[75] In February 2012, he stood beside Venezuelan president Hugo Chávez while Venezuela supported the Syrian government during the 2011–2012 Syrian uprising.[76]\n\nIn October 2020, Penn tweeted in support of Armenia in regards to the Nagorno-Karabakh war between Armenia and Azerbaijan. He also criticized Turkey's involvement in the conflict and close Turkey–United States ties, while simultaneously endorsing Joe Biden for the 2020 U.S. presidential election. He stated: \"Armenians are being slaughtered by Trump pal Erdogan with weapons WE provided. THIS is NOT America! Biden for America's new birth!\".[77]\n\nCriticism of President George W. Bush\n\nOn October 18, 2002, Penn placed a $56,000 advertisement in The Washington Post asking then President George W. Bush to end a cycle of violence. It was written as an open letter and referred to the planned attack on Iraq and the War on Terror.[78]\n\nIn the letter, Penn also criticized the Bush administration for its \"deconstruction of civil liberties\" and its \"simplistic and inflammatory view of good and evil.\"[79] Penn visited Iraq briefly in December 2002.[78] \"Sean is one of the few,\" remarked his ex-wife Madonna. \"Good for him. Most celebrities are keeping their heads down. Nobody wants to be unpopular. But then Americans, by and large, are pretty ignorant of what's going on in the world.\"[80] The Post advertisement was cited as a primary reason for the development of his relationship with Venezuelan president Hugo Chávez. In one of his televised speeches, Chávez used and read aloud an open letter Penn wrote to Bush.[81] The letter condemned the Iraq War, called for Bush to be impeached, and also called Bush, Vice President Dick Cheney, and Secretary of State Condoleezza Rice \"villainously and criminally obscene people.\"[82]\n\nOn April 19, 2007, Penn appeared on The Colbert Report and had a \"Meta-Free-Phor-All\" versus Stephen Colbert that was judged by Robert Pinsky. This stemmed from some of Penn's criticisms of Bush. His exact quote was \"We cower as you point your fingers telling us to support our troops. You and the smarmy pundits in your pocket– those who bathe in the moisture of your soiled and blood-soaked underwear– can take that noise and shove it.\"[83][84] He won the contest with 10,000,000 points to Colbert's 1.[85] On December 7, 2007, Penn said he supported Ohio Congressman Dennis J. Kucinich for U.S. president in 2008, and criticized Bush's handling of the Iraq war. Penn questioned whether Bush's daughters, Jenna and Barbara, supported the war in Iraq.[86]\n\nHurricane Katrina\n\nIn September 2005, Penn traveled to New Orleans, Louisiana, to aid Hurricane Katrina victims. He was physically involved in rescuing people,[87] although there was criticism that his involvement was a PR stunt as he hired a photographer to come along with his entourage.[88] Penn denied such accusations in an article he wrote for The Huffington Post.[89] Director Spike Lee interviewed Penn for Lee's documentary about Hurricane Katrina, When the Levees Broke: A Requiem in Four Acts (2006).\n\nSupport for same-sex marriage\n\nOn February 22, 2009, Penn received the Academy Award for Best Actor for the film Milk. In his acceptance speech, he said: \"I think that it is a good time for those who voted for the ban against gay marriage to sit and reflect and anticipate their great shame and the shame in their grandchildren's eyes if they continue that way of support. We've got to have equal rights for everyone!\"[90]\n\nRelief efforts following 2010 Haiti earthquake\n\nAfter the 2010 Haiti earthquake, Penn founded the J/P Haitian Relief Organization,[91] which operated a 55,000 person tent camp.[92] Before starting the organization, Penn had never visited Haiti and did not speak French or Creole. When asked for his comment on critics who questioned his experience, he said he hopes they \"die screaming of rectal cancer”.[93] Due to his visibility as an on-the-ground advocate for rescue and aid efforts in the aftermath, Penn was designated by president Michel Martelly as Ambassador-at-Large for Haiti, the first time that a non-Haitian citizen has been designated as such in the country's history. Penn received the designation on January 31, 2012.[94] In 2012, at the 12th World Summit of Nobel Peace Laureates, Penn received the Peace Summit Award.[95]\n\nVenezuela\n\nIn March 2010, Penn called for the arrest of those referring to Venezuelan President Hugo Chávez as a dictator.[96] The two were friends, and when Chávez died in 2013, Penn said: \"Venezuela and its revolution will endure under the proven leadership of Vice President Nicolás Maduro. Today the United States lost a friend it never knew it had. And poor people around the world lost a champion. I lost a friend I was blessed to have.\"[97]\n\nPakistan\n\nPenn gained significant attention in the Pakistan media when he visited Karachi and Badin in 2012. On March 23, 2012, he visited flood-stricken villages of Karim Bux Jamali, Dargah Shah Gurio and Peero Lashari in Badin District. He was accompanied by U.S. Consul General William J. Martin and distributed blankets, quilts, kitchen items and other goods amongst flood survivors.[98][99]\n\nOn March 24, 2012, Penn also visited Bilquis Edhi Female Child Home and met Pakistan's iconic humanitarian worker Abdul Sattar Edhi and his wife, Bilquis Edhi. He also laid floral wreaths and paid respect at the shrine of Abdullah Shah Ghazi.[100][101]\n\nRelease of Jacob Ostreicher from Bolivian prison\n\nPenn is believed to have played a role in getting American entrepreneur Jacob Ostreicher released from a Bolivian prison in 2013, and was credited by Ostreicher for having personally nursed him back to health upon his release.[102]\n\nCORE\n\nPenn is the founder of the nonprofit organization Community Organized Relief Effort (CORE), which has distributed aid to Haiti following the 2010 earthquake and Hurricane Matthew as well as administering free COVID-19 tests in the U.S. amid the COVID-19 pandemic.[103] In October 2021, the National Labor Relations Board issued a complaint that Penn and CORE violated federal labor law. According to the charge, Penn \"impliedly threatened\" his employees with reprisals after they complained about working conditions, including 18 hour days and the food provided.[104]\n\n2022 Russian invasion of Ukraine\n\nPenn spent time in Ukraine filming a documentary about the ongoing 2022 Russian invasion of Ukraine.[105] Penn attended press briefings in Kyiv, met with officials and spoke to journalists and military personnel about the Russian invasion.[106][105] On February 25, 2022, Penn stated: \"If we allow it [Ukraine] to fight alone, our soul as America is lost.\"[106] He also praised the response from the Ukrainian government and its citizens.[106] When attempting to leave the country, Penn and his team abandoned their car and walked with their luggage for miles to the Polish border.[107] Russia is sanctioning Penn over his Ukraine support.[108]\n\nControversies\n\nFalkland Islands controversy\n\nIn February 2012, Penn met with the President of Argentina, Cristina Fernández de Kirchner, in Buenos Aires where he made a statement on the long-running dispute between Argentina and the United Kingdom over the Falkland Islands, saying: \"I know I came in a very sensitive moment in terms of diplomacy between Argentina and the UK over the Falkland Islands. And I hope that diplomats can establish true dialogue in order to solve the conflict as the world today cannot tolerate ridiculous demonstrations of colonialism. The way of dialogue is the only way to achieve a better solution for both nations.\"[109][110][111]\n\nThe comments were taken as support of Argentina's claim to the islands and evoked strong reactions in the British media, with one satirical article in The Daily Telegraph requesting that Penn \"return his Malibu estate to the Mexicans\".[112] Falklands War veteran and political activist Simon Weston stated \"Sean Penn does not know what he is talking about and, frankly, he should shut up. His [Penn's] views are irrelevant and it only serves to fuel the fire of the Argentinians and get them more pumped up\",[113] while British Conservative MP Patrick Mercer dismissed Penn's statement as \"moronic.\"[114] Lauren Collins of The New Yorker wrote: \"As of today, Sean Penn is the new Karl Lagerfeld—the man upon whom, having disrespected something dear to the United Kingdom, the British papers most gleefully pile contempt\".[115]\n\nPenn later claimed that he had been misrepresented by the British press and that his criticism of \"colonialism\" was a reference to the deployment of Prince William as an air-sea rescue pilot, describing it as a \"message of pre-emptive intimidation\". He claimed that the Prince's posting meant \"the automatic deployment of warships\", and stated: \"My oh my, aren't people sensitive to the word 'colonialism', particularly those who implement colonialism.\"[116][117] In a piece written in The Guardian, Penn wrote that \"the legalisation of Argentinian immigration to the Malvinas/Falkland Islands is one that it seems might have been addressed, but for the speculative discovery of booming offshore oil in the surrounding seas this past year\". He further wrote that \"irresponsible journalism\" had suggested \"that I had taken a specific position against those currently residing in the Malvinas/Falkland Islands, that they should either be deported or absorbed into Argentine rule. I neither said, nor insinuated that\".[117][118]\n\nOscar green card joke\n\nAt the 87th Academy Awards in 2015, Penn presented the award for Best Picture. Before presenting the award to Mexican Alejandro González Iñárritu for Birdman, Penn joked, \"Who gave this son of a bitch his green card?\" Some people deemed the remark racist towards Latin Americans, and offensive to those who attempt to legally immigrate into the United States.[119][120]\n\nIñarritu said that it was a joke between him and Penn, who worked together on 21 Grams, and that he found it \"hilarious.\" Penn later went on record defending his comments, saying, \"I have absolutely no apologies. In fact, I have a big 'fuck you' for every...anybody who is so stupid not to have gotten the irony when you've got a country that is so xenophobic. If they had their way, you wouldn't have great filmmakers like Alejandro working in this country. Thank God we do.\"[121][122]\n\nLee Daniels lawsuit\n\nIn an interview published September 16, 2015, director and showrunner Lee Daniels responded to criticism about Terrence Howard's continued career in light of his domestic violence issues by referencing Penn's rumored history of domestic violence, saying: \"[Terrence] ain't done nothing different than Marlon Brando or Sean Penn, and all of a sudden he's some f—in' demon.\"[123] In response, Penn launched a $10 million defamation suit against Daniels, alleging that he had never been arrested for or charged with domestic violence.[124] Penn dropped the lawsuit in May 2016 after Daniels retracted his statement and apologized.[125]\n\nEl Chapo interview\n\nA day after Mexican officials announced the capture of fugitive Sinaloa Cartel boss Joaquín \"El Chapo\" Guzmán in a bloody raid, Rolling Stone revealed on January 9, 2016, that Sean Penn, along with actress Kate del Castillo, had conducted a secret interview with El Chapo prior to his arrest.[126][127] Del Castillo was contacted by Guzmán's lawyer (who was under CISEN surveillance) to talk about producing a biographical film about Guzmán and communication increased following Guzmán's escape from prison in July 2015.[128] The deal for the interview was brokered by del Castillo.[129] According to published text messages with del Castillo, Guzmán did not know who Sean Penn was.[130] CISEN released photographs of del Castillo at the meetings with Guzmán's lawyers and of the arrival of the actress and Penn to Mexico. The interview was criticized by some, including the White House, which called the interview \"maddening\".[131] Mexican authorities said they were seeking to question Penn over the interview, which had not been approved by either the American or Mexican government.[132] Penn and del Castillo's meeting with Guzmán is under investigation by the Attorney General of Mexico.[133]\n\nFilmography\n\nPenn has appeared in more than 50 films and won many awards during his career as an actor and director. He has won two Academy Awards for Best Actor for Mystic River (2003) and Milk (2008),[134] and was nominated three more times in the same category for Dead Man Walking (1995), Sweet and Lowdown (1999), and I Am Sam (2001).[135] He also received a Directors Guild of America nomination for directing Into the Wild (2007).[136]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Seanpenn1.jpg/1200px-Seanpenn1.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Sean_Penn_Cannes_2016.jpg/220px-Sean_Penn_Cannes_2016.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Seanpenn1.jpg/220px-Seanpenn1.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/Sean_Penn_Cannes.jpg/170px-Sean_Penn_Cannes.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Robin_Wright_%26_Sean_Penn_%28cropped%29.jpg/220px-Robin_Wright_%26_Sean_Penn_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Sean_Penn_Filming_Milk_in_2008.jpg/170px-Sean_Penn_Filming_Milk_in_2008.jpg", "http://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Sean_Penn_with_Cristina_Fern%C3%A1ndez.jpg/220px-Sean_Penn_with_Cristina_Fern%C3%A1ndez.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://en.wikipedia.org/static/images/footer/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/79/March3.J27.UFPJ.WDC.27jan07.jpg/220px-March3.J27.UFPJ.WDC.27jan07.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Seanpenn1.jpg/1200px-Seanpenn1.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Sean_Penn", "title": "Sean Penn", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Seanpenn1.jpg/640px-Seanpenn1.jpg", "width": 640, "height": 810}, "title": "Sean Penn - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}