{"url": "http://www.warnermusicnashville.com/news/top-five-finalists-announced-all-categories-e-peoples-choice-awards-chosen-fans-2176", "text": "Body\n\nTHE PEOPLE HAVE SPOKEN!\n\nTOP FIVE FINALISTS ANNOUNCED FOR ALL CATEGORIES OF “THE E! PEOPLE’S CHOICE AWARDS,” CHOSEN BY THE FANS\n\nFinalist Voting Begins TODAY and Runs through October 19 to Determine the Winner in Each of the 43 Categories Covering Movies, Television, Music and Pop Culture\n\nOnly Awards Show \"For the People, By the People” Airs Sunday, November 11 at 9pm ET/PT on E!, with “Live From The Red Carpet: The E! People’s Choice Awards” Kicking Off at 7pm ET/PT\n\nToday, E! has revealed the top five finalists in each category of this year’s “The E! People’s Choice Awards,” celebrating all forms of entertainment, chosen solely by the fans. Finalist voting begins today around the globe to determine the winner in each of the 43 categories spanning movies, television, music and pop culture. As part of E!’s commitment to evolve and super-charge “People’s Choice Awards\" for the next generation, the network has expanded its voting methods for this phase to include the ability to vote with the Xfinity set-top box and Google search options.\n\nFinalist voting for the 43 categories across movies, television, music, and pop culture runs today through Friday, October 19 at 11:59pm ET. Various methods of voting include: online at pca.eonline.com, through Facebook and Twitter, as well as Xfinity and Google search option, with specific details below. Fans can vote up to 25 times per method, per category, per day if they vote via online, Facebook, Twitter. For Google search, users must be logged into their Gmail account and they can vote up to 25 times per session per category. If fans vote with Xfinity, there is a limit of 10 votes per nominee, per set-top box.\n\nFinalists:\n\nSee the full list of all 43 categories and finalists online at: https://www.eonline.com/shows/peoples_choice_awards/news/967279/2018-people-s-choice-awards-complete-list-of-finalists\n\nVoting Methods:\n\nOnline –pca.eonline.com\n\nFacebook –Fans can post either publicly or privately and include: one category hashtag, one corresponding nominee hashtag, and #PCAs\n\nTwitter –Fans can send a public tweet or retweet and include one category hashtag, one corresponding nominee hashtag, and #PCAs\n\nXfinity –Fans can cast their vote for “The Show of 2018” category using their X1 remote or by using the voice command option with the phrase “Vote For People’s Choice Awards”\n\nGoogle search –Fans can vote for the following five categories using search keywords:\n\n“The Movie of 2018”\n\n“The Show of 2018”\n\n“The Social Celebrity of 2018”\n\n“The Song of 2018”\n\n“The Style Star of 2018”\n\n“The Style Star of 2018”\n\n*Votes will be aggregated and counted through our third party vendor Telescope.\n\nComplete list of category, finalist hashtags, and search keywords can be found at: https://www.eonline.com/peoples_choice_awards/faq\n\nComplete rules can be found at: https://www.eonline.com/peoples_choice_awards/rules\n\nTo request press credentials to cover this 2018 E! People’s Choice Awards, you must fill out the online application HERE by 6:00pm PT on Friday, October 26.\n\n“The E! People's Choice Awards” will be broadcast live from the Barker Hanger in Santa Monica on Sunday, November 11th starting at 9p ET/PT, with “E! Live From The Red Carpet: The E! People’s Choice Awards” kicking off at 7p ET/PT.\n\n“The E! People’s Choice Awards” are produced by Wilshire Studios and Den of Thieves with Executive Producers Jesse Ignjatovic and Evan Prager.\n\nAbout E! Entertainment\n\nE! is the only global, multi-platform brand for all things pop culture. The network is currently available to 91 million cable and satellite subscribers in the U.S and 161 countries globally. “E! News” airs nightly on the network and is the leading multi-platform publisher delivering breaking entertainment news and pop culture coverage 24/7 across EOnline.com and all digital and social media. E! programming includes popular series \"Keeping Up with the Kardashians,\" \"Total Divas,\" “Total Bellas,” \"Botched,\" \"Hollywood Medium with Tyler Henry,” “Very Cavallari” and its newest late night topical series “Busy Tonight.” The brand’s robust digital programming slate includes “E! News’ The Rundown” “Face Forward” and “What The Fashion\" on Snapchat. E!’s \"Live from the Red Carpet\" signature events keep fans connected to their favorite stars on pop culture's biggest nights and on November 11 E! becomes the home of the “People’s Choice Awards.” E! is a network of NBCUniversal Cable Entertainment, a division of NBCUniversal, one of the world's leading media and entertainment companies in the development, production, and marketing of entertainment, news and information to a global audience. For more corporate information, visit www.nbcuniversal.com.\n\nAbout Wilshire Studios\n\nWilshire Studios develops and produces a diverse slate of original unscripted programming for multiple platforms, aligning with award-winning producers and innovative storytellers to create compelling content that explores reality through a variety of formats. From E!’s signature “Live from the Red Carpet,” USA Network’s “The Cromarties” and Oxygen’s “Mysteries and Scandals,” to the upcoming “The Curious Creations of Christine McConnell” for Netflix, “Real Country” for USA, “Unspeakable Crime: The Killing of Jessica Chambers” for Oxygen and the debut “The E! People’s Choice Awards” on E!, Wilshire Studios produces series that are informative, revealing, thrilling and entertaining. Wilshire Studios is part of the NBCUniversal Cable Entertainment portfolio.\n\nAbout Den of Thieves\n\nDen of Thieves is a force for ambitious, music-driven event shows and uniquely stylized television series. Using their extensive experience working with talent, their credits cover a vast array of formats that include ABC’s The Gong Show, FOX’s American Idol, the multi-network broadcast of Hand in Hand: A Benefit for Hurricane Relief and the digital stream of March for Our Lives. Beyond that, Den of Thieves thrives in the live event & award show space, having produced the MTV Video Music Awards for 12 consecutive years, the iHeartRadio Music Awards, MTV Movie Awards, Radio Disney Music Awards, Peabody Awards and more. In addition to spearheading some of the world’s leading premier event shows, Den of Thieves is also the name behind the production of documentaries, documentary-series, and comedy specials for Netflix, Comedy Central and Apple – to name a few.\n\nAbout People’s Choice\n\nE! acquired the “People’s Choice Awards” and serves as the exclusive home of the popular annual award show that celebrates the best in pop culture. E!’s ownership of “People’s Choice Awards” includes the annual live event along with all digital and social assets. Now in its 44th year, the People’s Choice Awards is the only major awards show voted on entirely by the public for fan favorites in movies, music, television, and pop culture. Only fans determine the nominees and winners for the annual awards show and nearly 300 million votes were cast for its most recent installment, which aired January 18, 2017. The People’s Choice official website at www.PeoplesChoice.comhouses the voting platform where fans determine the nominees and winners for the annual awards show. “People’s Choice Awards” was originally created in 1975 by Robert Stivers. “People’s Choice Awards” was previously owned by Procter & Gamble and produced by Mark Burnett airing on CBS.", "images": ["http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/wc-WMNsite-1920x1120.jpg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/WMN-AshleyMcBryde-Thumbnail.jpeg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/2020-06/WarnerMusicNashville-Logo-Icon%20%281%29.svg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/styles/recommended_news_image/public/AM%20x%20GB.jpg?itok=JuV4tUm1", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/cw-WMNsite-1920x1120.jpg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/wmn-site_kenny-rogers_960x541.jpg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/WMN-PatrickMurphy-Thumbnail.jpeg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/be-WMNsite-1920x1120.jpeg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/rk-WMNsite-1920x1120.jpeg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/WMN-GTHG-Thumbnail.jpeg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/WMN-Breland-1920x1120.jpeg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/WMN-TreaLandon-1920x1120.jpeg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/WMN-KennyChesney-1920x1120.jpg", "https://www.warnermusicnashville.com/sites/g/files/g2000010586/files/styles/blog_og_style/public/E%21.png?itok=iMLXlqgK", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/dp-WMNsiteImage-1920x1120.jpg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/SC_WebsitePhoto_1920x1120.jpeg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/cojo-WMNsite-1920x1120.jpeg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/WMN-BaileyZimmerman-Thumbnail.jpeg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/WMN-DevinDawson-1920x1120.jpeg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/WMN-RandyTravis-1920x1120.jpg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/bs-WMNsite-1920x1120.jpeg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/2020-06/WarnerMusicNashville-Logo.svg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/WMN-IanMunsick-Thumbnail.jpeg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/WMN-ZachBryan-Thumbnail.jpeg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/styles/recommended_news_image/public/Madeline%20Edwards_Crashlanded%20Artwork_FINAL_3000x3000.jpg?itok=Imsrtlz5", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/ds-WMNsite-1920x1120.jpeg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/WMN-GabbyBarrett-960x541_0.jpg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/WMN-MorganEvans-1920x1120_0.jpg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/WMN-TuckerBeathard-1920x1120.jpg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/WMN-IngridAndress-Thumbnail.jpeg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/BEXAR_WebsitePhoto_1920x1120.jpeg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/redferrin-WMNsite-1920x1120.jpeg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/aa-WMNsite-1920x1120.jpeg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/styles/recommended_news_image/public/Credit%20Allister%20Ann.jpg?itok=CTAjLNel", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/zbb-WMNsite-1920x1120_0.jpeg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/WMN-ColeSwindell-1920x1120.jpeg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/WMN-MadelineEdwards-Thumbnail.jpeg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/WMN-TylerBraden-1920x1120.jpg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/2020-06/WarnerMusicNashville-Logo-Type.svg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/WMN-JordynShellhart-Thumbnail.jpeg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/mr-WMNsite-1920x1120.jpeg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/E%21.png", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/tr-WMNsite-1920x1120.jpeg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/ro-WMNsite-1920x1120.jpeg", "http://www.warnermusicnashville.com/sites/g/files/g2000010586/files/jjd-WMNsite-1920x1120_0.jpeg"], "top_img": "https://www.warnermusicnashville.com/sites/g/files/g2000010586/files/styles/blog_og_style/public/E%21.png?itok=iMLXlqgK", "keywords": [], "authors": [], "canonical_link": "https://www.warnermusicnashville.com/news/top-five-finalists-announced-all-categories-e-peoples-choice-awards-chosen-fans-2176", "title": "TOP FIVE FINALISTS ANNOUNCED FOR ALL CATEGORIES OF “THE E! PEOPLE’S CHOICE AWARDS,” CHOSEN BY THE FANS", "meta_data": {"robots": "index, follow", "description": "THE PEOPLE HAVE SPOKEN!    TOP FIVE FINALISTS ANNOUNCED FOR ALL CATEGORIES OF “THE E! PEOPLE’S CHOICE AWARDS,” CHOSEN BY THE FANS    Finalist Voting Begins TODAY and Runs through October 19 to Determine the Winner in Each of the 43 Categories Covering Movies, Television, Music and Pop Culture   Only Awards Show \"For the People, By the People” Airs Sunday, November 11 at 9pm ET/PT on E!, with “Live From The Red Carpet: The E! People’s Choice Awards” Kicking Off at 7pm ET/PT   Today, E! has revealed the top five finalists in each category of this year’s “The E! People’s Choice Awards,” celebrating all forms of entertainment, chosen solely by the fans.  Finalist voting begins today around the globe to determine the winner in each of the 43 categories spanning movies, television, music and pop culture.  As part of E!’s commitment to evolve and super-charge “People’s Choice Awards\" for the next generation, the network has expanded its voting methods for this phase to include the ability to vote with the Xfinity set-top box  and Google search options.   Finalist voting for the 43 categories across movies, television, music, and pop culture runs today through Friday, October 19 at 11:59pm ET.   Various methods of voting include: online at pca.eonline.com, through Facebook and Twitter, as well as Xfinity and Google search option, with specific details below.  Fans can vote up to 25 times per method, per category, per day if they vote via online, Facebook, Twitter. For Google search, users must be logged into their Gmail account and they can vote up to 25 times per session per category. If fans vote with Xfinity, there is a limit of 10 votes per nominee, per set-top box.    Finalists: See the full list of all 43 categories and finalists online at: https://www.eonline.com/shows/peoples_choice_awards/news/967279/2018-people-s-choice-awards-complete-list-of-finalists   Voting Methods:Online –pca.eonline.comFacebook –Fans can post either publicly or privately and include: one category hashtag, one corresponding nominee hashtag, and #PCAs Twitter –Fans can send a public tweet or retweet and include one category hashtag, one corresponding nominee hashtag, and #PCAs  Xfinity –Fans can cast their vote for “The Show of 2018” category using their X1 remote or by using the voice command option with the phrase “Vote For People’s Choice Awards”Google search –Fans can vote for the following five categories using search keywords:  “The Movie of 2018” “The Show of 2018” “The Social Celebrity of 2018” “The Song of 2018” “The Style Star of 2018” “The Style Star of 2018”   *Votes will be aggregated and counted through our third party vendor Telescope.   Complete list of category, finalist hashtags, and search keywords can be found at: https://www.eonline.com/peoples_choice_awards/faq   Complete rules can be found at: https://www.eonline.com/peoples_choice_awards/rules   To request press credentials to cover this 2018 E! People’s Choice Awards, you must fill out the online application HERE by 6:00pm PT on Friday, October 26.   “The E! People's Choice Awards” will be broadcast live from the Barker Hanger in Santa Monica on Sunday, November 11th starting at 9p ET/PT, with “E! Live From The Red Carpet: The E! People’s Choice Awards” kicking off at 7p ET/PT.    “The E! People’s Choice Awards” are produced by Wilshire Studios and Den of Thieves with Executive Producers Jesse Ignjatovic and Evan Prager.       About E! Entertainment E! is the only global, multi-platform brand for all things pop culture. The network is currently available to 91 million cable and satellite subscribers in the U.S and 161 countries globally. “E! News” airs nightly on the network and is the leading multi-platform publisher delivering breaking entertainment news and pop culture coverage 24/7 across EOnline.com and all digital and social media. E! programming includes popular series \"Keeping Up with the Kardashians,\" \"Total Divas,\" “Total Bellas,” \"Botched,\" \"Hollywood Medium with Tyler Henry,” “Very Cavallari” and its newest late night topical series “Busy Tonight.” The brand’s robust digital programming slate includes “E! News’ The Rundown” “Face Forward” and “What The Fashion\" on Snapchat. E!’s \"Live from the Red Carpet\" signature events keep fans connected to their favorite stars on pop culture's biggest nights and on November 11 E! becomes the home of the “People’s Choice Awards.” E! is a network of NBCUniversal Cable Entertainment, a division of NBCUniversal, one of the world's leading media and entertainment companies in the development, production, and marketing of entertainment, news and information to a global audience. For more corporate information, visit www.nbcuniversal.com.   About Wilshire Studios Wilshire Studios develops and produces a diverse slate of original unscripted programming for multiple platforms, aligning with award-winning producers and innovative storytellers to create compelling content that explores reality through a variety of formats. From E!’s signature “Live from the Red Carpet,” USA Network’s “The Cromarties” and Oxygen’s “Mysteries and Scandals,” to the upcoming “The Curious Creations of Christine McConnell” for Netflix, “Real Country” for USA, “Unspeakable Crime: The Killing of Jessica Chambers” for Oxygen and the debut “The E! People’s Choice Awards” on E!, Wilshire Studios produces series that are informative, revealing, thrilling and entertaining. Wilshire Studios is part of the NBCUniversal Cable Entertainment portfolio.   About Den of Thieves Den of Thieves is a force for ambitious, music-driven event shows and uniquely stylized television series. Using their extensive experience working with talent, their credits cover a vast array of formats that include ABC’s The Gong Show, FOX’s American Idol, the multi-network broadcast of Hand in Hand: A Benefit for Hurricane Relief and the digital stream of March for Our Lives. Beyond that, Den of Thieves thrives in the live event & award show space, having produced the MTV Video Music Awards for 12 consecutive years, the iHeartRadio Music Awards, MTV Movie Awards, Radio Disney Music Awards, Peabody Awards and more. In addition to spearheading some of the world’s leading premier event shows, Den of Thieves is also the name behind the production of documentaries, documentary-series, and comedy specials for Netflix, Comedy Central and Apple – to name a few.    About People’s Choice E! acquired the “People’s Choice Awards” and serves as the exclusive home of the popular annual award show that celebrates the best in pop culture.  E!’s ownership of “People’s Choice Awards” includes the annual live event along with all digital and social assets.  Now in its 44th year, the People’s Choice Awards is the only major awards show voted on entirely by the public for fan favorites in movies, music, television, and pop culture.  Only fans determine the nominees and winners for the annual awards show and nearly 300 million votes were cast for its most recent installment, which aired January 18, 2017.  The People’s Choice official website at www.PeoplesChoice.comhouses the voting platform where fans determine the nominees and winners for the annual awards show. “People’s Choice Awards” was originally created in 1975 by Robert Stivers.  “People’s Choice Awards” was previously owned by Procter & Gamble and produced by Mark Burnett airing on CBS.", "og": {"site_name": "Warner Music Nashville", "type": "Blog", "url": "https://www.warnermusicnashville.com/news/top-five-finalists-announced-all-categories-e-peoples-choice-awards-chosen-fans-2176", "title": "TOP FIVE FINALISTS ANNOUNCED FOR ALL CATEGORIES OF “THE E! PEOPLE’S CHOICE AWARDS,” CHOSEN BY THE FANS - Warner Music Nashville Official News", "description": "The Nashville home of Warner Records, Atlantic Records and Elektra Nashville", "image": {"identifier": "https://www.warnermusicnashville.com/sites/g/files/g2000010586/files/styles/blog_og_style/public/E%21.png?itok=iMLXlqgK", "url": "https://www.warnermusicnashville.com/sites/g/files/g2000010586/files/styles/blog_og_style/public/E%21.png?itok=iMLXlqgK"}}, "facebook-domain-verification": "so6d4b9zkc2o5b53blaqc8oekmpg44", "google-site-verification": "zxr-p3MupaEWcIJbSBroKiDZJxKXbVBovsNBnLVyzTs", "twitter": {"description": "Warner Music Group's home for Country Music", "title": "Warner Music Nashville", "image": "https://www.warnermusicnashville.com/sites/g/files/g2000010586/files/WMN-Site-OGf.png"}, "Generator": "Drupal 9 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": null, "source": "http://www.warnermusicnashville.com", "summary": ""}