{"url": "www.billboard.com/articles/columns/pop/7647997/ed-sheeran-love-yourself-justin-bieber-divide-interview", "text": "It’s no secret that Ed Sheeran had a hand in writing Justin Bieber‘s megahit “Love Yourself,” but the British singer-songwriter recently revealed that the Biebs actually wasn’t the original artist in mind when he penned it. Without Bieber, though, the chart-topping tune would still be nonexistent — or may have never even come to fruition.\n\nExplore See latest videos, charts and news Ed Sheeran Justin Bieber See latest videos, charts and news\n\n“That was a song I had written for Divide. It just wouldn’t have made it,” Sheeran explained in an interview with Carson Daly on 97.1 AMP Radio Monday morning (Jan. 9). “And then Justin took it and did his thing on it, and released it as a single and made it what it is. So going from a song that would have never been released to [being] the biggest song of last year — it just became Billboard‘s #1 of 2016 of the whole year, and [was] nominated for Song of the Year at the GRAMMYs — it just shows you that you shouldn’t always write stuff off.”\n\nSheeran didn’t elaborate on what kind of touch Bieber had on the song, but he made sure to give the Purpose singer some credit. “[Justin] did have input on it, I wouldn’t say it was just all me.”\n\nThose who pay close attention to Bieber’s Twitter may have noticed that Sheeran also had a role in another one of the Bieb’s 2016 hits: the Major Lazer/MØ collaboration “Cold Water.” But before Sheeran actually heard the track, he didn’t realize he had written yet another smash for Bieber.\n\n“‘Cold Water’ was a weird one because I didn’t even know that song existed,” he explained. “It was a song I must’ve half-written somewhere at a time where I was writing a lot of songs and I did it at Benny Blanco’s house and then I got an email from Diplo just being like, ‘Yo! That ‘Cold Water’ song is dope! Can I have it?’ And I was like, ‘I have no idea what you’re talking about,’ so I just didn’t reply. And then he emailed and was like, “Yo, Justin [Bieber] wants to hop on the ‘Cold Water’ song. Is that cool?’ And I’m just like, ‘What are you talking about?’… And then the song came out and it was number one and I was like ‘Oh, that song!’ I remember doing it, but it was really, really slow. I remember hearing it and being like ‘That kind of sounds like me. Oh wait, it was me.'”\n\nWhile fans may never get to hear Sheeran’s versions of “Cold Water” or “Love Yourself” — though he did give one live performance of the latter in December — they did get a sneak peak last week of what’s to come with Divide. Sheeran released “Castle on the Hill,” an homage to his hometown of Suffolk, England, and the sexually charged “Shape of You,” which both shot to the top of iTunes on Friday (Jan. 6), and set a Spotify record in their first 24 hours of release.\n\nSheeran revealed on Jan. 12 that Divide will be dropping March 3, and has previously said that he will be sharing a few more new tunes from the LP prior to its release. Listen to his full AMP Radio interview below.", "images": ["https://www.billboard.com/wp-content/uploads/media/justin-bieber-ed-sheeran-2015-billboard-1548.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204652553202666&ev=PageView&noscript=1", "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/public/lazyload-fallback.gif"], "top_img": "https://www.billboard.com/wp-content/uploads/media/justin-bieber-ed-sheeran-2015-billboard-1548.jpg?w=1024", "keywords": [], "authors": ["Taylor Weatherby"], "canonical_link": "https://www.billboard.com/music/pop/ed-sheeran-love-yourself-justin-bieber-divide-interview-7647997/", "title": "Ed Sheeran Reveals ‘Love Yourself’ Was Originally Written For His New Album ‘Divide’", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/icons/icon-144x144.png", "msapplication-TileColor": "#eff4ff", "description": "The British singer didn't originally plan to give the No. 1 song of 2016 to Justin Bieber.", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "billboard", "pmc-page_type": "article", "articleid": 7647997, "author": "Taylor Weatherby", "pmc-category": "Music,Pop", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-01-09T15:55:35"}, "title": "Ed Sheeran Reveals ‘Love Yourself’ Was Originally Written For His New Album ‘Divide’", "pageclass": "article", "pmc-is_free": "no", "pmc-always-paywall": "no", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-exclusive": "no", "pmc-breaking-news": "no", "pmc-prime": "no"}, "generator": "WordPress 6.0.2", "author": "Taylor Weatherby", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Billboard", "application-name": "Billboard", "content_type": "Article", "post_id": 7647997, "title": "Ed Sheeran Reveals 'Love Yourself' Was Originally Written For His New Album 'Divide'", "published_at": "2017-01-09 15:55:35", "image": "https://www.billboard.com/wp-content/uploads/media/justin-bieber-ed-sheeran-2015-billboard-1548.jpg?w=1024", "comment_count": 0, "topics": "Pop", "body": "It's no secret that Ed Sheeran had a hand in writing Justin Bieber's megahit \"Love Yourself,\" but the British singer-songwriter recently revealed that the Biebs actually wasn't the original artist in mind when he penned it. Without Bieber, though, the chart-topping tune would still be nonexistent -- or may have never even come to fruition.“That was a song I had written for Divide. It just wouldn’t have made it,\" Sheeran explained in an interview with Carson Daly on 97.1 AMP Radio Monday morning (Jan. 9). \"And then Justin took it and did his thing on it, and released it as a single and made it what it is. So going from a song that would have never been released to [being] the biggest song of last year -- it just became Billboard's #1 of 2016 of the whole year, and [was] nominated for Song of the Year at the GRAMMYs -- it just shows you that you shouldn’t always write stuff off.”Sheeran didn't elaborate on what kind of touch Bieber had on the song, but he made sure to give the Purpose singer some credit. \"[Justin] did have input on it, I wouldn’t say it was just all me.\"Those who pay close attention to Bieber's Twitter may have noticed that Sheeran also had a role in another one of the Bieb's 2016 hits: the Major Lazer/MØ collaboration \"Cold Water.\" But before Sheeran actually heard the track, he didn't realize he had written yet another smash for Bieber.“‘Cold Water’ was a weird one because I didn’t even know that song existed,” he explained. “It was a song I must’ve half-written somewhere at a time where I was writing a lot of songs and I did it at Benny Blanco’s house and then I got an email from Diplo just being like, ‘Yo! That ‘Cold Water’ song is dope! Can I have it?’ And I was like, ‘I have no idea what you’re talking about,’ so I just didn’t reply. And then he emailed and was like, “Yo, Justin [Bieber] wants to hop on the ‘Cold Water’ song. Is that cool?’ And I’m just like, ‘What are you talking about?’... And then the song came out and it was number one and I was like ‘Oh, that song!’ I remember doing it, but it was really, really slow. I remember hearing it and being like ‘That kind of sounds like me. Oh wait, it was me.'\"While fans may never get to hear Sheeran's versions of \"Cold Water\" or \"Love Yourself\" -- though he did give one live performance of the latter in December -- they did get a sneak peak last week of what's to come with Divide. Sheeran released \"Castle on the Hill,\" an homage to his hometown of Suffolk, England, and the sexually charged \"Shape of You,\" which both shot to the top of iTunes on Friday (Jan. 6), and set a Spotify record in their first 24 hours of release.Sheeran revealed on Jan. 12 that Divide will be dropping March 3, and has previously said that he will be sharing a few more new tunes from the LP prior to its release. Listen to his full AMP Radio interview below.", "fb": {"pages": 75791669580}, "fragment": "!", "og": {"type": "article", "title": "Ed Sheeran Reveals ‘Love Yourself’ Was Originally Written For His New Album ‘Divide’", "url": "https://www.billboard.com/music/pop/ed-sheeran-love-yourself-justin-bieber-divide-interview-7647997/", "description": "The British singer didn’t originally plan to give the No. 1 song of 2016 to Justin Bieber.", "site_name": "Billboard", "image": {"identifier": "https://www.billboard.com/wp-content/uploads/media/justin-bieber-ed-sheeran-2015-billboard-1548.jpg?w=1024", "width": 1024, "height": 677, "alt": "Justin Bieber and Ed Sheeran"}, "locale": "en_US"}, "article": {"published_time": "2017-01-09T20:55:35+00:00", "modified_time": "2017-01-12T14:57:11+00:00"}, "twitter": {"site": "@billboard", "card": "summary_large_image", "title": "Ed Sheeran Reveals ‘Love Yourself’ Was Originally Written For His New Album ‘Divide’", "description": "The British singer didn't originally plan to give the No. 1 song of 2016 to Justin Bieber.", "image": "https://www.billboard.com/wp-content/uploads/media/justin-bieber-ed-sheeran-2015-billboard-1548.jpg?w=1024"}}, "movies": [], "publish_date": 1483995335.0, "source": "http://www.billboard.com", "summary": ""}