{"url": "https://www.billboard.com/articles/columns/pop/7998743/aaron-carter-back-in-rehab", "text": "After leaving a California rehab center earlier this month, Aaron Carter has checked back into a facility to complete his program. According to a statement posted on Sunday (Oct. 15) by spokesperson Steve Honig, “Aaron has taken care of the legal and financial matters that required his attention and returned to the wellness facility to complete his program.”\n\nExplore Explore Aaron Carter See latest videos, charts and news See latest videos, charts and news\n\nCarter checked into rehab on Sept. 22 to “improve his health and work on his overall wellness,” according to Honig, checking out two weeks later on Oct. 6. Upon checking in, Carter had tweeted determined messages, saying, “Only I can change my life. No one can do it for me.” On Oct. 7, Carter posted a before-and-after photo showcasing his recent weight gain, captioned, “From 115 pounds to 145 In a few weeks. On the left 115 on the right 145. Continuing to focus on myself and my health. Sorry I couldn’t wait to show you till 2018 #proudofmyself #StressFree I missed you all so much. Needed some time to heal and this is a direct result.”\n\nHonig could not be reached for additional comment at press time, but after Carter left the facility earlier this month the spokesperson said it was because of “several legal and personal matters the required his immediate and in person attention.” Back in August, Carter came out as bisexual through a heartfelt note on Twitter, weeks after his arrest for DUI and possession of marijuana. The next month was difficult for the star, as he suffered a broken nose and injuries to his arms and legs in a bad car crash in early September and was the subject of a series of welfare visits from police.\n\nBefore going in for treatment the first time Carter promised fans that he’d have new music for them soon. “My loved ones, I would like to tell all of you that I will be disappearing for a while to work on myself. I would also like to announce that I am releasing a gift to you on Oct. 27. In time for Halloween, a new version of ‘I Want Candy.’ 4 weeks later, I will be releasing my first single from my new album, LOVE,” he wrote in a since deleted post. “I’ll see you soon looking amazing and ready to play all my new songs LIVE. Most importantly, my stressors haven’t subsided with family and this year has been crazy and I need some time off from all of it.”", "images": ["https://www.billboard.com/wp-content/uploads/media/aaron-carter-smile-2015-billboard-1548.jpg?w=942&h=623&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.billboard.com/wp-content/uploads/media/aaron-carter-smile-2015-billboard-1548.jpg?w=1024", "https://www.facebook.com/tr?id=204652553202666&ev=PageView&noscript=1", "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/public/lazyload-fallback.gif"], "top_img": "https://www.billboard.com/wp-content/uploads/media/aaron-carter-smile-2015-billboard-1548.jpg?w=1024", "keywords": [], "authors": ["Gil Kaufman"], "canonical_link": "https://www.billboard.com/music/pop/aaron-carter-back-in-rehab-7998743/", "title": "Aaron Carter Checks Back Into Rehab", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/icons/icon-144x144.png", "msapplication-TileColor": "#eff4ff", "description": "After leaving a California rehab center earlier this month, Aaron Carter has checked back into a facility to complete his program.", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "billboard", "pmc-page_type": "article", "articleid": 7998743, "author": "Gil Kaufman", "pmc-category": "Music,Pop", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-10-16T08:45:02"}, "title": "Aaron Carter Checks Back Into Rehab", "pageclass": "article", "pmc-is_free": "no", "pmc-always-paywall": "no", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-exclusive": "no", "pmc-breaking-news": "no", "pmc-prime": "no"}, "generator": "WordPress 6.0.2", "author": "Gil Kaufman", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Billboard", "application-name": "Billboard", "content_type": "Article", "post_id": 7998743, "title": "Aaron Carter Checks Back Into Rehab", "published_at": "2017-10-16 08:45:02", "image": "https://www.billboard.com/wp-content/uploads/media/aaron-carter-smile-2015-billboard-1548.jpg?w=1024", "comment_count": 0, "topics": "Pop", "body": "After leaving a California rehab center earlier this month, Aaron Carter has checked back into a facility to complete his program. According to a statement posted on Sunday (Oct. 15) by spokesperson Steve Honig, \"Aaron has taken care of the legal and financial matters that required his attention and returned to the wellness facility to complete his program.\"Carter checked into rehab on Sept. 22 to “improve his health and work on his overall wellness,” according to Honig, checking out two weeks later on Oct. 6. Upon checking in, Carter had tweeted determined messages, saying, “Only I can change my life. No one can do it for me.” On Oct. 7, Carter posted a before-and-after photo showcasing his recent weight gain, captioned, “From 115 pounds to 145 In a few weeks. On the left 115 on the right 145. Continuing to focus on myself and my health. Sorry I couldn't wait to show you till 2018 #proudofmyself #StressFree I missed you all so much. Needed some time to heal and this is a direct result.”Honig could not be reached for additional comment at press time, but after Carter left the facility earlier this month the spokesperson said it was because of \"several legal and personal matters the required his immediate and in person attention.\" Back in August, Carter came out as bisexual through a heartfelt note on Twitter, weeks after his arrest for DUI and possession of marijuana. The next month was difficult for the star, as he suffered a broken nose and injuries to his arms and legs in a bad car crash in early September and was the subject of a series of welfare visits from police.Before going in for treatment the first time Carter promised fans that he'd have new music for them soon. \"My loved ones, I would like to tell all of you that I will be disappearing for a while to work on myself. I would also like to announce that I am releasing a gift to you on Oct. 27. In time for Halloween, a new version of 'I Want Candy.' 4 weeks later, I will be releasing my first single from my new album, LOVE,\" he wrote in a since deleted post. \"I'll see you soon looking amazing and ready to play all my new songs LIVE. Most importantly, my stressors haven't subsided with family and this year has been crazy and I need some time off from all of it.\"", "fb": {"pages": 75791669580}, "fragment": "!", "og": {"type": "article", "title": "Aaron Carter Checks Back Into Rehab", "url": "https://www.billboard.com/music/pop/aaron-carter-back-in-rehab-7998743/", "description": "After leaving a California rehab center earlier this month, Aaron Carter has checked back into a facility to complete his program.", "site_name": "Billboard", "image": {"identifier": "https://www.billboard.com/wp-content/uploads/media/aaron-carter-smile-2015-billboard-1548.jpg?w=1024", "width": 1024, "height": 677, "alt": "Aaron Carter, 2015"}, "locale": "en_US"}, "article": {"published_time": "2017-10-16T12:45:02+00:00", "modified_time": "2017-10-16T12:45:02+00:00"}, "twitter": {"site": "@billboard", "card": "summary_large_image", "title": "Aaron Carter Checks Back Into Rehab", "description": "After leaving a California rehab center earlier this month, Aaron Carter has checked back into a facility to complete his program.", "image": "https://www.billboard.com/wp-content/uploads/media/aaron-carter-smile-2015-billboard-1548.jpg?w=1024"}}, "movies": [], "publish_date": 1508157902.0, "source": "https://www.billboard.com", "summary": ""}