{"url": "https://www.usatoday.com/story/life/tv/2018/05/31/series-finales-10-best-and-five-worst-all-time-americans-breaking-bad-mash-lost-himym-newhart-cheers/636504002/", "text": "The 10 best (and five worst) TV series finales of all time\n\nShow Caption Hide Caption 'The Americans' Keri Russell and Matthew Rhys: Spy vs. Spy \"The Americans\" stars Keri Russell and Matthew Rhys: What do they love (and hate) about each others' characters? Robert Deutsch/USA TODAY\n\nThere's nothing like the anticipation, expectation and dread that surrounds the finale of a beloved TV series.\n\nThis year, three long-running shows — New Girl, The Middle and The Americans — said goodbye with three satisfying finales. But that's not always the case. Sometimes, no matter how much you love what came before, a series can miss on its last swing, leaving a bitter taste for years to come.\n\nWe've ranked the 10 best and five worst of all time, from golden classics (M*A*S*H) to recent travesties (How I Met Your Mother).\n\nPrefer to listen? Our geek culture podcast, The Mothership, debates the best and worst series finales of all time.\n\nSubscribe for free on Apple Podcasts | Stitcher | SoundCloud\n\nThe best\n\n1. Six Feet Under (HBO)\n\nSix Feet Under was always about facing our own mortality (it was, after all, about a family-run funeral-home business), and the near-perfect finale faced the great beyond head-on in its excruciatingly beautiful last sequence, which flashed forward to the deaths of all the main characters — predictable, tragic or absurd. Every series finale that’s used the flash-forward technique owes a great debt to Six Feet.\n\n2. Newhart (CBS)\n\nAs twisty and self-referential as modern TV has gotten, no show could possibly pull off a twist as shocking and meta as the finale of Newhart, which is perhaps better remembered than the show itself. After Dick Loudon (Bob Newhart) is hit in the head with a golf ball, the show cuts to Dr. Robert Hartley, Newhart's character from his previous series, The Bob Newhart Show, waking up from a dream in bed with his wife. All eight seasons of Newhart, set in a Vermont inn, were Hartley's dream. Not even Westworld could do better.\n\n3. M*A*S*H (CBS)\n\nIn a poignant, emotional and still top-rated finale, the 11-year run of M*A*S*H (eight years longer than the Korean War it depicted) came to an end as Hawkeye Pierce (Alan Alda) and (most of) the rest finally went home. The sometimes dark final episode, which manages one last \"war is hell\" moment, perfectly captured the spirit of the series.\n\n4. The Mary Tyler Moore Show (CBS)\n\nJust thinking about that loving final hug is enough to make any MTM fan tear up. The finale ended in the sad, inescapable way many jobs in the real world do. The new owner of WJM fired the entire TV newsroom (well, except Ted), and the former co-workers came together to say goodbye. It felt realistic and emotional, just like most of MTM's run.\n\n5. Battlestar Galactica (Syfy)\n\nThe finale to the space epic succeeded where Lost failed, finding a way to use the spiritual and divine to answer its mysteries while making a profound statement about the nature of humanity. Sure, some are still angered by the deus ex machina convenience of the messy, benevolent god guiding the humans and cylons alike, but the relationship between creators and their creations was always the central tenet of the series. And even though the humans and the cylons gave up technology to start a simpler life on Earth, the flash forward to modern robotics also emphasized the show's themes: All this has happened before, and will again. So say we all.\n\n6. The Sopranos (HBO)\n\nThe only bad thing you can say about The Sopranos finale is that it pushed the saturation of Journey's Don't Stop Believin' to the breaking point in the years that followed. Some fans didn't take to the open-ended, cut-to-black finale of the mobster drama, which didn't reveal whether Tony Soprano (James Gandolfini) lived or died, but his life was too nebulous to be resolved so cleanly.\n\n7. The Shield (FX)\n\nNot every series about an anti-hero is interested in comeuppance at the end, but even if it did, no punishment would be as perfect as the one served to Vic Mackey (Michael Chiklis) in the final episode of the police drama. Mackey ends up in his own version of prison, wasting away at an office job, far from the action and adrenaline he craves.\n\n8. Cheers (NBC)\n\nSam's (Ted Danson) true love was always his bar. The Cheers finale isn't nearly as happy or funny as many sitcoms' exits, but its wistful tone worked for the bittersweet episode. The gang couldn't stay at the bar forever.\n\n9. Breaking Bad (AMC)\n\nLike any figure so tragic and Shakespearean, Walter White (Bryan Cranston) couldn't survive the end of his story. The cancer-ridden chemistry teacher-turned-drug kingpin had finally admitted his malicious acts were purely for pleasure, but was able to at least partially redeem himself by helping Jesse (Aaron Paul), one of the people he hurt the most.\n\n10. The Americans (FX)\n\nSpoiler alert: The Soviet spy series just concluded its six-year run Wednesday, and the emotions are still running high, so maybe in a few years it wouldn't make this list. But the episode, which found Philip (Matthew Rhys) and Elizabeth (Keri Russell) returning to the Soviet Union after the FBI finally figured out they're illegals, was perfectly suited to the series. They left behind their unwitting son, Henry (Keidrich Sellati), and their comrade daughter, Paige (Holly Taylor), leaves them. This is as close to a happy ending as the series could offer, at once surprising and deeply satisfying.\n\nThe worst\n\n1. How I Met Your Mother (CBS)\n\nThe finale of the long-running young-friends-in-New York sitcom was legendary, for all the wrong reasons. The episode finally introduced Ted (Josh Radnor) to the mother (Cristin Milioti) of his future children and then, in a series of flash-forwards, proceeded to kill her off and have Ted rekindle his relationship with Robin (Cobie Smulders) after she divorced Barney (Neil Patrick Harris). Had the show not proved that Ted and Robin were a bad couple many times over, and had it not set the entire last season at Robin and Barney's wedding, it might have been able to pull off this ending. Instead, it marked a classic example of a series that mapped out a plan from the beginning but shouldn't have stuck to it.\n\n2. Seinfeld (NBC)\n\nThat's it? The decision to end the beloved sitcom about a group of New York misanthropes by putting them in jail for being bad Samaritans is now 20 years old, but age hasn't helped it.\n\n3. Lost (ABC)\n\nA show that wove as many mysteries into its fabric as this supernatural drama did was always bound to dissatisfy some with its conclusion, but the easy, schmaltzy way that the series gave everyone a perfect happy ending in the afterlife was the worst choice.\n\n4. Dexter (Showtime)\n\nThe serial-killer drama started to decline long before its much-derided finale, but that didn't help soften the blow of Dexter's (Michael C. Hall) bizarre decision to fake his own death and take up life as a somber lumberjack.\n\n5. Charmed (WB)\n\nThe witchy series almost came to an end after seven seasons before getting a reprieve for an eighth. But the finale to Season 7 was a far better way for the Halliwell sisters to exit — leaving their witch lives behind and going undercover with new identities — than the actual finale, in which the trio won perfect relationships and lived happily ever after. Charmed often subverted fairy-tale tropes, so the fairy-tale ending didn't track.", "images": ["https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png", "https://media.gannett-cdn.com/29906170001/29906170001_5756324094001_5755637000001-vs.jpg?pubId=29906170001", "https://www.gannett-cdn.com/-mm-/bd0b4b341f7ae1a3cd89a72d5ed0bdd2588eb7bf/c=0-0-3595-2031/local/-/media/2018/05/25/USATODAY/USATODAY/636628531773215850-2WalterWhite-BryanCranston.jpg?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg"], "top_img": "https://www.gannett-cdn.com/-mm-/bd0b4b341f7ae1a3cd89a72d5ed0bdd2588eb7bf/c=0-0-3595-2031/local/-/media/2018/05/25/USATODAY/USATODAY/636628531773215850-2WalterWhite-BryanCranston.jpg?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Kelly Lawler"], "canonical_link": "https://www.usatoday.com/story/life/tv/2018/05/31/series-finales-10-best-and-five-worst-all-time-americans-breaking-bad-mash-lost-himym-newhart-cheers/636504002/", "title": "The 10 best (and five worst) TV series finales of all time", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/tv/2018/05/31/series-finales-10-best-and-five-worst-all-time-americans-breaking-bad-mash-lost-himym-newhart-cheers/636504002/life/tv", "theme-color": "#ffffff", "og": {"type": "article", "title": "The 10 best (and five worst) TV series finales of all time", "description": "In honor of 'The Americans,' 'New Girl' and 'The Middle' signing off for good, we've ranked the 10 best and five worst TV finales of all time, from 'Six Feet Under' to 'How I Met Your Mother.'", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/bd0b4b341f7ae1a3cd89a72d5ed0bdd2588eb7bf/c=0-0-3595-2031/local/-/media/2018/05/25/USATODAY/USATODAY/636628531773215850-2WalterWhite-BryanCranston.jpg?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "In honor of 'The Americans,' 'New Girl' and 'The Middle' signing off for good, we've ranked the 10 best and five worst TV finales of all time, from 'Six Feet Under' to 'How I Met Your Mother.'", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1527721200.0, "source": "https://www.usatoday.com", "summary": ""}