{"url": "https://www.cnn.com/2017/07/10/entertainment/blac-chyna-gma-restraining-order/index.html", "text": "Story highlights Chyna appeared on \"Good Morning America\" Monday She denied getting pregnant for revenge\n\nCNN —\n\nBlac Chyna was granted a temporary restraining order barring Rob Kardashian from coming near her or posting about her online.\n\nThe reality star appeared in court Monday morning with her attorneys as she sought to stop what she alleges is cyber-bullying by Kardashian.\n\nKardashian posted personal information last week about his relationship with Chyna on his Instagram account, including sexually explicit images of his former fiancée whom he accused of cheating on him and using him for his fortune.\n\nOutside of court, Chyna’s attorney Lisa Bloom said they were granted everything they sought in their petition.\n\n“As we have said all along, revenge porn is a form of domestic abuse,” Bloom said. “It is also a crime in California and 38 other states.”\n\nAttorney Robert Shapiro represented Kardashian, who did not appear in court.\n\nShapiro said his client stipulated to the restraining order and agreed to follow all the conditions.\n\nThe attorney said Kardashian’s concern now “is the health and welfare of the baby and both parents are going to work toward that goal.”\n\n“I, personally, on Mr. Kardahsian’s behalf apologized and offered our regrets as to what happened in the past couple of days,” Shapiro said. “Now we move forward to do one thing and one thing only, what ever is in the best interest of the child.”\n\nChyna echoed that sentiment in a brief statement she made after the hearing.\n\n“I’m just going to get back to co-parenting Dream,” she said.\n\nIn the petition, Chyna, whose legal name is Angela White, alleged that Kardashian swore at her in front of her 4-year-old son, King, and got angered when she attempted to call King’s father during an argument back in April.\n\n“Rob immediately grabbed my phone and pushed me to the ground by aggressively shoving me by the side of my arm and hitting me on the side,” the declaration read. “I fell down from the blow to my side. I was sore and it hurt to walk.”\n\nThe next hearing in the case has been set for August 8.\n\nEarlier the model and entrepreneur appeared on “Good Morning America” with Bloom in an interview which aired Monday morning before the hearing.\n\nChyna told “GMA” she was “devastated” by Kardashian’s actions.\n\n“Like, this is a person I trusted,” she said. “I just felt…betrayed.”\n\nShe denied claims she engaged with the photos by liking some of the images her ex posted, saying she has Kardashian blocked on Instagram.\n\nShe said she decided to pursue legal action after speaking with her former love with whom she shares an eight-month-old daughter, Dream.\n\n“The moral of the story is he doesn’t respect me,” said Chyna, whose real name is Angela White. “If you can’t respect me, you have to respect the law.”\n\nBloom said on Friday she had filed for a temporary restraining order against Kardashian on behalf of her client.\n\nRelated: Lisa Bloom puts Rob Kardashian on notice over tirade against Blac Chyna\n\nCalifornia has laws regarding “revenge porn” in which a person can be charged for publicly releasing unauthorized nude images of another person to cause them emotional distress.\n\nThe former couple has had a tumultuous relationship that’s been documented on both social media and their E! reality series “Rob & Chyna.”\n\nThings were also complicated by the fact Chyna shares a son with rapper Tyga, who left her to begin dating Kardashian’s younger sister, Kylie Jenner.\n\nOn Monday’s “GMA” appearance, Bloom defended Chyna against those who say the reality star already exposes a great deal of herself in her own social media postings.\n\n“Any explicit photos that she may have chosen to post in the past that’s her choice,” Bloom said. “This is like saying that a woman can’t be raped if she previously chose to have sex with someone. It’s her body, it’s her choice,each and every time.”\n\nChyna said she and Kardashian split in December and there is absolutely no hope of a reconciliation. She said she has not heard from any of his family members since Kardashian’s social media postings last Wednesday.\n\nChyna addressed speculation that she got pregnant as a revenge ploy against the Kardashians or to get money out of the reality mogul family, Chyna denied it.\n\n“I was already Blac Chyna before the Kardsahians,” she said.", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/140929104601-lisa-france-profile-image.jpg?q=x_2,y_0,h_898,w_1596,c_crop/h_270,w_480/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/170710103419-blac-chyna-restraining-order.jpg?q=x_3,y_156,h_1684,w_2993,c_crop/w_800"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/170710103419-blac-chyna-restraining-order.jpg?q=x_3,y_156,h_1684,w_2993,c_crop/w_800", "keywords": [], "authors": ["Lisa Respers France"], "canonical_link": "https://www.cnn.com/2017/07/10/entertainment/blac-chyna-gma-restraining-order/index.html", "title": "Blac Chyna granted restraining order against Rob Kardashian", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "'Devastated' Blac Chyna granted restraining order against Rob Kardashian | CNN", "description": "Blac Chyna was granted a temporary restraining order barring Rob Kardashian from coming near her or posting about her online.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/170710103419-blac-chyna-restraining-order.jpg?q=x_3,y_156,h_1684,w_2993,c_crop/w_800", "type": "article", "url": "https://www.cnn.com/2017/07/10/entertainment/blac-chyna-gma-restraining-order/index.html", "site_name": "CNN"}, "twitter": {"title": "'Devastated' Blac Chyna granted restraining order against Rob Kardashian | CNN", "description": "Blac Chyna was granted a temporary restraining order barring Rob Kardashian from coming near her or posting about her online.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/170710103419-blac-chyna-restraining-order.jpg?q=x_3,y_156,h_1684,w_2993,c_crop/w_800", "card": "summary_large_image", "site": "@CNNent"}, "description": "Blac Chyna was granted a temporary restraining order barring Rob Kardashian from coming near her or posting about her online.", "template_type": "article_leaf", "type": "article", "meta-section": "entertainment", "theme": "entertainment", "article": {"published_time": "2017-07-10T13:12:14Z", "modified_time": "2017-07-11T20:21:17Z", "tag": "blac chyna, celebrities, rob kardashian, internet and www, lisa bloom, social media, technology, law and legal system, restraining orders, trial and procedure", "publisher": "https://www.facebook.com/CNN"}, "keywords": "blac chyna, celebrities, rob kardashian, internet and www, lisa bloom, social media, technology, law and legal system, restraining orders, trial and procedure", "author": "Lisa Respers France", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1499641200.0, "source": "https://www.cnn.com", "summary": ""}