{"url": "https://en.wikipedia.org/wiki/Here_Comes_Honey_Boo_Boo", "text": "American reality television series\n\nHere Comes Honey Boo Boo Genre Reality television Starring Shannon family Country of origin United States Original language English No. of seasons 4 No. of episodes 48 Production Executive producers Lauren Lexton\n\nTom Rogan\n\nSara Reddy Running time 25 minutes Production company Authentic Entertainment Release Original network TLC Original release August 8, 2012 ( ) –\n\nApril 21, 2017 ( 2017-04-21 ) Chronology Followed by Mama June: From Not to Hot\n\nHere Comes Honey Boo Boo was an American reality television series that aired on TLC featuring the family of child beauty pageant contestant Alana \"Honey Boo Boo\" Thompson. The show premiered on August 8, 2012, and ended on August 14, 2014. Thompson and her family originally rose to fame on TLC's reality series Toddlers & Tiaras.[1] The show's name comes from a taunt that Alana hurled at another pageant contestant during her debut in Toddlers and Tiaras,[2] but a sweeping misinterpretation from the general public resulted in Alana being referred to as \"Honey Boo Boo Child\" instead. The show revolves around Alana \"Honey Boo Boo\" Thompson and her family's adventures in the town of McIntyre, Georgia. The reality series received predominantly negative reviews from television critics during its run.\n\nOn October 24, 2014, TLC cancelled the series after four seasons when cast member June \"Mama June\" Shannon was seen with Mark Anthony McDaniel, a man who served 10 years in prison after being convicted of aggravated child molestation in 2004 and who is a registered sex offender. This prompted Shannon to admit to Entertainment Tonight that the father of her daughter Lauryn \"Pumpkin\" Shannon was not McDaniel as previously stated, but Michael Anthony Ford, another convicted sex offender who served time for sexual exploitation of minors after being caught on To Catch a Predator in 2005.[3] A number of episodes had already been taped for a fifth season, but none were released until TLC aired four of them as the two-hour special Here Comes Honey Boo Boo: The Lost Episodes on April 21, 2017.\n\nCast and premise\n\nBesides Alana, who was six years old when the first season was filmed, the show features her stay-at-home mother June \"Mama June\" Shannon; her father Mike \"Sugar Bear\" Thompson, a chalk miner; and her three sisters: Lauryn \"Pumpkin\" Shannon, Jessica \"Chubbs\" Shannon, and Anna \"Chickadee\" Shannon (now Anna Cardwell).[4][5][6] Anna Shannon gave birth to daughter Kaitlyn Cardwell in the first-season finale.[7][8]\n\nThe first season of Here Comes Honey Boo Boo aired from August 8 to October 26, 2012, and was followed by four specials airing in early 2013.\n\nIn September 2012, Here Comes Honey Boo Boo was renewed for a second season.[9] The second season debuted July 17, 2013, and concluded on September 11, 2013. The second season featured preparations for the wedding/\"commitment ceremony\" of June Shannon and Mike Thompson. For the second-season premiere, TLC distributed \"Watch 'N' Sniff\" cards, allowing viewers to release scents correlating with specific scenes.[10]\n\nOn September 20, 2013, it was announced that TLC had ordered a twelve-episode third season and three specials.[11] The third season premiered on January 16, 2014,[12] and concluded on March 6, 2014.\n\nRatings and reception\n\nThe series premiere episode attained a 1.6 rating in the 18–49 demographic, attracting 2.2 million viewers.[13] The series was one of TLC's highest-rated shows in its first season.[14] The August 29 episode, airing on Wednesday night during the 2012 Republican National Convention, attracted almost 3 million viewers and scored a 1.3 rating among 18- to 49-year-olds, the highest rating in that age group for any cable program that night.[15] Fox News convention coverage was second in the time period with a 1.2 rating, while NBC coverage had a 1.1.[15]\n\nCritical reaction to the series has been mixed, with some characterizing the show as \"offensive\", \"outrageous\" and \"exploitative\", while others call it \"must-see TV\".[16]\n\nCriticism\n\nThe A.V. Club called the first episode a \"horror story posing as a reality television program\",[17] with others worrying about potential child exploitation.[18] James Poniewozik mostly praised the show, but criticized the producers for \"the way that the show seems to assume that those viewers will look at this family and the world.\"[19]\n\nA reviewer for Forbes criticized TLC as trying to \"portray Alana's family as a horde of lice-picking, lard-eating, nose-thumbing hooligans south of the Mason–Dixon line\", stating that \"it falls flat, because there's no true dysfunction here, save for the beauty pageant stuff\".[20] The Guardian also criticized the attempt to portray the Thompsons as people to \"point and snicker at,\" saying, \"none of the women or girls who participate in the show seems to hate themselves for their poverty, their weight, their less-than-urbane lifestyle, or the ways in which they diverge from the socially-acceptable beauty standard.\"[21]\n\nThe Hollywood Reporter pronounced the show \"horrifying,\" explaining:\n\nYou know this show is exploitation. TLC knows it. Maybe even Mama and HBB know it, deep down in their rotund bodies. Here Comes Honey Boo Boo is a car crash, and everybody rubber-necks at a car crash, right? It's human nature. Yes, except that if you play that card, you also have to realize that human nature comes with the capacity to draw a line, to hold fast against the dehumanization and incremental tearing down of the social fabric, even if this never-ending onslaught of reality television suggests that's a losing effort. You can say no to visual exploitation. You can say no to TLC. And you can say no to Honey Boo Boo Child. Somebody has to.[22]\n\nTV Guide's \"Cheers & Jeers 2012\" issue commented, \"Jeers to Here Comes Honey Boo Boo for existing. Alana Thompson and her family have lowered the TV bar to new depths while introducing viewers to the terms 'forklift foot' and 'neck crust.' In a word, ewww.\"[23]\n\nJune Shannon herself was criticized for her daughter's diet, which included \"Go Go Juice,\" a mixture of Red Bull and Mountain Dew that contains as much caffeine as two cups of coffee. She used the blended beverage to get her daughter ready for pageants. Shannon, in responding to such criticism, pointed out, \"There are far worse things...I could be giving her alcohol.\"[1]\n\nPraise\n\nOut praised the show for Alana Thompson's attitude toward her gay paternal uncle Lee \"Poodle\" Thompson; Thompson stated, \"Ain't nothing wrong with bein' a little gay.\" Out noted the show's \"clear message of equality\" and said that Alana's acceptance of her gay relative \"confounded\" the stereotype of the \"redneck\" working-class, Southern white female.[24]\n\nJune Shannon has been praised by Mother Nature Network for her \"keen business sense\" with which she feeds her family on $80 a week by clipping copious coupons, playing bingo, exploiting roadkill, and acquiring child-support checks from each of her four children's fathers.[14]\n\nPrior to the show's second season, Hank Stuever of The Washington Post said the show \"feels as real to me as the Great Depression images shot by the WPA photographers\" and praised the \"solid—if unorthodox—family values.\"[25]\n\nParodies\n\nHere Comes Honey Boo Boo has been lampooned by the animated TV series South Park, in its season 16 episode \"Raising the Bar\",[26] by the animated TV series MAD, in a short called \"Here Comes Yogi Boo Boo\", and in an online spoof uploaded on CollegeHumor called \"Precious Plum.\"[27]\n\nChristopher Walken, Colin Farrell and Sam Rockwell took time from promoting their new film Seven Psychopaths to deliver a dramatic rendition of Here Comes Honey Boo Boo.[28]\n\nThe film Scary Movie 5 featured a scene parodying Sinister where Simon Rex is frightened by an Alana look-a-like that pops out of a cardboard box and says, \"A dollar makes me holla, honey boo boo child.\"\n\nIn the tenth season of competition reality show RuPaul's Drag Race, contestant Eureka O'Hara impersonated Alana during the show's recurring challenge 'Snatch Game', which is, in itself, a parody of the popular show Match Game.\n\nCancellation\n\nOn October 24, 2014, TLC announced the cancellation of the show after reports surfaced that June Shannon was dating a man convicted of child molestation. Shannon and her older daughter Lauryn denied these reports.[29] The man in question, Mark Anthony McDaniel, Sr., was convicted of aggravated child molestation of an 8-year-old in March 2004. McDaniel is listed as a registered sex offender with the Georgia Sex Offender Registry.[29][30] Shannon's eldest daughter confirmed that she is the child who was molested by McDaniel 10 years earlier.[29][31] TLC commented on the future of the series regarding the current situation with the following statement: \"We are currently reassessing the reports, but we do not currently have Here Comes Honey Boo Boo in production\".[32]\n\nAn entire season's worth of episodes – which could reportedly fill six months of schedule[33] – were left unaired, following the cancellation of the show.[34]\n\nPost-cancellation\n\nUpon hearing of the show's cancellation, Vivid Entertainment president Steven Hirsch sent a letter to June Shannon, offering her and her former live-in partner, Mike Thompson, US$1 million to appear in a pornographic film. Hirsch stated that the studio's BBW themed productions have become a very popular genre on Vivid.com and VividTV, and he would make the couple's experience \"enjoyable\" for them both, as well as give them creative input.[35] But June refused, explaining, \"I have more respect for myself and my kids and my family. It ain't happening, not even for a zillion dollars.\"\n\nAlana also collaborated with singer/songwriter Adam Barta in 2015,[36] and along with sister Pumpkin, released a song called \"Movin' Up,\" which was met with mixed reviews. The music video featured June and Sugar Bear, and amassed millions of views online,[37] which started a viral craze, the \"honey boo boo bop\", written by Barta.[38]\n\nJune \"Mama June\" Shannon and Mike \"Sugar Bear\" Thompson returned to reality television in 2015 as participants of Marriage Boot Camp: Reality Stars 4. While the couple were there to work on their marriage, Sugar Bear ultimately revealed his infidelities to June.\n\nIn 2017 June launched her own reality series on We TV called Mama June: From Not to Hot, produced and co-starring her manager, Gina Rodriguez, as well as Alana, Sugar Bear, and Lauryn.[39][40][41]\n\nIn 2021, Alana and Mama June competed on the sixth season of The Masked Singer as the \"Beach Ball\".\n\nEpisodes\n\nSeason Episodes Originally aired First aired Last aired 1 10 August 8, 2012 ( ) October 26, 2012 ( 2012-10-26 ) 2 12 July 17, 2013 ( ) September 11, 2013 ( 2013-09-11 ) 3 12 January 16, 2014 ( ) March 6, 2014 ( 2014-03-06 ) 4 14 June 19, 2014 ( ) August 14, 2014 ( 2014-08-14 )\n\nSeason 1 (2012)\n\nNo.\n\noverall No. in\n\nseason Title Original air date Prod.\n\ncode U.S. viewers\n\n(millions) 1 1 \"This Is My Crazy Family\" August 8, 2012 ( ) 101 2.25[42] 2 2 \"Gonna Be a Sassy Girl\" August 8, 2012 ( ) 102 2.14[42] 3 3 \"She Oooo'd Herself\" August 15, 2012 ( ) 103 2.05[43] 4 4 \"I'm Sassified!\" August 15, 2012 ( ) 104 1.94[43] 5 5 \"What Is a Door Nut?\" August 22, 2012 ( ) 105 2.33[44] 6 6 \"A Bunch of Wedgies\" August 29, 2012 ( ) 106 2.99[45] 7 7 \"Shh! It's a Wig\" October 5, 2012 ( ) 107 2.39[46] 8 8 \"Time for a Sketti!\" October 12, 2012 ( ) 108 2.15[47] 9 9 \"Ah-choo!\" October 19, 2012 ( ) 109 2.15[48] 10 10 \"It Is What It Is\" October 26, 2012 ( ) 110 2.75[49]\n\nSeason 2 (2013)\n\nNo.\n\noverall No. in\n\nseason Title Original air date U.S. viewers\n\n(millions) 11 1 \"Mo' Butter, Mo' Better\" July 17, 2013 ( ) 2.83[50] 12 2 \"Turn This Big Mama On\" July 17, 2013 ( ) 2.91[50] 13 3 \"It's Always Something With Pumpkin\" July 24, 2013 ( ) 2.05[51] 14 4 \"The 'M' Word\" July 24, 2013 ( ) 2.43[51] 15 5 \"Chubby Chaser\" July 31, 2013 ( ) 2.15[52] 16 6 \"Safety!\" July 31, 2013 ( ) 2.55[52] 17 7 \"Runaway Bride!\" August 7, 2013 ( ) 2.01[53] 18 8 \"Big Girls Wear Lace-Ups\" August 14, 2013 ( ) 1.89[54] 19 9 \"Get Her Chins Vacuumed\" August 21, 2013 ( ) 2.05[55] 20 10 \"Lift and Scoop\" August 28, 2013 ( ) 2.17[56] 21 11 \"Stress Poops\" September 4, 2013 ( ) 1.96[57] 22 12 \"Happily Ever After?\" September 11, 2013 ( ) 3.21[58]\n\nSeason 3 (2014)\n\nNo.\n\noverall No. in\n\nseason Title Original air date U.S. viewers\n\n(millions) 23 1 \"The Manper\" January 16, 2014 ( ) 2.07[59] 24 2 \"The Birds and The Boos\" January 16, 2014 ( ) 1.91[59] 25 3 \"Familymoon\" January 23, 2014 ( ) 1.53[60] 26 4 \"Hubba Bubba!\" January 23, 2014 ( ) 1.58[60] 27 5 \"Get a Job\" January 30, 2014 ( ) 2.00[61] 28 6 \"Funk Shway\" January 30, 2014 ( ) 2.39[61] 29 7 \"Monkeys Make Very Good Brothers\" February 6, 2014 ( ) 1.91[62] 30 8 \"Stand Peein' Up\" February 6, 2014 ( ) 2.02[62] 31 9 \"Can I Say *****?\" February 13, 2014 ( ) 1.81[63] 32 10 \"You Need Your Thumb to Vacuum Clean\" February 20, 2014 ( ) 1.75[64] 33 11 \"Sherlock Poop\" February 27, 2014 ( ) 1.44[65] 34 12 \"You're Be Nineteen\" March 6, 2014 ( ) 1.99[66]\n\nSeason 4 (2014)\n\nNo.\n\noverall No. in\n\nseason Title Original air date U.S. viewers\n\n(millions) 35 1 \"3 Generations & 1 Pork Rind\" June 19, 2014 ( ) 1.73[67] 36 2 \"Yodega\" June 26, 2014 ( ) 1.51[68] 37 3 \"Bingo Face\" June 26, 2014 ( ) 1.74[68] 38 4 \"Top 10 Summer Moments\" July 3, 2014 ( ) 1.04[69] 39 5 \"Forced Family Fun!\" July 10, 2014 ( ) 1.34[70] 40 6 \"Civil War\" July 10, 2014 ( ) 1.50[70] 41 7 \"Vowel of Silence\" July 17, 2014 ( ) 1.18[71] 42 8 \"Brain Rest\" July 17, 2014 ( ) 1.33[71] 43 9 \"This Couch is on Fire\" July 24, 2014 ( ) 1.22[72] 44 10 \"Spring Broken\" July 24, 2014 ( ) 1.38[72] 45 11 \"Girl Power\" July 31, 2014 ( ) 1.39[73] 46 12 \"Trouble in Paradise\" July 31, 2014 ( ) 1.46[73] 47 13 \"Ain't Gonna Leave Me\" August 7, 2014 ( ) 1.12[74] 48 14 \"Annabama\" August 14, 2014 ( ) 1.81[75]\n\nSpecials\n\nNo. Title Original air date Prod.\n\ncode U.S. viewers\n\n(millions) SP1 \"A Very Boo Halloween To Be...\" January 6, 2013 ( ) 111324 3.08[76] SP2 \"A Very Boo Thanksgiving\" January 13, 2013 ( ) 112 2.19[77] SP3 \"You Don't Know Boo!\" January 27, 2013 ( ) 113 1.93[78] SP4 \"A Very Boo Christmas\" February 10, 2013 ( ) 114 1.80[79] SP5 \"Halloween Too\" March 13, 2014 ( ) 313-60 1.92[80] SP6 \"Never Boo-fore Seen\" March 20, 2014 ( ) 314-60 1.86[81] SP7 \"New Years Revolutions\" March 27, 2014 ( ) 315-90 1.91[82] SP8 \"The Lost Episodes\" April 21, 2017 ( ) TBA 0.59[83]\n\nSpin-offs\n\nOn February 24, 2017, June \"Mama June\" Shannon returned to television for a nine-episode WE tv reality show, Mama June: From Not to Hot. The show documented her weight loss transformation from 460 to 160 pounds (209 to 73 kg).[84]", "images": ["https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e4/Here_Comes_Honey_BooBoo_title_card.png/250px-Here_Comes_Honey_BooBoo_title_card.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/e/e4/Here_Comes_Honey_BooBoo_title_card.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/e/e4/Here_Comes_Honey_BooBoo_title_card.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Here_Comes_Honey_Boo_Boo", "title": "Here Comes Honey Boo Boo", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/e/e4/Here_Comes_Honey_BooBoo_title_card.png", "width": 640, "height": 247}, "title": "Here Comes Honey Boo Boo - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}