{"url": "https://web.archive.org/web/20190508154525/https://ohmy.disney.com/quiz/2018/04/27/quiz-avengers-infinity-war-character/", "text": "In Marvel Studios’ Avengers: Infinity War the mightiest superheroes in the universe are going head to head with Thanos in the most epic mashup of all time. And today, the wait is over because the film is finally here! (BRB heading to the theater.) Prepare yourself by finding out which character you are most like:\n\n1 Pick one word to describe yourself: Eccentric Honest Complex Courageous Secretive Poised Scrappy Passionate Genius Loyal Sarcastic Mischievous Energetic Proud Ambitious 2 Which superpower or skill is most awesome to you? Genius engineer Super durability Super strength Weather control Master spy Super agility Ability to shrink Telekinesis Master inventor Expert marksman Expert pilot Magic skills Spider senses Teleportation ALL OF THEM! 3 Your favorite subject in school is or was: Shop History Chemistry Gym Foreign language International studies Recess Debate Physics Study Hall Lunch English Science Biology All of the above 4 Which Disney animated character do you most identify with? Kuzco Jiminy Cricket Grumpy Sully Megara Simba Robin Hood Esmeralda Stitch Eeyore Flynn Rider Maleficent Rapunzel Merlin Chernabog 5 What is your dream job out of the following? CEO Coach Scientist Athlete Spy Royalty Comedian Writer Inventor FBI Agent Pilot Magician Director Doctor Ruler of ALL! 6 Pick a food or drink to have right now: Cheeseburger Cake Green tea Steak Pasta Water Ice Cream Cookies Frappuccino Snow Cone Donut Fruit Pizza Bagel Coffee 7 Pick a weekend activity: Throwing an epic party Watching a baseball game Reading and relaxing Hitting the gym Traveling Spending time with family Working my weekend job Volunteering Inventing something Catching up with an old friend Going to an awesome concert Pulling pranks on my friends Studying for school Perfecting a hobby Planning my goals 8 Which of these characters would you most want to have dinner with? Iron Man Captain America Hulk Thor Black Widow Black Panther Ant-Man Scarlet Witch Shuri Winter Soldier Star-Lord Loki Spider-Man Doctor Strange Thanos 1 of 8 You’re Tony Stark aka Iron Man! You’re brilliant, outgoing and a bit over the top, but you have a heart of gold. You’re presence commands attention the minute you walk into a room. Share on Facebook Share on Pinterest Share on Twitter Take this quiz again! You’re Steve Rogers aka Captain America! Just like Cap, you’re righteous, noble, and incredibly brave. You’re also an old soul that would do anything to keep the people you love safe. Share on Facebook Share on Pinterest Share on Twitter Take this quiz again! You’re Bruce Banner aka the Hulk! Incredibly intelligent and dualistic in nature, your personality can shift between being incredibly brainy and shy to dynamic and outgoing in seconds. You sometimes love attention, but you’re most comfortable among your friends. Share on Facebook Share on Pinterest Share on Twitter Take this quiz again! You’re Thor! Just like our favorite Asgardian, you’re confident, strong, and totally worthy of all the attention you get. You are a born leader! Share on Facebook Share on Pinterest Share on Twitter Take this quiz again! You’re Natasha Romanoff aka Black Widow! You’re strong, independent, and super smart. You might also have some major spy skills. Your friends know that they can trust you with anything, and that you’ll always be there to support them. Share on Facebook Share on Pinterest Share on Twitter Take this quiz again! You’re T’Challa aka Black Panther! You have the spirit of a King or Queen! Just like T’Challa, you’re honorable, responsible and a true leader. You have a strong moral compass and your family and friends trust you to do what’s right. Share on Facebook Share on Pinterest Share on Twitter Take this quiz again! You’re Wanda Maximoff AKA Scarlet Witch! You’re a passionate, caring person who fights for what you believe in. You have always stood out from the crowd, but you prefer to lay low and spend time with close friends. Share on Facebook Share on Pinterest Share on Twitter Take this quiz again! You’re Shuri! With a personality as big as your intellect, you’re a genius innovator with sass to spare! Share on Facebook Share on Pinterest Share on Twitter Take this quiz again! You’re Bucky Barnes aka Winter Soldier! A loyal friend, your chilly exterior is just a front for your big heart. You are strong and brave, and you always put others before yourself. Share on Facebook Share on Pinterest Share on Twitter Take this quiz again! You’re Peter Quill aka Star-Lord! A bit of a rebel, you’re someone who moves through life with an upbeat, and frequently sarcastic, personality. You’re also an amazing dancer and you make great mix tapes! Share on Facebook Share on Pinterest Share on Twitter Take this quiz again! You’re Peter Parker aka Spider-Man! You’re always energetic and fun, not to mention a total ace at school. Your positive attitude and desire to help others makes you a great friend and confidant. Share on Facebook Share on Pinterest Share on Twitter Take this quiz again! You’re Doctor Strange! You’re the mature one in your friend group! You love to study new subjects and learn new skills, and you’re constantly reinventing yourself. You’re a good friend to have! Share on Facebook Share on Pinterest Share on Twitter Take this quiz again!\n\nNow that you know which of the Avengers characters you’re most like, purchase tickets for Avengers: Infinity War to cheer them on in theaters! Before you go, you might want to flip through Marvel Studios 101: All Your Questions Answered to prepare yourself for the epic adventure.\n\nOh My Disney participates in affiliate commission programs, including with Amazon, which means that we receive a share of revenue from purchases you make from the links on this page.\n\nPosted 1 year Ago", "images": ["https://web.archive.org/web/20190508154525im_/https://ohmy.disney.com/wp-content/themes/omd-theme/assets/images/branding-logo-dark@2x.png", "https://web.archive.org/web/20190508154525im_/https://ohmy.disney.com/wp-content/uploads/2018/03/InfinityWarAvengers.jpg"], "top_img": "https://web.archive.org/web/20190508154525im_/https://ohmy.disney.com/wp-content/uploads/2018/03/InfinityWarAvengers.jpg", "keywords": [], "authors": ["Oh My Disney", "Oh My Disney Contributor"], "canonical_link": "https://web.archive.org/web/20190508154525/https://ohmy.disney.com/quiz/2018/04/27/quiz-avengers-infinity-war-character/", "title": "Quiz: Which Avengers: Infinity War Character Are You?", "meta_data": {"HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "twitter": {"card": "summary_large_image", "creator": "@disney", "site": "@disney", "title": "Quiz: Which Avengers: Infinity War Character Are You?", "description": "In Marvel Studios' Avengers: Infinity War the mightiest superheroes in the universe are going head to head with Thanos in the most epic mashup of all time. And today, the wait is over because the fil", "image": "https://web.archive.org/web/20190508154525im_/https://ohmy.disney.com/wp-content/uploads/2018/03/InfinityWarAvengers.jpg"}, "description": "Find out which character from Marvel Studios' Avengers: Infinity War you are most like as you get ready to see the epic film this weekend!", "author": "Oh My Disney", "og": {"site_name": "Oh My Disney", "type": "article", "locale": "en_US", "url": "https://web.archive.org/web/20190508154525/https://ohmy.disney.com/quiz/2018/04/27/quiz-avengers-infinity-war-character/", "title": "Quiz: Which Avengers: Infinity War Character Are You?", "description": "A question we all need the answer to.", "image": {"identifier": "https://web.archive.org/web/20190508154525im_/https://ohmy.disney.com/wp-content/uploads/2018/03/InfinityWarAvengers.jpg", "width": 2048, "height": 1080}}, "fb": {"app_id": 434027466688626}, "article": {"published_time": "2018-04-27T23:58:07+00:00", "modified_time": "2018-04-30T21:20:02+00:00", "author": "https://ohmy.disney.com/contributor/ohmydisney-2/", "section": "Movies", "tag": "Tony Stark A.K.A. Iron Man (The Avengers)"}}, "movies": [], "publish_date": 1524783600.0, "source": "https://web.archive.org", "summary": ""}