{"url": "https://www.cosmopolitan.com/style-beauty/beauty/how-to/a33187/how-to-defrizz-your-hair/", "text": "First of all, let’s get something clear: Frizzy hair is absolutely not something that needs to be “fixed.” Nor does it need to be tamed, controlled, or whatever else you’ve heard over the years. If you love your frizz (hi, voluminous waves and curls), keep it and work with it. But if frizz and flyaways aren’t part of the ~lewk~ you’re going for rn, you might be searching for the best hacks to smooth your frizzies, flyaways, and wispies—and hey, that’s cool too.\n\nFew things are as frustrating as spending all your time styling your hair only for it to frizz up with a gust of wind and a little humidity. But as you know because you’re currently searching for how to “fix” frizzy hair, smoothing your frizz and flyaways isn’t all that simple. So to help ya out, we got all the tried-and-true tricks and product recs from professional hairstylists, beauty editors, and even a dermatologist. If smooth, flyaway-free hair is your goal, keep reading for the 15 best tips for frizzy hair, and take notes.\n\nMeet the experts\n\nWhat causes frizz and frizzy hair?\n\nBefore we jump to the tips, a quick refresher of what frizz is and what leads to frizzy hair: When your hair is damaged, dry, or chemically treated, the cuticle (outer layer of the hair strand) raises and opens up, which lets moisture enter, causes it to swell, and creates frizz. Knowing this, the key to smoothing frizz is making sure your hair cuticles are as flat and sealed as possible. So how exactly do you do that? Keep reading.\n\n1. Apply oil on damp or dry hair.\n\n“ , or any lightweight hair oil, is my true BFF for second-day flyaways on my 2c hair,” says Sami Roberts, beauty assistant at Cosmo. “I shake three or four drops into my palm, flip my head over, and rake oil through the length of my hair. It adds shine and lays down frizz without looking greasy.”\n\nCelebrity hairstylist Anthony Campbell loves using oil on frizzy hair when dry as well but also suggests applying it to damp, towel-dried hair after a shower. “I would use less oil on finer textures and a little more for thicker textures,” Campbell says.\n\n2. Take your time when blow-drying.\n\nGHD Air Professional Performance Hairdryer ulta.com $199.00 SHOP NOW\n\nIf you haphazardly blow dry your hair, chances are you'll have knots, tangles, flyaways, frizz—you name it—by the end of your styling sesh. Blow-drying your hair in sections with a boar bristle brush to create the tension needed to smooth the hair, and actually using the nozzle attachment that comes with your blow dryer can make all the difference. “When blow-drying, use the concentrator nozzle so that you can control the direction of airflow, pointing downward, so you are encouraging the cuticle to lay down flat,” says Aaron Grenia, co-founder of .\n\n\n\n3. Prep your hair with heat protectant.\n\nFried, sizzled hair is way more prone to frizz and flyaways than healthy, nourished hair, so if you know you're using a hot tool, make sure you've got a solid heat protectant on hand. Don't have one? Consider a multipurpose styling product that offers not only heat protection but other benefits as well so you get the most bang for your buck. Grenia recommends the as the first step in your styling routine. When applied to damp hair, it can help detangle, smooth frizz for hours, add shine, and of course, protect against heat up to 450 degrees.\n\n4. Use mousse for hairline frizzies.\n\nHerbal Essences Totally Twisted Curl-Boosting Mousse with Berry Essences amazon.com $8.58 SHOP NOW\n\nIf your hair frizzes up around your hairline or roots, Cosmo deputy beauty director Chloe Metzger has the perfect trick for smoothing it out when wearing a bun hairstyle or updo. “When I want a sleeker finish fast, I wet my hands, rub the tiniest puff of mousse between my hands to dilute it—think: 90 percent water, 10 percent mousse—then smooth my hands over my roots and hairline,” Metzger says. “Since it’s just the top layer of my hair, it doesn’t take a long time to dry, and I’m left with smooth, but not stiff, curls, thanks to the hint of mousse.”\n\n\n\n5. Wash with cleansers that contain glycerin.\n\nAlong with cutting out the sulfates, look for a shampoo with glycerin as one of the first ingredients (the closer the ingredients are to the top of the list, the more concentrated they are in the formula). Not only does glycerin help combat frizz by penetrating the hair shaft and hydrating it from the inside out, but it also creates a protective coating on the strand, helping mitigate damage, says celebrity hairstylist Mark Townsend.\n\n6. Finish styling with a hair serum.\n\nSEEN Magic Serum, Fragrance Free helloseen.com $36.00 SHOP NOW\n\nHair serums are one of the best answers to frizz and flyaways, but they're often filled with silicones. While some hair types may find silicones beneficial for heat-styling protection, conditioning, adding shine, and smoothing the cuticle, if you're trying to avoid them (as someone with curly hair or fine hair might), Iris Rubin, board-certified dermatologist and founder of , says to look for products with silicone alternatives.\n\n“Hemisqualane is a plant sugar-derived silicone alternative that provides color and heat protection and is great at reducing frizz,” Dr. Rubin explains. “Squalane is also wonderful for adding moisture and shine into hair.” The is fragrance-free and only contains three ingredients: squalane, hemisqualane, and ethylhexyl olivate, which softens the hair.\n\n7. Dry hair with a microfiber hair towel.\n\nAs you know, your hair is at its most vulnerable state when it’s wet. That means using the wrong towel can literally make (or break) your hair, which is why your fabric choice is that much more important. “Cotton towels create friction with your hair, leading to frizz and breakage,” says Giovanni Vaccaro, co-founder of Glamsquad. “I love and always recommend to dry your hair—they have a microfiber technology that prevents friction and helps dry hair faster.” You can also use an old T-shirt (Grenia's tip) to wring out any excess water without roughing up the cuticle.\n\n8. Get frequent trims to prevent breakage.\n\nFagaci Professional Hair Scissors 6 Inch amazon.com $81.99 SHOP NOW\n\nOne of the easiest ways to prevent damage and breakage that can lead to flyaways? Make sure you trim your hair at least once every three months. Split ends are especially prone to dryness (aka frizzy hair's worst nightmare) and can lead to breakage that makes the strand much shorter than the rest of your hair, so schedule regular appointments with your hairstylist to avoid any long-term damage.\n\nAnd, yes, since I know you're thinking it—you can trim your own hair at home, but make sure you invest in a pair of legit . “Think of cutting your hair as you would cutting fabric—you want a pair of good-quality shears to make sure you're getting a clean and safe cut,” celebrity hair expert Cory Aaron Scott previously told Cosmo. Scott recommends a pair from Fagaci for quick and easy maintenance in-between salon visits.\n\n9. Deep-condition your hair.\n\nIf your hair isn’t properly hydrated and moisturized, you’ll have a harder time smoothing frizz with styling products later on, which is why hairstylist Clariss Rubenstein says smoothing frizz starts in the shower. Opt for a smoothing shampoo and conditioner when you wash your hair, and add a deep-conditioning mask that suits your hair needs (whether that's moisturization or restoration) to your routine. Rubenstein's favorite for a silky finish is the , which is low in proteins and contains moisturizing ingredients like tananu, maracuja, and argan oil.\n\n10. Try keratin treatments.\n\nGussi At-Home Keratin Treatment Kit gussihair.com $60.00 SHOP NOW\n\nIf you're looking for a long-term solution to frizzy hair, ask your hairstylist about an in-salon hair-smoothing treatment. There are a handful of gentle, formaldehyde-free options on the market rn (see: Cezanne and Goldwell Kerasilk) that help soften and elongate your hair texture—no damage included.\n\nKathy Combs, global director of Education at Cezanne, previously told Cosmo, “Formaldehyde-free treatments smooth frizz without removing your texture. That means your hair will retain its natural curl when you air-dry, but it can still look smooth and sleek with a quick blow-dry.” Celebrity hairstylist Laura Rugetti loves the Pura Luxe straightening treatment and suggests asking your stylist about it as well.\n\nThere are even a few at-home keratin treatments worth trying too. This product from Gussi is spiked with keratin amino acids (to strengthen and repair split ends), castor oil (to smooth damaged cuticles), and a dose of moringa oil (for frizz).\n\n11. Ditch harsh shampoos.\n\n“Find a shampoo that is sulfate-free to prevent frizz,” says Rugetti. Shampoos with sulfates can strip and damage your hair over time, which will mess with your hair cuticle and lead to frizz. “My favorite gentle shampoo is —it's super moisturizing and leaves your hair feeling silky,\" she says.\n\n12. Dry your hair with a diffuser.\n\nDyson Special Edition Supersonic Hair Dryer ulta.com $429.99 SHOP NOW\n\nIf you've got curly or coily hair, you know that traditional blow-drying can leave you with more frizz and flyaways. If that's not your goal, try a diffuser attachment instead—it'll help evenly disperse the airflow from your dryer so you get more definition and volume. Hairstylist Leigh Hardges previously told Cosmo that one with a lot of tiny holes (like this diffuser by Dyson) decreases drying time without disturbing the curls.\n\nP.S. Need a visual? This tutorial is a great place to start for type 4 hair, and this one's excellent for looser curls. Just take your time with it and don't be afraid to customize your technique to fit your hair and its needs.\n\n13. Apply leave-in conditioner.\n\nNot to sound like a broken record, but if there's one piece of advice you take away from this article, let it be that moisture is the key to smoothing frizz. “I love to load the hair up with leave-in conditioner while wet to ensure my hair cuticle is filled with nourishing ingredients that will give the hair softness and shine,” says celeb hairstylist Marwa Bashir. When the humidity is higher and you need a bit more control, Bashir recommends the , but if you're wanting a silicone-free option, we suggest using the , which is packed with curl- and coil-loving oils.\n\n14. Block out humidity.\n\nOribe Impermeable Anti-Humidity Spray dermstore.com $23.00 SHOP NOW\n\nHumidity is a big reason behind unwanted frizz, and since you can't control the weather, try the next best thing: anti-humidity formulas. Hairstylist David Lopez previously told Cosmo that a is a must for anyone who lives in a humid climate to both minimize the effects of frizz and limit your use of heat-styling tools. Freelance beauty assistant Valeriya Chupinina agrees and says, “I like to pat my roots with an anti-humidity hairspray, like the , to shield my hair from any heat or frizz-inducing foe I might encounter throughout my day.”\n\n15. Sleep on a silk pillowcase for smoother hair.\n\nIf you're still sleeping on cotton and wake up with frizz, now is officially the time to switch to a silk pillowcase. “Silk really helps protect your hair while you sleep,” says Vaccaro. “It maintains your hair's natural oils, which is especially important if your hair is fragile from chemical treatments.\"", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/frizz-shampoo-1664210399.png?crop=1.00xw:1.00xh;0,0&resize=300:*", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/stray-hairs-1649962953.png?crop=1.00xw:0.337xh;0,0.257xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/stray-hairs-1649962953.png?crop=1.00xw:0.668xh;0,0.194xh&resize=640:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/stray-hairs-1649962953.png?crop=1.00xw:0.337xh;0,0.257xh&resize=1200:*", "keywords": [], "authors": ["Brooke Shunatona", "Brooke Shunatona Is A Contributing Writer For Cosmopolitan.Com.", "Ruwas The Beauty Editor At Cosmopolitan", "Where She Covered Beauty Across Print"], "canonical_link": "https://www.cosmopolitan.com/style-beauty/beauty/a33187/how-to-defrizz-your-hair/", "title": "15 Frizzy Hair Tips: How to Fix Frizzy Hair and Flyaways in 2022", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=6", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "These Tricks for Smoothing Flyaways Are Lowkey Genius", "description": "Prepare to have your sleekest look yet.", "url": "https://www.cosmopolitan.com/style-beauty/beauty/how-to/a33187/how-to-defrizz-your-hair/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/stray-hairs-1649962953.png?crop=1.00xw:0.337xh;0,0.257xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2022-08-01T13:19:36Z", "published_time": "2022-04-14T15:40:00Z", "section": "Beauty", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/stray-hairs-1649962953.png?crop=1.00xw:0.337xh;0,0.257xh&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "15 Frizzy Hair Tips: How to Fix Frizzy Hair and Flyaways in 2022", "description": "There's nothing wrong with frizz or flyaways, but they can certainly be annoying. We found 15 solutions to help you have your best hair day yet.", "keywords": "frizzy hair, best products for frizzy hair, best shampoo for frizzy hair, best conditioner for frizzy hair, hairstyles for frizzy hair, how to tame frizzy hair", "auto-publish": "never", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/stray-hairs-1649962953.png?crop=1.00xw:0.668xh;0,0.191xh&resize=320:*", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "sailthru.contenttype": "standard-article", "sailthru.tags": "Beauty & Style,style-beauty,beauty,Most Popular,Mark Garrison,Mark Townsend", "sailthru.date": "2022-04-14T15:40:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/stray-hairs-1649962953.png?crop=1.00xw:0.337xh;0,0.257xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/stray-hairs-1649962953.png?crop=1.00xw:0.668xh;0,0.191xh", "sailthru.socialtitle": "These Tricks for Smoothing Flyaways Are Lowkey Genius", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1649950800.0, "source": "https://www.cosmopolitan.com", "summary": ""}