{"url": "https://www.celebritynetworth.com/richest-celebrities/actors/lorenzo-lamas-net-worth/", "text": "What is Lorenzo Lamas net worth?\n\nLorenzo Lamas is an American actor who has a net worth of $2 million. Lorenzo Lamas is most well-known for his role on the soap opera \"Falcon Crest\" in the 1980s. for the role of \"Reno Raines\" on the '90s crime drama \"Renegade,\" and \"Hector Ramirez\" on the daytime soap opera \"The Bold and The Beautiful.\"\n\nFinancial Problems\n\nLorenzo has filed for bankruptcy several times, the most recent being in 2014 when he declared debts of $322,000. At the time he claimed his income was zero dollars per month. He owed $285,000 in taxes and $20,000 in in spousal support.\n\nEarly Life\n\nLamas was born on January 20, 1958 in Santa Monica, California. His mother was Norwegian actress Arlene Dahl and his father was Argentine actor Fernando Lamas. His parents did not stay together, however, and his father later married swimmer and film star Esther Williams when Lamas was 11.\n\nHe was primarily raised in Pacific Palisades, California before moving to New York in 1971. He attended the Admiral Farragut Academy in Pine Beach, New Jersey for high school, where he graduated in 1975.\n\nCareer\n\nLamas had developed an interest in acting as a child, having studied acting in Tony Barr's Film Actors Workshop. Soon after finishing high school, he landed his first TV acting role in 1976. He also had a minor non-speaking role in the 1978 musical, \"Grease.\" In the late 1970s and into the early 1980s, Lamas continued landing television guest roles in shows like \"Switch,\" \"Sword of Justice,\" \"Dear Detective,\" \"Secrets of Midland Heights,\" \"Fantasy Island,\" The Love Boat,\" and \"Hotel.\"\n\nIn 1980, Lamas landed the role of Lance Cumson in a new series to be called \"The Vintage Years.\" However, the show was reimagined and later became the prime time drama series \"Falcon Crest.\" The show became very popular on CBS, airing for nine seasons from 1981 to 1990. For his work on the show, Lamas was nominated for a Golden Globe award and two Soap Opera Digest Awards. He was also the only actor to appear in all 227 episodes of \"Falcon Crest.\"\n\nWhile on \"Falcon Crest,\" Lamas also appeared as the starring role in \"Body Rock,' a 1984 film. The movie was very poorly received and Lamas was nominated for a Golden Raspberry Award for Worst Actor and the film was later included as one of \"The 100 Most Enjoyably Bad Movies Ever Made.\"\n\nTowards the end of his run on \"Falcon Crest,\" Lamas began taking roles in more action-oriented films, as he had trained extensively in martial arts. He starred in movies like the \"Snake Eater\" trilogy from 1989 to 1992, \"Bounty Hunter\" in 1993, \"Gladiator Cop\" in 1995, and \"Terminal Justice\" in 1996. He also appeared in a wide number of other low-budget action films in the early 1990s.\n\nIn 1992, Lamas earned his next recurring leading role by playing Reno Raines, a falsely accused cop, in the syndicated series \"Renegade.\" The show ran from 1992 to 1997 and was seen in over 100 countries. The show allowed Lamas to display his interest in Harley-Davidson motorcycles and to grow his hair out long, as it was part of his character's signature look.\n\nIn 2004, Lamas landed another recurring role as Hector Ramirez on the soap opera, \"The Bold and the Beautiful.\" Lamas remained on the show until 2006. In August of 2007, Lamas starred in \"The King and I\" as the King of Siam. The play was performed at the Ogunquit Playhouse in Ogunquit, Maine. The same year, he also performed as the title role in \"Dracula\" at Kean University Premiere Stages in Union, New Jersey. He continued working in theater by performing as El Gallo in \"The Fantasticks\" at the Casa Manana Theatre in Fort Worth, Texas in 2008 followed by a performance in \"A Chorus Line\" back in Ogunquit in 2009.\n\nThroughout the 2010s, Lamas has continued landing rolls in films and television series and movies. Some of this credits include roles in \"Big Time Rush,\" \"The Joe Schmo Show,\" \"Workaholics,\" \"Lucha Underground,\" and \"Jane the Virgin.\" He also appeared as a contestant on the reality TV series \"Celebrity Apprentice\" in 2015.\n\nWhile Lamas has continued acting, he also began working as a helicopter pilot in the mid 2010s. He often flies people on day trips from Los Angeles to the Grand Canyon and also has worked for the company HeliNY based in New York City.\n\nPersonal Life\n\nLamas has been married a total of five times and has six children. His first wife was Victoria Hilbert, with whom he was married from 1981 to 1982. He then married his publicist, Michele Cathy, in 1983 and remained with her until 1985. During this time, he had a son, Alvaro, and a daughter, Shayne. After his divorce from Cathy, he began a relationship with Daphne Ashbrook. The two did not marry but did have a daughter together, Paton Lee, in 1988.\n\nIn 1989, Lamas married his third wife, Kathleen Kinmont. They remained married until 1993. He then married Shauna Sand in 1996 and had three daughters with her – Alexandra, Victoria, and Isabella – before divorcing in 2002. After their divorce, he then began a relationship with Shawna Craig and the two eventually married, though they divorced in 2018. In April of 2020, Lamas began dating a woman named Kenna Scott and then got engaged to her in February of 2021.\n\nLamas developed an interest in various martial arts when he was a young man. He started training Taekwondo in 1979 and earned a 3rd degree black belt. He subsequently began training Karate, Jujitsu, Aikido, and Shotokan and earned black belts in each.", "images": ["https://vz.cnwimg.com/wp-content/uploads/2010/02/Lorenzo-Lamas-e1591385262735.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2010/02/Lorenzo-Lamas-e1591385262735.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/lorenzo-lamas-net-worth/", "title": "Lorenzo Lamas Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Lorenzo Lamas net worth: Lorenzo Lamas is an American actor who has a net worth of $2 million. After beginning to act as a teenager, Lorenzo Lamas", "cnw_share_fb_count": 146, "cnw_share_tw_count": 13, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Lorenzo Lamas Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/lorenzo-lamas-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/02/Lorenzo-Lamas-e1591385262735.jpg", "site_name": "Celebrity Net Worth", "description": "Lorenzo Lamas net worth: Lorenzo Lamas is an American actor who has a net worth of $2 million. After beginning to act as a teenager, Lorenzo Lamas"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2022-05-09T20:41:52+00:00", "published_time": "2021-07-02T00:57:07+00:00", "section": "Actors", "tag": "richest reality stars"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/02/Lorenzo-Lamas-e1591385262735.jpg", "title": "Lorenzo Lamas Net Worth", "description": "Lorenzo Lamas net worth: Lorenzo Lamas is an American actor who has a net worth of $2 million. After beginning to act as a teenager, Lorenzo Lamas"}}, "movies": [], "publish_date": 1625187427.0, "source": "https://www.celebritynetworth.com", "summary": ""}