{"url": "https://en.wikipedia.org/wiki/Spencer_Pratt", "text": "American television personality (born 1983)\n\nSpencer William Pratt (born August 14, 1983) is an American reality television personality. In 2007, he began dating Heidi Montag, a primary cast member of the reality television series The Hills. Subsequently, he came to prominence after being cast in the series. Their relationship ultimately ended Montag's friendship with fellow cast member Lauren Conrad. The ensuing feud among the three became the central focus of the series, and was carried through each subsequent season.\n\nThe couple, collectively nicknamed \"Speidi,\" married in April 2009. Later that year, they made controversial appearances on the second season of the American version of I'm a Celebrity...Get Me Out of Here! In 2013, Montag and Pratt competed as a single entity on the eleventh series of the British version of Celebrity Big Brother, and returned to compete as a single entity on the nineteenth series in 2017. Pratt formerly appeared on Wife Swap and The Spyson Hour, a weekly segment on the reality TV podcast Rob Has a Podcast.\n\nEarly life [ edit ]\n\nPratt was born August 14, 1983, in Los Angeles, California.[1] He is the elder sibling of Stephanie, also a television personality.\n\nReality television career [ edit ]\n\n2005: The Princes of Malibu [ edit ]\n\nPratt first appeared on television in 2005 in the short-lived reality series The Princes of Malibu. As creator and executive producer of the series, Pratt acted in the role of \"manager/publicist/agent/stylist\" for series star Brody Jenner.[2]\n\n2007–2010: The Hills [ edit ]\n\nIn 2006, MTV developed the reality television series The Hills as the spin-off of Laguna Beach: The Real Orange County. It originally chronicled the lives of Lauren Conrad, who appeared on its predecessor, her housemate Heidi Montag, and friends Audrina Patridge and Whitney Port.[3] In 2007, Pratt began dating and later moved into an apartment with Montag, which led to the deterioration of her friendship with Conrad.[4][5] During the third season, Conrad ended her friendship with Montag after she suspected that Pratt was responsible for rumors of a sex tape involving her and her former boyfriend Jason Wahler; the ensuing feud between the three carried through each subsequent season.[6] After Conrad established companionships with Jenner and Frankie Delgado, he severed ties with both men.[7]\n\nIn August, Montag entered the music industry and began recording her debut studio album. Later that month, the song \"Body Language\" was leaked on the internet, and featured a rapped verse from Pratt.[8] He later directed the music video for Montag's first promotional single \"Higher\".[9]\n\nLater that year, Montag and Pratt appeared on the second season of the American version of I'm a Celebrity...Get Me Out of Here! in support of the \"Feed the Children\" foundation.[10] They quit after Montag was hospitalized with a gastric ulcer[11] and later created controversy after alleging that they were subject to torture during production.[12] After leaving the series, Montag and Pratt became notorious for their antics and antagonistic roles, notably during an interview with Al Roker of Today,[13] and were described as \"everything that's wrong with America\".[14] In May 2010, Pratt and Montag made their final appearance on The Hills halfway through the sixth and final season.[15][unreliable source?] In 2009, Spencer and Heidi appeared at the How I Met Your Mother episode \"Benefits\" as themselves.\n\nIn July, Montag filed for divorce from Pratt, citing irreconcilable differences in the petition.[16] However, they called it off in September after confessing that the action was intended to boost Montag's ailing career.[17] In November, they renewed their vows in Carpinteria, California.[18] Pratt was arrested and jailed in Costa Rica on September 11, 2010, while attempting to board an aircraft with hunting weapons. He was subsequently released and banned from re-entering the country.[19]\n\nPratt's work on The Hills earned him the title of \"Greatest Reality TV Villain\" on Yahoo!'s fan-voted poll in 2015. Other nominees for this award included Juan Pablo Galavis, Omarosa Manigault, Will Kirby, and Russell Hantz.[20]\n\n2013–2014: Celebrity Big Brother UK [ edit ]\n\nIn January 2013, Montag and Pratt (as a single entity) competed as housemates on the eleventh series of the British version of Celebrity Big Brother,[21] where they notably developed a minor feud with singer and television personality Rylan Clark.[22] They were named the runners-up, losing to Clark.[23] On February 18, Channel 5 aired a one-off television special discussing Montag and Pratt's rise to prominence, titled Speidi: Scandal, Secrets & Surgery!.[24]\n\nTV Guide included him in its 2013 list of \"The 60 Nastiest Villains of All Time.\"[25]\n\nThe couple appeared in the E! Documentary special After Shock: Heidi & Spencer.[26]\n\n2015: Marriage Boot Camp and Partnership with Rob Has a Podcast [ edit ]\n\nPratt and Montag were houseguests on We TV's Marriage Boot Camp, as they worked out their differences about having children. While there, the couple met and became friends with Survivor winner Tyson Apostol and his girlfriend Rachel Foulger. When Marriage Boot Camp aired on television, Pratt and Apostol began hosting The Spyson Hour, a weekly podcast to recap the show, alongside Rob Cesternino of Rob Has a Podcast. After the season finished airing, Pratt, Apostol, and Cesternino continued The Spyson Hour, discussing Pratt's reality TV history and zany current events. Pratt left the show in October 2015.\n\n2017: Return to Celebrity Big Brother UK [ edit ]\n\nIn 2017, Pratt re-entered the Celebrity Big Brother with his wife. On day 18, the couple was eternally nominated by James Cosmo, which they did not have a good reaction to. They were saved in an eight-person eviction on day 22. However, they were evicted on day 25 against Kim Woodburn, Jessica Cunningham, Bianca Gascoigne and Jedward. Pratt and Montag were reunited with their rival, Rylan Clark-Neal, on Big Brother's Bit on the Side that night.\n\n2018: Snapchatter of the Year [ edit ]\n\nPratt developed a widespread fanbase on Snapchat by posting stories showing his family, daily life and his passion for hummingbirds. His popularity led to him being nominated in January 2018 for Snapchatter of the Year at the 10th Annual Shorty Awards, eventually winning the category.[27]\n\n2019: The Hills: New Beginnings [ edit ]\n\nAt the 2018 MTV Video Music Awards, MTV announced a reboot of The Hills entitled The Hills: New Beginnings, slated to premiere in 2019. Pratt was announced as part of the cast of the new series.[28][29][30]\n\nPersonal life [ edit ]\n\nIn December 2013, Pratt completed his undergraduate degree in political science at the University of Southern California after ten years. Pratt had left his studies to pursue television projects and re-enrolled in 2011.[31]\n\nDuring the fourth season of The Hills, Montag and Pratt eloped in Mexico on November 20, 2008.[32] A wedding ceremony was held on April 25, 2009, in Pasadena, California.[33][34] Their son Gunner Stone was born on October 1, 2017.[35]", "images": ["https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Spencer_Pratt_2009.jpg/220px-Spencer_Pratt_2009.jpg", "https://upload.wikimedia.org/wikipedia/commons/e/e0/Spencer_Pratt_2009.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Spencer_Pratt_2009.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Spencer_Pratt", "title": "Spencer Pratt", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Spencer_Pratt_2009.jpg/640px-Spencer_Pratt_2009.jpg", "width": 640, "height": 960}, "title": "Spencer Pratt - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}