{"url": "https://www.cheatsheet.com/entertainment/what-happens-if-prince-philip-outlives-queen-elizabeth-ii.html/", "text": "We can’t imagine living in a world that Queen Elizabeth II isn’t a part of. She may be 92 years old, but she seems more lively and upbeat than ever — and we’re sure she’s loving the recent royal marriages as well as the arrival of new little members of the family. While she may still be participating in royal engagements, there’s no doubt that many worry about the old age of her and her husband, Prince Philip. And many wonder what may happen if Prince Philip, who’s currently 97, outlives his beloved wife.\n\n‘London Bridge Is Down’ is code for when the queen dies\n\nShe’s held the title of queen for 65 years, Marie Claire notes — but the country still has to be prepared when she eventually passes. “London Bridge Is Down” is code for the queen’s death, and it will first be uttered by the queen’s private secretary over a secure phone line to the prime minister. From there, 15 governments outside the U.K. where Queen Elizabeth is the head of state as well as 36 other Commonwealth nations will be alerted far before the media catches wind.\n\nWhile it’s widely reported that the BBC will be the first to break the news when Philip dies, the Press Association news agency and other global news will be told about the queen’s death at once. This plan, as well as the rest of the protocol, has been laid out since the ’60s and is carefully revised each year. And reporters at the BBC have even said they’re so prepared for this day that they’ve been rehearsing what they’ll say when the queen dies for over 30 years.\n\nPhilip will not receive a ‘King Father’ title\n\nIn a scenario where Queen Elizabeth II dies before Philip, there’s been wide speculation about what this will mean for his title. In reality, Philip’s title wouldn’t change. Associate professor Rob Cover told Quora that while Queen Elizabeth II’s mother was known as “Queen Mother” to the public, Philip would not get a “King Father” title if his wife was to die. And, in reality, Queen Mother isn’t even an official royal title.\n\nThe reason Queen Elizabeth was given the Queen Mother title in the first place was to avoid confusion after her husband died. When Queen Elizabeth II took the throne after her father’s death, the original Queen Elizabeth was then known as Queen Elizabeth the Queen Mother. Since Philip doesn’t interfere at all with the line of succession, there’s no need for him to change titles if he were to be widowed.\n\nIt’s up to Prince Charles to decide what happens next\n\nAfter Queen Elizabeth II dies, the next royal to take the throne is her son, Prince Charles. The public may think that Philip could be next in line, but according to succession rules, that’s simply not the case. As Royal Central notes, Charles will take the throne next — and from there, it’s up to him to decide what happens next. Charles will get to decide whether his father will be next in line for the throne after him, or if William is up next. As Marlene Koeing, a royal historian, notes, “We won’t know until Charles is king.”\n\nIt’s also unlikely Prince Philip would move, too. Koeing said, “I doubt he would be uprooted. He stays at Sandringham, liking Wolferton.”\n\nBoth royals appear to be in good health as of now\n\nThey may be elderly, but there’s no doubt that these two royals are still in good health. Daily Express reports the queen is in “remarkable health” and has not spoken of retirement any time soon. And Prevention notes her healthy eating habits certainly contribute to her longevity, too.\n\nPhilip retired from royal engagements back in 2017, but there’s little concern of his health failing him thus far. The public has noticed he’s not around as much anymore, though, and it’s been reported that he’s needed a few surgeries. Even so, it seems we don’t have to worry about any sudden changes in the royal family just yet.\n\nCheck out The Cheat Sheet on Facebook!", "images": ["https://www.cheatsheet.com/wp-content/uploads/2018/10/Queen-Elizabeth-II-attends-the-annual-Braemar-Highland-Gathering-in-2018-1024x682.jpg?w=1200", "https://www.cheatsheet.com/wp-content/uploads/2018/10/Queen-Elizabeth-II-attends-the-annual-Braemar-Highland-Gathering-in-2018.jpg?w=1024&h=682", "https://pixel.quantserve.com/pixel/p-73816c7sp-TNg.gif", "https://sb.scorecardresearch.com/p?c1=2&c2=27134408&cv=2.0&cj=1", "https://www.cheatsheet.com/wp-content/uploads/2018/02/GettyImages-466072342.jpg?w=1024&h=787", "https://www.cheatsheet.com/wp-content/uploads/2021/09/showbiz_2x.png", "https://www.cheatsheet.com/wp-content/uploads/2018/09/GettyImages-969181178.jpg?w=1024&h=671", "https://www.cheatsheet.com/wp-content/themes/remoter/images/f_logo_RGB-Blue_58.png", "https://www.cheatsheet.com/wp-content/themes/remoter/images/youtube.png", "https://www.cheatsheet.com/wp-content/themes/remoter/images/instagram.png", "https://www.cheatsheet.com/wp-content/themes/remoter/images/twitter_icon.png"], "top_img": "https://www.cheatsheet.com/wp-content/uploads/2018/10/Queen-Elizabeth-II-attends-the-annual-Braemar-Highland-Gathering-in-2018-1024x682.jpg?w=1200", "keywords": [], "authors": ["Lauren Weiler"], "canonical_link": "https://www.cheatsheet.com/entertainment/what-happens-if-prince-philip-outlives-queen-elizabeth-ii.html/", "title": "What Happens if Prince Philip Outlives Queen Elizabeth II?", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "max-image-preview:large", "description": "Now that Queen Elizabeth II and Prince Philip are both in their 90s, many wonder what will happen if Philip outlives his wife. Here's what you should know.", "og": {"locale": "en_US", "type": "article", "title": "What Happens if Prince Philip Outlives Queen Elizabeth II?", "description": "Now that Queen Elizabeth II and Prince Philip are both in their 90s, many wonder what will happen if Philip outlives his wife. Here's what you should know.", "url": "https://www.cheatsheet.com/entertainment/what-happens-if-prince-philip-outlives-queen-elizabeth-ii.html/", "site_name": "Showbiz Cheat Sheet", "image": "https://www.cheatsheet.com/wp-content/uploads/2018/10/Queen-Elizabeth-II-attends-the-annual-Braemar-Highland-Gathering-in-2018-1024x682.jpg?w=1200"}, "article": {"publisher": "https://www.facebook.com/ShowbizCheatsheet", "published_time": "2018-11-04T18:39:09+00:00", "modified_time": "2018-11-02T16:39:55+00:00"}, "author": "Lauren Weiler", "twitter": {"card": "summary_large_image", "creator": "@cheatsheet", "site": "@cheatsheet", "label1": "Written by", "data1": "Lauren Weiler", "label2": "Est. reading time", "data2": "4 minutes"}, "generator": "WordPress 6.0.2"}, "movies": [], "publish_date": 1541356749.0, "source": "https://www.cheatsheet.com", "summary": ""}