{"url": "https://www.mercurynews.com/2018/09/18/emmy-win-reported-u-s-open-date-help-lindsay-shookus-cope-with-ben-affleck-split/", "text": "It looks like Lindsay Shookus listened to that popular saying about how “looking good is the best revenge.”\n\nThat’s because Shookus, fresh off her breakup from Ben Affleck, donned a spectacular, plunging black evening gown Monday night to get up on stage at the 2018 Emmy Awards. “Saturday Night Live,” which she produces, had just been honored for outstanding variety sketch series.\n\nShookus, 38, later posed, smiling with her trophy, with her blond hair pulled up in a messy updo.\n\nThe image offers up a contrast to a report that she’s “devasted” by her breakup last month from Affleck. The breakup was announced the same week that Affleck was photographed in the company of 22-year-old Playboy model Shauna Sexton, followed by video of his ex-wife Jennifer Garner driving him up to Malibu to check into rehab for his ongoing struggles with alcohol addiction.\n\nBut in addition to joining Lorne Michaels and the rest of her “SNL” crew to pick up some Emmys, Shookus has apparently found other ways to cope with separating herself from Affleck’s high-profile personal challenges.\n\nVanity Fair writer Josh Duboff said on his “In the Limelight” podcast that Shookus was spotted on a date Sept. 8 at the U.S. Open women’s final. A source emailed Duboff to say that Shookus was seen with an unidentified man, holding hands, and hustling to leave the USTA Billie Jean King National Tennis Center in New York City after the match between Serena Williams and Naomi Osaka.\n\nShookus, wearing a khaki jacket, white jeans, sneakers and sunglasses, “seemed concerned she was going to be spotted,” the source told Duboff. “At least that’s how she framed it to her affectionate date, who held hands tightly with her as they rushed out a side entrance.”\n\nIf both Shookus and Affleck, 46, have moved on with new romances, they’re both enjoying pretty quick rebounds, given that they looked like they were getting pretty serious.\n\nThey dated publicly for year but it’s been reported that their romance went back to 2013 or 2014 when Affleck was still married to Garner, the mother of his three children.\n\nBut maybe things were never that serious between them. There have been various accounts offered for why things didn’t work out, including Affleck’s acknowledged drinking problems.\n\nBut it’s also possible he was never “fully committed” to Shookus, according to People. Or maybe Garner found it hard to accept Shookus being around their three children. There also were reports that Affleck and Shookus, who are based on opposite coasts and are each parents to young children, simply couldn’t find time to be together.\n\nIn any case, Affleck hasn’t been letting what should be an intensive recovery program at The Canyon in Malibu interfere with his budding relationship with Sexton. While he stays the nights at the Malibu facility, he enjoys daily trips back to his Pacific Palisades home to work out with trainers. He also has been spending time with Sexton at his mansion, and the model has been seen visiting The Canyon and driving around Los Angeles in his SUV.\n\nA source told Entertainment Tonight that Affleck has been told to hold off starting a new relationship while he is so early in his recovery program. But he’s not listening.\n\n“His closest friends hoped he was just dating her and would break it off after going to rehab, but he seems to get closer to her every day,” a source said. “The more time Ben seems to spend with Shauna, the more he seems to want to go home.”\n\nFor Shookus, hearing about Sexton becoming Affleck’s new female companion hasn’t been easy, the source told Entertainment Tonight.\n\n“Lindsay was supporting Ben in the beginning but now he seems to be relying more on Shauna than Lindsay and she is devastated,” the source said.\n\n“She believed he would get sober and they would work it out, but that isn’t how things seem to be panning out,” the source added.", "images": ["https://www.mercurynews.com/wp-content/themes/wp-mason/static/images/site-logo/banglogo_small.png", "https://i0.wp.com/www.mercurynews.com/wp-content/uploads/2018/09/Shookus2.jpg?fit=620%2C9999px&ssl=1", "https://i0.wp.com/www.mercurynews.com/wp-content/uploads/2018/09/BenAffleckRecovery.jpg?fit=620%2C9999px&ssl=1", "https://www.mercurynews.com/wp-content/uploads/2020/09/mn-logo.svg", "https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg", "https://www.mercurynews.com/wp-content/uploads/2018/09/Shookus1.jpg?w=1024&h=820"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2018/09/Shookus1.jpg?w=1024&h=820", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2018/09/18/emmy-win-reported-u-s-open-date-help-lindsay-shookus-cope-with-ben-affleck-split/", "title": "U.S. Open date, Emmy win: Lindsay Shookus after Ben Affleck", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "robots": "max-image-preview:large", "description": "Lindsay Shookus tries to cope with her breakup from Ben Affleck by winning an Emmy for 'Saturday Night Live' and reportedly finding romance at the U.S. Open.", "generator": "WordPress 6.0.2", "fb": {"pages": 63095136336}, "vf": {"url": "https://www.mercurynews.com/2018/09/18/emmy-win-reported-u-s-open-date-help-lindsay-shookus-cope-with-ben-affleck-split/", "container_id": 5562969}, "og": {"type": "article", "title": "Emmy win, reported U.S. Open date help Lindsay Shookus cope with Ben Affleck split", "url": "https://www.mercurynews.com/2018/09/18/emmy-win-reported-u-s-open-date-help-lindsay-shookus-cope-with-ben-affleck-split/", "description": "As Ben Affleck mixes rehab with dating a Playboy model, Lindsay Shookus moves on by winning an Emmy for ‘Saturday Night Live’ and reportedly finding romance at the U.S. Open.", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2018/09/Shookus1.jpg?w=1024&h=820", "width": 1024, "height": 820}, "locale": "en_US"}, "article": {"published_time": "2018-09-18T16:34:10+00:00", "modified_time": "2018-09-18T18:16:12+00:00"}, "twitter": {"text": {"title": "Emmy win, reported U.S. Open date help Lindsay Shookus cope with Ben Affleck split"}, "image": "https://www.mercurynews.com/wp-content/uploads/2018/09/Shookus1.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1537225200.0, "source": "https://www.mercurynews.com", "summary": ""}