{"url": "https://en.wikipedia.org/wiki/Survivor:_Game_Changers", "text": "No.\n\noverall No. in\n\nseason Title CBS recap Rating/share\n\n(18-49) Original air date US viewers\n\n(millions) Weekly\n\nrank\n\n500[2] 1 \"The Stakes Have Been Raised\" Recap 1.7/6[24] March 8, 2017 ( ) 7.64[24] 15[25]\n\nAs the game began, the 20 contestants were divided into two tribes, Mana and Nuku. Reward Challenge: The tribes were given a few minutes to grab supplies from a boat to bring back to their camps. The castaways were also given the chance to swim out to a nearby buoy and release a large toolkit; the first player to release the toolkit claimed it for their tribe. Ozzy won the kit for Nuku. During the scramble, Sierra found an envelope. At the Nuku camp, she learned that she had found a \"legacy advantage,\" which would give her immunity when either thirteen or six castaways remained; if she were voted out before then, she would privately will it to someone else following her elimination. Cirie worried that Ozzy, who she had betrayed on Survivor: Micronesia, would target her out of revenge, which he did. At Mana, Tony immediately declared that he was going to look for a hidden immunity idol, which caused his tribe to distrust him. Ciera discussed getting rid of Tony or Caleb, his closest ally, but only earned the ire of her tribemates for strategizing too much. Reward/Immunity Challenge: Seven tribemates rowed a raft through the water, where one of the rowers retrieved a key from a tower. After the rowers completed an obstacle course to return to shore, they dug to retrieve two bags of puzzle pieces. Another tribemate then used keys to unlock the third bag of pieces. The final two tribemates used the pieces to solve a ship's wheel puzzle; the first tribe to use their finished puzzle to raise a flag won immunity and flint. Blue Lagoon Bustle challenge from Blood vs. Water. Nuku won the challenge. At camp, Mana targeted Ciera for her strategizing but told her the target was Michaela. Michaela was angry after finding out she was the decoy target, which caused some of her tribemates to reconsider their plans, but at Tribal Council, the tribe stayed united and voted Ciera out unanimously. After Tribal Council, Tony and Sandra — the tribe's only winners — discussed how no one else would let a former winner win this season, and agreed to align, forming an alliance with Aubry, Caleb and Malcolm. However, Tony later overheard Sandra talking with Troyzan, and believed she was targeting him. At Nuku, Cirie tried to recruit allies against Ozzy. Reward/Immunity Challenge: Six tribemates swam out toward a cage to retrieve a 400-pound snake filled with puzzle pieces. Once the snake was brought back to shore, another tribemate used the pieces to solve a combination lock and unlock eight rings; the three non-swimming castaways then tossed rings onto a series of eight paddles. The first tribe to have rings on all paddles won immunity and a fishing kit. Phish Farm challenge from Caramoan and Cagayan. Nuku won the challenge. Back at camp, Tony and Sandra campaigned against the other — Tony argued that Sandra needed to go for her poor challenge performances and status as the only two-time winner, while Sandra argued that Tony's inability to remain calm made others paranoid. Ultimately, the tribe sided with Sandra and Tony was voted out.\n\n501 2 \"Survivor Jackpot\" Recap 1.7/7[26] March 15, 2017 ( ) 7.87[26] 11[27]\n\nThe day after Tony's elimination, the castaways were redistributed into three tribes: Brad, Caleb, Debbie, Hali, Sierra and Tai formed the Mana tribe; Aubry, Jeff, J.T., Malcolm, Michaela, and Sandra formed the Nuku tribe; and Andrea, Cirie, Ozzy, Sarah, Troyzan and Zeke formed the Tavua tribe, having to build a new shelter from scratch. All three new tribes were divided by original tribal lines, putting Hali and Caleb in the minority on Mana, J.T. on the outs of Nuku and Troyzan on the outs of Tavua. On Mana, Caleb reunited with Kaôh Rōng ally Tai, who tried to bring Caleb into his majority alliance. On Nuku, J.T. stranded his new tribemates out on the ocean while on a snorkeling trip in order to look for a hidden immunity idol, but failed to find it. At Tavua, Troyzan discovered a clue to his tribe's hidden immunity idol, which was planted at the next immunity challenge. Reward/Immunity Challenge: Three tribemates are tied together and must navigate through a rope obstacle course where they will fill a bucket with water and climb over a teeter-totter in order to fill it up enough to lower a gate. Another set of tribemates will untie puzzle pieces to solve a puzzle. The first two tribes to finish win immunity but the first tribe has a choice of comfort or spices for their food, with the item not chosen going to the second place tribe. Tower of Power challenge from San Juan del Sur. Nuku and Tavua won the challenge, and Troyzan retrieved the hidden immunity idol while his tribe celebrated. At Mana, Tai tried to convince his alliance to target Hali over Caleb, but Brad warned Tai that keeping Caleb in the game would only strengthen the perception of Caleb and Tai as a strong pair, making them larger targets come the merge. At Tribal Council, Tai decided to stay loyal to his alliance, and joined his tribemates in sending Caleb out of the game.\n\n502 3 \"The Tables Have Turned\" Recap 1.7/7[28] March 22, 2017 ( ) 8.10[28] 10[29]\n\nAfter eliminating Caleb, the Mana tribe's majority alliance confirmed their plans to vote out Hali next. Reward Challenge: Only two members from each tribe competed in this challenge. One tribe member must navigate over three balance beams while carrying a ball on the end on a stick that gets longer with each completed beam. The second tribe member uses the ball after untying knots on a table to retrieve a key, which unlocks a chest of sandbags to be used to knock down a series of bamboo targets. The first tribe to finish wins coffee, iced tea and chocolate cookies while the second place tribe wins a thermos of iced coffee. Ram-Ball On challenge from Blood vs. Water. J.T. and Malcolm won the challenge for Nuku, Brad and Tai placed second for Mana, while Ozzy and Troyzan lost for Tavua. At the Tavua camp, Ozzy continued to provide food for his tribe, while Troyzan was further outcast for losing the challenge. On Nuku, J.T. bonded with Malcolm, and tried convincing him to target Sandra next. Immunity Challenge: One tribe member is chosen to be a \"caller\" while the others are blindfolded. The caller will direct the tribemates to a rope, which they will pull to topple over a bucket full of color coated water and containing a bag of balls. After all three bags are found, they must navigate the three balls through a table maze controlled by pulleys. The first tribe to do this won immunity, sending the other two tribes to a joint Tribal Council to eliminate a single castaway as one group. Blind Leading the Blind challenge from One World. Tavua won the challenge. At Nuku, Sandra wanted to vote out Sierra for being Mana's strongest female competitor, while J.T. tried to target Tai for his perceived sneakiness. The Mana tribe debated between voting out either Sandra or Malcolm. The Mana tribe had one fewer member than Nuku, but Tai found his tribe's hidden immunity idol shortly before Tribal Council, promising his tribemates he would use it that night to counter their numerical disadvantage. At Tribal Council, both tribes attempted to realign with original tribemates Hali and J.T., who attempted to convince their former tribemates to target Brad and Sandra, respectively. J.T. quietly told Brad that Nuku's target was Sierra, in hopes that it would allow the Mana tribe to save her with their hidden immunity idol and eliminate Sandra. However, though Brad convinced Tai to play his idol on Sierra, negating the six votes against her, the Mana tribe targeted Malcolm instead, eliminating him from the game. As the tribes left Tribal Council, Michaela blamed J.T. for Malcolm's elimination.\n\n503 4 \"Dirty Deed\" Recap 1.8/7[30] March 29, 2017 ( ) 8.26[30] 15[31]\n\nAfter Malcolm's elimination, J.T. tried to defend his actions at Tribal Council; however, his tribemates continued to distrust him. This prompted J.T. to search for the hidden immunity idol, which he found. Reward Challenge: One tribe member would retrieve a bow and a disc respectively using a grappling hook, while another member would dig up two balls to be balanced on both the bow and disc. Two tribe members would then balance the balls across two balance beams of various difficulty to reach a table, with the final member solving a slide puzzle. The first two tribes to finish each win a plate of peanut butter and jelly sandwiches, but the first tribe to finish also wins milk and cookies. Tavua placed first while Nuku placed second, as Debbie's struggles on the balance beam caused Mana to lose the challenge. At Tavua, Sarah aligned with outsider Troyzan. At Mana, Debbie was furious over her poor performance in the challenge, and lashed out at Brad, labeling him the tribe's dictator. Tai later found a clue to the tribe's new hidden immunity idol. At Nuku, J.T. and Michaela squabbled over the latter's consumption of the sugar they had previously won. In order to keep the two fighting, Sandra ate the rest of the sugar, causing J.T. to accuse Michaela of the act. Immunity Challenge: The tribes raced over a wall, rolled a wooden cube to a post from which they unspooled a ring of keys. They then used the keys to unlock a chest filled with 100 sandbags; after transporting the bags across a balance beam, they used a slingshot to launch the bags at five targets. The first two tribes to knock down all five of their targets won immunity. Losing Face challenge from South Pacific and Millennials vs. Gen X. Mana placed first and Tavua placed second. At the Nuku camp, J.T. and Michaela targeted each other; Aubry sided with J.T., but Sandra teamed up with Michaela out of revenge for Malcolm's elimination. Both sides lobbied for Jeff's vote, but he ultimately chose to vote against J.T., who chose not to bring his hidden immunity idol to Tribal Council and was eliminated from the game. After J.T.'s elimination, Sandra confessed to eating the sugar.\n\n504 5 \"Vote Early, Vote Often\" Recap 1.7/7[32] April 5, 2017 ( ) 8.40[32] 14[33]\n\nAt Mana, Tai deciphered his idol clue and discovered the hidden immunity idol underneath the water well. Later that day, the castaways were redistributed into two tribes by random draw: Aubry, Brad, Cirie, Hali, Michaela, Sierra, and Troyzan formed the new Mana tribe; Andrea, Jeff, Ozzy, Sandra, Sarah, Tai, and Zeke formed the new Nuku tribe; and Debbie was exiled for drawing the empty parcel, to later join the tribe that lost the next immunity challenge following their Tribal Council. On Mana, lone men Brad and Troyzan bonded, and Brad pledged to bring Troyzan into his alliance with Sierra. On Nuku, Jeff and Sandra were outsiders for being the only original Mana members. Though Zeke had bonded with Jeff, Zeke led the original Nuku alliance into claiming that they were against Tai in order to avoid Jeff and Sandra from scrambling, allowing them to take the latter out. Living at a new camp, Tai instinctively decided to check for a hidden immunity idol underneath the well, which he then found. Debbie was exiled to a yacht, where she enjoyed a feast and was joined by Survivor: Caramoan winner John Cochran, who gave her game advice. At the conclusion of his visit, he gave Debbie a choice between three advantages: a kit to construct a fake hidden immunity idol, an extra vote at any Tribal Council of her choice, and an advantage for her tribe at her next immunity challenge. She chose the extra vote as her advantage. Immunity Challenge: Castaways navigated obstacles in the water, and then retrieved heavy puzzle pieces along the way. After transporting the pieces back to their mat, three tribe members used them to solve the puzzle. The first tribe to complete the puzzle won immunity. Mana won the challenge. Back at camp, Jeff was confident that Tai was going home, but Sandra was skeptical, and campaigned against Tai for his original season bond with Aubry and Debbie. She pitched herself to Andrea, Sarah, and Ozzy, arguing that they were strong competitors and could use Sandra’s protection. Though her tribemates agreed with her points, they still planned to eliminate her that night. However, Tai accidentally told Jeff that Sandra was the target, which made the others anxious. At Tribal Council, Sandra took advantage of Tai's paranoia, leading to Tai openly telling his tribemates to target Ozzy for being a physical threat, causing Zeke and Sarah to openly question Tai's loyalties. Jeff and Sandra retaliated by telling their tribemates to vote out Tai for being untrustworthy. However, when the votes were read, the original Nuku tribe stayed loyal and sent Sandra out of the game, voting her out for the first time after 94 days of cumulative play over three seasons. Debbie then joined the Nuku tribe.\n\n505 6 \"What Happened on Exile, Stays on Exile\" Recap 1.7/7[34] April 12, 2017 ( ) 8.31[34] 8[35]\n\nAt Nuku, Debbie joined her new tribe while Jeff planned on trying to convince everyone to get rid of Ozzy for being a physical threat come the merge. Reward Challenge: The tribes unspooled ribbons around a maypole to release a key to unlock planks. They then used the planks to assemble a ladder, and climbed up it to retrieve a bag of balls and navigate through an obstacle course. One tribe member then used a foot-operated catapult to launch the balls into a series of nets. The first tribe to get a ball in all five nets won pizza and soft drinks. Dulcimer Stomp challenge from Worlds Apart. Nuku won the challenge. Following their loss, the Mana tribe members tearfully discussed the emotional toll of the game — Brad discussed his newfound empathy towards the experiences of his wife Monica, who played the game in One World and Blood vs. Water, which later prompted Aubry and Cirie to approach Brad about aligning, putting Hali and Michaela on the outs of the tribe. At Nuku, Jeff began making his moves against Ozzy, recruiting both Sarah and Zeke. Zeke apologized for leaving Jeff out of the Sandra vote and promised to be honest with him moving forward, with plans of reaching the Final Tribal Council together. Immunity Challenge: Three tribe members were pulled across the water in a boat. One tribe member then dove down and retrieved buoys with letters on them from a net. After untying all of the buoys, three tribemates deciphered the buoys to spell out a single word; the first tribe to solve the puzzle won immunity. Sea Salvage challenge from Palau. Mana won the challenge after deciphering the word \"METAMORPHOSIS\". At Nuku, Jeff tried to convince Zeke again to get rid of Ozzy but Zeke was conflicted due to his strategy of keeping larger targets in the game as shields. Zeke's hesitance caused Jeff to believe that Zeke and Ozzy had a secret alliance, which he exposed to the other tribe members, causing them to question their loyalties. At Tribal Council, a desperate Jeff outed Zeke as a transgender man, and tried to insinuate that Zeke's hiding this aspect of his life showed an ability to be deceitful. However, everyone else—including host Jeff Probst—quickly and emphatically rebuked Jeff Varner for this tactic. After a long discussion, Varner apologized, and expressed shame and remorse for what he had done. Seeing that Varner's actions would clearly lead to his elimination, Probst took an open roll call from all of the players, then had Varner eliminated without a formal vote.\n\n506 7 \"There's a New Sheriff in Town\" Recap 1.7/7[36] April 19, 2017 ( ) 7.92[36] 11[37]\n\nThe day after Jeff Varner's elimination, host Jeff Probst announced that the tribes were merging; however, before the celebratory feast, the players were told that one player from Mana and Nuku had to sit out or else the tribe members would receive only crackers and iced tea. Brad volunteered for Mana and Tai volunteered for Nuku, and the tribes were merged. While their tribemates feasted, Brad and Tai reconnected and affirmed their alliance, with Brad targeting Hali and Michaela, outsiders from the third Mana tribe. Debbie later apologized to Brad for her earlier outburst against him, and they realigned. Though the rest of the tribe agreed to target Hali and Michaela, two smaller factions emerged within the majority: Brad and Sierra's alliance with Debbie, Tai and Troyzan, who wanted to eliminate Michaela; and Cirie's alliance with Andrea and Zeke, who wanted to eliminate Hali. Cirie began mentoring Michaela in order to reduce the latter's target, and the two discussed becoming the first pair of African-American women to reach the final Tribal Council. Immunity Challenge: Castaways stood on a wooden frame, balancing a block between their head and the top of the frame without the assistance of their hands. The last contestant with their block remaining won immunity. Keep on Your Toes challenge from Cagayan and Worlds Apart. Andrea won the challenge. Back at camp, Sierra believed that Hali had a hidden immunity idol, and conspired to split the votes between her and Michaela. However, Cirie and Zeke worked to change the target from Michaela to Hali in order to save Michaela. Ultimately, Cirie's plan won out and Hali was eliminated, becoming the first member of the jury. The next morning, Cirie and Michaela solidified their alliance, and Cirie tried to rally Aubry, Andrea, Michaela, Ozzy, Sarah, and Zeke together against Brad and Sierra. However, Zeke felt like he had become a subordinate to Andrea and Cirie, and considered betraying them for being strategic threats. Reward Challenge: Divided into two teams of six, two teammates swam out and retrieved a net with fish-shaped puzzle pieces. Two more teammates untied the pieces and put them on hooks attached to a beam, then brought the beam to the last two teammates, who used the pieces to solve a puzzle. The first tribe to solve their puzzle won a spa day and a hamburger lunch. New School challenge from Kaôh Rōng. Andrea, Debbie, Ozzy, Tai, Troyzan and Zeke won the challenge. While at the spa, Zeke began lobbying against Andrea and Cirie, but Debbie was skeptical. Immunity Challenge: Each castaway held onto a tall pole as long as possible without falling off. The last castaway remaining on their pole won immunity. Get a Grip challenge from Vanuatu, Cook Islands, Tocantins, Heroes vs. Villains, South Pacific, Blood vs. Water, and Worlds Apart. Tai outlasted Ozzy to win immunity. Back at camp, Zeke told Sierra that she was being targeted by Cirie's alliance and that he would work with her to eventually get a big threat in Andrea out. Sierra told Cirie that Zeke told her about their plans, which prompted Cirie to target Zeke. Cirie told Ozzy and Andrea about Zeke’s betrayal, which infuriated Andrea. However, Debbie decided to target Ozzy instead for his strength in challenges, and she rallied Brad, Sierra, Sarah, Tai, and Troyzan together. Sarah found herself caught between Debbie's and Cirie's factions; at Tribal Council, Sarah sided with Debbie, who used her extra vote to ensure Ozzy's elimination.\n\n507 8 \"A Line Drawn in Concrete\" Recap 1.8/7[38] April 26, 2017 ( ) 8.49[38] 9[39]\n\nAfter Ozzy's elimination, Debbie planned to stay strong with her alliance with Brad, Sarah, Sierra, Tai, and Troyzan. Andrea and Cirie confronted Zeke about his betrayal, but Sarah later talked to Zeke about working together. Reward Challenge: Divided into two teams of five, one castaway at a time raced through a series of obstacles in the water. After all five teammates were at the end platform, one teammate at a time used a grappling hook to retrieve rings in the water. The first team to retrieve all five of their rings won a trip to the Yasawa Islands to enjoy a picnic. O-Black Water challenge from Worlds Apart. Michaela was not chosen to compete. Andrea, Aubry, Brad, Debbie, and Sierra won the challenge after Cirie struggled on the balance beam; after the challenge, everyone encouraged Cirie to complete the balance beam, which she did. As the losing castaways were leaving the challenge, Sarah spotted an advantage by the sit-out bench that Michaela had failed to notice, and retrieved it without being spotted. Back at camp, she learned that the advantage gave her the ability to steal another player's vote at any Tribal Council until the final five, prohibiting them from voting while allowing her to vote twice. On the reward, Andrea campaigned against Zeke, while at camp, Cirie encouraged Sarah to flip on the majority alliance. Immunity Challenge: The castaways held a rope attached to an unbalanced table to keep the table level, while maneuvering between two platforms retrieving and stacking blocks with letters on them; if their stack dropped, they had to restart. The first castaway to stack all eight blocks in correct order, spelling \"IMMUNITY\", won the challenge. A Bit Tipsy challenge from Kaôh Rōng. Troyzan won individual immunity. Back at camp, the majority alliance decided to target Andrea for being the biggest strategic and physical threat. However, Sarah felt excluded from the decision, and conspired with Zeke to overthrow the majority, though she later reconsidered after Sierra proposed a final three deal with Sarah and Debbie. Debbie instructed Aubry to vote against Michaela, and told Aubry that Sarah didn't trust her in order to gain Aubry's trust. However, Aubry told the others, including Sarah, about Debbie's comments and decided to target her since she thought she was running the game. This made Sarah consider flipping on the six and voting Debbie out for her volatility. Andrea attempted to regain trust with Sarah and Zeke, figuring she was probably the majority alliance’s target. At Tribal Council, Sarah decided to flip on the majority alliance, joining the others in sending Debbie to the jury.\n\n508 9 \"Reinventing How This Game Is Played\" Recap 1.8/8[40] May 3, 2017 ( ) 8.26[40] 12[41]\n\nAfter Debbie's elimination, Sarah admitted to flipping on Brad and Sierra's alliance, while the new majority alliance made Sierra their next target. Reward Challenge: The players were divided into two teams of five; three teammates, one at a time, raced through a series of obstacles to a chair, where five other tribemates used a pulley system to lift them across a vertical structure to retrieve ten puzzle pieces. Once all thirty pieces were retrieved, three teammates used them to solve a word puzzle. The first tribe to do so won an overnight trip to Tokoriki Island Resort. Angry Chair challenge from Millennials vs. Gen X. Andrea, Aubry, Brad, Sarah and Zeke won the challenge. On the reward, Brad and Zeke bonded, which made the others suspicious, especially an already-wary Andrea. Back at camp, Andrea and Cirie discussed betraying Zeke, though Sarah disagreed; to secure Cirie's trust, Sarah told Cirie about her vote-stealing advantage. Zeke later made a long-term alliance with Brad and Troyzan. Immunity Challenge: The castaways placed blocks in a line while avoiding ropes that would topple the tiles that were already placed. Once all of the blocks were properly stacked, the castaway would start a domino effect that would drop the last tile on a platform at the other end. The first castaway to do so won immunity. Domino Effect challenge from Gabon, Redemption Island, Blood vs. Water, and Kaôh Rōng. Andrea won immunity; safe from Tribal Council, Andrea plotted to eliminate Zeke that night, though Michaela and Sarah were skeptical of giving the other alliance a chance to regain the majority. At Tribal Council, the minority alliance voted against each other to avoid elimination, but the majority alliance betrayed Zeke, sending him to the jury.\n\n509 10 \"It Is Not a High Without a Low\" Recap 1.7/7[42] May 10, 2017 ( ) 8.30[42] 11[43]\n\nReturning from Tribal Council, Tai — having been voted against by his allies Brad, Sierra and Troyzan — was recruited into the majority alliance by Cirie; the alliance decided to break up the pair of Brad and Sierra at the next Tribal Council. The following morning, Sierra told Sarah about her legacy advantage in an attempt to gain her trust. Before the reward challenge, the castaways were joined by their loved ones: Sarah's husband, Wyatt; Andrea's mother, Linda; Aubry's sister, Kerry; Sierra's father, Dan; Michaela's mother, Candy; Troyzan's brother, Todd; Tai's boyfriend, Mark; Brad's wife, One World and Blood vs. Water castaway Monica; and Cirie's son, Jared. Reward Challenge: Divided into teams of three who are tethered together, each team would race through several obstacles to a table and remove a bundle of ropes to get a key to open a set of bean bags to knock off a series of targets. The first team to knock off all the targets would win. The winners would go with the loved ones to a barbecue. The team of Andrea, Aubry, and Brad won the challenge and chose Cirie and her son and Sarah and her husband to accompany them on the barbecue. Back at camp, Michaela expressed disappointment at not being able to enjoy the reward with her alliance and spent the time connecting with Tai. The two later formed a pact with Sierra and Troyzan to align with Brad and target Andrea. Immunity Challenge: The castaways must balance on a small perch while holding a buoy with two handles. The last person left standing would win immunity. Brad won immunity. The majority alliance decided to target Sierra, while the minority planned to vote against Andrea; both sides tried to convince Michaela and Tai to vote with them. In order to convince Michaela and Tai to vote against Sierra, Sarah told them about Sierra's legacy advantage. At Tribal Council, despite Sierra openly calling Andrea a big threat, Tai and Michaela voted with the majority alliance to send Sierra to the jury. While Sierra was leaving, Sarah feigned surprise in order to convince Sierra that she hadn't voted against her; Sarah's ruse worked, and Sierra privately willed her the legacy advantage.\n\n510 11 \"Parting Is Such Sweet Sorrow\" Recap 1.7/7[44] May 17, 2017 ( ) 8.27[44] 8[45]\n\nAfter Tribal Council, Andrea and Cirie were suspicious of Sarah's reaction after Sierra's elimination. The next morning, Sarah found the legacy advantage that Sierra had left her. Immunity challenge: The castaways used one hand to hold on to a rope to steady a balancing board. With the other hand, they built a house of cards with wooden tiles on the other end of the board. The first castaway to build a structure tall enough to reach the finish mark won immunity. House of Cards challenge from South Pacific and Caramoan. Aubry won the challenge in six minutes. Back at camp, she tried to rally her allies against Brad, but Andrea tried convincing Aubry to go against Sarah instead. Cirie, wanting to keep Sarah in the game as a bigger target than herself, talked to Sarah about betraying Andrea that night. At Tribal Council, Andrea and Aubry voted against Brad, but Cirie, Michaela and Sarah voted with the minority alliance of Brad, Tai and Troyzan to send Andrea to the jury. An emotional Aubry, left out of the plan to eliminate Andrea, was consoled by Tai, but Cirie noted that Tai's ability to emotionally connect with others could be threatening. Immunity challenge: The castaways stood on a pole in the water and lowered a bucket to get water to fill a bamboo chute, which raised a key. After retrieving the key, the castaways swam back to shore and unlocked puzzle pieces. The first castaway to solve the puzzle won immunity. Vertigo challenge from Cagayan. Brad won the challenge. Back at camp, Tai told Aubry he wanted to target Sarah, but Aubry relayed Tai's plan to Cirie, who later told Sarah. Sarah, skeptical about Tai's betrayal, gave Cirie her vote stealer as a sign of trust, which Cirie promised to return to Sarah after that night's Tribal Council. However, Cirie considered using it to save Sarah and eliminate Tai. At Tribal Council, Cirie tried to use the vote stealer to steal Sarah's vote with the intention of voting against Tai twice, but Sarah revealed that the advantage was non-transferable; following some final strategic discussions, Sarah used her advantage to steal Tai's vote instead, and teamed up with Brad and Troyzan to eliminate Cirie's closest ally, Michaela.\n\n511 12 \"No Good Deed Goes Unpunished\" Recap 1.9/8[46] May 24, 2017 ( ) 8.48[46] 6[47]\n\nAfter the chaotic Tribal Council, Tai felt as if he had lost all his allies; in an attempt to regroup, he told Brad about his two hidden immunity idols. Brad still felt betrayed after Tai eliminated Brad's closest ally, Sierra, and tried to strongarm Tai into giving him one of his hidden immunity idols, with the intention of eliminating Tai with five players remaining. Reward/immunity challenge: The castaways navigated a giant maze to retrieve three bags of puzzle pieces; they then used the pieces to solve a puzzle. The first castaway to do so won immunity and a feast. Roundabout challenge from Cagayan. Brad won the challenge and chose to share his reward with Troyzan and Sarah. During their feast, they conspired to split the votes between Aubry and Tai in case of Tai's hidden immunity idols. Tai, put off by Brad's attitude, told Aubry about his idols and promised to play one on her that night to ensure her loyalty; the two teamed up with Cirie to counter the alliance on the reward. At Tribal Council, Aubry, Cirie, and Tai voted against Sarah while Brad, Sarah and Troyzan split their votes against Aubry and Tai. Tai played his idols on himself and Aubry, while Sarah played her immunity-granting legacy advantage, which prompted Troyzan to play his hidden immunity idol. As Cirie was the only player left without immunity, she was automatically eliminated despite receiving no votes against her. Immunity challenge: Each castaway used paddles to maneuver a ball across a series of obstacles on a table course. The first castaway that transferred three balls to the other side of the table won immunity. Spoon Man challenge from San Juan del Sur. Brad won the challenge. Brad and Troyzan decided to target Aubry for being more threatening than Tai at the final Tribal Council, while Aubry targeted Troyzan as Brad's closest ally. At Tribal Council, Sarah and Tai decided to vote against Aubry, sending her to the jury. Final immunity challenge: The castaways raced through a giant tower to retrieve a series of keys that unlocked puzzle pieces. The first castaway to solve the puzzle won immunity. Final Four-Titude challenge from Worlds Apart. Brad won the challenge to earn his fifth and final individual immunity. Out of revenge against Tai's betrayal, Brad and Troyzan planned to vote against him, while Tai tried to convince Sarah to force a tie against Troyzan, believing that either of them could beat him in the resulting fire-making tiebreaker challenge. At Tribal Council, Sarah sided with Brad and Troyzan, and Tai became the tenth and final member of the jury. The next night, the finalists and jurors convened for the final Tribal Council. Unlike previous seasons, in which jurors addressed the finalists individually with a prepared statement or question, host Jeff Probst led a moderated discussion divided into the game's three major components: \"Outwit\", \"Outplay\" and \"Outlast\". During the discussion, Sarah was commended for her strategic and social control but condemned for her focus on deception and manipulation; Brad was applauded for his immunity wins throughout the game but criticized for his arrogance, weaker social efforts, and being in the minority for most of the post-merge game; Troyzan was viewed as largely following Brad's lead, and his game was mostly ignored by the jury.\n\n512 13 \"Reunion\" N/A 1.3/5[46] May 24, 2017 ( ) 5.84[46] 15[47]", "images": ["https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/e/ec/Survivor_game_changers_season_thirty-four_dvd_region_1.png/220px-Survivor_game_changers_season_thirty-four_dvd_region_1.png", "https://upload.wikimedia.org/wikipedia/en/e/ec/Survivor_game_changers_season_thirty-four_dvd_region_1.png", "https://upload.wikimedia.org/wikipedia/en/thumb/f/fb/Yes_check.svg/13px-Yes_check.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Ozzy_Lusth_Qatar_crop.jpg/200px-Ozzy_Lusth_Qatar_crop.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/Cirie_Fields_Qatar.jpg/200px-Cirie_Fields_Qatar.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/e/ec/Survivor_game_changers_season_thirty-four_dvd_region_1.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Survivor:_Game_Changers", "title": "Survivor: Game Changers", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/e/ec/Survivor_game_changers_season_thirty-four_dvd_region_1.png", "width": 640, "height": 910}, "title": "Survivor: Game Changers - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}