{"url": "https://variety.com/2018/tv/news/ryan-murphy-american-crime-story-katrina-american-horror-story-season-8-1202655273/", "text": "With a lineup of seven or eight series currently in development or production, uber-producer Ryan Murphy has more than a full plate. But going forward, he said, he’s going to take his time making sure they’re all in ideal shape. “I’m not going to shoot anything until it’s written, and it’s perfectly cast, and I get great number twos in terms of showrunners and directors,” he told reporters at the Television Critics Assn. press tour in Pasadena.\n\nIn the era of Peak TV and streaming, he said it’s tempting to rush projects through, and Murphy — who has been on hand to present three series (“Pose,” “9-1-1” and “American Crime Story: Versace”) admitted that he wasn’t happy with the first iteration of “American Crime Story: Katrina,” which is slated as the next installment in that limited series franchise. “I still had a passion for the story, but it wasn’t the right story,” he said. “I do think there’s such a need and expectation to be constantly feeding the machine.”\n\nThe new version — which is set to star frequent Murphy collaborator Sarah Paulson and go into production in the fall — will be based on the book “Five Days at Memorial,” in partnership with producer Scott Rudin. “It’s really a look at the healthcare industry and disasters in global warming,” he said.”We decided to do a more intimate version of that story, which is much more interesting and topical.”\n\nAdded Murphy of the Katrina story, “Spike Lee did it better.”\n\nAsked what makes for a compelling season of “American Crime Story,” he said, “It has to be about something that’s a bigger social issue,” he said. “I would never do Jon Benet Ramsay. I would never do the Menendez brothers because … I don’t know that they were about any meta social themes. I think ‘American Crime Story’ has to be about a bigger picture.”\n\nMurphy said he was passionate about the upcoming “Versace” because “it was about homophobia in the ’90s,” he said, pointing to episodes that deal with coming out to parents and being gay in the military. “Those are incredible social stories,” he said. “That’s why we’re very slow to do them. And very quick to say this isn’t working, we’re going to try a different take.”\n\nAs for the next season of “Feud,” which will center around the fractured marriage of Charles and Diana, Murphy said he’s pleased with the scripts and is looking ahead to casting. “We keep moving the date because I’m working on so many great things,” he said. The project was set to shoot in May, but has now been bumped to the fall. He’s not concerned about comparisons to “The Crown” (which he admits he’s been binge-watching): “Our take is a much different take,” he said. “It’s not about the monarchy, it’s about the marriage.” That project, too, has yet to be cast; he’s also deciding whether he’s going to direct.\n\nThe Monica Lewinsky project is a “very tricky one,” he said. “We’re interviewing writers,” he said. “We’re not in any rush to do anything unless it’s done right.” Murphy said he’s trying to set up a dinner with Lewinsky: “I think it’s very important that her point of view is present,” he said. “I want to make sure that we do it right, and I think particularly now in this era we have an obligation to do a lot of research.” No actress is lined up for that role (he said he wants to get input from Lewinsky), but he does want Paulson to play Linda Tripp.\n\nPaulson is also set to star in “Ratched” for Netflix. Murphy has arced out four seasons, with Paulson’s Nurse Ratched’s origin story as she faces off a different male adversary each season, with the final installment being her opposite the character played by Jack Nicholson in the film (a role yet to be cast). “It’s also a feminist tale,” he said. “It really looks at the birth of a lot of things that were happening in our healthcare system.” There’s no start date for “Ratched,” either — Murphy says he’s waiting until all eight scripts are written. “Sometimes it’s a little frustrating from a programming point of view,” he admits, but says Landgraf has been patient.\n\nThe next season of “American Horror Story” will be set in the “near-distant future,” he told reporters. “It’s a projection,” he said.\n\nMurphy also addressed the Fox/Disney deal given the looming expiration of his overall deal. “I don’t know what’s going to happen beyond ‘Pose,’ which is up in June and my contract is up in June,” he said, adding that he’s waiting to see what happens with Dana Walden and John Landgraf. He said he doesn’t know if he will go independent, and that he’s starting to have a lot of meetings. “I feel open, I feel excited, I feel like I have a lot more stories to tell,” he said. “I’m as excited and nervous as they are.”\n\n“It’s almost as if the universe did say, ‘Shut the f–k up and sit down for a beat,'” he said.", "images": ["https://variety.com/wp-content/themes/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://variety.com/wp-content/uploads/2017/01/ryan-murphy-fx-tca.jpg?w=681&h=383&crop=1", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif", "https://variety.com/wp-content/uploads/2017/01/ryan-murphy-fx-tca.jpg?w=1000"], "top_img": "https://variety.com/wp-content/uploads/2017/01/ryan-murphy-fx-tca.jpg?w=1000", "keywords": [], "authors": ["Debra Birnbaum"], "canonical_link": "https://variety.com/2018/tv/news/ryan-murphy-american-crime-story-katrina-american-horror-story-season-8-1202655273/", "title": "Ryan Murphy on ‘Katrina,’ ‘Feud’ and ‘American Horror Story’ Season 8", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://variety.com/wp-content/themes/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Uber producer Ryan Murphy revealed details about the next iterations of \"American Crime Story,\" \"Feud,\" and \"American Horror Story.\"", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199, "pages": 12616252196}, "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202655273, "author": "Debra Birnbaum", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-01-05T17:45:37"}, "pmc-tag": "American Horror Story,Feud,Ryan Murphy,TCA", "title": "Ryan Murphy on ‘Katrina,’ ‘Feud’ and ‘American Horror Story’ Season 8", "pageclass": "article", "pmc-vertical": "tv", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-primary-category": "News", "pmc-primary-vertical": "tv", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress 6.0.2", "author": "Debra Birnbaum", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Variety", "application-name": "Variety", "ia": {"markup_url_dev": "https://variety.com/2018/tv/news/ryan-murphy-american-crime-story-katrina-american-horror-story-season-8-1202655273/?ia_markup=1"}, "content_type": "Article", "post_id": 1202655273, "title": "Ryan Murphy on 'Katrina,' 'Feud' and 'American Horror Story' Season 8", "published_at": "2018-01-05 17:45:37", "image": "https://variety.com/wp-content/uploads/2017/01/ryan-murphy-fx-tca.jpg?w=1000", "comment_count": 1, "tags": "TCA", "topics": "News", "appeared_in_print": "No", "body": "With a lineup of seven or eight series currently in development or production, uber-producer Ryan Murphy has more than a full plate. But going forward, he said, he's going to take his time making sure they're all in ideal shape. \"I'm not going to shoot anything until it's written, and it's perfectly cast, and I get great number twos in terms of showrunners and directors,\" he told reporters at the Television Critics Assn. press tour in Pasadena.\r\n\r\nIn the era of Peak TV and streaming, he said it's tempting to rush projects through, and Murphy — who has been on hand to present three series (\"Pose,\" \"9-1-1\" and \"American Crime Story: Versace\") admitted that he wasn't happy with the first iteration of \"American Crime Story: Katrina,\" which is slated as the next installment in that limited series franchise. \"I still had a passion for the story, but it wasn't the right story,\" he said. \"I do think there's such a need and expectation to be constantly feeding the machine.\"\r\n\r\nThe new version — which is set to star frequent Murphy collaborator Sarah Paulson and go into production in the fall — will be based on the book \"Five Days at Memorial,\" in partnership with producer Scott Rudin. \"It's really a look at the healthcare industry and disasters in global warming,\" he said.\"We decided to do a more intimate version of that story, which is much more interesting and topical.\"\r\n\r\nAdded Murphy of the Katrina story, \"Spike Lee did it better.\"\r\n\r\nAsked what makes for a compelling season of \"American Crime Story,\" he said, \"It has to be about something that's a bigger social issue,\" he said. \"I would never do Jon Benet Ramsay. I would never do the Menendez brothers because ... I don't know that they were about any meta social themes. I think 'American Crime Story' has to be about a bigger picture.\"\r\n\r\nMurphy said he was passionate about the upcoming \"Versace\" because \"it was about homophobia in the '90s,\" he said, pointing to episodes that deal with coming out to parents and being gay in the military. \"Those are incredible social stories,\" he said. \"That's why we're very slow to do them. And very quick to say this isn't working, we're going to try a different take.\"\r\n\r\nAs for the next season of \"Feud,\" which will center around the fractured marriage of Charles and Diana, Murphy said he's pleased with the scripts and is looking ahead to casting. \"We keep moving the date because I'm working on so many great things,\" he said. The project was set to shoot in May, but has now been bumped to the fall. He's not concerned about comparisons to \"The Crown\" (which he admits he's been binge-watching): \"Our take is a much different take,\" he said. \"It's not about the monarchy, it's about the marriage.\" That project, too, has yet to be cast; he's also deciding whether he's going to direct.\r\n\r\nThe Monica Lewinsky project is a \"very tricky one,\" he said. \"We're interviewing writers,\" he said. \"We're not in any rush to do anything unless it's done right.\" Murphy said he's trying to set up a dinner with Lewinsky: \"I think it's very important that her point of view is present,\" he said. \"I want to make sure that we do it right, and I think particularly now in this era we have an obligation to do a lot of research.\" No actress is lined up for that role (he said he wants to get input from Lewinsky), but he does want Paulson to play Linda Tripp.\r\n\r\nPaulson is also set to star in \"Ratched\" for Netflix. Murphy has arced out four seasons, with Paulson's Nurse Ratched's origin story as she faces off a different male adversary each season, with the final installment being her opposite the character played by Jack Nicholson in the film (a role yet to be cast). \"It's also a feminist tale,\" he said. \"It really looks at the birth of a lot of things that were happening in our healthcare system.\" There's no start date for \"Ratched,\" either — Murphy says he's waiting until all eight scripts are written. \"Sometimes it's a little frustrating from a programming point of view,\" he admits, but says Landgraf has been patient.\r\n\r\nThe next season of \"American Horror Story\" will be set in the \"near-distant future,\" he told reporters. \"It's a projection,\" he said.\r\n\r\nMurphy also addressed the Fox/Disney deal given the looming expiration of his overall deal. \"I don't know what's going to happen beyond 'Pose,' which is up in June and my contract is up in June,\" he said, adding that he's waiting to see what happens with Dana Walden and John Landgraf. He said he doesn't know if he will go independent, and that he's starting to have a lot of meetings. \"I feel open, I feel excited, I feel like I have a lot more stories to tell,\" he said. \"I'm as excited and nervous as they are.\"\r\n\r\n\"It's almost as if the universe did say, 'Shut the f--k up and sit down for a beat,'\" he said.", "fragment": "!", "og": {"type": "article", "title": "Ryan Murphy on ‘Katrina,’ ‘Feud’ and ‘American Horror Story’ Season 8", "url": "https://variety.com/2018/tv/news/ryan-murphy-american-crime-story-katrina-american-horror-story-season-8-1202655273/", "description": "With a lineup of seven or eight series currently in development or production, uber-producer Ryan Murphy has more than a full plate. But going forward, he said, he’s going to take his time ma…", "site_name": "Variety", "image": {"identifier": "https://variety.com/wp-content/uploads/2017/01/ryan-murphy-fx-tca.jpg?w=1000", "width": 1000, "height": 563, "alt": "Ryan Murphy FX TCA"}, "locale": "en_US"}, "article": {"published_time": "2018-01-06T01:45:37+00:00", "modified_time": "2018-01-06T17:13:29+00:00"}, "twitter": {"site": "@variety", "creator": "@debrabirnbaum", "card": "summary_large_image", "title": "Ryan Murphy on ‘Katrina,’ ‘Feud’ and ‘American Horror Story’ Season 8", "description": "Uber producer Ryan Murphy revealed details about the next iterations of \"American Crime Story,\" \"Feud,\" and \"American Horror Story.\"", "image": "https://variety.com/wp-content/uploads/2017/01/ryan-murphy-fx-tca.jpg?w=1000"}}, "movies": [], "publish_date": 1515203137.0, "source": "https://variety.com", "summary": ""}