{"url": "https://www.irishtimes.com/culture/film/harry-potter-actor-robert-hardy-dies-aged-91-1.3176134", "text": "Actor Robert Hardy speaks outside the Churchill War Rooms Museum at a Battle of Britain anniversary celebration on August 20th, 2010 in London. Photograph: Dan Kitwood/Getty Images\n\nThe family of Robert Hardy has paid tribute to the \"gruff, elegant, twinkly, and always dignified\" actor, who has died at the age of 91.\n\nHardy was best known for his role in the Harry Potter films as the Minister for Magic Cornelius Fudge, and as Siegfried Farnon in BBC series All Creatures Great and Small.\n\nHardy’s children Emma, Justine and Paul said in a statement: “It is with great sadness that the family of Robert Hardy CBE today announced his death, following a tremendous life: a giant career in theatre, television and film spanning more than 70 years.\n\n\"From the early start, post WWII, with the Shakespeare Memorial Company in Stratford, to his later role in the Harry Potter films as Cornelius Fudge, the Minister for Magic — he will perhaps be most remembered for two iconic roles: as Siegfried Farnon in the long-running and much loved BBC series All Creatures Great and Small, and in his many and magnificently distinguished portrayals of Winston Churchill. \"\n\nREAD MORE\n\nThey said that they will remember their father “as a meticulous linguist, a fine artist, a lover of music and a champion of literature, as well a highly respected historian, and a leading specialist on the longbow.\n\n“He was an essential part of the team that raised the great Tudor warship The Mary Rose.\n\n‘Always dignified’\n\n“Gruff, elegant, twinkly, and always dignified, he is celebrated by all who knew him and loved him, and everyone who enjoyed his work.”\n\nHardy’s children said they are “immensely grateful” to the team at the Denville Hall retirement home for their “tender care” during in the weeks before his death.\n\nA familiar face in households across the country, Hardy’s other roles included Tite Barnacle in Little Dorrit (2008) and Arthur Brooke in Middlemarch (1994).\n\nHe also took on the leading role in Churchill: 100 Days That Saved Britain (2015) and in Winston Churchill: The Wilderness Years (1981).\n\nOne of his earliest TV jobs, in 1955, saw him take on Shakespeare as he portrayed Cassio in Othello.\n\nThe Bafta-nominated star, from Cheltenham in Gloucestershire, was also awarded a CBE for his services to acting.\n\nHarry Potter actor Chris Rankin, who played Percy Weasley in the films, wrote on Twitter that he was “terribly sad” to hear the news of Hardy’s death.\n\nHe said: “He was a very kind man who told wonderful stories.”\n\nLondon’s Westminster Abbey shared a tribute on Twitter, remembering his reading from Henry V at the venue’s service marking the 600th anniversary of the Battle of Agincourt in 2015.\n\nThe British Film Institute posted: \"We're sad to hear Robert Hardy, best known for roles in the Harry Potter films & TV series All Creatures Great And Small, has died aged 91.\"\n\nMagdalen College, Hardy’s alma mater, said: “Sad news breaking that Magdalen alumnus Robert Hardy (1944) has died at the age of 91.”\n\nThe Mary Rose Museum in Portsmouth said: “This is very sad news. Robert Hardy was one of our strongest supporters, and we’re very appreciative of all the work he has done for us. RIP.”", "images": ["https://www.irishtimes.com/resizer/axjugbcCMbMSDh6xjBp233dSTgw=/600x338/filters:format(png):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/SJQTLMCMMRC2PLALXUKEWWS6HU.png", "https://cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/BJJKNJJHDJDGDDODHEER7FDH44.png", "https://www.irishtimes.com/resizer/EqNW9zbLoowi0FVCvzle1PdS_aI=/1600x0/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/LZLKFEBIIUG5EOXM2ZDQ5QTYWQ.jpg", "https://cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/T2XGUGDSUZCOZAYIQEKG2TWML4.png", "https://www.irishtimes.com/resizer/y6E-Qwai4PspH03pS9HhDyDnk-8=/1200x630/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/LZLKFEBIIUG5EOXM2ZDQ5QTYWQ.jpg", "https://static.themebuilder.aws.arc.pub/irishtimes/1647534191733.svg", "https://sb.scorecardresearch.com/p?c1=2&c2=8946263&cv=2.0&cj=1"], "top_img": "https://www.irishtimes.com/resizer/y6E-Qwai4PspH03pS9HhDyDnk-8=/1200x630/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/LZLKFEBIIUG5EOXM2ZDQ5QTYWQ.jpg", "keywords": [], "authors": ["Thu Aug"], "canonical_link": "https://www.irishtimes.com/culture/film/harry-potter-actor-robert-hardy-dies-aged-91-1.3176134", "title": "Harry Potter actor Robert Hardy dies aged 91", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "Star also played Siegfried Farnon in BBC series All Creatures Great and Small", "twitter": {"description": "Star also played Siegfried Farnon in BBC series All Creatures Great and Small", "title": "Harry Potter actor Robert Hardy dies aged 91", "image": "https://www.irishtimes.com/resizer/y6E-Qwai4PspH03pS9HhDyDnk-8=/1200x630/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/LZLKFEBIIUG5EOXM2ZDQ5QTYWQ.jpg", "site": "@IrishTimes", "card": "summary_large_image"}, "og": {"description": "Star also played Siegfried Farnon in BBC series All Creatures Great and Small", "title": "Harry Potter actor Robert Hardy dies aged 91", "image": "https://www.irishtimes.com/resizer/y6E-Qwai4PspH03pS9HhDyDnk-8=/1200x630/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/irishtimes/LZLKFEBIIUG5EOXM2ZDQ5QTYWQ.jpg", "type": "article", "site_name": "The Irish Times", "url": "https://www.irishtimes.com/culture/film/harry-potter-actor-robert-hardy-dies-aged-91-1.3176134"}, "keywords": "harry-potter,robert-hardy,siegfried-farnon,winston-churchill,british-film-institute", "robots": "noarchive"}, "movies": [], "publish_date": null, "source": "https://www.irishtimes.com", "summary": ""}