{"url": "https://sportzbonanza.com/tiger-woods-speaks-out-after-his-dui-toxicology-report-is-made-public/", "text": "At the time of DUI arrest on May 29, Tiger Woods had five drugs in his body. The toxicology report was released by the Palm Beach County Sheriff’s Office on Monday and it showed that Woods tested positive for Alprazolam, Hydrocodone, Hydromorphone, THC and Zolpidem. Back in May, Woods shared, “I want the public to know that alcohol was not involved. What happened was an unexpected reaction to prescribed medications. I didn’t realize the mix of medications had affected me so strongly.” He didn’t mention marijuana was involved.\n\nWoods announced he’d undergo treatment back in June. Last week, he got a plea deal to start a DUI diversion program. The agreement includes 12 months of probation and completed DUI education classes. On Monday morning, after the toxicology results were released, Woods issued a statement for E! News saying: “As I previously said, I received professional help to manage my medications. Recently, I had been trying on my own to treat my back pain and a sleep disorder, including insomnia, but I realize now it was a mistake to do this without medical assistance. I am continuing to work with my doctors, and they feel I’ve made significant progress. I remain grateful for the amazing support that I continue to receive and for the family and friends that are assisting me.”\n\nHe mentioned he is recovering from his back injury: “I recently spoke to my surgeon and he’s very pleased with how my fusion is healing. I’m right on schedule. I’m now doing some light lifting, riding a stationary bike and putting a little.”", "images": ["https://sportzbonanza.com/wp-content/uploads/2022/01/LOGO_mobile.png", "https://secure.gravatar.com/avatar/43b3d4cb6d59af9a1fc886180e2342cc?s=96&d=mm&r=g", "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAANoAAACWAQMAAACCSQSPAAAAA1BMVEWurq51dlI4AAAAAXRSTlMmkutdmwAAABpJREFUWMPtwQENAAAAwiD7p7bHBwwAAAAg7RD+AAGXD7BoAAAAAElFTkSuQmCC", "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAUQAAADrAQMAAAArGX0KAAAAA1BMVEWurq51dlI4AAAAAXRSTlMmkutdmwAAACBJREFUaN7twTEBAAAAwiD7pzbEXmAAAAAAAAAAAACQHSaOAAGSp1GBAAAAAElFTkSuQmCC", "https://sportzbonanza.com/wp-content/uploads/2017/08/shutterstock_5737127ao.jpg", "https://sportzbonanza.com/wp-content/uploads/2022/01/LOGO.png"], "top_img": "https://sportzbonanza.com/wp-content/uploads/2017/08/shutterstock_5737127ao.jpg", "keywords": [], "authors": ["Jovana P", "Jovana Has Been Writing Web Content Since Based In Serbia", "She Has Been A Part Of The Writing Team In Shinez For Over Two Years."], "canonical_link": "https://sportzbonanza.com/tiger-woods-speaks-out-after-his-dui-toxicology-report-is-made-public/", "title": "Tiger Woods Speaks Out After His DUI Toxicology Report Is Made Public", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "title": "Tiger Woods Speaks Out After His DUI Toxicology Report Is Made Public - SportzBonanza", "description": "At the time of DUI arrest on May 29, Tiger Woods had five drugs in his body. The toxicology report was released by the Palm Beach County Sheriff’s Office on Monday and it showed that Woods tested positive for Alprazolam, Hydrocodone, Hydromorphone, THC and Zolpidem. Back in May, Woods shared, “I want the public to […]", "site_name": "SportzBonanza", "image": {"identifier": "https://sportzbonanza.com/wp-content/uploads/2017/08/shutterstock_5737127ao.jpg", "width": 3216, "height": 2141, "type": "image/jpeg"}, "url": "https://sportzbonanza.com/tiger-woods-speaks-out-after-his-dui-toxicology-report-is-made-public/", "type": "article"}, "article": {"published_time": "2017-08-15T07:18:23+00:00", "modified_time": "2017-08-20T17:22:13+00:00"}, "author": "Jovana P", "twitter": {"card": "summary_large_image", "label1": "Written by", "data1": "Jovana P", "label2": "Est. reading time", "data2": "1 minute"}, "theme-color": "#0042ff"}, "movies": [], "publish_date": 1502781503.0, "source": "https://sportzbonanza.com", "summary": ""}