{"url": "https://www.cbsnews.com/news/the-love-story-behind-the-basically-true-the-big-sick/", "text": "Next month, comedian Kumail Nanjiani and his wife, Emily Gordon, may be in the Oscar spotlight, provided one of the winning envelopes holds the name of their movie, \"The Big Sick.\" Lesley Stahl of \"60 Minutes\" has a story of art imitating life:\n\n\"Welcome to our home,\" said Emily Gordon. \"We should warn you: We're getting a little bit of work done. It's a little messy.\" Hence, the cardboard.\n\nGordon and her husband, comedian and actor Kumail Nanjiani, have had their lives turned upside-down.\n\n\"All new furniture, new kitchen stuff,\" said Gordon.\n\n\"Are you learning something?\" asked Stahl.\n\n\"Yes. We're getting all new furniture, new kitchen stuff,\" laughed Nanjiani.\n\n\"He's just repeating what I'm saying,\" Gordon added.\n\nEmily V. Gordon and Kumail Nanjiani with correspondent Lesley Stahl. CBS News\n\nThe upheaval forced them into an Airbnb in Los Angeles, where, watching television, they first learned that they had won an Oscar nomination for writing \"The Big Sick\" about their love affair.\n\n\"And then he said our names and we screamed and cried,\" Nanjiani said. \"We were like, 'Oh, my gosh. You're nominated for an Oscar!'\"\n\n\"So are you!\" Gordon said.\n\nThey'd never written a movie before, but decided to try and tell the basically true story together.\n\n\"It's sort of your typical boy-meets-girl, boy-keeps-girl-secret-from-family-because-he's-supposed-to-get-arranged-married, and then she-gets-really-sick-and-has-to-be-put-into-a-coma story! You know, that one.\"\n\nThe movie begins as their real romance began: Kumail was doing stand-up in a Chicago comedy club, and Emily (played in the film by Zoe Kazan) heckled him.\n\n\"Your meeting -- as they say, you met cute -- is in the movie,\" said Stahl.\n\n\"Yes; Kumail made a joke on stage and asked, 'Is Pakistan in the house?' I just woo-hooed as if I was from Pakistan. [And he said,] 'Really? You're not from Pakistan. I would have noticed you.' Which is a good line.\"\n\nAt the time Gordon was working as a therapist; Nanjiani, a Pakistani immigrant stand-up comedian.\n\nKumail Nanjiani and Emily Gordon. Family Photo\n\nGordon said, \"One thing that happened in the movie that we changed, the Kumail in the movie writes Emily's name in Urdu and kind of presents it to her, and Emily in the movie is like, 'Uh, this move. I bet you use this on all the girls.'\"\n\n\"Whereas Emily in reality fell for that so hard! And I did not realize until months later that he had done that with several other girls!\" she laughed.\n\n\"I wasn't, like, a player or anything, but I had done that before,\" Nanjiani said.\n\n\"Yeah. Uh-huh.\"\n\nKumail was accepted to Grinnell College in Iowa, so in 1997 he moved -- cold turkey -- from loud, over-crowded, teeming Karachi to, well, the Middle of Nowhere.\n\nIt was total culture shock. Raised in a devout Muslim family, he had yet to shake a girl's hand.\n\nStahl said, \"So, this girl sticks her hand out to say, 'Hi' … what do you do?\"\n\n\"Oh, my God. I'm gonna do this,\" he replied.\n\n\"The girl's like, 'And we're in love now,'\" Gordon said.\n\n\"Yeah. Okay. So let's set a date!\"\n\nHe said he was terrified the first time he got up in front of an audience, during his senior year of college.\n\nWhat was his subject? \"I remember one of the jokes I did. It was about how I always wanted to have a unit of measurement named after myself, 'cause it was what all the cool scientists had -- Joule, Kelvin. 'Turn the torpedoes up to five Nanjianis!' 'Five Nanjianis? That's way too much power. Most people can't handle one Nanijiani!' And then I would go, 'Hey.'\"\n\n\"You would go, Hey?\" laughed Gordon. \"Oh, my God!\"\n\n\"Now I know why you like her,\" said Stahl.\n\n\"She laughs at all my stuff!\"\n\nIn 2009 Kumail went from Iowa to Letterman [\"My name is Kumail, but Microsoft spellcheck thinks it should be 'camel'\"], and on to a starring role in HBO's \"Silicon Valley.\"\n\nLast fall he hosted \"Saturday Night Live\":\n\n\"My fantasy is when someone's racist to me, I want danger to befall them immediately -- and then I want to rescue them, just to see the confused look on their face.\"\n\nKumail rarely told political jokes, until President Trump and the Muslim ban.\n\nHe told Stahl, \"The point is Muslims are complicated people like everybody else. Not all Muslims are good; not all Muslims are bad, just like all people.\"\n\n\"That was part of what was important in the movie that we want to show, like, just a Muslim family,\" said Gordon.\n\n\"Muslims having fun!\"\n\nAt the heart of the movie is the issue of Kumail's family not wanting him to marry outside the faith.\n\nAs his mother commands, \"There is only one thing we ever asked for you, Kumail: That you be a good Muslim and you marry a Pakistani girl. That is it, one thing!\"\n\nStahl asked, \"How did you ever tell them about Emily?\"\n\n\"Well, it happens the way it kind of had happened in the movie,\" Nanjiani said.\n\nIn the movie, as in real life, Emily almost died. While her doctors tried to figure out what was wrong with her, they put her in a medically-induced coma for eight days.\n\nNanjiani rarely left her side: \"[My parents] called and I just answered and I think I was just too tired and I think I just cried on the phone and I said, 'I'm really sorry to tell you this, but I've been dating this girl and she's in a coma right now. She's very, very sick.' And my mom's initial reaction immediately was like, 'Is she gonna be okay? What's going on?'\"\n\n\"And she knew that she was not a Pakistani Muslim?\" asked Stahl.\n\n\"Yeah. I said that her name was Emily.\"\n\n\"And that was the first giveaway?\"\n\n\"Pretty good tell, yeah,\" said Emily.\n\n\"Yeah. And then it wasn't until, you know, I called them and I said, 'She's awake. She's gonna be okay!' And that's when my mom got upset at me. She was like, 'How could you do this to me? This is not OK. Either you guys break it off or you just have to get married to her.'\"\n\n\"She said that?\" Stahl asked.\n\n\"'Marry her, and then we can accept her.\"\n\nStahl spoke via Facetime to Kumail's dad, Dr. Aijaz Nanjiani, a psychiatrist in New Jersey:\n\n\"When we saw Emily, the warmth that she emitted, and the lovable personality that she had, she absolutely captivated us,\" he said.\n\nStahl asked, \"So tell us what happened when you saw the movie, and there was your life, in a way.\"\n\n\"We loved the movie. In fact, on two, three occasions, I was in tears and my wife was just nudging me and making fun of me,\" he laughed.\n\nNanjiani recalled, \"When they put Emily in the coma, as literally the moment that she went under, I remember looking at her and saying, 'If she comes out of this, we're gonna get married.' And I know it sounds made up and it sounds dramatic…\"\n\n\"Well, it's a little, a little creepy,\" Gordon laughed.\n\n\"It's a little creepy,\" he agreed. \"I would've asked you. I wasn't gonna do it while you were under!\"\n\nThey got married, at City Hall, three months after Emily left the hospital\n\n\"It's a good thing, right?\" asked Stahl. \"The two of you?\"\n\n\"Yeah,\" she replied.\n\n\"It is,\" Nanjiani added.\n\n\"We're good. I'm glad we found each other.\"\n\n\"It's such a strange experience to go through something like this. Where you make a movie about yourself and have it do well, your life changes,\" Nanjiani said. \"So it's good that we have each other to go through that.\"\n\n\"Yeah. We take turns kind of freaking out,\" Gordon laughed. \"We try not to freak out at the same time!\"\n\n\"It can be very overwhelming, so we try to coordinate: 'Yeah, you can take Tuesday, But right now, I'm gonna spin out!'\"\n\n\n\nFor more info:", "images": ["https://www.cbsnews.com/assets/show/sunday-morning/logo-square-32.svg", "https://assets1.cbsnewsstatic.com/hub/i/2018/02/10/50a1bd38-ebb8-4ece-9b21-b760f6fc869c/emily-v-gordon-kumail-nanjiani-interview-620.jpg", "https://assets2.cbsnewsstatic.com/hub/i/r/2022/10/07/c766968b-1ed9-4bb1-96fb-035813f2904e/thumbnail/140x90/b868f014a749947a15c360d9d76a077c/julia-roberts-interview-c-1280.jpg", "https://assets1.cbsnewsstatic.com/hub/i/r/2018/02/10/295af273-e77e-4e95-9e87-e362d526274b/thumbnail/620x541/3ea8c74e268978717f471e3d928fcec5/kumail-nanjiani-emily-gordon-family-photo-244.jpg", "https://assets1.cbsnewsstatic.com/hub/i/r/2018/02/09/1a491fda-f905-433f-b9fb-7b6cd9762194/thumbnail/620x350/a413831b9ef0a90b1a4f733e81cecbad/emily-v-gordon-kumail-nanjiani-lesley-stahl-a-620.jpg", "https://assets1.cbsnewsstatic.com/hub/i/r/2022/10/07/fe49af8e-69c7-4139-8713-4ec974793319/thumbnail/140x90/b99d611a6f27b20183cd5c2d55f6cb26/the-rock-preview-1280.jpg", "https://assets2.cbsnewsstatic.com/hub/i/r/2022/10/01/43d67a4d-9cd6-48d2-9bc3-49a5edf805cc/thumbnail/140x90/c3cbd10e47f0845535dcae86881f27ff/blanchett-conducting-a-1280.jpg", "https://assets1.cbsnewsstatic.com/hub/i/r/2022/09/30/b8855291-8b66-4afe-aa03-e174e670ec55/thumbnail/140x90/86f401ac4a010f1a51a530ed713af990/cate-blanchett-tar-focus-features-1280.jpg", "https://assets1.cbsnewsstatic.com/hub/i/r/2018/02/10/9e84c619-dea2-4b7f-a5d2-9c0281bace9a/thumbnail/1200x630/9233e7479253e68dd6dc9951a08d731f/emily-v-gordon-kumail-nanjiani-interview-promo.jpg", "https://assets1.cbsnewsstatic.com/hub/i/r/2022/10/04/c084e0ec-c67d-466d-828c-f40209e9c063/thumbnail/140x90/bd5305098c11938767cc1a524ef4c6af/gettyimages-1239555048.jpg"], "top_img": "https://assets1.cbsnewsstatic.com/hub/i/r/2018/02/10/9e84c619-dea2-4b7f-a5d2-9c0281bace9a/thumbnail/1200x630/9233e7479253e68dd6dc9951a08d731f/emily-v-gordon-kumail-nanjiani-interview-promo.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.cbsnews.com/news/the-love-story-behind-the-basically-true-the-big-sick/", "title": "The love story behind the basically true \"The Big Sick\"", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1, user-scalable=0", "color-scheme": "only light", "robots": "index, follow, max-image-preview:large", "description": "Comedian Kumail Nanjiani and Emily Gordon transformed their romance, which endured a medically-induced coma, into their Oscar-nominated screenplay", "al": {"web": {"url": "https://www.cbsnews.com/news/the-love-story-behind-the-basically-true-the-big-sick/"}, "ios": {"app_name": "CBS News", "app_store_id": 334256223, "url": "cbsnewsapp://cbsnews.com/news/the-love-story-behind-the-basically-true-the-big-sick/"}, "android": {"app_name": "CBS News", "package": "com.treemolabs.apps.cbsnews", "url": "cbsnewsapp://cbsnews.com/news/the-love-story-behind-the-basically-true-the-big-sick/"}}, "og": {"type": "article", "url": "https://www.cbsnews.com/news/the-love-story-behind-the-basically-true-the-big-sick/", "title": "The love story behind the basically true \"The Big Sick\"", "description": "Comedian Kumail Nanjiani and Emily Gordon transformed their romance, which endured a medically-induced coma, into their Oscar-nominated screenplay", "image": {"identifier": "https://assets1.cbsnewsstatic.com/hub/i/r/2018/02/10/9e84c619-dea2-4b7f-a5d2-9c0281bace9a/thumbnail/1200x630/9233e7479253e68dd6dc9951a08d731f/emily-v-gordon-kumail-nanjiani-interview-promo.jpg", "width": 1200, "height": 630}, "video": {"url": "https://splice.amlg.io/api/v2/video/cm0PL_isWgZfwvbqwvxkOJGnlkVKVlgl/preview/", "secure_url": "https://splice.amlg.io/api/v2/video/cm0PL_isWgZfwvbqwvxkOJGnlkVKVlgl/preview/", "type": "application/x-mpegURL", "width": 1920, "height": 1080}}, "fb": {"app_id": 1536620209892267, "pages": 121317881336}, "article": {"publisher": "https://www.facebook.com/CBSSundayMorning/", "content_tier": "free", "opinion": "false"}, "twitter": {"dnt": "on", "app": {"country": "US", "name": {"iphone": "CBS News", "ipad": "CBS News", "googleplay": "CBS News"}, "id": {"iphone": 334256223, "ipad": 334256223, "googleplay": "com.treemolabs.apps.cbsnews"}, "url": {"iphone": "cbsnewsapp://cbsnews.com/news/the-love-story-behind-the-basically-true-the-big-sick/", "ipad": "cbsnewsapp://cbsnews.com/news/the-love-story-behind-the-basically-true-the-big-sick/", "googleplay": "cbsnewsapp://cbsnews.com/news/the-love-story-behind-the-basically-true-the-big-sick/"}}, "site": "@cbssunday", "title": "The love story behind the basically true \"The Big Sick\"", "description": "Comedian Kumail Nanjiani and Emily Gordon transformed their romance, which endured a medically-induced coma, into their Oscar-nominated screenplay", "image": "https://assets1.cbsnewsstatic.com/hub/i/r/2018/02/10/9e84c619-dea2-4b7f-a5d2-9c0281bace9a/thumbnail/1200x630/9233e7479253e68dd6dc9951a08d731f/emily-v-gordon-kumail-nanjiani-interview-promo.jpg", "player": {"identifier": "https://www.cbsnews.com/video/the-real-life-love-story-of-the-big-sick/?embed=1&ftag=CNM-00-10aag7j", "width": 640, "height": 360, "stream": {"identifier": "https://splice.amlg.io/api/v2/video/cm0PL_isWgZfwvbqwvxkOJGnlkVKVlgl/preview/", "content_type": "application/x-mpegURL"}}, "card": "summary_large_image"}, "theme-color": "#101010", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "CBS News", "apple-mobile-web-app-status-bar-style": "black"}, "movies": [], "publish_date": null, "source": "https://www.cbsnews.com", "summary": ""}