{"url": "https://people.com/parents/celebrities-who-have-used-surrogates/", "text": "01 of 41 Khloé Kardashian & Tristan Thompson Khloé Kardashian and Tristan Thompson with True. Tristan Thompson/Instagram Though they're no longer together, the parents to 4-year-old True confirmed in July 2022 they were expecting a second child via surrogate. \"We can confirm True will have a sibling who was conceived in November,\" Kardashian's rep told PEOPLE. \"Khloé is incredibly grateful to the extraordinary surrogate for such a beautiful blessing.\" An insider told PEOPLE that \"just like they do with True, Khloé will co-parent the baby with Tristan. Tristan is the dad and Khloé wants him involved as much as possible. He is great with True.\" The source also added that Khloé \"doesn't see herself as a single mom.\" \"She has a great support system with a lot of help. She feels very lucky,\" said the insider. On Aug. 5, 2022, a rep for the reality star confirmed the couple had welcomed a baby boy.\n\n02 of 41 Andy Cohen Andy Cohen/Instagram On a December 2018 episode of Bravo's Watch What Happens Live, the executive producer and host revealed he was expecting his first child via surrogate. On Feb. 4, 2019, he shared the happy news of son Benjamin Allen's arrival. \"I'm in love,\" he wrote on Instagram alongside a blissful shot. Three years later, he welcomed his second child, daughter Lucy, also via surrogate, expressing his gratitude on Instagram. \"Thank you to my rock star surrogate (ALL surrogates are rockstars, by the way) and everyone who helped make this miracle happen,\" he wronte alongside some sweet snaps. \"I'm so happy.\"\n\n03 of 41 Anderson Cooper Anderson Cooper and son Wyatt. Anderson Cooper/instagram Cooper welcomed his son, Wyatt (right) — who is named after the journalist's father — on April 27, 2020 via surrogate. Wyatt weighed 7.2 lbs. at birth, \"and he is sweet, and soft, and healthy and I am beyond happy,\" the proud new dad said in his emotional announcement on CNN following his little boy's arrival. Cooper wrote on Instagram alongside a series of sweet photos of his son, \"As a gay kid, I never thought it would be possible to have a child, and I'm grateful for all those who have paved the way, and for the doctors and nurses and everyone involved in my son's birth,\" he wrote. \"Most of all, I am grateful to a remarkable surrogate who carried Wyatt, and watched over him lovingly, and tenderly, and gave birth to him.\" \"It is an extraordinary blessing — what she, and all surrogates give to families who can't have children,\" he said. \"My surrogate has a beautiful family of her own, a wonderfully supportive husband, and kids, and I am incredibly thankful for all the support they have given Wyatt and me. My family is blessed to have this family in our lives.\" In February 2022, little brother Sebastian arrived via surrogate as well.\n\n04 of 41 Priyanka Chopra & Nick Jonas nick jonas/ instagram The couple shared their happy surprise — the arrival daughter Malti! — on Jan. 21, 2022. The pair frequently spoke of their desire to have kids, with Chopra once telling PEOPLE, \"When the time is right, it will happen.\"\n\n05 of 41 Jamie Chung & Bryan Greenberg Jamie Chung/Instagram The pair surprised fans with news of their twins' arrival in October 2021. Chung had been open in the past about her fertility journey, revealing in 2019 that she made the decision to freeze her eggs, She and Greenberg ultimately kept their baby news a secret, however. \"It was more of a happy accident,\" Chung told PEOPLE of the private pregnancy. \"I think there's certain things that we want to keep to ourselves and enjoy and keep somewhat private, but also we don't want to overthink about what we share.\"\n\n06 of 41 Alec & Hilaria Baldwin Hilaria Baldwin/Instagram. Inset: Taylor Hill/WireImage In March 2021, the Baldwins surprised fans when they announced the addition of newborn daughter Maria Lucia to their family, just months after Hilaria gave birth to son Eduardo \"Edu\" Pao Lucas in September 2020. The Internet quickly went abuzz with questions about why the pair opted for surrogacy and why they did so given Hilaria would have already been pregnant with Edu at the time. However, a source told PEOPLE, \"It's no one's business about a woman's right to choose how and when she expands her family.\"\n\n07 of 41 Kristen Wiig & Avi Rothman Kristen Wiig and Avi Rothman. Jared Siskin/Getty Images The couple welcomed twins in early 2020 via a surrogate, a source told PEOPLE in June 2020. A rep for Wiig did not comment. PEOPLE confirmed in August 2019 that Wiig was engaged to Rothman. The two were first spotted on vacation in Kauai, Hawaii, holding hands and kissing in May 2016. At the time, a source told PEOPLE, \"They've been secretly dating for a few months,\" adding that, \"They're really happy together.\" In 2021, Wiig confirmed the pair had since married.\n\n08 of 41 Kandi Burruss & Todd Tucker Kandi Burruss Instagram The Real Housewives of Atlanta stars enlisted the help of a surrogate to welcome daughter Blaze into the world on Nov. 22, 2019. Although it was initially a \"tough decision\" for the couple, they now say that they \"wouldn't change a thing.\" \"We were just trying to figure out like, okay, should we do this? How can you trust somebody with your most precious possession, your most precious gift ... somebody that you barely know?\" Burruss said in an episode of Parents magazine's We Are Family podcast. \"But now that it's all said and done, I wouldn't change a thing. It was the best decision that we could have made,\" she added. The mother of three — who also shares son Ace Wells with Tucker, and is mom to daughter Riley — said that her surrogate, Shadina, had carried for another family before, and so she \"was really teaching\" them \"a lot of things\" about the process. \"Once I got comfortable, then I started really appreciating the fact that [Shadina] was doing the heavy lifting,\" she said. For anyone else considering in vitro fertilization and/or surrogacy, Burruss advised, \"I would definitely say go forward. The research is the main thing. And then you just gotta trust and believe and just go for it.\"\n\n09 of 41 Kanye West & Kim Kardashian Kim Kardashian and Kanye West with their children. Kim Kardashian/Instagram Kanye West and now-estranged wife Kim Kardashian hired a surrogate to carry their third child, Chicago, and did it again for baby No. 4, PEOPLE confirmed in January 2019. \"We are incredibly grateful to our surrogate who made our dreams come true with the greatest gift one could give and to our wonderful doctors and nurses for their special care,\" the reality star wrote on her website after the January 2018 birth of daughter Chicago. Giving birth again isn't an option for Kardashian West, who suffered from placenta accreta during both of her pregnancies with son Saint and daughter North. Son Psalm completed the family in May 2019.\n\n10 of 41 Gabrielle Union & Dwyane Wayne Gabrielle Union and Dwyane Wade with daughter Kaavia. Gabrielle Union/Instagram The actress and her NBA star husband welcomed their first child together, daughter Kaavia James, via surrogate on Nov. 7, 2018. The couple shared family photos in the hospital on Instagram. Wade is also dad to kids Xavier, Zaya and Zaire from a previous marriage. He also raises nephew Dahveon Morris. In an interview, Union opened up about surrogacy, saying she felt she was \"surrendering to failure\" after years of fertility treatments and losses. But once she came to terms with it, she embraced the process, even being careful to select a surrogate who loved to read — a trait she hopes to see in her daughter someday.\n\n11 of 41 Zach Gilford & Kiele Sanchez Michael Tran/FilmMagic After several attempts to start a family, which also included a late-term miscarriage in 2015, the former Friday Night Lights actor and his wife, Kingdom actress Sanchez, welcomed daughter Zeppelin Adele via surrogate in November 2017. \"It's been a long, painful journey for us,\" the couple shared with PEOPLE. \"Zeppelin is the light of our lives.\"\n\n14 of 41 Sarah Jessica Parker & Matthew Broderick Bruce Glikas/FilmMagic Marion Loretta Elwell (who goes by Loretta) and Tabitha Hodge were born via surrogate to actors Matthew Broderick and Sarah Jessica Parker in June 2009. \"I've had a lot of opportunities to do the things that I wanted to do, like sleep,\" Parker told Vogue in 2011 of becoming a mom a little later in life.\n\n15 of 41 Neil Patrick Harris & David Burtka Source: Neil Patrick Harris/Instagram Neil Patrick Harris and David Burtka's twins — Gideon Scott and Harper Grace — arrived via help from an egg donor and a surrogate. \"We found an egg donor anonymously through a hilarious process of looking at people's profiles and then an amazing surrogate who had helped a same-sex couple before,\" Harris told PEOPLE in 2011. \"And then we inserted two eggs, one with my sperm, one with David's sperm and they both took,\" he said, with Burtka adding that the couple \"don't know whose is whose.\"\n\n16 of 41 Jimmy Fallon & Nancy Juvonen Gerardo Mora/Getty \"We tried before, we told people and it didn't happen. It's just really depressing and hard,\" Fallon — now dad to Frances Cole and Winnie Rose both born via surrogate — said in 2013 shortly after Winnie's birth. \"I just want to thank everyone. The nurses and the doctor and the surrogate who had our baby,\" he added on The Tonight Show. \"It's true, we had a surrogate. I can't say anything more because I don't know what the rules are. But I just want to say that there are angels in Dallas, Texas, so thank you so much.\"\n\n17 of 41 Jordana Brewster & Andrew Form JB Lacroix/WireImage Both Jordana Brewster's sons — Rowan and Julian — were born to the actress and now-ex-husband Andrew Form via surrogate. \"Sometimes I feel a little left out when other moms talk about what their birth experience was like, and I feel the loss of not having carried or having been able to carry,\" she told Yahoo Parenting in 2015. \"But luckily I keep my circle tight and close, so I never feel judged,\" added the Furious 7 star.\n\n18 of 41 Dennis & Kimberly Quaid Courtesy Knott’s Berry Farm \"God has definitely blessed us,\" Quaid said in a statement after a surrogate gave birth to his twins Thomas Boone and Zoe Grace with ex Kimberly in November 2007.\n\n19 of 41 Matt Bomer & Simon Halls Courtesy Uplift Family Services Bomer's three sons with publicist husband Halls were all welcomed with the help of a surrogate. \"I just want to be hopefully somebody who helps shape these souls without changing how they came into the world,\" Bomer told PEOPLE in 2014 of twins Henry and Walker and big bro Kit.\n\n20 of 41 Kelsey & Camille Grammer Rodin Eckenroth/Getty Frasier alumnus Grammer is dad to seven children total, with two of them — son Jude Gordon and daughter Mason Olivia — born via surrogate. \"I wish I could have had that experience. I'm just so grateful I had a wonderful surrogate who carried our two children,\" Grammer's ex-wife Camille wrote in a 2012 blog. \"I have two amazing angels in my life that I love so much,\" she added. \"They are such a gift and a blessing from God.\"\n\n21 of 41 Nate Berkus & Jeremiah Brent Christopher Dibble Photography. Design gurus Berkus and Jeremiah Brent enlisted the help of a surrogate to bring daughter Poppy into their lives. \"Surrogacy can be about science, it can be about money or it can be about intention,\" Berkus told PEOPLE in 2015 shortly after their daughter's birth. He added, \"We were really lucky to have everybody that was involved in allowing us to have our daughter be excited for us.\" In 2018 they welcomed a second child, son Oskar, via surrogate.\n\n22 of 41 Michael Jackson Samir Hussein/WireImage Late King of Pop Jackson's youngest child Prince Michael II (nicknamed \"Blanket\") was born to an unidentified surrogate in February 2002. \"The kids live like Michael is constantly looking down upon them,\" a family friend told PEOPLE of Blanket (who changed his name to Bigi in 2015) and his older siblings: Paris Michael and Michael Joseph Jr. \"Prince.\"\n\n23 of 41 Tyra Banks Source: Tyra Banks Instagram; Art Streiber/NBC/NBCU Photo Bank via Getty Images Beauty entrepreneur and former supermodel Banks welcomed son York in January 2016 via gestational surrogate, telling PEOPLE exclusively at the time that \"the journey to now has not been an easy process.\" \"As I gaze into the beautiful eyes of my son, I think about all the people who struggle with fertility or carrying a child and continue to pray for them every day,\" she added.\n\n24 of 41 Elton John & David Furnish \"We decided to go the surrogacy route and have children of our own. The dominoes fell very quickly,\" John said in an October 2016 interview of himself and his husband Furnish after the couple initially tried to adopt. \"It was only through fate, really,\" John added of becoming a dad through son Zachary Jackson Levon and Elijah Joseph Daniel (both boys were born to the same surrogate).\n\n25 of 41 Amy Smart & Carter Oosterhouse Source: Amy Smart Instagram Actress Smart and her husband Oosterhouse became first-time parents to daughter Flora in December 2016. \"After years of fertility struggles I give thanks today to our kind, loving surrogate for carrying her,\" Smart captioned a January Instagram photo of herself with her baby girl.\n\n26 of 41 Angela Bassett & Courtney B. Vacne Tibrina Hobson/FilmMagic Twins Slater Josiah and Bronwyn Golden came into the world in January 2006, born via surrogate to actor spouses Bassett and Vance. \"I was devastated when it didn't happen [again and again],\" Bassett said on Oprah in 2007 of the couple's years of failed fertility treatments, including in vitro fertilization. \"The more we learned about [surrogacy], the more we began to think that perhaps this was an answer for us,\" she added.\n\n27 of 41 Chris & Deanna Daughtry Source: Chris Daughtry Instagram Rocker Daughtry and wife Deanna became parents to twins Adalynn Rose and Noah James in November 2010. Deanna had undergone a partial hysterectomy, so the couple used in vitro fertilization to conceive the twins before transferring the embryos to a surrogate carrier. \"Our family is overwhelmed with joy by these two precious gifts from God,\" Daughtry said on his website following the twins' births.\n\n28 of 41 Elizabeth Banks & Max Handelman Source: Elizabeth Banks Instagram; Frazer Harrison/Getty Images Magnus Mitchell and Felix were both born via surrogate after Banks and husband Handelman took \"a big leap\" of faith. \"This experience has exceeded all expectations, taught us a great deal about generosity and gratitude, and established a relationship that will last a lifetime,\" Banks said of the surrogacy process following Magnus' birth.\n\n29 of 41 Ricky Martin & Jwan Yosef Jwan Yosef, Ricky Martin and twins in September 2019. Paul Morigi/Getty Martin is dad to twin boys Matteo and Valentino, born to a surrogate in August 2008. \"Adoption was one option, but it's complicated and can take a long time,\" the singer, married to Yosef since 2017, told PEOPLE that December. \"Surrogacy was an intriguing and faster option,\" he explained. \"I thought, 'I'm going to jump into this with no fear.' I put my name on the list for one baby and then found out I got two!\" In 2018, daughter Lucia joined the family via surrogate, followed by son Renn in 2020.\n\n31 of 41 George Lucas & Mellody Hobson Barry King/WireImage Star Wars mastermind Lucas and wife Hobson welcomed their daughter Everest in August 2013 via gestational surrogate. Lucas has three adult children through adoption: Jett, Katie and Amanda.\n\n32 of 41 Bill & Giuliana Rancic Source: Giuliana Rancic Instagram After struggling with infertility, miscarriage and breast cancer, the Rancics welcomed their son Edward Duke in August 2012. \"I love that she was honest,\" Giuliana told PEOPLE in 2012 about her surrogate. \"It made me realize that the important stuff is what I should be listening for, and that's when I knew she was the one.\"\n\n33 of 41 GloZell Green & Kevin Simon Source: Glozell Instagram; Araya Diaz/Getty Images for Path2Parenthood Green and husband Simon are parents to daughter O'Zell Gloriana De, whom surrogate Shawna Johnson gave birth to in August 2016. \"To say, 'What Shawna is doing for us is the greatest gift,' is an understatement,\" Green told PEOPLE at the time. \"She truly is an angel in our lives and we will be forever grateful to her for her generosity toward us.\" Sadly in early 2017, the YouTube personality shared that Johnson was going to miscarry the couple's second child.\n\n34 of 41 Joey Gonzalez & Jonathan Rollo Jonathan Rollo/Instagram Barry's Bootcamp CEO Gonzalez and husband Rollo became fathers in December 2015, when daughter Francesca Isabella was born to their surrogate Dayna. \"I love Jon and Joey. When I think about giving birth and placing her in their arms, that's what it's all about for me — their joy, their emotions,\" Dayna told PEOPLE earlier that year. \"That's what's going to get me to the end.\" In April 2017, Dayna delivered the couple's second child, son Jake Stone.\n\n36 of 41 Nicole Kidman & Keith Urban Source: Keith Urban Instagram; David M. Benett/Dave Benett/Getty Images Country star Urban and his Oscar-winning actress wife Kidman have two daughters together: Sunday Rose, whom Kidman delivered, and Faith Margaret, who was born to a surrogate. \"I would have liked probably two or three more children,\" Kidman once said (she is also mom to Isabella and Connor whom she adopted with ex-husband Tom Cruise). \"I love, love children. I love raising children ... they make me feel good and I love being around and I love the ups and downs, and I love watching them grow and the things they say and teach,\" she added.\n\n37 of 41 Tom Ford & Richard Buckley Rabbani and Solimene Photography/WireImage \"If I have a child, you won't notice that I had a child. Maybe you'll see it when it's 18, but I will keep it out of the spotlight,\" designer Ford told Time Out Hong Kong in 2011 — the year before he and husband Buckley (who died in 2021) welcomed their son Alexander John reportedly via surrogate.\n\n38 of 41 Lucy Liu \"It just seemed like the right option for me because I was working and I didn't know when I was going to be able to stop,\" Elementary actress Liu told PEOPLE in 2016 of why she chose a surrogate to carry son Rockwell Lloyd. \"I decided that was probably the best solution for me, and it turned out to be great,\" explained the single mom.\n\n39 of 41 Robert De Niro Bruce Glikas/FilmMagic Hollywood vet De Niro is a dad of six, with half of his children — daughter Helen Grace and twin sons Julian Henry and Aaron Kendrick — born to surrogates.\n\n40 of 41 Ryan Murphy & David Miller Source: Ryan Murphy Twitter; Jeff Kravitz/FilmMagic Television screenwriter, producer and director Murphy and his husband Miller are parents to three sons, Ford, Logan and Griffin, all born via surrogate. \"It's amazing to be two dads and we have a wonderful surrogate,\" Murphy told E! News in 2014. \"It's so uplifting and I've enjoyed sharing our story with young gay families.\"", "images": ["https://people.com/thmb/zyAlM1d0HPFEMXyo8Yj4bx8An9g=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(734x0:736x2)/kiele-sanchez-2-2000-8339a54ba73946f494e538cb650b6d86.jpg", "https://people.com/thmb/w5FVSfFWCIqoTxvh6rnhO14i2Y4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(494x279:496x281)/first-fathers-day-4d2b05f83cc641a6a7b81b7c7eac50cd.jpg", "https://people.com/thmb/SAfFYlqL3gs_YdJJJsJzpCKesp4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(734x269:736x271)/khloe-tristan-8fbd8b2e4b3544138b960a4f845211a9.jpg", "https://people.com/thmb/A0cMnjVgy2OQwBTahDyFOpiKMTs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(743x0:745x2)/kourtney-kardashian-travis-barker-1e4428ee0da7411a8a88963bbeac3e49.jpg", "https://people.com/thmb/QDlHhTppqh7IlBlp6oLEjpDwT7M=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(695x179:697x181)/ricky-martin-family-2-1-2000-7900d2c959c847a4ba7c97bf64aa88b3.jpg", "https://people.com/thmb/iiQ2yTNSP2X23NqOmX6H-EFSIgo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/priyanka-chopra-nick-jonas-thanksgiving-54190cde5bd94023aaab5129e3884da7.jpg", "https://people.com/thmb/uDaW1dyh0eemACEpa7HFWz-Rato=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/ellen-pompeo-2000-1-642e97ed6431419fadba1503240afd1f.jpg", "https://people.com/thmb/TiI0bXH1Amce-L1J-v1dbhLw_pM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(959x425:961x427)/khloe-tristan-cd6ebffe3b374e979ce23a4417a1878a.jpg", "https://people.com/thmb/fpcrFycrX1jqxRJh9DXMDpYppJo=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(404x379:406x381)/mccord-babies-2-d0bd00f50632409d91796d335df75b19.jpg", "https://people.com/thmb/XSg7w6zGNmqCWcal53UiqCwZLVg=/1044x1086/filters:fill(auto,1)/khloe-kardashian-1-d64e524e233f45dcafb3d02fe9172d23.jpg", "https://people.com/thmb/ATnXMKNeLFpukog3EsEBJzNZrTM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(704x593:706x595)/priyanka-chopra-nick-jonas-baby-b8bddee858894294bae92c48ccdd4512.jpg", "https://people.com/thmb/Rnnw2WQcxCVa1X1B4_lmPd0Ei50=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/george-lucas-2000-ad5f58e7da8747fb87c6ec6108e443d0.jpg", "https://people.com/thmb/mlPYbBa40T42q8_db56gj6xn218=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(574x0:576x2)/jacey-duprie-baby-hugh-071822-1-db9e8bbe93c4460696d920cb4b805249.jpg", "https://people.com/thmb/Gs02c7ruY8roJr33Ep3XFoZwytg=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/neil-patrick-harris6-2036eb5def924f44aac3c7d2c6422a43.jpg", "https://people.com/thmb/FsKQrpPH13sGIGD3vFMj5Bweozc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(734x209:736x211)/jonas-brother-families-93f77a476ea64cf5bf566285654ec051.jpg", "https://people.com/thmb/rxwGtr0nCO8DYyzIxYuGakjic8o=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(584x229:586x231)/andy-cohen-67a722d748ad4a77ac41be7db27c27ce.jpg", "https://people.com/thmb/2sXab5K3BwirXE6WeA7ViIeVGCc=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(660x0:662x2)/joey-gonzalez1-17c2f96003ae4442b11716c01da212b8.jpg", "https://people.com/thmb/HnE8KPd_WFDuya3EAIn4owymdXk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/gabrielle-union-dwayne-wade-1-2000-41aa1a1597ba4c09a2f231215c6b1871.jpg", "https://people.com/thmb/l3J7F1Bp018hce7khpqgSC0-SOQ=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/elizabeth-banks-2000-a712526d5b6e41d0a24aaf77521008f9.jpg", "https://people.com/thmb/uJu1wlMgNMPOYCfF3dvtRfBQJUA=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/jimmy-fallon-daughters-1-1-1823c8afb41c45298ebf42aa00427db1.jpg", "https://people.com/thmb/Nf6rb5IlEmuaruR8adeH1cH94xI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/matt-bomer-3d3c87bd855f4f7187ec175476ccc7b8.jpg", "https://people.com/thmb/2Rt66CVK6Vmum5Ohms-Hs0-kiO0=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x884:601x886)/anderson-cooper-1-d590eea36b5c4cf0ac4eb5f00f512f1d.jpg", "https://people.com/thmb/EEMH6EGUvJo2D3Nn1ShC9hYQ5k0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(689x29:691x31)/elon-musk-grimes22-50391e9afa074715a57e23450841abac.jpg", "https://people.com/thmb/PK0H7sFxcCt-BLSmKdagcNnJlas=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/amy-smart-2000-941c87b792fc44788664db4d37ee19fc.jpg", "https://people.com/thmb/6B16XIjFx9t5T6_5urji23aIW88=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/lucy-liu-2000-44b25c9db3fe4414a849242cd884c841.jpg", "https://people.com/thmb/eS3EiozN0-VZrtacI7386l6kIkk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(734x239:736x241)/Jamie-Chung-and-Bryan-Greenberg-21-3f4079e4d1874b098f239a83031beddf.jpg", "https://people.com/thmb/tD6w2FSzKqjRnh-WUjwJdW_tqwU=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/glozell-2000-963e6ccb2e184672958b2bea33a737b4.jpg", "https://people.com/thmb/62gK7ky75meX40S88DM1vrBiBTo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(797x0:799x2)/tyra-banks-1-2000-8276ed0040da40af8e75f415ba1f1555.jpg", "https://people.com/thmb/qCxS49UATaxQLCnxinmYGweaZNM=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/nate-berkus-jeremiah-brent-nursery-oskar-2-d13f8cb6afbd42889a07d6d4dbea8e28.jpg", "https://people.com/thmb/sxlXNLx5KPpvkt2IB50pfLVvcDI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(807x0:809x2)/jordana-brewster1-fd87b43ed7194e5ea37c83c5a688798e.jpg", "https://people.com/thmb/YyFffCwNpAEqmAkTT0G_ZNgrSdk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(644x443:646x445)/baldwins-lucia-abc7236329f240509a7c931b9e18078f.jpg", "https://people.com/thmb/d3TGbFzoktw3ptSuUu6OrhM6eXY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(640x539:642x541)/katherine-schwarzenegger-chris-pratt-2000-e706516a209f47f5a3aca3cf6490f194.jpg", "https://people.com/thmb/tlrZAnZhaxXcHjTwl1AAVsK9470=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/elton-john-2000-1-2abecd33edd74e018cb399a0c10801f0.jpg", "https://people.com/thmb/BpyYBfgqlpAEQdDZcRK26WSix5Q=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(521x0:523x2)/khloe-kardashian-1-d64e524e233f45dcafb3d02fe9172d23.jpg", "https://people.com/thmb/z4gvnHez1hLYOeq6Uny8469LWQk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/giuliana-rancic-2000-ea2ff65822b94efd866813541f58e080.jpg", "https://people.com/thmb/3KpOQeL2_BYFaors0R6xoSKoNk4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(424x0:426x2)/fredrik-eklund1-4a166941819341e590b15c9d7963babc.jpg", "https://people.com/thmb/2SBIhsXdSvR0zoylArLmaKfHYBE=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/shaun-t-11-d4f4b5c022be42de8e1eddb926476b71.jpg", "https://people.com/thmb/Sf29nSrAw9hvZrHg8Ig1LCpjTBI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/sarah-jessica-parker1-1040178b32e84511a3010762b038d028.jpg", "https://people.com/thmb/wmqCoBM-KkqSHXZLg_buQlrKbNM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(319x249:321x251)/nick-jonas-priyanka-chopra-malti-072222-1-6c03e257989646bb9ff6076216ae7fe6.jpg", "https://people.com/thmb/zyxx2ZQVOVbuJxD47Exi7TmSYzo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(775x0:777x2)/shayne-lamas-2000-db823a90d7e2421fb309aca122fd8023.jpg", "https://people.com/thmb/B16O7cmFz91PF9grG6ZgiD435IE=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(841x817:843x819)/kim-kardashian-2-733cdc9d34754f7b99e193ea06fee9f5.jpg", "https://people.com/thmb/CejbOv7AVHxOsIJq4r-uC4cRjvI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/lauren-burnham-luyendyk-1-e874f6c01d11470b832c9eaf86057632.jpg", "https://people.com/thmb/Lje7sGaj3HgeS-yLg9z5JSNPfrU=/300x150/filters:no_upscale():max_bytes(150000):strip_icc()/people_magazine_sub-e6689738996d40f38f154099e1751481.png", "https://people.com/thmb/2kZFYa7qbgOt-mXjNOBmOOtBP3Y=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/tribute-concert-5df296fce9204a289e77307b86327b71.jpg", "https://people.com/thmb/0TEtYW17J2kGRtz0GE8Tt6TsAk0=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(734x449:736x451)/kandi-burruss-1-925c40e060974b17bdf283c757836193.jpg", "https://people.com/thmb/Kfq16lebvxgUeqkd-9e40Zv3O7o=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(761x0:763x2)/angela-bassett-2000-1-dff54b12f63843bf8371c008b8f71a03.jpg", "https://people.com/thmb/4Le1957jxg81sxS0mxDoSMMfZDo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(801x0:803x2)/ryan-murphy-2000-608c5adfc48843b2aa8b501b6ea39a37.jpg", "https://people.com/thmb/KGqsStiqoYyki2p1voC7YwrHYmw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(299x0:301x2)/chloe-sevigny-600-43abc128b5044a8ea745fccf6a305c45.jpg", "https://people.com/thmb/63harlCwxAaa1msjvdi4aLjD21o=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(545x524:547x526)/anderon-cooper-1-96cfe1ab2e9a4d34936cef9faa3a203e.jpg", "https://people.com/thmb/ik38023Zu5qaylQP2JYBwtkCL_I=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Kristen-Wiig-and-Avi-0184316f45c14369b940ce81dfaa2785.jpg", "https://people.com/thmb/BJKRvlbGSasR1KK6y8Gs1FB20uw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/kelsey-grammer1-4263f6f088944bebb192cc00f3fefd20.jpg", "https://people.com/thmb/fWMAQb68ugUX_Fd-HL_AUT9N-Nk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/chris-daughtry-2000-b7aa7158826e45e0b01142caddbbcdc4.jpg", "https://people.com/thmb/Ot5iYCQruwTl5UXS_qEQWXaagck=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/keith-urban-2000-3ca29c634b0040feaedb44d1baaf94ba.jpg", "https://people.com/thmb/Cdi4ywBrAMLUZ9Kb9ZLwlAj6-Lw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(314x249:316x251)/The-Kardashians_01-4df03ab457d2441ca1a41a169f621a34.jpg", "https://people.com/thmb/7o6r-w-jBvQJHpNGBSLxvbtnnLc=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/dennis-quaid-1-2-5d5af9ef49c840e5a5141e0f84416aba.jpg", "https://people.com/thmb/7Pl25vhYjou8f_1Ne_G0Xvj28kQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(854x79:856x81)/ed-sheeran-89da2b23242b4a8aba91095531281a68.jpg", "https://people.com/thmb/0xoyN5zghHE759f_nH-RmsxI45c=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(652x0:654x2)/tom-ford2-3a10ede900e2427e8bf50773e34bd793.jpg", "https://people.com/thmb/-n7p5zQV0mq3FGyCUc-Smk2qQsA=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/kate-sutter-2000-1bf754b9bf4842a981f8f7ad627f1af2.jpg", "https://people.com/thmb/zW9bsfGbvrNSCszH2VrB_WA8UxY=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/robert-deniro-julian-2000-76f3f57bad524318bf00d1cc804bd291.jpg"], "top_img": "https://people.com/thmb/XSg7w6zGNmqCWcal53UiqCwZLVg=/1044x1086/filters:fill(auto,1)/khloe-kardashian-1-d64e524e233f45dcafb3d02fe9172d23.jpg", "keywords": [], "authors": ["Jen Juneau", "People Editorial Guidelines"], "canonical_link": "https://people.com/parents/celebrities-who-have-used-surrogates/", "title": "Celebrities Who Have Used Surrogates [PHOTOS]", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "\"It is an extraordinary blessing, what ... all surrogates give to families who can't have children,\" says Anderson Cooper. See 41 celebrity families who've welcomed children via surrogate", "emailcontenttype": "LISTSC", "emailvertical": "PEOPLE", "sailthru.author": "Jen Juneau", "article": {"section": "People", "opinion": "false", "author": "https://www.facebook.com/peoplemag"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "og": {"type": "article", "site_name": "Peoplemag", "url": "https://people.com/parents/celebrities-who-have-used-surrogates/", "title": "Celebrities Who Have Used Surrogates [PHOTOS]", "description": "\"It is an extraordinary blessing, what ... all surrogates give to families who can't have children,\" says Anderson Cooper. See 41 celebrity families who've welcomed children via surrogate", "image": "https://people.com/thmb/XSg7w6zGNmqCWcal53UiqCwZLVg=/1044x1086/filters:fill(auto,1)/khloe-kardashian-1-d64e524e233f45dcafb3d02fe9172d23.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "Celebrities Who Have Used Surrogates [PHOTOS]", "description": "\"It is an extraordinary blessing, what ... all surrogates give to families who can't have children,\" says Anderson Cooper. See 41 celebrity families who've welcomed children via surrogate", "image": "https://people.com/thmb/XSg7w6zGNmqCWcal53UiqCwZLVg=/1044x1086/filters:fill(auto,1)/khloe-kardashian-1-d64e524e233f45dcafb3d02fe9172d23.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.19.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.19.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.19.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.19.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.19.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}