{"url": "https://www.intomore.com/culture/alyson-stoner-taps-into-her-sexuality-with-fool", "text": "In 2017, Alyson Stoner released a very SEO-friendly YouTube video called “What Happened to Alyson Stoner?” In it, she expressed her frustration with getting the same questions asked of her, over and over, by fans and press alike. As a former child star known for acting and dancing roles in Disney shows, films like Cheaper By the Dozen, and Missy Elliott’s iconic “Work It” music video, Stoner (now 25) is often tasked with explaining where she is now.\n\n“No, I did not die,” she says in the video from last year. Instead, she graduated high school at 14, has appeared in over 150 movies, voiced several animated characters, traveled internationally as both an activist and a performer, and, more recently, came out as queer. Now, poised with a new single, “Fool,” and a growing Instagram following, Stoner is looking to move back into the spotlight. That had to begin, she says, with a realization that the image she was projecting to the world was not exactly her.\n\n“You know, art is supposed to be raw — raw expression — but I grew up in a very commercialized, mainstream platform,” Stoner tells INTO. “So I’ve always carried a bit of an inner diplomat and technician in my songwriting and performances, which makes things a little careful and curated. Maybe digestible, but like boring because it’s not necessarily honest, and I reached a point several months ago where I put it up to my team that I really believe the genuine Alyson is more interesting and capable than the persona we’ve been maintaining.”\n\nIn a world obsessed with transformations, Stoner is recreating her own image, and this time, she says she’s in control.\n\n“I have now been unlocking parts of myself and sharing them in essays, in interviews and podcasts, and it’s funny because people, of course, have to take their time to adjust, but I at least know that when I’m stopped by fans on the street, the conversations are different now,” she says. “It’s not about someone idolizing an unobtainable figure. It’s about someone who found themselves in my story and that is the kind of connection that I’ve always longed for, but I myself have been too timid to tap into.”\n\nPart of Stoner’s story is her sexual fluidity, which she talked about for the first time this spring in a Teen Vogue essay about falling for a woman.\n\n“I, Alyson, am attracted to men, women, and people who identify in other ways,” she wrote. “I can love people of every gender identity and expression. It is the soul that captivates me. It is the love we can build and the goodness we can contribute to the world by supporting each other’s best journeys.”\n\nOver the weekend, Stoner appeared at her first GLAAD event since coming out, presenting an award to #BornPerfect’s Mathew Shurka. As her personal platform grows, so does her visibility as a now openly queer LGBTQ activist and artist, something other out public figures might consider a double-edged sword.\n\n“[People believe] that I’m sharing my sexuality because it’s more popular now,” she says. “I’m sure I could have created some controversy and maybe have gotten more attention and more streams, but I don’t want to look back and feel like I could have been more sensitive to people watching.”\n\nStoner’s brand is largely positivity — optimism, mental health, self-expression and, perhaps most importantly, engagement. Most of her Instagram posts ask for commenters to share their own feelings, thoughts, or memories, or even their choice of emoji. She’s often quick to respond to them indivudally, offering personalized connections as best she can. But with “Fool,” a song that she says has a “sexuality and a sensuality to it,” that has been scary for her to tap into; her concern is that she’s moving into a new, rawer direction that might be off-putting.\n\n“Yeah, I’m just like a nun/Feeling lonely as fuck/And I want you/On the floor, on the chair, I don’t care/Anywhere that you want to,” she sings, in her most explicit song yet. Even though she’s an adult woman, Stoner is still working against the archetype set up for her; the same that Miley Cyrus, Demi Lovato, and other former child stars have had to work against.\n\n“For me, the song kind of only makes sense as a metaphor,” Stoner says. “It’s when you’re sleeping in, when you’re getting ready to go out, when you’re in the shower. It’s someone kissing you down your spine, it’s being held, sinking into pillows, driving down the coast. So, it’s all of these sensations and instead of creating an inspirational anthem, I really wanted the song to be an invitation inside my senses.”\n\nDespite being an accomplished dancer (she frequently shares her moves on social media and has taught classes at the famed L.A.-based Millennium Dance Complex), Stoner says she still struggles to be as in touch with her body as she wants to be — and that relates both to her artistry and her sexuality. She acknowledges the irony, but has found a way through both to reconnect with herself — it just happens to coincide with her reemergence into the public eye.\n\n“I’m one of the few in my generation who remained private about their personal life and generally pretty modest throughout my career, so I also have the concern and responsibility of potentially disappointing people and being judged by fans who depend on me to stay in a certain box. As much as I’d like to say my dance gave me an edge on people, I actually feel the opposite. But now, because of the healing and therapy and learning to love and accept myself, now I feel like I’m getting to experience life fully. And you know, I felt so good singing this song. I want everyone who listens to feel as good as I do when I’m singing it.”\n\nOf course, coming out, even in 2018, is considered risky for anyone who is selling the world on buying them as an individual. (Stoner is still an actor, but says in her 2017 video she prefers to tell her own stories now.) And as any former child star can attest to, that wholesome and assumed heterosexual image can work against you once you grow older.\n\n“First and foremost, my focus is on making sure I seek to understand other people before expecting to be understood,” she says, “and I understand that having a microphone automatically qualifies whatever the person says as expertise or things that can be later used against the person. I don’t think I can speak out about loving women and then not alienate certain people who disagree with that. And I consider it a special honor to be able to participate in these conversations, but I believe that my position hopefully always is going to be one of a student and I just simply don’t — I don’t have peace with seeing injustice and discrimination and not doing everything in my capacity to understand how we got here and find a way to play mediator between the sides.”\n\nWhile happy to participate in conversations with the conservative fans who would rather remember her as a desexualized performer with kid-friendly messaging, Stoner says she doesn’t take representing LGBTQs lightly.\n\n“It’s not a responsibility that I demand or expect, but it does sometimes happen subsequently and I try my best to make sure I’m going above and beyond to find sources and people and build relationships in all of the communities on every side so that I’m informed,” she says. “So that when I’m making decisions and I’m speaking out on something, I am not just following talking points that were given to me.”\n\nStoner says she’s hoping followers will take the opportunity to get to know the real Alyson, now that she’s ready to show them.\n\n“I don’t think people know my heart and what I value. And I think that’s because I withheld that information and now, through writing articles, through performing, I plan to be way more transparent. I don’t need people to know me perfectly. I can never control their perceptions, but I really do want people to know that I’m an ally for anyone who’s trying to pursue wholeness.”\n\nImages via Getty", "images": ["https://www.intomore.com/wp-content/themes/into_2022/images/social-icons/facebook.png", "https://www.intomore.com/assets/logos/logo-white.png", "https://aumiekjrpq.cloudimg.io/v7/_intoprodweb_/uploads/2022/10/shutterstock-673566250-scaled.jpg?&auto=format&auto=compress&crop=faces&fit=crop&gravity=face&w=306&h=300&gravity=center", "https://www.intomore.com/assets/logos/logo-black.png", "https://www.intomore.com/wp-content/themes/into_2022//images/social-icons/instagram.png", "https://pixel.quantserve.com/pixel/p-3a_FtJ1e9ZPvw.gif", "https://www.intomore.com/assets/logos/q-digital-logo-black.png", "https://sb.scorecardresearch.com/p?c1=2&c2=32666898&cv=2.0&cj=1", "https://www.intomore.com/wp-content/themes/into_2022/images/social-icons/twitter.png", "https://www.intomore.com/wp-content/themes/into_2022//images/social-icons/facebook.png", "https://www.intomore.com/wp-content/themes/into_2022/images/email-prompt/down-arrows.png", "https://aumiekjrpq.cloudimg.io/v7/_intoprodweb_/uploads/2022/10/shutterstock-2148953251-scaled.jpg?&auto=format&auto=compress&crop=faces&fit=crop&gravity=face&w=306&h=300&gravity=center", "https://www.facebook.com/tr?id=2548223328807310&ev=PageView&noscript=1", "https://aumiekjrpq.cloudimg.io/v7/_intouploads_/2018/09/GettyImages-1014234590_900x350_acf_cropped.jpg?&auto=format&auto=compress&crop=faces&fit=crop&gravity=face&w=1556&h=810", "https://www.intomore.com/wp-content/themes/into_2022/images/social-icons/instagram.png", "https://www.intomore.com/assets/favicon/apple-touch-icon.png", "https://aumiekjrpq.cloudimg.io/v7/_intoprodweb_/uploads/2022/10/cst-notebook-03-lizlauren.jpeg?&auto=format&auto=compress&crop=faces&fit=crop&gravity=face&w=306&h=300&gravity=center", "https://into-prodweb.s3.amazonaws.com/uploads/2018/09/GettyImages-1038442068.jpg", "https://www.intomore.com/wp-content/themes/into_2022//images/social-icons/twitter.png", "https://www.intomore.com/assets/logos/logo-gradient.png"], "top_img": "https://www.intomore.com/assets/favicon/apple-touch-icon.png", "keywords": [], "authors": ["Trish Bendix"], "canonical_link": "https://www.intomore.com/culture/alyson-stoner-taps-into-her-sexuality-with-fool/", "title": "Alyson Stoner Taps Into Her Sexuality With ‘Fool’", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "twitter": {"label1": "By", "data1": "Trish Bendix", "label2": "Est. reading time", "data2": "7 minutes", "card": "summary_large_image", "url": "https://www.intomore.com/culture/alyson-stoner-taps-into-her-sexuality-with-fool/", "title": "Alyson Stoner Taps Into Her Sexuality With ‘Fool’", "description": "In 2017, Alyson Stoner released a very SEO-friendly YouTube video called \"What Happened to Alyson Stoner?\" In it, she expressed her frustration with getting the same questions asked of her, over and over, by fans and press alike. As a former child star known for acting and dancing roles in Disney shows, films like...", "site": "@into_tweets"}, "og": {"site_name": "INTO", "description": "In 2017, Alyson Stoner released a very SEO-friendly YouTube video called \"What Happened to Alyson Stoner?\" In it, she expressed her frustration with getting the same questions asked of her, over and over, by fans and press alike. As a former child star known for acting and dancing roles in Disney shows, films like...", "type": "article", "url": "https://www.intomore.com/culture/alyson-stoner-taps-into-her-sexuality-with-fool/", "title": "Alyson Stoner Taps Into Her Sexuality With ‘Fool’"}, "article": {"published_time": "2018-09-18T14:20:59-07:00", "modified_time": "2018-09-18T14:21:17-07:00", "tags": "Celebrity, Film, HER, Music, TV", "publisher": "https://www.facebook.com/into"}, "news_keywords": "Celebrity, Film, HER, Music, TV", "author": "Trish Bendix", "onesignal": "wordpress-plugin", "facebook-domain-verification": "ttvileutdd2pm7hcblky5ukyt9xvzc", "fb": {"pages": 107156803320095, "app_id": 858727421529749}, "theme-color": "#ffffff", "apple-mobile-web-app-title": "INTO", "application-name": "INTO", "msapplication-TileColor": "#000000"}, "movies": [], "publish_date": 1537305659.0, "source": "https://www.intomore.com", "summary": ""}