{"url": "https://www.bustle.com/p/jennifer-lopez-alex-rodriguez-arent-getting-married-anytime-soon-as-she-once-again-made-clear-video-13220978", "text": "Just because two people are in love and are great together doesn't mean the idea of marriage should continuously be forced upon them. For example, once again, Jennifer Lopez has said she's not marrying Alex Rodriguez — at this point in time. The marriage question is one the World of Dance judge is repeatedly asked. It's also an exhausting topic that Lopez should no longer have to discuss during every interview.\n\nDuring Thursday's The Ellen DeGeneres Show, host Ellen DeGeneres brought up Lopez's relationship with Rodriguez and the possibility of the two saying \"I do.\" DeGeneres began the conversation by telling J. Lo and referring to A-Rod, \"He said that y'all are gonna be getting married.\"\n\nThe former Shades of Blue star quickly denied that statement by declaring, \"He did not say that. He did not say that.\"\n\nThe two went back and forth a bit in a joking manner about Rodriguez's supposed declaration of marriage. But, that wasn't enough to stop DeGeneres from, once again, asking Lopez, \"So, you'll be getting married?\"\n\nThe multifaceted Lopez answered, \"I don't know. I don't know.\" DeGeneres pushed further by stating, \"You should, cuz y'all seem very happy.\" The Second Act star agreed with the latter. \"We are,\" she said. \"We've been together a couple years, it's nice.\"\n\nOf course, DeGeneres didn't stop there and said about them having a wedding, \"It would be good to do for Christmas.\"\n\nHowever, rather than giving a verbal response, Lopez reacted with the most telling facial expression. Here it is:\n\nAt this point of the marriage conversation, Lopez was still laughing and going along with DeGeneres, but it also seemed like she didn't know what else to say. It was almost like The Fosters executive producer was ready to move on to something else.\n\nWas DeGeneres mainly teasing? Yes. Is she happy for the duo and wants them to live a beautiful life together? Of course. Does she really care or is trying to force them to get married? No. The interview was all in good fun and one Lopez took extremely well. That said, it has to get old reciting the same thing over and over again about your personal relationship.\n\nAndrew Toth/Getty Images Entertainment/Getty Images\n\nIn a Harper's Bazaar interview published on March 15, Lopez once again said about getting married, \"I do believe in marriage. And I would love to grow old with somebody in a committed relationship. But I’m not forcing anything right now. It’s good, it’s healthy; we communicate well.\"\n\nThen, during a June 11 Good Morning America interview, Lopez said about marrying Rodriguez, \"We have to take our time. I've made plenty of mistakes in my past and ... we're mature now.\" She continued,\n\n\"We're grown ups and we're going to take our time and we're going to do things at our own pace. And our life right now is incredibly wonderful. Between our kids and our work we're truly blessed. We don't need anything more right now.\"\n\nHow many more times does she need to say it? They are content with the current status of their relationship. The two certainly aren't in any rush to walk down the aisle. Even if someone's just joking around with Lopez and Rodriguez about marriage, having to repeatedly field those types of questions and to reaffirm their happiness is tiring. Let's all just let them enjoy their relationship without the pressure of marriage.", "images": ["https://imgix.bustle.com/uploads/getty/2021/6/25/c1b4bd17-eddf-4561-9919-71969dd51feb-getty-510718430.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2018/11/29/7b96bc5a-caff-4ad5-bf04-82856e6edb8a-getty-675636894.jpg?w=800&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2018/11/29/9dc4cf10-1381-46c9-8b07-d7bdad7c5990-getty-1020486108.jpg?w=414&h=276&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2018/11/29/7b96bc5a-caff-4ad5-bf04-82856e6edb8a-getty-675636894.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2022/10/6/2fc4f418-53bc-46e7-8f7d-34e15f94f7fd-getty-697321408.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2022/10/5/18a81ecc-5972-4e59-ac9c-5b93b6d92ebf-getty-1238712243.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2022/9/27/85e58fc3-6324-4107-9c25-408453d16826-getty-1340178661.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/11/29/7b96bc5a-caff-4ad5-bf04-82856e6edb8a-getty-675636894.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/jennifer-lopez-alex-rodriguez-arent-getting-married-anytime-soon-as-she-once-again-made-clear-video-13220978", "title": "Jennifer Lopez & Alex Rodriguez Aren't Getting Married Anytime Soon, As She Once Again Made Clear — VIDEO", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image", "creator": "@AllysonKoerner"}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/jennifer-lopez-alex-rodriguez-arent-getting-married-anytime-soon-as-she-once-again-made-clear-video-13220978", "type": "article", "title": "Jennifer Lopez & Alex Rodriguez Aren't Getting Married Anytime Soon, As She Once Again Made Clear — VIDEO", "description": "Just because two people are in love and are great together doesn't mean the idea of marriage should continuously be forced upon them. For example, once again, Jennifer Lopez has said she's not marrying Alex Rodriguez — at this point in time. The…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/11/29/7b96bc5a-caff-4ad5-bf04-82856e6edb8a-getty-675636894.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "Just because two people are in love and are great together doesn't mean the idea of marriage should continuously be forced upon them. For example, once again, Jennifer Lopez has said she's not marrying Alex Rodriguez — at this point in time. The…"}, "movies": ["https://www.youtube.com/embed/_pgA72uGD7g"], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}