{"url": "https://www.cosmopolitan.com/entertainment/tv/a59354/spencer-and-heidi-discuss-hills-moments/", "text": "The Hills may have ended six years ago, but many of the show's best moments are eternal. You know what you did. Truth and time tells all. And of course, I wanna forgive you and I wanna forget you. In honor of the show's 10th anniversary, Heidi and Spencer Pratt walked Cosmopolitan.com through nine of the show's biggest moments, including Heidi's memorable confrontation with with Lauren Conrad at Les Deux and that \"proposal\" scene in season three.\n\n1. Season 3, Episode 1: Lauren and Heidi run into each other at Frankie's birthday party after all of the sex tape drama; Lauren utters the famous line, \"You know what you did!\"\n\nThis content is imported from Third party. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nSpencer: Lauren did not want to have any of this talked about on the show. That's why it always seems like Heidi's showing up everywhere, like, blindsiding her, because Lauren was like, \"No, I don't wanna talk about this stuff and I don't want the actual truth on the show, and if Heidi says it, they're gonna use it.\" So I think they kind of set Lauren up and then they set Heidi up and then all of a sudden it just, boom! That happened. I don't think Lauren even wanted to have that little moment and I don't think Heidi knew what she was even getting to, and then I think Audrina just threw gasoline on the fire when she was like, \"You're brainwashed, you're brainwashed!\" And then I think that just got L.C. double pumped up.\n\nHeidi: Actually, for that one, they weren't ready for it, because that was just a real moment where I came and saw Lauren, and Lauren was trying to avoid me. I think they rushed in a quick camera light.\n\nSpencer: I think that was the only time The Hills shot anything that wasn't on a tripod, because it was just like everything happened so fast.\n\n\n\nThis instance in particular was one where the show was avoiding discussing how much this was being talked about on blogs off-camera. Do you think they should have incorporated more of the real gossip that was going around at the time?\n\nSpencer: I always say that because I love the fame world, I love all those magazines, but some people — I don't know who they are, but I heard there's people on earth that aren't into the fame aspect of famous people. But my personal thing [is] you cover all this stuff and you have L.C. crying about the Perez Hilton post or whatever, and if anything, it makes the stakes way bigger. Not like, \"Oh, he told blah, blah, blah who told blah, blah, blah, and I'm mad about three people?\" It's like, no, we can get why you're mad if it's on a big site that everyone's going on ... But they were all about, \"These are just normal kids living in Hollywood.\" It's like no, this isn't what normal kids in Hollywood are like, actually.\n\n2. Season 3, Episode 2: Spencer paints a Hollywood mural on the wall of his and Heidi's apartment. Heidi is not pleased.\n\nMTV\n\nSpencer: I really liked it! I wish we could have kept it. My high-school bedroom had a graffiti mural in it and my loft in college, so it was definitely a real thing. My parents just painted over my \"good times\" mural in my high-school room this year, which I'm very angry about. Even though it was over the top, it really was true to my taste. My college loft had a huge downtown L.A. with the skyscrapers, and it was my buddy who was a famous graffiti artist who had done all three of them. It was a real. If you asked me what do I want on this wall, I really would have had that.\n\nDo you have any murals in your house now?\n\nHeidi: No. No, no, no, no, no.\n\nSpencer: Married life. Hashtag married life.\n\n3. Season 3, Episode 2: Spencer proposes to Heidi on a beach in Santa Barbara.\n\nSpencer: I just actually watched some behind-the-scenes footage that I have tapes of and I had a conversation — I will say no names because I don't know if I'm even legally allowed to say that I have footage — but in this conversation, I make it very clear, I say to them, \"Why did you edit the promise ring scene into our engagement?\" Because at the time, we were talking MTV into doing our own \"newlyweds get engaged and get married\" mini-series special that would have been, like, six episodes, that would have aired while The Hills was on a break, in between seasons. They actually stole that when they heard that that was happening, so they kinda like jacked it from us and turned a promise ring scene into an engagement ring, and it kind of snowballed from there. Technically, that was a promise ring.\n\nYeah, because you don't actually say, \"Will you marry me?\"\n\nSpencer: Yeah, I said, \"Take this promise ring,\" and they clipped that out.\n\nHeidi: I don't think Spencer ever really said, \"Will you marry me?\" in real life or on camera. I don't think that ever really happened.\n\nWere you shocked when it happened, Heidi?\n\nHeidi: No, because we were planning everything together.\n\nSpencer: Heidi paid for that ring!\n\nDid you pick it out?\n\nHeidi: Yeah, I did pick it out.\n\nSo the scene where you shop for it with Brody…\n\n[They both laugh.]\n\nSpencer: Nope.\n\nHeidi: I wish he picked it out because then he would have paid for it.\n\nSpencer: Heidi had all the cash.\n\nHeidi: No, I didn't!\n\n4. Season 3, Episode 7: Spencer and Heidi run into Lauren and Jason at Ketchup and send drinks to their table, but Lauren sends them back.\n\nThis content is imported from Third party. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nSpencer: First off, we were set up. We thought we were just going to dinner at Ketchup, because that was the new hot spot or whatever, and they set it up knowing that Lauren brought Jason there to scream at Heidi ... All of a sudden, we have this producer come up to us and say, \"Just so you know, we're not legally liable for what Jason's gonna do,\" and we're like, \"What?! Legally liable?\" They keep on saying, \"Heidi, go back over there.\" Heidi probably went over there, I don't know, five times?\n\nHeidi: Yeah.\n\nSpencer: They kept on texting Heidi, \"Lauren wants to talk to you,\" and she'd go over there and Lauren would just stare at her and they wouldn't do anything. This probably happened five times and finally they were like, \"Send her a drink or whatever.\" We were just literally going off whatever our BBMs were saying to do, and then they sent [the drinks] back, and then the producers said, \"What's gonna happen, we're not legally liable for what Jason does.\" So we're like, \"We're outta here.\" He was, like, punching the air and acting all wild in the corner, so we just jumped in a taxi and they were like, \"No, you can't leave yet.\" So whatever was supposed to happen that night that was all planned that Lauren brought in Jason to do to us or whatever, they didn't get to do it because one producer actually was pretty much like, \"You should get out of here.\"\n\n\n\n5. Season 3, Episode 14: Heidi goes over to Lauren's apartment in an attempt to make amends. Lauren rebuffs her with the immortal line, \"I wanna forgive you and I wanna forget you.\"\n\nThis content is imported from Third party. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nHeidi: What people don't realize is how hard and how much courage it took me to even do that. I kept getting thrown under the bus over and over, and I knew that I was gonna come off as a bad friend, because it was her show and I already knew what she was saying in the storyline, and then to have all the cast and all the crew and everyone against you, and then knowing that Lauren could just sit there on her high horse and look down on me and be like, \"No, I'm not taking your apology\" was really hard. And it was really hard to continue to do that over and over, so I had a feeling that was gonna happen. But honestly that was my best friend for a long time, and I thought, You know what, no matter what I owe it to her and myself just to try one more time, so it was like the ultimate rejection on a very challenging and emotional level, especially for something I really had nothing to do with. It was very hurtful and hard for me.\n\nRewatching it now, you seem very genuinely invested in repairing the friendship.\n\nHeidi: It was very one-sided, which was hard too. She didn't care at all and it was really hard for me to go in there knowing what was gonna happen and knowing how she was gonna treat me and I cared. That was really my best friend ... It was heartbreaking for me to have to go through that and not to have anyone back me up with her. I think that if other people had encouraged her more like, \"Look, this really is your best friend, you guys really should try to work it out on- or off-camera, like just in real life,\" but no one was doing that. Everyone was just capitalizing on the breakup of our friendship, and other cast members wanted to be her new best friend and hang out with her, so we just had nobody trying to help us repair a real relationship.\n\n6. Season 4, Episode 19: Spencer and Heidi elope in Mexico.\n\nHeidi: Spencer planned the trip, and I didn't really know what was going on. I was like, \"OK, it's for Us Weekly.\" This was off-camera ... I was like, \"Is this for real or for fake, are you really trying to marry me? Like what is going on?\" Spencer was like, \"No, I really do wanna marry you.\" I was very confused myself. And then when we got there, we wrote our vows. That is our wedding anniversary we actually do celebrate. To me that was the most meaningful.\n\nYou celebrate that one instead of the wedding that was on TV?\n\nSpencer: We celebrate them all. It's a few months earlier, but that's definitely my favorite one. When The Hills found out that we eloped and it wasn't on camera, they called screaming at us and so they were like, \"You're gonna have to redo all this.\" Then they flew us back to Cabo and we had to fake one. The first [trip to Cabo San Lucas] was the one that Us Weekly had [on] the cover. That was the real elopement where we really got married in a church. They didn't even do that on the fake one because they were like, \"No we wanna have a wedding back in L.A. with the cast.\" We had a real wedding on the first [trip] at the Palmilla in Cabo at their chapel on the property.\n\n7. Season 4, Episode 20: Heidi and Spencer go to the courthouse to make it legal, but Spencer backs out at the last minute so Heidi can have her dream wedding.\n\nSpencer: That was a real judge.\n\nHeidi: They told us, \"Legally you have to go in there with the intention that you're gonna do it, but Heidi, you can change your mind in there.\" Because it's illegal to fake a court. It's this whole weird thing. So we're like, \"OK, don't get us in trouble or anything!\" But we never had any intention of making it legal there because the whole storyline was to have the real wedding and go through the steps and blah, blah, blah.\n\n\n\nIt's such an emotional scene though!\n\nHeidi: I was thinking about going to jail! They were like, \"You have to really convince the judge or else this is illegal.\"\n\nSpencer: Heidi really did want a big wedding. That was real. She wasn't very thrilled with our Cabo one.\n\nHeidi: Yeah, I was like, \"Uh, my parents are gonna be really upset,\" and I've dreamed of a big wedding my whole life so I'm definitely gonna get that.\n\n8. Season 5, Episode 9: Spencer calls Lauren to apologize and ask her to come to the wedding. Lauren has said this phone call never happened.\n\nSpencer: I would love to know how much they paid her bonus-wise just to go to the wedding. But that was part of the deal she made with the producers, that I needed to call and apologize to her. At this stage, whatever I got on my BBMs is what I did to get my check, so I had so many fake calls with so many people. It was nothing to me. But yeah, I wasn't talking to her, I was talking to some producer and I was reading a script of exactly what they wanted me to say, that she probably typed. So thank you, Lauren, for telling the truth that I didn't have to apologize for something I didn't do ... I bet our wedding to this day is her biggest appearance fee she's ever gotten or will get in her whole life. I would love to know. I bet they gave her a million dollars to go to our wedding.\n\n9. Season 5, Episode 10: Heidi finally gets the big wedding she's always wanted.\n\nThis content is imported from Third party. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nHeidi: The part that I was obviously the most concerned with was my dress, and I loved that Monique Lhuillier, I thought she did such a good job. It was beautiful, one of a kind. But I was also unhappy with our family and all the drama that was surrounding us with that and the producers, so even though it was a great day and I really was happy to be married to Spencer, there was just so much off-camera drama that it put a bad taste in my mouth as well.\n\nWhen you're planning a wedding that's going to air on TV, do you still get to have a lot of say in the decor and the venue?\n\nHeidi: Not the venue, that was another issue. We did not want it in Pasadena because we weren't over there. We wanted the West Side or Malibu or somewhere outdoors or beautiful, but they had one church that they could clear, so we were not able to choose where the wedding was. But for other details … my mom really did a lot of that planning because I was so torn between \"this is just a TV wedding\" and \"it is my real wedding\" that I was kind of indecisive about it. I was just so confused as well so I halfway did it. But looking back, I wish I would have been a little bit more involved with certain aspects of it, because it was my one big wedding of my life and I don't think I really realized it.\n\nFollow Eliza on Twitter.", "images": ["https://hips.hearstapps.com/cos.h-cdn.co/assets/16/22/2560x1280/landscape-1464953232-spencer-heidi.jpg?resize=1200:*", "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/22/2560x1706/gallery-1464953232-spencer-heidi.jpg?resize=480:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/22/2560x1280/landscape-1464953232-spencer-heidi.jpg?resize=1200:*", "keywords": [], "authors": ["Eliza Thompson", "Senior Entertainment Editor", "I M The Senior Entertainment Editor At Cosmopolitan.Com", "Which Means My Dvr Is Always Percent Full."], "canonical_link": "https://www.cosmopolitan.com/entertainment/tv/a59354/spencer-and-heidi-discuss-hills-moments/", "title": "Heidi and Spencer Pratt Reveal the Secrets Behind 9 Memorable Hills Scenes", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=6", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "Heidi and Spencer Pratt Reveal the Secrets Behind 9 Memorable \"Hills\" Scenes", "description": "He really did love that Hollywood mural.", "url": "https://www.cosmopolitan.com/entertainment/tv/a59354/spencer-and-heidi-discuss-hills-moments/", "image": {"identifier": "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/22/2560x1280/landscape-1464953232-spencer-heidi.jpg?resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2021-11-01T23:55:32Z", "published_time": "2016-06-03T19:14:00Z", "section": "TV", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/22/2560x1280/landscape-1464953232-spencer-heidi.jpg?resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Heidi and Spencer Pratt Reveal the Secrets Behind 9 Memorable Hills Scenes", "description": "He really did love that Hollywood mural.", "keywords": "spencer pratt,heidi montag,the hills", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/22/1600x1600/square-1464953232-spencer-heidi.jpg?resize=320:*", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrities & Entertainment,entertainment,tv,The HIlls,Spencer Pratt,Heidi Montag", "sailthru.date": "2016-06-03T19:14:00Z", "sailthru.image.full": "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/22/2560x1280/landscape-1464953232-spencer-heidi.jpg", "sailthru.image.thumb": "https://hips.hearstapps.com/cos.h-cdn.co/assets/16/22/1600x1600/square-1464953232-spencer-heidi.jpg", "sailthru.socialtitle": "Heidi and Spencer Pratt Reveal the Secrets Behind 9 Memorable \"Hills\" Scenes", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1464981240.0, "source": "https://www.cosmopolitan.com", "summary": ""}