{"url": "https://www.celebritynetworth.com/richest-businessmen/business-executives/greg-leakes-net-worth/", "text": "What was Gregg Leakes' Net Worth?\n\nGregg Leakes was an American real estate investor and reality television personality who had a net worth of $4 million at the time of his death. Leakes acquired that net worth thanks to more than twenty years' experience investing in the real estate market of Atlanta, Georgia.\n\nGregg was born Gregory Leon Leakes on August 18, 1954 in Atlanta, Georgia. He died on September 1st, 2021 at the age of 66 after a battle with colon cancer.\n\nGregg became known thanks to his relationship with reality television star NeNe Leakes. NeNe was one of the stars of the Bravo reality TV series \"The Real Housewives of Atlanta\" from 2008 to 2020 (with the exception of season nine). Gregg, who has been married to NeNe twice, appeared on the series from 2008 to 2013 and again from 2018 to 2019.\n\nCareer\n\nLeakes is a self-taught businessman who has worked as a real estate investor and consultant. NeNe was cast on \"The Real Housewives of Atlanta\" in 2008, and over several seasons, audiences witnessed the ups and downs of the Leakes' marriage and saw how the couple dealt with Gregg's 2018 cancer diagnosis. In September 2020, NeNe announced that she was leaving the show. Leakes has appeared on more than 40 episodes of \"The Real Housewives of Atlanta,\" and in 2017, Gregg and NeNe competed on \"MasterChef Celebrity Showdown,\" losing to Grace Gealey and Trai Byers from the Fox series \"Empire\" in the tag team challenge. Leakes has also appeared on \"Watch What Happens: Live,\" \"The Wendy Williams Show,\" \"Bethenny,\" and \"The Arsenio Hall Show.\"\n\nPersonal Life\n\nGregg met Linnethia \"NeNe\" Johnson in 1996 when NeNe was working as an exotic dancer in Atlanta. They married in 1997 and welcomed son Brentt on February 22, 1999, then divorced in 2011. Gregg and NeNe reconciled the following year, and Leakes proposed again on January 1, 2013. The couple remarried on June 22, 2013, at Atlanta's InterContinental Buckhead Hotel, and the nuptials were documented for the seven-episode special \"I Dream of NeNe: The Wedding,\" which aired on Bravo in September 2013. Leakes is stepfather to NeNe's son Bryson (born December 1989) and has five children from previous relationships: Daryl (born September 1976), Damian (born September 1977), Katrina (born September 1982), Dexter (born April 1985), and Denton (born January 1990).\n\nIn June 2018, Leakes was diagnosed with stage 3 colon cancer and underwent chemotherapy after initially trying holistic remedies, such as alkaline water and a vegan diet. His illness took a toll on his marriage, and Gregg and NeNe began sleeping in seperate bedrooms. He later wrote on Instagram \"I'm tired of hurting my wife who is only trying to take good care of me and wants only the best for me too. She deserves much more for her hard efforts and tireless hours spent on me. I Pray to God to get it together…She's done NO wrong… this is ALL on me……Cancer WILL change your Life.\" Luckily, Leakes has been cancer-free since May 2019. Gregg and NeNe became American Cancer Society Ambassadors in early 2019, and during his battle with cancer, Leakes launched the website can-sir.org, which sold merchandise that benefited the American Cancer Society.\n\nReal Estate\n\nIn 2015, NeNe and Gregg purchased a $2.1 million mansion in the Duluth area of Atlanta. The 10,000 square foot home includes six bedrooms, seven bathrooms, marble floors, and a swimming pool surrounded by fountains. In December 2008, it was reported that the Leakes were evicted from a Duluth home that they had moved into two years earlier. The eviction notice was filed because the couple owed $6,240 in past rent.", "images": ["https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/wp-content/uploads/2010/11/Gregg-Leakes.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2010/11/Gregg-Leakes.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-businessmen/business-executives/greg-leakes-net-worth/", "title": "Gregg Leakes Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Gregg Leakes net worth: Gregg Leakes is an American real estate investor and consultant who has a net worth of", "cnw_share_fb_count": 51, "cnw_share_tw_count": 25, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Gregg Leakes Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-businessmen/business-executives/greg-leakes-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/11/Gregg-Leakes.jpg", "site_name": "Celebrity Net Worth", "description": "Gregg Leakes net worth: Gregg Leakes is an American real estate investor and consultant who has a net worth of"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2021-09-01T20:12:43+00:00", "published_time": "2020-12-30T03:24:49+00:00", "section": "Executives", "tag": "real housewives of atlanta"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/11/Gregg-Leakes.jpg", "title": "Gregg Leakes Net Worth", "description": "Gregg Leakes net worth: Gregg Leakes is an American real estate investor and consultant who has a net worth of"}}, "movies": [], "publish_date": 1609298689.0, "source": "https://www.celebritynetworth.com", "summary": ""}