{"url": "https://en.wikipedia.org/wiki/Sarah_Michelle_Gellar", "text": "American actress\n\nSarah Michelle Prinze[2] (née Gellar GHEL-ər; born April 14, 1977[3]) is an American actress, producer, and entrepreneur. After being spotted at the age of four in New York City, she made her screen acting debut in the television film An Invasion of Privacy (1983). A leading role on the teen drama series Swans Crossing (1992) was followed by her role as Kendall Hart on the ABC daytime soap opera All My Children (1993–1995), for which she won the Daytime Emmy Award for Outstanding Younger Actress in a Drama Series.\n\nGellar received international recognition for her portrayal of Buffy Summers on the WB/UPN television series Buffy the Vampire Slayer (1997–2003), which earned her five Teen Choice Awards, a Saturn Award, and a Golden Globe Award nomination.[4][5] In film, her most commercially successful performances include I Know What You Did Last Summer (1997), Scream 2 (1997), Cruel Intentions (1999), Scooby-Doo (2002) and Scooby-Doo 2: Monsters Unleashed (2004), The Grudge (2004) and TMNT (2007).[6] She has also appeared in various independent films such as Southland Tales (2006), The Air I Breathe (2007), and Veronika Decides to Die (2009).\n\nSince 2009, Gellar has occasionally ventured back into television, headlining the CW drama thriller series Ringer (2011–2012) and the CBS comedy The Crazy Ones (2013–2014), and providing her voice for the Netflix animated series Masters of the Universe: Revelation (since 2021). In 2015, Gellar, along with Galit Laibow and Greg Fleishman, founded Foodstirs, an e-commerce startup selling baking kits,[7] and in 2017, she released her own cookbook, Stirring Up Fun with Food.\n\nEarly life\n\nGellar was born on Long Island, New York. She is the only child of Rosellen (née Greenfield), a nursery school teacher, and Arthur Gellar, a garment worker.[8][9] Both of her parents are Jewish, though Gellar's family also had a Christmas tree during her childhood.[10][11] In 1984, when she was seven, her parents divorced and she was raised by her mother on Manhattan's Upper East Side.[12] While growing up with her mother, she lost contact with her father, from whom she remained estranged until his death in 2001;[13][14][15] she once described him as \"non-existent\",[16] and in the early 2000s, she stated: \"My father, you can just say, is not in the picture. I'm not being deliberately evasive about him, it's just that there's so little to say.\"[15][17][18] Besides being a working child at the time, Gellar was a competitive figure skater, once finishing in third place at a New York State regional competition,[2] as well as having a black belt in taekwondo.[2]\n\nGellar was given a partial scholarship to study at the Columbia Grammar & Preparatory School,[2][19] as her mother was not able to pay full tuition, for which she was constantly bullied.[20] She said in an interview with The Independent: \"I was different and that's the one thing you can't be at school, because you're ostracised. I didn't have the money these kids had\".[21] Gellar was not present in class for most of the time at the school as she had to work in several acting projects simultaneously, recalling that she \"had more absences in the first month than you're supposed to have for an entire year. I was telling them that I had back problems and had to go to the doctor the whole time\".[2] Gellar then briefly attended the Fiorello H. LaGuardia High School of Music & Art and Performing Arts, but dropped out due to acting obligations; the teachers threatened to fail her because of her constant absence from classes as she was busy going to auditions, despite earning good grades.[2] Gellar graduated from the Professional Children's School[2][22][23] in 1994 as a \"straight A\" student with a 4.0 grade average.[24][25][26] As Gellar spent significant time working on All My Children while \"trying to graduate\",[27] the majority of her senior year was completed through guided study.[28]\n\nCareer\n\n1980s\n\nAt the age of four, she was spotted by an agent in a restaurant in Upper Manhattan.[29] Two weeks later, she auditioned for a part in the television film An Invasion of Privacy. At the audition, Gellar read both her own lines and those of Harper, impressing the directors enough to cast her in the role.[2] The film aired on CBS in January 1983.[30] She subsequently appeared in a controversial television commercial for Burger King, in which her character criticized McDonald's and claimed to eat only at Burger King.[31] The ad led to a lawsuit by McDonald's, naming Gellar and banning her from eating at the food chain;[32][33] she recalled in a 2004 interview: \"I wasn't allowed to eat there. It was tough because, when you're a little kid, McDonald's is where all your friends have their birthday parties, so I missed out on a lot of apple pies.\"[34][35] While growing up, Gellar also worked as a model for Wilhelmina and acted in numerous television commercials.[2][36]\n\nDuring the 1980s, Gellar played minor roles in the films Over the Brooklyn Bridge (1984), Funny Farm (1988) and High Stakes (1989),[37][38][39] and also guest starred in various television series, such as Spenser: For Hire and Crossbow. At the age of nine, she appeared in the off-Broadway production The Widow Claire.[2][40][41] She appeared in the Kids Klassics Sing Along videos Camp Melody and USS Songboat in 1986 and served briefly as a co-host of the teen girl talk show Girl Talk, which aired in 1989.[42]\n\n1990s\n\nIn 1991, she was cast as a young Jacqueline Bouvier in A Woman Named Jackie. The miniseries won the Emmy Award for Outstanding Limited Series. Gellar next took on the leading role in the 1992 syndicated teen serial Swans Crossing, which chronicled the lives of a group of wealthy teenagers. The series ran for one season and earned Gellar two Young Artist Award nominations, for Best Young Actress in a New Television Series and for Best Young Actress in an Off-Primetime Series.[43] She made her debut in the soap opera All My Children in 1993, playing Kendall Hart, the long-lost teenage daughter of character Erica Kane (Susan Lucci). As she got the role, Gellar was complimented as having the acting talent and the \"forceful personality\" needed to go up against Lucci's experience; Kendall was supposed to be like a younger version of Erica.[44] Her stint on the show was successful as \"longtime fans of the soap saw her as the second coming of Erica\".[45] Writers showcased her more after her initial reception and she became a household name to the soap opera medium.[45] In 1995, at the age of eighteen, she won a Daytime Emmy Award for Outstanding Younger Actress in a Drama Series for the role.[46] The same year, Gellar left the show to pursue other acting opportunities.[47][48]\n\nGellar moved to Los Angeles following her departure from All My Children, and in 1996, she read the script for Joss Whedon's television series Buffy the Vampire Slayer, which follows Buffy Summers, a teenager burdened with the responsibility of fighting occult foes and supernatural occurrences. She screen tested several times originally for the role of Cordelia Chase,[49] but after approaching Whedon and producers about playing Buffy Summers, she auditioned again and was eventually cast in the title role.[2][50] The show premiered in March 1997, to widespread critical and popular acclaim,[51] and Gellar's Buffy, created to subvert the stereotypical female horror movie victim,[52] was described by Entertainment Weekly as one of the 100 greatest female characters in U.S. television.[4][5] Buffy ran for seven seasons and 144 episodes,[53] and during its broadcast, earned Gellar five Teen Choice Awards, the Saturn Award for Best Genre Television Actress and a Golden Globe Award nomination for Best Actress – Television Series Drama.[54] She sang during the series' musical episode \"Once More, with Feeling\", which spawned an original cast album, released in 2002.[55][56]\n\nDuring the early airing of Buffy the Vampire Slayer, Gellar made her first major film appearances in two successful slasher films. In I Know What You Did Last Summer, she took on the role of an ill-fated aspiring beauty actress Helen Shivers.[57] Budgeted at US$17 million, the movie made US$125 million globally.[58][59][60] Washington Post found the cast to be \"solid\",[61] in what San Francisco Chronicle described as a \"competent but uninspired\" film.[57] For her part, Gellar earned a Blockbuster Entertainment Award for Favorite Supporting Actress – Horror and a MTV Movie Award nomination for Best Breakthrough Performance.[62][63] In Scream 2 (also 1997),[64] Gellar played a likewise ill-fated vain character, this time that of a Sorority sister. She filmed her scenes in between shots of Buffy and had only recently finished work on I Know What You Did Last Summer. Despite the hectic scheduling, she agreed to perform in Scream 2 without having read the script, on the basis of the success of the first film.[65] Scream 2 grossed over US$172 million worldwide.[66][67]\n\nIn 1998, Gellar hosted for the first time Saturday Night Live,[68] and provided the voice of the Gwendy Doll in Small Soldiers, a moderate commercial success.[69][70] Gellar also had her first appearance on the 'Most Beautiful' list by People magazine, which cemented her \"It girl\" status at the time.[27] In 1999, she had a cameo appearance in the sleeper hit She's All That,[71] and took on the lead role of a struggling restaurant owner in the critically panned romantic comedy Simply Irresistible.[72][73] Gellar once called it a \"bad choice\",[74] but Roger Ebert, on the other hand, found her to be \"lovely\" in what he described as an \"old-fashioned\" comedy.[75] In Cruel Intentions (1999), a modern-day retelling of Les Liaisons dangereuses, Gellar played Kathryn Merteuil, a brunette cocaine addict with an appetite for manipulating people.[76] The US$10 million film was a hit at the box office, grossing US$75 million worldwide.[77][78][79][80][81][82] Roger Ebert felt that she is \"effective as a bright girl who knows exactly how to use her act as a tramp\",[83] and in an interview with Chicago Tribune, director Roger Kumble, describing her work in the movie, said: \"She unquestionably is the most professional actor I ever worked with\".[2] Gellar and co-star Selma Blair obtained the \"Best Kiss\" award at the 2000 MTV Movie Awards.[84][85][86] Around that time, she guest starred in three episodes of Angel and appeared as Debbie in the HBO series Sex and the City episode \"Escape from New York\".\n\n2000s\n\nGellar played the daughter of a mobster in James Toback's independent drama Harvard Man,[87] which premiered at the 2001 Cannes Film Festival.[88] While the film found a limited release in theaters,[89] Gellar's performance in it, along with Cruel Intentions, helped her shed her good girl image.[90] Gellar portrayed Daphne Blake in the live action–comedy Scooby-Doo, directed by Raja Gosnell. Scooby-Doo made over US$275 million[91] and became Gellar's most widely seen film to date.[6][92] She won the Teen Choice Award in the category of Choice Movie Actress – Comedy for her part in the picture.[93] Alongside Jack Black, she hosted the 2002 MTV Movie Awards, which attracted 7.1 million viewers on its June 6 broadcast, achieving the show's highest rating ever at the time.[94][95]\n\nDuring her growing film career, Gellar continued work on the television series Buffy the Vampire Slayer, but she left the show after the seventh season. When asked why, she explained, \"This isn't about leaving for a career in movies, or in theater – it's more of a personal decision. I need a rest.\"[96][97][98][99] In her feature in Esquire magazine, Gellar expressed her pride for her work on Buffy, \"I truly believe that it is one of the greatest shows of all time and it will go down in history as that. And I don't feel that that is a cocky statement. We changed the way that people looked at television.\"[100]\n\nGellar in 2004\n\nAfter the end of Buffy the Vampire Slayer, Gellar provided her voice for the character Gina Vendetti in The Simpsons episode \"The Wandering Juvie\", which aired in March 2004. Her next film was Scooby-Doo 2: Monsters Unleashed (2004), reprising the role of Daphne.[101] While IGN felt that Gellar exhibited \"marked [improvement] over [her] work in [2002's Scooby-Doo]\",[102] the film was a commercial success, grossing US$181.4 million around the globe.[103] In the horror remake The Grudge (also 2004), Gellar portrayed Karen Davis, an exchange student living and working in Tokyo who becomes exposed to a mysterious supernatural curse. Critic Rob Blackwelder wrote that she \"played her part well, and her fear and disorientation are terrifically enhanced by the decision to keep the [original] setting in this remake\".[104] The film was a major box office hit,[105][106] grossing more than US$110 million in the US, and US$187 million worldwide.[107][108][109] She received a MTV Movie Award nomination for Best Frightened Performance as well as a nomination for the Teen Choice Award for Choice Movie Actress – Thriller for her role.[110] Since 2005, she has voiced several characters in 13 episodes of the animated television series Robot Chicken, as of 2018.\n\nGellar starred in Richard Kelly's Southland Tales (2006) as an adult film star working on creating a reality television show. Gellar had met with Kelly and was drawn to the original ideas for the movie, accepting the role before she even read the script.[111][112][113][114] The film found a limited audience in theaters,[115] but J. Hoberman for Village Voice remarked that the director \"contrives two memorable comic performances\", one of them Gellar's. In 2006, Gellar also briefly reprised her role of Karen in the critically panned sequel The Grudge 2,[116][117][118] and starred in the psychological thriller The Return, as a businesswoman haunted by memories of her childhood and the mysterious death of a young woman.[119] The film was a critical and commercial failure, grossing only US$11 million.[120][121] The New York Times called it a \"career stagnation\".[122]\n\nGellar in 2007\n\nIn 2007, Gellar voiced Ella in the poorly received animated film Happily N'Ever After,[123] and also April O'Neil in TMNT, which made US$95 million.[124][125] She starred in the romantic comedy Suburban Girl and the drama The Air I Breathe, both of which were screened at the 2007 Tribeca Film Festival.[126] In Suburban Girl, she took the role of a New York City editor and the love interest of a much older influential man. The film was released for DVD in January 2008.[127] In the likewise little-seen film The Air I Breathe, Gellar portrayed an up-and-coming pop singer.[128][129] The New York Times called it a \"gangster movie with delusions of grandeur\",[130] while DVD Talk noted that \"her character here has the deepest emotional arc, and she hits all the right notes.\"[131]\n\nIn 2009, Gellar starred in the psychological thriller Possession as a lawyer whose life is thrown into chaos after a car accident sends her husband and brother-in-law into comas. Due to financial problems at Yari Film Group,[132][133][134] the film went to DVD in March 2010.[135] In the film adaptation Veronika Decides to Die,[136][137] Gellar starred as a young depressed woman who rediscovers the joy in life when she finds out that she only has days to live following a suicide attempt. Like Possession, the film failed to find a proper release in North American theaters, and was released for VOD in 2015.[138][139][140][141] Frank Scheck of The Hollywood Reporter found the actress to be \"reasonably compelling\" in what he called a \"ponderous and silly misfire\".[142]\n\n2010s\n\nGellar took a two-year hiatus from acting following the birth of her daughter in 2009, and in 2011, she signed to star and work as executive producer for a new drama titled Ringer, in which she played the dual role of twin sisters, one of whom is on the run and manages to hide by assuming the wealthy life of the other. Gellar has stated that part of her decision to return to a television series was because it allowed her to both work and raise her child.[143][144][145] The series received positive reviews from critics;[146] E! Online found her to be \"awesome\" and \"fantastic\",[147] while TV Line felt she \"does a fine job\" as both characters.[148] Ringer went on to have a large fan base,[149][150] but it was canceled after the first season.[151] For her portrayal, she received several award nominations, including one for the Teen Choice Award for Choice Television Actress – Drama.[152][153]\n\nIn September 2011, Gellar returned as a guest star on the ABC soap opera All My Children before the show's ending but not as Kendall Hart;[154] she portrayed a patient at Pine Valley Hospital who tells Maria Santos that she is \"Erica Kane's daughter\", and states that she saw vampires before they became trendy—a reference to Buffy the Vampire Slayer. She voiced a character in the American Dad! episode \"Virtual In-Stanity\",[155][156] and again for the December 6, 2012, episode (\"Adventures in Hayleysitting\").[157] On September 30, 2012, she reprised her role of Gina Vendetti in the premiere episode of The Simpsons' season 24.[158][159]\n\nA fan of Robin Williams for years, once Gellar learned that he was making the single-camera television series The Crazy Ones, she contacted her friend Sarah de Sa Rego, the wife of Williams' best friend, Bobcat Goldthwait, in order to lobby for a co-starring role.[160] She obtained the part of an advertising director who runs an agency with her father.[161][162] Digital Spy felt that Williams \"shares a warm, genuine chemistry with his on-screen offspring Gellar,\"[163] as part of a mixed critical response.[164] The series was canceled after one season[165][166] but earned Gellar the People's Choice Award for Favorite Actress in a New Television Series.[167]\n\nIn March 2015, Gellar guest-starred as Cinderella in Whitney Avalon's official YouTube channel video short Princess Rap Battle,[168] and joined the cast of Star Wars Rebels for season two,[169] playing a recurring character known as the Seventh Sister.[170] In early 2016, Gellar filmed for NBC a pilot presentation for a potential television series based on the cult-classic film, Cruel Intentions, reprising her role of Kathryn Merteuil. The pilot was ultimately not picked up to series.[171][172]\n\nOn January 10, 2019, it was announced Gellar would appear in the limited series Sometimes I Lie, based on the best-selling book of the same name. The series would be produced by Gellar and others in association with Warner Bros. Television.[173]\n\nOn May 16, 2019, Gellar appeared in the series finale of The Big Bang Theory.[174] On August 22, 2019, Gellar was attached to produce and appear in a pilot for Fox titled Other People's Houses.[175][176]\n\n2020s\n\nIn February 2020, Gellar joined the main voice cast of Kevin Smith's Masters of the Universe: Revelation animated series for Netflix in the role of Teela.[177][178] On March 31, 2021, it was announced that Gellar had been cast in comedy pilot Hot Pink from Amazon Studios.[179] She also had a cameo role in Smith's film Clerks III (2022).[180] At the 2022 San Diego Comic-Con, it was announced that Gellar had joined the cast of the upcoming Paramount+ series, Wolf Pack, which is a spin-off of Teen Wolf.[181]\n\nPublic image\n\nGellar has appeared on the covers and photo sessions of numerous magazines during her career. In February 1998, she appeared in Seventeen,[182] and in subsequent years the list has grown to include Nylon, Marie Claire, Vogue, Glamour, Esquire, Allure, Cosmopolitan, FHM, Rolling Stone and Elle among others.[183][184][185][186] In 1999, Gellar signed on to be the face of Maybelline – becoming the company's first celebrity spokeswoman since Lynda Carter in the late 1970s.[187][188] She was honored with a Woman of The Year Award by Glamour magazine in October 2002,[189] and in the same year, her wax figure by Madame Tussauds, was unveiled as part of the \"Trail of Vampires\" exhibition.[190]\n\nWith her work in Buffy and mainstream films such as Cruel Intentions, Gellar became a household name and a sex symbol across the globe, status she cemented with being a feature several times in the annual Maxim \"Hot 100\" list between 2002 and 2008.[191][192][193][194] Wearing a black lace bra, she was on the cover of the December 2007 issue of Maxim and was named the 2009 Woman of the Year by the magazine.[195] She was voted number 1 in FHM's edition of \"100 Sexiest Women\" of 1999, and was featured in its 2005 list.[196] She had also been in the magazine's German, Dutch, South African, Danish and Romanian editions of the 100 Sexiest Women list every year from 1998 onwards.[197] Topsocialite.com listed her as the 8th Sexiest woman of the 1990s.[198]\n\nShe was featured in Google's Top 10 Women Searches of 2002 and 2003, coming in at No. 8,[199] and was included in UK Channel 4's 100 Greatest Sex Symbols in 2007, ranking at No. 16.[200] Other appearances and listings include: Entertainment Weekly ranked her in its Top 100 TV Icons in 2007, and placed her No. 3 in its Top 12 Entertainers of the Year in 1998, and Glamour ranked her in its 50 Best Dressed Women in the World 2004 and 2005 at Nos. 17 and 24, respectively.[197] BuddyTV ranked her No. 27 on TV's 100 Sexiest Women of 2011 list, as well.[201]\n\nShe has appeared in \"Got Milk?\" ads as well as in the Stone Temple Pilots music video \"Sour Girl\" and Marcy Playground's \"Comin' Up From Behind\".[202][203] Gellar was featured on the cover of Gotham and their main story in the March 2008 issue, in which she spoke about how her style has evolved since she passed 30. Gellar said: \"It sounds clichéd, but when women turn 30, they find themselves. You become more comfortable in your own skin. Last night on Letterman, I wore this skintight Herve Leger dress. Two years ago, three years ago? I would never have worn it.\"[204]\n\nOther endeavors\n\nCharitable activities\n\nGellar is an active advocate for various charities, including breast cancer research, Project Angel Food, Habitat for Humanity and CARE. Of her charitable pursuits, she says, \"I started because my mother taught me a long time ago that even when you have nothing, there's ways to give back. And what you get in return for that is tenfold. But it was always hard because I couldn't do a lot. I couldn't do much more than just donate money when I was on [Buffy] because there wasn't time. And now that I have the time, it's amazing.\"[205]\n\nIn 1999, she went to the Dominican Republic to help Habitat for Humanity's project of building homes for the residents;[2] Gellar recalled in an interview she had worked with the cause a lot, explaining: \"You actually get to physically do something, where you get to go and build these houses. I like working with things where you can directly affect someone in particular\".[205] With Project Angel Food, she delivered healthy meals to people infected with AIDS, and through the Make-A-Wish Foundation, she granted sick children's wishes of meeting her while working on Buffy.[205] In 2007, Gellar was featured in Vaseline's \"Skin Is Amazing\" campaign.[206] She agreed to auction nude-posed photos of herself on eBay to raise money for the Coalition of Skin Diseases, an organization which supports clinical research, fosters physician and patient education.[207][208]\n\nIn May 2011, Gellar joined \"The Nestlé Share the Joy of Reading Program\", which promotes reading to young children to encourage them to read during the summer break.[209][210] The following year, she was presented with the Tom Mankiewicz Leadership Award during the Beastly Ball at the Los Angeles Zoo.[211] The honor recognizes members of the entertainment community who have excelled in establishing meaningful and lasting programs that contribute to the welfare of the world's natural and civic environment.[212] In 2014 and 2015, Gellar hosted two fundraisers for Mattel Children's Hospital UCLA.[213][214]\n\nFoodstirs\n\nIn October 2015, Gellar, along with entrepreneurs Galit Laibow and Greg Fleishman, co-founded Foodstirs, a startup food crafting brand selling via e-commerce and retail easy-to-make organic baking mixes and kits for families.[7] By the beginning of 2017, the brand's products were available in about 400 stores; by the end of the year a surge of interest from retailers increased its distribution to 8,000 stores. In 2018, Foodstirs entered into a deal with Starbucks to carry its mug cake mixes across 8,000 of its stores.[215]\n\nCook book\n\nGellar released a cook book titled Stirring up Fun with Food on April 18, 2017. The book was co-authored by Gia Russo, and features numerous food crafting ideas.[216]\n\nPersonal life\n\nGellar met her future husband, Freddie Prinze Jr., while they were filming the 1997 teen horror film I Know What You Did Last Summer,[217] but the two did not begin dating until 2000. They were engaged in April 2001 and married in Mexico on September 1, 2002,[218] in a ceremony officiated by Adam Shankman, a director and choreographer with whom Gellar had worked on Buffy the Vampire Slayer.\n\nPrinze and Gellar have worked together several times; they played each other's respective love interests as Fred and Daphne in the 2002 film Scooby-Doo and its sequel, Scooby-Doo 2: Monsters Unleashed, and both provided their voices for the animated feature film Happily N'Ever After (2007) and the animated science fiction series Star Wars Rebels.[219] In 2007, in honor of their fifth year of marriage, Gellar legally changed her name to Sarah Michelle Prinze.[2]\n\nTogether, Gellar and Prinze have two children, a daughter born in 2009 and a son born in 2012.[220][221] The family lives in Los Angeles.[222]\n\nOn February 10, 2021, Gellar expressed support for her Buffy the Vampire Slayer co-star Charisma Carpenter after Carpenter made allegations of abuse against series creator Joss Whedon. She also stated, \"While I am proud to have my name associated with Buffy Summers, I don't want to be forever associated with the name Joss Whedon.\"[223]\n\nFilmography\n\nFilm\n\nTelevision\n\nOther works\n\nAwards and nominations", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Sarah_Michelle_Gellar.jpg/170px-Sarah_Michelle_Gellar.jpg", "https://upload.wikimedia.org/wikipedia/commons/8/88/Sarah_Michelle_Gellar_2011_Comic_Con_2_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Sarah_Michelle_Gellar_2007_2%2C_%28Cropped%29.jpg/220px-Sarah_Michelle_Gellar_2007_2%2C_%28Cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/13px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/32/Freddie_Prinze_Jr_and_Sarah_Michelle_Gellar_by_David_Shankbone.jpg/170px-Freddie_Prinze_Jr_and_Sarah_Michelle_Gellar_by_David_Shankbone.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Sarah_Michelle_Gellar_2011_Comic_Con_2_%28cropped%29.jpg/220px-Sarah_Michelle_Gellar_2011_Comic_Con_2_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/8/88/Sarah_Michelle_Gellar_2011_Comic_Con_2_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Sarah_Michelle_Gellar", "title": "Sarah Michelle Gellar", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Sarah_Michelle_Gellar_2011_Comic_Con_2_%28cropped%29.jpg/640px-Sarah_Michelle_Gellar_2011_Comic_Con_2_%28cropped%29.jpg", "width": 640, "height": 825}, "title": "Sarah Michelle Gellar - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}