{"url": "https://www.cnn.com/2018/03/08/europe/meghan-markle-baptized-intl/index.html", "text": "London CNN —\n\nMeghan Markle is now a fully fledged member of the Church of England after the American actor was reportedly baptized and confirmed in a secret ceremony at St James’s Palace in London this week.\n\nArchbishop of Canterbury Justin Welby administered the holy sacrament in a 45-minute service on Tuesday evening at the palace’s Chapel Royal with her fiance, Prince Harry, by her side, UK media outlets reported, quoting the Daily Mail.\n\nKensington Palace has not made a public statement but Prince Charles and his wife, the Duchess of Cornwall, were also said to have been among the handful of guests in attendance.\n\nWelby was reportedly asked to lead the service by Markle, 36, with whom he has developed a close bond after providing guidance on the rites and sacraments of the Church in recent weeks.\n\nAs part of the ceremony, holy water from the River Jordan was poured on Markle’s head, the Mail reported.\n\nIt was not necessary for Markle – who attended a Roman Catholic high school but was brought up Protestant – to convert in order to marry Prince Harry, but she announced at the time of her engagement that she would do so anyway before their wedding in mid-May.\n\nLambeth Palace, the official London residence of the Archbishop of Canterbury, declined to comment Thursday when asked about the service.\n\nMarkle’s formal acceptance into the Anglican Church is the latest arrangement by the royal couple ahead of their wedding in St George’s Chapel at Windsor Castle.\n\nThe move appears to be a mark of respect to Queen Elizabeth II, who is head of the Church of England.\n\nCatherine, the Duchess of Cambridge and wife of Harry’s brother, William, was confirmed shortly before her wedding in 2011. Neither William nor Catherine was present on Tuesday evening, the Mail reported.\n\nThe decision to conduct the rite at the Chapel Royal at St James’s Palace will hold special importance for Prince Harry. The body of his mother, Diana, the late Princess of Wales, lay there for a week before her 1997 funeral. More recently, it was the chapel chosen to host the christening of Prince George in 2013.\n\nFemale empowerment\n\nOn Thursday, Prince Harry and Markle will visit Birmingham to launch a project aimed at inspiring female students to mark International Women’s Day.\n\nThe pair hope to encourage young women to pursue STEM careers at an event hosted by social enterprise Stemettes.\n\nThe pair have made numerous public appearances since their engagement as well as spending a traditional Christmas with other members of the royal family including the Queen and her husband, Prince Philip.\n\nPrince Harry, Meghan Markle, Catherine, Duchess of Cambridge and Prince William, Duke of Cambridge attend the first annual Royal Foundation Forum held at Aviva on February 28 in London. Chris Jackson/Getty Images\n\nThey also appeared along side the Duke and Duchess of Cambridge – dubbed the “Fab Four” by the British press – earlier this month to speak about the future of the young royals’ charity, the Royal Foundation.\n\nMarkle admitted the next few months would be busy with wedding preparations, but said she planned to “hit the ground running” in her work to empower girls and women in the UK following her nuptials.\n\nPublic invited to big day\n\nEarlier this month, Kensington Palace announced that more than 2,600 members of the public will be invited into the grounds of Windsor Castle to share in the royal couple’s wedding day.\n\nGoogle Earth/CNN\n\nThe invitees will be able to watch the arrivals of the bride and groom and their guests at St. George’s Chapel and to watch the newlyweds depart the castle on a carriage procession through the town of Windsor.\n\nThousands of people without specific invitations are expected to line the procession route through the town of Windsor, which is about 40 km (25 miles) west of central London.\n\nThe wedding will take place at 12 p.m. GMT (7 a.m. ET) on May 19 and will be officiated by the Dean of Windsor, the Right Rev. David Conner and the Archbishop of Canterbury, Kensington Palace revealed last month.\n\nThis story has been updated to correct the Duchess of Cornwall’s title.", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/131008091716-lauren-said-moorhouse.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/180211191049-001-royal-wedding-route.jpg?q=x_2,y_0,h_1123,w_1995,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/180228133036-meghan-markle-royal-foundation.jpg?q=x_0,y_108,h_1211,w_2153,c_crop/w_800", "https://media.cnn.com/api/v1/images/stellar/prod/180228110531-01-royals-0228.jpg?q=x_3,y_229,h_1684,w_2993,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/180426114549-royal-wedding-harry-meghan-branding-logo-large-169.png?q=h_40,w_370,x_0,y_0/w_1280"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/180228133036-meghan-markle-royal-foundation.jpg?q=x_0,y_108,h_1211,w_2153,c_crop/w_800", "keywords": [], "authors": ["Lauren Said-Moorhouse"], "canonical_link": "https://www.cnn.com/2018/03/08/europe/meghan-markle-baptized-intl/index.html", "title": "Meghan Markle baptized in private ceremony", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Meghan Markle baptized in private ceremony | CNN", "description": "The American actor was reportedly baptized and confirmed in a private service at St James's Palace in London on Tuesday evening with Prince Harry by her side.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180228133036-meghan-markle-royal-foundation.jpg?q=x_0,y_108,h_1211,w_2153,c_crop/w_800", "type": "article", "url": "https://www.cnn.com/2018/03/08/europe/meghan-markle-baptized-intl/index.html", "site_name": "CNN"}, "twitter": {"title": "Meghan Markle baptized in private ceremony | CNN", "description": "The American actor was reportedly baptized and confirmed in a private service at St James's Palace in London on Tuesday evening with Prince Harry by her side.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180228133036-meghan-markle-royal-foundation.jpg?q=x_0,y_108,h_1211,w_2153,c_crop/w_800", "card": "summary_large_image", "site": "@CNN"}, "description": "The American actor was reportedly baptized and confirmed in a private service at St James's Palace in London on Tuesday evening with Prince Harry by her side.", "template_type": "article_leaf", "type": "article", "meta-section": "world", "meta-branding": "royal-wedding", "theme": "world", "article": {"published_time": "2018-03-08T10:26:38Z", "modified_time": "2018-03-09T06:59:47Z", "tag": "belief, religion and spirituality, british royal family, catherine, duchess of cambridge, celebrities, christianity, church of england, europe, meghan markle, northern europe, prince harry, queen elizabeth ii, religious groups, royal wedding of prince harry and meghan markle, royalty and monarchy, society, united kingdom, weddings and engagements", "publisher": "https://www.facebook.com/CNN"}, "keywords": "belief, religion and spirituality, british royal family, catherine, duchess of cambridge, celebrities, christianity, church of england, europe, meghan markle, northern europe, prince harry, queen elizabeth ii, religious groups, royal wedding of prince harry and meghan markle, royalty and monarchy, society, united kingdom, weddings and engagements", "author": "Lauren Said-Moorhouse", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1520467200.0, "source": "https://www.cnn.com", "summary": ""}