{"url": "https://www.washingtonpost.com/arts-entertainment/2018/12/06/golden-globes-nominations-complete-coverage/", "text": "The 2019 Golden Globe nominations are in, marking the start to a new award season. Here’s what you need to know. (Video: Taylor Turner, Nicki DeMarco/The Washington Post)\n\nComment on this story Comment Gift Article Share\n\n“Vice,” the film about Vice President Dick Cheney that the general public won’t be able to see until Christmas Day, earned six Golden Globe nominations, the most of any movie this year, while FX’s “The Assassination of Gianni Versace: American Crime Story” did best among TV series, with four nods. Wp Get the full experience. Choose your plan ArrowRight The 2019 Golden Globe announcements Thursday morning continued the streaming wars, but FX’s 10 nods for shows such as “Atlanta,” “Pose” and the final season of “The Americans” meant a cable network earned the most nominations. HBO and Amazon each received nine nominations, followed by Netflix’s eight. And in an era of prestige television, network TV received just four (three for NBC and one for CBS).\n\n“The Favourite,” “Green Book” and “A Star Is Born,” Bradley Cooper and Lady Gaga’s commercial and critical hit, received five nominations each, including for top acting and movie prizes.\n\nAdvertisement\n\nAnd voters didn’t ignore massive box office sensations. “Black Panther” received three nominations (best original song, score and dramatic movie), and “Crazy Rich Asians” was nominated for best musical or comedy movie and for best actress (Constance Wu).\n\n“Mary Poppins Returns,” which also hasn’t yet been released in theaters nationwide, received four nominations, including consideration for lead actors Emily Blunt and Lin-Manuel Miranda.\n\nAnd only men are nominated for best directing in a motion picture, nearly a year after Natalie Portman made headlines for introducing that category of “all-male nominees” during the ceremony.\n\nThe nominations still leave several questions: Will “The Marvelous Mrs. Maisel,” which cleaned up at the 2018 Emmys and Golden Globes, make a repeat sweep in the three categories it’s nominated in? Will box office disappointments like “Green Book” become voter favorites? Can any song beat the memeable “Shallow”? Does any other supporting actress stand a chance against Patricia Clarkson in “Sharp Objects”?\n\nAdvertisement\n\nAndy Samberg (NBC’s “Brooklyn Nine-Nine”) and Sandra Oh (who is nominated for best dramatic actress in the television category for BBC America’s “Killing Eve”) will host the 76th Annual Golden Globe Awards on Jan. 6 on NBC.\n\nThis post will update frequently with instant analysis. Refresh to update.\n\nNOMINATIONS BY MOTION PICTURE\n\n“Vice” — 6\n\n“The Favourite” — 5\n\n“Green Book” — 5\n\n“A Star Is Born” — 5\n\n“BlacKkKlansman” — 4\n\n“Mary Poppins Returns” — 4\n\n“Black Panther” — 3\n\n“If Beale Street Could Talk” — 3\n\n“Roma” — 3\n\nNOMINATIONS BY NETWORK\n\nFX — 10\n\nHBO — 9\n\nPrime Video — 9\n\nNetflix — 8\n\nShowtime — 6\n\nNBC — 3\n\nThe list of nominations for the 2019 Golden Globes:\n\nBest motion picture, drama\n\n“If Beale Street Could Talk”\n\n“BlacKkKlansman”\n\n“Black Panther”\n\n“Bohemian Rhapsody”\n\n“A Star Is Born”\n\nIMMEDIATE REACTION: Smash hit “A Star Is Born” has been poised to earn best-picture nominations from the moment it premiered at the Venice Film Festival, and “Black Panther,” which broke box-office records and made more than a billion dollars, changed how the industry viewed superhero movies. Barry Jenkins (“If Beale Street Could Talk”) won this award in 2017 for his last film, “Moonlight,” and “BlacKkKlansman” has been framed as Spike Lee’s comeback. The only surprising nominee is arguably “Bohemian Rhapsody,” which soared at the box office but received mixed reviews from critics. Many assumed early on that it would compete in the comedy or musical category.\n\nBest actress in a motion picture, drama\n\nAdvertisement\n\nGlenn Close, “The Wife”\n\nLady Gaga, “A Star Is Born”\n\nNicole Kidman, “Destroyer”\n\nMelissa McCarthy, “Can You Ever Forgive Me?”\n\nRosamund Pike, “A Private War”\n\nIMMEDIATE REACTION: “Can You Ever Forgive Me?” is considered one of Melissa McCarthy’s first dramatic projects, while “A Star Is Born” was Lady Gaga’s feature-film debut as a lead actress. On the other hand, we have veteran dramatic film actresses Glenn Close and Nicole Kidman. Rosamund Pike falls somewhere in the middle, with “A Private War” finally giving her another chance to showcase the acting chops that “Gone Girl” proved she had. It’s a tight race.\n\nBest actor in a motion picture, drama\n\nBradley Cooper, “A Star Is Born”\n\nWillem Dafoe, “At Eternity’s Gate”\n\nRami Malek, “Bohemian Rhapsody”\n\nJohn David Washington, “BlacKkKlansman”\n\nLucas Hedges, “Boy Erased”\n\nAdvertisement\n\nIMMEDIATE REACTION: This is probably the less exciting category for Bradley Cooper, who also earned a directing nomination for his debut film. Dafoe’s performance as the much-younger Vincent Van Gogh is said to be one of his best ever, and Rami Malek’s portrayal of Freddie Mercury is the only element of “Bohemian Rhapsody” that almost everyone agreed worked well. This is the first-ever Golden Globe nomination for both John David Washington and Lucas Hedges. Again, another tight race.\n\nBest motion picture, comedy or musical\n\n“Crazy Rich Asians”\n\n“The Favourite”\n\n“Green Book”\n\n“Mary Poppins Returns”\n\n“Vice”\n\nIMMEDIATE REACTION: “Mary Poppins Returns” and “Vice” haven’t hit theaters yet, but both feature promising casts — Emily Blunt and Lin-Manuel Miranda in the former; Christian Bale, Amy Adams and Sam Rockwell in the latter — and stories that will probably evoke very different kinds of nostalgia. “The Favourite” has been described as Yorgos Lanthimos’s most approachable film, while “Crazy Rich Asians” and “Green Book” were both crowd-pleasers.\n\nAdvertisement\n\nBest actor in a motion picture, comedy or musical\n\nChristian Bale, “Vice”\n\nLin-Manuel Miranda, “Mary Poppins Returns”\n\nViggo Mortensen, “Green Book”\n\nRobert Redford, “The Old Man and the Gun”\n\nJohn C. Reilly, “Stan and Ollie”\n\nIMMEDIATE REACTION: General audiences have yet to see or hear much about John C. Reilly in “Stan and Ollie,” which hits theaters after Christmas. The other nominees aren’t major surprises: Even critics who disliked “Green Book” praised Viggo Mortensen; the trailer for “Vice,” set for a Christmas-day release, earned major buzz for Christian Bale’s transformation into Dick Cheney; and Lin-Manuel Miranda rapping is among the most memorable aspects of the “Mary Poppins” sequel. Award shows also love swan songs, and Robert Redford, 82, announced that he would retire from acting after “The Old Man and the Gun.”\n\nAdvertisement\n\nBest actress in a motion picture, comedy or musical\n\nEmily Blunt, “Mary Poppins Returns”\n\nOlivia Colman, “The Favourite”\n\nElsie Fisher, “Eighth Grade”\n\nCharlize Theron, “Tully”\n\nConstance Wu, “Crazy Rich Asians”\n\nIMMEDIATE REACTION: At just 15 years old, Elsie Fisher is likely one of the youngest actresses to be nominated in this category. “The Favourite” wisely submitted Olivia Colman as a lead actress, all but securing a nomination for the three main members of its cast. This is a tight race, especially given that Emily Blunt and Charlize Theron’s performances brought their respective films to life. Constance Wu doesn’t seem to stand much of a chance.\n\nBest director, motion picture\n\nBradley Cooper, “A Star Is Born”\n\nAlfonso Cuarón, “Roma”\n\nPeter Farrelly, “Green Book”\n\nSpike Lee, “BlacKkKlansman”\n\nAdam McKay, “Vice”\n\nAdvertisement\n\nIMMEDIATE REACTION: Natalie Portman made headlines in January when she presented this award by introducing “the all-male nominees.” Not much has changed since then. All five of these men were floated as potential contenders before the official announcement, but two are especially notable: Bradley Cooper and Peter Farrelly. “A Star Is Born” is the directorial debut of Cooper, who has previously earned two acting nominations, and “Green Book” is the first Golden Globe nod for Farrelly, known for “There’s Something About Mary” and “Dumb and Dumber.”\n\nBest supporting actress in a motion picture\n\nAmy Adams, “Vice\"\n\nClaire Foy, “First Man”\n\nRegina King, “If Beale Street Could Talk”\n\nEmma Stone, “The Favourite”\n\nRachel Weisz, “The Favourite”\n\nIMMEDIATE REACTION: Strong performances bolster “The Favourite,” so it makes sense that multiple members of the boisterous main trio — which consists of Olivia Colman, Emma Stone and Rachel Weisz — made the cut. The New York Film Critics Circle recently honored Regina King for her performance as an anguished mother in “If Beale Street Could Talk,” and Amy Adams, while in a movie that has yet to be released, has two Golden Globe wins and six nominations under her belt. Claire Foy is a reliable performer but somewhat of a surprise nominee, as many critics agree that “First Man” gave her little to do.\n\nAdvertisement\n\nBest supporting actor in a motion picture\n\nMahershala Ali, “Green Book”\n\nTimothée Chalamet, “Beautiful Boy”\n\nAdam Driver, “BlacKkKlansman”\n\nRichard E. Grant, “Can You Ever Forgive Me?”\n\nSam Rockwell, “Vice”\n\nIMMEDIATE REACTION: Pundits predicted a majority of these nominees months ago, especially in the cases of Mahershala Ali, who was nominated for “Moonlight” in 2017; Timothée Chalamet, who was nominated for his lead role in “Call Me By Your Name” in 2018; and Sam Rockwell, who won for “Three Billboards Outside Ebbing, Missouri” in 2018. Some critics argued that Adam Driver outshone lead John David Washington in “BlacKkKlansman,” while Richard E. Grant stole many of his scenes as Melissa McCarthy’s comical sidekick in “Can You Ever Forgive Me?”\n\nBest screenplay, motion picture\n\n“If Beale Street Could Talk”\n\n“The Favourite”\n\n“Green Book”\n\n“Vice”\n\n“Roma”\n\nIMMEDIATE REACTION: More-unusual films often wind up in the best screenplay category, but Paul Schrader’s “First Reformed” didn’t make the cut. “The Favourite” makes sense, given its quippy dialogue, as do the touching “Roma,” buzzy “Vice” and James Baldwin adaptation “If Beale Street Could Talk.” “Green Book” is perhaps the most interesting choice of the bunch, as it was co-written by Nick Vallelonga, the real-life son of Viggo Mortensen’s character, Tony.\n\nBest animated feature film\n\n“Incredibles 2”\n\n“Isle of Dogs”\n\n“Mirai”\n\n“Ralph Breaks the Internet”\n\n“Spider-Man: Into the Spider-Verse”\n\nIMMEDIATE REACTION: The only other animated film that had a real shot was “Early Man,” a stop-motion flick from Nick Park (“Wallace and Gromit,” “Shaun the Sheep”). Disney and Pixar dominate this category every year at the Golden Globes — which tend to nominate one or two international, non-CGI projects to fill out a diverse field — and “Incredibles 2” is poised to continue that trend. The only film that could really pull off an upset is “Spider-Man: Into the Spider-Verse,” which features a Marvel superhero of color named Miles Morales.\n\nBest foreign language film\n\n“Capernaum”\n\n“Girl”\n\n“Never Look Away”\n\n“Roma”\n\n“Shoplifters”\n\nIMMEDIATE REACTION: The most notable snubs here are Poland’s “Cold War” and South Korea’s “Burning,” both of which many film critics named on their year-end lists. Reviews for “Capernaum,” “Never Look Away” and especially “Shoplifters” are positive, and “Roma,” inspired by director Alfonso Cuarón’s upbringing, seems likely to land an Oscar nomination for best picture. “Girl” is a relatively controversial pick — while it earned a standing ovation at the Cannes Film Festival, it features underage frontal nudity and has received backlash from some trans critics.\n\nBest original song\n\n“All the Stars,” “Black Panther”\n\n“Girl in the Movies,” “Dumplin’”\n\n“Revelation,” “Boy Erased”\n\n“Shallow,” “A Star Is Born”\n\n“Requiem for a Private War,” “A Private War”\n\nIMMEDIATE REACTION: Lady Gaga and Bradley Cooper’s “Shallow” is the clear front-runner, having been stuck in everyone’s head since the trailer for “A Star Is Born” first hit YouTube. Kendrick Lamar and SZA’s “All the Stars” had a similar effect — but to a lesser extent — much earlier in the year. The other nominees were slightly less predictable but also bolstered by star power: Dolly Parton sings “Girl in the Movies”; “Requiem for a Private War” is Annie Lennox’s first new solo song in eight years; and “Revelation” succeeded in reaching a younger audience by pairing Sigur Rós frontman Jónsi with pop star Troye Sivan, who also has a supporting role in “Boy Erased.”\n\nBest original score, motion picture\n\nJustin Hurwitz, “First Man”\n\nMarc Shaiman, “Mary Poppins Returns”\n\nMarco Beltrami, “A Quiet Place”\n\nAlexandre Desplat, “Isle of Dogs”\n\nLudwig Goransson, “Black Panther”\n\nIMMEDIATE REACTION: Like most non-acting categories, there’s often gender disparity among nominated composers. The lack of Nicholas Britell, who was nominated in 2017 for scoring “Moonlight” and seemed likely to earn a nod for “If Beale Street Could Talk,” is notable.\n\nBest TV series, drama\n\n“Killing Eve” (BBC America)\n\n“Homecoming” (Amazon)\n\n“The Americans” (FX)\n\n“Pose” (FX)\n\n“Bodyguard” (Netflix)\n\nIMMEDIATE REACTION: Will “The Americans” finally get its due after (finally) being nominated for its stunning final season? The FX drama could get overshadowed by BBC America’s beloved “Killing Eve,” starring recently announced Golden Globes co-host Sandra Oh.\n\nBest actress in a TV series, drama\n\nSandra Oh, “Killing Eve” (BBC America)\n\nJulia Roberts, “Homecoming” (Amazon)\n\nKeri Russell, “The Americans” (FX)\n\nElisabeth Moss, “The Handmaid’s Tale” (Hulu)\n\nCaitriona Balfe, “Outlander” (Starz)\n\nIMMEDIATE REACTION: The Golden Globes love movie stars, so it’s no shock to see Julia Roberts land a nod for “Homecoming” — and plenty of critics seemed to love the series as well. Elisabeth Moss, last year’s winner, might be the one to beat again, although she’ll have some tough competition from Sandra Oh, who is co-hosting the show, and Keri Russell, thanks to a knockout final season of “The Americans.” Caitriona Balfe’s inclusion may seem like a surprise (she didn’t show up on many predictions lists), but this is her fourth-consecutive nomination.\n\nBest actor in a TV series, drama\n\nMatthew Rhys, “The Americans” (FX)\n\nStephan James, “Homecoming” (Amazon)\n\nBilly Porter, “Pose” (FX)\n\nJason Bateman, “Ozark” (Netflix)\n\nRichard Madden, “Bodyguard” (Netflix)\n\nIMMEDIATE REACTION: Last year’s winner, Sterling K. Brown, wasn’t even nominated this year. “This Is Us” may have lost a bit of its breakout hit luster, but Brown still gets accolades for his emotional performances every week. In any case, the field is wide open, as the only repeat nominee is Jason Bateman for “Ozark.”\n\nBest TV series, musical or comedy\n\n“Barry” (HBO)\n\n“The Good Place” (NBC)\n\n“The Marvelous Mrs. Maisel” (Amazon)\n\n“The Kominsky Method” (Netflix)\n\n“Kidding” (Showtime)\n\nIMMEDIATE REACTION: This is a solid lineup for a prestigious category. “Barry” is an obvious choice here — critics loved it — but Bill Hader’s HBO dramedy faces strong competition from last year’s winner, “The Marvelous Mrs. Maisel,” which returned in fine form for its second season this week. The HFPA could also go with “Kidding,” starring two-time Golden Globe winner Jim Carrey, who landed his first nomination in a TV category.\n\nBest actress in a TV series, musical or comedy\n\nRachel Brosnahan, “The Marvelous Mrs. Maisel” (Amazon)\n\nAlison Brie, “GLOW” (Netflix)\n\nKristen Bell, “The Good Place” (NBC)\n\nDebra Messing, “Will & Grace” (NBC)\n\nCandice Bergen, “Murphy Brown” (CBS)\n\nIMMEDIATE REACTION: Look at that — a category with more broadcast TV nominations than streaming services! NBC, network of the Globes, must be especially thrilled. Of course, Brosnahan is the front-runner with her delightful starring role as a housewife turned comedian, but the Globes like to throw curveballs. Given the fact that Candice Bergen landed a spot over some other tough competition (Issa Rae in “Insecure,” Maya Rudolph in “Forever”), she might just take the prize.\n\nBest actor in a TV series, musical or comedy\n\nBill Hader, “Barry” (HBO)\n\nDonald Glover, “Atlanta” (FX)\n\nJim Carrey, “Kidding” (Showtime)\n\nMichael Douglas, “The Kominsky Method” (Netflix)\n\nSacha Baron Cohen, “Who Is America?” (Showtime)\n\nIMMEDIATE REACTION: Fun fact: This is a completely different lineup from last year, with no repeat names. And with the exception of Donald Glover (who won two years ago for “Atlanta”), none of these actors has ever been in this category before. While you could have probably guessed that movie stars like Jim Carrey and Michael Douglas would show up here, it is a bit of a mystery that Ted Danson of “The Good Place” was left off the list. (And just for the record, we predict that Sacha Baron Cohen will walk away with this, although Bill Hader may be a close second.)\n\nBest TV movie or limited series\n\n“Sharp Objects” (HBO)\n\n“The Assassination of Gianni Versace: American Crime Story” (FX)\n\n“A Very English Scandal” (Amazon)\n\n“Escape at Dannemora” (Showtime)\n\n“The Alienist” (TNT)\n\nIMMEDIATE REACTION: Leave it to the Hollywood Foreign Press Association to remind us of shows we completely overlooked this year — like Amazon’s “A Very English Scandal,” which originally aired as a BBC miniseries. Beyond that, the category shows love to several critically acclaimed series and TNT’s “The Alienist,” which seems to be an awards show favorite this year. HBO’s “Sharp Objects” feels like the one to beat, but don’t discount “Escape at Dannemora” or Ryan Murphy’s “The Assassination of Gianni Versace.” Basically, it’s anyone’s game.\n\nBest actress in a TV movie or limited series\n\nAmy Adams, “Sharp Objects” (HBO)\n\nPatricia Arquette, “Escape at Dannemora” (Showtime)\n\nLaura Dern, “The Tale” (HBO)\n\nRegina King, “Seven Seconds” (Netflix)\n\nConnie Britton, “Dirty John” (Bravo)\n\nIMMEDIATE REACTION: The only name we’re surprised to see here is Connie Britton, who is nominated for Bravo’s disappointing limited series “Dirty John,” which is based on the popular Los Angeles Times series turned podcast. The prize could really go to any of the women in this category, but we won’t be surprised if Amy Adams takes it for HBO’s closely watched “Sharp Objects.”\n\nBest actor in a TV movie or limited series\n\nDarren Criss, “The Assassination of Gianni Versace: American Crime Story” (FX)\n\nHugh Grant, “A Very English Scandal” (Amazon)\n\nBenedict Cumberbatch, “Patrick Melrose” (Showtime)\n\nAntonio Banderas, “Genius: Picasso” (National Geographic)\n\nDaniel Brühl, “The Alienist” (TNT)\n\nIMMEDIATE REACTION: This is pretty much what we expected from this category. Criss’s performance in “The Assassination of Gianni Versace” won him critical acclaim — and an Emmy — but we’re keeping our eyes on two voter favorites: Hugh Grant and Benedict Cumberbatch.\n\nBest supporting actress in a series, limited series or TV movie\n\nPatricia Clarkson, “Sharp Objects” (HBO)\n\nThandie Newton, “Westworld” (HBO)\n\nPenélope Cruz, “The Assassination of Gianni Versace: American Crime Story” (FX)\n\nAlex Borstein, “The Marvelous Mrs. Maisel” (Amazon)\n\nYvonne Strahovski, “The Handmaid’s Tale” (Hulu)\n\nIMMEDIATE REACTION: There were at least two shoo-ins on this list: Yvonne Strahovski had a standout season on “The Handmaid’s Tale,” and Patricia Clarkson’s brutal performance in the grisly “Sharp Objects” made plenty of headlines. While Penélope Cruz and Thandie Newton were also loved by critics and voters alike, Alex Borstein is the lone comedy nominee. Although it seems like a long shot that she could triumph over Clarkson, Borstein did win the Emmy this year for her “Maisel” role.\n\nBest supporting actor in a series, limited series or TV movie\n\nEdgar Ramirez, “The Assassination of Gianni Versace: American Crime Story” (FX)\n\nBen Whishaw, “A Very English Scandal” (Amazon)\n\nHenry Winkler, “Barry” (HBO)\n\nAlan Arkin, “The Kominsky Method” (Netflix)\n\nKieran Culkin, “Succession” (HBO)\n\nIMMEDIATE REACTION: It feels safe to say that few people (if anyone) expected this list to include Kieran Culkin of “Succession,” the HBO drama about a very wealthy and very dysfunctional family that owns a media empire. The rest were a bit more predictable, including this year’s Emmy winner in this category, Henry Winkler.\n\nCorrection: An earlier version of this article listed “The Handmaid’s Tale” as a nominee for best drama series. It was not nominated in that category. This post has been updated.\n\nRead more:\n\nGiftOutline Gift Article", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/34FJFLXX64I6RBSCZFYYUJLMXU.jpg&w=1440"], "top_img": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/34FJFLXX64I6RBSCZFYYUJLMXU.jpg&w=1440", "keywords": [], "authors": ["Emily Yahr", "Sonia Rao", "Bethonie Butler", "Travis M. Andrews", "Elahe Izadi"], "canonical_link": "https://www.washingtonpost.com/arts-entertainment/2018/12/06/golden-globes-nominations-complete-coverage/", "title": "Golden Globes nominations 2019: Complete list of nominees", "meta_data": {"description": "Here's instant analysis and everything you need to know about the nominees.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/arts-entertainment/2018/12/06/golden-globes-nominations-complete-coverage/", "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/34FJFLXX64I6RBSCZFYYUJLMXU.jpg&w=1440", "title": "Golden Globes nominations 2019: Complete list of nominees", "description": "Here's instant analysis and everything you need to know about the nominees."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Golden Globes nominations 2019: Complete list of nominees", "description": "Here's instant analysis and everything you need to know about the nominees."}, "last_updated_date": "2020-01-24T21:53:26.975Z", "article": {"published_time": "2018-12-06T13:05:49.347Z", "modified_time": "2020-01-24T21:53:26.975Z", "section": "Arts & Entertainment", "content_tier": "metered"}, "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1", "next-head-count": 71, "apple-itunes-app": "app-id=352509417, app-argument=https://www.washingtonpost.com/arts-entertainment/2018/12/06/golden-globes-nominations-complete-coverage/"}, "movies": [], "publish_date": 1544054400.0, "source": "https://www.washingtonpost.com", "summary": ""}