{"url": "en.wikipedia.org/wiki/Bruce_Springsteen", "text": "American singer, songwriter, and musician\n\n\"Springsteen\" redirects here. For other uses, see Springsteen (disambiguation)\n\nBruce Frederick Joseph Springsteen (born September 23, 1949) is an American singer, songwriter, and musician. He has released 20 studio albums, most of which feature his backing band, the E Street Band. Originally from the Jersey Shore, he is one of the originators of the heartland rock style of music, combining mainstream rock musical style with narrative songs about working class American life. During a career that has spanned six decades, Springsteen has become known for his poetic, socially conscious lyrics and energetic stage performances, sometimes lasting up to four hours.[1] He has been nicknamed \"The Boss\".[2]\n\nIn 1973, Springsteen released his first two albums, Greetings from Asbury Park, N.J. and The Wild, the Innocent & the E Street Shuffle, neither of which earned him a large audience. He changed his style and reached worldwide popularity with Born to Run in 1975. It was followed by Darkness on the Edge of Town (1978) and The River (1980), which topped the US Billboard 200 chart. His first album without the E Street Band was Nebraska (1982). Born in the U.S.A. (1984), which reunited Springsteen with the E Street Band, became his most commercially successful album and one of the best-selling albums of all time. Seven of its singles reached the top 10 of the Billboard Hot 100, including the title track. Springsteen recorded his next three albums, Tunnel of Love (1987), Human Touch (1992), and Lucky Town (1992), using mostly session musicians. He reassembled the E Street Band for 1995's Greatest Hits and The Ghost of Tom Joad. His last release of the 1990s was the EP Blood Brothers (1996).\n\nSpringsteen dedicated his 2002 album The Rising to the victims of the September 11 attacks. Springsteen released two more folk albums, Devils & Dust (2005) and We Shall Overcome: The Seeger Sessions (2006), followed by two more albums with the E Street Band: Magic (2007) and Working on a Dream (2009). His next two albums, Wrecking Ball (2012) and High Hopes (2014), topped album charts worldwide. His latest releases include the solo Western Stars (2019), the E Street Band-featuring Letter to You (2020) and a solo cover album Only the Strong Survive (2022).\n\nAmong the album era's prominent acts, Springsteen has sold more than 150 million records worldwide and more than 64 million albums in the United States, making him one of the world's best-selling music artists. He has earned numerous awards for his work, including 20 Grammy Awards, two Golden Globes, an Academy Award, and a Special Tony Award (for Springsteen on Broadway). Springsteen was inducted into both the Songwriters Hall of Fame and the Rock and Roll Hall of Fame in 1999, received the Kennedy Center Honors in 2009, named MusiCares person of the year in 2013, and awarded the Presidential Medal of Freedom by President Barack Obama in 2016. He is ranked 23rd on Rolling Stone's list of the Greatest Artists of All Time.[3]\n\nEarly life [ edit ]\n\nBruce Frederick Joseph Springsteen was born at Monmouth Medical Center in Long Branch, New Jersey, on September 23, 1949.[4] He is of Dutch, Irish, and Italian descent. He spent his childhood in Freehold, New Jersey, where he lived on South Street. His father, Douglas Frederick \"Dutch\" Springsteen (1924–1998),[5][6] worked as a bus driver[5] and held other jobs. Throughout his life Douglas Springsteen had mental health problems, which worsened in his later years.[7] Springsteen's mother, Adele Ann (née Zerilli) (born 1925), was originally from the Bay Ridge neighborhood in Brooklyn,[8] worked as a legal secretary, and was the main breadwinner in Springsteen's family.[9] Springsteen has two younger sisters, Virginia and Pamela. The latter had a brief acting career, but left to pursue photography full time; she later took photos for his albums Human Touch, Lucky Town, and The Ghost of Tom Joad.[10]\n\nSpringsteen's Italian maternal grandfather was born in Vico Equense.[11] He emigrated through Ellis Island and could not read or write when he arrived. He eventually became a lawyer and impressed the young Springsteen as being larger than life.[12] The name Springsteen is topographic and of Dutch origin, literally translated as \"jump stone\" but more generally a stepping stone used on unpaved streets or between two houses.[13] The Springsteens, originally from the province of Groningen,[14] were among the early Dutch families who settled in the colony of New Netherland in the 1600s, in the person of Joost Springsteen.[15]\n\nRaised as a Catholic, Springsteen attended the St. Rose of Lima Catholic school in Freehold, where he was at odds with the nuns and rebelled against the strictures imposed upon him, even though some of his later music reflects a Catholic ethos and includes a few rock-influenced, traditional Irish-Catholic hymns.[16] In a 2012 interview, he explained that it was his Catholic upbringing rather than political ideology that most influenced his music. He remarked that his faith had given him a \"very active spiritual life\" but joked that this \"made it very difficult sexually\". He added, \"Once a Catholic, always a Catholic.\"[7][17] He grew up hearing fellow New Jersey singer Frank Sinatra on the radio and became interested in being a musician himself when, in 1956 and 1957, at the age of seven, he saw Elvis Presley on The Ed Sullivan Show. Soon after, his mother rented him a guitar from Mike Diehl's Music in Freehold for $6 a week, but it failed to provide him with the instant gratification he desired.[18]\n\nIn ninth grade, Springsteen began attending the public Freehold High School, but did not fit in there either. A former teacher said he was a \"loner who wanted nothing more than to play his guitar\". He graduated in 1967, but felt so alienated that he skipped his graduation ceremony.[19] He briefly attended Ocean County College, but dropped out.[16] Called for the draft when he was 19, Springsteen failed the physical examination and avoided service in the Vietnam War. The concussion he suffered in a motorcycle accident when he was 17 and his behavior at induction reportedly made him unacceptable for service.[20] The Springsteen family moved to San Mateo, California, in 1969, but Bruce, 20, and his sister, Virginia, who was married and pregnant, stayed behind.[21][22][23][24]\n\nCareer [ edit ]\n\n1964–1972: Early career [ edit ]\n\nThis was different, shifted the lay of the land. Four guys, playing and singing, writing their own material ... Rock 'n' roll came to my house where there seemed to be no way out ... and opened up a whole world of possibilities. —Bruce Springsteen, on the impact of the Beatles[25]\n\nIn 1964, Springsteen saw the Beatles' televised appearances on The Ed Sullivan Show. Inspired, he bought his first guitar for $18.95 at the Western Auto Appliance Store.[25][26] Thereafter, he started playing for audiences with a band called the Rogues at local venues, including Elks Lodge in Freehold.[27]\n\nIn late 1964, Springsteen's mother took out a loan to buy him a $60 Kent guitar. Springsteen later memorialized this act in his song \"The Wish\". The following year, he went to the house of Tex and Marion Vinyard, who sponsored young bands in town. They helped him become the lead guitarist and subsequently one of the lead singers of the Castiles. The Castiles recorded two original songs at a public recording studio in Brick Township and played a variety of venues, including Cafe Wha? in Greenwich Village. Marion Vinyard said that she believed the young Springsteen when he promised he would make it big.[28][29]\n\nIn the late 1960s, Springsteen performed briefly in a power trio known as Earth, playing in clubs in New Jersey, with one major show at the Hotel Diplomat in New York City.[28]\n\nFrom 1969 through early 1971, Springsteen performed with Steel Mill (originally called Child), which included Danny Federici, Vini Lopez, Vinnie Roslin, and later Steve Van Zandt and Robbin Thompson. During this time, they performed regularly at venues on the Jersey Shore, especially The Stone Pony. They also played in Richmond, Virginia,[30] Nashville, Tennessee, and California,[28] quickly gathering a cult following. A San Francisco Examiner review of their show at The Matrix by music critic Philip Elwood gave Springsteen early credibility. In his glowing assessment of Steel Mill, Elwood wrote: \"I have never been so overwhelmed by a totally unknown talent,\"[31] ...\"the first big thing that's happened to Asbury Park since the good ship Morro Castle burned to the waterline of that Jersey beach in '34\".[32] Elwood went on to praise their \"cohesive musicality\" and, in particular, singled out Springsteen as \"a most impressive composer\".[33] In San Mateo, Steel Mill recorded three original Springsteen songs at Pacific Recording.[34]\n\nOver the next two years, as Springsteen sought to shape a unique and genuine musical and lyrical style, he performed with Dr. Zoom & the Sonic Boom (early- to mid-1971), the Sundance Blues Band (mid-1971), and the Bruce Springsteen Band (mid-1971 to mid-1972).[35]\n\nSpringsteen's prolific songwriting ability included \"more words in some individual songs than other artists had in whole albums\", as his future record label would describe it in early publicity campaigns. He brought his skills to the attention of several people who went on to prove influential to his career development, including new managers Mike Appel and Jim Cretecos, who in turn brought him to the attention of Columbia Records talent scout John Hammond. Hammond auditioned Springsteen in May 1972.[36]\n\nIn October 1972, Springsteen formed a new band for the recording of his debut album, Greetings from Asbury Park, N.J. The band eventually became known as the E Street Band, although the name was not used until September 1974.[37][38] Springsteen acquired the nickname \"the Boss\" during this period, since he took on the task of collecting his band's nightly pay and distributing it amongst his bandmates.[39] The nickname also reportedly sprang from games of Monopoly that Springsteen would play with other Jersey Shore musicians.[40]\n\n1972–1974: Initial struggle for success [ edit ]\n\nSpringsteen was signed to Columbia Records in 1972 by Clive Davis after having piqued the interest of John Hammond, who had signed Bob Dylan to the same label a decade earlier. Despite the expectations of Columbia Records' executives that Springsteen would record an acoustic album, he brought many of his New Jersey-based colleagues into the studio with him, and formed the E Street Band (although the band would not be formally named for several months). His debut album Greetings from Asbury Park, N.J., released in January 1973, established him as a critical favorite,[41] though sales were slow.\n\nBecause of Springsteen's lyrical poeticism and folk rock-rooted music exemplified on tracks like \"Blinded by the Light\"[note 1] and \"For You\", as well as the Columbia and Hammond connections, critics initially compared Springsteen to Dylan. \"He sings with a freshness and urgency I haven't heard since I was rocked by 'Like a Rolling Stone'\" wrote Crawdaddy magazine editor Peter Knobler in Springsteen's first interview/profile in March 1973. Photographs for that original profile were taken by Ed Gallucci.[42][43] Crawdaddy discovered Springsteen in the rock press and was his earliest champion. Knobler profiled him in Crawdaddy three times, in 1973, 1975 and 1978.[44] (Springsteen and the E Street Band acknowledged the magazine's support by giving a private performance at the Crawdaddy 10th Anniversary Party in New York City in June 1976.)[45] Music critic Lester Bangs wrote in Creem in 1975 that when Springsteen's first album was released \"... many of us dismissed it: he wrote like Bob Dylan and Van Morrison, sang like Van Morrison and Robbie Robertson, and led a band that sounded like Van Morrison's\".[46]\n\nIn September 1973, Springsteen's second album, The Wild, the Innocent & the E Street Shuffle, was released. Like Greetings from Asbury Park, it was met with critical acclaim but limited commercial success. Springsteen's songs became grander in form and scope with the E Street Band providing a less folksy, more rhythm and blues vibe, and the lyrics often romanticized teenage street life. \"4th of July, Asbury Park (Sandy)\" and \"Incident on 57th Street\" became fan favorites, and the long, rousing \"Rosalita (Come Out Tonight)\" continues to rank among Springsteen's most beloved concert numbers. \"Rosalita\" is the ninth most played song in his catalog; as of June 2020, it has been played by Springsteen 809 times.[47]\n\nAfter seeing Springsteen's performance at the Harvard Square Theater, music critic Jon Landau wrote in the May 22, 1974 issue of Boston's The Real Paper: \"I saw rock and roll future, and its name is Bruce Springsteen. And on a night when I needed to feel young, he made me feel like I was hearing music for the very first time.\"[48] Landau helped to finish the epic new album Born to Run and subsequently became Springsteen's manager and producer. Given an enormous budget in a last-ditch effort at a commercially viable record, Springsteen became bogged down in the recording process while striving for a \"Wall of Sound\" production. But when his manager, Mike Appel, orchestrated the release of an early mix of \"Born to Run\" to nearly a dozen radio stations, anticipation built toward the album's release.[49]\n\nThe album took more than 14 months to record with six months alone spent on developing the song \"Born to Run\". During this time, Springsteen battled with anger and frustration over the album, saying he heard \"sounds in [his] head\" that he could not explain to the others in the studio. It was during a recording session of \"Tenth Avenue Freeze-Out\", on July 13, 1975, that Steve Van Zandt was asked by Springsteen and Jon Landau to take charge and instruct the horn players. They both knew he was playing guitar and managing Southside Johnny and the Asbury Jukes, who had the sound they were seeking. Van Zandt \"sang each horn player his part, with the lines, the timing and the inflection all perfect. The musicians played their parts, and the horns were recorded. When they finished, Springsteen turned to Mike Appel and said, \"Okay. It's time to put the boy on the payroll. I've been meaning to tell you, he's the new guitar player.\"[50] Van Zandt joined the E Street Band a week later on July 20, the opening night of the Born to Run tour. He also helped Springsteen perfect \"Born to Run\" by adding its memorable guitar line. In the 2005 documentary Wings for Wheels,[51] Springsteen called his friend's input on the track's main riff \"arguably Steve's greatest contribution to my music.\"[52]\n\nThe album was completed on July 25. But at the end of the grueling recording sessions, Springsteen was still unsatisfied. Upon first hearing the finished album, he threw it into the alley; another master was so bad that Springsteen flung it out of his hotel room window and into a river. He was going to scrap half of it, he told Appel, and substitute live recordings for upcoming show dates at The Bottom Line in New York City, a venue where he often played.[53]\n\n1975–1983: Breakthrough [ edit ]\n\nSpringsteen and the E Street Band, February 1977\n\nOn August 13, 1975, Springsteen and the E Street Band began a five-night, 10-show stand at New York's The Bottom Line club. The 10-show stand attracted media attention and was broadcast live on WNEW-FM. Decades later, Rolling Stone magazine named the stand one of the \"50 Moments That Changed Rock and Roll\".[54]\n\nBorn to Run was released on August 25, 1975. It proved to be a breakthrough album[55][56][57] that catapulted Springsteen to worldwide fame.[58] The album peaked at No. 3 on the Billboard 200, and while reception at US top 40 radio outlets for the album's two singles was not overwhelming (\"Born to Run\" reached a modest No. 23 on the Billboard charts, and \"Tenth Avenue Freeze-Out\" peaked at No. 83), almost every track on the album received album-oriented rock airplay, especially \"Born to Run\", \"Thunder Road\", \"Tenth Avenue Freeze-Out\", and \"Jungleland\", all of which remain perennial favorites on many classic rock stations.[citation needed] In October 1975, Springsteen appeared on the covers of both Newsweek and Time in the same week.[59][60] So great did the wave of publicity become that he eventually rebelled against it during his first venture overseas, tearing down promotional posters before a concert appearance in London.[61]\n\nA legal battle with former manager Mike Appel kept Springsteen out of the studio for nearly a year, during which time he kept the E Street Band together through extensive touring across the U.S. Despite the optimistic fervor with which he often performed, Springsteen's new songs sounded more somber than much of his previous work. Reaching settlement with Appel in 1977, Springsteen returned to the studio, and the subsequent sessions produced Darkness on the Edge of Town (1978). Musically, this album was a turning point in Springsteen's career. Gone were the raw, rapid-fire lyrics, outsized characters, and long, multi-part musical compositions of the first three albums; the songs were leaner and more carefully drawn and began to reflect Springsteen's growing intellectual and political awareness. The cross-country 1978 tour to promote the album would become legendary for the intensity and length of its shows.[62]\n\nBy the late 1970s, Springsteen earned a reputation as a songwriter whose material could provide hits for other bands. Manfred Mann's Earth Band had achieved a U.S. No. 1 pop hit with a heavily rearranged version of Greetings' \"Blinded by the Light\" in early 1977. Patti Smith reached No. 13 with her version of Springsteen's unreleased \"Because the Night\" with revised lyrics by Smith in 1978. The Pointer Sisters hit No. 2 in 1979 with Springsteen's then unreleased \"Fire\". Between 1976 and 1978, Springsteen provided four compositions to Southside Johnny & the Asbury Jukes, including \"The Fever\" and \"Hearts of Stone\", and collaborated on four more with Steven Van Zandt, producer of their first three albums.[63]\n\nIn September 1979, Springsteen and the E Street Band joined the Musicians United for Safe Energy anti-nuclear power collective at Madison Square Garden for two nights, playing an abbreviated set while premiering two songs from his upcoming album. The subsequent No Nukes live album, as well as the following summer's No Nukes documentary film, represented the first official recordings and footage of Springsteen's fabled live act and Springsteen's first tentative dip into political involvement.[64]\n\nSpringsteen continued to focus on working class life with the 20-song double album The River in 1980, which included an intentionally paradoxical range of material from good time party rockers to emotionally intense ballads, and finally yielded his first hit top ten single as a performer, \"Hungry Heart\".[65] The album sold well, becoming his first No. 1 on the Billboard Pop Albums chart.[66]\n\nThe River was released in 1982 followed by the stark solo acoustic Nebraska. According to the Dave Marsh's biographies, Springsteen was depressed when he wrote this material, resulting in a brutal depiction of American life. While Nebraska did not sell as well as Springsteen's three previous albums, it garnered widespread critical praise, including being named \"Album of the Year\" by Rolling Stone magazine's critics, and influenced later works by other major artists.[citation needed]\n\n1984–1991: Commercial and popular phenomenon [ edit ]\n\nSpringsteen is probably best known for his album Born in the U.S.A. (1984), which sold 15 million copies in the U.S., 30 million worldwide, and became one of the best-selling albums of all time with seven singles hitting the Top 10. The title track was a bitter commentary on the treatment of Vietnam veterans, some of whom were Springsteen's friends. The lyrics in the verses were entirely unambiguous when listened to, but the anthemic music and the title of the song made it hard for many, from politicians to the common person, to get the lyrics—except those in the chorus, which could be read many ways.[67] The song made a huge political impact, as he was advocating for the rights of the common working-class man.[68]\n\nThe song was widely misinterpreted as jingoistic, and in connection with the 1984 presidential campaign became the subject of considerable folklore. In 1984, conservative columnist George Will attended a Springsteen concert and then wrote a column praising Springsteen's work ethic. Six days after the column was printed, in a campaign rally in Hammonton, New Jersey, President Ronald Reagan said, \"America's future rests in a thousand dreams inside your hearts. It rests in the message of hope in the songs of a man so many young Americans admire—New Jersey's own, Bruce Springsteen.\" Two nights later, at a concert in Pittsburgh, Springsteen told the crowd, \"Well, the president was mentioning my name in his speech the other day and I kind of got to wondering what his favorite album of mine must've been, you know? I don't think it was the Nebraska album. I don't think he's been listening to this one.\" He then began playing \"Johnny 99\", with its allusions to closing factories and criminals.[69]\n\n\"Dancing in the Dark\" was the biggest of seven hit singles from Born in the U.S.A., peaking at No. 2 on the Billboard singles chart. The video for the song showed a young Courteney Cox dancing on stage with Springsteen, which helped start the actress's career. The song \"Cover Me\" was written by Springsteen for Donna Summer, but his record company persuaded him to keep it for the new album. A big fan of Summer's work, Springsteen wrote another song for her, \"Protection\". Videos for the album were directed by Brian De Palma and John Sayles. Springsteen played on the \"We Are the World\" song and album in 1985. His live track \"Trapped\" from that album received moderate airplay on US Top 40 stations as well as reaching No. 1 on the Billboard Top Rock Tracks chart.[70]\n\nThe Born in the U.S.A. period represented the height of Springsteen's visibility in popular culture and the broadest audience he would ever reach (aided by the release of Arthur Baker's dance mixes of three of the singles). From June 15 to August 10, 1985, all seven of his albums appeared on the UK Albums Chart: the first time an artist had charted their entire back catalogue simultaneously.[71]\n\nLive/1975–85, a five-record box set (also on three cassettes or three CDs), was released near the end of 1986 and became the first box set to debut at No. 1 on the U.S. album charts. It is one of the most commercially successful live albums of all time, ultimately selling 13 million units in the U.S. During the 1980s, several Springsteen fanzines were launched, including Backstreets magazine.[72]\n\nSpringsteen released the much more sedate and contemplative Tunnel of Love album in 1987. The album is a mature reflection on the many faces of love found, lost and squandered, which only selectively used the E Street Band.\n\nOn July 19, 1988, Springsteen's concert in East Germany attracted 300,000 spectators. Journalist Erik Kirschbaum called the concert \"the most important rock concert ever, anywhere\" in his 2013 book Rocking the Wall. Bruce Springsteen: The Berlin Concert That Changed the World. The concert had been conceived by the Socialist Unity Party's youth wing in an attempt to placate the youth of East Germany, who were hungry for more freedom and the popular music of the West. However, it is Kirschbaum's opinion that the success of the concert catalyzed opposition to the regime in East Germany, and helped contribute to the fall of the Berlin Wall the following year.[74]\n\nLater in 1988, Springsteen headlined the worldwide Human Rights Now! tour for Amnesty International. In late 1989, he dissolved the E Street Band.[75][76]\n\n1992–1998: Ups, downs, and soundtracks [ edit ]\n\nIn 1992, after risking fan accusations of \"going Hollywood\" by moving to Los Angeles and working with session musicians, Springsteen released two albums at once: Human Touch and Lucky Town.\n\nAn electric band appearance on the acoustic MTV Unplugged television program (later released as In Concert/MTV Plugged) was poorly received and cemented fan dissatisfaction.[78] Springsteen seemed to realize this a few years hence when he spoke humorously of his late father during his Rock and Roll Hall of Fame acceptance speech:\n\nI've gotta thank him because—what would I conceivably have written about without him? I mean, you can imagine that if everything had gone great between us, we would have had disaster. I would have written just happy songs—and I tried it in the early '90s and it didn't work; the public didn't like it.[79]\n\nSpringsteen won an Academy Award in 1994 for his song \"Streets of Philadelphia\", which appeared on the soundtrack to the film Philadelphia. The video for the song shows Springsteen's actual vocal performance, recorded using a hidden microphone, to a prerecorded instrumental track. This technique was developed on the \"Brilliant Disguise\" video.\n\nIn 1995, after temporarily re-organizing the E Street Band for a few new songs recorded for his first Greatest Hits album (a recording session that was chronicled in the documentary Blood Brothers), and also one show at Tramps in New York City, he released his second folk album, The Ghost of Tom Joad. The album was inspired by John Steinbeck's The Grapes of Wrath and by Journey to Nowhere: The Saga of the New Underclass, a book by Pulitzer Prize-winning author Dale Maharidge and photographer Michael Williamson. The album was generally less well-received than the similar Nebraska due to the minimal melody, twangy vocals, and political nature of most of the songs; however, some praised it for giving voice to immigrants and others who rarely have one in American culture. The lengthy, worldwide, small-venue solo acoustic Ghost of Tom Joad Tour that followed successfully presented many of his older songs in drastically reshaped acoustic form, although Springsteen had to explicitly remind his audiences to \"shut the fuck up\" and not to clap during the performances.[82]\n\nFollowing the tour, Springsteen moved from California back to New Jersey with his family.[83] In 1998, he released the sprawling, four-disc box set of outtakes, Tracks. Later, he would acknowledge that the 1990s were a \"lost period\" for him: \"I didn't do a lot of work. Some people would say I didn't do my best work.\"[84]\n\n1999–2007: Return to success [ edit ]\n\nSpringsteen was inducted into the Rock and Roll Hall of Fame in 1999 by Bono (the lead singer of U2), a favor he returned in 2005.[85]\n\nIn 1999, Springsteen and the E Street Band reunited and began their extensive Reunion Tour, which lasted over a year. Highlights included a record sold-out, 15-show run at Continental Airlines Arena in East Rutherford, New Jersey and a ten-night, sold-out engagement at New York City's Madison Square Garden. A new song, \"American Skin (41 Shots)\", about the police shooting of Amadou Diallo, which was played at these shows proved controversial.\n\nIn 2002, Springsteen released his first studio effort with the full band in 18 years, The Rising, produced by Brendan O'Brien. The album, mostly a reflection on the September 11 attacks, was a critical and popular success. The title track gained airplay in several radio formats, and the record became Springsteen's best-selling album of new material in 15 years. Kicked off by an early-morning Asbury Park appearance on The Today Show, The Rising Tour commenced; the band barnstormed through a series of single-night arena stands in the U.S. and Europe. Springsteen played an unprecedented 10 nights in Giants Stadium in New Jersey.[87] At the 45th Annual Grammy Awards, The Rising won the Grammy for Best Rock Album and was nominated for the Grammy for Album of the Year. In addition, \"The Rising\" won the Grammy for Best Rock Song and for Best Male Rock Vocal Performance. It was also nominated for the Grammy Award for Song of the Year.[88] Rolling Stone later named \"The Rising\" the 35th best song of the decade.[89] VH1 placed it 81st on its list of the \"100 Greatest Songs of the '00s\".[90]\n\nAt the Grammy Awards of 2003, Springsteen performed the Clash's \"London Calling\" along with Elvis Costello, Dave Grohl, and E Street Band member Steven Van Zandt and No Doubt's bassist, Tony Kanal, in tribute to Joe Strummer.[91] In 2004, Springsteen and the E Street Band participated in the Vote for Change tour, along with John Mellencamp, John Fogerty, the Dixie Chicks, Pearl Jam, R.E.M., Bright Eyes, the Dave Matthews Band, Jackson Browne, and other musicians.\n\nDevils & Dust was released on April 26, 2005, and was recorded without the E Street Band. It is a low-key, mostly acoustic album, in the same vein as Nebraska and The Ghost of Tom Joad. Some of the material was written almost 10 years earlier during, or shortly after, the Ghost of Tom Joad Tour, with a few having been performed then but not released.[92] The title track concerns an ordinary soldier's feelings and fears during the Iraq War. The album entered the charts at No. 1 in 10 countries. Springsteen began the solo Devils & Dust Tour at the same time as the album's release, playing both small and large venues. Attendance was disappointing in a few regions, and everywhere (other than in Europe) tickets were easier to get than in the past.[93]\n\nIn April 2006, Springsteen released We Shall Overcome: The Seeger Sessions, an American roots music project focused around a big folk sound treatment of 15 songs popularized by the radical musical activism of Pete Seeger. A tour began the same month, with the 18-strong ensemble of musicians dubbed the Seeger Sessions Band (and later shortened to the Sessions Band). The tour proved very popular in Europe, selling out everywhere and receiving some excellent reviews,[94] but newspapers reported that a number of U.S. shows suffered from sparse attendance.[95][96][97]\n\nSpringsteen's next album, entitled Magic, was released on October 2, 2007. Recorded with the E Street Band, it had 10 new Springsteen songs plus \"Long Walk Home\", performed once with the Sessions band, and a hidden track (the first included on a Springsteen studio release), \"Terry's Song\", a tribute to Springsteen's long-time assistant Terry Magovern, who died on July 30, 2007.[98] Magic debuted at No. 1 in Ireland and the UK.\n\nIt was announced on November 21, 2007, that Springsteen's longtime friend and founding E Street Band member, Danny Federici, would be taking a leave of absence from the Magic Tour to pursue treatment for melanoma. Charles Giordano filled in as Federici's replacement.\n\n2008–2011: Transitions [ edit ]\n\nFederici returned to the stage on March 20, 2008, for a Springsteen and E Street Band performance in Indianapolis. On April 17, 2008, Federici died of cancer.[100][101]\n\nSpringsteen supported Barack Obama's 2008 presidential campaign.[102] He gave solo acoustic performances in support of Obama's campaign throughout 2008,[103] culminating with a November 2 rally at which he debuted the song \"Working on a Dream\" in a duet with Scialfa.[104] Following Obama's electoral victory on November 4, Springsteen's song \"The Rising\" was the first song played over the loudspeakers after Obama's victory speech in Chicago's Grant Park. Springsteen was the musical opener for the Obama Inaugural Celebration on January 18, 2009, which was attended by over 400,000 people.[105] He performed \"The Rising\" with an all-female choir. Later he performed Woody Guthrie's \"This Land Is Your Land\" with Pete Seeger.\n\nOn January 11, 2009, Springsteen won the Golden Globe Award for Best Song for \"The Wrestler\", from the Darren Aronofsky film by the same name.[106] After receiving a heartfelt letter from lead actor Mickey Rourke, Springsteen supplied the song for the film for free.[107]\n\nSpringsteen performed at the halftime show at Super Bowl XLIII on February 1, 2009,[108] agreeing to perform after having declined on prior occasions.[109] A few days before the game, Springsteen gave a rare press conference at which he promised a \"twelve-minute party.\"[110][111] It has been reported that this press conference was Springsteen's first press conference in more than 25 years.[112] His 12-minute 45-second set, with the E Street Band and the Miami Horns, included abbreviated renditions of \"Tenth Avenue Freeze-Out\", \"Born to Run\", \"Working on a Dream\", and \"Glory Days\", the latter complete with football references in place of the original baseball-themed lyrics. The set of appearances and promotional activities led Springsteen to say, \"This has probably been the busiest month of my life.\"[113]\n\nSpringsteen's Working on a Dream album, dedicated to the memory of Danny Federici, was released in late January 2009.[110] The supporting Working on a Dream Tour ran from April 2009 until November 2009. The band performed five final shows at Giants Stadium, opening with a new song highlighting the historic stadium, and Springsteen's Jersey roots, named \"Wrecking Ball\".[114] A DVD from the Working on a Dream Tour entitled London Calling: Live in Hyde Park was released in 2010.\n\nFireworks go off at the conclusion of the \"E! Street! Band!\" exhortation during the final shows at Giants Stadium\n\nSpringsteen received the Kennedy Center Honors on December 6, 2009. President Obama gave a speech in which he asserted that Springsteen had incorporated the lives of regular Americans into his expansive palette of songs. Obama added that Springsteen's concerts were not just rock-and-roll concerts, but \"communions\". The event included musical tributes from Melissa Etheridge, Ben Harper, John Mellencamp, Jennifer Nettles, Sting, and Eddie Vedder.[115]\n\nThe 2000s ended with Springsteen named one of eight Artists of the Decade by Rolling Stone magazine[116] and with Springsteen's tours ranking him fourth among artists in total concert grosses for the decade.[117]\n\nClarence Clemons, the E Street Band's saxophonist and founding member, died on June 18, 2011, of complications from a stroke.[118]\n\n2012–2018: Autobiography and Broadway show [ edit ]\n\nSpringsteen's 17th studio album, Wrecking Ball, was released on March 6, 2012. The album consists of eleven tracks plus two bonus tracks. Three songs previously only available as live versions—\"Wrecking Ball\", \"Land of Hope and Dreams\", and \"American Land\"—appear on the album.[119] Wrecking Ball became Springsteen's tenth No. 1 album in the United States, tying him with Elvis Presley for third most No. 1 albums of all-time. Only the Beatles (19) and Jay Z (12) have more No. 1 albums.[120]\n\nFollowing the release of the album, Springsteen and the E Street Band announced plans for the Wrecking Ball Tour, which began on March 18, 2012. On July 31, 2012, in Helsinki, Finland, Springsteen performed his longest concert ever at 4 hours and 6 minutes and 33 songs.[121]\n\nSpringsteen campaigned for President Barack Obama's re-election in Ohio, Iowa, Virginia, Pittsburgh, and Wisconsin. At the rallies, he briefly spoke to the audience and performed a short acoustic set that included a newly written song titled \"Forward\".[122][123][124]\n\nAt year's end, the Wrecking Ball Tour was named Top Draw for having the top attendance out of any tour by the Billboard Touring Awards. The tour finished second to Roger Waters, who had the top-grossing tour of 2012.[125] Springsteen finished second only to Madonna as the top money maker of 2012 with $33.44 million.[126] The Wrecking Ball album, along with the single \"We Take Care of Our Own\", was nominated for three Grammy Awards, including Best Rock Performance and Best Rock Song for \"We Take Care of Our Own\" and Best Rock Album.[127][128] Rolling Stone named Wrecking Ball the number one album of 2012 on their Top 50 albums of 2012 list.[129]\n\nIn late July 2013, the documentary Springsteen & I, directed by Baillie Walsh and produced by Ridley Scott, was released simultaneously via a worldwide cinema broadcast in over 50 countries and in over 2000 movie theaters.[130]\n\nSpringsteen released his eighteenth studio album, High Hopes, on January 14, 2014. The first single and video were of a newly recorded version of the song \"High Hopes\", which Springsteen had previously recorded in 1995. The album was the first by Springsteen in which all songs are either cover songs, newly recorded outtakes from previous records, or newly recorded versions of songs previously released. The 2014 E Street Band touring lineup, along with deceased E Street Band members Clarence Clemons and Danny Federici, appear on the album.[131] High Hopes became Springsteen's eleventh No. 1 album in the US.[132] It was his tenth No. 1 in the UK, tying him for fifth all-time with the Rolling Stones and U2.[133] Rolling Stone named High Hopes the second best album of the year (behind only U2's Songs of Innocence) on their Top 50 Albums of 2014 list.[134]\n\nSpringsteen made his acting debut in the final episode of season three of Van Zandt's show Lilyhammer, which was named \"Loose Ends\" after a Springsteen song on the Tracks album.[135]\n\nOn August 6, 2015, Springsteen performed \"Land of Hope and Dreams\" and \"Born to Run\" on the final episode of The Daily Show with Jon Stewart, as Stewart's final 'Moment of Zen'. On October 16, to celebrate the 35th anniversary of The River, Springsteen announced The Ties That Bind: The River Collection box set. Released on December 4, it contains four CDs (including many previously unreleased songs) and three DVDs (or Blu-ray) along with a 148-page coffee table book. In November 2015, \"American Skin (41 Shots)\" was performed with John Legend at Shining a Light: A Concert for Progress on Race in America.[136] Springsteen made his first appearance on Saturday Night Live since 2002 on December 19, 2015, performing \"Meet Me in the City\", \"The Ties That Bind\", and \"Santa Claus Is Coming to Town\".[137]\n\nThe River Tour 2016 began in January 2016 in support of The Ties That Bind: The River Collection box set. All first-leg shows in North America included an in-sequence performance of the entire The River album along with other songs from Springsteen's catalog, and all dates were recorded and made available for purchase.[138] In April 2016, Springsteen was one of the first artists to boycott North Carolina's anti-transgender bathroom bill.[139] More dates were eventually announced expanding the original three-month tour into a seven-month tour with shows in Europe in May 2016 and another North American leg starting in August 2016 and ending the following month.\n\nOn September 23, 2016, Chapter and Verse, a compilation from throughout Springsteen's career dating back to 1966, was released. On September 27, 2016, Simon & Schuster published his 500-page autobiography, Born to Run. The book rose quickly to the top of the NY Times Best Sellers List.[140]\n\nSpringsteen receiving the Presidential Medal of Freedom at the White House from President Barack Obama in 2016\n\nOn September 7, 2016, at Citizens Bank Park in Philadelphia, Pennsylvania, Springsteen performed for 4 hours and 4 minutes. This show, which was part of The River 2016 Tour, stands as his longest-ever show in the United States.[141][142] The River 2016 Tour was the top-grossing worldwide tour of 2016; it pulled in $268.3 million globally and was the highest-grossing tour since 2014 for any artist topping Taylor Swift's 2015 tour which grossed $250.1 million.[143]\n\nSpringsteen supported Hillary Clinton's 2016 presidential campaign by performing an acoustic set of \"Thunder Road\", \"Long Walk Home\" and \"Dancing in the Dark\" at a rally in Philadelphia on November 7, 2016. On November 22, 2016, Springsteen was presented with the Presidential Medal of Freedom award by Barack Obama.[144][145] On January 12, 2017, Springsteen and Patti Scialfa performed a special 15-song acoustic set for President Barack Obama and Michelle Obama at the White House's East Room two days before the president gave his farewell address to the nation.[146][147]\n\nSpringsteen on Broadway, an eight-week run at the Walter Kerr Theatre on Broadway in New York City in fall 2017, was announced in June 2017.[148] The show included Springsteen reading excerpts from his 2016 autobiography Born to Run and performing other spoken reminiscences.[149] Originally scheduled to run from October 12 through November 26, the show was extended three times; the last performance occurred on December 15, 2018.[150][151][152] For Springsteen's production of Springsteen on Broadway, he was honored with a Special Tony Award at the 72nd Tony Awards in 2018.[153]\n\nOn December 14, 2018, the live album Springsteen on Broadway was released. The album reached the top 10 in more than 10 countries and no. 11 in the United States.[154]\n\nSpringsteen's nineteenth studio album, Western Stars, was released on June 14, 2019.[155]\n\nIt was announced on July 23, 2019, that Springsteen would premiere his film, Western Stars, at the Toronto Film Festival in September 2019. He co-directed the film along with longtime collaborator Thom Zimny. The film features Springsteen and his backing band performing the music from Western Stars to a live audience.[156][157] The film was released in theaters on October 25, 2019, and the film's soundtrack, Western Stars – Songs from the Film, was also released that day.[158]\n\nSpringsteen (second from right) was among the five recipients of the 2009 Kennedy Center Honors\n\nOn May 29, 2020, Springsteen appeared remotely during a livestream, no-audience concert by the Dropkick Murphys at Fenway Park in Boston. Springsteen performed the Dropkick Murphys song \"Rose Tattoo\" and his song \"American Land\", sharing co-vocals with Ken Casey on both songs. The event marked the first music performance without an in-person audience at a major U.S. arena, stadium or ballpark during the COVID-19 pandemic. During the livestream, viewers were encouraged to make charitable donations.[159] The livestream attracted over 9 million viewers and raised over $700,000.[160]\n\nOn September 10, 2020, Springsteen released the single \"Letter to You\".[161][162] The single \"Ghosts\" was released on September 24, 2020.[163] Letter to You, Springsteen's twentieth studio album, was released on October 23, 2020.[161][162] Springsteen also released a documentary entitled Letter to You on October 23.[164][165] The documentary was shot exclusively in black and white and was directed by Thom Zimny.[165] The album Letter to You features 12 songs and runs just under one hour.[166]\n\nOn November 16, 2020, Springsteen was featured as a guest singer for Bleachers' newest single, \"Chinatown\",[167] for their 3rd studio album Take the Sadness Out of Saturday Night.[168]\n\nSpringsteen and the E Street Band were musical guests on the December 12, 2020, episode of Saturday Night Live, where they performed \"Ghosts\" and \"I'll See You in My Dreams\". This marked the band's first performance since 2017 and their first to promote Letter to You. Garry Tallent and Soozie Tyrell opted to remain at home due to COVID-19 concerns; this was the first time Tallent had ever missed a performance with the band, and Jack Daley of the Disciples of Soul filled in for him.[169]\n\nOn February 22, 2021, it was announced that Springsteen was releasing an eight-part podcast on Spotify titled Renegades: Born in the USA that would feature himself in conversation with Barack Obama discussing a wide range of topics including family, race, marriage, fatherhood, and the state of the U.S.[170]\n\nOn May 16, 2021, John Mellencamp announced that Springsteen would appear on his next album.[171] On September 29, 2021, Mellencamp released the single and music video for \"Wasted Days\", which features Springsteen on co-lead vocals and guitar.[172]\n\nOn June 7, 2021, Springsteen announced that his Springsteen on Broadway shows would return for a limited run at Jujamcyn's St. James Theatre beginning on June 26, 2021.[173] In an interview with E Street Radio's Jim Rotolo on June 10, 2021, Springsteen said that he did not plan on playing any shows in 2021 but was talked into the Broadway shows by a \"friend\".[174] During the same interview, Springsteen also announced an upcoming collaboration with the Killers.[175] Later that day the Killers' social media announced the title of the song \"Dustland\" after a series of teases by the band throughout the day.[176][non-primary source needed][better source needed]\n\nOn September 11, 2021, Springsteen performed \"I'll See You in My Dreams\" in tribute to the victims of the September 11 attacks.[177]\n\nOn December 13, 2021, Springsteen gave a surprise four song performance at the John Henry's Friends benefit concert for children diagnosed with Autism where he was joined by Steve Earle and the Dukes as his backing band.[178] On December 14, 2021, Max Weinberg indicated that he felt a tour with Springsteen and the E Street Band was very likely in 2022 saying \"Until the bus pulls up at my house, figuratively speaking, I'm not quite sure but I'm pretty convinced ... (that) myself, my colleagues and the people who are interested are going to be very pleasantly surprised in 2022. I don't make plans for Bruce Springsteen and the E Street Band but I feel very good about the next 18, 24 months.\"[179] On December 16, 2021, Springsteen sold the masters of his entire catalog and the coinciding music publishing rights to Sony Music for $500 million. This topped what Bob Dylan and Taylor Swift received for their catalogs by $200 million.[180] This sale, along with his Broadway shows and projects with Obama, helped him top the Rolling Stone list of the highest-paid musicians of 2021.[181]\n\nOn May 24, 2022, it was announced that he would be launching an international tour with the E Street Band in 2023, the first such since 2017.[182]\n\nOn September 26, 2022, it was announced that Springsteen and his wife Patti Scialfa would perform at the inaugural Albie Awards at the New York Public Library on September 29, 2022.[183]\n\nOn September 29, 2022, Springsteen announced that his twenty-first studio album, Only the Strong Survive, would be released on November 11, 2022. The album features fifteen covers of classic soul music songs from the 60s and 70s.[184]\n\nArtistry and legacy [ edit ]\n\nI spent most of my life as a musician measuring the distance between the American Dream and American reality. —Springsteen at a rally for presidential candidate Barack Obama on November 2, 2008[185]\n\nWidely regarded as one of the greatest songwriters of all time,[186] Springsteen has been called a \"rock 'n' roll poet\" who \"radiated working-class authenticity\".[187] Often described as cinematic in their scope, Springsteen's lyrics frequently explore highly personal themes such as individual commitment, dissatisfaction and dismay with life in a context of everyday situations.[188] Springsteen's themes include social and political commentary[189][190] and are rooted in the struggles faced by his own family of origin.[191]\n\nIn 2003, Rolling Stone's 500 Greatest Albums of All Time list included Born to Run at number 18,[192] Born in the U.S.A. at number 85,[193] The Wild, the Innocent & the E Street Shuffle at number 132,[194] Darkness on the Edge of Town at number 151,[195] Nebraska at number 224,[196] The River at number 250,[197] Greetings from Asbury Park, N.J. at number 379,[198] and Tunnel of Love at number 475.[199] In 2004, on their 500 Greatest Songs of All Time list, Rolling Stone included \"Born to Run\" at number 21, \"Thunder Road\" at number 86,[200] and \"Born in the U.S.A.\" at number 275.[201]\n\nAccording to Acclaimed Music, he is the 5th most celebrated artist in popular music history.[202]\n\nA shift in Springsteen's lyrical approach began with the album Darkness on the Edge of Town,[203] in which he focused on the emotional struggles of working class life,[204][205] although he still sings about general rock and roll themes as well.\n\nJon Pareles has named Springsteen among the \"pantheon\" of artists in the album era, in which the album format was the dominant form of recorded music expression and consumption.[206] \"Springsteen is the quintessential album-era rock star\", writes Ann Powers, who argues that while other album-era acts like the Beatles, the Rolling Stones, and Marvin Gaye probably made better individual works, \"none [had] used the long-player form itself more powerfully over the arc of a career, not only to establish a world through song, but to inhabit an enduring persona\" and lyricize \"America's slide from industrial-era swagger into service-economy anomie\". In her mind, he needed the \"track-by-track architecture of albums to flesh out characters, relate each to the other, extend metaphors and build a palpable, detail-strewn landscape through which they could travel\", while progressing musically over time \"both with his stalwart E Street Band (a metaphor itself for the family connections and community spirit his songs celebrate or lament) and in more minimalist projects.\"[207]\n\nPersonal life [ edit ]\n\nWhile rejecting religion in his earlier years, Springsteen stated in his autobiography Born to Run, \"I have a personal relationship with Jesus. I believe in his power to save, love [...] but not to damn.\" In terms of his lapsed Catholicism, he has stated that he \"came to ruefully and bemusedly understand that once you're a Catholic you're always a Catholic\". He elaborated, \"I don't participate in my religion but I know somewhere... deep inside... I'm still on the team.\"[208]\n\nSpringsteen has spoken openly about his struggles with depression, which he accepted and began to face in his 30s.[209] Around this time, frustrated with being an underweight \"fast food junkie\" who would have to be helped off the stage after a show due to poor health, he began running up to six miles on a treadmill and lifting weights three times a week; in September 2019, an article celebrating his 70th birthday revealed that he has maintained this same workout routine since he began following it.[210] He has also reportedly followed a mostly vegetarian diet since around the same time, and has avoided hard drugs all of his life.[211]\n\nIn a June 2017 interview with Tom Hanks, Springsteen admitted to having been a tax evader early in his career.[212]\n\nRelationships [ edit ]\n\nSpringsteen dated actress Joyce Hyser for four years in the early 1980s. Previously, he had dated photographer Lynn Goldsmith and model Karen Darvin.[213] In the early 1980s, he met Patti Scialfa at The Stone Pony bar in New Jersey, the evening she was performing alongside his friend Bobby Bandiera, with whom she had written \"At Least We Got Shoes\" for Southside Johnny. Springsteen liked her voice, and after the performance he introduced himself to her. They soon started spending time together and became friends.[214]\n\nEarly in 1984 Springsteen asked Scialfa to join the E Street Band for the upcoming Born in the U.S.A. Tour. According to the book Bruce by Peter Ames Carlin, they seemed about to become a couple through the first leg of the tour;[215] however, Springsteen was introduced to actress Julianne Phillips and married her shortly after midnight on May 13, 1985 at Our Lady of the Lake Catholic Church in Lake Oswego, Oregon.[216][217][218] Opposites in background, the two had an 11-year age difference, and Springsteen's traveling took its toll on their relationship. Many of the songs on Tunnel of Love described the unhappiness he felt in his relationship with Phillips.[219] The Tunnel of Love Express Tour began in late February 1988 and Springsteen convinced Scialfa to rejoin the tour. She expressed reluctance at first because she wanted to start recording her first solo album, but when he told her the tour would be short, she agreed to postpone her own solo record and join the tour.[220] Phillips and Springsteen separated in the spring of 1988, but the separation was not made public.[citation needed] Springsteen and Scialfa fell in love during the Tunnel of Love Express Tour[citation needed] and started living together soon after his separation from Phillips.[221] Citing irreconcilable differences, Phillips filed for divorce in Los Angeles on August 30, 1988[222] and a settlement was reached in December and finalized on March 1, 1989.[223][224] They had no children.\n\nSpringsteen received press criticism for the apparent haste in which he and Scialfa started their relationship. In a 1995 interview with The Advocate, he told Judy Wieder about the negative publicity the couple subsequently received: \"It's a strange society that assumes it has the right to tell people whom they should love and whom they shouldn't. But the truth is, I basically ignored the entire thing as much as I could. I said, 'Well, all I know is, this feels real, and maybe I have got a mess going here in some fashion, but that's life.'\"[225] Years later, he reflected, \"'I didn't protect Juli... some sort of public announcement would have been fair, but I felt overly concerned about my own privacy. I handled it badly, and I still feel badly about it. It was cruel for people to find out the way they did.'\"[226]\n\nSpringsteen and Scialfa lived in New Jersey before moving to Los Angeles, where they decided to start a family.[227] On July 25, 1990, Scialfa gave birth to the couple's first child, Evan James Springsteen.[227][228] On June 8, 1991, Springsteen and Scialfa married at their Los Angeles home in a private ceremony, only attended by family and close friends.[227][228] Their second child, Jessica Rae Springsteen, was born on December 30, 1991.[227][228] Their third child, Samuel Ryan Springsteen, was born on January 5, 1994.[228][229] In a 1995 interview, Springsteen said, \"I went through a divorce, and it was really difficult and painful and I was very frightened about getting married again. So part of me said, 'Hey, what does it matter?' But it does matter. It's very different than just living together. First of all, stepping up publicly—which is what you do: You get your license, you do all the social rituals—is a part of your place in society and in some way part of society's acceptance of you ... Patti and I both found that it did mean something.\"[225]\n\nWhen their children reached school age in the 1990s, Springsteen and Scialfa moved back to New Jersey to raise them away from paparazzi. The family owns and lives on a horse farm in Colts Neck Township and has a home in Rumson; they also own homes in Los Angeles and Wellington, Florida.[230] Evan graduated from Boston College; he writes and performs his own songs and won the 2012 Singer/Songwriter Competition held during the Boston College's Arts Festival.[231] Jessica graduated from Duke University and is a nationally ranked champion equestrian.[232] She made her show-jumping debut with the Team USA in August 2014.[233] She won a silver medal as part of the U.S. equestrian team at the 2020 Summer Olympics, held in Tokyo in 2021 due to the COVID-19 epidemic. Sam is a Jersey City, New Jersey, firefighter.[234]\n\nOn July 17, 2022, Scialfa posted on social media that she and Springsteen became first-time grandparents when she announced the birth of a daughter of their son Sam.[235]\n\nPolitics [ edit ]\n\nThe Springsteens greeting the Obamas at a rally in November 2008\n\nSpringsteen supported Barack Obama's 2008 presidential campaign, announcing his endorsement in April 2008.[102] He appeared at several rallies in support of Obama's campaign throughout 2008.[103] At an Ohio rally, Springsteen discussed the importance of \"truth, transparency and integrity in government, the right of every American to have a job, a living wage, to be educated in a decent school, and a life filled with the dignity of work, the promise and the sanctity of home\".[236] The Topps company marked the support in a commemorative trading card set, in which Springsteen makes an appearance on card #59, \"the 'O' Street Band.\"[237] Despite saying that he would sit out the 2012 presidential election, Springsteen campaigned for Obama's re-election in Ohio, Iowa, Virginia, Pittsburgh, and Wisconsin.[122][123][124]\n\nSpringsteen is an activist for LGBT rights and has spoken out many times as a strong supporter of gay marriage. In an April 1996 interview with The Advocate he spoke of the importance of gay marriage: \"You get your license, you do all the social rituals. It's part of your place in society, and in some way part of society's acceptance of you.\"[225] In 2009, he posted the following statement on his website: \"I've long believed in and have always spoken out for the rights of same sex couples and fully agree with Governor Corzine when he writes that 'The marriage-equality issue should be recognized for what it truly is—a civil rights issue that must be approved to assure that every citizen is treated equally under the law.'\"[238] In 2012, he lent his support to an ad campaign for gay marriage called \"The Four 2012\". Springsteen noted in the ad, \"I couldn't agree more with that statement and urge those who support equal treatment for our gay and lesbian brothers and sisters to let their voices be heard now.\"[239] In April 2016, Springsteen cancelled a show in Greensboro, North Carolina, days before it was to take place to protest the state's newly passed Public Facilities Privacy & Security Act, also referred to as the \"bathroom law\", which dictates which restrooms transgender people are permitted to use and prevents LGBT citizens from suing over human rights violations in the workplace. Springsteen released an official statement on his website. The Human Rights Campaign celebrated Springsteen's statement, and he has received much praise and gratitude from the LGBT community.[240]\n\nDuring a 2017 show in Perth, Springsteen made a statement celebrating the post-inauguration Women's March against the incoming Trump administration in cities worldwide: \"We're a long way from home, and our hearts and spirits are with the hundreds of thousands of women and men that marched yesterday in every city in America, and in Melbourne ... [They] rallied against hate and division and in support of tolerance, inclusion, reproductive rights, civil rights, racial justice, LGBTQ rights, the environment, wage equality, gender equality, healthcare, and immigrant rights. We stand with you. We are the new American resistance.\"[241][242][243]\n\nSpringsteen was a staunch critic of Donald Trump throughout his presidency. In October 2019, he said Trump \"doesn't have a grasp of the deep meaning of what it means to be an American,\"[244] and in June 2020 called him a \"threat to our democracy\".[245] Springsteen's song \"The Rising\" was featured prominently in the 2020 Democratic National Convention in support of Joe Biden, accompanied with a new video and campaign slogan, #TheRising.[246] On October 13, 2020, author Don Winslow released a video critical of Trump prior to his campaign event in Pennsylvania. The video features Springsteen's song \"Streets of Philadelphia\".[247] A few days prior to the 2020 United States presidential election, Springsteen provided narration for a campaign ad that spotlights Biden's upbringing in Scranton, Pennsylvania with \"My Hometown\" playing throughout the ad.[248] Biden used \"We Take Care of Our Own\" as one of his theme songs, as Obama had before him in 2012.[249]\n\nDiscography [ edit ]\n\nStudio albums\n\nConcert tours [ edit ]\n\nSpringsteen has developed a reputation for energetic and long-lasting live performances.[250][251]\n\nHeadlining tours [ edit ]\n\nCo-headlining tours [ edit ]\n\nAchievements, awards, and nominations [ edit ]\n\nSpringsteen has sold more than 135 million records worldwide and more than 64 million records in the United States, making him one of the world's best-selling artists.[252][253] He has earned numerous awards for his work, including 20 Grammy Awards, two Golden Globes, an Academy Award, and a Special Tony Award (for Springsteen on Broadway). Springsteen was inducted into both the Songwriters Hall of Fame and the Rock and Roll Hall of Fame in 1999, received the Kennedy Center Honors in 2009, was named MusiCares person of the year in 2013, and was awarded the Presidential Medal of Freedom by President Barack Obama in 2016. In May 2021, Springsteen became the eighth recipient of the Woody Guthrie Prize, a prize that honors an artist who speaks out for social justice and carries on the spirit of the folk singer.[254]\n\nSee also [ edit ]\n\nNotes [ edit ]\n\n^ \"Blinded by the Light\" would later be a hit for Manfred Mann's Earth Band and reach No. 1, the only time Springsteen had a No. 1 single as a songwriter.\n\nReferences [ edit ]", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Kennedy_Center_honorees_2009_WhiteHouse_Photo.jpg/220px-Kennedy_Center_honorees_2009_WhiteHouse_Photo.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Super_bowl_half_time_show_%283976043491%29_%28cropped1%29.jpg/220px-Super_bowl_half_time_show_%283976043491%29_%28cropped1%29.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/91/20081102_Bruce_Springsteen_Michelle_and_Barack_Obama.JPG/150px-20081102_Bruce_Springsteen_Michelle_and_Barack_Obama.JPG", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/21/RisingTourGiantsStadiumLot.jpg/220px-RisingTourGiantsStadiumLot.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Bruce_Springsteen_2005.jpg/220px-Bruce_Springsteen_2005.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Bruce_Springsteen_-_Roskilde_Festival_2012.jpg/220px-Bruce_Springsteen_-_Roskilde_Festival_2012.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Beach_tickets.JPG/240px-Beach_tickets.JPG", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/20081102Bruce_Springsteen_and_family_greet_Barack_Obama_and_family.JPG/220px-20081102Bruce_Springsteen_and_family_greet_Barack_Obama_and_family.JPG", "http://en.wikipedia.org/static/images/footer/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Bruce_Springsteen_and_the_E_Street_Band_1977.jpg/240px-Bruce_Springsteen_and_the_E_Street_Band_1977.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Springsteen_playing_in_Sunderland%2C_June_2012.jpg/220px-Springsteen_playing_in_Sunderland%2C_June_2012.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Bruce_Springsteen_1988.jpg/220px-Bruce_Springsteen_1988.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/00/American_Land_ESB_Fireworks_Giants_100309.jpg/220px-American_Land_ESB_Fireworks_Giants_100309.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Bundesarchiv_Bild_183-1988-0719-38%2C_Bruce_Springsteen%2C_Konzert_in_der_DDR.jpg/170px-Bundesarchiv_Bild_183-1988-0719-38%2C_Bruce_Springsteen%2C_Konzert_in_der_DDR.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Bruce_Springsteen_Presidential_Medal_of_Freedom.jpg/220px-Bruce_Springsteen_Presidential_Medal_of_Freedom.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Bruce_Springsteen_Milan_2006_05_12.jpg/220px-Bruce_Springsteen_Milan_2006_05_12.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/Bruce_Springsteen_20080815.jpg/220px-Bruce_Springsteen_20080815.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/20081102_Bruce_Springsteen_at_Barack_Obama_rally_in_Cleveland.JPG/150px-20081102_Bruce_Springsteen_at_Barack_Obama_rally_in_Cleveland.JPG", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Bruce_Springsteen_-_Roskilde_Festival_2012.jpg/1200px-Bruce_Springsteen_-_Roskilde_Festival_2012.jpg", "http://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/20081102_Bruce_Springsteen_and_Barack_Obama_hug.JPG/150px-20081102_Bruce_Springsteen_and_Barack_Obama_hug.JPG"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Bruce_Springsteen_-_Roskilde_Festival_2012.jpg/1200px-Bruce_Springsteen_-_Roskilde_Festival_2012.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Bruce_Springsteen", "title": "Bruce Springsteen", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Bruce_Springsteen_-_Roskilde_Festival_2012.jpg/640px-Bruce_Springsteen_-_Roskilde_Festival_2012.jpg", "width": 640, "height": 962}, "title": "Bruce Springsteen - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}