{"url": "https://www.rollingstone.com/music/music-country/cma-awards-2017-the-complete-winners-list-129678/", "text": "The 51st CMA Awards were held in Nashville on Wednesday, with Garth Brooks taking home the night’s top honor of Entertainer of the Year for the sixth time in his storied career. Brooks, who triumphed over Chris Stapleton, Keith Urban, Luke Bryan and Eric Church, returned from hiatus in 2014 and launched a sprawling world tour that will continue through the end of 2017. Brothers Osborne and Chris Stapleton wound up as the night’s most-awarded performers, with two wins each.\n\nStapleton’s From A Room: Volume 1 was named Album of the Year, beating out a stack of critically acclaimed releases that included Miranda Lambert’s The Weight of These Wings and Jason Isbell and the 400 Unit’s The Nashville Sound. Stapleton previously won Album of the Year in 2015 for Traveller. He also added to his streak in the Male Vocalist of the Year category, beating out Dierks Bentley, Eric Church, Keith Urban and Thomas Rhett for his third consecutive win.\n\nIn a repeat from 2016, Brothers Osborne were named Vocal Duo of the Year, beating out a field that included Florida Georgia Line and Dan + Shay. TJ and John Osborne also took home a second award in the Music Video of the Year category for their action-packed send-up of Donald Trump in “It Ain’t My Fault,” directed by Ryan Silver and Wes Edwards. Additionally, the siblings performed on the telecast, combining their sinewy punch of “It Ain’t My Fault” with the late Don Williams’ funky “Tulsa Time.”\n\nJon Pardi won the first CMA Award of his career, taking home the New Artist of the Year prize after a breakthrough year with hits such as “Head Over Boots,” “Dirt on My Boots” and “Heartache on the Dance Floor.”\n\nMany past winners refused to be unseated from their respective categories. Miranda Lambert extended her reign as Female Vocalist of the Year, taking the category for the seventh consecutive time. Meanwhile, Little Big Town collected their sixth consecutive Vocal Group of the Year win. The vocal quartet also accepted the Song of the Year award for “Better Man” on behalf of its writer, Taylor Swift. The night’s big winner Brooks was himself a repeat champ: he took home Entertainer of the Year at the 2016 show.\n\nKeith Urban’s “Blue Ain’t Your Color” was named Single of the Year, giving the Aussie performer his 11th career win. Guitarist Mac McAnally was named Musician of the Year, marking his ninth win in the category. “Funny How Time Slips Away,” which the late Glen Campbell recorded with Willie Nelson for his farewell album Adios, won Musical Event of the Year.\n\nHere’s the complete winners list:\n\nEntertainer of the Year\n\nGarth Brooks – WINNER\n\nLuke Bryan\n\nEric Church\n\nChris Stapleton\n\nKeith Urban\n\nAlbum of the Year\n\nThe Breaker – Little Big Town\n\nFrom A Room: Vol. 1 – Chris Stapleton – WINNER\n\nHeart Break – Lady Antebellum\n\nThe Nashville Sound – Jason Isbell and the 400 Unit\n\nThe Weight of These Wings ­– Miranda Lambert\n\nSingle of the Year\n\n“Better Man” – Little Big Town\n\n“Blue Ain’t Your Color” – Keith Urban – WINNER\n\n“Body Like a Back Road” – Sam Hunt\n\n“Dirt on My Boots” – Jon Pardi\n\n“Tin Man” – Miranda Lambert\n\nSong of the Year\n\n“Better Man” – Little Big Town (songwriter: Taylor Swift) – WINNER\n\n“Blue Ain’t Your Color” – Keith Urban (songwriters: Clint Lagerberg, Hillary Lindsey, Steven Olsen)\n\n“Body Like a Back Road” – Sam Hunt (songwriters: Zach Crowell, Sam Hunt, Shane McAnally, Josh Osborne)\n\n“Dirt on My Boots” – Jon Pardi (songwriters: Rhett Akins, Jesse Frasure, Ashley Gorley)\n\n“Tin Man” – Miranda Lambert (songwriters: Jack Ingram, Miranda Lambert, Jon Randall)\n\nMale Vocalist of the Year\n\nDierks Bentley\n\nEric Church\n\nThomas Rhett\n\nChris Stapleton – WINNER\n\nKeith Urban\n\nFemale Vocalist of the Year\n\nKelsea Ballerini\n\nMiranda Lambert – WINNER\n\nReba McEntire\n\nMaren Morris\n\nCarrie Underwood\n\nNew Artist of the Year\n\nLuke Combs\n\nOld Dominion\n\nJon Pardi – WINNER\n\nBrett Young\n\nLauren Alaina\n\nVocal Duo of the Year\n\nDan + Shay\n\nFlorida Georgia Line\n\nLoCash\n\nMaddie and Tae\n\nBrothers Osborne – WINNER\n\nVocal Group of the Year\n\nLady Antebellum\n\nLittle Big Town – WINNER\n\nOld Dominion\n\nRascal Flatts\n\nZac Brown Band\n\nMusic Video of the Year\n\n“Better Man” – Little Big Town\n\n“Blue Ain’t Your Color” – Keith Urban\n\n“Craving You” – Thomas Rhett feat. Maren Morris\n\n“It Ain’t My Fault” – Brothers Osborne – WINNER\n\n“Vice” – Miranda Lambert\n\nMusical Event of the Year\n\n“Craving You” – Thomas Rhett feat. Maren Morris\n\n“Funny How Time Slips Away” – Glen Campbell with Willie Nelson – WINNER\n\n“Kill a Word” – Eric Church feat. Rhiannon Giddens\n\n“Setting the World on Fire” – Kenny Chesney with Pink\n\n“Speak to a Girl” – Tim McGraw and Faith Hill\n\nMusician of the Year\n\nJerry Douglas (Dobro)\n\nPaul Franklin (Steel guitar)\n\nDann Huff (Guitar)\n\nMac McAnally (Guitar) – WINNER\n\nDerek Wells (Guitar)", "images": ["https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-871876868-7c16e969-86ac-4f62-bb38-c152b87bb41d.jpg?w=1581&h=1054&crop=1", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2022/assets/public/lazyload-fallback.gif", "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-871876868-7c16e969-86ac-4f62-bb38-c152b87bb41d.jpg?w=500&h=375&crop=1"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-871876868-7c16e969-86ac-4f62-bb38-c152b87bb41d.jpg?w=500&h=375&crop=1", "keywords": [], "authors": ["Rolling Stone"], "canonical_link": "https://www.rollingstone.com/music/music-country/cma-awards-2017-the-complete-winners-list-129678/", "title": "CMA Awards 2017: The Complete Winners List", "meta_data": {"theme-color": "#df3535", "viewport": "width=device-width, initial-scale=1.0", "description": "The complete winners list of the 2017 CMA Awards.", "news_keywords": "Chris Stapleton, Miranda Lambert", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "rollingstone", "pmc-page_type": "article", "articleid": 129678, "author": "Rolling Stone", "pmc-category": "Music,Music Country", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-11-08T14:54:00"}, "pmc-tag": "Chris Stapleton,Miranda Lambert", "title": "CMA Awards 2017: The Complete Winners List", "pageclass": "article", "pmc-is_free": "no", "pmc-branded-content": "no", "pmc-evergreen": "no"}, "generator": "WordPress 6.0.2", "author": "Rolling Stone", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "RS", "application-name": "RS", "content_type": "Article", "post_id": 129678, "title": "CMA Awards 2017: The Complete Winners List", "published_at": "2017-11-08 14:54:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-871876868-7c16e969-86ac-4f62-bb38-c152b87bb41d.jpg?w=1024", "comment_count": 0, "tags": "Miranda Lambert", "topics": "Music Country", "body": "The 51st CMA Awards were held in Nashville on Wednesday, with Garth Brooks taking home the night's top honor of Entertainer of the Year for the sixth time in his storied career. Brooks, who triumphed over Chris Stapleton, Keith Urban, Luke Bryan and Eric Church, returned from hiatus in 2014 and launched a sprawling world tour that will continue through the end of 2017. Brothers Osborne and Chris Stapleton wound up as the night's most-awarded performers, with two wins each.Stapleton's From A Room: Volume 1 was named Album of the Year, beating out a stack of critically acclaimed releases that included Miranda Lambert's The Weight of These Wings and Jason Isbell and the 400 Unit's The Nashville Sound. Stapleton previously won Album of the Year in 2015 for Traveller. He also added to his streak in the Male Vocalist of the Year category, beating out Dierks Bentley, Eric Church, Keith Urban and Thomas Rhett for his third consecutive win.In a repeat from 2016, Brothers Osborne were named Vocal Duo of the Year, beating out a field that included Florida Georgia Line and Dan + Shay. TJ and John Osborne also took home a second award in the Music Video of the Year category for their action-packed send-up of Donald Trump in \"It Ain't My Fault,\" directed by Ryan Silver and Wes Edwards. Additionally, the siblings performed on the telecast, combining their sinewy punch of \"It Ain't My Fault\" with the late Don Williams' funky \"Tulsa Time.\" Jon Pardi won the first CMA Award of his career, taking home the New Artist of the Year prize after a breakthrough year with hits such as \"Head Over Boots,\" \"Dirt on My Boots\" and \"Heartache on the Dance Floor.\" Many past winners refused to be unseated from their respective categories. Miranda Lambert extended her reign as Female Vocalist of the Year, taking the category for the seventh consecutive time. Meanwhile, Little Big Town collected their sixth consecutive Vocal Group of the Year win. The vocal quartet also accepted the Song of the Year award for \"Better Man\" on behalf of its writer, Taylor Swift. The night's big winner Brooks was himself a repeat champ: he took home Entertainer of the Year at the 2016 show.Keith Urban's \"Blue Ain't Your Color\" was named Single of the Year, giving the Aussie performer his 11th career win. Guitarist Mac McAnally was named Musician of the Year, marking his ninth win in the category. \"Funny How Time Slips Away,\" which the late Glen Campbell recorded with Willie Nelson for his farewell album Adios, won Musical Event of the Year.Here's the complete winners list:Entertainer of the YearGarth Brooks – WINNERLuke BryanEric ChurchChris StapletonKeith UrbanAlbum of the YearThe Breaker – Little Big TownFrom A Room: Vol. 1 – Chris Stapleton – WINNERHeart Break – Lady AntebellumThe Nashville Sound – Jason Isbell and the 400 UnitThe Weight of These Wings ­– Miranda LambertSingle of the Year\"Better Man\" – Little Big Town\"Blue Ain't Your Color\" – Keith Urban – WINNER\"Body Like a Back Road\" – Sam Hunt\"Dirt on My Boots\" – Jon Pardi\"Tin Man\" – Miranda LambertSong of the Year\"Better Man\" – Little Big Town (songwriter: Taylor Swift) – WINNER\"Blue Ain't Your Color\" – Keith Urban (songwriters: Clint Lagerberg, Hillary Lindsey, Steven Olsen)\"Body Like a Back Road\" – Sam Hunt (songwriters: Zach Crowell, Sam Hunt, Shane McAnally, Josh Osborne)\"Dirt on My Boots\" – Jon Pardi (songwriters: Rhett Akins, Jesse Frasure, Ashley Gorley)\"Tin Man\" – Miranda Lambert (songwriters: Jack Ingram, Miranda Lambert, Jon Randall)Male Vocalist of the YearDierks BentleyEric ChurchThomas RhettChris Stapleton – WINNERKeith UrbanFemale Vocalist of the YearKelsea BalleriniMiranda Lambert – WINNERReba McEntireMaren MorrisCarrie UnderwoodNew Artist of the YearLuke CombsOld DominionJon Pardi – WINNERBrett YoungLauren AlainaVocal Duo of the YearDan + ShayFlorida Georgia LineLoCashMaddie and TaeBrothers Osborne – WINNERVocal Group of the YearLady AntebellumLittle Big Town – WINNEROld DominionRascal FlattsZac Brown BandMusic Video of the Year\"Better Man\" – Little Big Town\"Blue Ain't Your Color\" – Keith Urban\"Craving You\" – Thomas Rhett feat. Maren Morris\"It Ain't My Fault\" – Brothers Osborne – WINNER\"Vice\" – Miranda LambertMusical Event of the Year\"Craving You\" – Thomas Rhett feat. Maren Morris\"Funny How Time Slips Away\" – Glen Campbell with Willie Nelson – WINNER\"Kill a Word\" – Eric Church feat. Rhiannon Giddens\"Setting the World on Fire\" – Kenny Chesney with Pink\"Speak to a Girl\" – Tim McGraw and Faith HillMusician of the Year Jerry Douglas (Dobro)Paul Franklin (Steel guitar)Dann Huff (Guitar)Mac McAnally (Guitar) – WINNERDerek Wells (Guitar)", "fb": {"pages": 10664530778}, "onesignal": "wordpress-plugin", "og": {"type": "article", "title": "CMA Awards 2017: The Complete Winners List", "url": "https://www.rollingstone.com/music/music-country/cma-awards-2017-the-complete-winners-list-129678/", "description": "From Entertainer of the Year to New Artist, here are the winners of the 51st CMAs", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-871876868-7c16e969-86ac-4f62-bb38-c152b87bb41d.jpg?w=500&h=375&crop=1", "width": 1024, "height": 681, "alt": "Miranda Lambert"}, "locale": "en_US"}, "article": {"published_time": "2017-11-08T14:54:00+00:00", "modified_time": "2018-06-25T17:04:09+00:00"}, "twitter": {"site": "@RollingStone", "card": "summary_large_image", "title": "CMA Awards 2017: The Complete Winners List", "description": "The complete winners list of the 2017 CMA Awards.", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/gettyimages-871876868-7c16e969-86ac-4f62-bb38-c152b87bb41d.jpg?w=1024"}, "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2022/08/cropped-Rolling-Stone-Favicon.png?w=270"}, "movies": [], "publish_date": 1510152840.0, "source": "https://www.rollingstone.com", "summary": ""}