{"url": "https://www.care.com/c/stories/6477/neurological-disorders-in-dogs-signs-and-car/", "text": "When a dog has a neurological problem, symptoms can be very obvious, sudden and scary.\n\nParalysis, tremors or seizures are a few symptoms that something is amiss in a dog’s nervous system — the network of cells that carry signals to and from the brain and the body.\n\nTo give your dog the best chance at recovery from a neurological disorder, it’s important for you to recognize signs. Your best ally during this frightening time is knowledge and, of course, professionals like veterinary neurologists, specialists who have been trained to identify signs and provide care when the nervous system is involved.\n\nTo help you stay informed, we asked experts to share important information about the more common types of neurological disorders seen in dogs, symptoms, how they are diagnosed and potential treatments.\n\nWhat is a canine neurological disorder?\n\nCanine neurological disorders are illnesses that stem from your pet’s central or peripheral nervous system. According to Dwight Alleyne, a veterinarian at Acres Mill Animal Hospital in Canton, Georgia, the three main areas affected by canine neurological disorders are the brain, spinal cord and nerves.\n\nWhat are common symptoms of neurological disorders?\n\nWith brain disorders, Alleyne says, symptoms can include:\n\nSeizures\n\nHead tilt\n\nTremors\n\nBlindness\n\nWith the spinal cord, symptoms include:\n\nUnsteady gait or complete paralysis of front or hind limbs\n\nProblems with urination\n\nLoss of sense of pain in the affected limbs\n\nWith nerves affecting the face, symptoms include:\n\nFacial paralysis\n\nInability to blink\n\nLoss of tongue function\n\nHow are neurological disorders typically diagnosed?\n\nEvelyn Galban, DVM, MS, DACVIM, associate professor of Clinical Neurology at the University of Pennsylvania School of Veterinary Medicine, says that when a dog has a suspected neurologic problem, a veterinarian will begin their assessment with a thorough history, including questions like:\n\nWhen did signs begin?\n\nIs the patient in pain?\n\nHas there been travel or injuries?\n\nDid they eat something they should not have, or are they receiving any medications?\n\nYou can expect your dog to receive a physical examination and a more specific neurologic examination, testing nerve function and reflexes.\n\n“Often, tests to evaluate systemic health, like blood work or urinalysis to look at blood cells and organ function, will be recommended,” Galban says. “Often imaging the area will be a next step, and that includes radiographs or more advanced diagnostics, like MRI or CT scan.”\n\nWhat are some common neurological disorders in dogs?\n\nVestibular disease\n\nA dog’s vestibular system helps maintain balance and coordination of head and eye movements. Galban says veterinarians can break down clinical signs into these types of conditions caused by a problem in the peripheral system (the inner ear) or the more central system (the brainstem).\n\nSigns of problems in your dog’s vestibular system include:\n\nHead tilt\n\nNausea\n\nDifficulty standing\n\nShifting eyes (called nystagmus)\n\nA condition often diagnosed in older dogs is Old Dog Vestibular Disease. It can affect the balance center in dogs suddenly and make the canine feel like the room is spinning.\n\n“Most owners think their dog had a stroke, but this is not the case — it’s an issue with the nerves of the balance center of the inner ear,” says Jon Klingborg, a veterinarian at Valley Animal Hospital in Merced, California.\n\nTreatment typically includes administering injectable anti-nausea drugs, as well as keeping your pet comfortable through veterinary supportive care.\n\n“In some cases, vestibular syndrome is secondary to an ear infection, so the veterinarian can determine if that’s the issue or not and treat accordingly,” Klingborg says. “With proper veterinary care, most dogs will recover in a few weeks.”\n\nSeizures\n\n“Seizures are episodes of abnormal electrical activity in the brain and we break the causes down into three main categories,” says Galban.\n\nFirst, seizures can be caused by a metabolic problem like low blood sugar or low calcium, which can typically be identified via blood tests. The second potential cause of seizures could be something structural, like a tumor or infection in the brain.\n\n“We use advanced imaging or MRI and spinal tap to help rule out these causes,” Galban says.\n\nIf both of the above causes have been ruled out, a third cause, idiopathic epilepsy, or seizures with no certain cause, is what’s left.\n\n“With seizures, the goal of treatment is to decrease the frequency and severity of episodes,” Galban says. “To do this, we use anti-epileptic drugs alone or in combination to achieve the best results. In dogs with idiopathic epilepsy, about 75 percent are able to achieve good seizure control with medication.”\n\nSpinal disease\n\nA dog’s spinal cord carries important information to and from the limbs and body. When there is a problem in the spinal cord, called a myelopathy, signs can vary from pain to scuffing feet to complete paralysis, according to Galban.\n\n“Your veterinarian can localize what part of the spinal cord is affected and how severely as the first step in determining the cause,” she says. “From there, special imaging techniques like MRI and CT can be used to give a diagnosis and help develop treatment plans.”\n\nWobbler Syndrome\n\nAccording to Alleyne, this disease commonly affects large and giant breed dogs. It’s caused by a constellation of abnormalities in the vertebrae and soft tissues of the neck that cause compression of the spinal cord. Signs include a slowly progressive unsteady gait, initially in the hind limbs, but also affecting the front limbs.\n\n“Dogs often don’t know where their feet are when they touch the ground, leading to what is called a proprioceptive deficit,” Alleyne says.\n\nA CT scan or MRI of the spine diagnoses it. Treatment can include surgery or four to eight weeks of steroid therapy.\n\n“About 80 percent of dogs will improve with surgery,” Alleyne says. “Less than 50 percent will improve with medical therapy.”\n\nIntervertebral disc degeneration and herniation\n\nA common cause of neck or back pain and lack of coordination of the limbs in dogs is intervertebral disc disease (IVDD), according to Galban.\n\n“Disc material normally functions to provide cushioning between the bones in the spine,” she says. “In predisposed dogs, the intervertebral discs become dehydrated and hardened. This predisposes them to acutely rupture or move from their position into the spinal canal, which can cause compression of the spinal cord.”\n\nSigns of spinal cord compression can include:\n\nPain\n\nWeakness\n\nLack of coordination\n\nDiagnosis of this condition typically involves advanced imaging, such as MRI.\n\n“Depending on the severity of clinical signs, medical or surgical management might be recommended,” Galban says. “The prognosis varies with the severity of the spinal cord injury. However, many dogs do quite well with appropriate and timely care.”", "images": ["https://www.care.com/c/wp-content/uploads/sites/2/2022/09/GettyImages-1344938288.jpg.optimal.jpg", "https://www.care.com/c/wp-content/uploads/sites/2/2022/09/GettyImages-1351251055.jpg.optimal.jpg", "https://www.care.com/c/wp-content/uploads/sites/2/2021/04/LaurenGarcia-201937090337873005.jpg.optimal.jpg", "https://www.care.com/c/wp-content/uploads/sites/2/2021/04/LaurenGarcia-201937090337873005-1620x1080.jpg.optimal.jpg", "https://www.care.com/c/wp-content/uploads/sites/2/2022/09/pet-costumes-2022.png", "https://www.care.com/c/wp-content/uploads/sites/2/2022/09/GettyImages-1298364906.jpg.optimal.jpg", "https://secure.gravatar.com/avatar/58f90eaab4e9a01b1f58d93d97bb444d?s=150&d=mm&r=g", "https://www.care.com/c/wp-content/uploads/sites/2/2022/10/GettyImages-1200203446.jpg.optimal.jpg", "https://www.care.com/c/wp-content/uploads/sites/2/2021/04/robyncorrell-202017180017960354None.jpg.optimal.jpg", "https://www.care.com/c/wp-content/uploads/sites/2/2021/04/Care_com_classic_logo.svg", "https://www.facebook.com/tr?id=284726028402266&ev=PageView&noscript=1"], "top_img": "https://www.care.com/c/wp-content/uploads/sites/2/2021/04/LaurenGarcia-201937090337873005.jpg.optimal.jpg", "keywords": [], "authors": ["Amy Jamieson"], "canonical_link": "https://www.care.com/c/neurological-disorders-in-dogs-signs-and-car/", "title": "Neurological disorders in dogs: signs, diagnosis and treatments", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Neurological disorders in dogs: signs, diagnosis and treatments", "description": "When a dog has a neurological problem, symptoms can be very obvious, sudden and scary.   Paralysis, tremors or seizures are a few symptoms that something is amiss in a dog’s nervous system — the network of cells that carry signals to and from the brain and the body. To give your dog the best Read more...", "url": "https://www.care.com/c/neurological-disorders-in-dogs-signs-and-car/", "site_name": "Care.com Resources", "image": {"identifier": "https://www.care.com/c/wp-content/uploads/sites/2/2021/04/LaurenGarcia-201937090337873005.jpg.optimal.jpg", "width": 2121, "height": 1414, "type": "image/jpeg"}}, "article": {"publisher": "https://www.facebook.com/caredotcom", "published_time": "2022-03-18T18:14:50+00:00", "modified_time": "2021-07-21T02:02:51+00:00"}, "author": "Amy Jamieson", "twitter": {"card": "summary_large_image", "creator": "@CareDotCom", "site": "@CareDotCom"}, "generator": "WPML ver:4.5.7 stt:70,1,66,67,68,69;", "msapplication-TileImage": "https://www.care.com/c/wp-content/uploads/sites/2/2021/04/favicon-0492fe15c89dcc86bb67c2fe6f778af6.png"}, "movies": [], "publish_date": 1647627290.0, "source": "https://www.care.com", "summary": ""}