{"url": "http://toofab.com/2018/03/26/5-reasons-you-should-give-roseanne-a-chance-no-matter-your-political-views/", "text": "ABC\n\nFor eight seasons (the last one doesn't count), \"Roseanne\" was groundbreaking in its portrayal of working-class Americans, struggling to make ends meet from paycheck to paycheck, held together by an independent-thinking, liberal, feminist icon in Roseanne Barr. More than 20 years later, the Conner family is back, only this time Roseanne Conner voted Republican.\n\nThat single character decision has divided fans before the show even aired, but we're here to tell people on both sides of the political spectrum to put away their pitchforks and give it a chance. It's still the same \"Roseanne,\" and the same Roseanne, no matter how she voted.\n\nRoseanne Barr never shied away from difficult social issues and political topics during the show's original run, so it makes sense she would continue that trend in the revival, and there are so many issues and topics to tackle from the Conner's still somewhat unique perspective on television as a middle class family (we see you \"The Middle\").\n\nIf you're a Trump supporter and you're looking for \"Roseanne\" to stand firmly in your corner, you might be disappointed. If you're a Trump hater, \"Roseanne\" doesn't have your back, either. Instead, it offers a place to have a meaningful discussion about those specific issues that are really dividing us surrounded by people we love. It's a show that wears its politics on its sleeve, and always has, but those politics don't define the show, nor are they the reason we tune in.\n\nBelow are the five main reasons you should give the new \"Roseanne\" a chance, no matter your political view:\n\nPolitical Without Being Political\n\nAll those people wondering how a working-class mom in Middle America could ever vote for Trump are forgetting that people like the Conners are exactly who did vote for Trump. Most importantly, though, the show's writers realize that nothing is as simple as right and left, or even right and wrong, and Roseanne's vote is treated like everything else has been in the show's history: with sensitivity, understanding and laugh-out-loud sarcasm and humor.\n\n\"Roseanne\" touched on hot-button issues like gay rights before it was acceptable to talk about that on television, so of course the show is going to embrace the topical issues of our time. And there are so very many of them to explore through the limited understanding of the Conners, and that's why the show still works. This family doesn't have all the answers, and they don't even always understand the issues fully, but that doesn't stop them from caring passionately about them and having strong opinions about them. Sound familiar?\n\nThe Conners Are All of Us\n\nUnless you're a Kardashian, chances are the Conners speak to you on a visceral level. They've worked hard for what they have, and some of their biggest fears include suddenly losing their job and having to scramble to keep what little they've managed to accumulate, or getting sick and not having the insurance coverage necessary to be able to afford it. And yet, they live and love their lives fully, because what else is there? They have always been, and still are one of the most relatable families ever on television.\n\nWhile it might have been nice to imagine that the kids all grew up to be multimillionaires, \"Roseanne\" has never traded in that kind of fantasy (we told you, Season 9 doesn't count!). Darlene (Sara Gilbert), Becky (Lecy Goranson) and DJ (Michael Fishman) did all grow up and have adult lives of their own, but they were all extraordinarily ordinary, and we wouldn't want it any other way. There is a surprising grace in the ordinary life, and it is within that world that \"Roseanne\" has always excelled at finding the funny, the heart and the beauty.\n\nIt's Still Funny\n\n\"Roseanne\" was groundbreaking in its time (like \"Married...With Children\") because the family was sarcastic and insulted one another. In other words, they were more like real families and real people than we'd ever seen before. It might seem quaint in a television landscape where that kind of realism has become the norm, but this revival proves that the originals never go out of style. Darlene still gives the most scathing insults to Becky, and nobody can touch the love-filled hate -- or is that hate-filled love? -- that Roseanne and Jackie (Laurie Metcalf) sling at one another.\n\nRoseanne is the queen of the put-down, and Dan (John Goodman) is the oft-overwhelmed emotional heart of the entire ensemble, and none of them have lost a beat of their comedic timing. Watching Roseanne and Dan together, it's easy to imagine them having been married for 45 years, the chemistry between them is palpable and the love and affection rings through all the insults and yelling.\n\nAll You Need Is Love\n\nNo matter how much they scream and fight, and they do it a lot, \"Roseanne\" succeeds because this is a family that loves one another and listens to one another. Even if they don't always understand why Jackie is so passionately smug about things she knows nothing about, they tolerate it and her because they love her. That's the message that ran through every episode of the original run, and it's what elevated \"Roseanne\" above so many other shows, even as it tackled serious topics and tough issues.\n\nDan and Roseanne could have a blowout fight over women's rights or how to raise their kids, but that wouldn't be the end of the conversation. In fact, it was usually just the beginning. It's when cooler heads prevailed that they could sit down and talk through the issue until either one of them backed down or they reached a mutual compromise. That love and respect -- liberally sprinkled with funny commentary -- allowed \"Roseanne\" to talk about serious issues without losing its viewers, and it's the same philosophy employed in these new episodes. It softens the blows of the insults and makes the tougher topics easier to explore.\n\nThe Next Generation\n\nIf the idea of hanging out with Jackie, Roseanne, Dan and the kids doesn't entice you to check out the new series, it's worth it to see how twenty years has changed the next generation of Conners. Season 10 not only introduces us to the adult versions of Becky, Darlene and DJ, but also to their children. The whole revival is like a fun family reunion where we can't believe how much older everybody looks and we can't stop squeezing the cheeks of all the new kiddos.\n\nMark is the clear breakout character so far, played with impressive depth and nuance by newcomer Ames McNamara. The son of Darlene and David (Johnny Galecki), Mark likes to dress in women's fashion, but like everything else on \"Roseanne,\" his reasons aren't as clear-cut as you might imagine. \"Shameless\" star Emma Kenney plays his sister Harris, and while she hasn't been given much material beyond sullen teen daughter in the episodes available to screen, we know the depth of Kenney's talent so we imagine there is more in store.\n\nAs for DJ's young daughter Mary (Jayden Rey), there is a lot of mystery surrounding her. She's adorable, and like Keshia Knight Pulliam on \"The Cosby Show\" or the Olsen Twins on \"Full House,\" that is her primary duty so far, but we are eager to find out more about DJ's life, his wife and how this family came to be.\n\nIt's a rarity on television to get the opportunity to revisit our favorite fictional families during the next chapter of their lives, and the Conners were always one of the most fully realized and believable clans on the airwaves. Their return is at equal times totally familiar and comfortable, while at the same time refreshed for the new millennium. Best of all, it's every bit as funny as we remember. Now, if someone could tell us were 20 years went?\n\n\"Roseanne\" premieres Tuesday night at 8 p.m. ET on ABC with back-to-back episodes.", "images": ["https://images.toofab.com/image/3f/3by2/2022/10/05/3ffae1c2aa4b4ae08bba9ca0ffca7702_md.jpg", "https://images.toofab.com/image/0c/2by3/2022/10/03/0c8eaaa39c934072b49d2d26590b3acf_xs.jpg", "https://images.toofab.com/image/8f/16by9/2018/03/26/8f37385d55bb5f618bd4873d84c8edc0_xl.jpg", "https://images.toofab.com/image/63/5by4/2018/03/18/63ae5de4281a51c7970365080cd2e770_xs.jpg", "https://images.toofab.com/image/02/2by3/2022/10/06/02f8dae158224fef81315cde92fc9ef1_xs.jpg", "https://images.toofab.com/image/a5/4by3/2017/10/25/a5c20480e34059498770f400d8901fb6_md.jpg", "https://images.toofab.com/image/7b/4by3/2022/10/06/7ba6d79f88e14d70bffca38d3f38c318_sm.jpg", "https://images.toofab.com/image/be/5by4/2018/03/27/befd4fed9a5358aaaa50e09c519f2c37_xs.jpg", "https://images.toofab.com/image/39/2by3/2022/10/03/39d6ab76bda6491b896e9683c766c3f6_xs.jpg", "https://images.toofab.com/image/fe/5by4/2018/01/09/fe9242a0ea3b5af6b61fbab2c9ace87d_xs.jpg", "https://images.toofab.com/image/34/o/2018/03/26/34d6fcccdc43537f88d0f76c1b1648a9_md.jpg", "https://images.toofab.com/image/49/2by3/2022/10/07/49f6de19a159456189138e9c903768cd_xs.jpg", "https://images.toofab.com/image/06/2by3/2022/10/07/06987f7243784718b93e1692e8b75099_xs.jpg", "https://images.toofab.com/image/4a/2by3/2022/10/05/4ab592e0012c4eb98454932121fdd26d_xs.jpg", "https://images.toofab.com/image/9a/2by3/2022/10/05/9acbe7261a034df88e225ae344cc7b2a_xs.jpg", "https://images.toofab.com/image/b0/2by3/2022/10/05/b0deec921f8b44509a87f506c556a741_xs.jpg", "https://images.toofab.com/image/d3/2by3/2022/09/30/d30f8b9e23b048888812dd3ff17ead97_xs.jpg", "https://images.toofab.com/image/01/4by3/2022/10/06/013d042ece3a4d118b04c8602c6f5ba9_sm.jpg", "https://images.toofab.com/image/2e/5by6/2022/10/07/2e19fe6a0f3844bb8a4f2cc475a9e16e_md.jpg", "https://static.toofab.com/toofab-web/img/toofab-logo-white.svg", "https://images.toofab.com/image/d3/2by3/2022/10/05/d3d12f54e0604ac681d1eb3b1444c7f3_xs.jpg", "https://images.toofab.com/image/70/4by3/2022/10/06/70ec19b507384877a3d5fd60b8f33bbf_sm.jpg", "https://images.toofab.com/image/64/5by6/2022/10/05/643d928365e2499a88cf9121fdde59dd_md.jpg", "https://images.toofab.com/image/2b/2by3/2022/10/06/2bbcf07aba1846b282ce6b184e453df8_xs.jpg", "https://images.toofab.com/image/07/2by3/2022/10/04/0724125990d24cb58f2a45d2f0245b19_xs.jpg", "https://images.toofab.com/image/8e/5by4/2018/03/23/8e902a60aff05a06a27ea3c69892dc07_xs.jpg", "https://images.toofab.com/image/b5/3by2/2022/10/06/b57c8717abd041158cf14bf322b41ea3_md.jpg", "https://images.toofab.com/image/a2/4by3/2022/10/05/a2112e7fc22c4fdda98ee922cc4bd6a2_sm.jpg"], "top_img": "https://images.toofab.com/image/8f/16by9/2018/03/26/8f37385d55bb5f618bd4873d84c8edc0_xl.jpg", "keywords": [], "authors": ["Toofab Staff"], "canonical_link": "https://toofab.com/2018/03/26/5-reasons-you-should-give-roseanne-a-chance-no-matter-your-political-views/", "title": "5 Reasons You Should Give 'Roseanne' a Chance, No Matter Your Political Views", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "google-site-verification": "JHSxtKhEsTL_hpvIJB7Z_rx6B--w25QC-LHhSPPDFbc", "verify-v1": "Wtpd0N6FufoE2XqopQJoTjWV6Co/Mny9BTaswPJbPPA=", "msvalidate.01": "AFEB17971BCF30779AEA662782EF26F4", "y_key": "14cb04e4656b0c58", "robots": "index,follow", "description": "\"Roseanne\" has never shied away from tough political issues, but it's how they're dealt with that draws us in.", "article": {"publisher": "https://www.facebook.com/toofab"}, "og": {"site_name": "Toofab", "type": "article", "url": "https://toofab.com/2018/03/26/5-reasons-you-should-give-roseanne-a-chance-no-matter-your-political-views/", "title": "5 Reasons You Should Give 'Roseanne' a Chance, No Matter Your Political Views", "description": "\"Roseanne\" has never shied away from tough political issues, but it's how they're dealt with that draws us in.", "image": "https://images.toofab.com/image/8f/16by9/2018/03/26/8f37385d55bb5f618bd4873d84c8edc0_xl.jpg"}, "twitter": {"site": "@Toofab", "card": "summary_large_image", "title": "5 Reasons You Should Give 'Roseanne' a Chance, No Matter Your Political Views", "description": "\"Roseanne\" has never shied away from tough political issues, but it's how they're dealt with that draws us in.", "image": "https://images.toofab.com/image/8f/16by9/2018/03/26/8f37385d55bb5f618bd4873d84c8edc0_xl.jpg"}, "application-name": "Toofab.com", "mobile-web-app-capable": "yes", "theme-color": "#f3f3f3", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "#f3f3f3", "apple-mobile-web-app-title": "Toofab.com", "msapplication-TileImage": "https://static.toofab.com/toofab-web/icons/msapplication-tile-image-270x270-v1.png", "msapplication-TileColor": "#282828", "msapplication-starturl": "https://toofab.com/?adid=IE9pin", "msapplication-navbutton-color": "#282828", "msapplication-window": "width=1024;height=768", "msapplication-tooltip": "Toofab.com", "msapplication-task": "name=Photos;action-uri=https://toofab.com/photos/;icon-uri=https://static.toofab.com/toofab-web/icons/favicon-32x32-v1.png"}, "movies": [], "publish_date": 1522018800.0, "source": "http://toofab.com", "summary": ""}