{"url": "https://www.tennessean.com/story/entertainment/music/2017/06/07/stars-hit-red-carpet-2017-cmt-music-awards/379280001/", "text": "5 big moments from the 2017 CMT Music Awards\n\nShow Caption Hide Caption Stars on CMT red carpet on who will sing the national anthem Country stars on the CMT red carpet speculate who willsing the national anthem at game 6 of the Stanley Cup final. Video: Michael Schwab/Photo: Larry McCormack\n\nThe 2017 CMT Music Awards might have downsized in space with its move from Bridgestone Arena to Music City Center to accommodate the Nashville Predators' run for the Stanley Cup, but country music stars and fans still came out in force to celebrate country’s most successful videos Wednesday night.\n\nHere are five things to know about one of country music's biggest nights:\n\nKeith Urban won big\n\nKeith Urban racked up at the 2017 CMT Music Awards. Urban’s video for “Blue Ain’t Your Color” won Video of the Year and Male Video of the Year, and Urban won Social Superstar at the fan-voted awards show. His duet with Carrie Underwood on “The Fighter” won Collaborative Video of the Year, and they turned in one of the night’s most memorable performances — a stripped bare and emotional performance of their hit.\n\nBy the time his name was announced for Video of the Year, he was nearly speechless.\n\n“I don’t know what to say. This award is for everybody watching this, everybody outside who couldn’t get in, everybody who comes to see us play in concert. I wish God’s blessings for you and all of your families,” he said. “I love making music.”\n\nCarrie Underwood skated to 17th CMT award\n\nCarrie Underwood has long been a favorite of CMT Music Awards voters, and Wednesday was no different. Add in the fact that Underwood’s husband plays for the Nashville Predators, which are competing for the Stanley Cup, and her camera time only went up.\n\nUnderwood is the awards show’s top-winning singer in its history, and she only grew her margin with two wins Wednesday night. In addition to Underwood’s win with Urban, her “Church Bells” won Female Video of the Year, bringing her total of CMT Music Awards to 17 over the show’s history.\n\n“Thank you to all the people who came out to see us on tour and were a part of this video. This awards show is really cool because it’s fan voted. ... Go Preds!\"\n\nRelated stories:\n\n► Why Ashton Kutcher mic-dropped a catfish at the CMT Awards\n\n► CMT Awards open with all-star tribute to Gregg Allman\n\n► Lauren Alaina's tearful speech at CMT Awards\n\nAshton Kutcher went catfishing\n\nThe 2017 CMT Music Awards momentarily turned into a pep rally for the hometown hockey club Wednesday when Ashton Kutcher mic-dropped a catfish on the stage.\n\nNashville has gone catfish crazy of late, as it has become something of a ritual for fans to hurl the whiskered fish onto the ice during games.\n\nThe television and film star took part in the tradition before announcing the award for best collaborative video, name-checking each of the nominees — including Underwood, who just so happens to be married to Nashville Predators captain Mike Fisher.\n\nKutcher joked that her nickname would soon be \"Carrie the Stanley Cup across this great city of Nashville.\"\n\nCrazy collaborations\n\nThe CMT Music Awards are known for creating unique made-for-television moments, and this year was no different. Peter Frampton performed “It Ain’t My Fault” with Brothers Osborne from the streets of Nashville. Florida Georgia Line took the Chainsmokers to the roof of their new FGL House on Third Avenue and sang “Last Day Alive” with Nashville’s skyline in the background.\n\nLuke Bryan and Jason Derulo, who won previously in the night for CMT Performance of the Year for their CMT Crossroads performance of “Want to Want Me,\" reprised the award-winning duet as well as a minimalist version of Bryan’s hit “Strip It Down,” a performance only accompanied by Bryan on piano.\n\nThe show ended with Lady Antebellum performing with Earth Wind & Fire.\n\nAllman Brothers tribute\n\nThe 2017 CMT awards got off to a bluesy start Wednesday with an all-star tribute to Gregg Allman, who died late last month.\n\nJason Aldean, Darius Rucker and Lady Antebellum's Charles Kelley belted out a version of the Allman Brothers Band's classic \"Midnight Rider.\"\n\nThe trio was joined on stage by guitar virtuoso Derek Trucks, a longtime collaborator with the Allman Brothers.\n\nHere's a look at the winners:\n\n2017 CMT Music Awards winners\n\nVIDEO OF THE YEAR\n\n• Keith Urban – “Blue Ain’t Your Color”\n\nGROUP VIDEO OF THE YEAR\n\n• Little Big Town – “Better Man”\n\nCMT PERFORMANCE OF THE YEAR\n\n• Jason Derulo and Luke Bryan – “Want to Want Me” (From CMT Crossroads)\n\nBREAKTHROUGH VIDEO OF THE YEAR\n\n• Lauren Alaina – “Road Less Traveled”\n\nCOLLABORATIVE VIDEO OF THE YEAR\n\n• Keith Urban feat. Carrie Underwood – “The Fighter”\n\nMALE VIDEO OF THE YEAR\n\n• Keith Urban – “Blue Ain’t Your Color”\n\nDUO VIDEO OF THE YEAR\n\n• Florida Georgia Line – “H.O.L.Y.”\n\nSOCIAL SUPERSTAR OF THE YEAR\n\n• Keith Urban\n\nFEMALE VIDEO OF THE YEAR\n\n• Carrie Underwood – “Church Bells”\n\n\n\n", "images": ["https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://www.gannett-cdn.com/-mm-/b01c8b876ce596efa1f96b6984b57220100a1e09/c=0-82-4934-2869/local/-/media/2017/06/07/TennGroup/Nashville/636324681666428276-2017-cmt-awards.jpg202.JPG?auto=webp&format=pjpg&width=1200", "http://www.gannett-cdn.com/-mm-/9ff6f5c43feb6edc5ddfa71c2a0595d58920dee0/c=0-88-2864-1706&r=1280x720/local/-/media/2017/06/07/TennGroup/Nashville/636324615808384878-2017-cmt-awards.jpg099.JPG"], "top_img": "https://www.gannett-cdn.com/-mm-/b01c8b876ce596efa1f96b6984b57220100a1e09/c=0-82-4934-2869/local/-/media/2017/06/07/TennGroup/Nashville/636324681666428276-2017-cmt-awards.jpg202.JPG?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Cindy Watts"], "canonical_link": "https://www.tennessean.com/story/entertainment/music/2017/06/07/stars-hit-red-carpet-2017-cmt-music-awards/379280001/", "title": "5 big moments from the 2017 CMT Music Awards", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=526094470, app-argument=https://www.tennessean.com/story/entertainment/music/2017/06/07/stars-hit-red-carpet-2017-cmt-music-awards/379280001/entertainment/music", "theme-color": "#ffffff", "og": {"title": "5 big moments from the 2017 CMT Music Awards", "description": "Here are five things to know about one of country music's biggest nights.", "site_name": "The Tennessean", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/b01c8b876ce596efa1f96b6984b57220100a1e09/c=0-82-4934-2869/local/-/media/2017/06/07/TennGroup/Nashville/636324681666428276-2017-cmt-awards.jpg202.JPG?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "description": "Here are five things to know about one of country music's biggest nights.", "twitter": {"site": "@Tennessean", "creator": "@Tennessean", "card": "summary_large_image"}}, "movies": [], "publish_date": 1496790000.0, "source": "https://www.tennessean.com", "summary": ""}