{"url": "http://www.cq.com/doc/newsmakertranscripts-3955637", "text": "Sen. Sanders Interviewed on MSNBC\n\nSCHULTZ:\n\nJoining me tonight, independent Senator Bernie Sanders from Vermont.\n\nSenator, good to have you with us tonight.\n\nSANDERS:\n\nGood to be with you.\n\nSCHULTZ:\n\nBernie, I want you to address Mitt Romney`s comments about how this is dangerous when he was asked about the Wall Street protests taking place he said it`s dangerous. What your response to that?\n\nSANDERS:\n\nWell, class warfare is dangerous. The only problem is that the wrong class is winning.\n\nWhat`s happening now is you have the wealthiest people in the country, as you have just indicated, becoming much wealthier. You have Republicans -- and this is what class warfare is about -- saying let`s give huge tax breaks to the richest people and the largest corporations but you know what? Let`s destroy Social Security, let`s cut Medicare, let`s cut Medicaid, let`s deny young people the opportunity to go to college.\n\nLet`s cut back on any effort to try to create jobs in America. That`s class warfare.\n\nSCHULTZ:\n\nSenator, will these protesters that are gathering in number and city, will they have an impact on the Congress in your opinion?\n\nSANDERS:\n\nYou know, I think that they may. It`s too early to say but I think they are touching a nerve, Ed. I think the average American understands that there`s something very, very wrong when the people on Wall Street, their greed and recklessness cause the recession. Millions of people lost their jobs, their homes, their life savings. And you know what the punishment was for the people on Wall Street, they got higher compensation benefits. They are making more money than they ever made before.\n\nSCHULTZ:\n\nNo doubt. Senator, you and Congressman Michael Burgess of Texas were at a hearing today and you have asked I think someone who really should know about what the heck is going on Wall Street, Chairman Ben Bernanke.\n\nHere it is.\n\n(BEGIN VIDEO CLIP)\n\nSANDERS:\n\nDid Wall Street`s greed and recklessness cause the recession that led to so many people losing its job?\n\nBEN BERNANKE, FEDERAL RESERVE CHAIRMAN:\n\nIt had -- excessive risk taking on Wall Street had a lot to do it and so did some failure on the part of regulators. I think people are quite unhappy with the state of the economy and what`s happening. They blame with some justification the problems in the financial sector for getting us in to this mess. And they are dissatisfied with the policy response here in Washington. And at some level, I can`t blame them.\n\n(END VIDEO CLIP)\n\nSCHULTZ:\n\nPretty high level admission, isn`t it, Senator?\n\nSANDERS:\n\nWell, I think it is. But we also have to hold Mr. Bernanke a bit accountable as well. One of the things, Ed, that the Fed can do -- remember during the financial crisis that the Fed lent out $16 trillion, yes, $16 trillion to every financial institution, central banks around the world, wealthy individuals, large corporations. That`s what they did during the financial crisis to bail out Wall Street.\n\nNow, with the middle class in decline with unemployment at 16 percent, real unemployment, what the Fed has got to do is act with that same urgency to protect working families that they did to protect Wall Street. Bernanke is not doing that.\n\nSCHULTZ:\n\nNow, Senator, let`s talk about the protests. Where to you suspect this will go? Isn`t it going to have to go to Washington eventually? And I have to ask the question -- are these the people that allowed the Republicans to take over the House? Were these protesters, were these the ones who were a apathetic in 2010 and let Boehner get the gavel?\n\nWhere were they a year ago? And how do we know that this is going to be so genuine to hold through the next 13 months to make a difference in 2012?\n\nYour take on that.\n\nSANDERS:\n\nWell, that`s a good question. I would say as an independent that I suspect a lot of these people are very disappointed at the president and the Democratic Party, as well. They have not seen the president be as strong as he should be on Wall Street.\n\nEd, today, you have six financial institutions, the largest six, that have assets that are the equivalent of 60 percent of the GDP of the United States of America.\n\nSCHULTZ:\n\nSo, you want to break up those banks? You want to break them up?\n\nSANDERS:\n\nYou got to break them up. You got to control interest rates on credit cards. You have to demand that the Fed start lending to small business.\n\nSo, what I hope will happen is that these protests will galvanize the Democrats, maybe some Republicans to say, yes, maybe it`s time that we split up the Wall Street and big money interest.\n\nSCHULTZ:\n\nSenator Sanders, always a pleasure.\n\nSEN. BERNARD SANDERS, I-VT.\n\nED SCHULTZ, MSNBC ANCHOR", "images": ["http://www.cq.com/images/cq-logo-white-new.png", "http://www.cq.com/versioned/MjAyMjA5MTZfMTYyNTIwMjQ0/images/app-icon.png"], "top_img": "http://www.cq.com/versioned/MjAyMjA5MTZfMTYyNTIwMjQ0/images/app-icon.png", "keywords": [], "authors": [], "canonical_link": "", "title": "Sen. Sanders Interviewed on MSNBC", "meta_data": {"build-version": "unknown-TAG", "build-time": "unknown-1664650858571", "viewport": "initial-scale=1", "apple-itunes-app": "app-id=1022591312"}, "movies": [], "publish_date": null, "source": "http://www.cq.com", "summary": ""}