{"url": "https://ftw.usatoday.com/2018/01/mtv-the-challenge-competitors-contestants-rankings-johnny-bananas-ct-wes", "text": "MTV’s The Challenge has evolved into another major sport.\n\nAs time has gone on, the competitors have grown more athletic, as have the competitions. The show’s stars are essentially professional athletes at this point.\n\nEvery sports fan’s favorite past time is ranking their favorite athletes, and that’s exactly what we’re here to do. Our resident Challenge fans, Charles Curtis and Steven Ruiz, have submitted their personal top-10 lists of competitors, both male and female. We’ve averaged out those rankings to come up with two composite top-10s … Here they are:\n\nMen\n\n1. Johnny Bananas\n\nCharles: He has to be the greatest of all time, as host T.J. Lavin once told For The Win, and it’s not just because he’s one of the series’ best athletes. It’s the way he manipulates and adjusts to the rules of the game on the fly, which is as much a part of The Challenge as anything else.\n\nSteven: I did not have Bananas as my top Challenge competitor, even though I recognize he is widely considered the GOAT. I just couldn’t put him ahead of a guy who once wore him as a backpack. That’s the argument-ender for me. As far as politics go, Bananas is clearly the greatest to ever do it, but C.T.’s physical advantage outweighs Banana’s mental advantage in my mind.\n\n2. C.T.\n\nCharles: At the height of his best days, he pulled off what Bananas nicknamed “The Johnny Banackpack incident,” which Steven mentioned above: In a The Challenge: Cutthroat elimination, he carried Bananas on his back and rammed him into a trashcan, one of the greatest feats of athleticism ever seen on the MTV show or otherwise.\n\nHe was frightening and sometimes self-destructive, but ultimately a legend.\n\nSteven: He’s my No.1 guy for one simple reason: The only person who can beat C.T. is C.T. himself. It seems like the only time he loses one of these things is when he beats himself.\n\n3. Wes\n\nCharles: He’s been in finals and won twice, and although I think he might be a tad too high at No. 3, he’s a cunning manipulator. Beware if there’s a swimming challenge, you know he’ll dominate that. His Achilles heel is Bananas, which makes him kind of the Phil Mickelson to Bananas’ Tiger Woods: Great, but could have been even greater if there had been no Bananas.\n\nSteven: Wes has been my personal favorite since he made his debut on Fresh Meat and carried a useless partner to the final despite being a rookie and that season’s biggest target. Wes followed up the impressive debut by winning The Duel, which, in my opinion, is the most stacked season in the history of the show. He’s easily the best strategist to ever appear on the show; if only he had more friends.\n\n4. Darrell\n\nCharles: A five-time winner (I’m counting Champs vs. Pros here too) who is an elite athlete. I was so happy to see him come back to the series after a hiatus with Dirty 30. Should be higher on our list.\n\nSteven: You can’t deny Darrell’s track record. The dude won every show he appeared before finally going out in a recent season. And he, along with partner Aviv, won the second-best season in the show’s history, Fresh Meat.\n\n5. Jordan\n\nCharles: Surprised to see him this high up? You shouldn’t be. He’s made three finals, won twice (including the super-tough Dirty 30) and he’s done it all with one hand. Astounding and an inspiration.\n\nSteven: I’m not really a Jordan fan, and his personality has gotten him into trouble a lot. But he’s won the second-most money in the history of the show and is always a threat to make the final when he appears.\n\n6. Alton\n\nCharles: It’s funny, I agree with what Steven says below — it feels like he should be higher. Maybe we’re underrating him because he only appeared four times?\n\nSteven: Alton is way too low on this list. He is simply the best athlete to ever appear on the show. I had him at No. 4 on my list because he didn’t really have a social game, but there’s nobody that could beat this guy in a physical challenge during his prime. He is easily the greatest climber in the history of the show.\n\n7. Derrick\n\nCharles: Another vet I’m pumped to see back on the series after he took a few years off. How astounding is it that he made the final of Dirty 30 after all that time away?\n\nSteven: Had Derrick been a few inches taller, he might’ve landed in the top-five. But his size was always a factor and usually the biggest reason he was eliminated during his seven losses.\n\n8. Landon\n\nCharles: Three wins in four seasons. That’s all you have to know. And he did it with a smile on his face, too.\n\nSteven: I’m going to be honest: I forgot how good Landon was when he was regularly appearing on these shows. But the numbers don’t lie: He won 75% of the seasons he appeared on. The guy was somewhat undersized but his athleticism often made the difference.\n\n9. Evan\n\nCharles: Another one of those competitors who could combine the head games with the physical games.\n\nSteven: Evan had a chance to be a top-five Challenge competitor but he, along with the next guy on this list, got into legal trouble stemming from incidents with cast member Tonya. Evan was as physically imposing as C.T., but was easily manipulated.\n\n10. Kenny\n\nCharles: He stands on his own as a solid competitor who liked to stir the pot, but here’s a crazy thought: What if he and Evan were able to compete and got to support their pal Johnny Bananas a few more times? Would Bananas have even more titles to his name?\n\nSteven: Kenny was Evan’s right-hand man but clearly the lesser of the two. He wasn’t quite the competition beast Evan was and his mouth didn’t make for good in-house politics.\n\nWomen\n\n1. Emily\n\nCharles: Four Challenge appearances (including Champs vs. Stars). Two wins, two finals. Like Steven, it’s hard to see her ahead of Laurel, but the record speaks for itself.\n\nSteven: It was difficult to separate Emily and Laurel for me because both women dominated competitions, but Emily’s personality is less grating, which gives her a better social game.\n\n2. Laurel\n\nCharles: If I had to choose any competitor to go into an elimination and win, it’d be her. Yes, she’s had her struggles in various houses, but as far as athleticism, she’s got it and then some.\n\nSteven: I had Laurel as my No. 3, but she might be the most physically-imposing women to appear on the show. She has undoubtedly underachieved in part because of her inability to get along with her housemates. She should have more than one win under her belt.\n\n3. Evelyn\n\nCharles: Ev! Another athlete I wish was still participating. Three wins puts her in the GOAT conversation.\n\nSteven: Evelyn was small but made up for it with unparalleled athleticism. And despite being difficult to get along with at times, her physical abilities made her an ideal ally. There’s a reason she won nearly half the seasons she appeared on.\n\n4. Jodi\n\nCharles: How easily we forget that her three appearances included a pair of wins. I say that knowing that she was lower on my list than on Steven’s, but we don’t know what she would have done in later seasons.\n\nSteven: Charles is severely underrating Jodi, who was my No. 1. I don’t blame him, because she appeared on the show only three times and it was so long ago. But she felt unbeatable when she was on the show. And she basically was, winning two of her three appearances, including The Duel, which I’ve said was the most stacked cast the show has ever seen. It was never a doubt that she’d win that season.\n\n5. Camila\n\nCharles: Dirty 30 was a ridiculously tough season, one that she won. Even when her “Camillinator” personality comes out — sometimes with extremely negative consequences — she fights through and gets deep into seasons.\n\nSteven: Camila is overrated in my mind but no woman has ever made more money on The Challenge, so I can’t drop her too low.\n\n6. Cara Maria\n\nCharles: She was always the prospect who never quite brought home the title until Battle of the Bloodlines. I’d love to see her win more, but it seems like she’s rubbed younger castmates the wrong way in recent years, which could be costly going forward.\n\nSteven: Cara Maria went from a layup to one of the best competitors on the show in the matter of a season or two. It was a genuinely impressive evolution, and her success on the show has been made even more impressive by the fact that she’s not the most popular cast member.\n\n7. Sarah\n\nCharles: No, I didn’t put her on my list because of what Bananas did to her in Rivals III (see below). It’s because, like Cara Maria, she made finals left and right until she figured it all out for Battle of the Exes II. If she’d come back again (I wouldn’t either after what Bananas did), I’d bet she’d be in the running with the best of them.\n\nSteven: Sarah was good at making friends and a decent competitor. That’s a good combination. She won two out of her nine appearances, but did take the biggest L in the history of The Challenge.\n\n8. Jenna\n\nCharles: Underrated!!! Her political game isn’t the best, but she makes up for that with the ability to keep up with competitors who might be stronger or tougher. She’s made three finals and I’m certain that if she comes back from an awful Champs vs. Stars injury, she’ll keep getting closer.\n\nSteven: Jenna barely cracked my top-10, to be honest. She’s done a good job of making finals but that has more to do with her not being a threat than her physical or political abilities.\n\n9. Coral\n\nCharles: I actually think we’ve got her right where she deserves to be — she won Battle of the Seasons with The Miz and got to the finals in three other years.\n\nSteven: I have no doubt we’re overrating Coral here, but she is one of the greatest characters to ever appear on the show. That has to count for something, right?\n\n10. Rachel\n\nCharles: Two wins means she needs to be higher. What did we do wrong here, Steven? Our rankings somehow put her lower than she should be, but that’s how the math worked out.\n\nSteven: Rachel should be higher on this list. She is one of the best athletes to appear on the show, male or female. Only six women made more money from the show than Rachel, who won two of her seven appearances on The Challenge.", "images": ["https://ftw.usatoday.com/wp-content/uploads/sites/90/2015/11/logo-ftw.png?w=660", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/evan-starkman.jpeg?w=30&h=41", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/coral.jpg", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/cara-maria.jpg?w=439&h=658", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/jordan.jpg?w=122&h=81", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/jenna_189_lv.jpg?w=153&h=230", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/evan-starkman.jpeg", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/jenna_189_lv.jpg", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/jordan.jpg", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/jodi.png?w=27&h=30", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/wes_112_lv.jpg", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/emily_243_lv.jpg?w=153&h=230", "https://ftw.usatoday.com/wp-content/uploads/sites/90/2021/09/CH37_BERNA-e1632925422358.jpg?w=24&h=24&crop=1", "https://ftw.usatoday.com/wp-content/uploads/sites/90/2021/03/CHAS_GROUPS_2021-03-02_JCR_V1_R2-RGB_R1.jpg?w=24&h=24&crop=1", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/bananas_065.jpg", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/alton.png?w=67&h=54", "https://ftw.usatoday.com/wp-content/uploads/sites/90/2021/03/USATODAY_Sports_Log.png?w=1000", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/evelyn.jpg?w=40&h=60", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/sarah.png", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/ct_138-copy-1.jpg?w=153&h=230", "https://ftw.usatoday.com/wp-content/uploads/sites/90/2022/10/a01_nline_0501.jpeg?w=100&h=60&crop=1", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/evelyn.jpg", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/cara-maria.jpg", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/emily_243_lv.jpg", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/camila.jpg?w=153&h=230", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/ct_138-copy-1.jpg", "https://ftw.usatoday.com/wp-content/uploads/sites/90/2014/10/ap_sag_nominations_45901039-e1665168289820.jpg?w=100&h=50&crop=1", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/camila.jpg", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/coral.jpg?w=55&h=32", "https://ftw.usatoday.com/wp-content/uploads/sites/90/2021/04/CHAS_MARK-LON_2021-03-02_JCR-5_V1_R1-RGB_R-v2-e1617303488339.jpg?w=24&h=24&crop=1", "https://ftw.usatoday.com/wp-content/uploads/sites/90/2015/11/ftw-icon-section-head.png?w=200", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/landon.png?w=28&h=37", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/darrell.jpg?w=153&h=230", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/rachel.jpg", "https://ftw.usatoday.com/wp-content/uploads/sites/90/2018/01/ap_mtn_dew_dewggro_crag_powered_by_the_splat_82691114.jpg?w=1024&h=576&crop=1", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/darrell.jpg", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/bananas_065.jpg?w=153&h=230", "https://ftw.usatoday.com/wp-content/uploads/sites/90/2022/10/XXX-_A-KNIGHTS-TALE_.jpg?w=100&h=60&crop=1", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/rachel.jpg?w=144&h=81", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/derrick.jpg", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/landon.png", "https://ftw.usatoday.com/wp-content/uploads/sites/90/2018/01/ap_mtn_dew_dewggro_crag_powered_by_the_splat_82691114.jpg?w=1000&h=600&crop=1", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/laurel.jpg?w=119&h=77", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/wes_112_lv.jpg?w=153&h=230", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/derrick.jpg?w=153&h=230", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/jodi.png", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/alton.png", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/sarah.png?w=48&h=60", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/kenny.jpg?w=38&h=57", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/laurel.jpg", "https://wp.usatodaysports.com/wp-content/uploads/sites/90/2018/01/kenny.jpg"], "top_img": "https://ftw.usatoday.com/wp-content/uploads/sites/90/2018/01/ap_mtn_dew_dewggro_crag_powered_by_the_splat_82691114.jpg?w=1024&h=576&crop=1", "keywords": [], "authors": ["Steven Ruiz", "Charles Curtis", "Michelle R. Martinelli", "Caroline Darney", "January", "Am Et"], "canonical_link": "https://ftw.usatoday.com/2018/01/mtv-the-challenge-competitors-contestants-rankings-johnny-bananas-ct-wes", "title": "The 20 greatest MTV 'The Challenge' competitors of all time, ranked", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "description": "Who is MTV's GOAT athlete?", "keywords": "the challenge, mtv, johnny bananas, c.t., the challenge rankings, the challenge vendettas", "fb": {"app_id": 451360081611296, "admins": 1651440013}, "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "gdpr": "true", "og": {"type": "article", "title": "The 20 greatest MTV 'The Challenge' competitors of all time, ranked", "url": "https://ftw.usatoday.com/2018/01/mtv-the-challenge-competitors-contestants-rankings-johnny-bananas-ct-wes", "description": "Who is MTV’s GOAT athlete?", "site_name": "For The Win", "image": {"identifier": "https://ftw.usatoday.com/wp-content/uploads/sites/90/2018/01/ap_mtn_dew_dewggro_crag_powered_by_the_splat_82691114.jpg?w=1024&h=576&crop=1", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2018-01-23T16:53:47+00:00", "modified_time": "2018-12-25T15:55:57+00:00", "publisher": "https://www.facebook.com/usatodayftw"}, "twitter": {"text": {"title": "The 20 greatest MTV 'The Challenge' competitors of all time, ranked"}, "image": "https://ftw.usatoday.com/wp-content/uploads/sites/90/2018/01/ap_mtn_dew_dewggro_crag_powered_by_the_splat_82691114.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://ftw.usatoday.com/wp-content/uploads/sites/90/2022/04/cropped-FTW_256_icon.png?w=270"}, "movies": ["https://www.youtube.com/embed/p1E3i-2oVtk?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent", "https://www.youtube.com/embed/-1m851efY3s?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&start=107&wmode=transparent"], "publish_date": 1516726427.0, "source": "https://ftw.usatoday.com", "summary": ""}