{"url": "https://deadline.com/2018/03/greys-anatomy-jessica-capshaw-sarah-drew-exit-abc-medical-drama-1202316987/", "text": "EXCLUSIVE UPDATED: Two popular, long-time Grey’s Anatomy cast members, Jessica Capshaw and Sarah Drew, will be departing the hit ABC medical drama at the end of the current fourteenth season. Capshaw has been on the show for 10 seasons, nine of them as a series regular, playing Dr. Arizona Robbins; Drew has been on Grey’s for nine seasons, eight of them as a series regular, playing Dr. April Kepner.\n\nPrimetime-Panic Your Complete Guide to Pilots and Straight-to-Series orders See All\n\nThe decision was made by the producers who at the start of each season have to formally pick up the option of each regular cast member. Sources say Capshaw and Drew will be the only series regular members of Grey’s large ensemble cast to depart this year.\n\nABC\n\nWhile Grey’s, created/executive produced by Shonda Rhimes and executive produced by co-showrunner Krista Vernoff, has not been officially renewed for Season 15, that is considered a foregone conclusion with its ratings remaining strong and its star, Ellen Pompeo, signing a new two-year deal. The decision not to bring back Capshaw and Drew comes on the heels of the blockbuster new Pompeo pact that gave her a significant salary increase, paying her as much as $20 million a year.\n\nSources close to the matter stress that the decision for Capshaw and Drew’s exits was based strictly on the show’s creative direction, something Vernoff alluded to in her statement.\n\n“The characters of Arizona and April are permanently woven into the fabric of Grey’s Anatomy thanks to the extraordinary work of Jessica Capshaw and Sarah Drew,” Vernoff said. “As writers, our job is to follow the stories where they want to go and sometimes that means saying goodbye to characters we love. It has been a joy and a privilege to work with these phenomenally talented actresses.”\n\nRhimes underlined the cultural significance of Capshaw and Drew’s characters — Arizona, who is a lesbian, and April, who has a very close relationship with God — and indicated that we may see them again.\n\nABC\n\n“It’s always hard for me to say goodbye to any of my characters,” Rhimes said. “Both Arizona Robbins and April Kepner are not only beloved but iconic — both the LBGTQ and devout Christian communities are underrepresented on TV. I will be forever grateful to both Jessica and Sarah for bringing these characters to life with such vibrant performance and for inspiring women around the globe. They will always be a part of our Shondaland family.”\n\nUPDATE: While Deadline’s story stressed that the decision for Capshaw and Drew’s exits was strictly creative, the mention of the big new deal for Pompeo, which helped secure a renewal for Grey’s, led to online speculation about a possible connection between the two.\n\nThere is no such connection that we are aware of. Because this has become an issue, pitting women against each other on International Women’s Day, we are making it clear. Here is Vernoff’s statement on the fallout:\n\nLike most Grey’s non-original cast members, Capshaw and Drew started on the show as recurring — Capshaw in Season 5, Drew in Season 6 — before getting promoted to series regulars the following season.\n\nDrew’s Dr. April Kepner is an attending trauma surgeon at Grey Sloan Memorial Hospital who joined from Mercy West Medical Center after the merger. She shares a daughter with her ex, Dr. Jackson Avery (Jesse Williams).\n\nCapshaw’s Dr. Arizona Robbins is Head of Fetal Surgery, an Attending Pediatric Surgeon and a board member at Grey Sloan Memorial Hospital. She was married to Callie Torres, who was played by Sara Ramirez until she left Grey’s at the end of Season 12 after 10 years on the show.\n\nBoth characters are fan favorites, with each of the actresses boasting 1.9 million followers on Instagram. Drew often posts behind the scenes photos from Grey’s, including this shot of her and Capshaw a couple of weeks ago.\n\nToday, following the news of their pending exits, both shared their reactions with fans. “I know you’re sad. I’m sad, too, Drew wrote. “For now, I’d like to say: I love you April and her story isn’t over yet.”\n\nWrote Capshaw, “For the past ten years I have had the rare privilege of not only playing Arizona Robbins, but also being madly in love with playing her. She was one of the first members of the LGBTQ community to be represented in a series regular role on network television. Her impact on the world is forever. ”", "images": ["https://deadline.com/wp-content/uploads/2018/03/grey_s_anatomy_sarah-drew.jpg", "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://deadline.com/wp-content/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://deadline.com/wp-content/uploads/2018/03/jessica-capshaw-sarah-drew.jpg?w=630&h=383&crop=1", "https://deadline.com/wp-content/uploads/2018/03/jessica-capshaw-sara-ramirez-greys-anatomy.jpg", "https://deadline.com/wp-content/uploads/2018/03/jessica-capshaw-sarah-drew.jpg?w=630", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1"], "top_img": "https://deadline.com/wp-content/uploads/2018/03/jessica-capshaw-sarah-drew.jpg?w=630", "keywords": [], "authors": ["Nellie Andreeva"], "canonical_link": "https://deadline.com/2018/03/greys-anatomy-jessica-capshaw-sarah-drew-exit-abc-medical-drama-1202316987/", "title": "‘Grey’s Anatomy’ Shocker: Jessica Capshaw & Sarah Drew To Exit ABC Medical Drama After Season 14", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "Two popular, long-time Grey's Anatomy cast members, Jessica Capshaw and Sarah Drew, will be departing the hit ABC medical drama.", "news_keywords": "ABC, Grey's Anatomy, Jessica Capshaw, Sarah Drew", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=533209613", "generator": "WordPress 6.0.2", "author": "Nellie Andreeva", "theme-color": "#fff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Deadline", "application-name": "Deadline", "content_type": "Article", "post_id": 1202316987, "title": "'Grey's Anatomy' Shocker: Jessica Capshaw & Sarah Drew To Exit ABC Medical Drama After Season 14", "published_at": "2018-03-08 10:00:08", "image": "https://deadline.com/wp-content/uploads/2018/03/jessica-capshaw-sarah-drew.jpg?w=296&h=166&crop=1", "comment_count": 471, "tags": "Sarah Drew", "topics": "TV", "body": "EXCLUSIVE UPDATED: Two popular, long-time Grey's Anatomy cast members, Jessica Capshaw and Sarah Drew, will be departing the hit ABC medical drama at the end of the current fourteenth season. Capshaw has been on the show for 10 seasons, nine of them as a series regular, playing Dr. Arizona Robbins; Drew has been on Grey's for nine seasons, eight of them as a series regular, playing Dr. April Kepner.\r\n\r\nThe decision was made by the producers who at the start of each season have to formally pick up the option of each regular cast member. Sources say Capshaw and Drew will be the only series regular members of Grey's large ensemble cast to depart this year.\r\n\r\n\r\n\r\nWhile Grey's, created/executive produced by Shonda Rhimes and executive produced by co-showrunner Krista Vernoff, has not been officially renewed for Season 15, that is considered a foregone conclusion with its ratings remaining strong and its star, Ellen Pompeo, signing a new two-year deal. The decision not to bring back Capshaw and Drew comes on the heels of the blockbuster new Pompeo pact that gave her a significant salary increase, paying her as much as $20 million a year.\r\n\r\nSources close to the matter stress that the decision for Capshaw and Drew's exits was based strictly on the show's creative direction, something Vernoff alluded to in her statement.\r\n\r\n\"The characters of Arizona and April are permanently woven into the fabric of Grey’s Anatomy thanks to the extraordinary work of Jessica Capshaw and Sarah Drew,\" Vernoff said. \"As writers, our job is to follow the stories where they want to go and sometimes that means saying goodbye to characters we love. It has been a joy and a privilege to work with these phenomenally talented actresses.\"\r\n\r\nRhimes underlined the cultural significance of Capshaw and Drew's characters -- Arizona, who is a lesbian, and April, who has a very close relationship with God -- and indicated that we may see them again.\r\n\r\n\r\n\r\n\"It’s always hard for me to say goodbye to any of my characters,\" Rhimes said. \"Both Arizona Robbins and April Kepner are not only beloved but iconic -- both the LBGTQ and devout Christian communities are underrepresented on TV. I will be forever grateful to both Jessica and Sarah for bringing these characters to life with such vibrant performance and for inspiring women around the globe. They will always be a part of our Shondaland family.\"\r\n\r\nUPDATE: While Deadline's story stressed that the decision for Capshaw and Drew's exits was strictly creative, the mention of the big new deal for Pompeo, which helped secure a renewal for Grey's, led to online speculation about a possible connection between the two.\r\n\r\nThere is no such connection that we are aware of. Because this has become an issue, pitting women against each other on International Women's Day, we are making it clear. Here is Vernoff's statement on the fallout:\r\n\r\nhttps://twitter.com/KristaVernoff/status/971851130253668352\r\n\r\nLike most Grey's non-original cast members, Capshaw and Drew started on the show as recurring  -- Capshaw in Season 5, Drew in Season 6 -- before getting promoted to series regulars the following season.\r\n\r\nDrew's Dr. April Kepner is an attending trauma surgeon at Grey Sloan Memorial Hospital who joined from Mercy West Medical Center after the merger. She shares a daughter with her ex, Dr. Jackson Avery (Jesse Williams).\r\n\r\nCapshaw's Dr. Arizona Robbins is Head of Fetal Surgery, an Attending Pediatric Surgeon and a board member at Grey Sloan Memorial Hospital. She was married to Callie Torres, who was played by Sara Ramirez until she left Grey's at the end of Season 12 after 10 years on the show.\r\n\r\nBoth characters are fan favorites, with each of the actresses boasting 1.9 million followers on Instagram. Drew often posts behind the scenes photos from Grey's, including this shot of her and Capshaw a couple of weeks ago.\r\n\r\nToday, following the news of their pending exits, both shared their reactions with fans. “I know you’re sad. I’m sad, too, Drew wrote. “For now, I’d like to say: I love you April and her story isn’t over yet.\"\r\n\r\nWrote Capshaw, “For the past ten years I have had the rare privilege of not only playing Arizona Robbins, but also being madly in love with playing her. She was one of the first members of the LGBTQ community to be represented in a series regular role on network television. Her impact on the world is forever. ”\r\n\r\nhttps://www.instagram.com/p/BfM3ipshDOH/?hl=en&taken-by=thesarahdrew", "fb": {"pages": 105558754896}, "onesignal": "wordpress-plugin", "fragment": "!", "og": {"type": "article", "title": "‘Grey’s Anatomy’ Shocker: Jessica Capshaw & Sarah Drew To Exit ABC Medical Drama After Season 14", "url": "https://deadline.com/2018/03/greys-anatomy-jessica-capshaw-sarah-drew-exit-abc-medical-drama-1202316987/", "description": "EXCLUSIVE UPDATED: Two popular, long-time Grey’s Anatomy cast members, Jessica Capshaw and Sarah Drew, will be departing the hit ABC medical drama at the end of the current fourteenth season.…", "site_name": "Deadline", "image": {"identifier": "https://deadline.com/wp-content/uploads/2018/03/jessica-capshaw-sarah-drew.jpg?w=630", "width": 630, "height": 423}, "locale": "en_US"}, "article": {"published_time": "2018-03-08T18:00:08+00:00", "modified_time": "2018-03-08T22:15:26+00:00"}, "twitter": {"site": "@DEADLINE", "creator": "@DeadlineNellie", "card": "summary_large_image", "title": "‘Grey’s Anatomy’ Shocker: Jessica Capshaw & Sarah Drew To Exit ABC Medical Drama After Season 14", "description": "Two popular, long-time Grey's Anatomy cast members, Jessica Capshaw and Sarah Drew, will be departing the hit ABC medical drama.", "image": "https://deadline.com/wp-content/uploads/2018/03/jessica-capshaw-sarah-drew.jpg?w=630"}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1520532008.0, "source": "https://deadline.com", "summary": ""}