{"url": "https://popculture.com/reality-tv/2018/07/03/nikki-bella-finds-dream-dress-wedding-john-cena/", "text": "Nikki Bella may insist she's \"just friends\" with ex-fiance John Cena, but the Total Bellas star has found her second perfect wedding dress.\n\nIn a new sneak peek from Sunday's all new Total Bellas, the former WWE star is ready to tie the knot to Cena when she finds her perfect dress, after the engagement already led to a previous breakup.\n\n\"Oh my gosh, I just got goosebumps,\" Brie Bella tells her twin sister as she steps out in the precious gown in the video. \"It's stunning. I feel like this is exactly what you've been looking for.\"\n\n\"I love this,\" Nikki gushes while admiring herself in the mirror. \"I feel like a Barbie! I think this is it. Yes!\"\n\nWhile talking to the camera as part of the show, TooFab reports, Brie suggests her sister has decided on the dress before she even admitted it to her friends.\n\n\"You always know when a bride finds her dress, because when they walk out and it's like this big smile and they feel like a queen,\" Brie said. \"You're just like, 'That's it, that's the smile I've been looking for lately.' And I just feel like now we've just made a turn, things are going to start feeling really special, like, 'Hey, I'm getting married.'\"\n\nThe video, and bittersweet moment, comes days after Nikki set the record straight on the state of her relationship with Cena in a new YouTube video.\n\n\"Right now, we're just friends,\" she said. \"We are both working on each other and trying to work on us. We talk every day. He is not only my best friend, he is truly one of the most amazing people I've ever met, and he has patience with me, and he has really taught me a lot over the past few months. I think one of those things is an inner strength that I thought I had but didn't realize how strong I had it.\"\n\nShe did add, however, \"I do have hope for us.\"\n\nThe couple officially called off their engagement back in April, weeks away from their wedding day, after Cena was seemingly unwilling to have kids. However, after the WWE superstar agreed to reverse his vasectomy and have children with Nikki, she still faced some concerns about the big day.\n\n\"This is forever, and I don't want to be someone who has a divorce or who has kids and then gets a divorce,\" Bella explained. \"I want to walk down that aisle and give my vows and have this be one time.\"\n\nThe reality star also admitted that reliving her toughest breakup on screen every week has been tough, also confusing fans on the status of their relationship.\n\n\"I have to say, it's extremely hard to relive every week, because I think all of us have been through breakups, but to go through a breakup that's so public, and then have to relive it on a reality show makes it super tough,\" she admitted.\n\nHopefully there's a good chance they'll find their footing sooner rather than later.\n\n\"Hopefully one day we'll get back together, and if we don't, we both want each other to be very, very happy,\" she concluded.\n\nTotal Bellas airs Sundays at 9 p.m. ET on E!.", "images": ["https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200"], "top_img": "https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/reality-tv/news/nikki-bella-finds-dream-dress-wedding-john-cena/", "title": "Nikki Bella Finds Dream Dress for Wedding to John Cena", "meta_data": {"description": "Nikki Bella may insist she's 'just friends' with ex-fiance John Cena, but the Total Bellas star [...]", "keywords": "John Cena,Total Divas,Nikki Bella", "news_keywords": "John Cena,Total Divas,Nikki Bella", "robots": "index, follow, max-image-preview:large", "twitter": {"card": "summary_large_image", "site": "PopCulture", "creator": "PopCulture", "title": "Nikki Bella Finds Dream Dress for Wedding to John Cena", "description": "Nikki Bella may insist she's 'just friends' with ex-fiance John Cena, but the Total Bellas star [...]", "image": "https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200"}, "og": {"title": "Nikki Bella Finds Dream Dress for Wedding to John Cena", "type": "article", "url": "https://popculture.com/reality-tv/news/nikki-bella-finds-dream-dress-wedding-john-cena/", "image": {"identifier": "https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200", "width": 640, "height": 320}, "site_name": "Reality TV", "description": "Nikki Bella may insist she's 'just friends' with ex-fiance John Cena, but the Total Bellas star [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#263240", "apple-mobile-web-app-capable": "yes"}, "movies": ["https://www.youtube-nocookie.com/embed/2T5qGYC-8Nc", "https://www.youtube-nocookie.com/embed/nEluhUfUxUU"], "publish_date": 1530572400.0, "source": "https://popculture.com", "summary": ""}