{"url": "http://abcnews.go.com/ThisWeek/week-transcript-rep-paul-ryan/story?id=13502946&singlePage=true", "text": "WASHINGTON, May 1, 2011 — -- AMANPOUR (voice-over): This week, budget blowback.\n\n(UNKNOWN): We can't afford it, you moron!\n\nAMANPOUR: As town halls across America erupt in anger over aplan to slash spending...\n\n(UNKNOWN): You're a liar!\n\nAMANPOUR: ... Republicans find themselves under fire.\n\n(UNKNOWN): ... he was yelling at me, cursing at me.\n\nAMANPOUR: I go to the heartland with the man behind the plan,House Budget Chairman Paul Ryan of Wisconsin.\n\nRYAN: Let's prove to them that Wisconsinites can have a civildebate.\n\nAMANPOUR: Then, in the crosshairs. A NATO bomb hits a housewith Gadhafi inside, killing his son and three grandchildren. Howwill the strongman strike back? And how does it all end?\n\n(UNKNOWN): This was a direct operation to assassinate the leaderof this country.\n\nAMANPOUR: What's the way out for the U.S.? A formeradministration insider weighs in.\n\nPlus, we're live from the Vatican, as Pope John Paul II gets onestep closer to sainthood. Is the fast track too fast?\n\nANNOUNCER: Live from the Newseum in Washington, \"This Week\" withChristiane Amanpour starts right now.\n\n(END VIDEO CLIP)\n\nAMANPOUR: Welcome to our viewers here and around the world.There is a lot happening this Sunday, and we begin with unfolding newsin the Libyan capital, Tripoli. The Libyan government is condemningwhat it called, quote, \"a direct operation to assassinate MoammarGadhafi,\" this after a NATO bomb hit Gadhafi's compound. It sparedhim, but killed three of his grandchildren and his youngest son. Socould this be a game-changer in the war, which has dragged into astalemate in recent weeks?\n\nWe go live now to Libya for the very latest on the ground. ABC'sMiguel Marquez is in Benghazi, and the BBC's Christian Fraser is inTripoli, where the attack took place.\n\nChristian, let's start with you. Is there a feeling now that thewar is entering a new phase around Tripoli?\n\nFRASER: I think that's a very real possibility, Christiane. Theway that the press visit to this bomb site was orchestrated lastnight, it was very deliberately held back for two hours, and then wewere taken there and then given a press conference here at the hotel,in which Moussa Ibrahim spelled out what he thought the attack meantdoes suggest that they will try and make as much political capitalfrom this as they can.\n\nCertainly, it puts pressure on NATO and its allies. And we'veseen already a very angry reaction from his supporters in Tripoli,reports of attacks on the U.S. embassy. I've spoken to U.N. officialstoday who say their offices were looted, also reports of attacks onthe British and Italian missions here in Tripoli.\n\nThe unknowns, of course, are what Colonel Gadhafi's response willbe. We've not heard from him yet. We don't know what the response ofhis supporters will be in the days ahead, and we don't know, really,what the sort of international reaction will be to what has unfoldedhere last night.\n\nAMANPOUR: A lot of questions there, Christian, and we'llcontinue to monitor it.\n\nOf course, the U.S. embassy is empty, because all of the staffhave been evacuated over the last several weeks and months. And nowwe go to the other side of this conflict and ABC's Miguel Marquez,who's in the east there in rebel-held Benghazi.\n\nMiguel, what is the reaction from the rebels? Do they think thisattack could end the stalemate and signify a new -- a new impetus forthem?\n\nMARQUEZ: Well, the rebels certainly aren't buying this attack.They think that no one was killed in Tripoli last night. They'reliterally saying, \"Show us the bodies.\" They believe that this is atrick, another trick by Colonel Moammar Gadhafi, and they say that heis making this up simply to win that international support to dividethe coalition. They simply want to see those bodies. Whether or notit will make a difference to this I think will depend on what ColonelGadhafi and his troops do in the hours and days ahead -- Christiane?\n\nAMANPOUR: But, Miguel, is there any sense beyond this attackthat the rebels are getting any more organized or getting any moreweapons that they can actually take advantage of the help that NATO isgiving them?\n\nMARQUEZ: There's a lot of winks and nods there. There areindications that the Qataris are arming up. Certainly, there's beensome reporting on that front, but the rebels here are being very shyabout it. There are reports that the Qataris are (OFF-MIKE) but wehaven't seen any evidence of that.\n\nThe other thing that the rebels say about this, that this (OFF-MIKE) you know, the Predator drones were a huge boost to them, andthey believe that the U.S., they hope, will take even a greater rolein leading operations here in Libya -- Christiane?\n\nAMANPOUR: Miguel, thank you so much.\n\nAnd later in the show, we'll get an expert's take on whether thisattack on Gadhafi will be a turning point in what's become a stalematefor the United States and its allies. But first, we turn to a different sort of battle being wagedright here in the United States. It's a budget battle, of course, andthis was the week Republican Congress members went home to defendtheir sweeping budget plan before their constituents. And thereception at one town hall after another was rocky.\n\nThe plan is the brain child of House Budget Chairman Paul Ryan,who's feeling some of the heat himself. I traveled to Wisconsin tosee how Ryan is weathering the storm.\n\n(BEGIN VIDEOTAPE)\n\nAMANPOUR: How are the crowds increasing and their levels ofanxiety and frustration?\n\nRYAN: It's increasing, no two ways about it.\n\nAMANPOUR (voice-over): Congressman Ryan is at the center of thestorm. It's his plan, of course, that has sparked the outcries.Across the country, the anger is palpable.\n\n(UNKNOWN): May I finish?\n\n(UNKNOWN): No.\n\n(CROSSTALK)\n\n(UNKNOWN): You went and gave away all those tax cuts.\n\nAMANPOUR: We've seen Republican congressmen fending off boos andcatcalls from constituents over a plan to fundamentally overhaul twoprograms that millions of Americans have come to count on, Medicareand Medicaid.\n\nRYAN: Hey, guys. How are you doing?\n\nAMANPOUR: With Congress in recess, Ryan is holding as many asfour town meetings a day, and it's still not enough to keep up withdemand from his constituents.\n\n(UNKNOWN): What I can do is I can give you a list of the otherlistening sessions we have scheduled today.\n\nRYAN: The crowds are really getting bigger, and people aregetting much more anxious about just where the country's headed.\n\nAMANPOUR: This is the tail end of the marathon series of townhalls for Ryan, who seems wholly unconcerned with the heat he's takingthese days. Though the crowds we saw in Wisconsin were mostlyfriendly, some of his town meetings have been contentious.\n\n(UNKNOWN): (OFF-MIKE) trickle down.\n\nRYAN: We do (OFF-MIKE)\n\n(CROSSTALK) RYAN: It's a sign of the times, I think. I think it's a sign ofanxiety of the times. It's also a sign of the misinformation that'sbeen perpetrated out there.\n\nAMANPOUR (on-screen): Well, why do you say \"misinformation\"?\n\nRYAN: Well, there are TV, radio and phone calls that arerunning, trying to scare seniors. You know, the Democratic NationalCommittee is running phone calls to seniors in my district, TV ads,saying we're hurting current seniors when, in fact, that's not thecase. And so there's a lot of...\n\nAMANPOUR: Isn't that, though, par for the course?\n\n(CROSSTALK)\n\nAMANPOUR: I mean, didn't you lot do it the last time?\n\nRYAN: Yes, Republicans -- Republicans -- both parties do this toeach other. And my whole point about that is, that's why we have thispolitical paralysis.\n\nAMANPOUR (voice-over): On the day we joined him, the gym atFranklin High School fills up well before the congressman arrives.\n\n(APPLAUSE)\n\nAMANPOUR: Ryan's presentation is earnest and, it must be said,wonky.\n\nRYAN: This pie chart shows you our federal government, basicallyits budget for last year.\n\nAMANPOUR: The most controversial aspect of Paul Ryan's budgetplan would transform Medicare. He knows that could be politicalpoison with seniors, and so he makes sure to remind those in the crowdthe changes wouldn't impact them.\n\nRYAN: How many of you are 55 years of age or older? This budgetdoes not affect your Medicare benefits.\n\nAMANPOUR: But for many, that leaves more questions than answers,especially since budget watchdogs estimate the Medicare revamp wouldcost people who are now under 55 thousands of dollars out of pocketeach year once their benefits kick in, and that has some here inFranklin very concerned.\n\n(UNKNOWN): ... because it's going to be a real burden for them,especially with the economy coming up. And I think about all of the54-year-olds who have been unemployed. Where are they going to comeup with this money in 10 years to last their whole lifetime?\n\nAMANPOUR: Ryan argues delay is not an option.\n\nRYAN: Put these reforms in now, they don't take effect for 10years to give people time to prepare. If we keep kicking the can downthe road and if we keep going trillions of dollars deeper in the hole,then the reforms are going to be sudden, urgent, and severe, andimmediate, and people won't have -- that are going to catch them bysurprise.\n\nAMANPOUR: Then the session ends...\n\nRYAN: I appreciate you coming out.\n\nAMANPOUR: ... and Congressman Ryan is off. I stayed back tospeak with two of the women in the audience, Jackie (ph) and Lois(ph), each with very different perspectives on the congressman's plan.\n\n(UNKNOWN): I don't appreciate it at all, and that burns mypotatoes. And I think it's not fair. And I think it's selfish andself-centered. You're worried about the seniors of today, and we havethe seniors of tomorrow. We need to be worried about them, too. Andthere's a better way of fixing this plan, this problem that we didn'tget into, but we always got to be the ones.\n\nAMANPOUR (on-screen): Did you vote for Paul Ryan?\n\n(UNKNOWN): No. No.\n\nAMANPOUR: Did you?\n\n(UNKNOWN): Yes.\n\nAMANPOUR (voice-over): Lois says Ryan is trying to fix theproblem before time and money run out.\n\n(on-screen): The CBO, the Congressional Budget Office, has saidthat the average senior will end up paying some $6,500 more for theirhealth care.\n\n(UNKNOWN): In 10 years.\n\nAMANPOUR: Yes.\n\n(UNKNOWN): By 2020, the whole plan Obama has is going to crash.\n\nRYAN: A few sentences later, CBO also said that the status quoof Medicare is unsustainable.\n\nAMANPOUR: Maybe, but it's going to shift a huge burden on to theelderly.\n\nRYAN: Right. But what the CBO also forgot to add is that we'regiving an additional $7,800 for low-income seniors on top of that.And I would argue -- and CBO concurs with this -- comparing anyMedicare reform plan with the Medicare status quo is a fiscal fantasy.The Medicare status quo is not going be able to occur, because it'sunsustainable.\n\nAMANPOUR (voice-over): And Ryan dismisses any talk that tacklingthis thorny issue will cost Republicans at the polls.\n\n(on-screen): And now people are getting worried, people in yourparty. Perhaps they might think it might even cost them the election.\n\nRYAN: Sure. And I hear this all the time from the politicalpeople, from the pundits and the pollsters that this could be -- thiscould hurt us politically. I don't care about that. What I careabout is fixing this country and getting this debt situation undercontrol.\n\nLook, literally, Christiane, if all we fear about is ourpolitical careers, then we have no business having these jobs. If youwant to good at these jobs, you've got to be willing to lose the job.\n\nAMANPOUR (voice-over): Still, politically it's a delicate dance.Just listen to Speaker John Boehner discuss Ryan's plan in aninterview with ABC's Jon Karl.\n\nBOEHNER: It's Paul's idea. Other people have other ideas. I'mnot wedded to one single idea.\n\nAMANPOUR (on-screen): How do you feel when Speaker Boehner tellsABC News that he's not wedded to your program, it's a good idea, it'sone of many?\n\nRYAN: I've talked to John about this. It's an institutionalstatement reflecting budget resolutions. And what a budget resolution-- which is what we've passed -- it's the architecture of a budget.\n\nAMANPOUR: So you didn't take it personally about...\n\n(CROSSTALK)\n\nRYAN: No, not at all. I didn't take it personally. It's not --it wasn't meant to be personal. I don't take it that way.\n\nAMANPOUR: Are you sure about that?\n\nRYAN: Yeah, yeah. Yeah, I've talked to him quite a bit aboutthis.\n\nAMANPOUR (voice-over): And with that, we arrive at our nextstop.\n\nRYAN: Hey, folks. Nice to see you. Thank you very much.\n\nAMANPOUR: Some boos, but mostly cheers. The crowd is largelysupportive.\n\n(UNKNOWN): And I'd like to thank you for being a bold person andstanding up and saying, \"Listen, we can't continue this way.\"\n\nAMANPOUR: Still, this man is angry that Ryan's plan refuses toconsider raising taxes on the wealthiest Americans.\n\n(UNKNOWN): Borrow the money from the rich, fix the problem.\n\nRYAN: Look, I think a lot of people think this is sort of likethe magic fairy dust of budgets, that we can just make a small amountof people pay some more taxes and it will fix all of our problems.Well, let's keep our eye on the ball. The eye on the ball isspending. And the sooner we get this thing under control, the betteroff everybody is going to be.\n\nAMANPOUR (on-screen): How do you feel about being the bogeymanin this whole budget business?\n\nRYAN: You know, I don't really think about it. I sleep well atnight.\n\nAMANPOUR (voice-over): At the end of the day, Congressman Ryanand I sit down to talk about the bottom line.\n\n(on-screen): People who've been studying your numbers verycarefully and -- have been saying that the numbers don't add up.\n\nRYAN: Well, the Congressional Budget Office Says they do.\n\nAMANPOUR: Well, it also says that two-thirds of the savings thatyou want to make in the spending cuts come at the expense of programsdesigned for the poor, for the disadvantaged, and this is reverseRobin Hood-ism, if you like, take from the poor, give back to the richagain.\n\nRYAN: Yeah, sure, I've heard that. Yeah, I would disagree withthat. First of all, spending increases in this budget. Spending onthe safety net increases, but it increases at a more sustainable rate.Here's the problem, Christiane. The safety net we have right now isgoing bankrupt. It's tearing apart at the seams.\n\nAMANPOUR: What you're proposing seems like it's going to put alot of the burden on the seniors. They're worried that they're notgoing to be able to afford the cost of health insurance.\n\nRYAN: So we're saying give the most vulnerable people more moneyto cover their expenses and don't give wealthy people as much money tocover their expenses because they're wealthy and they should be ableto afford more. But we're also saying is, you've got to get at theroot cause of health inflation. Even President Obama is saying slowthe growth rate of Medicare.\n\nAMANPOUR (voice-over): For now, the president and thecongressman seem far apart. And as we crisscross his Wisconsindistrict, I ask Paul Ryan if some grand budget bargain could be in theoffing.\n\n(on-screen): Do you think that these massive issues that you'redealing with, the budget, let's say, can be done only by one party?\n\nRYAN: No. No, I don't. I think it's going to have...\n\nAMANPOUR: So you have to negotiate?\n\nRYAN: Oh, yeah, absolutely, yeah.\n\nAMANPOUR: You have to work together? RYAN: Yes, I think so.\n\nAMANPOUR: Is that atmosphere available...\n\n(CROSSTALK)\n\nRYAN: No, not right now.\n\nAMANPOUR: It's not, is it?\n\nRYAN: Look, we're probably not going to get some grand-slamagreement that fixes all of these problems. My now hope is to get asingle or a double, you know, to get something done that gets us onthe right path.\n\n(END VIDEOTAPE)\n\nAMANPOUR: Congressman Ryan says that he expects Republicans andDemocrats to agree on some fiscal controls to lock in spending levels,but he says a big-picture deal on the debt crisis probably won'thappen before the 2012 election. And it's what the treasurysecretary, Tim Geithner, said also on this program a couple of weeksago.\n\nSo the big question remains: Can the United States afford to waitthat long? Our powerhouse roundtable tackles that and weighs in withtheir reviews of the president's stand-up act, as well, at lastnight's White House correspondents' dinner.\n\n(BEGIN VIDEO CLIP)\n\nOBAMA: Tonight, for the first time, I am releasing my officialbirth video.\n\n(LAUGHTER)\n\nLet's take a look.\n\n(END VIDEO CLIP)\n\n(COMMERCIAL BREAK)\n\n(BEGIN VIDEO CLIP)\n\nOBAMA: He's taken some flack lately, but no one is happier, noone is prouder to put this birth certificate matter to rest than theDonald. And that's because he can finally get back to focusing on theissues that matter, like did we fake the moon landing? What reallyhappened in Roswell? And where are Biggie and Tupac?\n\n(LAUGHTER)\n\n(END VIDEO CLIP)\n\nAMANPOUR: A little light moment last night from the White Housecorrespondents' dinner. President Obama taking a shot at DonaldTrump. Funny stuff, and we'll talk about it a little later.\n\nBut across the country, passions are running high on a moreserious matter, a Republican debt reform plan that would slashspending and revamp Medicare and Medicaid without raising taxes on thewealthy. Has Paul Ryan laid the roadmap to victory for the Democrats?Or will his party have the last laugh?\n\nJoining me to answer that question, George Will, AriannaHuffington of the Huffington Post, Chrystia Freeland, global editor atThomson Reuters, and David Stockman, who served as budget directorunder Ronald Reagan.\n\nThank you all for being here. Some of us were at that dinnerlast night, but, first, George, you heard what I asked CongressmanRyan, asking him about some of the Republicans who seem to be runningnow from the plan. Is this an election loser for them? Will theystick with him?\n\nWILL: They've clearly made a wager that this time the Americanpeople mean what they say about cutting government. His plan now forthe budget is not the same as, but it's in the same general directionas the roadmap he proposed for entitlement reform and all the rest afew years ago (inaudible) pointing out the grand total of 13cosponsors. People are not eager to embrace it. He now hasessentially made them embrace it by making the running.\n\nRepublicans are somewhat emboldened by the example of Marco Rubiorunning for the Senate in Florida in 2010, when, in a state plantedthick with seniors, the state known as God's antechamber, as a matterof fact, in the great state of Florida, he said we must raise theretirement age and perhaps, in some sense, means test Social Security.He said that volatile thing in that state and won in a landslide.\n\nHUFFINGTON: (OFF-MIKE) starting to listen to this incrediblyshrinking budget debate where we're basically discussing what we'recutting without discussing what's happening in the country with jobs,basically, despite the fact that supposedly, you know, we have areduction in unemployment. We know this is really a statisticalreason because of the shrinking of the actual labor force, but not anyreal creation of jobs. And that's really what is so outstanding, thatwe are not focusing on this.\n\nAnd you go around the country, and there's this anxiety, thisfear about kids graduating from college not being able to get jobs.The foreclosures are still rampant. Even Mitt Romney, you know, inNew Hampshire actually took this on and sounded like a real populist,talking about the problems of people not being able to make ends meet.\n\nAMANPOUR: But what about the figures, the basic arithmetic? Imean, it is complex. You go to these town hall meetings, and thepresentations are complex. And even people with vaguely conversantviews on all of this find it difficult to understand. Is there a wayto figure out what the actual math is without entering political andideological debates? Is there a way to balance this budget, to reducethe debt, to get a hold of it without sort of hewing to very differentpolitical views?\n\nFREELAND: Well, I think it's always going to be a politicaldebate, but what I think is really missing in both the Republican andthe Democratic approach right now and is really an example ofpolitical cowardice is taxes.\n\nYou know, and we heard in your interview, Christiane, Ryansaying, well, you know, this is about cutting spending. It's partlygoing to be about cutting spending, but it is also going to be aboutraising taxes. And that's the thing that I think no one has thecourage to talk about.\n\nAnd it's partly going to be -- I think there should be more taxeson the very rich. They're doing incredibly well in this economy. Butit is also going to be about more taxes on the middle class, includingconsumption taxes.\n\nAMANPOUR: Well, that's interesting. I want to get toconsumption taxes. But, David, Paul Ryan says that people see taxhikes as sort of a fairy dust that will solve everything. Is eitherparty dealing with the tax issue in a way that could actually solvesomething?\n\nSTOCKMAN: No, I think both parties are delusional in thinkingthat this is a long-run problem. The Ryan plan gets the balancedbudget in 2030, the fiscal hereafter. We have a here-and-now problem.\n\nThis debt that we're issuing every day, $6 billion a day, is notbeing bought by real investors. It's being bought by the Fed andother central banks around the world, and they're going out ofbusiness in June. The Fed is stopping the bond-buying. QE2 is over.The Chinese no longer need to buy, and the Japanese have their ownproblem.\n\nSo once we have to sell the debt to real investors, interestrates are going to start rising and the crisis will come immediately,in the next two or three years.\n\nNow, what does Ryan do in the next two or three years? Nothing.He cuts $600 billion or $700 billion of spending, mostly from a smallpart of the budget, discretionary and the safety net, leaves Medicaretotally untouched for 3 years, leaves Social Security totallyuntouched for 10 years, leaves defense totally untouched for the next3 years, and then, after cutting that small amount, gives it all backby extending all the Bush tax cuts that we can't afford.\n\nNow, that's getting nowhere. In three years, he does not cut onedime from the debt.\n\nFREELAND: Yeah, David, I have a question for you. You workedfor Ronald Reagan. Do you think that America, the American economy --so you're like a red-blooded capitalist -- could it sustain highertaxes than it has now?\n\nSTOCKMAN: Absolutely. In 1982, we were looking at the jaws ofthe worst recession since the 1930s. We overdid it in '81, cut taxestoo much. We came back with the big deficit plan. In 1982,unemployment's 10 percent, the economy's in dire shape, and we raisedtaxes by 1.2 percent of GDP, which would be $150 billion a year, rightnow, not 10 years down the road, but right now. That's what we did in1982, because we still had people in government who realized you can'tsimply be putting on this kind of debt into the world financialmarket.\n\nAMANPOUR: So, George, Senate Majority Leader Harry Reid iscalling for a vote on this up or down. Is that -- what is that goingto do? And do you think there is room for some kind of debate on aconsumption tax, even though very few people want to do income?\n\nWILL: Oh, well, people of my persuasion will be all for it,considering a consumption tax, as soon as they repeal the 16thAmendment. Otherwise, they're going to pile a consumption tax, whichis invisible to most people, on top of the income tax.\n\nLarry Summers, the departing economic adviser, said conservativeshate the consumption tax because they think it's a money machine forgovernment and liberals don't like it because they think it'sregressive. We will get a consumption tax when conservatives realizeit's regressive and conservatives -- and liberals realize it's a moneymachine. It's not going to happen. The Senate has voted in anonbinding resolution something like 86-10 against the idea of aconsumption tax.\n\nHUFFINGTON: You know, what is interesting is what Ryan isleaving out. You know, he's talking about reforming Medicare. He'snot even allowing the government to negotiate with pharmaceuticalcompanies to reduce drug costs. So he's not only addressing the majorproblem of drug costs rising, of health care costs rising.\n\nAnd also finally over the last week, he started talking aboutcorporate welfare, about oil and gas subsidies, for example, but thatisn't part of his budget. So how can he be addressing seriously thebudget deficit without addressing seriously corporate welfare?\n\nHe said, which also sounded interesting, that he doesn't want thegovernment picking winners and losers. That's part of (inaudible)left and right debate. A lot of people across the political spectrumare saying that. Let's focus on this.\n\nAMANPOUR: He said to us that he is willing to talk about sort ofgetting rid of all those subsidies for oil companies and all thoseloopholes. Where do you think this is headed, though, in realeconomic fiscal terms? I mean, is there going to be some kind of dealon the very difficult issues?\n\nFREELAND: I thought that what you and Ryan had to say was right.I think that it's hard to see a real deal before the presidentialelection, and I think that David is right to point out that that couldturn out to be quite tricky. And where we will really have theimportant market judgment is in June, when all this money that theFederal Reserve has been pumping into the economy and buying back,that's going to stop, and we're going to really see, how much is theworld prepared to support the U.S. economy?\n\nAMANPOUR: All right. We'll continue right after a break. Andup next, President Obama releases his birth certificate and DonaldTrump claims credit. More of that with our roundtable right afterthis.\n\n(COMMERCIAL BREAK)\n\n(BEGIN VIDEO CLIP)\n\nOBAMA: But I'm speaking to the vast majority of the Americanpeople, as well as the press. We do not have time for this kind ofsilliness. We've got better stuff to do.\n\nTRUMP: Today, I'm very proud of myself, because I'veaccomplished something that nobody else has been able to accomplish.Our president has finally released a birth certificate.\n\n(END VIDEO CLIP)\n\nAMANPOUR: President Obama and Donald Trump earlier this week.So have we seen the last of the birthers? Let's bring back ourroundtable.\n\nHave we seen the last of this, George?\n\nWILL: Sure, I mean, to the extent that people are open toevidence. Now, there are some people in a nation of 310 millionpeople -- there are some people who are just cracked, and we're alwaysgoing to have them out there.\n\nAMANPOUR: You know, you say cracked. On this program last week,we spoke with Reverend Franklin Graham, and he seemed to flirt withthe idea of giving some credence to this and also supporting DonaldTrump. And then when I asked him sort of, you know, why is it thatthis issue has been hijacked by the lunatic fringe and it's becomesuch an issue? This is what I asked him, and listen to what heresponded.\n\n(BEGIN VIDEO CLIP)\n\nAMANPOUR: You're a very important figure, and you have a bigfollowing, and you have a lot of authority. This business about thebirth certificate, it really has been debunked over and over again.So I just want to know why somebody like you can't just say, \"Enoughalready.\"\n\nGRAHAM: Oh, no, I'm not -- you were asking me about DonaldTrump...\n\nAMANPOUR: No, I'm now talking about President Obama.\n\nGRAHAM: Oh, right. But it's Trump that has brought this up.I'm not bringing up his birth certificate. I'm just saying, it lookslike, for the critics out there, his critics -- and I'm not one ofthem -- his critics, it looks like he could shut their mouths prettyquickly by coming up with a little bit more than what he's come upwith.\n\n(END VIDEO CLIP)\n\nAMANPOUR: So he has come up, and you're shaking your head,Chrystia.\n\nFREELAND: I think it's obvious that it's just going to move onto new things. And we've already seen Donald Trump talking about,well, you know, maybe his college -- maybe his college documentsaren't exactly right.\n\nI mean, I think that there is something behind all of this thatenough people aren't talking about and that the president actuallyrather recently hinted at in his speech last night, with the \"LionKing\" stuff and then saying, you know, Michele Bachmann, maybe she wasborn in Canada. There is a racial element here. And I think thatpart of the whole birther movement is about finding a way that isn'tovertly racist to say, is he really American? You know, can thisblack guy really be an American?\n\nSTOCKMAN: I don't think it's so much racism. I think it'sWashington has succumb to theater and has lost the point that itshould be about governance. And one of the reasons for that is thatthe Fed has enabled Washington to run massive deficits year after yearafter year and issue all of these bonds and get away with it.\n\nAnd so, therefore, since they're not worried, since they don'tfear the consequence of what they're doing, they're willing to engagein this kind of, you know, rank theater, when, so to speak, Rome isburning.\n\n(CROSSTALK)\n\nSTOCKMAN: And one of these days we're going to have a rudeawakening, and I believe it's coming soon.\n\nAMANPOUR: So...\n\n(CROSSTALK)\n\nHUFFINGTON: But this is also something that's always happened intimes of deep economic anxiety. Paranoid politics can thrive, anddemagoguery can thrive, and people can believe things for whichthere's no evidence.\n\nAMANPOUR: So, clearly, people have believed things for whichthere's no evidence, but, George, what does this mean now for theRepublican field? I mean, is Donald Trump a serious candidate or hashe been deflated, given the fact that Haley Barbour, governor ofMississippi, has stepped out? Where does the Republican field looklike it is right now?\n\nWILL: The Republican field is perfectly fine. They lost inHaley Barbour a plausible president, and they lost it because heunderstands the Broder rule. The late David Broder said anyone whowill do what you have to do to become president shouldn't be allowedto be president. And he said this requires a 10-year commitment; I'mnot prepared to make it. That's not a moral failing. In some people,it's a sign of maturity. You have Romney, Pawlenty, perhaps MitchDaniels -- I don't -- who am I leaving out?\n\nFREELAND: Huckabee.\n\nHUFFINGTON: Huntsman.\n\nWILL: Huntsman.\n\nFREELAND: Isn't this a good moment for Huckabee now?\n\nWILL: It might be, but the fact is, we're actually fairly faralong in this process. We've winnowed the field already. We knowbasically who the choice is going to be. The Republicans have tosimply nominate someone who is a plausible president and then itbecomes a referendum on Mr. Obama.\n\nHUFFINGTON: But, actually, George has a point here. And SethMeyers last night in a way made that point when he said the one personwho can really beat you, Mr. President, is Obama '08, and don't youmiss him, effectively? What happened to him?\n\nAnd I was talking to a hard-core Democrat after the dinner whosaid to me that Obama is gone. He said he's not coming back. We justhave to win. So this is what's happened, and it's a interestingdynamic. You know, hard-core Democrats are just about winning, butthe problem for the White House is all the first-time voters who cameout in large numbers and really got him to the White House in '08.Are they coming back? Because they're not just about winning. Theywere inspired. And that was the other thing that Seth Meyers saidyesterday. What is will.i.am going to do this year? Is he going tofind something to rhyme with debt ceiling? That's a big problemfor...\n\n(CROSSTALK)\n\nAMANPOUR: Well, talking to that, what is the correct or thewinnable economic strategy to be taking going into this election?Obviously -- and you've all been saying it -- it is about jobs. And Ithink you've been saying that all of this is obscuring the necessityto figure out jobs.\n\nFREELAND: Well, I think especially for a Democrat, which thepresident is, I've been surprised that they haven't pushed much moreon that. Maybe they're worried that they don't have a very strongjobs record, but I think that they really are letting the Republicansset the terms of the debate, and the debate right now is about cuttingspending, maybe raising taxes. I think that a smart Democraticstrategy would be to come out and say, \"I am the guy who is going tofocus on middle-class jobs. I care about that.\"\n\n(CROSSTALK)\n\nSTOCKMAN: No, I think the right strategy is to focus on theengine of destruction in our economy today, which is the Fed. The Fedis savaging Main Street, with zero earnings -- interest on theirsavings, with this massive inflation we have now in food and fuel. Atthe same time, it is fueling the greatest bubble that we've seen yet,even bigger than housing. It's all going to a few thousand people onWall Street.\n\nFREELAND: But, David, come on...\n\n(CROSSTALK)\n\nSTOCKMAN: Now, that has to stop...\n\nAMANPOUR: On that note...\n\nSTOCKMAN: ... and he could stop that. And yet what did he do?He reappointed the same guy who brought you the problem that electedhim in 2008.\n\nAMANPOUR: You're going to discuss this further in the GreenRoom. And up next, we go live to Rome, where this morning theCatholic Church puts Pope John Paul II one step closer to sainthood.\n\n(COMMERCIAL BREAK)\n\nAMANPOUR: Welcome back. We told you at the top of this programthat a NATO air strike hit a building with Moammar Gadhafi inside inLibya. Reportedly it just missed him, but killed his youngest son andthree grandchildren.\n\nAnd it's been a costly week across the Middle East, including forthe United States servicemembers, nine of whom were murdered by anAfghan pilot right there near Kabul.\n\nJoining me to talk about it all is Vali Nasr, who until veryrecently was a senior adviser to the State Department on the MiddleEast and Afghanistan, and Aaron David Miller of the Woodrow WilsonInternational Center, who also used to be a Middle East peace adviserto various administrations.\n\nGentlemen, thank you both very much for joining me.\n\nMILLER: A pleasure.\n\nNASR: Thank you.\n\nAMANPOUR: So this is a big day, and people are wondering whetherthis is going to be a turning point, this attack in Tripoli, veryclose to the Gadhafi stronghold, and apparently killing one of hissons. Vali, what does this mean as the U.S. policy seems to be in astalemate?\n\nNASR: Well, aside from the diplomatic issues that it raises,it's now very clear that the narrative is rapidly changing, that thisdemocracy wave is not self-sustaining anymore. It's increasinglycoming upon the United States or the pressure is on the United Statesto push it to the next stage. And that could be a tall order. Itcould be expensive. It could be messy. And we need to sort of stepback and think about how we tackle this new challenge.\n\nAMANPOUR: So, in Libya, you say the narrative is changing. Isit saying it's a war without end? Is it -- what is it saying there?\n\nNASR: Well, it has been a war without end, but now it's alsocoming down -- at least the narrative that's going to be seen iscoming down to literally having to remove Gadhafi out of the scene.And if NATO is going after him, it is essentially sending a signal outthat democracy is not going to succeed, that the rebels are not goingto succeed unless we go in and remove the leadership. And thatobviously is a whole new order of business with this issue.\n\nAMANPOUR: So potentially removing the leadership, if it comes tothat, what about in Syria, where you've worked very closely on thoseissues for Republican and Democratic administration? People arelooking at that. It's been a very bloody week in Syria, and yet nosort of idea that Bashar Assad, the president, should be removed.\n\nMILLER: It's because great powers are allowed and do behavehypocritically and inconsistently. And the reality is, Libya waseasy. It was vulnerable. No serious air defense system. No seriousallies. We could get away with and did military intervention.Syria's quite different.\n\nAnd, number two, you don't have a fundamentally divided country.You don't have Syrias right now. You have repression. And you haveBashar Assad mobilizing the instruments of power in order to stay inpower. I think the arc on the Assads over time is a negative one, andI think they're an old story, but it's going to take a long time forthis movie to play out.\n\nAMANPOUR: The movie is being very closely watched by many peoplein the United States and around the world. People are always comingup to me and asking me, what does this all mean for us, what happenedin Tunisia, what happened in Egypt?\n\nPeople thought Egypt was a democratic revolution, whichpresumably it still has an opportunity to be, but the latest Pew pollsgive some worrying figures for the United States, basically sayingabout Egypt that 52 percent of Egyptians now disapprove of howPresident Obama is dealing with the calls for political change intheir own nation, Egypt, elsewhere, Tunisia, Bahrain, and Libya. Andthen their view of the United States, 79 percent unfavorable, 20percent favorable. Vali, how can this be? People hoped that ademocratic Middle East would actually have a better view of the UnitedStates.\n\nNASR: Well, first of all, we're not at a democracy in the MiddleEast. All that we've achieved is that in Tunisia and Egypt, whichwere the easy cases, the leadership has gone. There's still a longdistance between the old order going and actually arriving atdemocracy. And there is also a very short distance in these kinds ofsituations between euphoria and disenchantment.\n\nAnd finally, the fundamental issues that divided the people ofthe Middle East from the United States have not gone away. The MiddleEast has been busy with other issues recently, but when the dustsettles, the critical issues of the Arab-Israeli peace process, thiswhole issue between Islam and the West, Iran, you know, all of theseissues, Al Qaida, are still there. And nothing has happened to closethe gap between our perception of those issues and the people'sperception of those issues in the Muslim world.\n\nAMANPOUR: I'm going to get to the Middle East peace process intwo seconds, but I just want to ask you further, the foreign policy ofEgypt looks like they are going closer to their traditionaladversaries -- let's say Iran, let's say Hamas -- people who are sortof -- definitely adversaries of the United States, as well. How isthis going to work out? And why is that?\n\nNASR: Well, because for the longest time our foreign policy inthe Middle East was based on the support of the palaces, who reallydidn't need to deal with the street and the people in the Middle East.It's the Mubaraks and Ben Alis and, you know, kings of Saudi Arabiaand Jordan that made decisions that we work with. Now we have to dealwith countries that are reflecting the public opinion of their masses.\n\nAMANPOUR: Of the street. It's the famous Arab street.\n\nNASR: Arab street. And until such day where there is somecommon ground between our street and their street, we're going to havethis disjunction. It's possible, for instance, on the issue of AlQaida that we can -- there can be some sense of common interestbetween Americans and the people of the Middle East. But on issues ofArab-Israeli issue, on Iran, and on a number of other issues, the gapis still too wide, and we're going to see that opinion of the regionis going to get reflected in the foreign policy.\n\nAMANPOUR: And now, on the Middle East, people also are nowasking about the development this week, the rapprochement between thePalestinian Authority, supported by the United States, and Hamas,which the U.S. and Israel say is a terrorist organization. What doesthat mean for the peace process? And is there one?\n\nMILLER: It's not even noon and I'm already depressed talkingabout focusing on this issue. I mean, Vali's point is a good one.And before the Middle East issue, our street cred is way down. We'reneither admired, feared or respected as much as we need to be, giventhe fundamental nature and vital interests that we have in thisregion.\n\nWe're involved in three wars where the standard for victory isnot can we win, but when can we leave? We are responding in a verydifficult -- and it's understandable way to both the Arab spring inEgypt and Tunisia and the Arab winter in Bahrain, in Yemen, and inSyria. So our prestige and power...\n\nAMANPOUR: It's events-driven.\n\nMILLER: For sure. Our prestige and power is way down. And whathistory teaches us is when, in fact, the United States presides overbreakthroughs on this other issue, the problem of the much toopromised land, the Israeli-Palestinian conflict, our street cred wasactually up. We demonstrated both in warmaking and peacemaking --Kissinger, Carter and Baker, the three -- that we could actuallysucceed. Right now, we're stuck. We're stuck in a region we can'tfix and we're stuck in a region from which we cannot extricateourselves. Bad news for the great power.\n\nAMANPOUR: It sounds pretty bad news the way you're saying it.And I wanted to ask you -- there was an article in the New Yorker thisweek which quoted an administration official as saying that the policyright now was lead from behind. What does that mean, lead frombehind?\n\nNASR: Well, I don't know the exact context in which that...\n\nAMANPOUR: Talking about Libya and elsewhere.\n\nNASR: Elsewhere. But the real issue for us is this, is that wehave a disjuncture between our means and our goals in the region.We're not dealing with events in only one country. We're dealing withevents over a vast region that may be unfolding over a number ofyears, and we have to find a way to have a sustainable policy.\n\nAnd therefore, if we push too hard, if we remove governments,then much has happened in Iraq or Afghanistan. We're going to own itafterwards. We have to do the state building, which has not been easyor cheap for us. And therefore, there is a sense that we need tocalibrate.\n\nAMANPOUR: So is right now the net positive for the United States-- the net result positive, or negative, or is the jury still out inthe Middle East in that region?\n\nNASR: I think the jury is still out, because many people assumethat this will be a short-run, very quick, very painless set of eventsthat will end up with a much better Middle East after that. Now we'relooking at a multi-year process that doesn't have a very clear end.And if anybody thought that we will be done with the Middle Eastquickly and we're going to go to China and India, we're going to bebusy with this issue for some time.\n\nAMANPOUR: Gentlemen, thank you both very much, indeed.\n\nStay with us. We're live next from the Vatican where thousandsare celebrating as Pope John Paul II takes one step closer tosainthood. That just after a short break.\n\n(COMMERCIAL BREAK)\n\nAMANPOUR: We were just speaking about the Arab spring. And wellbefore that uprising, there was the fall of the Iron Curtain, endingcommunism in Eastern Europe. And that, of course, was back in 1989.It was a cause dear to Pope John Paul II.\n\nAnd this was the scene at the Vatican, St. Peter's Square, thismorning, where hundreds of thousands of pilgrims are on hand as JohnPaul moves one big step closer to sainthood. Our David Wright isthere right now.\n\nDavid?\n\nWRIGHT: Good morning, Christiane.\n\nYou know, the last time all of these people were gathered here tohonor Pope John Paul was, of course, at his funeral six years ago.And you remember then, they were all chanting, \"Santo subito,\"\"Sainthood now.\" Well, today's event is a partial fulfillment of thatdemand. He's not a saint yet, but he has moved a lot closer.\n\nAnd consider: This church took 478 years to beatify Joan of Arc,so for John Paul II, six years is pretty subito.\n\n(BEGIN VIDEOTAPE)\n\nWRIGHT (voice-over): Six years have passed since the faithfullast gathered in St. Peter's Square to honor Pope John Paul, six yearssince his coffin was closed and placed in the crypt beneath thebasilica, but workers have reverently removed it from its marble tomb.And with cardinals as the foremen, they placed it in front of the Tombof St. Peter.\n\nToday, the closed casket is at the main altar, where John Paullay in state six years ago. Pope Benedict and the cardinals were thefirst to pay their respects.\n\nIn life, he was a towering figure, not just for the church, buton the world stage. In death, there have been questions about hisstewardship of an institution rocked by internal divisions and byscandal.\n\nHe inspired the revolution that ultimately forced the collapse ofcommunism. Shortly after his election, the young pope famouslyexhorted his fellow Poles, do not be afraid. He gave them the courageto rise up, said Lech Walesa, the founder of Solidarity, the Polishworkers first to challenge communist authority.\n\nSoviet leader Mikhail Gorbachev later said that the collapse ofthe Iron Curtain would have been impossible without John Paul, but healso had plenty of detractors because of his handling of the massivechurch abuse scandal that happened on his watch.\n\nWAUCK: The people who are shouting \"Santo subito,\" as far as Ican tell, are still shouting, \"Santo subito.\"\n\nWRIGHT (on-screen): But there are some people who are saying,\"Hold the halo.\"\n\nWAUCK: The same people who are saying \"Hold the halo\" now Ithink were the people who would have been saying it five years ago.\n\nWRIGHT (voice-over): \"His name will forever be blessed,\" PopeBenedict proclaimed at today's beatification mass. At that moment, anenormous tapestry unfurled. Blessed Pope John Paul is now well on hisway to sainthood.\n\nWILLIAMS: In practical terms, to declare a person blessed orbeatified means that they're in heaven. It's really just a statementby the church. It's a recognition of heroic virtue, of a life ofsanctity, of holiness, and that this person is with God.\n\nWRIGHT: Investigators have pored over his life for the past fiveyears looking not just at his promotion of world peace, but also atthe moral example he set in public and private. For instance, afterthat assassination attempt in 1981, Pope John Paul was criticallywounded. Later, he sat down with the man who shot him and offeredforgiveness. WAUCK: One of the most heroic acts of virtue that exists isforgiveness. And to forgive someone who tried to kill you -- andalmost did -- I mean, it doesn't get much more powerful than that.\n\nWRIGHT: Under the Vatican process, heroic virtues aren't enough.\n\nSARNO: For beatification and canonization, the church requires aphysical miracle, a healing or some physical reality that can bemeasured.\n\nWRIGHT: This French nun says she was cured of Parkinson'sdisease after she and members of her convent prayed to the late pope.At today's mass, Sister Marie Simon-Pierre carried a relic of JohnPaul, a vial of his blood extracted during his long illness.\n\nBut there are also detractors.\n\n(on-screen): So you're not a big fan of Santo subito in thiscase?\n\nLYNAUGH: No, I have deep reservations.\n\nWRIGHT (voice-over): Joe Lynaugh is one of many Catholics whosay the speed of John Paul's fast-tracked sainthood is an insult tothe victims of sexual abuse.\n\nLYNAUGH: I guarantee you that the argument will be made thatthese issues have been settled or have been almost settled because wehave beatified John Paul.\n\nWRIGHT: Cardinal Donald Wuerl of Washington, D.C., insists thescandal did not diminish John Paul's obvious sanctity.\n\n(on-screen): At the same time, there is a groundswell of peoplethat are saying, \"Not so subito.\"\n\nWUERL: Everybody on this planet recognized that this man, JohnPaul, was a man of God. He had a close relationship with God. Andthe church is simply recognizing officially what everybody in theirhearts knows.\n\n(END VIDEOTAPE)\n\nWRIGHT: People have been pointing out that the fast track tosainthood is really one of the more democratic things in aninstitution that is almost definitively top down. Keep in mind itwasn't the bishops and the cardinals chanting \"Santo subito.\" It wasthe people, and the church today is partially ratifying that wish.And now all that remains is another miracle, and people here arepraying and waiting for that before John Paul gets declared a saint.\n\nChristiane?\n\nAMANPOUR: Thanks, David, there in Rome. And we'll have more ina moment. Stay with us.\n\n(COMMERCIAL BREAK)\n\nAMANPOUR: It's been a costly week in Iraq and Afghanistan. ThePentagon has released the names of 25 servicemembers killed in thepast week.\n\nThat's it for our program. Join me to continue the conversationon Twitter and on abcnews.com, and be sure to tune in for \"World NewsTonight\" for a full report on the day in Rome, as well as the latestfrom Libya. We leave you now with the scene in St. Peter's Squaretoday, as the late Pope John Paul II was beatified, bringing him, aswe say, one step closer to sainthood.\n\nSo for all of us here at \"This Week,\" thank you for watching, andwe hope to see you again next week.", "images": ["https://s.abcnews.com/images/Politics/uvalde-1-gty-er-221007_1665161778549_hpMain_1x1_144.jpg", "https://s.abcnews.com/images/US/subway-stabbing-ho-mo-20221007_1665149319841_hpMain_1x1_144.jpg", "https://s.abcnews.com/assets/dtci/images/placeholders/16_9.svg", "https://s.abcnews.com/images/US/3-las-vegas-maris-mareen-digiovanni-w-01-ht-iwb-21007_1665148297878_hpMain_1x1_144.jpg", "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "https://s.abcnews.com/images/Politics/trump-white-house-oval-office-gty-jt-221004_1664919462010_hpMain_1x1_144.jpg", "https://s.abcnews.com/images/US/Uvalde-Crimson-Sanchez-01-ht-llr-221006_1665081913151_hpMain_2_1x1_144.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "keywords": [], "authors": ["Abc News"], "canonical_link": "https://abcnews.go.com/ThisWeek/week-transcript-rep-paul-ryan/story?id=13502946", "title": "'This Week' Transcript: Rep. Paul Ryan", "meta_data": {"description": "Transcript of 'This Week' interview with House Budget Committee Chairman Paul Ryan.", "keywords": "this week, christiane amanpour, god, government, easter, graham, sharpton, keller", "copyright": "2022 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "'This Week' Transcript: Rep. Paul Ryan", "og": {"site_name": "ABC News", "url": "https://abcnews.go.com/ThisWeek/week-transcript-rep-paul-ryan/story?id=13502946", "title": "'This Week' Transcript: Rep. Paul Ryan", "description": "Transcript of 'This Week' interview with House Budget Committee Chairman Paul Ryan.", "image": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2011-05-01T15:01:03Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/prism-story,13502946", "ipad": "abcnewsipad://link/prism-story,13502946", "googleplay": "https://abcnews.go.com/ThisWeek/week-transcript-rep-paul-ryan/story?id=13502946"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "'This Week' Transcript: Rep. Paul Ryan", "description": "Transcript of 'This Week' interview with House Budget Committee Chairman Paul Ryan.", "url": "https://abcnews.go.com/ThisWeek/week-transcript-rep-paul-ryan/story?id=13502946", "image": {"identifier": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/prism-story,13502946", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/prism-story,13502946", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/ThisWeek/week-transcript-rep-paul-ryan/story?id=13502946", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/ThisWeek/week-transcript-rep-paul-ryan/story?id=13502946"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "http://abcnews.go.com", "summary": ""}