{"url": "https://www.wmagazine.com/gallery/paris-fashion-week-spring-2019-best-looks", "text": "The last leg of fashion month is officially here! Fashion editors, stylists, influencers, and of course celebrities have already traveled from the rainy streets of New York, to London for Riccardo Tisci’s Burberry debut, to Milan, where Prada was a standout. Now it’s time for Paris, where everyone is patiently awaiting the debut of Hedi Slimane at Celine. Celine that is, without the accent. Meanwhile, quite a few labels have hopped the pond to show in Paris this season—including Gucci (for a one-time-only affair), London’s Marques’ Almeida, Altuzarra and Thom Browne, who both bucked the trend of American designers coming back to New York Fashion Week. Dior kicked off Paris Fashion Week with a runway show and performance at the Hippodrome Longchamp Paris, while Nicolas Ghesquière’s Louis Vuitton will close out the Spring 2019 collections. Here’s the best we saw this week.\n\n1 Dior Dance was at the forefront of Maria Grazia Chiuri’s mind for this remarkably airy and free collection. This ballet pink dress on Adwoa Aboah highlights the lightness (no corsets here!) of spring 2019.\n\n2 JAcquemus While many in Jacquemus’s influencer-lined front row will quickly snap up his oversized straw bag, teeny bikinis, and Instagram-ready sensual fare, this trench, which bares just the right amount of leg, stays true to the label’s tailoring roots.\n\n3 Marine Serre CatwalkPictures.com Though Marine Serre is having a break-out moment, it has clearly not gone to her head. Her values, such as sustainability, are still at the brand’s core, with 50 percent of the spring runway show coming from upcycled fabrications and products. A standout look was this opera coat, covered in watch fobs, inspired by her grandfather’s personal collection.\n\n4 Gucci Victor VIRGILE Alessandro Michele’s spring collection for Gucci was chock full of his geeks, nerds, and 80’s glam gals, and we in particular loved this shiny number for the way the pastel blue pops against the red sock and shoe. Though the Emmys may have passed, one can easily assume we will see this gown on the red carpet sometime soon.\n\n5 Saint Laurent Pascal Le Segretain In his last few shows for Saint Laurent, Anthony Vaccarello has opted not to do a finale, instead sending out a series of variations on an idea, and usually, in all black. Today, Vaccarello honed in on the bodysuit, cut and spliced in numerous ways. They were sexy, editorial and fun. Let’s see how real girls opt to wear these come spring.\n\n6 Maison Margiela John Galliano’s spring collection for Maison Margiela was gender fluid, with people of all sexes walking the runway in suiting pieces that were in different phases of completion. The finale looks featured touches of a ’50s cocktail dress: elegant fabric formed in a traditional v-neck silhouettes, worn over suit jackets and shiny latex pants, a nod to Galliano’s own gender bending college days when Boy George and Leigh Bowery were the kings of London nightlife.\n\n7 Mugler Estrop Casey Cadwallader is the new designer behind Mugler. For his first runway show, he presented innovative denim and a collaboration with the artist Samara Scott, two ideas that found their root in his first pre-collection for the house. Other pieces, like this gathered and ruched dress, felt fresh and exactly what a young women today will want to wear.\n\n8 Dries Van Noten Estrop It wouldn’t be a Dries Van Noten collection without poppy colors, a floral print, texture, shine, and an extra abstract print tossed in for good measure. Under his deft hand, it all comes together impeccably, as seen in this rather ladylike look, and with a jolt of colored netting, it becomes thoroughly modern.\n\n9 Paco Rabanne Paris Fashion Week is dreaming of their next getaway, and Julien Dossena certainly has, as well, as evidenced by his spring collection for Paco Rabanne. Patch-worked prints and found ‘souvenirs’ influenced this playful collection, which is ready for warmer climates.\n\n10 Chloé Kristy Sparow Natacha Ramsay-Levi hit the nail on the head this season with her spring collection for Chloé. The Chloé girl is off in Ibiza, with her oh-so-chic wardrobe—a mix of florals, paisleys, loads of desirable jewelry, and perfect bags.\n\n11 Isabel Marant Victor VIRGILE Isabel Marant’s bohemian French girl has gone ’80s this season, with lots of glitz, big shoulders, and like it or not, acid wash denim.\n\n12 Y/Project Glenn Martens knows what the cool girls want. For Spring 2019, he polished-up his signature pieces. With this tracksuit, she can go from day to night, just add a chic pair of heels.\n\n13 Loewe Jonathan Anderson focused on craft for his spring collection at Loewe, and his mix of bohemian influences and refined textures are two things that will resonate with today’s self-assured woman.\n\n14 Balmain Dominique Charriau Among the glizty denim and metallic looks was a sea of white. This Balmain look in particular interprets a couture shape for today.\n\n15 Valentino The Valentino spring collection was both beautiful and utterly charming. While many of the looks were crisp black and white, a selection of funky prints played into a feeling of escape—a popular thread throughout Paris Fashion Week. Thought Jacquemus’ straw hats were good? Only a couturier could take it up a notch, with all-feather sunhat, paired with a bohemian feather-trimmed outfit.\n\n16 Thom Browne While much of this collection seemed to be a twisted Friday the 13th take on the 4th of July holiday, this look in particular is couture-like take on an outfit that goes from beach to bar.\n\n17 Hermès The outerwear was a joyful highlight of the spring collection, with two jackets in particular packing a colorful punch: this one in classic Hermès orange with buttery leather detailing, and a bright turquoise length version.\n\n18 Givenchy With its charming pleat details, and make-you-do-a-double-take floral print, one can expect that this Givenchy gown from the spring collection will make its way to a red carpet soon.\n\n19 Sonia Rykiel Peter White Julie de Libran’s spring collection for Sonia Rykiel was inspired by the humble net bag, the bag she often carries on weekend mornings to do her grocery shopping at a local market. It just so happens that the open air market she prefers is at the end of a little allée that now has been renamed in the designers honor by the city of Paris.\n\n20 Comme Des Garçons Victor VIRGILE If nothing else, this Comme Des Garçons collection signaled a rebirth. After breaking chains in the first few looks in this collection, this look, with the model’s coat cracking open, initiated a new beginning for the collection that is often known for its over-the-top bulbous silhouettes.\n\n21 Stella McCartney Estrop For spring, Stella McCartney featured updated takes on a handful of signature pieces, including satin and lace slip dresses, and suiting. The newness on the runway this season came in the shape of a one-piece floral ensemble, and the introduction of elevated tie-dye.\n\n22 Alexander McQueen Sarah Burton’s latest collection for Alexander McQueen delved into familiar McQueen tropes, including leather corseting, romantic knit dresses, cut-outs, and floral woven fabrics inspired by upholstery.\n\n23 Louis Vuitton Pascal Le Segretain The 80’s ruled at Louis Vuitton, or for at least the first half of the show, until the collection took a turn for the futuristic. This look—a futuristic silver shirt under a vintage-feeling jacquard—is a modern way to dress for today.\n\n24 Miu Miu For spring, the Miu Miu collection balanced girlish touches—think rosettes, bows, crystal jewelry—with refined, expensive pieces that even a minimalist could love (including leather blazers and skirts). This look in particular, in cherry red, was the meeting point of both ideas.\n\n25 Chanel Chanel sur la plage? Bien sûr! From chic tweedy two pieces, maillots layered with denim, to a classic LBD, all the Chanel on show felt adaptable for the sun and sand.", "images": ["https://imgix.bustle.com/wmag/2018/10/01/5bb26f49870d462dcfbfdcac_Valentino.jpg?w=374&h=561&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/10/02/5bb3cce355c9394787286eae_Louis-Vuitton.jpg?w=374&h=561&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/09/26/5babd6cf55c9394787286d6e_MARGIELA.jpg?w=374&h=562&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/10/01/5bb272add31d2c7f0f0230e9_Sonia-Rykiel.jpg?w=374&h=562&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/wmag/2018/09/27/5bad4098d31d2c7f0f023061_PACO-RABANNE.jpg?w=374&h=561&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/10/01/5bb27184d31d2c7f0f0230e7_HERMES.jpg?w=374&h=561&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/09/25/5baa8ae9d31d2c7f0f023009_Marine_Serre_SS19_Look_39.JPG?w=374&h=561&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/10/02/5bb3d41255c9394787286eb0_Chanel.jpg?w=374&h=562&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/09/27/5bad4d60d31d2c7f0f023063_YProject.jpg?w=374&h=561&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/09/26/5babd84ad31d2c7f0f023032_Mugler.jpg?w=374&h=561&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/09/25/5baa99947359e94f4fc118fc_GettyImages-1040103914.jpg?w=374&h=561&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/10/01/5bb27065962617523009ddc1_Thom-Browne.jpg?w=374&h=561&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/09/27/5bad44d2e9119e04f771dee9_CHLOE.jpg?w=374&h=562&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/10/4/04294a44-e8b5-4d15-89b9-a9ac885438d8-gettyimages-1429625738.jpg?w=160&h=160&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.5133&fp-y=0.2436", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/wmag/2018/10/02/5bb3cd05870d462dcfbfdd01_Louis-Vuitton.jpg?w=414&h=621&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/10/02/5bb3d41255c9394787286eb0_Chanel.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/wmag/2018/09/28/5bae81c0e9119e04f771df49_BALMAIN.jpg?w=374&h=561&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/10/01/5bb28493d31d2c7f0f0230f2_ALEXANDER-MCQUEEN.jpg?w=374&h=562&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/09/25/5baa5b3c962617523009dcbe_JACQUEMUS.jpg?w=374&h=561&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/10/01/5bb27724e9119e04f771dfbb_CDG.jpg?w=374&h=560&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/10/5/7f483425-1ff0-4a56-a7f0-6d2dbd9a2b9a-112e562c-220e-4711-bdf6-a8681a0701d1-getty-1430448745.jpeg?w=160&h=160&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.4933&fp-y=0.1311", "https://imgix.bustle.com/wmag/2018/10/01/5bb279e1962617523009ddc9_STElla-mccartney.jpg?w=374&h=561&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/09/25/5baa8ef271951c4a112646ac_Gucci.jpg?w=374&h=560&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/09/25/5baa58e37359e94f4fc118e4_CHRISTIAN-DIOR.jpg?w=374&h=561&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/09/26/5babda5355c9394787286d72_Dries-Van-Noten.jpg?w=374&h=561&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/09/28/5bae7d73962617523009dd78_Loewe_SS19_Look_52.jpg?w=374&h=561&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/10/02/5bb3d248e9119e04f771e016_MIU-MIU.jpg?w=374&h=561&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/09/28/5bae832271951c4a1126478e_Isabel-Marant.jpg?w=374&h=560&fit=crop&crop=faces&auto=format%2Ccompress", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/wmag/2018/10/01/5bb271da55c9394787286e2d_GIVENCHY-SS19-25.jpg?w=374&h=561&fit=crop&crop=faces&auto=format%2Ccompress"], "top_img": "https://imgix.bustle.com/wmag/2018/10/02/5bb3d41255c9394787286eb0_Chanel.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.wmagazine.com/gallery/paris-fashion-week-spring-2019-best-looks", "title": "The Best Looks of Paris Fashion Week Spring 2019 So Far", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@wmag", "card": "summary_large_image"}, "article": {"publisher": "https://www.facebook.com/wmagazine"}, "og": {"site_name": "W Magazine", "url": "https://www.wmagazine.com/gallery/paris-fashion-week-spring-2019-best-looks", "type": "article", "title": "Here Are the Best Looks of Paris Fashion Week So Far", "description": "We picked the very best at Chanel, Vuitton, Saint Laurent, and more.", "image": {"identifier": "https://imgix.bustle.com/wmag/2018/10/02/5bb3d41255c9394787286eb0_Chanel.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "We picked the very best at Chanel, Vuitton, Saint Laurent, and more."}, "movies": [], "publish_date": null, "source": "https://www.wmagazine.com", "summary": ""}