{"url": "https://en.wikipedia.org/wiki/Lena_Waithe", "text": "American actress, producer, and screenwriter\n\nLena Waithe (born May 17, 1984)[1][2] is an American actress, producer, and screenwriter. She is the creator of the Showtime drama series The Chi (2018–present) and the BET comedy series Boomerang (2019–20) and Twenties (2020–present). She also wrote and produced the crime film Queen & Slim (2020) and is the executive producer of the horror anthology series Them (2021–present).\n\nWaithe gained recognition for her role in the Netflix comedy-drama series Master of None (2015–present) and became the first African-American woman to win the Primetime Emmy Award for Outstanding Writing for a Comedy Series in 2017 for writing the show's \"Thanksgiving\" episode, which was loosely based on her personal experience of coming out to her mother. She has also appeared in Steven Spielberg's 2018 adventure film Ready Player One and the HBO series Westworld.\n\nWaithe was included in Time magazine's 100 Most Influential People of 2018[3] and on Fast Company's Queer 50 list in 2021 and 2022.[4][5]\n\nEarly life and education [ edit ]\n\nWaithe was born in Chicago, Illinois.[6][7] Her father, Lawrence David Waithe, died when she was fifteen.[8] Her paternal great-grandfather, Winston Waithe, emigrated from Barbados to Boston in 1921; his family, descended from sugar plantation slaves, was from Christ Church, Barbados.[8] Though acting was not originally among her ambitions,[9][10] she knew from the age of seven that she wanted to be a television writer and received strong family support for her writing from her single mother and grandmother.[11] Her parents had divorced when she was three.[12] Waithe and her sister grew up on the South Side of Chicago until Waithe was 12; she attended a local, mostly African-American elementary magnet school, Turner-Drew,[13] but moved to Evanston and finished middle school at Chute Middle School.[14] She graduated from Evanston Township High School and earned a degree in cinema and television arts[15] from Columbia College Chicago in 2006,[16][10][17] praising faculty playwright Michael Fry for his teaching and encouragement.[17][18] Seeking more ways to involve herself in the television and film industry, she also worked at a movie theater, at a Best Buy, and at a Blockbuster.[19]\n\nCareer [ edit ]\n\nHaving arrived in Los Angeles, Waithe secured a job as an assistant to the executive producer of Girlfriends, a long-running sitcom.[19] Soon after, she landed a minor role in Lisa Kudrow's The Comeback.[19] She later became a writer for the Fox television series Bones,[9] a writer for the 2012 Nickelodeon sitcom How to Rock, and a producer on the 2014 satirical comedy film Dear White People.[20] Waithe wrote and appeared in the YouTube series \"Twenties\", produced by Flavor Unit Entertainment and optioned in 2014 by BET.[21][22] In addition to writing and directing the short film \"Save Me\", which was shown at several independent film festivals,[23] Waithe wrote the 2013 web series \"Hello Cupid\" and the 2011 viral video Shit Black Girls Say.[20]\n\nIn 2014, Variety named Waithe one of its \"10 Comedians to Watch\".[21] In August 2015, Showtime commissioned a pilot for an upcoming series, The Chi, written by Waithe and produced by Common, which tells a young urban Black-American man's coming-of-age story.[24] As the show's creator, Waithe wanted to mine her experience growing up on the South Side and experiencing its diversity to craft a story that paints a more nuanced portrait of her hometown than is typically shown.[25] Similarly, she extended her influence to support the Black-American community in the entertainment industry through her role as co-chair of the Committee of Black Writers at the Writers Guild.[14]\n\nIn 2015 Waithe was cast in the Netflix series Master of None after meeting creator and lead actor Aziz Ansari who, with Alan Yang, had originally written Denise as a straight, white woman with the potential, according to Waithe, to evolve into one of the main character's love interests: \"For some reason, [casting director] Allison Jones thought about me for it, a Black gay woman.\"[11] Ansari and Yang rewrote the script to make the character more like Waithe: \"All of us actors play heightened versions of ourselves.\"[11] She said, \"I don't know if we've seen a sly, harem pants-wearing, cool Topshop sweatshirt-wearing, snapback hat-rocking lesbian on TV.\"[9] She also said, \"I know how many women I see out in the world who are very much like myself. We exist. To me, the visibility of it was what was going to be so important and so exciting.\"[9]\n\nIn 2017, Waithe and Ansari won the Primetime Emmy Award for Outstanding Writing for a Comedy Series for the season 2 episode \"Thanksgiving\".[26] She became the first African-American woman to win an Emmy in that category.[26][27][28] Waithe described the episode as based on her coming out experience as a lesbian.[29] During her Emmy speech, she sent a special message to her LGBTQIA (Lesbian, Gay, Bisexual, Transgender, Queer, Intersex, and Asexual)[30] family discussing how \"The things that make us different—those are our superpowers.\"[31] She ended her speech by recognizing her journey as a Black woman, saying, \"Thank you for embracing a little Indian boy from South Carolina and a little queer Black girl from the South Side of Chicago.\"[32] Waithe also developed an autobiographical drama series, The Chi.[33][34] Out Magazine named Waithe the Out100: Artist of the Year on November 8, 2017.[35]\n\nSince 2018, Waithe has been the voiceover of the tagline of AT&T commercials.[36]\n\nWaithe wrote and produced the road trip-crime film Queen & Slim, starring Jodie Turner-Smith and Daniel Kaluuya, and directed by Melina Matsoukas. It was released on November 27, 2019, by Universal Pictures.[37]\n\nIn 2020, Waithe lent her voice to the Pixar animated film Onward, portraying the cyclops police officer Specter, the first queer animated character in Disney history.[38]\n\nShe focuses on recruiting more people of color and queer artists for her film and television projects.[39] In 2020 her production company, Hillman Grad Productions, opened a mentoring and training program[40] with financial support from the Froneri ice-cream company.[41] More recently, she inked a deal with the Warner Bros. TV Group in order to develop a TV version of Hoop Dreams.[42]\n\nPersonal life [ edit ]\n\nWaithe is a masculine-presenting lesbian.[43][44][45] She became engaged in 2017 to Alana Mayo,[46][47] a content executive. They married in 2019 in San Francisco.[48] On January 23, 2020, Waithe and Mayo announced that they had separated after two months of marriage.[49] In November 2020, Mayo filed for divorce from Waithe; the single status of both was restored on May 24, 2021, with agreement for spousal support, and dividing up of property and other assets.[50] Waithe is currently dating Emmy, Grammy and Tony-winning actress/singer Cynthia Erivo. [51][52]\n\nWaithe has described her family as \"lazy Christians\" and said in 2018, \"I'm a huge believer in God, and Jesus Christ, and that God made me and all those things. And I try to just be a good person. I think that is the base of my religion, is to be good, is to be honest.\"[53]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nActress [ edit ]\n\nWriter [ edit ]\n\nYear Title Role Notes 2012 M.O Diaries Writer TV series 2012 How to Rock Writer 2 episodes 2013 Hello Cupid Writer 7 episodes 2014–2015 Bones Staff writer 15 episodes 2015, 2017,\n\n2021 Master of None Writer 6 episodes 2018–present The Chi Creator; Writer 6 episodes 2019–2020 Boomerang Creator; Writer; Executive producer 4 episodes 2020 Twenties Creator; Executive producer 8 episode\n\nProducer [ edit ]\n\nYear Title Role Notes 2021 Them Executive producer TV series\n\nAwards and nominations [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Lena_Waithe_by_Gage_Skidmore.jpg/1200px-Lena_Waithe_by_Gage_Skidmore.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Lena_Waithe_by_Gage_Skidmore.jpg/220px-Lena_Waithe_by_Gage_Skidmore.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Lena_Waithe_by_Gage_Skidmore.jpg/1200px-Lena_Waithe_by_Gage_Skidmore.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Lena_Waithe", "title": "Lena Waithe", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Lena_Waithe_by_Gage_Skidmore.jpg/640px-Lena_Waithe_by_Gage_Skidmore.jpg", "width": 640, "height": 881}, "title": "Lena Waithe - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}