{"url": "https://www.vanityfair.com/hollywood/2018/07/bachelorette-final-two-garrett-blake-jason-next-bachelor", "text": "The Bachelor franchise is a fascinating study in how reality shows build characters. They’re shaped, of course, by the footage editors choose to air—though it always helps when Bachelors, Bachelorettes, and their would-be suitors come in with personalities of their own, ready to be enhanced and exaggerated into TV gold. Last year, Rachel Lindsay proved she’s a smart, no-nonsense lawyer with an occasionally risqué sense of humor. Before her, there was Joelle “JoJo” Fletcher, a bubbly Texan who felt like an amalgamation of every Southern Girl trope—a somewhat obvious identity, but a clear one.\n\nThis year’s Bachelorette, though, is tougher to pin down. What is Rebecca “Becca” Kufrin’s “thing”—and does The Bachelorette even care if she has one?\n\nThroughout this season, as we’ve gotten to know Becca’s contestants, it’s become increasingly clear that we also don’t know much about the woman whose heart they’re competing to win. Nothing about Becca feels particularly specific, beyond the information one could find on a title card. She’s from Minnesota. She works in P.R. What else? You’d be hard pressed to think of much.\n\nInstead, Becca continues to be defined by the incident that landed her the Bachelorette gig in the first place: her horrific breakup with Arie Luyendyk Jr. on the last season of The Bachelor. Which is frustrating. A breakup can make for a good beginning, but the rest of the story has to go somewhere. And rather than build Becca up as a character and give her a redemptive romantic romp, this season has appeared more than happy to let her simply exist as a passive participant in her own story.\n\nMost of this season’s most intense drama has occurred offscreen, as when viewers found out that front-runner Garrett Yrigoyen has an appalling social-media history, and eliminated contestant Lincoln Adim had been convicted of assault and battery. Within the confines of the series itself, however, the proceedings have been pretty rote: there was the requisite feud between two equally annoying contestants, the jealous meltdown, and the cool guy eliminated too soon. Arie’s season of The Bachelor was widely called out for being boring, and now, Becca’s, which sprang from that dull well, appears to have committed the same sin. That reality grew even more stark as the show betrayed its apparent true goal this week: making sure there is at least one potential Bachelor on lock for next year, even if the producers have to manufacture him out of thin air. They’ll do anything to avoid having a Bachelor as uninspiring as Arie again.\n\nThe front-runner for that position is Jason Tartick, who was, unsurprisingly, sent home this week. While Jason might not have the charisma to carry a season of The Bachelor on his own, producers appeared to be setting him up to assume the mantle, should he need to.\n\nTwice during the episode, Becca found herself agonizing over the fact that she simply could not see a future with Jason. She left not one, but two conversations with Jason to pace, fidget with her hair, and release existential grumbles—then finally let her doomed man go. And once he left, she kept flagellating herself for her decision, saying that she had blindsided Jason just like Arie blindsided her—a comparison no sane person would make, but one the show allowed to hang in the air, almost as though it were actually true. The reason? That’s exactly the kind of narrative that sets Jason up for eventual Bachelor-dom, as was the moment when Jason, who handled his breakup with relative aplomb, showed up at Becca’s suite to give them both closure—and leave Becca a scrapbook of relationship memories. The general message was hard to miss: “Jason is an amazing guy! What a sweetheart! So heartbroken! Looks kind of like Milo Ventimiglia in This Is Us! Maybe he’d be a good Bachelor? Please don’t make us reach back six years to find a Bachelor again; there’s just no one good left back there!”\n\nI don’t doubt that Becca’s interactions with Jason were genuine—including her sobbing over his departure. But the way the ordeal was framed felt like some unmistakable pre-emptive branding. And while that might serve The Bachelor well in the future, it made for pretty stiff and contrived TV drama for Becca in the present.\n\nTo an extent, Bachelors and Bachelorettes are always rendered as empty vessels—and perhaps that’s the problem. Too often, this show feels more like a series of conventions, aesthetic gestures, and re-used beats than an actual story. In this context, “characters,” to whatever extent they develop, feel incidental. At its core, the Bachelor-verse is simply a self-sustaining empire of sponsored Instagram posts and free-for-exposure hotel stays, dressed up in sequin gowns and drowned in rose petals. Hell, even the Becca season’s exotic trip location, Thailand, was recycled from just two seasons ago—down to her date with jealous human soap bar Blake Horstmann, which mimicked JoJo’s with Jordan Rodgers. Where’s the sense of adventure and spontaneity that defines most people’s dream love stories—precisely what these programs purport to mimic?\n\nThis franchise has been chugging along for nearly two decades, and, at this point, longtime fans know its machinations by heart. Perhaps, instead of trying to make the current machine run smoother, it’s time the Bachelor franchise rethink itself down to the nuts and bolts, and consider building something new. Because given the way ratings are trending, fans will only tolerate so many more seasons of swiftly abandoned catchphrases, contrived feuds, and central Bachelor/ettes whom editors only barely seem to understand—or care about—as characters.", "images": ["https://media.vanityfair.com/photos/5b4e2c719bedd20c4002b7a8/1:1/w_350%2Ch_350%2Cc_limit/t-Bachelorette-Dudes.jpg", "https://media.vanityfair.com/photos/5b57233211d0902df883bd10/master/w_2560%2Cc_limit/bachelorette-final-two-garrett-blake.jpg", "https://media.vanityfair.com/photos/623a28a1e700ab34afc82b7f/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/62100dc174854b6731411914/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/6271402aaa13b250dff10aaf/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/620ad531f518ba2b0f8f82d6/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/633d9bec72fe11ef3849c3ef/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/5b6b19ad09c6963c8df70b3d/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/5b08638114785d74984019f8/1:1/w_350%2Ch_350%2Cc_limit/Bachelorette-Becca-Kufrin.jpg", "https://media.vanityfair.com/photos/61e04d9124422a04bca76b25/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/63370d0bb02ed9e1f657fa60/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/5b0d58d814785d7498401a02/1:1/w_350%2Ch_350%2Cc_limit/bachelorette-garrett.jpg", "https://www.vanityfair.com/verso/static/hwd/assets/logo-reverse.6ef96ab8686439a35176e2ff8b2c4487e92fbaae.svg", "https://media.vanityfair.com/photos/5b57233211d0902df883bd10/16:9/w_1280,c_limit/bachelorette-final-two-garrett-blake.jpg", "https://www.vanityfair.com/verso/static/hwd/assets/logo-header.ea437ae89b8c3c7aabbb46bb45a04f1a514e5803.svg", "https://media.vanityfair.com/photos/61b2425df0e6a03c67f75c1d/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/633dac5a42c2d8adf3fa7d9c/1:1/w_350%2Ch_350%2Cc_limit/undefined"], "top_img": "https://media.vanityfair.com/photos/5b57233211d0902df883bd10/16:9/w_1280,c_limit/bachelorette-final-two-garrett-blake.jpg", "keywords": [], "authors": ["Condé Nast", "Laura Bradley"], "canonical_link": "https://www.vanityfair.com/hollywood/2018/07/bachelorette-final-two-garrett-blake-jason-next-bachelor", "title": "How The Bachelorette Failed Becca Kufrin", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "width=device-width, initial-scale=1", "referrer": "no-referrer-when-downgrade", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2022", "description": "This season was supposed to be Becca’s chance for redemption. But as the finale looms, it’s becoming clear that the Bachelor franchise is really invested in only one thing: itself.", "id": "5b568f8fee12ac273fba2949", "robots": "index, follow, max-image-preview:large", "content-type": "article", "parsely-post-id": "5b568f8fee12ac273fba2949", "parsely-metadata": "{\"description\":\"This season was supposed to be Becca’s chance for redemption. But as the finale looms, it’s becoming clear that the Bachelor franchise is really invested in only one thing: itself.\",\"image-16-9\":\"https://media.vanityfair.com/photos/5b57233211d0902df883bd10/16:9/w_1000,c_limit/bachelorette-final-two-garrett-blake.jpg\",\"image-1-1\":\"https://media.vanityfair.com/photos/5b57233211d0902df883bd10/1:1/w_1000,c_limit/bachelorette-final-two-garrett-blake.jpg\"}", "og": {"description": "This season was supposed to be Becca’s chance for redemption. But as the finale looms, it’s becoming clear that the Bachelor franchise is really invested in only one thing: itself.", "image": "https://media.vanityfair.com/photos/5b57233211d0902df883bd10/16:9/w_1280,c_limit/bachelorette-final-two-garrett-blake.jpg", "site_name": "Vanity Fair", "title": "How The Bachelorette Failed Becca Kufrin", "type": "article", "url": "https://www.vanityfair.com/hollywood/2018/07/bachelorette-final-two-garrett-blake-jason-next-bachelor"}, "article": {"content_tier": "metered", "opinion": "false", "section": "tags", "published_time": "2018-07-24T13:03:45.242Z", "modified_time": "2018-07-24T13:03:45.242Z", "author": "Laura Bradley"}, "twitter": {"card": "summary_large_image", "creator": "@VanityFair", "description": "This season was supposed to be Becca’s chance for redemption. But as the finale looms, it’s becoming clear that the Bachelor franchise is really invested in only one thing: itself.", "domain": "https://www.vanityfair.com", "image": "https://media.vanityfair.com/photos/5b57233211d0902df883bd10/16:9/w_1280,c_limit/bachelorette-final-two-garrett-blake.jpg?mbid=social_retweet", "site": "@VanityFair", "title": "How The Bachelorette Failed Becca Kufrin"}, "fb": {"app_id": 256281040558, "pages": 8810407571}, "google-signin-client_id": "1065629119444-svrqo31taikd2j0ji4dgjs9q3vul4133.apps.googleusercontent.com"}, "movies": [], "publish_date": 1532437425.242, "source": "https://www.vanityfair.com", "summary": ""}