{"url": "https://www.usatoday.com/story/life/people/2017/10/06/comedian-ralphie-may-dies-a-45-t/741156001/", "text": "Ralphie May dies at 45; stand-up comedy world mourns\n\nShow Caption Hide Caption Comedian Ralphie May, star of ‘Last Comic Standing,’ has died at 45 Ralphie May, a comedian who broke onto the national scene after an attention grabbing series of appearances during NBC’s Last Comic Standing, has died at the age of 45. USA TODAY\n\nComedian Ralphie May has died at 45, his representative, Stacey Pokluda, confirmed to USA TODAY.\n\nHis body was found Friday morning at a private residence in Las Vegas, where he had a residency at Harrah's Las Vegas Hotel and Casino.\n\nPokluda said May had performed there Thursday night after having had to cancel several dates to recover from pneumonia, which had plagued him for weeks.\n\nShe noted his cause of death was cardiac arrest. That occurs when an electrical problem causes the heart to stop pumping completely. When that happens, oxygenated blood fails to reach the brain, lungs and other organs. (In the last two weeks, rock icon Tom Petty and Playboy founder Hugh Hefner both died as a result of cardiac arrest.)\n\nMore: Cardiac arrest vs. heart attacks\n\nMay, who was born in Tennessee and raised in Arkansas, grew up idolizing 1980s comedy star Sam Kinison.\n\nHe mined his obesity for laughs as part of his standup routine. He eventually parlayed a second-place finish in Season 1 of NBC's Last Comic Standing into multiple stand-up specials for Comedy Central and Netflix.\n\nPokluda noted in her statement that May had just won the Casino Comedian of the Year award at the Global Gaming Expo. His residency at Harrah's Las Vegas was supposed to last through the end of the year.\n\nHis manager, Judi Marmel, told USA TODAY he was also working on a new comedy special and had completed his autobiography, This Might Get a Little Heavy, for St. Martin's Press. It's due this spring.\n\nIn a statement, she wrote: \"As his manager and his friend, I will miss his laugh, his generosity to fellow comedians, his trademark orneriness, and his enormous love of life. He left us entirely too soon — and we can only wonder where his comedy might have taken all of us. We send our love to his family, his fans, and all the comics who shared stages with him across the country.\"\n\nMay is survived by his wife Lahna Turner and two children, daughter April June May and son August James May.\n\nFellow comedians ranging from Kevin Hart to Larry the Cable Guy remembered him on Twitter after hearing the news.\n\n.@Ralphie_May helped get me in @TheLaughFactory. He didn’t know me at all and after he saw my set he told Jamie Masada to have me onboard. — Ken Jeong (@kenjeong) October 6, 2017\n\nWow....I was just told that Ralphie May passed. I'm truly saddened by this. He was a good dude. Heaven just got another funny angel RIP man — Kevin Hart (@KevinHart4real) October 6, 2017\n\nOh man fellow comedian and friend Ralphie May just died. So crazy. RIP Ralphie. You my friend were one of the nicest and kindest out there. — Larry The Cable Guy (@GitRDoneLarry) October 6, 2017\n\nDamn. RIP Ralphie May. Comic warrior. — marc maron (@marcmaron) October 6, 2017\n\nThis one hurts... Ralphie May was one of the good guys in this business full of phonies... He… https://t.co/eUcUXT5uEv — Russell Peters (@therealrussellp) October 6, 2017\n\nSo sad to hear about Ralphie. Sweet guy. He loved doing stand up and loved comedians. #RIPRalphieMay — Jim Gaffigan (@JimGaffigan) October 6, 2017", "images": ["https://www.gannett-cdn.com/-mm-/ca5f5fc8e80f7705c19c572f53888cbff4c44107/c=0-164-3000-1859/local/-/media/2017/10/06/USATODAY/USATODAY/636429098555406398-D03-Last-Comic-18.jpg?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://media.gannett-cdn.com/29906170001/29906170001_5600480171001_5600460692001-vs.jpg?pubId=29906170001"], "top_img": "https://www.gannett-cdn.com/-mm-/ca5f5fc8e80f7705c19c572f53888cbff4c44107/c=0-164-3000-1859/local/-/media/2017/10/06/USATODAY/USATODAY/636429098555406398-D03-Last-Comic-18.jpg?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Jayme Deerwester"], "canonical_link": "https://www.usatoday.com/story/life/people/2017/10/06/comedian-ralphie-may-dies-a-45-t/741156001/", "title": "Ralphie May dies at 45; stand-up comedy world mourns", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/people/2017/10/06/comedian-ralphie-may-dies-a-45-t/741156001/life/people", "theme-color": "#ffffff", "og": {"type": "article", "title": "Ralphie May dies at 45; stand-up comedy world mourns", "description": "A Season 1 contestant on the reality show 'Last Man Standing,' the comedian went on to do standup specials for Comedy Central and Netflix.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/ca5f5fc8e80f7705c19c572f53888cbff4c44107/c=0-164-3000-1859/local/-/media/2017/10/06/USATODAY/USATODAY/636429098555406398-D03-Last-Comic-18.jpg?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "A Season 1 contestant on the reality show 'Last Man Standing,' the comedian went on to do standup specials for Comedy Central and Netflix.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1507244400.0, "source": "https://www.usatoday.com", "summary": ""}