{"url": "https://www.usmagazine.com/entertainment/news/teen-mom-2-recap-briana-and-javi-are-dating/", "text": "Together at last! Javi Marroquin and Briana DeJesus made things official during Monday, June 4, episode of Teen Mom 2. Even though they tried to act like one big happy family with their children, their relationship with Kailyn Lowry couldn’t be worse. Also, Chelsea Houska faced Adam Lind in court and can finally sleep soundly again. Find out what you might have missed during this week’s episode of Teen Mom 2.\n\nChelsea Finally Feels Her Daughter is Safe\n\nIt was finally time for Chelsea to face her ex in court to try to hyphenate her daughter’s last name to match her and her husband Cole Deboer’s name. She also wanted to get her visitation agreement changed so that Adam could only see Aubree in a visitation center. She couldn’t be more nervous to faceher ex, who she hadn’t seen in about a year.\n\n“I hate that I doubt myself,” Chelsea said and continued to worry about her intentions. “Am I being ridiculous? Can you be too ridiculous when it comes to your child?”\n\nIn the end, everything went Chelsea’s way, and she cried on the car ride home because she finally felt like Aubree was in a safe situation.\n\n“I just feel like a weight is lifted off my shoulders,” Chelsea said. They celebrated by telling Aubree about the name change by writing it on a cake, and Aubree was over-the-moon.\n\nBriana and Javi are Official\n\nAfter weeks of beating around the bush, Briana finally admitted that she and Javi were “boyfriend and girlfriend.” She went to Delaware to celebrate Lincoln’s birthday with the kids. She even made Javi and their children matching shirts for the party.\n\n“I’m looking forward to today,” Javi said, and the two were acting like they were married already even though they just made it official. Javi was stressed about the Kailyn situation, but was mushy about having Briana to help him through it. “It’s nice having you by my side,” he told her.\n\nEven though last week’s episode made it seem like Kailyn was in a relationship with her friend Dom, she shut rumors down this week by declaring she was too busy dealing with other people to be in a relationship. Although she was mostly referring to her children, the Briana/Javi drama might also have had something to do with it.\n\nWhen Javi decided Briana was going to go to Lincoln’s party that he was supposed to cohost with Kailyn, Kailyn dropped out and had her own party. Briana exchanged some vicious texts with Javi’s ex, and it caught Kailyn off guard.\n\n“Shut the f—k up cause now I’m mad. S—k my d—k, you dumb bitch,” Briana texted Kailyn when Kailyn said she didn’t want to meet up with her to talk thing about.\n\nAfter that explosion, Kailyn prohibited the crew from filming any part of the party because Briana was there. “I don’t think that she’s a good person,” Kailyn said. “I don’t want anything to do with him.”\n\nNathan Might Still Be In Love With Jenelle\n\nJenelle Evans embarked on a new business venture and transformed her personal Facebook into a more professional page. However, the change made rumors swirl that she and David Eason were breaking up because her page no longer mentioned they were together. Her ex Nathan Griffith didn’t waste any time to text Jenelle to find out what was going on and tell her he wants the best for her.\n\n“You don’t know s—t about Kaiser. You don’t ask about Kaiser. But you ask if I’m broken up with David,” Jenelle told her friend about the text, who proclaimed that Nathan was just trying to weasel his way back into her life. To no one’s surprise, David lost it when he found out about the text. He got into a fight with Nathan over it and called him some extremely derogatory words. When Jenelle was suppose to drop off Kaiser to Nathan after, she sent David’s mother to avoid drama.\n\nHowever, Nathan was so made about the texts, he went after David’s mom. He also seemed a little upset that the two were still together. “They need to get off the drugs,” Nathan said. “I won’t do this no more.”\n\nLeah Opens Up To Her Daughter\n\nLeah Messer took her daughter Aleeah Grace to a therapist this episode to work out some behavioral issues she was dealing with. Aleeah was acting out, and Leah and her ex Corey Simms thought it had something to do with her twin getting more attention than her. The appointment went well, but Leah had to talk about her daughter’s problems in front of her, which made it awkward.\n\n“It was hard to talk about why you’re not always the nicest to Ali,” Leah told Aleeah afterward. “Even when you have a bad day, I still love you.”\n\nTeen Mom 2 airs on MTV Mondays at 9 p.m. ET.", "images": ["https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/bg-subscribe.png", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered-green.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/placeholders/default-usweekly.svg", "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/2018/06/teenmom3.jpg?crop=293px%2C10px%2C1107px%2C580px&resize=1200%2C630&ssl=1&quality=86&strip=all", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/shop-with-us-new.png", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/placeholders/default-usweekly-square.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered.svg"], "top_img": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/2018/06/teenmom3.jpg?crop=293px%2C10px%2C1107px%2C580px&resize=1200%2C630&ssl=1&quality=86&strip=all", "keywords": [], "authors": ["Christina Creutz", "Alex Darus"], "canonical_link": "https://www.usmagazine.com/entertainment/news/teen-mom-2-recap-briana-and-javi-are-dating/", "title": "‘Teen Mom 2’ Recap: Briana and Javi Are Dating!", "meta_data": {"viewport": "width=device-width, initial-scale=1", "ir-site-verification-token": "-206090124", "fo-verify": "49e6fc6a-c68d-447f-9978-70e3eac455ac", "post-format": "video", "post-cats": "Entertainment", "theme-color": "#fff", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Briana DeJesus and Javi Marroquin finally admitted they are a couple during the Monday, June 4 episode of ‘Teen Mom 2’ — read Us Weekly's recap", "og": {"locale": "en_US", "type": "article", "title": "‘Teen Mom 2’ Recap: Briana and Javi Finally Admit They’re Dating", "description": "Briana DeJesus and Javi Marroquin finally admitted they are a couple during the Monday, June 4 episode of ‘Teen Mom 2’ — read Us Weekly's recap", "url": "https://www.usmagazine.com/entertainment/news/teen-mom-2-recap-briana-and-javi-are-dating/", "site_name": "Us Weekly", "updated_time": "2018-06-05T13:03:52+00:00", "image": {"identifier": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/2018/06/teenmom3.jpg?crop=293px%2C10px%2C1107px%2C580px&resize=1200%2C630&ssl=1&quality=86&strip=all", "secure_url": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/2018/06/teenmom3.jpg?crop=293px%2C10px%2C1107px%2C580px&resize=1200%2C630&ssl=1&quality=86&strip=all", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/UsWeekly", "published_time": "2018-06-05T03:22:16+00:00", "modified_time": "2018-06-05T13:03:52+00:00"}, "author": "Christina Creutz", "twitter": {"card": "summary_large_image", "title": "‘Teen Mom 2’ Recap: Briana and Javi Finally Admit They’re Dating", "description": "Briana DeJesus and Javi Marroquin finally admitted they are a couple during the Monday, June 4 episode of ‘Teen Mom 2’ — read Us Weekly's recap", "image": "https://i0.wp.com/www.usmagazine.com/wp-content/uploads/2018/06/teenmom3.jpg?crop=293px%2C10px%2C1107px%2C580px&resize=1200%2C630&ssl=1&quality=86&strip=all", "creator": "@usweekly", "site": "@usweekly"}, "spons": "no", "tragedy": "off", "generator": "WordPress 6.0.2", "msapplication-TileImage": "https://www.usmagazine.com/wp-content/uploads/2020/05/cropped-us-logo.png?w=270&quality=86&strip=all"}, "movies": [], "publish_date": 1528168936.0, "source": "https://www.usmagazine.com", "summary": ""}