{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/03/15/american-idol-contestant-was-uncomfortable-but-says-katy-perrys-kiss-wasnt-harassment/", "text": "Gift Article Share\n\nAn “American Idol” contestant has tried to tamp down the controversy over judge Katy Perry unexpectedly kissing him on the lips during his audition. “I do not think I was sexually harassed by Katy Perry and I am thankful for the judges comments and critiques,” said Benjamin Glaze, who revealed during the two-night premiere of the ABC reboot that he had previously never kissed a girl. “I was uncomfortable in a sense of how I have never been kissed before and was not expecting it.”\n\nGlaze, who wrote the statement on Instagram on Wednesday night, added: “My main goal is to reach people through the universal love of music and not cause strife or anger against anyone or about any situation.”\n\n“American Idol” had heavily promoted the kiss moment. Before his Instagram post, Glaze told the New York Times in an interview published earlier Wednesday that he was “a tad bit uncomfortable.” The newspaper reported that he had put off his first kiss and “wanted to save it for my first relationship. I wanted it to be special.”\n\nAdvertisement\n\n“Would I have done it if she said, ‘Would you kiss me?’ No, I would have said no,” he told the Times. “I know a lot of guys would be like, ‘Heck yeah!’ But for me, I was raised in a conservative family and I was uncomfortable immediately. I wanted my first kiss to be special.”\n\nThe Times also reported that he didn’t feel he had been harassed by Perry and was grateful she tweeted about him. Since the October audition, Glaze said he has talked it over with friends, and they agreed with him the kiss “didn’t really count. It was lip contact versus a romantic situation with someone you care about. That’s what a real first kiss is.”\n\nStill, the interview and subsequent attention on the audition sparked criticism of Perry, including calling it a “#HimToo” moment and arguing that the exchange would have been considered assault had an older male judge kissed an unsuspecting 19-year-old girl.\n\nSo Katy Perry basically sexually assaulted someone on American Idol. If the genders were reversed, not only would there have been a firing, but perhaps an arrest as well. Just think of a female contestant saying this about a celebrity judge kissing her: pic.twitter.com/g4uCtrn3Vh — Noam Blum (@neontaster) March 14, 2018\n\nOn Wednesday, Glaze’s Instagram post conveyed that he wanted “to clear a few things up for anyone who is confused, concerned, or angry” after his news interviews and that he didn’t think his views had been “appropriately communicated through the media.”\n\nAdvertisement\n\n“The way certain articles are worded is not done by me, and my true intentions are not accurately represented in every article you read about the situation,” he wrote. “I am not complaining about the kiss, I am very honored and thankful to have been apart of ‘American Idol.’ The main purpose for the show is to find stars and new music artist. I do wish I would have performed better in the moment. I should have picked another song to sing and calmed myself down regardless of the kiss. I should have been able to perform under pressure.”\n\nGlaze, who at the time of his audition was a 19-year-old cashier from Enid, Okla., walked in and told the judges he liked his job because he could meet cute girls. Judge Luke Bryan, quoting a Perry song, asked Glaze, “Have you kissed a girl and liked it?”\n\n“No, I’ve never been in a relationship,” the contestant responded.\n\nAdvertisement\n\nPerry asked, “Really?”\n\n“I can’t kiss a girl without being in a relationship,” Glaze said.\n\nPerry then ordered him over, and offered him her cheek as the Bryan and judge Lionel Richie egged them on. “He didn’t even make a smush sound!” Perry said, and they repeated it again.\n\nBut as he went in for another kiss on the cheek, Perry quickly moved her lips over to meet his. He fell to the ground with a nervous grin and a shocked expression, as Perry and the judges celebrated.\n\n“Katy!” he yelled. “Well, that’s a first.”\n\nHe clearly seemed nervous after the exchange and asked for water before he sang. He then gave what the judges deemed a hurried and lackluster performance. Perry said, “I really enjoyed meeting you,” but “there are some people who are just out-singing you right now, so I don’t think it’d be fair to put you in that kind of competition.”\n\nShe added: “Next time, just take a little bit more time. You were a bit rushed.”\n\nRead more:\n\nGiftOutline Gift Article", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=http://www.washingtonpost.com/blogs/style-blog/files/2018/03/147955_0368.jpg&w=1440"], "top_img": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://www.washingtonpost.com/blogs/style-blog/files/2018/03/147955_0368.jpg&w=1440", "keywords": [], "authors": ["Elahe Izadi"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/03/15/american-idol-contestant-was-uncomfortable-but-says-katy-perrys-kiss-wasnt-harassment/", "title": "‘American Idol’ contestant was ‘uncomfortable,’ but says Katy Perry’s kiss wasn’t harassment", "meta_data": {"description": "Benjamin Glaze had never kissed a girl before Katy Perry tricked him during the ABC reboot of “American Idol.”", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/03/15/american-idol-contestant-was-uncomfortable-but-says-katy-perrys-kiss-wasnt-harassment/", "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://www.washingtonpost.com/blogs/style-blog/files/2018/03/147955_0368.jpg&w=1440", "title": "‘American Idol’ contestant was ‘uncomfortable,’ but says Katy Perry’s kiss wasn’t harassment", "description": "Benjamin Glaze had never kissed a girl before Katy Perry tricked him during the ABC reboot of “American Idol.”"}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "‘American Idol’ contestant was ‘uncomfortable,’ but says Katy Perry’s kiss wasn’t harassment", "description": "Benjamin Glaze had never kissed a girl before Katy Perry tricked him during the ABC reboot of “American Idol.”"}, "last_updated_date": "2021-12-03T04:28:59.645Z", "article": {"published_time": "2018-03-15T15:22:40.000Z", "modified_time": "2021-12-03T04:28:59.645Z", "section": "Arts & Entertainment", "content_tier": "metered"}, "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1", "next-head-count": 71, "apple-itunes-app": "app-id=352509417, app-argument=https://www.washingtonpost.com/news/arts-and-entertainment/wp/2018/03/15/american-idol-contestant-was-uncomfortable-but-says-katy-perrys-kiss-wasnt-harassment/"}, "movies": [], "publish_date": 1521072000.0, "source": "https://www.washingtonpost.com", "summary": ""}