{"url": "www.cnn.com/2018/07/31/politics/donald-trump-rudy-giuliani/index.html", "text": "CNN —\n\nThe biggest misconception surrounding the special counsel probe into Russian interference in the 2016 election is that it will likely end in some sort of legal proceeding involving President Donald Trump. It won’t – for a bunch of reasons, the most important of which is that Robert Mueller, who is running the investigation, doesn’t seem to believe a sitting President can be indicted.\n\nThe much more likely outcome is that Mueller releases the findings from his investigation sometime this fall — and lets the chips, as they relate to Trump, fall where they may. Which means — and this is what Trump and his personal lawyer Rudy Giuliani have understood for months — that, ultimately, this isn’t a legal fight, it’s a public relations one.\n\nGiuliani tipped his hand on that strategy Monday in an interview with CNN’s Alisyn Camerota. “I’ll be here with my version of the report and they’ll have their version of the report and the American people, in that sense, are going to decide it,” Giuliani said of the Mueller investigation.\n\n“My version” vs. “their version.” What that construct from Giuliani misses, of course, is that one of the “versions” will be the result of a Justice Department-commissioned investigation led by the former head of the FBI that has already spanned more than a year. The other “version” will be Giuliani’s cable TV appearances and President Trump’s tweets.\n\nThat is, on its face, an apples-and-oranges comparison. But remember what Giuliani and Trump know: The debate over whether and how much Trump did wrong (if anything) is almost certain to be decided in the court of public opinion, not an actual court. And in the court of public opinion – particularly given the fealty that rank-and-file Republicans have shown (and continue to show) to Trump, the comparison is far more favorable to Trump’s side.\n\nQuick, do this thought experiment: Name the first 10 words that come to mind when someone says “Mueller probe.” If you are being honest with yourself, my guess is that the words “no collusion,” “witch hunt” and maybe even “13 Angry Democrats” made it into that top 10. What that means is that even if you roll your eyes when you hear “no collusion,” it seeps into your consciousness — and that’s a win for Trump.\n\nEspecially when you consider that lots and lots of people aren’t rolling their eyes when Trump unleashes a tweet blasting the allegedly partisan bias of Mueller’s team or how the whole probe is based on false pretenses. In a CBS News poll released earlier this week, 70% of Republicans described the Mueller probe as a “witch hunt.” That same poll showed that more than nine in 10 “strong Trump supporters” trust Trump for “accurate information” as compared to 63% who trust “family and friends” and 11% who trust the “mainstream media.”\n\nNeed more? In March, roughly three in 10 Republicans approved of Robert Mueller in CNN polling. By May, that number was down to 17% approval. That data is backed up by other polls. Last July, a Politico/Morning Consult survey showed that 27% of Republicans had an unfavorable view of Mueller. By this June, that number was 53%.\n\nThose numbers speak to the effectiveness of the PR campaign against Mueller (and his team) by Giuliani and Trump. It also speaks to the fact that this is largely a one-sided conversation. Mueller himself never speaks in public. The special counsel’s office has released only a handful of statements since it was created. Mueller is, rightly, focused on running an effective and thorough investigation. But that leaves him and his team uniquely vulnerable to the campaign-style attacks by Trump and Giuliani. An attack unresponded to, in the context of politics, is an attack believed by some chunk of the voting public. Again, that isn’t Mueller’s concern. He is focused on drawing fact-based conclusions and releasing them in a report. He’s not planning to run for anything.\n\nTrump, on the other hand, is running for a second term. And the President has shown time and time again he is willing to say and do whatever it takes to win an argument in the court of public opinion. Which is what he has set about doing over the past six months or so.\n\nMock all the “no collusion” and “collusion isn’t even a crime” comments if you want. But remember that a big chunk of people already believe — before Mueller has released a single final finding — that his whole probe is a partisan witch hunt that should never have been started in the first place. Short of Mueller producing an email from Trump saying “Yes, let’s collude with Russia ASAP!” those people will not change their view — either on Mueller or Trump. (In truth, even if Mueller did produce an email from Trump that clearly showed collusion with the Russians, I’m not sure that would change the base’s view.)\n\nThat’s the secret Trump and Giuliani know – and have been executing against for months. And like it or not, it’s working.", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/180713124904-dana-bash-reax.jpg?q=x_2,y_0,h_1078,w_1915,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180628175842-trey-gowdy.jpg?q=x_2,y_0,h_1078,w_1915,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180730085905-rudy-giuliani-alisyn-camerota.jpg?q=x_208,y_42,h_884,w_1572,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/170515131851-the-point-with-chris-cillizza-logo-large-169.png?q=h_60,w_264,x_0,y_0/w_1280", "https://media.cnn.com/api/v1/images/stellar/prod/180730080926-rudy-giuliani-newday-1.jpg?q=x_109,y_18,h_973,w_1729,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180411072715-01-trump-putin-file.jpg?q=x_3,y_0,h_1684,w_2993,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/170423134003-donald-trump-rudy-giuliani.jpg?q=x_1582,y_376,h_893,w_1588,c_crop/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/180917180812-donald-trump-declassify-documents-russia-perez-tsr-vpx-00001628.jpg?q=x_2,y_0,h_1078,w_1915,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180123174541-02-trump-mueller-split.jpg?q=x_8,y_0,h_1106,w_1965,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180712205102-rep-david-cicilline-07-12-2018.jpg?q=x_164,y_47,h_893,w_1588,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180713121217-01-rosenstein-0713-screengrab.jpg?q=x_321,y_130,h_644,w_1144,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/171030211613-conspiracy-collusion-explainer-orig-mg-00005015.jpg?q=x_0,y_0,h_1080,w_1919,c_fill/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/170308211706-trump-tower-sign.jpg?q=x_288,y_790,h_2546,w_4525,c_crop/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/180705154440-chris-cillizza.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/180812091946-rudy-giuliani-8-12-18.jpg?q=x_85,y_39,h_952,w_1692,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180713211809-chris-cuomo-roger-stone-07132018.jpg?q=x_2,y_0,h_1078,w_1915,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/161209163408-donald-trump-rudy-giuliani.jpg?q=x_2,y_63,h_898,w_1596,c_crop/w_800", "https://media.cnn.com/api/v1/images/stellar/prod/170305101637-trump-putin-split.jpg?q=x_2,y_0,h_898,w_1596,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180916103441-kenneth-starr-september-16-2018-01.jpg?q=x_528,y_68,h_706,w_1255,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/171028084409-robert-mueller-0721.jpg?q=x_209,y_204,h_1076,w_1912,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180716193442-putin-comments-russia-probe-mueller-wallace-fox-sot-tsr-vpx-00005701.jpg?q=x_406,y_143,h_619,w_1100,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180717082752-02-donald-trump-0716.jpg?q=x_4,y_172,h_2163,w_3843,c_crop/h_144,w_256"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/161209163408-donald-trump-rudy-giuliani.jpg?q=x_2,y_63,h_898,w_1596,c_crop/w_800", "keywords": [], "authors": ["Chris Cillizza"], "canonical_link": "https://www.cnn.com/2018/07/31/politics/donald-trump-rudy-giuliani/index.html", "title": "The Russia investigation secret Donald Trump and Rudy Giuliani know", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "The secret Donald Trump and Rudy Giuliani know about the Russia probe | CNN Politics", "description": "The biggest misconception surrounding the special counsel investigation into Russian interference in the 2016 election is that it will likely end in some sort of legal proceeding involving President Donald Trump.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/161209163408-donald-trump-rudy-giuliani.jpg?q=x_2,y_63,h_898,w_1596,c_crop/w_800", "type": "article", "url": "https://www.cnn.com/2018/07/31/politics/donald-trump-rudy-giuliani/index.html", "site_name": "CNN"}, "twitter": {"title": "The secret Donald Trump and Rudy Giuliani know about the Russia probe | CNN Politics", "description": "The biggest misconception surrounding the special counsel investigation into Russian interference in the 2016 election is that it will likely end in some sort of legal proceeding involving President Donald Trump.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/161209163408-donald-trump-rudy-giuliani.jpg?q=x_2,y_63,h_898,w_1596,c_crop/w_800", "card": "summary_large_image", "site": "@cnnpolitics"}, "description": "The biggest misconception surrounding the special counsel investigation into Russian interference in the 2016 election is that it will likely end in some sort of legal proceeding involving President Donald Trump.", "template_type": "article_leaf", "type": "article", "meta-section": "politics", "meta-branding": "the-point", "theme": "politics", "article": {"published_time": "2018-07-31T14:28:33Z", "modified_time": "2018-08-01T15:10:37Z", "tag": "continents and regions, donald trump, eastern europe, government and public administration, investigations, political figures - us, politics, robert mueller, rudy giuliani, russia, russia meddling investigation, europe, government bodies and offices, us federal government, white house", "publisher": "https://www.facebook.com/CNN"}, "keywords": "continents and regions, donald trump, eastern europe, government and public administration, investigations, political figures - us, politics, robert mueller, rudy giuliani, russia, russia meddling investigation, europe, government bodies and offices, us federal government, white house", "author": "Chris Cillizza", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1532991600.0, "source": "http://www.cnn.com", "summary": ""}