{"url": "https://www.usatoday.com/story/life/people/2018/05/19/meghan-and-harry-honor-princess-diana-royal-wedding/625844002/", "text": "How Prince Harry and Meghan Markle honored Princess Diana at their wedding\n\nShow Caption Hide Caption Best moments of the royal wedding Prince Harry and Meghan Markle had the ultimate wedding goals, here are the best moments. USA TODAY\n\nWINDSOR, England — Princess Diana, Prince Harry's mother, passed away in 1997, but her presence was strongly felt at her son's wedding.\n\n“It is days like today when I really miss having her around and miss being able to share the happy news,\" Harry said during his engagement interview in November.\n\n\"I’m sure she’s with us, yeah, you know, jumping up and down somewhere else,” he added.\n\nAnd on their big day, the new Duke and Duchess of Sussex honored the beloved princess in a number of ways.\n\nMore: Royal wedding 2018: Prince Harry and Meghan Markle are officially married\n\nMore: 6 biggest moments from the royal wedding of Meghan Markle and Prince Harry\n\nThe guests\n\nPrince Harry was \"keen to involve his mother’s family in his wedding,\" Kensington Palace said in the run-up to the nuptials.\n\nDiana's three siblings - Earl Charles Spencer, 53, Lady Sarah McCorquodale, 63, and Lady Jane Fellowes - were in attendance. Lady Jane, who made a speech at her younger sister Diana's funeral, gave the only reading -- from the Song of Solomon -- at the wedding ceremony.\n\nThe ring\n\nHarry designed Duchess Meghan's ring with a central cushion-cut diamond from Botswana and two brilliant cut diamonds on the outside that belonged to his late mother.\n\nMore: Here's what Prince Harry, Meghan Markle want you to get them for their wedding\n\nThe hymn\n\nThe hymn “Guide Me, O Thy Great Redeemer,”sung at the wedding, was also sung during Diana’s funeral.\n\nThe flowers\n\nPrince Harry picked flowers from the gardens of Kensington Palace to include in his bride's bouquet, which was designed by florist Philippa Craddock.\n\n\"The spring blooms include Forget-Me-Nots which were Diana, Princess of Wales’ favorite flower. The couple specifically chose them to be included in Ms. Markle’s bouquet to honour the memory of the late Princess on this special day,\" Kensington Palace said in a statement.\n\nThe singer\n\nElton John, who performed a reworked version of Candle in the Wind at Diana's funeral, was a guest at the wedding and performed at the lunchtime reception.\n\n\"Prince Harry asked Sir Elton to perform at the Reception which was hosted by Her Majesty The Queen at St George's Hall, Windsor Castle,\" Kensington Palace said in a statement. \"Sir Elton performed for the newly married couple in recognition of the close connection he has with Prince Harry and his family,\" the palace added.\n\nMore: Harry and Meghan's royal wedding reception: Tasty canapes, toasts and Elton John\n\nThe charities\n\nThe couple asked that charitable donations be made in lieu of wedding gifts. Two of their chosen charities are dedicated to causes Diana supported. The Children's HIV Association (CHIVA) provides resources for HIV positive children and young adults in Ireland and the U.K., and Crisis provides homeless people in England, Scotland and Wales with support, counsel and courses.\n\nMore: Here's what Prince Harry, Meghan Markle want you to get them for their wedding", "images": ["https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://www.gannett-cdn.com/-mm-/325fab7218200d61fb9b806879312fe98b7ed290/c=0-152-3000-1847/local/-/media/2018/05/19/USATODAY/USATODAY/636623303065435894-AP-Britain-Royal-We-99995671.JPG?auto=webp&format=pjpg&width=1200", "https://media.gannett-cdn.com/29906170001/29906170001_5787133372001_5787129358001-vs.jpg?pubId=29906170001"], "top_img": "https://www.gannett-cdn.com/-mm-/325fab7218200d61fb9b806879312fe98b7ed290/c=0-152-3000-1847/local/-/media/2018/05/19/USATODAY/USATODAY/636623303065435894-AP-Britain-Royal-We-99995671.JPG?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Jane Onyanga-Omara"], "canonical_link": "https://www.usatoday.com/story/life/people/2018/05/19/meghan-and-harry-honor-princess-diana-royal-wedding/625844002/", "title": "How Prince Harry and Meghan Markle honored Princess Diana at their wedding", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/people/2018/05/19/meghan-and-harry-honor-princess-diana-royal-wedding/625844002/life/people", "theme-color": "#ffffff", "og": {"type": "article", "title": "How Prince Harry and Meghan Markle honored Princess Diana at their wedding", "description": "The new Duke and Duchess of Sussex honored the beloved princess in a number of ways.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/325fab7218200d61fb9b806879312fe98b7ed290/c=0-152-3000-1847/local/-/media/2018/05/19/USATODAY/USATODAY/636623303065435894-AP-Britain-Royal-We-99995671.JPG?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "The new Duke and Duchess of Sussex honored the beloved princess in a number of ways.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1526684400.0, "source": "https://www.usatoday.com", "summary": ""}