{"url": "https://deadline.com/2018/01/big-little-lies-golden-globe-best-limited-series-hbo-1202237709/", "text": "HBO’s Big Little Lies capped off a Golden Globes sweep with the prize for Best Limited TV Series/Made for TV Movie tonight. The win joined earlier trophies for Best Actress Nicole Kidman, Best Supporting Actress Laura Dern and Best Supporting Actor Alexander Skarsgard. The hardware haul tonight follows eight Emmy Awards back in September and comes amid the #MeToo and Time’s Up movements, making the series seem even more relevant.\n\nTime’s Up, a group of 300 women in the entertainment industry that recently started a legal defense fund for sexual harassment claims, was cited out by Big Little Lies star and exec producer Reese Witherspoon upon accepting the Limited Series Globe. “This show is so much about the life we present to the world that could be very different than the life we live behind closed doors,” she said. “So I want to thank everyone who broke their silence this year and spoke up about abuse and harassment. You are so brave. And hopefully shows like this, more will be made so people out there who are feeling silenced by harassment, discrimination, abuse: Time is up. We see you, we hear you and we will tell your stories.”\n\nBased on Liane Moriarty’s novel, the David E Kelley-scripted, Jean-Marc Vallée-directed Big Little Lies tells the story of a group of women in a tight-knit, well-heeled community in Monterey, CA. When a murder rocks the gossipy residents, the fragile truths behind their picture-perfect lives threaten to be exposed.\n\nKelley said tonight, “This one’s been a real joy. It started with Liane’s great book, HBO’s unflinching support” and Vallée. “He took this material into his heart and more importantly he delivered it from his heart elevating every page, every performance,” Kelley added, noting, “As for the cast, take a look at this cast, many of which have already been honored but two of which are also ferocious producers, Nicole and Reese.”\n\nThe series is getting a second installment with a seven-episode order coming through in early December. Back for the follow-up are Kidman and Witherspoon as well Kelley who again is penning all of the scripts partially based on a story by Moriarty. Andrea Arnold is directing.\n\nWhen the greenlight was announced, Witherspoon said, “It gives us the opportunity to delve deeper into the lives of these intriguing and intricate Monterey families and bring more of their stories back to the audience who embraced and championed them.”\n\nAdded Kidman, “This is inspired by the overwhelming response by audiences around the world, conceived once again by Liane Moriarty, realized by David Kelley and now in the hands of visionary filmmaker Andrea Arnold. What a journey this has been.”\n\nBLL is made by HBO Entertainment, David E. Kelly Productions, Pacific Standard and Blossom Films.", "images": ["https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://deadline.com/wp-content/uploads/2018/01/rexfeatures_9307692hf.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1"], "top_img": "https://deadline.com/wp-content/uploads/2018/01/rexfeatures_9307692hf.jpg?w=1024", "keywords": [], "authors": ["Nancy Tartaglione"], "canonical_link": "https://deadline.com/2018/01/big-little-lies-golden-globe-best-limited-series-hbo-1202237709/", "title": "‘Big Little Lies’ Reese Witherspoon: “Time Is Up, We Will Tell Your Stories” – Golden Globes", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "HBO's Big Little Lies capped off a Golden Globes sweep with the prize for Best Limited TV Series/Made for TV Movie tonight. The win joined earlier trophies for Best Actress Nicole Kidman, Best Supporting Actress Laura Dern and Best Supporting Actor Alexander Skarsgard.", "news_keywords": "Big Little Lies, Golden Globes, HBO, Nicole Kidman, Reese Witherspoon", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=533209613", "generator": "WordPress 6.0.2", "author": "Nancy Tartaglione", "theme-color": "#fff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Deadline", "application-name": "Deadline", "content_type": "Article", "post_id": 1202237709, "title": "'Big Little Lies' Reese Witherspoon: \"Time Is Up, We Will Tell Your Stories\" - Golden Globes", "published_at": "2018-01-07 20:20:28", "image": "https://deadline.com/wp-content/uploads/2018/01/rexfeatures_9307692hf.jpg?w=296&h=166&crop=1", "comment_count": 3, "tags": "Reese Witherspoon", "topics": "TV", "body": "HBO's Big Little Lies capped off a Golden Globes sweep with the prize for Best Limited TV Series/Made for TV Movie tonight. The win joined earlier trophies for Best Actress Nicole Kidman, Best Supporting Actress Laura Dern and Best Supporting Actor Alexander Skarsgard. The hardware haul tonight follows eight Emmy Awards back in September and comes amid the #MeToo and Time's Up movements, making the series seem even more relevant. \r\n\r\nTime's Up, a group of 300 women in the entertainment industry that recently started a legal defense fund for sexual harassment claims, was cited out by Big Little Lies star and exec producer Reese Witherspoon upon accepting the Limited Series Globe. \"This show is so much about the life we present to the world that could be very different than the life we live behind closed doors,\" she said. \"So I want to thank everyone who broke their silence this year and spoke up about abuse and harassment. You are so brave. And hopefully shows like this, more will be made so people out there who are feeling silenced by harassment, discrimination, abuse: Time is up. We see you, we hear you and we will tell your stories.\"\r\n\r\nBased on Liane Moriarty’s novel, the David E Kelley-scripted, Jean-Marc Vallée-directed Big Little Lies tells the story of a group of women in a tight-knit, well-heeled community in Monterey, CA. When a murder rocks the gossipy residents, the fragile truths behind their picture-perfect lives threaten to be exposed.\r\n\r\nKelley said tonight, \"This one's been a real joy. It started with Liane’s great book, HBO’s unflinching support\" and Vallée. \"He took this material into his heart and more importantly he delivered it from his heart elevating every page, every performance,\" Kelley added, noting, \"As for the cast, take a look at this cast, many of which have already been honored but two of which are also ferocious producers, Nicole and Reese.\"\r\n\r\nThe series is getting a second installment with a seven-episode order coming through in early December. Back for the follow-up are Kidman and Witherspoon as well Kelley who again is penning all of the scripts partially based on a story by Moriarty. Andrea Arnold is directing.\r\n\r\nWhen the greenlight was announced, Witherspoon said, \"It gives us the opportunity to delve deeper into the lives of these intriguing and intricate Monterey families and bring more of their stories back to the audience who embraced and championed them.”\r\n\r\nAdded Kidman, “This is inspired by the overwhelming response by audiences around the world, conceived once again by Liane Moriarty, realized by David Kelley and now in the hands of visionary filmmaker Andrea Arnold. What a journey this has been.”\r\n\r\nBLL is made by HBO Entertainment, David E. Kelly Productions, Pacific Standard and Blossom Films.", "fb": {"pages": 105558754896}, "onesignal": "wordpress-plugin", "fragment": "!", "og": {"type": "article", "title": "‘Big Little Lies’ Reese Witherspoon: “Time Is Up, We Will Tell Your Stories” – Golden Globes", "url": "https://deadline.com/2018/01/big-little-lies-golden-globe-best-limited-series-hbo-1202237709/", "description": "HBO’s Big Little Lies capped off a Golden Globes sweep with the prize for Best Limited TV Series/Made for TV Movie tonight. The win joined earlier trophies for Best Actress Nicole Kidman, Bes…", "site_name": "Deadline", "image": {"identifier": "https://deadline.com/wp-content/uploads/2018/01/rexfeatures_9307692hf.jpg?w=1024", "width": 1024, "height": 712, "alt": "Big Little Lies Golden Globes"}, "locale": "en_US"}, "article": {"published_time": "2018-01-08T04:20:28+00:00", "modified_time": "2018-01-08T04:50:39+00:00"}, "twitter": {"site": "@DEADLINE", "creator": "@DeadlineNancy", "card": "summary_large_image", "title": "‘Big Little Lies’ Reese Witherspoon: “Time Is Up, We Will Tell Your Stories” – Golden Globes", "description": "HBO’s Big Little Lies capped off a Golden Globes sweep with the prize for Best Limited TV Series/Made for TV Movie tonight. The win joined earlier trophies for Best Actress Nicole Kidman, Bes…", "image": "https://deadline.com/wp-content/uploads/2018/01/rexfeatures_9307692hf.jpg?w=1024"}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1515385228.0, "source": "https://deadline.com", "summary": ""}