{"url": "www.celebritynetworth.com/richest-celebrities/actors/matthew-rhys-net-worth/", "text": "What is Matthew Rhys's Net Worth and Salary?\n\nMatthew Rhys is a Welsh actor, best known for his performances on the television drama series \"Brothers & Sisters\" and \"The Americans.\" For the latter, he won an Emmy Award and received two Golden Globe nominations. Matthew Rhys has a net worth of $12 million. Rhys has also appeared in numerous films, including \"Titus,\" \"Fakers,\" \"The Post,\" and \"A Beautiful Day in the Neighborhood.\"\n\nEarly Life and Career Beginnings\n\nMatthew Rhys was born in 1974 in Cardiff, Wales. His first language is Welsh, and he went to schools where his education was delivered in the language. In the suburb of Whitchurch, he attended Ysgol Gynradd Gymraeg Melin Gruffydd, while in Llandaff North he attended Ysgol Gyfun Gymraeg Glantaf. When he was 17, Rhys played Elvis Presley in a school musical; subsequently, he was accepted to the Royal Academy of Dramatic Art in London. While at RADA, Rhys appeared on the BBC police procedural series \"Backup,\" and starred in the British independent film \"House of America.\" He also returned briefly to Cardiff to act in the Welsh-language film \"Bydd yn Wrol.\" For his performance, Rhys won the Best Actor award at the Welsh BAFTAs.\n\nTelevision Career\n\nIn early 1998, Rhys traveled to New Zealand to star in the costume drama series \"Greenstone.\" Two years later, he had another lead role on the eight-part British series \"Metropolis,\" about the lives of six 20-somethings in London. Following this, Rhys returned to New Zealand for a supporting role in the BBC television movie \"The Lost World,\" based on the eponymous novel by Arthur Conan Doyle. Next, in 2003, Rhys appeared in the final episode of the long-running series \"Columbo,\" and was in an episode of the six-part series \"POW.\"\n\nRhys landed his biggest television role yet in 2006, when he was cast as gay lawyer Kevin Walker on the ABC family drama series \"Brothers & Sisters.\" The actor moved to Santa Monica, California to film the show, which ran for five seasons through 2011. After the show wrapped, Rhys appeared in the BBC's two-part \"The Mystery of Edwin Drood,\" an adaptation of the unfinished Charles Dickens novel. The next year, he was in another literary adaptation, this time of P. D. James's \"Death Comes to Pemberley.\" Also in 2013, Rhys began one of his most acclaimed roles on the FX spy drama series \"The Americans.\" Starring alongside Keri Russell as one of two married KGB agents, Rhys won an Emmy and received two Golden Globe Award nominations for his performance as Philip Jennings. Among the actor's later television credits are \"The Bastard Executioner,\" \"Death and Nightingales,\" and \"Perry Mason,\" on which Rhys plays the titular character.\n\nFilm Career\n\nEarly on in his film career, Rhys was in the British thriller \"Heart,\" the Shakespeare adaptation \"Titus,\" and the comedy \"Whatever Happened to Harold Smith?,\" all released in 1999. The next year, he costarred in the thriller \"Sorted,\" and appeared opposite Jonathan Pryce in the literary adaptation \"The Testimony of Taliesin Jones.\" Rhys reunited with Pryce for the 2001 musical comedy \"Very Annie Mary,\" which also featured Rhys's future \"Brothers & Sisters\" costar Rachel Griffiths. Following this, Rhys went to Ireland to star in the period adventure film \"The Abduction Club.\" Subsequent credits in the 2000s include the horror war film \"Deathwatch\"; the crime drama \"Shooters\"; the comic caper \"Fakers\"; and the romantic comedy \"Love and Other Disasters,\" in which he starred opposite Brittany Murphy. Rhys continued his run of romantic films with \"Virgin Territory\" and \"The Edge of Love,\" in the latter of which he portrayed poet Dylan Thomas.\n\nIn 2010, Rhys starred in the Welsh-Argentine drama \"Patagonia\" alongside other notable Welsh figures such as Nia Roberts and Duffy. Next, he reprised Alec Guinness's 1959 double role in a new adaptation of \"The Scapegoat\" by Daphne du Maurier. This was followed by roles in \"Burnt,\" \"Come What May,\" \"The Post,\" and the Netflix adventure drama \"Mowgli: Legend of the Jungle.\" In 2019, Rhys had two major roles as real-life reporters: in the Fred Rogers biographical film \"A Beautiful Day in the Neighborhood\" and in the political drama \"The Report.\"\n\nTheatre Career\n\nOn stage, Rhys made his debut in 1997 in a production of \"Cardiff East\" at the Royal National Theatre. The same year, he appeared in the plays \"Grace Note,\" \"One More Wasted Year,\" and \"Stranger's House.\" In 2000, Rhys starred as Benjamin Braddock in the world premiere stage adaptation of \"The Graduate\" on London's West End. He went on to appear in \"The Associate\" and \"Under Milk Wood\" in 2003, and then starred in three Shakespeare adaptations in 2004: \"King Lear,\" \"Macbeth,\" and \"Romeo and Juliet.\" After some time away from the stage, Rhys was cast in the Off-Broadway revival of John Osborne's play \"Look Back in Anger\" in 2012.\n\nPersonal Life and Patronage\n\nHaving met while filming \"The Americans,\" Rhys has been romantically involved with Keri Russell since 2014. The couple had a son in 2016.\n\nRhys has many affiliations as a patron of charitable organizations. Along with fellow Welsh actor Ioan Gruffudd, he is a patron of the UK spinal injuries charity Trust PA. Rhys is also a patron of Asylum Justice, a Welsh charity that offers free legal advice and representation for migrants and refugees. Additionally, he serves as an ambassador for Bobath Children's Therapy Centre Wales, which treats children with cerebral palsy.", "images": ["https://vz.cnwimg.com/wp-content/uploads/2013/08/Matthew-Rhys.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2013/08/Matthew-Rhys.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/matthew-rhys-net-worth/", "title": "Matthew Rhys Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Matthew Rhys is a Welsh actor, best known for his performances on the television drama series \"Brothers & Sisters\" and \"The Americans.\" For the latter, he won an Emmy Award and received two Golden Globe nominations. Matthew Rhys has a net worth of $12 million.", "cnw_share_fb_count": 101, "cnw_share_tw_count": 44, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Matthew Rhys Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/matthew-rhys-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2013/08/Matthew-Rhys.jpg", "site_name": "Celebrity Net Worth", "description": "Matthew Rhys is a Welsh actor, best known for his performances on the television drama series \"Brothers & Sisters\" and \"The Americans.\" For the latter, he won an Emmy Award and received two Golden Globe nominations. Matthew Rhys has a net worth of $12 million."}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2021-09-28T23:20:10+00:00", "published_time": "2021-09-27T00:06:02+00:00", "section": "Actors", "tag": "the americans"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2013/08/Matthew-Rhys.jpg", "title": "Matthew Rhys Net Worth", "description": "Matthew Rhys is a Welsh actor, best known for his performances on the television drama series \"Brothers & Sisters\" and \"The Americans.\" For the latter, he won an Emmy Award and received two Golden ..."}}, "movies": [], "publish_date": 1632701162.0, "source": "http://www.celebritynetworth.com", "summary": ""}