{"url": "https://www.hollywoodreporter.com/live-feed/scandal-series-finale-explained-how-did-it-end-1103874", "text": "[This story contains spoilers from the series finale of ABC’s Scandal, “Over a Cliff.”]\n\nThe Gladiators have left their arena.\n\nOn Thursday, ABC and Shonda Rhimes closed up Olivia Pope and Associates for good as Scandal wrapped its seven-season run with a series finale that explored the ramifications of going public with the existence of black-ops group B613 and the ultimate corruption that comes with the thirst for power and the Oval Office.\n\nThe series finale, fittingly called “Over a Cliff” and written by Rhimes, followed the Gladiators all standing in the light to tell the truth about what they’ve done over their years of back-room deals and misdeeds to protect the Republic (and their own inner-circle of power). As expected, the finale featured a couple of familiar faces, resolved the B613 case and left some things open for interpretation.\n\nUltimately, Attorney General David Rosen (Josh Malina) — aka the most innocent person in D.C. whose hat was the whitest among everyone on the show — would pay the price for everything and was killed off. In the end, it was Cyrus (Jeff Perry) — the vice president of the United States — who killed David as he proved yet again that he would do anything to make the Oval Office his own in a storyline that Scandal has followed since its start. The series has always explored how the Oval Office and lust for power corrupts those who come near it, and Cyrus killing David illustrated how far he would go to get the highest office in the country. As for Cyrus, Olivia demands his resignation and he willingly agrees as he acknowledges that the things that he has done in his lust for power are demons from which he can never escape.\n\n“It’s always been my contention that the Oval Office, in our show, was a place that corrupted anybody who came near it and the closer you came, the more corrupt it made you and the more damaged it made you,” Rhimes told reporters, including THR, ahead of the finale. “Olivia started out as the character that we knew who has very much believed in how important this particular kind of power was and how molding it and being a part of it was — and we watched her, like everybody else, become absolutely corrupted by it, and make all the same mistakes that everybody else makes to get what she wants from it.”\n\nThat reveal capped a final season that focused largely on how Olivia (Kerry Washington), who assumed control of B613 in the season six finale, had to fight her way back into the light and stand in the sun of what’s right and, most importantly, who she really is at her core. Given the chance to flee by her father Rowan (Joe Morton), the one-time head of B613, Olivia opted instead to tell the truth and find her moral center again. Rowan, as it turns out, shockingly opted to do the same and testified that he created B613 and did so in a response to a need: because of white men whose privilege left the Republic in a state of neglect. Rowan confesses to his work fixing elections, acts of terrorism and more — but he did so for a reason. “I am responsible for the fact that this nation still stands,” he testifies. “I wake up every morning and I make America great.” Rowan’s final monologue is a larger statement about race in America and that the white men who run the country were ultimately controlled by a black man. Rowan’s testimony brings Jake (Scott Foley) down as he takes the fall for B613.\n\n“One of the things that Olivia says in the penultimate episode is this idea of standing up and being somebody who puts everything out in the open is important,” Rhimes told reporters, including THR, ahead of the series ender. “Whether or not everybody pays for what they’ve done, I don’t know that that’s what the finale is about as much as it’s about seeing what happens once that choice has been made.”\n\nRhimes reiterated that she has always been more “Team Olivia” than any other romantic pairing for her D.C. fixer and the finale would serve to complete Olivia’s “evolution” from the time viewers met her — when she’d already rigged a presidential election — to what happens after she finds her moral center again this season.” So post-B613, did Olivia wind up with her fairy tale ending with Fitz and a lifetime of making jam in Vermont? The end of the series featured Olivia’s portrait in the National Portrait Gallery — leaving viewers to decide for themselves if Olivia would wind up becoming president or was rewarded for her role in cleaning up D.C.’s corruption and becoming the ultimate fixer. (A nice touch: Rhimes‘ daughter, Harper, was the young girl left looking up at the portrait, which said “We the People” along its side.)\n\nAs Rhimes warned, the finale also left that and a few other storylines open for viewers to interpret on their own as Scandal jumped forward following the conclusion of the B613 trial. Rhimes and producers have no immediate plans of discussing how the series ultimately ended and intentionally wanted to leave the audience to determine the show’s ultimate takeaway about politics in D.C. (Rhimes noted that the finale was more about completing Olivia’s journey than making a statement about backroom dealings in D.C.)\n\nThe finale also left viewers to decide if Olivia and Fitz (Tony Goldwyn) got their happy ending and life of jam-making in Vermont.\n\nThat said, here’s a look at where everyone wound up.\n\n• Olivia (Washington): Cleaned up D.C., stood in the sun and was happily her own person. The ending also implied that the path was clear for a romantic relationship with Fitz, free of B613 and secrets. Rhimes‘ ending also reiterated a theme that she has explored in the past: that women do not need a man to be happy, though her romantic path to Fitz remained open. Free from working in Washington, Olivia is left to do whatever she wants as she turns her back on D.C.\n\n• Fitz (Goldwyn): The former president still has his foundation and likely now has an open path to a romantic future with the love of his life: Olivia. What’s more: his legacy is left untarnished. He becomes Marcus’ first backer in what could be his eventual run for office.\n\n• Mellie (Young): Cleared from all wrong-doing, Mellie remained president — with a romantic relationship with Marcus. What’s more, she made gun control central to her platform. Olivia winds up telling Mellie that she has always been able to stand on her own two feet and leaves her to run the country — without her.\n\n• Cyrus (Jeff Perry): Resigns as vice president of the United States and confesses that he can’t ever escape from the sins he has committed in his thirst for power.\n\n• Abby (Darby Stanchfield): Lost the love of her life in David Rosen. Abby’s ending was the most open-ended, though it’s likely she wound up remaining at work for Quinn Perkins and Associates.\n\n• Quinn (Katie Lowes): Got her happy ending: Married Charlie and is happy with their child — and running Quinn Perkins and Associates.\n\n• Huck (Guillermo Diaz): Remains by Abby’s side as she grieves for David.\n\n• Jake (Scott Foley): Takes the fall for B613 and spends the rest of his life in jail. Olivia apologizes to him for making him step out of the sun. Jake admits that he got something out of the whole thing — he loved Olivia. Jake becomes the only person who pays for everyone’s sins, letting all the Gladiators off the hook for everything that they’ve done.\n\n• Rowan (Joe Morton): His testimony helps set all the Gladiators free — and bring down Jake and all of B613.\n\n• David (Josh Malina): Pays the price for Cyrus’ lust for power and is killed by the vice president.\n\n• Charlie (George Newbern): Is released from jail and works for his wife at Quinn Perkins and Associates.\n\n• Marcus (Cornelius Smith Jr.): The latest Gladiator likely winds up in the White House — as the first husband to president Mellie Grant. What’s more, he’s going to explore his own political future, with Fitz backing him.\n\nScandal, which helped cement Rhimes as a mega-producer and brand of her own, marked the close of prolific showrunner’s chapter on broadcast as every series she creates going forward will be for Netflix, where she signed a nine-figure overall deal.\n\nIn terms of Scandal‘s future, Rhimes — who once seriously considered doing a B613 spinoff — confirmed that the end of the series is indeed the end of the franchise and there are no offshoots planned: “Scandal is done.” While it would be easy to revisit the world of corruption and Gladiators on ABC’s Rhimes-produced drama How to Get Away With Murder after both series crossed over earlier this season, there are no current plans for that, either, though she stressed that the decision ultimately lies with showrunner Pete Nowalk.\n\nWhat did you think of the Scandal series finale? Sound off in the comments section below. Stay tuned to THR.com/Scandal for full coverage of the series finale, including interviews with the cast. In the meantime, be sure to read our feature with Rhimes on the legacy she and Scandal leave behind and our guest column with Bellamy Young about what she learned from her time working in Shondaland. And if you’re feeling nostalgic, check out our Scandal oral history. To keep up with what each of the Gladiators are doing next, click here.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/148899_5982_-_h_2018.jpg?w=1024", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/148899_5982_-_h_2018.jpg?w=1296&h=730&crop=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/148899_5982_-_h_2018.jpg?w=1024", "keywords": [], "authors": ["Lesley Goldberg"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/scandal-series-finale-explained-how-did-it-end-1103874/", "title": "‘Scandal’ Series Finale: How Shonda Rhimes Wrapped the ABC Political Game-Changer", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Who paid for their (B613) sins? Did Olivia and Fitz get their Vermont ending? THR breaks it all down.", "news_keywords": "Scandal", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Lesley Goldberg", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1103874, "title": "'Scandal' Series Finale: How Shonda Rhimes Wrapped the ABC Political Game-Changer", "published_at": "2018-04-19 20:02:06", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/148899_5982_-_h_2018.jpg?w=1024", "comment_count": 0, "tags": "Scandal", "topics": "TV News", "body": "[This story contains spoilers from the series finale of ABC's Scandal, \"Over a Cliff.\"]\r\nThe Gladiators have left their arena.\r\nOn Thursday, ABC and Shonda Rhimes closed up Olivia Pope and Associates for good as Scandal wrapped its seven-season run with a series finale that explored the ramifications of going public with the existence of black-ops group B613 and the ultimate corruption that comes with the thirst for power and the Oval Office.\r\nThe series finale, fittingly called \"Over a Cliff\" and written by Rhimes, followed the Gladiators all standing in the light to tell the truth about what they've done over their years of back-room deals and misdeeds to protect the Republic (and their own inner-circle of power). As expected, the finale featured a couple of familiar faces, resolved the B613 case and left some things open for interpretation.\r\nUltimately, Attorney General David Rosen (Josh Malina) — aka the most innocent person in D.C. whose hat was the whitest among everyone on the show — would pay the price for everything and was killed off. In the end, it was Cyrus (Jeff Perry) — the vice president of the United States — who killed David as he proved yet again that he would do anything to make the Oval Office his own in a storyline that Scandal has followed since its start. The series has always explored how the Oval Office and lust for power corrupts those who come near it, and Cyrus killing David illustrated how far he would go to get the highest office in the country. As for Cyrus, Olivia demands his resignation and he willingly agrees as he acknowledges that the things that he has done in his lust for power are demons from which he can never escape.\r\n\"It's always been my contention that the Oval Office, in our show, was a place that corrupted anybody who came near it and the closer you came, the more corrupt it made you and the more damaged it made you,\" Rhimes told reporters, including THR, ahead of the finale. \"Olivia started out as the character that we knew who has very much believed in how important this particular kind of power was and how molding it and being a part of it was — and we watched her, like everybody else, become absolutely corrupted by it, and make all the same mistakes that everybody else makes to get what she wants from it.\"\r\n\r\nThat reveal capped a final season that focused largely on how Olivia (Kerry Washington), who assumed control of B613 in the season six finale, had to fight her way back into the light and stand in the sun of what's right and, most importantly, who she really is at her core. Given the chance to flee by her father Rowan (Joe Morton), the one-time head of B613, Olivia opted instead to tell the truth and find her moral center again. Rowan, as it turns out, shockingly opted to do the same and testified that he created B613 and did so in a response to a need: because of white men whose privilege left the Republic in a state of neglect. Rowan confesses to his work fixing elections, acts of terrorism and more — but he did so for a reason. \"I am responsible for the fact that this nation still stands,\" he testifies. \"I wake up every morning and I make America great.\" Rowan's final monologue is a larger statement about race in America and that the white men who run the country were ultimately controlled by a black man. Rowan's testimony brings Jake (Scott Foley) down as he takes the fall for B613.\r\n\r\n\"One of the things that Olivia says in the penultimate episode is this idea of standing up and being somebody who puts everything out in the open is important,\" Rhimes told reporters, including THR, ahead of the series ender. \"Whether or not everybody pays for what they've done, I don't know that that's what the finale is about as much as it's about seeing what happens once that choice has been made.\"\r\n\t\r\n\tRhimes reiterated that she has always been more \"Team Olivia\" than any other romantic pairing for her D.C. fixer and the finale would serve to complete Olivia's \"evolution\" from the time viewers met her — when she'd already rigged a presidential election — to what happens after she finds her moral center again this season.\" So post-B613, did Olivia wind up with her fairy tale ending with Fitz and a lifetime of making jam in Vermont? The end of the series featured Olivia's portrait in the National Portrait Gallery — leaving viewers to decide for themselves if Olivia would wind up becoming president or was rewarded for her role in cleaning up D.C.'s corruption and becoming the ultimate fixer. (A nice touch: Rhimes' daughter, Harper, was the young girl left looking up at the portrait, which said \"We the People\" along its side.)\r\n\r\nAs Rhimes warned, the finale also left that and a few other storylines open for viewers to interpret on their own as Scandal jumped forward following the conclusion of the B613 trial. Rhimes and producers have no immediate plans of discussing how the series ultimately ended and intentionally wanted to leave the audience to determine the show's ultimate takeaway about politics in D.C. (Rhimes noted that the finale was more about completing Olivia's journey than making a statement about backroom dealings in D.C.)\r\nThe finale also left viewers to decide if Olivia and Fitz (Tony Goldwyn) got their happy ending and life of jam-making in Vermont.\r\n\r\nThat said, here's a look at where everyone wound up.\r\n• Olivia (Washington): Cleaned up D.C., stood in the sun and was happily her own person. The ending also implied that the path was clear for a romantic relationship with Fitz, free of B613 and secrets. Rhimes' ending also reiterated a theme that she has explored in the past: that women do not need a man to be happy, though her romantic path to Fitz remained open. Free from working in Washington, Olivia is left to do whatever she wants as she turns her back on D.C.\r\n\t\r\n\t• Fitz (Goldwyn): The former president still has his foundation and likely now has an open path to a romantic future with the love of his life: Olivia. What's more: his legacy is left untarnished. He becomes Marcus' first backer in what could be his eventual run for office.\r\n• Mellie (Young): Cleared from all wrong-doing, Mellie remained president — with a romantic relationship with Marcus. What's more, she made gun control central to her platform. Olivia winds up telling Mellie that she has always been able to stand on her own two feet and leaves her to run the country — without her.\r\n• Cyrus (Jeff Perry): Resigns as vice president of the United States and confesses that he can't ever escape from the sins he has committed in his thirst for power.\r\n• Abby (Darby Stanchfield): Lost the love of her life in David Rosen. Abby's ending was the most open-ended, though it's likely she wound up remaining at work for Quinn Perkins and Associates.\r\n\t\r\n\t• Quinn (Katie Lowes): Got her happy ending: Married Charlie and is happy with their child — and running Quinn Perkins and Associates.\r\n\t\r\n\t• Huck (Guillermo Diaz): Remains by Abby's side as she grieves for David.\r\n• Jake (Scott Foley): Takes the fall for B613 and spends the rest of his life in jail. Olivia apologizes to him for making him step out of the sun. Jake admits that he got something out of the whole thing — he loved Olivia. Jake becomes the only person who pays for everyone's sins, letting all the Gladiators off the hook for everything that they've done.\r\n\t\r\n\t• Rowan (Joe Morton): His testimony helps set all the Gladiators free — and bring down Jake and all of B613.  \r\n• David (Josh Malina): Pays the price for Cyrus' lust for power and is killed by the vice president.\r\n\t\r\n\t• Charlie (George Newbern): Is released from jail and works for his wife at Quinn Perkins and Associates. \r\n\t\r\n\t• Marcus (Cornelius Smith Jr.): The latest Gladiator likely winds up in the White House — as the first husband to president Mellie Grant. What's more, he's going to explore his own political future, with Fitz backing him.\r\n\r\nScandal, which helped cement Rhimes as a mega-producer and brand of her own, marked the close of prolific showrunner's chapter on broadcast as every series she creates going forward will be for Netflix, where she signed a nine-figure overall deal.\r\nIn terms of Scandal's future, Rhimes — who once seriously considered doing a B613 spinoff — confirmed that the end of the series is indeed the end of the franchise and there are no offshoots planned: \"Scandal is done.\" While it would be easy to revisit the world of corruption and Gladiators on ABC's Rhimes-produced drama How to Get Away With Murder after both series crossed over earlier this season, there are no current plans for that, either, though she stressed that the decision ultimately lies with showrunner Pete Nowalk. \r\nWhat did you think of the Scandal series finale? Sound off in the comments section below.  Stay tuned to THR.com/Scandal for full coverage of the series finale, including interviews with the cast. In the meantime, be sure to read our feature with Rhimes on the legacy she and Scandal leave behind and our guest column with Bellamy Young about what she learned from her time working in Shondaland. And if you're feeling nostalgic, check out our Scandal oral history. To keep up with what each of the Gladiators are doing next, click here.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Scandal’ Series Finale: How Shonda Rhimes Wrapped the ABC Political Game-Changer", "url": "https://www.hollywoodreporter.com/tv/tv-news/scandal-series-finale-explained-how-did-it-end-1103874/", "description": "Who paid for their (B613) sins? Did Olivia and Fitz get their Vermont ending? THR breaks it all down.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/148899_5982_-_h_2018.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2018-04-19T20:02:06+00:00", "modified_time": "2018-04-23T07:22:17+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Scandal’ Series Finale: How Shonda Rhimes Wrapped the ABC Political Game-Changer", "description": "Who paid for their (B613) sins? Did Olivia and Fitz get their Vermont ending? THR breaks it all down.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/148899_5982_-_h_2018.jpg?w=1296"}}, "movies": [], "publish_date": 1524168126.0, "source": "https://www.hollywoodreporter.com", "summary": ""}