{"url": "https://www.bbc.com/sport/winter-olympics/42969738", "text": "Last updated on .From the section Winter Olympics\n\nXXIII Olympic Winter Games Venue: Pyeongchang, South Korea Dates: 9-25 February Coverage: Watch live on BBC TV, Red Button, Connected TVs, BBC Sport website and mobile app. Full coverage times\n\nAmerican snowboard sensation Chloe Kim produced a brilliant performance to take gold in the women's halfpipe.\n\nThe 17-year-old won with a score of 98.25 on her final run with China's Jiayu Liu taking silver and United States' Arielle Gold winning bronze.\n\nKim had already secured gold with her first run score but improved to win by eight-and-a-half points.\n\nShe is one of the stars of the Games and a favourite with the home fans due to her South Korean parents.\n\n\"It means a lot just being able to do it where my family is from,\" Kim said after her win which was watched by the biggest crowd so far at Pyeongchang's Phoenix Snow Park.\n\n\"There was a lot of pressure, but I'm happy I was able to do it here and do it for the fans and the family.\n\n\"I'm so happy I was able to land and being here is so exciting, this has been a dream of mine.\"\n\nThe seven other gold medals on day four\n\nItalian skater Arianna Fontana wins 500m short-track gold\n\nAustrian skiing great Marcel Hirscher finally wins his first Olympic title with victory in the men's combined event\n\nKjeld Nuis edges out fellow Dutchman Patrick Roest by 0.85 seconds to win 1500m speed skating gold\n\nGermany's Natalie Geisenberger takes gold after a dominant display in the women's singles luge\n\nNorway's Johannes Hoesflot Klaebo and Sweden's Stina Nilsson claim the sprint classic titles\n\nCanada's Kaitlyn Lawes and John Morris beat Switzerland 10-3 to take the inaugural Olympic mixed doubles curling title\n\nTeenage kicks... Why are teenagers so good at snowboarding? 17-year-old Red Gerard's gold in the slopestyle was no surprise to those who follow the sport. How youngsters have started to dominate the slopes\n\nBreathtaking after breakfast\n\nBBC Sport commentator Ed Leigh said we might be looking at \"the beginning of a very long reign for the queen of halfpipe snowboarding\".\n\nThe Californian was the strong favourite ahead of the Games and that status was strengthened when she qualified with a score of 91.50, almost four better than any of her rivals.\n\nThe gold is Kim's first Olympic medal at her debut Games. She qualified for the 2014 Games in Sochi but was unable to compete as she was aged just 13.\n\nThe teenager was the last to take to the course in the first run and immediately moved top of the standings with a score of 93.75.\n\nShe fell on her second run but no rider was able to better her initial effort meaning the American was already guaranteed gold before her final run.\n\nKim even took to Twitter during the competition to discuss her breakfast.\n\nHer US team-mate and snowboard legend Shaun White qualified first in the men's halfpipe ahead of the final on Wednesday at 01:30 GMT.\n\nWho is Pyeongchang's 'queen'?\n\nKim's victory was celebrated like a win for home nation South Korea at the snow park\n\nKim's parents emigrated from South Korea to the US in 1982 and she first tried the sport aged four.\n\nDespite her age she has dominated the sport in recent years, becoming the youngest person to win three X Games gold medals.\n\nAt just 15 she became the first female snowboarder to land back-to-back 1080 degree spins in competition, a trick she repeated on her third run in Pyeongchang.\n\nThe teenager has a large following on social media and a tweet external-link between her qualification runs went viral as she expressed her need for ice cream.\n\nIn her news conference following her win Kim said \"I'm so hungry. I really want a burger or fries or maybe some pizza\".\n\nThousands of Twitter users congratulated her following the win, causing her name to trend on the network.\n\nThere was more than double the number of tweets including her name in the hours after her win than those featuring her compatriots and fellow snowboard gold medal winners Red Gerard and Jamie Anderson combined after their wins earlier in the Games.\n\nOther news lines from day four\n\nUS women's ice hockey goalkeepers Nicole Hensley and Alex Rigsby have been asked to remove the Statue of Liberty emblem on their masks", "images": ["https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/B310/production/_100004854_chloekim.jpg", "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/170F2/production/_100005449_hi044738034.jpg", "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/594C/production/_100006822_alexrigsby_reuters.jpg", "https://ichef.bbci.co.uk/live-experience/cps/160/cpsprodpb/185B9/production/_99996799_red_gerard_getty.jpg", "https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/16C42/production/_100005239_hi044736775.jpg", "https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/3C5A/production/_100005451_lee.jpg", "https://a1.api.bbc.co.uk/hit.xiti?&col=1&from=p&ptag=js&s=598253&p=winter_olympics::sport.winter_olympics.story.42969738.page&x1=[urn:bbc:cps:1e53ab0b-ae63-554a-a405-830c6a370be7]&x2=[responsive]&x3=[bbc_website]&x4=[en]&x7=[article]&x8=[reverb-3.6.0-nojs]&x11=[SPORT_PS]&x12=[SPORT]", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/16C42/production/_100005239_hi044736775.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bbc.co.uk/sport/winter-olympics/42969738", "title": "Winter Olympics: Chloe Kim wins halfpipe gold medal for United States", "meta_data": {"apple-itunes-app": "app-id=377388936, app-argument=https://www.bbc.co.uk/sport/winter-olympics/42969738", "apple-mobile-web-app-title": "BBC Sport", "application-name": "BBC Sport", "msapplication-TileImage": "https://m.files.bbci.co.uk/modules/bbc-morph-sport-page-app-meta/2.1.0/images/web-icons/bbc-sport-144.png", "theme-color": "#ffd230", "og": {"type": "article", "site_name": "BBC Sport", "url": "https://www.bbc.com/sport/winter-olympics/42969738", "title": "US teenager Kim wins halfpipe gold", "description": "American snowboard sensation Chloe Kim produces a brilliant performance to take gold in the women's halfpipe.", "image": "https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/16C42/production/_100005239_hi044736775.jpg"}, "fb": {"pages": "1392506827668140,137920769558355,193435954068976,118450564909230,100978706649892,15286229625,21263239760,122103087870579,120655094632228,102814153147070,124715648647,153132638110668,150467675018739,1033940569952576,857410004307950,624989267645024,1471706783148263,228735667216,317278538359186,958681370814419,260967092113,168895963122035,114010462015043,8251776107,273726292719943,232455204224,1436581493296609,8585725981,8244244903,470911516262605,413132078795966,7519460786,1470145583204829"}, "description": "American snowboard sensation Chloe Kim produces a brilliant performance to take gold in the women's halfpipe.", "robots": "index", "viewport": "width=device-width, initial-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.bbc.com", "summary": ""}