{"url": "https://web.archive.org/web/20171222091553/https://www.parents.com/parenting/celebrity-parents/moms-dads/whitney-port-talks-surviving-the-holidays-and-traveling-with-a/", "text": "Courtesy of Whitney Port\n\nEntrepreneur and former MTV reality star Whitney Port has established herself as a mom-guru since she and husband Tim Rosenman welcomed their first child, Sonny, back in July. From early morning feedings to mental breakdowns, and even the occasional celebratory first-time-mom moments, 32-year-old Port documents it all on her YouTube channel and blog. By developing a strong relationship with her followers who look to her for advice and even offer tips and tricks in return, she's taken the parenting world by storm.\n\nA post shared by Bundle Organics (@bundleorganics) on Aug 22, 2017 at 5:37pm PDT\n\nYou may recognize Port from MTV's hit show The Hills, which first aired back in 2006. At the time, Port worked alongside Lauren Conrad at Teen Vogue, as the stylish, soft-spoken intern to join the Laguna Beach spinoff. She continued her stint on reality TV with The City—a continuation of The Hills that followed Port's life working for designer Diane Von Furstenberg in New York City. Since her time on MTV, Port has transformed from TV personality to fashion designer, creative director, and CEO of her fashion brand Whitney Eve.\n\nCourtesy of Whitney Port\n\nNow, with the holidays just around the corner, Port has paired up with Tylenol to promote healthy living during cold and flu season. As she and Rosenman prepare Sonny for his first trip on an airplane, they are relying on Tylenol to manage their families well-being through all the chaos.\n\nWe caught up with Port to talk surviving the holidays, Sonny's first flight, and what she has in store for the new year.\n\nShe wants to be fully prepared for the holidays. \"I definitely feel the pressure. Let me put it this way: I don't feel so much pressure to make everything so perfect because Sonny at this point is only going to be 5-months-old. I feel a little bit of pressure that I need to have everything prepared and ready to go for the travel and for Sonny's schedule to be organized. We are going to be with family and I don't want to feel like I don't have it under control.\"\n\nShe understands that she can't plan everything. \"I'm most nervous that Sonny is going to be uncomfortable on the plane and I'm not going to know why—that really scares me. I don't want to disrupt everyone's flight. We're taking a red-eye and everyone's going to try to sleep and I don't want a screaming baby. Obviously, there are things I can pack in my bag that will help, like Tylenol since Sonny is starting to teethe right now. I feel like having Tylenol on hand will give me peace of mind to know that maybe his pain can subside. Then I want to have his little toys to distract him and I'll make sure he is always changed and fed. I think having enough bottles and food for him to suck on during takeoff and landing will help because his ears can be uncomfortable if they're popping—it's really about anticipating all of those things.\"\n\nThroughout the chaos, she remembers what's important. \"As a first time mom, I feel like I'm constantly trying to stay 5 steps ahead. For example, Sonny may be fine right now but I'm always planning for when he starts crying, when he needs a bottle, when it's time for his next nap, and when he has to be changed. I think that it's so important to stop that for just a second and appreciate where you are and really stay in the moment. You can't control babies, they aren't robots and we don't have them all figured out. I think it's important for new moms to to be easy on themselves because it's obviously a high-stress time.\"\n\nShe has mommy resolutions in line for 2018. \"I want to be more relaxed about everything and I want to try to stop being so impressionable. I think as a new mom it's really easy to take what other parents have done, see the results through their children, and really compare that to what is going on with your child. Some of the first questions that people ask new moms is, \"Is your baby sleeping through the night yet?\" or \"Are you still breastfeeding?\" and if their baby is sleeping through the night or still breastfeeding and yours isn't, you immediately judge yourself and want to know what they are doing to get yourself on the same page. It's just not a healthy thing to do because every baby is different. I want to stop comparing and really go with my gut and parent Sonny in a way that makes me comfortable, not just how everyone else is doing it.\"", "images": ["https://web.archive.org/web/20171222091553im_/https://images.parents.mdpcdn.com/sites/parents.com/files/styles/week_by_week_card/public/melissa_fumero.jpg", "https://web.archive.org/web/20171222091553im_/https://images.parents.mdpcdn.com/sites/parents.com/files/styles/week_by_week_card/public/images/550_101917322.jpg", "https://web.archive.org/web/20171222091553im_/https://www.parents.com/sites/parents.com/themes/parents/images/parenting_shop.png", "https://web.archive.org/web/20171222091553im_/https://images.parents.mdpcdn.com/sites/parents.com/files/styles/original/public/whitney_port_1.jpg", "https://web.archive.org/web/20171222091553im_/https://images.meredith.com/parents/images/marketing/Registration/OnsiteDefaults/200x100_11837_1_DSDFLT.jpg", "https://web.archive.org/web/20171222091553im_/https://images.parents.mdpcdn.com/sites/parents.com/files/styles/week_by_week_card/public/images/p_101963545.jpg", "https://web.archive.org/web/20171222091553im_/https://images.parents.mdpcdn.com/sites/parents.com/files/styles/original/public/whitney_port_3.jpg", "https://web.archive.org/web/20171222091553im_/https://images.parents.mdpcdn.com/sites/parents.com/files/styles/week_by_week_card/public/shutterstock_457189861.jpg", "https://web.archive.org/web/20171222091553im_/https://images.parents.mdpcdn.com/sites/parents.com/files/styles/scale_1500_1500/public/whitney_port_3.jpg", "https://web.archive.org/web/20171222091553im_/https://c.betrad.com/pub/icon1.png", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://web.archive.org/web/20171222091553im_/https://images.parents.mdpcdn.com/sites/parents.com/files/styles/week_by_week_card/public/images/p_101675201.jpg", "https://web.archive.org/web/20171222091553im_/https://images.parents.mdpcdn.com/sites/parents.com/files/styles/week_by_week_card/public/screen_shot_2016-12-05_at_12.43.07_pm.jpg"], "top_img": "https://web.archive.org/web/20171222091553im_/https://images.parents.mdpcdn.com/sites/parents.com/files/styles/scale_1500_1500/public/whitney_port_3.jpg", "keywords": [], "authors": ["Lauren Pardee"], "canonical_link": "https://web.archive.org/web/20171222091553/https://www.parents.com/parenting/celebrity-parents/moms-dads/whitney-port-talks-surviving-the-holidays-and-traveling-with-a/", "title": "Whitney Port Talks Surviving the Holidays and Traveling with a New Baby", "meta_data": {"viewport": "width=device-width, maximum-scale=1.0, initial-scale=1.0, user-scalable=0", "googlebot-news": "noindex", "FacebookShareMessage": "As reality star and first-time mom Whitney Port anticipates spending Christmas with her in-laws, she shares her biggest parenthood challenges and the goals she's set for the year ahead.", "mdp": {"contentType": "story"}, "description": "As reality star and first-time mom Whitney Port anticipates spending Christmas with her in-laws, she shares her biggest parenthood challenges and", "fb": {"admins": 1561750258, "app_id": 72125855925}, "og": {"site_name": "Parents", "type": "article", "url": "https://web.archive.org/web/20171222091553/https://www.parents.com/parenting/celebrity-parents/moms-dads/whitney-port-talks-surviving-the-holidays-and-traveling-with-a/", "title": "Whitney Port Talks Surviving the Holidays and Traveling with a New Baby", "description": "As reality star and first-time mom Whitney Port anticipates spending Christmas with her in-laws, she shares her biggest parenthood challenges and", "updated_time": "2017-12-20T10:53:26-0500", "image": "https://web.archive.org/web/20171222091553im_/https://images.parents.mdpcdn.com/sites/parents.com/files/styles/scale_1500_1500/public/whitney_port_3.jpg"}, "article": {"section": "Parenting", "tag": "Baby's First Christmas", "published_time": "2017-12-19T13:46:14-0500", "modified_time": "2017-12-20T10:53:26-0500"}}, "movies": [], "publish_date": 1513709174.0, "source": "https://web.archive.org", "summary": ""}