{"url": "https://www.brides.com/story/gisele-bundchen-vogue-73-questions", "text": "Whether you're a Patriots or Buccaneers fan or not, you have to admit that Tom Brady and Gisele Bündchen's relationship is pretty adorable. The model and NFL quarterback have been together for 14 years and married for nearly 12—and are still going strong. From their secret engagement to the birth of their children, deflategate, and everything in between, here is a complete timeline of Tom Brady and Gisele Bündchen's relationship.\n\nTom Brady and Gisele Bündchen met through a mutual friend in December 2006 and quickly began dating.\n\nTom proposed the model in January 2009 and after a month-long engagement, the couple wed in California on February 26, 2009.\n\nThey are parents to two children: son Benjamin, 11, and daughter Vivian, 8. Tom is also father to son Jack, whom he had during a previous relationship.\n\nOn Sunday, February 7, Gisele and the couple's three children will cheer on Tom as he plays in Super Bowl LV for the Tampa Bay Buccaneers.\n\nDecember 2006: Meeting in New York\n\nTom and Gisele first met through a mutual friend at West Village wine bar Turks & Frogs in 2006. For the model, it was love at first sight and she later recalled to Vanity Fair, \"We met through a friend. The moment I saw him, he smiled and I was like, ‘That is the most beautiful, charismatic smile I’ve ever seen!’ We sat and talked for three hours. I had to go home for Christmas, but I didn’t want to leave. You know that feeling of, like, you can’t get enough? From the first day we met, we’ve never spent one day without speaking to each other.”\n\nJanuary 2007: Officially Dating\n\nGetty Images\n\nIt wasn't long after meeting each other that Tom broke up with his then-girlfriend Bridget Moynahan, and the quarterback and Brazilian model began dating.\n\nFebruary 2007: Tom's Baby With Another Woman\n\nBut their new relationship almost came to a screeching halt when Tom found out he would become a dad—but not with Gisele. In February 2007, Tom's ex-girlfriend Moynahan announced she was pregnant. The news almost forced the model to end her relationship with the football star. She later wrote in her memoir of the situation, “Two months into our relationship, Tom told me that his ex-girlfriend was pregnant. The very next day, the news was everywhere and I felt my world had been turned upside down.\"\n\nGisele later told Vogue in 2009, “I think it was a blessing, because otherwise I don’t think I would have known what he was made of, and he wouldn’t have known what I was made of. I wouldn’t have seen the integrity in him—the way he was a good person through all the times. I was like, You have the heart in a good place! It made me feel more in love with him; it made me realize who he was. Our relationship has become so much stronger, and I think I wouldn’t be as certain as I am today if it weren’t for that.\"\n\nAugust 22, 2007: Tom Becomes a Father\n\nOn August 22, 2007, Tom's child with ex Moynahan was born—a son named John \"Jack\" Edward Thomas Moynahan. In Gisele's 2018 memoir, the model revealed she calls Tom's son her \"bonus child,\" saying, \"[He made] my heart expand in ways I didn't know was possible.\"\n\nMay 5, 2008: First of Many Met Appearances\n\nGetty Images\n\nWhile Tom and Gisele have since become a staple on the Met Gala red carpet, their first appearance together occurred in 2008. The model wore a pink Versace gown to the event that year.\n\nJanuary 2009: Secretly Engaged\n\nTwo years into their relationship, Tom proposed to Gisele. While news outlets at the time reported that the romantic moment occurred amid a private flight, the couple later revealed the engagement happened at home. \"When he proposed to me, he made up this whole story how my apartment was flooding, and I ran over to fix the situation,\" Gisele told Vogue in 2018. \"When I got there, the whole apartment had candles and rose petals everywhere, and then he went down on his knees to propose, and I'm like, 'Get up!' because he just had surgery and had three staph infections. And I was like 'What are you doing?' He's like, 'I gotta go on my knees,' and I'm like, 'No, no, no! Get up, please!'\"\n\nFebruary 26, 2009: Private Wedding in California\n\nAnd just a month after getting engaged, Tom and Gisele wed during a private ceremony in Santa Monica, California on February 26, 2009. The couple only took 10 days to plan their wedding and the bride wore three wedding gowns for the occasion. The first was an off-the-shoulder lace gown with a lace-trimmed veil for the church ceremony.\n\nShe then changed into a sequin Dolce & Gabbana gown, which she accessorized with a flower in her hair.\n\nApril 2009: Another Wedding in Costa Rica\n\nAfter hosting a private, intimate ceremony of the beach in California, the couple wed a second time in April 2009 in Costa Rica—this time with extended family. Gisele tapped designer John Galliano for her destination wedding attire: a silk satin bias-cut gown and six-foot-long veil.\n\nDecember 8, 2009: Their First Son Together\n\nGetty Images\n\nGisele and Tom birthed their first son together on December 8, 2009, and named him Benjamin Rein Brady.\n\nDecember 5, 2012: Welcoming a Daughter\n\nAnd on December 5, 2012, the couple welcomed their second child together, a daughter whom they named Vivian Lake Brady.\n\n2015: Divorce Rumors and Deflategate\n\nWhile the NFL suspended Tom and the New England Patriots in May 2015 for using partially deflated footballs during the playoffs that year (an incident known as deflategate), Tom's marriage with Gisele also faced criticism. A source told US Weekly at the time that Tom and Gisele's marriage was \"tense\" over the scandal and in September of 2015 claimed, \"This could be the end of them.\"\n\nBut the rumors of divorce were put to rest by the star quarterback who said during a radio interview, \"We're in a great place, I'll just say that. I'm a lucky man. I've been very blessed with support from my family and certainly her, and there's no bigger supporter that I have than her and vice versa. I've been very blessed to have an incredible relationship with my life partner, and I don't think anything will ever get in the way of that.\"\n\nSeptember 2016: Supporting Her Husband\n\nIn the wake of the infamous deflategate scandal, Tom was suspended for four games at the start of the 2016 season. But Gisele was unphased by the brief suspension, writing on Instagram alongside a photo of the pair playing catch, \"Don't worry guys. I will keep him ready.\"\n\nJune 2018: How Much Longer in the NFL?\n\nGetty Images\n\nWhile Gisele ended her 20-year professional modeling career a few years back, Tom was still a star in the NFL. But in June 2018 told Oprah Winfrey about the conversations her has with his wife about ending his football career. \"\"I talk about it with my wife all the time. You can ask her tonight. She'll tell you, like, 'I told him, you know, what more do you want?'\"\n\nSeptember 2018: Gisele Publishes a Memoir\n\nTitled Lessons: My Path to a Meaningful Life, Gisele wrote about her adjustment to motherhood in her 2018 memoir. She admitted the couple struggled after welcoming their first child together in 2009, writing, \"You’re overwhelmed and tired when you’re not the nicest partner. When someone you love is happy, it makes you happy. Or if they’re sad, it makes you sad. You suffer with them and you have joy with them.”\n\nFebruary 3, 2019: Another Super Bowl Win\n\nGetty Images\n\nTom clinched his sixth Super Bowl win when the New England Patriots defeated the Los Angeles Rams in Super Bowl LIII on February 3, 2019. Of course, Gisele attended the game with the couple's children and they rushed to greet the champion on the field after the win.\n\nFebruary 26, 2019: 10-Year Anniversary\n\nTom and Gisele celebrated 10 years of marriage on February 26, 2019, and marked the occasion with gushy Instagram posts. \"Ten years ago, I didn’t realize how much I could love you and the family we created together,” Tom wrote alongside a wedding photo. “My heart is so full and I am so blessed! I know our journey has not been easy, but the challenges we have overcome have made our bond stronger and our love grow deeper. Thank you for loving me, for supporting my dreams, and for nurturing our family in the way that only you could. You are my rock, my love and my light! I love you and I love our family!”\n\nGisele imitated his sentiments, writing, \"I can’t believe it’s already been 10 years since we’ve chose to walk this life together... and what incredible 10 years we’ve had! There is nothing that I love more in this world than you and our family. Thank you for being on this journey with me and for doing the work that it takes to make it so special. May we continue growing together, walking side by side supporting and loving one another for many many years to come. Te amo tanto\n\nMarch 17, 2020: Trading Boston for Tampa Bay\n\nOn March 17, 2020, Tom announced that he signed with the Tampa Bay Buccaneers after 20 years playing for the New England Patriots. The football news also impacted his family: Tom and Gisele, along with their kids, would be moving to Florida.\n\nJanuary 24, 2021: Heading to the Super Bowl\n\nTom is no stranger to the Super Bowl and on January 24, 2021, the quarterback and the Buccaneers secured a spot in the 2021 championship game after defeating the Green Bay Packers.\n\nFebruary 7, 2021: Super Bowl Win in Tampa Bay\n\nGetty Images\n\nBrady finished his first season as a Tampa Bay Buccaneer with a Super Bowl win—in Tampa Bay nonetheless! Tom led the team to defeat the Kansas City Chiefs, led by quarterback Patrick Mahomes, 31-9. Of course, Gisele and their children were in the stands during the game and rushed to the field to celebrate when the game was won.", "images": ["https://www.brides.com/thmb/lizWLuswEUIHLyB2HY9LdtVj08Q=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1339527534s-91048bf344aa4761897f6e82d640d60f.jpg", "https://www.brides.com/thmb/D3d2zBNGEsxymeWsPo5YJKPSgYI=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1131309775-5128a3e3bd234b59ac36bc7d3d0bebc1.jpg", "https://www.brides.com/thmb/Wzf_tJTFpu6e4dEf9wnXMlv7nCg=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1071537420-44f5c2ee601044a096ff31230f9c765e.jpg", "https://www.brides.com/thmb/TCmQYLBI5B6rMexEWu_RjmbGROA=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1205146832-0c34a2eaa1794ae5af2f25bfde7cff67.jpg", "https://www.brides.com/thmb/NeCmkCj094Q5ZdSr1JWoOZbmUMg=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/rob-gronkowski-and-camille-kostekRECIRC-2f6ca0aeee8848aa88a92cdc181c131d.jpg", "https://www.brides.com/thmb/uZ_DWK0b0qHhmB_mSKGcgIx5NPs=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/scarlettandcolinlead-131fd63b489841a49625aefe5577d358.jpg", "https://www.brides.com/thmb/NsTRPRnKWJzrOby7g9E9Ue76qoU=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/kourtney-and-travis-square-aab09d5abb6941439103fcdc0ed5f9c3.jpg", "https://www.brides.com/thmb/tW46lO319EfHs2QgmPigjlL-YfA=/1200x630/filters:fill(auto,1)/GettyImages-1147430695-c2babbd83f5d49fca57fdab204ec2f13.jpg", "https://www.brides.com/thmb/CpScQR7dZKa7dgURvBl7FdJNsP4=/200x200/filters:no_upscale():max_bytes(150000):strip_icc()/DSC03763-54bce324f1bd48f5af0910efb178cb7e.jpg", "https://www.brides.com/thmb/dD4wwlXTYgHXySr6PU2bPAajAGk=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__5aa2d493dd16d925572d58dd__11-0c2b618422d849c1b02d96869da75d48.jpeg", "https://www.brides.com/thmb/ocfPFTOLXU-4-kpFqg37XzG2Sik=/1725x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-80207719-0afb2c06489841d7b0e6ed4419d68f91.jpg", "https://www.brides.com/thmb/APm7zypz_Yu-4hyYgMC4-80RZHY=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1138978659-6f4c1e0b72c64de49d003429ec4f0014.jpg", "https://www.brides.com/thmb/ZVDXgovzzn7XU6rmm74yL_rNlZk=/1725x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-955759072-127a33a848854e9eae9ccb8cfd482553.jpg", "https://www.brides.com/thmb/E0meD9vMC5oTCeorFT-WGUi-wS8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():gifv()/GettyImages-1147430695-c61c71b665dd48e6a0713526a8e1b516.jpg", "https://www.brides.com/thmb/eCprZrTjevVTCgpnozQYxnbz0rQ=/2145x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1093458304-644c2c427ca747958a442d38503364cd.jpg", "https://www.brides.com/thmb/h_aF8Owheqe_0bWDQzPJrJ6sHwA=/2145x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1300926028-f094af315ea74ea7885d66ee3e31f6cc.jpg", "https://www.brides.com/thmb/Cg3534n5ZhDOxodcZOXJXB_Z9i0=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/DavidLivingstonGetty-d1e2e142b6ce40f58fcf8f52c605365b.jpg", "https://www.brides.com/thmb/eCNpw-yxqjj9x09HMPYieJvWDu8=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1267433253-e0603460e85d4648922ce5fafcd71806.jpg", "https://www.brides.com/thmb/KYCL5qQx0M3tXJUBCvos6ls_NgM=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1340141691-9766e6ff278d432791b8b94568ca1f59.jpg", "https://www.brides.com/thmb/NjByaK9SnDE1YylHxPAV6BsWYwk=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-918665014-9336284d493c439b9109c1a527f9b3d7.jpg", "https://www.brides.com/thmb/XjbL7FzKwkW9-GvxxQ3CM32lOq8=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-159857771-7fd78f067a4945608345806ae1c5e153.jpg", "https://www.brides.com/thmb/pWFwc1GoobZlHxdmVYu145iZY7g=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1370411633-7b1d079e5d194ede8e46d9d0e0b754b2.jpg", "https://www.brides.com/thmb/ZHet2T1zjkoVHhQ57Sm7oVAx2Vw=/1725x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-80997733-dc06cfcceba641adb22e37bd1b80d8f1.jpg", "https://www.brides.com/thmb/YXWKBCKs--8Q8MGoc7nwbUw3KWU=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1127327658-0678edc4fda94395b3750c4f6103b68e.jpg", "https://www.brides.com/thmb/ifob7RIvvHLs7q5JKaL-_zgyv-g=/1725x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-172512109-c8786b7dff2247f6a82cc4b77f1a404e.jpg"], "top_img": "https://www.brides.com/thmb/tW46lO319EfHs2QgmPigjlL-YfA=/1200x630/filters:fill(auto,1)/GettyImages-1147430695-c2babbd83f5d49fca57fdab204ec2f13.jpg", "keywords": [], "authors": ["Maggie Kreienberg", "Maggie Kreienberg Is An Editor At", "Brides'S Editorial Guidelines"], "canonical_link": "https://www.brides.com/tom-brady-gisele-bundchen-relationship-timeline-5104796", "title": "Tom Brady and Gisele Bündchen's Relationship Timeline", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Tom Brady and Gisele Bündchen have been married for almost 12 years. Here is a complete timeline of their relationship.", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "BRIDES", "sailthru.author": "Maggie Kreienberg", "sailthru.tags": "news,celebrity-and-royal-weddings", "article": {"section": "Brides"}, "fb": {"app_id": 785196361567992}, "og": {"type": "article", "site_name": "Brides", "url": "https://www.brides.com/tom-brady-gisele-bundchen-relationship-timeline-5104796", "title": "Tom Brady and Gisele Bündchen's Relationship Timeline", "description": "Tom Brady and Gisele Bündchen have been married for almost 12 years. Here is a complete timeline of their relationship.", "image": "https://www.brides.com/thmb/tW46lO319EfHs2QgmPigjlL-YfA=/1200x630/filters:fill(auto,1)/GettyImages-1147430695-c2babbd83f5d49fca57fdab204ec2f13.jpg"}, "twitter": {"card": "summary", "site": "@Brides", "title": "Tom Brady and Gisele Bündchen's Relationship Timeline", "description": "Tom Brady and Gisele Bündchen have been married for almost 12 years. Here is a complete timeline of their relationship.", "image": "https://www.brides.com/thmb/e_vDn6_2-SaYdLv808zRZ3n3_d4=/753x1024/filters:fill(auto,1)/GettyImages-1147430695-c61c71b665dd48e6a0713526a8e1b516.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.230.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.230.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.230.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.230.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.230.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://www.brides.com", "summary": ""}