{"url": "https://en.wikipedia.org/wiki/Puppy_Bowl", "text": "Parody of the Super Bowl involving domestic dogs instead of humans, hosted by Animal Planet\n\nThe Puppy Bowl is an annual television program on Animal Planet that mimics an American football game similar to the Super Bowl, using puppies.[2] Shown each year on Super Bowl Sunday, the show consists of footage of a batch of puppies at play inside a model stadium,[3] with commentary on their actions. The first Puppy Bowl was shown on February 6, 2005, opposite to Super Bowl XXXIX. The puppies featured in the Puppy Bowl are from shelters.[4] The entire program is designed to raise awareness about adopting pets from shelters and rescuing abandoned animals.[5]\n\nProduction [ edit ]\n\nAccording to the show's producers, the inspiration for Puppy Bowl as Super Bowl counterprogramming came from the popular Yule Log Christmas program.[2][6][7][8]\n\nSeveral months of planning occur before each show, which is usually shot in October.[9][10][11] A veterinarian is on site during the production of Puppy Bowl to ensure animal safety and well-being, and to administer any veterinary medical care which might be needed.[4][13] Representatives from American Society for the Prevention of Cruelty to Animals, as well as the shelters which lend their animals to the production, are also on-site as observers to ensure animal welfare standards are maintained.[4][13] In 2012, an American Humane Association representative was always on-site to ensure that puppies did not become too aggressive and injure one another.[14]\n\nAccording to its associate producer, about 53 hours of videoing are needed to produce a single Puppy Bowl.[4] In 2007, shooting occurred over three days.[2] Roughly 30 staff members were needed in 2008 to produce the show.[2] In 2010, the veterinarian on site said shooting was spread over three days, while in 2015 the videoing occurred in 12-hour blocks over two days.[9] Puppies are given a rest period every 30 minutes, due to the heat from the lights.[4] Forty-six puppies were used in 2008,[2] and about 60 puppies in 2010. The 2011 production occurred in the New York City area in the fall of 2010, using 47 puppies,[3][6] while the 2012 show featured 58 puppies.[15] The 2013 show (shot at a television studio in west midtown in Manhattan) featured 63 puppies, with 10 on the field at one time.[14] Shooting occurred over two days. The 2014 episode was videoed October 2 to 4, 2013, at the Chelsea Broadcast Center in Manhattan, New York City. A staff of 49 Animal Planet employees and 48 volunteers wrangled the animals, with each puppy assigned a single human overseer.[1] Cats were shot the first day, dogs the second, and other animals on the fourth.[1] A total of 66 puppies were used for the show in 2014,[16] including a basset hound with a genetic defect to its paw.[17] This allowed 12 to 15 puppies to be on the field at a time, and for puppies to be given rest periods every 20 minutes.[1] Another 30 untrained kittens, five penguins, three trained adult cats, eight \"tailgate party\" dogs, four police dogs, and six hamsters were used in the 2014 show.[1] All the animals except the penguins (which were provided by the Columbus Zoo and Aquarium) are adoptable.[1] In 2015, 37 shelters from around the United States and Puerto Rico submitted 85 puppies for the event, of which 55 puppies were chosen to be on the air. Another 25 kittens were used for the half-time show.[9] Forty-four shelters and rescue groups in 25 states provided 49 animals in 2016.[18][10][19] (Eighty-eight animals \"auditioned\".)[20] Videoing returned to an eight-hour-a-day, three-day format in 2016, with two days used for videoing puppies and one day for kittens and other animals. Sixty personnel were needed for shooting.[10] Puppies were grouped by size (small, medium, and large) for on-field play.[21] For Puppy Bowl XIII, 34 shelters and rescue organizations in 22 states and Puerto Rico provided the 78 puppies featured on the show.[11][22]\n\nPuppy Bowl is shot inside a miniature Plexiglas \"stadium\" that is 19 feet (5.8 m) long by 10 feet (3.0 m) wide.[1][2][14][10] Only puppies between 12 and 21 weeks old are allowed on the show,[17] and there is a height and weight limit due to the size limitations of the play area.[2] Puppies must show that they are well-socialized with people and with other puppies, and that they have the full range of vaccinations.[23] A wide variety of toys are placed inside the \"stadium\". Although there is no minimum or maximum limit on how many toys may be in the stadium, show producers say that toys which make the loudest noise or which are sausage-shaped get the most attention. Toys are usually switched out every 20 minutes, and often more frequently.[1] Peanut butter is smeared around camera lenses to induce the puppies to lick the camera.[17][10] About 80 ounces (2,300 g) of peanut butter are used for the taping, along with 15 pounds (6.8 kg) of dry dog food, 500 dog treats, and 250 toys.[24]\n\nThe various cameras used to tape the show generated about 50 hours of footage in 2011,[2] but more than 90 hours in 2012 (for the 2013 airing).[14] Some cameras are placed inside toys, to give a puppy's-eye view of the action. In 2015, 18 cameras were used, and several weeks were needed to edit the footage into a two-hour program.[9] Fifteen cameras were used in 2016,[25] and more than 100 hours of footage generated for the 2017 show.[24]\n\nThe first five Puppy Bowls were narrated by Harry Kalas, a narrator for NFL Films and longtime play-by-play voice of the Philadelphia Phillies.[2][26] The Puppy Bowls from 2010 to 2011 were narrated by Jeff Bordner and then by Scott Graham from 2012 until 2020.\n\nFormat [ edit ]\n\nThe Puppy Bowl consists of a number of puppies playing in a model stadium (\"GEICO Stadium\") with no audience (but with canned audience cheering), minimal commentary, and instant replay shots. A \"bowl cam\" provides shots upwards through the transparent bottom of a special water bowl built into the stadium floor, with a wide-angle lens that allows viewers to watch the puppies drink water (and walk through it) up close.[2] Ten full-size digital cameras and five GoPro miniature digital cameras were used in 2014 to capture the action. These numbers include the hidden cameras in the water bowl and toys.[1]\n\nA human \"rufferee\" watches over the \"action on the field.\" In the first few years of Puppy Bowl, this was a crew member randomly selected each year. Beginning in 2008, it was Animal Planet associate producer Andrew Schechter.[4][6] For the 2012 Puppy Bowl, Schechter was replaced by SportsNet New York and Beer Money! host Dan Schachner,[27] who has hosted the show ever since.[1][16][9][10][11] He auditioned by submitting a tape showing him trying to organize a dog football game among unwitting dog-owners at a public park.[10] Football terminology is often used by the announcer and referee to illustrate the puppies' behavior and actions. When a puppy drags one of the football-shaped toys into the end zone, a \"puppy touchdown\" is declared.[6] There are no hard-and-fast rules about what constitutes a score. (In Puppy Bowl IX, there was a double-touchdown, as puppies with toys raced into each end zone simultaneously.[9] In 2016, a \"team touchdown\" occurred as two puppies carried the same toy into the end zone.[25])\n\n\"Penalties\" are issued for puppies relieving themselves on the field. Timeouts are called if the water bowl needs to be refilled, or if the puppies begin to fight (a behavior called \"unnecessary rrruff-ness\").[2] The show uses puns to mimic the rules of professional football, including paws interference (pass interference), ruff sides (offsides), and dog-collar tackle (horse-collar tackle). Unique \"penalties\" called may also include howling, illegal bathing (playing in the water bowl), napping on the field, premature watering of the lawn (urination),[1] \"excessive fertilization\" (defecation), \"neutral bone infraction\" (neutral zone infraction), and \"ineligible retriever downfield\" (ineligible receiver downfield).[10] Three special \"penalty calls\" were introduced in 2015: \"Terrorizing the ref\" (for a puppy who acts aggressively toward the referee), \"paws interference\" (for when a puppy blocks another) and \"pancaking\" (for when a tired puppy sprawls on the floor instead of playing).[28]\n\nEach year, a Most Valuable Puppy (or MVP) is chosen at the end of the show for the puppy considered to be the stand-out performer of the event. Beginning with Puppy Bowl XI, viewers were allowed to vote for the MVP. MVP voting was permitted for the program’s airing.[9]\n\nAlthough puppies may urinate or defecate on the field as frequently as once every 20 seconds, all but one of the incidents is edited out of the show.[1] In 2016, 315 plastic bags were needed to retrieve feces, and more than 1,500 absorbent pads used to clean up urination.[10] Puppies occasionally engage in sexual activity, but this is edited out of the program.[10]\n\nThe running time of Puppy Bowls I through IV was 180 minutes (including commercials). The running time of Puppy Bowl V was decreased to 120 minutes (including commercials). Jessie Dinh, producer at Discovery Studios, explained the reason for the decrease: \"We only did two hours this year so that we had the opportunity to include some other fun elements.\"[29]\n\nTeam Ruff vs. Team Fluff [ edit ]\n\n2015's Puppy Bowl XI introduced team-based competition to Puppy Bowl for the first time. Puppies were divided into two teams, Teams \"Ruff\" and \"Fluff\", each identifiable by a different colored bandana worn throughout the event. Points were tallied on a scoreboard powered by a hamster running on a wheel. The team with the most points was declared the victor.[30][9] Team Ruff overwhelmed their opponents 87-to-49 to become the first-ever Puppy Bowl champions.[31]\n\nIn Puppy Bowl XII, Team Ruff won again by a score of 70–44.[32][25]\n\nIn Puppy Bowl XIII, Team Fluff upset the heavily favored Team Ruff by a score of 93–38.[33]\n\nIn Puppy Bowl XIV, Team Fluff won again in a close margin of 52–47.[34]\n\nIn Puppy Bowl XV, Team Ruff overturned Team Fluff's winning streak by a score of 59–51.[35]\n\nIn Puppy Bowl XVI, Team Fluff returned to winning by a score of 63–59.[36]\n\nIn Puppy Bowl XVII, Team Ruff's incredible 4th quarter comeback gave them the win by a score of 73-69. Most Valuable Puppy Marshall scored a double touchdown.[37]\n\nIn Puppy Bowl XVIII, Team Fluff won on a game-winning touchdown when time expired, which gave Team Fluff a 73-69 win.[38]\n\nKitty Half-Time Show [ edit ]\n\nStarting with Puppy Bowl II, at the 1 hour, 15 minute mark, the puppies leave the field and a large scratching post is brought out with a wide variety of kittens for the Kitty Half-Time Show. This features kittens playing for 30 minutes with lights, laser pointers, balls of yarn, a scratching post, flint sweepers, and a wide variety of other toys. The grand finale of the Puppy Bowl II Half-Time Show was a confetti blast that sent most of the cats running away scared. Puppy Bowl III did not show the cats' departure from the field. The halftime show of Puppy Bowl IV in 2008 was only 15 minutes in length. In 2012, Animal Planet said that 20 kittens would be part of the Kitty Half-Time Show.[15] This number increased to 21 for the 2013 airing.[14] All the kittens are also animals from shelters, and are adoptable.\n\nThe \"stadium\" is outfitted with a variety of scratching posts and toys that move to interest the kittens and encourage them to move about. This does not usually work, however, and catnip is distributed over the set to help the kittens be more active and interested in their surroundings.\n\nOther features [ edit ]\n\nIn 2009, a model blimp (supposedly floating over the Puppy Bowl) was added.[39] The \"blimp\" mimics the appearance of the Goodyear Blimp over many outdoor football events. Shots of the puppies at play were green-screened into the windows to make it appear as if the \"blimp\" was actually hovering over the field. Inside the model of the blimp's control room, hamsters are allowed to play (as if they were the crew of the blimp).[6][39] The blimp returned in 2010, 2011, 2012, 2013, 2014, 2018, 2019, and 2020.\n\nBeginning in 2010, \"bunny cheerleaders\" (rabbits) were shown, as if these animals were on the sidelines. In 2011, the \"bunny cheerleaders\" were replaced by \"chicken cheerleaders\" (hens and roosters).[6] The bunnies and chickens were replaced by five pigs in a \"Piggy Pep Squad\" in 2012.[15] Hedgehog cheerleaders were introduced for 2013, and replaced with penguins in 2014.[40]\n\nAlso beginning in 2010, the American Animal Hospital Association (AAHA) began sponsoring the Puppy Bowl.[41][42] A veterinarian was shown giving each puppy a physical prior to participation, provided care to any animal which might appear injured, and provided tips to viewers about proper animal care. Dr. Elisa Mazzaferro, Director of Emergency Services at Wheat Ridge Animal Hospital in Denver, Colorado, provided the official on-camera care for the puppies and other animals.[43]\n\nA new element for 2011 was a parody of the popular \"Kiss Cam\" used at sporting events. The \"Kiss Cam\" returned from 2012 through 2020.[27]\n\nTwo other new elements were added in 2012: a cockatiel named Meep \"tweeted\" about the game from the sidelines (using the Twitter social media network), and Jill Rappaport, a TV reporter and animal advocate, provided color commentary.[27]\n\nThe hamsters in the blimp and Meep the \"tweeting\" cockatiel were retained for the 2013 show, but the piglet cheerleaders were replaced by baby hedgehogs in tutus.[14][44][45] Owners of hedgehogs volunteered the use of their animals for the show. The tutus, however, did not stay on the animals. A new \"Puppy Cam\" (a miniature wide camera attached to a puppy's collar) was added in place of the \"Kiss Cam\", to provide viewers with a puppy's-eye-view of the action. A new feature in the 2013 game is the \"Cute Cam,\" the slow-mo camera. Additionally, the human \"stars\" of Animal Planet's reality TV shows were added in 2013 as commentators. Another addition is a \"special puppy hot tub\" (a large pan of water) in which puppies will relax prior to or after their time on the field.\n\nFor the 2014 edition of the Puppy Bowl, the tenth anniversary of the show, First Lady Michelle Obama opened the show with footage of puppies being \"trained\" for the Puppy Bowl on the South Lawn of the White House.[46] Police dogs appeared on the field when the national anthem was played.[47] Returning as the official \"tweeter\" of the show was Meep the cockatiel.[40] The dwarf cat Lil Bub was added as a \"commentator\" broadcasting from a Chicago studio.[47] In reference to the Super Bowl's halftime show with Bruno Mars, Keyboard Cat \"played\" his song \"Locked Out of Heaven\" during the halftime show.[47] The half-time show also featured 30 kittens toppling dominoes and a kitten \"parachuting\" onto the field.[47] To increase interactivity with fans of the show, the Puppy Bowl X online site allowed fans to play a \"Fantasy Puppy League\" (similar to fantasy football) featuring the 2014 puppies, gave fans the chance to vote for the \"Most Valuable Puppy\" during the event, and gave viewers the opportunity to post photos of their own animals and Puppy Bowl parties via Instagram.[40][47] Entertainment Weekly reporter James Hibbered commented on the changes by noting, \"Animal Planet is simply embracing viral-video favorites and ratcheting up the sports-spoof silliness to a new level this year.\"[47]\n\nAnimal Planet established a \"Puppy Bowl Experience\" at the Discovery Times Square exhibition space. The \"experience\" included a 15,000 square feet (1,400 m2) area where people could play with puppies, a recreation of the Puppy Bowl set, and advertising sponsor areas.[7][40]\n\nAn emphasis on adopting pets from shelters became a focus of the show in 2014 as well. A total of 33 shelters from 18 states and the territory of Puerto Rico supplied shelter animals (dogs, cats, hamsters, etc.) for the Puppy Bowl.[1] All the animals on the show (except for the penguins) are shelter animals, and usually all are adopted by the time the show airs.[1] Throughout the program, updates on the status of each of the adopted puppies was given. Throughout the program, however, the adoption journey of Rosie (now named Scout), a three-month-old Chihuahua/terrier mix, was followed from her arrival at the shelter to her life with her new family.[23]\n\nPuppy Bowl XI featured five Nigerian dwarf goats as cheerleaders. \"Katty Furry\", a cat depicted playing Katy Perry songs in YouTube videos, was the \"half-time performer\".[9] MVPs were chosen in each of the program's first three airings. Puppies were divided for the first time into teams, and a hamster-powered scoreboard kept score.[9] Celebrities such as Andy Cohen, Whitney Cummings, and Reese Witherspoon appeared on the program to root for \"their team\", and an animated short featuring The Simpsons played during the show. Animals with substantial followings on Instagram had images submitted, showing their support for each team as well.[18] A fantasy football draft was introduced to allow fans to pick the puppy they felt would score the most points.[citation needed]\n\nPuppy Bowl XII was preceded by \"Road to the Puppy Bowl\" events across the United States in fall and winter 2015. Local animal shelters and rescue groups partnered with Animal Planet on these events, during which thousands of animals were adopted.[18][19] Turbo the tortoise[20] suffered a wardrobe malfunction (inspired by the Super Bowl XXXVIII halftime show controversy) during the half-time entertainment. Silkie chickens served as cheerleaders, and a skunk helped referee the show.[10]\n\nThe 2017 Puppy Bowl XIII featured three special-needs dogs: Doobert, who is deaf; Lucky, who had her right front leg amputated; and Winston, who is both sight- and hearing-impaired.[11][48] An hour-long \"pre-game show\", scheduled to air an hour prior to the Puppy Bowl, and a \"Puppy Bowl Virtual Reality\" feature (the game seen through the eyes of a puppy), were also added. Halftime entertainment featured \"Kitty Gaga\" and the Chicago Rock Cats.[13][24] Guinea pigs and rabbits were the 2017 cheerleaders, and famous pets of Instagram returned.[24] For the first time, Team Ruff and Team Fluff competed for the fictional \"Lombarky Trophy\" (a parody of the Lombardi Trophy), and each team had a mascot (a rescued screech owl for Team Ruff, and a rescued chinchilla for Team Fluff).[49]\n\nIn Puppy Bowl XVII, there were puppy “cheerleaders” for both teams on their respective sidelines.[50] In Puppy Bowl XVI, the cheerleaders were armadillos for Ruff and goats for Fluff.\n\nPuppy Bowl results [ edit ]\n\nEpisodes [ edit ]\n\nNo. Puppy Bowl Original air date US viewers\n\n(millions) 1 Puppy Bowl I February 6, 2005 ( ) 0.150[52] 2 Puppy Bowl II February 5, 2006 ( ) 6.555[53] 3 Puppy Bowl III February 4, 2007 ( ) 7.5[53] 4 Puppy Bowl IV February 3, 2008 ( ) N/A 5 Puppy Bowl V February 1, 2009 ( ) 1.152[54] 6 Puppy Bowl VI February 7, 2010 ( ) 1.1[3] 7 Puppy Bowl VII February 6, 2011 ( ) 1.7[55] 8 Puppy Bowl VIII February 5, 2012 ( ) 1.6[56] 9 Puppy Bowl IX February 3, 2013 ( ) 2.631[57] 10 Puppy Bowl X February 2, 2014 ( ) 3.254[58] 11 Puppy Bowl XI February 1, 2015 ( ) 2.767[59] 12 Puppy Bowl XII February 7, 2016 ( ) 2.198[60] 13 Puppy Bowl XIII February 5, 2017 ( ) 2.47[61] 14 Puppy Bowl XIV February 4, 2018 ( ) 3.05[62] 15 Puppy Bowl XV February 3, 2019 ( ) N/A 16 Puppy Bowl XVI[51] February 2, 2020 ( ) 1.85[56] 17 Puppy Bowl XVII February 7, 2021 ( ) 2.11[56] 18 Puppy Bowl XVIII February 13, 2022 ( ) 1.73[56] 19 Puppy Bowl XIX February 12, 2023 ( ) TBD\n\nReception [ edit ]\n\nRatings [ edit ]\n\nPuppy Bowl III, which aired on February 4, 2007, had 7.5 million viewers.[2]\n\nPuppy Bowl IV, which aired on Animal Planet on February 3, 2008, had more than 8 million viewers for all its broadcasts, for a total increase of 1060 percent from its first airing in 2005.[63] It was also the first Puppy Bowl broadcast in high definition.[63]\n\nPuppy Bowl VI aired on February 7, 2010, and a record 1.1 million viewers watched the first broadcast alone.[3]\n\nPuppy Bowl VII aired on February 6, 2011 with a total of 9.2 million viewers over the twelve hours it was aired. The actual premiere drew 1.7 million viewers, up 60 percent from last year.[55] Puppy Bowl VII in 2011 had a total 9.2 million estimated viewers for all airings.[64]\n\nPuppy Bowl VIII aired on February 5, 2012. This airing was the second most-watched social television program in America, with more than 10 million viewers over five airings.[65] This included an increase of 17 percent in ratings in its target demographic group (adults age 25-to-54).[44] More than 200,000 Puppy Bowl-related tweets were made on that day.[65]\n\nPuppy Bowl X aired six times over 12 hours on February 2, 2014, with new content added for each airing.[1] A record 13.5 million people watched the show's six airings.[28]\n\nPuppy Bowl XI aired on February 1, 2015, and was watched by 2,767,000 viewers in its initial airing.[66][19]\n\nPuppy Bowl XII aired on February 7, 2016, and was watched by about 2.2 million viewers in its initial airing (a drop of about 21 percent over 2015),[19] and 9.3 million viewers (including time-shifted viewing) over all airings. It was the number one non-sports program on cable among adults aged 25-to-54 and among women aged 18-to-49 during its initial 3 PM-to-5 PM airing. It was the number two most-watched program on all television (cable and broadcast) from 3 PM-to-5 PM among adults aged 25-to-54 and among women aged 18-to-49. Only the Super Bowl itself had more viewers. This was the fourth year in a row that the Puppy Bowl's initial airing was the second most-watched program in the nation those demographic groups.[18]\n\nPuppy Bowl XVI aired on February 2, 2020.[51]\n\nPuppy Bowl XVII aired on February 7, 2021.\n\nPuppy Bowl XVIII aired on February 13, 2022.\n\nAdvertising revenue for the 2013 show was up 19 percent over 2012, and drew a number of new advertisers. For the first time, Animal Planet allowed commercial branding of its \"stadium\" in 2013 as well. It was referred to throughout the program as the \"GEICO Puppy Bowl Stadium\".[44] An aggregate of 12.4 million viewers watched part of all six airings of the Puppy Bowl in 2013.[7][47]\n\nAdvertising revenue for the 2014 Puppy Bowl rose 30 percent over 2013. Three new companies became sponsors of the show, and Mars, Incorporated's Sheba cat food company sponsored a new \"cat VIP suite\".[7]\n\nSpin-offs and competition [ edit ]\n\nPuppy Games [ edit ]\n\nA spinoff of the Puppy Bowl, known as Puppy Games, aired opposite NBC's primetime broadcast of the opening ceremonies of the 2008 Summer Olympics on August 8, 2008. The Puppy Games included swimming, gymnastics, boxing, and soccer, and kittens were used for the \"opening ceremony.\" John Ramey and Mary Beth Smith, respectively, served as the play-by-play announcer and color commentator for the event.[67]\n\nDog Bowl [ edit ]\n\nAnother spinoff, the Dog Bowl, aired on February 3, 2018, a day before Puppy Bowl XIV. It features 50 dogs ages 2–15 years separated into \"Oldies\" and \"Goldies\" and promotes the adoption of older dogs.[68] A second edition, Dog Bowl II, aired February 2, 2019.[69] A third edition, Dog Bowl III, aired on February 1, 2020.[51]\n\nCompeting shows [ edit ]\n\nThe Puppy Bowl is the inspiration for Hallmark Channel's Kitten Bowl, which first aired in 2014.[46]\n\nThe Puppy Bowl also inspired the Fish Bowl, four hours of goldfish swimming in a bowl, which first aired in 2014 on the Nat Geo Wild cable network.[46]\n\nIn 2018, Blizzard hosted an Overwatch-themed Puppy Rumble featuring two teams of puppies playing capture the flag to celebrate in Year of the Dog in-game event and promote adoption.[70] The event was broadcast live on Twitch.[71]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/a/a7/Puppy_Bowl.png/250px-Puppy_Bowl.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/a/a7/Puppy_Bowl.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/a/a7/Puppy_Bowl.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Puppy_Bowl", "title": "Puppy Bowl", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/a/a7/Puppy_Bowl.png", "width": 640, "height": 586}, "title": "Puppy Bowl - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}