{"url": "http://www.cq.com/doc/newsmakertranscripts-4315109", "text": "Reps. Cummings and Cole Interviewed on MSNBC\n\nSCARBOROUGH:\n\nWith us now, Republican Representative from Oklahoma Congressman Tom Cole and Democratic Representative from Maryland, Congressman Elijah Cummings.\n\nBRZEZINSKI:\n\nHere to give us hope.\n\n(LAUGHTER)\n\nCOLE (?):\n\nOh, wow.\n\n(CROSSTALK)\n\nBRZEZINSKI:\n\nRight?\n\nCUMMINGS (?):\n\nThat's a tall order.\n\n(CROSSTALK)\n\n(LAUGHTER)\n\nSCARBOROUGH:\n\nSo, I -- really quick, we just need -- let -- let's talk really briefly, then we're gonna get into a lot of other topics. We've been talking a lot about the Zimmerman verdict. Really quickly, what's your take on it?\n\nCUMMINGS:\n\nI was very saddened by it. And I was just telling Eugene I thought he wrote the very best article that I have...\n\nBRZEZINSKI:\n\nYeah.\n\nCUMMINGS:\n\n... read on this issue. I -- I got to tell you, when I talk to African-American parents, their biggest fear, Joe, is that their children are going to be profiled...\n\nSCARBOROUGH:\n\nRight.\n\nCUMMINGS:\n\n... and their children are going to be harmed, black boys in particular.\n\nSCARBOROUGH:\n\nRight.\n\nCUMMINGS:\n\nAnd -- and I thought it was a travesty. And -- and while I understand, as a lawyer, the reasonable doubt standard is a very high standard.\n\nSCARBOROUGH:\n\nYeah, yeah. Exactly.\n\nCUMMINGS:\n\nAs Eugene said, Trayvon was not given the benefit of any doubt whatsoever from the very beginning.\n\nSCARBOROUGH:\n\nYeah.\n\n(CROSSTALK)\n\nCUMMINGS:\n\nHe was definitely profiled.\n\n(CROSSTALK)\n\nCUMMINGS:\n\nAnybody who says he wasn't, they're lying.\n\nSCARBOROUGH:\n\nBy the time he got to the court -- and we said this at the very beginning of the case...\n\nBRZEZINSKI:\n\nRight.\n\nSCARBOROUGH:\n\n... the prosecution, I mean, had an extraordinarily difficult...\n\nCUMMINGS:\n\nYeah, it was a difficult...\n\nSCARBOROUGH:\n\n... case to make. Cause you -- you didn't know who was screaming. And he just -- reasonable doubt is a high standard, especially in those charges.\n\nSo -- so -- I -- I've been talking about conservatives, you know, a lot of the conservative sites, a lot of conservative talkers immediately rushed to Zimmerman's defense, reflexively rushed to Zimmerman's defense and said, \"You know, we want to move beyond 6 percent in national elections with African-Americans. We -- we might want to just work on trying to understand what it's like having a -- a -- a 17-year-old son, and what it's like every time that 17-year-old son goes into a different neighborhoods.\"\n\nCOLE:\n\nYeah, well, I think you to -- from the very beginning recognize, look, this guy didn't have any business following that kid.\n\nSCARBOROUGH (?):\n\nYeah.\n\nCOLE:\n\nHe just should not have done it. There was no reason to do it. He called the police. They told him not to do it. And he goes out, has a gun. What we don't know is what happened in the encounter. That's where you run into the reasonable doubt standard.\n\nSCARBOROUGH:\n\nRight.\n\nCOLE:\n\nThere's one thing about what happened in the incident, but it's an incident, you know -- Zimmerman's not blameless. He should have never been there. He just should have never been there. And, you know, nobody should have to deal with what the families are going through. And, you know, hopefully out of this really awful incident, you know, we'll look inside, reflect a little bit as a society. We got some big lessons to learn here.\n\nSCARBOROUGH:\n\nBig lessons to learn.\n\nLet's talk about the House. You -- you guys are going to give us hope?\n\nBRZEZINSKI:\n\nYes.\n\n(LAUGHTER)\n\nSCARBOROUGH:\n\nLet's -- let's start -- have to change what we we're saying outside.\n\n(LAUGHTER)\n\n(CROSSTALK)\n\nBRZEZINSKI:\n\nDid you have different (inaudible)?\n\n(CROSSTALK)\n\nBRZEZINSKI:\n\nWhat was the plan?\n\nCUMMINGS:\n\nWe were just talking about the Farm -- we were talking about the Farm Bill and how -- I mean, you've got 60 or so tea partiers who get very upset. And they want you to, you know, reduce the SNAP program and food stamps more and more.\n\nAnd then, on the other hand, you've got the Democrats who are trying to create a -- a reasonable bill with ag and nutrition. And now -- and so what do we end up with? A bill with ag giving money to subsidies to farmers, but at the same time, no nutrition. That's 80 percent of the bill.\n\nCOLE (?):\n\nWell, you know...\n\nBRZEZINSKI:\n\nThat's not hopeful.\n\n(LAUGHTER)\n\nCUMMINGS:\n\nNo, that's not hopeful. We can do better.\n\nCOLE:\n\nWell, first of all, we can do better. And it's not as if these programs aren't going to go on. They're entitlement programs. Well, actually -- I would argue what we missed, as Republicans, was the chance for real reform.\n\nWe could have gotten some reductions. It's a program that's doubled under President Bush, doubled again under President Obama. So, you know, program this thing, there's some things you can do differently and still help people that need it. But when we don't have a title, you know, we're now stuck with the Senate bill, which is not as good as what we defeated -- or was defeated in the House and existing law. It's going to be one or the other.\n\nSCARBOROUGH:\n\nYeah.\n\nCOLE:\n\nIf we do nothing again, the -- the current program goes on. So that just wasn't very smart politics in my view to lose (ph) that bill.\n\nBRZEZINSKI:\n\nThere's an interesting piece in New York magazine by Jennifer Senior, \"The Speaker is Mute but Not Unintelligible.\" And it -- but now -- unintelligible -- typo. \"He's a conservative, certainly, but also an institutionalist, an old-school politician that likes to do deals. He has an interest at 63 leaving a legacy of bipartisan accomplishments behind him. His speakership, of late, has become a case study in mine field walking, forcing him to balance one survival instinct against another.\n\nIf he doesn't make an attempt at a serious immigration bill, he'll have almost nothing to show for his leadership. But if he tries to forge a deal with the Democrats and let the bill come to the floor, he'll face a result from his own rather large back bench. Boehner is one of the most beleaguered powerful people in Washington. Of course, there's another powerful leader in Washington who's inconveniently introverted and allergic to conflict. His name is Barack Obama.\"\n\nSCARBOROUGH:\n\nBoy, what a formula for success!\n\nBRZEZINSKI:\n\nWow.\n\nSCARBOROUGH:\n\nLet -- let's talk about the immigration bill for a second. Are we going to see a -- a -- a bill pass the House?\n\nCOLE:\n\nWell, it depends on what time frame. It depends on what happens first. Look, I've never thought this bill was going to move very quickly through the House. We've got the Farm Bill. We've got student loan bill.\n\nSCARBOROUGH:\n\nRight.\n\nCOLE:\n\nWe've got end of fiscal year. And we've got debt ceiling all, I think, before we get to immigration. So if it happens, it's going to be shaped by those four things. Did we resolve those successfully in a bipartisan way? If we do, I think you gotta shot at a Farm Bill -- or, excuse me, at an the immigration bill before the end of the year.\n\nSCARBOROUGH:\n\nCitizenship or...\n\nCOLE:\n\nToo soon.\n\nSCARBOROUGH:\n\n... legal -- legalizing?\n\nCOLE:\n\nIt's -- it's gotta -- gotta change, obviously. I mean the -- the Senate bill -- you have to remember, two out of every three Republicans in the Senate voted no. So, yeah, it -- it -- a decent product, got a little better, I think, in the process. That's why it picked up support. But, you know, legal status, I think, is at the heart of any bill...\n\nSCARBOROUGH:\n\nYeah.\n\nCOLE:\n\n... at the end. But you've gotta have done these other things given how low the trust -- popular trust in the government.\n\nSCARBOROUGH:\n\nRobert, it's an uphill battle as far -- as far as getting something through the House. I don't see it.\n\nGIBBS:\n\nI think there's no doubt about it. I mean, as the Congressman said, you know, for all of the momentum that immigration reform had of the Senate, 30 percent of Republicans voted for it. I mean, we...\n\nSCARBOROUGH:\n\nRight.\n\nGIBBS:\n\n... have really -- in order to label something bipartisan, we've lowered the bar in order to embrace bipartisanship.\n\nThe question I have for both of you two is, you know, I'm a little bit of an old-schooler. You guys are, too. And there seems to be -- I wonder what the strategy is to even getting to a conference committee.\n\nBRZEZINSKI:\n\nRight.\n\nGIBBS:\n\nBecause these days it seems like -- in the old days, the Senate would pass something. The House would pass something. You'd have a conference committee reconcile those differences. But it seems to me now there's even a reluctance among many in the House to want to be in the same room...\n\nSCARBOROUGH:\n\nYeah.\n\nGIBBS:\n\n... to work out those differences. And I wonder how you think we bridge that.\n\nCUMMINGS:\n\nThat is a -- that's a -- that's a very difficult one. And I'm -- and I -- sometimes I get the impression -- and -- and Cole can give his opinion on this. Sometimes I get the opinion that there are some folks who in -- on the House Republican side, who don't want anything to happen, who -- who have basically placed us all in a, kind of, stalling mode trying to get through this election situation. And then maybe they'll do something and -- and have a new president or whatever, a new Congress.\n\nI -- I -- I'm telling you, I get so frustrated to see -- not going to conference say, for example, on the budget. That's crazy. I mean, not being able to -- to pass a -- a -- a Farm Bill. I mean, the American people have got to be saying, \"Wait a minute. What's wrong with you guys?\" I'm not -- I'm not -- I don't know what's is, but the article you just read...\n\nBRZEZINSKI:\n\nYeah.\n\nCUMMINGS:\n\n... is quite accurate. I think Boehner is a decent man. I really do.\n\nSCARBOROUGH (?):\n\nRight.\n\nCUMMINGS:\n\nI think -- and I think he -- he really wants to do the right thing. But as I was telling Cole, you know, when he's talking to the president, the president is saying, \"OK, let's work a deal.\" And the next thing you know -- the president is always worried that when he goes back to the conference, there's 60 tea partiers saying no, no, no.\n\nSCARBOROUGH:\n\nSo -- so -- so let's talk about the president. Do you also agree with this article -- article, Jennifer Senior, that the president also can be a very, very frustrating man for Democrats?\n\nCUMMINGS:\n\nI think the -- the president, when we...\n\nSCARBOROUGH:\n\nBy the way, every -- every Democrat off the record said, \"Yes, he's -- he drives us crazy!\"\n\n(LAUGHTER)\n\nSo you -- you can tell us that on the record.\n\nGIBBS (?):\n\nThey do it on television.\n\nSCARBOROUGH:\n\nThey so do it on television.\n\nROBINSON (?):\n\nThey did not do it on television.\n\n(LAUGHTER)\n\nSCARBOROUGH:\n\nYour objection is overruled, counselor.\n\n(LAUGHTER)\n\nAnswer the question.\n\nCUMMINGS:\n\nNo, I -- I -- first of all, I think the president tries very hard to accomplish things. But -- but I can tell you, sitting on the committee I sit on as ranking member of oversight...\n\nSCARBOROUGH:\n\nYeah.\n\nCUMMINGS:\n\nI believe that he is -- there -- there are efforts to block him at every single...\n\nSCARBOROUGH:\n\nRight.\n\nBRZEZINSKI:\n\nI agree with that.\n\nCUMMINGS:\n\n... turn. And so, he reaches out. And they say -- and he reaches out and...\n\nBRZEZINSKI:\n\nI know.\n\nCUMMINGS:\n\n... and every time. So I think he keeps coming. And we just -- the congressional black caucus just had a meeting with him last week. And you could tell he was -- he was really frustrated. He says, \"You know\" -- he says, \"For example, I have -- I -- I have appointments -- recess appointments...\n\nBRZEZINSKI:\n\nUnbelievable.\n\nCUMMINGS:\n\n... and 250 years, they were constitutional...\n\nBRZEZINSKI:\n\nRight.\n\nCUMMINGS:\n\n... Suddenly when I become president, they're no longer constitutional.\"\n\nBRZEZINSKI:\n\nCordray -- don't even start me on the...\n\nCUMMINGS:\n\nYou know, so we see over and over -- and that -- you know, so I don't think the Democrats are upset with the president, because they know that he's trying. And they see it every day, the blocking that is done.\n\nCOLE:\n\nLet me offer an alternate reality.\n\n(LAUGHTER)\n\nI mean, this is a president, by the way, on the recent -- who lost the case in court. So he overreached. This is a president who's routinely suspended bills chosen, which -- which laws he wants to enforce or not. We saw it just a couple weeks ago on Obamacare itself. That doesn't breed a lot of trust on our side.\n\nNow, I think -- we've had a chance at bigger deals and people recognized, you know, debt ceiling deal. That's $2.2 trillion. That's done. The deficit's half of what it was three -- two years ago when this Republican Congress came in. We actually have something we should be -- be very proud of there.\n\nNow, half our members have been there three years or less, so they're still learning, to some degree, how this game is played. But they put a lot of runs on the board. I think the next six months, Farm Bill, student loans, again, end of fiscal year, debt ceiling, immigration will decide whether or not this has been a successful Congress or not.\n\nSCARBOROUGH:\n\nOK. I won't even ask you if those members that have been there three years or less are frustrating to you.\n\nCOLE:\n\nActually, it' usually guys like me that have been here longer that are frustrating. It's kinda like, you don't have any excuse.\n\n(LAUGHTER)\n\nWhy are you behaving this way?\n\nBRZEZINSKI:\n\nAll right, Congressman Elijah Cummings...\n\nSCARBOROUGH:\n\nThank you, guys.\n\nBRZEZINSKI:\n\n... and Tom Cole. Thank you so much.\n\nSCARBOROUGH:\n\nIt was great to see you, Elijah.\n\nThank you, Tom.\n\nREP. TOM COLE, R-OKLA.\n\nREP. ELIJAH E. CUMMINGS, D-MD.\n\nEUGENE ROBINSON, COLUMNIST\n\nROBERT GIBBS, FORMER WHITE HOUSE PRESS SECRETARY\n\nMIKA BRZEZINSKI, MSNBC ANCHOR\n\nJOE SCARBOROUGH, MSNBC ANCHOR", "images": ["http://www.cq.com/images/cq-logo-white-new.png", "http://www.cq.com/versioned/MjAyMjA5MTZfMTYyNTIwMjQ0/images/app-icon.png"], "top_img": "http://www.cq.com/versioned/MjAyMjA5MTZfMTYyNTIwMjQ0/images/app-icon.png", "keywords": [], "authors": [], "canonical_link": "", "title": "Reps. Cummings and Cole Interviewed on MSNBC", "meta_data": {"build-version": "unknown-TAG", "build-time": "unknown-1664650858571", "viewport": "initial-scale=1", "apple-itunes-app": "app-id=1022591312"}, "movies": [], "publish_date": null, "source": "http://www.cq.com", "summary": ""}