{"url": "https://www.hollywoodreporter.com/news/new-york-times-metoo-ad-air-golden-globes-2018-1071828", "text": "The New York Times will continue to hold power accountable with a TV ad set to air during Sunday’s Golden Globes telecast.\n\nThe text-only ad, which can be viewed above, begins with the phrase, “He said. She said.” During its fourth repetition, however, a string of “She said”s appear to fill up the rest of the white space — referencing the movement of women who have spoken out about sexual harassment and who continue to say #MeToo in Harvey Weinstein’s wake.\n\n“The truth has power. The truth will not be threatened. The truth has a voice,” reads the ad, which will broadcast during the annual awards show out of Hollywood. The “Truth Has Voice” ad previewed on Friday’s Megyn Kelly Today.\n\nThe 30-second ad kicks off a multi-platform brand campaign and is the first in a series of 2018 ads that will focus on the Times‘ commitment to original, independent journalism that holds power to account, according to a press release. That includes Times investigations in a number of recent sexual harassment cases, including Jodi Kantor and Megan Twohey’s reporting on Weinstein, Emily Steel and Michael Schmidt’s investigations into Bill O’Reilly and Joe Coscarelli and Melena Ryzik’s reports on Russell Simmons.\n\nThe Sunday spot draws inspiration from the Times‘ Trump-aimed “The Truth is Hard” campaign that debuted during last year’s Oscars.\n\n“The Times spent months investigating sexual harassment claims made against some of the most powerful people in entertainment, business and technology,” said publisher A.G. Sulzberger in a statement. “This groundbreaking work has been called some of the highest-impact reporting of our time, prompting rapid reform in those industries and helping spark global movements like #metoo and Times Up. The Times will continue to provide our journalists with the time and support they need to hold powerful people to account and pursue the truth without fear or favor.”\n\nThe reckoning on sexual harassment is set to be a big topic at Sunday’s show, which is hosted by Seth Meyers and takes place Sunday at the Beverly Hilton in Beverly Hills, airing at 5 p.m. PT on NBC.", "images": ["https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/6df76b62-8c66-4c6f-96c2-c0c933cfa884.png?w=1024", "http://www.hollywoodreporter.com/sites/default/files/custom/Annie/unnamed-1.png", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/6df76b62-8c66-4c6f-96c2-c0c933cfa884.png?w=1024", "keywords": [], "authors": ["Jackie Strause"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/new-york-times-metoo-ad-air-golden-globes-2018-1071828/", "title": "New York Times to Launch #MeToo Ad During Golden Globes", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The powerful New York Times Golden Glones ad follows \"He said\" with an infinite string of \"She said\"s.", "news_keywords": "Golden Globes 2018, New York Times", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Jackie Strause", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1071828, "title": "New York Times to Launch #MeToo Ad During Golden Globes", "published_at": "2018-01-05 07:48:31", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/6df76b62-8c66-4c6f-96c2-c0c933cfa884.png?w=1024", "comment_count": 0, "tags": "New York Times", "topics": "TV News", "body": "The New York Times will continue to hold power accountable with a TV ad set to air during Sunday's Golden Globes telecast.\r\nThe text-only ad, which can be viewed above, begins with the phrase, \"He said. She said.\" During its fourth repetition, however, a string of \"She said\"s appear to fill up the rest of the white space — referencing the movement of women who have spoken out about sexual harassment and who continue to say #MeToo in Harvey Weinstein's wake.\r\n\"The truth has power. The truth will not be threatened. The truth has a voice,\" reads the ad, which will broadcast during the annual awards show out of Hollywood. The \"Truth Has Voice\" ad previewed on Friday's Megyn Kelly Today.\r\nThe 30-second ad kicks off a multi-platform brand campaign and is the first in a series of 2018 ads that will focus on the Times' commitment to original, independent journalism that holds power to account, according to a press release. That includes Times investigations in a number of recent sexual harassment cases, including Jodi Kantor and Megan Twohey’s reporting on Weinstein, Emily Steel and Michael Schmidt’s investigations into Bill O’Reilly and Joe Coscarelli and Melena Ryzik’s reports on Russell Simmons.\r\nThe Sunday spot draws inspiration from the Times' Trump-aimed \"The Truth is Hard\" campaign that debuted during last year's Oscars.\r\n“The Times spent months investigating sexual harassment claims made against some of the most powerful people in entertainment, business and technology,\" said publisher A.G. Sulzberger in a statement. \"This groundbreaking work has been called some of the highest-impact reporting of our time, prompting rapid reform in those industries and helping spark global movements like #metoo and Times Up. The Times will continue to provide our journalists with the time and support they need to hold powerful people to account and pursue the truth without fear or favor.” \r\nThe reckoning on sexual harassment is set to be a big topic at Sunday's show, which is hosted by Seth Meyers and takes place Sunday at the Beverly Hilton in Beverly Hills, airing at 5 p.m. PT on NBC.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "New York Times to Launch #MeToo Ad During Golden Globes", "url": "https://www.hollywoodreporter.com/tv/tv-news/new-york-times-metoo-ad-air-golden-globes-2018-1071828/", "description": "The powerful New York Times Golden Glones ad follows “He said” with an infinite string of “She said”s.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/6df76b62-8c66-4c6f-96c2-c0c933cfa884.png?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2018-01-05T07:48:31+00:00", "modified_time": "2018-01-05T08:59:00+00:00"}, "twitter": {"site": "@thr", "creator": "@jackiedstrause", "card": "summary_large_image", "title": "New York Times to Launch #MeToo Ad During Golden Globes", "description": "The powerful New York Times Golden Glones ad follows “He said” with an infinite string of “She said”s.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/6df76b62-8c66-4c6f-96c2-c0c933cfa884.png?w=1280"}}, "movies": [], "publish_date": 1515138511.0, "source": "https://www.hollywoodreporter.com", "summary": ""}