{"url": "www.celebritynetworth.com/richest-celebrities/actors/kate-hudson-net-worth/", "text": "Kate Hudson Net Worth and Salary: Kate Hudson is an American actress, producer and entrepreneur who has a net worth of $80 million dollars. Kate rose to fame and prominence thanks to the 2001 film \"Almost Famous\". She went on to earn a fortune as one of the co-founders of subscription fashion company Fabletics.\n\nEarly Life\n\nShe was born Kate Garry Hudson on April 19, 1979, in Los Angeles, California. Hudson is the daughter of actress Goldie Hawn and bears more than a passing resemblance to her famous mother. Her biological father is Bill Hudson, an actor, comedian, and musician. Her parents divorced when she was just 18 months old. She and her brother, fellow actor Oliver Hudson, were raised in Snowmass, Colorado and Pacific Palisades, California by her mother and Goldie Hawn's long-term boyfriend Kurt Russell. Kate considers Russell her only father and she has no relationship with her biological father. Hudson graduated from Crossroads College Preparatory School in Santa Monica in 1997. She was accepted to New York University but chose to instead pursue an acting career in lieu of a college degree.\n\nActing Career\n\nOne of Kate's earliest roles came in 1996 when she made her TV debut on the Fox TV series Party of Five (1994-2000). Although she only appeared in one episode titled \"Spring Breaks: Part 1\", this initial experience was enough to uphold her determination to develop a professional acting career of her own. Her film debut was in \"Desert Blue\" in 1998. However, it wasn't until 1999 that she started to attract public attention when critics lauded her brilliant portrayal of Cindy in \"200 Cigarettes\", even though the movie itself was a commercial disappointment. She received acclaim for supporting roles in \"Gossip\" and \"Dr. T and the Women\" which both were released in 2000.\n\nIt was her performance in Cameron Crowe's 2001 film \"Almost Famous\" that proved she was set to follow her mother's footsteps in taking the film industry by storm. Hudson played Penny Lane, a devoted groupie to the fictional band Stillwater. This role not only made her famous, but it also fetched her a Golden Globe and several other major nominations, including a nomination for an Academy Award for Best Supporting Actress.\n\nIn the midst of a whirlwind schedule of fashion shoots and awards shows, she made an appearance in the romantic war drama opposite Heath Ledger in \"The Four Feathers\", in 2002. Turning out to be a box-office failure, Hudson fired back with the surefire hit as she starred opposite quirky heartthrob Matthew McConaughey in the romantic comedy \"How to Lose a Guy in 10 Days\" in 2003. The film was a box office smash and grossed over $100 million at the box office upon its release. Next, she starred opposite Naomi Watts in 2003's \"Le Divorce.\" Her subsequent romantic comedies were \"Alex and Emma\" and \"Raising Helen,\" where she took on the role of a young woman who becomes the guardian of her deceased sister's children.\n\nHudson starred in 2005's supernatural thriller \"The Skeleton Key\" which was met with much box office success and critical acclaim. Hudson appeared with Owen Wilson and Matt Dillion in the comedy \"You, Me, and Deupree\" in 2006. The film grossed $21 million in its opening weekend and eventually made $130.4 million worldwide. Hudson once again paired up with Matthew McConaughey in 2008 when they starred in \"Fool's Gold,\" another box office smash. In 2009, Hudson starred alongside Anne Hathaway in \"Bride Wars.\" The movie flopped amongst critics but grossed $114 million globally. Hudson was praised in reviews for her next role in the musical \"Nine\" alongside Daniel-Day Lewis.\n\nHudson's career took a turn towards more independent roles throughout the 2010s. She played the wife of a West Texas serial killer when she starred with Casey Affleck in \"The Killer Inside Me\", which premiered at the 2010 Sundance Film Festival to solid reviews. She also starred in small films \"A Little Bit of Heaven\" and \"Something Borrowed.\"\n\nIn 2012, Kate landed the recurring role of Cassandra July on the Fox teen comedy series \"Glee.\" Her next film was a political thriller, \"The Reluctant Fundamentalist\" in 2013. Hudson subsequently starred in \"Wish I was Here,\" \"Good People,\" and \"Rock the Kasbah\" alongside Bill Murray. The film only grossed $3 million at the U.S. box office, despite its $15 million budget. Next up, Hudson voiced a panda in the DreamWorks Animation \"Kung Fu Panda 3\" in 2016. The film became her most widely seen role, and grossed $521 million globally. The same year, she starred in \"Mother's Day\" and played the wife of Mark Wahlberg's character in the drama \"Deepwater Horizon.\" The film opened to positive reviews and modest financial success. In 2017, Hudson starred in \"Marshall\". Her appearance received positive reviews from critics but was met with a limited theatrical audience. Kate is slated to star in the 2020 film \"Music\" directed by Sia.\n\nFabletics\n\nIn July 2013, Kate and two partners, Don Ressler and Adam Goldenberg, co-founded a subscription athleisure company called Fabletics. Over time the company would eventually grow from being primarily e-commerce based, to operating 22 retail stores. They also operate a menswear line under the label FL2. According to a 2017 Forbes article, the company was at one point valued at $250 million. It's believed that Kate owned 20% of the company at that point. Assuming the $250 million valuation has held, Kate's pre-tax stake was worth $50 million.\n\nIn 2020 Fabletics surpassed $500 million in revenue.\n\nKate's co-founders, Ressler and Goldenberg, operate Fabletics' parent company TechStyle Fashion Group. TechStyle is a portfolio of fashion brands including JustFab, FabKids, ShoeDazzle and Savage X Fenty.\n\nIn July 2021 it was reported that Fabletics was seeking to go public at a $5 billion valuation.\n\nPersonal Life\n\nHudson was married to Chris Robinson, frontman for The Black Crowes from December 2000 to October 2007. They had a son, Ryder Russell Robinson, in January 2004. Hudson dated Muse frontman Matt Bellamy beginning in 2010. They were engaged in April 2011, and their son Bingham Hawn Bellamy was born in July 2011. The couple announced the end of their engagement in 2014 and reportedly still co-parent their son on good terms. Hudson began dating Danny Fujikawa in 2016. The two had met several years prior, when she was 23. On October 2, 2018, they announced the birth of their daughter Rani Rose Hudson Fujikawa.\n\nReal Estate\n\nIn 2003 Kate paid $5.4 million for a home in LA's Pacific Palisades neighborhood. In June 2011 Kate paid $5.3 million for the home next door.", "images": ["http://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/wp-content/uploads/2009/11/Kate-Hudson.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://vz.cnwimg.com/thumb-900x/wp-content/uploads/2009/11/Kate-Hudson-1.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2009/11/Kate-Hudson.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/kate-hudson-net-worth/", "title": "Kate Hudson Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Kate Hudson Net Worth and salary: Kate Hudson is an American actress, producer and entrepreneur who has a net worth of", "cnw_share_fb_count": 70, "cnw_share_tw_count": 26, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Kate Hudson Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/kate-hudson-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2009/11/Kate-Hudson.jpg", "site_name": "Celebrity Net Worth", "description": "Kate Hudson Net Worth and salary: Kate Hudson is an American actress, producer and entrepreneur who has a net worth of"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2021-07-15T20:19:25+00:00", "published_time": "2020-07-21T04:53:40+00:00", "section": "Actors", "tag": "richest women"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2009/11/Kate-Hudson.jpg", "title": "Kate Hudson Net Worth", "description": "Kate Hudson Net Worth and salary: Kate Hudson is an American actress, producer and entrepreneur who has a net worth of"}}, "movies": [], "publish_date": 1595307220.0, "source": "http://www.celebritynetworth.com", "summary": ""}