{"url": "https://web.archive.org/web/20111115002946/http://americaneedsmitt.com:80/blog/2011/11/10/mit-romney-stage/", "text": "Governor Mitt Romney is a complex guy, perhaps far more complex than many people give him credit for. There’s Mitt Romney, the politician, the facet of his personality that most people are familiar with, and of course, Mitt Romney the businessman. There are even the lesser known facets of his life, which include Mitt Romney the family man, and Mitt Romney the Mormon. But how well do you know Mitt Romney the compulsive problem-solver?\n\nThe final paragraph in a recent article in the Washington Post by Kathleen Parker entitled “Mitt Romney: A Nice Guy in a Season of Nastiness” provided a moment of epiphany for me, which I’ll share with you at the end of this post. Here’s the paragraph from Parker’s opinion piece that “lit the light bulb” over my head:\n\n“There are stories out there that tell another side to [Romney's] character. Here’s one related to me recently by someone close to the campaign: Romney was shooting an ad on a hot day in a staffer’s yard. While the photo shoot was being set up, Romney was asked to bide time in the cooler shade of the staffer’s garage. When the staffer retrieved Romney 30 minutes later, he discovered that the candidate had swept and organized his garage.”\n\nAn anecdote like this sounds pretty far-fetched to anyone who has bought into the snarky premise that Romney is an out-of-touch elitist millionaire who was born with a silver spoon in his mouth. Yet, when you talk to people who know the Romneys personally, without exception, they describe Romney as the helpful next-door neighbor you never had, but wish you did.\n\nMittFitts.com cartoonist Sal Velluto brought an interesting little video clip of Romney to my attention that illustrates this little-known, yet endearing, facet of Mitt Romney’s personality. The clip shows Gov. Romney at the grand opening of the Florida “Tea N Tea Party” headquarters, where he can be seen spending time afterwards mingling with the crowd and allowing folks to get pictures with him. About 40 seconds into the video, a gentleman (presumably from NASA) hands Romney a NASA t-shirt, and Romney (who is reportedly worth about $250 million dollars) gushes, “For me? Oh, you’re very kind!” and then he does something quintessentially Romney. While carrying on a conversation with the gentleman, Romney begins to neatly fold the t-shirt with painstaking precision, and once he’s done folding, he hands it off to an aide. The NASA gentleman, seemingly oblivious to the care with which Romney has folded the shirt, snatches it from the aide and unravels it for another photo-op. Romney seems nonplussed, as if he isn’t even consciously aware that he folded it in the first place.\n\nSometimes, this facet of Romney’s personality isn’t so subtle. In July 1996, the 14-year-old daughter of Robert Gay, a partner at Bain Capital, had disappeared. She had attended a rave party in New York City and gotten high on ecstasy. Three days later, her distraught father had no idea where she was. Romney took immediate action. He closed down the entire firm and asked all 30 partners and employees to fly to New York to help find Gay’s daughter. Romney set up a command center at the LaGuardia Marriott and hired a private detective firm to assist with the search. He established a toll-free number for tips, coordinating the effort with the NYPD, and went through his Rolodex and called everyone Bain did business with in New York, and asked them to help find his friend’s missing daughter. Romney’s accountants at Price Waterhouse Cooper put up posters on street poles, while cashiers at a pharmacy owned by Bain put fliers in the bag of every shopper. Romney and the other Bain employees scoured every part of New York and talked with everyone they could – prostitutes, drug addicts – anyone.\n\nThat day, their hunt made the evening news, which featured photos of the girl and the Bain employees searching for her. As a result, a teenage boy phoned in, asked if there was a reward, and then hung up abruptly. The NYPD traced the call to a home in New Jersey, where they found the girl in the basement, shivering and experiencing withdrawal symptoms from a massive ecstasy dose. Doctors later said the girl might not have survived another day. Romney’s former partner credits Mitt Romney with saving his daughter’s life, saying, “It was the most amazing thing, and I’ll never forget this to the day I die.”\n\nSo, here’s my epiphany: Mitt Romney simply can’t help himself. He sees a problem, and his mind immediately sets to work solving it, sometimes consciously, and sometimes not-so-consciously. He doesn’t do it for self-aggrandizement, or for personal gain. He does it because that’s just how he’s wired.\n\nMany people are unaware of the fact that when Romney was asked by his old employer, Bill Bain, to come back to Bain & Company as CEO to rescue the firm from bankruptcy, Romney left Bain Capital to work at Bain & Company for an annual salary of one dollar. When Romney went to the rescue of the 2002 Salt Lake Olympics, he accepted no salary for three years, and wouldn’t use an expense account. He also accepted no salary as Governor of Massachusetts.\n\nFor those who might be tempted to say that Mitt Romney is simply so rich, he doesn’t need the money, consider what just transpired at the Michigan GOP Presidential Debate on November 9th. By now, you’ve probably seen video of the painful Rick Perry debate gaffe that has threatened to derail his presidential campaign. During the debate, Perry boldly claimed that he would eliminate three federal departments in order to shrink the size of the federal government. He named two (Education and Commerce) but then, for an excruciatingly awkward 45 seconds, he searched his mind for the third, but for the life of him, couldn’t remember what it was. He looked to Ron Paul for help, and Paul grinned and said something to the effect of, “You should cut five!”\n\nAs Perry continued to squirm and the other candidates watched, someone suggested, “The EPA?” and Perry leaped at the suggestion, exclaiming, “Yeah! There you go, the EPA! No, just kidding…” The moderator then asked, “Seriously? The EPA?” and a deflated Perry admitted with a nervous laugh, “No, not the EPA.” The Moderator pressed Perry, and Perry said, “No, EPA needs to be revamped, but it’s Education, uh… uh…” and from the left, you can hear some say, “Commerce” and Perry repeats, “Commerce… and uh… uh…I don’t… Oops!”\n\nFifteen minutes later, Gov. Perry recalled that the third agency was the Department of Energy.\n\nWho was that helpful voice from off-screen who suggested “EPA” and “Commerce?” The one person who twice tried to toss Perry a life-preserver while he was drowning, while the others just watched him flail? The one candidate who couldn’t help himself, because he’s just wired that way, even though Rick Perry has attacked him at almost every opportunity?\n\nIt was Governor Mitt Romney.\n\n\n\n\n\nCopy and paste this code to link to this article on your website or blog:\n\nShare this article with a friend:", "images": ["https://web.archive.org/web/20111115002946im_/http://www.americaneedsmitt.com/images/op-ed-icon.jpg", "https://web.archive.org/web/20111115002946im_/http://www.americaneedsmitt.com/images/about-icon.jpg", "https://web.archive.org/web/20111115002946im_/http://www.americaneedsmitt.com/images/myspace-icon-sm.gif", "https://web.archive.org/web/20111115002946im_/http://www.americaneedsmitt.com/images/bumper.jpg", "https://web.archive.org/web/20111115002946im_/http://www.americaneedsmitt.com/images/anm-button-88x31.jpg", "https://web.archive.org/web/20111115002946im_/http://www.americaneedsmitt.com/images/ultimitt-icon.jpg", "https://web.archive.org/web/20111115002946im_/http://www.americaneedsmitt.com/images/facebook-icon-sm.gif", "https://web.archive.org/web/20111115002946im_/http://www.americaneedsmitt.com/images/gop-tiny.jpg", "https://web.archive.org/web/20111115002946im_/http://www.americaneedsmitt.com/images/romney-tiny.jpg", "https://web.archive.org/web/20111115002946im_/http://americaneedsmitt.com/blog/wp-content/uploads/2011/06/allsourcemitt-icon.jpg", "https://web.archive.org/web/20111115002946im_/http://c3.gostats.com/bin/count/a_326996/t_5/i_1/counter.png", "https://web.archive.org/web/20111115002946im_/http://americaneedsmitt.com/blog/wp-content/uploads/2011/05/indep-icon.jpg", "https://web.archive.org/web/20111115002946im_/https://www.paypal.com/en_US/i/scr/pixel.gif", "https://web.archive.org/web/20111115002946im_/http://americaneedsmitt.com/blog/wp-content/uploads/2011/04/anm-button-88x31.jpg", "https://web.archive.org/web/20111115002946im_/http://www.americaneedsmitt.com/images/mr12.jpg", "https://web.archive.org/web/20111115002946im_/http://www.americaneedsmitt.com/images/ctm-icon.jpg", "https://web.archive.org/web/20111115002946im_/http://www.americaneedsmitt.com/images/efm-icon.jpg", "https://web.archive.org/web/20111115002946im_/http://www.americaneedsmitt.com/images/comite-icon.jpg", "https://web.archive.org/web/20111115002946im_/http://www.americaneedsmitt.com/images/cc-icon.jpg", "https://web.archive.org/web/20111115002946im_/http://americaneedsmitt.com/blog/wp-content/uploads/2011/11/155972_474789816120_21392801120_5961701_8012132_n-279x300.jpg", "https://web.archive.org/web/20111115002946im_/http://americaneedsmitt.com/blog/wp-content/uploads/2011/06/follow-mike.jpg", "https://web.archive.org/web/20111115002946im_/http://mittromneyradio.com/wp-content/uploads/2011/10/mitt-store-widget-ad.jpg", "https://web.archive.org/web/20111115002946im_/http://www.americaneedsmitt.com/images/youtube-icon-sm.gif", "https://web.archive.org/web/20111115002946im_/http://www.americaneedsmitt.com/images/ga-icon.jpg", "https://web.archive.org/web/20111115002946im_/http://www.americaneedsmitt.com/images/m4m-icon.jpg", "https://web.archive.org/web/20111115002946im_/http://americaneedsmitt.com/blog/wp-content/uploads/2011/10/mitt-store-banner-600.jpg", "https://web.archive.org/web/20111115002946im_/http://www.americaneedsmitt.com/images/book-icon-sm.gif", "https://web.archive.org/web/20111115002946im_/https://www.paypalobjects.com/en_US/i/scr/pixel.gif", "https://web.archive.org/web/20111115002946im_/http://www.americaneedsmitt.com/images/ny4m-icon.jpg", "https://web.archive.org/web/20111115002946im_/http://www.alexa.com/images/widgets/red/dark/v1-125x125.png", "https://web.archive.org/web/20111115002946im_/http://www.americaneedsmitt.com/images/wh-icon.jpg", "https://web.archive.org/web/20111115002946im_/http://americaneedsmitt.com/images/mr-radio-icon.jpg", "https://web.archive.org/web/20111115002946im_/http://americaneedsmitt.com/blog/wp-content/uploads/2011/07/comp-conserv-icon.jpg", "https://web.archive.org/web/20111115002946im_/http://www.assoc-amazon.com/e/ir?t=americcom01f-20&l=ur2&o=1", "https://web.archive.org/web/20111115002946im_/http://www.americaneedsmitt.com/images/tweetgrid-icon.jpg", "https://web.archive.org/web/20111115002946im_/http://www.americaneedsmitt.com/images/why-mr-icon.jpg", "https://web.archive.org/web/20111115002946im_/http://www.feedburner.com/fb/images/pub/feed-icon32x32.png", "https://web.archive.org/web/20111115002946im_/http://www.americaneedsmitt.com/images/article-icon.jpg", "https://web.archive.org/web/20111115002946im_/http://americaneedsmitt.com/blog/wp-content/uploads/2011/06/find-fb.jpg"], "top_img": "https://web.archive.org/web/20111115002946im_/http://americaneedsmitt.com/blog/wp-content/uploads/2011/11/155972_474789816120_21392801120_5961701_8012132_n-279x300.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20111115002946/http://americaneedsmitt.com/blog/2011/11/10/mit-romney-stage/", "title": "America Needs Mitt", "meta_data": {"keywords": "mitt romney,mitt,romney,president,presidential,candidate,candidacy,election,2012 election,massachusetts,campaign,primaries,donald trump,trump,sarah palin,palin,newt gingrich,gingrich,mike huckabee,huckabee,tim pawlenty,pawlenty,politics,political,debate,presidential debate,delegates,nominee,polls,presidential polls,obama,president obama,tea party,gop,republican,republican nominee", "generator": "WordPress 3.1.4", "fb": {"app_id": 166011470136537}}, "movies": ["http://www.youtube.com/v/gL52AkJ_CKg?version=3&hl=en_US", "http://www.youtube.com/v/0uvmKnFY4uk?version=3&hl=en_US"], "publish_date": 1320883200.0, "source": "https://web.archive.org", "summary": ""}