{"url": "https://www.usatoday.com/story/sports/olympics/2018/03/01/first-male-gymnast-alleges-abuse-larry-nassar/387639002/", "text": "First male gymnast alleges abuse by Larry Nassar\n\nShow Caption Hide Caption Male gymnast joins abuse lawsuit A male gymnast has joined the federal lawsuit against Michigan State University, USA Gymnastics and others. Jacob Moore is believed to be the first man to file a lawsuit alleging he was sexually abused by former doctor Larry Nassar. (March 6) AP\n\nClarification: An earlier version of this story misstated how Nassar would serve his prison sentences.\n\nA male gymnast alleges in a lawsuit filed Wednesday that he was sexually abused by Larry Nassar, becoming the first known male victim to file suit against the former USA Gymnastics and Michigan State team doctor.\n\nIn one of six amended complaints filed in federal court Wednesday as part of a civil suit against Nassar, USA Gymnastics and Michigan State, Jacob Moore claims that he was sexually abused and harassed by Nassar in 2016.\n\nAccording to the amended complaint, which was obtained by USA TODAY Sports on Thursday night, Moore alleges that he went to Nassar's home to receive treatment for a shoulder injury when he was 16 years old. After a female gymnast, who was also a minor at the time, entered the basement where Nassar was treating Moore, the doctor pulled down Moore's pants and exposed him to the female, according to the complaint.\n\nNassar told Moore that he would treat the gymnast's shoulder injury \"through acupuncture in his pubic area and in and around his genitalia,\" then proceeded to do so.\n\n\"There is no known medical connection between shoulder pain which can be treated through acupuncture in the area of a male’s genitalia,\" the complaint states.\n\nThe amended complaint first was reported by International Gymnast Magazine.\n\nMoore, who now is a gymnast at the University of Michigan, joins the more than 260 women and girls who have told law enforcement that they were sexually abused by Nassar.\n\nWatch: Nassar victim Rachael Denhollander speaks out Rachael Denhollander, the first to file criminal charges against Larry Nasser, speaks out about her sexual abuse from the ex-USA Gymnastics doctor. USA TODAY Sports\n\nMore: Olympic world not better off after USOC's Scott Blackmun resigning\n\nRelated: American gymnasts detail sexual abuse to legislators on Capitol Hill\n\nLarry Nassar case: Parents lash out: 'You violated our daughters'\n\nMoore's sister, Kamerin, also is a victim and spoke during her victim-impact statement in January of how Nassar abused her brother.\n\nNassar is currently serving a 60-year sentence at a federal prison in Tucson, Ariz., on child pornography charges. The 54-year-old also has been sentenced to 40 to 175 years in one Michigan county and 40 to 125 years in another, both on sexual assault charges. He would serve the sentences concurrently.\n\nNassar worked for USA Gymnastics and Michigan State for decades and continued to sexually abuse and harass women and girls even as some of his victims spoke up. The Lansing State Journal, part of the USA TODAY Network, reported last year that more than a half dozen women or girls raised concerns about Nassar's actions to coaches, trainers, police or university officials between 1997 and 2015.\n\nNassar's abuse has sparked action at Michigan State, within the U.S. Olympic Committee and on Capitol Hill. Three gymnasts who were abused by Nassar, including 2012 Olympic gold medalist Jordyn Wieber, met with lawmakers and senators in Washington on Wednesday night.\n\nAn Indianapolis Star investigation of USA Gymnastics, begun in 2016, uncovered widespread sexual abuse of athletes and failures to alert authorities by coaches and others. The IndyStar, part of the USA TODAY Network, revealed the first allegations of abuse by Nassar and triggered a criminal prosecution that led to his imprisonment.\n\nContact Tom Schad at tschad@usatoday.com or on Twitter @Tom_Schad.", "images": ["https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://media.gannett-cdn.com/29906170001/29906170001_5718706501001_5718629261001-vs.jpg?pubId=29906170001", "https://www.gannett-cdn.com/-mm-/045f7a96c7dba933f45618645d4ebd96a5a85dd6/c=595-360-3939-2249/local/-/media/2018/03/01/USATODAY/USATODAY/636555429099149176-AFP-AFP-11B6YP.jpg?auto=webp&format=pjpg&width=1200", "https://media.gannett-cdn.com/29906170001/29906170001_5745871627001_5745866429001-vs.jpg?pubId=29906170001", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/045f7a96c7dba933f45618645d4ebd96a5a85dd6/c=595-360-3939-2249/local/-/media/2018/03/01/USATODAY/USATODAY/636555429099149176-AFP-AFP-11B6YP.jpg?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Tom Schad"], "canonical_link": "https://www.usatoday.com/story/sports/olympics/2018/03/01/first-male-gymnast-alleges-abuse-larry-nassar/387639002/", "title": "First male gymnast alleges abuse by Larry Nassar", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/sports/olympics/2018/03/01/first-male-gymnast-alleges-abuse-larry-nassar/387639002/sports/olympics", "theme-color": "#ffffff", "og": {"type": "article", "title": "First male gymnast alleges abuse by Larry Nassar", "description": "Jacob Moore joins older sister and  gymnast Kamerin Moore as plaintiff in amended complaint.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/045f7a96c7dba933f45618645d4ebd96a5a85dd6/c=595-360-3939-2249/local/-/media/2018/03/01/USATODAY/USATODAY/636555429099149176-AFP-AFP-11B6YP.jpg?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "Jacob Moore joins older sister and  gymnast Kamerin Moore as plaintiff in amended complaint.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1519862400.0, "source": "https://www.usatoday.com", "summary": ""}