{"url": "https://www.hollywoodreporter.com/features/how-jessica-chastain-emerged-as-a-leader-gender-equality-1117361", "text": "“Do unto others,” Jessica Chastain says, raising the brows on her lineless forehead in emphasis. She is delivering her homily from the corner booth of a restaurant in a small town outside New York City, a location she has requested be kept as classified as the coordinates of a CIA torture site. Terrence Malick is the one who brought the previously religion-free Chastain the Word, during the production of Tree of Life. “Terry is an incredible thinker and a very religious person,” Chastain tells me. “And working on that character that is the embodiment of grace, I read a lot of teachings. That’s the one that struck me the most. If we could just do that, I think we’d solve every problem, right?” From Chastain’s mouth to God’s ears. But the 41-year-old actress has a contingency plan should her prayers go unanswered: “Don’t work with assholes.”\n\nOne she avoided working with was Harvey Weinstein, whose reputation, Chastain says, is why “I never made a film with The Weinstein Company from beginning to end.” (However, “they’ve bought films that I’d made previously,” including the John Hillcoat bootlegging movie Lawless and three-part Rashomon-style romance The Disappearance of Eleanor Rigby.) Still, Weinstein’s arraignment on May 25, with its smirking perp waddle and subsequent indictments for rape and a criminal sexual act, have provided little comfort. “He was arrested at 7:30 and then he was out at 10:30,” says Chastain. “Why do rich people not have to spend any time in jail? There was a kid that was accused of stealing a backpack and he was in jail forever.” (Kalief Browder was held at Rikers Island for three years, beginning when he was 16, without standing trial.) “And then when he finally got released, he killed himself.”\n\nChastain’s social awareness became widely known in post-Weinstein tweets like the one she sent in October to actress Asia Argento, after Argento tweeted out a list of 82 women (herself included) who said they had been “sexually assaulted/raped/molested by #HarveyWeinstein.” Chastain replied, “There are more women than this. They are afraid. #ibelieveyou.” As the Weinstein fallout continued, Chastain became a vocal participant in the Time’s Up Legal Defense Fund, which provides support to women who have experienced workplace sexual harassment, abuse and assault. The group has raised $21.7 million to date and participants like Chastain wore black during the 2018 Golden Globes, making the event feel like a glamorous funeral for the patriarchy and E!’s Mani Cam.\n\nThese public acts of feminism have become a natural extension of the way Chastain conducts business, which in turn has raised her profile in New Hollywood to heights beyond what even her two Oscar nominations and more than $1 billion in career box office would suggest. In 2016, she founded the women-led (by Chastain and former Weinstein Co. producer Kelly Carmichael) Freckle Films, which has garnered attention for a commitment to equal pay — and a series of high-profile sales, most recently the international spy thriller 355. In addition to spearheading the project — doing research that showed women-led ensemble films perform better than male-led ones, noticing the dearth of female spy thrillers, recruiting director Simon Kinberg and writer Theresa Rebeck — it was Chastain’s idea, confirms Kinberg, for the film’s stars to be paid equally in a deal orchestrated by CAA. “We independently financed it,” Chastain says. “And all five of the actresses” — Chastain, Penelope Cruz, Fan Bingbing, Lupita Nyong’o and Marion Cotillard — “own equity in the film. I love the idea about creating this movie and seeing that these women aren’t just people for hire.” She says she was motivated by the way the industry previously treated leading women. “Like Susan Sarandon or Jessica Lange or Sissy Spacek. You wonder: These incredible actresses, where are they now? Why did they disappear for so long? It was a system that wasn’t working. And so I thought, ‘Well, what if we now take the power and give it to the actresses?'”\n\nChastain understands, she says, that “society mostly values women for their sexual desirability. Look at this #MeToo movement we’re in. Women at a very young age are taught that to be important — to be seen — is to be pretty. Boys are taught that to be important is to be strong.” The canny strategy of using the sex appeal of 355‘s stars while exposing the unfairness of the system that has profited from objectifying women has been a lucrative one: The film was the biggest sale at Cannes, with Universal paying more than $20 million for the movie, plus large foreign distribution deals.\n\n“The socially conscious part [of me] is just everywhere,” Chastain says. “In my personal life and in my work life. I don’t think that’s a different hat. It’s just who I am.” In her new film Woman Walks Ahead, in limited theaters June 29 and available now on DirecTV, Chastain plays a real-life portrait artist who traveled to the Dakota Territory to paint Sitting Bull. “We made the film for not that much money,” she says. (This was one of the times when social consciousness was relatively unlucrative: Chastain reportedly received less than $700,000 for the role, and the film had an estimated $12 million budget.) “And to be quite honest, there were three main reasons I made it: forgotten women in history, [director] Susanna White and Michael Greyeyes,” a mostly unknown, deeply charismatic actor who plays Sitting Bull. “He’s a great actor and an incredible thinker and man,” says Chastain. “His parents had been taken away from their parents to be raised in Caucasian households to get the indigenous culture out of them — that was the goal. It’s devastating.”\n\nWoman Walks Ahead director White says she wanted Chastain for the part specifically because of her vocal politics. “Jessica has been very outspoken publicly,” White says. “Standing up for women in the industry, supporting female directors and more strong female roles.”\n\n[promo:1113690]\n\nChastain’s eyes brim when she talks about gender and racial inequality, about the radical injustice of the Browder case, about recent news reports of 1,500 unaccounted-for undocumented children. She says her receptivity to pain is a byproduct of trying desperately to understand other people and their experiences. Chastain pauses, seemingly deciding whether to proceed, then declares, “Now I’m gonna get really strange here.” After wrapping Tree of Life, Chastain was preparing for a role as a detective in Ami Canaan Mann’s Texas Killing Fields, research that entailed trailing Los Angeles County law enforcement officials to the morgue. And in a cool room neatly filled with the dead, their demises explored and documented with a care rarely afforded to the living, Chastain made peace with the suicide, seven years earlier, of her younger sister. Seeing the temporary residents of the coroner’s office up close helped her understand, she says, “Oh, we’re so much more than these bodies.”\n\nPart of it was that Chastain just hadn’t known before, fundamentally, how death works. “Going to the grocery store, people buy steak and stuff and meat that’s wrapped in plastic, filled with red dye to make it look like it’s fresh,” she says. “We don’t really learn about anything that we think is distasteful. I had the opposite reaction when I went to the morgue. When we were in there, a gentleman came in who had killed himself. I had a lot of empathy for him. It made me feel closer to humanity and not separate from it.”\n\nWhen asked if being so sensitive and open makes her feel the need to be on guard, Chastain answers without hesitation: “Absolutely.”\n\nThough it would be harder to get more intimate, the story about her sister, who wrestled with substance abuse before she died, is an outlier for Chastain. She’s otherwise averse to personal revelations, including discussion of her pre-Juilliard upbringing in Sacramento, where she was raised by her mother and stepfather without the involvement of her biological father. (Though back in January, Chastain did tweet, to the delight of the internet, “Basically #GretaGerwig made a film about my adolescence in Sacramento & ditching it for college in NY. The first time I watched @LadyBirdMovie I was so struck by our parallel lives that I had to watch it immeadiately [sic] again. Oh also, I lost my virginity to Dave Matthew’s CRASH “.) When asked why her THR interview was set in this specific, undisclosed area, a location reachable by combination of subway, train, bus, boat and car, Chastain will only say, without elaboration, “I like to go here to disappear.”\n\nLast June, she married Italian fashion executive Gian Luca Passi de Preposulo at his family’s 16th century villa. Chastain’s only references to the union are unspoken: a rainbow-jeweled “G” worn around her neck (presumably short for Gian), a slim band on her left ring finger and a diamond the size of a Chiclet on her right.\n\nSam Rockwell, continuing his streak of playing racists with his portrayal of an exponent of Native American genocide in Woman Walks Ahead (his next two roles are a KKK leader and a Nazi), has his own explanation for Chastain’s reserve, likening her commitment to the craft of acting without the desire for the attention of fame to his Three Billboards Outside Ebbing, Missouri co-star Frances McDormand. “She comes from the theater, and there’s a work ethic,” Rockwell says. White adds, “The word I’d use above all else is ‘super-professional.’ It’s all about the work for her.”\n\nThough he raves about Chastain and the rest of his experience on Woman Walks Ahead, Greyeyes points out that nobody was having much fun on this particular set: “A Western is grueling. The wind sometimes was extraordinary, or the heat, or the dust. Once Jessica and I had to cross a rope bridge to get to set, and it was physically exhausting to be in that kind of sun. Jessica is very fair! We were beat.” However, it’s not shocking that Chastain’s reserve was misinterpreted as coldness by someone who worked with her: Her Missoni-shrouded arms have been knitted across her chest for most of the interview. But after 90 minutes, she relaxes, uncurling her arms and fluffing her Madonna Litta hair as she acknowledges that the circumspection is intentional. “When I’m working, it’s like I have to put on this analytical professional hat,” she says. “I have to come at something from a non-emotional place. But I think that’s pretty normal for most people.” In other words, she’s on a film set to do a job.\n\nWhile Work Jessica is professional and Personal Jessica empathic, Press Jessica, often presented in print without the context of the questions being asked, can sound like she’s delivering a sermon. “Oh gosh, my interviews sometimes do sound preachy,” Chastain says. “I get a little bit like, ‘Here we go, we’re gonna talk about this‘” — things like feminism, pay parity, sexual harassment and assault, discrimination; issues that are inconveniently no fun and omnipresent. “When I read them back, it just sounds like I’m lecturing, saying how life should be lived. And in actuality, I don’t want to tell anyone how to live their life.”\n\nMaybe it’s not preachiness. Maybe it’s earnestness.\n\n“What is the exact definition of ‘earnest’?” Chastain earnestly wonders before earnestly pulling out her phone and googling the term. ” ‘Resulting from or showing sincere and intense conviction.’ Yeah, I’m definitely earnest.”\n\n[promo:1109718]\n\n“We arrived by boat,” Chastain says of the 355 actresses’ Cannes debut, sunglass-clad on a James Bond-style speeder in a stunt she orchestrated. “We started walking to the press conference, and it was crazy. Mayhem. People were climbing in trees — the energy was a little scary. The security guards were freaking out. And we didn’t plan it, but we just started to link arms. Then we held hands. We were like, ‘OK, we’ve got this.’ And we started walking through. From my right, [I heard a] whisper: ‘The power of women, right here. The power of women.'”\n\nIt was Chastain’s coming-out moment as a producer. “I’m just winging it,” Chastain says of the shift. “I have no idea what I’m doing.” Perhaps. But there’s been a noticeable change in the type of projects she has taken on as a producer-star from the ones she headlined solely as a performer, which tended to be smaller, critic-bait projects like The Disappearance of Eleanor Rigby and A Most Violent Year. This approach has garnered Chastain those two Academy Award nominations and a Golden Globe win. (There are exceptions, of course: Zero Dark Thirty, for which Chastain received an Oscar nomination and a Globe, also made more than $132 million. But for the most part, her performances in broader fare like The Help and Interstellar tended to be supporting roles.) Whatever Chastain’s protestations, the money-printing theatricality of 355‘s unveiling on the Riviera wasn’t an accident. “There is an entrepreneurial side of Jess,” Kinberg says. “It’s not just about wanting to make sure women are treated as fairly as their male peers. It’s not just about power and control. It’s about wanting to shake up a system that’s a little creaky and makes movies the way they were made in the ’20s and ’30s.”\n\nChastain’s activist-meets-populist style of producing also drew well-deserved attention in January when Octavia Spencer, her co-star in The Help, said during a Sundance panel that she would be making five times her quote on a broad Chastain-Spencer Christmas comedy, produced by Freckle Films and Trudie Styler and Celine Rattray’s Maven Pictures, and purchased by Universal.\n\n“I shared a personal story [with Chastain] about what [financial] success has meant for me and most women of color in comparison to our white counterparts,” Spencer says. “I told her about the gross disparity in our salaries. She provided a much-needed shoulder and listened. And then she did what she always does: She took up my cause and made it her own. As a friend, she’s your biggest cheerleader; but as a colleague, she’s your most vocal advocate.”\n\nChastain had employed a “favored nations” deal, where actors with equivalently sized parts tie their salaries together and make the same amount of money. “In an industry that for the longest time had pitted women against each other,” Chastain says, “it’s really important for me and my company to create a space where everyone understands that actually we do better together.” She continues, “Your silence is your discrimination. So if you are succeeding in an environment where there is discrimination, you are actively being discriminatory. I knew women of color got paid less than Caucasian actresses. What I didn’t know is someone of Octavia’s level, who had an Oscar and two Oscar nominations, how much less she would be getting paid. When she told me what she was making, that’s what really made me go, ‘Hold up, that doesn’t compute in my brain.'”\n\nNow that she is a favored nation, Chastain has found herself in the unlikely position of being an ally to underserved white men. “Someone will call my lawyer,” she tells me, “and say, ‘I know Jessica’s all for equal pay, so …’ And I’ve gotten a situation where I’m like, ‘Sure, I’ll tie my pay to him and bring his quote up.'” (Chastain demurs when I ask who this disadvantaged member of the patriarchy is. “I don’t want to say that someone has a low quote,” she explains.)\n\nThen Chastain says something that would sound pretty damn preachy coming out of a less earnest mouth: “This is the God’s honest truth — I care more about what Octavia’s getting paid than what I’m getting paid. Because I’ve got a great life. I am more concerned about her than I am about me. Equal pay for equal work!”\n\nWhatever protective walls Chastain has erected, when she lets people in the gates, she is generous and effusive. She gushes about Michelle Williams (“Love her”), extols the wonders of Stephen Colbert (“Love him”) and lauds the Kardashians (“The most powerful women in our society”). Chastain tellingly admires Kim’s “genius” at what she chooses to reveal and conceal: The season of Keeping Up With the Kardashians that Chastain watched as inspiration while prepping to play celebrity poker ringleader Molly Bloom in last fall’s Molly’s Game taught her how to contour her nose and featured a scene where “there’s a media training,” Chastain says. “And Kim’s the one that brings everyone to go do it. You definitely see that she is a very intelligent person and is learning how to gain control over her life. I mean, she already has it, but especially in media and society.”\n\nThat kind of narrative control can be elusive in today’s media landscape. “In 2012, there was some tabloid saying that, like, Jennifer Lawrence and I were in a feud, which was insane,” Chastain says. “She and I laughed about it. She came up to me and goes, ‘So I hear we’re feuding?’ I’ve never had a bad situation with women that I’ve worked with.”\n\n“With the women I’ve worked with.” It’s a pointed choice of words.\n\nIn 2011, Chastain filmed Lawless with Tom Hardy and Shia LaBeouf. LaBeouf has publicly spoken about his problematic drinking and aggression during the production, which, according to co-star Mia Wasikowska, terrified her. Hardy described getting into a fistfight with LaBeouf and being “knocked out.” Meanwhile, Chastain says the intra-cast conflict she’s most often asked about is nonexistent squabbling that allegedly occurred on the set of The Help. “Can you imagine if the kind of … if the articles came out about two women fighting on set like that? I mean, it’s insane. I can’t imagine.” Chastain shakes her head. It’s hard to walk the balance beam of acceptable behavior for women, teetering between passion that can get twisted into Daily Mail headlines and a work ethic that makes some colleagues deem you icy.\n\n355 director Kinberg also worked with Chastain on The Martian and the forthcoming X-Men: Dark Phoenix. (Kinberg says the film will not bear former producer and accused sexual assaulter Bryan Singer’s name, as he had no involvement in the production; Singer has categorically denied all claims.) Kinberg remembers that while she was filming Dark Phoenix, Chastain brought a “seriousness of purpose” to the comic book movie. After all, “She’s one of the greatest actors alive,” Kinberg says. “Meryl Streep and Daniel Day-Lewis-level.” She also, he says, took time to nurture and mentor Sophie Turner, who was just 20 years old and in her first lead role in a film. But Chastain also was just fun. “There’s a scene in X-Men where James McAvoy’s character is being held up by wires,” Kinberg says. “She got the guys who were operating the wires to puppeteer him to dance the Macarena as we played the song.”\n\nKinberg tells another story, one that squares the activist and the prankster and the woman who sometimes feels the need to guard herself. “Jessica and her husband and a few friends of ours went to Disneyland,” he says. “She loved it. She was dancing to some band that was playing as we were passing through the park, wearing a Time’s Up shirt. And the juxtaposition of that political movement with the playfulness of a grown-up dancing at Disneyland — that’s the Jessica Chastain that I know. She is classical music and she is punk rock.”\n\nThe Gospel of Jessica, abridged: Work hard, dance in your downtime, treat others like you would like to be treated. And leave the assholes out in the cold.\n\nThis story first appeared in the June 6 issue of The Hollywood Reporter magazine. To receive the magazine, click here to subscribe.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/06/thr_chastain_splash.jpg?w=1500&h=844&crop=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/thr_issue_20_jessica_chastain_cover.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/jessica_chastain_4_embed.jpg?w=928", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/jessica_chastain_2_embed.jpg?w=928", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/jessica_chastain_3_embed.jpg?w=928", "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/thr_chastain_splash.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/jessica_chastain_1_embed.jpg?w=928"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/thr_chastain_splash.jpg?w=1024", "keywords": [], "authors": ["Anna Peele"], "canonical_link": "https://www.hollywoodreporter.com/movies/movie-features/how-jessica-chastain-emerged-as-a-leader-gender-equality-1117361/", "title": "How Jessica Chastain Emerged as a Leader for Gender Equality: “Your Silence Is Your Discrimination”", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Like the strong women she plays onscreen (next up, 'Woman Walks Ahead'), Chastain has become as a powerful force for change in Hollywood and beyond, both as a producer (her female-fronted '355' was Cannes' biggest sale) and a vocal preacher for Time's Up.", "news_keywords": "Jessica Chastain, THR Cover Story", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Anna Peele", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1117361, "title": "How Jessica Chastain Emerged as a Leader for Gender Equality: \"Your Silence Is Your Discrimination\"", "published_at": "2018-06-06 06:00:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/thr_chastain_splash.jpg?w=1024", "comment_count": 0, "tags": "THR Cover Story", "topics": "Movies", "body": "\"Do unto others,\" Jessica Chastain says, raising the brows on her lineless forehead in emphasis. She is delivering her homily from the corner booth of a restaurant in a small town outside New York City, a location she has requested be kept as classified as the coordinates of a CIA torture site. Terrence Malick is the one who brought the previously religion-free Chastain the Word, during the production of Tree of Life. “Terry is an incredible thinker and a very religious person,” Chastain tells me. “And working on that character that is the embodiment of grace, I read a lot of teachings. That’s the one that struck me the most. If we could just do that, I think we’d solve every problem, right?” From Chastain’s mouth to God’s ears. But the 41-year-old actress has a contingency plan should her prayers go unanswered: “Don’t work with assholes.”\r\nOne she avoided working with was Harvey Weinstein, whose reputation, Chastain says, is why \"I never made a film with The Weinstein Company from beginning to end.\" (However, \"they've bought films that I'd made previously,\" including the John Hillcoat bootlegging movie Lawless and three-part Rashomon-style romance The Disappearance of Eleanor Rigby.) Still, Weinstein's arraignment on May 25, with its smirking perp waddle and subsequent indictments for rape and a criminal sexual act, have provided little comfort. \"He was arrested at 7:30 and then he was out at 10:30,\" says Chastain. \"Why do rich people not have to spend any time in jail? There was a kid that was accused of stealing a backpack and he was in jail forever.\" (Kalief Browder was held at Rikers Island for three years, beginning when he was 16, without standing trial.) \"And then when he finally got released, he killed himself.\"\r\nChastain's social awareness became widely known in post-Weinstein tweets like the one she sent in October to actress Asia Argento, after Argento tweeted out a list of 82 women (herself included) who said they had been \"sexually assaulted/raped/molested by #HarveyWeinstein.\" Chastain replied, \"There are more women than this. They are afraid. #ibelieveyou.\" As the Weinstein fallout continued, Chastain became a vocal participant in the Time's Up Legal Defense Fund, which provides support to women who have experienced workplace sexual harassment, abuse and assault. The group has raised $21.7 million to date and participants like Chastain wore black during the 2018 Golden Globes, making the event feel like a glamorous funeral for the patriarchy and E!'s Mani Cam.\r\nThese public acts of feminism have become a natural extension of the way Chastain conducts business, which in turn has raised her profile in New Hollywood to heights beyond what even her two Oscar nominations and more than $1 billion in career box office would suggest. In 2016, she founded the women-led (by Chastain and former Weinstein Co. producer Kelly Carmichael) Freckle Films, which has garnered attention for a commitment to equal pay — and a series of high-profile sales, most recently the international spy thriller 355. In addition to spearheading the project — doing research that showed women-led ensemble films perform better than male-led ones, noticing the dearth of female spy thrillers, recruiting director Simon Kinberg and writer Theresa Rebeck — it was Chastain's idea, confirms Kinberg, for the film's stars to be paid equally in a deal orchestrated by CAA. \"We independently financed it,\" Chastain says. \"And all five of the actresses\" — Chastain, Penelope Cruz, Fan Bingbing, Lupita Nyong'o and Marion Cotillard — \"own equity in the film. I love the idea about creating this movie and seeing that these women aren't just people for hire.\" She says she was motivated by the way the industry previously treated leading women. \"Like Susan Sarandon or Jessica Lange or Sissy Spacek. You wonder: These incredible actresses, where are they now? Why did they disappear for so long? It was a system that wasn't working. And so I thought, 'Well, what if we now take the power and give it to the actresses?'\"\r\n\r\nChastain understands, she says, that \"society mostly values women for their sexual desirability. Look at this #MeToo movement we're in. Women at a very young age are taught that to be important — to be seen — is to be pretty. Boys are taught that to be important is to be strong.\" The canny strategy of using the sex appeal of 355's stars while exposing the unfairness of the system that has profited from objectifying women has been a lucrative one: The film was the biggest sale at Cannes, with Universal paying more than $20 million for the movie, plus large foreign distribution deals.\r\n\r\n\r\n\"The socially conscious part [of me] is just everywhere,\" Chastain says. \"In my personal life and in my work life. I don't think that's a different hat. It's just who I am.\" In her new film Woman Walks Ahead, in limited theaters June 29 and available now on DirecTV, Chastain plays a real-life portrait artist who traveled to the Dakota Territory to paint Sitting Bull. \"We made the film for not that much money,\" she says. (This was one of the times when social consciousness was relatively unlucrative: Chastain reportedly received less than $700,000 for the role, and the film had an estimated $12 million budget.) \"And to be quite honest, there were three main reasons I made it: forgotten women in history, [director] Susanna White and Michael Greyeyes,\" a mostly unknown, deeply charismatic actor who plays Sitting Bull. \"He's a great actor and an incredible thinker and man,\" says Chastain. \"His parents had been taken away from their parents to be raised in Caucasian households to get the indigenous culture out of them — that was the goal. It's devastating.\"\r\nWoman Walks Ahead director White says she wanted Chastain for the part specifically because of her vocal politics. \"Jessica has been very outspoken publicly,\" White says. \"Standing up for women in the industry, supporting female directors and more strong female roles.\"\r\n[promo:1113690]\r\nChastain's eyes brim when she talks about gender and racial inequality, about the radical injustice of the Browder case, about recent news reports of 1,500 unaccounted-for undocumented children. She says her receptivity to pain is a byproduct of trying desperately to understand other people and their experiences. Chastain pauses, seemingly deciding whether to proceed, then declares, \"Now I'm gonna get really strange here.\" After wrapping Tree of Life, Chastain was preparing for a role as a detective in Ami Canaan Mann's Texas Killing Fields, research that entailed trailing Los Angeles County law enforcement officials to the morgue. And in a cool room neatly filled with the dead, their demises explored and documented with a care rarely afforded to the living, Chastain made peace with the suicide, seven years earlier, of her younger sister. Seeing the temporary residents of the coroner's office up close helped her understand, she says, \"Oh, we're so much more than these bodies.\"\r\nPart of it was that Chastain just hadn't known before, fundamentally, how death works. \"Going to the grocery store, people buy steak and stuff and meat that's wrapped in plastic, filled with red dye to make it look like it's fresh,\" she says. \"We don't really learn about anything that we think is distasteful. I had the opposite reaction when I went to the morgue. When we were in there, a gentleman came in who had killed himself. I had a lot of empathy for him. It made me feel closer to humanity and not separate from it.\"\r\nWhen asked if being so sensitive and open makes her feel the need to be on guard, Chastain answers without hesitation: \"Absolutely.\"\r\nThough it would be harder to get more intimate, the story about her sister, who wrestled with substance abuse before she died, is an outlier for Chastain. She's otherwise averse to personal revelations, including discussion of her pre-Juilliard upbringing in Sacramento, where she was raised by her mother and stepfather without the involvement of her biological father. (Though back in January, Chastain did tweet, to the delight of the internet, \"Basically #GretaGerwig made a film about my adolescence in Sacramento & ditching it for college in NY. The first time I watched @LadyBirdMovie I was so struck by our parallel lives that I had to watch it immeadiately [sic] again. Oh also, I lost my virginity to Dave Matthew's CRASH \".) When asked why her THR interview was set in this specific, undisclosed area, a location reachable by combination of subway, train, bus, boat and car, Chastain will only say, without elaboration, \"I like to go here to disappear.\"\r\nLast June, she married Italian fashion executive Gian Luca Passi de Preposulo at his family's 16th century villa. Chastain's only references to the union are unspoken: a rainbow-jeweled \"G\" worn around her neck (presumably short for Gian), a slim band on her left ring finger and a diamond the size of a Chiclet on her right.\r\nSam Rockwell, continuing his streak of playing racists with his portrayal of an exponent of Native American genocide in Woman Walks Ahead (his next two roles are a KKK leader and a Nazi), has his own explanation for Chastain's reserve, likening her commitment to the craft of acting without the desire for the attention of fame to his Three Billboards Outside Ebbing, Missouri co-star Frances McDormand. \"She comes from the theater, and there's a work ethic,\" Rockwell says. White adds, \"The word I'd use above all else is 'super-professional.' It's all about the work for her.\"\r\nThough he raves about Chastain and the rest of his experience on Woman Walks Ahead, Greyeyes points out that nobody was having much fun on this particular set: \"A Western is grueling. The wind sometimes was extraordinary, or the heat, or the dust. Once Jessica and I had to cross a rope bridge to get to set, and it was physically exhausting to be in that kind of sun. Jessica is very fair! We were beat.\" However, it's not shocking that Chastain's reserve was misinterpreted as coldness by someone who worked with her: Her Missoni-shrouded arms have been knitted across her chest for most of the interview. But after 90 minutes, she relaxes, uncurling her arms and fluffing her Madonna Litta hair as she acknowledges that the circumspection is intentional. \"When I'm working, it's like I have to put on this analytical professional hat,\" she says. \"I have to come at something from a non-emotional place. But I think that's pretty normal for most people.\" In other words, she's on a film set to do a job.\r\nWhile Work Jessica is professional and Personal Jessica empathic, Press Jessica, often presented in print without the context of the questions being asked, can sound like she's delivering a sermon. \"Oh gosh, my interviews sometimes do sound preachy,\" Chastain says. \"I get a little bit like, 'Here we go, we're gonna talk about this'\" — things like feminism, pay parity, sexual harassment and assault, discrimination; issues that are inconveniently no fun and omnipresent. \"When I read them back, it just sounds like I'm lecturing, saying how life should be lived. And in actuality, I don't want to tell anyone how to live their life.\"\r\nMaybe it's not preachiness. Maybe it's earnestness.\r\n\"What is the exact definition of 'earnest'?\" Chastain earnestly wonders before earnestly pulling out her phone and googling the term. \" 'Resulting from or showing sincere and intense conviction.' Yeah, I'm definitely earnest.\"\r\n[promo:1109718]\r\n\r\n\"We arrived by boat,\" Chastain says of the 355 actresses' Cannes debut, sunglass-clad on a James Bond-style speeder in a stunt she orchestrated. \"We started walking to the press conference, and it was crazy. Mayhem. People were climbing in trees — the energy was a little scary. The security guards were freaking out. And we didn't plan it, but we just started to link arms. Then we held hands. We were like, 'OK, we've got this.' And we started walking through. From my right, [I heard a] whisper: 'The power of women, right here. The power of women.'\"\r\nIt was Chastain's coming-out moment as a producer. \"I'm just winging it,\" Chastain says of the shift. \"I have no idea what I'm doing.\" Perhaps. But there's been a noticeable change in the type of projects she has taken on as a producer-star from the ones she headlined solely as a performer, which tended to be smaller, critic-bait projects like The Disappearance of Eleanor Rigby and A Most Violent Year. This approach has garnered Chastain those two Academy Award nominations and a Golden Globe win. (There are exceptions, of course: Zero Dark Thirty, for which Chastain received an Oscar nomination and a Globe, also made more than $132 million. But for the most part, her performances in broader fare like The Help and Interstellar tended to be supporting roles.) Whatever Chastain's protestations, the money-printing theatricality of 355's unveiling on the Riviera wasn't an accident. \"There is an entrepreneurial side of Jess,\" Kinberg says. \"It's not just about wanting to make sure women are treated as fairly as their male peers. It's not just about power and control. It's about wanting to shake up a system that's a little creaky and makes movies the way they were made in the '20s and '30s.\"\r\nChastain's activist-meets-populist style of producing also drew well-deserved attention in January when Octavia Spencer, her co-star in The Help, said during a Sundance panel that she would be making five times her quote on a broad Chastain-Spencer Christmas comedy, produced by Freckle Films and Trudie Styler and Celine Rattray's Maven Pictures, and purchased by Universal.\r\n\"I shared a personal story [with Chastain] about what [financial] success has meant for me and most women of color in comparison to our white counterparts,\" Spencer says. \"I told her about the gross disparity in our salaries. She provided a much-needed shoulder and listened. And then she did what she always does: She took up my cause and made it her own. As a friend, she's your biggest cheerleader; but as a colleague, she's your most vocal advocate.\"\r\nChastain had employed a \"favored nations\" deal, where actors with equivalently sized parts tie their salaries together and make the same amount of money. \"In an industry that for the longest time had pitted women against each other,\" Chastain says, \"it's really important for me and my company to create a space where everyone understands that actually we do better together.\" She continues, \"Your silence is your discrimination. So if you are succeeding in an environment where there is discrimination, you are actively being discriminatory. I knew women of color got paid less than Caucasian actresses. What I didn't know is someone of Octavia's level, who had an Oscar and two Oscar nominations, how much less she would be getting paid. When she told me what she was making, that's what really made me go, 'Hold up, that doesn't compute in my brain.'\"\r\nNow that she is a favored nation, Chastain has found herself in the unlikely position of being an ally to underserved white men. \"Someone will call my lawyer,\" she tells me, \"and say, 'I know Jessica's all for equal pay, so …' And I've gotten a situation where I'm like, 'Sure, I'll tie my pay to him and bring his quote up.'\" (Chastain demurs when I ask who this disadvantaged member of the patriarchy is. \"I don't want to say that someone has a low quote,\" she explains.)\r\nThen Chastain says something that would sound pretty damn preachy coming out of a less earnest mouth: \"This is the God's honest truth — I care more about what Octavia's getting paid than what I'm getting paid. Because I've got a great life. I am more concerned about her than I am about me. Equal pay for equal work!\"\r\n\r\n\r\nWhatever protective walls Chastain has erected, when she lets people in the gates, she is generous and effusive. She gushes about Michelle Williams (\"Love her\"), extols the wonders of Stephen Colbert (\"Love him\") and lauds the Kardashians (\"The most powerful women in our society\"). Chastain tellingly admires Kim's \"genius\" at what she chooses to reveal and conceal: The season of Keeping Up With the Kardashians that Chastain watched as inspiration while prepping to play celebrity poker ringleader Molly Bloom in last fall's Molly's Game taught her how to contour her nose and featured a scene where \"there's a media training,\" Chastain says. \"And Kim's the one that brings everyone to go do it. You definitely see that she is a very intelligent person and is learning how to gain control over her life. I mean, she already has it, but especially in media and society.\"\r\nThat kind of narrative control can be elusive in today's media landscape. \"In 2012, there was some tabloid saying that, like, Jennifer Lawrence and I were in a feud, which was insane,\" Chastain says. \"She and I laughed about it. She came up to me and goes, 'So I hear we're feuding?' I've never had a bad situation with women that I've worked with.\"\r\n\"With the women I've worked with.\" It's a pointed choice of words.\r\nIn 2011, Chastain filmed Lawless with Tom Hardy and Shia LaBeouf. LaBeouf has publicly spoken about his problematic drinking and aggression during the production, which, according to co-star Mia Wasikowska, terrified her. Hardy described getting into a fistfight with LaBeouf and being \"knocked out.\" Meanwhile, Chastain says the intra-cast conflict she's most often asked about is nonexistent squabbling that allegedly occurred on the set of The Help. \"Can you imagine if the kind of … if the articles came out about two women fighting on set like that? I mean, it's insane. I can't imagine.\" Chastain shakes her head. It's hard to walk the balance beam of acceptable behavior for women, teetering between passion that can get twisted into Daily Mail headlines and a work ethic that makes some colleagues deem you icy.\r\n355 director Kinberg also worked with Chastain on The Martian and the forthcoming X-Men: Dark Phoenix. (Kinberg says the film will not bear former producer and accused sexual assaulter Bryan Singer's name, as he had no involvement in the production; Singer has categorically denied all claims.) Kinberg remembers that while she was filming Dark Phoenix, Chastain brought a \"seriousness of purpose\" to the comic book movie. After all, \"She's one of the greatest actors alive,\" Kinberg says. \"Meryl Streep and Daniel Day-Lewis-level.\" She also, he says, took time to nurture and mentor Sophie Turner, who was just 20 years old and in her first lead role in a film. But Chastain also was just fun. \"There's a scene in X-Men where James McAvoy's character is being held up by wires,\" Kinberg says. \"She got the guys who were operating the wires to puppeteer him to dance the Macarena as we played the song.\"\r\nKinberg tells another story, one that squares the activist and the prankster and the woman who sometimes feels the need to guard herself. \"Jessica and her husband and a few friends of ours went to Disneyland,\" he says. \"She loved it. She was dancing to some band that was playing as we were passing through the park, wearing a Time's Up shirt. And the juxtaposition of that political movement with the playfulness of a grown-up dancing at Disneyland — that's the Jessica Chastain that I know. She is classical music and she is punk rock.\"\r\nThe Gospel of Jessica, abridged: Work hard, dance in your downtime, treat others like you would like to be treated. And leave the assholes out in the cold.\r\n\r\nThis story first appeared in the June 6 issue of The Hollywood Reporter magazine. To receive the magazine, click here to subscribe.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "How Jessica Chastain Emerged as a Leader for Gender Equality: “Your Silence Is Your Discrimination”", "url": "https://www.hollywoodreporter.com/movies/movie-features/how-jessica-chastain-emerged-as-a-leader-gender-equality-1117361/", "description": "Like the strong women she plays onscreen (next up, ‘Woman Walks Ahead’), Chastain has become as a powerful force for change in Hollywood and beyond, both as a producer (her female-front…", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/thr_chastain_splash.jpg?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2018-06-06T06:00:00+00:00", "modified_time": "2018-06-25T19:04:30+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "How Jessica Chastain Emerged as a Leader for Gender Equality: “Your Silence Is Your Discrimination”", "description": "Like the strong women she plays onscreen (next up, ‘Woman Walks Ahead’), Chastain has become as a powerful force for change in Hollywood and beyond, both as a producer (her female-front…", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/thr_chastain_splash.jpg?w=1500"}}, "movies": [], "publish_date": 1528264800.0, "source": "https://www.hollywoodreporter.com", "summary": ""}