{"url": "https://www.nbcnews.com/storyline/sexual-misconduct/matt-lauer-former-today-anchor-says-i-am-truly-sorry-n825171", "text": "Longtime \"Today\" anchor Matt Lauer broke his silence Thursday in a statement read on the show, saying he was \"truly sorry\" after a detailed complaint of sexual misconduct led to his firing.\n\nLauer said that not all of the allegations that have followed are correct, but he admitted that \"there is enough truth in these stories to make me feel embarrassed and ashamed.\" \"Today\" anchor Savannah Guthrie read the statement.\n\n\"There are no words to express my sorrow and regret for the pain I have caused others by words and actions. To the people I have hurt, I am truly sorry. As I am writing this I realize the depth of the damage and disappointment I have left behind at home and at NBC,\" wrote Lauer, a married father of three.\n\n\"Some of what is being said about me is untrue or mischaracterized, but there is enough truth in these stories to make me feel embarrassed and ashamed. I regret that my shame is now shared by the people I cherish dearly.\n\n\"Repairing the damage will take a lot of time and soul searching and I'm committed to beginning that effort. It is now my full time job,\" he added. \"The last two days have forced me to take a very hard look at my own troubling flaws. It's been humbling. I am blessed to be surrounded by the people I love. I thank them for their patience and grace.\"\n\nThe move to fire Lauer, a fixture in national morning news for two decades, came after a female colleague made a complaint with NBC News on Monday accusing him of inappropriate sexual behavior during the 2014 Sochi Olympics.\n\nRelated: Since Weinstein, here's the list of men accused of sexual misconduct\n\nIn addition, The New York Times reported that two other women had made complaints about Lauer, 59, after he was fired. An unidentified former employee told The Times that Lauer sexually assaulted her in his office in 2001. NBC officials confirmed that two more accusers had come forward on Wednesday.\n\nVariety published a more detailed story of Lauer's alleged sexual misconduct with at least three women over several years. The outlet said it had corroborated their stories with \"dozens of interviews with current and former staffers\" over the course of its two-month investigation. The women alleged that Lauer had exposed himself to one woman and that he gave another colleague a sex toy as a present with an \"explicit note.\"\n\nGuthrie and co-host Hoda Kotb announced Lauer's ouster on \"Today\" Wednesday saying that they were \"heartbroken\" for him and \"the brave colleague who came forward to tell her story and any other women who have their own stories to tell.\"\n\nNBC News Chairman Andrew Lack said in a memo earlier Wednesday that the first woman's complaint prompted a serious review and represented a \"clear violation of our company's standards.\"\n\nWhile the Variety report suggested NBC brass protected Lauer, a company spokesperson denied that those who are now in management were previously made aware of the complaints of sexual misconduct.\n\nAri Wilkenfeld, a lawyer for the woman whose accusation against Lauer prompted his firing, said in a statement that he and his client met Monday evening for several hours with representatives from NBC's Human Resources and Legal Department.\n\nWilkenfeld said that he was \"encouraged\" by NBC's response and \"in awe of the courage of my client.\" He declined to comment further Thursday.\n\nRelated: Transcript: 'Today' anchor Matt Lauer fired by NBC News\n\nLauer has become one of the most high-profile figures toppled by accusations of sexual misconduct against powerful men in recent months. A week ago, talk show host and journalist Charlie Rose was fired by CBS News, PBS and Bloomberg after eight women accused him of past sexual harassment and unwanted advances in a report in The Washington Post.\n\nRose released a statement apologizing for his behavior while maintaining that some of the allegations were inaccurate.\n\nLauer helped \"Today\" become a dominant morning news show over his 21 years there and last renewed his contract with NBC in 2016, Variety reported. He inked a $20 million a year deal through 2018 — keeping him one of the highest-paid anchors in the television broadcast industry.", "images": ["https://media-cldnry.s-nbcnews.com/image/upload/t_focal-60x60,f_auto,q_auto:best/newscms/2019_29/2934781/190619-erik-ortiz-byline2205.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-760x428,f_auto,q_auto:best/MSNBC/Components/Video/201711/tdy_news_guth_lauer_171129_1920x1080.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2017_48/2244011/171130-matt-lauer-mc-1215_2.JPG", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-760w,f_auto,q_auto:best/newscms/2017_48/2244011/171130-matt-lauer-mc-1215_2.JPG", "https://media-cldnry.s-nbcnews.com/image/upload/t_focal-760x428,f_auto,q_auto:best/MSNBC/Components/Video/201711/tdy_news_gosk_lauer_171130_1920x1080.jpg"], "top_img": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2017_48/2244011/171130-matt-lauer-mc-1215_2.JPG", "keywords": [], "authors": ["Https", "Media-Cldnry.S-Nbcnews.Com Image Upload Newscms", "Erik Ortiz", "Erik Ortiz Is A Staff Writer For Nbc News Focusing On Racial Injustice", "Social Inequality."], "canonical_link": "https://www.nbcnews.com/storyline/sexual-misconduct/matt-lauer-former-today-anchor-says-i-am-truly-sorry-n825171", "title": "Matt Lauer, fired 'Today' anchor accused of sexual misconduct, says 'I am truly sorry'", "meta_data": {"msapplication-config": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/nbcnews/all-other-sizes-PNG.ico/browserconfig.xml", "robots": "max-image-preview:large", "fb": {"app_id": 10150138890205613, "pages": 1508175089456029}, "og": {"site_name": "NBC News", "locale": "en_US", "url": "https://www.nbcnews.com/storyline/sexual-misconduct/matt-lauer-former-today-anchor-says-i-am-truly-sorry-n825171", "title": "Matt Lauer admits there is truth to allegations, apologizes", "description": "Lauer admits there is some truth to the allegations and apologizes \"to the people I have hurt.\"", "image": {"identifier": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2017_48/2244011/171130-matt-lauer-mc-1215_2.JPG", "secure_url": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2017_48/2244011/171130-matt-lauer-mc-1215_2.JPG", "type": "image/jpeg", "width": 1200, "height": 630}, "type": "article"}, "twitter": {"site": "@NBCNews", "creator": "NBCNews", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1024-512,f_auto,q_auto:best/newscms/2017_48/2244011/171130-matt-lauer-mc-1215_2.JPG", "title": "Matt Lauer admits there is truth to allegations, apologizes", "description": "Lauer admits there is some truth to the allegations and apologizes \"to the people I have hurt.\"", "card": "summary_large_image"}, "viewport": "width=device-width, initial-scale=1, user-scalable=yes", "description": "Lauer admits there is some truth to the allegations and apologizes \"to the people I have hurt.\"", "branch": {"deeplink": {"title": "Matt Lauer admits there is truth to allegations, apologizes", "description": "Lauer admits there is some truth to the allegations and apologizes \"to the people I have hurt.\"", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2017_48/2244011/171130-matt-lauer-mc-1215_2.JPG", "type": "article", "unibrow": "TV", "authorThumbnail1": "https://media-cldnry.s-nbcnews.com/image/upload/newscms/2019_29/2934781/190619-erik-ortiz-byline2205.jpg", "authorName1": "Erik Ortiz"}}, "article": {"opinion": "false", "content_tier": "free", "published": "Thu Nov 30 2017 14:25:00 GMT+0000 (UTC)", "modified": "Thu Nov 30 2017 18:02:08 GMT+0000 (UTC)"}, "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_social_share_1024x768_scale,f_auto,q_auto:best/newscms/2017_48/2244011/171130-matt-lauer-mc-1215_2.JPG", "next-head-count": 109}, "movies": [], "publish_date": 1512051900.0, "source": "https://www.nbcnews.com", "summary": ""}