{"url": "https://www.closerweekly.com/posts/lindsey-stirling-dancing-with-the-stars-hospitalized-injury-145539/", "text": "\n\n\n\nWhat a tough cookie! Lindsey Stirling was hospitalized on Sunday, Oct. 29 after suffering a scary rib injury during Dancing With the Stars rehearsals the previous week. But, being the competitor that she is, Lindsey bravely still appeared on the Monday, Oct. 30 Halloween episode despite being in pain.\n\nAnd just a few days after her brave performances with pro partner Mark Ballas, Lindsey gave worried fans an update on her condition. “Thank you so much for all your prayers. I don’t know how I made it through this dance. It really was a miracle. Not only was I injured and in a lot of pain but the hardest part to get through was that my spirit was broken,” she said. “The thought that I might have to forfeit, and the thought that this injury might effect my tour was devastating. For the first time in a while, I didn’t believe that I could do it.”\n\nShe added, “I received help from Drs (@humangaragela), I got a blessing from a church leader, I prayed, and I visualized what I couldn’t practice. I basically forced myself to believe I could make it through that dance. Sometimes you have to fake it till you make it.” Luckily, it seems Lindsey and Mark will also appear on tonight’s DWTS episode! “This week, I am being very careful with how I pace my body and I’m feeling a little stronger every day. I’ve reminded myself why I do what I do and I have my fire back. I believe I can do this and it’s real now. Thank you so much for your support. You guys believe in me even when I doubt myself. Please keep me in your prayers,” Lindsey concluded.\n\nMark also gave fans an update Lindsey’s condition last week. “I am not going to lie — she is in a bit of pain,” he told Entertainment Tonight. “We are blessed that the X-ray didn’t show any break or fracture. But definitely some muscle issues in there and she has to rest now, ice it, [and] take care of herself.”\n\n“If I have to bench her a bit this week, we will, but the fact that she got out there tonight was super-impressive,” Mark continued. “All day she was like, ‘I don’t want to let down the fans, I don’t want to let anybody down, I don’t want to let down my team. I want to go out there and do it.’ I was really impressed — that was a hard routine to do with a back injury.”\n\nMark, 31, traveled with Lindsey, also 31, to a local hospital after the professional violinist was badly hurt while practicing a “rapid dance move” in late October. In the pre-dance segment before their performance last week, Lindsey was seen asking Mark what will happen if she couldn’t perform on the Halloween DWTS episode while breaking down in tears.\n\n“This is definitely not an ideal day for this to happen, it’s never an ideal day to have an injury. But today is Sunday, it’s the day before we perform… so this is kind of really nerve-wracking,” Mark said. Lindsey then stated, “I push, push, push all the time… that’s how I’ve gotten to where I’m at but I’m just so afraid that I might’ve pushed too far.”\n\n“I’m going to be so mad if I’ve blown it, we’ve worked so hard… What happens if they say I can’t go out there tomorrow?” Lindsey asked to which Mark replied, “You’ll be forced to forfeit… that’ll be it.” As per the show’s official rules, a celebrity contestant must compete each week to be eligible for the Mirror Ball Trophy. However, pro dancers may skip an episode due to injury or other circumstances and are then replaced by backup pros or troupe dancers.\n\nAfter their high-energy performance last week, the judges (yet again) praised the two for their successful pasadoble. The couple then received 9’s across the board from Carrie Ann Inaba, Len Goodman, and Bruno Tonioli, which was three points off from their perfect score the week prior. “It’s hard, but it is all mindset, unless you are just so done that there is no coming back, which I have been in that situation before as well,” Mark shared. “But the great thing about this show is that we have incredible fans that keep us going. Lindsey wanted to get out there for them and this was so important to her. She is working so hard and she’s got a shot at this. I just want to make sure she is taking care of her body.”\n\nAnd with just a few weeks left before the Mirror Ball Trophy is awarded, Mark and Lindsey are really in it to win it! “We keep trying to be creative, we keep pushing the boundaries,” he said. “Lindsey and I have a great time together. Our chemistry is so fun in rehearsals, we laugh a lot, we’ve just got to make sure that she is healthy now and just keep pushing the envelope and entertaining the fans.” We’re so proud of Lindsey for being such a fighter — and we can’t wait to see what the couple comes out with tonight!", "images": ["https://www.closerweekly.com/wp-content/uploads/2017/11/lindsey-stirling.jpg?resize=940%2C529&quality=86&strip=all", "https://www.closerweekly.com/wp-content/themes/ami-bauer/assets/build/images/placeholders/placeholder-16x9.svg", "https://www.closerweekly.com/wp-content/uploads/2017/11/lindsey-stirling.jpg?resize=1200%2C630&quality=86&strip=all", "https://www.closerweekly.com/wp-content/uploads/2022/08/TITANIC_300x490_7_11r.gif?fit=300%2C490&quality=86&strip=all", "https://www.closerweekly.com/wp-content/themes/ami-bauer/assets/build/images/placeholders/placeholder-1x1.svg"], "top_img": "https://www.closerweekly.com/wp-content/uploads/2017/11/lindsey-stirling.jpg?resize=1200%2C630&quality=86&strip=all", "keywords": [], "authors": ["Closer Staff"], "canonical_link": "https://www.closerweekly.com/posts/lindsey-stirling-dancing-with-the-stars-hospitalized-injury-145539/", "title": "Lindsey Stirling Gives Dancing With the Stars Fans Update on Her Injury", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "theme-color": "#ffffff", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "What a tough cookie! Lindsey Stirling was hospitalized on Sunday, Oct. 29 after suffering a scary rib injury during Dancing With the Stars rehearsals the", "og": {"locale": "en_US", "type": "article", "title": "Lindsey Stirling Gives Dancing With the Stars Fans Update on Her Injury", "description": "What a tough cookie! Lindsey Stirling was hospitalized on Sunday, Oct. 29 after suffering a scary rib injury during Dancing With the Stars rehearsals the previous week. But, being the competitor that she...", "url": "https://www.closerweekly.com/posts/lindsey-stirling-dancing-with-the-stars-hospitalized-injury-145539/", "site_name": "Closer Weekly", "updated_time": "2017-11-06T16:27:56+00:00", "image": {"identifier": "https://www.closerweekly.com/wp-content/uploads/2017/11/lindsey-stirling.jpg?resize=1200%2C630&quality=86&strip=all", "secure_url": "https://www.closerweekly.com/wp-content/uploads/2017/11/lindsey-stirling.jpg?resize=1200%2C630&quality=86&strip=all", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/closerweekly", "published_time": "2017-11-06T16:27:00+00:00", "modified_time": "2017-11-06T16:27:56+00:00"}, "author": "Closer Staff", "twitter": {"card": "summary_large_image", "title": "Lindsey Stirling Gives Dancing With the Stars Fans Update on Her Injury", "description": "What a tough cookie! Lindsey Stirling was hospitalized on Sunday, Oct. 29 after suffering a scary rib injury during Dancing With the Stars rehearsals the previous week. But, being the competitor that she...", "image": "https://www.closerweekly.com/wp-content/uploads/2017/11/lindsey-stirling.jpg?resize=1200%2C630&quality=86&strip=all", "creator": "@closerweekly", "site": "@closerweekly"}, "fb": {"admins": 593583017, "pages": 487501061346187}, "generator": "WordPress 6.0.2", "msapplication-TileImage": "https://www.closerweekly.com/wp-content/uploads/2020/11/android-chrome-192x192-1.png?fit=192%2C192&quality=86&strip=all"}, "movies": [], "publish_date": 1509985620.0, "source": "https://www.closerweekly.com", "summary": ""}