{"url": "https://web.archive.org/web/20180706153352/http://www.papermag.com/brendon-urie-lays-it-all-out-2584081623.html", "text": "Brendon Urie is 31. Yes, that Brendon Urie. The guy who only needs a smudge of eyeliner to incite mass hysteria. The guy whose first ever single — a highly complex song depicting a broken wedding, featuring robust characters and full dialogue —went four times platinum (he was 17). The guy who thought he was too cool for a young Alexa Chung. The guy who became an LGBTQ inspiration without ever openly identifying as queer (there's a entire Instagram account dedicated to notes of gratitude to the singer from fans). The guy who, despite being the last remaining member of cult band Panic! At the Disco, has managed to flourish the better part of 15 years in the industry. Do you feel inadequate? You probably should.\n\nPanic! At The Disco was never supposed to be Urie's. He was just drug-dealing, fornicating, weed-smoking Mormon kid, growing up eight minutes from the Las Vegas strip (he had his first threesome at 16, an event that inspired what has since become bisexual anthem \"Girls/Girls/Boys\"). When the high school junior heard that the cool kids, a rag-tag group of pubescent boys calling themselves \"Panic! At The Disco\" were in need of a temporary guitar player, he seized the opportunity.\n\nUrie quickly learned these kids were for real, they wanted to make it, and they needed the multi-instrumentalist's multi-octave tenor vocals to reach the next level. Their first foray into shows were performances at the local Mormon church (mama Urie would not let them take the stage without long pants and collared-shirts). On a whim, they sent demos to a recently signed-bassist, who was in the midst of creating his own debut album with a group of talented Chicago natives under the name Fall Out Boy. Pete Wentz drove to Vegas to meet with the teens personally. And then came \"I Write Sins Not Tragedies\" — affectionately abbreviated by Urie and fans to \"Sins.\"\n\n\"I Write Sins Not Tragedies\" is a weird track. It opens with a harpsichord (not your traditional alt-rock instrument), before using crashing drums, and distorted guitar to navigate infidelity, and the fickleness of human nature. It was remarkably cynical and intellectual for a group of teens, and set the chaotic tone for all Panic!'s future output — even as each member, save Urie, eventually departed. But alt-rock was in, Greenday, My Chemical Romance and Death Cab reigned, and Panic! At The Disco had brought something new to the conversation: narrative. Even over a decade on, the Urie-led band's latest project employs the same technique, no doubt a contributing factor to it shooting straight to number one on the Billboard Hot 200 upon its debut. Despite numerous opportunities, Urie never broke away from Panic! At The Disco to create his own brand; to the singer, Panic! is unfiltered, Panic! is fanatical (as are its followers), Panic! is freedom.\n\nSix albums later, Urie is still larger-than-life. He is known for his phenomenal stage presence (which earned a stint on Broadway in Cindy Lauper's Kinky Boots last year), something which, surprisingly, translates interpersonally, too. He was more jaded at 19 — a baby-faced pop punk idol with misguidedly long side-burns — in a now infamous interview with Alexa Chung, than he is 11 years on. Swigging a beer, he regales with anecdotes about the early years, his perfect, James Dean-esque quiff lightly swaying as he delicately vacillates between topics ranging from the serious to the surreal. It's obvious from the onset that Urie is a premier conversationalist, and he has opinions. No publicist hovers as Urie addresses his own #MeToo moments, his sexuality, his thoughts on politics, religion, or Aziz Ansari. They don't need to — Urie knows exactly who he is, and he's not going anywhere.\n\nShirt by Land of Distraction\n\nPop was such a different landscape when Panic! came out. Fall Out Boy, Gym Class Heroes, My Chemical Romance, Green Day. That was pop music. What was it about emo-rock that you think connected?\n\nI honestly don't know, but I'm so glad it did because it was our world. The teenage scene always pops up in some form or another — ours just became a little whinier, but I think it had to be relatable about some point. I honestly don't even know why it was so successful. Right before \"Sins\" broke for us, we were kind of flying by the seat of our pants. We didn't know anything about tour, didn't know how to conduct ourselves in a band. The guys in the band, everyone else had a better idea of what to expect. I was 17 when we did the record and 18 when we starting touring. I was so clueless.\n\nI think \"Sins\" was so special because it was such a narrative. It was a story from start to finish. Yeah Ryan [former guitarist] was going through a crazy break up, a lot of infidelity and he wanted to put it in a more mature sense. He was just dating the girl that basically just slept with the whole baseball team. He was so bummed, so he was like, \"I'm going to put it in the sense that we were about to get married and really just fuck this girl up.\" Did it fuck her up? I don't know, they talked after. They ended up dating for like another month after. He went back with her for like another month.\n\nWas it a huge personal hit when Ryan left? No, it had been happening for a while. It was a break up that needed to happen. We saw it happening and we said, \"I would rather be able to see you in public and give you a hug than see you and be like, 'Fuck you.'\" It was happening over a year and a half, or two. Our egos were bumping so hard. He was such a heartthrob in his own right. He has fans. There are still fans that ship us together as a gay couple. It's adorable. For like the last 13 years they are like \"Rydon is real.\" I tell them \"no\" all the time, and they don't believe me. I'm like, \"Good don't believe me.\"\n\nI remember reading yours and Ryan's strip club was a gay strip club. Actually my first bar was a gay bar, I got in underage technically. Ryan was 18 and I was 17 I think. We played a show somewhere in Texas. These two girls invited us out and she knew the bouncer so we just got in. I remember just being hit on all night and it was awesome. I was getting drinks all night. These guys would just come up and I was like, \"I'm flattered but I'm not interested but thank you.\" They were like, \"We'll get you interested sweetheart.\" I was just like, This is dope. I found the \"Thank You Brendon\" fan account on Instagram and there are all these people who say helped them embrace their bisexuality and to come to terms with queerness. How did that happen? I don't know. I wrote this song \"Girls, Girls, Boys\" about my first threesome when I was 15 or 16. That song was about my first threesome but they made it about coming out and accepting who you are as person which I thought, what a way better message. Taking this thing that I wrote about and then changing it to be more inspiring for your own purposes, what a beautiful idea.\n\n\"I guess you could qualify me as pansexual because I really don't care. If a person is great, then a person is great [...] I guess this is me coming out as pansexual.\"\n\nYou also don't buy into the old masculinity tropes. No. I'm married to a woman and I'm very much in love with her but I'm not opposed to a man because to me, I like a person. Yeah I guess you could qualify me as pansexual because I really don't care. If a person is great, then a person is great. I just like good people, if your heart's in the right place. I'm definitely attracted to men. It's just people that I am attracted to. So you're pansexual. I guess so, I guess this is me coming out as pansexual. Related | Janelle Monáe Is Out as Pansexual, and Here's What That Means Did you find yourself as a young man having to really come to terms with your sexuality? It was never weird for me. I know that it made a few people uncomfortable, when somebody gets uncomfortable about me doing what I used to call \"stage gay.\" It kind of presses me to want to do it more. What's \"stage gay\"? For our first headline tour I would go up to Ryan our guitar player, and like kiss him on the neck or kiss him on the mouth and he would be so mad. I was like, I just want to kiss you bro. I would hang out with friends and after five or six beers we're just kind of like smooching on each other. People just get hammered and fool around.\n\nYou call it \"barsexual,\" right? Oh, yeah barsexual. People get offended by that. I've said things without thinking about it — not trying to be offensive. I need to apologize for that. I'm of the, it's not what people say it's what they do and who they are. We're so focused on rhetoric and stuff it's like \"Yeah, Donald Trump says really dumb shit all the time but he's doing way worse shit.\"\n\nDo you feel like you need to get political in music now? Or do you want to have art be art — a means of escape.\n\nIn a way. I like my music to be an escape from it all, but then I like to use my celebrity as a means to fight for causes I believe in. I want to start foundations where I can start putting my time and efforts and energy and money into things that I believe in — whether it's helping the youth or disenfranchised groups. To me the kids are so smart nowadays and they mobilize without any inclination as to why or how they need to do it. Kids who are 14/15 are mobilizing. I didn't feel that strength at that age at all.\n\nJacket by Selected Homme, T-Shirt and Jeans by Simon Miller\n\nIt feels like the hate and the shootings are just so much more prolific now. It's just happening on the daily. I know, and the fact that we are reporting on it more is disheartening. It's also nice that these kids, again like the Parkland shooting, they are able to speak up without any hesitation and that shows me how courageous they really are. I don't think I had that and that of itself is inspiring. They are already miles ahead of where I was. Miles ahead in terms of their genuine passion for it, their love for it, but their genius behind it I don't think I would've had the means to do that. I also wanted to ask you, why do you think #MeToo never really touched the music industry? Oh yeah, I'm sure there is still time where stuff will come out. I don't think it's over by any means. The thing that sucks that I think, is that a lot of guys don't speak up. They don't want to snitch and I'm like, \"Motherfucker, snitch!\" Those guys aren't your friends, they're not good people. They are doing terrible things, tell people about it. Don't protect your friend. When all this stuff started coming out in the film industry more and more I'm was like, Of course. look at Harvey Weinstein he looks like a creep. That guy is so gross. Whose ass wants to be grabbed? I'm sure it's going to keep coming out, I hope it does. Did you ever have those moments in the early days, where you had to think, \"Oh am I taking advantage of my power?\" Oh absolutely. I even think back to times in high school where I think of a memory and it will be so embarrassing. Like I don't know if I overstepped a boundary. I was so young and dumb and unequipped to deal with certain things. I just hope that it never came across as creepy or just totally inappropriate because that's never where I was coming from.\n\n\"I like my music to be an escape from it all, but then I like to use my celebrity as a means to fight for causes I believe in.\"\n\nAre you behind cancel culture? Here's where I draw the line. If the liberals are saying, \"Hey why are you fining these NFL players [for kneeling during the anthem]?\" and at the same time, \"Fire Roseanne!,\" they are doing the exact same thing that the conservatives are doing. I get it but we have to understand, yes, Roseanne made the worst tweet. But we're taking people's careers away. I don't know where to draw the line because I do think obviously that's horrible, but I think we need to look at patterns. If a person says something a few times but they are not acting out on it... it's a very sticky situation. Do you censor yourself often? No I don't censor myself anymore. If I find that I offended somebody or they let me know I really try to apologize. At the same time, if we're saying You can't say that, we're kind of the worst. You're trying to change who people are which we should all be accepting of everyone. We need people to be honest and say those things then teach them, instead of just dragging them. The drag culture kind of bums me out. The Aziz Ansari situation was a difficult one, even women were so divided. So was I. Suzy Chin, who I worked on the last couple of records with, she is phenomenal, she's also had her share of stuff in the music industry — just terrible stuff. We were talking about that and I was like, \"Where do you land with it? Because who gives a fuck what I think, I'm just some dude but as woman in the industry, how do you feel?\" And she was like, \"Yeah it's tough, I don't know where I stand with certain things.\" I'm undecided about certain things but I'm open to talk about it. Just because it makes you uncomfortable, is it wrong? With a lot of these things it's like, yes.\n\nShirt by Helmut Lang, Suit by Richard James\n\nI think when it hits music it's going to be like an avalanche. There's no way it couldn't. We had things that have happened in the past... Like R. Kelly. Obviously, yeah. He signed Aaliyah at 14 and they were... He wrote that song for her, \"Age Ain't Nothing But a Number.\" It's like, shit, now it's dark. Marrying a minor I have to disagree with that, that's weird bro. There's a lot of creepiness going around, but I just hope we can keep having the conversation. What was fame like for you at such a young age? How was navigating that as a kid? It was not easy, I don't think I dealt with it very well. I got back on my medication. I had stopped taking medication for the last two years of high school.\n\nADHD? Yeah ADHD, anti-anxiety, and depression. I started taking them again at like 19 because the fame started getting to me. I kind of needed to numb myself a little bit. I want to medicate enough so that I can get through these interviews and meet these people. The first year was terrible. In terms of my interviews, I was either numb to the point where I didn't care or I was bitter. There was an interview I did in the UK with this girl, Alexa Chung, and I regret this to this day because I look back at that interview and I don't know who that is. I was so not in my right mind, I was just a dick. It was not cool. What did you do? I was just bitterness. I was like, Why are you even talking to me? I have a show in 30 minutes, fuck off. I didn't actually say that but I might as well. I could never forgive myself for that.\n\nRelated | Fashion Is Art: Our Collab With @ArtlexaChung Alexa Chung, if you're reading, Brendon is really sorry. Hashtag I am so sorry, Alexa. Honestly, that's one that will haunt me for the rest of my life, but it's good because I can look at that and say I never want to do that again. It made me feel so immediately bad. I was like, Why are you fucking saying this? You're such an asshole.\n\nWere your bandmates there? Oh yeah, I was in the room with my bass player John at the time. Also, at that time we were starting to hate each other a little bit. We started to grow distant a little more. The next year we were very much distant from each other. We started to realize we should break this up. Did you ever consider going off as a solo act? As Brendon Urie? I guess I still could. But your name and your brand is so synonymous with Panic.\n\nYeah I don't even have to now. Panic! has become my little play thing and I get to do more than I used to feel like I could. The first two or three years of the band I didn't feel like I had a license to create as much as I do now. I felt like I was the last guy who joined and you guys just included me. I just wanted to hang out with those guys. So then when I finally gained some self-respect and started to realize I could do whatever I wanted, I gained the confidence that I never had. I always wanted to do Panic. Panic the name symbolizes no rules.\n\nIn those early days the music had these really intense themes: religion, sex, and prostitution. All these intense, dark topics. You were all kids at this point. Yeah, we'd never been with a prostitute or been to a strip club. I know you grew up Mormon, what's your relationship with religion now? I'm not religious at all any more. Actually, I don't know if that's fair to say. I definitely think Panic! At The Disco is a cult by definition. I have to accept that it's a cult now. I have no relationship with religion anymore except that I will still read the scriptures sometimes. It's interesting to me. To read it now in the context of who I am now, thinking about who I was as a kid and how I let all this stuff affect me. Until I started thinking for myself. How was that for your parents? Oh, they were bummed. It would eat me up to hide things from my parents, so every six months I would call a family meeting and be like, \"Okay guys, in the last six months I have been smoking weed, dealing drugs, fucking promiscuously, sneaking out staying at friends houses.\" I would just drop bombs on them.\n\nWhat do you think was the sin that was the most hurtful to them? For them it was when I was 17 and the band was taking off. We knew we wanted to tour. We knew we had just gotten the deal with Pete [Wentz]. I sat them down, my mom and dad, I will never get this image out of my head. Just sitting at our table and just saying, \"I'm going to be totally honest with you guys, I'm pretty sure I'm atheist. I definitely don't want to be a part of your religion, I'm not going to college, and I'm not going on a mission for your church. I'm going to be apart of this band.\" Telling them that I don't believe in God broke their hearts. Then I sat them down and said, \"You know you guys are just as atheist as me, you just believe in one more God than I do.\" My mom was like, \"I could see how you could say that, but we don't see it that way.\" How do you think the band has evolved musically since that time? It's very cool to be able to look back at each album and think of who I was at that time. Memory is such a fickle thing because we romanticize it so much that I need the people around me who are the opposite of \"Yes\" people. They do not feed into my ego one bit, which is so healthy I think it's good to have. That helps me keep perspective on where I was at during those times with each album. From the first one, not knowing what the fuck I was doing to now feeling more confident. It has helped me with writing, producing, in terms of ideas that I want to use, direction, vision, all that stuff has grown exponentially.\n\n\"Don't listen to other people: if you have a vision, do your vision.\"\n\nYou also had that huge Panic! moment to live up to with the second album. The sophomore release. How was that? Oh we were just on mushrooms the whole time. When we were writing for the second album we locked ourselves away in a cabin for about three months. We had this idea to do like a musical. The music ended up being way too ambitious and we were all fighting so much. This was kind of the beginning of the end. We were trying to do this whole thing and it didn't work out at all. Spencer and Ryan had never drank, never done drugs, so this was like their college experience. So we were all raging so hard for that whole album. I think we were doing it to cope with each other too because we had lived with each other basically every day for like three years. We were just tired so we were like let's go live together in a cabin and take psychedelics, because that'll help I guess. Have you felt like you're always been chasing that early success? We've actually done the opposite, like, Who gives a fuck what people think? I think bands need to figure out what they want to do and wholeheartedly chase that dream. Don't listen to anybody else, especially when you are creating an album. If you listen to too many outside opinions, the committee who tries to create the horse comes out a camel. If you have your vision of the horse, don't let them tell you it has two humps. Don't listen to other people: if you have a vision, do your vision. We always kept true to that, which I'm so grateful for.", "images": ["https://web.archive.org/web/20180706153352im_/https://adserver.adtechus.com/adserv/3.0/5151/3676210/0/529/ADTECH;loc=300;key=key1+key2+key3+key4", "https://web.archive.org/web/20180706153352im_/https://assets.rbl.ms/18157565/980x.jpg", "https://web.archive.org/web/20180706153352im_/https://www.facebook.com/tr?id=547949808911864&ev=PageView&noscript=1", "https://web.archive.org/web/20180706153352im_/https://assets.rbl.ms/18157561/980x.jpg", "https://web.archive.org/web/20180706153352im_/https://assets.rbl.ms/18157575/980x.jpg", "https://web.archive.org/web/20180706153352im_/https://assets.rbl.ms/18157571/980x.jpg", "https://web.archive.org/web/20180706153352im_/https://assets.rbl.ms/18157566/980x.jpg", "https://web.archive.org/web/20180706153352im_/http://adserver.adtechus.com/adserv/3.0/5151/3988692/0/16/ADTECH;loc=300;key=key1+key2+key3+key4", "https://web.archive.org/web/20180706153352im_/https://adserver.adtechus.com/adserv/3.0/5151/3676214/0/16/ADTECH;loc=300;key=key1+key2+key3+key4", "https://web.archive.org/web/20180706153352im_/https://adserver.adtechus.com/adserv/3.0/5151/3742959/0/0/ADTECH;loc=300;key=key1+key2+key3+key4", "https://web.archive.org/web/20180706153352im_/https://adserver.adtechus.com/adserv/3.0/5151/3676211/0/0/ADTECH;loc=300;key=key1+key2+key3+key4;allowedSizes=728x90,970x250", "https://web.archive.org/web/20180706153352im_/https://assets.rbl.ms/18157564/980x.jpg", "https://web.archive.org/web/20180706153352im_/https://papermag-img.rbl.ms/simage/https%3A%2F%2Fassets.rbl.ms%2F18157559%2F1200x600.jpg/2000%2C2000/2fXL7HUQ1%2FW9UhmY/img.jpg", "https://web.archive.org/web/20180706153352im_/http://www.papermag.com/static/img/whitelabel/papermag/paper_title.png?2", "https://web.archive.org/web/20180706153352im_/https://adserver.adtechus.com/adserv/3.0/5151/3676213/0/225/ADTECH;loc=300;key=key1+key2+key3+key4"], "top_img": "https://web.archive.org/web/20180706153352im_/https://papermag-img.rbl.ms/simage/https%3A%2F%2Fassets.rbl.ms%2F18157559%2F1200x600.jpg/2000%2C2000/2fXL7HUQ1%2FW9UhmY/img.jpg", "keywords": [], "authors": ["Beatrice Hazlehurst", "Jhoni Jackson", "Justin Moran", "Story Jhoni Jackson", "Photography Bethany Vargas"], "canonical_link": "https://web.archive.org/web/20180706153352/http://www.papermag.com/brendon-urie-lays-it-all-out-2584081623.html", "title": "Brendon Urie: \"This Is Me Coming Out as Pansexual\"", "meta_data": {"twitter": {"card": "summary_large_image", "site": "@", "image": "https://web.archive.org/web/20180706153352im_/https://assets.rbl.ms/18157559/1200x600.jpg?1530890944"}, "fb": {"app_id": 1507945686182456}, "og": {"type": "article", "url": "https://web.archive.org/web/20180706153352/http://www.papermag.com/brendon-urie-lays-it-all-out-2584081623.html", "site_name": "PAPER", "image": {"identifier": "https://web.archive.org/web/20180706153352im_/https://papermag-img.rbl.ms/simage/https%3A%2F%2Fassets.rbl.ms%2F18157559%2F1200x600.jpg/2000%2C2000/2fXL7HUQ1%2FW9UhmY/img.jpg", "width": 2000, "height": 1000}, "title": "Brendon Urie Lays It All Out", "description": "The Panic! At The Disco frontman opens up about #MeToo, pansexuality, and Mormonism."}, "article": {"section": "Music", "published_time": "2018-07-06T13:42:28", "modified_time": "2018-07-06T14:10:47"}, "referrer": "always", "viewport": "width=device-width,initial-scale=1,minimum-scale=1.0,maximum-scale=1.0,user-scalable=no", "google-site-verification": "jOnt41cT1_AQeKXtlLnkxf2lxC7abvZ0uxLoe-6Kxco", "keywords": "brendon urie, panic! at the disco", "description": "The Panic! At The Disco frontman opens up about #MeToo, pansexuality, and Mormonism."}, "movies": ["https://web.archive.org/web/20180706153352if_/https://www.youtube.com/embed/BzbxacRr5Gk?rel=0?enablejsapi=1"], "publish_date": 1530880948.0, "source": "https://web.archive.org", "summary": ""}