{"url": "https://www.hollywoodreporter.com/live-feed/bachelorette-frontrunner-garrett-controversial-social-media-posts-1116281", "text": "The contestant at the center of The Bachelorette‘s week-one, off-air controversy is apologizing for his “hurtful and offensive” social media history.\n\nGarrett Yrigoyen, an early frontrunner on the new cycle of Becca Kufrin’s Bachelorette season on ABC, has taken to his Instagram to explain his social media behavior. Shortly after the new season launched Monday night, Yrigoyen’s political beliefs and character were called into question when screengrabs of his Instagram activity were shared by another former Bachelor contestant. The images appeared to show Yrigoyen, a medical sales rep from Nevada, liking Instagram posts that mocked undocumented immigrants; the trans community; liberal feminists; and that spread misinformation about Parkland, Florida, shooting survivor David Hogg.\n\nNow, the contestant is taking responsibility for the posts.\n\n“I am sorry to those who I offended, and I also take full responsibility for my ‘likes’ on Instagram that were hurtful and offensive,” Yrigoyen wrote Thursday in a lengthy statement posted to his new Instagram account. He had deleted his former account after the reports. “I decided to take it down and start fresh because I have learned an extremely valuable lesson and am taking steps to grow, become more educated, and be a better version of myself.”\n\nHe continued, “I am not perfect, and I will never be anywhere close, but now I will always be more informed and aware of what I am liking and supporting, not just on Instagram, but in life.”\n\nIn his statement, Yrigoyen went on to say that he “did not mean any harm” by his actions. “I am not the negative labels people are associating me with,” he said. “I do not want my social media to define who I am, and I will take better care moving forward to support all walks of life.”\n\nThe comment from Yrigoyen, one of the initial 28 contestants on the new season of the long-running ABC reality franchise, is unexpected. Typically, contestants on The Bachelor and The Bachelorette do not address anything related to the season until they are eliminated. ABC and the show’s producer Warner Bros. have so far declined to comment on the story.\n\nThe silence from Yrigoyen, however, only fueled the coverage of the story — especially since he is believed to be a serious contender this season. He received Kufrin’s “first impression” rose and only kiss on Monday’s premiere, an honor that has gone to the eventual winner on the last three seasons of The Bachelorette.\n\nKufrin herself addressed the controversy Wednesday and asked viewers to be open-minded as the season continues to air. (Yrigoyen made it past the first rose ceremony.)\n\n“People say and do certain things. I’ve done things in the past that I’m sure it wasn’t the best thing,” she told Entertainment Tonight. “I can’t fault anyone for what they believe, and who’s to say that anything that anyone likes is truly what they believe in if they just double tap [a picture on Instagram]. I can’t speak to that because it’s not me. I am a strong woman and I do believe in certain things, but again, that’s what’s so great about our country is that everyone is entitled to their own opinions.”\n\nYrigoyen’s social media history stood in contrast to that of Kufrin, who has supported Hillary Clinton and the Women’s March. Now that Yrigoyen has offered his side of the story, it remains to be seen how the show will address the situation as the season continues to air. One option is host Chris Harrison discussing the off-air development during one of the specials that will air later in the season.\n\nRead Yrigoyen’s full statement below.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/148893_0412-h_2018.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/148893_0412-h_2018.jpg?w=1024", "keywords": [], "authors": ["Jackie Strause"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/bachelorette-frontrunner-garrett-controversial-social-media-posts-1116281/", "title": "‘Bachelorette’ Frontrunner Apologizes for “Hurtful and Offensive” Social Media History", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Garrett Yrigoyen, a frontrunner on Becca Kufrin's ABC season, addressed his controversial social media history on Instagram.", "news_keywords": "ABC, The Bachelorette", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Jackie Strause", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1116281, "title": "'Bachelorette' Frontrunner Apologizes for \"Hurtful and Offensive\" Social Media History", "published_at": "2018-05-31 16:33:20", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/148893_0412-h_2018.jpg?w=1024", "comment_count": 0, "tags": "The Bachelorette", "topics": "TV News", "body": "The contestant at the center of The Bachelorette's week-one, off-air controversy is apologizing for his \"hurtful and offensive\" social media history.\r\nGarrett Yrigoyen, an early frontrunner on the new cycle of Becca Kufrin's Bachelorette season on ABC, has taken to his Instagram to explain his social media behavior. Shortly after the new season launched Monday night, Yrigoyen's political beliefs and character were called into question when screengrabs of his Instagram activity were shared by another former Bachelor contestant. The images appeared to show Yrigoyen, a medical sales rep from Nevada, liking Instagram posts that mocked undocumented immigrants; the trans community; liberal feminists; and that spread misinformation about Parkland, Florida, shooting survivor David Hogg.\r\nNow, the contestant is taking responsibility for the posts.\r\n\"I am sorry to those who I offended, and I also take full responsibility for my 'likes' on Instagram that were hurtful and offensive,\" Yrigoyen wrote Thursday in a lengthy statement posted to his new Instagram account. He had deleted his former account after the reports. \"I decided to take it down and start fresh because I have learned an extremely valuable lesson and am taking steps to grow, become more educated, and be a better version of myself.\"\r\nHe continued, \"I am not perfect, and I will never be anywhere close, but now I will always be more informed and aware of what I am liking and supporting, not just on Instagram, but in life.\"\r\nIn his statement, Yrigoyen went on to say that he \"did not mean any harm\" by his actions. \"I am not the negative labels people are associating me with,\" he said. \"I do not want my social media to define who I am, and I will take better care moving forward to support all walks of life.\"\r\nThe comment from Yrigoyen, one of the initial 28 contestants on the new season of the long-running ABC reality franchise, is unexpected. Typically, contestants on The Bachelor and The Bachelorette do not address anything related to the season until they are eliminated. ABC and the show's producer Warner Bros. have so far declined to comment on the story.\r\nThe silence from Yrigoyen, however, only fueled the coverage of the story — especially since he is believed to be a serious contender this season. He received Kufrin's \"first impression\" rose and only kiss on Monday's premiere, an honor that has gone to the eventual winner on the last three seasons of The Bachelorette.\r\nKufrin herself addressed the controversy Wednesday and asked viewers to be open-minded as the season continues to air. (Yrigoyen made it past the first rose ceremony.)\r\n\"People say and do certain things. I've done things in the past that I'm sure it wasn't the best thing,\" she told Entertainment Tonight. \"I can't fault anyone for what they believe, and who's to say that anything that anyone likes is truly what they believe in if they just double tap [a picture on Instagram]. I can't speak to that because it's not me. I am a strong woman and I do believe in certain things, but again, that's what's so great about our country is that everyone is entitled to their own opinions.\"\r\nYrigoyen's social media history stood in contrast to that of Kufrin, who has supported Hillary Clinton and the Women's March. Now that Yrigoyen has offered his side of the story, it remains to be seen how the show will address the situation as the season continues to air. One option is host Chris Harrison discussing the off-air development during one of the specials that will air later in the season.\r\nRead Yrigoyen's full statement below.\r\n\r\n\t\r\n\t\t\r\n\t\t\t\r\n\t\t\t\t \r\n\t\t\r\n\t\tA post shared by Garrett Yrigoyen GY (@gy_yrigoyen) on May 31, 2018 at 4:22pm PDT", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Bachelorette’ Frontrunner Apologizes for “Hurtful and Offensive” Social Media History", "url": "https://www.hollywoodreporter.com/tv/tv-news/bachelorette-frontrunner-garrett-controversial-social-media-posts-1116281/", "description": "Garrett Yrigoyen, a frontrunner on Becca Kufrin’s ABC season, addressed his controversial social media history on Instagram.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/148893_0412-h_2018.jpg?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2018-05-31T16:33:20+00:00", "modified_time": "2018-06-01T13:30:01+00:00"}, "twitter": {"site": "@thr", "creator": "@jackiedstrause", "card": "summary_large_image", "title": "‘Bachelorette’ Frontrunner Apologizes for “Hurtful and Offensive” Social Media History", "description": "Garrett Yrigoyen, a frontrunner on Becca Kufrin’s ABC season, addressed his controversial social media history on Instagram.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/06/148893_0412-h_2018.jpg?w=1280"}}, "movies": [], "publish_date": 1527784400.0, "source": "https://www.hollywoodreporter.com", "summary": ""}