{"url": "https://en.wikipedia.org/wiki/Chappaquiddick_incident", "text": "1969 car crash involving Edward Kennedy and Mary Jo Kopechne\n\nThe Chappaquiddick incident was a single-vehicle car crash that occurred on Chappaquiddick Island in Massachusetts some time around midnight between July 18 and 19, 1969.[5][6] The crash was caused by Senator Edward M. \"Ted\" Kennedy's negligence, and resulted in the death of his 28-year-old passenger Mary Jo Kopechne, who was trapped inside the vehicle.[7][8][9][10]\n\nKennedy left a party on Chappaquiddick at 11:15 p.m. Friday. He maintained that his intent was to immediately take Kopechne to a ferry landing and return to Edgartown, but that he accidentally made a wrong turn onto a dirt road leading to a one-lane bridge. After his car skidded off the bridge into Poucha Pond, Kennedy swam free, and maintained that he tried to rescue Kopechne from the submerged car, but that he could not. Kopechne's death could have happened any time between about 11:30 p.m. Friday and 1 a.m. Saturday, as an off-duty deputy sheriff stated he saw a car matching Kennedy's license plate at 12:40 a.m. Kennedy left the scene and did not report the crash to police until after 10 a.m. Saturday. Meanwhile, a diver recovered Kopechne's body from Kennedy's car shortly before 9 a.m. Saturday.\n\nAt a July 25, 1969, court hearing, Kennedy pled guilty to a charge of leaving the scene of an accident, and received a two-month suspended jail sentence. In a televised statement that same evening, he said his conduct immediately after the crash \"made no sense to me at all\", and that he regarded his failure to report the crash immediately as \"indefensible\". A January 5, 1970 judicial inquest concluded that Kennedy and Kopechne did not intend to take the ferry, and that Kennedy intentionally turned toward the bridge, operating his vehicle negligently, if not recklessly, at too high a speed for the hazard which the bridge posed in the dark. The judge stopped short of recommending charges, and a grand jury convened on April 6, 1970, returning no indictments. On May 27, 1970, a Registry of Motor Vehicles hearing resulted in Kennedy's driver's license being suspended for a total of sixteen months after the crash.\n\nThe Chappaquiddick incident became national news that influenced Kennedy's decision not to run for President in 1972 and 1976,[8][9][10] and it was said to have undermined his chances of ever becoming President.[11] Kennedy ultimately decided to enter the 1980 Democratic Party presidential primaries, but earned only 37.6% of the vote and lost the nomination to incumbent President Jimmy Carter.\n\nBackground [ edit ]\n\nTed Kennedy in 1968\n\nU.S. Senator Edward M. (Ted) Kennedy, age 37, and his cousin, Joseph Gargan, 39,[Notes 1] planned to race Kennedy's sailboat, Victura, in the 1969 Edgartown Yacht Club Regatta on Friday and Saturday, July 18 and 19, 1969, after having forgone the previous year's Regatta because of the assassination of Kennedy's brother, Robert, that June.[13] Gargan rented secluded Lawrence Cottage for the weekend on Chappaquiddick Island,[14] which is a tiny island accessible by ferry from Edgartown on Martha's Vineyard. They hosted a cookout party at the cottage at 8:30 p.m that evening[15] as a re-union for the \"Boiler Room Girls\", women who had served on Robert Kennedy's 1968 presidential campaign. Six of these attended the party: Mary Jo Kopechne, Rosemary Keough, Esther Newberg, sisters Nance and Mary Ellen Lyons, and Susan Tannenbaum. All were in their twenties, and single.\n\nThe men at the party included the crew of Kennedy's sailboat entered in the regatta: Gargan; Paul Markham, a school friend of Gargan who had previously served as the U.S. Attorney for Massachusetts;[16] and John B. Crimmins, 63,[8] a long-time political associate of Kennedy who served as his chauffeur for the weekend.[17] Others in attendance were attorney Charles Tretter, a Kennedy advisor; and Raymond LaRosa, who had worked on Kennedy's Senate campaigns. All the men were married, except Crimmins;[8] wives were not invited to the Chappaquiddick weekend.[18] Other friends and campaign workers, male and female, had been invited, but did not attend, for various reasons. Markham and Crimmins intended to spend the night at the cottage, while the others were booked at hotels on Martha's Vineyard - the men at the Shiretown Inn, one block from the Edgartown ferry slip, and the women at the Katama Shores motor inn, about 2 miles (3.2 km) south of the ferry slip.[19]\n\nSequence of events [ edit ]\n\nThe crash [ edit ]\n\nThe Dike Bridge is accessible only by a dirt road, and leads to dead-end sand dunes past Poucha Pond. The guardrail was not present in 1969.\n\nAccording to Kennedy, Kopechne asked him to give her a ride back to her hotel in Katama. Kennedy requested the keys to his car (which he did not usually drive) from his chauffeur Crimmins.[20] Kennedy put this time at \"approximately 11:15 p.m.\", although he was not wearing a watch;[8] the time came from Crimmins' watch.[21] Returning to Edgartown and Katama required making the last ferry, which left the island at midnight, or else calling to arrange a later ferry. Kopechne told no one else that she was leaving for the night with Kennedy, and, in fact, left her purse and hotel key at the party.[22]\n\nThe exact time the crash occurred is unknown, due to a conflict between the testimony of Kennedy and a deputy sheriff who claimed to have seen his car at a later time. Kennedy claimed that, as soon as he left the party, he immediately drove one-half mile (0.8 km) north on Chappaquiddick Road headed for the ferry landing, and mistakenly made a wrong turn, right, onto the dirt Dike Road, instead of bearing left to stay on the paved Chappaquiddick Road for another two and a half miles (4.0 km). There is also a northbound dirt Cemetery Road at this intersection.[citation needed]\n\nPart-time Deputy Sheriff Christopher \"Huck\" Look left work by 12:30 a.m. on Saturday as a gate guard in uniform for the regatta dance, returned to Chappaquiddick Island in the yacht club's private boat, and drove east and south on Chappaquiddick Road toward his home. At around 12:40 a.m., after he passed the intersection with Dike Road, he saw a dark four-door sedan driven by a man, with a woman in the front seat, approaching and passing slowly in front of him. The car drove off the pavement onto Cemetery Road, and stopped. Thinking the occupants of the car might be lost, Look stopped and walked towards the other vehicle. When he was 25 to 30 feet (7.6 to 9.1 m) away, the car reversed and started backing up towards him. As he called out to offer help, the car moved forward and veered quickly eastward onto Dike Road, speeding away and leaving a cloud of dust.[23] Look recalled that the car's license plate began with an L and contained two 7s, consistent with Kennedy's license L78–207 on his Oldsmobile Delmont 88.[8] He returned to his car, and continued on his way south. Look's version, if true, leaves over an hour of Kennedy's time with Kopechne unaccounted before the crash.[citation needed]\n\nAbout a minute later, Look saw Kennedy's party guests Nance and Mary Ellen Lyons, and Ray LaRosa, dancing in a conga line down the middle of Chappaquiddick Road, a short distance south of Dike bridge. He stopped to ask if they needed a ride, which they declined. LaRosa and the Lyons sisters corroborated Look's testimony about meeting him in the road and the verbal exchange, but they were unsure of the time. They also said they saw a vehicle driving north on Chappaquiddick Road, which they could not describe in any detail.[citation needed]\n\nDike Road leads seven-tenths of a mile (1.1 km) to Dike Bridge,[24] a wooden structure angled obliquely to the road, crossing the channel connecting Cape Pogue Pond to the north and Poucha Pond to the south,[25] leading eastward to a barrier beach known as Tom's Neck Point.[26] At the time, the bridge was not fitted with guardrails.[27] A fraction of a second before Kennedy reached the bridge, he applied his brakes and lost control of the car, which launched over the southern end of the bridge, plunged nose-first into the channel,[28] and flipped over, resting on its roof.\n\nRescue attempts [ edit ]\n\nDike House, along Dike Road, is 150 yards from the bridge.\n\nKennedy was able to swim free of the vehicle, but Kopechne was not. Kennedy said that he called her name several times from the shore, and tried to swim down to reach her seven or eight times. He then rested on the bank for around 15 minutes, before he returned on foot to Lawrence Cottage. He denied seeing any house with a light on during his 15-minute walk back.[29] His route back took him past four houses from which he could have telephoned to summon help before he reached the cottage, but he did not attempt to contact the local residents.[30] The first of the houses was Dike House, 150 yards (140 m) from the bridge and occupied by Sylvia Malm and her family. Malm stated later that she was home, she had a phone, and she had left a light on at the residence when she retired that evening.[31]\n\nKennedy returned to the cottage, where the party was still in progress, but rather than alerting all of the guests to the crash, he quietly summoned Gargan and Markham, and collapsed in the back seat of a rented Plymouth Valiant parked in the driveway. Gargan drove the three to the site of the crash, in order to try to rescue Kopechne from Kennedy's overturned car. Gargan and Markham jumped into the pond, and tried repeatedly to rescue her,[18] but were not able to, due to the strong tidal current. After they recovered, Gargan drove Kennedy and Markham to the ferry landing. The three were all lawyers, and they discussed what they should do while standing next to a public phone booth at the landing. Gargan and Markham insisted multiple times that the crash had to be reported to the authorities.[32]\n\nKennedy's reaction [ edit ]\n\nKennedy suddenly dove into the channel, swam the 500 feet (150 m) across to Edgartown, and returned to his hotel room, where he removed his clothes and collapsed on his bed.[33] He later put on dry clothes, left his room, and asked someone what the time was; it was somewhere around 2:30 a.m., he recalled. Meanwhile, Gargan and Markham had driven the rental car back to the cottage; they entered the cottage at approximately 2 a.m., but told no one what had happened. When questioned by the guests, they said that Kennedy had swum back to Edgartown, and Kopechne was probably at her hotel. Gargan then told everyone to get some sleep.\n\nBy 7:30 a.m., Kennedy was talking casually to the winner of the previous day's sailing race, and gave no indication that anything was amiss.[16] At 8 a.m., Gargan and Markham had crossed back to Edgartown on the ferry, and met Kennedy.[citation needed]\n\nRecovery of the body [ edit ]\n\nA short time after 8 a.m., a man and a fifteen-year-old boy, who went fishing off Tom's Neck Point, saw Kennedy's submerged car in Poucha Pond and notified the residents of the cottage nearest the scene, who, in turn, called the authorities at about 8:20 a.m.[34] Edgartown Police Chief Dominick James Arena arrived at the scene about 10 or 15 minutes later.[35] He attempted to examine the interior of the submerged vehicle,[35][36] then summoned a trained scuba diver and equipment capable of towing or winching the vehicle out of the water. John Farrar, captain of the Edgartown Fire Rescue unit, arrived at 8:45 a.m., equipped with scuba gear, and discovered Kopechne's body in the back seat; he extricated it from the vehicle within 10 minutes.[37][38] Police checked the car's license plate, and saw that it was registered to Kennedy.[18] Rosemary Keough's purse was found in the front passenger compartment of the car, causing Arena to misidentify Kopechne.[39][Notes 2]\n\nMeanwhile, Kennedy, Gargan, and Markham crossed back to Chappaquiddick Island on the ferry, where Kennedy made a series of telephone calls from a pay phone near the ferry crossing—the same phone that the three men had stood by approximately six hours earlier discussing Kennedy's options. Kennedy called friends and lawyers for advice, however, instead of notifying the authorities that he was the operator of the vehicle, which was still upside down in Poucha Pond. He called his brother-in-law Stephen Edward Smith,[Notes 3][40] congressman John V. Tunney,[41] and others that morning, but he still did not report the accident to authorities.[16]\n\nKennedy was still at the pay phone when he heard that his car and Kopechne's body had been discovered;[42] he then crossed back to Edgartown to go to the police station with Markham. Meanwhile, Gargan went to the Katama Shores to inform the Boiler Room Girls of the incident.[16] Kennedy entered the police station at approximately 9:50 a.m. He asked to make some telephone calls, and was told he could use Arena's office. When Arena returned to the station at 10:00, he was \"stunned\" to learn Kennedy already knew of the accident and the true identity of the victim, and admitted he was the driver.[43] Arena led Kennedy to another empty office where he could privately dictate his statement to Markham, who wrote it out in long hand. Arena then typed out the statement:[44][Notes 4]\n\nOn July 18, 1969, at approximately 11:15 p.m. in Chappaquiddick, Martha's Vineyard, Massachusetts, I was driving my car on Main Street on my way to get the ferry back to Edgartown. I was unfamiliar with the road and turned right onto Dyke [sic] Road,[Notes 5] instead of bearing hard left on Main Street. After proceeding for approximately one-half mile on Dyke [sic] Road, I descended a hill and came upon a narrow bridge.[Notes 6] The car went off the side of the bridge. There was one passenger with me, one Miss Mary ___,[Notes 7] a former secretary of my brother, Sen. Robert Kennedy. The car turned over and sank into the water, and landed with the roof resting on the bottom. I attempted to open the door and the window of the car, but have no re-collection of how I got out of the car. I came to the surface, and then repeatedly dove down to the car, in an attempt to see if the passenger was still in the car. I was unsuccessful in the attempt. I was exhausted and in a state of shock. I recall walking back to where my friends were eating. There was a car parked in front of the cottage, and I climbed into the backseat. I then asked for someone to bring me back to Edgartown. I remember walking around for a period and then going back to my hotel room. When I fully realized what had happened this morning, I immediately contacted the police.\n\nKennedy said the statement was correct as Arena typed it, but did not sign it.[45]\n\nAs the Medical Examiner Dr. Robert Nevin had the day off, Associate Medical Examiner Dr. Donald Mills was called to the crash site to examine the body. He was satisfied that the cause of death was accidental drowning, but asked the District Attorney's office for direction on whether an autopsy was necessary, and was told it was not, as long as there were no signs of foul play and he was satisfied it was a drowning. He signed the death certificate to that effect and released the body for embalming, and directed that a blood sample be collected and sent to the State Police for analysis of alcohol content.[46] The result was 0.09%, which Mills mistakenly thought represented only a \"moderate\" level, but, in fact, indicated in a person of Kopechne's weight, up to five drinks of liquor within an hour prior to death.[47]\n\nKopechne's body was released to her family, and the funeral was held on Tuesday, July 22, in Plymouth, Pennsylvania.[48][49][50]\n\nMedical Examiner Nevin strongly disagreed with Mills' decision to forgo autopsy,[51] believing that ruling out foul play would work to Kennedy's advantage by laying prurient public speculation to rest.[52]\n\nAfter President Richard Nixon's security operative Jack Caulfield learned of the incident, he dispatched Anthony Ulasewicz to Dike Bridge in disguise as a newspaper reporter to collect information since he believed Kennedy would be his rival in the 1972 presidential election. Although Ulasewicz was able to interview several witnesses before law enforcement authorities, he found no useful information.[53]\n\nDisputed cause of death [ edit ]\n\nFarrar, who recovered Kopechne's body from the submerged car,[54] believed that Kopechne died from suffocation, rather than from drowning or from the impact of the overturned vehicle, based upon the posture in which he found the body in the well of the back seat of the car, where an air pocket would have formed. Rigor mortis was apparent, her hands were clasping the back seat, and her face was turned upward.[55] Bob Molla, an inspector for the Massachusetts Registry of Motor Vehicles who investigated the crash at the time, said that parts of the roof and the trunk appeared to be dry.[56] Farrar publicly asserted that Kopechne likely would have survived if a more timely rescue attempt had been conducted.[57][58][59]\n\nDefense strategy [ edit ]\n\nEdgartown and Chappaquiddick Island in relation to the Kennedy compound in Hyannis Port , south of Cape Cod\n\nKennedy returned to his family's compound in Hyannis Port. Stephen Smith, Robert McNamara, Ted Sorensen, Richard N. Goodwin, Lem Billings, Milton Gwirtzman, David W. Burke, John Culver, Tunney,[41] Gargan,[60] Markham, and others arrived to advise him.[61] Smith, the Kennedy family business manager and \"master fixer\",[61] resigned himself to the fact that the political damage had been done, and Kennedy's chance of running for President at the next available window, 1972, was gone. The problem remained how to protect him from a charge of manslaughter.[61]\n\nArraignment [ edit ]\n\nKennedy's court hearing was held before Massachusetts District Court Judge James Boyle on July 25, seven days after the incident. Kennedy pleaded guilty to a charge of leaving the scene of an accident causing bodily injury. His attorneys argued that any jail sentence should be suspended, and the prosecutors agreed by citing his age (37), character, and prior reputation.[62] \"Considering the unblemished record of the defendant, and insofar as the Commonwealth represents this is not a case where he was really trying to conceal his identity...\", Boyle sentenced him to the statutory minimum two months in prison, which he suspended, saying that he \"has already been, and will continue to be punished far beyond anything this court can impose.\"[4]\n\nDespite an Associated Press story published that morning, Boyle was unaware that Kennedy's driving record was, in fact, far from \"unblemished\".[4] While attending University of Virginia School of Law (1956–1959), he had compiled a record of reckless driving and driving without a license.[63] In one particular March 14, 1958, incident, Kennedy ran a red light, then cut his tail lights and raced to avoid a highway patrol officer. When Kennedy was caught, he was cited for reckless driving, racing to avoid pursuit, and driving without a license.[64]\n\nKennedy's wife Joan was pregnant at the time of the Chappaquiddick incident. She was confined to bed because of two previous miscarriages, but she attended Kopechne's funeral and stood beside her husband in court.[65] Soon after, she suffered a third miscarriage,[66] which she blamed on the Chappaquiddick incident.[67]\n\nKennedy's televised statement [ edit ]\n\nAt 7:30 p.m. on July 25, Kennedy delivered a lengthy speech about the incident, prepared by Sorensen[61][68] and broadcast live by the three television networks.[69][70] He began by reading the speech off a prepared manuscript.[71]\n\nKennedy explained that his wife did not accompany him to the regatta due to \"reasons of health\". He denied he engaged in any \"immoral conduct\" with Kopechne or driving under the influence of alcohol that evening. He said that his conduct during the hours immediately after the accident \"made no sense to me at all\", and said that his doctors had informed him he had suffered \"cerebral concussion and shock\". He said he regarded his failure to report the accident to the police immediately as \"indefensible\". To the horror of Gargan's attorney, his statement revealed his enlistment of the help of Gargan and Markham to try to rescue Kopechne (despite assurances he had made to the effect that he would not involve them).[citation needed]\n\nHe said \"all kinds of scrambled thoughts\" went through his mind after the accident, including \"whether the girl might still be alive somewhere out of that immediate area\", whether \"some awful curse actually did hang over all the Kennedys\", whether there was \"some justifiable reason for me to doubt what had happened and to delay my report\", and whether, \"somehow, the awful weight of this incredible incident might in some way pass from my shoulders\".[citation needed] He said he was overcome \"by a jumble of emotions — grief, fear, doubt, exhaustion, panic, confusion, and shock\". He said he instructed Gargan and Markham \"not to alarm Mary Jo's friends that night\", then returned to the ferry with the two men and \"suddenly jumped into the water and impulsively swam across, nearly drowning once again in the effort, returning to my hotel around 2 a.m. and collapsed in my room\".[citation needed]\n\nKennedy then put down his manuscript (though he continued reading from cue cards), and asked the people of Massachusetts to decide whether he should resign:[citation needed]\n\n\"If, at any time, the citizens of Massachusetts should lack confidence in their Senator's character or his ability, with or without justification, he could not, in my opinion, adequately perform his duties, and should not continue in office. The opportunity to work with you and serve Massachusetts has made my life worthwhile. So, I ask you tonight, the people of Massachusetts, to think this through with me. In facing this decision, I seek your advice and opinion. In making it, I seek your prayers. For this is a decision that I will have finally to make on my own.\"\n\nThe speech concluded with a passage quoted from John F. Kennedy's book Profiles in Courage (ghostwritten by Sorensen): \"A man does what he must — in spite of personal consequences\".[72]\n\nCritical reaction to the speech was immediate and negative. NBC newsman John Chancellor compared it to Richard Nixon's 1952 Checkers speech. Kennedy admirer David Halberstam wrote in Harper's magazine that it was \"of such cheapness and bathos as to be a rejection of everything the Kennedys had stood for in candor and style. It was as if these men had forgotten everything which made the Kennedys distinctive in American politics, and simply told the youngest brother that he could get away with whatever he wanted because he was a Kennedy in Massachusetts.\"[61]\n\nInquest [ edit ]\n\nAlthough Kennedy received many messages from voters opposed to his resignation from the Senate, reaction in much of the news media, and of District Attorney Edmund Dinis, was that Kennedy's televised speech left many questions unanswered about how the accident happened, and his delay in reporting it. On July 31, 1969, the same day Kennedy returned to his Senate seat,[73] Dinis wrote to the Chief Justice of the Massachusetts Superior Court, Joseph Tauro, asking for a judicial inquest into Kopechne's death.[74] He received a response the next day that such inquests are under jurisdiction of the District Court. Dinis then sent his request to Kenneth Nash, the Chief Justice of the lower court.[75] Nash advised Dinis that a grand jury investigation had more \"teeth\" than an inquest, as it had the power to indict defendants, whereas an inquest was only authorized to determine if a crime has been committed.\n\nDinis met with Edgartown District Court Judge James Boyle on August 8 to explain his reasons for requesting the inquest. Boyle did not recuse himself, even though he had presided over the hearing at which Kennedy pled guilty.[76] Boyle announced the inquest was scheduled to start on September 3, and would be open to the press.[77] On September 2, Kennedy's lawyers petitioned the Massachusetts Supreme Court for a temporary injunction against the inquest,[75] which was granted.\n\nExhumation battle [ edit ]\n\nDinis petitioned for an exhumation and autopsy of Kopechne's body,[75] and on September 18, 1969, he publicly disclosed that blood had been found on her long-sleeved blouse and in her mouth and nose, \"which may or may not be consistent with death by drowning\",[78] when her clothes were given to authorities by the funeral director.[79]\n\nJudge Bernard Brominski of the Court of Common Pleas in Luzerne County, Pennsylvania, held a hearing on the request on October 20–21.[75] The request was opposed by Kopechne's parents.[75] Forensic pathologist Werner Spitz testified on behalf of Joseph and Gwen Kopechne that the autopsy was unnecessary and the available evidence was sufficient to conclude that Kopechne died from drowning.[80][81] Judge Brominski ruled against the exhumation on December 1, saying that there was \"no evidence\" that \"anything other than drowning had caused the death of Mary Jo Kopechne.\"[82]\n\nThe inquest[83][61] convened in Edgartown in January 1970. At the request of Kennedy's lawyers, the Massachusetts Supreme Judicial Court ordered it to be performed secretly[84][85] with Judge James A. Boyle presiding, and the 763-page transcript was released four months later.[85]\n\nKennedy's testimony [ edit ]\n\nKennedy testified that Kopechne told him, when he was about to leave the party, \"that she was desirous of leaving\" and asked \"if I would be kind enough to drop her back at her hotel.\" Crimmins and some other guests \"were concluding their meal, enjoying the fellowship and it didn't appear to be necessary to require him to bring me back to Edgartown.\"[20] Witnesses at the party variously placed the time of Kennedy and Kopechne's departure between 11:00 and 11:45 p.m..\n\nKennedy also testified that he never stopped on Cemetery Road, never backed up, never saw the deputy, and never saw another car or person after he left the cottage with Kopechne. He further claimed that after he turned onto Dike Road, he was driving and did not realize that he was no longer headed west toward the ferry landing but was instead heading east toward the barrier beach.\n\nKennedy estimated his speed at the time of the accident to be \"approximately 20 miles per hour [32 km/h]\".[86]\n\nKennedy testified that he had \"full intention of reporting it. And I mentioned to Gargan and Markham something like, 'You take care of the other girls; I will take care of the accident!'—that is what I said and I dove into the water.\"[32] Kennedy had told Gargan and Markham not to tell the other women anything about the incident \"because I felt strongly that if these girls were notified that an accident had taken place and Mary Jo had, in fact, drowned, that it would only be a matter of seconds before all of those girls, who were long and dear friends of Mary Jo's, would go to the scene of the accident and enter the water with, I felt, a good chance that some serious mishap might have occurred to any one of them.\"[33]\n\nKennedy testified that he was back at the hotel and \"almost tossed and turned and walked around that room.... I had not given up hope all night long that, by some miracle, Mary Jo would have escaped from the car.\"[87] Kennedy complained to the hotel owner at 2:55 a.m. that he had been awakened by a noisy party.[16][88] At 8 a.m., Gargan and Markham found him at his hotel where they had a \"heated conversation\" in Kennedy's room. According to Kennedy's testimony, the two men asked why he had not reported the accident, and he responded by telling them \"about my own thoughts and feelings as I swam across that channel... that somehow when they arrived in the morning that they were going to say that Mary Jo was still alive.\"[87]\n\nGargan and Markham's testimony [ edit ]\n\nMarkham testified that after their rescue attempt, Kennedy was sobbing and on the verge of becoming crazed.[89] Gargan and Markham testified that they assumed that Kennedy was going to inform the authorities about the accident once he got back to Edgartown, and so they did not do the reporting themselves.[16] In an October 15, 1994, interview for Ronald Kessler's book The Sins of the Father: Joseph P. Kennedy and the Dynasty He Founded, Gargan said that he and Markham returned to the scene of the accident with Kennedy, they both urged Kennedy to report the accident to the police. \"The conversation was brief about having to report\", Gargan told Kessler, a former The Washington Post reporter, for the book. \"I was insistent on it. Paul Markham was backing me up on it. Ted said, 'Okay, okay, Joey, okay. I've got the point, I've got the point.' Then he took a few steps and dove into the water, leaving Markham and I expecting that he would carry out the conversation.\"[90]\n\nFarrar's testimony [ edit ]\n\nFarrar testified:\n\nIt looked as if she were holding herself up to get a last breath of air. It was a consciously assumed position…. She didn't drown. She died of suffocation in her own air void. It took her at least three or four hours to die. I could have had her out of that car twenty-five minutes after I got the call. But he didn't call. — diver John Farrar, Inquest into the Death of Mary Jo Kopechne, Commonwealth of Massachusetts, Edgartown District Court. New York: EVR Productions, 1970.\n\nFarrar testified that Kopechne's body was pressed up in the car in the spot where an air bubble would have formed. He interpreted that to mean that she had survived in the air bubble after the car submerged, and he concluded that:\n\nHad I received a call within five to ten minutes of the accident occurring, and was able, as I was the following morning, to be at the victim's side within twenty-five minutes of receiving the call, in such event there is a strong possibility that she would have been alive on removal from the submerged car.[30]\n\nFarrar believed that Kopechne \"lived for at least two hours down there.\"[91]\n\nFindings [ edit ]\n\nJudge Boyle released the following findings in his report:[92]\n\n\"Death probably occurred between 11:30 p.m. on July 18 and 1:00 a.m. on July 19, 1969.\"\n\non July 18 and 1:00 on July 19, 1969.\" \"Kennedy and Kopechne did not intend to return to Edgartown at that time; ... Kennedy did not intend to drive to the ferry slip and his turn onto Dyke [ sic ] Road had been intentional.\"\n\nintend to return to Edgartown at that time; ... Kennedy did intend to drive to the ferry slip and his turn onto Dyke [ ] Road had been intentional.\" \"A speed of twenty miles per hour as Kennedy testified to, operating the car as large as his Oldsmobile, would at least be negligent and, possibly, reckless. If Kennedy knew of this hazard, his operation of the vehicle constituted criminal conduct.\"\n\n\"Earlier on July 18, he had been driven over Chappaquiddick Road three times, and over Dyke Road and Dyke Bridge twice. Kopechne had been driven over Chappaquiddick road five times and over Dyke Road and Dyke Bridge twice.\"\n\n\"I believe it probable that Kennedy knew of the hazard that lay ahead of him on Dyke Road, but that, for some reason not apparent from the testimony, he failed to exercise due care as he approached the bridge.\"\n\n\"I, therefor [sic], find there is probable cause to believe that Edward M. Kennedy operated his motor vehicle negligently … and that such operation appears to have contributed to the death of Mary Jo Kopechne.\"\n\nHaving found probable cause of a crime, under Massachusetts law Boyle could have issued a warrant for his arrest, but he did not do so.[93] Despite Boyle's findings, Dinis chose not to prosecute Kennedy for manslaughter. The Kopechne family did not bring any legal action against him but did receive a payment of $90,904 from him personally and $50,000 from his insurance company.[9][94] The Kopechnes later explained their decision not to take legal action by saying, \"We figured that people would think we were looking for blood money.\"[94]\n\nGrand jury investigation [ edit ]\n\nOn April 6, 1970, a Dukes County grand jury assembled in special session to investigate Kopechne's death. Judge Wilfred Paquet instructed the members of the grand jury that they could consider only matters brought to their attention by the superior court, the district attorney, or their personal knowledge.[95] He cited the orders of the Massachusetts Supreme Judicial Court and told the grand jury that it could not see the evidence or Boyle's report from the inquest, which were still impounded.[95] Dinis had attended the inquest and seen Boyle's report, and he told the grand jury that there was not enough evidence to indict Kennedy on potential charges of manslaughter, perjury, or driving to endanger.[95] The grand jury called four witnesses who had not testified at the inquest; they testified for a total of 20 minutes, but no indictments were issued.[95]\n\nMotor Vehicles investigation [ edit ]\n\nOn July 23, 1969, the registrar of the Massachusetts Registry of Motor Vehicles informed Kennedy that his license would be suspended until there was a statutory hearing concerning the accident.[96] The suspension was required by Massachusetts law for any fatal motor vehicle accident if there were no witnesses. The in camera hearing was held May 18, 1970, and found that \"operation was too fast for existing conditions.\" On May 27, the registrar informed Kennedy in a letter that \"I am unable to find that the fatal accident in which a motor vehicle operated by you was involved, was without serious fault on your part\" and so his driver's license was suspended for a further six months.[97]\n\nFringe theories [ edit ]\n\nJournalist Jack Olsen wrote the first investigative book on the case, The Bridge at Chappaquiddick, in 1970, attempting to solve the unanswered questions of the incident. Lieutenant Bernie Flynn, a state police detective assigned to the Cape Cod district attorney's office, was a Kennedy admirer who came up with a theory which he couldn't prove: that Kennedy got out of the car, and Kopechne drove herself off the bridge. \"Ted Kennedy didn't want to admit being drunk with a broad in a car late at night. When he saw 'Huck' Look, he got scared. He thought a cop was coming after him.\" Flynn claimed to have told this theory to Olsen, who didn't seem to be very impressed.[98] Although Olsen denied having ever talked to Flynn, he related this theory in his book.[99] Kopechne was 5 ft 2 in (1.57 m), a foot shorter than Kennedy, and Olsen argued that she might possibly not have seen the bridge as she drove Kennedy's car over unfamiliar roads at night, with no external lighting, and after she had consumed several alcoholic drinks. He wrote that Kopechne normally drove a Volkswagen Beetle, which was much smaller, lighter, and easier to handle than Kennedy's larger Oldsmobile 88.[100]\n\nA BBC Inside Story episode titled \"Chappaquiddick\", broadcast on July 20, 1994 (the 25th anniversary of the incident), repeated Flynn's theory. The episode argued that the explanation would account for Kennedy's lack of concern the next morning, as he was unaware of the accident, and for the forensic evidence of the injuries to Kopechne being inconsistent with her sitting in the passenger seat.[101]\n\nFourth-generation Chappaquiddick resident Bill Pinney, in his 2017 book Chappaquiddick Speaks, presents a theory that Kopechne was seriously injured in an earlier crash, and then the bridge accident was faked.[102] The book laments how the incident robbed Chappaquiddick of its traditional peace and privacy, attracting large tourist groups wanting to view the sites connected with the tragedy.\n\nAftermath [ edit ]\n\nThe case evoked much satire of Kennedy. For example, Time magazine reported immediately after the incident that \"one sick joke already visualizes a Democrat asking about Nixon during the 1972 presidential campaign: 'Would you let this man sell you a used car?' Answer: 'Yes, but I sure wouldn't let Teddy drive it.'\"[103] A mock advertisement in National Lampoon magazine showed a floating Volkswagen Beetle, itself a parody of a Volkswagen advertisement, showing that the vehicle's underside was so well sealed that it would float on water, but with the caption, \"If Ted Kennedy drove a Volkswagen, he'd be President today.\" The satire resulted in legal action by Volkswagen, claiming unauthorized use of its trademark; the matter was later settled out of court.[104][105]\n\nFollowing his televised speech on July 25 regarding the incident,[70] supporters responded with telephone calls and telegrams to newspapers and to the Kennedy family.[69] They were heavily in favor of his remaining in office, and he was re-elected in 1970 with 62% of the vote, a margin of nearly a half million votes, but it was down from 74% in the previous election in 1964.\n\nThe incident severely damaged Kennedy's national reputation and reputation for judgement. One analyst asked: \"Can we really trust him if the Russians come over the ice cap? Can he make the kind of split-second decisions the astronauts had to make in their landing on the moon?\"[103] Before Chappaquiddick, public polls showed that a large majority expected Kennedy to run for the presidency in 1972, but he pledged not to run in 1972. Further, Kennedy declined to serve as George McGovern's running mate that year. In 1974, he pledged not to run in 1976,[106][107] in part because of the renewed media interest in Chappaquiddick.[22]\n\nIn late 1979, Kennedy announced his candidacy for the presidency when he challenged President Jimmy Carter for the Democratic nomination for the 1980 election. On November 4, 1979, CBS broadcast a one-hour television special presented by Roger Mudd, titled Teddy. The program consisted of an interview with Kennedy; the interview was interspersed with visual materials. Much of the show was devoted to the Chappaquiddick incident. During the interview, Mudd questioned Kennedy repeatedly about the incident, and at one point directly accused him of lying.[108] Kennedy also gave what one author described as an \"incoherent and repetitive\" answer to the question, \"Why do you want to be President?\"[109] The program inflicted serious political damage on Kennedy.[109][110][111][112][113][114] President Jimmy Carter alluded to the Chappaquiddick incident twice in five days, once declaring that he had not \"panicked in the crisis\".[115] Kennedy lost the Democratic nomination to Carter, who, in turn, lost the general election to Ronald Reagan by a landslide. After the incident, Kennedy won seven re-elections to the US Senate. Kennedy remained a senator until his death in 2009.\n\nAfter Kennedy's death, New York Times Magazine editor Ed Klein stated that Kennedy asked people, \"Have you heard any new jokes about Chappaquiddick?\" \"It's not that he didn't feel remorse about the death of Mary Jo Kopechne\", Klein argued, \"But that he still always saw the other side of everything, and the ridiculous side of things, too.\"[116] The Dike Bridge became an unwanted tourist attraction,[117][118][119][120][121] and the object of souvenir hunters.[122]\n\nMedia [ edit ]\n\nThe incident is fictionalized in Joyce Carol Oates' novella Black Water (1992).\n\nIt is the central subject of John Curran's film Chappaquiddick (2017).\n\nA similar, fictional incident inspired by the Chappaquiddick incident takes place and is covered up in the season 1 finale of Succession.[123]\n\nIn 2019, the incident was featured in a season of Fox Nation's Scandalous.[124][125][126]\n\nThe 2019 series For All Mankind depicts an alternate timeline where Kennedy cancels his Chappaquiddick party after Soviets land on the Moon before the U.S., thus avoiding Kopechne's death; Kennedy eventually wins the 1972 Presidential election and is later accused of having an extramarital affair with Kopechne, who is working as a White House aide.[127][128]\n\nSee also [ edit ]\n\nNotes [ edit ]\n\n^ [12] Gargan's mother was the sister of Kennedy's mother. Gargan's mother died when he was six, and he was raised after that by Ted's parents Joseph P. and Rose Kennedy ^ [19] The purse was left in the car when Tretter drove her back to Edgartown earlier in the evening to borrow a radio. ^ Kennedy first called Helga Wagner, a Kennedy family friend, to get a phone number for Smith, who was vacationing in Europe. ^ A photographic reproduction of Arena's typing was Exhibit number 2 at the inquest, and is available at Damore , p. 448. ^ Arena for some reason typed \"Dyke\", though Markham used the correct spelling \"Dike\". See Damore , picture insert. ^ At this point, Arena adds \"(arrow on map)\". Markham, at this same point, uses a caret to insert a line of text that is illegibly crossed out; see picture in Damore , p.448. ^ The statement left Kopechne's surname blank because Kennedy was unsure of its spelling; see Damore , p. 22.\n\nCitations [ edit ]\n\nGeneral sources [ edit ]\n\nFurther reading [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Ted_Kennedy%2C_official_photo_portrait_crop.jpg/100px-Ted_Kennedy%2C_official_photo_portrait_crop.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Chappaquiddick_house.jpg/220px-Chappaquiddick_house.jpg", "https://upload.wikimedia.org/wikipedia/commons/7/74/Chappaquiddick4.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/9c/TeddyVWad.jpg/170px-TeddyVWad.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/Edward_Kennedy_%282%29.jpg/170px-Edward_Kennedy_%282%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Chappaquiddick4.png/240px-Chappaquiddick4.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Chappaquiddick_bridge.jpg/220px-Chappaquiddick_bridge.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Flowerpowerportfolio.jpg/32px-Flowerpowerportfolio.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Chappaquiddick3.png/170px-Chappaquiddick3.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/7/74/Chappaquiddick4.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Chappaquiddick_incident", "title": "Chappaquiddick incident", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/7/74/Chappaquiddick4.png", "width": 640, "height": 657}, "title": "Chappaquiddick incident - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}