{"url": "https://money.cnn.com/2016/12/22/investing/oprah-winfrey-lost-forty-pounds-weight-watchers/index.html", "text": "Oprah Winfrey has lost more than 40 pounds using Weight Watchers even though she still is eating bread -- and she's also gained a different kind of dough in the process.\n\nShares of Weight Watchers surged 17% Thursday morning after the company unveiled a new ad campaign with Winfrey -- who I will now simply refer to as Oprah for the rest of this story. The news was first reported on People magazine's web site.\n\n\"Weight Watchers is easier than any other program I've ever been on. It's a lifestyle, a way of eating and a way of living that's so freeing. You never feel like you are on a diet and it works,\" Oprah said in a release about the new ad campaign.\n\nOprah is the third largest shareholder in Weight Watchers. She owns nearly 6.4 million shares of the company -- a stake worth about $77 million. That's an increase of $10 million from Wednesday. She is also on the board of Weight Watchers.\n\nAnd the value of Oprah's stock in Weight Watchers has increased by nearly $35 million since she first disclosed her investment in October 2015.\n\nBut the stock has been on a wild yo-yo ride over the past year.\n\nRelated: Weight watching? Here's how Oprah can help\n\nWhile Oprah may be making big bucks on Weight Watchers, that's not the case for investors who only bought after finding out that she was involved.\n\nShares of Weight Watchers have plummeted nearly 50% this year and are down about 60% from the highest post-Oprah investment price they hit in November 2015.\n\nThe stock has bounced around a lot -- often due to stories about Oprah and her weight.\n\nRelated: Weight Watchers investors obsessed with Oprah\n\nShares surged in late January thanks to a tweet and video from Oprah in which she declared \"Eat bread. Lose weight. Whaaatttt?\" and said that she had already lost 26 pounds.\n\nBut investors got a rude awakening a month later when Weight Watchers reported a surprise quarterly loss as well as a decline in sales, subscribers and attendance at the company's meetings.\n\nThe stock popped again in August after there was another story about Oprah's weight loss on People's website that then got more play thanks to the New York Post's Page Six celebrity gossip feature.\n\nOprah told People at a premiere for the OWN Network show \"Queen Sugar\" that she's lost so much weight using the diet service that longtime boyfriend Stedman Graham \"can pick me up and carry me to the pool. I can straddle him without breaking his back.\"\n\nPage Six naturally chose \"Oprah can now straddle Stedman 'without breaking his back'\" as the headline for its blurb.\n\nBut Oprah's endorsement of the company hasn't changed its fortunes. The company faces tough competition from other diet services. Shares of Nutrisystem (NTRI) have surged nearly 70% this year, for example.\n\nRelated: Weight Watchers CEO calling it quits after tumultuous year\n\nMany weight watchers also have decided that they don't need to pay a monthly subscription to Weight Watchers for diet tips, recipes and exercise and fitness advice either. There are tons of free weight loss apps for smartphones.\n\nWeight Watchers still faces many challenges. In fact, the company announced in September that its CEO James Chambers was stepping down after he failed to turn the company around.\n\nThe company did report earnings in November that topped Wall Street's forecasts. So there are some signs of a turnaround taking hold. But analysts expect sales to rise less than 1% this year and only increase by about 5% next year.\n\nSo even though it's great news for Oprah that she's been able to lose so much weight, investors that still own Weight Watchers stock might want to make dumping shares their New Year's resolution.", "images": ["https://i.cdn.turner.com/money/video/bvp/images/1.gif", "https://pixel.quantserve.com/pixel/p-D1yc5zQgjmqr5.gif", "https://i.cdn.turner.com/money/images/1.gif", "https://i2.cdn.turner.com/money/dam/assets/151020133505-oprah-weight-watchers-1024x576.jpg", "https://money.cnn.com/.element/cnnm-3.0/img/logo/logo_cnnbusiness.png", "https://i2.cdn.turner.com/money/dam/assets/161222113115-oprah-weight-watchers-1-780x439.png", "https://i2.cdn.turner.com/money/.element/branding/8.0/section/investing/specials/before-the-bell/right-rail-sign-up-with-logo_2X.png", "https://money.cnn.com/.element/cnnm-3.0/img/logo/logo_cnn.svg"], "top_img": "https://i2.cdn.turner.com/money/dam/assets/161222113115-oprah-weight-watchers-1-780x439.png", "keywords": [], "authors": ["Paul R. La Monica"], "canonical_link": "https://money.cnn.com/2016/12/22/investing/oprah-winfrey-lost-forty-pounds-weight-watchers/index.html", "title": "Oprah loses 40 pounds, gains big $ with Weight Watchers", "meta_data": {"viewport": "width=1140", "date": "2016-12-22 11:01:18", "title": "Oprah loses 40 pounds, gains big $ with Weight Watchers", "description": "Oprah Winfrey continues to lose weight thanks to Weight Watchers. Shares surged on the news of her latest ad campaign. But they are still down sharply this year despite Oprah's involvement with (and investment in) the company.", "keywords": "Weight Watchers, Oprah Winfrey, Oprah", "news_keywords": "Weight Watchers, Oprah Winfrey, Oprah", "author": "Paul R. La Monica", "section": "investing", "og": {"title": "Oprah loses 40 pounds, gains big $ with Weight Watchers", "type": "article", "url": "https://money.cnn.com/2016/12/22/investing/oprah-winfrey-lost-forty-pounds-weight-watchers/index.html", "image": {"identifier": "https://i2.cdn.turner.com/money/dam/assets/161222113115-oprah-weight-watchers-1-780x439.png", "width": 780, "height": 439}, "site_name": "CNNMoney", "description": "Oprah Winfrey continues to lose weight thanks to Weight Watchers. Shares surged on the news of her latest ad campaign. But they are still down sharply this year despite Oprah's involvement with (and investment in) the company."}, "fb": {"app_id": 521848191196480}, "twitter": {"card": "summary_large_image", "site": "@CNNMoney", "url": "https://money.cnn.com/2016/12/22/investing/oprah-winfrey-lost-forty-pounds-weight-watchers/index.html", "title": "Oprah loses 40 pounds, gains big $ with Weight Watchers", "description": "Oprah Winfrey continues to lose weight thanks to Weight Watchers. Shares surged on the news of her latest ad campaign. But they are still down sharply this year despite Oprah's involvement with (and investment in) the company.", "image": "https://i2.cdn.turner.com/money/dam/assets/161222113115-oprah-weight-watchers-1-540x304.png"}, "DC.date.issued": "2016-12-22T11:01:18"}, "movies": ["https://www.youtube.com/embed/UNlaMUnOVUg"], "publish_date": 1482364800.0, "source": "https://money.cnn.com", "summary": ""}