{"url": "https://www.usatoday.com/story/life/entertainthis/2017/10/18/gabrielle-union-gets-real-rape-relationships-her-new-book/767191001/", "text": "Gabrielle Union gets real about rape, relationships in her new book\n\nShow Caption Hide Caption Gabrielle Union hopes Weinstein scandal becomes day of reckoning for sexual predators Gabrielle Union says the A-list status of some of the women who have come forward to allege complaints against Harvey Weinstein, says something about the fearlessness of sexual predators. (Oct. 17) AP\n\nGabrielle Union wasn't wrong about needing more vino.\n\nIn We're Going to Need More Wine, out Tuesday, Union gets real about everything from losing her virginity to anxiety and her career.\n\nHere are a few key takeaways:\n\n1. She has personal stories on rape and breast cancer\n\nThough I was raped by a stranger who raped me at gunpoint after robbing the store, I was still asked by a female \"friend\" what I had worn — Gabrielle Union (@itsgabrielleu) October 15, 2017\n\nThere are reasons why Union advocates for victims of sexual assault and is an activist for women's reproductive health, and they're deeply personal. In More Wine, Union opens up about her violent rape at the hands of a gunman while working in a Payless shoe store when she was just 19. The emotional essay delves into the paranoia and fear she experienced post-attack, but also focuses on the safe space of the UCLA Rape Crisis Center where she found a community of survivors.\n\nThe final essay in the book focuses on her friendship with childhood friend Sookie Martinez, who died after her stage four metastatic breast cancer diagnosis. She explained that her friend's diagnosis is part of why she's an active supporter of Planned Parenthood and its breast health care. In a tear-jerking moment, she describes asking her friend what she wants her legacy to be, to which Martinez responds, \"I want you to tell people that fear can kill you. I was afraid, and it killed me.\" Cue sobbing.\n\n2. She has some great (and sad) relationship stories\n\nUnion lays it all out in the open when discussing her first marriage to former NFL player Chris Howard. She says she found out Howard was cheating on her the day after he proposed, saying she threw her engagement ring at him but went on to marry him anyway. Claiming he became \"a prolific cheater\" as their marriage progressed, Union says she participated in a \"sting\" operation when a woman Howard was having an affair with threatened to go public. It's not surprising this chapter of the book is called \"Crush-and-Burn Marriage.\"\n\nShe also divulges details about crushes and sexual experiences throughout her life, including losing her virginity in a guy's parents' bedroom and dating former NBA player Jason Kidd when they were in high school.)\n\n3. There's an amazing Prince anecdote\n\nUnion has an entire essay dedicated to a series of stories about her experiences with the late, great Prince, and they're just as incredible as you would imagine. Her first invite to a Prince soiree resulted in her casually conversing with Mariah Carey, Mary J. Blige and Whitney Houston, and later talking to \"Mr. Prince\" about tuna casserole.\n\nShe credits Prince for unwittingly connecting her with her future basketball hubby Dwyane Wade, and providing inclusive spaces for creatives of all creeds and colors.\n\n\"I grieve the vital connector who brought so many communities together, long after he recorded those radio hits everyone knows by heart,\" she writes.\n\n4. She gets real about her blackness and color-ism\n\nFrom being called racial slurs in middle and high school to facing issues about her hair, Union doesn't hold back with vignettes of navigating being black. She includes instances of being called \"pretty for a black girl,\" of on-set hairstylists frying her strands because they didn't understand styling black hair, and a condescending experience with a Friends director well into her film career.\n\nShe also recounts dropping \"Black Bombs\" of truth on her stepsons Xavier, Zion and Zaire Wade, telling them how to behave at sleepovers with friends or when hanging out with girls so their actions aren't misconstrued.\n\n5. Her relationship with Dwyane Wade isn't always perfect\n\nEven though Union and Wade look picture perfect together, their relationship has its ups and downs. Union discussed her battle with IVF treatments, revealing she had \"eight or nine miscarriages.\"\n\n\"For three years, my body has been a prisoner of trying to get pregnant,\" she writes of the struggle to conceive with Wade.\n\nTheir prenup was also a little messy, according to Union, but it's not as simple as who gets the couch when there are millions of dollars at stake. When discussing the financial aspects of her relationship with Wade (who she calls her best friend), she talks about their prenuptial agreement and the negotiations that made her feel \"resentful.\"\n\nThankfully, they figured out the prenup three days before their wedding, which Union refers to as \"the time of my life\" with the man she calls her \"best friend,\" and we've been stalking their cute couple pictures ever since.", "images": ["https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://www.gannett-cdn.com/-mm-/d71ed59af7752bcaa44768721cc5b83d0c13b2b3/c=0-536-1832-1571/local/-/media/2017/10/16/USATODAY/USATODAY/636437515511310137-WereGoingToNeedMoreWine-HC.JPG?auto=webp&format=pjpg&width=1200", "https://media.gannett-cdn.com/29906170001/29906170001_5615403563001_5615369566001-vs.jpg?pubId=29906170001", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/d71ed59af7752bcaa44768721cc5b83d0c13b2b3/c=0-536-1832-1571/local/-/media/2017/10/16/USATODAY/USATODAY/636437515511310137-WereGoingToNeedMoreWine-HC.JPG?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Anika Reed"], "canonical_link": "https://www.usatoday.com/story/life/entertainthis/2017/10/18/gabrielle-union-gets-real-rape-relationships-her-new-book/767191001/", "title": "Gabrielle Union gets real about rape, relationships in her new book", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/entertainthis/2017/10/18/gabrielle-union-gets-real-rape-relationships-her-new-book/767191001/life/entertainthis", "theme-color": "#ffffff", "og": {"type": "article", "title": "Gabrielle Union gets real about rape, relationships in her new book", "description": "The 'Being Mary Jane' star gives an intimate look at her life in her new collection of essays 'We're Going to Need More Wine.'", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/d71ed59af7752bcaa44768721cc5b83d0c13b2b3/c=0-536-1832-1571/local/-/media/2017/10/16/USATODAY/USATODAY/636437515511310137-WereGoingToNeedMoreWine-HC.JPG?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "The 'Being Mary Jane' star gives an intimate look at her life in her new collection of essays 'We're Going to Need More Wine.'", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1508281200.0, "source": "https://www.usatoday.com", "summary": ""}