{"url": "https://popculture.com/celebrity-couples/2018/07/29/cardi-b-offset-lamborghinis-his-and-hers/", "text": "Cardi B and Offset picked up a pair of matching Lamborghinis over the weekend, and showed them off in matching Instagram posts.\n\nThe famous hip-hop couple leaned on the hoods of their new cars in a picture that they both posted on Instagram. Cardi B picked up a powder blue Aventador while Offset's was bright green. Both had their suicide doors in the upright position.\n\n(Photo: Instagram / Cardi B)\n\n\"Blessed & Gifted,\" Cardi wrote with a heart emoji in the color of each car. \"Official Lamb owners.\" She tagged the photo \"Aventador,\" \"His & Hers\" and \"Kulture parents.\"\n\n\"L A M B T A L K,\" Offset wrote in his post. \"H I S & H E R S.\"\n\nIn addition, Cardi B gushed over the car in a few posts on her Instagram story. The 25-year-old rapper took one video showing that she had painted her long nails to match the color of her new whip exactly. She also explained that she had decided to make the purchase largely because she mentioned the exact same car in her song \"I Like It.\"\n\n(Photo: Instagram / Cardi B)\n\n\"If I'm going to rap about having a Lambo, I'm going to own a mother f—ing Lambo,\" she said.\n\nCardi B and Offset just welcomed their first child together, Kulture Kiari Cephus. The couple was unable to keep up the secretive celebrity facade so many famous people stick to these days, oversharing with their fans as soon as possible.\n\nThe happy times might not last forever, unfortunately. Last week, Offset was arrested just outside of Atlanta. He was pulled over for allegedly changing lanes without signaling in his Porsche 911. The officer on the scene reported that the car smelled strongly of marijuana, prompting him to search it.\n\nClayton County Police told CBS News that they found three guns and less than an ounce of marijuana in the car. They took Offset into custody, as the rapper is a convicted felon which prevents him from owning a gun at all. He was also charged with possession of a weapon during a crime, because of the marijuana charge.\n\nHowever, Offset and his lawyer are already fighting back on the arrest, claiming that he was unfairly targeted by law enforcement. They claimed that the guns were clearly in possession of Offset's bodyguard, who was in the passenger seat, and not the rapper himself.\n\n\"It's a common theme. We're talking about a young, African-American man driving a shiny, beautiful luxury car and clad in designer clothes and watches and jewelry,\" said attorney Drew Findling, who has previously represented rapper Gucci Mane, Katt Williams, and others.\n\n\"Unfortunately people in his genre become a target for law enforcement who think that lifestyle is connected to some illegal activity... and that is a sad statement.\"", "images": ["https://media.popculture.com/2018/07/cardi-b-lambo-nails-20041647.jpeg", "https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200", "https://media.popculture.com/2018/07/cardi-b-offset-lambos-20041646.jpeg"], "top_img": "https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/celebrity-couples/news/cardi-b-offset-lamborghinis-his-and-hers/", "title": "Cardi B and Offset Debut His and Hers Lamborghinis", "meta_data": {"description": "Cardi B and Offset picked up a pair of matching Lamborghinis over the weekend, and showed them off [...]", "keywords": "rap music,Instagram,Offset,Parenting,Cardi B", "news_keywords": "rap music,Instagram,Offset,Parenting,Cardi B", "robots": "index, follow, max-image-preview:large", "twitter": {"card": "summary_large_image", "site": "PopCulture", "creator": "PopCulture", "title": "Cardi B and Offset Debut His and Hers Lamborghinis", "description": "Cardi B and Offset picked up a pair of matching Lamborghinis over the weekend, and showed them off [...]", "image": "https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200"}, "og": {"title": "Cardi B and Offset Debut His and Hers Lamborghinis", "type": "article", "url": "https://popculture.com/celebrity-couples/news/cardi-b-offset-lamborghinis-his-and-hers/", "image": {"identifier": "https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200", "width": 640, "height": 320}, "site_name": "Celebrity Couples", "description": "Cardi B and Offset picked up a pair of matching Lamborghinis over the weekend, and showed them off [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#263240", "apple-mobile-web-app-capable": "yes"}, "movies": [], "publish_date": 1532818800.0, "source": "https://popculture.com", "summary": ""}