{"url": "www.usatoday.com/story/life/music/2018/08/27/mel-b-enter-rehab-agt-judge-seek-help-ptsd-addiction/1108331002/", "text": "Mel B clarifies rehab reports: 'No, I’m not an alcoholic. No, I’m not a sex addict.'\n\nShow Caption Hide Caption Former Spice Girls member Mel B going to rehab Citing sex and alcohol addiction, Mel B told British tabloid The Sun she'll be entering a rehab facility in the U.K. Wochit\n\nFormer Spice Girls member Mel B is opening up about her decision to \"go into a proper therapy program,\" as revealed in what appeared to be an exclusive statement to British tabloid The Sun, published over the weekend.\n\nThe 43-year-old \"America's Got Talent\" judge whose real name is Melanie Brown, recalled \"drinking to numb my pain\" and a recent post-traumatic stress disorder diagnosis in the statement.\n\nOn Wednesday's episode of \"The Ellen DeGeneres Show,\" Brown offers guest host Lea Michele insight to her struggles. Offering clarification, the singer says the news \"got a little bit skewed with.\"\n\n\"My therapy changed a little bit because I was in a very intense relationship, which you can all read about in my book,\" Brown says, referencing her memoir \"Brutally Honest\" set to publish in November.\n\n\"So, I do address a lot of those issues,\" she tells Michele. \"But no, I’m not an alcoholic. No, I’m not a sex addict. I was with the same person (ex-husband Stephen Belafonte) for 10 years, and that was quite a turmoil, very intense.\n\n\"That’s all I can say about it,\" she continues. \"I’d like to say a lot more, but on this show, let’s keep it PC. But yeah, I address a lot of those issues, and I did kind of have to ease my pain.\"\n\nBrown adds: \"I do suffer a lot from PTSD.\"\n\nIn her published statement, Brown cited her split from Belafonte as a motivating factor for seeking therapy, claiming the past six months working on her book \"has been unbelievably traumatic reliving an emotionally abusive relationship and confronting so many massive issues in my life.\"\n\n“I am being very honest about drinking to numb my pain, but that is just a way a lot of people mask what is really going on,\" her statement read.. “Sometimes it is too hard to cope with all the emotions I feel. But the problem has never been about sex or alcohol – it is underneath all that. ... I am still struggling but if I can shine a light on the issue of pain, PTSD and the things men and women do to mask it, I will do.\"\n\nBrown did not share the name of the center she plans to visit, but says she'll check in sometime in the next few weeks (presumably after the current season of \"America's Got Talent\" wraps on Sept. 19), and that the location \"has to be in the U.K. because I am very, very British and I know that will work best for me.\"\n\nBrown and Belafonte divorced last year following a lengthy battle in which Brown accused her ex of beating and threatening her throughout their 10-year marriage, at one point filing a temporary restraining order against him.\n\nEarlier this month, they reached a settlement regarding their divorce that removes Brown's domestic violence claims against him.\n\nHer rep did not respond to USA TODAY's request for comment.\n\nContributing: Erin Jensen", "images": ["https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://media.gannett-cdn.com/29906170001/29906170001_5827753993001_5827753841001-vs.jpg?pubId=29906170001", "https://www.gannett-cdn.com/presto/2018/08/27/USAT/e4019d18-ab7a-43f0-9990-ebe3293bb08a-GTY_1021050910.jpg?auto=webp&crop=3279,1844,x0,y1021&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/presto/2018/08/27/USAT/e4019d18-ab7a-43f0-9990-ebe3293bb08a-GTY_1021050910.jpg?auto=webp&crop=3279,1844,x0,y1021&format=pjpg&width=1200", "keywords": [], "authors": ["Maeve Mcdermott"], "canonical_link": "https://www.usatoday.com/story/life/music/2018/08/27/mel-b-enter-rehab-agt-judge-seek-help-ptsd-addiction/1108331002/", "title": "Mel B clarifies rehab reports: 'No, I’m not an alcoholic. No, I’m not a sex addict.'", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/music/2018/08/27/mel-b-enter-rehab-agt-judge-seek-help-ptsd-addiction/1108331002/life/music", "theme-color": "#ffffff", "og": {"type": "article", "title": "Mel B clarifies rehab reports: 'No, I’m not an alcoholic. No, I’m not a sex addict.'", "description": "\\", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/presto/2018/08/27/USAT/e4019d18-ab7a-43f0-9990-ebe3293bb08a-GTY_1021050910.jpg?auto=webp&crop=3279,1844,x0,y1021&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "\\", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1535324400.0, "source": "http://www.usatoday.com", "summary": ""}