{"url": "https://en.wikipedia.org/wiki/Kathie_Lee_Gifford", "text": "American actress, talk show host, and singer\n\n\"Kathie Lee\" redirects here. For people with similar names, see Kathy Lee (disambiguation)\n\nKathryn Lee Gifford (née Epstein; born August 16, 1953)[1] is an American television presenter, singer, songwriter, actress and author. She is best known for her 15-year run (1985–2000) on the talk show Live! with Regis and Kathie Lee, which she co-hosted with Regis Philbin. She is also known for her 11-year run with Hoda Kotb, on the fourth hour of NBC's Today show (2008–2019). She has received 11 Daytime Emmy nominations and won her first Daytime Emmy in 2010 as part of the Today team.\n\nGifford's first television role was as Tom Kennedy's singer/sidekick on the syndicated version of Name That Tune in the 1977–1978 season. She also occasionally appeared on the first three hours of Today and was a contributing NBC News correspondent.\n\nKathie Lee married Paul Johnson, a composer, arranger, producer and publisher of Christian music, in 1976. After their divorce in 1982, she married sportscaster and former NFL player Frank Gifford in 1986. He died in 2015. Kathie Lee has released studio music albums and several books.\n\nEarly life and beginnings [ edit ]\n\nGifford was born Kathryn Lee Epstein in Paris, France, to American parents, Joan (born Cuttell; January 20, 1930 – September 12, 2017), a singer and Aaron Epstein (March 19, 1924 – November 19, 2002), a musician and former US Navy Chief Petty Officer. Aaron Epstein was stationed with his family in France at the time of Gifford's birth.[2] Gifford grew up in Bowie, Maryland, and attended Bowie High School.[3]\n\nGifford's paternal grandfather was a Russian Jew from Saint Petersburg and her paternal grandmother had Native American ancestry. Her mother, a relative of writer Rudyard Kipling, was of French Canadian, German and English descent.[4][5]\n\nAfter seeing the Billy Graham produced film The Restless Ones at age 12, Gifford became a born-again Christian. She told interviewer Larry King, \"I was raised with many Jewish traditions and raised to be very grateful for my Jewish heritage.\"[6]\n\nDuring high school, Gifford was a singer in a folk group, \"Pennsylvania Next Right\", which performed frequently at school assemblies. After high school graduation in 1971, Gifford attended Oral Roberts University in Tulsa, Oklahoma, studying drama and music. During a summer in the early 1970s, she was a live in secretary/babysitter for Anita Bryant at her home in Miami. Her first regular appearances on national TV was as a singer on the game show \"Name That Tune,\" hosted by Tom Kennedy in the late 1970s, in which she would sing small portions of songs that contestants would have to identify.\n\nCareer [ edit ]\n\nEarly career [ edit ]\n\nGifford's career took off in the 1970s as a vocalist on the game show Name That Tune with Tom Kennedy. In 1978, she joined the cast of the short-lived Hee Haw spinoff, Hee Haw Honeys. She was also a correspondent and substitute anchor on ABC's Good Morning America in the early 1980s.\n\nLive! with Regis and Kathie Lee [ edit ]\n\nOn June 24, 1985, Gifford replaced Ann Abernathy as co-host of The Morning Show on WABC-TV with Regis Philbin. The program went into national broadcast in 1988 as Live! with Regis and Kathie Lee, and Gifford became well known across the country. Throughout the 1990s, morning-TV viewers watched her descriptions of life at home with her sportscaster husband Frank, son Cody, and daughter Cassidy.\n\nIn 1990, when TV Guide held a poll for readers to select the most beautiful woman on television, Live! presented a week-long mock campaign to garner votes for Gifford.[7] Gifford wound up winning the poll,[8][9] receiving more than four times as many votes as the runners-up, Jaclyn Smith and Nicollette Sheridan.[7]\n\nPhilbin and Gifford were jointly nominated eight consecutive years in a row (1993 to 2000) for Outstanding Talk Show Host during the Daytime Emmy Awards.[10] Gifford left the show on July 28, 2000.\n\nToday with Kathie Lee and Hoda [ edit ]\n\nOn March 31, 2008, NBC announced that Gifford was to join its morning show, Today, as co-host of the fourth hour titled Today with Kathie Lee and Hoda, alongside Hoda Kotb. This marked her return to morning television; in many markets, she aired directly after her old show, currently called Live with Kelly and Ryan. Because the fourth hour of Today airs live at 10:00 am ET, and Live with Kelly and Ryan airs live at 9:00 am ET, Gifford's hour did not compete directly with her former show in most markets.[11] Kotb and Gifford replaced Ann Curry and Natalie Morales. In the weeks prior to Gifford's arrival, ratings indicated 1.9 million viewers of the fourth hour of Today.[12] As of 2014, the fourth hour of Today with Gifford and Kotb has averaged 2.15 million total viewers, an increase of 13 percent over the 2008 ratings.[13][14] On December 11, 2018, it was announced that she would be leaving Today in April 2019. Her final Today Show appearance was on April 5, 2019 with a party, including a video by her children Cody and Cassidy Gifford.[15] In 2019, they won the Daytime Emmy Award for Outstanding Informative Talk Show Host.\n\nOther media appearances and projects [ edit ]\n\nGifford has made guest appearances in films and television series, and has several independently released albums on CD, including 2000's The Heart of a Woman, featuring the single \"Love Never Fails\".[16][17]\n\nShe appeared as a spokesperson for Slim Fast diet shakes after her son Cody was born. She also was the face of Carnival Cruise Lines in the late 1980s and early 1990s, singing \"If my friends could see me now!\" In 1991 she christened the Carnival Ecstasy, the 2nd of the Fantasy Class of cruise ships. In 1994, she appeared as herself in an episode of the NBC sitcom Seinfeld.\n\nShe did a number of voice overs most notably as Echidna in the 1998 TV series Hercules and in Higglytown Heroes as the Mail Carrier Hero in 2004.\n\nIn September 2005 she became a special correspondent on The Insider, a syndicated entertainment magazine television show, ending her relationship with that program upon her co-hosting role with Today.[18]\n\nShe played the role of Miss Hannigan in a concert performance of Annie at Madison Square Garden in December 2006.[19]\n\nOn an episode that aired March 27, 2010, she guest starred on The Suite Life on Deck, along with her real-life daughter, Cassidy.\n\nShe appeared as herself in the 2015 television film Sharknado 3: Oh Hell No!.\n\nShe has written numerous autobiographical books, Just When I Thought I'd Dropped my Last Egg: Life and Other Calamities in 2010, The Rock, the Road and the Rabbi in March 2018, and It’s Never Too Late: Make the Next Act of Your Life the Best Act of Your Life in 2020. Her book regarding the Christian faith, The Jesus I Know: Honest Conversations and Diverse Opinions about Who He Is was released in 2021. She has also written a number of children's books.\n\nCurrent career [ edit ]\n\nGifford left Today in order to pursue a movie career as an actress, director, and producer. In 2018, she filmed Then Came You in which she co-stars with Craig Ferguson. That same year, she also filmed a Hallmark Christmas movie for Hallmark Movies & Mysteries called A Godwink Christmas. Gifford intends to make movies about the experiences of losing a loved one and being a widow, which she considers an underrepresented topic in Hollywood.[20] Gifford has several projects in the works including sequels to Then Came You.\n\nOn April 28, 2021, Gifford was honored with a star on the Hollywood Walk of Fame for her contributions to the television industry. Her star is located at 6834 Hollywood Boulevard, only five stars away from that of her former co-host Regis Philbin.[21]\n\nMusical theatre [ edit ]\n\nIn the late 1990s, Gifford began working in musical theatre. She contributed a number of musical numbers to Hats, and wrote and produced Under The Bridge,[22] based upon the children's book The Family Under The Bridge by Natalie Savage Carlson. In 2000 she released the album The Heart of a Woman on Universal.\n\nGifford wrote the book and lyrics for Saving Aimee, a stage musical about evangelist Aimee McPherson, which premiered in 2007 at the Signature Theatre in Arlington, Virginia.[23][24] The premiere starred actress Carolee Carmello in the lead role.[25] The show, retitled as Scandalous: The Life and Trials of Aimee Semple McPherson, ran on Broadway from November 15, 2012, through December 9, 2012,[26] with Carmello reprising her role as McPherson. On April 30, 2013, Carmello received her third Tony Award nomination for the performance.[27]\n\nOn April 16, 2007, Gifford was a guest presenter at the Washington, D.C. Helen Hayes Award Ceremony, honoring contributions and professional accomplishments in theatre.[28]\n\nIn 2008, Gifford and David Friedman wrote a junior high school musical entitled Key Pin It Real.[29] The play depicts a coming-of-age story about a young girl named Key Pin. The first production took place in December 2008 in Kendallville, Indiana, at East Noble High School.[30]\n\nGifford is currently working on a musical adaptation of It's a Wonderful Life with John McDaniel; McDaniel is composing music while Gifford is writing lyrics.[31]\n\nOther endeavors [ edit ]\n\nCharity [ edit ]\n\nGifford is a celebrity ambassador for the non-profit organization Childhelp. She regularly makes appearances at fund raisers and events for the child abuse prevention and treatment organization and is an ardent supporter.[32]\n\nFrank and Kathie Lee Gifford raised the money to build and continued to financially support two shelters in New York City for babies born with HIV, or a congenital crack cocaine addiction. These shelters were named in honor of her children, Cody and Cassidy.[33]\n\nLabor rights activity [ edit ]\n\nIn 1996 Gifford was earning $9 million annually licensing her name to a brand of clothing sold at Walmart. Part of the proceeds went to charity. Charles Kernaghan's human rights group called the National Labor Committee reported that sweatshop labor was being used in manufacturing the Kathie Lee Gifford branded clothing. [34] [35]\n\nGifford called Kernaghan's report \"a vicious attack\" on a TV broadcast called Live! with Regis and Kathie Lee. Gifford explained during this broadcast that she was not responsible for the contract manufacturers that made her products.[34] [36]\n\nKernaghan in his congressional testimony of April 1996, said that to make Gifford’s clothing, girls as young as 15 worked for 31 cents an hour, 75 hours a week. [34] Kernaghan reported that a worker in Honduras smuggled a piece of clothing out of the factory, which had a Kathie Lee label on it.[37] One of the workers, Wendy Diaz, came to the United States to testify about the conditions under which she worked. She commented, \"I wish I could talk to [Kathie Lee]. If she's good, she will help us.\"[38]\n\nGifford later contacted federal authorities to investigate the issue and worked with US federal legislative and executive branch agencies to support and enact laws to protect children against sweatshop conditions. She appeared with President Bill Clinton at the White House in support of the government's initiatives to counter international sweatshop abuses.[39]\n\nPersonal life [ edit ]\n\nKathie Lee and Frank Gifford in 1996\n\nKathie Lee married Paul Johnson, a composer/arranger/producer/publisher, in 1976. They gained fame in Christian music, appearing on covers of Christian magazines. The marriage was strenuous from the start and in 1981, Johnson moved out. The couple divorced in 1982.[40]\n\nOn October 18, 1986, Kathie Lee married a second time, this time to Frank Gifford, an American football player and television sports commentator. It was his third marriage after marriages with Maxine Avis Ewart and Astrid Lindley. With Ewart he had three children.\n\nKathie Lee was 23 years younger than Frank. They had two children together, Cody Newton Gifford (born March 22, 1990) and Cassidy Erin Gifford (born August 2, 1993). They also shared a birthday: August 16. Frank died on August 9, 2015, from natural causes at their Greenwich, Connecticut, home at the age of 84.[41][42] In 2017, she released \"He Saw Jesus\", a very personal song Kathie Lee co-wrote (with songwriter Brett James) and dedicated to her husband. All proceeds from the song went to the international evangelical Christian humanitarian aid charity Samaritan's Purse.\n\nDiscography [ edit ]\n\nAlbums [ edit ]\n\n(as Kathie Lee Gifford except where indicated)\n\n1978: Finders Keepers (as Kathie Lee Johnson)\n\n1993: It's Christmas Time\n\n1993: Christmas Carols\n\n1993: Sentimental\n\n1993: Christmas With Kathie Lee Gifford (double album)\n\n1995: Dreamship: Lullabies for Little Ones\n\n1995: Kathie Lee's Rock 'N' Tots Cafe: A Christmas \"Giff\"\n\n2000: Heart of a Woman (as Kathie Lee)\n\n2000: Born For You (as Kathie Lee)\n\n2001: Goodnight, Angel (as Kathie Lee)\n\n2004: Gentle Grace\n\n2009: Everyone Has a Story (as Kathie Lee Gifford & Friends)\n\n2009: My Way Home\n\n2010: Super Hits\n\n2013: Scandalous, The Musical (lyrics by)\n\n(lyrics by) 2017: The Little Giant\n\n2020: Then Came You (Original Motion Picture Soundtrack with Brett James & Sal Oliveri)\n\nFilmography [ edit ]\n\nCredits from Kathie Lee Gifford IMDb page.\n\nActress\n\nDays of Our Lives: Nurse Callahan (1978, credited as Kathie Lee Johnson)\n\nHee Haw Honeys: Kathie Honey (1978-1979, credited as Kathie Lee Johnson)\n\nEvening Shade: Stephanie Rodgers (1994, 1 episode)\n\nSeinfeld: (1994, 1 episode)\n\nCoach: (1995, 1 episode)\n\nThe Cosby Mysteries: (1995, 1 episode)\n\nWomen of the House: (1995, 1 episode)\n\nThe First Wives Club: (1996, Movie)\n\nSecond Noah: (1997, 1 episode)\n\nMother Goose: A Rappin' and Rhymin' Special: Jill (1997, TV Movie: Voice)\n\nHappily Ever After: Fairy Tales for Every Child: Jill (1997, 1 episode: Voice)\n\nSpin City: (1997, 1 episode)\n\nThe Tom Show: (1997, 1 episode)\n\nHoney, I Shrunk the Kids: The TV Show: (1997, 1 episode)\n\nStyle & Substance: (1998, 1 episode)\n\nDiagnosis Murder: Mary Montgomery (1998, 1 episode)\n\nSoul Men: (1998, 1 episode)\n\nCaroline in the City: (1998, 1 episode)\n\nThe Simpsons: (1998, 1 episode: Voice)\n\nHercules: Echidna (1998, 4 episodes: Voice)\n\nLateLine: (1999, 1 episode)\n\nHercules: Her to Zero (1999, Direct-to-VHS release: Voice)\n\nDudley Do-Right (1999, Movie)\n\nHey Arnold!: Jackie Lee (1999, 1 episode: Voice)\n\nThe Famous Jett Jackson (1999, 1 episode)\n\nThe Wonderful World of Disney: Dierdre (2000, 1 episode: Voice)\n\nTouched by an Angel: Wendy/Jolene (1996-2000, 2 episodes)\n\nThe Amanda Show: Princess Whiff (2001, 1 episode)\n\nSpinning Out of Control: Amanda Berkley (2001, TV Movie)\n\nJust Shoot Me!: Allison Spencer (2001, 1 episode)\n\nThe Drew Carey Show: Vanessa Bobeck (2001, 1 episode)\n\nHope & Faith: Marge (2004, 1 episode)\n\nHigglytown Heroes: Mail Carrier (2004-2005, 2 episodes)\n\nThat's So Raven: Claire (2005, 1 episode)\n\nHandy Manny: Mrs. Hillary (2006, 1 episode)\n\nLipstick Jungle: (2009, 1 episode)\n\n30 Rock: (2010, 1 episode)\n\nThe Suite Life on Deck (2010, 1 episode)\n\nAdventures of Serial Buddies (2011, Movie)\n\nHot in Cleveland: Christal (2011, 1 episode)\n\nThe Mysteries of Laura (2015, 1 episode)\n\nSharknado 3: Oh Hell No!: (2015, TV Movie)\n\nDifficult People: (2015, 1 episode)\n\nDonny!: (2015, 2 episodes)\n\nCome to the Garden: Reader/Singer (2016, Movie: Voice)\n\nYounger: (2016, 1 episode)\n\nNashville: (2017,1 episode)\n\nSharknado 5: Global Warming: (2017, TV Movie)\n\nGirlfriends' Guide to Divorce: (2014-2017, 3 episodes)\n\nA Godwink Christmas: Aunt Jane (2018, TV Movie)\n\nThe Baxters: Lillian (2019, 3 episodes)\n\nThe Other Two: (2019, 1 episode)\n\nA Godwink Christmas: Meant for Love: Olga (2019, TV Movie)\n\nThen Came You (2020)\n\nProducer\n\nKathie Lee Gifford's Celebration of Motherhood (1993)\n\nKathie Lee's Rock n' Tots Cafe: A Christmas \"Giff\" (1995)\n\nA Godwink Christmas (2018)\n\nThe God Who Sees (2019)\n\nA Godwink Christmas: Meant for Love (2019)\n\nThen Came You (2020)\n\nHerself\n\nThe $100,000 Name That Tune (1977)\n\nConstantinople (1977)\n\nThe Funniest Joke I Ever Heard (1984)\n\nMiss America (1985)\n\nThe New Hollywood Squares (1987)\n\nRegis and Kathie Lee: Special Edition (1988)\n\nThe Pat Sajak Show (1988)\n\nThe Morning Exchange (1989)\n\nHee Haw (1989)\n\nDonahue (1990)\n\nChildren's Miracle Network Telethon (1990)\n\nVictory & Valor: Special Olympics World Games (1991)\n\nWalt Disney World's 20th Celebration (1991)\n\nThe Bikini Open 5 (1991)\n\nAll My Children (1991)\n\nABC After School Special (1992)\n\nKathie Lee Gifford's Celebration of Motherhood (1993)\n\nA Musical Christmas at Walt Disney World (1993)\n\nThe Crusaders (1994)\n\nGlenn Miller's Greatest Hits (1994)\n\nThe Annual Friars Club Tribute Presents a Salute to Barbra Walters (1994)\n\nAll-Star 25th Birthday: Stars and Street Forever! (1994)\n\nThe 10th TV Academy Hall of Fame (1994)\n\nWalt Disney World Inside Out (1994)\n\nCBS This Morning (1994)\n\n1994 Holiday at Pops! (1994)\n\nKathie Lee Gifford...Looking for Christmas (1994)\n\nKathie Lee's Rock n' Tots Cafe: A Christmas \"Giff\" (1995)\n\nIntimate Portrait (1995)\n\nSuper Bowl XXIX (1995)\n\nRegis and Kathie Lee: Mom's Dream Come True (1995)\n\nMiss North America (1995)\n\nKathie Lee's Rock n' Tots Cafe: Kathie Lee's Big Surprise (1996)\n\nThe Fresh Prince of Bel-Air (1996)\n\nThe Line King: The Al Hirschfeld Story (1996)\n\nMaury (1992-1996)\n\nKathie Lee Gifford: We Need a Little Christmas (1996)\n\nKathie Lee Gifford: Just in Time for Christmas (1996)\n\nOops! The World's Funniest Outtakes 5 (1997)\n\nThe 25th Annual Daytime Emmy's (1998)\n\nBiography (1996-1998)\n\nWheel of Fortune (1999)\n\nMillennium Chorus: The Greatest Story Ever Sung (2000)\n\n31st Annual Gospel Music Association's Dove Awards (2000)\n\nThe 27th Annual Daytime Emmy's (2000)\n\nThe 54th Annual Tony Awards (2001)\n\nLate Night with Conan O'Brien (2001)\n\nThe 28th Annual Daytime Emmy's (2001)\n\nAFI Life Achievement Award: A Tribute to Barbra Streisand (2001)\n\nESPN SportsCentury (2001)\n\nPrimetime Glick (2001)\n\nSee How They Run (2001)\n\nThe Rosie O'Donnell Show (1996-2002)\n\nLate Night with David Letterman (1993-2002)\n\nStar Search (2003)\n\nThe Wayne Brady Show (2003)\n\nThe Ellen DeGeneres Show (2003)\n\nThe Jamie Kennedy Experiment (2003-2004)\n\nHollywood Squares (2000-2004)\n\nControversy (2004)\n\nGood Day Live (2005)\n\nThe Tony Danza Show (2004-2005)\n\nThe Daily Buzz (2005)\n\nLarry King Live (2000-2006)\n\nThe Reichen Show (2006)\n\nThe O'Reilly Factor (2008)\n\nCelebrity Family Feud (2008)\n\nBooks Equal Gifts Commercial (2008)\n\nPlymouth Rock Studios: The Series (2009)\n\nJimmy Kimmel Live (2004-2009)\n\nVH1 Divas Live 2009 (2009)\n\nTalk Stoop (2011)\n\nCMT: 40 Greatest Love Songs (2011)\n\nThe Annual 2011 Actors Fund Gala Awards (2011)\n\nKeeping Up With the Kardashians (2011)\n\nLive With Kelly and Ryan (1998-2011)\n\nThe Lennon Sisters: Same Song, Separate Voices (2011)\n\nThe Apprentice (2009-2012)\n\nThe Soup (2012)\n\nThe Wendy Williams Show (2012)\n\nWeekend Today (2012)\n\n2012 CMT Music Awards (2012)\n\nThe Daily Show (2011-2012)\n\nTheater Talk (2013)\n\nChelsea Lately (2013)\n\nSteve Harvey (2013)\n\nChasing the Saturdays (2013)\n\nLate Night with Jimmy Fallon (2009-2013)\n\nAfter Lately (2013)\n\nSmash (2013)\n\nWho Wants to be a Millionaire? (2013)\n\nKris (2013)\n\nTop Chef Masters (2013)\n\nThe Real Story with Gretchen Carlson (2013)\n\nThe Tonight Show with Jay Leno (1994-2013)\n\nBethenny (2014)\n\nLate Night with Seth Meyers (2014)\n\nThe Michael J. Fox Show (2014)\n\nThe View (2004-2014)\n\nHoward Stern Birthday Bash (2014)\n\nDateline NBC (2014)\n\nRachael Ray (2006-2014)\n\nWWE Raw (2014)\n\nThe Insider (2006-2014)\n\nThe JBL & Cole Show with Renee Young (2014)\n\nInside Edition! (2014)\n\nA Toast to 2014! (2014)\n\n73 Questions (2015)\n\nWhose Line is it Anyway? (2015)\n\nThe Kitchen (2015)\n\nMinimalism: A Documentary About the Important Things (2015)\n\nGood Morning America (2015)\n\nThe Meredith Vieira Show (2015-2016)\n\nA Toast to 2016! (2016)\n\nGirlfriend's Guide to Divorce (2017)\n\nHome & Family (2017)\n\nTalking Live with Dr. Robi Ludwig (2017)\n\nThe National Christmas Tree Lighting (2017)\n\nPaula Abdul/Today Show (2017)\n\nBilly Graham: An Extraordinary Journey (2018)\n\nAccess Hollywood (2018)\n\nToday Show: An Insider's Guide to Italy (2018)\n\nHarry (2018)\n\nMegyn Kelly Today (2018)\n\nThe Tonight Show Starring Jimmy Fallon (2019)\n\nExtra with Billy Bush (2014-2019)\n\nEntertainment Tonight (2003-2019)\n\nThe Dr. Oz Show (2015-2020)\n\nCelebrity Page (2017-2020)\n\nToday Show (2004-2020)\n\nBibliography [ edit ]\n\nBiographical\n\n1976: (As Kathie Epstein) The Quiet Riot\n\n1992: I Can't Believe I Said That!: An Autobiography by Kathie Lee Gifford\n\n1995: Listen to My Heart: Lessons in Love, Laughter, and Lunacy\n\n2010: Just When I Thought I'd Dropped My Last Egg: Life and Other Calamities\n\n2014: Good Gifts: One Year in the Heart of a Home\n\n2018: The Rock, the Road and the Rabbi\n\n2020: It’s Never Too Late: Make the Next Act of Your Life the Best Act of Your Life\n\nCooking\n\n1993: (with Regis Philbin) Cooking With Regis & Kathie Lee: Quick & Easy Recipes From America's Favorite TV Personalities\n\n1994: (with Regis Philbin) Entertaining With Regis & Kathie Lee: Year-Round Holiday Recipes, Entertaining Tips, and Party Ideas\n\nChristian faith\n\n2004: Gentle Grace: Reflections & Scriptures on God’s Gentle Grace\n\n2021: The Jesus I Know: Honest Conversations and Diverse Opinions about Who He Is\n\n2022: (with Rabbi Jason Sobel) The God of the Way: A Journey into the Stories, People, and Faith That Changed the World Forever\n\nChildren's books\n\n1997: Christmas with Kathie Lee: A Treasury of Holiday Stories, Songs, Poems, and Activities for Little Ones\n\n2010: Party Animals\n\n2011: The Three Gifts: A Story About Three Angels and the baby Jesus (co-written with Michael Storrings)\n\n2011: The Legend of Messy M'Cheany\n\n2018: The Gift That I Can Give\n\n2020: Hello, Little Dreamer[43]\n\nIn popular culture [ edit ]\n\nA fictionalized version of Kathie Lee Gifford appears in the South Park episode \"Weight Gain 4000\", voiced by Karri Turner.[44] Gifford later re-appears in the episodes \"The City on the Edge of Forever\", \"The Return of Chef\", \"200\" and \"201\".[45]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Kathie_Lee_Gifford_%2850091047183%29_%28cropped%29.jpg/220px-Kathie_Lee_Gifford_%2850091047183%29_%28cropped%29.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/0/03/Kathie_Lee_Gifford_%2850091047183%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/46/Kathie_Lee_and_Frank_Gifford.jpg/220px-Kathie_Lee_and_Frank_Gifford.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/0/03/Kathie_Lee_Gifford_%2850091047183%29_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Kathie_Lee_Gifford", "title": "Kathie Lee Gifford", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/03/Kathie_Lee_Gifford_%2850091047183%29_%28cropped%29.jpg/640px-Kathie_Lee_Gifford_%2850091047183%29_%28cropped%29.jpg", "width": 640, "height": 853}, "title": "Kathie Lee Gifford - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}