{"url": "www.cbsnews.com/news/scooter-braun-talent-manager-philanthropy-justin-bieber/", "text": "Coldplay was among the performers at a charity concert over the summer called One Love Manchester. Talent executive Scooter Braun helped organize the lineup. The 36-year-old orchestrated the tribute shortly after the terrorist attack outside an Ariana Grande concert in Northern England.\n\nGrande is one of more than two dozen clients Braun represents at SB Projects. Others include Justin Bieber, Usher and the Black Eyed Peas. He's made the company so successful that 21-time Grammy winner Kanye West called Braun personally to represent him. \"CBS This Morning\" co-host Gayle King spoke with Braun about his recent philanthropy, working with Justin Bieber and the rumors that he is considering a future career in politics.\n\n\"We'd been friends a long time. And all of a sudden – one thing led to another. And I told him, 'Look, I probably shouldn't manage you. We're friends. Better not doing' – he goes, 'No, you need to be part of the team,'\" Braun said. \"And I said, 'Well, why don't we get together in a week and we'll see?' And, like, the next day, I get a phone call from Adidas and Def Jam saying, 'We were told to deal with you, that you're in charge,'\" Braun said.\n\n\"And I – the next day. And I call Kanye and I said, 'I thought we'd talk in a week.' He goes, 'I don't have time to wait a week. You're in. And that was that,'\" Braun said.\n\nScooter Braun and Gayle King CBS News\n\nKanye West, is one of many stars on Braun's talent roster. Braun's artist management and entertainment company now has 28 clients, including Karlie Kloss and Ariana Grande. After over a decade in the industry, Braun is still best known for discovering a 13-year-old kid from Canada on YouTube.\n\n\"I was blown away when I saw him sing Ne-Yo, 'So Sick' – because he sang with such soul. And I thought here's a kid who could do that Michael Jackson model of angelic songs that made you believe in love again before you grew up and got jaded,\" Braun said.\n\nBraun helped guide Bieber from internet obscurity to global recognition. It's been a 10-year career full of public highs and lows. In July, he canceled the remaining 14 dates of his world tour. He apologized to fans, citing struggles with \"broken relationships\" and \"insecurities.\"\n\nBraun said deciding to cancel the tour was an \"extremely\" difficult decision but wouldn't say exactly what's going on with the star.\n\n\n\n\"Look, I think he'll decide to tell people when he's ready of what exactly happened. But I think he was making a decision, like he said, to protect himself. But he's 23 years old, now,\" Braun said. \"And if he makes a decision as a man, as long as he's willing to listen to opinions and hear people out – if he has true conviction, I'm willing to have his back.\"\n\nBraun says Bieber isn't just a client, he's family, but admits the trials throughout his career have, at times, been difficult.\n\nAsked if those trials have strained their relationship, Braun said, \"Absolutely. Because I – I wasn't willing to be a yes man. I wasn't willing to stand by. And I also had never been through it before. He was going through really hard times, and for a year and a half, I failed -- completely.\"\n\n\"I tried every single thing to get him back on the right track, and I failed time and time again. And my dad gave me great advice. He said, 'Look. Your responsibility isn't to change him. It's to be a rock,'\" Braun said.\n\nBraun, who remains close with his family, learned a hard lesson from his father about lying as a teen.\n\n\"There was one day I was about 14 years old. And he came out in the back yard, and I got in trouble for, like, a white lie a couple days earlier. And he said, 'I wanna talk to you,'\" Braun recounted. \"I said, 'Okay, dad, what's up?' And he said, 'You know what you did a couple days – you know, you lied, we caught you. And I keep thinking about how well you lied. And I want you to know I know you're a liar.' And, you know, my dad was my hero, so him calling me a liar, that hurt.\"\n\n\n\nThose words stuck with Braun and even informed how he went about his career.\n\n\n\n\"I mean, I was shaken. And I said, you know, 'I'm going to go through life and be successful, but I'm gonna do it with integrity. I don't wanna be a liar,'\" Braun said.\n\nLately, Braun has been mixing entertainment with philanthropy. Most recently, he was executive producer of the Hand in Hand telethon, which raised over $55 million for victims of Hurricanes Harvey and Irma.\n\nScooter Braun, Justin Bieber and Usher Raymond seen at the World Premiere of Open Road's \"Justin Bieber's Believe\" presented by Teen Vogue and sponsored by Clearasil, on Wednesday, Dec. 18, 2013 in Los Angeles. Eric Charbonneau / Open Road Films/AP Images\n\n\n\nIn June of this year, he organized the One Love Manchester benefit concert to pay tribute to the 22 killed in the terrorist attack at Ariana Grande's show only two weeks earlier.\n\n\n\n\"So, the hardest part was we kept getting no from a lot of people, saying, 'Oh, it's too soon, and you can't do this.' And we were feeling like, 'We have to do it now, and quickly. That's the statement.' We didn't wanna be disrespectful, so we reached out to the families of the victims, and overwhelmingly, they were supportive,\" Braun said. \"I take pride in the fact that we defeated this idea that people should be afraid to live their lives.\"\n\nIn addition to his philanthropic work, Braun continues to expand his brand. As for those rumors about a future in politics?\n\n\n\n\"There have been recent reports that California Democrats are lobbying you to run for governor of California. It sounds to me that you're at least thinking about it. Are you at least thinking about it?\" King asked.\n\n\"No, I'm thinking about getting more involved with our leadership. And I'm thinking about what can I do to help as a citizen, and, you know, what can I do with the platform I've been given to try and lead people to a place to remember the same people we're yelling at are the people we're claiming to help,\" Braun said.\n\n\"So Governor Braun, what will be the first thing you'll do?\" King joked.\n\n\"You wanna ask that question again? 'Cause I don't know what you're talking about.\"", "images": ["https://assets1.cbsnewsstatic.com/hub/i/r/2022/10/05/e87d6563-e158-49da-8e8e-aec310d86b20/thumbnail/140x90/40dfb86cd73b7f45d642853f90ee62d3/cbsn-fusion-brittney-griners-wife-on-wnba-stars-detention-in-russia-thumbnail-1351351-640x360.jpg#", "https://assets3.cbsnewsstatic.com/hub/i/r/2017/06/05/c1113abf-f9a0-45d6-b570-801812765379/thumbnail/620x349g2/4c1326c4428be77457dcd4108e23ed4d/gettyimages-692324262.jpg#", "https://assets3.cbsnewsstatic.com/hub/i/r/2017/09/21/85f4b6fb-2f32-4867-9d1f-d547610420e2/thumbnail/620x349/ba64a781d462d0a76595bda2c13ee8fe/ctm-092117-scooter.png#", "https://assets2.cbsnewsstatic.com/hub/i/r/2017/09/21/d458a39e-4feb-489f-a837-f6af286491ee/thumbnail/620x442/e07198b04de644ea2035e75792d6a35a/ap-841213275963.jpg#", "https://assets1.cbsnewsstatic.com/hub/i/2017/09/21/71385b4f-54fb-40f6-bf3a-b61ea375a18c/0921-ctm-scooterbraun-king-1401635-640x360.jpg", "http://www.cbsnews.com/assets/show/cbs-mornings/logo-square-32.svg", "https://assets3.cbsnewsstatic.com/hub/i/r/2018/11/24/a9be6014-08e6-4393-b983-4cc48fe0ccdb/thumbnail/140x90/32ba9a5f43792afe7a2da7d8f0011f9a/1124-satmo-learningtowerofpisa-doane-1719256-640x360.jpg#", "https://assets2.cbsnewsstatic.com/hub/i/r/2022/10/06/b230e55c-4246-4d63-b007-c8eef6eb0701/thumbnail/140x90/17cce188f6dffbb6ac269eb4526af2f3/1006-cbsm-cherellegriner-king-1352819-640x360.jpg#", "https://assets3.cbsnewsstatic.com/hub/i/r/2021/08/02/3925b283-24ec-43d9-8ca6-d8305dfc8696/thumbnail/140x90/db44c0828ae46c5b7005a8e8f4bff780/1627921030084.png#", "https://assets3.cbsnewsstatic.com/hub/i/r/2022/10/07/b9b017e7-bf4a-4e0a-ac5f-28eadfbb6bcb/thumbnail/140x90/8512363fc6bfad7e8f029e4270f6a7e3/zaporizhzhia-urkaine-strike-1243788294.jpg#", "https://assets2.cbsnewsstatic.com/hub/i/r/2017/09/21/71385b4f-54fb-40f6-bf3a-b61ea375a18c/thumbnail/1200x630/71aa08e1aa82a4b732a2e1d39e3316f5/0921-ctm-scooterbraun-king-1401635-640x360.jpg"], "top_img": "https://assets2.cbsnewsstatic.com/hub/i/r/2017/09/21/71385b4f-54fb-40f6-bf3a-b61ea375a18c/thumbnail/1200x630/71aa08e1aa82a4b732a2e1d39e3316f5/0921-ctm-scooterbraun-king-1401635-640x360.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.cbsnews.com/news/scooter-braun-talent-manager-philanthropy-justin-bieber/", "title": "Scooter Braun on philanthropy, working with Kanye and trying times with Justin Bieber", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1, user-scalable=0", "color-scheme": "only light", "robots": "index, follow, max-image-preview:large", "description": "Scooter Braun discusses his recent philanthropy, working with Bieber and the rumors that he is considering a career in politics", "keywords": "Ariana Grande", "news_keywords": "Ariana Grande", "al": {"web": {"url": "https://www.cbsnews.com/news/scooter-braun-talent-manager-philanthropy-justin-bieber/"}, "ios": {"app_name": "CBS News", "app_store_id": 334256223, "url": "cbsnewsapp://cbsnews.com/news/scooter-braun-talent-manager-philanthropy-justin-bieber/"}, "android": {"app_name": "CBS News", "package": "com.treemolabs.apps.cbsnews", "url": "cbsnewsapp://cbsnews.com/news/scooter-braun-talent-manager-philanthropy-justin-bieber/"}}, "og": {"type": "article", "url": "https://www.cbsnews.com/news/scooter-braun-talent-manager-philanthropy-justin-bieber/", "title": "Scooter Braun on philanthropy, working with Kanye and trying times with Justin Bieber", "description": "Scooter Braun discusses his recent philanthropy, working with Bieber and the rumors that he is considering a career in politics", "image": {"identifier": "https://assets2.cbsnewsstatic.com/hub/i/r/2017/09/21/71385b4f-54fb-40f6-bf3a-b61ea375a18c/thumbnail/1200x630/71aa08e1aa82a4b732a2e1d39e3316f5/0921-ctm-scooterbraun-king-1401635-640x360.jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 1536620209892267, "pages": 131459315949}, "article": {"publisher": "https://www.facebook.com/CBSMornings/", "content_tier": "free", "opinion": "false"}, "twitter": {"dnt": "on", "app": {"country": "US", "name": {"iphone": "CBS News", "ipad": "CBS News", "googleplay": "CBS News"}, "id": {"iphone": 334256223, "ipad": 334256223, "googleplay": "com.treemolabs.apps.cbsnews"}, "url": {"iphone": "cbsnewsapp://cbsnews.com/news/scooter-braun-talent-manager-philanthropy-justin-bieber/", "ipad": "cbsnewsapp://cbsnews.com/news/scooter-braun-talent-manager-philanthropy-justin-bieber/", "googleplay": "cbsnewsapp://cbsnews.com/news/scooter-braun-talent-manager-philanthropy-justin-bieber/"}}, "site": "@CBSMornings", "title": "Scooter Braun on philanthropy, working with Kanye and trying times with Justin Bieber", "description": "Scooter Braun discusses his recent philanthropy, working with Bieber and the rumors that he is considering a career in politics", "image": "https://assets2.cbsnewsstatic.com/hub/i/r/2017/09/21/71385b4f-54fb-40f6-bf3a-b61ea375a18c/thumbnail/1200x630/71aa08e1aa82a4b732a2e1d39e3316f5/0921-ctm-scooterbraun-king-1401635-640x360.jpg", "card": "summary_large_image"}, "theme-color": "#101010", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "CBS News", "apple-mobile-web-app-status-bar-style": "black"}, "movies": [], "publish_date": null, "source": "http://www.cbsnews.com", "summary": ""}