{"url": "https://en.wikipedia.org/wiki/Mi_Gente_(J_Balvin_and_Willy_William_song)", "text": "2017 single by J. Balvin and Willy William\n\n\"Mi Gente\" (English: My People) is a song recorded by Colombian singer J Balvin and French singer and producer Willy William. It was released on 30 June 2017 through Scorpio Music and Universal Music Latin. It is a remake of Willy William's song \"Voodoo Song\" which is an original French song by Willy William that went viral on Facebook in 2016 and released one year after.[2][3] The single was serviced to United States contemporary hit radio on 18 July 2017.[4] A remix version with American singer Beyoncé was released on 28 September 2017. J Balvin and Willy William released six more \"Mi Gente\" remixes on 20 October 2017 with Steve Aoki, Alesso, Cedric Gervais, Dillon Francis, Sunnery James & Ryan Marciano, and Henry Fong.\n\nComposition [ edit ]\n\n\"Mi Gente\" is a reworking of Willy William's previous single \"Voodoo Song\".\n\nAt 105 BPM, it is an uptempo moombahton song about ignoring barriers and just having fun while partying.\n\nCommercial performance [ edit ]\n\nThe original version topped the charts in most Latin American countries.\n\nIn the United States, the original version of the song peaked at number two on the Hot Latin Songs chart and at number 19 on the US Billboard Hot 100.\n\nIn Canada, the remix version of the song featuring Beyonce peaked at number 2 on the Canadian Hot 100 and number 3 on the Billboard Hot 100 in the US.\n\nJ Balvin and Willy William dropped six additional \"Mi Gente\" remixes with Steve Aoki, Alesso, Cedric Gervais, Dillon Francis, Sunnery James & Ryan Marciano, and Henry Fong.[5]\n\nMusic video [ edit ]\n\nDirected by 36 Grados, the accompanying music video premiered on Vevo the same day of the single release. Leila Cobo from Billboard magazine described the video as \"an explosion of color and dance\" which features people from around the globe and that is all about unifying through music. It has many cameo appearances, including Italian millionaire Gianluca Vacchi.[6]\n\nThe music video has over 3 billion views on YouTube as of April 2022,[7][8] making it the 30th most viewed video on the site. The video won an MTV VMA [9]\n\nControversy [ edit ]\n\nShortly after the song's release, many listeners noticed a very similar resemblance to Pitbull's grito, first appearing at 0:52 on the record, and twice more throughout the duration of the 3:09 track. The issue became very mainstream, with many reporters falsely believing that the grito was of Pitbull, which it was not. Pitbull's first action was releasing an illegal remix to the record, including his own grito, titling the track \"Mi Gente [Worldwide Remix].[10] After being released, many fans saw the striking resemblance between the two gritos being used. The Pitbull remix intentionally used both Pitbull's and that of the original track to show the similarity.\n\nOn 8 October 2019, Pitbull's legal team applied for a trademark on the popular \"EEEEEEYOOOOOO!\" grito, most popularly brought to market by Pitbull. On 17 April 2020, Pitbull was able to acquire a full trademark to the grito, thus becoming one of the less than 250 owners of a trademark for solely a sound.[11]\n\nTrack listing [ edit ]\n\nDigital download[12] No. Title Length 1. \"Mi Gente\" 3:09\n\nRemix[13] No. Title Length 1. \"Mi Gente\" (Henry Fong Remix) 3:38\n\nRemix[14] No. Title Length 1. \"Mi Gente\" (Hardwell & Quintino Remix) 2:25\n\nRemix[15] No. Title Length 1. \"Mi Gente\" (Cedric Gervais Remix) 4:32\n\nRemix[16] No. Title Length 1. \"Mi Gente\" (Dillon Francis Remix) 3:28\n\nRemix[17] No. Title Length 1. \"Mi Gente\" (Steve Aoki Remix) 3:56\n\nRemix[19] No. Title Length 1. \"Mi Gente\" (Alesso Remix) 3:36\n\nCharts [ edit ]\n\nCertifications [ edit ]\n\nRelease history [ edit ]\n\nBeyoncé remix [ edit ]\n\nOn 28 September 2017, a remix version featuring vocals by American singer Beyoncé was released on digital stores and streaming services. The remix was released as a single by Universal Music Latin, Republic Records, Columbia Records, and Parkwood Entertainment. Beyoncé donated all proceeds from the song to hurricane relief charities in Mexico, Puerto Rico, and other Caribbean islands. Balvin and William stated Beyoncé was the \"top choice\" for the remix, and had no expectation of her agreeing to the song when they reached out to her.\n\nBeyoncé would later perform the song in her set in Coachella in 2018. For the second weekend, Balvin joined her on stage and sung the remix with Beyoncé.[140] In 2019, the audiovisual recording was included in both the singer's live album Homecoming: The Live Album and the related film Homecoming.[141]\n\nThis song is also part of the set list for the OTR II tour. The song was added to the set list at the show in Manchester on 13 June 2018, at Etihad Stadium.\n\nCommercial performance [ edit ]\n\nUpon the release of the remixed version of the song featuring Beyoncé, the song reached number one on the Hot Latin Songs chart, ending the 35-week reign led by \"Despacito\", becoming Balvin's fourth number one on the Hot Latin Songs chart, as well as Beyoncé's highest-charting song on the chart after \"Irreplaceable\" peaked at number four and \"Beautiful Liar\" peaked at number 10 in 2007. On the Hot 100, the remix moved from number 21 to number three after a full tracking week, giving both Balvin and William their first top 10 single and Beyoncé her 17th top 10 single (27th with Destiny's Child) on the chart. The remix also reached number one in the US Digital Songs chart with 79,000 copies sold during that week (combined sales with the original version), becoming both Balvin and William's first number one song on that respective chart, and Beyoncé's sixth, as well as just the second mostly-Spanish sung song to top the chart after \"Despacito\".[142] This made \"Mi Gente\", alongside \"Despacito\", as the first time in the Hot 100 chart history for two non-English singles to appear in the top 10 simultaneously.\n\nIn Canada, the remix reached a new peak of number two on the Canadian Hot 100, behind Post Malone and 21 Savage's \"Rockstar\", becoming both Balvin and William's highest-charting single at the time, and Beyoncé's 13th top 10 single. It also moved from number 17 to number one on the Hot Digital Songs chart.[143]\n\nThe remix also peaked at number one in many European and Latin American countries, including Argentina, Hungary, Mexico, the Netherlands, Bolivia, Panama, Paraguay, Costa Rica, and peaking at number 11 in Australia.\n\nMusic video [ edit ]\n\nA music video was also released on YouTube featuring American producer Diplo, French DJ David Guetta, Dutch DJ Martin Garrix, Dutch DJ Tiësto, Venezuelan YouTuber Lele Pons, Brazilian soccer player Neymar, Brazilian singer Anitta, Colombian singer El Llane, Portuguese footballer Cristiano Ronaldo and several fan made videos.[144]\n\nCritical reception [ edit ]\n\nThe version featuring Beyoncé was named \"Best New Track\" by Pitchfork with Matthew Ismael Ruiz stating that the song \"is about a shared cultural pride, one that transcends borders and race, from J Balvin's native Colombia to Puerto Rico and across all of Latinidad. It's a declaration that \"El mundo nos quiere\" (The world wants us) set to a head-nod bop. Beyoncé gets this, and with this remix, she backs up her words with action. This is what solidarity sounds like.\"[145] Randall Roberts from Los Angeles Times wrote that: \"To say Beyoncé lends a hand in the remix is an understatement. Unlike guests who limit their contributions to a single late-track verse or hook, Beyoncé upends \"Mi Gente\" from the first verse and proceeds to bilingually maneuver through the rhythmic, up-tempo jam like the queen she is.\"[146]\n\nIn 2019, Pitchfork listed Mi Gente (Remix) at number 189 on their greatest songs of the decade (2010s) list.[147]\n\nAwards and nominations [ edit ]\n\nTrack listing [ edit ]\n\nDigital download[139] No. Title Length 1. \"Mi Gente\" (featuring Beyoncé) 3:29\n\nCharts [ edit ]\n\nCertifications [ edit ]\n\nRegion Certification Certified units/sales Australia (ARIA)[200] 3× Platinum 210,000 Portugal (AFP)[201] Gold 5,000 Spain (PROMUSICAE)[202] Gold 20,000 United States (RIAA)[203] 6.8× Diamond (Latin) 4,080,000 Sales+streaming figures based on certification alone.\n\nRelease history [ edit ]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/J_Balvin_Mi_Gente.jpg/220px-J_Balvin_Mi_Gente.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Mi-gente-beyonce.jpg/220px-Mi-gente-beyonce.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/f/f9/Double-dagger-14-plain.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/9/99/J_Balvin_Mi_Gente.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/9/99/J_Balvin_Mi_Gente.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Mi_Gente_(J_Balvin_and_Willy_William_song)", "title": "Mi Gente (J Balvin and Willy William song)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/9/99/J_Balvin_Mi_Gente.jpg", "width": 640, "height": 638}, "title": "Mi Gente (J Balvin and Willy William song) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}