{"url": "https://www.washingtonpost.com/lifestyle/style/oj-simpson-parole-hearing-could-set-him-free-within-months/2017/07/20/498e9252-6c93-11e7-b9e2-2056e768a7e5_story.html", "text": "Correction: A previous version of this story incorrectly stated that Christopher Darden's book \"In Contempt\" was published last year. It was published in 1996 and re-released in 2016.\n\nO.J. Simpson will soon be a free man. Again. A four-member parole board in Carson City, Nev., voted unanimously Thursday to curtail his 33-year prison sentence for kidnapping and armed robbery, stemming from a confrontation over sports memorabilia in Las Vegas in 2007.\n\nThe football legend, now 70 years old, could be released as soon as Oct. 1 into a world that’s still fascinated by his plummet from grace.\n\nAs the proceedings got underway, a smiling Simpson entered the hearing room at the Lovelock Correctional Center dressed in a light blue shirt with billowy sleeves, his hair splotched with white, his voice gravelly. Seated at a desk with his attorney, Simpson was by turns affable and testy, humbled and defiant.\n\n“I always thought I’ve been pretty good with people,” Simpson told the board by video link, “and have basically spent a conflict-free life.”\n\nThe board did not press him on that assertion, despite allegations of domestic abuse against Simpson (he pleaded no contest to spousal abuse in 1989), and its members made clear that they were not re-litigating his trial and acquittal for the 1994 killings of his ex-wife Nicole Brown Simpson and her friend Ronald Goldman.\n\n(Nicki DeMarco/The Washington Post)\n\nSimpson’s eldest daughter, Arnelle Simpson, and one of Simpson’s victims from the Vegas case testified in support of his release.\n\n“I’ve known O.J. for a long time,” said Bruce Fromong, a memorabilia dealer whom Simpson confronted with five other men, two of whom were armed. “I don’t feel that he’s a threat to anyone out there. He’s a good man. . . . I feel that it’s time to give him a second chance.”\n\nThe networks and cable-news stations devoted live coverage to the case throughout the day, enlisting key players from Simpson’s murder trial.\n\n[O.J.’s last defender — F. Lee Bailey — is broke, disbarred and working above a hair salon]\n\n“The circus is back in town,” declared Mark Fuhrman, the former Los Angeles detective whose racist remarks were weaponized in 1995 by Simpson’s defense team, in an essay for FoxNews.com. “O.J. Simpson is getting exactly what he loves — attention.”\n\n1 of 18 Full Screen Autoplay Close Skip Ad × O.J. Simpson is released from prison View Photos O.J. Simpson has been freed on parole after nine years in prison for robbery to retrieve sports memorabilia in Las Vegas. A Nevada parole board decided in July to release the 70-year-old former football, TV and movie star after serving his minimum term for the armed robbery and assault with a weapon. Caption O.J. Simpson has been freed on parole after nine years in prison for robbery to retrieve sports memorabilia in Las Vegas. A Nevada parole board decided in July to release the 70-year-old former football, TV and movie star after serving his minimum term for the armed robbery and assault with a weapon. Oct. 1, 2017 Hall of Fame football player O.J. Simpson signs documents before leaving Lovelock Correctional Center in Lovelock, Nev. Simpson, whose racially charged 1995 murder trial riveted the nation, was released from jail on parole today, after nine years behind bars for armed robbery. Nevada Department of Corrections/AFP/Getty Images Wait 1 second to continue.\n\nOn the “Today” show Thursday morning, Christopher Darden, one of the prosecutors for Simpson’s murder trial, was asked what he would say to Simpson if he was on the Nevada parole board.\n\n“Well, ‘Did you kill Ron and Nicole?’ ” said Darden, illustrating how Simpson remains inextricably linked to the earlier crime.\n\n“But of course that’s not legally relevant” to the Las Vegas case, said NBC host Savannah Guthrie.\n\n“Well that’s the one question I’d like to ask,” Darden said. “I think that’s the one question everybody would like to ask.”\n\nIt probably is. O.J. Simpson is perhaps the only story that could force cable news to cut away from merry-go-round coverage of President Trump, Russia and the health-care meltdown in Congress.\n\nSex, violence, wealth, power, hubris, race, fame, Kardashians, law and order — the Simpson case had it all in 1994 and 1995, and still does.\n\n“It is one whale of a good story,” ABC’s Ted Koppel said at the time. The murder trial, broadcast by courtroom cameras and covered gavel to gavel by CNN, would come to represent a coarsening of public debate and an acceleration of the 24-hour news cycle.\n\n“When a tabloid tornado begins to spin . . . even the best among us tend to get caught up in it,” CBS anchor Dan Rather told the Los Angeles Times after the verdict, which polarized blacks and whites anew after the 1992 Los Angeles riots. “Before you know it . . . your standards have just broken open and you’re not applying the same rules that you do to other stories.”\n\nPeople born between Simpson’s arrest and acquittal are old enough to drink legally, and the ’90s have receded far enough to trigger waves of nostalgia. American culture was due for a reminder and a reckoning, and television provided two major rehashings of the saga just last year: a 10-episode FX miniseries starring Cuba Gooding Jr., and a 7½-hour, Oscar-winning documentary — in which erstwhile confidants professed their belief in Simpson’s guilt, defense attorneys admitted to hoodwinking the jury, and one juror stated that the verdict was payback for the police beating of Rodney King.\n\nSimpson, meanwhile, was where many people thought he should’ve been in the first place: prison. Public perception of Simpson’s guilt has increased over time. A majority of both black and white people now agree that he was at least “probably guilty” of the murders, according to a Washington Post-ABC News poll conducted last year.\n\nNevada's Lovelock Correctional Center, where Simpson has been incarcerated since 2008. (Terry Chea/AP)\n\nSimpson participated in Thursday’s hearing by video conference from the medium-security Lovelock Correctional Center, a cropping of white buildings in the vast beigeness of northwestern Nevada. He’s lived there as Inmate 1027820 since he was convicted and sentenced in 2008. The families of Nicole Brown Simpson and Ron Goldman drew a direct connection between their 1994 killings and the incident at the Palace Station hotel in Vegas.\n\n“Allowing wealth, power and control to consume himself, he made a horrific choice on June 12, 1994, which has spiraled into where he is today,” Nicole’s sister Denise Brown said in a statement after the conviction, which came 13 years to the day after Simpson was acquitted for the murders. The Goldmans had already won a $33.5 million wrongful-death lawsuit against Simpson, which they believed drove him to reclaim valuable memorabilia.\n\nWhen he began his time at Lovelock, Simpson told the warden that he would try to be “the best prisoner they’ve ever had” — a sad echo of his bygone athletic prowess. During the ensuing nine years, Simpson mopped floors, disinfected gym equipment, coached inmate sports teams and led Bible study. He missed his children's’ graduations. He missed his sister’s funeral. He was commissioner of the prison’s softball league. He was wait-listed for a prison course called “Commitment to Change,” which he didn’t end up taking, and never enrolled in Alcoholics Anonymous, though he admitted the Vegas incident was fueled by booze. Other younger inmates came to him for advice, Simpson claimed, and he has mediated and defused conflicts. His favorite course was called “Alternative to Violence.”\n\n“I am sorry that things turned out the way they did,” Simpson said during the hearing, as the parole board weighed his risk to the public. “I had no intent to commit a crime. . . . I’ve done my time. I’d just like to get back to my family and friends — and believe it or not I do have some real friends.”\n\nAmericans now have Twitter and Facebook to offer their own armchair testimony in a cultural inquisition that may never end.\n\nPhotos of a battered Nicole Brown Simpson circulated on Twitter with the ironic quotation “conflict free life.”\n\n“I don’t feel sympathy for O.J. Simpson,” former NFL tight end Shannon Sharpe wrote on Facebook. “He left the black community a long time ago. If he gets out, I never want to hear his name mentioned again.”\n\n“I thought his statements were self-justifying, self-pitying, showing no remorse, no understanding, no sense of reality about his own life,” said CNN legal analyst Jeffrey Toobin during the network’s breathless coverage. Simpson “is a deeply delusional and self-obsessed narcissist, and good luck to America once he’s out.”\n\nSimpson was paroled on one set of charges in 2013, after apologizing to the board for the Vegas incident; the other set required an additional four-year term, at minimum, which ends this year. His maximum sentence of 33 years was viewed by some as retribution for his acquittal in 1995.\n\n“It really made us all aware that, despite our best efforts, it’s very difficult to separate the California case from the Nevada case,” Simpson’s lawyer Yale Galanter said at the time.\n\nNow, this chapter of the saga is ending. Simpson, who plans to move to Florida to be near family, could be golfing by the autumn. Darden published a best-selling memoir in 1996 titled “In Contempt.” Defense attorneys Johnnie Cochran and Robert Kardashian are dead. F. Lee Bailey, who famously cross-examined Fuhrman, is mostly broke and working above a hair salon in Maine. In September, the maligned lead prosecutor Marcia Clark was at the Emmy Awards ceremony in support of “The People vs. O.J. Simpson”; her eyes welled with tears when the actor Sarah Paulson took the stage and apologized on behalf of a judgmental nation.\n\nBut at the root of it all, still, is a double murder. On “Good Morning America” Thursday, the family of Ron Goldman vowed to continue pursuing Simpson’s assets, as a form of perpetual punishment.\n\n“What’s troubling to me is [that] the whole system gives second chances to violent felons,” said Fred Goldman, Ron’s father. “Ron doesn’t get a second chance.”", "images": ["https://www.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2017/07/20/Production/Daily/Style/Images/315738022_0-13.jpg?t=20170517", "https://img.washingtonpost.com/rf/image_480w/2010-2019/WashingtonPost/2017/07/20/Production/Daily/Style/Images/OJ_Simpson_Parole_17761-6dcfd.jpg?uuid=V_JSyG1nEeecFRd3QGNegw", "https://img.washingtonpost.com/rf/image_606w/2010-2019/WashingtonPost/2017/07/20/National-Enterprise/Images/OJ_Simpson_Parole_38923-913a1.jpg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://www.washingtonpost.com/pb/resources/img/spacer-gray.png&w=1&h=1"], "top_img": "https://www.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2017/07/20/Production/Daily/Style/Images/315738022_0-13.jpg?t=20170517", "keywords": [], "authors": ["Dan Zak", "Feature Writer", "July", "Dan Zak Is A Reporter For The Washington Post. He Writes A Wide Range Of News Stories", "Narratives", "Profiles Local", "National", "Foreign Assignments", "The Academy Awards To Fallujah", "Iraq. He Joined The Post In"], "canonical_link": "https://www.washingtonpost.com/lifestyle/style/oj-simpson-parole-hearing-could-set-him-free-within-months/2017/07/20/498e9252-6c93-11e7-b9e2-2056e768a7e5_story.html", "title": "O.J. Simpson is granted parole, closing another chapter in a neverending saga", "meta_data": {"eomportal-uuid": "498e9252-6c93-11e7-b9e2-2056e768a7e5", "object-hash": 1665212683, "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.5, maximum-scale=2.0", "referrer": "unsafe-url", "keywords": "oj simpson, o.j. simpson, parole, hearing, parole hearing, jail, prison, o.j. released, oj released, oj simpson released, parole denied, nicole brown simpson, nicole simpson, mark furhman, christopher darden, marcia clark", "news_keywords": "oj simpson, o.j. simpson, parole, hearing, parole hearing, jail, prison, o.j. released, oj released, oj simpson released, parole denied, nicole brown simpson, nicole simpson, mark furhman, christopher darden, marcia clark", "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "creator": "@MrDanZak"}, "og": {"type": "article", "site_name": "Washington Post", "url": "https://www.washingtonpost.com/lifestyle/style/oj-simpson-parole-hearing-could-set-him-free-within-months/2017/07/20/498e9252-6c93-11e7-b9e2-2056e768a7e5_story.html", "image": "https://www.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2017/07/20/Production/Daily/Style/Images/315738022_0-13.jpg?t=20170517", "title": "O.J. Simpson is granted parole, closing another chapter in a neverending saga", "description": "The former football star could be released from Nevada prison as early as Oct. 1."}, "article": {"publisher": "https://www.facebook.com/washingtonpost", "content_tier": "metered", "opinion": "false", "author": "https://www.facebook.com/MrDanZak2/"}, "fb": {"app_id": 41245586762, "admins": 500835072}, "description": "The former football star could be released from Nevada prison as early as Oct. 1.", "robots": "index,follow", "theme": "normal", "author": "https://www.facebook.com/MrDanZak2/"}, "movies": [], "publish_date": 1500505200.0, "source": "https://www.washingtonpost.com", "summary": ""}