{"url": "https://www.hollywoodreporter.com/live-feed/why-scandal-is-ending-season-7-1004113", "text": "ABC has officially confirmed that Shonda Rhimes political thriller Scandal — the drama that helped usher in an era of programming that better reflects society — would end with its previously announced seventh season.\n\nChanning Dungey, entertainment president at ABC, spoke with reporters about the decision during her pre-upfronts press call with reporters Tuesday and noted that Rhimes always envisioned seven seasons for the fast-paced Washington, D.C.-set soap.\n\n“I had conversions with Shonda Rhimes where she has had for a while a sense of how she wanted the story to end,” Dungey told reporters Tuesday ahead of ABC’s upfront presentation to ad buyers. “She said, ‘Look, I really feel like season seven is where I want to wrap up this story, because I always prefer to end a show where you’re feeling on top as opposed to letting things fizzle out.'”\n\nSeason seven will again feature a short number of episodes as Olivia Pope (Kerry Washington) and outgoing President Fitzgerald Grant (Tony Goldwyn ) inch closer to their Vermont dreams. (Season six wraps Thursday with the series on the verge of electing Bellamy Young’s former first lady Mellie Grant as its new president.)\n\n“I do think that audiences, especially fans and Gladiators, who are as loyal to Scandal as they have been, are going to want the story to end in the way that Shonda intended to,” said Dungey. “That was a decision she felt really good about, and we support wholeheartedly.”\n\nAn episode count for Scandal, which returns in the fall, has not yet been determined.\n\n“Deciding how to end a show is easy,” said Rhimes in a statement Tuesday following the press call. “Deciding when to finish is quite simple when the end date is years away. But actually going through with it? Actually standing up to say: ‘This is it?’ Not so much. So, next year we are going all out. Leaving nothing on the table. Creating this world in celebration. We are going to handle the end the way we like to handle the important things in our Scandal family: all together, white hats on, Gladiators running full speed over a cliff.”\n\nRhimes always envisioned Scandal as a show that did not have a long lifespan — her Grey’s Anatomy is heading into its 14th season in the fall — and always saw it as a seven-season show. Ahead of the fourth season opener, Rhimes always envisioned Scandal as a show that did not have a long lifespan — her Grey’s Anatomy is heading into itsseason in the fall — and always saw it as a seven-season show. Ahead of the fourth season opener, told THR that the drama inspired by the life of fixer Judy Smith wasn’t a “10-season or eight-season show.”\n\nIn its sixth season, Scandal has had to reinvent itself following the surprising November election that sent Republican and former reality TV personality Donald Trump to the White House. Suddenly, Rhimes‘ show about the insane things that politicians do didn’t seem so insane. (Producers had to scrap a planned storyline about Russians hacking the show’s presidential election when reality hit too close to home, for example.) During an oral history interview with THR in April pegged to the landmark 100th episode of Scandal, Rhimes was vocal about the show’s uncertain future in the country’s current political climate.\n\n“Any of the stories we planned now just feel like we’re copying what’s happening in reality, which is insane,” she said. “I used to know how it ended, and then Donald Trump was elected. We had a destination, and I don’t know if that’s our destination anymore.”\n\nStill, Scandal will leave an incredible legacy behind when it closes up shop for good during the 2017-18 broadcast season. The drama helped usher in a new era of diversity on the small screen when Rhimes cast Washington as fixer Olivia Pope. Washington picked up her first Emmy nomination in 2013 and became the first African-American to be nominated for best drama actress in the past 18 years and fifth overall.\n\nThe series also further solidified Rhimes as one of television’s most powerful showrunners and helped ABC bolster its Thursday lineup. With Scandal sandwiched between Grey’s Anatomy at 8 p.m. and the Rhimes-produced How to Get Away With Murder at 10 p.m., ABC created a “TGIT“-branded night consisting of three Rhimes-produced dramas.\n\nNext up for Rhimes is the long-awaited launch of Romeo and Juliet drama Still Star-Crossed. And while sophomore drama The Catch was canceled after two seasons, Shondaland — Rhimes‘ production company with longtime producing partner Betsy Beers — scored a series pickup for For the People, which has been described as a legal version of Grey’s Anatomy. All told, Rhimes will enter next season with four shows on the air again: Grey’s, Scandal, Murder and People, with a renewal for Still Star-Crossed having the potential to make it five for the second season in a row.\n\nScandal returns in the fall as part of ABC’s TGIT lineup.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/04/146063_1429-h_2017.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.hollywoodreporter.com/wp-content/uploads/2017/04/146063_1429-h_2017.jpg?w=1296&h=730&crop=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/04/146063_1429-h_2017.jpg?w=1024", "keywords": [], "authors": ["Lesley Goldberg"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/why-scandal-is-ending-season-7-1004113/", "title": "‘Scandal’: Why ABC (and Shonda Rhimes) Decided Season 7 Was the End", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "ABC Entertainment president Channing Dungey explains the decision to wrap up the Kerry Washington starrer.", "news_keywords": "Scandal", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Lesley Goldberg", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1004113, "title": "'Scandal': Why ABC (and Shonda Rhimes) Decided Season 7 Was the End", "published_at": "2017-05-16 09:26:50", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/04/146063_1429-h_2017.jpg?w=1024", "comment_count": 0, "tags": "Scandal", "topics": "TV News", "body": "ABC has officially confirmed that Shonda Rhimes political thriller Scandal — the drama that helped usher in an era of programming that better reflects society — would end with its previously announced seventh season.\r\nChanning Dungey, entertainment president at ABC, spoke with reporters about the decision during her pre-upfronts press call with reporters Tuesday and noted that Rhimes always envisioned seven seasons for the fast-paced Washington, D.C.-set soap.\r\n\r\n\t\"I had conversions with Shonda Rhimes where she has had for a while a sense of how she wanted the story to end,\" Dungey told reporters Tuesday ahead of ABC's upfront presentation to ad buyers. \"She said, 'Look, I really feel like season seven is where I want to wrap up this story, because I always prefer to end a show where you're feeling on top as opposed to letting things fizzle out.'\" \r\n\r\n\t \r\n\r\n\tSeason seven will again feature a short number of episodes as Olivia Pope (Kerry Washington) and outgoing President Fitzgerald Grant (Tony Goldwyn) inch closer to their Vermont dreams. (Season six wraps Thursday with the series on the verge of electing Bellamy Young's former first lady Mellie Grant as its new president.)\r\n\r\n\"I do think that audiences, especially fans and Gladiators, who are as loyal to Scandal as they have been, are going to want the story to end in the way that Shonda intended to,\" said Dungey. \"That was a decision she felt really good about, and we support wholeheartedly.\"\r\nAn episode count for Scandal, which returns in the fall, has not yet been determined. \r\n\r\n\t\"Deciding how to end a show is easy,\" said Rhimes in a statement Tuesday following the press call. \"Deciding when to finish is quite simple when the end date is years away. But actually going through with it? Actually standing up to say: 'This is it?' Not so much. So, next year we are going all out. Leaving nothing on the table. Creating this world in celebration. We are going to handle the end the way we like to handle the important things in our Scandal family: all together, white hats on, Gladiators running full speed over a cliff.\"\r\n\r\n\t \r\n\r\n\tRhimes always envisioned Scandal as a show that did not have a long lifespan — her Grey's Anatomy is heading into its 14th season in the fall — and always saw it as a seven-season show. Ahead of the fourth season opener, Rhimes told THR that the drama inspired by the life of fixer Judy Smith wasn't a \"10-season or eight-season show.\"\r\nIn its sixth season, Scandal has had to reinvent itself following the surprising November election that sent Republican and former reality TV personality Donald Trump to the White House. Suddenly, Rhimes' show about the insane things that politicians do didn't seem so insane. (Producers had to scrap a planned storyline about Russians hacking the show's presidential election when reality hit too close to home, for example.) During an oral history interview with THR in April pegged to the landmark 100th episode of Scandal, Rhimes was vocal about the show's uncertain future in the country's current political climate.\r\n\"Any of the stories we planned now just feel like we're copying what's happening in reality, which is insane,\" she said. \"I used to know how it ended, and then Donald Trump was elected. We had a destination, and I don't know if that's our destination anymore.\" \r\nStill, Scandal will leave an incredible legacy behind when it closes up shop for good during the 2017-18 broadcast season. The drama helped usher in a new era of diversity on the small screen when Rhimes cast Washington as fixer Olivia Pope. Washington picked up her first Emmy nomination in 2013 and became the first African-American to be nominated for best drama actress in the past 18 years and fifth overall.\r\nThe series also further solidified Rhimes as one of television's most powerful showrunners and helped ABC bolster its Thursday lineup. With Scandal sandwiched between Grey's Anatomy at 8 p.m. and the Rhimes-produced How to Get Away With Murder at 10 p.m., ABC created a \"TGIT\"-branded night consisting of three Rhimes-produced dramas.\r\n\r\nNext up for Rhimes is the long-awaited launch of Romeo and Juliet drama Still Star-Crossed. And while sophomore drama The Catch was canceled after two seasons, Shondaland — Rhimes' production company with longtime producing partner Betsy Beers — scored a series pickup for For the People, which has been described as a legal version of Grey's Anatomy. All told, Rhimes will enter next season with four shows on the air again: Grey's, Scandal, Murder and People, with a renewal for Still Star-Crossed having the potential to make it five for the second season in a row.\r\nScandal returns in the fall as part of ABC's TGIT lineup.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Scandal’: Why ABC (and Shonda Rhimes) Decided Season 7 Was the End", "url": "https://www.hollywoodreporter.com/tv/tv-news/why-scandal-is-ending-season-7-1004113/", "description": "ABC Entertainment president Channing Dungey explains the decision to wrap up the Kerry Washington starrer.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/04/146063_1429-h_2017.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-05-16T09:26:50+00:00", "modified_time": "2017-05-16T10:52:38+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Scandal’: Why ABC (and Shonda Rhimes) Decided Season 7 Was the End", "description": "ABC Entertainment president Channing Dungey explains the decision to wrap up the Kerry Washington starrer.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/04/146063_1429-h_2017.jpg?w=1296"}}, "movies": [], "publish_date": 1494926810.0, "source": "https://www.hollywoodreporter.com", "summary": ""}