{"url": "www.usatoday.com/story/news/politics/onpolitics/2017/08/13/charlottesville-ivanka-trump-condemns-white-supremacy/562903001/", "text": "Ivanka Trump issues direct condemnation of 'white supremacy and neo-nazis'\n\nShow Caption Hide Caption Ivanka Trump calls out 'white supremacy' Ivanka Trump denounced the deadly violence in Charlottesville, Virginia — hours after chaos took over the streets during a white supremacist rally. Time\n\nThe day after deadly protests that occurred in Charlottesville, Va. following a “Unite the Right” white nationalist rally, Ivanka Trump issued a more pointed assessment of blame than her father, saying there is “no place in society for racism, white supremacy and neo-nazis.”\n\n1:2 There should be no place in society for racism, white supremacy and neo-nazis. — Ivanka Trump (@IvankaTrump) August 13, 2017\n\n2:2 We must all come together as Americans -- and be one country UNITED. #Charlottesville — Ivanka Trump (@IvankaTrump) August 13, 2017\n\nIvanka Trump calling out “racism, white supremacy and neo-nazis” is the most specific language used by a member of the Trump family. Following an eruption of violence in the college town where one person was killed and 19 people were injured after a car hit protesters leaving a rally.\n\nOn Saturday afternoon, President Trump condemned the violence but blamed “many sides.”\n\nThe White House issued a statement Sunday saying \"The President said very strongly in his statement yesterday that he condemns all forms of violence, bigotry, and hatred. Of course that includes white supremacists, KKK Neo-Nazi and all extremist groups.\" But the president has not used those words himself.\n\nRepublicans and Democrats criticized the president for not being more forceful in calling out white nationalists groups.\n\nTrump “missed an opportunity to be very explicit here,\" Sen. Lindsey Graham, a Republican from South Carolina, said on Fox News Sunday.\n\nThe white nationalists “seem to believe they have a friend in Donald Trump in the White House… I would urge the president to dissuade them of the [idea] that he is sympathetic to their cause.”\n\n“We need more from our president on this issue … it’s up to him to correct the record here,\" Graham said.\n\nSen. Cory Gardner, a Republican, was one of the first Republicans to say Trump needed to \"call evil by its name\" Saturday.\n\n\"This president has done an incredible job of naming terrorism around the globe as evil., radical Islamic terrorism ... he has said and called it out time and time again and this president needs to do exactly that today, call this white supremacy, white nationalism evil,” Gardner said on CNN State of the Union Sunday. \"Let the country hear it and let the world hear it. It's something that needs to come from the Oval Office.\"\n\n“I wouldn’t have recommended that statement. I think he needed to be much harsher as it related to the white supremacists,” said Anthony Scaramucci, Trump’s former communications director, on ABC’s This Week, “It’s actually terrorism, whether it’s domestic or international terrorism with the moral authority of the presidency you have to call that stuff out.”\n\nHouse Minority Leader Nancy Pelosi, D-Calif., urged the president to say \"white supremacy is an affront to American values.\"\n\nRepeat after me, @realDonaldTrump: white supremacy is an affront to American values. #Charlottesville — Nancy Pelosi (@NancyPelosi) August 12, 2017\n\nAs of Sunday morning Trump had still not specifically condemned white nationalism.\n\n\"The president has been very clear, we cannot tolerate this kind of bigotry, this kind of hatred. And what he did is he called on all Americans to take a firm stance against it,\" said Trump National Security Adviser H.R. McMaster. \"The president called out anyone who is responsible for fomenting this kind of bigotry, hatred, racism and violence. I think the president was very clear on that.\"\n\nIvanka Trump and her husband Jared Kushner are Orthodox Jews and observe the Sabbath, which begins Friday night at sundown and runs through Saturday at sundown. During that time they do not engage in social media.", "images": ["http://www.gannett-cdn.com/-mm-/ff82b1af445c13c4978624a5ebd732f2640c009a/c=0-305-6000-3695&r=1280x720/local/-/media/2017/08/13/USATODAY/USATODAY/636382111538783905-EPA-EPASELECT-USA-IVANKA-MILITARY-SPOUSES-92789553.JPG", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://www.gannett-cdn.com/-mm-/1893984dda7012d6ecf90758428c1acee2860fc2/c=0-305-6000-3695/local/-/media/2017/08/13/USATODAY/USATODAY/636382111538783905-EPA-EPASELECT-USA-IVANKA-MILITARY-SPOUSES-92789553.JPG?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/1893984dda7012d6ecf90758428c1acee2860fc2/c=0-305-6000-3695/local/-/media/2017/08/13/USATODAY/USATODAY/636382111538783905-EPA-EPASELECT-USA-IVANKA-MILITARY-SPOUSES-92789553.JPG?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Eliza Collins"], "canonical_link": "https://www.usatoday.com/story/news/politics/onpolitics/2017/08/13/charlottesville-ivanka-trump-condemns-white-supremacy/562903001/", "title": "Ivanka Trump issues direct condemnation of 'white supremacy and neo-nazis'", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/news/politics/onpolitics/2017/08/13/charlottesville-ivanka-trump-condemns-white-supremacy/562903001/news/politics/onpolitics", "theme-color": "#ffffff", "og": {"type": "article", "title": "Ivanka Trump issues direct condemnation of 'white supremacy and neo-nazis'", "description": "On Saturday afternoon, President Trump condemned the\\u00a0violence but blamed “many sides.”", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/1893984dda7012d6ecf90758428c1acee2860fc2/c=0-305-6000-3695/local/-/media/2017/08/13/USATODAY/USATODAY/636382111538783905-EPA-EPASELECT-USA-IVANKA-MILITARY-SPOUSES-92789553.JPG?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "On Saturday afternoon, President Trump condemned the\\u00a0violence but blamed “many sides.”", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1502578800.0, "source": "http://www.usatoday.com", "summary": ""}