{"url": "https://www.wmagazine.com/story/sisterhood-of-the-traveling-pants-cast-reunited", "text": "At this point, the Sisterhood of the Traveling Pants reunions are too plentiful to count. Even 13 years after the release of the original film, stars Blake Lively, America Ferrera, Amber Tamblyn, and Alexis Bledell still seem to be as close as ever. Last May, the foursome gathered at Tamblyn’s directorial debut, an indie called Paint It Black, and this week they came together once again to support one of their own: this time Ferrera. Two days after the Ugly Betty star announced that she and her husband, director Ryan Piers Williams, are expecting their first child, she and her former co-stars turned friends reunited to celebrate.\n\nOf course, it wouldn’t be a real reunion with documentation and, as such, Ferrera shared a photo of the occasion. In it, the four women cozy up on a couch with all of their hands on the pregnant actress’ stomach. “Starting the New Year off with blessings from my Sisterhood,” Ferrera wrote in the caption on Instagram. “We’ve got work to do for the next generation. Let’s get to it. #TIMESUP”\n\nFerrera previously announced her pregnancy on Instagram in a New Year’s photo with Williams where the pair showed off a baby onesie that said “más besos (por favor)” (translation: “more kisses please”). “We’re welcoming one more face to kiss in 2018!,” she wrote. “Wishing you #MásBesos in the New Year! #babybesos #HappyNewYear ?”\n\nAs for whether or not Ferrera, Lively, Tamblyn and Bledel would reunite for the big screen once again, it seems like it’s just a matter of time until they do. News of a third Sisterhood of the Traveling Pants film first spread back in 2014 when Variety revealed that a threequel was officially in the works with Dawson’s Creek writer Liz Garcia in charge of adapting the novel — specifically the fifth and final one, Sisterhood Everlasting, as the sequel was adapted from the second, third and fourth books. Plus, last fall Tamblyn teased to Entertainment Weekly, “I have very high hopes for it happening sooner rather than later.” Ferrera has said the same, telling E! News, “It’s an idea and a conversation. I think it would be amazing. The sisterhood is still well and alive. I love my girls. We’re very much a part of each other’s lives and if the movie happens it would be a great thing.”\n\nRelated: Natalie Portman Has Finally Joined Instagram—and Already Entirely Devoted Her Account to Taking Action Against Sexual Assault\n\n13 Celebrities Reveal Their Favorite Toys Growing Up", "images": ["https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/wmag/2018/01/03/5a4d419581a7cd57a0891473_sisterhood-of-the-traveling-pants.png?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/wmag/2018/01/03/5a4d419581a7cd57a0891473_sisterhood-of-the-traveling-pants.png?w=414&h=413&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2022/10/5/47b5fa0f-fc48-4cb1-9604-6f5821fa832d-getty-1430611960.jpg?w=160&h=160&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.5093&fp-y=0.3502", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2022/8/29/9f122c0b-8ad0-4d04-b2cf-3379547870db-tswifty.jpeg?w=160&h=160&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.532&fp-y=0.228"], "top_img": "https://imgix.bustle.com/wmag/2018/01/03/5a4d419581a7cd57a0891473_sisterhood-of-the-traveling-pants.png?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.wmagazine.com/story/sisterhood-of-the-traveling-pants-cast-reunited", "title": "Sisterhood of the Traveling Pants Cast Reunited Once Again, This Time to Celebrate America Ferrera’s Pregnancy", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@wmag", "card": "summary_large_image", "creator": "@marissagmuller"}, "article": {"publisher": "https://www.facebook.com/wmagazine"}, "og": {"site_name": "W Magazine", "url": "https://www.wmagazine.com/story/sisterhood-of-the-traveling-pants-cast-reunited", "type": "article", "title": "Sisterhood of the Traveling Pants Cast Reunited Once Again, This Time to Celebrate America Ferrera's Pregnancy", "description": "The foursome gathered to celebrate America Ferrera's pregnancy.", "image": {"identifier": "https://imgix.bustle.com/wmag/2018/01/03/5a4d419581a7cd57a0891473_sisterhood-of-the-traveling-pants.png?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "The foursome gathered to celebrate America Ferrera's pregnancy."}, "movies": [], "publish_date": null, "source": "https://www.wmagazine.com", "summary": ""}