{"url": "https://www.hollywoodreporter.com/live-feed/orange-is-new-black-stars-802597", "text": "The upside of Orange Is the New Black‘s large cast — more than 30 regular or recurring parts among the Litchfield inmates alone — is that no one actor, not even first-billed Taylor Schilling, has to carry too much of the load.\n\nThe downside? The sprawling ensemble and multiple storylines mean that some of the cast rarely works together, if at all. More so than with many other series, the OITNB actresses watch the show as fans, too, and as such they have their own favorite storylines and characters.\n\nThe Hollywood Reporter asked for the cast’s favorite stories that don’t directly involve their characters, as well as which of their co-stars they like to watch work.\n\nRuby Rose (Stella)\n\n“At the very beginning, I was very much into the Piper-Alex scenario. It’s hard not to be. I was very invested in that relationship, just like millions of other people. Then the show went on and you got to understand more of the other characters, and it became more clear it was really an ensemble cast. I got very invested in Poussey and Taystee’s relationship as well. … And Lorna Morello, played by Yael [Stone], also captured my heart a little bit with her vulnerability.”\n\nSamira Wiley (Poussey)\n\n“Always Kate Mulgrew. Kate has such an amazing energy on set. She commands this presence that’s so admirable, and it makes you step back. I love seeing her onscreen. The way she handles her scenes … just walking down the hallway is amazing.”\n\nLea DeLaria (Big Boo)\n\n“I never get to work with Uzo [Aduba], and I’m always happy when she’s onscreen. We did that daggering thing in season one, but that was really the only time I’ve gotten to work with her. … Really interesting choices she makes with her character — like when I read it, I’ll think, that’s funny. But then Uzo will take it and turn it on a dime. She’ll take a line that was probably meant for comedy, and she’ll punch you right in the gut with it. And she’s right.”\n\nDanielle Brooks (Taystee)\n\n“I love the relationship that’s developing between Gloria and Sophia. I think Selenis [Levya] is just an amazing actress. It’s so cool to watch her in the kitchen and the struggle with her son. I also really enjoy the backstories this season. You already got the backstories of the main characters, but now you’re getting some of the backstories of the secondary characters, which you realize are not secondary characters. Everyone has an arc here and is really leaving a stamp in the show. It’s really cool to watch the backstories of characters you weren’t expecting to get.”\n\nAdrienne Moore (Black Cindy)\n\n“I’m always eager to see what Taryn Manning is gonna do. She likes to take the odd note. If you know anything about music, you have your chords but then you have those off-chords, and I think she finds those a lot in her character. And she’s a musician, so a lot of her music is in her character. She’s definitely someone who can be in her character and in that moment, and then step away and talk about how she has a DJing job in Florida next week.”\n\nKate Mulgrew (Red)\n\n“Adrienne Moore, Uzo Aduba, Danielle Brooks and Samira Wiley. That’s the tribe, and Red doesn’t have much to do with them. I miss them because they’re wildly talented, and every time I work with them, it’s an unexpected thing. They’re incredibly inventive and I love their energy. I feel that about the Latinas as well, but I have them in the kitchen.”\n\nTaylor Schilling (Piper)\n\n“I love to watch everybody, but I never work with Chang [Lori Tan Chin] ever, so whenever she’s working and she’s before me or after me, I try to watch her because she’s genius. So spicy! She is so unexpected. I never know what she’s gonna do, and I find her to be such a brilliant actress that I never have scenes with.”\n\nLaura Prepon (Alex)\n\n“That’s what’s so fun about the show. Because the cast is so big, there’s a lot of times where I don’t have any storylines with like half the cast. That’s what’s also fun about watching the show — I’ve read all the scripts, but then I get to see what the girls do with it, and these women are such great actresses, it’s so fun to watch. It’s hard to pick one character because everyone is so perfect for their character, and it’s so different.”\n\nSeason three of Orange Is the New Black is streaming now on Netflix.\n\n– Additional reporting by Ashley Lee", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2015/06/oitnb_favorite_storylines.jpg?w=2000&h=1126&crop=1", "https://www.hollywoodreporter.com/wp-content/uploads/2015/06/oitnb_favorite_storylines.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2015/06/oitnb_favorite_storylines.jpg?w=1024", "keywords": [], "authors": ["Rick Porter"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/orange-is-new-black-stars-802597/", "title": "‘Orange Is the New Black’ Stars Pick Their Favorite Storylines and Characters", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "\"It's hard to pick one character because everyone is so perfect for their character, and it's so different,\" Laura Prepon tells THR.", "news_keywords": "Orange is the New Black", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Rick Porter", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 802597, "title": "'Orange Is the New Black' Stars Pick Their Favorite Storylines and Characters", "published_at": "2015-06-15 15:40:30", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2015/06/oitnb_favorite_storylines.jpg?w=1024", "comment_count": 0, "tags": "Orange is the New Black", "topics": "TV News", "body": "The upside of Orange Is the New Black's large cast — more than 30 regular or recurring parts among the Litchfield inmates alone — is that no one actor, not even first-billed Taylor Schilling, has to carry too much of the load.\r\nThe downside? The sprawling ensemble and multiple storylines mean that some of the cast rarely works together, if at all. More so than with many other series, the OITNB actresses watch the show as fans, too, and as such they have their own favorite storylines and characters.\r\nThe Hollywood Reporter asked for the cast's favorite stories that don't directly involve their characters, as well as which of their co-stars they like to watch work.\r\nRuby Rose (Stella)\r\n\"At the very beginning, I was very much into the Piper-Alex scenario. It's hard not to be. I was very invested in that relationship, just like millions of other people. Then the show went on and you got to understand more of the other characters, and it became more clear it was really an ensemble cast. I got very invested in Poussey  and Taystee's  relationship as well. ... And Lorna Morello, played by Yael [Stone], also captured my heart a little bit with her vulnerability.\"\r\n\r\nSamira Wiley (Poussey)\r\n\"Always Kate Mulgrew. Kate has such an amazing energy on set. She commands this presence that's so admirable, and it makes you step back. I love seeing her onscreen. The way she handles her scenes ... just walking down the hallway is amazing.\"\r\nLea DeLaria (Big Boo)\r\n\"I never get to work with Uzo [Aduba], and I'm always happy when she's onscreen. We did that daggering thing in season one, but that was really the only time I've gotten to work with her. ... Really interesting choices she makes with her character — like when I read it, I'll think, that's funny. But then Uzo will take it and turn it on a dime. She'll take a line that was probably meant for comedy, and she'll punch you right in the gut with it. And she's right.\" \r\nDanielle Brooks (Taystee)\r\n\"I love the relationship that's developing between Gloria and Sophia. I think Selenis [Levya] is just an amazing actress. It's so cool to watch her in the kitchen and the struggle with her son. I also really enjoy the backstories this season. You already got the backstories of the main characters, but now you're getting some of the backstories of the secondary characters, which you realize are not secondary characters. Everyone has an arc here and is really leaving a stamp in the show. It's really cool to watch the backstories of characters you weren't expecting to get.\"\r\nAdrienne Moore (Black Cindy)\r\n\"I'm always eager to see what Taryn Manning is gonna do. She likes to take the odd note. If you know anything about music, you have your chords but then you have those off-chords, and I think she finds those a lot in her character. And she's a musician, so a lot of her music is in her character. She's definitely someone who can be in her character and in that moment, and then step away and talk about how she has a DJing job in Florida next week.\"\r\n\r\nKate Mulgrew (Red)\r\n\"Adrienne Moore, Uzo Aduba, Danielle Brooks and Samira Wiley. That's the tribe, and Red doesn't have much to do with them. I miss them because they're wildly talented, and every time I work with them, it's an unexpected thing. They're incredibly inventive and I love their energy. I feel that about the Latinas as well, but I have them in the kitchen.\"\r\nTaylor Schilling (Piper)\r\n\"I love to watch everybody, but I never work with Chang [Lori Tan Chin] ever, so whenever she's working and she's before me or after me, I try to watch her because she's genius. So spicy! She is so unexpected. I never know what she's gonna do, and I find her to be such a brilliant actress that I never have scenes with.\"\r\nLaura Prepon (Alex)\r\n\"That's what's so fun about the show. Because the cast is so big, there's a lot of times where I don't have any storylines with like half the cast. That's what's also fun about watching the show — I've read all the scripts, but then I get to see what the girls do with it, and these women are such great actresses, it's so fun to watch. It's hard to pick one character because everyone is so perfect for their character, and it's so different.\"\r\nSeason three of Orange Is the New Black is streaming now on Netflix.\r\n- Additional reporting by Ashley Lee", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Orange Is the New Black’ Stars Pick Their Favorite Storylines and Characters", "url": "https://www.hollywoodreporter.com/tv/tv-news/orange-is-new-black-stars-802597/", "description": "“It’s hard to pick one character because everyone is so perfect for their character, and it’s so different,” Laura Prepon tells THR.", "site_name": "The Hollywood Reporter", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2015/06/oitnb_favorite_storylines.jpg?w=1024", "locale": "en_US"}, "article": {"published_time": "2015-06-15T15:40:30+00:00", "modified_time": "2015-06-15T15:51:23+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Orange Is the New Black’ Stars Pick Their Favorite Storylines and Characters", "description": "“It’s hard to pick one character because everyone is so perfect for their character, and it’s so different,” Laura Prepon tells THR.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2015/06/oitnb_favorite_storylines.jpg?w=3000"}}, "movies": [], "publish_date": 1434382830.0, "source": "https://www.hollywoodreporter.com", "summary": ""}