{"url": "https://www.bustle.com/articles/22014-the-evolution-of-cameron-diazs-career-from-the-mask-to-the-other-woman", "text": "With no major awards to her name (yet) and a career that's sometimes been overshadowed by her off-screen romances or her headline-grabbing quotes, it's unfortunately too easy to brush aside Cameron Diaz's impressive, long-lasting, and unique resume in Hollywood. At 41-years-old, and exactly 20 years since she burst on to the scene in the smash comedy The Mask, Diaz is still sitting pretty on the A-list. This year alone she has three major projects on her docket: two comedies, including The Other Woman and Sex Tape, as well as the remake of the musical Annie.\n\nThe model-turned-actress has a career that has exceeded many expectations, one that has included multi-million dollar franchises (Shrek, Charlie's Angels), critically-praised performances (Being John Malkovich, In Her Shoes), raunchy comedy hits (There's Something About Mary, Bad Teacher), eye-raising indies (Vanilla Sky, The Counselor), mainstream rom-coms (My Best Friend's Wedding, What To Expect When You're Expecting), and even a Best Picture nominee (The Gangs of New York). While there have been, of course, some misfires (The Box, Knight and Day, among others), Diaz has kept things interesting, not only for herself, but for audiences and critics alike.\n\nIn anticipation The Other Woman, the comedy which Diaz stars alongside with Leslie Mann and Kate Upton and opens in theaters this Thursday, we look back at the evolution of her screen career.\n\n1994 - 1999: A Star is Born\n\nIn 1994, it was all about Jim Carrey. The guy was everywhere. But leave it to Cameron Diaz to upstage him at the absolute height of his fame. Diaz skyrocketed to breakout star status when she played Carrey's va-va-voom love interest in the manic comedy The Mask. The movie, which went on to earn $119 million at the box office, launched Diaz's career and made her a household name in the '90s. While Diaz mostly played sidekicks or love interests, sometimes with good results (My Best Friend's Wedding), but mostly with not-so-good results (Very Bad Things, Feeling Minnesota, A Life Less Ordinary) none of that mattered by 1998. Because thanks to one shocking hairdo in one seriously un-PC, but hilarious Farrelly Brothers comedy, everyone knew Diaz could hold her own.\n\nDiaz played the titular, fawned-over Mary in There's Something About Mary, an R-rated comedy that would earn $176 million at the box office and proved that the fearless Diaz was just as funny, if not funnier, than the guys dominating the comedy scene in the '90s like Ben Stiller. But Diaz's most daring transformation happened in 1999 when she played the frizzy, frazzled Lotte in the Oscar-nominated mind-bender Being John Malkovich.\n\nWhile she was a natural at comedy, it was Spike Jonze that opened a new portal to Diaz's talents beyond being goofy and giggly. As Roger Ebert marveled in his glowing review of the film, \"Cameron Diaz, one of the best-looking women in movies, who here looks so dowdy we hardly recognize her; Diaz has fun with her talent by taking it incognito to strange places and making it work for a living.\" (Diaz earned Golden Globe nominations for her performances in both Being John Malkovich and There's Something About Mary.)\n\n2000 - 2005: The Really Big Time\n\nThe early 2000s were, without question, the most successful of Diaz's career. In 2000 the big screen Charlie's Angels reboot was a girl power powerhouse that spawned a 2003 sequel that brought in a combined $350 million in the U.S. alone. Diaz also lent her voice as Princess Fiona to the animated juggernaut that was the Shrek saga. The original Shrek was released in 2000, won an Oscar, and had three follow-ups (2004's Shrek 2, 2007's Shrek the Third, and 2010's Shrek Forever After) which comined all totaled over $1 billion in box office receipts.\n\nIn addition to her blockbusters, Diaz teamed up with acclaimed directors Cameron Crowe and Martin Scorsese to mixed results with 2001's Vanilla Sky (audiences didn't warm to it, but it earned Diaz her third Globe nomination) and 2002's Gangs of New York (a hit that earned Diaz her fourth-career Globe nod), respectively. The actress also tried to recreate the gross-out magic of There's Something About Mary, but failed to do so with 2002's critically panned The Sweetest Thing. She fared far better when she appeared alongside Toni Collette in the 2005 family dramedy In Her Shoes, a movie that showed some of Diaz's best acting and range to date.\n\n2006 - 2010: A Rough Patch\n\nWhile 2006's sugary ensemble rom-com The Holiday was a moderate hit ($63 million), what followed wasn't so sweet. Diaz starred in a series of flicks that both audiences and critics turned away from, including the mind-numbing 2008 comedy What Happens in Vegas, the emotionally manipulative 2009 drama My Sister's Keeper, 2009's so-laughably-bad-it's-bad thriller The Box, and 2010's Tom Cruise reunion gone awry Knight and Day. Hey, ya can't win 'em all.\n\n2011 - Current: Back in the Groove?\n\nOkay, so 2011's The Green Hornet sucked, but that was through no fault of Diaz's own. Plus, she bounced back rather nicely later that year with the comedy Bad Teacher, a movie she carried all the past the $100 million mark at the box office. While 2012 and 2013 brought Diaz two of the worst-reviewed movies of her career, Gambit (a mere 19 percent on Rotten Tomatoes) and the polarizing The Counselor (all anyone could really talk about was that car scene), 2014 looks to be one of the star's most noteworthy years in quite some time with the triple threat of The Other Woman, Sex Tape, and Annie.\n\nImages: Wifflegif.com; Giphy.com\n\nSaveSave", "images": ["https://imgix.bustle.com/uploads/image/2022/10/3/5e832f56-7962-4c2d-a9d3-ee0f0d5043c7-mean-girls-day-october-3.webp?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/rehost/2016/9/13/f585745e-9229-425b-a3e7-0b0da7fd8245.jpg?w=800&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/rehost/2016/9/13/f585745e-9229-425b-a3e7-0b0da7fd8245.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/image/2022/10/7/e445d44d-33df-4ad5-8213-e6a7c41a19d5-ciw_unit_12862_r.JPG?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2021/9/9/fdf70156-e6c2-4e7a-9f0c-6fd889cd5b6a-parenttrapelizabeth001.jpeg?w=159&h=110&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.4947&fp-y=0.4573", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/image/2022/10/3/eb10b851-2f60-4c7a-a74c-31d443352031-14_jurneesmollett_teaser.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1"], "top_img": "https://imgix.bustle.com/rehost/2016/9/13/f585745e-9229-425b-a3e7-0b0da7fd8245.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/articles/22014-the-evolution-of-cameron-diazs-career-from-the-mask-to-the-other-woman", "title": "The Evolution of Cameron Diaz's Career From 'The Mask' to 'The Other Woman'", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image", "creator": "@alysemigran"}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/articles/22014-the-evolution-of-cameron-diazs-career-from-the-mask-to-the-other-woman", "type": "article", "title": "The Evolution of Cameron Diaz's Career From 'The Mask' to 'The Other Woman'", "description": "With no major awards to her name (yet) and a career that's sometimes been overshadowed by her off-screen romances or her headline-grabbing quotes, it's unfortunately too easy to brush aside Cameron Diaz's impressive, long-lasting, and unique resume…", "image": {"identifier": "https://imgix.bustle.com/rehost/2016/9/13/f585745e-9229-425b-a3e7-0b0da7fd8245.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "With no major awards to her name (yet) and a career that's sometimes been overshadowed by her off-screen romances or her headline-grabbing quotes, it's unfortunately too easy to brush aside Cameron Diaz's impressive, long-lasting, and unique resume…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}