{"url": "https://www.metacritic.com/feature/tv-premiere-dates", "text": "TUE / November 1\n\nBelow Deck Adventure Trailer Reality Bravo, 9p\n\nGod Forbid: The Sex Scandal That Brought Down a Dynasty Documentary\n\nWED / November 2\n\nHudson River Wild Reality Smithsonian, 8p\n\nUpcycle Nation Reality competition Fuse, 10p\n\nTHU / November 3\n\n▣ Blockbuster Trailer Comedy\n\nInspired by the true story of the planet's sole remaining Blockbuster Video location (in Bend, Oregon)—also the subject of a recent documentary—Netflix's new sitcom is a single-camera workplace comedy set in the last Blockbuster standing. Randall Park stars as the store's manager, and he's joined there by Melissa Fumero, Madeleine Arthur, JB Smoove, Tyler Alvarez, Olga Merediz, and Kamaia Fairburn. The series comes from Superstore/Brooklyn Nine-Nine writer Vanessa Ramos and also counts David Caspe (Happy Endings) among its producers. Ten episodes stream today, but you'll need to return them within three days if you don't want to pay any late fees.\n\n▣ The Capture Drama Peacock\n\nHip Hop Homicides Trailer Reality WE, tbd\n\nKanColle Anime Crunchyroll\n\nKold X Windy Reality WE, tbd\n\nThe Really Loud House Trailer Comedy/Family Nickelodeon, 7p\n\nRehab Addict Lake House Rescue Reality HGTV, 9p\n\n▣ The Suspect Drama Sundance Now\n\nFRI / November 4\n\nBuying Beverly Hills Trailer Reality\n\n▣ Causeway Trailer Drama Apple TV+\n\nJennifer Lawrence stars as an American soldier who suffers a traumatic brain injury while serving in Afghanistan and struggles to readjust to life at home in this A24-produced drama from first-time director Lila Neugebauer. Brian Tyree Henrey, Linda Emond, and Jayne Houdyshell also star.\n\nStar Millie Bobby Brown and director Harry Bradbeer return for a sequel to Netflix's 2020 mystery film based on Nancy Springer's book series about Sherlock Holmes' less-famous sister. Henry Cavill, David Thewlis, and Helena Bonham Carter also star.\n\nThe Fabulous Trailer Foreign/Drama\n\nI'm Totally Fine Trailer Sci-fi/Comedy ($) Rent/Buy\n\nLookism Trailer Anime\n\n▣ Lopez vs. Lopez Comedy 8p\n\nGeorge Lopez stars opposite his real-life daughter Mayan Lopez in NBC's new family comedy.\n\nA Magical Christmas Village Drama Hallmark, 8p\n\n▣ Manifest Trailer Drama\n\nThe former NBC series moves to Netflix for its fourth and final season, which will be split into two parts. Ten episodes stream today.\n\n▣ The Mosquito Coast Drama Apple TV+\n\n▣ My Policeman Trailer Drama Prime Video\n\nHarry Styles, Emma Corrin, and David Dawson star in a Greg Berlanti-produced romance set in Britain in both the 1950s and '90s. The adaptation of the book by Bethan Roberts will also play in theaters beginning October 21.\n\nSelena Gomez: My Mind & Me Documentary Apple TV+\n\nSlumberkins Family/Animation Apple TV+\n\nDaniel Radcliffe stars as beloved musician and song parodist “Weird Al\" Yankovic in a comedic, Funny or Die-produced biopic about Yankovic's music career and personal life—with only most of the facts changed. Yankovic himself co-wrote the script, making it his first film project since his 1989 cult classic UHF. Eric Appel (Brooklyn Nine-Nine, Silicon Valley) directs a cast that also includes Quinta Brunson (as Oprah Winfrey), Evan Rachel Wood (as Madonna), and Rainn Wilson (as legendary DJ Dr. Demento), while Toby Huss and Julianne Nicholson play Al's parents.\n\nYoung Rock Comedy 8:30p\n\nSAT / November 5\n\nLights, Camera, Christmas! Drama Hallmark, 8p\n\nA Maple Valley Christmas Drama HMM, 10p\n\nMerry Swissmas Drama Lifetime, 8p\n\nA Royal Christmas on Ice Drama GAF, 8p\n\nSUN / November 6\n\nAll Saints Christmas Drama Hallmark, 8p\n\nDangerous Liaisons Trailer Drama Starz, 9p\n\nThe latest take on the 18th century French novel—a tale of romance and backstabbing which has been adapted multiple times in seemingly every medium imaginable, though this is the first English-language TV adaptation— depicts the romantic entanglements of members of the court of Louis VXI in 18th century Paris, and, in particular, the orign story of the complicated relationship between Merteuil (Alice Englert) and Valmont (Nicholas Denton). The reimagining comes from Harriet Warner (Call the Midwife, Tell Me Your Secrets) and also stars Leslie Manville, Paloma Faith, and Game of Thrones alumni Carice van Houten and Michael McElhatton.\n\nLove at the Christmas Contest Drama GAF, 8p\n\n▣ Mood Drama BBC America, tbd\n\nNicole Lecky adapts her own play Superhoe into a six-part series in which she plays an aspiring recording artist who attempts to recover from a major setback by becoming an online influencer.\n\nSpector Trailer Documentary 9p\n\nShowtime's four-part series re-examines the life of legendary music producer Phil Spector in light of the murder trial for which he became famous anew toward the end of his life—and also focuses on the life of the murder victim, actress Lana Clarkson. Streamers can catch the entire series early on Friday 11/4.\n\nMON / November 7\n\nThe Culpo Sisters Trailer Reality TLC, 9p\n\nTUE / November 8\n\nAqua Teen Forever: Plantasm Trailer Animation/Comedy ($) Rent/Buy\n\nBuried: The 1982 Alpine Meadows Avalanche Documentary ($) Rent/Buy\n\nSay Hey, Willie Mays! Documentary/Sports 9p\n\nWED / November 9\n\n56th Annual CMA Awards Live event/Music 8p\n\nLuke Bryan and Peyton Manning host.\n\n▣ The Crown Drama\n\nThe fifth of what will eventually be six seasons of Netflix's hit Emmy-winning period drama about the life of Queen Elizabeth II brings another cast overhaul as the story jumps forward in time to the mid-1990s—and the eventual death of Princess Diana (now played by Elizabeth Debicki). Imelda Staunton takes over as the Queen, while Jonathan Pryce now plays Prince Philip, Lesley Manville is Princess Margaret, and Jonny Lee Miller portrays new Prime Minister John Major. Also starring this season, as then-Prince Charles and Camilla Parker Bowles, are Dominic West and Olivia Williams, respectively, while the former's real-life son Senan West plays Prince William as a teenager (though not until the end of the season).\n\nRooted: America's Tree of Life Reality Smithsonian, 8p\n\nSave Our Squad With David Beckham Trailer Reality Disney+\n\nZootopia+ Animation/Family/Anthology Disney+\n\nSix animated shorts—each adopting a different TV genre—are set in the world of Disney's 2016 hit film Zootopia.\n\nTHU / November 10\n\nThe Big Brunch Reality competition HBO Max\n\nDan Levy hosts a new cooking competition that focuses on the meal that's not quite breakfast and not quite lunch but comes with a slice of canteloupe at the end. The first three episodes stream today.\n\n▣ The Calling Drama Peacock\n\nDavid E. Kelley's newest crime series (titled The Missing until just a few months ago) is an adaptation of the novel The Missing File by Dror A. Mishani. The eight-episode series centers on an NYPD detective named Avraham Avraham (played by Unorthodox's Jeff Wilbusch) who believes his spirituality gives him an edge in cracking cases. His beliefs, however, are put to the test when what begins as a routine investigation turns out to be anything but. Juliana Canfield (Succession), Karen Robinson, and Michael Mosley also star, while Barry Levinson directs today's opener and additional episodes.\n\nNetflix's holiday rom-com stars Lindsay Lohan and Chord Overstreet as an amnesiac heiress and a ski lodge owner, respectively.\n\nFRI / November 11\n\nAll Saints Street Anime Crunchyroll\n\nBar Fight! Comedy ($) Rent/Buy\n\nCapturing the Killer Nurse\n\nA Christmas Open House Drama discovery+\n\nCircuit Breakers Family/Sci-fi/Anthology Apple TV+\n\nDesigning Christmas Drama discovery+\n\nDylan & Zoey Drama ($) Rent/Buy\n\n▣ The English Trailer Drama/Western Prime Video\n\nA co-production between Amazon and the BBC, this violent and unsettling six-episode western from Hugo Blick (The Honourable Woman) is set on the American frontier in the 1890s—and, in particular, in a Wyoming town plagued by a series of unsolved murders—and stars Emily Blunt, Chaske Spencer, Rafe Spall, Toby Jones, Ciaran Hinds, Stephen Rea, and Tom Hughes. The entire series streams today.\n\nA Gingerbread Christmas Drama discovery+\n\nIn Merry Measure Drama Hallmark, 8p\n\nVeteran film critic Elvis Mitchell directs an examination of the history of Black cinema—with a special focus on films of the 1970s.\n\nDirected by Nora Twomey (The Secret of Kells), this tale of friendship between a boy and a dragon is adapted from Ruth Stiles Gannett's award-winning children's book and features the voices of Jacob Tremblay, Rita Moreno, Gaten Matarazzo, Judy Greer, Chris O'Dowd, Dianne Wiest, Alan Cumming, and more.\n\n▣ Mythic Quest Trailer Comedy Apple TV+\n\nCo-star F. Murry Abraham is out, but the rest of the cast is back for season 3 of Apple's videogame developer workplace comedy, which picks up following last year's conclusion that saw key members of the company resigning to start a rival developer. The first two episodes stream today.\n\nOne Delicious Christmas Drama discovery+\n\nPlay-Doh Squished Trailer Reality competition Freevee\n\nTransformers: EarthSpark Animation/Family Paramount+\n\nSAT / November 12\n\nOur Italian Christmas Memories Drama HMM, 10p\n\nA Merry Christmas Wish Drama GAF, 8p\n\nThe Royal Nanny Drama Hallmark, 8p\n\nSUN / November 13\n\nChristmas at the Golden Dragon Drama Hallmark, 8p\n\nMy Best Friend's Christmas Drama GAF, 8p\n\nTulsa King Trailer Drama Paramount+\n\nThe latest Paramount+ series from Yellowstone creator Taylor Sheridan—we assume they'll eventually name the streaming service after him—features the first scripted TV starring role for Sylvester Stallone (Stop! Or My Mom Will Shoot). He plays a New York Mafia captain who is released from a multi-decade prison stay and is sent by his boss to run a new operation in Tulsa, Oklahoma. Domenick Lombardozzi (The Wire), Andrea Savage (I'm Sorry), Max Casella (Doogie Howser), Martin Starr (Silicon Valley), Dana Delany (Desperate Housewives), and Garrett Hedlund (Tron: Legacy) also star, while Boardwalk Empire creator Terence Winter serves as showrunner. Two episodes stream tonight on Paramount+ (followed by weekly single-episode installments), while the first episode will also air tonight on cable's Paramount Network following the Yellowstone premiere.\n\n▣ Yellowstone Trailer Drama Paramount, 8p\n\nThe supersized fifth season will be divided in two seven-episode parts.\n\nMON / November 14\n\nCelebrity IOU Reality HGTV, 9p\n\nTeletubbies [2022 reboot] Family\n\nWED / November 16\n\nCall My Agent! [Korean version] Foreign/Comedy\n\nIn Her Hands Documentary\n\nLeverage: Redemption Trailer Drama Freevee\n\nLimitless With Chris Hemsworth Trailer Reality Disney+\n\nMartha Cooks Reality The Roku Channel\n\nThe Santa Clauses Trailer Comedy/Family Disney+\n\nTim Allen returns for a miniseries sequel to his 1994 holiday movie The Santa Clause (and its two feature film sequels). Also back are Elizabeth Mitchell and David Krumholtz (who wisely skipped the third film), joined by newcomers like Kal Penn and (in a cameo) Peyton Manning. Jason Winer (Modern Family) directs, while Jack Burditt (30 Rock) produces.\n\nThe latest from Sebastián Lelio (Gloria, A Fantastic Woman, Disobedience) is an adaptation of Room author Emma Donoghue’s 1862-set novel about an English nurse (Florence Pugh) who travels to the Irish Midlands to observe an 11-year-old girl who has survived months without food, making her a saint to many in her tiny village. Critics had good things to say about the psychological thriller (which also opens in theaters on November 2nd) when it debuted at Telluride in September.\n\nTHU / November 17\n\n▣ A Christmas Story Christmas Comedy/Drama/Family HBO Max\n\nThis sequel to the beloved 1983 holiday comedy A Christmas Story finds Ralphie (played once again by Peter Billingsley, who has spent most of the past few decades on the other side of the camera as a director and producer) returning to his childhood home with his own kids in tow. Also returning from the original film are Zack Ward, Scott Schwartz, Ian Petrella, and R.D. Robb, while new faces include Julie Hagerty (taking over as Ralphie's mom) and Erinn Hayes (as Ralphie's wife). It's technically the third sequel to the original film, though you'd be forgiven if you can't remember 1994's dud It Runs in the Family (aka My Summer Story) or the straight-to-video 2012 sequel A Christmas Story 2.\n\nChristmas With You Rom-com\n\nNetflix's first new holiday rom-com of at least the past 48 hours stars Freddie Prinze Jr. and Aimee Garcia.\n\nFleishman Is in Trouble Trailer Rom-com\n\nAnother FX-But-Really-Only-on-Hulu™ original series, Fleishman Is in Trouble is an eight-episode adaptation of the book of the same name by Taffy Brodesser-Akner (who also scripted the adaptation). Directed by Jonathan Dayton and Valerie Faris (Little Miss Sunshine), the series stars Jesse Eisenberg as a recently divorced New York doctor who just begins to re-enter the dating pool when his ex-wife (Claire Danes) disappears, leaving him to care for their two young children. Lizzy Caplan and Adam Brody also star, while Josh Radnor and Christian Slater also have recurring roles. Two episodes stream today.\n\n▣ I Am Vanessa Guillén Documentary\n\nLeopard Skin Drama Peacock\n\nFRI / November 18\n\nBlue's Big City Adventure Trailer Family Paramount+\n\nElite Trailer Foreign/Drama\n\nEmeril Cooks Reality The Roku Channel\n\nThe Great British Baking Show: Holidays Reality competition\n\nInterrupting Chicken Animation/Family Apple TV+\n\nInventing the Christmas Prince Drama Hallmark, 8p\n\nThe Last Manhunt Trailer Western ($) Rent/Buy\n\nMartha Holidays Reality The Roku Channel\n\nJeff Malmberg (Marwencol) directs a look at the history of Walt Disney's most famous character, Mickey Mouse. A new animated short, “Mickey in a Minute,” accompanies the documentary.\n\n▣ The People We Hate at the Wedding Comedy Prime Video\n\nPlanet Sex With Cara Delevingne Reality\n\nPoppy Drama IndiePix\n\n▣ Spirited Comedy/Family/Musical Apple TV+\n\nRyan Reynolds and Will Ferrell head the cast for a musical adaptation of Charles Dickens' holiday classic A Christmas Carol. Octavia Spencer and Sunita Mani also star for director Sean Anders (Daddy's Home). The film, which features new original songs by Benj Pasek and Justin Paul (La La Land), will also play in theaters beginning November 11.\n\nJason Schwartzman, Lili Taylor, and Lennie James star in the latest indie dramedy from Andrew Bujalski (Support the Girls), which is also in theaters today.\n\nZiwe Talk/Comedy 11p\n\nSAT / November 19\n\nChristmas at Pine Valley Drama GAF, 8p\n\nLong Lost Christmas Drama HMM, 10p\n\nThree Wise Men and a Baby Drama Hallmark, 8p\n\nSUN / November 20\n\nElton John Live: Farewell From Dodger Stadium Live event Disney+\n\nThe L Word: Generation Q Drama 8p\n\nGuests in season 3 include Margaret Cho, Kehlani, and Joey Lauren Adams. Each weekly episode will also be available to stream two days early (on Fridays).\n\nMy Favorite Christmas Tree Drama GAF, 8p\n\nA Waltons Thanksgiving Drama 8p\n\nNow do you believe that the average age of a CW viewer is 58? Is this not enough for you?\n\nWhen I Think of Christmas Drama Hallmark, 8p\n\nTUE / November 22\n\nNocebo Trailer Thriller ($) Rent/Buy\n\nWelcome to Chippendales Trailer Drama\n\nKumail Nanjiani stars as Steve Banerjee, the Indian immigrant who founded the Chippendales male-stripping empire, in this eight-episode based-on-a-true-story limited series formerly titled Immigrant. Created by screenwriter Robert Siegel (who also created the recent Hulu miniseries Pam & Tommy), Chippendales is not exactly your standard American Dream success story—among other things, it's described as a true crime saga and a dark comedy—but the show does feature a strong cast that also includes Murray Bartlett, Dan Stevens, Annaleigh Ashford, Robin De Jesús, Andrew Rannells, and Juliette Lewis. Jenni Konner (Girls) serves as showrunner alongside Siegel, while Matt Shakman (WandaVision) directs. Two episodes stream today.\n\nWED / November 23\n\nEcho 3 Drama Apple TV+\n\nA 10-episode bilingual action-thriller created by Oscar-winning screenwriter Mark Boal (The Hurt Locker) and adapted from an award-winning Israeli series called When Heroes Fly, Echo 3 centers on the disappearance of an American scientist (Jessica Ann Collins) near the border between Colombia and Venezuela. Attempting to track her down are her brother (Luke Evans) and husband (Michiel Huisman), each of whom have military experience but also complicated pasts. Three episodes stream today, followed by weekly single-episode installments on Fridays beginning December 2nd.\n\n▣ Good Night Oppy Documentary Prime Video\n\nDirector Ryan White (Ask Dr. Ruth) traces what was expected to be a 90-day—but turned out to be a 15-year—mission of the Mars Exploration Rover named Opportunity. The film will also receive a limited theatrical run beginning November 4.\n\nPitch Perfect: Bumper in Berlin Trailer Comedy Peacock\n\nCreated by non-Emmy-winner Megan Amram (The Good Place), this spinoff from the Pitch Perfect film franchise centers on Adam DeVine's Bumper Allen, who moves to Germany in an attempt to revive his career after one of his songs becomes an unexpected hit in that country. Also returning from the films is fan favorite Flula Borg (as Pieter Krämer, now Bumper's manager), while newcomers include Jameela Jamil, Sarah Hyland, and Lera Abova.\n\nWednesday Clip Comedy/Horror\n\nNetflix's new Addams Family spinoff series centering on the high school years of the now-teenaged Wednesday Addams (Jenna Ortega) comes from Smallville creators Alfred Gough and Miles Millar and finds Tim Burton directing half of the eight episodes—marking the latter's first TV work since a 1986 episode of Faerie Tale Theatre. Much of the action takes place at Wednesday's school, Nevermore Academy, where she will confront the supernatural mystery plaguing her family and attempt to stop a killing spree in the local town (in between homework assignments, presumably). Gwendoline Christie, Riki Lindhome, Jamie McShane, and Percy Hynes White also star, while Catherine Zeta-Jones and Luis Guzmán will recur as Morticia and Gomez Addams, respectively. Also appearing is Christina Ricci, who played Wednesday in a pair of 1990s Addams Family films but will be portraying a new character in the series.\n\nTHU / November 24\n\nA Christmas Mystery Drama HBO Max\n\nCriminal Minds: Evolution Drama Paramount+\n\nNot really a new series, Evolution is a continuation of the CBS drama Criminal Minds, which ended its 15-season run in 2020. Returning cast members include Joe Mantegna, Paget Brewster, A.J. Cook, Aisha Tyler, Adam Rodriguez, and Kirsten Vangsness, while new faces include Zach Gilford. The first two (of 10) episodes stream today; additional episodes will arrive one per week on Thursdays (with a monthlong holiday break in the middle of the season).\n\nThe long-awaited sequel to the 2007 Disney princess movie Enchanted comes from director Adam Shankman (Hairspray) and finds returning cast members Amy Adams, Patrick Dempsey, Idina Menzel, and James Marsden joined by newcomers Maya Rudolph, Oscar Nunez, and Yvette Nicole Brown.\n\nFirst Love Trailer Foreign/Drama\n\nHoliday Harmony Drama HBO Max\n\nMy Southern Family Christmas Drama Hallmark, 8p\n\nThe Noel Diary Drama/Rom-com\n\nFRI / November 25\n\nChristmas at the Drive-In Drama GAF, 8p\n\nFantasy Football Comedy/Family/Sports Paramount+\n\nA Royal Corgi Christmas Drama Hallmark, 8p\n\nWe're Here Reality 10p\n\n#Xmas Drama Hallmark, 6p\n\nSAT / November 26\n\nHaul Out the Hollly Drama Hallmark, 8p\n\nI'm Glad It's Christmas Drama GAF, 8p\n\nA Tale of Two Christmases Drama Hallmark, 6p\n\nTime for Him to Come Home for Christmas Drama HMM, 10p\n\nSUN / November 27\n\nCandace Cameron Bure Presents: A Christmas ... Present Drama GAF, 8p\n\nA Christmas Cookie Catastrophe Drama Hallmark, 6p\n\nA Holiday Spectacular Drama Hallmark, 8p\n\nRivalling only David Lynch's Twin Peaks (a clear influence) for its blend of supernatural horror, dark comedy, and out-and-out strangeness, Lars von Trier's Danish hospital TV series The Kingdom ran for two seasons in 1994 and 1997. (It was later remade in America by Stephen King, but not successfully.) But if Lynch could bring Peaks back for another round, why can't von Trier do the same with The Kingdom? And so we have Exodus, a third (and said to be final) set of five episodes, all directed by von Trier and featuring a mix of old and new faces (including, respectively, Udo Kier and Alexander Skarsgard), with the latter group mostly replacements for actors who have died since the prior miniseries. This time, the director gets, well, \"meta\" as he opens the series with a woman angered by watching that previous Kingdom season and winds up entering the hellish hospital herself. Episodes tream weekly, and if you have yet to see the original two seasons, those hard-to-find episodes will also begin streaming on MUBI on November 13 (for season 1) and November 20 (for the second season).\n\n▣ Krapopolis Clip Animation/Comedy tbd\n\nSpecial sneak preview of the new Dan Harmon animated series (set in the world of Greek mythology) that will make its proper series debut in early 2023.\n\nTUE / November 29\n\nReindeer in Here Animation/Family 9p\n\nWED / November 30\n\nIrreverent Drama Peacock\n\nThis 10-episode Australian drama (actually a co-production with Netflix, though it's a Peacock exclusive in America) centers on a Chicago criminal played by Colin Donnell (Chicago Med). After botching a heist at home, he goes on the run and winds up in a small town in northern Australia, where he poses as the local church's reverend.\n\nMy Name Is Vendetta Trailer Foreign/Drama/Thriller\n\nSnack vs. Chef Reality competition\n\nWillow Trailer Drama/Fantasy Disney+", "images": ["https://static.metacritic.com/images/products/movies/4/d7d4220e6af7758a9b7debdc9ba94cc1-98.jpg", "https://static.metacritic.com/images/features/networks/hulu15transparent.png", "https://static.metacritic.com/images/products/music/9/fde5e6bad29685a0849cb977e4f27b2e-98.jpg", "https://static.metacritic.com/images/products/games/4/b814dbab04f6d3db442c30f7b01b4b3d-98.jpg", "https://static.metacritic.com/images/products/games/3/7ab27ffe2eea120270e65bfb2c967927-98.jpg", "https://static.metacritic.com/images/features/networks/comedycentralnew20.png", "https://static.metacritic.com/images/features/main/netflix202210-50.jpg", "https://www.metacritic.com/images/icons/mc-mustsee-sm.svg", "https://static.metacritic.com/images/features/main/hbo202210-50.jpg", "https://static.metacritic.com/images/products/games/2/e86033fabd087ad18ba07a0b1f1e1e94-98.jpg", "https://static.metacritic.com/images/products/music/5/98977f4e9176d0a942cd10ae47981292-98.jpg", "http://static.metacritic.com/images/features/networks/fx20.png", "https://static.metacritic.com/images/features/main/_TNtvpreview202210-180.jpg", "https://www.metacritic.com/images/icons/metacritic-wordmark.svg", "https://static.metacritic.com/images/products/movies/9/0072b1c753abae170f66646158c329a1-98.jpg", "https://static.metacritic.com/images/features/main/peacock202209-50.jpg", "https://static.metacritic.com/images/products/tv/7/3a2221980f81a9310cca6bc07cbcff50-98.jpg", "https://static.metacritic.com/images/products/tv/6/bb7cbd150da25997e842cfefc48628a1-98.jpg", "https://static.metacritic.com/images/products/games/4/107361b2f178b07c8640d04e6216949d-98.jpg", "https://static.metacritic.com/images/features/networks/netflixnew50.jpg", "https://static.metacritic.com/images/features/networks/hbo20.png", "https://static.metacritic.com/images/features/main/amazon202210-50.jpg", "https://static.metacritic.com/images/features/main/_TNmusic2022midyear-180.jpg", "https://static.metacritic.com/images/products/tv/6/a5aee2905926c3be00a078c307c79f51-98.jpg", "https://static.metacritic.com/images/features/networks/showtime20.png", "https://static.metacritic.com/images/features/main/amazon202210-28.jpg", "https://static.metacritic.com/images/features/networks/fox20.png", "https://static.metacritic.com/images/products/tv/0/99d16ada3b64f3991057c91bb7e3c87b-98.jpg", "https://www.metacritic.com/images/icons/mc-mustwatch-sm.svg", "https://static.metacritic.com/images/features/main/moviepreview_2022_10-180.jpg", "https://static.metacritic.com/images/features/_graphics/miniseries.gif", "https://static.metacritic.com/images/features/main/paramountplus202209-28.jpg", "https://static.metacritic.com/images/features/main/netflix202210-28.jpg", "https://static.metacritic.com/images/products/movies/4/eb450e40562c7f8d041abb0fbd6c934a-98.jpg", "https://static.metacritic.com/images/features/networks/cbs20.png", "https://static.metacritic.com/images/features/networks/abc20.png", "https://static.metacritic.com/images/features/main/games_awards_tracker_2021-28.jpg", "https://static.metacritic.com/images/features/networks/nbc20.png", "https://static.metacritic.com/images/features/main/tvpremieredates-28.jpg", "https://static.metacritic.com/images/features/_graphics/special.gif", "https://static.metacritic.com/images/features/main/_TNtvpreview202210-50.jpg", "https://static.metacritic.com/images/features/main/gamescorecard2022fallragnarok-180.jpg", "https://static.metacritic.com/images/features/main/hulu202209-50.jpg", "https://static.metacritic.com/images/features/main/paramountplus202209-50.jpg", "https://www.metacritic.com/media/networks/cw20.png", "https://static.metacritic.com/images/products/music/2/8c3188ac861c8d1683622ee63b4046fe-98.jpg", "https://www.metacritic.com/media/networks/pbs25.png", "https://static.metacritic.com/images/products/movies/7/5bd611266bf38df0155b4cfc83d33ebe-98.jpg", "https://static.metacritic.com/images/features/_graphics/movie.gif", "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg", "https://static.metacritic.com/images/products/tv/8/351b6c4f6e68bcfa287e4db776d78445-98.jpg", "https://static.metacritic.com/images/products/games/4/76851a66ee2c21d65e5d047a3ac8b04a-98.jpg", "https://static.metacritic.com/images/products/movies/1/604a976f86b1a236ebf218162eb9b9a2-98.jpg", "https://static.metacritic.com/images/features/media/graphics/new.gif", "https://static.metacritic.com/images/features/main/tv_bettercallsaulseriesfinale-28.jpg", "https://static.metacritic.com/images/products/music/9/abd2d67980e2d98465a525bc2899dbfd-98.jpg", "https://www.metacritic.com/images/icons/metacritic-icon.svg", "https://www.metacritic.com/images/icons/search_inactive.svg", "https://static.metacritic.com/images/products/music/9/7bc800ce155a1dba733cd0dadfe0b424-98.jpg", "https://static.metacritic.com/images/features/main/apple202210-50.jpg"], "top_img": "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.metacritic.com/feature/tv-premiere-dates", "title": "Fall 2022 TV Premiere Calendar", "meta_data": {"description": "Find a calendar of premiere dates for all upcoming new and returning television shows, plus TV movies and specials.", "viewport": "width=1024", "application-name": "Metacritic", "msapplication-TileColor": "#000000", "msapplication-TileImage": "/images/win8tile/76bf1426-2886-4b87-ae1c-06424b6bb8a2.png", "facebook-domain-verification": "618k3mbeki8tar7u6wvrum5lxs5cka", "og": {"title": "Fall 2022 TV Premiere Calendar", "type": "article", "url": "https://www.metacritic.com/feature/tv-premiere-dates", "image": "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg", "site_name": "Metacritic", "description": "Find a calendar of premiere dates for all upcoming new and returning television shows, plus TV movies and specials."}, "fb": {"app_id": 123113677890173}, "twitter": {"site": "@metacritic", "creator": "@metacritic", "card": "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg"}}, "movies": [], "publish_date": null, "source": "https://www.metacritic.com", "summary": ""}