{"url": "https://www.elitedaily.com/p/photos-of-pax-jolie-pitt-at-the-golden-globes-will-make-you-feel-so-so-old-7817976", "text": "On Sunday, Jan. 7, Angelina Jolie walked the red carpet at the Golden Globes with her son, Pax. While you might still think of her children as, well, children, photos of Pax Jolie-Pitt at the Golden Globes prove just how much he's grown up. At this point, little Pax is all the way up to 14 years old, and he suited up to support his mother — complete with some special accessories to show that he's there for all women.\n\nJolie is at the Golden Globes as a presenter, and her newest film, First They Killed My Father, which she directed, was nominated for Best Motion Picture — Foreign Language. Like pretty much everyone else there, she was wearing black. The actresses, actors, and other attendees wore black to the awards as a form of protest against sexual harassment (and general sexism) in the industry and beyond. Fourteen-year-old Pax, too, wore black. He was in a really sweet black velvet tuxedo. And, like many attendees, he donned a pin reading \"Time's Up.\"\n\nThe Time's Up pin is also a form of protest against sexual harassment. It represents the Time's Up initiative, which was created by women in Hollywood as a plan to stop sexual harassment and the barriers it creates for women in the industry. All in all, it was a good showing for young Pax. This kind of support at a young age from men and boys is just what the world needs in order to see actual societal change in the future.\n\nTake a look at Pax Jolie-Pitt as his mother's date at the Golden Globes.\n\nFrazer Harrison/Getty Images Entertainment/Getty Images\n\nAngelina Jolie and Brad Pitt adopted Pax back in 2008.\n\nThe then-4-year-old Pax Thien Jolie-Pitt had been living in an orphanage in Vietnam, according to People. The adoption was formally approved by the L.A. County Children's Court.\n\nIn the 10 years since becoming part of Jolie's family, Pax has really gotten into the family business — and especially in this past year. Angelina got two of her sons in on the work for her new movie, First They Killed My Father, which is about the genocide in Khmer Rouge, Cambodia. Jolie directed the film, which was released in 2017 on Netflix. The movie was written by Jolie and Loung Ung, who wrote a memoir of the same name about her experience.\n\nEmma McIntyre/Getty Images Entertainment/Getty Images\n\nBoth Pax and his older brother, Maddox, who is 16 years old, got involved with the production of First They Killed My Father, according to E!. Teenager Maddox got an executive producer credit for his work in many aspects of filming. Pax, meanwhile, was on set as a photographer. Naturally, their work made their mother very proud. Jolie has said that she would be very happy for any of her children to follow her into the film industry, and she said her sons worked very hard on First They Killed My Father. Her son, Maddox, only had good things to say about her in return — telling People magazine she's \"fun, funny, and easy to work with\" as well as a \"wonder.\"\n\nNot a bad review, huh?\n\nWith all that work in mind, this was not the first time that Pax has walked a red carpet alongside Jolie. He has been present for many of the carpet appearances for First They Killed My Father throughout the fall of 2017. In addition to its Netflix release, the film was screened at both the Telluride Film Festival and the Toronto International Film Festival. The movie has received a number of accolades as the awards season goes on. In addition to the Golden Globe nomination, the movie won an award at the Hollywood Film Awards and was nominated for a Critics' Choice Award.\n\nIt's surely an exciting year for Maddox, Pax, and Angelina, and it's great that they get to experience it together.", "images": ["https://imgix.bustle.com/uploads/getty/2018/1/8/18e25ad4-c824-4283-8596-2a7673b06e75-getty-902355500.jpg?w=414&h=621&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2018/1/8/83c0c432-3f32-4c52-88c1-16ed418b9a6a-getty-845780946.jpg?w=374&h=281&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2022/10/7/f647f3ef-a498-4bd0-8b18-df928069394a-getty-487882572.jpg?w=138&h=138&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.5267&fp-y=0.1383", "https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/image/2022/9/26/0cde0f65-d906-437b-a1e5-34b2a793473b-1426672682.jpg?w=138&h=138&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.3827&fp-y=0.2114", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2018/1/8/83c0c432-3f32-4c52-88c1-16ed418b9a6a-getty-845780946.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/uploads/getty/2022/9/30/ee1559aa-6086-4a3d-9fe9-bc93ffac1ff7-getty-1356230552.jpg?w=138&h=138&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.5307&fp-y=0.314", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/getty/2018/1/8/80f3d717-4a92-41e4-88f3-902128bc184a-getty-845788512.jpg?w=414&h=279&fit=crop&crop=faces&auto=format%2Ccompress"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/1/8/83c0c432-3f32-4c52-88c1-16ed418b9a6a-getty-845780946.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/p/photos-of-pax-jolie-pitt-at-the-golden-globes-will-make-you-feel-so-so-old-7817976", "title": "Angelina Jolie Brought Her Son As Her Golden Globes Date & He's So Grown Up", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image", "creator": "@asvokos"}, "article": {"publisher": "https://www.facebook.com/EliteDaily"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/p/photos-of-pax-jolie-pitt-at-the-golden-globes-will-make-you-feel-so-so-old-7817976", "type": "article", "title": "Angelina Jolie Brought Her Son As Her Golden Globes Date & He's So Grown Up", "description": "On Sunday, Jan. 7, Angelina Jolie walked the red carpet at the Golden Globes with her son, Pax. While you might still think of her children as, well, children, photos of Pax Jolie-Pitt at the Golden Globes prove just how much he's grown up. At this…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/1/8/83c0c432-3f32-4c52-88c1-16ed418b9a6a-getty-845780946.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "On Sunday, Jan. 7, Angelina Jolie walked the red carpet at the Golden Globes with her son, Pax. While you might still think of her children as, well, children, photos of Pax Jolie-Pitt at the Golden Globes prove just how much he's grown up. At this…"}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}