{"url": "https://www.hollywoodreporter.com/rambling-reporter/angelina-jolie-talks-brad-pitt-bells-palsy-vanity-fair-cover-story-1024589", "text": "Now, it’s Angelina Jolie’s turn.\n\nIn May, Brad Pitt opened up to GQ Style in a bombshell of an interview, his first following a widely publicized and relatively nasty split from longtime partner Angelina Jolie. In the story, Pitt talked about the circumstances surrounding the divorce, admitting that he had quit drinking and was working toward becoming a better man. By nearly all accounts, the Michael Paterniti-penned profile was great for Pitt, who had taken a significant hit to his image with tabloid and TMZ reports of an alleged altercation on a private plane between Pitt and their son Maddox.\n\nJolie has kept quiet until now.\n\nToday, Vanity Fair published a cover story featuring the 42-year-old actress, filmmaker, humanitarian and mother of six. For the profile, titled “Angelina Jolie Solo,” she sat down with longtime Vanity Fair contributing editor Evgenia Peretz and posed for photographer duo Mert Alas and Marcus Piggott after being styled by Jessica Diehl. Vanity Fair has been something of a go-to for Jolie. She’s been featured on multiple covers through the years, all with revelatory and intimate interviews. This new one is no different. Below are a few highlights.\n\nRumors\n\nJolie swatted down talk that the couple’s globe-trotting lifestyle got in the way of their marriage. “[Our lifestyle] was not in any way a negative,” she says. “That was not the problem. That is and will remain one of the wonderful opportunities we are able to give our children … They’re six very strong-minded, thoughtful, worldly individuals. I’m very proud of them. … They’ve been very brave. They were very brave.” As for the family unit, Jolie contends that everyone is on the upswing, though she prefers to keep it vague. “We’re all just healing from the events that led to the filing … They’re not healing from divorce. They’re healing from some … from life, from things in life.”\n\nEmotions\n\n“I was very worried about my mother, growing up — a lot. I do not want my children to be worried about me. I think it’s very important to cry in the shower and not in front of them. They need to know that everything’s going to be all right even when you’re not sure it is.” As for her relationship with Pitt and whether they’re able to communicate now, she offers: “We care for each other and care about our family, and we are both working towards the same goal.”\n\nHome\n\nShe recently settled into a new home, the 11,000-square-foot estate once owned by Cecil B. DeMille. It was listed for $25 million and features six bedrooms and 10 bathrooms. “It’s just been the hardest time, and we’re just kind of coming up for air. [This house] is a big jump forward for us, and we’re all trying to do our best to heal our family,” she says of the purchase and how it fits into this year’s most talked about celebrity story.\n\nHealth\n\nJolie, who suffers from hypertension, reveals that she had developed Bell’s palsy, a condition that causes one side of the face to droop as a result to damage to the facial nerves. She fully recovered thanks to acupuncture, she tells the mag. Of the scare, she notes, “Sometimes women in families put themselves last … until it manifests itself in their own health.” The 42-year-old also opens up about finding more gray hairs. “I can’t tell if it’s menopause or if it’s just been the year I’ve had,” she says. “I actually feel more of a woman because I feel like I’m being smart about my choices, and I’m putting my family first, and I’m in charge of my life and my health. I think that’s what makes a woman complete.”\n\nFilm\n\nJolie’s next project, which was recently announced to be in the lineup at this fall’s Toronto International Film Festival, is the adaptation of First They Killed My Father, Loung Ung’s 2000 memoir of the Khmer Rouge genocide. Shot in Cambodia and presented in the Khmer language, the film is a Netflix original. Maddox, along with the rest of the brood, had active roles on set.\n\nFamily\n\nJolie has long had a challenged relationship with her father, actor Jon Voight. The two have been estranged for some time, but she has recently welcomed him back into her life. “He’s been very good at understanding they needed their grandfather at this time,” Jolie explains. “I had to do a therapy meeting last night and he was just around. He knows kind of the rule — don’t make them play with you. Just be a cool grandpa who’s creative, and hang out and tell stories and read a book in the library.”\n\nFriends\n\nThe source of inspiration for her new movie, Ung, has also been her “source of comfort,” Peretz writes. “She’s that girlfriend who rolled up her sleeves, got on a plane, and helped me on Christmas morning,” says Jolie, who co-wrote the screenplay with her best pal. “She’s been my closest friend. I cried on her shoulder.”\n\nFuture\n\nApart from promotional duties on the Netflix film, she’s got nothing on her upcoming schedule work-wise. So she’ll stay home and focus on the family. “I’m just wanting to make the proper breakfast and keep the house. That’s my passion. At the request of my kids, I’m taking cooking classes. As I go to sleep at night, I think, ‘Did I do a great job as a mom or was that an average day?’ ” she asks. Still, it seems that living a big life filled with globe-trotting travel and major work commitments isn’t gone for good. “I never woke up and thought, I really want to live a bold life. I just can’t do the other. It’s the same as I can’t make a casserole. I cannot sit still,” she admits. “I’ve been trying for nine months to be really good at just being a homemaker and picking up dog poop and cleaning dishes and reading bedtime stories. And I’m getting better at all three. But now I need to get my boots on and go hang, take a trip.”\n\nTo read the full story, click here.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/07/09_angelina_jolie_lo_no_txt_5_by_mert__marcus-embed.jpg?w=928", "https://www.hollywoodreporter.com/wp-content/uploads/2017/07/2f60df89-67c3-4270-8d3f-2cd00f2aa418.png?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/07/2f60df89-67c3-4270-8d3f-2cd00f2aa418.png?w=1024", "keywords": [], "authors": ["Chris Gardner"], "canonical_link": "https://www.hollywoodreporter.com/news/general-news/angelina-jolie-talks-brad-pitt-bells-palsy-vanity-fair-cover-story-1024589/", "title": "Angelina Jolie Talks Brad Pitt, Bell’s Palsy in ‘Vanity Fair’ Cover Story", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "On her relationship with Pitt, new 'Vanity Fair' cover star Jolie shares: \"We care for each other and care about our family, and we are both working towards the same goal.\"", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Chris Gardner", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1024589, "title": "Angelina Jolie Talks Brad Pitt, Bell's Palsy in 'Vanity Fair' Cover Story", "published_at": "2017-07-26 14:39:58", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/07/2f60df89-67c3-4270-8d3f-2cd00f2aa418.png?w=1024", "comment_count": 0, "topics": "News", "body": "Now, it's Angelina Jolie's turn.\r\nIn May, Brad Pitt opened up to GQ Style in a bombshell of an interview, his first following a widely publicized and relatively nasty split from longtime partner Angelina Jolie. In the story, Pitt talked about the circumstances surrounding the divorce, admitting that he had quit drinking and was working toward becoming a better man. By nearly all accounts, the Michael Paterniti-penned profile was great for Pitt, who had taken a significant hit to his image with tabloid and TMZ reports of an alleged altercation on a private plane between Pitt and their son Maddox. \r\nJolie has kept quiet until now.\r\nToday, Vanity Fair published a cover story featuring the 42-year-old actress, filmmaker, humanitarian and mother of six. For the profile, titled \"Angelina Jolie Solo,\" she sat down with longtime Vanity Fair contributing editor Evgenia Peretz and posed for photographer duo Mert Alas and Marcus Piggott after being styled by Jessica Diehl. Vanity Fair has been something of a go-to for Jolie. She's been featured on multiple covers through the years, all with revelatory and intimate interviews. This new one is no different. Below are a few highlights. \r\nRumors \r\nJolie swatted down talk that the couple's globe-trotting lifestyle got in the way of their marriage. \"[Our lifestyle] was not in any way a negative,\" she says. \"That was not the problem. That is and will remain one of the wonderful opportunities we are able to give our children ... They're six very strong-minded, thoughtful, worldly individuals. I'm very proud of them. ... They've been very brave. They were very brave.\" As for the family unit, Jolie contends that everyone is on the upswing, though she prefers to keep it vague. \"We're all just healing from the events that led to the filing ... They're not healing from divorce. They're healing from some ... from life, from things in life.\"\r\nEmotions\r\n\"I was very worried about my mother, growing up — a lot. I do not want my children to be worried about me. I think it's very important to cry in the shower and not in front of them. They need to know that everything's going to be all right even when you're not sure it is.\" As for her relationship with Pitt and whether they're able to communicate now, she offers: \"We care for each other and care about our family, and we are both working towards the same goal.\" \r\n\r\nHome\r\nShe recently settled into a new home, the 11,000-square-foot estate once owned by Cecil B. DeMille. It was listed for $25 million and features six bedrooms and 10 bathrooms. \"It's just been the hardest time, and we're just kind of coming up for air. [This house] is a big jump forward for us, and we're all trying to do our best to heal our family,\" she says of the purchase and how it fits into this year's most talked about celebrity story. \r\nHealth\r\nJolie, who suffers from hypertension, reveals that she had developed Bell's palsy, a condition that causes one side of the face to droop as a result to damage to the facial nerves. She fully recovered thanks to acupuncture, she tells the mag. Of the scare, she notes, \"Sometimes women in families put themselves last ... until it manifests itself in their own health.\" The 42-year-old also opens up about finding more gray hairs. \"I can't tell if it's menopause or if it's just been the year I've had,\" she says. \"I actually feel more of a woman because I feel like I'm being smart about my choices, and I'm putting my family first, and I'm in charge of my life and my health. I think that's what makes a woman complete.\"\r\nFilm\r\nJolie's next project, which was recently announced to be in the lineup at this fall's Toronto International Film Festival, is the adaptation of First They Killed My Father, Loung Ung’s 2000 memoir of the Khmer Rouge genocide. Shot in Cambodia and presented in the Khmer language, the film is a Netflix original. Maddox, along with the rest of the brood, had active roles on set. \r\nFamily\r\nJolie has long had a challenged relationship with her father, actor Jon Voight. The two have been estranged for some time, but she has recently welcomed him back into her life. \"He's been very good at understanding they needed their grandfather at this time,\" Jolie explains. \"I had to do a therapy meeting last night and he was just around. He knows kind of the rule — don't make them play with you. Just be a cool grandpa who's creative, and hang out and tell stories and read a book in the library.\"\r\n\r\n\tFriends\r\nThe source of inspiration for her new movie, Ung, has also been her \"source of comfort,\" Peretz writes. \"She's that girlfriend who rolled up her sleeves, got on a plane, and helped me on Christmas morning,\" says Jolie, who co-wrote the screenplay with her best pal. \"She's been my closest friend. I cried on her shoulder.\"\r\nFuture\r\nApart from promotional duties on the Netflix film, she's got nothing on her upcoming schedule work-wise. So she'll stay home and focus on the family. \"I'm just wanting to make the proper breakfast and keep the house. That's my passion. At the request of my kids, I'm taking cooking classes. As I go to sleep at night, I think, 'Did I do a great job as a mom or was that an average day?' \" she asks. Still, it seems that living a big life filled with globe-trotting travel and major work commitments isn't gone for good. \"I never woke up and thought, I really want to live a bold life. I just can't do the other. It's the same as I can't make a casserole. I cannot sit still,\" she admits. \"I've been trying for nine months to be really good at just being a homemaker and picking up dog poop and cleaning dishes and reading bedtime stories. And I'm getting better at all three. But now I need to get my boots on and go hang, take a trip.\"\r\nTo read the full story, click here.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Angelina Jolie Talks Brad Pitt, Bell’s Palsy in ‘Vanity Fair’ Cover Story", "url": "https://www.hollywoodreporter.com/news/general-news/angelina-jolie-talks-brad-pitt-bells-palsy-vanity-fair-cover-story-1024589/", "description": "On her relationship with Pitt, new ‘Vanity Fair’ cover star Jolie shares: “We care for each other and care about our family, and we are both working towards the same goal.”", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/07/2f60df89-67c3-4270-8d3f-2cd00f2aa418.png?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2017-07-26T14:39:58+00:00", "modified_time": "2017-07-27T13:09:18+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Angelina Jolie Talks Brad Pitt, Bell’s Palsy in ‘Vanity Fair’ Cover Story", "description": "On her relationship with Pitt, new ‘Vanity Fair’ cover star Jolie shares: “We care for each other and care about our family, and we are both working towards the same goal.”", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/07/2f60df89-67c3-4270-8d3f-2cd00f2aa418.png?w=1280"}}, "movies": [], "publish_date": 1501079998.0, "source": "https://www.hollywoodreporter.com", "summary": ""}