{"url": "https://www.etonline.com/aziz-ansari-lena-waithe-breaks-silence-on-allegations-against-master-of-none-co-star-95686", "text": "Lena Waithe believes education and dialogue is a vital part of the Time's Up initiative.\n\nThe Chi creator, who also stars on Master of None with Aziz Ansari, opened up in an interview on KPCC's The Frame radio show about the recent allegation against her co-star -- with whom she shares an Emmy for Outstanding Writing for a Comedy Series -- and why there needs to be a \"re-education\" of what consent means.\n\n\"Here's the truth — in every situation, it's not always black and white,\" the 33-year-old actress and filmmaker explained. \"And I know that's simple for people, and it's easy for people to [ask], 'Whose side are you on?' There are no sides, really, in some of these scenarios. I'm not on Harvey Weinstein's side, I'm not on Kevin Spacey's side. But I think you have to take each situation [individually]. You can't just say, 'Well, I'm on this person's team, or I'm on that person's team.' It doesn't work that way.\"\n\n\"And I think if we're unwilling to have a dialogue, we're gonna continue to keep hitting our heads against the wall,\" she added. \"We have to start reeducating ourselves about what consent is, what's appropriate behavior at the workplace. We have to create codes of conduct. Those are things that we need.\"\n\n\"'Cause also I think there's an element of — how do you know if you're breaking a rule if you aren't aware of the rules? Or how do you know what appropriate behavior is if no one's ever communicated to you what appropriate behavior is?\" Waithe posited. \"Even though some people may assume, 'Well, of course we all know what appropriate behavior is,' but some people may not know.\"\n\nEducation over just apologizing and moving on, Waithe feels, is key.\n\n\"It's about really educating ourselves and not stepping in it and just [saying], 'Oh, I'm sorry. My bad' — and sort of keep going. But it's about really sitting with yourself and educating yourself in terms of what consent is, what it looks like, what it feels like, what it sounds like. And all of us starting to really act accordingly based on this new information that I think we have now,\" she explained. \"We all gotta start talking to each other, start educating each other.\"\n\nGet more of her interview here.\n\nThe allegation against Ansari was published on Babe.net, where a 23-year-old photographer, who chose to remain anonymous, claimed that she and the 34-year-old actor went on a date in New York City in 2017, after which, she claimed they went to his apartment where they engaged in sexual activity, which she says left her feeling \"violated.\"\n\n\"In September of last year, I met a woman at a party. We exchanged numbers. We texted back and forth and eventually went on a date. We went out to dinner, and afterwards we ended up engaging in sexual activity, which by all indications was completely consensual,\" Ansari said in a statement after the story came out.\n\n\"The next day, I got a text from her saying that although 'it may have seemed okay,' upon further reflection, she felt uncomfortable,\" he continued. \"It was true that everything did seem okay to me, so when I heard that it was not the case for her, I was surprised and concerned. I took her words to heart and responded privately after taking the time to process what she had said.\"\n\n\n\n\"I continue to support the movement that is happening in our culture. It is necessary and long overdue,\" he concluded, seemingly referencing the #MeToo movement as well as #TimesUp, which he supported at the Golden Globes, wearing both all black and the pin.\n\nRELATED CONTENT:\n\nLena Waithe and Common Give a Glimpse at Chicago's South Side in New 'The Chi' Trailer -- Watch\n\nAmy Schumer Talks 'Friend' Aziz Ansari Inappropriate Sexual Behavior Allegation\n\nAziz Ansari Responds to Accusation of Inappropriate Sexual Behavior: 'I Was Surprised and Concerned'\n\nEXCLUSIVE: Aziz Ansari and Alan Yang Gush Over 'Surreal' Emmy Win This video is unavailable because we were unable to load a message from our sponsors.\n\n\n\nIf you are using ad-blocking software, please disable it and reload the page.\n\nRelated Gallery", "images": ["https://www.etonline.com/sites/default/files/styles/840x470/public/images/2017-08/emmy_first_timers_comp2.jpg?h=83deea5f&itok=nUtmjiY2", "https://www.etonline.com/sites/default/files/styles/max_970x546/public/images/2018-02/aziz_ansari_lena_waithe_gettyimages-848704246.jpg?h=83e85ec9&itok=zS69OlJs", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2022-10/Kaye_GettyImages-1429667472_300.jpg?h=6c83441f&itok=79-eWDg7", "https://www.etonline.com/sites/default/files/styles/60x60/public/images/2022-10/Screen%20Shot%202022-10-08%20at%202.01.34%20PM.png?h=597e033f&itok=1KV1Fu0Z", "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-02/aziz_ansari_lena_waithe_gettyimages-848704246.jpg?h=83e85ec9&itok=dAG0BnsJ"], "top_img": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-02/aziz_ansari_lena_waithe_gettyimages-848704246.jpg?h=83e85ec9&itok=dAG0BnsJ", "keywords": [], "authors": ["Alex Ungerman"], "canonical_link": "https://www.etonline.com/aziz-ansari-lena-waithe-breaks-silence-on-allegations-against-master-of-none-co-star-95686", "title": "Aziz Ansari: Lena Waithe Breaks Silence on Allegations Against 'Master of None' Co-Star", "meta_data": {"article": {"opinion": "false"}, "apple-mobile-web-app-capable": "yes", "robots": "index", "description": "'The Chi' creator, who won an Emmy with Ansari, opened up to 89.3 KPCC's The Frame about consent, Time's Up and choosing sides.", "keywords": "News, TV, Lena Waithe, Aziz Ansari", "fb": {"admins": 3111204, "pages": 106843036179, "app_id": 145337045558621}, "og": {"site_name": "Entertainment Tonight", "type": "Article", "url": "https://www.etonline.com/aziz-ansari-lena-waithe-breaks-silence-on-allegations-against-master-of-none-co-star-95686", "title": "Aziz Ansari: Lena Waithe Breaks Silence on Allegations Against 'Master of None' Co-Star", "description": "'The Chi' creator, who won an Emmy with Ansari, opened up to 89.3 KPCC's The Frame about consent, Time's Up and choosing sides.", "image": {"identifier": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-02/aziz_ansari_lena_waithe_gettyimages-848704246.jpg?h=83e85ec9&itok=dAG0BnsJ", "width": 1280, "height": 720}}, "msvalidate.01": "DC10472F438B55F3A58638BC31271706", "google-site-verification": "hKpIt34FKZ_qMU81xUdLUw2YzuyZY1pS76p0622Hc7w", "twitter": {"card": "summary_large_image", "description": "'The Chi' creator, who won an Emmy with Ansari, opened up to 89.3 KPCC's The Frame about consent, Time's Up and choosing sides.", "site": {"identifier": "@etnow", "id": 23603092}, "title": "Aziz Ansari: Lena Waithe Breaks Silence on Allegations Against 'Master of None' Co-Star", "creator": "Alex Ungerman‍", "url": "https://www.etonline.com/aziz-ansari-lena-waithe-breaks-silence-on-allegations-against-master-of-none-co-star-95686", "image": "https://www.etonline.com/sites/default/files/styles/max_1280x720/public/images/2018-02/aziz_ansari_lena_waithe_gettyimages-848704246.jpg?h=83e85ec9&itok=dAG0BnsJ"}, "Generator": "Drupal 8 (https://www.drupal.org)", "MobileOptimized": "width", "HandheldFriendly": "true", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0"}, "movies": [], "publish_date": null, "source": "https://www.etonline.com", "summary": ""}