{"url": "https://www.usatoday.com/story/life/people/2018/07/20/kathy-griffin-trump-laugh-your-head-off-world-tour/805633002/", "text": "Kathy Griffin spills all the Trump tea (and more) on her world tour\n\nShow Caption Hide Caption Kathy Griffin is ready to make you laugh again Kathy Griffin is ready to laugh about the time a photo got her in hot water with the feds and the president. This summer she plans to tour North America, including a sold-out gig at Carnegie Hall in New York. (April 2) AP\n\nHOLLYWOOD – Kathy Griffin is back on U.S. soil, and she’s got a lot of material to get off her chest.\n\nThe comedian brought her Laugh Your Head Off World Tour to Hollywood Thursday night, serving up almost three hours of comedy in a high-octane set. In front of a packed house, Griffin gleefully spilled the tea on everything from the federal investigation surrounding her controversial fake and bloody Donald Trump photo shoot that went round the world to how she really feels about Ellen DeGeneres. (Spoiler: They are not friends).\n\nAt the sold-out Dolby Theater, Griffin, gearing up for the long haul in a pair of flats, ran out on stage jumping and dancing. “They said I would never work again, and you came!” she said to the packed crowd. Here's what to expect from Griffin’s latest act:\n\nKathy Griffin: 'Truth is, Roseanne has displayed herself to be a Nazi’\n\nMore: Kathy Griffin on tour, that 'harmless' bloody Trump photo, her gripe with Kevin Hart\n\nThere’s plenty of President Trump – and his family\n\n“I’ve known this fool off and on for 20 years,” said Griffin, harking back to the time she first met Trump on the set of \"Suddenly Susan.\" \"He said, 'Call me The Donald,' to which I said, 'OK – call me The Kathy.' And then I walked away.\" Griffin went on to give less-than-flattering nicknames for Trump's adult children and doubled down on the president's purported ties with Russia. \"You know that pee-pee tape exists!\" she exclaimed.\n\nA feud with Ellen DeGeneres\n\nGriffin described how she got into a fight with DeGeneres after her mentor and friend Joan Rivers died. “One of the things that always hurt (Rivers) is that Ellen shunned her and thought she was vulgar and not funny,” Griffin said. “After Joan died I just called (DeGeneres) and I said, ‘Woman to woman, comic to comic, let it go and do a tribute to her ...' We got into a screaming match,\" said Griffin, adding: \"She’s scarier than the government.”\n\nKim and Kanye are actually good neighbors\n\nOnly in Hollywood would it turn out that Griffin and Kim Kardashian West and Kanye West were honest-to-goodness neighbors. “We actually had a shared wall,” said Griffin, revealing she has changed her stance on the reality show family. She even once called Kim to ask if her kids could come over to cheer up her 98-year-old mother, Maggie. (They came!) “I am pro-Kardashian,\" Griffin said. \"They let me make fun of them to their face, which is all I ask.”\n\nNo one is spared\n\nGriffin let loose on a Rolodex of frenemies. Targets included her former publicist Cindi Berger (“I can’t get a publicist at all, so I can burn the bridge”), former New Year's Eve BFF Anderson Cooper (whom she referred to as \"Anderson Vanderbilt\"), former Bravo boss Andy Cohen, Jeff Zucker (“He’s not smart enough to run CNN. He’s the guy who gave Emeril a sitcom!”), her short-lived attorney Lisa Bloom, Matt Lauer and Megyn Kelly.\n\nHer darkest moments\n\nGriffin said she spiraled after her Trump photo shoot brouhaha. Within days, her career imploded: Griffin’s stand-up shows were canceled, CNN fired her, and advertisers fled. Griffin recalled even getting dumped by Squatty Potty: \"That one hurt,” she deadpanned.\n\nBut for two months, \"I almost didn't leave my house at all,\" she said. Griffin closed by describing her FBI interrogation (an experience that wove together a sword, a porn awards show and Martha Stewart). She also championed First Amendment rights, imploring the audience to continue supporting comics who dare to take on the administration. “Over my dead body will I let this happen to another woman again,” she pronounced.\n\nMore: Kathy Griffin defends Samantha Bee with long Twitter account of her own tangle with Trump\n\nMore: Kathy Griffin impersonates 'incredible liar' Kellyanne Conway on 'The President Show'", "images": ["https://www.gannett-cdn.com/-mm-/13e91021ee7e2fe7c62a54fe4ec9f15d9f63fecc/c=0-0-2996-1693/local/-/media/2018/07/20/USATODAY/USATODAY/636676593597447981-GTY-1002287150-101599405.JPG?auto=webp&format=pjpg&width=1200", "https://media.gannett-cdn.com/29906170001/29906170001_5761963016001_5761955525001-vs.jpg?pubId=29906170001", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/13e91021ee7e2fe7c62a54fe4ec9f15d9f63fecc/c=0-0-2996-1693/local/-/media/2018/07/20/USATODAY/USATODAY/636676593597447981-GTY-1002287150-101599405.JPG?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Andrea Mandell"], "canonical_link": "https://www.usatoday.com/story/life/people/2018/07/20/kathy-griffin-trump-laugh-your-head-off-world-tour/805633002/", "title": "Kathy Griffin spills all the Trump tea (and more) on her world tour", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/people/2018/07/20/kathy-griffin-trump-laugh-your-head-off-world-tour/805633002/life/people", "theme-color": "#ffffff", "og": {"type": "article", "title": "Kathy Griffin spills all the Trump tea (and more) on her world tour", "description": "Delivering a high-octane three-hour set, Kathy Griffin brought her Laugh Your Head Off World Tour to Hollywood on Thursday, and no one was spared — not even frenemy Ellen DeGeneres or neighbor Kim Kardashian West.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/13e91021ee7e2fe7c62a54fe4ec9f15d9f63fecc/c=0-0-2996-1693/local/-/media/2018/07/20/USATODAY/USATODAY/636676593597447981-GTY-1002287150-101599405.JPG?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "Delivering a high-octane three-hour set, Kathy Griffin brought her Laugh Your Head Off World Tour to Hollywood on Thursday, and no one was spared — not even frenemy Ellen DeGeneres or neighbor Kim Kardashian West.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1532041200.0, "source": "https://www.usatoday.com", "summary": ""}