{"url": "https://www.metacritic.com/feature/tv-premiere-dates?page=1", "text": "Past dates are listed below in reverse chronological order.\n\n< Current/Future Premieres\n\nTHU / June 30\n\nBastard!! - Heavy Metal, Dark Fantasy - Anime\n\nThe Bridge Trailer Reality competition HBO Max\n\nThe Fallen Trailer Drama ALLBLK\n\nFright Club Trailer Reality Travel, 10p\n\nMadagascar: A Little Wild Animation/Family\n\nMe or the Menu Reality Food, 10p\n\nNaked Mole Rat Gets Dressed:\n\nThe Underground Rock Experience Animation/Family HBO Max\n\nSharkdog Animation/Family\n\nStrange Evidence Reality Science, 9p\n\nTallboyz Comedy Fuse, 10p\n\nWED / June 29\n\nAll Star Shore Trailer Reality competition Paramount+\n\nThe first of at least five animated Disney+ shows to come from Walt Disney Animation Studios over the next few years is based on the 2014 feature film Big Hero 6. (Yes, that technically makes it a Marvel series as well.) Scott Adsit once again voices the title character, while other voice talent includes Maya Rudolph, Ryan Potter, Jaboukie Young-White, and Emily Kuroda.\n\n▣ Beauty Trailer Drama\n\nExtraordinary Attorney Woo Trailer Foreign/Drama\n\nMore Power Trailer Reality History, 10p\n\nPirate Gold of Adak Island Trailer Reality\n\nThis Kevin Hart-produced, two-part look at Black comedians from the 1970s to the present day concludes tomorrow night at the same time.\n\nSex Sells Reality Fuse, 11p\n\nTUE / June 28\n\nCristela Alonzo: Middle Classy Trailer Comedy special\n\n▣ Endangered Trailer Documentary 9p\n\nGreen Ghost and the Masters of the Stone Trailer Action-adventure/Comedy ($) Rent/Buy\n\nLove You Anyway Trailer Drama ($) Rent/Buy\n\nOne of the best new shows of 2021 returns with a quick follow-up season that will see Amy Schumer (playing a version of herself as she sublets Sting's apartment), Shirley MacLaine, Cara Delevingne, Andrea Martin, and Michael Rapaport appear alongside returning stars Steve Martin, Martin Short, and Selena Gomez (and returning guests like Nathan Lane and Tina Fey).\n\nThe Passenger Trailer Horror ($) Rent/Buy\n\nTeen Mom: Young and Pregnant Reality MTV, 9p\n\nWe Burn Like This Trailer Drama ($) Rent/Buy\n\nMON / June 27\n\nCafe Minamdang Trailer Foreign/Drama/Comedy\n\nChip and Potato: Chip's Holiday Animation/Family\n\nCollege Hill: Celebrity Edition Trailer Reality BET+\n\nHiding in Plain Sight: Youth Mental Illness Documentary 9p\n\n▣ The Split Trailer Drama BBC America, 11p\n\nEpisodes also stream on AMC+ and Sundance Now beginning June 23rd.\n\nSUN / June 26\n\n2022 NYC Pride March Live event Hulu, noon ET\n\nBET Awards 2022 Live event BET, 8p\n\nThe Chi Trailer Drama 9p\n\nEach season 5 episode will also be available to stream two days early on Fridays (beginning June 24).\n\nDisney's Summer Magic Quest Reality competition Disney, 7p\n\nIce Road Killer Drama Lifetime, 8p\n\nJack Osbourne's Night of Terror: Bigfoot Reality discovery+\n\nMotley Crüe's Vince Neil: My Story Reality/Music Reelz, 8p ET\n\nPlanning on Forever Drama UP, 7p\n\nSkid Row: Breaking the Band Reality/Music Reelz, 10p ET\n\n▣ Westworld Trailer Drama/Sci-fi 9p\n\nAriana DeBose (a recent Oscar winner for West Side Story) joins the cast for season 4, which will run for just eight episodes. Original cast member James Marsden also returns for the new season.\n\nWho Is Ghislaine Maxwell? Trailer Documentary Starz, 9p\n\nSAT / June 25\n\nHe's Not Worth Dying For Drama Lifetime, 8p\n\nNickelodeon Slime Cup Trailer Reality competition Nickelodeon, 8p\n\nTwo Tickets to Paradise Drama Hallmark, 8p\n\nFRI / June 24\n\n49th Daytime Emmy Awards Live event 9p\n\n▣ Abandoned Trailer Horror ($) Rent\n\nAmerican Anthems Reality 10p\n\nAngry Birds: Summer Madness Animation/Family\n\nAt Home With the Gils Foreign/Reality Prime Video\n\n▣ Bitterbrush Trailer Documentary ($) Rent/Buy\n\nBoundless (Sin Limites) Foreign/Drama Prime Video\n\n▣ Chloe Trailer Drama Prime Video\n\nA co-production with the BBC, this six-episode psychological thriller from writer/producer/director Alice Seabright (Sex Education) stars Erin Doherty (The Crown's Princess Anne) as Becky, a young woman who lives with her mom and works a series of temp jobs. She's also obsessed with the Instagram account of the titular Chloe (Poppy Gilbert) and her seemingly perfect life. When the latter suddenly (and mysteriously) dies, Becky seeks answers, and her investigation finds her adopting a new persona and attempting to infiltrate Chloe's group of real-life friends. Reviews were excellent when the series premiered in the UK early this year.\n\nCorner Gas Animated Trailer Animation/Comedy Freevee\n\nDawn Breaks Behind the Eyes Trailer Thriller ($) Rent/Buy\n\nArriving in theaters and on VOD today following solid reviews at its Berlinale premiere earlier this year, the darkly comedic new film from always intriguing writer-director Peter Strickland (In Fabric, The Duke of Burgundy) is set at an institute devoted to culinary sound performance, where members of a collective (Fatma Mohamed, Asa Butterfield, Ariane Labed) find themselves embroiled in artistic and sexual affairs with each other and the institute’s director (Gwendoline Christie).\n\n▣ The Great American Recipe Reality 9p\n\nHello, Jack! The Kindness Show Family Apple TV+\n\n▣ Loot Trailer Comedy Apple TV+\n\nA new workplace comedy from the Emmy-winning pair of Alan Yang (Master of None) and Matt Hubbard (30 Rock), Loot stars Maya Rudolph, who also worked with the two creators on their previous collaboration, the 2018 Amazon series Forever. Here, she plays Molly Novak, a woman who is left with nothing after her husband (Adam Scott) betrays her—except for billions of dollars. After a downward spiral, she begins to take an active role in a charity foundation that was being run in her name. Mj Rodriguez, Ron Funches, and Joel Kim Booster also star. Three episodes stream today, with the remaining seven arriving one per week.\n\nKevin Hart and Woody Harrelson star in a mistaken identity action-comedy from Sony that was originally expected to open in theaters this summer (before it was acquired by Netflix).\n\nThis Korean remake of Netflix's Spanish hit Money Heist (aka La casa de papel) is set in world where North and South Korea are on the verge of reunification. Six episodes stream today, and will be followed by the second half of the debut season later this year.\n\nThe One That Got Away Trailer Reality Prime Video\n\nThis streaming exclusive traces the real-life emigration tale of the Antetokounmpo family, whose story takes them from Nigeria to Greece, and then—for brothers Giannis, Thanasis, and Kostas—to America and the NBA.\n\nTow Trailer Drama/Thriller Tubi\n\nTrapped With My Husband Reality LMN, 8p\n\nFilmed version of the Off-Broadway stage production that was itself inspired by the 1995 Oscar-winning short film \"Trevor.\"\n\nThis sketch comedy special (it's just one episode, for now) comes from longtime collaborators John Early and Kate Berlant. While the hour will find the duo playing multiple characters, the running storyline casts them as the stars of the hit sitcom He's Gay, She's Half-Jewish—until they have a major falling out and highly publicized legal battle.\n\nTHU / June 23\n\n2022 NBA Draft Sports/Live event 8p ET\n\nAustin Dillon's Life in the Fast Lane Trailer Reality/Sports USA, 9:30p\n\nThis FX-produced (but Hulu-exclusive) comedy series finds Jeremy Allen White (Shameless) playing a fine dining chef who returns home to Chicago to run his family's sandwich shop (\"The Original Beef of Chicagoland\") following the sudden death of his brother. The series comes from writer-director-producer Christopher Storer (Ramy, Dickinson) and also counts Atlanta's Hiro Murai and BoJack Horseman's Joanna Calo among its producers. All eight episodes stream today.\n\nMike Judge's beloved MTV series (ask your parents) will get a full Paramount+ series revival later this year. But first comes a brief taste in the form of the titular pair's second feature film and first since 1996's Beavis and Butt-Head Do America. Do they go to space, travel through time (from 1998 to 2022) and encounter a superior version of themselves from a parallel universe? Yes to all three. Joining Judge in the voice cast are Tig Notaro, Stephen Root, Nat Faxon, Gary Cole, Andrea Savage, Brian Huskey, and several alumni of Judge's HBO series Silicon Valley, including Martin Starr, Chris Diamantopoulos, and Jimmy O. Yang.\n\nBid for Love Drama BET+\n\nBuckhead Shore Trailer Reality MTV, 9p\n\nChrisley Knows Best Reality USA, 9p\n\nFirst Class Trailer Foreign/Reality\n\nGordita Chronicles Trailer Comedy/Family HBO Max\n\nProduced by Zoe Saldana and Eva Longoria (the latter also directs the opener), this 1980s-set, coming-of-age comedy senters on a 12-year-old Dominican girl living in Miami. All 10 episodes stream today.\n\nJersey Shore Family Vacation Trailer Reality MTV, 8p\n\nLittle Ellen Animation/Family HBO Max\n\nAll four parts stream today, and will be replaced by younger versions of the same episodes in a few years.\n\nNo Demo Reno Reality HGTV, 9p\n\nQueen Foreign/Drama\n\nThe Real Housewives Ultimate Girls Trip: Ex-Wives Club Trailer Reality Peacock\n\n▣ Revealer Trailer Horror Shudder\n\nSouthern Charm Reality Bravo, 9p\n\n▣ The Split Trailer Drama Sundance Now\n\nTerror Lake Drive: Single Black Female Trailer Drama/Anthology ALLBLK\n\nWED / June 22\n\nBruna Louise: Demolition Comedy special\n\nThis nonfiction follow-up to HBO's 2019 miniseries reexamines the 1986 disaster through newly uncovered archival footage (filmed during and shortly after the meltdown), Soviet TV footage, and interviews with nuclear plant employees and first responders.\n\nEureka! Trailer Animation/Family Disney Jr., 7:30p\n\nThe Hidden Lives of Pets Reality\n\nLove & Gelato Trailer Foreign/Drama\n\nPlanet California Documentary/Nature 10p\n\nSnowflake Mountain Trailer Reality competition\n\n▣ We Documentary MUBI\n\nWellington Paranormal Comedy 9p\n\nWhat on Earth Reality Science, 9p\n\nTUE / June 21\n\n37 Words Trailer Documentary ESPN, 8p ET\n\nThis four-part documentary examines the impact of Title IX on equality in collegiate sports. Parts 1 and 2 air tonight, followed by the concluding chapters on June 28. The documentary will also be available to stream on Hulu and Disney+.\n\nCelebrity Game Face Game show E!, 10p\n\nCyst Trailer Horror/Sci-fi/Comedy ($) Rent/Buy\n\nExclusively Elvis Special 10p\n\nThe Future of ... Trailer Documentary\n\nProduced by website The Verge, this look at how new technology will impact various aspects of daily life in the near future will stream in two batches, with six episodes today and another six next Tuesday.\n\nGranada Nights Trailer Rom-com/Drama ($) Rent/Buy\n\nThe Golden Lion winner at last year's Venice Film Festival comes to On Demand services today after a theatrical run.\n\nHarmonious Live! Music/Live event Disney+, 9p ET\n\nHip Hop My House Trailer Reality Paramount+\n\nThe House in Between Part 2 Trailer Documentary/Horror ($) Rent/Buy\n\nLove Island UK Reality\n\nMarlene Trailer Drama ($) Rent/Buy\n\nMotherland: Fort Salem Drama Freeform, 10p\n\nThe Story Won't Die Documentary ($) Rent/Buy\n\nTriple Threat Drama/Musical ($) Rent/Buy\n\nWild 'N Out Comedy VH1, 8p\n\nMON / June 20\n\nDoom of Love Foreign/Drama\n\nThe Holiday Trailer Drama Spectrum\n\nJill Halfpenny and Owen McDonnell head the cast of this four-part adaptation of T.M. Logan's novel.\n\n▣ Mind Over Murder Documentary 10p\n\nNanfu Wang (In the Same Breath) directs a six-part true-crime series about the \"Beatrice Six,\" a group of six individuals who were convicted of a 1985 murder of a Nebraska grandmother after five of them confessed to the killing. The problem: They were innocent, and were exonerated (after serving a combined 70 years in prison) when new DNA evidence surfaced in 2009. Episodes air weekly on Mondays (and stream on HBO Max).\n\nSUN / June 19\n\n30th Annual Trumpet Awards Special Bounce, 7p\n\nAlic Cooper: Story of the Songs Reality/Music Reelz, 10p ET\n\nAnimal Kingdom Trailer Drama TNT, 9p\n\nBeachside Brawl Reality competition Food, 10p\n\nBirdgirl Trailer Animation/Comedy Adult Swim, midnight\n\nThe Black Pack: Excellence Variety 8p\n\nBrandon Leake: A Family Affair Variety 9p\n\n▣ Civil Trailer Documentary\n\nEndeavour Trailer Drama 9p\n\nEstonia Reality discovery+\n\n▣ Flatbush Misdemeanors Trailer Comedy 11p\n\nTonight's season 2 debut also streams two days early (on Friday 6/17) on Showtime apps and VOD.\n\nForeigner: Breaking the Band Reality/Music Reelz, 8p ET\n\n▣ Hotel Portofino Drama 8p\n\nNatascha McElhone heads the cast of a six-episode period drama about an elite British family that opens a swanky hotel on the Italian Riviera during the 1920s.\n\nI Love a Mama's Boy Reality TLC, 10p\n\nJuneteenth: A Global Celebration of Freedom Music/Live event CNN, 8p ET\n\nMathis Family Matters Trailer Reality E!, 10p\n\nMurdaugh Murders: Deadly Dynasty Reality discovery+\n\nA Romance Wedding Drama UP, 7p\n\nScorpions: Breaking the Band Reality/Music Reelz, 9p ET\n\nTaken Again Drama Lifetime, 8p\n\nYoung Dylan Comedy Nickelodeon, 7p\n\nSAT / June 18\n\nAfter Jackie Documentary/Sports History, 8p\n\nAlchemy of Souls Foreign/Drama\n\nMoriah's Lighthouse Drama Hallmark, 8p\n\nSpriggan Trailer Anime\n\nSuitcase Killer: The Melanie McGuire Story Drama Lifetime, 8p\n\nFRI / June 17\n\nThe Book Keepers Trailer Documentary ($) Virtual cinema\n\nThe Audience Award winner at this year's Sundance—the second straight winner of that award to be acquired by Apple, following last year's CODA—is writer-director-actor Cooper Raif’s crowd-pleasing follow-up to 2020’s Shithouse. Here, he plays a recent college graduate whose job as a bar mitzvah hype man leads to a friendship with a mother (Dakota Johnson) and her autistic, teenage daughter (Vanessa Burghardt).\n\nChrissy's Court Reality The Roku Channel\n\n▣ Cocoon Trailer Drama ($) Rent/Buy\n\nGold Rush: Parker's Trail Reality Discovery, 8p\n\nFox Searchlight spent $7.5 million at Sundance early this year to acquire this small-scale drama from director Sophie Hyde (52 Tuesdays, Animals), which unfolds mostly as a conversation between two people in a single room. One reason for the interest: Excellent reviews, especially for the possibly career-best performances of its two leads, Emma Thompson and Daryl McCormack, and a strong script by Katy Brand. Thompson plays a retired schoolteacher and widow who books a hotel room and hires a sex worker (McCormack) in the hope of finally having the spectacular sexual experience she has always desired but never had.\n\nGuidance Foreign/Sci-fi ($) Rent/Buy\n\nHome Trailer Reality Apple TV+\n\nBryan Cranston and Annette Bening play a retired couple who exploit a loophole in the Massachusetts state lottery to win millions of dollars—which they then use to help revive their small hometown—in this based-on-a-true-story feature directed by David Frankel (The Devil Wears Prada). Larry Wilmore, Rainn Wilson, Anna Camp, and Michael McKean also star.\n\n▣ The Lake Trailer Comedy Prime Video\n\nLove Triangle Nightmare Drama LMN, 8p\n\nMagnolia Table With Joanna Gaines Reality discovery+ (Magnolia)\n\nThe Martha Mitchell Effect Documentary\n\nPaul Pogba: The Pogmentary Trailer Documentary Prime Video\n\nThe Sessions: Draymond Green Trailer Reality Prime Video\n\nShe Foreign/Drama\n\nSound of Freedom - A Juneteenth Celebration Music/Talk 8p\n\nAdapted from the George Saunders story \"Escape From Spiderhead,\" this near-future prison drama stars Chris Hemsworth, Miles Teller, and Jurnee Smollett.\n\nAuthor Jenny Han (To All the Boys I've Loved Before) adapts her own YA book trilogy into an Amazon series.\n\nThe War Next-door Foreign/Comedy\n\nWatergate: High Crimes in the White House News 9p\n\nWhere We Call Home Reality discovery+ (Magnolia)\n\nYou Don't Know Me Trailer Drama\n\nTHU / June 16\n\nBlock Party Comedy BET+\n\nDead End: Paranormal Park Trailer Animation/Family\n\nThe latest remake of the classic rom-com (originally a novel that was adapted multiple times for film and TV, including commercially successful feature films in 1950 and 1991) follows a Cuban-American family. Andy Garcia and Gloria Estefan head the cast for director Gaz Alazraki.\n\nImpractical Jokers Comedy/Reality truTV, 10p\n\nKarma's World Music Videos Animation/Family\n\nLove & Anarchy Trailer Foreign/Comedy/Drama\n\nOscar-winning special effects legend Phil Tippett (who has worked on major franchises like Star Wars and Jurassic Park) spent three decades making his directorial debut, an experimental multi-media hellscape of \"monsters, mad scientists, and war pigs.\" It screens to the public today as a Shudder exclusive after successful festival showings last year.\n\nMartin: The Reunion Trailer Special BET+\n\nA seven-episode adaptation of Thomas Perry's novel of the same name, The Old Man finds Jeff Bridges returning to a regular TV role for the first time since the early 1960s. He plays Dan Chase, a former CIA agent (played in flashbacks by Bill Heck) who is now living off the grid. But when he is the target of a failed assassination attempt, he finds that he can no longer escape his past. Another old man, John Lithgow, also stars, as do Alia Shawkat, Gbenga Akinnagbe, Amy Brenneman, and E.J. Bonilla. The adaptation comes from Black Sails creators Jonathan E. Steinberg and Robert Levine, while the opener is directed by Jon Watts (Spider-Man: No Way Home). Two episodes air back-to-back tonight (and stream tomorrow on Hulu).\n\n▣ Players Trailer Comedy Paramount+\n\nThe latest mockumentary series from the team behind American Vandal (including creators Tony Yacenda and Dan Perrault) is set in the world of esports and follows a (fictional) League of Legends team led by the cranky veteran Creamcheese, who clashes with the team's newest recruit, 17-year-old Organizm, as the team strives to finally win its first championship after several near misses. Three episodes stream today followed by single-episode drops over the next seven weeks.\n\n▣ Rutherford Falls Trailer Comedy Peacock\n\nSnoop Dogg's F*cn Around Comedy Special Comedy special\n\nWED / June 15\n\n30 for 30: Dream On Documentary/Sports ESPN, 8p ET\n\nThe 1996 USA Women's Olympic basketball team gets the focus in ESPN's latest 30 for 30 documentary.\n\nCentauro Foreign/Action-adventure\n\nCheech Marin's Chicano Art Tour Documentary Ovation, 11p ET\n\nCMT Crossroads: Black Pumas & Mickey Guyton Music CMT, 10p\n\nDear Pony: Keep This Between Us Documentary Freeform, 10p\n\nFamily Reboot Trailer Reality Disney+\n\nFollowing in the footsteps of Joan of Arcadia and Miracle Workers, the latest series from the duo of Melissa McCarthy and Ben Falcone is a workplace sitcom centering on a mid-level tech-support employee (Falcone) who suddenly finds himself an unwitting messenger of God and charged with assembling his co-workers in an attempt to save mankind. McCarthy also stars as his co-worker and love interest, while Kevin Dunn plays his father and Leslie Bibb plays Satan.\n\nHeart Parade Foreign/Rom-com\n\nThe latest American revival of the cult classic Japanese cooking competition series returns host Alton Brown and actor Mark Dacascos as the \"Chairman\" from Food Network's previous reboot, Iron Chef America. The new roster of Iron Chefs includes Curtis Stone, Dominique Crenn, Marcus Samuelsson, Ming Tsai, and Gabriela Cámara, while challengers include familiar faces from Bravo's Top Chef.\n\nAll eight episodes of the show's third and final season stream today on both Hulu and Disney+.\n\nMaldivas Trailer Foreign/Drama/Comedy\n\nSins of the Father: The Green River Killer Trailer Reality Tubi\n\nWeb of Make Believe: Death, Lies and the Internet Trailer Reality\n\nThe Wrath of God (La Ira de Dios) Foreign/Thriller\n\nTUE / June 14\n\nDark Side of the 90s Trailer Reality Vice, 9p\n\nDateline: The Last Day Trailer Reality Peacock\n\nAmanda Micheli's documentary profiles Jennifer Lopez and, in particular, her preparations for her recent Super Bowl halftime show performance.\n\nJane & Lily: Ladies Night Live Comedy special\n\nMON / June 13\n\nCharlie's Colorforms City Animation/Family\n\nDigital Addiction Trailer Reality A&E, 10p\n\nFear Thy Neighbor Reality ID, 10p\n\nThe Great Giveback with Melissa McCarthy and Jenna Perusich Reality HGTV, 9p\n\nIntervention Reality A&E, 9p\n\nMaking Modern With Brooke and Brice Reality discovery+ (Magnolia)\n\nPete Davidson Presents: The Best Friends Comedy special\n\nSUN / June 12\n\n75th Annual Tony Awards Live event 8p ET / 5p PT\n\nAiring live nationwide for the first time, this year's ceremony will also stream live on Paramount+ (where coverage begins one hour earlier). Ariana DeBose hosts.\n\n2022 Los Angeles Pride Parade Live event Hulu, 11a PT\n\nAmerica’s Lost Airship: Weapon of War Documentary Smithsonian, 9p\n\n▣ Becoming Elizabeth Trailer Drama Starz, 9p\n\nStarz's new costume drama is set in the politically turbulent period following the death of England's King Henry VIII and stars Alicia von Rittberg as the young woman who would become Queen Elizabeth I. The eight-episode series comes from playwright Anya Reiss and also stars Romola Garai as Princess Mary.\n\nThe Booze, Bets and Sex That Built America Trailer Documentary History, 8p\n\nColor My World With Love Drama HMM, 9p\n\n▣ Dark Winds Trailer Drama 9p\n\nZahn McClarnon and Kiowa Gordon star in a series adaptation of Tony Hillerman's Leaphorn & Chee book series, set in the Navajo Nation in 1971. Two episodes debut tonight both on cable's AMC and on the AMC+ streaming service.\n\nThe Engagement Backup Drama UP, 7p\n\n▣ Evil Trailer Drama Paramount+\n\nGuns N' Roses: Story of Their Songs Reality/Music Reelz, 8p ET\n\nI Won't Let You Go Drama Lifetime, 8p\n\nSilos Baking Competition Trailer Reality competition Magnolia, 8p\n\nSpotlights: A Showtime Short Film Series Trailer Anthology 7:30p\n\nTime 100: The World's Most Influential People Special 8p\n\nSAT / June 11\n\nAmy Schumer's Parental Advisory Comedy special\n\nCaribbean Summer Drama Hallmark, 8p\n\nDirty Little Secret Drama Lifetime, 8p\n\nFirst Blood Reality A&E, 9p\n\nPanic 9-1-1 Reality A&E, 10p\n\nFRI / June 10\n\n90 Day Fiance: Love in Paradise Reality discovery+\n\nBunk'd Comedy Disney, 7:30p\n\nBeyond Infinity: Buzz and the Journey to Lightyear Trailer Documentary Disney+\n\nChickenhare and the Hamster of Darkness Animation/Family\n\nDirty Daddy: The Bob Saget Tribute Trailer Comedy special\n\nFairfax Trailer Animation/Comedy Prime Video\n\nEdi Gathegi (The Blacklist) joins the cast for season 3, which jumps forward in time to the early 1990s and follows the race to mount the first manned mission to Mars. One episode streams each Friday.\n\nHappily Never After Drama LMN, 8p\n\nHollywood Houselift With Jeff Lewis Reality Freevee\n\nIntimacy Foreign/Drama\n\nLove in Paradise: The Caribbean Reality discovery+\n\nLovely Little Farm Trailer Family Apple TV+\n\nPeace by Chocolate Comedy/Drama ($) Rent/Buy\n\n▣ Peaky Blinders Drama\n\nJohnny Flynn, Naomi Ackie, and Will Poulter star in a musical crime drama that features original songs written by Flynn. You can also find it in theaters beginning June 3rd.\n\n▣ Small Town Wisconsin Drama/Comedy ($) Rent\n\n▣ Trees of Peace Drama\n\nTHU / June 9\n\n2022 MTV Movie & TV Awards: Unscripted Special MTV, tbd\n\nAmerican Gangster: Trap Queens Reality BET+\n\nAmsterdam Foreign/Comedy HBO Max\n\nB-Boy Blues Drama BET+\n\nBrat Loves Judy Trailer Reality WE, 9p\n\nDr. Delirium & The Edgewood Experiments Documentary discovery+\n\nMTV Unplugged: Twenty One Pilots Music MTV, 9p\n\nMy Daughter Joined a Cult Reality discovery+\n\nA remake reimagining of the groundbreaking 1999 British LGBTQ drama series of the same name, Peacock's new series comes from writer-director Stephen Dunn (whose credits include Little America) and also counts original series creator Russell T. Davies among its producers. (It has no relation to a previous American remake that aired for five seasons on Showtime beginning in 2000.) The new series transports its story about a diverse group of friends impacted by a tragedy from the UK to New Orleans and stars Devin Way, Fin Argus, Ryan O’Connell, Johnny Sibilly, and Jesse James Keitel, while recurring guests include Kim Cattrall, Juliette Lewis, Ed Begley Jr., and Lukas Gage.\n\nRhythm + Flow France Trailer Foreign/Reality competition\n\nStand Out: An LGBTQ+ Celebration Comedy special\n\nSummer Camp Island Animation/Family HBO Max\n\nUndiscovered: Finding Amelia Reality discovery+\n\nWED / June 8\n\nBaby Fever Trailer Foreign/Comedy/Drama\n\nBargain Block Reality HGTV, 9p\n\nGladbeck: The Hostage Crisis Foreign/Documentary\n\nHungry for Answers Reality discovery+\n\nAdam Sandler's latest Netflix feature finds him playing a down-on-his-luck basketball scout whose discovery of a prospect in Spain could be his ticket back to the NBA.\n\n▣ The Janes Trailer Documentary 9p\n\nThis rather timely documentary from Emma Pildes and Tia Lessin looks at the Jane Collective, an underground Chicago-based group that provided over 11,000 illegal abortions prior to the Roe v. Wade ruling. Reviews were excellent when the film debuted at Sundance early this year. (Also debuting at Sundance to less enthusiastic reviews was a dramatized look at the same subject that should reach theaters this fall.)\n\nKamala Khan (newcomer Iman Vellani) may feel like an outsider as a nerdy Muslim American teen growing up in New Jersey, but in many ways she's not all that different than her peers: She likes gaming and she loves Marvel comics, especially Captain Marvel. But what happens when Kamala suddenly gets shape-altering superpowers of her own? Filmed in Thailand and the U.S., the six-episode Ms. Marvel introduces the first Muslim superhero to the Marvel Cinematic Universe, and she will move on to the big screen next year with a role in The Marvels. Adil El Arbi & Bilall Fallah (Bad Boys for Life) direct the series along with Meera Menon and Emmy- and Oscar-winner Sharmeen Obaid-Chinoy.\n\nObsessed to Death Trailer Drama/Thriller Tubi\n\nTUE / June 7\n\nAll Rise Trailer Drama OWN, 8p\n\nKendra and Beth Trailer Drama/Comedy ($) Rent/Buy\n\nKeeping Company Comedy/Thriller ($) Rent/Buy\n\nThe Policeman's Lineage Foreign/Drama ($) Rent/Buy\n\nRondo and Bob Documentary ($) Rent/Buy\n\nA Sexplanation Trailer Documentary ($) Rent/Buy\n\nThe Siege of Robin Hood Action-adventure ($) Rent/Buy\n\nDavid Letterman's latest Netflix series is dedicated to stand-up comedy, with each episode (recorded during the recent Netflix Is a Joke comedy festival) finding a single comedian performing a quick stand-up set and then joining Dave in a conversation. Additional episodes stream on June 12.\n\nMON / June 6\n\nAction Pack Trailer Animation/Family\n\nAmerican Ninja Warrior Reality competition 8p\n\nThe Barking Murders Trailer Drama BritBox\n\nBill Burr Presents: Friends Who Kill Comedy special\n\nThe Family Chantel Reality TLC, 8p\n\nIn the Dark Drama 9p\n\nFrench director Olivier Assayas (Personal Shopper, Summer Hours) adapts his own acclaimed 1996 movie into an A24-produced limited series that will debut at Cannes before airing on HBO and streaming on HBO Max. Taking over the role analogous to the one portrayed in the original film by Maggie Cheung (though Cheung was playing a version of herself), Alicia Vikander plays a disillusioned American actress who heads to Paris to star in a remake of the French silent film Les Vampires. But things get complicated on the problem-plagued set when the lines between her character and her real self begin to blur. The international cast also includes Tom Sturridge, Byron Bowers, Carrie Brownstein, Adira Arjona, Fala Chen, and Vincent Macaigne, while Assayas regular Kristen Stewart will also make an appearance. And the soundtrack comes from Daft Punk's Thomas Bangalter.\n\nLondon Kills Drama Acorn TV\n\nMiz and Mrs Trailer Reality USA, 11p\n\nPayback Reality TV ONe, 10p\n\nPeople Magazine Investigates Reality ID, 9p\n\nSeeking Sister Wife Reality TLC, 10p\n\nSleeping With a Killer Reality Lifetime, 10p\n\n#TextMeWhenYouGetHome Reality Lifetime, 9p\n\nSUN / June 5\n\n2022 MTV Movie & TV Awards Live event MTV, 8p\n\n2022 MTV Movie & TV Awards: Unscripted Live event MTV, 10p\n\nAutopsy: The Last Hours of Eddie Van Halen Reality/Music Reelz, 8p ET\n\nBattle on the Beach Reality competition HGTV, 9p\n\nBeachfront Bargain Hunt Reality HGTV, 10:30p\n\nDeadly Yoga Retreat Drama Lifetime, 8p\n\nDeep Water Salvage Reality Weather, 9p\n\nThe Earth Unlocked Reality Weather, 8p\n\nThe Great Food Truck Race Reality Food, 9p\n\nLords of the Ocean Reality Weather, 10p\n\nOur Dream Wedding Drama UP, 7p\n\nVan Halen: Story of Their Songs Reality/Music Reelz, 9p ET\n\nWatergate: Blueprint for a Scandal Documentary CNN, 9p\n\nSAT / June 4\n\nBuried in Barstow Trailer Drama Lifetime, 8p\n\nHidden Gems Drama Hallmark, 8p\n\nParty at the Palace Music 8p\n\nFRI / June 3\n\nAs the Crow Flies Trailer Foreign/Drama\n\n▣ The Boys Trailer Drama Prime Video\n\nSeason 3 kicks off with three episodes today, followed by weekly single-episode installments.\n\nWriter-comedian Joel Kim Booster loosely adapts Jane Austen's Pride and Prejudice into a modern-day queer rom-com directed by Andrew Ahn. (It's the latter's third straight well-reviewed film, following Spa Night and Driveways). The film follows a group of friends who head out for a summer vacation at the titular Long Island-adjacent resort destination and stars Booster alongside Bowen Yang, Torian Miller, Matt Rogers, Tomas Matos, and Margaret Cho.\n\n▣ Firebird Trailer Drama ($) Rent/Buy\n\nFloor Is Lava Trailer Game show\n\nFreakscene: The Story of Dinosaur Jr. Trailer Documentary/Music ($) Rent/Buy\n\nGuy's All-American Road Trip Reality Food, 9p\n\nHere Kills the Bride Drama LMN, 8p\n\nLast Seen Alive Trailer Action/Thriller ($) Rent/Buy\n\nMr. Good: Cop or Crook? Foreign/Reality\n\nOn My Way With Irina Rimes Documentary/Music HBO Max\n\n▣ P-Valley Drama Starz, 9p\n\nThe Perfect Mother Foreign/Drama\n\n▣ Physical Trailer Comedy/Drama Apple TV+\n\nThe White Lotus standout Murray Bartlett joins the cast for season 2. New episodes stream weekly.\n\nScarf Face Trailer Documentary ($) Rent/Buy\n\nSurviving Summer Trailer Family/Drama\n\nThe Time Capsule Trailer ($) Rent/Buy\n\nTrixie Motel Reality discovery+\n\nTwo Summers Foreign/Drama\n\nUltra Violet & Black Scorpion Trailer Comedy Disney, 9p\n\nThe Villains of Valley View Trailer Comedy Disney, 8p\n\nThe Wedding Planners Drama UP, 8p\n\nTHU / June 2\n\n2022 Scripps National Spelling Bee Finals Live event Bounce/ION, 8p\n\nThe Book of Queer Documentary discovery+\n\nDon't know Borgen? Well, get ready for your new obsession. This very bingeable Danish drama series is a Scandinavian (and, dare we say, superior) take on The West Wing that focuses on high-level politics in Denmark through the eyes of candidate turned Prime Minister Birgitte Nyborg (Sidse Babett Knudsen), her key aides, and members of the press, including Katrine Fønsmark (Birgitte Hjort Sørensen). Three seasons (all now streaming on Netflix) originally aired from 2010-13, but today brings an all new, Netflix-co-produced fourth season (subtitled \"Power & Glory\") which takes place in the present day, when Nyborg is now serving as Minister for Foreign Affairs and Fønsmark has a new job as a TV news director. Much of the original cast returns with the notable exception of Pilou Asbæk.\n\nThe Croods: Family Tree Animation/Family Hulu/Peacock\n\nFamily Built Reality HGTV, 10p\n\nFire Masters Reality Cooking, 9p\n\nFor the Love of Jason Trailer Comedy ALLBLK\n\nHer Majesty: The Queen News 10p\n\nHosted by Her Majesty: The King (Gayle).\n\nI Love Us Reality/Comedy BET+\n\nMystic Drama UP, 9p\n\nRescheduled from March 10. Returning with new episodes for the first time in three years, Seth MacFarlane's Star Trek spoof/homage finds the show moving from Fox to Hulu for its third season and adopting an altered title. The season—which could be the show's last, at least for quite a while, given its stars' commitments to other upcoming series—will feature the final performance by the late Norm Macdonald (returning as the voice of Yaphit), while new faces include Anne Winters and Babylon 5 star Bruce Boxleitner.\n\nOutsiders Drama BET+\n\nAlso streaming on Sundance Now, this comedic, seven-episode adaptation of Adam Kay's medical memoir stars Ben Whishaw as a low-level doctor struggling with the long hours and high demands of working in an OB-GYN ward of a British NHS hospital, with the series following him (and his colleagues) both at work and in their personal lives. British critics loved the series when it aired on the BBC earlier this year. New episodes stream weekly.\n\nYuri Marçal: Honest Mistake Comedy speical", "images": ["https://static.metacritic.com/images/products/movies/4/d7d4220e6af7758a9b7debdc9ba94cc1-98.jpg", "https://static.metacritic.com/images/features/networks/hulu15transparent.png", "https://static.metacritic.com/images/products/music/9/fde5e6bad29685a0849cb977e4f27b2e-98.jpg", "https://static.metacritic.com/images/products/games/4/b814dbab04f6d3db442c30f7b01b4b3d-98.jpg", "https://static.metacritic.com/images/products/games/3/7ab27ffe2eea120270e65bfb2c967927-98.jpg", "https://static.metacritic.com/images/features/networks/comedycentralnew20.png", "https://static.metacritic.com/images/features/main/netflix202210-50.jpg", "https://www.metacritic.com/images/icons/mc-mustsee-sm.svg", "https://static.metacritic.com/images/features/main/hbo202210-50.jpg", "https://static.metacritic.com/images/products/games/2/e86033fabd087ad18ba07a0b1f1e1e94-98.jpg", "https://static.metacritic.com/images/products/music/5/98977f4e9176d0a942cd10ae47981292-98.jpg", "http://static.metacritic.com/images/features/networks/fx20.png", "https://static.metacritic.com/images/features/main/_TNtvpreview202210-180.jpg", "https://www.metacritic.com/images/icons/metacritic-wordmark.svg", "https://static.metacritic.com/images/products/movies/9/0072b1c753abae170f66646158c329a1-98.jpg", "https://static.metacritic.com/images/features/main/peacock202209-50.jpg", "https://static.metacritic.com/images/products/tv/7/3a2221980f81a9310cca6bc07cbcff50-98.jpg", "https://static.metacritic.com/images/products/tv/6/bb7cbd150da25997e842cfefc48628a1-98.jpg", "https://static.metacritic.com/images/products/games/4/107361b2f178b07c8640d04e6216949d-98.jpg", "https://static.metacritic.com/images/features/networks/netflixnew50.jpg", "https://static.metacritic.com/images/features/networks/hbo20.png", "https://static.metacritic.com/images/features/main/amazon202210-50.jpg", "https://static.metacritic.com/images/features/main/_TNmusic2022midyear-180.jpg", "https://static.metacritic.com/images/products/tv/6/a5aee2905926c3be00a078c307c79f51-98.jpg", "https://static.metacritic.com/images/features/networks/showtime20.png", "https://static.metacritic.com/images/features/main/amazon202210-28.jpg", "https://static.metacritic.com/images/features/networks/fox20.png", "https://static.metacritic.com/images/products/tv/0/99d16ada3b64f3991057c91bb7e3c87b-98.jpg", "https://www.metacritic.com/images/icons/mc-mustwatch-sm.svg", "https://static.metacritic.com/images/features/main/moviepreview_2022_10-180.jpg", "https://static.metacritic.com/images/features/_graphics/miniseries.gif", "https://static.metacritic.com/images/features/main/paramountplus202209-28.jpg", "https://static.metacritic.com/images/features/main/netflix202210-28.jpg", "https://static.metacritic.com/images/products/movies/4/eb450e40562c7f8d041abb0fbd6c934a-98.jpg", "https://static.metacritic.com/images/features/networks/cbs20.png", "https://static.metacritic.com/images/features/networks/abc20.png", "https://static.metacritic.com/images/features/main/games_awards_tracker_2021-28.jpg", "https://static.metacritic.com/images/features/networks/nbc20.png", "https://static.metacritic.com/images/features/main/tvpremieredates-28.jpg", "https://static.metacritic.com/images/features/_graphics/special.gif", "https://static.metacritic.com/images/features/main/_TNtvpreview202210-50.jpg", "https://static.metacritic.com/images/features/main/gamescorecard2022fallragnarok-180.jpg", "https://static.metacritic.com/images/features/main/hulu202209-50.jpg", "https://static.metacritic.com/images/features/main/paramountplus202209-50.jpg", "https://www.metacritic.com/media/networks/cw20.png", "https://static.metacritic.com/images/products/music/2/8c3188ac861c8d1683622ee63b4046fe-98.jpg", "https://www.metacritic.com/media/networks/pbs25.png", "https://static.metacritic.com/images/products/movies/7/5bd611266bf38df0155b4cfc83d33ebe-98.jpg", "https://static.metacritic.com/images/features/_graphics/movie.gif", "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg", "https://static.metacritic.com/images/products/tv/8/351b6c4f6e68bcfa287e4db776d78445-98.jpg", "https://static.metacritic.com/images/products/games/4/76851a66ee2c21d65e5d047a3ac8b04a-98.jpg", "https://static.metacritic.com/images/products/movies/1/604a976f86b1a236ebf218162eb9b9a2-98.jpg", "https://static.metacritic.com/images/features/media/graphics/new.gif", "https://static.metacritic.com/images/features/networks/amc20.png", "https://static.metacritic.com/images/features/main/tv_bettercallsaulseriesfinale-28.jpg", "https://static.metacritic.com/images/products/music/9/abd2d67980e2d98465a525bc2899dbfd-98.jpg", "https://www.metacritic.com/images/icons/metacritic-icon.svg", "https://www.metacritic.com/images/icons/search_inactive.svg", "https://static.metacritic.com/images/products/music/9/7bc800ce155a1dba733cd0dadfe0b424-98.jpg", "https://static.metacritic.com/images/features/main/apple202210-50.jpg", "https://static.metacritic.com/images/features/networks/fxx25.png"], "top_img": "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.metacritic.com/feature/tv-premiere-dates", "title": "Fall 2022 TV Premiere Calendar", "meta_data": {"description": "Find a calendar of premiere dates for all upcoming new and returning television shows, plus TV movies and specials. - Page 2", "viewport": "width=1024", "application-name": "Metacritic", "msapplication-TileColor": "#000000", "msapplication-TileImage": "/images/win8tile/76bf1426-2886-4b87-ae1c-06424b6bb8a2.png", "facebook-domain-verification": "618k3mbeki8tar7u6wvrum5lxs5cka", "og": {"title": "Fall 2022 TV Premiere Calendar", "type": "article", "url": "https://www.metacritic.com/feature/tv-premiere-dates", "image": "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg", "site_name": "Metacritic", "description": "Find a calendar of premiere dates for all upcoming new and returning television shows, plus TV movies and specials."}, "fb": {"app_id": 123113677890173}, "twitter": {"site": "@metacritic", "creator": "@metacritic", "card": "https://static.metacritic.com/images/features/main/tvpremieredates-180.jpg"}}, "movies": [], "publish_date": null, "source": "https://www.metacritic.com", "summary": ""}