{"url": "https://www.usatoday.com/story/life/entertainthis/2017/12/26/chrissy-teigen-twitter-flight-nowhere/983386001/", "text": "Chrissy Teigen finally lands in Tokyo, surviving an epic 8-hour flight to nowhere\n\nShow Caption Hide Caption Chrissy Teigen live tweets hilarious 'flight to nowhere' The pregnant model and husband John Legend were two of 150 understandably unhappy passengers on a flight to Tokyo that wound up being an 8-hour flight right back to where they started. USA TODAY\n\nAll Nippon Airways (ANA) has apologized to the passengers, which included Chrissy Teigen and husband John Legend, who took an eight-hour flight to nowhere Tuesday.\n\nTeigen live-tweeted her experience of taking off from LAX bound for Tokyo with Legend, only to have the plane make an abrupt U-turn after four hours. Flight 175 then returned to LAX after eight hours and 20 minutes of flight.\n\nHonestly everyone on the ground and in the air were very kind and apologetic. But I just need to know why we couldn’t have flown to tokyo and settled this one person’s mistake (who was going to tokyo all along) there, in tokyo. 230 people on this flight. https://t.co/EhCTERTRu5 — christine teigen (@chrissyteigen) December 27, 2017\n\nMore: Chrissy Teigen announces Baby No. 2 with John Legend\n\nThe ANA statement Wednesday morning offered \"sincere apologies to the passengers on NH 175 that were impacted by the delayed flight... We failed to deliver the customer service we strive for and passengers expect from us.\"\n\nThe statement made clear that the decision to return was correct for safety reasons when it was discovered a passenger had incorrectly boarded the flight at LAX.\n\n\"During the flight, the pilot in command was presented with information about the discrepancy in the passenger manifest,\" the statement said. \"Based on the available information in flight, he made the correct decision to return to LAX. ANA supports the decision of the pilot, out of the abundance of caution and safety for the passengers and crew onboard.”\n\nTeigen, 32, made the most of onboard Wi-fi to tweet about the flight to nowhere in progress Tuesday.\n\n\"A flying first for me: 4 hours into an 11 hour flight and we are turning around because we have a passenger who isn’t supposed to be on this plane,\" Teigen wrote. \"Why...why do we all gotta go back, I do not know.\"\n\na flying first for me: 4 hours into an 11 hour flight and we are turning around because we have a passenger who isn’t supposed to be on this plane. Why...why do we all gotta go back, I do not know — christine teigen (@chrissyteigen) December 27, 2017\n\nThe seat map clearly showed it was an unusual flight.\n\n.@chrissyteigen is on an international flight that turned around 4 hours in because a passenger isn’t supposed to be on plane. Look at this flight path! This is my Twilight Zone. pic.twitter.com/II06VmfOah — Jensen Karp (@JensenClan88) December 27, 2017\n\nSo many questions and I have no answers. Either do they. This person must be mortified though — christine teigen (@chrissyteigen) December 27, 2017\n\nTeigen was not satisfied with this return flight to nowhere, even with a stellar movie selection that included Clint Eastwood's 2008 drama Gran Torino.\n\nLmao after all this I will have spent 8 hours on a flight to nowhere. Like we were all just havin a great time up here flyin in the sky watching gran torino time to go home now — christine teigen (@chrissyteigen) December 27, 2017\n\n\"Laughing,\" but frustrated over the cause — a person apparently had boarded the wrong flight with a United ticket — Teigen went after the airport boarding machines.\n\nI won’t be able to sleep until I know how this person figured out they were on the wrong flight. That’s all I ask. 150 people have been majorly inconvenienced, please, just tell me — christine teigen (@chrissyteigen) December 27, 2017\n\nThey keep saying the person had a United ticket. We are on ANA. So basically the boarding pass scanner is just a beedoop machine that makes beedoop noises that register to nowhere — christine teigen (@chrissyteigen) December 27, 2017\n\nThe flight landed back at LAX after 8 hours and 20 minutes in the air (just imagine how the people in the cheap seats felt).\n\nBut Teigen tried to keep it all in stride. \"The pleasure I get out of the story is worth more to me than a direct flight to Tokyo,\" she said.\n\nI don’t know why I’m not more upset about this. The pleasure I get out of the story is worth more to me than a direct flight to Tokyo — christine teigen (@chrissyteigen) December 27, 2017\n\nThough she made a swipe at the boarding pass machine.\n\nANA boarding pass machines pic.twitter.com/nmuqxZLIVG — christine teigen (@chrissyteigen) December 27, 2017\n\nAfter more hours waiting at LAX, Teigen and Legend boarded a new flight for Tokyo early Wednesday morning.\n\nGetting on another flight now oh bless — christine teigen (@chrissyteigen) December 27, 2017\n\nTaking off!!! Please don’t be the same menu please don’t be the same menu — christine teigen (@chrissyteigen) December 27, 2017\n\nUnfortunately, Teigen and Legend celebrated Legend's birthday in the air.\n\nIt’s john’s birthday here in the sky! Wish @johnlegend a happy birthday! pic.twitter.com/S92z99CsVV — christine teigen (@chrissyteigen) December 27, 2017\n\nTeigen, who is expecting baby number two with Legend, also experienced some in-flight pregnancy aches and pains.\n\n2 more hours. My nose and gums are bleeding and my skin runneth over my compression socks. — christine teigen (@chrissyteigen) December 27, 2017\n\nSuch is life when you are...pregnant on a plane — christine teigen (@chrissyteigen) December 27, 2017\n\nThankfully, the two made it to Tokyo safely.\n\nWe uhhhhh went ahead and cancelled our connecting flight to nagoya and 3 hour car ride for...obvious reasons...but are happy to stay here in Tokyo! We feel like young lovers again. Been a while since the ramen adventures of 2012! — christine teigen (@chrissyteigen) December 27, 2017\n\nHere's ANA's entire statement:", "images": ["https://media.gannett-cdn.com/29906170001/29906170001_5693957399001_5693943422001-vs.jpg?pubId=29906170001", "https://www.gannett-cdn.com/-mm-/bb05a7c83b86ebf1dfa19a73b9a8e1a72815fda7/c=0-0-4148-2343/local/-/media/2017/12/26/USATODAY/USATODAY/636499248779600517-LL-MW-TEIGEN-VERT-030717-89168799.JPG?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/bb05a7c83b86ebf1dfa19a73b9a8e1a72815fda7/c=0-0-4148-2343/local/-/media/2017/12/26/USATODAY/USATODAY/636499248779600517-LL-MW-TEIGEN-VERT-030717-89168799.JPG?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Bryan Alexander"], "canonical_link": "https://www.usatoday.com/story/life/entertainthis/2017/12/26/chrissy-teigen-twitter-flight-nowhere/983386001/", "title": "Chrissy Teigen finally lands in Tokyo, surviving an epic 8-hour flight to nowhere", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/entertainthis/2017/12/26/chrissy-teigen-twitter-flight-nowhere/983386001/life/entertainthis", "theme-color": "#ffffff", "og": {"type": "article", "title": "Chrissy Teigen finally lands in Tokyo, surviving an epic 8-hour flight to nowhere", "description": "Teigen and husband John Legend finally made it to Tokyo after their initial flight turned around.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/bb05a7c83b86ebf1dfa19a73b9a8e1a72815fda7/c=0-0-4148-2343/local/-/media/2017/12/26/USATODAY/USATODAY/636499248779600517-LL-MW-TEIGEN-VERT-030717-89168799.JPG?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "Teigen and husband John Legend finally made it to Tokyo after their initial flight turned around.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1514246400.0, "source": "https://www.usatoday.com", "summary": ""}