{"url": "https://www.techradar.com/black-friday/black-friday-cyber-monday-2018-deals-in-usa", "text": "With an array of sales over the next seven days, you could argue Black Friday 2022 is upon us already. While the big day itself isn't until November 25, a handful of retailers are starting the end-of-year sales extravaganza early with a selection of Black Friday deals in October. It's made it abundantly clear that the holiday shopping season is longer than ever before.\n\nAnd that's where our guide to Black Friday 2022 comes in. It includes all the key info you need, including the latest news we have about this year's sales and analysis of all the best deals from last year. We've also shared our top buying advice so you can make the most of the event during this time of high inflation and cost of living squeeze.\n\nBecause of the situation, we find ourselves in, we think retailers will need to go the extra mile to entice us to spend during what is traditional their busiest and most crucial time of the year. Stock levels are high but discounts will need to be large in order to encourage the most spending. We've already seen that spending was actually down 1.3% on Black Friday itself last year, according to Adobe Analytics (opens in new tab). However, that was made up by the fact that consumers spent $109.8 billion during November as a whole – up 11.9% compared to the previous year.\n\nOur main prediction is that this year's Black Friday deals will be spread out over an ever longer period. There are already signs of that coming true, as Target has run a Deal Days event from October 6 - 8. Walmart is getting in on the action from October 10 - and then we've also got the Prime Early Access Sale on October 11 - 12 at Amazon, which will be an exclusive sale for its Prime members. Expect lots of early bargains during these events if you want to get a head start on your shopping or spread it out across two months.\n\nBelow you'll find more of our predictions for this year's sale. Read on for how to find the best Black Friday deals, the top retailers to follow and a look back at last year's biggest bargains. We continue updating this page with all the latest news in the months ahead, so make sure to bookmark this page as your one-stop shop for Black Friday 2022.\n\nBlack Friday 2022: key information\n\n(Image credit: McLittle Stock)\n\nWhen is Black Friday 2022? Black Friday 2022 falls on November 25 this year. The actual date shifts, but the day of the week stays the same: it's always the Friday after Thanksgiving.\n\n\n\nAt last year's sale, retailers kicked off their Black Friday deals earlier than ever due to concerns around shipping delays and supply issues. While we don't know for sure what will happen during this year's sale, we do think the trend of retailers offering early Black Friday deals is here to stay.\n\nWhy is it called Black Friday?\n\nLet’s take a history lesson to find how why they call it Black Friday: the first known mention of Black Friday related to this shopping experience was in November 1951, when the journal Factory Management and Maintenance (opens in new tab) used it to describe people calling in sick the day after Thanksgiving so they could have an extra day off work.\n\nAt the same time, US police were using the phrases “Black Friday” and “Black Saturday” to describe the horrendous traffic that occurred at the beginning of the pre-Christmas shopping season.\n\nIn 1961, the local government moved to change the shopping season to “Big Friday” and “Big Saturday,” but it never caught on. The notion that it was the time when retailers moved 'back into the black' was seen far later and clearly an attempt to bring positivity to the term.\n\nBlack Friday Deals 2022: our predictions\n\nWe can make predictions of what we think Black Friday 2022 will bring based on last year's sale event. Due to concerns around shipping delays and supply issues, we saw retailers like Best Buy and Walmart launch Black Friday deals earlier than ever, with Amazon kicking things off in early October.\n\n\n\nTypically retailers reserve their best deals for Black Friday proper, but last year we saw the best deals leading up to Black Friday. This might be why, according to Adobe Analytics (opens in new tab), spending was down 1.3% on Black Friday compared to last year, and Thanksgiving Day stayed flat. Consumers have spent $109.8 billion in November alone, which was up significantly (11.9%) compared to 2020. This falls in line with the trend of early sales, which drew consumers to make earlier purchases and not wait for Black Friday to snag a deal online.\n\n\n\nSo what does this mean for Black Friday 2022? It all depends on if retailers will face the same shipping and stock supply issues that plagued last year's sale. There's little indication this could be the case again, but we still expect the trend of earlier sales to stay.\n\nWhile it's still early to know exactly what kind of deals we'll see during Black Friday 2022, we can make predictions on what brands and products we'll see come November. According to Adobe (opens in new tab), the hottest items at last year's Black Friday sale included AirPods, the Apple Watch, laptops, TVs, consoles, and toys from brands like Hot Wheels, Paw Patrol, and Nerf. Amazon's top Black Friday sellers consisted of its own devices like the Echo Dot, Fire TV Stick, and smart bulbs, and some interesting items included the Revlon one-step hair dryer and the Colorfulkoala yoga pants.\n\nConsidering there have been many new product launches over the last 12 months – including new Apple devices, TVs and laptops – expect to see older models with some of the largest reductions this year. There's an outside chance that some of the newer items are also reduced, but these discounts are unlikely to be as common or as large as last-generation models.\n\nBlack Friday 2022: our buying advice\n\n(Image credit: Getty)\n\nHow to get the best Black Friday deals in 2022?\n\nHomework really helps. Some retailers up prices from August through to October so they can offer supposedly amazing discounts on Black Friday, so don’t be fooled by such moves.\n\nThey’re particularly prevalent in expensive consumer electronics such as TVs or laptops with product numbers rather than names, with products that were dropped down to a great bargain price suddenly being pushed back to their MSRP again.\n\nIt’s also a very good idea to be flexible: for example, if you're interested in a Samsung 4K TV it’s best to think about the features you want rather than a specific model number: the BRV553ABD34-82C-9218-X may not be discounted on Black Friday 2022, but an almost identical set with the specification you want probably will be.\n\nSo do your research on what matters and we’ll do our best to give you the right comparison needed.\n\nHowever, don’t be fooled into thinking that something that looks like a five-star set is the same but cheaper - certain elements (often with regards to screen quality or image processing) won’t be as high quality to achieve that lower price point.\n\nWhen to shop for the best Black Friday deals?\n\nEarly holiday shopping is going to be a smart move for Black Friday 2022, as we saw the best deals were launched in the weeks leading up to day itself last year. When it came to the big day, we were left disappointed as there weren't many new offers.\n\nWee noticed also best-selling items like the AirPods Pro, the Apple Watch, MacBooks, and Amazon's own devices were out of stock in the run-up to Black Friday proper as folks took advantage of the early low prices. We also saw surprising price increases on certain items, including the AirPods Pro and MacBook Pro, which is unusual based on previous years.\n\nUltimately, if there's a good offer even in the weeks leading up to Black Friday then you should feel confident that you can take advantage of early Black Friday deals at the big-name online retailers.\n\nLast year's best Black Friday deals\n\nTaking a look back at last year's Black Friday deals can help us get an idea of what will be on sale during Black Friday 2022. We've listed a few key products from the most popular categories below, including TV, laptops, smart home devices and appliances from all your favorite brands like Apple, Samsung, Roomba, Keurig, Instant Pot and more.\n\n(opens in new tab) Fire TV Stick Lite with Alexa Voice Remote: $29.99 $17.99 at Amazon\n\nSave $12 - If you're looking to pick up a cheap streaming device, Amazon's Black Friday deals event has the Fire TV Stick Lite on sale for a record-low price of just $17.99. The affordable streaming player allows you to enjoy tens of thousands of channels, apps, and Alexa skills and features an Alexa voice remote.\n\n(opens in new tab) Amazon Echo Dot (4th Gen): $49.99 $29.99 at Amazon\n\nSave $20: Want a cheap way to bring Alexa into your home? Pick up the compact 4th generation Echo Dot smart speaker. Now $20 off for Black Friday, it's within a buck of the all-time low that we saw around the same time last year. And should you have an eligible Amazon device to trade in, you can score another 25% off.\n\n(opens in new tab) Insignia 70-inch 4K UHD Smart Fire TV: $749.99 $579.99 at Best Buy\n\nSave $170 - Best Buy has this 70-inch 4K TV from Insignia on sale for just $579.99. That's the lowest price we've seen and a fantastic Black Friday deal for a big-screen display. The Insignia set packs 4K Ultra HD resolution, DTS Studio Sound, and features the Fire OS for seamless streaming and a handy Alexa voice remote.\n\n(opens in new tab) TCL 65-inch 5 Series QLED 4K UHD Smart TV: $899.99 $699.99 at Best Buy\n\nSave $200 - A QLED display under $1,000 is extremely rare, but Best Buy's Black Friday sale has this 65-inch set from TCL down to a stunningly low price of just $699.99. You're not going to find a better deal for a big-screen QLED TV - so we'd grab this record-low price while you can.\n\n(opens in new tab) LG C1 OLED (65-inch): $2,499.99 $1,796 at Amazon\n\nSave $703 - One of the best Black Friday deals we've seen, Amazon has the brilliant LG C1 OLED TV on sale for a record-low price of $1,796. It's one of the best TVs (opens in new tab) you can buy, thanks to the stunning OLED display, Alpha a9 Gen. 4 processor, and virtual surround sound audio. If you're after the best price-to-performance ratio, the C1 OLED comes with our highest recommendation – especially now that it's getting a $700 discount.\n\n(opens in new tab) Amazon Fire TV 50-inch 4-Series 4K UHD Smart TV: $469.99 $329.99 at Amazon\n\nSave $140 - if you're looking to pick up a cheap TV deal this Black Friday, you can grab Amazon's all-new 50-inch 4K Fire TV on sale for just $329.99. That's the first discount we've seen for the 2021 set and an incredible price for a mid-size 4K TV that's packed with premium features and has the Fire operating system built right in for easy streaming.\n\n(opens in new tab) TCL 43-inch 4-Series 4K Smart Roku TV: $429.99 $299.99 at Walmart\n\nSave $130 - Walmart's Black Friday Deals for Days sale has this TCL 43-inch 4K TV on sale for just $299.99. You're getting the Roku operating system built-in, excellent smart capabilities, plus an easy-to-use remote that features voice search and control.\n\n(opens in new tab) Samsung Chromebook 4: $199.99 $129 at Walmart\n\nSave $70.99 - Samsung makes great stuff if you're on a budget and this entry-level Chromebook 4 is no exception to that. It's not super powerful, but you don't need much for ChromeOS and it's solidly built for the price. At 11.6-inches, it's a smaller machine but perfect for school work or casual browsing online. Being on the light-side makes it very portable too - perfect for the rucksack.\n\n(opens in new tab) Dell XPS 13: $949.99 $649.99 at Dell\n\nSave $300 - The Dell XPS 13 once sat at the top of our best laptop (opens in new tab) rankings for around a decade, only getting better with each new version. This discount is the cheapest we've seen an XPS 13 all year. It's a versatile machine with a 13.3-inch Full HD InfinityEdge display, Intel i5 processor, 8GB RAM, and a 256GB SSD. Basically, it's everything you could want from a high-performance laptop for work, school, or just general use.\n\n(opens in new tab) Fire TV Stick 4K with Alexa Voice Remote: $49.99 $24.99 at Amazon (opens in new tab)\n\nSave $25 - Stream your favorite content in 4K resolution with HDR too, with the 4K Fire TV Stick that's on sale for just $24.99. That's a massive 50% discount and the lowest price we've ever seen. This fantastic Black Friday deal is currently in stock and ready to ship, so we recommend snagging this new low price now before it's too late.\n\n(opens in new tab) All-new Apple AirPods Pro: $249 $169.99 at Amazon\n\nSave $79 - Amazon's record-low price for the new Apple Airpods Pro has unfortunately ended, but this current deal is only $10 more. With this latest edition, you'll not only get a refined version of the best-selling AirPods Pro but a handy new MagSafe Charging Case that works great with an iPhone 12 or 13.\n\n(opens in new tab) Sony WH-1000XM4 Wireless Headphones: $349.99 $248 at Best Buy\n\nSave $101 - Hands-down the best headphones (opens in new tab) on the market, these XM4s deliver class-leading noise cancellation, audio upscaling, superior comfort, and a sleek design. While they're certainly not cheap, this is the best price we've ever seen on these cans, so they're definitely worth considering.\n\n(opens in new tab) Nintendo Switch (Neon) | Mario Kart 8 Deluxe + 3-months NSO: $299.99 at GameStop\n\nSave $70 – If this isn't your first Black Friday you'll no doubt recognize this Nintendo Switch bundle from the previous sales. In it, you get a Switch (Neon) console, a copy of Mario Kart 8 Deluxe, and 3-months of Nintendo Switch Online membership. It's still good value as all of these items would cost around $370 at full price.\n\n(opens in new tab) Keurig K-Duo Essentials Coffee Maker: $99 $79 at Walmart\n\nSave $32 – The Keurig K-Duo is a more premium coffee maker, but it does include a single-serve and carafe option. With support for multiple cup sizes and a brewing time of under one minute, you can make a morning cup (or pot) of Joe without the fuss.\n\n(opens in new tab) iRobot Roomba 692 Robot Vacuum: $299.99 $174.99 at Amazon\n\nSave $125 - Roomba robot vacuums are one of the most popular Black Friday deals, and Amazon has a $100 discount on the best-selling iRobot Roomba 692. That brings the price down to just $174, which is a fantastic price for a robot vacuum and the lowest price we've ever seen.\n\n(opens in new tab) Saatva Classic mattress: from $899 - save $250 when you spend $975 or more at Saatva\n\nHotel luxury - The Saatva Classic is number one in our best mattress guide (opens in new tab). It costs more than the Nectar, but this premium mattress has been approved by the Congress of Chiropractic State Associations, and is super customizable - it comes in three different firmness options and two heights, and We found it delivers excellent pressure relief in all sleeping positions, while keeping you cool and well-supported at night. It's an excellent choice for hot sleepers, or anyone who likes a traditional mattress feel with a little bounce. Our exclusive Black Friday mattress deal makes a queen size $100 cheaper than on the Saatva site: $1,345, down from $1,595 - there's free white glove delivery too.\n\n(opens in new tab) Oral-B Pro 1000 CrossAction Electric Toothbrush: $49.94 $29.97 at Amazon\n\nSave $9.97 - Oral B dominates our top electric toothbrush rankings (opens in new tab). This model averages 4.7/5 stars from over 44,000 user reviews on Amazon, and there's a huge 40% discount with this Black Friday deal at Amazon - that's just 34c more than the lowest price we've seen. Unlike more advanced (and expensive) options, there's only one cleaning mode, but it comes with the only feature you actually need: a pressure sensor to tell you if you're pressing too hard. There's also an in-built timer to help you brush for the recommended two minutes.\n\n(opens in new tab) Apple Watch 7 (41mm, GPS): $399.99 $379.99 at Amazon\n\nSave $19 - Last year's best Apple Watch deal was the Apple Watch 7 on sale for $379.99. That's a $19 discount and a new record-low price for the 41mm smartwatch. This discount applies to the Green, Red, and Blue sport bands, which are the only colors that are currently in stock. This is the cheapest deal we've seen for the Series 7 smartwatch, so we'd grab this fantastic Black Friday deal now before it's too late.\n\n(opens in new tab) Apple iPhone 13: save up to $800 with a trade-in, plus $800 with a switch at Verizon\n\nThere's not one, but two fantastic deals currently available at Verizon on the iPhone 13. First up, both new and existing customers can get up to $800 with a trade-in on an eligible unlimited data plan. Switching over from another carrier? You'll get an additional gift card worth up to $800 as a welcome bonus too.", "images": ["https://cdn.mos.cms.futurecdn.net/gfGCgKbCCQy6U3XsBvvve5-200-100.jpg", "https://www.techradar.com/media/img/missing-image.svg", "https://cdn.mos.cms.futurecdn.net/YzEKgMccf7XNZrC5LRZaVR-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/FSyMKRLSijNt6G9qJn2E3Q-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/rhJhE8Qv3eMTPfg4Z9ExJ9-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/64u3u9trbeCsQsSEcPraJe-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/WmvUVDAUikRNMzMevnhxW9-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/wAd3FpwKu4zE59WakPUk4F-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/TGRa9v5bVVzcB8ReLtndJZ-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/6mJhNGC26cTDA7GqZdFCAE-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/ZTdXGHwUj85t6WXRnTXDTC-200-100.jpeg", "https://cdn.mos.cms.futurecdn.net/XsxtSEiqiqx2ALgwuTdJpC-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/5XHDgoxEpPPjZX65S6uNEe-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/yW9ehS4L2xyHz2m88kxhe4-200-100.jpg", "https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg", "https://cdn.mos.cms.futurecdn.net/xXnMTDXNVdRnnFm7in2qBW-200-100.jpg", "https://mos.fie.futurecdn.net/products/5c3cd1e90a982172c5d432f3a4801c07b9ff3bc0-100-80.jpg", "https://mos.fie.futurecdn.net/logos/models/hlwce5dqzq4wsnmg-16040076574048-250-80.jpeg", "https://cdn.mos.cms.futurecdn.net/6WijC2bNkTKYrXaVfXRhK6-320-80.jpg", "https://cdn.mos.cms.futurecdn.net/q6DWMT5T66ha3uoDYPo4jB-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/HQ58QhmanjwVaQDppxBDE5-200-100.jpg", "https://mos.fie.futurecdn.net/products/7a5c7a14fafad623ad19ff0247d354ed3cca3bc1-100-80.jpg", "https://cdn.mos.cms.futurecdn.net/j4buZFccYy92n8HT9EFnfM-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/ss4rVtML5CDNssMsf78z3W-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/6WijC2bNkTKYrXaVfXRhK6-1200-80.jpg"], "top_img": "https://cdn.mos.cms.futurecdn.net/6WijC2bNkTKYrXaVfXRhK6-1200-80.jpg", "keywords": [], "authors": ["Mackenzie Frazier", "Window.Slicecomponents", "Window.Reliabledomcontentloaded.Then", "Var Componentcontainer", "Document.Queryselector", "Slice-Container-Authorbio", "If Componentcontainer", "Var Data", "Layout", "Default"], "canonical_link": "https://www.techradar.com/black-friday/black-friday-deals-sales", "title": "Black Friday deals 2022: latest early sales and our top buying tips", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "pub_date": "2022-09-15T13:29:41+00:00", "description": "Everything you need to know about Black Friday deals in 2022, including the date, our top tips, and the early sales already announced.", "robots": "max-image-preview:large", "msapplication-TileColor": "#000000", "msapplication-TileImage": "https://vanilla.futurecdn.net/techradar/548600/apple-touch-icon.png", "og": {"site_name": "TechRadar", "image": {"identifier": "https://cdn.mos.cms.futurecdn.net/6WijC2bNkTKYrXaVfXRhK6-1200-80.jpg", "width": 1200}, "type": "article", "title": "Black Friday deals 2022: latest early sales and our top buying tips", "url": "https://www.techradar.com/black-friday/black-friday-deals-sales", "description": "All you need to know about the Black Friday deals in 2022"}, "article": {"publisher": "https://www.facebook.com/TechRadar", "published_time": "2022-09-15T13:29:41Z", "modified_time": "2022-09-30T14:57:14.963Z"}, "parsely-type": "post", "parsely-post-id": "A6Z7AwX8Mv95rqJVoZah9o", "parsely-pub-date": "2022-09-15T13:29:41Z", "parsely-title": "Black Friday deals 2022: latest early sales and our top buying tips", "parsely-link": "https://www.techradar.com/black-friday/black-friday-deals-sales", "parsely-image-url": "https://cdn.mos.cms.futurecdn.net/6WijC2bNkTKYrXaVfXRhK6.jpg", "parsely-section": "Black Friday", "parsely-tags": "Category: Black Friday,Category: Other,Category: Black-friday,deals,techdeals,Black Friday,Black Friday sales,black friday deals,holiday,Black Friday 2022,type_deal,_van_ads_none,van-disable-inbody-ads,deals,channel_other,blackfridayhub,van-block-taboola,exclude-from-homepage,van_sticky_side_nav,no-recommended,contentdev,van-black-friday-breadcrumbs,hotjar-enabled,serversidehawk", "parsely-author": "Mackenzie Frazier", "fb": {"app_id": 235441786508054}, "twitter": {"card": "summary_large_image", "site": "@TechRadar", "title": "Black Friday deals 2022: latest early sales and our top buying tips", "description": "All you need to know about the Black Friday deals in 2022", "creator": "@TechRadar", "image": "https://cdn.mos.cms.futurecdn.net/6WijC2bNkTKYrXaVfXRhK6-1200-80.jpg", "account_id": 15560223}, "google-site-verification": "jEzBNX-r47v-rgc86g7xG47qMqF4VJuXdLUueTx8saU", "p": {"domain_verify": "10329f1fd4d0a2cd5c0d3b3b809cb4cd"}, "OMG-Verify-V1": "1036697-2d2c9025-5430-4e79-8349-e8c1c926dd73", "taboola": {"url": "https://www.techradar.com/black-friday/black-friday-deals-sales"}, "botify-site-verification": "xkNFqB6l1qBl8BEqMjQvrHuYinhxlJVe", "msvalidate.01": "CC462E6DF91492086145CA5EBDCB615E", "theme-color": "#2f6e91", "lomadee-verification": 22816996}, "movies": [], "publish_date": 1663248581.0, "source": "https://www.techradar.com", "summary": ""}