{"url": "https://tvline.com/2018/10/17/the-conners-roseanne-death-explained-opioid-overdose/", "text": "Just hours after the series premiere of ABC’s The Conners, showrunner Bruce Helford is opening up about why he chose to — spoiler alert! — kill off the character of Roseanne Conner. The Conners: 5 MIA Roseanne Characters' Absences Explained\n\nIn Tuesday night’s debut, the Conner family was still in mourning three weeks after the death of its former matriarch. The family believed Roseanne had died of a heart attack, but a phone call from the coroner’s office revealed that she actually was felled by an opioid overdose, stemming from a prescription painkiller addiction she developed during last spring’s Roseanne revival.\n\nIn a column for The Hollywood Reporter, Helford (who was an executive producer on the original series and also served as co-showrunner on the revival) says that the decision to end Roseanne Conner’s life was to give the character as respectful a sendoff as possible, while also affording the series (and its titular family) the chance to evolve without her.\n\n“There was a lot of chatter in the ether about how we should explain Roseanne’s absence,” Helford says. “Should she have a sudden heart attack, a mental breakdown or go off into the sunset on a boat with her son Jerry Garcia? But back in the writers room, we firmly decided against anything cowardly or far-fetched, anything that would make the fierce matriarch of the Conners seem pathetic or debased.\n\n“After much discussion by all parties, it was decided that we would have to make her departure clearly permanent,” he continued. “On a personal note, Roseanne [Barr] helped launch my career, and while we had our disagreements… I wanted a respectful sendoff for her, too — one that was relevant and could inspire discussion for the greater good about the American working class, whose authentic problems are often ignored by broadcast television. If you watched the first episode, I hope you’ll agree we did that.”\n\nImmediately following Tuesday’s broadcast, Barr responded to her character’s death on Twitter. “I AIN’T DEAD, BITCHES!!!!” she exclaimed. She went on to release a joint statement with her rabbi, Shmuley Boteach, which in part read, “While we wish the very best for the cast and production crew of The Conners, all of whom are deeply dedicated to their craft and were Roseanne’s cherished colleagues, we regret that ABC chose to cancel Roseanne by killing off the Roseanne Conner character. That it was done through an opioid overdose lent an unnecessary grim and morbid dimension to an otherwise happy family show.”\n\nTVLine readers gave The Conners premiere an average grade of “B-,” with 67 percent saying they will keep watching.", "images": ["https://tvline.com/wp-content/uploads/2022/08/october-streaming-2022.jpg?w=280", "https://tvline.com/wp-content/uploads/2021/08/the-conners-missing-characters-from-roseanne.jpg?w=620", "https://www.sportico.com/wp-content/uploads/2022/03/transax-copy.jpg?resize=180,101", "https://www.indiewire.com/wp-content/uploads/2022/10/Margot-Robbie-Lady-Gaga.png?resize=180,101", "https://tvline.com/wp-content/themes/pmc-tvline-2014/library/images/follow_us_on_facebook_graphic.png", "https://secure-us.imrworldwide.com/cgi-bin/m?ci=us-203220h&cg=0&cc=1&ts=noscript", "https://tvline.com/wp-content/uploads/2018/10/roseanne-dead-opioid-overdose-the-conners.jpg?w=620", "https://deadline.com/wp-content/uploads/2022/10/the-origin-1.jpeg?resize=180,101", "https://tvline.com/wp-content/uploads/2018/10/roseanne-dead-opioid-overdose-the-conners.jpg?w=620&h=420&crop=1", "https://tvline.com/wp-content/uploads/2022/10/NCIS-Los-Angeles-Callen-Anna.jpg?w=619", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://tvline.com/wp-content/uploads/2022/10/chicago-pd.jpg?w=620", "https://tvline.com/wp-content/uploads/2022/10/agt-all-stars-sofia-vergara.jpg?w=620", "https://pixel.quantserve.com/pixel?a.1=p-60R-umvc0T-Cw&a.2=p-31f3D02tYU8zY", "https://variety.com/wp-content/uploads/2022/10/Dreaming-Dying.jpg?resize=180,101", "https://spy.com/wp-content/uploads/2022/10/Cooler-Master-MM712-Gaming-Mouse-Featured.jpg?resize=180,101", "https://tvline.com/wp-content/uploads/2022/10/good-omens-season-2-premiere-date.jpeg?w=1024", "https://tvline.com/wp-content/uploads/2022/10/blockbuster-poster-teaser-netflix.jpg?w=620"], "top_img": "https://tvline.com/wp-content/uploads/2018/10/roseanne-dead-opioid-overdose-the-conners.jpg?w=620", "keywords": [], "authors": ["Ryan Schwartz"], "canonical_link": "https://tvline.com/2018/10/17/the-conners-roseanne-death-explained-opioid-overdose/", "title": "The Conners Boss Wanted a 'Respectful Sendoff' That Will 'Inspire Discussion'; Roseanne Calls It 'Grim and Morbid'", "meta_data": {"HandheldFriendly": "True", "MobileOptimized": 320, "viewport": "width=device-width, initial-scale=1.0 maximum-scale=1, user-scalable=no", "p": {"domain_verify": "9ad238c78ee34da2d6d96a41981790d2"}, "description": "Roseanne's death explained: 'The Conners' showrunner Bruce Helford opens up about the decision to kill off the beloved character.", "news_keywords": "ABC, Bruce Helford, Roseanne Barr, The Conners", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=1377345661", "generator": "WordPress 6.0.2", "author": "Ryan Schwartz", "theme-color": "#fff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "TVLine", "application-name": "TVLine", "content_type": "Article", "post_id": 992008, "title": "<i>The Conners</i> Boss Wanted a 'Respectful Sendoff' That Will 'Inspire Discussion'; Roseanne Calls It 'Grim and Morbid'", "published_at": "2018-10-17 07:14:17", "image": "https://tvline.com/wp-content/uploads/2018/10/roseanne-dead-opioid-overdose-the-conners.jpg?w=300&h=208&crop=1", "comment_count": 42, "tags": "The Conners", "topics": "News", "body": "Just hours after the series premiere of ABC's The Conners, showrunner Bruce Helford is opening up about why he chose to — spoiler alert! — kill off the character of Roseanne Conner. \r\n\r\nIn Tuesday night's debut, the Conner family was still in mourning three weeks after the death of its former matriarch. The family believed Roseanne had died of a heart attack, but a phone call from the coroner's office revealed that she actually was felled by an opioid overdose, stemming from a prescription painkiller addiction she developed during last spring's Roseanne revival.\r\n\r\nIn a column for The Hollywood Reporter, Helford (who was an executive producer on the original series and also served as co-showrunner on the revival) says that the decision to end Roseanne Conner's life was to give the character as respectful a sendoff as possible, while also affording the series (and its titular family) the chance to evolve without her.\r\n\r\n\"There was a lot of chatter in the ether about how we should explain Roseanne's absence,\" Helford says. \"Should she have a sudden heart attack, a mental breakdown or go off into the sunset on a boat with her son Jerry Garcia? But back in the writers room, we firmly decided against anything cowardly or far-fetched, anything that would make the fierce matriarch of the Conners seem pathetic or debased.\r\n\r\n\"After much discussion by all parties, it was decided that we would have to make her departure clearly permanent,\" he continued. \"On a personal note, Roseanne [Barr] helped launch my career, and while we had our disagreements... I wanted a respectful sendoff for her, too — one that was relevant and could inspire discussion for the greater good about the American working class, whose authentic problems are often ignored by broadcast television. If you watched the first episode, I hope you'll agree we did that.\"\r\n\r\nImmediately following Tuesday's broadcast, Barr responded to her character's death on Twitter. \"I AIN’T DEAD, BITCHES!!!!\" she exclaimed. She went on to release a joint statement with her rabbi, Shmuley Boteach, which in part read, \"While we wish the very best for the cast and production crew of The Conners, all of whom are deeply dedicated to their craft and were Roseanne's cherished colleagues, we regret that ABC chose to cancel Roseanne by killing off the Roseanne Conner character. That it was done through an opioid overdose lent an unnecessary grim and morbid dimension to an otherwise happy family show.\"\r\n\r\nTVLine readers gave The Conners premiere an average grade of \"B-,\" with 67 percent saying they will keep watching.", "fb": {"pages": 187516444593639}, "ia": {"markup_url_dev": "https://tvline.com/2018/10/17/the-conners-roseanne-death-explained-opioid-overdose/?ia_markup=1"}, "fragment": "!", "og": {"type": "article", "title": "The Conners Boss Wanted a 'Respectful Sendoff' That Will 'Inspire Discussion'; Roseanne Calls It 'Grim and Morbid'", "url": "https://tvline.com/2018/10/17/the-conners-roseanne-death-explained-opioid-overdose/", "description": "Just hours after the series premiere of ABC’s The Conners, showrunner Bruce Helford is opening up about why he chose to", "site_name": "TVLine", "image": {"identifier": "https://tvline.com/wp-content/uploads/2018/10/roseanne-dead-opioid-overdose-the-conners.jpg?w=620", "width": 620, "height": 420, "alt": "roseanne dead opioid overdose the conners"}, "locale": "en_US"}, "article": {"published_time": "2018-10-17T14:14:17+00:00", "modified_time": "2021-08-07T03:58:10+00:00"}, "twitter": {"site": "@TVLine", "creator": "@RyanSchwartz", "card": "summary_large_image", "title": "The Conners Boss Wanted a 'Respectful Sendoff' That Will 'Inspire Discussion'; Roseanne Calls It 'Grim and Morbid'", "description": "Roseanne's death explained: 'The Conners' showrunner Bruce Helford opens up about the decision to kill off the beloved character.", "image": "https://tvline.com/wp-content/uploads/2018/10/roseanne-dead-opioid-overdose-the-conners.jpg?w=620"}, "msapplication-TileImage": "https://tvline.com/wp-content/uploads/2018/06/logo-tvline.png?w=270"}, "movies": [], "publish_date": 1539730800.0, "source": "https://tvline.com", "summary": ""}