{"url": "https://en.wikipedia.org/wiki/Downton_Abbey_(film)", "text": "2019 historical drama film directed by Michael Engler\n\nDownton Abbey is a 2019 historical drama film written by Julian Fellowes, series creator and writer of the television series of the same name,[7] and directed by Michael Engler. The film is produced by Carnival Films and Perfect World Pictures, and it continues the storyline from the series, with much of the original cast returning.[8] The film, set in 1927, depicts a royal visit to the Crawley family's stately home in Yorkshire. As royal staff members descend on Downton, an assassin has also arrived and attempts to kill the monarch. The Crawleys and their servants are pitted against the royal entourage, including the Queen's lady-in-waiting, who has fallen out with the Crawley family, especially the Dowager Countess, over an inheritance issue.\n\nGareth Neame and Fellowes started planning a feature adaptation in 2016, shortly after the series ended. It was officially confirmed in July 2018 and filming began later that month, lasting through to November. The film was released in the United Kingdom on 13 September 2019 by Universal Pictures, and in the United States on 20 September 2019 by Focus Features.[9] It received generally positive reviews from critics and grossed $194 million worldwide. A sequel, Downton Abbey: A New Era, was released in the United Kingdom on 29 April 2022.\n\nPlot [ edit ]\n\nIn 1927, the Crawleys receive word that King George V (Jones) and Queen Mary (James) intend to visit Downton during their royal tour of Yorkshire, exciting both the family and the staff. As the servants begin preparations, Lady Mary (Dockery) feels that Barrow (James-Collier) is ill-equipped to manage such an important event and thus recruits Carson (Carter) to briefly exit retirement in order to assist, much to Barrow's chagrin. When the boiler breaks down, a repairman shows up and seems to be flirting with Daisy (McShera), making Andy (Fox) jealous. Shortly thereafter, members of the royal staff begin to arrive at Downton in advance of the King and Queen themselves. While Richard Ellis (Brown), the King's valet, treats the Downton staff kindly, the rest of the entourage are arrogant and rude, making it clear that the royal staff intends to supplant that of Downton for the duration of the visit. In addition, small items keep disappearing from the house.\n\nBertie and Edith Pelham, Lord and Lady Hexham (Hadden-Paton and Carmichael) arrive the day before the royal couple is due to visit. Later that evening, chairs for the parade seating are delivered during heavy rain, and Lady Mary leads a messy group effort to position the chairs for the next day. The weather clears and the King and Queen arrive at Downton, where they are introduced to the Crawley family. Violet (Smith) exchanges cold pleasantries with the Queen's lady-in-waiting Maud (Staunton), who is Robert's (Bonneville) first cousin once removed, and Tom (Leech) meets her maid Lucy Smith (Middleton). Violet begrudges Maud for her decision to bequeath her estate to Lucy rather than to Robert.\n\nMeanwhile, in the village, Tom encounters a mysterious man identifying himself as Major Chetwode (Moore), whom Tom initially believes is assessing security ahead of the royal visit and parade. Later, when the parade is set to begin, Chetwode prepares to assassinate the King in the staging area but is thwarted by Tom, whom he mistakenly believed was an ally because of their shared Irish origins, and Lady Mary, who disarms him after Tom pins him to the ground. After the parade, Tom encounters a woman sobbing on Downton's lawn. Unbeknownst to him, the woman is Princess Mary (Phillips). She laments her failing marriage, but Tom lifts her spirits and ultimately motivates her to remain with her husband.\n\nAnna (Froggatt) and Mr. Bates (Coyle) rally the Downton staff into retaking control of Downton's operations while the royal couple is still visiting. Barrow and Ellis trick Mr. Wilson (Haig), the Page of the Backstairs, into ordering some of the royal staff to return home to London early. Anna slips a strong sedative into the tea of the royal chef, Monsieur Courbet (Spall), and Wilson himself is \"accidentally\" locked in his room. Anna has surmised that Miss Lawton (Lynch), the Queen's dresser, is stealing the house's items and leverages her knowledge of Lawton's crimes to compel her to alter a gown for Lady Hexham. Then the Downton staff, with the assistance of Mr Molesley (Doyle) and Albert (Watson), manage the dinner that marks the end of the royal visit. The revised menu elicits high praise from the King, which in turn prompts Molesley to break protocol and announce that it was the Downton staff, not the royal staff, that produced it.\n\nThat evening, Barrow and Ellis make a trip to York. Ellis visits his parents, while Barrow waits for him at a pub. A man at the pub invites Barrow to an underground gay nightclub, but shortly after their arrival there, police raid the venue and arrest the attendees. Ellis, also a closeted gay man, soon learns what happened and uses his position in the royal household to get Barrow released from police custody. Isobel (Wilton) deduces that Lucy is Maud's illegitimate daughter, which is why she stands to inherit Maud's estate. Isobel challenges Maud to explain the situation to Violet.\n\nThe next morning, Henry (Goode) returns home after traveling abroad and joins the Crawleys at Harewood House, along with the royal family. During the ball that evening at Harewood, Princess Mary informs her parents that Tom helped save her marriage by convincing her to remain with her husband, and she encourages the King to speak with Tom. He approaches Tom and expresses gratitude, also implying that he's aware of Tom's role in thwarting the assassination attempt at the parade.\n\nThe King releases Bertie from his obligation to join the Prince of Wales on a three-month tour of Africa, which the King had requested earlier in the visit. Bertie had initially accepted the commitment, but he later wished to back out of the trip after learning of Edith's pregnancy. Thanks to Cora (McGovern) and the Queen's intervention, the King had a change of heart and rescinded his request. Meanwhile, Maud privately confesses to Violet that Lucy is her daughter, which is why she made Lucy her heir instead of Robert. Violet finally understands the situation, and the two reconcile. Violet then begins plotting to keep Maud's estate in the Crawley family in the future through a union of Tom and Lucy, as she had taken notice of the pair's budding romance earlier.\n\nFinally, Lady Mary quietly asks Violet about her visit to London. Violet informs her that she had gone for a doctor's visit, during which she learned that she may not have long to live. Mary is distraught, but Violet assures her that Downton and its legacy are safe in Mary's hands. As this conversation continues, Tom finds Lucy on the terrace, and the two dance in the dark while listening to the music played inside at the ball.\n\nCast [ edit ]\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nThe original television series, Downton Abbey, ended in 2015, after 52 episodes[10][11][12] with its final episode set at New Year's Eve, 1925.[13] In April 2016, it was revealed that a film adaptation was being considered,[14] with Julian Fellowes working on an outline plot.[15] A script was distributed to original cast members early in 2017.[16][17]\n\nOn 13 July 2018, the producers confirmed that a feature-length film would be made,[18] with production commencing mid-2018.[19][12] The script was written by Fellowes. The producers are Gareth Neame, Liz Trubridge and Fellowes.[20] The film is distributed by Focus Features and Universal Pictures International.[21] In late August 2018, it was reported that Brian Percival had stepped down as director and Michael Engler took on this job. Percival, in addition to Nigel Marchant, would be an executive producer.[22][23]\n\nThe plot of the film is based on an actual trip by the British royals to Wentworth Woodhouse in 1912 in order to demonstrate the importance of the monarchy. The estate itself was used as part of the shooting locations because of the story's link to that history.[24]\n\nCasting [ edit ]\n\nOriginal cast members including Hugh Bonneville, Elizabeth McGovern, Michelle Dockery, Laura Carmichael and Maggie Smith, were confirmed to return as their characters from the series,[20][25] with Joanne Froggatt confirming her involvement in a separate announcement.[26] Lily James, who played Lady Rose MacClare, stated she would not be reprising her role for the film,[27][28] as did Ed Speleers who played footman Jimmy Kent.[29]\n\nAn August 2018 announcement indicated that newcomers Imelda Staunton, Geraldine James, Tuppence Middleton, Simon Jones, David Haig, Kate Phillips, and Stephen Campbell Moore would be among the cast of the film.[23] The producers told the news media that Simon Jones and Geraldine James play the King and Queen, respectively (although not shown in the trailer), while David Haig appears as the King's butler (The Page of the Back Stairs).[30]\n\nIn September 2018, it was confirmed that Matthew Goode, who played Lady Mary's husband Henry Talbot in the final series, appears only briefly due to other commitments,[31] while Jim Carter, Brendan Coyle, Kevin Doyle, Harry Hadden-Paton, Rob James-Collier, Allen Leech, Phyllis Logan, Sophie McShera, Lesley Nicol and Penelope Wilton were confirmed to be reprising their respective roles, with Max Brown joining in a new, undisclosed role.[32][33]\n\nCostumes [ edit ]\n\nCostumes were designed by Anna Mary Scott Robbins working with John Bright of the costume company COSPROP in London, which specialises in historic, period costumes.[34] The company has some of Queen Mary's real wardrobe, studied for details of construction.[34] Geraldine James' Queen Mary costume was constructed using material from one of the Queen's actual dresses.[34] During the Ball scene, both Michelle Dockery and Elizabeth McGovern wore vintage dresses that were embellished with additional work. Dockery's beaded French gown had beads lengthened to the floor by hand. While Michelle Dockery wears Swarovski crystals in her tiara, Maggie Smith's is a 19th-century platinum piece[34] from Bentley & Skinner of Piccadilly jewellers by Royal appointment[35] with 16.5 carats of diamonds. Smith's ball gown was found in a vintage shop in Paris and dye was used to alter the turquoise colour to lilac.[34]\n\nFilming [ edit ]\n\nPrincipal photography started in London in late August 2018.[36][23] By 20 September, some filming was under way at Highclere Castle, Hampshire, which had been the main location for the television series.[37][38] Also in September, filming was under way in Lacock, Wiltshire, with Dame Maggie Smith, Hugh Bonneville, Elizabeth McGovern and Michelle Dockery as well as two new cast members, Imelda Staunton (wife of Jim Carter) and Geraldine James; scenes shot in Lacock included a celebration with horses from the Royal Artillery.[39] Exterior scenes set in York were filmed on location at Beamish Museum, complete with operational trams.[40] The Heritage Railways scenes were filmed on the North Yorkshire Moors Railway with Pickering terminus representing Kings Cross. The Royal Mail Sorting Office Coach was borrowed from the Great Central Railway at Loughborough. Production additionally occurred at Shepperton Studios.[41] Filming concluded in November 2018.[42]\n\nSoundtrack [ edit ]\n\nDownton Abbey: Original Motion Picture Soundtrack is the film's soundtrack album and musical score album of the same name, composed by John Lunn, conducted and orchestrated by Alastair King, edited by Mark Willsher and performed by The Chamber Orchestra of London with additional music composed by Chris Egan and prepared by Tristan Noon, while the music for the film's trailer was composed by David James Rosen. It was released on 13 September 2019 on CD, digital download and vinyl by Decca Gold, Decca Records and Universal Music Canada.\n\nAll music is composed by John Lunn. No. Title Length 1. \"A Royal Command\" 4:49 2. \"Pillar of the Establishment\" 1:48 3. \"Gleam and Sparkle\" 2:48 4. \"God Is a Monarchist\" 3:02 5. \"Two Households\" 5:00 6. \"Incident at a Parade\" 2:57 7. \"Sabotage\" 3:33 8. \"Maud\" 1:28 9. \"Honour Restored\" 2:39 10. \"Never Seen Anything Like It\" 2:27 11. \"Not Entirely a Bad Night\" 2:59 12. \"May I?\" 3:08 13. \"Taking Leave\" 2:26 14. \"Resolution\" 2:15 15. \"You Are the Best of Me\" 2:44 16. \"Sunset Waltz\" 3:51 17. \"One Hundred Years of Downton\" 5:13 Total length: 53:07\n\nRelease [ edit ]\n\nA companion book and guide to the feature film was available for pre-orders as early as August 2019 to be published on 17 September,[43] that is a behind the scenes look at the film production.[44][45] The film was released in Australia on 12 September 2019, in the United Kingdom on 13 September 2019, and in the United States on 20 September 2019.[46] It premiered at Leicester Square on 9 September 2019.[47]\n\nBox office [ edit ]\n\nDownton Abbey grossed $96.9 million in the United States and Canada, and $97.4 million in other territories, for a worldwide total of $194.2 million.[5][6] Deadline Hollywood calculated the net profit of the film to be $88 million, when factoring together all expenses and revenues.[48]\n\nSeveral weeks before its release in the United States, Fandango announced Downton Abbey's first day advance ticket sales were pacing ahead of all other adult dramas in 2019, including Once Upon a Time in Hollywood ($41.1 million debut that July).[49][50] A week prior to its release the film held advanced screenings, where it made $2.2 million.[51] Overall, it was originally projected to gross $16–25 million from 3,076 theaters in its opening weekend.[3] After making $13.8 million on its first day, including $2.1 million from Thursday night previews, estimates were raised to $31 million. It went on to debut to $31 million, topping the box office and marking the largest opening in Focus Features' history.[4] The film made $14.5 million in its second weekend, finishing second behind newcomer Abominable, then $7.9 million in its third, finishing third.[52][53]\n\nReception [ edit ]\n\nCritical response [ edit ]\n\nAt the review aggregator website Rotten Tomatoes, the film holds an approval rating of 84% based on 254 reviews, with an average rating of 6.9/10. The website's critics consensus reads: \"Downton Abbey distills many of the ingredients that made the show an enduring favorite, welcoming fans back for a fittingly resplendent homecoming.\"[54] On Metacritic the film has a weighted average score of 64 out of 100, based on reviews from 42 critics, indicating \"generally favorable reviews\".[55] Audiences polled by CinemaScore gave the film an average grade of \"A\" on an A+ to F scale, while those at PostTrak gave it an average 4.5 out of 5 stars and a 72% \"definite recommend\".[4]\n\nJune Thomas writing for Slate praised the film, writing: \"The plot of the Downton Abbey movie is brilliant, not so much because it is surprising, but because it allows every member of the cast to do what we expect of them\".[56] In a more lukewarm reaction, Peter Bradshaw, writing for The Guardian, said: \"The Downton Abbey movie is not as spectacularly star-studded as Gosford Park, but it's got its share of A-list talent, however: Maggie Smith, of course, as the dowager Countess of Grantham, Hugh Bonneville as Lord Grantham (absent-mindedly fondling his retriever at breakfast) – there's also Imelda Staunton in a new role and Jim Carter as the beetle-browed former butler Mr Carson. All are very underused\".[57]\n\nWriting in the British publication Radio Times, Eleanor Bley Griffiths writes that Downton the film is \"frankly disappointing\". She explains that \"What the film lacks is any sense of real jeopardy. As we found out from the trailer, the big plot-line is this: the King and Queen are coming to dinner and Downton must be made perfect! But that simple story is stretched out to a full two hours of incredibly low-stakes, predictable drama with an overabundance of sub-plots\". Griffiths goes on to unfavourably compare the new film with the TV series: \"On TV, there was time to explore different threads and highlight specific characters as the series went on; but the movie gives us a whole series-worth of storylines draped over one lacklustre main plot\".[58]\n\nPopular culture [ edit ]\n\nThe cast and crew were featured in a short interview segment on PBS public television on 20 September 2019, as recognition of the influence which the film and related series have had on American popular culture.[59]\n\nAccolades [ edit ]\n\nSequel [ edit ]\n\nAfter the release of the film, the creator Julian Fellowes and the cast stated that they already had ideas about producing a sequel.[60]\n\nIt was announced on 19 April 2021 that the sequel, titled Downton Abbey: A New Era, was already in production, with the entire cast set to return, alongside new arrivals Hugh Dancy, Laura Haddock, Nathalie Baye and Dominic West. Engler did not return as director, with Simon Curtis replacing him. It was released on 29 April 2022.[61]\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/12px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Highclere_Castle_%28April_2011%29.jpg/330px-Highclere_Castle_%28April_2011%29.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/8/8c/DowntonAbbey2019Poster.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/b/bf/DowntonAbbeyOMPS.jpg/220px-DowntonAbbeyOMPS.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/8/8c/DowntonAbbey2019Poster.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Downton_Abbey_(film)", "title": "Downton Abbey (film)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/8/8c/DowntonAbbey2019Poster.jpg", "width": 640, "height": 948}, "title": "Downton Abbey (film) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}