{"url": "https://www.huffingtonpost.com/entry/the-bold-type-creator-on-tackling-sexual-assault-in-the-shows-hopeful-finale_us_59aef2b8e4b0dfaafcf33abc", "text": "Jane (middle) and Kat (right) interview Mia Lawrence during \"The Bold Type's\" season finale. Freeform\n\nWarning: Spoilers ahead for the season finale of Freeform’s “The Bold Type.”\n\n“The Bold Type,” Freeform’s fresh, deeply hopeful show about three women in their mid-20s trying to make it in the insane world of New York media, closed out its first season Tuesday night. (If you have yet to give the show a try, you should. It’s sweeter, deeper and more engaging than the original teasers might have let on.)\n\nThe series centers around three women who work at Scarlet Magazine ― a thinly veiled fictional version of Cosmopolitan ― and their boss, the ethereal Jacqueline. (Former Cosmo Editor-in-Chief Joanna Coles is an executive producer on the show.) There’s Jane (Katie Stevens), a budding political reporter; Kat (Aisha Dee), Scarlet’s Social Media Director; and Sutton (Meghann Fahy), an executive assistant who finally gets her shot at working in the fashion department.\n\nAdvertisement\n\nDuring the show’s finale, Jane is tasked with covering Mia Lawrence, a performance artist and activist who has staged a performance piece in Central Park. Mia carries two physical weights in the shape of scales, meant to represent the metaphorical weight she carries in the wake of being sexually assaulted. Other survivors can come up to her and relieve her of her physical burden for a period of time. (The piece featured in “The Bold Type” is intentionally similar to Columbia student Emma Sulkowicz’s “Carry that Weight,” in which she carried her mattress around campus between September 2014 and May 2015. Sulkowicz said she would stop the endurance performance when her alleged rapist was removed from or left the university. She carried that mattress, with the help of other students, all the way until graduation.)\n\nThe finale’s climax comes after Jane has made the decision to leave Scarlet. She visits Mia in the park, and though she cannot carry her weight, she stands near her in solidarity. Eventually, Kat and Sutton join her. And finally, Jacqueline arrives, stepping up to reveal that she shares the label of “survivor” with Mia ― and the weight that comes along with that experience. It’s a beautiful image of five women standing with and for each other, made even more touching by the fact that it’s set to singer MILCK’s “Quiet,” an (unofficial) viral anthem of the Women’s March. (See below.)\n\nAdvertisement\n\n“The Bold Type” isn’t really about Big Messages ― it’s more focused on the arguably smaller interpersonal dynamics between the women at its center ― but the writers also don’t shy away from acknowledging the world that “The Bold Type” is set in. After all, these women live in New York City and work for a news organization in 2017: They report on sexism in politics and climate change policy and the BRCA gene; they have friends and lovers of varying sexual identities and races and countries of origin; they talk about how annoying it is when President Trump causes massive traffic jams. And in the final episode of the season, the women grapple with what it means to survive and thrive in the face of traumas, both big and small.\n\nDuring a time when every day feels like an episode of the worst reality TV show you can imagine, “The Bold Type” provides a welcome antidote. You don’t escape reality when you immerse yourself in Jane and Kat and Sutton’s lives, but you see a kinder version of it. This hopefulness extends to the way the show chose to approach a topic as complex and dark as sexual violence, and the healing process survivors are forced to face.\n\nAs “The Bold Type” creator Sarah Watson put it to HuffPost: “We always wanted to have an element of wish fulfillment.”\n\nHuffPost spoke with Watson, who wrote the moving finale episode, about the choice to build the finale around such a weighty (no pun intended) storyline, as well as the future of the show.\n\nHuffPost: I really loved episode 10, “Carry the Weight” ― I got a bit weepy at times. At what point did you decide to craft the finale around this subplot of sexual assault and survivor-hood?\n\nAdvertisement\n\nSarah Watson: We didn’t know it was gonna be the finale, but we knew very early in the season that this was a story that we wanted to do. In the first couple weeks in the writer’s room, we started talking about all the girls, and started to think of experiences that they were gonna have as women in their 20s, coming up the ladder in the magazine world. We just started talking about how the experiences you have in your 20s really shape you. And then [we] started talking about Jacqueline ― we started talking about how we’re not gonna be telling as many stories like that in her present, but what was it like for her when she was coming up in the magazine industry? And we discussed how different things were then; that it was tougher to be a woman back then.\n\nEven 20 years ago, it was just so much harder to talk about stories [of sexual assault], because [media] was definitely a male-dominated industry. Women didn’t feel that they could come forward. And so, we knew very early that, that’s something we wanted to be a backstory for Jacqueline. I brought Melora [Hardin, who plays Jacqueline] in to talk about her character because I wanted her to know all season long that that was something in the character’s past.\n\nWhat was the significance of having Jacqueline come out as a survivor of sexual assault?\n\nThe whole season, Jacqueline is a bit of a mystery. We don’t know much about her, other than in episode six when Jane explodes on her and Jacqueline invites her into her home. We wanted this woman to be a bit of a mystery. So, it just felt like the right place to talk about this big experience that obviously shaped her.\n\nDid you consult with any sexual assault advocacy organizations to make sure that you were telling this story in a way that was responsible?\n\nAbsolutely. I spoke [with representatives from] Break The Cycle. With a storyline like this, especially when I’m writing about something that is not my personal experience, I wanted to make sure that I got it right. Obviously, in writing this episode, I’m not speaking for all women who have been through [sexual assault], but I wanted to make sure we were sensitive and making the story as accurate as possible.\n\nAdvertisement\n\n“Carry the Weight,” the title of this episode, is deeply reminiscent of artist and former Columbia student Emma Sulkowicz’s 2014 project, “Carry that Weight.” I assume that’s kind of where you got the inspiration for the performance art piece featured in the show?\n\nOh yeah. I was definitely inspired by Emma Sulkowicz. I just thought there was something so brave and moving about [what she did]. It was a little more organic when women stepped in to help her carry her mattress, and I just thought there was something so beautiful about [how] this generation steps up and helps each other. Jacqueline had been carrying this weight personally and alone for so long, so to see this new generation step up and really be there to support each other, I thought that was such a beautiful image.\n\nDid Emma Sulkowicz know that this episode is coming? Did you reach out to her at all?\n\nNo, we didn’t. Two of the women I spoke to when we were researching the storyline do know her. I don’t know if they told her or not.\n\nJacqueline and Jane chat at a Scarlet party during the finale episode of \"The Bold Type.\" Freeform\n\nIn the episode, Jacqueline’s personal experience and trauma plays into the way that she responds to assigning these kind of stories. I found that particularly interesting as someone who works in the women’s media space, because it’s both a privilege and emotionally exhausting to cover stories as a women about women’s trauma, all the time.\n\nAdvertisement\n\nIt’s such a double-edged sword because I think for young journalists, and also as a writer telling fictional versions, there’s something exciting about telling these big, weighty stories but there’s also something very scary about it. And it is a tremendous responsibility. And Jane, this sort of younger reporter, isn’t able to see yet what a tremendous responsibility that is. But I also think it was a little bit unfair that Jacqueline didn’t let Jane do this story on Mia Lawrence right away. Jacqueline was bringing personal experience to it, which is something I think she realizes in the arc of the episode.\n\nOne of the final scenes ― when the four women (Jane, Kat, Sutton and Jacqueline) are all standing together with Mia in Central Park ― was set to MILCK’s “Quiet.” That’s a song that went viral after it was performed by a group of women at the Women’s March. Was that intentional?\n\nSo, that came from our music supervisor, Ronald Lowry. He read the script and emailed me right away. First of all, I think he said, “as soon as I’m done sobbing, I want to pitch a song to you.” And I did not know about the song’s connection to the Women’s March, which adds an even more beautiful and complex layer. As soon as we shot that scene, our music editor mixed it to that song and it was just beautiful and perfect.\n\nWhat do you hope that survivors of sexual assault who watch this finale take from it?\n\nI could never put myself in their position and I know that every women who is a survivor is gonna have a different reaction to [the episode]. I just hope they feel less alone. That’s what the “carry the weight” message is ― we’re all in this together. Women who are not survivors can still be there. That moment when Jane and Sutton and Kat [who are not survivors] all show up and stand with Mia. We can be there too.\n\nThroughout the whole season, “The Bold Type” has consistently taken cues from real-life stories, from media layoffs to Instagram’s nudity policy, to Adena’s rough experiences with U.S. immigration. Did you always plan to integrate, for lack of a better term, “ripped from the headlines” storytelling?\n\nAdvertisement\n\nIt was never a super conscious thing. I just think the nature of them being at a magazine lends itself to that. I wrote on “Parenthood” for six years and our joke was always that “Law and Order” did ripped-from-the-headlines, and we did ripped-from-our-real-lives. And so, on “The Bold Type,” I think it started from us talking about our experiences, and then us talking about the experiences of the women who were actually working at Cosmo. It just felt right to tell these real and grounded stories of what it’s really like to work in a magazine in 2017.\n\nAnd especially given the moment that we’re in, those crossovers might be more apparent. The Trump clogging up traffic in New York jokes hit close to home.\n\nOh yeah, are you in New York right now?\n\nYeah, I am.\n\nSo, I had stayed at a hotel just a couple blocks from Trump Tower right before we started the writers room and I was there the day that Kanye visited Trump and you just couldn’t go anywhere. And I just thought, “Oh my gosh we have to play the reality of what it’s like to be New Yorker when the President comes to town.”\n\nYeah, and I think no one is angrier than New Yorkers when Trump comes back home. I also enjoy that the show manages to strike a balance between delving into these deeper, darker news-based issues, while still being genuinely fun to watch and lighthearted. Did you have conversations in the writers room about how to strike that balance?\n\nWe for sure wanted the show to feel very hopeful. So, we always wanted to have an element of wish fulfillment. I think “Friday Night Lights” had it beautifully. Every episode had a character going through something huge and weighty, but at the same time you left those episodes feeling good and feeling like, with your friends, and with coach and family you can face it all together. So, I always wanted to have this feeling of, even though we’re going through these things, we’re all in it together and every story should be approached from this feeling of hopefulness and the feeling that we’re all gonna be OK.\n\nAdvertisement\n\nKat, Sutton and Jane. Freeform\n\nDo you consider “The Bold Type” to be a feminist show?\n\nDefinitely. It’s women supporting women. You know, there’s so much attention right now on defining feminism and who’s a feminist and what’s feminist. And to me, it’s just women supporting women, which is absolutely what this show is.\n\nWhat does that label mean to you when you’re writing a TV show? Does it create an extra responsibility in the way that you’re putting the show together, especially given the tumultuous political moment that we’re in?\n\nYou know, I try to not think about it because once you feel that extra responsibility, I feel like it’s very easy to go to this preachy, pandering place and I never want the show to go to that. I always want it to feel like it’s from a place of reality. So, just in everything we write, all the writers, we just try to approach it from a place of character and a place realness.\n\nI wanted to show what women’s friendships can be, because I feel like so often on TV, we have shows that are about women and their friendships, but drama always come from them turning on each other. And I wanted to show that we can face the drama together ’cause those are the kind of female friendships that I have. If the kind of female friendships that you have are your friends turning on you, go get new friends. And in the writers room, we actually jokingly refer to [the relationships on the show] as “friendship porn.” It’s like we’ve taken the real and grounded friendships and just added a little shine; made them a little stronger than reality.\n\nAdvertisement\n\nSo what can we expect from the show if you get a season two?\n\nOh my gosh. Ask me in a couple weeks. After I’ve had a moment to recover. Ask me when I get a season two. Part of me doesn’t even want to think about it because I don’t want to jinx it. Part of me just wants to lay around on the beach.", "images": ["https://img.huffingtonpost.com/asset/632b4c8d2300001c003c57cf.jpg?cache=5TSRWLiwuT&ops=92_92", "https://img.huffingtonpost.com/asset/63408fb92500003a004f7469.jpeg?ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/6340396f22000056006b45c3.jpeg?ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/634048f922000034006b45dd.jpg?ops=240_240", "https://img.huffingtonpost.com/asset/633fec47250000360079bea7.jpeg?cache=1MFuMDvaVF&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/59aef8b71b000028005b4a39.jpeg?ops=scalefit_720_noupscale", "https://img.huffingtonpost.com/asset/634032832600001f005b83be.jpg?cache=of3P4Ovoa9&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/63404c7b2500001f004f73fe.jpg?cache=lNas9Q4Wll&ops=240_240", "https://sb.scorecardresearch.com/p?c1=2&c2=6723616&c3=&c4=&c5=&c6=&c15=&cj=1", "https://img.huffingtonpost.com/asset/634007b2250000360079bec8.jpeg?ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/63414e5627000020007084dd.png?ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/59b02d9c1400001f00fa84b6.jpeg?ops=scalefit_720_noupscale", "https://img.huffingtonpost.com/asset/6340359b2600001a005b83c3.jpg?cache=WSbcF7Ea6S&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/634015ad2600001d00657edc.jpg?cache=HVoWVMuLmj&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/59aefaae1400002000fa81f5.jpeg?ops=scalefit_720_noupscale", "https://img.huffingtonpost.com/asset/6340585c2500003a004f7410.jpeg?cache=mGKk1tDjZH&ops=92_92", "https://img.huffingtonpost.com/asset/63404c7b2500001f004f73fe.jpg?cache=lNas9Q4Wll&ops=434_244%2Cquality_75", "https://www.facebook.com/tr?id=1112906175403201&ev=PageView&noscript=1", "https://img.huffingtonpost.com/asset/634051842600005f005b83ed.jpeg?ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/633ed0e024000031000a19ae.jpeg?ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/634007b2250000360079bec8.jpeg?ops=240_240", "https://img.huffingtonpost.com/asset/59af1d0a170000200028862c.jpeg?cache=YbMf7W7U6i&ops=1200_630", "https://img.huffingtonpost.com/asset/63406f692200002f006b4607.jpeg?cache=akEXLWRYSr&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/634082b82200002e006b4618.jpeg?cache=vKSrxpYsjm&ops=92_92", "https://img.huffingtonpost.com/asset/634136ec24000039001e50c5.png?cache=XAfWcVBqtK&ops=92_92", "https://img.huffingtonpost.com/asset/63402e432500003a004f73df.jpeg?cache=AdnbRabZJs&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/634048f922000034006b45dd.jpg?ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/5cacf4f424000030074f66b5.jpg?ops=100_100", "https://img.huffingtonpost.com/asset/633afcf62600001e007770fd.jpg?cache=b8W6udTaGF&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/634051842600005f005b83ed.jpeg?ops=92_92", "https://img.huffingtonpost.com/asset/633ff8ea2500005e004f73a4.jpeg?cache=Q1MOHMKJiH&ops=434_244%2Cquality_75", "https://img.huffingtonpost.com/asset/634032832600001f005b83be.jpg?cache=of3P4Ovoa9&ops=240_240", "https://img.huffingtonpost.com/asset/634155432500005f00aa33b4.jpg?cache=HCnGNCDvoe&ops=92_92"], "top_img": "https://img.huffingtonpost.com/asset/59af1d0a170000200028862c.jpeg?cache=YbMf7W7U6i&ops=1200_630", "keywords": [], "authors": ["Senior Women'S Reporter"], "canonical_link": "https://www.huffpost.com/entry/the-bold-type-creator-on-tackling-sexual-assault-in-the-shows-hopeful-finale_n_59aef2b8e4b0dfaafcf33abc", "title": "'The Bold Type' Creator On Tackling Sexual Assault In The Show's Hopeful Finale", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "description": "\"It’s just women supporting women.\"", "keywords": "Sex Crimes,Female Artists,The Bold Type", "fb": {"app_id": 238320442863988}, "og": {"title": "'The Bold Type' Creator On Tackling Sexual Assault In The Show's Hopeful Finale", "type": "article", "image": {"identifier": "https://img.huffingtonpost.com/asset/59af1d0a170000200028862c.jpeg?cache=YbMf7W7U6i&ops=1200_630", "url": "https://img.huffingtonpost.com/asset/59af1d0a170000200028862c.jpeg?cache=YbMf7W7U6i&ops=1200_630", "type": "https://img.huffingtonpost.com/asset/59af1d0a170000200028862c.jpeg?cache=YbMf7W7U6i&ops=1200_630", "width": 1200, "height": 630}, "url": "https://www.huffpost.com/entry/the-bold-type-creator-on-tackling-sexual-assault-in-the-shows-hopeful-finale_n_59aef2b8e4b0dfaafcf33abc", "site_name": "HuffPost UK", "locale": "en_GB", "description": "\"It’s just women supporting women.\""}, "article": {"tag": "Sex Crimes,Female Artists,The Bold Type", "section": "Women", "author": "https://www.facebook.com/emma.rose.gray.1", "published_time": "2017-09-06T18:44:50Z", "modified_time": "2017-09-06T18:44:50Z"}, "twitter": {"card": "summary_large_image", "site": "@HuffPostWomen", "title": "'The Bold Type' Creator On Tackling Sexual Assault In The Show's Hopeful Finale", "image": {"identifier": "https://img.huffingtonpost.com/asset/59af1d0a170000200028862c.jpeg?cache=YbMf7W7U6i&ops=1200_630", "width": 1200, "height": 630}, "description": "\"It’s just women supporting women.\"", "creator": "@emmaladyrose"}, "al": {"ios": {"url": "huffpostnews:///?editionID=uk&entryID=uk_59aef2b8e4b0dfaafcf33abc", "app_store_id": 306621789, "app_name": "HuffPost"}}, "sailthru.title": "'The Bold Type' Creator On Tackling Sexual Assault In The Show's Hopeful Finale", "sailthru.tags": "Sex Crimes,Female Artists,The Bold Type", "sailthru.image.thumb": "https://img.huffingtonpost.com/asset/59af1d0a170000200028862c.jpeg?cache=YbMf7W7U6i&ops=1200_630", "robots": "max-snippet:-1,max-image-preview:large,max-video-preview:-1", "google-site-verification": "SwSeLtSWlBL7BhzM0utZK77nXk0ojoWmrDJstoXkO9Q", "taboola.category": "women"}, "movies": ["https://www.youtube.com/embed/5M1WJ48_wac?rel=0&showinfo=0&enablejsapi=1"], "publish_date": 1504723490.0, "source": "https://www.huffingtonpost.com", "summary": ""}