{"url": "https://en.wikipedia.org/wiki/Daenerys_Targaryen", "text": "Character in A Song of Ice and Fire\n\nFictional character\n\nDaenerys Targaryen ( də-NAIR-iss tar-GAIR-ee-ən) is a fictional character in the series of epic fantasy novels A Song of Ice and Fire by American author George R. R. Martin, and the television adaptation Game of Thrones, portrayed by English actress Emilia Clarke. In the novels, she is a prominent point of view character. She is one of the series' most popular characters, and The New York Times cites her as one of the author's finest creations.[2]\n\nIntroduced in 1996's A Game of Thrones, Daenerys is one of the last surviving members (along with her older brother, Viserys) of House Targaryen which, until 14 years before the events of the first novel, had ruled Westeros from the Iron Throne for nearly 300 years before being ousted. She subsequently appeared in A Clash of Kings (1998) and A Storm of Swords (2000). Daenerys was one of a few prominent characters not included in 2005's A Feast for Crows, but returned in the next novel A Dance with Dragons (2011).[3][4]\n\nIn the story, Daenerys is in her early teens living in exile in Essos. She remains dependent on her abusive older brother, Viserys, and is forced to marry Dothraki horselord Khal Drogo in exchange for an army for Viserys, who wishes to return to Westeros and recapture the Iron Throne. Daenerys adapts to life with the Dothraki, and her character emerges as strong, confident and courageous. She becomes the heir of the Targaryen dynasty after her brother's murder and plans to reclaim the Iron Throne herself, seeing it as her birthright. A pregnant Daenerys loses her husband and child, but soon helps to hatch three dragons from their eggs. The dragons provide her with a tactical advantage and prestige. She also acquires an army of former slave soldiers with which she conquers the cities of Yunkai, Astapor and Meereen, determined to end slavery and injustice. Despite her strong moral compass, she can deal ruthlessly with her enemies, particularly slave masters. She establishes herself as a powerful and relentless ruler.\n\nHer character arc from heroic to villainous at the end of the HBO series has been a source of controversy with critics and fans. Clarke's portrayal of Daenerys in the series garnered Primetime Emmy Award nominations for Outstanding Supporting Actress in a Drama Series in 2013, 2015 and 2016 and Outstanding Lead Actress in a Drama Series in 2019. She has also earned many other nominations and accolades for her portrayal.\n\nCharacter description [ edit ]\n\nDaenerys Targaryen is the daughter of King Aerys II Targaryen (also referred to as \"The Mad King\") and his sister-wife Queen Rhaella, and is one of the last survivors of House Targaryen.[5] She serves as the third-person point-of-view character of 31 chapters of A Game of Thrones, A Clash of Kings, A Storm of Swords, and A Dance with Dragons.[6] This makes her the series' fourth most prominent narrative voice after Tyrion Lannister, Jon Snow and Arya Stark.[7]\n\nBackground [ edit ]\n\nThirteen years before the series' events (16 years in the television series), after her father and eldest brother Rhaegar were killed during Robert's rebellion, Daenerys was born during a great storm, earning her the nickname \"Stormborn\".[8] Her mother, Rhaella, died in childbirth, and the Master of Arms of the Red Keep, Ser Willem Darry whisked Daenerys and her older brother Viserys away to Braavos. Darry died when Daenerys was five years old, and she and Viserys spent the following years wandering the Free Cities.[5] By the beginning of A Game of Thrones, Daenerys and her brother have been a guest of Illyrio Mopatis in Pentos for half a year. Game of Thrones creators D. B. Weiss and David Benioff described Daenerys as a combination of Joan of Arc, Lawrence of Arabia and Napoleon.[9]\n\nAppearance and personality [ edit ]\n\nDaenerys is most often described as uncommonly beautiful, with long, pale silver-gold hair and purple eyes.[10][A] She is slender and pale, although taller than some of her female ancestors. Tales of Daenerys's beauty are numerous, and throughout the novels she encounters countless suitors who seek her hand in marriage, sometimes to gain control of her three dragons. She is fluent in the Common Tongue of Westeros, Dothraki, High Valyrian and bastard Valyrian, which she speaks with a Tyroshi accent.[12] Over the course of the first three novels she becomes fluent in the Dothraki language and Ghiscari, spoken in the slave cities in Essos.[13]\n\nDaenerys grew up in constant fear of being discovered and killed by agents of the Usurper King, Robert Baratheon. Her older brother Viserys frequently abused her, which led to the development of her fearful, submissive, and furtive nature. However, over the course of the narrative, Daenerys finds her inner strength and courage and emerges as a natural leader adored by her people. She is often described as honorable and compassionate, if somewhat naïve, although she can be harsh and vengeful against those who seek to harm her or her followers.[14]\n\nPaul Youll illustrated Daenerys on the cover of the July 1996 issue of Asimov's Science Fiction, which contained a Daenerys excerpt from A Game of Thrones entitled \"Blood of the Dragon\".[15] Other illustrators for the book series include John Picacio and Gary Gianni.[16]\n\nStorylines [ edit ]\n\nCoat of arms of House Targaryen\n\nA Game of Thrones [ edit ]\n\nIn A Game of Thrones (1996), Daenerys is sold by her brother Viserys and Illyrio Mopatis into a marriage with Khal Drogo, a Dothraki warlord for an army for Viserys. Daenerys befriends Jorah Mormont, an exiled Westerosi knight. At her wedding, she is given three petrified dragon eggs by Illyrio Mopatis. Although Daenerys is initially terrified of Drogo, their marriage grows into a happy union. She comes to love him and takes to Dothraki customs, finding strength for the first time, and she stands up to Viserys's attempts to bully her into coercing Drogo. When Viserys threatens her, Drogo kills him by pouring molten gold over his head. With Viserys dead, Daenerys sees herself as the heir to the Targaryen dynasty and responsible for reclaiming the throne for her family.\n\nLater, Drogo is wounded in a fight, and the cut festers. With Drogo ill, his warriors mutiny and abandon him. In desperation, Daenerys recruits an enslaved Lhazareen priestess, Mirri Maz Duur, to save Drogo with blood magic. Despite being saved by Daenerys from being raped by the tribe's warriors, however, the priestess betrays her and the magic ritual results in Daenerys's unborn child being stillborn and leaves Drogo in a catatonic state. Because Drogo will never recover, Daenerys smothers him with a pillow. She burns the priestess in Drogo's funeral pyre and climbs into the flames with her three dragon eggs. When the pyre dies out the following morning, Daenerys emerges from the ashes alive and unburned with three hatched dragons.[18][19]\n\nA Clash of Kings [ edit ]\n\nLeading the remnants of Drogo's khalasar through the Red Waste, Daenerys arrives in the city of Qarth. There, she unsuccessfully appeals to the rulers of the city for aid in reclaiming the Iron Throne. Daenerys accepts an invitation from a group of warlocks to discover her future. At their temple, the House of the Undying, Daenerys drinks a magical potion and enters.\n\nInside, she sees several visions and resists their temptations. When Daenerys enters the final hall and meets the real Undyings, she is told prophecies about her destiny as the \"child of three\" and advised that \"three fires must you light\", \"three mounts must you ride\", and \"three treasons will you know\"; they also tell her she is the \"daughter of death\", the \"slayer of lies\", and the \"bride of fire\". When the Undyings attack Daenerys and intend to hold her prisoner, Daenerys's dragon Drogon kills them and burns down the temple, allowing Daenerys to escape. Before departing Qarth, a venomous manticore nearly assassinates Daenerys. She is saved by Arstan Whitebeard, who has been sent by Illyrio Morpatis, along with the eunuch ex-gladiator called Strong Belwas and three ships to take Daenerys back to Pentos.[20][21]\n\nA Storm of Swords [ edit ]\n\nSeeking an army, Daenerys sails to Astapor in Slaver's Bay to purchase the Unsullied slave soldiers. She negotiates with Kraznys mo Nakloz, promising a dragon in payment, but she betrays the Good Masters and commands the Unsullied to kill the slavers. Daenerys frees the Unsullied and the slaves. She later conquers the city of Yunkai and gains the service of Daario Naharis, who commands a large mercenary company. As Daenerys marches on Meereen, she learns one of her companions is Barristan Selmy, a knight of Robert Baratheon's Kingsguard. Selmy informed Daenerys that Jorah was previously an informer. Disgusted, she sends the pair on a suicide mission to capture Meereen. When the mission is successful, Barristan asks to be forgiven for his deception, but Jorah refuses to ask forgiveness so Daenerys banishes him. Unwilling to abandon the slaves she freed, Daenerys decides to remain in Meereen as she fears they will return to bondage.[22][23]\n\nA Dance with Dragons [ edit ]\n\nThroughout A Dance with Dragons (2011), Daenerys struggles to maintain order in the city in the face of growing unrest as well as the chaos she left behind in the other cities she conquered. Furthermore, Yunkai has rebelled and is gathering forces to besiege Meereen. When Drogon kills a child, Daenerys feels compelled to chain her dragons Rhaegal and Viserion, but Drogon escapes. Her advisers suggest she marry Hizdahr zo Loraq to bring peace, and she agrees, although she takes Daario as a lover. Hizdahr successfully negotiates an end to the violence and Daenerys marries him. At her wedding feast, the blood and noise of the fighting pits attract Drogon, who is immediately attacked. Initially, Daenerys's attempt to control her dragon fails but she manages to climb atop of Drogon, who flies off with her. After several days in Drogon's lair, Daenerys becomes ill from some berries and begins to hallucinate. She is later found by Khal Jhaqo, formerly a captain of her Khalasar who betrayed her late husband.[24]\n\nFamily tree of House Targaryen [ edit ]\n\nTV adaptation [ edit ]\n\nCasting and development [ edit ]\n\nGame of Thrones A blue, scale-covered dress worn by Daenerys in the TV series\n\nMartin said the character was portrayed as older in the television series than her literary counterpart because of child pornography laws.[25] Tamzin Merchant played Daenerys in the pilot episode.[26] After receiving a negative reception at private viewings, HBO ordered the pilot to be reshot and recast.[27] Clarke was recast as Daenerys following an audition in 2010.[28] Weiss and Benioff said, \"Emilia was the only person we saw—and we saw hundreds—who could carry the full range that Daenerys required.\"[9]\n\nClarke said the role of Daenerys was \"not your typical bonnet duty that you have to go through as a young British actress\".[29] Reflecting on the character's evolution in the television series, she stated: \"Throughout the season she's had an insane transformation from someone who barely even spoke and timidly did everything her brother said into a mother of dragons and a queen of armies and a killer of slave masters. She's a very Joan of Arc-style character.\"[30] Clarke said she accepts appearing in nude scenes if \"a nude scene forwards a story or is shot in a way that adds insight into characters\".[31] She added that \"sometimes explicit scenes are required and make sense for the characters/story, as they do in Westeros\" and that she can discuss with a director how to make a gratuitously nude scene more subtle.[31] Clarke has used a body double in past background non-nude appearances, however, particularly Rosie Mac in season 5.[31]\n\nIn October 2014, Clarke and several other key cast members, all contracted for six seasons of the series, renegotiated their deals to include a potential seventh season and salary increases for seasons five, six, and seven.[32][33] The Hollywood Reporter called the raises \"huge\", noting the deal would make the performers \"among the highest-paid actors on cable TV\".[32] Deadline Hollywood put the cost for season five at \"close to $300,000 an episode\" for each actor,[33] and in June 2016, The Hollywood Reporter noted the performers would each be paid \"upward of $500,000 per episode\" for seasons seven and the potential eighth season.[34] In 2017, Clarke became one of the highest paid actors on television, earning between $1.2 and $2 million per episode.[B]\n\nStorylines [ edit ]\n\nSeason 1 [ edit ]\n\nDaenerys Targaryen is introduced as the exiled princess of the Targaryen dynasty. She and her brother Viserys were smuggled to Essos during the end of Robert's Rebellion. For most of her life, Daenerys has been under the care of Viserys, whom she fears, as he abuses her whenever she displeases him. Viserys marries Daenerys to the powerful Dothraki warlord Khal Drogo in exchange for his military support to retake the Iron Throne. Daenerys becomes a khaleesi. During the wedding, exiled knight Ser Jorah Mormont pledges his loyalty to Daenerys while her benefactor Illyrio Mopatis gifts her three petrified dragon eggs. Daenerys is afraid of her new husband initially, but after learning the Dothraki language, she begins to bond with Drogo and genuinely falls in love with him. Daenerys learns the ways of the Dothraki, strengthening her relationship with her nomadic tribe. She becomes pregnant by Drogo with her son, who is prophesied by the Dothraki to be the \"Stallion Who Mounts the World\". Viserys grows jealous of Daenerys's popularity and becomes infuriated with Drogo's lack of urgency in launching an invasion, prompting him to threaten to cut Daenerys's unborn son from her womb. Drogo responds by killing Viserys with molten gold. Daenerys declares he was no dragon because fire cannot kill a dragon.\n\nAfter an unsuccessful assassination attempt on behalf of Robert Baratheon, Drogo vows to Daenerys that he will conquer the Seven Kingdoms for her and their unborn son. However, during their journey, Drogo becomes comatose because of an infected wound incurred during a fight with one of his men. Daenerys desperately seeks the help of healer Mirri Maz Duur to save his life using blood magic. Mirri deceives Daenerys by using her unborn son's life as a sacrifice to heal Drogo but leaves him in a permanent catatonic state, forcing Daenerys to end her husband's life. Daenerys punishes Mirri by having her tied to Drogo's funeral pyre as she sets it alight. She also lays the three dragon eggs on Drogo's body and steps into the fire herself. At daybreak, after the fire has died out, Daenerys emerges with three baby dragons whom she names Drogon, Rhaegal, and Viserion.[37]\n\nSeason 2 [ edit ]\n\nDaenerys and the remnants of Drogo's khalasar wander the Red Waste before being accepted into the city of Qarth. The merchant, Xaro Xhoan Daxos, a member of Qarth's ruling council, the Thirteen, hosts her. Daenerys appeals unsuccessfully to the Thirteen to support her invasion of Westeros. She returns to Xaro's manse to find half of her men and servants slain and her dragons missing. Daenerys meets with the Thirteen again to ask for their help in retrieving her dragons. The warlock Pyat Pree claims responsibility and declares that her dragons are being kept in his temple, the House of the Undying. Daenerys travels to the temple, but Pree's magic separates her from Jorah and chains her to her dragons. She orders her dragons to immolate Pree. Daenerys confronts Xaro, who had conspired with Pree and Daenerys's servant Doreah to seize control of Qarth. She has Xaro and Doreah sealed in Xaro's vault and has her remaining loyalists raid his manse, using the funds they seize to buy a ship.[38]\n\nSeason 3 [ edit ]\n\nDaenerys travels to Astapor, a city in Slaver's Bay. As she arrives, the warlocks of Qarth attempt to assassinate her, but Ser Barristan Selmy, who was Kingsguard to Aerys Targaryen, thwarts them; Daenerys accepts him into her service. She negotiates with Astapori slaver Kraznys mo Nakloz to purchase an army of Unsullied, elite eunuch soldiers, in exchange for Drogon, and also obtains the services of Kraznys's translator Missandei. Upon completion of the transaction, she has Drogon burn Kraznys alive and orders the Unsullied to kill Astapor's masters and free the slaves. Daenerys and her army march on the neighboring slave city of Yunkai, which hires the sellsword company, the Second Sons, to defend it. The commanders of the Second Sons order their lieutenant, Daario Naharis, to kill Daenerys. Instead, Daario is smitten by her beauty and brings her the heads of his superiors, pledging the Second Sons' allegiance. Daario, Jorah, and the Unsullied commander Grey Worm infiltrate Yunkai, opening the gates for the Targaryen army to conquer the city. Daenerys is received by Yunkai's freed slaves, who hail her as their \"mhysa\" (mother).[39]\n\nSeason 4 [ edit ]\n\nDaenerys marches on the last city in Slaver's Bay, Meereen, and seizes control of it by instigating a slave revolt. She decides to execute 163 Meereenese masters as \"justice\" for 163 slave children crucified on the road to Meereen. Daenerys learns that her council in Astapor has been overthrown and that Yunkai has returned to slavery. Because of this, Daenerys remains in Meereen to practice ruling. She also begins a sexual relationship with Daario. After discovering that Jorah previously spied on her on House Baratheon's behalf, she is enraged and exiles him from the city. Daenerys is later horrified to discover that Drogon has killed a farmer's child. Although she cannot find Drogon, she has Rhaegal and Viserion locked up in Meereen's catacombs.[40]\n\nSeason 5 [ edit ]\n\nDaenerys faces a new threat to her rule in the form of the Sons of the Harpy, a resistance movement made of agitated former masters. Her popularity with the freedmen wanes after she publicly executes one of her councilors, Mossador, for killing a captive Son. After the Sons kill Ser Barristan, Daenerys decides she will attempt to restore peace by reopening Meereen's fighting pits and taking the Meereenese noble Hizdhar zo Loraq as her husband. While attending a gladiator demonstration, Jorah, who has brought her the fugitive Tyrion Lannister to appease her, confronts her. Daenerys accepts Tyrion onto her council but exiles Jorah again. At the reopening of the fighting pits, Jorah saves Daenerys's life by killing a Son of the Harpy trying to assassinate her. The Sons launch a massive attack, killing Hizdhar and many other Meereenese noblemen and freedmen. As the Sons corner Daenerys and her councilors, Drogon appears and defeats most of them. The Unsullied overwhelm the Sons, who were throwing spears at Drogon, prompting Daenerys to fly away on him. Drogon eventually leaves her in the Dothraki Sea, where she is captured by a khalasar.[41]\n\nSeason 6 [ edit ]\n\nDaenerys is taken to Khal Moro, the leader of the Dothraki horde. Learning that she is the widow of Khal Drogo, Moro tells her she must live out her days among the widows of the Dosh Khaleen in Vaes Dothrak. Once there, Daenerys is told the khals will judge her for defying tradition and going out into the world following Drogo's death. During the meeting with the khals, Daenerys declares only she has enough ambition to lead the Dothraki. The outraged khals threaten to gang-rape her, but Daenerys sets fire to the temple, killing everyone inside. She emerges unscathed. Awed, the Dothraki accept her as their Khaleesi. After discovering that Jorah, who had followed her to Vaes Dothrak with Daario, is infected with the terminal disease greyscale, Daenerys orders him to find a cure and return to her services. She marches on Meereen with Drogon, Daario and the Dothraki.\n\nDaenerys returns to Meereen to find it under siege by the joint fleets of Yunkai, Astapor and Volantis. They have reneged on an agreement with Tyrion to free their slaves and are trying to reclaim the city. Daenerys deploys her three dragons, burning most of the slaver fleet and seizing the ships that survive. The slavers agree to surrender. Soon after, Theon and Yara Greyjoy arrive. They offer the Iron Fleet in exchange for Daenerys giving the Iron Islands their independence and installing Yara as queen of the Iron Islands over their uncle Euron Greyjoy, who planned to marry Daenerys. Daenerys agrees to Theon and Yara's alliance. Meanwhile, Varys secures the support of Ellaria Sand and Olenna Tyrell, who have lost family members to the Lannisters and want vengeance. Daenerys leaves Daario and the Second Sons in Meereen to keep the peace, names Tyrion Lannister as Hand of the Queen and finally sets sail for Westeros.[42]\n\nSeason 7 [ edit ]\n\nDaenerys arrives at the island fortress of Dragonstone, the ancient Targaryen stronghold once held by the late Stannis Baratheon, and finds it abandoned. She sends the Unsullied to take Casterly Rock and sends Yara Greyjoy's ship fleet from Dorne to blockade King's Landing. However, the Lannister forces have left Casterly Rock and seized Highgarden and its wealth. Meanwhile, Euron overcomes his niece Yara's ships. To gain allies, Daenerys summons the newly named King in the North, Jon Snow, to pledge his fealty to her. Jon refuses, insisting that the Night King and his wight army present a threat to all of humanity. Receiving word of Highgarden's fall, Daenerys leads Drogon and the Dothraki to battle the Lannister caravan. Despite Drogon being injured in battle, Daenerys is victorious. The remaining forces submit to her, but a resistant Randyll and Dickon Tarly choose death rather than submitting. Daenerys executes them by dragonfire.\n\nJon and a cured Jorah lead an expedition beyond the Wall to capture a wight, which they will use to convince the self-declared Queen of Westeros, Cersei Lannister, that the threat is real. They end up surrounded by wights. Daenerys and her dragons come to their rescue, but the Night King kills Viserion with an ice spear, devastating Daenerys. Daenerys vows to Jon that she will help fight the Night King, and Jon pledges allegiance to her as his queen. The pair and their retainers bring a wight to King's Landing to convince Cersei of the threat beyond the Wall. Cersei ultimately agrees to a truce and to aid in the fight against the undead army but secretly plots to betray them. Falling in love, Jon and Daenerys finally succumb to their growing feelings for each other and have sex. Neither of them is aware they are related by blood or that the Night King has revived Viserion as a wight. The Night King breaches the Wall with dragonfire.[43]\n\nSeason 8 [ edit ]\n\nDaenerys and Jon arrive at Winterfell with the Unsullied, Dothraki, and her dragons. There they learn the Night King has breached Westeros. The Northerners and Sansa Stark are angry that Jon is allied with Daenerys. Later, Daenerys and Jon's bond grows when they ride her dragons. Jaime Lannister arrives and reveals Cersei's treachery. Jon learns his true parentage and reveals to a stunned Daenerys that he is the son of her brother Rhaegar and Lyanna Stark. Daenerys realizes this makes Jon the heir to House Targaryen.\n\nWhen the army of the dead arrive, Daenerys and Jon battle the Night King on dragonback but struggle and are separated. Jorah is killed defending Daenerys from wights and dies in her arms as she cries. The dead are defeated when Arya Stark kills the Night King. After the battle, Daenerys fears people may prefer Jon as ruler over her when the wildings praise him. She begs Jon not to reveal his true parentage, but Jon says he must tell his sisters, who he swears to secrecy as he has renounced his claim for Daenerys's. However, Sansa tells Tyrion, who tells Varys. Daenerys, Jon, and their combined forces prepare to march on Cersei, but Euron Greyjoy ambushes Daenerys en route; he kills Rhaegal and captures Missandei. A stricken Daenerys negotiates for Missandei's release and Cersei's surrender, but Cersei has Missandei beheaded. Daenerys learns Varys is trying to seat Jon on the Iron Throne and executes him for his treason. Later, she attempts to re-engage her physical relationship with Jon, but he pulls away because of their blood relation. Daenerys becomes resigned to relying on fear to assert herself.\n\nTyrion defies Daenerys by freeing his brother, who is then captured on his way back to Cersei. Later, Tyrion urges Daenerys to spare the inhabitants of King's Landing if they surrender. Daenerys destroys the city's defenses and the city surrenders, but she burns King's Landing, killing countless civilians. In the aftermath, Daenerys declares she \"liberated\" these people and will \"liberate\" the world. Tyrion is arrested for treason. Arya and Tyrion warn Jon that Daenerys will view his Targaryen heritage as a threat to her rule, and House Stark is not safe; Tyrion says that despite Jon's love for Daenerys, it is his duty to kill her to protect the people. Jon attempts to reason with Daenerys, but when she continues to assert her actions are necessary to establish a good world, a conflicted Jon fatally stabs her and Daenerys dies in his arms as he weeps. Drogon arrives and melts the Iron Throne before leaving Westeros with Daenerys's body, grieving. Bran Stark is later elected king; he exiles Jon back to the Night's Watch to appease Daenerys's supporters.[44]\n\nReception [ edit ]\n\nGeneral [ edit ]\n\nGame of Thrones.[45] Emilia Clarke was relatively unknown before her role as Daenerys in\n\nDaenerys is one of the most popular characters of the book series, together with Tyrion Lannister and Jon Snow.[46] The New York Times called Daenerys one of Martin's \"finest creations\".[2][46] Rolling Stone ranked her number one on a list of Top 40 Game of Thrones Characters, describing her story as a \"non-stop confrontation with complex ideas about sex, war, gender, race, politics and morality\".[45] Matthew Gilbert of The Boston Globe called her scenes \"mesmerizing\".[47] Salon's Andrew Leonard, in his review of A Dance with Dragons, called Daenerys one of the series' three strongest characters and bemoaned her lack of inclusion in A Feast for Crows.[4] The website Mashable recognized her as one of the five most popular series' characters,[48] while The Daily Beast referred to her as the \"closest thing the series has to a protagonist\".[49]\n\nEmilia Clarke's performance in the first season, showing Daenerys's arc from a frightened girl to an empowered woman, received praise. Gilbert said: \"Clarke doesn't have a lot of emotional variety to work with as Daenerys, aside from fierce determination, and yet she is riveting.\"[47] In her review for \"A Golden Crown,\" Emily St. James of The A.V. Club commented that Clarke successfully conveyed the relief of Dany seeing her brother dead.[50] IGN's Matt Fowler noted that Daenerys's choice to watch Viserys die was \"powerful\" and an important shift in her character.[51] St. James complimented Clarke's expression of \"calm rapture\" during Kahl Drogo's speech.[52] Clarke's performance and the character's final scene in \"Baelor\" was praised by Ed Cumming in The Telegraph,[53] and the final scene of the season received widespread acclaim.[54][55]\n\nKate Arthur of the website BuzzFeed criticized the character's story line in the television show's second season, stating she was too \"weak-seeming\". However, Arthur praised the character's \"purpose coupled with humanity and even some humor\" during the third season, opining that Clarke was \"eating the screen alive as a result\".[56] Nate Hopper of Esquire magazine, argued that the character in the TV series \"remains the most boring and frustrating\" contrary to the books, and while Clarke's performance is \"well enough\" the threats the character faces lack \"real tension\" and her conquering is \"cut and dry\" [sic], concluding that \"she needs to be emancipated from her own easy, comfortable, mundane victory.\"[57] Despite many commentators saying the fourth season was one of the best of the series,[58] some reviews criticized Daenerys's \"stalled\" plotline.[59] Erik Adams of The A.V. Club noted \"Dany's new world is made in her image\" after capturing Meereen.[60]\n\nIn the fifth season, after a failed rebellion and assassination attempt, some critics questioned Daenerys's ability to rule effectively.[61] Aaron Couch of The Hollywood Reporter praised the first meeting of Daenerys and Tyrion Lannister, comparing their meeting \"to first seeing the heroes of Marvel Studios' Avengers come together\".[62] Lauren Morgan of the New York Daily News noted Daenerys' first dragon flight, calling it \"a real fist-pumping moment\".[63] Liz Shannon Miller of IndieWire praised Daenerys's return to the Dothraki in the sixth season, calling it a \"nice return to basics\".[64] Other commentators noted Daenerys's burning of the Dothraki leaders in the \"Book of the Stranger\" episode. James Hibberd of Entertainment Weekly called the burning scene \"one of her incredible showstopping moments\".[65] After setting sail to Westeros in the season finale, \"The Winds of Winter\", Eric Deggans of NPR said Daenerys \"has finally developed into the powerful leader the show has been grooming her to become for five seasons\".[66]\n\nIn the last two seasons of the series, Daenerys received more mixed critical reviews. In the seventh season premiere episode \"Dragonstone\", Daniel D'Addario of Time said Daenerys and Tyrion Lannister's meeting \"seem to elicit the most interest from the show itself\".[67] Matt Zoller Seitz, writing for Vulture, compares Daenerys's leadership and control to Michael Corleone in The Godfather, stating \"The show's main storytelling model has been the first Godfather, which ended with Michael Corleone having the clan's major enemies executed and reasserting control over his realm\".[68] The eighth season saw the most critical reviews of Daenerys for the series.[69][70] Commentators cited the penultimate episode \"The Bells\" as a turning point for Daenerys's storyline, seeing her descent into madness.[71] Despite criticism of the finale's lot, Caroline Framke of Variety praised Clarke's performance.[72] After the series finale, many critics said Daenerys deserved a better execution of her story arc.[73][74]\n\nFeminism and evolution as a leader [ edit ]\n\nDaenerys's victories over ruthless male characters transformed her into a symbol of feminism.[75][76] \"Khaleesi\", one of her many aliases, became \"shorthand for a strong, empowered woman\".[76] Daenerys's face was used on political protest signs, and many fans named their daughters after her.[77][78][79] Analyzing her feminist appeal, Tanya Ghahremani of Bustle wrote she evolved from being a meek girl, rising \"from being an unwilling wife to the leader of a nomadic warrior group, to being the leader of said group and a whole ton of men who gladly laid down their life to serve in her army\".[75] Gaby Del Valle of Vox said many people see themselves in Daenerys because her story subverts the hero's journey.[76] Citing an essay by Rikke Schubart, a film scholar and professor from the University of Southern Denmark, Del Valle said Schubart explained that Daenerys \"embarks on an archetypal hero's journey with a twist\" because \"instead of learning to humble herself, as heroes usually do, Dany has to learn to assert herself in a universe dominated by men\". As a result, \"she combines emotions and elements that are stereotypically gendered male and female (male pride, a male dragonslayer, a damsel in distress) and then claims agency for herself and others\".[76]\n\nPolitical science has been used to analyze and assess Daenerys's leadership. Commentators and academics say that Daenerys's rule is similar to fascism in Europe throughout the early 20th century.[80][81] Andrew Lotz, a professor of political science at the University of Pittsburgh, said that Daenerys should seize power as described in Niccolò Machiavelli's The Prince.[82] The Prince discusses the use of amoral ways and \"how to do wrong\" to gain power.[83] Parker Richards of The Atlantic compared Daenerys in season eight to Adolf Hitler in the 1935 propaganda film Triumph of the Will.[84] In a 2019 interview with Variety, Emilia Clarke stated she watched political speeches by Hitler to both emulate his style and how to give speech in a different language.[85] Vox noted similarities between Targaryen's leadership in the later television seasons and communist revolutionary leaders Vladimir Lenin, Mao Zedong and Fidel Castro.[86]\n\nVillain arc [ edit ]\n\nThe decision to turn Daenerys from a hero into a villain, a route that had long been a fan theory, was controversial.[87][88][89] Most critics found the villainous turn, realized after Daenerys needlessly murdered thousands of innocents by burning down King's Landing, rushed and therefore unearned.[90] Alex Abad-Santos of Vox said that \"the implication that Daenerys Targaryen is going mad is the greatest fraud Game of Thrones has ever perpetrated\" and is \"essentially a bait-and-switch\" because, for seven seasons, the audience has seen Daenerys as a good and moral person determined to abolish slavery and create a just society.[91] Eliana Dockterman of Time echoed these sentiments, adding that Daenerys and Jon \"proved the most popular heroes to cheer for — not only because they cheated death but because they spent time with those who weren't like them and learned to understand them\".[92] She said that \"yes, Daenerys has used fire and her dragons to enact vengeance and punishment before, but up until season 7, everyone she burned was either evil or an enemy\".[93] Mike Hogan of Vanity Fair felt that turning Daenerys into a villain made no sense because although the show had been clear that Daenerys has a temper, \"we have seen her balance that violence with mercy, kindness, and above all shrewdness\".[94]\n\nCritics felt the villain arc could have worked with a strong message that power corrupts everyone, but that the show needed to lay better groundwork for it.[90][95][96] Dockterman felt that instead of doing this, \"the creators of the show decided to evolve Daenerys's increasing paranoia over the course of just a few episodes, let her snap in a second and punish her for that misstep by having Jon murder her a mere episode later. The shift was so abrupt that even actor Emilia Clarke admitted to struggling with it.\"[73] Dockterman felt that \"there's an additional layer of latent sexism to be analyzed here too: Cersei and Daenerys are two power hungry women, literally evil queens in fairytale parlance\" while \"men like Theon and Jaime have been redeemed\" and Jon looked \"to be the obvious choice for a selfless king\".[92] Arguing that the writers expected the audience to ignore almost everything they knew about Daenerys to buy that she would torch thousands of innocents because she was lonely and betrayed, Noel Ransome of Vice News asked, \"[N]ow we're meant to believe that the most reasonably lovable protagonist is now the show's most unreasonable villain?\"[95] Alan Sepinwall of Rolling Stone believes that Daenerys's descent into madness is a development that requires \"at least another half of a regular-length GoT season to feel earned\".[97]\n\nOther reviewers welcomed the villain arc.[90] While one reason commentators gave for the plot line change was not having any more source material from George R. R. Martin, as episodes since season 5 were written based on outlines of the unreleased The Winds of Winter and A Dream of Spring,[98][99] Vox's Andrew Prokop said that Daenerys \"may well have been the series' ultimate villain all along\" and that the show and George R. R. Martin's A Song of Ice and Fire novels had foreshadowed this.[87] He said that, \"Daenerys has long been capable of great compassion — and great violence\" and that \"the great power her dragons give her\" enables the latter. He pointed to Daenerys being \"angered by the Meereenese nobles' crucifixion of slave children\" and ordering \"an equivalent number of captured nobles crucified\", and addressed other instances of her cruelty, such as when she burned Samwell Tarly's father and brother to death when they refused to kneel for her. He agreed, however, with the complaints that the twist was poorly executed.[87]\n\nJames Hibberd of Entertainment Weekly also pointed to signs that Daenerys was always destined to be a villain, such as her vision in the House of the Undying where she walked through the snow-covered Red Keep (later retconned to be white ash) falling into the throne room. He said that although the series had perhaps been \"a bit tricky in playing her murderous moments as heroic\", the show tested Daenerys's character, \"and in doing so, the thing that [the show] is actually pushing is a debate about Dany's morality, bringing that question into the foreground of the show after letting it sit quietly in the background for so long\".[100] Rose Moore of Screen Rant felt that \"having Daenerys turn into the villain [fits perfectly]\" within the series where Targaryens \"have a tendency to madness\" and that it creates \"a beautiful villain origin story\". She said that there exists a \"wonderful symmetry to hav[ing] the death of the Mad King set the events of Game of Thrones in motion, only to be wrapped up by the ascension and death of a Mad Queen.\"[88] Prokop said the series could not end \"with a triumphant Daenerys Targaryen heroically taking the Iron Throne\" because \"it wouldn't be Game of Thrones\".[101]\n\nFans generally attributed the change in Daenerys's arc to the writers throwing away her character development, with many criticizing it as character assassination.[102][103] HuffPost's Elyse Wanshel said, \"It was an upsetting turn for a strong and sympathetic female character whom many believed would emerge as the series' hero.\"[104] Emily St. James of Vox quoted writer Sady Doyle writing, \"Women who expected Daenerys to become a benevolent feminist ruler, to break the wheel and end the cycle of oppression, were not stupid; they were following basic story logic.\" St. James said that \"many people have related to Dany deeply, seeing in her an avatar of feminine power they hadn't seen elsewhere in pop culture when the show debuted in 2011\" and that HBO's marketing also made her feel like the chosen one. She asked, given that the show always returned to Daenerys's fundamental principles after her vicious or vindictive actions, \"Why wouldn't people come to heavily identify with that character?\"[105]\n\nRecognition and awards [ edit ]\n\nClarke received an EWwy Award for Best Supporting Actress in a Drama in 2011,[106] as well as a Scream Award for Breakout Performance by a Female.[107] She also earned a Gracie Allen Award for Outstanding Female Rising Star in a Drama Series or Special in 2012.[108] Clarke, along with the other main cast members, was nominated seven times for the Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Drama Series.[109]\n\nClarke received Primetime Emmy Award nominations for Outstanding Supporting Actress in a Drama Series in 2013, 2015 and 2016.[110][111][112] She was also nominated for a Critics' Choice Television Award for Best Supporting Actress in a Drama Series for the role in 2013 and 2016.[113][114] Other nominations include the Golden Nymph Award for Outstanding Actress in a Drama Series in 2012,[115] the Satellite Award for Best Supporting Actress in a Series, Miniseries or Television Film, and the MTV Movie & TV Award for Best Actor In A Show in 2017.[116] Many publications, including The Hollywood Reporter and Rolling Stone, place Daenerys among the best Game of Thrones characters.[117][118] In IGN's Top 100 Game of Thrones Characters list, Terri Schwartz stated that Daenerys \"is one of the most monumental characters on Game of Thrones\".[119]\n\nSee also [ edit ]\n\nNotes [ edit ]\n\n^ [11] While she is described to have purple eyes in the novels, the television show does not specify the eye color. ^ The Hollywood Reporter reported the salary per episode to be £1.2 million[35] while The Telegraph reported £2 million per episode.[36] reported the salary per episode to be £1.2millionwhilereported £2million per episode.", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Emilia_Clarke_%2848571862157%29.jpg/170px-Emilia_Clarke_%2848571862157%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/0/0d/Daenerys_Targaryen_with_Dragon-Emilia_Clarke.jpg/220px-Daenerys_Targaryen_with_Dragon-Emilia_Clarke.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Global_thinking.svg/10px-Global_thinking.svg.png", "https://upload.wikimedia.org/wikipedia/en/0/0d/Daenerys_Targaryen_with_Dragon-Emilia_Clarke.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/94/Symbol_support_vote.svg/19px-Symbol_support_vote.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Game_of_Thrones_Oslo_exhibition_2014_-_Daenerys%27s_blue_dress.jpg/100px-Game_of_Thrones_Oslo_exhibition_2014_-_Daenerys%27s_blue_dress.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/A_Song_of_Ice_and_Fire_arms_of_House_Targaryen_black_scroll.png/150px-A_Song_of_Ice_and_Fire_arms_of_House_Targaryen_black_scroll.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/0/0d/Daenerys_Targaryen_with_Dragon-Emilia_Clarke.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Daenerys_Targaryen", "title": "Daenerys Targaryen", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/0/0d/Daenerys_Targaryen_with_Dragon-Emilia_Clarke.jpg", "width": 640, "height": 448}, "title": "Daenerys Targaryen - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}