{"url": "https://en.wikipedia.org/wiki/Project_Runway_(season_16)", "text": "Season of television series\n\nProject Runway Season 16 No. of tasks 14 No. of contestants 16 Winner Kentaro Kameyama Country of origin United States Release Original network Lifetime Original release August 17 ( ) –\n\nNovember 30, 2017 ( 2017-11-30 ) Season chronology Previous\n\nSeason 15 Next →\n\nSeason 17\n\nProject Runway Season 16 is the sixteenth season of the television show Project Runway, appearing on Lifetime. The season began on Thursday, August 17, 2017.[1] There are 16 designers competing to become \"the next great American designer.\" Supermodel Heidi Klum, Marie Claire creative director Nina Garcia, and fashion designer Zac Posen are all returning as judges this season. Tim Gunn maintains his role as the workroom mentor. This was the last season to air on Lifetime and the last to feature Klum, Gunn, and Posen.\n\nSeason 16 was the first time the show emphasized diversity and inclusivity in the size of its models, who ranged from sizes 0 to 22.[2]\n\nDesigners [ edit ]\n\nBatani was originally eliminated after Shawn, but returned to the competition following Claire's disqualification.\n\nDesigner Progress [ edit ]\n\nDesigners 1 2 3 4 5 6 7 8 9 10 11 12 13 14 Kentaro IN IN LOW HIGH IN WIN HIGH HIGH IN LOW LOW ADV ADV WINNER Ayana IN WIN IN IN IN IN IN IN HIGH WIN HIGH ADV ADV RUNNER-UP Brandon HIGH HIGH WIN IN WIN IN HIGH WIN HIGH HIGH WIN ADV ADV 3RD PLACE Margarita IN IN HIGH IN IN LOW WIN LOW HIGH HIGH SAFE ADV ADV 4TH PLACE Kenya HIGH HIGH IN LOW HIGH HIGH LOW HIGH IN HIGH HIGH ADV OUT Michael IN IN IN WIN HIGH IN IN LOW WIN OUT Amy IN LOW IN IN IN IN LOW IN OUT Batani LOW HIGH HIGH IN IN IN HIGH OUT OUT Claire IN LOW IN IN LOW LOW LOW DQ Shawn LOW LOW IN HIGH IN HIGH WD Samantha IN LOW IN IN LOW OUT Aaron IN HIGH IN LOW OUT Deyonte WIN IN LOW OUT Kudzanai IN IN OUT Sentell IN OUT ChaCha OUT\n\nThe designer won Project Runway Season 16. The designer advanced to Fashion Week. The designer won the challenge. The designer came in second but did not win the challenge. The designer had one of the highest scores for that challenge, but did not win. The designer had one of the lowest scores for that challenge, but was not eliminated. The designer was in the bottom two, but was not eliminated. The designer lost and was eliminated from the competition. The designer lost, but was brought back to the competition by Tim Gunn. The designer was disqualified from the competition. The designer withdrew from the competition.\n\nModel Progress [ edit ]\n\nModel Progress Table Model 1 2 3 4 5 6 7 8 9 10 11 12 13 14 Sanita MB SM AM AB BT KF CB – BK KF MA AI KT KT Meisha AB AI BT BK KT KT MA – MB AI BK KT AI AI (2ND) Liris BK CB DW KT MB MB SB – AI KT KF MA BK BK (3RD) Jazzmine BT BK CB DW MA SR MB – AB BK KT KF MA MA (4TH) Christina SB AM AB AI BK MA BK – KF MB AI BK KF Janine KF MA MB SB AI SB KT – KT MA OUT Sian AM AB AI BT CB CB KF – MA OUT Monique DW KF KD MB AM BT AI – BT OUT Colleen CB KT KF MA SB BK AB – OUT Lena KT KD MA SR AB AI BT – OUT Marsha AI BT BK CB KF AB OUT Yordanos CC DW KT KF SR OUT Samantha MA SR SB AM OUT Liz KD MB SR OUT Kylie SM SB OUT Katie SR OUT\n\nThe model was paired with the winning designer of Project Runway Season 16. The model wore the design that advanced the designer to fashion week. The model wore the winning design. The model wore the design with the second-highest score. The model wore the design with one of the highest scores but did not win. The model wore the design with one of the lowest scores. The model wore the design that landed in the bottom 2. The model wore the losing design. The model was eliminated.\n\nModel Assignments [ edit ]\n\nDesigner Legend\n\nAaron Myers: AM\n\nAM Amy Bond: AB\n\nAB Ayana Ife: AI\n\nAI Batani-Khalfani: BT\n\nBT Brandon Kee: BK\n\nBK ChaCha: CC\n\nCC Claire Buitendorp: CB\n\nCB Deyonté Weather: DW\n\nDW Kentaro Kameyama: KT\n\nKT Kenya Freeman: KF\n\nKF Kudzanai Karidza: KD\n\nKD Margarita Alvarez: MA\n\nMA Michael Brambila: MB\n\nMB Samantha Rei: SR\n\nSR Sentell McDonald: SM\n\nSM Shawn Buitendorp: SB\n\nEpisodes [ edit ]\n\nSources:[3]\n\nEpisode 0: Road to the Runway [ edit ]\n\nOriginal airdate: August 10, 2017 (présentation des candidats)\n\nEpisode 1: One Size Does Not Fit All [ edit ]\n\nOriginal airdate: August 17, 2017\n\nThe designers enter Season 16 in style as they must create a red carpet look that demonstrates their fashion point of view. But the real surprise comes when the designers learn they will be working with models of all sizes!\n\nChallenge: Create a red carpet look with your own signature style.\n\nGuest Judge: Olivia Munn\n\nWINNER: Deyonté\n\nELIMINATED: ChaCha\n\nEpisode 2: An Unconventional Recycling [ edit ]\n\nOriginal airdate: August 24, 2017\n\nIn their first team challenge, the designers struggle to make their voices heard. However, this is an unconventional materials challenge and many of them stumble when forced to create a fashion forward look out of recyclable materials.\n\nTeam Name Team Members Ballin' on a Budget Batani, Aaron, Kenya, Brandon, Ayana Wabi-Sabi Margarita, Kentaro, Deyonté, Kudzanai, Michael Tsunami Sentell, Samantha, Amy, Shawn, Claire\n\nChallenge: Create a high fashion mini collection from recycled materials.\n\nGuest Judge: Maggie Q & Anne Fulenwider\n\n& WINNER: Ayana\n\nELIMINATED: Sentell\n\nEpisode 3: A Leap of Innovation! [ edit ]\n\nOriginal airdate: August 31, 2017\n\nThe designers are treated to a private screening of the film Leap! as well as a performance by Hiplet and must draw inspiration for an innovative and edgy design in order to survive another week.\n\nChallenge: Create a look inspired by dance, movement and innovation.\n\nGuest Judge: Maddie Ziegler\n\nWINNER: Brandon\n\nELIMINATED: Kudzanai\n\nEpisode 4: We're Sleeping Wear? [ edit ]\n\nOriginal airdate: September 7, 2017\n\nIt’s the Heidi Klum Sleepwear Challenge and the designers are feeling on top of the world, literally. If a slumber party on the roof of the Empire State Building doesn’t bring them the inspiration they need to impress Heidi, nothing will!\n\nChallenge: Create a sleepwear look for Heidi Klum Intimates.\n\nGuest Judge: Demi Lovato\n\nWINNER: Michael\n\nELIMINATED: Deyonté\n\nEpisode 5: Descending into Good and Evil [ edit ]\n\nOriginal airdate: September 14, 2017\n\nDrawing inspiration from the hit film Descendants 2, the designers visit Lyndhurst Castle and are tasked with creating a look that represents “Good” or “Evil.” Most of the results are angelic, but as always, the devil is in the details.\n\nInspiration Assigned Designers Good Amy, Brandon, Kentaro, Aaron, Ayana, Claire Evil Michael, Kenya, Samantha, Shawn, Margarita, Batani\n\nChallenge: Create an evening wear look inspired by good or evil.\n\nGuest Judge: Dove Cameron & China Anne McClain\n\n& WINNER: Brandon\n\nELIMINATED: Aaron\n\nEpisode 6: Models Off Duty [ edit ]\n\nOriginal airdate: September 21, 2017\n\nThe models become much more than runway eye candy as they serve for inspiration to the designers to create a street style look, to be featured in a photo shoot. But ceding creative control to the models proves to be a difficult chore for some designers.\n\nChallenge: Create a streetwear look for models on their day off.\n\nGuest Judge: Georgina Chapman & Kelsea Ballerini\n\n& WINNER: Kentaro\n\nELIMINATED: Samantha\n\nEpisode 7: The Ultimate Faceoff [ edit ]\n\nOriginal airdate: September 28, 2017\n\nIt’s the JC Penney Challenge and the designers must use men’s fabrics and designs to create a fashion forward look for their female models. Not only that, they must work in teams to do it, leading to a runway elimination that no one saw coming!\n\nTeams Kentaro & Brandon Amy & Kenya Claire & Shawn Margarita & Batani Michael & Ayana\n\nChallenge: Create a stylish fall outfit inspired by menswear.\n\nGuest Judge: Asia Kate Dillon\n\nWINNER: Margarita\n\nELIMINATED: Shawn In a twist, after Claire and Shawn are declared the losing team, they are given one hour to create all-new looks, in competition against each other. Shawn forfeited the challenge and was eliminated.\n\n\n\nEpisode 8: Client on the Go [ edit ]\n\nOriginal airdate: October 5, 2017\n\nThe designers are tasked with creating an on-the-go look for friends and family of the Project Runway crew, but the good spirited challenge takes an ugly turn when accusations of cheating cloud the results of a contentious runway.\n\nChallenge: Create a print and head-to-toe look.\n\nGuest Judge: Sophia Stallone & Yolanda Hadid\n\n& DISQUALIFIED: Claire Claire was disqualified for breaking the rules and her win was rescinded. Although Brandon's print was announced to be put into print for Dixie cups, there was no replacement winner for the challenge and Batani was spared elimination.\n\n\n\nEpisode 9: A \"Little\" Avant Garde [ edit ]\n\nOriginal airdate: October 12, 2017\n\nThe dramatic fallout from the cheating scandal rocks the designers and leaves everyone wondering how they’ll move forward in the competition. But the show must go on and the designers rally to create an Avant Garde look inspired by Shopkins characters.\n\nChallenge: Create an avant garde look inspired by Shopkins Shoppies.\n\nGuest Judge: Kate Upton\n\nWINNER: Michael\n\nELIMINATED: Batani & Amy\n\nEpisode 10: Driving Miss Unconventional [ edit ]\n\nOriginal airdate: October 19, 2017\n\nIt’s the Lexus Challenge, but this one is Unconventional and nobody is safe! The designers must use safety materials to create a look that wows the judges as Fashion Week is right around the corner.\n\nChallenge: Create a runway look using unconventional materials.\n\nGuest Judge: Carly Chaikin\n\nWINNER: Ayana\n\nELIMINATED: Michael\n\nEpisode 11: Warrior Fashion [ edit ]\n\nOriginal airdate: October 26, 2017\n\nIt’s an emotional Runway as the designers create looks inspired by “Warrior Women” — women who have battled breast cancer.\n\nChallenge: Create an editorial look inspired by Warrior Women.\n\nGuest Judge: Rachel Brosnahan\n\nWINNER: Brandon\n\nSAVED: Margarita\n\nEpisode 12: There's Snow Business like Sew Business [ edit ]\n\nOriginal airdate: November 2, 2017\n\nThe runway is converted into a Winter Wonderland as the designers are tasked with creating a winter-themed look that will decide who goes to NY Fashion Week and who gets left out in the cold.\n\nChallenge: Create a high fashion winter look.\n\nGuest Judge: Katie Holmes\n\nADVANCED TO FASHION WEEK: Kentaro , Brandon , Ayana , Margarita , & Kenya\n\n, , , , & ELIMINATED: None\n\nEpisode 13: Finale Part 1 [ edit ]\n\nOriginal airdate: November 9, 2017\n\nAfter heading home to work on their Fashion Week collections, the five finalists are visited by Tim who is not impressed with everything they have created so far. The designers return to New York and present the judges with 2 pieces from their collection. With only four designers remaining for the second part of the finale, everything is on the line.\n\nChallenge: Present two pieces from your final collection.\n\nADVANCED TO FASHION WEEK: Brandon , Ayana , Margarita , Kentaro\n\n, , , ELIMINATED: Kenya\n\nEpisode 14: Finale Part 2 [ edit ]\n\nOriginal airdate: November 16, 2017\n\nFashion week is finally here and the designers rush to put the final touches on their collections. Four designers will have their dream of showing at New York Fashion Week, but only one designer will reach the ultimate goal of being crowned the next Project Runway Winner!\n\nChallenge: Present a 10-piece final collection at New York Fashion Week.\n\nGuest Judge: Jessica Alba\n\nWINNER: Kentaro\n\nELIMINATED: Ayana (2nd Place), Brandon (3rd Place), Margarita (4th Place)\n\nEpisode 15: Season 16 Reunion Special [ edit ]\n\nOriginal airdate: November 30, 2017\n\nThe season 16 designers reunite with mentor Tim Gunn to discuss their Project Runway experience. They come ready to reminisce, share emotions, and get to the bottom of the cheating scandal that rocked the season. And some of our favorite models also swing by!", "images": ["https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Project_Runway_(season_16)", "title": "Project Runway (season 16)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "viewport": "width=1000", "og": {"title": "Project Runway (season 16) - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}