{"url": "https://en.wikipedia.org/wiki/Lauren_Conrad", "text": "American television personality, author, and fashion designer (born 1986)\n\nLauren Katherine Conrad born February 1, 1986[1]) is an American television personality, fashion designer and author. In September 2004, as an 18-year-old, Conrad came to prominence after being cast in the reality television series Laguna Beach: The Real Orange County, which documented her and her friends' lives in their hometown of Laguna Beach, California.\n\nConrad later moved to Los Angeles to pursue a career in the fashion industry. She received her own spin-off series The Hills and starred in five of its six seasons from 2006 to 2009. During its production, she also attended the Fashion Institute of Design & Merchandising and interned for Teen Vogue and Kelly Cutrone's public relations firm People's Revolution. Conrad later founded the fashion lines LC Lauren Conrad and Paper Crown, and co-founded the fair trade online store The Little Market. She has published nine books, including L.A. Candy and The Fame Game trilogies.\n\nLife and career [ edit ]\n\nEarly life [ edit ]\n\nConrad was born in Laguna Beach, California on February 1, 1986, to Jim, an architect, and Kathy (née Lawrence).[2][3] She has two younger siblings, a sister named Breanna, also a television personality,[4] and a brother, Brandon.[5] Conrad first expressed an interest in a career in the fashion industry when she was in the sixth grade.[3] Her father added that Conrad \"wasn't a great student [and] wasn't that interested\" during her childhood, although noted that \"we figured out along the way that she was an artist and her real love was fashion.\"[6]\n\nReality television [ edit ]\n\nAlongside eventual castmates Lo Bosworth, Kristin Cavallari, and Stephen Colletti, Conrad attended Laguna Beach High School. In 2004, they starred in Laguna Beach: The Real Orange County, an MTV reality television series which documented their lives during high school. During its production, she was often referred to by the initialism \"L.C.\", although she has since expressed her distaste for the nickname.[7] The series proved successful for the network;[8] she described the lifestyle it imposed on her as being \"definitely a different way to grow up\".[9] The first season notably focused on the love triangle between Conrad, Cavallari, and Colletti, and the subsequent feud between the former two.[10] Upon the conclusion of the first season, Conrad appeared on an episode of MTV Cribs.[11] After graduating from high school in 2004, Conrad attended the Academy of Art University in San Francisco for one semester, where she met Heidi Montag.[12] Conrad left the series after the second season,[13] during which period she moved back home and transferred to the Fashion Institute of Design & Merchandising in Los Angeles, though she did not graduate with a degree.[14] After her sister Breanna became a primary cast member, Conrad made a guest appearance on the series during the third season in 2006.[15]\n\nAfter moving to Los Angeles in 2005, the spin-off series The Hills was developed to chronicle the lives of Conrad, her housemate Montag, and their friends Audrina Patridge and Whitney Port.[16] During production of the first season, Conrad and Port held internships with Teen Vogue under the direction of West Coast Vogue editor Lisa Love; she stated that they had to interview successfully for the positions, \"regardless of what the cameras wanted\".[17] By the second season, Laurens friendship with Heidi had deteriorated after Montag began dating Spencer Pratt.[18] After Montag moved in with Pratt, Patridge and Lo Bosworth later became roommates with Conrad.[19][20]\n\nDuring the third season, Conrad ended her friendship with Montag after she suspected that Montag and Pratt were responsible for rumors of a sex tape involving herself and her former boyfriend Jason Wahler; the ensuing feud carried through each subsequent season in which Conrad appeared.[21] Conrad briefly dated fellow castmate Brody Jenner, which she commented had been subject to \"editing to drag it out\" during the series.[22] In January 2007, Conrad was announced as the inaugural spokeswoman of Avon Products's \"mark.\" line, marketed towards young women;[23] she was succeeded by actress Ashley Greene in June 2010.[24] Later in 2007, Conrad appeared as a satirical version of herself in the comedy film Epic Movie.[25] In 2008, Conrad and Port began interning with Kelly Cutrone's PR firm, People's Revolution.[26]\n\nUpon the conclusion of the fourth season of The Hills in December 2008, Conrad wished to leave the series to pursue other career opportunities.[27] However, per the producers' requests, she filmed ten episodes for the following season, in which she closed her storylines.[28] Conrad made her final appearance on the series in May 2009, attending Montag and Pratt's wedding after much deliberation during the mid-season finale of the fifth season.[29] However, in the July 2009 issue of Cosmopolitan, she stated that producers had pressured her into a reconciliation with Montag throughout the season, adding that she was displeased when they would not allow otherwise.[30] Conrad was replaced by former Laguna Beach castmate Kristin Cavallari until the series' conclusion in July 2010.[10][31]\n\nIn September 2010, Conrad was to star in an MTV series that would have focused on her career endeavors, though the network chose not to pick up the program after Conrad preferred not to film her private life.[32] That month, Conrad revealed that she had filmed an alternate ending for The Hills with Jenner.[33] Upon the conclusion of their month-long morning marathon of the series, titled \"RetroMTV Brunch\", MTV aired the footage in August 2013.[34] The scene depicts Jenner returning to his apartment after seeing Cavallari's limousine off to Europe. Conrad is revealed to be sitting on his couch, and comforts him that \"it's hard to say goodbye\" to a \"friend of [his]\", before the camera focuses on a smiling Conrad.[35] That month, she also expressed interest in participating in a potential reunion film.[36] That October, Conrad and her friend Hannah Skvarla opened the online store The Little Market, which distributes handmade pieces from women of varying cultural backgrounds.[37] In December 2013, Montag stated that she and Conrad have \"talked a few times\" since the series' conclusion, elaborating that \"it's unfortunate things happened the way that it did, but we're both different people now, older and more mature.\"[38]\n\nFashion and beauty lines [ edit ]\n\nVH1 Divas concert in 2009 Conrad attending theconcert in 2009\n\nIn March 2008, she premiered her first fashion line The Lauren Conrad Collection. After underwhelming sales figures, Conrad ended the line the following year to further familiarize herself with the industry.[39]\n\nIn fall 2009, Conrad collaborated with Kohl's to launch her second fashion line LC Lauren Conrad,[40] and was later expanded to include a bedding collection.[41] In May 2012, it was reported Conrad’s line reached annual sales of $60 million while Conrad only gets a 4% backend of the sales, according to the Hollywood Reporter.[42] Conrad released limited-run Cinderella, Minnie Mouse, and Bambi-inspired collections for LC Lauren Conrad in February,[43] May,[44] and October 2015, respectively.[45] She also introduced an upscale runway collection for the line during New York Fashion Week that September.[46] In 2017, Conrad launched an affordable swim line at Kohl's to expand her brand.[47]\n\nIn April 2011, Conrad launched The Beauty Department with her hairstylist, Kristin Ess, and her makeup artist, Amy Nadine;[48] she later announced plans to expand the brand to include a line of cosmetics.[49] Looking to the target a more upscale audience, Conrad released her third fashion line Paper Crown that August;[50] she has since established an account with Nordstrom for the line.[51] In July, she collaborated with BlueAvocado to launch XO(eco), an environmentally-friendly collection of bags.[52] In August 2020, Conrad launched Lauren Conrad Beauty as a line of affordable and eco-friendly make-up which started with 4 make-up products and by September 2020 expanded to 10 make-up products and 10 skincare products with announcements of more product being developed for a later date.\n\nMedia projects [ edit ]\n\nConrad's first novel L.A. Candy was released in June 2009, and became a bestseller on The New York Times.[53] It was inspired by her life, focusing on a woman named Jane Roberts who moves to Los Angeles.[54] It was followed by sequels Sweet Little Lies[55] and Sugar and Spice[56] in 2010. Conrad also released the fashion guide Lauren Conrad Style in 2010.[57] Conrad released her fourth novel The Fame Game as a spin-off to the L.A. Candy series in April 2012.[58] In October 2012, Conrad released The Fame Game continuation novel Starstruck and the style guide Lauren Conrad Beauty.[59][60][61] The final novel of the trilogy, Infamous, was released in June 2013.[62]\n\nConrad made a cameo appearance in an episode of Greek in 2008[63] and provided her voice for an animated version of herself in the \"We Love You, Conrad\" episode of Family Guy (episode 14, season 7, first broadcast on May 3, 2009).[64] She later made appearances on the syndicated game show Who Wants to Be a Millionaire, playing for her charity \"m.powerment by mark\"[65] and Kathy Griffin: My Life on the D-List,[66] and also served as a guest judge on the thirteenth cycle of America's Next Top Model.[67]\n\nIn 2019, Conrad launched a podcast Asking for a Friend.[68]\n\nPublic image [ edit ]\n\nThe TV show did not help my reputation very much. It was difficult to be taken seriously, but I think the fact that I went to school to study fashion and worked in the industry helped me. I think it's a good thing to feel like you have to prove something, because you're always going to have to work a little bit harder. – Conrad discussing her efforts in attaining credibility within the fashion industry.[50]\n\nSince appearing on Laguna Beach: The Real Orange County, Conrad has been recognized as being among the first individuals to benefit from the popularity of reality television in the early to mid-2000s. In 2009, Thomas Rogers from Salon described her as \"one of the dullest major characters in reality television history\", but opined that her normalcy compared to her co-stars on The Hills made her \"vaguely likable\".[69] An editor from People stated that Conrad \"became a full-blown TV phenom\" during its third season, which notably introduced the conflict with Montag and Pratt, in addition to controversy regarding scripting allegations.[7]\n\nIn 2013, Misty White Sidell from The Daily Beast noted that Conrad established a following based on her respectability instead of \"bitch-slaps and drunken sex-capades\", further commenting that her more relatable image made her an \"anomaly\" among television personalities.[70] Conrad herself commented that The Hills was intended to be an \"aspirational\" program despite being \"laced with scandal and catfights\", stating that the storyline differed from the \"shock value\" emphasized in recent programming.[71] Conrad has additionally been recognized for originating several now-famous quotes on The Hills, including \"He's a sucky person!\" when criticizing Spencer Pratt during the second season, and \"You know what you did!\" when arguing with Heidi Montag over her alleged involvement with sex tape rumors involving herself in the third season.[72]\n\nConrad has been featured on the covers of several magazine's best-selling issues, including those of People StyleWatch and Cosmopolitan.[73] She appeared on the May 2012 issue of Glamour, which sold approximately 500,000 copies and became the magazine's strongest-selling issue of the year,[74] and was featured on the covers of the second highest-selling issues of Lucky and Marie Claire in 2013.[75] Lauren Sherman from Fashionista credited Conrad's success to \"her knack for entrepreneurship, her easy style, and her friendliness\".[73] Jim Higgins from Milwaukee Journal Sentinel complimented her pursuit of several different career endeavors, and compared her to a \"young Martha Stewart\".[76] However, in August 2012, Conrad was criticized for destroying a collection of A Series of Unfortunate Events novels for a crafting tutorial posted to YouTube.[77]\n\nDuring its production, Conrad was the highest-paid cast member on The Hills, earning an annual salary of $2.5 million.[78] In 2008, her endeavors earned her an additional $1.5 million.[79] In 2010, Conrad was named the second highest-paid reality television personality, ranking behind Kim Kardashian.[80] Having been reported to be a registered member of the Republican Party,[81] Conrad has stated that she has \"done several things to ... encourage people to vote\", and respects the private ballot and \"[doesn't] want to ever influence someone's vote or have [her] vote change someone's opinion of [her]\".[82][83] Conrad collaborated with Seventeen magazine to film a public service announcement for Declare Yourself, a campaign which encouraged young adults to register themselves to vote during the 2008 presidential election.[84] She has additionally expressed her support for same-sex marriage, and on one occasion left a Mexican restaurant after learning of its disapproval of same-sex marriage.[85]\n\nIn 2019, MTV screened a revival of The Hills, calling it The Hills: New Beginnings featuring Conrad's former co-stars Heidi Montag, Spencer Pratt, Stephanie Pratt, Audrina Patridge, Justin Bobby Brescia, Brody Jenner, Jason Wahler and Whitney Port. A source had said Conrad declined the offer because she felt she was in a different place in life with raising her son, Liam, and working on her line for Kohl's.[86]\n\nPersonal life [ edit ]\n\nIn 2008, Conrad began dating actor Kyle Howard. Howard expressed concern that appearing on reality television would interfere with his acting career; consequently, their relationship was not documented on The Hills. After three years together, Conrad and Howard ended their relationship in 2011.[87][88]\n\nHaving begun dating in February 2012,[89] Conrad and former Something Corporate guitarist William Tell moved into a shared residence in Westwood, Los Angeles in September 2013,[90] and announced their engagement the following month.[91] Conrad and Tell married on September 13, 2014, in California.[92] Together they have two sons: William “Liam” James (born on July 5, 2017)[93] and Charles “Charlie” Wolf (born on October 8, 2019).[94]\n\nFilmography [ edit ]\n\nPublished works [ edit ]\n\nL.A. Candy (2009)\n\n(2009) Sweet Little Lies (2010)\n\n(2010) Sugar and Spice (2010)\n\n(2010) Lauren Conrad Style (2010)\n\n(2010) The Fame Game (2012)\n\n(2012) Lauren Conrad Beauty (2012)\n\n(2012) Starstruck (2012)\n\n(2012) Infamous (2013)\n\n(2013) Lauren Conrad Celebrate (2016)\n\nAwards and nominations [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/Lauren_Conrad_2008-03-15.jpg/150px-Lauren_Conrad_2008-03-15.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/94/Symbol_support_vote.svg/19px-Symbol_support_vote.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/db/Lauren_Conrad_2009_VH1_Divas_2_%28cropped%29.jpg/200px-Lauren_Conrad_2009_VH1_Divas_2_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/b/bd/Lauren_Conrad_2009.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/59/Lauren_Conrad_2008_MTV_VMA.jpg/150px-Lauren_Conrad_2008_MTV_VMA.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Lauren_Conrad_2009.jpg/220px-Lauren_Conrad_2009.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Lauren_Conrad_2009.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Lauren_Conrad", "title": "Lauren Conrad", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Lauren_Conrad_2009.jpg", "width": 640, "height": 960}, "title": "Lauren Conrad - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}