{"url": "https://www.hollywoodreporter.com/live-feed/greys-anatomy-renewed-season-15-at-abc-1104738", "text": "It’s official: Grey’s Anatomy will return for the 2018-19 broadcast season.\n\nABC announced the formal renewal for the medical drama late Friday at the wrap party for the Shonda Rhimes drama. With the season 15 renewal, Grey’s Anatomy becomes ABC’s longest-running primetime drama ever, passing The Adventures of Ozzie and Harriet (which ran for 15 seasons and 435 episodes). Only seven dramas in the history of television — Gunsmoke, Law & Order and its SVU spinoff, NCIS, CSI, ER and Bonanza — have had more seasons than Grey’s. (And Grey’s will now be tied with ER as TV’s longest-running medical drama.)\n\n“Grey’s Anatomy has a special place in my heart and millions of viewers feel the same way,” said ABC Entertainment president Channing Dungey. “Thanks to fiercely loyal fans who have been on this journey since the beginning, and new generations of viewers who continue to discover the joy and drama of Grey Sloan Memorial, the show is as strong as ever.”\n\nThe path for the Grey’s renewal was cleared late last year when star Ellen Pompeo — who has been with the series since day one — signed a new two-year deal to remain with the show through a 16th season. The $20 million annual pact makes Pompeo TV’s highest-earning actress on a drama series. The deal included a seven-figure signing bonus and two full backend equity points on the show as well as producing fees on both the flagship series and spinoff Station 19 on top of development deals for her ABC Studios-based Calamity Jane banner.\n\nA decision on a record-breaking 16th season will likely rest with Pompeo, as creator Rhimes has always maintained that Grey’s will run “as long as Ellen wants to do it.”\n\nWith Rhimes having departed her longtime home at ABC Studios last year for a nine-figure deal with Netflix, Grey’s has become increasingly important for ABC.\n\nRhimes recruited and handed off day-to-day control of her first TV series to Krista Vernoff, who returned to the show this season after a six-year detour. Vernoff has helped creatively recharge the series and Pompeo. The current 14th season ranks as ABC’s No. 1 drama among the advertiser-coveted adults 18-49 demographic (a top-five series on all of broadcast) and No. 2 at the network among total viewers (tied with rookie drama The Good Doctor). Season 14 is up 3 percent among total viewers and ranks as Grey’s most-watched season since the 2013-14 run.\n\nPompeo (Meredith), Justin Chambers (Alex), Chandra Wilson (Bailey) and James Pickens Jr. (Richard) are the only series regulars remaining from the pilot. They are all set to return for season 15, alongside co-stars Kevin McKidd (Owen), Jesse Williams (Jackson), Caterina Scorsone (Amelia), Camilla Luddington (Jo), Kelly McCreary (Maggie) and Giacomo Gianniotti (Andrew). Sarah Drew (April) and Jessica Capshaw (Arizona) will say farewell this season, joining Martin Henderson (Nathan) and Jason George (Ben), with the latter having moved over to spinoff Station 19 (the second to spring from Grey’s after Private Practice).\n\nAs for the remaining Shondaland dramas, Scandal wrapped its seven-season run on Thursday and rookies Station 19 and For the People are both awaiting word on their respective futures. Of the two, Station 19 has the edge to return.\n\nGrey’s Anatomy joins a roster of ABC shows set to return for 2018-19 including comedies The Goldbergs, Modern Family and Roseanne and the previously renewed Good Doctor. Those join new pickups including the 1990s-set Goldbergs spinoff, Nathan Fillion drama The Rookie and Take Two, with the latter likely set for this summer.\n\nKeep track of all the latest renewals and cancellations with THR‘s scorecard and of all the pilot pickups with our handy guide. For complete coverage, bookmark THR.com/upfronts.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/04/149059_2002_copy.jpg?w=1296&h=730&crop=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/149059_2002_copy.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/149059_2002_copy.jpg?w=1024", "keywords": [], "authors": ["Lesley Goldberg"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/greys-anatomy-renewed-season-15-at-abc-1104738/", "title": "‘Grey’s Anatomy’ Renewed for Season 15 at ABC", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "With the pickup, the Shonda Rhimes medical drama becomes ABC's longest-running series ever.", "news_keywords": "Grey's Anatomy", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Lesley Goldberg", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1104738, "title": "'Grey's Anatomy' Renewed for Season 15 at ABC", "published_at": "2018-04-20 21:15:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/149059_2002_copy.jpg?w=1024", "comment_count": 0, "tags": "Grey's Anatomy", "topics": "TV News", "body": "It's official: Grey's Anatomy will return for the 2018-19 broadcast season.\r\nABC announced the formal renewal for the medical drama late Friday at the wrap party for the Shonda Rhimes drama. With the season 15 renewal, Grey's Anatomy becomes ABC's longest-running primetime drama ever, passing The Adventures of Ozzie and Harriet (which ran for 15 seasons and 435 episodes). Only seven dramas in the history of television — Gunsmoke, Law & Order and its SVU spinoff, NCIS, CSI, ER and Bonanza — have had more seasons than Grey's. (And Grey's will now be tied with ER as TV's longest-running medical drama.)\r\n\"Grey's Anatomy has a special place in my heart and millions of viewers feel the same way,\" said ABC Entertainment president Channing Dungey. \"Thanks to fiercely loyal fans who have been on this journey since the beginning, and new generations of viewers who continue to discover the joy and drama of Grey Sloan Memorial, the show is as strong as ever.\"\r\n\r\nThe path for the Grey's renewal was cleared late last year when star Ellen Pompeo — who has been with the series since day one — signed a new two-year deal to remain with the show through a 16th season. The $20 million annual pact makes Pompeo TV's highest-earning actress on a drama series. The deal included a seven-figure signing bonus and two full backend equity points on the show as well as producing fees on both the flagship series and spinoff Station 19 on top of development deals for her ABC Studios-based Calamity Jane banner.\r\nA decision on a record-breaking 16th season will likely rest with Pompeo, as creator Rhimes has always maintained that Grey's will run \"as long as Ellen wants to do it.\"\r\nWith Rhimes having departed her longtime home at ABC Studios last year for a nine-figure deal with Netflix, Grey's has become increasingly important for ABC.\r\nRhimes recruited and handed off day-to-day control of her first TV series to Krista Vernoff, who returned to the show this season after a six-year detour. Vernoff has helped creatively recharge the series and Pompeo. The current 14th season ranks as ABC's No. 1 drama among the advertiser-coveted adults 18-49 demographic (a top-five series on all of broadcast) and No. 2 at the network among total viewers (tied with rookie drama The Good Doctor). Season 14 is up 3 percent among total viewers and ranks as Grey's most-watched season since the 2013-14 run.\r\n\r\nPompeo (Meredith), Justin Chambers (Alex), Chandra Wilson (Bailey) and James Pickens Jr. (Richard) are the only series regulars remaining from the pilot. They are all set to return for season 15, alongside co-stars Kevin McKidd (Owen), Jesse Williams (Jackson), Caterina Scorsone (Amelia), Camilla Luddington (Jo), Kelly McCreary (Maggie) and Giacomo Gianniotti (Andrew). Sarah Drew (April) and Jessica Capshaw (Arizona) will say farewell this season, joining Martin Henderson (Nathan) and Jason George (Ben), with the latter having moved over to spinoff Station 19 (the second to spring from Grey's after Private Practice).\r\nAs for the remaining Shondaland dramas, Scandal wrapped its seven-season run on Thursday and rookies Station 19 and For the People are both awaiting word on their respective futures. Of the two, Station 19 has the edge to return.  \r\nGrey's Anatomy joins a roster of ABC shows set to return for 2018-19 including comedies The Goldbergs, Modern Family and Roseanne and the previously renewed Good Doctor. Those join new pickups including the 1990s-set Goldbergs spinoff, Nathan Fillion drama The Rookie and Take Two, with the latter likely set for this summer.\r\nKeep track of all the latest renewals and cancellations with THR's scorecard and of all the pilot pickups with our handy guide. For complete coverage, bookmark THR.com/upfronts.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Grey’s Anatomy’ Renewed for Season 15 at ABC", "url": "https://www.hollywoodreporter.com/tv/tv-news/greys-anatomy-renewed-season-15-at-abc-1104738/", "description": "With the pickup, the Shonda Rhimes medical drama becomes ABC’s longest-running series ever.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/149059_2002_copy.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2018-04-20T21:15:00+00:00", "modified_time": "2018-04-23T00:18:23+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Grey’s Anatomy’ Renewed for Season 15 at ABC", "description": "With the pickup, the Shonda Rhimes medical drama becomes ABC’s longest-running series ever.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/04/149059_2002_copy.jpg?w=1296"}}, "movies": [], "publish_date": 1524258900.0, "source": "https://www.hollywoodreporter.com", "summary": ""}