{"url": "toofab.com/2018/05/14/lifetime-harry-and-meghan-a-royal-romance-made-us-cringe/", "text": "Lifetime\n\nLet's face it, \"Meghan & Harry: A Royal Romance\" was never going to be Oscar-worthy fare, but did it have to be so ... corny? This was based on true events, so how on earth (and why) did it follow the traditional formula of a Lifetime original movie, and every other bad Hollywood romance movie?\n\nSurely, the real romance of Prince Harry and Meghan Markle didn't follow all those familiar beats, including the pointless breakup, the best friend (in this case, mom) pulling your head out of your ass, and the dramatic airport reunion. If this is how it really played out, then our apologies to every Hugh Grant film from the 1990s. You guys totally nailed it!\n\nOn top of that, Princess Diana was apparently reincarnated as a fully-grown lion, racism is totally equivalent to being a redhead, and a relationship can be derailed by one line from your hairstylist. Also, did you know Meghan Markle is a strong and independent woman? Because she totally is and Lifetime wanted to make sure we got that message loud and clear from her first scene in the film and then again and again ... and again.\n\nShe's woke, y'all and those royals, they're so stuffy! Kate Middleton and Prince William may have gotten the worst edit of the whole film, while Queen Elizabeth II was, of course, the most progressive and forward-thinking among them. Really, most of the scenes in Kensington Palace sounded like they were written by Americans who had no idea what goes on there. Uh, they drink a lot of tea, right? And talk about tradition and what's proper, yeah? Nailed it!\n\nIn a sea of bad dialogue and worse deliveries from across the cast, these are the 19 offenders that kept us up tossing and turning all night. People get paid to write this stuff, y'all. Like actual money!\n\n1. \"Peter Pan can't stay in Neverland forever.\" Kate Middleton dressed down Prince Harry for his wild, partying lifestyle early in the film, using one of the most cliche lines ever. Did you know 'Peter Pan' was written on the British Isles? We think the writers had a book called \"British Stuff\" sitting in the writers' room for reference to come up with this stuff.\n\n2. \"Aren't you bored of being perfect yet?\" Harry actually said this to big brother William in the most unrealistic jab from one brother to another ever put to film. This was just the opening salvo of presenting William and Kate as the stiff and boring establishment. They were so two-dimensional they could slip out of a room through the crack in a closed door. But hey, this is Harry's movie and compared to Peter Pan, everyone else is boring!\n\n3. \"I'm gonna actually need you to hold off on the compliments until you apologize for being 40 minutes late.\" See how strong and independent she is? Meghan waits for no man... except she totally did. They actually played it off like she didn't know who he was, but then it turned out she just wasn't impressed. Because she's a strong and independent woman not looking for some prince to swoop her off her feet. This was a through-line of the script, trying to juxtapose this strong and independent woman not looking for a prince to sweep her off her feet who totally let a prince sweep her off her feet. By the end of the film, they finally had Meghan just admit that she was a walking contradiction. It's totally okay to be strong and independent and in love. It happens all the time, and yet this team couldn't figure out how to present it. That said, they did think the best representation for Princess Diana was a lion (twice!), so there's that.\n\n4. \"There's an emergency... with London Bridge... It's falling down.\" Harry has the worst get-out-of-a-bad-date strategy we've ever heard. He and the driver were totally confident that this would work. Apparently, Meghan derailed \"the usual\" simply by asking, \"What emergency?\" So everyone else is so smitten with Harry, they never get that far. This \"British Stuff\" book is just packed with details. Oh, and did you know Meghan is strong and independent?\n\n5. \"I actually wanted to be the first biracial female President of the United States of America but then I ended up as a briefcase girl on 'Deal or No Deal.'\" Nice. Way to dump on Meghan's ambitions and totally dismiss the big break that launched her career. But with the narrative about her being strong and independent (did we mention that?) so dominant, how can they reconcile that she would choose to be a ... briefcase girl. Because people aren't just one facet of their personality and she wanted a job and she smartly used that opportunity to build an acting career?\n\n6. \"Best blind date ever. Harry said this after they stayed up all night talking (no, really, just talking). To that we say to the writers, \"No. He didn't. Please, just stop.\"\n\n7. \"They're so loud.\" Oh you got us. Americans. They really are!\n\n8. \"You want to talk serious? Try being a ginger in England.\" Uh, no. No, Harry, that does not equate to being black or biracial in America. Like, not even close. This is how you try to relate to Meghan's experiences coming up in a racially-divided nation? Epic fail, dude!\n\n9. \"You do not want to end up royal roadkill.\" And with that one line from her hairstylist, Meghan went from mooning over Prince Harry to over him. Because this royal romance needed some trumped up royal drama. This strong and independent woman needs to reject Harry a few times before she decides he's worthy of her and she's willing to be swept off her feet. We've got two hours to fill, people!\n\n10. \"Kate and I binge-watched 'Suits' over the weekend. I love that phrase, 'binge-watched.'\" Prince William, fan of words, ladies and gentlemen. Didn't this guy used to be a person?\n\n11. \"How on earth did you get it so straight?\" Because they needed to create tension and drama where there likely wasn't, they found it in the royals and those close to them. This line was said by a family friend -- and Kate Middleton's apparent guide into royal life -- just before she literally tried to touch Meghan's hair. Yes, they did the white woman trying to touch the black woman's hair, because Annabella is both catty and racist. Royal racism. Was that in \"British Stuff\"?\n\n12. \"I think it might be the most romantic thing I've ever read.\" Kate said this after reading an open letter Harry dictated that tears into the press for their treatment of Meghan after their romance became public knowledge ... which really makes us think William needs to up his love letter game, or change tactics altogether.\n\n13. \"My tower ain't ivory, dude!\" Did we mention Meghan was strong and independent? One of the lines in Harry's letter was that he lamented he couldn't protect her from the media vultures, and so this was the line that led to her simply dumping him. We're pretty sure this sequence never happened, but the writers needed that breakup moment because that's what these movies do. Of course, we know how this story ends, so we didn't really need it, but it's hard to stray from a formula. For the record, the breakup lasted ... maybe an hour or two.\n\n14. \"My mother listened to me ... eventually. And I intend to listen to you now.\" It took him a minute, but Prince Charles is officially woke. Considering this is the man who married Diana in the first place, and then married again his true love Camilla, we're not so sure Charles is such a stickler for decorum and tradition as presented. But then we haven't seen the contents of \"British Stuff,\" and that is apparently the authority on these things.\n\n15. \"I love a dirty martini\" For the most part, Camilla was just a prop to hang off of Charles' arm, but she got one cheeky moment with Meghan after the \"loud\" American ordered such a daring drink as a dirty martini at Pippa Middleton's wedding reception. The royals, they're just like us!\n\n16. \"Let's face it, my most important contribution to this country is my reproductive ability. It's bizarre.\" Remember when William and Kate were getting married and she was incredibly interesting, with a rich personality. Lifetime even made a terrible movie about their romance. Well, Kensington Palace -- or KP as Harry coolly calls it -- must have stripped her of all of that. Hopefully, she never bothers to watch this.\n\n17. \"Everyone wants her to be this bloody angel and she played that up for the cameras, but in real life, she was complicated and sad and she could be difficult and funny. She had a wicked sense of humor.\" Please stop emoting, Harry. And are you angry about Diana, or proud? We get it, grief is a complicated process, but don't be too upset -- or not upset. She's a lion now and apparently visited you at least twice in your life. If Harry dies by getting eaten by a lion, this movie should feel terrible.\n\n18. \"This is going to change the way people see the world.\" Meghan's hairstylist to the rescue again, after introducing her to an adorable little black girl who looks up to Meghan because she's going to be a royal, and not because she's an actress fighting over how to deliver a line about seeing some dude in court. This was apparently the catalyst that convinced Meghan to quit her job and just go be a royal, because this has to be Meghan's decision. She's strong and independent, you know.\n\n19. \"Not sure why they have to make it while one's still alive.\" The queen is not a fan of \"The Crown.\" She even made sure Meghan wasn't on that show -- because unlike apparently everyone else in the palace, she never bothered to find out anything about Meghan before meeting her? This seems highly unlikely. Her people would have at least filled her in.", "images": ["https://images.toofab.com/image/3f/3by2/2022/10/05/3ffae1c2aa4b4ae08bba9ca0ffca7702_md.jpg", "https://images.toofab.com/image/0c/2by3/2022/10/03/0c8eaaa39c934072b49d2d26590b3acf_xs.jpg", "https://images.toofab.com/image/08/5by4/2018/04/10/0870c3fb649c5d899c4fe999b394a620_xs.jpg", "https://images.toofab.com/image/e8/5by4/2018/04/26/e8615088ddac547db9219bea79968427_xs.jpg", "https://images.toofab.com/image/72/5by4/2018/04/23/72bccbbc588451699250d0f09815308d_xs.jpg", "https://images.toofab.com/image/02/2by3/2022/10/06/02f8dae158224fef81315cde92fc9ef1_xs.jpg", "https://images.toofab.com/image/7b/4by3/2022/10/06/7ba6d79f88e14d70bffca38d3f38c318_sm.jpg", "https://images.toofab.com/image/39/2by3/2022/10/03/39d6ab76bda6491b896e9683c766c3f6_xs.jpg", "https://images.toofab.com/image/c7/16by9/2018/05/14/c747f28443ab51409b43b8d342346a01_xl.jpg", "https://images.toofab.com/image/26/5by4/2018/05/04/26a55ca7c17e5df3a70c58c9ea9aba1b_xs.jpg", "https://images.toofab.com/image/49/2by3/2022/10/07/49f6de19a159456189138e9c903768cd_xs.jpg", "https://images.toofab.com/image/06/2by3/2022/10/07/06987f7243784718b93e1692e8b75099_xs.jpg", "https://images.toofab.com/image/4a/2by3/2022/10/05/4ab592e0012c4eb98454932121fdd26d_xs.jpg", "https://images.toofab.com/image/9a/2by3/2022/10/05/9acbe7261a034df88e225ae344cc7b2a_xs.jpg", "https://images.toofab.com/image/b0/2by3/2022/10/05/b0deec921f8b44509a87f506c556a741_xs.jpg", "https://images.toofab.com/image/44/5by4/2018/04/16/44019e3b1d04511e9876b24e8540db70_xs.jpg", "https://images.toofab.com/image/d3/2by3/2022/09/30/d30f8b9e23b048888812dd3ff17ead97_xs.jpg", "https://images.toofab.com/image/01/4by3/2022/10/06/013d042ece3a4d118b04c8602c6f5ba9_sm.jpg", "https://images.toofab.com/image/2e/5by6/2022/10/07/2e19fe6a0f3844bb8a4f2cc475a9e16e_md.jpg", "https://static.toofab.com/toofab-web/img/toofab-logo-white.svg", "https://images.toofab.com/image/d3/2by3/2022/10/05/d3d12f54e0604ac681d1eb3b1444c7f3_xs.jpg", "https://images.toofab.com/image/70/4by3/2022/10/06/70ec19b507384877a3d5fd60b8f33bbf_sm.jpg", "https://images.toofab.com/image/64/5by6/2022/10/05/643d928365e2499a88cf9121fdde59dd_md.jpg", "https://images.toofab.com/image/2b/2by3/2022/10/06/2bbcf07aba1846b282ce6b184e453df8_xs.jpg", "https://images.toofab.com/image/07/2by3/2022/10/04/0724125990d24cb58f2a45d2f0245b19_xs.jpg", "https://images.toofab.com/image/54/o/2018/05/14/542647aa83fd59d0b8919a795e05cb6a_md.jpg", "https://images.toofab.com/image/b5/3by2/2022/10/06/b57c8717abd041158cf14bf322b41ea3_md.jpg", "https://images.toofab.com/image/a2/4by3/2022/10/05/a2112e7fc22c4fdda98ee922cc4bd6a2_sm.jpg"], "top_img": "https://images.toofab.com/image/c7/16by9/2018/05/14/c747f28443ab51409b43b8d342346a01_xl.jpg", "keywords": [], "authors": ["Toofab Staff"], "canonical_link": "https://toofab.com/2018/05/14/lifetime-harry-and-meghan-a-royal-romance-made-us-cringe/", "title": "19 Times Lifetime's 'Harry & Meghan: A Royal Romance' Made Us Cringe", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "google-site-verification": "JHSxtKhEsTL_hpvIJB7Z_rx6B--w25QC-LHhSPPDFbc", "verify-v1": "Wtpd0N6FufoE2XqopQJoTjWV6Co/Mny9BTaswPJbPPA=", "msvalidate.01": "AFEB17971BCF30779AEA662782EF26F4", "y_key": "14cb04e4656b0c58", "robots": "index,follow", "description": "Here's to hoping Prince Harry and Meghan Markle's royal wedding won't be as corny or tone-deaf as Lifetime's \"Harry & Meghan: A Royal Romance.\"", "article": {"publisher": "https://www.facebook.com/toofab"}, "og": {"site_name": "Toofab", "type": "article", "url": "https://toofab.com/2018/05/14/lifetime-harry-and-meghan-a-royal-romance-made-us-cringe/", "title": "19 Times Lifetime's 'Harry & Meghan: A Royal Romance' Made Us Cringe", "description": "Here's to hoping Prince Harry and Meghan Markle's royal wedding won't be as corny or tone-deaf as Lifetime's \"Harry & Meghan: A Royal Romance.\"", "image": "https://images.toofab.com/image/c7/16by9/2018/05/14/c747f28443ab51409b43b8d342346a01_xl.jpg"}, "twitter": {"site": "@Toofab", "card": "summary_large_image", "title": "19 Times Lifetime's 'Harry & Meghan: A Royal Romance' Made Us Cringe", "description": "Here's to hoping Prince Harry and Meghan Markle's royal wedding won't be as corny or tone-deaf as Lifetime's \"Harry & Meghan: A Royal Romance.\"", "image": "https://images.toofab.com/image/c7/16by9/2018/05/14/c747f28443ab51409b43b8d342346a01_xl.jpg"}, "application-name": "Toofab.com", "mobile-web-app-capable": "yes", "theme-color": "#f3f3f3", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-status-bar-style": "#f3f3f3", "apple-mobile-web-app-title": "Toofab.com", "msapplication-TileImage": "https://static.toofab.com/toofab-web/icons/msapplication-tile-image-270x270-v1.png", "msapplication-TileColor": "#282828", "msapplication-starturl": "https://toofab.com/?adid=IE9pin", "msapplication-navbutton-color": "#282828", "msapplication-window": "width=1024;height=768", "msapplication-tooltip": "Toofab.com", "msapplication-task": "name=Photos;action-uri=https://toofab.com/photos/;icon-uri=https://static.toofab.com/toofab-web/icons/favicon-32x32-v1.png"}, "movies": [], "publish_date": 1526252400.0, "source": "http://toofab.com", "summary": ""}