{"url": "https://web.archive.org/web/20150503143147/http://en.wikipedia.org:80/wiki/Wissam_Al_Mana", "text": "From Wikipedia, the free encyclopedia\n\nWissam Al Mana (born 1975) is a Qatari business magnate who co-owns and serves as Executive Director of Al Mana[1] a conglomerate which operates over 55 companies in 8 countries, primarily in the GCC region, and employs over 3,500 personnel. The group activities include automotive distribution and services, real estate and investments, retail, food & beverage, engineering, technology, media and entertainment. Operating over 300 outlets, Al Mana group represents some of the largest and most successful brands in the world, covering most areas of retail including luxury goods, beauty, fashion, home interiors, watches and jewelry.[2] Wissam Al Mana is frequently reported on in the media due to his 2012 marriage to pop superstar Janet Jackson.[3]\n\nEarly life and education [ edit ]\n\nWissam Al Mana was born in Qatar but moved with his family to London at age two where he spent his childhood and teenage years. Al Mana credits his early love of fashion and style to his upbringing in London.[4] At age 14 he began applying to every fashion boutique on Kings Road and found a weekend job at a multi-brand store, which gave Al Mana insight into the world of retail that would prove crucial to his career.[5] Upon completing his secondary education in London, Al Mana moved to the United States and obtained a Master's in Business Administration.\n\nCareer [ edit ]\n\nAl Mana serves as Executive Director of his namesake conglomerate which he co-owns with his two brothers, Hisham Saleh Al Mana and Kamal Saleh Al Mana. The company was founded by his father, whom Al Mana often cites as a major influence due to his work ethic, management style and humble demeanor. In press interviews Al Mana has said he joined the family business to carry on his father's name and legacy as a merchant.[6]\n\nThe Al Mana group achieves $1.5 billion in annual revenue and operates over 55 companies in Qatar, the United Arab Emirates, Kuwait, Saudi Arabia, Bahrain, Oman, the United Kingdom and Ireland, with over 300 outlets employing 3,500 personnel.\n\nAl Mana exclusively operates Infiniti, Nissan, Renault and National Car Rental in Qatar's auto sector.[7] Across the GCC, their retail holdings include Saks Fifth Avenue, Harvey Nichols, Hermès, Giorgio Armani, Dolce & Gabbana, Balenciaga, Alexander McQueen, Stella McCartney, Chloé, Giuseppe Zanotti, Agent Provocateur, Emporio Armani, Dior Homme, British Home Stores, Go Sport, Zara, Mango, Diesel, Sunglass Hut, Reebok, Crocs, Damas and Sephora.[8] Al Mana's food and beverage portfolio is composed partially of McDonalds, La Maison du Chocolat, Emporio Armani Caffe, illy, Haagen-Dazs, Grom, Gloria Jean's Coffees as well as the distribution of San Pellegrino and Acqua Panna products.[9]\n\nAl Mana group's real estate holdings including Doha Mall slated to open in 2016 (with a gross leasable area of over 1,000,000 square feet), Mirqab Mall to open in 2016, Al Waha Tower to open in 2017 (a 42 story development with a 5-star hotel), Citywalk Residence to open in 2017 (located on Citywalk Boulevard in the heart of Dubai, to contain ground floor retail units and 32 residential apartments) and Al Mana Tower (a 52 story group headquarters to house a 5-star hotel, residential apartments and a retail boulevard).[10]\n\nPersonal life [ edit ]\n\nWissam Al Mana is married to pop music superstar Janet Jackson.[11]\n\nReferences [ edit ]", "images": ["https://web.archive.org/web/20150503143147im_/http://bits.wikimedia.org/images/wikimedia-button.png", "https://web.archive.org/web/20150503143147im_/http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://web.archive.org/web/20150503143147im_/http://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://web.archive.org/web/20150503143147im_/http://bits.wikimedia.org/static/1.26wmf3/resources/assets/poweredby_mediawiki_88x31.png", "https://web.archive.org/web/20150503143147im_/http://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/Thumb_8df37ba5f8cab8104a3f1ed4cb48ea2d21d6272a_header_image_header.jpeg/220px-Thumb_8df37ba5f8cab8104a3f1ed4cb48ea2d21d6272a_header_image_header.jpeg"], "top_img": "https://web.archive.org/web/20150503143147im_/http://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20150503143147/http://en.wikipedia.org/wiki/Wissam_Al_Mana", "title": "Wissam Al Mana", "meta_data": {"generator": "MediaWiki 1.26wmf3"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}