{"url": "https://www.thecut.com/2017/09/life-of-kylie-recap-season-1-episode-7.html", "text": "Kylie Jenner, being normal. Photo: E!\n\nDolls, it’s nearing the end. With just one more week until the finale of Life of Kylie, let’s savor all the moments we have alone with our star. #LEGGO!\n\nScene 1\n\nIn this, the penultimate episode of E!’s situational dramedy Life of Kylie, the producers are still reaching for nuggets of Kylie’s life that have remained untouched by gossip outlets and Keeping Up With the Kardashians. A hardworking producer asks Kylie to tell the cameras something no one knows about her. Kylie’s response? She eats shrimp tacos every day. Following a recipe she learned from Karrueche Tran, Kylie (who’s now vegan) apparently serves up a plate of tacos for herself, daily. With this admission coming so late in the season, it’s a shame we couldn’t have spent at least one episode investigating whether or not Kylie has mercury poisoning. Kylie’s shocking dietary admission was filmed on April 24, 2017.\n\nWhat she should have filmed: Kylie’s current cosmetics rival, Rihanna, had beef with Kylie all the way back on April 24. You see, the kind souls of the internet discovered that Rihanna, Travis Scott’s ex, didn’t feel great about Scott’s current relationship with Kylie Jenner. On the 24th of April, it was reported that Ms. Fenty found their relationship to be “tasteless,” much like the tacos Kylie’s eating (the only seasoning in sight is Old Bay). Between bites, I’m sure Kylie had a lot to say about Rihanna’s comments — but I’ll give her production team the benefit of the doubt and assume her mic was just turned off.\n\nPhoto: E!\n\nScene 2\n\nAt her “therapist’s” office, Kylie talks to an unseen woman about the evolution of her lips. Kylie’s always been shy about that part of her appearance, and, as it turns out, one of her first kisses really drove the issue home. After kissing a boy as a teen, Kylie remembers him being shocked that she could kiss so well, considering the thinness of her lips. That really heightened Kylie’s insecurity, so she started overlining her lips in the hopes that it would make her feel “desirable and pretty.” Once the lip liner stopped cutting it she got them plumped up. This lip-themed scene was filmed on April 6, 2017.\n\nWhat she should have filmed: Kylie’s session was filmed right in the thick of Kylie’s relationship transition. Reports that she and permanent renter Tyga had split were out in the world, and she wasn’t publicly dating Travis Scott. With room for anything to happen, rumors spread that Kris Jenner was trying to set up her youngest child with Drake. I mean, if I were Kylie, I’d be telling my therapist that I currently feel my most “desirable and pretty,” considering someone wanted to set me up with a man with immediate name recognition.\n\nPhoto: E!\n\nScene 4\n\nProfessional family member and Lip Kit entrepreneur Kylie is seeking to add philanthropist to her credits! She’s almost there, but needs to cement her status. So she’s traveling to Peru to check out the Smile Train, an organization that she and Kylie Cosmetics have been supporting. Last year, Kylie debuted a Lip Kit named “Smile,” which was sold exclusively to support Smile Train’s mission, which is providing reconstructive surgeries to children with cleft lips in Peru. Kris is also joining Kylie on the trip — easy enough since Kylie, Best Friend Jordyn, and Assistant Victoria are all ready to fly from Los Angeles to Peru as a group. However, Kylie sends Victoria into a panic when she asks her assistant to ask Kris if it’s okay for the plane to pick up Kylie and Jordyn in Miami before heading to Peru. Victoria refuses to ask Kris herself, convincing Kylie that it will of course be better coming from her. Kylie’s hesitant and admits she’s scared of her mother. Still, she calls — and after some convincing, Kris agrees. This scene was filmed on May 26, 2017, almost three weeks after their trip to Peru on May 7.\n\nWhat she should have filmed: Instead of making sure their acting muscles worked on one another, Kris and Kylie should have had a frank conversation over FaceTime about Scott Disick prancing around Cannes with Kylie’s former friend Bella Thorne on his arm. Screw lying about on a plane to Miami, these two should have hopped a plane to France and really shook down the father of three and Disney star!\n\nPhoto: E!\n\nPhoto: E!\n\nPhoto: E!\n\nScene 5\n\nAn anxious Victoria shares a plane to Miami with Kris Jenner, who is none too pleased with Kylie. Kris appreciates that Kylie is out in the world having fun and dating, but she also thinks she needs to focus on her real goal: Being Kylie Jenner. Victoria agrees, but tries to remember that Kylie is only 19 (and is responsible “in her own way”). After one-on-one critiquing their child and boss, Kris and Victoria land in Miami. Kylie and Jordyn look exactly like two teens who spent the weekend partying in Miami would, and as a special gift to Kris, it’s mentioned that Kylie made sure to make out on the hood of her car with Travis before boarding. The hits don’t stop coming: Just as everyone’s getting settled, Jordyn realizes she doesn’t have her passport. Kris actually requests someone to “shoot” her, but thankfully no one has to once Jordyn finally finds her passport deep in a bag. This scene was filmed on May 7, 2017.\n\nWhat she should have filmed: While Kris and Victoria were chopping it up on a private jet, Kylie and Jordyn were busy having the time of their little underage lives in Miami. Of course, Kylie’s secret trip was with Travis, a man we’re still begging to see on our television screens. I would argue that we as a viewing community have been put through hell while being forced to watch Tyga on Keeping Up With the Kardashians — at the very least we deserve to enjoy moments with an actually talented person!\n\nPhoto: E!\n\nPhoto: E!\n\nScene 6 and Scene 7\n\nJust hours after landing in Peru, Kris invites Kylie and Jordyn to join her at a Michelin-starred restaurant in Lima with the Smile Train crew. The girls are reluctant to attend because they don’t have any fancy clothes, and have settled on a bun-and-no-makeup look for the day. Kris forces them to go, and while she waits for them to drag their feet out the door, she comments on how messy their room got in just a matter of hours. Kylie rolls her eyes at her mother’s shock, and in her confessional she tells the cameras that she’s not like either of her parents or even Kendall. Kylie blames it on the fact that she’s a Leo and her parents and sister are all Scorpios, signs that notoriously do not get along.\n\nThe group finally makes it to the restaurant, where Kris yet again forces Kylie and Jordyn to do something they don’t want to do: take a photo with the chefs. The girls forget a smize and go straight for a frown in the pictures, and keep that attitude throughout the whole meal. Kylie and Jordyn aren’t fond of the experimental food (which they compare to rocks) so they refuse to eat. Kylie asks her mom if she can leave, and Kris looks around at all of the other guests from the organization Kylie is there to promote and between her smiling teeth tells Kylie to “play ball, kid.” Kylie doesn’t want to play, so she and Jordyn pretend to get up to go to the bathroom and ditch the dinner. Kylie and Jordyn’s poor behavior was filmed on May 8, 2017.\n\nWhat she should have filmed: I’d like to think that Kylie and Jordyn were such sour pusses during their meal with the Smile Train workers because Kylie was upset over being cropped out of Diddy’s Met Ball photo. It’s possible Kylie felt like she couldn’t catch a break or real meal so she was acting out. Still, it would have been easier to digest seeing Kylie throw a tantrum over an Instagram snub instead of Peruvian food.\n\nPhoto: E!\n\nPhoto: E!\n\nPhoto: E!\n\nScene 8\n\nThe following day, Kylie, Kris, Jordyn, and Victoria head to the Smile Train facilities, where children have surgeries performed on their cleft lips. Before entering the hospital, the group tours the gift shop and marvels at statues that seem to be performing sexual acts. At the hospital, a little baby named Mia is headed into surgery. Kris and Kylie head in with her, and watch from the wings. Overcome with emotion for both Mia and her mom, who was very anxious for the surgery, Kylie’s grateful that she can help so many children and admits that any insecurities she has pale in comparison to their struggles. This scene was filmed on May 8, 2017.\n\nWhat she should have filmed: On May 8, even though she was all the way in Peru, Jordyn was facing one of her first Photoshop fail nightmares. After posting a photo from her and Kylie’s Miami trip, the internet happily dragged Jordyn for appearing to have Photoshopped her shins in a photo with Kylie. A suspicious curve in the carpet is what gave her away. In my personal opinion, it would have been productive for Jordyn to work through her emotions over being caught Photoshopping while on camera, especially after visiting the Smile Train facilities.\n\nPhoto: E!\n\nPhoto: E!\n\nPhoto: E!\n\nScene 9\n\nFollowing their successful visit to the Smile Train, Kylie and Kris treat themselves to an intimate dinner. Kris is emotional, and tells Kylie that she’s worried about her. Kylie’s mom thinks she’s running herself ragged jumping from city to city, and she should focus more on managing her business and brand. Kylie doesn’t think she’s doing anything wrong, since she just wants to be a normal 19-year-old who makes mistakes. That’s all it takes for a teary-eyed Kris to back down, and she tells Kylie that she’s the perfect “spokesperson” for her generation. Kylie agrees. This scene was filmed on May 11, 2017.\n\nWhat she should have filmed: It’s always great to see a mother and daughter bond, but ideally we would have heard Kylie’s opinions on the never-ending Caitlyn Jenner drama within her family. On the 11th of May, it was reported that Brody Jenner was strictly Team Caitlyn and was pretty disgusted with the Kardashians’ treatment of her during and after her transition, particularly Kim’s current vow of silence against Cait. We know that both Kylie and Kendall support both of their parents, but since they’re rarely seen interacting with their Jenner siblings, it wouldn’t hurt to get an update on those relationships.\n\nPhoto: E!\n\nPhoto: E!\n\nScene 10\n\nIn the final scene of the night, Kylie and Kris visit little Mia after her surgery. All is well with the child and her family, but Kris and Kylie are still emotional. Kris cries just looking at Mia, while Kylie asks the infant if she’ll even remember her. Mia doesn’t respond, so Kylie and Kris head out to take some photos. This scene was like Scene 8, and filmed on May 9, 2017.\n\nWhat they should have filmed: I truly love seeing Kylie being one with the people and doing house calls, but I know the only thing on her mind was jetting out of Peru to have some real fun. In fact, on that very day, Kylie’s sister Kendall and dear friend Bella Hadid were currently in Mexico jet-skiing for their lives! How beautiful would it have been to have the episode come full circle with Kylie asking Kris to drop her off in Mexico before landing in L.A.?\n\nPhoto: E!\n\nPhoto: E!\n\nAll right, Dolls, don’t miss me next week for the final Life of Kylie Minus Kylie’s Real Life recap! I know it’s sad, but don’t think of this as the end, think of this as one step closer to Keeping Up With the Kardashians! #BRINGBACKKEEPINGUPNOW", "images": ["https://pyxis.nymag.com/v1/imgs/e33/6e7/aed044d06bd5c293490430f400dc112e41-2022Cov4x5-AsianAmericaPkg.w240.jpg", "https://pyxis.nymag.com/v1/imgs/7b4/773/20cf94704d9c0130ae9567765e6cbfdc21-9-1-KylieDinner.rsquare.w700.jpg", "https://pyxis.nymag.com/v1/imgs/7ec/eae/1f3bb70ea6da3ea48a8171f1d551d1b82b-6-3-GirlsUpset.h473.w710.jpg", "https://www.thecut.com/media/components/customer-alert-banner/double_chevron.svg", "https://pyxis.nymag.com/v1/imgs/7b4/773/20cf94704d9c0130ae9567765e6cbfdc21-9-1-KylieDinner.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/c32/3bf/0a393283dc1f3f9257ff8b361ea03216c8-russia-missile.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/5ea/81e/4d3b39a96107c321338c0c9a25557bd47f-zarifa-ghafari.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/0a0/4c6/eb24d1fd4a07de1cd9ea2d69f0c03364dc-8-1-GiftShop.h473.w710.jpg", "https://www.thecut.com/media/components/customer-alert-banner/alert.svg", "https://pyxis.nymag.com/v1/imgs/ead/4d5/1c86ca205c2a48ae917a3a14b5ecf8d6c4-5-2-PlaneJK.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/c50/f3e/49a6856a232bf64374e3bb43ac941a61da-8-3-MiaSurgery.h473.w710.jpg", "https://www.thecut.com/media/components/customer-alert-banner/close_x.svg", "https://pyxis.nymag.com/v1/imgs/ed0/81a/c20048a5bb4373b2567f36ccfbae91f7ff-4-2-Kylie.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/c0b/5e3/49c56755f63ab0a204dc93dcf0b2fa4129-5-1-PlaneKrisVic.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/6d3/8c8/50daa979a9548bdc16e56f78f81d393e1f-10-3-JennersMia.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/31a/165/7b2cda49d5258316afceb071e56d8d3a8b-women-3.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/984/0cd/99e69f1a4ff339deac66592446bc2e4d44-2-1-Therapy.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/515/03d/6722860c2dcaff783493d18a004894faf8-10-2-GroupPic.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/506/fa9/2d600c6e72cbd38e36620d186bce2f2ba9-6-2-RestaurantPic.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/a6a/920/bf975da528fd49aa34a8c8caa07f125668-9-2-KrisDinner.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/65d/0d5/f053761ecd6dfb4e7bca9f7cb3f1f76897-6-1-Room.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/fcf/680/74387bcdc039d1e6f7276d326e738dcc47-8-2-Mia.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/5da/106/aab7d28bfbbb77d71420d82a9821973a0b-4-1-Texts.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/5ab/ba1/d510e02243f97840c24a4045d4fe6ef932-4-3-Kris.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/7aa/217/c24fbe0bdc78a8c29a8dcafd7dc383e26c-1-1-Tacos.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/7b4/773/20cf94704d9c0130ae9567765e6cbfdc21-9-1-KylieDinner.1x.rsocial.w1200.jpg"], "top_img": "https://pyxis.nymag.com/v1/imgs/7b4/773/20cf94704d9c0130ae9567765e6cbfdc21-9-1-KylieDinner.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["Mariah Smith"], "canonical_link": "https://www.thecut.com/2017/09/life-of-kylie-recap-season-1-episode-7.html", "title": "Kylie Jenner Just Wants to Be Normal", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "parsely-tags": "life of kylie, keeping up with the kardashians, kylie jenner, jordyn woods, kris jenner, tyga, culture, tv, celebrity, featuretype:tv recap", "og": {"title": "Kylie Jenner Just Wants to Be Normal", "url": "https://www.thecut.com/2017/09/life-of-kylie-recap-season-1-episode-7.html", "description": "This week’s Life of Kylie recap.", "image": "https://pyxis.nymag.com/v1/imgs/7b4/773/20cf94704d9c0130ae9567765e6cbfdc21-9-1-KylieDinner.1x.rsocial.w1200.jpg", "site_name": "The Cut", "type": "article"}, "twitter": {"title": "Kylie Jenner Just Wants to Be Normal", "description": "This week’s Life of Kylie recap.", "image": "https://pyxis.nymag.com/v1/imgs/7b4/773/20cf94704d9c0130ae9567765e6cbfdc21-9-1-KylieDinner.2x.rsocial.w600.jpg", "card": "summary_large_image", "site": "@TheCut"}, "article": {"published_time": "2017-09-11T18:24:43.584-04:00", "tag": "life of kylie, keeping up with the kardashians, kylie jenner, jordyn woods, kris jenner, tyga, culture, tv, celebrity", "publisher": "https://www.facebook.com/cut"}, "description": "On the seventh episode of the first season of Life of Kylie, Kylie Jenner travels to Peru with her mom, Jordyn Woods, and her assistant.", "robots": "max-image-preview:large", "sailthru.tags": "life of kylie, keeping up with the kardashians, kylie jenner, jordyn woods, kris jenner, tyga, culture, tv, celebrity", "author": "Mariah Smith", "fb": {"app_id": 343556435754245}, "type": "Article", "vertical": "The Cut", "apple-mobile-web-app-title": "The Cut", "application-name": "The Cut", "msapplication-TileColor": "#ff5656", "msapplication-TileImage": "https://assets.nymag.com/media/sites/thecut/icon.144x144.png"}, "movies": [], "publish_date": 1505168683.584, "source": "https://www.thecut.com", "summary": ""}