{"url": "https://en.wikipedia.org/wiki/Sophia_Grace_%26_Rosie", "text": "British duo-singers\n\nSophia Grace Brownlee (born 18 April 2003[1]) and her cousin Rosie McClelland (born 7 September 2006[2]), both from Harlow, Essex, England, make up Sophia Grace & Rosie, a duo of singers, child actresses and internet personalities. They quickly gained popularity, by making regular appearances on The Ellen DeGeneres Show, after posting a cover version of the Nicki Minaj song \"Super Bass\" that became popular on YouTube.[3] The video was originally posted to YouTube in September 2011 and has gained more than 55 million views as of May 2022.\n\nSophia Grace debuted with her solo single \"Girls Just Gotta Have Fun\" in 2013, followed by the single \"Best Friends\" in late 2014, the latter of which charted on the Billboard Hot 100. The music videos for each single appear on her official YouTube channel. As of May 2022, \"Girls Just Gotta Have Fun\" has more than 239 million views. After signing a recording deal with Capitol Records France, she released her third single \"Girl in the Mirror\" on iTunes in 2016 featuring rapper Silentó, along with its accompanying music video. Rosie started a YouTube channel centered around her life and started uploading vlogs and song covers. In May 2018, Rosie released her first solo single \"Handstand\".\n\nThe Ellen DeGeneres Show [ edit ]\n\nThey were first invited onto The Ellen DeGeneres Show in October 2011, after DeGeneres saw their cover of \"Super Bass\" on YouTube. The girls, then eight and five years old, became recurring cast members on the show. The girls eventually hosted their own segment, called \"Tea Time with Sophia Grace & Rosie\". In the segment, the duo invites and interviews guests over for tea, such as Miley Cyrus, Taylor Swift, Katy Perry, Hugh Grant, Julie Bowen, Harry Connick Jr., LL Cool J, Justin Bieber, and Reese Witherspoon, among others.[4] The segment won Sophia Grace and Rosie the \"Choice Webstar\" at the 2012 Teen Choice Awards. They have also been correspondents during red carpet events, such as the Grammy Awards, the American Music Awards, the Billboard Music Awards and the MTV Video Music Awards.\n\nGrace & McClelland both reappeared on Ellen in May 2022, their first appearance on the show in over 6 years, where they performed \"Super Bass\" together again, discussed the background behind going viral, plans for the future, and their new music releases.\n\nOther TV and film appearances [ edit ]\n\nThey both appeared in two episodes of Sam & Cat, the third episode (\"#TheBritBrats\") and the eleventh episode (\"#RevengeOfTheBritBrats\").[5] In early August 2013, Sophia Grace's representatives announced that she had been cast as Little Red Riding Hood in the Disney movie adaption of Into the Woods.[6][7] The announcement of her casting, which was never confirmed by Disney, was criticised as \"a stunt\" and was met with concern due to her age and the sexual undertones present between Little Red Riding Hood and the Wolf.[8] On 16 September 2013, the BroadwayWorld website announced that the film had \"kicked off production last week\" with Broadway star Lilla Crawford playing Little Red.[9]\n\nAfter the film's cast list was announced, Dominic Brownlee explained that his daughter had withdrawn from the movie, saying, \"After careful consideration, we as parents felt, as rehearsals progressed, that she was too young for this part. It was a joint decision between us and the director and producer of Into the Woods, to withdraw Sophia Grace from the film\".[10]\n\nSophia Grace went on to star in her own movie alongside Rosie, Sophia Grace & Rosie's Royal Adventure. The film was a straight to DVD release, produced by Nickelodeon. It was released in May 2014. According to TMZ, Sophia Grace was paid around $50,000 for the film; a five-picture deal signed by the cousins states that the older will earn $75,000 if a second and third installment are released, and $100,000 each for a possible fourth and fifth installment.[11]\n\nIn 2017, Sophia Grace began starring as a judge on the ABC reality series The Toy Box.[12] However, she did not return for the second season.[13]\n\nBooks [ edit ]\n\nThe duo have published two illustrated story books. The first book, entitled Tea Time with Sophia Grace & Rosie, was published 1 February 2013. It debuted at No. 2 on The New York Times Best Seller list of \"Children's Picture Books\", only outsold by Victoria Kann's Emeraldalicious (Pinkalicious).[14] The second book, Show Time with Sophia Grace & Rosie, was published on 25 March 2014, and also received commercial and critical success, like its predecessor. Both books were written by the girls and illustrated by Shelagh McNicholas. They were published by Orchard Books.\n\nSinging dolls [ edit ]\n\nIn April 2014, Just Play launched a two-doll pack containing two dolls of both Sophia Grace and Rosie. They were sold exclusively at Walmart stores for the first month, until made available at Claire's in May. Just Play teamed up with the girls to produce their own toy inspired by their love of dress-up, music, dolls and more. The dolls feature the two girls dressed in their trademark hot pink tutus and tiaras. Each doll is fully posable and comes with a matching microphone, ruffled socks, and shoes. The doll plays the real Sophia Grace singing Nicki Minaj's \"Super Bass\", when you press the doll's belly.\n\nDiscography [ edit ]\n\nSingles [ edit ]\n\nSophia Grace Year Title Peak chart positions Writer(s) Producer(s) Length US\n\n[15] 2013 \"Girls Just Gotta Have Fun\" — — Michael Busalacchi\n\nKelvin Craver 3:34 2014 \"Best Friends\" 87 Hi W. Jackson\n\nDominic Brownlee Donald Sales\n\nDa Beatfreakz 3:53 2016 \"Girl in the Mirror\" (featuring Silentó) — Dominic Brownlee\n\nSilentó\n\nK Nita\n\nEmile Ghantous\n\nKeith Hetrick Emile Ghantous\n\nKeith Hetrick 3:38 2017 \"Hollywood\" — — — 3:00 \"Got 2 Be\" — 2:54 \"UK Girl\" — 3:20 \"Why U Mad\" — 2:48 2018 \"Number 1\" (featuring AJ & Deno — 3:25 \"Can't Sleep\" — Shaun Barrett\n\nNaweed Sophia Grace\n\nBerynia Aigbe\n\nJahmahl Elliott 3:41 2019 \"My Zone\" (#MostWanted Sav & Sophia Grace) — — Br!dge 2:56 2022 \"Little Things\" — Sophia Grace\n\nAnthony Dixon\n\nPatrick Smith Anthony Dixon 2:34 Rosie McClelland 2018 \"Handstand\" — — — 3:06 2019 \"LaLa\" — 3:23 2020 \"Tik Tok\" — Alawn\n\nLauren Dyson Alawn 2:44 \"Girls\" — Alawn\n\nLauren Dyson\n\nTaylor Jones 2:38 2021 \"Throw It Away\" — KC\n\nAlawn\n\nTaylor Jones 2:48 \"Ready for Love\" — Lauren Dyson\n\nTaylor Jones 3:13 2022 \"Safe in Your Love\" — Lauren Dyson\n\nHarold Philippon 2:53", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/a/a1/SophiaGrace%26Rosie.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/SophiaGrace%26Rosie.jpg/220px-SophiaGrace%26Rosie.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/a/a1/SophiaGrace%26Rosie.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Sophia_Grace_%26_Rosie", "title": "Sophia Grace & Rosie", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/SophiaGrace%26Rosie.jpg/640px-SophiaGrace%26Rosie.jpg", "width": 640, "height": 620}, "title": "Sophia Grace & Rosie - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}