{"url": "www.independent.co.uk/arts-entertainment/tv/news/sarah-jessica-parker-kim-cattrall-feud-sex-and-the-city-molly-shannon-defends-divorce-costar-a8207936.html", "text": "Sign up to our free IndyArts newsletter for all the latest entertainment news and reviews Sign up to our free IndyArts newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nIndyArts email {{ #verifyErrors }}{{ message }}{{ /verifyErrors }}{{ ^verifyErrors }}Something went wrong. Please try again later{{ /verifyErrors }}\n\nOne of Sarah Jessica Parker's co-stars has jumped to the actor's defence amid her ongoing feud with Kim Cattrall.\n\nLast weekend, Parker was branded “cruel” by Sex and the City co-star Cattrall in a scathing Instagram post which saw her publicly criticise her co-star for a message she sent following the untimely death of her brother, Chris.\n\nMolly Shannon, who plays Parker's friend on HBO series Divorce, has deemed the actor “Hollywood royalty.”\n\n“I didn't read about that but I know, for me, Sarah is just so supportive and so wonderful and we just get along so well,” Shannon told Entertainment Tonight.\n\nReferencing Divorce, which was created by Catastrophe's Sharon Horgan, Shannon continued: “It doesn't really feel like work because we have so much in common, and she loves funny women and is just so genuinely supportive and kind, and, like, a girls' girl.”\n\nFollowing the sudden death of Cattrall's brother, Parker posted on social media: “Dearest Kim, my love and condolences to you and yours and Godspeed to your beloved brother. Xx.”\n\nTV preview 2018: Everything to look out for Show all 16 1 /16 TV preview 2018: Everything to look out for TV preview 2018: Everything to look out for Jessica Jones Starring:​ Krysten Ritter, Rachael Taylor, Carrie-Anne Moss, David Tennant Start date: 8 March, Netflix Netflix TV preview 2018: Everything to look out for The OA Starring: Brit Marling, Emory Cohen, Phyllis Smith, Patrick Gibson, Jason Isaacs Start date: 15 March, Netflix TV preview 2018: Everything to look out for Trust Starring:Hilary Swank, Brendan Fraser, Donald Sutherland, Harris Dickinson, Anna Chancellor Start date: 25 March 2018, AMC (Sky Atlantic air date TBA) FX Productions TV preview 2018: Everything to look out for A Series of Unfortunate Events Starring: Neil Patrick Harris, Malina Weissman, Patrick Warburton, Lucy Punch, Tony Hale, Nathan Fillion Start date: 30 March, Netflix TV preview 2018: Everything to look out for Atlanta Robbin Starring: Neil Patrick Harris, Malina Weissman, Patrick Warburton, Lucy Punch, Tony Hale, Nathan Fillion Start date: 30 March, FOX (UK air date TBA) Matthias Clamer/FX TV preview 2018: Everything to look out for Legion Starring: Dan Stevens, Rachel Keller, Aubrey Plaza, Jean Smart, Jemaine Clement Start date: 17 April, FOX 20th Television TV preview 2018: Everything to look out for The Alienist Starring: Daniel Brühl, Luke Evans, Dakota Fanning, Brian Geraghty Start date: 19 April, Netflix Warner Bros. Television Distribution TV preview 2018: Everything to look out for Westworld Starring: Evan Rachel Wood, Jeffrey Wright, Thandie Newton, Ed Harris, James Marsden Start date: 21 April, HBO TV preview 2018: Everything to look out for Fear the Walking Dead Starring: Kim Dickens, Lennie James, Frank Dillane, Alycia Debnam Carey, Colman Domingo, Maggie Grace Start date: 23 April, AMC on BT TV Richard Foreman, Jr/AMC TV preview 2018: Everything to look out for The Handmaid's Tale Starring: Elisabeth Moss, Joseph Fiennes, Samira Riley, Yvonne Strahovski, Ann Dowd Start date: 25 April, Hulu (Channel 4 air date TBA) Hulu TV preview 2018: Everything to look out for Better Call Saul Start date: TBA, Netflix Netflix TV preview 2018: Everything to look out for Call the Midwife series 7 Starring: Vanessa Redgrave, Kate Lamb, Stephen McGann, Leonie Elliott Vanessa Redgrave, Kate Lamb, Stephen McGann, Leonie Elliott Start date: TBA, BBC One TV preview 2018: Everything to look out for House of Cards Start date: TBA, Netflix Netflix TV preview 2018: Everything to look out for 13 Reasons Why Start date: TBA, Netflix TBA, Netflix TV preview 2018: Everything to look out for This Is Us season 2 Start date: TBA, Channel 4 TBA, Channel 4 Ron Batzdorff/NBC TV preview 2018: Everything to look out for Unforgotten series 3 Start date: TBA, ITV1\n\nCattrall later rejected Parker's message, accusing her of “exploiting our tragedy in order to restore your 'nice girl' persona.\"\n\nFollow Independent Culture on Facebook", "images": ["http://www.independent.co.uk/img/pixels-player-logo.svg", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/02/13/08/sarah-jessica-parker.jpg?quality=75&width=1200&auto=webp", "http://www.independent.co.uk/img/logo-white-out.svg"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/02/13/08/sarah-jessica-parker.jpg?quality=75&width=1200&auto=webp", "keywords": [], "authors": ["Jacob Stolworthy"], "canonical_link": "https://www.independent.co.uk/arts-entertainment/tv/news/sarah-jessica-parker-kim-cattrall-feud-sex-and-the-city-molly-shannon-defends-divorce-costar-a8207936.html", "title": "Sarah Jessica Parker defended by co-star over Kim Cattrall feud", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, user-scalable=no, minimum-scale=1.0, maximum-scale=1.0", "description": "Parker's Divorce co-star Molly Shannon called the actor 'wonderful and supportive'", "theme-color": "#EC1A2E", "amp-google-client-id-api": "googleanalytics", "robots": "max-image-preview:large", "fb": {"app_id": 235586169789578, "pages": "https://www.facebook.com/TheIndependentOnline"}, "category": "News", "sitename": "The Independent", "page path": "/arts-entertainment/tv/news", "page type": "Article", "adPageType": "Article Page", "og": {"locale": "en_GB", "updated_time": "2018-02-13T08:57:53.000Z", "site_name": "The Independent", "title": "Co-stars are weighing in on Sarah Jessica Parker and Kim Cattrall's feud", "url": "https://www.independent.co.uk/arts-entertainment/tv/news/sarah-jessica-parker-kim-cattrall-feud-sex-and-the-city-molly-shannon-defends-divorce-costar-a8207936.html", "type": "article", "description": "Parker's Divorce co-star Molly Shannon called the actor 'wonderful and supportive'", "image": {"identifier": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/02/13/08/sarah-jessica-parker.jpg?quality=75&width=1200&auto=webp", "secure_url": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/02/13/08/sarah-jessica-parker.jpg?quality=75&width=1200&auto=webp"}}, "article": {"published_time": "2018-02-13T08:57:53.000Z", "modified_time": "2018-02-13T08:57:53.000Z", "section": "Culture", "subsection": "TV & Radio", "author_name": "Jacob Stolworthy", "content_type": "story", "word_count": 353, "image_count": 1, "embed_count": 2, "video_count": 1, "internal_link_count": 3, "external_link_count": 3}, "date": "2018-02-13T08:57:53.000Z", "google-signin-client_id": "329250492844-uqochn2f1j5ljkshuap5gc7qphf1refj.apps.googleusercontent.com", "vf": {"owner": "viafoura-id:11000176299319"}, "twitter": {"title": "Co-stars are weighing in on Sarah Jessica Parker and Kim Cattrall's feud", "site": "@Independent", "card": "summary_large_image", "description": "Parker's Divorce co-star Molly Shannon called the actor 'wonderful and supportive'", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/02/13/08/sarah-jessica-parker.jpg?quality=75&width=1200&auto=webp"}, "keywords": "Sarah Jessica Parker,Molly Shannon,Kim Cattrall,Sex And The City,Divorce,Internal"}, "movies": [], "publish_date": 1518512273.0, "source": "http://www.independent.co.uk", "summary": ""}