{"url": "https://www.usatoday.com/story/life/entertainthis/2017/06/30/jay-z-444-complete-guide-album-disses-kanye-future-bill-cosby-oj-simpson/103312222/", "text": "JAY-Z's '4:44': A complete guide to the album's disses, from Kanye to Cosby\n\nAs one of hip hop's foremost elder statesmen, JAY-Z reserves the right to diss anyone he wants to. And on his new album 4:44 , he takes full advantage of his rap seniority, delivering blink-and-you'll-miss-it wordplay that punishes targets from Kanye and Future to Cosby and Bill Maher.\n\nBelow, revisit the long list of targets Jay slanders on 4:44.\n\nJAY-Z: Before we get to any of Jay's other targets, let's be clear about the person he spends the most time beating up on the album — himself. 4:44 is full of self-owns, showing the rapper kicking himself about his infamous elevator fight with Solange in the elevator on Kill Jay Z: \"You egged Solange on, knowin' all along, all you had to say you was wrong.\"\n\nKanye West: Before he turns on himself, Jay tears into Kanye West, his once-frequent collaborator before their friendship soured. Minutes into the album, on 4:44's very first track, Kill Jay Z, he alludes to allegedly giving Kanye $20 million to stay with TIDAL, only to see the younger rapper slander him onstage during his Saint Pablo tour days before his hospitalization.\n\n\"But you ain't a Saint, this ain't KumbaYe, but you got hurt because you did cool by Ye / You gave him 20 million without blinking, he gave you 20 minutes on stage, (expletive) was he thinking / '(Expletive) wrong with everybody?' is what you saying, but if everybody's crazy, you're the one that's insane.\"\n\nFuture: Many listeners interpreted this lyric on Kill Jay Z as a reference to his fellow rapper: \"I don't even know what you woulda done, In the future other (expletive) playin' football with your son.\"\n\nFuture went through a messy split with his ex Ciara, who later married Seattle Seahawks quarterback Russell Wilson. The exes made headlines with their spats over their son, whose dad allegedly didn't like spending time with Wilson. In this lyric, Jay seems to use Future's situation as a warning to himself to treat his family better, though he appears to slander his I Got the Keys collaborator.\n\nBecky with the Good Hair: \"I'll (expletive) up a good thing if you let me / Let me alone, Becky\" Jay raps on Family Feud, dispensing with the \"Becky\" that Beyoncé notoriously mentioned on her Lemonade track Sorry.\n\nO.J. Simpson: While Jay's The Story of O.J. track isn't entirely about Simpson, the track's first verse shows the rapper rolling his eyes at one of the disgraced football player's most notorious alleged quotes. \"O.J. like, 'I'm not black, I'm O.J.' ... Okay,\" he says.\n\nLa La Land: Jay was obviously rooting for Moonlight to win the 2017 best picture Oscar over La La Land. In addition to naming one of his 4:44 tracks Moonlight, he also dedicates the song's chorus to the losing film: \"We stuck in La La Land, even when we win, we gon' lose.\"\n\n\n\nAccording to Jay's iHeartRadio interview, the song is a direct reference to the 2017 Oscars. \"The hook is ‘We stuck in La La Land/Even if we win, we gonna lose,'\" he said. \"It’s like a subtle nod to La La Land winning the Oscar, and then having to give it to Moonlight. It’s really a commentary on the culture and where we’re going.\"\n\nBill Maher: Jay mentions the Real Time host dropping the n-word on a recent episode. \"House (expletive), don't (expletive) with me / I'm a field (expletive) with shined cutlery,\" he says on The Story of O.J.\n\nBill Cosby: There's no love lost between Jay and Bill Cosby, with the rapper putting down the disgraced comic, along with Al Sharpton, on Family Feud: \"Al Sharpton in the mirror takin' selfies / How is him or Pill Cosby supposed to help me?\"\n\nPrince's former lawyer: As Jay raps on Caught Their Eyes, \"I sat down with Prince, eye to eye / He told me his wishes before he died / Now, Londell McMillan, he must be color blind / They only see green from them purple eyes.\"\n\nBefore Prince died, he made a deal with TIDAL to make his music exclusive to Jay's streaming service. After the late singer's death, McMillan, serving as the adviser to the late singer's estate, granted other streaming services like Apple and Spotify access to Prince's catalog.", "images": ["https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png", "https://www.gannett-cdn.com/-mm-/5c78a63024033f7d837109d79a2ff620106bbd89/c=0-161-2210-1409/local/-/media/2017/06/30/USATODAY/USATODAY/636344286948946567-USP-NBA-FINALS-CLEVELAND-CAVALIERS-AT-GOLDEN-STAT-91368606.JPG?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/-mm-/6dbd2e9965b1fb2f06dacd55bdc5f1d8d28835ab/c=385-205-1691-1187/local/-/media/2017/06/30/USATODAY/USATODAY/636344286948946567-USP-NBA-FINALS-CLEVELAND-CAVALIERS-AT-GOLDEN-STAT-91368606.JPG?width=320&height=240"], "top_img": "https://www.gannett-cdn.com/-mm-/5c78a63024033f7d837109d79a2ff620106bbd89/c=0-161-2210-1409/local/-/media/2017/06/30/USATODAY/USATODAY/636344286948946567-USP-NBA-FINALS-CLEVELAND-CAVALIERS-AT-GOLDEN-STAT-91368606.JPG?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Maeve Mcdermott"], "canonical_link": "https://www.usatoday.com/story/life/entertainthis/2017/06/30/jay-z-444-complete-guide-album-disses-kanye-future-bill-cosby-oj-simpson/103312222/", "title": "JAY-Z's '4:44': A complete guide to the album's disses, from Kanye to Cosby", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/entertainthis/2017/06/30/jay-z-444-complete-guide-album-disses-kanye-future-bill-cosby-oj-simpson/103312222/life/entertainthis", "theme-color": "#ffffff", "og": {"type": "article", "title": "JAY-Z's '4:44': A complete guide to the album's disses, from Kanye to Cosby", "description": "There's even a Becky reference. But he points the finger at himself more than anyone else.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/5c78a63024033f7d837109d79a2ff620106bbd89/c=0-161-2210-1409/local/-/media/2017/06/30/USATODAY/USATODAY/636344286948946567-USP-NBA-FINALS-CLEVELAND-CAVALIERS-AT-GOLDEN-STAT-91368606.JPG?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "news_keywords": "Music,Bill Cosby,Hip hop,Rap music,Jay Z,Bill Maher,O.J. Simpson,Kanye West,iHeartMedia,Spotify,Academy Awards,Seattle Seahawks,Ciara,Football,Russell Wilson", "description": "There's even a Becky reference. But he points the finger at himself more than anyone else.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1498777200.0, "source": "https://www.usatoday.com", "summary": ""}