{"url": "https://www.oprahmag.com/life/work-money/a23869181/ashley-graham-career-advice/", "text": "Oprah once told a group of Harvard graduates: “There is no such thing as failure. Failure is just life trying to move us in another direction.” In our series The Setback, OprahMag.com digital director Arianna Davis chats with successful women about a life obstacle they thought was the worst thing that happened to them—until it ended up being the best thing.\n\nIn today's social media-driven culture, anyone can call themselves a \"trailblazer\" or \"influencer.\" But model Ashley Graham can actually claim both titles.\n\nAfter signing to Wilhelmina Models at age 14, the Lincoln, Nebraska native first grabbed national attention in 2010 when she appeared in a Lane Bryant commercial that was given limited airtime on networks like ABC and FOX because of its \"provocative\" nature.\n\nNow 31, Graham has since become synonymous with body positivity, paving the way for women of all sizes to receive the same treatment as the thinner women typically featured in mainstream media. She made history as the first plus-size model to appear in the pages of Sports Illustrated in 2015—then covered the magazine the following year. And when she's not modeling or serving as a judge on America's Top Model, she's collaborating with brands on size-inclusive collections, like her lingerie line with Addition Elle and her popular designs for .\n\nMac Pretty Big Deal with Ashley Graham Mac Pretty Big Deal with Ashley Graham Shop at iTunes\n\nIn short: Graham is a pretty big deal. Hence heraptly-titled podcast , which launched in October with a buzzed-about premiere episode with Kim Kardashian, followed by a sit down with Gabrielle Union. During each chat, Graham gets real about everything from the (a hot topic for Kardashian) and how white women can be better allies (Union's commentary is a must-listen). This week, Graham talks to Noor Tagouri, the journalist who was the first woman to ever be in the pages of while wearing a hijab, about Muslim identity.\n\nPretty Big Dealchallenges of marriagePlayboy\n\nAdding a podcast to the workload of a fashion world darling, designer, , and wife might sound like a lot to handle. But the move seemed like the natural next step for Graham, who made headlines in 2017 when she told Gayle King she considers the term plus-size \"divisive to women,\" arguing that the fashion industry shouldn't need to put different sizing into categories—they should just exist.\n\n\"I know it's cliché, but I've always wanted to be the Oprah of my generation—the girl who's giving you all of the inspiration by letting you know that I'm just like you and we all have the same struggles,\" Graham says. \"I wanted to create a space where women could feel the narrative shifting. But because TV is changing in so many ways, I was like, 'Why don't we just do it on a podcast?' The name comes from the fact that just like so many other women, I've been told 'You're pretty...for a big girl.' But we're not just pretty or big.\"\n\nLike many successful women in the public eye, Graham's journey behind the scenes hasn't always been as easy as it might appear through the lens of a bubbly Instagram feed. Here, the model opens up about the time she lost out on her dream gig—and how that taught her to work harder than ever.\n\nCourtesy of Ashley Graham.\n\nEvery model dreams of being on the cover of Vogue Italia. But up until about seven years ago, most magazines were not putting curvy girls front and center—especially historic brands like that one.\n\nBut somehow, I was in the running to be on Italian Vogue for the June 2011 cover featuring curvy models. This was a Huge. Deal. The legendary photographer Steven Meisel was shooting and Pat McGrath was doing the makeup. I walked into the casting like: \"Oh my God, this is my moment.\" By then, I had reached a pivotal time in my career where I was a regular in catalogues and the lingerie world, but I wasn't a household name yet. Still, I had quickly become one of the go-to curvy models, so I thought \"There's no way I'm not gonna get this job.\"\n\nThe casting went incredible. Immediately after, my agent called me and said: \"You're on hold for this job. There's a couple other girls on hold, but only a few have confirmed. I'll keep you posted.\" And I was thinking, Yes, amazing, I know I'm gonna get it, the photographer loved me. The shoot was all about curvy girls in sexy lingerie, diamonds, and pearls. I was like This is me! This is how I live my life! Okay, well maybe I don't really live my life in lingerie and diamonds and pearls, but I sure can make it look like I do!\n\nEven my agent said, \"You're right. This could be pretty bad.\"\n\nBut then the day before the shoot arrived, and I still hadn't been confirmed. I started frantically calling my agent—I was like, \"Um, I need to know if I should eat pasta or not tonight, because I may be on camera mostly-naked tomorrow!\" And then he said: \"Look, you got released for the first day, but you still have hope for the second day. I'm pushing for you, don't worry.\" Well, you can probably guess what happened: The next day, more frantic phone calls, and then the bomb from my agent: \"It's not going to happen, you didn't get it. But don't worry, there will be other jobs.\" I listened to him. I was disappointed, but I didn't worry; I went and ate some delicious pasta that night and quickly forgot about it.\n\nAnd then, a few months later, the magazine cover was released. And it was everywhere.\n\nWhen I tell you everywhere, I mean everywhere. I couldn't escape that cover. It went viral because no one had ever seen three curvy women on the cover of Vogue before—and not only that, but half naked and dripping in diamonds. It was so, so beautifully done, and those girls looked amazing.\n\nI called my agent and said: \"This is it. My career is over.\"\n\nVogue Italia.\n\nI know it sounds dramatic, but back then there wasn't a lot of space for us. So I thought, I'm never going to work in this higher fashion industry because these three gorgeous girls are going to take over. I mean, we all had very similar looks! Brown hair, full lips, very curvy. People I would meet started asking \"Are you that girl from the cover of Vogue Italia?\" I hated to having to say nope, that wasn't me. Even my agent said, \"You're right. This could be pretty bad. But let's just try to have a little faith.\"\n\nI'll admit, I had a lot of anxiety and obsessed over that cover for days—maybe even weeks. The thing that finally snapped me out of it was something my husband, Justin, told me. He said, \"That job wasn't yours because you didn't book it.\"\n\nNow I use my losses to fuel me and push me even harder.\n\nHe had to tell me that line, I'm not kidding you, probably about 20 times before I got it: \"That job wasn't yours because you didn't book it.\" The 20th time, I finally got what he meant. Why was I stressing out about this one magazine cover that, for whatever reason, was not meant for me? Why wasn't I using it as motivation to put my faith and my gratitude towards the future? That one cover wasn't for me—but that didn't mean others couldn't be. So I had to let it go.\n\nRelated Story Beyoncé's Publicist On How She Overcame Adversity\n\nThat was when I became totally focused on moving forward. To make up for that one missed cover, I worked twice as hard and took every opportunity that came my way. After that, any gig that I didn't book felt like a breeze. There were so many campaign and big-money jobs that I was in the running for that I didn't get, but when I didn't, it suddenly felt like no big deal after losing out on Vogue. I truly understood my husband's words: If I don't get something, it's because it wasn't mine to have in the first place.\n\nLooking back, that Vogue Italia cover gave me so much peace. I am so thankful to this day that I didn't get it, because it taught me such a huge life lesson. It was my aha moment that not everything is going to be yours. You're not always going to get what you want in life, and sometimes getting what you want means working twice—three times as hard.\n\nGetting turned down for that job also taught me humility. Just because I've seen some success doesn't mean I can walk into a job and think that it's mine for the taking. I have to work just as hard as anybody else to get the things that I want in life. I've always been a hard worker, but sometimes hard work just isn't enough. And that's okay. Now I use my losses to fuel me and push me even harder. And you know what? Last year, I was in the pages of Vogue Italia in my lingerie line—and they featured my photos unretouched. And that made my entire journey that much sweeter.\n\nWatch highlights from Graham's latest Pretty Big Deal episode here.\n\nArianna Davis Senior Director, Editorial & Strategy As Senior Director of Editorial & Strategy, I oversee all of Oprah Daily's digital content, from editorial to video to social media. I was previously the Digital Director of OprahMag.com, and before that, Senior Features Writer at Refinery29, where I also served as a video host and on-camera entertainment expert. Fun fact: I got my start in journalism as an intern at _O, The Oprah Magazine, so my role overseeing Oprah Daily's website is a major full-circle moment! On the weekends, I'm probably either having a margarita, adding new books I don't need to my TBR pile, or playing with my puppy, Leo.", "images": ["https://hips.hearstapps.com/hmg-prod/images/creative-workshop-at-school-royalty-free-image-1660579854.jpg?crop=0.679xw:1.00xh;0.117xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/couple-saving-money-in-piggybank-royalty-free-image-1663342013.jpg?crop=0.668xw:1.00xh;0.0680xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/dressforsuccess22822-1646072864.jpg?crop=0.502xw:1.00xh;0,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/black-women-s-equal-pay-day-hires-1663353329.png?crop=0.5xw:1xh;center,top&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/black-inventors-1x1-1581625386.png?crop=1.00xw:1.00xh;0,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/inherited-money-1650291704.png?crop=0.5xw:1xh;center,top&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/tbf-summit22-tory-20220614-embrace-ambition-summit-es-0182-1656338846.jpg?crop=1.00xw:1.00xh;0,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/stock-photo-of-an-open-notebook-page-with-a-pencil-royalty-free-image-1647290937.jpg?crop=0.668xw:1.00xh;0.210xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/ashleykim-1539804305.jpg?crop=0.750xw:1.00xh;0.155xw,0&resize=480:*", "https://hips.hearstapps.com/rover/profile_photos/3b9caef9-cb6f-4a91-9ba5-c5ee07a8cfd8_1538171176.JPG?fill=1:1&resize=80:*", "https://hips.hearstapps.com/vidthumb/images/ee-ss-thumbnail-1662493887.jpg?crop=0.470xw:0.835xh;0.519xw,0.00855xh&resize=180:*", "https://www.oprahmag.com/_assets/design-tokens/fre/static/images/logos/network-logo.77e98e3.svg", "https://hips.hearstapps.com/vidthumb/images/od-madeline-albright-frame-01-1648246457.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/voguecover-1539808130.jpg?crop=1xw:1xh;center,top&resize=320:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-107472814-1538933178.jpg?crop=1.00xw:0.307xh;0,0.0589xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/tiffany-irnise-lede-1636833574.jpg?crop=0.5xw:1xh;center,top&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/the-pivot-index-1658424391.gif?crop=0.502xw:1.00xh;0.250xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/pile-of-books-1-royalty-free-image-1583783603.jpg?crop=1.00xw:0.861xh;0,0.113xh&resize=180:*", "https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1539809608-170x170bb.jpg", "https://hips.hearstapps.com/hmg-prod/images/ashley-graham-1x1-gettyimages-918440836-1539799663.jpg?crop=1.00xw:0.502xh;0,0&resize=1200:*", "https://hips.hearstapps.com/hmg-prod/images/ashley-graham-1x1-gettyimages-918440836-1539799663.jpg?crop=1xw:1xh;center,top&resize=640:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/ashley-graham-1x1-gettyimages-918440836-1539799663.jpg?crop=1.00xw:0.502xh;0,0&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.oprahdaily.com/life/work-money/a23869181/ashley-graham-career-advice/", "title": "Ashley Graham Reveals the Moment That Made Her Think: \"My Career Is Over\"", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "X-UA-Compatible": "IE=edge,chrom=1", "msapplication-tap-highlight": "no", "title": "Ashley Graham Shares Her Career Advice And Biggest Lesson", "description": "The body positive plus-size model—who has a new podcast called \"Pretty Big Deal\"—says that losing out on her dream job was the moment that almost derailed her career.", "keywords": "ashley graham, ashley graham podcast, ashley graham workout, ashley graham career, plus size, plus size women, career inspiration, the setback, pretty big deal, inspiration, quotes", "theme-color": "#000000", "og": {"site_name": "Oprah Daily", "title": "Ashley Graham Reveals the Moment That Made Her Think: \"My Career Is Over\"", "description": "It was a lesson in hard work—and humility.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/ashley-graham-1x1-gettyimages-918440836-1539799663.jpg?crop=1.00xw:0.502xh;0,0&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.oprahdaily.com/life/work-money/a23869181/ashley-graham-career-advice/", "type": "article"}, "fb": {"app_id": 557569598006399}, "article": {"publisher": "https://www.facebook.com/oprahdaily/", "section": "Work & Money", "modified_time": "2021-11-02T01:20:10Z", "published_time": "2018-10-18T13:00:00Z"}, "twitter": {"site": "@OprahDaily", "image": "https://hips.hearstapps.com/hmg-prod/images/ashley-graham-1x1-gettyimages-918440836-1539799663.jpg?crop=1.00xw:0.502xh;0,0&resize=640:*", "card": "summary_large_image"}, "google-site-verification": "82jYkYSOEZ5GE7V8m8gSrd7kxTtY-J37c6cndvl60N8", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/ashley-graham-1x1-gettyimages-918440836-1539799663.jpg?crop=1.00xw:1.00xh;0,0&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/ashley-graham-1x1-gettyimages-918440836-1539799663.jpg?crop=1.00xw:1.00xh;0,0&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/ashley-graham-1x1-gettyimages-918440836-1539799663.jpg?crop=1.00xw:1.00xh;0,0", "auto-publish": "timely", "sailthru.excerpt": "Oprah once told a group of Harvard graduates: “There is no such thing as failure. Failure is just life trying to move us in another direction.” In our series The Setback, OprahMag.com digital director Arianna Davis chats with successful women about a life obstacle they thought was the worst thing", "sailthru.tags": "life,Lifestyle,work-money,Work & Money", "sailthru.date": "2018-10-18 13:00:00", "sailthru.socialtitle": "Ashley Graham Reveals the Moment That Made Her Think: \"My Career Is Over\"", "sailthru.contenttype": "standard-article", "m1": ".content-hed", "m2": ".content-dek p", "next-head-count": 46}, "movies": [], "publish_date": 1539867600.0, "source": "https://www.oprahmag.com", "summary": ""}