{"url": "https://en.wikipedia.org/wiki/World_of_Dance_(season_1)", "text": "Season of television series\n\nThe first season of American reality dance competition World of Dance premiered May 30, 2017, on NBC. Jennifer Lopez, Ne-Yo, and Derek Hough served as the judges, with Jenna Dewan serving as host. Hip hop dancers Les Twins, from Paris, France, were crowned as the winners of the $1,000,000 prize on August 8, 2017. Fourteen-year-old contemporary dancer Eva Igo and Latin/Swing group Swing Latino were named first runner-up and second runner-up respectively.\n\nDancers [ edit ]\n\nJunior (under 18) [ edit ]\n\nUpper (18 and over, up to 4 members) [ edit ]\n\nTeam (18 and over, 5–15 members) [ edit ]\n\n^1 Despite their Qualifier performance not being shown, this act's hometown and dance style were made available on the World of Dance website. Therefore, these acts do not have a determined average score.\n\n^2 MiniRequest, Kings Unite & Rhythmatic were the only groups not to have a full performance featured during their time on the show.\n\nQualifiers [ edit ]\n\nIn each round of the Qualifiers, the dance acts will perform a 2-minute routine in front of the judges and a live audience. They will be scored by the judges in 5 categories: Performance, Technique, Choreography, Creativity & Presentation. Each category is worth 20 points with a perfect score of 100. For the dance act to progress forward, they must receive an average score of 80 or higher.\n\nColor key:\n\nContestant was eliminated\n\nPart 1: May 30 [ edit ]\n\nPart 2: June 6 [ edit ]\n\nPart 3: June 13 [ edit ]\n\nThe Duels [ edit ]\n\nIn each round of The Duels, two acts in the same division compete for a spot in the next round. In each division, the acts with the top qualifying scores choose their opponents, then both acts perform back-to-back, receiving feedback from the judges. After each performance, the judges will score them in the 5 categories: Performance, Technique, Creativity, Choreography & Presentation. Unlike the Qualifiers, only the final average for each act is shown. The act with the highest average at the end of the duel moves on to the next round, the other faces immediate elimination.\n\nQualifying Acts Rank Upper Team Junior Name Score Name Score Name Score 1 Les Twins 95.7 Kinjaz 91.0 The Lab 91.3 2 Fik-Shun 91.0 Swing Latino 89.3 Diana Pombo 89.7 3 Pasión 87.7 Chapkis Dance Family 89.0 D'Angelo & Amanda 88.3 4 Nick Daniels 87.0 Super Cr3w 88.0 Eva Igo 88.0 5 Luka & Jenalyn 86.7 Jabbawockeez 86.7 The Mihacevich Sisters 87.0 6 Quick Style 86.7 Ian Eastwood and the Young Lions 83.7 KynTay 85.7 7 DNA 86.0 Royal Flux – The Posse 84.0 8 Keone & Mari 85.0 Rouge – Immabeast – 9 Kyle Van Newkirk 80.7 Miami All-Stars 81.0 Boys of Temecula 80.3 10 Kings Unite – Stroll Grove – Mini ReQuest – 11 – – Rhythmatic – – –\n\nSong Not Shown -\n\n\n\n\n\nThe Cut [ edit ]\n\nIn The Cut, the 15 remaining acts compete for two spots in each of their divisions. As each dance act competes, their final score is displayed on a leaderboard for their division. Once a dance act's score falls out of the top 2, they face immediate elimination. For this round, each of the judges became mentors for one of the divisions; Jennifer worked with the Juniors, Derek worked with the Upper acts and Ne-Yo worked with the Teams. Guest judge Misty Copeland joined the panel for this segment.\n\nThe Duels scores Rank Upper Team Junior Name Score Cut Rank Name Score Cut Rank Name Score Cut Rank 1 Les Twins 92.0 1 Swing Latino 91.7 2 Diana Pombo 91.3 2 2 Keone & Mari 91.3 2 Kinjaz 91.3 1 The Lab 89.7 3 3 Fik-Shun 90.7 3 Super Cr3w 89.0 4 Eva Igo 92.5 1 4 Luka & Jenalyn 88.7 4 Chapkis Dance Family 88.7 5 Immabeast 86.0 5 5 Pasión 87.3 5 Ian Eastwood and the Young Lions 85.7 3 The Mihacevich Sisters 81.0 4\n\nSong/Score Not Shown -\n\nDivisional Final [ edit ]\n\nIn the Divisional Final, the 2 remaining acts in each division square off, with only one act going to the World Final to represent their division. Continuing from the previous round, each of the 3 judges acted as mentors for the divisions; Jennifer worked with the Teams, Ne-Yo worked with the Upper acts and Derek worked with the Juniors. Keone and Mari were awarded the first and only 100 score of the entire season by Ne-Yo during the Divisional Final.\n\nThe Cut Scores Rank Upper Team Junior Name Score Name Score Name Score 1 Les Twins 93.5 Kinjaz 93.5 Eva Igo 92.5 2 Keone & Mari 93.2 Swing Latino 92.5 Diana Pombo 92.0\n\nOrder Division Dance Act Performance Song Judges' Score Ne-Yo Jennifer Derek AVERAGE 1 Team Kinjaz \"Work Song\" – Hozier 91 91 95 92.3 2 Swing Latino \"Gracias A La Vida\" – Mercedes Sosa 95 95 94 94.7 3 Upper Keone & Mari \"The Way You Look Tonight\" – Frank Sinatra 100 90 95 95.0 4 Les Twins \"Some Minds\" – Flume ft. Andrew Wyatt 99 99 95 97.7 5 Junior Diana Pombo \"Wild Things\" – Alessia Cara 90 89 89 89.3 6 Eva Igo \"Ready Or Not\" – Mischa \"Book\" Chillak ft. Esthero 96 97 97 96.7\n\nWorld Final [ edit ]\n\nIn the World Final, the final 3 acts competed head to head to win the one million dollar prize. As with the previous 2 rounds, the judges became mentors for each of the finalists; Jennifer worked with Les Twins, Derek worked with Swing Latino and Ne-Yo worked with Eva. Each of the 3 finalists performed twice; The first performance's music was chosen by one of the judges and the second was chosen by the finalist. After each performance, the final scores were displayed on a leaderboard. The winner of the World Finals was determined by the judges combined average scores from both performances. After the final performances, Les Twins were announced as the winners of World of Dance; their final combined score of 93.8 just barely edged out Eva Igo by 0.1 points.\n\nFinal Scores [ edit ]\n\nLes Twins (93.8)\n\nEva Igo (93.7)\n\nSwing Latino (93.2)\n\nContestants who appeared on other shows [ edit ]\n\nHighest Scoring Dances [ edit ]\n\nName Division Round Judges' Scores Ne-Yo Jennifer Misty Derek AVERAGE Les Twins Upper Divisional Final 99 99 – 95 97.7 Eva Igo Junior Divisional Final 96 97 – 97 96.7 Eva Igo Junior World Final 95 96 – 98 96.3 Les Twins Upper Qualifiers 95 96 – 96 95.7 Keone & Mari Upper Divisional Final 100 90 – 95 95.0 Swing Latino Team Divisional Final 95 95 – 94 94.7 Swing Latino Team World Final 93 95 – 96 94.7 Les Twins Upper World Final 94 97 – 93 94.7 Kinjaz Team The Cut 93 90 96 95 93.5 Les Twins Upper The Cut 90 94 98 92 93.5 Keone & Mari Upper The Cut 94 92 94 93 93.3 Les Twins Upper World Final 92 92 – 95 93.0\n\nRatings [ edit ]\n\nShow Episode title First air date Timeslot (EDT) Rating\n\n(18–49) Share\n\n(18–49) Viewers\n\n(millions) Nightly\n\nrank 1 The Qualifiers 1 May 30, 2017 Tuesday 10:00 p.m. 2.4 9 9.71[1] 2 2 The Qualifiers 2 June 6, 2017 1.9 7 8.42[2] 2 3 The Qualifiers 3 June 13, 2017 1.9 8 8.04[3] 2 4 The Duels 1 June 20, 2017 1.8 7 7.61[4] 2 5 The Duels 2 June 27, 2017 1.8 8 7.51[5] 2 6 The Duels 3 July 11, 2017 1.7 7 7.08[6] 2 7 The Cut 1 July 18, 2017 1.6 7 6.91[7] 2 8 The Cut 2 July 25, 2017 1.6 7 6.88[8] 2 9 Divisional Final August 1, 2017 1.7 7 7.00[9] 2 10 World Final August 8, 2017 1.9 8 8.00[10] 2", "images": ["https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/World_of_Dance_(season_1)", "title": "World of Dance (season 1)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "viewport": "width=1000", "og": {"title": "World of Dance (season 1) - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}