{"url": "https://www.hollywoodreporter.com/live-feed/bachelorette-finale-winner-did-rachel-lindsay-pick-bryan-abasolo-peter-kraus-1027450", "text": "[Warning: This story contains spoilers from the season finale of ABC’s Bachelorette.]\n\nBachelorette viewers were finally clued in on the identity of Rachel Lindsay’s man on Monday night’s finale. But the reveal did not play out as the audience anticipated.\n\nLindsay, who is ABC’s first black Bachelorette, picked Bryan Abasolo as the recipient of her final rose. In return, the Colombian chiropractor got down on one knee at the Rioja, Spain, proposal site and popped the question. After a season spent achieving many historic firsts to the 15-year-old franchise — and one that has been accused of race-baiting by highlighting race-fueled arguments — Lindsay’s choice remains a trailblazing one, as Abasolo joins a small handful of diverse winners in the show’s combined 34 seasons.\n\nHer decision also ranked as a first in the way it played out. The three-hour TV event traditionally airs a pre-taped two-hour season finale, followed by the live After the Final Rose special when the star reunites with both her winner and her runner-up. Heading into the finale with three finalists, however, shook up the order of things.\n\nOne by one, Lindsay’s eliminated men — first Eric Bigger in a traditional rose ceremony, followed by Peter Kraus in an unanticipated exit — appeared by Lindsay’s side to face the music. But the runner-up had never made it to the proposal site. Abasolo was the only one who got out of the limo for the traditional ending moment.\n\n“When we first kissed, it was literally like a chemistry bomb had exploded,” Abasolo said, before offering a Neil Lane engagement ring. “I am completely head over heels, totally absolutely in love with you. I just hope you feel the same.”\n\nShe replied, “My heart has never been more confused than it has been this week. I was trying to find cracks in what seemed like the perfect foundation. I have really, really had to do some soul-searching to find the courage to challenge myself, but this love has been so sure. It’s tested me in ways that I couldn’t have even imagined. I always said that I would know that the person I’m supposed to be with is the person I could never picture my life without, so right here, in this moment standing with you, I see my forever and I see my future.”\n\nShe then accepted his proposal with a resounding yes, only one day after Kraus’ intense and unplanned goodbye. Never before on The Bachelorette has a runner-up not made it to the proposal site.\n\nHer decision also marks the end of season-long speculation about whether or not Lindsay would pick a black contestant. The star, who told The Hollywood Reporter that she did not let race dictate her ultimate decision, has been open about the pressure from the African-American community to pick a black man and the anticipated backlash if she didn’t. Only one of her final three contestants, Bigger, would have fit that bill.\n\nTraditionally, the newly minted pair appears live on the annual ATFR special, where they update host Chris Harrison and Bachelor Nation about life after the show. Lindsay, however, joined Harrison at the top of the triple hour and, in another show first, commented on the show as it aired and reunited with her exes as they were eliminated.\n\nAbasolo was the last of the three to join Lindsay, who was forced to take a look back at their romantic, and at times rocky, courtship on the series, which began with Lindsay meeting 31 contestants for the reality dating franchise’s most diverse season ever. When he joined her during the live event, he re-proposed to Lindsay and told her that he never wants her to take the ring off ever again. The pair said they couldn’t wait to get to know each other in a “normal” sense and admitted that they hadn’t yet ironed out wedding details or where they plan to live. Lindsay is from Dallas and Abasolo hails from Miami, but they also threw Los Angeles into the mix.\n\n“I’m not one to hide and keep things in secret,” she said of what she’s most looking forward to. “I want to show this woman off,” he added.\n\nLindsay, who admitted that her family remains skeptical of the whole process, said that when she had to defend Abasolo against her family is the moment she knew he was the one for her: “He truly is my best friend.”\n\nWhen speaking to THR after the recent Men Tell All reunion special taping, Lindsay acknowledged the pressure to name a winner. “I’m happy and that’s all that really matters to me. And he’s happy too,” she said, adding that her code name for her fiance has been “Jerome.” Adding, “I hope everyone is happy with my decision, but I know I can’t please everyone.”\n\nPer show rules, she and “Jerome” have been living in hiding since filming wrapped months ago, and the negativity on social media has been one thing they weren’t prepared for. “You can never really prepare for it because we’re thrown into this public view and people all have their own opinions,” she had said weeks before the finale reveal. “They’ve all faced it, and my fiance definitely has as well. I think he’s handling it in the best way he can. And for me, I just have to be always positive and supportive.”\n\nAbasolo’s win continues the show’s trend of the first impression rose being a precursor to the final one. On the first night, Lindsay, 31, awarded Abasolo, 37, with the coveted rose, along with the first kiss.\n\nThe pair, whose chemistry was on display from the start, didn’t hit any road bumps until introducing one another to their families. During Abasolo’s hometown date to Miami, his mother told Lindsay she would “kill” her if she broke her son’s heart. When he met the Lindsay family, the star’s mother and sister strongly questioned his authenticity.\n\nBefore Lindsay arrived at her happy ending, she had two finalists to eliminate. Early on in the episode, following their Fantasy Suite date, Lindsay said goodbye to Bigger.\n\n“It’s hard to say goodbye when I have such strong feelings for you, it’s just that I have stronger feelings for the other two guys here,” she told the personal trainer. “It is important to understand that I do love you, I’m just not in love.”\n\nThough Bigger and Lindsay’s relationship didn’t ramp up until the end of the season, the 29-year-old was devastated by her decision. “Truth be told I’ll always love you, that’s just the truth,” he replied in a classy and heartfelt exit. Later in the limo, he confessed, “She was the one, for sure.”\n\nWhen speaking with Harrison, Lindsay echoed the words she said during Bigger’s goodbye. She contemplated running after his car and felt like she was potentially making a huge mistake. Breaking usual ATFR format, Bigger then appeared mid-episode to reunite with Lindsay, a face-to-face meeting that they both were visibly nervous to have.\n\n“It was tough, but I understood it,” he said, after asking Lindsay how her heart was and if she was happy. “You had to do what you had to do.” He said he was “absolutely” ready to propose: “Either I’m all in or I’m not, so I was ready.”\n\nIt was runner-up Kraus, however, who was dealt the biggest blow, his elimination silencing a loud majority of Bachelor Nation who had taken to social media to voice their opinions on who Lindsay should pick. There was also fervent social media support for Kraus to be named the next Bachelor if he didn’t win. (Harrison, however, told THR they won’t be announcing the next Bachelor until Bachelor in Paradise has had some time on the air.)\n\nAfter sharing his hesitations about proposing as the season went on, Lindsay ultimately told him that if he wasn’t ready to propose on the final day she didn’t want him to continue being on the show. Kraus told Lindsay that he wanted to continue being together but that he couldn’t commit to proposing. Though Lindsay’s family had applauded Kraus’ realistic timeline of taking things slowly after a reality TV courtship, Lindsay herself has been adamant about wanting a fiance at the end of the journey, and not a boyfriend.\n\n“My fear is you don’t have that same level of commitment,” she told him, later admitting to Harrison that she cried her eyelashes off about the breakup, which happened that night. “The hardest thing is saying goodbye to somebody I’m not supposed to be saying goodbye to.”\n\nKraus had been watching backstage and when he joined Lindsay on the couch, he opened up about regretting not being open enough to the process.\n\n“You were at your own pace,” she told Kraus during an icy and tense reunion. “I just don’t think this process is for you. You need more time. You need to see things through.” When Harrison brought up a comment he made about how life without him would be one of mediocrity, Lindsay did not accept his apology: “I’m living my best life.”\n\nThe emotional encounter continued, with Kraus saying he felt like he was being attacked and that he asked if he could reach out to Lindsay and was told no. Calling out his nervous and anxious feelings, he also said his feelings for her are still there. “I needed more experience with you, life experience,” he said, letting her know that he cried backstage while re-watching it play out.\n\nGoing into the finale, Lindsay had defended her picks and even provided a slight hint as to which man she would be picking in the end. Kraus had first confessed his proposal fears the same episode that Lindsay’s family put Abasolo through the wringer.\n\n“I want somebody who wants what I want AND wants it with me,” she wrote on Twitter after clarifying a conversation that aired between her and Kraus on their differing views of what it means to be engaged.\n\nUltimately, Lindsay said she had no regrets.\n\n“I’ve learned that he is exactly the person that he said he is, which is scary,” Lindsay told THR ahead of the finale. “Even in Fantasy Suites where you have off-camera time together, it’s not this extensive time, so you’re thrown into this world and you feel strongly for this person you want to spend the rest of your life with. But you’re also like, ‘Is this person the person they say they are?’ And I can honestly say that my fiance is even better than the way I thought he was. And that’s what’s been so great.”\n\nAs for her goals for life after the show, she had echoed what the pair said on Monday night, “We just want to bring our lives together, and I’m not sure how that will look or where we’ll be.” She added, “But I know that we just want to be together and get to know each other better and build on the foundation that we’ve already started.”\n\nThe day after the finale, Lindsay and Abasolo visited the morning shows to make their first rounds as a TV couple. When appearing on Good Morning America, co-host Michael Strahan asked them about the awkwardness of facing Kraus.\n\n“I knew that he wasn’t the one for me,” she said about Kraus and how she would have handled the finale if he had gone through with a proposal. “It was really important for me to not have two men standing up there at the end. If I knew what I was going to do, then I wanted to send that person home the night before.”\n\nAbasolo admitted that it’s always difficult to watch your fiancee “date 30 other men” and said he did not interact with Kraus during the finale special.\n\n“You feel a little frustration of how she was treated and the position she was put in for the simple fact that, here I am, totally committed, totally invested, totally ready to start a real future with this woman and then on the other end, you have someone who is indecisive, wishy-washy and at the same time, he’s telling her he’s in love with her and will propose,” said Abasolo.\n\nOn Live With Kelly & Ryan, Abasolo said they are thinking about tying the knot in December or January, since Lindsay has always wanted a winter wedding.\n\nLindsay also addressed criticism of Abasolo being dubbed her runner-up due to Kraus bowing out.\n\n“I think you can clearly see that I have a lot of love for Bryan and that he was the one for me,” she told co-host Ryan Seacrest. “I would have never just chosen the ring.” She also confirmed that she was the one who shut down Kraus’ request to communicate after he left the show, something he mentioned during the ATFR: “My focus was Bryan, I chose Bryan for a reason. Peter had his chance, that’s the back-and-forth I was talking about.”", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/08/13ee06de-7e8e-44c9-95fc-92f3a293ebb9.png?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/bach_finale.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/13ee06de-7e8e-44c9-95fc-92f3a293ebb9.png?w=1024", "keywords": [], "authors": ["Jackie Strause"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/bachelorette-finale-winner-did-rachel-lindsay-pick-bryan-abasolo-peter-kraus-1027450/", "title": "‘The Bachelorette’ Finale: Engaged Rachel Lindsay Reveals Her Winner in Historic Season", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Bryan Abasolo, Peter Kraus and Eric Bigger were the final three contestants of ABC's historic season of 'The Bachelorette.'", "news_keywords": "The Bachelorette", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Jackie Strause", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1027450, "title": "'The Bachelorette' Finale: Engaged Rachel Lindsay Reveals Her Winner in Historic Season", "published_at": "2017-08-07 19:36:45", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/13ee06de-7e8e-44c9-95fc-92f3a293ebb9.png?w=1024", "comment_count": 0, "tags": "The Bachelorette", "topics": "TV News", "body": "[Warning: This story contains spoilers from the season finale of ABC's Bachelorette.]\r\nBachelorette viewers were finally clued in on the identity of Rachel Lindsay's man on Monday night's finale. But the reveal did not play out as the audience anticipated.\r\nLindsay, who is ABC's first black Bachelorette, picked Bryan Abasolo as the recipient of her final rose. In return, the Colombian chiropractor got down on one knee at the Rioja, Spain, proposal site and popped the question. After a season spent achieving many historic firsts to the 15-year-old franchise — and one that has been accused of race-baiting by highlighting race-fueled arguments — Lindsay's choice remains a trailblazing one, as Abasolo joins a small handful of diverse winners in the show's combined 34 seasons.\r\nHer decision also ranked as a first in the way it played out. The three-hour TV event traditionally airs a pre-taped two-hour season finale, followed by the live After the Final Rose special when the star reunites with both her winner and her runner-up. Heading into the finale with three finalists, however, shook up the order of things.\r\n\r\nOne by one, Lindsay's eliminated men — first Eric Bigger in a traditional rose ceremony, followed by Peter Kraus in an unanticipated exit — appeared by Lindsay's side to face the music. But the runner-up had never made it to the proposal site. Abasolo was the only one who got out of the limo for the traditional ending moment.\r\n\"When we first kissed, it was literally like a chemistry bomb had exploded,\" Abasolo said, before offering a Neil Lane engagement ring. \"I am completely head over heels, totally absolutely in love with you. I just hope you feel the same.\"\r\nShe replied, \"My heart has never been more confused than it has been this week. I was trying to find cracks in what seemed like the perfect foundation. I have really, really had to do some soul-searching to find the courage to challenge myself, but this love has been so sure. It's tested me in ways that I couldn't have even imagined. I always said that I would know that the person I'm supposed to be with is the person I could never picture my life without, so right here, in this moment standing with you, I see my forever and I see my future.\"\r\nShe then accepted his proposal with a resounding yes, only one day after Kraus' intense and unplanned goodbye. Never before on The Bachelorette has a runner-up not made it to the proposal site.\r\n\r\nHer decision also marks the end of season-long speculation about whether or not Lindsay would pick a black contestant. The star, who told The Hollywood Reporter that she did not let race dictate her ultimate decision, has been open about the pressure from the African-American community to pick a black man and the anticipated backlash if she didn't. Only one of her final three contestants, Bigger, would have fit that bill.\r\nTraditionally, the newly minted pair appears live on the annual ATFR special, where they update host Chris Harrison and Bachelor Nation about life after the show. Lindsay, however, joined Harrison at the top of the triple hour and, in another show first, commented on the show as it aired and reunited with her exes as they were eliminated.\r\nAbasolo was the last of the three to join Lindsay, who was forced to take a look back at their romantic, and at times rocky, courtship on the series, which began with Lindsay meeting 31 contestants for the reality dating franchise's most diverse season ever. When he joined her during the live event, he re-proposed to Lindsay and told her that he never wants her to take the ring off ever again. The pair said they couldn't wait to get to know each other in a \"normal\" sense and admitted that they hadn't yet ironed out wedding details or where they plan to live. Lindsay is from Dallas and Abasolo hails from Miami, but they also threw Los Angeles into the mix. \r\n\"I'm not one to hide and keep things in secret,\" she said of what she's most looking forward to. \"I want to show this woman off,\" he added. \r\nLindsay, who admitted that her family remains skeptical of the whole process, said that when she had to defend Abasolo against her family is the moment she knew he was the one for her: \"He truly is my best friend.\"\r\n\r\nWhen speaking to THR after the recent Men Tell All reunion special taping, Lindsay acknowledged the pressure to name a winner. \"I'm happy and that's all that really matters to me. And he's happy too,\" she said, adding that her code name for her fiance has been \"Jerome.\" Adding, \"I hope everyone is happy with my decision, but I know I can’t please everyone.\"\r\nPer show rules, she and \"Jerome\" have been living in hiding since filming wrapped months ago, and the negativity on social media has been one thing they weren't prepared for. \"You can never really prepare for it because we’re thrown into this public view and people all have their own opinions,\" she had said weeks before the finale reveal. \"They’ve all faced it, and my fiance definitely has as well. I think he’s handling it in the best way he can. And for me, I just have to be always positive and supportive.\"\r\nAbasolo's win continues the show's trend of the first impression rose being a precursor to the final one. On the first night, Lindsay, 31, awarded Abasolo, 37, with the coveted rose, along with the first kiss. \r\nThe pair, whose chemistry was on display from the start, didn't hit any road bumps until introducing one another to their families. During Abasolo's hometown date to Miami, his mother told Lindsay she would \"kill\" her if she broke her son's heart. When he met the Lindsay family, the star's mother and sister strongly questioned his authenticity.\r\n\r\nBefore Lindsay arrived at her happy ending, she had two finalists to eliminate. Early on in the episode, following their Fantasy Suite date, Lindsay said goodbye to Bigger.\r\n\"It’s hard to say goodbye when I have such strong feelings for you, it’s just that I have stronger feelings for the other two guys here,\" she told the personal trainer. \"It is important to understand that I do love you, I'm just not in love.\"\r\nThough Bigger and Lindsay's relationship didn't ramp up until the end of the season, the 29-year-old was devastated by her decision. \"Truth be told I’ll always love you, that’s just the truth,\" he replied in a classy and heartfelt exit. Later in the limo, he confessed, \"She was the one, for sure.\" \r\nWhen speaking with Harrison, Lindsay echoed the words she said during Bigger's goodbye. She contemplated running after his car and felt like she was potentially making a huge mistake. Breaking usual ATFR format, Bigger then appeared mid-episode to reunite with Lindsay, a face-to-face meeting that they both were visibly nervous to have.\r\n\"It was tough, but I understood it,\" he said, after asking Lindsay how her heart was and if she was happy. \"You had to do what you had to do.\" He said he was \"absolutely\" ready to propose: \"Either I'm all in or I'm not, so I was ready.\" \r\n\r\nIt was runner-up Kraus, however, who was dealt the biggest blow, his elimination silencing a loud majority of Bachelor Nation who had taken to social media to voice their opinions on who Lindsay should pick. There was also fervent social media support for Kraus to be named the next Bachelor if he didn't win. (Harrison, however, told THR they won't be announcing the next Bachelor until Bachelor in Paradise has had some time on the air.)\r\nAfter sharing his hesitations about proposing as the season went on, Lindsay ultimately told him that if he wasn't ready to propose on the final day she didn't want him to continue being on the show. Kraus told Lindsay that he wanted to continue being together but that he couldn't commit to proposing. Though Lindsay's family had applauded Kraus' realistic timeline of taking things slowly after a reality TV courtship, Lindsay herself has been adamant about wanting a fiance at the end of the journey, and not a boyfriend.\r\n\"My fear is you don’t have that same level of commitment,\" she told him, later admitting to Harrison that she cried her eyelashes off about the breakup, which happened that night. \"The hardest thing is saying goodbye to somebody I’m not supposed to be saying goodbye to.\" \r\nKraus had been watching backstage and when he joined Lindsay on the couch, he opened up about regretting not being open enough to the process.\r\n\"You were at your own pace,\" she told Kraus during an icy and tense reunion. \"I just don’t think this process is for you. You need more time. You need to see things through.\" When Harrison brought up a comment he made about how life without him would be one of mediocrity, Lindsay did not accept his apology: \"I'm living my best life.\"\r\nThe emotional encounter continued, with Kraus saying he felt like he was being attacked and that he asked if he could reach out to Lindsay and was told no. Calling out his nervous and anxious feelings, he also said his feelings for her are still there. \"I needed more experience with you, life experience,\" he said, letting her know that he cried backstage while re-watching it play out.\r\n\r\nGoing into the finale, Lindsay had defended her picks and even provided a slight hint as to which man she would be picking in the end. Kraus had first confessed his proposal fears the same episode that Lindsay's family put Abasolo through the wringer. \r\n\"I want somebody who wants what I want AND wants it with me,\" she wrote on Twitter after clarifying a conversation that aired between her and Kraus on their differing views of what it means to be engaged. \r\nUltimately, Lindsay said she had no regrets.\r\n\"I’ve learned that he is exactly the person that he said he is, which is scary,\" Lindsay told THR ahead of the finale. \"Even in Fantasy Suites where you have off-camera time together, it’s not this extensive time, so you’re thrown into this world and you feel strongly for this person you want to spend the rest of your life with. But you’re also like, ‘Is this person the person they say they are?’ And I can honestly say that my fiance is even better than the way I thought he was. And that’s what’s been so great.\"\r\nAs for her goals for life after the show, she had echoed what the pair said on Monday night, \"We just want to bring our lives together, and I’m not sure how that will look or where we’ll be.\" She added, \"But I know that we just want to be together and get to know each other better and build on the foundation that we’ve already started.\"\r\n\r\nThe day after the finale, Lindsay and Abasolo visited the morning shows to make their first rounds as a TV couple. When appearing on Good Morning America, co-host Michael Strahan asked them about the awkwardness of facing Kraus.\r\n\"I knew that he wasn’t the one for me,\" she said about Kraus and how she would have handled the finale if he had gone through with a proposal. \"It was really important for me to not have two men standing up there at the end. If I knew what I was going to do, then I wanted to send that person home the night before.\"\r\nAbasolo admitted that it's always difficult to watch your fiancee \"date 30 other men\" and said he did not interact with Kraus during the finale special. \r\n\"You feel a little frustration of how she was treated and the position she was put in for the simple fact that, here I am, totally committed, totally invested, totally ready to start a real future with this woman and then on the other end, you have someone who is indecisive, wishy-washy and at the same time, he’s telling her he’s in love with her and will propose,\" said Abasolo.\r\n\r\n\tWATCH: @TheRachLindsay and Bryan join us on FaceTime as they make their way to @GMA this morning: https://t.co/jGJ0mfxdGD #TheBachelorette pic.twitter.com/1oWyIhl9Ve\r\n\t— Good Morning America (@GMA) August 8, 2017\r\nOn Live With Kelly & Ryan, Abasolo said they are thinking about tying the knot in December or January, since Lindsay has always wanted a winter wedding.\r\nLindsay also addressed criticism of Abasolo being dubbed her runner-up due to Kraus bowing out.\r\n\"I think you can clearly see that I have a lot of love for Bryan and that he was the one for me,\" she told co-host Ryan Seacrest. \"I would have never just chosen the ring.\" She also confirmed that she was the one who shut down Kraus' request to communicate after he left the show, something he mentioned during the ATFR: \"My focus was Bryan, I chose Bryan for a reason. Peter had his chance, that’s the back-and-forth I was talking about.\"", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘The Bachelorette’ Finale: Engaged Rachel Lindsay Reveals Her Winner in Historic Season", "url": "https://www.hollywoodreporter.com/tv/tv-news/bachelorette-finale-winner-did-rachel-lindsay-pick-bryan-abasolo-peter-kraus-1027450/", "description": "Bryan Abasolo, Peter Kraus and Eric Bigger were the final three contestants of ABC’s historic season of ‘The Bachelorette.’", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/13ee06de-7e8e-44c9-95fc-92f3a293ebb9.png?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2017-08-07T19:36:45+00:00", "modified_time": "2017-08-09T11:19:48+00:00"}, "twitter": {"site": "@thr", "creator": "@jackiedstrause", "card": "summary_large_image", "title": "‘The Bachelorette’ Finale: Engaged Rachel Lindsay Reveals Her Winner in Historic Season", "description": "Bryan Abasolo, Peter Kraus and Eric Bigger were the final three contestants of ABC’s historic season of ‘The Bachelorette.’", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/13ee06de-7e8e-44c9-95fc-92f3a293ebb9.png?w=1280"}}, "movies": [], "publish_date": 1502134605.0, "source": "https://www.hollywoodreporter.com", "summary": ""}