{"url": "https://www.independent.co.uk/arts-entertainment/tv/news/the-crown-season-3-trailer-prince-philip-tobiaz-menzies-netflix-air-date-a8510756.html", "text": "Sign up to our free IndyArts newsletter for all the latest entertainment news and reviews Sign up to our free IndyArts newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nIndyArts email {{ #verifyErrors }}{{ message }}{{ /verifyErrors }}{{ ^verifyErrors }}Something went wrong. Please try again later{{ /verifyErrors }}\n\nNetflix has released its first look at The Crown star Tobias Menzies in character as Prince Philip.\n\nThe British actor has replaced Matt Smith as the Duke of Edinburgh in the forthcoming season of the hit series which will enter a new era reflected by its revamped cast, including Olivia Colman and Helena Bonham Carter.\n\nBroadchurch star Colman will appear as Queen Elizabeth II, a role originally played by Claire Foy, while the latter will succeed Vanessa Kirby as Princess Margaret.\n\nTobias Menzies has replaced Matt Smith as Prince Philip in 'The Crown' (Netflix)\n\nShowrunner Peter Morgan, who has been recasting roles as the characters get older, has also appointed God's Own Country star Josh O'Connor as Prince Charles. Marion Bailey will play the show's new Queen Mother.\n\nThe one casting decision yet to be made is who will play the role of Princess Diana when she appears towards the end of the third season.\n\n\n\n​Menzies' TV credits include The Thick of It, Game of Thrones and the Ridley Scott-produced AMC horror series The Terror.\n\nTV preview: The 18 shows to look out for before the end of 2018 Show all 17 1 /17 TV preview: The 18 shows to look out for before the end of 2018 TV preview: The 18 shows to look out for before the end of 2018 Maniac 21 September, Netflix Starring: Jonah Hill, Emma Stone, Justin Theroux Emma Stone & Jonah Hill star as two people in a three-day drug trial which promises no complications or side-effects whatsoever… Things do not go as planned. Netflix TV preview: The 18 shows to look out for before the end of 2018 The Deuce 10 September, Sky Atlantic Starring: Maggie Gyllenhaal, James Franco, Dominique Fishback Picking up five years after the events of the first season, this new run will focus on the 'Golden Years' of the US porn industry in 1977. HBO TV preview: The 18 shows to look out for before the end of 2018 You 10 September, Netflix Starring: Penn Badgley, Shay Mitchell A dark 21st-century love story about an obsessive, yet brilliant twentysomething who uses the hyper-connectivity of today’s technology to make the woman of his dreams fall in love with him. Netflix TV preview: The 18 shows to look out for before the end of 2018 BoJack Horseman 14 September, Netflix Starring: Will Arnett, Paul F. Tompkins, Alison Brie The animated sitcom in which humans and animals live side-by-side returns for its fifth run. Netflix TV preview: The 18 shows to look out for before the end of 2018 Killing Eve 15 September, BBC iPlayer Starring: Sandra Oh, Jodie Comer, Fiona Shaw, Kim Bodnia Fleabag star Phoebe Waller Bridge's series follows a desk-bound MI5 officer, who begins to track down talented psychopathic assassin Villanelle. BBC America TV preview: The 18 shows to look out for before the end of 2018 American Horror Story: Apocalypse September TBA, FOX Starring: Sarah Paulson, Evan Peters, Cheyenne Jackson, Jessica Lange This crossover season featuring characters from 'Murder House' and 'Coven' will focus on Michaen Langdon, the antichrist born at the end of season 1. FOX TV preview: The 18 shows to look out for before the end of 2018 Sick Of It September TBA, Sky One Starring: Karl Pilkington, Sondra James, Craig Parkinson A new scripted comedy set in the mind of Karl Pilkington. YouTube TV preview: The 18 shows to look out for before the end of 2018 The Walking Dead 8 October, FOX Starring: Andrew Lincoln, Lauren Cohan, Jeffrey Dean Morgan New threats surface a year-and-a-half after the climax of All Out War which saw Rick defeat Negan in the battle against The Saviours. Gene Page/AMC Studios TV preview: The 18 shows to look out for before the end of 2018 The Romanoffs 12 October, Amazon Prime Starring: Christina Hendricks, John Slattery, Isabelle Huppert Anthology series from the creators of ‘Mad Men’ about the descendants of the last dynasty to rule Russia. YouTube TV preview: The 18 shows to look out for before the end of 2018 Chilling Adventures of Sabrina 26 October, Netflix Starring: Kiernan Shipka, Michelle Gomez, Miranda Otto Sabrina Spellman must reconcile her dual nature as a half-witch, half-mortal while fighting the evil forces that threaten her, her family and the daylight world humans inhabit. Netflix TV preview: The 18 shows to look out for before the end of 2018 Narcos: Mexico 16 November, Netflix Starring: Michael Peña, Diego Luna Episodes will chart the rise of the Guadalajara Cartel in the 1980s, with Luna playing Félix Gallardo and Peña playing the DEA agent chasing him. Netflix TV preview: The 18 shows to look out for before the end of 2018 Cold Feet series 8 Autumn TBA, ITV1 Starring: James Nesbitt, Hermione Norris, Fay Ripley The five pals - now in their 50s - return to our screens once again. ITV TV preview: The 18 shows to look out for before the end of 2018 Doctor Who Autumn TBA, Amazon Prime Starring: Jodie Whittaker, Tosin Cole. Mandip Gill. Bradley Walsh The 11th run sees Jodie Whittaker succeed Peter Capaldi as the beloved Time Lord. BBC TV preview: The 18 shows to look out for before the end of 2018 The First Autumn TBA, Channel 4 Starring: Sean Penn, Natasha McElhone, James Ransome New sci-fi drama about the first human mission to Mars from House of Cards' Beau Willimon. REX/Shutterstock TV preview: The 18 shows to look out for before the end of 2018 House of Cards season 6 2 November, Netflix Starring: Robin Wright, Michael Kelly, Jayne Atkinson President Claire Underwood takes centre stage in the concluding chapter of the political drama. YouTube TV preview: The 18 shows to look out for before the end of 2018 Kidding Autumn TBA, Sky Atlantic Starring: Jim Carrey, Judy Greer, Catherine Keener Following children’s TV star Mr Pickles whose off-screen life is much less of a fairytale than his on-screen persona. YouTube TV preview: The 18 shows to look out for before the end of 2018 Luther Autumn TBA, BBC One Starring: Idris Elba, Ruth Wilson The grizzled detective returns for a new story which unites him with serial killer-turned-ally, Alice Morgan. BBC\n\n\n\nThe Crown will return to Netflix in 2019. You can find the first look at Colman in character as Queen Elizabeth here.", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/08/28/10/tobias-menzies.jpg?quality=75&width=1200&auto=webp", "https://www.independent.co.uk/img/pixels-player-logo.svg", "https://www.independent.co.uk/img/logo-white-out.svg"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/08/28/10/tobias-menzies.jpg?quality=75&width=1200&auto=webp", "keywords": [], "authors": ["Jacob Stolworthy"], "canonical_link": "https://www.independent.co.uk/arts-entertainment/tv/news/the-crown-season-3-trailer-prince-philip-tobiaz-menzies-netflix-air-date-a8510756.html", "title": "The Crown season 3: First look at Tobias Menzies as Prince Philip", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, user-scalable=no, minimum-scale=1.0, maximum-scale=1.0", "description": "Showrunner Peter Morgan has been recasting roles as the characters get older", "theme-color": "#EC1A2E", "amp-google-client-id-api": "googleanalytics", "robots": "max-image-preview:large", "fb": {"app_id": 235586169789578, "pages": "https://www.facebook.com/TheIndependentOnline"}, "category": "News", "sitename": "The Independent", "page path": "/arts-entertainment/tv/news", "page type": "Article", "adPageType": "Article Page", "og": {"locale": "en_GB", "updated_time": "2018-08-28T09:57:05.000Z", "site_name": "The Independent", "title": "First look at Tobias Menzies as Prince Philip in The Crown", "url": "https://www.independent.co.uk/arts-entertainment/tv/news/the-crown-season-3-trailer-prince-philip-tobiaz-menzies-netflix-air-date-a8510756.html", "type": "article", "description": "Showrunner Peter Morgan has been recasting roles as the characters get older", "image": {"identifier": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/08/28/10/tobias-menzies.jpg?quality=75&width=1200&auto=webp", "secure_url": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/08/28/10/tobias-menzies.jpg?quality=75&width=1200&auto=webp"}}, "article": {"published_time": "2018-08-28T09:57:05.000Z", "modified_time": "2018-08-28T09:57:05.000Z", "section": "Culture", "subsection": "TV & Radio", "author_name": "Jacob Stolworthy", "content_type": "story", "word_count": 360, "image_count": 2, "embed_count": 1, "video_count": 1, "internal_link_count": 5, "external_link_count": 0}, "date": "2018-08-28T09:57:05.000Z", "google-signin-client_id": "329250492844-uqochn2f1j5ljkshuap5gc7qphf1refj.apps.googleusercontent.com", "vf": {"owner": "viafoura-id:11000176299319"}, "twitter": {"title": "First look at Tobias Menzies as Prince Philip in The Crown", "site": "@Independent", "card": "summary_large_image", "description": "Showrunner Peter Morgan has been recasting roles as the characters get older", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/08/28/10/tobias-menzies.jpg?quality=75&width=1200&auto=webp"}, "keywords": "The Crown,The Crown season 3,Tobias Menzies,Olivia Colman,Helena Bonham Carter,Prince Philip,Matt Smith,Netflix,Internal"}, "movies": [], "publish_date": 1535450225.0, "source": "https://www.independent.co.uk", "summary": ""}