{"url": "http://fortune.com/2017/10/18/billy-joel-has-made-35-million-this-year-alone/", "text": "There’s more to legendary singer-songwriter Billy Joel than his music.\n\nIn fact, the Piano Man is expecting his third child. His wife, Alexis Roderick, is pregnant, the couple confirmed in an interview with the Belfast Telegraph published on Wednesday.\n\nTheir child will enter Joel’s lucrative world and expansive family life, with two older siblings, an accomplished equestrian as a mother and a singer-songwriter father who has dominated the industry since he entered it decades ago.\n\nThe 68-year-old has a staggering net worth that has built up after years and years of touring and record sales. The father and Long Island-native is still touring the country with his Billy Joel in Concert series, and made tens of millions of dollars just within the last year.\n\nHow much is Billy Joel worth?\n\nWith decades of concerts, 13 studio albums and multiple tours over the course of decades, Joel has acquired a stunning amount of wealth. From June 2016 through June 2017 alone, Joel made $35 million, according to Forbes. Much of his earnings came from his concert series, bolstered by ticket and merchandise sales.\n\nBut Joel’s total net worth is several times more than that. While Forbes estimated his net worth in 2010 as $160 million, Joel said it is “north of that,” according to the 2014 biography Billy Joel, written by Fred Schreuers and detailed in the New York Daily News.\n\nOutside of his music, Joel has several multi-million dollar homes in New York and Florida, and has a fascination with yachts that stems from his Long Island upbringing.\n\nHow many kids does Billy Joel have?\n\nJoel currently has two children. He and Roderick welcomed their two-year-old Della Rose Joel in August 2015.\n\nJoel and model Christie Brinkley, one of his ex-wives, are the parents of 31-year-old Alexa Ray Joel, who has a singing career and appeared in Sports Illustrated’s swimsuit edition with her mother last year.\n\nWho is Billy Joel married to?\n\nJoel and Roderick married in 2015 — just a month before Della Rose was born — after dating since 2009. Roderick is a 35-year-old equestrian and former Morgan Stanley executive.\n\nRoderick is Joel’s fourth wife. Before her, he was married to Katie Lee, a 36-year-old cookbook author and TV food critic. They wed in 2004.\n\nPrior to that, Joel was married to model Christie Brinkley, mother to Alexa Ray and the inspiration behind his hit “Uptown Girl.” They were married for nearly a decade, and divorced in 1994.\n\nAnd a decade before Brinkley, Joel was married to author Elizabeth Weber. He was with her from Joel from 1973 to 1982.\n\nJoel is still friends with his three ex-wives, according to the Los Angeles Times.", "images": ["https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1242585998-e1665028070836.jpg?w=256&q=75", "https://content.fortune.com/wp-content/uploads/2017/10/billy-joel-baby-net-worth.jpg?w=1440&q=75", "https://content.fortune.com/wp-content/uploads/2017/10/billy-joel-baby-net-worth.jpg?resize=1200,600", "https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1243767517-e1665076497696.jpg?w=256&q=75", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1243581035-e1665068106964.jpg?w=256&q=75"], "top_img": "https://content.fortune.com/wp-content/uploads/2017/10/billy-joel-baby-net-worth.jpg?resize=1200,600", "keywords": [], "authors": [], "canonical_link": "https://fortune.com/2017/10/18/billy-joel-has-made-35-million-this-year-alone/", "title": "Billy Joel Has Made $35 Million This Year Alone", "meta_data": {"viewport": "width=device-width", "msapplication-TileColor": "#ffc40d", "theme-color": "#ffffff", "description": "There's more to Billy Joel than just his hit songs. Find out more about the singer's family and finances", "keywords": "billy joel, billy joel worth, net worth of billy joel, what is billy joel worth, how much is billy joel worth, net worth billy joel, billy joel baby, billy joel kids, billy joel wife, billy joel family", "og": {"url": "https://fortune.com/2017/10/18/billy-joel-has-made-35-million-this-year-alone/", "type": "article", "title": "Billy Joel Has Made $35 Million This Year Alone", "description": "And that money is going to be put to good use with his new baby on the way", "site_name": "Fortune", "image": "https://content.fortune.com/wp-content/uploads/2017/10/billy-joel-baby-net-worth.jpg?resize=1200,600", "width": 1024, "height": 683}, "twitter": {"card": "summary_large_image", "title": "Billy Joel Has Made $35 Million This Year Alone", "description": "And that money is going to be put to good use with his new baby on the way", "image": "https://content.fortune.com/wp-content/uploads/2017/10/billy-joel-baby-net-worth.jpg?resize=1200,600", "url": "https://fortune.com/2017/10/18/billy-joel-has-made-35-million-this-year-alone/"}, "next-head-count": 33}, "movies": [], "publish_date": 1508281200.0, "source": "http://fortune.com", "summary": ""}