{"url": "https://en.wikipedia.org/wiki/Elsa_Pataky", "text": "Spanish model and actress\n\nLafuente and the second or maternal family name is Medianu. In this Spanish name , the first or paternal surname isand the second or maternal family name is\n\nElsa Lafuente Medianu ( Spanish: [ˈelsa laˈfwente meˈðjanu]; born 18 July 1976),[1] known professionally as Elsa Pataky, is a Spanish model and actress. Pataky is known for her role as Elena Neves in the Fast & Furious franchise. She has appeared in the films Snakes on a Plane (2006), Giallo (2009) and Give 'Em Hell, Malone (2009). She also starred in the Spanish film Di Di Hollywood (2010).\n\nEarly life [ edit ]\n\nPataky was born Elsa Lafuente Medianu in Madrid, Spain,[1] the daughter of José Francisco Lafuente, a Spanish biochemist, and Cristina Medianu Pataky, a Romanian publicist.[2][3] She has a younger half-brother: Cristian Prieto Medianu, a cinematographic director. She uses the surname Pataky in homage to her maternal grandmother: Rosa Pataky.[4]\n\nPataky attended the Universidad CEU San Pablo,[5] studying journalism and taking acting classes. In addition to Spanish and Romanian, she is fluent in English, Italian, Portuguese, and French.[6][7]\n\nCareer [ edit ]\n\nPataky was a member of the Madrid theatre company Teatro Cámara de Ángel Gutiérrez. Eventually, she left school when she was cast in the television series Al salir de clase.[2] Some of her subsequent films were co-productions with the UK and France, which introduced her to working in English and French. She was in the cast of the television series Queen of Swords (2000) as Señora Vera Hidalgo, trophy wife of Gaspar Hidalgo and mistress of Captain Grisham, credited in the opening titles but appearing in only 14 of the 22 episodes. She also had a recurring role in the television series Los Serrano, playing teacher Raquel, who fell in love with her student Marcos (Fran Perea).[citation needed]\n\nPataky has appeared in over 10 Spanish films and co-starred in the French film Iznogoud (2004). She was also on the cover of August 2006 issue of Maxim. She was cast in 2009 in the Mexican series Mujeres Asesinas as Paula Moncada in the episode \"Ana y Paula, Ultrajadas\". She also starred in the action noir film Give 'Em Hell, Malone and Dario Argento's Giallo.[citation needed]\n\nPataky became the female face for the first collection of Time Force's jewelry line Ultimate Jewel, opposite football star Cristiano Ronaldo.[8] She played Officer Elena Neves in the movie Fast Five, with Dwayne Johnson as her partner, Luke Hobbs. MTV Networks' NextMovie.com named her one of the Breakout Stars to Watch for in 2011.[9] Pataky was a stand in for Natalie Portman in the post end credit scene in Thor: The Dark World.[10]\n\nPataky reprised her role as Elena Neves in Fast & Furious 6 (2013), Furious 7 (2015), and The Fate of the Furious (2017), the sixth, seventh and eighth installments of Fast & Furious film series respectively.[11]\n\nIn 2018, Pataky starred in the Australian web television series Tidelands as Adrielle Cuthbert. It was released on 14 December 2018 on Netflix.[12]\n\nPataky played the lead role in Interceptor, directed by Matthew Reilly, which was released in June 2022.[13]\n\nPersonal life [ edit ]\n\nShe dated French actor Michaël Youn from 2004 to 2006 and American actor Adrien Brody from 2006 to 2009.[14]\n\nShe started dating Australian actor Chris Hemsworth in early 2010 after meeting through their mutual representatives. Pataky and Hemsworth married during the Christmas holidays in 2010.[15] They have three children together: a daughter and twin sons.[16][17][18] In 2015, the family moved from Los Angeles to Byron Bay in Hemsworth's native Australia.[19]\n\nIn September 2012, Pataky won €310,000 in Spain's Supreme Court against publishing group Ediciones Zeta. In March 2007, Interviu magazine, owned by the Zeta, published topless photos of Pataky that had been taken with a long lens while Pataky was changing clothes during a photoshoot for Elle magazine. The Zeta group said it would appeal against the decision.[20]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nYear Title Role Notes 1997 Al salir de clase Raquel Alonso 192 episodes 1998 Tio Willy 1 episode La vida en el aire 13 episodes 2000 Hospital Central Maribel 2 episodes Queen of Swords Vera Hidalgo 14 episodes 2002 Clara TV movie Paraíso Luisa Episode: \"El cebo\" 2003 7 vidas Cristina Episode: \"La jaula de las locas\" Los Serrano Raquel Albaladejo 11 episodes 2005 Films to Keep You Awake: The Christmas Tale Ekran TV movie[24] 2009 Mujeres asesinas Paula Moncada Episode: \"Ana y Paula, ultrajadas\" 2018 Tidelands Adrielle Cuthbert Main role", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/9/9f/Elsa_Pataky_Cutout.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Elsa_Pataky_Cannes_cropped.jpg/170px-Elsa_Pataky_Cannes_cropped.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Elsa_Pataky_Cutout.png/220px-Elsa_Pataky_Cutout.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Elsa_Pataky_Cutout.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Elsa_Pataky", "title": "Elsa Pataky", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Elsa_Pataky_Cutout.png", "width": 640, "height": 960}, "title": "Elsa Pataky - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}