{"url": "https://www.hellomagazine.com/royalty/2018052348878/kate-middleton-meghan-markle-royal-firsts/", "text": "Meghan Markle is officially a member of the royal family and within three days of her wedding to Prince Harry, the former actress was already carrying out her first engagement. The new Duchess of Sussex attended a garden party at Buckingham Palace with her husband Harry and her in-laws, Prince Charles and the Duchess of Cornwall. In honour of Meghan's first official post-wedding appearance, we're taking a look at how her and Kate's 'firsts' compare, from their debuts as royal girlfriends, to their big reveals as royal brides…\n\nMeghan and Kate's first post-wedding engagements\n\nHarry and Meghan were back at work just three days after their wedding. The couple returned to London after their wedding in Windsor to attend the garden party, held in honour of Prince Charles' milestone 70th birthday. They had opted to delay their honeymoon to show their support for Harry's father.\n\nPrince William and Kate, meanwhile, enjoyed a romantic break in the Seychelles after their spectacular wedding in London in April 2011. With their batteries recharged, the couple carried out their first post-nuptials engagement one month later in May 2011, welcoming the Obamas at Buckingham Palace.\n\nKate and Meghan at their first post-wedding engagements\n\nMeghan and Kate's first reveal as a royal bride\n\nKate looked truly stunning as she arrived at Westminster Abbey. She took our breath away when she stepped out of her car, her bespoke Alexander McQueen gown and veil on full display. The moment when she took her father Michael Middleton's arm and her sister Pippa adjusted her train will go down in history. Meghan, too, played the fairy tale bride on her big day. She made a dramatic entrance at St George's Chapel, with her best friend Jessica Mulroney's twin sons, Brian and John, helping to carry her showstopping five-metre long veil.\n\nMORE: Kate reveals her favourite thing to do with George and Charlotte\n\nWatch Meghan and Kate's royal 'firsts' below!\n\nLoading the player...\n\nMeghan and Kate's first wedding kisses\n\nThe Duke and Duchess of Cambridge had their first wedding kiss on the balcony of Buckingham Palace shortly after their church service. \"Wow,\" Kate said, as she took in the thousands of well-wishers who had taken over the Mall. After some gentle persuasion from her husband William, Kate obliged and gave the crowds a second kiss. Harry and Meghan had their first kiss on the steps of St George's Chapel in Windsor. \"Do we kiss?\" Meghan asked her new husband. \"Yes,\" replied Harry as he leaned in. And a few minutes later during their carriage procession around Windsor, the newlyweds sweetly stole a second kiss.\n\nMORE: Ten surprising facts about Meghan's dress\n\nThe couples' first kiss at their royal wedding\n\nMeghan and Kate's first evenings as a Duchess\n\nKate changed into her second, dreamy Alexander McQueen dress for her reception at Buckingham Palace. The Duchess made her entrance with Prince William, Prince Charles and the Duchess of Cornwall. Harry and Meghan, meanwhile, hopped into their vintage Jaguar where the groom drove the couple from Windsor Castle to Frogmore House for their more exclusive wedding reception. Meghan's second dress was just as divine as the first – a Stella McCartney halter-neck style gown.\n\nKate and Meghan both looked stunning in their second wedding dresses\n\nMeghan and Kate's first royal walkabout\n\nIt wasn't until two months before their wedding that Kate took part in her first walkabout, meeting crowds in Trearddur, Wales. The Duchess had been in the spotlight for years, having dated William since university. Meghan, meanwhile, carried out her first walkabout just four days after her engagement to Prince Harry was announced, touring the city of Nottingham. The palace said the American bride-to-be was hoping to see as much of the UK as possible before the wedding.\n\nWATCH: Meghan Markle curtsies to the Queen at Christmas\n\nMeghan and Kate's first royal Christmas\n\nKate spent her first royal Christmas at Sandringham in 2011, the first year of her marriage. Traditionally, partners are not invited to spend the festive holidays with the Queen until they are married. Meghan was an exception though, as she made her Christmas debut just one month after her engagement.\n\nThe Duchess of Cambridge and the Duchess of Sussex at their first royal Christmas\n\nMeghan and Kate's first public appearance at her Prince's side\n\nThe Duchess of Cambridge was on hand to see William receive his RAF pilot wings in 2008. It would be another two years before the couple announced their engagement, and three before their royal wedding. But Harry and Meghan moved at a much faster pace, with the actress making her debut as a royal girlfriend in September 2017 at the Toronto Invictus Games. Two months later, they shared their engagement news.\n\nMeghan and Kate's first joint engagement together\n\nThe two Duchesses carried out their first joint engagement in March 2018. Kate and Meghan stepped out with William and Harry and dubbed the 'Fab Four', the royals inaugurated the first ever Royal Foundation Forum. Kate was heavily pregnant at the time with baby Prince Louis, while Meghan was just two months away from marrying Harry.", "images": ["https://images.hellomagazine.com/imagenes/comunes/1.gif", "https://images.hellomagazine.com/imagenes/comunes/social/menu-2021/tiktok.svg", "https://images.hellomagazine.com/himgs/css/hello/img/logo.png", "https://images.hellomagazine.com/imagenes/hfm-logo-black.svg", "https://images.hellomagazine.com/imagenes/comunes/social/menu-2021/pinterest.svg", "https://images.hellomagazine.com/imagenes/royalty/2018052348878/kate-middleton-meghan-markle-royal-firsts/0-241-720/meghan-and-kate-royal-firsts-t.jpg?tx=w_360", "https://images.hellomagazine.com/imagenes/comunes/social/menu-2021/facebook.svg?v2", "https://www.hola.com/imagenes/comunes/pixel-1x1.gif", "https://images.hellomagazine.com/imagenes/comunes/social/menu-2021/twitter.svg?v2", "https://images.hellomagazine.com/imagenes/royalty/2018052348878/kate-middleton-meghan-markle-royal-firsts/0-241-720/meghan-and-kate-royal-firsts-t.jpg", "https://images.hellomagazine.com/imagenes/comunes/social/menu-2021/snapchat.svg", "https://images.hellomagazine.com/imagenes/comunes/social/menu-2021/instagram.svg", "https://images.hellomagazine.com/imagenes/comunes/social/menu-2021/youtube.svg?v2", "https://sb.scorecardresearch.com/p?c1=2&c2=6035866&cs_ucfr=1&cv=2.0&cj=1"], "top_img": "https://images.hellomagazine.com/imagenes/royalty/2018052348878/kate-middleton-meghan-markle-royal-firsts/0-241-720/meghan-and-kate-royal-firsts-t.jpg", "keywords": [], "authors": ["Ainhoa Barcelona"], "canonical_link": "https://www.hellomagazine.com/royalty/2018052348878/kate-middleton-meghan-markle-royal-firsts/", "title": "Kate Middleton and Meghan Markle's royal 'firsts' compared", "meta_data": {"plantilla": "Plantilla de noticias (plantilla-noticias.html)", "title": "Kate Middleton and Meghan Markle's royal 'firsts' compared", "description": "We're taking a look at Kate Middleton and Meghan Markle's royal 'firsts' compared, from their first kiss at their wedding, to their first public appearances after the big day", "keywords": "Kate Middleton", "dc.title": "Kate Middleton and Meghan Markle's royal 'firsts' compared", "distribution": "global", "sailthru.tags": "kate-middleton,meghan-markle,british-royals", "sailthru.author": "Ainhoa Barcelona", "sailthru.affiliates": "true", "sailthru.date": "2018-05-23T16:51:45+01:00", "viewport": "width=device-width, initial-scale=1, user-scalable=yes", "news_keywords": "Kate Middleton", "og": {"title": "Kate Middleton and Meghan Markle's royal 'firsts' compared", "description": "We're taking a look at Kate Middleton and Meghan Markle's royal 'firsts' compared, from their first kiss at their wedding, to their first public appearances after the big day", "image": "https://images.hellomagazine.com/imagenes/royalty/2018052348878/kate-middleton-meghan-markle-royal-firsts/0-241-720/meghan-and-kate-royal-firsts-t.jpg", "updated_time": "2018-05-23T16:51:45+01:00", "url": "https://www.hellomagazine.com/royalty/2018052348878/kate-middleton-meghan-markle-royal-firsts/", "type": "article", "site_name": "HELLO!"}, "fb": {"admins": 89982930077}, "article": {"published_time": "2018-05-23T16:51:45+01:00", "modified_time": "2018-05-23T16:51:45+01:00"}, "twitter": {"card": "summary_large_image", "site": "@hellomag", "creator": "@hellomag", "url": "https://www.hellomagazine.com/royalty/2018052348878/kate-middleton-meghan-markle-royal-firsts/", "title": "Kate Middleton and Meghan Markle's royal 'firsts' compared", "description": "We're taking a look at Kate Middleton and Meghan Markle's royal 'firsts' compared, from their first kiss at their wedding, to their first public appearances after the big day.", "image": "https://images.hellomagazine.com/imagenes/royalty/2018052348878/kate-middleton-meghan-markle-royal-firsts/0-241-720/meghan-and-kate-royal-firsts-t.jpg"}, "hmn": "true", "sailthru.image.thumb": "https://images.hellomagazine.com/imagenes/royalty/2018052348878/kate-middleton-meghan-markle-royal-firsts/0-241-720/meghan-and-kate-royal-firsts-t.jpg", "robots": "max-image-preview:large", "botify-site-verification": "rAorMmkbfzd6yOwJ3PITFmdyCjOzGLug"}, "movies": [], "publish_date": 1527090705.0, "source": "https://www.hellomagazine.com", "summary": ""}