{"url": "https://www.usatoday.com/story/life/tv/2018/03/21/station-19-review-greys-anatomy-firefighter-spin-off-lacks-heat/442196002/", "text": "Review: 'Grey's Anatomy' firefighter spinoff 'Station 19' lacks heat\n\nShow Caption Hide Caption Video: What's worth watching this spring From family reunions to addictive dramas, here's what's coming to TV this spring. USA TODAY\n\nThere's just not enough sizzle to Station 19.\n\nABC's new Grey's Anatomy spinoff (Thursday, 9 ET/PT, ★½ out of four), takes a look at a different slice of Grey's Seattle universe, following firefighters as they respond to emergencies — which sometimes take them to Grey Sloan Memorial Hospital that's the setting of the long-running medical drama.\n\nStation, created by Stacy McKee and produced by Shonda Rhimes, marks ABC's attempt to create its own version of NBC's Chicago Fire franchise, with cast crossovers designed as ratings stunts. But that's a very low bar to aim for.\n\nThe new drama's biggest connection to Grey's is Dr. Ben Warren (Jason George), who spent eight seasons as an anesthesiologist and surgical resident. Now, for some reason never explained in the Station premiere, Ben has cast off his medical career to become a probationary fireman. His choice makes no sense and is more distracting than anything else. The series would have been better off excising his character and leaving the Grey's connection to brief cameos by Chandra Wilson, who plays Ben's wife, chief of surgery Miranda Bailey, and Ellen Pompeo (as Meredith Grey) in Thursday's premiere.\n\nBen isn't the focus of the series; he's the rookie character and, at least in the pilot episode, mostly just the butt of jokes for his abrupt career change.\n\nMore: See you on Netflix: An elegy for Shonda Rhimes’ ABC empire\n\nInstead, Station follows Andy Herrera (Jaina Lee Ortiz), the daughter of the station's captain (Miguel Sandoval), who's tough on the outside but vulnerable on the inside — groundbreaking, clearly — and the main reason the station keeps running. She's in a casual relationship with her co-worker, Jack (Grey Damon), who has bigger plans for their future than she does, and still has sexual tension with her former high-school sweetheart, police officer Ryan (Alberto Frezza). After an apartment fire sends the captain to Grey Sloan, Andy and Jack are named the team's interim leaders.\n\nLike For the People, another Rhimes drama that premiered this month, Station suffers by rehashing the tropes of the producer's established series: Grey's, Scandal and How to Get Away With Murder. Both series, likely to be Rhimes' last on ABC before she moves to Netflix, feature an eager, attractive group of young people with idealistic professional goals and some sexual tension mixed in, a formula that's worked before but feels overused in 2018. People is just a little more engaging, if only because it manages a quicker pace and slightly more interesting characters. Station has trouble making moments pop that don't involve daring fire and safety rescues.\n\nMore: The 'Scandal'-'How to Get Away With Murder' crossover is finally here\n\nStation is more a cheap facsimile of what made Grey's tick than a successful spinoff. It tries to ignite something new for the Grey's world, but just ends up flaming out.", "images": ["https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://media.gannett-cdn.com/29906170001/29906170001_5748709455001_5747970524001-vs.jpg?pubId=29906170001", "https://www.gannett-cdn.com/-mm-/c4203a6a0ed7e907c15a1937fe849d6655872e9e/c=0-116-2996-1809/local/-/media/2018/03/22/USATODAY/USATODAY/636573228769064732-148069-0776.jpg?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/c4203a6a0ed7e907c15a1937fe849d6655872e9e/c=0-116-2996-1809/local/-/media/2018/03/22/USATODAY/USATODAY/636573228769064732-148069-0776.jpg?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Kelly Lawler"], "canonical_link": "https://www.usatoday.com/story/life/tv/2018/03/21/station-19-review-greys-anatomy-firefighter-spin-off-lacks-heat/442196002/", "title": "Review: 'Grey's Anatomy' firefighter spinoff 'Station 19' lacks heat", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/tv/2018/03/21/station-19-review-greys-anatomy-firefighter-spin-off-lacks-heat/442196002/life/tv", "theme-color": "#ffffff", "og": {"type": "article", "title": "Review: 'Grey's Anatomy' firefighter spinoff 'Station 19' lacks heat", "description": "'Station 19' tries to recapture the sizzle of 'Grey's Anatomy,' but mostly falls flat.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/c4203a6a0ed7e907c15a1937fe849d6655872e9e/c=0-116-2996-1809/local/-/media/2018/03/22/USATODAY/USATODAY/636573228769064732-148069-0776.jpg?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "'Station 19' tries to recapture the sizzle of 'Grey's Anatomy,' but mostly falls flat.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1521590400.0, "source": "https://www.usatoday.com", "summary": ""}