{"url": "http://latimesblogs.latimes.com/washington/2010/10/christine-odonnell-chris-coons-debate.html", "text": "This article was originally on a blog post platform and may be missing photos, graphics or links. See About archive blog posts.\n\nThe Ticket live-blogged Wednesday evening’s debate and our coverage is here, starting here with a complete topic-by-topic summary of the candidates’ statements and answers. Below is the full transcript, as provided by CNN. A news video is embedded below.\n\n\n\nOn Thursday at 6 p.m. PDT, 9 p.m. EDT and 2 a.m. GMT, The Ticket will live-blog the sole debate between Republican Sharron Angle and Democrat Harry Reid in their race for Nevada’s Senate seat.\n\nAdvertisement\n\nFull transcript of the Christine O’Donnell-Chris Coons Senate Debate\n\nNANCY KARIBJANIAN, DELAWARE FIRST MEDIA: I’m Nancy Karibjanian for Delaware First Media.\n\nWOLF BLITZER, CNN ANCHOR: And good evening, I’m Wolf Blitzer from CNN.\n\nThank you so much for joining us for what’s certain to be one of the most widely watched events of this, the 2010 midterm election season.\n\nKARIBJANIAN: Let’s introduce the candidates. Joining us for this debate this evening, Democratic Chris Coons, welcome. And Republican Christine O’Donnell, welcome.\n\nCHRISTINE O’DONNELL, (R-DE) SENATORIAL CANDIDATE: Thank you.\n\nKARIBJANIAN: We also want to thank AARP Delaware and the American Cancer Society Cancer Action Network for their support making this debate possible.\n\nBLITZER: And let’s go through some of the rules, some of the ground rules for this 90-minute debate. It’s divided into two parts. Following a two-minute opening statement from each candidate, Nancy and I will pose questions. Responses to that initial question limited to two minutes with a one-minute rebuttal from the other candidate. And then there will be an opportunity for all of us to mix it up a little bit, to get into a discussion, and follow up. That’s the first hour. The first 60 minutes of this debate.\n\nThat will be followed by a 30-minute segment, during which we turn to the students here at the University of Delaware. They have questions.\n\nResponses to their questions will be limited to one minute. Each candidate will also have two minutes at the end for a closing statement.\n\nOur live audience here in Mitchell Hall understands, we hope, that there will be no applause during tonight’s debate. We want everyone to be quiet and listen and learn from these two candidates.\n\nA coin toss determined earlier the order for this evening. We begin with two-minute opening statements from each of the candidates, and we begin with Chris Coons.\n\nCHRIS COONS, (D-DE) SENATORIAL CANDIDATE: Thank you. Thank you, President Harker.\n\nTo our moderators, Wolf Blitzer, Nancy Karibjanian, and to our hosts, UD Center for Political Communications and Delaware First Media.\n\nThere’s a great deal at stake in this election for our state, for our families and for....\n\n... our country. All of us, regardless of our political leanings, recognize that Washington is broken. As I’ve traveled up and down the state the last nine months as a candidate listening to voters talk about the issues facing them in their daily lives, I’ve heard again and again their frustration with Washington and with elected officials who are putting narrow partisan agendas ahead of the good of our country and doing little to help millions of Americans out of work or on the verge of losing their homes or who are anxious about their futures.\n\nThe partisan gridlock in Washington has real implications for us in Delaware. There’s more than 35,000 Delawareans still out of work and nearly 3,000 families that have faced foreclosure this year. These aren’t just numbers. In Delaware, these are our neighbors. And we can’t simply stand by and watch Washington ignore us or them any longer.\n\nIn this election, Delaware’s voters face a clear and important choice between, on the one hand, my opponent, a candidate who wants to take our state and candidate back to the failed economic policies of the past, who values partisan bickering over compromise and solutions. And who I believe has extreme positions that threaten vital education programs and would abandon our commitment to our veterans.\n\nAnd on the other hand, in my case, a candidate with a proven track record of balancing budgets, finding bipartisan solutions, working with Delaware’s businesses large and small, helping to create jobs and spur growth.\n\nOver the next 90 minutes, I look forward to the chance to share with you my ideas and values, Delaware values that I learned growing up in Hokesen, working here in Newark with one of Delaware’s most innovative manufacturing companies and leading Delaware’s second largest government.\n\nI take seriously the idea this campaign is a job interview. And tonight’s debate is about giving Delaware’s voters an insight into which candidate has the experience, the values, and the ideas to best represent them and do the hard work of fixing what’s broken in Washington.\n\nThank you.\n\nKARIBJANIAN: Your opening statement.\n\nO’DONNELL: Thank you.\n\nThank you to our hosts and for everyone being here tonight. I’m running because I’m concerned about the direction of our country. The America we knew and grew up with is being threatened in the most serious way. In just three years, we will be paying $1 billion a day on the interest alone on our national debt.\n\nThe common sense men and women in this room, and all across Delaware, know this is not sustainable. Yet my opponent wants to go to Washington and rubber-stamp the failed spending bills that are coming from -- that have cost us 2.5 million jobs.\n\nThis is wrong. Uncle Sam needs to be cut off.\n\nWith your vote and your support, I want to go to Washington to create jobs based on private business, not your tax dollars. I want to fight to have our nation become debt free. I want to stop the tax hikes that are coming in January. I want to reach sustainable energy independence, support the military, and strengthen the security of our homeland. I want to fight to safeguard Social Security, improve education, and protect our constitutional liberties.\n\nAnd in an election year, when so much is at stake, just about every candidate says this, yet what distinguishes one candidate from another are the proposed solutions to reach these goals. I very much look forward to getting down to brass tacks with all of you over the next 90 minutes because I believe there is a clear choice in this election. A vote for my opponent will cost the average Delaware family $10,000 instantly between the January tax hikes and his vote for cap and trade.\n\nMost of us can’t afford that. If you think that government is too small and that your taxed too little, if you’re ever questioned whether America is a beacon of freedom and justice, then he’s your guy. But if you want a U.S. senator who will stand up to the Washington elite, who will put your interests ahead of the special interests, and make the tough decisions needed to rein in an out of control Washington, then I humbly ask you to vote O’Donnell for U.S. Senate.\n\nThank you.\n\nKARIBJANIAN: All right. We’re now getting into our question portion of the evening.\n\nAnd I’ll begin with you, Mr. Coons. Creating jobs to get America back to work clearly has to be a priority to do. Americans voted overwhelmingly for Democrats during the last election, because most felt that the Democrats would be able to fix the failing economy. Unemployment is at 9.6%, almost three quarters of Americans in the most recent CNN/Opinion Research Corporation poll said that the economy is still in a recession.\n\nSo why should the voters of Delaware trust a Democrat this time around?\n\nCOONS: Well, Nancy, thanks for your question. I think the voters of Delaware should trust this Democrat because of my combination of experience working in the private sector and working with the private sector. Hands-on work, helping one of Delaware’s most innovative companies expand and grow jobs and concrete and engaged work working with our Chamber of Commerce, our business roundtable, the Committee of 100, lots of groups who represent businesses large and small to effectively grow the economy.\n\nI’ve also presented as a candidate for the Senate concrete and real ideas.\n\nThey’re on my web site but I look forward to the chance to go over them in some detail tonight.\n\nI would advocate for a research and development tax credit and expand our tax credit that’s combined with a new manufacturing tax credit that advocates for companies that invent things here and make them here, getting an extra inventive.\n\nI also think we need to change the crazy tax policy in Washington that gives an incentive to American companies to shut down operations here and ship jobs overseas.\n\nThere’s other things I’ve proposed – expanding the home office tax credit, expanding a tax credit for starting a new business that employs folks within the first couple of years, fighting harder in trade policy to make sure we’re not letting our trading partners take advantage of us in trade deals that were signed over previous years, doing more in investment and innovation.\n\nAt the end of the day, I think Delaware has a long tradition of inventing and manufacturing world class products. The best way for us to get out of this recession is through growth. The best way to growth is by taking advantage of the skills and resources of a world class university like this one where we’re having this debate this evening and tying that to a stronger more qualified more capable workforce, giving it the resources and the energy it needs to be once again the leader in the world in creating high quality, high value manufacturing jobs.\n\nThose are some of the ideas I look forward to discussing more this evening. Thank you.\n\nKARIBJANIAN: Ms. O’Donnell, you have one minute for a rebuttal.\n\nO’DONNELL: Well, first, we have to keep in mind my opponent has a history of promising not to raise taxes on the campaign trail and then break those promises as soon as he takes office. Unemployment here in New Castle County rose, almost doubled in the last two years under his watch as New Castle county executive.\n\nNow, when it comes to the policies that he has said on the campaign trail, he will continue to rubber-stamp the spending policies coming from Washington. We were promised that the stimulus bill would create jobs. But instead it cost us 2.6 million jobs. We were promised that it would keep unemployment at 8%, but instead we see unemployment at 9.7%.\n\nThe Democrats are bragging that unemployment has leveled out, but while unemployment has leveled out, more people than ever are on food stamps and our welfare spending is higher than ever. This is not the right move. This is not a move towards real economic recovery. This is a move towards creating a culture of dependency.\n\nI believe the best thing the government...\n\nKARIBJANIAN: That’s the time, sorry.\n\nBut now we get to open it to discussion.\n\nO’DONNELL: Great.\n\nBLITZER: Well, what specifically, Ms. O’Donnell, would you do, specifically, to create jobs?\n\nO’DONNELL: What I think the best thing the government can do to get our economy back on real economic recovery is for -- to get out of the way of the small business owner and get out of the way of the entrepreneur.\n\nAnd the way you do that is to make sure these tax hikes don’t come in January. You begin to roll back some of the regulation that’s forced them to close their doors.\n\nA couple of that things I’m proposing. And number one, a temporary two-year tax holiday on the capital gains tax to give investors the money they need to reinvest in business, to permanently eliminate the death tax. That’s not only an unjust bill because we’ve paid taxes while we saved it, but it will also create 1.5 million new jobs.\n\nKARIBJANIAN: Let me just remind that we are in the discussion portion so you can interject here as well as we continue to discussion that point.\n\nCOONS: I’m not sure I understand what Ms. O’Donnell means when she says this is simply create ago culture of dependency and that her primary objective would be to end the endless regulation and red tape. She denounces the Obama administration, says its done nothing to promote job growth when frankly, just a few weeks ago, a new bill that would provide expanded SBA loan capacity, $30 billion worth of new lending capability, TARP funds that have been repaid, and are being repurchased towards small and midsized banks all over the United States. Real and concrete steps are being taken.\n\nI also frankly can’t imagine where she found the numbers that unemployment doubled in just the past year under my watch. I ssuspect we’re going to need to keep a close eye this evening on the numbers that go flying back and forth.\n\nBLITZER: Let’s ask her, where did you get those numbers?\n\nO’DONNELL: The Department of Labor statistics. And we’ll have them on our web site by tomorrow.\n\nBut I want to point out that he said that we’re not creating a culture of dependency. How would you explain what is happening when unemployment is leveled out, but more and more people are on food stamps? We’ve got to ask ourselves, what do we want Delawareans to be receiving, food stamps or paychecks? I say paychecks.\n\nCOONS: Obviously paychecks. We’d like to have Americans able to receive the benefits they need to get through incredibly difficult times. But to simply denounce people as being dependent because they’re applying for and receiving food stamps...\n\nO’DONNELL: Oh, Chris, that’s not fair...\n\nCOONS: ...in the worst recession in modern times...\n\nO’DONNELL: That’s not fair of you to say\n\nCOONS: Is frankly slandering people who are in incredibly difficult times.\n\nO’DONNELL: That fair of you to say that, because that’s not at all what I’m doing. I’m not the person who would cut the tax benefits for disabled and low-income senior citizens, as you did as county executive.\n\nBut what I’m proposing is to give these tax -- to make sure that the tax cults for our Delawareans do not expire this January. You have said that you will stop the tax cuts for the so-called rich. What you fail to realize is the so-called rich are the small business owner, the dry-cleaner down the street, the pizza shop owner who makes $300,000 before they pay their four employees, before they feed their own family...\n\nBLITZER: I’ll have you respond.\n\nCOONS: Ms. O’Donnell, we’re going to try to have a conversation here this evening, rather than just a diatribe if we possibly could. I think it would be helpful to have an exchange of ideas and let each of us take turns so thank you for moderating, Wolf.\n\nI think it’s important to look closely at some of the things Ms.\n\nO’Donnell’s thrown out on her new web site. Most of them are untrue.\n\nSome of them are flat-out lies. Some of them are mischaracterizations.\n\nSome are just factually untrue. So, I’m not going to stop every single time there’s something she throws out that I disagree with or I think is factually untrue.\n\nBut let me just say at the outset, that much of what you’ve put out, much of how you’ve characterized my record is incorrect. And if we simply sit here and say, that’s not true, we’re not going to make much progress.\n\nBLITZER: Do you support keeping the Bush tax cuts for all Americans or only those make under $200,000 a year?\n\nCOONS: I suppose extending the Bush tax cuts for the overwhelming majority of Americans. I don’t think we should draw an arbitrary line at $250,000. But the value that I will apply as deciding how much to extend, whether it goes up to $1 million or $2 million, or $5 millions that we’ve got a tough choice to make. Every increased tax cut, every extension that’s given, is going to cost, it’s going to increase the deficit, it adds to the debt.\n\nAnd here’s the primary value I would apply in deciding whether to extend all the Bush tax cuts and for how long. I think we should do those tax cuts that have the best chance of getting our economy going again...\n\nBLITZER: All right...\n\nKARIBJANIAN: We’re out of time though for this discussion.\n\nBLITZER: But you’re going to have an opportunity to get back into this discussion because this is issue number one – jobs, jobs, jobs. Also, the deficit. I want to get into the deficit right now. You’ve made the point that the national debt is exploding, the budget deficit is exploding right now. I want some specific meaningful cuts, if you’re elected a senator from Delaware, what would you cut in the federal budget? And don’t just say waste, fraud and abuse, because everybody says that. What would you cut specifically?\n\nO’DONNELL: That’s a great question because first of all we have got to tackle the deficit and the debt because our deficit is almost becoming equal to our national GDP. When your deficit -- a country’s deficit equals your GDP, that’s when your currency collapses, your market collapses. We’ve got to take drastic measures.\n\nBLITZER: So what would you cut?\n\nO’DONNELL: First of all, cancel the unspent stimulus bill. Second of all, put a freeze on non-discretionary -- on discretionary spending, put a hiring freeze on nonsecurity personnel. And then, of course, when we’re talking about cutting government spending, we’ve got to talk about waste, fraud and abuse.\n\nA recent report came out said we spend over $1 billion in Medicaid waste fraud and abuse. We’re talking about pharmacies billing for prescriptions given to dead people. We’re talking about home health care companies billing for patients who were in the hospital.\n\nSenator Coburn recently put out a report called schoolhouse pork that disclosed millions of dollars that were supposed to go to education funding that instead went to special favors.\n\nNow, special favors are something that my opponent knows very much about because he created 12 contingency funds so that he could pay out favors to special interest groups. The courts forced him to close 11 of them.\n\nBut of the one that remained open, he paid $53,000 in a men’s fashion show. He paid another -- more than $50,000, to appease liberal special interest groups.\n\nAt a time when he brags about balancing the budget by raising our taxes, cutting policemen pay, this is how he chooses to spend our tax dollars.\n\nWe’ve got to ask, do we want to send this gentleman to Washington, D.C.?\n\nI would say no.\n\nHe’s a career politician who has proven he knows how to play the I’ll scratch your back, you scratch mine game.\n\nBLITZER: You have a minute to respond.\n\nCOONS: There’s so much to respond to Wolf, a minute may not be enough.\n\nLet me get back to the focus of the question, is what would you do to tackle the deficit and the debt? I think we have some very large challenges in front of us. The overwhelming majority of federal spending is made up by defense spending, Medicare, Medicaid, Social Security and interest on the debt.\n\nWhile the president has proposed, and I would seriously consider supporting, a freeze on non defense discretionary spending for three years, which would achieve significant reductions. I’ve also identified on my web site a series of reductions that I would support. Some of them are in agricultural price supports. Some are in federal office space, for example, or hiring. And several are in defense programs.\n\nDefense acquisition that the Pentagon itself has already said they no longer need. The C-17 program for example, or the second engine for the F-35. There’s a variety of platforms and programs that I think we can simply do away with. As we invest in making our defense and our military more modern, more flexible, more responsive to the real threats we face in the modern world. And as we continue to achieve some savings through the BRAC program and other things that have shown a real capacity to save.\n\nKARIBJANIAN: Let’s open the discussion on correcting some of the financial issues here by talk about some of your own personal financial problems. And most people know about it by now, including an IRS lien that was for about $12,000 in taxes and penalties from ’05. There was the ’08 mortgage default judgment on your home. You just received your bachelors degree, as you said, because it took a decade to pay of the tuition.\n\nThe question, then is, how can voters rely upon your thoughts on how to manage the deficit if you’re having such personal financial issues of your own?\n\nO’DONNELL: Well, first of all, that IRS tax lien, the IRS already admitted that it was a computer error and my opponent should not be bringing that up, because as I’ve gone up and down the campaign trail, I’ve discovered there are thousands of Delawareans who have faced the same thing. An IRS mistake has caused them greatly, which is all the more reason why we need to reform the IRS, not put them in control of our health care.\n\nSecond of all, you mentioned education. I don’t have a trust fund. I didn’t come from a privileged, sheltered background as my opponent says he did...\n\nKARIBJANIAN:: Let’s stay to the issue of paying bills...\n\nO’DONNELL: I am. I paid for my own college education. I also have a graduate fellowship in constitutional government from the Claremont Institute. I know how hard it is to earn and keep a dollar. And one of the reasons why the Delawareans should be able to trust me is because when I did in this economy, I worked for nonprofit groups. Nonprofit groups were the first to have been hurt. When I fell upon difficult times, I made the sacrifices needed to set things right. I sold my house. And I sold a lot of my possessions in order to pay of my personal debt and to become in a stronger position.\n\nI have worked hard in order to get to the position that I am. So I can relate to the thousands of Delaware families that are suffering right now. And I’m stronger for it. I made it through to the other side. And that’s where -- leadership doesn’t count in whether or not you fall, it counts in whether or not you’ve gotten up and that’s what I’ve done.\n\nKARIBJANIAN: Let’s just remember we’re in the discussion portion so if you have anything you want to address on things that have been said on this topic thus far, go for it.\n\nCOONS: Well Nancy, I frankly think that we need to focus in this debate this evening and in the campaign, not on personal financial difficulties or background earns but on the issues in front of us, the things that Delawareans are concerned about – how do we tackle the deficit and debt, how do we get Delaware back to work?\n\nThere’s been lots of discussion in the national media about things my opponent has said or done that I frankly think are a distraction from the core issues that Delawareans ask about – ask both of us about.\n\nO’DONNELL: You’re just jealous that you weren’t –\n\nCOONS: What would you do in Washington?\n\nO’DONNELL: -- on ‘Saturday Night Live.’\n\nCOONS: I’m – I’m dying to see who’s going to play me, Christine.\n\nBLITZER: Well, let’s – on a serious note, let’s get through some of the accusations that she’d made and – and we’ll give you a chance to respond.\n\nCOONS: Please.\n\nBLITZER: That –\n\nCOONS: On the idea that somehow I was the one responsible for being sued for creating 11, 12 – she’s confusing me with my predecessor, Tom Gordon.\n\nBLITZER: What we’re talking about is County Executive –\n\nCOONS: Yes.\n\nBLITZER: -- New Castle County Executive. You raised property taxes, according to reports, three times, 25 percent hike in the last fiscal year. You proposed new taxes on hotels, paramedic services, even 911 calls from cell phones. Is that true?\n\nCOONS: No. It’s not true that we proposed a tax on the calls to the 911 center. In any case –\n\nO’DONNEL: It’s not true.\n\nCOONS: -- research into that would reveal that. It’s difficult, it’s complicated, but I’ll take – I’ll take a –\n\nBLITZER: Well, explain your record on – on taxes. Did you increase taxes as the county executive?\n\nCOONS: Wolf, let me walk you through, for a moment, what’s happened, because one of the attacks my opponent’s made repeatedly is that I’ve driven the county to the edge of bankruptcy. That’s on her newest attack. Nothing could be the further from the truth.\n\nToday, New Castle County has a surplus. When I became executive in ‘05, it had a deficit. I have worked hard over six years to defend a very significant reserve, which has made it possible for us to continue to have a Triple-A bond rating. Out of 3,000 – roughly 3,000 counties in America, roughly 30 have a Triple-A bond rating, and I reached a bipartisan solution –\n\nO’DONNEL: It says stop.\n\nCOONS: -- that cut more in spending than was raised in taxes.\n\nBLITZER: All right, a quick response and then we’ll move to the next –\n\nO’DONNELL: You’ve been criticized for saying that you brought the county to Triple A bond rating. You inherited that good rating. And how would you justify cutting the tax exception for low income seniors and disabled seniors, cutting our policeman pay when you wastefully spent so much money on appeasing the special interest groups?\n\nYou simply can’t justify that. That is a career politician. That is cronyism. We don’t need any more of that in Washington.\n\nBLITZER: Very quickly, because we got to move to the next series of questions, do you want to respond to that?\n\nCOONS: There’s a lot to respond to in that.\n\nBLITZER: Do it in 30 seconds.\n\nCOONS: That’s going to be difficult, Wolf.\n\nBut I’ll tell you that I’m proud of my record as New Castle County Executive. The very hard choices that had to be made to clean up the government – every time you get a bond rating, you earned a bond rating.\n\nMs. O’Donnell’s not familiar with how bond ratings work. Each time you go to the bond market, you are re-rated. Moody’s, in their letter of rating just two weeks ago, said that it was because of the conservative fiscal policies of my administration that we have re-earned a Triple A bond rating from all three agencies.\n\nBLITZER: All right. Let’s move on to the next series of questions on national security, foreign policy, right now. A hundred thousand American men and women are serving in the military in Afghanistan right now. The president of Afghanistan, Hamid Karzai, has now acknowledged he’s in direct talks with the Taliban leadership, wants to create what he calls a peace council.\n\nHere’s the question, and it goes to Mr. Coons. Would you support a negotiated settlement in Afghanistan that includes Taliban representation? Would that be acceptable to you, a deal between Hamid Karzai and the Taliban?\n\nCOONS: Wolf, I’m concerned about the security of our troops in the field and about honoring the service and the sacrifice of our veterans. The war in Afghanistan is the war of the two that we’ve been engaged in, Iraq and Afghanistan, that I think was justified by a direct attack on the United States by the Taliban, who were offering harbor to al Qaeda, who were the authors of the 9/11 attack.\n\nAnd I think in our 10th year now, on the ground in Afghanistan, we have to look hard at whether we’re continuing to contribute to America’s security by having 100,000 troops on the ground. I would support a negotiated resolution to the war that allowed us leave security and intelligence assets in place and that allowed us the opportunity to reengage, should the Taliban take control again, or allow al Qaeda to reemerge as a real threat to the region or to the United States.\n\nWe’ve spent $1.3 trillion in Iraq and Afghanistan. It has significantly contributed to our debt. We have lost more than 5,000 American servicemen and women, and I’ve got folks who I am personally close to who are deployed now for the third or fourth tour.\n\nWe have asked a lot of our men and women in the field. They have delivered brilliantly. But, frankly, the mission has exceeded the scope that I think we could initially reasonably expect of them.\n\nI am far more concerned about the threats to our security posed by an unstable Pakistan, posed by Iran, and posed by an endless war in a country where we’re trying to build a nation where there really hasn’t been one in modern times.\n\nBLITZER: You have one minute to respond.\n\nO’DONNELL: Well, I would ask him, if he’s serious about making sure that Afghanistan doesn’t become a safe haven for terrorists, why, on the campaign trail, he has said that he supports this random time withdrawal?\n\nWe have to support our men and women who are risking their lives. Many of them have already given their lives over there. A random withdrawal that he has said he support will simply embolden the terrorists to come out after us even more, saying I’ve chased away the super power.\n\nWhen we withdraw from Iraq, we need to make sure that there are benchmarks in place. Those benchmarks are making sure that there’s a government that – a representative government over there that serves the needs of the people and that can defend themselves. When we’ve reached these benchmarks, that’s when we withdraw.\n\nBLITZER: You want to respond to that?\n\nCOONS: She said withdraw from Iraq. I suspect you meant withdraw from Afghanistan.\n\nO’DONNELL: No. From Afghanistan. Did I say Iraq? I’m sorry.\n\nThank you, Chris. You’re correct. I meant Afghanistan.\n\nCOONS: If we’re talking about Afghanistan –\n\nO’DONNELL: Yes. Thank you.\n\nCOONS: -- and, you know, frankly, I come from a family of veterans. I come from a family that has dedicated a lot to the service of our nation, and I wear a flag pin every day to remain me of the young man who grew up next door to me, who was killed in Iraq in December of 2005.\n\nI never take lightly the enormous sacrifices that our servicemen and women have made now, and that we ask them to continue making. I don’t know how long is too long, but 10 years strikes me as awfully long. And I question whether your standard, whether your principles, give us any hope of winding up this war on any reasonable timeline, because, frankly, the government of Hamid Karzai has proven itself to be largely corrupt, and to be frankly ineffective at establishing control over the whole country.\n\nWe are doing our best. We have dedicated trillions, hundreds of billions of dollars to this conflict, and I’m frankly deeply concerned that it’s a conflict without a reasonable end in sight.\n\nThere are times in history –\n\nO’DONNELL: Saying that you’re –\n\nCOONS: -- the best way to honor the sacrifice of servicemen and women is to come up with a plan to responsibly wind down a conflict.\n\nO’DONNELL: And that plan should be based on those benchmarks, the benchmarks that means that we have had success.\n\nAgain, you’re saying hallow rhetoric, when you – you say that your top priority is the concern for the safety of us on the homeland if you seriously support this random time withdrawal. Because, again, all we’re going to do is embolden the terrorists to think that they have more power than they do.\n\nAnd I would ask you, you know, a couple of times, whether it’s the tax cuts or even here in this kind of veiled – you’ve gone back and forth on what you just said in Afghanistan. Do you support the president or don’t you support the president? With the tax cuts you’re saying that you don’t support the president.\n\nCOONS: Ms. O’Donnell, let’s stay focused –\n\nO’DONNELL: Are you going to tell him that when he comes on Friday?\n\nCOONS: -- let’s stay focused on the issue in front of us, which is Afghanistan. You’ve suggested gauzy benchmarks –\n\nO’DONNELL: And it’s you – you’re jumping around.\n\nCOONS: No, we’re staying focused on the issue of Afghanistan rather than jumping to other issues.\n\nO’DONNELL: And you jumped around. You said that security –\n\nCOONS: Ms. O’Donnell –\n\nKARIBJANIAN: Let’s let – let’s let –\n\nCOONS: The core issue here –\n\nKARIBJANIAN: -- Mr. Coons finish his point.\n\nCOONS: The core issue here is what reasonable prospect do you have for.... ... these gauzy benchmarks and timelines you suggest to ever actually result in a withdrawal?\n\nIn Iraq, there was a modern nation. There was a central government.\n\nThere was infrastructure in place. In Afghanistan, there hasn’t been a nation in decades. And so, despite our 10 years of incredible effort, we are not succeeding in building a nation.\n\nAs you put it, if the benchmark is self-governance, stability, security, we had a decent shot –\n\nBLITZER: All right.\n\nCOONS: -- of that in Iraq.\n\nBLITZER: I want to –\n\nO’DONNELL: Well, if you remember, when we were fighting the Soviets over there in Afghanistan in the ‘80s and ‘90s, we did not finish the job. So now we have a responsibility to finish the job. And if you’re going to make these politically correct statements that it’s costing us too much money, you are threatening the security of our homeland.\n\nKARIBJANIAN: We’re about to wrap up this topic. Let’s just get there real quickly and ask yes or a no answer. Are – is this nation more secure than it was under President Bush? Yes or no?\n\nCOONS: Yes.\n\nKARIBJANIAN: Today? Yes or no.\n\nO’DONNELL: No.\n\nKARIBJANIAN: OK.\n\nWe’ll move on to our next topic, and this question goes to Ms. O’Donnell.\n\nO’DONNELL: Can I give – can I say why? I mean, we had more –\n\nKARIBJANIAN: We – no. We’re really –\n\nO’DONNELL: -- terrorist attacks on our homeland.\n\nKARIBJANIAN: -- sorry, but we do need to move on.\n\nI know that we’ve said that the statements out in the national media, the ‘Saturday Night Live’ skits are distractions. I appreciate that, but to the voter in Delaware, it is the message that they are receiving. So we would be remiss if we did not address this issue.\n\nSo the comments that you’ve made in the past, which are in your own words because they’re on the videotape, have become the fodder for the late night TV shows. You even released an ad that opened up by saying ‘I am not a witch’ and a local newspaper columnist said that the comments that you’ve been – seemed to be making make Delawareans cringe.\n\nSo what do you say to voters who want the change but are uncomfortable by these remarks?\n\nO’DONNELL: This election cycle should not be about comments I made on a comedy show over a decade and a half ago. This election cycle should be about what is important to the people of Delaware, how we’re going to get real jobs back to Delaware, how we’re going to get our economy back on track, how we’re going to protect our senior citizens and safeguard our social security. These are the issues that Delawareans are concerned about.\n\nYou know, as, Wolf, you can attest, I have not welcomed this media attention. You’ve been asking for an interview for quite a long time. My priority has been getting back to the Delaware voters, meeting as many voters, going to as many community forums as possible so that we can counter these things.\n\nO’DONNELL: My opponent has said that the statements that we made in our 20s should be off the table, and after he made that statement, days later, he started running ads. In his own campaign materials, he’s going back on his word using those statements to misrepresent my character.\n\nSo, again, I thank you for the opportunity for the Delaware voters to get to know who I am and what I’m all about because what I can assure them is, while I made statements, my faith has matured over the years but regardless of my personal faith, when I go down to Washington, D.C., it is the constitution that I will defend and it is by the constitution that I will make all of my decisions, and that will be the standard bearer for every piece of legislation that I will vote on.\n\nKARIBJANIAN: Mr. Coons, you have a one-minute rebuttal.\n\nCOONS: I was surprised to see in the newspaper an interview profile of both of us, Miss O’Donnell’s statement, pretty similar to what you just heard from her that she would not have her faith be a central driver of her decisions if elected. And I’m interested if we can explore further your suggestion that the Constitution would be your guide. Because I’m interested in hearing whether it’s the Constitution as passed by the founders, the Constitution of 1920, 1930, the Constitution of 1975, the Constitution of today. Because to me, protecting a woman’s right to choose, protecting reproductive freedom, and making sure that we’ve got on the record Miss O’Donnell’s views on things like prayer, abortion, evolution, is important. These aren’t just random statements on some late-night TV show. These are relevant to her service in the United States Senate, what sort of judges she would confirm, what sort of issues she would take up. I’m someone who stands firmly behind the constitution as it stands today. I respect stare decisis, the decided cases, the case law that governs the United States.\n\nKARIBJANIAN: All right but let’s go to the issue of faith and politics, because you were a student pastor at Yale. You also said in an interview once that you thought you would either end up a preacher, a professor or a politician. You’ve occasionally been a guest speaker at some of the churches here in our community, Baptist churches, Presbyterian churches to name a few. So how much of an influence does this faith in your life have on your politics?\n\nCOONS: Faith is a central part of how my wife and I are raising our three children, of why we decide to do the community service and the outreach that we do but ours is a faith that we think a general motivation towards public service, towards trying to create a community that’s more tolerant, inclusive, and just, and towards the sort of forgiveness, healing and reconciliation that we think is the central message of our faith. But I also think, as someone who has been elected ten years, I’ve learned to reach a balance where my private faith, the aspects of my faith that are religious doctrine, don’t influence the decisions that I’ve made for the public in my ten years in county office.\n\nBLITZER: Let’s give you a chance to respond to some of the things she said because in a television appearance back in 1998 on Bill Maher’s show you said evolution is a myth. Do you believe evolution is a myth?\n\nO’DONNELL: I believe that the local -- I was talking about what a local school taught and that should be taught -- that should be decided on the local community. But please let me respond to what he just said.\n\nBLITZER: We’ll let you respond but answer the question. Do you believe evolution is a myth?\n\nO’DONNELL: Local schools should make that decision. I made that remark based on --\n\nBLITZER: What do you believe?\n\nO’DONNELL: What I believe is irrelevant.\n\nBLITZER: Why is it irrelevant?\n\nO’DONNELL: Because what I would support …\n\nBLITZER: Voters want to know.\n\nO’DONNELL: What I will support in Washington, D.C. is the ability for the local school system to decide what is taught in their classrooms and what I was talking about on that show was a classroom that was not allowed to teach creationism as an equal theory as evolution. That is against their constitutional rights and that is an overreaching arm of the government.\n\nBut, please allow me at least the full minute to respond to what he said because he said these statements that we made should be taken into consideration when casting your vote. So then I would be remiss not to bring up the fact that my opponent has recently said that it was studying under a Marxist professor that made him become a Democrat. So when you look at his position on things like raising taxes, which is one of the tenets of Marxism; not supporting eliminating death tax, which is a tenet of Marxism -- I would argue that there are more people who support my Catholic faith than his Marxist beliefs, and I’m using his own words.\n\nKARIBJANIAN: We’re going to clarify that.\n\nBLITZER: Because a lot of people remember, because they’ve learned in last few weeks you did once describe yourself when you were in college a long time ago as a bearded Marxist.\n\nCOONS: Great question, Wolf. I hope folks will go and read the article.\n\nIt’s an article that I wrote as a senior the day of our commencement speech and the title and the content of that clearly makes it obvious that it was a joke. There was a group of folks who I had shared a room with, my roommates junior year, who are in the Young Republican Club and who thought when I returned from Kenya and registered as a Democrat that doing so was proof that I had gone all the way over to the far left end, and so they jokingly called me a bearded Marxist. If you take five minutes and read the article, it’s clear on the face of it, it was a joke. Despite that, my opponent and lots of folks in the right wing media have endlessly spun this. I am not now, nor have I ever been, anything but a clean-shaven capitalist.\n\nO’DONNELL: Well, I would -- I would stand to disagree because, first of all, if you’re saying what I said on a comedy show is relevant to this election, then absolutely you writing an article, forget the bearded Marxist comment, you writing an article saying that you learned your beliefs from an articulate, intelligent Marxist professor and that’s what made you become a Democrat, that should send chills up the spine of every Delaware voter because then if you compare that statement to your policies --\n\nCOONS: If it were accurate, if it were true, I’d agree. But it’s not accurate. It’s not true.\n\nO’DONNELL: You said that on MSNBC just a few weeks ago. You said that on MSNBC.\n\nKARIBJANIAN: Let’s go to an issue that you brought up about being schools and this goes to you first, Mr. Coons. This is the issue of education in our country. And in many public school districts all across America, as they’re trying to get in accountability in the classroom, it is very difficult to dismiss an underperforming teacher because of the stringent contracts that have been negotiated with the individual school districts and teacher unions. Do you feel teacher unions are too powerful?\n\nCOONS: Nancy, one of the things I’ve complemented both Delaware’s teachers and Delaware’s governor for is their remarkable progress under the race to the top program. One of I think the best parts of the Obama/Biden administration’s progress on education, I like both the process and the outcome. They set a very high bar. They offered a federal pot of money that was available or for those states that were willing to make significant changes and Delaware and Tennessee were two states that made that progress. Delaware’s teachers union, the DSEA, came to the table and with the leadership of the Governor Markell, made significant changes, things a lot of folks predicted they wouldn’t do to embrace charters and to make them more powerful, to make it possible for schools that are underperforming to be shut down or restructured and to change a system so that teacher compensation could be tied towards improvement by students in the classroom. I think our teachers deserve our support and I think our teachers have a long tradition of contributing significantly, not just to educating our children but to building a stronger and better community. My own mother and grandmother were school teachers and I deeply respect the hard work that they do.\n\nEarlier today I was at Eisenberg School in New Castle because this is National School Lunch Week. The work that our teachers do, the work that’s done in early education from head start to full day kindergarten through K through 12 education, the work that’s done here and in other great public universities around the state and country, is critical to laying the groundwork for our future. And I have no problem with recognizing that the folks who do the hard work, the teachers, and the paraprofessionals are entitled to a good standard of living, are entitled to be able to live a life where they have health care, they have a pension, and they have job security. I do think there are issues that we have to tackle and I think race to the top made significant progress in them in making sure schools are performing as best they can.\n\nBLITZER: You have a minute to respond.\n\nO’DONNELL: Well, if you notice, he didn’t answer the question as to whether or not he thought the teacher unions were too powerful, and that’s probably because he got their endorsement.\n\nI would say that what we need to do especially here in Delaware where we spend so much money on education, it ends up going to the six-figure salaries of our bureaucrats and our superintendents, not to the teachers in the classroom.\n\nIt’s appalling that in a state where we spend so much federal and state dollars on education, good teachers who want to get extra materials have to do so out of their pocket. I have met many teachers.\n\nI’ve sat down with them and talked with them about their concerns with race from the top and whether they’re Democrat or Republican a lot of them express that we are not spending our education dollars appropriately. We’re not helping the classroom, and what’s going to happen when this race to the top funding dries up?\n\nWe have a broken system especially in Wilmington where I live. We have an extremely high dropout rate. Throwing more money on a broken system is not going to work. Instead, what we need to do is sit down and have conversations with the teachers not the unions about what they need us to do to help them in their classroom.\n\nBLITZER: Over the years a number of conservatives have proposed eliminating the Department of Education in Washington. Do you support eliminating the Department of Education?\n\nO’DONNELL: I don’t think that we need to go to that drastic of a step, but as I said, Senator Coburn has released a report that shows where millions of dollars in Department of Education money has been abused.\n\nThat’s the kind of stuff we have to stop. We also have to make sure that the money we are putting into education does go to the classroom and make them more effective. That’s something that we’re ignoring. Every time that there’s a problem, we just throw more money in it to appease the special interest groups. We’re not getting to root of the problem and that’s what we need to do, start getting to the root of the problem, which means talking to the teachers and not only that, putting the power back to the parents over whether they send their children to school.\n\nBLITZER: In a recent survey of 30 industrialized countries, the United States ranked 25th in math, 21st in science. Finland was first in math.\n\nSouth Korea was first in science. Specifically what would you do to make the United States number one, once again, in math and science?\n\nCOONS: Great question. And as someone who spent 20 years working with a non-profit foundation, the I Have a Dream Foundation, that raises money from private individuals and helps provide scholarships for students, for teachers, and for a college education, I’ve been hands-on and engaged with some of the toughest schools in America and some teachers who are significantly under-supported by their districts and who needed additional resources to deliver on a promise of an effective education.\n\nI think there’s a significant role, though, for the federal government in providing financial support and encouragement, scholarships for those teachers in STA, in science and technology, in engineering and math.\n\nWe need a new generation of teachers who are fully prepared, fully qualified to engage their students in the classroom, to use the latest teaching tools in media, to teach to the standards that No Child Left Behind established, and that need to be modernized and made more flexible and responsive. And we frankly need to use collaborative learning techniques.\n\nKARIBJANIAN: I’m sorry, but we’re time-keeping here.\n\nBLITZER: I’ll give you a very quick chance to respond. What would you do specifically to make the United States number one?\n\nO’DONNELL: Again, what I would say to improve our education, we have to empower the teachers to do what they need to do to be more effective.\n\nThey’re the ones on the first line of defense. They’re the ones who have the most influence over our students.\n\nBut we also have to empower the parents. So I support charter schools and I support student vouchers -- or school vouchers so that it gives parents, regardless of income, regardless of status, an opportunity for their students to have a shot at a great education until our public schools do improve.\n\nBLITZER: Let’s switch gears and talk about health care, which is such an important issue to millions and millions of Americans right now. Under the new health care law that was recently signed into law by the president, children now can stay on their parents’ insurance policies until the age of 26. People can no longer be denied coverage for pre-existing conditions. Insurers, the big insurance companies, are prohibited from rescinding coverage if a customer becomes sick and they can’t impose any lifetime limits on essential benefits like hospital stays or expensive treatments.\n\nYou say you want to repeal all of that?\n\nO’DONNELL: Well, first of all, no one is disputing that our health care system before ‘Obama-care’ didn’t need reform. Those are very important things that are part of insurance reform, not health care reform.\n\nIn the course of the public debate over health care reform, we’ve begun to confuse coverage with care. Our goal should be to make health care more affordable. Even with ‘Obama-care,’ our most vulnerable in Delaware are still left uninsured and still left without access to quality health care.\n\nWhen we passed ‘Obama-care,’ we were promised that it would make more people insured. Well, recent CBO reports say that it’s not. It’s actually causing businesses to drop their policies because compliance standards are so high. Our laws, especially when it comes to health care, should not force businesses to break our laws.\n\nSecond of all, we were promised that more people -- that health care costs would be lowered. It hasn’t. It has increased health care costs, according to recent reports. So what I want to do is to fight to fully repeal that so that we can begin to enact real reform. And that real reform would include allowing policy portability when you change jobs, allowing Delawareans to get policies across state lines.\n\nRight now we only have three options. That’s not right. And I would also fight for some sort of tort reform that allowed doctors to not have to worry and practice medicine to prepare for the courtroom as opposed to the examination room, but at the same time this tort reform has to protect those patients who are victims of true medical malpractice.\n\nBLITZER: You have one minute to respond.\n\nCOONS: So much to say.\n\nI support the implementation of the Affordable Care Act. I think it made significant advances, and you outlined many of them. But there’s additional investments in the bill to make sure that there’s a breadth of coverage to rural areas, through the Health Services Corps, by recruiting and training a whole new generation of doctors and nurses, by expanding support for community health centers, and by also improving efficiency of our health care system.\n\nIt makes a landmark investment of $350 million over a decade to try and fight waste, fraud, and abuse, and increase those savings. And there were strategic investments in electronic medical systems that would allow electronic medical records to reduce injuries to patients, mistaken diagnoses, and mistaken treatments.\n\nAll of these in combination I think argue for extending, perfecting, and implementing this landmark bill. It’s not perfect. There are problems with it. But I think rather than turning it back and repealing and going for another year or two of endless partisan bickering, this was a critical piece of legislation.\n\nNot a pretty process that passed it, but I would stand for it and implement it responsibly.\n\nKARIBJANIAN: Well, we’re now into part of the discussion on it. So let me just ask you then, the issue was brought up about malpractice reform, and Democrats are often accused of being too close to trial lawyers, and Republicans say that’s why that there has not been the opportunity for reform in this area, and why it was not included in the health care bill.\n\nIf you were elected, would you work to amend that bill to include malpractice reform?\n\nCOONS: I think it is critical that folks in this country be able to stand up to and take on powerful interests. And where individuals are harmed, that they’re able to go into court and to seek redress, whether they’re harmed by someone who misled them in a securities investment, a product that they purchased that hurt them because it wasn’t designed or delivered right, or a medical procedure that went horribly wrong.\n\nI don’t support putting caps on liability because I frankly think in our current system it is only the threat of a significant recovery that allows protection for consumers, for patients, for investors. I, frankly, think that’s an important part of the American legal system.\n\nI do think, as I just mentioned, there are significant advances in this bill that allow us to make health care safer, stronger, more transparent. And if I’ve got a major concern about this bill, it’s that we’re going to reduce costs without squelching innovation.\n\nDelaware and this country has made incredible advances…\n\nKARIBJANIAN: It is discussion.\n\nO’DONNELL: It is discussion. OK. That’s what I was trying to -- OK.\n\nFirst of all, you say that you’re concerned about reducing costs, but reports have showed that this health care bill has caused costs to skyrocket.\n\nSecond of all, you say that it…\n\nCOONS: I don’t know what reports you’re reading. I haven’t seen reports that document that.\n\nO’DONNELL: … partisan bickering, but one out of four Democrats have gone on record saying that they oppose ‘Obama-care,’ they’ve realized that we made a bad mistake, and what this bill does is it gives a massive…\n\nCOONS: And three out of four Democrats strongly support it.\n\nO’DONNELL: … control over health care.\n\nCOONS: It does not give massive control…\n\nO’DONNELL: Uncle Sam has no business coming in the examination room.\n\nCOONS: … to Uncle Sam over health care.\n\nO’DONNELL: Coming between you and your doctor. And that’s exactly what this bill does.\n\nCOONS: Christine, give some concrete example of how -- that’s a great slogan. You toss it around everywhere you go. How does this bill actually put Uncle Sam in the examination room between doctors and patients?\n\nO’DONNELL: It dictates what kind of…\n\nCOONS: And if so, why did the organization that fights for and represents America’s nurses, America’s seniors, America’s hospitals, and America’s doctors, all endorse and support this bill?\n\nO’DONNELL: And many of those branches on the state level, including here in Delaware, have said we don’t support what the national office has done.\n\nIt gives the government the ability to say…\n\nCOONS: That’s not true.\n\nO’DONNELL: … what kind of treatment a doctor can and can’t do, what kind it will fund. It forces businesses to have to comply to these standards where many businesses, especially here in Delaware, have said that they can’t afford to, and it’s cheaper to pay the non-compliance.\n\nCOONS: Well, Ms. O’Donnell, the state Chamber of Commerce…\n\nO’DONNELL: And it has also cut -- this health care bill has cut Medicare.\n\nKARIBJANIAN: Let’s get this point out because we’re down into the last 30 seconds of this discussion.\n\nCOONS: I was just going to say, the state Chamber of Commerce and Christiana Care hosted a debate earlier today. I was sorry you chose not to join us. It would have been great to hear the response of the physicians and the nurses and the hospital administrators to your suggesting that they didn’t support a bill they lobbied for.\n\n(CROSSTALK)\n\nBLITZER: I want to be precise on this specific health care-related issue. You oppose the government mandating that everyone must purchase health insurance, is that right?\n\nO’DONNELL: Yes, because we’re confusing coverage with care. Our goal needs to be to make health care affordable.\n\nBLITZER: All right. Well, here’s the question. Let’s say someone decides not to purchase health insurance, makes that conscientious decision, even though this person can afford to buy health insurance, but decided he doesn’t want to. This person gets critically ill, is rushed to an emergency room.\n\nShould we, people who pay for health insurance, provide him or her with that kind of treatment, or should we kick them out of the emergency room, said, you made a decision, you’re not going to get this kind of treatment?\n\nO’DONNELL: If we do the things that I’ve said that will help to address\n\n-- that I’m proposing, that will help to address the issue of health care, then that person can afford to buy a catastrophic-only policy from across state lines. They’ll be able…\n\nBLITZER: Well, what if the person doesn’t want to buy it?\n\nO’DONNELL: Well, then we have to address that.\n\nBLITZER: Who should take care of that person in an emergency?\n\nO’DONNELL: We have to address it.\n\nBLITZER: Would we, all of us tax-payers…\n\nO’DONNELL: We have to -- no, we have to…\n\nBLITZER: … have to pay for that person?\n\nO’DONNELL: Anything that they do when they have another bill that they can’t pay, make them pay it. Hold them accountable for that.\n\nKARIBJANIAN: Before or after they get care?\n\nO’DONNELL: But right now, right now -- well, that’s up to the hospital.\n\nBut right now we’re forcing them to. We’re forcing them that they have to give care to illegal aliens.\n\nSo this is something that we’re already doing. What I’m proposing, you’re also talking about a very small hypothetical using scare tactics to make people support this health care bill.\n\nWhat I’m proposing in the health care reforms that I’m proposing will help address those situation and help alleviate those situations.\n\nBLITZER: Not just a small number...\n\nO’DONNELL: Well, nobody should be forced to pay for anyone else’s health care, and that’s what Obamacare is doing.\n\nCOONS: And that’s what’s happening today. Before the health care reform bill passed, all of us who have health insurance, who have health coverage have been bearing the costs, paying the freight for those who don’t have insurance and don’t have coverage. They’re getting health care through emergency rooms now. That’s partly why small businesses, employers like New Castle County have faced double digit increases in our insurance costs year after year and year because that’s how we provide care now, it’s inefficient, it’s inhumane and it’s not effective.\n\nKARIBJANIAN: We have to (inaudible) this issue for now and move on to our next topic.\n\nO’DONNELL: ...agree with me that Obamacare should be...\n\nBLITZER: Let’s move on to immigration right now. And this question will be for Mr. Coons. A pathway to citizenship for illegal immigrants, you support that, right?\n\nCOONS: No. I support a pathway to being here legally. And let me take a moment – was that your whole question?\n\nBLITZER: The question is, what is your position on a pathway to citizenship for illegal immigrants?\n\nCOONS: We’ve got roughly 12 million illegal immigrants in the United States today. This is a huge problem. And immigration is a federal responsibility. And I think we should look to the federal government to step up and fix it.\n\nThe federal government has failed states like Arizona, like Delaware, like many others. But we need to recognize the situation we’re in. There are whole industries that rely on the labor of those who are here illegally. And there is a long tradition of failing to deliver the border security that our country needs. The current administration has stepped up and invested millions of dollars in additional troops and additional services, additional support at the border.\n\nMy path forward on immigration would be, strengthen the borders. Make it much tougher for folks to come here illegally and increase the penalties when they do.\n\nSecond, hold employers accountable, particularly those who routinely employ folks who are here illegally by giving them Real ID that can work, that is much more difficult to counterfeit and then holding them accountable if they repeatedly violate that by employing those who are here illegally.\n\nAnd then allow those who are here illegally and do not commit further crimes to come out of the shadows if they will pay taxes, learn English, pay a fine, say I committed a crime and pay a fine and go to the back of the line behind those who applied to come here legally. I would give them a path towards legal residence. I think there’s more they’d have to do to ever earn citizenship.\n\nI respect the tradition of those who go and serve our nation overseas, for example, being offered a chance at citizenship. But in my view, the pathway I’m suggesting is one towards legal residence.\n\nI want to see us focus our resources, law enforcement resources on finding and deporting those who pose a real threat to our community. As somehow responsible for a county police department, I’ve seen over and over instances where neighborhoods are threatened by people who are here illegally and where the ICE does not have the resources to deport them when we deliver them to them. That should be our top priority.\n\nO’DONNELL: Again, he’s back tracking on things that he had said earlier on the campaign trail. And I would ask you when you say that you support border enforcement, this administration recently stopped the efforts to put a virtual fence on our border. When Barack Obama is standing with you on a campaign trail this Friday, are you going to tell him that you disagree with him on his immigration reform efforts?\n\nI believe, however, that securing our borders should be our first priority before we get into any discussion of whether we’re going to get Social Security benefits to illegal aliens. America is a magnet for those all over the country who do believe – or all over the world, who do believe that America does stand as a beacon of hope and justice for the world, and therefore, I support a legal pathway to those who are coming over here, especially for political asylum, to seek a better life than they do in our country. And to reward those who break our laws is to cheat those who honor them. And this is not a message that our federal government should be sending.\n\nKARIBJANIAN: Let’s go into the discussion portion of it. Because you say that you agreed to the pathway to citizenship...\n\nO’DONNELL: For legal.\n\nKARIBJANIAN: But you don’t want to provide amnesty.\n\nO’DONNELL: I don’t want to provide amnesty...\n\nKARIBJANIAN: How can you do one without the other?\n\nO’DONNELL: Because what I’m saying is we have to get rid of all the bureaucratic messes that make the legal pathway difficult. But when someone willingly breaks our laws, that sends a message that – don’t worry about the laws that we’ve set up, don’t worry about those who are on long waiting lists for political asylum, break our laws and we’ll grant you these benefits. It’s sending the wrong message. It’s economically hurting us. And it’s also a national security issue.\n\nCOONS: Ms. O’Donnell patently mischaracterizes her own position.\n\nO’DONNELL: I do support responsible guest worker programs. And that’s the difference.\n\nCOONS: If you can reconcile all those comments, you’re an even more talented reporter than I think you are Nancy.\n\nOne of the challenges we face is getting past the endless bickering and the partisan divide on this. Senator John McCain was someone who, before this election cycle, had been a real advocate for working with the business community, working with Democrats in Congress to find a path forward. As the years and years have rolled by, the number of folks who are here illegally and who pose real threats to our community continue to grow and we are not taking the actions we need to take to separate those who are willing to pay a fine, to accept responsibility for coming here illegally and begin paying taxes and contributing to our community and the benefits they are earning.\n\nI would rather have us begin to provide a path so that those who are here illegally all stand up and take responsibility for that or are deported. That way we can make progress.\n\nO’DONNELL: Wow, he just took a hard-line position. Again, I would ask you, are you going to tell President Obama that, that you disagree with him and you think that illegal aliens should be deported.\n\nBut we have to keep in mind that when we tried amnesty in the 80’s it back-fired. It only increased the problem. So we’ve got to address the issue of securing our borders. And this is something the President Obama’s administration stopped this year.\n\nWe’ve got to secure our borders first and then begin the discussion on guest worker programs and how to eliminate some of the bureaucracies that keep the legal pathway to citizenship so difficult.\n\nBLITZER: We’re going to get to student questions in a moment. We’re going to get to another question that I have. But I just want to clarify one thing on the national security front, on China, which is a huge issue right now. In 2006, and correct if I’m wrong, you said that China has, quote, ‘a carefully thought out and strategic plan to take over America. And if they pretend to be our friend, it’s because they’ve got something up their sleeve.’ You also said, ‘you wish you weren’t privy to some of the classified information I am privy to.’\n\nI’d like, if possible, for you to clarify what you meant.\n\nO’DONNELL: Well, first of all, I was talking about when I was working with the humanitarian group that was going to China. We are given some security briefs about China’s position with some potentially hostile nations and some security threats that my clients would be facing.\n\nBut we do have to look at China, because we own – they own so much of our debt, it prohibits a lot of decisions that we need to make in regard to our foreign policy. Number one is Iran with nuclear weapons. China stands in a big way there. These gasoline sanctions that we have are not enforced as strictly as they could be, because have allies like France and Italy participating in the gasoline embargo, but then China comes in and swoops all that business.\n\nWe need to be putting sanctions on those Chinese companies, because right now when it comes – Iran getting nuclear weapons is our biggest threat to our national security. And when we go to China and we say, please stop these companies, they probably smirk, because we’re not economically in a position to really hold them to that. China could be a bigger ally with us in North Korea, but they’re not. They’re not putting the pressure on North Korea that they could.\n\nSo first of all, we have got to tackle that national debt.\n\nWe’ve got to stop these things like these reckless spending bills coming from Washington that only contribute to further our national debt, because it is putting our national security at issue.\n\nBLITZER: But on a specific quote that you said that China has a plan to take over America, you know about this plan?\n\nO’DONNELL: Well, they misquoted me at the time, I believe. But look at what’s going on. Right now, monetarily, China could take us up over monetarily before they could militarily.\n\nBLITZER: You want to quickly respond, because I know that we want to get to the students’ questions?\n\nCOONS: It’s hard for me to respond effectively, Wolf, to all the different issues that my opponent has raised in previous statements, and I’ll just let that stand.\n\nI don’t have any classified information about China or its plans, but what I think we really need to focus on in this debate, on this particular question, is the steady degradation of our security posture in the Pacific Rim. The Australian navy engaged in joint exercises with the Chinese and specifically excluded us recently. A dramatic shift in\n\nthe Australian policy. And as the Chinese have become economically stronger, they are seeking to become militarily stronger. They’re pushing the envelope on issues from Taiwan to trade to intellectual\n\nproperty. It is a profound threat, not just to the vitality of our economy and our innovation and our manufacturing businesses, but also to our safety and security, to have widespread counterfeiting of everything\n\nfrom pharmaceuticals to aircraft parts, to garments, going on in China without our standing up and fighting against it...\n\nKARIBJANIAN: (inaudible) out of time.\n\nCOONS: ... in trade war... (CROSSTALK)\n\nKARIBJANIAN: We’re out of time at this point...\n\nO’DONNELL: Are you saying that China has a plot to take over America?\n\nKARIBJANIAN: We’re going to close out this conversation and move on to the students’ questions because we do want to involve the University of Delaware students. And first up, we have a question from a student who brings us the issue of don’t ask, don’t tell.\n\n(BEGIN VIDEO CLIP)\n\nUNIDENTIFIED MALE: I was wondering if you’re planning to (inaudible) the issue of don’t ask, don’t tell and its possible repeal.\n\n(END VIDEO CLIP)\n\nKARIBJANIAN: Mr. Coons, your response? One minute.\n\nCOONS: I would move swiftly as a senator to repeal don’t ask, don’t tell. I think it is discrimination, plain and simple. I’ve met with and spoken to veterans here in Delaware who’ve served our nation honorably for decades, several with top-secret clearances, but who could do so only at the expense of denying who they were and the relationships\n\nthat they wanted to have. In my view, we should be making progress in this country towards recognizing the full range of humane experience, and repealing don’t ask, don’t tell to me is an important next step in the civil rights movement.\n\nO’DONNELL: A federal judge recently ruled that we had to overturn don’t ask, don’t tell. There are a couple of things we need to say about that. First of all, judges should not be legislating from the bench. Second of all, it’s up to the military to set the policy that the military believes is in the best interests of unit cohesiveness and military readiness.\n\nThe military already regulates personal behavior in that it does not allow affairs to go on within your - your chain of command. It doesn’t allow, if you’re married, to have an adulterous affair within the military. So the military already regulates personal behavior because it feels that it is in the best interests of our military readiness.\n\nI don’t think that Congress should be forcing a social agenda onto our military. I think we should leave that to the military to decide.\n\nBLITZER: We have another student question on the issue of embryonic stem cell research, and this goes first to Mr. Coons.\n\n(BEGIN VIDEO CLIP)\n\nUNIDENTIFIED MALE: My question is, what are your views on the federal allocation of funds used for stem cell research?\n\n(END VIDEO CLIP)\n\nCOONS: I would support stem cell research, and I think...\n\nBLITZER: We’re talking about embryonic stem cell research.\n\nCOONS: Correct. I would support federal funding for medical research that includes embryonic stem cell research. I think there are critical advances that are being made and can be made in addressing some of the most difficult diseases that affect millions of Americans, and I frankly think if it is possible to do so, we ought to be investing and making progress in this critical area of research.\n\nO’DONNELL: I think if we took an intellectually honest look at the research that’s been put out there, you will see that there is incredible advances with adult stem cell research, not as much with embryonic stem cell research, because that is where this went on in the private sector. That is where investors would be putting their money.\n\nSecond of all, the government, the federal government, should not be in the business of creating life, simply to destroy it. And when it comes to the issue of so-called medical waste, I would point to a program called the Snowflake Babies, where they have had incredible success adopting these human embryos that are going to be discarded for medical\n\nwaste. Where they have given millions-oh, I’m sorry-hundreds and potentially thousands of infertile couples the opportunity to have babies. It is the Snowflake program, it is a wonderful program and I suggest everyone take a look at it.\n\nKARIBJANIAN: Our next student question brings us the issue of abortion.\n\n(BEGIN VIDEO CLIP)\n\nUNIDENTIFIED FEMALE: What is your stance on abortion, including in cases of rape and incest.\n\n(END VIDEO CLIP)\n\nBLITZER: For you.\n\nO’DONNELL: I believe there has been a profound loss of respect for the dignity of human life, and that is reflected in a lot of our policies, whether it is cutting taxes exemptions for disabled, low-income citizens in New Castle County, or with abortion. I respect the human dignity on all levels, the unrepeatable precious human dignity on all levels. And my opponent and others will use the scare tactic about rape and incest when that is less than 1 percent of all abortions\n\nperformed in America.\n\nKARIBJANIAN: Mr. Coons?\n\nCOONS: I strongly support a woman’s right to choose. It is settled constitutional law. It is an important part of our nation and its freedoms. I personally am opposed to abortion. But I don’t think it is my place to put that view on women. I think abortion should be safe, legal and rare.\n\nBLITZER: Let’s get into some of these issues and then we’ll go back and get some more students questions. On the issue of gays serving openly in the United States military? Almost all of the NATO allies allow gays to serve openly in the military. Israel, which has a fine military, as you know, allows gays to serve openly in the military. Why specifically do you believe gays should not be allowed to serve openly in our military?\n\nO’DONNELL: Because it is a military policy that our military set forth. It is the same thing as I said in my remarks, about adultery not being allowed in the military. It is a military policy that they regulate, because they believe that is in the best interest of unit cohesiveness and our effective military.\n\nBLITZER: So if the chairman of the joint chiefs of staff says he believes gays should be allowed to serve-\n\nO’DONNELL: If all four-\n\nBLITZER: -in the military. Would that be good enough for you?\n\nO’DONNELL: If all four heads, if the heads of all four branches of the military said that, then it would be up to them, not me, as a U.S. senator to impose my social agenda, whether it is for or against ‘don’t ask, don’t tell’.\n\nBLITZER: Well, what about that? What if the chairman of the Army, the Navy, the Air Force, and the Marine Corps, their respective chairman said, you know what, we’ll do whatever the commander in chief tells us to do, but we don’t think it is a good idea because of these issues, that Ms. O’Donnell raises, unit cohesion and those other issues. What\n\nwould you say then?\n\nCOONS: One of my real heroes is Harry Truman. Harry Truman made a very difficult decision, to compel the racial integration of the United States armed forces, at a point when most of the leaders, most of the generals said, for exactly the same sorts of reason, unit cohesion, performance in the battlefield. We should not have a racially integrated military. That was a brave decision. It was an important decision. And the ultimate long-term impact has made our United States military one of the most progressive, in terms of promotion and advancement opportunities for racial minorities of any organization in our country.\n\nAs you said earlier, most of our NATO allies have long ago realized that we are giving up on the service of thousands of potential volunteers who could be serving our nation at home and abroad. I don’t think it makes any sense, because of a narrow social agenda, to continue to exclude them from open service in our military.\n\nO’DONNELL: Mr. Coons-\n\nKARIBJANIAN: Our next student question- We’re going to-we don’t-we’re not necessarily going to open discussion on that right now, because we want to get the student questions in. Our next student question comes on the issue of campaign finance reform.\n\n(BEGIN VIDEO CLIP)\n\nUNIDENTIFIED FEMALE: What is your position on campaign finance reform? And what is your reaction to the recent Supreme Court ruling allowing corporations to donate to political campaigns?\n\n(END VIDEO CLIP)\n\nKARIBJANIAN: Mr. Coons, you are first, one minute.\n\nCOONS: I think the Citizens United decision, the decision to which the student is referring, was an unfortunate and ill-decided decision. One that opens the flood gates to increased corporate contributions that could have the unintended consequence-I think, unintended of the decision-of significantly distorting out electoral process here in the\n\nUnited States.\n\nAnd I would support reforms that further disclose who is behind these shadowy groups? Whether individuals, or corporations, that are trying to influence our elections by pouring money into it. Sunshine is the best disinfectant. And in politics it is best for us to disclose as fully and as broadly as possible who is making contributions.\n\nO’DONNELL: And yet the legislative efforts to do exactly that has failed to do that. The Disclose Act, that you know, Harry Reid-which he’s called my opponent his pet-has put out there to do just that, has exempt the major corporations from disclosing it. Instead, what these efforts do is only serve to infringe on the First Amendment right of private citizens.\n\nI’ll use my own campaign as an example. From our FEC reports, my supporters have been getting harassing phone calls, not just from reporters, but from all kinds of people who oppose my candidacy. They are using intimidation tactics because we are forced to disclose who is contributing to my campaign. So, this so-called campaign finance reform\n\nis exempting the corporations whether on the left or the right. It is those who are in Washington already, those who are over 10 years old, who have over a half a million members, and who already are playing in the backroom deals. So this is a misguided attempt.\n\nBLITZER: Do the American people have a right to know where all this money, in these campaigns is coming from?\n\nO’DONNELL: Yes and no. I believe that there are ways to do that where we can report to the FEC. But we don’t have to make them public unless there is a question of corruption. And then that would prevent a lot of the harassment that my supporters are getting.\n\nThat would prevent a lot of the discussion about our First Amendment rights. We can disclose that to the FEC, but they don’t have to put it up on a Web site that makes anyone vulnerable to further fundraising calls.\n\nI mean, over and over, that is a repeated violation in many campaigns, not my own. But even my own party has said go look on someone’s FEC report and call them up for a donation. And I’ve said, absolutely not. That is against the law.\n\nBLITZER: Very quickly.\n\nO’DONNELL: So these so-called disclosure attempts are being abused.\n\nCOONS: I just-there is so much there, Wolf. I don’t know. Frankly, I support full disclosure of campaign contributions. As I said before, I think it is the best way to ensure that we have got fair, open and clean campaigns. Folks should know who the folks are who are contributing to campaigns. It is an important way to hold candidates and elected officials accountable.\n\nBLITZER: We have another student question on the sensitive issue of religion in America.\n\n(BEGIN VIDEO CLIP)\n\nUNIDENTIFIED MALE: In light of the events in the past decade, Islam has been viewed as a religion for extremists and terrorists, where Muslims, including myself, can attest that Islam is far from that. Now recently there has been much controversy over the mosque being built in the vicinity of ground zero and also the Florida pastor making outrageous remarks about the Koran. Now my question to you is, as senator, where is the line between the freedom of speech and the respect of other religions? Both of which freedoms are found in the First Amendment of the Constitution.\n\n(END VIDEO CLIP)\n\nBLITZER: Mr. Coons.\n\nCOONS: That’s a great question-and a difficult one. The Florida pastor who caused a lot of outrage by threatening to burn the Koran showed a profound misunderstand of the difference between the Islamic terrorists, the extremists who genuinely attack America, and, I think, deserve our condemnation and the vast majority of Muslims who participate in a religion whose fundamental principle is a commitment to peace and embracing the rest of humanity. If that Florida pastor wanted to make the right point, he should have threatened to burn the readings and the teachings of Osama bin Laden, or of other folks who are a part of the Islamist extremist groups.\n\nIt is an important challenge, a key role of the United States Supreme Court to continue to draw the line in the First Amendment between those who would do the equivalent of calling fire in a crowded theater, who would be inciting to attack and riot, such as Osama bin Laden has in some extremist and hateful writings, and those who have scripture, religious traditions that are deserving and worthy of broad support.\n\nThose are difficult lines to police. And that’s a central role that the Supreme Court plays in our democracy.\n\nO’DONNELL: Well, I would agree. The Supreme Court has said that there are restrictions on our First Amendment rights. Again, you know, you can’t, as you said, go into a crowded theater and yell fire. You can’t stand up on a plane and yell hijack. You can’t slander and libel someone.\n\nHowever, where the question has come between what is protected free speech and what is not protected free speech, the Supreme Court has always ruled that the community, the local community has the right to decide.\n\nAnd then the issue with the ‘9/11 mosque,’ that’s exactly where the battle is being fought, by the community members who are impacted by that. And I support that.\n\nBLITZER: But the community members have -- at least the city council, the mayor, and the representatives -- the elected\n\nrepresentatives support this mosque and community center that is supposed to be built near 9/11.\n\nO’DONNELL: And a lot of the people on the ground do not. And they’re going to have a lot to face from their constituents and maybe their re-election is even going to be jeopardized.\n\nBLITZER: Should this cultural center and mosque near 9/11 be built?\n\nCOONS: There is already cultural centers -- there is already mosques in many locations in Manhattan, and as you mentioned. I would defer to the decision of the local land use authorities, the folks who were elected by that community, to make decisions about where, when, and how things ought to be built.\n\nI don’t think it was a wise choice of location. But I can’t stand here and say that we should prevent folks from practicing their religion anywhere in the United States. To say that we will say, you can’t build a mosque here, violates one of our most fundamental principles, freedom of religion.\n\nKARIBJANIAN: Well, we’ve talked about the Supreme Court, and obviously a United States senator has the opportunity to determine in a way the make-up of that court. So what opinions of late that have come from our high court do you most object to?\n\nO’DONNELL: Oh, gosh. Give me a specific one, I’m sorry.\n\nKARIBJANIAN: Actually, I can’t, because I need you to tell me which ones you object to.\n\nO’DONNELL: I’m very sorry. Right off the top of my head, I know that there are a lot, but I’ll put it up on my Web site, I promise you.\n\nBLITZER: Well, we know you disagree with Roe versus Wade.\n\nO’DONNELL: Yes, but that was -- she said a recent one.\n\nBLITZER: Well, that’s relatively recent.\n\nO’DONNELL: She said, of late. Yes, well, Roe versus Wade would not put the power -- sorry, it’s 30 (ph)...(CROSSTALK)\n\nBLITZER: But since then, have there been any other...(LAUGHTER)\n\nBLITZER: ... Supreme Court decisions?\n\nO’DONNELL: Well, let me say, about Roe versus Wade, Roe versus Wade, if that were overturned, would not make abortion illegal in the United States, it would put the power back to the states.\n\nBLITZER: But besides that decision, anything else you disagree with?\n\nO’DONNELL: Oh, there are several, when it comes to pornography,\n\nwhen it comes to court decisions, not just Supreme Court, but federal\n\ncourt decisions to give terrorists Miranda-ized rights.\n\nI mean, there are a lot of things that I believe that -- this California decision to overturn ‘Don’t Ask/Don’t Tell,’ I believe that there are a lot of federal judges who are legislating from the bench.\n\nBLITZER: That wasn’t the Supreme Court, it’s a lower court.\n\nO’DONNELL: That was a federal judge -- that’s what I said, in\n\nCalifornia.\n\nBLITZER: But which Supreme Court decisions, if any, do you disagree with?\n\nCOONS: The most recent one that I’ve been engaged in we’ve talked about, is Citizens United. I think the Citizens United case takes a sort of logical extension in the law, but takes it to a ridiculous extreme.\n\nCorporations really aren’t entitled to the same free speech rights, in my view, as people. And in Delaware, America’s corporate capital, you would think we would be fighting for the rights of corporations.\n\nBut in terms of political contributions, the free speech rights of corporations, I don’t think deserve the same protections as the free speech rights of real living, breathing, voting humans.\n\nAnd so I would disagree with that decision. And I would act to try and find ways to limit it, narrow it, or even overturn it.\n\nBLITZER: Anything else?\n\nCOONS: That’s the most important.\n\nBLITZER: Let’s take another question from a student on energy, right now.\n\n(BEGIN VIDEO CLIP)\n\nUNIDENTIFIED MALE: My question is, where do you think funding should be placed in order to move toward the United States decreasing its carbon program.\n\n(END VIDEO CLIP)\n\nBLITZER: Mr. Coons.\n\nCOONS: Well, the most effective investment in reducing emissions of CO2 and other things that cause greenhouse gas warming is energy efficiency and conservation. There was a significant investment in the stimulus bill in getting municipalities, local governments, the private sector, to invest in efficiency and conservation. And those are\n\ninvestments that reduce emissions, put people to work, and can develop cutting edge technologies that make our systems operate better and to reduce, not just the emissions, but also the operating expenses.\n\nIn New Castle County, we took $3.8 million in EECBG grants and combined it with $4 million of our own and retrofit 20 county buildings. We reduced our operating costs, we reduced our emissions and we ultimately put folks to work here in our own community.\n\nAs you look at those kinds of investments around the country. They’re the most important -- they have the most impact of anything you can do that will actually reduce greenhouse gas emissions. There’s many more things we need to do to improve the efficiency of operation...\n\nKARIBJANIAN: (INAUDIBLE)(CROSSTALK)\n\nCOONS: ...of coal fire power plants. Excuse me.\n\nO’DONNELL: Well, I think the best way to address this that is most relevant to this U.S. Senate race is to talk about the issue of Cap and Trade because the winner of this U.S. Senate race can be immediately sworn in and serve it in Harry Reid’s lame duck session and vote on Cap and Trade. While I do believe that we have to be good stewards of this\n\nearth, we don’t need to do it at the expense of our citizens and Cap and Trade will do that, whether it’s farmers, senior citizens, or realtors who are concerned about its green compliance standards. Nobody wants this bill. This bill is a national energy tax that will ration energy use and increase our utility bills. Senior citizens are concerned about\n\nthe cost these new utility bills going up. Farmers are concerned about the green compliance standards and raised utility bills shutting down their operations. And realtors are concerned about the green compliance standards hurting and already hurting housing market.\n\nBut I would have to ask my opponent, speaking of Cap and Trade, your family business stands to financially benefit from some environmental legislation under Bush...\n\nKARIBJANIAN: The minute’s up, so let’s talk...(CROSSTALK)\n\nO’DONNELL: Would your business...\n\nCOONS: A fascinating question that really makes no sense, yet, so\n\nif you’d like to -- better ask the whole question, I’d be...(CROSSTALK)\n\nWhat’s she talking about?\n\nO’DONNELL: I’d like to know if your family business stands to have a financial gain if Cap and Trade is passed and if so, would you recuse yourself in the lame duck sessions from voting with Harry Reid?\n\nCOONS: Fascinating question. No, to the best of my knowledge there is no direct financial benefit. And I do think it’s important for folks in public office to conduct themselves ethically, to be transparent and to be accountable for decisions they make and for votes that they cast.\n\nI am someone who thinks that greenhouse gasses are a concern, are a problem for the long-term. And I think we need to take steps to rein them in and to deal with the environmental consequences that they might present.\n\nBLITZER: Well, let me ask Miss O’Donnell what evidence do you have that any family business that he has would stand to gain from Cap and Trade?\n\nO’DONNELL: Because they make fuel cells and...\n\nBLITZER: Who’s they?\n\nO’DONNELL: W.L. Gore. They make some of the stuff that will be required by these business to regulate Cap and Trade, so...\n\nBLITZER: Is that true?\n\nCOONS: That’s quite a stretch. Gore makes over 1,000 products. It was difficult for me to understand, from her question what she was alking about. Gore is a company that makes lots and lots of products from implantable medical devices to dental floss to some membranes that component parts that go into systems that go into fuel cells.\n\nFuel cells are not currently fielded broadly in the United States. It’s a cutting-edge technology that some day has the promise of being a significant contributor to making a more energy-efficient, cleaner transportation future. But to me, the impact is so distant from any particular proposal on cap-and-trade, it took a couple of minutes to even understand what she was talking about.\n\nBLITZER: On this issue of energy, let’s just wrap up this section with this. Yesterday, the Obama administration announced it was lifting the moratorium in deep-water oil drilling in the Gulf of Mexico. Do you support this kind of offshore oil drilling?\n\nO’DONNELL: Well, that has raised the issue of whether or not we support it here in Delaware, because that move by Obama would allow that. No, I don’t want to see oil rigs off the state of Delaware.\n\nHowever, it should be up to the states to decide. And if Governor Markell and our state legislatures in Dover were to pass legislation for that, then I shouldn’t as a congressman overstep a state’s right. If Virginia wants it -- not only that. We have got to begin to wean ourselves off of foreign oil. We are dependent on potentially hostile countries like Russia and Venezuela, while our own homeland is rich with natural resources, whether it’s oil or natural gas, and there are states\n\nthat do want to begin exploration. Alaska, Virginia. We as a government need to support those states who do want it.\n\nBLITZER: Do you agree or disagree?\n\nCOONS: I opposed the president’s proposal to open the outer continental shelf off of Delaware to oil drilling when it was first made months ago. I frankly think that Delaware’s world-class beaches shouldn’t be at risk of being spoiled by oil spills. We depend on tourism, on our fisheries. There’s lots of reasons. I think it just doesn’t make sense, for most of the Atlantic coast.\n\nI do think there are natural energy resources in this country we can and should begin to exploit more fully, but I would also prioritize investments in alternative energy technologies.\n\nThe University of Delaware has long been a world leader in solar power, for example, and has a key role to play in making wind power real. Offshore wind power, solar power. These are the sorts of initiatives (ph) where I’d prefer to see federal investment and new innovative opportunities that could create good jobs for the long term.\n\nKARIBJANIAN: Let’s leave time to throw in one more issue here before we go to closing statements. We are kind of drawing down on time.\n\nThis is an issue that I think can really illustrate the differences perhaps between the two of you, and that is what specifically would you and could you do to actually help end any of the bitter partisan -- bipartisan -- non-partisanship in Washington? So what would you be able to do as an individual once you arrive in Washington?\n\nO’DONNELL: Well, I’ve had to fight my party to be here on this stage to win the nomination, and to some extent I am still fighting my party. So my -- when I go to Washington, my allegiance will be to the voters of Delaware, not any special interests.\n\nMy whole campaign has been about returning the political process back to the people of Delaware, and to me that’s a great thing. So what I would do is I would stand strong on legislation that benefits the interest of our citizens, not the special interests in Washington, D.C., and I would stand there and not just vote against a piece of legislation, but make the floor speeches that would try to convince my colleagues on both sides of the aisle who’ve lost their way and given\n\ninto partisanship so much that it has caused several stalemates, as to why this is in the best interests of their constituents. And I would stand firm regardless of what kind of pressure was on, from either party, to stand firm in doing what is right for the people of Delaware, not the interests in Washington.\n\nCOONS: I frankly don’t think my opponent can or has pointed to one single example where she supports the current administration or an initiative of the Democratic Party. I have a real, practical record of having reached bipartisan solutions here in county government, of working with the elected Republicans who’ve served with me on county\n\ncouncil and on council while I’ve been county executive. I’ve got a real, hands-on record here in the private sector and in my service and partnership with the private sector of reaching out to folks from different political backgrounds, from different experiences, and from different worldviews, to work with them to find solutions.\n\nI think that’s the kind of record that Delawareans will look at in judging whether or not I’ve got the capacity to address some of this endless partisan bickering.\n\nBLITZER: Well, on this specific issue, and Ms. O’Donnell raised it earlier, I’ll give you a chance to clarify, to explain, she says that Harry Reid, the Senate majority leader, has called you his ‘pet.’\n\nCOONS: I don’t know why Harry Reid said that. I’m nobody’s pet. I’m going to be a bulldog for Delaware. I’m running to represent all Delawareans, of whatever party, not just the Democrats. And I’ve got a significant amount of support from independents, from Republicans, from Democrats, from all three counties.\n\nI’ve got a record of independence and of fighting for the public interest as county executive, and I would continue that in Washington.\n\nBLITZER: And just to clarify another point...\n\nO’DONNELL: Well, then why...\n\nBLITZER: ... from earlier, just to make sure we tie this up, earlier you said you didn’t want to have to talk about comments you made years ago about witchcraft and stuff like that. But in this commercial that’s so widely seen, you begin the commercial with the words ‘I am not a witch.’ What were you thinking...\n\nO’DONNELL: Put it to rest.\n\nBLITZER: What were you thinking?\n\nO’DONNELL: To put it to rest. To put it behind me.\n\nBLITZER: But didn’t you realize if you do that in a commercial, it would just revive it and everybody would be talking about that?\n\nO’DONNELL: No. We’re moving past that and we’re talking about the issues. I’d like to address what my opponent just said about being a bulldog for Delaware, yet in a fund-raising letter he promises to support the ‘Reid-Obama-Pelosi agenda’ lockstep and barrel (sic). That’s not non-partisanship.\n\nAnd again, why are the -- why is the Democratic Party pulling out all of the stops to get him elected? Because they see him as a rubber stamp for their agenda. And there are many things that I have publicly said that I support the Obama administration on.\n\nI support Obama’s decision to send troops to Afghanistan. I support Obama’s decision for drones. I support Obama’s decision to treat the American who is recruiting terrorists on American soil, who is hiding in Yemen, I support the decision for our intelligence agencies to do whatever it takes to take him out.\n\nSo there are things that I would proudly support, when it is in the best interest of Delawareans. But I believe that a lot of the policies coming from this administration are not in the best interest of Delawareans, and most of them are the failed stimulus bills where we’ve been promised one thing and then received another.\n\nBut breaking promises is something that my opponent is very comfortable doing.\n\nKARIBJANIAN: But even local party leaders have questioned you candidacy, especially after the primary. And you criticized the man you beat in that primary for being someone who went with what he felt was in the best interests of Delawareans, for being someone who was borrowing Republican principles but going with the Democrats. So how can you rationalize...\n\nO’DONNELL: What I did in the Republican primary, and what I will continue to do is bust up the backroom deals. We have -- a lot of our leaders have an obnoxious sense of entitlement about who should get in office and who should represent them on the ballot.\n\nKARIBJANIAN: OK.\n\nO’DONNELL: What my campaign did is put the...\n\nKARIBJANIAN: I need to interrupt just because we have to get to the closing statements.\n\nO’DONNELL: Ah, OK.\n\nBLITZER: All right. Let’s -- and we will begin the closing statements, both of you will have a chance to make your final comments. We’ll begin with Ms. O’Donnell.\n\nO’DONNELL: Thank you. Once again, I’d like to thank the host of\n\nthis debate and Nancy and Wolf.\n\nAnd I hope now that the Delaware voters better understand the clear choice we face in November. My opponent has a record of raising taxes and a record of wasting -- wasteful spending.\n\nLike so many career politicians, he says he would do one thing and then only breaks his promises after he has assumed office. My opponent will rubber stamp the same failed policies that have caused unemployment and our national debt to skyrocket.\n\nHe is in lockstep with Barack Obama and Harry Reid. And that’s why Harry Reid has called him his ‘pet.’ I’m not a Democrat, but I know that what is happening in this country right now is not what my Democratic friends voted for when they voted for change in 2008.\n\nWhat Washington needs now are new voices and new ideas that look to the people and not to the government for the solutions to our economic problems.\n\nMy opponent is addicted to a culture of spending, waste, fraud and abuse, whether it’s spending tax dollars on men’s fashion shows, or to pay off his cronies with sweetheart pension deals and special interests. We already have enough politicians in Washington like that.\n\nI want to go to Washington and be the voice of the people of Delaware, not any party of special interest group. I want to go to Washington and represent the people who put me on the stage tonight and who are willing to work hard to get our country back on track again. It’s not going to be easy, but I do believe that America is the greatest force of good in the world, and I had never questioned whether America is a beacon of freedom and justice.\n\nWe will get our financial house in order. We will cut spending. We will reform our government, and we will defeat our enemies and see triumph of (ph) our (ph) freedom again.\n\nSo with that said, I hope that you will support me and cast your vote for O’Donnell for U.S. Senate. God bless you and God bless Delaware.\n\nCOONS: I appreciate your attention to tonight’s debate. Thank you for the tough questions you’ve asked and for the open and good conversation we’ve had over the last 90 minutes. I think you’ve heard, there is a real and clear difference between our opponent and me, in our values, our experience, and in our ", "images": ["https://ca-times.brightspotcdn.com/dims4/default/84d8b92/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "https://ca-times.brightspotcdn.com/a6/d6/eea0f1094fb281dbea09e0aa79cd/art-caltimes-trademark-3x.png", "https://ca-times.brightspotcdn.com/0e/c6/b86a8b4b43a793259deb28a32a56/latlogoinverse.svg"], "top_img": "https://ca-times.brightspotcdn.com/dims4/default/84d8b92/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.latimes.com/archives/blogs/top-of-the-ticket/story/2010-10-14/opinion-christine-odonnell-chris-coons-debate-full-transcript", "title": "Opinion: Christine O’Donnell-Chris Coons debate: Full transcript", "meta_data": {"og": {"title": "Opinion: Christine O'Donnell-Chris Coons debate: Full transcript", "url": "https://www.latimes.com/archives/blogs/top-of-the-ticket/story/2010-10-14/opinion-christine-odonnell-chris-coons-debate-full-transcript", "image": {"identifier": "https://ca-times.brightspotcdn.com/dims4/default/84d8b92/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "url": "https://ca-times.brightspotcdn.com/dims4/default/84d8b92/2147483647/strip/true/crop/2400x1260+0+0/resize/1200x630!/quality/80/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fdf%2F45%2F57d858144a2a88575fa2b03080bb%2Flatlogo-ss.jpg", "width": 1200, "height": 630, "type": "image/jpeg", "alt": "LA Times logo"}, "description": "This article was originally on a blog post platform and may be missing photos, graphics or links.", "site_name": "Los Angeles Times", "type": "article"}, "article": {"content_tier": "metered", "published_time": "2010-10-14T10:04:00", "opinion": "false", "section": "Top of the Ticket"}, "twitter": {"card": "summary_large_image", "description": "This article was originally on a blog post platform and may be missing photos, graphics or links.", "site": "@latimes", "title": "Opinion: Christine O'Donnell-Chris Coons debate: Full transcript"}, "fb": {"app_id": 134435029966155, "pages": 5863113009}, "Googlebot-News": "noindex", "robots": "max-image-preview:large", "viewport": "width=device-width,initial-scale=1", "description": "This article was originally on a blog post platform and may be missing photos, graphics or links.", "brightspot.contentId": "00000181-96cb-dfab-af99-d7cb3a0b0002", "brightspot.cached": "false"}, "movies": [], "publish_date": 1287047040.0, "source": "http://latimesblogs.latimes.com", "summary": ""}