{"url": "https://en.wikipedia.org/wiki/Me_Too_movement", "text": "Social movement against sexual abuse and harassment\n\n#MeToo sign at a march\n\n#MeToo[a] is a social movement against sexual abuse, sexual harassment, and rape culture, in which people publicize their experiences of sexual abuse or sexual harassment.[1][2][3] The phrase \"Me Too\" was initially used in this context on social media in 2006, on Myspace, by sexual assault survivor and activist Tarana Burke.[4] Harvard University published a case study on Burke, called \"Leading with Empathy: Tarana Burke and the Making of the Me Too Movement\".[5]\n\nThe purpose of \"Me Too\", as initially voiced by Burke as well as those who later adopted the tactic, is to empower sexually assaulted people (especially young and vulnerable women) through empathy, solidarity, and strength in numbers, by visibly demonstrating how many have experienced sexual assault and harassment, especially in the workplace.[4][6][7]\n\nFollowing the exposure of numerous sexual-abuse allegations against Harvey Weinstein in October 2017,[8][9] the movement began to spread virally as a hashtag on social media.[7][10][11] On October 16, 2017, American actress Alyssa Milano posted on Twitter, \"If all the women who have been sexually harassed or assaulted wrote 'Me too' as a status, we might give people a sense of the magnitude of the problem,\" saying that she got the idea from a friend.[12][13][14][15] A number of high-profile posts and responses from American celebrities Gwyneth Paltrow,[16] Ashley Judd,[17] Jennifer Lawrence,[18] and Uma Thurman, among others, soon followed.[19]\n\nWidespread media coverage and discussion of sexual harassment, particularly in Hollywood, led to high-profile terminations from positions held, as well as criticism and backlash.[20][21][22]\n\nAfter millions of people started using the phrase and hashtag in this manner in English, the expression began to spread to dozens of other languages. The scope has become somewhat broader with this expansion, however, and Burke has more recently referred to it as an international movement for justice for marginalized people.[23] After the hashtag #MeToo went viral in late 2017, Facebook reported that almost half of its American users were friends with someone who felt they had been sexually assaulted or harassed.[24]\n\nPurpose [ edit ]\n\nThe original purpose of \"Me Too\" as used by Tarana Burke in 2006 was to empower women through empathy, especially young and vulnerable women. In October 2017, Alyssa Milano encouraged using the phrase as a hashtag to help reveal the extent of problems with sexual harassment and assault by showing how many people have experienced these events themselves. It therefore encourages women to speak up about their abuses, knowing that they are not alone.[4][6]\n\nAfter millions of people started using the phrase, and it spread to dozens of other languages, the purpose changed and expanded, and as a result, it has come to mean different things to different people. Tarana Burke accepts the title of \"leader\" of the movement, but has stated that she considers herself more of a \"worker.\" Burke has stated that this movement has grown to include both men and women of all colors and ages, as it continues to support marginalized people in marginalized communities.[20][23] There have also been movements by men aimed at changing the culture through personal reflection and future action, including #IDidThat, #IHave, and #IWill.[25]\n\nAwareness and empathy [ edit ]\n\nAnalyses of the movement often point to the prevalence of sexual violence, which has been estimated by the World Health Organization to affect one-third of all women worldwide. A 2017 poll by ABC News and The Washington Post also found that 54% of American women report receiving \"unwanted and inappropriate\" sexual advances with 95% saying that such behavior usually goes unpunished. Others state that #MeToo underscores the need for men to intervene when they witness demeaning behavior.[26][27][28]\n\nBurke said that #MeToo declares sexual violence sufferers are not alone and should not be ashamed.[29] Burke says sexual violence is usually caused by someone the woman knows, so people should be educated from a young age that they have the right to say no to sexual contact from any person, even after repeated solicitations from an authority or spouse, and to report predatory behavior.[30] Burke advises men to talk to each other about consent, call out demeaning behavior when they see it and try to listen to victims when they tell their stories.[30]\n\nAlyssa Milano said that #MeToo has helped society understand the \"magnitude of the problem\" and that, \"it's a standing in solidarity to all those who have been hurt.\"[31][32] She stated that the success of #MeToo will require men to take a stand against behavior that objectifies women.[33]\n\nPolicies and laws [ edit ]\n\nBurke has stated the current purpose of the movement is to give people the resources to have access to healing, and to advocate for changes to laws and policies. Burke has highlighted goals such as processing all untested rape kits, re-examining local school policies, improving the vetting of teachers, and updating sexual harassment policies.[34] She has called for all professionals who work with children to be fingerprinted and subjected to a background check before being cleared to start work. She advocates for sex education that teaches kids to report predatory behavior immediately.[30] Burke supports the #MeToo bill in the US Congress, which would remove the requirement that staffers of the federal government go through months of \"cooling off\" before being allowed to file a complaint against a Congressperson.[34]\n\nMilano stated in 2017 that a priority for #MeToo is changing the laws surrounding sexual harassment and assault, for example instituting protocols that allow sufferers in all industries to file complaints without retaliation. She supported legislation making it difficult for publicly traded companies to hide cover-up payments from their stockholders and would like to make it illegal for employers to require new workers to sign non-disclosure agreements as a condition of employment.[33] Gender analysts such as Anna North have stated that #MeToo should be addressed as a labor issue due to the economic disadvantages to reporting harassment. North suggested combating underlying power imbalances in some workplaces, for example by raising the tipped minimum wage, and embracing innovations like the \"portable panic buttons\" mandated for hotel employees in Seattle.[35]\n\nOthers have suggested that barriers to employment must be removed, such as the job requirement by some employers to sign non-disclosure agreements or other agreements that prevent an employee from talking about their employment publicly, or taking disputes (including sexual harassment claims) to arbitration rather than to legal proceedings. It's been suggested that legislation should be passed that bans these types of mandatory pre-employment agreements.[1]\n\nSome policy-based changes that have been suggested include increasing managerial oversight; creating clear internal reporting mechanisms; more effective and proactive disciplinary measures; creating a culture that encourages employees to be open about serious problems;[1] imposing financial penalties for companies that allow workers to remain in their position when they have repeatedly sexually harassed others; and forcing companies to pay huge fines or lose tax breaks if they decide to retain workers who are sexual harassers.[36]\n\nMedia coverage [ edit ]\n\nIn the coverage of #MeToo, there has been widespread discussion about the best ways to stop sexual harassment and abuse - for those currently being victimized at work, as well as those who are seeking justice for past abuse and trying to find ways to end what they see as a widespread culture of abuse. There is general agreement that a lack of effective reporting options is a major factor that drives unchecked sexual misconduct in the workplace.[37]\n\nFalse reports of sexual assault are very rare,[38] but when they happen, they are put in the spotlight for the public to see. This can give the false impression that most reported sexual assaults are false. However, false reports of sexual assault account for only 2% to 10% of all reports.[39][40][dubious – discuss] These figures do not take into account that the majority of victims do not report when they are assaulted or harassed. Misconceptions about false reports are one of the reasons why women are scared to report their experiences with sexual assault - because they are afraid that no one will believe them, that in the process they will have embarrassed and humiliated themselves, in addition to opening themselves up to retribution from the assailants.[41][42]\n\nIn France, a person who makes a sexual harassment complaint at work is reprimanded or fired 40% of the time, while the accused person is typically not investigated or punished.[43] In the United States, a 2016 report from the Equal Employment Opportunity Commission states that although 25–85% of women say they experience sexual harassment at work, few ever report the incidents, most commonly due to fear of reprisal.[37] There is evidence that in Japan, as few as 4% of rape victims report the crime, and the charges are dropped about half the time.[44][45]\n\nThere is a discussion on the best ways to handle whisper networks, or private lists of \"people to avoid\" that are shared unofficially in nearly every major institution or industry where sexual harassment is common due to power imbalances, including government, media, news, and academia. These lists have the stated purpose of warning other workers in the industry and are shared from person-to-person, on forums, in private social media groups, and via spreadsheets. However, it has been argued that these lists can become \"weaponized\" and be used to spread unsubstantiated gossip — an opinion which has been discussed widely in the media.[46]\n\nDefenders say the lists provide a way to warn other vulnerable people in the industry if worried about serious retribution from the abusers, especially if complaints have already been ignored. They say the lists help victims identify each other so they can speak out together and find safety in numbers.[46][47] Sometimes these lists are kept for other reasons. For example, a spreadsheet from the United Kingdom called \"High Libido MPs\" and dubbed \"the spreadsheet of shame\" was created by a group of male and female Parliamentary researchers, and contained a list of allegations against nearly 40 Conservative MPs in the British Parliament. It is also rumored that party whips (who are in charge of getting members of Parliament to commit to votes) maintain a \"black book\" that contains allegations against several lawmakers that can be used for blackmail.[48][49][50] When it is claimed a well-known person's sexual misconduct was an \"open secret\", these lists are often the source.[46] In the wake of #MeToo, several private whisper network lists have been leaked to the public.[46][47]\n\nIn India, a student gave her friends a list containing names of professors and academics in the Indian university system to be avoided, which later went viral after it was posted on social media.[51] In response to criticism in the media, the authors defended themselves by saying they were only trying to warn their friends, had confirmed every case, and several victims from the list were poor students who had already been punished or ignored when trying to come forward.[52][53] Moira Donegan, a New York City-based journalist, privately shared a crowd-sourced list of \"Shitty Media Men\" to avoid in publishing and journalism. When it was shared outside her private network, Donegan lost her job. Donegan stated it was unfair so few people had access to the list before it went public; for example, very few women of color received access (and therefore protection) from it. She pointed to her \"whiteness, health, education, and class\" that allowed her to take the risk of sharing the list and getting fired.[47]\n\nThe main problem with trying to protect more potential victims by publishing whisper networks is determining the best mechanism to verify allegations in a way that is fair to all parties.[54][55] Some suggestions have included strengthening labor unions in vulnerable industries so workers can report harassment directly to the union instead of to an employer. Another suggestion is to maintain industry hotlines which have the power to trigger third-party investigations.[54] Several apps have been developed which offer various ways to report sexual misconduct, and some can connect victims who have reported the same person.[56]\n\nIssues with social norms [ edit ]\n\nIn the wake of #MeToo, many countries such as the U.S.,[57] India,[58] France,[59] China,[60] Japan,[44] Italy[61] and Israel have seen discussion in the media on whether cultural norms need to be changed for sexual harassment to be eradicated in the workplace.\n\nDr. John Launer of Health Education England stated leaders must be made aware of common \"mismatches of perceptions\" at work to reduce incidents where one person thinks they are flirting while the other person feels like they're being demeaned or harassed.[62] Reporter Anna North from Vox states one way to address #MeToo is teach children the basics of sex. North states the cultural notion that women do not enjoy sex leads men \"to believe that a lukewarm yes is all they're ever going to get\", referring to a 2017 study which found that men who believe women enjoy being forced into sex are \"more likely to perceive women as consenting\".[63] Alyssa Rosenberg of The Washington Post called for society to be careful of overreaching by \"being clear about what behavior is criminal, what behavior is legal but intolerable in a workplace, and what private intimate behavior is worthy of condemnation\" but not part of the workplace discussion. She says \"preserving the nuances\" is more inclusive and realistic.[64]\n\nProfessor Daniel Drezner stated that #MeToo laid the groundwork for two major cultural shifts. One is the acceptance that sexual harassment (not just sexual assault) is unacceptable in the workplace. The other is that when a powerful person is accused of sexual harassment, the reaction should be a presumption that the less powerful accuser is \"likely telling the truth, because the risks of going public are great\". However, he states society is struggling with the speed at which change is being demanded.[65]\n\nReform and implementation [ edit ]\n\nAlthough #MeToo initially focused on adults, the message spread to students in K–12 schools where sexual abuse is common both in person and online.[66] MeTooK12 is a spin-off of #MeToo created in January 2018 by the group Stop Sexual Assault in Schools, founded by Joel Levin and Esther Warkov, aimed at stopping sexual abuse in education from kindergarten to high school.[67][68] #MeTooK12 was inspired in part by the removal of certain federal Title IX sexual misconduct guidelines.[69] There is evidence that sexual misconduct in K–12 education is dramatically underreported by both schools and students, because nearly 80% of public schools never report any incidents of harassment. A 2011 survey found 40% of boys and 56% of girls in grades 7–12 reported had experienced negative sexual comments or sexual harassment in their lives.[67][69] Approximately 5% of K–12 sexual misconduct reports involved 5 or 6-year-old students. #MeTooK12 is meant to demonstrate the widespread prevalence of sexual misconduct towards children in school, and the need for increased training on Title IX policies, as only 18 states require people in education to receive training about what to do when a student or teacher is sexually abused.[68]\n\nRole of men [ edit ]\n\nThere has been discussion about what possible roles men may have in the #MeToo movement.[70][71][72] It has been noted that 1 in 6 men have experienced sexual abuse of some sort during their lives and often feel unable to talk about it.[73] Creator Tarana Burke and others have asked men to call out bad behavior when they see it,[71][72] or just spend time quietly listening.[20][74] Some men have expressed the desire to keep a greater distance from women since #MeToo went viral because they do not fully understand what actions might be considered inappropriate.[75][76] For the first few months after #MeToo started trending, many men expressed difficulty in participating in the conversation due to fear of negative consequences, citing examples of men who have been treated negatively after sharing their thoughts about #MeToo.[77]\n\nAuthor and former pick-up artist Michael Ellsberg encourages men to reflect on past behavior and examples of questionable sexual behavior, such as the viral story Cat Person, written from the perspective of a twenty-year-old woman who goes on a date with a much older man and ends up having an unpleasant sexual experience that was consensual but unwanted. Ellsberg has asked men to pledge to ensure women are mutually interested in initiating a sexual encounter and to slow down if there is ever doubt a woman wants to continue.[78][79]\n\nRelationship instructor Kasia Urbaniak said the movement is creating its own crisis around masculinity. \"There's a reflective questioning about whether they're going to be next and if they’ve ever hurt a woman. There's a level of anger and frustration. If you’ve been doing something wrong but haven't been told, there's an incredible sense of betrayal and it’ll provoke a backlash. I think silence on both sides is incredibly dangerous.\" Urbaniak says she would like women to be allies of men and to be curious about their experience. \"In that alliance there's a lot more power and possibility than there is in men stepping aside and starting to stew.\"[80]\n\nIn August 2018, The New York Times detailed allegations that leading #MeToo figure Asia Argento sexually assaulted actor Jimmy Bennett.[81] The sexual assault allegedly took place in a California hotel room in 2013 when he was only two months past his 17th birthday and she was 37; the age of consent in that state is 18.[81] Bennett said when Argento came out against Harvey Weinstein, it stirred memories of his own experience. He imparted he had sought to resolve the matter privately, and had not spoken out sooner, \"because I was ashamed and afraid to be part of the public narrative.\"[82] In a statement provided to The Times, he said: \"I was underage when the event took place, and I tried to seek justice in a way that made sense to me at the time because I was not ready to deal with the ramifications of my story becoming public. At the time I believed there was still a stigma to being in the situation as a male in our society. I didn't think that people would understand the event that took place from the eyes of a teenage boy.\" Bennett said he would like to \"move past this event in my life,\" adding, \"today I choose to move forward, no longer in silence.\"[82] Argento, who quietly arranged a $380,000 nondisclosure settlement with Bennett in the months following her revelations regarding Weinstein, has denied the allegations.[83] Rose McGowan initially expressed support for Argento and implored others to show restraint, tweeting, \"None of us know the truth of the situation and I'm sure more will be revealed. Be gentle.\" As a vocal advocate of the Me Too movement, McGowan faced criticism on social media for her comments, which conflicted with the movement's message of believing survivors.[84] MeToo founder Tarana Burke responded to the Asia Argento report, stating \"I’ve said repeatedly that the #metooMVMT is for all of us, including these brave young men who are now coming forward. Sexual violence is about power and privilege. That doesn't change if the perpetrator is your favorite actress, activist or professor of any gender.\"[3]\n\nTimeline [ edit ]\n\n2006 (Tarana Burke) [ edit ]\n\nTarana Burke, a social activist and community organizer, began using the phrase \"Me Too\" in 2006, on the Myspace social network[4] to promote \"empowerment through empathy\" among women of color who have been sexually abused.[15][85][86] She was born in Bronx, NY on September 12, 1973. Growing up, she lived in poverty in a low-income family. She was raped and sexually assaulted, both as a child and a teenager. Her mother encouraged her to help others who had been through what she been through. She moved to Selma, Alabama, where she gave birth to her daughter, Kaia Burke, and raised her as a single parent. Burke, who is creating a documentary titled Me Too, has said she was inspired to use the phrase after being unable to respond to a 13-year-old girl who confided to her that she had been sexually assaulted. Burke said she later wished she had simply told the girl: \"Me too\".[4][29]\n\n2015 (Ambra Gutierrez) [ edit ]\n\nIn 2015, The New York Times reported that Weinstein was questioned by police \"after a 22-year-old woman accused him of touching her inappropriately.\"[87] The woman, Italian model Ambra Gutierrez, cooperated with the New York City Police Department (NYPD) to obtain an audio recording where Weinstein admitted to having inappropriately touched her.[88] As the police investigation progressed and became public, tabloids published negative stories about Gutierrez that portrayed her as an opportunist.[89] American Media, publisher of the National Enquirer, allegedly agreed to help suppress the allegations by Gutierrez and Rose McGowan. Manhattan District Attorney Cyrus Vance Jr. decided not to file charges against Weinstein, citing insufficient evidence of criminal intent, against the advice of local police who considered the evidence sufficient.[90] The New York district attorney's office and the NYPD blamed each other for failing to bring charges.[90]\n\n2017 (Alyssa Milano) [ edit ]\n\nFollowing widespread exposure of accusations of predatory behavior by Harvey Weinstein, and her own blog post on the subject, on October 15, 2017, actress Alyssa Milano wrote: \"If you've been sexually harassed or assaulted write 'me too' as a reply to this tweet.\", and reposted the following phrase suggested by Charlotte Clymer:[91] \"If all the women who have been sexually harassed or assaulted wrote 'Me too.' as a status, we might give people a sense of the magnitude of the problem.\"[13][12] She encouraged spreading the phrase \"Me Too\" to attempt to draw attention to sexual assault and harassment.[6][15] The next day, October 16, 2017, Milano wrote: \"I was just made aware of an earlier #MeToo movement, and the origin story is equal parts heartbreaking and inspiring\", providing the link to site of Ms. Burke.[4][29][92] Milano credits her identification with the Me Too movement to experiencing sexual harassment during a concert when she was 19.[93]\n\nSeveral hashtags related to sharing stories of workplace sexual harassment were used before #MeToo, including #MyHarveyWeinstein, #WhatWereYouWearing (on March 12, 2014, there was a question on Twitter asking \"What Were You Wearing When You Were Assaulted?\" and responses from people stating what they were wearing;[94] there were posts with the #whatwereyouwearing hashtag as early as of 2010, not related to any kind of sexual harassment or workplace[95][96][97]), #SurvivorPrivilege (in June 2014 the #SurvivorPrivilege was about alleged lies of rape survivors to get privileges and denial of that by females, especially by students[98]) and #YouOkSis (on August 2, 2014, there was #YouOkSis about street harassment[99]).[100][101][102]\n\n2022 (Johnny Depp and Amber Heard) [ edit ]\n\nAfter filing for divorce from Johnny Depp in May 2016, actress Amber Heard alleged that Depp had abused her physically during their relationship.[103] Depp filed a defamation lawsuit in the UK against The Sun's publishers over a 2018 article that alleged he was a \"wife beater\".[104]. In December 2018, Heard published an op-ed in The Washington Post, stating that she had spoken up against sexual violence and become a public figure representing domestic abuse.[105] Although she did not explicitly name Depp in the op-ed,[106] he filed a defamation lawsuit against her in Virginia. Depp lost his lawsuit in London's High Court of Justice, after a judge determined that 12 of the 14 alleged incidents of domestic violence had occurred and that Heard's allegations of abuse were \"substantially true\".[107] In the Virginia trial, Depp's lawyers sought to disprove Heard's allegations before a jury, claiming that she, and not her ex-husband, had been the abuser in the relationship.[108]\n\nThe Virginia trial was livestreamed, generating enormous public interest. Social media platforms featured substantial support for Depp and criticism of Heard, with videos carrying the hashtag #JusticeForJohnnyDepp attaining over 18 billion views on TikTok by the trial's conclusion.[109] A consensus view emerged online that Heard was lying, and her testimony was widely ridiculed.[110] Ruling that her op-ed had defamed Depp with actual malice, the jury awarded him $10 million in compensatory damages and $5 million in punitive damages (the latter reduced to $350,000 under Virginia state law) while awarding Heard $2 million in compensatory damages for a counterclaim that Depp's former lawyer had defamed her.[111] During and after the trial, Depp received support from a large number of female celebrities, including Jennifer Aniston, Emma Roberts, Rita Ora, Cat Power, Patti Smith, Paris Hilton, Zoe Saldana, Kelly Osbourne, Vanessa Hudgens, Naomi Campbell, Liv Tyler, Juliette Lewis, and Ashley Benson. His former partners Winona Ryder, Kate Moss, and Vanessa Paradis provided testimony or statements during legal proceedings that Depp had never been violent or abusive to them.[112][113]\n\nIn a statement on the verdict, Heard claimed: \"It sets back the clock to a time when a woman who spoke up and spoke out could be publicly shamed and humiliated. It sets back the idea that violence against women is to be taken seriously\".[114] Some domestic violence experts suggested that the extensive online ridicule Heard had experienced during the trial would deter women from reporting abuse.[110] Various opinion pieces from major news outlets were written either in support of Heard or against her, as well as on the trial's implications for the future of the #MeToo movement.[115][116][117][118][119][120][121][122][123]\n\nImpact [ edit ]\n\nThe New York Times found that, out of 201 prominent men that had lost their jobs after public allegations of sexual harassment, nearly half of their replacements were women.[124]\n\nIn August 2021, the Washington Post analyzed the impact of #MeToo on changing behavior. The article states there was a surge of reports of sexual assault in the twelve months preceding October 2018, but that many of the claims related to people coming forward regarding past incidents. The article shows a mixed picture regarding changing behavior with a significantly smaller percentage of women having experienced sexual coercion or unwanted sexual attention at the office in 2018 in comparison to 2016, but with a sharp rise in subtler forms of behaviors that do not rise to the level of illegal sexual harassment, such as jokes about what is still allowed or telling inappropriate stories, which may have come as a backlash to the #MeToo movement. The article notes that in response to the #MeToo movement, 19 states have enacted new sexual harassment protections for victims and more than 200 bills were introduced in state legislatures to deter harassment.[125]\n\nU.S. media and fashion industries [ edit ]\n\nThe phrase \"Me too\" was tweeted by Milano on October 15, 2017, and had been used more than 200,000 times by the end of the day.[126] It was also tweeted more than 500,000 times by October 16 and the hashtag was used by more than 4.7 million people in 12 million posts during the first 24 hours on Facebook.[127][29] The platform reported 45% of users in the United States had a friend who had posted using the term.[128]\n\nTens of thousands of people, including hundreds of celebrities, replied with #MeToo stories.[129] Some men, such as actors Terry Crews[130] and James Van Der Beek,[131] have responded to the hashtag with their own experiences of harassment and abuse. Others have responded by acknowledging past behaviors against women, spawning the hashtag #HowIWillChange.[132]\n\nIn addition to Hollywood, \"Me Too\" declarations elicited discussion of sexual harassment and abuse in the music industry,[133] sciences,[134] academia,[135] and politics.[136]\n\nFeminist author Gloria Feldt stated in Time that many employers are being forced to make changes in response to #MeToo, for example examining gender-based pay differences and improving sexual harassment policies.[137] Others have noted there has been pressure on companies, specifically in the financial industry, to disclose diversity statistics.[clarification needed][138]\n\nIn February 2019 actress Emma Thompson wrote a letter to the American production company Skydance Media, to explain that she had pulled out of the production of the animated feature film Luck the month prior because of the company's decision to hire Disney Chief Creative Officer, John Lasseter,[139] who had been accused of harassing women while at Disney. His behavior resulted in his decision to take a six-month leave of absence from the company, as he indicated in a memo in which he acknowledged \"painful\" conversations and unspecified \"missteps\".[140]\n\nAmong others, Thompson stated: \"If a man has been touching women inappropriately for decades, why would a woman want to work for him if the only reason he's not touching them inappropriately now is that it says in his contract that he must behave 'professionally'?\".[139]\n\nThe 2019 rerelease of Toy Story 2 had a blooper scene during the credits removed due to sexual misconduct concerns.[141]\n\nChurches [ edit ]\n\nIn November 2017, the hashtag #ChurchToo was started by Emily Joy and Hannah Paasch on Twitter and began trending in response to #MeToo as a way to try to highlight and stop sexual abuse that happens in a church.[142][143] In early January 2018, about a hundred evangelical women also launched #SilenceIsNotSpiritual to call for changes to how sexual misconduct is dealt within the church.[144][145] #ChurchToo started spreading again virally later in January 2018 in response to a live-streamed video admission by Pastor Andy Savage to his church that he sexually assaulted a 17-year-old girl twenty years before as a youth pastor while driving her home, but then received applause by his church for admitting to the incident and asking for forgiveness. Pastor Andy Savage then resigned from his staff position at Highpoint Church and stepped away from ministry.[146][147][148] According to Tom Inglis in his book, Are the Irish Different?, many have argued that the current issue of reported child sexual abuse in the Catholic church is one of the biggest crises in the church's history.[149]\n\nEducation [ edit ]\n\nThe University of California has had substantial accusations of sexual harassment reported yearly in the hundreds at all nine UC campuses, notably UC Berkeley, Davis, Irvine, Los Angeles, and San Diego.[150] However, a landmark event at the University of California, Irvine spearheaded the removal and reprimand of several campus officials and professors accused of sexual harassment and discrimination. In early July 2018, UC Irvine removed millionaire benefactor Francisco J. Ayala's name from its biology school, central science library, graduate fellowships, scholar programs, and endowed chairs after an internal investigation substantiated a number of sexual harassment claims. The results from the investigation were compiled in a 97-page report, which included testimony from victims enduring Ayala's harassment for 15 years.[151][152][153][154][155][156][157] His removal promptly sparked the removal of Professor Ron Carlson in August 2018, who had led the creative writing program at UC Irvine. He resigned after substantiated reports of sexual misconduct with an underage student were unearthed.[158] UC Irvine upon learning about the report accepted Professor Carlson's immediate resignation.[159] Several claims were also reviewed against Thomas A. Parham, former vice chancellor at UC Irvine and former president of the Association of Black Psychologists.[160]\n\nTo address harassment within scientific settings, BethAnn McLaughlin started the #MeTooSTEM movement and hashtag.[161] She called for the National Institutes of Health to cut funding to anyone who has been found guilty of harassment charges.[161][162] McLaughlin shared the MIT Media Lab Disobedience Award with Tarana Burke and Sherry Marts for her work on Me Too in STEM.[163][164]\n\nThere are still many places of education such as high schools, however, where legal intervention is not readily enforced for situations where sexual assault takes place. Pamela Y. Price in her book Directions in Sexual Harassment Law describes how \"a major argument for why [laws against] sexual harassment won't work in education is that issues of sexuality can't be regulated (similar to the debate in employment) or that adolescent behavior is too unpredictable to be legally controlled\" (Price 62).[165]\n\nFinance [ edit ]\n\nIt has been noted that, although the financial industry is known to have a wide prevalence of sexual harassment,[166] as of January 2018, there were no high-profile financial executives stepping down as the result of #MeToo allegations.[167] The first widely covered example of concrete consequences in finance was when two reporters, including Madison Marriage of the Financial Times, went undercover at a men-only Presidents Club event meant to raise money for children. Because women were not allowed to attend except as \"hostesses\" in tight, short black dresses with black underwear, Financial Times reporter Madison Marriage and another reporter got jobs as hostesses and documented widespread sexual misconduct. As a result, The Presidents Club was shut down.[167]\n\nIn March 2018, Morgan Stanley broker, Douglas E. Greenberg, was put on administrative leave after a New York Times story outlined harassment allegations by four women, including multiple arrests for the violation of restraining orders, and a threat to burn down an ex-girlfriend's house. It has been called the #MeToo moment of Portland's financial service industry.[168]\n\nThe authors of a December 2018 Bloomberg News article on this topic interviewed more than thirty senior Wall Street executives and found that many are now more cautious about mentoring up and coming female executives because of the perceived risks involved. One said, \"If men avoid working or traveling with women alone, or stop mentoring women for fear of being accused of sexual harassment, those men are going to back out of a sexual harassment complaint and right into a sex discrimination complaint.\"[169]\n\nPolitics and government [ edit ]\n\nStatehouses in California, Illinois, Oregon, and Rhode Island responded to allegations of sexual harassment surfaced by the campaign,[170] and several women in politics spoke out about their experiences of sexual harassment, including United States Senators Heidi Heitkamp, Mazie Hirono, Claire McCaskill and Elizabeth Warren.[136] Congresswoman Jackie Speier has introduced a bill aimed at making sexual harassment complaints easier to report on Capitol Hill.[171] The accusations in the world of Spanish politics have also been published in the media,[172] and a series of allegations and research on MPs and political figures of (all major British political parties) regarding sexual impropriety became a nationwide scandal in 2017; this research was undertaken in the aftermath of the Weinstein scandal and the Me Too movement.[173][174][175]\n\nDetective Leslie Branch-Wise of the Denver Police Department spoke publicly for the first time in 2018 about experiencing sexual harassment by Denver Mayor Michael B. Hancock. The detective provided sexually suggestive text messages from Hancock sent to her while working for Hancock's security detail in 2012. After six years of keeping the secret, Detective Branch-Wise credited the Me Too movement as an inspiration to share her experience.[176]\n\nCongressman John Conyers was the first sitting United States politician to resign in the wake of #MeToo.[177][178][179] Later in 2019, Katie Hill resigned from Congress[180] due to an affair with a staffer after the House Ethics Committee opened an investigation into her conduct, stemming from these new rules.[181]\n\nIn October 2020, the Lord Mayor of Copenhagen, Frank Jensen, resigned after admitting that he had been harassing women for about 30 years.[182] The Danish Foreign Minister, Jeppe Kofod, was reported to police because he had intercourse with a 15-year-old girl.[183] He has admitted the affair, but it is not clear whether it was criminal.\n\nThe Me Too movement still struggles with getting laws passed in certain areas of the United States. The US government has not passed any laws for sexual harassment and abuse because Congress is holding out on it. Because no laws are not being passed, the movement stands up and continues to fight for social change. As they keep fighting, they get some changes across the US.[184] In some states, there has been banning of nondisclosure agreements because of the situation with Harvey Weinstein. He kept his assistant from speaking out for 20 years because of the nondisclosure agreement that Weinstein made him sign. So this banning has been enforced in states such as California, New Jersey, and New York. There have been cases where the victims have been paid for their traumas. An example would be the case with Larry Nassar, who used to be the doctor for the USA Gymnastics team. Nassar was sent to jail for 40 and 175 years for sexually assaulting more than 100 gymnasts on the team.\n\nA 2021 study in the American Journal of Political Science found that supporters of the Me Too movement were far more even-handed when evaluating accusations of sexual misconduct in U.S. politics. Whereas partisans tended to be more likely to view accused out-party members as guilty of sexual misconduct than members of their party, Me Too supporters did not show similar degrees of favoritism towards their co-partisans.[185]\n\nOn November 2, 2021, professional tennis player Peng Shuai accused Zhang Gaoli of sexual assault. Gaoli is a former Vice Premier of the People's Republic of China and a retired Chinese Communist Party official.[186]\n\nME TOO bill in U.S. Congress [ edit ]\n\nJackie Speier proposed the Member and Employee Training and Oversight on Congress Act (ME TOO Congress Act) on November 15, 2017.[187] The full language of the bipartisan bill was revealed by the House on January 18, 2018, as an amendment to the Congressional Accountability Act of 1995.[188] The purpose of the bill is to change how the legislative branch of the U.S. federal government treats sexual harassment complaints. Under the old system, complaints regarding the legislative branch were channeled through the Office of Compliance, which required complete confidentially through the process and took months of counseling and mediation before a complaint could be filed. Any settlement payments were paid using federal taxes, and it was reported that within a decade, $15 million of tax money had been spent settling harassment and discrimination complaints. The bill would ensure future complaints could only take up to 180 days to be filed. The bill would also allow the staffers to transfer to a different department or otherwise work away from the presence of the alleged harasser without losing their jobs if they requested it. The bill would require Representatives and Senators to pay for their harassment settlements. The Office of Compliance would no longer be allowed to keep settlements secret and would be required to publicly publish the settlement amounts and the associated employing offices. For the first time, the same protections would also apply to unpaid workers, including pages, fellows, and interns.[189][190][191]\n\nOn Thursday, February 10, 2022, The United States Congress gave final approval to legislation that ensures that anyone who is sexually harassed at work can seek legal redress, marking a watershed moment in the #MeToo movement, which sparked a national crisis over sexual misconduct.[192]\n\nSilicon Valley [ edit ]\n\nIn the months preceding the NY Times story on Harvey Weinstein, Travis Kalanick (CEO of Uber at the time) came under fire for enabling a misogynist culture at the company, and having extensive knowledge of sexual harassment complaints at the company, while failing to do anything about them.[193] After an initial blog post by a former Uber Engineer detailed her experiences at the company, more employees came out with their own stories, as documented in a follow-up article by the NY Times in late February 2017. In it, they detail how they had notified senior management including Kalanick about incidents of sexual harassment, and that their complaints had gone ignored.[194] A few months later, in June 2017, Kalanick himself came under allegations of sexual harassment, as it was reported that he visited an escort bar in Seoul, bringing fellow female employees of the company along with him.[195] One of the female employees filed a complaint to Human Resources about how she felt forced to be there, and was very uncomfortable in that environment, where women were made to wear tags with numbers on them, as if in an auction.[196] Fresh allegations of sexual harassment at the company surfaced one year later, implicating Uber's Corporate Development Executive Cameron Poetzscher. The allegations made it clear that Uber was not taking this issue seriously enough.[197]\n\nOn October 25, 2018, The New York Times released a detailed report on the prior behavior of Andy Rubin at Google. The allegations cite that Google knew of a sexual misconduct claim against Rubin, and yet still decided to pay him a $90 million separation package at his departure from the company.[198]\n\nSports [ edit ]\n\nSoon after #MeToo started spreading in late 2017, several allegations from a 2016 Indianapolis Star article resurfaced in the gymnastic industry against former U.S. Gymnastics doctor Larry Nassar of Michigan State University. Nassar was called out via #MeToo for sexually assaulting gymnasts as young as 6 years old during \"treatments\".[199] Rachael Denhollander was the first to call him out.[200] Though nothing was done after the initial allegations came out in 2016, after more than 150 women came forward, Nassar was effectively sentenced to life in prison. The president of Michigan State University, Lou Anna Simon, resigned in the wake of the scandal.[199]\n\nAt around the same time, WNBA star Breanna Stewart publicly revealed that she had been a victim of child sexual abuse from age 9 to 11.[201]\n\nIn late November 2017, Lui Lai Yiu, a hurdler from Hong Kong, recounted in a Facebook post instances of having been sexually assaulted by her male coach when she was 14, sparking off mass controversy in Hong Kong.[202] Her coach was arrested in late January 2018,[203] but acquitted in mid-November 2018.[204]\n\nIn 1996, while attending the University of Tennessee, former American football player Peyton Manning was accused of sexual assault by trainer Jamie Ann Naughright after he pressed his genitals against Naughright's face during a foot examination. Manning claims that he was just pulling a prank by \"mooning\" another athlete in the room as Naughright bent over to examine him. Both Naughright and the other athlete deny Manning's story. Naughright settled with the university for $300,000 for its alleged failure in four incidents, and resigned from the school. She had initially made a list of 33 complaints about the school.[205] Naughright filed a defamation lawsuit against Peyton Manning and three other parties in 2002. Manning defamed her in a book he wrote with his father and author John Underwood. The lawsuit was settled after the court ruled there was sufficient evidence for it to be heard by a jury. Terms of the settlement were not disclosed due to confidentiality terms.[206][207]\n\nMedicine [ edit ]\n\nMeToo has encouraged discussion about sexual harassment in the medical field.[62][208][209] Research had indicated that among U.S. academic medical faculty members, about 30% of women and 4% of men have reported experiencing sexual harassment, and it has been noted that medical staff who complain often receive negative consequences to their careers.[72][209] Other evidence has indicated 60% of medical trainees and students experienced harassment or discrimination during training, though most do not report the incidents.[62]\n\nMusic [ edit ]\n\nSeveral prominent musicians have expressed support for the Me Too movement and have shared their own experiences of sexual assault and harassment.\n\nBefore the Me Too Movement, in 2017, Jessie Reyez released the song \"Gatekeeper\" about her experience of harassment by a famous producer, describing the conversations men in power have with young women working in the music industry.[210] This song inspired female artists in the music industry to speak up against sexual harassment, contributing to the start of the Me Too movement.[211]\n\nActress Alyssa Milano's activism for the Me Too movement began because she was harassed at the age of 19 during a concert.[212] On October 15, 2017, she started a viral Twitter thread by tweeting \"If you’ve been sexually harassed or assaulted write 'me too' as a reply to this tweet.\" Musicians such as Sheryl Crow, Christina Perri and Lady Gaga responded and contributed their own personal experiences.[213]\n\nAmanda Palmer and songwriter Jasmine Power composed \"Mr. Weinstein Will See You Now\", a song that takes listeners through a story of a woman invited to the office of a man in power.[214] A music video with an all-woman crew, cast and production team was released on the anniversary of the New York Times's reporting on sexual abuse allegations against Harvey Weinstein, with profits donated to #TimesUp, a movement against sexual harassment.[215]\n\nThe band Veruca Salt used the #MeToo hashtag to air allegations of sexual harassment against James Toback,[216] and singer-songwriter Alice Glass used the hashtag to share a history of alleged sexual assault and other abuses by former Crystal Castles bandmate Ethan Kath.[217][218]\n\nSinger-songwriter Halsey wrote a poem, \"A Story Like Mine\", which she delivered at a 2018 Women's March in New York City. The poem describes incidents of sexual assault and violence throughout her life, including accompanying her best friend to Planned Parenthood after she had been raped and her personal experiences of sexual assault by neighbors and boyfriends.[219]\n\nSinger Kesha released the song \"Praying,\" in July 2017, describing her experiences and feelings towards her abuser. The abuse occurred at the hands of her former producer, Dr. Luke of Sony Kemosabe Records.[220]\n\nFormer Red House Painters frontman and Sun Kil Moon frontman, Mark Kozelek was accused of sexual misconduct by several women that was reported by Pitchfork in 2020 and 2021, respectively.[221][222]\n\nAllegations against figures in the music industry [ edit ]\n\nIn January 2019, the Lifetime documentary Surviving R. Kelly aired, describing several women's accusations of sexual, emotional, mental, and physical abuse by singer R. Kelly. The documentary questioned the \"ecosystem\" that \"supports and enables\" powerful individuals in the music industry.[223] In February 2019, Kelly was arrested for ten alleged counts of sexual abuse against four women, three of whom were minors at the time of the incidents.[224] His former wife Andrea Kelly has also accused him of domestic violence and filed a restraining order against him in 2005.[225]\n\nSinger Kesha has accused her former producer Dr. Luke of sexually, physically, and emotionally abusing her since the beginning of her music career.[226] Dr. Luke denied the allegations and a judge refused her request to be released from a contract with Sony Music due to the alleged abuse.[227] Kesha described her response to this experience in the song \"Praying\", which she performed at the 2018 Grammys. The song was seen as offering encouragement to sexual assault survivors that the world can improve.[228]\n\nA documentary was also instrumental in publicizing accusations against the late singer Michael Jackson. Child sexual abuse allegations against Jackson were renewed after the airing of the documentary Leaving Neverland in 2019. The documentary focuses on Wade Robson and James Safechuck and their interactions with Jackson, especially the sexual interactions they say they endured for years during their childhood.[229] Both had previously testified in Jackson's defense — Safechuck as a child during the 1993 investigation, Robson both as a child in 1993 and as a young adult in 2005.[230][231] In 2015, Robson's case against Jackson's estate was dismissed because it was filed too late.[232][233][234] The documentary resulted in a backlash against Jackson and a reassessment of his legacy in some quarters, while other viewers dismissed it as one-sided, questioned its veracity and viewed it as unconvincing due to factual conflicts between the film and the 1993 and 2005 allegations against Jackson, and his acquittal at trial.[235]\n\nIn 2020, it was revealed that rape allegations were made against former Recording Academy President, Neil Portnow.[236]\n\nRemoval of music [ edit ]\n\nIn November 2018, WDOK Star 102, a radio station in Cleveland, Ohio, announced they removed the song \"Baby, It's Cold Outside\" from their playlist because listeners felt that the lyrics were inappropriate.[237] The station's host commented \"in a world where #MeToo has finally given women the voice they deserve, the song has no place\".[238] The streaming service Spotify removed music by XXXTentacion and R. Kelly from Spotify-curated playlists after allegations of \"hateful conduct\",[211][239] but later reversed course because the allegations against the artists were unproven.[240]\n\nSocial justice and journalism [ edit ]\n\nSarah Lyons wrote \"Hands Off Pants On\", in which she explained the importance of allowing an open space for victims of sexual assault in the work place to heal.[241] Sarah Jaffe analyzed the issues facing victims who follow through with police departments and the court system.[242]\n\nMilitary [ edit ]\n\nIn the wake of #MeToo, #MeTooMilitary came to be used by service men and women who were sexually assaulted or harassed while in the military,[243] appearing on social media in January 2018 the day after remarks by Oprah Winfrey at the Golden Globe Awards honoring female soldiers in the military \"whose names we'll never know\" who have suffered sexual assault and abuse to make things better for women today.[244]\n\nA report from the Pentagon indicated that 15,000 members of the military reported being sexually assaulted in the year 2016 and only 1 out of 3 people assaulted actually made a report.[245] Veteran Nichole Bowen-Crawford has said the rates have improved over the last decade, but the military still has a long way to go, and recommends that women veterans connect privately on social media to discuss sexual abuse in a safe environment.[244][246]\n\nThere was a \"#MeTooMilitary Stand Down\" protest, organized by Service Women's Action Network, which gathered at the Pentagon on January 8, 2018. The protest was endorsed by the U.S. Department of Defense, who stated that current service members were welcome to attend as long as they did not wear their uniform.[247][248][249] The protest supported the Military Justice Improvement Act, sponsored by Senator Kirsten Gillibrand, which would move \"the decision over whether to prosecute serious [sex] crimes to independent, trained, professional military prosecutors, while leaving uniquely military crimes within the chain of command\".[248]\n\nPornography [ edit ]\n\nThere have been discussions about how pornography is related to the emergence of the #MeToo movement, and what changes, if any, should be made to the porn industry in response.[250][251] The deaths of five female porn actresses during the first three months of 2018 inspired demands that workers in the industry be included as part of the #MeToo movement.[252] It has been pointed out that many women and men have been sexually assaulted on set.[253] Some high-profile pornographic performers have been accused of assault since the emergence of #MeToo, including James Deen and Ron Jeremy.[252][254][255] The porn industry has overall been publicly supportive of #MeToo, with the topics of harassment and bodily autonomy being addressed at the 2018 AVN Awards.[256] There have been calls for the industry to police itself better in the wake of #MeToo.[253] However, when gay actor Tegan Zayne accused fellow actor Topher DiMaggio of rape in a #MeToo post, and four other men came forward with their own allegations of sexual misconduct against DiMaggio, very little happened and there was no official investigation.[257]\n\nSeveral groups of Christians, conservative women, and radical feminists have argued that #MeToo demonstrates pornography causes women to be viewed as sexual objects and contributes to the prevalence of sexual harassment. As a result, these groups believe the production and consumption of pornography should be greatly restricted or made illegal.[250]\n\nOthers have pointed out that porn consumption in the U.S. is ballooning while rates of sexual violence and rape have been falling since the anti-pornography movement in the U.S. first emerged during the 1960s.[250] Additionally, some commenters have stated that laws which make pornography illegal only further restrict women's bodily autonomy.[250]\n\nLucia Graves stated in The Guardian that pornography can be empowering or enjoyable for women and depicting female sexuality is not always objectification.[250][258] Award-winning porn actress and director Angela White says there is a \"large positive shift within the industry\" to more women directing and producing their own content and \"to represent women as powerful sexual beings.\"[252] Anti-porn activist Melissa Farley has said this ignores the \"choicelessness\" faced by many actresses in porn.[250] Liberal advocates argue that anti-pornography movements in the U.S. have historically never tried to increase choices for vulnerable adult performers, and taking away a person's right to act in porn may hurt them economically by reducing their choices. Many adult performers have stated that the social stigma surrounding their type of work is already a major barrier to seeking help, and making porn illegal would leave them few options if they are suffering from sexual abuse.[252]\n\nAs a result of #MeToo, many adult performers, sex worker advocates and feminists have called for greater protections for pornographic actresses, for example reducing social stigmas, mandating training courses that teach performers their rights, and providing access to independent hotlines where performers can report abuse. They argue that making porn illegal would only cause the production of porn to go underground where there are even fewer options for help. Some liberal activists have argued to compromise by raising the legal age of entry into adult entertainment from 18 to 21, which would prevent some of the most vulnerable women from being taken advantage of, while allowing adult women to still do what they want with their own bodies.[252]\n\nSome have pointed out that many young people who do not receive a sex education adopt ideas about sex and sexual roles from pornography, whose fantasy depictions of those behaviors are not accurate to life, as they are designed for purposes of adult entertainment, and not educating the public on the reality of sexual behavior.[259] Some areas of the United States teach birth-control methods only by abstinence from sex. In a 2015 article for the American Journal of Nursing David Carter noted that a study found that abstinence-based education was \"correlated with increases in teenage pregnancies and births\". Multiple people have voiced support for comprehensive sex education programs that encompass a wide range topics, which they state leave children more informed.[260] Several feminists have argued it is crucial to provide children with basic sex education before they are inevitably exposed to porn. Sex education can also effectively prepare children to identify and say no to unwanted sexual contact before it occurs, and gives parents an opportunity to teach children about consent.[261]\n\nAnimal advocacy [ edit ]\n\nThe #MeToo movement has had an impact on the field of animal advocacy. For instance, on January 30, 2018, Politico published an article titled, \"Female Employees Allege Culture of Sexual Harassment at Humane Society: Two senior officials, including the CEO, have been investigated for incidents dating back over a decade.\"[262] The article concerned allegations against then-Humane Society of the United States CEO Wayne Pacelle and animal protection activist Paul Shapiro.[262] Mr. Pacelle soon resigned.[263] Mr. Shapiro also soon left the Humane Society of the United States.[264] Both men have nonetheless continued to hold leadership positions either in, or adjacent to, the animal protection movement.[265][266]\n\nAstronomy [ edit ]\n\nThe #astroSH Twitter tag was used to discuss sexual harassment in the field of Astronomy, and several scientists and professors resigned or were fired.[267][268][269][270]\n\nFinancial support [ edit ]\n\nIn May 2018, The New York Women's Foundation announced their Fund to Support the Me Too Movement and Allies, a $25 million commitment over the next five years to provide funding and support survivors of sexual violence.[271]\n\nIn September 2018, CBS announced that it would be donating $20 million of former Chairman Les Moonves' severance to #MeToo. Moonves was forced to step down after numerous sexual misconduct accusations.[272][273]\n\nInternational response [ edit ]\n\n[274] Czech MP Dominik Feri resigned his mandate following accusations of sexual assault.\n\nThe hashtag has trended in at least 85 countries.[275] Direct translations of #MeToo have been shared by Spanish speakers in South America and Europe and by Arabic speakers in Africa and the Middle East, while activists in France and Italy have developed hashtags to express the attitudes of the movement.[276] Communicating similar experiences and \"sharing feelings in some form of togetherness\" connects people and can lead to \"formation of a process of collective action\" (Castells).[277][278] The campaign has prompted survivors from around the world to share their stories, and name their perpetrators. The European Parliament convened a session directly in response to the Me Too campaign, after it gave rise to allegations of abuse in Parliament and in the European Union's offices in Brussels. Cecilia Malmström, the European Commissioner for Trade, specifically cited the hashtag as the reason the meeting had been convened.[279]\n\nThe related hashtag #HimToo emerged in popularity with the #MeToo movement. Although dating back to at least 2015, and initially associated with politics or casual communication, #HimToo took on new meanings associated with #MeToo in 2017, with some using it to emphasize male victims of sexual harassment and abuse, and others using it to emphasize male perpetrators. In September and October 2018, during the sexual assault allegations raised during Brett Kavanaugh's nomination to the U.S. Supreme Court, #HimToo became used by supporters of Kavanaugh and to highlight male victims of false accusations.[280][281]\n\nCriticism [ edit ]\n\nFalse accusations [ edit ]\n\nThere has been discussion about the extent to which accusers should be believed before fact-checking. Some have questioned whether the accused are being punished without any due process establishing their guilt.[282][283][284]\n\nMany commentators have responded that the number of false reports make up a small percentage of total reports, citing figures obtained by the U.S. Department of Justice and other organizations that have generally found that around 2-10% of rape and sexual assault allegations reported to police are determined to be false after a thorough investigation. However, the 2–10% does not include cases in which it cannot be established if the accused is innocent or guilty, nor does it include allegations that are never reported to law enforcement.[39][40]\n\nA February 2005 study by the UK Home Office that compiled data on 2,284 reported rape cases found that from a set of 216 rape cases later found to be false, only six led to arrests and only two involved charges being filed.[285][286][287] Elle writer Jude Ellison Sady Doyle commented that another hashtag, #BelieveWomen, was not a threat to due process but a commitment to \"recognize that false allegations are less common than real ones\".[287] Jennifer Wright of Harper's Bazaar proposed a similar definition of #BelieveWomen and pointed out The Washington Post's ability to quickly identify a false accusation set up by Project Veritas. She also stated that only 52 rape convictions being overturned in the United States since 1989, as opposed to 790 for murder, was strong evidence that at least 90% of rape allegations are true.[286][288] Michelle Malkin expressed a suspicion that many stories in the #MeToo movement would be exaggerated and accused news outlets of focusing on \"hashtag trends spread by celebrities, anonymous claimants and bots\".[289]\n\nOn November 30, 2017, Ijeoma Oluo revealed the contents of a request she received from USA Today, asking her to write a piece arguing that due process is unnecessary for sexual harassment allegations. She refused, saying \"of course I believe in due process\" and wrote that it was disingenuous for the paper to ask her \"to be their strawman\".[290]\n\nDuring their 2001 divorce, model Donya Fiorentino accused actor Gary Oldman of perpetrating a domestic assault—something he maintains never took place.[291] Following an extended investigation, Oldman was cleared of wrongdoing and awarded sole legal and physical child custody;[292][293] Fiorentino received limited, state-supervised contact dependent on her passing drug and alcohol tests.[292][294] In early 2018, however, Fiorentino was granted media interviews in which to revive the assault allegation while referring to the MeToo movement.[291][292] Her commentary coincided with Oldman's Best Actor win at the 90th Academy Awards (for his performance in 2017's Darkest Hour), which was condemned by Twitter users and described by reporters as \"disappointing\",[295] \"a referendum on the structure of Hollywood\",[296] and indicative of \"how much Hollywood really cares about purging the industry's toxic men\".[297] Fiorentino and Oldman's son, Gulliver, lambasted \"so-called 'journalists'\" for perpetuating a claim that was \"discredited as false years ago\". He expressed trepidation about defending an accused male in the face of MeToo, saying, \"I can see how coming out with a statement to combat an allegation must look. However, I was there at the time of the 'incident'.\"[298] Oldman's representative pointed to the 2001 courtroom outcome, accused Fiorentino of using MeToo as \"convenient cover to further a personal vendetta\", and requested that the press not allow the movement to be \"misused as an instrument of harm to decent people by people with very bad intentions\".[291][299]\n\nOn September 21, 2018, President Donald Trump accused Dr. Christine Blasey Ford of making up her accusations against now Associate Justice of the Supreme Court, Brett Kavanaugh, saying that if her story was true she would have filed a report against him when it had happened. This is a common argument against the MeToo movement and alleged sexual assault victims alike.[300] On October 11, 2018, First Lady Melania Trump said that women who make accusations of sexual abuse against men should back their claims with solid evidence.[301]\n\nUndefined purpose [ edit ]\n\nThere has been discussion about whether the movement is meant to inspire change in all men or just a percentage of them, and what specific actions are the end goal of the movement.[302] Other women have stated #MeToo should examine only the worst types of abuse in order to prevent casting all men as perpetrators, or causing people to become numb to the problem.[282][302]\n\nCreator Tarana Burke has laid out specific goals for the #MeToo movement, including: processing all untested rape kits in the United States, investigating the vetting of teachers, better protecting children at school, updating sexual harassment policies, and improving training in workplaces, places of worship, and schools. She has stated that everyone in a community, including men and women, must act to make the #MeToo movement a success. She also supports the #MeToo Congress bill and hopes it will inspire similar legal changes in other parts of the country.[23]\n\nSamantha Geimer, the victim of rape by film director Roman Polanski, said that \"when it's used as a weapon to attack famous people or harm and demonize certain people I don't think that's ever what #MeToo was meant for and it's become kind of toxic and lost its value\".[303]\n\nOvercorrection [ edit ]\n\nRichard Ackland described the response to defamation cases \"an asphyxiating vortex of litigation\".[304]\n\nThere has been discussion on whether harsh consequences are warranted for particular examples of alleged misconduct.[282][283][284] An especially divisive story broke on Babe.net on January 13, 2018, when an anonymous accuser detailed the events of her date with Aziz Ansari and referred to what transpired as \"sexual assault\". Jill Filipovic wrote for The Guardian that \"it was only a matter of time before a publication did us the disservice of publishing a sensational story of a badly behaved man who was nonetheless not a sexual assailant\".[305][306][307] James Hamblin wrote for The Atlantic that, instead, these \"stories of gray areas are exactly what [...] need to be told and discussed.\"[308]\n\nSome actors have admonished proponents of the movement for not distinguishing between different degrees of sexual misconduct. Matt Damon commented on the phenomenon in an interview, and later apologized, saying \"the clearer signal to men and to younger people is, deny it. Because if you take responsibility for what you did, your life's going to get ruined.\"[309] Subsequently, Liam Neeson opined that some accused men, including Garrison Keillor and Dustin Hoffman, had been treated unfairly.[21]\n\nTarana Burke said in January 2018, \"Those of us who do this work know that backlash is inevitable.\" While describing the backlash as carrying an underlying sentiment of fairness, she defended her movement as \"not a witch hunt as people try to paint it\". She stated that engaging with the cultural critique in #MeToo was more productive than calling for it to end or focusing on accused men who \"haven't actually touched anybody\".[20] Ronan Farrow, who published the Weinstein exposé in the New Yorker that helped start the #MeToo resurgence (alongside New York Times reporters Megan Twohey and Jodi Kantor), was asked in late December 2017 whether he thought the movement had \"gone too far\". Farrow called for a careful examination of each story to guard against false accusations but also recalled the alleged sexual abuse his sister Dylan Farrow claims she went through at the hands of his father Woody Allen. He stated that after decades of silence, \"My feeling is that this is a net benefit to society and that all of the people, men, and women, pouring forward and saying 'me too' deserve this moment. I think you're right to say that we all have to be conscious of the risk of the pendulum swinging too far, but in general this is a very positive step.\"[22]\n\nIjeoma Oluo spoke about how some Democrats have expressed regret over the resignation of Senator Al Franken due to allegations of sexual misconduct. She sympathized with them but stressed the importance of punishing misconduct regardless of whether the perpetrator is viewed as \"a bad guy\" overall. She wrote that \"most abusers are more like Al Franken than Harvey Weinstein\".[310] The New York Times has called this discussion the \"Louis C.K. Conundrum\", referring to the admission by comedian Louis C.K. that he committed sexual misconduct with five women, and the subsequent debate over whether any guilt should be associated with enjoyment of his work.[311][312][313] Jennifer Wright of Harper's Bazaar has said that public fears of an overcorrection reflect the difficulty of accepting that \"likeable men can abuse women too\".[288]\n\nA 2019 LeanIn.Org/SurveyMonkey survey showed that 60 percent of male managers reported being \"too nervous\" of being accused of harassment when mentoring, socializing, or having one-on-one meetings with women in the workplace.[314][315] A 2019 study in the journal Organizational Dynamics, published by Elsevier, found that men are significantly more reluctant to interact with their female colleagues. Examples include 27 percent of men avoid one-on-one meetings with female co-workers, 21 percent of men said they would be reluctant to hire women for a job that would require close interaction (such as business travel), and 19 percent of men being reluctant to hire an attractive woman.[316][317]\n\nPossible trauma to victims [ edit ]\n\nThe hashtag has been criticized for putting the responsibility of publicizing sexual harassment and abuse on those who experienced it, which could be re-traumatizing.[318][319][320] The hashtag has been criticized as inspiring fatigue and outrage, rather than emotionally dense communication.[321][322]\n\nTony Robbins said he was \"knocking victimhood\" from the movement.[323] The motivational speaker was also scrutinized for comments he made criticizing the movement, implying that women are victimizing themselves to gain significance. He later apologized adding, \"I need to get connected to the brave women of #MeToo.\"[324] Robbins was later accused of inappropriate sexual advances, and molesting an underage girl.[325]\n\nExclusion of sex workers [ edit ]\n\nThere have been many calls for the #MeToo movement to include sex workers and sex trafficking victims.[326][327][328][329] Although these women experience a higher rate of sexual harassment and assault than any other group of people, they are often seen in society as legitimate targets that deserve such acts against them.[330] Autumn Burris stated that prostitution is like \"#MeToo on steroids\" because the sexual harassment and assault described in #MeToo stories are frequent for women in prostitution.[326] Melissa Farley argues that prostitution, even when consensual, can be a form of sexual assault, as it can be for money for food or similar items, thus, at least according to Farley, making prostitution a forced lifestyle relying on coercions for food.[330] Many sex workers disagree with her stance, saying that she stigmatizes prostitution.[331]\n\nAmerican journalist Steven Thrasher noted that, \"There has been worry that the #MeToo movement could lead to a sex panic. But the real sex panic is not due to feminism run amok, but due to the patriarchal, homophobic, transantagonistic, theocratic desire of the US Congress to control sex workers.\" He points to the 2018 Stop Enabling Sex Traffickers Act (SESTA), which many experts say will only put sex workers at further risk by causing them to go underground, does not offer sex workers any help or protections, and as a side effect prevents most people from using online personal ads regardless of their intentions.[332]\n\nBritish filmmaker Bizhan Tong, a figure involved in various gender equality initiatives, wrote, directed, and self-funded the feature film The Escort[333] after conducting a series of interviews with current and former sex workers in a direct attempt to lend a platform for their voices to be heard.[334] The film was shot in 2017 and completed in 2018, premiered in New York in August that year, and received several awards across the globe.[335] It is currently being adapted for the stage.\n\nFailure to address police misconduct [ edit ]\n\nDespite the prevalence of sexual misconduct, some have pointed out the lack of discussion in the #MeToo movement regarding law-enforcement misconduct.[336][337][338][339]\n\nPolice sexual misconduct disproportionately affects women of color, though women from all walks of life are affected.[339] The Cato Institute reported that in 2010, more than 9% of police misconduct reports in 2010 involved sexual abuse, and there are multiple indications that \"sexual assault rates are significantly higher for police when compared to the general population.\"[337] Fear of retribution is considered[by whom?] one reason some law-enforcement officers are not subjected to significant consequences for known misconduct.[336] Police-reform activist Roger Goldman stated that an officer who is fired for sexual misconduct from one police department often gets rehired by a different department, where they can continue the misconduct in a new environment.[336] Some states (such as Florida and Georgia) have licensing laws that can decertify a law-enforcement officer who has committed major misconduct, which prevents decertified officers from being hired again in that state.[336] Some have called for sexual misconduct allegations against police to be investigated by third parties to reduce bias (as opposed to the common practice of investigations being led by fellow law-enforcement officers or colleagues in the same department).[339]\n\nLack of representation of minority women [ edit ]\n\nMany have pointed to a lack of representation of minority women in the #MeToo movement or its leadership.[340][341][342][343][344][345] Most historical feminist movements have contained active elements of racism, and have typically ignored the needs of non-white women[346] even though minority women are more likely to be targets of sexual harassment.[340][341][342][343][344]\n\nMinority women are overrepresented in industries with the greatest number of sexual harassment claims, for example hotels, health, food services, and retail.[342] It has been pointed out that undocumented minority women often have no recourse if they're experiencing sexual violence.[347] Activist Charlene Carruthers said, \"If wealthy, highly visible women in news and entertainment are sexually harassed, assaulted and raped—what do we think is happening to women in retail, food service and domestic work?\"[342]\n\nFormer victim Farah Tanis stated there are also additional barriers for black women who want to participate in the #MeToo movement. She pointed out that social pressure discourages reports against black men, especially from church and family, because many would view that as a betrayal against their \"brothers.\"[347] Additionally, black women are less likely to be believed if they do speak out.[347][348]\n\nSome have argued that the American judicial system acknowledges the term \"sexual harassment\" only because of successful sexual harassment lawsuits by three black women: Diane Williams and Paulette Barnes against the US government, and Mechelle Vinson against a bank.[349] Vinson's case of Meritor Savings Bank v. Vinson led to the unanimous 1986 Supreme Court decision that sexual harassment violates the Civil Rights Act.[341][342] Black law professor Anita Hill again brought sexual harassment to public discourse in 1991 with her testimony against Supreme Court nominee Clarence Thomas.[341][342][350]\n\nTarana Burke initially criticized the movement for ignoring the work of black women in creating dialogue addressing sexual assault. However, she did salute those who partook in the movement and credited Milano for acknowledging Burke's own similar movement.[351] As well as this, she pleaded to black women not to drop out of the movement just because the media isn't listening saying \"This is your movement, too.\"[352]\n\nAmerican feminist and journalist Gloria Steinem said there is a blind spot surrounding intersectionality between race and gender, and a major problem with today's feminists is they are not acknowledging \"that women of color in general—and especially black women—have always been more likely to be feminist than white women.\"[340] Steinem argues that #MeToo could never have happened without the work of these women, and women in the #MeToo movement have a responsibility: \"If you have more power, remember to listen as much as you talk. And if you have less power, remember to talk as much as you listen.\"[341]\n\nOveremphasis on specific cases [ edit ]\n\nThe #MeToo movement has been criticized for putting too much public focus on the consequences of specific individuals who have been accused of sexual misconduct, as opposed to discussing policies and changes to institutional norms that would help people currently experiencing sexual abuse.[353] It's been noted that although allegations surrounding high-profile public figures tend to attract the most attention, the stories of regular workers often go unacknowledged.[1] Yet to ensure meaningful change, these workers’ experiences must be at the center of any policy solutions that lawmakers pursue. Tarana Burke has voiced similar misgivings, pointing out one problematic aspect of #MeToo is \"All of this media attention is on the perpetrator. All of the conversation about fairness and due process is focused on the perpetrator.\" She states the movement should focus on specific steps to help current and future sufferers.[354] Activist and writer Jaclyn Friedman said, \"We’ve got to stop treating each case that comes to light like a self-contained soap opera that ends when the villain is defeated, and start addressing the systems that have enabled workplace sexual abuse for so long.\"[355] Writer Jia Tolentino has stated that it is natural to focus on the individual stories because they are \"gripping and horrible\", but determining the best workplace changes \"doesn't have a ton to do with the specific investigation and adjudication of men that have already done this\".[356]\n\nDisregard for incarcerated women [ edit ]\n\nPrisoners' rights are significantly limited, and the power imbalance between female inmates and male officers allows and promotes prison rape and other forms of abuse.[357][358][359] Many people have criticized the prison system for punishing women who act in self-defense.[360] Others criticize the main outreach of the Me Too movement for failing to address the systemic imprisonment of abused women and men.[360][361][362]\n\nNotes [ edit ]\n\n^\n\nThe omission of the #MeToo has various related local or international names.The omission of the # in this article's title is due to technical restrictions\n\nBibliography [ edit ]\n\nVogelstein, Rachel B., and Stone, Meighan. Awakening: #MeToo and the Global Fight for Women's Rights. United States, PublicAffairs, 2021.\n\nSee also [ edit ]\n\nReferences [ edit ]\n\nFurther reading [ edit ]\n\nBhattacharyya, Rituparna. \"# Metoo movement: An awareness campaign.\" International Journal of Innovation, Creativity and Change 3.4 (2018) online.\n\n3.4 (2018) online. Cantalupo, Nancy Chi, and William C. Kidder. \"Systematic prevention of a serial problem: Sexual harassment and bridging core concepts of Bakke in the# MeToo era.\" UC Davis Law Review 52 (2018): 2349+ online.\n\n52 (2018): 2349+ online. Hillstrom, Laurie Collier. The #metoo movement (ABC-CLIO, 2018) excerpt.\n\n(ABC-CLIO, 2018) excerpt. Krook, Mona Lena. \"Violence against women in politics.\" in How Gender Can Transform the Social Sciences (Palgrave Pivot, Cham, 2020) pp. 57–64.\n\n(Palgrave Pivot, Cham, 2020) pp. 57–64. Lăzăroiu, George, Zuzana Rowland, and Viera Bartosova. \"Gendered power disparities, misogynist violence, and women's oppression: the #MeToo movement against workplace sexual harassment.\" Contemporary Readings in Law and Social Justice 10.2 (2018): 57-63.\n\n10.2 (2018): 57-63. Pollack, Ester. \"Sweden and the #metoo movement.\" Interactions: Studies in Communication & Culture 10.3 (2019): 185-200. online\n\n10.3 (2019): 185-200. online Roberts, Tony, and Gauthier Marchais. \"Assessing the role of social media and digital technology in violence reporting.\" Contemporary Readings in Law & Social Justice 10.2 (2018) online.\n\n10.2 (2018) online. Tambe, Ashwini. \"Reckoning with the Silences of #MeToo.\" Feminist studies 44.1 (2018): 197-203 online.\n\n44.1 (2018): 197-203 online. Tippett, Elizabeth C. \"The legal implications of the MeToo movement.\" Minnesota Law Review 103 (2018): 229+ online.", "images": ["https://upload.wikimedia.org/wikipedia/commons/4/40/Feminism_and_Media_2.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/Tarana_Burke_from_She%27s_Revolutionary.jpg/220px-Tarana_Burke_from_She%27s_Revolutionary.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Ambox_contradict.svg/40px-Ambox_contradict.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/12px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Woman-power_emblem.svg/12px-Woman-power_emblem.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/US_Army_SHARP_Sexual_Harassment_and_Sexual_Assault_Prevention_Poster.jpg/170px-US_Army_SHARP_Sexual_Harassment_and_Sexual_Assault_Prevention_Poster.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Crystal_Clear_app_linneighborhood.svg/19px-Crystal_Clear_app_linneighborhood.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/42/Social_sciences.svg/21px-Social_sciences.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b3/Harvey_Weinstein_David_Shankbone_2010_NYC.jpg/170px-Harvey_Weinstein_David_Shankbone_2010_NYC.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Pink_Venus_symbol.svg/80px-Pink_Venus_symbol.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Teplicka_topka%2C_Dominik_Feri.jpg/170px-Teplicka_topka%2C_Dominik_Feri.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Woman-power_emblem.svg/17px-Woman-power_emblem.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/Feminism_and_Media_2.jpg/220px-Feminism_and_Media_2.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Alyssa_Milano_2%2C_2011.jpg/170px-Alyssa_Milano_2%2C_2011.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/26/Bisexuality_symbol_%28bold%2C_color%29.svg/21px-Bisexuality_symbol_%28bold%2C_color%29.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/4/40/Feminism_and_Media_2.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/MeToo_movement", "title": "MeToo movement", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/4/40/Feminism_and_Media_2.jpg", "width": 640, "height": 480}, "title": "MeToo movement - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}