{"url": "https://www.washingtonpost.com/investigations/eight-women-say-charlie-rose-sexually-harassed-them--with-nudity-groping-and-lewd-calls/2017/11/20/9b168de8-caec-11e7-8321-481fd63f174d_story.html", "text": "Charlie Rose, host of “Charlie Rose” and “CBS This Morning,” has been accused by multiple women of unwanted sexual advances. (Jenny Starrs/The Washington Post)\n\nEight women have told The Washington Post that longtime television host Charlie Rose made unwanted sexual advances toward them, including lewd phone calls, walking around naked in their presence, or groping their breasts, buttocks or genital areas.\n\nThe women were employees or aspired to work for Rose at the “Charlie Rose” show from the late 1990s to as recently as 2011. They ranged in age from 21 to 37 at the time of the alleged encounters. Rose, 75, whose show airs on PBS and Bloomberg TV, also co-hosts “CBS This Morning” and is a contributing correspondent for “60 Minutes.”\n\nThere are striking commonalities in the accounts of the women, each of whom described their interactions with Rose in multiple interviews with The Post. For all of the women, reporters interviewed friends, colleagues or family members who said the women had confided in them about aspects of the incidents. Three of the eight spoke on the record.\n\nFive of the women spoke on the condition of anonymity out of fear of Rose’s stature in the industry, his power over their careers or what they described as his volatile temper.\n\n“In my 45 years in journalism, I have prided myself on being an advocate for the careers of the women with whom I have worked,” Rose said in a statement provided to The Post. “Nevertheless, in the past few days, claims have been made about my behavior toward some former female colleagues.\n\n“It is essential that these women know I hear them and that I deeply apologize for my inappropriate behavior. I am greatly embarrassed. I have behaved insensitively at times, and I accept responsibility for that, though I do not believe that all of these allegations are accurate. I always felt that I was pursuing shared feelings, even though I now realize I was mistaken.\n\n“I have learned a great deal as a result of these events, and I hope others will too. All of us, including me, are coming to a newer and deeper recognition of the pain caused by conduct in the past, and have come to a profound new respect for women and their lives.”\n\nWithin hours of the publication of this article, PBS and Bloomberg LP immediately suspended distribution of the “Charlie Rose” show. CBS announced that it was suspending Rose as it looked into the matter.\n\nMost of the women said Rose alternated between fury and flattery in his interactions with them. Five described Rose putting his hand on their legs, sometimes their upper thigh, in what they perceived as a test to gauge their reactions. Two said that while they were working for Rose at his residences or were traveling with him on business, he emerged from the shower and walked naked in front of them. One said he groped her buttocks at a staff party.\n\nReah Bravo was an intern and then associate producer for Rose’s PBS show beginning in 2007. In interviews, she described unwanted sexual advances while working for Rose at his private waterfront estate in Bellport, N.Y., and while traveling with him in cars, in a hotel suite and on a private plane.\n\n\n\nTwo women who worked for Charlie Rose say he emerged from a shower and walked naked in front of them while they were working at his home or traveling with him for business. Above, Rose at home in Bellport, N.Y. (Ben Baker/Redux)\n\n“It has taken 10 years and a fierce moment of cultural reckoning for me to understand these moments for what they were,” she told The Post. “He was a sexual predator, and I was his victim.”\n\n[#MeToo: A movement or a moment?]\n\nKyle Godfrey-Ryan, one of Rose’s assistants in the mid-2000s, recalled at least a dozen instances where Rose walked nude in front of her while she worked in one of his New York City homes. He also repeatedly called the then-21-year-old late at night or early in the morning to describe his fantasies of her swimming naked in the Bellport pool as he watched from his bedroom, she said.\n\n“It feels branded into me, the details of it,” Godfrey-Ryan said.\n\nShe said she told Yvette Vega, Rose’s longtime executive producer, about the calls.\n\n“I explained how he inappropriately spoke to me during those times,” Godfrey-Ryan said. “She would just shrug and just say, ‘That’s just Charlie being Charlie.’ ”\n\nIn a statement to The Post, Vega said she should have done more to protect the young women on the show.\n\n“I should have stood up for them,” said Vega, 52, who has worked with Rose since the show was created in 1991. “I failed. It is crushing. I deeply regret not helping them.”\n\nGodfrey-Ryan said that when Rose learned she had confided to a mutual friend about his conduct, he fired her.\n\nMegan Creydt worked as a coordinator on the show from 2005 to 2006, overlapping with Godfrey-Ryan.\n\n“It was quite early in working there that he put his hand on my mid-thigh,” said Creydt, who agreed to be interviewed on the record to support other women who were coming forward with what she deemed to be more serious claims concerning Rose.\n\nShe said that during the incident, Rose was driving his Mini Cooper in Manhattan while she was sitting in the passenger seat.\n\n“I don’t think I said anything,” she said. “I tensed up. I didn’t move his hand off, but I pulled my legs to the other side of the car. I tried not to get in a car with him ever again. I think he was testing me out.”\n\nHer then-boyfriend confirmed to The Post that she told him the story at the time.\n\n\n\nThe informal structure of Rose’s small show — with roughly 15 employees — and the centrality of the veteran journalist’s authority on a program he owns led to uncertainty over how to respond, said the woman who felt victimized. “There wasn’t anybody to report this to if you felt uncomfortable,” one of them said. Above, Rose at a gala in New York on Oct. 30, 2017. (Mike Coppola/Getty Images for the National Committee on American Foreign Policy)\n\nIn addition to the eight women who say they were harassed, The Post spoke to about two dozen former employees who spoke on the condition of anonymity. Six said they saw what they considered to be harassment, eight said they were uncomfortable with Rose’s treatment of female employees, and 10 said they did not see or hear anything concerning.\n\n[“I am not okay”: The remarkable response from Rose’s co-host on CBS]\n\n“He was always professional with me,” said Eleonore Marchand Mueller, a former assistant of Rose’s who worked for him from 2003 to 2005. “I never witnessed any unprofessional incidents.”\n\nThe show’s small, informal structure, with roughly 15 employees, and the centrality of Rose’s authority on a program he owns led to uncertainty over how to respond, said the women who felt victimized. “There wasn’t anybody to report this to if you felt uncomfortable,” one of them said.\n\nThe employees worked for Charlie Rose Inc., and not Bloomberg LP or PBS, which said they did not provide human resources support for the show.\n\nThe environment brimmed with the young and potentially vulnerable, hungry for scarce television jobs. “There are so few jobs,” said one of the women who said Rose groped her. “You know if you don’t behave a certain way, there’s someone else behind you.”\n\nAfter eight women said that broadcaster Charlie Rose sexually harassed them, Roses's colleagues at \"CBS This Morning\" opened up about their feelings of shock and betrayal. (Jenny Starrs/The Washington Post)\n\nRose traveled frequently, jetting off to interview world leaders across the globe and splitting time between two New York City residences and homes in Bellport — on Long Island — and North Carolina. Often at his side was a rotating cast of young assistants and producers.\n\nThe young women who were hired by the show were sometimes known as “Charlie’s Angels,” two former employees said. Rose frequently gave unsolicited shoulder rubs to several of them, behavior referred to among employees as “the crusty paw,” a former employee said.\n\nRumors about Rose’s behavior have circulated for years. One of the authors of this report, Outlook contributing writer Irin Carmon, first heard and attempted to report on the allegations involving two of the women while she was a journalist at Jezebel in 2010 but was unable to confirm them. In the past several weeks in the wake of accusations against Harvey Weinstein, Carmon and Post investigative reporter Amy Brittain jointly began contacting dozens of men and women who had worked on the “Charlie Rose” show or interviewed for jobs there.\n\nA woman then in her 30s who was at the Bellport home in 2010 to discuss a job opportunity said Rose appeared before her in an untethered bathrobe, naked underneath. She said he subsequently attempted to put his hands down her pants. She said she pushed his hands away and wept throughout the encounter.\n\nA woman who began as an intern in the late 1990s and was later hired full time described a “ritual” of young women at the show being summoned by Rose to his Manhattan apartment to work at a desk there. The woman described a day when Rose went into the bathroom, left the door open and turned on the shower.\n\nShe said he began to call her name, insistently. She ignored him, she said, and continued working. Suddenly, he came out of the bathroom and stood over her. She turned her head, briefly saw skin and Rose with a towel and jerked back around to avoid the sight. She said he said, “Didn’t you hear me calling you?”\n\nShe said she told someone in the office, and word got around. A few days later, she said, a male colleague approached her, laughing, “Oh, you got the shower trick.” The woman’s sister confirmed that her sibling had told her about the shower incident soon after it occurred.\n\nAnother woman said that during her internship in the early 2000s, Rose groped her breasts and stomach as she drove him from Bellport back to Manhattan. Her then-boyfriend, now husband, confirmed that she described the incident to him immediately after it occurred. When Rose invited her to work regularly and stay overnight at Bellport, her boyfriend told her to refuse the offer, and she did, both told The Post.\n\nPrestige and fear\n\nRose’s eponymous show, with its trademark black background and round oak table, has been in production since 1991. What it lacks in mass viewership, the “Charlie Rose” show makes up for in prestige and high-profile bookings of the likes of former president Barack Obama, Oprah Winfrey and Warren Buffett. Rose’s show is produced by Charlie Rose Inc., an independent television production company, and distributed by PBS. It is filmed at Bloomberg headquarters in Manhattan.\n\nRose’s stature has only grown in recent years.\n\nCBS tapped him in 2011 to help revamp its ailing morning show, now called “CBS This Morning,” expanding his audience. He has also been a contributing correspondent for “60 Minutes” for nearly a decade. His 2013 interview of Syria’s president won Emmy and Peabody awards. (None of the women who made accusations against Rose to The Post worked for PBS or CBS.)\n\nRepresentatives from PBS, CBS and Bloomberg said they have no records of sexual harassment complaints about Charlie Rose.\n\nWhen Time magazine named Rose one of its 100 most influential people in 2014, billionaire and former New York City mayor Michael R. Bloomberg described him as “one of the most important and influential people in journalism.”\n\n\n\nRose joined “CBS This Morning” in 2011. Here, he’s seen with co-anchor Norah O’Donnell, left, and Gayle King on March 13, 2017. (Michele Crowe/CBS via Getty Images)\n\nRose, who was divorced in 1980, has long had a reputation as a ladies man. His “CBS This Morning” co-host, Norah O’Donnell, introduced him at a 2014 fundraiser dinner by joking, “We’re all here because with Charlie Rose, one woman is never enough.”\n\nRose graciously accepted honors that night by saying that he was lucky to have worked throughout his career with “women who were smarter, more thoughtful and more eloquent than I was.”\n\nThere was also less flattering coverage. The now-defunct Radar magazine in 2007 called him a “toxic bachelor” and repeated an unnamed woman’s claim that Rose had “palmed her buttock like a honeydew.” His then-attorney, David Boies, who has recently drawn criticism for his representation of Harvey Weinstein, demanded a retraction. The magazine refused.\n\nThe “Charlie Rose” show prides itself on its highbrow intellectual ambition, but his life is glamorous, full of black-tie galas and famous friends. He can be charming and generous, consulting favored employees for their opinions on what to ask heads of state or whisking them off to exotic locations for interviews. But his wrath was swift and often fiercely personal, according to interviews with multiple former employees.\n\n“Everybody is terrified of him,” said one of the women who said that Rose groped her when she was an intern. “He creates this environment of constant fear. And then he’ll shine a spotlight on you and make you feel amazing.”\n\nMultiple women said they had at first been reassured by the presence of Vega, Rose’s executive producer, who has worked with him for decades. Two women who spoke to The Post said they repeatedly reported Rose’s inappropriate sexual behavior to Vega.\n\nAfter the Harvey Weinstein scandal broke, more women and men have come forward against a growing list of well-known male figures with similar stories of harassment and assault. (Erin Patrick O'Connor,Nicki DeMarco/The Washington Post)\n\n‘His poor judgment’\n\nWorking for the “Charlie Rose” show was a longtime dream for Reah Bravo, who in 2007 was a 29-year-old graduate student studying international affairs at Columbia University. She struggled to make ends meet during her unpaid internship, accruing credit card debt and eating free cereal in the Bloomberg food court.\n\nOne day, several months into the internship, Rose offered her a side gig at his home in Bellport on Long Island.\n\n“Here is the deal: I’ll pay you $2,500 for the week plus all expenses for food, movies etc.,” he wrote to her on Aug. 9, 2007. “You will be there from Monday August 13-Friday afternoon, August 17. Your primary responsibilities are to organize and catalogue all my books and tapes and files ... It will help me a lot, be fun for you, and you will have a car all the time for whatever you need to do.”\n\nBefore she left for Bellport, Bravo said Vega told her that personal time with Rose was a key to becoming part of the team.\n\n\n\n(Obtained by The Washington Post)\n\nBravo said she took the train to Bellport, where she said Rose met her at the Ronkonkoma station and took her to a bank to withdraw money to cover her expenses. She stayed at the Bellport home for about a week, sleeping in a bedroom in the main house. Rose was gone much of the time.\n\nWhile she was there, Bravo said she received a message from a male producer. If Rose did anything “sketchy,” she said he told her, she should not hesitate to call the show’s car service to return home.\n\nLate one night, Bravo said, Rose returned home after a night out. She said she tried to hurry out of the library in the guesthouse to return to her bedroom in the main house before Rose came in, but he intercepted her. She said he insisted that they have a glass of wine at the dining room table in the main house.\n\nThen, he suggested they walk out to his dock and look at the moon, Bravo said. Once there, “he came up from behind me and he put his arms around me,” she said, remembering that she felt a mix of apprehension and confusion. “It reflected his poor judgment. How could a man of his stature and his power be doing something so inappropriate? . . . It seemed reckless.”\n\nCaught off guard, she said she did not know how to respond and endured his embrace.\n\nA day or two later, Bravo said, Rose drove her back to Manhattan. She said he began to tell her that he felt very alone in life, despite his wealth and success. He recalled a brush with death a year earlier during heart surgery in Paris and began to tear up, and she said she patted him on the shoulder to console him.\n\n“I didn’t necessarily buy it,” she said. “I thought, ‘I’ll keep my distance and I feel sorry for him.’ But I didn’t think of him as a predator at that time.”\n\nBravo soon returned to Bellport for a second trip. She was working in the guesthouse and caught a glimpse of Rose rinsing off nude in an unenclosed outdoor shower. She said she quickly averted her eyes and moved away from the window.\n\nLater, he asked if she had seen him showering, she said, and seemed disappointed when she said no. While at Bellport, Bravo said Rose repeatedly insisted that he needed to hear that she was comfortable at Bellport and how much she enjoyed it there.\n\nShe emailed him about her work ideas and also mentioned Bellport.\n\n“Have I told you how much I absolutely enjoy it out there?” she wrote him on Sept 1, 2007. “The company, the conversation, the comfort...that said I’m happy to go out there for both the remainder of this weekend AND parts of the next in an effort to finish the books faster.”\n\nThat fall, she traveled with Rose to Aspen for a conference. On Oct. 1, after the trip, Bravo wrote an email to Vega, alluding to earlier issues with Rose:\n\n“On a personal note, I know working for Charlie requires one to embrace his uniqueness and develop a professional relationship that can account for it. It’s taken a couple straight forward conversations between the two of us, but I feel I’m in a better place than previously. And that’s not to say that I was previously in a really bad place! It all might sound cryptic, but you seem to play somewhat of a motherly role for staff members and I just wanted you to know that I’m okay : )”\n\nVega responded the same day:\n\n“I have some concerns for you especially in what you are trying to tell me in this email. Please know the following about me, I have worked with Charlie for 16 years, so there is nothing that I haven’t heard or possibly experienced – and that anything you ever reveal to me would be kept in confidence from anyone and from the top down, so that you can feel comfortable in that confidence...”\n\n\n\nFrom left: Rose, “Charlie Rose” show executive producer Yvette Vega and Beth Hoppe, a PBS executive, speak at the 2013 Summer Television Critics Association tour in Beverly Hills, Calif. Two women who spoke to The Post said they repeatedly reported Rose’s inappropriate sexual behavior to Vega. In a statement, Vega says she regrets not doing more to protect the young women on the show. (Frederick M. Brown/Getty Images)\n\nToward the end of 2007, Bravo was given more responsibilities and Rose occasionally paid her for helping him prepare for interviews, speeches and conferences. Her new duties required more travel with Rose, and he frequently requested her company for working dinners, she said.\n\nRose would regularly hire drivers to take them around town. On more than one occasion, she said, he groped her in the back seat. One time, she said, he “grabbed me by my hair, holding a fist of it at the base of my scalp.” More than once, “he would grip my head tightly while talking to me. He held it so tightly that I couldn’t turn my neck in any direction. I was forced to look at him or to let him talk directly into my ear.”\n\nIn Indiana for a speaking engagement in March 2008, Rose summoned Bravo to his hotel suite to work on his speech. While she was working at a desk in the room, she said, he emerged naked from the shower and stood before a mirror where she could see him. She said she ignored him and kept working.\n\nLater, flying on a small private plane alone with Rose, she said he requested that they watch a documentary about Algeria on a portable DVD player. Suddenly, she said, Rose got out of his seat and pressed his body onto hers.\n\n“I felt at a loss. I mean, what am I going to do? We were how many feet up in the air?” she said, adding that they remained clothed. “I remember him being on top of me.”\n\nBravo said Rose’s advance was bizarre, brief and “animalistic.” Then he returned to his seat.\n\n“I felt an immense sense of shame that I had greenlighted his actions because I didn’t fight back,” she said.\n\nBravo said she locked eyes with one of the two pilots as she disembarked. She said she interpreted his expression as one of “sympathy or maybe disgust.”\n\nLater in 2008, she was hired as an associate producer but was already looking for another job. The same year, Bravo was offered a job that paid three times as much as the one at the “Charlie Rose” show. In response, Rose took her to the Spotted Pig, a well-known restaurant in Manhattan, and dangled a position as a producer in Washington. She could even live in a Georgetown residence where he sometimes stayed, she said he told her.\n\nShe said she declined.\n\n“I was leaving because I was getting away,” she said. “I would never want to live someplace where he had keys.”\n\nSince then, Bravo has worked as a corporate speechwriter and now lives in Europe with her husband and their young son.\n\nIn retrospect, Bravo said she feels shame and embarrassment about her warm correspondence with Rose.\n\n“I read old emails, and I sound so sycophantic, it makes me sick,” she said. “But it was what he wanted, it made my work easier, and to an extent, it was the same game most staff members played. Male staffers did it, too. They just weren’t feeling as pathetic about it.”\n\nLooking back, she is struck by how calculated Rose’s approach seemed.\n\n“He most definitely said, on numerous occasions, ‘I’ve never forced you to do something you didn’t want to do,’ ” she said. “He would say this forcefully and wait for my confirmation after he said this. I remember once wondering if I was being recorded.”\n\nBlurred lines\n\nKyle Godfrey-Ryan was in her early 20s and had taken time off from her college studies in the mid-2000s when a friend offered to introduce her to Charlie Rose. She was unfamiliar with his show but was soon hired to be his assistant.\n\nFrom the beginning, there was a blurring of the boundaries between Rose’s professional and private life, she said. On her first day on the job, Rose injured his foot. She tended to him as he recovered.\n\nBut soon, Godfrey-Ryan said, he began yelling at her, calling her stupid and incompetent and pathetic.\n\n“He repeatedly attacked her in front of other people,” recalled a former producer who spoke on the condition of anonymity. “He once said that because she hadn’t gotten a college degree she would never amount to anything better than his secretary.”\n\nAfter the bouts of rage, Godfrey-Ryan said, Rose would often be conciliatory.\n\n“It would usually entail some version of him also touching me,” she said. “A hand on the upper thigh. He’d give a hug but touch the side of the breast.”\n\nShe said she ignored his actions. Then he began calling her as late as midnight and as early as 6 a.m.\n\n“It would be wanting to know details of my sex life,” she said. “ ‘Who’s next to you? What do you do? Is he touching you?’ And I was like, ‘Okay, Charlie, I’ll see you tomorrow.’ I just acted like it wasn’t happening.”\n\nShe said other calls involved a “very specific, repetitive fantasy” of her disrobing at the Bellport home and swimming “back and forth in the pool in the moonlight” as he watched from his bedroom.\n\nHer boyfriend at the time, now her husband, told The Post that he was often present for these calls but said he did not know what was being discussed. The content of the calls, however, was openly discussed in the office and even joked about, according to Godfrey-Ryan and the producer who worked there at the time.\n\nGodfrey-Ryan also said Rose would repeatedly walk in front of her naked at one of his New York City residences. Her husband confirmed that she complained to him about it at the time.\n\nShe said she ignored the nudity. “He was getting more and more frustrated that I wouldn’t engage,” she said.\n\nGodfrey-Ryan said she reported the touching and the calls to Vega, but nothing happened.\n\n“She just made me feel like I was being a dramatic little girl,” Godfrey-Ryan said. She stopped reporting the behavior.\n\nGodfrey-Ryan said she eventually confided to a mutual friend outside the show about Rose, and the friend told Rose.\n\nShe said Rose fired her.\n\n“He took me out to lunch and told me how embarrassed he was, how he didn’t treat me like that,” she said. “It was really about how I got it wrong, and, obviously, I couldn’t work there anymore.”\n\nShe later went back to school at Columbia. She has since launched her own business, Tune.Studio, which uses infrasonic wave technology to treat stress and improve moods, leading to “peace and happiness.”\n\n“It makes me a little upset to see him on television,” she said. “Everything I experienced with journalism there made me not want to stay.”\n\nA job interview, then denial\n\nAnother woman gave multiple interviews to The Post about her experience with Rose but requested anonymity out of concern for her privacy.\n\nIn 2009, she was in her mid-30s, looking to break into broadcast journalism after studying politics and earning her graduate degree in Europe. While working at a cultural foundation in New York City, her boss offered to put her in touch with Charlie Rose.\n\nRose responded with interest.\n\nThe meetings that followed, she said, were unconventional: a dinner at a restaurant, late at night with Rose’s prominent friends, where he drank a lot of wine. A sudden weekend invitation to lunch continued with her tagging along as Rose shopped for furniture. When he drove her home, she said she listened in alarm as he berated a producer over the phone.\n\nThen he turned to the job applicant. “He put his hand on my knee and said, ‘Oh, I’m sorry about that,’ ” she said. “He said, ‘I hope you don’t mind, I’m from the South, we’re touchers.’ ”\n\nNo job offer came, but on June 8, 2010, Rose got back in touch, according to an email the woman provided. She was still unemployed and the job Rose described sounded ideal.\n\n“He talked about this position, which he referred to as being his intellectual partner, that I would be the executive producer for global content,” she recalled.\n\nBy now, she had been told the unorthodox interview process was standard because of Rose’s packed schedule and desire to do the hiring for all positions by himself.\n\nAs part of the process, she visited Bloomberg’s Manhattan office and also discussed the job with Rose at his apartment.\n\n“My producers come here all the time to work,” she said he told her.\n\nShe said Rose mentioned a salary of $120,000, described the job as involving frequent international travel and asked for references. Rose soon suggested they see how they traveled together by having her visit his Bellport house, she said.\n\nOn June 18, Rose sent her an email inviting her to the house that evening.\n\n“As I mentioned, I’m going to my place on long island tonight to write...and then coming back tomorrow for a dinner. This is to invite to visit...\n\n“You have your own wing of the house, or even a guesthouse, It’s on the water, plus Olympic pool, tennis court, plenty of movies and books and sailing and I run on the beach at sunrise and sunset...This has no influence on our dialogue about work projects.”\n\nHe added near the end of the email: “Bring someone if you like. I’m on deadline, so i will be writing all the time and will not be entertaining except breaks for exercise and meals. Let me know...before noon.”\n\n\n\n(Obtained by The Washington Post)\n\nEager to land the job, the woman agreed to travel with Rose to Bellport, which is about 60 miles from Manhattan.\n\nShe gave the following account:\n\nThat evening, after stopping for dinner and getting lost, they arrived at the house after midnight. She did not see anyone else there. Rose proposed she choose a DVD of his show that they could watch together. After the show, Rose gave her a tour of the property. The guesthouse, she noticed, was packed with clutter, uninhabitable.\n\nAt the pool, Rose dangled his legs in the water and then said that he needed to change because his pant legs were wet. He returned wearing a white bathrobe, which was open; he wore nothing underneath.\n\n“I thought, I’m doomed,” she said. “I was completely panicked. In retrospect, I thought of a million things I could have done.”\n\nShe said she was not intoxicated — Rose had drunk his wine and then hers at the restaurant — but said he appeared to be. It was nearly 2 a.m. and she was exhausted, she said. She also said she felt alone and powerless. It was the middle of the night, they were on his secluded property, and she did not know how to drive.\n\n“I started talking in this feeble and compulsive way,” she said. “I started talking about power, how the abuse of power can be. He completely lost it. ‘What are you talking about? That’s certainly not the case.’ ”\n\nShe said he then tried to put a hand down her pants.\n\n“By the time he touched me the first time, he was already very angry,” she said. “I was scared, and I was also kind of frozen.”\n\nAfter that, her memory is “hazy,” she said. They ended up in his bedroom.\n\n“I really, honestly, I’ve tried so hard, especially recently, since I’ve been thinking about this, to try to remember what happened between sitting by the pool and being in his bed,” she said. “I have no recollection of how we went from here to there. I do remember I was crying the entire time.”\n\nHe reached down her pants again, she said, and she pushed his hands away. As she wept, she said, Rose asked her, “Baby, oh baby, why are you crying?”\n\nThe encounter ended when he appeared to be asleep and she felt she could leave the room, she said.\n\nThe next day, she said there was little mention of what had happened. She described the previous night to him “as a bit of a disaster” and he said, “What do you mean?”\n\nA few days later, she followed up about the job.\n\nIn retrospect, she said, “Remaining silent allowed me to continue denying what had occurred. It was in that state of denial that I wrote to him asking about the job.”\n\nHe replied with his regrets.\n\n“The whole thing was really the most humiliating and most degrading experience I’ve ever had,” the woman says now. A friend she confided in at the time described her as having been “distraught” in recounting what happened.\n\n“To have been used in the way she was left her feeling really confused and really distressed,” the friend told The Post. The friend encouraged her to write about her experience, and she chose to do so as a short story.\n\nIn one of the drafts that she shared with The Post, a tall, drawling television host named “Johnny Pose” brings a young woman to his country home on Long Island to discuss a job opportunity.\n\nThe woman said she changed some key details about what happened by the pool. And in the story, unlike in real life, she said, she viewed the host with contempt rather than fear.\n\nShe said she submitted the story to several magazine editors in 2010 and 2011. Paris Review editor Lorin Stein declined to publish the story but wrote to her in March 2011, “It has the ring of truth (alas).”\n\nThe woman titled the story, “The Hunt.”\n\nThe double entendre, she said, was intentional.\n\n“I was hunting for a job,” she told The Post, “and he was hunting for me.”\n\nJulie Tate and Alice Crites contributed to this report.", "images": ["https://img.washingtonpost.com/rf/image_60w/2010-2019/WashingtonPost/2017/11/18/Investigative/Images/868357828.jpg?uuid=UJQcBMyQEeeqllRBdZLPcg", "https://img.washingtonpost.com/rf/image_60w/2010-2019/WashingtonPost/2017/11/20/Investigative/Images/rose002.JPG?uuid=NQH9Ls4iEeeoe0fxS3MWKg", "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://www.washingtonpost.com/pb/resources/img/spacer-gray.png&w=1&h=1", "https://img.washingtonpost.com/rf/image_60w/2010-2019/WashingtonPost/2017/11/20/Investigative/Images/rose001.JPG?uuid=NCnrqs4iEeeoe0fxS3MWKg", "https://img.washingtonpost.com/rf/image_60w/2010-2019/WashingtonPost/2017/11/20/Investigative/Images/interview-tearcut.jpg?uuid=dNWeAM4jEeedOry-KvWMOg", "https://www.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2017/11/20/National-Enterprise/Images/charlie.jpg?t=20170517", "https://img.washingtonpost.com/rf/image_60w/2010-2019/WashingtonPost/2017/11/20/National-Enterprise/Images/charlie.jpg?uuid=E_wrQM4YEeeoe0fxS3MWKg", "https://img.washingtonpost.com/rf/image_60w/2010-2019/WashingtonPost/2017/11/20/Investigative/Images/reah-tearcut.jpg?uuid=dBBtTM4jEeedOry-KvWMOg"], "top_img": "https://www.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2017/11/20/National-Enterprise/Images/charlie.jpg?t=20170517", "keywords": [], "authors": ["Irin Carmon", "Amy Brittain", "Investigative Reporter", "November", "An Outlook Contributing Writer", "Is A Co-Author Of", "Amy Brittain Is A Reporter For The Washington Post'S Investigative Team. Her Coverage Has Focused On Sexual Harassment", "Criminal Justice Issues. She Was A Part Of The Team That Won The Pulitzer Prize For Coverage Of Police Shootings. Her Investigative Podcast", "Canary", "Won The Robert F. Kennedy Journalism Award"], "canonical_link": "https://www.washingtonpost.com/investigations/eight-women-say-charlie-rose-sexually-harassed-them--with-nudity-groping-and-lewd-calls/2017/11/20/9b168de8-caec-11e7-8321-481fd63f174d_story.html", "title": "Eight women say Charlie Rose sexually harassed them — with nudity, groping and lewd calls", "meta_data": {"eomportal-uuid": "9b168de8-caec-11e7-8321-481fd63f174d", "object-hash": 1665196750, "viewport": "width=device-width, initial-scale=1.0, user-scalable=yes, minimum-scale=0.5, maximum-scale=2.0", "referrer": "unsafe-url", "keywords": "Charlie rose, charlie rose sexual harassment, charlie rose show, charlie rose cbs harassment, charlie rose shower, reah bravo, kyle godfrey-ryan, yvette vega", "news_keywords": "Charlie rose, charlie rose sexual harassment, charlie rose show, charlie rose cbs harassment, charlie rose shower, reah bravo, kyle godfrey-ryan, yvette vega", "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "creator": "@amyjbrittain"}, "og": {"type": "article", "site_name": "Washington Post", "url": "https://www.washingtonpost.com/investigations/eight-women-say-charlie-rose-sexually-harassed-them--with-nudity-groping-and-lewd-calls/2017/11/20/9b168de8-caec-11e7-8321-481fd63f174d_story.html", "image": "https://www.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2017/11/20/National-Enterprise/Images/charlie.jpg?t=20170517", "title": "Eight women say Charlie Rose sexually harassed them — with nudity, groping and lewd calls", "description": "The alleged incidents took place with employees, interns and job applicants at the “Charlie Rose” show."}, "article": {"publisher": "https://www.facebook.com/washingtonpost", "content_tier": "metered", "opinion": "false"}, "fb": {"app_id": 41245586762, "admins": 500835072}, "description": "The alleged incidents took place with employees, interns and job applicants at the “Charlie Rose” show.", "robots": "index,follow", "theme": "normal"}, "movies": [], "publish_date": 1511136000.0, "source": "https://www.washingtonpost.com", "summary": ""}