{"url": "https://en.wikipedia.org/wiki/List_of_Roseanne_episodes", "text": "No.\n\noverall No. in\n\nseason Title Directed by Written by Original air date Prod.\n\ncode US viewers\n\n(millions)\n\n148 1 \"Nine Is Enough\" Gail Mancuso Story by : Rob Ulin\n\nTeleplay by : Stevie Ray Fromstein and Pat Bullard September 21, 1994 ( ) 803 28.9[165]\n\nDan is fed up having so many people living in the house and wants Becky and Mark to move out. Roseanne agrees until Becky says she and Mark are trying to get pregnant. Fred rebels against Jackie overly protecting baby Andy. After a fight, she and the baby go to Roseanne's. When everyone learns that Dan shaved his armpits (due to a cyst) Dan, embarrassed, storms off to stay with Fred. Jackie and Fred make up, and Roseanne tells Dan she has given Becky and Mark until May to move out, then announces she is pregnant.\n\n149 2 \"Two for One\" Gail Mancuso Stephen Godchaux September 28, 1994 ( ) 801 28.6[166]\n\nJackie spots Darlene's car at a motel and tells Roseanne, who thinks Darlene and David broke their abstinence promise. Roseanne is shocked that Darlene was actually at the motel with a guy named Jimmy; Darlene says that David accepts her having another relationship. When David later gives Darlene an ultimatum about Jimmy, she chooses Jimmy, and they break-up. Dan reveals his fears about having another baby to Jackie; she reassures him by saying he always reacts this way and urges him to talk to Roseanne. When Dan shares his feelings to Roseanne, she lashes out but later tells Jackie she is also scared. Jackie convinces her to confide in Dan. She tries, but ends up comforting Dan like always.\n\n150 3 \"Snoop Davey Dave\" Gail Mancuso Elaine Aronson October 5, 1994 ( ) 802 25.4[167]\n\nDavid is devastated after breaking-up with Darlene. Roseanne encourages him to move on, but to retaliate he tells Roseanne about Darlene having used drugs. Roseanne and Dan confront Darlene when she comes home, though she initially denies it; David confirms she did and feels she will again. Roseanne is furious and refuses to allow Darlene to return to college. Darlene says she was only experimenting and will never do it again, but Roseanne is adamant she stay home until realizing David's intent is to keep Darlene there for his own selfish reasons. Though she cannot fully trust Darlene, Roseanne lets her return to school.\n\n151 4 \"Girl Talk\" Gail Mancuso Miriam Trogdon October 12, 1994 ( ) 804 26.8[168]\n\nBecky and Mark are arguing constantly and Roseanne finds out from Jackie that Mark has been uninterested in sex. Jackie tells Roseanne about her own sexual problems with Fred while Roseanne confides about Dan's unusual attempts to get her in the mood. Roseanne encourages David to get out and meet girls but he is uninterested. Fred initiates an open discussion with Dan and Mark about their sex lives but all three end up knowing too much. Roseanne talks to Becky about Mark, and is surprised Becky has been confiding to David about her marital woes.\n\n152 5 \"Sleeper\" Gail Mancuso Tim Doyle October 19, 1994 ( ) 806 26.9[169]\n\nDavid considers moving out after Becky discovers he had a sex dream that she thinks it is about her. When D.J. tells Mark about it, Mark confronts David who admits the dream was about Roseanne. Roseanne is at first upset until Dan admits he had a similar dream about Bev when he and Roseanne started dating. David tells Roseanne he considers her a mother figure, and Roseanne believes the dream was about his desire for affection. Becky seems disappointed when Roseanne tells her about David, and admits she is confused about her feelings for him.\n\n153 6 \"Skeleton in the Closet\" Gail Mancuso Story by : Lois Bromfield\n\nTeleplay by : William Lucas Walker and Lawrence Broch October 26, 1994 ( ) 807 29.7[170]\n\nFred is annoyed by Leon's overly friendly attention toward him, leading Nancy and Leon to think that Fred \"doth protest too much.\" At Leon's Halloween party, when Leon's gay friends seem well acquainted with Fred, Roseanne becomes convinced that Fred is secretly gay, later getting an unexpected surprise. Roseanne thinks Bev is bald after Jackie points out a wig at Bev's hair salon that looks exactly like their mother's hair and says she fears they may go bald. All were pranks on Roseanne, but she gets the ultimate revenge.\n\n154 7 \"Follow the Son\" Gail Mancuso Dusty Kay November 2, 1994 ( ) 809 25.9[171]\n\nDarlene refuses to allow D.J. to quit his Lunch Box busboy job until he starts spilling secrets about Roseanne's lazy work habits to Leon. David starts dating again, but is upset when Mark reveals that Darlene and Jimmy may be moving in together. David goes to Chicago to spy on Darlene and Jimmy (Danny Masterson - pre/That '70s Show). He poses as a peer counselor named \"Craig\" and tells Jimmy that Darlene has serious mental health issues. Roseanne schemes to get D.J. back to the Lunch Box. Dan has since hired D.J. to work at the city garage, but Roseanne says she wanted time with her son before he gets too old and drifts away. D.J. is unhappy to return to the Lunch Box until he sees the sexy new busgirl, Staci (Traci Lords). Darlene is furious to learn that \"Craig\" is David.\n\n155 8 \"Punch and Jimmy\" Gail Mancuso David Raether November 9, 1994 ( ) 805 27.4[172]\n\nD.J, is being bullied at school and Dan offers to teach him how to fight. D.J.'s own patent fight move mostly involves falling to the ground in the fetal position. David wants Dan to teach him how to fight, but Roseanne thinks he only wants to impress Darlene, because Jimmy (Danny Masterson) is a boxer. She wants Dan to encourage David to feel good about himself, which Dan struggles with. Jackie and Roseanne head to Chicago to meet Jimmy. Roseanne dislikes Jimmy, and tells Jackie she wants David and Darlene back together. When D.J. beats up David, Dan tries to comfort David and discovers David actually was trying to bond with Dan through shared interests.\n\n156 9 \"White Men Can't Kiss\" Gail Mancuso Rob Ulin and Kevin Abbott November 16, 1994 ( ) 808 24.9[173]\n\nJackie baffled that Fred enjoys spending time in Bev's company. D.J. refuses to kiss a girl named Gina for a school play. His teacher tells Roseanne it is because Gina is black. Roseanne confronts D.J. and tells him he has to kiss her. When he refuses, Dan supports his decision. After an argument with Chuck (James Pickens, Jr.), Dan questions his own bigotry and tells D.J. he has to kiss Gina. Roseanne confronts her own bigotry when a man arrives the Lunchbox at closing time. Roseanne refuses to let him in until he identifies himself as Gina's father. He angrily confronts Roseanne, and leaves her wondering if she feared letting him in because he was a man or because he was black.\n\n157 10 \"Thanksgiving '94\" Gail Mancuso Miriam Trogdon and Lois Bromfield November 23, 1994 ( ) 810 19.1\n\nDuring the Thanksgiving feast, Roseanne receives potentially alarming news about her pregnancy that she is unable to confirm with the prenatal clinic. As she and Dan consider their options if something is wrong, friction erupts between them. Nana Mary, with a feeble new husband on her arm, upsets Bev by discussing the two abortions she had long ago.\n\n158 11 \"Maybe Baby\" Gail Mancuso Story by : Cynthia Mort\n\nTeleplay by : Matt Berry and Ed Yeager November 30, 1994 ( ) 811 25.4[174]\n\nAs Roseanne and Dan anxiously await the results about her pregnancy, D.J. steps up and offers to help with whatever is needed. The doctor calls with good news, but the celebration is dimmed by another fight.\n\n159 12 \"The Parenting Trap\" Gail Mancuso Sid Youngers December 14, 1994 ( ) 812 24.1[175]\n\nD.J.'s teacher informs Dan and Roseanne that he is having difficulties at school. They fight over who should handle the problem, causing to Dan feel Roseanne does not respect his parenting skills. Mark finally tells Dan that that D.J. has begun having erections in class and is too embarrassed to solve math problems in front of the class. Dan advises D.J. on what to do. But Roseanne is dissatisfied with his solution though her own attempt sends D.J. screaming from the room and validates Dan's parenting skills.\n\n160 13 \"Rear Window\" Gail Mancuso Michael Borkow and Danny Zuker January 4, 1995 ( ) 813 27.3[176]\n\nDan and Roseanne confront the elderly nudist couple next door about leaving their windows uncovered, but they accuse the Conners as being the perverted ones for spying on them and threaten to plant a hedge. David's coffee-time with Becky worries Mark, so he enlists Darlene's help, much to her surprise.\n\n161 14 \"My Name is Bev\" Gail Mancuso Bob Nickman January 11, 1995 ( ) 814 25.2[177]\n\nAfter being arrested for drunk-driving, Bev is forced to attend an AA meeting during which she realizes she is an alcoholic. When she shows up at Dan's Super Bowl XXIX party, Roseanne wants the guests to hide the keg. This proves catastrophic.\n\n162 15 \"Bed and Bored\" Gail Mancuso Eric Gilliland February 1, 1995 ( ) 817 22.3[178]\n\nRoseanne, tired out by her pregnancy, lies about the doctor putting her on total bedrest so everyone will wait on her. David discovers her deception, and Jackie confronts Bev about her terrible mothering.\n\n163 16 \"Sisters\" Gail Mancuso Michael Borkow February 8, 1995 ( ) 815 21.1[179]\n\nFred becomes annoyed when D.J. spends too much time hanging out at their house and wants Jackie to talk to Roseanne. Jackie confronts Roseanne about it, wanting to avoid conflict with Fred, only to walk into it with her sister. Jackie emphasizes she loves her nephew, and D.J. explains he just wants to be a big brother to baby Andy because they are the only boys. Meanwhile, Dan plans Roseanne's birthday celebration with their daughters.\n\n164 17 \"Lost Youth\" Gail Mancuso Pat Bullard and Stevie Ray Fromstein February 15, 1995 ( ) 818 22.7[180]\n\nDavid wants to date Stacy (Traci Lords), the Lunch Box bus girl, but Mark risks his marriage by putting the moves on her solely to annoy David. Jackie confronts Fred about their predictable sex life, which is just what he likes.\n\n165 18 \"Single Married Female\" Gail Mancuso Betsy Borns February 22, 1995 ( ) 819 22.4[181]\n\nJackie spends time, though not romantically, with a man Stacy dated. Dan sees them at the Lobo and confronts Jackie, saying if she does not tell Fred what she is doing, then it amounts to cheating. Jackie realizes her behavior is leading up to having an affair. She tells Fred, who already knows, and he leaves her.\n\n166 167 19 20 \"All About Rosey\" Gail Mancuso Story by : Rob Ulin and Leif Sandass\n\nTeleplay by : Rob Ulin and Perry Dance March 1, 1995 ( ) 816A 816B 20.1[182]\n\nIn the first part of this one-hour clip show special, a young Roseanne and Jackie go to a fortuneteller to learn their futures. They find Jackie taking an adult, autistic D.J. to a psychiatrist. In the second half, classic sitcom moms point the parenting finger at Rosey.\n\n168 21 \"Husbands and Wives\" Gail Mancuso Kevin Abbott March 22, 1995 ( ) 820 22.1[183]\n\nRoseanne and Dan enlist D.J.'s help to get Darlene to cut her own allowance. Fred and Jackie are back together, but their marital woes escalate.\n\n169 22 \"Happy Trailers\" Mark K. Samuels Tim Doyle and Sid Youngers March 29, 1995 ( ) 821 20.4[184]\n\nBecky and Mark move into a tacky trailer park, which Mark calls a 'mobile home community', where they are greeted by a tipsy neighbor (Sharon Stone). When Dan and Roseanne offer to help fix up the trailer, they refuse, wanting to do everything themselves.\n\n170 23 \"The Blaming of the Shrew\" Gail Mancuso Lawrence Broch May 3, 1995 ( ) 823 16.5[185]\n\nD.J.'s new girlfriend (Ashley Johnson), who Roseanne likes, bosses him around, which causes problems with their relationship at school. In an effort to save their relationship, Jackie and Fred see a marriage counselor (Ellen DeGeneres) about their anger issues.\n\n171 24 \"The Birds and the Frozen Bees\" Gail Mancuso David Forbes May 10, 1995 ( ) 822 17.4[186]\n\nWhen a girl that David likes accepts a date with him, Roseanne schemes to get him back with Darlene; the two reconcile after much poking and prodding.\n\n172 25 \"Couch Potatoes\" Mark K. Samuels Eric Gilliland May 17, 1995 ( ) 825 17.2[187]\n\nThe Conners are chosen as a Nielsen family, prompting Roseanne to only allow the family to watch PBS. Roseanne's nesting instincts disrupt the family routine. Jackie and Fred's marriage comes to an end.\n\n173 26 \"Sherwood Schwartz: A Loving Tribute\" Gail Mancuso Story by : William Lucas Walker and Allan Stephan\n\nTeleplay by : William Lucas Walker May 24, 1995 ( ) 824 16.3[188]", "images": ["https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_Roseanne_episodes", "title": "List of Roseanne episodes", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "viewport": "width=1000", "og": {"title": "List of Roseanne episodes - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}