{"url": "https://www.tvguide.com/news/svu-benson-william-lewis-last-dance-1080279/", "text": "[WARNING: This story contains major spoilers from Wednesday's Law & Order: SVU. Read at your own risk!]\n\nBreaking up is hard to do. Even with a serial rapist and cold-blooded killer like William \"The Beast\" Lewis on Law & Order: SVU.\n\n\"Every time we did an episode, it seemed to deepen so I didn't want to give it up. But on the other hand, I knew I had to,\" showrunner Warren Leight tells TVGuide.com of Wednesday's \"Last Dance\" between Benson and The Beast. \"It felt like there was one last confrontation. He's not the kind of guy who's just going to go down quietly and live in prison. That's just not in his character.\"\n\nAfter kidnapping and attacking Benson (Mariska Hargitay) in the Season 15 premiere, and subsequently being locked up in prison for his crimes, Lewis (Pablo Schreiber) managed to escape from prison for one final match with his most memorable victim after she lied about why she fractured his skull and brutally beat him with a pipe on the stand. \"William Lewis has been obsessing over it for months and he knows the truth and he knows she knows the truth,\" Leight says. \"All he wants is revenge and he wants her exposed and he wants her to go down. He knows the Achilles heel, the weak spot for her — it's what she did to him.\"\n\n15 bubble shows: Which will survive?\n\nIn the gripping episode, Lewis kidnapped a 12-year-old girl after killing her mother and sexually abusing her older sister in an attempt to lure Olivia to him. He threatened to kill the girl if Olivia didn't publicly confess to perjury and so she did just that in a televised and somber statement. \"She's been tormented by the fact that she lied under oath. I don't think that's part of her character. The initial lie came moments after she'd survived that ordeal and she got locked into it because that's how this system works,\" Leight says. \"If you think of William Lewis as her character's worst nightmare, the other thing that plagued her is she is a woman of absolute integrity who lied under oath in front of a jury.\"\n\nHowever, that public move wasn't enough for Lewis, and Olivia was forced to abandon her 24-hour protection and meet up with Lewis herself. Although he threatened to rape her as the young girl hung by her hands nearby, it was an (almost) deadly game of Russian roulette that Lewis and Benson played with a partially loaded gun that provided the most chilling moments of the hour. In the end, Lewis shot himself in the head, and his blood splash across Olivia's face as the episode cut to black. \"In the season opener, she was kidnapped and held hostage against her will. She had no choice in the matter. And in this episode, she made a conscious decision to go back for him,\" Leight says. \"There will be repercussions from that choice, but there's something very heroic about what she did and very self-aware. In the next episode, she tells her shrink, 'I knew I could die. It is what it is.' There's something almost cathartic about that.\"\n\nThere will also be major repercussions for her perjury confession in the next episode, titled \"Postmortem Blues.\" \"It will be all the ramifications for her personally and politically and professionally form this episode,\" Leight says. \"There's an I.D. investigation, there's a grand jury and she's in a box. Because now if she goes to the grand jury and says that confession was the truth, she's on the hook for brutality, perjury, excessive force, assault, and if she goes to the grand jury and says it was a lie ... then she's lying again. And that's not something I think she can handle either.\"\n\nScoop: Law & Order: SVU nabs Bradley Whitford, Ann Curry for guest roles\n\nNo matter which path she chooses, Olivia will also have to deal with a new boss. Donal Logue, who reprised his role as Lt. Declan Murphy in Wednesday's episode, will stick around for the rest of the season as the temporary new captain in the wake of Olivia's demotion. \"She basically gets stripped of her command in front of her unit by him. That is not meeting cute,\" Leight says. \"And yet, I think what we'll see evolve is they have enormous respect for each other.\"\n\nLt. Murphy will shake things up a lot as someone able to offer a rare outsider's perspective on the SVU squad — something Leight drew on from his own experience as the new showrunner on the 12-year-old series. \"Cragen was there that whole time so there was no one going, 'What the hell is going on here?'\" Leight says. \"Donal comes in fresh and he has different ways of policing and has a different take on these guys than they do.\"\n\nAlthough Olivia will have many new obstacles to overcome, the end of her battle with Lewis is something to celebrate. \"Believe it or not, I actually think that there's some closure at the end of that episode. It feels like I've been saying that about Pablo for awhile, but there is a sense of playing it through finally,\" Leight says. \"Some doors are finally closed so I think that leaves room for others.\"\n\nTV characters we used to hate\n\nCould one of those other doors open to reveal a child? Olivia's desire to have a family was reignited earlier this season when she falsely thought she was pregnant. She subsequently ended things with Cassidy (Dean Winters) when she realized he didn't share her dream of parenthood. \"Either people get stuck or they break out of their patterns and she is a smart enough woman to start breaking out and there's been enough change in her life. Elliot is gone, Cragen is gone, Munch is gone, she's had a relationship for the first time. ... She's faced down William Lewis,\" Leight says. \"Maybe she's ready to change a diaper.\"\n\nAlthough Olivia has tried, and failed, more than once in a past to care for a child, it's a very real possibility going forward. \"It would be great for her character to have a kid in her life, and is that something we can accomplish in whatever time we have left here at SVU is interesting to me,\" Leight says. \"The notion that Olivia can never be happy is probably due for a slight makeover.\"\n\nThe question of time is due to the fact that SVU has yet to be renewed. The show has enjoyed a strong season both story-wise, thanks to Benson's kidnapping and trial and Rollins' downward spiral, and in the ratings, which are up five percent from last season. \"I think the show, on the merits, should have been picked up already and deserves to be picked up,\" Leight says. \"There's that expression, 'Don't leave anything on the court,' and I don't think we did this year. We pushed as hard as we could all year long.\"\n\nHowever, Leight is cautiously optimistic about a 16th season. \"I would like to believe that things will play out and we'll get another year,\" Leight says, \"but it's a complicated business.\"\n\nLaw & Order: SVU airs Wednesdays at 9/8c on NBC. What did you think about Wednesday's episode? Will you miss \"The Beast?\"", "images": ["https://www.tvguide.com/a/img/hub/2014/04/10/c1be177c-7c6b-4456-a3a3-64a725feb5d1/140409law-order-svu1.jpg", "https://www.tvguide.com/a/img/resize/c0ffd3890bf83600effbab612ecda52ae5d8ab1d/hub/2015/01/09/b94d2b21-9eaf-4ce1-97e7-e09e25c6825b/katestanhope-6623.jpg?auto=webp&height=84&width=84"], "top_img": "https://www.tvguide.com/a/img/hub/2014/04/10/c1be177c-7c6b-4456-a3a3-64a725feb5d1/140409law-order-svu1.jpg", "keywords": [], "authors": ["Kate Stanhope", "April", "P.M. Pt"], "canonical_link": "https://www.tvguide.com/news/svu-benson-william-lewis-last-dance-1080279/", "title": "Law & Order: SVU: Benson's \"Worst Nightmare\" Is Over --- But Has the Battle Just Begun?", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"app_id": 63084645929}, "google-site-verification": "Od29UEFliEmsUY2XH0kfXxkTNucL0cv_rc0J_RPWXU4", "og": {"site_name": "TVGuide.com", "image": {"identifier": "https://www.tvguide.com/a/img/hub/2014/04/10/c1be177c-7c6b-4456-a3a3-64a725feb5d1/140409law-order-svu1.jpg", "height": 850, "width": 850}, "type": "article", "title": "Law & Order: SVU: Benson's \"Worst Nightmare\" Is Over --- But Has the Battle Just Begun?", "url": "https://www.tvguide.com/news/svu-benson-william-lewis-last-dance-1080279/"}, "twitter": {"card": "summary_large_image", "site": "@TVGuide", "image": "https://www.tvguide.com/a/img/hub/2014/04/10/c1be177c-7c6b-4456-a3a3-64a725feb5d1/140409law-order-svu1.jpg", "title": "Law & Order: SVU: Benson's \"Worst Nightmare\" Is Over --- But Has the Battle Just Begun?", "url": "https://www.tvguide.com/news/svu-benson-william-lewis-last-dance-1080279/"}, "nuxtstatus": "loaded"}, "movies": [], "publish_date": null, "source": "https://www.tvguide.com", "summary": ""}