{"url": "www.hollywoodreporter.com/news/golden-globes-2017-jenna-bush-hager-apologizes-hidden-fences-flub-962556", "text": "Jenna Bush Hager issued an apology over her Golden Globes snafu on Monday morning’s Today.\n\nThe NBC News correspondent was covering her first red carpet for the network Sunday when she found herself thrust into the viral news spotlight after interviewing Hidden Figures nominee Pharrell.\n\n“So you’re nominated for Hidden Fences,” said Bush Hager, mistakenly combining the title of his film, Hidden Figures, with the also nominated Fences, starring Viola Davis and Denzel Washington. The New York Times‘ Dave Itzkoff highlighted the moment with a video on Twitter, sparking social media to quickly comment on Pharrell’s taken-aback expression.\n\n“I had an error in the night, which I have to apologize for,” said Bush Hager, who was joined by Al Roker and Natalie Morales on the NBC morning show. “When I was interviewing the incomparable Pharrell, who I adore, I accidentally — in the electricity of the red carpet, which I’ve never done one before — called Hidden Figures ‘Hidden Fences.’ I have seen both movies, thought they were both brilliant. I’ve interviewed casts for both of the movies, and if I offended people I am deeply sorry.”\n\nLater in the night, Michael Keaton made the same notable error when presenting the best supporting actress award, sparking the term #HiddenFences to trend on Twitter. While some users posted jokes and memes, others such as Gabrielle Union and Justin Simien noted their disappointment about the confusion and comedian-actress Robin Thede said, “All movies with black people don’t sound alike.”\n\n“It was a mistake, because ya’ll know I’m not perfect,” continued Bush Hager, who at this point began to choke up and get teary-eyed. “I am authentic, but a human. And what I didn’t want to do is make anyone lesser than who they are. I apologize to both the cast, to Pharrell, but it was a mistake and I hope we can move on.”\n\nBoth Roker and Morales swooped in to defend Bush Hager, with Roker blasting the “culture of Twitter and waiting to pounce on people” for what he said is a common mistake for live TV broadcasters.\n\n“We’ve all been in live situations and you make a mistake,” said Roker, adding how he forgot Braveheart when he was interviewing Mel Gibson and referred to Jessica Biel as Jessica Alba during his Sunday interviews. “Honest mistakes happen in live television and this culture of Twitter and waiting to pounce and get on people, it’s got to stop. It’s got to stop somewhere, because it’s pretty ridiculous.”\n\nHe then chided The New York Times.\n\n“For The New York Times to pile on and repeat these tweets, it’s a cheap shot,” said Roker.\n\nBush Hager conceded that she has thick skin, but “to act as though I don’t care about people really hurt,” prompting Morales to point out the red-carpet chaos.\n\n“It’s like a mosh pit,” she said. “You’re getting celebrities coming at you from all directions. It’s a lot happening at the same time, and I think you had just interviewed the cast of Fences also, I think you were just right there in the moment, so it happens.”\n\nBut Bush Hager wouldn’t cop to the excuse and ended with more of her apology.\n\n“I know how brilliant those films are and I did not want to make anyone feel lesser,” she said.\n\nShortly after the segment aired, Hidden Figures star Octavia Spencer took to Twitter to say she accepted Bush Hager’s apology. “We all make mistakes, hon! Thanks for your apology!” she tweeted.\n\nHidden Figures co-star Janelle Monae and director Theodore Melfi ‏also accepted Bush Hager’s apology on Twitter.\n\nDearest, @octaviaspencer Your kindness means so much to me + your compassion is matched only by your incredible talent in Hidden FIGURES! X https://t.co/LkLNbREjtq — Jenna Bush Hager (@JennaBushHager) January 9, 2017\n\nThank u @JennaBushHager! Your ownership, public acknowledgement, & genuine apology makes me you more! Sending love right back your way. Xo https://t.co/QkaNpboekT — Janelle Monáe, Cindi (@JanelleMonae) January 9, 2017\n\nDear @JennaBushHager , all of us @HiddenFigures forgive you. “We all get to the peak together or we don’t get there at all.” Blessings, Ted — Theodore Melfi (@theodoremelfi) January 9, 2017\n\nLater, Pharrell himself took to Twitter to tell Bush Hager that “everyone makes mistakes.” He also joked that “Hidden Fences does sound like an intriguing movie.”\n\nDon’t worry @JennaBushHager!Everyone makes mistakes. Hidden Fences does sound like an intriguing movie though. Just saying… — Pharrell Williams (@Pharrell) January 9, 2017\n\nAlso on Monday, Hidden Figures beat out the reigning Rogue One: A Star Wars Story at the weekend box office, coming in at No. 1 with $22.8 million. Co-star Taraji P. Henson said the box-office success came in spite of people telling her, “Black women can’t open films domestically or internationally.” She added, “Well, anything is possible.”\n\nWatch Bush Hager’s apology below.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/01/jenna_bush_hager_-_getty_-_h_2017.jpg?w=1296&h=730&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/01/jenna_bush_hager_-_getty_-_h_2017.jpg?w=1024"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/01/jenna_bush_hager_-_getty_-_h_2017.jpg?w=1024", "keywords": [], "authors": ["Jackie Strause"], "canonical_link": "https://www.hollywoodreporter.com/news/general-news/golden-globes-2017-jenna-bush-hager-apologizes-hidden-fences-flub-962556/", "title": "Jenna Bush Hager Offers Teary-Eyed Apology for ‘Hidden Fences’ Flub: “I’m Not Perfect”", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Her 'Today' co-anchor Al Roker attacked the \"culture of Twitter and waiting to pounce\" on people over mistakes and called out the New York Times for its participation. \"It's a cheap shot.\"", "news_keywords": "Al Roker, Golden Globes, Golden Globes 2017, Natalie Morales, Today", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Jackie Strause", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 962556, "title": "Jenna Bush Hager Offers Teary-Eyed Apology for 'Hidden Fences' Flub: \"I'm Not Perfect\"", "published_at": "2017-01-09 06:49:30", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/01/jenna_bush_hager_-_getty_-_h_2017.jpg?w=1024", "comment_count": 0, "tags": "Today", "topics": "News", "body": "Jenna Bush Hager issued an apology over her Golden Globes snafu on Monday morning's Today.\r\nThe NBC News correspondent was covering her first red carpet for the network Sunday when she found herself thrust into the viral news spotlight after interviewing Hidden Figures nominee Pharrell.\r\n\"So you're nominated for Hidden Fences,\" said Bush Hager, mistakenly combining the title of his film, Hidden Figures, with the also nominated Fences, starring Viola Davis and Denzel Washington. The New York Times' Dave Itzkoff highlighted the moment with a video on Twitter, sparking social media to quickly comment on Pharrell's taken-aback expression.\r\n\"I had an error in the night, which I have to apologize for,\" said Bush Hager, who was joined by Al Roker and Natalie Morales on the NBC morning show. \"When I was interviewing the incomparable Pharrell, who I adore, I accidentally — in the electricity of the red carpet, which I've never done one before — called Hidden Figures 'Hidden Fences.' I have seen both movies, thought they were both brilliant. I've interviewed casts for both of the movies, and if I offended people I am deeply sorry.\"\r\nLater in the night, Michael Keaton made the same notable error when presenting the best supporting actress award, sparking the term #HiddenFences to trend on Twitter. While some users posted jokes and memes, others such as Gabrielle Union and Justin Simien noted their disappointment about the confusion and comedian-actress Robin Thede said, \"All movies with black people don't sound alike.\"\r\n\"It was a mistake, because ya'll know I'm not perfect,\" continued Bush Hager, who at this point began to choke up and get teary-eyed. \"I am authentic, but a human. And what I didn't want to do is make anyone lesser than who they are. I apologize to both the cast, to Pharrell, but it was a mistake and I hope we can move on.\"\r\n\r\nBoth Roker and Morales swooped in to defend Bush Hager, with Roker blasting the \"culture of Twitter and waiting to pounce on people\" for what he said is a common mistake for live TV broadcasters.\r\n\"We've all been in live situations and you make a mistake,\" said Roker, adding how he forgot Braveheart when he was interviewing Mel Gibson and referred to Jessica Biel as Jessica Alba during his Sunday interviews. \"Honest mistakes happen in live television and this culture of Twitter and waiting to pounce and get on people, it's got to stop. It's got to stop somewhere, because it's pretty ridiculous.\"\r\nHe then chided The New York Times.\r\n\"For The New York Times to pile on and repeat these tweets, it's a cheap shot,\" said Roker.\r\nBush Hager conceded that she has thick skin, but \"to act as though I don't care about people really hurt,\" prompting Morales to point out the red-carpet chaos. \r\n\r\n\"It's like a mosh pit,\" she said. \"You're getting celebrities coming at you from all directions. It's a lot happening at the same time, and I think you had just interviewed the cast of Fences also, I think you were just right there in the moment, so it happens.\"\r\nBut Bush Hager wouldn't cop to the excuse and ended with more of her apology.\r\n\"I know how brilliant those films are and I did not want to make anyone feel lesser,\" she said.\r\nShortly after the segment aired, Hidden Figures star Octavia Spencer took to Twitter to say she accepted Bush Hager's apology. \"We all make mistakes, hon! Thanks for your apology!\" she tweeted.\r\n\r\n\t@JennaBushHager We all make mistakes, hon! Thanks for your apology! #HiddenFigures @TODAYshow\r\n\t— octavia spencer (@octaviaspencer) January 9, 2017\r\nHidden Figures co-star Janelle Monae and director Theodore Melfi ‏also accepted Bush Hager's apology on Twitter.\r\n\r\n\tDearest, @octaviaspencer Your kindness means so much to me + your compassion is matched only by your incredible talent in Hidden FIGURES! X https://t.co/LkLNbREjtq\r\n\t— Jenna Bush Hager (@JennaBushHager) January 9, 2017\r\n\r\n\tThank u @JennaBushHager! Your ownership, public acknowledgement, & genuine apology makes me you more! Sending love right back your way. Xo https://t.co/QkaNpboekT\r\n\t— Janelle Monáe, Cindi (@JanelleMonae) January 9, 2017\r\n\r\n\tDear @JennaBushHager , all of us @HiddenFigures forgive you. \"We all get to the peak together or we don't get there at all.\" Blessings, Ted\r\n\t— Theodore Melfi (@theodoremelfi) January 9, 2017\r\nLater, Pharrell himself took to Twitter to tell Bush Hager that \"everyone makes mistakes.\" He also joked that \"Hidden Fences does sound like an intriguing movie.\"\r\n\r\n\tDon't worry @JennaBushHager!Everyone makes mistakes. Hidden Fences does sound like an intriguing movie though. Just saying...\r\n\t— Pharrell Williams (@Pharrell) January 9, 2017\r\nAlso on Monday, Hidden Figures beat out the reigning Rogue One: A Star Wars Story at the weekend box office, coming in at No. 1 with $22.8 million. Co-star Taraji P. Henson said the box-office success came in spite of people telling her, \"Black women can't open films domestically or internationally.\" She added, \"Well, anything is possible.\"\r\nWatch Bush Hager's apology below.\r\n\r\n\tWATCH: “If I offended people, I am deeply sorry. It was a mistake… I am not perfect.” @JennaBushHager on Golden Globes red carpet mistake pic.twitter.com/0dOLPHuJCO\r\n\t— TODAY (@TODAYshow) January 9, 2017", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Jenna Bush Hager Offers Teary-Eyed Apology for ‘Hidden Fences’ Flub: “I’m Not Perfect”", "url": "https://www.hollywoodreporter.com/news/general-news/golden-globes-2017-jenna-bush-hager-apologizes-hidden-fences-flub-962556/", "description": "Her ‘Today’ co-anchor Al Roker attacked the “culture of Twitter and waiting to pounce” on people over mistakes and called out the New York Times for its participation. &#822…", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/01/jenna_bush_hager_-_getty_-_h_2017.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-01-09T06:49:30+00:00", "modified_time": "2017-01-09T11:54:59+00:00"}, "twitter": {"site": "@thr", "creator": "@jackiedstrause", "card": "summary_large_image", "title": "Jenna Bush Hager Offers Teary-Eyed Apology for ‘Hidden Fences’ Flub: “I’m Not Perfect”", "description": "Her ‘Today’ co-anchor Al Roker attacked the “culture of Twitter and waiting to pounce” on people over mistakes and called out the New York Times for its participation. &#822…", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/01/jenna_bush_hager_-_getty_-_h_2017.jpg?w=1296"}}, "movies": [], "publish_date": 1483944570.0, "source": "http://www.hollywoodreporter.com", "summary": ""}