{"url": "https://www.rollingstone.com/music/music-news/kanye-wests-lift-yourself-isnt-as-bad-as-you-think-628284/", "text": "Pray for me/I’m about to hit the ‘Ye button\n\nI don’t wanna say nothin’ wrong/But it’d be wrong if I ain’t say nothin’\n\nImagine if I ain’t say somethin’/Wouldn’t none of these niggas say nothin’?\n\n—Kanye West, “Champions”\n\nIs there a such thing as bad press? This month, Kanye West – undeniably one of the most famous, successful, critic-proof hip-hop artists in history – went on what can best be described as a “negative press tour.” His baffling series of public provocations were, at best, a Gabbo-style alienation of his massive fan base. They were, at worst, a dangerous amplification and normalization of men’s rights activism and MAGA racism/sexism/xenophobia. His TMZ outburst reduced two centuries of American slavery to “fake news.”\n\nIt’s not really worth engaging in the endless fan fiction of debating whether this is performance art, a mental health breakdown, or just the gears of fame and social media grinding up another one of their loudest lights. But one thing is clear: Twitter has been an absolute Chernobyl toilet for a week. (Much thanks to Childish Gambino for wrangling everyone’s attention, at least for a little while.)\n\nThe media – perhaps correctly – has been dismissing Kanye West outright despite his reign as the most critically acclaimed artist of the 21st Century (he’s topped the Village Voice critics poll four times – a feat only Bob Dylan can match). Throughout this pea-soup-thick social media fog of outrage, Twitter dunks, memes, smhs, boycotts, thinkpieces, outreach, opportunism, concern and recalibrations, you would be forgiven if you didn’t notice that Kanye West also released two new songs. “Ye Vs. the People,” assisted by an astonishingly patient T.I., is basically a meta hall of mirrors about the entire fiasco up to that point; feel free to wade into West’s defense of indefensible politics at your own peril.\n\nHowever, the nonsensical “Lift Yourself” has been the surprising talking point. Uproxx called it a “flatulent troll job” while a Pitchfork headline said he “trolls everyone.” A Stereogum writer said he felt “[p]unk’d,” and another said it was “clearly a goof.” Consequence of Sound called it “a musical poop joke,” and Vulture gushed “Kanye West inhabits a theatre of the absurd where scatological squibs count as songs.” It’s obvious that Kanye’s new politics may not be everyone’s cup of tea, and Kendrick Lamar’s Pulitzer Championship Belt will not be threatened by lyrics like “poopy-dee scoop.” However, dismissing “Lift Yourself” as the musical version of trollface.jpg is shortsighted and ahistorical.\n\nBy any reasonable metric, the lyrics to “Lift Yourself” are complete and total jabberwocky: “Poopy-dee scoop/Scoop-diddy-whoop/Whoop-dee-scoop-dee-poop/Poop-dee-scoopty.” But immediately washing your hands of them ignores a long, proud, defiantly pop tradition of gibberish in popular music.\n\nWhere would music be without nonsense? Louis Armstrong’s epoch-making bedrock of the Hot Five Recordings are replete with scat singing in songs like 1926’s “Heebie Jeebies” and “Skid-Dat-Dee” and 1927’s “Hotter Than That.” Even the most elementary rap scholar can trace modern rhythmic swag back to the Thirties work of Cab Calloway, who would pepper his songs with bursts of zah zuh zaz and hi de hi de hi de hos. The swing and jump blues that paved the way for R&B and rock and roll was replete with koanic classics like “Hey! Ba-Ba-Re-Bop” and “Drinkin’ Wine, Spo-Dee-O-Dee.”\n\nRock’s foundational years were full of trailblazers and pop weirdos alike dropping hits like “Sh-Boom,” “Be-Bop-a-Lula,” “Splish, Splash,” “Ooby Dooby,” “Do Wah Diddy,” “Da Doo Ron Ron” and “Ob-La-Di, Ob-La-Da.” At this point, what revisionist cynic would argue against the untranscribable onomatopoeia of the Chips’ 1956 mumble doo-wop “Rubber Biscuit” or the Trashmen’s 1963 proto-punk surf-snarl classic “Surfin’ Bird,” songs that transcend novelty status to merge with the ineffable. The 2003 comp Great Googa Mooga reveals an entire alternate universe of doo-wop and R&B sides with names like “Ookey Ook,” “Oochie Patchie” and “Yacka Hoom Boom.” If you feel like making a real connection to West’s scatological scatting, you could do worse than the giddy 1960 groover “Loo-Key Doo-Key” by Floridan R&B shouter “King” Coleman. A wop bop a-lu-bop, a poopity scoop.\n\nEven rap itself is built on funky scoopity – in its very first year on record, 1979, early hip-hop label Sound of New York, U.S.A. released a holiday-themed 12-inch by a rapper named Scoopy. The very first lines of “Rapper’s Delight,” the 1979 song that introduced the art form to a national audience, started with fun disco nonsense: “I said a hip, hop, the hippie, the hippie/To the hip hip hop and you don’t stop.” The 1982 electronic quantum leap of Afrika Bambaata’s “Planet Rock” was anchored by rapper Pow Wow offering “zih zih zih zih zih zih/zih zih zih/zih-zih-zih-zih-zih- zih zih.”\n\n“Pow Wow had one section and he couldn’t remember his words,” Tommy Boy president Tom Silverman said later. “It’s on the record and it’s one of the parts everyone sings along with.”\n\nWho wants a pop landscape without Steam’s “Na Na Hey Kiss Him Goodbye” or Hanson’s “MMMBop.” Lady Gaga – who took her name, it should be said, after the highly nonsensical Queen song “Radio Gaga” – built one of the most successful pop empires on inspired nonsense like “Just Dance” (Da-da-doo-doot-n”), “Poker Face” (“Mum mum mum mah”) and Bad Romance (“Rah rah ah-ah-ah”).\n\n“God, I got flak for that one,” Sting told Q about the Police’s 1980 hit “”De Do Do Do, De Da Da Da.” “I always thought it was an articulate song about being inarticulate. … I was intrigued with why songs like that worked. Why ‘Da Doo Ron Ron,’ why ‘Doo Wah Diddy Diddy,’ why ‘Be-Bop-a-Lula,’ why ‘Tutti Frutti’ worked. I came up with the idea that they worked because they were totally innocent. They weren’t trying to tell you anything or distort your vision – it was just a sound. So in the song I try to intellectualize and analyze why that works so effectively, which is self-defeating in a way, but it was still a massive hit. Some people might think that the man who wrote ‘De Do Do Do, De Da Da Da’ is a stupid twat but … I’m living here.”\n\nSting’s theory of dedoology can be fast-forwarded to the present day, where SoundCloud rapper Lil Pump racks up massive streaming numbers repeating the aesthetically solid phrase “Gucci gang, Gucci gang, Gucci gang, Gucci gang.” While certainly not nonsense (it’s the name of his Florida-based crew), Pump does repeat it until the meaning falls apart and becomes just an irresistible sound or feel, a meme that rolls off the tongue. To wit, a popular YouTuber once said “Gucci gang” one million times to raise money for charity. Pump’s latest Top 40 hit turns the phrase “let’s get it” into the very repeatable “Eskeetit.” Again, not exactly nonsense, but the sheer pleasure to repeat it makes it feel more like Sting’s “just a sound.”\n\nWest’s “Lift Yourself” may be the first rap song from a major celebrity to truly embrace the aesthetics of SoundCloud rap, the controversial yet incredibly popular music produced by Pump, XXXTentacion, 6ix9ine, Lil Skies and more. SoundCloud rap is marked by its punkish, lo-fi, sketchpad feel, short song durations; and depressive, emo-fueled lyrics. While “Lift Yourself” is uplifting instead of moody, and it uses classic Eighties sample-chop techniques, it does mirror the movement in its lean 2-minute-28-second run time, its focus on sensation instead of bars, its minimalist production, its feeling of first-draft-best-draft, the raw way it cuts off at the end. While rooted in decades of radio gaga, West is the only multi-platinum rapper grappling with the future’s unleaded eskeetit.\n\nWest spitting a verse of nonsense even feels like a next-level boast, turning the threats of previous rappers into his own new reality. On his Number One single from 2007, New York rapper Mims bragged, “This is why I’m hot: I don’t gotta rap/I can sell a mill, saying nothing on the track.” Of course, Mims did rap throughout the song. He offered this explanation to Stereogum a decade later: “[It’s] honestly a double entendre because it says that I’m so confident that I don’t even need to say anything in order for people to receive me well, and the other half of it was about the state of hip-hop, where, you know, someone could literally have no lyrical content whatsoever and become an overnight celebrity or make millions of dollars doing it.”\n\nIs West’s nonsense also some sort of criticism about the state of hip-hop? Or did he just turn Mims’ hot line into a hot song? It’s the full realization of a threat made by Digital Underground’s “Humpty Dance”: “I’ll say a word that don’t mean nothin’, like looptid.” Or Company Flow’s El-P in 1997’s “The Fire in Which You Burn”: “Even when I say nothing it’s a beautiful use of negative space.” Or Eminem on 2004’s “Rain Man”: “And I don’t even gotta make no goddamned sense/I just did a whole song and I didn’t say shit.” Or Houston rapper Marcus Manchild on 2013’s “No Mercy”: “Okay, I need no introduction/I could hop on this and say nothin’”\n\nOr maybe rapping nonsense is just fun and cool – a feeling certainly not without precedent in hip-hop.\n\n“I invented rapping without actually using the words,” Black Thought of the Roots told Rolling Stone. “[W]ith songs like ‘Don’t Say Nuthin’,’ freestyles like ‘New Year’s At Jay Dee’s,’ I essentially invented mumble rap, where you go for many bars without saying any words. And when I did it, it came from a place of being inspired by scatting.”\n\nI like to think West is inhabiting a space between Mims’ chest-puffing critique and Black Thought’s jazz-fried artfulness. The whole “Kanye West Going Door-to-Door Sparking Thinkpieces” model right now seems like an attempt for the rapper/reality TV star to wrangle the eyes and ears of social media. The current economy makes little distinction between a passionate fan, a curious listener or a news peg. Clicks equal revenue. And it feels like Kanye West is saying he can get clicks for nothing as just as easily as he got accolades for a classic like “Can’t Tell Me Nothing.” Our curiosity is his victory. And it helps that he delivers that message with a flow that seems deeply attuned to today’s cutting edge of off-kilter, slightly off-beat flows and raw delivery.\n\nThe entire concept of “Lift Yourself” – a hugely famous figure talking loud and saying nothing – brings to mind one of the best scenes from 2001 cult flick Pootie Tang. Pootie, a national sensation who speaks entirely in nonsense words, enters the recording studio and slowly lowers the faders, stripping a track away until there’s nothing left. He dramatically opens his mouth for a John Cage-ian silence and it becomes a national hit.\n\n“Pootie don’t need no words, don’t even need no music!” shouts J.B. Smoove. “Woo!”\n\nEveryone put their own meaning to Pootie’s nothingness, which is a good metaphor for “Lift Yourself” too.", "images": ["https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "https://www.rollingstone.com/wp-content/uploads/2018/06/9048529bz-af92a049-573a-4dae-a956-1316ae2e899c.jpg?w=500&h=375&crop=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2022/assets/public/lazyload-fallback.gif", "https://www.rollingstone.com/wp-content/uploads/2018/06/9048529bz-af92a049-573a-4dae-a956-1316ae2e899c.jpg?w=1581&h=1054&crop=1"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/9048529bz-af92a049-573a-4dae-a956-1316ae2e899c.jpg?w=500&h=375&crop=1", "keywords": [], "authors": ["Christopher R. Weingarten"], "canonical_link": "https://www.rollingstone.com/music/music-news/kanye-wests-lift-yourself-isnt-as-bad-as-you-think-628284/", "title": "Kanye West: New Song ‘Lift Yourself’ Isn’t as Bad as You Think – Rolling Stone", "meta_data": {"theme-color": "#df3535", "viewport": "width=device-width, initial-scale=1.0", "description": "Hate Kanye West's politics all you want, but writing off his \"poopy-dee scoop\" moment is shortsighted.", "news_keywords": "Hip-Hop, Kanye West", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "rollingstone", "pmc-page_type": "article", "articleid": 628284, "author": "Christopher R. Weingarten", "pmc-category": "Music,Music News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-05-08T19:05:00"}, "pmc-tag": "Hip-Hop,Kanye West", "title": "Kanye West’s ‘Lift Yourself’ Isn’t as Bad as You Think", "pageclass": "article", "pmc-is_free": "no", "pmc-branded-content": "no", "pmc-evergreen": "no"}, "generator": "WordPress 6.0.2", "author": "Christopher R. Weingarten", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "RS", "application-name": "RS", "content_type": "Article", "post_id": 628284, "title": "Kanye West's 'Lift Yourself' Isn't as Bad as You Think", "published_at": "2018-05-08 19:05:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/9048529bz-af92a049-573a-4dae-a956-1316ae2e899c.jpg?w=1024", "comment_count": 0, "tags": "Kanye West", "topics": "Music News", "body": "Pray for me/I'm about to hit the 'Ye button I don't wanna say nothin' wrong/But it'd be wrong if I ain't say nothin' Imagine if I ain't say somethin'/Wouldn't none of these niggas say nothin'?—Kanye West, \"Champions\"Is there a such thing as bad press? This month, Kanye West – undeniably one of the most famous, successful, critic-proof hip-hop artists in history – went on what can best be described as a \"negative press tour.\" His baffling series of public provocations were, at best, a Gabbo-style alienation of his massive fan base. They were, at worst, a dangerous amplification and normalization of men's rights activism and MAGA racism/sexism/xenophobia. His TMZ outburst reduced two centuries of American slavery to \"fake news.\" It's not really worth engaging in the endless fan fiction of debating whether this is performance art, a mental health breakdown, or just the gears of fame and social media grinding up another one of their loudest lights. But one thing is clear: Twitter has been an absolute Chernobyl toilet for a week. (Much thanks to Childish Gambino for wrangling everyone's attention, at least for a little while.)The media – perhaps correctly – has been dismissing Kanye West outright despite his reign as the most critically acclaimed artist of the 21st Century (he's topped the Village Voice critics poll four times – a feat only Bob Dylan can match). Throughout this pea-soup-thick social media fog of outrage, Twitter dunks, memes, smhs, boycotts, thinkpieces, outreach, opportunism, concern and recalibrations, you would be forgiven if you didn't notice that Kanye West also released two new songs. \"Ye Vs. the People,\" assisted by an astonishingly patient T.I., is basically a meta hall of mirrors about the entire fiasco up to that point; feel free to wade into West's defense of indefensible politics at your own peril.However, the nonsensical \"Lift Yourself\" has been the surprising talking point. Uproxx called it a \"flatulent troll job\" while a Pitchfork headline said he \"trolls everyone.\" A Stereogum writer said he felt \"[p]unk'd,\" and another said it was \"clearly a goof.\" Consequence of Sound called it \"a musical poop joke,\" and Vulture gushed \"Kanye West inhabits a theatre of the absurd where scatological squibs count as songs.\" It's obvious that Kanye's new politics may not be everyone's cup of tea, and Kendrick Lamar's Pulitzer Championship Belt will not be threatened by lyrics like \"poopy-dee scoop.\" However, dismissing \"Lift Yourself\" as the musical version of trollface.jpg is shortsighted and ahistorical.By any reasonable metric, the lyrics to \"Lift Yourself\" are complete and total jabberwocky: \"Poopy-dee scoop/Scoop-diddy-whoop/Whoop-dee-scoop-dee-poop/Poop-dee-scoopty.\" But immediately washing your hands of them ignores a long, proud, defiantly pop tradition of gibberish in popular music.Where would music be without nonsense? Louis Armstrong's epoch-making bedrock of the Hot Five Recordings are replete with scat singing in songs like 1926's \"Heebie Jeebies\" and \"Skid-Dat-Dee\" and 1927's \"Hotter Than That.\" Even the most elementary rap scholar can trace modern rhythmic swag back to the Thirties work of Cab Calloway, who would pepper his songs with bursts of zah zuh zaz and hi de hi de hi de hos. The swing and jump blues that paved the way for R&B and rock and roll was replete with koanic classics like \"Hey! Ba-Ba-Re-Bop\" and \"Drinkin' Wine, Spo-Dee-O-Dee.\"Rock's foundational years were full of trailblazers and pop weirdos alike dropping hits like \"Sh-Boom,\" \"Be-Bop-a-Lula,\" \"Splish, Splash,\" \"Ooby Dooby,\" \"Do Wah Diddy,\" \"Da Doo Ron Ron\" and \"Ob-La-Di, Ob-La-Da.\" At this point, what revisionist cynic would argue against the untranscribable onomatopoeia of the Chips' 1956 mumble doo-wop \"Rubber Biscuit\" or the Trashmen's 1963 proto-punk surf-snarl classic \"Surfin' Bird,\" songs that transcend novelty status to merge with the ineffable. The 2003 comp Great Googa Mooga reveals an entire alternate universe of doo-wop and R&B sides with names like \"Ookey Ook,\" \"Oochie Patchie\" and \"Yacka Hoom Boom.\" If you feel like making a real connection to West's scatological scatting, you could do worse than the giddy 1960 groover \"Loo-Key Doo-Key\" by Floridan R&B shouter \"King\" Coleman. A wop bop a-lu-bop, a poopity scoop.Even rap itself is built on funky scoopity – in its very first year on record, 1979, early hip-hop label Sound of New York, U.S.A. released a holiday-themed 12-inch by a rapper named Scoopy. The very first lines of \"Rapper's Delight,\" the 1979 song that introduced the art form to a national audience, started with fun disco nonsense: \"I said a hip, hop, the hippie, the hippie/To the hip hip hop and you don't stop.\" The 1982 electronic quantum leap of Afrika Bambaata's \"Planet Rock\" was anchored by rapper Pow Wow offering \"zih zih zih zih zih zih/zih zih zih/zih-zih-zih-zih-zih- zih zih.\"\"Pow Wow had one section and he couldn't remember his words,\" Tommy Boy president Tom Silverman said later. \"It's on the record and it's one of the parts everyone sings along with.\"Who wants a pop landscape without Steam's \"Na Na Hey Kiss Him Goodbye\" or Hanson's \"MMMBop.\" Lady Gaga – who took her name, it should be said, after the highly nonsensical Queen song \"Radio Gaga\" – built one of the most successful pop empires on inspired nonsense like \"Just Dance\" (Da-da-doo-doot-n\"), \"Poker Face\" (\"Mum mum mum mah\") and Bad Romance (\"Rah rah ah-ah-ah\").\"God, I got flak for that one,\" Sting told Q about the Police's 1980 hit \"\"De Do Do Do, De Da Da Da.\" \"I always thought it was an articulate song about being inarticulate. … I was intrigued with why songs like that worked. Why 'Da Doo Ron Ron,' why 'Doo Wah Diddy Diddy,' why 'Be-Bop-a-Lula,' why 'Tutti Frutti' worked. I came up with the idea that they worked because they were totally innocent. They weren't trying to tell you anything or distort your vision – it was just a sound. So in the song I try to intellectualize and analyze why that works so effectively, which is self-defeating in a way, but it was still a massive hit. Some people might think that the man who wrote 'De Do Do Do, De Da Da Da' is a stupid twat but ... I'm living here.\"Sting's theory of dedoology can be fast-forwarded to the present day, where SoundCloud rapper Lil Pump racks up massive streaming numbers repeating the aesthetically solid phrase \"Gucci gang, Gucci gang, Gucci gang, Gucci gang.\" While certainly not nonsense (it's the name of his Florida-based crew), Pump does repeat it until the meaning falls apart and becomes just an irresistible sound or feel, a meme that rolls off the tongue. To wit, a popular YouTuber once said \"Gucci gang\" one million times to raise money for charity. Pump's latest Top 40 hit turns the phrase \"let's get it\" into the very repeatable \"Eskeetit.\" Again, not exactly nonsense, but the sheer pleasure to repeat it makes it feel more like Sting's \"just a sound.\" West's \"Lift Yourself\" may be the first rap song from a major celebrity to truly embrace the aesthetics of SoundCloud rap, the controversial yet incredibly popular music produced by Pump, XXXTentacion, 6ix9ine, Lil Skies and more. SoundCloud rap is marked by its punkish, lo-fi, sketchpad feel, short song durations; and depressive, emo-fueled lyrics. While \"Lift Yourself\" is uplifting instead of moody, and it uses classic Eighties sample-chop techniques, it does mirror the movement in its lean 2-minute-28-second run time, its focus on sensation instead of bars, its minimalist production, its feeling of first-draft-best-draft, the raw way it cuts off at the end. While rooted in decades of radio gaga, West is the only multi-platinum rapper grappling with the future's unleaded eskeetit.West spitting a verse of nonsense even feels like a next-level boast, turning the threats of previous rappers into his own new reality. On his Number One single from 2007, New York rapper Mims bragged, \"This is why I'm hot: I don't gotta rap/I can sell a mill, saying nothing on the track.\" Of course, Mims did rap throughout the song. He offered this explanation to Stereogum a decade later: \"[It's] honestly a double entendre because it says that I’m so confident that I don’t even need to say anything in order for people to receive me well, and the other half of it was about the state of hip-hop, where, you know, someone could literally have no lyrical content whatsoever and become an overnight celebrity or make millions of dollars doing it.\"Is West's nonsense also some sort of criticism about the state of hip-hop? Or did he just turn Mims' hot line into a hot song? It's the full realization of a threat made by Digital Underground's \"Humpty Dance\": \"I'll say a word that don't mean nothin', like looptid.\" Or Company Flow's El-P in 1997's \"The Fire in Which You Burn\": \"Even when I say nothing it's a beautiful use of negative space.\" Or Eminem on 2004's \"Rain Man\": \"And I don't even gotta make no goddamned sense/I just did a whole song and I didn't say shit.\" Or Houston rapper Marcus Manchild on 2013's \"No Mercy\": \"Okay, I need no introduction/I could hop on this and say nothin’\"Or maybe rapping nonsense is just fun and cool – a feeling certainly not without precedent in hip-hop.\"I invented rapping without actually using the words,\" Black Thought of the Roots told Rolling Stone. \"[W]ith songs like 'Don't Say Nuthin',' freestyles like 'New Year's At Jay Dee's,' I essentially invented mumble rap, where you go for many bars without saying any words. And when I did it, it came from a place of being inspired by scatting.\"I like to think West is inhabiting a space between Mims' chest-puffing critique and Black Thought's jazz-fried artfulness. The whole \"Kanye West Going Door-to-Door Sparking Thinkpieces\" model right now seems like an attempt for the rapper/reality TV star to wrangle the eyes and ears of social media. The current economy makes little distinction between a passionate fan, a curious listener or a news peg. Clicks equal revenue. And it feels like Kanye West is saying he can get clicks for nothing as just as easily as he got accolades for a classic like \"Can't Tell Me Nothing.\" Our curiosity is his victory. And it helps that he delivers that message with a flow that seems deeply attuned to today's cutting edge of off-kilter, slightly off-beat flows and raw delivery.The entire concept of \"Lift Yourself\" – a hugely famous figure talking loud and saying nothing – brings to mind one of the best scenes from 2001 cult flick Pootie Tang. Pootie, a national sensation who speaks entirely in nonsense words, enters the recording studio and slowly lowers the faders, stripping a track away until there's nothing left. He dramatically opens his mouth for a John Cage-ian silence and it becomes a national hit.\"Pootie don't need no words, don't even need no music!\" shouts J.B. Smoove. \"Woo!\"Everyone put their own meaning to Pootie's nothingness, which is a good metaphor for \"Lift Yourself\" too.", "fb": {"pages": 10664530778}, "onesignal": "wordpress-plugin", "og": {"type": "article", "title": "Kanye West's New Song 'Lift Yourself' Isn't as Bad as You Think", "url": "https://www.rollingstone.com/music/music-news/kanye-wests-lift-yourself-isnt-as-bad-as-you-think-628284/", "description": "Hate the rapper’s politics all you want, but writing off his “poopy-dee scoop” moment is shortsighted", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/9048529bz-af92a049-573a-4dae-a956-1316ae2e899c.jpg?w=500&h=375&crop=1", "width": 1024, "height": 681, "alt": "Kanye West's 'Lift Yourself' Isn't as Bad as You Think"}, "locale": "en_US"}, "article": {"published_time": "2018-05-08T19:05:00+00:00", "modified_time": "2018-06-25T15:28:43+00:00"}, "twitter": {"site": "@RollingStone", "card": "summary_large_image", "title": "Kanye West’s ‘Lift Yourself’ Isn’t as Bad as You Think", "description": "Hate Kanye West's politics all you want, but writing off his \"poopy-dee scoop\" moment is shortsighted.", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/9048529bz-af92a049-573a-4dae-a956-1316ae2e899c.jpg?w=1024"}, "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2022/08/cropped-Rolling-Stone-Favicon.png?w=270"}, "movies": ["https://www.youtube.com/embed/4NUTTC1QqVU"], "publish_date": 1525806300.0, "source": "https://www.rollingstone.com", "summary": ""}