{"url": "https://www.vanityfair.com/style/2012/09/kate-middletons-married-life-house-facials", "text": "On Valentine’s Day she had undertaken her first “away day”—a whistle-stop tour of the city of Liverpool, where she visited a children’s hospital. Showered with cards and bunches of red roses, Kate confided to one young fan that William had sent her a card from the Falklands and that she was missing her husband “terribly.” And on March 19 she delivered her maiden speech at the Treehouse, part of East Anglia Children’s Hospices, in Ipswich, of which she is a patron. Despite admitting to being nervous, Kate (who had elocution lessons before her wedding day) received a standing ovation for the speech she had written herself. In June she took 150 children from the Art Room charity to see a production of The Lion, the Witch and the Wardrobe in a circus tent on the grounds of Kensington Gardens. Kate is said to have loved the production and made a point of meeting the cast afterward. Also in June she put on her jeans and Wellies to join a group of children from the King Solomon Academy primary school—an inner-city school—for a camping trip to Kent. Kate spent several hours with the children, checking out their tents, teaching them how to light a campfire, and telling them what it was like to be a real-life princess: it was, she revealed, “very nice,” adding that William was “very sweet” and “spoiled” her.\n\nCharles and Camilla invited Kate to move into Clarence House while William was away, but she insisted on staying at Nottingham Cottage, on the grounds of Kensington Palace, where she and William moved after the wedding in July 2011, with just her two female protection officers for company. The two-bedroom cottage, called “Nott Cott” by residents of “K.P.,” was intended as a starter pad (there is no room for entertaining guests), but Kate has made it cozy and homey nevertheless. She tends to the flower beds in the small front-yard garden herself, and apart from the services of a part-time housekeeper there is no staff. As in Anglesey, Kate does the cooking and can be spotted stocking up at the nearby Waitrose supermarket on Kensington High Street. Within the confines of the palace, William and Kate are protected from the paparazzi, but in the heart of Kensington they are more exposed. Earlier this summer Kate was photographed playing with Lupo in Kensington Gardens, a public park next to Kensington Palace. The adorable pictures of Kate in her jeans, calling out to her dog as he chased an empty packet of potato chips in the wind, made the front pages of the newspapers the next day.\n\nDespite the intrusions, the duchess loves spending time in London—and more so than her country-oriented husband does. She uses her days in the city to catch up with friends from the Marlborough school such as Alicia Fox-Pitt and interior designer Emilia d’Erlanger, with whom she regularly lunches at the Bluebird café, on King’s Road. Whenever she is in town she heads to the Harbour Club, in Chelsea, where she has a tennis coach and plays with Pippa. She also swims in the pool at Buckingham Palace. But most of her time is taken up with work, and her days are scheduled around meetings with charities, briefings with courtiers at St. James’s Palace, and private tutorials with experts in government, the media, and the arts to help prepare her for her future role.\n\nOn weekends, William and Kate regularly host shooting parties at Wood Farm, one of the cottages at Sandringham. Kate has also taken up deerstalking when they holiday at Balmoral, much to William’s delight. But it is not just Kate who has been invited to the estate. Her parents have been regular guests at Birkhall, Charles and Camilla’s Scottish home, on the Balmoral estate, where two years ago William asked Kate’s father for her hand in marriage. Although Charles was not there at the time, he generously arranged for his gillie (hunt attendant) to act as guide for the Middletons when they went shooting and for his personal chauffeur, Tim Williams, to be on call. There are rumors that the Middletons will be invited to Birk­hall when Charles and Camilla are in residence this summer, a further signal of the growing relationship between the two families.\n\nAt William’s insistence Kate’s family has been treated very differently from royal in-laws in the past. Kate is exceptionally close to her parents, Carole and Michael, and her siblings, Pippa and James, as is William. “He is very fond of Kate’s family and wants to make sure they remain a part of their lives,” says a friend. After he returned from the Falklands, in March, William shunned a romantic reunion with Kate in favor of joining the Middletons on their annual skiing holiday to the Trois Vallées, in the French Alps. The couple often joins Kate’s family on Mustique, where they annually rent a villa for a fortnight.\n\nThe Middletons were invited to ride alongside the royal barge at the Diamond Jubilee Pageant, and for the second year running they were also guests of the Queen at Royal Ascot. Carole was photographed roaring with laughter as she chatted with the recently recovered Prince Philip (he had suffered a bladder infection following the jubilee) in the Royal Box, and once again the Middletons joined the royal carriage procession at the world-famous racecourse. It was quite unprecedented. The late mother of Captain Mark Phillips complained after his wedding to Princess Anne that she and her husband were “virtually ignored and never got invited to anything.” The Spencers are also believed to have felt like outsiders even though Diana’s father had been a former equerry to the Queen and lived on the Sandringham estate.\n\nWeeks later the Middletons were back in the Royal Box—this time at Wimbledon, where the entire family was given seats at William’s behest. On Finals Day he generously handed his ticket to his tennis-mad sister-in-law, Pippa, so that she could watch the center-court action with her sister.\n\nIt was just one of the perks Pippa has gotten used to as the sister of the future Queen. Having turned down the opportunity to be Kate’s lady-in-waiting, the 28-year-old is busily carving out a career of her own. This October she will publish her debut book, Celebrate, a party-planning bible which she has written herself and for which she reportedly received a six-figure advance from Penguin Books. After quitting her part-time job at Table Talk, a London catering company, where she worked for the past few years, to focus on the book, she has now set her sights on starting a party-planning business of her own. Like her brother, James, who opened three new businesses last year (Nice Cakes, Nice Wine, and Nice Group London), the middle Middleton sibling has inherited her mother’s entrepreneurial flair, but forging an independent career in the glare of the media spotlight has not been easy.\n\nJust weeks before the jubilee celebrations, Pippa found herself at the center of a media storm after she was photographed being driven around Paris in a convertible Audi by Romain Rabillard, a 36-year-old lawyer who pointed a fake gun at a photographer following them. The episode provoked a frenzy in the British tabloids, but Kate stood loyally by her sister. Carole, always a calm head in heated situations, advised her younger daughter to keep a low profile, and when she did re-emerge at the Diamond Jubilee Pageant she was smiling, impeccably groomed in a conservative nautical-themed navy-and-white Orla Kiely suit. It seemed all had been forgiven. Friends of the Middletons say they saw the entire episode as a “storm in a teacup,” but the incident did further Carole and Michael’s concerns that Pippa is just as high-profile as their elder daughter, yet has no full-time protection nor a publicist. When she split from Alex Loudon, her long-term boyfriend, last year, Pippa complained that she felt hunted by the paparazzi. Then, weeks later, she was photographed with her former university flatmate George Percy, the Duke of Northumberland’s son, sparking rumors that the couple were an item. When George joined the Middletons on their skiing trip in April, it appeared they were together, although Pippa has insisted that they are just friends. Those close to her say she still holds a torch for Alex, and in late June she was photographed leaving his West London home at seven a.m. after piling bags into the trunk of her BMW Z4 convertible.\n\nThe continued interest in Pippa’s private life coupled with the high price for paparazzi pictures of her is said to be one of the reasons the Middletons may be contemplating selling their $2.3 million home in Chapel Row, in Bucklebury, Berkshire—the red-brick house can be easily viewed from a public footpath that runs adjacent to the rear of the property. Carole and Michael are reported to be buying a vast, $7.2 million Georgian manor house with a tennis court, swimming pool, and 18 acres of land, which more befits their new status as royal in-laws.\n\nMeanwhile, William and Kate also have a new home they will be moving into next year. This month they receive the keys to Apartment 1A at Kensington Palace, the former residence of the Queen’s sister, Princess Margaret, and just a stone’s throw from the Kensington Palace apartments where William and Harry grew up. Kate has said she wants to oversee the interior décor, but she is expected to appoint a professional interior designer to help her redecorate the 20-room property, which needs to be entirely rewired. The refurbishment, which the Queen and the Prince of Wales will likely pay for (it is rumored to be costing upwards of $1.5 million), will be completed next year, when the couple’s private office, which also looks after Prince Harry’s engagements and comprises nine staff members, will move from Clarence House to K.P. The move is not only a sign of William and Kate’s increasing independence from William’s father but also an indication that they are preparing to become full-time working royals. With the declining health of the Duke of Edinburgh, William is fully aware that he will be expected to take on more duties alongside Charles in the near future.\n\nSince William’s R.A.F. annual salary is just $68,000, the couple has thus far been largely financed by Charles (who is also estimated to have spent $620,000 on last year’s royal wedding). In June, William became independently wealthy in his own right when he inherited $15 million from his late mother’s estate on his 30th birthday, but his inheritance is considered his private fortune. When this summer Charles published a review of his personal accounts (his private income, which is generated by his estate, the Duchy of Cornwall, rather than taxpayers’ money), it was revealed that he had spent an estimated $55,000 in the first six months of this year on designer clothes for his daughter-in-law. There were rumors that the Queen was displeased with the duchess’s expensive clothing bill, but cour­tiers dismissed the story, insisting that the duchess’s wardrobe is a worthwhile investment because of the official engagements she carries out. Explains an aide, “The cost to taxpayers really is very minimal. We think it [the duchess’s arrival] really is extraordinary value for the money.”\n\nAides point out that, due to her position, she cannot accept freebies, even though bags of designer clothes and handbags are sent to the palace daily. They are swiftly returned with a polite note from Kate’s private secretary. Kate continues to decline the services of a royal dresser, preferring instead to shop for herself. She has patriotically championed leading British couturiers such as Alexander McQueen, Alice Temperley, Matthew Williamson, and Jenny Packham. Her mother, Carole, also regularly buys frocks and accessories for Kate out of her own pocket and can often be seen snapping up designer items from Moda Rosa, a small boutique in Arlesford. Wisely, Kate follows the Queen’s example and wears her designer ensembles several times. The beautiful blush-pink Emilia Wickstead dress she wore to the royal sovereign’s lunch at Windsor Castle in May, for example, was straight off the catwalk, but it was worth the $1,800 price tag: days later Kate stepped out in the same outfit to her first garden party at Buckingham Palace, where she accessorized it with a $750 Jane Corbett hat, her trusty $290 nude L. K. Bennett shoes, and a $250 L. K. Bennett “Natalie” clutch.\n\nBut the duchess is not a designer snob. I have seen her in Topshop and T. K. Maxx, both popular retail outlets in Ken­sing­ton, where she blithely browsed the racks with other shoppers. Known as “the Kate effect,” anything she wears from these stores becomes an immediate sell-out. And she has been spotted buying designer labels from discount outlets, which has endeared her to the recession-hit British public. At discount outlet Bicester Village, near Oxford, she purchased a cut-price blue Missoni coatdress that she wore to visit the royal grocers Fortnum & Mason with the Queen and Camilla in March and again for another trip with the Queen to Nottingham two months later.\n\nOn the beauty front, Kate is surprisingly low-maintenance. She applies her own makeup (which she is never seen without) before engagements, using Bobbi Brown soft-brown eyebrow pencil on her shaped brows and gel liner for her kohl-rimmed eyes. She occasionally visits the Peter Jones department-store cosmetics counter, where she chats with the sales assistants and tries out the latest products. While she sometimes even styles her own hair, Kate has regular trims and blowouts at the Richard Ward salon in Chelsea. Before official engagements, she swears by a $250 bee-venom facial by beauty expert Deborah Mitchell, of London’s Hale Clinic, and the Heaven salon in Shropshire. The treatment—which is described as a natural alternative to Botox—was recommended to her by Camilla soon after her engagement, and Kate has been a convert ever since. She uses the Heaven Bee Venom Mask at home and is said to be delighted with the results.\n\nCurrently the couple are busy preparing for their forthcoming trip to the Commonwealth countries of Malaysia, Singapore, the Solomon Islands, and Tuvalu on behalf of the Queen in September. The itinerary has been finalized, and Kate has been brushing up on the culture and history of the places they will visit. When they return they will set about making their new house home, and the plan is to start trying for a family.\n\nBoth have spoken of their desire to have children—and it is indeed their duty to provide an heir to the throne. The issue of a royal baby seems to be on the agenda, with the Commonwealth countries voting unanimously last October to revise the succession rules so that William and Kate’s firstborn, should the child be a girl, will be Queen (and therefore not bypassed if followed by a brother). Naturally, the merest hint of a baby bump on the ever slender Kate generates worldwide excitement. Friends say the couple “hope to be blessed with a baby soon,” adding that it is with some reluctance that they have had to put their plans for a family on hold this year to focus on the Diamond Jubilee, the Olympics, and a busy schedule of work commitments that involves a huge amount of traveling. If she was pregnant, the 20-hour flight to Tuvalu would be testing for Kate, and both she and William are keen not to overshadow the Queen in her diamond year. When they return, baby-making is, as one friend describes it, “top of the agenda.”\n\nIt will be the biggest decision of their married life to date. So far they have managed to juggle their private lives with their charitable commitments and William’s military career, but William knows that he cannot be a soldier forever. As royal duties beckon for the glamorous young stars of the royal family, the future is their most exciting challenge to date.", "images": ["https://media.vanityfair.com/photos/54ca93f651062027081e57d7/16:9/w_1280,c_limit/image.jpg", "https://media.vanityfair.com/photos/631f34b3c1df471d836f1b7c/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/57d1e95850198fb52857665c/1:1/w_350%2Ch_350%2Cc_limit/kate-middleton-name-question-christopher-wahl.jpg", "https://media.vanityfair.com/photos/625d833d330189422634d876/16:9/w_748%2Cc_limit/VF0522_Royals_Camilla.jpg", "https://media.vanityfair.com/photos/6321eb5f6b745831c4993f90/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/6328d4009abfd8a85cba4488/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/62fe7ae3f9f2d6c81700a52c/1:1/w_90%2Cc_limit/A_Headshots_KatieNicholl_Revise.png", "https://media.vanityfair.com/photos/62b1dbeafa5c67611b2c4679/16:9/w_748%2Cc_limit/prince-william-40th-birthday.jpg", "https://media.vanityfair.com/photos/63370d0bb02ed9e1f657fa60/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/6328d4009abfd8a85cba4488/16:9/w_748%2Cc_limit/Oct2022-New-Royals-Opener.jpg", "https://media.vanityfair.com/photos/54ca93f651062027081e57d9/master/w_1600%2Cc_limit/image.jpg", "https://media.vanityfair.com/photos/633dac5a42c2d8adf3fa7d9c/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://www.vanityfair.com/verso/static/vanity-fair/assets/logo-header.ea437ae89b8c3c7aabbb46bb45a04f1a514e5803.svg", "https://www.vanityfair.com/verso/static/vanity-fair/assets/logo-reverse.6ef96ab8686439a35176e2ff8b2c4487e92fbaae.svg", "https://media.vanityfair.com/photos/633e045546d7fce1e25ce391/1:1/w_350%2Ch_350%2Cc_limit/undefined"], "top_img": "https://media.vanityfair.com/photos/54ca93f651062027081e57d7/16:9/w_1280,c_limit/image.jpg", "keywords": [], "authors": ["Condé Nast", "Katie Nicholl", "September", "April", "June"], "canonical_link": "https://www.vanityfair.com/style/2012/09/kate-middletons-married-life-house-facials", "title": "Inside Kate Middleton’s Domestic Life: The House, the Facials, the Roast-Chicken Recipe", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "width=device-width, initial-scale=1", "referrer": "no-referrer-when-downgrade", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2022", "description": "Just one after her wedding, the Duchess of Cambridge already seems to the palace born. That—and her impeccable fashion choices—explains why all eyes are on Kate, reports Katie Nicholl.", "id": "54cb00cf674871890b583139", "keywords": "kate middleton,magazine,archive,society,prince william,september 2012 issue", "news_keywords": "kate middleton,magazine,archive,society,prince william,september 2012 issue", "robots": "index, follow, max-image-preview:large", "content-type": "article", "parsely-post-id": "54cb00cf674871890b583139", "parsely-metadata": "{\"description\":\"Just one after her wedding, the Duchess of Cambridge already seems to the palace born. That—and her impeccable fashion choices—explains why all eyes are on Kate, reports Katie Nicholl.\",\"image-16-9\":\"https://media.vanityfair.com/photos/54ca93f651062027081e57d7/16:9/w_1000,c_limit/image.jpg\",\"image-1-1\":\"https://media.vanityfair.com/photos/54ca93f651062027081e57d7/1:1/w_1000,c_limit/image.jpg\"}", "og": {"description": "Just more than a year after her wedding, the Duchess of Cambridge already seems to the palace born. That—and her impeccable fashion choices—explains why all eyes are on Kate, reports Katie Nicholl.", "image": "https://media.vanityfair.com/photos/54ca93f651062027081e57d7/16:9/w_1280,c_limit/image.jpg", "site_name": "Vanity Fair", "title": "Inside Kate Middleton’s Domestic Life: The House, the Facials, the Roast-Chicken Recipe", "type": "article", "url": "https://www.vanityfair.com/style/2012/09/kate-middletons-married-life-house-facials"}, "article": {"content_tier": "metered", "opinion": "false", "section": "tags", "published_time": "2012-08-20T04:47:00.000Z", "modified_time": "2012-08-20T04:47:00.000Z", "author": "Katie Nicholl"}, "twitter": {"card": "summary_large_image", "creator": "@VanityFair", "description": "Just more than a year after her wedding, the Duchess of Cambridge already seems to the palace born. That—and her impeccable fashion choices—explains why all eyes are on Kate, reports Katie Nicholl.", "domain": "https://www.vanityfair.com", "image": "https://media.vanityfair.com/photos/54ca93f651062027081e57d7/16:9/w_1280,c_limit/image.jpg?mbid=social_retweet", "site": "@VanityFair", "title": "Inside Kate Middleton’s Domestic Life: The House, the Facials, the Roast-Chicken Recipe"}, "fb": {"app_id": 256281040558, "pages": 8810407571}, "google-signin-client_id": "1065629119444-svrqo31taikd2j0ji4dgjs9q3vul4133.apps.googleusercontent.com"}, "movies": [], "publish_date": 1345438020.0, "source": "https://www.vanityfair.com", "summary": ""}