{"url": "www.cnn.com/2015/11/17/health/charlie-sheen-health/index.html", "text": "Story highlights NEW: Sheen says he has had HIV for 4 years and has never missed a dose of medication Sheen, 50, is one of Hollywood's best-known actors, starring in hit films such as \"Wall Street\" and on the CBS sitcom \"Two and a Half Men\"\n\nCNN —\n\nActor Charlie Sheen told NBC’s “Today” show Tuesday that he was diagnosed as HIV-positive about four years ago, and that a few people who knew it demanded money from him to keep the secret.\n\n“I’m here to admit that I am in fact HIV-positive,” Sheen told NBC’s Matt Lauer. “And I have to put a stop to this onslaught, this barrage of attacks and of sub-truths and very harmful and mercurial stories that are about the [alleged] threatening the health of so many others, which couldn’t be farther from the truth.”\n\nSheen, 50, said he is not sure how he contracted the virus. Since his diagnosis, he said, he has informed every sexual partner of his condition. He called it “impossible” that he had transferred the virus to others.\n\nHe said the diagnosis came after he suffered a series of cluster headaches and night sweats.\n\n“After a battery of tests … they walked in the room and said, ‘Boom, here’s what’s going on,’” Sheen said.\n\n“It’s a hard three letters to absorb,” he said. “It’s a turning point in one’s life.”\n\nHe said he revealed the diagnosis to people he thought he trusted, but some of them demanded money to keep the information to themselves. He paid those people “in the millions,” he said. Later in the show, Lauer said that Sheen told him it was more than $10 million.\n\n“We’re talking about shakedowns,” Sheen said. “I’ve paid those people.”\n\nOne of those people, he said, was a prostitute who entered his bathroom, took a cellphone picture of his medication and threatened to sell the image.\n\nAsked if he would continue to pay the people he’d been paying, he said: “Not after today, I’m not.”\n\n‘Charlie does not have AIDS’\n\nSheen was joined on the show by his doctor, Robert Huizenga, an assistant professor of clinical medicine at UCLA ,and was asked directly if he had AIDS.\n\n“Charlie does not have AIDS,” Huizenga said. “AIDS is a condition where the HIV virus markedly suppresses the immune system and you are susceptible to rare, difficult cancers and infections. Charlie has none of those. He is healthy; he does not have AIDS.”\n\nHIV, or human immunodeficiency virus, attacks the immune system by destroying white blood cells, which are vital to fighting infection. Once enough of these cells have been destroyed and the person has another “opportunistic” infection like pneumonia or tuberculosis, the diagnosis moves to the final stage of the infection, called AIDS.\n\nThis won’t be the AIDS-free generation\n\nThere are two main ways HIV is spread in the United States – by sex and by sharing needles, syringes or any of the equipment used to prepare and inject drugs. Anal sex carries the highest risk, followed by vaginal sex and having multiple partners.\n\nIn the “Today” interview, Sheen denied any possibility that he got the disease via drug use. “No needles,” Sheen said. He also said he was no longer on drugs, but did continue to drink and seek the company of prostitutes.\n\nHIV discoverer: ‘To develop a cure is almost impossible’\n\nIn the past, Sheen has admitted to frequent visits to prostitutes at various times in his life. In July 1995, he testified in the tax evasion trial of “Hollywood madam” Heidi Fleiss that he had spent $53,000 in one 15-month period on “sexual services.”\n\nTwo cases of ‘unprotected sex’\n\nSheen told Lauer that he had unprotected sex “under the care of my doctor” with two women since his diagnosis, but that it was “impossible” that he had transferred the virus to them. While Huizenga did not agree that it’s “impossible,” he did say it was highly unlikely.\n\n“He was immediately put on treatment, strong antiviral drugs, which has suppressed the virus, to the point that he is absolutely healthy from that vantage,” Huizenga said. “Individuals who are optimally treated with undetectable viral loads, (the risk is) incredibly low to transmit the virus. We can’t say it’s zero, but it’s an incredibly low number.”\n\nSocial media hails Sheen after announcement\n\nStaying on daily medication is important to keep the HIV virus from developing resistance and spreading, experts said.\n\n“Resistance occurs when the virus replicates in the presence of the drugs,” said Dr. Stephen Boswell, president and CEO of Boston’s Fenway Health, a healthcare organization that works with lesbian, gay, bisexual and transgender people. “Missed dosages lead to lower concentrations in the bloodstream and in the body, so the virus can become resistant and spread. So staying on your medications and not missing dosages is absolutely critical.”\n\nHIV patients should start treatment immediately, U.N. says in new push\n\nSheen said that he was taking an antiviral “cocktail” of HIV drugs – four pills per day – and that he had not missed a day of medication, even while struggling with depression and substance abuse. Huizenga backed up his comment, saying that Sheen was undergoing lab tests every three to four months that showed the virus was at low levels.\n\n“It’s no longer a death sentence,” Boswell said of HIV. “It’s a very different time now. Most people just diagnosed with HIV will live an almost normal life span if they get an early diagnosis, appropriate care and stay on their medications.”\n\nTeenager controls HIV infection without drugs for more than 12 years\n\nUp and downs\n\nSheen is one of Hollywood’s best-known actors, starring in hit films such as “Wall Street” and on the CBS sitcom “Two and a Half Men.”\n\nSheen was fired from “Two and a Half Men” in 2011 after a public meltdown that had the actor lashing out at the show’s creator.\n\n‘Who’s the Boss?’ star Danny Pintauro reveals he’s HIV-positive\n\nAmong the more notorious points of his career, Sheen entered drug rehab twice and lived at one time with three women.\n\nHe’s also been married multiple times and has children with ex-wives Brooke Mueller and Denise Richards. His ex-wives and an older child are aware of his illness, he said in the NBC interview.\n\nA spokesman for Mueller told People magazine that she and her sons with Sheen, 6-year-old twins, do not have HIV.\n\nHis salary on “Two and a Half Men” was one of the highest on TV at the time, at $1.25 million per episode in 2010.", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/130118215738-charlie-sheen-getty.jpg?q=x_0,y_299,h_1687,w_2999,c_crop/w_800", "https://media.cnn.com/api/v1/images/stellar/prod/150909142218-04-hiv-prep-heroes.jpg?q=x_0,y_0,h_1125,w_1999,c_fill/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/140110095114-charlie-sheen-0110.jpg?q=x_342,y_284,h_1245,w_2214,c_crop/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/141127180602-new-hiv-infections-by-region.jpg?q=h_360,w_640,x_0,y_0,c_crop/h_576,w_1024,c_lpad,b_rgb:061015/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/120111063108-piers-sheen.jpg?q=x_4,y_0,h_710,w_1263,c_crop/h_144,w_256"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/130118215738-charlie-sheen-getty.jpg?q=x_0,y_299,h_1687,w_2999,c_crop/w_800", "keywords": [], "authors": ["Jason Hanna Doug Criss Sandee Lamotte", "Jason Hanna", "Doug Criss", "Sandee Lamotte"], "canonical_link": "https://www.cnn.com/2015/11/17/health/charlie-sheen-health/index.html", "title": "Charlie Sheen says he is HIV-positive", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Charlie Sheen says he is HIV-positive | CNN", "description": "In an interview with Matt Lauer on NBC's \"Today\" show, Charlie Sheen revealed that he's HIV-positive.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/130118215738-charlie-sheen-getty.jpg?q=x_0,y_299,h_1687,w_2999,c_crop/w_800", "type": "article", "url": "https://www.cnn.com/2015/11/17/health/charlie-sheen-health/index.html", "site_name": "CNN"}, "twitter": {"title": "Charlie Sheen says he is HIV-positive | CNN", "description": "In an interview with Matt Lauer on NBC's \"Today\" show, Charlie Sheen revealed that he's HIV-positive.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/130118215738-charlie-sheen-getty.jpg?q=x_0,y_299,h_1687,w_2999,c_crop/w_800", "card": "summary_large_image", "site": "@CNN"}, "description": "In an interview with Matt Lauer on NBC's \"Today\" show, Charlie Sheen revealed that he's HIV-positive.", "template_type": "article_leaf", "type": "article", "meta-section": "health", "theme": "health", "article": {"published_time": "2015-11-17T12:15:26Z", "modified_time": "2017-08-01T17:05:57Z", "tag": "aids and hiv, celebrities, charlie sheen, diseases and disorders, health and medical, immune system disorders, infectious diseases, business and industry sectors, life forms, microscopic life, pharmaceuticals and biotechnology, pharmaceuticals and prescription drugs, viruses", "publisher": "https://www.facebook.com/CNN"}, "keywords": "aids and hiv, celebrities, charlie sheen, diseases and disorders, health and medical, immune system disorders, infectious diseases, business and industry sectors, life forms, microscopic life, pharmaceuticals and biotechnology, pharmaceuticals and prescription drugs, viruses", "author": "Jason Hanna,Doug Criss,Sandee LaMotte", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1447718400.0, "source": "http://www.cnn.com", "summary": ""}