{"url": "http://abcnews.go.com/ThisWeek/week-transcript-gen-jim-jones-ret/story?id=13285705&page=3", "text": "March 27, 2011 — -- AMANPOUR: This week -- furious mobs kill more western civiliansin Afghanistan. And as the death toll mounts, the Florida pastor whostarted it by burning a Koran says that he has no regrets.\n\n(BEGIN VIDEO CLIP)\n\nTERRY JONES: We do not feel responsible, no.\n\n(END VIDEO CLIP)\n\nAMANPOUR: Our correspondent is with American soldiers in thedeadliest firefight against the Taliban in months.\n\nThen in Libya, despite U.S. and NATO bombing runs meant to savethem, rebels are in retreat from Gadhafi's forces. Is America in abattle it can't win? Three wars and billions of dollars later, we'lldiscuss all of this with the president's former national securityadviser in his first interview since leaving the White House.\n\nAlso, who will pay for it all?\n\nThe jobs picture is getting brighter. But could rising prices,revolution, and a nuclear disaster kill the recovery? And as partisanbickering meets the bloated budget, will the government shut downlater this week?\n\n(BEGIN VIDEO CLIP)\n\nREP. MIKE PENCE R-IND.: I say, shut it down.\n\n(END VIDEO CLIP)\n\nAMANPOUR: Two top senators join us for a This Week debate.\n\nANNOUNCER: Live from the Newseum in Washington, This Week startsright now.\n\nAMANPOUR: Welcome to the program. Right now, the Middle East isfalling further into chaos, violence and uncertainty as the UnitedStates grapples with fresh challenges in two of its three wars.President Obama, who ran as the anti-war candidate, now finds himselfstruggling to defend new American military action overseas, while therapidly changing situations in Libya, Afghanistan, and across theMiddle East pose new threats to U.S. security and credibility.\n\nI'll be talking to my colleagues Mike Boettcher and Nick Schifrinin Afghanistan, and Jeffrey Kaufman and Alex Marquardt on the frontlines in Libya.\n\nLet's turn first to Afghanistan, where a firefight along thePakistan border brought one of the deadliest days for American troopsin months, and where the battle for hearts and minds may have beenvirtually erased overnight at the hands of a fringe pastor in Florida.\n\nAfter months of threatening to burn a copy of the Koran, PastorTerry Jones and his handful of followers finally did just that. Thisdeliberately provocative act received little media attention here inthe United States, but it did spread like wildfire online. And withindays, protests in Afghanistan turned deadly.\n\nABC's Mike Boettcher is embedded with the 101st AirborneDivision. Mike was the lone reporter on that bloody six-day offensivealong the border.\n\nMike, how bad was that?\n\nMIKE BOETTCHER, ABC CORRESPONDENT: In 30 years of covering war,I have never seen such withering fire. And soldiers who have beendeployed four or five times will tell you the same thing.\n\nA high price was paid. Six U.S. soldiers were killed. Six werewounded. Two Afghan national army were killed. And seven Afghanswere wounded in this battle, and the battle continues as we speak,right now.\n\nThis is a significant engagement because it marks a turning pointor a change in strategy along the Pakistan border where bases havebeen closed in recent months, small combat outposts. The U.S. nowsays that they're taking a more mobile strategy, going to areas theyhaven't been before, and going after the Taliban. They're going tocarry this through, through the spring and summer and expect to seevery heavy fighting in the east part of the country in the comingyear. Christiane?\n\nAMANPOUR: Meantime, in cities across Afghanistan today, morescenes of rage and violence in response to that Florida pastor'sdecision to burn a Koran. The situation does present a grave newproblem for the United States. And ABC's Nick Schifrin joins me nowfrom Kabul.\n\nNick, today, General Petraeus had to come out and specificallycondemn the burning of that Koran. How bad is it there?\n\nNICK SCHIFRIN, ABC CORRESPONDENT: Well, we've seen threeprotests three days in a row now, massive protests, 8,000 miles awayfrom that Koran-burning. Today thousands of Afghans in the streets ofsouthern Afghanistan and eastern Afghanistan, they were burning U.S.flags and chanting \"death to President Obama.\"\n\nNow David Petraeus came out with that statement today, but thereis one good piece of news. The Afghan police did not shoot into thecrowds like they did yesterday. On Friday, they were supposed to bethe first line of defense around a U.N. building where seven U.N.workers were killed. They were not able to keep those workers -- keepthose protesters out of that U.N. building.\n\nAnd U.S. officials are deeply concerned about that, because theplace where that happened, Mazar-i-Sharif, is the first city that issupposed to transfer to Afghan control, to transfer to Afghan policecontrol in three months.\n\nAnd U.S. and U.N. officials are worried that this incident is asign that the police aren't ready to take control -- Christiane. AMANPOUR: Nick, thank you. And obviously we'll keep monitoringthat situation.\n\nAnd now we turn to Libya. America's newest war is entering itsthird week of bombing, and still there is no sign that Colonel Gadhafiis stepping down. And now more bad news for the makeshift rebelforces. NATO warplanes seem to have mistakenly bombed one of theirconvoys. Another blow in a week where they've seen most of theirgains against Gadhafi wiped out.\n\nJust Monday, the rebels were within striking distance ofcapturing Gadhafi's home town of Sirt. And they had the capitalTripoli in their sites. But by week's end, they were beating a hastyretreat with Gadhafi forces once again in control of the long stretchof coastline.\n\nOur reporters in Libya have been tracking all of this. JeffreyKaufman just arrived in Tripoli, and Alex Marquardt joins us from therebel bastion of Benghazi. Let's start with Jeffrey.\n\nJeffrey, in Tripoli, any signs of the tension or that maybeGadhafi is on his last few days?\n\nJEFFREY KAUFMAN, ABC CORRESPONDENT: Well, actually, just momentsago we heard a NATO warplane flying above us. We didn't hear anybombs dropping. But, you know, it's actually remarkably normal here.You can see the traffic behind me on the highway.\n\nAs we came in, we saw a lot of military checkpoints, long linesfor gasoline, a lot of shops closed. But the tension is not palpableat this point. The rebels are clearly on the retreat. Really, whatwe're seeing now in Libya is a divided country, almost two countries:the rebel-held east and the Gadhafi-held west.\n\nAnd neither one seems to have the strength right now to unseatthe other. Certainly the rebels aren't organized enough, mannedenough, or skilled enough to come to Tripoli. And Gadhafi, it seems,the coalition will not let him go further east and retake thosevaluable oil fields in those areas.\n\nSo right now the word to describe this revolution, weeks into it,is stalemate -- Christiane.\n\nAMANPOUR: Jeffrey, thank you. You mentioned stalemate and alsodivided country. And joining me now from the rebel-held city ofBenghazi is ABC's Alex Marquardt.\n\nAlex, how are these rebels dealing with being unable to reallycapitalize on all of the help the no-fly zone is giving them?\n\nALEX MARQUARDT, ABC CORRESPONDENT: Christiane, they're not ableto capitalize because they are outmanned, they are outgunned, and theyare not able to organize. They don't have the weapons to faceGadhafi's superior firepower. So they're forced to beat a retreat.\n\nThey don't have any sort of leadership. So when they retreat,they do so in a disorganized fashion, very quickly, no one showingthem how to hold the line, how to retreat.\n\nSo we're seeing now glimmers of hope that they'll be able toorganize. Experienced officers on the frontlines trying to corralthese groups into units, keeping people back without any sort oftraining.\n\nAnd for the first time on the frontlines on Friday we saw thegeneral who is technically in charge of these forces, General AbdelFattah Yunis, welcomed with a hero's welcome. So signs that there issome leadership coming to the frontlines that is so desperately neededby these rebels.\n\nAMANPOUR: Alex, thank you so much.\n\nRarely has a president faced a foreign policy puzzle thiscomplex. President Obama, of course, came into office pledging torepair America's relationship with the Muslim world. Now thatrelationship is tested like never before. Joining me to discuss thepath forward, the president's former national security adviser,General Jim Jones. He's now a senior fellow at the Bipartisan PolicyCenter.\n\nThank you for joining us.\n\nJONES: Thank you, Christiane. Good to be here.\n\nAMANPOUR: Let's first talk about Afghanistan, since that seemsto be a real crisis again at the moment. This pastor who burned theKoran, is unrepentant. Do you think despite the freedoms envisionedand expressed specifically in the American Constitution, he should nothave burned that Koran?\n\nJONES: Oh, I don't think he should have done that at all. Ithink it's extremely irresponsible, and look at what it has led to.\n\nAMANPOUR: You also heard Mike Boettcher's report, a fiercefirefight along the Pakistani border, one of the worst that theAmericans had been involved in. Right now, do you think the UnitedStates forces can pull down significantly in July?\n\nJONES: Well, I think that there can be and there will be somereduction of force in keeping with the agreement made at Portugal atthe NATO summit in December to target 2014 as, in President Karzai'sown words at the London Conference, \"This is when I want to be able tocontrol my entire country.\"\n\nAMANPOUR: But can it be done responsibly, if you'd like?\n\nJONES: Yes, I think so. I think it can be done responsibly.And we'll have to see what it looks like. A lot of it hinges on whathappens on the other side of the border with our friends, the -- ourneighbors the Pakistanis.\n\nIf Pakistan turns to what some of us think they should have donemore effectively for a long period of time now, attacking and removingthose safe havens that cause us so much difficulties, and if we canget some sort of coordination with their forces, then I think you canin fact...\n\n(CROSSTALK)\n\nAMANPOUR: You say if. You don't seem convinced that they'replaying their part.\n\nJONES: Well, I don't -- I'm not convinced. I think there wassome good progress made in the Swat Valley and in North Waziristan ayear or so ago. But it hasn't been sustained. There still seems tobe that reluctance to engage comprehensively and buy into an overallplan that would, I think, really help Pakistan in the long term.\n\nAMANPOUR: All right. General Jones, stay with us because upnext we will talk about Libya. Will Libya become Obama's Iraq, assome are now suggesting? And it's a question you'll hear more andmore in the coming days. I will ask General Jones if he sees an endin sight.\n\n(COMMERCIAL BREAK)\n\n(BEGIN VIDEO CLIP)\n\nROBERT GATES, DEFENSE SECRETARY: There will be no American bootson the ground in Libya. Deposing the Gadhafi regime, as welcome asthat eventuality would be, is not part of the military mission.\n\n(END VIDEO CLIP)\n\nAMANPOUR: Defense Secretary Robert Gates testifying on CapitolHill Thursday. He is on the record saying that stopping the violencein Libya is not a vital national interest of the United States. ButAmerica is in the game now. And the big questions, for how long? Andto what end? Let's bring back retired General Jim Jones, who wasPresident Obama's first national security adviser.\n\nWelcome back again. On Libya, Secretary Gates has said on thisprogram and on several last week, that it was not in the vitalinterest of the United States. Do you agree?\n\nJONES: I agree with that.\n\nAMANPOUR: You agree that it's not in the vital interest?\n\nJONES: I agree that it's not a vital interest in the sense thatit affects the security -- the vital security of the nation. But weare part of an alliance. We are one of the global leaders, if not theglobal leader. And we have to do -- it is in the vital interest --more in the vital interest of Europeans, when you consider the effectsof massive immigration, the effects of terror, the effects of the oilmarket.\n\nAMANPOUR: So the United States is now in it. You can call itwhat you want. But it's a third armed conflict.\n\nJONES: We're a part of it. We are transitioning to a supportingpart, only the United States could have gotten there as quickly as itdid.\n\nAMANPOUR: The United States is making a great fanfare about nowgiving over to NATO. But you were a former SACEUR, a former NATOcommander. NATO, to all intents and purposes, is an Americanorganization. It's run by an American commander. The chain ofcommand is American. The biggest command and control and resourcesare American. This is still an American-led operation, right?\n\nJONES: I'm not sure I completely agree with that. We have, youknow, in the sorties that are being flown now, as I understand it,it's roughly 50-50. And it's going to go down to where the Americansare going to be supporting and reconnaissance, search and rescue,intelligence, refueling, things like that.\n\nThere are 40-some-odd ships off the coast, only 10 are American.There are 40 flag officers from different countries involved, only 10of which are American. So it really is a -- I think it's encouragingto see allies stepping up at a level that we haven't seen before. Imean, it has been good.\n\nAMANPOUR: What is the endgame? I mean, really, what is theendgame? We've seen two weeks of bombing. Gadhafi is where he is.Yes, there have been some high profile defections. The president hassaid Gadhafi has to go.\n\nJONES: And this is the next piece that's the difficult piece.Because...\n\nAMANPOUR: But what is -- how does one accomplish that?\n\nJONES: The strategic question is, what do you do when Gadhafigoes? Because we don't know exactly who the opposition is, yet.\n\nAMANPOUR: But before that, how do you get Gadhafi to go?\n\nJONES: Well, that's the part that is being working on. And Ithink...\n\nAMANPOUR: Do you know?\n\nJONES: I don't know. I don't know. I don't know the answer tothat. But I do know that that is the wish and the goal of this entireeffort.\n\nAMANPOUR: You mentioned, who are these rebels? It's a questioneverybody wants to know.\n\nJONES: Opposition.\n\nAMANPOUR: Opposition rebels...\n\nJONES: You can call them whatever you want.\n\nAMANPOUR: Whoever they are, freedom fighters. But the world hasnow taken their side. Who are they? Do you know? JONES: Well, I don't -- I personally do not know. And I knowthat there is tremendous effort going on in many capitals around theworld to make sure that we do understand what that is.\n\nAMANPOUR: When you see these rebels, as Alex Marquardt said andwe've been reporting, unable to capitalize on the no-fly zone, whathas to be done to help them? Should they be armed? Should they betrained?\n\nJONES: Well, I think the first thing that has to be done is tofind out who these -- who they are. And so if you start from theproposition that our reason for committing our forces, as Americans oras part of NATO, was basically to avoid a massacre of innocentcivilians, which probably would have happened, and now we're there,and now we have to do -- now we have to take the rest -- follow therest of the trail to identify these people, then decide, you know,whether that's meritorious or not in terms of training, organizing,equipping.\n\nThe United States has not done that yet.\n\nAMANPOUR: Isn't it troubling that we don't know who they are andwhat their goals and aspirations are?\n\nJONES: Well, it's a pop-up mission that came very quickly. Itmetastasized to the point where 700,000 people were going to bethreatened. And, you know, I wish -- in all of these things, wealways want it to be clear, we want nice end-state rules. But the fogof war doesn't sometimes allow for that.\n\nAnd so now we are putting this together, I think, from what I cansee, we're doing the things that have to be done before we decide --before the coalition decides, the U.N. decides exactly what to donext.\n\nAMANPOUR: Let's just quickly turn to Yemen, a major Americanally. If Saleh falls, how bad is that for the fight against al Qaeda-- if the president of Yemen falls?\n\nJONES: Well, I think that's -- I think Yemen is very worrisome.This is a -- Saleh has been very skillful over the years in being ableto consolidate and maintain his power. The trends in Yemen are notgood. And this could be a major problem. And where terror isconcerned, this would be a safe haven that would be a very troublingturn of events for us.\n\nAMANPOUR: So is the U.S. to try to keep Saleh in power or what?\n\nJONES: Well, I don't know -- you know, there are certain thingsthat we can do and that we can't do. When events reach a certainstage, they have a life of their own. And it would be nice to be ableto think that we could do everything and make the world, you know,perfect the way we want it. But that's not the case.\n\nSo the trendlines in Yemen are not good. We've invested a lot ofwork in Yemen. But it is a disturbing trend for the future. And thisis -- again, one of the things that I feel strongly about is that whenyou look at what's going on in this part of the world and you look atthe potential, there is reason to be optimistic in some areas andthere is reason to be very concerned in others.\n\nBut it's a tremendous tectonic shift in terms of the world as weknow it, and this part of the world since -- for the last 80 years.\n\nAMANPOUR: General Jones, thank you very much, indeed, forjoining us.\n\nAnd what do you think the U.S. should do next in Libya? Tweetme, @camanpour #libyanext.\n\nMeantime, the costs of the new war are already piling up. Morethan half a billion dollars so far. All this as Congress and theWhite House remain at loggerheads over a federal budget, and agovernment shutdown is looming.\n\nThe deadline just five days off. Will lawmakers beat the clock?We'll hear from one of the Democrats' toughest negotiators, SenatorChuck Schumer, and the top Republican on the Budget Committee, JeffSessions. That's in a moment.\n\n(COMMERCIAL BREAK)\n\n(BEGIN VIDEO CLIP)\n\nREP. JOHN BOEHNER, (R) OHIO: I have never believed that shuttingthe government down was the goal. And frankly, let's all be honest,if you shut the government down, it will end up costing more than yousave because you interrupt contracts -- there are a lot of problemswith the idea of shutting the government down. It is not the goal.\n\n(END VIDEO CLIP)\n\nAMANPOUR: House Speaker John Boehner, the man in the middle thisweekend, caught between a rowdy freshman class of hardlineconservatives and the more moderate congressional Republicans who wantto deal.\n\nBoehner, of course, wants a deal, too. But as senior politicalcorrespondent Jon Karl tells us, it's hard to broker compromise in atown where compromise itself has become a dirty word.\n\n(BEGIN VIDEOTAPE)\n\nCROWD: We want it back. We want it back.\n\nJON KARL, ABC NEWS CORRESPONDENT: Compromise on spending cuts?Not if these folks have anything to say about it.\n\nUNIDENTIFIED MALE; It's time to pick a fight.\n\nUNIDENTIFIED MALE: Because if we don't, we deserve to be thrownout of office.\n\nREP MIKE PENCE, (R) INDIANA: Liberals in the Senate would ratherplay political games and shut down the government instead of making asmall down payment on fiscal discipline and reform. I say, shut itdown.\n\n(CHEERS)\n\nKARL: That was at a Tea Party rally on Capitol Hill where oneorganizer had this message for GOP leaders.\n\nKATHY DIRR, TEA PARTY PATRIOT: I say to the Republicanleadership, take off your lace panties. Stop being noodle-backs. KARL: The attitude runs deep among House Republicans, some ofwhom don't want to compromise on spending cuts, or issues like fundingfor Planned Parenthood. Democrats have already agreed to make morethan $30 billion in cuts over the next six months, perhaps the largestcut Congress has ever made.\n\nBut Speaker of the House John Boehner's biggest challenge may beto convince his rank and file to accept victory.\n\nBOEHNER: We control one half of one third of the government herein Washington. We can't impose our will on another body. We can'timpose our will on the Senate. All we can do is fight for all of thespending cuts we can get an agreement to.\n\nKARL: Democrats have their hot heads, too. One Obamaadministration official said the Republican bill, which cuts $5billion from the agency for International Development would kill kids.That's right. Kill kids.\n\nRAJIV SHAH, USAID ADMINISTRATOR: We estimate, and I believethese are conservative. That HR 1 would lead to 70,000 kids dying.\n\nKARL: For weeks, Democrats have been accusing Republicans ofputting the country at risk of a government shutdown. Enter HowardDean.\n\nHOWARD DEAN, FRM. DNC CHAIRMAN: Yeah!\n\nKARL: Former Democratic Party chairman who told a forum thisweek that it is Democrats who should quietly rooting for a shutdown sothey can blame it all on Republicans.\n\nDEAN: From a partisan point of view, I think it would be thebest thing in the world to have a shutdown.\n\nKARL: And even the Democratic leaders trying to negotiate thedeal seem to have one word describe their Republican colleagues.\n\nUNIDENTIFIED MALE: Extreme level far to the right.\n\nUNIDENTIFIED MALE; Extreme Tea Party.\n\nUNIDENTIFIED MALE: Extreme territory beyond what was reasonable.\n\nUNIDENTIFIED MALE: Small, extreme minority.\n\nKARL: Compromise with extremists out to kill kids? They haveless than a week to make it happen.\n\nFor This Week I'm Jonathan Karl.\n\n(END VIDEOTAPE)\n\nAMANPOUR: And joining me now, the Senate's third rankingDemocrat, who you just saw there, Chuck Schumer, who joins us from hishome state of New York, at our bureau there this morning. And with mehere in the Newseum, Senator Jeff Sessions of Alabama, the rankingRepublican on the budget committee.\n\nSenators thank you very much for joining me.\n\nWell, you saw Jon Karl's piece. And there's, you know, a lot ofhijinks in that piece.\n\nLet's get to the bottom of what's going on, Senator Sessions, hasany progress been made this weekend amongst negotiators?\n\nSESSIONS: I don't know that it has.\n\nAMANPOUR: Is that a no?\n\nSESSIONS: Well, I don't know that it has.\n\nMr. Boehner, the speaker, has indicated that he has not reachedan agreement. So has Mitch McConnell, the Republican leader. So Ithink that negotiations continue and they need to continue.\n\nBut what this is -- Christiane, we really need to understand thisis more than a Republican-Democratic squabble. This is -- thefundamental question is, are we headed to a financial crisis if wedon't get off the fiscal course we're on? We have had witness afterwitness say that is so, Erskine Bowles said that President Obama'schoice to head the debt commission, we're facing the most predictabledebt crisis in American history. It could happen within two years.\n\nWe have got to take action now.\n\nAMANPOUR: And we'll get to that.\n\nSenator Schumer, from your perspective, has any progress beenmade? Will there be a shutdown in five days?\n\nSCHUMER: Yes. No I don't -- excuse me. I don't think therewill be a shutdown, Christiane. In fact, I'm quite optimistic. Ithink progress is being made. They're working off a number, $33billion in cuts. That's very reasonable. It's right in between whatDemocrats have proposed and Republicans have proposed right in themiddle. And after all, that was the number proposed originally by theHouse Republican leaders, Ryan and Rogers, the head of theappropriations committee.\n\nSo they're working off that number. That's good. Now we have tofigure out what goes into that number. And that's where thediscussions are headed.\n\nLet me just say a word about that. We have two goals here. Jeffis right, we have to deal with the deficit very seriously. But wealso have to deal with the economy and job growth. And we don't wantto snuff that out. And particularly when we're beginning to see jobsgrow.\n\nIf you just cut from domestic discretionary, you'll have to cutthings like helping students go to college, you'll have to cutscientific research, including cancer research. These things havecreated millions of jobs through the years.\n\nAnd so the good news is this: There's another place we can lookto cut not just on domestic discretionary. It's called mandatoryspending. It requires you to do something for somebody, but the wayof doing it is not required. We can find cuts in places likeagriculture and justice and banking. These are now being calledCHIMPS...\n\nAMANPOUR: CHIMPS?\n\nSCHUMER: CHIMPS, yes, changes in mandatory program spending.\n\nAnd we've offered about $10 billion of those to our Republicancolleagues. They're not adverse to them, because HR 1 had some ofthose in. And I believe that's how we can come to an agreement thatboth keeps job growth and cuts the deficit at about the $33 billionlevel. And I believe that's where we'll end up.\n\nAMANPOUR: You've raised a number of issues there. Let me firstquickly ask Senator Sessions, do you -- we're talking about the jobnumbers, do you think that's -- that's good news, obviously. The jobnumbers have increased. The unemployment number has come down, lowestin two years.\n\nSESSIONS: Well, it's really high.\n\nAMANPOUR: It is, but it's come down. That's good.\n\nSESSIONS: Not much.\n\nThis was a good month. This was a good month of a little over200,000. We need to average 250,000 jobs a month. In the last threemonths we have only averaged 124,000 new jobs. We are well belowwhere we need to be.\n\nOne of the reasons, as the testimony of Secretary Geithner,President Obama's Secretary of Treasury, testified that the debt ispulling down our growth and creates a threat of a crisis that couldput us back into recession. We have got to make changes now.\n\nAMANPOUR: Can you live with the short-term method here. Can youlive with the $33 billion in cuts?\n\nSESSIONS: I really believe we should do 61 total as the Houseproposed over ten years. That would be a savings of $860 billion.\n\nWe have to borrow this money. The House has sent a bill overthat reduces what is before us, discretionary spending, CR, is theonly thing before us. They proposed 61. The Democrats started at 4or 5. They've how to been pushed up to halfway. I think we should goall the way.\n\nBut we'll have to let our leaders work on this and see,hopefully, an agreement that goes as far as possible.\n\nAMANPOUR: As this haggling continues, I'm going to ask you,Senator Sessions. Speaker Boehner this week basically said, and Ithink it's sarcasm, thank you guys for painting me into a box that'sjust where I want to be, talking about the conservative -- the TeaPartiers. Have they held the Republican leadership sort of hostage inthese negotiations.\n\nSESSIONS: Christiane, that's the Democratic spin. That's theway...\n\nAMANPOUR: But this is what Speaker Boehner said.\n\nSESSIONS: I know that. But I'm telling you what the real dealis. This week, the House -- Republican House will submit a mature,serious budget for long-term reform of spending in America that willavoid a debt crisis this country is facing in two years, according toMr. Erskine Bowles.\n\nThe Democrats have no plan except the president's plan whichmakes the debt worse than the current trajectory we're on. It raisestaxes. It increases spending even more. It doubles the debt. We'lltake interest from $200 billion last year in one year to $900 billionin 10 years, crowding out all kind of social programs and beneficialprograms that Senator Schumer has talked about.\n\nAMANPOUR: Right. Senator Schumer...\n\nSCHUMER: Well, let me say this, Christiane. Yes, I have a lotof sympathy for Speaker Boehner because he does want to come to anagreement. He knows how devastating a shutdown would be. That's hiswords, not ours. Although we all agree on that.\n\nThe one group that's standing in the way here is the tea party.Now they have said that a shutdown is a good thing. You saw it onthat tape. Some of their leaders have said it over and over again.Sarah Palin, Mike Pence, Michelle Bachmann. They say it's our way orno way.\n\nWell, that's not how the American government works. And I wouldsay this though, here's the good news. The American people are seeingthe tea party for what it is, extreme. And their popularity isdeclining.\n\nThey now have only 33 percent of people in support of them, and47 percent people against them. And when they lose clout, it makes anagreement much more likely. It's another reason I'm optimistic.\n\nAMANPOUR: All right. Let me just ask you this before we turn toyou, Senator Sessions. Today -- or rather, this week, you sort ofstepped in it, sort of recording-wise. You were caught briefing yourfellow senators on how to address this issue, didn't know apparentlythe reporters were still on the conference call. Let's just playthat, because it plays right into the spin and the language about whatis going on right now.\n\n(BEGIN AUDIO CLIP)\n\nSCHUMER: I always use the word \"extreme.\" That's what the caucusinstructed me to do the other week. Extreme cuts and all theseriders. And Boehner is in a box. But if he supports the tea party,there's going to inevitably be a shutdown.\n\n(END AUDIO CLIP)\n\nSCHUMER: Now, you know, Christiane, I have no problem withreporters hearing that. I said it a few hours before on the floor ofthe Senate. I've said on it this show. The tea party is the groupstanding in the way. They are extreme.\n\nAny group that says you don't cut oil subsidies to companiesmaking billions and billions of dollars, subsidies that were passedwhen the price of oil was $17 to encourage production, and now theprice is over $100, and at the same time, says, cut student aid tohelp qualified students go to college, yes, I believe they're extreme.And I have no problem with that...\n\n(CROSSTALK)\n\nAMANPOUR: OK, Senator Sessions, extreme and holding the partyhostage.\n\nSESSIONS: It's absolutely false. Millions of Americansparticipated in the tea parties. Tens of millions of Americanssupport and believe what they're saying. And they are rightfundamentally. Maybe they don't understand all the realities ofWashington politics.\n\nAMANPOUR: But are they right for being...\n\nSESSIONS: But fundamentally they know this country is on a pathto fiscal disaster. As Erskine Bowles said, as Secretary Geithner hassaid, as Alan Greenspan has said, we're heading -- and this Democraticleadership proposes nothing.\n\nAMANPOUR: Do you believe...\n\nSESSIONS: But to attack the people who are trying to get thiscountry on the right course.\n\nAMANPOUR: Do you believe there will be a shutdown?\n\nSESSIONS: I hope not.\n\nAMANPOUR: But do you think there will be?\n\nSESSIONS: I doubt it. I doubt there will be a shutdown.\n\nAMANPOUR: All right. Well, both of you agree on that. And, ofcourse, we do have to talk at another time about these huge mega-issues, which really right now is tinkering around the edges, isn'tit? The big, big entitlement programs.\n\nSESSIONS: We're talking about trillions of dollars.\n\nAMANPOUR: Precisely. And we'll have you back... SESSIONS: And the president has no plan whatsoever to deal withit.\n\nAMANPOUR: There seems to be no plan in general.\n\nSCHUMER: That's not true at all.\n\nAMANPOUR: And we'll discuss that the next time.\n\nSCHUMER: That's not true at all.\n\nAMANPOUR: Thank you very much, indeed, for being on thisprogram.\n\nAnd tell us your thoughts on the war on Capitol Hill. Tweet me@camanpour #budgetbattle.\n\nAnd up next, new job numbers are moving in the right direction,as we have heard, but could a government shutdown deal a serious blowto the recovery? We'll get answers from our roundtable.\n\n(COMMERCIAL BREAK)\n\nAMANPOUR: A Florida pastor's reckless stunt sends shock wavesacross Afghanistan, bringing mayhem and death. But today, Terry Jonesis unrepentant. How does the White House contain the damage caused bya preacher gone rogue? Our \"Roundtable\" tackles that one. Staytuned.\n\n(COMMERCIAL BREAK)\n\n(BEGIN VIDEO CLIP)\n\nOBAMA: Today, we learned that we added 230,000 private sectorjobs last month. And that's good news. That means more packages,right?\n\n(END VIDEO CLIP)\n\nAMANPOUR: The president at a UPS facility on Friday. And yes,the jobs picture is looking up. Unemployment is the lowest it hasbeen since March of 2009, just after President Obama took office. Soit's good news, if 8.8 percent unemployment can be considered goodnews. But as the recovery picks up steam, the budget showdown inWashington threatens to derail the progress that has been made.\n\nHere to make sense of it all, our \"Roundtable\" with George Will;Paul Krugman, Nobel Prize-winning New York Times columnist; TorieClarke, the former Pentagon spokeswoman in the Bush administration;and David Ignatius of The Washington Post.\n\nGreat to see you all here. So, the jobs numbers, good, right?\n\n(CROSSTALK)\n\nPAUL KRUGMAN, THE NEW YORK TIMES: Yes, it begins with a sigh,because, look, this is better than naught. Right? Better than nojobs. But unemployment is a funny number. Unemployment, you're onlyconsidered unemployed if you're actively looking for work. And so ifyou look, over the past year, the unemployment rates have come down alot, significantly anyway. But that's basically almost all becausefewer people are looking for work.\n\nAMANPOUR: So where is it headed in terms of the people lookingfor work?\n\nKRUGMAN: Well, it's still terrible. It's still a terrible jobmarket. It's not deteriorating. But it's still a very -- there'sstill about five times as many people looking for jobs as there arejob openings. And it's still -- the length, the average duration ofunemployment hit a new record.\n\nSo we're in a situation where, you know, things are not gettingworse, or at least not getting worse in all dimensions anymore.\n\nAMANPOUR: So is that good news? It's not getting worse.\n\nGEORGE WILL, THE WASHINGTON POST: Well, it's not getting worse.Actually, the good news within the news is that there are 14,000 fewerpeople working for government in the United States as state and localgovernments shed jobs.\n\nBut a corollary of what Paul just said is that when the economypicks up and people become encouraged to go back into seeking jobs,you could have the economy rising and unemployment risingsimultaneously.\n\nWe lost more jobs in this great recession than the last fourrecessions combined. Now we have had, for 28 months, essentially zerointerest rates. The quantitative easing, the printing of money thatbegan in November, under this the Fed -- the Federal Reserve Board hasbeen buying 70 percent of the new issues of Treasury debt. That endsin June.\n\nThat probably distresses Paul.\n\nKRUGMAN: Yes, I would just say that the aftermath of a terriblefinancial crisis, and this was the worst financial crisis since the1930s, is always a prolonged period of weak growth. And the tragedyis that Washington has given up on the jobs picture.\n\nIt's not that -- it's not a failure of policy. I think thepolicies that we have undertaken made things less bad than they wouldhave been. But here we are with still terrible unemployment rate, 37weeks the average unemployed person is unemployed. And no interest inWashington about doing anything to create jobs.\n\nAMANPOUR: So we were just speaking to Senators Sessions andSchumer. Did you hear anything from them that would lead to aslightly less grim outlook?\n\nIGNATIUS: Only that you heard a reluctance on both sides to takethe budget showdown off the edge of a cliff. I didn't hear muchenthusiasm for a shutdown from Senator Sessions on the Republicanside.\n\nI think what's excited the White House about these numbers is notthe unemployment number per se, because as Paul says, there are allsorts of complicated factors that go into that, but the job growthnumber. And it does look as if the economy is finally beginning togenerate jobs in the numbers that over time, would bring theunemployment rate down and would get you back on a trajectory of morenormal growth. We're not there yet. But I think people see, youknow, a light at the end of the tunnel, you can say, they at least seethe tunnel.\n\nCLARKE: I think the good thing from the two senators is neitherone of them tried to score huge political points one way or the other,which is kind of the norm, and I thought was very responsible andeven-handed, which is good.\n\nBut here's the failure of policy, I think. What will really getthe private sector humming and hiring a lot of people is if they havepredictability and certainty about things like regulatory regimes andare some of these trade agreements going to go through that we reallyneed? Because it is a global picture, not just a domestic one.\n\nAnd I know there's a lot going on, but nobody seems to befocusing on that, not the administration, not Congress. And Paul islaughing.\n\nKRUGMAN: Because that's not -- the reason businesses are notinvesting is they have tons and tons of excess capacity. There's avery clear relationship historically between the amount ofunemployment and the amount of business investment. When unemploymentis high, when capacity is low, investment is low. There's nothing --all of this stuff about uncertainty is just a myth being made up toblame this on Obama.\n\n(CROSSTALK)\n\nCLARKE: No, it's not. Money is a coward. Money is a coward.It's not going to go unless it knows it can make money.\n\nKRUGMAN: There's nothing in there. There's nothing in there.It's exactly what you expect.\n\nAMANPOUR: Torie mentioned reform. And tax reform is one ofthem. I mean, it looks like this week, there was this whole issuewith Jeffrey Immelt, the president's adviser, and you know, allegedlypaying actually no tax on having made billions of dollars in profit,the company. It was OK. He took advantage of the system. But is itright? Does that need to be conformed (ph)? GE?\n\nWILL: It's an old axiom that what is alarming in Washington isnot what's done that is illegal but what is done that's legal. No oneis accusing GE of doing anything other than taking advantage of thebaroque tax code that we have produced over time. Mitch Daniels, thegovernor of Indiana, says, wouldn't it be wonderful if we had a taxcode that looks as though someone designed it on purpose? Theydesigned a tax code that has produced the following interestingnumber. According to Investors Business Daily, 975 people work in thetax department of GE, just trying to mine the tax code for advantage.\n\nAMANPOUR: That's true (ph), but it doesn't look good, though,does it? The optics of this?\n\nKRUGMAN: No, I have to say that Obama has got a pretty badrecord now. He picked Alan Simpson to co-head the debt commission,which turned out to be given to making some rather strange remarks.As his adviser on the economy, he managed to pick the head of acorporation that is managing not to pay any taxes.\n\nAnd look, we do need tax reform. But the biggest obstacle to taxreform right now is that any reasonable tax reform is going to raisetaxes on some people. Because you're going to close some loopholes.And what we have is the right wing of the Republican Party, the GroverNorquist types saying, no taxes on anybody should ever go up. And wecan't have a tax reform that consists solely of cutting taxes. Wehave to have one that levels the taxes. So at the moment, tax reformis just not on the agenda, realistically, because we have no agreementon that.\n\nAMANPOUR: Do you think President Obama is as involved in, forinstance, the budget battles that are going on in Congress as youwould like to see him?\n\nIGNATIUS: In classic Obama fashion, he's involved but tries toconceal his hand. He's the most reticent chief executive I canremember. For example yesterday, Saturday, he was on the phone bothto John Boehner, the House speaker, and to Harry Reid, the Senatemajority leader, trying to talk about the details of the compromisethey hope will be coming this week.\n\nOn the question that Paul is raising, whether we're ever going toget to the point where we're seriously talking about taxsimplification, tax changes that would lead to better budget balanceand reductions in the deficits that worry everybody, I think thisWhite House is getting ready for a process. And I think it couldactually come quite soon. By June, July, in which the White House,which has been reticent, silent on all of this, will begin to roll outsome ideas similar to those that were in the Simpson-Bowles deficitcommission. And I think we could have this summer a big and a veryimportant debate on how to get these numbers better.\n\nAMANPOUR: One thing we didn't get to talk about with thesenators was the really big cuts or the big reforms that have to bemade in entitlements. And also on the Pentagon. Where do you thinkcan big cuts be made in the Pentagon budget?\n\nCLARKE: Oh, man. It's like the morbidly obese patient that'salmost, where do you start? It really is. And God bless anyone,Rumsfeld, Gates and others who are trying. It's very, very hard.They have made some significant cuts. And there is plenty, plenty ofwaste in that place. Any time you have 2 or 3 million employees,depends on how you count them, there's a lot of waste.\n\nBut that wouldn't be the first place I would start. Most peoplewould argue that's not the one that is going to make a big difference.And whether or not these folks up the street are really serious is ifthey tackle the major, major entitlement programs.\n\nRepublicans say they are going to. It has yet to be seen.\n\nAMANPOUR: Hold that thought and we'll continue. With theworld's eyes on Libya, Afghanistan explodes anew with rage and murderin the streets there. How can the United States extinguish a fusethat's been lit by that renegade Florida pastor who took it uponhimself to burn a Koran? We'll have that with our roundtable when wecome back.\n\n(COMMERCIAL BREAK)\n\n(BEGIN VIDEO CLIP)\n\nUNIDENTIFIED MALE: Should you bear any responsibility forinciting today's horrific actions?\n\nTERRY JONES: We do not feel responsible, no. We feel more thatthe Muslims and the radical element of Islam, they used that as anexcuse.\n\nSTAFFAN DE MISTURA, CHIEF OF UN ASSISTANCE MISSION INAFGHANISTAN: I would tell him my three colleagues have died, andseven all together have died. We are very good people and we'reworking hard. So you should be feeling guilty and should not do that.\n\n(END VIDEO CLIP)\n\nAMANPOUR: That was Staffan de Mistura, chief of the U.N.assistance mission in Afghanistan right there talking and weighing inon pastor Terry Jones, who decided to burn a Koran. That act, aswe've been telling you, has set off a tidal wave of anger and violencein Afghanistan. Pastor Jones of the ironically named Dove WorldOutreach Center is unrepentant and unbowed. And still a huge headachefor the Obama administration.\n\nSo let's bring that subject back to our roundtable. Let me askyou, David Ignatius, is this a one-time horrible thing or is thissomething that's going to have a lingering effect in Afghanistan rightnow? And to the detriment of the Americans?\n\nIGNATIUS: Sadly, this incident of people protesting and killingpeople because of anger at the burning of Korans, but it's reallyanger at what they see as a United States that doesn't respect theirreligion, it recurs in Afghanistan and Pakistan so often. I thinkthey are irresponsible actions by pastor Jones and by the Muslimsheikhs who on Friday prayers incited people, but the larger point isthat deep into a war where we -- our strategy is counterinsurgency, toget the population with us and working with us to fight against theTaliban, you see what angry, anti-American feeling is out there. Evenin areas that are remote from the fighting like Mazar-e Sharif in thenorth -- that is where the 12 U.N. people were killed. That's farfrom the battlefield. So that's what worries me.\n\nAMANPOUR: Torie, what should the administration be doing to winback some of these hearts and minds?\n\nCLARKE: It is going to be very, very hard. Right or wrong, theytake it as a sign, an excuse, and a reason to go after the UnitedStates.\n\nAMANPOUR: General Petraeus came out strongly today,categorically blaming the pastor and basically saying this is notrepresentative of the U.S.\n\nCLARKE: And I know extraordinary people at extraordinary levelshave talked to him before saying it is needlessly provocative. Yes,in this country you can talk about freedom of speech, but you cannotdo this and underestimate the consequences it can have around theworld.\n\nThere was no need to do this. But I think it will take a longtime to repair these sorts of things. Fairly or unfairly, it willtake a long time to repair them.\n\nAMANPOUR: And here we are, two weeks into Libya now, which somepeople are calling a war others aren't. Are you calling it a war?\n\nWILL: Of course it's a war. War planes flown by warriors doingwhat war looks like, which is dropping bombs.\n\nAMANPOUR: Did the president convince you in his speech on Mondaythat this was in the vital national interests? It had a limited goal,limited duration?\n\nWILL: What he said in his speech was broadening our militarymission to include regime change would be a mistake. If so, we'remaking it.\n\nIt's perfectly clear that we who worried about mission creep gotit wrong. It was mission gallop. Weeks ago when the president saidthis would be matter of days not weeks. He said, also, we were toldthere would be no boots on the ground. Well there may not be boots,there are certainly shoes on the ground now.\n\nAMANPOUR: The CIA?\n\nWILL: They're occupied by CIA people, because like it or not,the logic of events says that this is a failure if Gadhafi survives.Some of us worry that, even worse than the failure would be thesuccess, because it is going to whet the appetite of humanitarianimperialists for more of these interventions. AMANPOUR: Well, General Jones was telling me that it was a risk,one way or the other, whether Gadhafi stays or goes, mostly because wedon't know the rebels.\n\nA lot has been made of the end game. George just rightlymentioned that the president said regime change was not the goal, butthe president also says that Gadhafi has to go. So where are we here?\n\nKRUGMAN: This is clear. I actually have a lot of sympathy forthe president on this. It's clearly -- this was not like Iraq. Thiswas not a gung-ho president who wanted to win himself some militaryglory. There is going to be no landings on aircraft carriers for thisone, right? This was something where he was dragged in. He wasdragged in by the spectacle of a looming humanitarian disaster.\n\nAnd it's very, very hard -- it's hard both directions. I thinkif you actually look at the people like me who are very opposed toIraq, we're actually very divided. And in many cases divided withinourselves, as I am. But this is -- this was not easy. Of coursethere's no clear end game. This was something where pulled in byevents.\n\nI think the president's speech wasn't very effective because I'mpretty sure he's internally divided too. But I think that's to hiscredit.\n\nCLARKE: Wow. Maxwell Taylor, who President Kennedy brought backto look at Vietnam did this amazing speech in which he said, when youlook at these things, the commitment of forces, you better be able toexplain to the man in the street in a simple sentence or two whatyou're trying to accomplish.\n\nI could pick 500 people off the street and say what are we tryingto get done in Libya? They would not be able to answer that question.I don't know what the answer to that question is.\n\nAMANPOUR: One of your former colleagues in the Bushadministration, Megan Sullivan, has just written an op-ed...\n\nCLARKE: Smart piece.\n\nAMANPOUR: ...saying that it could be Obama's Iraq. I mean, isthat completely fantastical or is that possible?\n\n(CROSSTALK)\n\nCLARKE: I think, with all due respect for all these brilliantpeople sitting around the table, I think anybody that says they knowis either stupid or lying. We don't know.\n\nAMANPOUR: David?\n\nCLARKE: You're either going to be stupid or lying. So go ahead.\n\nIGNATIUS: The unknowns are scary. Secretary of Defense Gatessaid to me and then on your show, I think, the shows -- this is darkterritory. We don't see what is down there. I think there's reasonnot to worry this is spinning off to an Iraq. There are not the tensof thousands of troops on the ground.\n\nAMANPOUR: Do you think Gadhafi will go?\n\nIGNATIUS: I think the White House strategy today is to seek whatone person described to me as regime implosion. And that ishappening. This regime that requires cash to survive. The cashbasically is cut off. This is a regime that has a small inner circleof people close to Gadhafi. One by one, they're leaving.They're going to London. They're defecting to Egypt.\n\nAMANPOUR: Well, really two biggies.\n\nIGNATIUS: Well, there are more on the way. I have been toldanother senior cabinet minister has already made his deal and will beout soon.\n\nThe point is we're picking off elements around Gadhafi. The hopeis that he'll end up as the mayor of Tripoli. Is that a realistichope? Hard to say, but it's not -- I wouldn't rule that out asimpossible.\n\nAMANPOUR: Or a safe area around Benghazi for maybe 12 years likewe had with Saddam Hussein in Kuwait -- in Iraq rather.\n\nKRUGMAN: Well, the parallel with the Kurdish protection afterthe first Gulf war is a better parallel. And that was not ideal, butit was not such a terrible thing either.\n\nAMANPOUR: We have to go. Everybody, thank you very much. Andthis conversation continues in the Green Room. You can watch atabcnews.com/thisweek.\n\nAnd up next, we'll give you a tax season warning as we look atthe week ahead on ABC News. Electronic thieves may be after yourrefunds.\n\n(COMMERCIAL BREAK)\n\nAMANPOUR: And now here's a preview of what else you can expectcoming up on ABC News.\n\n(BEGIN VIDEOTAPE)\n\nAMANPOUR: Tomorrow, on Good Morning America, Bill Clinton takesa break from his globetrotting to talk about what he's been up torecently and why.\n\nBILL CLINTON, FORMER PRESIDENT OF THE UNITED STATES: And Iwanted to come here and see this.\n\nAMANPOUR: The former president with a full plate on Monday'sGMA.\n\nOn World News a new nightmare on top of the old. Getting yourtaxes done is bad enough, but now there are crooks involved.\n\nUNIDENTIFIED FEMALE; I went into a panic. I went into anabsolute panic.\n\nAMANPOUR: Someone stole her identity in order to steal herrefund. What to watch out for on World News.\n\n(END VIDEOTAPE)\n\nAMANPOUR: Nightline will closely focusing on Libya over the nextseveral days. And I'll following developments with you on Twitter, myFacebook page and on ABCnews.com. I'll see you online and here againnext Sunday on This Week. Thank you for joining us.", "images": ["https://s.abcnews.com/images/Politics/uvalde-1-gty-er-221007_1665161778549_hpMain_1x1_144.jpg", "https://s.abcnews.com/assets/dtci/images/placeholders/16_9.svg", "https://s.abcnews.com/images/US/3-las-vegas-maris-mareen-digiovanni-w-01-ht-iwb-21007_1665148297878_hpMain_1x1_144.jpg", "https://s.abcnews.com/images/US/jasleen-kaur-jasdeep-singh-aroohi-dheri-kidnapped-w-calif-01-ht-iwb-21004_1664891727921_hpMain_1x1_144.jpg", "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "https://s.abcnews.com/images/Politics/trump-white-house-oval-office-gty-jt-221004_1664919462010_hpMain_1x1_144.jpg", "https://s.abcnews.com/images/US/Uvalde-Crimson-Sanchez-01-ht-llr-221006_1665081913151_hpMain_2_1x1_144.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "keywords": [], "authors": ["Abc News"], "canonical_link": "https://abcnews.go.com/ThisWeek/week-transcript-gen-jim-jones-ret/story?id=13285705", "title": "'This Week' Transcript: Gen. Jim Jones (Ret.)", "meta_data": {"description": "Transcript of 'This Week' interviews with Gen. Jim Jones (Ret.)", "keywords": "this week, libya, afghanistan, jim jones", "copyright": "2022 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "'This Week' Transcript: Gen. Jim Jones (Ret.)", "og": {"site_name": "ABC News", "url": "https://abcnews.go.com/ThisWeek/week-transcript-gen-jim-jones-ret/story?id=13285705", "title": "'This Week' Transcript: Gen. Jim Jones (Ret.)", "description": "Transcript of 'This Week' interviews with Gen. Jim Jones (Ret.)", "image": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2011-04-03T16:53:08Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/prism-story,13285705", "ipad": "abcnewsipad://link/prism-story,13285705", "googleplay": "https://abcnews.go.com/ThisWeek/week-transcript-gen-jim-jones-ret/story?id=13285705"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "'This Week' Transcript: Gen. Jim Jones (Ret.)", "description": "Transcript of 'This Week' interviews with Gen. Jim Jones (Ret.)", "url": "https://abcnews.go.com/ThisWeek/week-transcript-gen-jim-jones-ret/story?id=13285705", "image": {"identifier": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/prism-story,13285705", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/prism-story,13285705", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/ThisWeek/week-transcript-gen-jim-jones-ret/story?id=13285705", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/ThisWeek/week-transcript-gen-jim-jones-ret/story?id=13285705"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "http://abcnews.go.com", "summary": ""}