{"url": "https://www.usatoday.com/story/life/music/2018/10/07/kanye-west-quits-twitter-again-after-trump-rant-slavery-remarks/1559093002/", "text": "Kanye West quits social media (again), after Trump rant and inflammatory slavery remarks\n\nShow Caption Hide Caption 'Saturday Night Live' takes on Brett Kavanaugh and Kanye \"Saturday Night Live\" got right back to hot-button politics in its second episode of the season. Wochit\n\nKanye West is through sharing – for now, anyway.\n\nAfter a peculiar week that included a pro-Trump rant and head-scratching tweets about abolishing the constititutional amendment that prohibits slavery, the rapper has apparently shut down his Twitter and Instagram accounts.\n\nUSA TODAY has reached out to West's representative for comment.\n\nIt isn't the first time that West, 41, who also announced that he was changing his name to \"Ye,\" has opted out of social media. He previously abandoned Twitter for the better part of a year, but returned this past April with a vengeance.\n\nThe hiatus kicks in as fans await his new \"Yandhi\" album, which had been expected for release last weekend, when the star appeared on \"Saturday Night Live\" dressed as a singing Perrier bottle. Last Monday, his wife, Kim Kardashian, announced the album is delayed until Nov. 23.\n\nMore 'SNL': 'Pete Davidson rips Kanye West's 'wrong' pro-Trump rant\n\nRelated: Kanye performs as a Perrier bottle; Twitter has thoughts\n\nMore: Celebs react to Kanye West's pro-Trump, anti-13th Amendment rant\n\nWest made waves as he wrapped up his appearance on Sept. 29's season premiere of “SNL” appearance. He donned a red “Make America Great Again” hat and launched into a rambling rant in defense of President Donald Trump. The impromptu speech was captured by Chris Rock, who posted it to social media.\n\n\"Black man in America, supposed to keep what you’re feeling inside right now,” West sang softly. “All those Democrats. You know, it’s like the plan they did, uh, to take their fathers out the home and promote welfare. Does anybody know about that? That’s a Democratic plan.”\n\n'Saturday Night Live' unloads on Brett Kavanaugh in season premiere From Matt Damon to Kanye West, SNL's season premiere was full of moments to keep fans talking. USA TODAY\n\nIn another video circulated on Twitter by hip-hop producer Mike Dean, West suggested the show’s producers didn’t want him to wear the MAGA hat on stage. \"They bullied me backstage. They said, 'Don't go out there with that hat on.' \"\n\nWest noted that white people ask him, “ ‘How could you like Trump, he’s racist’? Well, uh, if I was concerned about racism I would’ve moved out of America a long time ago.”\n\n“We need to have dialogue, not a diatribe,” West said, claiming that 90 percent of the news media, the TV industry, rappers and musicians are liberal. “It’s easy to make it seem like it’s so, so, so one-sided.”\n\n\"SNL\" cast member Pete Davidson responded during Saturday's show, denying that West was told to leave the hat backstage. \"He wore it all week. No one told him not to wear it,\" Davidson said. \"I wish I bullied him. I wish I had suggested it might upset people. Like your wife, or every black person ever.\"\n\nWest was blasted by celebrities including Chris Evans and Whoopi Goldberg when he resumed the discussion the next day, tweeting a photo of himself again wearing his red baseball cap and suggested abolishing the 13th Amendment, which outlaws slavery.\n\n\"This represents good and America becoming whole again,\" he wrote. \"We will no longer outsource to other countries. We build factories here in America and create jobs. We will provide jobs for all who are free from prisons as we abolish the 13th amendment. Message sent with love\"\n\nHe later clarified those remarks: \"The 13th Amendment is slavery in disguise,\" he noted, \"meaning it never ended.\"", "images": ["https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "http://www.gannett-cdn.com/-mm-/a4cbf876f00d63e276ae7e7e5b33172af693ec14/c=0-59-1144-705&r=1280x720/local/-/media/2018/09/30/USATODAY/USATODAY/636739163587315754-Screen-Shot-2018-09-30-at-2.58.43-PM.jpg", "https://www.gannett-cdn.com/presto/2018/09/08/USAT/c27848f7-d69d-441d-8e3a-bafbc2b985b2-GTY_1028930658.jpg?auto=webp&crop=3999,2240,x0,y159&format=pjpg&width=1200", "https://media.gannett-cdn.com/29906170001/29906170001_5845584768001_5845582984001-vs.jpg?pubId=29906170001", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/presto/2018/09/08/USAT/c27848f7-d69d-441d-8e3a-bafbc2b985b2-GTY_1028930658.jpg?auto=webp&crop=3999,2240,x0,y159&format=pjpg&width=1200", "keywords": [], "authors": ["Kim Willis"], "canonical_link": "https://www.usatoday.com/story/life/music/2018/10/07/kanye-west-quits-twitter-again-after-trump-rant-slavery-remarks/1559093002/", "title": "Kanye West quits social media (again), after Trump rant and inflammatory slavery remarks", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/music/2018/10/07/kanye-west-quits-twitter-again-after-trump-rant-slavery-remarks/1559093002/life/music", "theme-color": "#ffffff", "og": {"type": "article", "title": "Kanye West quits social media (again), after Trump rant and inflammatory slavery remarks", "description": "Kanye West is through sharing – for now, anyway. After a controversial week, the rapper has apparently shut down his Twitter and Instagram accounts.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/presto/2018/09/08/USAT/c27848f7-d69d-441d-8e3a-bafbc2b985b2-GTY_1028930658.jpg?auto=webp&crop=3999,2240,x0,y159&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "Kanye West is through sharing – for now, anyway. After a controversial week, the rapper has apparently shut down his Twitter and Instagram accounts.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1538866800.0, "source": "https://www.usatoday.com", "summary": ""}