{"url": "https://www.billboard.com/articles/columns/pop/8252348/fifth-harmony-break-why-hiatus-not-split", "text": "Pop groups going on hiatus is kind of like when your married friends say they’re doing a trial separation: Chances are they’re done, but without making it official, they can leave the door open to a potential reconciliation. In particular, boy bands and girl groups seem more often than not to announce that they’re going on “hiatus,” rather than breaking up for good, when revealing their initial split.\n\nBut why not just end it?\n\n“It is smart,” veteran publicist Diana Baron tells Billboard about the strategy. “It gives them them some cushion to see if each can succeed individually. And importantly, it avoids fan hysteria about who is at fault and the negativity that arises as fans pick a foil for a breakup.”\n\nThe latest group to test the solo waters is Fifth Harmony, who revealed to the Harmonizer nation on Monday morning (March 19) that they are taking a hiatus in order to focus on solo projects and personal growth. “After six years going hard, non stop, we also realized that in order to stay authentic to ourselves and to you, we do need to take some time for now to go on hiatus from Fifth Harmony in order to pursue solo endeavors,” the group wrote in a statement.\n\nRelated Fifth Harmony Announce Hiatus to Pursue Solo Careers\n\n5H kept it very positive, saying they were excited and grateful to take the time to “grow creatively and really find our footing as individuals. In doing this we are allowing ourselves to gain new experiences, strengths and perspectives that we can bring back to our Fifth Harmony family.” At press time there was no further information on how long the hiatus might last. In taking this career turn, 5H’s remaining members — Ally Brooke, Normani, Dinah Jane and Lauren Jauregui, with former fifth member Camila Cabello having already left the group in late 2016 — follow in the footsteps of One Direction and *NSYNC, who announced their own ongoing hiatuses in, respectively, 2016 and 2002.\n\nWhile the post-hiatus plan is always to put a pin in it and come back years down the line, for most groups the status is frequently permanent. One Direction have kept the door open even though all four members have released solo material to varying degrees of success and, it was reported last month by BBC News that the group’s touring company, Rollcall Touring LTD., has closed up shop, dealing another strike to hopes of a reunion.\n\nSimilarly, though groups such as *NSYNC and Destiny’s Child have staged one-off reunions over the years on special occasions, the supernova careers of their respective leaders — Justin Timberlake and Beyoncé — make it unlikely that a full-on reunion will transpire in the near future.\n\nThere is no legal reason, per se, for groups to announce a hiatus versus a break up, and acts don’t typically legally dissolve their agreements when they take a pause due to ongoing business related to merchandise and the collection of royalties and publishing. Though they’ve been on a break for decades, bands such as R.E.M., Led Zeppelin and Pink Floyd continue to bring in a reliable revenue without touring or recording, with an option to reboot the machine always lingering in the background.\n\nA music business attorney who requested anonymity tells Billboard that regardless of the reason for the hiatus, whenever new groups sign deals with labels there is always a “leaving member” provision that makes room for the possibility that an artist can leave the group, or that everyone might split. But that doesn’t mean their label’s rights to their individual services, or future services, ends. “The leaving member provision makes it so the label is entitled to whatever solo career they may pursue,” the lawyer says, adding that the label has the option to pursue a deal with the suddenly solo artist or not.\n\nEither way, the attorney says taking a hiatus is not a way to get out of a recording contract. “If you break up and never get back together again then the label can’t force you into the studio to make another album,” the lawyer says.\n\nKen Weinstein, co-founder of Big Hassle Media, gives the perfect example of why saying you’re breaking up is sometimes a trap. “Speaking as a huge fan of The Who, they announce that they’re doing their final tour before they hit the road, so you think, ‘Shit, I have to see the band!’ Which will, of course, help sell tickets. But then I got angry when they kept coming back,” he tells Billboard of the Rock Hall of Fame duo’s numerous final swings.\n\nThe savvy groups, Weinstein says, know that it’s best to never say never: “Why plague yourself by saying, ‘I will never do this again,’ and then have to live by that? An indefinite hiatus leaves room for whatever you want to do later because maybe you want to come back and work with these people again. Life is long and there are always possibilities.”\n\nAs a first-hand example, Weinstein points to two of his current artists, Heartless Bastards founder Erica Wennerstrom and Gaslight Anthem singer Brian Fallon. The latter is on the road promoting his solo album Sleepwalkers, while Gaslight is on hiatus, though Fallon never said the group was done for good. In fact, they are playing more than a dozen dates this summer at which they’ll celebrate the 10th anniversary of their landmark The ’59 Sound album in its entirety.\n\n“Brian is following his muse wherever that goes, and now it’s leading him to write solo records. But Brian and the guys are totally comfortable celebrating their amazing album, because it’s brought so much joy to so many people,” Weinstein says. “They never had the albatross of, ‘Hey, we’re breaking up so we can’t come back.'”\n\nSimilarly, Wennerstrom, the only consistent member of Heartless Bastards, began writing songs last year that spoke more directly to her, so she recorded the solo album Sweet Unknown, which is due out on Friday (March 23). “There’s a difference between what a Heartless Bastards and an Erica song is, and she wasn’t sure certain songs she was writing belonged to the band,” Weinstein says.\n\nSometimes it feels like you’ve reached that door-slamming, “I never want to see you again” moment in your band’s career and you think there’s no way to bring it all back home again. But if we’re being honest, a lot of groups who’ve staged farewell tours, announced final albums or said they were done for good — like Smashing Pumpkins recently, or LCD Soundsystem — have come back for reunion tours and albums. Maybe the women of 5H just need a bit of time to live their lives and find some new inspiration they can bring back with them to their “Fifth Harmony family.”", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=204652553202666&ev=PageView&noscript=1", "https://www.billboard.com/wp-content/uploads/media/fifth-harmony-vmas-press-room-2017-billboard-1548.jpg?w=1024", "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/public/lazyload-fallback.gif"], "top_img": "https://www.billboard.com/wp-content/uploads/media/fifth-harmony-vmas-press-room-2017-billboard-1548.jpg?w=1024", "keywords": [], "authors": ["Gil Kaufman"], "canonical_link": "https://www.billboard.com/pro/fifth-harmony-break-why-hiatus-not-split/", "title": "Fifth Harmony’s Break: Why Do Bands Go on ‘Hiatus’ Instead of Calling it Quits?", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/icons/icon-144x144.png", "msapplication-TileColor": "#eff4ff", "description": "To break up or go on hiatus? That is the question.", "news_keywords": "bbnews", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "billboard", "pmc-page_type": "single-billboard_pro_post", "articleid": 8252348, "pmc-category": "Music,Pop", "pmc-over_1_year": "yes", "pmc-post_type": "billboard_pro_post", "recs": {"publishtime": "2018-03-21T13:50:07"}, "pmc-tag": "bbnews", "title": "Fifth Harmony’s Break: Why Do Bands Go on ‘Hiatus’ Instead of Calling it Quits?", "pageclass": "article", "pmc-is_free": "no", "pmc-always-paywall": "no", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-exclusive": "no", "pmc-breaking-news": "no", "pmc-prime": "no"}, "generator": "WordPress 6.0.2", "author": "Gil Kaufman", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Billboard", "application-name": "Billboard", "content_type": "Pro Article", "post_id": 8252348, "title": "Fifth Harmony's Break: Why Do Bands Go on 'Hiatus' Instead of Calling it Quits?", "published_at": "2018-03-21 13:50:07", "image": "https://www.billboard.com/wp-content/uploads/media/fifth-harmony-vmas-press-room-2017-billboard-1548.jpg?w=1024", "comment_count": 0, "tags": "bbnews", "topics": "Pop", "body": "Pop groups going on hiatus is kind of like when your married friends say they're doing a trial separation: Chances are they're done, but without making it official, they can leave the door open to a potential reconciliation. In particular, boy bands and girl groups seem more often than not to announce that they're going on \"hiatus,\" rather than breaking up for good, when revealing their initial split. But why not just end it?\"It is smart,\" veteran publicist Diana Baron tells Billboard about the strategy. \"It gives them them some cushion to see if each can succeed individually. And importantly, it avoids fan hysteria about who is at fault and the negativity that arises as fans pick a foil for a breakup.\"The latest group to test the solo waters is Fifth Harmony, who revealed to the Harmonizer nation on Monday morning (March 19) that they are taking a hiatus in order to focus on solo projects and personal growth. \"After six years going hard, non stop, we also realized that in order to stay authentic to ourselves and to you, we do need to take some time for now to go on hiatus from Fifth Harmony in order to pursue solo endeavors,\" the group wrote in a statement.5H kept it very positive, saying they were excited and grateful to take the time to \"grow creatively and really find our footing as individuals. In doing this we are allowing ourselves to gain new experiences, strengths and perspectives that we can bring back to our Fifth Harmony family.\" At press time there was no further information on how long the hiatus might last. In taking this career turn, 5H's remaining members -- Ally Brooke, Normani, Dinah Jane and Lauren Jauregui, with former fifth member Camila Cabello having already left the group in late 2016 -- follow in the footsteps of One Direction and *NSYNC, who announced their own ongoing hiatuses in, respectively, 2016 and 2002. While the post-hiatus plan is always to put a pin in it and come back years down the line, for most groups the status is frequently permanent. One Direction have kept the door open even though all four members have released solo material to varying degrees of success and, it was reported last month by BBC News that the group's touring company, Rollcall Touring LTD., has closed up shop, dealing another strike to hopes of a reunion.Similarly, though groups such as *NSYNC and Destiny's Child have staged one-off reunions over the years on special occasions, the supernova careers of their respective leaders -- Justin Timberlake and Beyoncé -- make it unlikely that a full-on reunion will transpire in the near future.There is no legal reason, per se, for groups to announce a hiatus versus a break up, and acts don't typically legally dissolve their agreements when they take a pause due to ongoing business related to merchandise and the collection of royalties and publishing. Though they've been on a break for decades, bands such as R.E.M., Led Zeppelin and Pink Floyd continue to bring in a reliable revenue without touring or recording, with an option to reboot the machine always lingering in the background.A music business attorney who requested anonymity tells Billboard that regardless of the reason for the hiatus, whenever new groups sign deals with labels there is always a \"leaving member\" provision that makes room for the possibility that an artist can leave the group, or that everyone might split. But that doesn't mean their label's rights to their individual services, or future services, ends. \"The leaving member provision makes it so the label is entitled to whatever solo career they may pursue,\" the lawyer says, adding that the label has the option to pursue a deal with the suddenly solo artist or not. Either way, the attorney says taking a hiatus is not a way to get out of a recording contract. \"If you break up and never get back together again then the label can't force you into the studio to make another album,\" the lawyer says.Ken Weinstein, co-founder of Big Hassle Media, gives the perfect example of why saying you're breaking up is sometimes a trap. \"Speaking as a huge fan of The Who, they announce that they're doing their final tour before they hit the road, so you think, 'Shit, I have to see the band!' Which will, of course, help sell tickets. But then I got angry when they kept coming back,\" he tells Billboard of the Rock Hall of Fame duo's numerous final swings.The savvy groups, Weinstein says, know that it's best to never say never: \"Why plague yourself by saying, 'I will never do this again,' and then have to live by that? An indefinite hiatus leaves room for whatever you want to do later because maybe you want to come back and work with these people again. Life is long and there are always possibilities.\"As a first-hand example, Weinstein points to two of his current artists, Heartless Bastards founder Erica Wennerstrom and Gaslight Anthem singer Brian Fallon. The latter is on the road promoting his solo album Sleepwalkers, while Gaslight is on hiatus, though Fallon never said the group was done for good. In fact, they are playing more than a dozen dates this summer at which they'll celebrate the 10th anniversary of their landmark The '59 Sound album in its entirety.\"Brian is following his muse wherever that goes, and now it's leading him to write solo records. But Brian and the guys are totally comfortable celebrating their amazing album, because it's brought so much joy to so many people,\" Weinstein says. \"They never had the albatross of, 'Hey, we're breaking up so we can't come back.'\" Similarly, Wennerstrom, the only consistent member of Heartless Bastards, began writing songs last year that spoke more directly to her, so she recorded the solo album Sweet Unknown, which is due out on Friday (March 23). \"There's a difference between what a Heartless Bastards and an Erica song is, and she wasn't sure certain songs she was writing belonged to the band,\" Weinstein says. Sometimes it feels like you've reached that door-slamming, \"I never want to see you again\" moment in your band's career and you think there's no way to bring it all back home again. But if we're being honest, a lot of groups who've staged farewell tours, announced final albums or said they were done for good -- like Smashing Pumpkins recently, or LCD Soundsystem -- have come back for reunion tours and albums. Maybe the women of 5H just need a bit of time to live their lives and find some new inspiration they can bring back with them to their \"Fifth Harmony family.\"", "fb": {"pages": 75791669580}, "fragment": "!", "og": {"type": "article", "title": "Fifth Harmony’s Break: Why Do Bands Go on ‘Hiatus’ Instead of Calling it Quits?", "url": "https://www.billboard.com/pro/fifth-harmony-break-why-hiatus-not-split/", "description": "To break up or go on hiatus? That is the question.", "site_name": "Billboard", "image": {"identifier": "https://www.billboard.com/wp-content/uploads/media/fifth-harmony-vmas-press-room-2017-billboard-1548.jpg?w=1024", "width": 1024, "height": 677, "alt": "Fifth Harmony"}, "locale": "en_US"}, "article": {"published_time": "2018-03-21T17:50:07+00:00", "modified_time": "2018-03-21T20:52:29+00:00"}, "twitter": {"site": "@billboard", "card": "summary_large_image", "title": "Fifth Harmony’s Break: Why Do Bands Go on ‘Hiatus’ Instead of Calling it Quits?", "description": "To break up or go on hiatus? That is the question.", "image": "https://www.billboard.com/wp-content/uploads/media/fifth-harmony-vmas-press-room-2017-billboard-1548.jpg?w=1024"}}, "movies": [], "publish_date": 1521654607.0, "source": "https://www.billboard.com", "summary": ""}