{"url": "https://en.wikipedia.org/wiki/Bruce_Willis", "text": "American actor (born 1955)\n\nWalter Bruce Willis (born March 19, 1955) is an American actor. His career began on the off-Broadway stage in the 1970s.[1] He achieved fame with a leading role on the comedy-drama series Moonlighting (1985–1989) and appeared in over a hundred films, gaining recognition as an action hero after his portrayal of John McClane in the Die Hard franchise (1988–2013) and other roles.[2][3]\n\nWillis's other credits include The Last Boy Scout (1991), Death Becomes Her (1992), Pulp Fiction (1994), 12 Monkeys (1995), The Fifth Element (1997), Armageddon (1998), The Sixth Sense (1999), Unbreakable (2000), Sin City (2005), Moonrise Kingdom (2012), and Looper (2012). In the later years of his career, Willis starred in many low-budget direct-to-video films, which were poorly received. In March 2022, Willis's family announced that he was retiring after being diagnosed with aphasia, which affects language cognition.\n\nAs a singer, Willis released his debut album, The Return of Bruno, in 1987, followed by two more albums in 1989 and 2001. He made his Broadway debut in the stage adaptation of Misery in 2015. Willis has received various accolades throughout his career, including a Golden Globe Award, two Primetime Emmy Awards, and two People's Choice Awards. He received a star on the Hollywood Walk of Fame in 2006. Films featuring Willis have grossed between US$2.64 billion and $3.05 billion at North American box offices, making him in 2010 the eighth-highest-grossing actor in a leading role.\n\nEarly life\n\nWalter Bruce Willis[4] was born in Idar-Oberstein, West Germany, on March 19, 1955.[5][6] His mother, Marlene,[7] was German, from Kassel.[5] His father, David Willis, was an American soldier. Willis has a younger sister, Florence, and two younger brothers, Robert (deceased) and David.[8] After being discharged from the military in 1957, his father relocated the family to his hometown of Carneys Point, New Jersey.[9] Willis has described his background as a \"long line of blue-collar people\".[9] His mother worked in a bank and his father was a welder, master mechanic, and factory worker.[4]\n\nWillis, who spoke with a stutter,[9] attended Penns Grove High School, where his schoolmates nicknamed him \"Buck-Buck\".[4][10][11] He joined the drama club, found that acting on stage reduced his stutter, and was eventually elected student council president.[4]\n\nAfter graduating from high school in 1973, Willis worked as a security guard at the Salem Nuclear Power Plant[12][13] and transported crew members at the DuPont Chambers Works factory in Deepwater, New Jersey.[13] After working as a private investigator (a role he would later play in the comedy-drama series Moonlighting and the action-comedy film The Last Boy Scout), he turned to acting. He enrolled in the Drama Program at Montclair State University,[14] where he was cast in a production of Cat on a Hot Tin Roof. He left school in 1977 and moved to New York City, where he supported himself in the early 1980s as a bartender at the Manhattan art bar Kamikaze[15][16] while living in the Hell's Kitchen neighborhood.[17]\n\nCareer\n\n1980s: Die Hard and rise to fame\n\nWillis was cast as David Addison Jr. of the television series Moonlighting (1985–1989), competing against 3,000 other actors for the position.[18] His starring role in Moonlighting, opposite Cybill Shepherd, helped to establish him as a comedic actor. During the show's five seasons, he won an Emmy Award for Outstanding Lead Actor in a Drama Series and a Golden Globe Award for Best Actor - Television Series Musical or Comedy.[9] During the height of the show's success, beverage maker Seagram hired Willis as the pitchman for their Golden Wine Cooler products.[19] The advertising campaign paid Willis between $5 and 7 million over two years. Willis chose not to renew his contract when he decided to stop drinking alcohol in 1988.[20]\n\nWillis had his first lead role in a feature film in the 1987 Blake Edwards film Blind Date, with Kim Basinger and John Larroquette.[9] Edwards cast him again to play the real-life cowboy actor Tom Mix in Sunset (1988). However, it was his unexpected turn in the film Die Hard (1988) as John McClane that catapulted him to movie star and action hero status.[9] He performed most of his own stunts in the film,[21] and the film grossed $138,708,852 worldwide.[22] Following his success with Die Hard, Willis had a leading role in the drama In Country as Vietnam veteran Emmett Smith and also provided the voice for a talking baby in Look Who's Talking (1989) and the sequel Look Who's Talking Too (1990).[citation needed]\n\nIn the late 1980s, Willis enjoyed moderate success as a recording artist, recording an album of pop-blues, The Return of Bruno, which included the hit single \"Respect Yourself\" featuring the Pointer Sisters.[23] The LP was promoted by a Spinal Tap–like rockumentary parody featuring scenes of Willis performing at famous events including Woodstock. He released a version of the Drifters song \"Under the Boardwalk\" as a second single; it reached No. 2 on the UK Singles Chart, but was less successful in the US. Willis returned to the recording studio several times.[24]\n\n1990s: Die Hard sequels, Pulp Fiction and dramatic roles\n\nHaving acquired major personal success and pop culture influence playing John McClane in Die Hard, Willis reprised his role in the sequels Die Hard 2 (1990) and Die Hard with a Vengeance (1995).[9] These first three installments in the Die Hard series grossed over US$700 million internationally and propelled Willis to the first rank of Hollywood action stars.[citation needed]\n\nIn the early 1990s, Willis's career suffered a moderate slump, as he starred in flops such as The Bonfire of the Vanities (1990) and Hudson Hawk (1991), although he did find box office success with The Last Boy Scout. He gained more success with Striking Distance (1993) but flopped again with Color of Night (1994): it was savaged by critics but did well in the home video market and became one of the Top 20 most-rented films in the United States in 1995.[25] Maxim also ranked his sex scene in the film as the best in film history.[26]\n\nIn 1994, Willis also had a leading role in one part of Quentin Tarantino's acclaimed Pulp Fiction;[9] the film's success gave a boost to his career, and he starred alongside his Look Who's Talking co-star John Travolta.[27] In 1996, he was the executive producer and star of the cartoon Bruno the Kid which featured a CGI representation of himself.[28] That same year, he starred in Mike Judge's animated film Beavis and Butt-head Do America with his then-wife Demi Moore. In the movie, he plays a drunken criminal named \"Muddy Grimes\", who mistakenly sends Judge's titular characters to kill his wife, Dallas (voiced by Moore). He then played the lead roles in 12 Monkeys (1995) and The Fifth Element (1997). However, by the end of the 1990s his career had fallen into another slump with critically panned films like The Jackal (which despite negative reviews was a box office hit), Mercury Rising, and Breakfast of Champions, as well as the implosion of the production of Broadway Brawler, a debacle salvaged only by the success of the Michael Bay-directed Armageddon, which Willis had agreed to star in as compensation for the failed production, and which turned out to be the highest-grossing film of 1998 worldwide.[29][30] The same year his voice and likeness were featured in the PlayStation video game Apocalypse.[31] In 1999, Willis played the starring role in M. Night Shyamalan's film The Sixth Sense, which was both a commercial and critical success.[9]\n\n2000s\n\nWillis after a ceremony where he was named Hasty Pudding Theatrical's Man of the Year in 2002\n\nIn 2000, Willis won an Emmy[32] for Outstanding Guest Actor in a Comedy Series for his work on Friends (in which he played the father of Ross Geller's much-younger girlfriend).[33] He was also nominated for a 2001 American Comedy Award (in the Funniest Male Guest Appearance in a TV Series category) for his work on Friends. Also in 2000, Willis played Jimmy \"The Tulip\" Tudeski in The Whole Nine Yards alongside Matthew Perry. Willis was originally cast as Terry Benedict in Ocean's Eleven (2001) but dropped out to work on recording an album.[34] In the sequel, Ocean's Twelve (2004), he makes a cameo appearance as himself. In 2005, he appeared in the film adaptation of Sin City. In 2006, he lent his voice as RJ the Raccoon in Over the Hedge. In 2007, he appeared in the Planet Terror half of the double feature Grindhouse as the villain, a mutant soldier. This marked Willis's second collaboration with director Robert Rodriguez, following Sin City.\n\nWillis appeared on the Late Show with David Letterman several times throughout his career. He filled in for an ill David Letterman on his show February 26, 2003, when he was supposed to be a guest.[35] On many of his appearances on the show, Willis staged elaborate jokes, such as wearing a day-glo orange suit in honor of the Central Park gates, having one side of his face made up with simulated birdshot wounds after the Harry Whittington shooting, or trying to break a record (a parody of David Blaine) of staying underwater for only twenty seconds.\n\nOn April 12, 2007, he appeared again, this time wearing a Sanjaya Malakar wig.[36] On his June 25, 2007, appearance, he wore a mini-wind turbine on his head to accompany a joke about his own fictional documentary titled An Unappealing Hunch (a wordplay on An Inconvenient Truth).[37] Willis also appeared in Japanese Subaru Legacy television commercials.[38] Tying in with this, Subaru did a limited run of Legacys, badged \"Subaru Legacy Touring Bruce\", in honor of Willis.\n\nWillis has appeared in five films with Samuel L. Jackson (National Lampoon's Loaded Weapon 1, Pulp Fiction, Die Hard with a Vengeance, Unbreakable, and Glass) and both actors were slated to work together in Black Water Transit, before dropping out. Willis also worked with his eldest daughter, Rumer, in the 2005 film Hostage. In 2007, he appeared in the thriller Perfect Stranger, opposite Halle Berry, the crime/drama film Alpha Dog, opposite Sharon Stone, and reprised his role as John McClane in Live Free or Die Hard. Subsequently, he appeared in the films What Just Happened and Surrogates, based on the comic book of the same name.[39]\n\nWillis was slated to play U.S. Army general William R. Peers in director Oliver Stone's Pinkville, a drama about the investigation of the 1968 My Lai massacre.[40] However, due to the 2007 Writers Guild of America strike, the film was cancelled. Willis appeared on the 2008 Blues Traveler album North Hollywood Shootout, giving a spoken word performance over an instrumental blues rock jam on the track \"Free Willis (Ruminations from Behind Uncle Bob's Machine Shop)\". In early 2009, he appeared in an advertising campaign to publicize the insurance company Norwich Union's change of name to Aviva.[41]\n\n2010s\n\nWillis starred with Tracy Morgan in the comedy Cop Out, directed by Kevin Smith, about two police detectives investigating the theft of a baseball card.[42] The film was released in February 2010. Willis appeared in the music video for the song \"Stylo\" by Gorillaz.[43] Also in 2010, he appeared in a cameo with former Planet Hollywood co-owners and '80s action stars Sylvester Stallone and Arnold Schwarzenegger in the film The Expendables. Willis played the role of generic bald man \"Mr. Church\". This was the first time these three notable action movie actors appeared on screen together. Although the scene featuring the three was short, it was one of the most highly anticipated scenes in the film. The trio filmed their scene in an empty church on October 24, 2009.[44] Willis next starred in RED, an adaptation of the comic book mini-series of the same name, in which he portrayed Frank Moses. The film was released on October 15, 2010.[45]\n\nWillis starred alongside Bill Murray, Edward Norton, and Frances McDormand in Moonrise Kingdom (2012). Filming took place in Rhode Island under the direction of Wes Anderson, in 2011.[46] Willis returned, in an expanded role, in The Expendables 2 (2012).[47] He appeared alongside Joseph Gordon-Levitt in the sci-fi action film Looper (2012), as the older version of Gordon-Levitt's character, Joe.\n\nWillis teamed up with 50 Cent in a film directed by David Barrett called Fire with Fire, starring opposite Josh Duhamel and Rosario Dawson, about a fireman who must save the love of his life.[48] Willis also joined Vince Vaughn and Catherine Zeta-Jones in Lay the Favorite, directed by Stephen Frears, about a Las Vegas cocktail waitress who becomes an elite professional gambler.[49] The two films were distributed by Lionsgate Entertainment.\n\nWillis reprised his most famous role, John McClane, for a fifth time, starring in A Good Day to Die Hard, which was released on February 14, 2013.[50] In an interview, Willis said, \"I have a warm spot in my heart for Die Hard..... it's just the sheer novelty of being able to play the same character over 25 years and still be asked back is fun. It's much more challenging to have to do a film again and try to compete with myself, which is what I do in Die Hard. I try to improve my work every time.\"[51]\n\nOn October 12, 2013, Willis hosted Saturday Night Live with Katy Perry as a musical guest.[52]\n\nIn 2015, Willis made his Broadway debut in William Goldman's adaptation of Stephen King's novel Misery opposite Laurie Metcalf at the Broadhurst Theatre. His performance was generally panned by critics, who called it \"vacant\" and \"inert\".[53] Willis was the subject of a roast by Comedy Central in a program broadcast on July 29, 2018.[54]\n\nFilms featuring Willis have grossed between US$2.64 billion and $3.05 billion at the North American box offices, making him in 2010 the eighth highest-grossing actor in a leading role and 12th-highest including supporting roles.[55][56] He is a two-time Emmy Award winner, a Golden Globe Award winner, and has been nominated for a Saturn Award four times.\n\n2020s: Critical decline, health problems and retirement\n\nIn 2020, Willis portrayed Doraemon for SoftBank 5G advertisements in Japan.[57][58] In January 2021, he was asked to leave a Los Angeles Rite Aid store for not wearing a mask to protect against COVID-19 during the pandemic in California.[59] Willis later said \"it was an error in judgement ... Be safe out there everyone and let's continue to mask up.\"[60]\n\nIn the later years of his career, Willis starred in many low-budget independent action-thriller and science fiction films. Described by Chris Nashawaty of Esquire as \"a profitable safe harbor for actors of a certain age\" similar to The Expendables, most of these films were released direct-to-video and were widely panned by critics.[61] For these projects, Willis would often earn $2 million for two days' work at an average of 15 minutes' screentime per film.[62] Twenty of these pictures were produced by Randall Emmett.[63] The films earned a \"toxic\" reputation for using Willis heavily in promotional materials but including him for minimal screen time,[64] so much that Cosmic Sin (2021) stood out for including Willis in \"roughly half\" of the action.[65]\n\nThose working with Willis on the films later said he appeared confused, did not understand why he was there, and had to be fed lines through an earpiece.[63] Days before Willis was scheduled to arrive on set for Out of Death (2021), the screenwriter was instructed to reduce his role and abbreviate his dialogue; at the same time, the director was told that he would have to complete all of Willis' scenes over one day of filming.[63] The Golden Raspberry Awards, an annual award for the year's worst films and performances, created a dedicated category, the Worst Bruce Willis Performance in a 2021 Movie, for his roles in eight films released that year.[66]\n\nOn March 30, 2022, Willis's family announced that he was retiring as he had been diagnosed with aphasia, a disorder caused by damage to the area of the brain that controls language expression and comprehension.[67] The Golden Raspberry Awards retracted its Willis category, saying it was inappropriate to award a Golden Raspberry to someone whose performance was affected by a medical condition.[68] At the time of his retirement, Willis had completed eight films awaiting release in 2022 and 2023.[67][69][70]\n\nBusiness activities\n\nWillis owns houses in Los Angeles and Penns Grove, New Jersey. He also rents apartments at Trump Tower[71] and in Riverside South, Manhattan.[72]\n\nIn 2000, Willis and his business partner Arnold Rifkin started a motion picture production company called Cheyenne Enterprises. He left the company to be run solely by Rifkin in 2007 after Live Free or Die Hard.[73] He also owns several small businesses in Hailey, Idaho, including The Mint Bar and The Liberty Theater and was one of the first promoters of Planet Hollywood, with actors Arnold Schwarzenegger and Sylvester Stallone.[74] Willis and the other actors were paid for their appearances and endorsements through an employee stock ownership plan.[75]\n\nIn 2009, Willis signed a contract to become the international face of Belvedere SA's Sobieski Vodka in exchange for 3.3% ownership in the company.[76]\n\nPersonal life\n\nWillis in June 2006\n\nWillis's acting role models are Gary Cooper, Robert De Niro, Steve McQueen, and John Wayne.[77] He is left-handed.[78] He resides in the Brentwood neighborhood of Los Angeles with his family.[79]\n\nRelationships and children\n\nAt the premiere for the film Stakeout, Willis met actress Demi Moore. They married on November 21, 1987, and had three daughters, including Rumer, who was born in August 1988.[80][81][82][83] Willis and Moore announced their separation on June 24, 1998.[84] They filed for divorce on October 18, 2000,[85] and the divorce was finalized later that day.[86][87] Regarding the divorce, Willis stated, \"I felt I had failed as a father and a husband by not being able to make it work.\" He credited actor Will Smith for helping him cope with the situation.[19] He has maintained a close friendship with both Moore and her subsequent husband, actor Ashton Kutcher, and attended their wedding.[88]\n\nWillis was engaged to actress Brooke Burns until they broke up in 2004 after 10 months together.[18] He married model Emma Heming in Turks and Caicos on March 21, 2009;[89] guests included his three daughters, as well as Moore and Kutcher. The ceremony was not legally binding, so the couple wed again in a civil ceremony in Beverly Hills six days later. The couple has two daughters, one born in 2012[90] and another born in 2014.[91]\n\nReligious views\n\nWillis was a Lutheran,[92] but no longer practices. In a July 1998 interview with George magazine, he stated: \"Organized religions in general, in my opinion, are dying forms. They were all very important when we didn't know why the sun moved, why weather changed, why hurricanes occurred, or volcanoes happened. Modern religion is the end trail of modern mythology. But there are people who interpret the Bible literally. Literally! I choose not to believe that's the way. And that's what makes America cool, you know?\"[93]\n\nPolitical views\n\nIn 1988, Willis and then-wife Demi Moore campaigned for Democratic Massachusetts Governor Michael Dukakis' Presidential bid. Four years later, he supported President George H. W. Bush for reelection and was an outspoken critic of Bill Clinton. However, in 1996, he declined to endorse Clinton's Republican opponent Bob Dole, because Dole had criticized Demi Moore for her role in the film Striptease.[94] Willis was an invited speaker at the 2000 Republican National Convention,[95] and supported George W. Bush that year. He did not make any contributions or public endorsements in the 2008 presidential campaign. In several June 2007 interviews, he declared that he maintains some Republican ideologies.[19]\n\nIn 2006, he said that the United States should intervene more in Colombia in order to end drug trafficking.[96] In several interviews Willis has said that he supports large salaries for teachers and police officers, and said he is disappointed in the United States foster care system as well as treatment of Native Americans.[94][97] Willis also stated that he is a supporter of gun rights, stating, \"Everyone has a right to bear arms. If you take guns away from legal gun owners, then the only people who have guns are the bad guys.\"[98]\n\nIn February 2006, Willis was in Manhattan to promote his film 16 Blocks with reporters. One reporter attempted to ask Willis about his opinion on the Bush administration, but was interrupted by Willis in mid-sentence when he said: \"I'm sick of answering this fucking question. I'm a Republican only as far as I want a smaller government, I want less government intrusion. I want them to stop shitting on my money and your money and tax dollars that we give 50 percent of every year. I want them to be fiscally responsible and I want these goddamn lobbyists out of Washington. Do that and I'll say I'm a Republican. I hate the government, OK? I'm apolitical. Write that down. I'm not a Republican.\"[99]\n\nWillis's name was in an advertisement in the Los Angeles Times on August 17, 2006, that condemned Hamas and Hezbollah and supported Israel in the 2006 Israel-Lebanon war.[100]\n\nMilitary interests\n\nThroughout his film career, Willis has depicted several military characters in films such as In Country, The Siege, Hart's War, Tears of the Sun, Grindhouse, and G.I. Joe: Retaliation. Growing up in a military family, Willis has publicly sold Girl Scout cookies for the United States armed forces. In 2002, Willis's then 8-year-old daughter, Tallulah, suggested that he purchase Girl Scout cookies to send to troops. Willis purchased 12,000 boxes of cookies, and they were distributed to sailors aboard USS John F. Kennedy and other troops stationed throughout the Middle East at the time.[101]\n\nIn 2003, Willis visited Iraq as part of the USO tour, singing to the troops with his band, The Accelerators.[102] Willis considered joining the military to help fight the second Iraq War, but was deterred by his age.[103] It was believed he offered $1 million to any noncombatant who turns in terrorist leaders Osama bin Laden, Ayman al-Zawahiri, or Abu Musab al-Zarqawi; in the June 2007 issue of Vanity Fair, however, he clarified that the statement was made hypothetically and not meant to be taken literally. Willis has also criticized the media for its coverage of the war, complaining that the press were more likely to focus on the negative aspects of the war:\n\nI went to Iraq because what I saw when I was over there was soldiers—young kids for the most part—helping people in Iraq; helping getting the power turned back on, helping get hospitals open, helping get the water turned back on and you don't hear any of that on the news. You hear, \"X number of people were killed today,\" which I think does a huge disservice. It's like spitting on these young men and women who are over there fighting to help this country.[104]\n\nIn popular culture\n\nIn 1996, Roger Director, a writer and producer from Moonlighting, wrote a roman à clef on Willis titled A Place to Fall.[105] Cybill Shepherd wrote in her 2000 autobiography, Cybill Disobedience, that Willis became angry at Director when he read the book and discovered the character had been written as a \"neurotic, petulant actor.\"\n\nA Lego version of himself appeared in the 2019 film The Lego Movie 2: The Second Part, with Willis providing the voice.[106]\n\nFilmography\n\nDiscography\n\nSolo albums\n\nCompilations/guest appearances\n\nAwards and honors\n\nWillis's star on the Hollywood Walk of Fame\n\nWillis has won a variety of awards and has received various honors throughout his career in television and film.", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Bruce_willis_cinedom.jpg/170px-Bruce_willis_cinedom.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Bruce_Willis_Walk_of_Fame.jpg/220px-Bruce_Willis_Walk_of_Fame.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cc/BruceWillis2002.jpg/220px-BruceWillis2002.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Sylvester_Stallone_%26_Bruce_Willis_%284840665852%29.jpg/220px-Sylvester_Stallone_%26_Bruce_Willis_%284840665852%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/59/ActorBruceWillis_Iraq.jpg/220px-ActorBruceWillis_Iraq.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/Impronte_di_Bruce_Willis_al_TCL_Chinese_Theatre_-_Los_Angeles_-_USA_-_agosto_2011.jpg/220px-Impronte_di_Bruce_Willis_al_TCL_Chinese_Theatre_-_Los_Angeles_-_USA_-_agosto_2011.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Bruce_Willis_by_Gage_Skidmore_3.jpg/220px-Bruce_Willis_by_Gage_Skidmore_3.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c6/BruceWillisLFDHpremiere07.jpg/170px-BruceWillisLFDHpremiere07.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Bruce_Willis_by_Gage_Skidmore_3.jpg/1200px-Bruce_Willis_by_Gage_Skidmore_3.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Bruce_Willis_1989.jpg/220px-Bruce_Willis_1989.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Bruce_Willis_by_Gage_Skidmore_3.jpg/1200px-Bruce_Willis_by_Gage_Skidmore_3.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Bruce_Willis", "title": "Bruce Willis", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Bruce_Willis_by_Gage_Skidmore_3.jpg/640px-Bruce_Willis_by_Gage_Skidmore_3.jpg", "width": 640, "height": 902}, "title": "Bruce Willis - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}