{"url": "www.travelandleisure.com/travel-news/jennifer-aniston-adam-sandler-filming-italy", "text": "There's nothing like an epic on-screen adventure to get you acquainted with some place new and dreaming up an enviable vacation itinerary. For me (and basically all my childhood friends), this first happened following a viewing of Disney's \"The Lizzie McGuire Movie\" back in 2003, when Hilary Duff's character traveled to Rome to live out every teen's parent-free European fantasy. Though I've graduated to more mature travel movies over the last 18 years, one thing hasn't changed: films with gorgeous backdrops give me an unruly case of wanderlust.\n\nFrom classics like \"Around the World in 80 Days\" and \"Roman Holiday\" to modern masterpieces such as \"Wild\" and \"Crazy Rich Asians,\" travel films tend to ignite a longing for freedom and excitement. Maybe it's the sight of beaches on your screen triggering a phenomenon known as Blue Mind, or maybe watching a couple of pals take to the open road for a life changing road trip just makes you want to feel unconfined. Whatever it is, sometimes a travel film is all you need to provoke that feeling. That's why we've rounded up, in no particular order, 34 of the best travel movies that inspire wanderlust. Maybe they'll be cause for a change of scenery — or maybe they'll incite the adventure of a lifetime.\n\n'Thelma & Louise' (1991)\n\nFotos International/Getty Images\n\nWidely regarded as one of the best road trip movies of all time, this buddy film follows best friends Thelma (Geena Davis) and Louise (Susan Sarandon) as they drive through the American Southwest after Louise kills a man in Arkansas.\n\n'The Holiday' (2006)\n\nA Hollywood movie trailer producer (Cameron Diaz) and a London reporter (Kate Winslet) decide to switch homes for a few weeks after finding out their respective boyfriends have been cheating on them. The results offer enough glamor shots of Los Angeles and cozy footage of England's countryside to make you want to pack up and head to either city immediately.\n\n'Crazy Rich Asians' (2018)\n\nCourtesy of Warner Bros. Entertainment Inc.\n\nThough this movie revolves around the conflict between New Yorker Rachel Chu (Constance Wu) and her boyfriend's wealthy family, \"Crazy Rich Asians\" could pass as a tourism film for Singapore. If the Southeast Asian country wasn't on your bucket list before, this film's dazzling shots of Singapore, specifically the acclaimed Marina Bay Sands Hotel, may convince you.\n\n'Wild' (2014)\n\nBased on a true story, \"Wild\" sees Cheryl Strayed (Reese Witherspoon) hike more than a thousand miles from California to Washington on the Pacific Crest Trail following her divorce and the death of her mother. On her journey, Cheryl treks through the Mojave Desert, the Sierra Nevada, and Mount Hood National Forest while reflecting on her life.\n\n'Eat Pray Love' (2010)\n\nMoviestore Collection Ltd / Alamy Stock Photo\n\nAfter her divorce, Elizabeth (Julia Roberts) sets off to explore the world with hopes of finding herself in the process. Elizabeth's inspiring and uplifting journey takes her — and viewers — to Italy, India, and Indonesia where she discovers the pleasure of nourishment, prayer, and romance.\n\n'La La Land' (2016)\n\nAdmittedly, this musical doesn't feature much traveling (save for a brief road trip to Mia's hometown in Nevada), but the dreamy, oversaturated shots of Los Angeles in nearly every scene are enough to make anyone want to book a flight to the City of Angels.\n\n'Before Sunrise' (1995)\n\nCastle Rock Entertainment/Getty Images\n\nTwo strangers meet aboard a train from Budapest. Jesse (Ethan Hawke) is hoping to catch a flight home to the United States while Céline (Julie Delpy) is en route to Paris. Instead of sticking to their plans, the two disembark in Vienna and spend the entire night exploring the city and falling in love. A viewing of this movie will leave you longing for an epic adventure in the picturesque Austrian capital.\n\n'National Lampoon’s Vacation' (1983)\n\nNational Lampoon's classic comedy series is now six films strong, but it was 1983's \"Vacation\" that started it all. Unlike the franchise's most famous film, \"Christmas Vacation,\" the original movie sees the Griswolds actually hit the road for a trip to Walley World, an amusement park several states away. After you watch Chevy Chase's hilarious hijinks unfold in this film, let sequels \"European Vacation\" and \"Vegas Vacation\" inspire further travels.\n\n'The Darjeeling Limited' (2007)\n\nAA Film Archive / Alamy Stock Photo\n\nAfter the death of their father, three estranged brothers (Owen Wilson, Adrien Brody, and Jason Schwartzman) decide to hop aboard a train in India called The Darjeeling Limited to reconnect and experience spiritual self-discovery. Viewers catch glimpses of the Indian countryside, Hindu temples, and eventually the Himalayas — but not without a few jokes along the way.\n\n'Up' (2009)\n\nArguably the most heart-wrenching animated film of all time, \"Up\" earns a spot on our list thanks to adorably grumpy widower Carl Fredricksen's determination to fulfill his own wanderlust. With the help of thousands of balloons and a young sidekick named Russell, Carl and his house soar across the world on an incredible journey that culminates at Paradise Falls (based on Angel Falls in Venezuela).\n\n'Raiders of the Lost Ark' (1981)\n\nCBS via Getty Images\n\n\"Raiders\" kicks off the iconic Indiana Jones series with a quest to find the fabled Ark of the Covenant. On his journey, Indy (Harrison Ford) makes stops in Nepal, Egypt, and the Aegean Sea, and, of course, famously runs from a giant rolling boulder in a temple in Peru. Follow up this film with its sequels, \"Temple of Doom\" (1984), \"Last Crusade\" (1989), and \"Kingdom of the Crystal Skull\" (2008), to see Indy travel to Jordan, the Amazon jungle, and beyond.\n\n'Mamma Mia!' (2008)\n\nFew movies offer the kind of gorgeously colorful beach imagery \"Mamma Mia!\" and its 2018 sequel, \"Mamma Mia! Here We Go Again\" provide. If you haven't seen the films, you likely know them as \"the movies with all the ABBA songs.\" But if you have seen them, you know they're actually about three men who travel to the impossibly beautiful, albeit fictional, Greek island of Kalokairi, each believing they're the father of a young bride-to-be.\n\n'Nomadland' (2020)\n\nCourtesy of Searchlight Pictures\n\nAfter losing her job in the town of Empire, Nevada, Fern (Frances McDormand) decides to sell her belongings, buy a van, and drive across the country working odd jobs. Fern travels through deserts, small towns, and nomad communes where she works, makes new friends, and learns about life. If you've ever fantasized about dropping everything and taking to the open road, \"Nomadland\" will probably either convince or deter you.\n\n'Romancing the Stone' (1984)\n\nWhen New York City-based romance novelist Joan Wilder's sister is kidnapped in Cartagena, Joan (Kathleen Turner) ends up on a rescue-mission-turned-treasure-hunt with adventure-seeking Jack T. Colton (Michael Douglas). Don't be surprised if a viewing of this movie makes you want to trade in your annual beach vacation for a wild ride through the Colombian jungle.\n\n'Paris, Je T’aime' (2006)\n\nUnited Archives GmbH / Alamy Stock Photo\n\nParis, Je T'aime is different from the other films on this list in that it's not one film — it's 18 short films that all feature Paris as a central theme. Because the project is made up of 18 different stories in 18 different arrondissements around the city, viewers get a true, unfiltered sense of Paris, and may even find themselves inspired to visit lesser-known locales in the City of Light.\n\n'The Adventures of Priscilla, Queen of the Desert' (1994)\n\nIf you've ever longed to take a laughter-fueled road trip with your best friends, this film is worth a watch. In the flick, pals Tick (Hugo Weaving), Adam (Guy Pearce), and Bernadette (Terence Stamp) head out on a cross-country road trip through the Australian outback to perform their successful drag act in a new town. The trio takes up residence in an oversized tour bus called Priscilla, Queen of the Desert in this fun, ahead-of-its-time dramedy.\n\n'RV' (2006)\n\nZUMA Press, Inc. / Alamy Stock Photo\n\nWhile plenty of road trip movies have been made over the years, \"RV\" might be the only one that takes place in, well, an RV. Though the main characters in this movie face more bad luck than fun, family bonding, the film does feature generous desert, mountain, and wilderness scenery, as well as an all-star cast (Robin Williams, Kristin Chenoweth, Cheryl Hines, and Josh Hutcherson are just a few that appear).\n\n'Point Break' (2015)\n\nYes, we're talking about the \"Point Break\" remake rather than the original film from 1991, but hear us out: the imagery in this movie inspires some serious wanderlust. The story takes viewers to several of the wildest places on Earth (Mexico's Cave of Swallows, Venezuela's Angel Falls, etc.) and though the plot is slightly different from the original (think eco-terrorism rather than bank robberies), it is quiet possibly the most visually stimulating travel movie ever made.\n\n'Girls Trip' (2017)\n\nPictorial Press Ltd / Alamy Stock Photo\n\nWhen was the last time you took a trip with just your core group of girlfriends? A quick watch of this comedy will have you planning your next gal pal getaway faster than you can say \"PTO.\" In the film, a group of friends (Queen Latifah, Tiffany Haddish, Regina Hall, and Jada Pinkett Smith) head to New Orleans, but you'll be ready to travel anywhere with your best buds after watching \"Girls Trip\" — even if it's just to the next town over.\n\n'The Way' (2010)\n\nAfter his son is killed walking the Camino de Santiago pilgrimage route to Galicia, Spain, Tom Avery (Martin Sheen) sets out on the trail himself to retrieve his son's body. Along the way, Tom meets several other travelers who are walking the trail in hopes of changing their own lives for one reason or another. This inspiring film may just persuade you to make the famed pilgrimage yourself, or to book a similarly reflective trip.\n\n'The Sisterhood of the Traveling Pants' (2005)\n\nAA Film Archive / Alamy Stock Photo\n\nIf you were a teen or pre-teen in 2005, you have likely seen this movie and its 2008 sequel, and can attest that both inspire major wanderlust. The first film follows best friends Carmen, Lena, Bridget, and Tibby (who share a magical pair of jeans that fits them all perfectly) as they spend a summer in different parts of the world. Lena (Alexis Bledel) travels to Santorini, Greece, which makes for some seriously dreamy backdrops. In the sequel, the whole gang heads to Greece, but not before Bridget (Blake Lively) spends some time in Turkey.\n\n'Up in the Air' (2009)\n\nThis George Clooney-led comedy-drama makes business travel and airports look glamorous — hospitable, even. Boasting just as many cityscape shots as it does plane scenes, \"Up in the Air\" will have you longing to be in the skies, jet setting off to some place new. Anna Kendrick and Vera Farmiga also star in this critically-acclaimed film about a man who lives out of a suitcase.\n\n'Around the World in 80 Days' (1956)\n\nLMPC via Getty Images\n\nIf this classic adventure film doesn't inspire daydreams of traveling somewhere new, we're not sure what will. In 1872, Englishman Phileas Fogg makes a bet with several members of his gentleman's club that he can travel around the globe in just 80 days. On his journey, he and sidekick Jean Passepartout bring viewers along as they travel by gas balloon to France, Spain, Italy, India, Hong Kong, the United States, and more.\n\n'Home Alone 2: Lost in New York' (1992)\n\nThe Home Alone movies usually fall under the comedy or holiday categories, but if you think about it, the second installment in the series is totally a travel movie. The film does a fantastic job of showing off the glamorous side of New York City, the place young Kevin McCallister accidentally ends up while the rest of his family vacations in Florida. From shots of the Rockefeller Christmas tree to the Manhattan skyline, this film is sure to inspire a trip to the Big Apple.\n\n'Under the Tuscan Sun' (2003)\n\nEntertainment Pictures / Alamy Stock Photo\n\nYou won't find shots of northern Italy as serene as the ones in this feel-good film about independence, love, and friendship. After losing everything in her divorce, American writer Frances Mayes (Diane Lane) suddenly finds herself beginning a new life in the small Tuscan town of Cortona. And if you're anything like us, Googling \"Tuscan villas for sale\" will become a regular part of your life after watching this film.\n\n'Angels & Demons' (2009)\n\nThough \"Angels & Demons\" is classified as a thriller, it'll definitely make you want to head to Rome and dig up some history, both figuratively and literally. Based on the Dan Brown novel of the same name, the story follows Robert Langdon (Tom Hanks) as he discovers secrets of the Vatican and faces off against the supposed Illuminati. If you're a fan, check out other Dan Brown adventure travel films, \"The Da Vinci Code\" (2006) and \"Inferno\" (2016).\n\n'Easy Rider' (1969)\n\nSilver Screen Collection/Hulton Archive/Getty Images\n\nOur list features travel by plane, train, RV, and even hot air balloon, but \"Easy Rider\" is the only movie that follows a journey via motorcycle. In the film, drug smugglers Wyatt (Peter Fonda) and Billy (Dennis Hopper) ride from Los Angeles to New Orleans in hopes of reveling at Mardi Gras to celebrate their latest score. On their journey, they stop in several small towns, make a few friends, and unsuccessfully try to evade trouble.\n\n'Out of Africa' (1985)\n\nIf Africa doesn't currently have a spot on your bucket list, this film might make you rethink that. Meryl Streep and Robert Redford star in this true story about Karen Blixen, a Danish woman who moves to Nairobi with her new husband, and builds a life there despite their many marital issues. \"Out of Africa\" features sweeping panoramic shots of Nairobi in nearly every scene, leaving it no wonder the drama won seven Academy Awards, including one for Best Cinematography.\n\n'Johnson Family Vacation' (2004)\n\nAF archive / Alamy Stock Photo\n\nThis family comedy starring Cedric the Entertainer, Vanessa Williams, and Solange Knowles follows the mildly dysfunctional Johnsons as they road trip to their family reunion in Missouri. On the drive, the family hilariously encounters just about every road trip cliché, from picking up a problematic hitchhiker to running out of gas, before making it to the reunion and performing a musical number to nab the coveted Family of the Year trophy.\n\n'Midnight in Paris' (2011)\n\nSet in present-day Paris, this Oscar-winning film is typically a favorite among art and literature lovers. At midnight each night, screenwriter Gil (Owen Wilson) is transported back in time through different eras of Paris, where he befriends Ernest Hemingway, F. Scott Fitzgerald, and Pablo Picasso, and even strikes up a romance with a 1920s woman named Adriana. The film offers plenty of inspiration for a culturally rich trip to France.\n\n'The Parent Trap' (1998)\n\nAA Film Archive / Alamy Stock Photo\n\n\"The Parent Trap\" is another film that may not immediately stand out as a travel flick, but once you take into account the film's many settings (London, San Francisco, Napa Valley, and the northeastern U.S.), it's easy to see that this family classic has been a travel film all along. Plus, the main characters spend lots of time on planes, boats, and camping trips throughout the movie.\n\n'The Talented Mr. Ripley' (1999)\n\nCarefully spliced between disturbing revelations and suspenseful plot twists are luxurious shots of Italian beaches in this Matt Damon-led film. When Tom Ripley (Damon) is paid to travel to Italy and bring Dickie Greenleaf (Jude Law) back to the States by Dickie's father, Tom ends up befriending — and later becoming obsessed with — Dickie. Despite the plot quickly darkening, viewers are treated to bright, colorful scenes in Rome and glamorous seaside villages.\n\n'Roman Holiday' (1953)\n\nParamount Pictures/Courtesy of Getty Images\n\nRomance? Check. Stunning visuals of Rome? Check. Audrey Hepburn? Check. This classic travel comedy lands at the top of many movie buffs' all-time favorite lists, and for good reason. Bored with her mundane life as a European princess while on a trip to Rome, Ann (Hepburn) ditches her duties and hits the town with journalist Joe Bradley (Gregory Peck). The two take viewers on a tour of the Eternal City and fall in love in the process.\n\n'Pee-wee’s Big Adventure' (1985)\n\nBefore you roll your eyes, take a moment to acknowledge that this film essentially sends happy-go-lucky Pee-wee Herman (Paul Reubens) on the great American road trip in search of his stolen bicycle. In this comedy for adults and children alike, Pee-wee stops at the Alamo, the Cabazon Dinosaur park in California, and Hollywood. Traveling by car, truck, and train, Pee-wee befriends a biker gang, competes in a rodeo, and of course, famously dances to \"Tequila\" before his journey is through.\n\nHillary Maglin is a digital editor who splits most of her time between New York City and Pittsburgh. You can find her on Instagram @hillarymaglin, where her DMs are always open to discuss travel gear, wine bars, and Taylor Swift's latest record.", "images": ["https://www.travelandleisure.com/thmb/jk0-RLix6EYtdNSoWaKNvC1J1ng=/2250x0/filters:no_upscale():max_bytes(150000):strip_icc()/raiders-of-lost-ark-WANDERLUSTMOVIE0321-8932a28685f24b31b10bc8887606c50f.jpg", "https://www.travelandleisure.com/thmb/2Lp93kXx_2CBYybuTCbXfa30klQ=/2250x0/filters:no_upscale():max_bytes(150000):strip_icc()/girls-trip-movie-WANDERLUSTMOVIE0321-cab48debec1a4bcda76f146569effbe4.jpg", "https://www.travelandleisure.com/thmb/1vqlRCmnU7-z-mfgEMyVFesLuo0=/2250x0/filters:no_upscale():max_bytes(150000):strip_icc()/roman-holiday-movie-WANDERLUSTMOVIE0321-2f8b0999b1c8404ca87ce730c80cd801.jpg", "https://www.travelandleisure.com/thmb/l1rzji783aSuf4h5_s8utVojljE=/2250x0/filters:no_upscale():max_bytes(150000):strip_icc()/johnson-family-vacation-movie-WANDERLUSTMOVIE0321-68255ec948c3452ebd72b77807bef02f.jpg", "https://www.travelandleisure.com/thmb/ZdsEHiLyfOZ5pV_avmtU_uvIq5w=/2250x0/filters:no_upscale():max_bytes(150000):strip_icc()/parent-trap-movie-WANDERLUSTMOVIE0321-cc7efe1ba8d24fd1a09b3e6c9745cd4e.jpg", "https://www.travelandleisure.com/thmb/reG6_bVwXgyEsi87nIPQUsnyITw=/75x75/filters:no_upscale():max_bytes(150000):strip_icc()/hillary-maglin-7138fa7ae086454792413f9ae1db4aec.jpg", "https://www.travelandleisure.com/thmb/NhG5HBxPKOYT0xet1AWxcTqa55M=/2250x0/filters:no_upscale():max_bytes(150000):strip_icc()/darjeeling-limited-WANDERLUSTMOVIE0321-d9f5c117114843a39f5275125aa2dfa9.jpg", "https://www.travelandleisure.com/thmb/3fYYOAKMxy7pDFw2T6dCQPTWS00=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/hotel-portofino-pbs-episode-1-exterior-HOTELPORTO0622-9cbb8bcc6690478196169f53e658131a.jpg", "https://www.travelandleisure.com/thmb/Q_wtOJ_8Vyu64dsoSdcnn7FQ35o=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/las-vegas-nevada-BIRTHDAYTRIPS0121-a58d2cbe123546458630a7ccc1d035f6.jpg", "https://www.travelandleisure.com/thmb/eDVk3cjCGhsWEeVskWK6f9RcUEY=/300x150/filters:no_upscale():max_bytes(150000):strip_icc()/TL_Magazine_Sub_1200x600-77f5e29db1ee46989f735a50686980d1.png", "https://www.travelandleisure.com/thmb/OX-l0nmZp9ZG2JL1McH5P2er0lk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/family-outside-hotel-jerome-MTFAMVACAY0422-dfcc86cacf684f94976974cfc455f501.jpg", "https://www.travelandleisure.com/thmb/iFZ69nLRY9JTQ-bk2wx1Z5sBKFE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/airbnb-river-house-nairobi-kenya-BIGBNBS0619-a8aaf73dbbde4949bcedea0ae5110481.jpg", "https://www.travelandleisure.com/thmb/vs0hBxYa-_GTyDOp2EXP7FY0Qk0=/2250x0/filters:no_upscale():max_bytes(150000):strip_icc()/eat-pray-love-movie-WANDERLUSTMOVIE0321-e0bc1b89e97745079048ebcc8e5cefcf.jpg", "https://www.travelandleisure.com/thmb/bHzXalWoF7slK6fM8u4bJ7v932M=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/cardoz-bourdain-edwards-earhart-mickey-rigby-morris-mccue-NOTABLETRVLRS0721-1e73db8bbcd84892b8022629191bf2e7.jpg", "https://www.travelandleisure.com/thmb/KR4GRTrgWRf3BkNPHoGDFAFzX14=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/pfeiffer-beach-big-sur-california-hero_ROMCA0622-b2c201c6f4a54b5286133dfca1f10272.jpg", "https://www.travelandleisure.com/thmb/V6-HqH-1iob8k1r1quKAQFMuPa4=/2250x0/filters:no_upscale():max_bytes(150000):strip_icc()/rv-movie-robin-williams-WANDERLUSTMOVIE0321-544463695763436db98c9d8798fde96a.jpg", "https://www.travelandleisure.com/thmb/_zFegJOy0YPhPABQbxEP-hKIy3g=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/bixby-bridge-big-sur-california-LARDTRIPS0322-9d1d5943502b4974b8726fb906894806.jpg", "https://www.travelandleisure.com/thmb/2_3knJcCbp-ZYT70LHkeCVe9JBI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/san-francisco-vacation-IGVACAPS0218-263f5003497d4d9985022cd676d0993d.jpg", "https://www.travelandleisure.com/thmb/RWEPwHvRM9m3IIYKepZ-f7pNSIY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/jamaica-salem-paradise-beach-SUMMERTRIPS0518-58ad340a92be4002a44c1328aaa2805d.jpg", "https://www.travelandleisure.com/thmb/SLfuriezI-GAqmey3G2mx8NfdTA=/1800x1200/filters:fill(auto,1)/girls-trip-movie-WANDERLUSTMOVIE0321-cab48debec1a4bcda76f146569effbe4.jpg", "https://www.travelandleisure.com/thmb/LfUbJo60K81lKcxSynW88eErqaY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/nordelaia-piedmont-italy-ITLIST22-ab1109aa0b8541e0ba48f198fbc7d8c1.jpg", "https://www.travelandleisure.com/thmb/wTwGNfqFl2O25D0V63RP-JDOLg0=/2250x0/filters:no_upscale():max_bytes(150000):strip_icc()/sisterhood-traveling-pants-WANDERLUSTMOVIE0321-4ffdf8f334e14ed38245069fb022be57.jpg", "https://www.travelandleisure.com/thmb/4cLie4R651uANRiISPTOFm58zzg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/matamata-waikato-new-zealand-ICONICLOCAL0421-645f549ce35f4622b5145c084ff3a28e.jpg", "https://www.travelandleisure.com/thmb/52IOK4pJQqHSgnsSlhGCFw2vdYc=/2250x0/filters:no_upscale():max_bytes(150000):strip_icc()/nomadland-movie-WANDERLUSTMOVIE0321-a7214f7fc3314fa0a322b4d308fe16c6.jpg", "https://www.travelandleisure.com/thmb/yVk_KZhcwTE1ltJrlX4ya_wUyqc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/virtual-escapes-VIRTUALTLEDIT0420-71d6bf65ac2546a394c67edf44a37ad6.jpg", "https://www.travelandleisure.com/thmb/O9K0XXgyE0a_uKtFWOV5D5p0OkM=/2250x0/filters:no_upscale():max_bytes(150000):strip_icc()/thelma-and-louise-movie-WANDERLUSTMOVIE0321-4f022e74b4be4a30a98bb1a2ef8aa89f.jpg", "https://www.travelandleisure.com/thmb/eXvnW1IctwlENfZnB595o9Bu5ks=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/header-ingrid-backstrom-INGRIDINT0122-780041dc205d4270914e6ea499ab8cf3.jpg", "https://www.travelandleisure.com/thmb/v5ZI594tA0GHV4bIjQ-QvuTnR7k=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/onboard-tv-delta-flight-HALLMARKDLT1221-9fe97a962c5942678879a5d001c1f277.jpg", "https://www.travelandleisure.com/thmb/pU2H0LqUQ7XFx4sFQDJexx3_J-o=/2250x0/filters:no_upscale():max_bytes(150000):strip_icc()/easy-rider-movie-WANDERLUSTMOVIE0321-7b2a79e19a30410b804cbb68a077baa0.jpg", "https://www.travelandleisure.com/thmb/cRVFqjnun3csE3WpTupUrXpLp6E=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/women-travel-INTWOMENDAY0319-1eedae25517e4de3b184b93812030592.jpg", "https://www.travelandleisure.com/thmb/e60fUXkIluvSLHSndhVWiv_X88g=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/quarantine-rainbow-windows-hope-GOODNEWSONE0420-e65ba5427d134f04b3d19447e6894d3a.jpg", "https://www.travelandleisure.com/thmb/Y_KEKm4-D5P5QegVZRM34VFapG8=/2250x0/filters:no_upscale():max_bytes(150000):strip_icc()/before-sunrise-movie-WANDERLUSTMOVIE0321-247e473c71884320b7d2864aa260a11d.jpg", "https://www.travelandleisure.com/thmb/TYvFK_l-0AhmQFc_M3eTHdqP6ww=/2250x0/filters:no_upscale():max_bytes(150000):strip_icc()/paris-je-taime-movie-WANDERLUSTMOVIE0321-6acdb5ee510c45e38f4806f22a8c7091.jpg", "https://www.travelandleisure.com/thmb/DbDZmHCEIyyGbDbkEWbSdKy95cM=/2250x0/filters:no_upscale():max_bytes(150000):strip_icc()/under-the-tuscan-sun-movie-WANDERLUSTMOVIE0321-c774359e9bca43cc829293c2aee1ad8e.jpg", "https://www.travelandleisure.com/thmb/AaOGM6_0Ix7igEyyhD3xIzemzyo=/2250x0/filters:no_upscale():max_bytes(150000):strip_icc()/around-the-world-eighty-days-movie-WANDERLUSTMOVIE0321-e4090d0c36174c3689c6adab39b55e3c.jpg", "https://www.travelandleisure.com/thmb/iDY8l5ypKuVIcMvOYpsPxawclps=/2250x0/filters:no_upscale():max_bytes(150000):strip_icc()/warner-bros-crazy-rich-asians-CRATOURSA0818-8378a29969d143829db97f9355ed0065.jpg"], "top_img": "https://www.travelandleisure.com/thmb/SLfuriezI-GAqmey3G2mx8NfdTA=/1800x1200/filters:fill(auto,1)/girls-trip-movie-WANDERLUSTMOVIE0321-cab48debec1a4bcda76f146569effbe4.jpg", "keywords": [], "authors": ["Hillary Maglin", "Travel", "Leisure Editorial Guidelines"], "canonical_link": "https://www.travelandleisure.com/culture-design/tv-movies/best-travel-movies", "title": "34 Movies That Will Make You Want to Get Off the Couch and See the World", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "From \"The Holiday\" to \"Romancing the Stone\" to \"Eat Pray Love,\" these travel films will inspire some serious wanderlust.", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "TRAVELANDLEISURE", "sailthru.author": "Hillary Maglin", "article": {"section": "Travel + Leisure", "opinion": "false", "author": "https://www.facebook.com/travelandleisure/"}, "fb": {"app_id": 1186687021348564, "pages": 25440929072}, "og": {"type": "article", "site_name": "Travel + Leisure", "url": "https://www.travelandleisure.com/culture-design/tv-movies/best-travel-movies", "title": "34 Movies That Will Make You Want to Get Off the Couch and See the World", "description": "From \"The Holiday\" to \"Romancing the Stone\" to \"Eat Pray Love,\" these travel films will inspire some serious wanderlust.", "image": "https://www.travelandleisure.com/thmb/SLfuriezI-GAqmey3G2mx8NfdTA=/1800x1200/filters:fill(auto,1)/girls-trip-movie-WANDERLUSTMOVIE0321-cab48debec1a4bcda76f146569effbe4.jpg"}, "twitter": {"card": "summary_large_image", "site": "@TravelLeisure", "title": "34 Movies That Will Make You Want to Get Off the Couch and See the World", "description": "From \"The Holiday\" to \"Romancing the Stone\" to \"Eat Pray Love,\" these travel films will inspire some serious wanderlust.", "image": "https://www.travelandleisure.com/thmb/SLfuriezI-GAqmey3G2mx8NfdTA=/1800x1200/filters:fill(auto,1)/girls-trip-movie-WANDERLUSTMOVIE0321-cab48debec1a4bcda76f146569effbe4.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.16.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.16.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.16.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.16.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.16.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "http://www.travelandleisure.com", "summary": ""}