{"url": "https://russianmachineneverbreaks.com/2017/05/17/australian-keith-urban-performs-national-anthem-for-first-time-at-predators-game/", "text": "The Nashville Predators have embraced their country roots throughout the 2017 playoffs, inviting famous musicians to sing the national anthem before every game. Carrie Underwood, Luke Bryan, Little Big Town, Vince Gill, and Lady Antebellum have all taken the ice during the Predators home games in the first two rounds.\n\nAs the Predators hosted their first Western Conference Final game in franchise history, they also hosted a very special anthem singer.\n\nVideo\n\nKeith Urban, a native Australian and four-time Grammy Award winner, performed the Star-Spangled Banner for the first time in his career.\n\n“I’ve lived in America for 25 years. I’ve never been asked to sing the National Anthem, so it’s such an honor to do it here in Nashville for the Preds,” Urban said to NHL Network’s Jon Morosi after his performance.\n\nUrban also spoke about how much the moment meant to him.\n\n“It’s a nerve-wracking experience, but above all, it’s a huge honor,” Urban said. “For me, for all the years I’ve lived here, it’s probably one of the proudest moments ever in my life.”\n\nUrban, who is married to Nicole Kidman, said while he is a fan of the Predators, his wife is definitely the biggest fan in their household.\n\nWhile the Predators’ new country pregame routine has been almost universally praised, the team encountered some controversy earlier this week. Dennis K. Morgan, who has performed the anthem for the Predators 185 times since 2000, criticized the organization through a local paper Tuesday.\n\nMorgan told the Tennessean’s Mike Organ that the issues began after the “captain’s wife,” Carrie Underwood, asked to sing the anthem during round one.\n\n“It was presented to me as a one night only kind of thing and I agreed to it,” Morgan said. “Then they continued to bring in these other singers and touted them as ‘A-listers,’ which kind of hurt me.”\n\n“I don’t blame Carrie Underwood or Luke Bryan or any of the other acts who have performed. I’ve been as good-natured as I can be,” Morgan continued. “With my closest friends, I’ve certainly shared my disappointment. But most of the time I’ll toe the company line and say, ‘Why am I not singing? Because I don’t have seven Grammys, I’m not married to the captain, she’s a whole lot prettier than me,’ that kind of thing and try to leave it at that.”\n\nMorgan said that the Predators understood his disappointment, and have also apparently been hearing the same thing from some fans in attendance. Morgan was looking forward to hitting the 25-year mark of performing the anthem for NHL teams (which he would achieve during the 2018-19 season), but will now spend his summer doing some “soul-searching.”", "images": ["https://russianmachineneverbreaks.com/wp-content/themes/nebula/images/arrow_up_24x24.png", "https://russianmachineneverbreaks.com/wp-content/themes/nebula/images/social/twitter.png", "https://russianmachineneverbreaks.com/wp-content/themes/nebula/images/social/instagram.png", "https://i0.wp.com/russianmachineneverbreaks.com/wp-content/uploads/2018/05/keith-urban-sings-national-anthem.jpg?fit=960%2C480&ssl=1", "https://russianmachineneverbreaks.com/wp-content/uploads/2017/10/rmnb-retina.png", "https://russianmachineneverbreaks.com/wp-content/themes/nebula/images/social/youtube.png", "https://russianmachineneverbreaks.com/wp-content/themes/nebula/images/social/facebook.png", "https://russianmachineneverbreaks.com/wp-content/themes/nebula/images/social/tumblr.png"], "top_img": "https://i0.wp.com/russianmachineneverbreaks.com/wp-content/uploads/2018/05/keith-urban-sings-national-anthem.jpg?fit=960%2C480&ssl=1", "keywords": [], "authors": [], "canonical_link": "https://russianmachineneverbreaks.com/2017/05/17/australian-keith-urban-performs-national-anthem-for-first-time-at-predators-game/", "title": "Australian Keith Urban performs national anthem for first time at Predators game", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1", "format-detection": "telephone=no", "description": "The Nashville Predators have embraced their country roots throughout the 2017 playoffs, inviting famous musicians to sing the national anthem before every game. Carrie Underwood, Luke Bryan, Little Big Town, Vince Gill, and Lady Antebellum have all taken the ice during the Predators home games in the first two rounds. As the Predators hosted their…", "robots": "max-image-preview:large", "og": {"type": "article", "title": "Australian Keith Urban performs national anthem for first time at Predators game", "url": "https://russianmachineneverbreaks.com/2017/05/17/australian-keith-urban-performs-national-anthem-for-first-time-at-predators-game/", "site_name": "RMNB", "image": {"identifier": "https://i0.wp.com/russianmachineneverbreaks.com/wp-content/uploads/2018/05/keith-urban-sings-national-anthem.jpg?fit=960%2C480&ssl=1", "width": 960, "height": 480}, "locale": "en_US", "description": "The Nashville Predators have embraced their country roots throughout the 2017 playoffs, inviting famous musicians to sing the national anthem before every game. Carrie Underwood, Luke Bryan, Little Big Town, Vince Gill, and Lady Antebellum have all taken the ice..."}, "article": {"published_time": "2017-05-17T18:18:13+00:00", "modified_time": "2017-05-17T18:18:13+00:00"}, "twitter": {"site": "@rmnb", "text": {"title": "Australian Keith Urban performs national anthem for first time at Predators game"}, "image": "https://i0.wp.com/russianmachineneverbreaks.com/wp-content/uploads/2018/05/keith-urban-sings-national-anthem.jpg?fit=960%2C480&ssl=1&w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://i0.wp.com/russianmachineneverbreaks.com/wp-content/uploads/2021/05/cropped-rmnb-puck-logo.jpg?fit=270%2C270&ssl=1", "norton-safeweb-site-verification": "z6f3jmb0a5fldy3-3ycv89mll2arp9s2teb6rabs5-58ir0ayilwrntlqc6-0qk-atlkz2yr3l-a9d5rpl6plkkg-n8l39b51gyvs2jja4wsc5g3s-yapf6q-c7nh843"}, "movies": ["https://www.youtube.com/embed/gfnCuXPWF_Q"], "publish_date": 1494975600.0, "source": "https://russianmachineneverbreaks.com", "summary": ""}