{"url": "https://en.wikipedia.org/wiki/Manchester_Arena_bombing", "text": "2017 suicide bombing\n\nThis article is about the 2017 suicide bombing. For the IRA bombing in 1996, see 1996 Manchester bombing . For other bombings in Manchester, see Manchester bombing\n\nOn 22 May 2017, an Islamist extremist suicide bomber detonated a shrapnel-laden homemade bomb as people were leaving the Manchester Arena following a concert by American singer Ariana Grande.\n\nTwenty-three people were killed, including the attacker, and 1,017 were injured, many of them children. Several hundred more suffered psychological trauma. The bomber was Salman Ramadan Abedi, a 22-year-old local man of Libyan ancestry. After initial suspicions of a terrorist network, police later said they believed Abedi had largely acted alone but that others had been aware of his plans. In March 2020, the bomber's brother, Hashem Abedi, was found guilty of 22 counts of murder and attempting to murder 1,017 others, and was sentenced to life in prison.\n\nThe incident was the deadliest terrorist attack and the first suicide bombing in the United Kingdom since the 7 July 2005 London bombings.\n\nBombing\n\nOn 22 May 2017 at 22:15 a member of the public reported Abedi, wearing black clothes and a large rucksack to Showsec security. A guard observed Abedi but said that he did not intervene in case his concerns about Abedi were wrong and out of fear of being considered a racist. The security guard tried to use his radio to alert the security control room but was unable to get through.[6]\n\nAbout five minutes later at 22:31 BST (UTC+01:00),[7]: 3.8 the suicide bomber detonated an improvised explosive device, packed with nuts and bolts to act as shrapnel, in the foyer area of the Manchester Arena. The attack took place after a concert by American pop star Ariana Grande that was part of her Dangerous Woman Tour.[8][9] 14,200 people attended the concert.[10] Many exiting concert-goers and waiting parents were in the foyer at the time of the explosion. According to evidence presented at the coroner's inquest, the bomb was strong enough to kill people up to 20 metres (66 ft) away.[11]\n\nGreater Manchester Police declared the incident a terrorist attack and a suicide bombing. It was the deadliest attack in the United Kingdom since the 7 July 2005 London bombings.[7]: 3\n\nAftermath\n\nAbout three hours after the bombing, police conducted a controlled explosion on a suspicious item of clothing in Cathedral Gardens. This was later confirmed to have been abandoned clothing and not dangerous.[12][13]\n\nResidents and taxi companies in Manchester offered free transport or accommodation via Twitter to those left stranded at the concert.[7]: 4.85 Parents were separated from their children attending the concert in the aftermath of the explosion. A nearby hotel served as a shelter for people displaced by the bombing, with officials directing separated parents and children there.[7]: 4.85 Manchester's Sikh temples (gurdwaras) along with local homeowners, hotels and venues offered shelter to survivors of the attack.[14]\n\nBritish military personnel alongside armed police as part of Operation Temperer in response to the raised threat level\n\nManchester Victoria railway station, which is partly underneath the arena, was evacuated and closed, and services were cancelled.[8][15] The explosion caused structural damage to the station, which remained closed until the damage had been assessed and repaired, resulting in disruption to train and tram services.[16] The station reopened to traffic eight days later, following the completion of police investigation work and repairs to the fabric of the building.[7]: 4.57\n\nAfter a COBRA meeting with Greater Manchester's Chief Constable, Ian Hopkins, on 23 May, Prime Minister Theresa May announced that the UK's terror threat level[17] was raised to \"critical\", its highest level.[7]: 5.247 The threat level remained critical until 27 May, when it was reduced to its previous level of severe.[18] In the aftermath of the attack Operation Temperer was activated for the first time, allowing up to 5,000 soldiers to reinforce armed police in protecting parts of the country.[19][21] Tours of the Houses of Parliament and the Changing of the Guard ceremony at Buckingham Palace were cancelled on 24 May, and troops were deployed to guard government buildings in London.[22]\n\nOn 23 May, the Islamic State of Iraq and the Levant, via the Nashir Telegram channel, said the attack was carried out by \"a soldier of the Khilafah\". The message called the attack \"an endeavor to terrorise the mushrikin, and in response to their transgressions against the lands of the Muslims.\"[3][23][24] Abedi's sister said that he was motivated by revenge for Muslim children killed by American airstrikes in Syria.[25][26]\n\nManchester Arena City Room foyer, after renovation\n\nThe Arena remained closed until September 2017, with scheduled concerts either cancelled or moved to other venues.[27] It reopened on 9 September, with a benefit concert featuring Noel Gallagher and other acts associated with North West England.[28]\n\nMay announced an extra £13 million reimbursement from central government to Manchester's public services for most of the costs incurred by the attack in January 2018.[29] Later that month, Chris Parker, a homeless man who stole from victims of the attack whilst assisting them, was jailed for 4 years and three months.[30]\n\nCasualties\n\nThe explosion killed the attacker and 22 concert-goers and parents who were in the entrance waiting to pick up their children following the show; 119 people were initially reported as injured.[31][32] This number was revised by police to 250 on 22 June, with the addition of severe psychological trauma and minor injuries.[33] In May 2018, the number of injured was revised to 800.[34] During the public inquiry into the bombing, it was updated in December 2020 to 1,017 people sustaining injuries.[35] A study published in September 2019 said that 239 of the injuries were physical.[1] The dead included ten people aged under 20; the youngest victim was an eight-year-old girl and the oldest was a 51-year-old woman.[32] Of the 22 victims, twenty were Britons and two were British-based Polish nationals.[36]\n\nNorth West Ambulance Service reported that 60 of its ambulances attended the scene, carried 59 people to local hospitals, and treated walking wounded on site.[7]: 2 Of those hospitalised, 12 were children under the age of 16.[31] In total, 112 people were hospitalised for their injuries, and 27 were treated for injuries that did not require hospitalisation. Out of this total of 139, 79 were children.[37]\n\nThe first doctor thought to have been on scene was an off-duty consultant anaesthetist, Michael Daley.[38] In recognition of his bravery for the role he played in the immediate medical response to the incident, Daley's name was entered into the British Medical Association Book of Valour in June 2017.[39]\n\nAttacker\n\n[40] Police outside the entrance of Granby House, inside which, in one of its apartments, Abedi had assembled the device, on 24 May\n\nThe bomber, Salman Ramadan Abedi, was a 22-year-old British Muslim of Libyan ancestry.[41][42] He was born in Manchester to a Salafi[43] family of Libyan-born refugees who had settled in south Manchester after fleeing to the UK to escape the government of Muammar Gaddafi. He had two brothers and a sister.[44][45] He grew up in Whalley Range and lived in Fallowfield.[46] Neighbours described the Abedis as a very traditional and \"super religious\" family,[47][48] who attended Didsbury Mosque.[46][49][50] Abedi attended Wellacre Technology College, Burnage Academy for Boys[51] and The Manchester College. A former tutor remarked that Abedi was \"a very slow, uneducated and passive person\".[52] He was among a group of students at his high school who accused a teacher of Islamophobia for asking them what they thought of suicide bombers.[53][54] He also reportedly said to his friends that being a suicide bomber \"was OK\" and fellow college students raised concerns about his behaviour.[55]\n\nAbedi's father was a member of the Libyan Islamic Fighting Group, a Salafi jihadist organisation proscribed by the United Nations,[56] and father and son fought for the group in Libya in 2011 as part of the movement to overthrow Muammar Gaddafi.[52] Abedi's parents, both born in Tripoli, remained in Libya in 2011,[46] while 17-year-old Abedi returned to live in the United Kingdom. He took a gap year in 2014, when he returned with his brother Hashem to Libya to live with his parents. Abedi was injured in Ajdabiya that year while fighting for an Islamist group.[57] The brothers were rescued from Tripoli by the Royal Navy survey ship HMS Enterprise in August 2014 as part of a group of 110 British citizens as the Libyan civil war erupted, taken to Malta and flown back to the UK.[58][59] According to a retired European intelligence officer, speaking on condition of anonymity, Abedi met with members of the ISIS Battar brigade in Sabratha, Libya and continued to be in contact with the group upon his return to the UK.[60] An imam at Didsbury mosque recalled that Abedi looked at him \"with hate\" after he preached against ISIS and Ansar al-Sharia in 2015.[61]\n\nAbedi's sister said her brother was motivated by the injustice of Muslim children dying in bombings stemming from the American-led intervention in the Syrian Civil War. A family friend of the Abedi's also remarked that Salman had vowed revenge at the funeral of Abdul Wahab Hafidah, who was run over and stabbed to death by a Manchester gang in 2016 and was a friend of Salman and his younger brother Hashem. Hashem later co-ordinated the Manchester bombing with his brother.[62][63]\n\nAccording to an acquaintance in the UK, Abedi was \"outgoing\" and consumed alcohol,[64] while another said that Abedi was a \"regular kid who went out and drank\" until about 2016.[65] Abedi was also known to have used cannabis.[44][64] He enrolled at the University of Salford in September 2014, where he studied business administration, before dropping out to work in a bakery.[44] Manchester police believe Abedi used student loans to finance the plot, including travel overseas to learn bomb-making.[66] The Guardian reported that despite dropping out from further education, he was still receiving student loan funding in April 2017.[67] Abedi returned to Manchester on 18 May after a trip to Libya and bought bomb-making material, apparently constructing the acetone peroxide-based bomb by himself. It is known that many members of the IS Battar brigade trained people in bomb-making in Libya.[68]\n\nHe was known to British security services and police but was not regarded as a high risk, having been linked to petty crime but never flagged up for radical views.[49][69] A community worker told the BBC he had called a hotline five years before the bombing to warn police about Abedi's views and members of Britain's Libyan diaspora said they had \"warned authorities for years\" about Manchester's Islamist radicalisation.[70][71] Abedi was allegedly reported to authorities for his extremism by five community leaders and family members and had been banned from a mosque;[72][73][74] the Chief Constable of Greater Manchester, however, said Abedi was not known to the Prevent anti-radicalisation programme.[75]\n\nOn 29 May 2017, MI5 launched an internal inquiry into its handling of the warnings it had received about Abedi and a second, \"more in depth\" inquiry, into how it missed the danger.[76][77][78] On 22 November 2018, the Intelligence and Security Committee of Parliament published a report which said that MI5 had acted \"too slowly\" in its dealings with Abedi. The committee's report noted \"What we can say is that there were a number of a failings in the handling of Salman Abedi's case. While it is impossible to say whether these would have prevented the devastating attack on 22 May, we have concluded that as a result of the failings, potential opportunities to prevent it were missed.\"[79]\n\nInvestigation\n\nBombing location map\n\nThe property in Fallowfield where Abedi lived was raided on 23 May. Armed police breached the house with a controlled explosion and searched it. Abedi's 23-year-old brother was arrested in Chorlton-cum-Hardy in south Manchester in relation to the attack.[80][81] Police carried out raids in two other areas of south Manchester and another address in the Whalley Range area.[81] Three other men were arrested, and police initially spoke of a network supporting the bomber;[70] they later announced that Abedi had sourced all the bomb components himself, and that they now believed he had largely acted alone.[82] On 6 July, police said that they believed others had been aware of Abedi's plans.[83]\n\nAccording to German police sources, Abedi transited through Düsseldorf Airport on his way home to Manchester from Istanbul four days before the bombing.[84] French interior minister Gérard Collomb said in an interview with BFM TV that Abedi may have been to Syria, and had \"proven\" links with IS.[85] Abedi's younger brother and father were arrested by Libyan security forces on 23 and 24 May respectively.[86] The brother was suspected of planning an attack in Libya, and was said to be in regular touch with Salman, and aware of the plan to bomb the Manchester Arena,[87] but not the date.[88] According to a Libyan official, the brothers spoke on the phone about 15 minutes before the attack was carried out.[89] On 1 November 2017, the UK requested Libya to extradite the bomber's younger brother, Hashem Abedi to return to the UK to face trial for complicity in the murder of the 22 people killed in the explosion.[37]\n\nPhotographs of the remains of the IED published by The New York Times indicated that it had comprised an explosive charge inside a lightweight metal container which was carried within a black vest or a blue Karrimor backpack. Most of the fatalities occurred in a ring around the bomber. His torso was propelled by the blast through the doors to the arena, possibly indicating that the explosive charge was held in the backpack and blew him forward on detonation. A small device thought to have possibly been a hand-held detonator was also found.[90] US Congressman Michael McCaul, chairman of the House Homeland Security Committee, indicated that the bomb contained the explosive TATP, which has been used in previous bombings.[91] According to Manchester police, the explosive device used by Abedi was the design of a skilled bomb-maker and had a back-up means of detonation.[92] Police also said Salman Abedi \"bought most of the Manchester bomb components himself\" and that he was alone during much of the time before carrying out the Manchester bombing.[37][93]\n\nOn 28 May, police released images showing Abedi on the night of the bombing, taken from CCTV footage.[94] Further images showed Abedi walking around Manchester with a blue suitcase.[95]\n\nAccording to US intelligence sources, Abedi was identified by the bank card that he had with him and the identification was confirmed using facial recognition technology.[96]\n\nA total of 22 people were arrested in connection with the attack, but had all been released without charge by 11 June following the police's conclusion that Abedi was likely to have acted alone, even though others may have been aware of his plans.[97]\n\nA public inquiry into the attack was launched in September 2020. The first of three reports to be produced was a 200-page report published on 17 June 2021. It found that \"there were a number of missed opportunities to alter the course of what happened that night\" and that \"more should have been done\" by police and private security guards to prevent the bombing.[98]\n\nNews leaks\n\nWithin hours of the attack, Abedi's name and other information given confidentially to security services in the United States and France were leaked to the news media, leading to condemnation from Home Secretary Amber Rudd.[99][100] Following the publication of crime scene photographs of the backpack bomb used in the attack in the 24 May edition of The New York Times, UK counterterrorism police chiefs said the release of the material was detrimental to the investigation.[101]\n\nOn 25 May, Greater Manchester Police said it had stopped sharing information on the attack with the US intelligence services. Theresa May said she would make clear to President Trump that \"intelligence that has been shared must be made secure.\"[102] Trump described the leaks to the news media as \"deeply troubling\", and pledged to carry out a full investigation.[103] British officials blamed the leaks on \"the breakdown of normal discipline at the White House and in the US security services\".[104] New York Times editor Dean Baquet declined to apologise for publishing the backpack bomb photographs, saying \"We live in different press worlds\" and that the material was not classified at the highest level.[105]\n\nOn 26 May, US Secretary of State Rex Tillerson said the United States government accepted responsibility for the leaks.[106]\n\nAccording to a secret recording unveiled by the BBC, Mostafa Graf, the imam of the Didsbury Mosque where Salman Abedi and his family were regulars, made a call for armed jihad 10 days before Abedi bought his concert ticket.[107]\n\nFollowing these revelations, the Manchester Police opened an investigation into the mosque and its imam, who also fought with a Libyan Islamist militia.[108] Mostafa Graf is a member of the International Union of Muslim Scholars, an organisation founded by the Muslim Brotherhood and Yusuf al-Qaradawi.[109] Al-Qaradawi is known for having claimed, \"Suicide bombings are a duty\".[110]\n\nHaras Rafiq, head of the Quilliam think tank, told The Guardian that the Muslim Brotherhood runs the Didsbury Mosque.[111]\n\nThe Didsbury Mosque is controlled by The Islamic Centre (Manchester), an English association headed by Dr. Haytham al-Khaffaf, who is also a director of the Human Relief Foundation, a Muslim Brotherhood organisation blacklisted for terrorism by Israel.[111][112][113] Between 2015 and 2016, al-Khaffaf's Human Relief Foundation received over £1.5 million from the Qatar Charity, which is also subject to US counterterrorism surveillance.[114][115]\n\nTrial and sentencing of Hashem Abedi\n\nOn 17 July 2019, Salman Abedi's brother Hashem was charged with murder, attempted murder and conspiracy to cause an explosion. He had been arrested in Libya and extradited to the UK.[116] His trial began on 5 February 2020.[117] On 17 March, Hashem Abedi was found guilty on 22 charges of murder, on the grounds that he had helped his brother to source the materials used in the bombing and had assisted with the manufacture of the explosives which were used in the attack.[118][119] On 20 August, Hashem Abedi was sentenced to life imprisonment with a minimum term of 55 years. The judge, Mr Justice Jeremy Baker, said that sentencing rules prevented him from imposing a whole life order as Abedi had been 20 years old at the time of the offence. The minimum age for a whole life order is 21 years old. Abedi's 55-year minimum term is the longest minimum term ever imposed by a British court.[120][121]\n\nIsmail Abedi\n\nIn October 2021, it was reported that Salman Abedi's older brother Ismail had left the UK. He had been summonsed by Sir John Saunders to testify before the public inquiry into the bombing. Saunders had refused Ismail Abedi's request for immunity from prosecution while testifying.[122]\n\nManchester Arena inquiry\n\nIn February 2022, it was reported that security services were \"struggling to cope\" during the period leading up to the bombing. One MI5 officer told the inquiry that he had warned superiors that something might \"get through\" due to large numbers of documents needing processing. Intelligence that MI5 had before the attack and which might have led to Salman Abedi being placed under investigation was not passed to counter-terrorism police.[123]\n\nReactions\n\nUnited Kingdom\n\nFloral tributes to the victims of the attack in St Ann's Square in Manchester city centre\n\nTheresa May condemned the bombing,[124] and in a later statement following the 2017 London Bridge attack, she said these attacks, along with the 2017 Westminster attack, were \"bound together by the single evil ideology of Islamist extremism\" and said this extremism was \"a perversion of Islam\".[5] Queen Elizabeth II expressed her sympathy to the families of the victims.[125] Campaigning for the upcoming general election was suspended by all political parties for two days after the attack.[126][127] The Mayor of Greater Manchester, Andy Burnham, called the attack \"evil\"[128] and announced a vigil in Albert Square the following evening, which thousands attended.[130][131] The Muslim Council of Britain also condemned the attack.[132]\n\nOn 25 May 2017, a national minute's silence was observed to remember the victims.[133]\n\nPolice reported a 500% increase in anti-Muslim hate crimes in the Greater Manchester area in the month following the attack.[134] The Commission for Countering Extremism was created in the aftermath of the bombing.[135]\n\nAccording to a 2021 study in the American Political Science Review, the British public did not rally around Theresa May after the Manchester Arena bombing: \"Instead, evaluations of May decrease, with sharp declines among those holding negative views about women. We further show May's party loses votes in areas closer to the attack.\"[136]\n\nOn 19 October 2021 it was reported that Salman Abedi's elder brother Ismail had left the country, despite being summonsed to provide evidence to the public enquiry.[137]\n\nInternational\n\nCondolences were expressed by the leaders and governments of dozens of countries,[138] United Nations Secretary-General António Guterres,[139] Commonwealth Secretary-General Patricia Scotland,[140] President of the European Commission Jean-Claude Juncker,[141] Pope Francis,[142] and secretary general of the Organisation of Islamic Cooperation Yousef Al-Othaimeen.[143]\n\nAriana Grande posted on Twitter: \"broken. from the bottom of my heart, i am so so sorry. i don't have words.\"[144] The tweet briefly became the most-liked tweet in history.[145] Grande suspended her tour and flew back to her mother's home in Florida.[146][147]\n\nOn 9 July 2017, a performance to benefit the Manchester bombing victims was held in New York City's The Cutting Room, called \"Break Free: United for Manchester\", with Broadway theatre and television performers covering Grande's songs.[148]\n\nOne Love Manchester\n\nOn 4 June, Ariana Grande hosted a benefit concert in Manchester, entitled \"One Love Manchester\" at Old Trafford Cricket Ground that was broadcast live on television, radio and social media. At the concert, Grande performed along with several other high-profile artists. Free tickets were offered to those who had attended the show on 22 May.[149] The benefit concert and associated Red Cross fund raised £10 million for victims of the attack by early June[150][151] and £17 million by August.[152] New York's Vulture section ranked the event as the No. 1 concert of 2017.[153]\n\nKerslake Report\n\nOn 27 March 2018, a report by Bob Kerslake named the \"Kerslake Report\" was published. The report was \"an independent review into the preparedness for, and emergency response to, the Manchester Arena attack on 22nd May 2017.\"[7] In the report, Kerslake \"largely praised\" the Greater Manchester Police and British Transport Police, and noted that it was \"fortuitous\" that the North West Ambulance Service was unaware of the declaration of Operation Plato, a protocol under which all responders should have withdrawn from the arena in case of an active killer on the premises.[7]: 5.40 However, it found that the Greater Manchester Fire and Rescue Service was \"brought to a point of paralysis\" as their response was delayed for two hours due to poor communication between the firefighters' liaison officer and the police force.[7]: 5.155 [154][155]\n\nThe report was critical of Vodafone for the \"catastrophic failure\"[7]: 5.47 of an emergency helpline hosted on a platform provided by Content Guru, saying that delays in getting information caused \"significant stress and upset\" to families.[7]: 17 It also expressed criticism of some news media, saying, \"To have experienced such intrusive and overbearing behaviour at a time of such enormous vulnerability seemed to us to be completely and utterly unacceptable\",[7]: 19 but noting that, \"We recognise that this was some, but by no means all of the media and that the media also have a positive and important role to play.\"[7]: 19\n\nMemorial\n\nThe victims of the bombing will be commemorated by The Glade of Light, a garden memorial located in Manchester city centre near Manchester Cathedral.[156] The memorial opened to the public in January 2022 and an official opening event has been planned for later in the year.[157]\n\nThe memorial was vandalised on 9 February 2022, causing £10,000 of damage. A 24-year-old man admitted to the offence and was given a two-year community order on 22 June 2022.[158]\n\nSee also\n\nNotes\n\n^ Encompasses the 1,017 injured", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/City_Room_.jpg/220px-City_Room_.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Manchester_bombing.png/350px-Manchester_bombing.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Manchester_Arena_exterior%2C_%283%29_May19.jpg/1200px-Manchester_Arena_exterior%2C_%283%29_May19.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Manchester_Arena_exterior%2C_%283%29_May19.jpg/300px-Manchester_Arena_exterior%2C_%283%29_May19.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/a/ae/Flag_of_the_United_Kingdom.svg/21px-Flag_of_the_United_Kingdom.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/Greater_Manchester_UK_location_map_2.svg/280px-Greater_Manchester_UK_location_map_2.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Granby_House_24-05-17.jpg/220px-Granby_House_24-05-17.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/St_Ann%27s_Square_floral_tribute_panorama_%2802%29.jpg/220px-St_Ann%27s_Square_floral_tribute_panorama_%2802%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Red_pog.svg/8px-Red_pog.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/England_Greater_Manchester_numbered.svg/21px-England_Greater_Manchester_numbered.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Operation_Temperer_May_2017_%281%29.jpg/220px-Operation_Temperer_May_2017_%281%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Manchester_Arena_exterior%2C_%283%29_May19.jpg/1200px-Manchester_Arena_exterior%2C_%283%29_May19.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Manchester_Arena_bombing", "title": "Manchester Arena bombing", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6f/Manchester_Arena_exterior%2C_%283%29_May19.jpg/640px-Manchester_Arena_exterior%2C_%283%29_May19.jpg", "width": 640, "height": 281}, "title": "Manchester Arena bombing - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}