{"url": "www.inquisitr.com/4891733/brad-pitt-dating-rumors-continue-but-did-neri-oxman-already-meet-his-family/", "text": "Rumors persist about Brad Pitt dating Neri Oxman. In fact, one recent report states that the actor planned to take the MIT professor to a family wedding.\n\nHowever, Gossip Cop recently reported that they debunked the rumor that Brad Pitt planned to take Neri Oxman home to meet his family. While headlines scream that Pitt feels torn between his ex-wife Jennifer Aniston, who recently ended her marriage with Justin Theroux, and Oxman, he's chosen the architect and wants to introduce her to his mother and siblings.\n\nNot only that, but the gossip magazines already have Pitt, a father of six — including Maddox, 16, Pax, 14, Zahara, 13, Shiloh, 11, and 9-year-old twins Knox and Vivienne — trying for a baby with his newest lady love. Of course, none of these rumors are true because Brad Pitt and Neri Oxman aren't dating. In fact, they share a friendship and nothing more, according to Pitt's representative. The supposed family wedding doesn't even exist.\n\nAs for a Pitt-Aniston reunion? Don't look for it to happen anytime soon either, because these two exes aren't in any type of regular contact and they haven't seen each other in a while.\n\nAs for something Pitt really did do, he recently made a surprise appearance on the Jim Jeffries Show on Comedy Central, according to a People report. Although he heard the words \"you're fired\" last time he appeared, Pitt somehow made it back to the show as the always dreary weatherman that everybody loves to hate.\n\nThe surprise cameo on the show last week was Pitt's first since last summer. Jeffries didn't really explain much about how the weatherman returned, despite being fired, aside from briefly mentioning it.\n\nWhile it's more fun to spin tales of exciting romance for Brad Pitt, it looks like, for now, he and Neri Oxman remain friends and have no plans to go home to meet the actor's family and attend a wedding this summer. Should they become more than friends, no doubt everybody will know all the details sooner or later, but for now, Pitt appears to be adjusting well to life after his split with Angelina Jolie.", "images": ["https://imgb.srgcdn.com/c2fbdf24-a0a4-40f9-ad23-b0cb57bf8766.jpg", "https://imgb.srgcdn.com/d258d2ec-e52b-4489-9950-908cc366bacf.jpg", "https://www.inquisitr.com/wp-content/uploads/2018/05/Brad-Pitt.jpg", "https://secure.gravatar.com/avatar/42196c046e4a2503f7f937da1575ba1c?s=800", "https://imgb.srgcdn.com/fe42e24b-1fa1-4cf2-b7ef-0bcd25a6f5c9.png", "https://imgb.srgcdn.com/1740626a-9ecf-4723-b66a-d7ca5e1d678c.jpg", "https://imgb.srgcdn.com/a5ba8e20-c5b5-4c82-ae2b-4f343261a07b.jpg", "https://imgb.srgcdn.com/6977b3f9-ffc5-44c5-866c-e80c13668077.jpg"], "top_img": "https://www.inquisitr.com/wp-content/uploads/2018/05/Brad-Pitt.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.inquisitr.com/4891733/brad-pitt-dating-rumors-continue-but-did-neri-oxman-already-meet-his-family/", "title": "Brad Pitt Dating Rumors Continue, But Did Neri Oxman Already Meet His Family?", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimal-ui, user-scalable=no", "msapplication-TileImage": "/static/inquisitr/favicon-128x128.png", "robots": "max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Brad Pitt Dating Rumors Continue, But Did Neri Oxman Already Meet His Family?", "url": "https://www.inquisitr.com/4891733/brad-pitt-dating-rumors-continue-but-did-neri-oxman-already-meet-his-family/", "site_name": "The Inquisitr", "description": "Brad Pitt Dating Rumors Continue, But Did Neri Oxman Already Meet His Family?", "image": "https://www.inquisitr.com/wp-content/uploads/2018/05/Brad-Pitt.jpg", "updated_time": "2021-08-16 18:13:43Z"}, "article": {"modified_time": "2021-08-16 18:13:43Z", "published_time": "2018-05-07 11:27:49Z", "section": "Rumors"}, "description": "Brad Pitt Dating Rumors Continue, But Did Neri Oxman Already Meet His Family?", "keywords": "Rumors", "twitter": {"card": "summary_large_image"}}, "movies": [], "publish_date": 1525692469.0, "source": "http://www.inquisitr.com", "summary": ""}