{"url": "https://www.thenational.ae/lifestyle/wellbeing/tv-doc-to-ensure-no-one-gets-botched-in-dubai-1.778286", "text": "Dr Paul Nassif has a name for what’s going on with the increasing number of people seeking enhancement at his Beverly Hills plastic-­surgery clinic these days. “Selfie filter dysmorphia,” he says. “They are actually taking these selfies, filtering them, changing the way they look and thinking we can do that.”\n\nNassif is a familiar face to fans of reality television, first from several appearances on E!'s Dr. 90201, then on a number of seasons of Bravo's The Real Wives of Beverly Hills, on which his ex-wife, Adrienne Maloof, was a regular. But it's through the four seasons of E!'s Botched, the show that he co-hosts with his friend, Dr Terry Dubrow, that he has become a celebrity.\n\nNassif is due to head to Dubai in the near future as part of a newly inked partnership with Nova Clinic by Aesthetics. He is one of several plastic surgeons whom the clinic’s owner and founder, Dr Jaffer Khan, has recruited to focus on aesthetics surgery in the UAE.\n\n“It is our endeavour to further promote Dubai as being the epicentre for plastic surgery in the Middle East and beyond,” explains Khan. “It’s imperative that we offer quality and ethical services, and by partnering with Dr Paul Nassif, we are doing exactly that.”\n\nAlthough exact timelines are still up in the air, Nassif plans to start doing remote consultations before visiting the emirate three or four times yearly, the first perhaps before the end of this year, but more likely in the first part of 2019. \"We'll be doing some Skype consultations to make it easier for patients,\" he says. \"Right now, I see a lot of patients; they come out to Beverly Hills in the summer, for at least a couple of weeks, especially from Saudi, Kuwait, Qatar and Dubai.\"\n\nA treatment room at Nova Clinic by Aesthetics. Courtesy Nova Clinic\n\nOn Botched, Nassif and Dubrow set about fixing plastic surgery that has gone wrong, and they face some of the worst, seemingly hopeless cases, including people who have had cement injected into their faces, and even some who are in danger of their noses falling off. Most of these patients are in great discomfort emotionally and physically, while many are in real pain. All have had their quality of life diminished by the procedures they have chosen to have.\n\n“They get botched because they go to a doctor who doesn’t have the proper experience and they don’t know what they are doing,” explains Nassif, adding that sometimes they have settled for a cosmetic surgeon – and not a formally trained plastic surgeon.\n\n“Or they go to another country, again, where it’s cheap surgery and they are getting bad results,” he says. “Or they are pushing their doctor to do over-aggressive surgery because they have body dysmorphia or they are plastic surgery addicts.”\n\nHowever, it is also quite possible, Nassif acknowledges, that people can do everything right and still have the procedures go awry. “You can go to a good doctor, it happens to all of us, and you have complications,” he says. “Any surgery is risky.”\n\nIt’s not always during surgery that things go wrong, either. Healing, particularly of the skin, is a tricky and unpredictable process – with irregularities that only reveal themselves over time. That’s why Nassif is very clear, careful and specific when he briefs his patients.\n\n“I tell everyone not to expect perfection and that the swelling can last a long time,” he says. “It’s easier to do an upper-eyelid job, or a browlift or a facelift, or chin implants, because usually what you see is what you get. It’s the healing of the nose that causes the problems.”\n\nIt was back when he was doing his facial plastic and reconstructive surgery fellowship at the St Louis University School of Medicine that Nassif spotted an area of opportunity: rhinoplasty revisions, or fixing the errors of others. In the early days of rhinoplasty, plastic surgeons took too much cartilage from the nose, unaware that it would later shrink and deform.\n\n“We started seeing all these patients in Beverly Hills with these pinched noses,” he says. “There were Middle Eastern patients from all around the world with destroyed noses, because of the aggressive nature, and we’re still seeing them to this day.”\n\nNose jobs remain the toughest surgery in plastics, and because there is so little to work with, “revision rhinoplasty is obviously the hardest of the hardest”, says Nassif. “When you operate on these hard cases, where the nose can fall off, it’s given me an experience that not many doctors have.”\n\nOver the years, Nassif has developed a radar for patients who he knows he should not be operating on, estimating that he rejects about one out of 20. “With my experience, I feel the little hairs on my neck stand up,” he explains. “I miss them sometimes, but you can tell most of the time.”\n\nAmong those rejects are perfectionists, plastic-surgery addicts, people who want too many changes or have unrealistic expectations. “Their nose is fine, their face is fine and they think there is something wrong,” he says. “They have body dysmorphia.”\n\nAs for those with Nassif’s diagnosis of selfie filter dysmorphia? He usually recommends a little Botox or filler, or even one of the many increasingly popular non-invasive treatments, such as radio frequency to tighten; micro-needling to smooth and tone skin tissue; nanofat injections to help smooth wrinkles and reduce lower-eyelid pigmentation, and regenerative shots of high-density platelet-rich plasma from the patient’s own blood.\n\nAs for trends in plastic surgery, it seems less is finally becoming more. “The goal is to be a bit more conservative and natural,” he says. “The fake look is going.”\n\n_______________\n\nRead more:\n\nSelfie generation helping fuel rise in cosmetic surgery\n\nThe growing problem of negative body image in the UAE\n\nDubai authorities urge cosmetic patients to check surgeons' credentials\n\nAn inside look into men's plastic surgery in the UAE\n\n_______________", "images": ["https://www.thenational.ae/pf/resources/images/footer-logo.svg?d=358", "https://thenational-the-national-prod.cdn.arcpublishing.com/resizer/R8qKbbcfPNu1wYxkCdS163YlSs4=/800x0/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/thenational/ZTK6HNQNRD46M4TB6B3GPF5O6I.jpg", "https://www.queryly.com/images/whitesearchicon.png", "https://www.thenational.ae/pf/resources/icons/search-icon.svg?d=358", "https://www.thenational.ae/pf/resources/icons/information.svg?d=358", "https://thenational-the-national-prod.cdn.arcpublishing.com/resizer/V0jraw3EkROA_GP9qbfaFLwYNYg=/1440x0/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/thenational/2UUJSRIGB4AL7PF2CXFTUFQ7WY.jpg", "https://www.thenational.ae/pf/resources/icons/alert-bell.png?d=358", "https://www.thenational.ae/pf/resources/images/national-logo.svg?d=358", "https://thenational-the-national-prod.cdn.arcpublishing.com/resizer/9FAV-pNsrpwI-NcCt4fS4X9En7M=/1440x810/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/thenational/ZTK6HNQNRD46M4TB6B3GPF5O6I.jpg", "https://www.facebook.com/tr?id=797427810752825&ev=PageView&noscript=1"], "top_img": "https://thenational-the-national-prod.cdn.arcpublishing.com/resizer/9FAV-pNsrpwI-NcCt4fS4X9En7M=/1440x810/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/thenational/ZTK6HNQNRD46M4TB6B3GPF5O6I.jpg", "keywords": [], "authors": ["Ann Marie Mcqueen", "Oct"], "canonical_link": "https://www.thenationalnews.com/lifestyle/wellbeing/tv-doc-to-ensure-no-one-gets-botched-in-dubai-1.778286", "title": "TV doc to ensure no one gets ‘Botched’ in Dubai", "meta_data": {"description": "Dr Paul Nassif will soon be performing surgery in the emirate. He talks to us about making it the epicentre for the practice in the Middle East", "parsely-post-id": "TLCYJRIPUK4IUX7VSLHGFZHD2M", "author": "Ann Marie McQueen", "twitter": {"widgets": {"theme": "light", "border-color": "#55acee"}, "description": "Dr Paul Nassif will soon be performing surgery in the emirate. He talks to us about making it the epicentre for the practice in the Middle East", "title": "TV doc to ensure no one gets ‘Botched’ in Dubai", "image": {"identifier": "https://thenational-the-national-prod.cdn.arcpublishing.com/resizer/9FAV-pNsrpwI-NcCt4fS4X9En7M=/1440x810/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/thenational/ZTK6HNQNRD46M4TB6B3GPF5O6I.jpg", "alt": "Dr Paul Nassif of US reality TV show ‘Botched’. Courtesy Paul Nassif"}, "site": "@TheNational", "card": "summary_large_image"}, "og": {"description": "Dr Paul Nassif will soon be performing surgery in the emirate. He talks to us about making it the epicentre for the practice in the Middle East", "title": "TV doc to ensure no one gets ‘Botched’ in Dubai", "image": {"identifier": "https://thenational-the-national-prod.cdn.arcpublishing.com/resizer/9FAV-pNsrpwI-NcCt4fS4X9En7M=/1440x810/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/thenational/ZTK6HNQNRD46M4TB6B3GPF5O6I.jpg", "url": "https://thenational-the-national-prod.cdn.arcpublishing.com/resizer/9FAV-pNsrpwI-NcCt4fS4X9En7M=/1440x810/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/thenational/ZTK6HNQNRD46M4TB6B3GPF5O6I.jpg", "secure_url": "https://thenational-the-national-prod.cdn.arcpublishing.com/resizer/9FAV-pNsrpwI-NcCt4fS4X9En7M=/1440x810/filters:format(jpg):quality(70)/cloudfront-eu-central-1.images.arcpublishing.com/thenational/ZTK6HNQNRD46M4TB6B3GPF5O6I.jpg", "width": 1440, "height": 810, "alt": "Dr Paul Nassif of US reality TV show ‘Botched’. Courtesy Paul Nassif"}, "type": "article", "site_name": "The National", "url": "https://www.thenationalnews.com/lifestyle/wellbeing/tv-doc-to-ensure-no-one-gets-botched-in-dubai-1.778286"}, "al": {"ios": {"url": "https://www.thenationalnews.com/lifestyle/wellbeing/tv-doc-to-ensure-no-one-gets-botched-in-dubai-1.778286", "app_store_id": 1281497691, "app_name": "The National News"}, "android": {"url": "https://www.thenationalnews.com/lifestyle/wellbeing/tv-doc-to-ensure-no-one-gets-botched-in-dubai-1.778286", "package": "com.the.national", "app_name": "The National News"}}, "article": {"publisher": "https://www.facebook.com/TheNationalNews", "tag": "St Louis University School of Medicine,Middle East,Jaffer Khan,Adrienne Maloof,Beverly Hills,Skype,Terry Dubrow,Botox,Paul Nassif,Lifestyle,rhinoplasty,plastic and reconstructive surgery,Wellbeing,Dubai", "section": "Wellbeing", "published_time": "2018-10-08T06:29:11Z", "modified_time": "2021-07-05T21:11:05.539Z"}, "fb": {"pages": 148788988477345}, "robots": "max-image-preview:large", "page-type": "story", "title": "TV doc to ensure no one gets ‘Botched’ in Dubai", "viewport": "width=device-width, initial-scale=1.0, viewport-fit=cover", "apple-mobile-web-app-title": "The National", "application-name": "The National", "theme-color": "#004e79", "msapplication-TileColor": "#004e79", "msapplication-TileImage": "/pf/resources/images/N-logos/N-logo-144.png?d=358"}, "movies": ["https://www.youtube.com/embed/yXOa7sCJ76o?feature=oembed"], "publish_date": null, "source": "https://www.thenational.ae", "summary": ""}