{"url": "www.harpersbazaar.com/celebrity/latest/a22007333/katie-holmes-and-jamie-foxx-relationship-timeline/", "text": "Katie Holmes and Jamie Foxx had been rumored to be dating for several years now, but they've always managed to keep their relationship under wraps. However, days after Foxx was seen getting cozy with another woman, reports broke today that he and Holmes had actually been separated for months.\n\nHere, take a look back at all of the key moments in Katie Holmes and Jamie Foxx's secretive courtship, from how they met to their secretive split.\n\n2004: Foxx works with Tom Cruise on Collateral.\n\nGetty Images\n\nBefore Cruise meets and marries Holmes, he works with Foxx on the movie Collateral. The pair appear to strike up a friendship over the course of filming.\n\nCruise meets Holmes in April 2005, according to The Hollywood Reporter.\n\n2006: Holmes is spotted with Cruise and Foxx.\n\nGetty Images\n\nHolmes attends a football game between the Minnesota Vikings and the Washington Redskins on September 11, 2006 in Maryland. She is seen chatting to Foxx on the field, who is clearly an acquaintance, as she attends the game with Cruise.\n\nJune 29, 2012: Holmes files for divorce from Tom Cruise.\n\nCruise's rep releases a statement (reported via Yahoo!) which says, \"Kate has filed for divorce and Tom is deeply saddened and is concentrating on his three children. Please allow them their privacy.\" CBS reports that Cruise is blindsided by the divorce, and tells a German television station, \"I didn't expect it.\"\n\n\n\nAugust 2013: Foxx and Holmes are seen dancing together in the Hamptons.\n\nOver a year after Holmes has separated from Cruise, rumors about a new relationship start when Holmes and Foxx are spotted at the same event in the Hamptons. They're photographed flirting with one another, with People reporting that \"Foxx wrangled [Ellen] DeGeneres and Holmes for a group hug, the ladies flanking him,\" and \"at one point, the actress even tried a sip of Foxx’s cocktail,\" suggesting that they're either very close, or this is the start of a flirtation between them.\n\nOctober 2013: Foxx denies that he is dating Holmes.\n\nThe Baby Driver actor tells Entertainment Tonight that he isn't dating Holmes. He says, \"[The rumors] are one hundred percent not true. In fact, it's quite hilarious because we simply danced at a charity event along with a lot of other people.\"\n\nFebruary 2015: Holmes and Foxx are photographed holding hands for the first time.\n\nThe secretive actors are seen holding hands in public, but they don't confirm their relationship. Instead, PopSugar claims that, instead, they go to even bigger efforts to hide their romance, with Katie putting \"on a wig and hat to meet him at a hotel\" at one point, which is a commitment, if true.\n\nGetty Images\n\nMarch 2015: A source claims that the relationship isn't that serious.\n\nAn alleged source tells People, \"This is not some intense romance. Jamie and Katie are friends and have been for a long time. They are two adults who are attractive and single... they’re not about to run off and make some serious commitment.\"\n\n\n\nDecember 2015: Holmes attends Foxx's 48th birthday party.\n\nTMZ reports that Holmes is spotted in the crowd at Foxx's birthday celebration, spurring on rumors that they're secretly a couple.\n\nJune 2016: Foxx's friend gets in trouble for spilling secrets.\n\nFormer Real Housewives of Atlanta star, and a friend of Foxx's, Claudia Jordan, lets a little too much info about her friend's relationship slip while appearing on a podcast. Jordan reveals, \"He is very happy with her. I love that he seems very happy.\"\n\nJuly 2016: Foxx visits Holmes on the set of The Kennedys After Camelot.\n\nThe rumored couple are seen having dinner in Toronto, where Holmes is filming. Foxx doesn't even keep the fact that he's in town a secret, because he poses with a fan for an Instagram shot.\n\nDecember 2016: They celebrate Holmes's 38th birthday in Mexico.\n\nA source tells Us Weekly, \"They stayed in one of the most private suites at the hotel, separate from other guests and entered by a small path. They wanted to be very discreet and had everything delivered to their room and taken care of by a personal butler.\"\n\nMay 2017: Holmes visits Foxx on location in Paris.\n\nAccording to a report in People, Holmes is photographed boarding a private jet in Paris with Foxx, where the actor has been filming a new version of Robin Hood. Of the romance, an \"insider\" apparently tells Us Weekly that Katie \"gushes about how amazing he is. She says she loves him from the tips of her toes to the top of her head.\"\n\n\n\nSeptember 2017: Holmes and Foxx are spotted holding hands on a rare public outing.\n\nHolmes and Foxx are photographed holding hands on Labor Day as they walk along a beach in Malibu together. The Daily Mail shares photos of the couple looking extremely loved up.\n\nDecember 2017: They celebrate Foxx's 50th birthday in Los Angeles.\n\nOf the party, PopSugar reports, \"They walked in together. They mostly mingled with other guests, and spent very little alone time. It was obvious that Jamie had a great birthday. Katie looked like she had fun as well. She looked gorgeous.\"\n\nJanuary 27, 2018: Holmes and Foxx sit together at a Pre-Grammys party.\n\nGetty Images\n\nFebruary 2018: Foxx walks out of an interview when asked about Holmes.\n\nFoxx walks away when an interviewer quizzes him about Holmes. However, he smiles throughout the interaction, suggesting he isn't that angry about it.\n\nPeople reports that Foxx and Holmes play basketball together on Valentine's Day.\n\n\n\nJune 2018: Holmes's rep denies breakup reports.\n\nSeeming to indirectly confirm that Holmes and Foxx are, in fact, dating, Holmes's rep shoots down a story which claims that the actors have broken up.\n\nRadar Online reports that \"she and Foxx have split after five years of intense, covert dating—and have even called off the intimate dream wedding they’d been planning. 'Katie just couldn’t get over her trust issues.'\"\n\nHowever, Holmes's rep tells People, \"The Radar story is 100 percent untrue,\" which appears to confirm that the relationship is still on.\n\nRelated Story Katie Holmes and Jamie Foxx Hold Hands in Rare PDA\n\nDecember 2018: They show PDA in Miami.\n\nFoxx and Holmes were seen kissing on a luxury yacht and racing on wave runners together in Miami, FL ahead of New Year's Eve. The Oscar winner joked to Us Weekly of their not-so-secret PDA, \"It was foolish!\"\n\nMay 2019: They make their Met Gala debut—and then break up.\n\nAlthough they didn't walk the red carpet together, Foxx and Holmes were photographed together inside the 2019 Met Gala for the first time. In full couple mode, the duo coordinated in shades of purple, with Holmes in a dark and dreamy Zac Posen number, and Foxx in matching violet shoes.\n\nHolmes and Foxx rock purple at the 2019 Met Gala. Kevin Tachman/MG19 // Getty Images\n\nSources tell Page Six and E! News that Holmes and Foxx broke up in May, shortly after their Met Gala cameo. However, the split didn't make headlines until months later.\n\nAugust 2019: Their breakup makes news after Foxx is seen with another woman.\n\nOn Friday, August 16, Foxx raised eyebrows when he was photographed holding hands with singer Sela Vave while out in L.A. Days later, reports broke that Foxx and Holmes had split in May. Per Page Six, after Foxx's PDA photos with Vave circulated, the actress was reportedly overheard telling friends that she and Foxx \"haven’t been together for months.\"\n\nThe former couple have not yet publicly responded to breakup reports.", "images": ["https://hips.hearstapps.com/hmg-prod/images/jamie-foxx-katie-holmes-1530376645.jpg?crop=0.5xw:1xh;center,top&resize=640:*", "https://hips.hearstapps.com/hmg-prod/images/jennifer-lopez-and-ben-affleck-are-seen-on-september-26-news-photo-1665065585.jpg?crop=0.941xw:1.00xh;0.0304xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/katie-holmes-and-jamie-foxx-attend-the-2019-met-gala-news-photo-1147441798-1566248935.jpg?crop=0.896xw:1.00xh;0,0&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/kylie-jenner-arriving-for-lunch-at-the-abbey-of-san-news-photo-1665070515.jpg?crop=1.00xw:0.801xh;0,0.0551xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1665155826.jpg?crop=0.984xw:1.00xh;0.00962xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/bgus-2478974-012-1665067784.jpg?crop=1.00xw:0.721xh;0,0.0461xh&resize=180:*", "https://hips.hearstapps.com/rover/profile_photos/32a17ebf-adab-48ef-a723-758c53a8bea8_1524066273.file?fill=1:1&resize=80:*", "https://hips.hearstapps.com/hmg-prod/images/hbz-jamie-foxx-katie-holmes-index-1504796375.jpg?crop=1.00xw:1.00xh;0,0&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/bgus-2479931-003-1665162992.jpg?crop=1.00xw:0.668xh;0,0.0192xh&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1665151779.jpg?crop=0.676xw:1.00xh;0.269xw,0&resize=180:*", "http://www.harpersbazaar.com/_assets/design-tokens/harpersbazaar/static/images/logos/network-logo.a5366f4.svg", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-71857672-1530386944.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/in-this-image-released-on-may-2-prince-harry-the-duke-of-news-photo-1665174018.jpg?crop=0.655xw:1.00xh;0.287xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1665149715.jpg?crop=0.803xw:1.00xh;0.0946xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-911230414-1530388788.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1665160606.jpg?crop=0.739xw:1.00xh;0.0962xw,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-696064906-1530475143.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-51260638-1530386591.jpg?crop=1xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/jamie-foxx-katie-holmes-1530376645.jpg?crop=1xw:1xh;center,top&resize=1200:*", "https://hips.hearstapps.com/hmg-prod/images/gettyimages-1665078914.jpg?crop=0.657xw:1.00xh;0.293xw,0&resize=180:*", "https://hips.hearstapps.com/vidthumb/images/screen-shot-2019-01-16-at-1-21-54-pm-1547662931.png?crop=0.7671930128983747xw:1xh;center,top&resize=480:*", "https://hips.hearstapps.com/hmg-prod/images/tom-brady-and-gisele-b-c3-bcndchen-attend-the-2019-met-gala-news-photo-1664907170.jpg?crop=1.00xw:0.668xh;0,0&resize=180:*", "https://hips.hearstapps.com/hmg-prod/images/kate-del-castillo-teresa-mendoza-lrds3-tlmd-2-1664910940.jpg?crop=1.00xw:0.668xh;0,0.0566xh&resize=180:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/jamie-foxx-katie-holmes-1530376645.jpg?crop=1xw:1xh;center,top&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.harpersbazaar.com/celebrity/latest/a22007333/katie-holmes-and-jamie-foxx-relationship-timeline/", "title": "Katie Holmes and Jamie Foxx Relationship Timeline", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "X-UA-Compatible": "IE=edge,chrom=1", "msapplication-tap-highlight": "no", "title": "Katie Holmes and Jamie Foxx Relationship Timeline - Katie Holmes Boyfriend Dating Rumors", "description": "Katie Holmes and Jamie Foxx have been rumored to be dating for several years now, but they've always managed to keep their relationship under wraps.", "keywords": "katie holmes, katie holmes dating, katie holmes daughter, katie holmes jamie foxx, katie holmes married, katie holmes tom cruise, suri cruise, jamie foxx, jamie foxx dating, jamie foxx katie holmes, kate holmes boyfriend", "theme-color": "#000000", "og": {"site_name": "Harper's BAZAAR", "title": "Katie Holmes and Jamie Foxx’s Full Relationship Timeline", "description": "A look back at the key moments in their super-private romance.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/jamie-foxx-katie-holmes-1530376645.jpg?crop=1xw:1xh;center,top&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.harpersbazaar.com/celebrity/latest/a22007333/katie-holmes-and-jamie-foxx-relationship-timeline/", "type": "article"}, "fb": {"app_id": 227018747326504, "pages": 8327967561}, "article": {"publisher": "https://www.facebook.com/HarpersBazaar", "section": "Celebrity News", "modified_time": "2021-11-02T00:40:57Z", "published_time": "2019-08-19T21:56:00Z"}, "twitter": {"site": "@harpersbazaarus", "image": "https://hips.hearstapps.com/hmg-prod/images/jamie-foxx-katie-holmes-1530376645.jpg?crop=1xw:1xh;center,top&resize=640:*", "card": "summary_large_image"}, "google-site-verification": "bNUXKPTEqUVDbaxHrYA-c1kj007Ao4VsMKdoU80EyiU", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/jamie-foxx-katie-holmes-1530376645.jpg?crop=0.5xw:1xh;center,top&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/jamie-foxx-katie-holmes-1530376645.jpg?crop=0.5xw:1xh;center,top&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/jamie-foxx-katie-holmes-1530376645.jpg?crop=0.5xw:1xh;center,top", "auto-publish": "timely", "sailthru.excerpt": "Katie Holmes and Jamie Foxx had been rumored to be dating for several years now, but they've always managed to keep their relationship under wraps. However, days after Foxx was seen getting cozy with another woman, reports broke today that he and Holmes had actually been separated for months. Here,", "sailthru.tags": "celebrity,Celebrity,latest,Celebrity News", "sailthru.date": "2019-08-19 21:56:00", "sailthru.socialtitle": "Katie Holmes and Jamie Foxx’s Full Relationship Timeline", "sailthru.contenttype": "standard-article", "m1": ".content-hed", "m2": ".content-dek p", "next-head-count": 47}, "movies": [], "publish_date": 1566251760.0, "source": "http://www.harpersbazaar.com", "summary": ""}