{"url": "http://wikinetworth.com/celebrities/kelvin-hayden-married-wife-girlfriend-baby-parents-salary-net-worth.html", "text": "Kelvin Hayden is a former football cornerback recruited by the Indianapolis Colts. He is the most noteworthy player in NFL. Kelvin also played for the Atlanta Falcons and Chicago Bears in 2012. The Chicago-born-footballer is famous as Super Bowl champion. Alongside football, Kelvin is a co-founder of Karpa Deem gym and is also self-bodybuilder. Kelvin summoned the prominent part of his net worth from his career in football. He is also generating his income from his gym house.\n\nKelvin Hayden is a former football cornerback recruited by the Indianapolis Colts. He is the most noteworthy player in NFL. Kelvin also played for the Atlanta Falcons and Chicago Bears in 2012. The Chicago-born-footballer is famous as Super Bowl champion. Alongside football, Kelvin is a co-founder of Karpa Deem gym and is also self-bodybuilder.\n\nHow Much Is Kelvin's Net Worth?\n\nKelvin summoned the prominent part of his net worth from his career in football. Back in February 2009, Kelvin Hayden signed an agreement of a five-year deal worth $43 million with The Indianapolis Colts. The deal also included $22 million money in guarantees. Undoubtedly, Kelvin has a net worth of million figures.\n\nKelvin previously signed a deal with Peyton Manning, Reggie Wayne, Marvin Harrison, Dwight Freeney, Dallas Clark, Ryan Lilja and Bob Sanders. He also gained a lavish revenue from the deals. Kelvin signed a contract with the Chicago Bears with a deal of $840,000, including an average annual salary of $840,000. Since 2005, his career in football helped him to generate $17.5 million wealth.\n\nAs of now, Kelvin has retired from football and is a co-founder of Karpa Deem gym. He is also generating his income from his gym house.\n\nKelvin Hayden Engaged To Taraji P. Henson\n\nKelvin Hayden is in a blissful relationship with the Empire star, Taraji P. Henson. The couple was in a secret relationship until Kelvin's girlfriend confirmed about their affairs in December 2017 saying that they have been dating since 2015.\n\nRecently on 14 May 2018, Taraji shared a photo of her flaunting a beautiful diamond engagement ring. As per the caption, Kelvin proposed her on Mother's Day celebration on 13 May 2018.\n\nKelvin Hayden got engaged to his long-time girlfriend on 14 May 2018 (Photo: Instagram)\n\nKelvin is in a blissful relationship with his newly engaged fiancée, who has great chances of being his future wife. However, Kelvin hasn't opened up about his plans of getting married.\n\nPreviously, Taraji was in a relationship with her high school sweetheart, William Lamarr Johnson. Later, the two were blessed with a baby boy named Marcell in 1994. But, the relationship ended tragically after William was murdered in 2003. Likewise, Kelvin has a 10-year-old daughter named Kyra from his previous relationship.\n\nKelvin Hayden's Family: Relationship With Parents\n\nKelvin Hayden was born in Chicago. Kelvin was raised by his mother. As he mentioned in one of his Instagram photos, he saw his father for the first time at the age of seven and second time when he was 15. Kelvin has an affectionate bond with both his father and mother. He even wished his father on Father's Day of 2013.\n\nKelvin has a great attachment to his mother and is thankful for her sacrifices. He even wished her on her birthday on 13 December 2014.\n\nKelvin Hayden wishes her mother on her birthday on 13 December 2014 (Photo: Instagram)\n\nShort Bio\n\nKelvin Hayden was born as Kelvin Darnell Hayden on 23 July 1983 in Chicago, Illinois, USA. The former cornerback stands at the height of 1.83 m (6').\n\nHayden went to Hubbard High School and became a starter for four-year in football. He then attended Joliet Junior College for two years. Later, he went to the University of Illinois. He is of American nationality and belongs to mixed ethnicity.", "images": ["http://wikinetworth.com/uploads/kevin-hayden-mom.JPG", "http://wikinetworth.com/uploads/kelvin-engaged-with-Taraji.JPG", "https://wikinetworth.com/uploads/kelvin-hayden.jpg", "https://wikinetworth.com/userfiles/images/wn/wiki-logo.png", "https://wikinetworth.com/userfiles/images/wn/fav-icon.png", "https://wikinetworth.com/frontend/images/socialmedia/popup.png", "https://images.dmca.com/Badges/dmca_protected_sml_120f.png", "https://wikinetworth.com/userfiles/images/wn/wn-mobile-text-logo.png"], "top_img": "https://wikinetworth.com/uploads/kelvin-hayden.jpg", "keywords": [], "authors": ["Wn Writer"], "canonical_link": "https://wikinetworth.com/celebrities/kelvin-hayden-married-wife-girlfriend-baby-parents-salary-net-worth.html", "title": "Kelvin Hayden Married, Wife, Girlfriend, Baby, Parents, Salary, Net Worth", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "twitter": {"card": "summary_large_image", "site": "wikinetworth", "creator": "@wikinetworth", "title": "Kelvin Hayden Married, Wife, Girlfriend, Baby, Parents, Salary, Net Worth", "description": "Know more about Kelvin Hayden married, wife, girlfriend, baby, parents, salary, and net worth. Kelvin Hayden is a former football cornerback recruited by the Indianapolis Colts.", "image": "https://wikinetworth.com/uploads/kelvin-hayden.jpg"}, "og": {"site_name": "wikinetworth", "type": "blog", "locale": "en_US", "title": "Kelvin Hayden Married, Wife, Girlfriend, Baby, Parents, Salary, Net Worth", "url": "https://wikinetworth.com/celebrities/kelvin-hayden-married-wife-girlfriend-baby-parents-salary-net-worth.html", "description": "Know more about Kelvin Hayden married, wife, girlfriend, baby, parents, salary, and net worth. Kelvin Hayden is a former football cornerback recruited by the Indianapolis Colts.", "image": {"identifier": "https://wikinetworth.com/uploads/kelvin-hayden.jpg", "secure_url": "https://wikinetworth.com/uploads/kelvin-hayden.jpg"}}, "google-site-verification": "wz9L4Xrb4KcYidM8zhr7TwrMnCxXjxmIPTQNLI8cgMM", "robots": "all", "description": "Know more about Kelvin Hayden married, wife, girlfriend, baby, parents, salary, and net worth. Kelvin Hayden is a former football cornerback recruited by the Indianapolis Colts."}, "movies": [], "publish_date": null, "source": "http://wikinetworth.com", "summary": ""}