{"url": "https://www.yahoo.com/entertainment/13-reasons-star-christian-navarro-tony-theme-song-new-movie-bushwick-150029676.html", "text": "Christian Navarro as Tony in Netflix’s ’13 Reasons Why’ (Photo: Netflix)\n\nThe mystery that is Tony Padilla on 13 Reasons Why may not be so mysterious for much longer.\n\nThe Netflix teen drama is filming its second season, preparing for debut in 2018, and actor Christian Navarro told Yahoo TV that more layers will be peeled back on all of the characters in the show — including the slick-haired, leather jacket-wearing, cassette tape-loving Tony.\n\nNavarro chatted with us about Season 2, the controversy over the show, and of course, that hair. He also talked about his upcoming movie Bushwick, a dystopian movie thriller starring Dave Bautista that opens this Friday.\n\n13 Reasons Why has become a major cultural touchstone. It’s very popular, but also had its detractors. What was your take on the controversy over its depiction of suicide?\n\nControversy ultimately helps the show and helps our platform. What we set out to do when we were making the show was to try to help one person. If there’s one person out there, if there’s one teenager who watches the show and realizes that they aren’t alone in this — then we would’ve been successful.\n\nSo by that barometer, we’ve been pretty successful, because millions of teenagers are now having a dialogue, with their parents and their teachers and with each other, about what it means to be kind to each other. I understand and respect everyone’s opinion, particularly parents who want to protect their children. I just want to offer up that maybe it’s more beneficial to talk about it.\n\nWhat kind of response have you gotten from people on the street and on social media?\n\nWe have the best fans in the world. I see them all the time on the street; I interact with them on social media. They are very moved and affected by the show, and it’s made their lives better. There’s nothing more humbling or gratifying to me than to be part of a project that makes people feel like they can be who they want to be and not have to conform to anyone else’s ideals, especially in this day and age in light of everything that’s going on in our country.\n\nStory continues\n\nWere you surprised that the show got a second season?\n\nNo, we’re looking at the most talked-about show this year — still! I was humbled by it; I didn’t know when we would hear that announcement. I definitely had a feeling we would come back for Season 2. It seemed inevitable.\n\nDylan Minnette as Clay and Christian Navarro as Tony in Netflix’s ’13 Reasons Why’ (Photo: Netflix)\n\nWhat will Season 2 be like?\n\nIt’s going to continue the story for all of those characters. Other than that, I have to keep my cards close to the chest. But you can expect a lot more of Tony Padilla and Clay Jensen and Hannah Baker. We’re building upon a solid foundation. I’m in the midst of it right now, so I’m excited every week when I get scripts.\n\nAre we going to get more insight into Tony this year?\n\nI certainly hope I do a good job in allowing you to. I’ve been working hard this season and going into it. One of the things I wanted to make sure with Brian Yorkey, the showrunner, is that we explore Tony, independent of Clay Jensen and Hannah Baker. We’ve got a couple more months, and I’m excited to see another side of this guy.\n\nTony wasn’t named on the tapes, but do you feel like he’s complicit in Hannah’s death in a way?\n\nAbsolutely. One of the messages of the show is that we’re all complicit. If you stand by and do nothing, you are as guilty if not more guilty than those who are persecuting. What we discover in this season is how exactly complicit and how that chips at his soul.\n\nChristian Navarro as Tony and Katherine Langford as Hannah in Netflix’s ’13 Reasons Why’ (Photo: Netflix)\n\nThis is a big cast, and Tony didn’t interact with all of the characters in Season 1. Is there someone you’d especially like to work with?\n\nThe first answer is Brandon Flynn, who plays Justin Foley. He and I went to college together. He’s three years younger than me. I remember seeing him act in college; I went back after I graduated. True story, you can ask him someday: I went up to him and said, “You’re going to be big, man, you’re so talented.” So, I would love to work with my brother Brandon. Maybe we’ll get to see a little bit of that in Season 2.\n\nAnd Alisha Boe (Jessica Shaw), who’s become my best friend during this whole journey. She is a phenomenal actress and I’d love the opportunity to work with her.\n\nMy favorite people. @alishaboe @flynnagin11 Alisha with the crazy strong selfie/ussie game A post shared by Christian Lee Navarro (@christianleenavarro) on Aug 22, 2017 at 7:09pm PDT\n\nSo, let’s talk about Tony’s hair. How did you come up with that style?\n\nIt went through a couple of iterations. But really it was Brian the showrunner, myself, and the hairstylist figuring out who this guy is. We were inspired by Cry-Baby with Johnny Depp. We wanted something cool and sleek, and I think we found something that was, for a lack of a better term, iconic. We did it again this year, we have a new hairstylist, and she, myself, and Brian sat down again. I think we landed on something special for Season 2.\n\nWe saw that Instagram post you shared where you sing a song about Tony with your friend, the musician Evangelia. Would you want to sing on the show?\n\nFirst of all, that’s completely out of my hands, but I would love for that to be a possibility. Brian, our showrunner, has heard the song. I’m in New York right now, and I’m going to be cutting vocals for it so that we can release it. And Evangelia is a fantastic artist.\n\nMaybe it’ll work its way into the show. It was something that was intimate and done for me to get into character. I wanted to sit down and write something that would allow me to step through the in-between of the seasons, and Evangelia helped me with the song. I can carry a tune, but I’m not particularly musically inclined, so I was so blessed to have her there with me.\n\nWhat drew you to the Bushwick project?\n\nDave Bautista. I’ve always been a fan of his. I was really moved by his performance as Drax [in Guardians of the Galaxy]. It’s a comedic role, but it was so nuanced and subtle. So, I jumped at the opportunity to work beside him. He is a kind, giving person, a giant teddy bear with a heart of gold. I’m not much in it, but it was a pleasure to be there while I was.\n\n#thuglife #bushwick #makingmovies A post shared by Christian Lee Navarro (@christianleenavarro) on Dec 3, 2015 at 6:53am PST\n\nDo you feel like it speaks to the current political climate?\n\nTwo years ago when we filmed it, I thought it was a little bit out there. Now, unfortunately, it feels closer and closer to reality. That is definitely jarring. But I think it’s a movie that once people see it, it’ll wake them up to some of the realities in the country, or at least cause them to ask questions and do some research. It’s not so unlikely all of the sudden.\n\nBushwick will be in theaters and on VOD on Aug. 25.\n\nRead mMore from Yahoo TV:", "images": ["https://s.yimg.com/rz/p/yahoo_entertainment_en-US_h_w_entertainmentv2.png", "https://s.yimg.com/ny/api/res/1.2/PfTMepCYWXEuzd9IvqSCGw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY0MA--/https://s.yimg.com/uu/api/res/1.2/5xMo6cvCOp2hj1XVz_yJgg--~B/aD02ODM7dz0xMDI0O2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/352df8c28c9d5bd65537dbf8d3b23945", "https://s.yimg.com/ny/api/res/1.2/M_dTSs2l_st5D45b4kzF3g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NDY-/https://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/15f0a27d56c1c9ea79a3a4de03efa606", "https://s.yimg.com/ny/api/res/1.2/7JOOHnw2N_SFubWRzMV56A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTM0MjtoPTQ4/https://s.yimg.com/os/creatr-uploaded-images/2020-12/d7f38f00-340b-11eb-b7bf-540525a865da", "https://s.yimg.com/ny/api/res/1.2/7mO6amHCxxJ933gjCHj6jQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTgwO2g9ODA-/https://s.yimg.com/os/creatr-images/GLB/2017-10-19/a6494b00-b503-11e7-ae84-3364a56b6e6b_kellywoo.jpg", "https://s.yimg.com/rz/p/yahoo_entertainment_en-US_h_p_entertainmentv2.png", "https://s.yimg.com/ny/api/res/1.2/wRLUJt1SrQUbpikVEBazKg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTY0MA--/https://s.yimg.com/uu/api/res/1.2/p9r8tshxQK8s3vYE87RZGA--~B/aD02ODM7dz0xMDI0O2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/e62559b3fc30504daff919433f7fac2e", "https://sb.scorecardresearch.com/p?c1=2&c2=7241469&c5=1197800334&c7=https%3A%2F%2Fwww.yahoo.com%2Fentertainment%2F13-reasons-star-christian-navarro-tony-theme-song-new-movie-bushwick-150029676.html&c14=-1", "https://s.yimg.com/ny/api/res/1.2/DZa..qLXDUe_IjnAlkbrng--/YXBwaWQ9aGlnaGxhbmRlcjt3PTk2MDtoPTUxNw--/https://s.yimg.com/uu/api/res/1.2/N0hwSPnbvSvZXaQmky36sA--~B/aD03NTY7dz0xNDA0O2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/15f0a27d56c1c9ea79a3a4de03efa606", "https://s.yimg.com/cv/apiv2/default/20190501/placeholder.gif"], "top_img": "https://s.yimg.com/ny/api/res/1.2/M_dTSs2l_st5D45b4kzF3g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NDY-/https://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/15f0a27d56c1c9ea79a3a4de03efa606", "keywords": [], "authors": [], "canonical_link": "https://www.yahoo.com/entertainment/13-reasons-star-christian-navarro-tony-theme-song-new-movie-bushwick-150029676.html", "title": "'13 Reasons Why' star Christian Navarro on his Tony theme song and new movie 'Bushwick'", "meta_data": {"oath": {"guce": {"consent-host": "guce.yahoo.com"}}, "news_keywords": "Christian Navarro, Tony Padilla, Netflix, Brian Yorkey, Hannah Baker, Christian Lee Navarro, Dave Bautista", "twitter": {"title": "'13 Reasons Why' star Christian Navarro on his Tony theme song and new movie 'Bushwick'", "description": "Christian Navarro talks Season 2 of '13 Reasons Why,' the controversy over the show, and of course, that hair.", "site": "@Yahoo", "dnt": "on", "image": {"identifier": "https://s.yimg.com/ny/api/res/1.2/M_dTSs2l_st5D45b4kzF3g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NDY-/https://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/15f0a27d56c1c9ea79a3a4de03efa606", "src": "https://s.yimg.com/ny/api/res/1.2/M_dTSs2l_st5D45b4kzF3g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NDY-/https://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/15f0a27d56c1c9ea79a3a4de03efa606"}, "creator": "@kellyhwoo", "card": "summary_large_image"}, "og": {"title": "'13 Reasons Why' star Christian Navarro on his Tony theme song and new movie 'Bushwick'", "url": "https://www.yahoo.com/entertainment/13-reasons-star-christian-navarro-tony-theme-song-new-movie-bushwick-150029676.html", "description": "Christian Navarro talks Season 2 of '13 Reasons Why,' the controversy over the show, and of course, that hair.", "type": "article", "image": {"identifier": "https://s.yimg.com/ny/api/res/1.2/M_dTSs2l_st5D45b4kzF3g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NDY-/https://media.zenfs.com/en/homerun/feed_manager_auto_publish_494/15f0a27d56c1c9ea79a3a4de03efa606", "width": 1200, "height": 646}}, "al": {"android": {"url": "yahoo://article/view?uuid=9a486529-2765-33d0-8a14-3a3e9307126a&src=web", "app_name": "Yahoo", "package": "com.yahoo.mobile.client.android.yahoo"}, "ios": {"url": "yahoo://article/view?uuid=9a486529-2765-33d0-8a14-3a3e9307126a&src=web", "app_name": "Yahoo", "app_store_id": 304158842}}, "description": "Christian Navarro talks Season 2 of '13 Reasons Why,' the controversy over the show, and of course, that hair.", "robots": "max-image-preview:large"}, "movies": ["https://www.youtube.com/embed/dKvNp0PEkHY"], "publish_date": null, "source": "https://www.yahoo.com", "summary": ""}