{"url": "https://www.hollywoodreporter.com/news/kill-bill-stunt-coordinator-breaks-silence-uma-thurman-crash-1083542", "text": "The stunt coordinator on the Kill Bill movies has broken his silence on a disturbing recent allegation made by Uma Thurman regarding a crash during production that left her injured.\n\nCoordinator Keith Adams told The Hollywood Reporter that he and his entire department were kept off set the day Thurman was allegedly pressured by director Quentin Tarantino to drive a rattrap convertible down a curved, sandy Mexican road at 40 mph, resulting in a crash that gave her a concussion, damaged her knees and could have caused worse injuries.\n\n“No stunts of any kind were scheduled for the day of Ms. Thurman’s accident,” states Adams in an email to THR. “All of the stunt department was put on hold and no one from the stunt department was called to set. At no point was I notified or consulted about Ms. Thurman driving a car on camera that day.”\n\n“Had I been involved,” Adams continues, “I would have insisted not only on putting a professional driver behind the wheel but also insuring that the car itself was road-worthy and safe.”\n\nAdams — an experienced coordinator with a particular expertise in automotive work, according to veteran stunt performer and coordinator Andy Armstrong — did not say whether he thought his department was intentionally held at bay to facilitate having an actor perform driving maneuvers. It was not immediately clear who prepared the call sheet that day and who decided to idle the stunt department. Tarantino told Deadline that “none of us ever considered it a stunt. It was just driving.”\n\n“The circumstances of this event were negligent to the point of criminality,” said Thurman in an Instagram post Monday. “I do not believe though with malicious intent.” (After the crash came a cover-up which “did have malicious intent,” she wrote, naming three production executives.)\n\nIt may have been “just driving” to Tarantino, but performers’ union SAG-AFTRA said in a statement that it “sounds like a stunt and would be a likely safety violation.”\n\nThe new statement from the stunt coordinator underscores Thurman’s description of the 1973 Karmann Ghia as a profound hazard. “That was a deathbox,” she told Maureen Dowd for a New York Times story published on Feb. 3 that kicked off a round of speculation about the incident. Thurman explained to the writer that “the seat wasn’t screwed down properly” and that she’d been told the vintage convertible had been converted from stick shift to automatic.\n\nThe car’s allegedly sad shape came as no surprise to Melissa Stubbs, also a veteran stunt performer and coordinator. “A picture car is usually a piece of shit,” she told THR bluntly, using industry argot for vehicles that appear onscreen.\n\nArmstrong agreed, noting that non-stunt picture cars are generally towed on flatbed “process trailers” while being filmed, making it easier to rig lights and cameras and allowing an actor to give the illusion of driving without anyone being endangered. For that reason, Armstrong indicated, production personnel focus on making a picture car look good onscreen, and not necessarily on making it safely drivable.\n\nIn addition, video of the crash indicates that the then-30-year-old ragtop was without roll bars, shoulder belts or head restraints. Thurman’s head whips backward and hangs over the low seat back after the crash. It’s unclear whether there was a lap belt or whether Thurman was wearing it if there was.\n\n“That could have been a death by decapitation,” veteran coordinator Armstrong said. “The car could easily have rolled over [or] the camera could have flown forward. It was irresponsibility on a mega level.”\n\nMany people share safety duties on set: the producers (lead producer Lawrence Bender apologized Wednesday and also said he “never hid anything“), the director (Thurman has described Tarantino as regretful and remorseful), the 1st assistant director (although this may be less clear in a non-DGA film like Kill Bill) — and, of course, the stunt coordinator.\n\n“On any set, my number one priority and the priority of any stunt coordinator is the safety of the cast and crew,” said Adams. “For a stunt coordinator to do their job properly, they must be involved at every step of the process and given the opportunity to intervene when changes to the shoot are made.”\n\n“Unfortunately,” he added, “I did not have that opportunity in this case.”", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/02/kill_bill_volume_2_driving.jpg?w=1296&h=730&crop=1", "https://www.hollywoodreporter.com/wp-content/uploads/2018/02/kill_bill_volume_2_driving.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/02/kill_bill_volume_2_driving.jpg?w=1024", "keywords": [], "authors": ["Jonathan Handel"], "canonical_link": "https://www.hollywoodreporter.com/movies/movie-news/kill-bill-stunt-coordinator-breaks-silence-uma-thurman-crash-1083542/", "title": "‘Kill Bill’ Stunt Coordinator Breaks Silence on Uma Thurman Crash (Exclusive)", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "\"At no point was I notified or consulted about Ms. Thurman driving a car on camera that day,\" says coordinator Keith Adams.", "news_keywords": "labor, Quentin Tarantino, SAG-AFTRA, Uma Thurman", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Jonathan Handel", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1083542, "title": "'Kill Bill' Stunt Coordinator Breaks Silence on Uma Thurman Crash (Exclusive)", "published_at": "2018-02-09 18:14:40", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/02/kill_bill_volume_2_driving.jpg?w=1024", "comment_count": 0, "tags": "Uma Thurman", "topics": "Movies", "body": "The stunt coordinator on the Kill Bill movies has broken his silence on a disturbing recent allegation made by Uma Thurman regarding a crash during production that left her injured.\r\nCoordinator Keith Adams told The Hollywood Reporter that he and his entire department were kept off set the day Thurman was allegedly pressured by director Quentin Tarantino to drive a rattrap convertible down a curved, sandy Mexican road at 40 mph, resulting in a crash that gave her a concussion, damaged her knees and could have caused worse injuries.\r\n\"No stunts of any kind were scheduled for the day of Ms. Thurman's accident,\" states Adams in an email to THR. \"All of the stunt department was put on hold and no one from the stunt department was called to set. At no point was I notified or consulted about Ms. Thurman driving a car on camera that day.\"\r\n\"Had I been involved,\" Adams continues, \"I would have insisted not only on putting a professional driver behind the wheel but also insuring that the car itself was road-worthy and safe.\"\r\nAdams — an experienced coordinator with a particular expertise in automotive work, according to veteran stunt performer and coordinator Andy Armstrong — did not say whether he thought his department was intentionally held at bay to facilitate having an actor perform driving maneuvers. It was not immediately clear who prepared the call sheet that day and who decided to idle the stunt department. Tarantino told Deadline that \"none of us ever considered it a stunt. It was just driving.\"\r\n\"The circumstances of this event were negligent to the point of criminality,\" said Thurman in an Instagram post Monday. \"I do not believe though with malicious intent.\" (After the crash came a cover-up which \"did have malicious intent,\" she wrote, naming three production executives.)\r\nIt may have been \"just driving\" to Tarantino, but performers' union SAG-AFTRA said in a statement that it \"sounds like a stunt and would be a likely safety violation.\"\r\nThe new statement from the stunt coordinator underscores Thurman's description of the 1973 Karmann Ghia as a profound hazard. \"That was a deathbox,\" she told Maureen Dowd for a New York Times story published on Feb. 3 that kicked off a round of speculation about the incident. Thurman explained to the writer that \"the seat wasn't screwed down properly\" and that she'd been told the vintage convertible had been converted from stick shift to automatic.\r\nThe car's allegedly sad shape came as no surprise to Melissa Stubbs, also a veteran stunt performer and coordinator. \"A picture car is usually a piece of shit,\" she told THR bluntly, using industry argot for vehicles that appear onscreen.\r\nArmstrong agreed, noting that non-stunt picture cars are generally towed on flatbed \"process trailers\" while being filmed, making it easier to rig lights and cameras and allowing an actor to give the illusion of driving without anyone being endangered. For that reason, Armstrong indicated, production personnel focus on making a picture car look good onscreen, and not necessarily on making it safely drivable.\r\nIn addition, video of the crash indicates that the then-30-year-old ragtop was without roll bars, shoulder belts or head restraints. Thurman's head whips backward and hangs over the low seat back after the crash. It's unclear whether there was a lap belt or whether Thurman was wearing it if there was.\r\n\"That could have been a death by decapitation,\" veteran coordinator Armstrong said. \"The car could easily have rolled over [or] the camera could have flown forward. It was irresponsibility on a mega level.\"\r\nMany people share safety duties on set: the producers (lead producer Lawrence Bender apologized Wednesday and also said he \"never hid anything\"), the director (Thurman has described Tarantino as regretful and remorseful), the 1st assistant director (although this may be less clear in a non-DGA film like Kill Bill) — and, of course, the stunt coordinator.\r\n\"On any set, my number one priority and the priority of any stunt coordinator is the safety of the cast and crew,\" said Adams. \"For a stunt coordinator to do their job properly, they must be involved at every step of the process and given the opportunity to intervene when changes to the shoot are made.\"\r\n\"Unfortunately,\" he added, \"I did not have that opportunity in this case.\"\r\n\r\n\t\r\n\t\t\r\n\t\t\t\r\n\t\t\t\t \r\n\t\t\r\n\t\ti post this clip to memorialize it's full exposure in the nyt by Maureen Dowd. the circumstances of this event were negligent to the point of criminality. i do not believe though with malicious intent. Quentin Tarantino, was deeply regretful and remains remorseful about this sorry event, and gave me the footage years later so i could expose it and let it see the light of day, regardless of it most likely being an event for which justice will never be possible. he also did so with full knowledge it could cause him personal harm, and i am proud of him for doing the right thing and for his courage. THE COVER UP after the fact is UNFORGIVABLE. for this i hold Lawrence Bender, E. Bennett Walsh, and the notorious Harvey Weinstein solely responsible. they lied, destroyed evidence, and continue to lie about the permanent harm they caused and then chose to suppress. the cover up did have malicious intent, and shame on these three for all eternity. CAA never sent anyone to Mexico. i hope they look after other clients more respectfully if they in fact want to do the job for which they take money with any decency.\r\n\t\tA post shared by  Uma Thurman (@ithurman) on Feb 5, 2018 at 10:15am PST", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Kill Bill’ Stunt Coordinator Breaks Silence on Uma Thurman Crash (Exclusive)", "url": "https://www.hollywoodreporter.com/movies/movie-news/kill-bill-stunt-coordinator-breaks-silence-uma-thurman-crash-1083542/", "description": "“At no point was I notified or consulted about Ms. Thurman driving a car on camera that day,” says coordinator Keith Adams.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/02/kill_bill_volume_2_driving.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2018-02-09T18:14:40+00:00", "modified_time": "2018-02-10T14:00:23+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Kill Bill’ Stunt Coordinator Breaks Silence on Uma Thurman Crash (Exclusive)", "description": "“At no point was I notified or consulted about Ms. Thurman driving a car on camera that day,” says coordinator Keith Adams.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/02/kill_bill_volume_2_driving.jpg?w=1296"}}, "movies": [], "publish_date": 1518200080.0, "source": "https://www.hollywoodreporter.com", "summary": ""}