{"url": "https://ew.com/awards/2017/11/30/2017-new-york-film-critics-circle-winners-list/", "text": "BPM Show More About BPM type Movie\n\nAs the dust settles in the wake of The Post's firm landing atop the National Board of Review's annual top 10 list (and reliable best picture-nominee bellwether), the awards train is chugging right along, as the New York Film Critics Circle — the first of many major journalist collectives set to bestow year-end accolades upon 2017's best films — announced its annual crop of winners on Thursday, positioning Greta Gerwig's Lady Bird atop the competition as its best film of 2017.\n\nCritics groups around the country — namely organizations in New York, Los Angeles, as well as the Broadcast Film Critics Association — have established themselves as key players in the weeks leading up to the Academy Award nominations, often heralding the official entry of late-breaking contenders into the race at large, though they often place a spotlight on smaller, independent, and internationally-skewing titles and performances that otherwise might not have registered on industry voters' radars. This year, the NYFCC has given a key push to several fringe contenders hovering around the edges of the Oscar race, placing a spotlight on Girls Trip supporting actress Tiffany Haddish, whose standout role in perhaps the year's most beloved comedy (and one of the genre's biggest box office hits of 2017) could translate to a Melissa McCarthy-style nod from the Academy if she maintains momentum with larger awards bodies in the weeks ahead. On the men's side, The Florida Project's Willem Dafoe picks up more steam following his Gotham Awards nomination with a NYFCC victory in the best supporting actor category.\n\nLead actors Timothée Chalamet and Saoirse Ronan triumphed in their respective categories as well, continuing what appears to be an early consensus forming around Call Me By Your Name (the Gotham Awards' best picture winner) and Lady Bird (the National Board of Review's best director winner). Though Lady Bird was the big winner of the day, The Florida Project picked up an additional win for director Sean Baker, who was also recognized with nominations and/or wins from the Film Independent Spirit Awards, the Gotham Awards, and the National Board of Review.\n\nWhile Netflix still faces a bumpy road ahead as its streaming-focused release strategy presents a potential roadblock for its prestige titles like Mudbound and First They Killed My Father, the NYFCC has seemingly given the former film equal footing as its theatrical counterparts, highlighting Rachel Morrison's camerawork with a well deserved win among the cinematography set.\n\nAfter landing notices from the National Board of Review for its script and as one of the top 10 films of the year, Paul Thomas Anderson's Phantom Thread additionally courted NYFCC attention, taking the group's screenplay prize in what's bound to be a fruitful showing on the precursor circuit for the renowned auteur's latest project, also touted as the final film starring retiring actor Daniel Day-Lewis.\n\nWhile not a steadfast portent of Academy tastes to come (only three NYFCC best film winners have gone on to take best picture at the Oscars since 2007: No Country For Old Men, The Hurt Locker, and The Artist), the NYFCC's picks can add much-needed buzz to a given film or performance, reprioritizing respective contenders for non-critic guild voters deciding which movies to watch as they make their way through their collection of screeners.\n\nIn terms of crossover into Oscar nominations, each of the NYFCC's best film victors since 2007 — save for 2015's Carol — has received a corresponding Oscar nomination for best picture. Across the same frame, only two NYFCC best actress winners — Rachel Weisz (2012's The Deep Blue Sea) and Sally Hawkins (Happy-Go-Lucky) — didn't follow up with an Oscar nod. When it comes to the men, the only NYFCC best actor champions since 2007 who didn't receive an Oscar nomination occurred one after the other, when a three-year dry spell saw Robert Redford (All Is Lost), Timothy Spall (Mr. Turner), and Michael Keaton (Spotlight) emerging with NYFCC wins between 2013 and 2015.\n\nCheck out the full list of 2017 NYFCC Awards winners below, updating live as they're announced.\n\nBest Film: Greta Gerwig – Lady Bird\n\nBest Director: Sean Baker – The Florida Project\n\nBest Actor: Timothée Chalamet – Call Me By Your Name\n\nBest Actress: Saoirse Ronan – Lady Bird\n\nBest Supporting Actor: Willem Dafoe – The Florida Project\n\nBest Supporting Actress: Tiffany Haddish – Girls Trip\n\nBest Screenplay: Paul Thomas Anderson – Phantom Thread\n\nBest Cinematography: Rachel Morrison – Mudbound\n\nBest Foreign Language Film: Robin Campillo – BPM (Beats Per Minute)\n\nBest Documentary: Agnès Varda, JR – Faces Places\n\nBest Animated Film: Lee Unkrich, Adrian Molina – Coco\n\nBest First Film: Jordan Peele – Get Out\n\nSpecial Awards: Molly Haskell", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F11%2Fv1-0064_lb_00000-2000.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F07%2F14%2FJosh-Hartnett-The-Faculty-071422.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F08%2F05%2FBrett-Goldstein-Hannah-Waddingham-Three-Rounds-080522-2.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%2067'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Few.com%2Fimg%2Fmisc%2F300x250_magazines_and_more.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F10%2F06%2FScreen-Shot-2022-10-06-at-3.48.51-PM.png", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F11%2Fv1-0064_lb_00000-2000.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F08%2F16%2FBetter-Call-Saul_081622_4.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F11%2Fv1-0064_lb_00000-2000.jpg", "keywords": [], "authors": ["Joey Nolfi", "November", "At Am Est"], "canonical_link": "https://ew.com/awards/2017/11/30/2017-new-york-film-critics-circle-winners-list/", "title": "2017 New York Film Critics Circle winners announced: See the full list", "meta_data": {"viewport": "width=device-width,initial-scale=1", "theme-color": "#111", "keywords": "entertainment, entertainment news, ew, entertainment weekly", "news_keywords": "entertainment, entertainment news, ew, entertainment weekly", "description": "The NYFCC has announced its year-end winners. See the full list of films here.", "robots": "max-image-preview:large", "og": {"title": "2017 New York Film Critics Circle winners announced: See the full list", "type": "article", "site_name": "EW.com", "url": "https://ew.com/awards/2017/11/30/2017-new-york-film-critics-circle-winners-list/", "description": "The NYFCC has announced its year-end winners. See the full list of films here.", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F11%2Fv1-0064_lb_00000-2000.jpg", "width": 2000, "height": 1000}}, "pinterest": {"url": "https://ew.com/awards/2017/11/30/2017-new-york-film-critics-circle-winners-list/", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F11%2Fv1-0064_lb_00000-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/awards/2017/11/30/2017-new-york-film-critics-circle-winners-list/", "title": "2017 New York Film Critics Circle winners announced: See the full list", "description": "The NYFCC has announced its year-end winners. See the full list of films here.", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F11%2Fv1-0064_lb_00000-2000.jpg"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}, "url": "https://ew.com/awards/2017/11/30/2017-new-york-film-critics-circle-winners-list/"}, "movies": [], "publish_date": 1512000000.0, "source": "https://ew.com", "summary": ""}