{"url": "https://www.azcentral.com/story/entertainment/television/2018/07/30/heres-who-should-and-should-not-abc-next-bachelor/821089002/", "text": "Here's who should (and should not) be ABC's next 'The Bachelor'\n\nABC's \"The Bachelorette\" is winding down, which only means one thing: \"The Bachelor\" rumors are starting to spread.\n\nOne lucky suitor will be chosen, plucked presumably from a previous \"Bachelorette\" season, to have 30 women vie for his heart, all while living in a secluded mansion and traveling the world in the name of love.\n\nABC has kept a tight lid on who the next frontman will be, but that doesn't mean there's not room for healthy speculation.\n\nIf you still haven't recovered from the last disastrous season of \"The Bachelor\" that featured Scottsdale local Arie Luyendyk Jr., you still have time — the show's summer spinoff \"Bachelor in Paradise\" airs in early August. \"The Bachelor\" will likely air in the fall.\n\nHere's who would make the most sense on season 23 of \"The Bachelor.\"\n\nJason Tartick\n\nThis is a no-brainer. The banker from Seattle became a front-runner during season 14 of \"The Bachelorette,\" starring Becca Kufrin. She tearfully sent him home in week nine just before their overnight date in Thailand because she felt she just didn't have a strong enough connection with him.\n\nJason returned to her hotel room the next day to get some closure and presented her with a scrapbook of their time together, thanking her for giving him a chance. *swoon*\n\nDuring his time on \"The Bachelorette,\" Jason showed Bachelor Nation his charming hometown in Buffalo, N.Y., his supportive friends and his loving family. He avoided drama with the other men and seemed to wear his heart on his sleeve throughout the season. He's checked all the boxes in my book.\n\nNext Bachelor?\n\n10. too hard\n\n9. to\n\n8. choose\n\n7. which of\n\n6. these\n\n5. amazing guys\n\n4. deserve\n\n3. to find\n\n2. love\n\n1. Jason #thebachelorette⁠ ⁠ — Lindsay Brammell (@lindsbramm93) July 17, 2018\n\nClay Harbor\n\nClay quickly stole Bachelor Nation's heart during his time on Becca's season of \"The Bachelorette\" but abruptly left the show after getting injured during a group date.\n\nThe professional football player from Illinois was sent to the hospital after a bad fall during \"The Becca Bowl\" in week three. He returned from the hospital with his arm in a sling, and Becca gave him a rose for being a trooper. He later learned he needed to have surgery on his wrist and decided to leave the competition.\n\nWhile his time on the show was brief, he was able to show his playful side and sweet demeanor. During his tearful exit, he told Becca the surgery was important for him to get back to work to help support his family.\n\nClay, a tight end, was drafted by the Philadelphia Eagles in the fourth round of the 2010 NFL Draft. He is currently a free agent.\n\nCLAY FOR BACHELOR 2019. DO NOT FAIL ME AGAIN, ABC.\n\n\n\nDO. NOT. LET. ME. DOWN. #TheBachelorette — Megan (@megan_musings) June 12, 2018\n\nWills Reid\n\nwith love from Wills 🖤🍦 A post shared by Wills (@stillwills) on Jul 27, 2018 at 7:38pm PDT\n\nMost of Bachelor Nation fell head over heels for the graphic designer from Los Angeles. He was cool as a cucumber throughout the season with his laid-back attitude, squashing drama with the other men before anything could bubble over.\n\nWills was also known for his eclectic fashion. He regularly rocked plaid suits and patterned rompers. What would his wardrobe look like if he was \"The Bachelor?\" We may never know.\n\nWills is an unlikely choice because he is set to appear on \"Bachelor in Paradise\" this summer, but crazier things have happened on the dating franchise.\n\nMe waiting for them to announce Wills as the next Bachelor #TheBachelorette pic.twitter.com/nv5CkSCzs4 — halpal (@hal_pal06) July 10, 2018\n\nBen Higgins\n\nBen is a long shot here, but so was Arie, and look how that turned out.\n\nBen starred on \"The Bachelor\" on season 20, but split from with his reality TV fiancee Lauren Bushnell about a year later. The two even had their own spinoff show, \"Ben and Lauren: Happily Ever After?\"\n\nHe appeared briefly on \"Bachelor: Winter Games\" in 2016, but left because he wasn't quite over his breakup with Lauren. He's recently open up about his heartbreak and said that he really is ready to start dating again.\n\n\"I'm at this stage now where I've done the grind for a year, I've traveled and worked as hard as I possibly can, and now it's like, we need to start focusing on relationships,\" he told Entertainment Tonight.\n\nA repeat Bachelor is generally frowned upon, but Ben could be the exception.\n\nAnd here's who we should just really stop rooting for.\n\nPeter Kraus\n\nIf you're still hoping for Peter Kraus from season 12 of \"The Bachelorette,\" just stop. The heartthrob personal trainer and business owner from Madison, Wisconsin, has stayed far away from the franchise since his heartbreaking exit from season 13 of \"The Bachelorette,\" starring Rachel Lindsay.\n\nPeter made it crystal clear he wasn't ready for an engagement after a few months of dating, probably a factor leading to his elimination. He's since continued to pursue his personal-training business and became a part owner for Hive Social, a social-networking app.\n\nIf there's one thing former contestants have in common, it's this: They live for social media. Peter's Instagram is barren of any photos from the show, and he doesn't have that signature rose next to his name on Twitter.\n\nWells Adams\n\nWells' name seems to always pop up in the \"Bachelor\" conversation since his time on \"Bachelorette\" season 12, starring JoJo Fletcher. News flash: It's not going to happen.\n\nFor starters, the former radio DJ from Monterey, California, is now a signature on \"Bachelor in Paradise\" as the flirty bartender. It's unlikely the franchise would give up his spot on the summer spinoff for a \"Bachelor\" season.\n\nIs he ultimately on the track to replace longtime host Chris Harrison? That seems more likely than a shot at being the next leading man.\n\nHe also seems pretty smitten with his \"Modern Family\" girlfriend Sarah Hyland.\n\nColton Underwood\n\nI'll say it: This guy seems like a slimeball.\n\nColton, a former football player from Washington, Illinois, was charming at first on Becca's season of \"The Bachelorette.\" Then, he confessed he had been seeing Becca's fellow \"Bachelor\" contestant Tia Booth before he went on the show.\n\nAfter that awkward conversation, Tia showed up on a group date that Colton also happened to be on. Shocker. Tia and Colton interact and it's weird, but Colton assures Becca there are no lingering feelings, and the two get cozy for the rest of the season.\n\nSeveral episodes go by, and Tia makes another appearance where she confesses she still has feelings for Colton, but that it shouldn't change Becca's decision one way or another. Right.\n\nColton asks longtime host Chris Harrison how he should handle an overnight date if he's given one. For context, he had just previously announced to the world he was a virgin, a secret he says he hadn't told anyone before this very public show. This is the hot topic of conversation for two whole episodes.\n\nWell, turns out that advice fell on deaf ears since Colton was sent home after the Tia debacle and wasn't offered an overnight date.\n\nHere's the kicker: Tia and Colton are cast to be on the upcoming season of \"Bachelor in Paradise\" together. Funny how that worked out.\n\nMORE REALITY DATING:", "images": ["https://www.gannett-cdn.com/presto/2018/07/30/PPHX/355d28e4-d349-494d-bbec-c75391d2cc5b-BeFunky-collage.jpg?auto=webp&crop=2969,1670,x122,y163&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/presto/2018/07/30/PPHX/355d28e4-d349-494d-bbec-c75391d2cc5b-BeFunky-collage.jpg?auto=webp&crop=2969,1670,x122,y163&format=pjpg&width=1200", "keywords": [], "authors": ["Becca Smouse"], "canonical_link": "https://www.azcentral.com/story/entertainment/television/2018/07/30/heres-who-should-and-should-not-abc-next-bachelor/821089002/", "title": "Here's who should (and should not) be ABC's next 'The Bachelor'", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=815248536, app-argument=https://www.azcentral.com/story/entertainment/television/2018/07/30/heres-who-should-and-should-not-abc-next-bachelor/821089002/entertainment/television", "theme-color": "#ffffff", "og": {"title": "Here's who should (and should not) be ABC's next 'The Bachelor'", "description": "ABC's \\", "site_name": "The Republic | azcentral.com", "image": {"identifier": "https://www.gannett-cdn.com/presto/2018/07/30/PPHX/355d28e4-d349-494d-bbec-c75391d2cc5b-BeFunky-collage.jpg?auto=webp&crop=2969,1670,x122,y163&format=pjpg&width=1200", "width": 1200, "height": 675}}, "description": "ABC's \\", "twitter": {"site": "@azcentral", "creator": "@azcentral", "card": "summary_large_image"}}, "movies": [], "publish_date": 1532905200.0, "source": "https://www.azcentral.com", "summary": ""}