{"url": "https://www.hollywoodreporter.com/rambling-reporter/andy-dick-fired-movie-sexual-harassment-claims-1053162", "text": "Andy Dick has been dropped from the independent feature film Raising Buchanan following accusations of sexual harassment and misconduct on set.\n\nThe Hollywood Reporter has not been able to reach any of the alleged victims. However, two sources detailed Dick’s inappropriate behavior, which included groping people’s genitals, unwanted kissing/licking and sexual propositions of at least four members of the production. It’s unclear if those involved were actors or crew.\n\nLate Monday, THR spoke to Dick, who confirmed he was let go from his small role in the film. Though he vehemently denied groping claims, he said it’s possible that he licked people and he confirmed that he did make advances on others.\n\nTo anyone who has followed Dick’s legal troubles, his well-documented history of outlandish comedy and his often intentionally offensive behavior, his dismissal may not come as a surprise. But the claims can be seen as more unsettling in today’s cultural climate in the wake of the Harvey Weinstein scandal (or ousted figures like Fox News’ Bill O’Reilly, Amazon Studios’ Roy Price, political journalist Mark Halperin, The Loud House creator Chris Savino and the list of accused sexual harassers goes on, and now includes Kevin Spacey and director James Toback).\n\nDick said he’s aware of his reputation. At first, the actor made light of the situation, joking that “my middle name is ‘misconduct.’ They know what they signed up for.” However, he followed up with a denial that he ever groped anyone on set.\n\n“I don’t grope people anymore. I don’t expose myself anymore,” Dick said by telephone. (Also well-documented is his history of exposing his genitals in public and onstage.) “I do understand that the temperature in the world right now is delicate.”\n\nHe claimed that the temperature on set in Arizona was delicate, too, and that he contributed to that by bringing up Weinstein. “Can I tell you my side of it?” Dick then asked before asserting that the filmmakers could’ve been upset that he was talking about or perhaps defending Weinstein, with whom he made two films. “They were so incensed by what I was saying. People are so sensitive,” Dick added, without elaborating on exactly what he said.\n\nWritten and directed by Bruce Dellis, Raising Buchanan stars Rene Auberjonois, Amanda Melby, Shannon Whirry and M. Emmet Walsh in the story of a woman who steals the corpse of former U.S. President James Buchanan (Auberjonois) hoping to land a ransom, but it seems that nobody is interested in getting the body back. Joe Gruberman is the sole producer on the project, and when reached by THR, he declined to comment on the situation.\n\nDick’s small gig on the film seemed to go off the rails from the start. He showed up late to the set after missing his flight in Los Angeles. He hadn’t memorized his lines and brought a male friend to the set who caused a disturbance by falling asleep and snoring during filming, sources say.\n\nDick addressed all of the above when speaking with THR, but claimed groping never occurred. “I didn’t grope anybody. I might have kissed somebody on the cheek to say goodbye and then licked them. That’s my thing — I licked Carrie Fisher at a roast. It’s me being funny. I’m not trying to sexually harass people,” he said.\n\n“I didn’t grab anybody’s genitals,” he continued, but he did not deny that he propositioned others. “Of course I’m going to proposition people. I’m single, depressed, lonely and trying to get a date. They can just say no, and they probably did and then I was done.”\n\nOne of the sources on set questioned Dick’s sobriety and claimed that he appeared and acted as if he were intoxicated. The actor has been to rehab more than a dozen times and has been transparent in the past about his long and tumultuous battle with substance abuse. A Vice profile, published a year ago, opened with this sentence: “Gropings, genital exposures, grand theft: Andy Dick’s litany of offenses to society is long and egregious.”\n\nWhile the story noted the “trail of destruction and bemusement Dick left in his wake, fueled by alcohol, cocaine, and an utter inability to keep his hands to himself,” the Jemayel Khawaja-written piece included one major piece of positive news — that Dick was two years sober.\n\nTHR questioned Dick about his sobriety, and he claimed to be sober despite a medication mix-up. “I overtook my medication and took too many Xanax and I was a bit loopy [on set]. That didn’t make me rape people. I really don’t get it. I’m always trying to be funny and trying to get a date. I still don’t have a date. I am on Tinder and I’m looking,” he said.\n\nDick contends that part of his problem is he’s 51 and unaware of what the rules are for proper behavior. “I don’t know the difference between sexual harassment and trying to get a date. In the ’70s, all the girlfriends I got was by kissing and licking their cheek. I don’t know anymore,” he said. “There were beautiful women and beautiful guys on the set. I flirt with them. I might kiss someone on the set and ask them to go to dinner. They are the ones that took it south.”\n\nDick also said that the man who was caught snoring on the set was his friend Paul Ryder, the bass player from the British band Happy Mondays. Ryder is his “sober companion,” though if he was snoring, it’s possible that “he overdid his medication, too,” Dick added. “He’s sober and I’m sober. He’s sitting with me right now. He’s my best friend. I didn’t hear him snore, but I have bad ears.” Ryder then spoke up in the background, telling THR, “I never saw him grope.”\n\nDick ended the call by saying that if he continues to run into allegations of misconduct, he will retire. But he’s not quite ready for that yet as he’s still got a slew of projects lined up and he was eager to promote his new documentary, Everybody Has an Andy Dick Story.\n\nDick ended this most recent chapter by saying that he’s learned his lesson. “I won’t do it anymore,” he said. “I won’t lick anyone’s face anymore. We have an agreement.”", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/andydick.jpg?w=1024"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/andydick.jpg?w=1024", "keywords": [], "authors": ["Chris Gardner"], "canonical_link": "https://www.hollywoodreporter.com/news/general-news/andy-dick-fired-movie-sexual-harassment-claims-1053162/", "title": "Andy Dick Fired From Movie Over Sexual Harassment Claims", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Though the 51-year-old actor denies he groped anyone, he does admit to other inappropriate behavior: \"I might have kissed somebody on the cheek to say goodbye and then licked them. That's my thing.\"", "news_keywords": "autoplay, Harassment in Hollywood", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Chris Gardner", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1053162, "title": "Andy Dick Fired From Movie Over Sexual Harassment Claims", "published_at": "2017-10-31 06:30:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/andydick.jpg?w=1024", "comment_count": 0, "tags": "Harassment in Hollywood", "topics": "News", "body": "Andy Dick has been dropped from the independent feature film Raising Buchanan following accusations of sexual harassment and misconduct on set.\r\nThe Hollywood Reporter has not been able to reach any of the alleged victims. However, two sources detailed Dick’s inappropriate behavior, which included groping people’s genitals, unwanted kissing/licking and sexual propositions of at least four members of the production. It’s unclear if those involved were actors or crew.\r\nLate Monday, THR spoke to Dick, who confirmed he was let go from his small role in the film. Though he vehemently denied groping claims, he said it's possible that he licked people and he confirmed that he did make advances on others.\r\nTo anyone who has followed Dick's legal troubles, his well-documented history of outlandish comedy and his often intentionally offensive behavior, his dismissal may not come as a surprise. But the claims can be seen as more unsettling in today’s cultural climate in the wake of the Harvey Weinstein scandal (or ousted figures like Fox News' Bill O'Reilly, Amazon Studios' Roy Price, political journalist Mark Halperin, The Loud House creator Chris Savino and the list of accused sexual harassers goes on, and now includes Kevin Spacey and director James Toback).\r\nDick said he's aware of his reputation. At first, the actor made light of the situation, joking that \"my middle name is ‘misconduct.’ They know what they signed up for.\" However, he followed up with a denial that he ever groped anyone on set.\r\n\"I don't grope people anymore. I don't expose myself anymore,\" Dick said by telephone. (Also well-documented is his history of exposing his genitals in public and onstage.) \"I do understand that the temperature in the world right now is delicate.\"\r\nHe claimed that the temperature on set in Arizona was delicate, too, and that he contributed to that by bringing up Weinstein. \"Can I tell you my side of it?\" Dick then asked before asserting that the filmmakers could've been upset that he was talking about or perhaps defending Weinstein, with whom he made two films. \"They were so incensed by what I was saying. People are so sensitive,\" Dick added, without elaborating on exactly what he said.\r\nWritten and directed by Bruce Dellis, Raising Buchanan stars Rene Auberjonois, Amanda Melby, Shannon Whirry and M. Emmet Walsh in the story of a woman who steals the corpse of former U.S. President James Buchanan (Auberjonois) hoping to land a ransom, but it seems that nobody is interested in getting the body back. Joe Gruberman is the sole producer on the project, and when reached by THR, he declined to comment on the situation.\r\nDick's small gig on the film seemed to go off the rails from the start. He showed up late to the set after missing his flight in Los Angeles. He hadn’t memorized his lines and brought a male friend to the set who caused a disturbance by falling asleep and snoring during filming, sources say.\r\nDick addressed all of the above when speaking with THR, but claimed groping never occurred. \"I didn't grope anybody. I might have kissed somebody on the cheek to say goodbye and then licked them. That's my thing — I licked Carrie Fisher at a roast. It's me being funny. I'm not trying to sexually harass people,\" he said.\r\n\"I didn't grab anybody's genitals,\" he continued, but he did not deny that he propositioned others. \"Of course I'm going to proposition people. I'm single, depressed, lonely and trying to get a date. They can just say no, and they probably did and then I was done.\"\r\nOne of the sources on set questioned Dick's sobriety and claimed that he appeared and acted as if he were intoxicated. The actor has been to rehab more than a dozen times and has been transparent in the past about his long and tumultuous battle with substance abuse. A Vice profile, published a year ago, opened with this sentence: “Gropings, genital exposures, grand theft: Andy Dick’s litany of offenses to society is long and egregious.”\r\nWhile the story noted the “trail of destruction and bemusement Dick left in his wake, fueled by alcohol, cocaine, and an utter inability to keep his hands to himself,” the Jemayel Khawaja-written piece included one major piece of positive news — that Dick was two years sober.\r\nTHR questioned Dick about his sobriety, and he claimed to be sober despite a medication mix-up. \"I overtook my medication and took too many Xanax and I was a bit loopy [on set]. That didn't make me rape people. I really don't get it. I'm always trying to be funny and trying to get a date. I still don't have a date. I am on Tinder and I'm looking,\" he said.\r\nDick contends that part of his problem is he's 51 and unaware of what the rules are for proper behavior. \"I don't know the difference between sexual harassment and trying to get a date. In the '70s, all the girlfriends I got was by kissing and licking their cheek. I don't know anymore,\" he said. \"There were beautiful women and beautiful guys on the set. I flirt with them. I might kiss someone on the set and ask them to go to dinner. They are the ones that took it south.\"\r\nDick also said that the man who was caught snoring on the set was his friend Paul Ryder, the bass player from the British band Happy Mondays. Ryder is his \"sober companion,\" though if he was snoring, it's possible that \"he overdid his medication, too,\" Dick added. \"He's sober and I'm sober. He's sitting with me right now. He's my best friend. I didn't hear him snore, but I have bad ears.\" Ryder then spoke up in the background, telling THR, \"I never saw him grope.\"\r\nDick ended the call by saying that if he continues to run into allegations of misconduct, he will retire. But he's not quite ready for that yet as he's still got a slew of projects lined up and he was eager to promote his new documentary, Everybody Has an Andy Dick Story.\r\nDick ended this most recent chapter by saying that he's learned his lesson. \"I won't do it anymore,\" he said. \"I won't lick anyone's face anymore. We have an agreement.\"", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Andy Dick Fired From Movie Over Sexual Harassment Claims", "url": "https://www.hollywoodreporter.com/news/general-news/andy-dick-fired-movie-sexual-harassment-claims-1053162/", "description": "Though the 51-year-old actor denies he groped anyone, he does admit to other inappropriate behavior: “I might have kissed somebody on the cheek to say goodbye and then licked them. That&#8217…", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/andydick.jpg?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2017-10-31T06:30:00+00:00", "modified_time": "2017-11-22T17:22:09+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Andy Dick Fired From Movie Over Sexual Harassment Claims", "description": "Though the 51-year-old actor denies he groped anyone, he does admit to other inappropriate behavior: “I might have kissed somebody on the cheek to say goodbye and then licked them. That&#8217…", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/andydick.jpg?w=1280"}}, "movies": [], "publish_date": 1509431400.0, "source": "https://www.hollywoodreporter.com", "summary": ""}