{"url": "http://www.newslocker.com/en-us/profession/tvfilm_news/move-over-zac-efron-ansel-elgort-is-ready-to-be-hollywoods-next-heartthrob/", "text": "Baby genius! Tech trillionaire! Space-conquering supergeek! It’s The Elon Musk Show! Elon Musk’s mum says her boy is a genius – but does a new tell-all documentary agree? From his harsh divorce tactics to how he’s about to revolutionise your brain, here’s why tech billionaires are taking over TV‘From the age of three I thought he was a genius,” says Maye Musk of her son, Elon. “He would reason with me and his reasoning was sensible. And how do you do that when you don’t have that much experience?” She wanted her son to start Read more\n\nThe Midnight Club review – this teen horror is like a morbid Breakfast Club Set in a hospice for teenagers, Mike Flanagan’s new show has a grim premise, with death lingering round every corner. Then they start telling each other scary stories …While no one settles in for a horror series hoping for a feelgood romp, Netflix’s latest is grim even by the genre’s bleak standards. The Midnight Club is set at the Brightcliffe Hospice for teens, where its young residents are living out their final days with a terminal diagnosis. In order to sneak in a b Read more\n\nA Friend of the Family review – the most jawdroppingly incredible true-crime story there is The grooming of the Broberg family – complete with alien tapes and a girl’s double kidnapping – has been told before. But this new Netflix drama digs into how it happened, then happened againRender it how you will – and so far the Broberg family’s history has been a memoir, a documentary and a podcast – their story remains one of the most jawdroppingly incredible in the history of true-crime tales. Now there is a dramatisation of it – A Friend of the Fam Read more", "images": ["https://static.addtoany.com/buttons/share_save_120_16.gif", "http://www.newslocker.com/images/newslocker-cube.png", "http://www.newslocker.com/images/rss.png", "http://www.newslocker.com/images/share-linkedin.png", "http://www.newslocker.com/images/share-facebook.png", "http://www.newslocker.com/images/newslocker-logo.png", "http://www.newslocker.com/images/share-twitter.png", "http://akns-images.eonline.com/eol_images/Entire_Site/2017529/rs_600x600-170629141504-600-ansel-elgort-collage.jpg?downsize=450:*&crop=450:350;left,top"], "top_img": "http://akns-images.eonline.com/eol_images/Entire_Site/2017529/rs_600x600-170629141504-600-ansel-elgort-collage.jpg?downsize=450:*&crop=450:350;left,top", "keywords": [], "authors": [], "canonical_link": "https://www.newslocker.com/en-us/profession/tvfilm_news/move-over-zac-efron-ansel-elgort-is-ready-to-be-hollywoods-next-heartthrob/", "title": "Move Over, Zac Efron! Ansel Elgort Is Ready to Be Hollywood's Next Heartthrob", "meta_data": {"description": "Efron. Tatum. Hemsworth. Hemsworth. Pratt. Pine. Any other famous Chris' we might have missed. The list of actors in Young Hollywood who can truly be described as heartthrobs on-and-off-screen...", "og": {"title": "Move Over, Zac Efron! Ansel Elgort Is Ready to Be Hollywood's Next Heartthrob - Cinema, Theater & TV news - NewsLocker", "description": "Efron. Tatum. Hemsworth. Hemsworth. Pratt. Pine. Any other famous Chris' we might have missed. The list of actors in Young Hollywood who can truly be described as heartthrobs on-and-off-screen...", "type": "website", "url": "https://www.newslocker.com/en-us/profession/tvfilm_news/move-over-zac-efron-ansel-elgort-is-ready-to-be-hollywoods-next-heartthrob/", "image": "http://akns-images.eonline.com/eol_images/Entire_Site/2017529/rs_600x600-170629141504-600-ansel-elgort-collage.jpg?downsize=450:*&crop=450:350;left,top", "site_name": "Newslocker"}, "fb": {"admins": 1335791813}, "robots": "index", "google-site-verification": "wAInSoPxz3OEgOXCHtETx-x7ukmlX40FRoiPZpO7ww4", "msvalidate.01": "2F0DB39856FAA0E47C70E9E1FF8653AA"}, "movies": [], "publish_date": 1498831200.0, "source": "http://www.newslocker.com", "summary": ""}