{"url": "https://www.freep.com/story/news/local/michigan/2018/04/18/jordyn-wieber-testimony-larry-nassar/529201002/", "text": "Gymnast Jordyn Wieber tells Senate panel Nassar began abusing her at age 14\n\nShow Caption Hide Caption Gold medal winner Jordyn Wieber speaks about sexual assault legislation Gold medal winner Jordyn Wieber speaks about sexual assault legislation during a press conference on Monday, Feb. 26, 2018, at the Michigan state Capitol in Lansing.\n\nWASHINGTON – Olympic gold medal gymnast Jordyn Wieber, a Lansing-area native, described for a U.S. Senate panel on Wednesday the sexual abuse she suffered at the hands of sports doctor Larry Nassar beginning at age 14, saying she believed if she raised concerns at the time it might have hurt her future goals.\n\n\"I knew that if I questioned his treatment, I risked my chance at making the Olympic team or being chosen to compete internationally,\" said Wieber, who has testified in court against the imprisoned former Michigan State University and USA Gymnastics doctor and who this week filed a lawsuit against him in a California court.\n\nWieber's comments were part of a statement she delivered to a U.S. Senate subcommittee investigating abuse against Olympic athletes and whether there needs to be additional safeguards to prevent it from happening again. At least two other congressional committees are said to be investigating as well.\n\nThe subcommittee also heard from another gymnast, 2000 Olympic bronze medalist Jamie Dantzscher, who was the first to raise concerns about Nassar, despite what she said was intense pressure not to do so. Also testifying were former figure skater Craig Maurizi and speed skater Bridie Farrell, who spoke of abuse at the hands of former colleagues or coaches.\n\nThe abuses suffered by athletes from Nassar were revealed in a series of stories first reported by the Indianapolis Star in 2016. Since then, more than 200 girls or young women have said Nassar abused them and he is serving a 60-year sentence on federal child pornography charges and faces an additional 40 years behind bars in Michigan for his sexual assault convictions once that federal sentence is complete.\n\nRead more:\n\nIn her testimony, Wieber, 22, who won gold in London in 2012, criticized USA Gymnastics for not responding to concerns of abuse and trainers with creating a brutal culture for athletes at Karolyi Ranch in Texas. She also chastised Michigan State University officials who, she said, have turned victims away and are \"still refusing to admit what the problem is and that they’re accountable for it.\n\n\"They don't think they're responsible for Larry Nassar doing what he did,\" she said, adding that she also believed that MSU Interim President John Engler almost seemed to be trying to \"fight the survivors.\"\n\nThe subcommittee's chairman, Sen. Jerry Moran, R-Kan., said the committee is trying to determine the best way to protect athletes in the future and added that he appreciated the \"incredible bravery of our witnesses and their willingness to be here to discuss these sensitive topics.\" He said another hearing — expected to be held May 22 — may include witnesses from MSU, USA Gymnastics and the U.S. Olympic Committee.\n\n\"You were let down by individuals you trusted but who chose to ignore you, to look the other way, or to deliberately cover up the abuses you suffered because their priority, simply put, was not your safety or well-being,\" Moran said.\n\nCongress has already passed legislation intended to crack down on athlete abuse, creating an organization to investigate abuse and requiring officials to report suspected incidents as soon as possible. But members said more remains to be done.\n\nU.S. Sen. Richard Blumenthal of Connecticut, the panel's ranking Democrat, called Wednesday's hearing \"a critical step forward in our investigation into the serious systemic abuses across generations of young athletes.\" Meanwhile, U.S. Sen. Gary Peters, D-Mich., who is a MSU alumnus, said the school \"has an obligation\" to be supportive of Nassar's victims.\n\n\"It’s important that we address this so that it never happens again,\" said Peters. \"Alumni come up to me and wonder, 'How could this happen? How could this happen at our university?' \"\n\nIn her testimony, Wieber, who is a native of DeWitt, said she began seeing Nassar at age 8 in Lansing and that other gymnasts, coaches and family members considered him \"a miracle worker.\" She said he also appeared to her to be a \"good guy,\" who tried to help her deal with the stresses of training and pressure from coaches.\n\nShe said she was 14 and under tough training when she tore a hamstring in her right leg and that's when Nassar \"started performing the procedure that we are all now familiar with.\" While she said she cringed at how uncomfortable it was, she said she had \"no idea that he was sexually abusing me for his own benefit.\"\n\n\"I knew it felt strange, but he was the national team doctor,\" she said.\n\nWieber has complained that Nasser — who was accused of sexually assaulting young women and girls under the guise of treating them — acted as a friend, bringing her and others food and candy. \"I didn’t know that these were all grooming techniques that he used to manipulate and brainwash me into trusting him,\" Wieber said.\n\nWieber also said she talked with teammates Aly Raisman and McKayla Maroney at the Karolyi Ranch about the treatment and \"how uncomfortable it made us feel.\"\n\n\"None of us could understand it,\" she said. She also said that Nassar was allowed to be alone with athletes unlike other adults.\n\n\"Nobody was protecting us from being taken advantage of. Nobody was even concerned whether or not we were being sexually abused,\" she said. \"The people and organizations who are responsible need to accept responsibility for the pain they caused me and my sister survivors.\"\n\nWieber talked about a \"culture of silence\" that was more interested in winning or reputation than in protecting athletes. All of the athletes testifying also raised questions about the many other team and Olympic officials who must have known something was wrong but did nothing to report it.\n\nRecalling how Nassar touched her over her leotards in the middle of a gym without anyone reacting on one occasion, Dantzcher said, \"I know it’s still going on.\"\n\nTalking about what made her come forward, Dantzscher said, \"I have numerous nieces and nephews. I could not look at them any longer and stay quiet. I knew as a former Olympian that if I spoke, people might be more likely to speak up. As it turned out, I was right.\"\n\nAfter previously speaking out against what she considered abusive training methods at the Karolyi Ranch, Dantzscher said that it was in the summer of 2016 when she \"began to understand that Larry Nassar had sexually abused me and his procedures were not legitimate medical treatment.\"\n\n\"I further came to learn that he had been quietly dismissed by USA Gymnastics based upon allegations that he had sexually abused minors on our Olympic and National Women’s Gymnastics Teams,\" she said. \"His firing was kept quiet by USA Gymnastics and he was allowed to post messages on social media that said he had 'retired.' \"\n\nBoth Wieber and Dantzscher have previously testified against Nassar and said they hope that Congress is able to get more answers out of Michigan State, USA Gymnastics and the USOC than they have been able to get.\n\n\"This is a case of powerful people protecting other powerful people,\" Dantzscher said, \"It is up to you, as powerful members of the United States Senate, to hold them accountable.\"\n\nContact Todd Spangler: 703-854-8947 or tspangler@freepress.com. Follow him on Twitter at @tsspangler.", "images": ["https://www.gannett-cdn.com/-mm-/4902f10711f0e9461012c2ffce2e2bf25e829ff1/c=0-92-1997-1220/local/-/media/2018/03/22/MIGroup/Lansing/636573456550124047-180322-wieber-044a.JPG?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://media.gannett-cdn.com/41075352001/41075352001_5740949733001_5740938064001-vs.jpg?pubId=41075352001", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/4902f10711f0e9461012c2ffce2e2bf25e829ff1/c=0-92-1997-1220/local/-/media/2018/03/22/MIGroup/Lansing/636573456550124047-180322-wieber-044a.JPG?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Todd Spangler"], "canonical_link": "https://www.freep.com/story/news/local/michigan/2018/04/18/jordyn-wieber-testimony-larry-nassar/529201002/", "title": "Gymnast Jordyn Wieber tells Senate panel Nassar began abusing her at age 14", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=904023476, app-argument=https://www.freep.com/story/news/local/michigan/2018/04/18/jordyn-wieber-testimony-larry-nassar/529201002/news/local/michigan", "theme-color": "#ffffff", "og": {"title": "Gymnast Jordyn Wieber tells Senate panel Nassar began abusing her at age 14", "description": "Jordyn Wieber tells Senate panel about abuse at hands of Michigan State's Larry Nassar.", "site_name": "Detroit Free Press", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/4902f10711f0e9461012c2ffce2e2bf25e829ff1/c=0-92-1997-1220/local/-/media/2018/03/22/MIGroup/Lansing/636573456550124047-180322-wieber-044a.JPG?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "description": "Jordyn Wieber tells Senate panel about abuse at hands of Michigan State's Larry Nassar.", "twitter": {"site": "@freep", "creator": "@freep", "card": "summary_large_image"}}, "movies": [], "publish_date": 1524006000.0, "source": "https://www.freep.com", "summary": ""}