{"url": "https://people.com/tv/bachelor-and-bachelorette-couples-whos-still-together/", "text": "01 of 77 Gabby Windey & Erich Schwer, The Bachelorette Season 19 Though they had a bumpy road throughout the season, it was a happy ending for Windey and Schwer, who got engaged on their season finale in September 2022. \"You are amazing. You are the most amazing person I've ever met,\" Schwer said in his proposal. \"It's you, me until the wheels fall off. I'm head over heels in love with you and I want to spend the rest of my life with you.\"\n\n02 of 77 Rachel Recchia & Tino Franco, The Bachelorette Season 19 Craig Sjodin/instagram Unfortunately, Windey's co-Bachelorette didn't find the same happiness. Though she and Franco also got engaged on the finale, on After the Final Rose, she revealed he'd cheated on her. \"I slowly was pulling on that string and revealing more and more. It really didn't work out, he cheated on me,\" she told host Jesse Palmer. \"It's just heartbreaking. This is the person I thought I was gonna spend the rest of my life with and start a family with.\"\n\n03 of 77 Clayton Echard & Susie Evans, The Bachelor Season 26 Craig Sjodin/abc Talk about drama! Echard broke up with his final two women — Rachel Recchia and Gabby Windey — in Iceland and decided to try to pursue a relationship with Evans, who had left after learning he had been intimate with both Rachel and Gabby and said \"I love you\" to all three. Rachel and Gabby confronted Echard on After the Final Rose, saying they felt \"betrayed,\" \"misled\" and \"blindsided,\" which he understood. But following Iceland, Evans had reached out to him, and now, they're together, he revealed. \"In a weird, twisted way it did work out because I ended up with Susie. And I'm happier than I've ever been,\" he told PEOPLE. On Sept. 23, 2022, the pair announced their split in a joint Instagram statement.\n\n04 of 77 Michelle Young & Nayte Olukoya, The Bachelorette Season 18 ABC/Christopher Willard After they were able to share their happy engagement news, the season 18 Bachelorette stars told PEOPLE they're the perfect fit. \"I fall more in love every day,\" Young told PEOPLE in December 2021. \"I was fortunate enough to grow up in a family with a healthy marriage and I thought, I'm not going to give up until I have that. He's my person. And I didn't know I could love at this level.\" Olukoya added: \"It's so natural for us to be together. I've never felt the way I feel before. I'm all in!\" From the beginning, \"Nayte and I always had an undeniable connection,\" said Young. \"I thought, 'I'm in trouble!' But even when I was falling in love, I wanted to make sure it wasn't infatuation.\" The couple broke up six months after the finale aired, but ended their relationship amicably, as Young wrote in an Instagram post: \"I will never stop wanting to see you succeed.\" Olukoya added to his Instagram story, \"Michelle and I will always cheer each other on, but moving forward, we will be cheering from a distance.\"\n\n05 of 77 Joe Amabile & Serena Pitt, Bachelor in Paradise Season 7 Serena Pitt/Instagram Grocery Store Joe got his start on Becca Kufrin's season of The Bachelorette but got eliminated on night one. But when he returned for Bachelor in Paradise season 5, he found love with his now ex, Kendall Long, whom he dated through January 2020. When Amabile returned again for BiP season 7, it seemed like all hope was lost. He was about ready to leave the beach — until he sparked a connection with The Bachelor season 25's Pitt. The pair had undeniable chemistry, so it was not surprising when the two confessed they were falling in love. Though Long appeared in Paradise to try to win Amabile back, the bond that he and Pitt had formed was unbreakable, and Long left the beach solo. Amabile and Pitt became one of three couples to get engaged on the beaches of Paradise in the summer of 2021. As of 2022, the Toronto-Chicago couple is still going strong, though they said they aren't \"rushing down the aisle\" any time soon.\n\n06 of 77 Kenny Braasch & Mari Pepin, Bachelor in Paradise Season 7 ALLAN ZEPEDA Boy-band manager Braasch and former Miss Maryland Pepin were attracted to each other right off the bat during Bachelor in Paradise season 7, but their relationship was put in jeopardy when Demi Burnett showed up on the beach and knew she wanted to go for Braasch. Pepin and Braasch seemed to be going their separate ways when Pepin said she wanted the freedom to date other people on the beach if the opportunity arose, and Braasch briefly pursued things with Burnett. But absence makes the heart grow fonder, and Pepin only realized how much she cared for Braasch when he began a relationship with Burnett — and received Burnett's rose at the second rose ceremony. Pepin apologized to Braasch and said she wanted to commit to him and only him. In the end, Braasch proposed to Pepin, and the two have been happily engaged and living together in Chicago. They plan to get married in Puerto Rico, where many of Pepin's family members live.\n\n07 of 77 Riley Christian & Maurissa Gunn, Bachelor in Paradise Season 7 Hatnim Lee/Getty Gunn first connected in Paradise with cat-lover Connor Brennan. The two shared a daybed and a makeout session early on, which boosted Brennan's confidence after he was sent home from Katie Thurston's season of The Bachelorette following an awkward kiss. But when Christian entered the beach, Brennan and Gunn were as good as done. Gunn and Christian's connection was obvious as soon as they met. Christian shared his dreams of what Sunday mornings would look like while married and decided Gunn was an essential part of that fantasy. During the BiP season 7 finale, the pair became the first Black couple to get engaged in BiP history. Sadly, the couple split in January 2022. In February, Gunn posted on social media that the breakup wasn't easy, though added, \"But let me tell you today I feel amazing.\"\n\n08 of 77 Noah Erb & Abigail Heringer, Bachelor in Paradise Season 7 Abigail Heringer/Instagram Though it seemed like things were over for Erb and Heringer after the '80s-themed Paradise Prom, the traveling nurse and financial manager confirmed after the Bachelor in Paradise season 7 finale that they were back together. Heringer, a fan-favorite from Matt James's season of The Bachelor who was open about her experience as a part of the deaf community, and Erb, known for his young age and feud with Bennett Jordan on Clare and Tayshia's season of The Bachelorette, might not have seemed like an obvious pairing. But the couple was voted \"most likely to live happily ever after\" by their costars in Paradise and are continuing to grow together off-camera — the two announced they do not want to have a televised wedding and prefer to keep their relationship to themselves and with their fans on social media.\n\n09 of 77 Brendan Morais & Pieper James, Bachelor in Paradise Season 7 Pieper James/Instagram Morais and James stirred up controversy when it became clear they came to Paradise with one goal in mind — to date each other. Though Morais entered the beach seemingly solo and even leaned into his connection with Natasha Parker, once James entered the beach halfway through the season, she and Morais instantly solidified themselves as a couple. The pair faced lots of backlash on social media for being on the show \"for the wrong reasons\" — to promote themselves and enjoy a free vacation in Mexico — and Morais quickly lost tens of thousands of followers. Their costars in Paradise were similarly outraged and rallied behind Parker while pressuring the pair to leave Paradise, which they ended up doing. Morais eventually apologized to Parker for his dishonesty. In October 2021, Morais and James were rumored to have broken up, but as of 2022, they are still together and are very much in love, though James says she is not quite ready for an engagement yet.\n\n10 of 77 Chris Conran & Alana Milne, Bachelor in Paradise Season 7 Alana Milne/Instagram Like Brendan and Pieper, Conran and Milne created some drama on the beaches of Mexico when rumors circulated that the two had already hit it off before the show started filming and that they came to Paradise with the intentions of dating only each other. At first, it seemed like things were going well for Conran and Jessenia Cruz from Matt James's season of The Bachelor. But as soon as Milne stepped foot onto the dance floor at Tituss Burgess's VIP party, love was in the air. Milne went straight for Conran, and the two began making out — right in front of Cruz. The cast quickly turned on Conran, accusing him of coming on the show with ulterior motives of furthering his connection with Milne and gaining social media followers. Grocery Store Joe said Conran was \"ruining it for everyone,\" and Riley Christian accused Conran of \"itching for the clout.\" Conran and Milne ended up packing their bags and leaving — but not together. The two quickly got back together, however, and moved in together in Salt Lake City. They are public about their relationship on social media and Conran even teased a proposal may come soon.\n\n11 of 77 Katie Thurston & Blake Moynes, The Bachelorette Season 17 Craig Sjodin/ABC She said yes! During the latest dramatic season of The Bachelorette, Moynes made a splash when he joined during episode four and made an instant connection with Thurston. Prior to the show, \"we had talked very casually in DMs,\" Thurston tells PEOPLE, but their romance blossomed as they got to know each other better. \"I thought he was hot, but I didn't think much of it. When I met him in person, something about his energy shifted my mind completely. I knew this was going to be a strong relationship.\" Moynes popped the question during the season 17 finale. After a few months of dating long-distance, the pair ultimately called it quits on Oct. 25. In a statement confirming their split, they shared that they have \"concluded that we are not compatible as life partners.\" Thurston surprised everyone weeks later when she moved on with John Hersey, a contestant she sent home early in the season. Thurston and Hersey called it quits on June 20, 2022, after almost seven months of dating. Thurston shared a cryptic message on her Instagram story: \"Statement: no we aren't together,\" while Hersey posted a longer message to his Instagram story that began \"As Katie stated earlier, we are no longer dating. The decision was not made lightly and it was obviously not an easy one to make.\" In the summer of 2022, Moynes seemed to move on with Love Is Blind's Natalie Lee.\n\n12 of 77 Tayshia Adams & Zac Clark, The Bachelorette Season 16 Craig Sjodin/ABC After Crawley's sudden departure, season 16 of The Bachelorette continued with Adams stepping in to meet the remaining men. Lo and behold, she found her happy ending, too — at least temporarily. \"If you had told me in March that I'd be getting engaged at the end of the year, I would not have believed it for a second,\" said Adams, who got engaged to addiction recovery specialist Clark on the show's December 2020 finale. \"But I want to experience life with [Zac] by my side. He's what I've always wanted.\" \"Just the way he was speaking to me, you could tell he had maturity that I was really attracted to,\" she added. \"And there was something I couldn't put my finger on. He had a mystery to him that I wanted to get to know more about. This just feels so right.\" On Aug. 1, the Bachelor Nation couple celebrated the one-year anniversary of when they first met. But on Nov. 22, 2021, PEOPLE confirmed the pair had ended their engagement, just weeks after running the New York City Marathon together.\n\n13 of 77 Becca Kufrin & Thomas Jacobs, Bachelor in Paradise Season 7 Becca Kufrin, Thomas Jacobs. Thomas Jacobs/Instagram All is well that ends well! Fan-favorite Kufrin has found her happily ever after, confirming on Oct. 6, 2021, that she and Jacobs were back together after breaking up during the season 7 finale of the hit summer spinoff Bachelor in Paradise. \"You know what they say…Third time's a charm,\" she wrote in an Instagram tribute. \"I'm sorry for breaking up with you on national television, but I'll take every day to make it up to you, Tommy. Thanks for making my heart smile far more than it ever has. Now time to start this real life\" Kufrin first appeared on the franchise on season 22 of The Bachelor, getting engaged to Arie Luyendyk Jr. before they famously split. Stepping into the spotlight as The Bachelorette on season 14, the Minnesota-born publicist got engaged to Garrett Yrigoyen on the show in 2018. Two years later, she announced they had called it off. Jacobs, meanwhile, joined Bachelor Nation on the recent season of The Bachelorette starring Katie Thurston, before ultimately falling for Kufrin on BiP. On May 29, 2022, the pair announced their engagement and surprised fans with the unconventional proposal — Kufrin proposed to Jacobs! \"The ultimate UNO reverse card / power move. You keeping me on my toes for a lifetime has a great ring to it. Cheers to forever Boops,\" Jacobs wrote in an Instagram post.\n\n14 of 77 Clare Crawley & Dale Moss, The Bachelorette Season 16 Dale Moss and Clare Crawley. Warner bros. \"Congratulations, you've just blown up The Bachelorette,\" Chris Harrison told Crawley when she decided just a few episodes into season 16 to ride off into the sunset with Moss. The pair had an undeniable connection that led to Crawley rejecting the rest of her suitors in favor of getting to know Moss better; an emergency call to jeweler Neil Lane and a heartfelt proposal followed. \"It's wild that we're here right now, but when you know, you know,\" Moss said. \"This is how it was supposed to happen at the beginning. We saw this coming a long time ago.\" Crawley added, \"We so saw this coming. I felt it. I knew it.\" Just over two months after their big twist, the pair announced they were splitting up. Or were they? In mid-February, they were spotted looking coupley again in Florida. And in May, Moss shared a snap of Crawley flashing the engagement ring he proposed to her with last year. Weeks after ringing in the Fourth of July together, the couple celebrated their one-year anniversary with touching tributes on their respective Instagram accounts. On Sept. 28, PEOPLE confirmed that the pair split once again. \"It was mutual,\" a source says. \"It happened two weeks ago.\" In January, Crawley was rumored to be dating Blake Monar, another contestant on her season of The Bachelorette, after the two were seen spending time together in Indiana.\n\n15 of 77 Hannah Brown & Jed Wyatt, The Bachelorette Season 15 Hannah Brown, Jed Wyatt. Mark Bourdillon/ ABC Their televised engagement may have looked picture-perfect, but once the cameras stopped rolling, The Bachelorette's Brown said things with her fiancé Wyatt were far from ideal — even before news broke that he had a girlfriend when he went on the show. \"It was hard right off the bat,\" Brown — who got engaged to Wyatt on the season finale after agonizing over her decision between him and runner-up Tyler Cameron — told PEOPLE. \"We loved each other, but it wasn't as perfect as I thought it would be.\" Brown and Cameron later sparked relationship rumors when they were spotted hanging out together early in the COVID-19 pandemic, though she's now happily dating Adam Woolard. Brown also appeared on Colton Underwood's season of The Bachelor, placing seventh.\n\n16 of 77 Becca Kufrin & Garrett Yrigoyen, The Bachelorette Season 14 Raymond Hall/GC Images Kufrin broke tradition when she told PEOPLE she was engaged before the start of her big season - but was able to keep the (somewhat controversial) winner under wraps until the August 2018 finale. \"I feel like I could be happy with either guy and both of them would be a right choice for me,\" she said. \"But I'm going for the one that I can't see myself without. This love feels like it just fits my soul, it just fits my heart. I'm so happy that I pushed through to find what I've always wanted. I really feel like I've not only found my partner in this, but I've also found myself.\" In June 2020, Kufrin revealed that she didn't \"know\" the status of her relationship with Yrigoyen following his support of law enforcement in the wake of national protests against systemic racism and police brutality. In August 2020, after two years together, the pair called it quits. Kufrin confirmed the split on the podcast she cohosts with fellow Bachelorette alum, Rachel Lindsay, Bachelor Happy Hour. \"I don't think it's going to come as a shock to anyone, but Garrett and I have decided to end our engagement,\" Kufrin shared, acknowledging that fans have probably noticed on social media that they have been spending time apart. The former Bachelorette said of the breakup, \"Garrett and I came to this decision after many conversations. It wasn't just something we just arrived at one night. It wasn't based solely off of one Instagram post or somebody else's opinions or comments. There's much more to it. To any relationship, there's a lot of layers. It's not for me to divulge details. It's no one's business other than what I'm telling you right now.\" \"We went on this crazy TV show over two years ago in hopes of finding love, and we were lucky enough that we did,\" Kufrin continued. \"We really, truly did. I'm so grateful for that opportunity and to have had the two-plus years with Garrett. Like I said, I still have so much love and compassion in my heart for him. Just because we've arrived at this decision now doesn't take away all of the years and the countless memories that we've made together. I will always look back at this time in my life with so much gratitude and love.\"\n\n17 of 77 Matt James & Rachael Kirkconnell, The Bachelor Season 25 Matt James and Rachael Kirkconnell. Rachael Kirkconnell/instagram The Bachelor season 25 pair were over before their finale ever aired. After James chose not to propose on his finale — based on hesitancy to rush into marriage - past social media posts of Kirkconnell's surfaced that showed her wearing Native American attire as a costume and dressed up at a 2018 antebellum-themed party. Though she apologized, on the After the Final Rose special in March 2021, James explained why the two were no longer together, despite professing love for one another on their finale. \"As Rachael acknowledged in her apology, there's a lot of work that needs to be done. I have to take a step back and allow her to put in that work,\" said James. \"And I'm looking forward to seeing her put in that work.\" He added, \"If you don't understand that something like that is problematic in 2018, there's a lot of me that you won't understand. And it's as simple as that.\" Later in the conversation, he shared, \"The most disappointing thing for me was having to explain to you why what I saw was problematic and why I was so upset. When I questioned our relationship, it was on the context of you not fully understanding my Blackness, and what it means to be a Black man in America. And what it would mean for our kids when I saw those things that were floating around the internet.\" However, in late April, he told PEOPLE he and Kirkconnell were working things out, explaining, \"I'm not pursuing any relationships right now outside of that.\" Since rekindling their romance, the couple told PEOPLE in July that they have worked hard to reach a good place in their relationship, overcoming obstacles amid fierce criticism. \"I will say that, you know, of course it was difficult in the moment, but just being able to step back and work on our relationship to assess,\" Kirkconnell said. \"Taking a moment away from the spotlight's been really good for us. It's been a lot better.\"\n\n18 of 77 Peter Weber & Madison Prewett, The Bachelor Season 24 ABC/John Fleenor Two days after sharing that they were giving their relationship a shot on After the Final Rose, the pair announced that they were splitting. Peter wrote on Instagram, \"Madi and I have mutually decided to not pursue our relationship any further. Believe me, this was not easy for either of us to be ok with, but after a lot of honest conversations, we have agreed that this is what makes most sense for the two of us. The love and respect I have for Madi will continue to endure.\" Madison wrote of their relationship on Instagram, \"As Peter and I have decided to go our separate ways, I am confident that we will both move in the direction of our purpose and never forget that God has a plan in all things. I will always love and respect him. I am convinced our paths were meant to cross and we are both better because they did.\" She announced her engagement to boyfriend Grant Troutt on July 31, 2022.\n\n19 of 77 Hannah Ann Sluss & Peter Weber and Madison Prewett & Peter Weber, The Bachelor Season 24 Maarten de Boer/ABC via Getty; Eric McCandless via Getty; Maarten de Boer/ABC via Getty Where to begin! After Madison self-eliminated at the end of season 24, telling Peter she could no longer trust him once he admitted he'd been intimate with contestants Hannah Ann and Victoria Fuller in the Fantasy Suite, he chose to propose to the last woman standing, Hannah Ann, after much soul-searching on both of their parts. Fast-forward to After the Final Rose, when viewers learned Peter and Hannah Ann broke off their engagement one month after filming the finale - in large part due to his lingering feelings for Madison (despite his family's pleas to pursue Hannah Ann). Madison appeared on After the Finale Rose, as well, and the pair decided to slowly give their relationship a go. Two days later, the pair announced that they were ending their relationship.\n\n21 of 77 Colton Underwood & Cassie Randolph, The Bachelor Season 23 John Fleenor/ABC After a dramatic conclusion to Underwood's season, he ended up together, though not engaged, to Randolph. \"I think that's why we're still here today, because we took it at our own pace,\" Randolph told PEOPLE. \"We didn't want to rush something that was going to be forever.\" By May 2020, the pair announced they were \"just meant to be friends\" in complementary Instagram posts. Underwood captioned his post, \"Its [sic] been a crazy few months to say the least, Cass and I have been doing a lot of self-reflecting. Sometimes people are just meant to be friends - and that's okay.\" However, three months later, Randolph filed for a restraining order against Underwood, accusing him of planting a tracking device in her car, showing up to her home unannounced and sending alarming text messages. The court granted her a temporary restraining order until Oct. 6. Reps for both did not respond to PEOPLE's request for comment, but a source told PEOPLE Randolph harbors no \"ill will\" but \"wants [Underwood] to get whatever help he needs.\" In April 2021, Underwood publicly came out on Good Morning America. \"I've ran from myself for a long time. I've hated myself for a long time, and I'm gay. And I came to terms with that earlier this year and have been processing it,\" the reality star said. \"The next step in all of this was letting people know. I'm still nervous. It's been a journey, for sure. I'm emotional, but in such a good, happy, positive way.\" He announced his engagement to Jordan C. Brown in February 2022.\n\n22 of 77 Arie Luyendyk Jr. & Becca Kufrin, The Bachelor Season 22 Lorenzo Bevilaqua/ABC/Getty Images; Craig Sjodin/ABC At the end of Luyendyk Jr.'s Bachelor journey, viewers were treated to a two-part finale, which included an engagement, a subsequent split and a second engagement over the span of two nights. So, what exactly happened? Shortly after popping the question to Kufrin, Luyendyk Jr. began having doubts and ultimately made the decision to end things with his newly minted fiancée — on camera. As for his reasoning, Luyendyk Jr. admitted he wanted to give a relationship with runner-up Lauren Burnham a chance. On After the Final Rose, Luyendyk Jr. and Burnham reunited, with the Bachelor getting down on one knee — once again — to propose to Burnham. She accepted. \"I was just like, 'We need to do it, you need to take the risk if this means a lot to you and you need to follow your heart,'\" Burnham recalled to PEOPLE, sharing that Luyendyk Jr. reached out to her while he and Kufrin were still engaged. \"'If not, then we don't need to talk anymore.'\" \"At the end of the day, I don't think he thought through everything of how ending things with Lauren would be, how being engaged to me would be and what breaking up with me and going back to her would be,\" Kufrin told PEOPLE of the heartbreaking split. \"I don't think he thought it through, but I don't think he did it maliciously to break my heart.\" In November 2018, Luyendyk Jr. and Burnham announced they were expecting their first child, a girl, and in January 2019, they tied the knot in Hawaii. The couple welcomed daughter Alessi in May 2019, and expanded their family again with boy-girl twins in June 2021, welcoming daughter Senna and son Lux.\n\n23 of 77 Chris Bukowski & Katie Morton, Bachelor in Paradise Season 6 John Fleenor via Getty The Bachelor in Paradise couple may have left Mexico engaged and ready to start a future together, but their romance was short-lived. At the September 2019 reunion, Katie told Chris Harrison that she was really struggling with their relationship and had chosen to stop wearing her engagement ring. The pair reconciled in September and Katie put her ring back on, but in December 2019 both stars confirmed they'd decided to split. \"We've reached a point in our story where we agree it's best to go our separate ways,\" each wrote on Instagram. \"We have chosen to love and respect each other as friends.\"\n\n24 of 77 Hannah Godwin & Dylan Barbour, Bachelor in Paradise Season 6 John Fleenor via Getty This love triangle is officially just a line. After struggling to decide between Dylan and Blake for much of the season, Hannah finally chose Dylan and they left Bachelor in Paradise engaged. The pair are still together, and have since moved in together in San Diego, California.\n\n25 of 77 Tayshia Adams & John Paul Jones, Bachelor in Paradise Season 6 Tayshia Adams/Instagram After a dramatic stint on Bachelor in Paradise ended with the pair going their separate ways, Tayshia made the bold move to show up on John Paul's doorstep after the show ended to ask for a second chance. She had originally broken up with the trouble-making 24-year-old after he told her that he loved her. In September 2019, the pair confirmed their relationship status, but by Oct. 31 the pair had split. \"We truly did the best we could, but at this time have decided that what is best for the both of us is to go our separate ways,\" Tayshia wrote in a lengthy Instagram post. \"We are the best of friends and will continue to remain in each other's life because regardless of the situation, we make each other happy💕💕\"\n\n26 of 77 Caelynn Miller-Keyes & Dean Unglert, Bachelor in Paradise Season 6 Jon Kopaloff/Getty Images Unglert had initially left Paradise without Miller-Keyes, but returned to beg her for a second chance. Though she was skeptical, she took a leap of faith, and the pair are still dating. In March of 2021, Unglert voiced his gratitude for the \"unconditional love\" they share.\n\n27 of 77 Demi Burnett & Kristian Haggerty, Bachelor in Paradise Season 6 Demi Burnett/Instagram The women made history as the first same-sex couple on the franchise when Kristian entered Bachelor in Paradise in pursuit of her ex, Burnett. Demi proposed to Kristian on the beaches of Paradise in the September 2019 finale, and Kristian returned the favor by popping the question on the reunion show. Sadly, Demi and Kristian split in October 2019. The pair each shared photos from their relationship to their respective Instagram accounts, accompanied by the same lengthy caption. In part, it read, \"What has always been at the forefront of our relationship is love and care for one another …With a heavy heart full of love for one another we have decided it is best for us to take a step back from our relationship … We will forever be proud of the impact our love story has made.\"\n\n28 of 77 Rachel Lindsay & Bryan Abasolo, The Bachelorette Season 13 The history-making Bachelorette (Lindsay was the first-ever black lead of the show) found love with Miami native Abasolo. At the time, though, Absolo's windy proposal was nearly overshadowed by her heart-wrenching breakup with runner-up Peter Kraus. (She told Kraus she loved him, which had social media abuzz.) Lindsay herself, however, shut down any accusations that she chose the wrong man: \"At the end, it was not tough for me,\" she told PEOPLE. \"Going through it, I felt Bryan was perfect for me. Obviously nobody's perfect - but perfect for me.\" In August 2019, after a two-year engagement, the pair wed in an \"island chic\" wedding in Mexico and spent their honeymoon relaxing in Greece.\n\n29 of 77 JoJo Fletcher & Jordan Rodgers, The Bachelorette Season 12 Ray Tamarra/GC Images It seems that on The Bachelorette, the women know their heart early on. In season 12, Fletcher gave Rodgers the first impression rose, and throughout the season, they had crazy, off-the-charts chemistry. So when Fletcher sent her runner-up Robby Hayes home, no one was surprised - and people were even less shocked when Rodgers got down on one knee. Rodgers did surprise Fletcher with another proposal in August 2019-three years after they got engaged on The Bachelorette. The pair planned to wed in June 2020, but bumped their big day to May 2021 due to the coronavirus pandemic. In May of this year, Fletcher said they were delaying the nuptials again amid the ongoing outbreak, but the pair wed on May 14, 2022, six years after their engagement on The Bachelorette season 12 finale.\n\n30 of 77 Chris Randone & Krystal Nielson, Bachelor in Paradise Season 5 Chris Randone/Instagram Randone and Nielson were the villains of their seasons (Randone competed for Becca Kufrin's heart while Nielson vied for Arie Luyendyk Jr.'s.) However, they got their own happy endings when they found love in Paradise, leaving their season engaged. The pair were married in July 2019 in a wedding officiated by Chris Harrison, which aired on season 6 of Bachelor in Paradise. However, Paradise was lost when the couple announced their split on Valentine's Day 2020. \"It hurts to announce that at this moment, we have mutually decided to separate. Never did we imagine this scenario, but we've come to a point where we both need to work on ourselves,\" they said in a statement to Bachelor Nation.\n\n31 of 77 Kevin Wendt & Astrid Loch, Bachelor in Paradise Season 5 Kevin Wendt/Instagram Canadian fireman Wendt was introduced to the American public when he competed in the Bachelor Winter Games and ended up with Iaconetti. After he and Ashley I. called it quits, he showed up for the fifth season of Bachelor in Paradise. That's where he met Loch, who competed on Nick Viall's season of The Bachelor. The pair initially ended their relationship in Paradise, but reconnected off-screen and are still going strong. Wendt proposed to Loch in September 2019 in Toronto, Canada, which is where the pair have been living together. On Mother's Day 2021, the couple announced they were expecting after a long journey with IVF. Baby boy August arrived that November.\n\n32 of 77 Joe Amabile & Kendall Long, Bachelor in Paradise Season 5 Joe Amabile/Instagram Grocery Store Joe bagged himself a girlfriend during the fifth season of Bachelor in Paradise. Kendall initially was hesitant to be in a relationship with the grocery store owner, causing Joe to leave the show prematurely. In a romantic gesture, Kendall flew to Chicago after the show finished filming and the pair rekindled their romance. The pair even announced that they were living together in Los Angeles. In January 2020, there was a call for clean up in aisle 'love' when the pair announced that they would be splitting up after a year of dating. \"We have decided mutually to go our separate ways,\" the couple said in a joint statement on Jan. 29. \"Joe has made the decision to move back to Chicago while Kendall will be remaining in her hometown of Los Angeles,\" the pair told BachelorNation.com. The pair returned to Bachelor in Paradise individually for season seven, in which Kendall professed her continued love for her ex — who expressed that he felt it was \"over between us.\" Afterwards, Kendall exited the show.\n\n33 of 77 Nick Viall & Vanessa Grimaldi, The Bachelor Season 21 Nick Viall/Instagram The Bachelorette and Bachelor in Paradise mainstay seemed to have found love with fan-favorite Grimaldi, a special education teacher from Montreal. Though he proposed on the season finale, \"I think it's too early for us [to get married],\" he shared in March 2017. \"We're still doing a lot of new things together. We're very open about the fact that we have a long way to go and we're excited about that journey.\" Following a whirlwind courtship, the couple called it quits after five months together, in August 2017. \"It's with a great amount of heartbreak for the both us as we have decided to end our engagement,\" the pair told E! in a statement. \"We gave this relationship our all and we are saddened that we did not get the fairytale ending we hoped for. We will continue to be there for each other no matter what. This hasn't been an easy decision, however, as we part ways, we do so with lots of love and admiration for each other.\"\n\n34 of 77 Raven Gates & Adam Gottschalk, Bachelor in Paradise Season 4 Adam Gottschalk/Instagram Gates competed on Nick Viall's season of The Bachelor, while Adam Gottschalk was a contestant on Rachel Lindsay's season of The Bachelorette. The pair met on the beaches of Paradise and got engaged in May 2019 after nearly two years of dating. The two delayed their wedding several times during the COVID-19 pandemic, but finally said \"I Do\" on April 16, 2021, outside of Dallas. In July, Gates and Gottschalk announced they were expecting their first child, with the baby due in January. \"We found out right after the wedding. I've wanted to be a mom for a long time. And I always imagined creating a family with someone I love so much,\" Gates told PEOPLE. Their son arrived in January 2022.\n\n35 of 77 Amanda Stanton & Josh Murray, Bachelor in Paradise Season 3 ABC/Rick Rowell He proposed to Andi Dorfman during his previous stint on The Bachelor franchise, and Murray walked away from the 2016 season of Paradise with yet another new love. (Well, two, if you count the pizza.) Since the finale, he moved to southern California to be with Stanton and her daughters. And it seemed Murray was settling in very well - he Instagrammed a photo of the foursome with the caption \"My new family.\" Unfortunately, the engagement didn't last - they announced their split in January 2017. Stanton married boyfriend Michael Fogel in the summer of 2022.\n\n36 of 77 Lace Morris & Grant Kemp, Bachelor in Paradise Season 3 Rick Rowell/ABC Two months after the 2016 Bachelor in Paradise finale, Morris and Kemp were living together in San Francisco and looking forward to planning their wedding. Yet in November 2016, despite having matching tattoos, the couple split.\n\n37 of 77 Carly Waddell & Evan Bass, Bachelor in Paradise Season 3 Rick Rowell/ABC Despite a rocky beginning to their relationship, Waddell fell head over heels for The Bachelor franchise's resident erectile disfunction specialist: She told PEOPLE, \"I just love Evan. I would marry him tomorrow!\" She didn't have to wait too long: The couple tied the knot in June, announced they were expecting their first child together in August, and welcomed their baby girl in February 2018. In November 2019, the pair welcomed their second child into the world, a baby boy named Charles Wolfe. Sadly, in December 2020, they announced they were going their separate ways. \"We have made the difficult decision to separate,\" the former couple said in a joint statement. \"We will always cherish our time together and continue to have the utmost respect for one another as we focus on what's best for the future of our family. We greatly appreciate everyone's love and support and kindly ask that you please respect our family's privacy as we navigate through this.\" There for her in her time of need, Bass was by his ex's side when she was rushed to the hospital in June 2021.\n\n38 of 77 Ben Higgins & Lauren Bushnell, The Bachelor Season 20 Source: Lauren Bushnell/Instagram She may not have received the first impression rose, but there was always something special between Higgins and Bushnell. So much so that he told her he loved her (though he told JoJo the same) before the final rose. Months after his proposal, they were still going strong: Bushnell moved to Higgins' home city of Denver, and they starred in their own reality show, Ben & Lauren: Happily Ever After. However, unresolved feelings about their time on the show always weighed on them - even sending them to couples' counseling - and in May 2017, they announced their split to PEOPLE. Both have since moved on; Higgins wed Jessica Clarke in November 2021, while Bushnell gave birth to her first child, son Dutton, in June, whom she welcomed with husband Chris Lane, whom she wed in October 2019.\n\n39 of 77 Kaitlyn Bristowe & Shawn Booth, The Bachelorette Season 11 Rick Rowell/ABC When Booth stepped out of the limo, it was clear that he only had eyes for Bristowe - and she felt the same. \"When Shawn came out of the limo, and we talked, I was like, 'Damn!' \" she said on their season's first night. The infatuation only grew from there: Booth proposed during the finale, she accepted, and after the show was over, they subsequently moved in together in Nashville. But the pair announced their split in a November 2018 statement to PEOPLE after months of speculation that they were on the rocks. \"After three incredible years, we have decided to go our separate ways,\" they wrote. \"This difficult decision comes after thoughtful, respectful consideration. Even though we are parting as a couple, we're very much committed to remaining friends.\"\n\n40 of 77 Kaitlyn Bristow & Jason Tartick Kaitlyn Bristowe and Jason Tartick. Alexander Tamargo/Getty While they didn't technically meet on television, both are part of the Bachelor/ette franchise. Bristowe first competed for Chris Soules' heart on season 19. Then, she went on to star on season 11 of The Bachelorette. Tartick appeared on Becca Kufrin's season of The Bachelorette, making it to the final three before being sent home. The pair announced that they were a couple in January 2019, and in May 2021, shared news of their engagement. In July, Tartick told PEOPLE he and his Bachelorette-hosting fiancée were moving \"full speed ahead\" with wedding planning.\n\n41 of 77 Britt Nilsson & Brady Toops, The Bachelorette Season 11 Courtesy Britt Nilsson For the first time in franchise history, suitors had the chance to choose between two women for the title of Bachelorette. The men ended up choosing Kaitlyn Bristowe over Britt Nilsson, but that wasn't the end of Nilsson's journey. Brady Toops, a singer-songwriter from Nashville, decided to leave the show in order to pursue Nilsson. Their romance was documented briefly on Bristowe's season and though the couple remained together once filming wrapped, they ultimately split in the spring of 2015. \"Everything on paper was perfect,\" Nilsson told PEOPLE exclusively. \"But we didn't have that connection I was looking for.\" In September 2017, Nilsson married her boyfriend of two years, Jeremy Byrne. On June 23, 2020, the couple welcomed their first child, a baby girl named Noa Ellis Joy, followed by daughter Alya Karolina Grace in July 2022.\n\n42 of 77 Chris Soules & Whitney Bischoff, The Bachelor Season 19 Ari Michelson Though he admitted that he was on the way to falling in love with runner-up Becca Tilley, Soules ended up proposing to fertility nurse Bischoff in the finale. (Naturally, he did so in a barn in his hometown of Arlington, Iowa.) \"Whitney is my soulmate,\" Prince Farming revealed to PEOPLE. \"It became even more clear at the end. It just felt right.\" Nearly seven months after Soules got down on one knee, the couple announced their split in a joint statement: \"They part with nothing but respect and admiration for one another and will continue to be supportive friends.\"\n\n43 of 77 Chris Soules & Victoria Fuller Chris Soules, Victoria Fuller. Steve Granitz/WireImage; Maarten de Boer/ABC via Getty Images; Presley Ann/Getty Images After first sparking dating rumors at the start of the coronavirus pandemic, Soules, the star of season 19 of The Bachelor, and Fuller, a contestant on Peter Weber's season, officially became a couple. \"We're really happy,\" Fuller, told PEOPLE in July 2020, opening up for the first time about her relationship with Soules. \"The last few months have been really special for us. We're enjoying each other!\" Fuller met Soules through mutual friend - and Soules' fellow Iowa native - Kelsey Weier, who competed with Fuller on Peter Weber's Bachelor season. Fuller said that the couple was handling their long-distance relationship well. \"We don't really have a system, but the amazing thing about him is that he never puts pressure on our relationship or wants to put a timeline on it,\" said Fuller. \"We are learning and we're growing and we're figuring each other out.\" Unfortunately in September of that year, Fuller confirmed on Nick Viall's podcast the Viall Files that she and Soules had gone their separate ways. She told Viall that there's no hard feelings. \"I respect him so much. I think he's an amazing man. I just think that like right now, I'm in such a different place than he is,\" she said, \"And I'm not moving to Iowa anytime soon.\"\n\n44 of 77 Andi Dorfman & Josh Murray, The Bachelorette Season 10 Javier Pesquera/ABC/Getty While she initially leaned toward contestant Nick Viall, Dorfman chose Murray and their season ended in a proposal. The couple split in January 2015, despite seeming happy and in love just days prior.\n\n45 of 77 Juan Pablo Galavis & Nikki Ferrell, The Bachelor Season 18 Rick Rowell/ABC After a tumultuous season (during which future Bachelorette Andi Dorfman would lay into him for being conceited and emotionally unavailable), Galavis gave Ferrell the final rose. There was no proposal, however, as the father of one couldn't even say, \"I love you.\" The couple appeared on season 5 of Couples Therapy, but it couldn't save their relationship - they split in October 2014.\n\n46 of 77 Desiree Hartsock & Chris Siegfried, The Bachelorette Season 9 Francisco Roman/ABC Hartsock's road to the altar as the ninth Bachelorette wasn't smooth, but she eventually chose Siegfried after having her heart broken by Brooks Forrester. The season ended in a proposal, and the couple married in January 2015. They have two young sons, Asher and Zander.\n\n47 of 77 Sean Lowe & Catherine Giudici, The Bachelor Season 17 Todd Wawrychuk/ABC/Getty After finishing third in Emily Maynard's season, Lowe became the 17th Bachelor and proposed to Giuidici in the finale, promising, \"I want to spend the rest of my life telling you that I love you and making you feel like the most special, beautiful woman in the world.\" Their nuptials were televised on ABC in January 2014; given that the two waited to consummate their union until they made it official, their Tahitian honeymoon was a celebratory occasion for more reasons than one. More reasons to celebrate? They welcomed their first child, son Samuel Thomas, in July 2016, and their second, son Isaiah, in May 2018. Daughter Mia joined the family in December 2019.\n\n48 of 77 Ben Flajnik & Courtney Robertson, The Bachelor Season 16 NICK RAY/ABC While Flajnik's season of The Bachelor ended with a proposal, he and Robertson broke up during the airing of season 16 after he witnessed her less-than-virtuous behavior on the show. They got back together, as they revealed on their After the Final Rose special, but broke up for good in October 2012. She went on to release a tell-all in June 2014 titled I Didn't Come Here to Make Friends. Apt. In the fall of 2014, Flajnik was rumored to be dating Kris Jenner, but the two insisted they were just friends.\n\n49 of 77 Emily Maynard & Jef Holm, The Bachelorette Season 8 Rick Rowell/ABC/Getty Maynard chose Holm in the eighth season of The Bachelorette, and he popped the question in response. Their relationship was short-lived, however - they split after two months, in October 2012. Maynard became engaged for the fourth time when she accepted the proposal of automotive management consultant Tyler Johnson in January 2014; they married that June and have three young sons and a daughter (Emily also has a daughter, Ricki, from previous relationship).\n\n50 of 77 Brad Womack & Emily Maynard, The Bachelor Season 15 MARK WESSELS/ABC Womack wasn't the only one going after a second chance at love in season 15. After leaving season 11 of The Bachelor without a bride-to-be, Womack's season 15 ended in a proposal to Maynard, who had jumped back into the dating pool after her fiancé died in a plane crash years earlier. Womack and Maynard broke up while their season was airing, reunited after the finale, then announced their amicable split to PEOPLE in June 2011. Womack was later linked to AshLee Frazier, a contestant from Sean Lowe's season, though the two broke up after less than one year of dating.\n\n51 of 77 Ashley Hebert & J.P. Rosenbaum, The Bachelorette Season 7 Adam Taylor/ABC via Getty Sadly, another beloved Bachelorette couple is going their separate ways. On Oct. 14, 2020, Hebert and Rosenbaum announced that they would be splitting up after nearly eight years of marriage, with Rosenbaum officially filing in July 2021. \"It is with a heavy heart that I share with you that, after months of separation, Jp and I have amicably decided to go our separate ways,\" Hebert wrote alongside a photo of the couple dancing. \"We created the most beautiful children and shared memories that will never be forgotten. Our differences have taken a toll on our relationship and after years of attempting to repair the damage, we've decided that it is in our family's best interest to create new and separate lives for our children.\" Rosenbaum posted the news as well, writing, \"I have written and rewritten this post dozens of times and each time I feel the same level of disbelief and extreme sadness. While I realize that this will come as a complete shock to everyone, I can assure you that this is something that has been developing in our relationship for quite a while. It is with a heavy heart that I share with you that after months of separation, Ashley and I have amicably decided to live our lives apart from one another.\" Hebert was the seventh Bachelorette, and her season ended in a proposal from Rosenbaum. They married in December 2012, and their nuptials aired on ABC. In September 2014, Hebert gave birth to their son, Fordham Rhys. In November 2016, they welcomed their second child, daughter Essex.\n\n52 of 77 Jared Haibon & Ashley Iaconetti, Bachelor in Paradise Season 2 Fans watched Ashley Iaconetti pursue Jared Haibon on not one but two seasons of Bachelor in Paradise. Iaconetti, who is best known for crying a whole lot throughout her time on the franchise, just knew that she was destined to be with Haibon. After a lot of ups and downs, the pair announced that they were dating in May 2018, and got engaged in June 2018. The pair tied the knot in Rhode Island in July 2019 and jetted off to Greece for a gorgeous honeymoon. In July 2021, the couple announced they were expecting their first child; baby boy Dawson arrived in January 2022.\n\n53 of 77 Tanner Tolbert & Jade Roper, Bachelor in Paradise Season 2 John and Joseph Photography There were a lot of ups and downs on the second season of Bachelor in Paradise, but one thing remained consistent throughout: Roper and Tolbert's romance. They ended things in paradise with a proposal and had a televised Bachelor wedding in early 2016. They welcomed daughter Emmy in August 2017, and welcomed their second child, a boy, in July 2019. Then in May 2020, the couple announced they would officially be outnumbered: They are expecting baby no. 3! Their second son arrived in Novemer 2020.\n\n54 of 77 Holly Durst & Blake Julian, Bachelor in Paradise Season 2 Courtesy Holly Julian Though Durst voted Julian off on the second season of Bachelor Pad, she handed him a note at the rose ceremony telling him that it wasn't the end for them. Indeed, it wasn't - the pair got engaged in September 2011 and married in June 2012. In 2019, they welcomed a daughter through adoption.\n\n55 of 77 Ali Fedotowksy & Roberto Martinez, The Bachelorette Season 6 Matt Klitshcer/ABC/Getty The sixth Bachelorette, Fedotowsky chose Martinez in the finale. He proposed, but they split in November 2011. Fedotowsky told PEOPLE, \"We both realized we were unhappy more than we were happy.\" Fedotowsky went on to marry TV host Kevin Manno, with whom she has two children.\n\n56 of 77 Marcus Grodd & Lacy Faddoul, Bachelor in Paradise Season 1 Francisco Roman/ABC/Getty Grodd and Faddoul met during the first season of Bachelor in Paradise, and the two hit it off almost immediately. At the final rose ceremony, Grodd proposed, and the couple wed in August - or so viewers thought. Grodd revealed to PEOPLE that his and Faddoul's nuptials were never legal and that \"she became a different person.\" He continued, \"It became a toxic relationship at times ... There were a lot of barriers that we couldn't overcome.\"\n\n57 of 77 Cody Sattler & Michelle Money, Bachelor in Paradise Season 1 Francisco Roman/ABC/Getty Though they left the first season of Bachelor in Paradise as a couple, Sattler and Money amicably split in December 2014, before rekindling the relationship and working through their relationship issues on Marriage Booty Camp: Reality Stars in 2016. They split again soon after.\n\n58 of 77 Kiptyn Locke & Tenley Molzahn, Bachelor in Paradise Season 1 Greg Zabilski/ABC/Getty Runners-up Locke and Molzahn didn't manage to take home the top prize, but they did walk away from season 1 of Bachelor Pad as a couple. They broke up in March 2013 after a two-and-a-half-year relationship, but reunited in February 2014. However in March 2015, Locke announced he was expecting his first child, a son - with his new girlfriend, Samm Murphy.\n\n59 of 77 Jake Pavelka & Vienna Girardi, The Bachelor Season 14 MARK BRENDEL/ABC Pilot Pavelka proposed to Girardi during his reign as The Bachelor, but the couple split just a few short months following the finale, later appearing together on the second season of Bachelor Pad. In late 2012, Pavelka was linked to Kristin Chenoweth, though their relationship was short-lived. Girardi kept it in the family when she dated former Bachelorette contestant Kasey Kahl in 2011, but they too broke up after less than one year together.\n\n60 of 77 Jillian Harris & Ed Swiderski, The Bachelorette Season 5 MARIO PEREZ/ABC The fifth Bachelorette, Harris chose Swiderski and her season ended in a proposal. But the couple split sometime in 2010, after rumors swirled that he'd dated two other women during his time on the show. Harris is now engaged to Justin Pasutto, with whom she has two children.\n\n61 of 77 Jason Mesnick & Melissa Rycroft, The Bachelor Season 13 MATT KLITSCHER/ABC Mesnick proposed to Rycroft, but ended up reversing his decision on one of the most wild After the Final Rose specials ever. There, he broke up with Rycroft and asked runner-up Molly Malaney for a second chance; she accepted, and the couple tied the knot in February 2010 and now have a daughter together. Meanwhile, Rycroft has three children with Tye Strickland, whom she married in 2009.\n\n62 of 77 Matt Grant & Shayne Lamas, The Bachelor Season 12 ADAM LARKEY/ABC On The Bachelor: London Calling, Grant proposed to Lamas, but the two called it off not long after their televised engagement.\n\n63 of 77 Deanna Pappas & Jesse Csincsak, The Bachelorette Season 4 ADAM LARKEY/ABC After being sent home by Brad Womack, Pappas became The Bachelorette and chose snowboarder Csincsak to get down on one knee. Despite setting a wedding date - May 9, 2009 - the couple parted ways in November 2008. Pappas still found love within the Bachelor franchise, however; she went on to marry Stephen Stagliano - the twin brother of Michael Stagliano, who appeared on Jillian Harris's season of The Bachelorette - in October 2011. They welcomed their first child in February 2014 and a second two years later. In August 2010, Csincsak married Ann Lueders, who appeared on Jason Mesnick's season of The Bachelor. They, too, welcomed a daughter in 2014, and have since had two more children.\n\n64 of 77 Brad Womack, The Bachelor Season 11 CRAIG SJODIN/ABC/Getty Though he chose both DeAnna Pappas and Jenni Croft as finalists, Womack ended up rejecting both in the season finale.\n\n65 of 77 Andy Baldwin & Tessa Horst, The Bachelor Season 10 Craig Sjodin/ABC/Getty Baldwin proposed to Horst on the finale of The Bachelor: Officer and a Gentleman, but the two ended their engagement one month later. They continued their relationship for a little while longer, but she went on to break up with him less than one year later.\n\n66 of 77 Lorenzo Borghese & Jennifer Wilson, The Bachelor Season 9 CRAIG SJODIN/ABC In one of the few seasons not to end in a proposal, Borghese (a prince!) chose to pursue a relationship with Wilson on the finale of The Bachelor: Rome and offered her a promise ring. Spoiler: They broke up one month later.\n\n67 of 77 Travis Lane Stork & Sarah Stone, The Bachelor Season 8 CRAIG SJODIN/ABC Dr. Stork and schoolteacher Stone barely made it to the airing of the pre-taped finale; he never proposed, and the couple announced their breakup once the season finished airing.\n\n68 of 77 Jen Schefft, The Bachelorette Season 3 BOB D'AMICO/ABC Schefft chose Jerry Ferris over John Paul Merritt in her season of The Bachelorette, but ultimately rejected him when he proposed.\n\n69 of 77 Charlie O'Connell & Sarah Brice, The Bachelor Season 7 Craig Sjodin/ABC/Getty Brother to Jerry O'Connell, Charlie chose not to propose to finalist Brice but pursued a relationship with her regardless. They dated from 2005 to 2007, and though they reunited once, they ended it for good in 2010.\n\n70 of 77 Meredith Phillips & Ian McKee, The Bachelorette Season 2 CRAIG SJODIN/ABC Phillips chose McKee in her season of The Bachelorette and he proposed, but the couple broke up less than one year after the finale.\n\n71 of 77 Byron Velvick & Mary Delgado, The Bachelor Season 6 CRAIG SJODIN/ABC Velvick proposed to Delgado and the two were together for five years before splitting in December 2009. Maybe it had something to do with this: In November 2007, following a taping of an After the Final Rose special on which the couple appeared as a success story, Delgado was arrested for hitting Velvick in the face.\n\n72 of 77 Jesse Palmer & Jessica Bowlin, The Bachelor Season 5 Michael Hickey/WireImage Just one month after proposing, Palmer and Bowlin ended their relationship, blaming long distance. Now, he's the host of the franchise, and quietly wed love Emely Fardo in June of 2020.\n\n73 of 77 Trista Rehn & Ryan Sutter, The Bachelorette Season 1 Dala Yitzhak/ABC/Getty One of the franchise's biggest success stories, Rehn and Sutter tied the knot in a televised ceremony in December 2003. The couple has two children together - a boy named Maxwell and a girl named Blakesley.\n\n74 of 77 Bob Guiney & Estella Gardinier, The Bachelor Season 4 Craig Sjodin/ABC/Getty Bachelor Bob did not propose to Gardinier during his reign, though she did accept a promise ring. The two split five months later but remain friendly to this day.\n\n75 of 77 Andrew Firestone & Jen Schefft, The Bachelor Season 3 Mitch Haaseth/ABC/Getty Firestone proposed to Schefft, and the two were together for 10 months before parting ways amicably in December 2003. But don't worry about them: both have their own happy, non-Bachelor families.\n\n76 of 77 Aaron Buerge & Helene Eksterowicz, The Bachelor Season 2 Craig Sjodin/ABC/Getty Eksterowicz was dumped by Bachelor Buerge just five weeks after he presented her with a 2-carat engagement ring. In February 2004, the couple teamed up to hawk the giant rock.", "images": ["https://people.com/thmb/vgjlpiF06-T1pqCuIYjzO30ypnw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/bachelorette-finale-65-13052022-6d6afda377824936a2ad99a4f0d0b9e2.jpg", "https://people.com/thmb/rFHfPax4n4MvXwe2a1k9oykxPIU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(610x659:612x661)/joe-amabile-serena-pitt-1-53821841d9ad4b4693c93be88ea7cd66.jpg", "https://people.com/thmb/KyCRRLa34__ujn64AUjFAMYQBxY=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(469x87:471x89)/noah-erb-abigail-heringer-5f6cfe6f8ed1489dbb11ac1e6306b347.jpg", "https://people.com/thmb/6FD3Xdpb4Z_5SeGaTyIqxpS6Eso=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(919x225:921x227)/joe-amabile-1-24860b130a7547819906d1347259f029.jpg", "https://people.com/thmb/6UIsSfpE_ijeEUn4oOo5hIf9gks=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/hannah-ann-peter-weber-madison-4f82c59d480745dd94081ce9b658ab57.jpg", "https://people.com/thmb/yDG8r4srkoWrkJk0q0FIkhW_nRw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(539x369:541x371)/maurissa-gunn-riley-christian-b8f56895a12c4c4a8aed53082a50e3ce.jpg", "https://people.com/thmb/OnXvekB1ne4BMU79ngFFHGgVpe8=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/andy-baldwin-435-642948e2f39949db8546ff89f35d43d4.jpg", "https://people.com/thmb/gKvvSYtOKJq3APqIcEZ36p3MfAg=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/jojo-jordan-435-a825a31feb2f4de3a42ccaee5ab0437e.jpg", "https://people.com/thmb/gIGkFJhJ4zcpvWQ6rxcXN6BaTn8=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/matt-grant-435-4341a0285f27493e8144bda8a1f66759.jpg", "https://people.com/thmb/50ECvI-CpBco78U4_Q0cLhM2UXo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/152211_4418-2000-43a8a65e8d1442359a22b77ee41b7fbe.jpg", "https://people.com/thmb/g0wSQKnYMHqp50XhG_HdlHdUbUo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/gabby-erich-bachelorette-0920-efe882f770d648c693e86842b5eed9d3.jpg", "https://people.com/thmb/mMZ_aM-qNROu-gIVv1_kya43c80=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/chris-victoria-1a-a3899b8b004e4eda9f575574639140c3.jpg", "https://people.com/thmb/pCrJbMS-4zhR_izh1CLroX0miyM=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/jake-pavelka-660-2-2e50dec8c6374c2dbc5dfd3ca8916c99.jpg", "https://people.com/thmb/8cJmVZc7Ok6w5_4Wwxc14qmMsU4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/people_generic-1885945d8bd544778fbbf4be88a63f00.jpg", "https://people.com/thmb/QdLV59SLwbuw7tWJVvYtRWi0NKQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(919x63:921x65)/jojo-fletcher-6-b3d801604e9443cf85618ae0c9eb18c7.jpg", "https://people.com/thmb/Fl6b2SnFeNu07-VN0Ksu-Ewcq0o=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/jen-schefft-435-3-bddd88a77a4c428b9b5a0c0ca2031128.jpg", "https://people.com/thmb/twIc_q807u-P8Y6e3N4FkN93O0Q=/75x75/filters:no_upscale():max_bytes(150000):strip_icc()/IMG-6779-2000-932f49e67f8b43d4b7698ee1294eeb69.jpg", "https://people.com/thmb/18NBHGFhr8L9hdezujvgxaQ3MR4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(449x293:451x295)/brendan-morais-pieper-james-da1451f0e3a04cc293487db858baa547.jpg", "https://people.com/thmb/vs1yY-hrKkHM_yYjX0JyFIG7Odk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(702x0:704x2)/bachelor-couples-still-together-1-ce722536d82a4c2881f85626d8123d7c.jpg", "https://people.com/thmb/PMb7Lo7Comn5MgGcuHVLntYLSSo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/ben-higgins-e-435-c8beabc15d27433f92720b484c8df4df.jpg", "https://people.com/thmb/K0RunSgNUvS8OwYlDzNlQltw5Cc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/becca-kufrin-and-thomas-jacobs-de335cce4e094982ab25b613026b683a.jpg", "https://people.com/thmb/mqJWRhZTHiGfK2CVoy3CzqF-Qwk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(689x239:691x241)/rachel-recchina-tino-the-bachelorette-080822-3-d03ef1203742472caa1de6f4014d8bb0.jpg", "https://people.com/thmb/3fDRgQifIgf3dK_MYLRofRN1vRI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(506x301:508x303)/becca-kufrin-1-787d88a1dcaf44f099079f451a99c4e9.jpg", "https://people.com/thmb/lb4G5JC2e5QCzJJdd0wazPPT6sU=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Matt-James-and-Rachael-Kirkconnell-e81a195e31bd4e6192ac7446c5f56259.jpg", "https://people.com/thmb/V4r6EGOxIsK4g1ldvHtRGJBLnTs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(719x0:721x2)/gabby-windey-8-2000-46da134fd1f3449db95c69b619433c0e.jpg", "https://people.com/thmb/f9eItFnBlKjG7_Nj2UutrMT5S4s=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(699x0:701x2)/katie-thurston-2-d2e905602d24499e8a0cd29f0b0dd18f.jpg", "https://people.com/thmb/vSabHOsqPxoNcbXWZAY8KcnoSSY=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(799x0:801x2)/gettyimages-1169608836-2000-82e527837cf84a1898c1d506e560c570.jpg", "https://people.com/thmb/WWpy8EWhi6FqYpyzSdlQVWz6QTw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(431x359:433x361)/serena-pitt-joe-amabile-8473b6d0626248f68d0f01d9707f6030.jpg", "https://people.com/thmb/6fzoEQe1hF4S_eN2EWgK_Eky5Ac=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(488x251:490x253)/chris-conran-alana-milne-4d08d36707374b30b536b10b5535bee8.jpg", "https://people.com/thmb/mmn-JPGyHa28tvgDqP6Q-uTFdwo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/emily-maynard-435-6-8e61098f3d4641ee92b02a34e8cbaa64.jpg", "https://people.com/thmb/VmE8Quk3YoOQr6fiRF35rsye7Mg=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/charlie-oconnell-435-1-f95cb3a51f354b0fb3b3ab9b7d41e1e6.jpg", "https://people.com/thmb/QJzA7ho7ZzVoqhZqBCJ1j8MJBw0=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/bachelor-couples-still-together-4-86462fa8cb1f43418fb629c13f67ca28.jpg", "https://people.com/thmb/W8GCrsBOMkhJfv5jCUKdXDsasJM=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/juan-pablo-435-4-3fe1bf11978c43e6a09f9d9f2216c7a4.jpg", "https://people.com/thmb/JXT5vnFAc0LYUY2S6j_X0FVGcdI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/ben-flajnik-660-2-e444afc225714dd0a46ac107aa6ca621.jpg", "https://people.com/thmb/vAOJnx-hd-xEctpotWdiGzI8_Hc=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/ali-fedotowsky-435-9-52ba0a6809ba48818a8ef3cca4dcadb3.jpg", "https://people.com/thmb/54EaOl_dBRksZDFZCToap3KOayU=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(678x0:680x2)/jesse-palmer-7e18393b8bfa4eff8059af7283402409.jpg", "https://people.com/thmb/Rv_2xyImYbvHvySvF1KBDxpFEF4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/kiptyn-locke-1-660-fb44df78abde4dc9bdcfe57774dfaf44.jpg", "https://people.com/thmb/zeDms2o7kSxIdgseY4LAHf1P0pI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(704x309:706x311)/becca-kufrin-9def3747205b4ed1afe6bc6ca1295971.jpg", "https://people.com/thmb/wceShaUKps-5Rb4aG1nLRMBRfMg=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(519x179:521x181)/Zac-Tayshia-2-ff9ed3b2304e45fa89a8682030cb263e.jpg", "https://people.com/thmb/qsBsu51S_t6ktFFef9iCKsnKRlI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(764x199:766x201)/kenny-mari-3-e302415655c04849ad7d6922c310313e.jpg", "https://people.com/thmb/iCcu_1GKmLu9ScJDaYXkhSpjv6c=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(888x0:890x2)/bachelor-in-paradise-83022-6b3f9eb00c25486294326df772b1f14f.jpg", "https://people.com/thmb/f-73NjIndvSlp_5A8wySNqlXnPQ=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/chris-bukowski-katie-morton-3-d46773c1e4b74a81a544556aaa9667a3.jpg", "https://people.com/thmb/rKsOObWxFgVZuAlQ-HDbCT1lXUQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(979x658:981x660)/becca-kufrin-thomas-jacobs-5-d19286f7772349bea7250253af66dbad.jpg", "https://people.com/thmb/s9Lrk3HU0sSNdljNCVQEMTXlisw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(629x674:631x676)/kenny-mari-bachelor-2-9df66797c81e4a1abb5961ebf7b11075.jpg", "https://people.com/thmb/bX5u7mEi4Ptd4lifz3ahzK32NaY=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/andrew-firestone-435-58184edff9a2453e82dc2b4c5d4d065a.jpg", "https://people.com/thmb/Lje7sGaj3HgeS-yLg9z5JSNPfrU=/300x150/filters:no_upscale():max_bytes(150000):strip_icc()/people_magazine_sub-e6689738996d40f38f154099e1751481.png", "https://people.com/thmb/D1ZBOE3P-lpTOT85jPX5SUG4IUY=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/dean-and-caelynn-tout-5dee1f4403ee4d11a73ba7d34ab3bad5.jpg", "https://people.com/thmb/vVwseiVr4zRB9RQApQjeJHNtleA=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(6738x5624:6740x5626)/clare-crawley-dale-moss-63a1cfc3637c42ed81fe4512b7c6f0a3.jpg", "https://people.com/thmb/XBqzta3yRsqz8LfqGD4VUERawSc=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(748x0:750x2)/gettyimages-8279226301-9702279f2deb4a01a9c2fc3b4fd322c1.jpg", "https://people.com/thmb/xMmvm432cjih0wDEM5aEWUTiuIY=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/couple-1-881823819f7e4733b8a422bdbdf93b9f.jpg", "https://people.com/thmb/jAvPCPN2QXENf0egIPvcz4-j0Ck=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/brad-womack-435-1-90e9d707dcd340b88f4d41bed6147c64.jpg", "https://people.com/thmb/m7YfKhoDelIP3j6yFy0AgFeKJQc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(705x0:707x2)/peter-weber-2000-767afa7f05534a11b93240bbe4f74540.jpg", "https://people.com/thmb/urvUbZzW3896DGcLPPLrgKnLMhI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/peter-weber-kelley-flanigan-070b2bbd8cf645f39264f0be3667622d.jpg", "https://people.com/thmb/TSYMYtyEgoHM8trbQ00qMyV14f8=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/deanna-pappas-435-3-edbda58ec3b24f04b11d65cfcae3134c.jpg", "https://people.com/thmb/zdfJb7ZTHjZY-ZY2rDR49lw7TzU=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/travis-stork-435-a2ff55e957ef4072a0fb6437d015ed9e.jpg", "https://people.com/thmb/RZEDMuKh7ZoKy6chuuKLRUZ6yrI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/alex-michel-435-7baa7295f08c4e42a7878f163215f33b.jpg", "https://people.com/thmb/AEfRNeQvxsJpcwxKtvwwwL2ULKE=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/chris-soules-02-435-1-ada7ea1ce26c4a258407ccf87e9b9c05.jpg", "https://people.com/thmb/54Eerd737fO4jNfMfwIHcUGdl0A=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/marcus-grodd-660-afa3d8f70249486d8a4e45e1b4adc281.jpg", "https://people.com/thmb/Vy-ALz3VQnZPAP1xpXr8gRw7b8o=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(899x159:901x161)/Michelle-Young-Nayte-Olukoya-1-464ac0d56283479e994cb06b9f07915d.jpg", "https://people.com/thmb/yR6RbbqpJeTiAyAq9bze6xWMSlw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/byron-velvick-435-d26365f1647740f88771498799ccdc8f.jpg", "https://people.com/thmb/KrlqRWqkBzHwBty39fxv90kKvaY=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(909x0:911x2)/bachelor-couples-still-together-3-2000-eecce15a8d3543bda22f435ef70130da.jpg", "https://people.com/thmb/eiTVco-SUo1KlTHrvTJqyBdfEBs=/1500x1000/filters:fill(auto,1)/SUSIE-CLAYTON-ECHARD17-0c8f13b7931c4de5a3b20f345c29a2cc.jpg", "https://people.com/thmb/2Onw_JH9wHenIXBmYIwZH2gfu-E=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/bachelore_bachelorette-2000-8fb12d99efb44ab5ab3ffc1fbd2eead6.jpg", "https://people.com/thmb/0nKWBaeA1iCBm0HUxilwDdMOkPk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(873x0:875x2)/bachelor-couples-still-together-5-2000-94f8d439ea25454e8da99c82b9fe95f4.jpg", "https://people.com/thmb/tP3tvmO2gMSqXDzEaR5DX-KF8cc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/gabby-erich-ring-0920-ab8d6104dcaf456dbcc6b1f35ff85344.jpg", "https://people.com/thmb/DV1iZ5ReBEaLpmZRSckxbslZZSo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/ashley-hebert-435-8-e4a499f2fbd8443dbc97aa574f5fe19f.jpg", "https://people.com/thmb/bo-s4qUxhBTIJ6c5Drw-4DniLUk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(246x0:248x2)/holly-durst-495-57f58cc8884e4c68b28ac89d9fd51517.jpg", "https://people.com/thmb/QBt8vVwJ5zR7ij1DVOFHdV_4aLQ=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/trista-rehn-660-1-084ac9ff933a491c9fe390fe1730588e.jpg", "https://people.com/thmb/-0vXllT4sAlouymXiPUXUF6ESeI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(399x0:401x2)/carly-evan-800-2-a9a1f48f5ab448e2948adfd2b61f8908.jpg", "https://people.com/thmb/2UNOZgOAl_qK9rdAFJLbkmgeITo=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Bachelor-in-Paradise-season-8-70-09062022-5409695246e84b59b6432849e6069473.jpg", "https://people.com/thmb/acvaINyYVfuc08dkTXuOcbsbRV4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(979x52:981x54)/Bachelor-1-a165d44b5504404891b7ad2791c7a5ae.jpg", "https://people.com/thmb/GhihEU_o2t5vBk-QAvw-3odXOpo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/josh-murray-435-1-8360496f65e14dba897dc8c3d24d6bb2.jpg", "https://people.com/thmb/K6pA6b1go-Rkxl83y3a4oQcYbOU=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/tolbert-wedding-8-435-34aa190d5aa444c18443cacaeff1ea5e.jpg", "https://people.com/thmb/Nzg4h7mlgEnJEC6k7GYAmx4AOzU=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/cody-sattler-660-9f6270074300468cadcfe33e614b4158.jpg", "https://people.com/thmb/VxgkHCWv7H66kRNOWGPu4vKpIE0=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/jillian-harris-435-3-1d75445e3e9a4b48b0a3d7862e6a1a56.jpg", "https://people.com/thmb/AVWoS60hLGXYNvyFg-lBOCUxVJw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/becca-kufrin2-2000-ed2b1111df7145689b7b0a18fd579bbb.jpg", "https://people.com/thmb/MdFavXBwqC5rpjwPGpQHMgBwWV4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/brad-womack-1-660-819505fb9b594012bc7eb28e1de3f4bc.jpg", "https://people.com/thmb/LghkTrWNcpmrVQg_gKJ2DRDjKo4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(246x0:248x2)/britt-01-495-06d84c0ae8804fb589e65efd564c1676.jpg", "https://people.com/thmb/DvVpf_kNZpO8n_KYfhkT6aotpZU=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(797x0:799x2)/tayshia-adams-john-paul-jones-2000-45f69e171d3d4a2baa46aa44f0105a47.jpg", "https://people.com/thmb/wZepP0Oi-HyDvXwnkE97HJWW59A=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(539x0:541x2)/demi-burnett-61355c00e1b2460d8c341abb999f1d16.jpg", "https://people.com/thmb/qBISS24WsxIqFP_sdSenZ59XXEk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/sean-lowe-435-11-01a1f89385e64857884759c8f3cac03b.jpg", "https://people.com/thmb/kJ_6Y5IFKzu1Rs_yeqqiy6TmP-A=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/aaron-buerge-435-322cf2e13e9d4cc2bad833fcebfbf6ff.jpg", "https://people.com/thmb/UvQ8mrvqX-RpS9kZbwfoTH61hY4=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/lorenzo-borghese-1-435-15c27fa5bb274a02a9d02dda78d4912e.jpg", "https://people.com/thmb/cDdB46k7JjG5mURbT31LpvQsT6w=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/SUSIE-CLAYTON-ECHARD15-f40003f6918c41cfa7106f31b0fd7134.jpg", "https://people.com/thmb/GncqwEN6BUMntmhQyv2VNrCkx44=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/jason-mesnick-1-435-c4bafbeaac004c88b6294c1579ee18c0.jpg", "https://people.com/thmb/pVuvAy1iq0He0Ll4k6zR87GHHSw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/nick-vanessa-bachelor-1-dc004a479c264c76b3c433b42a57c4db.jpg", "https://people.com/thmb/omEHRCZmpYJH56b4jAFjL7vagQY=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(399x0:401x2)/bachelor-engagements-800-1-4acacdf21c6a49ee8f5f98ab6dd0a8a9.jpg", "https://people.com/thmb/og6QlXj2m42kK8wEdSy3jtvOcrw=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/desiree-hartstock-660-2-dbaa9605cf0a4edbb518b29714cecaea.jpg", "https://people.com/thmb/Zm8x-BjlK9umy4hMNm5k9H4pTcQ=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(649x0:651x2)/kaitlyn-bristowe-7be79739c4a84cf8ae9cfd16af85084f.jpg", "https://people.com/thmb/03h0ISoLpRH9y4m2Q7RRS51d_ts=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(697x0:699x2)/bachelor-couples-still-together-2-2000-999fd7ad16e44388bdc67bac1e9fe9a1.jpg", "https://people.com/thmb/IKw21jWf7SqS6R_GscmGkznfS00=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/meredith-phillips-435-1-ba1aa98dcf2f420380f8ca049d09783f.jpg", "https://people.com/thmb/cRMAYXkBRmss2uhgNQx9GaKcR4s=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/bob-guiney-435-854174071ca644c8b34af0be375e96ff.jpg", "https://people.com/thmb/8MPhOopofc21U5fNZJU_7f7KOR4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(819x629:821x631)/michelle-young-nayte-olukoya-1-4432ecb6bea3447b84cdc4e8fac5dd1c.jpg", "https://people.com/thmb/wuECNcE7ZlX8Az3icSTSKgVERBQ=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(799x0:801x2)/sfsee-2000-8ab9dbc0b5c945b0ac29bba556f6d14f.jpg", "https://people.com/thmb/quy1L7bEKiG5HC4jOvD20lYFxhY=/75x75/filters:no_upscale():max_bytes(150000):strip_icc()/janine-henni-57d47b03f624493fb0e9843f319ac2c8.jpg", "https://people.com/thmb/zxh_m6cV7U6jPdlc684TSDQctVo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/the-bachelor-1-2-1-5c72e3b25fba42ef9933c8a9e6e9fdf9.jpg", "https://people.com/thmb/5BbxhtwRf8P6_YHp0-iJoklMIaU=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(216x0:218x2)/andi-dorfman-435-3-a73e2b8f63694d55baf9fe0dd97d3983.jpg"], "top_img": "https://people.com/thmb/eiTVco-SUo1KlTHrvTJqyBdfEBs=/1500x1000/filters:fill(auto,1)/SUSIE-CLAYTON-ECHARD17-0c8f13b7931c4de5a3b20f345c29a2cc.jpg", "keywords": [], "authors": ["Amanda Michelle Steiner", "Learn More"], "canonical_link": "https://people.com/tv/bachelor-and-bachelorette-couples-whos-still-together/", "title": "Bachelor and Bachelorette Couples Where Are They Now [PHOTOS]", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "For some Bachelor and Bachelorette couples, TV love was forever — but for the majority, it ended once the cameras stopped rolling. See how your favorites fared, from the most recent splits and successes to the very first hints of romance", "emailcontenttype": "LISTSC", "emailvertical": "PEOPLE", "sailthru.author": "Amanda Michelle Steiner", "article": {"section": "People", "opinion": "false", "author": "https://www.facebook.com/peoplemag"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "og": {"type": "article", "site_name": "Peoplemag", "url": "https://people.com/tv/bachelor-and-bachelorette-couples-whos-still-together/", "title": "Bachelor and Bachelorette Couples Where Are They Now [PHOTOS]", "description": "For some Bachelor and Bachelorette couples, TV love was forever — but for the majority, it ended once the cameras stopped rolling. See how your favorites fared, from the most recent splits and successes to the very first hints of romance", "image": "https://people.com/thmb/eiTVco-SUo1KlTHrvTJqyBdfEBs=/1500x1000/filters:fill(auto,1)/SUSIE-CLAYTON-ECHARD17-0c8f13b7931c4de5a3b20f345c29a2cc.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "Bachelor and Bachelorette Couples Where Are They Now [PHOTOS]", "description": "For some Bachelor and Bachelorette couples, TV love was forever — but for the majority, it ended once the cameras stopped rolling. See how your favorites fared, from the most recent splits and successes to the very first hints of romance", "image": "https://people.com/thmb/eiTVco-SUo1KlTHrvTJqyBdfEBs=/1500x1000/filters:fill(auto,1)/SUSIE-CLAYTON-ECHARD17-0c8f13b7931c4de5a3b20f345c29a2cc.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.19.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.19.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.19.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.19.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.19.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}