{"url": "https://www.hollywoodreporter.com/news/selena-gomez-tattoo-matching-semicolons-13-reasons-why-cast-992400", "text": "Selena Gomez has spoken at length about the personal significance of the new Netflix series 13 Reasons Why, which tells the story of the thirteen reasons why a bullied high school student commits suicide. Gomez, who, along with her mom, pushed for the series to be made, served as an executive producer on the show.\n\n“I would do anything to be able to have a good influence on this generation, but I definitely relate to everything that was going on,” said the 24-year-old during a Netflix press event in February. “I was there for the last episode, and I was a mess just seeing it all come to life, because I’ve experienced that.”\n\nNow, the story is getting even more personal for Gomez. Along with two of the show’s breakout stars, Tommy Dorfman (who plays Ryan Shaver) and Alisha Boe (Jessica Davis), the pop star got a semicolon tattoo over the weekend to represent Project Semicolon, a suicide prevention and mental health awareness organization. The symbolic punctuation represents the idea that when one thought ends, a new one begins — that “this is not the end but a new beginning.”\n\nThe trio showed off the matching ink on Instagram. “Project Semicolon is a movement dedicated to presenting hope for those suffering from depression, thoughts of suicide, addiction, and self-injury,” captioned Boe on her Instagram.\n\nDorfman also describes his own personal struggles with mental health in his past. “I struggled with addiction and depression issues through high school and early college,” he wrote alongside a photo of the gang’s matching tattoos. “I reached out and asked for help. At the time, I thought my life was over, I thought I’d never live past the age of 21. Today I’m grateful to be alive, in this new chapter of life in recovery, standing with my colleagues and friends, making art that helps other people.”", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2016/11/gettyimages-624757174-h2016.jpg?w=1296&h=730&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2016/11/gettyimages-624757174-h2016.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2016/11/gettyimages-624757174-h2016.jpg?w=1024", "keywords": [], "authors": ["Sam Reed"], "canonical_link": "https://www.hollywoodreporter.com/lifestyle/style/selena-gomez-tattoo-matching-semicolons-13-reasons-why-cast-992400/", "title": "Selena Gomez and ’13 Reasons Why’ Castmates Got Matching Tattoos", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "For a good cause.", "news_keywords": "Style News", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Sam Reed", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 992400, "title": "Selena Gomez and '13 Reasons Why' Castmates Got Matching Tattoos", "published_at": "2017-04-10 10:01:24", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2016/11/gettyimages-624757174-h2016.jpg?w=1024", "comment_count": 0, "tags": "Style News", "topics": "Style", "body": "Selena Gomez has spoken at length about the personal significance of the new Netflix series 13 Reasons Why, which tells the story of the thirteen reasons why a bullied high school student commits suicide. Gomez, who, along with her mom, pushed for the series to be made, served as an executive producer on the show.\r\n\"I would do anything to be able to have a good influence on this generation, but I definitely relate to everything that was going on,\" said the 24-year-old during a Netflix press event in February. \"I was there for the last episode, and I was a mess just seeing it all come to life, because I've experienced that.\"\r\n\r\nNow, the story is getting even more personal for Gomez. Along with two of the show's breakout stars, Tommy Dorfman (who plays Ryan Shaver) and Alisha Boe (Jessica Davis), the pop star got a semicolon tattoo over the weekend to represent Project Semicolon, a suicide prevention and mental health awareness organization. The symbolic punctuation represents the idea that when one thought ends, a new one begins — that \"this is not the end but a new beginning.\"\r\n\r\n\t\r\n\t\t\r\n\t\t\t\r\n\t\t\t\t \r\n\t\t\r\n\t\tI have received so much love and support from all of you who are watching 13 Reasons Why. Today- Tommy, Selena and I got tattoos of a semicolon. Project semicolon is a movement dedicated to presenting hope for those suffering from depression, thoughts of suicide, addiction, and self-injury. Those of you watching 13 Reasons Why and identify with Hannah Baker, please check out Beyond The Reasons on netflix, or check out the link in my bio. Rest In Peace Amy Bluel, who started this movement. Love you all (thx @ktal77 and @joymaryro for the inspo)\r\n\t\tA post shared by Boezo (@alishaboe) on Apr 9, 2017 at 6:54pm PDT\r\n\t\r\n\r\nThe trio showed off the matching ink on Instagram. \"Project Semicolon is a movement dedicated to presenting hope for those suffering from depression, thoughts of suicide, addiction, and self-injury,\" captioned Boe on her Instagram.\r\nDorfman also describes his own personal struggles with mental health in his past. \"I struggled with addiction and depression issues through high school and early college,\" he wrote alongside a photo of the gang's matching tattoos. \"I reached out and asked for help. At the time, I thought my life was over, I thought I'd never live past the age of 21. Today I'm grateful to be alive, in this new chapter of life in recovery, standing with my colleagues and friends, making art that helps other people.\"\r\n\r\n\t\r\n\t\t\r\n\t\t\t\r\n\t\t\t\t \r\n\t\t\r\n\t\tToday was a magical day. Another day to be grateful to be alive. Alisha, Selena, and I went together to get ; tattoos. The ; symbol stands for an end of one thought and a beginning of another. Instead of a period, authors use the semicolon to continue a sentence. For us, it means a beginning of another chapter in life, in lieu of ending your life. I struggled with addiction and depression issues through high school and early college. I reached out and asked for help. At the time, I thought my life was over, I thought I'd never live past the age of 21. Today I'm grateful to be alive, in this new chapter of life in recovery, standing with my colleagues and friends, making art that helps other people. If you're struggling, if you feel suicidal, I urge you to click the link in my bio. Ask for help. Start a new chapter with the support of others. and RIP Amy Bleul, who started the semicolon movement.\r\n\t\tA post shared by TOMMY DORFMAN (@tommy.dorfman) on Apr 9, 2017 at 7:16pm PDT", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Selena Gomez and ’13 Reasons Why’ Castmates Got Matching Tattoos", "url": "https://www.hollywoodreporter.com/lifestyle/style/selena-gomez-tattoo-matching-semicolons-13-reasons-why-cast-992400/", "description": "For a good cause.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2016/11/gettyimages-624757174-h2016.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-04-10T10:01:24+00:00", "modified_time": "2017-04-11T09:23:47+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Selena Gomez and ’13 Reasons Why’ Castmates Got Matching Tattoos", "description": "For a good cause.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2016/11/gettyimages-624757174-h2016.jpg?w=1296"}}, "movies": [], "publish_date": 1491818484.0, "source": "https://www.hollywoodreporter.com", "summary": ""}