{"url": "https://en.wikipedia.org/wiki/Survivor:_Ghost_Island", "text": "No.\n\noverall No. in\n\nseason Title CBS recap Rating/share\n\n(18-49 Original air date US viewers\n\n(millions) Weekly\n\nrank\n\nHost Jeff Probst explained the Ghost Island premise to the 20 new castaways upon their arrival, saying that they had a chance to reverse the curse of bad Survivor decisions if they were to visit Ghost Island. Jeff instructed each tribe to choose a leader: Malolo selected Brendan, while Chris volunteered for Naviti. Jeff also told the castaways they would only start with a machete, pot, a fishing kit, and a smaller supply of rice. Reward Challenge: A designated runner will have to race through a series of obstacles to dig up three sets of keys. Then, a designated puzzle solver will use the keys to unlock a slide puzzle. The first person to finish their puzzle wins a massive shelter building kit reward for their tribe. Additionally, the losing tribe will be forced to forfeit their fishing kit. However, if the tribe leader decides to forfeit the challenge during the puzzle solving portion, their tribe will get to keep the fishing kit, but the opposing tribe will get 20 eggs and flint in addition to the shelter building kit. For Malolo and Naviti, respectively, Michael and Sebastian were selected to run the course, while Laurel and Desiree were selected for the puzzle. Chris pulled the lever on Desiree, preserving Naviti’s fishing kit, but giving the larger reward to Malolo. As the Malolo tribe set up their shelter and got to know each other, Jacob openly stated his intention to search for a hidden immunity idol, causing his tribemates to distrust him. He also poured some of the tribe’s rice in his dirty sock to see if a clue was hidden in the jar, though there was not. Meanwhile, at the Naviti camp, a power struggle started between Chris and Domenick, who questioned Chris’s decision to forfeit the opening challenge. Immunity Challenge: Each tribe will have to race across a net bridge to where two bags are hanging. Working together, they will then need to untie the bags to obtain a pair of ropes. Using the ropes, the tribe will need to slide a sled full of big puzzle pieces through a course. At the end of the course, they will need to solve a cube puzzle to win immunity. Naviti won the challenge, and also received a flint reward, as Malolo already had flint after winning the first reward challenge. For winning the immunity challenge, Naviti had to send one person from Malolo to Ghost Island, where they would be immune from the vote; Naviti sent Jacob after he declared Malolo was the best tribe in Survivor history. On Ghost Island, Jacob had to break an urn to play a game for an advantage; if he lost, he would have to forfeit his vote at the next Tribal Council. He subsequently won a game of chance which gave him Sierra’s legacy advantage from Game Changers. He had to will it to someone from Naviti, and he chose Morgan. He also made a fake idol. At Malolo, the tribe had to come up with a new plan, as Jacob was their intended target. Gonzalez rallied votes against Donathan for being the tribe’s weakest link, but at Tribal Council, her paranoia got the better of her as she whispered to her tribemates, asking who they were targeting that night. Although everyone told her they were targeting Donathan, it was revealed that they had lied to her, and Gonzalez was unanimously blindsided, becoming the first person voted out. At Naviti, Domenick searched for a hidden immunity idol in the middle of the night, which he eventually found; it was revealed to be Andrea’s idol from Caramoan. The next morning, he attempted to bury the hatchet with Chris, but the tension still lingered between the two. Domenick told Chris he found an idol moments after telling him the opposite, which caused Chris to distrust him. At Malolo, Jacob kept the legacy advantage information to himself and told his tribemates he found an idol on Ghost Island, but that he had left the paper behind, making Brendan suspicious. Reward/Immunity Challenge: Two pairs from each tribe will race through a series of obstacles in the water. They will then have to dive to release two sets of buoys. Another member will need to gather all of the marked buoys to the finish, where the last four members will need to get all eight in a basket to win immunity and a comfort reward of chairs, pillows, blankets, and a washboard. Naviti easily won after James could not even dive a foot in the water. Donathan panicked before eventually diving down and releasing the buoys for Malolo. Naviti sent Donathan to Ghost Island, and the urn he smashed was a dud. At Malolo, Stephanie considered working with Jacob to blindside Michael, but Jacob spilled the beans about the legacy advantage to Stephanie. At Tribal Council, Libby and Michael voted against James in case Jacob did indeed have a real idol, but ultimately, the tribe stuck to the original plan, sending Jacob out of the game.\n\n528 2 \"Only Time Will Tell\" Recap 1.7/7[8] March 7, 2018 ( ) 8.23[8] 14[9]\n\nThe morning after Jacob's elimination, Jeff announced a tribe swap. The new Malolo tribe consisted of Bradley, Brendan, Chelsea, Desiree, Jenna, Kellyn, Michael, Sebastian, and Stephanie. The new Naviti tribe consisted of Angela, Chris, Domenick, Donathan, James, Laurel, Libby, Morgan, and Wendell. At the new Naviti tribe, Chris tried to rally votes against Domenick, but his attitude set Angela and Libby off. Morgan was suspicious of Chris, and she and Libby aligned. At the new Malolo tribe, Bradley's complaining over Malolo's shelter got on some people's nerves, while Michael and Brendan found one of James's idols from China. Reward/Immunity Challenge: Castaways will need to jump between three sets of raised ramps to a sand pit, where they will need to dig out a heavy ladder. Using the ladder, one tribe member will need to retrieve a monkey’s fist on top of a tripod, which they will use to climb the first ramp of the tower. The tribe will then need to hoist each other to the top of a second ramp, where two members will need to solve a tiki head puzzle to win immunity and a tarp. Malolo won the challenge; after they couldn't decide who from Naviti to send to Ghost Island, the Naviti members drew rocks to determine who would go. Chris drew the odd-colored rock, foiling Domenick's plan to blindside him. On Ghost Island, the urn Chris smashed was empty, and he opened up about his mother's struggle with multiple sclerosis. At Naviti, Angela wanted to stay strong with her old tribe members and vote out Libby, but Wendell saw Angela as Chris's \"right-hand man\", and started to rally votes against her. Meanwhile, Domenick showed his fake idol to the former Malolo members to build trust with them, but James didn't believe him and, seeing an opportunity to control the vote as Naviti was set to turn on Angela, pitched an idea to the other former Malolo members to vote out Morgan, which Libby objected to. However, at Tribal Council, Libby reluctantly sided with the majority, sending a shocked Morgan out of the game. Before her exit, Morgan willed the legacy advantage to Domenick.\n\n529 3 \"Trust Your Gut\" N/A 1.7/7[10] March 14, 2018 ( ) 8.39[10] 11[11]\n\nWhile attempting to regroup after Morgan's blindside, Domenick told Wendell he found a real idol. The next morning, he found the legacy advantage willed to him by Morgan. Reward Challenge: Two members of each tribe will start at their tribe flags on shore. Once told, they will need to make their way out into the water to get a ring. At least one castaway must be touching both the ring and their tribe's flagpole simultaneously to score a point for their tribe. The first tribe to score three points wins a feast of peanut butter and jelly sandwiches with ice cold milk. Before the challenge, Jeff revealed that someone would visit Ghost Island and return before the immunity challenge, meaning they would also be vulnerable if their tribe were to visit Tribal Council. Naviti won the challenge and immediately chose to have Malolo draw rocks; Kellyn was sent to Ghost Island immediately after she explained that being separated was her worst Survivor fear. Although the urn she smashed allowed her to play the game of chance, she decided not to risk losing her vote. At Naviti, a confused and angry Chris learned from Angela about Domenick's alliance's betrayal; they planned on aligning with the former Malolo members, but Donathan talked to Wendell about working together and Laurel talked to Domenick, who revealed his idol to her. Immunity Challenge: Castaways will have to swim out to a bamboo cage, hop over and dive in the cage to release a door underwater. They will then need to take a chest in the cage ashore, and race it across a track. On the track, tribes will need to use a grappling hook to connect a missing piece of the track allowing them to get the chest to a perch. Using the balls in the chest, they will need to get all five of them on top of a narrow perch to win immunity. Although Malolo had a huge lead through the chest-carrying stage, Naviti pulled off a massive comeback and edged out Malolo during the ball-tossing stage to win immunity, largely thanks to Chris's efforts. Stephanie was put off by Bradley's arrogant attitude and was even more offended when Bradley flat-out told her there was no hope for her alliance. The Naviti majority wanted to weaken the other alliance and Chelsea proposed voting out Michael or Brendan; the Naviti alliance proceeded to debate on which of the two to vote out. Michael revealed his idol to Stephanie and Jenna, which gave the alliance hope. At Tribal Council, Brendan declared Sebastian and Chelsea to be on the bottom of an alliance led by Bradley, and Michael encouraged them to flip after he pulled out his idol, falsely calling it a double immunity idol in an attempt to throw the opposing alliance off their game. Before the votes were read, Michael played his idol for Stephanie, but the Naviti majority voted against Brendan instead, sending him out of the game.\n\n530 4 \"A Diamond in the Rough\" N/A 1.8/7[12] March 21, 2018 ( ) 8.61[12] 6[13]\n\nAfter Tribal Council, Michael apologized to the Naviti alliance if they felt offended by his gameplay, and he was upset with himself about making the wrong decision over whom to play the idol for. Reward Challenge: Tribes will need to hop over a series of tables to a pile of large sandbags. They will then need to search through the sandbags to find a lever. Pulling the lever will release sixty smaller sandbags, which tribes will collect and use to hit a target that spins, raising a flag. The first tribe to raise all three flag wins coffee and pastries. Chris led Naviti to an easy victory. The tribe instantly decided to go to rocks to determine who from Malolo would go to Ghost Island. Stephanie was sent to Ghost Island; her urn was empty. At Naviti, Chris and Donathan bonded over having to take care of their families. Immunity Challenge: Starting on the beach, one runner from each tribe will grab a boogie board attached to a large spool of rope and race across a series of floating balance beams to a set of four satchels with numbered tiles. Grabbing only one satchel, the runner will get on the boogie board in the water, where their tribemates will have to reel them onto shore. Once the runner returns to shore, another person goes out. Once they have all four satchels, tribes will make their way to the finish deck, where they will used the numbered tiles to solve a combination lock, obtaining a key, which unlocks the tribe's sliding puzzle. The first tribe to finish their puzzle wins immunity. Naviti won immunity yet again. The Naviti majority debated on who to vote out; they decided that Jenna was an easy, safe vote, but Michael was the biggest threat. Jenna flirted with Sebastian to save herself, while Michael pled his case to Bradley, saying they needed him for the challenges. Desiree searched Stephanie's bag for an advantage and didn't find one. At Tribal Council, each of the original Malolo members pled their case, and Stephanie was unanimously voted out.\n\n531 5 \"Fate is the Homie\" N/A 1.7/7[14] March 28, 2018 ( ) 8.15[14] 15[15]\n\nOn Day 15, Jeff announced another tribe swap. The new Malolo tribe consisted of Angela, Desiree, James, Kellyn, and Michael. The new Naviti tribe consisted of Bradley, Chelsea, Domenick, Donathan, and Libby. A third tribe, Yanuya, consisted of Chris, Jenna, Laurel, Sebastian, and Wendell. On the newly formed Yanuya tribe, Chris's ego rubbed his new tribemates, especially Laurel, the wrong way. On the new Malolo tribe, Angela was still angry from her old tribemates' betrayal; she and James proceeded to inform their new tribemates about the cracks in the old Naviti tribe. Meanwhile, James was wary of Michael, as Michael had voted against him at Malolo's second Tribal Council. On the new Naviti tribe, Domenick immediately didn't trust Libby and voiced his concerns to Bradley. Immunity Challenge: One person from each tribe will be a caller, while the rest of the tribe is blindfolded. The caller, using only verbal commands, will need to lead their tribemates to three bags of puzzle pieces. Once they have all three bags, the caller will have two members of their tribe solve the puzzle, while blindfolded. The first two tribes to solve the puzzle win immunity. Wendell forgot one of Yanuya's bags, but he made up for the deficit, leading his tribe from last to first place, and Naviti placed second. Desiree was upset with herself over her poor leadership in the challenge, but Kellyn suggested to her and Angela that they vote out James, who later tried to bring Angela to his side. After a talk with Angela, Kellyn was skeptical of Angela's loyalty, but at Tribal Council, Angela stayed loyal and Michael joined the former Naviti members in blindsiding James out of the game.\n\n532 6 \"Gotta Risk it For the Biscuit\" N/A 1.7/7[16] April 4, 2018 ( ) 8.42[16] 11[17]\n\nAt Malolo, knowing he was the sole outsider, Michael searched for a hidden immunity idol. He managed to find Ozzy's fake idol from Micronesia, now a real idol. Reward Challenge: All members of the tribe will have to pull on rope on a balance beam to suspend a disc. They will have to stack blocks spelling \"REWARD\" on the disc with a skull on the top and another on the bottom, while pulling on the rope. If anybody falls off their balance beam or their block stack falls, they must start over. The first two tribes to finish their stack win; first place gets a grill, steaks, chicken kabobs, and spices. Second place gets chicken kabobs. Malolo lost yet another challenge. For placing first, Naviti had the power to send someone from either Yanuya or Malolo to Ghost Island; they unanimously decided to send Kellyn, since she had been there before. On Ghost Island, Kellyn was again given a game of chance to play. She was to pick from three urns instead of two; two held advantages, while one would cost her vote at the next Tribal Council. She won the vote stealer from Game Changers that Michaela failed to find, now downgraded to only an extra vote. At Naviti, Bradley's condescending attitude towards Donathan and Domenick rubbed them the wrong way. At Yanuya, Wendell took advantage of an opportunity to look for an idol while his tribemates were asleep. He spotted a unique tree and discovered a map to a hidden immunity idol at its base, which he then found. The idol was revealed to be the immunity necklace that Erik gave to Natalie in Micronesia. At Malolo, the tribe burned their flag's banner under Desiree's lead to reverse the curse of their losing streak. Immunity Challenge: Contestants must swim to a floating platform, run up it and jump off into the water. They must collect a set of floating rings and bring them back. Three people must swim over to a platform with the rings, and then toss the rings on to a floating target. The first two tribes to toss all their rings onto the target win immunity. Yanuya placed first and Malolo finally ended their losing streak, sending Naviti to Tribal Council. Bradley targeted Libby, but Chelsea talked to Libby about voting out Bradley. She and Domenick were later torn between voting out Libby or Bradley, but ultimately, they decided to unanimously vote Bradley out.\n\n533 7 \"Fear Keeps You Sharp\" N/A 1.6/7[18] April 11, 2018 ( ) 7.97[18] 10[19]\n\nOn Day 20, the three tribes merged on Naviti's beach. Although the Naviti members initially planned on picking off the Malolo members, Chris and Domenick were still at odds; Wendell tried to play moderator, to no avail. Jenna and Libby considered whether to side with Chris or Domenick. Chris found a note randomly placed in his buff, which led him to find a clue in tree mail, saying the idol was on Ghost Island; he would travel there late that night while everyone else was asleep. He found J.T.'s Game Changers idol in plain sight, but it was only good at the next Tribal Council. However, a game of chance allowed him to extend the life of the idol for up to 5 extra Tribal Councils; there were 10 chests to choose from. He extended the idol once, but lost his vote at the next Tribal Council. Immunity Challenge: Castaways must hold a boom pole over their head with a tiki statue at the end, while standing on a narrow perch. Every few minutes, the castaways will step forward. If they fall off the perch or their tiki statue drops, they are out of the challenge. The last person standing wins. Kellyn outlasted Libby to win immunity. Back at camp, Chris gathered everyone except Domenick and Wendell in an attempt to dictate a split vote between those two in case Domenick played his idol. While they were alone, Wendell told Domenick about his idol. Donathan immediately told them about Chris's plan to split the votes, while Desiree gathered the Naviti women to discuss a blindside of Libby, since everyone might be voting for either Chris, Domenick, or Wendell. At Tribal Council, Domenick openly wore his fake idol, then played the Legacy Advantage on himself, while Chris decided not to play his idol. Desiree and Angela voted against Libby, but everyone else voted against Chris, making him the first member of the jury.\n\n534 8 \"The Sea Slug Slugger\" N/A 1.6/7[20] April 18, 2018 ( ) 7.73[20] 12[21]\n\nAfter Tribal Council, Libby was concerned as to why she received votes again, while Wendell told Laurel about his idol, making her wary of his power in the game. Reward Challenge: Divided into two teams of six via schoolyard pick, castaways will have to race across a floating balance beam to shore. Once they are ashore, they will need to use a slingshot to knock over six blocks on a perch using sandbags, with each member being required to launch at least once, then return to the beginning of the balance beam, where someone else goes out. The first team to knock all six blocks over win a feast of tacos, burritos, quesadillas, and margaritas. The team of Angela, Chelsea, Donathan, Laurel, Libby, and Wendell won reward. They immediately had the others draw rocks for Ghost Island, with Jenna getting exiled; her urn was empty. While on reward, Libby asked why she received votes, and Angela said the others were wary of her bond with Michael. Back at camp, Michael talked to Angela about blindsiding Wendell. However, after Michael told her she was the only person left out of the loop on the last vote, Angela wanted to \"stir the pot\" and lied to her old Naviti tribemates about Michael saying that Kellyn and Chelsea didn't trust Angela, planning to target him. Immunity Challenge: Castaways would have to eat exotic dishes and show their empty tongues to finish, in which a certain number of fastest finishers would advance to the next round. The castaway that finishes all stages wins immunity. Angela defeated Michael in the final round to win immunity. Angela's allies tried to sway Donathan to their side with an idea to split the vote between Michael and Libby. Michael pitched to the other former Malolo members to vote out Wendell, while Domenick assured Libby she was safe. Wanting to make a move and even the playing field, Donathan told Libby of Naviti's plan to split the vote between her and Michael, making Libby unsure of whom to trust. At Tribal Council, the Malolo plan fell through as they joined the original Navitis in splitting the vote against Libby and Michael. Michael played his idol, negating seven votes, sending Libby to the jury with four votes.\n\n535 9 \"It's Like the Perfect Crime\" N/A 1.6/7[22] April 25, 2018 ( ) 7.81[22] 9[23]\n\nThe morning after Libby's elimination, Desiree plotted with the old Malolo members to bring in Chelsea and Angela to overthrow the Naviti majority because she felt like she was on the bottom, but Laurel was skeptical. Reward Challenge: Divided into two teams of five via schoolyard pick, two members of each team will start in a canoe in the water, while the remaining three members are locked in a cage on a floating platform. The two paddlers will have to rescue their teammates, each of whom has a key. Once all three caged members are rescued, they will return to shore. Using the keys the teams have collected, they will unlock a large circus net that is holding puzzle pieces. They will have to carry the puzzle pieces to a frame, where they will solve the puzzle. The first team to finish their puzzle wins a helicopter flight to a bluff overlooking the islands and a picnic lunch. Since Donathan was not picked, he had no shot at reward but was ineligible for Ghost Island. The team of Chelsea, Jenna, Kellyn, Michael, and Sebastian won the challenge; Angela got sent to Ghost Island via rock draw. While on reward, Michael told Chelsea, Kellyn, and Sebastian he was willing to work with them as an extra number, but Kellyn wanted to stay strong with Naviti and pick off the Malolo members. On Ghost Island, Angela played the game of chance but lost her vote after choosing the wrong chest. At camp, Laurel told Domenick about Desiree potentially turning on them, and Domenick told Kellyn, who was shocked. Michael started searching for an idol, and Donathan joined him, eventually finding Scot's idol from Kaôh Rōng. It was powerless unless Tai's matching idol from the same season, which was hidden under the shelter, completed the idol. After a while, Donathan found the second half of the idol but was forced to tell the other old Malolo members about it as several tribemates shuffled in and out of camp. Immunity Challenge: The players will balance a ball on a disc attached to two ropes they must hold up. The last person standing with the ball still on the disc wins immunity. Chelsea won immunity. Kellyn confronted Desiree and Chelsea about them wanting to turn on her, prompting Desiree to chew out Laurel in front of everyone else. Desiree adamantly tried to convince Kellyn she was loyal, while Domenick suggested a strong guy's alliance with Michael, to Kellyn's chagrin. At Tribal Council, Desiree and Laurel reignited their argument, but while Chelsea joined Desiree in voting against Michael, the rest of the tribe sent Desiree to the jury.\n\n536 10 \"The Finish Line Is In Sight\" N/A 1.5/7[24] May 2, 2018 ( ) 7.84[24] 14[25]\n\nAfter Tribal Council, Domenick expressed his gratitude toward Laurel for saving him, Wendell, and Kellyn, but Kellyn still wanted to pick off the old Malolo members. Meanwhile, Chelsea felt she was in danger since she had been blindsided by the previous vote. Domenick also considered turning against Wendell before looking for an idol. He found the fake idol Jay played in Millennials vs. Gen X, which still had no power, but Domenick had the opportunity to trick the other players with it. Before the challenge, Jeff announced a random draw of two \"tribes\" for that day only, each of which would go to Tribal Council, meaning two people would be eliminated that night and Ghost Island was not in play. Immunity Challenge: Castaways must pull up on a bar to keep a ball wedged between a set of jaws. If they release the bar, the lower jaw will fall, causing their ball to fall out. Once their ball falls, they are out. The last person remaining from each team wins immunity. Additionally, the last person left standing overall allows their team to view the results of first team's Tribal Council and vote second. Orange consisted of Domenick, Kellyn, Laurel, Michael, and Wendell, while Purple consisted of Angela, Chelsea, Donathan, Jenna, and Sebastian. Chelsea won immunity for Purple, but immediately dropped out before Domenick outlasted Wendell for the other immunity necklace and the right for Orange to visit Tribal Council last. Back at camp, Michael asked to borrow Donathan's idol, but Donathan immediately refused. To save himself, Michael told Kellyn he had an idol and would definitely play it. Kellyn bought Michael's ploy and told Domenick, who didn't believe it. She then told Chelsea and Wendell, and planned on using her extra vote to vote against Laurel twice, but Wendell considered turning on Kellyn to save Laurel. Meanwhile, Sebastian, Chelsea, and Angela planned on voting against Jenna, but they told her they would vote against Donathan. A paranoid Jenna tried to trick Donathan into playing his idol for her instead of himself at Purple's Tribal Council, while Donathan targeted Sebastian. At Purple's Tribal Council, Donathan played his idol on himself, negating Jenna's vote against him, and the Naviti members sent Jenna to the jury. At Orange's Tribal Council, Kellyn used her extra vote, creating a 2-2 tie between Laurel and Michael; on the revote, Michael was unanimously sent to the jury.\n\n537 11 \"A Giant Game of Bumper Cars\" N/A 1.5/7[26] May 9, 2018 ( ) 7.74[26] 13[27]\n\nBack at camp, Kellyn revealed to the others that she used her extra vote against Laurel, after being pressed by Domenick about there being six votes at a five-person Tribal Council. At the reward challenge, the castaways were reunited with their loved ones: Wendell's father Wendell I, Kellyn's brother Klay, Donathan's aunt Patty, Angela's daughter Paige, Chelsea's sister Sydney, Laurel's brother Frank, Sebastian's sister Grace, and Domenick's wife Kristin. Reward Challenge: While racing across a series of obstacles, castaways must untie and grab a sandbag. They will then attempt to throw that sandbag on a narrow table. The first castaway to get their sandbag on their table wins a feast of ribs, chicken, burgers, pastries, and ice cream with their loved one. Sebastian won reward and chose to share it with Domenick, Wendell, Donathan and their loved ones. Sebastian also had to send one of the other four to Ghost Island where an advantage will be available off the bat, unless he or one of the other reward participants volunteers to give up their reward. Wendell volunteered, and he received Malcolm's final immunity challenge advantage from Philippines. On reward, Domenick tried to align with Donathan and Sebastian, but Donathan was wary. At camp, Kellyn was bitter about not getting chosen for reward or for the advantage on Ghost Island; she and Angela plotted a girls' alliance out of revenge. Laurel weighed the pros and cons of turning on Domenick and Wendell. Immunity Challenge: Each castaway must balance a small metal ball on a wooden cylinder, while holding the center cylinder in place with two wooden handles. After a certain amount of time, new pieces of the wooden rod will be added, making it harder to balance the ball on the center cylinder. The castaway who balances their ball the longest wins immunity. Domenick won immunity. He and Wendell planned on bringing in Laurel to blindside Chelsea for being a physical threat, while the women wanted to bring in Donathan to blindside Wendell, who Chelsea felt was the biggest threat in the game. Donathan and Laurel privately weighed their options; Donathan was antsy to make a move, but Laurel wanted to stay true to her alliance with Domenick and Wendell. At Tribal Council, Donathan revealed there were cracks in the Naviti alliance, putting his tribemates on edge. In the end, Donathan and Laurel voted against Chelsea, sending her to the jury.\n\n538 12 \"Always Be Moving\" N/A 1.5/6[28] May 16, 2018 ( ) 7.54[28] 11[29]\n\nAfter Chelsea's elimination, Donathan approached Kellyn with a plan to turn against Domenick and Wendell. Reward Challenge: The castaways will be divided into three teams of two, where they will place a wooden spool onto a track which will roll to the bottom of the structure where one castaway will grab it and place it back onto the track. At regular intervals, more spools will be added, making it more difficult. If a spool drops, they're out of the challenge. Last team left standing wins the right to deliver supplies to a local Fijian school on Yanuya along with a meal of fried chicken and chocolate cake. Domenick and Wendell won reward; they chose Laurel to join them and sent Sebastian to Ghost Island. There was a 3 in 4 chance of getting an advantage, and Sebastian won Kellyn's misplayed extra vote that came back into play. While on reward, Laurel was secretly ready to turn on Domenick and Wendell. Back at camp, Donathan told Wendell he would cast his jury vote for Domenick over him, in hopes that they would turn on each other, but they saw through the plan. Immunity Challenge: Castaways will have to race out to two sets of tied planks, and use them to create a bridge to cross. Once they've crossed their bridge, castaways will have to complete two sets of ladders to climb a tower. At the top of the tower, they will then solve a slide puzzle. The first person to finish their puzzle wins immunity. Wendell finished the puzzle first, but Laurel called Jeff's name first; by that rule, Laurel won immunity. She wanted to stick with Domenick and Wendell out of gratitude, and the three of them targeted Kellyn. However, a paranoid Donathan asked Domenick and Wendell if they were going to blindside him, making them reconsider their plans. Donathan then caught Domenick rummaging through his bag and giving Wendell something, prompting him to go back to Kellyn. Domenick, Wendell, Sebastian, and Angela debated on whether to vote out Donathan or Kellyn at the hammock. At Tribal Council, Donathan's paranoia took over, and an argument ensued between him and Wendell, as Domenick urged everyone else to stick to the \"hammock plan.\" The vote was initially tied between Donathan and Kellyn, but Kellyn was sent to the jury on the revote.\n\n539 13 \"It Is Game Time Kids\" N/A 1.4/6[30] May 23, 2018 ( ) 7.31[30] 7[31]\n\nThe final 6 returned to camp, where Sebastian secretly plotted on making a move against Domenick and Wendell, who in turn targeted him for his likeability. Reward/Immunity Challenge: Castaways must race through a large skull-shaped maze to collect three sets of bags. Once they collect all three bags, they must use the puzzle pieces to finish a vertical puzzle. The first castaway to finish their puzzle wins immunity and a steak dinner with baked potato, bread, and dessert. Wendell won immunity and chose to share reward with Sebastian and Angela. This upset Laurel, who voiced her anger to Domenick. Sebastian told Donathan and Angela he would use his extra vote to blindside Domenick, but Angela told Domenick, who considered playing his idol. Meanwhile, Donathan told Laurel about Sebastian's plan. At Tribal Council, Domenick outed Sebastian's extra vote and revealed his two idols, saying both were real when, in reality, one is fake. Wendell then pulled out his idol and offered to work with Donathan, who refused. Domenick presented the fake idol to Jeff before the votes were cast and chose not to play his real idol, and he was successful in fooling his tribemates. Sebastian didn't use his extra vote and was sent to the jury. Immunity Challenge: Castaways will swim out to a platform, then cross a series of obstacles, collecting two sets of puzzle pieces. Using the puzzle pieces, castaways must finish a four-piece pyramid puzzle. The first castaway to finish their puzzle wins. Wendell won immunity again. Donathan told Domenick he'd take him to the end after getting asked, while Wendell considered giving his idol to Angela, Donathan, or Laurel, but he and Domenick realized Laurel was their biggest threat in immunity challenges. At Tribal Council, Domenick played his idol on himself, while Wendell played his idol for Laurel, negating one vote against her. Ultimately, Donathan was unanimously sent to the jury. Immunity Challenge: While standing on a wobbly beam, castaways must use a long fork to stack six sets of balls between stands on a free-standing structure. The first castaway to complete their stack wins. Everyone dropped their stack at least once, but Domenick managed to win his third immunity challenge, as well as the right to choose who to take to the end with him. The final 4 ventured to Ghost Island, where Laurel tried to convince Domenick that she wouldn't beat Wendell in the fire-making challenge. Angela tried to convince Domenick that Laurel was a bigger threat in the Final Tribal Council. A note told Domenick to choose one of three voting urns to be used at the Final Tribal Council, all of which were cursed due to a contestant taking the wrong person to the end; the urns were from The Australian Outback, Game Changers, and Cagayan. He chose the Cagayan urn. He also privately considered giving his immunity necklace to Angela and taking on Wendell himself in the fire-making challenge. However, he chose to keep immunity and brought Laurel to the end; Wendell won the fire-making challenge, making Angela the 10th member of the jury. During the Final Tribal Council discussion, Laurel was largely ignored by the jury, who saw her as riding Domenick and Wendell's coattails when she could’ve made a move to blindside them. Meanwhile, Domenick was reprimanded for his actions at the Tribal Council where Sebastian was voted out. Much of the jury tried to figure out whether Domenick or Wendell were primarily responsible for controlling their alliance's moves. The jury went to vote, and Jeff surprised everyone by saying he would read the votes right then at the Final Tribal Council. For the first time in Survivor history, the vote was tied; Domenick and Wendell each had five votes. Jeff confirmed that Laurel would cast the winning vote as the 11th and final jury member.\n\n540 14 \"Reunion Special\" N/A 0.8/3[30] May 23, 2018 ( ) 4.62[30] 23[31]", "images": ["https://upload.wikimedia.org/wikipedia/en/1/15/Survivor_ghost_island_season_thirty-six_region_1_dvd.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/f/fb/Yes_check.svg/13px-Yes_check.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/15/Survivor_ghost_island_season_thirty-six_region_1_dvd.png/220px-Survivor_ghost_island_season_thirty-six_region_1_dvd.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/1/15/Survivor_ghost_island_season_thirty-six_region_1_dvd.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Survivor:_Ghost_Island", "title": "Survivor: Ghost Island", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/1/15/Survivor_ghost_island_season_thirty-six_region_1_dvd.png", "width": 640, "height": 910}, "title": "Survivor: Ghost Island - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}