{"url": "https://deadline.com/2017/10/disney-channel-andi-mack-character-come-out-gay-1202194584/", "text": "In a first for Disney Channel, a key character on its popular tween series Andi Mack will realize he’s gay and come out to his friends.\n\nThe story arc will mark the channel’s first depiction of a coming-out journey. The character – 13-year-old Cyrus Goodman, played by 15-year-old Joshua Rush – will begin his self-discovery in this Friday’s second season one-hour premiere episode.\n\n“Andi Mack is a story about ‘tweens’ figuring out who they are,” said Disney Channel in a statement. “(Creator) Terri Minsky, the cast and everyone involved in the show takes great care in ensuring that it’s appropriate for all audiences and sends a powerful message about inclusion and respect for humanity.”\n\nThe Walt Disney Co. released a general statement on stories and characters, which reads, in part, “Disney remains committed to continuing to create characters that are accessible and relatable to all children.” (Read that entire statement below.)\n\nThe coming-of-age series, starring Peyton Elizabeth Lee as the 13-year-old title character, premiered in March, becoming the top series of the year among girls (median age is 10) and #1 in its time period among all children ages six-14. It holds the top series spot on Disney Channel VOD, Disney Channel’s DisneyNOW app and on Disney Channel UK.\n\nThe series, launching on Disney Channels around the world through mid-2018, was created by executive producer Minsky (Lizzie McGuire), and follows Andi as she comes to terms with news that Bex, the girl she thought was her older sister, is actually her mother.\n\nWith a realism not always evident on tween-focused programs, Andi Mack follows Andi, her family and her two best friends – Cyrus Goodman and Buffy Driscoll (Sofia Wylie) – as they navigate their lives.\n\nThe new season finds Andi hoping that her parents Bex (Lilan Bowden) and Bowie (Trent Garrett) will marry, while she also attempts to hash out her feelings for longtime crush Jonah Beck (Asher Angel).\n\nBut it’s another storyline that’s breaking Disney Channel ground: Cyrus begins to realize that he too has feelings for Jonah, a development that begins what a source describes as a journey to self-acceptance.\n\nIn the season premiere, Cyrus confides his feelings to a supportive Buffy, a scene intended to provide positive role models for children – and adults – watching.\n\nSubsequent episodes will follow Cyrus’ ongoing story, which will include wrestling with how to tell his new girlfriend Iris.\n\nWe hear Minsky and Disney Channel, to ensure the story arc is age-appropriate and respectful, consulted with child development experts and was screened to organizations including GLAAD, PFLAG, The National Campaign to Prevent Teen and Unplanned Pregnancy, and Common Sense Media.\n\nThe groups are effusive in their approval of the storyline:\n\n“With more and more young people coming out as LGBTQ, Andi Mack is reflecting the lives and lived experiences of so many LGBTQ youth around the country,” said Sarah Kate Ellis, President and CEO of GLAAD. “Television reflects the real life world and today that includes LGBTQ youth who deserve to see their lives depicted on their favorite shows. Disney has been a leader in LGBTQ inclusion and there are so many young people who will be excited to see Cyrus’ story unfold.”\n\nJaime M. Grant, Executive Director, PFLAG National, said, “Sharing one’s innermost self can be challenging, and to do so as an adolescent can be particularly so, especially when in the midst of figuring it out for yourself. Coming out requires honest self-reflection, no small amount of bravery, and a safe place with at least one trusted person – a friend, a parent, a teacher – who can hold your confidence…and your heart. Andi Mack’s creative team captures this moment of revelation with such thought, care, and authenticity; it will be a memory moment for some, and a teachable moment for many.”\n\nSaid Ginny Ehrlich, CEO, The National Campaign to Prevent Teen and Unplanned Pregnancy: “Starting conversations about trust, love, relationships and family dynamics is easier when a favorite TV show like Andi Mack explores them with humor and heart, and helps viewers figure out how they might handle similar situations. Andi Mack gives young people and their parents, mentors and champions a meaningful way to talk about these topics and the power to decide their futures.”\n\nThe second season of Andi Mack premieres Friday, October 27 at 8 pm ET/PT on Disney Channel. Minsky exec-produces along with Michelle Manning. Phil Baker is the co-executive producer, and Horizon Productions is the production company.\n\nHere is the Walt Disney Co. general statement on its stories and characters:", "images": ["https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://deadline.com/wp-content/uploads/2017/10/147909_1974.jpg?w=1024", "https://deadline.com/wp-content/uploads/2017/10/image0012.png", "https://deadline.com/wp-content/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://deadline.com/wp-content/uploads/2017/10/147909_1974.jpg?w=681&h=383&crop=1", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1"], "top_img": "https://deadline.com/wp-content/uploads/2017/10/147909_1974.jpg?w=1024", "keywords": [], "authors": ["Greg Evans"], "canonical_link": "https://deadline.com/2017/10/disney-channel-andi-mack-character-come-out-gay-1202194584/", "title": "‘Andi Mack’ Character To Come Out As Gay: A Disney Channel First", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "In a first for Disney Channel, a key character on its popular tween series Andi Mack will realize he's gay and come out to his friends. The story arc will mark the channel's first depiction of a coming-out journey.", "news_keywords": "Andi Mack, Disney Channel", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=533209613", "generator": "WordPress 6.0.2", "author": "Greg Evans", "theme-color": "#fff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Deadline", "application-name": "Deadline", "content_type": "Article", "post_id": 1202194584, "title": "'Andi Mack' Character To Come Out As Gay: A Disney Channel First", "published_at": "2017-10-25 15:00:27", "image": "https://deadline.com/wp-content/uploads/2017/10/147909_1974.jpg?w=296&h=166&crop=1", "comment_count": 205, "tags": "Disney Channel", "topics": "TV", "body": "In a first for Disney Channel, a key character on its popular tween series Andi Mack will realize he's gay and come out to his friends.\r\n\r\nThe story arc will mark the channel's first depiction of a coming-out journey. The character - 13-year-old Cyrus Goodman, played by 15-year-old Joshua Rush - will begin his self-discovery in this Friday's second season one-hour premiere episode.\r\n\r\n\"Andi Mack is a story about 'tweens' figuring out who they are,\" said Disney Channel in a statement. \"(Creator) Terri Minsky, the cast and everyone involved in the show takes great care in ensuring that it's appropriate for all audiences and sends a powerful message about inclusion and respect for humanity.\"\r\n\r\nThe Walt Disney Co. released a general statement on stories and characters, which reads, in part, \"Disney remains committed to continuing to create characters that are accessible and relatable to all children.\" (Read that entire statement below.)\r\n\r\nThe coming-of-age series, starring Peyton Elizabeth Lee as the 13-year-old title character, premiered in March, becoming the top series of the year among girls (median age is 10) and #1 in its time period among all children ages six-14. It holds the top series spot on Disney Channel VOD, Disney Channel's DisneyNOW app and on Disney Channel UK.\r\n\r\nThe series, launching on Disney Channels around the world through mid-2018, was created by executive producer Minsky (Lizzie McGuire), and follows Andi as she comes to terms with news that Bex, the girl she thought was her older sister, is actually her mother.\r\n\r\nWith a realism not always evident on tween-focused programs, Andi Mack follows Andi, her family and her two best friends - Cyrus Goodman and Buffy Driscoll (Sofia Wylie) - as they navigate their lives.\r\n\r\nThe new season finds Andi hoping that her parents Bex (Lilan Bowden) and Bowie (Trent Garrett) will marry, while she also attempts to hash out her feelings for longtime crush Jonah Beck (Asher Angel).\r\n\r\nBut it's another storyline that's breaking Disney Channel ground: Cyrus begins to realize that he too has feelings for Jonah, a development that begins what a source describes as a journey to self-acceptance.\r\n\r\nIn the season premiere, Cyrus confides his feelings to a supportive Buffy, a scene intended to provide positive role models for children - and adults - watching.\r\n\r\nSubsequent episodes will follow Cyrus' ongoing story, which will include wrestling with how to tell his new girlfriend Iris.\r\n\r\nWe hear Minsky and Disney Channel, to ensure the story arc is age-appropriate and respectful, consulted with child development experts and was screened to organizations including GLAAD, PFLAG, The National Campaign to Prevent Teen and Unplanned Pregnancy, and Common Sense Media.\r\n\r\nThe groups are effusive in their approval of the storyline:\r\n\r\n\"With more and more young people coming out as LGBTQ, Andi Mack is reflecting the lives and lived experiences of so many LGBTQ youth around the country,\" said Sarah Kate Ellis, President and CEO of GLAAD. \"Television reflects the real life world and today that includes LGBTQ youth who deserve to see their lives depicted on their favorite shows. Disney has been a leader in LGBTQ inclusion and there are so many young people who will be excited to see Cyrus' story unfold.\"\r\n\r\nJaime M. Grant, Executive Director, PFLAG National, said, \"Sharing one's innermost self can be challenging, and to do so as an adolescent can be particularly so, especially when in the midst of figuring it out for yourself. Coming out requires honest self-reflection, no small amount of bravery, and a safe place with at least one trusted person - a friend, a parent, a teacher - who can hold your confidence...and your heart. Andi Mack's creative team captures this moment of revelation with such thought, care, and authenticity; it will be a memory moment for some, and a teachable moment for many.\"\r\n\r\nSaid Ginny Ehrlich, CEO, The National Campaign to Prevent Teen and Unplanned Pregnancy: \"Starting conversations about trust, love, relationships and family dynamics is easier when a favorite TV show like Andi Mack explores them with humor and heart, and helps viewers figure out how they might handle similar situations. Andi Mack gives young people and their parents, mentors and champions a meaningful way to talk about these topics and the power to decide their futures.\"\r\n\r\nThe second season of Andi Mack premieres Friday, October 27 at 8 pm ET/PT on Disney Channel. Minsky exec-produces along with Michelle Manning. Phil Baker is the co-executive producer, and Horizon Productions is the production company.\r\n\r\nHere is the Walt Disney Co. general statement on its stories and characters:", "fb": {"pages": 105558754896}, "onesignal": "wordpress-plugin", "fragment": "!", "og": {"type": "article", "title": "‘Andi Mack’ Character To Come Out As Gay: A Disney Channel First", "url": "https://deadline.com/2017/10/disney-channel-andi-mack-character-come-out-gay-1202194584/", "description": "In a first for Disney Channel, a key character on its popular tween series Andi Mack will realize he’s gay and come out to his friends. The story arc will mark the channel’s first depic…", "site_name": "Deadline", "image": {"identifier": "https://deadline.com/wp-content/uploads/2017/10/147909_1974.jpg?w=1024", "width": 1024, "height": 836, "alt": "Andi Mack"}, "locale": "en_US"}, "article": {"published_time": "2017-10-25T22:00:27+00:00", "modified_time": "2017-10-25T22:00:29+00:00"}, "twitter": {"site": "@DEADLINE", "creator": "@GregEvans5", "card": "summary_large_image", "title": "‘Andi Mack’ Character To Come Out As Gay: A Disney Channel First", "description": "In a first for Disney Channel, a key character on its popular tween series Andi Mack will realize he’s gay and come out to his friends. The story arc will mark the channel’s first depic…", "image": "https://deadline.com/wp-content/uploads/2017/10/147909_1974.jpg?w=1024"}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1508968827.0, "source": "https://deadline.com", "summary": ""}