{"url": "https://www.usatoday.com/story/life/2018/03/27/walmart-remove-cosmopolitan-magazine-checkout-lines-amid-me-too-movement/462328002/", "text": "Walmart to remove 'Cosmopolitan' from checkout lines, says it's a 'business decision'\n\nShow Caption Hide Caption Walmart pulls Cosmopolitan magazine from checkout lines amid concerns Walmart is moving Cosmopolitan magazine from the checkout aisle after concerns were raised about the content. Elizabeth Keatinge (@elizkeatinge) has more. Buzz60\n\nWalmart is moving Cosmopolitan to a less uptown locale.\n\nThe retail giant will remove the women's fashion magazine from checkout lines at 5,000 stores across the country.\n\nIn a statement shared with USA TODAY, Walmart spokesperson Meggan Kring said: “As with all products in our store, we continue to evaluate our assortment and make changes. Walmart will continue to offer Cosmopolitan to customers that wish to purchase the magazine, but it will no longer be located in the checkout aisles. While this was primarily a business decision, the concerns raised were heard.”\n\nThe news was shared Tuesday via a press release from National Center on Sexual Exploitation (NCOSE), an organization that says it helped instigate the policy change.\n\n\"You can go through and buy your groceries with your family knowing you don't have to be exposed to this graphic and often degrading and offensive material,\" NCOSE Vice President of Advocacy and Outreach Haley Halverson said in a Facebook live session Tuesday. \"Instead, all of these magazines will be moved, in isolation, to the magazine racks.\"\n\nA Cosmopolitan spokesperson told the Associated Press Wednesday that the magazine is \"proud of all that the brand has achieved for women around the world.\"\n\nCosmo began running frank content about sex under the direction of editor Helen Gurley Brown in 1965. Brown transformed the once family-oriented magazine into a publication for single women that — along with topics on relationships, beauty, fashion and health — still publishes advice and discussions on sex.\n\nThe NCOSE, which changed its name from Morality in Media in 2015, has been working to cover or remove Cosmo from store shelves for years, deeming it porn. In 2015, the group was behind a successful push to place the magazine behind blinders in stores owned by Rite Aid and Delhaize America (which owns Hannaford Stores and Food Lion).\n\nThe organization has also been a strong Playboy opposer. Patrick Trueman, president of NCOSE, called Hugh Hefner \"a pioneer in the sexual objectification and use of women\" following his death in September, saying the Playboy founder left behind \"a legacy of sexual exploitation and public health harms.\"\n\nThe Walton family, heirs to Walmart founder Sam Walton, have traditionally donated more to Republicans, and have had a conservative reputation, though the company dropped out of conservative advocacy group American Legislative Council in 2012.\n\nWalmart's decision comes amid the Me Too movement and a national reckoning on sexual harassment, according to Halverson.\n\n\"This is one less drop of hyper-sexualized media that is going to be bombarding people in their everyday lives, which does make a difference, especially in this Me Too culture that we're living in, where we really want a culture that will respect women and ensure their dignity is understood,\" Halverson said.\n\nThe Me Too movement, however, has focused on sexual harassment and assault rather than pornography. It gained momentum in October as bombshell reports from The New York Times and The New Yorker detailed decades of alleged sexual harassment and assault by producer Harvey Weinstein. Allegations against dozens of men in positions of power emerged in following weeks, and celebrities and non-celebrities alike flooded social media platforms with the hashtag #MeToo with their own stories of harassment, highlighting the depth of the problem.\n\nUSA TODAY's exclusive industry-wide survey revealed 94% of women say they have experienced some form of sexual harassment or assault over the course of their careers in the entertainment industry.\n\nIn a statement to USA TODAY Wednesday, Halverson says NCOSE hopes other major retailers follow Walmart's example.\n\n\"We are not expressly calling for any boycotts, but we are asking Target and Walgreens to follow Walmart's example and also remove Cosmo from their checkout aisles,\" she wrote.\n\nThe Cosmo ban has caused debate on social media, with some praising Walmart's decision and others saying the company missed the point of the Me Too movement.\n\nMany thanks @Walmart for removing @Cosmopolitan from your checkout aisles - the magazine objectifies women. Chipping away at the harmful messages that #YOUTH will see in the checkout aisle. — Mary McClusky (@MMcClusky) March 27, 2018\n\n\"Many thanks Walmart for removing Cosmopolitan from your checkout aisles - the magazine objectifies women. Chipping away at the harmful messages that #YOUTH will see in the checkout aisle,\" one Twitter user wrote.\n\nI am so grateful to @Walmart for having Cosmo-free checkout aisles! Cosmo magazine is verbally pornographic, and degrading to women. I can finally be shop without being unwillingly exposed to this content! #ThanksWalmart\n\nClick To Tweet — Lisa Mladinich (@lisamladinich) March 27, 2018\n\n\"I am so grateful to Walmart for having Cosmo-free checkout aisles! Cosmo magazine is verbally pornographic, and degrading to women. I can finally be shop without being unwillingly exposed to this content!\" another wrote.\n\nI don’t agree with @walmart using the #metoo movement to pull the mag, really bad timing & poor excuse. But honestly, Cosmo should’ve been pulled years ago. The topics & pics on the covers are inappropriate for children’s eyes. I won’t miss seeing it in line. — Anna just Anna (@atheniangal1) March 28, 2018\n\n\"I don’t agree with (Walmart) using the #metoo movement to pull the mag, really bad timing & poor excuse. But honestly, Cosmo should’ve been pulled years ago. The topics & pics on the covers are inappropriate for children’s eyes. I won’t miss seeing it in line,\" another shared.\n\nThe argument that hiding Cosmo from Walmart shoppers will foster a “culture that will respect women and ensure their dignity is understood” is absolutely infuriating. Sexuality ≠ exploitation https://t.co/3kUG9czzUL — Ashley Spencer (@AshleyySpencer) March 27, 2018\n\n\"The argument that hiding Cosmo from Walmart shoppers will foster a 'culture that will respect women and ensure their dignity is understood' is absolutely infuriating. Sexuality ≠ exploitation,\" one user tweeted.\n\nI have always thought of @Cosmopolitan as empowering, not exploitative. https://t.co/EoG2PK7a3x — Jeffrey Guterman (@JeffreyGuterman) March 28, 2018\n\n\"I have always thought of (Cosmopolitan) as empowering, not exploitative,\" another shared.\n\nThe grossest thing is how these folks are blatantly distorting what the #MeToo movement is about to justify pushing Cosmo off of Walmart checkout shelves. https://t.co/YRn8mEBNWH — Lily Herman (@lkherman) March 28, 2018\n\n\"The grossest thing is how these folks are blatantly distorting what the #MeToo movement is about to justify pushing Cosmo off of Walmart checkout shelves,\" another wrote.", "images": ["https://www.gannett-cdn.com/-mm-/af349039cd34d23cf34f7ca9ffdea1619710c026/c=0-0-2949-1666/local/-/media/2016/01/23/USATODAY/usatsports/cosmo-sept-14-cover-lucy-hale.jpg?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://media.gannett-cdn.com/29906170001/29906170001_5759718998001_5759711929001-vs.jpg?pubId=29906170001"], "top_img": "https://www.gannett-cdn.com/-mm-/af349039cd34d23cf34f7ca9ffdea1619710c026/c=0-0-2949-1666/local/-/media/2016/01/23/USATODAY/usatsports/cosmo-sept-14-cover-lucy-hale.jpg?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Sara M Moniuszko"], "canonical_link": "https://www.usatoday.com/story/life/2018/03/27/walmart-remove-cosmopolitan-magazine-checkout-lines-amid-me-too-movement/462328002/", "title": "Walmart to remove 'Cosmopolitan' from checkout lines, says it's a 'business decision'", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/2018/03/27/walmart-remove-cosmopolitan-magazine-checkout-lines-amid-me-too-movement/462328002/life", "theme-color": "#ffffff", "og": {"type": "article", "title": "Walmart to remove 'Cosmopolitan' from checkout lines, says it's a 'business decision'", "description": "Retail giant\\u00a0Walmart will remove the women's fashion magazine 'Cosmo' from checkout lines at 5,000 stores across the country.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/af349039cd34d23cf34f7ca9ffdea1619710c026/c=0-0-2949-1666/local/-/media/2016/01/23/USATODAY/usatsports/cosmo-sept-14-cover-lucy-hale.jpg?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "Retail giant\\u00a0Walmart will remove the women's fashion magazine 'Cosmo' from checkout lines at 5,000 stores across the country.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1522105200.0, "source": "https://www.usatoday.com", "summary": ""}