{"url": "http://pr.nba.com/anthony-anderson-host-2018-nba-awards/", "text": "Turner and the NBA announced today that comedy and sports will collide as Anthony Anderson will take the helm as host for the 2018 NBA Awards on TNT presented by Kia airing Monday, June 25, with coverage beginning at 9 p.m. ET. This year’s event – presented live from historic Barker Hangar in Santa Monica, Calif. – will honor all of the league’s top performers from the 2017-18 NBA season including the exclusive unveiling of the Kia NBA MVP, Kia NBA Defensive Player of the Year, Kia NBA Rookie of the Year and Lifetime Achievement Award, among others.\n\nAnderson’s multi-faceted, award-winning career spans roles across film and television including the award-nominated sitcom black-ish, the game show To Tell the Truth, Barbershop: the Next Cut and Law & Order: Special Victims Unit,among others.\n\nThe second annual NBA Awards on TNT presented by Kia will feature current and former NBA players, coaches, musical performances and celebrity presenters throughout the evening. Additionally, the Sports Emmy Award-winning Inside the NBA studio team of Ernie Johnson, Charles Barkley, Kenny Smith and Shaquille O’Neal will be integrated throughout the show. Additional details will be announced at a later date.\n\nThe NBA Awards on TNT presented by Kia, created by Turner Sports and the NBA, is produced by dick clark productions.\n\nAbout Anthony Anderson\n\nAnderson is an actor, comedian, writer, producer and host who currently stars and executive produces the hit show “black-ish” as well as produces the spinoff “grown-ish.” Anderson has received three consecutive “Outstanding Lead Actor in a Comedy Series” Emmy nominations, two Golden Globe nominations and three Critics Choice nominations for his popular role in “black-ish.” Additionally, in 2018, he won his fourth individual Image Award in the category of “Outstanding Actor in a Comedy Series.” This past year, Anderson appeared in three films, the Sundance-darling indie film “Small Town Crime,” Sony’s “The Star,” and Fox’s Academy Award nominated “Ferdinand” and hosted the second season of the ABC game show “To Tell the Truth.”\n\nAbout Turner Sports\n\nTurner Sports, a division of Turner, is an industry leader in the delivery of premium sports content across all multimedia screens. Turner Sports’ television coverage includes the NBA, Major League Baseball, NCAA Division I Men’s Basketball Championship, ELEAGUE and professional golf, along with the UEFA Champions League and UEFA Europa League beginning in Summer 2018. The company also manages some of the most popular sports destinations across digital and social platforms including Bleacher Report and its top-rated app, NCAA.com and the critically-acclaimed NCAA March Madness Live suite of products, PGA.com and the Sports Emmy Award-winning PGA Championship LIVE, as well as an accompanying collection of mobile sites and connected device apps. Turner Sports and the NBA jointly manage NBA Digital, a robust collection of offerings including NBA TV, NBA.com, NBA LEAGUE PASS, the NBA App and NBAGLEAGUE.com. Turner Sports recently launched B/R Live, a premium live streaming sports platform that serves as the central hub for both the discovery and consumption of live sports content. The new streaming service allows fans to find and watch their favorite sports content anywhere, anytime and on the screen of their choice.\n\nAbout dick clark productions\n\ndick clark productions (dcp) is the world’s largest producer and proprietor of televised live event entertainment programming with the “Academy of Country Music Awards,” “American Music Awards,” “Billboard Music Awards,” “Golden Globe Awards,” “Dick Clark’s New Year’s Rockin’ Eve with Ryan Seacrest” and the “Streamy Awards.” Weekly television programming includes “So You Think You Can Dance” from 19 Entertainment and dcp. dcp also owns one of the world’s most unique and extensive entertainment archive libraries with over 60 years of award-winning shows, historic programs, specials, performances and legendary programming. dcp is a division of Valence Media, a diversified media company with divisions and strategic investments in premium television, wide release film, specialty film, live events and digital media. For additional information, visit www.dickclark.com.", "images": [], "top_img": "", "keywords": [], "authors": [], "canonical_link": "https://pr.nba.com/anthony-anderson-host-2018-nba-awards/", "title": "Anthony Anderson to host 2018 NBA Awards", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Turner and the NBA announced today that comedy and sports will collide as Anthony Anderson will take the helm as host for the 2018 NBA Awards on TNT presented by Kia airing Monday, June 25, with coverage beginning at 9 p.m. ET.", "og": {"locale": "en_US", "type": "article", "title": "Anthony Anderson to host 2018 NBA Awards - NBA.com: NBA Communications", "description": "Turner and the NBA announced today that comedy and sports will collide as Anthony Anderson will take the helm as host for the 2018 NBA Awards on TNT presented by Kia airing Monday, June 25, with coverage beginning at 9 p.m. ET.", "url": "https://pr.nba.com/anthony-anderson-host-2018-nba-awards/", "site_name": "NBA.com: NBA Communications"}, "article": {"published_time": "2018-05-30T14:00:18+00:00", "modified_time": "2018-06-06T14:02:07+00:00"}, "twitter": {"card": "summary", "label1": "Written by", "data1": "Brad Weinstein", "label2": "Est. reading time", "data2": "3 minutes"}}, "movies": [], "publish_date": 1527688818.0, "source": "http://pr.nba.com", "summary": ""}