{"url": "https://web.archive.org/web/20220817194039/https://www.newsobserver.com/living/fashion/article10135037.html", "text": "Gwyneth Paltrow began Goop in 2008 as an aspirational – and controversial – lifestyle wellness-blog-cum-travel-and-cooking-tip-sheet-cum-shopping blog when her children were young. Although for years Goop was a lighting rod for derisive attacks on privileged celebrities, it has also emerged as an unlikely model for career development among a certain swathe of Hollywood. NYT\n\nGwyneth Paltrow, the 42-year-old Oscar-winner, conscious-uncoupler and Tracy Anderson devotee, is changing.\n\nPaltrow is in a backroom of a glass-walled apartment (not her own) high over East End Avenue, with striking views of Gracie Mansion and the East River, shedding one outfit – black leather trousers, black cashmere shell, a black biker jacket – and donning another.\n\nShe is not alone; with her is Lisa Gersh, the 55-year-old owner of said apartment, a founder of Oxygen Media, the former chief executive of Martha Stewart Living Omnimedia, Tracy Anderson devotee and, as of last month, CEO of Goop, the aspirational – and controversial – lifestyle wellness-blog-cum-travel-and-cooking-tip-sheet-cum-shopping website Paltrow founded in 2008, and which Paltrow says she likes to think of as “contextual commerce.”\n\nBoth women are getting Gooped-up.\n\nWhen they emerge, Paltrow is wearing a gray boy-cut jacket with gold buttons (Goop collaboration with Band of Outsiders, 2013) and cropped gray trousers (ditto); Gersh, a black tailored jacket (Goop collaboration with Stella McCartney, 2013) and leather trousers (Goop collaboration with Mackage, 2014). They are ready for their close-up.\n\nCelebrity commerce\n\nThough for years Goop was a lightning rod for derisive attacks on privileged and tone-deaf celebrities or a “pleasingly wiggy” (in the words of The London Times) guilty pleasure, depending on your point of view, it has also emerged as an unlikely model for career development among a certain swathe of Hollywood.\n\n“The other day Drew Barrymore and I were talking, and she said, ‘Thank you for going first and getting all the scratches,’ ” Paltrow said, noting that Barrymore had started a cosmetic line, Flower, in 2012. This was not long after Jessica Alba created her site, the Honest Co., to offer natural baby products and diapers; which was only a few years before Blake Lively founded Preserve, a made-in-America crafty vision; and Ellen DeGeneres introduced her E.D. brand, an ambitious project that bowed on QVC last month with holiday home wares and will expand next year into numerous product categories, as well as a website and bricks and mortar retail; and Reese Witherspoon announced that she was starting Draper James, a lifestyle brand, due in 2015.\n\nSo if Paltrow and Gersh think it’s time to stake their claims and raise the ante – well, it’s understandable.\n\n“Celebrities are increasingly moving from endorsing products to being the product,” said John Demsey, group president of Estée Lauder. “This is only going to get more common.”\n\nThe question is why, and whether it will last.\n\nLucrative role for actresses\n\n“It’s like heroin,” said Graydon Carter, editor of Vanity Fair and host of the New Establishment Summit. “You get on Twitter, and then you are dispensing advice about face cream to 500 followers, and the next thing you know you are a lifestyle guru.”\n\n“It’s really part of a continuum,” said Demsey, who traces the phenomenon back to the first half of the 20th century with Helena Rubinstein and Estée Lauder, women who sold their products by painting them in the colors of their own glamorous lifestyles. It moved on through the age of the model-as-spokeswoman (Cindy Crawford, Kathy Ireland); reached its apogee in the form of Martha Stewart; was adapted by reality TV stars, chefs and athletes to their own ends; and finally made the leap to actors, spurred on by the changing economics of Hollywood, the rise of social media and the ease of setting up a business online.\n\n“Actors are not making anywhere as much money as they used to,” Carter said. “Hollywood is not making the kinds of movies that require gifted performers. They are making the kind of tent pole movies that require rippling abs, and women as extras. So you have to make up that income somehow.”\n\nBuying a lifestyle\n\nBut what, exactly, is someone buying when they buy into Goop or Preserve? Besides a monogrammable wooden longboard ($495, Goop) or a custom-made geometric print Pendleton wool “trail trench cloak” ($1,350, Preserve), that is.\n\n“A set of values that are associated with Gwyneth,” said Gersh, looking pointedly at the subject, who was sitting kitty-corner to her at her kitchen table, just past the breakfast bar with its basket of healthy snacks, as a case in point.\n\nAdvice and approval, according to Christopher Burch, the entrepreneur co-founder of Tory Burch, among other retail brands, and now DeGeneres’ partner in E.D. “I think most people consider Ellen their buddy or girlfriend, and if your buddy says to you, ‘You would look really good in this,' you usually think, ‘Well, OK,'” he said.\n\nIn the case of Goop, that advice comes in the form of weekly newsletters, which feature such musings as “we’re on an unquenchable quest to experience every type of modality to help us heal, expand and deepen our understanding of all life’s mysteries” (by way of introducing a psychic they had discovered, as well as poking some fun at themselves), and suggestions for where to eat or stay while traveling, including a Los Angeles restaurant with a “pint-sized protein plate.” (Paltrow does not write these but does oversee the choice of subject matter and approves a final edit.)\n\nMaking money, giving back\n\nBeyond their famous founders, all the brands share certain characteristics: an element of e-commerce, a focus on giving back (Preserve donates 5 percent of every sale in its Taste, Style and Home sections to Covenant House; Goop directs subscribers to the Edible Schoolyard Project and Pencils of Promises, among other nonprofits), and the involvement of serious corporate retail. The managing partner of E.D., for example, is Marisa Gardini, former chief executive of Isaac Mizrahi, while Witherspoon hired Andrea Hyde, former president of C. Wonder (another Burch brand) as her CEO.\n\nNot surprisingly, social media has played a crucial role in building the businesses, with new followers daily. Paltrow has 2.03 million followers on Twitter and 541,745 on Instagram; Alba, some 7.72 million Twitter followers and 4,151,783 Instagram; Lively, 120,000 on Twitter and 790,883 on Instagram, and counting. Every one of those followers is a potential customer.\n\n“You have to constantly catch people’s attention, whether it’s with a new hairstyle or a new boyfriend, but it’s risky to put yourself out there so much,” said the designer and director Tom Ford. “If people get to know you too closely, they might realize you are just like them, and not as exciting as they thought.”\n\nExposure and criticism\n\nOverexposure can erode mystique, which is a crucial part of movie star appeal. Paltrow’s public discourse, while keeping her in the public eye at a time when she cut down her movie commitments to “about once a year,” has also attracted its share of vocal critics.\n\nRecently she took to Goop to defend statements she had made about the attractions of working a 9-to-5 job that had provoked a firestorm of ire and that she believed had been misrepresented. “I am constantly perplexed and amazed by how little slack we cut each other as women,” she wrote.\n\nThen there is the taint of commercialism associated with salesmanship, a potential risk for anyone associated with an “artistic” career. Paltrow said this did not concern her because “every Oscar winner has a cosmetics contract” (this is not entirely true: while Sandra Bullock, Natalie Portman, Reese Witherspoon and Kate Winslet have all embraced the brand ambassador age, Meryl Streep, at least, has stayed away). But “it does impact the way people perceive you,” Kamins said.\n\nToo accessible?\n\n“The greatest asset in the world is unavailability,” Carter said. Indeed, it is notable that the actors on New York magazine’s “100 most valuable stars in Hollywood” list are almost all famed for their privacy, be they George Clooney or Angelina Jolie. (Witherspoon is the only lifestyle-brand-in-waiting name to make the list, at No. 48). By contrast, Lively used her website to gazump all gossip sites by announcing her pregnancy, while Paltrow notoriously revealed that she and her husband at the time, Chris Martin, were separating on Goop.\n\n“This is a short game,” Carter said. “The Internet allowed it to happen, but it may not be the best thing to have happened.”\n\n“It’s possible we will all be sitting around in 10 years and saying, ‘Hey, remember that moment everyone had a clothing line and a blog?'” Ford said. “The truth is, no one really knows where this will go.”\n\nPaltrow and Gersh, however, have an idea.\n\n“World domination!” Gersh laughed. Next to her, Paltrow let loose a nervous giggle and flicked her hair. She may have been imagining the headline the next day. Gersh, however, looked unabashed. It is, after all, what she has been hired to do.\n\nGrowing, but not profitable\n\nWhen Paltrow started the site, she envisioned it as a clearinghouse for friends to enjoy her recipe and travel recommendations, she said, and “never thought it would be a commercial venture.” She added: “It was a place to have some freedom” while she was spending more time at home with her children.\n\nIt was Juliet de Baubigny of the venture capital firm Kleiner Perkins Caufield Byers (famed for its investments in Facebook, Groupon and Spotify, among other companies), who suggested Paltrow think about turning Goop into a business, introducing her to her first chief executive, Seb Bishop (he left by mutual agreement when Paltrow decided to move the business with her to Los Angeles). The learning curve, she said, “has been enormous.”\n\nThe company is growing– it has 15 employees, nine in New York (where the corporate side is based) and six in Los Angeles (creative) – but the Manhattan office is still a shared WeWork space. And while Alba’s Honest Co. recently raised $70 million and is already talking about an initial public offering, Goop is still in “investment phase,” business-speak for losing money.\n\nCreative content\n\nBetween the heightened competition and the expansion plans, it’s hard not to wonder if Paltrow considers herself primarily an actor or a businesswoman. “I don’t like to think I have to be one thing or the other,” she said, looking out over the East River at the sunset. Gersh shakes her head and joined in.\n\n“You know,” she said, “lots of people have multiple careers. I was a lawyer, and then one day someone called and the next thing I knew I was in TV – ”\n\n“People like to classify you, and when you start pushing out of your box it makes them nervous,” Paltrow said. “There’s a lot of resistance to women coming to the table with anything new. But if it were Justin Timberlake or Jay Z or even Donald Trump, everyone would be like, ‘OK.’ ”\n\nShe thought for a moment. “If I had to say something, I would say I am a generator of creative content,” she said. Gersh nodded approvingly.", "images": ["https://web.archive.org/web/20220817194039im_/https://www.newsobserver.com/wps/build/images/newsobserver/favicon-32.png", "https://web.archive.org/web/20220817194039im_/https://www.heraldsun.com/wps/build/images/heraldsun/square-icon.svg", "https://web.archive.org/web/20220817194039im_/https://www.newsobserver.com/latest-news/s2zq6h/picture7602728/alternates/LANDSCAPE_1140/l4uRs.So.156.jpeg", "https://web.archive.org/web/20220817194039im_/https://www.newsobserver.com/akam/13/pixel_22944449?a=dD1jYTkyNTU0MjEzODk5MTI4Y2M5M2UwMjhjNDE5M2JiNDViZTY5NDgxJmpzPW9mZg==", "https://web.archive.org/web/20220817194039im_/https://www.newsobserver.com/wps/build/images/newsobserver/favicon-96.png", "https://web.archive.org/web/20220817194039im_/https://www.heraldsun.com/wps/build/images/heraldsun/logo-tab.svg", "https://web.archive.org/web/20220817194039im_/https://www.newsobserver.com/wps/build/images/newsobserver/logo.svg"], "top_img": "https://web.archive.org/web/20220817194039im_/https://www.newsobserver.com/latest-news/s2zq6h/picture7602728/alternates/LANDSCAPE_1140/l4uRs.So.156.jpeg", "keywords": [], "authors": ["Vanessa Friedman", "- New York Times News Service", "Scott Greenstone", "The Seattle Times"], "canonical_link": "https://web.archive.org/web/20220817194039/https://www.newsobserver.com/living/fashion/article10135037.html", "title": "The Goop Effect: Gwyneth Paltrow a role model in celebrity commerce", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "msapplication-TileColor": "#FFFFFF", "msapplication-TileImage": "https://www.newsobserver.com/wps/build/images/newsobserver/windowsmetro-144.png", "apple-itunes-app": "app-id=399175255, affiliate-data=at=1010lHsN&ct=SmartAppBannerRAL, app-argument=https://www.newsobserver.com/living/fashion/article10135037.html?appNav=smartBanner", "google-site-verification": "0GF1Ok35O1TQ_B8R4lQYz4N1nBr-YJflnAXsHV8ePEo", "googlebot": "noodp, noarchive", "robots": "noindex", "twitter": {"card": "summary_large_image", "site": "@newsobserver", "title": "The Goop Effect: Gwyneth Paltrow a role model in celebrity commerce", "description": "Gwyneth Paltrow, the 42-year-old Oscar-winner, conscious-uncoupler and Tracy Anderson devotee, is changing.", "image": {"identifier": "https://web.archive.org/web/20220817194039im_/https://www.newsobserver.com/latest-news/s2zq6h/picture7602728/alternates/LANDSCAPE_1140/l4uRs.So.156.jpeg", "alt": "Gwyneth Paltrow began Goop in 2008 as an aspirational – and controversial – lifestyle wellness-blog-cum-travel-and-cooking-tip-sheet-cum-shopping blog when her children were young. Although for years Goop was a lighting rod for derisive attacks on privileged celebrities, it has also emerged as an unlikely model for career development among a certain swathe of Hollywood."}}, "og": {"site_name": "Raleigh News & Observer", "type": "article", "title": "The Goop Effect: Gwyneth Paltrow a role model in celebrity commerce", "url": "https://web.archive.org/web/20220817194039/https://www.newsobserver.com/living/fashion/article10135037.html", "description": "Gwyneth Paltrow, the 42-year-old Oscar-winner, conscious-uncoupler and Tracy Anderson devotee, is changing.", "image": {"identifier": "https://web.archive.org/web/20220817194039im_/https://www.newsobserver.com/latest-news/s2zq6h/picture7602728/alternates/LANDSCAPE_1140/l4uRs.So.156.jpeg", "alt": "Gwyneth Paltrow began Goop in 2008 as an aspirational – and controversial – lifestyle wellness-blog-cum-travel-and-cooking-tip-sheet-cum-shopping blog when her children were young. Although for years Goop was a lighting rod for derisive attacks on privileged celebrities, it has also emerged as an unlikely model for career development among a certain swathe of Hollywood."}}, "fb": {"app_id": 571418586252964, "pages": 961356303953721}, "title": "The Goop Effect: Gwyneth Paltrow a role model in celebrity commerce | Raleigh News & Observer", "allow-comments": "false", "description": "Gwyneth Paltrow, the 42-year-old Oscar-winner, conscious-uncoupler and Tracy Anderson devotee, is changing.", "keywords": "PALTROW-GOOP-ART-$ADV16-(TRIMS)-NYT,2438,", "news_keywords": "PALTROW-GOOP-ART-$ADV16-(TRIMS)-NYT,2438,", "original-source": "https://www.newsobserver.com/living/fashion/article10135037.html", "is-wirestory": "true", "article": {"opinion": "false"}, "parsely-metadata": "{\"article_id\": \"10135037\"}"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}