{"url": "https://www.independent.co.uk/arts-entertainment/music/news/liam-gallagher-noel-manchester-one-love-concert-no-show-tweet-attack-oasis-reunion-sad-twitter-a7772976.html", "text": "Sign up to Roisin O’Connor’s free weekly newsletter Now Hear This for the inside track on all things music Get our Now Hear This email for free Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nRoisin O’Connor’s email {{ #verifyErrors }}{{ message }}{{ /verifyErrors }}{{ ^verifyErrors }}Something went wrong. Please try again later{{ /verifyErrors }}\n\nLiam Gallagher has criticised his brother Noel after he failed to appear on stage for the One Love Manchester concert at Old Trafford.\n\nThe former Oasis frontman performed following rumours that an Oasis reunion could be on the cards, however Noel Gallagher was not seen at the event.\n\nAfter the show Liam wrote on Twitter: \"What an amazing night last night pure love vibrations nobody comes close to Manchester love forever...\n\nRecommended Watch the One Love Manchester concert in full\n\n\"Oh and if anybody's seen rkid tell him he can come out now as you were LG.\"\n\nPosting another tweet, he then said that he would like to apologise for his brother's absence on the night and that he was \"very disappointed\".\n\nOne Love Manchester Show all 12 1 /12 One Love Manchester One Love Manchester Concert goers queue outside Old Trafford Cricket Ground ahead of the One Love Manchester tribute concert in Manchester. AFP/Getty Images One Love Manchester Music fans embrace outside the Old Trafford Cricket Ground ahead of the One Love Manchester tribute concert in Manchester. AFP/Getty Images One Love Manchester A woman sunbathes as police officers patrol around Old Trafford Cricket Ground ahead of the One Love Manchester tribute concert in Manchester. AFP/Getty Images One Love Manchester Manchester residents cheer as survivors walk to Old Trafford cricket grounds for the concert @AlexScapensMEN/Twitter One Love Manchester Women wearing I Love MCR T-shirts arrive at the Old Trafford Cricket Ground ahead of the One Love Manchester tribute concert in Manchester. AFP/Getty Images One Love Manchester Armed police look-on as fans begin to arrive at the Old Trafford Cricket Ground ahead of the One Love Manchester tribute concert. AFP/Getty Images One Love Manchester One Love Manchester Benefit Concert fans. One Love Manchester One Love Manchester Benefit Concert. One Love Manchester The crowd at the 'One Love Manchester' benefit concert. One Love Manchester AP One Love Manchester Gary Barlow has tweeted a picture of Take That backstage with Ariana Grande. Grande said she wanted to return to the \"incredibly brave city\" to spend time with her fans and to \"honour and raise money for the victims and their families\". One Love Manchester Take That with Robbie Williams - Music fans have said they had to attend the Manchester benefit concert to show they were determined to \"stay strong and carry on\", despite recent attacks.\n\nIt had been rumoured that an Oasis reunion could happen after the younger Gallagher brother said he would be interested in performing with the band again, although at the time he implied he would not be able to attend the charity performance.\n\nDuring an interview with BBC Radio 1 he was asked if he would be appearing at One Love Manchester he responded: \"I don't think so. I mean I'm up for it but I think we've got a gig somewhere.\"\n\nHowever he made a special surprise appearance at the very end of the show, playing classic Oasis hits 'Live Forever' with Coldplay, as well as 'Rock 'N' Roll Star' and his new solo single 'Wall of Glass'.\n\nContinuing his rant on social media the next morning Liam also wrote: \"Noels [sic] out of the f***ing country weren't we all love get on a f***ing plane and play your tunes for the kids you sad f***.\"\n\nOne fan replied: \"That's the reunion out the window then haha\" to which Liam responded: \"F*** the reunion mate it ain't about Oasis it's about people helping other people and he's once again shown his true f***ing colours.\"\n\nThe One Love Manchester concert reportedly raised more than £2 million in three hours, which will go towards the We Love Manchester Emergency Fund.\n\nYou can read all of the latest updates, reaction and comment to the show here.", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/06/05/09/liam-gallagher.jpg?quality=75&width=1200&auto=webp", "https://www.independent.co.uk/img/pixels-player-logo.svg", "https://www.independent.co.uk/img/logo-white-out.svg"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/06/05/09/liam-gallagher.jpg?quality=75&width=1200&auto=webp", "keywords": [], "authors": ["Roisin O'Connor", "Music Correspondent"], "canonical_link": "https://www.independent.co.uk/arts-entertainment/music/news/liam-gallagher-noel-manchester-one-love-concert-no-show-tweet-attack-oasis-reunion-sad-twitter-a7772976.html", "title": "Liam Gallagher calls brother Noel 'sad f**k' for no-show at One Love Manchester concert", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, user-scalable=no, minimum-scale=1.0, maximum-scale=1.0", "description": "Fans were hoping the brothers would set aside their differences and reunite as Oasis for the charity performance", "theme-color": "#EC1A2E", "amp-google-client-id-api": "googleanalytics", "robots": "max-image-preview:large", "fb": {"app_id": 235586169789578, "pages": "https://www.facebook.com/TheIndependentOnline"}, "category": "News", "sitename": "The Independent", "page path": "/arts-entertainment/music/news", "page type": "Article", "adPageType": "Article Page", "og": {"locale": "en_GB", "updated_time": "2017-06-05T10:04:09.000Z", "site_name": "The Independent", "title": "Liam Gallagher lashes out at brother Noel for disappointing fans at Manchester show", "url": "https://www.independent.co.uk/arts-entertainment/music/news/liam-gallagher-noel-manchester-one-love-concert-no-show-tweet-attack-oasis-reunion-sad-twitter-a7772976.html", "type": "article", "description": "Fans were hoping the brothers would set aside their differences and reunite as Oasis for the charity performance", "image": {"identifier": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/06/05/09/liam-gallagher.jpg?quality=75&width=1200&auto=webp", "secure_url": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/06/05/09/liam-gallagher.jpg?quality=75&width=1200&auto=webp"}}, "article": {"published_time": "2017-06-05T10:04:09.000Z", "modified_time": "2017-06-05T10:04:09.000Z", "section": "Culture", "subsection": "Music", "author_name": "Roisin O'Connor", "content_type": "story", "word_count": 415, "image_count": 1, "embed_count": 7, "video_count": 1, "internal_link_count": 1, "external_link_count": 1}, "date": "2017-06-05T10:04:09.000Z", "google-signin-client_id": "329250492844-uqochn2f1j5ljkshuap5gc7qphf1refj.apps.googleusercontent.com", "twitter": {"title": "Liam Gallagher lashes out at brother Noel for disappointing fans at Manchester show", "site": "@Independent", "card": "summary_large_image", "description": "Fans were hoping the brothers would set aside their differences and reunite as Oasis for the charity performance", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/06/05/09/liam-gallagher.jpg?quality=75&width=1200&auto=webp"}, "keywords": "One Love Manchester,Liam Gallagher,Noel Gallagher,Oasis reunion,Oasis,BBC,Ariana Grande,Coldplay,Internal"}, "movies": [], "publish_date": 1496657049.0, "source": "https://www.independent.co.uk", "summary": ""}