{"url": "https://www.bustle.com/p/selena-gomezs-2018-met-gala-dress-has-a-detail-you-definitely-missed-9013857", "text": "When it comes to the Met Gala, the expectation is to see A-list celebs walk down the red carpet in unattainable haute couture that costs about the same amount as a huse down payment. But this year's Met is proving to be different. Selena Gomez 2018's Met Gala dress is actually Coach, and there's a tiny detail on the gown that you may have missed.\n\nGomez showing up in Coach is no accident — the artist is actually the face of the brand and has been starring in their campaigns since 2017. Not only that, she has recently expanded her role to \"designer\" with the label, where she is launching a Fall 2018 line that will include accessories, handbags, and even ready-to-wear pieces like jackets. So it's not completely out of the blue that the label would take over her Met Gala dress.\n\nCoach announced the Gala collaboration via their Instagram, where they posted a sketch of the dress surrounded with tufts of sheer lace, gold chains, bronze sequins, and gold flower pendents. In the caption they shared, \"Heavenly Body. A first look at #SelenaGomez’s custom Coach dress for tonight’s #MetGala. #CoachxSelena#CoachNY.\"\n\nThis year's Met Theme is \"Heavenly Bodies: Fashion and the Catholic Imagination,\" and explores the entwined relationship between Christianity and fashion, and how they influence each other.\n\nNeilson Barnard/Getty Images Entertainment/Getty Images\n\nSince the theme is Catholicism, you can expect to see plenty of cathedral-like accents throughout the red carpet. Gold and dark red color motifs will reign supreme, as will a lot of heavy embroidery and bead work. Which is why the tarnished gold chains and old rhinestones in the photo fit right in with the expected motif.\n\nThe dress itself appears to be airy and feminine, pulling inspiration from an angelic-like look that you can find in Christian artwork. Fashion pundits have already been speculating that the red carpet is going to be filled with two contrasting looks: Either ethereal angels dressed in white and ivory, with lace accents and airy tulle, or dark BDSM-like nuns, who are going to take advantage of leather, plastic, heavy velvet, and spikes.\n\nIt seems like Gomez is going to fall into the first category, where it appears her floor-length dress is mostly sheer and free flowing. Using an empire waist and peplum frills, the frock looks like something out of a 15th-century painting, and the simple ruffles and blush tones pay homage to that style.\n\nFloor length with a long sheer train, Coach used hand-sewn white lace down the length of the gown to give it that old, dream-like aesthetic, and then detailed the look with hand pleated frills with metal studs. The label used crystal embellishments across the gown that were reminiscent of motifs found in the Coach Fall 2018 runway collection, and they gave the airy bodice some interest.\n\nThere's also a detail in the dress that you probably missed: According to E! News, there's a detail that is almost too subtle to catch.\n\n\"The look was finished with a personal touch from Ms. Gomez,\" says an E! News correspondent during the red carpet broadcast. \"A quote in her handwriting is embossed on the side of the bag as well as on a ribbon on her gown.\"\n\nIt's a beautiful touch for a gorgeous dress. Coach Creative Director Stuart Vevers drew inspiration from the newest collection for the design, which is evident if you look at the sneak peeks that Coach has been dropping across their accounts these past couple of months. A lot of pinks, sequins, and lace are part of the inspiration board.\n\nGomez's dress was an opera length slip gown made from vintage cream silk gauze, and Vevers wanted to coax out a dark, romantic femininity from it —which you can feel from the sheer, Victorian-like lace that was then juxtoposed with gunmetal heels. She finished off the look with heavy gold eyeshadow that made her lids look like molten gold, which was a beauty move that tipped its hat to the religion's appreciation for gold.\n\nWhile the red carpet was filled with angel wings and halos, it was fun to see Gomez's more attainable version.", "images": ["https://imgix.bustle.com/uploads/getty/2018/5/8/982cd0c2-a777-47e0-8d57-733b98e4b213-getty-955766260.jpg?w=414&h=276&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2018/5/8/25adc190-2411-4327-bb06-a7f5b3ac8401-getty-955766260.jpg?w=800&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2018/5/8/25adc190-2411-4327-bb06-a7f5b3ac8401-getty-955766260.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2022/10/1/b79cdcb4-edb5-4b23-88dc-b66a834fd423-getty-1429142158.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2022/9/15/4fdfb5fc-2529-4f74-878d-ce095ba7452e-getty-1422895534.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2022/8/30/84b9a872-ef9c-45d0-b4f9-8bbf1fbe0e30-getty-1389282688.jpg?w=159&h=110&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.412&fp-y=0.144", "https://imgix.bustle.com/uploads/getty/2022/9/30/eba92301-96e2-4054-816d-f7a6770ad2e0-getty-1428489277.jpg?w=159&h=110&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.548&fp-y=0.2142", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/5/8/25adc190-2411-4327-bb06-a7f5b3ac8401-getty-955766260.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.bustle.com/p/selena-gomezs-2018-met-gala-dress-has-a-detail-you-definitely-missed-9013857", "title": "Selena Gomez's 2018 Met Gala Dress Has A Detail You Definitely Missed", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@bustle", "card": "summary_large_image", "creator": "@@marlenkomar"}, "article": {"publisher": "https://www.facebook.com/bustledotcom"}, "og": {"site_name": "Bustle", "url": "https://www.bustle.com/p/selena-gomezs-2018-met-gala-dress-has-a-detail-you-definitely-missed-9013857", "type": "article", "title": "Selena Gomez's 2018 Met Gala Dress Has A Detail You Definitely Missed", "description": "When it comes to the Met Gala, the expectation is to see A-list celebs walk down the red carpet in unattainable haute couture that costs about the same amount as a huse down payment. But this year's Met is proving to be different. Selena Gomez…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/5/8/25adc190-2411-4327-bb06-a7f5b3ac8401-getty-955766260.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "When it comes to the Met Gala, the expectation is to see A-list celebs walk down the red carpet in unattainable haute couture that costs about the same amount as a huse down payment. But this year's Met is proving to be different. Selena Gomez…"}, "movies": [], "publish_date": null, "source": "https://www.bustle.com", "summary": ""}