{"url": "https://en.wikipedia.org/wiki/The_Bella_Twins", "text": "Twin American models and retired professional wrestlers\n\nProfessional wrestling team\n\nThe Bella Twins were a professional wrestling tag team who performed on WWE and consisted of identical twin sisters Brie Bella and Nikki Bella (real names Brianna and Nicole). Each of the Bella Twins is a former WWE Divas Champion. Brie is the first twin in WWE history to win that title. Nikki won the title twice and remains its longest-reigning holder.\n\nBoth sisters signed with WWE in 2007 (then known as World Wrestling Entertainment) and were assigned to the farm territory Florida Championship Wrestling. Introduced as Brie Bella, Brianna was called up to the main roster in 2008. In early appearances she surreptitiously switched places with her sister to win her matches. After some weeks Nicole was revealed as Brie's twin and Nicole began to work as Nikki Bella. During the next years, they worked together as a team, as well as individually. Each sister won the WWE Divas Championship once before they were released in 2012. The Bella Twins made their return in 2013 and were featured in the reality show Total Divas. In 2014, they disbanded the team and began a feud but reunited in 2015, in which year Nikki won the Divas Championship for a second time. She retained the title for a record 301 days. After 2015, the sisters' appearances in WWE shows diminished until they announced their retirement in 2019. In 2021, they were inducted into the WWE Hall of Fame as part of the 2020 class.\n\nIn November 2015, Nikki was ranked No. 1 in Pro Wrestling Illustrated's Female 50.[3]\n\nEarly lives and careers [ edit ]\n\nNicole and Brianna Garcia-Colace were born sixteen minutes apart on November 21, 1983, in San Diego, California and raised on a farm in the outskirts of Scottsdale, Arizona.[4] They are of Mexican and Italian descent[5] and played soccer in their youth. The twins graduated from Chaparral High School in 2002.[6] They returned to San Diego for college, where Nicole continued playing soccer for Grossmont College, with both twins also working at Hooters.[4] A year later, the twins relocated to Los Angeles in pursuit of acting and modeling opportunities, making ends meet doing various gigs from marketing for a now defunct record label, to cocktail waitressing at the Mondrian Hotel.\n\nThey then made their first national TV appearance on the Fox reality show Meet My Folks.[6][7] Following this appearance, the twins were hired to be the World Cup Twins for Budweiser and were photographed holding the World Cup trophy.[8] They were contestants in the 2006 \"International Body Doubles twins search\".[9] They participated in the 2006 WWE Diva Search, but did not make the cut.[10]\n\nProfessional wrestling career [ edit ]\n\nWorld Wrestling Entertainment/WWE [ edit ]\n\nFlorida Championship Wrestling (2007–2008) [ edit ]\n\nThe Bella Twins were signed to developmental contracts by World Wrestling Entertainment (WWE) in June 2007 and were assigned to Florida Championship Wrestling (FCW), WWE's then-developmental territory, in Tampa, Florida.[7] On September 14, the twins made their in-ring debut defeating Nattie Neidhart and Krissy Vaine with Victoria Crawford as the special guest referee.[11][12] As a part of their on-screen personas, they switched places behind the referee's back if one of them was hurt. This was called \"Twin Magic\". They also occasionally competed in mixed tag team matches, teaming with male wrestlers including Kofi Kingston and Robert Anthony. They also made some non-wrestling appearances on Heath Miller's Happy Hour promo segment.[12]\n\nStarting in December 2007, they managed Derrick Linkin,[12] but this storyline was cut short when Linkin was released in January 2008. They then resumed their feud with Neidhart and Crawford, wrestling them throughout much of 2008.[13] In FCW, the twins competed in bikini contests and wrestled against Katie Lea Burchill, Milena Roucka, and Nattie Neidhart. Their last FCW appearance was on September 2, when they competed in a Divas battle royal won by Miss Angela.[13]\n\nVarious storylines (2008–2011) [ edit ]\n\nOn the August 29 episode of SmackDown, Brianna debuted as Brie Bella and defeated Victoria.[14] She had a series of matches with Victoria and Victoria's accomplice Natalya.[15][16][17] In each match, Brie would roll out of the ring, slip underneath it, and emerge surprisingly revived to win the match.[15][18] On the November 7 episode of SmackDown, Brie picked up a win against Victoria and then ran under the ring to escape Natalya and Victoria, but Victoria and Natalya both reached for Brie under the ring, resulting in both Nicole and Brie being pulled out.[19] Nicole was then introduced as Nikki Bella. The twins had their first official match as a team on the November 21 episode of SmackDown, defeating Victoria and Natalya.[20] They continued competing in tag team matches over the following months.[21][22][23]\n\nRaw event in 2009 Nikki (left) and Brie (right) during aevent in 2009\n\nStarting in November, the twins developed an on-screen relationship with The Colóns (Carlito and Primo).[24][25] In February 2009, the storyline expanded to include John Morrison and The Miz, who flirted with the Bellas and took them on a date for Valentine's Day.[26][27] The date provoked a rivalry between the teams of The Miz and Morrison and Primo and Carlito, with the four competing for the affection of the twins, who were seemingly unable to choose between them.[28][29] On March 17 on ECW, Carlito and Primo, aiming for Morrison and The Miz, accidentally spat apples in the face of Brie.[30] Nikki began to laugh at Brie's misfortune, and a fight broke out between the two, which led to Nikki leaving with The Miz and Morrison while Brie stayed with Primo and Carlito.[30] Brie won her first match over Nikki in a six-person intergender tag team match on SmackDown the following week.[31] On ECW on March 31, Nikki pinned Brie in their first singles match against each other after a distraction from Morrison and The Miz.[32]\n\nOn April 15, The Bella Twins were both drafted to the Raw brand as part of the 2009 supplemental draft.[33] On April 27, Brie made her Raw in-ring debut in an eight-Diva tag team match, which her team won. Nikki also made an appearance, reuniting with her twin, as she was under the ring to help Brie during the match.[34] Nikki then made her in-ring debut for the brand the following month in a battle royal, but was eliminated by Beth Phoenix.\n\nOn June 29, they were both traded to the ECW brand.[35] They debuted on ECW the following night on The Abraham Washington Show, as the special guests.[36] They quickly developed a storyline feud with Katie Lea Burchill, when Nikki defeated her in a match by switching places with Brie behind the referee's back.[37] The following week on Superstars, Brie defeated Burchill after a similar fashion, and the feud ended in September, when Nikki defeated Burchill on Superstars.[38][39]\n\nOn October 12, the Bellas were traded back to Raw as part of a tri-branded Divas trade,[40] where they predominately appeared in backstages segments with the weekly guest stars and only occasionally competed in matches.[11] In June 2010, they developed a feud with Jillian Hall, when Brie defeated her after switching places with Nikki.[41] The following week, Nikki defeated Hall after switching with Brie.[42] The feud was exacerbated when the Bellas acted as the special guest referees during one of Hall's matches. During the match, Hall attacked both twins, but lost the match when Nikki made a fast count, allowing her to be pinned by Gail Kim.[43] The next week on Superstars, the twins defeated Hall and Maryse in a tag team match to end the storyline.[44]\n\nOn August 31, The Bella Twins announced they would be part of the all-female third season of NXT, mentoring Jamie.[45] Jamie was the first rookie Diva eliminated on the October 5 episode of NXT.[46] In November, the twins began a storyline with Daniel Bryan, when Brie accompanied him to the ring for his match. Following his win, Nikki ran out and the two fought over Bryan's affection, until Bryan broke it up and had them hug each other.[47] They began to manage Bryan and frequently accompanied him to the ring over the next two months.[48][49] In January 2011, they discovered Bryan kissing Gail Kim backstage and assaulted her.[50] They continued to attack Kim, both at the Royal Rumble on January 30 and the following night on Raw.[51][52] On February 7, they teamed with Melina in a losing effort to Kim, Eve Torres and Tamina.[53]\n\nDivas Champions (2011–2012) [ edit ]\n\nNikki (left) with Brie (right) during her reign as Divas Champion in April 2011\n\nThe Bellas began feuding with Eve Torres after they appeared as lumberjills during a Divas Championship match between Torres and Natalya on the February 14 episode of Raw. Following the match, they attacked Torres backstage before Gail Kim and Natalya stopped them.[11] The next week on Raw, the twins defeated Torres and Kim in a tag team match.[54] The following week on Raw, Nikki won a battle royal to become the number one contender for the Divas Championship and unsuccessfully challenged Torres for the championship on March 7.[55][56]\n\nOn April 11, Brie defeated Torres to win the Divas Championship, marking the first time either twin had held a championship in WWE.[57][58] On May 22, Brie went on to successfully defend the championship against Kelly Kelly at Over the Limit after switching places with Nikki.[59] On a special \"Power to the People\" episode of Raw on June 20, Brie defended her WWE Divas Championship against Kelly (who was selected by voters), losing the title and ending her reign at 70 days.[60] On July 17, Brie challenged Kelly for the championship in a rematch at Money in the Bank on July 17, but she failed to win.[61]\n\nThe Bellas began to show friction in March 2012 after both twins lost to AJ Lee in singles competition.[62][63] After Brie's match with Lee, Nikki revealed that Brie was rooting for Team Johnny in the 12-man tag team match at WrestleMania XXVIII on April 1 whilst Nikki was rooting for Team Teddy, thus furthering their dissension.[64]\n\nOn the April 6 episode of SmackDown, Nikki defeated the Divas Champion Beth Phoenix in a non-title match after Kelly Kelly distracted Phoenix.[65] On April 23, Nikki defeated Phoenix in a lumberjill match on Raw to win the Divas Championship for the first time.[66][67] Brie lost Nikki's championship to Layla at Extreme Rules on April 29 after Twin Magic failed, ending her Divas Championship reign after only a week.[68] The following night on Raw, they competed in their last match with the WWE, failing to win back the Divas Championship from Layla in a triple threat match.[69] Later that night, WWE announced on their website that the twins had been fired by Executive Administrator Eve Torres.[70]\n\nIndependent circuit promotions (2012–2013) [ edit ]\n\nOn May 1, 2012, the twins appeared at their first independent wrestling show in Newburgh, New York at Northeast Wrestling.[71][72] They later appeared for CTWE Pro Wrestling at the Season Beatings pay-per-view on December 15, each accompanying a different wrestler to the ring.\n\nReturn to WWE [ edit ]\n\nTotal Divas storylines (2013–2014) [ edit ]\n\nAfter returning to WWE, the twins began dressing in different outfits as seen here.\n\nThe Bella Twins returned to WWE on the March 11, 2013, episode of Raw in a backstage segment with Team Rhodes Scholars (Cody Rhodes and Damien Sandow).[73] On the March 15 episode of SmackDown, the twins attacked The Funkadactyls (Cameron and Naomi)[74] and the following week interfered in matches between Team Rhodes Scholars and Brodus Clay and Tensai, but were attacked by The Funkadactyls.[75][76] The twins made their in-ring return defeating The Funkadactyls on the March 27 episode of Main Event after interference from Cody Rhodes.[77] The Bella Twins were scheduled to participate in an eight-person tag team match with Team Rhodes Scholars against Tons of Funk (Clay and Tensai) and The Funkadactyls at WrestleMania 29 on April 7, but the match was canceled due to time restraints[78] and instead took place the following night on Raw, where The Bella Twins and Team Rhodes Scholars were defeated.[79] In June, Nikki suffered a fractured tibia.[80]\n\nUpon the debut of the Total Divas reality television program in July, The Bellas began a feud with their co-star on the show Natalya, with Brie and Natalya trading victories in singles competition on Raw and at SummerSlam on August 18.[81][82][83] The cast of Total Divas then transitioned into a scripted feud with Divas Champion AJ Lee, who mocked the show and cast.[83] At Night of Champions on September 15, Brie unsuccessfully challenged Lee for the Divas Championship in a four-way match, which also involved Natalya and Naomi.[84] Continuing their feud into October, Brie and Lee faced off at Battleground and Hell in a Cell for the Divas Championship, but Brie was unsuccessful.[85][86] Nikki returned to in-ring action on the October 25 episode of SmackDown, losing to Lee.[87] At Survivor Series on November 24, the twins were part of the victorious Team Total Divas.[88] On April 6, they failed to win the Divas Championship again at WrestleMania XXX in the Divas Invitational match, which was won by Lee.[89]\n\nBrief split (2014) [ edit ]\n\nFrom the crowd, Brie (who kayfabe quit WWE) watches Nikki, who is about to participate in a four-on-one handicap match in July 2014.\n\nIn April 2014, Brie became involved in her real-life husband Daniel Bryan's ongoing storyline with Stephanie McMahon and Kane,[90] whereas part of the storyline McMahon threatened to fire Brie if an injured Bryan did not relinquish the WWE World Heavyweight Championship at Payback on June 1, which forced Brie to \"quit\" WWE before slapping McMahon in the face.[91] After Brie \"quit\", McMahon put Nikki in several handicap matches as punishment.[92][93][94] After a month absence, Brie returned to WWE television, appearing in the crowd on July 21 and starting a confrontation with McMahon who slapped Brie and was subsequently arrested.[95] In order to have Brie drop the \"charges\", Brie was rehired and received a match against McMahon at SummerSlam.[96]\n\nNikki attacked Brie at the event on August 17, which allowed McMahon to win the match.[97] The next several weeks saw the twins fight in several backstage and in-ring segments, including a cameo appearance from Jerry Springer on Raw on September 8.[98] As part of the storyline, McMahon declared Nikki the face of the WWE Divas division and granted her a match at Night of Champions for the Divas Championship, which she failed to win.[99][100] At Hell in a Cell, Nikki defeated Brie in a match where the loser was forced to become the winner's personal assistant for 30 days.[101]\n\nNikki and Brie reunited at Survivor Series on November 23 when Nikki defeated AJ Lee with Brie's help to become a two-time Divas Champion.[102] Nikki retained her championship in three separate occasions—against Lee in a rematch at TLC: Tables, Ladders & Chairs on December 14,[103] against Naomi two days later on SmackDown[104] and against Paige on February 22, 2015, at Fastlane.[105] Paige and Lee then formed an alliance against the Bellas[106] which led to a tag team match at WrestleMania 31 on March 29, which the Bellas lost.[107][108]\n\nTeam Bella (2015) [ edit ]\n\nAfter Nikki retained her title over Naomi at Extreme Rules on April 26,[109] Nikki started a feud with Naomi after she aligned with the returning Tamina to even the odds against Bellas. This led to a tag team match between the two teams at Payback on May 17, which Naomi and Tamina won.[110] At Elimination Chamber on May 31, Nikki retained her title against Naomi and Paige in a triple threat match, with Brie banned from ringside.[111]\n\nIn June, The Bella Twins became villains once again by employing Twin Magic, which helped Nikki retain the title against Paige on the June 1 episode of Raw and at Money in the Bank on June 14.[112][113] During the feud with Paige, Alicia Fox allied with them to form Team Bella.[114] At The Beast in the East on July 4, Nikki retained the title against Paige and Tamina.[115]\n\nAfter weeks of Team Bella outnumbering Paige, Naomi and Tamina, Stephanie McMahon called for a \"revolution\" in the WWE Divas division and introduced the debuting Charlotte and Becky Lynch as Paige's allies while NXT Women's Champion Sasha Banks debuted as an ally to Naomi and Tamina, which led to a brawl between the three teams.[116][117] Nikki then lost to Charlotte in a tag team match on the August 3 episode of Raw[118] and to Banks on the August 17 episode of Raw in a non-title match.[119] On August 23, the three teams faced off at SummerSlam in a three team elimination match in which Team Bella first eliminated Team B.A.D. before Team PCB's win.[120]\n\nOn the September 14 episode of Raw, Nikki defended her title against Charlotte, who pinned Brie after the twins had switched places to win the match, but she retained the championship since the title cannot change hands by disqualification and in the process became the new longest reigning Divas Champion in history, surpassing AJ Lee's previous record of 295 days.[121]\n\nInjuries, retirements and sporadic appearances (2015–2022) [ edit ]\n\nOn September 20, Nikki dropped the championship to Charlotte at Night of Champions, ending her reign at 301 days[122] and failing to regain the title in a rematch at Hell in a Cell on October 25.[123] Shortly after, Nikki went on a hiatus from both television and in-ring competition due to a neck injury which would require surgery,[124][125] but returned for one night on December 21 to accept the Slammy Award for Diva of the Year.[126] During Nikki's absence, Brie continued to compete in singles competition and in tag team matches with Fox.[126][127][128] Brie was unsuccessful in winning the Divas Championship at Fastlane on February 21 in a match against Charlotte.[129] During that time, Team Bella quietly disbanded.[130][131]\n\nTotal Divas co-stars after Brie's victory at The Bella Twins celebrating along their fellowco-stars after Brie's victory at WrestleMania 32 in April 2016\n\nIn March 2016, Brie was placed in a feud with Lana, who argued that Brie's fans only supported her out of pity for having a \"bad husband\".[132] Brie then aligned herself with fellow Total Divas cast members Alicia Fox, Natalya, Paige and Eva Marie while Lana aligned herself with Team B.A.D. (Naomi and Tamina), Summer Rae and Emma (which was officially called Team B.A.D. and Blonde), leading to a 10-woman tag team match on the WrestleMania 32 kickoff show on April 3, which Team Total Divas would win when Naomi submitted to Brie. After the match, Nikki returned and celebrated with her co-stars.[133] On April 6, Brie confirmed that she would be taking an extended break from in-ring competition, citing family reasons while also stating that she will continue working for WWE as an ambassador.[134]\n\nOn January 22, 2018, on the Raw 25 Years special episode, The Bella Twins were honored as part of a segment involving women considered legends that contributed to the company's success.[135] At the Royal Rumble on January 28, Brie and Nikki participated in the first ever women's Royal Rumble match at No. 28 and No. 27, respectively, making it into the final four with Asuka and Sasha Banks, with Nikki eliminating Brie before being eliminated herself by the winner Asuka.[136] On the September 3 episode of Raw, The Bella Twins competed for the first time in three years, defeating The Riott Squad (Liv Morgan and Sarah Logan). The Bellas teamed with Ronda Rousey to defeat The Riott Squad at WWE Super Show-Down on October 6, and won the rematch two nights later on Raw. After the rematch, the Bellas attacked Rousey.[137] Nikki received a title opportunity against Rousey at WWE Evolution on October 28, but was unsuccessful.[138] In March 2019, both Bellas announced on Total Bellas that they had retired from in-ring competition with Brie making the announcement on the March 10 episode and Nikki announcing her retirement on the season finale on March 24.[139] At February 21, 2020 edition of SmackDown, it was announced that both Bellas will be inducted into the WWE Hall of Fame, during A Moment of Bliss segment.[140][141] Due to the COVID Pandemic, the ceremony took place the next year.\n\nOn January 30, 2022, after a three-year break from wrestling, The Bella Twins participated in the 2022 Royal Rumble.[142]\n\nOther media [ edit ]\n\nGuest appearances [ edit ]\n\nPrior to working with WWE, the twins appeared on Meet My Folks.[6] Both twins also appeared in the music video for \"Right Side of the Bed\" by the band Atreyu.[145] They were regulars on the VH1 show Best Week Ever. The twins made a guest appearance on the MTV series Ridiculousness in October 2012.[146] They also appeared in the music video for \"Na Na\" by Trey Songz in 2014.[4]\n\nThe twins guest starred on the television series Psych, in the 2014 episode \"A Nightmare on State Street\".[4][147] Nikki and Brie are part of the main cast for the reality television show Total Divas, which began airing in July 2013.[148][149] In April 2016, it was announced that Total Bellas, a spin-off of Total Divas starring the twins, would begin airing in fall 2016.[150]\n\nNikki and Brie co-starred in the 2014 independent film Confessions of a Womanizer and provided voices for the 2015 movie The Flintstones & WWE: Stone Age SmackDown!.[151][152]\n\nNikki appeared at the Miss USA 2013 pageant as one of the celebrity judges.[153] They appeared at the 2014 MTV Europe Music Awards, where they presented the award for Best Female.[154][155] The twins were both nominated for Choice Female Athlete at the 2015 Teen Choice Awards.[156] The following year at the 2016 Teen Choice Awards, The Bella Twins won Choice Female Athlete. Brie appeared alongside Paige, Natalya, and the Chrisley family on the 88th Academy Awards edition of E! Countdown to the Red Carpet in February 2016.[157]\n\nThe Bella Twins have appeared in ten WWE video games, making their in-game debut at WWE SmackDown vs. Raw 2010 and appearing in WWE SmackDown vs. Raw 2011, WWE '12 (DLC), WWE '13, WWE 2K14 (DLC),[158] WWE 2K15, WWE 2K16, WWE 2K17, WWE 2K18, WWE 2K19, WWE 2K20 and WWE 2K Battlegrounds. Animated versions of the Bella Twins were included in WWE Network's series Camp WWE.[159]\n\nYouTube [ edit ]\n\nBoth twins appeared on the WWE YouTube show The JBL & Cole Show.[160]\n\nOn November 21, 2016, Nikki and Brie unveiled their new YouTube channel which features daily fashion, beauty, travel, fitness, relationship and health videos along with daily video blogs, created by the twins themselves.[161]\n\nThe Bella Twins appeared in YouTuber iiSuperwomanii's video \"When Someone Tries to Steal Your BFF\" on March 2, 2017.[162]\n\nOn April 16, 2020, the twins were featured on the hit YouTube channel \"First We Feast\", appearing a Truth or Dab edition of Hot Ones.[163]\n\nLifestyle [ edit ]\n\nOn August 21, 2017, Nikki and Brie launched their own wine label called Belle Radici in collaboration with Hill Family Estates and Gauge Branding.[164] Later that year on November 1, 2017, Nikki and Brie launched Birdiebee, a lifestyle intimates and activewear brand. The line includes transitional intimates, activewear and loungewear aimed at \"empowering and educating women through mirroring the twins' passion for life, strength, women's health and wellness, and fun\".[165]\n\nOn January 28, 2019, Nikki and Brie launched Nicole + Brizee, a body and beauty line.[166] On March 27, 2019, Nikki and Brie launched their own podcast.[167]\n\nIn March 2020, Nikki and Brie released their memoir Incomparable.[168]\n\nIn 2021, Nikki and Brie launched another wine label called Bonita Bonita Wine.[169]\n\nIn 2021, Nikki and Brie launched their own baby gear collection in partnership with Colugo. Nikki and Brie also announced that they joined Colugo as investors and creative advisors.[170]\n\nPersonal life [ edit ]\n\nOn May 9, 2017, Brie gave birth to her first child, a daughter, Birdie Joe Danielson.[171] In January 2020, the twins announced they were both pregnant, with due dates a week and a half apart.[172] On July 31, Nikki gave birth to Matteo Artemovich Chigvintsev. 22 hours later, Brie gave birth to Buddy Dessert Danielson on August 1.\n\nBibliography [ edit ]\n\nIncomparable (2020)\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nMusic videos [ edit ]\n\nChampionships and accomplishments [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/15/The_Bella_Twins_April_2015.jpg/170px-The_Bella_Twins_April_2015.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/The_Bella_Twins_Live_Event.jpg/170px-The_Bella_Twins_Live_Event.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/Nikki_Bella_Looks_At_Brie_Bella.JPG/170px-Nikki_Bella_Looks_At_Brie_Bella.JPG", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/aa/YouTube_Gold_Play_Button_2.svg/32px-YouTube_Gold_Play_Button_2.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7f/Bella_Twins.jpg/170px-Bella_Twins.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Nikki_Bella_Divas_Champion.jpg/150px-Nikki_Bella_Divas_Champion.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/The_Bella_Twins_WrestleMania_31.jpg/220px-The_Bella_Twins_WrestleMania_31.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Total_Divas_team_WrestleMania_32.jpg/170px-Total_Divas_team_WrestleMania_32.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Eve_Torres_Also_great.jpg/220px-Eve_Torres_Also_great.jpg", "https://upload.wikimedia.org/wikipedia/commons/1/1f/The_Bella_Twins_WrestleMania_31.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Bella_Twins_Divas_Champion_%28cropped%29.jpg/170px-Bella_Twins_Divas_Champion_%28cropped%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/1/1f/The_Bella_Twins_WrestleMania_31.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/The_Bella_Twins", "title": "The Bella Twins", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/1/1f/The_Bella_Twins_WrestleMania_31.jpg", "width": 640, "height": 1178}, "title": "The Bella Twins - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}