{"url": "https://www.independent.co.uk/life-style/ashley-graham-clothes-instagram-worth-husband-supermodel-designer-author-a8480231.html", "text": "Stay ahead of the trend in fashion and beyond with our free weekly Lifestyle Edit newsletter Stay ahead of the trend in fashion and beyond with our free weekly Lifestyle Edit newsletter Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nLifestyle Edit email {{ #verifyErrors }}{{ message }}{{ /verifyErrors }}{{ ^verifyErrors }}Something went wrong. Please try again later{{ /verifyErrors }}\n\nAshley Graham is one of the most successful plus-size models in the industry, but there is a lot that people don’t know about the 30-year-old.\n\nAlthough she has more than seven million Instagram followers, Graham can be private about her personal life.\n\nIn addition to modelling, Graham is also a swimsuit and lingerie designer and an author - hobbies she touched on in a YouTube interview with Vogue, where she was featured in the magazine’s “73 questions” series.\n\nThese are 21 things you may not know about Ashley Graham.\n\nShe is the author of two books; an autobiography titled A New Model: What Confidence, Beauty, and Power Really Look Like, published in 2017, and All the Stars Left Behind, a novel. She keeps her purses spotless and cleans them out every single night. The model is lactose intolerant so she avoids dairy - but she craves “mac and cheese, every single day of my life.” Although she is a style icon in her own right, Graham considers Kim Kardashian West her fashion icon. If she had to choose one product to never live without, she would choose rose water. Graham’s modelling icon is supermodel Cindy Crawford, whose Revlon campaigns she had taped to her wall when she was younger Of all the countries, Graham would most like to visit India. Her and her husband Justin Ervin met at a New York City church in 2009, where Graham was volunteering. Graham considers panty lines her biggest pet peeve. When asked what item every woman should have in her closet, Graham told Vogue a “bra, duh.” The best fashion advice she’s ever been given is “beauty comes in all shapes and sizes, rock your confidence.” The supermodel is into conspiracy theories revolving around the existence of mermaids and aliens - and loves watching YouTube videos about them Although she has walked in many runway shows, Graham thinks the hardest part is “staying focused and not looking at the audience” - a struggle when the audience is full of impressive people. Graham is confident and believes she can pull of anything - in response to a question about one look she cannot pull off, she said: “Curvy girls can pull off any look, it is what we do.” If she had to choose a spirit animal, she would pick a bird. Her advice for young women is to “love the skin you are in and be your own role model.” Although her career keeps her extremely busy, the model made time to binge-watch the Netflix series Stranger Things. If she could choose one show to get a reboot, it would be Sister, Sister. Her husband of eight years calls her “butt,” - a nickname she doesn’t think it is necessary for her to explain. Graham’s favourite lipstick is a nude colour from Charlotte Tilbury called Pillowtalk. She prefers SUVs over sedans, a preference she made clear as she got into a chauffeured car to New York Fashion Week. Finally, the one question she wishes people would stop asking her is “What do you think of the term plus-size?” Instead of the term plus-size, the body-positivity advocate prefers to use “curvy.”\n\nSince becoming a supermodel in 2016, Graham has defied odds and carved a name for herself in the fashion industry.\n\nGraham shared 73 things about herself in an interview (Vogue)\n\nOverall, Graham’s illustrious career in modelling has made her a role model and an inspiration.", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/08/06/18/gettyimages-488345266.jpg?quality=75&width=982&height=726&auto=webp", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/08/06/18/gettyimages-488345266.jpg?quality=75&width=1200&auto=webp"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/08/06/18/gettyimages-488345266.jpg?quality=75&width=1200&auto=webp", "keywords": [], "authors": ["Chelsea Ritschel", "In New York"], "canonical_link": "https://www.independent.co.uk/life-style/ashley-graham-clothes-instagram-worth-husband-supermodel-designer-author-a8480231.html", "title": "21 things you may not know about Ashley Graham", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, user-scalable=no, minimum-scale=1.0, maximum-scale=1.0", "description": "The plus-size supermodel has written two books", "theme-color": "#EC1A2E", "amp-google-client-id-api": "googleanalytics", "robots": "max-image-preview:large", "fb": {"app_id": 235586169789578, "pages": "https://www.facebook.com/TheIndependentOnline"}, "category": "Lifestyle", "sitename": "The Independent", "page path": "/life-style", "page type": "Article", "adPageType": "Article Page", "og": {"locale": "en_GB", "updated_time": "2018-08-06T18:18:55.000Z", "site_name": "The Independent", "title": "21 things you may not know about Ashley Graham", "url": "https://www.independent.co.uk/life-style/ashley-graham-clothes-instagram-worth-husband-supermodel-designer-author-a8480231.html", "type": "article", "description": "The plus-size supermodel has written two books", "image": {"identifier": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/08/06/18/gettyimages-488345266.jpg?quality=75&width=1200&auto=webp", "secure_url": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/08/06/18/gettyimages-488345266.jpg?quality=75&width=1200&auto=webp"}}, "article": {"published_time": "2018-08-06T18:18:55.000Z", "modified_time": "2018-08-06T18:18:55.000Z", "section": "Lifestyle", "author_name": "Chelsea Ritschel", "content_type": "story", "word_count": 188, "image_count": 2, "embed_count": 1, "video_count": 0, "internal_link_count": 1, "external_link_count": 1}, "date": "2018-08-06T18:18:55.000Z", "google-signin-client_id": "329250492844-uqochn2f1j5ljkshuap5gc7qphf1refj.apps.googleusercontent.com", "twitter": {"title": "21 things you may not know about Ashley Graham", "site": "@Independent", "card": "summary_large_image", "description": "The plus-size supermodel has written two books", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/08/06/18/gettyimages-488345266.jpg?quality=75&width=1200&auto=webp"}, "keywords": "Ashley Graham,plus-size,Model,Internal"}, "movies": [], "publish_date": 1533579535.0, "source": "https://www.independent.co.uk", "summary": ""}