{"url": "https://www.digitalspy.com/movies/oscars/a454248/oscars-20-most-memorable-academy-awards-acceptance-speeches/", "text": "\"And the Oscar goes to…\" Five words that will send nervous tingles through even the coolest of Hollywood customer. Winning an Academy Award can prompt tears of joy, euphoria, the desire to kiss whoever crosses your path or, in the case of Joe Pesci, extreme terseness.\n\nAs the likes of Daniel Day-Lewis, Jessica Chastain, Jennifer Lawrence and Ben Affleck ready themselves for the big night on Sunday (February 24), Digital Spy takes a look back at 20 of the most memorable acceptance speeches in Oscars history.\n\n20. Marion Cotillard - La Vie en Rose (2007)\n\n\"Thank you life, thank you love. It is true, there are some angels in this city!\" So usually a calm and restrained presence in interviews, Marion Cotillard let her emotions run free as she picked up a much-deserved Oscar for her barnstorming turn as Édith Piaf.\n\n> Watch Marion Cotillard's Oscars acceptance speech\n\nMark J. Terrill/AP\n\n19. Joe Pesci - Goodfellas (1991)\n\n\"It's my privilege. Thank you.\" And like that, he was gone. At two seconds long, is this the shortest ever Oscar acceptance speech?\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n18. Sally Field - Places in the Heart (1985)\n\n\"You like me!\" exclaimed Sally Field. The line was from her film Norma Rae, which bagged her an Oscar back in 1979, a reference that many didn't twig at the time.\n\n> Watch Sally Field's Oscars acceptance speech\n\nAP\n\nNo actor has managed to channel their own on-screen character quite as well as Cuba Gooding Jr, who was positively ecstatic when he won 'Best Supporting Actor' for Jerry Maguire. The band struck up, but Gooding Jr continued to race through all of his thank yous.\n\n> Watch Cuba Gooding Jr's Oscars acceptance speech\n\nSusan Sterner/AP\n\n16. Jack Palance - City Slickers (1992)\n\nA veteran of many classic Westerns, Palance won an Oscar at the third time of asking for his performance as grizzled cowboy Curly in the Billy Crystal comedy City Slickers. He may have been in his 70s, but Palance was still showed he was fit as a fiddle by performing one-armed push-ups on stage.\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n15. Sean Connery - The Untouchables (1988)\n\nAfter some awkward banter between Cher and Nicolas Cage, Sean Connery took to the stage to take his 'Best Supporting Actor' Oscar. The one-time James Bond used the opportunity to joke about being a thrifty Scotsman and, more seriously, call for an end to the WGA strike that was ongoing at the time.\n\n> Watch Sean Connery's Oscars acceptance speech\n\nLennox McLendon/AP\n\n14. Michael Caine - The Cider House Rules (1999)\n\nMichael Caine was away filming Jaws IV: The Revenge (it paid for a nice swimming pool!) when he won an Oscar for Hannah and Her Sisters, but he didn't make the same mistake twice when it came to 1999's The Cider House Rules. Caine was on sparkling, charming form on stage, thanking his fellow nominees and stressing how much he preferred \"the Oscar goes to\" instead of \"the winner is\".\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n13. Meryl Streep - The Iron Lady (2012)\n\nMeryl Streep has bagged a staggering 17 Oscar nominations - winning three - with the most recent victory coming last year for The Iron Lady. It holds special poignancy as it arrived 30 years after her last win for Sophie's Choice. In the intervening years Meryl had been nominated and lost an astronomical 12 times.\n\n> Watch Meryl Streep's Oscars acceptance speech\n\nMark J. Terrill/AP PA Images\n\n12. Kate Winslet - The Reader (2009)\n\nKate Winslet was approaching Meryl Streep levels of Oscar snubbery before she bagged her 'Best Actress' Oscar for The Reader. It was sixth time lucky for the beloved British actress, who said she first rehearsed this speech when she was 8 years old with a shampoo bottle.\n\n> Watch Kate Winslet's Oscars acceptance speech\n\nMark J. Terrill/AP\n\n11. Michael Moore - Bowling for Columbine (2003)\n\nWith a huge TV audience watching, documentary filmmaker Michael Moore's \"fictitious times\" speech took aim at President George Bush. The reception from Oscar guests, as you can here below, was mixed, and the band kicked in early in a bid to get Moore off stage.\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n10. Glen Hansard and Marketa Irglova - Once (2007)\n\nFew people inside Hollywood's Kodak Theatre will have known who Glen Hansard and Marketa Irglova were before they nabbed the 'Best Original Song' Oscar for Once's 'Falling Slowly'. \"What are we doing here? This is mad!\" said Irishman Hansard, before signing off with \"make art\".\n\n> Watch Glen Hansard and Marketa Irglova's Oscars acceptance speech\n\nMark J. Terrill/AP\n\n9. Adrien Brody - The Pianist (2003)\n\nAdrien Brody's smooch with Halle Berry hit the headlines when he won the 'Best Actor' gong for Roman Polanski's The Pianist. \"I bet they didn't tell you that was in the gift bag,\" he told Berry, before calling Wladyslaw Szpilman \"the role of a lifetime\".\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n8. Roberto Benigni - Life is Beautiful (1999)\n\nRobert Benigni unleashed pure joy when he won the Oscar for 'Best Foreign Language Film' in 1999, dancing across chairs and telling the entire auditorium he wanted to kiss all of them. It's the telecast cutaways that make Benigni's speech, with tears (Goldie Hawn), laughter (Gwyneth Paltrow) and bewilderment (Sophia Loren) all on show.\n\n> Watch Roberto Benigni's Oscars acceptance speech\n\nPeter Jordan/PA Archive\n\n7. Tom Hanks - Philadelphia (1993)\n\nHanks delivered a searing turn as AIDS victim Andrew Beckett in Jonathan Demme's Philadelphia, and on bagging his Oscar thanked his high school drama teacher and former classmate, \"two of the finest gay Americans\". The only problem? Both were still in the closet. This moment inspired Kevin Kline's 1997 comedy In & Out.\n\n> Watch Tom Hanks's Oscars acceptance speech\n\nReed Saxon/AP\n\n6. Gwyneth Paltrow - Shakespeare in Love (1998)\n\nThe tears came thick and fast as Jack Nicholson presented Gwyneth Paltrow with the 'Best Actress' Oscar. The waterworks began the moment her name was read out, but, like a total pro, Gwyneth was able to rattle through her fellow nominees, her cast, crew and Harvey Weinstein. The biggest heart-wrenching moments came later in her speech as she paid tribute to her family, her late cousin Keith Paltrow and college friend Harrison Kravis.\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n5. Angelina Jolie - Girl, Interrupted (1999)\n\nBack before Brad, Angelina Jolie nabbed an Academy Award for her unhinged turn in Girl, Interrupted. Now we view Angelina as the epitome of poise and grace, but then she freaked everyone out with a gushing declaration of love for her own brother.\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n4. Julia Roberts - Erin Brockovich (2001)\n\nAfter three nominations, Julia Roberts finally got her moment of glory and nobody was going to take it away from her. \"Sir, you're doing a great job but you're so quick with that stick so why don't you sit because I may never be here again,\" she told the orchestra conductor for fear of getting played off early. Our highlight? Roberts reprising her Pretty Woman laugh before yelling \"I love it up here!\".\n\n> Watch Julia Roberts's Oscars acceptance speech\n\nKevork Djansezian/AP\n\n3. Halle Berry - Monster's Ball (2002)\n\n\"This moment is so much bigger than me. This is for every nameless, faceless woman of colour who now has a chance tonight because this door has been opened.\" said a tearful Halle Berry in her Oscars acceptance speech. It was the first time a black actress had won the Academy's top award and came 63 years after Hattie McDaniel's 'Supporting Actress' victory for Gone with the Wind.\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n2. James Cameron - Titanic (1998)\n\n\"I'm the king of the world,\" bellowed James Cameron as he won an Oscar for 'Best Director'. An act of extreme hubris? For sure. Instantly iconic? You bet.\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n1. Marlon Brando - The Godfather (1973)\n\nBrando's 'Best Actor' Oscar victory for The Godfather was swamped in controversy as he refused to attend the ceremony, instead sending Native American civil right activist Sacheen Littlefeather to collect his trophy. Brando had become involved in the American Indian Movement, and used his win to protest their misrepresentation in Hollywood.\n\nLittlefeather initially planned to read out a 15-page speech but was told backstage by the producer that she would be ejected from the event. Award presenter Roger Moore revealed in his autobiography that he kept Brando's Oscar overnight and it was collected by an armed guard the morning after.\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nThe 85th Academy Awards show will air live on ABC on Sunday, February 24.", "images": ["https://hips.hearstapps.com/digitalspyuk.cdnds.net/16/08/1456152704-movies-oscar-speeches.jpg?crop=1xw:1.0xh;center,top&resize=1200:*", "https://www.digitalspy.com/sites/digitalspy/assets/images/logos/ipso_regulated_hires.png", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/digitalspyuk.cdnds.net/16/08/1456152704-movies-oscar-speeches.jpg?resize=480:*"], "top_img": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/16/08/1456152704-movies-oscar-speeches.jpg?crop=1xw:1.0xh;center,top&resize=1200:*", "keywords": [], "authors": ["Simon Reynolds"], "canonical_link": "https://www.digitalspy.com/movies/oscars/a454248/oscars-20-most-memorable-academy-awards-acceptance-speeches/", "title": "Oscars: 20 most memorable Academy Awards acceptance speeches", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=6", "msapplication-tap-highlight": "no", "theme-color": "#e94114", "og": {"type": "article", "site_name": "Digital Spy", "title": "20 must-see Oscar acceptance speeches", "description": "Tears, euphoria and kisses. Digital Spy picks out some of the great winners speeches.", "url": "http://www.digitalspy.com/movies/oscars/a454248/oscars-20-most-memorable-academy-awards-acceptance-speeches/", "image": {"identifier": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/16/08/1456152704-movies-oscar-speeches.jpg?crop=1xw:1.0xh;center,top&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 131928163488848}, "article": {"publisher": "https://www.facebook.com/digitalspyuk/", "modified_time": "2019-01-02T13:04:38Z", "published_time": "2013-02-18T08:54:00Z", "section": "Oscars", "opinion": "false"}, "twitter": {"site": "@digitalspy", "card": "summary_large_image", "image": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/16/08/1456152704-movies-oscar-speeches.jpg?crop=1xw:1.0xh;center,top&resize=640:*"}, "google-site-verification": "yOsKGKJADzRcnlk-FrptJIoYYaNs5pgoJx2J0ie4bWE", "title": "Oscars: 20 most memorable Academy Awards acceptance speeches", "description": "Tears, euphoria and kisses. Digital Spy picks out some of the great winners speeches.", "keywords": "Angelina Jolie,Marlon Brando,Julia Roberts,Gwyneth Paltrow,Tom Hanks,Halle Berry,James Cameron,Sally Field,Michael Moore,Cuba Gooding Jr,Marion Cotillard,Joe Pesci,Meryl Streep,Jack Palance,Adrien Brody,Kate Winstlet,Catherin Zeta-Jones,M", "thumbnail": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/16/08/1456152704-movies-oscar-speeches.jpg?crop=0.5xw:1xh;center,top&resize=320:*", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "sailthru.contenttype": "standard-article", "sailthru.tags": "Movies,movies,oscars,Catherin Zeta-Jones,Joe Pesci,M,Jack Palance,Sally Field,Adrien Brody,Cuba Gooding Jr.,Marlon Brando,Michael Moore,Kate Winstlet,marion cotillard,Julia Roberts,James Cameron,Meryl Streep,Angelina Jolie,Halle Berry,Gwyneth Paltrow,Tom Hanks", "sailthru.date": "2013-02-18T08:54:00Z", "sailthru.image.full": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/16/08/1456152704-movies-oscar-speeches.jpg?crop=1xw:1.0xh;center,top", "sailthru.image.thumb": "https://hips.hearstapps.com/digitalspyuk.cdnds.net/16/08/1456152704-movies-oscar-speeches.jpg?crop=0.5xw:1xh;center,top", "sailthru.socialtitle": "20 must-see Oscar acceptance speeches", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1361177640.0, "source": "https://www.digitalspy.com", "summary": ""}