{"url": "https://en.wikipedia.org/wiki/Ocean%27s_(film_series)", "text": "American heist film series\n\nOcean's Official franchise logo Based on Ocean's 11 by Harry Brown, Charles Lederer, Jack Golden Russell & George Clayton Johnson Distributed by Warner Bros. Release date 1960-present Country United States Language English Budget $350 million\n\n(Total 4 films) Box office $1.422 billion\n\n(Total 4 films)\n\nThe Ocean's franchise includes American heist films. Three films were written by Ted Griffin and George Nolfi, along with Brian Koppelman and David Levien, for each respective film. Released from 2001 to 2007, the trilogy is often cited as defining its genre and leading to a proliferation and commercialization of heist films throughout the world.[1][2]\n\nBased on the 1960 Rat Pack film, Ocean's 11, the series has seen mixed to favorable critical reception and substantial commercial success. Collectively grossing US$1.17 billion worldwide, the most commercially successful rendition was the first, Ocean's Eleven (2001). It established the ensemble cast of George Clooney as Danny Ocean, Matt Damon as Linus Caldwell, and Brad Pitt as Rusty Ryan. A long list of supporting cast members maintain the trilogy. The first sequel, Ocean's Twelve, was released in 2004 with the final film, Ocean's Thirteen, following in 2007. An all-female spin-off written and directed by Gary Ross titled Ocean's 8 was released on June 8, 2018.\n\nOrigin [ edit ]\n\nThe Ocean's film series was inspired by the 1960 heist film, Ocean's 11, directed by Lewis Milestone and starring five of the Rat Pack: Peter Lawford, Frank Sinatra, Dean Martin, Sammy Davis Jr., and Joey Bishop.[3]\n\nFilms [ edit ]\n\nOcean's Eleven (2001) [ edit ]\n\nMaster thief Danny Ocean (George Clooney), just out of prison, plans an elaborate Las Vegas three-casino-heist to win back his ex-wife, Tess (Julia Roberts). To that end, he recruits ten other thieves and con men to pull off the complex job, eventually stealing US$160 million.\n\nOcean's Twelve (2004) [ edit ]\n\nOcean's crew is blackmailed by the casino owner they stole from—Terry Benedict (Andy Garcia)—into paying him just over $198 million (their loot plus interest). The team is given two weeks to come up with the money so they travel to Europe to execute three heists.\n\nOcean's Thirteen (2007) [ edit ]\n\nOcean and his crew plan to rig a new casino's opening night to inflict ruinous losses after its ruthless owner Willy Bank (Al Pacino) double crosses one of the gang, with plans to ruin his life.\n\nOcean's 8 (2018) [ edit ]\n\nSoderbergh and George Clooney initially downplayed the possibility of an Ocean's Fourteen or subsequent sequels after Bernie Mac's death in 2008.[4] However, a new Ocean's Eleven spin-off with an all-female cast led by Sandra Bullock as the sister of George Clooney's Danny Ocean was put in development. It was conceived by producer Jerry Weintraub, Soderbergh and Clooney. Olivia Milch wrote the screenplay, and Gary Ross directed the film.[5][6] Helena Bonham Carter, Cate Blanchett and Mindy Kaling were later announced to star in the film.[7] Elizabeth Banks had previously been attached to the project, but a deal between her and Warner Bros. could not be reached.[8]\n\nThe title of the spin-off was later revealed to be Ocean's Eight.[9] In August 2016, Anne Hathaway, Rihanna and Nora \"Awkwafina\" Lum were also confirmed to join the cast.[10] The night after her Emmy win, Sarah Paulson was announced as the final cast member of the titular eight.[11] The film was released in the United States on June 8, 2018.[12]\n\nFuture [ edit ]\n\nUntitled prequel film [ edit ]\n\nIn May of 2022, it was announced that a prequel film set in '60s-era Europe is in development. The story may reportedly connect to and incorporate elements from the original film.[13] The project will not be a reboot, but will be set within the established Ocean's franchise.[14] Margot Robbie will star in and produce the project, while Jay Roach will serve as director with a script written by Carrie Solomon. Tom Ackerley, and Roach will additionally serve as producers. The project will be a joint-venture production between Warner Bros. Pictures, LuckyChap Entertainment, and Village Roadshow. Principal photography is tentatively scheduled for spring 2023.[15][16][13][17][18][19][14][20] In August of 2019, Ryan Gosling entered early negotiations to co-star in the film, alongside Robbie.[21][22]\n\nPotential sequel [ edit ]\n\nA sequel to Ocean's Thirteen had been discussed as a possibility, up until the death of Bernie Mac. However, in June 2021, Don Cheadle revealed that Steven Soderbergh had been working on the concept of a sequel film. In July of the same year, Matt Damon also expressed interest in returning to the franchise, while stating that the project is up to Soderbergh.[23][24]\n\nCast [ edit ]\n\nAdditional crew and production details [ edit ]\n\nReception [ edit ]\n\nBox office performance [ edit ]\n\nCritical response [ edit ]\n\nEach film is linked to the \"Critical response\" section of its article.", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/Ocean%27s_logo.jpg/220px-Ocean%27s_logo.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Ocean%27s_(franchise)", "title": "Ocean's (franchise)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "viewport": "width=1000", "og": {"title": "Ocean's (franchise) - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}