{"url": "https://www.usatoday.com/story/life/tv/2018/07/19/ncis-diona-reasonover-replaces-pauley-perrette-shows-lab-tech/799581002/", "text": "'NCIS': Pauley Perrette to be replaced by recurring guest star Diona Reasonover\n\nThere's a new queen of the \"NCIS\" lab.\n\nOn Wednesday, CBS announced that recurring guest star Diona Reasonover will join the cast full time as the new forensic scientist in Season 16, which went into production this week. She replaces original cast member Pauley Perrette, who left the series in May.\n\nReasonover, 26, made her debut as Kasie Hines, a grad student and trained forensic scientist that medical examiner Dr. Donald \"Ducky\" (David McCallum) met while teaching in New York, in a three-episode guest arc that began in March. Though he originally hired her to serve an assistant for a book project about past cases, he ended up bringing her back to Washington when one of those cases was reopened. After Abby (Perrette) resigned, Gibbs (Mark Harmon) hired her as a temporary replacement. That deal has now been made permanent.\n\nQueue @DionaReasonover! We are so excited to welcome you full-time to season 16 of #NCIS as forensic scientist, Kasie Hines! pic.twitter.com/zLqkM7nRxQ — CBS TV Studios (@CBSTVStudios) July 18, 2018\n\nReasonover's acting credits include Amazon's \"Transparent\" and the TBS barbershop comedy \"Clipped\" and Hulu's \"Future Man.\" She was also a writer on Hulu's Emmy-nominated political travelogue \"I Love You America,\" starring Sarah Silverman, and TruTV's \"Adam Ruins Everything.\"\n\nThe Detroit native studied at Oberlin College in Ohio and trained with improv groups like Second City Hollywood and Upright Citizens Brigade, where she impersonated Rihanna, Nicki Minaj, two \"Real Housewives\" of Atlanta and one of her show-biz idols, Whoopi Goldberg.\n\nReasonover's casting comes two months after Perrette claimed that the network had silenced her from explaining the exact reason for leaving after 15 years, hinting that a crime was involved. She also said that \"multiple physical assaults\" had taken place but didn't directly tie them to the show or network.\n\nIn a series of tweets, Perrette said had been trying to protect the show's crew and their jobs, referred to false stories being spread about her and blamed a \"very powerful publicity 'machine' \" for keeping her silent.\n\nMaybe I'm wrong for not \"spilling the beans\" Telling the story, THE TRUTH. I feel I have to protect my crew, jobs and so many people. But at what cost? I.don't know. Just know, I'm trying to do the right thing, but maybe silence isn't the right thing about crime. I'm... Just... ? — Pauley Perrette (@PauleyP) May 13, 2018\n\nThere is a \"machine' keeping me silent, and feeding FALSE stories about me. A very rich, very powerful publicity \"machine\". No morals, no obligation to truth, and I'm just left here, reading the lies, trying to protect my crew. Trying to remain calm. He did it. — Pauley Perrette (@PauleyP) May 13, 2018\n\nCBS Television Studios later said had worked with Perrette to rectify an unspecified set \"concern\" she brought last year.\n\n\"Pauley Perrette had a terrific run on NCIS and we are all going to miss her,\" the statement read. \"Over a year ago, Pauley came to us with a workplace concern. We took the matter seriously and worked with her to find a resolution. We are committed to a safe work environment on all our shows.\"\n\nPauley Perrette: Fans will need 'a couple boxes of tissues' for Abby's 'NCIS' exit\n\nMore: Perrette says she's been kept 'silent' about leaving 'NCIS,' hints at crime", "images": ["https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png", "https://www.gannett-cdn.com/-mm-/5e98cec5773282272849217615581c7f211106c7/c=0-333-1992-1459/local/-/media/2018/07/19/USATODAY/USATODAY/636675880248392010-111996-0251b.jpg?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/-mm-/67d77b70969a0c005d4a65ab900483945262d9b8/c=170-0-2830-2000/local/-/media/2018/07/19/USATODAY/USATODAY/636675880243711920-111996-0854b.jpg?width=320&height=240"], "top_img": "https://www.gannett-cdn.com/-mm-/5e98cec5773282272849217615581c7f211106c7/c=0-333-1992-1459/local/-/media/2018/07/19/USATODAY/USATODAY/636675880248392010-111996-0251b.jpg?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Jayme Deerwester"], "canonical_link": "https://www.usatoday.com/story/life/tv/2018/07/19/ncis-diona-reasonover-replaces-pauley-perrette-shows-lab-tech/799581002/", "title": "'NCIS': Pauley Perrette to be replaced by recurring guest star Diona Reasonover", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/tv/2018/07/19/ncis-diona-reasonover-replaces-pauley-perrette-shows-lab-tech/799581002/life/tv", "theme-color": "#ffffff", "og": {"type": "article", "title": "'NCIS': Pauley Perrette to be replaced by recurring guest star Diona Reasonover", "description": "On Wednesday, CBS announced that recurring guest star Diona\\u00a0Reasonover will join the cast full time as the new forensic scientist in Season 16, which went into production this week. She replaces original cast member Pauley Perrette, who left the series in May.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/5e98cec5773282272849217615581c7f211106c7/c=0-333-1992-1459/local/-/media/2018/07/19/USATODAY/USATODAY/636675880248392010-111996-0251b.jpg?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "On Wednesday, CBS announced that recurring guest star Diona\\u00a0Reasonover will join the cast full time as the new forensic scientist in Season 16, which went into production this week. She replaces original cast member Pauley Perrette, who left the series in May.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1531954800.0, "source": "https://www.usatoday.com", "summary": ""}