{"url": "www.chicagotribune.com/entertainment/tv/ct-mov-how-we-talk-about-domestic-violence-movies-0216-story.html", "text": "From left, Nicole Kidman in \"Big Little Lies,\" Angela Bassett in \"What's Love Got to Do With It\" and Farrah Fawcett in \"The Burning Bed.\" (HBO/Fox/NBC)\n\nLast week, Slate ran a story about a recently ousted White House aide and this was the headline: “Rob Porter’s History of Domestic Abuse Wasn’t a Secret. It’s Just That No One Cared.”\n\nMy mind immediately went back to a year ago, when the HBO series “Big Little Lies” premiered. I remember the preponderance of reviews — written by male critics — dismissing the show as soapy melodrama dressed up as prestige TV. And I wanted to go back and remind myself of the ways these cultural arbiters, with their influential platforms, engaged with the show’s portrayal of domestic violence.\n\nAdvertisement\n\nBecause the way we talk about fiction can influence how we view these same types of stories in real life. How we talk about movies and TV shows says something about what we value as a society — and whose stories we believe.\n\nSo let’s scroll back and refresh our memories. Among the many story threads in “Big Little Lies,” which is set amid a very white and very wealthy beachside community, is that of a glamorous woman (Nicole Kidman) married to an equally charming and attractive man (Alexander Skarsgard) who has a volatile, hair-trigger temper. He attacks her physically and mentally. Sometimes the violence involves sex. All of it happens in private, where their seemingly perfect marriage disintegrates, becoming increasingly dangerous as the season progresses.\n\nAdvertisement\n\nReviewing the show in the New York Times, Mike Hale listed the various characters and their traits, noting that Kidman plays “the abuse victim who’s reluctant to leave her husband, a subplot that’s more disturbing (than the others) but also strays into ‘Fifty Shades’ territory.” He calls the storyline “unoriginal.”\n\nOr here’s Robert Rorke, writing about the show for the New York Post: “We’re subjected to scenes of S&M sex games … which feel like the Sunset magazine version of Kidman’s other sex game movie, ‘Eyes Wide Shut.’”\n\nWhat a strange and cavalier way to write about the narrative of a woman raped and beaten by her husband.\n\nSarah Seltzer is a feminist writer and critic and — frustrated by those “Fifty Shades”/S&M references — told me, “That is just a profound misunderstanding of what’s happening on screen. And I don’t think many women viewers misunderstood what was going on. At all.”\n\nI think that’s right.\n\n“Shows that flirt with genre can be a vehicle for exploring serious issues,” she said, “and women viewers are very comfortable going back and forth between soap opera-y tropes and serious issues. How is that any different than the way ‘The Sopranos’ uses mob tropes as a vehicle to talk about American masculinity and existential despair?”\n\nI think we need to ask ourselves why there are prominent critics who don’t see domestic violence as a subject worthy of serious TV. When Hale tweeted out a link to his review, he noted that for him, watching the show “was like watching three Lifetime movies at once.”\n\nThat’s an interesting thing to say. Because on some level it’s true — Lifetime has been among the only consistent producers of TV movies willing to examine these stories. And maybe somewhere along the way we started believing that domestic abuse was tawdry fodder best suited for basic cable. What I want to know is, why aren’t critics questioning that? Why aren’t we all?\n\nAdvertisement\n\n“When people think, ‘Oh, it’s just a Lifetime thing,’ they’re thinking that only women care about domestic violence,” said Feminista Jones, a writer and activist. “They think it’s distasteful and depressing and who really wants to deal with that? But let’s get real, we’ve been talking about this since ‘The Burning Bed,’ since ‘The Color Purple,’ since ‘What’s Love Got to Do With It.’ We’ve been talking about this, that’s what frustrates me.\n\n“But as someone who looks at the cultural impact of TV and film,” she said, “what’s promising for me is that it seems like this stuff is no longer avoidable. So if anybody tries to continue to pretend that these aren’t the real and lived experiences of women, then they’re going to find resistance.”\n\nYou can count on one hand the number of studio films that address intimate partner violence. When you look at how underrepresented women — especially women of color — are in Hollywood decision-making roles, this isn’t a surprise. “Whose voices are we hearing?” as Jones put it.\n\nWhen “The Burning Bed” aired on NBC in 1984 it was a huge hit for the network. Seventy-five million viewers tuned in to watch that broadcast (it’s one of the most-watched TV movies ever made), and there was a palpable shock in seeing Farrah Fawcett playing against her fizzy “Charlie’s Angels” persona as a visibly battered wife who is ultimately pushed over the edge.\n\n“There were shelters that were flooded with calls after it aired and it was partially because of the incredible audience response,” said Diane Shoos, who is an associate professor at Michigan Technological University.\n\nShoos also is the author of “Domestic Violence in Hollywood Film: Gaslighting,” which is a close read on movies such as 1991’s “Sleeping With the Enemy” starring Julia Roberts, 1995’s “Dolores Claiborne” starring Kathy Bates and 2002’s “Enough” starring Jennifer Lopez.\n\nAdvertisement\n\n“Films about domestic violence rely very heavily on pretty standard Hollywood genres,” she said. The suspense thriller, especially. “In order for these stories to even be produced in the first place, they have to rely on this formulaic approach where we absolutely anticipate there will be a confrontation between the victim and the abuser. So the work of the narrative is to completely isolate her and make it — ironically — totally her problem that she has to solve. In a strange way these movies are seen as empowering to women but they’re not, because everything is put back on women’s shoulders.\n\n“What’s astounding,” said Shoos, “is that the prototypical narrative is for the woman to kill the abuser. And as any kind of real-life solution, this is totally fantastical and in fact dangerous; women who confront their abusers typically are attacked and killed themselves.”\n\nShoos also looks at the 1993 Tina Turner biopic “What’s Love Got to Do With It” starring Angela Bassett and Laurence Fishburne. It’s a film that stands out because of its Oscar nominations for Bassett and Fishburne, but also as a rare example of a star (Turner) allowing her story of abuse to be told on the big screen: Yes, this happened to me. It was brutal and terrifying and humiliating. And shame on every one of you who shrugged it off as celebrity gossip.\n\n“I think that movie is really complex in terms of race and class,” said Shoos. “There’s a scene where Ike abuses Tina in a diner — the cake scene — and there’s a white mother with her kids and they have this horrified look on their faces. One of the things that conveys is: These are black celebrities and there’s a white spectator on screen going, ‘Oh my God, look at what these black people are doing to each other.’ As an audience, we should want to understand how this movie can run into these racist ideas — and we have to be attentive to the fact that this might allow people to dismiss the idea that domestic violence is in fact a larger societal problem because, ‘Oh well, it’s a black musician, he took drugs — what do we expect anyway?’”\n\nThe movie experienced some pushback from black moviegoers. That was also true, Jones said, for “The Color Purple.”\n\n“The pushback from the black male community was ferocious. People lost their minds, they could not believe it. They hated the fact that their violence was being exposed by Hollywood. And they hated that Steven Spielberg — a white man — was the one who made it happen. And they hated ‘What’s Love Got to Do With It’ for the same reason. There were black women who felt empowered by that movie, but some women were also were like, ‘This is not something we should be talking about.’”\n\nAdvertisement\n\nLet’s look at how the Tribune talked about it upon that movie’s release. Here’s Clifford Terry, reviewing it for the paper as a “spirited but standard showbiz biopic, a funky updating of those pictures that Fox turned out in the '40s and '50s, although, if memory serves, Dan Dailey never slapped around Betty Grable. It is also a big-screen version of a wife-abuse Movie of the Week.”\n\nThat was written 25 years ago. And yet it’s not all that different from the casually flippant language used just a year ago in those reviews of “Big Little Lies.” What is really going on when men have so much trouble centering abused women in these stories?\n\nLongtime MTV correspondent Kurt Loder is the co-author of Turner’s autobiography “I, Tina,” on which the movie is based. Concerned about the legacy of Ike Turner’s musical contributions, Loder told The Hollywood Reporter that “the story about Ike abusing Tina reduced him to nothing more than a wife-beater in the public’s estimation.”\n\nHere’s what that says to me: The abuse happened, but how important is it really? I feel like we’ve been hearing some version of this argument one way or another lately. If you were the one abused, I’d imagine it matters quite a bit, actually.\n\nAt Ike Turner’s funeral in 2007, music producer Phil Spector disputed “the things they said about Ike that were in that piece of trash movie they made about him.” Spector himself was out on bail at the time, awaiting trial for the murder in his home of actress Lana Clarkson; she was killed by a gunshot to the mouth. Spector was ultimately convicted.\n\nThat women die at the hands of the men in their lives isn’t something movies or television really want to explore. Too ugly for a mass audience? Too real? Four years ago, Jones created an awareness campaign called “You OK, Sis?” as a bystander intervention tool for people to assist women of color experiencing street harassment. The campaign eventually grew to cover domestic violence as well.\n\nAdvertisement\n\n“I think we’ve been able to use this to highlight the number of black women and black trans women who are being killed by their partners,” Jones said. “There is this misunderstanding of how fatal domestic abuse is for black women, so whenever there’s a news story, we use the hashtag #YouOKSis? to say, ‘See? We’ve been telling you this is happening.’”\n\nHere’s how Shoos put it: “When you have a social problem like domestic violence, which is behind closed doors, what’s in these movies matters incredibly. The public conversation is still uncomfortable. Or just one that’s not as likely to happen. So what the screen is telling us is really important. It’s going to be a primary factor in forming our opinions.”\n\nThat’s what is so eerie about “Big Little Lies” — why those aforementioned reviews of the show are tied (in my mind at least) to some of the conversations about Porter.\n\nThe president, we’ve learned, was privately shocked to hear that his aide — “this clean-cut Harvard guy with the perfectly parted hair” — was capable of emotionally and physically abusing his two ex-wives.\n\nClean-cut Harvard guy with the perfectly parted hair.\n\nThat’s precisely the archetype Skarsgard plays on “Big Little Lies.”\n\nAdvertisement\n\nThe suit, the career, the haircut, all of it confers legitimacy and trustworthiness. But he is a monster when alone with his wife. “The whole show,” Seltzer said, “is playing on that theme of appearance vs. reality.”\n\nIt’s OK to not like “Big Little Lies.” It’s fine if it isn’t to your taste. You can make valid critiques about so much of it. That’s a critic’s job.\n\nBut this show was telling us something about ourselves.\n\nAnd those reviews I can’t shake? They were telling on us:\n\n“Rob Porter’s History of Domestic Abuse Wasn’t a Secret. It’s Just That No One Cared.”\n\nWell. Yes. Those reviews said as much.\n\nAdvertisement\n\nnmetz@chicagotribune.com\n\nTwitter @Nina_Metz\n\n[ 'What's Love Got to Do With It' review: Pain and triumph mark Tina Turner story ]\n\n[ When make-believe becomes all too real, what are movie audiences to make of those scenes? ]\n\n[ It's time Hollywood's male stars use their power to level playing field ]", "images": ["https://www.chicagotribune.com/resizer/GEg3tvWFpZ5ZqQ973BlfLkwKnII=/1440x1080/filters:format(jpg):quality(70):focal(1077x341:1087x351)/cloudfront-us-east-1.images.arcpublishing.com/tronc/Y2Q2EO75LNHUDALIJ7E5J763GA.jpg", "https://www.chicagotribune.com/resizer/-aMg3cEwJRHlejiViqwrYhtkgdU=/1200x630/filters:format(jpg):quality(70)/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/VNM7VDOQJJAIBMTHNYNP4AWNGM.jpg", "https://www.chicagotribune.com/resizer/yR9dobXSWmhty8GvM6yEhQSuFQI=/1440x1080/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/tronc/7WFEQGBJ4JDYVJV4S7LQZOFFWA.jpg", "https://www.chicagotribune.com/resizer/i2IrMOjBIgl4W7UwkwWWloEVR20=/800x0/filters:format(jpg):quality(70)/www.trbimg.com/img-5a839f59/turbine/ct-1518575445-qs1184mqer-snap-image", "http://www.chicagotribune.com/pf/resources/icons/Menu_Icon.svg?d=87", "https://www.chicagotribune.com/resizer/WsKl6CA3t17zMpgHI9jKTfJeYVA=/1440x1080/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/tronc/5SMGIXN5MNF5DDFJA5COD5B5WE.jpg", "https://static.themebuilder.aws.arc.pub/tronc/1657752787005.svg"], "top_img": "https://www.chicagotribune.com/resizer/-aMg3cEwJRHlejiViqwrYhtkgdU=/1200x630/filters:format(jpg):quality(70)/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/VNM7VDOQJJAIBMTHNYNP4AWNGM.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.chicagotribune.com/entertainment/tv/ct-mov-how-we-talk-about-domestic-violence-movies-0216-story.html", "title": "When women are abused on screen — and how that shapes opinions about whose stories we believe in real life", "meta_data": {"language": "English (United States), en-US", "viewport": "width=device-width, initial-scale=1", "content-id": "F3EILVHMJBCEBA67QEN3DQUX4U", "apple-itunes-app": "app-id=383137151, app-argument=http://www.chicagotribune.com/deeplinkidF3EILVHMJBCEBA67QEN3DQUX4U", "description": "How we talk about movie and TV shows that portray domestic violence says something about what we value as a society — and whose stories we believe.", "twitter": {"description": "How we talk about movie and TV shows that portray domestic violence says something about what we value as a society — and whose stories we believe.", "title": "When women are abused on screen — and how that shapes opinions about whose stories we believe in real life", "image": "https://www.chicagotribune.com/resizer/-aMg3cEwJRHlejiViqwrYhtkgdU=/1200x630/filters:format(jpg):quality(70)/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/VNM7VDOQJJAIBMTHNYNP4AWNGM.jpg", "site": "@chicagotribune", "card": "summary_large_image"}, "og": {"description": "How we talk about movie and TV shows that portray domestic violence says something about what we value as a society — and whose stories we believe.", "title": "When women are abused on screen — and how that shapes opinions about whose stories we believe in real life", "image": "https://www.chicagotribune.com/resizer/-aMg3cEwJRHlejiViqwrYhtkgdU=/1200x630/filters:format(jpg):quality(70)/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/VNM7VDOQJJAIBMTHNYNP4AWNGM.jpg", "type": "article", "site_name": "Chicago Tribune", "url": "https://www.chicagotribune.com/entertainment/tv/ct-mov-how-we-talk-about-domestic-violence-movies-0216-story.html", "locale": "en_US"}, "keywords": "Big Little Lies,domestic violence,domestic abuse,What's Love Got to Do With It,The Burning Bed", "robots": "noarchive", "distribution": "global", "rating": "general", "googlebot-news": "index", "copyright": "Copyright © 2022, Chicago Tribune", "fb": {"page_id": "5953023255,104061989632161,330360537007411,264870045299,73734231949,53310156364,40762490776,60569705796,121922684499844,182379588445160,62915602634,1987930441432108,119608021389933,745745225518281", "pages": "https://www.facebook.com/chicagotribune", "app_id": 306836229411287, "admins": 100000786395051}, "fb_title": "When women are abused on screen — and how that shapes opinions about whose stories we believe in real life", "y_key": "cee2fe4077f8d050", "msvalidate.01": "AAC9C18F70AC386BC4DCF4DDF9BF1786", "article": {"publisher": "Chicago Tribune", "tag": "Nicole Kidman,HBO,21st Century Fox,Jennifer Lopez,Julia Roberts,Steven Spielberg", "content_tier": "locked"}, "google": "nositelinkssearchbox"}, "movies": [], "publish_date": null, "source": "http://www.chicagotribune.com", "summary": ""}