{"url": "https://www.billboard.com/articles/columns/pop/7761127/lady-gaga-facetime-prince-william-mental-health", "text": "Lady Gaga joined Prince William’s Heads Together campaign to raise awareness for mental illness in a FaceTime video released on Tuesday (Apr. 18), in which the friends talked about the knocking down the stigma associated with mental health issues. “There’s a lot of shame attached to mental illness. You feel like something it’s wrong with you,” Gaga says in the video, speaking from the kitchen of her Los Angeles home.\n\nExplore Explore Lady Gaga See latest videos, charts and news See latest videos, charts and news\n\nThe Duke and Duchess of Cambridge, along with William’s brother Prince Harry lead the campaign and the Gaga video was the latest in their #oktosay series, which CNN reported shows “people from all walks of life discussing their own mental health challenges.” Gaga says in the four-minute clip that she’s a fan of the “beautiful” stories told in the series and was excited to share her own story about struggling with post traumatic stress disorder.\n\n“In my life I go, ‘Oh my goodness, look at all these beautiful wonderful things that I have, I should be so happy,’ but you can’t help it if you wake up in the morning and you are so tired and you are so sad and you are so full of anxiety that you can barely think,” she says. Williams invited Gaga to participate after he read an open letter she issued through her Born This Way Foundation in which she revealed a sexual assault at 19 that left her with PTSD.\n\n“It’s time that everyone speaks up and really feels very normal about mental health; it’s the same as physical health. Everybody has mental health and we shouldn’t be ashamed of it and just having a conversation with a friend or family member can really make such a difference,” William says from a room at Kensington Palace. “For me, the little bits that I’ve learnt so far is that it’s really important to have this conversation. You won’t be judged.”\n\nThe video’s release came one day after Harry opened up about his years of therapy to deal with the loss of his mother, Princess Diana.\n\nWatch the full video below:", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.billboard.com/wp-content/uploads/media/Lady-Gaga-nov-2016-billboard-1548.jpg?w=1024", "https://www.facebook.com/tr?id=204652553202666&ev=PageView&noscript=1", "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/public/lazyload-fallback.gif"], "top_img": "https://www.billboard.com/wp-content/uploads/media/Lady-Gaga-nov-2016-billboard-1548.jpg?w=1024", "keywords": [], "authors": ["Gil Kaufman"], "canonical_link": "https://www.billboard.com/music/pop/lady-gaga-facetime-prince-william-mental-health-7761127/", "title": "Watch Lady Gaga FaceTime with Prince William About Mental Health", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/browserconfig.xml", "msapplication-TileImage": "https://www.billboard.com/wp-content/themes/vip/pmc-billboard-2021/assets/app/icons/icon-144x144.png", "msapplication-TileColor": "#eff4ff", "description": "Lady Gaga joined Prince William's Heads Together campaign to raise awareness for mental illness in a video released on Tuesday (Apr. 18), in which the friends talked about the knocking down the stigma associated with mental health issues.", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "billboard", "pmc-page_type": "article", "articleid": 7761127, "author": "Gil Kaufman", "pmc-category": "Music,Pop", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-04-18T07:33:24"}, "title": "Watch Lady Gaga FaceTime with Prince William About Mental Health", "pageclass": "article", "pmc-is_free": "no", "pmc-always-paywall": "no", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-exclusive": "no", "pmc-breaking-news": "no", "pmc-prime": "no"}, "generator": "WordPress 6.0.2", "author": "Gil Kaufman", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Billboard", "application-name": "Billboard", "content_type": "Article", "post_id": 7761127, "title": "Watch Lady Gaga FaceTime with Prince William About Mental Health", "published_at": "2017-04-18 07:33:24", "image": "https://www.billboard.com/wp-content/uploads/media/Lady-Gaga-nov-2016-billboard-1548.jpg?w=1024", "comment_count": 0, "topics": "Pop", "body": "Lady Gaga joined Prince William's Heads Together campaign to raise awareness for mental illness in a FaceTime video released on Tuesday (Apr. 18), in which the friends talked about the knocking down the stigma associated with mental health issues. \"There's a lot of shame attached to mental illness. You feel like something it's wrong with you,\" Gaga says in the video, speaking from the kitchen of her Los Angeles home.The Duke and Duchess of Cambridge, along with William's brother Prince Harry lead the campaign and the Gaga video was the latest in their #oktosay series, which CNN reported shows \"people from all walks of life discussing their own mental health challenges.\" Gaga says in the four-minute clip that she's a fan of the \"beautiful\" stories told in the series and was excited to share her own story about struggling with post traumatic stress disorder.\"In my life I go, ‘Oh my goodness, look at all these beautiful wonderful things that I have, I should be so happy,’ but you can’t help it if you wake up in the morning and you are so tired and you are so sad and you are so full of anxiety that you can barely think,\" she says. Williams invited Gaga to participate after he read an open letter she issued through her Born This Way Foundation in which she revealed a sexual assault at 19 that left her with PTSD. “It’s time that everyone speaks up and really feels very normal about mental health; it’s the same as physical health. Everybody has mental health and we shouldn’t be ashamed of it and just having a conversation with a friend or family member can really make such a difference,\" William says from a room at Kensington Palace. \"For me, the little bits that I’ve learnt so far is that it’s really important to have this conversation. You won’t be judged.\"The video's release came one day after Harry opened up about his years of therapy to deal with the loss of his mother, Princess Diana.Watch the full video below:The Duke of Cambridge and @LadyGaga join forces to encourage more people to speak openly about their mental health #OKtosay pic.twitter.com/kCuQyS3Svn— Kensington Palace (@KensingtonRoyal) April 18, 2017", "fb": {"pages": 75791669580}, "fragment": "!", "og": {"type": "article", "title": "Watch Lady Gaga FaceTime with Prince William About Mental Health", "url": "https://www.billboard.com/music/pop/lady-gaga-facetime-prince-william-mental-health-7761127/", "description": "Lady Gaga joined Prince William’s Heads Together campaign to raise awareness for mental illness in a video released on Tuesday (Apr. 18), in which the friends talked about the knocking down t…", "site_name": "Billboard", "image": {"identifier": "https://www.billboard.com/wp-content/uploads/media/Lady-Gaga-nov-2016-billboard-1548.jpg?w=1024", "width": 1024, "height": 677, "alt": "Lady Gaga in 2016"}, "locale": "en_US"}, "article": {"published_time": "2017-04-18T11:33:24+00:00", "modified_time": "2017-04-18T18:47:09+00:00"}, "twitter": {"site": "@billboard", "card": "summary_large_image", "title": "Watch Lady Gaga FaceTime with Prince William About Mental Health", "description": "Lady Gaga joined Prince William's Heads Together campaign to raise awareness for mental illness in a video released on Tuesday (Apr. 18), in which the friends talked about the knocking down the stigma associated with mental health issues.", "image": "https://www.billboard.com/wp-content/uploads/media/Lady-Gaga-nov-2016-billboard-1548.jpg?w=1024"}}, "movies": [], "publish_date": 1492515204.0, "source": "https://www.billboard.com", "summary": ""}