{"url": "https://web.archive.org/web/20200524151047/https://www.thetalko.com/20-behind-the-scenes-secrets-of-vanderpump-rules/", "text": "Lisa Vanderpump may have been born in London, England, but the British television personality became a hit with American audiences when she starred in the reality series The Real Housewives of Beverly Hills. But fans and the network obviously loved Lisa Vanderpump so much that they gave her a spin-off called Vanderpump Rules.\n\nSo, what do fans find so enticing about the series? The juicy drama, for starters. There are romances, scandals, and rumors always making each episode of the show more and more enticing to watch. The series itself highlights what current culture is like among the rich and famous, but viewers find Lisa to be an empowering individual who happens to love the glitz and glam. She's the entire package, as she manages to be a mom, a wife, and an entrepreneur. But like any reality series, there are a lot of secrets, most of them behind-the-scenes, that fans probably didn't know about before. But you don't need to wait until a secret behind the scenes DVD comes out — you're about to get the nitty-gritty on Vanderpump Rules, and it will be so eye-opening that you'll look at the series with a deeper appreciation than you ever have before!\n\n20 The Cast Isn't Actually Working At SUR\n\nFame10.com\n\nFans of the series know that Lisa Vanderpump owns several restaurants, such as PUMP, which was named West Hollywood's \"top 100 hot spot restaurants in America\" by Open Table. But there's another restaurant she owns that is truly the bomb, and it's called SUR. If you're a die-hard fan of the show, then you're probably more than familiar with it.\n\nNow most fans would do anything to meet their idols face to face, so since the stars were often seen working in SUR, fans figured that this was the best place to spot them. It turns out that they were right, at least, for a time. During the first couple of seasons, fans were served appetizers by Stassi Schroeder, or they were served drinks by Tom Sandoval, who later went on to become an actor in the 2008 film Playing with Fire.\n\nBut the cast is either really famous, or they have gone into business for themselves. The reality is they don't exactly have time to work at SUR as servers anymore. According to Jax Taylor, who will be starring in the spin-off Vanderpump Rules: Jax and Brittany Take Kentucky, the cast only drops by SUR once in a while. In a Reddit AMA, he shared: \"The show is taking up a lot of my time right now, my businesses are taking a ton of time. When I have a chance to go in, I do.\"\n\n19 Having To Serve Fans Is Beyond Awkward At Times\n\nlifeandstylemag.com\n\nMost fans seem to forget that the cast is human, so they expect them to always look their best no matter what. In fact, when the cast served fans at SUR, the experience was also awkward. Just ask Stassi Schroeder, who did a lot of serving at the restaurant; according to LA Weekly, she said: \"You have to be photo-ready every day for work. I used to dress more casually when serving, but I can’t do that anymore because then I’m taking pictures with people with a ponytail and no mascara.”\n\nFans would often go to SUR because it was the best way to meet and interact with their favorite stars, but they kept forgetting that this was a place where people came to eat, and not a photo-op session.\n\nReality star Kristen Doute, who always got mixed up in other people's issues on the show, said: \"It can be a little bit tough. Because as much as I love the fans, and it’s so validating to know that they’re coming in just to see us and to have dinner at this restaurant just to take a photo, but it can [feel] like a caged animal in the zoo maybe with not-so-nice female fans that like to come in and have a few too many drinks.\"\n\n18 Producers Are Known For Tampering With Some Storylines\n\nMonstersandcritics.com\n\nThere's always a question in the back of fans' minds: Is reality TV real or is it all staged? While some reality shows will go the extra mile to stage a scene that will boost ratings, most shows still claim that everything is real. But producers do find ways to manipulate certain storylines that will work in the show's favor.\n\nDo you recall when Stassi Schroeder and her boyfriend, Patrick Meagher, called it quits? Well, on her podcast she kind of hinted at the possibility that the show's producers were responsible for it. \"They made me say that me and Patrick were still broken up. Patrick's not on the show,\" she said, according to Inquisitr, and added: \"I don't want to trick people.\"\n\nBut Stassi's comment wasn't the only reason viewers suspected the show was rigged. According to an anonymous Reddit user, a cast member allegedly stated that some producers would come up with storylines for the reality show: \"A cast member from Vanderpump Rules gave an example of she was told she was filming a brunch at a nice place with another cast member. She was told to dress up. The day of filming, they asked her to stop by her boyfriend's apartment to pick up mail. They only showed her showing up to the ex-boyfriend's to pick up mail dressed up. Does this seem likely? Are the story producers intentionally keeping people in the dark for more on-air drama?\"\n\n17 Even If You Wanted To, You Just Can’t Work At SUR\n\nBustle.com\n\nThey say that it's important to have contacts if you want to make it in this world. Well, if you want to work at SUR, you have to follow the same philosophy, according to the staff. As told in The List, Stassi Schroeder stated: \"Everyone who starts working there is either a friend of a friend or they know someone. We never really hire anyone who walks off the street and hands in a resume. I had friends who were working there, and I was always coming in for drinks, and I just figured I might as well work here. I'm here all the time.\"\n\nJax Taylor owed his job at SUR to Stassi, whom he claimed helped him land that job; he also said that landing a role in Hollywood would seem like cake compared to getting a job at SUR.\n\nJax said, according to The List: \"It sounds weird, but it's actually harder to get a bartending job in this town, then it is an acting job. It's extremely difficult.\" Even if you have experience as a bartender, they're not likely going to bat an eyelash when they look at your resume. Jax adds: \"They don't care what your experience is. It's sad to say, but it goes on a looks thing. It's basically, Can we get a headshot? We don't care where you've served before. Can we just have a headshot?\"\n\n16 They Barely Made Any Cash On Season One\n\nPrettystatus.com\n\nLife as a reality star isn't always easy, especially when a show is just starting off. Just ask the stars of Vanderpump Rules. Everyone would make $5,000 for the entire first season. Of course, the only one who wasn't earning a small paycheck was Lisa Vanderpump, but then again, she had just spun-off from The Real Housewives of Beverly Hills, so her star-status was already set in stone. She didn't need to validate her reasons for earning those Big Boss-Lady Benjamins.\n\nEventually, the network saw that the series was bringing in huge ratings, so before season 2 began, the cast had a few stipulations. For starters, they wanted more money, and they also wanted to fly first class when they traveled. Bravo couldn't risk the stars walking out, so they started paying each of them $3,000 per episode during season 2.\n\nBy season 3, that amount went up to $5,000 per episode. But if you're wondering if they got their first-class seats, the answer would be no. The cast still had to fly coach and they believed that the reason Bravo turned down this particular flight incentive was so that the bartenders and servers who moonlighted as reality stars wouldn't lose their working-class aura in the eyes of the viewers. That's pretty clever!\n\n15 Stassi Isn't New To Reality TV\n\nHeavy.com\n\nStassi was on two other reality shows before Pumps. It seems that being a reality star was always Stassi's dream. In 2005, she appeared on The Amazing Race: Family Edition, when she was a teen. She only made it to 7th place and Stassi remembers the loss well: \"I remember why we lost — because my family didn't listen to me. Because I'm always right! If they just would've listened to me!\" Stassi said, according to The List. And she also pointed out that her father has asked her to use her influence to get them back on the show, but she responded: \"You didn't listen the first time. Absolutely not. Unless you're willing to make me the boss.\"\n\nIn 2008, she was on the reality show Queen Bees, which put seven women together in a house to participate in challenges that would promote teamwork and help resolve conflicts, teaching the girls how to respect each other better.\n\nAs far as her views on reality TV, she told ET: \"I never like to blame things on editing. I don't like when people do that. Everything that you're seeing did come out of my mouth. You're just not seeing all of it. Reality TV, by definition, you can’t make it fair.\"\n\n14 Scheana Marie Didn't Plan To Be On The Show\n\nTheWrap.com\n\nReality star Scheana Marie was in a totally different place back when the reality series first started. She had set her goals on a huge acting career, and Vanderpump Rules wasn't exactly what she had in mind.\n\n\"I was really against doing it at first as I didn't want to be known as a reality star trying to be an actor, or trying to be a singer,\" she said, according to The List. In other words, reality stardom was beneath her and more importantly, it could have ruined her chances of getting an actual acting role. It seemed that Scheana's mind was made up, but the producers of the series weren't willing to give up on her that easily: \"So I wasn't all about it until I sat down with the producers and they talked about what a career driven show it was and how it would focus on us following our own career paths too, and then I was really excited to do it.\"\n\nScheana Marie went on to shine as one of the stars of Vanderpump Rules, but she only made minor guest appearances on shows like the CW's 90210, Victorious, and Femme Fatales. She also starred in the 2015 film Mouthpiece as Maria. But so far, Vanderpump Rules has been the only onscreen gig that afforded her a steady paycheck.\n\n13 Most Of The Cast Gets A Little \"Prescription Help\" To Perform\n\nPinterest.com\n\nThe cast loves to party sometimes, and all that fun usually continues until everyone can't stand on their own feet. But if you're wondering how they still manage to get up in the morning to face the day and their jobs, it's simple. They use a little \"prescription help\" to stay focused. In fact, Kristen Doute and Stassi Schroeder have admitted to this.\n\nStassi, who appeared on Brandi Glanville's podcast, claimed that this helped keep her from falling asleep from exhaustion, and apparently, she wasn't the only one to have used prescriptions to combat fatigue and other symptoms caused by having a little too much fun.\n\nBut it's easy to get used to something that helps you to function effectively throughout the day, so in her podcast Straight Up with Stassi, she explained that it was thanks to her ex-boyfriend, Patrick Meagher, that she was able to wean off the prescriptions.\n\nMeagher also helped her when she moved to LA because her credit was a mess and she needed someone to co-sign. According to Inquisitr, Stassi stated: “We shall see. I need to use him for his credit though. Not use him as in 'use him' but I need his credit, to co-sign for me or something.\" This just proves that the cast of Vanderpump Rules is indeed human after all.\n\n12 Apparently, The Girls Sided Together Before The Reunion\n\nbravotv.com\n\nAccording to Tom Sandoval via The List, a couple of his female co-stars formed an alliance to keep each other safe before season four's reunion episode started filming. He stated: \"We're in those chairs for a total of nine and a half hours. In that entire time, not a single time did Stassi, Scheana, Katie [nor] Kristen have a single disagreement with each other. Anytime anything was said about any one of them, you had to talk to at least two of them.\"\n\nThe staff of SUR is often plagued with drama, and in some cases, scandals, but certain things were kept off the proverbial table and Sandoval openly spoke about this alliance after the season four reunion aired, and he insinuated that his co-stars were very good at strategies, especially before the reunion special, which often becomes a venue for lots and lots of drama. But he felt that the things that should have been dealt with on the spot during the reunion, hadn't been, and worst of all, he had been kept out of the loop. \"They met the day before and hung out so obviously they had some sort of alliance or agreement or whatever,\" he shared, via The List. \"Things need to be called out and addressed and I felt like at times that I was the only one who did it.\"\n\n11 Scheana Dated Jon Mayer\n\nSlice.com\n\nThere's something Scheana should have known back when she was dating John Mayer: he clearly doesn't like the people he's seeing to talk to the press about their relationship.\n\nMayer has been vocal about the difficulties of dealing with relationships and the media circus that comes from being a celebrity. In fact, when he was dating Jessica Simpson, he recalls getting sick from all the attention the media was giving his relationship. According to Men's Health, he said: \"I got so many tension headaches just from magazine covers. Real tension headaches, from the mention of my name with someone else's name and how people felt about that. Literal physiological responses where I was like, Oh my God, oh my God, oh my God, oh my God.\"\n\nBut in 2009, Mayer had a fling with Scheana, until she decided to speak candidly to the media about their relationship, which is when he chose to jump ship.\n\nBut Scheana wasn't sure what had happened at first, because he started ghosting her but she didn't know why. Then, while she was at the Catch Boutique Launch event in LA, she had a psychic read her tarot cards, and the psychic warned her about her recent love choices, which Scheana assumed referred to how she spilled too much about her relationship with Mayer. Turns out, she was right.\n\n10 There Are Countless Rumors That The Show's Scripted\n\nBravotv.com\n\nSome of the cast members have allowed their proverbial laundry to air out in front of the cameras, which has definitely entertained the heck out of viewers. But some of the ongoing drama has led people to assume that the show might be fake.\n\nThe show's spin-off Vanderpump Rules: Jax and Brittany Take Kentucky has shown that the relationship between Jax Taylor and his girlfriend, Brittany Cartwright, isn't always smooth sailing. But to call the show \"fake\" would be an exaggeration, as told by Jax himself. According to In Touch Weekly, Jax claims: \"I pride myself on [the fact that] we have a real show and I’m not going to sit there and sugarcoat things.” He continues:“With cameras there or not, this is how I am. Do I regret some things? Yeah, of course. I wish I didn’t talk to Brittany the way I did.\"\n\nTom Sandoval is another cast member who denies the fact that the show is scripted because he also has real-life issues in his relationship with Ariana Madix. In some instances, Sandoval and Madix have had heated discussions, and he even admitted that he's behaved in ways that no one would intentionally want to behave in front of the camera. \"I kind of caught myself off-guard and the way I spoke to her was uncalled for,\" he claimed.\n\n9 Jax Didn't Plan On Becoming A Reality Star\n\nBravotv.com\n\nJax Taylor wanted to do other things with his life. As a matter of fact, his major career goal was to head back home and become a firefighter. \"If it wasn't for, I'd have to say Stassi Schroeder and Lisa Vanderpump, I'd be in Florida right now fighting fires,\" he said, according to The List.\n\nOddly enough, he fits perfectly with the scandalous lives of Beverly Hills' elite group.\n\nHe's been involved in all sorts of controversy since he first appeared on the show, like the fact that he has struggled with the basic concept of monogamy, much to the shock and sorrow of his girlfriend Brittany Cartwright. Then again, Jax did flirt with Britney while he was dating someone else, but his eventual relationship with Brittany didn't go as smoothly as viewers intended.\n\nHis inability to stay faithful to Brittany was revealed by Scheana and Ariana who knew the kind of man he was. Of course, there was no way he was going to own up to what he had done. But eventually Faith Stowers, a server working at SUR posted on Instagram that she had been involved with Jax, and he had no choice but to own up to his mistake. At this point, it sounded like life as a firefighter would have been a lot less complicated.\n\n8 Katie Is Actually Low Maintenance\n\nEtonline.com\n\nYou would think that a gal like Katie Maloney, who has her own beauty blog called Pucker & Pout, would be one of those girls who loves to look perfect all the time. You'd also assume that more often than not, she'd pack layers of makeup, using tons of hair products, taking hours and hours to be ready. But you'd be wrong! It turns out that she's not high-maintenance at all.\n\n\"That's what dry shampoos are made for,\" she said, according to Glamour. In fact, she'll typically shampoo once a week, and that's it because she's not a fan of over-washing. She also credits her amazing hair to her ancestral roots: \"Luckily I'm Italian and blessed with really thick hair.\" Plus, she's not into buying products for the sake of it, particularly when you can DIY at home. She's so crafty that she even makes shaving cream using aloe vera gel and olive oil. \"You just whip it up and it works as well as any other product you can find,\" she said to Glamour.\n\nShe's also learned that HD cameras and a lot of caked up makeup don't always make her look good, either. \"Those cameras will pick up everything. High-def is nobody's friend. There are times I tried hairstyles in person that looked cool, but on camera, they looked a little off. I've learned to keep it really simple, whether it's just straightening my hair or putting a loose wave in it. As far as makeup, it's about keeping it very simple because too much can look muddy. I'll use a tinted moisturizer or a very sheer foundation.\"\n\n7 There Are Two Huge Relationships That Won't Last\n\nLifeandstylemag.com\n\nWhen the season six premiere of Vanderpump Rules aired, viewers learned that Stassi Schroeder had gotten back together with Patrick Meagher. But it seemed like she and Meagher just weren't meant to be an item.\n\nAccording to Daily Mail, Stassi claims that “Once you try twice, like really give it two really good shots, you know? You’re not supposed to be together.\"\n\nOf course, that didn't mean that she wasn't ready to get back on the horse. Stassi started dating Shep Rose, but she claimed, according to Daily Mail, that they were just friends. \"You know, he’s wonderful, he’s handsome and charming and witty and all that stuff, and I enjoy every time we get to hang out,” she said about Rose. Now she's found love again with her new boyfriend, Beau Clark, and she has posted photos of them together on Instagram.\n\nAnother relationship you won't likely see again is Scheana Marie and Rob Valetta. Scheana dated her old flame shortly after she and Michael Shay got divorced. But while their history together made it seem like Valetta was more than a rebound, they eventually broke up, and not in the best of terms since she implied that he was \"all about himself all the time.\"\n\n6 Kristen's Creating An Anti-Stalking Guide\n\nTheinquisitr.com\n\nKristen Doute is like a female version of Sherlock Holmes. She loves to investigate, especially when it comes to finding out whether or not the person she's dating is being faithful or not. But investigating has become sort of like a craving, and her current boyfriend, Brian Carter isn't making it easy. \"I love to investigate. It’s like my favorite thing, especially on social media, and I have a faithful boyfriend who does not fill that void.” But that's what you get when you have a loyal significant other. Ironically, this hasn't stopped Doute from working on a guide to help women to follow their instincts and check-up on their men to see if they are in fact seeing someone on the side. After all, she's an expert on the subject because her relationships with Tom Sandoval and James Kennedy didn't exactly end well.\n\nIronically, there was a rumor that she and her ex, James Kennedy had spent some quality time getting reacquainted while they were on vacation in Mexico. Of course, the person who started the rumor in the first place has the reputation of being a Casanova, so most viewers would agree that he shouldn't talk. But despite the petty rumors that circulated in 2018, Kristen and Carter have remained together. And she also considers her relationship with Carter to be a mature, adult relationship, so she has no reason to snoop through his phone.\n\nYou go, girl!\n\n5 Kristen's A Vegetarian With Her Own Blog\n\nInstagram / @Kristendoute\n\nKristen Doute is a vegetarian, so taking her out to Park's BBQ, one of the best Korean BBQ places in LA, would not be wise. Too bad Tom Sandoval didn't know this during season 2 when he took her out to Park's, which led to an evening where Doute's stomach probably growled all night.\n\nBut Doute is now living a happier life with someone else and she even started her own lifestyle blog intended for vegetarians like her, which she calls Vegiholic.\n\nThe blog offers all kinds of delicious recipes for vegetarians, as well as tips. But this deep love and affection for veggies isn't something that just popped into her head. She's been a vegetarian for over 22 years. \"I was 11 years old. I was in sixth grade. I wanted to be a marine biologist, and I wanted to save all the animals and I couldn’t imagine eating these animals anymore. I made the decision overnight, and that’s it,\" she said, according to Bravo TV.\n\nAs a vegetarian, Doute offers tips on how to live this healthy lifestyle, especially when you're dating someone who isn't like her. \"This isn’t a website that’s for vegetarians only. My boyfriend Brian Carter, he eats meat, but we’re living together and obviously I’m not going to cook that way. He’s found a much healthier lifestyle through me. The same with all of my friends.\"\n\n4 Jax Used To Share An Apartment With Channing Tatum\n\nPinterest.com\n\nWhile playing a game called \"Two Truths and a Jax\" with host Andy Cohen on Watch What Happens Live, Jax Taylor revealed that long ago he and Magic Mike actor Channing Tatum were roomies in New York. \"Yeah, he was my first roommate in New York when I first started modeling,\" said Taylor, according to Bravo TV. Of course, he also shared some photos of his modeling shoots from back in the day on his Instagram: \"Ahhh the good old days, Miami one of my first jobs with @cosmopolitan thanks for always hiring me!! #malemodel #retired\".\n\nObviously, Taylor and Tatum's paths took two completely different routes, because while Taylor is known for his antics on Vanderpump Rules, Channing is known for some major box office hits like 21 Jump Street and White House Down.\n\nBut that's okay because Jax hasn't exactly done too bad for himself. Aside from having starred on Vanderpump Rules, he also got his own spin-off Vanderpump Rules: Jax and Brittany Take Kentucky. He's also popped up on Desperate Housewives as an extra at a dance club, but he was uncredited in that role. Oh, and there's also that brief appearance he made in Sharknado 4: The 4th Awakens. He played guardsman #2. If you blinked, you probably missed him.\n\n3 Scheana And Tom Actually Appeared On 'The Hills'\n\nBravotv.com\n\nLong before Lisa Vandepump took Scheana Marie and Tom Sandoval under her wing at SUR, these two seemed destined to become reality stars. But many viewers of Vanderpump Rules don't realize that they had made their first appearance on MTV's The Hills alongside other major reality stars, like Brody Jenner, Kristin Cavallari, and Lauren Conrad. As a matter of fact, according to Inquisitr, Scheana recalled: \"It was fun. I only shot a couple times with them, but it was completely scripted. We knew the scene before we filmed it. So fake, but still fun! Haha.\"\n\nBut Scheana's appearance on the show wasn't huge. She was actually friends with Stacie the bartender, which is how she ended up being featured on the reality series.\n\nLike Scheana's role on the show, Sandoval's appearance was also one of those guest spots that you had to strain yourself to even notice.\n\nTom Sandoval also remembers how his appearance on the show got him lots of attention, but mainly because he wasn't wearing a shirt while he appeared on The Hills at a casting call for Teen Vogue during season 1, episode 8. \"I get tweets about it all the time,\" he said.\n\n2 Bravo Execs Didn't Actually Believe In The Show\n\nComplex.com\n\nVanderpump Rules may have gone on to become one of Bravo's biggest hits, but when the show was still in the early stages of production and development, many of the head honchos didn't have a lot of faith in the series.\n\nAccording to Bravo TV, Vice President of Current Production Ryan Flynn said: \"We knew there was something really interesting and special about. But I think the biggest concern in the halls of Bravo with Vanderpump Rules that first season is we are a network that's known for showing sort of exclusive luxury, you know, people, places, houses that the average viewer never gets a view into and loves it. They love that exclusive look into a world that they don't have access to, and we were turning our cameras on to cocktail servers, hostesses, and bartenders with apartments that have cottage cheese ceilings and window air conditioning units, something like a lot of places we've all lived in our 20s.\"\n\nOf course, when the network execs needed an extra push to start supporting the show, it was Lisa Vanderpump herself who convinced them that they had bet on the right horse. And as always, it turns out that Vanderpump was right all along.\n\n1 The Cast Likes To Talk About The Show A LOT\n\nManrepeller.com\n\nAnyone who thinks that the show might be scripted is way off because the cast was already in each other's lives before Vanderpump Rules.\n\nSo technically, the way they behave towards each other in front of the cameras is pretty much the way they behave towards one another when they're not filming.\n\nKatie Maloney, who has endured a lot of awful comments from fans over the course of the series — who, you might recall, fell through a plate-glass skylight — pointed out that, according to In Touch Weekly: \"It’s pretty not-scripted, you see our relationships are real. We all have our history. There are plenty shows out there that are kind of casted in ways where people don’t have any kind of history prior. But it's also hard when making a show as they can’t show everything and they don’t show everything that’s positive but they definitely show everything that’s negative and that can paint people in certain lights that aren’t true to form but it's still is real.\"\n\nKristen Doute, who came between Jax Taylor and Stassi Schroeder — ruining her relationship with Tom Sandoval in the process — said: \"I understand why fans say “There’s no way that this can be real,\" but I’ve known these people for so many years. I dated Tom for six years and the show's only been on a couple of years. It just kind of happens.\"\n\nReferences: Bravo TV, Wiki Lisa Vanderpump, Wiki Vanderpump Rules, LA Weekly, Fox , People, Betches, Reddit, Life And Style, Daily Mail, Inquisitr, TMZ, e!, Wiki, Stassi, Life And Style Scheana, E! Interview, Men's Health, Celebitchy , In Touch, Bravo TV article, Screen Rant, The List, Glamour, US Mag, Reality Blurb, Bustle, Bustle, Too Fab, Bravo TV , E!, Bustle , Glamour\n\nShare Tweet Email Share", "images": ["https://web.archive.org/web/20200524151047im_/https://q.quora.com/_/ad/91f52889f6a04390a65ad2591c5 d9986e/pixel?tag=ViewContent&noscript=1", "https://web.archive.org/web/20200524151047im_/https://www.thetalko.com/public/build/images/bg-logo-full-colored-light.2bae128a.svg", "https://web.archive.org/web/20200524151047im_/https://static0.thetalkoimages.com/wordpress/wp-content/uploads/2018/05/18_99.jpg", "https://web.archive.org/web/20200524151047im_/https://www.thetalko.com/public/build/images/tv-logo-full-colored-light.8d65e7f9.svg", "https://web.archive.org/web/20200524151047im_/http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1", "https://web.archive.org/web/20200524151047im_/https://www.thetalko.com/public/build/images/mm-logo-full-colored-light.53763959.svg", "https://web.archive.org/web/20200524151047im_/https://www.thetalko.com/public/build/images/re-logo-full-colored-light.4b543c53.svg"], "top_img": "https://web.archive.org/web/20200524151047im_/https://static0.thetalkoimages.com/wordpress/wp-content/uploads/2018/05/18_99.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20200524151047/https://www.thetalko.com/20-behind-the-scenes-secrets-of-vanderpump-rules/", "title": "20 Behind-The-Scenes Secrets Of 'Vanderpump Rules'", "meta_data": {"robots": "max-image-preview:large", "viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "description": "The series itself highlights what current culture is like among the rich and famous.", "og": {"title": "20 Behind-The-Scenes Secrets Of 'Vanderpump Rules'", "type": "article", "image": {"identifier": "https://web.archive.org/web/20200524151047im_/https://static0.thetalkoimages.com/wordpress/wp-content/uploads/2018/05/18_99.jpg", "width": 1200, "height": 628}, "url": "https://web.archive.org/web/20200524151047/https://www.thetalko.com/20-behind-the-scenes-secrets-of-vanderpump-rules/", "locale": "en_US", "description": "The series itself highlights what current culture is like among the rich and famous.", "site_name": "TheTalko"}, "article": {"published_time": "2018-05-25T22:00:32Z", "section": "Entertainment"}, "fb": {"app_id": 1470061169975403}}, "movies": [], "publish_date": 1527285632.0, "source": "https://web.archive.org", "summary": ""}