{"url": "https://web.archive.org/web/20180517203012/http://24trueinfoamerica.com/breaking-60-people-just-found-dead-in-ohio", "text": "The death toll in one Ohio town continues to rise as 60 people were just found dead overnight and emergency crews can’t keep up with the calls that continue to pour in. President Trump had warned of what was coming to prevent these deaths and now it’s time to take urgent action as he’s announced in a shocking message to Americans.\n\nWith all the focus recently being on Chicago and the immense amount of shooting deaths there are in that war zone every day, a bigger issue has presented itself just a couple states away in Ohio. The Cuyahoga County Medical Examiner has confirmed that 60 people died in February from the same alarming cause, which brings the total deaths from this to 109 this year for just this one small part of Ohio. However, the issue is widespread across the country and only getting worse, which is why Donald Trump wants to do something about it now.\n\nFatal drug overdoses now surpass car deaths in America thanks to the increased use, availability, and abuse of heroin, fentanyl or a combination of the two that come into the country from wide open borders and unchecked immigrants. With each month comes a new record number of deaths from this drug not just in Ohio, but nationwide.\n\n“February’s number could increase because seven cases are still awaiting further toxicology testing. Of the fatalities last month, 36 were Cleveland residents,” Fox 8 reported. Trump is well aware of the opioid epidemic that claimed 52,000 lives in 2015, which was the most amount of overdoses in a single year in U.S. History. This is part of the reason he’s wanting to crack down so hard on the border.\n\nDuring his joint address to Congress on Tuesday, the President said that he will build “a great, great wall along our southern border” — in part to dramatically slow the flow of narcotics pouring into the U.S. at an “unprecedented rate.” “Our terrible drug epidemic will slow down and ultimately stop,” Trump promised in his speech, Vox reported. Although a wall won’t stop it completely, he’s the first to address the epidemic that’s gotten worse while it was ignored the last eight years.\n\nWhile Trump was criticized for his comment that the wall would stop the flow of drugs, it’s a step in the right direction and he’s at least ready to do something about it, whereas his predecessor was not. America does not need more of what comes in illegally over the border, whether it’s people, drugs, or both.\n\nJoin America’s Patriots Media And Share This Article Now!\n\nSource: http://www.independent-reports.com", "images": ["https://web.archive.org/web/20180517203012im_/http://24trueinfoamerica.com/wp-content/uploads/2018/05/5-18-696x371-80x60.jpg", "https://web.archive.org/web/20180517203012im_/http://24trueinfoamerica.com/wp-content/uploads/2018/05/sdfgsdfgsdfgsdgd-696x385-1-80x60.png", "https://web.archive.org/web/20180517203012im_/http://24trueinfoamerica.com/wp-content/uploads/2018/05/cropped-6-2-america-flag.png", "https://web.archive.org/web/20180517203012im_/http://24trueinfoamerica.com/wp-content/uploads/2018/05/call-640x379.jpg"], "top_img": "https://web.archive.org/web/20180517203012im_/http://24trueinfoamerica.com/wp-content/uploads/2018/05/call-640x379.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20180517203012/http://24trueinfoamerica.com/breaking-60-people-just-found-dead-in-ohio", "title": "BREAKING: 60 People Just Found Dead In Ohio", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "og": {"locale": "en_US", "type": "article", "title": "BREAKING: 60 People Just Found Dead In Ohio - TRUE AMERICANS", "description": "The death toll in one Ohio town continues to rise as 60 people were just found dead overnight and emergency crews can’t keep up with [...]", "url": "https://web.archive.org/web/20180517203012/http://24trueinfoamerica.com/breaking-60-people-just-found-dead-in-ohio", "site_name": "TRUE AMERICANS", "image": {"identifier": "https://web.archive.org/web/20180517203012im_/http://24trueinfoamerica.com/wp-content/uploads/2018/05/call-640x379.jpg", "width": 640, "height": 379}}, "article": {"section": "USA News", "published_time": "2018-05-13T13:33:50+00:00"}, "twitter": {"card": "summary_large_image", "description": "The death toll in one Ohio town continues to rise as 60 people were just found dead overnight and emergency crews can’t keep up with [...]", "title": "BREAKING: 60 People Just Found Dead In Ohio - TRUE AMERICANS", "image": "https://web.archive.org/web/20180517203012im_/http://24trueinfoamerica.com/wp-content/uploads/2018/05/call-640x379.jpg"}, "generator": "WordPress 4.9.5", "ca_title": "BREAKING: 60 People Just Found Dead In Ohio", "ca_image": "http://24trueinfoamerica.com/wp-content/uploads/2018/05/call-640x379-150x150.jpg"}, "movies": [], "publish_date": 1526218430.0, "source": "https://web.archive.org", "summary": ""}