{"url": "https://www.cosmopolitan.com/uk/entertainment/a22662327/nick-jonas-priyanka-chopra-relationship-timeline/", "text": "From their first moment together at the Met Gala in 2017 to their epic three-day wedding in 2018, we decided to take a deep-dive into Nick Jonas and Priyanka Chopra's v romantic relationship, starting with the most recent update.\n\n\n\n23rd July 2022 - Nick and Priyanka share first proper photo of baby daughter Malti\n\n\n\nCan you believe it's been six whole months since Nick and Priyanka welcomed baby Malti into the world? The pair marked the little one's milestone by sharing the first proper photo of Malti with fans - and it's so sweet!\n\nPriyanka took to Instagram to post a set of pics from her 40th birthday celebrations in Mexico, throwing in some from Malti's six-month birthday too. Scroll through to the second slide and you'll see Nick and Priyanka posing with Malti, who's seen wearing a pink tutu and \"6 months\" t-shirt. Nick can also be seen holding a cake with the words, \"Happy 6 months bday MM.\" Adorable!\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nElsewhere in the post, we can see Priyanka, Nick and friends thoroughly enjoying the celebrations, with Priyanka gushing about Nick in her caption. She wrote, \"The most incredible celebrations, planned and executed to perfection by my ♥️ @nickjonas. Words are not enough to thank you for the most memorable birthday… you really know how to love baby. I’m a lucky girl 💕.\"\n\nObsessed with these two!\n\nHere's the rest of Nick and Priyanka's relationship, from the heart eye emojis to the wedding and welcoming their first child together...\n\n1st May 2017\n\nNick and Priyanka first spark dating rumours when they show up at the Met Gala together. Fans are quick to agree that these two beautiful people would make a dreamy couple, but there's no confirmation that they are official. In an interview following the event, Priyanka coyly explains that their joint appearance was down to the fact that they were both wearing Ralph Lauren. On Jimmy Kimmel Live! that week, she added: \"Yeah, we were on the same table and we already know each other. So he was like 'Hey, you wanna go together?' And I was like yeah, OK, let’s go together. It ended up working out.\"\n\nAt the Met Gala 2017 Getty Images\n\nMay 2018\n\nA year later, US Weekly reports that the pop singer and Quantico actress are dating when they are spotted together on three occasions over the Memorial Day weekend. The first sighting is at the Beauty and the Beast Live concert at the Hollywood Bowl, followed by a date at a Los Angeles Dodgers game the next day. An onlooker tells E! News: \"They were both very happy and smiley and seemed to really be enjoying each other's company. They didn't show any PDA, just talking and laughing a lot.\" The same weekend, they are photographed cuddling up on a yacht.\n\n\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n3rd June 2018\n\nNick is caught leaving super-cute comments on Priyanka's Instagram. He writes: \"That smile\" with a heart emoji. Yes, a HEART EMOJI!\n\n\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nShe returns the compliment by commenting on a photo Nick shared of his interview with DJ Mustard. She picks these two emojis: \"💕🔥.\"\n\n\n\nInstagram\n\n8th June 2018\n\nThe lovebirds are photographed at JFK airport in New York. It turns out they are taking a big step in their relationship when it's confirmed Nick was taking Priyanka to his cousin's wedding in New Jersey.\n\nThe couple were spotted at JFK airport in June Gotham Getty Images\n\n23rd June 2018\n\nIt looks like the relationship is getting even more serious when the couple are seen arriving in Mumbai together. Priyanka reportedly takes Nick to meet her mum, Madhu, and the pair are pictured attending a friend's pre-engagement party.\n\nAt the pre-engagement party of Akash Ambani and fiancee Shloka Mehta Getty Images\n\nDuring the trip, they make things Instagram official with an Insta Story of Chopra walking towards Nick across a balcony. Nick posts the clip along with the smiley face emoji - with the very telling hearts for eyes.\n\n16th July 2018\n\nNick and Priyanka go on a double date with Joe Jonas and his fiancée, Game of Thrones star Sophie Turner, in London's Mayfair. Kevin Jonas fifth wheels.\n\n\n\nLeaving dinner at 34 Mayfair in London Getty Images\n\n27th July 2018\n\nHas she said yes?! The couple are reportedly engaged after a whirlwind romance, a source tells People. An insider says Nick proposed to Priyanka with a Tiffany & Co engagement ring while they were in London for her 36th birthday. Neither side confirms the news. We wait patiently for a glimpse of the ring.\n\n5th August 2018\n\nPriyanka is spotted at Nick's concert in Singapore. Twitter user @jjinwoos is one of several fans who shared footage of the actress dancing and cheering in the front row. If this doesn't scream wedding bells, then what does?\n\n10th August 2018\n\nNick opens up about wanting to start a family, and we can only imagine he means with Priyanka. How exciting!\n\n“[Having a family of my own] is the goal,” Nick told Cosmopolitan US at his new fragrance collaboration JVxNJ with designer John Varvatos. “It’s definitely something that I hope will happen.”\n\n\n\nAnd the very same day, he appeared to confirm his and Priyanka's engagement. An eyewitness at the same event saw a fellow partygoer congratulate Nick on his engagement, who responded \"Thanks, man.\"\n\nNow if that's not confirmation, then I don't know what is.\n\n15th August 2018\n\nOh hey, Priyanka! Is that a massive engagement ring you're showing off in your selfie with Raveena Tandon? Some fans definitely think so - and it sure looks like it!\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n17 August\n\nNick's parents, Denise and Paul, arrive in Mumbai to meet Priyanka's mum and dad, Madhu and Ashok, who are throwing an engagement party for the couple.\n\nA source recently told E! News: \"It's a tradition for them to meet before the wedding and Priyanka's family insisted on hosting the Jonas family in their country.\n\n\"Priyanka wants everything to be traditional to respect her family's values, and definitely an Indian wedding. All of the plans are moving quickly and Priyanka and Nick do not want to have a long engagement.\"\n\n18th August 2018\n\nNick finally confirms the couples engagement with the cutest Instagram caption: \"Future Mrs. Jonas. My heart. My love.\"\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nPriyanka posts the same picture with the caption: \"Taken.. With all my heart and soul..\"\n\n18th August 2018\n\nPriyanka takes to Instagram to share pictures from the couples traditional engagement ceremony in Mumbai.\n\n18th August 2018\n\nPriyanka's future sister-in-law -Sophie Turner - posted the cutest Instagram about how excited she is to welcome Priyanka into the fam.\n\n\"First I’m blessed with an incredible future brother-in-law, and now such an beautiful, inside and out, future sister-in-law. I’m so excited to welcome you into the family @priyankachopra . I love you both @nickjonas.\"\n\n\n\n18th August 2018\n\nNick's brother Joe also took to Instagram to congratulate the couple with the sweetest message, and can we just be a part of this family already?\n\n\"I couldn't be happier for my brother. Welcome to the family @priyankachopra We love you\"\n\n21st August 2018\n\nNick shares a video on Instagram of Priyanka dancing, along with the caption, \"St. Catherine Orphanage today. My heart is full.\"\n\n31st August 2018\n\nA clip emerges of Nick and Priyanka's mums dancing together, as Madhu Chopra teaches Denise Jonas some traditional desi moves. So cute!\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n2nd September 2018\n\nNick takes to Instagram to share a scenic photo that Priyanka took of him while on a romantic holiday together in the Mammoth Mountains in California.\n\nPrinyanka also posted a snap of the mountain getaway, describing it as \"magical.\" We're very jealous right now.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n4th September 2018\n\nNick and Olivia in 2015 Kevin Mazur/BMA2015 Getty Images\n\nNick Jonas's ex-girlfriend Olivia Culpo is asked what she thinks about his \"lightning-fast engagement\" to Priyanka Chopra, and has the most respectful response.\n\n\"I think that any time anybody can find love, especially in this industry, because it's difficult, you can see there's a track record of things not working out,\" Olivia told People when put on the spot about Nick's big news. \"So I'm so happy for him.\n\n\"I wish that everybody can find love and happiness. That does not mean that I would not wish that for him.\"\n\nThe pair dated for almost two years, after meeting in 2013 and parting ways in 2015, with Nick commenting to Extra at the time, \"She’s an amazing person. We had a great, beautiful few years together, but it’s been a crazy couple months, and I wish the best to her for the future, but it’s tough.\"\n\n5th September 2018\n\nNick and Priyanka double date with his brother Joe Jonas and his fiancé Sophie Turner at the US tennis open. Looked like a ball, tbh.\n\nGotham Getty Images\n\n10th September 2018\n\nPriyanka Chopra and Nick Jonas recreate her BFF Meghan Markle and Prince Harry's engagement photoshoot.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nThey're Ralph Lauren New York Fashion Week photo looks pretty similar to this snap, right?\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n18th September 2018\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nPriyanka sent Nick the sweetest Instagram message to celebrate his 26th birthday, writing, Happy birthday baby. 💋❤️@nickjonas\" with an unseen picture of them at a sports game.\n\n23rd September 2018\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n\"Ranch life.\", Priyanka Chopra wrote on Instagram, while Nick shared a photo along with the caption, \"Out on the ranch 🤠\".\n\n1st October 2018\n\nPriyanka cheers fiancé Nick on as he plays football with a bunch of Bollywood stars, including MS Dhoni, Aditya Roy Kapoor, Shabir Ahluwalia, and Kunal Kemmu in Mumbai.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nSo cute.\n\nInstagram\n\n17th October 2018\n\nAccording to The Times Of India, Nick Jonas and Priyanka Chopra will tie the knot on 30 November!\n\n\n\nAn insider added to FilmFare.com, \"Nick and Priyanka were recently in India and had even gone to Jodhpur. That was when they decided the gorgeous Umaid Bhawan to be their dream wedding venue.\n\n\"They will have a limited guest list of 200 people with only their close friends and family in attendance.\n\n\"Since lot of their Hollywood friends are settled in New York, PC is quite excited to have her bridal shower there followed by a grand wedding in Jodhpur.\"\n\n\n\nEXCITING!\n\n24th October 2018\n\nPriyanka shares adorable snap of \"bae\" Nick Jonas with her 28.9 million Instagram followers, and unsurprisingly the comments section is full of complete love for the pair. \"Adorable couple\", one person wrote, while another added, \"Y'all are the cutest\". A third commented, \"Oh my god you are perfection together\".\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n28th October 2018\n\nPriyanka shares a snap from her bridal shower, and it's safe to say it's not your average hen do. The outfit? A white Marchesa gown with a feather-embellished skirt. The location? The Tiffany & Co. Blue Box Cafe in New York City. The guestlist? Priyanka's future sister-in-law Danielle Jonas, plus Kelly Ripa and Lupita Nyong'o, according to E! News. It sounds pretty epic.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n31st October 2018\n\nJust days after her beautiful bridal shower at Tiffancy and Co. in New York, Priyanka spoke to Entertainment Tonight about the hilariously stiff message she received from Nick that started their romance. \"He texted me\", she revealed. \"The first time was a text and just saying, 'I think we should connect,' and whatever and that's how we started talking. Connect? Is this LinkedIn?\n\nSpeaking about their \"whirlwind\" relationship, Priyanka added, \"This is such a wonderful new step in my life and I’m still getting used to it because it’s obviously been a whirlwind and I haven’t seen myself happier.\"\n\nShe later gushed, \"Just being in the whole situation of finding somebody who can be a partner to you in so many more ways than one is amazing, so yes I’m very excited.\"\n\n12th November 2018\n\nWe have some more details about Nick Jonas and Priyanka Chopra's upcoming wedding, including a date! The couple have reportedly booked out the fancy-pants Umaid Bhawan Palace in Jodhpur for their wedding day, which will follow a Christian ceremony that will also be held in India.\n\nAnd instead of having one big day, the couple will have loads of fun big days!\n\nAn insider told The Sun: \"There are several events leading up to the wedding, including a Christian ceremony, which will all be in India.\n\n\"They will culminate with the Indian wedding on 1st December at the palace, where they will tie the knot under a traditional four-pillar structure: a mandap.\n\n\"There is a mehndi event planned, where they will be decorated with henna body art among other traditional Hindi pre-wedding events.\"\n\n29th November 2018\n\nWhile Priyanka Chopra attended friend Meghan Markle's wedding at Windsor Castle, a new report suggests she and Prince Harry will not be making the journey to India to watch Nick Jonas and Priyanka tie the knot, putting the reasoning down to her pregnancy.\n\nAn Us Weekly source explained, \"Meghan will not be going to Priyanka's wedding, especially now that she's pregnant.\"\n\nPriyanka at Meghan’s wedding Getty Images\n\nMeghan and Priyanka have been friends since January 2016 when they met at the Elle Women in Television event, with Meghan telling the Press Trust Of India just a few months later, \"Priyanka is unbelievable. She has become a really good friend.\n\n\"You know when you meet someone and you just click? It was just an easy, natural progression. We've managed to keep in touch via email and text, and try to see each other whenever we're both in the same town.\"\n\nMeanwhile, with days to go until they are expected to tie-the-knot, Nick and Priyanka were photographed arriving at Jodhpur on Thursday, along with the groom's brother Joe and his fiancé, Sophie Turner. Nick's parents and Priyanka's relatives were pictured at the airport later in the day.\n\n30th November 2018\n\nJust days before she ties-the-knot, Vogue has revealed that Priyanka Chopra is the magazine's January cover star. In her interview with the publication, the bride-to-be opens up about her big day, while her husband-to-be recalls the special moment he proposed.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nAfter Nick shut down Tiffany & Co in London to choose the ring, he explains how he took it with him to Crete where he popped the question.\n\n\"I got down on one knee, again, and I said: 'Will you make me the happiest man in the world and marry me?'\" he told Vogue. \"No joke—she took about 45 seconds. Forty-five seconds of silence.\"\n\nHe ended up saying: \"I'm going to put this ring on your finger now unless you have any objections.\"\n\nThe couple are due to marry at a palace in India this weekend, with three days of celebrating planned. \"People will need vacations after this wedding,\" Priyanka told the magazine. It's going to be quite the party.\n\n3rd December 2018\n\nFollowing their four-month engagement, Nick Jonas and Priyanka Chopra are officially married!\n\nThe pair tied-the-knot at the Umaid Bhawan Palace in Jodhpur, Rajasthan, on Saturday, People reports. Priyanka wore a custom-made gown by Ralph Lauren, who also designed outfits for Nick, the bridesmaids and the groomsman.\n\nOver the weekend, both the bride and groom shared photos from their Mehendi ceremony, which is when the bridal party gets henna tattoos in the build-up to the big day.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n\"One of the most special things that our relationship has given us is a merging of families who love and respect each other's faiths and cultures,\" Nick wrote. \"And so planning our wedding with an amalgamation of both was so so amazing. An important part for the girl in an Indian wedding is the Mehendi.\n\n\"Once again we made it our own and it was an afternoon that kicked off the celebrations in the way we both dreamed.\"\n\nPriyanka also shared pics from the Sangeet, another pre-wedding celebration attended by both the bride and groom's families.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nCongrats to the happy couple!\n\n4th December 2018\n\nPriyanka Chopra's wedding dresses have finally been revealed in the first official photos from her nuptials. The actress and Nick Jonas tied-the-knot in over the weekend at Umaid Bhawan Palace in Jodhpur and yes, the bride looked stunning.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nFor the western ceremony, Priyanka wore a custom-made Ralph Lauren gown, which featured \"floral and scroll motifs, lace-effect tulle appliqués, scalloped sleeves and a high-neck collar,\" People reports. According to the brand, the dress took 1,826 hours to make. The strapless column dress underneath the outer layer was adorned in 2,380,000 mother of pearl sequins.\n\nThere were touching tributes incorporated into the intricate design, too. Nick's full name - Nicholas Jerry Jonas - was one of the eight words or phrases stitched onto the bride's gown.\n\nThe couple wore beautiful outfits by Indian fashion designer Sabyasachi for the Hindu ceremony.\n\n20th December 2018\n\nJust when you thought the celebrations were over, Nick and Priyanka attended their second wedding reception in Mumbai on Wednesday - two weeks after they tied-the-knot at a palace in Jodhpur.\n\nPriyanka wore a a royal blue and gold gown paired with a dazzling diamond necklace. Nick chose a slightly more casual grey suit for the occasion.\n\nSOPA Images Getty Images\n\nAddressing their guests, the bride said in a speech (via E!): \"It means so much to us that all of you came tonight. This has been an extremely special chapter in my life and I wanted my husband to meet all of the special people that have contributed to it. So thank you so much for being here, friends of my parents, my mom, who's hosting this wonderful evening, my dad, who I know is here. Thank you so much for coming and giving us your blessings and I hope you have a wonderful time tonight, and this is my husband, Nick Jonas.\"\n\nIt looked like Priyanka made a quick change at some point during the festivities. Celebrity stylist Mimi Cuttrell shared a picture of her wearing a stunning Ralph & Russo two-piece during the reception.\n\n30th December 2018\n\nWe might still be refusing to get our of our Christmas PJs before the start of 2019, but Nick Jonas and Priyanka Chopra are making the most of the last days of the year by jetting off on a ski holiday with Joe Jonas and Sophie Turner in Switzerland.\n\nAnd judging by the photos, they're having the best time ever and my jealousy is through the roof...\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nSeriously, just look.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nBefore their perfect winter break, Priyanka and Nick also spent Christmas Day with Sophie and Joe, along with the rest of their family at a big festive celebration. Eugh, my heart.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n11th January 2019\n\nWhile the winter blues have kicked in for most of us at this stage in January, Nick Jonas and Priyanka Chopra have started the new year by jetting off to the Caribbean for their honeymoon.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nYep, following their wedding celebrations in December, the newlyweds are finally enjoying a romantic getaway and if their social media posts are anything to go by, it looks like paradise. Here's Priyanka enjoying a swing on the beach...\n\nInstagram\n\nAccording to E! News, Nick planned the holiday as a surprise for his new wife. \"She had no idea it was going to be the Caribbean and Nick is planning everything for the trip, it's all a complete surprise to Priyanka,\" a source said. \"She knew it was a honeymoon trip but didn't find out where they were going until they landed.\"\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nJust before their honeymoon, Nick and Priyanka were spotted on a ski trip with the rest of the Jonas family in Switzerland. If only we could turn January into one long holiday...\n\n7th February 2019\n\nTwo months after she married Nick Jonas, Priyanka Chopra has revealed that her new surname is taking some getting used to.\n\nSpeaking to Jimmy Fallon, who introduced his guest as Priyanka Chopra Jonas on The Tonight Show, she said: \"It's a big deal! I didn't realise it was that much of a big deal until I did it.\"\n\nExplaining her decision to add her husband's name to hers, Priyanka said: \"I always wanted to add his name to mine because I feel like we're becoming family, and I'm a little traditional and old school like that. But I don't take away my identity. He gets added to who I am.\" So sweet!\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n13th February 2019\n\nNick and Priyanka make one of their first red carpet appearances as a married couple since tying the knot, looking loved up and gorgeous at the premiere for her latest film, Isn't It Romantic. You guys.\n\nGetty Images\n\n13th March 2019\n\nNick Jonas buys Priyanka Chopra a luxury Mercedes to celebrate the Jonas Brothers getting a Number One with 'Sucker'.\n\nPriyanka posted photos on Instagram of the pair - and their pooch - in front of the posh car, and captioned them: \"When the hubby goes number one.. the wifey gets a @maybach!! Introducing.. Extra Chopra Jonas.. haha .. I love you baby!! Yaaay! Best husband ever.. @nickjonas 😍❤️💋\"\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n22nd March 2019\n\nDuring an appearance on talk show Watch What Happens Live with Andy Cohen, Priyanka Chopra reflected on special moment from her wedding, sharing that her husband Nick Jonas cried the first time he saw her in her custom-made Ralph Lauren dress. Cute! But it was a quick game of 'I Do's and I Don'ts' that uncovered the juicy details on the newlyweds relationship.\n\nWhen host Andy asked Priyanka if she \"believes in sexting or FaceTime sex during long stints apart?\" she replied: \"For sure\" (via Cosmopolitan.com).\n\nThe actress also revealed that when it came to the best wedding presents she and Nick received, the wine and matching wine fridge from Joe and Kevin Jonas was a hit.\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n8th April 2019\n\nNewlyweds Nick and Priyanka just made hearts melt once again thanks to a video of an awkward yet sweet moment that has emerged online.\n\nIn footage shared by fan accounts on Instagram, Priyanka can be seen stumbling down some stairs before she grabs onto Nick's arm to stop herself from falling over. It's a pretty impressive comeback from what could have turned into a full on face-plant, but best of all, the actress handled it like a pro by laughing about the slight mishap.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nOnly these two could make a stair trip look adorable.\n\n17th April 2019\n\nNick Jonas hints that he's ready to start a family with Priyanka Chopra, and take their relationship to the next step. Discussing if they had any plans to start a family, he told E! News, \"I think that in everything we do, you know, my brothers and I, Priyanka and I, everything we do we think about the future, and building something that becomes a part of a legacy in some way, and a story we can share with our kids in the future.\"\n\nJonas added that family is at the forefront of his mind in everything he does, including \"the music to projects that we align ourselves with and, maybe some of the projects that are more adult-themed we'll hold those back 'til they get older obviously.\"\n\nMini Priyankas and Nicks!\n\n10 May 2019\n\nNick Jonas shared a picture alongside his wife from Monday night's Met Gala inviting fans to get a little creative. \"Caption this.\" he wrote alongside a photo of Priyanka looking down at his trousers, shocked.\n\nWhile his fans were filling the comments with all sorts of NSFW responses (think 'That ain’t no little finger', and 'Camp Rock: Rated R 😍), Priyanka also got involved with a cheeky comment.\n\n\"That’s mine?!!! 😍🙌🏽\" she wrote, falling directly into Nick's thirst trap. These two are very happy, and want you to know about it.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n28 August 2019\n\nPriyanka Chopra is out here trolling Nick Jonas over an MTV VMAs moment, which saw him fifth wheeling brothers Kevin and Joe Jonas with their wives Danielle Jonas and Sophie Turner.\n\nAfter winning the best Pop Video for 'Sucker', both Kevin and Joe lent over to kiss their wives, leaving Nick stood alone in the middle. Of course, it became a meme pretty quickly:\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nNick Jonas is a perfect representation of my love life right now 😩😂 #VMAs pic.twitter.com/Jn5mi6c2Bp — boohoo (@boohoo) August 27, 2019\n\nJoining in the trolling on social media, Priyanka shared a Photoshopped image of her hugging Nick at the ceremony on Instagram, writing: \"I’m always with you @nickjonas 😜😍Congratulations @jonasbrothers! I’m so proud of all of you! #sucker\"\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n19 July, 2020: Nick Jonas proposed to Priyanka Chopra two years ago today and to mark the special day, Priyanka jumped on Instagram to publicly shout out her man.\n\n\"To the greatest joy of my life,\" she began. \"2 years ago on this day you asked me to marry you! I may have been speechless then but I say yes every moment of everyday since. In the most unprecedented time you made this weekend so incredibly memorable. Thank you for thinking of me all the time. I am the luckiest girl in the world! I love you @nickjonas.\"\n\n\n\nThe post came just a day after Nick wished his wife a happy 38th birthday with an equally sweet Instagram tribute.\n\n\"I could stare into your eyes forever. I love you baby. You are the most thoughtful, caring and wonderful person I have ever met. I am so grateful we found one another. Happy birthday beautiful. 🎂.\"\n\nYou guys!\n\n\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nDecember 1st, 2020: Nick Jonas and Priyanka Chopra paid the sweetest tributes to each other as they celebrated their second-wedding anniversary. The pair tied the knot in a lavish ceremony at Umaid Bhawan Palace, in Jodhpur, India on 1st December 2018.\n\nMarking two years since the special day, Priyanka wrote on Instagram, \"Happy 2 year anniversary to the love of my life. Always by my side. My strength. My weakness. My all. I love you @nickjonas.\"\n\nWhile Nick shared a stunning picture from their wedding day and called Priyanka the most \"wonderful\" woman.\n\n\"Two years married to the most wonderful, inspiring and beautiful woman,\" he wrote. \"Happy anniversary @priyankachopra I love you ❤️.\"\n\nHappy anniversary, Priyanka and Nick!\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nJanuary 10th, 2021: Priyanka Chopra Jonas has opened up about married life in a rare interview. Promoting her latest film for Netflix, White Tiger, the actor spoke about what impact the pandemic has had on her relationship with husband Nick Jonas, and also reflected on their age gap.\n\nThe couple temporarily relocated to London while Priyanka filmed romantic comedy Text for You alongside Outlander's Sam Heughan and her old Quantico co-star Russell Tovey.\n\nLooking back on the year, the actor told The Sunday Times, \"Quarantine gave us the ability to spend a lot of time together, which I'm really blessed by. Because with both of our careers it's hard to find that kind of time.\"\n\nThe actor was also asked if the couple's age gap (Priyanka is 38 and Nick is 28) was a bigger gap to bridge than any cultural differences.\n\n\"Neither was a hurdle,\" Priyanka shared. \"Nick took to India like a fish to water. But just like a normal couple, you have to understand each other’s habits and what each other likes. So it’s more of an adventure than trying to figure out hurdles. None of it was really that hard.\"\n\nShe also praised the Jonas Brother for always being in her \"corner\", adding, \"whatever I may be in my professional life or how the world perceives me, I’m just a girl trying to live her life in the best way possible, and I’m so grateful to have a partner in doing that.\"\n\nGoals.\n\n25th January 2021\n\nPriyanka opens up about meeting Nick for the first time, and shares the secret to their successful marriage. \"I was shocked by his audaciousness, actually,\" the 38-year-old actress told People of their first meeting. \"He held my hand, he turned me around. I was like, 'What is happening?' He was bold, confident, [and] self-assured.\n\n\"And that was the most attractive thing about Nick and still is for me. But I was so taken in. Our courtship was such a short time. I just rode the wave because I trusted him. I'm someone who likes to have a sense of control, but he's the only one I don't feel like I need to do that with. I feel protected, calm.\"\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nOn why their relationship works so well, Priyanka continued, \"Nick always says this to me: 'I'll always be in your corner.' He said that to me very early. It was before we got married. I think at some point we were disagreeing about something, and he was like, 'I'm always in your corner. We're not on different sides of the room.'\"\n\n\"And it just changed the way I was talking to him. It became the greatest thing I feel about this partnership, and what makes me feel so confident in being able to do all the things I want to do. We build each other up. There's no, like, 'I want to pull you down,' negativity, drama.\"\n\nSounds blissful.\n\n23 November: After weeks of speculation that the pair had called time on their four year romance (which, ICYMI, started when Priyanka removed Nick's surname from her Instagram profile) the Baywatch actor took to Instagram to dispel rumours that they'd split.\n\nCommenting on a video of her husband getting hot and sweaty in the gym, Priyanka said: \"Damn! I just died in your arms...\" along with the love-heart eyes and sweating emoji. How suggestive!? The comment clearly went down a real treat with Niyanka fans, racking up over 16k likes in just a few hours.\n\nPriyanka Chopra Instagram\n\nSeems like things are very much still on with these two then. We love to see it ❤️.\n\n1st December 2021\n\nWith their busy work schedules, which have seen them spend much of the last year apart, many fans have worried how Priyanka and Nick have made their relationship work long distance. But now, Priyanka has opened up about how the pair stay close, despite working on opposite sides of the pond.\n\nAppearing on the InStyle podcast, , the 39-year-old spilled their secrets to a happy marriage. \"We talk all the time,\" she said, \"We know each other's hearts and we prioritise each other in everything that we do.\"\n\nPriyanka continued: \"We've had individual careers and we're both very clear about never interfering in each other's professional lives because we're always partners and assets. We'll have an opinion on each other's things, we'll be each other champions — but those decisions are predominantly for both of us to take, because we've built our careers by ourselves for such a long time.\"\n\nAs for how they keep the romance alive, she says \"It's very important to keep a check on the other person's heart... You just have to prioritise each other and then everything feels right.\"\n\n\"I have to say, my husband's amazing at doing that,\" the actor added. \"Like I said, this year was hard for me being in London. He would just drop everything—come in for even, like a day—just to have dinner with me and fly back.\n\nSounds like these two have got it all figured out, if you ask us!\n\n21st January 2022 - Nick and Priyanka welcome their first child together\n\nHappy news! Nick and Priyanka confirmed that they'd welcomed their first baby together via surrogate, born on 15th January. Sharing the news via a joint Instagram post, the couple wrote, \"We are overjoyed to confirm that we have welcomed a baby via surrogate. We respectfully ask for privacy during this special time as we focus on our family. Thank you so much.\"\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n8th May 2022 - Nick and Priyanka share first photo with baby daughter and confirm sweet name\n\nFour months after welcoming their baby, Nick and Priyanka took to Insta to share the first photo of their new arrival. Priyanka posted a sweet pic holding their little one on Instagram to celebrate Mother's Day in the US - and it's so cute!\n\nWriting a heartfelt caption, the couple reflected on bringing their daughter home after 100 days in the NICU. They also confirmed their baby's nickname as MM, after TMZ previously reported that she was named Malti Marie Chopra Jonas.\n\n\"On this Mother’s Day we can’t help but reflect on these last few months and the rollercoaster we’ve been on, which we now know, so many people have also experienced,\" Nick wrote. He went on, \"After 100 plus days in the NICU, our little girl is finally home.\"\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nNick continued with a gushing tribute to Priyanka, writing, \"Happy Mother’s Day to all the incredible mothers and care takers out there, but I want to take a minute to say a special Mother’s Day wish to my incredible wife @priyankachopra on her first Mother’s Day.\n\n\n\n\"Babe, you inspire me [in] every way, and you are taking to this new role with such ease and steadiness. I am so grateful to be on this journey with you. You are already an incredible mother. Happy Mother’s Day. I love you.\"\n\nLove!", "images": ["https://www.cosmopolitan.com/sites/cosmopolitan/assets/images/logos/ipso_regulated_hires.png", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/priyanka-chopra-shuts-down-nick-jonas-breakup-rumours-1637742795.png?crop=1.00xw:0.374xh;0,0.0146xh&resize=1200:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/priyanka-chopra-shuts-down-nick-jonas-breakup-rumours-1637742795.png?crop=1.00xw:0.374xh;0,0.0146xh&resize=1200:*", "keywords": [], "authors": ["Katie Frost"], "canonical_link": "https://www.cosmopolitan.com/uk/entertainment/a22662327/nick-jonas-priyanka-chopra-relationship-timeline/", "title": "Nick Jonas and Priyanka Chopra dating history", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=6", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "Nick Jonas and Priyanka Chopra share first proper photo of baby daughter", "description": "Plus a timeline of their relationship", "url": "https://www.cosmopolitan.com/uk/entertainment/a22662327/nick-jonas-priyanka-chopra-relationship-timeline/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/priyanka-chopra-shuts-down-nick-jonas-breakup-rumours-1637742795.png?crop=1.00xw:0.374xh;0,0.0146xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 211620818858710}, "article": {"publisher": "https://facebook.com/cosmopolitanuk", "modified_time": "2022-07-25T14:37:28Z", "published_time": "2022-07-25T14:36:00Z", "section": "Entertainment", "opinion": "false"}, "twitter": {"site": "@CosmopolitanUK", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/priyanka-chopra-shuts-down-nick-jonas-breakup-rumours-1637742795.png?crop=1.00xw:0.374xh;0,0.0146xh&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Nick Jonas and Priyanka Chopra dating history", "description": "Nick Jonas and Priyanka Chopra's relationship timeline -  Here's a reminder of how this whirlwind romance has blossomed.", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/priyanka-chopra-shuts-down-nick-jonas-breakup-rumours-1637742795.png?crop=0.660xw:0.492xh;0.202xw,0.00243xh&resize=320:*", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "sailthru.contenttype": "standard-article", "sailthru.tags": "Entertainment,entertainment,Priyanka Chopra,nick jonas", "sailthru.date": "2022-07-25T14:36:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/priyanka-chopra-shuts-down-nick-jonas-breakup-rumours-1637742795.png?crop=1.00xw:0.374xh;0,0.0146xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/priyanka-chopra-shuts-down-nick-jonas-breakup-rumours-1637742795.png?crop=0.660xw:0.492xh;0.202xw,0.00243xh", "sailthru.socialtitle": "Nick Jonas and Priyanka Chopra share first proper photo of baby daughter", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1658759760.0, "source": "https://www.cosmopolitan.com", "summary": ""}