{"url": "www.washingtonpost.com/news/the-fix/wp/2017/01/06/donald-trumps-attack-on-arnold-schwarzenegger-is-either-dumb-or-ingenious-or-both/", "text": "Gift Article Share\n\nWe wrote in early January about President Trump's head-scratching attack on Arnold Schwarzenegger, who succeeded him as host of the “Apprentice” series on NBC. Trump's mockery of Schwarzenegger's ratings seemed self-defeating, since Trump remains executive producer of the show. Wp Get the full experience. Choose your plan ArrowRight But we also wondered whether the feud might be part of a brilliant plan to drum up interest in a sagging program. Well, if there was a plan, it was not brilliant. Schwarzenegger is leaving after just one season, he told Empire magazine Friday.\n\n“Even if asked [to do it again] I would decline,” Schwarzenegger said. “With Trump being involved in the show, people have a bad taste and don't want to participate as a spectator or as a sponsor or in any other way support the show. It's a very divisive period now, and I think this show got caught up in all that division.”\n\nAdvertisement\n\nTrump repeatedly criticized Schwarzenegger's performance as host, including at the National Prayer Breakfast, of all places.\n\n“They hired a big, big movie star, Arnold Schwarzenegger, to take my place. We know how that turned out. The ratings went right down the tube,” Trump joked last month. “I want to just pray for Arnold for those ratings.”\n\nSchwarzenegger's ratings were indeed underwhelming. His debut Jan. 2 attracted a disappointing 4.9 million viewers, and the season finale, which aired Feb. 13, drew only 3.45 million. “The New Celebrity Apprentice” got doubled up by “The Bachelor” on ABC and “Superior Donuts” on CBS.\n\nSchwarzenegger told “Extra” in late January that he believes Trump's travel ban was “vetted badly,” citing the way some green-card holders were initially ensnared, before the White House said they should not be affected.\n\nAdvertisement\n\n“It's crazy and makes us look stupid when the White House is ill-prepared to put this kind of executive order out there,” Schwarzenegger said.\n\nThe original post from Jan. 6 follows:\n\nDonald Trump is about to become president of the United States, but he is also holding on to another title: executive producer of the “Apprentice” series on NBC. Logically, Trump should want the show he hosted for 14 seasons to succeed with its new host, Arnold Schwarzenegger.\n\nAnd yet! The president-elect spent part of his Friday — a day in which he will receive a highly anticipated intelligence briefing on Russian hacking efforts — taking shots at the actor and former governor of California for a low rating in his debut.\n\n“The New Celebrity Apprentice,” starring Schwarzenegger, attracted 4.9 million viewers Monday, according to Nielsen, losing to shows that aired at the same time on CBS and ABC. Fortune magazine put the disappointing performance in perspective the next day:\n\nAdvertisement\n\nWhile NBC heavily promoted Schwarzenegger's “Apprentice” takeover ahead of the show's January debut, the movie star and former California governor's reality TV turn got off to a mediocre start, especially when compared with the ratings of his predecessor. The ratings for last night's “Celebrity Apprentice” premiere were down more than 22 percent from the debut episode of Trump's most recent season hosting (2014-2015). The show averaged 7.6 million nightly viewers in that season, and the ratings for the key demographic (viewers aged 18 to 49) across that season was roughly 46 percent higher than what Schwarzenegger's debut scored on Monday.\n\nSo, Trump is a bigger TV ratings draw than Schwarzenegger, and his tweets suggest that he is also so egotistical that he cannot resist the urge to let everyone know it — even if it means dissing a program that still has his name on it.\n\nOr it could be that the tweets are a ploy to create drama and buzz around a show that apparently needs some. Reality TV thrives on conflict, and new host/Terminator/Mr. Universe vs. old host/executive producer/Mr. President-elect is a pretty compelling conflict.\n\nAnother possibility: Coming in a morning tweetstorm that also included references to the proposed border wall with Mexico, the passion of his voters, the Clinton campaign's cancellation of election night fireworks, his meetup with Vogue editor Anna Wintour and what a “GREAT SHOW!” his inauguration promises to be, the Schwarzenegger tweets were part of an effort to divert attention from the inconvenient information he is scheduled to receive at Friday's intelligence briefing on Russian efforts to influence the campaign that ended with his election.\n\nTrump's attack on his successor is either totally dumb or completely ingenious. Or both.\n\nGiftOutline Gift Article", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=http://www.washingtonpost.com/blogs/the-fix/files/2013/08/2011-06-21T114653Z_01_NIL04_RTRIDSP_3_AUSTRIA-917.jpg&w=1440"], "top_img": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://www.washingtonpost.com/blogs/the-fix/files/2013/08/2011-06-21T114653Z_01_NIL04_RTRIDSP_3_AUSTRIA-917.jpg&w=1440", "keywords": [], "authors": ["Callum Borchers"], "canonical_link": "https://www.washingtonpost.com/news/the-fix/wp/2017/01/06/donald-trumps-attack-on-arnold-schwarzenegger-is-either-dumb-or-ingenious-or-both/", "title": "If Trump’s feud with Arnold Schwarzenegger was a ratings ploy, it failed", "meta_data": {"description": "Schwarzenegger has quit the show after one disappointing season.", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/the-fix/wp/2017/01/06/donald-trumps-attack-on-arnold-schwarzenegger-is-either-dumb-or-ingenious-or-both/", "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://www.washingtonpost.com/blogs/the-fix/files/2013/08/2011-06-21T114653Z_01_NIL04_RTRIDSP_3_AUSTRIA-917.jpg&w=1440", "title": "If Trump’s feud with Arnold Schwarzenegger was a ratings ploy, it failed", "description": "Schwarzenegger has quit the show after one disappointing season."}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "If Trump’s feud with Arnold Schwarzenegger was a ratings ploy, it failed", "description": "Schwarzenegger has quit the show after one disappointing season."}, "last_updated_date": "2021-11-25T15:30:21.317Z", "article": {"published_time": "2017-02-02T19:57:34.000Z", "modified_time": "2021-11-25T15:30:21.317Z", "section": "The Fix", "content_tier": "metered"}, "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1", "next-head-count": 70, "apple-itunes-app": "app-id=352509417, app-argument=https://www.washingtonpost.com/news/the-fix/wp/2017/01/06/donald-trumps-attack-on-arnold-schwarzenegger-is-either-dumb-or-ingenious-or-both/"}, "movies": [], "publish_date": 1483660800.0, "source": "http://www.washingtonpost.com", "summary": ""}