{"url": "https://money.cnn.com/2018/06/09/media/anthony-bourdain-tributes/index.html", "text": "Television networks, viewers, readers and restauranteurs are paying tribute to Anthony Bourdain this weekend, one day after he was found dead in a hotel room in France.\n\nHis books are occupying six of the top 10 spots on Amazon's bestsellers list, a sign of immense interest in reading or re-reading his books like \"Kitchen Confidential.\"\n\nAnd some of his past TV shows are re-airing in his honor.\n\nOn Friday there were pop-up tributes outside Les Halles, the New York restaurant where Bourdain worked in the 1990s. Fans left bouquets and handwritten messages on the walls and door of the shuttered French brasserie.\n\nAt CNN in Atlanta, a mourner placed a flower and a note next to a poster of Bourdain in the lobby. And at CNN in New York, an employee placed post-it notes with hearts on one of his posters.\n\nCNN was Bourdain's home for the past five years, so the loss has caused heartache throughout the organization. The network quickly produced an hour-long remembrance that premiered on Friday night and will re-air Sunday at 10 p.m. ET.\n\nRelated: Inside Anthony Bourdain's globe-trotting career\n\nOther CNN programs are also honoring Bourdain's legacy.\n\n\"It is hard to imagine he is gone,\" Anderson Cooper said Friday night. \"Hard to imagine he is not just off on some far away journey, hard to imagine he will not soon return with new foods to share, new stories to tell.\"\n\nBefore Bourdain died, CNN had planned to run a marathon of past \"Parts Unknown\" episodes on Saturday night. The network is moving forward with that plan, but with an adjustment -- the marathon will feature some of Bourdain's all-time favorite episodes.\n\nAdditionally, the Travel Channel will air a 12-hour marathon of Bourdain's previous show \"No Reservations\" on Sunday starting at 7 a.m. Eastern.\n\nA new episode of \"Parts Unknown\" featuring Berlin was already scheduled to premiere Sunday at 9 p.m. CNN says it will still air, but now \"with a special introduction by Anderson Cooper.\"\n\nThat episode will be followed by the tribute special.\n\nRelated: How the press can cover suicide without creating a 'contagion'\n\n\"Somebody as vital, as passionate, as alive, as warm as human as Tony Bourdain, I could not imagine, A, that he was gone, and B, that he was gone in this manner,\" Christiane Amanpour said in an interview for the special.\n\nShe said his death has \"left a massive hole in\" the world.\n\nThe manner of Bourdain's death has also caused CNN and many other news outlets to highlight suicide prevention resources.\n\nAll three network nightly newscasts in the U.S. featured the \"lifeline\" number, 800-273-8255, and encouraged people to call for help.\n\nCNN and CNN.com have also been prominently featuring the number.\n\n\"You never know what goes on in anybody's head and you never really know what goes on anyone's heart,\" Cooper said in the CNN tribute.\n\n\"But certainly, you know, the pain he must have been feeling, at least in that moment or in those moments, and the loneliness he must've been feeling -- it's just terribly sad to think about. And makes me very sad for him to have -- to have succumbed to that.\"\n\nAsking for help\n\nThe suicide rate in the United States has seen sharp increases in recent years. It's now the 10th leading cause of death in the country, according to the American Foundation for Suicide Prevention. Studies have shown that the risk of suicide declines sharply when people call the national suicide hotline: 1-800-273-TALK\n\nThere is also a crisis text line.\n\nThe lines are staffed by a mix of paid professionals and unpaid volunteers trained in crisis and suicide intervention. The confidential environment, the 24-hour accessibility, a caller's ability to hang up at any time and the person-centered care have helped its success, advocates say.", "images": ["https://i.cdn.turner.com/money/.element/img/8.0/authors/byline-icon/brian-stelter.png", "https://i2.cdn.turner.com/money/dam/assets/170728053731-epubourdainborneo2-1024x576.jpeg", "https://i.cdn.turner.com/money/video/bvp/images/1.gif", "https://pixel.quantserve.com/pixel/p-D1yc5zQgjmqr5.gif", "https://i.cdn.turner.com/money/images/1.gif", "https://i2.cdn.turner.com/money/.element/img/8.0/newsletters/reliable_sources/rs-with-button_large1x1.jpg", "https://i2.cdn.turner.com/money/dam/assets/180608155409-anthony-bourdain-kitchen-confidential-780x439.jpg", "https://money.cnn.com/.element/cnnm-3.0/img/logo/logo_cnnbusiness.png", "https://money.cnn.com/.element/cnnm-3.0/img/logo/logo_cnn.svg"], "top_img": "https://i2.cdn.turner.com/money/dam/assets/180608155409-anthony-bourdain-kitchen-confidential-780x439.jpg", "keywords": [], "authors": ["Brian Stelter"], "canonical_link": "https://money.cnn.com/2018/06/09/media/anthony-bourdain-tributes/index.html", "title": "TV networks, colleagues and fans pay tribute to Anthony Bourdain", "meta_data": {"viewport": "width=1140", "date": "2018-06-09 02:13:11", "title": "TV networks, colleagues and fans pay tribute to Anthony Bourdain", "description": "CNN was Bourdain's home for the past five years, so the loss has caused heartache throughout the organization.", "author": "Brian Stelter", "section": "media", "og": {"title": "TV networks, colleagues and fans pay tribute to Anthony Bourdain", "type": "article", "url": "https://money.cnn.com/2018/06/09/media/anthony-bourdain-tributes/index.html", "image": {"identifier": "https://i2.cdn.turner.com/money/dam/assets/180608155409-anthony-bourdain-kitchen-confidential-780x439.jpg", "width": 780, "height": 439}, "site_name": "CNNMoney", "description": "CNN was Bourdain's home for the past five years, so the loss has caused heartache throughout the organization."}, "fb": {"app_id": 521848191196480}, "twitter": {"card": "summary_large_image", "site": "@CNNMoney", "url": "https://money.cnn.com/2018/06/09/media/anthony-bourdain-tributes/index.html", "title": "TV networks, colleagues and fans pay tribute to Anthony Bourdain", "description": "CNN was Bourdain's home for the past five years, so the loss has caused heartache throughout the organization.", "image": "https://i2.cdn.turner.com/money/dam/assets/180608155409-anthony-bourdain-kitchen-confidential-540x304.jpg"}, "DC.date.issued": "2018-06-09T02:13:11"}, "movies": [], "publish_date": 1528498800.0, "source": "https://money.cnn.com", "summary": ""}