{"url": "https://nypost.com/2016/11/29/victorias-secret-angels-reveal-their-diet-secrets/", "text": "The buckwheat babe: Adriana Lima Food philosophy: “Consistency is very important when it comes to eating,” says the 35-year-old native of Brazil, who now lives in Miami. “I eat six meals a day and work out at least six days a week doing mostly boxing.” Secret weapon: Every night, she downs a beverage made with buckwheat, which, despite the name, isn’t actually wheat. Rather, it’s a grain-like seed that’s gluten-free, packed with protein and, according to Lima, can help satisfy cravings for sweets and boost the metabolism. “I’ll mix [buckwheat] with hemp milk and honey, and I’ll eat it hot or cold depending on how I feel,” she says. “Eating buckwheat before bedtime actually helps you burn calories while you sleep.” Breakfast: A bowl of oatmeal Midmorning snack: Piece of fruit Lunch: Protein — typically chicken or fish — Japanese yams and quinoa Afternoon snack: Raw almonds, raw cashews and dried cranberries Early dinner: Protein — typically chicken or fish — Japanese yams and quinoa Late-night snack: Buckwheat shake What she does before the Victoria’s Secret Fashion Show: “I actually don’t change my workouts or diets,” says the mother of two, who adheres to a strict regimen year-round and has walked in 15 Victoria’s Secret shows previously. Favorite splurge: “I have to have my cappuccino or latte every day, but I’ll [sweeten it with] honey instead of sugar,” she says. “I’m Brazilian, so I need that.” The expert says: In theory, Lima’s buckwheat can help boost the metabolism all night long. “Because it is high-fiber, your body could continue to keep working on [digesting] it when you’re sleeping,” says Amy Shapiro, a registered dietitian and nutritionist based in Manhattan. “But mostly it’ll help with debloating.”\n\nThe protein princess: Martha Hunt Anthony Behar Food philosophy: Meat and eggs — not salads — are the 27-year-old’s go-tos for staying lean and toned. “I have to add a lot more protein to my diet because I work out so much, doing things like weight training at Dogpound [the trendy Tribeca fitness studio], yoga and pilates,” says Hunt, a North Carolina native who now lives in New York. “I try to make sure to get protein in every meal.” Breakfast: Eggs with spinach and avocado or a smoothie with almond butter Lunch: Salmon with a side of pumpkin Snack: Organic food bars — protein bars made with organic ingredients and sweetened with tapioca syrup — and almond butter. The latter is one of her favorite foods. “I could eat [it] on everything,” she says. Dinner: Chicken or salmon with a side of vegetables What she does before the Victoria’s Secret Fashion Show: “I try to eat less sugar and bread [two weeks] before the show,” she says. Favorite splurge: Pizza. “If my body is really craving something, I don’t deny it,” says Hunt, a key member of Taylor Swift’s squad. “You need to eat bad food in moderation. It’s good for peace of mind.” The expert says: “Women should aim for at least 46 grams of protein per day. If you’re working out and trying to put on muscle, increase that,” says Shapiro. But don’t overdo it. “Americans are generally not deficient in protein . . . [and] in eating too much of it, you can leach your bones of some calcium [and] tax your kidneys.”\n\nThe vegan vixen: Bridget Malcolm Victoria's Secret model Bridget Malcolm relies on a vegan diet to keep her abs perfectly toned. Kevin Kane/FilmMagic Food philosophy: “I don’t drink alcohol ever, really, and avoid refined sugars year-round,” says Malcolm, who has also has been a vegan since 2009. Healthy tips: “I always leave at least 12 hours between breakfast and dinner, and try to include a handful of almonds a day for vitamin E,” says the 25-year-old Australia native, who lives in New York. “And I follow the Japanese principle of ‘Hara hachi bu,’ which means, ‘Eat until you are 80 percent full.’ ” Secret weapon: She starts the day at 6 a.m. with a cup of black coffee and reishi and cordyceps mushrooms. Breakfast: A shake with Vega brand vegan chocolate protein blended with almond milk, ice, banana, kale and spinach Morning snack: Before working out at Body by Simone in the Flatiron District, she’ll have a soy latte. Lunch: Four ounces grilled tempeh, stir-fried broccoli, peppers, carrots and kale in olive oil, ginger and tamari gluten-free soy sauce Afternoon snack: A pint of cherry tomatoes Dinner: Vegetable chili with sauteed onions, peppers, broccoli, spinach, canned tomatoes, cumin, paprika, turmeric, curry powder and cilantro Before-bed beverage: A glass of unsweetened almond milk with cacao powder and stevia What she does before the Victoria’s Secret Fashion Show: “I ensure my salt intake is low to avoid bloating,” says Malcolm, who wed musician Nathaniel Hoho this past summer. “[Also,] I don’t have starches.” Rule to live by: “If you don’t recognize the ingredient in a food item, do not eat it.” The expert says: “If you’re going to be vegan, you have to be educated about a vegan diet,” says Shapiro. “If I work with vegans, they have to take [vitamin] B12 . . . because it’s the only vitamin we can only get from animal products.”", "images": ["https://nypost.com/wp-content/uploads/sites/2/2016/11/496621462.jpg?quality=90&strip=all&w=744", "https://sb.scorecardresearch.com/p?c1=2&c2=6390601&cj=1&cv=3.6", "https://nypost.com/wp-content/uploads/sites/2/2022/10/gone-wrong1.jpg?quality=90&strip=all&w=260", "https://nypost.com/wp-content/uploads/sites/2/2022/09/chloe-grace-moretz-comp.jpg?quality=90&strip=all&w=260", "https://nypost.com/wp-content/uploads/sites/2/2022/10/EP.-6-wp-thumb_NEW-1.jpg?quality=90&strip=all&w=260", "https://nypost.com/wp-content/mu-plugins/vip-helpers/images/vip-powered-dark-small.png?ver=20220317", "https://googleads.g.doubleclick.net/pagead/viewthroughconversion/988380111/?value=0&guid=ON&script=0", "https://nypost.com/wp-content/uploads/sites/2/2022/10/pitbull-mauling-317.jpg?quality=90&strip=all&w=260", "https://nypost.com/wp-content/uploads/sites/2/2022/10/monopoly.png?w=260", "https://nypost.com/wp-content/uploads/sites/2/2016/11/77402615.jpg?quality=90&strip=all&w=744", "https://nypost.com/wp-content/uploads/sites/2/2022/04/apple-podcast-badge402x.png", "https://nypost.com/wp-content/uploads/sites/2/2016/11/16392680.jpg?quality=90&strip=all&w=744", "https://nypost.com/wp-content/uploads/sites/2/2016/11/77402615.jpg?quality=90&strip=all&w=1024", "https://pagesix.com/wp-content/uploads/sites/3/2022/10/jen-shah-417.jpg?quality=90&strip=all&w=322&h=213&crop=1", "https://nypost.com/wp-content/uploads/sites/2/2016/11/rc_rachelhilbert_3_088.jpg?quality=90&strip=all&w=744"], "top_img": "https://nypost.com/wp-content/uploads/sites/2/2016/11/77402615.jpg?quality=90&strip=all&w=1024", "keywords": [], "authors": ["Social Links For Jordi Lippe-Mcgraw"], "canonical_link": "https://nypost.com/2016/11/29/victorias-secret-angels-reveal-their-diet-secrets/", "title": "Victoria’s Secret Angels reveal their diet secrets", "meta_data": {"copyright": "Copyright 2022 NYP Holdings. All rights reserved.", "viewport": "width=device-width, initial-scale=1", "p": {"domain_verify": "44b526edc36ffbcc163412ee9fe42833"}, "robots": "max-image-preview:large", "description": "They’re ready to runway. While the rest of us were stuffing ourselves with turkey and mashed potatoes last week, the models walking in December’s annual...", "generator": "WordPress 5.9.4", "fb": {"pages": 225343690812937}, "ia": {"markup_url": "https://nypost.com/2016/11/29/victorias-secret-angels-reveal-their-diet-secrets/?ia_markup=1"}, "nypost-section": "Lifestyle", "parsely-metadata": "{\"post_id\":\"nypost-10570548\"}", "article": {"opinion": "false", "content_tier": "free", "published_time": "2016-11-30T04:33:28+00:00", "modified_time": "2016-11-30T22:33:44+00:00", "publisher": "https://www.facebook.com/nypost"}, "sailthru.date": "2016-11-29 23:33:28", "sailthru.title": "Victoria’s Secret Angels reveal their diet secrets", "sailthru.tags": ",adriana lima,healthy eating,victoria’s secret fashion show,Fashion & Beauty,Lifestyle", "sailthru.description": "They’re ready to runway. While the rest of us were stuffing ourselves with turkey and mashed potatoes last week, the models walking in December’s annual Victoria’s Secret Fashion Show were...", "sailthru.image.full": "https://nypost.com/wp-content/uploads/sites/2/2016/11/77402615.jpg?quality=90&strip=all", "sailthru.image.thumb": "https://nypost.com/wp-content/uploads/sites/2/2016/11/77402615.jpg?quality=90&strip=all&w=50", "google-site-verification": "eyT36MjcFGn_qzUdS9VyWVb89Lq2f8-ItpI8WRksiyw", "msvalidate.01": "8188997BC82071CE07AB711B5675CE54", "og": {"type": "article", "title": "Victoria’s Secret Angels reveal their diet secrets", "url": "https://nypost.com/2016/11/29/victorias-secret-angels-reveal-their-diet-secrets/", "description": "They’re ready to runway. While the rest of us were stuffing ourselves with turkey and mashed potatoes last week, the models walking in December’s annual Victoria’s Secret Fashion Show were fi…", "site_name": "New York Post", "image": {"identifier": "https://nypost.com/wp-content/uploads/sites/2/2016/11/77402615.jpg?quality=90&strip=all&w=1024", "secure_url": "https://nypost.com/wp-content/uploads/sites/2/2016/11/77402615.jpg?quality=90&strip=all&w=1024"}, "locale": "en_US"}, "twitter": {"creator": "@nypost", "site": "@nypost", "text": {"title": "Victoria's Secret Angels reveal their diet secrets"}, "image": {"identifier": "https://nypost.com/wp-content/uploads/sites/2/2016/11/77402615.jpg?quality=90&strip=all&w=1024", "src": "https://nypost.com/wp-content/uploads/sites/2/2016/11/77402615.jpg?quality=90&strip=all&w=1024"}, "card": "summary_large_image", "title": "Victoria's Secret Angels reveal their diet secrets", "description": "They’re ready to runway. While the rest of us were stuffing ourselves with turkey and mashed potatoes last week, the models walking in December’s annual Victoria’s Secret Fashion Show were..."}}, "movies": [], "publish_date": 1480377600.0, "source": "https://nypost.com", "summary": ""}