{"url": "www.cnn.com/2018/03/04/politics/2018-oscar-awards-political-moments/index.html", "text": "Washington CNN —\n\nIt wouldn’t be an awards show without some political moments.\n\nThis year, we kept track of every political jab and line made at the 90th annual Academy Awards show. Check out the list below:\n\nOn the carpet\n\nFashion as a political statement\n\nTonight, actors and allies will #WearOrange pins and ribbons on the #Oscars red carpet to bring awareness to gun violence prevention in the wake of the Parkland school shooting. https://t.co/7BxtM6bTKD — Everytown (@Everytown) March 4, 2018\n\nAs expected, many attendees sported the signature “Time’s up” black and white pin.\n\nAnother popular pin spotted on the carpet? #WearOrange pins and ribbons from gun control group Everytown. They were worn in an effort to raise awareness about gun safety.\n\nPuerto Rico still on the mind\n\nDuring an interview with Michael Strahan, “Hamilton” creator Lin-Manuel Miranda encouraged viewers to visit Puerto Rico after the devastating hurricane.\n\nLin-Manuel Miranda encourages viewers to visit Puerto Rico after devastating hurricane: “Keep Puerto Rico in the conversation...keep Puerto Rico in your hearts.” https://t.co/exBwXimwm1 #Oscars pic.twitter.com/kBxhqLo1UG — ABC News (@ABC) March 5, 2018\n\n“Keep Puerto Rico in the conversation. I know there’s no shortage of things in the news, but keep Puerto Rico in your hearts,” Miranda said.\n\nHe added that tourism is “the lifeblood” of Puerto Rico, and urged people to “spend money there.”\n\nOn average, 87% of the island has power, but sources told CNN that about 150,000 US citizens on the island still don’t have electricity. Puerto Rico Gov. Ricardo Rosselló has repeatedly expressed frustration at the slow pace of recovery and help. He has questioned the US Army Corps of Engineers’ response on the island compared with other states dealing with disaster.\n\nMiranda has been an outspoken critic of the government response to Puerto Rico’s needs, and had strong words for President Donald Trump following his criticism of San Juan Mayor Carmen Yulín Cruz last year.\n\nIn October of 2017, Miranda released a song – with help from 22 other artists – to raise money for hurricane relief in Puerto Rico.\n\nPolitical activists attended Hollywood’s biggest night\n\nPlanned Parenthood President Cecile Richards attended the Oscars with Patrisse Cullors-Brignac, one of the co-founders of Black Lives Matter, and Bryan Stevenson, Equal Justice Initiative director. The three posed on the red carpet ahead of the show.\n\nRichards, who announced in January that she is leaving the role later this year, posted a photo on Instagram. “So the Oscars are cool but being with Bryan and Patrisse is 100,” she wrote.\n\nJimmy Kimmel’s opener\n\nKimmel returned to the helm as host on Sunday. He of course had a few envelope jokes, referencing the envelope mix-up last year that initially (and mistakenly) resulted in “La La Land” being named the best picture winner over “Moonlight” at the 89th Academy Awards.\n\nBut there were also a few political zingers.\n\nWakanda\n\nBefore kicking off his monologue, Kimmel did an old Hollywood-like voiceover to black and white footage from this year’s red carpet.\n\n“There’s Chadwick Boseman,” he said at one point, as footage of the “Black Panther” actor played. “The king of Wakanda! Imagine that! A country with a black leader. Wouldn’t that be swell?”\n\nFox News\n\nLater, while talking about Harvey Weinstein – and the subsequent powerful #MeToo movement and Time’s Up initiative – Kimmel joked about the awards show statuette: Oscar.\n\n“Oscar is 89 years old this year, which probably means he’s at home watching Fox News,” Kimmel said, a jab at the network news channel’s older, more conservative viewers.\n\nHe went on to clarify that “Oscar is a very respected man in Hollywood. Just look at him: He keeps his hands where he can see them, no penis.”\n\n“Get Out” and Trump\n\nThe first Trump joke came about 10 minutes into Kimmel’s monologue.\n\n“None other than President Trump called ‘Get Out’ the best 3/4 of a movie so far this year,” Kimmel said when addressing the mastermind behind the film, Jordan Peele\n\nThe horror film, which has received praise for its performances and thought-provoking take on race in America, received four Academy Award nominations, including one for best picture.\n\nCalling out Vice President Mike Pence\n\nKimmel made a joke about Pence while talking about best actor nominee Timothee Chalamet, nominated for the film “Call Me By Your Name,” a gay love story.\n\n“We don’t make films like ‘Call Me By Your Name for money,” Kimmel said, while talking about how the film was critically acclaimed but didn’t do as well at the box office. “We make them to upset Mike Pence.”\n\nKimmel during the show\n\nHope Hicks’ departure\n\nKimmel made another White House joke while introducing director Greta Gerwig and actress Laura Dern before they presented the best documentary feature category.\n\n“If the last two years have taught us anything, it’s that reality can be … depressing,” he said. “But tonight’s nominated documentaries show us that where there is darkness, there is also hope. Except at the White House. Hope quit on Wednesday.”\n\nHicks, the former White House communications director and one of Trump’s longest-serving and closest aides, resigned last week.\n\nPutin burn\n\nIcarus | Official Trailer [HD] | Netflix\n\nThe Russian Olympics doping documentary “Icarus” took home best documentary feature on Sunday.\n\nThe film, from filmmaker Bryan Fogel, delves into the controversy around performance-enhancing drugs in sports. It follows the eccentric Dr. Grigory Rodchenkov, the whistleblower who exposed what a leading report called a doping “cover-up that operated on an unprecedented scale” in Russia (read CNN’s story on this here).\n\nRussia was banned from the 2018 PyeongChang Winter Olympics following state-sponsored doping, leading up to and including the Sochi 2014 Winter Olympics.\n\nKimmel’s response to “Icarus” winning? “At least we know Putin didn’t rig this competition.”\n\nSpeaking of ‘Icarus’ …\n\nDuring his acceptance speech, Fogel got a little political himself.\n\n“We dedicate this award to Dr. Grigory Rodchenkov, our fearless whistleblower, who now lives in great danger,” he said. “We hope ‘Icarus’ is a wake-up call – yes, about Russia, but more importantly, about telling the truth.”\n\nAn ad that stood out\n\nWe stand with women around the world to make their voices heard and their presence known. To bring them front and center, today and every day. Join us as we say #HereWeArehttps://t.co/bVXGJ1NibP — Twitter (@Twitter) March 5, 2018\n\nTwitter premiered an ad called #HereWeAre during the Oscars with a message empowering women leaders. While the ad was not explicitly political, it included an implicit reference to immigration rhetoric.\n\n“If this poem is the only thing that survives me, tell them this is how it happened: Tell them I built me a throne. Tell them when we discovered life on another planet it was a woman and she built a bridge – not a border. I heard that this is how you make history. This is how you create a new world.”\n\nA shout out to the Dreamers\n\nOscar nominee Kumail Nanjiani, co-writer and star of “The Big Sick,” and Oscar winner Lupita Nyong’o addressed one of the biggest political debates of the year: immigration.\n\nThe Deferred Action for Childhood Arrivals program has enabled hundreds of thousands of young undocumented immigrants – sometimes called Dreamers – who were brought to the United States as children to come out from the shadows and openly attend school and get work permits and driver’s licenses without fear of being deported.\n\nTrump announced the end of the DACA program last fall, giving Congress a March 5 deadline to come up with an alternate solution. But that deadline became moot after two separate district courts ruled that the administration must keep accepting renewal applications for the program, effectively putting the termination on hold.\n\n“Like everyone in this room and everyone watching at home we are dreamers,” said Nyong’o, who is from Kenya. “We grew up dreaming of one day working in the movies. Dreams are the foundation of Hollywood, and dreams are the foundation of America.”\n\nNanjiani added: “To all the Dreamers out there, we stand with you.”\n\nCommon, Andra Day and activists share stage\n\nCommon and Day performed the song “Stand Up for Something,” from the film “Marshall.” The performance was perhaps the most political moment of the night, as the artists were joined onstage by a handful of activists, including:\n\nRichards, of Planned Parenthood\n\nCullors, of Black Lives Matter\n\nAlice Brown Otter, of Standing Rock Youth Council\n\nBana Alabed, author and Syrian refugee\n\nStevenson, of Equal Justice Initiative\n\nDolores Huerta, of Dolores Huerta Foundation and United Farm Workers of America\n\nJanet Mock, of #GirlsLikeUs\n\nJosé Andrés, of ThinkFoodGroup\n\nNicole Hockley, of Sandy Hook Promise\n\nTarana Burke, of #MeToo\n\nCommon called out the National Rifle Association during his rap.\n\n“Tell the NRA they ain’t God’s way and tell the people of Parkland we say àse (a West African philosophy about creating change).,” the Oscar-winning rapper said, referring to the mass shooting at Marjory Stoneman Douglas High School in Parkland, Florida, which left 17 people dead last month.\n\nThe NRA responded to Common on Twitter. The organization wrote: “@common @TheAcademy: This is what the #NRA and its members stand for. #Oscars.” The tweet included a video of Dom Raso, a Navy SEAL veteran.\n\n#TimesUp in the spotlight\n\nAshley Judd, Annabella Sciorra and Salma Hayek praise the #MeToo, #TimesUp movements: \"The changes we are witnessing are being driven by the powerful sound of new voices, of different voices, of our voices.\" https://t.co/wst3Hx4GJF #Oscars pic.twitter.com/dBqhimu402 — ABC News (@ABC) March 5, 2018\n\nAshley Judd, Annabella Sciorra and Salma Hayek – three of Harvey Weinstein’s accusers – also shared an emotional moment onstage, before introducing a video that featured many of the Oscar nominees and others in the industry talking about the importance of diversity in Hollywood.\n\n“The changes we are witnessing are being driven by the powerful sound of new voices, different voices, of our voices, who are joining together in a mighty chorus that is finally saying Time’s Up,” Judd said.\n\nThe video featured interviews with Nanjiani, Ava Duvernay, Greta Gerwig, Barry Jenkins and others.\n\n“Some of my favorite movies are by straight white dudes, about straight white dudes,” Nanjiani says in the video. “Now you can watch my movies and relate to me. It’s not that hard. I’ve been doing it my whole life.”\n\nGuillermo del Toro ‘erases lines in the sand’\n\nMexican filmmaker del Toro won best director on Sunday for “The Shape of Water,” making him the third director from Mexico to win the category. Alfonso Cuarón won for “Gravity” in 2014 and Alejandro González Iñárritu won for “Birdman” in 2015 and “The Revenant” in 2016.\n\nThe trio, who some in Hollywood deem the “three amigos,” have a production company called Cha Cha Cha Films.\n\n“I am an immigrant,” del Toro said in his speech. “In the last 25 years, I’ve been living in a country all of our own. The greatest thing our industry does is to erase lines in the sand. We should continue to do that.”\n\n“The Shape of Water” also won the biggest award of the night – best picture – to bring its total statuettes to four.", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/170628090958-saba-hamedy.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_100,h_100", "https://i.ytimg.com/vi/qXoRdSTrR-4/hqdefault.jpg", "https://media.cnn.com/api/v1/images/stellar/prod/180304200954-02-oscars-show-jimmy-kimmel.jpg?q=x_2,y_0,h_1101,w_1957,c_crop/w_800"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/180304200954-02-oscars-show-jimmy-kimmel.jpg?q=x_2,y_0,h_1101,w_1957,c_crop/w_800", "keywords": [], "authors": ["Saba Hamedy"], "canonical_link": "https://www.cnn.com/2018/03/04/politics/2018-oscar-awards-political-moments/index.html", "title": "Of course, the Oscars had plenty of political moments", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Of course, the Oscars had plenty of political moments | CNN Politics", "description": "It wouldn't be an awards show without some political moments.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180304200954-02-oscars-show-jimmy-kimmel.jpg?q=x_2,y_0,h_1101,w_1957,c_crop/w_800", "type": "article", "url": "https://www.cnn.com/2018/03/04/politics/2018-oscar-awards-political-moments/index.html", "site_name": "CNN"}, "twitter": {"title": "Of course, the Oscars had plenty of political moments | CNN Politics", "description": "It wouldn't be an awards show without some political moments.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180304200954-02-oscars-show-jimmy-kimmel.jpg?q=x_2,y_0,h_1101,w_1957,c_crop/w_800", "card": "summary_large_image", "site": "@cnnpolitics"}, "description": "It wouldn't be an awards show without some political moments.", "template_type": "article_leaf", "type": "article", "meta-section": "politics", "theme": "politics", "article": {"published_time": "2018-03-05T01:56:23Z", "modified_time": "2018-03-06T08:28:57Z", "tag": "caribbean, latin america, north america, puerto rico, united states, academy awards, arts and entertainment, awards and prizes, business and industry sectors, business, economy and trade, entertainment and arts awards, media industry, movie and video industry, movie awards, movies, celebrities, lin-manuel miranda, donald trump, jimmy kimmel, political figures - us, government and public administration, government bodies and offices, us federal government, white house, politics, 2014 sochi winter olympics, drugs and society, drugs in sports, eastern europe, europe, olympics, russia, sochi, society, sports and recreation, sports events, winter olympics, daca and dream act, immigration, immigration, citizenship and displacement, international relations and national security, undocumented immigrants, females (demographic group), feminism, gender equality, population and demographics, sex and gender issues, 2018 parkland school shooting, crime, law enforcement and corrections, crimes against persons, criminal offenses, florida, homicide, mass murder, murder, school violence, shootings, southeastern united states, violence in society, discrimination, sex discrimination, sexual harassment, societal issues, time's up movement, kumail nanjiani, andra day", "publisher": "https://www.facebook.com/CNN"}, "keywords": "caribbean, latin america, north america, puerto rico, united states, academy awards, arts and entertainment, awards and prizes, business and industry sectors, business, economy and trade, entertainment and arts awards, media industry, movie and video industry, movie awards, movies, celebrities, lin-manuel miranda, donald trump, jimmy kimmel, political figures - us, government and public administration, government bodies and offices, us federal government, white house, politics, 2014 sochi winter olympics, drugs and society, drugs in sports, eastern europe, europe, olympics, russia, sochi, society, sports and recreation, sports events, winter olympics, daca and dream act, immigration, immigration, citizenship and displacement, international relations and national security, undocumented immigrants, females (demographic group), feminism, gender equality, population and demographics, sex and gender issues, 2018 parkland school shooting, crime, law enforcement and corrections, crimes against persons, criminal offenses, florida, homicide, mass murder, murder, school violence, shootings, southeastern united states, violence in society, discrimination, sex discrimination, sexual harassment, societal issues, time's up movement, kumail nanjiani, andra day", "author": "Saba Hamedy", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1520121600.0, "source": "http://www.cnn.com", "summary": ""}