{"url": "https://nylon.com/articles/riverdale-backlash-kj-apa-charles-melton-fat-shaming", "text": "Riverdale fans are currently \"unstanning\" Charles Melton after the fat shaming comments he made on Twitter in 2012 went viral this week.\n\nThe tweets in question include comments such as, \"Fat chicks need to understand that wearing yoga pants is a privilege, not a right,\" and, \"I find it hilarious when fat people say they need to start eating right. When they have already mastered the art of chewing and swallowing.\" Following the resurfacing of these tweets, many took to Twitter to express their \"disgust\" with the actor.\n\nMelton, who plays Reggie Mantle on the hit CW show, has subsequently apologized via a statement released to Entertainment Tonight, in which he called his comments \"immature, offensive and inappropriate.\"\n\n\"I am ashamed of how I acted and there is no excuse for that behavior,\" Melton continued. \"I’m striving to do better and will use this experience to grow, helping others to understand how these types of statements are completely unacceptable.\"\n\nDespite his apology, many criticized Melton's decision, in the wake of the backlash, to delete the offending tweets and go private.\n\nThe resurfacing of the old tweets has also caused a few people to call out his co-star, KJ Apa, for allegedly liking a similarly worded comment on Instagram. A screenshot that appears to show Apa liking a comment that reads, “Making fun of fat is people is the only thing that’s gonna stop those useless bags of shit dying a fat early death,” has made its way onto the internet following the Melton controversy. It's unclear when the alleged screenshot is from, but many are speculating that the actors bonded over this sort of talk.\n\n\"Maybe this explains why you are friends with Charles Melton,\" one user wrote. \"I don't care how long ago this was. You are a piece of shit back then. You are still now because you show no remorse.\"\n\nRegardless of the case, all of these comments are despicable and point toward a larger problem in our culture, namely that fat shaming continues to be a widespread form of prejudice. As some rushing to Melton's defense pointed out, he tweeted out those comments when he was 21 and \"pre-fame.\" While he may have been young, this is no excuse for an adult man to say things as gross and unnecessary as this.\n\nI think we can all agree that they've got a lot of learning to do from their body-positive female co-stars.", "images": ["https://imgix.bustle.com/nylon/18379754/origin.jpg?w=1200&h=1000&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/10/6/afcfdb13-0329-4999-8ba3-67a5010abccb-as_fw22_brand_campaign_2-3_press_02.jpg?w=179&h=136&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.5133&fp-y=0.1778", "https://imgix.bustle.com/uploads/getty/2022/10/5/bd89da9e-c7ba-46ef-93da-3bceb5fdfef4-getty-1240473679.jpg?w=179&h=136&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2022/9/27/dae609fa-ce81-4420-b7a5-ccaf05021aae-slack-imgs.jpg?w=179&h=136&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/9/23/9daff4b2-8c87-4e46-9f15-1c17a7a08972-catherine-called-birdy-catherinecalledbirdy_2021_ut_210508_baiale_20745rc2_rgb.jpeg?w=179&h=136&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/nylon/18379754/origin.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1"], "top_img": "https://imgix.bustle.com/nylon/18379754/origin.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.nylon.com/articles/riverdale-backlash-kj-apa-charles-melton-fat-shaming", "title": "‘Riverdale’ Stars KJ Apa And Charles Melton Called Out For Fat Shaming", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@nylonmag", "card": "summary_large_image"}, "article": {"publisher": "https://www.facebook.com/nylon"}, "og": {"site_name": "Nylon", "url": "https://www.nylon.com/articles/riverdale-backlash-kj-apa-charles-melton-fat-shaming", "type": "article", "title": "‘Riverdale’ Stars KJ Apa And Charles Melton Called Out For Fat Shaming", "description": "Their comments demonstrate a much larger cultural problem", "image": {"identifier": "https://imgix.bustle.com/nylon/18379754/origin.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "Their comments demonstrate a much larger cultural problem"}, "movies": [], "publish_date": null, "source": "https://nylon.com", "summary": ""}