{"url": "http://abcnews.go.com/ThisWeek/week-transcript-hillary-clinton/story?id=12959396&page=2", "text": "CAIRO, Feb 20, 2011 — -- (BEGIN VIDEO CLIP)\n\nAMANPOUR (voice-over): This week, people power making history, arevolt in the Midwest and a revolution sweeping across the MiddleEast. State of siege. We take you to Wisconsin, where firefightersand teachers have stormed the capitol, lawmakers are in hiding, andthe Tea Party is fighting back. Bob Woodruff with the real story,inside the battle in the heartland.\n\n(UNKNOWN): We won in November. Elections have consequences.\n\nAMANPOUR: Our roundtable will ask, will this spread around therest of the country? As cuts get deep, who should bear the pain?\n\nAnd freedom fever, the very latest from the Middle East, wherebloody protests force another key ally to do the unthinkable. Myexclusive with Secretary of State Hillary Clinton and the youngInternet revolutionaries who tell us how they engineered the fall ofAmerica's staunchest ally with American tech, not tanks. \"This Week,\"\"People Power,\" starts right now.\n\n(END VIDEO CLIP)\n\nAMANPOUR: Good morning.\n\nPopulist frustration is boiling over this week, as we said, notjust in the Middle East, but in the middle of this country, as well.A budget war threatens to shut down the federal government, and nowunion workers fighting back are tying state and local governments inknots. Ground zero: Madison, Wisconsin.\n\nABC's Bob Woodruff is there, and he joins me now with the verylatest. Good morning, Bob.\n\nWOODRUFF: Good morning, Christiane.\n\nAMANPOUR: So there have been six days of protests there so far,state employees fighting the proposed cuts to their benefits and theirunion's right to bargain, Democratic legislators hiding in order tostop a vote. Bob, what's driving the people that you've met there?Does it look like there's an end in sight?\n\nWOODRUFF: Well, that's a good question. You know, this has beenjust a huge event. The weather is now starting to change today. Theythink there might be about six inches of snow today. Hopefully that'sgoing to come to an end, as well.\n\nBut, really, the numbers are really impressive. You know, theynow estimate that about 68,000 people were here yesterday. Most ofthem were teacher union members. But also then, for the first timeyesterday, the Tea Party supporters.\n\n(BEGIN VIDEOTAPE)\n\nWOODRUFF (voice-over): Is this what the future of Americanpolitics looks like?\n\n(UNKNOWN): I don't think we've ever had anything like this.\n\n(UNKNOWN): This is unprecedented for -- for our times. WOODRUFF: In Madison, the capitol building is still swellingwith protesters, a near total takeover. Tens of thousands in thestreets, too, determined to thwart a bill they see as a frontalassault on public labor unions.\n\n(UNKNOWN): What's disgusting?\n\n(UNKNOWN): Union busting.\n\n(UNKNOWN): What's disgusting?\n\n(UNKNOWN): Union busting.\n\n(UNKNOWN): How do you get better teachable moments than this?If you don't like what somebody's doing, we don't just sit back and --and watch. We don't wait four years for the next budget or electioncycle. We tell them right away we don't like it.\n\nWOODRUFF: The protesters are furious with Governor ScottWalker's plan to drastically curtail the bargaining power of theirunions. Outraged public workers and their allies have dominated thescene here since last Monday. But for the first time this weekend,they had company.\n\n(on-screen): Really what this is, is a tale of two rallies.You've got the one side, the union on this side, and then you come onover here to the Tea Party. So on one side, you've got kill the bill.On the other side, you've got pass the bill.\n\n(voice-over): The crowd supporting the governor, smaller in sizebut not in conviction, came from around the state to deliver a clearmessage.\n\n(UNKNOWN): But we're not going to negotiate. Why would wenegotiate? We won -- we won in November. Elections haveconsequences. That's -- it's as simple as that. I can't make it anyplainer. We won; they lost. That's what's going to happen. The billis going to be passed.\n\nWOODRUFF: We met Lou Debraccio (ph) early in the morning, 110miles away from the capitol, as he and a clutch of fellow Tea Partysupporters boarded a bus bound for Madison. Debraccio (ph) is a smallgovernment conservative, eager for his voice to be heard in thedebate.\n\nDEBRACCIO (ph): I want to -- I want to see the state moveforward. And in order to do that, many of us in the private sectorhave had to sacrifice and I think necessary that -- that we all sharethat sacrifice. It does hit home for me. My wife is a teacher. It'sgoing to cost our family money. But it's the right thing to do, so Isupport it.\n\nWOODRUFF: While Debraccio (ph) was heading to town, chemistryteacher Anthony Schnell (ph) and his family were deep in their morningroutine. J. SCHNELL: The immediate effect to our family is that we willmake about $500 a month less on Anthony's paycheck. And we are justhanging on by our fingernails right now. My husband loves being ateacher. He's tried other things, and he loves education, he loveskids, he loves working with families. And for him to say I think Imight have to leave this again is just heart-breaking, because it'shis passion.\n\nA. SCHNELL: This isn't about the money. It's not about thebenefits. Of course, that's going to hit us, and we don't like that.But it's really about having input in the classes, you know, havinginput with the school board, having input with what happens.\n\nWOODRUFF: Anthony's been coming to the protests all week, butthe Tea Party's presence weighed on his mind as he approached thecapitol.\n\nA. SCHNELL: I'm a little nervous about today. I just don't knowwhat's going happen.\n\nWOODRUFF: Once inside the rotunda, he lost the butterflies andbegan working the crowd.\n\nA. SCHNELL: Is this a budget fight?\n\nCROWD: No.\n\nA. SCHNELL: Is this just about money?\n\nCROWD: No.\n\nA. SCHNELL: Is this about us doing the best in our classrooms?\n\nCROWD: Yes.\n\nWOODRUFF (on-screen): They're all saying this is huge. And ifit happens here, it's going to happen everywhere in the rest of thecountry.\n\n(voice-over): In the rotunda, there is now a flavor of a '60s-era sit-in. In fact, some told us it's the biggest demonstrationthey've seen here since the Vietnam War.\n\n(on-screen): You doing this every day until this thing -- thisbill is killed?\n\nOWEN: I think this is going to happen every day until this billis killed. I don't think there's any way that the people in thisbuilding are going to give up the right to collective bargaining.\n\n(UNKNOWN): I'm here because this is wrong, that this sort ofshotgun legislation, ramming it through, it's the wrong way to dealwith problems. This isn't about me. It's about trying to do the bestwe can for society and communities.\n\nWOODRUFF: Do you think it's going to be peaceful? (UNKNOWN): I think so. I think the tensions are going to behigh, but I think it's going to stay civil.\n\nWOODRUFF: But what if this...\n\n(UNKNOWN): Well, wait. Not civil, it's going to stay peaceful.\n\nWOODRUFF: Lou Debraccio (ph) got an earful from the pro-laborcrowd as he made his way to the Tea Party demonstration.\n\nDEBRACCIO (ph): I'm not going to change any of their minds.They're committed enough to drive here and make signs, just likethey're not going to change my mind. It's not about that. So there'slimited return in talking to them.\n\nWOODRUFF: Even some families are divided. Julie Hansen (ph)supports the governor. Her 13-year-old daughter does not.\n\nHANSEN (ph): My 13-year-old is for collective bargaining. Shewent to school yesterday, and the teachers spoke to her about it.\n\nWOODRUFF: Think she believes it and -- or just because of theone lesson from the teacher?\n\nHANSEN (ph): We had a pretty adamant discussion.\n\nWOODRUFF (voice-over): Jeff Strobel (ph) is here with the TeaParty. His brother-in-law is on the other side.\n\nSTROBEL (ph): And my brother-in-law is a union worker. We had abig e-mail exchange on Facebook last night. The best thing is, it wascivil, it was, you know, courteous. But we kind of tried to educateeach other, but we're never going to agree. He's on this side; I'm onthis side. But we can talk about it.\n\nWOODRUFF (on-screen): Still going to have a peaceful Christmasdinner together?\n\nSTROBEL (ph): As long as there's beer there, we'll be peaceful.\n\nWOODRUFF (voice-over): Late Saturday, the governor issued astatement, turning down a compromise offer from the unions. And sohere in Wisconsin, the standoff continues, for now.\n\nFor \"This Week,\" I'm Bob Woodruff in Madison, Wisconsin.\n\n(END VIDEOTAPE)\n\nAMANPOUR: And so is Wisconsin just the beginning? States fromcoast to coast are grappling with this fundamental question: Indesperate economic times, which Americans should sacrifice the most?I'll put that to the roundtable coming up next.\n\nAnd later, revolt in the Middle East engulfs more of America'sstrongest allies, with the Obama administration struggling to stayahead of events. I'll get an exclusive progress report from Secretaryof State Hillary Clinton.\n\n(COMMERCIAL BREAK)\n\n(BEGIN VIDEO CLIP)\n\nOBAMA: Some of what I've heard coming out of Wisconsin, whereyou're just making it harder for public employees to collectivelybargain generally, seems like more of an assault on unions. And Ithink it's very important for us to understand that public employees,they're our neighbors, they're our friends. They make a lot ofsacrifices and make a big contribution. And I think it's importantnot to vilify them or to suggest that somehow all these budgetproblems are due to public employees.\n\n(END VIDEO CLIP)\n\nAMANPOUR: President Obama igniting a national conversation aboutwhich Americans should feel the pain of the budget axe. With pitchedbattles going on right now here in Washington and in statehouses fromFlorida to Wisconsin to California, with me now, our roundtable,George Will, Congressman Steve Southerland, a Republican freshman fromFlorida, he was elected to public office for the very first time lastNovember and sent here to Washington on a mission to cut spending.Also with us, ABC senior political correspondent Jonathan Karl andpolitical strategist Donna Brazile, who calls herself a laborDemocrat.\n\nThank you all for being here. So, George, Wisconsin. Is thisthe sort of battle that we're going to see shaping up around thecountry? Is this really the sort of political and philosophicaldebate that's going on right now about what these cuts are going tomean?\n\nWILL: It would have been even if the president hadn'tintervened. But in the span of three days, Christiane, he firstsubmits a budget that would increase the federal deficit and, two dayslater, he mobilizes his party, his own political machine, andorganized labor, which is an appendage to his party, to sabotageWisconsin's attempt to do what he will not do, which is deal with theinsolvency of their government. In doing so, he has set the stage for2012 by saying the Democratic Party is the party of government, notjust in having an exaggerated view of the scope and competence ofgovernment, but because its base is in public employees.\n\nAMANPOUR: So, Donna, mobilizing his troops, sabotaging theeffort to cut the budget, he did use the word \"assault,\" thepresident. Is that too much? I mean, what is going on here? BRAZILE: Well, first of all, they're entering day seven of theprotests. And my recollection is that President Obama commented on itin day four of the protest. So the fact is, is that this is agrassroots movement that had nothing to do with people or politiciansin Washington, D.C. This has everything to do with the workers therein Wisconsin and all across the country who are feeling the effects ofthese draconian budget cuts.\n\nLook, state and local workers have taken the brunt of a lot ofthese cuts. And they're willing to come to the table to talk to thegovernor to put forward more wage cuts, more pension -- pay up moremoney for their pension, more for their health care. Why won't thegovernment sit down with them? That's all they want. They want thegovernor to sit down with them, to talk about these items, but theywant their collective bargaining right, their voice at the tableremoved from the discussion.\n\nAMANPOUR: Is this a defining moment for -- for the labormovement?\n\nBRAZILE: Absolutely. Look, union membership is at an all-timelow over the previous 20-year high. This is an assault on workersacross the country. And people believe that they're using thepretense of a budget battle to destroy collective bargaining rights.\n\nAMANPOUR: So, Representative Southerland, a freshman to thisprocess, is this about fiscal responsibility? Or what is happening?Because it's happening in your state, as well.\n\nSOUTHERLAND: It is. And as you know, with nearly all of thestates requiring a balanced budget amendment, they don't have anychoice. The governors have to balance their budget. I know our owngovernor, Governor Scott, we see similar measures being taken in thestate of Florida.\n\nAnd I think you're seeing this in New Jersey, you're seeing thisin Wisconsin, so I think that, because they're bound by that limit ofa balanced budget -- which I am in favor of at the federal level -- Ithink that you're going to see this around the country.\n\nYou -- look, the American family is learning they have to do morewith less. And the same expectation, I think, is fair of thegovernments, both state and federal.\n\nAMANPOUR: And, Jon, is it just about the budget? Or is Madison,Wisconsin, have a bigger political implication?\n\nKARL: Oh, it clearly has a bigger political implication. Look,the president was quicker and more forceful in his denouncement ofGovernor Scott Walker than he was of in denouncing Hosni Mubarak. Imean, this happened, it was more forceful, it was quicker.\n\nMadison, Wisconsin, the state of Wisconsin, this is arguablyground zero for the 2012 presidential campaign. Look, this is a statethat if President Obama loses, he almost certainly is going to not winre-election. This is a state that's been solidly Democratic and(inaudible) more in the direction of Republicans, a bigger move thanany other state in 2010.\n\nI mean, look what happened. You saw the Republicans capture thegovernorship, capture the state legislature, two House seats, a Senateseat, and, you know, Democrats see the momentum and see real dangersigns for next year.\n\nWILL: Governor Walker was elected promising to do what he'sdoing. He did the same thing as county executive in Milwaukee, wherehe was -- there were protests, union uprisings, and he was handily re-elected.\n\nDonna, as I'm sure you know, such heroes of the labor movement asFranklin Roosevelt and Fiorello La Guardia said there's no place inthe public sector for unionization at all. As I'm sure you know, 24states limit or deny entirely collective bargaining rights for public-sector unions. And all Mr. Scott is planning to do is limitcollective bargaining to wages. What is draconian about that?\n\nBRAZILE: Well, what these workers would like, George, sincethey've already given up furloughs, paid leave, unpaid leave, whatthey would like is -- is to have a voice at the table. They don'twant their collective bargaining rights.\n\nAnd, look, what we're talking about is that the governor hascherry-picked what public workers he will subject to this so-calledremoval of their collective bargaining rights. The firefighters, thepolicemen and others who supported him in his election bid, well,guess what? They don't have to worry about their collectivebargaining rights.\n\nChristiane, over 400,000 state and local employees have losttheir jobs over -- during the -- the duration of the recession. Theyare willing -- what we've seen across the country is, these workersare willing to come to the table to talk to these governors aboutreducing the -- the budget deficit, but not on the backs of workingpeople.\n\nAMANPOUR: Let me ask you, because you brought up, George, whenthe governor was the county executive in Milwaukee. And there's aninteresting story today. It -- it boils down, perhaps, as some mightsay, to sort of shared sacrifice. Where is the sacrifice going to beborne the most? And is it equitable?\n\nI just want to ask you, you know, the articles talks about thelayoffs that the governor had announced back then, in 2003, quote,\"decimated\" the country's public parks, the staff, reduced the numberof county social workers, correction officers, janitors. As a result,park bathrooms shuttered, pools closed, and trash piled up so high. Imean, does it get to a point where too much is too much or not?\n\nWILL: And he's re-elected.\n\nAMANPOUR: That was my next question.\n\nWILL: The public liked what he did.\n\nAMANPOUR: OK. All right, well, that's the answer.\n\nBRAZILE: They liked what he did in one county. But what you seetoday is an organic movement. Just like the Tea Party went out thereand grabbed the microphone, what you have is grassroots people outthere saying, \"No more,\" no more budget cuts on the back of workingpeople. The governor has proposed tax giveaways to corporations. Iknow he campaigned on that...\n\n(CROSSTALK)\n\nAMANPOUR: ... but people like Representative Southerland camehere to -- to make those massive cuts.\n\nSOUTHERLAND: And -- and let me say this about working people.You know, that's not just federal employees. I mean, I come from asmall business, and 40 percent of the jobs lost in this recession camefrom small business, which makes up 85 percent of our economy.\n\nSo, you know, and I look at the retirement benefits and thebenefit packages that most small businesses offer to their employees,and they pale in comparison to -- to many of the federal programs thatfederal employees have the benefit of. So, you know, I think manypeople that work in small businesses are depending upon their SocialSecurity as their retirement.\n\n(CROSSTALK)\n\nWILL: Donna, what you call the grassroots is a tiny minority ofthis tiny minority of Wisconsin people who work for the government.Three hundred thousand public employees in Wisconsin went to work --while the teachers were clutching their little signs that say it's allabout the kids, they're abandoning their classrooms, lying to theirsupervisors, saying they were sick, and going off to protest indefense of perquisites, which if the governor cuts them as much as heplans to do, would still leave them better off than their privatesector...\n\n(CROSSTALK)\n\nBRAZILE: But why should workers bear the brunt of thisrecession? Why are we scapegoating just public-sector employees when,in fact, the -- the folks on Wall Street and others who caused thisrecession, George, they're enjoying huge bonuses. Bankers are notlending to small businesses, which is why we're not creating the kindof jobs that we need. But we're trying to balance the budgets on thebacks of the poor and the middle class, and that's why workers arestanding up for their rights.\n\nAMANPOUR: And do you think, though, that as some have said thisis just an opportunity for union-busting?\n\nSOUTHERLAND: Well, you know, I'm not sure if -- if that is -- ifthat is the focus.\n\nAMANPOUR: I mean, some are saying that. But do you think...\n\n(CROSSTALK)\n\nSOUTHERLAND: I want to say something about, you know, Donna'scomments.\n\nBRAZILE: Now, remember, you're a freshman.\n\nSOUTHERLAND: I remember. I remember. But let me say this...\n\nBRAZILE: And I'm your first woman on national TV, other thanChristiane. Now, be careful.\n\nSOUTHERLAND: But I'm not a freshman at -- at -- at running oursmall business. And you talk about bankers lending. You know,community banks are being hammered, you know, because they're comingin, they're being taken over. They -- they can't -- they can't loanmoney, OK? You can't get appraisals. You look at the thrift and howthey're coming in and capturing the small banks, and the small banksin our communities are -- are -- are critical to the flavor of ourcommunities. We can't get capital. So I think -- and that's aregulation issue.\n\n(CROSSTALK)\n\nBRAZILE: ... Congress should address.\n\nKARL: But, clearly -- clearly, what Walker is going...\n\nSOUTHERLAND: I think we will.\n\nKARL: I mean, Walker is going right at the public employeeunions. And part of it's because of that experience he had in 2003.He has said that he wouldn't have had to make all those cuts if hecould have gotten a better deal with concessions.\n\nAMANPOUR: And it's not just Republican governors. It's -- it'ssome Democrats, as well. Mario Cuomo and others are having to...\n\n(CROSSTALK)\n\nKARL: But one of the things he's doing is he's saying...\n\nBRAZILE: Andrew. Andrew.\n\n(CROSSTALK)\n\nKARL: Yeah, don't do that. One of the things that he's doing issaying that no longer will union dues be automatically taken out ofpublic employee paychecks, so the unions would have to go out andcollect those dues. This is something that's going right at the heartnot necessarily of the union employees, but the union leadership.\n\nBRAZILE: But the unions want to come to the table.\n\nWILL: Because they know what happens.\n\nBRAZILE: They want to come to the table, George. They've got 12percent. They say, here, we want to contribute 12 percent. We wantto give you $30 billion for this fiscal year, which ends on June 30th,and over the next two years, $300 million in concessions. Now, youdon't walk away from the table or you don't come to the bargainingtable when labor is ready to negotiate.\n\nAMANPOUR: All right. We're going to continue this after abreak. Tea Party revolutionaries on Capitol Hill, Washington bracesfor a possible government shutdown. The big question: Which sidewill blink first?\n\n(COMMERCIAL BREAK)\n\n(BEGIN VIDEO CLIP)\n\nBOEHNER: Our goal here is to cut spending. When we say we'regoing to cut spending, read my lips: We're going to cut spending.\n\n(END VIDEO CLIP)\n\nAMANPOUR: House Speaker John Boehner drawing a line in the sand.And sure enough, yesterday the House, with its Tea Party-poweredfreshmen, passed the biggest spending cut in modern American history.\n\nBut now it goes to the Democrat-controlled Senate, and it sets upan epic clash of ideas over how to solve a massive budget crisis. Andit sets the stage for a possible government shutdown.\n\nJoining me once again, George Will, Congressman Steve Southerlandof Florida, a conservative freshman elected with Tea Party support,Jonathan Karl, and Donna Brazile.\n\nSo, you're a man on Capitol Hill. This was the first shot inthis big battle over -- over spending cuts. And, really, people likeCongressman Southerland showed their muscle.\n\nKARL: This is the Tea Party's moment. I mean, imagine this. Weare talking not only about cutting government spending -- Washingtonhas never really done that -- but we're talking about how much.\n\nI mean, even the Democrats -- even Nancy Pelosi came out with --with a measure that would continue government funding temporarily,freezing it at last year's level. That is what Democratstraditionally would call a cut, because you're not going withinflation. So this is -- this is really a moment. This is also theChris Christie phenomenon. Will politicians be rewarded for makingtough choices, again, something I don't think we've ever seen happen?\n\nAMANPOUR: Do you care about being rewarded about tough choices?\n\nSOUTHERLAND: Well, I think the American people are ready. Theyrecognize the brutal reality that we're broke. And -- and -- andyou're seeing that. We just talked in the last segment about thestate level, and it certainly applies here.\n\nWe've seen record deficits. And the budget that the president,you know, introduced this past week just continues to put the pedal tothe metal. So, I mean, we're talking about this year alone, we're ata $1.5 trillion deficit. And, you know, we talk about draconianmeasures of the C.R., but that draconian is leaving our children withdebt that smothers them.\n\nAMANPOUR: Right. But in the real world, what happens if thisdoesn't get past the Senate or past the president? Then what?\n\nSOUTHERLAND: Well, look, we -- I'm not -- I'm not naive to the-- to the fact that when it goes to the Senate, they're going to maketheir -- their changes, and then it's got to go to the president. So,you know, it will not be in the form that we produced yesterdaymorning at 5 a.m. when we left the House being on the floor all night.\n\nAMANPOUR: So you're prepared for maybe half that figure?\n\nSOUTHERLAND: Well, I'm interested. I'm eager to see what'sgoing to happen. I don't -- I don't know what's going to happen. ButI don't expect it's going to be in the same form that we producedyesterday morning.\n\nAMANPOUR: Where is this going, George? Everybody, of course,talks about government shutdown or not. Some do.\n\nWILL: Well, that's premature. The Democratic senators have todecide, as does the president, whether they want to spend the next twoyears blocking in the Senate or vetoing on the president's deskspending bills because they're too small, because they believe thegovernment isn't spending enough.\n\nThe Democratic senators have to decide if, out of a $15 trillioneconomy, the economy is going to be hurt by cutting $60 billion fromthe federal budget. They have to decide whether, out of a $3.7trillion budget, there isn't $60 billion of inessential spending.\n\nAMANPOUR: But it's still the hugest proposed cut. Who's goingto blink first, Donna? You've been briefed. And I know you've beentalking to -- to leadership about these matters.\n\nBRAZILE: This is very difficult. And we all recognize that wehave to begin to cut spending. As Jonathan mentioned, the HouseDemocrats, the Senate Democrats, the president has submitted a budget,the 2012 budget, that -- that will slow the rate of growth and bringdown the federal deficit to 3 percent of GDP by 2015. Yeah, PresidentObama has a little bit of fiscal conservativism in him.\n\nBut the point is, is that this is primal scream politics; $61billion at the current spending levels is draconian. It cutsessential, vital, necessary services.\n\nGeorge, it's people -- it's students who are in college right nowwith Pell Grants that will have to face significant cuts. It's --it's preschoolers in Head Start that may not be able to go to schoolon the morning after May 4th, if we don't continue with the continuingresolution at 2010 levels.\n\nSo I think this is draconian. It's bad for the country. It'sbad for the economy. And it slows down economic growth at a time whenthings are finally moving up.\n\nAMANPOUR: And, Jon, do you think it's going to lead to ashutdown?\n\nKARL: Well, it might. I think there's a real possibility ofthat. I can tell you this: John Boehner has been telling peopleprivately, his Republican colleagues, that he will not allow agovernment shutdown. But the question is, will he be able to -- youknow, to produce?\n\nHere's the time line, though, is -- is that they just did this.The House and the Senate are gone for the next week. They have fourdays when they get back to work out some kind of an agreement. And ifthey don't do it by the end of the four days, we are at a governmentshutdown.\n\nAMANPOUR: So what's going to happen? What sort of pressure --are you going to put on the speaker?\n\nSOUTHERLAND: Well, I think -- I think, the Republicans, we haveno desire to have a government shutdown. I think that Speaker Boehnerhas been very, very clear. I think that he wanted to produce a billthat was legitimate. We saw over the last five days -- we saw thefirst C.R. that went through open rules. We had over 500 amendments.We voted on 70. And it was amazing to see the process, to seeDemocrats voting with Republicans on amendments. I mean, the will ofthe floor...\n\nKARL: But are your colleagues going to go along with somethingthat doesn't cut spending?\n\nSOUTHERLAND: It's going have to cut spending.\n\n(CROSSTALK)\n\nKARL: See, that's...\n\nSOUTHERLAND: Look, I -- I mean, we're going have to cutspending. I think...\n\nBRAZILE: But the appropriation chair came up with $30 billion inspending cuts. And then the House can -- the ultra-conservatives -- Ihave no other way of describing you -- you guys decided that youneeded $30 billion more.\n\n(CROSSTALK)\n\nAMANPOUR: ... the politics of a shutdown, it sunk Newt Gingrich.Would it sink Speaker Boehner?\n\nWILL: It would do anyone any good on either side. But ourviewers can do the arithmetic. They can take $60 billion for $3.7trillion. And if that's draconian, what wouldn't be draconian?\n\nBRAZILE: But, George, we're talking about over the next sevenmonths. We've got -- we've got food safety workers that will beimpacted. We have people who will be impacted across the board.\n\nWILL: This budget includes $7,500 bribes for anyone who will buya Chevrolet Volt.\n\n(CROSSTALK)\n\nAMANPOUR: ... will be...\n\nBRAZILE: ... the Metro. We're going to need to get the bicycleout, George.\n\nAMANPOUR: You can carry on your challenges in the green room,where the roundtable will continue.\n\nAnd we turn next to the Middle East, as people-poweredrevolutions sweeps the region. I ask Hillary Clinton what it meansfor the United States. My exclusive interview, when we come back.\n\n(COMMERCIAL BREAK)\n\nAMANPOUR: In the Middle East overnight, the popular uprisingsweeping the region have taken their most violent turn yet. Ithappened in Libya. Protesters there have been calling for the removalof the strong man, Moammar Gadhafi, for the last five days. He's beenin power for more than 40 years. And eyewitnesses are reporting thatthe military has now been firing on protesters after gaining theirconfidence and being welcomed into the crowd. A doctor gave adramatic radio interview. Let's listen.\n\n(BEGIN VIDEO CLIP)\n\n(UNKNOWN): Oh, my god. They're firing on the civilians here.They're crazy. They're going crazy here.\n\n(END VIDEO CLIP)\n\nAMANPOUR: There are reports of hundreds dead and thousandsinjured in Libya.\n\nIn Yemen this morning, thousands marched again in the streets ofthe capital, Sana'a. The president, an important American ally in thewar on terror, blamed the unrest on a foreign plot.\n\nAnd in Bahrain, home to the U.S. Navy's Fifth Fleet, whichprotects crucial oil-shipping lanes, demonstrators retook the squarewhere their calls for reform have now given way to calls for the kingto step down.\n\nBahrain, of course, is also a logistical hub and command centerfor U.S. operations in Iraq and Afghanistan. And last night, in a180-degree turn, the crown prince offered to open up a dialogue withthe protesters. ABC's Miguel Marquez is there.\n\n(BEGIN VIDEO CLIP)\n\nMARQUEZ: Christiane, it is amazing, the difference that 24 hoursmakes. This time yesterday, this country appeared poised for civilwar; now it is a celebration down here at Pearl Square, as you cansee. And it appears we're headed for a negotiated politicalsettlement.\n\nIn order the get the settlement they want, these protesters arenow willing to stay for the long haul. You can see they've set uptents all the way around Pearl Square here. They're even serving foodout here. That tea, by the way, is called Freedom Tea, and they arevery organized. This area over here is the men's section. And thenright back here, all these people in black, that's the women'ssection.\n\nThe big question is, what will get these protesters to go home?They want a constitutional democracy. They want the king to back offof politics and become a figurehead. They want the prime minister,who's been in power for 40 years, to go home. But so much blood hasbeen spilled here in the past week, these protesters want asignificant deal. Will they get it? It's not clear. It's not clearwhat will get them to stop protesting, pack up their tents, and gohome.\n\nChristiane?\n\n(END VIDEO CLIP)\n\nAMANPOUR: And we'll keep watching Bahrain and the otheruprisings.\n\nPresident Obama has called Bahrain's king -- he did that onFriday -- urging him to respect the rights of the protesters. Theadministration once again finds itself in a bit of a bind, as freedomactivists face off against an authoritarian ally.\n\nSecretary of State Hillary Clinton walked a fine line when Ispoke to her exclusively on Friday.\n\n(BEGIN VIDEOTAPE)\n\nAMANPOUR: Madame Secretary, thank you for joining us.\n\nCLINTON: Thank you for having me.\n\nAMANPOUR: About Bahrain.\n\nCLINTON: Uh-huh.\n\nAMANPOUR: How do you assess Bahrain right now? Is it stable?\n\nCLINTON: You know, Christiane, we've been very clear from thebeginning that we do not want to see any violence. We deplore it. Wethink it is absolutely unacceptable.\n\nWe very much want to see the human rights of the peopleprotected, including right to assemble, right to express themselves,and we want to see reform. And so Bahrain had started on some reform,and we want to see them get back to that as quickly as possible. AMANPOUR: What will the United States do? And will it holdBahrain to a similar standard, as it did Egypt?\n\nCLINTON: We -- we try to hold everyone to a similar standard,but we cannot dictate the outcomes. We cannot tell countries whatthey're going to do. We had, you know, no control over what happenedin Egypt.\n\nAMANPOUR: As Americans sit and watch and try to make sense ofwhat's going on in the Arab Muslim world, is what's happening -- isthe emerging new order, is it good for America? What should Americansmake of it?\n\nCLINTON: Well, I think, in general, Americans are in favor ofhuman rights, freedom, democracy. We know that ultimately the mostprogress that can be made on behalf of human beings anywhere is whenthose individuals are empowered, when they have governments that areresponsive. That's what we want to see.\n\nAt the same time, we recognize that this process can be hijacked.It can be hijacked by both outside and inside elements within anycountry. I mean, what a tragedy to see what happened in Iran. Therewas a great deal of hope and pent-up feeling that the time had come in1979, and look at what Iran is doing today.\n\nAMANPOUR: You want democracy. You speak about democracy. Canyou control democracy? Should you control democracy? Or do you haveto take the chips and let them fall where they may if you wantdemocracy?\n\nCLINTON: Well, I think that, first, we have to start from thebasic premise as to what democracy means, and democracy is not oneelection that then whoever wins it decides never to have another one.\n\nThat is not what anyone wants. We want to work with those forceswithin societies that are yearning for change to make sure that theyhave the support needed and, frankly, the technical assistance, thefinancial assistance to be able to make it through to what is a goodoutcome, what they've asked for in their online blogs and in theirposters and in their interviews.\n\nAMANPOUR: I want to ask you this, because it's an in-depthinterview that you've done in Bazaar. It's a beautiful layout. I'mstruck by the imagery, though. You are there, beautiful, but in acorner.\n\nCLINTON: You know, I just do what photographers tell me to do.It has no metaphorical meaning for me.\n\n(LAUGHTER)\n\nAMANPOUR: But I wanted to ask you, do you feel in a corner rightnow or on a tight rope, trying to balance the need for stability incountries where you have allies and interests, and your values,wanting democracy and all the human rights for the people there? Isthat a struggle? CLINTON: Well, I think it is a challenge. And it is a challengenot only at this point of time in the Middle East; it is an inherentchallenge in diplomacy, in America's efforts in the world. We want toadvance our security, our values, and our interests. And if therewere one template that could be imposed on every situation, I wouldn'tneed to have this job, and nobody else would have to, either. Butthis is often a balancing act and...\n\nAMANPOUR: Do you feel you're at a turning point, at a sort of atectonic shift in trying to figure out where the balance is, whereyour strategic interests lie?\n\nCLINTON: Well, Christiane, we deal with, you know, so manycountries around the world, some of whom are closer to our values, whosee their interests in ways we do and some of who -- whom are on theopposite end of the spectrum.\n\nAMANPOUR: In the Middle East, America's strategic interests havebeen with some of these autocratic rulers. They've helped you withIsrael and peace in the region. They've helped you against terrorism.Do you believe that a democratic people could be a force for much morestability, longer-term stability?\n\nCLINTON: Well, ultimately, a really truly functioning,comprehensive democracy has historically been proven to be a greaterforce for stability. Navigating through what are difficult choicesfor societies that are doing that transition is something that theUnited States encourages, as we did after the fall of the Berlin Wall,and will continue to encourage. At the same...\n\nAMANPOUR: So here, will you be encouraging it here?\n\nCLINTON: Well, we have been. But at the same time, we are alsoknowledgeable enough about historical experiences to know that this isnot an easy journey for any people to make. There are many threatsand problems along the way.\n\nAMANPOUR: It is beyond dispute that the Obama administrationscaled back their democracy and freedom agenda of the Bushadministration. In Egypt, the funds for NGOs and the like, civilsociety, democracy-building, were cut back and furthermore weredirected, when they were directed, to NGOs that were supported by theMubarak regime. Was that a mistake?\n\nClinton: Well, first of all, I just reject the premise. I thinkthat there is...\n\nAMANPOUR: It's -- it's indisputable.\n\nCLINTON: Well, it's not. That's just not -- that's just not thecase. There were differences in approach under the same set of goalsto try to promote democracy, economic opportunity, women's rights,labor organizing. There are many different ways that I think all ofus, different administrations, different experts, have struggled with.\n\nThere is no debate that, for 30 years, Republican and Democraticadministrations alike sent the same message to President Mubarak andthe regime, that they had to change. And we were all trying differentways.\n\nYou know, I think it's fair to say that none of us wereparticularly successful, because we kept running into an absoluterejection that that was not going to be done in Egypt. But we triedmany different approaches, and we're going to try many differentapproaches in different settings, as well.\n\nAMANPOUR: The State Department just had an Arabic Twitteraccount, a Farsi Twitter account. This week, what do you expect to dowith that?\n\nCLINTON: Have you -- have you been following the Farsi Twitteraccount?\n\nAMANPOUR: I'm following it all.\n\nCLINTON: Excellent. Excellent. Well, what we expect to do isto be communicating through the new social media with literallymillions of people around the world, because we want them to heardirectly from us what our policies are. We want to use it to rebutsome of the falsehoods and accusations that, unfortunately, are madeagainst the United States.\n\nBut mostly we want to be in the mix with this incredible, young,energetic population that is seeking the same rights to expressthemselves as young people in the United States seek.\n\nAMANPOUR: Thank you very much.\n\nCLINTON: Thank you very much.\n\n(END VIDEOTAPE)\n\nAMANPOUR: And this week, Secretary Clinton called on governmentsaround the world to respect and promote free access to the Internet.And when we return, we'll take you inside the revolution with theanonymous online revolutionaries who launched a movement.\n\n(COMMERCIAL BREAK)\n\nAMANPOUR: As we now know, behind the wave of uprisings in theMiddle East is a generation of educated, Internet-savvy, young Arabprofessionals. And their weapons? Social media, mostly made inAmerica, YouTube, Twitter, Facebook. In the darkest days of theprotests in Egypt, two anonymous activists kept the online movementalive.\n\nThis week, they agreed to tell us the gripping story of theirfight for freedom, which was not with tanks, but with tech.\n\n(BEGIN VIDEOTAPE)\n\nAMANPOUR (voice-over): Incredibly, one of the key players in theonline youth movement that helped bring down Hosni Mubarak was a 34-year-old Egyptian-American who never left Washington.\n\nWAHAB: I had contacts on the ground. People were asking me toget messages to them. People would turn to me and be like, \"Whatshould we do?\" And I'd be like, \"Well, I don't know. I never starteda revolution before.\"\n\nAMANPOUR: A year ago, Nadine Wahab connected online with theyoung Google marketing executive and anti-government activist WaelGhonim.\n\nGHONIM: They are basically a bunch of thugs, thieves, and, youknow, who have been ruining their -- our country. They're so 1970,and we're so 2010.\n\nAMANPOUR: They'd been trying to mobilize demonstrations throughFacebook since June of last year. And at first, the protests weresmall. But on January 25th, they posted this page calling for aprotest that mushroomed into a full-scale revolt. How?\n\nA week earlier, not so far way in Tunisia, young people hadforced out their authoritarian president. They had also takenadvantage of an explosion of social media that in just the last fouryears has electrified the Arab and Muslim world.\n\n(on-screen): Is this explosion of technology, the access amongso many people, is this the reason for these revolutions and uprisingsthat are going on, the turmoil?\n\nGHOSH: It's a planning tool, an organizing tool. AMANPOUR (voice-over): Bobby Ghosh has been reporting on theyouth movement for this week's Time magazine and says it's been key tospreading revolutionary fervor.\n\nGHOSH: So Tunisians can talk to Egyptians. Egyptians can talkto Yemenis. And it shows them that they're not alone.\n\nAMANPOUR: Arab satellite television also played a role.Electrified by what happened in Tunis, young Egyptians used Facebookto call for a protest in Tahrir Square.\n\nGHONIM: I put out an event and say, if 100,000 people confirm inthree days, then I'm going to take this seriously and, you know, tryand make it 1 million.\n\nAMANPOUR: Wael Ghonim blogged anonymously. So did his friend,Ahmed Saleh, a young lawyer, and they exchanged key tactical adviceonline.\n\nSALEH: On pages, on personal accounts, on groups that have veryspecific instructions from Tunisians to Egyptians. And so it givesyou instructions on how to deal with the tear gas, on how to deal withpolice generally, what the times of the day is better for you to go tothe street, how to deal with rubber bullets.\n\nAMANPOUR: The Facebook page became their corner cafe, the placeto meet, to recruit and share ideas.\n\nSALEH: One of the ideas that we're still trying to trace whereit had originated was -- is the idea to go to popular areas and bringpeople from the popular areas to specific public squares.\n\nAMANPOUR: After a week of protests, the Mubarak regime shut downthe Internet. Wael was arrested, but he had already made a plan topreserve the online movement.\n\nSALEH: In case he disappears or anything, I should take over thepage. If he's arrested, it's very expected that he would beinvestigated and tortured. So if the page had stopped working at thetime, that would be sort of incriminating for him.\n\nAMANPOUR: Half a world away, Nadine had set up a makeshift warroom in a D.C. townhouse.\n\nWAHAB: When the Internet went down is when my world sort ofturned topsy-turvy. It became surreal.\n\nAMANPOUR: They were determined to keep the page up and running.\n\nWAHAB: People would tell me, \"Nadine, they're not going to comefor you here.\" But I was terrified. When I was at night by myself, Iwas terrified.\n\nAMANPOUR: At the same time in Cairo, Ahmed also continued thework Wael had started. SALEH: When I wake up early in the morning, I post five or sixposts or as many as I could in very short time, couple of hours, andthen I post one sentence that says, \"I'm going to Tahrir.\"\n\nAMANPOUR: But even they were stunned when Wael was released andHosni Mubarak stepped aside.\n\nGHONIM: I'm proud to be an Egyptian since I've seen all these,you know, heroes in the street doing all these things that I neverthought Egyptians would do. And, you know -- you know, in -- in 15days, Egyptians learned what does it mean to me to involve in politicsand call for their rights.\n\nAMANPOUR: That moment emboldened a movement across the MiddleEast, filled with young people who now believe they can break the gripof repressive regimes, armed with something as simple as a cell phone.\n\n(on-screen): How wired is the whole region?\n\nGHOSH: It's quite substantially wired. Even people who youwould say are quite poor, live in the old city and 20 people to asmall home, they have a cell phone that -- it'll have a camera. Ifthey can afford it, it'll have sort of e-mail service or an Internetconnection.\n\nAMANPOUR (voice-over): In Bahrain, the protesters in PearlSquare have makeshift charging stations for that vital weapon againstoppression.\n\n(UNKNOWN): It plays a big role, OK, in gathering people andgiving them instructions. Go here. Not go. Don't go there. OK,this place is dangerous. Don't try to attack policemen.\n\nAMANPOUR: In Yemen, Allah Jaban (ph) is helping to mobilizeyoung people by posting a few simple photos on Facebook.\n\n(UNKNOWN): Those people who go out and demonstrate, they'reyoung people, out there just to -- to ask the better for theircountries and ask for their rights.\n\nAMANPOUR: Thousands turned out and forced their president, AliAbdullah Saleh, to take back his plan to make himself president forlife. Watching this wave reach its borders, Saudi Arabia isdesperately trying to contain it. It set up a Facebook page where thechief of the royal court encourages you to post your complaintdirectly. And if you fax it in, they guarantee a response within 24hours.\n\nIn Iran, despite the government's attempts to block it, 90percent of the hits on this Facebook page still come from Iran.\n\n(on-screen): The people who are doing this, are these people whoare friendly to the United States?\n\nGHONIM: They are suspicious of the United States, most of them,their entire lives. But they're not viscerally anti-American. We'renot seeing flags being -- American flags being burnt. We're notseeing the American president or -- or Hillary Clinton being hung ineffigy. And so if the U.S. is able to conduct some smart diplomacy, Ithink it's possible to get over that hump of suspicion that they have.\n\nAMANPOUR (voice-over): The Egyptian revolution wasn't drivenjust by the Internet and its super users, like Wael, Nadine and Ahmed,but by forces that have sparked revolution throughout history, thefight for basic freedom that connects us all.\n\nSALEH: The experience and the inspiration has no borders.\n\nWAHAB: It was much bigger than any of us, and it showed a -- adifferent model other than violence. You saw a people come togetherin a way that was just wonderful.\n\nGHOSH: The dream became true. And, you know, whatever we'vebeen fighting for since the 25th of January is now being realized.\n\n(END VIDEOTAPE)\n\nAMANPOUR: And I'll continue to follow the unfolding events inthe Middle East in real time on Twitter and on my blog, my Facebookpage, or at abcnews.com.\n\nWe'll be right back.\n\n(COMMERCIAL BREAK)\n\nAMANPOUR: That's it for our program this week. Stay with ABCNews and abcnews.com for all the very latest on the uprisings in theMiddle East and the budget crisis here in Washington and around thecountry. Thank you for joining us. We'll see you again next week.", "images": ["https://s.abcnews.com/images/Politics/uvalde-1-gty-er-221007_1665161778549_hpMain_1x1_144.jpg", "https://s.abcnews.com/images/US/subway-stabbing-ho-mo-20221007_1665149319841_hpMain_1x1_144.jpg", "https://s.abcnews.com/images/US/3-las-vegas-maris-mareen-digiovanni-w-01-ht-iwb-21007_1665148297878_hpMain_1x1_144.jpg", "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "https://s.abcnews.com/images/Politics/trump-white-house-oval-office-gty-jt-221004_1664919462010_hpMain_1x1_144.jpg", "https://s.abcnews.com/images/US/Uvalde-Crimson-Sanchez-01-ht-llr-221006_1665081913151_hpMain_2_1x1_144.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "keywords": [], "authors": ["Abc News"], "canonical_link": "https://abcnews.go.com/ThisWeek/week-transcript-hillary-clinton/story?id=12959396", "title": "'This Week' Transcript: Hillary Clinton", "meta_data": {"description": "Transcript of 'This Week' interview with Secretary of State Hillary Clinton", "keywords": "this week, christiane amanpour, egypt, revolution, mideast, hillary clinton", "copyright": "2022 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "'This Week' Transcript: Hillary Clinton", "og": {"site_name": "ABC News", "url": "https://abcnews.go.com/ThisWeek/week-transcript-hillary-clinton/story?id=12959396", "title": "'This Week' Transcript: Hillary Clinton", "description": "Transcript of 'This Week' interview with Secretary of State Hillary Clinton", "image": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2011-02-20T16:30:44Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/prism-story,12959396", "ipad": "abcnewsipad://link/prism-story,12959396", "googleplay": "https://abcnews.go.com/ThisWeek/week-transcript-hillary-clinton/story?id=12959396"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "'This Week' Transcript: Hillary Clinton", "description": "Transcript of 'This Week' interview with Secretary of State Hillary Clinton", "url": "https://abcnews.go.com/ThisWeek/week-transcript-hillary-clinton/story?id=12959396", "image": {"identifier": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/prism-story,12959396", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/prism-story,12959396", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/abcnews.go.com/ThisWeek/week-transcript-hillary-clinton/story?id=12959396", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://abcnews.go.com/ThisWeek/week-transcript-hillary-clinton/story?id=12959396"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "http://abcnews.go.com", "summary": ""}