{"url": "en.wikipedia.org/wiki/Kim_Kardashian", "text": "American media personality (born 1980)\n\n\"Kim K\" redirects here. For the Belgian singer, see Kim Kay\n\nKimberly Noel Kardashian (born October 21, 1980) is an American media personality, socialite, and businesswoman. She first gained media attention as a friend and stylist of Paris Hilton, but received wider notice after the sex tape Kim Kardashian, Superstar, shot in 2003 with her then-boyfriend Ray J, was released in 2007.[2] Later that year, she and her family began to appear in the E! reality television series Keeping Up with the Kardashians (2007–2021). Its success led to the formation of the spin-off series Kourtney and Kim Take New York (2011–2012), Kourtney and Kim Take Miami (2009–2013) and Hulu's The Kardashians (2022).\n\nKardashian has developed a significant presence online and across numerous social media platforms, including hundreds of millions of followers on Twitter and Instagram.[3][4][5] She has released a variety of products tied to her name, including the 2014 mobile game Kim Kardashian: Hollywood, a variety of clothing and products, the 2015 photo book Selfish and her eponymous personal app. Her relationship with rapper Kanye West has also received significant media coverage; they were married from 2014 to 2022 and have four children together.[6] As an actress, Kardashian has appeared in films including Disaster Movie (2008), Deep in the Valley (2009) and Temptation: Confessions of a Marriage Counselor (2013).\n\nIn recent years, Kardashian has focused on her own businesses by founding KKW Beauty and KKW Fragrance in 2017.[7] In 2019, she launched shapewear company Skims, which was previously called \"Kimono\" but changed its name following widespread backlash.[8] Kardashian has also become more politically active by lobbying president Donald Trump for prison reform and lobbying for Alice Marie Johnson to be granted clemency.[9] She has advocated for the recognition of the Armenian genocide on numerous occasions. Kardashian is also planning to become a lawyer by doing a four-year law apprenticeship that is supervised by the legal nonprofit #cut50, which was co-founded by Van Jones.[10][11][12]\n\nTime magazine included Kardashian on their list of 2015's 100 most influential people. Both critics and admirers have described her as exemplifying the notion of being famous for being famous.[13][14][15] She was reported to be the highest-paid reality television personality of 2015, with her estimated total earnings exceeding US$53 million.[16] As of April 2022, Kardashian is estimated to be worth US$1.8 billion.[17]\n\nEarly life and education\n\nKimberly Noel Kardashian was born on October 21, 1980, in Los Angeles, California, to Robert and Kris Kardashian (née Houghton).[18] She has an older sister, Kourtney, a younger sister, Khloé, and a younger brother, Rob.[19] Their mother is of Dutch, English, Irish, and Scottish ancestry,[20] while their father was a third-generation Armenian-American.[21] In 1991, their parents divorced and their mother married Bruce Jenner,[b] the 1976 Summer Olympics decathlon winner.[23] As a result of her mother’s remarriage, Kim Kardashian acquired step-brothers Burton \"Burt\", Brandon, and Brody; a step-sister, Casey; and later two half-sisters, Kendall and Kylie Jenner.[24]\n\nKardashian attended Marymount High School, a Roman Catholic all-girls school in Los Angeles.[25] In 1994, her father represented football player O. J. Simpson during his murder trial. Simpson is Kardashian's godfather.[26] Kardashian's father died in 2003 of cancer.[27] In her 20s, she was the close friend and stylist of socialite Paris Hilton, through whom Kardashian first garnered media attention.[3][28] Kardashian appeared as a guest on various episodes of Hilton's reality television series The Simple Life in 2006.[29]\n\nCareer\n\nEarly beginnings (1996–2005)\n\nIn 1996, at the age of 16, Kardashian began working at Body, a local clothing store in Encino, California. She had recently totaled her car. Her father agreed to buy her a new one on condition that she agree to be responsible for paying all expenses related to any future damages.[30] Kardashian worked at Body for four years, assisting in the opening of the Calabasas location. In 2000, after entering into her first marriage, she resigned.[31]\n\nBy 2003, Kardashian was working as a personal stylist to the R&B singer and actress, Brandy, who is the sister of Ray J. Later, those siblings’ mother (and manager) Sonja Norwood, alleged that in 2004 she had authorized Kardashian to make \"one and only one\" purchase on her American Express credit card and that nevertheless Kardashian and her sisters Khloé and Kourtney had incurred over $120,000 in unauthorized charges to that card. Norwood also alleged that the bulk of the charges were attributable to purchases made at Kardashian's family-owned boutique in 2006 and 2007, after Kardashian was no longer employed by Norwood’s daughter. Norwood further alleged that, at the request of her children, she did not file criminal charges, instead presenting her allegations personally to Kardashian, and that Kardashian apologized and promised to repay the debt. In 2008, no payments having been forthcoming, Norwood filed a lawsuit. Kardashian has denied all these allegations. In 2009, the parties reportedly reached a confidential settlement, and the lawsuit was dismissed.[32][33]\n\nAround 2004, Kardashian had also begun working as a stylist and assistant for the socialite Paris Hilton, a childhood friend of hers. She also appeared in several episodes of Hilton and Nicole Richie's reality show The Simple Life.[34][35] In 2005, Sheeraz Hasan, a PR strategist working with Hilton, met Kardashian and her mother Kris Jenner. Hasan stated in an interview with 20/20 that Kardashian was \"ready to do whatever it takes\" to create a successful brand. Rick Mendozza, a freelance photographer on assignment for the tabloid TMZ, stated in the same interview that, when Kardashian accompanied Hilton to Hyde, which was a Hollywood hotspot at the time, he continued to get assignments from tabloids to get photographs of Kardashian for the next three years.[36] In 2021, Kardashian said that Hilton \"literally gave me a career. And I totally acknowledge that.\"[37]\n\nBreakthrough with reality television (2006–2009)\n\nKardashian in 2007\n\nKim Kardashian Superstar (2007)\n\nIn 2006, Kardashian entered the business world with her two sisters and opened the boutique shop D-A-S-H in Calabasas, California.[38] In February 2007, a sex tape made by Kardashian and Ray J in 2003 was leaked.[39][40] Kardashian filed a lawsuit against Vivid Entertainment, who distributed the film as Kim Kardashian, Superstar. She later dropped the suit and settled for a reported US$5 million, allowing Vivid to release the tape.[2] Several media outlets later criticized her and the family for using the sex tape's release as a publicity stunt to promote their forthcoming reality show.[41][42]\n\nKeeping Up with the Kardashians (2007–2021)\n\nIn October 2007, Kardashian and her mother, Kris Jenner, her step-parent Caitlyn Jenner, her siblings Kourtney, Khloé, and Rob Kardashian, and half-sisters Kendall and Kylie Jenner, began to appear in the reality television series Keeping Up with the Kardashians.[43] The series proved successful for E!, and has led to the creation of spin-offs including Kourtney and Kim Take New York and Kourtney and Kim Take Miami.[44] The flagship series concluded in 2021 after 294 episodes. In one of the episodes, Kim discussed an offer from Playboy to appear nude in the magazine.[45] In December 2007, Kardashian posed in a nude pictorial for Playboy.[46]\n\nFilm and television appearances\n\nIn 2008, she made her feature film debut in the disaster film spoof Disaster Movie, in which she appeared as a character named Lisa.[47][48] That same year, she was a participant on season seven of Dancing with the Stars, where she was partnered with Mark Ballas.[49] Kardashian was the third contestant to be eliminated.[50] In January 2009, Kardashian made a cameo appearance during an episode of the sitcom How I Met Your Mother, in the episode \"Benefits.\" In April, she released a workout DVD series through her television production company Kimsaprincess Productions, LLC which has seen the release of three successful workout videos, Fit in Your Jeans by Friday, with trainers Jennifer Galardi and Patrick Goudeau.[38][51][52] Kardashian played Elle in four episodes of the television series Beyond the Break.[53]\n\nKardashian became a guest host of WrestleMania XXIV and guest judge on America's Next Top Model in August of that year.[54] In September, Fusion Beauty and Seven Bar Foundation launched \"Kiss Away Poverty\", with Kardashian as the face of the campaign. For each LipFusion lipgloss sold, US$1 went to the Foundation to fund women entrepreneurs in the US.[55] The following month, she released her first fragrance, self-titled \"Kim Kardashian.\"[56][57] In December 2009, Kardashian made a guest star appearance on CBS's CSI: NY with Vanessa Minnillo.[58][59]\n\nEarly endorsements (2010–2013)\n\nIn 2010, Kardashian ventured into several new endorsement deals, including endorsing various food products for Carl's Jr.[60][61] In April, Kardashian sparked controversy over the way she held a kitten for a photograph, holding it by the scruff of its neck.[62] With sisters Kourtney and Khloé, Kardashian is involved in the retail and fashion industries. They have launched several clothing collections and fragrances. Animal rights organization PETA criticized Kardashian for repeatedly wearing fur coats, and named her as one of the five worst people or organizations of 2010 when it came to animal welfare.[63] June saw Kardashian guest star with Khloé and Kourtney as themselves on the season three premiere episode of the series 90210.[64]\n\nOn July 1, 2010, the New York City branch of Madame Tussauds revealed a wax figure of Kardashian.[65] In November, Kardashian served as producer for The Spin Crowd, a reality television show about Command PR, a New York City public relations firm, run by Jonathan Cheban and Simon Huck. The show followed them as they settle into their new offices in Los Angeles. That month, she also appeared on season ten of The Apprentice.[66][67] Kim, Kourtney, and Khloé wrote an autobiography titled Kardashian Konfidential, which was released in stores on November 23, and appeared on New York Times's Best Seller List.[68]\n\nIn December 2010, Kardashian filmed a music video for a song titled \"Jam (Turn It Up)\". The video was directed by Hype Williams; Kanye West makes a cameo in the video.[69] Kardashian premiered the song during a New Year's Eve party at TAO Las Vegas on December 31, 2010.[70] The song was produced by The-Dream and Tricky Stewart. When asked if an album was in the works, Kardashian replied, \"There's no album in the works or anything—just one song we did for Kourtney and Kim Take New York, and a video Hype Williams directed, half of the proceeds we're giving away to a cancer foundation, because The-Dream's and one of my parents passed away from cancer. It's just all having fun—with a good cause\".[71] Jim Farber, writing for the Daily News, called the song a \"dead-brained piece of generic dance music, without a single distinguishing feature\", and suggested that the single made Kardashian the \"worst singer in the reality TV universe\".[72]\n\nThat month, the International Business Times reported that Kardashian's 2010 earnings were the highest among Hollywood-based reality stars, estimating them at $6 million.[73][74]\n\nIn April 2011, Kardashian released her third fragrance \"Gold\".[56] In March 2012, Kardashian debuted her fourth fragrance, titled \"True Reflection\", which she worked with the company Dress for Success to promote.[75] In April, E! renewed Keeping Up with the Kardashians for two additional seasons, in a deal reported to be worth $50 million.[76][77] In November 2011, she released a novel Dollhouse along with sisters Kourtney and Khloe.[78] In October 2012, Kardashian released her fifth fragrance, \"Glam\", which was made available through Debenhams.[79] In summer of 2012, Kardashian and her family filmed a music video in the Dominican Republic to Notorious B.I.G's song \"Hypnotize\".[80]\n\nIn the romantic drama Temptation: Confessions of a Marriage Counselor (2013), produced, written, and directed by Tyler Perry, Kardashian obtained the role of the co-worker of an ambitious therapist. While the film was a moderate box office success, with a worldwide gross of US$53.1 million,[81] critical response was negative and Kardashian won the Razzie Award for Worst Supporting Actress.\n\nFocus on social media (2014–2016)\n\nKardashian in September 2014\n\nKardashian appeared on the cover and in a pictorial in Paper's winter 2014 issue, photographed by Jean-Paul Goude.[82] On the cover, her nude buttocks are featured above the caption: \"Break the Internet\", which generated considerable comment in both social and traditional media.[83][84] A Time magazine writer commented that, unlike previous celebrities' nudes that represented the women's rebellion against repressed society and \"trying to tear down\" barriers, Kardashian's exhibition was \"just provocation and bluster, repeated images that seem to offer us some sort of truth or insight but are really just self serving. We want there to be something more, some reason or context, some great explanation that tells us what it is like to live in this very day and age, but there is not. Kim Kardashian's ass is nothing but an empty promise.\"[85] However, the stunt \"set a new benchmark\" in social media response,[86] and Paper's website received 15.9 million views in one day, compared with 25,000 views on an average day.[87][88]\n\nIn June 2014, Kardashian released a mobile game for iPhone and Android called Kim Kardashian: Hollywood. The objective of the game is to become a Hollywood star or starlet.[89] The game supports a free to play model, meaning the game is free to download, but charges for in-game items.[90] The game was a hit, earning US$1.6 million in its first five days of release.[90] In July, the game's developer Glu Mobile announced that the game was the fifth highest earning game in Apple's App Store.[90] Kardashian voiced the role of an alien in an episode of the adult animated series American Dad!, in season 11 (2014–15) in the episode titled \"Blagsnarst, A Love Story\" on September 21, 2014.[91][92] In May 2015, Kardashian released a portfolio book called Selfish, a 325-page collection of self-taken photos of herself.[93] In December 2015, Kardashian released an emoji pack for iOS devices called Kimoji.[94] The app was a best-seller, becoming one of the top 5 most bought apps that week.[94] In August 2015, Kardashian was the cover model for Vogue Spain.[95]\n\nAs of November 2016, as per CBC Marketplace and interviews with celebrity endorsement experts, Kim Kardashian was paid between $75,000 and $300,000 for each post that she made on Instagram, Facebook and Twitter endorsing beauty products like waist trainers, teeth whiteners as well as Coca-Cola and well-known charities. Experts think that celebrities offer fake glimpses into their lives to make viewers fall for their advertising pitches, curated to look as though the viewer is catching them in a spontaneous moment when they are mostly staged.[96]\n\nBusiness ventures (2017–present)\n\nIn June 2017, she launched her beauty line, KKW Beauty,[97] and in November, she launched her fragrance line, KKW Fragrance.[98]\n\nBy 2018, according to Business Insider, Kardashian was charging $720,000 per Instagram post. Even though engagement data indicates that her posts are worth slightly less,[99] her regular features in the news allows her to demand a premium above any calculated Instagram sponsored post price. Kardashian made a cameo appearance in the heist film Ocean's 8, which was released on June 8, 2018.[100][101] In 2019, Kardashian appeared at the Met Gala with her figure hugging corset-induced Thierry Mugler dress.[102][103]\n\nIn June 2019, Kardashian launched a new range of shapewear called \"Kimono\". Kardashian was heavily criticized over the name of the brand, which critics argued disrespected Japanese culture and ignored the significance behind the traditional outfit. Following the launch of the range, the hashtag #KimOhNo began trending on Twitter and the mayor of Kyoto wrote to Kardashian to ask her to reconsider the trademark on Kimono. In response to public pressure, in July 2019, Kardashian announced that she would change the name.[104] However, Japanese trade minister Hiroshige Seko stated that he would still be dispatching patent officials for a meeting at the U.S. Patent and Trademark Office, and that Japan would keep an eye on the situation.[105] In August 2019, she changed and rebranded the shapewear company to the name Skims,[106][107] officially launching the following month on its own digital store[108] and later made available on various other websites (such as online stores of SSENSE, David Jones, Net-a-Porter, Ounass).[109][110][111]\n\nKardashian explained her vision of creating and running a brand focused on body positivity and size inclusivity, saying: \"Diversity and inclusivity are in our brand DNA. We started Skims with those two elements being front of mind and today they continue to be the driving forces behind ensuring that what we create is for everyone and everybody...In doing this, it was especially important that we were size-inclusive and offered a range of colours.\"[112] In early February 2020, under a retail partnership with Nordstrom, Skims' products were made available to shop exclusively at the chain's stores across the United States.[113][114] The company has also expanded into lingerie, bodysuits, loungewear, dresses, and winterwear.[115] Since 2021, Skims has opened various pop-up stores in the United States, Europe and Asia.[116][117][118][119][120] In June 2021, Kardashian revealed the brand entered into a partnership with the US Olympics team under which the company would provide undergarments, loungewear and pajamas and other clothing items with American flags and the Olympics rings with a Team USA branding printed on them to the team's female athletes at the 2020 Summer Olympics and Paralympics.[121] The athletes also wore Skims' clothing at the 2022 Winter Olympics,[122] and were featured in the brand's campaign for a capsule collection launched ahead of the event, in collaboration with the United States' Winter Olympics delegation.[123] In October 2021, it was announced that luxury fashion house Fendi would release a capsule collection in collaboration with Skims.[124] The collaboration, titled Fendi x Skims, – consisting of a range of shapewear, leather dresses, and bodysuits – was released in November that year, with an additional second product release the following month.[125][126][127] That month, Kardashian was also honored with the Brand Innovator award, for her work on Skims, at the 2021 WSJ. Innovator Awards.[128] In January 2022, it was reported that her company stood at a valuation of US$3.2 billion.[129]\n\nIn 2022, Kardashian founded Skky Partners, a private equity firm, with a former partner of the Carlyle Group. Her mother, Kris Jenner, is a partner at the firm.[130]\n\nKardashian hosted Saturday Night Live in October 2021 and in her monologue, she made fun of her estranged-husband Kanye West, her mother's ex-husband Caitlyn Jenner, her sisters, O. J. Simpson and others.[131] In July 2022, she made her Paris Fashion Week modeling debut on the catwalk for fashion house Balenciaga along with Nicole Kidman; Dua Lipa; and Christine Quinn from the reality television show Selling Sunset.[132]\n\nCryptocurrency promotion\n\nIn January 2022, in a class-action lawsuit filed against the cryptocurrency company EthereumMax that alleged the company is a pump and dump scheme, Kardashian was named as a defendant along with former professional boxer Floyd Mayweather Jr., former NBA player Paul Pierce, and other celebrities for promoting the EthereumMax token on their social media accounts.[133][134] In February 2022, the U.S. 11th Circuit Court of Appeals ruled in a lawsuit against Bitconnect that the Securities Act of 1933 extends to targeted solicitation using social media.[135]\n\nIn October 2022, the U.S. Securities and Exchange Commission announced that Kardashian had agreed to pay a $1.26 million fine, to not promote cryptocurrency assets for three years, and to cooperate with an ongoing investigation without admitting or denying wrongdoing for failing to report receiving a $250,000 payment to promote the EthereumMax token.[136][137]\n\nPersonal life\n\nRelationships\n\nIn 2000, 19-year-old Kardashian eloped with music producer Damon Thomas.[138] Thomas filed for divorce in 2003. Kardashian later blamed their separation on physical and emotional abuse on his part[139] and said she was high on ecstasy during the ceremony.[140] Before her divorce was finalized, Kardashian began dating singer Ray J.[138]\n\nIn May 2011, Kardashian became engaged to NBA player Kris Humphries, then of the New Jersey Nets, whom she had been dating since October 2010.[141] They were married in a wedding ceremony on August 20 in Montecito, California.[142] Earlier that month, she had released her \"wedding fragrance\" called \"Kim Kardashian Love\" which coincided with her own wedding.[56][143] A two-part TV special showing the preparations and the wedding itself aired on E! in early October 2011, amidst what The Washington Post called a \"media blitz\" related to the wedding.[144] After 72 days of marriage, she filed for divorce from Humphries on October 31, citing irreconcilable differences.[145] Several news outlets surmised that Kardashian's marriage to Humphries was merely a publicity stunt to promote the Kardashian family's brand and their subsequent television ventures.[146] A man professing to be her former publicist, Jonathan Jaxson, also claimed that her short-lived marriage was indeed staged and a ploy to generate money. Kardashian filed a suit against Jaxson, saying his claims were untrue, and subsequently settled the case that included an apology from Jaxson.[147] A widely circulated petition asking to remove all Kardashian-related programming from the air followed the split.[148] The divorce was subject to widespread media attention.[149]\n\nKardashian began dating rapper and longtime friend Kanye West in April 2012, while still legally married to Humphries.[150] Her divorce was finalized on June 3, 2013,[151] Kardashian and West became engaged on October 21, Kardashian's 33rd birthday,[152] and married on May 24, 2014, at Forte di Belvedere in Florence, Italy.[153] Her wedding dress was designed by Riccardo Tisci of Givenchy[154] with some guests' dresses designed by designer Michael Costello.[155] The couple's high status and respective careers have resulted in their relationship becoming subject to heavy media coverage; The New York Times referred to their marriage as \"a historic blizzard of celebrity\".[6] In January 2021, CNN reported that the couple were discussing divorce[156] and on February 19, 2021, Kardashian officially filed for divorce.[157] In April 2021, they both agreed before court that they would end their marriage due to \"irreconcilable differences\" and agreed to joint custody of their four children. They also agreed that neither of them need spousal support.[158] In February 2022, Kardashian filed a complaint to the Los Angeles Superior Court, asking for a quicker proceedings in the divorce from West, saying that West was trying to delay it and saying that \"Mr. West, by his actions, has made it clear that he does not accept that the parties' marital relationship is over.\"[159] Kardashian was declared legally single on March 2, 2022.[160]\n\nKardashian began dating actor and comedian Pete Davidson in November 2021.[161][162] In August 2022, they ended their relationship.[163]\n\nReligion\n\nKim Kardashian is a Christian and has described herself as \"really religious\".[164] She was educated in Christian schools of both the Presbyterian and Roman Catholic traditions.[164] In October 2019, she was baptized in an Armenian Apostolic ceremony at the baptistery in the Etchmiadzin Cathedral complex and given the Armenian name Heghine (Հեղինէ).[165]\n\nIn April 2015, Kardashian and West traveled to the Armenian Quarter of the Old City in Jerusalem to have their daughter North baptized in the Armenian Apostolic Church, one of the oldest denominations of Oriental Orthodox Christianity. The ceremony took place at the Cathedral of St. James.[166] Khloé Kardashian was appointed the godmother of North.[167] In October 2019, Kim baptized her three younger children at the baptistery in the Etchmiadzin Cathedral complex, Armenia's mother church.[168][169] Psalm was given the Armenian name Vardan, Chicago received Ashkhen and Saint received Grigor.[170]\n\nHealth and pregnancies\n\nKardashian and West have four children: daughter North (born June 15, 2013),[171] son Saint (born December 5, 2015),[172] daughter Chicago (born January 15, 2018),[173] and son Psalm (born May 9, 2019).[174][175]\n\nKardashian has publicly discussed difficulties during her first two pregnancies. She experienced pre-eclampsia during her first, which forced her to deliver at 34 weeks. With both pregnancies, she developed placenta accreta after delivery, eventually undergoing surgery to remove the placenta and scar tissue.[176][177] After her second pregnancy, doctors advised her not to become pregnant again;[178] her third and fourth children were born via surrogacy.[177][179] Kardashian has also spoken about her psoriasis.[180]\n\nIn May 2021, it was reported that Kardashian had tested positive for COVID-19 in November 2020. She confirmed this report[181] but denied reports that she caught the disease after hosting a party at a private island.[182]\n\nWealth\n\nKardashian in Australia for the E! News: Red carpet and dinner in 2012\n\nIn May 2014, Kardashian was estimated to be worth US$45 million.[183] In 2015, Forbes reported she had \"made more this year than ever as her earnings nearly doubled to $53 million from 2014's $28 million\", and reported that she \"has monetized fame better than any other\".[184] Much of her income includes wholesale earnings of the Sears line, the Kardashian Kollection, which brought in $600 million in 2013 and the Kardashian Beauty cosmetics line, Kardashian-branded tanning products, the boutique-line DASH, as well as sponsored social media posts which are collectively worth $300,000–500,000 per post.[185][186] As of July 2018, Kardashian was worth US$350 million.[187] Kardashian does not receive alimony payments from either of her first two marriages.[188] On April 6, 2021, Forbes estimated Kardashian's net worth at US$1 billion.[189]\n\nParis robbery\n\nOn October 2, 2016, while attending Paris Fashion Week, Kardashian was robbed at gunpoint in the apartment where she was staying. Five individuals, dressed as police officers, bound and gagged her, then stole $10 million worth of jewelry.[190] The thieves got in her residence by threatening the concierge. Once they accessed Kardashian's room, they held a gun to her head, tying her wrists and legs and wrapping duct tape around her mouth as a gag.[191] Kardashian, who was placed in the bathtub, was physically unharmed and reportedly begged for her life.[192][193][194] She managed to wriggle her hands free from the plastic ties around her wrists and scream for help. The thieves escaped.[195] On October 6, 2016, it was revealed that filming for the next season of Keeping up with the Kardashians had been placed \"on hold indefinitely\" after the robbery.[196]\n\nAfter the robbery was announced, several critics expressed skepticism about whether it was staged or not, with some even drawing comparison to Olympic swimmer Ryan Lochte's recent false robbery claim.[197][198] On October 10, 2016, a video was released showing Kardashian immediately after the robbery, as police began conducting their investigation. In the video, she is seen using the cell phone that she had reported stolen, and did not have any of the markings she claimed from being bound by her captors, prompting more questions as to whether or not the events were staged.[199] In response, Kardashian filed lawsuits against several media outlets the following day, and secured a gag order to get the video removed from any articles due to it being part of an active police investigation.[200][201][202] On October 25, 2016, Kardashian dropped the lawsuit, prompting more criticism that the robbery was a ploy to generate media attention.[203][204] Production resumed on Keeping Up with the Kardashians on October 26.[205]\n\nOn January 9, 2017, French police detained 17 persons of interest for questioning in the robbery case.[206] Later in 2017, 16 people were arrested for their alleged involvement.[207] It was revealed in 2020 that French prosecutors would seek trial for 12 of the suspects.[208] The suspects who allegedly entered her room were of, or near, senior age and were named the 'Grandpa Robbers' by the press.[209] In 2021, the suspects were still awaiting trial with at least one of the five who entered Kardashian's room reportedly set to plead no contest to the charges.[210]\n\nActivism\n\nDuring an interview with Caity Weaver of GQ for the July 2016 issue, Kardashian described herself as a Democrat, and declared support for Hillary Clinton in the 2016 U.S. presidential election.[211]\n\nKardashian has expressed pride in her Armenian and Scottish ancestry.[212][213] She is not a citizen of either Armenia or the United Kingdom and does not speak Armenian.[214] She has advocated for the recognition of the Armenian Genocide on numerous occasions and encouraged President Barack Obama and the United States government to consider its acknowledgement.[215][216][217] In April 2015, Kardashian traveled to Armenia with her husband, her sister Khloé, and her daughter North and visited the Armenian Genocide memorial Tsitsernakaberd in Yerevan.[218] In April 2016, Kardashian wrote an article on her website condemning The Wall Street Journal for running an advertisement by FactCheckArmenia.com denying the Armenian Genocide.[219] During her visit to Armenia in 2019, she stated that she \"talk[s] about [the Armenian Genocide] with people internally at the White House\". However, she added that she hasn't \"had a private conversation\" with President Donald Trump about it.[220] In 2020, Kardashian condemned the actions of Azerbaijan in the 2020 Nagorno-Karabakh conflict and expressed her support to Armenia and the Republic of Artsakh.[221][222] In April 2021, Kardashian wrote a letter to President Joe Biden thanking him for officially recognizing the Armenian Genocide, thus becoming the first ever US president to do so.[223]\n\nIn April 2019, Vogue reported that Kardashian was studying to pass the bar exam; instead of attending law school, she is \"reading law\".[224] In 2021, Kardashian said she had failed her first-year law exam (the baby bar) for a second time, performing \"slightly worse\" than her first attempt earlier in the year.[225][226] In December 2021, she passed the \"baby bar\" law exam on her fourth attempt.[227]\n\nIn January 2017, she tweeted a table of statistics that went viral, highlighting statistics that show that gun violence in the United States kills 11,737 people annually while terrorism in the United States kills 14 people annually. In December 2017, the tweet was mentioned by the Royal Statistical Society in the announcement of its \"International Statistic of the Year\" for 2017.[228][229]\n\nOn a trip to Uganda in October 2018, she and her husband met with President Yoweri Museveni. They had a press conference, and Kanye talked about tourism in Uganda. They were criticized for meeting Museveni due to his being a dictator and his recent crackdown on the opposition and the Ugandan LGBT community.[230][231][232]\n\nOn October 10, 2020, Kardashian announced she donated $1 million to Armenia Fund, a humanitarian organization that supports Armenia's development. She also had previously posted messages on social media in support of Artsakh due to the recent war that broke out between Artsakh and Azerbaijan regarding the disputed territory of Nagorno-Karabakh.[233] She also urged followers to donate too.[234]\n\nKardashian has also contributed to private GoFundMe causes, especially of people affected by the COVID-19 pandemic.[235] In September 2021, she donated $3,000 to a mother of four who had lost her husband to COVID-19 and was about to be evicted from her home.[235]\n\nOn November 20, 2021, it was reported that Kardashian and the English soccer club Leeds United F.C. had financially helped female Afghan soccer players to make their way to England. The women and girls had escaped Afghanistan following the Taliban takeover, but were stranded in Pakistan.[236][237]\n\nPrison reform and clemency advocacy\n\nKardashian has worked in the area of prison reform, advocating for the commutation of the sentence of Chris Young and also of Alice Marie Johnson, a woman who received a life sentence for a first-time drug offense as the leader of a major cocaine ring in Tennessee[238][239][240] which was granted by President Donald Trump in June 2018.[241][242] Along with Van Jones and Jared Kushner, she was instrumental in persuading President Trump to support the First Step Act, which enacted major reforms in the US prison system. Van Jones later stated that without Kardashian, the act would have never passed because it would not have received the president's support. It was later passed by a great majority in the US Senate.[243][244][245]\n\nIn early 2019, Kardashian largely funded the 90 Days to Freedom campaign, an initiative to release nonviolent drug offenders from life sentences by attorneys Brittany K. Barnett and MiAngel Cody.[246] The effort resulted in 17 persons being released under provisions of the First Step Act.[246] Kardashian was widely credited for the success of the campaign in media headlines.[247] Commentary on her involvement ranged from praise, to assertions that it was a public relations stunt, to accusations that she was taking the credit for work she did not do.[246] In a Facebook post from May 7 of that year, Barnett commented on the divisive and underfunded nature of the \"criminal justice reform space\", adding, \"Kim linked arms with us to support us when foundations turned us down. We and our clients and their families have a lot of love for her and are deeply grateful for her.\"[248][249]\n\nIn early April 2022, Kardashian advocated for the clemency of Melissa Lucio, the only woman of Hispanic descent on Texas' death row, in a series of tweets. She tweeted, \"I recently just read about the case of Melissa Lucio and wanted to share her story with you. She has been on death row for over 14 years for her daughter's death that was a tragic accident.\"[250][251] Lucio is on death row for the abuse and death of her daughter, who was two years old. Kardashian deleted the series of tweets the same day.[250] When Lucio was granted a stay of execution on April 25, Kardashian celebrated on her social media channels.[252]\n\nIn July 2022, Kardashian expressed support for the release, and petitioned, for rapper Gunna, who is imprisoned without bond, charged with one count of violating the Racketeer Influenced and Corrupt Organizations Act.[253]\n\nFilmography\n\nAwards and nominations\n\nTeen Choice Awards\n\nOther awards\n\nBibliography\n\nSee also\n\nNotes", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Kim_Kardashian_signature.svg/80px-Kim_Kardashian_signature.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/19px-P_vip.svg.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/0/08/President_Trump_Meets_with_Sentencing_Commutation_Recipients_%2849624188912%29_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Kim_Kardashian_6.jpg/220px-Kim_Kardashian_6.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/Kim_Kardashian_and_Kanye_West_at_the_Met_Gala_in_2019.png/260px-Kim_Kardashian_and_Kanye_West_at_the_Met_Gala_in_2019.png", "http://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "http://en.wikipedia.org/static/images/footer/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/21px-Blank_television_set.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Kim_Kardashian_2010.jpg/170px-Kim_Kardashian_2010.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Kim_Kardashian_signature.svg/100px-Kim_Kardashian_signature.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Kim_Kardashian_West%2C_Parramatta_Westfield_Sydney_Australia_-_15035243919_%28cropped%29.jpg/170px-Kim_Kardashian_West%2C_Parramatta_Westfield_Sydney_Australia_-_15035243919_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Kim_Kardashian_5%2C_2012.jpg/170px-Kim_Kardashian_5%2C_2012.jpg", "http://upload.wikimedia.org/wikipedia/commons/0/08/President_Trump_Meets_with_Sentencing_Commutation_Recipients_%2849624188912%29_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Kim_Kardashian_in_front_of_the_Armenian_Genocide_Memorial_in_2019.jpg/220px-Kim_Kardashian_in_front_of_the_Armenian_Genocide_Memorial_in_2019.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/0/08/President_Trump_Meets_with_Sentencing_Commutation_Recipients_%2849624188912%29_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Kim_Kardashian", "title": "Kim Kardashian", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/0/08/President_Trump_Meets_with_Sentencing_Commutation_Recipients_%2849624188912%29_%28cropped%29.jpg", "width": 640, "height": 878}, "title": "Kim Kardashian - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}