{"url": "https://www.livestrong.com/article/255500-how-to-cure-an-acne-breakout-overnight/", "text": "Oily and combination skin naturally produces excess sebum -- otherwise known as skin oils. For some this creates a sheen on the skin, while others experience blemishes from oil buildup. Skin needs to be balanced in order to minimize oil production without drying out. Some chemical products strip the skin and cause it to overcompensate by producing more sebum. Natural ingredients cleanse and nourish your skin without causing irritation. Take on a natural skin-care routine to reduce overactive sebum glands, and leave the blotting papers at home.\n\nCool Cleansing\n\nCleansing skin morning and night will help to prevent oil buildup and blackheads. Combine 1/2 cup of rolled oats, 1/4 cup of lemon juice, 1/4 cup of water and 1/2 tablespoon of honey. Wet your face with warm water to open your pores, and massage the mixture over your face using an upward circular motion for 30 seconds. Rinse with warm water and use a clean cotton cloth to wipe away any remaining cleanser.\n\nCleansing skin morning and night will help to prevent oil buildup and blackheads.\n\n\n\nWet your face with warm water to open your pores, and massage the mixture over your face using an upward circular motion for 30 seconds.\n\nT-Zone Toning\n\nHow to Clear Sebum From Pores\n\nLearn More\n\nToning is essential in balancing the skin. Drying out oily skin will only lead your skin to overcompensate with excess sebum production in the future. Witch hazel is a natural toner that is ideal for oily skin 1. It clears any remaining debris and residue from your pores, while restoring the natural pH balance. Skin is left feeling refreshed, but not tight and uncomfortable. Soak an exfoliating cotton pad in witch hazel after cleansing morning and night; smooth it over your skin, concentrating on the T-zone. The exfoliating cotton pad will gently remove dead skin as you tone and is less abrasive than a manual exfoliator.\n\nToning is essential in balancing the skin.\n\n\n\nThe exfoliating cotton pad will gently remove dead skin as you tone and is less abrasive than a manual exfoliator.\n\nHelpful Hydration\n\nOily skin needs to be moisturized to prevent it from overproducing sebum. Use essential oils to stop sebum production, while treating any blemishes and calming redness. Sea Buckthorn Oil contains vitamins A, E and C and absorbs into the skin to fight internal and external aggressors. It strengthens the skin to promote balance and healing. Massage a dime-size amount of oil into your skin both morning and night. Use an upward circular motion to encourage sebum to drain and prevent under-the-skin blemishes. Apply the oil while your skin is still damp from cleansing and toning so that it can be thoroughly absorbed.\n\nOily skin needs to be moisturized to prevent it from overproducing sebum.\n\n\n\nApply the oil while your skin is still damp from cleansing and toning so that it can be thoroughly absorbed.\n\nMega Masks\n\nHow to Get Clear & Spotless Black Skin\n\nLearn More\n\nCreate a mask with all-natural ingredients. Egg whites naturally tighten pores and can even help with hyperpigmentation and acne. Pour two egg whites into a bowl and use a whisk to mix them together. Smooth the mixture over your face after cleansing, and allow it to dry before rinsing with warm water. Use the mask twice a week to treat oily skin without drying it out.", "images": ["https://img-aws.ehowcdn.com/220x146/photos.demandstudios.com/getty/article/176/233/76648798.jpg", "https://img-aws.ehowcdn.com/220x146/photos.demandstudios.com/getty/article/176/217/624974302.jpg", "https://img-aws.ehowcdn.com/220x146/photos.demandstudios.com/getty/article/103/93/80707505.jpg", "https://img-aws.ehowcdn.com/220x146/s3-us-west-1.amazonaws.com/contentlab.studiod/getty/cache.gettyimages.com/ac1ecedf54a942c79306193c49d65ec1.jpg", "https://img-aws.ehowcdn.com/220x146/photos.demandstudios.com/getty/article/108/224/114857756.jpg", "https://img-aws.ehowcdn.com/220x146/s3.amazonaws.com/photography.prod.demandstudios.com/5842d32f-f351-465b-8e80-9be6b3d93ff7.jpg", "https://img-aws.ehowcdn.com/220x146/photos.demandstudios.com/getty/article/152/46/105938531.jpg", "https://img-aws.ehowcdn.com/220x146/photos.demandstudios.com/getty/article/69/12/medfrd1510.jpg", "https://healthfully.com/public/images/healthfully-logo.svg", "https://img-aws.ehowcdn.com/220x146/photos.demandstudios.com/getty/article/88/119/94787724.jpg", "https://img-aws.ehowcdn.com/220x146/photos.demandstudios.com/getty/article/106/112/151545089.jpg"], "top_img": "https://healthfully.com/public/images/healthfully-logo.svg", "keywords": [], "authors": ["Celeigh O'Neil"], "canonical_link": "https://healthfully.com/is-there-a-natural-way-to-reduce-overactive-sebum-glands-8141350.html", "title": "Is There a Natural Way to Reduce Overactive Sebum Glands?", "meta_data": {"viewport": "width=device-width,initial-scale=1", "og": {"site_name": "Healthfully", "url": "https://healthfully.com/is-there-a-natural-way-to-reduce-overactive-sebum-glands-8141350.html", "description": "Find your way to better health.", "type": "website", "title": "Healthfully", "image": "//healthfully.com/public/images/healthfully-logo.svg"}, "description": "Find your way to better health.", "pagetype": "Home", "msvalidate.01": "129B5DE6FF8DD0ECBDD457C93FF101E3", "theme-color": "#1AA8E8", "apple-mobile-web-app-capable": "no", "apple-mobile-web-app-status-bar-style": "default", "apple-mobile-web-app-title": "Healthfully", "msapplication-TileImage": "//healthfully.com/dist/favicons/mstile-150x150.png", "msapplication-TileColor": "#1AA8E8"}, "movies": [], "publish_date": null, "source": "https://www.livestrong.com", "summary": ""}