{"url": "https://www.cnn.com/2018/02/05/us/larry-nassar-sentence-eaton/index.html", "text": "Story highlights Judge admonishes Nassar, says he still doesn't understand gravity of crimes Disgraced doctor now faces at least 100 years in prison combined\n\nCNN —\n\nLarry Nassar was sentenced Monday to 40 to 125 years in prison, ending a remarkable three weeks of court hearings that dramatically personalized the pain and suffering the former doctor caused for years.\n\nAt his sentencing hearing in Eaton County, Michigan, Nassar apologized for his years of sexual abuse, saying victim statements had “impacted me to my innermost core.”\n\n“With that being said, I understand and acknowledge that it pales in comparison to the pain, trauma and emotions that you all are feeling,” he said. “It’s impossible to convey the depth and breadth of how sorry I am to each and everyone involved. The visions of your testimonies will forever be present in my thoughts.”\n\nBut Judge Janice Cunningham, citing Nassar’s earlier claims of no wrongdoing, sentenced him to a lengthy stay in prison and said that he was in “denial.”\n\n“I am not convinced that you truly understand that what you did was wrong and the devastating impact you’ve had on the victims, family and friends,” Cunningham said.\n\nNassar had pleaded guilty to three counts of criminal sexual conduct in Eaton County. The sentence was the third in as many months for Nassar, the once-renowned doctor for USA Gymnastics and Michigan State University. He admitted to using his position as a trusted doctor to sexually abuse young girls under the guise of providing medical treatment.\n\nThis Eaton County sentence will run concurrently with the 40-to-175-year sentence in Ingham County, Michigan. He will serve those sentences after a separate 60-year sentence in federal prison for child pornography, meaning Nassar will serve at least 100 years in prison – an effective life sentence.\n\n“You will be left to sit there with only the memories of destroying your own family,” Cunningham said. “I do not believe that you will have the ability to shut out the words of the children, and the young women and the adults who trusted you and who you let down.\n\n“That will be your lifetime consequence.”\n\nPowerful victim impact statements\n\nVideo Ad Feedback 01:52 - Source: CNN Dad lunges at Nassar in court room\n\nNassar’s time in court was notable for the passionate, righteous speeches from the survivors of his abuse. Nearly 200 girls and women – ranging from accomplished Olympic gymnast Aly Raisman to a 12-year-old poet named Amanda on Friday – spoke out in person or in statements at the Ingham County and Eaton County courts about how Nassar’s sexual abuse changed their lives.\n\n“How much is a little girl worth?” Rachael Denhollander, the woman who first brought Nassar’s abuse to public attention in 2016, asked the court in Eaton County.\n\n“I am asking you to tell these little girls, tell the young women, tell the watching world, that they are worth everything,” she told the judge.\n\nThe heated atmosphere over the past few weeks culminated Friday when Randall Margraves, a father of three victims, tried to attack Nassar in open court.\n\nNassar, meanwhile, mostly sat quietly, occasionally shaking his head or wiping away tears. He did not visibly react to the sentence on Monday.\n\nThat may be the last time Nassar is heard from publicly, but his impact is far from over. The stunning victim impact statements from the “army of survivors” have focused sharply critical attention on the systems of power that protected Nassar for so long.\n\nMichigan State University, USA Gymnastics and the US Olympic Committee have denied they helped cover up the abuse. Still, the organizations have seen major leadership shake-ups and face extensive legal investigations into their inner workings to find out who knew what, when they knew it and what they did about it.\n\n“As detectives, attorneys and survivors have previously noted, a pedophile cannot flourish in the way Larry did in an environment that is not conducive to his behavior,” abuse survivor Annie Labrie said in court Wednesday.\n\n“He was prolific because surrounding authorities allowed him to be. Because the gymnastics world allowed him to be.”\n\nHow we got here\n\n\"The tables have turned Larry,\" Olympic gymnast Aly Raisman told Nassar in Ingham County court on January 19. \"We are here. We have our voices, and we are not going anywhere.\" POOL\n\nAs recently as a few years ago, Nassar was widely respected in the gymnastics community and beyond for his treatment of injured athletes. For years, he claimed that his invasive “pelvic floor” treatment, in which he put his fingers into young girls’ vaginas, was a cure-all that could fix any number of physical injuries.\n\nA number of his victims said they felt violated during the procedure and complained to coaches, trainers or even police. But he was a respected doctor who treated the world’s best gymnasts. Their concerns were brushed aside or otherwise dismissed, and Nassar continued to abuse his patients.\n\nIn 2014, for example, Amanda Thomashow told Michigan State Title IX investigators and MSU Police that his treatment was really sexual assault. Nassar, who told police he was known as “the body whisperer” for his close relationship with patients, said Thomashow simply didn’t understand the procedure.\n\nThe investigation ultimately cleared him of misconduct, and Nassar returned to abusing patients.\n\n“I think that the way that my investigation was handled was not in a way to bring out the truth, but instead it was performed in a way to conceal and protect a pedophile,” Thomashow said.\n\nSeparately, USA Gymnastics said it became aware of Nassar’s sexual abuse in the summer of 2015 when three top gymnasts said he abused them. After several weeks of its own investigation, the organization reported the allegations to the FBI in late July. Nassar was no longer allowed to treat patients at USA Gymnastics, but he continued to abuse young girls at Michigan State amid a slow FBI investigation.\n\nThat abuse went on until September 2016, when The Indianapolis Star published allegations against Nassar from Denhollander and an unnamed Olympic gymnast. After that first story, more than 50 women reported similar instances of sexual abuse, and Nassar was arrested in November 2016.\n\nThe 54-year-old’s life since then has been a series of guilty pleas, court hearings and prison sentences.\n\nNassar pleaded guilty to federal child pornography charges and was sentenced to 60 years in prison in December. He pleaded guilty to seven counts of criminal sexual conduct in Ingham County in Michigan and was sentenced to 40 to 175 years in prison two weeks ago.\n\n“I’ve just signed your death warrant,” Ingham County Judge Rosemarie Aquilina said as she delivered the sentence.", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/180131184622-01-larry-nassar-013118.jpg?q=x_4,y_19,h_2246,w_3991,c_crop/w_800", "https://media.cnn.com/api/v1/images/stellar/prod/180126125842-nassar-sandusky-split.jpg?q=x_2,y_0,h_898,w_1596,c_crop/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/180131172626-02-amanda-thomashow.jpg?q=x_8,y_264,h_2264,w_4023,c_crop/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/180131184622-01-larry-nassar-013118.jpg?q=x_4,y_19,h_2246,w_3991,c_crop/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/180205101423-larry-nassar-third-sentencing-michigan-sot-00000000.jpg?q=x_204,y_80,h_839,w_1491,c_crop/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/170706145549-eric-levenson.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/180119152936-aly-raisman-0119.jpg?q=x_0,y_0,h_1080,w_1919,c_fill/h_270,w_480"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/180131184622-01-larry-nassar-013118.jpg?q=x_4,y_19,h_2246,w_3991,c_crop/w_800", "keywords": [], "authors": ["Eric Levenson"], "canonical_link": "https://www.cnn.com/2018/02/05/us/larry-nassar-sentence-eaton/index.html", "title": "Larry Nassar sentenced to 40 to 125 years for sexual abuse", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Larry Nassar apologizes, gets 40 to 125 years for decades of sexual abuse | CNN", "description": "Larry Nassar was sentenced to 40 to 125 years in prison Monday for three counts of criminal sexual conduct, ending a remarkable three weeks of court hearings that dramatically personalized the pain and suffering the former doctor caused for years.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180131184622-01-larry-nassar-013118.jpg?q=x_4,y_19,h_2246,w_3991,c_crop/w_800", "type": "article", "url": "https://www.cnn.com/2018/02/05/us/larry-nassar-sentence-eaton/index.html", "site_name": "CNN"}, "twitter": {"title": "Larry Nassar apologizes, gets 40 to 125 years for decades of sexual abuse | CNN", "description": "Larry Nassar was sentenced to 40 to 125 years in prison Monday for three counts of criminal sexual conduct, ending a remarkable three weeks of court hearings that dramatically personalized the pain and suffering the former doctor caused for years.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180131184622-01-larry-nassar-013118.jpg?q=x_4,y_19,h_2246,w_3991,c_crop/w_800", "card": "summary_large_image", "site": "@CNN"}, "description": "Larry Nassar was sentenced to 40 to 125 years in prison Monday for three counts of criminal sexual conduct, ending a remarkable three weeks of court hearings that dramatically personalized the pain and suffering the former doctor caused for years.", "template_type": "article_leaf", "type": "article", "meta-section": "us", "theme": "us", "article": {"published_time": "2018-02-05T10:30:05Z", "modified_time": "2018-02-05T19:17:10Z", "tag": "crime, law enforcement and corrections, crimes against persons, criminal offenses, larry nassar, sex and gender issues, sex crimes, sexual assault, society, sports figures, children, criminal law, guilty pleas, law and legal system, population and demographics, sentencing, gymnastics, investigations, sports and recreation, sports organizations and teams, usa gymnastics, michigan, midwestern united states, north america, united states, apologies, jail sentencing, prisons and jails", "publisher": "https://www.facebook.com/CNN"}, "keywords": "crime, law enforcement and corrections, crimes against persons, criminal offenses, larry nassar, sex and gender issues, sex crimes, sexual assault, society, sports figures, children, criminal law, guilty pleas, law and legal system, population and demographics, sentencing, gymnastics, investigations, sports and recreation, sports organizations and teams, usa gymnastics, michigan, midwestern united states, north america, united states, apologies, jail sentencing, prisons and jails", "author": "Eric Levenson", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1517788800.0, "source": "https://www.cnn.com", "summary": ""}