{"url": "https://www.todaysparent.com/blogs/trending/oprah-bought-mindy-kaling-the-most-epic-baby-gift-ever/", "text": "Because, duh, she's Oprah! The famous talk show host gifted her new mom friend and 'A Wrinkle in Time' co-star, Mindy Kaling, the best gift. Here's a hint: It involves two men and a U-Haul truck.\n\nFor the average mom, a new baby usually means gifts of flowers, cards and maybe some homemade meals. But when you’re a celebrity mom with famous friends, those are all just basic.\n\nMindy Kaling got her baby an amazingly glam stroller because of course she would In case you haven’t heard, Mindy Kaling recently welcomed a baby girl named Katherine in December. We know—she’s got to be the coolest mom ever, right? And, like most friends do when a new baby arrives, her A Wrinkle in Time co-star, Oprah Winfrey, wanted to give her a special gift.\n\n“I got a call from my assistant,” Mindy told USA Today. “She said ‘Oprah’s assistant contacted me, she’d like to drop off a present.’ I’m thinking, that’s so nice, like, (it’s) probably flowers. I had a kid, I’m a single mom. That’s really nice Oprah remembered.”\n\nLittle did Mindy know that there was a pleasant surprise headed her way.\n\n“Two men are going to be coming to your house, they said, with a U-Haul truck,” Mindy continued. Oprah, sitting beside Mindy in the interview, agreed with a simple, “True.”\n\n“All you want in life is to hear that two men in a U-Haul truck are coming to your house because Oprah sent them. I was supposed to go to work that day (but I was like), I gotta be here.”\n\nWe totally feel you on that, Mindy! You’d have been crazy not to sit around and wait. So what was it?\n\n“They arrived with a hand-carved bookcase, prettier than any professional dollhouse you had ever seen that contained a hundred of the classic essential books in children’s literature,” Mindy continued. “And I held my baby up to it and I said, ‘Did you see what Miss Winfrey did for you?'”\n\nBut that was not all!\n\nIn classic Oprah fashion, she went above and beyond to make the gift even sweeter and had each book branded with “Katherine’s Book Club” on it—AWWW! Oprah officially wins the Best Baby Gifter EVER title in our books, but apparently, the gift wasn’t up to The Mighty Ope’s standards.\n\n“It wasn’t as perfect as I wanted it to be,” Oprah said. She had envisioned the dollhouse to look like the treehouse Mindy’s Wrinkle character, Mrs. Who, lives in. But Mindy disagreed by saying, “Now it only looks like a beautiful castle.” To which Oprah replied, “It was the best I could do.”\n\n“It’s the most amazing gift,” said Mindy, and we definitely agree with that.\n\nCan we please be friends with DOPErah, please? We’re super jealous.\n\nRead more:\n\nCelebrity push presents: From the sweet to the over-the-top\n\n13 baby shower gifts you probably never thought of", "images": ["https://www.todaysparent.com/wp-content/uploads/2018/02/Mindy-Kaling-and-Oprah-Winfrey-768x432-1519837307.jpg", "https://www.todaysparent.com/wp-content/plugins/rdm-daac-notice/public/images/close.png", "https://secure.gravatar.com/avatar/71ee57a4ef2616fe9dd09bd8957c8c96?s=128&d=mm&r=g", "https://www.todaysparent.com/wp-content/uploads/2017/07/reasons-why-mindy-kaling-with-a-great-mom-1280x960-344x226.jpg", "https://www.todaysparent.com/wp-content/themes/todaysparent.com/assets/images/logo.png", "https://www.todaysparent.com/wp-content/plugins/rdm-daac-notice/public/images/info.png", "https://www.todaysparent.com/wp-content/uploads/2018/02/Mindy-Kaling-and-Oprah-Winfrey.jpg"], "top_img": "https://www.todaysparent.com/wp-content/uploads/2018/02/Mindy-Kaling-and-Oprah-Winfrey.jpg", "keywords": [], "authors": ["Jessica Spera"], "canonical_link": "https://www.todaysparent.com/blogs/trending/oprah-bought-mindy-kaling-the-most-epic-baby-gift-ever/", "title": "Oprah gave Mindy Kaling the most thoughtful baby gift EVER", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0", "apple-mobile-web-app-capable": "yes", "description": "Oprah gifted her new mom friend and 'A Wrinkle in Time' co-star, Mindy Kaling, the best gift. Here's a hint: It involves two men and a U-Haul truck.", "og": {"locale": "en_US", "type": "article", "title": "Oprah gave Mindy Kaling the most thoughtful baby gift EVER", "description": "Oprah gifted her new mom friend and 'A Wrinkle in Time' co-star, Mindy Kaling, the best gift. Here's a hint: It involves two men and a U-Haul truck.", "url": "https://www.todaysparent.com/blogs/trending/oprah-bought-mindy-kaling-the-most-epic-baby-gift-ever/", "site_name": "Today's Parent", "image": {"identifier": "https://www.todaysparent.com/wp-content/uploads/2018/02/Mindy-Kaling-and-Oprah-Winfrey.jpg", "secure_url": "https://www.todaysparent.com/wp-content/uploads/2018/02/Mindy-Kaling-and-Oprah-Winfrey.jpg", "width": 1280, "height": 960, "alt": "Actors Oprah Winfrey (L) and Mindy Kaling of A WRINKLE IN TIME took part today in the Walt Disney Studios live action presentation at Disney's D23 EXPO 2017 in Anaheim, Calif"}}, "article": {"tag": "Mindy Kaling", "section": "Blogs", "published_time": "2018-02-28T19:00:43+00:00"}, "twitter": {"card": "summary_large_image", "description": "Oprah gifted her new mom friend and 'A Wrinkle in Time' co-star, Mindy Kaling, the best gift. Here's a hint: It involves two men and a U-Haul truck.", "title": "Oprah gave Mindy Kaling the most thoughtful baby gift EVER", "site": "@todaysparent", "image": "https://www.todaysparent.com/wp-content/uploads/2018/02/Mindy-Kaling-and-Oprah-Winfrey.jpg", "creator": "@todaysparent"}, "generator": "WordPress 4.9.13"}, "movies": [], "publish_date": 1519844443.0, "source": "https://www.todaysparent.com", "summary": ""}