{"url": "https://www.celebritynetworth.com/richest-celebrities/models/lala-kent-net-worth/", "text": "What Is Lala Kent's Net Worth?\n\nLala Kent is an American reality television personality, actress, author, and entrepreneur who has a net worth of $2 million. Kent is best known for being a cast member of the Bravo reality TV series \"Vanderpump Rules\" (2015–present). Lala was a recurring cast member during seasons four and five and became a main cast member in season six.\n\nKent has more than 1.7 million followers on Instagram, and she owns the Give Them Lala Beauty cosmetics line and the Give Them Lala Skin skincare line. As an actress, Kent has appeared in several films, including \"Reflections in the Mud\" (2009), \"The Mentor\" (2014), \"One Shot\" (2014), \"Pitching Love and Catching Faith\" (2015), \"10 Minutes Gone\" (2019), and \"Hard Kill\" (2020). She published the book \"Give Them Lala\" in 2021, and she hosts a podcast of the same name.\n\nEarly Life\n\nLala Kent was born Lauren Elyse Burningham on September 2, 1990 in Salt Lake City, Utah. She is the daughter of Lisa and Kent Burningham, and sadly, her father passed away in 2018.\n\nCareer\n\nKent made her acting debut in the 2009 film \"Reflections in the Mud,\" followed by 2014's \"The Mentor\" and \"One Shot\" and 2015's \"Pitching Love and Catching Faith\" and \"Dudes & Dragons.\" In 2015, Kent began appearing on \"Vanderpump Rules,\" which takes place at Lisa Vanderpump's West Hollywood restaurant SUR. Lala has worked as a hostess at SUR, and she has volunteered at The Vanderpump Dog Foundation. While starring on the show, she has appeared in the films \"The Row\" (2018), \"Vault\" (2019), \"10 Minutes Gone\" (2019), \"Trauma Center\" (2019), \"Spree\" (2020), \"Hard Kill\" (2020), \"The Estate\" (2020), \"American Traitor: The Trial of Axis Sally\" (2021), and \"Out of Death\" (2021). Kent is the owner of Give Them Lala Beauty and Give Them Lala Skin, which are cruelty-free and partners of PETA and Leaping Bunny.\n\nPersonal Life\n\nIn September 2018, Lala announced her engagement to producer Randall Emmett. The couple welcomed daughter Ocean on March 15, 2021, and they split up in October 2021.\n\nKent celebrated three years of sobriety on October 23, 2021, and she marked the occasion with an Instagram post stating \"Today marks 3 years of sobriety. I can't believe it. I'm beyond grateful for this path that God & my late father placed in front of me. I'm grateful for my sober coach & my sponsor who I consider angels. I'm grateful for the program & the men and women who have shared their stories so honestly, giving me hope and inspiration to continue to never pick up a drink again. It is one day at a time, but I will say, I have never felt so strong in my sobriety. It's the proudest thing I have ever done, aside from becoming a mother.\"\n\nIn her book, \"Give Them Lala,\" Kent revealed that she had an abortion when she was 22 years old because \"it was not the right situation to bring an innocent life into.\" She told \"People\" magazine, \"I feel like we are where we are in this world because people are so nervous to talk about things that make them uncomfortable. So we're mentioning it, we're talking about it and people can love it, hate it, or learn something from it.\"", "images": ["https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://vz.cnwimg.com/wp-content/uploads/2018/05/lj.jpg"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2018/05/lj.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/models/lala-kent-net-worth/", "title": "Lala Kent Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Lala Kent net worth: Lala Kent is an American reality television personality and actress who has a net worth of $2 million. Lala Kent", "cnw_share_fb_count": 89, "cnw_share_tw_count": 18, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Lala Kent Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/models/lala-kent-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2018/05/lj.jpg", "site_name": "Celebrity Net Worth", "description": "Lala Kent net worth: Lala Kent is an American reality television personality and actress who has a net worth of $2 million. Lala Kent"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2022-02-24T02:15:08+00:00", "published_time": "2022-02-23T03:47:58+00:00", "section": "Models", "tag": "lala kent worth"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2018/05/lj.jpg", "title": "Lala Kent Net Worth", "description": "Lala Kent net worth: Lala Kent is an American reality television personality and actress who has a net worth of $2 million. Lala Kent"}}, "movies": [], "publish_date": 1645588078.0, "source": "https://www.celebritynetworth.com", "summary": ""}