{"url": "www.wmagazine.com/story/kanye-west-reportedly-opening-a-restaurant-in-calabasas", "text": "After years of rapping about food (most famously, demanding “hurry up with my damn croissant” on Yeezus’ “I Am a God”), Kanye West may soon be selling it. The music artist and designer has been quietly looking to expand his portfolio into food service, according to a new report that says West has been eying storefronts for a restaurant in his wife Kim Kardashian’s native neighborhood, Calabasas.\n\n“Kanye’s shopping for the ideal premises to create a flagship restaurant in Calabasas,” a source told Radar. While the menu seemingly will not offer patrons the chance to demand their own croissants, it will be more “comfort food-oriented.” “He has this vision of creating high-end comfort food just like his mom used to make,” the source added, “but with a price tag that’s as eye-watering as it is mouth-watering, of course.” Of course.\n\nWest could always pad the menu with recipes from his wife, as she’s shared her love of cooking on social media, showing off her own fried chicken, cornbread, mac and cheese, sweet potatoes, and collard greens as part of her #SoulFoodSundays. While Kardashian received some backlash after first sharing photos from her meal back in July of 2016, she later posted testimonials from people she’s cooked for like Kevin Hart, who told her “You did that!,” and actor and TV host Terrence J, who said, “You made me a believer.” “You guys don’t understand, I’ve been making this food since high school, so when I started this post all of my high school friends were DM’ing me saying, ‘Blast from the past!,’” Kardashian explained earlier this year.\n\nWhatever does end up on the menu, it would be shocking if it didn’t include ice cream, which is one of the few things guaranteed to make West smile. Another thing that would likely delight West is being able to design custom uniforms for his restaurant staff.\n\nWhile the idea of a Kardashian-approved restaurant in Calabasas seems too impossible to fail, West would be taking a risk in venturing into the food and service industry. Few celebrities have actually thrived in that space, as just today brought the closure of Jessica Biel’s West Hollywood restaurant Au Fudge. Then again, he’s managed to crossover into fashion on his own terms and breaking into the food industry may be no different — so long as he can sell comfort food like Yeezys.", "images": ["https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/wmag/2018/07/18/5b4fbffb57e4ab30c538f5f8_kanye-west-restaurant-calabasas.jpg?w=414&h=276&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2018/07/18/5b4fbffb57e4ab30c538f5f8_kanye-west-restaurant-calabasas.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2022/10/5/47b5fa0f-fc48-4cb1-9604-6f5821fa832d-getty-1430611960.jpg?w=160&h=160&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.5093&fp-y=0.3502", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/uploads/image/2022/8/29/9f122c0b-8ad0-4d04-b2cf-3379547870db-tswifty.jpeg?w=160&h=160&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.532&fp-y=0.228"], "top_img": "https://imgix.bustle.com/wmag/2018/07/18/5b4fbffb57e4ab30c538f5f8_kanye-west-restaurant-calabasas.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.wmagazine.com/story/kanye-west-reportedly-opening-a-restaurant-in-calabasas", "title": "Kanye West Is Reportedly Opening a Restaurant in Calabasas and, No, It Won’t Be Serving Croissants", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@wmag", "card": "summary_large_image", "creator": "@marissagmuller"}, "article": {"publisher": "https://www.facebook.com/wmagazine"}, "og": {"site_name": "W Magazine", "url": "https://www.wmagazine.com/story/kanye-west-reportedly-opening-a-restaurant-in-calabasas", "type": "article", "title": "Kanye West Is Trying to Salvage the Failing Reputation of Celeb Restaurants By Opening His Own", "description": "No, it won't be serving croissants.", "image": {"identifier": "https://imgix.bustle.com/wmag/2018/07/18/5b4fbffb57e4ab30c538f5f8_kanye-west-restaurant-calabasas.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "No, it won't be serving croissants."}, "movies": [], "publish_date": null, "source": "http://www.wmagazine.com", "summary": ""}