{"url": "https://en.wikipedia.org/wiki/Natalie_Wood", "text": "American actress (1938–1981)\n\nNatalie Wood (born Natasha Zacharenko,[n 1] July 20, 1938 – November 29, 1981) was an American actress who began her career in film as a child and successfully transitioned to young adult roles.\n\nBorn in San Francisco to Russian immigrant parents, Wood started acting at age four and was given a co-starring role at age 8 in Miracle on 34th Street (1947).[6] As a teenager, she was nominated for an Academy Award for Best Supporting Actress for her performance in Rebel Without a Cause (1955), followed by a role in John Ford's The Searchers (1956). Wood starred in the musical films West Side Story (1961) and Gypsy (1962), and received nominations for an Academy Award for Best Actress for her performances in Splendor in the Grass (1961) and Love with the Proper Stranger (1963). Her career continued with films such as Sex and the Single Girl (1964), Inside Daisy Clover (1965), and Bob & Carol & Ted & Alice (1969).\n\nDuring the 1970s, Wood began a hiatus from film and had two daughters: one with her second husband Richard Gregson, and one with Robert Wagner, her first husband whom she married again after divorcing Gregson. She acted in only two feature films throughout the decade, but appeared slightly more often in television productions, including a remake of From Here to Eternity (1979) for which she won a Golden Globe Award. Wood's films represented a \"coming of age\" for her and for Hollywood films in general.[7] Critics have suggested that her cinematic career represents a portrait of modern American womanhood in transition, as she was one of the few to take both child roles and those of middle-aged characters.[8][9]\n\nWood died off the coast of Santa Catalina Island on November 29, 1981, at age 43, during a holiday break from the production of her would-be comeback film Brainstorm (1983) with Christopher Walken. The events surrounding her death have been the subject of conflicting witness statements,[10] prompting the Los Angeles County Sheriff's Department, under the instruction of the coroner's office, to list her cause of death as \"drowning and other undetermined factors\" in 2012.[11]\n\nIn 2018, Robert Wagner was named as a person of interest in the ongoing investigation into Wood's death.[12]\n\nEarly life [ edit ]\n\nWood was born Natalie Zacharenko[n 1] in San Francisco, California, to Maria Zudilova (1908[a]–1998), known variously as Mary, Marie and Musia, and her second husband, carpenter Nicholas Zacharenko (1912–1980).\n\nWood's mother Maria was born in Barnaul, southern Siberia. Her maternal grandfather owned soap and candle factories, as well as an estate outside the city.[16] With the start of the Russian Civil War, his family left Russia, resettling as refugees in the Chinese city of Harbin. In 1925,[13][18] Maria married Alexander Tatuloff, an Armenian mechanic. They had a daughter, Olga (1928–2015).[19] The Tatuloffs came to America by ship in 1930 and divorced in 1936.[20]\n\nWood's father Nicholas was born in Ussuriysk (then referred to as Nikolskoye).[21] Her paternal grandfather, a chocolate-factory worker who joined the anti-Bolshevik civilian forces during the war, was killed in a street fight in Vladivostok between Red and White Russian soldiers. After that, his widow and three sons fled to Shanghai, subsequently relocating to Vancouver at the time of Wood's paternal grandmother's remarriage in 1927.[21] By 1933 they moved to the US.[21] Nicholas met Wood's mother, four years his senior, while she was still married to her first husband.\n\nWood's parents were married in February 1938, five months before her birth. In 1942 they bought a home in Santa Rosa, where Natalie was noticed by members of a crew during a film shoot downtown. After Natalie started acting as a child, David Lewis and William Goetz, studio executives at RKO Radio Pictures, changed her last name to Wood, in reference to director Sam Wood. Wood's only full sibling, Svetlana Gurdin (the family had changed their surname), was born in Santa Monica in 1946. Now known as Lana Wood, she also became an actress.\n\nChild actress [ edit ]\n\nEarly roles [ edit ]\n\nDriftwood, 1947 Wood as Jenny Hollingsworth in, 1947\n\nA few weeks before her fifth birthday, Wood made her uncredited film debut in a fifteen-second scene in the film Happy Land (1943). Despite the brief part, she attracted the notice of the director, Irving Pichel. He remained in contact with Wood's family for two years, advising them when another role came up. The director telephoned Wood's mother and asked her to bring her daughter to Los Angeles for a screen test. Wood's mother became so excited that she \"packed the whole family off to Los Angeles to live,\" writes Harris. Wood's father opposed the idea, but his wife's \"overpowering ambition to make Natalie a star\" took priority. According to Wood's younger sister Lana, Pichel \"discovered her and wanted to adopt her.\"\n\nWood, then seven years old, got the part. She played a post-World War II German orphan, opposite Orson Welles as Wood's guardian and Claudette Colbert, in Tomorrow Is Forever (1946). When Wood was unable to cry on cue, her mother tore a butterfly to pieces in front of her to ensure she would sob for a scene.[29] Welles later said that Wood was a born professional, \"so good, she was terrifying.\"[30]\n\nWood acted in another film directed by Pichel, The Bride Wore Boots, and went on to 20th Century Fox to play Gene Tierney's daughter in The Ghost and Mrs. Muir (1947).\n\nMiracle on 34th Street [ edit ]\n\nWood's best-known film as a child was Miracle on 34th Street (1947), starring Maureen O'Hara at Fox. She plays a cynical girl who comes to believe a kindly department store holiday season employee portrayed by Edmund Gwenn is the real Santa Claus. The film has become a Christmas classic; Wood was counted among the top child stars in Hollywood after the film and was so popular that Macy's invited her to appear in the store's annual Thanksgiving Day parade.\n\nFilm historian John C. Tibbetts wrote that for the next few years following her success in Miracle, Wood played roles as a daughter in a series of family films: Driftwood (1947), at Republic;[31] Scudda Hoo! Scudda Hay! (1948); Chicken Every Sunday (1949); The Green Promise (1949); Fred MacMurray's daughter in Father Was a Fullback (1949), with O'Hara; Margaret Sullavan's daughter in No Sad Songs for Me (1950); the youngest sister in Our Very Own (1950); Never a Dull Moment (1950); James Stewart's daughter in The Jackpot (1950); Dear Brat (1951); Joan Blondell's neglected daughter in The Blue Veil (1951); The Rose Bowl Story (1952); and Just for You (1952); the daughter of Bette Davis' character in The Star (1952); .[7] In all, Wood appeared in over twenty films as a child. She also appeared on television in episodes of Kraft Theatre and Chevron Theatre,\n\nBecause Wood was a minor during her early years as an actress, she received her primary education on the studio lots wherever she was contracted. California law required that until age 18, child actors had to spend at least three hours per day in the classroom, notes Harris. \"She was a straight A student\", and one of the few child actors to excel at arithmetic. Director Joseph L. Mankiewicz, who directed her in The Ghost and Mrs. Muir (1947), said that, \"In all my years in the business, I never met a smarter moppet.\" Wood remembered that period in her life, saying, \"I always felt guilty when I knew the crew was sitting around waiting for me to finish my three hours. As soon as the teacher let us go, I ran to the set as fast as I could.\"\n\nWood's mother continued to play a significant role in her daughter's early career, coaching her and micromanaging aspects of her career even after Wood acquired agents.[32] As a child actress, Wood received significant media attention. By age nine, she had been named the \"most exciting juvenile motion picture star of the year\" by Parents magazine.\n\nTeen stardom [ edit ]\n\nWood with her younger sister Lana Wood in 1956\n\nIn the 1953–54 television season, Wood played Ann Morrison, the teenage daughter in The Pride of the Family, an ABC situation comedy. She appeared as a teenager on episodes of The Pepsi-Cola Playhouse, Public Defender, Mayor of the Town, Four Star Playhouse, The Ford Television Theatre, and General Electric Theater, and also appeared in a TV version of Heidi. She described the GE Theater episode she did, \"Carnival\", as one of the best things she ever did.[34]\n\nShe had roles in the feature films The Silver Chalice and One Desire (1955).\n\nRebel Without a Cause [ edit ]\n\nWood successfully made the transition from child star to ingénue at age 16 when she co-starred with James Dean and Sal Mineo in Rebel Without a Cause (1955), Nicholas Ray's film about teenage rebellion. Wood had to sign to a long-term contract with Warner Bros. but she was nominated for an Academy Award for Best Supporting Actress. She later said it was the first script she read that she actually wanted to do as opposed to being told to do by her parents; she also said her parents were opposed to her doing it. \"Until then I did what I was told,\" she said.[35]\n\nShe continued to guest star on TV shows like Studio One in Hollywood, Camera Three, Kings Row, Studio 57, Warner Brothers Presents, and The Kaiser Aluminum Hour.\n\nShe had a small but crucial role in John Ford's The Searchers (1956) and was the female lead in A Cry in the Night (1956).\n\nTab Hunter and Marjorie Morningstar [ edit ]\n\nWood graduated from Van Nuys High School in 1956. She signed with Warner Brothers and was kept busy during the remainder of the decade in many \"girlfriend\" roles, which she found unsatisfying.\n\nThe studio cast her in two films opposite Tab Hunter, hoping to turn the duo into a box-office draw that never materialized: The Burning Hills (1956), a Western, and The Girl He Left Behind (1956). She guest starred in episodes of Conflict.\n\nWarner Bros. tried teaming her with Efrem Zimbalist Jr. in Bombers B-52 (1957). Then, she was given the lead in a prestigious project, Marjorie Morningstar (1958). As Marjorie Morningstar, Wood played the role of a young Jewish girl in New York City who has to deal with the social and religious expectations of her family as she tries to forge her own path and separate identity.[38]\n\nAdult career [ edit ]\n\nWood in 1958\n\nTibbetts observed that Wood's characters in Rebel, Searchers, and Morningstar began to show her widening range of acting styles.[7] Her former \"childlike sweetness\" was now being combined with a noticeable \"restlessness that was characteristic of the youth of the 1950s.\"\n\nShe was leading lady to Frank Sinatra in Kings Go Forth (1958) then refused roles and was put on suspension by Warners. This lasted for a year until February 1959.[39] She returned to be leading lady to James Garner in Cash McCall (1960). After Wood appeared in the box office flop All the Fine Young Cannibals (1960), she lost momentum. Wood's career was in a transition period, having until then consisted of roles as a child or as a teenager.[7]\n\nSplendor in the Grass [ edit ]\n\nBiographer Suzanne Finstad wrote that a \"turning point\" in Wood's life as an actress took place when she saw the film A Streetcar Named Desire (1951): \"She was transformed, in awe of director Elia Kazan and of Vivien Leigh's performance… [who] became a role model for Natalie.\" \"Her roles raised the possibility that one's sensitivity could mark a person as a kind of victim,\" noted Tibbetts.[7]\n\nAfter a \"series of bad films, her career was already in decline\", according to author Douglas Rathgeb.[41] She was then cast in Kazan's Splendor in the Grass (1961) with Warren Beatty. Kazan wrote in his 1997 memoir that the \"sages\" of the film community declared her \"washed up\" as an actress, but he still wanted to interview her for his next film:\n\nWhen I saw her, I detected behind the well-mannered 'young wife' front a desperate twinkle in her eyes… I talked with her more quietly then and more personally. I wanted to find out what human material was there, what her inner life was… Then she told me she was being psychoanalyzed. That did it. Poor R.J. [Wagner], I said to myself. I liked Bob Wagner, I still do.\n\nKazan cast Wood as the female lead in Splendor, and her career rebounded. He felt that despite her earlier innocent roles, she had the talent and maturity to go beyond them. In the film, Beatty's character was deprived of sexual love with Wood's character, and as a result turns to another, \"looser\" girl. Wood's character could not handle the sexuality and after a breakdown was committed to a mental institution. Kazan writes that he cast her in the role partly because he saw in Wood's personality a \"true-blue quality with a wanton side that is held down by social pressure,\" adding that \"she clings to things with her eyes,\" a quality he found especially \"appealing.\"[7]\n\nFinstad felt that although Wood had never trained in method acting techniques, \"working with Kazan brought her to the greatest emotional heights of her career. The experience was exhilarating, but wrenching for Natalie, who faced her demons on Splendor.\" She adds that a scene in the film, as a result of \"Kazan's wizardry… produced a hysteria in Natalie that may be her most powerful moment as an actress.\" Actor Gary Lockwood, who also performed in the film, felt that \"Kazan and Natalie were a terrific marriage, because you had this beautiful girl, and you had somebody that could get things out of her.\" Kazan's favorite scene in the film was the last one, when Wood goes back to see her lost first love, Bud (Beatty). \"It's terribly touching to me. I still like it when I see it,\" wrote Kazan.\n\nFor her performance in Splendor, Wood received nominations for the Academy Award, Golden Globe Award, and BAFTA Award for Best Actress in a Leading Role.\n\nWest Side Story [ edit ]\n\nWood played Maria, a restless Puerto Rican girl on the West Side of Manhattan, in West Side Story, Jerome Robbins and Robert Wise's 1961 film of the stage musical, which was a critical and box-office success. Tibbetts wrote of similarities in her role in this film and the earlier Rebel. She was to represent the \"restlessness of American youth in the 1950s\", expressed by youth gangs and juvenile delinquency, along with early rock and roll. Both films, he observes, were \"modern allegories based on the 'Romeo and Juliet' theme, including private restlessness and public alienation. Where in Rebel she falls in love with the character played by James Dean, whose gang-like peers and violent temper alienated him from his family, in West Side Story she enters into a romance with a white former gang member whose threatening world of outcasts also alienated him from lawful behavior.\"[7]\n\nAlthough Wood's singing in the film was voiced by Marni Nixon, West Side Story is still regarded as one of Wood's best films.\n\nPeak years of stardom [ edit ]\n\nWood sang when she starred in the film Gypsy (1962) alongside Rosalind Russell.[48] Her appearance in that film led critic Pauline Kael to comment \"clever little Natalie Wood… [the] most machine-tooled of Hollywood ingénues.\"[49][7]\n\nAt the age of 25, Wood received her third Academy Award nomination for Love with the Proper Stranger (1963), making Wood (along with Teresa Wright) the youngest person to score three Oscar nominations. This record was later broken by Jennifer Lawrence in 2013 and Saoirse Ronan in 2017, both of whom scored their third nominations at the age of 23.\n\nWood made two comedies with Tony Curtis: Sex and the Single Girl (1964) and The Great Race (1965), the latter with Jack Lemmon, and Peter Falk. In The Great Race, her ability to speak Russian was an asset given to her character Maggie DuBois, justifying the character's recording the progress of the race across Siberia and entering the race at the beginning as a contestant.\n\nDirector Sydney Pollack was quoted as saying about Wood, \"When she was right for the part, there was no one better. She was a damn good actress.\" For Inside Daisy Clover (1965) and This Property Is Condemned (1966), both of which co-starred Robert Redford, Wood received Golden Globe nominations for Best Actress. After the release of the films, Wood suffered emotionally and sought professional therapy. She paid Warner Bros. $175,000 to cancel her contract and fired her entire support team: agents, managers, publicist, accountant, and attorneys. In the mid 1960s she was one of the biggest stars in Hollywood along with Elizabeth Taylor and Audrey Hepburn.[51]\n\nAlthough many of Wood's films were commercially successful, at times her acting was criticized. In 1966, Wood was given the Harvard Lampoon award for being the \"Worst Actress of Last Year, This Year, and Next\".[52] She was the first performer to attend their ceremony and accept an award in person. The Harvard Crimson wrote she was \"quite a good sport\".[53] Following a disappointing reception to Penelope (1966), Wood took a three-year hiatus from acting.[54] She was announced for I Never Promised You a Rose Garden but did not appear in it.[55]\n\nBob & Carol & Ted & Alice and retirement [ edit ]\n\nWood co-starred with Dyan Cannon, Robert Culp and Elliott Gould in Bob & Carol & Ted & Alice (1969), a comedy about sexual liberation. According to Tibbetts, this was the first film in which \"the saving leavening of humor was brought to bear upon the many painful dilemmas portrayed in her adult films.\"[7]\n\nWood did not capitalize on the success of Bob & Carol & Ted & Alice. After becoming pregnant in 1970 with her first child, Natasha Gregson, she went into semi-retirement and would act in only four more theatrical films during the remainder of her life. She made a brief cameo appearance as herself in The Candidate (1972), working once more with Robert Redford.\n\nLater career [ edit ]\n\nWood reunited on the screen with Robert Wagner in the television film of the week The Affair (1973), and with Laurence Olivier and Wagner in an adaptation of Cat on a Hot Tin Roof (1976) for the British series Laurence Olivier Presents broadcast as a special by NBC.[34][56]\n\nIn between these she made Peeper (1975) with Michael Caine.\n\nShe made cameo appearances on Wagner's prime-time detective series Switch in 1978 as \"Bubble Bath Girl,\" and Hart to Hart in 1979 as \"Movie Star\".\n\nAfter another lengthy break, she appeared in the ensemble disaster film Meteor (1979) with Sean Connery and the sex comedy The Last Married Couple in America (1980) with George Segal and Valerie Harper. Her performance in the latter was praised and considered reminiscent of her performance in Bob & Carol & Ted & Alice. In Last Married Couple, Wood broke ground: although an actress with a clean, middle-class image, she used the \"F\" word in a frank marital discussion with her husband (George Segal).\n\nTelevision [ edit ]\n\nIn this period, Wood had more success in television, receiving high ratings and critical acclaim in 1979 for The Cracker Factory and especially the miniseries remake of From Here to Eternity (1979), with Kim Basinger and William Devane. Wood's performance in the latter won her a Golden Globe Award for Best Actress in 1980. She starred in The Memory of Eva Ryker, released in May 1980, which proved to be her last completed production.[57]\n\nAt the time of her death, Wood was filming the $15 million science fiction film Brainstorm (1983), co-starring Christopher Walken and directed by Douglas Trumbull.[58]\n\nShe was scheduled to make her stage debut on February 12, 1982, in Anastasia at Ahmanson Theatre with Wendy Hiller. Wood had also purchased film rights to the Barbara Wersba book, Country of the Heart, and was planning to star with Timothy Hutton in the drama about the professional-romantic relationship between a tough-minded poet and her much younger student.[60] (The material was eventually adapted into a 1990 television film starring Jane Seymour.) She expected to follow her performance as \"Anastasia\" on the stage with a starring stint in a film adaptation of the work.[60] The ending of Brainstorm had to be re-written and Wood's character written out of at least three scenes, while a stand-in and sound-alikes were used to replace Wood for some of her crucial shots. The film was released posthumously on September 30, 1983, and was dedicated to Wood in the closing credits.\n\nWood appeared in 56 films for cinema and television. In one of her last interviews before her death, she was defined as \"our sexual conscience on the silver screen.\"[61] Following her death, Time magazine noted that although critical praise for Wood had been sparse throughout her career, \"she always had work\".[62]\n\nPersonal life [ edit ]\n\nWood's two marriages to actor Robert Wagner were highly publicized.[63] They first married on December 28, 1957, in Scottsdale, Arizona when Wood was 19. On June 20, 1961, the couple announced their separation in a joint press release, and divorced ten months later on April 27, 1962.\n\nFollowing this starter marriage, Wood dated Warren Beatty, Michael Caine and David Niven Jr. She also had a broken engagement in 1965 with Venezuelan shoe manufacturer Ladislav Blatnik.\n\nWood with husband Robert Wagner, 1960\n\nOn May 30, 1969, Wood married British producer Richard Gregson after dating for nearly three years. They had a daughter, Natasha (born September 29, 1970). Wood filed for divorce from Gregson on August 4, 1971, and it was finalized on April 12, 1972.[66]\n\nAfter a short-lived romance with future California governor Jerry Brown, Wood resumed her relationship with Wagner at the end of January 1972. They remarried on July 16 aboard the Ramblin' Rose, anchored off Paradise Cove in Malibu. Their daughter Courtney was born on March 9, 1974.\n\nIn 2013, former FBI agent Donald G. Wilson claimed that he and Wood had had a four-year affair, from 1973 to 1977, that began when she was pregnant with Courtney Wagner.[68][69] In 2016, Wilson spoke on camera about his alleged affair with Wood in a documentary for the cable network Reelz.[70]\n\nCelebrity bodyguard Kris Herzog has stated that Wood told his grandmother, an Avalon socialite, she was going to divorce Wagner and that he himself saw Wood the morning before she disappeared.[71][72]\n\nAlleged rape [ edit ]\n\nSuzanne Finstad's 2001 biography of Wood alleges that she was raped by a powerful actor when she was 16, though Finstad did not name the assailant.[73][74] Through the recollection of Wood's close friends, which included actors Scott Marlowe and Dennis Hopper, Finstad said:\n\nThough her five close friends' memories of some details or timing differ after forty-five years, the essence of what each recalls Natalie confiding to them is the same: that the same married film star lured or tricked Natalie, raped her so brutally she was physically injured, and she was too frightened or intimidated to report it to the police. Natalie \"hated\" her former screen idol afterward, \"shuddering\" if she heard his name. She would keep the horrible secret, and behave as if nothing happened whenever their paths intersected, too schooled by Mud [her mother] in the politics of Hollywood to cross a powerful movie star.\n\nIn July 2018, Lana Wood said during a 12-part podcast about her sister's life that her sister was sexually assaulted as a teen and that the attack had occurred inside the Chateau Marmont during an audition and went on \"for hours\".[75] According to professor Cynthia Lucia, who studied the attack claim, Wood's rape was brutal and violent.[76] In the memoir Little Sister: My Investigation Into the Mysterious Death of Natalie Wood published in 2021, Lana Wood identified her sister's alleged assailant as Kirk Douglas and said the assault took place in the summer of 1955.[77]\n\nDeath [ edit ]\n\nOn November 29, 1981, Wood died under mysterious circumstances at age 43 during the making of Brainstorm. She had been on a weekend boat trip to Santa Catalina Island on board her husband Robert Wagner's 58-foot (18 m) motoryacht Splendour. Other than the fact that she drowned, many of the circumstances are unknown; for example, it has never been determined how she entered the water. Wood was with Wagner, Brainstorm co-star Christopher Walken, and Splendour's captain Dennis Davern on the evening of November 28.[b] Authorities recovered her body at 8 a.m. on November 29, one mile (1.6 km) away from the boat, with a small Valiant-brand inflatable dinghy beached nearby. Wagner said that she was not with him when he went to bed.[79] The autopsy report revealed that she had bruises on her body and arms, as well as an abrasion on her left cheek, but no indication as to how or when the injuries occurred.[5]\n\nDavern had previously stated that Wood and Wagner argued that evening, which Wagner denied at the time. In his memoir Pieces of My Heart, Wagner admitted that he had an argument with Wood before she disappeared.[5] The autopsy found that Wood's blood alcohol content was 0.14% and that there were traces of a motion-sickness pill and a painkiller in her bloodstream, both of which increase the effects of alcohol. Los Angeles County coroner Thomas Noguchi ruled the cause of her death to be accidental drowning and hypothermia. According to Noguchi, Wood had been drinking and she may have slipped while trying to re-board the dinghy.[5][82] Her sister Lana expressed doubts, alleging that Wood could not swim and had been \"terrified\" of water all her life, and that she would never have left the yacht on her own by dinghy.[83] Two witnesses who were on a nearby boat stated that they had heard a woman scream for help during the night.[84]\n\nWood was buried in Westwood Village Memorial Park Cemetery in Los Angeles. Representatives of international media, photographers, and members of the public tried to attend her funeral, but all were required to remain outside the cemetery walls. Among the celebrities were Frank Sinatra, Elizabeth Taylor, Fred Astaire, Rock Hudson, David Niven, Gregory Peck, Gene Kelly, Elia Kazan, and Laurence Olivier. Olivier flew in from London in order to attend the service.\n\nGrave of Natalie Wood at Westwood Memorial Park\n\nThe case was reopened in November 2011 after Davern publicly stated that he had lied to police during the initial investigation and that Wood and Wagner had an argument that evening. He alleged that Wood had been flirting with Walken, that Wagner was jealous and enraged, and that Wagner had prevented Davern from turning on the search lights and notifying authorities after Wood's disappearance. Davern alleged that Wagner was responsible for her death.[5][87][88][89] Walken hired a lawyer, co-operated with the investigation, and was not considered a suspect by authorities.[90]\n\nIn 2012, Los Angeles County Chief Coroner Lakshmanan Sathyavagiswaran amended Wood's death certificate and changed the cause of death from accidental drowning to \"drowning and other undetermined factors\".[91] The amended document included a statement that it is \"not clearly established\" how Wood ended up in the water. Detectives instructed the coroner's office not to discuss or comment on the case.[91] On January 14, 2013, the Los Angeles County coroner's office offered a 10-page addendum to Wood's autopsy report. The addendum stated that Wood might have sustained some of the bruises on her body before she went into the water, but that this could not be definitively determined.[92] Forensic pathologist Michael Hunter speculated that Wood was particularly susceptible to bruising because she had taken the drug Synthroid.[93] In 2020, a medical doctor and former intern of Noguchi at the time of Wood's death stated that the bruises were substantial and fitting for someone thrown out of a boat. He claimed that he made those observations to Noguchi.[94]\n\nIn February 2018, Wagner was named a person of interest by the police in the investigation. The police stated that they know that Wagner was the last person to be with Wood before she disappeared.[95][96][97] In a 2018 report, the Los Angeles Times cited the coroner's report from 2013 saying that Wood had unexplained fresh bruising on her right forearm, left wrist, and right knee, a scratch on her neck, and a superficial scrape on her forehead. Officials said that it is possible that she was assaulted before she drowned.[98]\n\nPortrayals in film [ edit ]\n\nThe 2004 TV film The Mystery of Natalie Wood chronicles Wood's life and career. It was partly based on the biographies Natasha: the Biography of Natalie Wood by Suzanne Finstad and Natalie & R.J. by Warren G. Harris.[99] Justine Waddell portrays Wood.[100][101]\n\nShe was played by Australian actress Elizabeth Cullen in Baz Luhrmann's 2022 biopic Elvis, with whom she had a rather shortn albeit very publicized and well documented romance in 1956, in Memphis and in Los Angeles.\n\nFilmography [ edit ]\n\nAccolades [ edit ]\n\nSee also [ edit ]\n\na b c Natalia Nikolaevna Zakharenko has been cited as Wood's real name,[1] her birth certificate recorded it as, simply, Natalie Zacharenko (spelled with a C), as did her birth announcement in the San Francisco Examiner.[4] Thoughhas been cited as Wood's real name,her birth certificate recorded it as, simply,(spelled with a C), as did her birth announcement in the\n\n^ [13] Sometime in the mid-1930s, she shaved four years off her age—giving her birthdate as February 8, 1912, perhaps because her fiancé was younger—and maintained this lie for the rest of her life. Wood's mother was born on January 26, 1908, according to the earliest available records.Sometime in the mid-1930s, she shaved four years off her age—giving her birthdate as February 8, 1912, perhaps because her fiancé was younger—and maintained this lie for the rest of her life. ^ [78] No explanation has ever been given why Georgianne Walken did not accompany her husband Christopher on the Thanksgiving weekend boating trip.\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/f/f2/Peter_Falk_and_Natalie_Wood_-_1966.jpg/220px-Peter_Falk_and_Natalie_Wood_-_1966.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/97/Natalie_Wood_star_redone.jpg/220px-Natalie_Wood_star_redone.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/Natalie_Wood_Ruth_Gordon_23rd_Golden_Globes.jpg/220px-Natalie_Wood_Ruth_Gordon_23rd_Golden_Globes.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Natalie_Wood_1958_cropped.jpg/220px-Natalie_Wood_1958_cropped.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Wood_-_Wagner_-_1960.jpg/220px-Wood_-_Wagner_-_1960.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/29/Natalie_Wood_1947_photo.jpg/170px-Natalie_Wood_1947_photo.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/Natalie_Wood_Grave.jpg/220px-Natalie_Wood_Grave.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Natalie_Wood_by_Jack_Mitchell.jpg/220px-Natalie_Wood_by_Jack_Mitchell.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Natalie_Wood_Allan_Warren.jpg/220px-Natalie_Wood_Allan_Warren.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/Natalie_Wood_and_Lana_Wood_1956.jpg/220px-Natalie_Wood_and_Lana_Wood_1956.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Natalie_Wood_Allan_Warren.jpg/1200px-Natalie_Wood_Allan_Warren.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Natalie_Wood_Allan_Warren.jpg/1200px-Natalie_Wood_Allan_Warren.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Natalie_Wood", "title": "Natalie Wood", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Natalie_Wood_Allan_Warren.jpg/640px-Natalie_Wood_Allan_Warren.jpg", "width": 640, "height": 968}, "title": "Natalie Wood - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}