{"url": "https://www.hollywoodreporter.com/live-feed/riverdale-star-late-night-car-crash-working-16-hour-day-1041899", "text": "The star of Riverdale was involved in a late-night car crash last week after a grueling 16-hour work day outside Vancouver, prompting the cast and crew of the hit CW show to demand better safety protections during production.\n\nK.J. Apa, 20, who plays Archie in the Warner Bros.-produced Archie Comics adaptation, apparently fell asleep driving the 45-minute trip home after midnight. He was taken to a local hospital for observation and later discharged without serious injuries. His car, however, didn’t fare as well. The passenger side was apparently destroyed after striking a light pole, and the vehicle was rendered inoperable.\n\nThe crash has ignited a firestorm of protest on the Riverdale set, sources tell The Hollywood Reporter. The show routinely requires shoots that last until the early morning hours, and the cast and crew are not provided transportation to and from the set. Cole Sprouse, who co-stars as Archie’s pal Jughead and is one of Apa’s close friends, had apparently planned to be in the car as well that night but changed plans at the last minute. Sprouse, a leader of sorts of the actors on the show, has asked that the Greg Berlanti-produced series provide transportation to castmembers working late hours.\n\nA call between representatives for the actors and Warner Bros. executives is being set for Friday to discuss the issue, according to three sources. (Warner Bros. Television declined to confirm any such meeting.)\n\nSAG-AFTRA announced Thursday afternoon that the union would investigate the set in Vancouver following the dangerous crash. “This is an extremely troubling situation and we are deeply concerned about the safety of performers on the Riverdale set,” the statement read. “We are sending a team to Vancouver to review the circumstances surrounding safety issues affecting performers on this production.”\n\nWBTV’s policy is that actors are responsible for their own transportation to and from set, particularly when production is shooting outside the U.S. The studio, which makes several shows in Vancouver, declined to comment, but a source notes that actors are told they can call a taxi or stay in a hotel near a set on the studio’s dime if they feel it is unsafe to drive.\n\nThe crash is the latest in a string of safety-related incidents that highlight what many claim are unsafe working conditions on Hollywood productions. Stunt professionals and others in the industry have been clamoring for improvements to their working conditions, citing long working hours, stringent transportation requirements and early start times as contributors to an unsafe working environment. Apa was in the middle of a 45-minute commute back to his hotel after 16 hours of shooting when he fell asleep at the wheel, sources say.\n\nSeveral safety-related issues have made headlines recently. In July, 33-year-old veteran stuntman John Bernecker fell 22 feet to his death on the set of The Walking Dead, falling off a balcony during a rehearsal. Less than a month later, professional motorcycle racer S.J. Harris was killed in a crash during filming for Deadpool 2, which was filming in Vancouver. Harris’ death is still being investigated. Stunt professionals familiar with the details of the crash have said her death was a preventable tragedy, and that the movie’s producers placed undue pressure on the stunt coordinators to use Harris.\n\nMany Riverdale castmembers are friends as well as colleagues, which may have contributed to an increased sense of unease and anger among them around the crash this week and the response to it. “They’re working these kids from morning until night,” says one person familiar with the production and the circumstances of the accident. “Someone’s going to die.”\n\nAccording to a statement Thursday from Warner Bros., the studio refutes any claim that Apa worked a 16-hour work day and that it could have caused his accident.\n\n“First and foremost, we are extremely grateful that KJ Apa was uninjured during his recent accident. Secondarily, we want to specifically address the characterization that conditions on the set of Riverdale are of concern,” a WBTV spokesperson said in a statement to THR. “We have a large cast of series regulars, and our actors do not work every day. On the day of the accident, KJ worked 14.2 hours. The previous day he worked 2.5 hours, and the day before that he worked 7.7 hours. KJ has repeatedly been informed about making production aware if he is tired or feels unsafe, and if so, either a ride or hotel room will be provided for him. The accident occurred last Thursday. Additionally, it is untrue that KJ was taken to the hospital. He was treated by first responders on the scene and released by them. We also sent a doctor to his home later that same day for a follow-up to confirm his well-being.”\n\nRiverdale became a breakout hit for The CW last season. The younger-skewing network renewed the Twin Peaks-style drama for a second season after airing only six of its first 13 episodes. The cast, too, became fan favorites, earning a Teen Choice nomination for Apa as “breakout star” as well as wins for Sprouse for drama actor and “breakout” TV show, among others.\n\nGiven its strong and vocal fan base, The CW will move Riverdale to a fall premiere and use it to help launch its remake of Dynasty. The network and studio see Riverdale as the start of a franchise, with news breaking Wednesday that The CW and WBTV are developing The Chilling Adventures of Sabrina as a potential companion series. And the key to that: Apa’s Archie.\n\n“The safety of the cast and crew on all of our productions is of paramount importance to the Studio,” WBTV said in a statement. “Productions adhere to the Screen Actors Guild–mandated turnaround time of 12 hours from wrap time to next day call time for cast members. In accordance with industry standard policy, if any cast or crew member feels tired or unsafe at any time after working, the Studio will provide a taxi, a driver or a hotel room upon request. This is communicated to all cast and crew, both in writing and verbally, at the beginning of production and is reiterated continuously throughout the duration of production.”\n\nSept. 21, 3 p.m. Updated to include statements from Warner Bros.\n\nSept. 21, 4:30 p.m. Updated with statement from SAG-AFTRA.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/09/gettyimages-674254480-h_2017.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/09/gettyimages-674254480-h_2017.jpg?w=1296&h=730&crop=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/09/gettyimages-674254480-h_2017.jpg?w=1024", "keywords": [], "authors": ["Scott Johnson"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/riverdale-star-late-night-car-crash-working-16-hour-day-1041899/", "title": "‘Riverdale’ Star in Late-Night Car Crash After Working 16-Hour Day", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The crash has ignited a firestorm of protest on the set and led to SAG-AFTRA launching an investigation.", "news_keywords": "Riverdale", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Scott Johnson", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1041899, "title": "'Riverdale' Star in Late-Night Car Crash After Working 16-Hour Day", "published_at": "2017-09-21 10:43:01", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/09/gettyimages-674254480-h_2017.jpg?w=1024", "comment_count": 0, "tags": "Riverdale", "topics": "TV News", "body": "The star of Riverdale was involved in a late-night car crash last week after a grueling 16-hour work day outside Vancouver, prompting the cast and crew of the hit CW show to demand better safety protections during production.\r\nK.J. Apa, 20, who plays Archie in the Warner Bros.-produced Archie Comics adaptation, apparently fell asleep driving the 45-minute trip home after midnight. He was taken to a local hospital for observation and later discharged without serious injuries. His car, however, didn't fare as well. The passenger side was apparently destroyed after striking a light pole, and the vehicle was rendered inoperable.\r\nThe crash has ignited a firestorm of protest on the Riverdale set, sources tell The Hollywood Reporter. The show routinely requires shoots that last until the early morning hours, and the cast and crew are not provided transportation to and from the set. Cole Sprouse, who co-stars as Archie's pal Jughead and is one of Apa's close friends, had apparently planned to be in the car as well that night but changed plans at the last minute. Sprouse, a leader of sorts of the actors on the show, has asked that the Greg Berlanti-produced series provide transportation to castmembers working late hours.\r\nA call between representatives for the actors and Warner Bros. executives is being set for Friday to discuss the issue, according to three sources. (Warner Bros. Television declined to confirm any such meeting.)\r\nSAG-AFTRA announced Thursday afternoon that the union would investigate the set in Vancouver following the dangerous crash. \"This is an extremely troubling situation and we are deeply concerned about the safety of performers on the Riverdale set,\" the statement read. \"We are sending a team to Vancouver to review the circumstances surrounding safety issues affecting performers on this production.\"\r\nWBTV's policy is that actors are responsible for their own transportation to and from set, particularly when production is shooting outside the U.S. The studio, which makes several shows in Vancouver, declined to comment, but a source notes that actors are told they can call a taxi or stay in a hotel near a set on the studio's dime if they feel it is unsafe to drive.\r\nThe crash is the latest in a string of safety-related incidents that highlight what many claim are unsafe working conditions on Hollywood productions. Stunt professionals and others in the industry have been clamoring for improvements to their working conditions, citing long working hours, stringent transportation requirements and early start times as contributors to an unsafe working environment. Apa was in the middle of a 45-minute commute back to his hotel after 16 hours of shooting when he fell asleep at the wheel, sources say.\r\nSeveral safety-related issues have made headlines recently. In July, 33-year-old veteran stuntman John Bernecker fell 22 feet to his death on the set of The Walking Dead, falling off a balcony during a rehearsal. Less than a month later, professional motorcycle racer S.J. Harris was killed in a crash during filming for Deadpool 2, which was filming in Vancouver. Harris' death is still being investigated. Stunt professionals familiar with the details of the crash have said her death was a preventable tragedy, and that the movie's producers placed undue pressure on the stunt coordinators to use Harris.\r\nMany Riverdale castmembers are friends as well as colleagues, which may have contributed to an increased sense of unease and anger among them around the crash this week and the response to it. \"They're working these kids from morning until night,\" says one person familiar with the production and the circumstances of the accident. \"Someone's going to die.\"\r\nAccording to a statement Thursday from Warner Bros., the studio refutes any claim that Apa worked a 16-hour work day and that it could have caused his accident.\r\n\"First and foremost, we are extremely grateful that KJ Apa was uninjured during his recent accident. Secondarily, we want to specifically address the characterization that conditions on the set of Riverdale are of concern,\" a WBTV spokesperson said in a statement to THR. \"We have a large cast of series regulars, and our actors do not work every day. On the day of the accident, KJ worked 14.2 hours. The previous day he worked 2.5 hours, and the day before that he worked 7.7 hours. KJ has repeatedly been informed about making production aware if he is tired or feels unsafe, and if so, either a ride or hotel room will be provided for him. The accident occurred last Thursday. Additionally, it is untrue that KJ was taken to the hospital. He was treated by first responders on the scene and released by them. We also sent a doctor to his home later that same day for a follow-up to confirm his well-being.\"\r\nRiverdale became a breakout hit for The CW last season. The younger-skewing network renewed the Twin Peaks-style drama for a second season after airing only six of its first 13 episodes. The cast, too, became fan favorites, earning a Teen Choice nomination for Apa as \"breakout star\" as well as wins for Sprouse for drama actor and \"breakout\" TV show, among others.\r\nGiven its strong and vocal fan base, The CW will move Riverdale to a fall premiere and use it to help launch its remake of Dynasty. The network and studio see Riverdale as the start of a franchise, with news breaking Wednesday that The CW and WBTV are developing The Chilling Adventures of Sabrina as a potential companion series. And the key to that: Apa's Archie.\r\n\"The safety of the cast and crew on all of our productions is of paramount importance to the Studio,\" WBTV said in a statement. \"Productions adhere to the Screen Actors Guild–mandated turnaround time of 12 hours from wrap time to next day call time for cast members. In accordance with industry standard policy, if any cast or crew member feels tired or unsafe at any time after working, the Studio will provide a taxi, a driver or a hotel room upon request. This is communicated to all cast and crew, both in writing and verbally, at the beginning of production and is reiterated continuously throughout the duration of production.\"\r\n\r\nSept. 21, 3 p.m. Updated to include statements from Warner Bros.\r\n\tSept. 21, 4:30 p.m. Updated with statement from SAG-AFTRA.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Riverdale’ Star in Late-Night Car Crash After Working 16-Hour Day", "url": "https://www.hollywoodreporter.com/tv/tv-news/riverdale-star-late-night-car-crash-working-16-hour-day-1041899/", "description": "The crash has ignited a firestorm of protest on the set and led to SAG-AFTRA launching an investigation.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/09/gettyimages-674254480-h_2017.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-09-21T10:43:01+00:00", "modified_time": "2017-09-22T14:30:02+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Riverdale’ Star in Late-Night Car Crash After Working 16-Hour Day", "description": "The crash has ignited a firestorm of protest on the set and led to SAG-AFTRA launching an investigation.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/09/gettyimages-674254480-h_2017.jpg?w=1296"}}, "movies": [], "publish_date": 1505990581.0, "source": "https://www.hollywoodreporter.com", "summary": ""}