{"url": "https://en.wikipedia.org/wiki/Life_of_Kylie", "text": "American reality television series\n\nLife of Kylie is an American reality television series starring businesswoman and reality star Kylie Jenner and her best friend at the time, Jordyn Woods. The eight-part half-hour series premiered on August 6, 2017, on the E! cable network where Kylie talked about her life and the behind the scenes of her makeup line.[1] The reality series was greenlit on April 10, 2017.[2][3] On May 11, 2017, E! released the first promo video of the series.[4]\n\nPremise [ edit ]\n\nThe series follows the life of fashion and make-up entrepreneur and reality television personality Kylie Jenner as she deals with running a business while maintaining a normal life and her close friendship with then best friend Jordyn Woods. It regularly featured members of her glam squad such as Ariel Tejada and Tokyo Stylez.[5]\n\nEpisodes [ edit ]\n\nNo. in\n\nseason Title Original air date U.S. viewers\n\n(millions) 1 \"Nineteen: Part 1\" August 6, 2017 ( ) 1.12[6] The show opens on Kylie Jenner and introduces Kylie’s best friend since middle school Jordyn Woods, her makeup artist Ariel Tejada, her hair stylist Tokyo, and her assistant Victoria Villarroel Gamero. Kylie receives a request from a fan named Albert to be his prom date. 2 \"Nineteen: Part 2\" August 6, 2017 ( ) 1.08[6] Kylie and Jordyn fly to Sacramento to surprise fan Albert as the dates for his prom. After returning to Los Angeles, Jordyn goes on a blind date while Kylie speaks to her from her car via walkie talkie. 3 \"Boss\" August 13, 2017 ( ) 0.84 Kylie and Jordyn go to the Kylie Cosmetics Factory and discuss how the business came to be. Kris Jenner encourages her daughter to be a tougher CEO and have better boundaries with her employees. 4 \"Fame\" August 20, 2017 ( ) 0.76 Kylie struggles with her personal life being made public, and discusses the desire to live on a farm. 5 \"Met Ball\" August 27, 2017 ( ) 0.67 Kylie and her team prepare for the Met Gala. Jordyn spends the weekend away, and wonders if she is living her own life or Kylie's. 6 \"London\" September 3, 2017 ( ) 0.58 Jordyn deals with the recent death of her father. Kylie strengthens her bond with father[7] Caitlyn Jenner. 7 \"Peru: Part 1\" September 10, 2017 ( ) 0.56[8] Kylie, Jordyn, Victoria and Kris fly to Peru on a charity mission. Kylie and Kris butt heads over Kris's strict itinerary. 8 \"Peru: Part 2\" September 17, 2017 ( ) 0.56 Kylie and companions continue their trip in Peru. On the last day Kylie and Jordyn have a commitment ceremony officiated by a shaman.\n\nReception [ edit ]\n\nTime magazine said, \"Life of Kylie is meant to show us the person behind the pout. Yet Jenner combines the self-obsession of a teenager with the reflexive crouch of someone who has learned to quash confessional impulses.\"[9] Sadie Gennis of TV Guide commented that the show \"is like its star: searching for purpose, but mostly very, very sad.\"[10]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/Life_of_kylie_logo.png/250px-Life_of_kylie_logo.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/3/38/Life_of_kylie_logo.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/3/38/Life_of_kylie_logo.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Life_of_Kylie", "title": "Life of Kylie", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/38/Life_of_kylie_logo.png/640px-Life_of_kylie_logo.png", "width": 640, "height": 248}, "title": "Life of Kylie - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}