{"url": "https://www.marieclaire.com/celebrity/a20740766/prince-charles-walking-meghan-markle-down-aisle/", "text": "Marie Claire newsletter Celebrity news, beauty, fashion advice, and fascinating features, delivered straight to your inbox! Contact me with news and offers from other Future brands Thank you for signing up to . You will receive a verification email shortly. There was a problem. Please refresh the page and try again. By submitting your information you agree to the Terms & Conditions (opens in new tab) and Privacy Policy (opens in new tab) and are aged 16 or over.\n\nToday, Kensington Palace (opens in new tab) announced who will walk (opens in new tab) Meghan Markle (opens in new tab) down the aisle at the Royal Wedding (opens in new tab) tomorrow: The honor goes to her future father-in-law Prince Charles, the Prince of Wales.\n\n\"Ms. Meghan Markle has asked His Royal Highness The Prince of Wales to accompany her down the aisle of the Quire of St. George's Chapel on her Wedding Day,\" Kensington Palace announced in a statement today. \"The Prince of Wales is pleased to be able to welcome Ms. Markle to The Royal Family in this way.\"\n\nAn update on the #RoyalWedding: pic.twitter.com/wfJ6ZFyzHiMay 18, 2018 See more\n\nBut why Prince Charles?\n\n(Image credit: Getty Images)\n\nKensington Palace had previously announced that Meghan's father, Thomas Markle, would be walking her down the aisle. After it was confirmed (opens in new tab) that he wouldn't be able to attend the wedding after all, many suspected Meghan's mother, Doria Ragland (opens in new tab), would step in to do the honor. Thomas Markle reportedly thought his ex-wife (opens in new tab) was the right person to take his place, and it was previously reported that Meghan wanted to break royal tradition (opens in new tab) from the beginning and have her mom (opens in new tab), whom she is very close to, accompany her down the aisle at St George's Chapel.\n\nBut the reason why that isn't happening may be because of the Queen.\n\n(Image credit: Getty Images)\n\nMarieClaire.com's royal wedding expert, Caroline Castigliano (opens in new tab), explains that by tradition, if the bride's father cannot be the one to give her away, it would then defer to the second male in her family: in Meghan's case, her half-brother, Thomas Jr (opens in new tab). \"Normally it would go to the next male in line in her family (opens in new tab), but I understand her brother is not coming (opens in new tab). It's a very difficult situation.\"\n\n\n\n\"I think Harry would want to do what his grandmother sees as appropriate as a sign of respect to her,\" Castigliano continues. \"They just wouldn't have her mother walk her down the aisle because it wouldn't be what made the Queen feel comfortable, especially at her age.\"\n\n\n\nBecause of this, Charles would be seen as the most appropriate choice because he's, well, a man, and Meghan's future father-in-law. It's a nice way for Prince Charles to show his support for his son, Prince Harry, as well as Meghan—but it would have been exciting for Meghan to buck to tradition and have her mother stand up with her on Saturday.\n\n\"There's going to be all sorts of opportunities for Harry to break with tradition and get things to move in a slightly different direction, but at this point I'm sure his respect for the Queen is the most important thing,\" Castigliano says.\n\nBut according to a royal journalist, the reason may not be because of royal traditions at all—Charles may walk Meghan down the aisle in an effort to take some of the pressure off of her mother. Duncan Larcombe tells Harper's Bazaar UK (opens in new tab) that his sources report that Meghan did ask her mother to step in, but they decided it was too much in the end.\n\n\"Doria and Meghan discussed it but she just didn't feel she could go through with it,\" Larcombe says. \"According to the guidance I've been given, Meghan felt that it would be too much to expect her mother to perform such an important role when more than one billion people are expected to be watching.\"\n\n(Image credit: Getty Images)\n\nLarcombe says it was actually Harry who thought Charles could be the one to step up. \"I'm told that it was Harry who suggested asking his father if he would step into the breach,\" he says, explaining that Charles, who has 69 years of royal experience under his belt, is the perfect solution. \"Just his presence by her side will calm Meghan and make the terrifying prospect of a royal wedding far less frightening. She will be able to let Charles take the lead and calmly make sure nothing goes wrong...In contrast if her mother was by her side, it would have been down to Meghan to perform that calming role.\"\n\nRELATED STORIES (Image credit: Getty Images) The Strict Marriage Traditions of the Royal Family", "images": ["https://cdn.mos.cms.futurecdn.net/hSxG3z8bCXeHXL2wHrwYwS-415-80.jpg", "https://www.facebook.com/tr?id=756449714459937&ev=PageView&noscript=1", "https://vanilla.futurecdn.net/marieclaireus/missing-image.svg", "https://cdn.mos.cms.futurecdn.net/mVq6bRTbzkNRVCCykMPMyY-1200-80.jpg"], "top_img": "https://cdn.mos.cms.futurecdn.net/mVq6bRTbzkNRVCCykMPMyY-1200-80.jpg", "keywords": [], "authors": ["Marie Claire", "Julia Marzovilla", "Gabrielle Ulubay", "Iris Goldsztajn"], "canonical_link": "https://www.marieclaire.com/celebrity/a20740766/prince-charles-walking-meghan-markle-down-aisle/", "title": "Why Is Prince Charles Walking Meghan Markle Down the Aisle?", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "pub_date": "2018-05-18T11:40:06+00:00", "description": "Today, Kensington Palace announced that Prince Charles, the Prince of Wales, will walk Meghan Markle down the aisle at the Royal Wedding. Meghan's mother Doria Ragland was expected to do the honor in", "robots": "max-image-preview:large", "msapplication-TileColor": "#000000", "msapplication-TileImage": "https://cdn.mos.cms.futurecdn.net/flexiimages/l0uowirhzd1627591128.svg", "og": {"site_name": "Marie Claire Magazine", "image": {"identifier": "https://cdn.mos.cms.futurecdn.net/mVq6bRTbzkNRVCCykMPMyY-1200-80.jpg", "width": 1200}, "type": "article", "title": "Why Is Prince Charles Walking Meghan Markle Down the Aisle?", "url": "https://www.marieclaire.com/celebrity/a20740766/prince-charles-walking-meghan-markle-down-aisle/", "description": "The honor isn't going to her mother, Doria Ragland, after all."}, "article": {"publisher": "https://www.facebook.com/MarieClaire", "published_time": "2018-05-18T11:40:06Z", "modified_time": "2018-05-18T11:40:06.642Z"}, "parsely-type": "post", "parsely-post-id": "3Uen4Nyok8EF3VmxtgnBC5", "parsely-pub-date": "2018-05-18T11:40:06Z", "parsely-title": "Why Is Prince Charles Walking Meghan Markle Down the Aisle?", "parsely-link": "https://www.marieclaire.com/celebrity/a20740766/prince-charles-walking-meghan-markle-down-aisle/", "parsely-image-url": "https://cdn.mos.cms.futurecdn.net/mVq6bRTbzkNRVCCykMPMyY.jpg", "parsely-section": "Royals", "parsely-tags": "Category: Royals,Category: Celebrity,Category: News,royals,celebrity,standard-article,collection_meghan-markle-and-prince-harrys-royal-wedding,serversidehawk", "parsely-author": "Marie Claire", "twitter": {"card": "summary_large_image", "site": "@marieclaireus", "title": "Why Is Prince Charles Walking Meghan Markle Down the Aisle?", "description": "The honor isn't going to her mother, Doria Ragland, after all.", "creator": "@marieclaireus", "image": "https://cdn.mos.cms.futurecdn.net/mVq6bRTbzkNRVCCykMPMyY-1200-80.jpg", "account_id": 15469402}, "google-site-verification": "G8uYPAX70T_vfdmDhxnUNSykxtjRTkSvHhloGBWT6R8", "taboola": {"url": "https://www.marieclaire.com/celebrity/a20740766/prince-charles-walking-meghan-markle-down-aisle/"}, "botify-site-verification": "gEo2ltw4ZxjJkBcaADHlIGePpMrucY2w", "msvalidate.01": "CC462E6DF91492086145CA5EBDCB615E"}, "movies": [], "publish_date": 1526643606.0, "source": "https://www.marieclaire.com", "summary": ""}