{"url": "http://www.cq.com/doc/newsmakertranscripts-4329176", "text": "Sen. Collins Delivers Republican Response to President Obama's Weekly Radio Address, as Released by Sen. Collins' Office\n\nAS RELEASED BY SEN. COLLINS' OFFICE\n\nCOLLINS:\n\nHello. I'm Senator Susan Collins from Maine.\n\nMy family founded a small business in northern Maine more than 160 years ago. Today, it continues to be run by two of my brothers.\n\nOur economy is built on millions of enterprises just like ours. It's not easy to survive in today's economy. But these employers remain our nation's job creators. We should be doing all we can to promote policies to help them survive and thrive.\n\nEffective health-care reform should provide Americans with access to quality and affordable care while also encouraging economic growth. That's not what is happening under Obamacare.\n\nInstead, Obamacare is actually discouraging small businesses from creating jobs and hiring new employees. The law also has perverse incentives for employers to reduce the number of hours that their employees can work.\n\nWhile most small business owners want to provide health insurance for their employees, many simply cannot afford to under Obamacare. Yet, even struggling businesses with 50 or more full-time employees will be required to provide health insurance or face huge fines for each employee. If you employ 49 workers, there are no fines. But, if you add just one more employee, you're hit with penalties.\n\nThese enormous penalties are a real threat to employers who want to add jobs. They are a powerful incentive for employers to refrain from hiring additional workers. Even worse, under Obamacare, anyone working an average of just 30 hours a week is considered full-time. This will only cause some businesses to reluctantly reduce the hours of their workers to fewer than 30 hours per week.\n\nAnd, it's not just the private sector that is affected. Let me give you an example. A school system in my state of Maine is already preparing to track and cap the number of hours that substitute teachers can work to ensure that they don't work more than 29 hours a week. Fewer hours means less money in the teachers' paychecks and more disruption for their students.\n\nRecently, labor leaders, led by Teamsters President James Hoffa, warned that Obamacare will - and I quote - \"destroy the foundation of the 40 hour work week that is the backbone of the American middle class.\"\n\nThey are right to be worried: In the past, most new jobs were full-time. But, this year, the overwhelming majority of new jobs are part-time.\n\nUnder this troubling trend, more workers will find their hours and their earnings reduced. Jobs will be lost. This is especially disturbing as our country is still battling high unemployment.\n\nA study published by the Labor Center at the University of California, Berkeley, underscores the danger. That study found that 10 million American workers are vulnerable to having their hours cut as a direct result of Obamacare. 10 million workers! And the most vulnerable are lower-income employees.\n\nIn an effort to protect these millions of workers, I've introduced a bipartisan bill called the Forty Hours is Full Time Act. My bill would change the definition of full-time employee in Obamacare from 30 hours a week to 40 hours a week. A 40-hour work week is full- time; we all know that. This bill is just common sense.\n\nNow, the Obama Administration has announced that it is delaying enforcement of the employer mandate until 2015. But, the fact is, the law remains in place and continues to discourage new jobs and full- time work.\n\nOf course, fixing this one flaw won't solve the countless problems caused by Obamacare. But it would help ensure that millions of American workers do not have their hours, and their paychecks, reduced.\n\nSmall businesses are the backbone of our nation's economy. The last thing we need is yet another obstacle to helping them grow and create much-needed jobs.\n\nSEN. SUSAN COLLINS, R-MAINE", "images": ["http://www.cq.com/images/cq-logo-white-new.png", "http://www.cq.com/versioned/MjAyMjA5MTZfMTYyNTIwMjQ0/images/app-icon.png"], "top_img": "http://www.cq.com/versioned/MjAyMjA5MTZfMTYyNTIwMjQ0/images/app-icon.png", "keywords": [], "authors": [], "canonical_link": "", "title": "Sen. Collins Delivers Republican Response to President Obama's Weekly Radio Address, as Released by Sen. Collins' Office", "meta_data": {"build-version": "unknown-TAG", "build-time": "unknown-1664650858571", "viewport": "initial-scale=1", "apple-itunes-app": "app-id=1022591312"}, "movies": [], "publish_date": null, "source": "http://www.cq.com", "summary": ""}