{"url": "https://tv.avclub.com/at-100-episodes-scandal-asks-to-be-embraced-for-the-so-1798191234", "text": "Reviews Scandal B The Decision Episode 10\n\n“The Decision” is Scandal’s 100th episode. Prior to airing, ABC hyped the show’s landmark episode with a detailed oral history, clips of the cast reminiscing on the show’s start and splashy promos that welcomed viewers to a “twisty parallel universe.” The episode starts with Olivia, Fitz and Jake arguing over what to do with the show’s latest shadow organization, but quickly switches gears and takes us back to the moment Fitz’s campaign decided to steal the election. This time, however, Olivia stops the Defiance plan. Rather than advance the current plot, Scandal made the choice to reflect on the show’s mythology and ask audiences: aren’t we better off with Scandal, in all its soapy, trashy glory, than without it?\n\nIn a season that has relied far too heavily on flashbacks, it seemed like “The Decision” would merely be another distraction––an episode that would give the audience more insight into characters’ motivations, but would ultimately be pointless. This is definitely the case. ”The Decision” exists entirely outside of this season’s current plot. It’s unnecessary fan service, but unlike most of Scandal’s sixth season so far, it’s entertaining fan service. Fitz and Olivia get married. Quinn escapes Olivia’s orbit and remains Lindsay, the reality star. Huck never learns to shave. Abby and David stay together. Mellie and Cyrus get married. It’s enjoyably over the top, but most importantly, the actual stories being told in this Alternate Scandal-land are boring.\n\nAdvertisement\n\nIt’s fair to criticize Scandal’s later seasons for losing focus on what made the show great. Olivia killed a man with a wheel chair. Characters suffer from weekly amnesia and magically alternate between all-knowing gods to idiots the second the plot calls for it. “The Decision” is what Scandal looks like when it acts with a sense of logic that critics crave. It’s the Scandal viewers are asking for when they roll their eyes and beg Olivia and Fitz to just get together or for Olivia to run as far as she can from the White House. It’s the version of Scandal that exists when the show focuses on being realistic, rather than an insane mindfuck. And, well, it turns out that’s not the Scandal we really want after all.\n\nIt turns out, Scandal really is better when it’s careening through plots at a dangerous pace. Watching Olivia deal with Fitz’s male fragility and insecurity isn’t fun. While it’s nice to see that Fitz is still the worse in any timeline, I’d rather have Fitz in the Oval than on a crappy political talk show. Instead of taking tacky selfies in front of portraits before being dismissed, I’d rather have Olivia and her amazing coats gliding through the halls of the White House; solving impossible problems. In its 100th episode, Scandal sets the haters straight. The show will never be the procedural it was in season one and it should be celebrated for the joyride that it is. Because, well, the joyride is better than Olivia and crew fighting to pass bills while enjoying weekly screenings of a Bachelor parody.\n\nSo, after 100 episodes filled with murder, kidnapping and treason, ”The Decision” lets us appreciate exactly where the show is coming from. Scandal is a show that has played with our expectations for six seasons now. What started as a complicated exploration of a strong, educated black woman out to save the world has become an imbalanced look at the convoluted ideas of power, justice and truth. Scandal isn’t a world where a black woman needs to be gifted with strength or a magic intuition that allows her to always know what’s right in order to succeed. In fact, Scandal exists in an alternate reality already. A reality where a black woman can be messy and wrong. One where an openly gay man can be Vice President or Chief of Staff without America’s entire political system collapsing. One where Fitz and Mellie are somehow Republicans who fight for gun control and Planned Parenthood.\n\nWhile I’ve certainly had my complaints, I’d rather be entertained by Scandal’s actual alternate reality than the one logical one presented in “The Decision.” Fitz may tell Olivia that she was right to stop the Defiance plan at the end of the episode, but I disagree. Thank you, Olivia Pope, for taking us to hell and back over the course of 100 episodes. Scandal may have gone off the rails awhile ago, but the scenery is a lot more interesting out here.\n\nAdvertisement\n\nStray Observations\n\nI love that alternate reality Olivia Pope has natural hair. Of course she can’t afford those weekly perms.\n\nObviously, the best way to know if it was wrong or right to steal the election would be to see how the actual American people fared under Fitz. In Real Scandal-land, we never see normal citizens reacting positively to Fitz’s administration, but people love him as a talking head in Alternate Scandal-land. Olivia is even working on legislation that would actually help people in Alternate Scandal-land. While the citizens of Real Scandal’s America might be suffering, it’s entertaining for us.\n\nCyrus and Mellie getting married was so unnecessary and over the top. I do like that it makes it clear that neither Cyrus or Mellie should be president in any timeline. I loved seeing James again, though. RIP James.\n\nI guess Marcus has replaced Harrison’s entire presence in Scandal and Olivia’s history.\n\nQuinn as a reality star was hilarious and enjoyable. I love that Huck still loved her in the show.\n\n“You’re certainly not screwing me, not in the way I like at least” - FITZ, YOU ARE AWFUL IN EVERY TIMELINE.\n\nABC only released two press photos with this episode. I am sharing them here because they are hilarious (if you couldn’t tell, I really hate Fitz):\n\n", "images": ["https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/f5zr3vuc90hrpnmx0nme.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,fl_progressive,g_center,h_264,q_80,w_470/b79608df135ebc4b059a2cdad3a83176.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/kqnkjlylkf7tymsqmoqr.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/52a29fe0001de9a08e76ea6d559528e9.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/u0939doeuioaqhspkjyc.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/j59upeyynundqjvbmcwj.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/v4sckews2f3bzf0ztbkf.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/aqhdzcldymb9mkltfhxh.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/rnxqtvv6advgidzfs6am.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/f2b6295902a8e0a7c4d168840e7b3d51.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/eti2h1r4wg0bqxctxenl.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/muaaluj2wznfomol9ero.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/no63bw902mddhwxtjtxh.png"], "top_img": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png", "keywords": [], "authors": [], "canonical_link": "https://www.avclub.com/at-100-episodes-scandal-asks-to-be-embraced-for-the-so-1798191234", "title": "At 100 episodes, Scandal asks to be embraced for the soapy mess that it is", "meta_data": {"google-site-verification": "QDPLbDJXTQNT0n69mvNADCeRmwnbkYyL20OKJAVCKq8", "ir-site-verification-token": "-1270174611", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0,maximum-scale=10.0", "ROBOTS": "INDEX, FOLLOW", "msapplication-square70x70logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/no63bw902mddhwxtjtxh.png", "msapplication-square150x150logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_200,q_80,w_200/no63bw902mddhwxtjtxh.png", "keywords": "TV, Scandal, Recap, The A.V. Club", "news_keywords": "TV, Scandal, Recap, The A.V. Club", "twitter": {"url": "https://www.avclub.com/at-100-episodes-scandal-asks-to-be-embraced-for-the-so-1798191234", "card": "summary_large_image", "site": "theavclub", "title": "At 100 episodes, Scandal asks to be embraced for the soapy mess that it is", "description": "“The Decision” is Scandal’s 100th episode. Prior to airing, ABC hyped the show’s landmark episode with a detailed oral history, clips of the cast reminiscing on the show’s start and splashy promos that welcomed viewers to a “twisty parallel universe.” The episode starts with Olivia, Fitz and Jake arguing over what to…", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png"}, "article": {"published_time": "2017-04-14T05:09:00.234Z", "modified_time": "2018-07-20T17:07:47.332Z"}, "description": "“The Decision” is Scandal’s 100th episode. Prior to airing, ABC hyped the show’s landmark episode with a detailed oral history, clips of the cast reminiscing on the show’s start and splashy promos that welcomed viewers to a “twisty parallel universe.” The episode starts with Olivia, Fitz and Jake arguing over what to…", "og": {"title": "At 100 episodes, Scandal asks to be embraced for the soapy mess that it is", "type": "article", "url": "https://www.avclub.com/at-100-episodes-scandal-asks-to-be-embraced-for-the-so-1798191234", "description": "“The Decision” is Scandal’s 100th episode. Prior to airing, ABC hyped the show’s landmark episode with a detailed oral history, clips of the cast reminiscing on the show’s start and splashy promos that welcomed viewers to a “twisty parallel universe.” The episode starts with Olivia, Fitz and Jake arguing over what to…", "locale": "en_US", "site_name": "The A.V. Club", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png"}, "fb": {"app_id": 1621890511466174, "pages": 39581755672}}, "movies": [], "publish_date": 1492146540.234, "source": "https://tv.avclub.com", "summary": ""}