{"url": "https://www.hollywoodreporter.com/news/mayim-bialik-responds-backlash-op-ed-being-a-feminist-weinsteins-world-1049038", "text": "Mayim Bialik has come under fire from several of her Hollywood peers after the Big Bang Theory actress wrote an op-ed column titled “Being a Feminist in Harvey Weinstein’s World,” for the New York Times.\n\nIn the piece published on Friday, Bialik, 41, describes coming of age as a “prominent-nosed, awkward, geeky, Jewish 11-year-old,” and being aware that she was different from her onscreen contemporaries of the late ‘80s, who she says were praised for their curves.\n\n“I have always had an uncomfortable relationship with being employed in an industry that profits on the objectification of women,” she writes, adding that from an early age she made “wise” personal choices in order to protect herself, including dressing “modestly” and not acting “flirtatiously” with men.\n\n“I am entirely aware that these types of choices might feel oppressive to many young feminists,” she added. “Women should be able to wear whatever they want. They should be able to flirt however they want with whomever they want.”\n\nDespite her concession that it shouldn’t be the duty of women “to police our own behavior,” the suggestion that her strategies would be helpful in staving off sexual predators enraged many people on social media, including Gabrielle Union, Emily Ratajkowski and Patricia Arquette, who all posted that dressing conservatively is not effective; many also accused Bialik of victim-blaming.\n\nReminder. I got raped at work at a Payless shoe store. I had on a long tunic & leggings so miss me w/ “dress modestly” shit. — Gabrielle Union (@itsgabrielleu) October 15, 2017\n\n.@missmayim I have to say I was dressed non provocatively at 12 walking home from school when men masturbated at me. It’s not the clothes. — Patricia Arquette (@PattyArquette) October 14, 2017\n\nSo @missmayim “advice” is: I was never pretty & never tried to be & ladies, take note if you don’t want to be harassed? This isn’t feminism pic.twitter.com/0Rrx6jrE5K — Emily Ratajkowski (@emrata) October 15, 2017\n\nOthers criticized the Times as an institution for giving a platform to “dangerous” opinions. “Mayim Bialik’s piece is part of the problem w/ the myth of journalistic objectivity, which suggests even dangerous opinions deserve platform,” wrote Jamilah Lemieux, a culture critic and editor.\n\nMayim Bialik’s piece is part of the problem w/ the myth of journalistic objectivity, which suggests even dangerous opinions deserve platform — Jamilah Lemieux (@JamilahLemieux) October 15, 2017\n\nAnother repeated critique of Bialik’s piece is that her focus on not being a “perfect 10” in Hollywood and the ensuing decision to focus more on “what was inside my brain than what was inside my bra” was relevant to the discussion of sexual assault.\n\nThe schadenfruede that Mayim Bialik seems to have over the fact that she thinks that only pretty girls are sexually assaulted is gross — Ijeoma Oluo (@IjeomaOluo) October 15, 2017\n\nBialik has previously come under fire for criticizing women for dressing provocatively; in 2014 she wrote a piece for Kveller about a billboard featuring Ariana Grande in which she lamented that “women are expected to be sexy and sexually available no matter what we do in society.”\n\nMayim Bialik’s trash NYT op-ed shouldn’t be a surprise if you remember this pic.twitter.com/s6QeSIfaKe — Ira Madison III (@ira) October 14, 2017\n\nThe actress’ comments on how women present themselves and the correlation to sexual harassment at the hands of men comes one week after designer Donna Karan suggested that women may be “asking for it” by dressing provocatively. Karan has since apologized multiple times for her comments.\n\nOn Sunday evening, Bialik wrote that critics of the piece had “taken my words out of the context of the Hollywood machine and twisted them to imply that God forbid I would blame a woman for her assault.”\n\nBeing told my @NYTimes piece resonated w/ so many. Also see some have taken my words out of the context of the Hollywood machine. See below: pic.twitter.com/0NmxtAF1vP — Mayim Bialik (@missmayim) October 15, 2017\n\nOn Wednesday evening, Bialik addressed the controversy again, this time in the form of an apology she posted to Twitter. “Let me say clearly and explicitly that I am very sorry,” Bialik wrote. “I support these women as we seek out and demand accountability from the only ones responsible for assault and rape: the people who perpetrate these heinous crimes.”\n\n8:00 a.m. Thursday, Oct. 19: Updated Bialik’s apology.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/mayim_bialik_-_h_2015.jpg?w=1024", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/mayim_bialik_-_h_2015.jpg?w=1024", "keywords": [], "authors": ["Sam Reed"], "canonical_link": "https://www.hollywoodreporter.com/news/general-news/mayim-bialik-responds-backlash-op-ed-being-a-feminist-weinsteins-world-1049038/", "title": "Mayim Bialik Responds to Backlash Over Op-Ed About Being a Feminist in Weinstein’s World", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Emily Ratajkowski, Gabrielle Union and Patricia Arquette called out the 'Big Bang Theory' star on social media after she wrote it was \"wise\" to dress \"modestly\" and not act \"flirtatiously\" with men.", "news_keywords": "Mayim Bialik, Style News", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Sam Reed", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1049038, "title": "Mayim Bialik Responds to Backlash Over Op-Ed About Being a Feminist in Weinstein's World", "published_at": "2017-10-16 08:18:35", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/mayim_bialik_-_h_2015.jpg?w=1024", "comment_count": 0, "tags": "Style News", "topics": "News", "body": "Mayim Bialik has come under fire from several of her Hollywood peers after the Big Bang Theory actress wrote an op-ed column titled \"Being a Feminist in Harvey Weinstein's World,\" for the New York Times.\r\nIn the piece published on Friday, Bialik, 41, describes coming of age as a \"prominent-nosed, awkward, geeky, Jewish 11-year-old,\" and being aware that she was different from her onscreen contemporaries of the late '80s, who she says were praised for their curves. \r\n\r\n\"I have always had an uncomfortable relationship with being employed in an industry that profits on the objectification of women,\" she writes, adding that from an early age she made \"wise\" personal choices in order to protect herself, including dressing \"modestly\" and not acting \"flirtatiously\" with men. \r\n\"I am entirely aware that these types of choices might feel oppressive to many young feminists,\" she added. \"Women should be able to wear whatever they want. They should be able to flirt however they want with whomever they want.\"\r\nDespite her concession that it shouldn't be the duty of women \"to police our own behavior,\" the suggestion that her strategies would be helpful in staving off sexual predators enraged many people on social media, including Gabrielle Union, Emily Ratajkowski and Patricia Arquette, who all posted that dressing conservatively is not effective; many also accused Bialik of victim-blaming. \r\n\r\n\tReminder. I got raped at work at a Payless shoe store. I had on a long tunic & leggings so miss me w/ \"dress modestly\" shit.\r\n\t— Gabrielle Union (@itsgabrielleu) October 15, 2017\r\n\r\n\t.@missmayim I have to say I was dressed non provocatively at 12 walking home from school when men masturbated at me. It's not the clothes.\r\n\t— Patricia Arquette (@PattyArquette) October 14, 2017\r\n\r\n\tSo @missmayim \"advice\" is: I was never pretty & never tried to be & ladies, take note if you don't want to be harassed? This isn't feminism pic.twitter.com/0Rrx6jrE5K\r\n\t— Emily Ratajkowski (@emrata) October 15, 2017\r\nOthers criticized the Times as an institution for giving a platform to \"dangerous\" opinions. \"Mayim Bialik’s piece is part of the problem w/ the myth of journalistic objectivity, which suggests even dangerous opinions deserve platform,\" wrote Jamilah Lemieux, a culture critic and editor. \r\n\r\n\tMayim Bialik’s piece is part of the problem w/ the myth of journalistic objectivity, which suggests even dangerous opinions deserve platform\r\n\t— Jamilah Lemieux (@JamilahLemieux) October 15, 2017\r\nAnother repeated critique of Bialik's piece is that her focus on not being a \"perfect 10\" in Hollywood and the ensuing decision to focus more on \"what was inside my brain than what was inside my bra\" was relevant to the discussion of sexual assault. \r\n\r\n\tThe schadenfruede that Mayim Bialik seems to have over the fact that she thinks that only pretty girls are sexually assaulted is gross\r\n\t— Ijeoma Oluo (@IjeomaOluo) October 15, 2017\r\nBialik has previously come under fire for criticizing women for dressing provocatively; in 2014 she wrote a piece for Kveller about a billboard featuring Ariana Grande in which she lamented that \"women are expected to be sexy and sexually available no matter what we do in society.\"\r\n\r\n\tMayim Bialik’s trash NYT op-ed shouldn’t be a surprise if you remember this pic.twitter.com/s6QeSIfaKe\r\n\t— Ira Madison III (@ira) October 14, 2017\r\nThe actress' comments on how women present themselves and the correlation to sexual harassment at the hands of men comes one week after designer Donna Karan suggested that women may be \"asking for it\" by dressing provocatively. Karan has since apologized multiple times for her comments.\r\nOn Sunday evening, Bialik wrote that critics of the piece had \"taken my words out of the context of the Hollywood machine and twisted them to imply that God forbid I would blame a woman for her assault.\"\r\n\r\n\tBeing told my @NYTimes piece resonated w/ so many. Also see some have taken my words out of the context of the Hollywood machine. See below: pic.twitter.com/0NmxtAF1vP\r\n\t— Mayim Bialik (@missmayim) October 15, 2017\r\nOn Wednesday evening, Bialik addressed the controversy again, this time in the form of an apology she posted to Twitter. \"Let me say clearly and explicitly that I am very sorry,\" Bialik wrote. \"I support these women as we seek out and demand accountability from the only ones responsible for assault and rape: the people who perpetrate these heinous crimes.\"\r\n\r\n\tpic.twitter.com/vXmKO1jv7m\r\n\t— Mayim Bialik (@missmayim) October 18, 2017\r\n8:00 a.m. Thursday, Oct. 19: Updated Bialik's apology.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Mayim Bialik Responds to Backlash Over Op-Ed About Being a Feminist in Weinstein’s World", "url": "https://www.hollywoodreporter.com/news/general-news/mayim-bialik-responds-backlash-op-ed-being-a-feminist-weinsteins-world-1049038/", "description": "Emily Ratajkowski, Gabrielle Union and Patricia Arquette called out the ‘Big Bang Theory’ star on social media after she wrote it was “wise” to dress “modestly” …", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/mayim_bialik_-_h_2015.jpg?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2017-10-16T08:18:35+00:00", "modified_time": "2017-10-19T07:54:22+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Mayim Bialik Responds to Backlash Over Op-Ed About Being a Feminist in Weinstein’s World", "description": "Emily Ratajkowski, Gabrielle Union and Patricia Arquette called out the ‘Big Bang Theory’ star on social media after she wrote it was “wise” to dress “modestly” …", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/mayim_bialik_-_h_2015.jpg?w=1280"}}, "movies": [], "publish_date": 1508141915.0, "source": "https://www.hollywoodreporter.com", "summary": ""}