{"url": "https://web.archive.org/web/20220823201828/https://www.thequiz.com/pick-you-favorites-to-see-which-netflix-series-you-should-binge-next/", "text": "Pick You Favorites To See Which Netflix Series You Should Binge Next by Emily Mernin\n\n– on Jun 12th\n\nin Movies and TV\n\nEver since Netflix started producing original series in 2013, Netflix series have become one of the main forms of television. The first Netflix original series was House of Cards, an American political drama that just completed its fifth season. Since then, Netflix has produced dozens of Netflix original series and have even revived old shows whose networks could no longer afford to produce them. Because they have grown to be so respected over the past five years, many international networks allows Netflix to coproduce or exclusively broadcast their shows. In the past year, so many amazingly different Netflix shows have been released. There are crime shows, romantic comedies, reality shows, teenage dramas, documentaries, and so much more. Netflix streaming defined what it means to binge watch television. With complete control over what you watch on your laptop, actual televisions have become increasingly obsolete. Now, instead of needing to get the rights for a show, Netflix original series ensure that there is always something good and new to watch on Netflix. There seems to be a Netflix original series for everyone and every mood. Instead of sifting through the overwhelming selection of shows and their cryptic blurbs, take this short quiz and find out which Netflix series you should binge watch next! (If you haven't already!)\n\nadvertising\n\nQuestion 1 Pick Your Favorite Board Game Risk Dungeons And Dragons Life Chess Some board games are based on pure strategy while others are based on pure chance. The most popular ones often land somewhere in the middle. Which of the following board games do you hope to break out at family game night? Board games say a lot about how competitive and strategic you can. Some people prefer games where \"everybody wins,\" that are quick and easy to learn.\n\nQuestion 2 Which Dessert Is The Best? Ice Cream Black Forest Cake Crème Brûlée Black And White Cookie Would you prefer a big, fresh cookie from your favorite bakery, or a creme brulee made by your in house chef? Dessert is how many of us choose to end our day, many people take it with coffee or tea. Your nightly indulgence says a lot about what you like, even if you prefer the gluten free, vegan version of whatever baked good it may be. Whichever sweet you binge on before bed might lead you to your next favorite TV binge!\n\nQuestion 3 Whats Your Dream Job? Nanny Scientist Entrepreneur CEO From a young age, we are asked to imagine our dream careers. Starting in junior high school, career fairs begin popping up in the gym, with dozens of people and pamphlets all meant to guide you to a suitable career. This question can sometimes be a daunting one, as there are so many different paths to take. Considering your personal strengths and weaknesses, your passions, and how you like to spend your time, if you could be anything in the world in the blink of an eye, what would you choose to be?\n\nQuestion 4 For Vacation, Where Would You Rather Go? Camping In The Backyard A BFF Backpacking Trip A Luxury Cruise I Do Not Take Vacations From Work You have one week off from school/work: where would you go? Vacation is supposed to be the most relaxing time of the year when you can do EXACTLY what you like. What you do for vacation should always stay true to your interests! Some people prefer to travel with a backpack, others just want to sit in the sun at an all expenses paid resort. How do you dream of spending your vacation?\n\nQuestion 5 Pick A Color Neon Green Orange Gold Pink Of the following four colors, which are you most attracted to? Favorite colors apparently have a lot to do with our psychology and, like what we say and how we dress, the colors we like the most say a lot about who we are! Every color has symbolic meaning and multiple possible interpretations, which makes it both fun and hard to choose a favorite!\n\nQuestion 6 What's The Perfect BFF Like? We Are Very Competitive I Always Cover For Them I Don’t Have One BFF! Opposites Attract Every best friendship is unique. Some are based on the love of food, others on the gossip or sports, while many are deep and emotional. Often times, the depth of a friendship is related to how long you have known your BFF and how you spend your time together. Did you just meet this year or have you known them since kinder kickers? Of the following descriptions, which describes the relationship between you and your BFF? (That is, if you have one!)\n\nQuestion 7 Pick A Coffee Drink Non-Fat Cappuccino Filter Coffee Dirty Chai Tea Latte Mocha With Extra Whip If you sit for an hour in a Starbucks, you will hear hundreds of different coffee orders. Some people really enjoy the bitter taste of coffee beans, but many people opt for frothy and sweet drinks like flavored lattes. Regardless of what you choose to order, almost everyone has that one drink that they usually stick to. What coffee drink do you wake up to in the morning?\n\nQuestion 8 Which Superhero Would You Pick To Defend You? Wonder Woman The Green Lantern Black Widow Daredevil Every superhero has their own history and is equipped with different powers. Wonder Woman comes is a master of martial arts and combat. She is highly adaptable to new situations. Green Lantern was first a railroad engineer who discovered a lantern that was charged with extraterrestrial magic that gave him his powers. Black Widow is a master athlete, weapons specialist, and has been enhanced by biotechnology. Although Daredevil is blind, he has developed radar which makes his senses very sharp and superhuman. Which of the following superheroes would you trust with your life?\n\nQuestion 9 Pick A SpongeBob Character? Squidward Mr. Krabs Sandy Gary SpongeBob Squarepants premiered in 1999 and defined the direction cartoons took in the 21st century. It is about a sea sponge living on the ocean floor, flipping patties and having fun in the town of Bikini Bottom. None of the characters on the show are similar, they all have very different senses of humor, careers, and mannerisms. Do you identify with Spongebobs social and carefree lifestyle or prefer to stay inside alone like his neighbor, Squidward?\n\nQuestion 10 Which Netflix Show Have You Already Binged? I've Never Seen Netflix The Crown Black Mirror House Of Cards Netflix started producing their own TV shows in 2013. The first show they produced was House Of Cards, which is a Washington DC thriller. It was a great success. Since then, Netflix has produced hundreds of original shows for all audiences and Netflix original series are both respected and coveted. Which of these Netflix series have you already binged all of? (Come on, we know you've seen at least one of them)\n\nQuestion 11 What's Your Dream Car? A Rolls Royce A Punch Buggy Convertible A Ford Mustang A Mercedes Benz Convertible The car you have (or your parents have) may not be the one that you really dream of. Often, people choose cars based on their price and safety features and are forced to forget about their dream car. Some people imagine themselves behind the wheel of a tiny sports car, while others dream of something subdued and classy. Of the following four cars, which would you get if you had unlimited funding!\n\nQuestion 12 It Is Friday Night: How Would You Spend The Evening? At A Movie With My BFF On An Adventure With My Group Of Friends Babysitting Planning For Work Next Monday Sometimes, the week can feel really long. Even though Wednesday is hump day, Friday can be just as exhausting as Monday. How do you let loose after a week of work or school? Some people would prefer to curl up and watch Netflix, while others are ready to go out clubbing til the wee hours of the morning. Some people even have to go to work on Friday nights! If you could do anything in or out of your routine, how would you spend your ideal Friday evening?\n\nQuestion 13 Is There A Such Thing As Soulmates? I Am My Own Soulmate! No, It Is Scientifically Impossible. Yes, I Found Mine! Yes, It Is My BFF! The idea of a soulmate is quite simple: everyone has a perfect match. Often, soulmates are described as two halves of one split soul that are destined to find each other. Many people believe that a soul mate is not always a romantic connection, while others insist that if you find your soul mate you should marry them. In theory, a soul mate should make you feel like yourself and the two of you should get a long better than any one else. Do you buy it?\n\nQuestion 14 Pick A Spice Girl? I cant choose between Sporty and Scary Spice. Posh Spice, Duh. Baby Spice! Ginger Spice Do you remember the Spice Girls? If you think you do not know who they are, pull up a link to Wannabe, their number one hit, and start belting the lyrics! They formed in 1994 and became a global phenomenon. Their album Spice was the best selling album sold by a female group in history! Each Spice Girl has her own name that corresponds to her style. Which one do you identify with?\n\nQuestion 15 Pick A Disney Channel Show Kim Possible Phineas and Ferb Brandy And Mr. Whiskers The Replacements Early Disney Channel was, obviously, the best Disney Channel. In the early 2000's Disney began creating original TV series and, well, they rocked. Over the course of the decade the channel came out with dozens of shows that ranged from early Saturday morning cartoons to funny sitcoms. Many stars that we know and love today as oscar winners or famous singers had their big break on these kid focused shows. Which one was did you prefer?\n\nQuestion 16 Which Ice Cream Flavor Makes Your Mouth Water Mint Chocolate Chip Pistachio French Vanilla Chocolate Chocolate Chip Summer is on its way and the sound of ice cream trucks are beginning to echo through the streets. The shuttered ice cream parlors are opening their windows and are preparing to cool off the hordes of sun soaked people. This cool and creamy dessert is a classic summer treat that comes in almost every flavor you can imagine (even \"Pancake And Waffles\"!). Which of the following flavors would you put in your sundae or atop your waffle cone?\n\nQuestion 17 Pick A School Subject English History Art Statistics Are you more of a history buff or a science geek? Do you like to learn by hearing a teacher explain things or show them visually? Although all of the subjects in school are fun in different ways, most people either prefer math and science or the humanities. Depending not only on your skills and learning style but also your passion, pick the subject that you most prefer.\n\nQuestion 18 Pick A Trait! Loyal Funny Independent Mysterious Of the following four adjectives, which do you think your best friend who choose to describe you to a stranger? Which word do you identify with most? People often have the most honest and endearing way of describing their best friends to other people. What you think your best friend thinks about you says is a question that both reveals your personality traits and the nature of your friendships.\n\nQuestion 19 Pick A Breakfast Eggo Waffles Pancakes With Extra Syrup Scrambled Eggs And Bacon Whole Wheat Avocado Toast Whether you like to have Sunday brunch brought to you in bed, hit the hottest brunch spot, or be served it at the dining room table by your personal chef, no one can resist their favorite breakfast food. Some people like sweet breakfast breads, covered in fruit and syrup, while many prefer for the savory classics. Of the following options, which is closest to your ideal brunch order?\n\nQuestion 20 Pick A Harry Potter Character Professor McGonagall Draco Malfoy Harry Potter Hermione The Harry Potter fandom is one that is nearly impossible to escape. If you haven't read the books, you have probably seen the movies. And if you have not seen the movies, you have at least seen the fan fiction and memes that are everywhere. Maybe you have even been to Harry Potter World! The series, in all its forms, has become a cornerstone of what it means to have a fandom. Of the following characters from the series, which one do you identify with the most?\n\nQuestion 21 Pick A Dream City? Hawkins, Indiana Los Angeles, California Atlanta, Georgia New York City, New York Do you imagine yourself in a city on the coastline, jutting into the blue Pacific? Or is your ideal urban setting a landlocked city, clustered around a lake or river, leading to miles of rural suburbia in all directions? Perhaps the speed of the city is too much for you and the most urban setting you can imagine yourself inhabiting is a busy Midwestern town. Or are you one of those diehard New Yorkers who believe that New York City is the only real city in the world? Of the four American cities below, which one is the most ideal urban center for you?\n\nQuestion 22 Which Movie Could You Watch On Repeat? War Of The Worlds Thelma And Louise Mean Girls Elf Everyone has their favorite movie they could watch on repeat. It's the one Netflix is always suggesting to \"watch again\" and that, before Netflix, the local Blockbuster movie store always had on hold for you. Some people can't get enough of horror movies and the adrenaline they get from being frightened, while others curl up with a feel good romantic comedy to get away from the stress of work or school.\n\nQuestion 23 Which Weird Food Combination Would You Try? Peanut Butter And Pickle Sandwich Salami and Grapes Ice Cream and Soy Sauce Potato Chips And Nutella You've probably tried some weird food combinations over the years. Maybe you accidentally poured orange juice into your cereal in the morning, or dipped your french fries into your milkshake just to see what it tastes like. Over the years, many people have discussed and posted about some of the most enduring \"weird\" food combinations that sound disgusting but, according to thousands of people, taste delicious. Of the following four viral unconventional food combinations, which one would you try?\n\nQuestion 24 Pick A Flower: Azalea California Poppy Foxglove Moonflower Of the following four flowers, which do you like the most? The Azalea is often called the queen of the garden. They are beautiful in a garden and cut. The California Poppy grows in dry, sunny areas. Its iconic orange bloom and \"magical\" qualities make it an enduring symbol in literature and movies. The Foxglove takes time; it does not bloom for the first two seasons of its life. The Moonflower is mysterious, and blooms at night. It attracts moths and other little nocturnal creatures to its bloom.\n\nQuestion 25 Which Fall Jacket Would You Rock? A Denim Jacket A Blazer A Knitted Poncho A Green Khaki Jacket In a few short months, Fall will begin and we will have to pull out our cold weather wardrobes from the back of the closet. Fall is the season most associated with refreshing your wardrobe and changing your look. Might you be starting a new a job? Or switching to a new school? Odds are that you will be meeting new people and switching up your look. Of the following four fall jackets, which one would you grab on your way out the door on a chilly October morning?\n\nQuestion 26 Pick The Best Classic Novel: The Catcher In The Rye By JD Salinger The Great Gatsby By F. Scott Fitzgerald The Scarlet Letter By Nathaniel Hawthorne The Turn Of The Screw By Henry James Of these four classic American novels, which was your favorite? The Catcher In The Rye is about a young, rebellious teenaged boy named Holden Caulfield who comes of age over the course of the novel. The Great Gatsby is a story of love, excess, elegance, and drama. The Scarlet Letter is an older novel following the exile of Hester Prynne and her daughter. The Turn Of The Screw is one of the most famous ghost stories in American literature.\n\nQuestion 27 Pick A Takeout/Delivery Food A Cheese Pizza And Garlic Knots A Sushi Platter For One, Complete With Miso Soup And Salad A Cheeseburger And French Fries, With Extra Ketchup And Mayo! Peanut Sesame Noodles With Tofu And Broccoli After a long day at work or school, you come home to an empty fridge and decide not to cook. Instead, you open up yelp and start browsing places to order food from for delivery. Do you decide to get something simple like a big cheese pizza? Or when you treat yourself, do you really treat yourself, deciding to finally try that fancy sushi place that just opened up downtown? Of the following four delivery orders, which would you dial in?\n\nQuestion 28 Pick A Summer 2018 Fashion Trend Denim On Denim Sheer Clothing The Fanny Pack Black And White Polka Dots Summer is just beginning and already there are so many new trends that seem to be making a distinct comeback year. According to some of the most trusted and knowledgeable fashion magazines, Summer 2018 seems to be a unique moment for fashion. Many of the trends resurfacing hark back to the 1990s and 1970s but have a contemporary flare. Of the following predicted trends, which one can you imagine yourself rocking this July?\n\nQuestion 29 Would You Rather Swim In The Ocean Or A Lake? My Private Pool And Hot Tub The Local Lake The Pacific Ocean The City Beach During the warmer months, there is nothing like a long swim to cool down and refresh you. Depending not only on geographical region, but personal preference, people head towards very different bodies of water to swim in. Some people spend their days at the public pool, socializing with other townies while inhabitants of coastal areas head to the shore to play in the saltwater waves. Which body of water would you prefer to swim in?\n\nQuestion 30 Would You Rather Walk Or Drive? Run Driven By My Driver Take The Subway Bike, Alone Or In Tandem! Depending on where they live, people choose or have to get around very differently. In cities, many people decide not to own cars and instead walk, bike, or take the subway. In smaller towns, there is less public transportation which leads to many more car owners. Some people even decide to hire drivers, so as to never have to worry about parking or getting their license. Of the following modes of transportation, which would you rather do?", "images": ["https://web.archive.org/web/20220823201828im_/http://b.scorecardresearch.com/p?c1=2&c2=21868715&cv=2.0&cj=1", "https://web.archive.org/web/20220823201828im_/https://q.quora.com/_/ad/91f52889f6a04390a65ad2591c59986e/pixel?tag=ViewContent&noscript=1", "https://web.archive.org/web/20220823201828im_/https://static3.thequizimages.com/wordpress/wp-content/uploads/2018/06/13-reasons-why-2.jpg"], "top_img": "https://web.archive.org/web/20220823201828im_/https://static3.thequizimages.com/wordpress/wp-content/uploads/2018/06/13-reasons-why-2.jpg", "keywords": [], "authors": ["Emily Mernin"], "canonical_link": "https://web.archive.org/web/20220823201828/https://www.thequiz.com/pick-you-favorites-to-see-which-netflix-series-you-should-binge-next/", "title": "Pick You Favorites To See Which Netflix Series You Should Binge Next", "meta_data": {"viewport": "user-scalable=yes, initial-scale=1.0, width=device-width", "twitter": {"card": "summary_large_image", "site": "@thequiz_com"}, "og": {"title": "Pick You Favorites To See Which Netflix Series You Should Binge Next", "type": "article", "image": {"identifier": "https://web.archive.org/web/20220823201828im_/https://static3.thequizimages.com/wordpress/wp-content/uploads/2018/06/13-reasons-why-2.jpg", "width": 1200, "height": 628}, "url": "https://web.archive.org/web/20220823201828/https://www.thequiz.com/pick-you-favorites-to-see-which-netflix-series-you-should-binge-next/", "locale": "en_US", "description": "Instead of sifting through the huge selection of shows on Netflix, take this short quiz and find out which Netflix series you should watch next!", "site_name": "TheQuiz"}, "article": {"published_time": "2018-06-12T13:00:51Z", "section": "Movies and TV"}, "fb": {"app_id": 1888896051351709}}, "movies": [], "publish_date": 1528808451.0, "source": "https://web.archive.org", "summary": ""}