{"url": "https://www.sheknows.com/entertainment/articles/1141397/alexander-skarsgard-returns-big-little-lies-season-2/", "text": "Alexander Skarsgård’s Big Little Lies character, the menacing Perry Wright, may have died in the season one finale of the hit HBO show, but that doesn’t mean he’s gone for good. In fact, he recently appeared in some season two photos taken on set, and when he was asked about it during an appearance on The Tonight Show with Jimmy Fallon, he took time to address it — sort of.\n\nMore: Reese Witherspoon & Nicole Kidman May Have Dropped Some BLL Season 2 Clues\n\nDuring his appearance Thursday on The Tonight Show, Skarsgård was very coy about what he was doing on set as well as his funny history with Big Little Lies season two star Meryl Streep.\n\n“I was on set, yes. I can’t disclose what I did on set,” Skarsgård told Fallon. “Maybe I was acting. I might have been just moral support. I might have just made coffee for the ladies. I might have helped Meryl Streep with her acting… Not help, but just give her little pointers, fine tune it a bit.”\n\nhttps://youtu.be/U5jX1jZVM0kSince Streep is playing Skarsgård’s character’s mother, Mary Louise Wright, it’s possible he will return to Big Little Lies season two in flashback scenes. Or maybe the show will take a supernatural turn and bring him back as a vengeful ghost. Either way, it will apparently be Skarsgård’s first opportunity to act opposite Streep, per ET, despite the fact that they costarred in 2014’s The Giver.\n\n“I did a movie years ago and one of the incentives was to work with Meryl Streep,” he told Fallon. “It was a scene with Meryl Streep and I was very, very excited about it. I didn’t sleep the night before.” But when he got to set, Streep wasn’t there. “They were like, ‘Oh no, she’s in London. She’s going to be a hologram in this scene because it’s a sci-fi. So you’re just going to stare into empty space here and say your lines and someone will read Meryl’s lines off camera,'” he explained.\n\nMore: Meet the Newest Cast Member of Big Little Lies\n\nWe know that Streep is confirmed to appear in every episode of season two, per costar and producer Reese Witherspoon, which means her character plays a pivotal role in what’s to come. They would be remiss to leave out potential memories of her son, seeing as his life was so abruptly snuffed out, but we’re still interested in seeing how Skarsgård factors into things when the new season premieres in 2019.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.sheknows.com/wp-content/uploads/2018/10/aoqbz6aikqb2v3o5fdik.jpeg?w=1920", "https://trc.taboola.com/1394147/log/3/unip?en=page_view", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.sheknows.com/wp-content/uploads/2022/09/BCA-issue-module.gif", "https://www.sheknows.com/wp-content/uploads/2018/10/aoqbz6aikqb2v3o5fdik.jpeg?w=1024", "https://www.facebook.com/tr?id=754209411294316&ev=PageView&noscript=1", "https://www.sheknows.com/wp-content/themes/vip/pmc-sheknows-2020/assets/public/lazyload-fallback.gif"], "top_img": "https://www.sheknows.com/wp-content/uploads/2018/10/aoqbz6aikqb2v3o5fdik.jpeg?w=1024", "keywords": [], "authors": ["Samantha Puc"], "canonical_link": "https://www.sheknows.com/entertainment/articles/1141397/alexander-skarsgard-returns-big-little-lies-season-2/", "title": "Alexander Skarsgård Is Coming Back to ‘Big Little Lies’ – SheKnows", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Alexander Skarsgård may have died on 'Big Little Lies,' but he's confirmed he's coming back in some form or another for season two.", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Samantha Puc", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "SheKnows", "application-name": "SheKnows", "content_type": "Article", "post_id": 1141397, "title": "Alexander Skarsgård Will Return for <em>Big Little Lies</em> Season 2 but Won't Say How", "published_at": "2018-09-27 13:30:00", "image": "https://www.sheknows.com/wp-content/uploads/2018/10/aoqbz6aikqb2v3o5fdik.jpeg?w=1024", "comment_count": 0, "tags": "television news", "topics": "TV & Movies", "body": "Alexander Skarsgård's Big Little Lies character, the menacing Perry Wright, may have died in the season one finale of the hit HBO show, but that doesn't mean he's gone for good. In fact, he recently appeared in some season two photos taken on set, and when he was asked about it during an appearance on The Tonight Show with Jimmy Fallon, he took time to address it — sort of. \n\nMore: Reese Witherspoon & Nicole Kidman May Have Dropped Some BLL Season 2 Clues\n\nDuring his appearance Thursday on The Tonight Show, Skarsgård was very coy about what he was doing on set as well as his funny history with Big Little Lies season two star Meryl Streep.\n\n\"I was on set, yes. I can’t disclose what I did on set,” Skarsgård told Fallon. \"Maybe I was acting. I might have been just moral support. I might have just made coffee for the ladies. I might have helped Meryl Streep with her acting… Not help, but just give her little pointers, fine tune it a bit.”\nSince Streep is playing Skarsgård's character's mother, Mary Louise Wright, it's possible he will return to Big Little Lies season two in flashback scenes. Or maybe the show will take a supernatural turn and bring him back as a vengeful ghost. Either way, it will apparently be Skarsgård's first opportunity to act opposite Streep, per ET, despite the fact that they costarred in 2014's The Giver.\n\n\"I did a movie years ago and one of the incentives was to work with Meryl Streep,\" he told Fallon. \"It was a scene with Meryl Streep and I was very, very excited about it. I didn’t sleep the night before.\" But when he got to set, Streep wasn't there. \"They were like, ‘Oh no, she’s in London. She’s going to be a hologram in this scene because it’s a sci-fi. So you’re just going to stare into empty space here and say your lines and someone will read Meryl’s lines off camera,'\" he explained.\n\nMore: Meet the Newest Cast Member of Big Little Lies\n\nWe know that Streep is confirmed to appear in every episode of season two, per costar and producer Reese Witherspoon, which means her character plays a pivotal role in what's to come. They would be remiss to leave out potential memories of her son, seeing as his life was so abruptly snuffed out, but we're still interested in seeing how Skarsgård factors into things when the new season premieres in 2019.", "fb": {"pages": 111589138109}, "onesignal": "wordpress-plugin", "og": {"type": "article", "title": "Alexander Skarsgård Confirms His 'Big Little Lies' Return", "url": "https://www.sheknows.com/entertainment/articles/1141397/alexander-skarsgard-returns-big-little-lies-season-2/", "description": "But he's being very coy about it.", "site_name": "SheKnows", "image": {"identifier": "https://www.sheknows.com/wp-content/uploads/2018/10/aoqbz6aikqb2v3o5fdik.jpeg?w=1024", "width": 1024, "height": 576, "alt": "Still of Alexander Skarsgard as Perry Wright on 'Big Little Lies'"}, "locale": "en_US"}, "article": {"published_time": "2018-09-27T17:30:00+00:00", "modified_time": "2018-09-27T18:13:56+00:00"}, "twitter": {"site": "@sheknows", "card": "summary_large_image", "title": "Alexander Skarsgård Confirms His 'Big Little Lies' Return", "description": "But he's being very coy about it.", "image": "https://www.sheknows.com/wp-content/uploads/2018/10/aoqbz6aikqb2v3o5fdik.jpeg?w=1024", "text": {"title": "Alexander Skarsgård Confirms His 'Big Little Lies' Return"}}, "msapplication-TileImage": "https://www.sheknows.com/wp-content/uploads/2020/07/cropped-sk-fav-icon.png?w=270"}, "movies": [], "publish_date": 1538069400.0, "source": "https://www.sheknows.com", "summary": ""}