{"url": "www.wmagazine.com/story/ryan-gosling-mourns-dog-bladerunner-2049", "text": "Eagle-eyed fans may have noticed that Ryan Gosling closed out his gig as host for the season 43 premiere of Saturday Night Live wearing a graphic shirt bearing the image of his dog, George. As it turns out, there was quite a sentimental reason before the sartorial statement. Appearing on Ellen yesterday, Gosling confirmed that the beloved canine had recently passed away at the age of seventeen. “He was a good friend to me,” Gosling told Ellen Degeneres during the sit-down. “There was something about George where he always—I think he felt being a dog was beneath him. He would not do tricks. if you wanted him to sit down you would have to convince him that it was in his best interest.”\n\nFans of the actor will be familiar with just how close the pair were—George even appeared alongside Gosling during an appearance on Late Night with Jimmy Fallon a few years back. Gosling took Friday’s stint on Ellen to share some of his other favorite memories of the canine. “One time we were at an outdoor restaurant and he was sort of sitting on the pavement, looking forlorn down the street,” he shared. “Someone got up to go to the restroom, and I guess he’d had enough, and he got up on their seat and sat down at the table like a gentleman and looked around the table, like, ‘Yeah, that’s right.’”\n\nIn brighter Gosling news, his film Bladerunner 2049, for which he’s been on the promo circuit for over the past few weeks, opened in theaters on Friday after much anticipation to generally favorable reviews. The long overdue sequel is set to pull in $36 million in its opening weekend, and is already generating some early Academy Awards buzz—meaning that we can expect plenty more emotional talk show appearances in the coming months.\n\nRelated: How Ana de Armas Went from Acting in Cuba to Starring Alongside Ryan Gosling in Blade Runner 2049\n\nJared Leto’s Robert De Niro Impression Is Flawless\n\nEva Mendes’s Style Evolution As Hollywood’s Femme Fatale Fresh on the scene, Eva attended the LA premiere of The Others wearing a simple white button-up dress paired with a bold orange shoulder bag and tan platform sandals. Photo by Getty Images. Getty Eva opted for a sexy black menswear inspired look while visiting the Mann Village Theatre in 2002. She completed her look with super long locks. Photo by Getty Images. Getty At the 2003 Toronto Film Festival, the actress kept her look simple on the red carpet. She donned a black v-neck maxi dress with what floral appliqué on the waist and hemline. Photo by Getty Images. Getty At the Golden Globe Awards, Mendes opted for a slinky halter top with an exposed back. Photo by Getty Images. Getty Mendes stunned in a gold floor grazing slip dress as she attended the Gucci Spring 2006 Fashion Show. She completed her look with a small gold clutch bag and minimal jewelry. Photo by Getty Images. Getty The actress upped the sex appeal of a white Christian Dior skirt suit, wearing nothing under it. The paring of black peep-toe pumps with this look kept it chic. Photo by Getty Images. Getty Mendes looked ultra hot in a bright red halter gown for the 2006 MTV Movie Awards. She accessorized with a small gold clutch bag, gold bangle bracelets and gold hoop earrings. Photo by Getty Images. Getty At the New York premiere of We Own the Night, the actress looked classic and stunning as she posed on the red carpet in a one shoulder grecian inspired gown. Photo by Getty Images. Getty Mendes looked darling in a strapless floral cocktail dress with nude scrappy platform sandals for The Spirit at New York ComicCon in 2008. Photo by Getty Images. Getty Dressed in a canary yellow Bill Blast strapless column dress, Mendes radiated on the red carpet of the Los Angeles premiere of The Spirit. She completed her look with a gorgeous diamond Van Clef & Arpels bracelet. Photo by Getty Images. Getty All eyes were on the actress as she posed on the red carpet at the 66th Annual Golden Globe Awards in a white Christian Dior gown paired with a turquoise Van Clef & Arpels sterling collar necklace. Photo by Getty Images. Getty The actress strutted down the red carpet of the 66th Venice Film Festival in a black Armani Prive gown featuring a center cutout bodice and ribbon bondage skirt. Photo by Getty Images. Getty At the 2010 Met Gala, the actress glowed in a vibrant orange Prada strapless gown. The gown featured a beaded bodice and peplum skirt with frontal split. Photo by Getty Images. Getty Staying true to her infinity for strapless feminine gowns, Mendes donned an exquisite red floor length Gucci gown at the La Dolce Vita World Restoration Premiere during The 5th International Rome Film Festival. Photo by Getty Images. Getty At the Art Of Elysium Heaven Gala 2011, the actress looked angelic as she donned a romantic silk Valentino gown featuring a rose ruffled shoulder with draped neck and bow waist. Photo by Getty Images. Getty Mendes smoldered at the Holy Motors premiere in this little black square-neck lace dress. She accessorized with simple black pumps and a gold and black clutch bag. Photo by Getty Images. Getty Mendes took to the red carpet for the 2013 Vanidades Icons of Style Awards dressed in a sexy black vintage Luis Estévez black frock with fringe details falling from the halter neckline. Photo by Getty Images. Getty The actress turned new fashion designer looked lovely in a black and white printed frock at the Eva Mendes for New York And Company Spring 2014 Collection pop up store launch party. Photo by Getty Images. Getty During her most recent Eva Mendes x New York & Company FW 16 Show, Mendes posed in a darling bureaux peter pan styled dress. She completed her looks with black lace stockings and burgundy Mary-Janes. Photo by Getty Images. Getty Actress Eva Mendes made her first public appearance in 6 months at the opening of a new New York & Company store in Miami on Thursday. Photo by Getty Images. Alexander Tamargo/FilmMagic/Getty Images INFO 1/20", "images": ["https://imgix.bustle.com/wmag/2017/03/05/58bbf67064f1eb1a4e15e297_2016-Sept.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/03/05/58bbf66b75b3e14ae867437b_2006-December.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/03/05/58bbf66f75b3e14ae8674387_2012-November.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/10/6/ac3acff9-07e2-4832-b8a2-5549d7ca318b-qa_harrisdickinson.jpg?w=160&h=160&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.56&fp-y=0.4401", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/wmag/2017/03/05/58bbf66bc3bc420fee88422c_2006-Jun.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/03/05/58bbf66dc3bc420fee884235_2009-Sept.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/03/05/58bbf66ec3bc420fee884238_2010-Oct.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/03/17/58cbfb003d50281a50a4441d_GettyImages-654234340.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/03/05/58bbf66e75b3e14ae8674384_2011-Jan.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/03/05/58bbf66d75b3e14ae867437e_2009-Jan.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/03/05/58bbf67075b3e14ae867438a_2013-Sept.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/03/05/58bbf66cc3bc420fee884232_2008-Dec.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/03/05/58bbf66bc3bc420fee884229_2005-November.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/03/05/58bbf66c64f1eb1a4e15e291_2008-April.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/03/05/58bbf66ac3bc420fee884226_2004-Jan.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/10/07/59d8fecee5c6bd261b2b78c4_GettyImages-119455153.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://imgix.bustle.com/wmag/2017/03/05/58bbf669c3bc420fee884223_2002-March.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/03/05/58bbf670c3bc420fee88423b_2014-March.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/03/05/58bbf66975b3e14ae8674375_2001-August.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/10/07/59d8f4a96bfc6b7e7f6fff28_GettyImages-856106594.jpg?w=414&h=254&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/10/7/5c4bc23c-3ee1-4968-98a5-538ccb77ec6c-new-faces_froygutierrez-social-1.jpg?w=160&h=160&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.5813&fp-y=0.2623", "https://imgix.bustle.com/wmag/2017/03/05/58bbf66d64f1eb1a4e15e294_2010-May.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/03/05/58bbf66cc3bc420fee88422f_2007-October.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/wmag/2017/03/05/58bbf66975b3e14ae8674376_2003-Sept.jpg?w=375&h=500&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1"], "top_img": "https://imgix.bustle.com/wmag/2017/10/07/59d8fecee5c6bd261b2b78c4_GettyImages-119455153.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.wmagazine.com/story/ryan-gosling-mourns-dog-bladerunner-2049", "title": "Ryan Gosling Mourns Loss Of Beloved Dog While Promoting Bladerunner 2049", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@wmag", "card": "summary_large_image"}, "article": {"publisher": "https://www.facebook.com/wmagazine"}, "og": {"site_name": "W Magazine", "url": "https://www.wmagazine.com/story/ryan-gosling-mourns-dog-bladerunner-2049", "type": "article", "title": "Ryan Gosling Mourns Loss Of Beloved Dog While Promoting Bladerunner 2049", "description": "George has gone to the dog park in the sky.", "image": {"identifier": "https://imgix.bustle.com/wmag/2017/10/07/59d8fecee5c6bd261b2b78c4_GettyImages-119455153.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "George has gone to the dog park in the sky."}, "movies": ["https://www.youtube.com/embed/mnKfOyRBpvs"], "publish_date": null, "source": "http://www.wmagazine.com", "summary": ""}