{"url": "https://en.wikipedia.org/wiki/List_of_Marvel_Cinematic_Universe_films", "text": "The Marvel Cinematic Universe (MCU) films are a series of American superhero films produced by Marvel Studios based on characters that appear in publications by Marvel Comics. The MCU is the shared universe in which all of the films are set. The films have been in production since 2007, and in that time Marvel Studios has produced and released 29 films, with at least 14 more in various stages of development. It is the highest-grossing film franchise of all time, having grossed over $27.4 billion at the global box office. This includes Avengers: Endgame, which became the highest-grossing film of all time at the time of its release.\n\nKevin Feige has produced every film in the series, alongside Avi Arad for the first two releases, Gale Anne Hurd for The Incredible Hulk, Amy Pascal for the Spider-Man films, Stephen Broussard for Ant-Man and the Wasp, Jonathan Schwartz for Shang-Chi and the Legend of the Ten Rings, Nate Moore for Eternals and Black Panther: Wakanda Forever, Brad Winderbaum for Thor: Love and Thunder, Eric Carroll for Blade, and Ryan Reynolds for Deadpool 3. The films are written and directed by a variety of individuals and feature large, often ensemble, casts.\n\nMarvel Studios releases its films in groups called \"Phases\". Its first film is Iron Man (2008), which was distributed by Paramount Pictures. Paramount also distributed Iron Man 2 (2010), Thor (2011), and Captain America: The First Avenger (2011), while Universal Pictures distributed The Incredible Hulk (2008). Walt Disney Studios Motion Pictures began distributing the series with the crossover film The Avengers (2012), which concluded Phase One. Phase Two comprises Iron Man 3 (2013), Thor: The Dark World (2013), Captain America: The Winter Soldier (2014), Guardians of the Galaxy (2014), Avengers: Age of Ultron (2015), and Ant-Man (2015).\n\nCaptain America: Civil War (2016) is the first film of Phase Three, and is followed by Doctor Strange (2016), Guardians of the Galaxy Vol. 2 (2017), Spider-Man: Homecoming (2017), Thor: Ragnarok (2017), Black Panther (2018), Avengers: Infinity War (2018), Ant-Man and the Wasp (2018), Captain Marvel (2019), Avengers: Endgame (2019), and Spider-Man: Far From Home (2019). The first three Phases are collectively known as \"The Infinity Saga\". The Spider-Man films are owned, financed, and distributed by Sony Pictures.\n\nPhase Four's group of films began with Black Widow (2021), and was followed by Shang-Chi and the Legend of the Ten Rings (2021), Eternals (2021), Spider-Man: No Way Home (2021), Doctor Strange in the Multiverse of Madness (2022), and Thor: Love and Thunder (2022), and will conclude with Black Panther: Wakanda Forever (2022). The Phase will feature these films, as well as eight television series and two specials for the streaming service Disney+.\n\nPhase Five begins with Ant-Man and the Wasp: Quantumania (2023), followed by Guardians of the Galaxy Vol. 3 (2023), The Marvels (2023), Blade (2023), Captain America: New World Order (2024), and Thunderbolts (2024). This phase will also include a total of seven seasons of television series for Disney+. Phase Six will include Deadpool 3 (2024), Fantastic Four (2024), Avengers: The Kang Dynasty (2025), and Avengers: Secret Wars (2025). The fourth, fifth, and sixth Phases are collectively known as \"The Multiverse Saga\".\n\nDevelopment\n\nKevin Feige helped conceive of a shared media universe of Marvel properties.\n\nBy 2005, Marvel Entertainment had begun planning to produce its own films independently and distribute them through Paramount Pictures.[1] In June 2007, Marvel Studios raised secured funding from a $525 million revolving credit facility with Merrill Lynch.[2] Marvel's plan was to release individual films for their main characters and then merge them in a crossover film.[3]\n\nIn November 2013, Marvel Studios head Kevin Feige said that \"in an ideal world\" releases each year would include one film based on an existing character and one featuring a new character, saying it's \"a nice rhythm\" in that format. While not always the case, as evident by the 2013 releases of Iron Man 3 and Thor: The Dark World, he said it is \"certainly something to aim for\".[4] Feige expanded on this in July 2014, saying, \"I don't know that we'll keep to [that model] every year, but we're doing that in 2014 and 2015, so I think it would be fun to continue that sort of thing\".[5] After the reveal of multiple release dates for films through 2019 in July 2014,[6] in which some had three films scheduled, Feige stated there was not \"a number cruncher\" telling the studio to increase their film output, but rather it was about \"managing [existing] franchises, film to film, and when we have a team ready to go, why tell them to go away for four years just because we don't have a slot? We'd rather find a way to keep that going.\"[7] After the titles were revealed in October 2014,[8] Feige said, \"The studio's firing on all cylinders right now ... which made us comfortable for the first time ... to increase to three films a year [in 2017 and 2018] instead of just two, without changing our methods.\"[9] On the potential for \"superhero fatigue\", Feige stated, though each of the films are based on the Marvel Comics and feature the \"Marvel Studios\" logo, he believed each film had their own distinctions to help differentiate them from other MCU and superhero films. For example, he noted how the 2016 releases of the studio, Captain America: Civil War and Doctor Strange, were \"two completely different movies\". The studio hoped to continue to surprise audience and ensure the studio was \"not falling into things becoming too similar\".[10]\n\nIn February 2014, Feige stated that Marvel Studios wants to mimic the \"rhythm\" that the comic books have developed, by having the characters appear in their own films, and then come together, much like \"a big event or crossover series\",[11] with Avengers films acting as \"big, giant linchpins\".[12] On expanding the characters in the universe and letting individual films breathe and work on their own, as opposed to having Avenger team-ups outside of Avengers films, Feige stated, it is about \"teaching the general movie-going audience about the notion of the characters existing separately, coming together for specific events and going away and existing separately in their own worlds again. Just like comic readers have been doing for decades and decades ... people sort of are accepting that there's just a time when they should be together and there's a time when they're not.\"[13]\n\nIn April 2016, on moving the universe to Phase Four and reflecting on the first three, Feige said, \"I think there will be a finality to moments of Phase Three, as well as new beginnings that will mark a different, a very different, a distinctively different chapter in what will someday be a complete first saga made up of three phases.\" Frequent director Joe Russo added Phase Three was the \"deconstruction phase\" of the MCU, beginning with Captain America: Civil War (2016) leading into \"the culmination films\" of Avengers: Infinity War (2018) and Avengers: Endgame (2019).[14] A year later, Feige felt after the conclusion of Phase Three, Marvel might abandon grouping the films by phases, saying, \"it might be a new thing\".[15] Feige mentioned that Avengers: Endgame would provide \"a definitive end\" to the films and storylines preceding it, with the franchise having \"two distinct periods. Everything before [Endgame] and everything after\". Many of the planned films following Endgame were intentionally \"completely different\" from the films in The Infinity Saga.[16]\n\nIn July 2019, Feige announced the Phase Four slate at San Diego Comic-Con, consisting of films and television event series on Disney+.[17] In December 2020, at Disney's Investor Day, Marvel Studios provided updates to previously announced films for the phase.[18][19] In late June 2022, Feige said that as Phase Four was nearing its conclusion, he felt audiences would begin to see where the next saga of the MCU would be heading, and added that there had been many clues throughout the phase to what that would be. He said Marvel Studios would be a \"little more direct\" on their future plans in the following months to provide audiences with \"the bigger picture [so they] can see a tiny, tiny bit more of the roadmap\".[20] In July 2022, Feige unveiled the Phase Five and Six slates at San Diego Comic-Con, similarly consisting of films and Disney+ series, and revealed that these three Phases would make up \"The Multiverse Saga\".[21]\n\nOn how much story is developed for future films of the universe, Feige said in September 2015 there are \"broad strokes\" though sometime \"super-specific things\". He continued that there was enough leeway to \"have room to sway and to move and to go and to surprise ourselves in places that we end up\" and that each film would feel satisfying on its own, but still interconnected to the larger universe and as if it had been planned years ahead of time. The studio also has various contingency plans for the direction of all of their films, in the event they are unable to secure a certain actor to reprise a role, or re-acquire the film rights to a character, such as was done in February 2015 with Spider-Man.[22]\n\nFilms\n\nMarvel Studios releases its films in groups called \"Phases\".[23][24]\n\nThe Infinity Saga\n\nThe films from Phase One through Phase Three are collectively known as \"The Infinity Saga\".[25][26]\n\nThe Multiverse Saga\n\nThe films from Phase Four through Phase Six are collectively known as \"The Multiverse Saga\".[21][68] They also include multiple series and two specials streaming on Disney+.[69][21]\n\nFuture\n\nAt any given time, Marvel Studios has future films planned five to six years out from what they have announced.[109] By April 2014, additional storylines were planned through 2028,[110] with MCU films through 2032 being planned by April 2022.[111] Disney has scheduled additional release dates for unannounced Marvel Studios films on February 14 and July 25, 2025, and February 13, May 1, July 24, and November 6, 2026.\n\nArmor Wars\n\nJames Rhodes must confront one of Tony Stark's greatest fears when Stark's tech falls into the wrong hands.[113]\n\nIn December 2020, Marvel Studios announced Armor Wars as a series based on the comic book storyline of the same name, with Don Cheadle reprising his role as James Rhodes / War Machine.[113] In August 2021, Yassir Lester was hired as the series' head writer.[114] In September 2022, Marvel Studios decided to rework the series into a feature film, with Cheadle and Lester remaining with the project.[106] Filming was expected to begin in early 2023,[106][115] at Trilith Studios in Atlanta, Georgia.[116]\n\nArmor Wars is set after the events of Secret Invasion (2023).[115] Walton Goggins reprises his role as Sonny Burch from Ant-Man and the Wasp (2018).[117]\n\nUntitled Shang-Chi and the Legend of the Ten Rings sequel\n\nIn December 2021, a sequel to Shang-Chi and the Legend of the Ten Rings (2021) was announced to be in development, with Destin Daniel Cretton returning to write and direct.[107] Simu Liu was expected to return as Shang-Chi by the following month.[118]\n\nUntitled Eternals sequel\n\nIn October 2021, Eternals director Chloé Zhao expressed interest in making a sequel,[119] which Pip the Troll actor Patton Oswalt revealed was in development in August 2022 with Zhao returning to direct.[108]\n\nOther\n\nMarvel Studios is working on an unknown project with Scarlett Johansson, who will serve as a producer.[120]\n\nRecurring cast and characters\n\nList indicator(s) This section includes characters who will appear or have appeared in films in multiple phases within the Marvel Cinematic Universe, and have appeared in the billing block for at least three films (see FAQ). A dark grey cell indicates the character was not in the film, or that the character's presence has not yet been confirmed. A C indicates an uncredited cameo role.\n\nA P indicates an appearance in onscreen photographs.\n\nA V indicates a voice-only role.\n\nRelease\n\nTheatrical distribution\n\nOver time, the distribution rights to Marvel Studios' films changed hands on multiple occasions. In November 2006, Universal Pictures announced that it would distribute The Incredible Hulk (2008),[226] in an arrangement separate from Marvel's 2005 deal with Paramount, which was distributing Marvel's other films.[1] In September 2008, after the international success of Iron Man (2008), Paramount signed a deal to have worldwide distribution rights for Iron Man 2 (2010), Iron Man 3 (2013), Thor (2011), Captain America: The First Avenger (2011), and The Avengers (2012).[227]\n\nIn late December 2009, The Walt Disney Company purchased Marvel Entertainment for $4 billion. Additionally, in October 2010, Walt Disney Studios bought the distribution rights for The Avengers and Iron Man 3 from Paramount Pictures,[228] with Paramount's logo remaining on the films, as well as for promotional material and merchandise,[229][230] although Walt Disney Studios Motion Pictures is the only studio credited at the end of these films.[231] Disney has distributed all subsequent Marvel Studios films.[232] In July 2013, Disney purchased the distribution rights to Iron Man, Iron Man 2, Thor and Captain America: The First Avenger from Paramount.[233] The Incredible Hulk was not part of the deal, due to an agreement between Marvel and Universal, where Marvel owns the film rights and Universal owns the distribution rights, for this film as well as the right of first refusal to distribute future Hulk films.[234] According to The Hollywood Reporter, a potential reason why Marvel has not bought the film distribution rights to the Hulk as they did with Paramount for the Iron Man, Thor, and Captain America films is because Universal holds the theme park rights to several Marvel characters that Disney wants for its own theme parks.[235]\n\nSpider-Man films\n\nIn February 2015, Sony Pictures Entertainment and Marvel Studios announced a licensing deal that would allow Spider-Man to appear in the Marvel Cinematic Universe, with the character first appearing in Captain America: Civil War.[236][237] Marvel Studios explored opportunities to integrate other characters of the Marvel Cinematic Universe into future Spider-Man films financed, distributed, and controlled by Sony Pictures,[236] with Robert Downey Jr. the first confirmed to reprise his role as Tony Stark / Iron Man in Spider-Man: Homecoming (2017).[238] In June 2015, Feige clarified that the initial Sony deal does not apply to the MCU television series, as it was \"very specific ... with a certain amount of back and forth allowed\".[239] Both studios have the ability to terminate the agreement at any point, and no money was exchanged with the deal. However, a small adjustment was made to a 2011 deal formed between the two studios (where Marvel gained full control of Spider-Man's merchandising rights, in exchange for making a one-time payment of $175 million to Sony and paying up to $35 million for each future Spider-Man film, and forgoing receiving their previous 5% of any Spider-Man film's revenue), with Marvel getting to reduce their $35 million payment to Sony if Spider-Man: Homecoming grossed more than $750 million.[240] Marvel Studios still received 5% of first dollar gross for the film.[241] Sony also paid Marvel Studios an undisclosed producer fee for Homecoming.[242]\n\nIn August 2019, it was reported that Disney and Sony could not reach a new agreement regarding Spider-Man films, with Marvel Studios and Feige said to no longer have any involvement in future films. Deadline Hollywood noted that Disney had hoped future films would be a \"50/50 co-financing arrangement between the studios\", with the possibility to extend the deal to other Spider-Man-related films, an offer Sony rejected and did not counter. Instead, Sony hoped to keep the terms of the previous agreement (Marvel receiving 5% of the film's first dollar gross), with Disney refusing.[241] The Hollywood Reporter added that the lack of a new agreement would see the end of Holland's Spider-Man in the MCU.[243] Variety cited unnamed sources claiming negotiations had \"hit an impasse\" and that a new deal could still be reached.[244] In September 2019, it was announced that Disney and Sony had reached a new agreement allowing for Spider-Man to appear in Spider-Man: No Way Home (2021) as the third film co-produced by Marvel Studios and Sony Pictures and a future Marvel Studios film.[184] Disney was reported to be co-financing 25% of the film in exchange for 25% of the film's profits in the new agreement, while retaining the merchandising rights to the character.[184][245]\n\nIn November 2021, producer Amy Pascal revealed that Sony and Marvel Studios were planning on making at least three more Spider-Man films starring Holland, with work on the first of those films getting ready to begin.[246] However, The Hollywood Reporter noted that there were no official plans for a new trilogy, despite the strong working relationship between the studios.[247] The following month, Feige said that he, Pascal, Disney, and Sony were \"actively beginning to develop\" the next Spider-Man story, assuring that there would not be any \"separation trauma\" that occurred between Far From Home and No Way Home.[248]\n\nHome media\n\nPhysical\n\nIn June 2012, Marvel announced a 10-disc box set titled \"Marvel Cinematic Universe: Phase One – Avengers Assembled\", for release on September 25, 2012. The box set includes all six of the Phase One films—Iron Man, The Incredible Hulk, Iron Man 2, Thor, Captain America: The First Avenger, and The Avengers—on Blu-ray and Blu-ray 3D, in a replica of Nick Fury's briefcase from The Avengers.[249] In August 2012, luggage company Rimowa GmbH, who developed the briefcase for The Avengers, filed suit against Marvel Studios and Buena Vista Home Entertainment in U.S. federal court, complaining that \"Marvel did not obtain any license or authorization from Rimowa to make replica copies of the cases for any purpose.\"[250] The set was delayed to early 2013 for the packaging to be redesigned.[251] The box set, with a redesigned case, was released on April 2, 2013. In addition, the box set included a featurette on the then-upcoming Phase Two films, showing footage and concept art, as well as previously unreleased deleted scenes from all of the Phase One films.[252]\n\nIn July 2015, Marvel announced a 13-disc box set titled \"Marvel Cinematic Universe: Phase Two Collection\", for release on December 8, 2015, exclusive to Amazon.com. The box set includes all six of the Phase Two films—Iron Man 3, Thor: The Dark World, Captain America: The Winter Soldier, Guardians of the Galaxy, Avengers: Age of Ultron, and Ant-Man—on Blu-ray, Blu-ray 3D and a digital copy, in a replica of the Orb from Guardians of the Galaxy, plus a bonus disc and exclusive memorabilia. Material on the bonus disc includes all of the Marvel One-Shots with commentary, deleted scenes and pre-production creative features for each of the films, featurettes on the making of the post-credit scenes for the films, and first looks at Captain America: Civil War, Doctor Strange, and Guardians of the Galaxy Vol. 2.[253][254]\n\nIn September 2019, Feige indicated a box set with all 23 films of The Infinity Saga would be released, with the set including previously unreleased deleted scenes and other footage, such as an alternate take of the Nick Fury post-credits scene from Iron Man which references Spider-Man, the Hulk, and the X-Men.[255] The box set, featuring all 23 films on Ultra HD Blu-ray and Blu-ray, a bonus disc, a letter from Feige, and a lithograph art piece by Matt Ferguson, was released on November 15, 2019, exclusively at Best Buy.[256]\n\nStreaming and cable\n\nIn March 2008, Marvel Studios presold the US cable broadcast rights to FX for five of their films, including Iron Man and The Incredible Hulk, for four years.[257] FX also acquired the rights to Iron Man 3 in May 2013.[258] In September 2014, TNT acquired the US cable broadcast rights to five Marvel Studios films, beginning with Avengers: Age of Ultron, for broadcast two years after their theatrical release.[259]\n\nEvery Marvel Studios release from January 2016 to December 2018 was available on Netflix.[260] Captain Marvel was the first Walt Disney Studios Motion Pictures-distributed film not to stream on Netflix, after Disney let their licensing deal with them expire. It became the first theatrical Disney release to stream exclusively on Disney+, which launched on November 12, 2019.[261][262] Bloomberg News reported that the films part of Disney's agreement with Netflix would return to Netflix starting in 2026, while being removed from Disney+.[260]\n\nIn April 2021, Sony signed a deal with Disney for its theatrical releases from 2022 to 2026 to stream on Disney+ and Hulu and appear on Disney's linear television networks for their \"pay 2 window\". As well, Sony's legacy content, including past Spider-Man films and Marvel content in Sony's Spider-Man Universe (SSU), would be able to be streamed on Disney+ and Hulu. Disney's access to Sony's titles would come following their availability on Netflix for their \"pay 1 window\". Homecoming and Spider-Man: Far From Home (2019) had previously been available on Starz and FX.[263][264]\n\nIMAX 10th anniversary festival\n\nFrom August 30 to September 6, 2018, in conjunction with Marvel Studios' 10 year anniversary celebrations, all 20 films released at the time (Iron Man through Ant-Man and the Wasp) were screened in IMAX. The films were shown in release order, with four films per day. The final days of the festival were theme related, with one showing \"origin\" films (Iron Man, Spider-Man: Homecoming, Black Panther, and Doctor Strange), one showing \"team-ups\" (Guardians of the Galaxy Vol. 2, Captain America: Civil War, The Avengers, and Avengers: Infinity War),[265][266] and the final day showing Iron Man and The Avengers as chosen by the fans via a Twitter poll.[267] The festival also saw Iron Man, The Incredible Hulk, and Captain America: The First Avenger released in IMAX for the first time.[265][266]\n\nReception\n\nBox office performance\n\nThe Marvel Cinematic Universe is the highest-grossing film franchise of all time worldwide, both unadjusted and adjusted-for-inflation, having grossed over $27.4 billion at the global box office. Several of its sub series such as the Avengers, Iron Man, Captain America, Thor and Spider-Man film series are among the most successful film series of all time.[268] From July 2019 to March 2021,[269] Avengers: Endgame was the highest-grossing film of all time.[270]\n\nEach film is linked to the \"Box office\" section of its article.\n\nCritical and public response\n\nEach film is linked to the \"Critical response\" section of its article.\n\nAccolades\n\nThe films of the Marvel Cinematic Universe have been nominated for awards, including 159 Saturn Awards, of which it won 36.\n\nRepurposed projects\n\nThese projects were in development as films from Marvel Studios before becoming television series under Marvel Television:\n\nConnections with other Spider-Man franchises\n\nFollowing Marvel Studios and Sony Pictures' September 2019 agreement, Feige noted that as Sony continued to separately build their own shared universe, Sony's Spider-Man Universe (SSU), it was possible the MCU version of Spider-Man could appear in that universe.[184] This interaction was said to be \"a 'call and answer' between the two franchises as they acknowledge details between the two in what ... would loosely be described as a shared detailed universe\".[245] In May 2021, Adam B. Vary of Variety called the connections between the two universes perplexing, specifically because if Holland were to appear in an SSU film it would retroactively make any previous SSU films part of the MCU, and because a teaser trailer for the SSU film Morbius (2022) had featured Michael Keaton, who previously played Adrian Toomes / Vulture in Spider-Man: Homecoming. Sony Pictures Group President Sanford Panitch acknowledged this confusion and said there was a plan to clarify the relationship between the two universes. He believed it was already \"getting a little more clear for people [as to] where we're headed\" at that time and added that the release of Spider-Man: No Way Home in December 2021 would reveal more of this plan. Vary commented that the apparent introduction of multiverse elements in No Way Home could be what would allow Holland to appear in both the MCU and the SSU.[430] The following month, Feige said he would not \"rule anything out completely\" in terms of additional Sony-controlled characters appearing in Marvel Studios films.[86]\n\nIn No Way Home, Stephen Strange casts two spells: one that brings characters from other universes into the MCU and one that sends them back to their own universes.[431] These characters as depicted in the film are Tobey Maguire and Andrew Garfield returning as their versions of Spider-Man from Sam Raimi's Spider-Man trilogy and Marc Webb's The Amazing Spider-Man films, respectively,[432] alongside Willem Dafoe as Norman Osborn / Green Goblin, Alfred Molina as Otto Octavius / Doctor Octopus, and Thomas Haden Church as Flint Marko / Sandman from the Raimi films, as well as Rhys Ifans as Curt Connors / Lizard and Jamie Foxx as Max Dillon / Electro from the Webb films.[433] The mid-credits scene of the SSU film Venom: Let There Be Carnage (2021) shows Eddie Brock and Venom (Tom Hardy) being transported into the MCU from their universe by the first spell and the mid-credits scene of No Way Home shows them being transported back to their own universe by the second spell. A small part of the Venom symbiote is left in the MCU.[431] Feige said there was a lot of coordination between the Let There Be Carnage and No Way Home teams to create the two scenes,[434] with No Way Home director Jon Watts directing both scenes during production of that film.[435] The mid-credits scenes of Morbius revealed that Toomes was accidentally transported from the MCU to the SSU following Strange's second spell.[436]\n\nSee also\n\nNotes\n\n^ Feige has produced every MCU film, with some films having additional Marvel Studios producers. See the tables in § Films for more information. ^ Black Widow was released concurrently on [70] was released concurrently on Disney+ with Premier Access ^ [76] Zhao is credited both as a solo writer and as part of a writing team with Burleigh. ^ Black Widow also earned $67 million globally from Disney+ Premier Access in its opening weekend.[308][309][310] Disney announced thatalso earned $67 million globally from Disney+ Premier Access in its opening weekend.", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Global_thinking.svg/10px-Global_thinking.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Cscr-featured.svg/20px-Cscr-featured.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/7/72/Symbol_project_class.svg/16px-Symbol_project_class.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/7/7f/Marvel_Cinematic_Universe_Infinity_Saga_artwork.jpeg/220px-Marvel_Cinematic_Universe_Infinity_Saga_artwork.jpeg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Kevin_Feige_%2848462887397%29_%28cropped%29.jpg/170px-Kevin_Feige_%2848462887397%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/7/7f/Marvel_Cinematic_Universe_Infinity_Saga_artwork.jpeg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8c/Extended-protection-shackle.svg/20px-Extended-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/7/7f/Marvel_Cinematic_Universe_Infinity_Saga_artwork.jpeg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_Marvel_Cinematic_Universe_films", "title": "List of Marvel Cinematic Universe films", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/7/7f/Marvel_Cinematic_Universe_Infinity_Saga_artwork.jpeg", "width": 640, "height": 482}, "title": "List of Marvel Cinematic Universe films - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}