{"url": "www.celebritynetworth.com/richest-businessmen/richest-designers/anna-wintour-net-worth/", "text": "What is Anna Wintour's Net Worth and Salary?\n\nAnna Wintour is an American magazine editor and fashion news icon. Anna Wintour has a net worth of $50 million. Her annual salary as Editor of Vogue is $4 million. She is considered one of the most influential figures in the fashion industry. She served as the iconic (albeit not very flattering) inspiration for the popular novel and movie \"The Devil Wears Prada.\"\n\nEarly Life\n\nAnna Wintour was born November 3, 1949 in Hampstead, London. Her career began in the world of fashion before moving into journalism, largely at the behest of her parents. Her father Charles Wintour was the editor of the London Evening Standard for nearly two decades. Her parents were married for nearly forty years before divorcing in 1979. She has four siblings. Her older brother Gerald sadly died in a car accident when they were children. Wintour attended North London Collegiate School and started dating older, well-connected men in her teens. Wintour's father arranged her first job for her, at Bib boutique, when he was 15.\n\nEarly Career\n\nShe left North London Collegiate and began a training program at Harrods while taking fashion classes at a nearby school. In 1970, Wintour was hired on as an editorial assistant for the new Harper's & Queen fashion magazine. Even at this early stage of her career, Wintour divulged to coworkers that she had the desire to edit Vogue, (a desire that would grow to be fulfilled nearly 20 years later.) After many disagreements with her rival, Min Hogg, Anna quit the magazine and moved to New York with her boyfriend Jon Bradshaw.\n\nAt home in her new country, Anna started working as a junior fashion editor at Harper's Bazaar in 1975. However, she was fired after just nine months for trying to put forth daring, risque, and innovative shoots. A few months later, she got her first position at Viva as a fashion editor. However, the magazine shut down due to being unprofitable in 1978. Wintour took time off work and broke up with Bradshaw, starting a new relationship with French record producer Michel Estaban. For two years, she would divide her time between Paris and New York. Wintour returned to work in 1980 and became the fashion editor for New York. Wintour finally got her chance to work for Vogue when Alex Liberman, editorial director for Conde Nast (the publisher of Vogue) clued Anna in about a position there in 1983. Wintour got the position and immediately doubled her salary when she became the magazine's first creative director. In 1985, Wintour obtained her first editorship when she took over the UK edition of Vogue after Beatrix Miller retired. She replaced much of the staff and exerted more control over the magazine than previous editors had, which earned her the nickname Nuclear Wintour.\n\nIn 1987, Conde Nast requested Wintour take over House & Garden, whose readership was flailing and lagging behind Architectural Digest. She did indeed make sweeping changes: cancelling $2 million worth of photo spreads and articles in her first week and packing so much fashion onto the pages that it earned the nickname House & Garment. Ten months later, Anna Wintour became the editor of U.S. Vogue.\n\nVogue\n\nWintour again introduced sweeping changes to Vogue from her first issue forward. Many of these changes could be seen right on the cover. Wintour favored more naturalistic photography of lesser-known models outside, as opposed to the tight headshots the magazine had previously favored. Additionally, Wintour's first Vogue cover was also the first to feature a model wearing jeans, with the added bonus of wearing a bejeweled T-shirt valued at around $10,000.\n\nBy the 2000s, Wintour had solidified her grasp on Vogue's artistic direction and had become a household name. The September 2004 issue was the largest issue of a monthly magazine ever published at that time, sitting at a whopping 832 pages. Wintour oversaw the introduction of three magazine spinoffs: Teen Vogue, Vogue Living, and Men's Vogue. Teen Vogue has gone on to become an extremely popular entity, earning more advertiser revenue than either Elle Girl or Cosmo Girl.\n\n2006 saw the release of \"The Devil Wears Prada\", with a character based off of Wintour. The film transformed her image into a cultural icon versus just a public figure. Rumors began to fly in 2008 that Wintour had lost her touch and was set to retire, but she disputed that rumor on a \"60 Minutes\" profile. In 2013, Conde Nast announced Wintour would be taking the position of artistic director while still remaining at Vogue. In 2014, Wintour was named by Forbes magazine as the 39th most powerful woman in the world. That same year, the Metropolitan Museum of Art named its Costume Institute complex after Wintour, with First Lady Michelle Obama opening. In May 2017, Wintour was created a Dame Commander of the Order of the British Empire at a ceremony at Buckingham Palace for her contributions to fashion journalism. Under Wintour, Vogue has continued to be one of the pillars of fashion journalism.\n\nPersonal Life\n\nAnna was married to David Shaffer from 1984 to 1999. They have two children: Charles (b. 1985) and Katherine (b. 1987). Katherine, also known as Bee, wrote columns for The Daily Telegraph in 2006, but has said she has no desire to follow her mother into the fashion world. Wintour married business investor Shelby Bryan in 2004.\n\nWintour is involved with many charities. She serves as a trustee of the Metropolitan Museum of Art, where she organizes benefits that have raised over $50 million. Wintour started the CFDA Vogue Fund in order to mentor and support unknown fashion designers. Wintour has raised over $10 million for AIDS charities since 1990. She resides in Greenwich Village.", "images": ["http://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/wp-content/uploads/2010/03/aw2.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://vz.cnwimg.com/wp-content/uploads/2010/03/aw.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2010/03/aw.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-businessmen/richest-designers/anna-wintour-net-worth/", "title": "Anna Wintour Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Anna Wintour Net Worth and Salary: Anna Wintour is an American magazine editor and fashion news icon. Anna Wintour has a net worth of $50 million. Her annual salary as Editor of Vogue is $4 million.", "cnw_share_fb_count": 65, "cnw_share_tw_count": 59, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Anna Wintour Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-businessmen/richest-designers/anna-wintour-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/03/aw.jpg", "site_name": "Celebrity Net Worth", "description": "Anna Wintour Net Worth and Salary: Anna Wintour is an American magazine editor and fashion news icon. Anna Wintour has a net worth of $50 million. Her annual salary as Editor of Vogue is $4 million."}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2022-05-31T16:46:44+00:00", "published_time": "2020-07-01T18:34:47+00:00", "section": "Designers", "tag": "vogue magazine"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/03/aw.jpg", "title": "Anna Wintour Net Worth", "description": "Anna Wintour Net Worth and Salary: Anna Wintour is an American magazine editor and fashion news icon. Anna Wintour has a net worth of $50 million. Her annual salary as Editor of Vogue is $4 million."}}, "movies": [], "publish_date": 1593628487.0, "source": "http://www.celebritynetworth.com", "summary": ""}