{"url": "https://stylecaster.com/beauty/spray-tan-tips/", "text": "Warmer weather means less clothing, which means more skin on display—and for some people, that means a fake tan is in order so as to avoid shining like a pale beacon when exposed to the light of day. But it’s 2020, folks, and we all know that baking our skin for real is out and the faux tan is in. Easy at-home self-tanner can be effective but runs the risk of turning your skin (and sheets) orange if you’re not cautious. With that being said, we’ve got plenty of spray tan tips, whether you’re leaving the application to an expert or doing it yourself at home.\n\nTry self-tanner if you haven’t already.\n\nUsing self-tanner at home will help you feel comfortable going for the glow. Focus on either the face or another part of the body first to master the application. Once you decide you like the results, you’re ready to commit to a head-to-toe tan. Results will ultimately vary from person to person, but one self-tanner application will typically last two weeks before it starts to fade (or need a touch-up).\n\nShower and exfoliate first.\n\n\n\nRemove your makeup and take a shower before applying a self-tanner or getting a spray tan. (Keep in mind that certain self-tanner products may require waiting a few hours after cleansing to apply. Remember to always read directions!) While you’re in the shower, use a body scrub to slough away any dry, flaky skin before so that the pigment will adhere smoothly for the evenest results (as in, least streaky). Additionally, avoid using body oil or lotions with oil prior to your tan, as it will cause blotches and prevent the tan from developing.\n\nThink about your undergarments.\n\n\n\nWhile many people decide to get a spray tan or apply self-tanner while wearing nothing (no tan lines!), if you do wear a bathing suit or undergarments, wear pieces you don’t mind potentially ruining with rogue tanning solution.\n\nWear polish to shield your nail beds.\n\n\n\nEven if it’s nothing more than a clear coat, wearing polish will help to protect your nail beds from getting stained by tanning solution if that’s a point of concern. If you already have a full manicure, don’t worry about it getting ruined—you can wipe them off afterward, too.\n\nApply barrier cream.\n\nNaturally drier areas of the skin, like the elbows, ankles, and knees, will absorb more pigment, so always apply a protective barrier cream before the tan so that they don’t go too dark.\n\nPat, don’t rub, your skin dry.\n\n\n\nTo preserve your tan, pat yourself dry rather than scour with a towel after getting out of the shower. The idea is to not exfoliate for as long as possible so that you don’t slough off the tan. Avoid using loofahs or coarse washcloths for the same reason.\n\nBe prepared to correct mistakes (especially if you’re a newbie).\n\nThe pigment that self-tanners or spray tans leave behind is meant to slowly fade as your top layer of skin regenerates, so it’s not the kind of thing you can just scrub off. That’s why it’s able to last up to a week or two—and why you should approach with caution to make sure you won’t be stuck looking unnaturally tan for a full 14 days. If you find you’re seeing patches and want to remove your tan, gently exfoliating your skin with a self-tan removing mitt will do the trick. There are also self-tanner remover products that require less of an effort.\n\nMoisturize every day.\n\n\n\nKeeping your newly tanned skin hydrated is the best way to make the color last longer because it won’t dry out and need to be exfoliated prematurely.\n\nRemember the effects are more gradual than instant.\n\n\n\nSelf-tanner and spray tans will get darker from the time they’re applied and as the days progress. The color takes a little while to fully develop, so don’t be alarmed if you look in the mirror and feel like the results aren’t what you expected—it won’t be for long.\n\nOriginally published July 2016. Updated February 2020.\n\nOur mission at STYLECASTER is to bring style to the people, and we only feature products we think you’ll love as much as we do. Please note that if you purchase something by clicking on a link within this story, we may receive a small commission of the sale and the retailer may receive certain auditable data for accounting purposes.", "images": ["https://stylecaster.com/wp-content/uploads/2020/06/essie-enamel-summer-2020-worth-the-tassel-front-us.png?w=670", "https://stylecaster.com/wp-content/uploads/2022/09/maybelline-illegal-length-mascara-tiktok.png?w=120&h=120&crop=1", "https://stylecaster.com/wp-content/uploads/2022/09/Mugler-Alien-Goddess-Eau-de-Parfum-Intense.png?w=120&h=120&crop=1", "https://secure.gravatar.com/avatar/70288ae1412000d981427172e72e64e7?s=96&d=identicon&r=g", "https://trc.taboola.com/1394147/log/3/unip?en=page_view", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://stylecaster.com/wp-content/uploads/2022/09/Ubeauty.gif?w=120&h=120&crop=1", "https://www.facebook.com/tr?id=146467699155455&ev=PageView&noscript=1", "https://stylecaster.com/wp-content/uploads/2022/09/Marilyn-Monroe.jpg?w=120&h=120&crop=1", "https://stylecaster.com/wp-content/uploads/2022/10/Kylie-Jenner.png?w=120&h=120&crop=1", "https://stylecaster.com/wp-content/uploads/2020/04/st-tropez-self-tan-bronzing-water-serum.jpg?w=477", "https://stylecaster.com/wp-content/uploads/2020/04/banner-newsletter-1.jpg?w=670", "https://stylecaster.com/wp-content/uploads/2018/06/self-tanner-removal.jpg", "https://stylecaster.com/wp-content/uploads/2017/06/smooth-summer-tan-remover.jpg?w=477"], "top_img": "https://stylecaster.com/wp-content/uploads/2018/06/self-tanner-removal.jpg", "keywords": [], "authors": ["Augusta Falletta"], "canonical_link": "https://stylecaster.com/feature/spray-tan-tips-428943/", "title": "9 Things to Know Before Getting a Spray Tan or Using Self-Tanner", "meta_data": {"description": "Considering getting your first spray tan or using self-tanner at home? Here are the tips to know so you can get that perfect faux glow.", "keywords": "spray tan, spray tan tips", "msvalidate.01": "7A34A1C1904BAFB83691E8B3718CA9A2", "article": {"publisher": "https://www.facebook.com/stylecaster", "published_time": "2020-06-18T18:45:21+00:00", "modified_time": "2020-06-18T18:50:09+00:00", "author": "Augusta Falletta", "section": "Beauty", "tag": "spray tan tips"}, "google-site-verification": "yB_5UwT5pPNnn93Mba5HIaFkNtbrafDQWP_Rj34Iw08", "news_keywords": "amazon, exclude-from-homepage, Fake Tanning, shop, spray tan, spray tan tips", "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1, maximum-scale=1", "generator": "WordPress 6.0.2", "author": "Augusta Falletta", "theme-color": "#fff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "StyleCaster", "application-name": "StyleCaster", "og": {"site_name": "StyleCaster", "type": "article", "locale": "en_US", "url": "https://stylecaster.com/feature/spray-tan-tips-428943/", "title": "9 Things to Know Before Getting a Spray Tan or Using Self-Tanner", "description": "If you're going to do it, do it right.", "image": {"identifier": "https://stylecaster.com/wp-content/uploads/2018/06/self-tanner-removal.jpg", "width": 960, "height": 540}}, "fb": {"app_id": 134683123322801, "pages": 48566051011, "article_style": "scdefault"}, "twitter": {"card": "summary_large_image", "site": "@stylecaster", "creator": "@stylecaster", "title": "9 Things to Know Before Getting a Spray Tan or Using Self-Tanner", "description": "If you're going to do it, do it right.", "image": "https://stylecaster.com/wp-content/uploads/2018/06/self-tanner-removal.jpg", "account_id": 55678606}}, "movies": [], "publish_date": 1592505921.0, "source": "https://stylecaster.com", "summary": ""}