{"url": "https://www.mercurynews.com/2018/08/16/lara-trump-is-no-longer-the-least-controversial-trump/", "text": "While most of President Donald Trump’s offspring and their spouses have been mired in scandal or investigations, or have just been the butt of late-night jokes (see: Eric and Tiffany), Eric Trump’s wife Lara Trump has managed to glide above the fray.\n\nThat was until Thursday when former White House aide Omarosa Manigault Newman released a secret recording of a conversation with Lara Trump. Manigault Newman played the recording on MSNBC to bolster her contention that Trump’s loyal daughter-in-law tried to buy her silence after she was fired from the White House staff.\n\nOn the recording, Lara Trump, a senior member of the president’s 2020 campaign, can be heard offering Manigault Newman a $15,000-a-month contract to work in his re-election campaign.\n\nLara Trump also discussed salary considerations and a job that didn’t sound as though it had any clear responsibilities.\n\nMost questionably, Lara Trump also addressed the likelihood that Manigault Newman would have “some things in the back pocket to pull out,” before telling her she would be expected to only say positive things about the president, his campaign and perhaps his family.\n\n“Everything, everybody, positive, right?” Lara Trump asks.\n\nThe release of the recording sent Lara Trump’s name into the top 10 Twitter trending topics. People made jokes: “That money is meant for silencing porn stars.” But they also raised concerns about whether the Trump campaign was using donations raised from “working class” supporters to fund hush money payments to disgruntled former employees.\n\nFor probably the first time as a Trump loyalist and family member, the 35-year-old former “Inside Edition” producer and mother of one found herself in the middle of a white-hot controversy.\n\nIn a written statement to the Washington Post, she declared the recording “a fraud” and claimed that the snippets that were aired “took place in numerous phone calls over the course of several weeks.”\n\nLara Trump also said she had felt betrayed by the former “Celebrity Apprentice” villain. She referred to their time campaigning together for Trump in 2016 and said she had come to regard Manigault Newman as “a friend and a campaign sister.” Lara Trump concluded, “I am absolutely shocked and saddened by her betrayal and violation on a deeply personal level.”\n\nHaving to issue this kind of public defense probably is unfamiliar territory for Lara Trump, even though she is regarded by some as “the face” of the Trump 2020 campaign. She has put herself out there as one of Trump’s most reliable advocates, making regular appearances on Fox News or at rallies to tout his agenda.\n\nHer name also is affixed to a steady stream of emails that go out to supporters, in which she often solicits for donations in small amounts — $1, $5, $10 or $20.\n\nFor example, in a July 24 email, Lara Trump offered a “top patriot” the chance to win a backstage VIP pass to the president’s upcoming rally. All this “patriot” needed to do was make one of those small money donations to have their name entered to win.\n\n“My father-in-law has tuned out the mainstream media,” Lara Trump said in her email. “He cares more about knowing he has support from patriots like you.”\n\nEven with all this fierce advocacy, Lara Trump has mostly remained above the political fray. She doesn’t engage in belligerent Twitter fights like her brother-in-law Donald Trump Jr.. And, unlike sister-in-law Ivanka Trump, she hasn’t been the subject of backlash over clumsy efforts to weigh in on issues like racism, women’s rights, migrant children or the LGBTQ community.\n\nIn fact, Lara Trump doesn’t often get clumsy on social media — unlike her in-laws. Her Instagram is mostly filled with what Slate called “bland” photos of Eric Trump, their nearly 1-year-old son Luke, their two beagles, or of her working out, showing off her slender, 5-foot-11 frame doing hardcore gym workouts.\n\nOn her Instagram and Twitter feed, she also shares political photo-ops, promos for her Fox News appearances and retweets from like-minded politicos, urging support of particular candidates or Republican causes. With regard to her political posts, she’s sticks to a core message, according to Slate: “The truth is, we all know what Lara Trump’s special thing is: It’s that she supports her father-in-law, the president.”\n\nIn April, E! News called Lara and Eric Trump the “most normal, least controversial Trump couple.” Most stories that focus on Lara Trump quote her as offering pleasant accounts about how she and Eric Trump met about a decade ago. Lara Trump told “Fox & Friends” that she and her future husband were out with friends and bonded over the fact that they were “”probably the two tallest people in the room,” according to E! News.\n\n“I think we spotted each other across the room,” Lara Trump said about Eric, who is 6-foot-5 inches and therefore towers over his siblings. “I was immediately intrigued and hopefully Eric felt the same way. It took us about three months to go on a date.”\n\nThey married in 2014 in grand Trump fashion — at Mar-a-Lago. As soon as her father-in-law announced his presidential aspirations, Lara Trump jumped in to help out. After the election, she joined the Trump re-election efforts with her advocacy continuing even after she gave birth to her son last September.\n\nDuring the 2016 election, Lara Trump spoke at rally in her home state of North Carolina, where she shared her excitement with voters about being part of her father-in-law’s political movement.\n\n“I never expected, when I moved nine years ago to New York City, that this would ever happen to me,” said Lara Trump who, according to the Port City Daily, originally moved to New York City to attend culinary school. “(Being a part of this campaign) is the greatest thing I’ve ever done in my entire life. It’s incredible.”", "images": ["https://www.mercurynews.com/wp-content/uploads/2018/08/larat.jpg?w=1024&h=683", "https://www.mercurynews.com/wp-content/themes/wp-mason/static/images/site-logo/banglogo_small.png", "https://www.mercurynews.com/wp-content/uploads/2020/09/mn-logo.svg", "https://i1.wp.com/www.mercurynews.com/wp-content/uploads/2018/08/AFP_18D19P.jpg?fit=620%2C9999px&ssl=1", "https://www.mercurynews.com/wp-content/plugins/dfm-trust-indicators/static/images/Trust-Logo-Horizontal.svg"], "top_img": "https://www.mercurynews.com/wp-content/uploads/2018/08/larat.jpg?w=1024&h=683", "keywords": [], "authors": ["Martha Ross", "Features Writer", "Martha Ross Is A Features Writer Who Covers Everything", "Anything Related To Popular Culture", "Society", "Health", "Women S Issues", "Families. A Native Of The East Bay", "A Graduate Of Northwestern University", "Mills College"], "canonical_link": "https://www.mercurynews.com/2018/08/16/lara-trump-is-no-longer-the-least-controversial-trump/", "title": "After Omarosa tape, Lara Trump is no above controversy", "meta_data": {"application-name": "themercurynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "robots": "max-image-preview:large", "description": "Lara Trump, a senior campaign advisor for Donald Trump, has stayed away from the controversy often surrounding Donald Trump Jr., Ivanka Trump or Jared Kushner.", "generator": "WordPress 6.0.2", "fb": {"pages": 63095136336}, "vf": {"url": "https://www.mercurynews.com/2018/08/16/lara-trump-is-no-longer-the-least-controversial-trump/", "container_id": 5486517}, "og": {"type": "article", "title": "After Omarosa tape, Lara Trump is no longer the least controversial Trump", "url": "https://www.mercurynews.com/2018/08/16/lara-trump-is-no-longer-the-least-controversial-trump/", "description": "Until Omarosa released their conversation, Lara Trump, Eric Trump’s wife and a senior Trump campaign advisor, has avoided controversy.", "site_name": "The Mercury News", "image": {"identifier": "https://www.mercurynews.com/wp-content/uploads/2018/08/larat.jpg?w=1024&h=683", "width": 1024, "height": 683}, "locale": "en_US"}, "article": {"published_time": "2018-08-16T23:48:07+00:00", "modified_time": "2018-08-17T10:42:00+00:00"}, "twitter": {"text": {"title": "After Omarosa tape, Lara Trump is no longer the least controversial Trump"}, "image": "https://www.mercurynews.com/wp-content/uploads/2018/08/larat.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.mercurynews.com/wp-content/uploads/2016/10/32x32-mercury-news-white.png?w=32"}, "movies": [], "publish_date": 1534374000.0, "source": "https://www.mercurynews.com", "summary": ""}