{"url": "https://en.wikipedia.org/wiki/Hennessy_Carolina", "text": "Love & Hip Hop: New York (originally titled Love & Hip Hop) is the original installment of the Love & Hip Hop reality television franchise on VH1. The series premiered on March 6, 2011, and chronicles the lives of people involved with hip hop music in New York City (and nearby areas, including New Jersey, and Yonkers).\n\nThe series has a large ensemble cast, with leading cast members in the opening credits, and a sprawling supporting cast, who are credited as \"additional cast\" or \"featured\" in the show's end credits. These secondary cast members appear in green screen confessional segments and (for the most part) have the same amount of screen time and storyline focus as the show's main cast members. Over the years, several supporting cast members have been upgraded to lead.\n\nCast timeline [ edit ]\n\nMain cast (appears in opening credits) Secondary cast (appears in green screen confessional segments and in end credits alongside the main cast) Guest cast (appears in a guest role or cameo)\n\nNote:\n\na b Appears in the Love & Hip Hop New York: Dirty Little Secrets special only. a b c d Appears in the Love & Hip Hop New York: Dirty Little Secrets and Love & Hip Hop: The Love Edition specials only. a b c d Appears in the Love & Hip Hop Live: The Wedding special only. a b Appears in a bonus scene only. ^ As Juelz was incarcerated during the filming of this season, he appears only via phone call conversations with Kimbella. a b As Mendeecees was incarcerated during the filming of this season, he appears only via phone call conversations with Yandy and other cast members. ^ Appears in the Love & Hip Hop: The Love Edition special only.\n\nMain cast members [ edit ]\n\nOriginal cast members [ edit ]\n\nSeason 2 additions [ edit ]\n\nKimbella James (née Vanderhee ), (Seasons 2, 7, 9–10, guest star in seasons 3, 5) is a biracial urban model and video vixen, originally from Miami, Florida. She has been in an on-again, off-again relationship with Juelz Santana since 2009 and is the mother of his son, Juelz Santana James, born 2010. She also has a son, Leandro, born 2002, from a previous relationship. Kimbella joins the main cast of Love & Hip Hop from season two. In the premiere episode, she admits to having sex with Fabolous while Emily was pregnant with his child, igniting a violent altercation with Emily's friend Chrissy. Later in the season, she gets into an ugly brawl with Erica Mena, stemming from their modelling days together. After the season's reunion special, Kimbella quit the series, after revealing that she is pregnant with Juelz' second child. She gave birth to Bella Monroe James in 2012. Kimbella returns as Yandy's friend and confidante in guest appearances during seasons three and five, and as a bridesmaid at Yandy and Mendeecees' wedding in the special Love & Hip Hop Live: The Wedding . She rejoins the main cast in season seven, which chronicles her relationship with Juelz as he embarks on a career comeback. She quit the show for a second time while filming season eight after falling out with Yandy, [15] appearing only in the specials Love & Hip Hop New York: Dirty Little Secrets and Love & Hip Hop: The Love Edition . Kimbella and Juelz rejoin the cast together in season nine, which chronicles their struggles as a couple, after Juelz faces jail time for bringing a loaded gun to Newark Airport. During the season, she reveals that Juelz has struggled with opiate addiction for many years. Later, he proposes and the two become engaged. They marry in the season's finale. During the reunion, Kimbella reveals that she is pregnant with the couple's third child (and Kimbella's fourth). She gave birth to Santana James in 2019. Kimbella returns in season ten, which chronicles her attempts to adjust to life while Juelz is incarcerated, amid ongoing tensions with Yandy after her reconciliation with Chrissy.\n\n(née ), (Seasons 2, 7, 9–10, guest star in seasons 3, 5) is a biracial urban model and video vixen, originally from Miami, Florida. She has been in an on-again, off-again relationship with Juelz Santana since 2009 and is the mother of his son, Juelz Santana James, born 2010. She also has a son, Leandro, born 2002, from a previous relationship. Kimbella joins the main cast of from season two. In the premiere episode, she admits to having sex with Fabolous while Emily was pregnant with his child, igniting a violent altercation with Emily's friend Chrissy. Later in the season, she gets into an ugly brawl with Erica Mena, stemming from their modelling days together. After the season's reunion special, Kimbella quit the series, after revealing that she is pregnant with Juelz' second child. She gave birth to Bella Monroe James in 2012. Kimbella returns as Yandy's friend and confidante in guest appearances during seasons three and five, and as a bridesmaid at Yandy and Mendeecees' wedding in the special . She rejoins the main cast in season seven, which chronicles her relationship with Juelz as he embarks on a career comeback. She quit the show for a second time while filming season eight after falling out with Yandy, appearing only in the specials and . Kimbella and Juelz rejoin the cast together in season nine, which chronicles their struggles as a couple, after Juelz faces jail time for bringing a loaded gun to Newark Airport. During the season, she reveals that Juelz has struggled with opiate addiction for many years. Later, he proposes and the two become engaged. They marry in the season's finale. During the reunion, Kimbella reveals that she is pregnant with the couple's third child (and Kimbella's fourth). She gave birth to Santana James in 2019. Kimbella returns in season ten, which chronicles her attempts to adjust to life while Juelz is incarcerated, amid ongoing tensions with Yandy after her reconciliation with Chrissy. Yandy Smith-Harris (Seasons 2–10, cameo appearance in season 1) is an entertainment manager and entrepreneur. She was born in Harlem. In 2004, she graduated from Howard University with a bachelor's degree in business and interned at Violator under the mentorship of Mona Scott-Young. In 2005, Yandy met Jim Jones on a private jet charted by Russell Simmons, and left Violator to manage him full-time. In 2006, Jim approached VH1 executives to make a reality show about him, leading to the filming of an 11-minute presentation tape, Keeping Up with Joneses, produced by Stefan Springman and Toby Barraud of Eastern TV. VH1 were unsure if audiences would be invested in the concept full-time, and Yandy approached Mona to retool the show, and the concept was tweaked to include Jim's girlfriend Chrissy and her circle of friends, becoming what would be later known as Love & Hip Hop. Yandy first appears briefly in an uncredited cameo at Chrissy's proposal party in the first season, before joining the main cast from season two. The season chronicles her struggles while working as Jim's manager and the demise of their professional relationship, culminating in a violent brawl with Chrissy at a Miami nightclub. In July 2012, Yandy gave birth to her first child, Omere Harris. Season three introduces Mendeecees Harris, her child's father and on-again, off-again boyfriend since 2007,[16] and chronicles their engagement and subsequent wedding plans, which are interrupted when Mendeecees is forced to turn himself into custody for multiple drug and trafficking charges. The couple are reunited in season five when Mendeecees is released on bail, and Yandy gives birth to their second child, Skylar Smith Harris, in 2015. On May 25, 2015, Yandy and Mendeecees were married live on VH1 as part of the special Love & Hip Hop Live: The Wedding.[17] While filming the show's sixth season, Mendeecees is sentenced to eight years in jail and turns himself in. Season seven chronicles Yandy's strained relationships with Mendeecees' baby mamas, Samantha and Erika, which explodes into an all-out war, as the women fight for custody for Mendeecees' eldest children, Lil Mendeecees and Aasim. During the season, Yandy admits that her televised wedding was \"symbolic\" and that her marriage to Mendeecees is not legal. Later seasons chronicle Yandy's struggles to repair her broken friendship with Kimbella, having had a falling out behind the scenes in season eight. Their feud intensifies in season nine, when Yandy begins the process of adopting a foster child, Infinity, and Kimbella questions her motivations for doing so, claiming it was all for \"clout\". In season ten, Yandy and Kimbella are once again at each other's throats, after Yandy's nemesis Chrissy returns to New York and reconciles with Kimbella. Later, she prepares for Mendeecees' upcoming release from federal prison. After Mendeecees' release in January 2020, the couple moved to Atlanta and joined the cast of Love & Hip Hop: Atlanta. Yandy also appears in VH1 Family Reunion: Love & Hip Hop Edition, as a guest star in the spin-off show Remy & Papoose: Meet the Mackies and in the specials 40 Greatest Love & Hip Hop Moments, Dirty Little Secrets, The Love Edition, Love & Hip Hop Awards: Most Certified and 40 Greatest Love & Hip Hop Moments: The Reboot.\n\nSeason 3 additions [ edit ]\n\nLove & Hip Hop: New York in season three. Erica Mena and Rashidah Ali join the main cast ofin season three.\n\nSeason 4 additions [ edit ]\n\nSeason 5 additions [ edit ]\n\nCyn Santana (Seasons 5, 9–10, supporting cast member in season 4), born Cynthia Pacheco , is an urban model, video vixen and aspiring singer. She was born in Washington Heights, Manhattan, to a Dominican father and Salvadorian mother. Cyn first appears in a supporting role in season four as Erica Mena's new girlfriend. The season chronicles their blossoming romance, her first relationship with a woman. Cyn is promoted to the main cast in season five, which chronicles her and Erica's dramatic and violent break up. During the season, she embarks on a music career, releasing the single \"How Can You Leave?\" with producer Cisco Rosado, in tribute to her late brother who committed suicide the year before. Later, she begins dating her longtime friend Ray Stacks, who she introduces at the season's reunion. After a four-year hiatus, Cyn returned as a main cast member in season nine with Joe Budden. Although they never interacted together previously on the show, the two began dating in 2016, and welcomed a son, Lexington, in December 2017. The season chronicles their relationship struggles, including her battle with postpartum depression. During the season, she reveals that she was molested by a female babysitter when she was five years old. [36] In the season finale, Joe proposes and the two become engaged. Cyn and Joe called off their engagement just months after the season's reunion special, allegedly due to Joe's infidelity. The tenth season chronicles Cyn's struggles to co-parent after the breakup, amid tensions with ex-girlfriend Erica when she starts playing matchmaker with Joe and his ex Tahiry.\n\n(Seasons 5, 9–10, supporting cast member in season 4), born , is an urban model, video vixen and aspiring singer. She was born in Washington Heights, Manhattan, to a Dominican father and Salvadorian mother. Cyn first appears in a supporting role in season four as Erica Mena's new girlfriend. The season chronicles their blossoming romance, her first relationship with a woman. Cyn is promoted to the main cast in season five, which chronicles her and Erica's dramatic and violent break up. During the season, she embarks on a music career, releasing the single \"How Can You Leave?\" with producer Cisco Rosado, in tribute to her late brother who committed suicide the year before. Later, she begins dating her longtime friend Ray Stacks, who she introduces at the season's reunion. After a four-year hiatus, Cyn returned as a main cast member in season nine with Joe Budden. Although they never interacted together previously on the show, the two began dating in 2016, and welcomed a son, Lexington, in December 2017. The season chronicles their relationship struggles, including her battle with postpartum depression. During the season, she reveals that she was molested by a female babysitter when she was five years old. In the season finale, Joe proposes and the two become engaged. Cyn and Joe called off their engagement just months after the season's reunion special, allegedly due to Joe's infidelity. The tenth season chronicles Cyn's struggles to co-parent after the breakup, amid tensions with ex-girlfriend Erica when she starts playing matchmaker with Joe and his ex Tahiry. Chrissy Monroe (Season 5), born Christina Crastanda, is an Italian-American socialite and model agent, originally from Baltimore, Maryland. She is a former sex worker and madam, who claims Erica Mena used to work as an escort for her.[37] Season five chronicles her relationship struggles with rapper Chink Santana and her desires to have a family. The couple eventually break up.\n\nSeason 6 additions [ edit ]\n\nSeason 7 additions [ edit ]\n\nSeason 8 additions [ edit ]\n\nSeason 9 additions [ edit ]\n\nSupporting cast members [ edit ]\n\nOriginal cast members [ edit ]\n\nSeason 2 additions [ edit ]\n\nTeairra Marí (top) joins the supporting cast in season two, she is replaced by Consequence (below) and other new cast members in season three.\n\nSeason 3 additions [ edit ]\n\nSeason 4 additions [ edit ]\n\nSaigon joins the supporting cast in season four.\n\nSeason 5 additions [ edit ]\n\nSeason 6 additions [ edit ]\n\nDJ Self joins the supporting cast in season six.\n\nDJ Self (Seasons 6–9, cameo appearance in season 2), born Terrence Walker , is a radio personality and DJ at Power 105.1. He was born in Brooklyn, New York, to Nigerian parents. He is the self-professed \"Prince of New York\" and the CEO of Gwinin Entertainment, whose roster includes fellow cast members Mariahlynn, Major Galore and DreamDoll. He has a daughter, Kayla, with Regina Gamboa, born 2000. Self appears briefly in the first episode of season two, introducing a performance by The Diplomats. He also appears uncredited in an episode of Chrissy & Mr. Jones , while filming a music video with Jim Jones. Self joins the supporting cast of Love & Hip Hop: New York in season six, which chronicles his relationship struggles with girlfriend Yorma Hernandez and his difficulties remaining faithful, after cheating on her with Cardi B and Rose. Seasons seven and eight chronicle the dramas between his artists at his record label, Gwinin, including the feuds between Mariahlynn and Major Galore, and Mariahlynn and DreamDoll. Self returns in one episode of season nine, which chronicles his online feud with Nicki Minaj. During the episode, he is confronted by Nya Lee for underestimating her and is not seen on the show again. He and his girlfriend at the time, Samantha Wallace, Mendeecees' baby mama and Yandy's rival, allegedly filmed several scenes together, including a fight between Samantha and Yandy, however the storyline was left on the cutting room floor. [118] [119] Self also appears in the specials Dirty Little Secrets and The Love Edition .\n\n(Seasons 6–9, cameo appearance in season 2), born , is a radio personality and DJ at Power 105.1. He was born in Brooklyn, New York, to Nigerian parents. He is the self-professed \"Prince of New York\" and the CEO of Gwinin Entertainment, whose roster includes fellow cast members Mariahlynn, Major Galore and DreamDoll. He has a daughter, Kayla, with Regina Gamboa, born 2000. Self appears briefly in the first episode of season two, introducing a performance by The Diplomats. He also appears uncredited in an episode of , while filming a music video with Jim Jones. Self joins the supporting cast of in season six, which chronicles his relationship struggles with girlfriend Yorma Hernandez and his difficulties remaining faithful, after cheating on her with Cardi B and Rose. Seasons seven and eight chronicle the dramas between his artists at his record label, Gwinin, including the feuds between Mariahlynn and Major Galore, and Mariahlynn and DreamDoll. Self returns in one episode of season nine, which chronicles his online feud with Nicki Minaj. During the episode, he is confronted by Nya Lee for underestimating her and is not seen on the show again. He and his girlfriend at the time, Samantha Wallace, Mendeecees' baby mama and Yandy's rival, allegedly filmed several scenes together, including a fight between Samantha and Yandy, however the storyline was left on the cutting room floor. Self also appears in the specials and . Yorma Hernandez (Season 6) is Self's girlfriend. She is an exotic dancer. She was born in The Bronx to Dominican parents and has a sister, Cimary. Season six chronicles her relationship struggles with Self, who she has been dating for a year. They break up later in the season, after she discovers that he has been cheating on her with Cardi B and Rose.\n\n(Season 6) is Self's girlfriend. She is an exotic dancer. She was born in The Bronx to Dominican parents and has a sister, Cimary. Season six chronicles her relationship struggles with Self, who she has been dating for a year. They break up later in the season, after she discovers that he has been cheating on her with Cardi B and Rose. Rose (Season 6) is a stylist and co-owner of the Beauty Bar Salon & Boutique in New York City.[120][121] She was born in The Bronx to Dominican parents and has a sister, Rosie. Rose appears in a minor supporting role in season six, where she is enjoys a casual fling with Self, sparking a feud with his girlfriend, Yorma.\n\nSeason 7 additions [ edit ]\n\nSeason 8 additions [ edit ]\n\nSeason 9 additions [ edit ]\n\nMaino joins the supporting cast in season nine, he is replaced by Phresher and others in season ten.\n\nSeason 10 additions [ edit ]\n\nPhresher (Season 10), born Kashaun Rameek Rutling , is a rapper. He grew up in the crime-ridden Bamaz Projects in East New York, Brooklyn, raised by Trinidadian parents. He first garnered attention through his collaborations with Remy Ma [146] and Cardi B. [147] He has two children with longtime girlfriend and high school sweetheart Jenn Coreano. In season ten, while embarking on a management career, he pursues Jennaske in hopes of signing her to his record label. This ignites a rivalry with Rich, putting a strain on his relationship with Jenn. Later, it is revealed that he cheated on Jenn with his former artist, Jada, who he allegedly also owes money to. [148] Phresher attracted controversy and criticism from viewers for a scene in which he pressures Jennaske to get plastic surgery, promising that getting her \"body done\" will help her rap career. [149] [150] [151]\n\n(Season 10), born , is a rapper. He grew up in the crime-ridden Bamaz Projects in East New York, Brooklyn, raised by Trinidadian parents. He first garnered attention through his collaborations with Remy Ma and Cardi B. He has two children with longtime girlfriend and high school sweetheart Jenn Coreano. In season ten, while embarking on a management career, he pursues Jennaske in hopes of signing her to his record label. This ignites a rivalry with Rich, putting a strain on his relationship with Jenn. Later, it is revealed that he cheated on Jenn with his former artist, Jada, who he allegedly also owes money to. Phresher attracted controversy and criticism from viewers for a scene in which he pressures Jennaske to get plastic surgery, promising that getting her \"body done\" will help her rap career. Jennaske (Season 10), born Rebecca Pierre-Antoine , is a rapper. She grew up in Cambria Heights, Queens, New York, to Arab-Haitian parents. She first garnered attention as a dancer and choreographer for rappers such as Desiigner, Maino and Remy Ma, and through her appearances in music videos, such as Kodak Black's \"Snot Thot\". [152] [153] Season ten chronicles her struggles to kickstart her rap career, while being pursued by both Rich and Phresher. During the season, she ignites a feud with Phresher's girlfriend Jenn. [154]\n\n(Season 10), born , is a rapper. She grew up in Cambria Heights, Queens, New York, to Arab-Haitian parents. She first garnered attention as a dancer and choreographer for rappers such as Desiigner, Maino and Remy Ma, and through her appearances in music videos, such as Kodak Black's \"Snot Thot\". Season ten chronicles her struggles to kickstart her rap career, while being pursued by both Rich and Phresher. During the season, she ignites a feud with Phresher's girlfriend Jenn. Jenn Coreano (Season 10), is Phresher's longtime girlfriend. The couple have two children together. Season ten chronicles her relationship struggles with Phresher, amid feuds with his artists Jennaske and Jada.[155][156]\n\nGuest stars [ edit ]\n\nSeveral members of the cast's inner circle appear as recurring guest stars. They include:\n\nThe show also features minor appearances from notable figures within the hip hop industry and New York's social scene, including K-Mack, DJ Vlad, Rage, Freekey Zekey, Funkmaster Flex, Jerry \"Wonda\" Duplessis, Angela Yee, Stephen Marley, Wyclef Jean, Nick Cannon, Black Ink Crew's Caesar and Dutchess, DJ Kay Slay, Uncle Murda, Charlie Murphy, Migos, Treach, French Montana, Maino, Ice-T, Coco Austin, Keyshia Cole, Sisterhood of Hip Hop's Nyemiah Supreme, John Depp, Method Man, Lil Durk, Noreaga, Konshens, Red Café, Michael K. Williams, Dr. Miami, Trina, Shotti, Danny García, Couple Therapy's Dr. Jenn Mann and Love & Hip Hop: Hollywood's Solo Lucci.\n\nRadio personality Angie Martinez hosted the first season reunion. Executive producer Mona Scott-Young hosted the second and third season's reunions. Comedian Mo'Nique hosted the fourth season reunion. Subsequent seasons are hosted by Nina Parker.", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/1/1e/Ana%C3%ADs_adjusted.jpg/150px-Ana%C3%ADs_adjusted.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/47/Navarro_Gray.jpg/200px-Navarro_Gray.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Consequence_by_David_Shankbone.jpg/200px-Consequence_by_David_Shankbone.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Maino_at_Howard%27s_Yardfest_cropped.jpg/200px-Maino_at_Howard%27s_Yardfest_cropped.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/RemyMaJul05.jpg/180px-RemyMaJul05.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/PhresherMay2018.jpg/200px-PhresherMay2018.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b5/SomayaReece24.jpg/150px-SomayaReece24.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/K._Michelle.png/200px-K._Michelle.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/9/93/Joe-Budden-2012.jpg/150px-Joe-Budden-2012.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Cardi_B_VMA_2018.jpg/180px-Cardi_B_VMA_2018.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/RahAli.jpg/180px-RahAli.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/00/Juju_Castaneda_at_MTV_VMAs_2018_%28cropped%29.png/150px-Juju_Castaneda_at_MTV_VMAs_2018_%28cropped%29.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Jim_Jones_at_the_5th_Annual_Hip-Hop_Summit_Action_Network%27s_Action_Awards.jpg/200px-Jim_Jones_at_the_5th_Annual_Hip-Hop_Summit_Action_Network%27s_Action_Awards.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/Tierra_Mari%2C_July_05.jpg/200px-Tierra_Mari%2C_July_05.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/DJ_SELF_Clap.jpg/200px-DJ_SELF_Clap.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/PapooseRapper_%28cropped%29.jpg/150px-PapooseRapper_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/LilMoOct05.jpg/150px-LilMoOct05.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/JuelzSantanHSJul05.jpg/150px-JuelzSantanHSJul05.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Saigon_Rapper.jpg/200px-Saigon_Rapper.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Erica_Mena_on_Pure_DOPE.jpg/180px-Erica_Mena_on_Pure_DOPE.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Olivia_by_David_Alvarado.jpg/150px-Olivia_by_David_Alvarado.jpg"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/List_of_Love_%26_Hip_Hop:_New_York_cast_members#Hennessy_Carolina", "title": "List of Love & Hip Hop: New York cast members", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "viewport": "width=1000", "og": {"title": "List of Love & Hip Hop: New York cast members - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}