{"url": "https://www.hollywoodreporter.com/news/trans-men-audition-old-scarlett-johansson-roles-parody-video-1126172", "text": "A group of trans men have produced a video response to the controversial casting of Scarlett Johansson as the lead in the upcoming film Rub & Tug.\n\nIn a video published Friday, performers D’Lo, Justin Chow, Scott Turner Schofield and Rocco Kayiatos (who goes by the stage name Katastrophe) try out for cisgender parts the actress has played across her career: Rebecca in 2001’s Ghost World, Samantha in 2013’s Her, Anna in 2009’s He’s Just Not That Into You and Natasha Romanoff/Black Widow in the Avengers films.\n\nJohansson sparked controversy in early July when it was announced that she would be playing the role of Jean Marie Gill, also known as Dante “Tex” Gill, a real-life massage parlor and prostitution business operator who was assigned female at birth but assumed the identity of a man later on in life, in Rupert Sanders’ upcoming film Rub & Tug. Though it’s unclear how they identified, Gill’s obituary stated that they preferred to be called “Mr. Gill” and speculated that they had undergone sex reassignment surgery.\n\nTrans actresses Trace Lysette (Transparent) and Jamie Clayton (Sense8, The Neon Demon) protested Johansson’s casting, arguing that trans actors have enough trouble getting work in Hollywood and should not be deprived of the opportunity to play a rare character of their identity.\n\nThe video, produced by the queer digital magazine INTO, parodies Johansson’s casting by envisioning a situation where a transgender man (Schofield) is offered one of Johansson’s roles but turns it down because “cis women are actually really marginalized in Hollywood, you know?”\n\nSchofield adds, “I know that there are people who have lived this experience and would bring a lot of authenticity to it, and I feel a little weird taking that from them. Thank you so much for the opportunity and no thanks.”\n\nIn a comment attributed to Johansson via her representative that was sent to the digital magazine Bustle in early July, she replied to her critics, “Tell them they can be directed to Jeffrey Tambor, Jared Leto, and Felicity Huffman’s reps for comment.” The Hollywood Reporter could not confirm the comment.\n\nWatch the video below.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/07/trans_men_audition_for_scarlett_johansson_roles_-_screengrab_-_h_2018.jpg?w=1296&h=730&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/uploads/2018/07/trans_men_audition_for_scarlett_johansson_roles_-_screengrab_-_h_2018.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/07/trans_men_audition_for_scarlett_johansson_roles_-_screengrab_-_h_2018.jpg?w=1024", "keywords": [], "authors": ["Katie Kilkenny"], "canonical_link": "https://www.hollywoodreporter.com/movies/movie-news/trans-men-audition-old-scarlett-johansson-roles-parody-video-1126172/", "title": "Trans Men Audition for Old Scarlett Johansson Roles in Parody Video", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "In a video published Friday, transgender men D'Lo, Justin Chow, Scott Turner Schofield and Rocco Kayiatos (who goes by the stage name Katastrophe) try out for cisgender parts Scarlett Johansson has played.", "news_keywords": "Scarlett Johansson", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Katie Kilkenny", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1126172, "title": "Trans Men Audition for Old Scarlett Johansson Roles in Parody Video", "published_at": "2018-07-10 17:11:29", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/07/trans_men_audition_for_scarlett_johansson_roles_-_screengrab_-_h_2018.jpg?w=1024", "comment_count": 0, "tags": "Scarlett Johansson", "topics": "Movies", "body": "A group of trans men have produced a video response to the controversial casting of Scarlett Johansson as the lead in the upcoming film Rub & Tug.\r\nIn a video published Friday, performers D'Lo, Justin Chow, Scott Turner Schofield and Rocco Kayiatos (who goes by the stage name Katastrophe) try out for cisgender parts the actress has played across her career: Rebecca in 2001's Ghost World, Samantha in 2013's Her, Anna in 2009's He's Just Not That Into You and Natasha Romanoff/Black Widow in the Avengers films.\r\nJohansson sparked controversy in early July when it was announced that she would be playing the role of Jean Marie Gill, also known as Dante \"Tex\" Gill, a real-life massage parlor and prostitution business operator who was assigned female at birth but assumed the identity of a man later on in life, in Rupert Sanders' upcoming film Rub & Tug. Though it's unclear how they identified, Gill's obituary stated that they preferred to be called \"Mr. Gill\" and speculated that they had undergone sex reassignment surgery. \r\nTrans actresses Trace Lysette (Transparent) and Jamie Clayton (Sense8, The Neon Demon) protested Johansson's casting, arguing that trans actors have enough trouble getting work in Hollywood and should not be deprived of the opportunity to play a rare character of their identity. \r\nThe video, produced by the queer digital magazine INTO, parodies Johansson's casting by envisioning a situation where a transgender man (Schofield) is offered one of Johansson's roles but turns it down because \"cis women are actually really marginalized in Hollywood, you know?\"\r\nSchofield adds, \"I know that there are people who have lived this experience and would bring a lot of authenticity to it, and I feel a little weird taking that from them. Thank you so much for the opportunity and no thanks.\"\r\nIn a comment attributed to Johansson via her representative that was sent to the digital magazine Bustle in early July, she replied to her critics, \"Tell them they can be directed to Jeffrey Tambor, Jared Leto, and Felicity Huffman’s reps for comment.” The Hollywood Reporter could not confirm the comment. \r\nWatch the video below.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Trans Men Audition for Old Scarlett Johansson Roles in Parody Video", "url": "https://www.hollywoodreporter.com/movies/movie-news/trans-men-audition-old-scarlett-johansson-roles-parody-video-1126172/", "description": "In a video published Friday, transgender men D’Lo, Justin Chow, Scott Turner Schofield and Rocco Kayiatos (who goes by the stage name Katastrophe) try out for cisgender parts Scarlett Johanss…", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/07/trans_men_audition_for_scarlett_johansson_roles_-_screengrab_-_h_2018.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2018-07-10T17:11:29+00:00", "modified_time": "2018-07-10T17:11:27+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Trans Men Audition for Old Scarlett Johansson Roles in Parody Video", "description": "In a video published Friday, transgender men D’Lo, Justin Chow, Scott Turner Schofield and Rocco Kayiatos (who goes by the stage name Katastrophe) try out for cisgender parts Scarlett Johanss…", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/07/trans_men_audition_for_scarlett_johansson_roles_-_screengrab_-_h_2018.jpg?w=1296"}}, "movies": ["https://www.youtube.com/embed/tLL9Zy1oqro"], "publish_date": 1531242689.0, "source": "https://www.hollywoodreporter.com", "summary": ""}