{"url": "http://theconversation.com/the-art-of-the-public-apology-90425", "text": "Just prior to his sentencing, former USA Gymnastics physician Larry Nassar formally apologized to the more than 160 women whom he’d sexually abused. He joins a growing list. Over the past few months, many public personalities accused of sexual assault have apologized in public.\n\nMany of us at this point are wondering what these apologies mean. Indeed, like others before him, Nassar said, that an adequate apology was impossible. He stated,\n\n“There are no words that can describe the depth and breadth of how sorry I am for what has occurred. An acceptable apology to all of you is impossible to write and convey.”\n\nWhat, then, is it that he and other public figures are doing when they say sorry publicly?\n\nIn a forthcoming book, I look at different kinds of public apologies, including the kind of celebrity apologies we’ve witnessed in the past few months. What I argue is that public apologies are a type of performance and therefore should be understood as being different from private.\n\nWhat is a public apology?\n\nTelevised public celebrity apologies, watched by millions, are a relatively recent phenomenon.\n\nIn his 1952 “Checkers speech,” televised live to an American public, Richard Nixon, then Republican candidate for vice president of the United States, defended himself against charges of financial impropriety. Nixon did not explicitly apologize, but as journalist Caryn James noted, the speech began by “sounding apologetic.”\n\nAP Photo\n\nIn 1998, in a televised address to the American public, Bill Clinton apologized for his affair with White House intern Monica Lewinsky. Clinton expressed regret but denied responsibility. The apology failed. In a CNN poll taken immediately after, 60 percent of those polled said that Clinton should have explicitly used the words “I’m sorry.”\n\nLess than a month later, at the White House prayer breakfast, Clinton revised the apology. This time Clinton used the language Americans wanted – “I am sorry” – and the biblical terms with which they were familiar – “I have sinned.”\n\nScholar of public apologies Edwin Battistella noted in his book “Sorry About That” how this was a successful apology. Indeed, this time more people believed they were witnessing sincerity.\n\nAP Photo/J. Scott Applewhite\n\nAnd that is the point of a public apology. It can provide public personalities an opportunity to regain public approval.\n\nThe purpose of a public apology\n\nI would argue that these celebrity apologies are not much different from those offered over criminal violations in court. They are all driven by an ulterior motive.\n\nTake, for example, the case of corporations. As philosopher Nick Smith discusses in his book “Justice Through Apologies,” they do so to limit their legal liability. Similarly, philosopher Jeffrie Murphy explains what it means for someone to apologize to the court when a reduction in their sentences is at stake. Nassar’s apology, offered just prior to his sentencing, was a combination of celebrity and court apology.\n\nApologies, in other words, try to control the damage.\n\nIn today’s consumerist society, the public is God. And so the celebrities apologize to us – the public – in a way that people earlier used to appeal to their God. In 1697, for instance, Judge Samuel Sewall went to South Church in Boston to apologize for his role in the Salem witch trials, in which 20 innocent people were executed in a fit of mass hysteria. He asked his fellow congregants for their “pardon,” but his appeal was primarily that “God, who has an unlimited authority, would pardon” that sin, and all his other ones.\n\nThe public apology today is an act of publicity. Many of the public personalities are appealing to their audience not to boycott their product, which, in other words, is the celebrity.\n\nPrivate vs. public\n\nPrivate apologies are different.\n\nMore often than not, we can assess when someone is sincere by witnessing what she or he does after apologizing. We can see if those who apologize to us have indeed reformed their behavior. We are not in a position to see that in the case of celebrity apologies.\n\nA private apology is generally not a performance. Our friends and lovers apologize to us in private to an audience of one, or few. And they are generally not professional performers. Celebrities and other public personalities are apologizing to an audience of millions.\n\nPrivate apologies are heard, while public apologies are meant to be overheard.\n\nWhy an apology matters\n\nNonetheless, apologies matter in public life, just as they do in private. The important thing about all forms of apologies is that they reveal and alert us to the limits of what is acceptable.\n\nIn our personal lives, a person who repeatedly apologizes for the same act or for acts of the same type is revealing the deeper problem behind that behavior (anger, for instance, or disrespect). The victim forgives, if she does, on the understanding that the behavior is unacceptable.\n\nThis recent wave of public apologies reveal the outrage against crimes against women and that support from powerful institutions for that behavior is no longer acceptable.\n\nFinally, apologies alert us to their own limits. In our private lives, we recognize that the words “I am sorry” are meaningless without a change in behavior.", "images": ["data:image/gif;base64,R0lGODlhAQABAAD/ACwAAAAAAQABAAACADs%3D", "https://cdn.theconversation.com/static/tc/author/width170_default-bea415b3a0223821a698f6e3f6d5ab99.jpg", "https://images.theconversation.com/files/203862/original/file-20180129-89590-874dbx.jpg?ixlib=rb-1.1.0&q=45&auto=format&w=1356&h=668&fit=crop", "https://cdn.theconversation.com/static/tc/@theconversation/ui/dist/esm/logos/logo-en-b159aca2598f351db37072c75294e4c8.svg", "https://images.theconversation.com/files/203862/original/file-20180129-89590-874dbx.jpg?ixlib=rb-1.1.0&q=20&auto=format&w=320&fit=clip&dpr=2&usm=12&cs=strip"], "top_img": "https://images.theconversation.com/files/203862/original/file-20180129-89590-874dbx.jpg?ixlib=rb-1.1.0&q=45&auto=format&w=1356&h=668&fit=crop", "keywords": [], "authors": ["Ashraf Rushdy"], "canonical_link": "https://theconversation.com/the-art-of-the-public-apology-90425", "title": "The art of the public apology", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#d8352a", "msapplication-navbutton-color": "#d8352a", "fb": {"app_id": 127105130696839, "pages": 1453112561595308}, "current-region": "uk", "description": "Public apologies are a type of performance before a larger audience, and they are to be understood in terms that are different from a private apology.", "pubdate": 20180130, "commissioning-region": "us", "searchtype": "analysis", "original-source": "https://theconversation.com/the-art-of-the-public-apology-90425", "news_keywords": "Apology, Bill Clinton, Charlie Rose, Harvey Weinstein, Larry Nassar, Monica Lewinsky, Public apology, Richard Nixon, Roy Moore, Sexual assault, Violence against women", "author": "Ashraf Rushdy", "institution": "Wesleyan University", "og": {"site_name": "The Conversation", "title": "The art of the public apology", "description": "Public apologies are a type of performance before a larger audience, and they are to be understood in terms that are different from a private apology.", "type": "article", "image": "https://images.theconversation.com/files/203862/original/file-20180129-89590-874dbx.jpg?ixlib=rb-1.1.0&q=45&auto=format&w=1356&h=668&fit=crop", "updated_time": "2022-09-13T07:03:50Z", "url": "http://theconversation.com/the-art-of-the-public-apology-90425"}, "article": {"publisher": "https://facebook.com/theConversationUS"}, "twitter": {"card": "summary_large_image", "site": "@ConversationUS"}}, "movies": [], "publish_date": 1517312085.0, "source": "http://theconversation.com", "summary": ""}