{"url": "https://www.usatoday.com/story/life/tv/2018/05/07/pauley-perrette-exit-cbs-ncis-abby/576023002/", "text": "Pauley Perrette says fans will need 'a couple boxes of tissues' for Abby's 'NCIS' exit\n\nShow Caption Hide Caption Perrette leaving 'NCIS' will mean 'a ton of tears' Actor Brian Dietzen weighs in on the impending departure of his \"NCIS\" co-star, popular actress Pauley Perrette. (Nov. 7) AP\n\nNCIS fans will have to wait until Tuesday night to learn whether Abby Sciuto lives or dies, but the truth is the forensics genius will be gone either way: The episode marks a goodbye for Pauley Perrette, who's played the beloved forensics whiz for the show's entire 15-year run.\n\nPerrette won't spoil the character's fate: Abby was seen hospitalized, and in imminent peril, after being shot in a street holdup last week. But she advises viewers how to prepare for the character’s final appearance in CBS' top-rated drama (8 ET/PT) after more than 350 episodes.\n\nMore: Pauley Perrette plans her exit from 'NCIS' after 15 seasons\n\n“Everyone, whether you think you’re a crier or not, needs a couple of boxes of tissues,” Perrette says. “I know the fans are going to be on the edge of their seats wondering what happens. It’s a heavy episode. I gave it all I had emotionally, but I really wanted to give respect to the fans and to Abby and her legacy.”\n\nMore: Discover the common thread connecting Pauley Perrette's favorite 'NCIS' episodes\n\nTears of sadness are expected for the departure of the NCIS lab virtuoso, known for her jet-black hair, neck tattoo and a singular fashion sense often described as Goth. (But not by her: “Abby would never label herself.”) But they'll also come from happy memories, as the episode features “a boatload — no pun intended — of flashbacks from the entire history of Abby,\" Perrette says.\n\nViewers also get their first peek at Abby’s apartment — “We just might see the coffin” she sleeps in, Perrette says — that also shows off her memorable and stylish wardrobe, including the outfit Abby wore to go bowling with nuns.\n\nMore: Weinstein scandal: More accusers in U.K.; 'NCIS' star Pauley Perrette writes about victims\n\nAnd, Perrette teases, “There's a notorious stranger from Abby’s past … that the fans will remember.”\n\nAbby is one of four characters dating back to the show's origins as a spin-off of another military-oriented drama, JAG, which aired on NBC and CBS. Only Mark Harmon (who plays team leader Leroy Jethro Gibbs) and David McCallum (medical examiner Donald \"Ducky\" Mallard) remain, after Michael Weatherly left two years ago to star in CBS drama Bull.\n\nPerrette, 49, hasn’t said why she’s leaving — “That’s for me to know” — but she was determined to warn fans well in advance. She announced her departure last October, about a year after she made the decision.\n\nMore: Weatherly is ready to turn in a very special 'NCIS' badge\n\n“Abby is more than a TV character to millions of people around the world, and especially to young women. She’s a role model. They dress like her, walk like her, talk like her\" and some have pursued math and science careers because of her, Perrette says. \"I just did not want to play games and pull the rug out from underneath anyone. It’s a real thing how upset people are, so I wanted to give the fans a more-than-ample amount of time to prepare.”\n\nAbby has stood out as a TV character from the beginning, as she was designed by NCIS creator Donald Bellisario to defy convention.\n\n“Don said he thought alternative and artistic kids were only being portrayed in the media as junkies, thieves and criminals, and he wanted to turn that on its head and show (one) who is brilliant, responsible and capable and goes to church. It really worked,” Perrette says. “I think, after all these years, an older generation might look at someone with tattoos and instead of thinking they’re a thug, they maybe think they’re a scientist.”\n\nThere’s been “a grieving process, an acceptance process” but no second-guessing by the actress, who doesn’t have a new project lined up but plans to stay busy volunteering for such causes as animal rescue, LGBT rights, civil rights and AIDS research.\n\nAnd Perrette, who studied criminology at Georgia's Valdosta State University, has set up endowments at her alma mater and New York’s John Jay College of Criminal Science to provide scholarships in forensic science.\n\n“I’d like to think I would have been good at it,\" she says of her would-be career. \"But this way, instead of being one person doing one job, I’ve gotten to play a character that has inspired millions.”", "images": ["http://www.gannett-cdn.com/-mm-/04b4c4ef73f5f775b0fea1a3171862458651b2ae/c=0-0-4610-2604&r=1280x720/local/-/media/2017/10/13/USATODAY/USATODAY/636434901813027813-3BD-Pauley-Perrette.jpg", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://www.gannett-cdn.com/-mm-/a4c7ceb9a2c66351a7f9560027969f96ab24594e/c=0-159-1992-1285/local/-/media/2018/05/08/USATODAY/USATODAY/636613879136194897-112495-0299b.jpg?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/a4c7ceb9a2c66351a7f9560027969f96ab24594e/c=0-159-1992-1285/local/-/media/2018/05/08/USATODAY/USATODAY/636613879136194897-112495-0299b.jpg?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Bill Keveney"], "canonical_link": "https://www.usatoday.com/story/life/tv/2018/05/07/pauley-perrette-exit-cbs-ncis-abby/576023002/", "title": "Pauley Perrette says fans will need 'a couple boxes of tissues' for Abby's 'NCIS' exit", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/tv/2018/05/07/pauley-perrette-exit-cbs-ncis-abby/576023002/life/tv", "theme-color": "#ffffff", "og": {"type": "article", "title": "Pauley Perrette says fans will need 'a couple boxes of tissues' for Abby's 'NCIS' exit", "description": "Pauley Perrette will finish her 15-season run on CBS drama 'NCIS' May 8. The forensics specialist is known for her brilliance, caring personality and singular fashion sense.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/a4c7ceb9a2c66351a7f9560027969f96ab24594e/c=0-159-1992-1285/local/-/media/2018/05/08/USATODAY/USATODAY/636613879136194897-112495-0299b.jpg?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "Pauley Perrette will finish her 15-season run on CBS drama 'NCIS' May 8. The forensics specialist is known for her brilliance, caring personality and singular fashion sense.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1525647600.0, "source": "https://www.usatoday.com", "summary": ""}