{"url": "https://www.usatoday.com/story/life/entertainthis/2017/07/05/lady-gaga-sticks-up-ed-sheeran-over-cyberbullying/103433268/", "text": "Lady Gaga sticks up for Ed Sheeran over cyberbullying\n\nTwitter can be an unfriendly place for many celebrities, especially when trolls' negative voices overwhelm positive feedback from their fans.\n\nLady Gaga is defending Ed Sheeran after he admitted to nearly quitting Twitter because of all the hate. In an Instagram post Tuesday, Gaga called Sheeran an \"incredible talented artist\" and implored people to treat him with \"love and respect.\"\n\n\"I wish all people on the internet would be positive and loving and apart of creating an online community that is kind and empowering, not hateful and mean,\" she wrote. \"No reason to tear down an artist simply because they are on top. Work harder to be kinder everybody. That should be your first duty to humanity.\"\n\nWhat an incredible talented artist I LOVE ED @teddysphotos deserves all our love and respect like all humans do. I wish all people on the internet would be positive and loving and apart of creating an online community that is kind and empowering, not hateful and mean. No reason to tear down an artist simply because they are on top. Work harder to be kinder everybody. That should be your first duty to humanity. A post shared by xoxo, Gaga (@ladygaga) on Jul 4, 2017 at 12:15pm PDT\n\nGaga's post comes after Sheeran told The Sun earlier this week that Twitter trolls prevent him from enjoying the site. As his fans know, Instagram is his social media platform of choice, and the majority of his tweets appear to be auto-generated posts linking to his Instagram account.\n\n“I’ve actually come off Twitter completely,\" he said. \"I can’t read it. I go on it and there’s nothing but people saying mean things. Twitter’s a platform for that. One comment ruins your day. But that’s why I’ve come off it. The head-(expletive) for me has been trying to work out why people dislike me so much.”\n\nAs E! News points out, Lady Gaga fans have been particularly unkind to Sheeran on social media, after Sheeran appeared to negatively mention Gaga during a Beats Radio 1 interview with Zane Lowe earlier this year.\n\n\n\n\"I do not want to be the kind of artist who has had two successful albums and then feels invincible...You've seen them become the biggest artists in the world, and then suddenly they will say, 'I know everything!' And just after, they are no longer at the top,\" he said. \"The smartest thing to do is listen to people who know I do not want to do the Super Bowl years later, after my biggest success, just to prove I'm still relevant.\"\n\n\n\nWhether Sheeran's \"Super Bowl\" comment was alluding to Lady Gaga or not, the two stars are now presenting a united front against cyberbullying.", "images": ["https://www.gannett-cdn.com/-mm-/8b24c7f1fec246ad8da60efea6dd7942e8706d0c/c=0-6-800-608/local/-/media/2017/07/05/USATODAY/USATODAY/636348386080991767-jlaw-bella-sq-1-.png?width=320&height=240", "https://www.gannett-cdn.com/-mm-/95840d125dd7fc92c158c776282c44c060b95195/c=0-29-800-481/local/-/media/2017/07/05/USATODAY/USATODAY/636348386080991767-jlaw-bella-sq-1-.png?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/95840d125dd7fc92c158c776282c44c060b95195/c=0-29-800-481/local/-/media/2017/07/05/USATODAY/USATODAY/636348386080991767-jlaw-bella-sq-1-.png?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": ["Maeve Mcdermott"], "canonical_link": "https://www.usatoday.com/story/life/entertainthis/2017/07/05/lady-gaga-sticks-up-ed-sheeran-over-cyberbullying/103433268/", "title": "Lady Gaga sticks up for Ed Sheeran over cyberbullying", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/entertainthis/2017/07/05/lady-gaga-sticks-up-ed-sheeran-over-cyberbullying/103433268/life/entertainthis", "theme-color": "#ffffff", "og": {"type": "article", "title": "Lady Gaga sticks up for Ed Sheeran over cyberbullying", "description": "Sheeran 'can't read' social media because there are too many trolls, he revealed.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/95840d125dd7fc92c158c776282c44c060b95195/c=0-29-800-481/local/-/media/2017/07/05/USATODAY/USATODAY/636348386080991767-jlaw-bella-sq-1-.png?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "news_keywords": "Social media,Lady Gaga,Radio,Bullying,Ed Sheeran", "description": "Sheeran 'can't read' social media because there are too many trolls, he revealed.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1499209200.0, "source": "https://www.usatoday.com", "summary": ""}