{"url": "https://www.romper.com/p/this-timeline-of-khloe-kardashians-pregnancy-shows-its-really-been-a-wild-ride-8084242", "text": "Now that Khloé Kardashian has gone public with her pregnancy news, it's so much fun to watch her on social media and tear paparazzi apart for following her around the airport when she feels like dirt. But remember, there was a long, dark time when us fans weren't really sure whether she was expecting a baby with boyfriend Tristan Thompson or not. Now that we know a baby is really, truly on the way, let's all take a walk down memory lane with a timeline of Khloé Kardashian's pregnancy. Because we'll never not get sick of her and this exciting journey.\n\nFans of Khloé in particular were very, very excited about the pregnancy rumors when they surfaced because they knew that she had been thinking about a having a baby for some time. On Keeping Up With The Kardashians, she not only fussed over all of her baby nieces and nephews but talked openly about wanting to be a mom one day.\n\nIt goes all the way back to her whirlwind marriage to Lamar Odom and their subsequent divorce. Remember when her sisters used to bug her about when the couple was going to have kids way before they, or the world, knew that Odom was struggling with substance abuse issues, according to E! News, and Khloé was trying to salvage their marriage.\n\nAll I'm saying is that this baby has been a long time coming and as a reluctant KUWTK fan myself, I'm secretly really excited for her. So in anticipation of the big day, here's a little timeline of some major Khloé pregnancy moments.\n\nJune: She Announces That She's Ready\n\nReally, this whole thing started back in June when, on the finale of KUWTK, Khloé goes to a fertility clinic with her sister. When the doctor hints that she might have some trouble getting pregnant, she officially goes off birth control to get her follicle count back up.\n\nShe said in her one-on-one regarding her relationship with Tristan, \"He wants to have like five or six kids with me. … Knowing I’m not on birth control, it’s scary. It’s like a really big step.” She concluded saying, “I am really excited about my future. Me and Tristan, we’re doing so well.”\n\nSeptember: The Rumors Start\n\nIn late September, only days after rumors broke that her sister Kylie was pregnant, Us Weekly reported that multiple sources said the 31-year-old star was pregnant. But the family stayed quiet.\n\nOctober: She & Her Sister Troll Us All\n\nWhile her family refused to comment on the rumors at all, fans scoured every gigabyte of social media for clues. Then, a video was released by Kylie Cosmetics featuring both sisters. Sure, it was an ad for the lip kits, but they also joked about \"having so many babies.\" The suspense was real.\n\nThen, The Couple Appears For Halloween\n\nBy Halloween, some people were planning on a pregnancy reveal for sure. Alas, it didn't happen. Instead, the couple posted tons of pictures of them dressed up as Game of Thrones characters — and nary a pregnancy bump to be found.\n\nNovember: Her Sister Drinks Sardines\n\nRemember how hyped up we all were for pregnancy news that Kim Kardashian actually drank a sardine smoothie just to not have to talk about her sister's uterus? We were wild, people. I'm sort of embarrassed for us. This was Nov. 15, and Khloé and Tristan ended up spending their Turkey Day in Cleveland, away from her family. And rumors abounded.\n\nDecember: That Darn Christmas Card\n\nFor all of December the KarJenner fam had us refreshing our feeds for a pregnancy reveal in their gorgeous Christmas photo shoot. When Khloé did finally show up, in every shot she seemed to have baby Dream on her hip or lap or just didn't *seem* pregnant. And even though I scolded you, dear readers, to make assumptions about her body...I have to admit I was confused, too.\n\nDec. 20: The Big Reveal\n\nJust when we were despairing that neither Khloé or Kylie was pregnant, the older sister stepped in and confirmed it all for us with a gorgeous Calvin Klein-inspired show of her bump. And it was a very merry holiday for everyone, as she went on to share her first bump pics.\n\nJanuary: Her 6 Month Mark\n\nJust after spending New Year's Eve with Tristan, she shared a selfie on Jan. 2 announcing that she was officially six months pregnant, which means she'll likely give births sometime this spring, possibly late March or early April.\n\nAnd really, that baby can't come soon enough. Hopefully she won't make us wait too long for that announcement, too.\n\nCheck out Romper's new video series, Romper's Doula Diaries:\n\nWatch full episodes of Romper's Doula Diaries on Facebook Watch.", "images": ["https://cdn2.bustle.com/2022/romper/logo-3079c0c267.svg", "https://imgix.bustle.com/uploads/getty/2022/9/23/130dc693-df06-41fb-9353-9fcb58a340d1-getty-1389467509.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/10/7/5e26fef4-dfb7-48d8-b2ab-a6537a2e56f2-dfccd437-1ec5-4cf5-bf07-47c17429558e-winifred-hp.jpeg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2022/10/6/45becc4f-e4f9-41f8-bd18-99ed91fc7c4a-getty-456887240.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2018/2/1/c4949f6b-9149-4635-86cf-d3f32f835b58-getty-470897864.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2022/10/6/6c7441ac-6254-498b-bc14-3405863ce3d7-getty-1241120058.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2018/2/1/c4949f6b-9149-4635-86cf-d3f32f835b58-getty-470897864.jpg?w=540&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1"], "top_img": "https://imgix.bustle.com/uploads/getty/2018/2/1/c4949f6b-9149-4635-86cf-d3f32f835b58-getty-470897864.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.romper.com/p/this-timeline-of-khloe-kardashians-pregnancy-shows-its-really-been-a-wild-ride-8084242", "title": "Khloé Kardashian's Pregnancy: A Timeline Of Her Exciting Journey Thus Far", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@romper", "card": "summary_large_image", "creator": "@karenfratti"}, "article": {"publisher": "https://www.facebook.com/romperdotcom"}, "og": {"site_name": "Romper", "url": "https://www.romper.com/p/this-timeline-of-khloe-kardashians-pregnancy-shows-its-really-been-a-wild-ride-8084242", "type": "article", "title": "Khloé Kardashian's Pregnancy: A Timeline Of Her Exciting Journey Thus Far", "description": "Now that Khloé Kardashian has gone public with her pregnancy news, it's so much fun to watch her on social media and tear paparazzi apart for following her around the airport when she feels like dirt. But remember, there was a long, dark time when…", "image": {"identifier": "https://imgix.bustle.com/uploads/getty/2018/2/1/c4949f6b-9149-4635-86cf-d3f32f835b58-getty-470897864.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "Now that Khloé Kardashian has gone public with her pregnancy news, it's so much fun to watch her on social media and tear paparazzi apart for following her around the airport when she feels like dirt. But remember, there was a long, dark time when…"}, "movies": ["https://www.youtube.com/embed/_woKzW1AZ08", "https://www.youtube.com/embed/m3PM9Q_Sd-s", "https://www.youtube.com/embed/p8XP7A7kvzM", "https://www.youtube.com/embed/skJB3MPGzkA"], "publish_date": null, "source": "https://www.romper.com", "summary": ""}