{"url": "https://en.wikipedia.org/wiki/John_Mahoney", "text": "For other people named John Mahoney, see John Mahoney (disambiguation)\n\nAmerican actor (1940–2018)\n\nCharles John Mahoney (June 20, 1940 – February 4, 2018) was an English-born American actor. He was known for playing Martin Crane on the NBC sitcom Frasier (1993–2004), and won a Screen Actors Guild Award for the role in 2000. Mahoney started his career in Chicago as a member of the Steppenwolf Theatre Company alongside John Malkovich, Gary Sinise, and Laurie Metcalf. He received the Clarence Derwent Award as Most Promising Male Newcomer in 1986. Later that year, his performance in the Broadway revival of John Guare's The House of Blue Leaves earned him a Tony Award for Best Featured Actor in a Play.\n\nMahoney first became known for his roles in such films as John Patrick Shanley's romantic comedy Moonstruck (1987), Barry Levinson's comedy Tin Men, John Sayles' sports drama Eight Men Out (1988), Cameron Crowe's romantic drama Say Anything... (1989), the Coen brothers' Barton Fink (1991), and The Hudsucker Proxy (1994), Clint Eastwood's In the Line of Fire (1993), and Rob Reiner's political romance The American President (1995). He additionally had voice roles in Antz (1998), The Iron Giant (1999), Atlantis: The Lost Empire (2001), and Kronk's New Groove (2005). In television, Mahoney also made appearances on Cheers, 3rd Rock from the Sun, ER, In Treatment, Hot in Cleveland, and Foyle's War.\n\nEarly life [ edit ]\n\nCharles John Mahoney was born in Blackpool, England on June 20, 1940,[1] the seventh of eight children. His father, Reg, was a baker[2] who played classical piano, and his mother, Margaret (née Watson), was a housewife who loved reading. His paternal grandfather was Irish.[3][4][5] The family had been evacuated to Blackpool from their home city of Manchester when it was heavily bombed during the Second World War. Mahoney started school at St Joseph's College. After the war, the family moved back to Manchester, where Mahoney grew up in the suburb of Withington and discovered acting at the Stretford Children's Theatre. His parents' marriage was not happy. They would not speak to each other for long periods of time—and when they did, it often led to heated arguments. The family situation, combined with the war, fueled Mahoney's interest in acting and he vowed to leave Manchester.[6][7]\n\nMahoney moved to the United States aged 18 in March 1959,[8] when his older sister Vera (a war bride living in rural Illinois) agreed to sponsor him. He studied at Quincy University before joining the United States Army. After graduating from Quincy, he lived in Macomb, Illinois, and earned his Master's degree in English[9] from Western Illinois University, where he went on to teach English in the late 1960s[10] before settling in Forest Park, Illinois, and later in Oak Park, Illinois. He became a U.S. citizen in 1971[11] and served as editor of a medical journal through much of the 1970s.[10]\n\nMahoney made a concerted effort to lose his English accent after joining the U.S. Army, later stating that he felt that he did not want to \"stand out\" in his new adopted country. He spoke with an American accent for the rest of his life.[12][13]\n\nCareer [ edit ]\n\nEarly work [ edit ]\n\nDissatisfied with his career, Mahoney took acting classes at St. Nicholas Theatre, which inspired him to resign from his day job and pursue acting full-time. After a stage production in Chicago in 1977, John Malkovich encouraged him to join the Steppenwolf Theatre.[14][15] He did so and went on to win the Clarence Derwent Award as Most Promising Male Newcomer in 1986. Gary Sinise said in an interview for Bomb Magazine that Lyle Kessler's play Orphans in 1985 \"kicked John Mahoney, Kevin Anderson and Terry Kinney off into the movie business\"[16] after their Steppenwolf performance of the play for which he won the Derwent Award and the Theatre World Award.[17] Mahoney won Broadway's Tony Award for Best Featured Actor in a Play in 1986 for his performance in John Guare's The House of Blue Leaves.[18]\n\nMahoney's first major film roles both came in 1987, in Barry Levinson's Tin Men and in Peter Yates' Suspect, a courtroom drama/mystery starring Cher, Dennis Quaid, and Liam Neeson. In the next decade, he had prominent roles in many acclaimed films including Moonstruck, Eight Men Out, Say Anything..., In the Line of Fire, Reality Bites, and The American President,[18][19][10] as well as two Coen brothers films, Barton Fink[20] and The Hudsucker Proxy.[21]\n\nMahoney also played a pivotal gay role in Greg Berlanti's 2000 GLAAD Award–winning film The Broken Hearts Club: A Romantic Comedy.\n\nFrasier [ edit ]\n\nMahoney appeared in Frasier from its debut in 1993 until the final episode in 2004; Mahoney received two Emmy nominations and two Golden Globe nominations for the role of Martin Crane, the father of Frasier Crane and Niles Crane. NBC executives held Mahoney in such high esteem that Warren Littlefield declared he was pre-approved when the Frasier creative team suggested casting him as the father.[22] Before appearing on the series, Mahoney had appeared in the episode \"Do Not Forsake Me, O' My Postman\" of Cheers – from which Frasier was a spinoff – as Sy Flembeck, an inept jingle writer who has a brief conversation with Frasier. Mahoney also appeared as a priest in Becker, which starred Cheers star Ted Danson.\n\nVoice acting [ edit ]\n\nMahoney voice acting in 2007\n\nMahoney's first voice job was in W. B. Yeats's \"The Words upon the Window-Pane\" for the award-winning National Radio Theater of Chicago. He provided the voices for several characters in Antz (1998), Preston Whitmore in Atlantis: The Lost Empire and Atlantis: Milo's Return, General Rogard in The Iron Giant (1999), and Papi in Kronk's New Groove (but was succeeded by Jeff Bennett in The Emperor's New School for an unknown reason). In 2007, Mahoney provided the voice of Dr. Robert Terwilliger, Sr. (Sideshow Bob's father) in The Simpsons episode \"Funeral for a Fiend.\" This reunited him with his Frasier co-stars Kelsey Grammer (Sideshow Bob) and David Hyde Pierce (Cecil, Sideshow Bob's brother).\n\nPost-Frasier [ edit ]\n\nMahoney co-starred as the Old Man in the Broadway revival of Prelude to a Kiss at the American Airlines Theater in a limited-run engagement running from previews on February 17, 2007, through to April 29, 2007.[23][24] He appeared as an elderly drag queen in the ER season 13 episode \"Somebody to Love,\" and co-starred with Steve Carell (himself a veteran of Chicago theater) as the father of Carell's character in Dan in Real Life. In March 2008, he opened in the world premiere of Better Late at the Northlight Theatre.[25] He was also the narrator for Midwest Airlines commercials. Mahoney also made two appearances on USA's Burn Notice in the second (2009) and third (2010) season finales. His character, referred to only as \"Management,\" is a senior intelligence agency official who is the apparent main mover of the conspiracy which blacklisted Michael Westen.[26][27]\n\nMahoney joined the cast of In Treatment for the series' second season (2009) as a frenetic CEO who is overwhelmed by his personal and professional responsibilities and experiences chronic physical anxiety attacks. In 2010, he made a guest appearance on $#*! My Dad Says as homophobic retired naval officer Lt. Commander Wally Durham.\n\nBeginning in April 2011, Mahoney began rehearsing The Outgoing Tide, a new play by Bruce Graham at Northlight Theatre in Skokie, Illinois (suburban Chicago). The play also stars fellow Chicago actors Rondi Reed and Thom Cox. In 2011, he had two guest appearances on Hot in Cleveland as Roy, a waiter and a love interest for Betty White's character Elka.[28] This reunited him with his Frasier co-star Jane Leeves, as well as Wendie Malick whose character he eventually married in Frasier and his co-star in the movie The American President. Mahoney was a featured ensemble cast member in The Birthday Party, playing in Chicago's Steppenwolf Theatre from January 24 to April 28, 2013.[29] Mahoney portrayed his last role in the play The Rembrandt, from September to November 2017.[30][31]\n\nDespite the numerous successes throughout his career, Mahoney has maintained that his early work in Lyle Kessler's play Orphans has \"affected people more than any other play I've ever done. I still get mail from it, I still get people stopping me on the street, and it's 20 years later.\"[32]\n\nPersonal life [ edit ]\n\nMahoney lived in Oak Park, Illinois,[7] and suffered from colon cancer in the mid-1980s.[33] He was successfully treated for cancer again in 2014, and credited his love of acting and desire to continue it for giving him enough determination to survive both bouts, saying in October 2017: \"I refused to yield to it because I love what I'm doing so much.\"[34]\n\nMahoney rarely spoke publicly about his private life,[6] and he died without marrying or having any children.[35] In 2002, he said, \"I was never very mature in my relationships with women. First sign of conflict, I was gone. Wouldn't discuss it, because I was afraid it would lead to an argument.\" This stemmed from a fear of having an unhappy marriage like the one his parents had, though Mahoney did previously have \"several long-term relationships\".[7]\n\nHe was a Catholic who called Christianity \"probably the most important facet of my life\" and prayed \"Most glorious blessed spirit, I thank you for all the gifts and talents that you've given me. Please help me to use all these gifts and talents to their fullest. And please accept this performance as a prayer of praise and thanks to you,\" prior to each of his performances. Mahoney would also say prayers upon waking up and before going to sleep daily, and would repeatedly pray \"Dear God, please help me to treat everybody – including myself – with love, respect, and dignity.\"[36]\n\nDeath [ edit ]\n\nMahoney died in a Chicago hospice on February 4, 2018, due to complications from throat cancer, originally diagnosed in 2014. He was 77 years old. According to his friend Anna D. Shapiro, \"He was fragile and he was supposed to be having a routine procedure. But having just beat Stage 3 throat cancer, I think he was just too weak... by the time he did The Rembrandt [a play at Steppenwolf Theatre] he was clean of cancer... but other health issues came up and he was just too fragile.\"[37] Mahoney was buried in the Calvary Cemetery in Carthage, Illinois.[citation needed]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nAccolades [ edit ]\n\nNotes [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/John_Mahoney.jpg/220px-John_Mahoney.jpg", "https://upload.wikimedia.org/wikipedia/commons/1/10/John_Mahoney_1994.JPG", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/10/John_Mahoney_1994.JPG/220px-John_Mahoney_1994.JPG"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/1/10/John_Mahoney_1994.JPG", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/John_Mahoney", "title": "John Mahoney", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/1/10/John_Mahoney_1994.JPG", "width": 640, "height": 853}, "title": "John Mahoney - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}