{"url": "people.com/celebrity/beyonce-drake-texas-floods-celebrities-hurricane-harvey/", "text": "Tyler Perry, J.J. Watt and Hilary Duff are the latest celebrities speaking out after Hurricane Harvey rampaged through the coastal area of Texas, leaving thousands displaced and dozens more dead.\n\nPerry, 47, announced on his Facebook page that he was donating $1 million to organizations he trusted would deliver goods directly to the people who needed it most — with a portion going to Joel Osteen’s Lakewood Church.\n\nWatt, 28, continued to beat his goal (his latest being $10 million), announcing on Twitter Thursday that donations had reached $12 million.\n\nDuff donated $40,000 to the relief efforts, splitting her donation between the Red Cross and the Houston Food Bank, PEOPLE confirms.\n\nJamie Foxx announced on Instagram Thursday that he donated $25,000 to Global Giving‘s Hurricane Harvey Relief Fund.\n\n“Just want to let everyone in Texas know that we got you. From a fellow texan, my heart goes out. My prayers go out,” the actor, 49, said.\n\nFoxx also shared that he would be part of a telethon aimed at raising money for hurricane victims airing Sept. 12.\n\nScooter Braun, Justin Bieber’s manager, is helming the event, the Los Angeles Times reports.\n\nOn Thursday, Miley Cyrus announced on The Ellen DeGeneres Show that she’s donating $500,000 through her Happy Hippie Foundation.\n\n“It just really makes me just really upset. I am really happy to help in any way I can,” she said. “And I hope people understand and can put themselves in those people’s shoes and just to know what it feels like to have everything taken away from you.”\n\nThe Leonardo DiCaprio Foundation donated $1 million on Wednesday to the United Way Harvey Recovery Fund, following in the footsteps of a fellow Oscar winner, Sandra Bullock, who also donated $1 million to relief efforts on Tuesday.\n\nSelena Gomez, 25, has also donated, as well as Demi Lovato, who tweeted that she donated $50,000 to a CrowdRise campaign along with good friend Nick Jonas. DNCE have also joined the campaign.\n\nNFL player Watt has raised more than $7 million for Hurricane Harvey relief — and he said he was humbled by the nation’s continued generosity in the midst of the historic flood.\n\nWatt, who has been consistently updating his Twitter account with new amount donations, tweeted that his new goal was to raise $10 million.\n\n“It’s incredible. The most difficult times seem to bring out the best in humanity, that’s showing through right now so much,” he said in a Twitter video posted Wednesday morning, noting that more than 50,000 people have donated so far.\n\nSolange announced a special benefit concert to aid victims, with all proceeds going toward Houston relief efforts. The concert will take place at the Orpheum Theatre in Boston on Sept. 28.\n\nhttps://www.instagram.com/p/BYb6AGYhQhF/\n\nFall Out Boy announced Wednesday that all proceeds from their Nov. 7 concert in Houston will go toward storm relief efforts. The proceeds will go into the Fall Out Boy Fund, which will make monetary donations to local organizations helping those in need, Entertainment Weekly reported.\n\nOther stars continued with giving back earlier in the week, including Miranda Lambert, Ruby Rose and Kevin Hart.\n\nLambert, 33, took to Instagram Tuesday night to reveal her animal shelter foundation, MuttNation, rescued 72 dogs that day.\n\n“My roommates tonight sure are cute! Mama and newborns that were born this morning,” Lambert wrote in the caption. “Im calling her Ashley after @ashleymonroemusic who just had a baby herself. @muttnationfoundation rescued 72 dogs today who are being transported to dry safe shelters across the country. Thanks for yalls support. Stay tuned tomorrow and continue to pray. #muttnationfoundation #hurricaneharvey#texasstrong #elvirathebus#tourbusrescue.”\n\nRose, 31, also donated, writing on social media that she would match musician Jack Antonoff’s donation to an LGBT center in Houston.\n\nhttps://www.instagram.com/p/BYYygAJHQjP/?taken-by=rubyrose\n\nHart urged his fellow celebrities to give back, creating a hurricane relief fund and challenging friends like JAY-Z and Chris Brown to give at least $25,000. Brown, 28, accepted the challenge, but increased the amount to $100,000.\n\nJennifer Lopez and Alex Rodriguez each donated $25,000 to the American Red Cross, which the “On the Floor” singer revealed in an Instagram video.\n\nOther stars such as Kim Kardashian West pledged to donate $500,000, along with her sisters and mother, Kris Jenner.\n\nBeyoncé, a Houston native, shared a black-and-white Instagram photo of the state flag with the message: “Texas you are in my prayers.”\n\nMeanwhile, Texas native Longoria detailed her recent trip back home to San Antonio.\n\n“It wasn’t as bad as other areas of Texas. I’m praying for my home state and all those who are suffering through the devastation of Hurricane Harvey,” she wrote alongside a photo of the state.\n\n“Stay strong Texas and a big Texas size thank you to all the first responders, National Guard, Red Cross, volunteers, etc. Everything is bigger in Texas, and that includes our hearts and capacity to help,” she added.\n\nTexas country band Josh Abbott Band has raised more than $40,000 with 100 percent of net proceeds to benefit Hurricane Harvey relief organizations. The band’s non-profit organization JAB Cares has been selling “My Texas” t-shirts online and helping victims on-site in Texas all week.\n\nHurricane Harvey caused terrible wreckage after making landfall in the town of Rockport on Friday night, as a Category 4 storm. Port Aransas and Rockport took the brunt of the storm, which hit the coastal area with 130 mph winds. The storm left homes flooded, many without power and several buildings destroyed.\n\nOn Saturday and early Sunday, parts of the Houston area had received more than 20 inches of rain, with southeast Harris County logged at 24.28 inches of rain in 24 hours, the Weather Channel reported.\n\nhttps://www.instagram.com/p/BYUg8ooBciO/?hl=en&taken-by=kimzolciakbiermann\n\nAt least five people had been reported dead on Sunday as a result of Harvey, according to The Chicago Tribune. Officials said they expect the number of fatalities to rise in areas hit hardest with flooding.\n\nAs officials, crews and residents scramble in Texas, Bachelor alum Sean Lowe, who is from Arlington, looked to take action.\n\n“Anyone in the dallas (sic) area have a small boat I can take to Houston to help with evacuations? I’ll pay for the rental,” he tweeted on Sunday.\n\nSinger Chris Young also vowed to help, pledging $100,000 to the Red Cross — and setting up a GoFundMe page for others to donate.\n\nHe announced the pledge in a moving Instagram post, noting that he has friends and family in Texas, as well as a house that was likely destroyed in the storm.\n\nStars including Miranda Lambert and Kim Zolciak-Biermann sent well-wishes to those affected by the hurricane.\n\nOthers, like Drake Busy Philipps and Amy Schumer shared links and phone numbers to the American Red Cross, Save the Children, FEMA and local help lines for those in troubled areas.\n\n“We are currently overseas in London and all I can think about is how devastated I am as I look at images of the damage Hurricane Harvey has caused. I am praying for the safety of all those affected,” Drake wrote in an Instagram post on Monday.\n\n“Houston has truly been a home to me over the last 8 years. Myself and @furthertheprince are working with local relief groups to aid and assist the people of Texas in anyway we can and in the most immediate way possible.”", "images": ["https://people.com/thmb/Lje7sGaj3HgeS-yLg9z5JSNPfrU=/300x150/filters:no_upscale():max_bytes(150000):strip_icc()/people_magazine_sub-e6689738996d40f38f154099e1751481.png", "https://people.com/thmb/SDzdEvFAHcKwHKBW5G7j2iPXK24=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/tyler-perry-2dd9f2801acc4bf394019dca2becbc9b.jpg", "https://people.com/thmb/pw1dUJ71d25-nB3XnvdZww3MpAk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(719x219:721x221)/dwayne-johnson-421e6580830343bb8107df591281b52a.jpg", "https://people.com/thmb/WdKCDd3MZoG2Fahde3wFOTWqtlo=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/miranda-lambert-texas-flooding-cb8fb7ef95e34bdb996e7db9eac75539.jpg", "https://people.com/thmb/0p0ej2uLblUcw8igUWS1-ZdDgRY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/ukraine-tension-1-377cecc8103c491c856a53d9bb180461.jpg", "https://people.com/thmb/OwtETjgnjZJdI86Cv8ZzHn2w0P8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/jj-watt-fa4190e4dadd455a9e972752598c2f4f.jpg", "https://people.com/thmb/fVYK1SraOrYIdN52ISpMAOY_3Pw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(615x0:617x2)/milly-tout-6336f4e27e004807bbfecf2dd02720f6.jpg", "https://people.com/thmb/r5VZedOIVycS-bTwonWVlpn3fvw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/kevin-hart1-1-582a619d10f542ea99f03975e80da434.jpg", "https://people.com/thmb/otKZKjQUAlF-1muY-puEvos8VpI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/elton-john-2-1-2000-e16cf186cb954516a766651fcc59b255.jpg", "https://people.com/thmb/1pdO-TKF-65FwzAe-y-uRexjh0A=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/astroworld-frankel-1-eb70aaa453314f3b95f5e3839a88b0f4.jpg", "https://people.com/thmb/iKT4gmGCU8GEScoak6lynqEEe-o=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(659x389:661x391)/wegmans-c639f458e99147e8b18a8fcca3060166.jpg", "https://people.com/thmb/zIq2PaXEs7e7pRYU37OQ67hmgFQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/scooter-braun-3ae37e8a93d343038da10ff7bba1b495.jpg", "https://people.com/thmb/yUzNcUzS5lZg5QmfYNhPlUk85R8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/janet-jackson-e557b97042b44bc694bfb1fe8ebe9140.jpg", "https://people.com/thmb/k3Tlk86c5YcGJ1w2Xi1cLv05D4c=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/lifehouse-switchfoot-1-e4f130088ff84e6b85fae8ce1e0e4a1a.jpg", "https://people.com/thmb/mVW9gU2bPopFJsuw6VJjFOKfA9U=/2000x1333/filters:fill(auto,1)/watts-perry-foxx-3b53d5810b724041b2584a8d7749022d.jpg", "https://people.com/thmb/OJoIu54Fd9Ok3uug-4rOi_JTIso=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/hurricane-ida-tristate-6-2000-6c2d4ddcc3f24119bfdc16f95dcd75c9.jpg", "https://people.com/thmb/QXxNhJty5IvNg3Jh7i9FJ10DbCI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/bindi-irwin-1-965e175c38f942c5bf356af018a896c6.jpg", "https://people.com/thmb/gdRMDLjDefhpfVU187yeLBh1NnA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/h-m-81c7b287ac6f4995b899a505bdce773d.jpg"], "top_img": "https://people.com/thmb/mVW9gU2bPopFJsuw6VJjFOKfA9U=/2000x1333/filters:fill(auto,1)/watts-perry-foxx-3b53d5810b724041b2584a8d7749022d.jpg", "keywords": [], "authors": ["Char Adams"], "canonical_link": "https://people.com/celebrity/beyonce-drake-texas-floods-celebrities-hurricane-harvey/", "title": "Stars React to Texas Floods After Hurricane Harvey", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Some of Hollywood and music's biggest stars are sending well-wishes to Texas residents affected by Hurricane Harvey", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "PEOPLE", "sailthru.author": "Char Adams", "article": {"section": "People", "opinion": "false", "author": "https://www.facebook.com/peoplemag"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "og": {"type": "article", "site_name": "Peoplemag", "url": "https://people.com/celebrity/beyonce-drake-texas-floods-celebrities-hurricane-harvey/", "title": "Stars React to Texas Floods After Hurricane Harvey", "description": "Some of Hollywood and music's biggest stars are sending well-wishes to Texas residents affected by Hurricane Harvey", "image": "https://people.com/thmb/mVW9gU2bPopFJsuw6VJjFOKfA9U=/2000x1333/filters:fill(auto,1)/watts-perry-foxx-3b53d5810b724041b2584a8d7749022d.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "Stars React to Texas Floods After Hurricane Harvey", "description": "Some of Hollywood and music's biggest stars are sending well-wishes to Texas residents affected by Hurricane Harvey", "image": "https://people.com/thmb/mVW9gU2bPopFJsuw6VJjFOKfA9U=/2000x1333/filters:fill(auto,1)/watts-perry-foxx-3b53d5810b724041b2584a8d7749022d.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.19.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.19.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.19.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.19.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.19.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}