{"url": "http://teddeutch.house.gov/news/documentsingle.aspx?DocumentID=344947", "text": "Office of the Twenty-Second Congressional District of Florida\n\n117th Congress, 2nd Session\n\nFormerly the Office of Representative Theodore E. Deutch\n\nThe Washington, DC, office and the district offices of former Representative Theodore E. Deutch will continue to serve the people of the Twenty-Second Congressional District of Florida under the supervision of the Clerk of the House of Representatives. Representative Theodore E. Deutch resigned from Congress effective September 30, 2022.\n\nSee important Coronavirus Information\n\nSee Press Release\n\nThe Interim Vacant Office Status\n\nBy federal law and the Rules of the House of Representatives, the employees of the former Representative continue to staff the offices of the congressional district under the supervision of the Clerk of the House of Representatives. This interim vacant status continues until a new Representative is elected to fill the unexpired term. Currently, the congressional district does not have voting representation. Although the scope of the vacant congressional office is limited, constituents of the district are invited to contact this interim office for information and assistance as indicated below.\n\nLegislative Information\n\nUntil a new Representative is elected, the vacant congressional office cannot take or advocate positions of public policy. Constituents may choose to express opinions on legislation or issues to your elected Senators or wait until a new Representative is elected and takes office. Mail received by the vacant office will be acknowledged. The staff of the vacant office can assist constituents with general information concerning the status of legislation, but cannot provide analysis of issues or render opinions.\n\nAssistance with Federal Government Agencies (Casework)\n\nThe staff of the vacant office will continue to assist constituents who have cases pending with the office. These constituents will receive a letter from the Clerk requesting whether the staff should continue assistance or not. Constituents who do not have pending cases but require assistance in matters relating to federal government agencies are invited to contact the nearest district office for further information and assistance.\n\nOffice Locations\n\nThe staff of the vacant congressional office is available to assist you at the following locations:\n\nOther Sources in Florida\n\nOffice of the Twenty-Second Congressional District of Florida2323 Rayburn BuildingWashington, DC 20515(202) 225–3001Boca Raton7900 Glades RoadSuite 250Boca Raton, FL 33434(561) 470–5440Coral Springs9500 West Sample RoadSuite 201Coral Springs, FL 33065(954) 255–8336Margate5790 Margate BoulevardMargate, FL 33063(954) 972–6454Fort Lauderdale111 East Las Olas BoulevardFort Lauderdale, FL 33301(954) 255–8336\n\nFlorida Department of State", "images": ["http://teddeutch.house.gov/Content/assets/img/clerk-logo-web.svg", "http://teddeutch.house.gov/Content/assets/img/clerk-logo-footer.svg"], "top_img": "", "keywords": [], "authors": [], "canonical_link": "", "title": "Office of the Clerk, U.S. House of Representatives", "meta_data": {"viewport": "width=device-width, initial-scale=1", "referrer": "always"}, "movies": [], "publish_date": null, "source": "http://teddeutch.house.gov", "summary": ""}