{"url": "www.vanityfair.com/news/2005/09/aniston200509", "text": "Although the bungalow was dark and depressing when she first saw it, a quickie makeover has transformed it into a cozy sanctuary that’s far more representative of Aniston’s personal taste than the showplace she and Pitt shared, where the décor seemed all hard edges and unforgiving materials. “Brad and I used to joke that every piece of furniture was either a museum piece or just uncomfortable,” Aniston says. “He definitely had his sense of style, and I definitely have my sense of style, and sometimes they clashed. I wasn’t so much into modern.”\n\nI mention Nicole Kidman’s quip after splitting up with Tom Cruise, when she was asked what she looked forward to in her new life without the diminutive husband who had abruptly ended their marriage. “Wearing high heels again,” Kidman retorted.\n\nSo I ask Aniston—who filed for divorce on March 25 and expects it to become final this fall—what she’s enjoying about being on her own. “I can have a comfortable couch,” she says with a wry smile.\n\nIn the tabloids and celebrity gossip magazines, the soap-opera version of her life continues to hurtle along like a runaway express train, rushing Aniston through major life stages with ludicrous speed: Jen Is Devastated! Jen Is Furious! Jen Gets Revenge! Jen Has a New Man! Jen Is Over Brad! Most of the stories are wrong. (No, Oprah didn’t try to get Brad and Jen back together; no, Jen is not romantically involved with Vince Vaughn, her co-star in The Break-Up, a comedy about a separating couple who continue to live together, which they shot in Chicago over the summer.)\n\nOther reports are just idiotically simpleminded, breathlessly advancing a plot that bears little resemblance to the long, complex, painful experience of getting over a divorce. While the tabloids insist on dividing Aniston’s emotions into neat, distinct chapters, the reality is that pain and denial and anger and resignation all blur together, sometimes at the same moment—and the lengthy process of mourning is nowhere near over.\n\n“There are many stages of grief,” she says. “It’s sad, something coming to an end. It cracks you open, in a way—cracks you open to feeling. When you try to avoid the pain, it creates greater pain. I’m a human being, having a human experience in front of the world. I wish it weren’t in front of the world. I try really hard to rise above it.”\n\nAniston is struggling to find a deeper meaning in the debacle. “I have to think there’s some reason I have called this into my life,” she says. “I have to believe that—otherwise it’s just cruel.”\n\nHer friends are filled with admiration for the way she’s handled the whole mess. “This woman is basically having a root canal without anesthesia, but she’s really trying not to numb the pain or shove it under the rug,” says Hahn. “She’s grown so much, and she continues to grow on a daily basis, because every time you think, ‘Well, I’ve dealt with this,’ there’s another hurdle to get over. It’s a bit Job-like at the moment.”\n\nPhotographed by Mario Testino for the September 2005 issue.\n\nAniston’s response has been to retreat into her cocoon, “in an effort to take care of myself and my heart,” she says. “I feel like I’m nesting. I love being home. I have friends that come over. My girlfriends I’ve had for 20 years. When things happen, the tribe gathers around and lifts you up. I’ve had lonely moments, sure, but I’m also enjoying being alone. There’s no question it takes getting used to; I’m a partnership person, and if something happens your instinct is to share it—but you’re no longer part of a couple. I definitely miss that. It’s sort of like Bambi—like you’re trying to learn how to walk. You’re a little awkward; you stumble a little bit. The things you would do with your partner, you don’t do. It’s uncharted territory, but I think it’s good for me to be a solo person right now. You’re forced to re-discover yourself and take it to another level. If you can find a way to see the glass half full, these are the moments when you learn the most. I’ve had to re-introduce myself to myself in a way that’s different.”\n\nShe doesn’t downplay the difficulties. “Am I lonely? Yes. Am I upset? Yes. Am I confused? Yes. Do I have my days when I’ve thrown a little pity party for myself? Absolutely. But I’m also doing really well,” she says. “I’ve got an unbelievable support team, and I’m a tough cookie.… I believe in therapy; I think it’s an incredible tool in educating the self on the self. I feel very strong. I’m really proud of how I’ve conducted myself.”\n\nA crucial part of Aniston’s strategy has been to ignore the putrid stew of rumor, speculation, and outright falsehood in the tabloid media. “It’s been very important for me not to read anything, not to see anything,” she says. “It’s been my saving grace. That stuff is just toxic for me right now. I probably avoided a lot of suffering by not engaging in it, not reading, not watching.”\n\nShe gestures toward Norman, who has roused himself for a moment to check on his mistress’s whereabouts. “It’s like those dog cones,” she says, encircling her neck as if putting on one of the plastic cones prescribed by vets to prevent dogs from scratching their ears. “I have my imaginary dog cone on, so I don’t see anything. It just allows for a much more peaceful life.”\n\nNevertheless, as Pitt publicly flaunted the instant family he had created with Jolie, the tableaux of their newfound togetherness were humiliating. “I would be a robot if I said I didn’t feel moments of anger, of hurt, of embarrassment,” Aniston acknowledges.\n\nBut she tries to keep the lurid details to herself. “She is grieving, but she’s taken the high road,” says Bendewald. “She’s mourning the death of a marriage, and she’s done it very privately. She can have her moments of rage, but she doesn’t want to out him, and that keeps her heart clear. She’s not bad-mouthing him. She doesn’t want to make him the villain and her the victim.”\n\nIndeed, Aniston vehemently rejects the interpretation that she was left for another woman. “I don’t feel like a victim,” she says. “I’ve worked with this therapist for a long time, and her major focus is that you get one day of being a victim—and that’s it. Then we take responsibility for our own input. To live in a victim place is pointing a finger at someone else, as if you have no control. Relationships are two people; everyone is accountable. A lot goes into a relationship coming together, and a lot goes into a relationship falling apart. She’d say, ‘Even if it’s 98 percent the other person’s fault, it’s 2 percent yours, and that’s what we’re going to focus on.’ You can only clean up your side of the street.”\n\nThese days, one index of recovery is the fact that Aniston’s sardonic humor is resurfacing. When I tell her that my 13-year-old son is a big fan of hers, she doesn’t miss a beat. “Is he single?” she asks, deadpan.\n\nShe’ll toss off a crack about Pitt’s startling transformation into a punky bleached blond. “Billy Idol called—he wants his look back,” she murmurs with a sly smile.\n\nBy now she can even talk about those gut-wrenching photos of Jolie and Pitt in Kenya with mordant resignation rather than tears. “I can’t say it was one of the highlights of my year,” she says. “Who would deal with that and say, ‘Isn’t that sweet! That looks like fun!’? But shit happens. You joke and say, ‘What doesn’t kill you makes you stronger.’”\n\nShe sighs. “I feel like I’ve earned a superpower shield,” she says. Then, afraid of sounding grandiose, she adds, “I’m not comparing my suffering to other people’s suffering. Everybody has their own.”\n\nAniston’s friends were particularly horrified by W magazine’s 60-page photo spread featuring Pitt and Jolie as an early-1960s-style married couple with a brood of miniature blond Brads. “You want to shake the shit out of him and say, ‘Your timing sucks!’” says one. “He’s made some choices that have been tremendously insensitive.”\n\nThe W feature, which was entitled “Domestic Bliss,” couldn’t be blamed on the paparazzi; not only did Pitt conceptualize it, but he retained the international rights, so he actually profited from it. Aniston’s eyes widen in surprise when I mention that last fact, and she grimaces. “I didn’t know that,” she says. But she refuses to indulge herself in an angry reaction. “Is it odd timing? Yeah. But it’s not my life,” she says. “He makes his choices. He can do—whatever. We’re divorced, and you can see why.”\n\nShe shakes her head in exasperation. “I can also imagine Brad having absolutely no clue why people would be appalled by it,” she adds. “Brad is not mean-spirited; he would never intentionally try to rub something in my face. In hindsight, I can see him going, ‘Oh—I can see that that was inconsiderate.’ But I know Brad. Brad would say, ‘That’s art!’”\n\nShe rolls her eyes, pretending to screw something into her forehead. “There’s a sensitivity chip that’s missing,” she says.\n\nAniston’s friends are amazed at her willingness to give Pitt the benefit of the doubt, but they basically agree with her assessment. “I don’t think he was trying to hurt Jen,” says Courteney Cox, Aniston’s dear friend and former co-star on Friends. “I don’t think that Brad is malicious, or a liar. The W thing was his idea, but I don’t think he thought that one through, about what it would look like to anyone else.”\n\nAlthough Aniston remains determined not to lash out, she sometimes questions her own restraint. “Why am I protecting him?” she exclaimed to one friend, only to continue with what she sees as the dignified course of action.", "images": ["https://media.vanityfair.com/photos/55c4c4338fbf768838dc570f/16:9/w_1280,c_limit/ss05-jennifer-aniston-vf.jpg", "https://media.vanityfair.com/photos/55c4c42c8fbf768838dc56b7/master/w_1600%2Cc_limit/ss02-jennifer-aniston-vf.jpg", "https://media.vanityfair.com/photos/62100dc174854b6731411914/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/6270778fc79ffab65a2f7d6d/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/61e0aaf2b8d453b000d50805/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/633dac5a42c2d8adf3fa7d9c/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/61e9a4b7b7a91122f5b3d8b9/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/55c4c434169027501c6efb7f/master/w_1600%2Cc_limit/ss06-jennifer-aniston-vf.jpg", "https://media.vanityfair.com/photos/618c0614fdf674f0522a9fb7/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/57d2e2a05475d07256a8b2ef/1:1/w_350%2Ch_350%2Cc_limit/celebrity-divorces-lawyers.jpg", "https://media.vanityfair.com/photos/62b3340bfa5c67611b2c46ac/1:1/w_350%2Ch_350%2Cc_limit/undefined", "http://www.vanityfair.com/verso/static/hwd/assets/logo-header.ea437ae89b8c3c7aabbb46bb45a04f1a514e5803.svg", "https://media.vanityfair.com/photos/55c4ec6a8fbf768838dc619b/master/w_2560%2Cc_limit/ss10-jennifer-aniston-vf.jpg", "https://media.vanityfair.com/photos/62bb516609ddf1b35f5ea552/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/55c4c43c169027501c6efbd7/master/w_1600%2Cc_limit/ss09-jennifer-aniston-vf.jpg", "https://media.vanityfair.com/photos/627ea8ca0a29d0182d5876f6/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/55c4c438169027501c6efbab/master/w_1600%2Cc_limit/ss07-jennifer-aniston-vf.jpg", "https://media.vanityfair.com/photos/63370d0bb02ed9e1f657fa60/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/55c4c4388fbf768838dc573b/master/w_1600%2Cc_limit/ss08-jennifer-aniston-vf.jpg", "https://media.vanityfair.com/photos/55c4c42c169027501c6efb27/master/w_1600%2Cc_limit/ss01-jennifer-aniston-vf.jpg", "https://media.vanityfair.com/photos/623a28a1e700ab34afc82b7f/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/55c4c4308fbf768838dc56e3/master/w_1600%2Cc_limit/ss04-jennifer-aniston-vf.jpg", "https://media.vanityfair.com/photos/633d9bec72fe11ef3849c3ef/1:1/w_350%2Ch_350%2Cc_limit/undefined", "http://www.vanityfair.com/verso/static/hwd/assets/logo-reverse.6ef96ab8686439a35176e2ff8b2c4487e92fbaae.svg"], "top_img": "https://media.vanityfair.com/photos/55c4c4338fbf768838dc570f/16:9/w_1280,c_limit/ss05-jennifer-aniston-vf.jpg", "keywords": [], "authors": ["Condé Nast", "Leslie Bennetts"], "canonical_link": "https://www.vanityfair.com/news/2005/09/aniston200509", "title": "The Unsinkable Jennifer Aniston", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "width=device-width, initial-scale=1", "referrer": "no-referrer-when-downgrade", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2022", "description": "The whole world watched as her “perfect” marriage fell apart. Only her closest friends knew what really happened. Now, in Jennifer Aniston’s first interview since she split from Brad Pitt, she spills her heart, and some tears, to Vanity Fair, sharing her shock and confusion over Pitt’s liaison with Angelina Jolie, her desire for a family, and her deep, conflicting emotions (anger, hurt, exasperation, tenderness) toward the man she still loves.", "id": "54cc22d9fde9250a6c418dbe", "keywords": "brad pitt,angelina jolie,jennifer aniston,divorce", "news_keywords": "brad pitt,angelina jolie,jennifer aniston,divorce", "robots": "index, follow, max-image-preview:large", "content-type": "article", "parsely-post-id": "54cc22d9fde9250a6c418dbe", "parsely-metadata": "{\"description\":\"The whole world watched as her “perfect” marriage fell apart. Only her closest friends knew what really happened. Now, in Jennifer Aniston’s first interview since she split from Brad Pitt, she spills her heart, and some tears, to Vanity Fair, sharing her shock and confusion over Pitt’s liaison with Angelina Jolie, her desire for a family, and her deep, conflicting emotions (anger, hurt, exasperation, tenderness) toward the man she still loves.\",\"image-16-9\":\"https://media.vanityfair.com/photos/55c4c4338fbf768838dc570f/16:9/w_1000,c_limit/ss05-jennifer-aniston-vf.jpg\",\"image-1-1\":\"https://media.vanityfair.com/photos/55c4c4338fbf768838dc570f/1:1/w_1000,c_limit/ss05-jennifer-aniston-vf.jpg\"}", "og": {"description": "The whole world watched as her “perfect” marriage fell apart. Only her closest friends knew what really happened. Now, in Jennifer Aniston’s first interview since she split from Brad Pitt, she spills her heart, and some tears, to Vanity Fair, sharing her shock and confusion over Pitt’s liaison with Angelina Jolie, her desire for a family, and her deep, conflicting emotions (anger, hurt, exasperation, tenderness) toward the man she still loves.", "image": "https://media.vanityfair.com/photos/55c4c4338fbf768838dc570f/16:9/w_1280,c_limit/ss05-jennifer-aniston-vf.jpg", "site_name": "Vanity Fair", "title": "The Unsinkable Jennifer Aniston", "type": "article", "url": "https://www.vanityfair.com/news/2005/09/aniston200509"}, "article": {"content_tier": "metered", "opinion": "false", "section": "tags", "published_time": "2006-10-10T04:00:00.000Z", "modified_time": "2006-10-10T04:00:00.000Z", "author": "Leslie Bennetts"}, "twitter": {"card": "summary_large_image", "creator": "@VanityFair", "description": "The whole world watched as her “perfect” marriage fell apart. Only her closest friends knew what really happened. Now, in Jennifer Aniston’s first interview since she split from Brad Pitt, she spills her heart, and some tears, to Vanity Fair, sharing her shock and confusion over Pitt’s liaison with Angelina Jolie, her desire for a family, and her deep, conflicting emotions (anger, hurt, exasperation, tenderness) toward the man she still loves.", "domain": "https://www.vanityfair.com", "image": "https://media.vanityfair.com/photos/55c4c4338fbf768838dc570f/16:9/w_1280,c_limit/ss05-jennifer-aniston-vf.jpg?mbid=social_retweet", "site": "@VanityFair", "title": "The Unsinkable Jennifer Aniston"}, "fb": {"app_id": 256281040558, "pages": 8810407571}, "google-signin-client_id": "1065629119444-svrqo31taikd2j0ji4dgjs9q3vul4133.apps.googleusercontent.com"}, "movies": [], "publish_date": 1160452800.0, "source": "http://www.vanityfair.com", "summary": ""}