{"url": "https://en.wikipedia.org/wiki/Dan_Conner", "text": "Fictional character in the Roseanne and The Conners television series\n\nFictional character\n\nDan Conner Roseanne character First appearance \"Life and Stuff\" (1988) Created by Roseanne Barr Portrayed by John Goodman In-universe information Gender Male Occupation Building contractor, motorcycle mechanic Family Ed Conner (father; deceased)\n\nAudrey Conner (mother)\n\nCrystal Anderson Conner (step-mother)\n\nLonnie Anderson (step-brother)\n\nLittle Ed Conner (half-brother)\n\nAngela Conner (half-sister) Spouses Roseanne Conner (deceased)\n\nLouise Goldufski Children Becky Conner Healy\n\nDarlene Conner Healy\n\nD.J. Conner\n\nJerry Garcia Conner Relatives Harris Conner-Healy (granddaughter)\n\nMark Conner-Healy (grandson)\n\nMary Conner (granddaughter)\n\nDavid Healy (son-in-law)\n\nMark Healy (son-in-law; deceased)\n\nGeena Williams-Conner (daughter-in-law)\n\nBen Olinsky (son-in-law)\n\nLonnie (step-brother)\n\nBeverly Rose Conner (granddaughter) Religion Christian (Protestant) Home Lanford, Illinois Nationality American\n\nDan Conner is a fictional character in the television series Roseanne created by comedian and namesake Roseanne Barr and portrayed by actor John Goodman. He is the husband to Roseanne Conner, and father to two daughters, Darlene and Becky, and two sons, D.J. and Jerry Garcia. Throughout the years, Goodman has won several awards, including a Golden Globe, for his portrayal of Dan Conner.\n\nRoseanne ran from 1988 to 1997. It was revived in 2018 and had been renewed again, but was cancelled in May soon after the revival season as Roseanne Barr, who played Roseanne Conner, made controversial remarks on social media. Broadcaster ABC and the other cast members wished to keep the show going in some form without Barr, and this culminated in the announcement of The Conners, a separate series from Roseanne with Dan as the protagonist, on June 21, 2018. Barr is not involved in any capacity and her character was killed off.[1][2][3]\n\nCreation and conception [ edit ]\n\nWhen John Goodman was chosen to play Dan, co-star Roseanne Barr stated that she was happy, adding that she had a \"big crush\" on him from the start.[4]\n\nDan is a loving, easygoing, funny, witty family man who at the beginning of the series was looking for a job, but quickly became a drywall contractor. At one point during the second to last season, Goodman walked off the set after Barr had an on-set outburst. It was speculated that he was growing tired of her behavior. While he considered leaving for good, Goodman held negotiations with its producers. At first, he agreed to finish the episode, but later agreed to do an episode to explain his exit. However, Goodman eventually agreed to return to the series[5] and chose to reduce his role in Roseanne to focus on his film career.[6] After this announcement, he was in negotiations with the producers on how many episodes he would appear in the following season.\n\nTed Harbert, boss of ABC Entertainment, commented that Barr was excited to return for a ninth season, with or without Goodman, which could be about her and her sister, Jackie Harris, as single parents. He attempted to dismiss the role of Dan, stating that Jackie has a lot more screen time than he does.[7] Los Angeles Daily News editor Phil Rosenthal criticized Harbert for his comments, describing Dan as the emotional anchor of the series. Rosenthal compared Dan to daughter Becky Conner, who was portrayed by two different actresses due to scheduling conflicts over the years, and son D.J. Conner, who was portrayed by a different actor in the pilot than the one in later episodes. He called Metcalf a wonderful actress, but added that Dan's love for his wife showed viewers that she could be lovable despite her abrasiveness, similarly to Edith Bunker and Archie Bunker in All in the Family. Rosenthal brought up similar departures that caused their respective programs to slip in quality, and warned that Roseanne may suffer the same fate if Goodman left.[7] In the end, Goodman signed on for one more season.\n\nSummary [ edit ]\n\nDan Conner is an easy-going, hardworking father, and later, in the revival era, grandfather. Throughout the two series he holds various occupations and is often seen balancing work, home, and personal interests. He is the typical working-class father who provides comic relief, but also is a good example for his children. He is an avid fan of Chicago sports teams, including the Bears, Bulls, Cubs, and Blackhawks. Many of the show's episodes mention the teams, and he often watches their games, discusses them, and likes wearing their souvenir clothing. He also enjoys junk food, playing poker with friends, and fixing motorcycles. In many ways, he epitomizes the stereotypical blue-collar, American father and is widely considered one of the best TV dads of all time.\n\nLike Roseanne, Dan had a troubled upbringing and was known for getting into petty mischief, typically underage drinking and fist fights. Dan was an accomplished brawler before settling down with Roseanne, but generally avoids using physical violence to settle issues. A notable exception occurred onscreen (and played for laughs) in \"Dan's Birthday Bash\" when he knocks out an obnoxious bar patron with a single punch. More dramatically, he is involved in an offscreen confrontation during \"Crime and Punishment\" when he confronted Fisher, Jackie's abusive boyfriend; Dan later stated that the incident was an unintentional escalation and that he only intended to scare Fisher. The event led to Dan's temporary incarceration in Lanford's city jail (and created a great deal of local notoriety for the family), though Fisher later dropped the charges. Both Jackie and Roseanne appreciate Dan's gesture despite the unintentional consequences in \"War and Peace\" as it reinforced Dan's raw, but ultimately chivalric, code of honor.\n\nDuring the final episode of season 9, when Roseanne reveals that the entire ninth season was written as a fictional book based on her life and family, and she changed certain unpleasant elements; most notably that Dan's brief affair was actually him dying from his heart attack in \"The Wedding\", near the end of season 8.\n\nIn 2017, news of a revival of the series was said to be in the works, with most of the original cast members reprising their roles, including Goodman.[8][9] In season 10, Dan is alive and well and stumbles upon an unpublished novel of Roseanne's where he states that the book would have been a success had she not killed off the \"most interesting character\"; vaguely implying that the season 9 finale revelations were actually the made-up details from Roseanne's book. The season explores the trials and tribulations of the family, just as the previous ones had.\n\nIn The Conners, audiences see a new development for Dan, who is now a widower and forced to cope with Roseanne's death. The character's circumstances as an aging manual laborer are also explored. Dan eventually begins a romantic relationship with new character Louise, portrayed by actress Katey Sagal, who played Peggy Bundy on another popular 1980s-1990s sitcom, Married... with Children; ironically, Roseanne Barr was offered the Peggy Bundy role but turned it down.[10]\n\nA list of the top 25 television dad wage earners created by Brookstone listed Dan in the 24th place, with $17,856 a year. They came to this determination through use of data from the U.S. Bureau of Labor Statistics and human research firms.[11]\n\nCritical reception [ edit ]\n\nDan Conner has often been described as one of John Goodman's most famous roles.[12] In an article about television dads, The Post and Courier editor Mindy Spar began discussing how 1990s TV dads became goofier than dads from earlier decades, calling Dan more like one of the children than the father. IGN editor Edgar Arce called Dan Conner a prototypical everyman.[4]\n\nMSNBC commentator Gael Fashingbauer Cooper called Dan one of the first TV dads to be seen struggling to make ends meet. She also praised the character, stating that without him, the Conner family home would not be able to last. She added that in the later seasons, the series took risks with the character, such as his heart attack, his affair, and the revelation that he had died. She compared this to the revelation of Lieutenant Colonel Henry Blake's death in the M*A*S*H television series.[13]\n\nThe relationship between Roseanne and Dan has received praise. An article in the Sarasota Herald-Tribune called their relationship realistic, commenting that while they mock each other, viewers can feel their love while they deal with the kinds of problems real families face.[14] During the final season, Dan and Roseanne live apart after Dan cheats on her. Daily News editor David Bianculli stated that while they were the most entertaining and realistic couples on television, they were one of the least during their separation.[15]\n\nThe potential absence of Dan from all or most of season nine prompted Phil Rosenthal of the Los Angeles Daily News to describe it as a rare occasion where ending the show would be preferred to doing without. Robinson described Dan's potential absence as leaving a tremendous void, owing to his ability to make everyone around him better.[7] The revelation that Dan actually died and the latter part of the series being a work of fiction was not well received. Note that this itself was later retconned when the series was revived in 2018 and Dan was depicted as having been alive, and dying only in a story of Roseanne's, something he himself finds amusing; said story was the plot device for season nine.[16]\n\nAwards [ edit ]\n\nJohn Goodman was nominated for several awards throughout his portrayal of Dan Conner, winning four, including one Golden Globe in 1993.\n\nWon\n\nGolden Globes: Best Performance by an Actor in a TV-Series - Comedy/Musical, 1993\n\nViewers for Quality Television Series: Best Actor in a Quality Comedy Series, 1992\n\nNominated\n\nEmmy Awards: Outstanding Lead Actor in a Comedy Series, 1995\n\nEmmy Awards: Outstanding Lead Actor in a Comedy Series, 1994\n\nEmmy Awards: Outstanding Lead Actor in a Comedy Series, 1993\n\nEmmy Awards: Outstanding Lead Actor in a Comedy Series, 1992\n\nEmmy Awards: Outstanding Lead Actor in a Comedy Series, 1991\n\nEmmy Awards: Outstanding Lead Actor in a Comedy Series, 1990\n\nEmmy Awards: Outstanding Lead Actor in a Comedy Series, 1989\n\nGolden Globes: Best Performance by an Actor in a TV-Series - Comedy/Musical, 1991\n\nGolden Globes: Best Performance by an Actor in a TV-Series - Comedy/Musical, 1990\n\nGolden Globes: Best Performance by an Actor in a TV-Series - Comedy/Musical, 1989\n\nScreen Actors Guild Awards: Outstanding Performance by a Male Actor in a Comedy Series, 1995\n\nTV Land Awards: Favorite Elvis Impersonation, 2007", "images": ["https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/apple-touch/wikipedia.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Dan_Conner", "title": "Dan Conner", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "viewport": "width=1000", "og": {"title": "Dan Conner - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}