{"url": "https://www.nbcnews.com/pop-culture/awards/julia-louis-dreyfus-receives-mark-twain-prize-comedy-s-top-n922846", "text": "WASHINGTON — After a 35-year acting career and with two iconic television characters to her name — Elaine Benes of \"Seinfeld\" and foul-mouthed Vice-President Selina Meyer — Julia Louis-Dreyfus has been honored with the Mark Twain Prize for lifetime achievement in comedy.\n\nOn Sunday night at Washington's Kennedy Center, the 57-year-old actress received a stream of testimonials from celebrities including Jerry Seinfeld, Stephen Colbert and 2010 Mark Twain recipient Tina Fey — touching on the multiple aspects of her career.\n\nFey paid tribute to Louis-Dreyfus at the award ceremony by tracking the similarities between their lives.\n\n\"We both started comedy in Chicago. We both moved on to 'Saturday Night Live.' We both lost our virginity to Brad Hall,\" referring to Louis-Dreyfus' husband and former SNL castmate sitting next to the honoree. Fey praised the \"secret precision\" of Louis-Dreyfus' comedy and her willingness to make her Seinfeld character so flawed.\n\n\"Julia let Elaine be selfish and petty and sarcastic and a terrible, terrible dancer,\" Fey said. \"Julia's never been afraid to be unlikable — not on screen and not in person.\"\n\nLouis-Dreyfus is the 21st Mark Twain recipient, joining a list that includes Richard Pryor, George Carlin and Carol Burnett. Bill Cosby, the winner in 2009, had his award rescinded earlier this year after he was convicted of three counts of aggravated indecent assault.\n\nDuring last year's ceremony to honor David Letterman, Cosby's name was never mentioned. But this year, two of the performers felt comfortable making Cosby jokes. Late night host Stephen Colbert displayed a sign proclaiming, \"167 days since the last Un-Twaining.\"\n\nWith his fingers crossed, he told Louis-Dreyfus, \"I think you'll be OK.\"\n\nLater Keegan-Michael Key come onstage, dressed as Mark Twain himself and proceeded to roast many of the previous award recipients. When a picture of Cosby was briefly shown, Michael-Key quickly moved things along and said, \"It's OK, he's not watching,\" then added that he doubted PBS was a popular channel \"in the penitentiary.\"\n\nSeinfeld, while on the red carpet before the ceremony, recalled first meeting Louis-Dreyfus during an informal audition. His iconic sitcom, \"Seinfeld,\" was still in the planning stages and producer Larry David knew Louis-Dreyfus from their time together on \"Saturday Night Live.\"\n\n\"We had just two short pages of script, and we sat down to read the dialogue together,\" Seinfeld said. \"As soon as she opened her mouth, I knew she was the one.\"\n\nSeinfeld also credited Louis-Dreyfus for having the confidence and strength of personality to hold her own on what he called \"a very male show.\"\n\nThat confidence was evident very early for Louis-Dreyfus, who said she knew as a young child that she had a gift for comedy.\n\n\"The first time I really knew was when I stuffed raisins in my nose and my mother laughed. I ended up in the emergency room because they wouldn't come out!\" Louis-Dreyfus said before the ceremony.\n\nComedian Kumail Nanjiani grew up in Pakistan and never saw an episode of \"Seinfeld\" until he immigrated to the U.S as an adult.\n\n\"But I became a huge fan as soon as I moved here,\" he said.\n\nThe co-writer of the movie \"The Big Sick\" particularly recalls her iconic, slightly convulsive \"Elaine Benes dance\" on the show, which he credits to Louis-Dreyfus' gift for physical comedy.\n\n\"There are some comedians who think physical comedy is beneath them,\" he said. \"But she was just fearless and ego-less.\"\n\nAt the end of the night, Louis-Dreyfus accepted her award with an extended comedic bit and a few shots at new Supreme Court Justice Brett Kavanaugh.\n\nThe veteran comedic actress first drew laughs by repeatedly referencing her true life's ambition to be a respected dramatic actress — stopping in mid-speech to deliver a monologue from Shakespeare's \"Merchant of Venice.\"\n\n\"It's incredibly awesome. It's very humbling. And I cannot believe it's happening.\"—@OfficialJLD on winning the #TwainPrize pic.twitter.com/hQIQalvE0L — The Kennedy Center (@kencen) October 22, 2018\n\nA native of the Washington suburbs in Maryland, Louis-Dreyfus is a graduate of the elite Holton-Arms school, alma mater of Christine Blasey Ford, who accused Kavanaugh of assaulting her at a high school party.\n\nLouis-Dreyfus make a veiled but unmistakable reference to Ford's testimony — framing it around her performance a high school presentation of the play \"Serendipity.\"\n\n\"I can remember every single aspect of that play that night, so much so that I would testify under oath about it,\" she said, to a round of laughter and applause. \"But I can't remember who drove me there or who drove me home.\"\n\nLouis-Dreyfus emerged from Chicago's famed Second City comedy troupe before joining the cast of \"Saturday Night Live.\" Her best-known role is her nine-year run as Elaine Benes on \"Seinfeld.\" More recently, her work as Vice President Selina Meyer on \"Veep\" earned her six consecutive Emmy Awards.\n\nProduction on the upcoming seventh and final season of \"Veep\" was delayed as Louis-Dreyfus received treatment for breast cancer. That season is currently in production.\n\nPBS will air the Twain event on Nov. 19.", "images": ["https://media-cldnry.s-nbcnews.com/image/upload/t_fit-760w,f_auto,q_auto:best/newscms/2018_43/2614186/181022-julia-louis-dreyfus-mark-twain-main-se-1207p.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_43/2614191/181022-julia-louis-dreyfus-mark-twain-cover-se-1207p.jpg"], "top_img": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_43/2614191/181022-julia-louis-dreyfus-mark-twain-cover-se-1207p.jpg", "keywords": [], "authors": ["Associated Press"], "canonical_link": "https://www.nbcnews.com/pop-culture/awards/julia-louis-dreyfus-receives-mark-twain-prize-comedy-s-top-n922846", "title": "Julia Louis-Dreyfus receives Mark Twain Prize, comedy's top award", "meta_data": {"msapplication-config": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/nbcnews/all-other-sizes-PNG.ico/browserconfig.xml", "robots": "max-image-preview:large", "fb": {"app_id": 10150138890205613, "pages": 1508175089456029}, "og": {"site_name": "NBC News", "locale": "en_US", "url": "https://www.nbcnews.com/pop-culture/awards/julia-louis-dreyfus-receives-mark-twain-prize-comedy-s-top-n922846", "title": "Julia Louis-Dreyfus receives Mark Twain Prize, comedy's top award", "description": "Louis-Dreyfus, 57, accepted her lifetime achievement award with an extended comedic bit and a few shots at new Supreme Court Justice Brett Kavanaugh.", "image": {"identifier": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_43/2614191/181022-julia-louis-dreyfus-mark-twain-cover-se-1207p.jpg", "secure_url": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_43/2614191/181022-julia-louis-dreyfus-mark-twain-cover-se-1207p.jpg", "type": "image/jpeg", "width": 1200, "height": 630}, "type": "article"}, "twitter": {"site": "@NBCNews", "creator": "NBCNews", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1024-512,f_auto,q_auto:best/newscms/2018_43/2614191/181022-julia-louis-dreyfus-mark-twain-cover-se-1207p.jpg", "title": "Julia Louis-Dreyfus receives Mark Twain Prize, comedy's top award", "description": "Louis-Dreyfus, 57, accepted her lifetime achievement award with an extended comedic bit and a few shots at new Supreme Court Justice Brett Kavanaugh.", "card": "summary_large_image"}, "viewport": "width=device-width, initial-scale=1, user-scalable=yes", "description": "Julia Louis-Dreyfus, of \"Seinfeld\" and \"Veep,\" has been honored with the Mark Twain Prize for lifetime achievement in comedy.", "branch": {"deeplink": {"title": "Julia Louis-Dreyfus receives Mark Twain Prize, comedy's top award", "description": "Louis-Dreyfus, 57, accepted her lifetime achievement award with an extended comedic bit and a few shots at new Supreme Court Justice Brett Kavanaugh.", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2018_43/2614191/181022-julia-louis-dreyfus-mark-twain-cover-se-1207p.jpg", "type": "article", "unibrow": "Awards", "authorName1": "Associated Press"}}, "article": {"opinion": "false", "content_tier": "free", "published": "Mon Oct 22 2018 16:57:00 GMT+0000 (UTC)", "modified": "Mon Oct 22 2018 17:52:21 GMT+0000 (UTC)"}, "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_social_share_1024x768_scale,f_auto,q_auto:best/newscms/2018_43/2614191/181022-julia-louis-dreyfus-mark-twain-cover-se-1207p.jpg", "next-head-count": 92}, "movies": [], "publish_date": 1540227420.0, "source": "https://www.nbcnews.com", "summary": ""}