{"url": "https://tv.avclub.com/reunions-and-returns-dominate-as-game-of-thrones-marche-1798188245", "text": "This Game Of Thrones review is written for those who have read George R.R. Martin’s A Song Of Ice And Fire. It will not explicitly spoil events from those books that have not yet been adapted into the series, but it will address events from the books more broadly in the interest of exploring the process of adapting them into a series. More explicit spoilers for (potential) future events will come in a separate section at the end of the review. All discussion in the comments is valid, up to and including the events of the fifth book, but we ask that you clearly mark spoilers just in case (although we acknowledge that this is less relevant now than it was before the show “caught up.”) For those who have not read the books, you can read if you would like, but proceed with caution following the spoiler warning, and check out our reviews for newbies. Since critics won’t be receiving screeners this season, each week I’ll publish the episode page once the broadcast ends and add my review to the page when I finish.\n\nOne of the distinctive qualities of reading A Song Of Ice And Fire is the stretches you can go without checking in with certain characters. Even if you discount the wait between books, and the absence of certain characters in A Feast For Crows and the early chapters of A Dance With Dragons, you often go considerable lengths within a given book without seeing certain characters thanks to the POV chapter structure. And so while we could focus on Bran’s absence from A Feast For Crows—mirrored by his absence in season five—we could also focus on his absence for a 21-chapter stretch in A Dance With Dragons.\n\nAdvertisement\n\nReading the books, though, I got used to these absences. While I would sometimes get impatient if I went too long between certain characters’ chapters—although this was not the case with those ADWD Bran chapters—I didn’t find myself spending each chapter wondering what those characters were up to. The singular focus of the chapters is incredibly immersive, reconnecting you to a location, a set of characters, and a situation, and then spending a decent amount of time there.\n\nBy comparison, though, the show can’t necessarily do the same. Although episodes like “Blackwater,” “The Watchers On The Wall,” and “Hardhome”—among others—have replicated this tight focus on a single scenario, most episodes jump between stories often, rarely creating the same sense of immersion. Accordingly, however, it becomes less viable for the show to ignore a character for extended periods without the audience starting to ask questions. Those questions are not necessarily a problem—it gives the show a point of dramatic interest, provided that their return explains the missing time and reactivates our interest in the character. But for me, absences are more notable on the show than they were in the books, where the disappearances could be explained away as a byproduct of Martin’s chosen structure.\n\nLittlefinger’s absence in the first part of this season was somewhat odd. More than any other character, Game Of Thrones has famed Petyr Baelish as someone who is always making moves, which makes his absences more notable than when Yara Greyjoy disappeared for over a season, or when we don’t check into Dorne for three consecutive weeks. It was entirely reasonable to presume that the show was just going to write out the Greyjoy storyline, for example, but we knew there was no chance that Littlefinger wasn’t going to involve himself in the coming conflict. And given how quickly the character has teleported around Westeros in the past, it didn’t make sense that he would have spent so long in transit, and thus knowing he would be appearing in this week’s episode I wondered what he might have been up to offscreen.\n\nThe answer was very little. Littlefinger drops in to visit Lord Robin, delivering him a name day gift of a falcon and using his mind games to convince Lord Royce and the Knights of the Vale to ride north to assist Sansa in her fight against Ramsay. And that’s it. What has Littlefinger been doing in the time that has passed in the season so far, as other characters have made crucial steps forward in their respective journeys? He’s been in his cart, accomplishing nothing more than a falcon purchase along the way, apparently. After hoping that his absence would lead to the start of a meaningful new storyline, the brief scene we get from Littlefinger more or less justifies the decision to ignore the character: whatever long game he’s playing with the Vale, it remains almost remarkably insignificant as far as the central narrative is concerned. And therein lies the danger in keeping someone off-screen for too long: when you bring them back just to remind us they’re alive, it only serves to remind us they’re not being utilized.\n\nAdvertisement\n\nWe will see in the weeks to come how the show manages the similar return of the Ironborn, but Theon’s reunion with Yara helps anchor the story in the character we’ve spent the most time with (and which the show resisted sidelining as the books did, albeit mainly to begin the seemingly unending parade of evidence to make absolute certain we know that Ramsay is a terrible person which—we get it already). Yara may not register as a major character, but the show made good use of their tragic last meeting where he refused her rescue, and the Kingsmoot now feels like something tied into the ongoing narrative rather than something more tangential, something that is likely to continue should the ships be heading east in the weeks to come.\n\nObviously, though, “Book Of The Stranger” is most powerful for its other sibling reunion, as two of the Starks finally reunite. It’s a great choice for a first reunion precisely because it’s not the reunion we would have wanted. Jon was closest to Arya out of his remaining siblings, and arguably it is also Arya who would have the more emotionally complicated reunion with Sansa as well. But Jon and Sansa were not close: he was sullen and removed, she was judgmental, and they never really bonded. And yet war has done things to them that make their reunion just as emotional as if they had been best friends, and perspective that helps them look back on the kids they were and wonder how things might have been different. They’re also two people who have complex relationships with the concept of leadership, and who are each at key turning points that temporarily take them in the opposite directions: Jon is tired of being a leader, and Sansa is tired of following orders.\n\nAdvertisement\n\nThere is not a great deal of elegance in the show’s introduction of the Pink Letter, or some variation of it. While some speculated the show was playing some type of game with Rickon and Osha being held captive, Ramsay quickly murders Osha to remove any chance of this having been a cunning plan on behalf of Rickon’s protector. The scene sells Osha short, and seems an ignoble end, but it creates the impulse for Sansa, Jon, and the Wildlings to get on the same page regarding marching on Winterfell. But the way that happens is subtle and smart: Jon doubts the veracity of Ramsay’s claims, and balks at reading the more hateful and grotesque threats it contains, but it’s Sansa who knows it’s true, and it’s Sansa who reads the rape threat and everything after it. While I’m delighted by this group regardless of how they came together—Melisandre and Brienne on the same side? Tormund smitten with Brienne? Podrick and Davos along for the ride?—the scene makes the bald setup of Littlefinger’s entrée into the affair all the more bald.\n\nAdvertisement\n\nIt’s also a reminder that as much as these characters have gone through, no one truly understands the other. After Missandei raises an eyebrow at Tyrion claiming that he was a slave for “long enough to know” how bad it was, she correctly notes it was “not long enough to understand.” And the same goes for Jon and Sansa: she can’t know the depths of his experiences at and beyond the Wall (I presume he skipped over the resurrection, although we can debate that in the comments), but he also can’t pretend to understand what happened to her at Winterfell (like the fact that the threat of rape has already been carried out before). The more characters reunite as the series draws to a close—and I expect many more reunions like this one—the more we will see characters articulating the distinction between “knowing” and “understanding” what has happened to them.\n\nWe could view the events in King’s Landing through this lens, as the threat of Margaery’s walk of shame pushes the Tyrells and Kevan into an alliance with Cersei and Jaime, or as Margaery consoles a damaged Loras who may be too far gone at the hands of the Faith Militant to move forward. But this story, more than the others in the episode, is being left fairly opaque. I feel like we know little and understand even less, as we’re seeing such selective moments in each character’s journey. The High Sparrow is a master wordsmith, demonstrating a clear understanding of how to break down privilege and tap into more basic human decency, but his agenda remains incredibly cryptic even as he’s made some pretty decent sense with both Tommen and Margaery in recent weeks. And while we see Tommen tell Cersei a secret, we don’t [definitively] learn what it is, or how it inspires her to parlay with the Queen of Thorns and Kevan. [Note: based on the comments, it’s clear that I wasn’t clear when I wrote this sentence. We know what the show implies the secret was: that Margaery was going to make a walk of atonement. I just read the scene in ambiguous ways, believing—and perhaps overthinking—that Cersei was being dishonest when she spoke with Kevan. We’ll see next week if my concerns is warranted, but that’s the nature of this comment.] It is here where the “knowing” and “understanding” run into problems as a book reader, where the story seems to be veering away from the presumed path (more on that below).\n\nAdvertisement\n\nBut the central philosophical conflict in the episode comes between Daenerys and the dwarf left behind to run her city. While aided at times by stealth and strategy, Daenerys has largely taken her power by force, and sees leadership through the lens of absolutes. But as Tyrion takes over Meereen, a city beset with problems created by Daenerys’ inability to keep slavery at bay outside of Meereen and the rise of the Sons of the Harpy, he is choosing to adopt a diplomatic approach more common in Westeros. In the process, as Missandei’s objection notes, he is complicating the rhetoric of freedom Daenerys stressed when she took power, and compromising the place of Grey Worm and Missandei as they are forced to support Tyrion’s plan to other former slaves. The moral compromise they’re making is central to leadership, but that compromise is somewhat lost on Tyrion, the outsider looking in. Meereen needed an outsider’s perspective in order to solve its problems, but that does not mean that the solution will come at no cost, as Tyrion has no doubt discovered before in his diplomatic efforts.\n\nAdvertisement\n\nBut even as “Book Of The Stranger”—so-named for the one of the seven that people rarely pray to—demonstrates the value of diplomacy, it also ends with Daenerys going back to her old bag of tricks. Much as with the Starks’ reunion, Daenerys’ return to Vaes Dothrak is about coming full circle, and reflecting on the show’s past. And in a microcosm of the character’s journey thus far, she asserts her authority over those who wish to control her, uses fire to eliminate her enemies, and then stages a theatrical moment amidst the flames that only adds to her growing legacy. There is no diplomacy here, replaced with theatricality and a belief in the power of shock and awe.\n\nIt’s an impressive scene, and manages to give Daenerys control over the entirety of the Dothraki (which is likely where Martin was heading in the books as well), but it’s not enough to rule Westeros. In pairing Tyrion and Dany in one of the show’s first major character convergences last season, the writers drew an important contrast: the statesman who knows how to rule, and the queen who knows how to conquer. Much as Jon and Sansa need one another to conquer the North, Tyrion and Dany need one another if they ever intend to lead Westeros. In fact, more than ever before, it’s becoming clear that all of our “heroes”—here defined as characters in Westeros who have any shred of decency—need one another in one way or another for the coming war with the threat that has remained offscreen since the season began: the White Walkers and their undead army, who remain at large waiting to reemerge at the least opportune time.\n\nAdvertisement\n\nAnd something tells me we won’t be forgetting about them anytime soon.\n\nStray observations\n\nSo speaking of things happening off-screen: Davos had never asked Melisandre what happened to Stannis and Shireen? That seems incredibly unlikely to me, but it gives Brienne a chance to break the news she murdered him, and create some productive tension. But I know many wondered why Davos would be willing to work with Melisandre given Shireen’s fate, so here’s your answer: he never got the full story.\n\n\n\nAlong similar lines: do we think Jon told Sansa about being resurrected? How would you even tell that story to Sansa, who has been witness to no magic or zombies or anything like it? I have questions.\n\n\n\nI’ll miss Dolorous Edd when we move away from Castle Black, as his eyebrow raise at Tormund eyeing Brienne was a nice reminder of the levity that could exist on the Wall at a time.\n\n\n\nKingsmoot Korner: I was interested to see no major setup for Euron here—it’s possible the Kingsmoot is further away than I thought (I didn’t get the preview for next week in Canada), but I expected a bit more time with the character before we dive right into Theon and Yara’s partnership.\n\n\n\nI was interested to see no major setup for Euron here—it’s possible the Kingsmoot is further away than I thought (I didn’t get the preview for next week in Canada), but I expected a bit more time with the character before we dive right into Theon and Yara’s partnership. I wonder if they killed Shaggydog just so they would only have to CGI three direwolves in the epic final battle of the entire series—they’ve got to be thinking ahead at this point. (And yes, Nymeria is going to be there. I WILL NOT BELIEVE OTHERWISE.)\n\n\n\nAlthough Emilia Clarke has stepped away from providing recurring nudity in the way she did in the first season, she confirmed to EW\n\nAdvertisement\n\nThe Night Is Dark And Full Of Spoilers (Or Informed Speculation, At Least)\n\nSo do we think this is the end of the CleganeBowl dreams?\n\nIt’s an interesting question. The show appears to be ramping up the King’s Landing storyline to some type of conflict ahead of Cersei’s trial, there has been no mention of trial by combat necessarily being a key climax for the storyline, and there has been zero groundwork laid for Sandor’s surprise return. All of this would seem to steer away from CleganeBowl as a viable option.\n\nAdvertisement\n\nHowever, the show has very much resisted making the Faith Militant overly villainous, with the High Sparrow’s points about class quite reasonable even if his tactics are not. And it would be an interesting comeuppance for the Lannisters if the Hound emerged having cleansed himself of his sin, having walked away from his life of privilege and knighthood to embrace a simpler existence much as the High Sparrow did. And they did go through the hassle of introducing Zombie Gregor. And so we see a case where, similar to Lady Stoneheart, the thematic groundwork is there but the narrative structure remains missing. I’m curious to know where book readers stand on the odds with this one—are there odds? Do people wager on this? I have to think someone, somewhere, is doing Game Of Thrones prop bets.", "images": ["https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/f5zr3vuc90hrpnmx0nme.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,fl_progressive,g_center,h_264,q_80,w_470/b79608df135ebc4b059a2cdad3a83176.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/kqnkjlylkf7tymsqmoqr.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/52a29fe0001de9a08e76ea6d559528e9.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/u0939doeuioaqhspkjyc.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/j59upeyynundqjvbmcwj.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/v4sckews2f3bzf0ztbkf.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/aqhdzcldymb9mkltfhxh.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/rnxqtvv6advgidzfs6am.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/f2b6295902a8e0a7c4d168840e7b3d51.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/eti2h1r4wg0bqxctxenl.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/muaaluj2wznfomol9ero.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/no63bw902mddhwxtjtxh.png"], "top_img": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png", "keywords": [], "authors": [], "canonical_link": "https://www.avclub.com/reunions-and-returns-dominate-as-game-of-thrones-marche-1798188245", "title": "Reunions and returns dominate as Game Of Thrones marches on (experts)", "meta_data": {"google-site-verification": "QDPLbDJXTQNT0n69mvNADCeRmwnbkYyL20OKJAVCKq8", "ir-site-verification-token": "-1270174611", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0,maximum-scale=10.0", "ROBOTS": "INDEX, FOLLOW, NOIMAGEINDEX", "msapplication-square70x70logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/no63bw902mddhwxtjtxh.png", "msapplication-square150x150logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_200,q_80,w_200/no63bw902mddhwxtjtxh.png", "keywords": "TV, Game Of Thrones, Game Of Thrones (experts), Recap, The A.V. Club", "news_keywords": "TV, Game Of Thrones, Game Of Thrones (experts), Recap, The A.V. Club", "twitter": {"url": "https://www.avclub.com/reunions-and-returns-dominate-as-game-of-thrones-marche-1798188245", "card": "summary_large_image", "site": "theavclub", "title": "Reunions and returns dominate as Game Of Thrones marches on (experts)", "description": "This Game Of Thrones review is written for those who have read George R.R. Martin’s A Song Of Ice And Fire. It will not explicitly spoil events from those books that have not yet been adapted into the series, but it will address events from the books more broadly in the interest of exploring the process of adapting…", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png"}, "article": {"published_time": "2016-05-16T02:06:00.245Z", "modified_time": "2018-07-20T17:07:45.951Z"}, "description": "This Game Of Thrones review is written for those who have read George R.R. Martin’s A Song Of Ice And Fire. It will not explicitly spoil events from those books that have not yet been adapted into the series, but it will address events from the books more broadly in the interest of exploring the process of adapting…", "og": {"title": "Reunions and returns dominate as Game Of Thrones marches on (experts)", "type": "article", "url": "https://www.avclub.com/reunions-and-returns-dominate-as-game-of-thrones-marche-1798188245", "description": "This Game Of Thrones review is written for those who have read George R.R. Martin’s A Song Of Ice And Fire. It will not explicitly spoil events from those books that have not yet been adapted into the series, but it will address events from the books more broadly in the interest of exploring the process of adapting…", "locale": "en_US", "site_name": "The A.V. Club", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png"}, "fb": {"app_id": 1621890511466174, "pages": 39581755672}}, "movies": [], "publish_date": 1463364360.245, "source": "https://tv.avclub.com", "summary": ""}