{"url": "https://www.cbsnews.com/pictures/most-expensive-weddings-of-all-time/7/", "text": "Entertainment Most expensive weddings of all time\n\n\n\n\n\nAFP/Getty Images It wasn't dubbed the \"wedding of the century\" for nothing. Lady Diana Spencer wed Charles, Prince of Wales, on July 29, 1981. Di's dress was a pricey $13,000, but the biggest expense was security and crowd control, which they spent $600,000 on, making the total cost of the wedding close to $70 million in today's dollars.\n\n\n\nAccording to TheKnot.com, the typical wedding costs around $28,000, though many people -- particularly celebrities -- tend to go way above and beyond that budget.\n\n\n\nClick through to see some of the other most extravagant and expensive weddings in recent history. Though if this list teaches any lesson, it's that throwing down more cash doesn't equal wedded bliss -- the majority of the married couples on this list didn't live happily ever after. It wasn't dubbed the \"wedding of the century\" for nothing. Lady Diana Spencer wed Charles, Prince of Wales, on July 29, 1981. Di's dress was a pricey $13,000, but the biggest expense was security and crowd control, which they spent $600,000 on, making the total cost of the wedding close to $70 million in today's dollars.According to TheKnot.com, the typical wedding costs around $28,000, though many people -- particularly celebrities -- tend to go way above and beyond that budget.Click through to see some of the other most extravagant and expensive weddings in recent history. Though if this list teaches any lesson, it's that throwing down more cash doesn't equal wedded bliss -- the majority of the married couples on this list didn't live happily ever after.\n\nSheikh Mohammed bin Zayed Al Nahyan and Princess Salama Sean Gallup/Getty Images In the priciest modern-day wedding to date, this prince of Abu Dhabi had a 20,000-seat stadium specially built for his seven-day wedding to Princess Salama in 1981. This wedding fit for a king cost a whopping $100 million. In the priciest modern-day wedding to date, this prince of Abu Dhabi had a 20,000-seat stadium specially built for his seven-day wedding to Princess Salama in 1981. This wedding fit for a king cost a whopping $100 million.\n\nSalma Hayek and Francois-Henri Pinault Bertrand Rindoff-Petroff/AP The couple's 2009 nuptials were held in the famous Venice opera house Teatro La Fenice, and the star-heavy guest list included Bono, Penelope Cruz and Woody Harrelson, who helped lead the attendees in singing \"Over the Rainbow.\" The final tally for Hayek and Pinault's big day was $3.5 million. The couple's 2009 nuptials were held in the famous Venice opera house Teatro La Fenice, and the star-heavy guest list included Bono, Penelope Cruz and Woody Harrelson, who helped lead the attendees in singing \"Over the Rainbow.\" The final tally for Hayek and Pinault's big day was $3.5 million.\n\nCatherine Zeta-Jones and Michael Douglas Odd Andersen/AFP/Getty Images It may have not been an official Hollywood affair, but it certainly had all the glamour of a tinseltown event. In addition to a 40-member Welsh choir singing, the ceremony included performances by Jimmy Buffett and Art Garfunkel. Among the 350 guests present at the 2000 $1.5 million nuptials were Goldie Hawn, Jack Nicholson, Meg Ryan and former U.N. Secretary General Kofi Annan. It may have not been an official Hollywood affair, but it certainly had all the glamour of a tinseltown event. In addition to a 40-member Welsh choir singing, the ceremony included performances by Jimmy Buffett and Art Garfunkel. Among the 350 guests present at the 2000 $1.5 million nuptials were Goldie Hawn, Jack Nicholson, Meg Ryan and former U.N. Secretary General Kofi Annan.\n\nElizabeth Hurley and Arun Nayar Getty Images When you have two wedding ceremonies, the tab is bound to be high. Hurley and business tycoon Nayar threw a traditional Anglican wedding in an English castle, followed by a week of celebrations and a Hindu ceremony in Nayar's hometown of Jodhpur, India. Too bad two ceremonies and $2.5 million couldn't make this couple last. When you have two wedding ceremonies, the tab is bound to be high. Hurley and business tycoon Nayar threw a traditional Anglican wedding in an English castle, followed by a week of celebrations and a Hindu ceremony in Nayar's hometown of Jodhpur, India. Too bad two ceremonies and $2.5 million couldn't make this couple last.\n\nPaul McCartney and Heather Mills Ralph Orlowski/Getty Images Sir Paul didn't skimp on his second marriage to Mills, putting down $3 million on their 2002 wedding. Their union, however, only lasted six years, so their big day cost the Beatle $500 grand for every year they were married -- a hefty price considering McCartney later called their marriage the \"mistake of the decade.\" Sir Paul didn't skimp on his second marriage to Mills, putting down $3 million on their 2002 wedding. Their union, however, only lasted six years, so their big day cost the Beatle $500 grand for every year they were married -- a hefty price considering McCartney later called their marriage the \"mistake of the decade.\"\n\nKim Kardashian and Kris Humphries CBS In what may go down as the most expensive short-lived wedding in history, Kardasian's 72-day-marriage cost a reported $10 million, of which the cake cost $20,000 -- almost as much as most weddings total. In what may go down as the most expensive short-lived wedding in history, Kardasian's 72-day-marriage cost a reported $10 million, of which the cake cost $20,000 -- almost as much as most weddings total.\n\nLiza Minnelli and David Gest Robert Mecea/AP The fourth time was not a charm for Minnelli, whose 2002 wedding to Gest only lasted a year and a half. But she certainly paid for that year and a half -- $3.5 million to be exact. Though with Michael Jackson serving as best man and famous names like Elton John and Barbara Walters in attendance, we wouldn't expect anything less for this lavish affair. The fourth time was not a charm for Minnelli, whose 2002 wedding to Gest only lasted a year and a half. But she certainly paid for that year and a half -- $3.5 million to be exact. Though with Michael Jackson serving as best man and famous names like Elton John and Barbara Walters in attendance, we wouldn't expect anything less for this lavish affair.\n\nChelsea Clinton and Marc Mezvinsky Genevieve de Manio/Getty Images Clinton's 2010 nuptials took place in front of 400 guests at the Astor Courts estate in New York, built originally for John Jacob Astor IV. The bride wore Vera Wang (who was in attendance) to her $5 million affair, which boasted a 5-foot, gluten-free wedding cake. Clinton's 2010 nuptials took place in front of 400 guests at the Astor Courts estate in New York, built originally for John Jacob Astor IV. The bride wore Vera Wang (who was in attendance) to her $5 million affair, which boasted a 5-foot, gluten-free wedding cake.\n\nTom Cruise and Katie Holmes Robert Evans/Getty Images How much does it cost to get married at an Italian Castle, have the entire wedding party wear Armani, have a fireworks display and Andrea Bocelli perform? $2 million. Though that apparently couldn't buy the couple happiness, as their 2006 marriage came to a close last year. How much does it cost to get married at an Italian Castle, have the entire wedding party wear Armani, have a fireworks display and Andrea Bocelli perform? $2 million. Though that apparently couldn't buy the couple happiness, as their 2006 marriage came to a close last year.\n\nDavid Beckham and Victoria Adams James Maloney (book cover) The 1999 wedding of former Spice Girl Victoria Adams and soccer stud David Beckham reportedly cost $800,000 -- which seems modest for this list, but the fact that it was 1999 must be considered. And the couple were anything but modest on their big day -- they sat on golden thrones at the altar, and their cake was topped with nude figures of the couple. Talk about posh. The 1999 wedding of former Spice Girl Victoria Adams and soccer stud David Beckham reportedly cost $800,000 -- which seems modest for this list, but the fact that it was 1999 must be considered. And the couple were anything but modest on their big day -- they sat on golden thrones at the altar, and their cake was topped with nude figures of the couple. Talk about posh.", "images": ["https://assets1.cbsnewsstatic.com/hub/i/r/2013/05/24/55cd5d3d-d273-11e2-a43e-02911869d855/thumbnail/620x423/a1a47e4f282bb0338b2b6036d44cbc9d/138690135.jpg", "https://assets1.cbsnewsstatic.com/hub/i/r/2010/12/13/5497b30b-d273-11e2-a43e-02911869d855/thumbnail/620x465/7a8a37679ab207e0c40c408d6a50c8ae/101322045.jpg", "https://assets3.cbsnewsstatic.com/hub/i/r/2013/05/24/5390d9c5-d273-11e2-a43e-02911869d855/thumbnail/620x450/3faf8e959ced1ee8ce360a6cd24bed9d/52995501.jpg", "https://assets3.cbsnewsstatic.com/hub/i/r/2011/11/01/52b1cada-d273-11e2-a43e-02911869d855/thumbnail/620x465/5dbda84dea0c77f218378d3090242577/es_kardashian_1101.jpg", "https://assets1.cbsnewsstatic.com/hub/i/r/2013/05/24/51ff83b9-d273-11e2-a43e-02911869d855/thumbnail/620x471/a47e7122364183352dfd6cb3e65856d8/AP02031603040.jpg", "https://assets1.cbsnewsstatic.com/hub/i/r/2013/05/24/557b83ca-d273-11e2-a43e-02911869d855/thumbnail/620x398/894bd2a90f998b904cd020269009bf1b/140151393.jpg", "https://assets3.cbsnewsstatic.com/hub/i/r/2013/05/24/e37f795d-d250-11e2-a43e-02911869d855/thumbnail/620x413/2f11c1449f9c9d015331c8c725cd5aad/103183718.jpg", "https://assets1.cbsnewsstatic.com/hub/i/r/2011/04/29/50a9a8c8-d273-11e2-a43e-02911869d855/thumbnail/620x465/3672cdaf30607c0fc4bea6ec51f8d056/royalwedding_kate_will_alter_smile.jpg", "https://assets2.cbsnewsstatic.com/hub/i/r/2013/05/24/55cd5d3d-d273-11e2-a43e-02911869d855/thumbnail/1200x630/764b114deb22f38a01cfd127566a3c27/138690135.jpg", "https://assets2.cbsnewsstatic.com/hub/i/r/2012/06/29/51a9e1d5-d273-11e2-a43e-02911869d855/thumbnail/620x933/311f2565152debb5b73e655625191b83/72600798.jpg", "https://assets3.cbsnewsstatic.com/hub/i/r/2013/05/24/55098da1-d273-11e2-a43e-02911869d855/thumbnail/620x958/19aefae5303a2388b16797f2e51e08e0/52908542.jpg", "https://assets2.cbsnewsstatic.com/hub/i/r/2013/05/24/552b72ec-d273-11e2-a43e-02911869d855/thumbnail/620x930/0e6d5106b9a1c59b9f269321e3ff5628/AP090425031912.jpg", "https://assets2.cbsnewsstatic.com/hub/i/r/2013/05/24/518103ec-d273-11e2-a43e-02911869d855/thumbnail/620x803/6f6ec768db4717c913a605b5e4f6de52/Beckham_51SJQBYAK6L.jpg"], "top_img": "https://assets2.cbsnewsstatic.com/hub/i/r/2013/05/24/55cd5d3d-d273-11e2-a43e-02911869d855/thumbnail/1200x630/764b114deb22f38a01cfd127566a3c27/138690135.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.cbsnews.com/pictures/most-expensive-weddings-of-all-time/", "title": "Most expensive weddings of all time", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1, user-scalable=0", "color-scheme": "only light", "robots": "index, follow, max-image-preview:large", "description": "From Will and Kate to Tom Cruise and Kate Holmes, here are some of the other most extravagant and expensive weddings in recent history", "al": {"web": {"url": "https://www.cbsnews.com/pictures/most-expensive-weddings-of-all-time/"}, "ios": {"app_name": "CBS News", "app_store_id": 334256223, "url": "cbsnewsapp://cbsnews.com/pictures/most-expensive-weddings-of-all-time/"}, "android": {"app_name": "CBS News", "package": "com.treemolabs.apps.cbsnews", "url": "cbsnewsapp://cbsnews.com/pictures/most-expensive-weddings-of-all-time/"}}, "og": {"type": "article", "url": "https://www.cbsnews.com/pictures/most-expensive-weddings-of-all-time/", "title": "Most expensive weddings of all time", "description": "From Will and Kate to Tom Cruise and Kate Holmes, here are some of the other most extravagant and expensive weddings in recent history", "image": {"identifier": "https://assets2.cbsnewsstatic.com/hub/i/r/2013/05/24/55cd5d3d-d273-11e2-a43e-02911869d855/thumbnail/1200x630/764b114deb22f38a01cfd127566a3c27/138690135.jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 1536620209892267, "pages": 131459315949}, "article": {"publisher": "https://www.facebook.com/CBSNewsEntertainment/", "content_tier": "free", "opinion": "false"}, "twitter": {"dnt": "on", "app": {"country": "US", "name": {"iphone": "CBS News", "ipad": "CBS News", "googleplay": "CBS News"}, "id": {"iphone": 334256223, "ipad": 334256223, "googleplay": "com.treemolabs.apps.cbsnews"}, "url": {"iphone": "cbsnewsapp://cbsnews.com/pictures/most-expensive-weddings-of-all-time/", "ipad": "cbsnewsapp://cbsnews.com/pictures/most-expensive-weddings-of-all-time/", "googleplay": "cbsnewsapp://cbsnews.com/pictures/most-expensive-weddings-of-all-time/"}}, "site": "@CBSNews", "title": "Most expensive weddings of all time", "description": "From Will and Kate to Tom Cruise and Kate Holmes, here are some of the other most extravagant and expensive weddings in recent history", "image": "https://assets2.cbsnewsstatic.com/hub/i/r/2013/05/24/55cd5d3d-d273-11e2-a43e-02911869d855/thumbnail/1200x630/764b114deb22f38a01cfd127566a3c27/138690135.jpg", "card": "summary_large_image"}, "theme-color": "#101010", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "CBS News", "apple-mobile-web-app-status-bar-style": "black"}, "movies": [], "publish_date": null, "source": "https://www.cbsnews.com", "summary": ""}