{"url": "people.com/tv/kim-kardashian-robbery-questions-answered/", "text": "One year later, many of the details about the terrifying ordeal that Kim Kardashian West went through when she was robbed in Paris on Oct. 3, 2016, have been revealed. But there were still plenty of lingering questions about the whole situation right after it occurred: How was she doing? Were her kids aware? And how did Kanye West deal with the aftermath?\n\nHere are the answers to many of the questions about the scary events that unfolded.\n\nWHAT HAPPENED, IN KIM'S WORDS:\n\nKim's harrowing first-hand account of the crime was revealed in police reports she filed to French authorities around 4:30 a.m. on Oct. 3 — just hours after she escaped from her restraints and called for help.\n\nAccording to French newspaper Le Journal du Dimanche, she explained in the report that she returned to her hotel with her sister Kourtney Kardashian and stylist Simone Harouche. She told police that Kourtney and her assistant Stephanie Sheppard changed clothes as they prepared for a night out, but she wasn't joining them and went upstairs to work on her computer.\n\n\"I heard a noise at the door, like footsteps, and I shouted, asking, 'Who's there?'\" she said, according to the report. \"No one answered. I called my bodyguard at 2:56 a.m. Through the door, I saw two people arrive, plus the night man who was tied up.\"\n\nThe two men apparently had police paraphernalia and one individual wore ski goggles. \"It's the one with the ski goggles who stayed with me,\" she said, according to the report. \"He demanded with a strong French accent, my ring. It was on the bedside table. It's worth $4 million.… I told him that I didn't know, he took out a gun and I showed him the ring.\"\n\nShe continued, according to the report: \"They grabbed me and took me into the hallway. I was wearing a bathrobe, naked underneath. Then we went in the room again and they pushed me on the bed. And, it was this time, they tied me up with plastic cables and taped my hands, then they put tape over my mouth and my legs.\"\n\nKim also reportedly described in detail what had been taken from her room: two diamond Cartier bracelets, a gold and diamond Jacob necklace, Lorraine Schwartz diamond earrings, a gold Rolex and other items. \"I think they robbed me of 5 million dollars,\" she said. \"Then they left on the run.\"\n\nThe new season of Keeping Up with the Kardashians will also cover the incident, with the reality star publicly opening up about the ordeal for the first time.\n\nSource: EOnline.com\n\n\"They ask for money. I said I don't have any money,\" she tearfully tells her sisters in a clip from the second episode. \"They dragged me out on to the hallway on top of the stairs. That's when I saw the gun clear, like clear as day. I was kind of looking at the gun, looking down back at the stairs.\"\n\n\"I was like; 'I have a split second in my mind to make this quick decision,'\" she recalls. \"Am I going to run down the stairs and either be shot in the back? It makes me so upset to think about it. Either they're going to shoot me in the back, or if I make it and they don't, if the elevator does not open in time, or the stairs are locked, then like I'm f---ed. There's no way out.\"\n\nWHY WASN'T HER BODYGUARD THERE?\n\nThe No. 1 question that seemed to be on everyone's mind after reports of the star's terrifying ordeal broke seemed to be: Where was her (seemingly omnipresent) bodyguard when it happened?\n\nIn the days leading up to the robbery, Pascal Duvier was right by Kim's side on the streets of Paris — she even joked about him \"always being in my shot\" on Instagram — and helped thwart prankster Vitalii Sediuk after he attempted to grab the reality star on the street. So why wasn't he in her room the night of the robbery?\n\nHe was looking after Kim's sisters, Kourtney and Kendall, as they hit the town in Paris: \"It wouldn't be that strange for Pascal to be dispatched to be with Kourtney or the other family members once Kim was 'safely' in her residence,\" a source close to the family told PEOPLE. \"And he regularly provides security for the whole family — not just Kim.\"\n\nAKM-GSI\n\nAnd though there isn't much security on site at the hotel — \"As I recall, there's a receptionist downstairs who buzzes you through the door in the courtyard and a nightman,\" a former guest told PEOPLE — Kim felt safe at the No Address Hotel, especially since her husband had maintained a semi-permanent residence there since at least 2011.\n\nWHAT HAPPENED TO HER BODYGUARD?\n\nIn the days following the robbery, questions arose surrounding Kim's lack of security … and the fate of family bodyguard Duvier. While a source told PEOPLE the Spain-born German bodyguard continued to work for them, they added that Duvier \"isn't irreplaceable.\"\n\n\"The family really likes him, but he is not a family member,\" said the insider. \"Kanye is evaluating his family's needs. He is ultimately the one who decides what happens with Pascal.\"\n\nMehdi Taamallah/NurPhoto/Getty\n\nDuvier remained employed by the family directly after the incident until Kim and Kanye parted ways with him one month after the robbery.\n\n\"Pascal no longer works for Kim and Kanye, but he wasn't fired,\" a source told PEOPLE. \"He instead reassigned himself to another family for professional reasons. Pascal thought that he did let down Kim and didn't do his job properly in Paris. They all agreed that it was better for Kim and Kanye to hire a completely new security team.\"\n\nDID SHE BEEF UP HER SECURITY TEAM AFTER THE INCIDENT?\n\nDefinitely — Kim significantly upped her security detail and a source close to the family revealed that she now has a \"much heavier security team.\"\n\n\"There will be a focus on security personal who aren't in traditional clothing,\" an insider told PEOPLE. \"There will be a lot more undercover security.\"\n\nThe entire Kardashian-Jenner family also cut down on public appearances for a short time after Kim's ordeal, as well as upped their own security.\n\n\"When something like this happens, everything changes,\" a source told PEOPLE. \"It changes the whole family — how and where they travel.\"\n\nHOW DID THE ROBBERS GET IN?\n\nThe thieves' first point of entry came via the concierge at the No Address, whom she described to police as eerily calm, according to a PEOPLE source. According to the insider, Kim told police the nightman was handcuffed when he opened the door to her apartment, he was present for the entire incident and even engaged in a conversation with her.\n\nAccording to the source, Kim told police the robbers took the concierge with them when they left and deposited him in the lobby with his hands still cuffed.\n\nHOW DID SHE MANAGE TO ESCAPE?\n\n\"They put plastic ties around her wrists, but she managed to squeeze her hands out of the wrist ties by wriggling her hands,\" a source close to Kim told PEOPLE. After escaping, a second source told PEOPLE that Kim \"screamed from the balcony\" for help.\n\nWAS ANYONE ELSE IN THE HOTEL WITH HER?\n\nThough Kim was alone in her hotel room — which she revealed when she Snapchatted herself FaceTiming brother Rob Kardashian and Blac Chyna ahead of their baby shower — her good friend Harouche was in a nearby room during the ordeal.\n\n\"By the time [Kim] escaped, Simone had heard noises,\" a source told PEOPLE. \"She was downstairs and called Pascal not knowing what was going on, asking if everything was okay.\"\n\nHOW DID THE ROBBERS KNOW WHERE SHE WAS?\n\nIt's likely that the robbers, who were dressed as police officers when they broke into her room, had been tailing Kim before the crime. Sources confirmed to PEOPLE that authorities believe that they may have posed as paparazzi in order to keep her under surveillance in the days leading up to the attack.\n\n\"She's surrounded by paparazzi, any of whom could have given this information to others for a fee,\" Christopher Hagon, a managing partner at Incident Management Group, a Florida-based international security consulting firm, told PEOPLE. \"It's either an inside job, or she's been under surveillance. I think it's a blend of [both].\"\n\nKim herself has also said she believes the perpetrators tracked her via social media.\n\n\"There was probably a group of guys that were following us the entire trip,\" she says in an episode of the current season of KUWTK.\n\n\"I was Snapchatting that I was home and that everyone was going out,\" she explains. \"So I think they knew Pascal was out with Kourtney and that I was there by myself.\"\n\n\"They had to have known we were leaving that day,\" she adds. \"They had this window of opportunity and just went for it.\"\n\nWHERE WERE HER KIDS?\n\nThankfully, North, 3, and Saint, 14 months, were not involved in the terrifying incident. In fact, North was in New York, where she saw the Broadway musical Matilda hours before Kim was robbed.\n\n\"She was there with two other children, a nanny and a security person,\" a rep for the Shubert Organization, which owns and operates Broadway theaters, told PEOPLE. \"After the performance, they went backstage and met the children's ensemble and [the actress who played] Matilda … The kids were excited to meet her.\"\n\nWHAT'S THE LATEST IN THE INVESTIGATION?\n\nFrench police initially arrested 17 suspects in connection with the robbery across France on Jan. 9. Of the 17 arrested, 10 have been indicted and are now facing criminal charges.\n\nThe first four men were indicted on Jan. 12. The first, a 64-year-old man identified by Le Parisien/AFP, was charged with conspiracy and helping arrange the resale of stolen jewelry. His lawyer has denied any involvement of his client in the case.\n\nTwo more suspects, age 63 and 44, were indicted for conspiracy, robbery, kidnapping and forceable confinement. The 63-year-old suspect has been identified Yunice A., and the 44-year-old as Florus H.\n\nA fourth suspect, Gary M., age 27, identified as the younger brother of Kim's Paris chauffeur, also appeared before a French judge and was charged with assisting an armed robbery and kidnapping.\n\nFrench authorities indicted an additional six suspects on Jan. 13. — five men and one woman, who happen to be the more senior members of the suspects, ranging in age from 44 to 72.\n\nOne was a man identified as Omar A., dubbed \"Omar the Old,\" whom authorities presume was the \"mastermind\" behind the robbery. Investigators reportedly suspect it was his DNA that was found on the scene on adhesive tape and a plastic tie used to restrain the star.\n\nThe first lead French police had was a suspicious black car that was seen in the early hours of Monday morning circling the No Address.\n\nThe vehicle was caught on surveillance video from the Carel shop, which is located directly across from the hotel. A spokesperson from the business confirmed to PEOPLE that they turned the CCTV footage over to authorities immediately.\n\n\"The police were there at 10 a.m. Monday morning, waiting for the employees to come open the shop,\" the employee at the firm's headquarters said. \"They were canvassing the street and went directly in a backroom and viewed the tapes. We gave them over.\"\n\nThe Carel staffer also confirmed to PEOPLE that images of the footage obtained by British tabloids are accurate. They show the vehicle driving slowly past the hotel at 2:34 a.m., 2:45 a.m. and again at 2:54 a.m. Kim reportedly made a distress call for help from the balcony of her hotel and on the phone to Duvier at 2:56 a.m.\n\nWHAT HAPPENED TO HER JEWELRY?\n\nAccording to an expert, it's \"highly unlikely\" that Kim will see any of the millions worth of jewelry that was stolen (including that $4 million ring) ever again.\n\n\"What happens next is that these thieves will bring the diamonds and jewelry to somebody they already have lined up before they did this job — a fence,\" said jewelry theft expert and co-author of Flawless: Inside the Largest Diamond Heist in History, Scott Selby. \"What happens after that is the fence will take apart this jewelry, so that loses value — and now you have all these separate stones.\"\n\nSelby revealed that the jewels will most likely be taken apart, with the metals and medium and small stones being sold on the black market, where they'll likely end up in Antwerp, Belgium's diamond district, within weeks.\n\nInstagram\n\n\"Diamonds like that change hands five times in two days in Antwerp's diamond district,\" Selby said. \"Nobody will ever know … They will be on the fingers of Americans within six months to a year.\"\n\nAs for the larger stones? \"You have three choices,\" he said. \"You could either hold on to it, you can sell it to a buyer who is fine with it being stolen — which is very hard to find — or you can change the stones to make them unrecognizable. Anybody in the trade would be able to tell that these were Kim Kardashian's diamonds.\"\n\nHOW DID HER FAMILY REACT?\n\nKim reunited with her husband in New York City after leaving Paris just hours after the ordeal, and she was soon joined by mother Kris Jenner and her boyfriend Corey Gamble. Both couples were escorted by massive security details back to their Manhattan apartment. Sister Kourtney, meanwhile, arrived back home in L.A. a few days later, where she was flanked by two security guards as she made her way through Los Angeles International Airport.\n\nSharky/Polite Paparazzi/SPLASH\n\n\"Kim's family feels terrible about what happened to her,\" a source told PEOPLE, adding that husband West, 39, \"wanted to get to her as soon as he could.\"\n\n\"He told her that he couldn't care less about the jewelry; he's just thankful that she's okay,\" said the insider.\n\nBrother Rob, meanwhile, had been celebrating his baby shower with Chyna in L.A. Despite speaking with Kim directly before the incident, \"No one at the party knew of anything that happened to Kim because everyone's phones were taken,\" said the source. Rob found out about the robbery afterward and was \"extremely worried\" about his sister.\n\nHOW DID KIM REACT?\n\n\"Kim couldn't wait to leave Paris,\" a source told PEOPLE. \"She gave a statement to the police and left right after. She got robbed of her jewelry but doesn't care. She's just happy to be alive.\"\n\nIn the days directly following the heist, the reality star spent \"all her time with kids and Kanye\" and attempted to keep things \"as normal as possible,\" a source close to the family told PEOPLE.\n\nAnother source also said the star \"barely slept.\"\n\n\"She had no anxiety medication or alcoholic drinks, as she doesn't do any of that stuff,\" said the insider. \"She's just got comfort from being around her kids and friends. Her best friends rushed to her side: Jonathan Cheban, Simon Huck and La La Anthony. They have been her rocks.\"\n\nMultiple sources confirmed to PEOPLE that Kim was deeply shaken after the traumatic incident, and she went on to take a three-month hiatus from the public eye and social media. She has since stepped back into the spotlight and returned to social media on Jan. 6. In the months since she's gradually become more comfortable being photographed and attending events.\n\nRob Latour/Variety/REX/Shutterstock (\n\nOver Martin Luther King, Jr. weekend, Kim traveled to Dubai where she made her first official public appearance since the incident on Jan. 13, at her longtime makeup artist Mario Dedivanovic's Masterclass.\n\n\"Kim is starting to act more relaxed about public outings,\" a source told PEOPLE. \"She still uses a bodyguard every day, but isn't hiding. She lets herself be photographed. She seems more comfortable. She acted much more nervous right after the robbery.\"\n\nDID CUTTING BACK AFFECT HER INCOME?\n\nAfter the incident, Kim suspended all of her commitments indefinitely and a financial expert estimated that she would likely lose some substantial income — maybe more than \"$1 million a month\" in growth.\n\nCelebrity financial adviser Samuel Rad told PEOPLE that Kim's \"overall brand is generating at least $1 million a month through just general posts, not including anything that's specifically being contracted with companies,\" which is separate from special event appearances where he estimates she rakes in between $200,000 to $300,000.\n\nRad also estimated that her personal, non-ad-related posts \"are worth at least $20,000 a piece to her overall brand.\"\n\nHe speculated, however, that \"if Kim positions herself correctly [on her return], she can have a real blockbuster media score.\"\n\nWHAT DID IT ALL MEAN FOR KUWTK?\n\nE! initially halted production on KUWTK in the wake of the incident. \"Kim's well-being is our core focus right now,\" a spokesperson from the network said in a statement to PEOPLE the week of the robbery. \"No decision has been made as to when production will resume.\"\n\nWhile two sources told PEOPLE that filming continued with other family members, Kim didn't resume filming until three weeks after the incident. The incident will be heavily covered on the current season 13.\n\nDuring an appearance on The Ellen DeGeneres Show in February, Kim's mom Kris said returning to the show helped her daughter heal from the \"devastating\" incident.\n\n\"When we started filming again and getting up and running, obviously Kim was around because we all practically live together on the same street,\" she said. \"We started filming and what was coming out of that was very therapeutic for her, I think — to just explain to us and walk us through.\"\n\nKhloé Kardashian also touched on the family's decision to include the incident on their reality show during an interview with PEOPLE Now in January.\n\n\"Well, we are damned if we do and damned if we don't,\" she said. \"We are so vulnerable and [have opened] up our lives so much in the past that interestingly enough, if we don't show things fans get really angry — they feel as if that was taken away from them.\"\n\n\"And I think for Kim, it was maybe therapeutic for her,\" she added. \"It's also something that disgustingly happens to a lot of other people and we always come from a place of honesty.\"", "images": ["https://people.com/thmb/e06sR4a2mQ_WZZqNxJkcS1NBwvk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/kim-kardashian3-2000-004e0b81da554bee832868d65d9de2bc.jpg", "https://people.com/thmb/8AN1vaywhhQ8lTsTRMlUquci_GM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(399x0:401x2)/kourtney-kendall-8001-65bcd9d6e2ad4cc2b3b9088b7cad4b86.jpg", "https://people.com/thmb/FrRsOKUQVjJmfqO9y_kTR75QI50=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(785x0:787x2)/kimk-2000-59b241a9f1464e299feac42d9d38538d.jpg", "https://people.com/thmb/HfeHDguryw58OWe3xHMblBWjoeQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(841x817:843x819)/kim-kardashian-2-733cdc9d34754f7b99e193ea06fee9f5.jpg", "https://people.com/thmb/j1b7zpA-kQJztNQSzauLP1-EaWM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/kimk1-9176d9b233374bfe803690187e0279d1.jpg", "https://people.com/thmb/X4ow2crCBrUbOiA09zjyKr6BNO0=/1402x2000/filters:fill(auto,1)/kim-kardashian10-1-2000-19dafa41f7fa41b792c770bf6c22cab2.jpg", "https://people.com/thmb/KCCNaEGVAH3Az-bo6IGPGjZsxuQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/pascal-duvier-d6959b1a032c48a89f33fc8d0884d8ec.jpg", "https://people.com/thmb/Rj7xScFEwP5X5ujTFqk26NPwgNk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(741x0:743x2)/kim-kardashian4-2000-ece36fade92f4e3abce88cff5e00913f.jpg", "https://people.com/thmb/UdEL8UOIhec_T2UqDKBgakSkVOc=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/kim-snap-1500-ebda9c89c1984ce4ad89740f67f43029.jpg", "https://people.com/thmb/n2ordaa1f8rhQ5uiP3lfNqQlsSU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(780x419:782x421)/dorit-kemsley-2000-ea2d6d9d856d4bac9a359535167d69e0.jpg", "https://people.com/thmb/e7mOkrPMWfYsRg4somEzY2z371g=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/kim-kardashian5-99a8c7e4eebd4232964fb54289fb9278.jpg", "https://people.com/thmb/8cJmVZc7Ok6w5_4Wwxc14qmMsU4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/people_generic-1885945d8bd544778fbbf4be88a63f00.jpg", "https://people.com/thmb/TXvRSKHI7eQAz5LyePL5hh4suYI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(680x0:682x2)/kim-kardashian1-e1475435185860-2000-1d0d76df87844639a21ee2b6af7548f8.jpg", "https://people.com/thmb/MvUklpsYrmy2XxterWjPpMLFqXg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(675x0:677x2)/kim-kardashian-1-1999b8ec37254006ae6a34431a8efb41.jpg", "https://people.com/thmb/xPSARg5OMYYUU7HDLCgqsLze4IU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/spl1364652_001-59892b6cac6b423290683aa40b3d3357.jpg", "https://people.com/thmb/_2yjdx6IiD040hdUipCEPSLnSEA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/pete-davidson-b8354f52617249348d678dddb169304e.jpg", "https://people.com/thmb/xux-jZzSDOqGQGaCIfRG8F1WjOE=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(399x0:401x2)/kourtney-kendall-8001-65bcd9d6e2ad4cc2b3b9088b7cad4b86.jpg", "https://people.com/thmb/igoLT0IjJb9EX8XkbaESuBuP2Ns=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(299x0:301x2)/kim-kardashian-01-600x6001-c69ac1a5c916456a97ceaf228881168f.jpg", "https://people.com/thmb/Lje7sGaj3HgeS-yLg9z5JSNPfrU=/300x150/filters:no_upscale():max_bytes(150000):strip_icc()/people_magazine_sub-e6689738996d40f38f154099e1751481.png", "https://people.com/thmb/Taw3zZq5vpuu5IV8QrrurTEVQSw=/75x75/filters:no_upscale():max_bytes(150000):strip_icc()/blue-200ca6f36f3c4069a2930144e39a5035.jpeg", "https://people.com/thmb/iWpcyPAty4GlOpVlpGbKr0iSrkc=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/spl1364652_001-59892b6cac6b423290683aa40b3d3357.jpg", "https://people.com/thmb/uTcTvQ284uQhSylpd-zCzbQGFog=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/kim-k-crying-1-2000-4a80a5f841dc4463b6f2647a96e2df92.jpg", "https://people.com/thmb/FL6PnOave30JtSL4dd-1n0a4HkQ=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/pascal-duvier-d6959b1a032c48a89f33fc8d0884d8ec.jpg"], "top_img": "https://people.com/thmb/X4ow2crCBrUbOiA09zjyKr6BNO0=/1402x2000/filters:fill(auto,1)/kim-kardashian10-1-2000-19dafa41f7fa41b792c770bf6c22cab2.jpg", "keywords": [], "authors": ["Aurelie Corinthios", "Learn More"], "canonical_link": "https://people.com/tv/kim-kardashian-robbery-questions-answered/", "title": "Kim Kardashian's Robbery: Burning Questions Answered", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Here's everything you need to know about Kim Kardashian West's Paris robbery", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "PEOPLE", "sailthru.author": "Aurelie Corinthios", "article": {"section": "People", "opinion": "false", "author": "https://www.facebook.com/peoplemag"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "og": {"type": "article", "site_name": "Peoplemag", "url": "https://people.com/tv/kim-kardashian-robbery-questions-answered/", "title": "Kim Kardashian's Robbery: Burning Questions Answered", "description": "Here's everything you need to know about Kim Kardashian West's Paris robbery", "image": "https://people.com/thmb/X4ow2crCBrUbOiA09zjyKr6BNO0=/1402x2000/filters:fill(auto,1)/kim-kardashian10-1-2000-19dafa41f7fa41b792c770bf6c22cab2.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "Kim Kardashian's Robbery: Burning Questions Answered", "description": "Here's everything you need to know about Kim Kardashian West's Paris robbery", "image": "https://people.com/thmb/X4ow2crCBrUbOiA09zjyKr6BNO0=/1402x2000/filters:fill(auto,1)/kim-kardashian10-1-2000-19dafa41f7fa41b792c770bf6c22cab2.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.19.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.19.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.19.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.19.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.19.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "http://people.com", "summary": ""}