{"url": "https://en.wikipedia.org/wiki/John_Boyega", "text": "British actor (born 1992)\n\nJohn Adedayo Bamidele Adegboyega (born 17 March 1992), known professionally as John Boyega, is a British actor and producer.[1][2][3][4] He first rose to prominence in his native Britain for his role as Moses in the sci-fi comedy film Attack the Block (2011), and his international breakthrough came with his role as Finn in the Star Wars [5] sequel trilogy films The Force Awakens (2015), The Last Jedi (2017), and The Rise of Skywalker (2019).\n\nHis other credits include the drama film Imperial Dreams (2014), the historical epic The Woman King (2022), and thriller film Breaking (2022). He received the BAFTA Rising Star Award in 2016, and the Trophée Chopard at the 2016 Cannes Film Festival. He was cited as one of the Top 100 most influential Africans by New African magazine in 2020.[6]\n\nBoyega portrayed Leroy Logan in the 3rd episode of Steve McQueen's anthology series Small Axe (2020). For his performance he won the Golden Globe Award for Best Supporting Actor – Series, Miniseries or Television Film and the Critics' Choice Television Award for Best Actor in a Movie/Miniseries.[7]\n\nEarly life\n\nBoyega was born in the Camberwell district of London and grew up in Peckham. His parents, Abigail (a carer) and Samson Adegboyega (a Pentecostal minister) are both of Nigerian descent.[8] He has two older sisters.[9]\n\nHis first acting role was as a leopard in a play at Oliver Goldsmith Primary School.[10][11] While in another play there at age nine, he was noticed by Teresa Early, the artistic director of Theatre Peckham, a learning theatre for young people who live in south London. He spent his time there outside school hours from ages nine to fourteen. There was a rumour that his father wanted Boyega to become a minister as well, but Boyega denied this in an interview with Sam Sanders on Fresh Air, saying that his father supported his theatrical interests.[12][13][14][15] Boyega and his sister Grace were among the last people to see Damilola Taylor alive: they were friends and the Boyegas helped watch him.[16]\n\nIn 2003, Boyega began his secondary education at Westminster City School, where he was in various school productions.[17] From 2008 to 2010, he attended South Thames College at the college's Wandsworth campus to study for a National Diploma in Performing Arts.[18] His activities there included playing the title role in the college's production of Othello.[19] He enrolled at the University of Greenwich to study for a BA in film studies and media writing,[20] but dropped out to focus on his acting career.[13] He trained with the Identity School of Acting in London, and became a patron of its Los Angeles branch when it opened in 2018.[21]\n\nCareer\n\nBoyega trained at the Identity School of Acting in Hackney,[22] and appeared in Six Parties at the National Theatre and Category B at the Tricycle Theatre prior to being offered a role in the 2011 film Attack the Block.[23][24] In September 2011, HBO announced that Boyega had been cast in the boxing drama pilot Da Brick, loosely based on Mike Tyson's life. Boyega was expected to play Donnie, who is released from a juvenile detention centre on his 18th birthday and begins to examine what it means to be a man. The pilot, written by John Ridley,[25] was not picked up by HBO.[26] Also in 2011, Boyega acted in the film Junkhearts as Jamal, a drug dealer who finds some guns and tries to sell them.\n\nBoyega was chosen by Fionnuala Halligan of Screen International as one of the \"UK Stars of Tomorrow 2011\" and appeared with two other actors on the cover of the magazine's July 2011 edition.[27] In March 2012, he was cast in the film adaptation of Chimamanda Ngozi Adichie's book Half of a Yellow Sun.[28]\n\nOn 29 April 2014, it was confirmed that Boyega was cast as a major character in Star Wars: The Force Awakens.[29] It was later revealed that he would play Finn, a stormtrooper for the First Order, who, after witnessing their cruelty, leaves the military power and joins the fight against them. The film was released on 18 December 2015. The film and Boyega's performance was acclaimed from critics and audiences.[30][31]\n\nIn 2017, Boyega starred in Detroit, Kathryn Bigelow's film about the 1967 Detroit riots,[32] and reprised his role as Finn in Star Wars: The Last Jedi.[33]\n\nIn January 2016, Boyega formed his own production company, Upperroom Entertainment Limited. His company co-produced (with Legendary Entertainment[34]) 2018's Pacific Rim: Uprising, the sequel to the 2013 movie Pacific Rim, in which he played the lead role of Jake Pentecost.[35] In 2019 he teased his new collaboration with Writer/Director Sebastian Thiel,[36] with whom he is developing a series based on their childhood experiences, with Boyega producing.[37]\n\nIn November 2018 it was announced that Boyega would star with Letitia Wright in a novel adaption of Hold Back the Stars.[38] He has also been cast in Steve McQueen's miniseries Small Axe.[39]\n\nBoyega once again reprised his role as Finn in Star Wars: The Rise of Skywalker (2019). In an interview on Good Morning America, he revealed that he inadvertently left his script in a hotel room during filming. When it surfaced on eBay, it was bought by a Lucasfilm employee to prevent it from being leaked.[40]\n\nIn response to a tweet suggesting he should play the DC Comics character Static in a live-action role, Boyega said he would be too old for the role, and that he would be interested in seeing a newcomer receive it. He did, however, express interest in playing the DC character Red Hood.[41]\n\nIn the 2020 and 2021 editions of the Powerlist, Boyega was listed in the Top 100 of the most influential people in the UK of African/African-Caribbean descent.[42][43] More recently, his production company UpperRoom made a first-look deal with VIS Kids.[44] While filming the Netflix film Rebel Ridge, he unexpectedly walked out mid-production due to family issues.[45]\n\nUpcoming projects\n\nBoyega will next star in Abi Damaris Corbin's second feature film, Breaking, which premiered at the 2022 Sundance Film Festival under its original title, 892,[46] in Gina Prince-Bythewood's historical epic The Woman King alongside Viola Davis, Thuso Mbedu, and Lashana Lynch,[47] and in Netflix's science-fiction comedy They Cloned Tyrone.[48]\n\nIn May 2021, it was announced that he would reteam with Joe Cornish in a sequel for Attack the Block.[49]\n\nActivism and advocacy\n\nBoyega showed solidarity[clarification needed] with George Floyd, Sandra Bland, Trayvon Martin, and Stephen Lawrence during a speech at a Black Lives Matter rally in Hyde Park, London. His gesture was supported by a number of celebrities, and Lucasfilm also reiterated their support for Boyega and the Black Lives Matter movement.[50][51][52]\n\nIn a 2020 interview with British GQ, Boyega openly criticised Disney for sidelining his character Finn in the Star Wars sequel trilogy: \"[W]hat I would say to Disney is do not bring out a black character, market them to be much more important in the franchise than they are and then have them pushed to the side. It's not good. I'll say it straight up.\"[9][53][54]\n\nBoyega is a teetotaller.[9]\n\nFilmography\n\nFilm\n\nTelevision\n\nStage\n\nPodcasts\n\nYear Title Role Notes 2021 Tomorrow's Monsters Jack Locke\n\nVideo games\n\nTheme park attractions\n\nAwards and recognition", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/John_Boyega_by_Gage_Skidmore.jpg/220px-John_Boyega_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Josh_Wiggins_%28Hellion%29%2C_John_Boyega_%28Imperial_Dreams%29%2C_Kodi_Smit-McPhee_%28Young_Ones%29_and_Sharon_Swart_%2812026188424%29.jpg/220px-Josh_Wiggins_%28Hellion%29%2C_John_Boyega_%28Imperial_Dreams%29%2C_Kodi_Smit-McPhee_%28Young_Ones%29_and_Sharon_Swart_%2812026188424%29.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/John_Boyega_by_Gage_Skidmore.jpg/1200px-John_Boyega_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/John_Boyega_by_Gage_Skidmore.jpg/1200px-John_Boyega_by_Gage_Skidmore.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/John_Boyega", "title": "John Boyega", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b6/John_Boyega_by_Gage_Skidmore.jpg/640px-John_Boyega_by_Gage_Skidmore.jpg", "width": 640, "height": 914}, "title": "John Boyega - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}