{"url": "http://fortune.com/2018/01/22/alison-brie-james-franco-sag-awards/", "text": "When actress Alison Brie arrived at Sunday night’s Screen Actors Guild Awards ceremony, where she was a nominee for her role in the Netflix wrestling comedy GLOW, the topic of discussion quickly turned to her brother-in-law, James Franco.\n\nE! red carpet host Giuliana Rancic asked Brie about the recent allegations of sexual misconduct and inappropriate behavior that have been made against Franco, the brother of her husband, Dave Franco. “I think that above all what we’ve always said is it remains vital that anyone who feels victimized does have the right to speak out,” Brie told Rancic on the SAG Awards red carpet. “I obviously support my family and not everything reported has been fully accurate. But of course now is a time for listening and that’s what we’re all trying to do.”\n\nBrie has been a fixture at award shows in recent months, thanks to her critically-acclaimed performance in GLOW as well as a small part in the oft-nominated The Disaster Artist, where she stars alongside her husband, Dave Franco, and his brother. As such, it was likely only a matter of time before she was asked to comment publicly on the allegations against James Franco, who did also attend the SAG Awards last night (after previously skipping the Critics’ Choice Movie Awards earlier this month).\n\nAt the 2018 #SAGAwards, Alison Brie addressed the allegations of sexual misconduct made against her brother-in-law, James Franco: \"It remains vital that anyone that feels victimized should and does have the right to speak out and come forward.\" pic.twitter.com/dG5uJJVko7 — E! News (@enews) January 21, 2018\n\nGet Data Sheet, Fortune’s technology newsletter.\n\nJames Franco, who is still considered a leading contender for an Academy Award nomination for his role in The Disaster Artist, received criticism for wearing a “Time’s Up” pin at the 2018 Golden Globe Awards earlier this month, with multiple women coming forward to accuse him of previous misconduct. Franco recently took to late-night television to respond to some of those allegations, telling NBC’s Seth Meyers that the allegations against him are “not accurate” while adding that he does not plan to “actively refute” the claims.", "images": ["https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1242585998-e1665028070836.jpg?w=256&q=75", "https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1243767517-e1665076497696.jpg?w=256&q=75", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://content.fortune.com/wp-content/uploads/2018/01/gettyimages-908514106.jpg?resize=1200,600", "https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1243581035-e1665068106964.jpg?w=256&q=75"], "top_img": "https://content.fortune.com/wp-content/uploads/2018/01/gettyimages-908514106.jpg?resize=1200,600", "keywords": [], "authors": [], "canonical_link": "https://fortune.com/2018/01/22/alison-brie-james-franco-sag-awards/", "title": "Alison Brie Addresses James Franco Allegations at SAG Awards", "meta_data": {"viewport": "width=device-width", "msapplication-TileColor": "#ffc40d", "theme-color": "#ffffff", "description": "At the SAG Awards, 'GLOW' actress Alison Brie responded to the sexual misconduct allegations against her brother-in-law, James Franco.", "keywords": "sag awards 2018, screen actors guild awards, alison brie, james franco, james franco allegations, alison brie james franco, sag awards, dave franco", "og": {"url": "https://fortune.com/2018/01/22/alison-brie-james-franco-sag-awards/", "type": "article", "title": "Alison Brie Responds to the Allegations Against James Franco at the SAG Awards", "description": "Franco recently took to late-night television to respond himself.", "site_name": "Fortune", "image": "https://content.fortune.com/wp-content/uploads/2018/01/gettyimages-908514106.jpg?resize=1200,600", "width": 1024, "height": 683}, "twitter": {"card": "summary_large_image", "title": "Alison Brie Responds to the Allegations Against James Franco at the SAG Awards", "description": "Franco recently took to late-night television to respond himself.", "image": "https://content.fortune.com/wp-content/uploads/2018/01/gettyimages-908514106.jpg?resize=1200,600", "url": "https://fortune.com/2018/01/22/alison-brie-james-franco-sag-awards/"}, "next-head-count": 32}, "movies": [], "publish_date": 1516579200.0, "source": "http://fortune.com", "summary": ""}