{"url": "https://themuse.jezebel.com/jack-antonoff-and-the-unrelenting-shadow-of-the-male-pr-1829446847", "text": "When Taylor Swift transformed into a reigning pop princess on 2014's 1989, Jack Antonoff was there. He was there again to help co-write her bad girl turn on Reputation in 2017. As a producer, he’s worked with St. Vincent’s Annie Clark on the minimalist piano pop for her 2017 record Masseduction, with Lorde on her larger-than-life album Melodrama, and is partly responsible for Sara Bareilles’s commercial-perfect earworm “Brave.” He’s reportedly working with Carly Rae Jepsen (again), the Dixie Chicks, and now Lana Del Rey.\n\n\n\nAntonoff rose to fame as a member of the largely forgotten band Fun., whose biggest hit was 2011's “We Are Young,” but now he’s often positioned as the reason why the music of many women artists is so great. He’s been dubbed your favorite pop star’s “secret weapon” by Pitchfork, and a “millennial pop svengali” by Vanity Fair. His rise is especially inspiring, GQ once suggested, because he doesn’t physically and sonically resemble typical pop producers. “The very nature of pop music has changed: people who look and think and sound like Jack Antonoff are allowed to participate in its making at the very highest levels,” a profile from earlier this year read, which seemed to imply that Antonoff’s geeky style and indie sincerity was in direct opposition to slicker pop makers who came up through the industry solely as writers and producers.\n\nAdvertisement\n\nDespite his rising prominence, though, there’s something admittedly irritating about his ubiquity. It’s enough to warrant articles like this Noisey post: “JACK ANTONOFF YOU STAY AWAY FROM THE DIXIE CHICKS,” in which the entire body is “no no no no nope.” Because while Antonoff might be highly favored among artists we love, promoted (often via music critics) as a fresh new pop-maker and ally with a unique respect for women, he inevitably winds up consuming a lot of their spotlight. In late October, he appeared alongside Lana De l Rey for her performance of “How to Disappear” at an Apple event in Brooklyn. After GQ interviewed him, their profile included the line, “He’s still writing Jack Antonoff songs—they just happen to be sung by people like Lorde now.” Lorde took issue with the characterization: “Knew there was a way to describe the personal and skillful work that I do turns out it’s ‘singing jack antonoff songs’” she wrote in a now-deleted tweet.\n\nThe history of pop music made by women but produced by men is often one of erasure.\n\nThat’s traditionally how it’s worked. The history of pop music made by women but produced by men is often one of erasure. Women may be the stars of their music, their names alone listed on their songs, but the men who write, produce, or mix for them, even as a collaboration, are seen as the puppeteers who guide them (and, in the worst cases, svengalis); Phil Spector to The Ronettes, Max Martin to Britney Spears, Timbaland to Aaliyah, Dr. Luke to Kesha.\n\nThere’s the long baked-in assumption, particularly in pop, that women are not responsible for their hits and have a team of pop songwriters behind them. Women artists, from Taylor Swift to Björk to Missy Elliott, have had to fight for their role in their own music-making, as listeners and critics choose to attribute the bulk of the creative process to the men in the room. “How can one be a ‘vocal muse’ to their own melodies, story telling and words they wrote?” Solange wrote in response to a 2013 review of her album True, co-produced and co-written largely by Dev Hynes, which likened Solange to a muse for Hynes (Solange is credited as a writer and producer on every track). And while Antonoff is far from the most egregious offender, he is still a male producer working primarily with women artists, and it’s his touch as a producer that inevitably blankets the work of the women he works with.\n\nAdvertisement\n\nLorde “Green Light” music video\n\nA fair share of Antonoff’s productions are great. Taylor Swift’s “I Wish You Would” is supremely underrated, Fifth Harmony’s “Dope” should have been on the album rather than a B-side, and I still get excited when I hear “Green Light” out in public. But I’d argue that the unchanged nature of his production style leaves a lot of his music stuck, dated, in the glittering ’80s nostalgia-wave of pop music several years ago. He tends, as well, to have a squeaky clean, piano-ballad approach, like he’s willingly applying motion-smoothing technology to artists who might not need it. When Melodrama was set to come out, I steeled myself for a record built in the shadow of 1989, an erasure of Lorde, and was pleasantly surprised to find I could still hear her.\n\n\n\nI steeled myself for Lorde’s erasure not because I thought she could easily disappear, but because it’s happened so many times before with women artists. Antonoff has largely been pitched to the masses as a producer who cuts through that stereotype. He’s a pop music “Nice Guy” (someone your mother would love, New York Magazine once pointed out) in an industry just barely beginning to reckon publicly with how much misogyny is embedded into pop music-making. It’s hard not to connect the recent infatuation with Antonoff’s celebrity with Dr. Luke’s fall and see him as a shred of male decency in a dark industry. More than being a nice guy, he’s made it clear that he cares about women’s artistry. “I always want to hear women sing my songs. I just want to be around women,” Antonoff told Pitchfork. “It’s not a sex thing—I’m heterosexual, but it’s not coming from any place like that. It’s just a comfort thing.”\n\nLast year, he told The Guardian, “In no way do I feel like a woman. I feel very male. But when I’m writing I don’t think about Lou Reed or Bowie. I think about Kate Bush, Björk, Fiona Apple. I’ve always been extremely drawn to female artists who are being brutally honest. That is so much more attractive to me than a lot of the weird paths certain male songwriters lead you down, that hide and mask emotions.”\n\nAdvertisement\n\nIn an interview with the New York Times promoting Melodrama, Lorde told the reporter that when she played “Green Light” to producer Max Martin, who has an almost Renaissance-flare for technical perfection, Martin told her it was “incorrect songwriting.” Not an insult exactly for Lorde, but one that only underscored how much she perceived Antonoff as a looser musical partner who wasn’t like the other guys.\n\nOr is he really not like the others? As much as I feel constantly pitched on the idea that Antonoff isn’t a typical pop producer, the way music media treats him feels like just another fetishization of the old-school producer dynamic. You couldn’t confidently write off Melodrama as a collection of Antonoff songs, just as you can’t write off his collaborations with Lana Del Rey, St. Vincent, or other artists as women simply singing “his songs”—but it’s these kinds of assumptions that happen when a male producer chooses to be a celebrity. And when you consider the fact that successful women in this industry still struggle to establish their genius in the same ways men do (because, frankly, they’re quickly rewarded the distinction in spades), you wonder if Antonoff’s collaborators would benefit from him taking a bigger, less vocal step back.\n\nNo matter how nice he is, or respectful, or a good #ally—and as much as he may be unaware—Antonoff is assuming a historically authoritative position in pop music. Even if Antonoff is an unwitting participant, he exists in a system that will always inherently award him the position of being a pop mastermind when it comes to the collaborations he creates with women, who are ultimately the authors of their work but often treated as subjects. And the giddiness with which Antonoff speaks of his collaborations with Taylor Swift or Lorde or St. Vincent to a fawning press might come with the best of intentions, but his female collaborators ultimately have to work overtime to claim authorship.", "images": ["https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/f5zr3vuc90hrpnmx0nme.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/kqnkjlylkf7tymsqmoqr.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/52a29fe0001de9a08e76ea6d559528e9.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/u0939doeuioaqhspkjyc.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/j59upeyynundqjvbmcwj.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/v4sckews2f3bzf0ztbkf.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/aqhdzcldymb9mkltfhxh.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/rnxqtvv6advgidzfs6am.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/f2b6295902a8e0a7c4d168840e7b3d51.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/eti2h1r4wg0bqxctxenl.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/muaaluj2wznfomol9ero.png", "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/no63bw902mddhwxtjtxh.png"], "top_img": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png", "keywords": [], "authors": [], "canonical_link": "https://jezebel.com/jack-antonoff-and-the-unrelenting-shadow-of-the-male-pr-1829446847", "title": "Jack Antonoff and the Unrelenting Shadow of the Male Producer", "meta_data": {"google-site-verification": "QDPLbDJXTQNT0n69mvNADCeRmwnbkYyL20OKJAVCKq8", "ir-site-verification-token": "-1270174611", "viewport": "width=device-width, initial-scale=1.0, minimum-scale=1.0,maximum-scale=10.0", "ROBOTS": "INDEX, FOLLOW", "msapplication-square70x70logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_80,q_80,w_80/muaaluj2wznfomol9ero.png", "msapplication-square150x150logo": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_200,q_80,w_200/muaaluj2wznfomol9ero.png", "keywords": "Pop music, jack antonoff, producers, music, Lorde, Lana Del Rey, Carly Rae Jepsen, Jezebel", "news_keywords": "Pop music, jack antonoff, producers, music, Lorde, Lana Del Rey, Carly Rae Jepsen, Jezebel", "twitter": {"url": "https://jezebel.com/jack-antonoff-and-the-unrelenting-shadow-of-the-male-pr-1829446847", "card": "summary_large_image", "site": "jezebel", "title": "Jack Antonoff and the Unrelenting Shadow of the Male Producer", "description": "When Taylor Swift transformed into a reigning pop princess on 2014's 1989, Jack Antonoff was there. He was there again to help co-write her bad girl turn on Reputation in 2017. As a producer, he’s worked with St. Vincent’s Annie Clark on the minimalist piano pop for her 2017 record Masseduction, with Lorde on her…", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png"}, "article": {"published_time": "2018-11-02T15:00:00.847Z", "modified_time": "2018-11-02T15:21:12.054Z"}, "description": "When Taylor Swift transformed into a reigning pop princess on 2014's 1989, Jack Antonoff was there. He was there again to help co-write her bad girl turn on Reputation in 2017. As a producer, he’s worked with St. Vincent’s Annie Clark on the minimalist piano pop for her 2017 record Masseduction, with Lorde on her…", "og": {"title": "Jack Antonoff and the Unrelenting Shadow of the Male Producer", "type": "article", "url": "https://jezebel.com/jack-antonoff-and-the-unrelenting-shadow-of-the-male-pr-1829446847", "description": "When Taylor Swift transformed into a reigning pop princess on 2014's 1989, Jack Antonoff was there. He was there again to help co-write her bad girl turn on Reputation in 2017. As a producer, he’s worked with St. Vincent’s Annie Clark on the minimalist piano pop for her 2017 record Masseduction, with Lorde on her…", "locale": "en_US", "site_name": "Jezebel", "image": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/197xrjaz7466rpng.png"}, "fb": {"app_id": 40338819712}}, "movies": [], "publish_date": 1541170800.847, "source": "https://themuse.jezebel.com", "summary": ""}