{"url": "https://www.hollywoodreporter.com/news/woody-allen-makes-rare-la-appearance-at-diane-keaton-afi-event-1011793", "text": "Woody Allen was greeted with a standing ovation as he made a surprise appearance tonight to present his old friend and co-star Diane Keaton with the 45th annual AFI Life Achievement Award.\n\nAllen, in a rare visit to Hollywood, appeared at the end of the evening to celebrate Keaton, who won her best actress Oscar for her starring role as the blithe title character in 1977’s Annie Hall. “We go back a long way, Diane and I,” Allen began before launching into a comedic monologue.\n\nJokingly likening the young Keaton to the fictional character Eve Harrington in All About Eve, Allen joked that he didn’t mean to suggest that she was “ruthlessly ambitious,” but that when she meant to refer to him as a talented young director, she made a Freudian slip and “instead she called me a stepping stone.”\n\nHe recalled how fascinated he was when he first met Keaton because she came from right-wing Orange County, Calif., having grown up in a town where “if you helped a blind person across the street, they accused you of socialism.”\n\nContinuing to draw laughs from the audience, and especially from Keaton, who sat at the main dais, Allen observed, “Her beauty is not conventional — by conventional, I mean pleasing to the eye.”\n\nThe two met when Keaton, an aspiring actor from California living in New York, auditioned for and won the female lead in Allen’s 1969 play Play It Again, Sam, and they then went on to make the movie version together. In a video interview earlier in the evening, Keaton testified that the eight films she and Allen made together were “fun to do because I played idiots,” but she also praised Allen for “writing for women better than anyone. His female roles are extraordinary.”\n\nAn unapologetic New Yorker, who’s often expressed disdain for Los Angeles — in Annie Hall, he famously cracked, “I don’t want to move to a city where the only cultural advantage is being able to make a right turn on a red light” — Allen has to be seriously motivated to venture to the West Coast. He appeared at the 2002 Oscars, for example, only because he was asked to introduce a tribute to New York City in the wake of 9/11.\n\nBut, clearly, his professional and personal relationship with Keaton exerted a strong draw, for he concluded his remarks by becoming serious for a moment, saying, “From the minute I met her, she was a great, great inspiration to me. Much of what I have accomplished in my life, I owe for sure to her.”\n\nMaking her way to the stage at the Dolby Theatre in Hollywood, Keaton embraced Allen and, turning to the microphone, said, “Oh, God, I just want to cry.” She added, “Tonight has been an astonishing experience for me.” So, instead of launching into a speech, she instead chose to sing an a cappella version of “Seems Like Old Times,” the song she memorably sang in Annie Hall.\n\nAs the 45th recipient of the honor presented annually by the American Film Institute, Keaton, 71, became the ninth woman to be singled out, following in the footsteps of Bette Davis, Lillian Gish, Barbara Stanwyck, Elizabeth Taylor, Barbra Streisand, Meryl Streep, Shirley MacLaine and Jane Fonda. And Streep and Fonda were both on hand to welcome her to the club.\n\nThey both chose to pay homage to Keaton’s idiosyncratic sense of style — for the occasion, Keaton herself wore a black-belted white coatdress, along with one of her signature oversized hats.\n\nAppearing in a black blazer, skinny pants and black-and-white-striped tie, Streep observed, “Diane Keaton, arguably one of the most covered-up persons in the history of clothes, is also a transparent woman, even though she is famously the only member of the original cast of Hair on Broadway who would not take off her clothes at the end of the show.” As for Keaton’s winning performance in Annie Hall, Streep added, “She had the stream of consciousness of a hummingbird.”\n\nDressed in an all-white pantsuit, Fonda said, “She absolutely owns the color white. So tonight, in her honor, I’m wearing white. It’s not just the color of Donald Trump’s cabinet. It’s a special white, suffragette white. Women wear white as a symbol of strength.”\n\nAnd that wasn’t the evening’s only Trump reference. A clip from The First Wives Club got some of the biggest laughs of the night when Ivana Trump, in a cameo appearance, popped up and advised the first wives played by Keaton, Goldie Hawn and Bette Midler, “Don’t get mad! Get everything!”\n\nAmong those offering praise for the multitalented Keaton as an actress, director, photographer, home designer and philanthropist, Sarah Silverman noted, “She’s one of the few women in Hollywood who has always been defined by her work and her character and not the men she’s been associated with — and, by the way, those men are nothing to sneeze at.”\n\nA number of those men whom Keaton was involved with both onscreen and off acknowledged the enduring friendships they forged with her. In addition to Allen, both her Godfather co-star Al Pacino and her Reds director and co-star, Warren Beatty, visited the podium.\n\nPacino recalled how Keaton once advised him, as he was headed off to an interview, “Whatever you do, don’t say you’re an artist!” But he turned the tables on her tonight by offering a heartfelt response: “Forgive me — you’re an artist, Diane. You’re a great artist.”\n\nBeatty acknowledged of their work together on Reds, “You were completely indispensable in bringing to life a movie about the challenges that a couple of young, left-wing revolutionaries faced in that eternal conflict between art and politics. You made the movie work.” He went on to say, “I want to thank you for your artistry, I want to thank you for your inspiration, and I want to thank you for your friendship.”\n\nSteve Martin and Martin Short, who became friends with Keaton on the 1991 film version of Father of the Bride, amid a lot of comic ribbing, also joined in on the praise.\n\nIn many ways, though, the tone of the night was set by the younger women who cited Keaton as a role model. Reese Witherspoon, who, as a 15-year-old, auditioned for the 1991 TV movie Wildflower that Keaton directed; Rachel McAdams, who appeared alongside Keaton in The Family Stone; Lisa Kudrow, who was directed by Keaton in Hanging Up (and who also delivered the best Keaton impersonation of the night); and Emma Stone all thanked Keaton for the example she’s set for them.\n\nThe tribute, which will air on TNT on June 15 and then on Turner Classic Movies on July 31, began with AFI president and CEO Bob Gazzale noting that the AFI is currently celebrating the 50th anniversary of its creation, which took place in a White House Rose Garden ceremony with President Lyndon B. Johnson. “The AFI has stood the test of time,” he said as he welcomed to the stage AFI founding director George Stevens Jr. and founding vice chairman Sidney Poitier.\n\nAs he briefly recounted the AFI’s history, Gazzale gave a special shout-out to the AFI’s latest success story, AFI Conservatory alumna and Wonder Woman director Patty Jenkins, who received a big round of applause. The AFI’s Franklin J. Schaffner Award, recognizing another of the school’s grads, was presented to cinematographer Frederick Elmes.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/06/gettyimages-693973950.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/gettyimages-693961556.jpg?w=1024", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/gettyimages-693965840.jpg?w=1295&h=729&crop=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/gettyimages-693965840.jpg?w=1024"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/gettyimages-693965840.jpg?w=1024", "keywords": [], "authors": ["Gregg Kilday"], "canonical_link": "https://www.hollywoodreporter.com/news/general-news/woody-allen-makes-rare-la-appearance-at-diane-keaton-afi-event-1011793/", "title": "Woody Allen Makes Rare L.A. Appearance at Diane Keaton AFI Event", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The Oscar-winning director surprised the crowd when he emerged onstage to introduce the woman of the evening to a standing ovation.", "news_keywords": "Diane Keaton, Woody Allen", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Gregg Kilday", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1011793, "title": "Woody Allen Makes Rare L.A. Appearance at Diane Keaton AFI Event", "published_at": "2017-06-08 22:16:38", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/gettyimages-693965840.jpg?w=1024", "comment_count": 0, "tags": "Woody Allen", "topics": "News", "body": "Woody Allen was greeted with a standing ovation as he made a surprise appearance tonight to present his old friend and co-star Diane Keaton with the 45th annual AFI Life Achievement Award.\r\nAllen, in a rare visit to Hollywood, appeared at the end of the evening to celebrate Keaton, who won her best actress Oscar for her starring role as the blithe title character in 1977’s Annie Hall. “We go back a long way, Diane and I,” Allen began before launching into a comedic monologue.\r\nJokingly likening the young Keaton to the fictional character Eve Harrington in All About Eve, Allen joked that he didn’t mean to suggest that she was “ruthlessly ambitious,” but that when she meant to refer to him as a talented young director, she made a Freudian slip and “instead she called me a stepping stone.”\r\nHe recalled how fascinated he was when he first met Keaton because she came from right-wing Orange County, Calif., having grown up in a town where “if you helped a blind person across the street, they accused you of socialism.”\r\nContinuing to draw laughs from the audience, and especially from Keaton, who sat at the main dais, Allen observed, “Her beauty is not conventional — by conventional, I mean pleasing to the eye.”\r\nThe two met when Keaton, an aspiring actor from California living in New York, auditioned for and won the female lead in Allen's 1969 play Play It Again, Sam, and they then went on to make the movie version together. In a video interview earlier in the evening, Keaton testified that the eight films she and Allen made together were \"fun to do because I played idiots,\" but she also praised Allen for \"writing for women better than anyone. His female roles are extraordinary.\"\r\n\r\nAn unapologetic New Yorker, who's often expressed disdain for Los Angeles — in Annie Hall, he famously cracked, \"I don't want to move to a city where the only cultural advantage is being able to make a right turn on a red light\" — Allen has to be seriously motivated to venture to the West Coast. He appeared at the 2002 Oscars, for example, only because he was asked to introduce a tribute to New York City in the wake of 9/11.\r\nBut, clearly, his professional and personal relationship with Keaton exerted a strong draw, for he concluded his remarks by becoming serious for a moment, saying, “From the minute I met her, she was a great, great inspiration to me. Much of what I have accomplished in my life, I owe for sure to her.”\r\nMaking her way to the stage at the Dolby Theatre in Hollywood, Keaton embraced Allen and, turning to the microphone, said, “Oh, God, I just want to cry.” She added, “Tonight has been an astonishing experience for me.” So, instead of launching into a speech, she instead chose to sing an a cappella version of \"Seems Like Old Times,\" the song she memorably sang in Annie Hall.\r\nAs the 45th recipient of the honor presented annually by the American Film Institute, Keaton, 71, became the ninth woman to be singled out, following in the footsteps of Bette Davis, Lillian Gish, Barbara Stanwyck, Elizabeth Taylor, Barbra Streisand, Meryl Streep, Shirley MacLaine and Jane Fonda. And Streep and Fonda were both on hand to welcome her to the club.\r\nThey both chose to pay homage to Keaton's idiosyncratic sense of style — for the occasion, Keaton herself wore a black-belted white coatdress, along with one of her signature oversized hats.\r\nAppearing in a black blazer, skinny pants and black-and-white-striped tie, Streep observed, \"Diane Keaton, arguably one of the most covered-up persons in the history of clothes, is also a transparent woman, even though she is famously the only member of the original cast of Hair on Broadway who would not take off her clothes at the end of the show.\" As for Keaton's winning performance in Annie Hall, Streep added, \"She had the stream of consciousness of a hummingbird.\"\r\nDressed in an all-white pantsuit, Fonda said, \"She absolutely owns the color white. So tonight, in her honor, I'm wearing white. It's not just the color of Donald Trump's cabinet. It's a special white, suffragette white. Women wear white as a symbol of strength.\"\r\nAnd that wasn't the evening's only Trump reference. A clip from The First Wives Club got some of the biggest laughs of the night when Ivana Trump, in a cameo appearance, popped up and advised the first wives played by Keaton, Goldie Hawn and Bette Midler, \"Don't get mad! Get everything!\"\r\n\r\nAmong those offering praise for the multitalented Keaton as an actress, director, photographer, home designer and philanthropist, Sarah Silverman noted, \"She’s one of the few women in Hollywood who has always been defined by her work and her character and not the men she’s been associated with — and, by the way, those men are nothing to sneeze at.\"\r\nA number of those men whom Keaton was involved with both onscreen and off acknowledged the enduring friendships they forged with her. In addition to Allen, both her Godfather co-star Al Pacino and her Reds director and co-star, Warren Beatty, visited the podium.\r\nPacino recalled how Keaton once advised him, as he was headed off to an interview, \"Whatever you do, don't say you're an artist!\" But he turned the tables on her tonight by offering a heartfelt response: \"Forgive me — you're an artist, Diane. You're a great artist.\"\r\nBeatty acknowledged of their work together on Reds, \"You were completely indispensable in bringing to life a movie about the challenges that a couple of young, left-wing revolutionaries faced in that eternal conflict between art and politics. You made the movie work.\" He went on to say, \"I want to thank you for your artistry, I want to thank you for your inspiration, and I want to thank you for your friendship.\"\r\nSteve Martin and Martin Short, who became friends with Keaton on the 1991 film version of Father of the Bride, amid a lot of comic ribbing, also joined in on the praise.\r\nIn many ways, though, the tone of the night was set by the younger women who cited Keaton as a role model. Reese Witherspoon, who, as a 15-year-old, auditioned for the 1991 TV movie Wildflower that Keaton directed; Rachel McAdams, who appeared alongside Keaton in The Family Stone; Lisa Kudrow, who was directed by Keaton in Hanging Up (and who also delivered the best Keaton impersonation of the night); and Emma Stone all thanked Keaton for the example she's set for them.\r\nThe tribute, which will air on TNT on June 15 and then on Turner Classic Movies on July 31, began with AFI president and CEO Bob Gazzale noting that the AFI is currently celebrating the 50th anniversary of its creation, which took place in a White House Rose Garden ceremony with President Lyndon B. Johnson. \"The AFI has stood the test of time,\" he said as he welcomed to the stage AFI founding director George Stevens Jr. and founding vice chairman Sidney Poitier.\r\nAs he briefly recounted the AFI's history, Gazzale gave a special shout-out to the AFI's latest success story, AFI Conservatory alumna and Wonder Woman director Patty Jenkins, who received a big round of applause. The AFI's Franklin J. Schaffner Award, recognizing another of the school's grads, was presented to cinematographer Frederick Elmes.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Woody Allen Makes Rare L.A. Appearance at Diane Keaton AFI Event", "url": "https://www.hollywoodreporter.com/news/general-news/woody-allen-makes-rare-la-appearance-at-diane-keaton-afi-event-1011793/", "description": "The Oscar-winning director surprised the crowd when he emerged onstage to introduce the woman of the evening to a standing ovation.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/gettyimages-693965840.jpg?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2017-06-08T22:16:38+00:00", "modified_time": "2017-06-09T14:53:59+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Woody Allen Makes Rare L.A. Appearance at Diane Keaton AFI Event", "description": "The Oscar-winning director surprised the crowd when he emerged onstage to introduce the woman of the evening to a standing ovation.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/gettyimages-693965840.jpg?w=1295"}}, "movies": [], "publish_date": 1496960198.0, "source": "https://www.hollywoodreporter.com", "summary": ""}