{"url": "https://www.hollywoodreporter.com/live-feed/will-grace-tackles-harvey-weinstein-scandal-1052147", "text": "[Warning: This story contains spoilers from Thursday’s episode of Will & Grace, “How to Succeed in Business Without Really Crying.”]\n\nIt’s been 11 years since Will & Grace was last on the air, but the revival of the NBC multicam hasn’t hesitated to embrace the present day.\n\nIn the five episodes that have aired so far, the series has name-dropped both President Donald Trump, in a reference to his criticized Puerto Rico relief efforts, as well as Vice President Mike Pence. However, Thursday’s episode went one step further when it took aim at Harvey Weinstein following the onslaught of sexual harassment allegations made against the longtime film producer in recent weeks.\n\nWhen fan-favorite Beverley Leslie (Leslie Jordan) came out to Megan Mullally’s Karen as gay, she quipped, “What’s your next bombshell? Harvey Weinstein isn’t always a perfect gentleman?”\n\nThe episode was shot Oct. 11, six days after The New York Times first reported that Weinstein had paid off sexual harassment accusers for decades. The taping was also one day after The New Yorker‘s expose, in which 13 women accused Weinstein of sexual harassment, with three of those individuals also claiming he had raped them.\n\nIn September when speaking with THR about the Must See TV comedy’s return, creators David Kohan and Max Mutchnick discussed how they planned to mine the current landscape for laughs, just as they did during the comedy’s original run when George W. Bush was in the White House. “It made for a lot of tension. When there’s a lot of tension in the air, there’s a lot to write,” Mutchnick said. “There’s a lot of tension in the air, so there’s a lot of things to write and there are a lot of reasons to make an audience laugh.”\n\nAs evidenced with Thursday’s Harvey Weinstein jab, that philosophy extends beyond comedy. “We’re not just talking politically, we’re also talking culturally and down to the real particulars about how people live their lives, about what they’re looking at on their phones and what they’re into,” Kohan said in September. “That’s always been what the show has concerned itself with, with just sort of the minutiae of contemporary life — and that exists, it’s just that the minutiae have changed.”\n\nThursday’s episode also saw a big change for Will (Eric McCormack). After he was promoted to senior partner at his longtime law firm, Will suddenly came to the realization that he actually didn’t want to be a lawyer anymore. It was a surprising turn of events for the character after he spent the show’s previous eight seasons practicing the law.\n\n“I think it’s about a certain maturity. You don’t want these characters to ever get too mature, that would take all the fun of it,” McCormack tells THR. “But he finally realizes he doesn’t want to be a corporate lawyer for the rest of his life, that he’s done that for 25 years and wants to start something new. So there’s that sense of rebirth. The characters are being reborn, each of them are finding who they are at this age and that’s been fun to add to the mix.”\n\nMcCormack says it was important to show some changes for the characters in the new installments, despite largely keeping the quartet in the same place they were 11 years ago (i.e. ignoring the series finale and keeping Will and Grace living together and without children). “We still need growth,” the star says. “And I want that growth to be organic and not just something that we say, ‘Oh by the way, in the interim, Will has taken up woodworking.’ What happens with his job is something that happens very naturally.”\n\nIn the end, Will decided to leave the law behind to find a new partnership with Grace. McCormack says he knew that was the right way to go with the story when Kohan and Mutchnick first told him their idea. “Not only do they have lots of ideas of where we can go, but they’re all ideas that are organic to the show and only going to give us new avenues to play in.”", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/09/nup_179312_3332-h_2017.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2017/09/nup_179312_3332-h_2017.jpg?w=1296&h=730&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/09/nup_179312_3332-h_2017.jpg?w=1024", "keywords": [], "authors": ["Kate Stanhope"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/will-grace-tackles-harvey-weinstein-scandal-1052147/", "title": "‘Will & Grace’ Tackles Harvey Weinstein Scandal", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Thursday's episode of the beloved comedy also saw Eric make an unpredicted professional move.", "news_keywords": "Eric McCormack, Will and Grace", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Kate Stanhope", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1052147, "title": "'Will & Grace' Tackles Harvey Weinstein Scandal", "published_at": "2017-10-27 11:14:10", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/09/nup_179312_3332-h_2017.jpg?w=1024", "comment_count": 0, "tags": "Will and Grace", "topics": "TV News", "body": "[Warning: This story contains spoilers from Thursday's episode of Will & Grace, \"How to Succeed in Business Without Really Crying.\"]\r\nIt's been 11 years since Will & Grace was last on the air, but the revival of the NBC multicam hasn't hesitated to embrace the present day.\r\nIn the five episodes that have aired so far, the series has name-dropped both President Donald Trump, in a reference to his criticized Puerto Rico relief efforts, as well as Vice President Mike Pence. However, Thursday's episode went one step further when it took aim at Harvey Weinstein following the onslaught of sexual harassment allegations made against the longtime film producer in recent weeks. \r\nWhen fan-favorite Beverley Leslie (Leslie Jordan) came out to Megan Mullally's Karen as gay, she quipped, \"What's your next bombshell? Harvey Weinstein isn't always a perfect gentleman?\"\r\nThe episode was shot Oct. 11, six days after The New York Times first reported that Weinstein had paid off sexual harassment accusers for decades. The taping was also one day after The New Yorker's expose, in which 13 women accused Weinstein of sexual harassment, with three of those individuals also claiming he had raped them.\r\nIn September when speaking with THR about the Must See TV comedy's return, creators David Kohan and Max Mutchnick discussed how they planned to mine the current landscape for laughs, just as they did during the comedy's original run when George W. Bush was in the White House. \"It made for a lot of tension. When there's a lot of tension in the air, there's a lot to write,\" Mutchnick said. \"There's a lot of tension in the air, so there's a lot of things to write and there are a lot of reasons to make an audience laugh.\"\r\n\r\nAs evidenced with Thursday's Harvey Weinstein jab, that philosophy extends beyond comedy. \"We're not just talking politically, we're also talking culturally and down to the real particulars about how people live their lives, about what they're looking at on their phones and what they're into,\" Kohan said in September. \"That's always been what the show has concerned itself with, with just sort of the minutiae of contemporary life — and that exists, it's just that the minutiae have changed.\"\r\nThursday's episode also saw a big change for Will (Eric McCormack). After he was promoted to senior partner at his longtime law firm, Will suddenly came to the realization that he actually didn't want to be a lawyer anymore. It was a surprising turn of events for the character after he spent the show's previous eight seasons practicing the law.\r\n\"I think it's about a certain maturity. You don't want these characters to ever get too mature, that would take all the fun of it,\" McCormack tells THR. \"But he finally realizes he doesn’t want to be a corporate lawyer for the rest of his life, that he's done that for 25 years and wants to start something new. So there's that sense of rebirth. The characters are being reborn, each of them are finding who they are at this age and that's been fun to add to the mix.\"\r\nMcCormack says it was important to show some changes for the characters in the new installments, despite largely keeping the quartet in the same place they were 11 years ago (i.e. ignoring the series finale and keeping Will and Grace living together and without children). \"We still need growth,\" the star says. \"And I want that growth to be organic and not just something that we say, 'Oh by the way, in the interim, Will has taken up woodworking.' What happens with his job is something that happens very naturally.\"\r\nIn the end, Will decided to leave the law behind to find a new partnership with Grace. McCormack says he knew that was the right way to go with the story when Kohan and Mutchnick first told him their idea. \"Not only do they have lots of ideas of where we can go, but they're all ideas that are organic to the show and only going to give us new avenues to play in.\"", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Will & Grace’ Tackles Harvey Weinstein Scandal", "url": "https://www.hollywoodreporter.com/tv/tv-news/will-grace-tackles-harvey-weinstein-scandal-1052147/", "description": "Thursday’s episode of the beloved comedy also saw Eric make an unpredicted professional move.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/09/nup_179312_3332-h_2017.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-10-27T11:14:10+00:00", "modified_time": "2017-10-27T11:31:32+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Will & Grace’ Tackles Harvey Weinstein Scandal", "description": "Thursday’s episode of the beloved comedy also saw Eric make an unpredicted professional move.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/09/nup_179312_3332-h_2017.jpg?w=1296"}}, "movies": [], "publish_date": 1509102850.0, "source": "https://www.hollywoodreporter.com", "summary": ""}