{"url": "https://www.denofgeek.com/us/tv/arrow/263527/arrow-star-stephen-amell-runs-american-ninja-warrior-course", "text": "While Arrow star Stephen Amell helped kick off The CW’s expanding continuity of DC Comics-inspired television shows, his character Oliver Queen/Green Arrow has found himself increasingly overshadowed by his super-powered peers on The Flash, Supergirl and Legends of Tomorrow. However, unlike said peers, Oliver’s uber-athletic parkour-trained crime-fighting skills are attributed to his actor’s abilities. Now, Amell will get a chance to showcase his skills in real life!\n\nhttps://www.youtube.com/watch?v=baHfmHeySkE\n\nNBC has released a sneak preview of Stephen Amell’s imminently airing American Ninja Warrior run. While the clip obviously doesn’t divulge the ultimate outcome, it does show Amell absolutely crushing the early – but nevertheless difficult – obstacles of the initial course with athletic ease. Even if Amell ultimately ends up taking an ignominious header into the drink below, the preview already proves that what we see of Oliver Queen’s training on Arrow is pretty much ALL Stephen Amell.\n\nAmell’s American Ninja Warrior run will air as part of NBC’s upcoming annual celebration of Red Nose Day, showcasing a celebrity edition of the obstacle course mainstay series. As the preview reveals, Stephen Amell will shed Oliver Queen and the Green Arrow to participate in television’s ultimate obstacle course proving ground. The special edition will pair celebrities with veteran participants called “Elite Ninjas,” who will act in a coaching capacity as the celebs navigate the elaborately arduous courses. Amell will be partnered with the show’s female standout and poster-woman Kacy Cantanzaro.\n\nAdditionally, the Red Nose Day edition of American Ninja Warrior will see celebs Erika Christensen (Parenthood) pair with Flip Rodriguez, Derek Hough (Dancing with the Stars) with Daniel Gil, Natalie Morales (NBC’s Today) with Grant McCartney, Ashton Eaton (Olympic gold medalist) with Kevin Bull, Nikki Glaser (comedian/host) with Jessie Graff, Nick Swisher (former Yankees outfielder) with Drew Drechsel, Jeff Dye (comedian) with Meagan Martin and film star Mena Suvaru (American Beauty, the American Pie movies) with Natalie Duran.\n\nFor Amell, who trains vigorously in parkour and obstacle courses (as seen in the 2014 video above), running the American Ninja Warrior Course won’t even be his first high-profile real life challenge. The actor previously took on a scripted-but-perilous run in the WWE for a headline-generating feud with the wrestling company’s now-former superstar Stardust (née Cody Rhodes), culminating in a four-man tag-team match in which Amell, teamed with Neville, shined in a SummerSlam 2015 battle against Stardust and King Barrett. He’ll be in more comfortable form on the Ninja Warrior obstacle course, since its elements resemble his onscreen crime-fighting exploits and training, notably the core-killing bar ascension of the Salmon Ladder.\n\nArrow fans will want to catch Stephen Amell running the course on American Ninja Warrior when the Red Nose Day celebrity edition brings awareness to both African famine relief efforts and Amell’s real life talents. The episode airs on NBC on May 25.", "images": ["https://www.denofgeek.com/wp-content/uploads/2017/04/stephen-amell-arrow-season-5.jpg?fit=620%2C368", "https://www.denofgeek.com/wp-content/uploads/2017/04/stephen-amell-arrow-season-5.jpg?resize=620%2C368", "https://www.denofgeek.com/wp-content/uploads/2020/02/joseph-baxter.jpg?resize=200%2C200&filter=grayscale"], "top_img": "https://www.denofgeek.com/wp-content/uploads/2017/04/stephen-amell-arrow-season-5.jpg?fit=620%2C368", "keywords": [], "authors": ["Joseph Baxter", "Mike Mcmahon", "Mike Cecchini", "Den Of Geek Staff", "Kayti Burt", "John Saavedra", "Rosie Fletcher", "Lee Parham"], "canonical_link": "https://www.denofgeek.com/tv/arrow-star-stephen-amell-runs-american-ninja-warrior-course/", "title": "Arrow Star Stephen Amell Runs American Ninja Warrior Course", "meta_data": {"viewport": "width=device-width, initial-scale=1", "theme-color": "#d23226", "robots": "index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1", "p": {"domain_verify": "1893a020468964417f83c6a42b6791cf"}, "description": "Arrow’s Stephen Amell tests his parkour training in an upcoming celebrity edition of American Ninja Warrior.", "og": {"locale": "en_US", "type": "article", "title": "Arrow Star Stephen Amell Runs American Ninja Warrior Course", "description": "Arrow’s Stephen Amell tests his parkour training in an upcoming celebrity edition of American Ninja Warrior.", "url": "https://www.denofgeek.com/tv/arrow-star-stephen-amell-runs-american-ninja-warrior-course/", "site_name": "Den of Geek", "image": {"identifier": "https://www.denofgeek.com/wp-content/uploads/2017/04/stephen-amell-arrow-season-5.jpg?fit=620%2C368", "width": 620, "height": 368, "type": "image/jpeg"}}, "article": {"published_time": "2017-05-18T18:29:00+00:00"}, "author": "jbindeck2015", "twitter": {"card": "summary_large_image", "label1": "Written by", "data1": "Joseph Baxter", "label2": "Est. reading time", "data2": "2 minutes"}, "parsely-title": "Arrow Star Stephen Amell Runs American Ninja Warrior Course", "parsely-link": "http://www.denofgeek.com/tv/arrow-star-stephen-amell-runs-american-ninja-warrior-course/", "parsely-type": "post", "parsely-image-url": "https://www.denofgeek.com/wp-content/uploads/2017/04/stephen-amell-arrow-season-5.jpg?resize=150%2C150", "parsely-pub-date": "2017-05-18T18:29:00Z", "parsely-section": "TV", "parsely-author": "Joseph Baxter", "msapplication-TileImage": "https://www.denofgeek.com/wp-content/uploads/2020/02/favicon.geek_.purple.swirl_-1.png?fit=270%2C270"}, "movies": [], "publish_date": 1495132140.0, "source": "https://www.denofgeek.com", "summary": ""}