{"url": "https://en.wikipedia.org/wiki/Nicole_Kidman", "text": "American and Australian actress and producer\n\nNicole Mary Kidman (born 20 June 1967) is an American and Australian actress and producer. Known for her work across various film and television productions from several genres, she has continuously remained one of the world's highest-paid actresses. She is the recipient of numerous accolades, including an Academy Award, a British Academy Film Award, two Primetime Emmy Awards and six Golden Globe Awards.\n\nKidman began her acting career in Australia with the 1983 films Bush Christmas and BMX Bandits. Her breakthrough came in 1989 with the thriller film Dead Calm and the miniseries Bangkok Hilton. In 1990, she achieved international success with the action film Days of Thunder. She received greater recognition with lead roles in Far and Away (1992), Batman Forever (1995), To Die For (1995) and Eyes Wide Shut (1999). For her portrayal of writer Virginia Woolf in the drama The Hours (2002), Kidman won the Academy Award for Best Actress. She received additional Academy Award nominations for her roles in the musical Moulin Rouge! (2001) and the dramas Rabbit Hole (2010), Lion (2016) and Being the Ricardos (2021).\n\nKidman's television roles include Hemingway & Gellhorn (2012), Big Little Lies (2017–2019), Top of the Lake: China Girl (2017), The Undoing (2020) and Nine Perfect Strangers (2021). For Big Little Lies, she received two Primetime Emmy Awards, one for Outstanding Lead Actress and the other for Outstanding Limited Series as an executive producer.\n\nKidman has served as a Goodwill Ambassador for UNICEF since 1994 and for UNIFEM since 2006. In 2006, she was appointed Companion of the Order of Australia. She was married to actor Tom Cruise from 1990 to 2001 and has been married to country music singer Keith Urban since 2006. In 2010, she founded the production company Blossom Films. In 2004 and 2018, Time magazine included her on its list of the 100 most influential people in the world, and in 2020, The New York Times named her one of the greatest actors of the 21st century.\n\nEarly life [ edit ]\n\nNicole Mary Kidman was born on 20 June 1967 in Honolulu, Hawaii,[1][2] while her Australian parents were temporarily in the United States on student visas.[3] Her mother is a nursing instructor who edited her husband's books and was a member of the Women's Electoral Lobby; her father, Antony Kidman, was a biochemist, clinical psychologist, and author.[4] She also has a younger sister, Antonia Kidman, who is a journalist and TV presenter.[5] Having been born in the American state of Hawaii to Australian parents, Kidman holds dual citizenship of Australia and the United States.[6][7] She also has English, Irish, and Scottish ancestry.[8][9] Being born in Hawaii, she was given the Hawaiian name \"Hōkūlani\" ( ), meaning \"heavenly star.\" The inspiration came from a baby elephant born around the same time at the Honolulu Zoo.[10]\n\nWhen Kidman was born, her father was a graduate student at the University of Hawaiʻi at Mānoa. He became a visiting fellow at the National Institute of Mental Health of the United States. Opposed to the war in Vietnam, her parents participated in anti-war protests while living in Washington, D.C, having moved there shortly after Kidman's birth.[11] Her family eventually returned to Australia three years later.[12] She grew up in Sydney where she attended Lane Cove Public School and North Sydney Girls' High School. She was enrolled in ballet at the age of three and showed her natural talent for acting during her primary and high school years.[13]\n\nKidman has said she first aspired to become an actress upon watching Margaret Hamilton's performance as the Wicked Witch of the West in The Wizard of Oz.[14] She revealed that she was timid as a child, saying, \"I am very shy – really shy – I even had a stutter as a kid, which I slowly got over, but I still regress into that shyness. So I don't like walking into a crowded restaurant by myself; I don't like going to a party by myself.\"[15] During her teenage years, she attended the Phillip Street Theatre, alongside fellow actress Naomi Watts, and the Australian Theatre for Young People, where she took up drama and mime as she found acting to be a refuge. Owing to her fair skin and naturally red hair, the sun drove her to rehearse in the halls of the theatre.[13] A regular at the Phillip Street Theatre, she was encouraged to pursue acting full-time, which she did by dropping out of high school.[8][12]\n\nCareer [ edit ]\n\nEarly work and breakthrough (1983–1994) [ edit ]\n\nIn 1983, 16-year-old Kidman made her film debut in a remake of the Australian holiday classic Bush Christmas.[8] By the end of that year, she had a supporting role in the television series Five Mile Creek. In 1984, her mother was diagnosed with breast cancer, which caused Kidman to halt her acting work temporarily while she studied massage therapy in order to help her mother with physical therapy.[16] She began gaining recognition during this decade after appearing in several Australian films, such as the action comedy BMX Bandits (1983) and the romantic comedy Windrider (1986).[17] Throughout the rest of the 1980s, she appeared in various Australian television programs, including the 1987 miniseries Vietnam, for which she won her first Australian Film Institute Award.[18]\n\nKidman next appeared in the Australian film Emerald City (1988), based on the play of the same name, which earned her a second Australian Film Institute Award. She then starred alongside Sam Neill in the 1989 thriller Dead Calm as Rae Ingram, the wife of a naval officer who is menaced by a former lover, played by Billy Zane. The film proved to be her breakthrough role, and was one of the first films for which she gained international recognition.[19] Regarding her performance, Variety commented how \"throughout the film, Kidman is excellent. She gives the character of Rae real tenacity and energy.\"[20] Meanwhile, critic Roger Ebert noted the excellent chemistry between the leads, stating, \"Kidman and Zane do generate real, palpable hatred in their scenes together.\"[21] She followed that up with the Australian miniseries Bangkok Hilton before moving on to star alongside her then-boyfriend and future ex-husband, Tom Cruise, in the 1990 sports action film Days of Thunder, as a young doctor who falls in love with a NASCAR driver. Considered to be her international breakout film, it was among the highest-grossing films of the year.[22]\n\nIn 1991, Kidman co-starred alongside Thandiwe Newton and former classmate Naomi Watts in the Australian independent film Flirting.[23] They portrayed high school girls in this coming of age story, which won the Australian Film Institute Award for Best Film.[24] That same year, her work in the film Billy Bathgate earned Kidman her first Golden Globe Award nomination, for Best Supporting Actress. The New York Times, in its film review, called her \"a beauty with, it seems, a sense of humor\".[25] The following year, she and Cruise re-teamed for Ron Howard's Irish epic Far and Away (1992), which was a modest critical and commercial success.[26][27][28] In 1993, she starred in the thriller Malice, opposite Alec Baldwin, and the drama My Life, opposite Michael Keaton.[29][30]\n\nWorldwide recognition and critical acclaim (1995–2003) [ edit ]\n\nIn 1995, Kidman played Dr. Chase Meridian, the damsel in distress, in the superhero film Batman Forever, opposite Val Kilmer as the film's title character. That same year, she starred in Gus Van Sant's critically acclaimed dark comedy To Die For, in which she played the murderous newscaster Suzanne Stone. Regarding her performance, Mick LaSalle of the San Francisco Chronicle said \"[she] brings to the role layers of meaning, intention and impulse. Telling her story in close-up – as she does throughout the film – Kidman lets you see the calculation, the wheels turning, the transparent efforts to charm that succeed in charming all the same.\"[31] For her performance, she received her first Golden Globe Award. In the following years, she appeared alongside Barbara Hershey and John Malkovich in The Portrait of a Lady (1996), based on the novel of the same name, and starred in The Peacemaker (1997) as White House nuclear expert Dr. Julia Kelly, opposite George Clooney. The latter film grossed US$110 million worldwide.[32][33] In 1998, she starred alongside Sandra Bullock in the romantic comedy Practical Magic as two witch sisters who face a threatening curse that prevents them from ever finding lasting love. While the film opened at the top of the charts during its North American opening weekend, it was a commercial box office failure.[34][35] She returned to the stage that same year for the David Hare play The Blue Room, which opened in London.[36] For her performance, she received a Laurence Olivier Award nomination for Best Actress.[37]\n\nIn 1999, Kidman reunited with then-husband Tom Cruise to portray a Manhattan couple on a sexual odyssey in Eyes Wide Shut, their third film together and the final film of director Stanley Kubrick. It was subject to censorship controversies due to the explicit nature of its sex scenes.[38] After a brief hiatus and a highly publicised divorce from Cruise,[39] Kidman returned to the screen to play a mail-order bride in the British-American drama Birthday Girl.[40] In 2001, she took on the role of cabaret actress and courtesan Satine in Baz Luhrmann's musical Moulin Rouge!, opposite Ewan McGregor. Her performance and her singing received positive reviews; Paul Clinton of CNN called it her best work since To Die For, and wrote \"[she] is smoldering and stunning as Satine. She moves with total confidence throughout the film [...] Kidman seems to specialize in 'ice queen' characters, but with Satine, she allows herself to thaw, just a bit.\"[41] She subsequently received her second Golden Globe Award for Best Actress in a Motion Picture Musical or Comedy, among several other awards and nominations, including her first Academy Award nomination for Best Actress.[42][43]\n\nAlso in 2001, Kidman starred in Alejandro Amenábar's psychological horror film The Others (2001) as Grace Stewart, a mother living in the Channel Islands during World War II who suspects her house is haunted. Grossing over US$210 million worldwide, her performance earned her several award nominations, including a Goya Award nomination for Best Actress, in addition to receiving her second BAFTA Award and fifth Golden Globe Award nominations.[44][45] Roger Ebert commented that \"Alejandro Amenábar has the patience to create a languorous, dreamy atmosphere, and Nicole Kidman succeeds in convincing us that she is a normal person in a disturbing situation, and not just a standard-issue horror movie hysteric.\"[46]\n\nThe following year, Kidman garnered critical acclaim for her portrayal of Virginia Woolf in Stephen Daldry's The Hours, co-starring alongside Meryl Streep and Julianne Moore. Kidman famously wore prosthetics, which were applied to her nose, in order to portray the author during 1920s England, making her look almost unrecognisable. The film was a critical success, earning several awards and nominations, including a nomination for the Academy Award for Best Picture. The New York Times wrote that \"Ms. Kidman, in a performance of astounding bravery, evokes the savage inner war waged by a brilliant mind against a system of faulty wiring that transmits a searing, crazy static into her brain\".[47] She won numerous critic and industry awards for her performance, including her first BAFTA Award, third Golden Globe Award, and the Academy Award for Best Actress, becoming the first Australian to win the award.[12] During her Oscar's acceptance speech, she referenced the Iraq War which was occurring at the time when speaking about the importance of art saying, \"Why do you come to the Academy Awards when the world is in such turmoil? Because art is important. And because you believe in what you do and you want to honour that, and it is a tradition that needs to be upheld.\"[48] That same year, she was named the World's Most Beautiful Person by People magazine.[49]\n\nFollowing her Oscar win, Kidman appeared in three distinct films in 2003. The first of those, a leading role in director Lars von Trier's Dogville, was an experimental film set on a bare soundstage. Though the film divided critics in the United States, Kidman earned praise for her performance. Peter Travers of Rolling Stone stated, \"Kidman gives the most emotionally bruising performance of her career in Dogville, a movie that never met a cliche it didn't stomp on.\"[50] The second film was an adaptation of Philip Roth's novel The Human Stain, opposite Anthony Hopkins. Her third film that year was Anthony Minghella's war drama Cold Mountain, where she starred opposite Jude Law and Renée Zellweger, playing Southerner Ada Monroe, a woman who falls in love with Law's character and become separated by the Civil War. Regarding her performance, Time magazine wrote, \"Kidman takes strength from Ada's plight and grows steadily, literally luminous. Her sculptural pallor gives way to warm radiance in the firelight\".[51] The film garnered several awards and nominations, most notably for the performances of the cast, with Kidman receiving her sixth Golden Globe Award nomination for Best Actress.[52]\n\nEstablished actress (2004–2009) [ edit ]\n\nIn 2004, Kidman starred in the drama film Birth, which sparked controversy over a scene in which she shares a bath with her co-star Cameron Bright, then aged ten. During a press conference at the 61st Venice International Film Festival, she addressed the controversy saying, \"It wasn't that I wanted to make a film where I kiss a 10-year-old boy. I wanted to make a film where you understand love\".[53] For her performance, she received her seventh Golden Globe nomination. That same year, she starred alongside Matthew Broderick, Bette Midler, Christopher Walken and Glenn Close in the black comedy science-fiction film The Stepford Wives, a remake of the 1975 film of the same name, directed by Frank Oz. The following year, she starred opposite Sean Penn in the Sydney Pollack thriller The Interpreter, playing UN translator Silvia Broome, and starred alongside Will Ferrell in the romantic comedy Bewitched, based on the 1960s TV sitcom of the same name. While neither film fared well in the United States, both were international successes.[54][55] For the latter film, she and Ferrell earned the Razzie Award for Worst Screen Couple.[56]\n\nKidman in 2006\n\nIn conjunction with her success within the film industry, Kidman became the face of the Chanel No. 5 perfume brand. She starred in a campaign of television and print ads with Rodrigo Santoro, directed by Moulin Rouge! director Baz Luhrmann, to promote the fragrance during the holiday seasons of 2004, 2005, 2006 and 2008. The three-minute commercial produced for Chanel No. 5 made Kidman the record holder for the most money paid per minute to an actor after she reportedly earned US$12 million for the three-minute advert.[57] During this time, she was also featured as the 45th Most Powerful Celebrity on Forbes' 2005 Celebrity 100 List. She made a reported US$14.5 million between 2004 and 2005. On People magazine's list of 2005's highest-paid actresses, Kidman came in second behind Julia Roberts, with a US$16–17 million per-film price tag.[58]\n\nIn 2006, Kidman portrayed photographer Diane Arbus in the biographical film Fur, opposite Robert Downey Jr., and lent her voice to the animated film Happy Feet, which grossed over US$384 million worldwide, becoming her highest-grossing film at the time.[59] The following year, she starred in the science-fiction film The Invasion, a remake of the 1956 Invasion of the Body Snatchers, directed by Oliver Hirschbiegel, and starred opposite Jennifer Jason Leigh and Jack Black in Noah Baumbach's comedy-drama Margot at the Wedding, which earned her a Satellite Award nomination for Best Actress – Musical or Comedy.[60] Also in 2007, she starred as the main antagonist Marisa Coulter in the fantasy-adventure film The Golden Compass, which grossed over US$370 million worldwide, also becoming one of her highest-grossing films to date.[61]\n\nThe following year, Kidman reunited with Moulin Rouge! director Baz Luhrmann for the Australian period film Australia (2008), set in the remote Northern Territory during the Japanese attack on Darwin during World War II. Starring opposite Hugh Jackman, she played an Englishwoman feeling overwhelmed by the continent. Though the film received mixed reviews from critics,[62] it turned out to be a box office success, grossing over $211 million worldwide against a budget of $130 million.[63] In 2009, she appeared in the Rob Marshall musical Nine, portraying the muse Claudia Jenssen, alongside an ensemble cast consisting of Daniel Day-Lewis, Marion Cotillard, Penélope Cruz, Judi Dench, Fergie, Kate Hudson and Sophia Loren. Kidman, whose screen time was brief in comparison to the other actresses, performed the musical number \"Unusual Way\" alongside Day-Lewis. The film received several Golden Globe Award and Academy Award nominations, with Kidman earning her fourth Screen Actors Guild Award nomination, as part of the Outstanding Performance by a Cast in a Motion Picture award.[64]\n\nBiographical and independent films (2010–2015) [ edit ]\n\nKidman began the 2010s by producing and starring in the film adaptation of the Pulitzer Prize-winning play Rabbit Hole, alongside Aaron Eckhart.[65] Her performance as a grieving mother coping with the death of her son earned her critical acclaim, and she received nominations for the Academy Award, Golden Globe Award and Screen Actors Guild Award for Best Actress.[66][67] The following year, she appeared with Adam Sandler and Jennifer Aniston in Dennis Dugan's romantic comedy Just Go with It, as a trophy wife, and subsequently starred alongside Nicolas Cage in director Joel Schumacher's action-thriller Trespass, with the stars playing a married couple taken hostage.[68][69]\n\nKidman at the 2012 Tropfest in Sydney, Australia\n\nIn 2012, Kidman starred alongside Clive Owen in the HBO film Hemingway & Gellhorn, which depicted the relationship between journalist couple Ernest Hemingway and Martha Gellhorn.[70] For her performance as Gellhorn, she received her first Primetime Emmy Award nomination for Outstanding Lead Actress in a Miniseries or Movie.[71] That same year, she portrayed death row groupie Charlotte Bless in Lee Daniels' adaptation of the Pete Dexter novel, The Paperboy (2012).[72][73] The film competed at the 2012 Cannes Film Festival and Kidman's performance garnered her nominations for the Screen Actors Guild Award and the Saturn Award for Best Supporting Actress, in addition to her second Golden Globe Award nomination for Best Supporting Actress, her tenth nomination overall. Also in 2012, her audiobook recording of Virginia Woolf's To the Lighthouse was released through Audible.[74] The following year she starred as an unstable mother in Park Chan-wook's Stoker,[75] which was released to positive reception and a Saturn Award nomination for Best Supporting Actress. In April 2013, she was selected as a member of the main competition jury at the 2013 Cannes Film Festival.[76]\n\nIn 2014, Kidman starred as the titular character in the biographical film Grace of Monaco, which chronicles the 1962 crisis in which Charles de Gaulle blockaded the tiny principality, angered by Monaco's status as a tax haven for wealthy French subjects and Kelly's contemplative Hollywood return to star in Alfred Hitchcock's Marnie. Opening out of competition at the 2014 Cannes Film Festival, the film received largely negative reviews.[77] She also starred in two films with Colin Firth that year, the first being the British-Australian historical drama The Railway Man, in which she played an officer's wife.[78] Katherine Monk of the Montreal Gazette said of Kidman's performance, \"It's a truly masterful piece of acting that transcends Teplitzky's store-bought framing, but it's Kidman who delivers the biggest surprise: For the first time since her eyebrows turned into solid marble arches, the Australian Oscar winner is truly terrific\".[79] Her second film with Firth was the British thriller film Before I Go To Sleep, portraying a car crash survivor with brain damage.[80] Also in 2014, she appeared in the live-action animated comedy film Paddington as the film's main antagonist.[81]\n\nIn 2015, Kidman starred in the drama Strangerland, which opened at the 2015 Sundance Film Festival, and the Jason Bateman-directed The Family Fang, produced by Kidman's production company, Blossom Films, which premiered at the 2015 Toronto International Film Festival.[82] In her other 2015 film release, the biographical drama Queen of the Desert, she portrayed writer, traveller, political officer, administrator and archaeologist Gertrude Bell. That same year, she played a district attorney, opposite Julia Roberts and Chiwetel Ejiofor, in the little-seen film Secret in Their Eyes, a remake of the 2009 Argentine film of the same name, both based on the novel La pregunta de sus ojos by author Eduardo Sacheri.[83] After more than 15 years, she returned to the West End in the UK premiere of Photograph 51 at the Noël Coward Theatre. She starred as British scientist Rosalind Franklin, working for the discovery of the structure of DNA, in the production from 5 September to 21 November 2015, directed by Michael Grandage. The production was met with considerable praise from critics, particularly for Kidman, and her return to the West End was hailed a success.[84] For her performance, she won an Evening Standard Theatre Award and received a second Laurence Olivier Award nomination for Best Actress.[85][86]\n\nLion, Big Little Lies and continued acclaim (2016–present) [ edit ]\n\nIn 2016's Lion, Kidman portrayed Sue, the adoptive mother of Saroo Brierley, an Indian boy who was separated from his birth family, a role she felt connected to as she herself is the mother of adopted children.[87] She received positive reviews for her performance, in addition to her first Academy Award nomination for Best Supporting Actress, her fourth nomination overall, and her eleventh Golden Globe Award nomination, among several others. Richard Roeper of the Chicago Sun-Times thought that \"Kidman gives a powerful and moving performance as Saroo's adoptive mother, who loves her son with every molecule of her being, but comes to understand his quest. It's as good as anything she's done in the last decade.\"[88] Budgeted at US$12 million, Lion earned over US$140 million globally.[89] She also gave a voice-over performance for the English version of the animated film The Guardian Brothers.[90]\n\nIn 2017, Kidman returned to television for Big Little Lies, a drama series based on Liane Moriarty's novel of the same name, which premiered on HBO. She also served as executive producer alongside her co-star, Reese Witherspoon, and the show's director, Jean-Marc Vallée. She played Celeste Wright, a former lawyer and housewife, who conceals an abusive relationship with her husband, played by Alexander Skarsgård. Matthew Jacobs of The Huffington Post considered that she \"delivered a career-defining performance\",[91] while Ann Hornaday of The Washington Post wrote that \"Kidman belongs in the pantheon of great actresses\".[92] She won the Primetime Emmy Award for Outstanding Lead Actress in a Limited Series or Movie for her performance, as well as the Primetime Emmy Award for Outstanding Limited Series as a producer. She also received a Screen Actors Guild Award, two Critics' Choice Television Awards and two Golden Globe Awards for her work in the show.[93][94]\n\nKidman next played Martha Farnsworth, the headmistress of an all-girls school during the American Civil War, in Sofia Coppola's drama The Beguiled, a remake of the 1971 film of the same name, which premiered at the 2017 Cannes Film Festival, competing for the Palme d'Or.[95] Both films were adaptations of a novel by Thomas P. Cullinan. The film was an arthouse success, and Katie Walsh of the Tribune News Service found Kidman \"particularly, unsurprisingly excellent in her performance as the steely Miss Martha. She is controlled and in control, unflappable. Her genteel manners and femininity co-exist easily with her toughness.\"[96] Kidman had two other films premiere at the festival: the science-fiction romantic comedy How to Talk to Girls at Parties, reuniting her with director John Cameron Mitchell,[97][98] and the psychological thriller The Killing of a Sacred Deer, directed by Yorgos Lanthimos, which also competed for the Palme d'Or.[97][98] Also in 2017, she played supporting roles in the BBC Two television series Top of the Lake: China Girl and in the comedy-drama The Upside, a remake of the 2011 French comedy The Intouchables, starring Bryan Cranston and Kevin Hart.[99]\n\nIn 2018, Kidman starred in two dramas—Destroyer and Boy Erased. In the former, she played a detective troubled by a case for two decades. Peter Debruge of Variety and Brooke Marine of W both found her \"unrecognizable\" in the role and Debruge added that \"she disappears into an entirely new skin, rearranging her insides to fit the character's tough hide\",[100] whereas Marine highlighted Kidman's method acting.[101] The latter film is based on Garrard Conley's Boy Erased: A Memoir, and features Russell Crowe and Kidman as socially conservative parents who send their son (played by Lucas Hedges) to a gay conversion program. Richard Lawson of Vanity Fair credited all three performers for \"elevating the fairly standard-issue material to poignant highs\".[102] That same year, Kidman took on the role of Queen Atlanna, the mother of the title character, in the DC Extended Universe superhero film Aquaman, which grossed over US$1.1 billion worldwide, becoming her highest-grossing film to date.[103][104] Also in 2018, she was interviewed for a BAFTA event A Life in Pictures, where she reflected on her extensive film career.[105]\n\nForbes ranked her as the fourth highest-paid actress in the world in 2019, with an annual income of $34 million.[106] In 2019, she took on the supporting part of a rich socialite in John Crowley's drama The Goldfinch, an adaptation of the novel of the same name by Donna Tartt, starring Ansel Elgort.[107] Although it was poorly received, Owen Gleiberman commended Kidman for playing her part with \"elegant affection\".[108][109] She next co-starred alongside Charlize Theron and Margot Robbie in the drama Bombshell, a film depicting the scandal concerning the sexual harassment accusations against former Fox News CEO Roger Ailes, in which she portrayed journalist Gretchen Carlson.[110] Manohla Dargis of The New York Times opined that despite lesser screen time than her two co-protagonists, Kidman successfully made Carlson \"ever-so-slightly ridiculous, adding a sharp sliver of comedy that underscores how self-serving and futile her rebellious gestures at the network are\".[111] For her performance, she received an additional Screen Actors Guild Award nomination for Outstanding Performance by a Female Actor in a Supporting Role.[112]\n\nKidman started off the 2020s with her role of Grace Fraser, a successful New York therapist, in the HBO psychological thriller miniseries The Undoing, based on the novel You Should Have Known by Jean Hanff Korelitz.[113][114] She served as executive producer alongside the show's director, Susanne Bier, and David E. Kelley, who previously adapted and produced Big Little Lies. For her performance, she received additional Golden Globe Award and Screen Actors Guild Award nominations.[115][116] Her only film release of 2020 was the musical comedy The Prom, based on the Broadway musical of the same name, starring alongside Meryl Streep, James Corden and Keegan-Michael Key.[117] The following year, she starred and served as executive producer on the Hulu drama miniseries Nine Perfect Strangers, based on the novel of the same name by Liane Moriarty.[118][119] That same year, she portrayed actress-comedian Lucille Ball alongside Javier Bardem as Ball's husband, Desi Arnaz, in the biographical drama Being the Ricardos, directed by Aaron Sorkin.[120][121] Despite unfavourable reactions in response to her casting as Ball,[122] her portrayal was met with critical acclaim.[123][124][125] She subsequently won the Golden Globe Award for Best Actress in a Motion Picture – Drama for her performance,[126] in addition to receiving nominations for the Critics' Choice Movie Award for Best Actress and the Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Leading Role, as well as her fourth Academy Award nomination for Best Actress, her fifth nomination overall.[127][128][129]\n\nIn September 2021, Kidman starred in a commercial for AMC Theatres entitled \"We Make Movies Better,\" which would play before every film in the theaters owned by the chain beginning that month and Kidman's sponsorship was later extended for another year in August 2022.[130][131] The commercial and Kidman's delivery of her speech proved popular with audiences who viewed it as a way to drive moviegoers back to seeing films theatrically in the midst of the COVID-19 pandemic.[132]\n\nIn April 2022, Kidman appeared in an episode of the anthology series Roar, based on Cecelia Ahern's 2018 short story collection, in addition to serving as executive producer.[133] That same month, she starred alongside her Big Little Lies co-star Alexander Skarsgård, Anya Taylor-Joy, Ethan Hawke and Willem Dafoe in the historical drama The Northman, directed by Robert Eggers.[134] The film was received with widespread acclaim upon its release.[135][136]\n\nUpcoming projects [ edit ]\n\nKidman will be reprising the role of Queen Atlanna in the sequel to the 2018 superhero film Aquaman, titled Aquaman and the Lost Kingdom.[137][138] She is also set to star and serve as executive producer on four television series: the drama miniseries Expats, the series adaptation of the Norwegian drama film Hope, the thriller miniseries Pretty Things, based on the upcoming novel of the same name by Janelle Brown, and the family-drama series Things I Know To Be True, based on the Australian play of the same name.[139][140][141] Unlike her other television projects, Things I Know To Be True is envisioned as an ongoing series with multiple seasons rather than a miniseries.[142] Kidman is also set to voice Queen Ellsmere in the animated fantasy film Spellbound.[143]\n\nReception and legacy [ edit ]\n\nKidman is often regarded to be among the finest actresses of her generation.[144][145] She has been noted for seeking eccentric roles in risky projects helmed by auteurs, as well as for her volatile performances and versatile work, having appeared in a variety of eclectic films from several genres throughout her extensive career spanning over nearly four decades.[146][136] Vanity Fair stated that, despite struggling with her personal life being publicly scrutinised by the media during the early years of her career, \"[Kidman] has shown herself to be a major talent, a remarkable actress who can get in there with the best of them, go toe-to-toe, and come out with her credibility intact. What's more, she's proved herself to be a star with a capital S, the one-in-a-generation kind who, like Elizabeth Taylor, is bigger than the Hollywood system, and is also unafraid to be human and real, which only makes her more popular.\"[147] According to The New York Times, \"the plucky, disciplined indomitability she brings to her performances, even more than the artistry she displays within them, may be the secret of her appeal, the source of her bond with the audience.\"[148] Emily Nussbaum of The New Yorker commented how \"in each role, there is something waxen and watchful and self-possessed about Kidman, so that, even when she's smiling, she never seems liberated. While other actors specialize in transparency, Kidman has a different gift: she can wear a mask and simultaneously let you feel what it's like to hide behind it.\"[149] In 2004 and 2018, Time magazine named Kidman one of the 100 most influential people in the world on their annual Time 100 list.[150][151] In 2020, The New York Times ranked her fifth on its list of the 25 greatest actors of the 21st century up to that point.[152]\n\n\"I'm a character [actor]. I was trained as a character actor. That's what I want to do. I believe in changing the way you look, the way you move, the way you speak. I'm not great at playing myself, so what really gives me the greatest satisfaction is changing into something else.\" — Kidman on her approach to acting[153]\n\nKidman is known to practise method acting for many of her roles.[154] It has been noted that she oftentimes transforms herself physically, mentally and emotionally in order to resemble her characters,[155][156] to the point where it has adversely affected her health.[157] Mark Caro from the Los Angeles Times stated that \"to Nicole Kidman, acting isn't a mere technical feat; it's the art of transformation. To hear her tell it, the change can be as dramatic as a caterpillar-into-butterfly metamorphosis. She'll be working and working to get under the skin of a character.\"[158] W Magazine described her as a \"cipher\", and pointed out how \"she gets under her character's skin so thoroughly, it's nearly impossible to distinguish the actress from the role. It's why she has become so synonymous with a few key roles [...] and why those films are so defined by Kidman's presence in them.\"[159]\n\nScholars have also commented on her acting style and approach to roles. Sharon Marie Carnicke, a professor of critical studies and acting at the USC School of Dramatic Arts, mentioned that \"Kidman's [acting] choices are believable and natural as reactions to the specific circumstances in her world\" and described her work as \"kinetic\".[160] Dennis Bingham, a professor of English and director of film studies at Indiana University–Purdue University Indianapolis, stated that \"Kidman acts always a step or two outside the character, telegraphing her reactions, elongating the time she takes to articulate her decisions and conclusions. Even her emotional responses are presented as signs.\"[161] Pam Cook, a professor of film at the University of Southampton, suggests in her biography of Kidman that \"her emphasis on artifice and technique points to a conception of screen acting that looks to cinematic expression rather than to the actor's body and intentions for the realisation of character.\"[162] Mary Luckhurst, a professor and head of the University of Bristol School of Arts with credentials in theatre and performance, stated how \"she has strategically pursued a high-risk mutability and versatility, and regularly traverses between naturalist and non-naturalist roles and artforms.\" She continues saying that \"she can continually test her own emotional limits, physical skills, politics, values and frames of reference\" and mentions how \"her conception of character acting involves metamorphosing gradually into something that she feels is so 'other' that she frequently speaks of losing herself or getting lost in the role, and her preparedness to challenge herself in this respect has continually surprised other actors, directors and producers.\"[163]\n\nKidman has also been described as a fashion icon.[164] The chartreuse Dior gown she wore to the 1997 Academy Awards is regarded as one of the greatest dresses in Oscar history and has been credited with changing red carpet fashion forever.[165] Vogue described how \"from her embroidered chartreuse John Galliano for Christian Dior gown in 1997, at the side of then-husband Tom Cruise, to that impeccable red Balenciaga moment at the 2007 Oscars, to the unforgettable Calvin Klein ballerina dress she wore to the 2017 Cannes Film Festival, the Australian native has mastered the art of red carpet dressing, always piquing our [interest] and taking risks while never overdoing it.\"[166] Insider stated that \"over the years, Kidman has experimented with all sorts of trends, including bold colors, statement jewelry, and everything in between, making herself one of the most iconic celebrities when it comes to her fashion choices.\"[167] In 2003, she received the Fashion Icon Award, which was awarded to her by the Council of Fashion Designers of America.[164] Regarding her bestowal, Peter Arnold, executive director of the CFDA, said in a statement, \"Nicole Kidman's style, both on and off the screen, has had an undeniable impact on fashion. As an actress, she has developed her many memorable characters with an innate understanding of the artistry of clothes. At the same time, she has elegantly established her personal style and own iconic presence worldwide.\"[168]\n\nPersonal life [ edit ]\n\nRelationships and family [ edit ]\n\nKidman has been married twice: first to actor Tom Cruise, and later to country singer Keith Urban. Kidman met Cruise in 1989 while working on the set of Days of Thunder, a film in which they both starred, and they married on Christmas Eve of 1990 in Colorado.[169][170] While married, the couple adopted a daughter and a son.[171] On 5 February 2001, the couple's spokesperson announced their separation.[172] Cruise filed for divorce two days later, and their marriage was dissolved later that year, with Cruise citing irreconcilable differences.[173] In a 2007 interview with Marie Claire, Kidman noted the incorrect reporting of an ectopic pregnancy early in her marriage. \"It was wrongly reported as miscarriage by everyone who picked up the story. So it's huge news, and it didn't happen.\"[174]\n\nIn the June 2006 issue of Ladies' Home Journal, Kidman revealed that she still loved Cruise despite their divorce: \"He was huge; still is. To me, he was just Tom, but to everybody else, he is huge. But he was lovely to me and I loved him. I still love him.\" In addition, she expressed shock about the divorce.[173] In 2015, former Church of Scientology executive Mark Rathbun claimed in a documentary film that he was instructed to \"facilitate [Cruise's] break-up with Nicole Kidman\".[175] Cruise's auditor further claimed Kidman had been wiretapped on Cruise's suggestion.[176] In an interview with Tina Brown at the 2015 Women in the World conference, she expressed that the attention surrounding her at the time turned to her career after the divorce from Cruise: \"Out of my divorce came work that was applauded, so that was an interesting thing for me.\" She went on to receive an Academy Award in 2003, shortly after her divorce.[177]\n\nPrior to marrying Cruise, Kidman had been involved in relationships with Australian actor Marcus Graham and Windrider co-star Tom Burlinson.[178][179][180] The film Cold Mountain brought rumours that an affair between Kidman and co-star Jude Law was responsible for the break-up of his marriage. Both denied the allegations, and Kidman won an undisclosed sum from the British tabloids that published the story.[181] She began dating musician Lenny Kravitz in 2003 before becoming engaged to him, but they ultimately decided to break off their engagement.[182] She was also romantically involved with rapper Q-Tip.[183]\n\nDuring an interview for Vanity Fair in 2007, Kidman mentioned that she had been secretly engaged to someone, later revealed to have been Lenny Kravitz, prior to her present relationship with New Zealand-Australian country singer Keith Urban,[184][185] whom she met in 2005 at G'Day LA, an event honouring Australians.[186] Kidman married Urban on 25 June 2006 at Cardinal Cerretti Memorial Chapel on the grounds of St Patrick's Estate, Manly, in Sydney.[187][188] In a 2015 interview, regarding her relationship with Urban, Kidman said, \"We didn't really know each other – we got to know each other during our marriage.\"[177] They maintain homes in Nashville (Tennessee, U.S.),[189] Beverly Hills (California, U.S.),[190] two apartments in Sydney (New South Wales, Australia),[191] a farmhouse in Sutton Forest (New South Wales, Australia), and an apartment in Manhattan (New York, U.S.).[191] The couple's first daughter was born in 2008, in Nashville.[192][193] In 2010, Kidman and Urban welcomed their second daughter via gestational surrogacy[194] at Nashville's Centennial Women's Hospital.[195][196]\n\nReligious and political views [ edit ]\n\nKidman was brought up in a Catholic family and remains practising.[197][198] She attended Mary Mackillop Chapel in North Sydney. Following criticism by Catholic leaders regarding her role in The Golden Compass as anti-Catholic,[199][200] Kidman told Entertainment Weekly that the Catholic Church is part of her \"essence\", and that her religious beliefs would prevent her from taking a role in a film she perceived as anti-Catholic.[201] Since her divorce from Tom Cruise, she has been reluctant to discuss Scientology.[202][203]\n\nA supporter of women's rights,[204] Kidman testified before the United States House of Representatives Committee on Foreign Affairs to support the International Violence Against Women Act in 2009.[205] In January 2017, she stated her support for the legalisation of same-sex marriage in Australia.[206] Kidman has also donated to U.S. Democratic party candidates.[207]\n\nWealth, philanthropy and honours [ edit ]\n\nKidman has featured in annual rankings of the world's highest-paid actors multiple times, including the top spot for a woman in 2006.[208] In 2002, she first appeared on the Australian rich list published annually in the Business Review Weekly with an estimated net worth of A$122 million.[209] In the 2011 published list, Kidman's wealth was estimated at A$304 million, down from A$329 million in 2010.[210] In 2015, her wealth was estimated to have risen up to A$331 million.[211][212]\n\nKidman has raised money for, and drawn attention to, disadvantaged children around the world. In 1994, she was appointed a Goodwill Ambassador for UNICEF.[213] She also joined the Little Tee Campaign for breast cancer care to design T-shirts or vests to raise money to fight the disease;[214] motivated by her mother's own battle with breast cancer in 1984.[215] Kidman was also appointed Goodwill Ambassador of the United Nations Development Fund for Women (UNIFEM) in 2006.[216][213] She visited Kosovo in 2006 to learn about women's experiences of conflict and UNIFEM's support efforts.[217] She is also the international spokesperson for UNIFEM's Say NO – UNiTE to End Violence against Women initiative.[218] Kidman and the UNIFEM executive director presented over five million signatures collected during the first phase of this to the UN Secretary-General on 25 November 2008.[219] On 8 January 2010, alongside Nancy Pelosi, Joan Chen and Joe Torre, Kidman attended the ceremony to help the Family Violence Prevention Fund break ground on a new international centre located in the Presidio of San Francisco.[220][221] In 2014, Kidman designed a gold coloured Paddington Bear statue, one of fifty located around London prior to the release of the film Paddington, which was auctioned to raise funds for the National Society for the Prevention of Cruelty to Children (NSPCC).[222] In 2016, she donated $50,000 to UN Women.[223]\n\nIn 2004, Kidman was honoured as a \"Citizen of the World\" by the United Nations.[224] During the 2006 Australia Day Honours, she was appointed Companion of the Order of Australia (AC) for \"service to the performing arts as an acclaimed motion picture performer, to health care through contributions to improve medical treatment for women and children and advocacy for cancer research, to youth as a principal supporter of young performing artists, and to humanitarian causes in Australia and internationally\".[225][226] However, due to film commitments and her wedding to Urban, it was not until 13 April 2007 that she was presented with the honour.[227] It was presented by the Governor-General of Australia, Major General Michael Jeffery, in a ceremony at Government House, Canberra.[228] At the beginning of 2009, Kidman appeared in a series of postage stamps featuring Australian actors. She, Geoffrey Rush, Russell Crowe, and Cate Blanchett each appear twice in the series: once as themselves and once as their Academy Award-nominated characters, with Kidman appearing as Satine from Moulin Rouge!.[229]\n\nOther work [ edit ]\n\nKidman has taken part in several endorsement deals representing various companies.[230] In 2003, she served as the face of the Chanel No. 5 perfume.[231] She has also served as an ambassador for Omega watches since 2005.[232] In 2007, Nintendo announced that she would be the new face of Nintendo's advertising campaign for the Nintendo DS game More Brain Training in its European market.[233] In 2013, she served as the face of Jimmy Choo shoes.[234] In 2015, she became the brand ambassador for Etihad Airways.[235] In 2017, she was announced as the new face of Neutrogena.[236] In 2020, she joined SeraLabs as their global brand ambassador.[237]\n\nKidman supports the Nashville Predators, being seen and photographed almost nightly throughout the season.[238] Additionally, she supports the Sydney Swans in the Australian Football League and once served as a club ambassador.[239]\n\nActing credits and awards [ edit ]\n\nAccording to the review aggregation website Rotten Tomatoes, which assigns film scores based on critic reviews and audience reception, some of Kidman's highest-scoring films include Paddington (2014), Flirting (1990), To Die For (1995), Rabbit Hole (2010), Lion (2016), The Others (2001), The Family Fang (2015), Dead Calm (1989), Boy Erased (2018), The Killing of a Sacred Deer (2017) and The Northman (2022).[240] Her most financially successful films include Aquaman (2018), Happy Feet (2006), The Golden Compass (2008), Batman Forever (1995) and Paddington (2014), as listed by the box office tracking website The Numbers as her highest-grossing films.[241] Her other screen credits include:\n\nIn 2003, Kidman received a star on the Hollywood Walk of Fame for her achievements in the motion picture industry.[242][243] In addition to her Academy Award for Best Actress win, she has received many other awards and nominations for her performances on the screen and stage, including four additional Academy Award nominations, one BAFTA Award from five nominations, two Laurence Olivier Award nominations, two Primetime Emmy Awards from three nominations, a Screen Actors Guild Award from fifteen nominations, three Critics' Choice Awards from fifteen nominations and six Golden Globe Awards from seventeen nominations, among various others.[244][37][86]\n\nDiscography [ edit ]\n\nKidman's discography consists of several audio recordings, including one spoken word album, one extended play and three singles.[245] Kidman, primarily known for her acting career, entered the music industry during the early 2000s after recording a number of tracks for the original motion picture soundtrack to Baz Luhrmann's 2001 musical film Moulin Rouge!, which she starred in.[246] Her duet with Ewan McGregor entitled \"Come What May\" was released as her debut single and the second single off of the film's original soundtrack album through Interscope Records on 24 September 2001. The composition became the eighth-highest selling single by an Australian artist that year,[247] being certified Gold by the Australian Recording Industry Association,[248] while peaking at number twenty-seven on the UK Singles Chart.[249] In addition, the song received a Best Original Song nomination at the 59th Golden Globe Awards[250] and was listed at eighty-fifth within AFI's 100 Years...100 Songs by the American Film Institute.[251]\n\n\"Somethin' Stupid\", a cover version of Frank and Nancy Sinatra's version, followed soon after. The track, recorded as a duet with English singer-songwriter Robbie Williams, was issued on 14 December 2001 by Chrysalis Records as the lead single off his fourth studio album, Swing When You're Winning.[252] Kidman's second single topped the official music charts in New Zealand,[253] Portugal,[254] and the UK, in addition to reaching top ten placings all over Europe, including Austria,[255] Belgium,[256] Denmark,[257] Germany,[258] the Netherlands,[259] Norway[260] and Switzerland,[261] as well as Australia. Apart from being certified either Gold[262] or Silver[263] in a number of countries, it was ranked as the thirteenth best-selling single of 2002 in the UK, the fifty-ninth in Australia[264] and the ninety-third in France,[265] respectively. The song peaked at No. 8 on the Australian ARIAnet Singles Chart and at No. 1, for three weeks, in the UK.[266]\n\nOn 5 April 2002, Kidman released through Interscope Records her third single, a cover of Randy Crawford's \"One Day I'll Fly Away\".[267] The song, a Tony Philips remix, was promoted as the pilot single for the follow-up to the Moulin Rouge! original soundtrack, titled Moulin Rouge! Vol. 2. In 2006, she contributed to the original motion picture soundtrack of Happy Feet, recording a rendition of the Prince song \"Kiss\" for the film.[268] In 2009, she was featured on the original soundtrack of Rob Marshall's 2009 musical film Nine, recording the song \"Unusual Way\".[269] In 2012, she narrated an audiobook and in 2017, she contributed with background vocals to her husband's, country music singer Keith Urban, song titled \"Female\".[270][271]\n\nSee also [ edit ]\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Nicole_Kidman_%28cropped%29.jpg/170px-Nicole_Kidman_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/01/Nicole_Kidman_2011.jpg/170px-Nicole_Kidman_2011.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/27px-Wikidata-logo.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/28px-Video-x-generic.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/Nicole_Kidman_2003.jpg/170px-Nicole_Kidman_2003.jpg", "https://upload.wikimedia.org/wikipedia/commons/e/e0/Nicole_Kidman_Cannes_2017.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/9/94/Symbol_support_vote.svg/19px-Symbol_support_vote.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Nicole_Kidman_2010_%284838066646%29_%28cropped%29.jpg/220px-Nicole_Kidman_2010_%284838066646%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/28px-P_vip.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Nicole_Kidman_2_%2829900987478%29.jpg/170px-Nicole_Kidman_2_%2829900987478%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b9/Flag_of_Australia.svg/32px-Flag_of_Australia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Nicole_Kidman_Cannes_2017.jpg/220px-Nicole_Kidman_Cannes_2017.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Nicole_kidman3cropped.jpg/170px-Nicole_kidman3cropped.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/23px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2d/Nicole_Kidman_2016_TIFF.jpg/170px-Nicole_Kidman_2016_TIFF.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Nicole_Kidman_%26_Keith_Urban_03_%28Cropped%29.jpg/170px-Nicole_Kidman_%26_Keith_Urban_03_%28Cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/20px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a3/Nicole_Kidman_3%2C_2012.jpg/170px-Nicole_Kidman_3%2C_2012.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Nicole_Kidman_Cannes_2017.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Nicole_Kidman", "title": "Nicole Kidman", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Nicole_Kidman_Cannes_2017.jpg", "width": 640, "height": 908}, "title": "Nicole Kidman - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}