{"url": "https://www.dailymail.co.uk/femail/article-6460231/Kate-Middleton-wears-Princess-Dianas-tiara-joins-William-Queens-Diplomatic-Reception.html", "text": "Advertisement\n\nThe Duchess of Cambridge dazzled in a tiara that once belonged to Princess Diana at a glittering Buckingham Palace reception on Tuesday night.\n\nKate, 36, joined husband Prince William, 36, the Queen, 92, and the Duke and Duchess of Cornwall for the Diplomatic Reception, an annual white tie affair and one of the highlights of the royal calendar.\n\nThe royal mother-of-three looked breathtaking in an embellished off-white gown with a flattering cowl neck and capped sleeves.\n\nThe sparkling number, believed to be a new addition to the royal wardrobe, twinkled beneath the soft lights of the Buckingham Palace rooms as Kate greeted some of the roughly 1,000 guests in attendance.\n\nThe duchess, who hosted a Christmas party for RAF families at Kensington Palace just hours earlier, accessorised with a favourite pair of pearl drop earrings and finished the look with the stunning Cambridge Lover's Knot Tiara - a piece that she has worn on a number of previous occasions.\n\nThe Duchess of Cambridge, 36, glittered in an embellished gown as she joined husband Prince William, 36, the Queen, 92, and the Duke and Duchess of Cornwall for the Diplomatic Reception at Buckingham Palace on Tuesday night\n\nThe Duchess of Cambridge accessorised with a favourite pair of pearl drop earrings and proudly wore the yellow ribbon of the Queen's Royal Order pinned to her chest\n\nThe Queen, 92, looked regal in a white gown with delicate tiered lace overlay as she greeted the ambassador of Norway at the evening reception at Buckingham Palace. The monarch paired the dress with a metallic gold handbag and heels\n\nThe Duchess of Cornwall was resplendent in an oyster coloured satin evening coat, left, which she wore over a floor-length gown, as she arrived with the Queen and Prince Charles, seen left and right\n\nThe Duchess of Cambridge appeared in excellent spirits, beaming as she mingled with the guests at the lavish reception\n\nThe Duchess' embellished dress glimmered beneath the soft lights of the Buckingham Palace room where guests mingled\n\nRadiant Kate appeared perfectly charming as she spoke to guests ahead of the lavish meal at the palace on Tuesday\n\nAs Kate charmed guests at the reception, the Duchess of Sussex joined her husband Prince Harry at a carol concert held in memory of a close friend of his, Henry van Straubenzee, who was killed in a car accident aged just 18.\n\nMeghan delivered a reading to the congregation at St Luke's Church in Chelsea, which also included Pippa Middleton and her brother James, her husband James Matthews, and her parents, Carole and Michael Middleton.\n\nThe Cambridge Lover's Knot tiara, seen on her late mother-in-law the Princess of Wales in Hong Kong, has become a favourite of Kate's for formal royal occasions\n\nRumours of a rift between the two Duchesses have swirled in recent days, following the news that Meghan and Harry are preparing to leave Kensington Palace to set up home in Windsor, at Frogmore Cottage - 25 miles from William and Kate, who live at Apartment 1a with their children, George, Charlotte and Louis.\n\nLast night's reception also called for a quick turnaround for Prince Charles, 70, who stepped out in white tie just hours after donning a suit for a special Westminster Abbey service celebrating Christians in the Middle East.\n\nHis wife the Duchess of Cornwall was the picture of elegance in a satin oyster coloured evening coat, which she wore over a dress of a similar material and slightly lighter colour.\n\nThe ensemble is very similar to one worn by Camilla, 71, to the Buckingham Palace state banquet honouring Queen Maxima and King Willem-Alexander of the Netherlands in October.\n\nMeanwhile the Queen put on a regal display in floor-length satin gown with a delicate tiered lace overlay.\n\nAdding to the sense of occasion, Her Majesty swapped her favoured black handbag and leather shoes for metallic gold accessories.\n\nJoined by her family, the Queen appeared in excellent spirits as she greeted some of the roughly 1,000 guests invited to the reception, including ambassadors and high commissioners posted in the UK.\n\nThe Duchess of Cambridge appeared animated as she spoke to guests at the Diplomatic Reception on Tuesday night\n\nThe Duchess of Cambridge, who has already appeared at an official engagement today, looked stunning at the royal reception\n\nThe Duke and Duchess of Cornwall greeted guests together as they supported the Queen at the annual palace reception\n\nAn honour from the Queen: The Royal Family Order worn by the Duchess of Cambridge The Duchess of Cambridge is wearing the Royal Family Order of Queen Elizabeth II, pictured, for the first time The Duchess of Cambridge is wearing the Royal Family Order of Queen Elizabeth II. The honour is bestowed by Her Majesty to female members of the royal family and is worn on white tie occasions such as state banquets and the annual Diplomatic Reception at Buckingham Palace. The order, which is also worn by the Duchess of Cornwall, Princess Anne and the Countess of Wessex, features a jewel encased image of the Queen pinned on a chartreuse yellow ribbon and worn on the left shoulder. The miniature portrait, painted on glass, depicts the Queen as a young woman in evening dress wearing the ribbon and star of the Order of the Garter. The image is bordered by diamonds and surmounted by a Tudor Crown in diamonds and red enamel. Its reverse, in silver-gilt, is patterned with rays and depicts the royal cypher and St. Edward's Crown in gold. The Duchess of Cambridge first wore the Order to a state dinner in honour of the King and Queen of the Netherlands in October 2018. Advertisement\n\nIn keeping with the white tie dress code, the Queen and Camilla also wore tiaras for the occasion.\n\nThe Duchess of Cornwall sported a Boucheron tiara that once belonged to the Queen Mother while the Queen opted for another piece from the royal collection.\n\nThe Duchess of Cornwall and the Duchess of Sussex also sported the Queen's Royal Order, which features a jewel encased image of the Queen pinned on a chartreuse yellow ribbon and worn on the left shoulder.\n\nThe miniature portrait, painted on glass, depicts the Queen as a young woman in evening dress wearing the ribbon and star of the Order of the Garter.\n\nThe Queen was followed by the Duke and Duchess of Cornwall and the Duke and Duchess of Cambridge, just seen, as she made her way into the lavish affair\n\nThe Queen looked animated as she spoke to the ambassador of Kuwait - one of the roughly 1,000 guests invited to the reception\n\nThe Queen greeted the ambassador of Honduras as the Duke and Duchess of Cornwall followed her down the line of guests\n\nThe Queen beamed as she was introduced to the esteemed guests invited to share in the festivities at Buckingham Palace\n\nQueen Elizabeth II was also spotted as she greeted guests at an evening reception for members of the Diplomatic Corps at Buckingham Palace in London, putting on an even more dazzling display in her tiara, necklace and earrings\n\nThe image is bordered by diamonds and surmounted by a Tudor Crown in diamonds and red enamel. Its reverse, in silver-gilt, is patterned with rays and depicts the royal cypher and St. Edward's Crown in gold.\n\nThe Order is also worn by Princess Anne and the Countess of Wessex.\n\nIt is the only the second time Kate has been photographed in the honour, having previously worn it to the state banquet in honour of the Dutch royals two months ago.\n\nIn a tribute to her late mother-in-law, the Duchess once again opted for the Cambridge Lover's Knot tiara, which has become a clear favourite for white tie events.\n\nKate, 36, joined husband Prince William , 36, and hundreds of esteemed guests for the Queen's the Diplomatic Reception, an annual white tie affair and one of the highlights of the royal calendar\n\nThe Duchess of Cambridge dazzled in a tiara that once belonged to Princess Diana as she arrived for a glittering Buckingham Palace reception on Tuesday night, pictured\n\nThough just a glimpse of Kate's outfit could be seen through the car window as she arrived, the duchess appeared to be wearing a sparkling white gown with metallic silver detailing on the shoulders\n\nThe Duke and Duchess of Cambridge arrived at Buckingham Palace together in the back of a chauffeur-driven Bentley\n\nKATE'S TIARA TRIBUTE TO HER LATE MOTHER-IN-LAW Diana in the Cambridge Lover's Knot Tiara in Hong Kong in 1989 The Cambridge Lover's Knot tiara is the one worn by the Duchess of Cambridge most frequently - and for very sentimental reasons. The tiara was made by Royal jewellers Garrard in 1914 to Queen Mary's personal design, from pearls and diamonds already in her family's possession. It was a copy of one owned by her grandmother, Princess Augusta of Hesse, who married the first Duke of Cambridge, seventh son of King George III, in 1818. In her will Queen Mary left the tiara to to the Queen who wore it frequently, including at an evening event in 1955. In 1981 she gave it as a wedding present to Prince William's mother, Diana, who wore it for the first time at the state opening of parliament that November. Diana also wore the tiara in 1985 on an official visit to Washington with Prince Charles. And since her death the glistening head piece has been worn by the Duchess of Cambridge who was most recently spotted wearing it at the state dinner during Queen Letizia and King Felipe VI's visit in 2017. It was also seen on Kate at last year's Diplomatic Reception. The Duchess of Cambridge most recently wore the Lover's Knot Tiara to the state banquet held in honour of Queen Maxima and King Willem-Alexander of the Netherlands in October 2018, pictured. Right, Kate with Rear Admiral Ludger Brummelaar Kate wore the tiara for the annual Diplomatic Reception at Buckingham Palace in December 2016, left, and in 2015, right Advertisement\n\nKate also wore the tiara to the Chinese state banquet in 2015, and the Spanish state banquet and the Diplomatic Reception last year.\n\nShe most recently wore the piece to the state banquet held in honour of Queen Maxima and King Willem-Alexander of the Netherlands in October.\n\nIt marks the second appearance for the busy royal couple today. Earlier they threw open the doors at Kensington Palace to welcome the families of RAF servicemen and women currently deployed overseas.\n\nThe white tie Diplomatic Reception is the main social event of the year in London for the diplomatic community and reflects the Queen’s importance in terms of the UK’s international relations.\n\nEarlier the Duke and Duchess of Cambridge threw a Christmas party in London for families and children of deployed personnel from RAF Coningsby and RAF Marham serving in Cyprus, with Kate looking suitably festive in a £1,500 tartan skirt by Emilia Wickstead\n\nReady for Christmas! Kate looked festive in a tartan skirt from Emilia Wickstead, which she teamed with a cashmere jumper from Brora. The mother-of-three wore her brunette locks in loose curls which fell around her shoulders\n\nIt is also the largest reception held at Buckingham Palace, requiring hours of intricate planning by the Master of the Household and the Marshal of the Diplomatic Corps, as well as the commandeering of almost every member of waiting staff.\n\nMore than 1,000 people from around 130 countries, including members of the British government, past Prime Ministers and the Archbishops of Canterbury and York attend the gathering.\n\nMost notable, however, are the many hundreds of ambassadors and embassy staff officially accredited to the Court of St James, often in brilliantly coloured and eye-catching national dress.", "images": ["https://i.dailymail.co.uk/i/furniture/fff/hub_link.png", "https://i.dailymail.co.uk/1s/2018/12/04/21/article-999-7011814-175_222x333.jpg", "https://i.dailymail.co.uk/1s/2022/03/24/06/5339630-6460859-The_Duchess_of_Cambridge_has_been_pictured_wearing_the_Royal_Fam-m-1_1648101988734.jpg", "https://i.dailymail.co.uk/1s/2018/12/04/22/7013776-6460231-The_Duchess_of_Cornwall_was_resplendent_in_an_oyster_coloured_sa-m-64_1543962171979.jpg", "https://i.dailymail.co.uk/1s/2018/12/04/22/7010682-6460231-The_Duchess_of_Cambridge_wore_the_tiara_for_the_annual_Diplomati-a-54_1543962052903.jpg", "https://i.dailymail.co.uk/1s/2022/10/07/19/63237265-0-image-a-5_1665166611837.jpg", "https://i.dailymail.co.uk/1s/2022/10/08/10/63251867-0-image-a-52_1665222075362.jpg", "https://i.dailymail.co.uk/1s/2018/12/04/22/7010614-6460231-Kate_with_Rear_Admiral_Ludger_Brummelaar-a-45_1543961940955.jpg", "https://i.dailymail.co.uk/1s/2022/10/06/11/63175999-0-image-a-4_1665052771946.jpg", "https://i.dailymail.co.uk/i/furniture/misc/logo_cookie_reg.png", "https://i.dailymail.co.uk/i/furniture/fff/preload-inline.gif", "https://i.dailymail.co.uk/1s/2018/12/04/21/7012304-0-image-a-40_1543958643051.jpg", "https://i.dailymail.co.uk/1s/2022/10/08/14/63255031-0-image-m-42_1665234123102.jpg", "https://i.dailymail.co.uk/i/furniture/fff/fff-hub-banner-extrawide.png", "https://i.dailymail.co.uk/1s/2022/10/08/12/63253803-0-image-a-8_1665229179700.jpg", "https://i.dailymail.co.uk/1s/2018/12/04/22/7014990-6460231-image-a-65_1543962178445.jpg", "https://i.dailymail.co.uk/fff2/images/2018/12/4/92793b884dd5b36b2b0982d534fdfbd7.jpg", "https://i.dailymail.co.uk/1s/2018/12/04/11/6988510-0-image-a-74_1543923358728.jpg", "https://i.dailymail.co.uk/1s/2022/10/08/20/63260797-0-image-m-49_1665257216869.jpg", "https://i.dailymail.co.uk/1s/2022/10/08/17/63258683-0-image-m-17_1665247734778.jpg", "https://i.dailymail.co.uk/fff2/images/2018/12/4/34bf5a3c5b313ebab5b75beb3333b569.jpg", "https://i.dailymail.co.uk/1s/2022/10/08/18/63259559-0-image-a-27_1665250918635.jpg", "https://i.dailymail.co.uk/1s/2018/12/04/22/7013786-6460231-image-a-38_1543961636267.jpg", "https://i.dailymail.co.uk/i/sitelogos/logo_mol.gif", "https://i.dailymail.co.uk/1s/2018/12/04/22/7013778-6460231-The_Queen_92_looked_regal_in_a_white_gown_with_delicate_tiered_l-a-58_1543962142687.jpg", "https://i.dailymail.co.uk/1s/2018/12/04/20/7010004-6460231-Though_just_a_glimpse_of_Kate_s_outfit_could_be_seen_through_the-m-18_1543956361885.jpg", "https://i.dailymail.co.uk/1s/2022/10/08/18/63259209-0-image-m-15_1665250344055.jpg", "https://i.dailymail.co.uk/1s/2022/10/05/16/63143153-0-image-m-173_1664984495874.jpg", "https://i.dailymail.co.uk/1s/2018/12/05/10/5340420-6460231-The_Cambridge_Lover_s_Knot_tiara_seen_on_her_late_mother_in_law_-a-1_1544004978619.jpg", "https://i.dailymail.co.uk/i/furniture/comments/articles/btn_add-your-comment.png", "https://i.dailymail.co.uk/1s/2018/12/04/21/7013770-6460231-image-a-19_1543960492226.jpg", "https://i.dailymail.co.uk/1s/2022/10/08/20/63260529-0-image-m-24_1665258725263.jpg", "https://i.dailymail.co.uk/fff2/images/2018/12/4/0555633e407f43c7d0f3b06d8c6cf156.jpg", "https://i.dailymail.co.uk/1s/2018/12/04/22/7013788-6460231-image-a-35_1543961631483.jpg", "https://i.dailymail.co.uk/1s/2022/10/08/10/63251959-0-image-a-4_1665221371318.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://i.dailymail.co.uk/1s/2018/12/04/22/7013782-6460231-The_Duchess_embellished_dress_glimmered_beneath_the_soft_lights_-m-71_1543962320568.jpg", "https://i.dailymail.co.uk/i/furniture/facebook/DailyMail/DailyMail.png", "https://i.dailymail.co.uk/1s/2018/12/04/22/7014952-6460231-image-a-41_1543961822489.jpg", "https://i.dailymail.co.uk/1s/2022/10/08/19/63260577-0-image-a-8_1665254148212.jpg", "https://i.dailymail.co.uk/1s/2018/12/04/21/7012226-6460231-image-a-39_1543958640807.jpg", "https://i.dailymail.co.uk/i/furniture/fff/fff-hub-promo-banner-inline.png", "https://i.dailymail.co.uk/1s/2018/12/04/20/7009998-6460231-image-a-15_1543956152052.jpg", "https://i.dailymail.co.uk/1s/2018/12/04/20/7010788-6460231-image-a-34_1543956969391.jpg", "https://i.dailymail.co.uk/1s/2018/10/23/22/5340420-6308729-image-m-9_1540330600522.jpg", "https://i.dailymail.co.uk/1s/2018/12/04/22/7010582-6460231-The_Duchess_of_Cambridge_most_recently_wore_the_Lover_s_Knot_Tia-a-46_1543961940963.jpg", "https://i.dailymail.co.uk/1s/2018/12/04/22/7011642-6460231-image-m-53_1543962044039.jpg", "https://i.dailymail.co.uk/1s/2018/12/04/22/7014988-6460231-image-a-75_1543962375562.jpg", "https://i.dailymail.co.uk/i/furniture/comments/articles/icon_comments_74.png", "https://i.dailymail.co.uk/1s/2018/12/03/22/6965562-0-image-a-31_1543877005080.jpg", "https://i.dailymail.co.uk/1s/2022/10/08/19/63260507-0-image-a-94_1665254018608.jpg", "https://i.dailymail.co.uk/1s/2018/12/04/14/6995668-0-image-m-12_1543934242344.jpg", "https://i.dailymail.co.uk/1s/2022/10/08/15/63256101-0-image-m-37_1665238223374.jpg", "https://i.dailymail.co.uk/1s/2022/10/08/16/63257369-0-image-a-32_1665242989973.jpg", "https://i.dailymail.co.uk/i/furniture/fff/fff-logo-lowercase.png", "https://i.dailymail.co.uk/1s/2018/12/04/22/7013772-6460231-image-a-31_1543961531389.jpg", "https://i.dailymail.co.uk/1s/2018/12/04/22/7011814-6460231-The_Duchess_of_Cambridge_put_on_a_dazzling_display_in_the_Lover_-m-55_1543962093328.jpg", "https://i.dailymail.co.uk/1s/2022/10/08/19/63259233-0-image-a-22_1665255178403.jpg", "https://i.dailymail.co.uk/1s/2022/10/08/14/63254527-0-image-m-112_1665234833053.jpg", "https://i.dailymail.co.uk/1s/2022/10/08/20/63261393-0-image-m-12_1665258132865.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://i.dailymail.co.uk/i/furniture/fff/fff-banner-extrawide.png", "https://i.dailymail.co.uk/fff2/images/2018/12/4/357b8fb6cb9545e7859985bca3bc2693.jpg", "https://i.dailymail.co.uk/1s/2022/10/08/19/63260595-0-image-a-87_1665254253512.jpg", "https://i.dailymail.co.uk/fff2/images/2018/12/4/d679e30e806e0fe14d362a54787c0eef.jpg", "https://i.dailymail.co.uk/1s/2018/12/04/22/7014992-6460231-image-m-73_1543962333673.jpg", "https://i.dailymail.co.uk/1s/2022/10/08/17/63258167-0-image-m-6_1665245101726.jpg", "https://i.dailymail.co.uk/1s/2018/12/04/22/7014938-6460231-image-a-43_1543961832473.jpg", "https://i.dailymail.co.uk/1s/2018/12/04/22/7013780-6460231-image-a-27_1543961518716.jpg", "https://i.dailymail.co.uk/1s/2022/10/08/19/63259963-0-image-a-4_1665252598879.jpg", "https://i.dailymail.co.uk/1s/2018/12/04/22/6992936-6460231-The_Duke_and_Duchess_of_Cambridge_arriving_for_a_Christmas_party-a-78_1543963129904.jpg", "https://i.dailymail.co.uk/1s/2018/12/04/13/6993068-6458715-image-a-33_1543931351895.jpg", "https://i.dailymail.co.uk/1s/2018/12/04/13/6993070-6458715-image-m-32_1543931345803.jpg", "https://i.dailymail.co.uk/fff2/images/2018/12/4/d6f20169fe8beded489fffa3f9736dda.jpg", "https://i.dailymail.co.uk/1s/2018/12/04/22/7011822-6460231-Kate_Middleton_teamed_the_tiara_with_a_pair_of_pearl_drop_earrin-m-68_1543962301416.jpg", "https://i.dailymail.co.uk/1s/2022/10/08/10/63252287-0-image-m-30_1665222868358.jpg", "https://i.dailymail.co.uk/1s/2018/12/04/22/7013774-6460231-image-a-32_1543961533649.jpg", "https://i.dailymail.co.uk/1s/2022/10/08/21/63261339-0-image-a-108_1665259336574.jpg", "https://i.dailymail.co.uk/1s/2018/12/04/20/7009686-6460231-image-a-12_1543955240228.jpg"], "top_img": "https://i.dailymail.co.uk/1s/2018/12/04/21/7012304-0-image-a-40_1543958643051.jpg", "keywords": [], "authors": ["Stephanie Linning", "Stephanie Linning For Mailonline"], "canonical_link": "https://www.dailymail.co.uk/femail/article-6460231/Kate-Middleton-wears-Princess-Dianas-tiara-joins-William-Queens-Diplomatic-Reception.html", "title": "Kate Middleton wears Diana's tiara at Queen's Diplomatic Reception", "meta_data": {"keywords": "dailymail,femail,Kate Middleton,Royals,Prince William,Diana,The Queen", "news_keywords": "dailymail,femail,Kate Middleton,Royals,Prince William,Diana,The Queen", "original-source": "https://www.dailymail.co.uk/femail/article-6460231/Kate-Middleton-wears-Princess-Dianas-tiara-joins-William-Queens-Diplomatic-Reception.html", "description": "The Duchess of Cambridge, 36, joined husband Prince William and hundreds of esteemed guests for the Queen's the Diplomatic Reception at Buckingham Palace on Tuesday evening.", "channel": "Lifestyle,Femail", "doc-class": "Living Document", "verify-v1": "DXwlrsxbqxSv+FTFkWUfgflBvFJfx2YbNf/HmABrVyY=", "msvalidate.01": "12E6B4B813EB44C9BFC8F6A21F1D01F5", "y_key": "1a7e912afbfcab2f", "MSSmartTagsPreventParsing": "true", "twitter": {"account_id": 15438913, "card": "summary_large_image", "title": "Kate's favourite tiara! Duchess dons Diana's glittering headpiece", "description": "The Duchess of Cambridge, 36, joined husband Prince William and hundreds of esteemed guests for the Queen's the Diplomatic Reception at Buckingham Palace on Tuesday evening.", "url": "https://www.dailymail.co.uk/femail/article-6460231/Kate-Middleton-wears-Princess-Dianas-tiara-joins-William-Queens-Diplomatic-Reception.html", "image": "https://i.dailymail.co.uk/1s/2018/12/04/21/7012304-0-image-a-40_1543958643051.jpg", "app": {"id": {"iphone": 384101264, "ipad": 400442503}}}, "articleid": 6460231, "author": "Stephanie Linning", "divclasspage": "articlePage", "robots": "max-image-preview:large", "googlebot": "max-image-preview:large", "mol": {"headline": "Kate's favourite tiara! Duchess dons Diana's glittering headpiece once again as she joins William for the Queen's Diplomatic Reception at Buckingham Palace"}, "article": {"publisher": "https://www.facebook.com/DailyMail", "published_time": "2018-12-04T20:48:03+0000", "modified_time": "2018-12-05T11:25:39+0000", "section": "Femail", "tag": "Kate Middleton wears Princess Dianas tiara joins William Queens Diplomatic Reception", "author": "https://www.facebook.com/DailyMail", "location": "region:GB", "opinion": "false", "content_tier": "free"}, "mobile-web-app-capable": "yes", "fb": {"app_id": 146202712090395, "pages": 164305410295882}, "og": {"site_name": "Mail Online", "title": "Kate's favourite tiara! Duchess dons Diana's glittering headpiece", "type": "article", "description": "The Duchess of Cambridge, 36, joined husband Prince William and hundreds of esteemed guests for the Queen's the Diplomatic Reception at Buckingham Palace on Tuesday evening.", "url": "https://www.dailymail.co.uk/femail/article-6460231/Kate-Middleton-wears-Princess-Dianas-tiara-joins-William-Queens-Diplomatic-Reception.html", "image": {"identifier": "https://i.dailymail.co.uk/1s/2018/12/04/21/7012304-0-image-a-40_1543958643051.jpg", "width": 636, "height": 382}, "video": {"identifier": "https://videos.dailymail.co.uk/video/mol/2018/12/04/5011121052146223567/1024x576_MP4_5011121052146223567.mp4", "type": "video/mp4", "width": 636, "height": 358}}, "al": {"android": {"url": "dailymail-fb://article/6460231/", "package": "com.dailymail.online", "app_name": "Daily Mail Online"}, "ios": {"url": "dailymail-fb://article/6460231/", "app_store_id": 384101264, "app_name": "MailOnline"}}}, "movies": [], "publish_date": 1543956483.0, "source": "https://www.dailymail.co.uk", "summary": ""}