{"url": "https://www.cinemablend.com/television/2455803/americas-got-talents-first-live-show-eliminations-include-a-judges-favorite-and-more", "text": "The stakes are higher than ever in Season 13 of America's Got Talent. The show has finally entered the live quarterfinals, which means that the fates of the competitors are almost entirely out of the judges' hands and at the mercy of viewers who vote. The first live quarterfinals episode saw one couple break out the rattlesnakes and water tank, the Angel City Chorale perform a killer Greatest Showman number, and the Human Fountains getting grosser than ever with a hot dog and condiments, among others.\n\nWell, the live results show has now aired, and we know which five of the previous night's twelve acts were eliminated and which will move on for another shot at the top prize of a million dollars. Here are the acts that got the axe:\n\nMochiHuman FountainsThe PAC Dance TeamLord Nil (and his very trusting fiancée)Flau'jae\n\nAs this was a reality competition show with only five acts to axe and a full hour to fill, America's Got Talent didn't exactly just reveal who was eliminated and who was moving on in the first five minutes. In fact, the show paused the results reveals halfway through the episode to bring back last year's winner. The show did reveal early on three of the five acts that were in danger of elimination: Angel City Chorale, Junior New System with their incredible high heels, and the mind-blowing Mochi came in sixth, seventh, and eighth in the first night of live voting.\n\nTheir ranking put them in the running for the Dunkin' Save. Viewers were given the chance to vote during the results show broadcast for a half hour to try and save two of these three acts. Angel City Chorale was leading almost immediately, and it didn't come as a huge shock that they made it through. After their wonderful rendition of \"Africa\" in their first appearance on America's Got Talent, I've been expecting them to make it to the finals. The race between Junior New System and Mochi was much more neck-and-neck, and it came down to the judges to pick which one to advance... or so it seemed.\n\nThe judges were split between Mochi and Junior New System, with Mel B. and Howie Mandel going for Mochi and Heidi Klum and Simon Cowell going for Junior New System. The winner was determined by the Dunkin' Save voters, and the voters chose Junior New System.\n\nThe elimination of Mochi knocked one of the judges' favorites out of the competition. He blew all of their minds with each of his performances, and Simon Cowell and Heidi Klum were especially effusive in their praise after Mochi's live performance. Their praise wasn't enough to persuade voters, however, and Mochi is out.\n\nHere's the breakdown of all seven acts that will make it at least one more round in the competition:\n\nAngel City ChoraleAmanda MenaJunior New SystemWe ThreeShin LimVicki BarbolakCourtney Hadwin\n\nWe Three was the first group to learn that they were safe, and I'll admit that I wasn't expecting this sibling trio to make it to the next stage after Simon Cowell's comments during the live episode. Vicki Barbolak was the second to get the good news, and her tearful and grateful response had to win over even viewers who haven't considered her a favorite.\n\nThe next live episode of America's Got Talent will air on Tuesday, August 21 at 8 p.m. ET on NBC. Be sure to tune in to see who deserves to stay in the running for the top prize of $1 million and who deserves to be sent home without a dime. The performer who won Heidi Klum's divisive golden buzzer will be in the house, as will the creepy Sacred Riana. For some alternate viewing options, check out our fall TV premiere schedule.", "images": ["https://www.cinemablend.com/media/img/missing-image.svg", "https://cdn.mos.cms.futurecdn.net/dZhnRMe4nXNxZyAKtPf6HX-1200-80.jpg", "https://cdn.mos.cms.futurecdn.net/dZhnRMe4nXNxZyAKtPf6HX-320-80.jpg"], "top_img": "https://cdn.mos.cms.futurecdn.net/dZhnRMe4nXNxZyAKtPf6HX-1200-80.jpg", "keywords": [], "authors": ["Laura Hurley", "Senior Content Producer", "Window.Slicecomponents", "Window.Reliabledomcontentloaded.Then", "Var Componentcontainer", "Document.Queryselector", "Slice-Container-Authorbio", "If Componentcontainer", "Var Data", "Layout"], "canonical_link": "https://www.cinemablend.com/television/2455803/americas-got-talents-first-live-show-eliminations-include-a-judges-favorite-and-more", "title": "America's Got Talent's First Live Show Eliminations Include A Judges' Favorite And More", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "pub_date": "2018-08-16T01:01:24+00:00", "description": "The first America's Got Talent live elimination show in Season 13 kicked some surprising acts out of the running for the top prize.", "robots": "max-image-preview:large,noindex", "msapplication-TileColor": "#000000", "msapplication-TileImage": "https://cdn.mos.cms.futurecdn.net/flexiimages/tbhqzd9bso1619422461.png", "og": {"site_name": "CINEMABLEND", "image": {"identifier": "https://cdn.mos.cms.futurecdn.net/dZhnRMe4nXNxZyAKtPf6HX-1200-80.jpg", "width": 1200}, "type": "article", "title": "America's Got Talent's First Live Show Eliminations Include A Judges' Favorite And More", "url": "https://www.cinemablend.com/television/2455803/americas-got-talents-first-live-show-eliminations-include-a-judges-favorite-and-more"}, "article": {"publisher": "https://www.facebook.com/cinemablendnews/", "published_time": "2018-08-16T01:01:24Z", "modified_time": "2018-08-16T01:01:24Z"}, "parsely-type": "post", "parsely-post-id": "xx1cLCwG2mnp7TsHFSSgFm", "parsely-pub-date": "2018-08-16T01:01:24Z", "parsely-title": "America's Got Talent's First Live Show Eliminations Include A Judges' Favorite And More", "parsely-link": "https://www.cinemablend.com/television/2455803/americas-got-talents-first-live-show-eliminations-include-a-judges-favorite-and-more", "parsely-image-url": "https://cdn.mos.cms.futurecdn.net/dZhnRMe4nXNxZyAKtPf6HX.jpg", "parsely-section": "Television", "parsely-tags": "Category: Television,Category: News,nbc,america's got talent,exclude-from-homepage,van-exclude-latest,no-index,serversidehawk", "parsely-author": "Laura Hurley", "twitter": {"card": "summary_large_image", "site": "@cinemablend", "title": "America's Got Talent's First Live Show Eliminations Include A Judges' Favorite And More", "creator": "@cinemablend", "image": "https://cdn.mos.cms.futurecdn.net/dZhnRMe4nXNxZyAKtPf6HX-1200-80.jpg", "account_id": 9696142}, "google-site-verification": "Oo3uNFWgI6psN58Pjx7Zjo3yYih1rOwQViWbItBCpyo", "taboola": {"url": "https://www.cinemablend.com/television/2455803/americas-got-talents-first-live-show-eliminations-include-a-judges-favorite-and-more"}, "botify-site-verification": "2pzcQZFibLjk9GJgSZgweA8MU9al6utA", "msvalidate.01": "CC462E6DF91492086145CA5EBDCB615E"}, "movies": [], "publish_date": 1534381284.0, "source": "https://www.cinemablend.com", "summary": ""}