{"url": "https://www.nbcnews.com/business/consumer/gwyneth-paltrow-s-goop-accused-making-deceptive-health-claims-n796551", "text": "The watchdog group Truth in Advertising wants Goop, the lifestyle website started by actress Gwyneth Paltrow, to stop making what it calls “unsubstantiated” and “deceptive” advertising claims for some of the health and wellness products it sells. And it filed a formal complaint last week asking authorities in California to force the company to do that.\n\nTINA said it investigated more than 50 products sold on the site in which “the company claims, either expressly or implicitly, that its products – or third-party products that it promotes – can treat, cure, prevent, alleviate the symptoms of, or reduce the risk of developing a number of ailments, ranging from depression, anxiety and insomnia, to infertility, uterine prolapse and arthritis, just to name a few.”\n\nBonnie Patten, TINA’s executive director, told NBC News she was “surprised at the level of deception” they found.\n\n“Our concern is that Goop is using disease treatment claims to market products that it has no reliable scientific evidence to prove they can do the things they are saying, as is required by law,” Patten said. “They're making claims that crystals can treat infertility or soap can treat acne, eczema and psoriasis. They have perfumes that they claim have ingredients that heal diseased lungs and improve memory. You name it, they've got something for you.”\n\nTINA contacted Goop about its concerns on August 11 and asked it to remove the offending advertising claims within a week. After 10 days, only a few changes had been made, Patten said, so last week Patten decided it “was in the best interests of consumers” to file a complaint with the California Food and Drug and Medical Device Task Force.\n\n\"They're making claims about products for which there is absolutely no science to support those claims.”\n\nThere’s no shortage of sites making questionable or bogus health claims. So why did TINA decide to investigate Goop?\n\n“It's a very high-profile site, and a lot of women have turned to its empowerment message and purchased its products,” Patten told NBC News.\n\nGoop responded to TINA’s accusations with this statement:\n\n“Goop is dedicated to introducing unique products and offerings and encouraging constructive conversation surrounding new ideas. We are receptive to feedback and consistently seek to improve the quality of the products and information referenced on our site. We responded promptly and in good faith to the initial outreach from representatives of TINA and hoped to engage with them to address their concerns. Unfortunately, they provided limited information and made threats under arbitrary deadlines which were not reasonable under the circumstances. Nevertheless, while we believe that TINA’s description of our interactions is misleading and their claims unsubstantiated and unfounded, we will continue to evaluate our products and our content and make those improvements that we believe are reasonable and necessary in the interests of our community of users.”\n\nA Second Opinion\n\nThe Goop website tells visitors: “We test the waters so that you don’t have to. We will never recommend something that we don’t love, and think worthy of your wallets and your time.”\n\nBut Dr. John Swartzberg, head of the editorial board at the UC Berkeley Wellness Letter, believes people who buy some of the wellness products sold on Goop are “wasting their money” and possibly risking their health.\n\nNBC News asked Swartzberg to look at the products flagged by TINA. He called the site “irresponsible” and said he was “astounded” by the various health claims made – some of which he believed were possibly or probably illegal.\n\n“People are really being deceived by what they're advertising on Goop. They're making claims about products for which there is absolutely no science to support those claims,” Swartzberg said. “At best, people who buy these products will spend an awful lot of money for something that's not going to be any help at all. At worst, they're going to put things in their bodies that potentially could be harmful.”\n\nNot the First Time\n\nGoop recently agreed to voluntarily, but permanently discontinue advertising claims made for “Moon Juice,” “Brain Dust,” and “Sex Dust” supplements after a complaint was filed with the National Advertising Division of the Council of Better Business Bureaus.\n\nNAD noted that Moon Juice was featured as a recipe ingredient in the GP Morning Smoothie. “Gwyneth drinks one of these every morning, whether or not she’s detoxing,” the site said. “Choose your Moon Juice moon dust depending on what the day ahead holds… brain dust before a long day at the office, sex dust before a date, etc.”\n\nIn its news release NAD noted that “an advertiser has an obligation to insure that the claims it makes for the product are truthful, accurate, and not misleading” — something that apparently did not happen in this case.\n\nEarlier this year, critics blasted Goop for selling the jade egg, a stone shaped like an egg that’s meant to be inserted in the vagina. The jade egg ($66) is supposed to result in better sex and better health.\n\nIn an article warning women not to do this, the Huffington Post quoted Dr. Maria Isabel Rodriguez, an assistant professor of obstetrics and gynecology at Oregon Health & Science University.\n\n\"I cannot think of a single reason why inserting a large, heavy stone object into the vagina would improve one’s sex life,” she told the Huffington Post. “The vagina and the rest of our reproductive organs are actually quite smart at regulating themselves and need no interference from douches, jade eggs, or Gwyneth Paltrow.”\n\nDr. Rodriguez warned that using the egg could cause vaginal infection and trauma.\n\nEarlier this year, Goop got called out for the claims made for Body Vibes, wearable stickers ($64 for a 2-pack) that are supposed to “promote healing” and create “a calming effect” by rebalancing the energy frequency in our bodies.\n\nGoop said the stickers were made with “the same conductive carbon material NASA uses to line space suits so they can monitor an astronaut’s vitals during wear.” But that wasn’t true.\n\nGizmodo ran a story in late June that said NASA spacesuits “do not have any conductive carbon material lining.” Mark Shelhamer, former chief scientist at NASA’s human research division, called the marketing claim “a load of BS” and told Gizmodo the whole premise was “like snake oil.”\n\nA few days after that story was published, Goop removed the spacesuit claim, but it still sells the stickers and still touts their energy-balancing properties.\n\nHerb Weisbaum is The ConsumerMan. Follow him on Facebook and Twitter or visit The ConsumerMan website.", "images": ["https://media3.s-nbcnews.com/j/MSNBC/Components/Video/201708/tdy_joe_goop_170824.focal-760x428.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2016_02/1375371/160113-gwyneth-paltrow-yh-0745p.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-760w,f_auto,q_auto:best/newscms/2016_02/1375371/160113-gwyneth-paltrow-yh-0745p.jpg"], "top_img": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2016_02/1375371/160113-gwyneth-paltrow-yh-0745p.jpg", "keywords": [], "authors": ["Herb Weisbaum", "Herb Weisbaum Is A Contributor To Nbc News", "Writes About Consumer-Related Issues. He Can Be Found On"], "canonical_link": "https://www.nbcnews.com/business/consumer/gwyneth-paltrow-s-goop-accused-making-deceptive-health-claims-n796551", "title": "Gwyneth Paltrow's Goop Accused of 'Deceptive' Health Claims", "meta_data": {"msapplication-config": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/nbcnews/all-other-sizes-PNG.ico/browserconfig.xml", "robots": "max-image-preview:large", "fb": {"app_id": 10150138890205613, "pages": 1508175089456029}, "og": {"site_name": "NBC News", "locale": "en_US", "url": "https://www.nbcnews.com/business/consumer/gwyneth-paltrow-s-goop-accused-making-deceptive-health-claims-n796551", "title": "Gwyneth Paltrow's Goop under fire for alleged deceptive claims", "description": "Paltrow's lifestyle website allegedly markets products that claim to treat infertility or heal diseased lungs and improve memory.", "image": {"identifier": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2016_02/1375371/160113-gwyneth-paltrow-yh-0745p.jpg", "secure_url": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2016_02/1375371/160113-gwyneth-paltrow-yh-0745p.jpg", "type": "image/jpeg", "width": 1200, "height": 630}, "type": "article"}, "twitter": {"site": "@NBCNews", "creator": "NBCNews", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1024-512,f_auto,q_auto:best/newscms/2016_02/1375371/160113-gwyneth-paltrow-yh-0745p.jpg", "title": "Gwyneth Paltrow's Goop under fire for alleged deceptive claims", "description": "Paltrow's lifestyle website allegedly markets products that claim to treat infertility or heal diseased lungs and improve memory.", "card": "summary_large_image"}, "viewport": "width=device-width, initial-scale=1, user-scalable=yes", "description": "Paltrow's lifestyle website allegedly markets products that claim to treat infertility or heal diseased lungs and improve memory.", "branch": {"deeplink": {"title": "Gwyneth Paltrow's Goop under fire for alleged deceptive claims", "description": "Paltrow's lifestyle website allegedly markets products that claim to treat infertility or heal diseased lungs and improve memory.", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2016_02/1375371/160113-gwyneth-paltrow-yh-0745p.jpg", "type": "article", "unibrow": "Consumer", "authorName1": "Herb Weisbaum"}}, "article": {"opinion": "false", "content_tier": "free", "published": "Mon Aug 28 2017 13:47:00 GMT+0000 (UTC)", "modified": "Tue Aug 29 2017 21:12:10 GMT+0000 (UTC)"}, "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_social_share_1024x768_scale,f_auto,q_auto:best/newscms/2016_02/1375371/160113-gwyneth-paltrow-yh-0745p.jpg", "next-head-count": 100}, "movies": [], "publish_date": 1503928020.0, "source": "https://www.nbcnews.com", "summary": ""}