{"url": "https://www.nbcnews.com/news/us-news/carrie-fisher-once-sent-cow-s-tongue-producer-who-allegedly-n811521", "text": "As the scandal involving Harvey Weinstein continues to rock Hollywood, a screenwriter said she finally feels able to share her own story of survival — and the bold way actress Carrie Fisher came to her defense after she was allegedly sexually assaulted by a producer.\n\nScreenwriter Heather Robinson said she and Fisher became friends after they met online in an AOL chat room where they would talk about the industry and workshop her screenplays. It was in that chat room that Robinson said she revealed an encounter she had with an award-winning producer, whom she declined to name.\n\nRobinson said she never expected the actress' response would come in the form of an animal part.\n\nIn an interview with Arizona radio program \"The Morning Mix\" that has gone viral, Robinson recalled a night in 2000 during which a producer allegedly sexually assaulted her after inviting her to dinner to discuss an upcoming project.\n\n\"When it happened, it happened so quickly that I felt ashamed of myself,\" Robinson said in the radio interview. She described how the producer picked her up in his car and, within minutes, pulled to the side of the road.\n\n\"He reaches over and grabs the handle of the chair of the passenger seat and pulls me backwards,\" she said. \"All of a sudden he's on top of me and he has his right hand that was busy, and his left hand was on my chest, by my neck, holding me down.\"\n\nRobinson said she fought back, managed to escape the car, and ran. When she got home, she told her mom about the incident and debated whether or not she needed to go to the police. Ultimately, fearing for her safety, Robinson decided to remain silent.\n\nRelated: Will Flood of Weinstein Accusers Bring Sweeping Change to Hollywood?\n\nLater that night, she said she saw that Fisher was online and told the \"Star Wars\" heroine what had happened in a series of messages.\n\n\"She stayed quiet and listened to me and then she said, 'I promise you he will never touch you again,'\" Robinson told NBC News in an email. \"She was exactly what I needed. Someone to just hold space for me — allowing me to be scared, hurt, confused, angry.\"\n\nWeeks later, Robinson said Fisher messaged her online and told her that she'd hand-delivered the producer a gift: a cow tongue wrapped in a blue Tiffany's box and topped with a bow.\n\n\"It was a cow's tongue from Jerry's Deli in Westwood with a note that said ‘If you ever touch my darling Heather or any other woman again, the next delivery will be something of yours in a much smaller box,'” Robinson said, adding that the \"gift\" made her laugh after the traumatizing incident.\n\nPhotos: Carrie Fisher: Actress, Author and ‘Princess’\n\n\"She had an amazing heart,\" Robinson said in an email. \"If you were one of the lucky people that she loved, she loved you with everything she had. In her world, it was okay to feel vulnerable because she made you feel safe in doing so. That alone is a huge gift.\"\n\nRobinson said she has never seen or heard from the producer again and that it took her years to realize that the assault was not her fault. But the Weinstein scandal has brought the conversation around sexual assault and harassment in Hollywood back into the spotlight, and Robinson said she's happy to see women garnering support.\n\nRelated: Carrie Fisher Mourned by Fellow Stars: ‘Our Princess Has Passed Away’\n\nRobinson said that, in part because of social media, she thinks women throughout the industry are feeling the same sense of safety and acceptance that Carrie gave her.\n\n\"It allows us the power to speak out and share our stories and to connect with other people who many not be at the point where I am,\" she said. \"It's truly an individual journey and some may never shed light on what happened to them, and that is okay. As long as they see that they are not alone.\"", "images": ["https://media-cldnry.s-nbcnews.com/image/upload/t_focal-760x428,f_auto,q_auto:best/MSNBC/Components/Video/201710/tdy_ruhle_171015_1.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-760w,f_auto,q_auto:best/newscms/2016_52/1846586/ss-161227-carrie-fisher-09.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2016_52/1846586/ss-161227-carrie-fisher-09.jpg"], "top_img": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2016_52/1846586/ss-161227-carrie-fisher-09.jpg", "keywords": [], "authors": ["Chelsea Bailey"], "canonical_link": "https://www.nbcnews.com/news/us-news/carrie-fisher-once-sent-cow-s-tongue-producer-who-allegedly-n811521", "title": "Carrie Fisher Once Sent a Cow's Tongue to a Producer Who Allegedly Assaulted Her Friend", "meta_data": {"msapplication-config": "https://nodeassets.nbcnews.com/cdnassets/projects/ramen/favicon/nbcnews/all-other-sizes-PNG.ico/browserconfig.xml", "robots": "max-image-preview:large", "fb": {"app_id": 10150138890205613, "pages": 1508175089456029}, "og": {"site_name": "NBC News", "locale": "en_US", "url": "https://www.nbcnews.com/news/us-news/carrie-fisher-once-sent-cow-s-tongue-producer-who-allegedly-n811521", "title": "How Carrie Fisher got revenge on producer for alleged sexual assault", "description": "Screenwriter Heather Robinson said she told Fisher about a producer who allegedly sexually assaulted her. Fisher then sent him a cow's tongue in response.", "image": {"identifier": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2016_52/1846586/ss-161227-carrie-fisher-09.jpg", "secure_url": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2016_52/1846586/ss-161227-carrie-fisher-09.jpg", "type": "image/jpeg", "width": 1200, "height": 630}, "type": "article"}, "twitter": {"site": "@NBCNews", "creator": "NBCNews", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1024-512,f_auto,q_auto:best/newscms/2016_52/1846586/ss-161227-carrie-fisher-09.jpg", "title": "How Carrie Fisher got revenge on producer for alleged sexual assault", "description": "Screenwriter Heather Robinson said she told Fisher about a producer who allegedly sexually assaulted her. Fisher then sent him a cow's tongue in response.", "card": "summary_large_image"}, "viewport": "width=device-width, initial-scale=1, user-scalable=yes", "description": "Screenwriter Heather Robinson said she told Fisher about a producer who allegedly sexually assaulted her. Fisher then sent him a cow's tongue in response.", "branch": {"deeplink": {"title": "How Carrie Fisher got revenge on producer for alleged sexual assault", "description": "Screenwriter Heather Robinson said she told Fisher about a producer who allegedly sexually assaulted her. Fisher then sent him a cow's tongue in response.", "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2016_52/1846586/ss-161227-carrie-fisher-09.jpg", "type": "article", "unibrow": "U.S. news", "authorName1": "Chelsea Bailey"}}, "article": {"opinion": "false", "content_tier": "free", "published": "Tue Oct 17 2017 20:13:00 GMT+0000 (UTC)", "modified": "Tue Oct 17 2017 21:50:38 GMT+0000 (UTC)"}, "thumbnail": "https://media-cldnry.s-nbcnews.com/image/upload/t_social_share_1024x768_scale,f_auto,q_auto:best/newscms/2016_52/1846586/ss-161227-carrie-fisher-09.jpg", "next-head-count": 100}, "movies": [], "publish_date": 1508271180.0, "source": "https://www.nbcnews.com", "summary": ""}