{"url": "https://www.independent.co.uk/news/world/americas/stormy-daniels-divorce-glendon-crain-brendon-miller-husband-porn-restraining-order-a8461651.html", "text": "Sign up to our Evening Headlines email for your daily guide to the latest news Sign up to our free US Evening Headlines email Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent. Read our privacy notice Thanks for signing up to the\n\nEvening Headlines email {{ #verifyErrors }}{{ message }}{{ /verifyErrors }}{{ ^verifyErrors }}Something went wrong. Please try again later{{ /verifyErrors }}\n\nStormy Daniels’ husband Glendon Crain has filed for divorce in Texas after claiming infidelity.\n\nThe adult film star came to be known in the mainstream after alleging an affair with Donald Trump and being paid for her silence by his personal attorney Michael Cohen just before the 2016 US election. Mr Trump has denied the affair took place.\n\nMr Crain, who is also an adult film star and performs under the name Brendan Miller, has filed for sole custody of their seven-year-old daughter and was granted a temporary restraining order against Ms Daniels which restricts unsupervised access to their daughter.\n\nRecommended Charges against Stormy Daniels in strip club arrest dismissed\n\nThe couple married in November 2015 and had been living near Dallas, Texas, until the middle of July 2018.\n\nMr Crain’s divorce petition stated the marriage “has become insupportable because of discord or conflict of personalities” and made claims that Ms Daniels was putting his daughter “in imminent threat of serious and immediate physical or emotional harm” by attempting to bring her along on Ms Daniels’ nationwide tour of strip club performances.\n\nMr Crain has asked for child support from Ms Daniels and sharing their property assets.\n\n✕ Stormy Daniels lawyer Michael Avenatti says there are more Trump tapes\n\nMichael Avenatti, Ms Daniels’ lawyer in her case against Mr Trump and Mr Cohen, announced the divorce on Twitter and said the terms of the divorce are “vehemently disputed” by his client and that her daughter remains her first priority.\n\nMs Daniels, whose real name is Stephanie Clifford, tweeted: “I want truth. And it will come out. I’m not afraid”.\n\nWorld news in pictures Show all 50 1 /50 World news in pictures World news in pictures 30 September 2020 Pope Francis prays with priests at the end of a limited public audience at the San Damaso courtyard in The Vatican AFP via Getty World news in pictures 29 September 2020 A girl's silhouette is seen from behind a fabric in a tent along a beach by Beit Lahia in the northern Gaza Strip AFP via Getty World news in pictures 28 September 2020 A Chinese woman takes a photo of herself in front of a flower display dedicated to frontline health care workers during the COVID-19 pandemic in Beijing, China. China will celebrate national day marking the founding of the People's Republic of China on October 1st Getty World news in pictures 27 September 2020 The Glass Mountain Inn burns as the Glass Fire moves through the area in St. Helena, California. The fast moving Glass fire has burned over 1,000 acres and has destroyed homes Getty World news in pictures 26 September 2020 A villager along with a child offers prayers next to a carcass of a wild elephant that officials say was electrocuted in Rani Reserve Forest on the outskirts of Guwahati, India AFP via Getty World news in pictures 25 September 2020 The casket of late Supreme Court Justice Ruth Bader Ginsburg is seen in Statuary Hall in the US Capitol to lie in state in Washington, DC AFP via Getty World news in pictures 24 September 2020 An anti-government protester holds up an image of a pro-democracy commemorative plaque at a rally outside Thailand's parliament in Bangkok, as activists gathered to demand a new constitution AFP via Getty World news in pictures 23 September 2020 A whale stranded on a beach in Macquarie Harbour on the rugged west coast of Tasmania, as hundreds of pilot whales have died in a mass stranding in southern Australia despite efforts to save them, with rescuers racing to free a few dozen survivors The Mercury/AFP via Getty World news in pictures 22 September 2020 State civil employee candidates wearing face masks and shields take a test in Surabaya AFP via Getty World news in pictures 21 September 2020 A man sweeps at the Taj Mahal monument on the day of its reopening after being closed for more than six months due to the coronavirus pandemic AP World news in pictures 20 September 2020 A deer looks for food in a burnt area, caused by the Bobcat fire, in Pearblossom, California EPA World news in pictures 19 September 2020 Anti-government protesters hold their mobile phones aloft as they take part in a pro-democracy rally in Bangkok. Tens of thousands of pro-democracy protesters massed close to Thailand's royal palace, in a huge rally calling for PM Prayut Chan-O-Cha to step down and demanding reforms to the monarchy AFP via Getty World news in pictures 18 September 2020 Supporters of Iraqi Shi'ite cleric Moqtada al-Sadr maintain social distancing as they attend Friday prayers after the coronavirus disease restrictions were eased, in Kufa mosque, near Najaf, Iraq Reuters World news in pictures 17 September 2020 A protester climbs on The Triumph of the Republic at 'the Place de la Nation' as thousands of protesters take part in a demonstration during a national day strike called by labor unions asking for better salary and against jobs cut in Paris, France EPA World news in pictures 16 September 2020 A fire raging near the Lazzaretto of Ancona in Italy. The huge blaze broke out overnight at the port of Ancona. Firefighters have brought the fire under control but they expected to keep working through the day EPA World news in pictures 15 September 2020 Russian opposition leader Alexei Navalny posing for a selfie with his family at Berlin's Charite hospital. In an Instagram post he said he could now breathe independently following his suspected poisoning last month Alexei Navalny/Instagram/AFP World news in pictures 14 September 2020 Japan's Prime Minister Shinzo Abe, Chief Cabinet Secretary Yoshihide Suga, former Defense Minister Shigeru Ishiba and former Foreign Minister Fumio Kishida celebrate after Suga was elected as new head of the ruling party at the Liberal Democratic Party's leadership election in Tokyo Reuters World news in pictures 13 September 2020 A man stands behind a burning barricade during the fifth straight day of protests against police brutality in Bogota AFP via Getty World news in pictures 12 September 2020 Police officers block and detain protesters during an opposition rally to protest the official presidential election results in Minsk, Belarus. Daily protests calling for the authoritarian president's resignation are now in their second month AP World news in pictures 11 September 2020 Members of 'Omnium Cultural' celebrate the 20th 'Festa per la llibertat' ('Fiesta for the freedom') to mark the Day of Catalonia in Barcelona. Omnion Cultural fights for the independence of Catalonia EPA World news in pictures 10 September 2020 The Moria refugee camp, two days after Greece's biggest migrant camp, was destroyed by fire. Thousands of asylum seekers on the island of Lesbos are now homeless AFP via Getty World news in pictures 9 September 2020 Pope Francis takes off his face mask as he arrives by car to hold a limited public audience at the San Damaso courtyard in The Vatican AFP via Getty World news in pictures 8 September 2020 A home is engulfed in flames during the \"Creek Fire\" in the Tollhouse area of California AFP via Getty World news in pictures 7 September 2020 A couple take photos along a sea wall of the waves brought by Typhoon Haishen in the eastern port city of Sokcho AFP via Getty World news in pictures 6 September 2020 Novak Djokovic and a tournament official tends to a linesperson who was struck with a ball by Djokovic during his match against Pablo Carreno Busta at the US Open USA Today Sports/Reuters World news in pictures 5 September 2020 Protesters confront police at the Shrine of Remembrance in Melbourne, Australia, during an anti-lockdown rally AFP via Getty World news in pictures 4 September 2020 A woman looks on from a rooftop as rescue workers dig through the rubble of a damaged building in Beirut. A search began for possible survivors after a scanner detected a pulse one month after the mega-blast at the adjacent port AFP via Getty World news in pictures 3 September 2020 A full moon next to the Virgen del Panecillo statue in Quito, Ecuador EPA World news in pictures 2 September 2020 A Palestinian woman reacts as Israeli forces demolish her animal shed near Hebron in the Israeli-occupied West Bank Reuters World news in pictures 1 September 2020 Students protest against presidential elections results in Minsk TUT.BY/AFP via Getty World news in pictures 31 August 2020 The pack rides during the 3rd stage of the Tour de France between Nice and Sisteron AFP via Getty World news in pictures 30 August 2020 Law enforcement officers block a street during a rally of opposition supporters protesting against presidential election results in Minsk, Belarus Reuters World news in pictures 29 August 2020 A woman holding a placard reading \"Stop Censorship - Yes to the Freedom of Expression\" shouts in a megaphone during a protest against the mandatory wearing of face masks in Paris. Masks, which were already compulsory on public transport, in enclosed public spaces, and outdoors in Paris in certain high-congestion areas around tourist sites, were made mandatory outdoors citywide on August 28 to fight the rising coronavirus infections AFP via Getty World news in pictures 28 August 2020 Japanese Prime Minister Shinzo Abe bows to the national flag at the start of a press conference at the prime minister official residence in Tokyo. Abe announced he will resign over health problems, in a bombshell development that kicks off a leadership contest in the world's third-largest economy AFP via Getty World news in pictures 27 August 2020 Residents take cover behind a tree trunk from rubber bullets fired by South African Police Service (SAPS) in Eldorado Park, near Johannesburg, during a protest by community members after a 16-year old boy was reported dead AFP via Getty World news in pictures 26 August 2020 People scatter rose petals on a statue of Mother Teresa marking her 110th birth anniversary in Ahmedabad AFP via Getty World news in pictures 25 August 2020 An aerial view shows beach-goers standing on salt formations in the Dead Sea near Ein Bokeq, Israel Reuters World news in pictures 24 August 2020 Health workers use a fingertip pulse oximeter and check the body temperature of a fisherwoman inside the Dharavi slum during a door-to-door Covid-19 coronavirus screening in Mumbai AFP via Getty World news in pictures 23 August 2020 People carry an idol of the Hindu god Ganesh, the deity of prosperity, to immerse it off the coast of the Arabian sea during the Ganesh Chaturthi festival in Mumbai, India Reuters World news in pictures 22 August 2020 Firefighters watch as flames from the LNU Lightning Complex fires approach a home in Napa County, California AP World news in pictures 21 August 2020 Members of the Israeli security forces arrest a Palestinian demonstrator during a rally to protest against Israel's plan to annex parts of the occupied West Bank AFP via Getty World news in pictures 20 August 2020 A man pushes his bicycle through a deserted road after prohibitory orders were imposed by district officials for a week to contain the spread of the Covid-19 in Kathmandu AFP via Getty World news in pictures 19 August 2020 A car burns while parked at a residence in Vacaville, California. Dozens of fires are burning out of control throughout Northern California as fire resources are spread thin AFP via Getty World news in pictures 18 August 2020 Students use their mobile phones as flashlights at an anti-government rally at Mahidol University in Nakhon Pathom. Thailand has seen near-daily protests in recent weeks by students demanding the resignation of Prime Minister Prayut Chan-O-Cha AFP via Getty World news in pictures 17 August 2020 Members of the Kayapo tribe block the BR163 highway during a protest outside Novo Progresso in Para state, Brazil. Indigenous protesters blocked a major transamazonian highway to protest against the lack of governmental support during the COVID-19 novel coronavirus pandemic and illegal deforestation in and around their territories AFP via Getty World news in pictures 16 August 2020 Lightning forks over the San Francisco-Oakland Bay Bridge as a storm passes over Oakland AP World news in pictures 15 August 2020 Belarus opposition supporters gather near the Pushkinskaya metro station where Alexander Taraikovsky, a 34-year-old protester died on August 10, during their protest rally in central Minsk AFP via Getty World news in pictures 14 August 2020 AlphaTauri's driver Daniil Kvyat takes part in the second practice session at the Circuit de Catalunya in Montmelo near Barcelona ahead of the Spanish F1 Grand Prix AFP via Getty World news in pictures 13 August 2020 Soldiers of the Brazilian Armed Forces during a disinfection of the Christ The Redeemer statue at the Corcovado mountain prior to the opening of the touristic attraction in Rio AFP via Getty World news in pictures 12 August 2020 Young elephant bulls tussle playfully on World Elephant Day at the Amboseli National Park in Kenya AFP via Getty\n\nShe is currently suing Mr Cohen in California district court for alleged defamation. The suit claimed Mr Cohen worked with Mr Trump to prevent her from making the story of the alleged affair public during the 2016 US election. It also accused Mr Cohen of continuing to try to silence her.\n\nMr Cohen, according to his own claims, paid Ms Daniels $130,000 (£91,000) leading up to the 2016 election. He was quick to deny any connection to Mr Trump's campaign team, saying that he used his own money to pay her. The payment was reportedly part of a nondisclosure agreement regarding the affair, which allegedly occurred a decade ago. Mr Avenatti argued that the document is not valid because Mr Trump never signed it.\n\nMs Daniels' lawsuit alleged however, that Mr Cohen created a company “with Mr Trump’s knowledge” to hide the source of the payout money. She also said in the complaint that Mr Cohen implied she was lying about the nature of her relationship with Mr Trump.\n\nThe president has confirmed Mr Cohen was reimbursed for the payment.", "images": ["https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/07/24/14/stormy-daniels.jpg?quality=75&width=982&height=726&auto=webp", "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/07/24/14/stormy-daniels.jpg?quality=75&width=1200&auto=webp"], "top_img": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/07/24/14/stormy-daniels.jpg?quality=75&width=1200&auto=webp", "keywords": [], "authors": ["Mythili Sampathkumar", "New York"], "canonical_link": "https://www.independent.co.uk/news/world/americas/stormy-daniels-divorce-glendon-crain-brendon-miller-husband-porn-restraining-order-a8461651.html", "title": "Stormy Daniels’ husband Glendon Crain files for divorce and restraining order", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, user-scalable=no, minimum-scale=1.0, maximum-scale=1.0", "description": "Ms Daniels has alleged she had an affair with Donald Trump and has a lawsuit against his attorney Michael Cohen", "theme-color": "#EC1A2E", "amp-google-client-id-api": "googleanalytics", "robots": "max-image-preview:large", "fb": {"app_id": 235586169789578, "pages": "https://www.facebook.com/TheIndependentOnline"}, "category": "Americas", "sitename": "The Independent", "page path": "/news/world/americas", "page type": "Article", "adPageType": "Article Page", "og": {"locale": "en_GB", "updated_time": "2018-07-24T13:56:44.000Z", "site_name": "The Independent", "title": "Stormy Daniels’ husband files for divorce and restraining order", "url": "https://www.independent.co.uk/news/world/americas/stormy-daniels-divorce-glendon-crain-brendon-miller-husband-porn-restraining-order-a8461651.html", "type": "article", "description": "Ms Daniels has alleged she had an affair with Donald Trump and has a lawsuit against his attorney Michael Cohen", "image": {"identifier": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/07/24/14/stormy-daniels.jpg?quality=75&width=1200&auto=webp", "secure_url": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/07/24/14/stormy-daniels.jpg?quality=75&width=1200&auto=webp"}}, "article": {"published_time": "2018-07-24T13:56:44.000Z", "modified_time": "2018-07-24T13:56:44.000Z", "section": "News", "subsection": "World", "author_name": "Mythili Sampathkumar", "content_type": "story", "word_count": 651, "image_count": 1, "embed_count": 3, "video_count": 1, "internal_link_count": 6, "external_link_count": 0}, "date": "2018-07-24T13:56:44.000Z", "google-signin-client_id": "329250492844-uqochn2f1j5ljkshuap5gc7qphf1refj.apps.googleusercontent.com", "twitter": {"title": "Stormy Daniels’ husband files for divorce and restraining order", "site": "@Independent", "card": "summary_large_image", "description": "Ms Daniels has alleged she had an affair with Donald Trump and has a lawsuit against his attorney Michael Cohen", "image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/07/24/14/stormy-daniels.jpg?quality=75&width=1200&auto=webp"}, "keywords": "Stormy Daniels,Donald Trump,Michael Avenatti,Michael Cohen,Internal"}, "movies": [], "publish_date": 1532440604.0, "source": "https://www.independent.co.uk", "summary": ""}