{"url": "https://www.hollywoodreporter.com/news/tom-hanks-shares-thoughts-harvey-weinstein-allegations-1048171", "text": "Tom Hanks never worked with Harvey Weinstein, but the beloved veteran actor spoke to The New York Times about the disgraced mogul and what the recently uncovered allegations of harassment and assault reveal about Hollywood.\n\nDespite never working with Weinstein, Hanks said of the claims against the Miramax co-founder, including three women telling The New Yorker that Weinstein raped them: “Aah, it all just sort of fits, doesn’t it?”\n\nWhen asked why Hollywood “sheltered” Weinstein despite rumors of his inappropriate behavior, Hanks rejected the excuse, which Weinstein himself made, that his behavior could be considered old-fashioned.\n\n“Well, that’s a really good question and isn’t it part and parcel to all of society somehow, that people in power get away with this?” Hanks asked. Further adding, “Look, I don’t want to rag on Harvey but so obviously something went down there. You can’t buy, ‘Oh, well, I grew up in the ’60s and ’70s and so therefore …’ I did, too.”\n\nHanks emphasized that power in Hollywood can be rather manipulative.\n\n“I think it’s like, well, what do you want from this position of power? I know all kinds of people that just love hitting on, or making the lives of underlings some degree of miserable, because they can,” the actor said.\n\n“They think their achievements entitle them,” Hanks said, proceeding to reference a quote about power. “Somebody great said this, either Winston Churchill, Immanuel Kant or Oprah: ‘When you become rich and powerful, you become more of what you already are,'” Hanks said.\n\nHanks agrees with the quote, saying he supports the negative backlash against the movie mogul.\n\n“I would say, there’s an example of how that’s true. Just because you’re rich and famous and powerful doesn’t mean you aren’t in some ways a big fat ass. Excuse me, take away ‘fat,'” Hanks said. “But I’m not, you know, I’m not the first person to say Harvey’s a bit of an ass. Poor Harvey — I’m not going to say poor Harvey, Jesus. Isn’t it kind of amazing that it took this long? I’m reading it and I’m thinking ‘You can’t do that to Ashley Judd! Hey, I like her. Don’t do that. That ain’t fair. Not her, come on. Come on!”\n\nHanks also commented on the sexism that continues to exist within Hollywood, referring to the show Mad Men, to which he says “had absolutely no nostalgia or affection for its period.”\n\nThe actor explained, “Those people were screwed up and cruel and mean. And, ‘Hey, wait, that’s going on today? Shouldn’t we be on this?’ Is it surprising? No. Is it tragic? Yes. And can you believe it’s happening? I can’t quite believe that.”\n\nHanks isn’t the only Hollywood star to comment on the recent Weinstein allegations. The actor joins Meryl Streep, George Clooney, Patricia Arquette, Leonardo DiCaprio, Julianne Moore, Mark Ruffalo, Jennifer Lawrence and others.\n\nThe backlash against Weinstein includes him being suspended by BAFTA, fired from The Weinstein Co. and having his $5 million endowment rejected, intended for USC’s School of Cinematic Arts ability to grant scholarships to female directors. The mogul’s producing credit has also been pulled from TWC’s television shows. And a criminal investigation has been opened by the New York Police Department.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/gettyimages-630819502_-_h_2017_0.jpg?w=928&h=523&crop=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/gettyimages-630819502_-_h_2017_0.jpg?w=928", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/gettyimages-630819502_-_h_2017_0.jpg?w=928", "keywords": [], "authors": ["Lexy Perez"], "canonical_link": "https://www.hollywoodreporter.com/news/general-news/tom-hanks-shares-thoughts-harvey-weinstein-allegations-1048171/", "title": "Tom Hanks Speaks Out on Harvey Weinstein Claims", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The beloved actor spoke to The New York Times about the disgraced mogul, whom he never worked with.", "news_keywords": "autoplay, Harassment in Hollywood, Harvey Weinstein, tom hanks", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Lexy Perez", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1048171, "title": "Tom Hanks Speaks Out on Harvey Weinstein Claims", "published_at": "2017-10-12 11:40:10", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/gettyimages-630819502_-_h_2017_0.jpg?w=928", "comment_count": 0, "tags": "tom hanks", "topics": "News", "body": "Tom Hanks never worked with Harvey Weinstein, but the beloved veteran actor spoke to The New York Times about the disgraced mogul and what the recently uncovered allegations of harassment and assault reveal about Hollywood.\r\nDespite never working with Weinstein, Hanks said of the claims against the Miramax co-founder, including three women telling The New Yorker that Weinstein raped them: \"Aah, it all just sort of fits, doesn't it?”\r\nWhen asked why Hollywood \"sheltered\" Weinstein despite rumors of his inappropriate behavior, Hanks rejected the excuse, which Weinstein himself made, that his behavior could be considered old-fashioned.\r\n\r\n\"Well, that's a really good question and isn't it part and parcel to all of society somehow, that people in power get away with this?\" Hanks asked. Further adding, \"Look, I don't want to rag on Harvey but so obviously something went down there. You can't buy, 'Oh, well, I grew up in the '60s and '70s and so therefore ...' I did, too.\"\r\nHanks emphasized that power in Hollywood can be rather manipulative.\r\n\"I think it's like, well, what do you want from this position of power? I know all kinds of people that just love hitting on, or making the lives of underlings some degree of miserable, because they can,\" the actor said.\r\n\r\n\"They think their achievements entitle them,” Hanks said, proceeding to reference a quote about power. \"Somebody great said this, either Winston Churchill, Immanuel Kant or Oprah: 'When you become rich and powerful, you become more of what you already are,'\" Hanks said.\r\nHanks agrees with the quote, saying he supports the negative backlash against the movie mogul.\r\n\"I would say, there's an example of how that's true. Just because you're rich and famous and powerful doesn't mean you aren't in some ways a big fat ass. Excuse me, take away 'fat,'\" Hanks said. \"But I'm not, you know, I'm not the first person to say Harvey's a bit of an ass. Poor Harvey — I'm not going to say poor Harvey, Jesus. Isn't it kind of amazing that it took this long? I'm reading it and I'm thinking 'You can't do that to Ashley Judd! Hey, I like her. Don't do that. That ain't fair. Not her, come on. Come on!\"\r\n\r\nHanks also commented on the sexism that continues to exist within Hollywood, referring to the show Mad Men, to which he says \"had absolutely no nostalgia or affection for its period.\"\r\nThe actor explained, \"Those people were screwed up and cruel and mean. And, 'Hey, wait, that's going on today? Shouldn't we be on this?' Is it surprising? No. Is it tragic? Yes. And can you believe it's happening? I can't quite believe that.\"\r\nHanks isn't the only Hollywood star to comment on the recent Weinstein allegations. The actor joins Meryl Streep, George Clooney, Patricia Arquette, Leonardo DiCaprio, Julianne Moore, Mark Ruffalo, Jennifer Lawrence and others.\r\nThe backlash against Weinstein includes him being suspended by BAFTA, fired from The Weinstein Co. and having his $5 million endowment rejected, intended for USC's School of Cinematic Arts ability to grant scholarships to female directors. The mogul's producing credit has also been pulled from TWC's television shows. And a criminal investigation has been opened by the New York Police Department.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Tom Hanks Speaks Out on Harvey Weinstein Claims", "url": "https://www.hollywoodreporter.com/news/general-news/tom-hanks-shares-thoughts-harvey-weinstein-allegations-1048171/", "description": "The beloved actor spoke to The New York Times about the disgraced mogul, whom he never worked with.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/gettyimages-630819502_-_h_2017_0.jpg?w=928", "width": 928, "height": 523}, "locale": "en_US"}, "article": {"published_time": "2017-10-12T11:40:10+00:00", "modified_time": "2017-11-22T17:09:18+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Tom Hanks Speaks Out on Harvey Weinstein Claims", "description": "The beloved actor spoke to The New York Times about the disgraced mogul, whom he never worked with.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/10/gettyimages-630819502_-_h_2017_0.jpg?w=928"}}, "movies": [], "publish_date": 1507808410.0, "source": "https://www.hollywoodreporter.com", "summary": ""}