{"url": "https://en.wikipedia.org/wiki/I_Want_It_That_Way", "text": "1999 single by Backstreet Boys\n\n\"I Want It That Way\" is a song by American boy band Backstreet Boys. It was released on April 12, 1999, as the lead single from their third studio album, Millennium. It was written by Max Martin and Andreas Carlsson, while Martin and Kristian Lundin produced it. The pop ballad tells of a relationship strained by matters of emotional or physical distance.\n\nCritically, the song was met with positive reception, with many critics commending its catchiness, also calling it the pop ballad of the year. The song was nominated for three Grammy Awards, including Song and Record of the Year, and has been included in lists by Blender, MTV, Rolling Stone and VH1. In 2021, \"I Want It That Way\" was placed at number 240 on the revised list of Rolling Stone's \"500 Greatest Songs of All Time\".[2]\n\n\"I Want It That Way\" is the Backstreet Boys’ signature song, and commercially it reached the number-one spot in more than 25 countries,[3] including Austria, Germany, Italy, New Zealand, Switzerland and the United Kingdom. In the United States, the song peaked at number six on the Billboard Hot 100 chart for eight non-consecutive weeks, while it topped the Adult and Mainstream Top 40 charts.\n\nThe song has been widely covered and parodied by a range of artists, including other boy bands such as JLS and One Direction, while its music video, directed by Wayne Isham, received famous parodies, including Blink-182 on their music video for \"All the Small Things\", Big Time Rush on their music video for \"Like Nobody's Around\", their music video for 'Worldwide', and the Wanted on their video for \"Walks Like Rihanna\". The original music video received four VMA nominations, winning Viewer's Choice.\n\nBackground and history [ edit ]\n\nAfter the success of their first two albums, Backstreet Boys (1996) and Backstreet's Back (1997), the band recorded their third studio album, during 1998 and 1999. When the members of the Backstreet Boys came to Stockholm in November 1998 for a two-week recording engagement, they were eventually presented the demo of \"I Want It That Way\", which at the time only consisted of the main chorus. Upon leaving Sweden on November 16 for a November 17 Oprah taping, vocals for the song had been completed in two days.\n\nOriginally, \"Larger Than Life\" was intended to be the lead single, following the similar formula of their first two albums, having an upbeat lead single. However, after hearing the final version of \"I Want It That Way\", the group wanted to move in a more mature direction, by utilizing a mid-tempo track as the lead single. Zomba Recording executives had to be convinced to approve of the song as the first single, due to them citing that the group could \"alienate fans\" with a mid-tempo song that had vague lyrical meaning. In the end, press information in the form of snippets was authorized for release to radio stations in March 1999, to precede the song's release to radio in April.\n\nCensorship [ edit ]\n\nOn August 19, 2011, China's Ministry of Culture released a list of 100 songs, including the then twelve-year-old \"I Want It That Way\", that were required to be removed from the Internet. This purge came about because the Ministry claimed that these songs had been released without first being subjected to a mandatory screening process conducted by Ministry officials as per official government policy. Media sites were given until September 15 to delete the named songs or face unspecified penalties. The Chinese government claims that such measures are necessary for national security purposes.[4]\n\nWriting and inspiration [ edit ]\n\nI Want It That Way The guitar intro and first verse of the song. Problems playing this file? See media help.\n\n\"I Want It That Way\" was written by Andreas Carlsson and Max Martin, while Martin and Kristian Lundin produced the track. The acoustic-guitar arpeggio riff, which forms the song's intro and reiterates throughout the verses, was written at the very end of the recording sessions and was, according to Carlsson, inspired by \"Nothing Else Matters\" by Metallica.\n\nThe song is written in the key of A major. At approximately the 2 minute, 25 seconds point of the song, the key modulates to B major. Their vocals span from E 4 to B 5 .[5] An alternate version of the song with different lyrics was written and recorded by the band in January 1999. The version was included in some early demo presses of the album. In the alternate version, the song has the opposite message (\"I love it when I hear you say, I want it that way\").[6] [7] The alternative lyrics were written by Martin and Carlsson in collaboration with Mutt Lange.[8]\n\nThe alternate version was leaked on the internet via Napster and other methods in the early 2000s, and was also played infrequently on some radio stations. According to then-member of the Boys' backing band, Tommy Smith, the album version is the \"original version\"; the alternate version was recorded because the chorus of the album version did not make sense.[9] In an interview with HitQuarters, Andreas Carlsson confessed that the song was a play with words. According to him, \"When Max came up with the original idea for the song, it already had the line 'you are my fire, the one desire'. We tried a million different variations on the second verse, and finally we had to go back to what was sounding so great, 'you are my fire, the one desire'. And then we changed it to 'am I your fire, your one desire', which made absolutely no sense in combination with the chorus – but everybody loved it!\"[8]\n\nLyrical interpretation [ edit ]\n\nMany critics over the years have questioned the song's lyrical meaning, mainly the line, \"I want it that way.\" Ben Westhoff of LA Weekly dissected the song, writing that its lyrical content \"makes zero sense\". For Westhoff, \"Mainly, the meaning of 'that' is at issue.\" While analyzing the lyrics, Westhoff perceived that, \"None of the sentiments in the chorus seem to go with any of the other ones. Even worse, no further explanation is given for what 'that' is.\" The critic assumed that in the song \"someone simply doesn't like it when his lover expresses preferences, never wanting to hear when his girlfriend says she wants things in particular ways\".[10]\n\nAndrew Unterberger of PopDust also questioned the song's lyrics, writing that \"the song doesn't make a whole lot of sense\" and noting \"the odd phrasing of the title and certain other key lyrics\". Unterberger also noted that \"The phrase 'I want it that way' is similarly devoid of inherent meaning, but it’s used recurringly as a kind of conclusive phrase, always calling back to those first two lines, as the song gets gradually more despairing in nature.\" Unterberger also found out that \"The chorus would appear to be in direct opposition to the rest of the song.\"[11]\n\nUnterberger concluded that the song \"is about a relationship that’s troubled by matters of emotional and/or physical distance, but that the singer feels strongly enough about to keep it going just the same…until the chorus, at which point he decides that it’s not worth the trouble. No, it doesn’t make sense, but it’s still stirring, beautiful in its own weird way, and undeniably unforgettable. And frankly, we wouldn’t want it any other way.\"[11] Kevin Richardson, a member of the band, explained in an interview that, \"Ultimately the song really doesn't make much sense.\" Richardson also wrote that co-writer Max Martin's knowledge of English was limited at the time. \"There are a lot of songs out there like that don't make sense but make you feel good when you sing along to them, and that's one of them,\" Richardson commented in an interview.[12]\n\nIn 2018, the band seemed to reverse course regarding the depth of the song's lyrical content, at least in part. In response to Chrissy Teigen on Twitter, the official Backstreet Boys Twitter account attempted to clarify the song's meaning of \"it,\" among other points of confusion: \"Don’t wanna hear you say that you want heartaches and mistakes... or to be 2 worlds apart. We don’t want you to want “it” that way - that's the way we want it... for you to not want it that way.\"[13]\n\nCritical reception [ edit ]\n\n\"I Want It That Way\" was met with positive reception from most music critics. Stephen Thomas Erlewine of AllMusic picked the song as a highlight on Millennium, calling it an \"infectious song that will be enough to satisfy anyone craving more, more, more\".[14] In a review of the compilation The Hits – Chapter One (2001), Erlewine further declared that the song \"transcend[ed] their era.\"[15] Jim Farber of Entertainment Weekly wrote that the track \"ranks as the bubblegum ballad of the year. It's so likable, it doesn't matter that the group's voices are the sonic equivalent of warm milk.\"[16]\n\nLegacy [ edit ]\n\n\"I Want It That Way\" became one of the Backstreet Boys' signature songs and one of the most praised songs by the group. Rolling Stone listed Backstreet Boys at number one on their Readers' Poll: The Best Boy Bands of All Time, writing that \"the five-piece scored several huge hits, but their 1999 smash 'I Want It That Way' is a genre-transcending classic\".[17] While listing the 10 biggest boy bands from 1987 until 2012, Billboard placed the band at number two, writing that, \"They tallied up six Hot 100 top 10 hits including well-loved tunes like 'I Want It That Way' and 'Quit Playing Games (with My Heart)'.[18] \"I Want It That Way\" was also placed at number two on Complex list of The 30 Best Boy Band Songs.\n\nThe song was also listed at the top of many lists that included the band's best songs. Bill Lamb of About.com ranked the song at the top of the list, writing that \"Even Backstreet Boys detractors sometimes admit this single is a gorgeous pop ballad. The quintet's pure singing skills often set them apart from pretenders to the boy band throne.\"[19] Emily Exton of VH1 chose the song, among twenty, as the best Backstreet Boys song, writing that, \"It doesn’t take weeks of phoning Carson Daly to know that this the 1999 monster smash is the quintessential modern pop ballad, propelling the genre and the state of the boy band into the 21st century. There’s call and response, human emotion, and allusions to fire even Charli XCX can’t resist.\"[20] Danielle Sweeney of TheCelebrityCafe.com also listed \"I Want It That Way\" at number one, calling it \"Quite possibly the greatest pop song of all time. If not, it’s at least BSB’s greatest song of all time.\"[21] The song was ranked number 10 on MTV/Rolling Stone list of the \"100 Greatest Pop Songs of All Time\" in 2000.[22] VH1 listed the song at number three on \"The 100 Greatest Songs of the '90s\",[23] and number 61 on 100 Greatest Songs of the Past 25 Years in June 2003.[24] Blender ranked at number 16 on their 500 Greatest Songs Since You Were Born list.[25] In 2017, ShortList's Dave Fawbert listed the song as containing \"one of the greatest key changes in music history\".[26] In November 2021, the music video reached one billion views on YouTube,[27] joining Guns N' Roses November Rain, Nirvana's Smells Like Teen Spirit, 4 Non Blondes' What's Up?, The Cranberries' Zombie, and Whitney Houston's I Will Always Love You as a small handful of 1990's songs to surpass that mark.[28]\n\nAwards and accolades [ edit ]\n\n\"I Want It That Way\" was also nominated for three Grammy Awards at the 42nd edition. It was nominated for \"Best Pop Performance by a Duo or Group with Vocals, losing to \"Maria Maria\", by Santana featuring the Product G&B, \"Record of the Year and Song of the Year, both losing to \"Smooth\", also by Santana, featuring Rob Thomas.[29] The song was also voted the best boyband single of the past 15 years (until 2013) by Amazepop, topping the poll above the likes of 5ive's 'Keep On Movin'' and Westlife's 'Flying Without Wings'.[30]\n\nCommercial performance [ edit ]\n\n\"I Want It That Way\" became one of the most successful singles by the band in most countries where it has charted. In Australia, the song debuted at number six on the ARIA Singles Chart week of May 16, 1999, dropping to number seven the next week. Later, it climbed to number three, before peaking at number two, becoming their highest-charting single, alongside \"As Long As You Love Me\" (which also peaked at number two), until \"Incomplete\" surpassed them, in 2005, reaching number-one.[32] It was certified platinum by the Australian Recording Industry Association, for selling over 70,000 copies.[33] In New Zealand, the song debuted at number two, peaking at number-one for two consecutive weeks. It became their second number-one single, after \"As Long As You Love Me\" (1997).[34] The song was also a number-one hit in Austria, where it debuted at the top, before falling to number three and regaining the number-one position again. It was also their second number-one single, after \"Quit Playing Games (With My Heart)\" (1996).[35] The song also topped the charts of Germany, the Netherlands, Norway, and Switzerland.[36]\n\nIn the United States, \"I Want It That Way\" became the group's fourth top-10 single. It opened at number 72 on the Billboard Hot 100 the week of April 24, 1999, and after nine weeks it reached and peaked at number six,[37][38] staying there for eight non-consecutive weeks, also breaking the record for most radio station adds in its first week with 165, it didn't chart higher because the track was not released as a commercially available single during the height of its popularity, so the song was not able to go any higher than No. 6 on the Billboard Hot 100, which then combined only airplay and sales data to determine the week's most popular songs in the US.[39] It also reached the number-one spot on the Billboard Hot Adult Contemporary Tracks charts, where it stayed for ten non consecutive weeks.[40] On the Billboard Mainstream Top 40 chart the single debuted at number 30 the week of April 24, 1999, and reached the top of the chart after twelve weeks, it set a record for most weeks at number one.[41][42][citation needed] Additionally, it reached number one on the Radio Songs chart for three weeks from July 17, 1999, to July 31, 1999.[39] In the United Kingdom, \"I Want It That Way\" debuted at the top of the UK Singles Chart the week of the May 15, 1999, and became the band's first and only number-one single.[43][44] The song was also the 15th biggest selling boyband single of the 1990s in the UK selling 423,300 copies.[45]\n\nMusic video [ edit ]\n\nThe music video, directed by Wayne Isham was filmed at Los Angeles International Airport (LAX) April 1–2, 1999 and debuted on MTV's TRL on May 5, 1999.[46][47] The Tom Bradley International Terminal is seen in numerous shots and also appears as the band sings and dances to the chorus. In the final chorus, as the band prepares to board their plane, a Boeing 727, they are greeted by a crowd of screaming fans bearing signs and flowers. The scenes involving the plane and the final scenes which featured the fans were filmed in one of the hangars of LAX. Additionally, a Delta Air Lines L-1011 appears when Howie D. sings the fourth verse.\n\nThe video features prominent special effects scene transitions between shots. Notably, a high-speed zoom effect which makes it appear that the foreground subject has not changed to a new shot while the background has, fades in and out of white, and shifting between different film speeds during shots. Another special effects sequence using greenscreen, in which the band, dressed in white (video styled by Rachel Zoe), would perform a dance sequence while being manipulated over the backdrop of the Tom Bradley terminal lobby was mostly cut from the video, as it was felt that a dance sequence did not fit with the song, though elements of the dance remain in the second chorus, as do non-dance elements in that sequence.\n\nThe video reached number 35 on \"Muchmusic's 100 Best Videos\". The song's music video has been parodied by Blink-182 in their music video for the song \"All the Small Things\". The video itself ranked as number three on the top 10 list of the most iconic videos of all time at the TRL finale.\n\nThe video achieved over 1 billion views on YouTube as of November 2021.[48]\n\nCovers, parodies, and usage in media [ edit ]\n\nSince its release, \"I Want It That Way\" has been covered on numerous occasions. In 2010, American band Steel Panther released a rock cover of the song. After British boy-band One Direction performed a cover of the song in concert in 2013, Backstreet Boys member Howie D voiced his approval, saying, \"It’s nice to see groups like that pay homage to us. We definitely paid homage to groups in the earlier days...\"[49]\n\nThe song and the video received many parodies. American radio personality Howard Stern parodied the track on his show called \"If I Went The Gay Way\", which was sung by his band The Losers[50] and peaked at No. 115 on the Billboard charts.[51] A parody called \"Which Backstreet Boy is Gay\" became an internet phenomenon and became misattributed to parodist \"Weird Al\" Yankovic - who actually did parody the song; however, in his actual parody of the song, titled \"eBay\" (on the album Poodle Hat), the narrator tells of his impulsive habits of buying bizarre items on the online auction site for which the parody is named. The misattributed version \"Which Backstreet Boy is Gay\" was actually performed by the morning crew at Portland, Oregon, radio station KKRZ-FM, known locally as Z100.[52] One of the most famous parodies came from the American pop punk band Blink-182, who parody the music video for \"I Want It That Way\", as well as Britney Spears's \"Sometimes\" and Christina Aguilera's \"Genie in a Bottle\" videos, in their video for the song \"All the Small Things\".[53] Brazilian comedian Rafinha Bastos parodied the band as \"Backstreet Farmers\", sing the song.[54] In 2013, British-Irish boyband the Wanted parodied the video for their music video for the song \"Walks Like Rihanna\".[55]\n\nThe song is featured on the re-release version of Grand Theft Auto V for PlayStation 4, Microsoft Windows and Xbox One versions released on November 18, 2014, then on PlayStation 5 and Xbox Series X/S versions released on March 15, 2022. It can be heard on the in game radio station Non-Stop-Pop FM.[56]\n\nThe remix version of the song, entitled The Jack D. Elliot Remix, was featured on the soundtrack of the 1999 American romantic comedy Drive Me Crazy, starring Melissa Joan Hart and Adrian Grenier.[57] Main characters Shawn and Gus from USA Network's Psych, played by James Roday and Dulé Hill respectively, sing a rendition of the song while trying to block Juliet (Maggie Lawson) from the spotlight during the end credits of the episode \"Forget Me Not\". An animated version of the music video was shown on the beginning of the Arthur television special, Arthur: It's Only Rock 'n' Roll. The five members were also featured as guest stars.[58]\n\nIn 2016, Brittany Howard, lead singer of Alabama Shakes, and Jim James, frontman of My Morning Jacket, covered the song in a commercial for American fast food chain Chipotle Mexican Grill.[59]\n\nThe song was used in the cold open of the Brooklyn Nine-Nine season 5 episode \"DFW\". Andy Samberg's character has a police lineup sing the song to help a victim identify a killer.[60]\n\nThe song was also used in the 2002 Arthur special \"Arthur It's Only Rock and Roll\".\n\nOn October 19, 2018, a YouTube channel known as \"THE MERKINS\" released a parody music video of the song entitled \"I'll Kill You That Way\". It featured Jason Voorhees, Freddy Krueger, Michael Myers, Ghostface, and Leatherface in place of the Backstreet Boys as its singers, with \"THE SLASHSTREET BOYS\" as the band's name.[61][62]\n\nIn 2019, the song was featured in a Doritos commercial during Super Bowl LIII (promoting its new \"Flamin' Hot\" flavor), which featured Chance the Rapper rapping over a remix of the song. The group itself also makes an appearance in the ad.[63][64]\n\nOn March 1, 2020, Lil Uzi Vert sampled the song on his single \"That Way\" for his second studio album Eternal Atake.\n\nOn September 21, 2020, a TikTok user named \"BruncleDew\" made a viral video of him singing the chorus of the song after TikTok user \"lady farquaad\" screams \"Tell me why ...\"[65][66] The video spawned a trend of duets from many different creators. Popular duets being the ones by \"Donald Duck\", \"Angry Reactions\", and the most popular one being Dustin Phillips' duet where he added a bunch of instruments and well-produced vocals.[67][68][69] \"BruncleDew\" then released a cover of the song on his SoundCloud[70]\n\nFor the 2021 holiday season, the song was used in a television commercial for the Samsung Galaxy Z Flip 3, entitled \"You Are The Gift\".[71]\n\nIn 2022, the song appeared in, and was used as the title for, episode 4, season 1, of HBO's Tokyo Vice, where several character discuss what \"that\" alludes to.[72]\n\n2019 version [ edit ]\n\nIn 2019, the band rerecorded the song in a new cover titled \"I Want It That Way: Reimagined\" on May 16, 2019, on their YouTube channel and digital streaming platforms in the celebration of the song's 20th anniversary.[73]\n\nTrack listing [ edit ]\n\nUK CD1 \"I Want It That Way\" – 3:33 \"My Heart Stays with You\" – 3:37 \"I'll Be There for You\" – 4:43 CD2[74] I Want It That Way I Want It That Way (David Morales Club Version) I Want It That Way (The Wunder Dub) I Want It That Way (Jazzy Jim Vocal Mix)\n\nCredits and personnel [ edit ]\n\n\"I Want It That Way\" Produced by Max Martin and Kristian Lundin\n\nRecorded at Cheiron Studios, Stockholm, Sweden\n\nMixed by Max Martin and Kristian Lundin at Cheiron Studios, Stockholm, Sweden\n\nGuitar: Esbjörn Öhrwall\n\nGuitar: Kyla Perlmutter\n\nBass: Thomas Lindberg\n\n\"My Heart Stays with You\" (Full Force)\n\nProduced and Arranged by Full Force\n\nRecorded by Full Force, Melanie Jones and Tim Donovan at Battery Studios and Po' House Studios, NY\n\nMixed by Chris Trevett and Full Force at Battery Studios, NYC \"I'll Be There for You\" (Gary Baker, Timmy Allen, Wayne Perry)\n\nProduced by Larry \"Rock\" Campbell and Timmy Allen\n\nRecorded by Adam Barber, Chris Trevett and Tim Donovan at Battery Studios, NYC and Parc Studios, Orlando, FL\n\nAssistant Recording Engineers: Daniel Wierup and Sharon Kearney\n\nMixed by Nigel Green at Battery Studios, NYC\n\nInstruments: Larry \"Rock\" Campbell\n\nAssistant Mix Engineer: Daniel Wierup\n\nString Arrangement: Jimmy Biondolillo and Timmy Allen\n\nConductor: Jimmy Biondolillo\n\nAdditional Background Vocals: Sekou Aiken\n\nCharts [ edit ]\n\nCertifications and sales [ edit ]\n\nRelease history [ edit ]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Gnome-mime-sound-openclipart.svg/50px-Gnome-mime-sound-openclipart.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/5/5c/Symbol_template_class.svg/16px-Symbol_template_class.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/f/f9/Double-dagger-14-plain.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/b/b9/Iwantitthatwaycd.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c8/I_Want_It_That_Way_Video.png/220px-I_Want_It_That_Way_Video.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b9/Iwantitthatwaycd.jpg/220px-Iwantitthatwaycd.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/b/b9/Iwantitthatwaycd.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/I_Want_It_That_Way", "title": "I Want It That Way", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/b/b9/Iwantitthatwaycd.jpg", "width": 640, "height": 559}, "title": "I Want It That Way - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}