{"url": "en.wikipedia.org/wiki/Anmer_Hall", "text": "Georgian country house in Norfolk, England\n\nFor the theatre director with pseudonym Anmer Hall, see Alderson Burrell Horne\n\nAnmer Hall is a Georgian country house in the village of Anmer in Norfolk, England. Built in the 19th century, it was acquired by the Sandringham Estate sometime after Queen Victoria purchased the property, and has previously been leased to business owners, civil servants, and members of the British royal family. It is currently the country residence of the Prince and Princess of Wales, given to the couple as a wedding gift by Elizabeth II.\n\nDesign and location [ edit ]\n\nAnmer Hall, shown with new roof, in October 2014\n\nThe Georgian house was built in 1802.[1] It has two storeys and an attic with dormer windows. The long south front comprises 13 bays, and was refaced with red bricks c. 1815. It has 13 ground-floor windows set in blank arches and a semicircular porch on two Tuscan columns, with 11 windows on the first floor. The three central bays are topped by a pediment. The north front is of rubble carrstone and includes four c. 17th-century ogee-headed sashes on the first floor. Renovations c. 1900 added a brick-dressed skin to the north front, together with a projecting entrance porch and a tower towards the eastern end, in the corner formed with a carrstone service wing also added c. 1900.[citation needed] The house was registered as a Grade II* listed building in 1984 but was later de-listed.[2]\n\nAnmer Hall has ten bedrooms.[1] The interior style has been described to be \"a mixture of contemporary designs and well-loved antiques\", decorated with gilt picture frames and houseplants.[3] The walls have been reported to be painted in cream colours, while the dining room is a \"bold jewel green\".[3] The house has an outdoor swimming pool and a tennis court.[3] In 2017, it was reported that residents the Prince and Princess of Wales had installed a chicken coop in the grounds.[3] The couple also keep bees and produce honey on the estate.[4]\n\nThe surrounding estate became a scheduled ancient monument in 2003, and includes earthworks marking the sites of buildings from the medieval village of Anmer.[5] The village church, St Mary, lies close to the house, but a short distance away from the modern village. The house is 12 miles (19 kilometres) northeast of King's Lynn, 2 mi (3 km) east of the Queen's residence at Sandringham and 2 mi (3 km) west of Houghton Hall.[citation needed]\n\nHistory [ edit ]\n\nOriginally the seat of the Coldham family,[6] the Anmer Hall estate was purchased in 1896 at auction for £25,000 by the famed serial fraudster[7] Ernest Terah Hooley before his first bankruptcy. The Prince of Wales (the future King Edward VII) had attempted to purchase the property prior to Hooley's acquisition[8] and, through an intermediary, Prince Edward requested to purchase the property from Hooley. Hooley agreed, allowing him to buy it at cost in 1898, after which it became part of the Sandringham Estate.[9][6] The reason given was that the Prince wanted the house for the use of his daughter, Princess Maud. A further motivation for the Prince's action was to avoid the possibility of Hooley's business promoter Alexander Meyrick Broadley, whom the Prince had implicated in the Cleveland Street scandal, from becoming a constant guest on the estate.[9][10][11]\n\nAnmer Hall was leased to John Loader Maffey, 1st Baron Rugby who served as Governor-General of Sudan, and held diplomatic posts in the Colonial Office and Ireland.[citation needed] His daughter, Penelope Aitken, socialised with the Royal Family and was reportedly a favourite of George V.[citation needed]\n\nJohn Maffey, married to Dorothy, known as Dot, lived at Anmer Hall. They had a daughter, Penelope, who walked spaniels with George V. Penelope and King George were dog friends and walked packs of dogs. It is thought that Penelope introduced her husband William to King George at a shooting party.\n\nFrom 1972 to 1990, Anmer Hall was leased to the Duke and Duchess of Kent as their country house. It was subsequently rented for the next decade by Hugh van Cutsem, a close friend of King Charles III.[12] During his residency, the house was often visited by Prince William and Prince Harry in their childhood.[12] The house was then leased to the family of James Everett, owner of kitchen timber company Norfolk Oak.[13]\n\nThe then Duke and Duchess of Cambridge resided mainly at Anmer Hall with their children between 2015 and 2017\n\nThe lease to the Everett family was terminated early following the allocation for Anmer Hall for the Duke and Duchess of Cambridge.[14] The country home was given as a wedding gift to the couple from Elizabeth II.[15][16][17] A £1.5 million refurbishment programme was put in place, paid for by private royal family funds. Renovations included a new roof, new kitchen, the addition of a conservatory, complete internal redecoration; and an extensive tree-planting programme to afford the Duke and Duchess greater privacy.[18][19]\n\nThe then Duke and Duchess of Cambridge and their children moved into Anmer Hall in 2015, and used it as their main residence until 2017.[20][21] It continues to be their private country home, and the family have been reported to spend weekends and school holidays at Anmer.[22][23] William and Catherine's annual Christmas card has featured photographs of the couple outside the home alongside their children.[12][24][25] The family isolated at the residence during the lockdown period of the COVID-19 pandemic.[3] A montage video of the family, filmed within the grounds of Anmer Hall, was released to celebrate the Duke and Duchess's tenth wedding anniversary.[26]", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Building_work_at_Anmer_Hall%2C_Norfolk_%28geograph_3720582%29.jpg/300px-Building_work_at_Anmer_Hall%2C_Norfolk_%28geograph_3720582%29.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Norfolk_UK_location_map.svg/240px-Norfolk_UK_location_map.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c5/Royal_Standard_of_the_United_Kingdom.svg/100px-Royal_Standard_of_the_United_Kingdom.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Red_pog.svg/7px-Red_pog.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c6/Cambridge_family_at_Trooping_the_Colour_2019_-_02.jpg/220px-Cambridge_family_at_Trooping_the_Colour_2019_-_02.jpg", "http://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/e0/Royal_Standard_of_the_United_Kingdom_%28in_Scotland%29.svg/100px-Royal_Standard_of_the_United_Kingdom_%28in_Scotland%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Building_work_at_Anmer_Hall%2C_Norfolk_%28geograph_3720582%29.jpg/1200px-Building_work_at_Anmer_Hall%2C_Norfolk_%28geograph_3720582%29.jpg", "http://en.wikipedia.org/static/images/footer/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Anmer_Hall_near_Sandringham_in_Norfolk_%28geograph_4220749%29.jpg/220px-Anmer_Hall_near_Sandringham_in_Norfolk_%28geograph_4220749%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Building_work_at_Anmer_Hall%2C_Norfolk_%28geograph_3720582%29.jpg/1200px-Building_work_at_Anmer_Hall%2C_Norfolk_%28geograph_3720582%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Anmer_Hall", "title": "Anmer Hall", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/25/Building_work_at_Anmer_Hall%2C_Norfolk_%28geograph_3720582%29.jpg/640px-Building_work_at_Anmer_Hall%2C_Norfolk_%28geograph_3720582%29.jpg", "width": 640, "height": 480}, "title": "Anmer Hall - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}