{"url": "https://www.usatoday.com/story/life/2018/01/30/reports-glee-actor-mark-salling-who-pleaded-guilty-child-porn-found-dead/1079288001/", "text": "'Glee' actor Mark Salling, who pleaded guilty to child porn, found dead by apparent suicide\n\nShow Caption Hide Caption 'Glee' actor Mark Salling found dead Mark Salling has died in an apparent suicide weeks before being sentenced to prison for possession of child pornography. USA TODAY\n\nMark Salling, the former Glee star who pleaded guilty to possessing child pornography and was scheduled to be sentenced in March, was found dead Tuesday, an apparent suicide. He was 35.\n\nEd Winter, spokesman for the Los Angeles County coroner's office, said Salling was found dead by the Los Angeles River in Sunland, Calif., the neighborhood in the San Gabriel Mountains where Salling resided. He was pronounced dead at 9 a.m. local time and an autopsy is pending.\n\nThe suspected cause is suicide by hanging, Winter said, but the final cause will be determined by autopsy.\n\nSalling's lawyer, Michael Proctor, confirmed his death to USA TODAY.\n\n\"I can confirm that Mark Salling passed away early this morning,\" Proctor said in an emailed statement to USA TODAY. \"Mark was a gentle and loving person, a person of great creativity, who was doing his best to atone for some serious mistakes and errors of judgment. He is survived by his mother and father, and his brother. The Salling family appreciates the support they have been receiving and asks for their privacy to be respected.\"\n\nLos Angeles Police Department spokeswoman Det. Meghan Aguilar earlier said police were conducting a “death investigation” in Sunland but declined to identify the body.\n\nSalling was scheduled to be sentenced in early March under a plea agreement reached with federal prosecutors in October in which he admitted to possessing pornographic images of prepubescent children. The agreement stated that a search warrant found more than 50,000 images of child porn on Salling's computer and a thumb drive.\n\nSalling, best known as Noah \"Puck\" Puckerman on Glee, was arrested in December 2015 after the LAPD's Internet Crimes Against Children Task Force served a search warrant on his home in the foothills of the San Gabriel Mountains.\n\nIn May 2016, he was charged in a federal indictment with receiving and possessing child pornography, the Justice Department in Los Angeles announced.\n\nIn the plea agreement, prosecutors agreed to ask a judge to sentence the actor to a prison term of four to seven years. He would also be required to register as a sex offender, pay restitution and abide by restrictions on where he could live.\n\nSalling is the second former Glee actor to have died. Cory Monteith was found dead in a hotel room in Vancouver, British Columbia, in July 2013. He was 31. The local coroner determined Monteith's death was caused by accidental drug overdose due to a toxic mix of heroin and alcohol.", "images": ["http://www.gannett-cdn.com/-mm-/4cb824c7218b5d93e2c9a4d549233b2f875bb0d3/c=0-0-3495-1975&r=1280x720/local/-/media/2018/01/30/USATODAY/USATODAY/636529346302970987-AP-Obit---Mark-Salling.jpg", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-play-alt-white.svg", "https://www.gannett-cdn.com/-mm-/455d51d4fac4762e680c6b9aff880bf604b9aef0/c=0-110-2992-1800/local/-/media/2018/01/30/USATODAY/USATODAY/636529157209369443-454443819.jpg?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/455d51d4fac4762e680c6b9aff880bf604b9aef0/c=0-110-2992-1800/local/-/media/2018/01/30/USATODAY/USATODAY/636529157209369443-454443819.jpg?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/2018/01/30/reports-glee-actor-mark-salling-who-pleaded-guilty-child-porn-found-dead/1079288001/", "title": "'Glee' actor Mark Salling, who pleaded guilty to child porn, found dead by apparent suicide", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/2018/01/30/reports-glee-actor-mark-salling-who-pleaded-guilty-child-porn-found-dead/1079288001/life", "theme-color": "#ffffff", "og": {"type": "article", "title": "'Glee' actor Mark Salling, who pleaded guilty to child porn, found dead by apparent suicide", "description": "Los Angeles coroner says Mark Salling died of apparent suicide by hanging but autopsy is pending.", "site_name": "USA TODAY", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/455d51d4fac4762e680c6b9aff880bf604b9aef0/c=0-110-2992-1800/local/-/media/2018/01/30/USATODAY/USATODAY/636529157209369443-454443819.jpg?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "Los Angeles coroner says Mark Salling died of apparent suicide by hanging but autopsy is pending.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1517270400.0, "source": "https://www.usatoday.com", "summary": ""}