{"url": "https://www.theguardian.com/tv-and-radio/2018/jan/17/assassination-gianni-versace-american-crime-story-review", "text": "The title of the new season of Ryan Murphy’s American Crime Story is tailor-made to drum up anticipation: “The Assassination of Gianni Versace”, it reads, invoking one of the most notorious murders of the 1990s.\n\nWhere the first installment of the anthology series – The People v OJ Simpson – was about exactly that, this time both the name and the promotional material amount to a shiny, sequined red herring. The assassination in question takes place in the very first scene of the series and, unlike the crimes of which Simpson was accused, there’s no ensuing legal battle that grips the country, collectively watching a White Bronco on the 405. So Murphy, television’s pre-eminent dramatist, quite literally flips the script. Versace doesn’t reach the heights of season one, and it’s slow to boil, but at it’s best it makes for thrilling, macabre, deliciously campy television.\n\nIf The People v OJ took the gruesome murders of Nicole Brown Simpson and Ron Goldman and wove them into a fraught tale of racial politics, Versace uses its eponymous victim to tell a story about being gay in America: the seclusion and loneliness of the closet, the pain of stymied desire, the necessary accumulation of lies, and the confusion of a post-Aids-crisis, pre-Will-and-Grace world in which tolerance is nascent but skepticism still pervasive.\n\nAt the center of all this is Andrew Cunanan, who in 1997 went on a cross-country murder spree, killing Jeffrey Trail, David Madson, Lee Miglin, William Reese and, finally, Gianni Versace, on the front steps of his Miami Beach mansion. Murphy, with Tom Rob Smith adapting Maureen Orth’s book Vulgar Favors, chooses to tell the story in reverse, a gambit that can be confusing but begins to pay off several episodes in. The desired effect is to watch criminality unfurl itself backwards, to show the origin story of a killer as perversely apathetic and strangely endearing as Cunanan. But the tactic is neither necessary nor particularly enhancing.\n\nCunanan is played by Darren Criss, the velvet-voiced Warbler of Glee fame. His portrayal is not convincing at first, but like everything in the series, it improves with time and exposure. As the closeted, bespectacled killer, Criss is clearly inspired by Anthony Perkins’ Norman Bates and Malcolm McDowell’s Alex DeLarge; charm is conveyed through widened eyes, sweetness through an uptick in cadence, and homosexuality through a cock of the wrist or a wiggle of the hips, which is maybe why we should cast gay actors to play gay characters a little more often. But despite the capital-A acting, Criss is nothing if not dedicated, and he comes to embody Cunanan quite formidably by the time he’s gallivanting through gay bars telling people he’s a set designer on the upcoming movie Titanic.\n\nDarren Criss, Edgar Ramirez, Penelope Cruz, and Ricky Martin star in The Assassination of Gianni Versace: American Crime Story. The next installment of Ryan Murphy's award-winning series premieres 1/17 on FX. #ACSVersace pic.twitter.com/ktM44SNzLw — AmericanCrimeStoryFX (@ACSFX) January 8, 2018\n\nWhat really makes this series excel is an inarguably stellar supporting cast. It’s impossible to turn away from Penélope Cruz as Donatella Versace, wearing a black-laced veil as she confronts her brother’s corpse; Edgar Ramírez as Gianni is commanding and quietly tortured; Max Greenfield is superb as a South Beach junkie who crosses paths with Cunanan and makes it out alive; Finn Wittrock, playing a closeted naval officer after the signing of Don’t Ask, Don’t Tell, is the first of Cunanan’s victims; and Judith Light, in a single-episode cameo as the widow of the Chicago real estate developer Lee Miglin, is, well, Judith Light (read: brilliant). Murphy’s heavy-handedness is not to everyone’s liking, but he always manages to squeeze all the pulp out of his performers.\n\nPenélope Cruz as Donatella Versace in a scene from The Assassination of Gianni Versace: American Crime Story. Photograph: Jeff Daly/AP\n\nIn following Cunanan’s deadly joyride, the show also takes us from Miami to Minneapolis to Chicago to La Jolla. One moment, we’re at the Versace mansion, as chiseled butlers serve orange juice on silver trays, and the next we’re in seedy motels and lakeside cottages as characters snort heroin and hunt quail. The contrast says as much about class as it does the geographical scope of the murders; Cunanan is both killer and liar, but more than anything he’s a striver, with Versace advertisements thumb-tacked to his wall and an expensive wardrobe mostly gifted to him by the older, rich men whom he dates and, in some cases, slays.\n\nThe smartest thing about the show is that, in stark contrast to the courtroom procedural style of The People v OJ Simpson, each episode plays like a standalone film. Versace’s name may be in the title, but Miglin, Trail and Madson get almost as much backstory, not to mention Cunanan, the only character who appears in every episode. Which is to say that, in the world of the show, queer lives mean very little to law enforcement; in the world of Ryan Murphy, though, they’re each deserving of attention, regardless of wealth or fame.", "images": ["https://i.guim.co.uk/img/media/3e72f4e0541d0730b2d11196dfb16868eec5226a/0_46_4272_2563/master/4272.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctcmV2aWV3LTQucG5n&enable=upscale&s=8104fdbd99c7ae32ed667d55b8573116", "https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Television%2CCulture%2CTelevision+%26+radio%2CVersace%2CFashion%2CPen%C3%A9lope+Cruz%2CUS+television%2CRicky+Martin%2CDrama", "https://i.guim.co.uk/img/media/3e72f4e0541d0730b2d11196dfb16868eec5226a/0_46_4272_2563/master/4272.jpg?width=465&quality=85&dpr=1&s=none", "https://i.guim.co.uk/img/media/e9eabe0393a2a3a6943b7c358ab29ed191360b1b/0_49_4808_2884/master/4808.jpg?width=445&quality=85&dpr=1&s=none"], "top_img": "https://i.guim.co.uk/img/media/3e72f4e0541d0730b2d11196dfb16868eec5226a/0_46_4272_2563/master/4272.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctcmV2aWV3LTQucG5n&enable=upscale&s=8104fdbd99c7ae32ed667d55b8573116", "keywords": [], "authors": ["Jake Nevins"], "canonical_link": "https://www.theguardian.com/tv-and-radio/2018/jan/17/assassination-gianni-versace-american-crime-story-review", "title": "The Assassination of Gianni Versace review – a grim portrait of gay life", "meta_data": {"description": "In his follow-up to The People v OJ Simpson, Ryan Murphy spins the designer’s murder into a compelling story of deceit, ambition and what it meant to be gay at the turn of the century", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#052962", "og": {"url": "http://www.theguardian.com/tv-and-radio/2018/jan/17/assassination-gianni-versace-american-crime-story-review", "image": {"identifier": "https://i.guim.co.uk/img/media/3e72f4e0541d0730b2d11196dfb16868eec5226a/0_46_4272_2563/master/4272.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctcmV2aWV3LTQucG5n&enable=upscale&s=8104fdbd99c7ae32ed667d55b8573116", "height": 720}, "title": "The Assassination of Gianni Versace review – a grim portrait of gay life", "description": "In his follow-up to The People v OJ Simpson, Ryan Murphy spins the designer’s murder into a compelling story of deceit, ambition and what it meant to be gay at the turn of the century", "type": "article", "site_name": "the Guardian"}, "article": {"author": "https://www.theguardian.com/profile/jake-nevins", "publisher": "https://www.facebook.com/theguardian", "modified_time": "2018-07-02T13:50:37.000Z", "section": "Television & radio", "published_time": "2018-01-17T11:30:52.000Z", "tag": "Television,Culture,Television & radio,Versace,Fashion,Penélope Cruz,US television,Ricky Martin,Drama"}, "al": {"ios": {"url": "gnmguardian://tv-and-radio/2018/jan/17/assassination-gianni-versace-american-crime-story-review?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287}, "twitter": {"dnt": "on", "app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"googleplay": "guardian://www.theguardian.com/tv-and-radio/2018/jan/17/assassination-gianni-versace-american-crime-story-review", "iphone": "gnmguardian://tv-and-radio/2018/jan/17/assassination-gianni-versace-american-crime-story-review?contenttype=Article&source=twitter", "ipad": "gnmguardian://tv-and-radio/2018/jan/17/assassination-gianni-versace-american-crime-story-review?contenttype=Article&source=twitter"}}, "card": "summary_large_image", "creator": "@jhnevins", "image": "https://i.guim.co.uk/img/media/3e72f4e0541d0730b2d11196dfb16868eec5226a/0_46_4272_2563/master/4272.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctcmV2aWV3LTQucG5n&s=4cf1358023f84a19af5995e62d6a1a14", "site": "@guardian"}, "robots": "max-image-preview:large"}, "movies": [], "publish_date": 1516147200.0, "source": "https://www.theguardian.com", "summary": ""}