{"url": "https://www.vanityfair.com/hollywood/2018/11/this-is-us-season-3-nicky-alive-rebecca-sick-randall-beth-divorce-kate-toby-baby", "text": "This post contains spoilers for This Is Us Season 3, Episode 9, “The Beginning Is the End Is the Beginning.”\n\nLooks like the Pearson kids have a long-lost uncle. But that’s only fitting for this family, isn’t it? On Tuesday night, This Is Us delivered a fall finale packed, as one might have imagined it would be, with a few twists and turns. The biggest, though, came when Kevin discovered that Jack’s brother, Nicky, did not, in fact, die in Vietnam. Instead, it appears Nicky is alive and well, and living in a home with a lot of wood paneling.\n\nFans also finally discovered the identity of the female character who appears to be sick in the show’s future timeline—not Beth but apparently Rebecca, who in all fairness would be well into her golden years by this stage in the story. Plus, Randall and Beth are now on the rocks, and Kate and Toby are having a boy.\n\nThere are still plenty of mysteries new and old to be solved when the series returns in January—and in an interview with Deadline, This Is Us creator Dan Fogelman broke them all down.\n\nWhat’s the deal with Uncle Nicky?\n\nWhen asked what, exactly, Nicky has been up to—and whether he’s been in hiding this whole time—Fogelman demurred that the story is “complicated.” (No kidding.) But he did say that we’ll learn what happened between Nicky and Jack very quickly upon the show’s return in January. “There’s a lot more to be told, and it’s coming very soon,” Fogelman said. But don’t think that means we’ll necessarily know all the answers by the end of the season: “I’m just saying the big mystery questions are answered pretty quickly.”\n\nIn terms of how that story is told, it appears Kevin will remain front and center in moving that plot forward—especially once he rejoins the Pearson family in the States.\n\nDid Randall just screw things up with Beth for good?\n\nThings are not looking good for this show’s most solid couple. After Randall prioritized his campaign over an increasingly complicated homelife—a daughter who just came out; an adoptive daughter who wants to re-establish contact with her birth mother—Beth banished him to the couch. But will this estrangement last into the future?\n\n“I will say that Randall and Beth, and Sterling and Susan, have some heavy-duty stuff coming up in the back half of this season, which I’ve already read, written, and seen,” Fogelman said. “The couple has been incredible throughout the series, and they’re a couple that people have really taken to. The back half of the season is a real showcase for them.”\n\nHe added that there will be a Beth-centric episode in the season’s back half, so perhaps Beth will finally get the backstory treatment that almost every other character on this show has already enjoyed. As for their marriage, it sounds like, at the very least, there are rough waters ahead—especially given the glimpse we saw of Beth receiving a call from Randall in the future, and not necessarily looking overjoyed to hear from him.\n\nWhat in the world is this show going to do to Rebecca?\n\nNow that we know it’s Rebecca and not Beth who’s getting a visit from Randall and Tess, we’re left to wonder what’s going on with the Pearson matriarch. That mystery has been the slowest to unspool this season—a pacing choice that seems unlikely to change.\n\n“In terms of where they’re going [to see her, in the future], and what’s going on there, I think other stories move forward and center, and some of those answers will spread out towards the end of this season and into the next ones,” Fogelman said. “This is all part of a very long, complex, complicated plan that we’ve really had since go. It’s one of those situations where it’s not just been cooked up overnight; it’s part of the premise of this entire thing, so sometimes things get teased [in the future], but there are other answers being given in the present day that inform those things when you get to them. So a certain amount of things need to happen before you get there, to fully understand it.”\n\nIn other words: whatever questions you have about this flash-forward story line will likely remain unanswered even after the season returns. One possible hint, though, is that Beth is bringing Pin the Tail on the Donkey with her as she goes to visit Rebecca. The Pearsons play this game every year on their birthdays, so it appears whatever Rebecca’s condition is, she might be celebrating another birthday.\n\nHow much should we worry about Kate and Toby’s baby?\n\nNow that Kate and Toby know they’re having a boy, is the pregnancy jinxed? Both have been walking on eggshells since they found out Kate was pregnant—and now that they’ve decided to be more optimistic about their baby’s future, they live in peril of a devastating This Is Us-style twist in which something goes terribly wrong. Unsurprisingly, Fogelman declined to offer any concrete answers on the subject, but he did offer this: “I don’t think you can quite relax with a pregnancy as complicated as theirs. At the same time, I would try and assure people that we’re not masochists, and just leave it at that.”\n\nGiven some of this show’s past acts of cruelty, though, it might still be smart to steel your heart—at least a little.", "images": ["https://media.vanityfair.com/photos/59ef9aef2cf5042e35429f56/1:1/w_350%2Ch_350%2Cc_limit/NUP_179601_2205.JPG", "https://media.vanityfair.com/photos/5bfe9942b44a1a2d726093e7/master/w_2560%2Cc_limit/this-is-us-season-3-nicky-alive-rebecca-sick-randall-beth-divorce.jpg", "https://media.vanityfair.com/photos/631cbbdfb63c9570a030c87e/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/631cbfd16009e759e6638f51/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/633d9bec72fe11ef3849c3ef/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/631aaccb9abfd8a85cba4157/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/5bfe9942b44a1a2d726093e7/16:9/w_1280,c_limit/this-is-us-season-3-nicky-alive-rebecca-sick-randall-beth-divorce.jpg", "https://media.vanityfair.com/photos/5a1ddfa6e74086397a5fa219/1:1/w_350%2Ch_350%2Cc_limit/NUP_180092_2923.JPG", "https://media.vanityfair.com/photos/63370d0bb02ed9e1f657fa60/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/63179190b8123d7576d2d93c/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://www.vanityfair.com/verso/static/hwd/assets/logo-reverse.6ef96ab8686439a35176e2ff8b2c4487e92fbaae.svg", "https://www.vanityfair.com/verso/static/hwd/assets/logo-header.ea437ae89b8c3c7aabbb46bb45a04f1a514e5803.svg", "https://media.vanityfair.com/photos/5a135c98787cb12d25d3e88c/1:1/w_350%2Ch_350%2Cc_limit/NUP_180091_0997.JPG", "https://media.vanityfair.com/photos/633dac5a42c2d8adf3fa7d9c/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/6324bc92df7c2410ea0e15f2/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/633d9f6a42c2d8adf3fa7d98/1:1/w_350%2Ch_350%2Cc_limit/undefined", "https://media.vanityfair.com/photos/631cfacec1df471d836f1b54/1:1/w_350%2Ch_350%2Cc_limit/undefined"], "top_img": "https://media.vanityfair.com/photos/5bfe9942b44a1a2d726093e7/16:9/w_1280,c_limit/this-is-us-season-3-nicky-alive-rebecca-sick-randall-beth-divorce.jpg", "keywords": [], "authors": ["Condé Nast", "Laura Bradley"], "canonical_link": "https://www.vanityfair.com/hollywood/2018/11/this-is-us-season-3-nicky-alive-rebecca-sick-randall-beth-divorce-kate-toby-baby", "title": "This Is Us Creator Dan Fogelman Breaks Down that Shocking Nicky Twist", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "width=device-width, initial-scale=1", "referrer": "no-referrer-when-downgrade", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2022", "description": ". . . Plus, you know, all the other twists in Season 3’s fall finale.", "id": "5bfe917f5f44912d037afe4f", "robots": "index, follow, max-image-preview:large", "content-type": "article", "parsely-post-id": "5bfe917f5f44912d037afe4f", "parsely-metadata": "{\"description\":\". . . Plus, you know, all the other twists in Season 3’s fall finale.\",\"image-16-9\":\"https://media.vanityfair.com/photos/5bfe9942b44a1a2d726093e7/16:9/w_1000,c_limit/this-is-us-season-3-nicky-alive-rebecca-sick-randall-beth-divorce.jpg\",\"image-1-1\":\"https://media.vanityfair.com/photos/5bfe9942b44a1a2d726093e7/1:1/w_1000,c_limit/this-is-us-season-3-nicky-alive-rebecca-sick-randall-beth-divorce.jpg\"}", "og": {"description": ". . . Plus, you know, all the other twists in Season 3’s fall finale.", "image": "https://media.vanityfair.com/photos/5bfe9942b44a1a2d726093e7/16:9/w_1280,c_limit/this-is-us-season-3-nicky-alive-rebecca-sick-randall-beth-divorce.jpg", "site_name": "Vanity Fair", "title": "This Is Us Creator Dan Fogelman Breaks Down that Shocking Nicky Twist", "type": "article", "url": "https://www.vanityfair.com/hollywood/2018/11/this-is-us-season-3-nicky-alive-rebecca-sick-randall-beth-divorce-kate-toby-baby"}, "article": {"content_tier": "metered", "opinion": "false", "section": "tags", "published_time": "2018-11-28T13:40:02.757Z", "modified_time": "2018-11-28T13:40:02.757Z", "author": "Laura Bradley"}, "twitter": {"card": "summary_large_image", "creator": "@VanityFair", "description": ". . . Plus, you know, all the other twists in Season 3’s fall finale.", "domain": "https://www.vanityfair.com", "image": "https://media.vanityfair.com/photos/5bfe9942b44a1a2d726093e7/16:9/w_1280,c_limit/this-is-us-season-3-nicky-alive-rebecca-sick-randall-beth-divorce.jpg?mbid=social_retweet", "site": "@VanityFair", "title": "This Is Us Creator Dan Fogelman Breaks Down that Shocking Nicky Twist"}, "fb": {"app_id": 256281040558, "pages": 8810407571}, "google-signin-client_id": "1065629119444-svrqo31taikd2j0ji4dgjs9q3vul4133.apps.googleusercontent.com"}, "movies": [], "publish_date": 1543412402.757, "source": "https://www.vanityfair.com", "summary": ""}