{"url": "https://www.tvguide.com/news/nbc-this-is-us-thursday-plans/", "text": "Back in May, NBC decided to press the success of its hit new show This Is Us and move it from its Tuesday night home to Thursdays in an effort bring back the glory of the network's \"Must See TV\" days.\n\nEveryone just about lost their mind. Network scheduling is a delicate art, and it appeared that NBC was so rabid over using the show to bolster its entire week and reputation that it put its whole future in jeopardy. Sense finally came back to NBC, and the network decided about a week later to rejigger its schedule and move This Is Us back to its original home on Tuesday nights. You know, where fans already expected it to be. Crisis averted.\n\nBut little did we know how big of a crisis this would have been. At the Television Critics Association summer press tour, NBC executives Robert Greenblatt (chairman of NBC Entertainment) and Jennifer Salke (president of NBC Entertainment) talked more at length about the initial decision to move This Is Us to Thursdays, and the quick realization that they made a huge mistake.\n\n\"We went into scheduling with a really great and exciting idea to take our biggest new hit show and rebrand Thursday and take over Thursday,\" Greenblatt said. \"We thought this would change everything. And we all got excited about it, Dan [Fogelman, This Is Us creator] was on board, we all were up for it. And then after the dust settled -- and I'm happy to say that we're not afraid to say, 'Oh maybe let's rethink something and let's change what we thought was a good idea...'\"\n\nHere's When This Is Us, Will & Grace and More NBC Shows Premiere\n\nAnd it's a good thing they did. Because their plan for how to handle This Is Us on Thursdays may have killed the show with stop-and-start scheduling, special episodes to appease fans during long breaks and the ever-imposing football-shaped broadcasts that wreak havoc on midweek schedules nowadays.\n\n\"As we looked really closely at the football schedule, which we knew was going to interrupt the Thursday run, we talked ourselves into, 'We'll do six episodes of This Is Us and then it will be off for eight weeks, and then we'll do a Christmas episode to keep the audience happy, and then it will come back on in January,'\" said Greenblatt. \"And we kind of were on board with all that, and then we started to think, 'Is that the best way to run the show for rabid fans who are going to hopefully come back in droves?'\"\n\nNBC talked to Fogelman about the Season 2 storylines, and it became clear that a lengthy break would be \"not the best thing for the show.\" Salke continued the thought, and things may have gotten even worse with their ideas.\n\n\"We were all like, 'Do we do the six episodes in a row, and then move somewhere else for three episodes, and then come back down?'\" Salke said. \"So there was a lot of conversation trying to be really thoughtful about what was in the best interest of the show.\"\n\n8 Ways This Is Us Could Make Emmy History\n\nSo to summarize: NBC almost moved This Is Us to Thursdays against football, Shonda Rhimes' empire and The Big Bang Theory, nearly gave its biggest serialized hit an eight-week break, thought about moving it on the schedule for three episodes (to a new time or a new day, we don't know), considered a standalone-on-the-schedule holiday episode to keep fans content before bringing it back in January to an audience that would be no doubt confused or exhausted waiting for it to come back.\n\n\"And maybe in hindsight maybe we should have had more of that extensive thinking before we announced the move,\" Greenblatt added. \"But the show is where it should be. The Tuesday night lineup of The Voice into This Is Us into [Law and Order True Crime: The Menendez Murders] is going to be as compelling as any lineup can be.\"\n\nThank god for second thoughts.\n\nThis Is Us returns for Season 2 on TUESDAY, Sept. 26 at 9/8c.", "images": ["https://www.tvguide.com/a/img/hub/2017/06/28/06ced7a2-2e34-4608-886a-bbb66c4fb738/170628-justin-hartley-alexandra-breckenridge-this-is-us.jpg", "https://www.tvguide.com/a/img/resize/c99a3bf4f727ffdb8fcb2d6cbb7e27111b4164fb/hub/2018/09/09/8579f89a-20c4-4472-8e01-ae6894f2eff5/tim.jpg?auto=webp&height=84&width=84"], "top_img": "https://www.tvguide.com/a/img/hub/2017/06/28/06ced7a2-2e34-4608-886a-bbb66c4fb738/170628-justin-hartley-alexandra-breckenridge-this-is-us.jpg", "keywords": [], "authors": ["Tim Surette", "Aug.", "A.M. Pt"], "canonical_link": "https://www.tvguide.com/news/nbc-this-is-us-thursday-plans/", "title": "NBC's This Is Us Scheduling Was Almost Really Bad", "meta_data": {"viewport": "width=device-width, initial-scale=1", "fb": {"app_id": 63084645929}, "google-site-verification": "Od29UEFliEmsUY2XH0kfXxkTNucL0cv_rc0J_RPWXU4", "og": {"site_name": "TVGuide.com", "image": {"identifier": "https://www.tvguide.com/a/img/hub/2017/06/28/06ced7a2-2e34-4608-886a-bbb66c4fb738/170628-justin-hartley-alexandra-breckenridge-this-is-us.jpg", "height": 850, "width": 850}, "type": "article", "description": "Would anyone have wanted an eight-week break?", "title": "NBC's Plan for This Is Us on Thursdays Was Worse Than We Thought", "url": "https://www.tvguide.com/news/nbc-this-is-us-thursday-plans/"}, "twitter": {"card": "summary_large_image", "site": "@TVGuide", "image": "https://www.tvguide.com/a/img/hub/2017/06/28/06ced7a2-2e34-4608-886a-bbb66c4fb738/170628-justin-hartley-alexandra-breckenridge-this-is-us.jpg", "description": "Long breaks, more moves and holiday episodes were some ideas NBC had to keep the show thriving on Thursdays.", "title": "NBC's This Is Us Scheduling Was Almost Really Bad", "url": "https://www.tvguide.com/news/nbc-this-is-us-thursday-plans/"}, "nuxtstatus": "loaded", "description": "Long breaks, more moves and holiday episodes were some ideas NBC had to keep the show thriving on Thursdays."}, "movies": [], "publish_date": null, "source": "https://www.tvguide.com", "summary": ""}