{"url": "https://en.wikipedia.org/wiki/Naturi_Naughton", "text": "American actress and singer\n\nMusical artist\n\nNaturi Cora Maria Naughton (born May 20, 1984)[1] is an American singer, songwriter, and actress. Naughton is best known as one-third of the R&B group 3LW and for her acting roles in the films Fame and Notorious, in which she played rapper Lil' Kim. Naughton was a series regular on the NBC series The Playboy Club as Bunny Brenda, starred in the first season of the Lifetime drama series The Client List as Kendra and starred in the Starz drama Power as Tasha St. Patrick, a role she reprised in the spin-off series Power Book II: Ghost. In 2022, she starred as Jill “Da Thrill” in the ABC series Queens.\n\nEarly life and education [ edit ]\n\nNaughton was born and raised in East Orange, New Jersey,[1] the daughter of Brenda, a part-time paralegal, and Ezra Naughton, a retired accountant.[2] Her father is originally from St. Croix U.S. Virgin Islands and her mother is from Raleigh, North Carolina.[3] Her musical talent emerged at the age of five years, when she joined her church choir at New Hope Baptist Church (the same church where Whitney Houston performed in her youth) in Newark, New Jersey. She continued her musical studies at the Newark School of the Arts. She attended St. Joseph's Catholic school and Immaculate Conception High School in Montclair, New Jersey. She has sung the national anthem at various events in New Jersey and attended Seton Hall University.[4]\n\nCareer [ edit ]\n\n3LW [ edit ]\n\nIn 1999, at age 15, Naughton joined Adrienne Bailon and Kiely Williams to form the group 3LW. Their first single, \"No More (Baby I'ma Do Right)\", was released in the fall of 2000. \"No More\" was a success and was followed by the second single, \"Playas Gon' Play\" in early 2001. The group's debut album, 3LW, was released on December 5, 2000. The album went platinum, selling 1.3 million copies in the U.S. In the summer of 2001, the group went on the MTV TRL tour along with Destiny's Child, Dream, Nelly, Eve, and Jessica Simpson.\n\n3LW spent the first half of 2002 in the studio, recording an album tentatively titled Same Game, Different Rules. The album and its intended lead single \"Uh Oh\" were presented to the label, who felt it did not have enough urban radio appeal. The tracks from Same Game, Different Rules were leaked to the Internet in MP3 format, and Epic considered dropping the band. A fan support campaign for 3LW named 'Never Let Go of 3LW' followed, and the act was retained. Recording a new set of tracks, 3LW returned in the summer of 2002 with the P. Diddy-produced single \"I Do (Wanna Get Close To You)\", featuring Loon.\n\nBy August 2002, the group was set to release its newest LP, A Girl Can Mack, when Naughton announced that she was no longer a member of the group. Naughton says that the other two girls and their management had forced her out.[5] The problems reached a breaking point after a heated argument with Williams, Bailon, and their manager, which allegedly ended with Williams throwing a hot plate full of KFC food at Naughton. Epic Records then ended their relationship with both 3LW and Naughton. Despite Naughton's departure both Bailon and Williams resumed as a duo for a short amount of time and later Jessica Benson became Naughton's replacement. The group has since disbanded. In May 2017, she reunited with former groupmate Bailon on the daytime talk show The Real, who promoted the season premiere of Power.[6]\n\nSolo work [ edit ]\n\nNaughton at H-E-B Holiday Parade 2009\n\nNaughton recorded five tracks for the Fame soundtrack which was released on August 25, 2009.[7] The following month Naughton scored her first solo chart entry ever with her cover of Fame peaking at No. 33 on the UK Singles Chart. The single also reached the Top 20 in Finland, Portugal and Norway.[8] In 2010 an extended play was released titled Fame Presents Naturi Naughton as Denise: Didn't I Tell You. The EP included tracks already heard before as well as previously unreleased tracks.[9][10]\n\nIn February 2010, when appearing on the BET talk show The Mo'Nique Show, Naughton expressed interest in recording a solo-debut album. However, Naughton has revealed she is instead focusing on her acting career but has not ruled out an album. An ensemble of demos have leaked to the internet, including a duet with Lil' Kim. However, it is unknown whether or not they will be released on her debut album. She was believed to be working with music producer Full Force at the time.\n\nActing [ edit ]\n\nIn March 2008 Naughton was cast to portray Grammy Award-winning rap artist Lil' Kim in Notorious, a biopic film about The Notorious B.I.G.[11] The film was released in January 2009 to mixed reviews[12] and went on to make over $43 million worldwide.[13] Lil' Kim has stated that she wasn't mad at Naughton who portrayed her and that she was mad at how they portrayed her.[14]\n\nNaughton was cast as Denise, an aspiring singer, in the Lionsgate remake of the 1980 film of the same name Fame.[15] Filming took place in New York City and Los Angeles in November and December 2008. The film was released in September 2009 and opened No. 3 at the U.S. box office in its opening weekend despite negative reviews from critics.[16] The film went on to make $77 million worldwide.\n\nIn August 2010, Naughton was announced to appear in an episode of the AMC drama television series Mad Men.[17] Naughton portrays the role of Toni Charles, a Playboy Bunny mistress to the character Lane Pryce. The episode, \"Hands and Knees\", aired on September 26, 2010. The role marked the second time Naughton portrayed a fictional Playboy Bunny. That same month Naughton appeared in the Warner Bros. Pictures comedy film Lottery Ticket.\n\nIn March 2011, Naughton appeared in the drama television series pilot The Playboy Club which centers around the lives of the employees of the original Playboy Club operating in Chicago.[18] The series was picked up by NBC in May 2011.[19] Naughton portrayed the role of Brenda, a Playboy Bunny who dreams of being the first African-American Playboy centerfold.[20] The series premiered on September 19, 2011 and was cancelled after three episodes due to low ratings.[21] In October 2011, Naughton appeared in an episode of the sitcom It's Always Sunny in Philadelphia.[22] Naughton portrays the role of a 1970s jazz club singer named Shadynasty. In December 2011, Naughton was announced to have been cast in the Lifetime drama television series The Client List opposite Jennifer Love Hewitt.[23] The series is a re-imagining of the 2010 film of the same name The Client List.[24] Naughton portrays the role of Kendra a hard-working masseuse at a parlor. The series premiered on April 8, 2012 to 2.79 million viewers[25] and mixed reviews from critics. In May 2012 Lifetime renewed the series for a 15-episode second season.[26]\n\n2012–present: Power and Queens [ edit ]\n\nIn September 2012, Naughton starred in the BET original film Let The Church Say Amen which is adapted from author ReShonda Tate Billingsley's 2005 best-selling novel of the same name. The film was the directorial debut of actress Regina King.\n\nNaughton starred in the Starz drama Power as Tasha St. Patrick, the wife of James \"Ghost\" St. Patrick played by Omari Hardwick, a New York nightclub owner living a double life as a drug kingpin. She won an NAACP Image Award for Outstanding Supporting Actress in a Drama Series, for the third season. She is set to reprise her role as Tasha in the spin-off series Power Book II: Ghost, which began airing in September 2020.\n\nOn March 8, 2021, it was announced that Naughton was to join the cast of American Broadcasting Company's music series Queens, alongside Brandy and Eve.[27][28][29][30] In May 2021, it was announced the show was being picked up for a full series,[31][32][33][34] followed by the first official trailer, released on May 18, 2021.[35] On October 1, 2021, the first promo single from Queens (“Nasty Girl\") was released featuring Naughton alongside the cast: Brandy, Eve and Velazquez.[36] A music video, directed by Tim Story, was released on the same day.[37] This was followed on October 18, 2021 by another rap song from the Queens soundtrack: “The Introduction”, which was co-written by Nas.[38] Queens debuted on October 19, 2021 and reviews were largely positive; Caroline Framke for Variety praised the quartet’s musical offering, calling their raps “sharp and distinct […] making clear their talent as both individuals and a swaggering collective”.[39] Angie Han for The Hollywood Reporter called the show “Impressive […] lavish […] magic”.[40]\n\nPersonal life [ edit ]\n\nIn March 2017, Naughton announced that she was expecting her first child. [41] She welcomed a daughter on July 19, 2017.[42]In April 2022, she got married to the founder of Owner's district and serial entrepreneur Two Lewis in a lavish wedding in Atlanta.\n\nDiscography [ edit ]\n\nFame Presents Naturi Naughton as Denise: Didn't I Tell You (2010)\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nYear Title Role Notes 2008 Cash Rules - Video 2009 Notorious Lil' Kim Fame Denise Dupree 2010 Lottery Ticket Stacie 2013 Highland Park Char Let the Church Say Amen Rachel Jackson TV Movie 2018 Step Sisters Aisha 2020 Emperor Sarah Green Really Love Sicily\n\nTelevision [ edit ]\n\nTheater [ edit ]\n\nYear Title Role Notes Ref. 2005–08 Hairspray Little Inez Replacement", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/NaturiNaughtonDec10.jpg/1200px-NaturiNaughtonDec10.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Naturi_Naughton_in_Parade_5.jpg/220px-Naturi_Naughton_in_Parade_5.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/NaturiNaughtonDec10.jpg/220px-NaturiNaughtonDec10.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/NaturiNaughtonDec10.jpg/1200px-NaturiNaughtonDec10.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Naturi_Naughton", "title": "Naturi Naughton", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/NaturiNaughtonDec10.jpg/640px-NaturiNaughtonDec10.jpg", "width": 640, "height": 815}, "title": "Naturi Naughton - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}