{"url": "www.celebritynetworth.com/richest-celebrities/actors/mar-anthony-net-worth/", "text": "What is Marc Anthony's Net Worth?\n\nMarc Anthony is an American actor, singer, entrepreneur, and producer who has a net worth of $80 million. He is probably most widely recognized for his music career. Marc is the highest selling salsa artist in history, and to date has sold more than 30 million albums worldwide.\n\nEarly Life and Career Beginnings\n\nMarco Antonio Muñiz, better known by his stage name Marc Anthony, was born in New York City on September 16, 1968. His mother, Guillermina, was a housewife, and his father, Felipe, was a hospital cafeteria worker and musician. Both of his parents were from Puerto Rico. Anthony grew up in East Harlem, and was raised Roman Catholic. He is the youngest of eight children.\n\nHe began learning music from his father, who taught him how to sing in both Spanish and English. He is actually named after the Mexican singer Marco Antonio Muñiz. He began his musical career as a session vocalist for freestyle music and underground New York house music acts, and then was a songwriter and backing vocalist for the pop acts Menudo, and the Latin Rascals. This is around the time that he began going by the name Marc Anthony, to avoid confusion with his namesake. He gained fame by performing a style of salsa that borrowed more heavily from African American and urban genres he listened to growing up.\n\nMusic Career\n\nAnthony's first album, a freestyle music record, \"Rebel\", debuted in 1988 on Bluedog Records. During the late 1980s and early 1990s, he worked on a number of projects. He wrote and produced the song \"Boy I've Been Told\" for Sa-Fire, and wrote a duet with Chrissy I-eece called \"You Should Know By Now\" with Little Louie Vega and Todd Terry. He also featured on several freestyle club hits, including \"Ride On The Rhythm\" and \"Time\".\n\nAfter initially being reluctant to become a salsa musician, he eventually changed his mind and work with RMM Records to release his Spanish-language debut, \"Otra Nota\", in 1993. He followed this up with the album \"Todo a su tiempo\" (1995), which won him a Billboard award for Hot Tropical Artist of the Year, and was nominated for a Grammy. The album has sold more than 800,000 copies, and has been certified Gold in both the United States and in Puerto Rico. He released \"Contra La Coriente\" in 1997. The album's song \"Y Huubo Alguien\" was his first No. 1 single on the Billboard Hot Latin Tracks, and was the first song to top the chart by a salsa musician. It also was the first salsa album ever to enter the Billboard 200 chart. He left RMM in 1999, and joined Sony Records.\n\nIn 1999, riding the crossover wave of other Spanish-language artists like Ricky Martin and Enrique Iglesias, Anthony took a shot at the Anglophone market with the English-language album \"Marc Anthony\". It debuted at No. 8 on the Billboard 200, and went Platinum just six weeks later. Eventually, it was certified triple platinum, and the song \"I Need To Know\" was nominated for a Grammy Award for Best Male Pop Vocal Performance. He has since released the albums \"Libre\" (2001), \"Mended\" (2002), \"Amar Sin Mentiras\" (2004), \"Valio la Pena\" (2004), \"El Cantante\" (2007), \"Iconos\" (2010), \"3.0\" (2013), and \"Opus\" (2019).\n\nActing\n\nAnthony first ventured into acting with supporting roles in films like \"Hackers\" (1995), \"Big Night\" (1996) and \"The Substitute\" (1996). He then appeared in the 1998 stage musical \"The Capeman\" with Ruben Blades and Ednita Nazario. The stage show ran for a total of 68 performances. We went on to appear in the films \"Brining Out the Dead\" (1999), \"In the Time of the Butterflies\" (2001), \"Man On Fire\" (2004), \"El Cantante\" (2007). He also appeared as a guest-star in two 2010 episodes of the TNT medical drama \"HawthoRNe\" as the love interest of Jada Pinkett Smith's character, and was later named the executive music producer of the show. Later, in 2011, Anthony ventured into the realm of reality television with the Latin talet series \"Q'Viva! The Chosen\". It was created by Simon Fuller, and featured Anthony and then-wife Jennifer Lopez traveling across 21 countries to find new talent. Then, in 2012, Anthony was a guest mentor on Season 2 of \"The X Factor\".\n\nOther Ventures\n\nAnthony launched the Maestro Cares Foundation in 2012 in partnership with entrepreneur Henry Cárdenas. Some of the work the foundation has been involved in includes the opening of an orphanage in La Romana, Dominican Republic, in 2014, and opening a youth home and school in Barranquilla, Colombia, in 2015. In 2009, Anthony became a minority owner of the Miami Dolphins. In April 2015, he announced the formation of the entertainment company Magnus Media.\n\nPersonal Life\n\nAnthony dated Debbie Rosado, and together they had a daughter in 1994. They also adopted a son together. From 1996 to 1998, Anthony dated and became engaged to actress Claudette Lali. After they split, Anthony married former Miss Universe Dayanara Torres in 2000. Together, they have two sons. After a briefly separating and reconciling in 2002, the couple divorced in January 2004.\n\nIn June 2004, Anthony married singer Jennifer Lopez, and she gave birth to their twins Emme and Maximillian in February 2008. Anthony and Lopez separated in 2011, and finalized their divorce in June 2014. In November 2014, Anthony married model Shannon de Lima in the Dominican Republic. They separated in November 2016, and finalized their divorce in 2017.\n\nReal Estate\n\nIn July 2018, Anthony purchased a $19 million mansion in Florida. The seller was rum heiress Hilda Maria Bacardi who built the mansion and at one point was hoping to fetch $25 million.\n\nIn November 2020, Marc listed this home for sale for $27 million. Marc didn't do anything to the house, so if he got asking price, he would earn an $8 million profit for two years of ownership. He sold the house in May 2021, the price has not been reported as of this writing:\n\nHe previously owned a multi-million dollar property in Tarzana, California. He bought the Tarzana home for $4.125 million and sold it in 2018 for $3.2 million.\n\nOutside of Florida, Marc owns estates in Long Island, New York and the Dominican Republic. The Dominican Republic compound is located in a exclusive resort called Casa de Campo. The 10,000 square-foot home has two pools, multiple cabanas and can sleep 24.", "images": ["http://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://vz.cnwimg.com/wp-content/uploads/2009/12/Marc-Anthony.jpg", "https://vz.cnwimg.com/thumb-900x/wp-content/uploads/2009/12/ma.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2009/12/Marc-Anthony.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/mar-anthony-net-worth/", "title": "Marc Anthony Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Marc Anthony net worth: Marc Anthony is an American actor, singer, entrepreneur, and producer who has a net worth of $80 million. He is probably most widely recognized for his music career.", "cnw_share_fb_count": 123, "cnw_share_tw_count": 52, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Marc Anthony Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/mar-anthony-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2009/12/Marc-Anthony.jpg", "site_name": "Celebrity Net Worth", "description": "Marc Anthony net worth: Marc Anthony is an American actor, singer, entrepreneur, and producer who has a net worth of $80 million. He is probably most widely recognized for his music career."}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2022-05-13T18:12:04+00:00", "published_time": "2020-05-21T03:47:09+00:00", "section": "Actors", "tag": "richest singers"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2009/12/Marc-Anthony.jpg", "title": "Marc Anthony Net Worth", "description": "Marc Anthony net worth: Marc Anthony is an American actor, singer, entrepreneur, and producer who has a net worth of $80 million. He is probably most widely recognized for his music career."}}, "movies": ["https://www.youtube.com/embed/4UOdbCpLo6w"], "publish_date": 1590032829.0, "source": "http://www.celebritynetworth.com", "summary": ""}