{"url": "https://www.usatoday.com/story/tech/reviewedcom/2018/11/26/10-most-popular-deals-cyber-monday-and-black-friday-2018-amazon-echos-ancestry-dna-instant-pots-and/2113525002/", "text": "10 amazing Cyber Monday 2018 deals everyone is obsessing over\n\n— Our editors review and recommend products to help you buy the stuff you need. If you make a purchase by clicking one of our links, we may earn a small share of the revenue. However, our picks and opinions are independent from USA TODAY’s newsroom and any business incentives.\n\nThe Thanksgiving leftovers are dwindling and Black Friday is behind us, but Cyber Monday is just around the corner. And retailers are not holding back on the deals and discounts during \"Cyber Weekend\" either. We've been keeping a close eye on the latest Black Friday and Cyber Monday deals to help you find the best of the best.\n\nBetween making sure the best deals are still available and looking for leads on new amazing offers, we got a little curious about what everyone's snapping up in this four-day savings extravaganza. So we took a peek behind the curtain to find out, and these are the most popular Black Friday deals so far that are still available:\n\n1. The new Echo Dot—52% off\n\nUPDATE: The sale price has changed to $29.99, but $20 off the popular, new Dot is still an amazing deal.\n\nThe Dot has always been popular because it gives you all the power of Alexa for way less than Amazon's other smart speakers. At its usual $50, it's a great deal, but the fact that it's just more than half off is just stunning.\n\nI don't think Amazon's ever offers such a steep discount on a new device, so it makes sense why everyone's buying them. The older model is on sale for $20 too (50% off), but I beg you. Spend the extra $4 to get the better speakers of the new model. It's so worth it.\n\nGet the Echo Dot (3rd gen.) at Amazon—$24 (Save $25.99)\n\n2. The best-selling DNA testing kit—50% off\n\nAncestry DNA Testing Kit—$49 from Ancestry.com (Save $50)\n\n3. The best sous vide cooker—31% off\n\nSous vide is an amazing way to cook, and the best sous vide cooker we've ever tested is on sale for only $89. It used to sell for $180, so this is a crazy good deal. I was intimidated by sous vide when I first started cooking that way, but I swear it's even easier than you can imagine. And for this price, maybe it's time you find out for yourself—it's also a great gift for anyone who loves cooking!\n\nGet the Anova Sous Vide Immersion Circulator for $89 (Save $40)\n\n4. Ulta's Black Friday sale—Nearly everything on sale\n\nUPDATE: This sale is over :(\n\nAll the top beauty retailers are having Black Friday and Cyber Monday sales right now. But Ulta is leading the charge when it comes to the best deals, with massive savings on gift sets (hello, stocking stuffers), beauty tools, makeup, and more. If you spend at least $60, you'll even get a free 9-piece gift set. Are you kidding me? Take all my money, Ulta!\n\nShop the Ulta Black Friday sale\n\n5. The most popular Instant Pot—30% off\n\nI'm pretty confident that the Instant Pot is the new KitchenAid stand mixer when it comes to \"impressive kitchen gifts.\" Every time the $100 Instant Pot goes on sale, people lose their minds. And for Black Friday and Cyber Monday this year, it's been on sale for $70 at Amazon and Target, and we're amazed it hasn't gone out of stock yet.\n\n6. Ecovacs Deebot N79W—25% off\n\nUPDATE: This robot vacuum is no longer on sale. :(\n\nThis is one of our favorite smart robot vacuums, especially because it's so affordable. It has stronger suction than its predecessor, can be controlled through an app, and is Alexa compatible. You can also get it at Best Buy for the same price.\n\n7. Apple Watch Series 3—26% off\n\nUPDATE: the GPS-only version is no longer on sale, but the GPS+Cellular version is still discounted at B&H!\n\nIf you use an iPhone and want a smartwatch, the Apple Watch is your best bet. This Series 3 Apple Watch doesn't have cellular, so it won't stay connected if you leave your phone at home on a run. But it does have GPS, so you can still track your course (and it's $200 cheaper than the cellular version).\n\nApple Watch Series 3 Stainless Steel (42mm, GPS)—$229.99 (Save $80)\n\nWant to live untethered? B&H has the cellular model for $429.99 (Save $200), and it's available in Carnation pink, Marina Blue, and Blacktop/Flash.\n\n8. Playstation Plus 12-Month Membership—33% off\n\nSony really came out swinging with Black Friday deals. The PS4 Spider-Man bundle that launched on Wednesday has been sold out since before most turkeys were even out of the oven. But that hasn't stopped PlayStation fanatics from raking in savings. In addition to discounts on popular games like Assassin's Creed Odyssey, NBA 2K19, and Fallout: 76, their Plus memberships are a third less than usual.\n\nWith PS Plus, you get discounts on games purchased through the PlayStation store, and you also get three free game downloads. Every. Single. Month. And they're for good titles too, not just garbage no one was buying anyway. If you buy three, you'll get a fourth year for free.\n\nPlayStation Plus 12-Month Membership (Digital Code)—$39.99 (Save $20)*\n\n*You can also find this deal right in the PS Store!\n\n9. L.L. Bean—20% off sitewide\n\nUPDATE: The sitewide sale is over, but you can still get 20% off clothing and outerwear with the code \"THANKS20\"\n\nThe popular apparel and outdoor store had a massive Bean Boot sale on Black Friday that everyone went nuts over. And now for Cyber Monday, they've got a sitewide sale that is to die for. If you use the code \"THANKS20,\" you'll get 20% off your entire purchase.\n\nBut they didn't stop there. If you spend at least $50, you'll get a $10 gift card (stocking stuffer, anyone?). And if you want a new pair of slippers (or you know someone who would shed tears of joy to be gifted a new pair) their insanely comfortable slippers are 25% off with the code \"WICKED.\"\n\nShop the L.L. Bean Weekend Sale\n\n10. The best TV of 2018—23% off\n\nWhen our expert, who's been reviewing all kinds of TVs for over six years, says this one is better than all the others, you can trust it. This massive 55-inch OLED 4K TV usually goes for $2,200, but has been dropping little by little since September, and right now it's at its lowest price outside of the occasional Massdrop sale (and it's available with Prime shipping). The 65-inch is $400 off right now too, marking its lowest Amazon price.\n\nLG C8 55-In. OLED Smart 4K TV—$1,696.99 on Amazon (Save $500)\n\nReviewed.com has you covered through the shopping madness, researching endlessly to find you the best Black Friday and Cyber Monday deals. For the latest updates on all our coverage, be sure to follow Reviewed on Facebook, Twitter, and Instagram.\n\n\n\nPrices are accurate at the time this article was published, but may change over time.", "images": ["https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png", "https://www.gannett-cdn.com/presto/2018/11/26/USAT/89b6ba55-6c73-4f68-b1e6-173528ffd227-favecybermondaysale.jpg?auto=webp&crop=783,440,x0,y0&format=pjpg&width=1200", "https://www.gannett-cdn.com/presto/2018/11/26/USAT/89b6ba55-6c73-4f68-b1e6-173528ffd227-favecybermondaysale.jpg?crop=588,440,x179,y0?width=320&height=240"], "top_img": "https://www.gannett-cdn.com/presto/2018/11/26/USAT/89b6ba55-6c73-4f68-b1e6-173528ffd227-favecybermondaysale.jpg?auto=webp&crop=783,440,x0,y0&format=pjpg&width=1200", "keywords": [], "authors": ["Samantha Gordon"], "canonical_link": "https://www.usatoday.com/story/tech/reviewedcom/2018/11/26/10-most-popular-deals-cyber-monday-and-black-friday-2018-amazon-echos-ancestry-dna-instant-pots-and/2113525002/", "title": "10 amazing Cyber Monday 2018 deals everyone is obsessing over", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/tech/reviewedcom/2018/11/26/10-most-popular-deals-cyber-monday-and-black-friday-2018-amazon-echos-ancestry-dna-instant-pots-and/2113525002/tech/reviewedcom", "theme-color": "#ffffff", "og": {"type": "article", "title": "10 amazing Cyber Monday 2018 deals everyone is obsessing over", "description": "Cyber Monday's deals are insane, and these are the ones everyone is buying.", "image": {"identifier": "https://www.gannett-cdn.com/presto/2018/11/26/USAT/89b6ba55-6c73-4f68-b1e6-173528ffd227-favecybermondaysale.jpg?auto=webp&crop=783,440,x0,y0&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "Cyber Monday's deals are insane, and these are the ones everyone is buying.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1543190400.0, "source": "https://www.usatoday.com", "summary": ""}