{"url": "https://www.thewrap.com/joss-whedon-feminist-hypocrite-infidelity-affairs-ex-wife-kai-cole-says/", "text": "I’ve been asked some questions by the press recently about my divorce from Joss Whedon, to whom I was married for 16 years. There is misinformation out there and I feel the best way to clear up the situation is to tell my truth. Let me begin by saying I am a very private person and the act of writing this is antithetical to who I am and everything I stand for. Yet, at the same time, I feel compelled to go on the record and clear up some misperceptions. I don’t think it is fair to me or other women to remain silent any longer.\n\nI met Joss in 1991. I was driving across the country from Massachusetts on a whim, and met him when I was passing through Los Angeles. We fell in love and I moved to L.A. so we could be together.\n\nI was with him when his “Buffy the Vampire Slayer” script was adapted, and the resulting movie released. It was painful to see how his vision was interpreted by the production team and on our honeymoon to England in 1995, I urged him to figure out how to turn it into a TV show. He didn’t want to work in television anymore, following in his father’s and grandfather’s footsteps, but I convinced him it was the fastest way to get the experience he needed, so he could direct his own films someday. I had no idea, in that lovely garden in Bath, that it would change everything.\n\nAlso Read: Joss Whedon Fan Site Shuts Down After Ex-Wife's Explosive Essay\n\nThere were times in our relationship that I was uncomfortable with the attention Joss paid other women. He always had a lot of female friends, but he told me it was because his mother raised him as a feminist, so he just liked women better. He said he admired and respected females, he didn’t lust after them. I believed him and trusted him. On the set of “Buffy,” Joss decided to have his first secret affair.\n\nFifteen years later, when he was done with our marriage and finally ready to tell the truth, he wrote me, “When I was running ‘Buffy,’ I was surrounded by beautiful, needy, aggressive young women. It felt like I had a disease, like something from a Greek myth. Suddenly I am a powerful producer and the world is laid out at my feet and I can’t touch it.” But he did touch it. He said he understood, “I would have to lie — or conceal some part of the truth — for the rest of my life,” but he did it anyway, hoping that first affair, “would be ENOUGH, that THEN we could move on and outlast it.”\n\nJoss admitted that for the next decade and a half, he hid multiple affairs and a number of inappropriate emotional ones that he had with his actresses, co-workers, fans and friends, while he stayed married to me. He wrote me a letter when our marriage was falling apart, but I still didn’t know the whole truth, and said, “I’ve never loved anyone or wanted to be with anyone in any real or long-term way except for you ever. And I love our life. I love how you are, how we are, who you are and what we’ve done both separately and together, how much fun we have…” He wanted it all; he didn’t want to choose, so he accepted the duality as a part of his life.\n\nAlso Read: Joss Whedon's Planned Parenthood PSA Paints Grim Picture (Video)\n\nThen later, after he confessed everything, he told me, “I let myself love you. I stopped worrying about the contradiction. As a guilty man I knew the only way to hide was to act as though I were righteous. And as a husband, I wanted to be with you like we had been. I lived two lives.” When he walked out of our marriage, and was trying to make “things seem less bewildering” to help me understand how he could have lied to me for so long, he said, “In many ways I was the HEIGHT of normal, in this culture. We’re taught to be providers and companions and at the same time, to conquer and acquire — specifically sexually — and I was pulling off both!”\n\nAlso Read: 'Justice League:' Zack Snyder Steps Down as Director After Family Tragedy, Joss Whedon to Take Over\n\nDespite understanding, on some level, that what he was doing was wrong, he never conceded the hypocrisy of being out in the world preaching feminist ideals, while at the same time, taking away my right to make choices for my life and my body based on the truth. He deceived me for 15 years, so he could have everything he wanted. I believed, everyone believed, that he was one of the good guys, committed to fighting for women’s rights, committed to our marriage, and to the women he worked with. But I now see how he used his relationship with me as a shield, both during and after our marriage, so no one would question his relationships with other women or scrutinize his writing as anything other than feminist.\n\nI thought we were a couple, a team. I was a powerful influence on the career choices Joss made during the 20 years we were together (we lived together for four years before marrying). I kept him grounded, and helped him find the quickest way to the success he so deeply craved. I loved him. And in return, he lied to me. A lot. He said, after he left, he understood: “It’s not just like I killed you, but that I’d done it subtly, over years. That I’d been poisoning you. Chipping away at you.” He made me doubt my own instincts and watched me move further away from my personal values and social mores, trying to connect with him, never telling me it was impossible. By the time he finally confessed the truth, 15 years after his first affair on the set of “Buffy,” I was broken. My brain could not fit my experience of our life together, through the new lens of his deceit.\n\nAlso Read: 'Avengers' Director Joss Whedon Fears US Will Start Killing Gays\n\nMy entire reality changed overnight, and I went from being a strong, confident woman, to a confused, frightened mess. I was eventually diagnosed with Complex PTSD and for the last five years, I have worked hard to make sense of everything that happened and find my balance again. It has not been easy, because even though in my personal life I have been completely open about what happened, publicly people only know his superficial presentation of us: him as the lovable geek-feminist and me in the background, as his wife and supporter.\n\nWe’re finally divorced; I’m doing architecture again, and slowly getting my life and self-esteem back.\n\nUntil recently, Joss was still letting the illusion of our marriage stay intact. Now that it is finally public, I want to let women know that he is not who he pretends to be. I want the people who worship him to know he is human, and the organizations giving him awards for his feminist work, to think twice in the future about honoring a man who does not practice what he preaches. But no matter what happens, or how people interpret this statement, I no longer have to carry the burden of Joss’ long-term deceit and confessions. I am free.\n\nEditor’s Note: A spokesperson for Joss Whedon provided the following response, “While this account includes inaccuracies and misrepresentations which can be harmful to their family, Joss is not commenting, out of concern for his children and out of respect for his ex-wife.”", "images": ["https://www.thewrap.com/wp-content/uploads/2016/09/hollywood-splits.jpg", "https://www.thewrap.com/wp-content/uploads/2022/08/break-2-150x150.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/tw_red.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/popup/logo-signup2.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/newsletter-filled.svg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/mobile/account.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/ig_red.png", "https://www.thewrap.com/wp-content/uploads/2022/08/bert-fields-Donald-Trump1-150x150.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/mobile/gopro.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/mobile/search.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/hollyblog_ph.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/mobile/login.png", "https://www.thewrap.com/wp-content/uploads/2022/05/thewrap-film-slate.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/yt_red.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/all-white-logo.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/mobile/newsletter.png", "https://www.thewrap.com/wp-content/uploads/2022/08/0815_TheWrap_Cover_768x922px.jpg", "https://www.thewrap.com/wp-content/uploads/2017/08/Joss-Whedon.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/mobile/mobile-footer-promotion.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/fb_red.png", "https://www.thewrap.com/wp-content/uploads/2022/05/First-Take-Logo_Small.png", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo-black.svg", "https://www.thewrap.com/wp-content/plugins/contextual-links/assets/img/loading.gif", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/wrappro/arw-rt.png", "https://www.thewrap.com/wp-content/uploads/2022/05/First-Take-Logo-Stacked.png", "https://www.thewrap.com/wp-content/uploads/2022/05/Image-2022-04-26-at-3.00.43-PM-300x81.png", "https://www.thewrap.com/wp-content/uploads/2017/08/kai-1.jpg", "https://www.thewrap.com/wp-content/uploads/2022/09/lucy-150x150.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/logo-dark.png", "https://www.thewrap.com/wp-content/uploads/2017/08/kai.jpg", "https://www.thewrap.com/wp-content/themes/thewrap-canvas/imgs/thewrap-logo-alt.svg"], "top_img": "https://www.thewrap.com/wp-content/uploads/2017/08/Joss-Whedon.jpg", "keywords": [], "authors": ["Wrap Staff", "Kai Cole", "Mary Murphy", "Michele Willens", "Valerie Van Galder", "Bert Fields"], "canonical_link": "https://www.thewrap.com/joss-whedon-feminist-hypocrite-infidelity-affairs-ex-wife-kai-cole-says/", "title": "Joss Whedon Is a ‘Hypocrite Preaching Feminist Ideals,’ Ex-Wife Kai Cole Says (Guest Blog)", "meta_data": {"viewport": "initial-scale=1.0, maximum-scale=6.0, user-scalable=yes", "msapplication-TileColor": "#f9f9f9", "theme-color": "#ffffff", "parsely-title": "Joss Whedon Is a ‘Hypocrite Preaching Feminist Ideals,’ Ex-Wife Kai Cole Says (Guest Blog)", "parsely-link": "https://www.thewrap.com/joss-whedon-feminist-hypocrite-infidelity-affairs-ex-wife-kai-cole-says/", "parsely-type": "post", "parsely-pub-date": "2017-08-20T12:05:11-07:00", "parsely-section": "category-hollyblog", "parsely-author": "Wrap Staff", "parsely-tags": "buffy_the_vampire_slayer, joss_whedon, kai-cole, vintage", "pubexchange": {"image": "https://www.thewrap.com/wp-content/uploads/2017/08/Joss-Whedon-160x105.jpg"}, "description": "\"He used his relationship with me as a shield ... so no one would question his relationships with other women or scrutinize his writing as anything other than feminist,\" she writes", "robots": "follow, index, max-snippet:-1, max-video-preview:-1, max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Joss Whedon Is a 'Hypocrite Preaching Feminist Ideals,' Ex-Wife Kai Cole Says (Guest Blog)", "description": "\"He used his relationship with me as a shield ... so no one would question his relationships with other women or scrutinize his writing as anything other than feminist,\" she writes", "url": "https://www.thewrap.com/joss-whedon-feminist-hypocrite-infidelity-affairs-ex-wife-kai-cole-says/", "site_name": "TheWrap", "updated_time": "2017-11-22T12:30:16-08:00", "image": {"identifier": "https://www.thewrap.com/wp-content/uploads/2017/08/Joss-Whedon.jpg", "secure_url": "https://www.thewrap.com/wp-content/uploads/2017/08/Joss-Whedon.jpg", "width": 618, "height": 412, "alt": "joss whedon kai cole", "type": "image/jpeg"}}, "article": {"publisher": "https://facebook.com/thewrap", "author": "https://www.facebook.com/thewrap/", "tag": "Vintage", "section": "Business", "published_time": "2017-08-20T12:05:11-07:00", "modified_time": "2017-11-22T12:30:16-08:00"}, "fb": {"app_id": 228236404181023, "pages": 48941893663}, "twitter": {"card": "summary_large_image", "title": "Joss Whedon Is a 'Hypocrite Preaching Feminist Ideals,' Ex-Wife Kai Cole Says (Guest Blog)", "description": "\"He used his relationship with me as a shield ... so no one would question his relationships with other women or scrutinize his writing as anything other than feminist,\" she writes", "site": "@thewrap", "creator": "@thewrap", "image": "https://www.thewrap.com/wp-content/uploads/2017/08/Joss-Whedon.jpg", "label1": "Written by", "data1": "Wrap Staff", "label2": "Time to read", "data2": "6 minutes"}, "generator": "WooFramework 6.2.0", "BridPlugin": "oauth_token:01110011 01100101 01100011 01110010 01100101 01110100|ver:3.2.2|site:16228|widget:1|disable_video_autosave:|channels:Array|width:640|height:360|autoplay:0|aspect:1|user_id:17159|default_channel:18|ovr_def:1|async_embed:1|google_seo:1|raw_embed:1|unit:13381|unit_width:480|unit_height:270|player:21259|video_image:|onready:", "addsearch-custom-field": "conditional_tag=is_singular", "google-site-verification": "-PpFSIrGHybVDxbndrL6MCngw3j6BXdy0xDVBVVOacI"}, "movies": [], "publish_date": 1503255911.0, "source": "https://www.thewrap.com", "summary": ""}