{"url": "http://nobelprize.org/nobel_prizes/peace/laureates/", "text": "The Nobel Peace Prize has been awarded 103 times to 140 Nobel Prize laureates between 1901 and 2022, 110 individuals and 30 organizations. Since the International Committee of the Red Cross has been awarded the Nobel Peace Prize three times (in 1917, 1944 and 1963), and the Office of the United Nations High Commissioner for Refugees has been awarded the Nobel Peace Prize two times (in 1954 and 1981), there are 27 individual organizations which have been awarded the Nobel Peace Prize. Click on the links to get more information.\n\nThe 2022 Peace Prize is awarded to human rights advocate Ales Bialiatski from Belarus, the Russian human rights organisation Memorial and the Ukrainian human rights organisation Center for Civil Liberties. The Peace Prize laureates represent civil society in their home countries. They have for many years promoted the right to criticise power and protect the fundamental rights of citizens. They have made an outstanding effort to document war crimes, human right abuses and the abuse of power. Together they demonstrate the significance of civil society for peace and democracy.\n\nMaria Ressa and Dmitry Andreyevich Muratov “for their efforts to safeguard freedom of expression, which is a precondition for democracy and lasting peace”\n\nWorld Food Programme (WFP) “for its efforts to combat hunger, for its contribution to bettering conditions for peace in conflict-affected areas and for acting as a driving force in efforts to prevent the use of hunger as a weapon of war and conflict”\n\nThe Nobel Peace Prize 2019 Abiy Ahmed Ali “for his efforts to achieve peace and international cooperation, and in particular for his decisive initiative to resolve the border conflict with neighbouring Eritrea”\n\nThe Nobel Peace Prize 2018 Denis Mukwege and Nadia Murad “for their efforts to end the use of sexual violence as a weapon of war and armed conflict”\n\nThe Nobel Peace Prize 2017 International Campaign to Abolish Nuclear Weapons (ICAN) “for its work to draw attention to the catastrophic humanitarian consequences of any use of nuclear weapons and for its ground-breaking efforts to achieve a treaty-based prohibition of such weapons”\n\nThe Nobel Peace Prize 2016 Juan Manuel Santos “for his resolute efforts to bring the country’s more than 50-year-long civil war to an end”\n\nThe Nobel Peace Prize 2015 National Dialogue Quartet “for its decisive contribution to the building of a pluralistic democracy in Tunisia in the wake of the Jasmine Revolution of 2011”\n\nThe Nobel Peace Prize 2014 Kailash Satyarthi and Malala Yousafzai “for their struggle against the suppression of children and young people and for the right of all children to education”\n\nThe Nobel Peace Prize 2012 European Union (EU) “for over six decades contributed to the advancement of peace and reconciliation, democracy and human rights in Europe”\n\nThe Nobel Peace Prize 2010 Liu Xiaobo “for his long and non-violent struggle for fundamental human rights in China”\n\nThe Nobel Peace Prize 2009 Barack H. Obama “for his extraordinary efforts to strengthen international diplomacy and cooperation between peoples”\n\nThe Nobel Peace Prize 2008 Martti Ahtisaari “for his important efforts, on several continents and over more than three decades, to resolve international conflicts”\n\nThe Nobel Peace Prize 2005 International Atomic Energy Agency (IAEA) and Mohamed ElBaradei “for their efforts to prevent nuclear energy from being used for military purposes and to ensure that nuclear energy for peaceful purposes is used in the safest possible way”\n\nThe Nobel Peace Prize 2003 Shirin Ebadi “for her efforts for democracy and human rights. She has focused especially on the struggle for the rights of women and children”\n\nThe Nobel Peace Prize 2002 Jimmy Carter “for his decades of untiring effort to find peaceful solutions to international conflicts, to advance democracy and human rights, and to promote economic and social development”\n\nThe Nobel Peace Prize 2000 Kim Dae-jung “for his work for democracy and human rights in South Korea and in East Asia in general, and for peace and reconciliation with North Korea in particular”\n\nThe Nobel Peace Prize 1999 Médecins Sans Frontières “in recognition of the organization’s pioneering humanitarian work on several continents”\n\nThe Nobel Peace Prize 1998 John Hume and David Trimble “for their efforts to find a peaceful solution to the conflict in Northern Ireland”\n\nThe Nobel Peace Prize 1993 Nelson Mandela and Frederik Willem de Klerk “for their work for the peaceful termination of the apartheid regime, and for laying the foundations for a new democratic South Africa”\n\nThe Nobel Peace Prize 1992 Rigoberta Menchú Tum “for her struggle for social justice and ethno-cultural reconciliation based on respect for the rights of indigenous peoples”\n\nThe Nobel Peace Prize 1990 Mikhail Sergeyevich Gorbachev “for the leading role he played in the radical changes in East-West relations”\n\nThe Nobel Peace Prize 1989 The 14th Dalai Lama (Tenzin Gyatso) “for advocating peaceful solutions based upon tolerance and mutual respect in order to preserve the historical and cultural heritage of his people”\n\nThe Nobel Peace Prize 1987 Oscar Arias Sánchez “for his work for lasting peace in Central America”\n\nThe Nobel Peace Prize 1986 Elie Wiesel “for being a messenger to mankind: his message is one of peace, atonement and dignity”\n\nThe Nobel Peace Prize 1985 International Physicians for the Prevention of Nuclear War “for spreading authoritative information and by creating awareness of the catastrophic consequences of nuclear war”\n\nThe Nobel Peace Prize 1984 Desmond Mpilo Tutu “for his role as a unifying leader figure in the non-violent campaign to resolve the problem of apartheid in South Africa”\n\nThe Nobel Peace Prize 1983 Lech Walesa “for non-violent struggle for free trade unions and human rights in Poland”\n\nThe Nobel Peace Prize 1980 Adolfo Pérez Esquivel “for being a source of inspiration to repressed people, especially in Latin America”\n\nThe Nobel Peace Prize 1979 Mother Teresa “for her work for bringing help to suffering humanity”\n\nThe Nobel Peace Prize 1976 Betty Williams and Mairead Corrigan “for the courageous efforts in founding a movement to put an end to the violent conflict in Northern Ireland”\n\nThe Nobel Peace Prize 1975 Andrei Dmitrievich Sakharov “for his struggle for human rights in the Soviet Union, for disarmament and cooperation between all nations”\n\nThe Nobel Peace Prize 1974 Seán MacBride “for his efforts to secure and develop human rights throughout the world” and Eisaku Sato “for his contribution to stabilize conditions in the Pacific rim area and for signing the Nuclear Non-Proliferation Treaty”\n\nThe Nobel Peace Prize 1972 No Nobel Prize was awarded this year. The prize money for 1972 was allocated to the Main Fund.\n\nThe Nobel Peace Prize 1971 Willy Brandt “for paving the way for a meaningful dialogue between East and West”\n\nThe Nobel Peace Prize 1969 International Labour Organization (I.L.O.) “for creating international legislation insuring certain norms for working conditions in every country”\n\nThe Nobel Peace Prize 1968 René Cassin “for his struggle to ensure the rights of man as stipulated in the UN Declaration”\n\nThe Nobel Peace Prize 1967 No Nobel Prize was awarded this year. The prize money was with 1/3 allocated to the Main Fund and with 2/3 to the Special Fund of this prize section.\n\nThe Nobel Peace Prize 1966 No Nobel Prize was awarded this year. The prize money was allocated to the Special Fund of this prize section.\n\nThe Nobel Peace Prize 1965 United Nations Children’s Fund (UNICEF) “for its effort to enhance solidarity between nations and reduce the difference between rich and poor states”\n\nThe Nobel Peace Prize 1962 Linus Carl Pauling “for his fight against the nuclear arms race between East and West”\n\nThe Nobel Peace Prize 1961 Dag Hammarskjöld “for developing the UN into an effective and constructive international organization, capable of giving life to the principles and aims expressed in the UN Charter”\n\nThe Nobel Peace Prize 1959 Philip J. Noel-Baker “for his longstanding contribution to the cause of disarmament and peace”\n\nThe Nobel Peace Prize 1958 Georges Pire “for his efforts to help refugees to leave their camps and return to a life of freedom and dignity”\n\nThe Nobel Peace Prize 1957 Lester Bowles Pearson “for his crucial contribution to the deployment of a United Nations Emergency Force in the wake of the Suez Crisis”\n\nThe Nobel Peace Prize 1956 No Nobel Prize was awarded this year. The prize money was with 1/3 allocated to the Main Fund and with 2/3 to the Special Fund of this prize section.\n\nThe Nobel Peace Prize 1955 No Nobel Prize was awarded this year. The prize money was allocated to the Special Fund of this prize section.\n\nThe Nobel Peace Prize 1954 Office of the United Nations High Commissioner for Refugees (UNHCR) “for its efforts to heal the wounds of war by providing help and protection to refugees all over the world”\n\nThe Nobel Peace Prize 1953 George Catlett Marshall “for proposing and supervising the plan for the economic recovery of Europe”\n\nThe Nobel Peace Prize 1952 Albert Schweitzer “for his altruism, reverence for life, and tireless humanitarian work which has helped making the idea of brotherhood between men and nations a living one”\n\nThe Nobel Peace Prize 1951 Léon Jouhaux “for having devoted his life to the fight against war through the promotion of social justice and brotherhood among men and nations”\n\nThe Nobel Peace Prize 1950 Ralph Bunche “for his work as mediator in Palestine in 1948-1949”\n\nThe Nobel Peace Prize 1949 Lord (John) Boyd Orr of Brechin “for his lifelong effort to conquer hunger and want, thereby helping to remove a major cause of military conflict and war”\n\nThe Nobel Peace Prize 1948 No Nobel Prize was awarded this year. The prize money was with 1/3 allocated to the Main Fund and with 2/3 to the Special Fund of this prize section.\n\nThe Nobel Peace Prize 1946 Emily Greene Balch “for her lifelong work for the cause of peace” and John Raleigh Mott “for his contribution to the creation of a peace-promoting religious brotherhood across national boundaries”\n\nThe Nobel Peace Prize 1945 Cordell Hull “for his indefatigable work for international understanding and his pivotal role in establishing the United Nations”\n\nThe Nobel Peace Prize 1943 No Nobel Prize was awarded this year. The prize money was with 1/3 allocated to the Main Fund and with 2/3 to the Special Fund of this prize section.\n\nThe Nobel Peace Prize 1942 No Nobel Prize was awarded this year. The prize money was with 1/3 allocated to the Main Fund and with 2/3 to the Special Fund of this prize section.\n\nThe Nobel Peace Prize 1941 No Nobel Prize was awarded this year. The prize money was with 1/3 allocated to the Main Fund and with 2/3 to the Special Fund of this prize section.\n\nThe Nobel Peace Prize 1940 No Nobel Prize was awarded this year. The prize money was with 1/3 allocated to the Main Fund and with 2/3 to the Special Fund of this prize section.\n\nThe Nobel Peace Prize 1939 No Nobel Prize was awarded this year. The prize money was with 1/3 allocated to the Main Fund and with 2/3 to the Special Fund of this prize section.\n\nThe Nobel Peace Prize 1936 Carlos Saavedra Lamas “for his role as father of the Argentine Antiwar Pact of 1933, which he also used as a means to mediate peace between Paraguay and Bolivia in 1935”\n\nThe Nobel Peace Prize 1935 Carl von Ossietzky “for his burning love for freedom of thought and expression and his valuable contribution to the cause of peace”\n\nThe Nobel Peace Prize 1934 Arthur Henderson “for his untiring struggle and his courageous efforts as Chairman of the League of Nations Disarmament Conference 1931-34”\n\nThe Nobel Peace Prize 1933 Sir Norman Angell (Ralph Lane) “for having exposed by his pen the illusion of war and presented a convincing plea for international cooperation and peace”\n\nThe Nobel Peace Prize 1932 No Nobel Prize was awarded this year. The prize money was allocated to the Special Fund of this prize section.\n\nThe Nobel Peace Prize 1931 Jane Addams and Nicholas Murray Butler “for their assiduous effort to revive the ideal of peace and to rekindle the spirit of peace in their own nation and in the whole of mankind”\n\nThe Nobel Peace Prize 1930 Lars Olof Jonathan (Nathan) Söderblom “for promoting Christian unity and helping create ‘that new attitude of mind which is necessary if peace between nations is to become reality'”\n\nThe Nobel Peace Prize 1929 Frank Billings Kellogg “for his crucial role in bringing about the Briand-Kellogg Pact”\n\nThe Nobel Peace Prize 1928 No Nobel Prize was awarded this year. The prize money was allocated to the Special Fund of this prize section.\n\nThe Nobel Peace Prize 1927 Ferdinand Buisson and Ludwig Quidde “for their contribution to the emergence in France and Germany of a public opinion which favours peaceful international cooperation”\n\nThe Nobel Peace Prize 1925 Sir Austen Chamberlain “for his crucial role in bringing about the Locarno Treaty” and Charles Gates Dawes “for his crucial role in bringing about the Dawes Plan”\n\nThe Nobel Peace Prize 1924 No Nobel Prize was awarded this year. The prize money was allocated to the Special Fund of this prize section.\n\nThe Nobel Peace Prize 1923 No Nobel Prize was awarded this year. The prize money was allocated to the Special Fund of this prize section.\n\nThe Nobel Peace Prize 1922 Fridtjof Nansen “for his leading role in the repatriation of prisoners of war, in international relief work and as the League of Nations’ High Commissioner for refugees”\n\nThe Nobel Peace Prize 1920 Léon Victor Auguste Bourgeois “for his longstanding contribution to the cause of peace and justice and his prominent role in the establishment of the League of Nations”\n\nThe Nobel Peace Prize 1919 Thomas Woodrow Wilson “for his role as founder of the League of Nations”\n\nThe Nobel Peace Prize 1918 No Nobel Prize was awarded this year. The prize money was allocated to the Special Fund of this prize section.\n\nThe Nobel Peace Prize 1916 No Nobel Prize was awarded this year. The prize money was allocated to the Special Fund of this prize section.\n\nThe Nobel Peace Prize 1915 No Nobel Prize was awarded this year. The prize money was allocated to the Special Fund of this prize section.\n\nThe Nobel Peace Prize 1914 No Nobel Prize was awarded this year. The prize money was allocated to the Special Fund of this prize section.\n\nThe Nobel Peace Prize 1913 Henri La Fontaine “for his unparalleled contribution to the organization of peaceful internationalism”\n\nThe Nobel Peace Prize 1912 Elihu Root “for bringing about better understanding between the countries of North and South America and initiating important arbitration agreements between the United States and other countries”\n\nThe Nobel Peace Prize 1911 Tobias Michael Carel Asser “for his role as co-founder of the Institut de droit international, initiator of the Conferences on International Private Law (Conférences de Droit international privé) at the Hague, and pioneer in the field of international legal relations” and Alfred Hermann Fried “for his effort to expose and fight what he considers to be the main cause of war, namely, the anarchy in international relations”\n\nThe Nobel Peace Prize 1910 Bureau international permanent de la Paix (Permanent International Peace Bureau) “for acting as a link between the peace societies of the various countries, and helping them to organize the world rallies of the international peace movement”\n\nThe Nobel Peace Prize 1908 Klas Pontus Arnoldson and Fredrik Bajer “for their long time work for the cause of peace as politicians, peace society leaders, orators and authors”\n\nThe Nobel Peace Prize 1907 Ernesto Teodoro Moneta “for his work in the press and in peace meetings, both public and private, for an understanding between France and Italy” and Louis Renault “for his decisive influence upon the conduct and outcome of the Hague and Geneva Conferences”\n\nThe Nobel Peace Prize 1906 Theodore Roosevelt “for his role in bringing to an end the bloody war recently waged between two of the world’s great powers, Japan and Russia”\n\nThe Nobel Peace Prize 1904 Institut de droit international (Institute of International Law) “for its striving in public law to develop peaceful ties between nations and to make the laws of war more humane”\n\nThe Nobel Peace Prize 1903 William Randal Cremer “for his longstanding and devoted effort in favour of the ideas of peace and arbitration”\n\nThe Nobel Peace Prize 1902 Élie Ducommun “for his untiring and skilful directorship of the Bern Peace Bureau” and Charles Albert Gobat “for his eminently practical administration of the Inter-Parliamentary Union”", "images": ["https://www.nobelprize.org/uploads/2018/09/New-will-fullsize-496x328.jpg"], "top_img": "https://www.nobelprize.org/uploads/2018/09/New-will-fullsize-496x328.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.nobelprize.org/prizes/lists/all-nobel-peace-prizes", "title": "NobelPrize.org", "meta_data": {"viewport": "width=device-width, initial-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "website", "site_name": "NobelPrize.org", "title": "All Nobel Peace Prizes", "description": "All Nobel Peace Prizes", "image": "https://www.nobelprize.org/uploads/2018/09/New-will-fullsize-496x328.jpg", "url": "https://www.nobelprize.org/prizes/lists/all-nobel-peace-prizes"}, "twitter": {"card": "summary_large_image", "title": "All Nobel Peace Prizes", "description": "All Nobel Peace Prizes", "image": "https://www.nobelprize.org/uploads/2018/09/New-will-fullsize-496x328.jpg"}, "tec-api-version": "v1", "tec-api-origin": "https://www.nobelprize.org", "msapplication-TileImage": "https://www.nobelprize.org/uploads/2018/08/Nobel-favicon.png"}, "movies": [], "publish_date": null, "source": "http://nobelprize.org", "summary": ""}