{"url": "https://www.hollywoodreporter.com/news/transparent-star-alleges-jeffrey-tambor-sexually-harassed-her-got-physical-1059306", "text": "In the second season of Transparent, the groundbreaking Amazon series that traces one father’s journey to womanhood, Maura Pfefferman — played by Jeffrey Tambor, in a role that has won him two Emmys — struggles to find the right inflection for the popular queer catchphrase, “Yas queen.”\n\nHer teacher is Shea — played by Trace Lysette — a yoga teacher and sometimes stripper, who steps in to show her fellow transgender, a newbie, the ropes.\n\nThe moment, which went viral shortly after the season debuted in November 2015, plays out as sweet, hilarious and authentic. But Lysette now says the circumstances around its filming were anything but.\n\nAccording to Lysette, when she emerged from wardrobe in her costume — a salmon-colored lingerie top and matching short-shorts — Tambor remarked, “My God, Trace. I want to attack you sexually.” Alexandra Billings, the third actor in the scene, was present to hear the remark, she confirms. Both “laughed it off because it was so absurd,” Lysette says.\n\nA few minutes later, while waiting for a camera setup between takes, Lysette was standing in a corner of the soundstage set. That’s when she says Tambor, dressed as Maura, wearing a green satin kimono and gray wig, approached her.\n\n“He came in close, put his bare feet on top of mine so I could not move, leaned his body against me, and began quick, discreet thrust back and forth against my body. I felt his penis on my hip through his thin pajamas,” Lysette says.\n\nLysette pushed Tambor away and “rolled my eyes.” Billings was not present for this alleged incident, and several crewmembers were nearby “but they were focused on their jobs. It was discreet. If you were behind Jeffrey you might have thought he was giving me a hug.”\n\nThe actress, who is transgender, is the second on the Transparent payroll to come forward with allegations that Tambor, 73, has subjected them to sexual harassment, sexual assault and generally abusive behavior on the set of the critically adored series.\n\nThe first accuser, Van Barnes, is a trans woman who worked as Tambor’s personal assistant, and whose allegations have led to an internal investigation by Amazon Studios. She has previously appeared on E!’s I Am Cait.\n\nAccording to Barnes’ lawyer Alana Chazan, her client signed a nondisclosure agreement while working for Tambor and therefore could not comment on Lysette’s claims. Nor would Barnes detail what workplace abuses she allegedly suffered at Tambor’s hands — accusations which were made in a private Facebook post that had leaked and circulated within Hollywood transgender circles.\n\nA copy of that Facebook post was obtained by The Hollywood Reporter. In it, Barnes, without directly naming Tambor, vents about an employer who made comments like “I should be sleeping with him if I want a Hollywood industry appropriate pay grade” and “it wouldn’t take long, he pops quick.” She says the employer subjected her to “butt pats,” pornography played at loud volumes, and complaints that she “was useless, could do nothing right.”\n\n“Despite having made no public statements to date, the disclosure of Van Barnes’ identity by the press has already led to Ms. Barnes receiving numerous threats and harassment online,” Chazan says. “Ms. Barnes is cooperating with the investigation being conducted by Amazon and will not be making a statement while the investigation is pending.”\n\nLysette shared a house with Barnes while Barnes worked as Tambor’s assistant. “She would pick him up in the morning and bring him home at night and everything in between,” Lysette recalls. “She would come home wrecked and stressed. I saw him break her down. She for the most part kept it to herself. She was just like, ‘Girl, he is a piece of work. If you only knew what I’m going through.’ But I knew.”\n\nFor Lysette, an acting neophyte who came to Hollywood directly from New York City, where she worked as a dancer, Tambor’s attentions began early and innocently enough.\n\nShe describes a moment in her first season on the show, a scene set in a yoga studio, when she had trouble finding her mark. “Jeffrey stepped in and said, ‘Come on, that’s hard. I couldn’t even do that.’ And then he and the [director of photography] had a little back and forth. He was sticking up for me.”\n\nWhen the exchange was over, Tambor approached Lysette and “kissed me on the forehead and was like, ‘Are you good?’ I said, ‘Yeah, I’m fine.’ It started with things like that. Telling me I looked great, things like that.”\n\nAs Lysette began to step into the spotlight and enjoy her first tastes of fame, she recalls running into Tambor at red carpet events, where she “would go to hug him and kiss him on the cheek — and it would land on my lips. And I was like, ‘OK. What was that about?'”\n\nShe says it wasn’t until the filming of the “yas queen” scene and the alleged physical assault that she was certain she was being targeted and sexually harassed by Tambor. From that moment on, she says life on the set with the actor “has been a roller coaster. One minute Jeffrey is lovely, the next it’s a temper tantrum or flirtation.”\n\nLysette describes another moment “that sticks in my brain” from later in production of season two: Tambor had set up a meeting between Lysette and his manager for potential representation.\n\nLysette thanked Tambor for the gesture, she says, “and he said, ‘Well, yeah Trace. I really believe in you. And you know what? I don’t even want to have sex with you.’ And then he just looked at me as if he very much indeed wanted to have sex with me. It was an up-and-down look. I rolled my eyes and went to my trailer and thought, ‘This man is something else.'”\n\nBoth Lysette and Barnes say they approached Transparent producers with their complaints about Tambor, but no action was taken.\n\nTambor issued this statement to THR in response to Lysette’s allegations:\n\nFor the past four years, I’ve had the huge privilege — and huge responsibility — of playing Maura Pfefferman, a transgender woman, in a show that I know has had an enormous, positive impact on a community that has been too long dismissed and misunderstood. Now I find myself accused of behavior that any civilized person would condemn unreservedly. I know I haven’t always been the easiest person to work with. I can be volatile and ill-tempered, and too often I express my opinions harshly and without tact. But I have never been a predator — ever. I am deeply sorry if any action of mine was ever misinterpreted by anyone as being sexually aggressive or if I ever offended or hurt anyone. But the fact is, for all my flaws, I am not a predator and the idea that someone might see me in that way is more distressing than I can express.\n\nAn Amazon spokesperson says, “This information will be added to our ongoing conversation.”\n\nLysette issued this statement to THR:\n\nLast week, it was reported in the media that Van Barnes, who previously worked as Jeffrey Tambor’s assistant while shooting Transparent, had privately spoken out on her social media about her experiences of abuse. Sadly, I must add my voice to the chorus. Jeffrey has acted inappropriate to me too.\n\nJeffrey has made many sexual advances and comments at me, but one time it got physical.\n\nOne day on set during Season 2, Jeffrey, Alexandra Billings and I were all outfitted in pajamas. I was in a flimsy top and matching short shorts. Upon seeing my in my costume, Jeffrey sexualized me with an over the top comment. Alexandra and I laughed it off because it was so absurd and we thought surely it had to be a bad joke. I shook it off. Then later, in between takes, I stood in a corner on the set as the crew reset for a wide shot. My back was against the wall in a corner as Jeffrey approached me. He came in close, put his bare feet on top of mine so I could not move, leaned his body against me, and began quick, discreet thrusts back and forth against my body. I felt his penis on my hip through his thin pajamas and I pushed him off of me. Again, I laughed it off and rolled my eyes. I had a job to do and I had to do it with Jeffrey, the lead of our show. When they called action, I put that moment in the corner into its own corner of my mind. Compartmentalizing has always been part of my survival took kit, long before I came to Hollywood. It’s shitty to admit out loud — and I don’t say it to justify what I went through — but given the journey and circumstances of my life, I was used to being treated as a sexual object by men — this one just happened to be famous.\n\nDespite multiple uncomfortable experiences with Jeffrey, it has been an incredible, career-solidifying honor to bring life to my character Shea on Amazon’s Transparent. Working on the award-winning series as a low-income trans woman with active roots in New York’s ball culture is a rare opportunity most of my sisters are not given.\n\nMy hope is that Amazon can find the good in this, and use this as an opportunity, a teachable moment to re-center the other trans characters in this show with the family members instead of just pulling it. Let our brilliant writers continue to craft something that is entertaining and creates a social change the way they know how. Don’t let the trans community suffer for the actions of one cis male actor. Transparent has been a guiding light in the industry, by employing more trans people in Hollywood than any other production in history, which made it even more difficult to speak out. As trans-women and survivors we have often felt we never had the power of the voice to speak out on our personal and collective pain. I am so proud of my work on Transparent and its “trans-affirmative action” mission, as coined by its creator Jill Soloway. And I call on Amazon to make another bold affirmative move to our communities: Remove the problem and let the show go on. It’s vital that the show’s creator, showrunner and its studio re-center the narrative of Transparent on the experiences of the other trans characters and family members audiences have grown to love on the series.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/11/trace_lysette_and_jeffrey_tambor__split.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/trace_lysette_and_jeffrey_tambor__split.jpg?w=1296&h=730&crop=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/trace_lysette_and_jeffrey_tambor__split.jpg?w=1024", "keywords": [], "authors": ["Seth Abramovitch"], "canonical_link": "https://www.hollywoodreporter.com/news/general-news/transparent-star-alleges-jeffrey-tambor-sexually-harassed-her-got-physical-1059306/", "title": "‘Transparent’ Star Alleges Jeffrey Tambor Sexually Harassed Her, “Got Physical”", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Trace Lysette, who plays yoga instructor Shea on the series, is the second accuser to allege misconduct by the show's star; Amazon says the new information \"will be added to our ongoing investigation.\"", "news_keywords": "Amazon Studios, autoplay, Harassment in Hollywood, Jeffrey Tambor, nsfs, THRX, Transparent", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Seth Abramovitch", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1059306, "title": "'Transparent' Star Alleges Jeffrey Tambor Sexually Harassed Her, \"Got Physical\"", "published_at": "2017-11-16 18:28:59", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/trace_lysette_and_jeffrey_tambor__split.jpg?w=1024", "comment_count": 0, "tags": "Transparent", "topics": "News", "body": "In the second season of Transparent, the groundbreaking Amazon series that traces one father's journey to womanhood, Maura Pfefferman — played by Jeffrey Tambor, in a role that has won him two Emmys — struggles to find the right inflection for the popular queer catchphrase, \"Yas queen.\"\r\nHer teacher is Shea — played by Trace Lysette — a yoga teacher and sometimes stripper, who steps in to show her fellow transgender, a newbie, the ropes.\r\nThe moment, which went viral shortly after the season debuted in November 2015, plays out as sweet, hilarious and authentic. But Lysette now says the circumstances around its filming were anything but.\r\nAccording to Lysette, when she emerged from wardrobe in her costume — a salmon-colored lingerie top and matching short-shorts — Tambor remarked, \"My God, Trace. I want to attack you sexually.\" Alexandra Billings, the third actor in the scene, was present to hear the remark, she confirms. Both \"laughed it off because it was so absurd,\" Lysette says.\r\nA few minutes later, while waiting for a camera setup between takes, Lysette was standing in a corner of the soundstage set. That's when she says Tambor, dressed as Maura, wearing a green satin kimono and gray wig, approached her.\r\n\"He came in close, put his bare feet on top of mine so I could not move, leaned his body against me, and began quick, discreet thrust back and forth against my body. I felt his penis on my hip through his thin pajamas,\" Lysette says.\r\nLysette pushed Tambor away and \"rolled my eyes.\" Billings was not present for this alleged incident, and several crewmembers were nearby \"but they were focused on their jobs. It was discreet. If you were behind Jeffrey you might have thought he was giving me a hug.\"\r\nThe actress, who is transgender, is the second on the Transparent payroll to come forward with allegations that Tambor, 73, has subjected them to sexual harassment, sexual assault and generally abusive behavior on the set of the critically adored series.\r\nThe first accuser, Van Barnes, is a trans woman who worked as Tambor's personal assistant, and whose allegations have led to an internal investigation by Amazon Studios. She has previously appeared on E!'s I Am Cait.\r\nAccording to Barnes' lawyer Alana Chazan, her client signed a nondisclosure agreement while working for Tambor and therefore could not comment on Lysette's claims. Nor would Barnes detail what workplace abuses she allegedly suffered at Tambor's hands — accusations which were made in a private Facebook post that had leaked and circulated within Hollywood transgender circles.\r\nA copy of that Facebook post was obtained by The Hollywood Reporter. In it, Barnes, without directly naming Tambor, vents about an employer who made comments like \"I should be sleeping with him if I want a Hollywood industry appropriate pay grade\" and \"it wouldn't take long, he pops quick.\" She says the employer subjected her to \"butt pats,\" pornography played at loud volumes, and complaints that she \"was useless, could do nothing right.\"\r\n\"Despite having made no public statements to date, the disclosure of Van Barnes' identity by the press has already led to Ms. Barnes receiving numerous threats and harassment online,\" Chazan says. \"Ms. Barnes is cooperating with the investigation being conducted by Amazon and will not be making a statement while the investigation is pending.\"\r\n\r\nLysette shared a house with Barnes while Barnes worked as Tambor's assistant. \"She would pick him up in the morning and bring him home at night and everything in between,\" Lysette recalls. \"She would come home wrecked and stressed. I saw him break her down. She for the most part kept it to herself. She was just like, 'Girl, he is a piece of work. If you only knew what I’m going through.' But I knew.\"\r\nFor Lysette, an acting neophyte who came to Hollywood directly from New York City, where she worked as a dancer, Tambor's attentions began early and innocently enough.\r\nShe describes a moment in her first season on the show, a scene set in a yoga studio, when she had trouble finding her mark. \"Jeffrey stepped in and said, 'Come on, that’s hard. I couldn’t even do that.' And then he and the [director of photography] had a little back and forth. He was sticking up for me.\"\r\nWhen the exchange was over, Tambor approached Lysette and \"kissed me on the forehead and was like, 'Are you good?' I said, 'Yeah, I’m fine.' It started with things like that. Telling me I looked great, things like that.\"\r\nAs Lysette began to step into the spotlight and enjoy her first tastes of fame, she recalls running into Tambor at red carpet events, where she \"would go to hug him and kiss him on the cheek — and it would land on my lips. And I was like, 'OK. What was that about?'\"\r\nShe says it wasn't until the filming of the \"yas queen\" scene and the alleged physical assault that she was certain she was being targeted and sexually harassed by Tambor. From that moment on, she says life on the set with the actor \"has been a roller coaster. One minute Jeffrey is lovely, the next it's a temper tantrum or flirtation.\"\r\nLysette describes another moment \"that sticks in my brain\" from later in production of season two: Tambor had set up a meeting between Lysette and his manager for potential representation.\r\nLysette thanked Tambor for the gesture, she says, \"and he said, 'Well, yeah Trace. I really believe in you. And you know what? I don't even want to have sex with you.' And then he just looked at me as if he very much indeed wanted to have sex with me. It was an up-and-down look. I rolled my eyes and went to my trailer and thought, 'This man is something else.'\"\r\nBoth Lysette and Barnes say they approached Transparent producers with their complaints about Tambor, but no action was taken.\r\n\r\nTambor issued this statement to THR in response to Lysette's allegations:\r\nFor the past four years, I’ve had the huge privilege — and huge responsibility — of playing Maura Pfefferman, a transgender woman, in a show that I know has had an enormous, positive impact on a community that has been too long dismissed and misunderstood. Now I find myself accused of behavior that any civilized person would condemn unreservedly. I know I haven’t always been the easiest person to work with. I can be volatile and ill-tempered, and too often I express my opinions harshly and without tact. But I have never been a predator — ever. I am deeply sorry if any action of mine was ever misinterpreted by anyone as being sexually aggressive or if I ever offended or hurt anyone. But the fact is, for all my flaws, I am not a predator and the idea that someone might see me in that way is more distressing than I can express.\r\nAn Amazon spokesperson says, \"This information will be added to our ongoing conversation.\"\r\nLysette issued this statement to THR:\r\nLast week, it was reported in the media that Van Barnes, who previously worked as Jeffrey Tambor's assistant while shooting Transparent, had privately spoken out on her social media about her experiences of abuse. Sadly, I must add my voice to the chorus. Jeffrey has acted inappropriate to me too.\r\nJeffrey has made many sexual advances and comments at me, but one time it got physical.\r\nOne day on set during Season 2, Jeffrey, Alexandra Billings and I were all outfitted in pajamas. I was in a flimsy top and matching short shorts. Upon seeing my in my costume, Jeffrey sexualized me with an over the top comment. Alexandra and I laughed it off because it was so absurd and we thought surely it had to be a bad joke. I shook it off. Then later, in between takes, I stood in a corner on the set as the crew reset for a wide shot. My back was against the wall in a corner as Jeffrey approached me. He came in close, put his bare feet on top of mine so I could not move, leaned his body against me, and began quick, discreet thrusts back and forth against my body. I felt his penis on my hip through his thin pajamas and I pushed him off of me. Again, I laughed it off and rolled my eyes. I had a job to do and I had to do it with Jeffrey, the lead of our show. When they called action, I put that moment in the corner into its own corner of my mind. Compartmentalizing has always been part of my survival took kit, long before I came to Hollywood. It's shitty to admit out loud — and I don't say it to justify what I went through — but given the journey and circumstances of my life, I was used to being treated as a sexual object by men — this one just happened to be famous.\r\nDespite multiple uncomfortable experiences with Jeffrey, it has been an incredible, career-solidifying honor to bring life to my character Shea on Amazon's Transparent. Working on the award-winning series as a low-income trans woman with active roots in New York's ball culture is a rare opportunity most of my sisters are not given.\r\nMy hope is that Amazon can find the good in this, and use this as an opportunity, a teachable moment to re-center the other trans characters in this show with the family members instead of just pulling it. Let our brilliant writers continue to craft something that is entertaining and creates a social change the way they know how. Don't let the trans community suffer for the actions of one cis male actor. Transparent has been a guiding light in the industry, by employing more trans people in Hollywood than any other production in history, which made it even more difficult to speak out. As trans-women and survivors we have often felt we never had the power of the voice to speak out on our personal and collective pain. I am so proud of my work on Transparent and its \"trans-affirmative action\" mission, as coined by its creator Jill Soloway. And I call on Amazon to make another bold affirmative move to our communities: Remove the problem and let the show go on. It's vital that the show's creator, showrunner and its studio re-center the narrative of Transparent on the experiences of the other trans characters and family members audiences have grown to love on the series.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Transparent’ Star Alleges Jeffrey Tambor Sexually Harassed Her, “Got Physical”", "url": "https://www.hollywoodreporter.com/news/general-news/transparent-star-alleges-jeffrey-tambor-sexually-harassed-her-got-physical-1059306/", "description": "Trace Lysette, who plays yoga instructor Shea on the series, is the second accuser to allege misconduct by the show’s star; Amazon says the new information “will be added to our ongoing…", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/trace_lysette_and_jeffrey_tambor__split.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-11-16T18:28:59+00:00", "modified_time": "2017-11-22T15:49:04+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Transparent’ Star Alleges Jeffrey Tambor Sexually Harassed Her, “Got Physical”", "description": "Trace Lysette, who plays yoga instructor Shea on the series, is the second accuser to allege misconduct by the show’s star; Amazon says the new information “will be added to our ongoing…", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/trace_lysette_and_jeffrey_tambor__split.jpg?w=1296"}}, "movies": [], "publish_date": 1510856939.0, "source": "https://www.hollywoodreporter.com", "summary": ""}