{"url": "https://www.romper.com/p/chip-gaines-says-he-joanna-didnt-want-to-push-their-marriage-by-continuing-fixer-upper-2934435", "text": "The hearts of fans everywhere broke when Chip and Joanna Gaines announced in September that they were ending their popular HGTV show Fixer Upper. Rumors flew about the reasoning behind the seemingly sudden cancelation, and the Gaineses themselves addressed the situation on their family's website. But people have continued to question the move since, and on Tuesday, the couple appeared on the TODAY show and further addressed the show's conclusion, and their reasons for ending it despite its success. Thankfully, it had nothing to do with marital problems and divorce for the couple. But Chip admitted during the appearance that if the show continued, their marriage could have suffered. Chip Gaines said he and Joanna “didn’t want to push” their marriage, or their relationships with their kids, by continuing Fixer Upper, and really, that's an incredibly honest take on the situation.\n\nUltimately, the decision to end Fixer Upper was very motivated by the couple’s desire to spend more time with their kids — Drake, Ella, Duke, and Emmie — and \"the most important thing in the world,\" according to Chip, is his relationship with Jo and their life with their children, according to People. But Chip did say that he was nervous their relationship could run into trouble if the show continued. When it comes to rumors about his marriage and people questioning it, Chip said on Today:\n\nI give them a little credence. For us, the most important thing in the world is Jo and I’s relationship followed very quickly by these four beautiful kids. We didn’t want to push it, redline it for so long that we woke up and realized we are at a point of no return. We wanted to take a step back and focus on the thing that was absolutely the most important thing to us in the world.\n\nChip's take on the rumors and his response is refreshingly sincere, if you ask me. But he says at another point in the video provided by TODAY that he and Joanna were determined to show up and be \"the real deal\" when it came to filming Fixer Upper, so authenticity is nothing new for him.\n\nThe couple announced the end of Fixer Upper in a post to their blog in September, and the piece even mentioned taking a step back to focus on their family and relationship. Part of the blog post read:\n\nOur family is healthy and our marriage has honestly never been stronger...This is just us recognizing that we need to catch our breath for a moment. Our plan is to take this time to shore up and strengthen the spots that are weak, rest the places that are tired and give lots of love and attention to both our family and our businesses.\n\nChip and Joanna have been honest about focusing on their marriage and family since the cancelation was announced, but the TODAY show appearance seems to be the first time that Chip admitted that, although the couple isn't having problems, he was concerned that they could if they persisted in producing the show.\n\nBut never fear, Gaines worshippers — Chip said there's nothing to worry about just yet. During the appearance, he continued to talk about the choice to stop the show and \"take a break.\" Chip said, according to US Weekly:\n\nPeople in our inner circle, I tell them we're as healthy as we've ever been. I just didn't want to keep pushing this envelope to the fullest extent. We're really thankful that we had the opportunity to step back and take a break.\n\nIt's great that Chip and Joanna recognized what was best for their family and marriage, and didn't bow to the pressures of fans, or any network executive, or the temptation of continuing a successful reality show.\n\nAnd it's not like they're disappearing from the public eye or anything, anyway. For starters, Chip just released a new book, Capital Gaines: Smart Things I Learned Doing Stupid Stuff, according to The Dallas Observer. So he'll probably make appearances for that in the near future.\n\nPlus, Hearth & Hand — the new Target collection Chip and Joanna created with the retail giant in collaboration with their home store, Magnolia — will launch Nov. 5, according to Well+Good. The couple will almost definitely be promoting that.\n\nAnd don't forget, the last season of Fixer Upper is scheduled to begin airing in November, according to People. So you can still get your home improvement fix on with the Gaineses for a little while longer.\n\nAfter that, it seems, the couple will commit to focusing on themselves, and to a break from their intense reality TV show life — a well-deserved one, at that.\n\nWatch Romper's new video series, Romper's Doula Diaries:\n\nCheck out the entire Romper's Doula Diaries series and other videos on Facebook and the Bustle app across Apple TV, Roku, and Amazon Fire TV.", "images": ["https://imgix.bustle.com/uploads/image/2017/10/17/5dabae1b-6467-49a6-8595-5ffd06073314-chip.png?w=540&fit=crop&crop=faces&auto=format%2Ccompress", "https://cdn2.bustle.com/2022/romper/logo-3079c0c267.svg", "https://imgix.bustle.com/uploads/image/2017/10/17/5dabae1b-6467-49a6-8595-5ffd06073314-chip.png?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/getty/2022/10/6/6c7441ac-6254-498b-bc14-3405863ce3d7-getty-1241120058.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2022/9/29/c89a7448-7aca-4797-a796-4fc9bd87dbf2-getty-1082208204.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2022/10/7/8e9c4153-4a43-4bd2-8d87-20961ddc2ed1-getty-104622050.jpg?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/image/2022/10/7/204b2116-72fb-4450-894a-160559b7f490-amy.PNG?w=159&h=110&fit=crop&crop=faces&auto=format%2Ccompress", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1"], "top_img": "https://imgix.bustle.com/uploads/image/2017/10/17/5dabae1b-6467-49a6-8595-5ffd06073314-chip.png?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.romper.com/p/chip-gaines-says-he-joanna-didnt-want-to-push-their-marriage-by-continuing-fixer-upper-2934435", "title": "Chip Gaines Says He & Joanna “Didn’t Want To Push” Their Marriage By Continuing ‘Fixer Upper’", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@romper", "card": "summary_large_image", "creator": "@jrhodescook"}, "article": {"publisher": "https://www.facebook.com/romperdotcom"}, "og": {"site_name": "Romper", "url": "https://www.romper.com/p/chip-gaines-says-he-joanna-didnt-want-to-push-their-marriage-by-continuing-fixer-upper-2934435", "type": "article", "title": "Chip Gaines Says He & Joanna “Didn’t Want To Push” Their Marriage By Continuing ‘Fixer Upper’", "description": "The hearts of fans everywhere broke when Chip and Joanna Gaines announced in September that they were ending their popular HGTV show Fixer Upper. Rumors flew about the reasoning behind the seemingly sudden cancelation, and the Gaineses themselves…", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2017/10/17/5dabae1b-6467-49a6-8595-5ffd06073314-chip.png?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "The hearts of fans everywhere broke when Chip and Joanna Gaines announced in September that they were ending their popular HGTV show Fixer Upper. Rumors flew about the reasoning behind the seemingly sudden cancelation, and the Gaineses themselves…"}, "movies": ["https://www.youtube.com/embed/f-b538UwTq4", "https://www.youtube.com/embed/skJB3MPGzkA"], "publish_date": null, "source": "https://www.romper.com", "summary": ""}