{"url": "https://theundefeated.com/features/serena-williams-baby-bump-fashion/", "text": "Serena Williams attends the launch of the Burberry DK88 Bag hosted by Christopher Bailey at Burberry Soho on May 2, 2017 in New York City.\n\nUnless you’ve been living under a rock, you’ve heard that Serena Williams, tennis goddess and one of the best athletes on this here planet Earth, is pregnant. Folks are so ready for any and all news about Williams’ bambino, her impending nuptials to Reddit co-founder Alexis Ohanian and what she’s wearing as the couple traipses across the globe on a superglamorous babymoon.\n\nOne of the biggest surprises about Willams’ pregnancy — besides her sister, Venus, accidentally spilling the beans to the press about the baby’s gender (a girl!) — has been her maternity style. Take a peek at her Instagram page, which has 5.8 million followers, and notice the subtle fashion change. Since she announced her pregnancy in April, Williams has been stepping out in classic, elegant attire.\n\nIt started with the custom green silk halter maternity dress that she wore to the Met Gala. Williams’ longtime fashion stylist, Kesha McLeod, was responsible for giving us the first taste of the new Serena aesthetic: sexy and dramatic, yet understated and well-executed. Williams’ new “work” clothes have veered toward the conservative side, with hemlines hitting her knee and made in soft fabrics that flatter her incredible, muscled-like-nobody’s-business body. The makeup and hair are elegant and pretty. Williams is the now the very picture of a calm, meditative madonna, a blossoming mama-to-be.\n\nBut hold on for a minute. We’re all here for the #blackgirlgoals, but where is our Serena? You know, the 23-time Grand Slam champion who plays tennis in leatherette catsuits, gladiator tennis boots, miles of weave, tons of jewelry, makeup and nails. Not that folk expected a nine-month circus show, but we are talking about a world-class athlete who has spent the past 20 years staring down anyone who came at her wrong for being too flashy, too urban, not feminine enough, too much of her own woman. Surely, the ruthless assassin who killed weaker women on the pro tennis circuit before the breakfast dishes were cleared would dress the same part as a very fit pregnant lady.\n\nAnd though Williams’ turn at demure appropriateness isn’t at all what we expected from “La Williams of Compton,” we’re actually getting what we need from someone who has titillated us with her style antics. Not that she would have, but Williams could have gone the Kim Kardashian, “Kanye only likes me in stilettos when I’m pregnant” route. Or the way of her also-pregnant BFF, Beyoncé, whose deep dive into belly-baring African Earth Mother goddessdom has temporarily shut Sasha Fierce all the way down.\n\nSeems our Serena is more than ready to make the transition from single, multimillionaire megastar to wife of a Silicon Valley entrepreneur geek and mom of a (very) genetically blessed baby. And the hardcore fashionista who already has a successful clothing line sold on HSN now has a legitimate shot at designing a maternity line for active, fit moms if she wants. Williams would be the perfect model, and you just know she’d knock that ball out of the park. So, serve it up, mama. We’re all here for it.\n\nSerena went casual chic with a simple cotton, polka dot-print dress with hip, but comfy Chanel espadrilles when she announced that she’d joined the board of SurveyMonkey.\n\nGuests who attended Beyoncé’s star-studded baby shower came dressed in African-inspired clothing. Serena’s traditional head wrap was colorful and fun.\n\nA patterned shirt dress and beautiful nude pumps can make any woman look good. Serena knows these things because Serena is the GOAT.\n\nNothing says summertime at an amusement park like a denim overall shorts set. This particular one happens to be worn by the best pound-for-pound athlete in the world.\n\nThe dress that started it all: Serena’s curve-hugging Versace Met Gala gown debuted her baby bump in the best, most fashionable way possible.\n\nTaking a style cue from Michelle Obama’s closet, perhaps? The wide leather belt gave Ms. Williams the illusion of a waist.", "images": ["https://andscape.com/wp-content/uploads/2017/06/676786750.jpg?w=700", "https://andscape.com/wp-content/uploads/2016/05/hudson-1.png?w=90", "https://andscape.com/wp-content/uploads/2017/06/6767867501.jpg?w=591"], "top_img": "https://andscape.com/wp-content/uploads/2017/06/676786750.jpg?w=700", "keywords": [], "authors": ["Jill Hudson"], "canonical_link": "https://andscape.com/features/serena-williams-baby-bump-fashion/", "title": "Serena Williams’ maternity style is a grand slam", "meta_data": {"viewport": "width=device-width, initial-scale=1", "google-site-verification": "CX9zfgQGTYeO58XNbACP61LGA8rlj2_p0nU8QFuZsxw", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "color-scheme": "only light", "og": {"type": "article", "title": "Serena Williams’ maternity style is a grand slam", "url": "https://andscape.com/features/serena-williams-baby-bump-fashion/", "description": "Unless you’ve been living under a rock, you’ve heard that Serena Williams, tennis goddess and one of the best athletes on this here planet Earth, is pregnant. F…", "site_name": "Andscape", "image": {"identifier": "https://andscape.com/wp-content/uploads/2017/06/676786750.jpg?w=700", "width": 700, "height": 394}, "locale": "en_US"}, "article": {"published_time": "2017-06-02T15:41:00+00:00", "modified_time": "2017-06-02T15:41:00+00:00", "author": "https://andscape.com/contributors/jill-hudson/", "publisher": "https://www.facebook.com/andscape", "opinion": "false", "content_tier": "free"}, "twitter": {"text": {"title": "Serena Williams’ maternity style is a grand slam"}, "image": {"identifier": "https://andscape.com/wp-content/uploads/2017/06/6767867501.jpg?w=640", "src": "https://andscape.com/wp-content/uploads/2017/06/676786750.jpg?w=700"}, "card": "summary_large_image", "site": {"identifier": "Andscape", "id": 3033098871}, "widgets": {"csp": "on"}, "maxage": 300, "creator": {"identifier": "ESPNStyleWriter", "id": 24465873}, "label1": "Written by", "data1": "Jill Hudson", "label2": "Filed under", "data2": "Style, Serena Williams"}, "fb": {"app_id": 834240743288407, "pages": 1583598865225460}, "facebook-domain-verification": "qaqen3n93wluvws9olkk3dn1ktbksx", "DC.date.issued": 73933, "description": "Unless you’ve been living under a rock, you’ve heard that Serena Williams, tennis goddess and one of the best athletes on this here planet Earth, is pregnant. F…", "author": "Jill Hudson", "msapplication-TileImage": "https://andscape.com/wp-content/uploads/2022/07/cropped-andscape-icon.png?w=270"}, "movies": [], "publish_date": 1496418060.0, "source": "https://theundefeated.com", "summary": ""}