{"url": "www.gobankingrates.com/net-worth/celebrities/ellen-degeneres-net-worth/", "text": "Ellen DeGeneres’ Net Worth as Her Show Begins Its Final Season\n\nJason Kempin / Getty Images\n\nFor many faithful fans, “The Ellen DeGeneres Show” has been appointment viewing since 2003. Through the years, she has welcomed a who’s who of guests to her studio, given away millions of dollars and dotted each episode with her unique brand of humor.\n\nIn May, DeGeneres announced that the 2021-22 season would be the last for her award-winning show. The final season debuted on September 13.\n\nWhy stop now? DeGeneres said 19 seasons seemed like the right number of years and that the decision was not due to recent allegations that the work culture surrounding the show was toxic — allegations that led to a change in management.\n\n“I learned that things happened here that never should have happened. I take that very seriously, and I want to say I am so sorry to the people who were affected,” she said on the opening edition of the 2020-21 season. “I know that I’m in a position of privilege and power, and I realize that with that comes responsibility, and I take responsibility for what happens at my show.”\n\nMake Your Money Work Better for You\n\nDeGeneres said that at age 63, the time has come to do something new.\n\n“When you’re a creative person, you constantly need to be challenged – and as great as this show is, and as fun as it is, it’s just not a challenge anymore,” DeGeneres said in an interview with The Hollywood Reporter.\n\nThe final season is expected to be a months-long celebration of the show, and DeGeneres will bring back some of her favorite guests — there have been more than 2,400 of them — over 3,000-plus episodes.\n\nAmong those celebrities scheduled to appear on the show this season are Jennifer Aniston, who was the first guest in 2003 and has visited with DeGeneres 22 times. Jimmy Kimmel will make his 30th appearance, and Melissa McCarthy, Sean “Diddy” Combs and Melissa Etheridge are booked for episodes early in the season.\n\nFind Out: The Richest Celebrity From Every State\n\nEllen DeGeneres’ Net Worth\n\nDeGeneres’ net worth is estimated to be $370 million, according to Forbes, though by some estimates it’s as high as $600 million. In 2020, DeGeneres made $84 million, retaining the No. 12 spot on Forbes’ list of the highest-paid celebrities in the world. Her wife — actress Portia de Rossi — has her own $50 million fortune, which brings the celebrity couple’s total net worth to $420 million.\n\nMake Your Money Work Better for You\n\nStarting out as a stand-up comedian, DeGeneres rose to fame as an actress, starring in the TV series “Ellen” from 1994 to 1998 and “The Ellen Show” from 2001 to 2002. Her daytime talk show, “The Ellen DeGeneres Show” debuted on Sept. 8, 2003, and had consistently high ratings until the recent controversies. Ratings in the 2020-21 season plummeted by 43%, the average number of viewers was down from 2.5 million to 1.4 million, USA Today reported. Ratings across talk shows were down in general.\n\nDeGeneres has hosted the Oscars twice, in 2007 and in 2014. She made history during the 2014 gig by tweeting a group selfie with a gaggle of famous friends, including Meryl Streep, Bradley Cooper, Jennifer Lawrence, Julia Roberts, Brad Pitt and Kevin Spacey — a photo that has received nearly 3 million retweets since being posted.\n\nDeGeneres famously voiced the character Dory in the 2003 Pixar film “Finding Nemo” and the 2016 sequel, “Finding Dory.”She’s also found major success behind the camera with her own production company A Very Good Production.\n\nWhoa: 15 Highest-Grossing Actors of All Time\n\nEllen DeGeneres’ Business Ventures\n\nThe tech-savvy superstar launched the site Ellentube in 2014, which hosts exclusive video content from her talk show. In 2015, she also partnered with Vessel to debut one or two clips from “The Ellen DeGeneres Show” on the streaming site before they’re available anywhere else.\n\nMake Your Money Work Better for You\n\nDeGeneres has also ventured into the beauty and fashion world. In 2009, she became the face of COVERGIRL. She also previously served as the spokeswoman for JCPenney and American Express. And her lifestyle brand, ED by Ellen — including clothing, accessories and home decor — launched in 2015.\n\nIn late 2017, DeGeneres also debuted a game show titled “Ellen’s Game of Games” on NBC, expanding the popular games that have been featured on her talk show.\n\nBig Tippers: 20 Celebs Who’ve Left Generous Tips\n\nEllen DeGeneres’ Real Estate Portfolio\n\nDeGeneres and wife de Rossi have made a name for themselves as real estate magnates. The couple has a knack for purchasing swanky properties and unloading them to fellow celebrities. For example, they became landlord to musician Nick Jonas in 2015, renting one of their many homes to him.\n\nThe couple purchased a mid-century modern Los Angeles mansion in January 2014 for nearly $40 million and promptly sold it to Sean Parker six months later for $55 million. Previously, in May 2012, they sold their 15,000-square-foot Beverly Hills compound to Ryan Seacrest for $36.5 million. The couple also purchased Brad Pitt’s former Malibu bachelor pad in 2011 for $12 million and sold it to cosmetics entrepreneur Victoria Jackson in 2012 for $13 million.\n\nIn March 2006 — prior to her marriage to de Rossi — DeGeneres sold a home in Hollywood Hills, California, to Will Ferrell for $9 million. She also sold former Google CEO Eric Schmidt a California home in 2007 for $20 million, which was later the site of Kim Kardashian’s wedding to Kris Humphries in 2011.\n\nThe total number of properties currently owned by the couple is unknown, but real estate publication Dirt reported that DeGeneres sold a Beverly Hills mansion for $45 million in April. She and DeGeneres have reinvested the money up the coast in Montecito, California, where in 2020 they bought a $49 million place from comedian Dennis Miller. Since then, according to Dirt, they added a $14.3 million ranch and a $2.9 million bungalow in town.\n\nDeGeneres released her interior design book “Home” in 2015, which included photos and design tips from many of their past and present residences. Their former Thousand Oaks, California, ranch — which they sold in 2013 for $10.85 million — was featured in Elle Décor.\n\nThere’s Time: Melissa McCarthy and 34 Other Celebrities Who Got Rich and Famous Later in Life\n\nEllen DeGeneres’ Honors and Awards\n\nIn November 2016, President Obama presented DeGeneres with the Presidential Medal of Freedom. “It’s easy to forget now just how much courage was required for Ellen to come out on the most public of stages 20 years ago,” Obama said. Here’s a summary of other awards and accolades that the star has picked up over her career:\n\nGolden Globe Awards\n\nCarol Burnett Award (2020)\n\nDaytime Emmy Awards\n\nOutstanding Talk Show (2004, 2005, 2006, 2007)\n\nOutstanding Talk Show Host (2004, 2005, 2006, 2007, 2008)\n\nOutstanding Special Class Writing (2005, 2006, 2007, 2011, 2012, 2013, 2014, 2019 )\n\n) Outstanding Promotional Announcement – Institutional (2009, 2011, 2012)\n\nOutstanding Talk Show/Entertainment (2010, 2011, 2013, 2014, 2015, 2017, 2019 )\n\n) Outstanding New Approaches – Enhancement to a Daytime Program or Series (2013, 2014, 2015)\n\nOutstanding Interactive Media – Enhancement to a Daytime Program or Series (2016)\n\nOutstanding Promotional Announcement – Image (2016)\n\nPrimetime Emmy Awards\n\nOutstanding Writing for a Comedy Series (1997)\n\nPeople’s Choice Awards\n\nFavorite Female Performer in a New TV Series (1995)\n\nFavorite Daytime Talk Show Host (2005, 2006)\n\nFavorite Funny Female Star (2005, 2006, 2007, 2008, 2009)\n\nFavorite Talk Show Host (2007, 2008, 2009, 2011)\n\nFavorite Daytime TV Host (2012, 2013, 2014, 2015, 2016, 2017)\n\nFavorite Humanitarian (2016)\n\nFavorite Animated Movie Voice (2017)\n\nFavorite Comedic Collaboration (2017)\n\nProducers Guild of America Awards\n\nOutstanding Producer of Variety Television (2005, 2006)\n\nTeen Choice Awards\n\nChoice Comedian (2010, 2011, 2013, 2014, 2015, 2016)\n\nChoice Summer Movie Star: Female (2016)\n\nChoice TV Personality (2017)\n\nChoice Comedy Movie Actress (2017)\n\nMore From GOBankingRates\n\nJami Farkas and Cody Bay contributed to the reporting for this article.\n\nLast updated: Sep. 13, 2021", "images": ["https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/best-banks-2021/spinner-solid.svg.gzip", "https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/home/fortune.png", "https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/best-banks-2021/times-light.svg.gzip", "https://cdn.gobankingrates.com/wp-content/uploads/2022/09/close_img.png", "https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/icon-right-arrow-blue.svg.gzip", "https://cdn.gobankingrates.com/wp-content/uploads/2022/09/Retireatanyage9-22navimage.jpg", "https://cdn.gobankingrates.com/wp-content/uploads/2016/12/09-Jason-Kempin-Ellen-Degeneres-GettyImages-467203380.jpg", "https://cdn.gobankingrates.com/wp-content/uploads/2017/12/170215_GBR_Contributors_GenericWoman_1420x595_LONG-150x150.jpg", "https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/gbr-logo.svg.gzip", "https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/home/msn.png", "https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/home/aol.png", "http://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/img/logo-zergnet.png", "https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/home/time-money.png", "https://cdn.gobankingrates.com/wp-content/uploads/2016/12/09-Jason-Kempin-Ellen-Degeneres-GettyImages-467203380.jpg?w=675&quality=75", "https://cdn.gobankingrates.com/wp-content/uploads/2022/04/300x250-V2.png", "https://cdn.gobankingrates.com/wp-content/uploads/2021/06/Untitled-design-1.png?w=352&quality=75", "https://cdn.gobankingrates.com/wp-content/uploads/2021/06/newsletter-cta-bg-desktop.png?w=653&quality=1", "https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/home/cbs.png", "https://cdn.gobankingrates.com/wp-content/uploads/2022/01/version2-300x250.png.png", "https://cdn.gobankingrates.com/wp-content/themes/rockefeller-lite/assets/src/images/home/cnn-money.png", "https://cdn.gobankingrates.com/wp-content/uploads/2021/06/The-GBR-Closer-icon.png"], "top_img": "https://cdn.gobankingrates.com/wp-content/uploads/2016/12/09-Jason-Kempin-Ellen-Degeneres-GettyImages-467203380.jpg", "keywords": [], "authors": ["Jennifer Taylor", "About The Author", "Learn More"], "canonical_link": "https://www.gobankingrates.com/net-worth/celebrities/ellen-degeneres-net-worth/", "title": "Ellen DeGeneres’ Net Worth as Her Show Begins Its Final Season", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, shrink-to-fit=no", "robots": "max-image-preview:large", "description": "For many faithful fans, \"The Ellen DeGeneres Show\" has been appointment viewing since 2003. Through the years, she has welcomed a who's who of guests to her studio, given away millions of dollars and...", "keywords": "GOBankingRates,celebrities,net worth", "og": {"title": "Ellen DeGeneres’ Net Worth as Her Show Begins Its Final Season", "type": "article", "url": "https://www.gobankingrates.com/net-worth/celebrities/ellen-degeneres-net-worth/", "image": "https://cdn.gobankingrates.com/wp-content/uploads/2016/12/09-Jason-Kempin-Ellen-Degeneres-GettyImages-467203380.jpg", "site_name": "GOBankingRates", "description": "The talk show host is leaving on top!"}, "article": {"published_time": "2018-01-28T08:00:08Z", "modified_time": "2021-09-13T15:58:00Z"}, "twitter": {"card": "summary_large_image", "title": "Ellen DeGeneres’ Net Worth as Her Show Begins Its Final Season", "description": "The talk show host is leaving on top!", "image": "https://cdn.gobankingrates.com/wp-content/uploads/2016/12/09-Jason-Kempin-Ellen-Degeneres-GettyImages-467203380.jpg"}, "google-site-verification": "UM4IRrnbuHbpidFzGcubzUTnYM2nSbbsENyWzajsLtg", "p": {"domain_verify": "5c213d8c1e1470fb2409d7569153017a"}, "msvalidate.01": "835EF260572EA20ACFC7CE1547620982", "fb": {"pages": 191525857260}, "original-source": "https://www.gobankingrates.com/net-worth/celebrities/ellen-degeneres-net-worth/", "thumbnail": "https://cdn.gobankingrates.com/wp-content/uploads/2016/12/09-Jason-Kempin-Ellen-Degeneres-GettyImages-467203380-848x477.jpg", "msapplication-TileImage": "https://cdn.gobankingrates.com/wp-content/uploads/2017/04/cropped-gbr-logo_go_site_id-270x270.png"}, "movies": [], "publish_date": 1517126408.0, "source": "http://www.gobankingrates.com", "summary": ""}