{"url": "https://en.wikipedia.org/wiki/East_Coast%E2%80%93West_Coast_hip_hop_rivalry", "text": "1990s feud between artists/ fans of the East Coast and West Coast hip hop scenes in the US\n\nSuge Knight (left) and Puff Daddy (right), leading figures on opposite sides of the main phase of the rivalry\n\nThe East Coast–West Coast hip hop rivalry was a feud between artists and fans of the East Coast hip hop and West Coast hip hop scenes in the United States, especially from the mid-1990s.[1] Focal points of the feud were East Coast–based rapper The Notorious B.I.G. with Puff Daddy and their New York City–based label, Bad Boy Records, and West Coast–based rapper Tupac Shakur with Suge Knight and their Los Angeles-based label, Death Row Records. The feud culminated in the murders of both rappers in drive-by shootings. Although several suspects have been identified, both murders remain unsolved.\n\nRivalry [ edit ]\n\nBackground [ edit ]\n\nModern hip hop culture and rap music is widely considered to have originated on the East Coast of the United States in New York City.[2][3][4] As a result, New York rappers were often perceived as feeling their hip hop scene was superior to other regional hip hop cultures whereas those on the West Coast of the United States had developed an inferiority complex.[5][6]\n\nBy the late-1980s, however, West Coast hip hop was flourishing, led by acts such as Compton, California's N.W.A. On November 12, 1991, Bronx rapper Tim Dog released the album Penicillin on Wax.[7] It contained several skits which mocked West Coast artists and a diss track directed at the members of N.W.A including Dr. Dre entitled \"Fuck Compton.\" Dr. Dre would respond a year later on his debut solo album, The Chronic.[7] Although Tim Dog would not figure into the later stages of the feud, his diss track presaged what was to come. This was also the same year that Uncle Luke came out with the album In the Nude which also dissed Dr Dre. [8]\n\nIn 1991, Suge Knight co-founded Death Row Records in Los Angeles alongside Dr. Dre, Dick Griffey and The D.O.C.[9] Knight, a native of Compton, California and a Blood,[10] was among those in the West Coast hip hop scene irritated by the East Coast's perceived condescension toward the West.[6]\n\nIn 1993, fledgling A&R executive and record producer Sean \"Puff Daddy\" Combs founded the New York-centered hip-hop label, Bad Boy Records.[11][12] The next year, the label's debut releases by Brooklyn-based rapper The Notorious B.I.G. (also known as Biggie Smalls)[13] and Long Island–based rapper Craig Mack became immediate critical and commercial successes.[14]\n\nBy 1994, New York-born, California-based rapper and actor Tupac \"2Pac\" Shakur had released two successful albums and starred in three movies. However, at the same time, his career was in jeopardy as he was low on money and standing trial in New York City on charges of sexual abuse, sodomy, and weapons possession.[15]\n\nQuad Studios shooting [ edit ]\n\nOn November 30, 1994, 2Pac was scheduled to record a verse with Little Shawn at Quad Studios in Manhattan to help pay his legal fees. As he arrived, members of Junior M.A.F.I.A., a group affiliated with Bad Boy, shouted greetings to 2Pac on the street below. Once he entered the building, two gunmen ordered everyone in the lobby to the floor. When 2Pac hesitated, he was shot five times and robbed. As 2Pac was taken out on a stretcher, he gave the middle finger to Biggie and other Bad Boy affiliates who were present.[15]\n\nOne day later, 2Pac was convicted of sexual abuse.[16] Afterward, 2Pac implied in an interview with Kevin Powell of Vibe that Biggie, Puff Daddy and Uptown Records head Andre Harrell were involved in or responsible for the attack at Quad Studios.[17] Between when that interview was given and when the article was published, Puff Daddy had visited 2Pac at Rikers Island and assured him that Bad Boy was not involved in the shooting.[6]\n\n\"Who Shot Ya?\"[18] C'mere c'mere ... open your fucking mouth ... Didn't I tell you not to fuck with me? ... Can't talk with a gun in your mouth huh? ... Bitch-ass nigga, what? - The Notorious B.I.G.\n\nIn February 1995, \"Who Shot Ya?,\" a B-side track from Biggie's \"Big Poppa\" single was released. Although Combs and Biggie denied having anything to do with the shooting and stated that \"Who Shot Ya?\" had been recorded before the shooting,[19] 2Pac interpreted it as a taunt directed at him.[20][21][22]\n\nSource Awards [ edit ]\n\nOn August 3, 1995, Suge Knight took a dig at Puff Daddy at that year's Source Awards in New York City, announcing to the assembly of artists and industry figures: \"Any artist out there that want to be an artist and want to stay a star, and don't want to have to worry about the executive producer trying to be all in the videos ... All on the records ... dancing, come to Death Row!\" - referring to Combs' tendency to appear in his artists' music videos and perform ad-libs in their songs.[23][24] To the New York audience, Knight's comments seemed a slight to the entire East Coast hip hop scene, and resulted in boos from the crowd.[25]\n\nThe crowd booed again when Dr. Dre was named Producer of the Year. In response to the boos, Death Row artist Snoop Doggy Dogg took the microphone from Dr. Dre and asked the crowd: \"The east coast ain’t got no love for Dr. Dre and Snoop Dogg and Death Row? Y’all don’t love us? Y’all don’t love us?! Well, let it be known then! We don’t give a fuck. We know y’all east coast! We know where the fuck we at!\"[6]\n\nPuff Daddy later took the stage as a presenter and told the audience: \"[A]ll this East and West—that needs to stop. So give it up for everybody from the East and the West that won tonight. One love.\"[6]\n\nMurder of \"Big Jake\" Robles, release of 2Pac, diss tracks [ edit ]\n\nProblems continued the following month when Suge Knight and Puff Daddy attended a birthday party for musician Jermaine Dupri at Platinum House club in Atlanta. Conflict between the two groups spilled outside the club and Jai \"Big Jake\" Robles, a close friend of Knight's and a Death Row Blood affiliate, was fatally shot as he was getting into a limousine.[6] Knight accused Combs (also in attendance) of being involved in the shooting.[26][27]\n\nShortly after Robles' death, Knight secured 2Pac's release from prison by posting his $1.4 million bond, flying across the country and renting a limousine to pick him up from Clinton Correctional Facility.[6] Shortly after his release, 2Pac proceeded to join Knight in escalating Death Row's feud with Bad Boy Records.[18] 2Pac insulted or threatened Biggie, Bad Boy and its affiliates on several tracks from late 1995 to 1996. Examples include the songs \"Against All Odds,\" \"Bomb First (My Second Reply)\" and \"Hit 'Em Up.\"[28][29]\n\n\"Hit 'Em Up\" Who shot me? But ya punks didn't finish now you 'bout to feel the wrath of a menace nigga, I hit 'em up! - 2Pac\n\nQueens group Mobb Deep, which had been called out by name in 2Pac's \"Hit 'Em Up,\" released \"Drop a Gem on 'Em\" in August 1996 as a direct response. In 2011, Mobb Deep's Prodigy recalled his reaction after hearing Hit 'Em Up: \"As soon as we heard Tupac saying anything about Mobb Deep, we went in and made that shit about him. We were like, ‘Fuck this nigga, we going right at this nigga and whoever the fuck he’s down with.’\"[30]\n\n2Pac also interpreted New York rapper LL Cool J's 1995 track \"I Shot Ya\" as a diss track referring to the Quad Studios shooting.[31] In 1996, 2Pac confronted Keith Murray, who was featured on the track, at the California House of Blues. Murray made it clear that the record was not about 2Pac.[32]\n\nAlthough Biggie never released an explicit retaliation record, Junior M.A.F.I.A. member Lil' Cease claimed in a XXL interview that 2Pac was the subject of Biggie's track \"Long Kiss Goodnight.\" Puff Daddy, however, steadfastly denied this theory, arguing that if Biggie were to diss 2Pac, he would have called him out by name.[33]\n\nDuring this time, the media became heavily involved and dubbed the rivalry a coastal rap war, reporting on it continually.[34][35] This caused fans from both scenes to take sides.[14]\n\nFaith Evans [ edit ]\n\nFaith Evans in 1998\n\nIn November 1995, 2Pac met Biggie's estranged wife, Bad Boy singer Faith Evans, at a party and agreed to pay her $250,000 to sing on one of his tracks. According to Evans, after she recorded her part, 2Pac refused to pay her unless she had sex with him and she declined.[36]\n\nWhile Evans continued to deny rumors that she was involved romantically or sexually with 2Pac, Suge Knight and 2Pac were doing the opposite. In January 1996, they hinted to Lynn Hirschberg of The New York Times that he was in a relationship with Evans in that she had given him gifts and he had repaid her those gifts with what he implied were sexual favors.[37] Biggie flew into a rage after hearing about the Times article and aggressively confronted Evans. Publicly, however, he tried to brush it off as a joke.[36] Later, in \"Hit 'Em Up,\" 2Pac made his insinuations explicit, going so far as to say \"I fucked your bitch, you fat motherfucker\" and \"you claim to be a player but I fucked your wife.\"[38]\n\nHip hop writers including Newsweek's Allison Samuels and The Source's Kierna Mayo described Evans as \"a pawn\" in 2Pac's revenge plot against Biggie and the power struggle between the two men. She was not portrayed sympathetically in the media.[36] Vibe joked in March 1996 that Evans was \"losing weight from all that running back and forth between the Notorious B.I.G. and Tupac.\"[39]\n\n\"New York, New York\" [ edit ]\n\nIn December 1995, Tha Dogg Pound, a Death Row group, was in Red Hook, Brooklyn filming the music video for their single \"New York, New York.\" The music for the song used a beat that Biggie had rapped over in a commercial for St. Ides.[36] Biggie called into local hip hop station Hot 97 and said \"Red Hook [is where Tha Dogg Pound and 2Pac are] shooting a video. Brooklyn, stand up!\" according to Snoop Doggy Dogg's recollection. Tha Dogg Pound, who were listening to the radio at the time, interpreted it as a friendly sentiment and thought Biggie was summoning fans to their video set.[40] Shortly after the call, however, shots were fired at Tha Dogg Pound's trailer on the video set. The gunman was never identified. After the shooting, a scene was added to the music video showing Snoop Dogg destroying buildings and cars in New York City like Godzilla.[36] In 1996, East Coast rappers Capone-N-Noreaga, Mobb Deep and Tragedy Khadafi recorded a comeback diss entitled \"L.A., L.A.\" It was released in 1996 on Penalty Recordings.[41]\n\nTupac vs. The Notorious B.I.G. [ edit ]\n\nOn September 7, 1996, Tupac Shakur was shot in a drive-by shooting at the intersection of Flamingo Road and Koval Lane in Las Vegas, Nevada.[42] He was taken to the University Medical Center of Southern Nevada, where he died six days later. In 2002, Chuck Philips wrote the article \"Who Killed Tupac Shakur?\"[43] reporting, \"the shooting was carried out by a Compton gang called the Southside Crips to avenge the beating of one of its members by Shakur a few hours earlier ... Orlando Anderson, the Crip whom Shakur had attacked, fired the fatal shots. Las Vegas police discounted Anderson as a suspect and interviewed him only once, briefly. He was later killed in an \"unrelated gang shooting\" nearly 2 years later on May 29, 1998. The Philips article and its follow-up, \"How Vegas Police Probe Floundered in Tupac Shakur Case\"[44] also implicated East Coast rappers including Biggie Smalls.\n\nSix months after Tupac's death, on March 9, 1997, The Notorious B.I.G. was killed in a drive-by shooting by an unknown assailant in Los Angeles, California.\n\nEfforts at reconciliation [ edit ]\n\nOn September 22, 1996, a peace summit was convened at Mosque Maryam by Louis Farrakhan in the wake of the murder of 2Pac,[45] and another after the shooting of Biggie Smalls in March 1997.[46][47]\n\nIn February 1997, Snoop Dogg and Combs held a press conference where they called for an end to the East Coast–West Coast rap feud that had already claimed the life of 2Pac. \"Kids around the world are watching,\" Snoop said. \"By calling for a truce we're giving them something to live for.\" However, their efforts failed to stop the violence; less than a month later, The Notorious B.I.G. was killed in a drive-by shooting while stopping at a stoplight in Los Angeles.[48]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/e/ec/Lisboa_2011_139_%286474542577%29_%28cropped%29.jpg/143px-Lisboa_2011_139_%286474542577%29_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/21px-Flag_of_the_United_States.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/c/c0/Suge_Knight_in_2007_%286904212374%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/Suge_Knight_in_2007_%286904212374%29.jpg/227px-Suge_Knight_in_2007_%286904212374%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/Faith_Evans_1998_%28cropped%29.jpg/220px-Faith_Evans_1998_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Sean_Combs.jpg/157px-Sean_Combs.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/Mural_of_notorios_b.i.g._in_Brooklyn_NY_%28cropped%29.jpg/141px-Mural_of_notorios_b.i.g._in_Brooklyn_NY_%28cropped%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Suge_Knight_in_2007_%286904212374%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/East_Coast%E2%80%93West_Coast_hip_hop_rivalry", "title": "East Coast–West Coast hip hop rivalry", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/Suge_Knight_in_2007_%286904212374%29.jpg/640px-Suge_Knight_in_2007_%286904212374%29.jpg", "width": 640, "height": 739}, "title": "East Coast–West Coast hip hop rivalry - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}