{"url": "https://web.archive.org/web/20120811172959/http://www.regisjesuit.com:80/page.aspx?pid=1611", "text": "Meet Golden Missy, a rescued seal named after Missy Franklin\n\nOlympics Dispatch: A Day in the London Life of Gold Medalist Swimmer Missy Franklin When I was fourteen years old, I was selected to participate in the “Duel in the Pool: USA vs. Europe” competition. The event was held in Manchester, and that was my very first time visiting the U.K. I remember I loved all the people, the accents, and the food. This trip, however, is my very first time in London. For starters, I absolutely love the Olympic Village—the rooms are great, and we are all allowed to take home our Olympic-themed comforters. There is also an amazing cafeteria that is like a Costco with the cuisine of every possible country represented. I stayed healthy, of course, and focused on more familiar food during the competition (mainly British and American fare) but after my last race on Saturday night, I hit the sushi bar and took a trip to McDonald’s for a McFlurry. Overall, London has put on a fantastic Olympic Games. Yes, the facilities are wonderful, but the people have really made the trip. Whether you’re in a shop, riding the tube, or at the Olympic Park, everyone is so friendly and helpful. Now that the competition has wrapped and I have a little downtime, I have a few other things on my agenda, including a double-decker bus tour and a ride of a river boat down the Thames. I also told my parents that Big Ben is a must! People often ask me what life is like for an Olympian—here is my diary detailing a typical day at the Games . . .\n\n\n\n\n\n9:30 a.m. Wake up at my parents’ rented flat in London and grab breakfast from a little place across the street.\n\n\n\n10:30 a.m. Get picked up for media interviews with my mom and dad.\n\n\n\n11:30 a.m. Arrive at Olympic Park.\n\n\n\n12:00 p.m. Join other Olympic gold medalist swimmers Dana Vollmer, Katie Ledecky, Nathan Adrian, Matt Grevers and Brendan Hansen for the Today show. It is so great to see them all again!\n\n\n\n1:30 p.m. Head to mall for an interview with Olympic swimming legend Amy Van Dyken. Stop by the Village on the way there to check to see if my ticket request for gymnastics went through. Fingers crossed!\n\n\n\n2:30 p.m. Finally time for lunch. I am starving!\n\n\n\n4:00 p.m. Head to the BBC and Canadian Television studios for some more interviews.\n\n\n\n5:30 p.m. One of the last interviews of the day, with Piers Morgan. It is so nice to meet him in person. They asked me to wear all my medals, but I don’t think anyone realizes just how heavy the medals actually are.\n\n\n\n6:30 p.m. Head home with my mom and dad. We eat dinner with my cousin Darryl.\n\n\n\n9:00 p.m. Watch a movie with my cousin and Skype with friends back home.\n\n\n\n1:00 a.m. Bedtime! It’s been a long but fun day. I’m definitely looking forward to seeing the city with my family this week. Read the full article in Vogue.\n\nYoung Olympic swimmers have to decide future WASHINGTON - As I watched Melissa \"Missy\" Franklin touch the Olympic pool wall Friday in a brilliant display of teenage athleticism, I could only think of that old slogan: \"You've come a long way, baby!\" It was 40 years ago when another Melissa, full of teenage enthusiasm and competitive juices, knifed through the water at another Olympics to capture the same 200-meter backstroke event and gave the cause of U.S. women's swimming a huge boost. Melissa Belote was just 15, a Springfield, Va., high school sophomore, when she landed in Munich in 1972 for an Olympics that was to bring both triumph and tragedy. Mention those Olympics, and competing visions of terrorists and murdered Israeli athletes and swimmer Mark Spitz's unparalleled seven-gold performance will flash through the minds of people old enough to remember. What they most likely won't recall is the young lady with the big smile who cooled down the rest of the world's \"phenoms\" with two individual gold medals and a third in the relays, all record-setting performances in both the 100- and 200-meter backstroke, as well as the 400-meter individual-medley relay. That unexpected achievement in the 200 was the event's last by an American woman until 17-year-old Franklin accomplished it in the London games. She now faces some of the same difficult decisions her predecessor did. Simply put, it is whether to choose the monetary rewards that can go along with such spectacular performances over a college swimming career under NCAA rules that don't permit payments to athletes. (Katie Ledecky, who at just 15 startled everyone by blowing away the competition in the 800-meter freestyle, has some time to think about it.) Read the full article in the News Chief.\n\nMissy Franklin's longtime Springs friend, competitor watched from afar When Sarah James lined up for her top event at the 5A state swim meet, the Doherty standout knew she was swimming for second place. Missy Franklin tends to have that effect on the competition. James was the runner-up to Franklin in the 100-yard backstroke in February, just months before the Regis Jesuit student and Aurora native exploded on the international scene with a stellar Olympic performance that included four gold medals and two world records in the pool at London. “I knew that she was going to win, and I wanted her to,” James said of swimming against the Olympic champion. “She deserves it as much as anyone out there. I just wanted to be as close as I could.” James came in second at 56.74 seconds, well behind Franklin’s winning time of 52.76. Still, she can forever say she finished second to one of the world’s greatest swimmers. More importantly, she can say that Franklin is her friend. Since meeting at club swim meets when they were 12, Franklin and James have carried on a friendship typical of most teenage girls. They often go to Water World, movies or just hang out. It would be hard to call them rivals, as James has never defeated her friend in a pool. “I'm pretty good at getting second,” James said. The dynamic of the friendship – and everything in Franklin’s life - might change now that 17-year-old is world-famous and may command upward of $5 million in marketing deals if she gives up her amateur status, according to an expert quoted in the Denver Post. But this notoriety wasn’t thrust upon her overnight, either. When Franklin announced she’d swim at state the advance tickets quickly sold out and unsuspecting parents and fans were left scrambling to gain entrance to the cramped Eudora Pool in Fort Collins. “She had a camera following her everywhere she went,” James said. “I can’t imagine what it was like for her and what it must be like now. “I’ve seen a lot of people go up to her and ask her for an autograph. It’s kind of funny. My teammates will be like, ‘Sarah, can you introduce me to her?’ So I’ll bring them up to her. She’s totally cool with it. She’ll sign anything or pose for pictures.” James said the magnetic personality Franklin displayed before the cameras in London is the same that comes out in private. “Absolutely, she is so nice and so humble,” James said. “She’s just like she is on the TV screen and in the press. She’s one of the nicest girls I've ever met. She's proud of everyone else and always talking about everyone else. She's not cocky one bit.” James brought her laptop to work last week so she could watch her friend swim on the world’s biggest stage. James, a lifeguard at Colorado College, would find at least one disinterested lifeguard to stay on duty while she and others would watch Franklin’s races live online. “I didn’t want to have to wait and watch them later,” said James, who like Franklin will be a senior this year. James said she’ll probably go to Denver for a party to welcome Franklin home from London, or wait and get their group of about five or six friends together. Whatever happens, James will have memories of a friendship and of a race in February where she had the chance to measure herself against the best the world has to offer. “It's an amazing feeling,” James said. “I was second to a world-record holder and an Olympian.” Read the full article in the Gazette.\n\nA conversation with U.S. Olympian Missy Franklin Words like “prodigy” and “phenom” get thrown around a lot when discussing young athletes, but in Missy Franklin’s case, those descriptive monikers can be legitimately used. Franklin started swimming at the age of five and by the age of 16 had broken two short course world records (200-meter backstroke and 4×100-meter medley relay). Now with her first Olympic appearance squarely within sight, the 17-year old natural is hopeful that a trip to London later this summer will be part of a bigger purpose—to show the world what God has done in her life. In this Inspiring Athletes interview, Franklin talks about her commitment to excellence, how she discovered faith and how God helps her through some unique challenges: Chad Bonham: At what point in your life did you decide to pursue your Olympic dream? Missy Franklin: When I was twelve years old, Coach Todd Schmitz and I had our usual fall planning meeting. He asked me what my goals were for the year, and I said to qualify for the Olympic Trials in the summer. During that year, I qualified in three events and participated in the Olympic Trials in June 2008 when I was 13. I loved every second of this experience and knew that in 2012 I wanted to compete for a spot on the US Olympic Team. I have worked as hard as I can every day since then preparing for this June. Finals for Olympic Trials will be broadcast live on NBC every night from June 25 through July 2. I know my friends and family will be cheering for me. Bonham: How did you get into swimming and what about the sport do you most appreciate and enjoy? Franklin: My mom and I took a Mom and Me class when I was six months old. I guess I loved it and smiled at my mom underwater. Before I turned 3, I snorkeled in Maui and scared my mom to death when I tried to follow a beautiful fish out to sea. I started swimming competitively when I was five years old. My neighborhood, Heritage Greens, has a summer league team and we compete in the Rocky Mountain Swim League. We had so much fun, practicing, and playing every day at the pool. At meets, we set up tents, ate lots of great food, and played games between our events. I started year round swimming when I was seven with Coach Todd at Colorado Stars. I still swim for Stars with Coach Todd. I love swimming and enjoy every practice with my teammates. Travel meets are so much fun as we get to know each other better and become closer. It also is exciting developing friendships with swimmers from other teams from all over the country and the world. Besides all that, I just love the water. It is my element. Bonham: What are some key principles that you’ve relied upon throughout your Olympic pursuit? Franklin: Swimming is considered an individual sport and a lot of time is spent staring at the black line at the bottom of the pool. This requires dedication, and focus. In order to improve and stay at an elite level, there are sacrifices I choose to make. At the same time, I’m 16 and enjoy doing all the teenage activities and do need to make time for it. Although it would be much easier for me to be homeschooled, my friends are way too important. They help me keep the balance in my life. I really have a great life, a lot of fun, and the best friends and family in the world. Bonham: Can you tell me about your faith journey? Franklin: Religion was not important in my parents’ upbringing. Therefore I never had a church home. We occasionally attended a church service but I felt so uncomfortable and self-conscious as I didn’t know what was expected. Before my freshman year I visited Regis Jesuit High School. As I walked in the main door, I felt at peace and knew I belonged there. From that first moment, I knew God was with me. Every day over the last three years, my faith has grown. One of my favorite times is going to our beautiful school chapel and spending time with God. This year, I attended Kairos with my Regis Jesuit sisters and it changed my life forever. I now really work on keeping my faith strong. Bonham: How has your faith in God specifically helped you deal with the challenges you’ve faced as an Olympic hopeful? Franklin: God is always there for me. I talk with Him before, during and after practice and competitions. I pray to Him for guidance. I thank Him for this talent He has given me and promise to be a positive role model for young athletes in all sports. Bonham: What are your expectations for what God might be doing collectively through the church at the Olympics? Franklin: Once every four years, athletes, families, friends and fans come together from all over the world. I know God will be there and I hope many of the people there will also feel His presence. He will offer us the opportunity to appreciate and love our similarities and differences. It will be up to each of us to take away as little or as much as we want from London. Read the full blog post at beliefnet.com.\n\nSybil Bauer: The Missy Franklin of the 1920s CENTENNIAL - Even before the Olympics began most of us knew who Missy Franklin was. But have you ever heard of Sybil Bauer? She's considered the Missy Franklin of the 1920s! Bauer set 23 world records in women's swimming. During the 1924 Summer Olympics in Paris, France, she won a gold medal in the 100 meter backstroke at the age of 19. \"As a child I grew up knowing about her,\" Bauer's great niece Darcy Bauer said. Bauer paved the way for other female athletes like Missy Franklin. \"It's nice to see [Missy] break those records and shoot right out in to the front!\" Bauer said. Bauer was diagnosed with cancer at a young age. She passed away at 23. Bauer was engaged to Ed Sullivan at the time of her death. According to Bauer's obituary in TIME Magazine, Sullivan stood by her side at the hospital at the time of her passing. At the time, Sullivan was a Sport's Reporter but went on to being a popular television host. Bauer also played basketball and field hockey at Northwestern University. Her great niece Darcy currently lives in Centennial. Her other great niece Sybil lives in Westminster. Bauer was inducted into the International Swimming Hall of Fame in 1967. Read the full article in 9News.\n\nMissy Franklin: What Has Made Her the Story of the Olympics? Missy Franklin has burst onto the Olympic scene and captured the hearts of American fans. Part of that instantaneous attraction is definitely due to the fact that she won four Olympic gold medals and broke the world record in the 200-meter backstroke. People definitely love highly successful individuals. However, there is much more to the story than that. For one thing, Franklin represents the spirit of true amateurism. She wants to swim for her eventual collegiate team apparently more than she wants to cash in on her insanely high marketability right now. Of course, accepting sponsorship money would ruin that plan. In a sense, the Olympics were originally intended to be amateur events. Franklin is staying true to that by not hiring an agent and not taking all of the sponsorship money. Another important thing that connects Franklin to the American public is the fact that when you watch her interview, she seems like a normal high school kid. Sure, she is insanely talented, but as a person, she seems like someone that you could talk or might just see walking down the street. People appreciate when athletes don't let all of their success turn them into robots. People like to see personality and sheer enjoyment, and you can definitely sense that when Franklin is interviewed. If she has to write an essay about what she did this summer when she returns to high school, I have a feeling that it will be more interesting than anything her classmates will write. Nevertheless, that is what makes Missy Franklin so marketable. She is phenomenally talented but is still a girl who loves swimming. Read the full article in the Bleacher Report.\n\nMissy Franklin, Katie Ledecky Prove Youth is Served for United States LONDON, August 3. SOMEONE needs to tell Missy Franklin that world records are typically lowered by hundredths of a second, sometimes tenths. They are not usually lowered by nearly a second, which is exactly what the 17-year-old American star did in the 200 backstroke at the Olympic Games on Friday night.\n\n\n\nAnd someone needs to tell Katie Ledecky that 15-year-old girls, like herself, are not supposed to go faster than the best time Janet Evans ever registered or challenge the world record. That's exactly what Ledecky did in the championship final of the 800 freestyle.\n\n\n\nBasically, the future of American female swimming put on a show.\n\n\n\nFranklin finished up her individual program at her first Olympiad by clocking in at 2:04.06, an effort which demolished the global standard of 2:04.81, set at the 2009 World Championships by Kirsty Coventry. The win gave Franklin a sweep of the backstroke events and the first world mark of her long-course career. It was also further proof of the American star's ability to excel under pressure.\n\n\n\nWith only the 400 medley relay to go, Franklin has been fantastic in her initial Olympic experience. While she hasn't medaled in every event, she has been a factor across the board. In the 200 freestyle, she missed a bronze medal by a hundredth of a second. In the 100 free, she was fifth. Overall, she's been a rock star, smiling away and savoring every moment.\n\n\n\n\"It feels amazing,\" she said. \"It's my favorite event. I can't think of a better way to end. I knew I was going to take it out and have fun, and that is what I did. I am the happiest girl alive.\"\n\n\n\nThe scary thing is this is just the beginning of things to come for Franklin. Although possessing a 6-1 frame, Franklin is only going to get stronger and more technically refined as she continues forward. With added power, she's going to start challenging for international gold in the 100 and 200 freestyles. Meanwhile, we could see her dabble with the 200 individual medley.\n\n\n\nAlong the way, she's going to have some support carrying the Team USA banner from Ledecky. As was the case at the Olympic Trials, Ledecky dared her competitors to stay with her, taking the race out at a frantic pace. Her rivals had no chance, and that included defending Olympic champ Rebecca Adlington of Great Britain. Ledecky posted the second-fastest time in history, just off Adlington's world record of 8:14.10. The time, however, was a textile best and took down the legendary 8:16.22 of Evans from 1989. Evans' mark was produced almost eight years before Ledecky was born.\n\n\n\nLedecky still remembers her first brush with the Olympics.\n\n\n\n\"(Phelps) is the first Olympian I ever met when I was six, right before I started swimming,\" she said. \"So, to hear a good luck from him before the race was really cool. I just thought back to that and it really calmed me down.\"\n\n\n\nFor the past year, Ledecky has improved exponentially, which is not an unusual development for a teenager in a distance event. Still, it was tough to foresee a time which scared the world record and took down another standard which had survived for 23 years. Imagine what the future holds? Like Franklin, it's frightening, and great news for the United States.\n\n\n\n**The wild nature of the 50 freestyle revealed itself in the championship final, a surprise emerging during the 21-plus seconds of the race. Now, the Manaudou family has another Olympic gold medal in its possession. By covering the lap in 21.34, Florent Manaudou joined his older sister, Laure, as an Olympic champion. Laure Manaudou won the 400 freestyle at the 2004 Games in Athens.\n\n\n\nManaudou's win was the latest evidence of not only the unpredictability of the 50 freestyle, but this version of the Olympics. Already, we have seen a number of surprise wins, such as South Africa's Chad Le Clos in the 200 butterfly, Nathan Adrian in the 100 freestyle and Tyler Clary in the 200 backstroke. None of those guys were favored, but each found a way to come through.\n\n\n\n**There is no preliminary session tomorrow, only the last set of championship finals in the evening. Aside from the women's 50 freestyle and men's 1500 freestyle, gold medals will be distributed in both medley relays. Both American squads are favored, with Australia the choice for the silver medal in both races.\n\n\n\n**It took until the seventh night of action was concluded, but the Americas have taken the lead in the battle for most regional medals. The Americas enter the last day with 31 medals, as opposed to the 28 by the Pacific Rim. Europe enjoyed a strong night and moved its total to 22, with Africa checking in at three.\n\n\n\n**A total of 16 countries have won medals in the swimming competition, with the United States pacing the way with 28. With the medley relays to come tomorrow, the American squad is almost certain to hit 30 medals, an impressive showing in this age of greater parity in the sport. Read the full article in Swimming World.\n\nMissy Franklin Wants to Do Dancing With the Stars But ... Could Missy Franklin be the next Shawn Johnson?\n\n\n\nOlympic gymnast Shawn won Dancing With the StarsSeason 8 at age 17 and now she’s back for All-Stars Season 15 at age 20. Olympic swimmer Missy, now 17, just finished her time at the London Olympics with five medals — four gold and one bronze — and she's game to sign up for DWTS.\n\n\n\n“I do want to do it,\" Missy told Access Hollywood. \"I would love to go on Dancing with the Stars but, we’ll see how it works out with school and if I go pro and all those crazy things you have to worry about, but hopefully someday I would love to be on that show.\"\n\n\n\nRight now Missy is busy registering for classes for her senior year in high school. So maybe she wouldn't have time to join spring’s Season 16, but what about next fall's Season 17? Add DWTS to the schedule for between high school and college/pro swimming?\n\n\n\nMaybe DWTS could do an all-Olympian special, with Ryan Lochte — who also wants to do DWTS — Michael Phelps, Lolo Jones, Alex Morgan, Gabby Douglas and whoever else wants to show up. Read the full article at Wetpaint.\n\n\n\nFranklin making the most of her visit Missy Franklin can be very persuasive — she’s already persuaded her parents to stay and attend the Olympics Closing Ceremony with her. ‘‘I get these guys to go with me everywhere,’’ she said, nuzzling her head into her father’s chest on Monday. ‘‘I have the parental units close by.’’ Extending her stay means the winner of four golds will now have to sprint directly to school when she returns. The family returns to Colorado late Aug. 13, class registration is the next morning and her senior year of high school begins on the 16th. ‘‘I think it will be exactly the same,’’ the 17-year-old said. ‘‘Even though a few more people may know me, I’m still going to go to the same school I’ve been going to for three years and I’m really excited for my senior year.’’ Her mother, D.A. Franklin, said the family is determined to give her a normal senior year. ‘‘I’m probably extremely naive, people say things are going to change, but right now our goal is to get her back into school,’’ she said. Franklin will still have a curfew and still have to do her homework, her mother said. ‘‘She’s got the most wonderful friends and hopefully she can go to the football games she wants to and the movies and the dances that she wants to,’’ her mother said. ‘‘We hope it’s a normal year.’’ Read the full article at the Boston Globe.\n\nMissy Franklin Reflects On Olympic Success, Justin Bieber Tribute Missy Franklin is a big star not only in the pool, but in the U.S. Olympic swim team's parody \"Call Me Maybe\" music video. Her Olympics are over, having ended with five medals – four gold and one bronze — and the teen reflected on the achievement with Access Hollywood's Billy Bush. \"Four gold, is that enough? Five medals. [Are you] OK with the haul?\" Billy asked, while interviewing the teen swimming sensation in London. \"I am perfectly happy with that. I could have never dreamed of something like this,\" she said. \"You love to perform, whether it's in the pool [or in the] ‘Call Me Maybe' [spoof video],\" Billy said. \"Oh, thank you. We had a lot of great performers in that video,\" Missy said.\"But you were really into it,\" Billy insisted. \"Oh yeah, you have to be into it. It's ‘Call Me Maybe.' How can you not be into it?\" she laughed. This fall, \"Dancing with the Stars\" ushers in its All-Star edition, but when they're looking for new contenders again, Missy wants to sign up. \"I do want to do it. I would love to go on ‘Dancing with the Stars' but, we'll see how it works out with school and if I go pro and all those crazy things you have to worry about, but hopefully someday I would love to be on that show,\" she said. For now, like most 17 year olds, Missy has to get ready for her senior year in high school — just two days after she returns home to the U.S., she has to register for classes. But she'll be going back to school with the joy of winning medals, and getting a shout out from one of her favorite pop stars – Justin Bieber, who made a video for the 17-year-old swimming phenom. \"It was so awesome and his little brother is so cute,\" Missy said of the congratulatory video The Biebs made for her.\" What meant more — the medals or the Bieber shout out?\" Billy asked. \"It was pretty close call. Definitely a close call,\" she said. \"Having that kind of recognition from someone that you look up to? It's really special.\" Read the full article at Fox43.\n\nMissy Franklin on winning Olympic gold: \"I'm on cloud 687\" On Monday evening, champion swimmer and breakout Olympic star Missy Franklin visited the \"Piers Morgan Tonight\" set in London, taking some time out from her ever-growing schedule to discuss a whirlwind trip across the pond. On the heels of capturing five medals – including four gold's – Franklin admitted to enjoying the moment: \"Everyone is like 'are you on cloud nine?' I'm on cloud like 687,\" she told Piers Morgan. \"I don't even know what to think right now. I'm just trying to like fathom everything,\" said the 17-year-old rising high school senior. \"It's weird because when you win a medal, you actually get to hold your dream in your hands, which is just - I mean, nothing can describe that feeling. It's so unbelievable.\" Watch the clip, and listen to the interview, as Morgan concludes his coverage of the 2012 London Olympic games by interviewing the reigning world-record holder in the women's 200 meter backstroke. Watch the interview and read the article at CNN.\n\nMissy Franklin A Reason For Aurora, Colo., To Cheer The city of Aurora, Colo., is relishing the opportunity to cheer for its hometown Olympian, Missy Franklin. Franklin is a 17-year-old swimmer. Read the story and listen to the segment at NPR.\n\nSenior year? 17-year old Franklin to return to regular life ONDON – By all accounts, Missy Franklinis the same Missy Franklin she was a week ago, before she won five Olympic medals in these Games. She still smiles constantly, jokes with teammates and talks about how excited she is for her senior year of high school. \"Her life is forever changed because of this week,\" U.S. women's swimming coach Teri McKeever said. \"Her and her family are going to have to look at her options and what's important to her. Her first responsibility is to herself.\" One of Franklin's first decisions after she finished competing in these Games was to extend her trip. She wanted to attend the closing ceremony because she'd missed the opening ceremony. Most swimmers didn't march in that because their meet started the following morning. \"We got a phone call from her saying, 'Is there any way we can stay for closing?' and I said sure,\" said D.A. Franklin, Missy's mother, on the side of the NBC Today show set Monday. \"She said, 'Well, you have to stay, too, because I'm a minor. So we changed our flights.\" One of the biggest stars of these Games can't walk around Olympic Park alone because she's under 18 years of age? \"I can't go anywhere by myself,\" Franklin said Monday. \"I have to figure out who to go with, who to sign up with.\" She hugged her dad and glanced at her mom. \"I've got these guys to come with me everywhere,\" she said, laughing. \"I have to have the parental units close by.\" Franklin will travel a little with her parents after the Games end, and she'll return home to Colorado on Aug. 13. Three days later, she starts her senior year at Regis Jesuit High School in Aurora, Colo. She hasn't decided on a college yet but is considering California, Georgia, Southern California and, maybe, Texas, she said. \"Right now, our role is to get her back into school,\" D.A. said. \"I've already ordered her books for her, and they're at the house.\" D.A. said Franklin would have a curfew and have to do her homework, like any 17-year-old girl should. \"Everything's the same,\" D.A. said. \"I'm probably extremely naïve. People say things are going to change.\" Franklin echoed her mother's words. \"I think it'll be exactly the same,\" Franklin said. \"Even if a few people know who I am now, I get to go back to the same school I've been going to for three years, and I couldn't be more excited.\" Read the full article in USA Today.\n\nMissy Franklin plans to bring tattoo home along with medals Swimmer Missy Franklin will leave London with four gold medals, a bronze — and a hip tattoo of the Olympic rings, if all goes according to plan. The tat is a Team USA Swimming tradition. Michael Phelps, Brendan Hansen and Matt Grevers already have it, and the 17-year-old confirmed to TODAY.com she hopes to get the celebratory ink before she leaves London. \"Getting a tattoo has never been something I ever thought I would do, but this one just has so much meaning to it and it is really something that you have to earn,” Missy said. “It’s an honor to have it.\" Missy says she's actively looking for a tattoo shop that fits her needs. \"There are a few other girls that might be coming as well. We’re so excited,” Franklin said, adding that the crew will get the work done on Aug. 10, one day before her father's birthday. “Happy birthday, dad,” Missy shouted at her father, Dick Franklin, who was sitting nearby while the family was on set for Missy’s interview with Savannah Guthrie. Unlike many parents of teenagers, Missy's mom and dad agree with their daughter’s decision. “It’s the only tattoo she’ll get — and she’s earned it,” Dick said in an interview with TODAY.com last week. Launch slideshow When asked if he’d consider getting a tattoo alongside his daughter, Dick smiled, pointed to his bicep and joked, “Yeah, ‘Missy’s dad.’” Read the full article on Today in London.\n\nJustin Bieber Records Video Message for Missy Franklin For Missy Franklin, it pays to win a Gold Medal. Yes, that's literally true, based on the monetary award given to Olympic champions. But it's also true emotionally, as this 17-year old swimming star has found out. The Colorado native has already received Twitter props from Justin Bieber, but the singer and his adorable brother have now taken it a congratulatory step further. Watch their video message to Franklin below, along with her reaction to it: Justin Bieber to Missy Franklin: Congratulations! Franklin, who has earned four Gold Medals in London and says she'll soon attend a Bieber concert, said of her experience after finishing first in the 4X100-meter medley relay on Saturday: \"I am over the moon. I'm not even on Cloud 9, I'm on Cloud 568! It's just amazing.\" Watch the video and read the article at The Hollywood Gossip.\n\nMissy Franklin says her huge feet are a big topic in London Missy Franklin is getting lots of attention in London and it has nothing to do with her historic medal haul at the Aquatics Centre. Well, it has something to do with it. The 17-year-old rising high school senior told NBC on Monday that her size 13 feet have been drawing attention from athletes around the Olympics. Host Michele Beadle joked that she'd put a stop to those having fun at the expense of Missy's trotters, but Missy, in her typical bubbly demeanor, said she doesn't mind. In fact, she's proud of her big feet. [ Inspirational moments: Oscar Pistorius in the best picture you'll see ] And why wouldn't she be? Those feet helped her win four gold medals in London and played a part in her becoming America's Olympic sweetheart. Her dad says they're Missy's \"built-in flippers.\" Sometimes you see young female athletes with abnormal size become uncomfortable in their bodies. Missy has none of that. Given how gracefully she moves in and out of the pool with her 6-foot-1 frame (remember that \"Call Me Maybe\" clip?), it's no wonder. \"I think it's helped me so much,\" she told ThePostGame last year. \"God has blessed me with an excellent swimmer's body.\" Read the full article and watch the video at Yahoo! Sports.\n\nMark Kiszla: Missy Franklin's crazy Olympic dream to match Phelps' 22 medals LONDON — Michael Phelps has left the building, taking 22 Olympic medals with him but leaving a goal for a 17-year-old swimmer from Colorado. For Missy Franklin, the pool stretches to infinity and beyond. \"Seeing Michael Phelps become the most decorated Olympian of all time is so inspiring for me and gives me so much motivation,\" Franklin said Saturday, on a night when she rocked more solid gold as the U.S. women won the medley relay, and Phelps retired on top of his game with a final victory lap of his own. \"I don't think his shoes will ever be filled. I think his footsteps are huge. But, hopefully, I can make a little path next to him.\" Collecting five medals and two world records as souvenirs of her first trip to the Summer Games, Franklin experienced the European vacation of a lifetime. She already has struck gold as many times as Jesse Owens did. Know how many Olympic medals Phelps won in high school? Zero. But here's what boggles the mind: Missy the Missile is just getting warmed up. \"She's good for at least two more Olympics,\" said Dick Franklin, knocking on his temple, joking that the luck of good health will need to be on his daughter's side to swim in a Summer Games so far beyond the horizon the host city has yet to be named. Before stopping long enough to inhale a celebratory cheeseburger, Missy the Missile declared she's already aiming at 2016, when the Olympics will be in Brazil. \"Of course, I want to go to Rio. Absolutely!\" Franklin gushed. Her competition is no longer in the pool. It's in the history books. Jack Nicklaus won 18 major golf championships, giving Tiger Woods a dream. Babe Ruth's 60 homers were always on the mind of Roger Maris. After Franklin's backstroke staked her American teammates to an early lead, the world record of 3 minutes, 52.05 seconds set in the 4x100-meter medley relay brought the crowd in the Aquatics Centre to its feet. It wasn't Franklin's first world record. It won't be her last. Long ago, Phelps told Franklin world records become less special over time. \"Oh, don't say that,\" she told the sport's biggest icon. The reason Missy the Missile might defy conventional capitalistic wisdom and delay getting rich quick with endorsement deals marketers project could be worth in excess of $1 million per year was explained succinctly by her father. \"As the fun goes down,\" Dick Franklin said, \"the work goes up.\" To have even a remote shot at winning 22 medals, the fun must endure for another dozen years. The pride of the Colorado Stars swim club has five medals hanging from her neck. She also has a bull's-eye on her back. Franklin is now both the inspiration and the target for every elite female swimmer in the world. \"Her life is forever changed because of this week. Missy and her family have to look at their options and what's important. Her first responsibility is to Missy Franklin, what makes her happy, and it's not to U.S. swimming. I would tell anybody that,\" said Olympic swim coach Teri McKeever, whose college program at California-Berkeley should be considered the early favorite as the place Franklin will take her talent after graduation from Regis Jesuit High School in 2013. \"There's a whole joy in climbing the mountain. It changes when you get to the top. How do you keep climbing, when you're already at the top of the mountain? How do you stay there, when everyone is shooting for you? Missy hasn't had to do that yet. That will be her next challenge. I have no doubt she will figure it out.\" On his way toward the exit and a tee time to work on his drives down the fairway rather than a dive off the blocks, Phelps was asked what swimming will do without him. \"There's so much more,\" Phelps replied, \"that could be done.\" The very idea of another athlete winning 22 Olympic medals seems unfathomable. How could Franklin possibly get there? One lap at a time. During an Olympic meet where she never backed down from competition, there were only fleeting seconds when I saw her act 17, like a teenage girl smaller than the big moment. It was after she won her first gold, in the 100 backstroke, and was ushered in the interview room. The silver and bronze medalists were supposed to be seated alongside Franklin, in front of the bright lights, but had failed to show. Before the microphones were turned on and questions began flying, she whispered a tiny confession. \"I don't like being up here all by myself,\" Franklin said. She isn't alone atop the Olympic world. Franklin is back in the pool, going stroke for stroke in the lane next to Phelps, chasing history. Read the full article in The Denver Post.\n\nMissy Franklin ends London Games as new face of U.S. swimming LONDON —Missy Franklin has heard \"The Star-Spangled Banner\" so many times, she'll be singing it in the shower and not know it. It'll ring in her ears. She'll think it's her cellphone's ringtone. Saturday night, the 17-year-old from Centennial capped off an Olympics a teenage girl can only dream about: A fourth Olympic gold medal, fifth medal overall; second world record; fifth American record. Franklin swam the leadoff leg, and her specialty, the backstroke, in Team USA's 4x100-meter medley relay. This one was special beyond sharing it with her beloved teammates, the ones she makes laugh with her silly dances and her promises of Big Macs when it's all over. It's special because it puts Franklin in the Olympic record book. The four gold medals tie Franklin with Amy Van Dyken, a fellow swimmer and Coloradoan, for the most gold medals in one Olympiad by an American woman. East Germany's Kristin Otto, who won six swimming golds in 1988, is the only female athlete who has won more. \"I exceeded expectations,\" Franklin said. \"I could never have imagined walking into this meet and walking away how I have. I have had so much fun here. I wasn't really expecting golds or world records. I was expecting to get close to my team.\" This final relay wasn't so much a race as a coronation. Four Americans, all with individual gold medals, did an encore together to whitewash the best in the world. Powered by Dana Vollmer's dominating butterfly in the third leg, the 4x100 medley relay team won the gold medal in a world-record 3:52.05. On the pool deck, the four women hugged as if they had swum an ocean and wouldn't see each other for a very long time. \"I'm going to miss this so much,\" Franklin said. \"I know I am. I'm so excited that I'll get to spend a little time with my family and explore London a little bit, but I'm sad. I'm so sad it's all over. I've learned so much from this experience and can't wait to kind of take that home and learn and get better off of that experience.\" Where this goes from here may go beyond Franklin's expectations. Michael Phelps is retiring, leaving Franklin as the face of not only American women's swimming but U.S. swimming in general. She'll return for her senior year at Regis Jesuit High and pick a college sometime soon while fending off endorsers and agents promising millions to the new \"it\" girl. In the meantime, she'll look to find ways to improve on the road to Rio and the 2016 Olympics. Let's see. Where can she look? It's difficult. She even nailed the swim team's \"Call Me Maybe\" video. OK, she didn't medal in the two freestyle events, but no American woman in history ever swam seven events in one Olympiad before Franklin. \"Michael was saying to me before doing this many events that it gets better with experience,\" she said. \"You have to keep doing it over and over again. I think it's going to be awesome to go into the next few seasons and having some awesome doubles and triples to get me back in that mode and keep getting better at having those really fast turnarounds.\" Franklin has only been in the public eye about a year but her smile emerged unchanged, her character even more appealing. To Franklin, everything in London was awesome, from the ready room to the athletes village dessert tray. As her career moves ahead, she will be less in awe. That may help in the pool too. \"I think mentally there are a few races I can be a little more prepared to swim,\" Franklin said. \"It can be a little bit intimidating when you go out there and there's just this absolutely incredible field, so there are places where I know I can be better.\" She credited her coach, Todd Schmitz, for getting her ready. Schmitz indicated other events might be on her schedule, such as the 200 individual medley. \"That's the best thing about swimming,\" Schmitz said. \"I don't think anybody when they get done with a race, whether it's a world record or not, says 'No, I'm never going to be that fast. I'm never going to swim better than today.' \" After the news conference ended here, and her Olympic duties were officially over, Missy got together with her parents for their first unlimited time together during these Games. Their tears long since dried, they were going to a party at the Team USA House. On Sunday, they planned on moving Missy out of the village and into their rented house in England, which they'll use as a base as they explore London over the next week. Missy walked into the cool London night late Saturday a changed girl in perception only. She's still the same Missy Franklin, the one who'll go to Regis Jesuit football games in white overalls, do impromptu dances and crack up everyone around her. But everyone in London who sees her will see her as something else. Missy Franklin is the new face of American swimming. 400 freestyle relay Gets her first Olympic medal in her first event in London. 100 backstroke Caps off grueling day with another medal, this time it's gold. 800 freestyle relay Gives Team USA early lead on its way to gold medal. 200 backstroke Shows why it's her best event with world-record 2:04.06. 400 medley relay Swims opening leg backstroke for world-record relay gold. Read the full article in The Denver Post.\n\nMissy Franklin worth up to $5 million a year, marketing insiders say LONDON — Missy Franklin's father said she will swim collegiately in 2013-14 unless some \"horrendous amount of money\" in endorsements forces the Centennial family to re-evaluate. If his idea of \"horrendous\" is $1 million to $5 million in endorsement money, the Franklins may have to sit down this month for a long talk once they get back from London. A sports marketing expert and two agents who deal with landing endorsements for athletes say that if Franklin eschews her amateurism, she could be worth $1 million to $5 million a year. That's a big gap and representative of the uncertainty in marketing a phenom such as Franklin, who at age 17 won five Olympic medals at the London Games, including four gold. \"She's got a great smile,\" said Andrew Stroth, a Chicago-based sports attorney specializing in endorsement deals. \"Her story's fantastic. She seems like an all-American girl, a young lady who really cares about people inside and outside the pool. \"If Missy Franklin decided to pursue Madison Avenue and corporate America, she could make $2 million to $5 million if her advisers have a strategic plan.\" Franklin has been labeled the new face of American women's swimming ever since she won three gold medals last summer at the world championships. She topped that at the Olympics. She set a world record in the 200- meter backstroke and helped Team USA set a world record Saturday in the 4x100-meter medley relay. The immediate future is clear for Franklin. This fall she will be in her senior year at Regis Jesuit High. After graduation, she said she wants to swim in college. She takes her first recruiting trip Aug. 31 to California. Her top three collegiate choices, as of now, are Cal, Southern California and Georgia. \"I'll be surprised if (the family) doesn't take a serious look at dropping amateurism,\" said A.J. Maestes, a sports marketing expert and president of Navigate Research in Chicago. \"The next four years will be the most she'll ever make in her life. She's so young and is a potential medalist in (the 2016 Olympics in) Rio. She has four great years of exposure. \"I honestly think she could make $2 million a year for four years. It's not crazy to think she'll get a four-, five- or six-year deal for $2 million a year.\" Added Robert Tuchman, president of Skylight Entertainment in New York, which specializes in marketing athletes, \"She seems to be in the $1 million, $2 million range. (What) it comes down to at the end of the day (is) how good is her agent going out there and negotiating? There's no real comparison in the endorsement game. \"Certain athletes get tons and others don't.\" The agents shouldn't count on it. After Franklin won her fourth gold medal Saturday and set her second world record with the medley relay, her father, Dick Franklin, was asked if $1 million to $5 million would be enough for her to reconsider. \"No,\" he said. \"How can you change a little girl's dream?\" In London, the Franklins have been engulfed by prospective agents and endorsers who would love to represent Missy. Dick Franklin has a history of negotiating contracts as a former corporate executive with Head and Reebok but is adhering to his daughter's wishes to accept a collegiate swimming scholarship. \"If she had a whole lot of corporate responsibilities — got to be here, got to be there, got to go for a shoot — it wouldn't help her swimming,\" he said. \"It kind of lowers the fun and raises the work.\" The agents don't necessarly disagree with that decision, figuring the big money will be there for years to come, if Missy maintains her elite status. \"In terms of swimming and enjoying herself, it'd be a shame if she didn't have that in her life,\" Tuchman said. \"I've seen other Olympians and they want some normalcy. You can never get those years back. For her, she's probably going to swim to 25.\" Her sport will help her make that decision. Swimmers don't get injured much. And, if she's peaking three years from now going into the Rio Olympics, the demand for her as a spokeswoman will be greater than ever. One option is swimming collegiately for two years before turning pro while pursuing her degree and preparing for the Rio Games. Dick Franklin said he expects endorsement deals would total in the $300,000 to $500,000 range if his daughter went that route. \"He's exactly right for a normal medalist,\" Maestes said. \"She's just not normal.\" Read the full article in The Denver Post.\n\nThe Five Greatest Swimming Races from the London Olympics The London Olympics produced several memorable moments at the pool. The U.S. swim team produced lasting moments on nearly every night of the competition. Listed below are the five greatest individual races from the swimming competition in London. Missy Franklin in women's 100 backstroke Missy Franklin had many memorable races in London. The most impressive race may be her 100 meter backstroke since she had such a short break in between this race and her 200 freestyle qualifying race just 15 minutes before. The double appeared very difficult, but Franklin pulled it out and won her first individual gold in this event. Rebecca Soni in women's 200 breaststroke Soni makes the list by breaking the world record twice in the event. After first breaking the record in the semifinals, Soni was even better in the finals as she cruised to victory. Soni became the first woman to go under two minutes and twenty seconds in the race and left her mark on her signature race. Nathan Adrian in men's 100 freestyle Adrian produced the closest race of the entire swimming competition when he pulled out the race by one one-hundredth of a second. Adrian won one of the most difficult races against strong competition by the smallest margin possible. Adrian's race here and later closing out the men's medley relay make him one of the biggest stars of U.S. swimming leaving London. Michael Phelps in men's 200 I.M. This was the race where Michael finally broke through and won his first individual gold medal in London. Defeating Ryan Lochteand winning gold was an impressive performance here. Phelps looked strong in the water and was very reminiscent of the swimmer everyone remembers. This event marked the turnaround for Phelps in the pool. After a slow start, Michael closed out his final competition with four straight gold medals. This race also made Michael the first male swimmer to win an individual event at three straight Olympic competitions. Missy Franklin in women's 200 backstroke Franklin's 200 backstroke was one of the most dominating performances in the pool. She pulled out ahead early and dominated the race. Franklin also took down the world record in the process. It was very impressive to see Franklin dominate the competition in her greatest race. Read the full article in Yahoo! Sports.\n\nOlympics 2012: USA Swimming's Missy Franklin Ignites London as She Tops Week 1 Week 1 of the London Olympics seals to a close just as Week 2 will be quite the thrill. The main event of swimming brings plenty of story lines to the front page of the first week. From Phelps capping a career as the most decorated athlete in Olympic history, Lochte’s personal life becoming mainstream, or world records snapping like licorice only to be reset, one athlete has emerged and stormed the scene; 17-year-old Missy \"The Missile” Franklin. Competing in her first Olympics, Franklin stirred the swimming world with her stellar form and competitive force. Entering the games, Franklin certainly had plenty of pressure on her shoulders and as great athletes always do, she rose to the occasion. From the beginning, Missy Franklin lived up to the standard and notched a bronze medal in the Women’s 4x100 meter freestyle. A third-place finish was only the beginning before Missy gained traction on the competition. The Women’s 100-meter backstroke final was the perfect stage for Missy to shine; a gold medal slung around her neck which actually shined. Despite Franklin’s third final, 200-meter freestyle, ending in a fourth place finish, the race proved to merely be a minor bump in the road. Entering her fourth final, 4 x 200-meter freestyle, she teamed with Dana Vollmer, Shannon Vreeland and Allison Schmitt to not only nab her second gold medal, but the swimmers garnered an Olympic record at 7:42.92. Backstroke being Missy’s strength, the opportunity unfolded for another gold medal. Entering the 200-meter backstroke final, Franklin glistened as she set a world record of 2:04.06. With three gold medals and one bronze notched in her resume, one final attempt to grasp another stood on the line. The 4x100 meter medley matched Missy the Missile with three top USA swimmers to compete for gold. Again swimming with Dana Vollmer and Allison Schmitt, Rebecca Soni teamed up as the fourth swimmer for USA. The group placed each swimmer at their strength which means Missy Franklin backstroked to the lead. With Schmitt swimming anchor, USA finished almost two seconds ahead of Australia while setting a world record at 3:52.05. Franklin garnered her fifth medal of the 2012 London Olympics and her fourth gold medal of the Games. Franklin displayed quite the performances by showcasing an electrifying skill for Team USA. At only 17 years old, the new star not only takes home a handful of medals, yet in the running for someday being a great Olympian. Former Olympian and two-time gold medalist Mel Stewart voiced support for Franklin being one of the greatest Olympians, even comparable to Michael Phelps someday. Despite the high pressure, no one aside from Missy herself expected a stellar Olympics. After rising to the podium, USA Swimming will place their hopes in Missy Franklin continuing her pursuit for Olympic gold. Week 1 of the London Olympics provided Franklin with a chance to shine and take center stage in the packed week. Congratulations to Missy Franklin, and we all cannot wait for the 2016 Summer Olympics in Rio! Read the full article in the Bleacher Report.\n\nMark Kiszla: $150,000 Olympic bonus for Missy Franklin in NCAA red tape LONDON — Swimmer Missy Franklin could depart the Olympics with more than $200,000 to spend on a high school prom dress or college dorm furniture, but the ultimate worth of her heavy medal haul is tangled up in NCAA red tape. It's a big money question for Franklin, because the bonuses given U.S. Olympians for podium finishes at the Summer Games are the only major way this 17-year-old Regis Jesuit senior can reap a financial reward from five swimming medals and maintain her amateur standing. The NCAA, however, has been slow to notify USA Swimming whether Franklin will get a windfall or a relative pittance. It's crucial information Franklin needs when she discusses the pros and cons of turning pro upon her return to Colorado next week. Here's the breakdown of the cash in question: Each individual gold medal won by Franklin is worth $25,000 from the U.S. Olympic Committee's standard bonus. By winning the backstroke at both 100 and 200 meters, she is guaranted at least $50,000, plus lesser dollar amounts as a member of three American relay teams that captured a medal. That's money Franklin can keep with no impact upon her amateur status with the NCAA, according to USA Swimming spokesperson Karen Linhart. But here's where it gets really interesting and more than a little confounding. USA Swimming bumps the reward for each individual gold medal by a sweet $75,000. Although contacted well before Franklin made a major splash in the Olympic pool, NCAA officials have not informed USA Swimming if acceptance of this additional $150,000 in earnings would make Franklin ineligible to compete for California-Berkeley, Georgia or any other college program she might choose. Repeat: We're talking about $150,000. That's not chump change for most American families, including the Franklins. To put it nicely, the rulebook of amateur sports is a puzzle, at best. The NCAA is a bureaucracy that too often places athletes far down its list of priorities. While Franklin can pocket the basic gold-medal bonus from the USOC, accepting a $50,000 bonus won by setting a world record in the 200 back is strictly prohibited, unless she wants to turn pro. Scratching your head? Me, too. After unheard of success for a teenage swimmer, Franklin is entering uncharted waters. With sponsors interested in signing the new face of U.S. swimming as an endorser, it would be easier for Franklin to say no if she could put more than $200,000 in the bank from Olympic bonuses. \"She is going to college. Mom has spoken. And she wants to go to college,\" said D.A. Franklin, the swimmer's mother. \"The point is: Will she swim with a college team and compete? Or turn pro and just practice with the coach where she goes to college?\" The NCAA is very efficient at profiting from its athletes' labors through a lucrative contract for March Madness. The NCAA is quick to rule athletes ineligible when they mess up. Why would the NCAA not want to support Franklin's desire to compete in college? Let her keep the Olympic money. All of it. Read the full article in The Denver Post.\n\nOlympics: Missy Franklin's Pop Culture Must List There are so many reasons to cheer for Missy Franklin. Winning five medals, four of them gold, at the London Games, the six-foot one-inch 17-year-old embodies the future of USA Swimming at the Olympics. Missy’s also committed to the purity of the sport, having turned down endorsement deals and agency representation in order to retain her amateur status and compete in NCAA swimming after she graduates next year from Regis Jesuit High School in Aurora, Colorado. Following Aurora’s tragic movie theater shooting on July 20, she dedicated her very first gold medal, in the 100 meter backstroke, to the victims–and she continues to swim competitively with her high school team. In short, Missy’s a winner in and out of the pool. And she has great taste when it comes to pop culture too. What has Missy been watching, reading, and listening to on her quest for the gold? EW got the Olympic Champion to share, via email, her own Must List of movies, TV shows, books and music that she’s brought with her to enjoy during her down time in London. Missy Franklin’s Must List Movies I’ve Brought With Me to London: ”Tangled was a definite must-bring. And I’m borrowing the movie Despicable Me from a teammate.” The Must List: Get the latest news, photos, and more My Favorite Work-Out Music: ”Right now, I’ve been listening to a lot of Jason Derulo and Rihanna. Basically, anything with a good beat is great to work out to. When I’m trying to relax and cool down, I really enjoy listening to Jack Johnson. And I just downloaded JB’s new album. That’s Justin Bieber, for you. It’s fantastic!” [Bieber also tweeted his congratulations to Missy for her gold-medal performance in the 100 meter backstroke.] My Favorite TV Shows: ”I love Pretty Little Liars and Teen Wolf.” My Favorite Read: ”The Hunger Games, for sure!” Now that her competition is over, Missy hopes to switch from athlete to tourist. Her first stop? Visit Buckingham Palace. And then, after she’s soaked up enough local color in London, she has a special request for her parents: “After the Olympics are over, I’m hoping that I can convince my mom and dad to take me to Paris to see the Eiffel Tower, especially since it’s so close to London.” Mom and Dad, we hope you’re listening. Read the full article at Entertainment Weekly.\n\n2012 Olympics: Medal count climbs, Missy Franklin and Michael Phelps are golden On August 4, after eight days of athletic competition at the 2012 Summer Olympics in London, the medal count continued to climb for Team USA, which maintained its first place position on Saturday. In other Olympic news, veteran Michael Phelps and Olympics newcomer Missy Franklin both won gold medals in their last swims at the London Summer Games. As it did on day seven, the United States topped Olympics powerhouse China in the total medal count on day eight. Team USA and China both won five gold medals on Saturday. Since the opening ceremony of the 2012 Olympics more than one week ago, the United States has won 54 total medals and 26 gold. China has claimed 53 total medals and 25 gold ones. On August 4, the United States won the following Olympic medals: Gold in women’s 50m rifle shooting\n\nGold in women’s singles tennis (Serena Williams)\n\nGold in men’s doubles tennis (Mike and Bob Bryan)\n\nGold in women’s 4x100 medley\n\nGold in men’s 4x100 medley\n\nSilver in men’s 10,000m (Rupp)\n\nSilver in women’s 100m (Jeter)\n\nSilver in women’s team pursuit track cycling\n\nBronze in men’s long jump\n\nBronze in men’s rowing Rival China won gold medals in women’s singles badminton, women’s doubles badminton, men’s 20km walk, men’s 1500 free swim, and women’s fencing on Saturday. America’s closest competitor in the medal count also won two silver and four bronze medals on the eighth day of Olympic competition at the 2012 Olympics in London. Host country Great Britain won six gold medals on August 4 in men’s 10,000m, women’s heptathlon, men’s long jump, women’s team pursuit track cycling, men’s rowing, and women’s rowing. Team GB also won one silver medal on Friday. Below are the top medal winners at the 2012 London Olympics, as of the end of day on August 4. ”G” stands for gold, “S” for silver, “B” for bronze, and “T” for total. United States: 26 (G) + 13 (S) + 15 (B) = 54 (T)\n\nChina: 25 (G) + 16 (S) + 12 (B) = 53 (T)\n\nGreat Britain: 14 (G) + 7 (S) + 8 (B) = 29 (T)\n\nRussia: 3 (G) + 15 (S) + 10 (B) = 28 (T)\n\nJapan: 2 (G) + 10 (S) + 12 (B) = 24 (T)\n\nFrance: 8 (G) + 6 (S) + 8 (B) = 22 (T)\n\nGermany: 5 (G) + 10 (S) + 6 (B) = 21 (T)\n\nAustralia: 1 (G) + 12 (S) + 7 (B) = 20 (T)\n\nSouth Korea: 9 (G) + 3 (S) = 5 (B) = 17 (T)\n\nItaly: 5 (G) + 5 (S) + 3 (B) = 13 (T)\n\nCanada: 1 (G) + 3 (S) + 6 (B) = 10 (T)\n\nNetherlands: 3 (G) + 1 (S) + 4 (B) = 8 (T)\n\nNew Zealand: 3 (G) + 0 (S) + 4 (BR) = 7 (T)\n\nRomania: 1 (G) + 4 (S) + 2 (B) = 7 (T)\n\nBelarus: 1 (G) + 2 (S) + 3 (B) = 6 (T)\n\nBrazil: 1 (G) + 1 (S) + 4 (B) = 6 (T)\n\nUkraine: 2 (G) + 0 (S) + 4 (B) = 6 (T)\n\nCuba: 2 (G) + 2 (S) + 1 (B) = 5 (T)\n\nDenmark: 1 (G) + 2 (S) + 2 (B) = 5 (T)\n\nHungary: 2 (G) + 1 (S) + 2 (B) = 5 (T)\n\nKazakhstan: 5 (G) + 0 (S) + 0 (B) = 5 (T)\n\nNorth Korea: 4 (G) + 0 (S) + 1 (B) = 5 (T) After eight days of competition, the total medal count for all countries stands at 138 gold, 140 silver, and 150 bronze, for a total of 428, as of the end of day on August 4. In other 2012 Olympics news, Saturday was a golden one for newcomer Missy Franklin and veteran Michael Phelps from Team USA. It was the American swimmers’ last races in London and both ended on high notes and resulted in two more gold medals for the United States, inching up its medal count even higher on Saturday. For her swan song at the 2012 Olympics, Missy Franklin teamed up with Rebecca Soni (breaststroke), Dana Vollmer (butterfly), and Allison Schmidt (freestyle). Franklin got Team USA off to a great start and her teammates did their part to not only win the 4x100 women’s medley, but to finish the final with a new world record. Afterwards, Franklin talked to the press about Michael Phelps and her performance at the 2012 Olympics. “I don’t think his shoes will ever be filled. Hopefully, I can make little paths next to him.” Franklin did much more than make little paths in London. The spirited teen, who just had her braces taken off, blazed new trails and became America’s newest Olympic hero. After winning five medals (four gold and one bronze) at the 2012 Olympics, it seems like Franklin is destined for greatness in a post-Phelps world of Olympic swimming. Michael Phelps ended his illustrious swimming career with a gold medal win in the 4x100 meter medley. Matt Greevers (backstroke), Brendan Hansen (freestyle), and Nathan Adrian (freestyle) joined Phelps in the pool for his final farewell. On his leg of the relay, Phelps swam the butterfly to perfection and reclaimed the lead for Team USA, which won gold with a time of 3:29:35. Japan took the silver and Australia was awarded the bronze medal. Afterwards, Michael Phelps spoke to the international press and said of his final Olympics swim, \"I could probably sum it up in a couple of words and just say, 'I did it.’ Through the ups and downs, I've still been able to do everything that I've ever wanted to accomplish. I've been able to do things nobody's ever done and that's what I've always wanted to do. The memories I have for this week will never go away.” So, Michael Phelps ends his Olympic career on a high note after thrilling an international audience for a dozen years. He became the most decorated Olympic athlete ever in London. Phelps won four gold and two silver medals at the 2012 Summer Games. His accomplishments are simply mind-boggling and include: Greatest Olympic champion of all time\n\n51 Olympic swims\n\nSwam nearly 10,000 meters and 198 lengths of the pool in Olympic races\n\nTonight’s relay was his 24th Olympic final\n\nIn addition to his 18 gold medals, Michael Phelps has also won two silver and two bronze medals. For his twelve years of Olympic excellence and incredible moments, America says to Michael Phelps, “Thanks for the memories.” His legacy will live on forever. Olympic competition continues on day nine. The NBC prime time highlights on Sunday, August 5 include one of the Games’ marquee events, the men’s 100m track and field race. Usain Bolt, Yohan Blake and Justin Gatlin will take their marks to determine the fastest man in the world. Other track and field finals include the women’s 400m and triple jump. In gymnastics, the men’s individual floor and pommel horse finals air, as does the women’s diving springboard final. Plus, the beach volleyball quarterfinals are on tap for prime time on NBC. For a complete list of Summer Olympics televised events, go to NBColympics.com and enter your zip code for area-specific information. Read the full article in the Examiner.\n\nMissy Franklin ready to follow in Phelps' footsteps Teenage US swim star Missy Franklin has said she is ready to follow in Michael Phelps' golden footsteps after she collected four gold medals and broke two world records on her Olympic debut in London. Over the eight-day swim programme, the bubbly 17-year-old -- who smatters each interview with the word 'awesome' -- won the 100m and 200m backstroke titles, plus earned golds with the US 4x200m freestyle and 4x100m medley relay teams. She broke Kirsty Coventry's three-year-old women's 200m backstroke world record and on Saturday swam the opening backstroke leg of the 4x100m medley relay which bettered the world record set by China in 2009. Franklin will be just 21 at the next summer games in Rio de Janeiro, and has proved she has the potential to win many more titles and has learned from watching Phelps end his career in London to bow out with 18 Olympic golds. \"Getting to know Michael, to cheer for him, to watch him and see him become the most decorated Olympian of all time has been awesome,\" she said. \"It is so inspiring for me and gives me so much motivation. \"I don't think his shoes will ever be filled. I think his footsteps are huge, but maybe I can make little paths of my own next to his.\" At 6ft 1in, Franklin has size 13 feet (\"We call them built-in flippers,\" says her father) and she announced herself with five medals, including three golds, at last year's world championships in Shanghai. She has shunned numerous endorsement and sponsorship deals to remain an amateur and one lucky US college is going to gain a four-time Olympic champion when she graduates from her Colorado high school next year. \"Over the next four years, I know I'll have so much fun, I have my senior year, I need to pick a college and go there,\" she said. \"That is what I am focusing on now and hopefully I'll be at 2016. \"I am definitely just taking (each Olympics) one at a time, I have taken so much motivation from being on that podium and seeing the flag go up.\" Despite possessing the stamina to have won eight gold medals in Beijing, even Phelps was heard to mutter 'how do these girls have so much energy?' before watching Franklin breeze through her seven-event programme in London. \"I got all my energy from my team-mates and coaches, they have been incredibly supportive,\" she said. \"Just getting out of each race and seeing everyone with a smile on their face saying 'congratulations, only so-many more race'. It is awesome to have that support.\" Despite a barrage of questions, Franklin breezed through each press conference in London with giggles and smiles. Her girl-next-door charm makes her an ideal candidate for her future plans to be a broadcast journalist. \"We can all get a little grumpy. Being here in this type of experience with these team-mates around me, it is impossible to get grumpy,\" she said when asked if she ever gets the blues. Franklin insists she has picked up numerous tips from watching Phelps bring down the curtain on his career with four gold medals and two silvers in London to finish as the most decorated Olympian of all time. \"Just watching Michael swim is beautiful,\" she said with awe. \"Just what he does and watching him move through the water, you can tell he does what he is meant to do. \"To see that and be on team with him. He is a huge part of Team USA, he has done so much for swimming and we are all going to miss him so much.\" Read the full article in Yahoo! Sports.\n\nLondon Olympics: U.S. swimmer Missy Franklin acts her age, joyfully LONDON -- The kid was barely out of the pool, droplets still falling from her outrageously pearly earrings and brightly painted nails, when she first considered what had just happened.\n\n\n\nMissy Franklin laughed and laughed. \"I just won an Olympic medal!\" she shouted.\n\n\n\nPHOTOS: Day three of swimming\n\n\n\nThe kid was at the end of her news conference, her smile still 50 meters wide, when she finally dug into her pocket, unwrapped that medal, and stuck it into the air as if showing off a good report card.\n\n\n\nMissy Franklin laughed and laughed.\n\n\n\n\"Isn't it pretty?\" she said.\n\n\n\nIt was dazzling. It was delightful. It was a shower of 17-year-old innocence on these testy old Olympics, a perpetually bright American high school girl momentarily rinsing away increasing cynicism and doubt with a giant giggling splash.\n\n\n\nMelissa Jeanette Franklin swam till she dropped in the 100-meter backstroke Monday, rushing through it like an afternoon at the mall, the swim team's Most Likely to Succeed winning her debutante gold.\n\n\n\n\"You still feel like you're dreaming,\" she said. \"I still feel like someone needs to pinch me.\"\n\n\n\nSomeone needs to pinch the rest of us. In an Olympic swim competition dominated by the ever-so-cool Ryan Lochte and Michael Phelps, how much fun is it to watch a teenage girl treat these Games as if she has a crush on them?\n\n\n\n\"The minute she walks out of the pool, she reminds you that she's 17 years old,\" said her longtime coach, Todd Schmitz.\n\n\n\nIt was a victory that she prepared for by boogieing with teammate Allison Schmitt in the team room.\n\n\n\n\"They had the music turned way up and they were dancing and other swimmers looked in like, 'What are they doing?' \" said Schmitz.\n\n\n\nIt was a victory that she celebrated during the medal ceremony by forgetting the words to the national anthem, her freckled cheeks quivering beneath oncoming tears.\n\n\n\n\"I was trying to sing, I was crying at the same time, I forgot the words, I didn't know what I was doing, I was a huge mess,\" she said.\n\n\n\nIt was a victory that was even more impressive because it came in a race just 14 minutes after she was in the pool qualifying for the 200-meter freestyle. It was the sort of short turnaround time that even Phelps said he has never experienced. It was hampered by the fact that Franklin was so happy being in the pool after the qualifying, she sort of forgot to jump out and get ready for her big moment.\n\n\n\n\"I'm like, c'mon, c'mon, get out of the pool, let's go!\" said Schmitz.\n\n\n\nFranklin is not typical. She's not tiny. She's not sculpted. She's not rehearsed. She's 6 feet 1 with size-13 shoes. She once fretted that no boy would like to date a girl like her, leading her parents to buy an inspirational book called \"Big Girl in the Middle.\" Watch the video and read the full article at the Chicago Tribune.\n\nFun just beginning for Franklin, Ledecky LONDON -- One is so young she's dreaming about securing her learner's permit (the driver's license is a year away). The other, the new world-record holder, simply yearns to return home to slip into a pair of overalls. Overalls? Do Olympic gold-medal champions actually wear overalls? Missy Franklin does. It's a tradition in her town of Aurora, Colorado, to decorate them each Friday before the big football game. \"I can't wait for that,\" she beamed. Franklin added a third gold medal (fourth overall) in the pool Friday by setting a new world record in the 200-meter backstroke. Throughout these Games, she has dedicated her performances to the victims of the horrific movie theater shooting in her beloved Aurora. Even at 17, Melissa Jeannette Franklin has grasped the weight of her accomplishments and the impact her actions can have on a community, whether it's a Colorado town steeped in tragedy or the U.S. swimming program in search of a new identity. As Michael Phelps butterflied his way toward retirement with yet another gold medal of his own Friday, Franklin expanded on her emergence as the sunny (future) face of American swimming. She flew to London with substantial expectations in tow and delivered with a smile. Franklin could reap millions from her incredible swimming portfolio, yet continues to eschew endorsement opportunities in favor of the chance to enjoy a normal college experience. (That is, whatever \"normal\" means when you will be an Olympic champion and a household name taking freshman English). As the media gathered in the basement of the Aquatics Centre to interview -- and coronate -- Franklin after her record-breaking race, an amazing development began simultaneously unfolding upstairs. Fifteen-year-old American Katie Ledecky had burst into the pool and seized the lead in the 800 freestyle. Ledecky, the youngest American on any of our nation's Olympic teams, was not expected to win this race. British swimmer Rebecca Adlington, who won the gold and set a world record in Beijing in 2008, was the favorite and anticipated yet another spirited battle with rival Lotte Friis. But the teen from Bethesda, Md., had other ideas. After watching Missy win gold, then receiving a high five from Phelps after his gold-medal race, Ledecky was, she said, \"really pumped up.\" It was quiet in the Ready Room before her race, but as she watched Franklin touch first, Ledecky wanted to squeal with joy. \"Instead, I kept it to myself, and used it as extra energy,\" she said. The naysayers in the interview area predicted a crash and burn for the frisky teenager in the final laps, but Ledecky kept up a world-record pace until the final few meters. Her stunning victory, following gold-medal performances from Lithuanian Ruta Meilutyte and Chinese swimmer Ye Shiwen, has sounded the alarm that a new generation of swimmers are prepared to step up to the podium, with 17-year old Missy Franklin as their pied piper. \"My coach said this has turned into the Youth Olympics,\" Franklin said. Todd Schmitz is right. Consider Adlington, who was just 19 when she struck gold in Beijing. Now 23 years old, she had to \"settle\" for two bronze medals, a disappointment for a host country that had hoped for much more from one of their signature athletes. \"I've changed so much [since I was 19],\" Adlington said. \"My body can't recover as quickly. Everyone says, 'You're so young,' But in distance swimming, I'm really not.\" Ledecky is so young, she can't vote, rent a car, drive a car or purchase a ticket to an R-rated movie. Then again, in these Games, she is not alone. Told there were six teenagers who won gold, Ledecky answered, \"I noticed that.\" After Shiwen's world record in the 400 individual medley, American coach John Leonard questioned whether the 16-year old swimmer was doping. Ledecky was forced to address similar questions in the wake of her victory Friday. \"Absolutely false,\" she said without blinking when asked about the possibility of doping. Ledecky swam the 800 free in 8:36.05 a year ago at the Junior Nationals, but, she maintains, it has been hard work and a steady progression of training that has enabled her to shave so many seconds off her time. Last fall, Ledecky and her coach, Yuri Suguiyama, began discussing the Olympic trials. When Suguiyama asked her what the ultimate goal in that situation would be, Ledecky answered it with a question: \"To qualify for the Olympics?\" \"We won't tell anybody,\" her coach answered, \"but that will be our goal.\" Somewhere along the way, that goal became obsolete. Showing up at the Olympics wasn't enough. Ledecky said she understands why so many people are astonished by her performance. \"I didn't really expect gold,\" she deadpanned, \"but I'll take it.\" Franklin was the overwhelming favorite in her 200 backstroke race, but sometimes those are the hardest victories to bring home. It has been a magical summer for Franklin, who has done everything she hoped for this, save one thing: She wanted to teach swimming lessons to young kids, but simply did not have the time. \"Those kids are our future,\" she explained. \"When I see young swimmers loving it so much, it reminds me of why I love it.\" Ledecky remembers the first swimmer who made a lasting impression on her as a 6-year-old; his name was Michael Phelps, and, after she had a chance to say hello to him, he signed an autograph for her, patted her on the back, and went on his way. Nearly nine years later, they shared a pool, a high-five and Olympic gold. London is Phelps' fond farewell. But for the kid without a license and the girl with a closet full of overalls, the fun is just beginning. Watch the video and read the article at ESPN.\n\nMissy Franklin never dreamed of setting a world record LONDON — Missy Franklin, the little girl who put Olympic rings on her bedroom wall before running across the street to Centennial's Heritage Greens pool, never talked about it. Oh, she talked about Olympic Games and Olympic medals, of new friends and new experiences. But setting world records? No. Too abstract. Well, Friday night, Franklin's Olympic dreamland found a new property. She went beyond the call of duty of winning the 200-meter backstroke as a heavy favorite. She went out and shattered the world record. Her 2:04.06 was nearly a second faster than the 3-year-old mark of 2:04.81 set by Zim-babwe's Kirsty Coventry. Franklin is not only the fastest 200 backstroker in the world, she's the fastest who ever lived. Then she had a confession. Maybe she didn't talk about a world record, but she dreamed of one. \"It means so, so much to me,\" Franklin said. \"I think every young swimmer and athlete dreams of getting a world record, and for that to actually happen is unbelievable. I remember when I broke my first one in the 200-meter short course, Michael (Phelps), he was there with me, and he said, 'You know, your first one is your best.' \"I was like, 'Oh, don't tell me that!' But I think this one gave it a run for its money.\" Franklin's Olympics is becoming one for the ages. She's won three gold medals and four overall. She swept the two backstroke events and her 400-meter medley relay team should be favored for gold Saturday. Franklin could well return to Regis Jesuit High as a senior with four gold medals and a bronze, not necessarily around her neck but around her legacy. Sweeping the backstroke wasn't surprising. She had the world's best times coming into the meet. But no one discussed Franklin and world records. Not now. Not at age 17. \"It was always just about splitting for a best time,\" Franklin said. \"It's just, how can we be faster? How can we can make ourselves better, not how can we be the fastest in the world.\" Turns out, she was inspired by watching television. She saw an AT&T ad that has stuck with her through this first week. \"It had someone watching a race and right there her time went up, her gold time, (it said), 'This is the new possible,' \" she said. Of all the swims in this Olympics, this one had as little suspense as any. Franklin, who worked to improve her starts for six weeks before London, got off to a blazing start and led wire to wire. Already the American record holder, she had half a body length's lead after 50 meters, nearly a second-and-a-half lead on silver medalist Anastasia Zueva of Russia at the 100 mark and stretched it to two seconds with 50 left. \"She really had to be aggressive and build the first 50 and attack her walls,\" said Todd Schmitz, her personal coach. \"We have focused on her third 50 and staying tough.\" Franklin's 2:04.06 was well ahead of Zueva's 2:05.92. American Elizabeth Beisel was third in 2:06.55. After the race, Beisel leaned over the lane rope and hugged Franklin as if she'd never let go. \"Missy, right now in backstroke, is unbeatable,\" Beisel said. Franklin's last race is Saturday at 1 p.m. MDT. Her 400-medley relay teammates qualified fourth behind Australia, Japan and Denmark. But Franklin and Rebecca Soni, who swept the two breaststroke events and with Franklin led the U.S. to the world championship last summer, didn't swim in the semifinals. On the podium stand, as she held up her medal with Zueva and Beisel, Franklin looked into the TV camera and tried pushing her smile farther for the world to see. She couldn't do it. Over the last seven days it is a smile that has crossed miles. And Friday night, as her golden Olympics nears an end, it's a smile that has stretched through history. Read the full article in The Denver Post.\n\nMissy Franklin's sunny outlook on life Missy Franklin blew off the Great Phelps. \"Advice?\" Franklin said to Michael Phelps, but not in words. \"Nah, I'm good, dude.\" Before the swimming started in London, Phelps said he had reached out to Franklin, offering her advice on handling the Olympics. \"I've always said to her if she ever needs advice, don't hesitate to ask, about anything,\" Phelps said. \"She hasn't asked, so I don't force things into her ears.\" Phelps mentioned Franklin's famous ebullience, how she was bouncing off walls at the team-uniform distribution, and the 27-year-old vet sounded downright parental when he warned that the 17-year-old Franklin had no idea the minefield she was about to swim through. Franklin, asked why she never took Phelps up on his offer, looked sheepish. She said she got plenty of advice from U.S. coach Teri McKeever and Missy's female teammates. But sure, she'd check in with Michael at some point. Was Franklin being clueless? Naive? No. Just quietly confident and, in her own way, as smart as the Great Phelps. Franklin bounced off walls for eight days, loosened up her older teammates, lit up the pool with her smile, and acted like a teenager who had won a free trip to the Olympics. Friday night, Franklin won the 200-meter backstroke in world-record time for her third gold medal. Earlier she won the 100 backstroke and was on the winning 400 freestyle relay. She also grabbed a bronze for the 800 freestyle relay. Maybe Phelps should have gone to Franklin for advice. He won two individual golds himself, but Phelps didn't get untracked until he kind of loosened up, got into more of a don't-worry-be-happy Missy-like mode. Teammates say she gets serious about 20 seconds before a race. Of her win Friday, Franklin said, \"I knew I was going to take it out and have fun, and that is what I did. I am the happiest girl alive!\" Yes, she always speaks with exclamation marks. Yes, she always smiles. It's her default expression and comes in various sizes. Does she wear people down? Apparently she pumps 'em up. \"Her personality is contagious,\" said U.S. teammate Elizabeth Beisel, who took the bronze Friday. \"In the ready room I was pretty nervous, and just watching her have so much fun, it really made me relax, and I have to thank her for that.\" Franklin isn't the first teenager to arrive at the Olympics carrying the weight of potential greatness. In Beijing it was Katie Hoff, 19, who was going to be the female Phelps. Hoff has said, \"I had a good amount of press (in 2004) and didn't know how to handle it. In '08 I had double the amount of press, and I knew how to handle it, but I didn't enjoy it.\" In Beijing Hoff won one silver and two bronze. Hardly Phelpsian. Franklin is the anti-choker. She handled the press in London by not handling it, rather by talking to it like it was real people. And she certainly did enjoy the experience. Franklin wasn't the only teen sensation in the pool this week. Chinese 16-year-old Ye Shiwen astounded everyone with her finishing kick in the 400 IM. London's Daily Mail newspaper sent a reporter to Ye's hometown to interview her parents. They told of their only child being selected at age 6 to be schooled in an elite full-time swim program. At 11 she turned \"pro\" and entered what was basically a work camp for kiddie phenoms, one of 20 selected from a pool of 20,000 candidates. Between ages 11 to 14, Ye was allowed one brief visit with her parents each week and one brief phone call home, many of them very tearful. The parents talked of missing their daughter terribly, but Ye's mom said, \"In the West, you pay a coach to turn you into an athlete. But in China, the state pays, so you have to sacrifice something in return.\" That one story doesn't mean that every Chinese athlete is groomed on an athletic chain gang. But it's kind of nice to know that it's not the only way a champion can be built. There is, thankfully, the Missy Franklin model. She is self-motivated and driven by love of the sport, and actually has a life outside the pool. It includes proms and pillow-fight sleepovers and goofy high-school stuff. Friday she talked about going home to Colorado, to her family and pals. \"My high school is so incredible,\" Franklin gushed. \"They all see me as Missy, and I don't think that's going to change at all. When I get back there, I'm just going to be regular old Missy again.\" Franklin admitted that she hit an occasional physical wall in London. \"I had a few times,\" she said, \"where it was hard not just to sit down and go, 'I'm exhausted, I'm so tired.' Those are the times when it's most important to keep a smile on your face. To get up and say, 'You know what? So many people would kill for this opportunity.' \" What's worth more? Gold medals, or that kind of outlook and perspective? Well, Franklin's medals will get put away. The smile, she'll wear wherever she goes. Read the full article in the San Fransico Chronicle.\n\nMissy Franklin wins Olympic gold No4 but Team GB swimmers flounder Missy Franklin won her fourth gold medal of London 2012 to give the USA a record-breaking victory in the women's 4x100m medley relay and cement her place as one of the greatest young Olympians. Franklin carved out a strong lead in the first leg, her assured backstroke giving her team a comfortable edge that was maintained by Rebecca Soni, Dana Vollmer and Allison Schmitt through the breaststroke, butterfly and crawl. The Americans' victory set a world record of 3min 52.05sec, shaving 0.14 off 's previous mark. , who finished in 3:54.02, took silver, with claiming bronze in 3:55.73. The USA team hugged each other after their win, safe in the knowledge that their performance had guaranteed their country's continuing domination of swimming. \"I honestly couldn't think of a better way to end it; that was so perfect in every way,\" Franklin said. \"It was the most fun relay I've ever been on. These relays have been so exciting. Every single team in the ready room tonight was laughing and joking.\" Reflecting on her first Olympics, Franklin added: \"I am going to miss this so much. I'm really excited to meet up with my family and explore London a little bit, but I'm so sad it's all over. I've learned so much from this experience and I can't wait to take that home with me.\" The swimmer, who is 17, had already won three golds and a bronze in the 100m backstroke, 200m backstroke, the 4x200m freestyle and the 4x100m freestyle. Her record haul has marked her out as one of the exceptional swimmers of London 2012, and a worthy heir to her compatriot Michael Phelps. He marked his final Olympic race by helping the men's 4x100m medley relay team to gold with a ferocious butterfly leg. The USA finished in 3:29.35, followed by in 3:31.26 and in 3:31.58. It was Phelps's 18th Olympic gold. Britain's medal hopes took another battering after Fran Halsall finished fifth in the women's 50m freestyle final. Ranomi Kromowidjojo of the took gold with an Olympic record time of 24.05, followed by Aliaksandra Herasimenia of and Marleen Veldhuis of the Netherlands. Halsall had entered the final with the fifth-fastest qualifying time and walked out to the pool side to a massive cheer from the crowd but was comprehensively beaten on the night. She was also part of the women's 4x100m medley relay team who finished last. Halsall and her team-mates Gemma Spofforth, Siobhan‑Marie O'Connor and Ellen Gandy touched in for eighth place with a time of 3:59.46 There was more bad news for Team GB in the gruelling men's 1500m freestyle final, with Daniel Fogg coming last in a race that was won by 's Sun Yang, who set a world record of 14:31.02. \"I was hoping for something a bit better than that and to get a best time,\" Fogg said. \"The field was so stacked with world champions, world record holders, Olympic record holders. To be in that calibre of athletes and to give them a decent race – I cannot be too disappointed with that.\" The results were a further disappointment for the Team GB team, who have failed to live up to the promise of Beijing and are well behind their target of at least five medals. So far, they have won three: a silver from Michael Jamieson in the men's 200m breaststroke and two bronze medals from Rebecca Adlington in the 400m and 800m freestyle. Adlington took third place in the 800m on Friday, despite qualifying for the final with the fastest time. Gold went to the 15-year‑old American Katie Ledecky, who won with the second fastest time in history. Although Adlington had been on top form throughout the year, Ledecky emerged as a serious threat at the USA Olympic trials in June when she set a time that was second only to Adlington in 2012. Despite claiming after the race that she was not disappointed with the result, the 23-year‑old admitted the pressure engendered by her double triumph in Beijing had at times been hard to bear. Asked whether retirement was on her mind, Adlington said: \"I don't really know, to be honest. Obviously I still love the sport or I wouldn't be upset.\" As fears grow over what the missed medal target will mean for the sport's funding in the UK, eyes will turn towards Keri-Anne Payne, who competes in the 10km open water event on Thursday. Read the full article in The Guardian.\n\nMissy Franklin Wants to Swim in College, Put Off Endorsement Fortunes If the experience of past Olympians is any guide, gold-medalist swimmer Missy Franklin could be be swimming in money after she heads home to Colorado from the London games. But the teenager has defied conventions in nearly every aspect of her path to London, where she has already won three gold medals and one bronze. Now Franklin, 17, will forgo immediate fortunes in endorsements and prize money to remain an amateur. In an indication of what Franklin is passing up, gymnast Gabby Douglas -- America's other darling of the Olympics -- will appear on a special-edition box of Corn Flakes, Kellogg announced Friday. Rather than star on a cereal box, Franklin would like to compete in college. Skipping endorsement deals and the promo-laden route to Michael Phelps-like celebrity is the latest in Franklin's I'll-do-it-my-way style. Her income from deals would likely be \"in the millions,\" according to Ronald Oswalt, CEO of the San Marcos, Texas-based Sports Marketing Experts. Franklin, who will soon be a high school senior in Aurora, Colo., has already turned down $100,000 in prize money and many times that in endorsements, the Wall Street Journal estimated. But Franklin's decision to maintain amateur status, a requirement for competing in the NCAA, might have a long-term personal payoff, if not a financial one, said Oswalt, who specializes in connecting athletes with sponsorships. \"Winning a gold medal can be priceless, but cashing in on the glory could or couldn't turn into happiness,\" he said. Oswalt applauds Franklin's parents for not pressuring her to reap monetary rewards from her success in the pool. \"So many parents push their kids,\" he said. \"They think the Olympics are going to be their payday, but her dreams have already come true.\" The decision might also have been a prudent one because of the pressures that high-profile endorsements bring, said Evan Morgenstein, a sports agent who has represented U.S. Olympic swimmers Dara Torres and Janet Evans. With endorsements come many requirements and, often, a commitment to perform for years, he said. Franklin's decision could not have surprised those who have followed her unorthodox career. Since age 7, Franklin has stuck with the same coach she was paired with the first day she walked into a Colorado swimming club, which did not even own its own pool. She did not move to a part of the country known for producing swimming gold medalists like Florida or California. Her coach, Todd Schmitz, is now a member of the U.S. Olympic coaching staff. Franklin's famous versatility in the pool -- she qualified for seven events in London, two of them the very different backstroke and freestyle -- is a result of her unconventional refusal to specialize in a single stroke early on. Franklin only endeared herself more this week when she dedicated her Olympic victories to the victims in her hometown of the movie theater massacre that killed 12 and injured 58. \"Everything I've done here is for them,\" she said immediately after breaking the 200-meter backstroke world record for her third gold medal. Even without appearing on television for sandwich commercials, as Phelps famously did, Franklin's cheerful demeanor has long made her a media sweetheart. After a triumphant trip to London, she is likely to keep that status, even if she does it from a collegiate swimming pool. And after all, Oswalt said, she is only 17. \"She should enjoy her senior year,\" he said. \"She can make a decision in 2014 or 2015. She still has time.\" Read the full article and watch the video at ABC News.\n\nMissy Franklin, Dana Vollmer help U.S. women set world record in 4x100 medley relay LONDON - The United States set a world record to win the women's medley relay at the London Olympics on Saturday. The Americans clocked 3 minutes, 52.05 seconds, slicing 0.14 off the previous mark set by China at the 2009 world championships at the height of the high-tech bodysuit era. Missy Franklin swam the leadoff backstroke leg, Rebecca Soni did the breaststroke, Dana Vollmer competed in butterfly and Allison Schmitt had the anchor leg in freestyle. The 17-year-old Franklin, who starts her senior year in high school this fall, finished the meet with four golds and a bronze, while Schmitt leaves with three golds, a silver and a bronze. Australia touched in 3:54.02 to take the silver medal and Japan finished in 3:55.73 to take bronze. Read the full article in Newsday.\n\nPhotos: Missy Franklin helps U.S. medley team to gold, world record LONDON — Missy Franklin led the way as the United States set a world record in the 4×100 medley relay Saturday, giving the Regis Jesuit student her fourth gold medal of these Olympics. Franklin gave her team the lead with a 58.5 second split in the first leg, swimming the backstroke. The U.S. never trailed after that, and finished in 3 minutes, 52.05 seconds to best the previous mark of 3:52.19 set by China in 2009. Read the full article and see photos at The Denver Post.\n\nVideo: Missy Franklin on Today show gives shout out to the Rowdies Missy Franklin's races in the 2012 London Olympics are over, but her victory laps are only beginning. This morning, Franklin was a featured guest on the Today show, and as you'll see in the video below, she used her moment in the spotlight to give a shout-out to plenty of people in her lives, including...the Regis Jesuit Rowdies? The Rowdies, by the way, are a sort of boys cheer squad at Regis. They specialize in dressing up in costumes and hyping the crowd at football games -- the attendance of which was the first thing that Franklin mentioned when listing what she's looking forward to in her senior year at high school. Franklin also said she'd be having a post-games conversation about going pro -- something that would allow her to accept the sort of endorsement offers that are flooding her right now. However, she still has a hankering to attend college, and in a conversation with Bob Costas last night, she listed off schools she was considering, including Cal-Berkeley, Texas, USC and the University of Georgia -- with the last mention spurring an article in the Atlanta Journal-Constitutionasking readers to react to Missy potentially becoming a Bulldog like teammate Allison Schmitt. Among the reactions: Yes. Would definitely catch a meet when in Athens during swim season. It's funny that the schools she mentioned are ones that have heavy influences on the US Swim Team. Hopefully her friendship with Allison Schmitt will help her choose UGA. As for you unmentioned Colorado schools, better start recruiting Franklin...now! Here's her Today show appearance. Read the article and watch the video at the Westword.\n\nFranklin looking forward to going to the Prom and being Just Missy But ahead of the final day of the swimming competition at the Games the 17-year-old said that she was now looking forward to returning to her high school in her home town of Centennial in Colorado. \"I want to go to the Prom and am just excited to go home and go back to school,\" she said. Asked if she was not worried that the other kids in school would look at her differently after her Olympic success and if it could not frighten boys from asking her to the Prom, the Regis Jesuit High School pupil said that she did not think so. \"My school is just so incredible. They just see me as Missy and support me. I am sure when I go back, I will just be regular old Missy again,\" she said. Franklin, who won the 200-metre backstroke in 2 minutes 04.06 seconds on Friday, beating Kirsty Coventry's mark from the world championships in Rome in 2009 by 0.75 seconds, said swimming a world record was terrific. \"When I swam my first one in short course, I felt wonderful, but then Michael Phelps told me that I should savour the moment because the first is the best,\" she said. \"I thought 'oh no' because I wanted the feeling again and I must say that the feeling today gives the first one a run.\" She said that many of the swimmers had said that the pool in the Aquatics Centre in the Olympic Park was a very fast pool. \"It certainly is my favourite pool. I think it is awesome that so many swimmers have been able to break world records when a lot of people didn't think we'd be able to,\" she said. The teenager, who was born in Pasedena and holds dual US and Canadian citizenship, said that the world records swum during the high-tech suits had not been intimidating for the new generation of swimmers. \"It kind of motivated us. We wanted to get better and to show people we don't need the suits. It's not the suit that makes the swimmer, it's the swimmer that makes the suit,\" she said. With two events outstanding, the US women's team have already taken seven out of 14 gold and Franklin says she is not surprised the team is so successful. \"This team is unbelievable. The closeness and the bonding we have achieved is incredible. We have true happiness for each other and that gets us going,\" she said. As a fist-time Olympian, Franklin says that she has learnt a lot from these Games. \"There have been times where I have just been so exhausted, where I simply did not want to go on,\" she said. \"But then I remember that there are many people who would kill to be here and that keeps me going and I go on. I am pretty proud that I have managed to keep my excitement going throughout the whole time.\" Franklin said that she was going to be seeing her family later Friday after winning the backstroke gold. \"I am so looking forward to seeing them, so I will be celebrating the gold and the world record with hugs from them,\" she said. It could well be that Franklin medals again on Saturday in the final session of the swimming competition with the US 4x100m medley team, thereby becoming the most succesful female swimmer at this meet. And that, in turn, could well make becoming regular old Missy and being asked to the Prom just a little bit more difficult. Read the", "images": ["https://web.archive.org/web/20120811172959im_/http://l2.yimg.com/bt/api/res/1.2/zCkQwCnhg65YqcLcoO3Yrg--/YXBwaWQ9eW5ld3M7cT04NTt3PTYzMA--/http://media.zenfs.com/en/blogs/sptuspreprally/High-school-junior-and-U.S.-Olympic-hopeful-Missy-Franklin-Getty-Images.jpg", "https://web.archive.org/web/20120811172959im_/http://www.regisjesuit.com/view.image?Id=2255", "https://web.archive.org/web/20120811172959im_/http://www.regisjesuit.com/images/blank.gif", "https://web.archive.org/web/20120811172959im_/http://static.thehollywoodgossip.com/images/videos/justin-bieber-to-missy-franklin-congratulations_320x240.jpg", "https://web.archive.org/web/20120811172959im_/http://www.regisjesuit.com/view.image?Id=433", "https://web.archive.org/web/20120811172959im_/http://www.regisjesuit.com/view.image?Id=2117", "https://web.archive.org/web/20120811172959im_/http://www.regisjesuit.com/view.image?Id=2120", "https://web.archive.org/web/20120811172959im_/http://www.regisjesuit.com/images/FavIcon.ico", "https://web.archive.org/web/20120811172959im_/http://www.regisjesuit.com/view.image?Id=1359", "https://web.archive.org/web/20120811172959im_/http://www.regisjesuit.com/view.image?Id=405", "https://web.archive.org/web/20120811172959im_/http://www.regisjesuit.com/view.image?Id=2118"], "top_img": "https://web.archive.org/web/20120811172959im_/http://www.regisjesuit.com/images/FavIcon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Missy Franklin in the News at Regis Jesuit High School", "meta_data": {"vs_targetSchema": "http://schemas.microsoft.com/intellisense/ie5", "keywords": "Regis Jesuit High School Denver,CO Colorado Aurora private catholic high school jesuit about us co-institutional education athletics boys division girls division lacrosse swimming football soccer field hockey poms cheer cross country", "last-modified": "8/10/2012 9:00:16 PM"}, "movies": ["https://web.archive.org/web/20120811172959if_/http://www.youtube.com/embed/MOr_RHQ-jdw", "https://web.archive.org/web/20120811172959if_/http://www.youtube.com/embed/YPIA7mpm1wU?rel=0", "https://web.archive.org/web/20120811172959if_/http://www.youtube.com/embed/DVibRxuIx-Q?rel=0", "https://web.archive.org/web/20120811172959if_/http://www.youtube.com/embed/tAgG1pBz6C4?rel=0", "https://web.archive.org/web/20120811172959if_/http://www.youtube.com/embed/VJOxF79ATQU?rel=0"], "publish_date": null, "source": "https://web.archive.org", "summary": ""}