{"url": "https://www.theguardian.com/fashion/2013/jul/05/vogue-truth-size-zero-kirstie-clements", "text": "One of the most controversial aspects of fashion magazines, and the fashion industry, is models. Specifically, how young they are and how thin they are. It's a topic that continues to create endless debate, in the press and in the community. As the editor of Australian Vogue, my opinion was constantly sought on these issues, and the images we produced in the magazine were closely scrutinised. It's a precarious subject, and there are many unpleasant truths beneath the surface that are not discussed or acknowledged publicly.\n\nWhen I first began dealing with models in the late 1980s we were generally drawing from a pool of local girls, who were naturally willowy and slim, had glowing skin, shiny hair and loads of energy. They ate lunch, sparingly for sure, but they ate. They were not skin and bones. I don't think anyone believes that a model can eat anything she wants, not exercise and still stay a flawless size 8 (except when they are very young), so whatever regime these girls were following was keeping them healthy.\n\nBut I began to recognise the signs that other models were using different methods to stay svelte. I was dressing a model from the US on a beauty shoot, and I noticed scars and scabs on her knees. When I queried her about them she said, nonchalantly: \"Oh yes. Because I'm always so hungry, I faint a lot.\" She thought it was normal to pass out every day, sometimes more than once.\n\nOn another shoot I was chatting to one of the top Australian models during lunch. She had just moved to Paris and was sharing a small apartment with another model. I asked her how that was working out. \"I get a lot of time by myself actually,\" she said, picking at her salad. \"My flatmate is a 'fit model', so she's in hospital on a drip a lot of the time.\" A fit model is one who is used in the top designer ateliers, or workrooms, and is the body around which the clothes are designed. That the ideal body shape used as a starting point for a collection should be a female on the brink of hospitalisation from starvation is frightening.\n\nThe longer I worked with models, the more the food deprivation became obvious. Cigarettes and Diet Coke were dietary staples. Sometimes you would see the tell-tale signs of anorexia, where a girl develops a light fuzz on her face and arms as her body struggles to stay warm. I have never, in all my career, heard a model say \"I'm hot\", not even if you wrapped her in fur and put her in the middle of the desert.\n\nSociety is understandably concerned about the issues surrounding body image and eating disorders, and the dangerous and unrealistic messages being sent to young women via fashion journals. When it comes to who should be blamed for the portrayal of overly thin models, magazine editors are in the direct line of fire, but it is more complex than that. The \"fit\" model begins the fashion process: designer outfits are created around a live, in-house skeleton. Few designers have a curvy or petite fit model. These collections are then sent to the runway, worn by tall, pin-thin models because that's the way the designer wants to see the clothes fall. There will also be casting directors and stylists involved who have a vision of the type of woman they envisage wearing these clothes. For some bizarre reason, it seems they prefer her to be young, coltish, 6ft tall and built like a prepubescent boy.\n\n'I was horrified to hear what the industry was covering up' … Kirstie Clements, former editor of Vogue Australia. Photograph: Anthony Reginato / Newspix / Rex\n\nIt is too simplistic to blame misogynistic men, although in some cases I believe that criticism is deserved. There are a few male fashion designers I would like to personally strangle. But there are many female fashion editors who perpetuate the stereotype, women who often have a major eating disorder of their own. They get so caught up in the hype of how brilliant clothes look on a size 4, they cannot see the inherent danger in the message. It cannot be denied that visually, clothes fall better on a slimmer frame, but there is slim, and then there is scary skinny.\n\nDespite protestations by women who recognise the danger of portraying any one body type as \"perfect\", the situation is not improving. If you look back at the heady days of the supermodels in the late 80s and early 90s, beauties such as Cindy Crawford, Eva Herzigová and Claudia Schiffer look positively curvaceous compared to the sylphs of today. There was a period in the last three years when some of the girls on the runways were so young and thin, and the shoes they were modelling so high, it actually seemed barbaric. I would watch the ready-to-wear shows on the edge of my seat, apprehensive and anxious. I'm not comfortable witnessing teen waifs almost on the point of collapse\n\nCindy Crawford in 1999 … curvaceous compared to the sylphs of today. Photograph: Graham Whitby-Boot/Sportsphoto Ltd.\n\nAfter the shows, the collection is made available for the press to use for their shoots. These are the samples we all work with and they are obviously the size of the model who wore them on the runway. Thus, a stylist must cast a model who will fit into these tiny sizes. And they have become smaller since the early 90s. We've had couture dresses arrive from Europe that are so minuscule they resemble christening robes. There are no bigger samples available, and the designer probably has no interest in seeing their clothes on larger women. Many high fashion labels are aghast at the idea of producing a size 14, and they certainly wouldn't want to see it displayed in the pages of the glossies.\n\nAs a Vogue editor I was of the opinion that we didn't necessarily need to feature size 14-plus models in every issue. It is a fashion magazine; we are showcasing the clothes. I am of the belief that an intelligent reader understands that a model is chosen because she carries clothes well. Some fashion suits a curvier girl, some doesn't. I see no problem with presenting a healthy, toned, Australian size 10 [UK 8-10]. But as sample sizes from the runway shows became smaller, 10 was no longer an option and the girls were dieting drastically to stay in the game.\n\nIt is the ultimate vicious cycle. A model who puts on a few kilos can't get into a sample size on a casting and gets reprimanded by her agency. She begins to diet, loses the weight, and is praised by all for how good she looks. But instead of staying at that weight, and trying to maintain it through a sensible diet and exercise, she thinks losing more will make her even more desirable. And no one tells her to stop.\n\nGirls who can't diet their breasts away will have surgical reductions. They then enter into dangerous patterns of behaviour that the industry – shockingly – begins to accept as par for the course. We had a term for this spiral in the office. When a model who was getting good work in Australia starved herself down two sizes in order to be cast in the overseas shows – the first step to an international career – we would say in the office that she'd become \"Paris thin\". This dubious achievement was generally accompanied by mood swings, extreme fatigue, binge eating and sometimes bouts of self-harming. All in the quest to fit into a Balenciaga sample.\n\nNot every model has an eating disorder, but I would suggest that every model is not eating as much as she would like to. In 1995 I cast a lovely Russian model for a studio shoot in Paris, and I noticed that by mid-afternoon she hadn't eaten a thing (we always catered). Her energy was fading, so I suggested we stop so she could have a snack. She shook her head and replied: \"No, no. It is my job not to eat.\" It was one of the only sentences she knew how to say in English.\n\nA few years later we booked another Russian girl, who was also starving herself, on a trip to Marrakech. When the team went out to dinner at night she ordered nothing, but then hunger would get the better of her and she would pick small pieces of food off other people's plates. I've seen it happen on many trips. The models somehow rationalise that if they didn't order anything, then they didn't really take in the calories. They can tell their booker at the agency before they sleep that they only had a salad. By the end of the trip, she didn't have the energy to even sit up; she could barely open her eyes. We actually had her lie down next to a fountain to get the last shot.\n\nIn 2004, a fashion season in which the girls were expected to be particularly bone-thin, I was having lunch in New York with a top agent who confidentially expressed her concern to me, as she did not want to be the one to expose the conspiracy. \"It's getting very serious,\" she said. She lowered her tone and glanced around to see if anyone at the nearby tables could hear. \"The top casting directors are demanding that they be thinner and thinner. I've got four girls in hospital. And a couple of the others have resorted to eating tissues. Apparently they swell up and fill your stomach.\"\n\nI was horrified to hear what the industry was covering up and I felt complicit. We were all complicit. But in my experience it is practically impossible to get a photographer or a fashion editor – male or female – to acknowledge the repercussions of using very thin girls. They don't want to. For them, it's all about the drama of the photograph. They convince themselves that the girls are just genetically blessed, or have achieved it through energetic bouts of yoga and eating goji berries.\n\nI was at the baggage carousel with a fashion editor collecting our luggage after a trip and I noticed a woman standing nearby. She was the most painfully thin person I had ever seen, and my heart went out to her. I pointed her out to the editor who scrutinised the poor woman and said: \"I know it sounds terrible, but I think she looks really great.\" The industry is rife with this level of body dysmorphia from mature women.\n\nIn my early years at the magazine there was no minimum age limit on models, and there were occasions that girls under the age of 16 were used. Under my editorship, the fashion office found a new favourite model – Katie Braatvedt, a 15-year-old from New Zealand. We had her under contract: the idea being that Vogue grooms and protects the girls at the beginning of their careers. But in April 2007 I ran a cover of Katie wearing an Alex Perry gown standing in a treehouse, and received a storm of protest, from readers and the media, accusing us of sexualising children. I lamely debated the point, claiming that the photographs were meant to be innocent and charming, but in the end I had to agree wholeheartedly with the readers. I felt foolish even trying to justify it. I immediately instigated a policy that we would not employ models under the age of 16. Internationally Vogue has since launched a project called Health Initiative, instigated by the US Vogue editor-in-chief, Anna Wintour, which bans the use of models under 16 and pledges that they will not use models they know to be suffering from eating disorders. The first part you can police. The second is disingenuous nonsense, because unless you are monitoring their diet 24/7, you just can't be sure.\n\n'The deference she commands from people is astonishing to watch' … Anna Wintour. Photograph: Astrid Stawiarz/Getty Images\n\nI had no dealings with Wintour during those years, and on the few occasions we were introduced, her sense of froideur was palpable. The deference she commands from people is astonishing to watch. There appears to exist some kind of psychological condition that causes seemingly sane and successful adults to prostrate themselves in her presence. It's not just respect – it's something else. People actually want to be scared witless of her, so she obliges. After they had met me, people would often say: \"You're so nice and normal\" – often I think with a tinge of disappointment, wishing I'd been just a little bit like Wintour. I could never win. I was either expected to be terrifying or snobbish. And I don't consider myself either.\n\nBeing a Vogue editor is precarious. It's a job everybody in the industry desires, and most people are convinced they could do it better. I was harder on myself than anybody would be if I made a mistake, and when you're the editor of Vogue, your slip-ups are very public. Traditional publishing is under enormous pressure, with declining revenues and readership, and decisions are being made to radically cut costs and do anything to please the advertiser. For me, this is perilous. I still believe in the magic.\n\nThis is an edited extract from The Vogue Factor by Kirstie Clements. Buy it for £8.99 (RRP £12.99) at guardianbookshop.co.uk or call 0330 333 6846.", "images": ["https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/online/2013/7/18/1374164398350/Jess-Cartner-Morley-and-K-009.jpg?width=300&quality=85&auto=format&fit=max&s=b30b3780bcb67c7742d7822cc2fe53ae", "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2013/7/24/1374681637153/John-Casablancas-Founder--008.jpg?width=300&quality=85&auto=format&fit=max&s=6c3aa70a7d52d8cccecdbf656df1ff79", "https://i.guim.co.uk/img/static/sys-images/Observer/Pix/pictures/2013/8/7/1375870891239/Barbara-Mullen-in-Le-Pavi-008.jpg?width=300&quality=85&auto=format&fit=max&s=01f207c355c1ebcd3c63586bdbca51e6", "https://i.guim.co.uk/img/static/sys-images/Arts/Arts_/Pictures/2013/7/5/1373032731126/Thin-model-012.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d6c0a4935fce43665e779b89a3055ee4", "https://i.guim.co.uk/img/static/sys-images/Arts/Arts_/Pictures/2013/7/5/1373028071072/Cindy-Crawford-in-1999-010.jpg?width=445&quality=85&dpr=1&s=none", "https://i.guim.co.uk/img/static/sys-images/Arts/Arts_/Pictures/2013/7/5/1373032731126/Thin-model-012.jpg?width=465&quality=85&dpr=1&s=none", "https://i.guim.co.uk/img/static/sys-images/Arts/Arts_/Pictures/2013/7/5/1373032930734/Kirstie-Clements-former-e-007.jpg?width=445&quality=85&dpr=1&s=none", "https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Anna+Wintour%2CModels%2CSociety%2CFashion%2CEating+disorders%2CNewspapers+%26+magazines%2CLife+and+style%2CMagazines%2CMedia%2CAnorexia", "https://i.guim.co.uk/img/static/sys-images/Media/Pix/pictures/2012/12/6/1354785336776/Anna-Wintour-008.jpg?width=445&quality=85&dpr=1&s=none"], "top_img": "https://i.guim.co.uk/img/static/sys-images/Arts/Arts_/Pictures/2013/7/5/1373032731126/Thin-model-012.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d6c0a4935fce43665e779b89a3055ee4", "keywords": [], "authors": [], "canonical_link": "https://www.theguardian.com/fashion/2013/jul/05/vogue-truth-size-zero-kirstie-clements", "title": "Former Vogue editor: The truth about size zero", "meta_data": {"description": "<p>The fashion industry is not a pretty business. Here, one of its own, the former editor of&nbsp;Australian Vogue <strong>Kirstie Clements</strong> describes a thin-obsessed culture in which starving models eat tissues and resort to surgery when dieting isn't enough</p>", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#052962", "og": {"url": "http://www.theguardian.com/fashion/2013/jul/05/vogue-truth-size-zero-kirstie-clements", "image": {"identifier": "https://i.guim.co.uk/img/static/sys-images/Arts/Arts_/Pictures/2013/7/5/1373032731126/Thin-model-012.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d6c0a4935fce43665e779b89a3055ee4", "height": 720}, "title": "Former Vogue editor: The truth about size zero", "description": "The fashion industry is not a pretty business. Here, one of its own, the former editor of Australian Vogue Kirstie Clements describes a thin-obsessed culture in which starving models eat tissues and resort to surgery when dieting isn't enough", "type": "article", "site_name": "the Guardian"}, "article": {"author": "Kirstie Clements", "publisher": "https://www.facebook.com/theguardian", "modified_time": "2018-07-02T14:13:57.000Z", "section": "Fashion", "published_time": "2013-07-05T15:03:00.000Z", "tag": "Anna Wintour,Models,Society,Fashion,Eating disorders,Newspapers & magazines,Life and style,Magazines,Media,Anorexia"}, "al": {"ios": {"url": "gnmguardian://fashion/2013/jul/05/vogue-truth-size-zero-kirstie-clements?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287}, "twitter": {"dnt": "on", "app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"googleplay": "guardian://www.theguardian.com/fashion/2013/jul/05/vogue-truth-size-zero-kirstie-clements", "iphone": "gnmguardian://fashion/2013/jul/05/vogue-truth-size-zero-kirstie-clements?contenttype=Article&source=twitter", "ipad": "gnmguardian://fashion/2013/jul/05/vogue-truth-size-zero-kirstie-clements?contenttype=Article&source=twitter"}}, "card": "summary_large_image", "image": "https://i.guim.co.uk/img/static/sys-images/Arts/Arts_/Pictures/2013/7/5/1373032731126/Thin-model-012.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=6de6eef31ada082236eee27df64b9e9d", "site": "@guardian"}, "robots": "max-image-preview:large"}, "movies": [], "publish_date": 1372978800.0, "source": "https://www.theguardian.com", "summary": ""}