{"url": "https://www.springfieldspringfield.co.uk/view_episode_scripts.php?tv-show=the-arrangement-2017&episode=s02e09", "text": "The Arrangement (2017) s02e09 Episode Script\n\nTruth\n\n1 Previously on, \"The Arrangement\" In two weeks, I am marrying the love of my life.\n\nYour costar clearly has feelings for you.\n\nI've seen it.\n\nWe could fix this.\n\nThe man just fired me.\n\nAh, so you wanna be an actor? Do me a favor.\n\nLeave him alone.\n\nMason was my friend.\n\nI should be the one to look out for her son.\n\nShe talked about you a lot.\n\nAbout what a screw-up I am? What is this? A role.\n\n- What's this about? - Julie Woolth.\n\nI found her.\n\nI will always credit IHM with changing my life.\n\nShe's lying.\n\nYou have to go back and get Julie to talk to you.\n\nHello? Terence will ruin everything My marriage, my career.\n\nJulie, we need to talk.\n\nLet them stay.\n\nTerence did this to you? - Terence? No.\n\n- Then who? What do you know? Everything.\n\nIt just escalated between us, fast.\n\nI said something to him.\n\nHe said something back.\n\n[STAMMERS.]\n\nAnd whatever he said, it just Set you off, like in Venice.\n\nNo, no, not like that, it was different.\n\nDifferent how? Ah, just, back then, I I was different.\n\nIt was like It was like I was having an out-of-body experience.\n\nI don't know how else to explain it.\n\n[STAMMERS.]\n\nI don't even remember what I did.\n\nI just remember the feeling.\n\nYou don't remember? It's not like I was having a a rage blackout, but my my brain, I just You still haven't told me why you were even looking for Aaron.\n\nHe's in a wheelchair.\n\n- I know - No, you don't know.\n\nYou don't because you hid him away You and Terence.\n\nAfter what happened with Evan, what did you do? Are you crazy? He tried to rape me, again.\n\n- And you killed him.\n\n- Stop it.\n\nDid you face the consequences? That was a completely different situation.\n\nWhen that guy was arrested for it, - did you step forward? - [SCOFFS.]\n\nNo, you didn't, because you were scared.\n\nSurvival, self-preservation It's human nature.\n\nAnd Terence preserved you Your future, your career.\n\nHe made it all go away.\n\nSo that's it? [SOFT, DRAMATIC MUSIC.]\n\nThat's the reason for the contract.\n\nIt's not me.\n\nIt's you To protect you, to protect your brand.\n\n[SIGHS.]\n\nThere were a lot of reasons for the contract, Megan.\n\n[SIGHS.]\n\nWhy were you looking for him? Why did you and Zach go looking for Julie and Aaron? Please, tell me.\n\n[SIGHS.]\n\nWe were trying to hurt Terence.\n\nSo you've been lying? All these months? About IHM, yeah.\n\nYou should've told me.\n\nIf I did, would you have turned your back on Terence? You're a true believer.\n\nAnd the last time I told you something, you turned me in.\n\nYou gonna do that again? You gonna help Aaron go public? You can't keep a secret from the world forever.\n\n[MUSIC ESCALATES.]\n\n[DRAMATIC ROCK MUSIC.]\n\nYou were out cold.\n\n[SIGHS.]\n\nYeah, no, I haven't slept this well since I don't even know when.\n\nSecrets are a weight.\n\nIt's a relief to get them off of you.\n\nWe have to make some decisions.\n\nDecisions? About tomorrow night, the rehearsal dinner.\n\nWe have a lot of choices to make.\n\nThere's a lot to get done.\n\nI have a final hair and makeup test, you have a tuxedo fitting, and we have to settle on a main course.\n\nLet's go with salmon.\n\nNow, can we talk about last night? You know, it's normally Zach that puts emails like this in front of us.\n\nNow you're bringing up Zach? Well, he's trapped at the Facility.\n\nI can relate.\n\nCan you help me out here? You hate IHM now, you hate Terence, yet you're talking about going to a makeup test for our IHM wedding which is in three days.\n\nI know.\n\nThe wedding of the decade [SOFT, DRAMATIC MUSIC.]\n\nI'm not ready to disappoint millions of people.\n\nAre you? [CUP CLATTERS.]\n\nWhere are you going? A business lunch.\n\nIt's not about you.\n\nI'll try to get Zach out.\n\nI'll do my best, but it's not up to me.\n\nI know.\n\nEverything's up to Terence.\n\n[FOOTSTEPS FADING.]\n\nYeah, I heard Gosling's circling it to produce, not to mention Scott Rudin, plus, I hear Jon Favreau's going after it to direct.\n\n- Wow.\n\n- Yeah.\n\nFemale underdog blows the whistle on a big pharmaceutical company? Please, they're already engraving the Oscars.\n\nAnd you're perfect for it.\n\nYou can't count on anyone else to cast you, though.\n\nWe have to secure the rights ourselves.\n\nFavreau can work for us, right? Megan? Uh, Megan? I just wanna say you look great.\n\nI can't wait to see pics of you in your wedding dress.\n\nThank you very much.\n\nWhere's Kyle? Yeah, tell Kyle we love him, like - BOTH: Love.\n\n- [LAUGHTER.]\n\n[LAUGHS SOFTLY.]\n\n[GIRLS SQUEALING.]\n\nI know you're dealing with a lot right now, but if we want this project, we need to get aggressive.\n\nBut I haven't even started shooting \"Agent Jane.\n\n\" Look, you're the one who sent me \"The New York Times\" story, and now it's got real heat.\n\nThis role is high-profile, it's meaty, it will elevate you, but we have to fight for it.\n\nAre you ready to fight? I am.\n\nWhy are you conflicted? No, I I'm not.\n\nYou know, Zach's just a kid, all right? He got confused.\n\nNo, he betrayed you.\n\nHe lost his way.\n\nThe Facility will be good for him and Hudson.\n\nI can't believe I missed that defection.\n\nI'm sure there are others People in our midst trying to hurt me and IHM And that is not acceptable, not right now.\n\nWhy, because of the wedding? Yes, but also, I'm introducing something new.\n\nIt's called Vita.\n\nIt's IHM's life extension program.\n\n- Life extension? - Mm-hmm.\n\nMeaning you're actually trying to No, the science is real, Kyle.\n\nWe are on the verge of something truly extraordinary.\n\nIt's a breakthrough.\n\nThis is a game changer for us.\n\nSounds like it.\n\nImagine a career that's twice as long.\n\nThat would be exhausting but amazing.\n\nI think you'd do incredible things.\n\nI'm introducing it to membership soon.\n\nHaving you on board would help legitimize it.\n\nYeah, well, you know, I got your back, always.\n\nSo what's, uh What's your next move with Zach and Hudson? Find out who they're working with, smoke them out, remove them.\n\nWhat if the damage has been done? What if it is Julie Woolth that they're talking about? I spoke to Julie.\n\nYou did? She said she hasn't heard from anyone connected to IHM, seen anyone.\n\nShe says all is well, but I'm not taking any chances.\n\n[BIRDS CAWING, WAVES CRASHING.]\n\nSo you told him everything? I had to.\n\nI left you out of it.\n\n[SIGHS.]\n\nOkay, so what now? - I mean, what do you want to do? - I don't I have no idea.\n\nMegan, he put someone in a wheelchair.\n\nI know.\n\nHe covered it up and pretended it didn't happen.\n\nDo you think he had a choice once Terence got involved? Okay.\n\nWhat Terence did awful.\n\nBut are you seriously gonna defend Kyle? No, I'm not defending him.\n\nI'm just trying to make sense of it all You can't trust him! He could be turning you in to Terence right now as we speak.\n\nI didn't.\n\n[SIGHS.]\n\nKyle How much does she know? We have to talk to Aaron and Julie, and we need to move quickly.\n\nThey are not safe.\n\nShaun says it's clear None of Terence's people.\n\nAnd she has a good view of the house.\n\nSomehow, I still feel like I'm being watched.\n\nYou ready for this? [KNOCKING.]\n\n- No! - Julie.\n\n- How could you bring him here? - We don't have time for this.\n\nYou have to listen to me.\n\nYou're not safe.\n\nOf course not, not with him here! Please, take a breath.\n\nTerence is on Calling he called me, and I had to lie.\n\nYou told me that if Aaron talked to you that we'd be safe, we'd be protected.\n\nAnd now you show up with the person responsible for all of it.\n\nHey, stay the hell away from him! Kyle West.\n\n[TENSE MUSIC.]\n\nLast time you saw me, I looked like you.\n\nThe owners are on vacation.\n\nSo we can lay low here for about two weeks before they get back.\n\nHopefully we'll have figured out next steps by then? We will.\n\nWe'll come up with a plan.\n\nAnd tomorrow morning, I'll go back to your house and get everything that we didn't have time - to pack up today.\n\n- Okay.\n\nWe need to figure out a way to make this place work for Aaron.\n\nIt's not exactly wheelchair-friendly.\n\nRight, well, we'll all come back first thing tomorrow and help set everything up.\n\n[LAUGHS.]\n\nHandyman Kyle West.\n\nYou sure you wanna scuff up those pretty little hands? Okay, let's get the rest of the stuff from the car.\n\n[SIGHS.]\n\nWell Well What's the next move here, Kyle? You tell me.\n\nI'm still trying to sort through all this.\n\nMm, yeah, must be so overwhelming for you.\n\nYou hate me right now.\n\nI get it.\n\nI just want Megan to be happy.\n\n- So do I.\n\n- Mm, so you lied to her? Just like you've been lying to Terence? You're good.\n\nI'll give you that.\n\nHe really trusts you.\n\nNot more than he trusts you.\n\nWhen Megan first asked for my help, do you know what she said her plan was? What? To burn the whole thing down.\n\nIHM? Exact quote.\n\nThat's pretty dramatic.\n\nLook, a lot's happened since then.\n\nTrue.\n\nBut she's actually found someone who can help her do it.\n\nI know where I stand.\n\nDo you? Are you really ready to help her? It's been quite the ride.\n\nWhen the story first came out, I was too terrified to leave my apartment.\n\nBut now here I am, staying at a place like this, having drinks with Ryan Gosling.\n\nEyes you could get lost in.\n\nNot my type.\n\nWell, clearly I can't compete with the Gosling charm offensive, but Megan is real talent on the rise.\n\nI love Megan Morrison.\n\nShe seems so tough and ballsy, you know? Oh, I know.\n\n[LAUGHS.]\n\nBut I wanna talk about you.\n\nGoing up against a huge corporation like that, I mean, that takes real nerve.\n\nIt wasn't an easy decision Coming forward But once I made it, I felt I don't know.\n\nEmpowered.\n\nFree.\n\nAnd scared shitless [LAUGHS.]\n\nI can only imagine.\n\nBut you're a hero.\n\nAnd you're beautiful.\n\nBeautiful? Gosling didn't go there.\n\nListen, a lot of very powerful men are gonna try and woo you, but I really think that your story needs to be told by women, and I'll tell you why.\n\nI like you, DeAnn.\n\nI like you too.\n\nI hope you make a strong bid.\n\n[SOFT, DRAMATIC MUSIC.]\n\nI will.\n\nBut you should know that money is just a small part of what a good producer has to offer.\n\nI gave up everything coming forward Benefits, my livelihood, my future.\n\nSo money it's the only thing I can really count on at the moment.\n\nOkay, that look all right? I'll make it work.\n\nWe're having muffins inside if you wanna join.\n\nOh, nah, I'm good.\n\nNot really a muffin guy.\n\nWhat, are you prepping for a big role or something? [CHUCKLES.]\n\nOh, wow, you are.\n\nOkay.\n\nDedication.\n\nYou know, I, uh tried reaching out, calling you, a couple years ago.\n\nYeah? And say what? Ah, just to say that I can't make up for what I did to you.\n\nI know that, and every day, I'm trying to Jeez, it sounds so trite.\n\nIt's bullshit.\n\nSeriously, I'm glad Terence made me change my number.\n\n[LAUGHS SOFTLY.]\n\nThese last ten years must've been brutal.\n\nI've kept myself busy Reading, exercising, some writing.\n\nI'm working on a novel.\n\nYou live the life you have, you know? Well, it looks like Terence at least tried to make sure that you were comfortable.\n\nTerence has owned us for a decade.\n\nHis money, his threats.\n\nAnd now, for the first time in forever, I feel like I can breathe.\n\nI'm ready to talk, wherever that leads.\n\nNot what you wanted to hear.\n\nI just don't see what you gain.\n\nClosure, freedom, not having to live in fear anymore.\n\nBy going public? You realize the attention that brings? You know, this is not about getting back at you.\n\nIsn't it? No.\n\nPayback? Shit is weak.\n\nI used to hate-watch your movies.\n\n[LAUGHING.]\n\nReally? Yeah, pick apart your performances, which wasn't hard.\n\nSome of that early stuff Yikes.\n\nThanks.\n\nBut then you got good.\n\nAnd that, at first, made me hate you more.\n\nBut, uh, I realized I could lose myself in your performances.\n\nRoot for your characters to win, grieve when they lost.\n\nAnd that Just feeling that Was kind of Healing? Which role was it, when it shifted? [LAUGHS SOFTLY.]\n\n\"First Precinct.\n\n\" Mm.\n\nYou were a pretty badass cop, I gotta say.\n\nYou'd have been better, though.\n\nThat's true.\n\n[LAUGHS SOFTLY.]\n\nYou're such an asshole.\n\n[SOFT, DRAMATIC MUSIC.]\n\nCome on.\n\nCome eat a muffin, man.\n\nKyle, what are you doing? Rehearsal dinner's in a few hours, and we have to get back and start to get ready.\n\nWe can convince him.\n\nAaron I think we can convince him not to go public.\n\n[SCOFFS.]\n\nSo that's it? What? That's why you decided to help him us.\n\nYou wanna manipulate him so you could save your career.\n\nNo, I helped him because I owe him.\n\nA happy life, closure, freedom from Terence [SIGHS.]\n\nHe told me that he's moved past what happened, Megan.\n\nHe doesn't need payback, okay? He just wants to live on his own terms.\n\nWe can offer him that.\n\nHe told me he wants to tell his story.\n\nHe does, or you do? Terence he's a bad guy, Kyle.\n\nLook what he does to people.\n\nYou're being so black and white.\n\nIsn't this black and white? No, it's complicated.\n\nTerence is complicated.\n\nHe believes in the principles of IHM, okay? He cares about the people that come to him.\n\nYou think he cares about you? He controls you.\n\nHe uses all of this to keep you tied to him because he needs you.\n\nHe's built IHM off of your fame.\n\nDon't you see that? Of course I see that.\n\nBut he's also been there for me when I had nothing, when I felt like nothing, and that matters.\n\nAfter everything else Terence has done, that will always matter.\n\nI know it will.\n\nBut I'm willing to leave.\n\n[SOFT, DRAMATIC MUSIC.]\n\nIHM, Terence I'll cut ties.\n\nAre you serious? Yes, you said it yourself.\n\nHe can't hold Aaron over my head any longer.\n\nHe cannot control me.\n\nYou've built your whole life Your identify Around IHM and Terence.\n\nHow am I supposed to believe that now you're willing to give all of that up? Because what I'm not willing to give up is you.\n\nI love you, Megan.\n\nAnd if I have to choose, then I choose you.\n\nSo the studio's put up a good amount.\n\nI mean, I do have to put in some of my own money too, and we're definitely gonna need more if we wanna be competitive, but it's a good thing I'm scrappy.\n\n- [SIGHS.]\n\n- You okay? I'm fine.\n\nI just, uh A few months ago, I was in rehab, and my mom's car accident Major rug pull, life-changing.\n\nAnd now here I am, and I'm an actor.\n\nIt's kind of head-spinning Excuse me, we need you in makeup in five.\n\nFirst team.\n\nLet's go.\n\n- Listen.\n\n- Yeah? You're gonna be great.\n\n- Frame.\n\n- Okay.\n\n- Frame.\n\n- Set.\n\nAnd action.\n\nYou have to stop, Joe, with the calls, the texts.\n\nWhat we're doing it's wrong.\n\nDon't you get that? Yeah, I get it.\n\nBut, Mary Cut.\n\nUh, Wes, you okay there, buddy? I'm good.\n\nI, uh I just I lost it.\n\n[STAMMERS.]\n\nI'm okay.\n\nI'm ready.\n\n[CLEARS THROAT.]\n\nOkay.\n\nAnd action.\n\nYou have to stop, Joe, with the calls, the texts.\n\nWhat we're doing it's wrong.\n\nDon't you get that? [BREATHES DEEPLY.]\n\nCut! [SIGHS.]\n\nI thought you said he was ready.\n\nI said he was green but talented.\n\nYeah, well, he's definitely green.\n\nOkay, new deal.\n\nLet's turn around on Patricia.\n\n[BELL RINGS.]\n\nWes? Wes.\n\nHey, listen, just breathe.\n\nJust breathe.\n\nCome here.\n\nStay calm.\n\nStay calm.\n\nThey're gonna get her coverage first, and then they're gonna turn around on you.\n\nYou've got plenty of time To stop screwing up.\n\nI've been I've been on a set before.\n\n[SIGHS DEEPLY.]\n\nI know how it works.\n\nOkay, do you want me to stay? No, you you have the rehearsal dinner.\n\nI can be late.\n\nI, uh I'll be fine, okay? You go.\n\nThank you.\n\nOkay, then we don't wait.\n\nWe talk to him tonight.\n\n- After the dinner? - No, during, when everyone's around.\n\nHe'll be relaxed, his guard down, surrounded by IHM All the people who matter to him.\n\nHe won't see this coming, and he won't wanna make a scene.\n\n[SOFT PIANO LOUNGE MUSIC PLAYING.]\n\n[APPLAUSE.]\n\nThree chardonnays, please.\n\n- Hey.\n\n- Hey.\n\nSo what's the latest? Kyle and I have a plan.\n\nHi.\n\nI didn't see you earlier.\n\nSo nice, thank you guys for coming.\n\nWhen you have a moment later, I'd like to have a financial conversation.\n\n- Tonight? - Well, it's time-sensitive.\n\nIt's about Megan, actually.\n\nI wanna put together a development fund for her.\n\nShe's got heat.\n\nWe need to capitalize.\n\nYou two look great.\n\nUpstaging us bad form.\n\nCan I steal you for a toast? I won't say no to that.\n\nI will join.\n\nAh, you look stunning, as always.\n\nThank you.\n\n[SIGHS.]\n\nThank you.\n\nWe have Julie and Aaron.\n\nI'm sorry, Aaron We moved them.\n\nSomewhere you can't get them.\n\n[TENSE MUSIC.]\n\nAaron Woolth? It was you, wasn't it? Helping Zach.\n\nI knew it.\n\nI knew I could never trust you.\n\nOkay, why don't we all take a breath and move this conversation somewhere private? I think there's been some kind of confusion We're fine right here.\n\nOf course we are, because this is an ambush, right? I'm leaving IHM.\n\nWhat? Why? Because she told him to.\n\nShe's trying to control him.\n\nWow, are you serious right now? Megan.\n\nOkay, can somebody please tell me what's happening? No one is telling me what to do.\n\nI made a choice.\n\nI love Megan, and I'm choosing her.\n\nWhen did this become a choice? When you kidnapped me, held me against my will, stuck a needle in my neck.\n\nI was trying to help you.\n\nYou traumatized me.\n\nI won't leave publicly.\n\nI don't wanna embarrass you.\n\nI know that this is an important time for the institute.\n\nBut if you make this more difficult than it needs to be For me or Megan Things will get messy.\n\nKyle, IHM is a part of you.\n\nIt's why you're still here.\n\nWe both know that.\n\nIt's who you are.\n\nIt's who I was.\n\nI'm moving forward.\n\nDo you really think you can trust her? She's broken, damaged, regressive, and weak, and she will be your undoing.\n\nThank you, Terence, for this wonderful dinner.\n\nWe both really appreciate it.\n\n[DRAMATIC MUSIC.]\n\nExcuse me, everyone.\n\nKevin and Mary Ann wanted to say hello.\n\n- Thanks.\n\n- Thank you again.\n\n[SOFT PIANO LOUNGE MUSIC PLAYING.]\n\nI haven't seen him anywhere Terence.\n\nMaybe he just needed a moment alone.\n\nYou okay? I knew it wasn't gonna be easy, and it wasn't.\n\nSecond thoughts? No.\n\nWell, gotta give it to you.\n\nYou certainly know how to drop a bomb with panache.\n\nI know that this is a lot to process.\n\nWhat does this mean for us? Our partnership? We can still work together on the right projects.\n\nBut other than that, Megan and I We're on our own.\n\nExcuse me.\n\nYou feel like you've won, don't you? No.\n\nI feel relieved.\n\nYou have no idea the risks I've taken for you For us, our careers, our future.\n\nSorry, DeAnn, but it's done.\n\nYou hate Terence, fine.\n\nBut laying all your cards on the table like that? That was stupid, Megan.\n\nImpulsive.\n\nIn this business, you need to be patient.\n\nScrew patience.\n\nI needed him out of my life.\n\nWell, you've succeeded there.\n\nYou've drawn a line in the sand and made it impossible for us to work together on anything.\n\nIt's time someone drew that line.\n\nIt's time we all picked a side.\n\nI've known Kyle I've known Kyle for a very, very long time.\n\nAnd Sorry.\n\nI, uh I worked very hard on this This speech.\n\nBut if you don't mind, I'm just gonna speak from the heart.\n\nWhat do we value in relationships? Love? Devotion? Support? All acceptable answers.\n\nBut the one answer I always come back to Always Is truth.\n\nEvery relationship has highs and lows, but when you're constant, it's truth.\n\nYou can overcome anything.\n\nTruth protects us from ego, insecurity, betrayal.\n\nIt's a powerful lesson I've learned.\n\nIt's made me a better man Better husband, I hope.\n\n[SOFT, DRAMATIC MUSIC.]\n\nAnd it's a lesson I've learned from you, Kyle.\n\nWe've been through a lot together, both battled our demons, our doubts.\n\nBut we always trusted each other, even when the thought of trusting another person seemed impossible.\n\nAnd through it all, we always told each other the truth.\n\nWe built our foundation on it and, in the process, formed a real partnership but, more importantly, an incredible friendship.\n\nAnd so as you prepare to take this next step forward into your future, I wish you nothing but the truth In your life, in your marriage.\n\nBecause the most important thing I've learned from you, Kyle, in the last ten years is that truth grows from love.\n\nReal love.\n\nTo Kyle and Megan.\n\nALL: To Kyle and Megan.\n\n[APPLAUSE.]\n\nTake good care of him.\n\n[APPLAUSE.]\n\n[MUSIC ESCALATES.]\n\nMm-hmm, yeah, no, it's okay.\n\nI'll do it myself.\n\nYeah.\n\nAll right, thanks, Terence.\n\nWhy you talking to him? I was just arranging Zach's release from the Facility Timing, logistics.\n\nI have to go pick him up today.\n\nWhat's your day look like? I'm gonna go see Aaron and Julie, tell them the plan, and deal with the fallout.\n\nShould I meet you over there? No, it'll be better coming from me.\n\nHe's not gonna be happy.\n\nHe had his heart set on going public.\n\nI know you can convince him.\n\nI love you, and I cannot wait to marry you tomorrow.\n\nMe too.\n\n[DRAMATIC MUSIC.]\n\nHey, Wes.\n\nHi.\n\nCan I come in? So this is where you live.\n\nYeah.\n\n[LAUGHS SOFTLY.]\n\nHome, sweet home.\n\nWhy are you here? I thought I'd come by, see how it all went yesterday.\n\nYesterday.\n\nRight.\n\nI was I was gonna call you.\n\nUm, but then I didn't call you.\n\nCall me about what, Wes? [SIGHING.]\n\nUm they fired me.\n\nThey fired you, God.\n\nOh, well? [INHALES SHAKILY, SIGHS.]\n\nDid you use? What did you take, Wes? You need to tell me.\n\nI just I [SOFT, DRAMATIC MUSIC.]\n\nI didn't wanna feel.\n\nI needed to not feel, you know? [CRYING SOFTLY.]\n\nYeah.\n\nI know.\n\n[TENSE MUSIC.]\n\nAaron? Julie? Aaron! Julie! - Where are they? - I'm sorry, Megan, but I don't know what you're talking about.\n\nYes, you do Aaron and Julie, what have you done with them? Nothing.\n\nI don't know where they are.\n\nBullshit! Maybe they just left, took off.\n\n- No, no, sh - She said Aaron was finally hopeful and he was happy.\n\nHappy? Happy to be used as a pawn by you, as a wedge to separate me from Kyle? M-me? You you've been threatening them for years.\n\nI was just trying to help them.\n\nThis conversation is not productive.\n\nIf you if you do anything, if you hurt them at all, I swear to God We're talking in circles, Megan.\n\nWhy don't we focus on how we proceed from here? From now on, you're going to fall back in line, keep your mouth shut, and abide by the contract, or it will be your secret that goes public.\n\nIt was him.\n\n[SNIFFLES.]\n\nIt was Kyle, wasn't it? He showed you where to find them.\n\nYou will marry him tomorrow, and it will be beautiful, what the people want.\n\nDo you understand me, Megan? Where will you go? Far away.\n\nFresh start somewhere.\n\nBe careful, okay? You know, I probably should have left years ago, right after it happened, after he killed her.\n\nI thought your mother I thought she killed herself.\n\nSame thing.\n\nHe destroys people.\n\nTerence also builds people up.\n\nHe's not a bad guy deep down.\n\nWhatever you have to tell yourself.\n\n[TENSE MUSIC.]\n\nMegan? Hey.\n\nMegan, what is it? What's going on? Aaron and Julie are gone.\n\nWhat do you mean? [SCOFFS.]\n\nOh, shit.\n\nTerence.\n\nWait, you don't think that I I swear to you, I didn't tell him anything \"I choose you.\n\n\" When you said that to me, it was, like, everything I wanted to hear.\n\n- And that is so weak - Megan.\n\nAnd pathetic that I would actually think that you would choose me over him.\n\nLook, you cannot leave right now, okay? Did you ever ever do that? Did you ever choose me? Of course.\n\nOr were you playing me all along? - Come on, Megan.\n\n- Or did Terence turn you back? - Will you please - No, tell me, what was it? Was it the toast? I'm not lying about this.\n\nAaron, Lisbeth, the reason for the contract You told me it was me.\n\nYou lie.\n\nThat's who you are.\n\nMe? You've been lying to me for months.\n\nWow, accusing the accuser.\n\nThat is exactly what an innocent person does.\n\nYou're the one that's been sneaking around behind my back and trying to take down IHM.\n\nYeah, your precious IHM.\n\nNo, you lied to me about your stepbrother, and I forgave you, and I still trusted you after that.\n\nAfter you had Terence throw a bag over my head! Look, Megan, we have to talk about this.\n\nWe're getting married tomorrow! Tell me what I can do to fix this.\n\nYou can't.\n\nScotch, perfect.\n\nYou're in high spirits.\n\n[SIGHS.]\n\nLooks I'm gonna be able to fix things with Kyle.\n\nReally? Really.\n\nIt benefits both of us.\n\nI know.\n\nWhat is it, then? I just dropped Wes off at rehab.\n\nWhat happened? He got fired off that job.\n\nDeAnn.\n\nI know.\n\nYou were right.\n\nBut I wanted to win, so I let my emotions get in the way of my instincts.\n\nIt's not the first time.\n\nWhat does that mean? You pushed for Megan.\n\nWe're gonna have to figure out what to do about her.\n\nOur current dynamic, it's not sustainable.\n\nWhat did you have in mind? I think we're gonna need a more permanent solution.\n\n[SUN HEAT'S \"VULTURES\" PLAYING.]\n\n[LINE TRILLS.]\n\nHi, it's Megan.\n\nLeave a message.\n\nThere's a storm in the distance [LINE TRILLS.]\n\nAnd it's rolling like a freight train It's over.\n\nOver? Wait, what's over? Kyle turned on us, like you told me he would.\n\nWhat happened? Terence has them Aaron and Julie.\n\nAnd who knows, they could They could be dead.\n\nWait, no, no, Kyle wouldn't let that happen.\n\nYeah, who knows what Kyle would do? [LINE BEEPING.]\n\nHold on.\n\nOoh Okay.\n\nWhere are you right now? I just left the house.\n\nI needed to get out, to escape.\n\nWell, I'm here if you need me.\n\nAnd I'm so sorry.\n\nI know.\n\nThank you.\n\nOoh, ooh, ooh [SIGHS.]\n\nThey can sense if you're breathing They can hear what we cannot see [KEYPAD BEEPS.]\n\nHello? Hey, it's Megan.\n\nMm [INTERCOM CLICKS.]\n\nSo if the air starts to turn cold And the ground begins a quick freeze Hey.\n\nYou okay? No.\n\n[MUSIC ESCALATES.]\n\nStay inside me Vultures are circling Ooh, oh\n\n", "images": ["https://www.springfieldspringfield.co.uk/images/logo.gif"], "top_img": "https://www.springfieldspringfield.co.uk/images/logo.gif", "keywords": [], "authors": [], "canonical_link": "https://www.springfieldspringfield.co.uk/view_episode_scripts.php?tv-show=the-arrangement-2017&episode=s02e09", "title": "The Arrangement (2017) s02e09 Episode Script", "meta_data": {"viewport": "width=device-width, initial-scale=1", "description": "The Arrangement (2017) s02e09 - Truth Episode Script. SS is dedicated to The Simpsons and host to thousands of free TV show episode scripts and movie scripts.", "og": {"title": "The Arrangement (2017) s02e09 Episode Script | SS", "url": "https://www.springfieldspringfield.co.uk/view_episode_scripts.php?tv-show=the-arrangement-2017&episode=s02e09", "image": "https://www.springfieldspringfield.co.uk/images/logo.gif", "description": "The Arrangement (2017) s02e09 Episode Script | SS", "site_name": "Springfield! Springfield!", "type": "Website"}, "msapplication-config": "none", "google-site-verification": "MXlhYqmIQBr6JMn4sKNUdZARSTszupmJOT8NRZdfjBE"}, "movies": [], "publish_date": null, "source": "https://www.springfieldspringfield.co.uk", "summary": ""}