{"url": "en.wikipedia.org/wiki/Courteney_Cox", "text": "American actress and filmmaker (born 1964)\n\nCourteney Bass Cox (previously Courteney Cox Arquette; born June 15, 1964)[5][6] is an American actress and filmmaker. She gained international recognition for her starring role as Monica Geller on the NBC sitcom Friends, which aired from 1994 to 2004. For her performance in the series, she received seven Screen Actors Guild Award nominations, of which she won one. She received further recognition for starring as Gale Weathers in the horror film franchise Scream (1996–present). She also starred as Lauren Miller in the NBC sitcom Family Ties (1987–1989), Lucy Spiller in the FX drama series Dirt (2007–2008), and as Jules Cobb in the ABC/TBS sitcom Cougar Town (2009–2015), the lattermost of which earned her nominations at the Golden Globe Awards and the Critics' Choice Awards.\n\nCox's other films include the action fantasy Masters of the Universe (1987), the comedy Ace Ventura: Pet Detective (1994), the animated comedy Barnyard (2006), the fantasy comedy Bedtime Stories (2008), and the independent drama Mothers and Daughters (2016). She owns the production company Coquette Productions, which was created by Cox and her then-husband David Arquette. She also worked as a director on her sitcom Cougar Town, the television drama film TalhotBlond (2012), and the black comedy drama film Just Before I Go (2014).\n\nEarly life\n\nCox was born and raised in Birmingham, Alabama.[5][7] She is a daughter of businessman Richard Lewis Cox and Courteney Copeland (née Bass).[8][9] Cox has two older sisters, Virginia and Dorothy, and an older brother, Richard Jr. Her parents divorced in 1974 and her mother then married businessman Hunter Copeland (uncle to music promoter and business manager Ian Copeland and The Police drummer Stewart Copeland).[10]\n\nAfter graduating from Mountain Brook High School, Cox left for Mount Vernon College in Washington, D.C. (now part of George Washington University), but did not complete her architecture course, opting instead to pursue a career in modeling and acting.[11] She has English ancestry.[12][13][14]\n\nCareer\n\n1984–1993: Beginnings and early roles\n\nCox worked at video game publisher Bethesda Softworks briefly in the 1980s.[15] She was chosen from a casting call by director Brian De Palma to appear in the 1984 music video for Bruce Springsteen's \"Dancing in the Dark\", as the young woman pulled onstage at the St. Paul Civic Center to dance with Springsteen.[16] Her early television work includes a starring role as Gloria Dinallo in the short-lived NBC science-fiction fantasy series Misfits of Science (1985),[17] and guest-starring roles in the ABC comedy-drama series The Love Boat (1986) and the CBS crime drama series Murder, She Wrote (1986). She later had a recurring role as Lauren Miller, the girlfriend of Michael J. Fox's character Alex P. Keaton in the NBC comedy series Family Ties (1987–1989).[18]\n\nCox's early film roles include Masters of the Universe (1987), Cocoon: The Return (1988), and I'll Be Home for Christmas (1988).[19][20] She also played Jewel Jagger, the tough-as-nails assistant of Larry Burrows (James Belushi), in Mr. Destiny (1990). In 1993, she co-starred in the short-lived CBS sitcom The Trouble with Larry, alongside Bronson Pinchot and Perry King.[21] The following year, shortly before the debut of the sitcom Friends, Cox starred alongside Jim Carrey in the comedy film Ace Ventura: Pet Detective,[22] and as Jerry Seinfeld's girlfriend, Meryl, in the Seinfeld episode \"The Wife\".[23] In 1995, she was cast in Toad the Wet Sprocket's music video \"Good Intentions\". The song was also featured on the Friends soundtrack.[24]\n\n1994–2000: Breakthrough with Friends and Scream\n\nCox in September 1995\n\nIn 1994, Cox was asked to audition for the starring role of Rachel Green on a new sitcom, Friends; she was cast as Monica Geller instead.[25]\n\nAt first, the most famous cast member of the new show, Cox joined Jennifer Aniston (Rachel Green), Lisa Kudrow (Phoebe Buffay), Matt LeBlanc (Joey Tribbiani), Matthew Perry (Chandler Bing) and David Schwimmer (Ross Geller) for what became her most famous role, lasting for 10 seasons until 2004. The series is commonly referred to as one of the greatest sitcoms of all time.[26][27] According to the Guinness Book of World Records (2005), Cox (along with her female co-stars) became the highest-paid TV actress of all time, with her US$1 million-per-episode fee for the final two seasons of Friends.[28] Syndication of the series earned Cox and her co-stars an estimated $20 million in annual residuals.[29]\n\nBetween seasons five and six, she married David Arquette and consequently changed her name to Courteney Cox Arquette. A joke reference to this is made in the opening credits of the episode \"The One After Vegas\", where the rest of the cast has \"Arquette\" added to their names. The dedication \"For Courteney and David, who did get married\" – a reference to Monica and Chandler's decision not to marry in the episode – appears during the fade out to the tag scene.[30]\n\nCox received further recognition and critical acclaim for her starring role as reporter Gale Weathers in the high-profile slasher horror film Scream (1996), and its sequels Scream 2 (1997) and Scream 3 (2000). The series is one of the highest grossing and critically acclaimed horror franchises of all time.[31][32][33] Cox's character was well known for her \"snappy remarks and being brilliantly bossy\".[34] She met her future husband, David Arquette, who played her on-screen love interest, Dwight \"Dewey\" Riley, while filming the first Scream film.[35]\n\nCox also hosted an episode of the variety sketch series Saturday Night Live in July 1995,[36] and appeared in the crime thriller film The Runner (1999).\n\n2001–2008: Dirt and other projects\n\nCox's major films during this period include the crime drama 3000 Miles to Graceland (2001) and the comedy The Shrink Is In (2001).[37] In late 2003, Cox and Arquette produced one season of the reality television series Mix It Up. The lifestyle series, which aired on the WE cable channel, struggled with low ratings and was not renewed for a second season.[38]\n\nAfter the conclusion of Friends, Cox was producer Marc Cherry's first choice to be offered a starring role as Susan Mayer on Desperate Housewives, but Cox was unavailable due to her pregnancy and the role later went to Teri Hatcher.[39] A few years later, Cox signed a deal with ABC Studios (formerly Touchstone Television) to star in her own series.\n\nShe starred in the independent drama film November (2005), which had a limited theatrical release.[40] She had a cameo appearance in the big-budget remake The Longest Yard (2005) as Lena, the girlfriend of Paul Crewe (Adam Sandler), and co-starred with Tim Allen in the critically derided Zoom (2006).[41] Cox also voiced the role of Daisy in the animated film Barnyard (2006).[42] A Friends reunion film was rumored to be in production following the success of Sex and the City (2008),[43] but this was later denied by Warner Bros. and others.\n\nCox starred as Lucy Spiller, a cynical tabloid editor, in the FX television drama series Dirt, which premiered in 2007. Cox and her then-husband David Arquette were the executive producers of the series.[44] The series was eventually canceled after the second season in 2008.[45] In July 2008, Entertainment Weekly announced that Cox signed on to star in a three-episode arc for the television medical comedy series Scrubs.[46] Also that year, she starred in the fantasy comedy film Bedtime Stories, reuniting with co-star Adam Sandler.[47] She went to executive produce the short drama film The Butler's in Love, directed by David Arquette.\n\n2009–2017: Cougar Town and directorial debut\n\nCox at PaleyFest in 2010\n\nCox guest-starred in a three-episode story arc on former Friends co-star Lisa Kudrow's web comedy series Web Therapy (2009).[48]\n\nIn 2009, she began her role as the star of the single-camera ABC comedy series Cougar Town, playing a newly single 40-year-old mother on the hunt for new experiences.[49][50][51] It is notably Cox's most successful work since Friends, earning her a nomination for the Golden Globe Award for Best Actress – Television Series Musical or Comedy. The series' third season was set to premiere in November 2011, but moved to February 14, 2012. Cox directed two episodes of the series' fifteen episodes that season. The fourth season premiered on January 8, 2013. The series came to an end on March 31, 2015, after six seasons.[52][53]\n\nCox reprised her role as Gale Weathers from the Scream trilogy for the sequel Scream 4. The film was released in theaters on April 15, 2011.[54][55]\n\nCox made her directorial debut and had a cameo appearance in a Lifetime television drama film TalhotBlond, which premiered on the network on June 23, 2012.[56] In 2014, Cox directed and produced the black comedy film Just Before I Go, starring Seann William Scott and Elisha Cuthbert.[57] The film premiered at the Tribeca Film Festival on April 24, 2014,[58] and it was released in select theaters on April 24, 2015.[59]\n\nFrom 2014 to 2017, she executive produced the syndicated game show Celebrity Name Game, hosted by Craig Ferguson. It ended after three seasons. The series earned her a nomination for the Daytime Emmy Award for Outstanding Game Show.[60]\n\nIn 2016, Cox starred in the independent drama film Mothers and Daughters, alongside Susan Sarandon, Mira Sorvino, and Sharon Stone. The film was released to generally negative reviews on May 6, 2016.[61]\n\n2018–present: Current work\n\nIn 2019, she created and executive produced the Facebook Watch documentary series 9 Months with Courteney Cox, which focuses on \"people from across the country of various race, religion, and class as they self-document their 9-month journey of pregnancy\".[62] It lasted for three seasons until 2021.[63] In 2020, she guest starred in the ABC sitcom Modern Family.[64] Cox reunited with her Friends co-stars for a reunion special titled Friends: The Reunion, which was released on May 27, 2021, on HBO Max.[65][66] The special earned Cox a nomination for the Primetime Emmy Award for Outstanding Variety Special (Pre-Recorded).[67]\n\nCox reprised her role as Gale Weathers for the fifth Scream film, which was directed by Matt Bettinelli-Olpin and Tyler Gillett.[68] The film was released on January 14, 2022 to box office success and positive reviews.[69][70]\n\nCox signed on to star alongside Greg Kinnear in the Starz horror comedy series Shining Vale, from creators Sharon Horgan and Jeff Astrof. Cox stars as Patricia \"Pat\" Phelps, who moves her family \"from the 'crazy' of the city to a large, old house in the suburbs where evil and humor collide.\"[71] She is also set to executive produce and star as Brittany Wagner in the Spectrum Originals adaptation of the documentary series Last Chance U.[72]\n\nPersonal life\n\nCox dated actor Michael Keaton from 1989 to 1995.[1] Cox married actor David Arquette on June 12, 1999, at Grace Cathedral in San Francisco.[73][74] The couple have a daughter, born in June 2004.[75][76] Jennifer Aniston is the godmother.[77] Cox revealed that she suffered from postpartum depression six months after the birth of her child.[78] On October 11, 2010, Cox and Arquette announced that they had separated, although they still maintain a close friendship and ongoing business relationship in Coquette Productions.[79][80][81] In June 2012, Arquette filed for divorce after nearly two years of separation from Cox.[82] The divorce became final in May 2013.[83]\n\nCox began dating Snow Patrol band member Johnny McDaid in late 2013.[84] The couple announced their engagement in June 2014.[85] Soon afterward they called off the engagement, but they have remained a couple.[86]\n\nCox states that she does not remember much about being a cast member on 10 seasons of Friends, due to her \"bad memory.\"[87][88] Cox is a practitioner of Budokan karate.[89][90]\n\nFilmography\n\nFilm\n\nTelevision\n\nMusic videos\n\nAwards and honors\n\nHonors\n\nAccolades\n\nNotes\n\n^ Cox was credited as Courteney Cox-Arquette from season six onwards due to her marriage with David Arquette during that time.\n\nReferences", "images": ["http://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/19px-P_vip.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Courteney_Cox_%2710_PaleyFest.jpg/220px-Courteney_Cox_%2710_PaleyFest.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/81/Courteney_Cox_1995.jpg/198px-Courteney_Cox_1995.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/16px-Wikiquote-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/19px-Video-x-generic.svg.png", "http://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/14px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/21px-Blank_television_set.svg.png", "http://upload.wikimedia.org/wikipedia/commons/0/0f/CourteneyCoxFeb09.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/21px-Flag_of_the_United_States.svg.png", "http://en.wikipedia.org/static/images/footer/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/0/0f/CourteneyCoxFeb09.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Wikidata-logo.svg/21px-Wikidata-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/0/0f/CourteneyCoxFeb09.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Courteney_Cox", "title": "Courteney Cox", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/0/0f/CourteneyCoxFeb09.jpg", "width": 640, "height": 941}, "title": "Courteney Cox - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}