{"url": "https://www.theguardian.com/tv-and-radio/2017/jun/09/oprah-winfrey-immortal-life-henrietta-lacks-sky-atlantic", "text": "It is easy to forget, amid everything else she has achieved, that Oprah Winfrey is an Oscar-nominated actor (in 1985, for her role as Sofia in The Color Purple). In The Immortal Life of Henrietta Lacks (Sky Atlantic), an adaptation of the book of the same title by Rebecca Skloot that remained on bestseller lists for six years, she reminds us why. It is her film from beginning to end. She plays Deborah, the emotionally and physically unstable daughter of Henrietta Lacks, who suffers the torments of growing up not just motherless, but abused by family members and tortured by the knowledge that her mother was – and still is – being exploited for other peoples’ gain.\n\nHenrietta Lacks was 31 and a mother of five children when she died at Baltimore’s Johns Hopkins hospital of cervical cancer in 1951. The doctors there took a sample of her malignant tissues as part of their search for a line of cells that were able to survive and reproduce outside the body, and so make possible medical experiments they were not able to perform on living bodies. Henrietta’s cells proved to be the ones, and – by forming the springboard for new treatments for diseases such as TB, flu, herpes, Aids and for the development of chemotherapy – changed the face of medicine for ever.\n\nThe doctors did not ask for their impoverished, black female patient’s consent before they took that sample, out of a combination of professional zeal, arrogance, racism and paternalism whose precise proportions we can never know. Nor did they ever explain to her children whose blood they came and sampled, many times over the years, precisely what they were doing and why. Poor black bodies have a history of being common property. Deborah is keen to have her mother’s story told by Skloot, a science journalist (played here by Rose Byrne, doing fine work in an essentially passive role), although her own paranoia – aggravated of course by the very real exploitation her family has suffered – and the family’s distrust, reticence and other problems impede their progress as much as the medical establishment’s deliberate and accidental (through the loss of records, documentation and so on) obstructions do.\n\nThe film does not do justice to the profoundly careful, detailed and intricate book – nor, more surprisingly, to Henrietta herself, who appears only in brief flashbacks as a beautiful smiling figure of absolute perfection rather than a living being. It touches on all the important themes – the power imbalance between ordinary people and the medical establishment, the historical injustices perpetrated by the latter against black people – but doesn’t have time to expand on or investigate any of them thoroughly. And there are odd, inexplicable pivots such as when Skloot sits down with the family and they suddenly change the habits of a lifetime and begin to “speak on the dead”, providing her and Deborah with stories of Henrietta that they have withheld from her daughter for a lifetime. Why? Because they trust or esteem this white journalist newcomer more than their own kin? It seems unlikely.\n\nBut none of this matters, because Winfrey carries all before her. Part of Deborah is a child still mired in grief, part of her is a savvy adult (“Keep on being white,” she says wryly to Skloot, as she manages to gain access to more information about Henrietta in a few months than the family has managed over years) and all of her is periodically wracked by bouts of mental illness. Winfrey conveys all of Deborah’s violent irascibility, misery and frustration, underlain by her eternal yearning for her lost mother, and breaks your heart at every turn. It is a slalom race of a part and she negotiates every hairpin bend with utter certainty and consummate skill. If the film pushes Henrietta to the edges, it is at least to make room for a performance from Winfrey that tells us all there is to know about the damage that loss, lies and injustice can do to a child, to an adult, to a family and to a society. She is extraordinary.\n\nThe last episode of Paula (BBC2) descended into a maelstrom of madness. I’m still trying to make sense of it, but I’m not entirely sure it’s possible. It was as if someone had gathered up a load of endings from various different thrillers and stuck them together with some very poor quality, nasty-smelling glue.", "images": ["https://i.guim.co.uk/img/uploads/2017/10/09/Lucy-Mangan,-R.png?width=300&quality=85&auto=format&fit=max&s=ac80477b5fecbdb9d0fb635d622b0eea", "https://i.guim.co.uk/img/media/50dc0e70326e6bedff30478a225851d4f91eb47d/1422_245_3051_1831/master/3051.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=34ab7066ab3c80b8abdb7aa88f601a97", "https://sb.scorecardresearch.com/p?c1=2&c2=6035250&cv=2.0&cj=1&cs_ucfr=0&comscorekw=Television%2COprah+Winfrey%2CTelevision+%26+radio%2CCulture", "https://i.guim.co.uk/img/media/50dc0e70326e6bedff30478a225851d4f91eb47d/1422_245_3051_1831/master/3051.jpg?width=465&quality=85&dpr=1&s=none"], "top_img": "https://i.guim.co.uk/img/media/50dc0e70326e6bedff30478a225851d4f91eb47d/1422_245_3051_1831/master/3051.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=34ab7066ab3c80b8abdb7aa88f601a97", "keywords": [], "authors": ["Lucy Mangan"], "canonical_link": "https://www.theguardian.com/tv-and-radio/2017/jun/09/oprah-winfrey-immortal-life-henrietta-lacks-sky-atlantic", "title": "The Immortal Life of Henrietta Lacks review – Oprah is extraordinary", "meta_data": {"description": "There are odd moments, inexplicable pivots and it fails to do justice to its eponymous hero, but none of that matters when Winfrey is on screen. Plus, a maelstrom of madness in the Paula finale", "viewport": "width=device-width,minimum-scale=1,initial-scale=1", "theme-color": "#052962", "og": {"url": "http://www.theguardian.com/tv-and-radio/2017/jun/09/oprah-winfrey-immortal-life-henrietta-lacks-sky-atlantic", "image": {"identifier": "https://i.guim.co.uk/img/media/50dc0e70326e6bedff30478a225851d4f91eb47d/1422_245_3051_1831/master/3051.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=34ab7066ab3c80b8abdb7aa88f601a97", "height": 720}, "title": "The Immortal Life of Henrietta Lacks review – Oprah is extraordinary", "description": "There are odd moments, inexplicable pivots and it fails to do justice to its eponymous hero, but none of that matters when Winfrey is on screen. Plus, a maelstrom of madness in the Paula finale", "type": "article", "site_name": "the Guardian"}, "article": {"author": "https://www.theguardian.com/profile/lucymangan", "publisher": "https://www.facebook.com/theguardian", "modified_time": "2018-06-19T11:24:02.000Z", "section": "Television & radio", "published_time": "2017-06-09T05:00:47.000Z", "tag": "Television,Oprah Winfrey,Television & radio,Culture"}, "al": {"ios": {"url": "gnmguardian://tv-and-radio/2017/jun/09/oprah-winfrey-immortal-life-henrietta-lacks-sky-atlantic?contenttype=Article&source=applinks", "app_store_id": 409128287, "app_name": "The Guardian"}}, "fb": {"app_id": 180444840287}, "twitter": {"dnt": "on", "app": {"id": {"iphone": 409128287, "ipad": 409128287, "googleplay": "com.guardian"}, "name": {"googleplay": "The Guardian", "ipad": "The Guardian", "iphone": "The Guardian"}, "url": {"googleplay": "guardian://www.theguardian.com/tv-and-radio/2017/jun/09/oprah-winfrey-immortal-life-henrietta-lacks-sky-atlantic", "iphone": "gnmguardian://tv-and-radio/2017/jun/09/oprah-winfrey-immortal-life-henrietta-lacks-sky-atlantic?contenttype=Article&source=twitter", "ipad": "gnmguardian://tv-and-radio/2017/jun/09/oprah-winfrey-immortal-life-henrietta-lacks-sky-atlantic?contenttype=Article&source=twitter"}}, "card": "summary_large_image", "creator": "@LucyMangan", "image": "https://i.guim.co.uk/img/media/50dc0e70326e6bedff30478a225851d4f91eb47d/1422_245_3051_1831/master/3051.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&s=ebbe218b2b4a43528b6ced2082ed6929", "site": "@guardian"}, "robots": "max-image-preview:large"}, "movies": [], "publish_date": 1496962800.0, "source": "https://www.theguardian.com", "summary": ""}