{"url": "https://web.archive.org/web/20170622002628/http://www.allure.com:80/story/kim-kardashian-difference-between-kkw-beauty-kylie-cosmetics", "text": "When Kim Kardashian announced that she'll be launching her own beauty line called KKW Beauty, the Internet was a little too quick to say she was trying to steal her sister Kylie Jenner's throne. Over the past week, people made up stories about them being in competition, but the reality is nothing like that. Two sisters can have their own makeup companies without malicious intent. In a recent interview with Women's Wear Daily , Kardashian broke down the differences between KKW Beauty and Kylie Cosmetics. Spoiler alert: They are completely different — just take their ages and audiences as the biggest indicator.\n\nEven though KKW Beauty and Kylie Cosmetics are produced by Seed Beauty (the parent company for ColourPop as well) and they both started off with kits, the beauty brands have different focuses. Kylie Cosmetics has firmly marked its territory in the lip category with the popular Lip Kit (and Jenner's infamous plump pout). KKW Beauty, on the other hand, will focus on what the Kardashians are known for: contouring. That's where the new beauty brand's first product, a cream contouring kit, comes in.\n\nLoading View on Instagram\n\nAlso, don't expect massive, holiday-themed collections from KKW Beauty. Although Kardashian assured WWD that she wants to release new items monthly, she added that she might “not have as many drops [as Jenner] and I don’t have all the color kits that she does.”\n\nInstead of focusing on bold lipsticks and bold eye shadow palettes, Kardashian plans to focus on skin. A concealer kit will come out in about two months, WWD reports. “A lot of my stuff is going to be for skin.…[I’m] trying to mirror skin care with makeup,\" Kardashian told the publication. \"It’s going to be a different vibe; it’s not going to be a full color cosmetics [range] with shadows and all of that to start. I will probably do some kits here and there of specific [makeup] looks I’ve done and keep it within the looks.\"\n\nAnother difference is that the upcoming Creme Contour & Highlight Kit probably won't sell out as quick as the first Lip Kits did. That's a good thing. Why? Kardashian worked with Seed Beauty to prepare for the demand. “We have a good model, and even from our lip kit we have a really good general idea of what our customer is going to be like,\" Kardashian told WWD. \"We are definitely prepared for the demand.…I know they [Seed Beauty] do make a mass volume. It’s not like we’re making a small quantity and it’s selling out.\" Hallelujah.\n\nKKW Beauty officially launches Wednesday, June 21, on kkwbeauty.com .\n\nMore on Kim Kardashian:\n\nNow, check out Kim Kardashian's style evolution:\n\nFollow Devon Abelman on Twitter and Instagram .", "images": ["https://web.archive.org/web/20170622002628im_/http://www.allure.com/images/logo-allure.svg", "data:image/gif;base64,R0lGODlhAQABAIABAP///wAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://web.archive.org/web/20170622002628im_/https://media.allure.com/photos/5947d1fd4343936458f479e6/master/pass/19121721_771889382987113_2800307973933498368_n.jpeg"], "top_img": "https://web.archive.org/web/20170622002628im_/https://media.allure.com/photos/5947d1fd4343936458f479e6/master/pass/19121721_771889382987113_2800307973933498368_n.jpeg", "keywords": [], "authors": ["Devon Abelman"], "canonical_link": "https://web.archive.org/web/20170622002628/http://www.allure.com/story/kim-kardashian-difference-between-kkw-beauty-kylie-cosmetics", "title": "Kim Kardashian Just Revealed the Difference Between KKW Beauty and Kylie Cosmetics", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "user-scalable=no, width=device-width, initial-scale=1, maximum-scale=1", "author": "Devon Abelman", "copyright": "Copyright (c) Cond&#233; Nast 2017", "description": "With KKW Beauty launching this week, Kim Kardashian explains how her beauty brand differs from Kylie Cosmetics.", "keywords": "kim kardashian,kkw beauty,kylie jenner,kylie cosmetics", "og": {"description": "Spoiler alert: They aren't in competition.", "image": "https://web.archive.org/web/20170622002628im_/https://media.allure.com/photos/5947d1fd4343936458f479e6/master/pass/19121721_771889382987113_2800307973933498368_n.jpeg", "site_name": "Allure", "title": "Kim Kardashian Just Revealed the Difference Between KKW Beauty and Kylie Cosmetics", "type": "article", "url": "https://web.archive.org/web/20170622002628/http://www.allure.com/story/kim-kardashian-difference-between-kkw-beauty-kylie-cosmetics"}, "twitter": {"card": "summary_large_image", "creator": "@Allure_magazine", "description": "Spoiler alert: They aren't in competition.", "domain": "www.allure.com", "image": {"src": "https://web.archive.org/web/20170622002628im_/https://media.allure.com/photos/5947d1fd4343936458f479e6/master/pass/19121721_771889382987113_2800307973933498368_n.jpeg?mbid=social_retweet"}, "site": "Allure_magazine", "title": "Kim Kardashian Just Revealed the Difference Between KKW Beauty and Kylie Cosmetics"}, "fb": {"pages": 24810773606, "page_id": 24810773606, "admins": "648235154,789168297,688620285"}, "news_keywords": "Makeup,kim kardashian,kkw beauty,kylie jenner,kylie cosmetics"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}