{"url": "https://en.wikipedia.org/wiki/William_(The_X-Files)", "text": "The X-Files named \"William\", see For the character fromnamed \"William\", see Baby William\n\n16th episode of the 9th season of The X-Files\n\n\"William\" is the sixteenth episode of the ninth season of the American science fiction television series The X-Files, which originally aired on the Fox network on April 28, 2002. The teleplay of the episode was written by series creator Chris Carter, from a story by former series star David Duchovny, Carter, and executive producer Frank Spotnitz; the entry was directed by Duchovny. \"William\" helps to explore the series' overarching mythology. The episode received a Nielsen household rating of 5.8, being watched by 6.1 million households and 9.3 million viewers upon its initial broadcast. It received mixed reviews from television critics, many of whom were unhappy with the episode's conclusion.\n\nThe show centers on FBI special agents who work on cases linked to the paranormal, called X-Files; this season focuses on the investigations of John Doggett (Robert Patrick), Monica Reyes (Annabeth Gish), and Dana Scully (Gillian Anderson). In this episode, Doggett finds a strange, disfigured man (Chris Owens) in the X-Files office and, on his whim, they test his DNA. They learn that the man shares DNA with Fox Mulder (Duchovny), and may possibly even be him. The answers become even more surprising when Scully's son, baby William, is put on the line.\n\n\"William\" marked the return of David Duchovny to the series, after his departure following the eighth season finale \"Existence\". The genesis for the episode was a storyline Duchovny had developed during the series' eighth season; he originally pitched an idea featuring a mysteriously disfigured person introducing himself to Scully and admitting that he possessed a connection to Mulder. Chris Owens, whose character Jeffrey Spender had previously been killed off in the sixth season episode \"One Son\", was asked to return to the series for the episode.\n\nPlot [ edit ]\n\nIn the teaser, a couple, the Van De Kamps (Adam Nelson and Shannon Hile), adopt Dana Scully's (Gillian Anderson) infant son, William (James and Travis Riker). The episode then jumps back a week. Scully takes William out of her car while an unknown man (Chris Owens) watches them. Later, John Doggett (Robert Patrick) is attacked in the X-Files office by the same man. After a struggle, Doggett subdues him. His face is revealed to be horribly scarred.\n\nLater, Scully speaks with the man. He claims he received his burns due to alien testing and that he knew Fox Mulder (David Duchovny). He further elaborates that he was sent to the FBI to retrieve certain files. Scully suspects the man is lying, but asks to examine his burns to investigate his strange claims. He notes that they are the result of an injection that failed to transform him into one of the aliens. The man claims a new conspiracy has formed after the previous one was destroyed; the new one being hidden within the government and the conspirators involved being alien. Doggett theorizes that the man is actually Mulder. Scully takes the man to her house to give him the files he seeks. Suddenly, William begins to cry, only to be quieted when the scarred man picks him up. Meanwhile, Walter Skinner (Mitch Pileggi) meets with Doggett and the two discuss the idea that the man is actually Mulder. Skinner points out the inconsistencies in Doggett's reasoning, but a DNA test is undertaken anyway.\n\nScully is told by the scarred man that William is part alien and that she is being used to raise the child. Monica Reyes (Annabeth Gish) and Doggett tell Scully that the man's DNA is a match to Mulder's, but Scully refuses to believe it. While the three are talking, the scarred man quietly slips into William's room with a syringe. Though William's crying alerts the agents, the scarred man manages to sneak out of the room before they reach William. Reyes and Scully take the baby to the hospital and Doggett discovers the man's syringe. The doctor reports that William is fine except for an elevated amount of iron in his blood. In interrogation, Scully confronts the scarred man about his motives. It is revealed that he is actually Jeffrey Spender, a former FBI agent supposedly killed by The Smoking Man (William B. Davis) three years earlier. Spender is also Mulder's half-brother. Spender admits his actions were a ruse and that the syringe contained magnetite meant to make William normal. He explains that the aliens need the child in order to successfully invade the world, but now they have lost him. However, he notes that the conspirators will always pursue the child, despite what he has done. Spender says that he acted out of his hatred for his father, since the new conspiracy was created by The Smoking Man after the alien rebels burned the original group.\n\nScully muses over Spender's words and decides that the only way to truly protect William is to give him up for adoption so that he may have a better life. The episode then jumps to the Van De Kamps, who tuck in their new son. William looks at his mobile but he can no longer move it telekinetically, an event which happened in \"Nothing Important Happened Today\".[2]\n\nProduction [ edit ]\n\nThe story for \"William\" was written by former series co-star David Duchovny, series creator Chris Carter, and executive producer Frank Spotnitz; the screenplay was written solely by Carter, and the entry was directed by Duchovny.[3][4] \"William\" marked the return of David Duchovny, in some capacity, to the series, after his departure following the eighth season finale \"Existence\". In fact, Duchovny makes a cameo appearance in the episode, appearing as a reflection in Scully's eye.[4]\n\nThe genesis for the episode was a storyline Duchovny had developed during the series' eighth season. He had originally pitched an idea featuring a mysteriously disfigured person introducing himself to Scully and admitting that he has a connection to Mulder. Reportedly, the idea for Scully to give William up for adoption was mandated by Carter and Spotnitz. Duchovny, Anderson, and executive producer John Shiban were not happy with this turn of events, due to them being parents and feeling that the action was not realistic. In the end, they \"grudgingly consented\".[5]\n\nThree years after Spender had been written out of the series—in the sixth season episode \"One Son\"—and actor Chris Owens had moved to Toronto, Ontario, in Canada, Owens received an unexpected phone call from David Duchovny, who said that The X-Files' production crew was filming the series' finale as well as another episode late in the season, and that he wanted to bring Spender back for these two episodes. Duchovny reassured Owens that Spender's survival would be explained away via the plot device of an alien injection but mentioned that the experience would not be fun for Owens, as he would be \"under all that shit\"; Owens did not realize what Duchovny meant until he got to the studio and personally saw the makeup for Spender's disfigured appearance, a sight that shocked Owens.[6]\n\nBroadcast and reception [ edit ]\n\n\"William\" originally aired on the Fox network on April 28, 2002, and was first broadcast in the United Kingdom on BBC One on March 2, 2003.[3] The episode's initial broadcast was viewed by approximately 6.1 million households,[nb 1] and 9.3 million viewers.[8] \"William\" earned a Nielsen household rating of 5.8, meaning that roughly 5.8 percent of all television-equipped households, were tuned in to the episode. It was the fifty-fourth most watched episode of television that aired during the week ending April 28.[7] The episode was later included on The X-Files Mythology, Volume 4 – Super Soldiers, a DVD collection that contains episodes involved with the alien super soldiers arc.[9]\n\nThe episode received mixed reviews from television critics. Jessica Morgan from Television Without Pity gave the episode an A− grade.[10] Robert Shearman and Lars Pearson, in their book Wanting to Believe: A Critical Guide to The X-Files, Millennium & The Lone Gunmen, rated the episode three stars out of five. The two criticized the idea that Scully would give her child up for adoption solely based on the word of Jeffrey Spender, noting \"if she wasn't going to give it away for the sake of its own protection after a UFO cult abducted it [in 'Provenance'/'Providence'], then why should she because Jeffrey Spender of all people comes along and informs her that it's under threat?\"[11] Shearman and Pearson, however, did praise Chris Owens' acting, writing that he did a \"great job\".[11] Tom Kessenich, in his book Examinations, wrote a largely negative review of the episode and derided its plot. He heavily criticized the idea that Scully would offer William up for adoption. Kessenich did, however, praise Duchovny's directing, noting that \"[he] did a masterful job of luring me back to this world of The X-Files\".[12] Aaron Kinney from Salon wrote that the episode \"scuttled the entire\" baby William subplot.[13] M.A. Crang, in his book Denying the Truth: Revisiting The X-Files after 9/11, praised the decision to conclude the William subplot but called the episode's conclusion \"sappy\".[14]\n\nNotes [ edit ]\n\n^ [7] Thus, 5.8 percent of 105.5 million is 6.1 million households. At the time of airing, the estimated number of households was 105.5 million.Thus, 5.8 percent of 105.5 million is 6.1 million households.\n\nBibliography [ edit ]\n\nThis article incorporates material derived from the \"William (episode)\" article on the X-Files wiki at Fandom (formerly Wikia) and is licensed under the Creative Commons Attribution-Share Alike License (July 15, 2012).", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/94/Symbol_support_vote.svg/19px-Symbol_support_vote.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/David_Duchovny_2011_Shankbone.JPG/200px-David_Duchovny_2011_Shankbone.JPG", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/32px-Blank_television_set.svg.png", "https://upload.wikimedia.org/wikipedia/en/4/46/MulderinEyeScully.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/46/MulderinEyeScully.jpg/250px-MulderinEyeScully.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/4/46/MulderinEyeScully.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/William_(The_X-Files)", "title": "William (The X-Files)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/4/46/MulderinEyeScully.jpg", "width": 640, "height": 354}, "title": "William (The X-Files) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}