{"url": "https://deadline.com/2018/01/happy-renewed-season-2-syfy-1202269250/", "text": "Ahead of Happy!’s Season 1 finale this week (Jan. 31), the quirky comedy series starring Christopher Meloni and featuring the voice of Patton Oswalt has been renewed for a second season.\n\nPrimetime-Panic Your Complete Guide to Pilots and Straight-to-Series orders See All\n\nHappy! has been a breakout hit for Syfy. Its Dec. 7 premiere set a new benchmark for the network in Live+3 ratings with 1.708 million viewers in total viewers and 779,000 adults 18-49, ranking as Syfy’s best series premiere since The Magicians in January 2016 across all key demos. In addition, the premiere opened strong on social, drawing more than 212 million impressions on Twitter.\n\n“Happy! struck a chord with our Syfy audience and disrupted the TV landscape with its unique storytelling and outrageous performances led by Christopher Meloni,” said Chris McCumber, President, Entertainment Networks, NBCUniversal Cable Entertainment. “If people thought this season was crazy – I can’t wait for fans to see what Grant Morrison, Brian Taylor and the entire cast and crew have in store for Sax and Happy!”\n\nBased on Grant Morrison and Darick Robertson’s graphic novel of the same name, Happy! follows Nick Sax (Meloni) – an intoxicated, corrupt ex-cop turned hit man – who is adrift in a world of casual murder, soulless sex and betrayal. After a hit gone wrong, his inebriated life is forever changed by a tiny, relentlessly positive, imaginary blue winged horse named Happy (Oswalt). In the must-see finale, Sax and Happy are locked in a climatic confrontation to rescue Hailey (Bryce Lorenzo) from Very Bad Santa’s (Joseph Reitman) lair, as Merry (Lili Mirojnick) sets out to save Amanda (Medina Senghore) from a far more powerful foe. The series also stars Ritchie Coster (Blue) and Patrick Fischler (Smoothie).\n\nHappy! is executive produced by Morrison and Brian Taylor, who co-wrote the pilot teleplay, as well as Neal Moritz, Pavun Shetty and Toby Jaffe of Original Film, Meloni and showrunner Patrick Macmanus.", "images": ["https://deadline.com/wp-content/uploads/2017/10/happy.jpg?w=681&h=383&crop=1", "https://deadline.com/wp-content/uploads/2017/05/syfy-new-black-logo-featured.jpg", "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://deadline.com/wp-content/plugins/lazy-load-0.7/images/1x1.trans.gif", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://deadline.com/wp-content/uploads/2017/10/happy.jpg?w=807", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1"], "top_img": "https://deadline.com/wp-content/uploads/2017/10/happy.jpg?w=807", "keywords": [], "authors": ["Nellie Andreeva"], "canonical_link": "https://deadline.com/2018/01/happy-renewed-season-2-syfy-1202269250/", "title": "‘Happy!’ Renewed For Season 2 By Syfy", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "Ahead of Happy!'s Season 1 finale, the quirky comedy series starring Christopher Meloni has been renewed for a second season.", "news_keywords": "Happy, Syfy", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=533209613", "generator": "WordPress 6.0.2", "author": "Nellie Andreeva", "theme-color": "#fff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Deadline", "application-name": "Deadline", "content_type": "Article", "post_id": 1202269250, "title": "'Happy!' Renewed For Season 2 By Syfy", "published_at": "2018-01-29 12:00:25", "image": "https://deadline.com/wp-content/uploads/2017/10/happy.jpg?w=296&h=166&crop=1", "comment_count": 30, "tags": "Syfy", "topics": "TV", "body": "Ahead of Happy!'s Season 1 finale this week (Jan. 31), the quirky comedy series starring Christopher Meloni and featuring the voice of Patton Oswalt has been renewed for a second season.\r\n\r\nHappy! has been a breakout hit for Syfy. Its Dec. 7 premiere set a new benchmark for the network in Live+3 ratings with 1.708 million viewers in total viewers and 779,000 adults 18-49, ranking as Syfy’s best series premiere since The Magicians in January 2016 across all key demos. In addition, the premiere opened strong on social, drawing more than 212 million impressions on Twitter.\r\n\r\n\r\n\r\n“Happy! struck a chord with our Syfy audience and disrupted the TV landscape with its unique storytelling and outrageous performances led by Christopher Meloni,” said Chris McCumber, President, Entertainment Networks, NBCUniversal Cable Entertainment. “If people thought this season was crazy – I can’t wait for fans to see what Grant Morrison, Brian Taylor and the entire cast and crew have in store for Sax and Happy!”\r\n\r\nBased on Grant Morrison and Darick Robertson’s graphic novel of the same name, Happy! follows Nick Sax (Meloni) – an intoxicated, corrupt ex-cop turned hit man – who is adrift in a world of casual murder, soulless sex and betrayal. After a hit gone wrong, his inebriated life is forever changed by a tiny, relentlessly positive, imaginary blue winged horse named Happy (Oswalt). In the must-see finale, Sax and Happy are locked in a climatic confrontation to rescue Hailey (Bryce Lorenzo) from Very Bad Santa’s (Joseph Reitman) lair, as Merry (Lili Mirojnick) sets out to save Amanda (Medina Senghore) from a far more powerful foe. The series also stars Ritchie Coster (Blue) and Patrick Fischler (Smoothie).\r\n\r\nHappy! is executive produced by Morrison and Brian Taylor, who co-wrote the pilot teleplay, as well as Neal Moritz, Pavun Shetty and Toby Jaffe of Original Film, Meloni and showrunner Patrick Macmanus.", "fb": {"pages": 105558754896}, "onesignal": "wordpress-plugin", "fragment": "!", "og": {"type": "article", "title": "‘Happy!’ Renewed For Season 2 By Syfy", "url": "https://deadline.com/2018/01/happy-renewed-season-2-syfy-1202269250/", "description": "Ahead of Happy!’s Season 1 finale this week (Jan. 31), the quirky comedy series starring Christopher Meloni and featuring the voice of Patton Oswalt has been renewed for a second season. Happ…", "site_name": "Deadline", "image": {"identifier": "https://deadline.com/wp-content/uploads/2017/10/happy.jpg?w=807", "width": 807, "height": 425, "alt": "Happy!"}, "locale": "en_US"}, "article": {"published_time": "2018-01-29T20:00:25+00:00", "modified_time": "2018-01-29T20:02:34+00:00"}, "twitter": {"site": "@DEADLINE", "creator": "@DeadlineNellie", "card": "summary_large_image", "title": "‘Happy!’ Renewed For Season 2 By Syfy", "description": "Ahead of Happy!'s Season 1 finale, the quirky comedy series starring Christopher Meloni has been renewed for a second season.", "image": "https://deadline.com/wp-content/uploads/2017/10/happy.jpg?w=807"}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1517256025.0, "source": "https://deadline.com", "summary": ""}