{"url": "https://en.wikipedia.org/wiki/Ivanka_Trump", "text": "American businesswoman (born 1981)\n\nThis article is about a daughter of Donald Trump. For Donald Trump's first wife, see Ivana Trump\n\nIvana Marie \"Ivanka\" Trump ( ; born October 30, 1981) is an American businesswoman and the first daughter of Donald Trump, 45th president of the United States from 2017 to 2021. She was a senior advisor in his administration, and also was the director of the Office of Economic Initiatives and Entrepreneurship.[2][3][4] She is the daughter of Trump's first wife, Ivana, and is the first Jewish member of an American first family, having converted before marrying her Jewish husband, Jared Kushner.[5][6]\n\nShe was an executive vice president of the family-owned Trump Organization. She was also a boardroom judge on her father's TV show, The Apprentice.[7][8][9] Starting in March 2017, Trump left the Trump Organization to become a senior adviser in her father's presidential administration alongside Jared Kushner. After ethics concerns were raised about her having access to classified material while not being held to the same restrictions as a federal employee, Trump agreed to voluntarily file \"financial disclosure forms required of federal employees and be bound by the same ethics rules\".[10][11] While serving in the White House, she continued to operate her clothing brand business until July 2018, which also raised ethics concerns, specifically conflicts of interest.[12] Trump was considered part of the president's inner circle even before becoming an official employee in his administration.[13]\n\nEarly life\n\nTrump was born on October 30, 1981,[14] in Manhattan, New York City, as the second child and first daughter of Czech-American model Ivana (née Zelníčková)[15] and Donald Trump.[16] Her father has German[17] and Scottish ancestry.[18] For most of her life, she has been nicknamed \"Ivanka\", a Slavic diminutive form of her first name Ivana.[19][20] Her parents divorced in 1992 when she was 10 years old.[16][21] She has two brothers, Donald Jr. and Eric, a half-sister, Tiffany, and a half-brother, Barron.\n\nShe attended Christ Church and the Chapin School in Manhattan until age 15 when she switched to Choate Rosemary Hall in Wallingford, Connecticut.[22] When Trump was attending boarding school as a teenager, she began modeling \"on weekends and holidays and absolutely not during the school year,\" according to her late mother, Ivana.[23] In May 1997, she was featured on the cover of Seventeen which ran a story on \"celeb moms & daughters\".[24][23]\n\nAfter graduating from Choate in 2000,[25] Trump attended Georgetown University for two years before transferring to the Wharton School of the University of Pennsylvania, from which she graduated cum laude with a bachelor's degree in economics in 2004.[26][27] She converted to Judaism in 2009[28][29] and, following her father's inauguration into the White House, she became the first Jewish member of an American first family.\n\nCareer\n\nBusiness\n\nAfter graduating from Wharton, her father's alma mater, Trump briefly worked for Forest City Enterprises. She joined the Trump Organization as Executive Vice President of Development & Acquisitions in 2005.[30][31]\n\nIn February 2012,[32] Trump led the Request for Proposal (RFP) with the GSA, resulting in the final selection of The Trump Organization to develop the historic Old Post Office (Washington, D.C.).[33] She then oversaw the conversion of the building into a hotel, which opened in 2016.[34][35][36]\n\nSoon after joining the Trump Organization in an executive position, she started her jewelry, shoe, and apparel lines, and appeared in advertisements promoting the Trump Organization and her products. Trump was also featured in women's and special interest publications and was featured on the cover of some, such as Harper's Bazaar, Forbes Life, Golf Magazine, Town & Country, and Vogue.[37][38]\n\nShe was featured on the cover of Stuff in August 2006 and again in September 2007.[39]\n\nIn 2007, Trump formed a partnership with Dynamic Diamond Corp., the company of diamond vendor Moshe Lax, to create Ivanka Trump Fine Jewelry, a line of diamond and gold jewelry sold at her first flagship retail store in Manhattan.[40][41] In November 2011, her flagship moved from Madison Avenue to 109 Mercer Street, a larger space in the SoHo district.[42][43] Celebrities were spotted wearing her jewelry including Jennifer Lopez on the cover of Glamour[44] and Rihanna on the cover of W Magazine.[45] Her brand was named “Launch of the Year’ in 2010 by Footwear News.[46] Trump's brand went on to win other awards.[47] In December 2012, members of 100 Women in Hedge Funds elected Trump to their board.[48] Her company eventually grew to over $500 million in sales annually.[49] Trump closed down the company and separated herself from her business affiliations at the Trump Organization after she moved to DC to serve as a senior advisor in her father's White House.[50][51]\n\nOn October 2, 2015, it was reported that \"Ivanka Trump's flagship store on Mercer Street appear[s] to be closed\" and, noting that the shop had been \"stripped clean\".[52] In October 2016, the only dedicated retail shop and flagship boutique for Ivanka Trump Fine Jewelry was located at Trump Tower in Manhattan, with her brand also being available at Hudson's Bay and fine-jewelry stores throughout the U.S. and Canada, as well as in Bahrain, Kuwait, Qatar, Saudi Arabia, and the United Arab Emirates.[53]\n\nShe also had her own line of Ivanka Trump fashion items, which included clothes, handbags, shoes, and accessories, available in U.S. and Canadian department stores including Macy's and Hudson's Bay.[54] In 2017, Aquazzura Italia SRL sued Trump for allegedly stealing their designs; the suit was settled.[55] Her brand was criticized by PETA and other animal rights activists for using rabbit fur.[56][57][58][59] Ivanka Trump-brand shoes have been supplied by Chengdu Kameido Shoes in Sichuan and Hangzhou HS Fashion (via G-III Apparel Group) in Zhejiang.[60]\n\nBetween March and July 2016, Trump applied for 36 trademarks in China. Seven were approved between her father's inauguration in January 2017 and Chinese President Xi Jinping's state visit in the U.S. in April. Three provisional trademarks for handbags, jewelry, and spa services were granted on the day Xi dined with President Trump and his family at Mar-a-Lago.[61] According to a trademark lawyer, the process usually takes 18 to 24 months. A Chinese government spokesman said that \"the government handles all trademark applications equally.\"[62]\n\nOn February 2, 2017, after months of customers boycotting and poor sales,[63] department store chains Neiman Marcus and Nordstrom dropped Trump's fashion line, citing \"poor performance.\"[64] Other retailers such as Marshall's, TJ Maxx and the Hudson's Bay Company stopped selling her products.[65][66] In June 2017, three people with the organization called China Labor Watch were arrested by Chinese authorities while investigating Huajian International, which makes shoes for several American brands, including Trump's brand. The Trump Administration called for their release.[67][68]\n\nOn July 24, 2018, Trump announced that she shut down her company after deciding to pursue a career in public policy instead of returning to her fashion business.[69][70][12]\n\nTrump in July 2007\n\nTelevision\n\nThe Apprentice\n\nIn 2006, Trump filled in for Carolyn Kepcher on five episodes of the fifth season of her father's television program The Apprentice, first appearing to help judge the Gillette task in week 2.[71] Like Kepcher, Trump visited the site of the tasks and spoke to the teams.[39] Trump collaborated with season 5 winner Sean Yazbeck on his winner's project of choice, Trump SoHo Hotel-Condominium.[72][73][74][75]\n\nShe replaced Kepcher as a primary boardroom judge during the sixth season of The Apprentice and its follow-up iteration, Celebrity Apprentice.[76]\n\nOther TV appearances\n\nIn 1997, at the age of 15, Trump co-hosted the Miss Teen USA Pageant, which was partially owned by her father, Donald Trump, from 1996 to 2005.[23]\n\nIn 2006, Trump was a guest judge on Project Runway's third season, alongside Heidi Klum, Nina Garcia, and Vera Wang. She reappeared as a guest judge on season 4 of Project Runway All-Stars in 2014 and 2015, alongside host Alyssa Milano, judges Georgina Chapman and Isaac Mizrahi, and guest judges Betsey Johnson, Michael Bastian, Elie Tahari, Nina Garcia, and Zac Posen.[77]\n\nIn 2010, Trump and her husband made a cameo portraying themselves in Season 4 Episode 6 of Gossip Girl.[78]\n\nModeling\n\nWhen Trump was attending boarding school as a teenager, she began modeling \"on weekends and holidays and absolutely not during the school year,\" according to her late mother, Ivana Trump.[79] She was featured in advertisements for Tommy Hilfiger,[79] Elle,[80] Vogue,[81] Teen Vogue,[82] Harper's Bazaar,[83] and Thierry Mugler,[84] She also engaged in fashion runway work.[85][84][86][87] In May 1997, she was featured on the cover of Seventeen.[88]\n\nTrump has been profiled in many women's fashion magazines, including Vogue,[89] Glamour,[90] Marie Claire,[91] and Elle.[92] She was featured on covers such as Harper's Bazaar,[83] Forbes, Forbes Life,[93] Marie Claire, Golf Digest,[94] Town & Country,[95] Elle Décor,[96] Shape,[97] and Stuff magazine.[98]\n\nTrump was featured in Vanity Fair's annual International Best Dressed List in 2007 and 2008.[99]\n\nBooks\n\nIn October 2009, Trump's first self-help book, The Trump Card: Playing to Win in Work and Life, was published; according to ghostwriter Daniel Paisner, he co-wrote the book.[100][101]\n\nIn May 2017, her second self-help book, Women Who Work: Rewriting the Rules for Success, was published; she used the services of a writer, a researcher, and a fact-checker.[102][103][104] The book debuted in the number four spot in the \"Advice, How-To and Misc.\" category of The New York Times Best Seller list. Trump donated the unpaid portion of her advance and all future royalties received from Women Who Work to the Ivanka M. Trump Charitable Fund, which makes grants that empower women and girls.[105] She donated $200,000 in royalties to the National Urban League and the Boys and Girls Clubs of America.[106] Trump funded a Women's Entrepreneur Center at the National Urban League in Baltimore, Maryland, after visiting the facility with Marc Morial, President of the National Urban League.[102]\n\nTrump campaign and administration\n\n2016 presidential campaign and election\n\nIn 2015, Ivanka Trump introduced her father, Donald J. Trump, at Trump Tower as he announced his candidacy for president of the United States.[107][108] In 2015, she publicly endorsed her father's presidential campaign. She was involved with the campaign by making public appearances to support and defend him.[109][110][111] However, she admitted mixed feelings about his presidential ambitions, saying in October 2015, \"As a citizen, I love what he's doing. As a daughter, it's obviously more complicated.\"[112] In August 2015, Donald Trump stated that she was his leading advisor on \"women's health and women\" and said it was she who propelled him to elaborate on his views of women.[113]\n\nTrump speaks at her father's presidential campaign in September 2016\n\nIn January 2016, Trump was featured in a radio ad that aired in the early voting states of Iowa and New Hampshire, in which she praised her father.[114][115] She appeared by his side following the results of early voting states in 2016, in particular briefly speaking in South Carolina.[116][117] She was not able to vote in the New York primary in April 2016 because she had missed the October 2015 deadline to change her registration to Republican.[118]\n\nTrump introduced her father in a speech immediately before his own speech at the 2016 Republican National Convention (RNC) in July.[119] The George Harrison song \"Here Comes the Sun\" was used as her entrance music. She stated, \"One of my father's greatest talents is the ability to see the potential in people\", and said he would \"Make America Great Again.\"[120] Her speech was well received as portraying Donald Trump \"in a warmer-than-usual light\", according to The Washington Post.[121] An earlier Post article had questioned whether the policy positions Ivanka Trump espoused were closer to those of Hillary Clinton than to those of her father.[122] After the speech, the George Harrison estate complained about the use of his song as being offensive to their wishes.[123] The next morning, Ivanka's official Twitter account tweeted, \"Shop Ivanka's look from her #RNC speech\" with a link to a Macy's page that featured the dress she wore.[124]\n\nAfter her father's election, Trump wore a bracelet on a family appearance with the president-elect on 60 Minutes. Her company then used an email blast to promote the bracelet. After critiques for \"monetization\", the company quickly apologized, calling the publicity the work of \"a well-intentioned marketing employee at one of our companies who was following customary protocol.\" A spokeswoman said the company was, post-election, \"proactively discussing new policies and procedures with all of our partners going forward.\"[125][126] Trump has collected the work of artists who have protested to her directly following her father's election victory. In January 2017, artist Richard Prince returned a $36,000 payment he received for a work featuring Ivanka and disavowed its creation.[127] Other artists joined behind a movement created by the Halt Action Group called @dear_ivanka, which aimed to change Trump's policies by appealing to Ivanka.[128] Among its supporters were contemporary artist Alex Da Corte who told Trump to stay away from his paintings after she appeared in front of one on a social media post.[129][128]\n\nOn Friday, January 20, 2017, she attended the inauguration of Donald Trump as the 45th president of the United States, at the United States Capitol Building in Washington, D.C. Ivanka Trump partly negotiated rates of hotel rooms, rental spaces, and meals at the Trump International Hotel in Washington, D.C., on which her father's inaugural committee spent funds, WNYC and ProPublica reported in December 2018.[130]\n\nAs of May 20, 2019 , the United States attorney for the District of Columbia requested some documents about her and her sibling's role in her father's inauguration,[131] although Trump did not have \"any official role in running the committee\".[132]\n\nAdvisor to the President of the United States\n\nIn January 2017, Trump resigned from her position at the Trump Organization.[133] The organization also removed images of Trump and her father from their websites, in accordance with official advice on federal ethics rules.[134]\n\nAfter advising her father in an unofficial capacity for the first two months of his administration, Trump was appointed \"First Daughter and Advisor to the President,\"[135][136] a government employee, on March 29, 2017;[137][138][n 1] She takes no salary.[135][137] Prior to becoming a federal employee, she used a personal email for government work.[142] She also became the head of the newly established Office of Economic Initiatives and Entrepreneurship.[3][4]\n\nAmid the contentious early months of her father's administration, some commentators compared her role in the administration to that of Julie Nixon Eisenhower, daughter of President Richard Nixon. Nixon Eisenhower was one of the Nixon administration's most vocal defenders, and Trump defended the Trump administration and her father personally against a myriad of allegations.[143][144] Washington Post opinion columnist Alyssa Rosenberg wrote, \"Both daughters served as important validators for their fathers.\"[143]\n\nIn early April 2017, the government of China extended trademarks to Trump's businesses.[145] On the same day, Donald Trump hosted Chinese President Xi Jinping at Mar-a-Lago and Trump and Kushner sat next to the Chinese leader and his wife Peng Liyuan[146] at the state dinner.[147][148]\n\nIn late April 2017, Trump hired Julie Radford as her chief of staff. Before the end of the month, Trump and Radford had plans to travel with Dina Powell and Hope Hicks to the first W20 women's summit. The W20 was organized by the National Council of German Women's Organizations and the Association of German Women Entrepreneurs[149] as one of the preparatory meetings leading up to the G20 head-of-state summit in July. At the conference, Trump spoke about women's rights. The US media reported that when she praised her father as an advocate for women, the audience hissed and booed in response.[150][151][152]\n\nIt was announced by Donald Trump in August 2017 that his daughter would lead the U.S. delegation to India in the fall in global support of women's entrepreneurship. In response to the announcement, an Indian diplomat was quoted as stating, \"We regard Ivanka Trump the way we do half-wit, Saudi princes. It's in our national interest to flatter them.\"[153] The majority of reactions to her actual performance alongside Indian Prime Minister Modi at the event were substantial. Anu Acharya, the founder of a medical diagnosis company, said: \"What mattered to me is that she has been an entrepreneur, and she is an adviser to the president of the U.S.\" Shveta Raina, who runs Talerang, a startup that prepares Indian college graduates for the workplace, said Trump exceeded her expectations. \"She was poised and was able to answer questions that were seemingly off-script. I think she is young and represents young women, so I think she was the right choice.\"[154] Still, some in the local media dubbed hers \"a royal visit.\"[63]\n\nTwo days after Trump's announcement about his daughter's trip to India, the terror attack in Charlottesville occurred, and she and Jared flew off into Trump Organization helicopter for a two-day getaway in Vermont.[63]\n\nBiographer and journalist Michael Wolff wrote a book released in January 2018 based on numerous interviews with members of Donald Trump's circle. In it, Wolff claims—but cites no sources—that Trump and her husband reached a deal that \"[i]f sometime in the future the opportunity arose, she'd be the one to run for president\".[155]\n\nShe was criticized by some in March 2018 after the firing of Rex Tillerson for meeting with the South Korean foreign minister Kang, even though Kang primarily met with Deputy Secretary of State John Sullivan and congressmen including Speaker Paul Ryan; Kang's lunch with Trump followed several meetings during the Olympics in South Korea.[156][157][158]\n\nIn November 2018, The Washington Post reported that Trump shared her schedule with childcare providers—a form of official government business—through her personal email, a possible technical violation of federal records rules, which require communications to be sent within 20 days to a work account for permanent archival. A spokesman for Trump's ethics counsel stated that the improperly handled emails were sent before she was briefed on the rules: \"Trump sometimes used her personal account, almost always for logistics and scheduling concerning her family\", and that the emails did not have classified information. The spokesman also stated, \"no emails were ever deleted, and the emails have been retained in the official account in conformity with records preservation laws and rules.\"[159][160]\n\nShe and her father attended the 2019 G20 Osaka summit in late June 2019; the French government released a video of her awkwardly inserting herself into a conversation with world leaders, leading to online parodies and memes.[161][162]\n\nOn June 30, 2019, Trump participated in talks between her father and North Korean leader Kim Jong-un inside the Korean peninsula's demilitarized zone.[163][164] She described the experience as \"surreal.\"[163]\n\nTrump went in a worldwide tour in 2019 to promote her \"Women's Global Development and Prosperity Initiative\",[165][166] in which she traveled to Ethiopia[167] and Ivory Coast,[168] in sub-Saharan Africa, in April; and to Argentina, Colombia and Paraguay, in South America, in September;[169] and to Morocco, in northern Africa, in November.[170] She also attended the 74th United Nations General Assembly to promote her initiative.[171] In 2021, a Government Accountability Office audit concluded that Trump's initiative, which spent $265 million a year of taxpayer money on 19 women's empowerment projects, failed to target the money towards projects that related to women's empowerment, and did not measure the impact of the spending.[172]\n\nIn June 2020, Trump was credited with proposing the controversial photo opportunity for President Donald Trump holding a bible in front of St. John's Church, which required violently clearing peaceful protesters.[173][174] She walked with her father to the site and carried the bible in her Max Mara purse.[175]\n\nIn July 2020, Trump tweeted a picture of herself with a Goya Foods bean can, endorsing the product. The owner of Goya Foods had days prior praised President Trump, leading to a backlash against the company. Trump's tweet raised ethics concerns, given that Trump is an official adviser in the White House, and employees in public office are not permitted to endorse products.[176]\n\nWhile serving in her father's administration, Trump retained ownership of businesses, which drew criticism from government ethics experts who said it created conflicts of interest.[177] It is not possible to determine the exact amount of Trump's outside income while working in her father's administration because she is only required to report the worth of her assets and liabilities in ranges to the Office of Government Ethics.[177] The incomes of Trump and her husband Jared Kushner ranged from $36.2 million to $157 million in 2019, at least $29 million in 2018, and at least $82 million in 2017.[177] In 2019, she earned $3.9 million from her stake in the Trump hotel in Washington, D.C.[177]\n\n2020 presidential campaign\n\nTrump campaigning for her father in October 2020\n\nOn August 27, 2020, Trump introduced her father at the 2020 Republican National Convention, by which he proceeded on the front lawn of the White House to accept the party's nomination before a crowd of supporters. Prior to that, she defended her tenure as advisor in the administration.[178]\n\nCapitol riot and post-presidential career\n\nOn January 6, 2021, Ivanka refused to address the rally at the Ellipse but was in attendance.[179]\n\nDuring the ensuing riot at the U.S. Capitol, she encouraged her father to make a video on Twitter condemning the riots, acting as an intermediary between besieged U.S. officials and the President. (Donald Trump's video resulted in him being banned from the platform as he said \"we love you\" to the rioters.)[180] She tweeted a request for \"peaceful\" behavior in which she addressed the rioters as \"American Patriots.\" Minutes later, she deleted the tweet.[181][182]\n\nIn June 2022, Ivanka told the panel of the United States House Select Committee on the January 6 Attack that she does not believe the election was stolen and accepted William Barr's conclusion that voter fraud claims have \"zero basis\".[183]\n\nSocial and political causes\n\nTrump (second from left in first row) at Seeds of Peace in New York City in 2009\n\nIn 2007, Ivanka Trump donated $1,000 to the presidential campaign of then-Senator Hillary Clinton.[184][185] In 2012, she endorsed Mitt Romney for president.[186] In 2013, Trump and her husband hosted a fundraiser for Democrat Cory Booker, and the couple bundled more than $40,000 for Booker's U.S. Senate campaign.[187]\n\nDuring her father's presidency, Trump transformed from a liberal to an \"unapologetically\" pro-life, \"proud Trump Republican.\"[188] At the 2016 Republican National Convention, she said of her political views: \"Like many of my fellow millennials, I do not consider myself categorically Republican or Democrat.\"[189] In 2018, Trump changed her New York voter registration from Democratic to Republican.[1][190]\n\nPhilanthropy\n\nIn 2010, Trump cofounded Girl Up with the United Nations Foundation.[191] Of the program, Trump said, “Girl Up ‘for girls, by girls’ approach encourages American girls to become forces of global change. I am proud to be working with Girl Up and girls in this country to help ensure that all girls – no matter where they are born – get the tools they need to be educated, healthy, counted and positioned to be the next generation of leaders.”[191]\n\nTrump was a member of the Donald J. Trump Foundation board[192] until the foundation was dissolved after then New York attorney general Barbara Underwood filed a civil lawsuit against the foundation, alleging \"persistently illegal conduct\" with respect to the foundation's money.[193][194][195] In November 2019, Trump's father was ordered to pay a $2 million settlement for misusing the foundation for his business and political purposes.[196] The settlements also included mandatory training requirements for Ivanka Trump, Donald Trump Jr., and Eric Trump.[197]\n\nTrump also has ties to a number of Jewish charities, including Chai Lifeline, a charity which helps to look after children with cancer.[198] Other charities she supports include United Hatzalah, to which her father, Donald Trump, has reportedly made six-figure donations in the past.[199][200]\n\nAfter she was appointed advisor to the president, Trump donated the unpaid half of the advance payments for her book Women Who Work: Rewriting the Rules for Success to the National Urban League and the Boys and Girls Clubs of America. She further said that any royalties exceeding the advances would also be given to charity.[102]\n\nPersonal life\n\nTrump has a close relationship with her father, who has publicly expressed his admiration for her on several occasions.[201][202][203] Ivanka has likewise praised her father, complimenting his leadership skills and saying he empowers other people.[204]\n\nAccording to her late mother, Ivanka speaks French and understands Czech.[205] Sarah Ellison, writing for Vanity Fair in 2018, indicated Ivanka Trump was the family member that \"everyone in the family seems to acknowledge\" is her father's \"favorite\" child.[206] This had been confirmed by the family members themselves in a 2015 interview with Barbara Walters on network television where the siblings were gathered and acknowledged this.[207]\n\nIn January 2017 it was announced that she and Kushner had made arrangements to establish a family home in the Kalorama neighborhood of Washington, D.C.[208] Federal filings implied that, in 2017, Trump and her husband may have assets upwards of $740 million.[209] They had previously shared an apartment on Park Avenue in New York City, which Trump chose due to its proximity to her work with the Trump Organization. The residence was featured in Elle Decor in 2012 with Kelly Behun as its interior decorator.[210]\n\nShe has an estimated net worth of $300 million.[211]\n\nRelationships and marriage\n\nIn college, Trump was in a nearly four-year relationship with Greg Hersch.[212][213] From 2001 to 2005, she dated James \"Bingo\" Gubelmann.[214][25][212]\n\nIn 2005, she started dating real estate developer Jared Kushner, whom she met through mutual friends.[215][216] The couple broke up in 2008 due to the objections of Kushner's parents[215] but got back together and married in a Jewish ceremony on October 25, 2009.[215][217] They have three children: daughter Arabella Rose, born in July 2011, and sons Joseph Frederick and Theodore James born in October 2013 and March 2016 respectively.[218][219] [220] In an interview on The Dr. Oz Show, Trump revealed that she had suffered from postpartum depression after each of her pregnancies.[221]\n\nReligion\n\nRaised as a Presbyterian Christian,[222] Trump converted to Orthodox Judaism in July 2009,[223][224] after studying with Elie Weinstock from the Modern Orthodox Ramaz School.[225] Trump took the Hebrew name \"Yael\" (Hebrew: יָעֵל, lit. 'ibex').[226][227] She describes her conversion as an \"amazing and beautiful journey\" which her father supported \"from day one\", adding that he has \"tremendous respect\" for the Jewish faith.[228] She attests to keeping a kosher diet and observing the Jewish Sabbath, saying in 2015: \"We're pretty observant... It's been such a great life decision for me... I really find that with Judaism, it creates an amazing blueprint for family connectivity. From Friday to Saturday we don't do anything but hang out with one another. We don't make phone calls.\"[229] When living in New York City, she used to send her daughter to Jewish kindergarten. She said: \"It's such a blessing for me to have her come home every night and share with me the Hebrew that she's learned and sing songs for me around the holidays.\"[228]\n\nTrump and her husband made a pilgrimage to the grave of the Lubavitcher Rebbe, a popular prayer site, shortly before her father's election victory.[223][230] On May 22, 2017, the couple also accompanied her father on his first official visit to Israel as president. As part of the trip to Israel, her father became the first sitting U.S. president to visit the Western Wall .[231] Ivanka also visited the Yad Vashem Holocaust memorial in western Jerusalem and the Church of the Holy Sepulchre in the Christian Quarter of the Old City of Jerusalem during the trip.[232]\n\nAwards and nominations\n\nIn 2012, the Wharton Club of New York, the official alumni association of the Wharton School of the University of Pennsylvania for the New York metropolitan area,[233] gave Trump the Joseph Wharton Award for Young Leadership, one of their four annual awards for alumni.[234]\n\nIn 2015, she was honored as a Young Global Leader by the World Economic Forum.[235]\n\nIn 2016, she was presented with the Fashion Award for Excellence in Accessory Design.[236]\n\nCultural depictions\n\na b [139] Ivanka Trump is sometimes also called a '[140][141] even though that is actually the title of her husband [138] The original designation of \"First Daughter\" was later dropped from the official title.Ivanka Trump is sometimes also called a ' Senior Advisor to the President ' (or sometimes a 'senior advisor to the President', without the upper case 'S' and 'A'),even though that is actually the title of her husband Jared Kushner , while her own title is 'Advisor to the President'.", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/President_Donald_Trump_holds_up_a_newly_signed_House_Joint_Resolution_321.jpg/220px-President_Donald_Trump_holds_up_a_newly_signed_House_Joint_Resolution_321.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Dedication_ceremony_of_the_Embassy_of_the_United_States_in_Jerusalem_DSC_2896_%2841251548695%29.jpg/220px-Dedication_ceremony_of_the_Embassy_of_the_United_States_in_Jerusalem_DSC_2896_%2841251548695%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/President_Trump_and_First_Lady_Melania_Trump%27s_Trip_to_the_United_Kingdom_%2847999960622%29.jpg/220px-President_Trump_and_First_Lady_Melania_Trump%27s_Trip_to_the_United_Kingdom_%2847999960622%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Seeds_of_Peace_2009_%28b%29.jpg/220px-Seeds_of_Peace_2009_%28b%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/12px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Ivanka_Trump_official_portrait_%28cropped%29.jpg/1200px-Ivanka_Trump_official_portrait_%28cropped%29.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Ivanka_Trump_by_Gage_Skidmore.jpg/170px-Ivanka_Trump_by_Gage_Skidmore.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/46/Ivanka_Trump_at_Aston_PA_on_September_13th%2C_2016_01_%28cropped%29.jpg/170px-Ivanka_Trump_at_Aston_PA_on_September_13th%2C_2016_01_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/President_Trump_visit_to_Israel%2C_May_2017_DSC_3545ODS_%2834789024376%29.jpg/220px-President_Trump_visit_to_Israel%2C_May_2017_DSC_3545ODS_%2834789024376%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/13px-Wikiquote-logo.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/President_Trump_at_the_G20_%2848162295476%29.jpg/220px-President_Trump_at_the_G20_%2848162295476%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Ivanka_Trump_official_portrait_%28cropped%29.jpg/220px-Ivanka_Trump_official_portrait_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/Christine_Lagarde%2C_Angela_Merkel%2C_and_Ivanka_Trump_at_the_W20_Conference_Gala_Dinner.jpg/220px-Christine_Lagarde%2C_Angela_Merkel%2C_and_Ivanka_Trump_at_the_W20_Conference_Gala_Dinner.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cc/Ivankatrump.jpg/170px-Ivankatrump.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Boeing_787-10_rollout_with_President_Trump_%2833109589936%29_%28Jared_and_Ivanka%29.jpg/220px-Boeing_787-10_rollout_with_President_Trump_%2833109589936%29_%28Jared_and_Ivanka%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Ivanka_Trump_official_portrait_%28cropped%29.jpg/1200px-Ivanka_Trump_official_portrait_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Ivanka_Trump", "title": "Ivanka Trump", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Ivanka_Trump_official_portrait_%28cropped%29.jpg/640px-Ivanka_Trump_official_portrait_%28cropped%29.jpg", "width": 640, "height": 849}, "title": "Ivanka Trump - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}