{"url": "https://www.hollywoodreporter.com/thr-esq/james-woods-drops-lawsuit-cocaine-addict-tweet-getting-trophy-letter-1022660", "text": "James Woods has received a letter that he can now frame and put on his mantel shelf alongside his Emmy and Golden Globe awards.\n\nFrom attorney Kenneth White, the letter states, “On behalf of my client — the defendant referred to as ‘Abe List’ in the lawsuit filed by James Woods — and my client’s surviving family, I acknowledge that they are not aware of any facts to suggest that Mr. Woods has ever been a cocaine addict or used any other drugs.”\n\nTo earn this, Woods filed a $10 million libel action in July 2015. The target in the lawsuit was an anonymous Twitter user who responded to Woods’ conservative politics by suggesting the actor was a “cocaine addict.” In filing the lawsuit, Woods wanted to send a message. “AL, and anyone else using social media to propagate lies and do harm, should take note,” stated the complaint handled by Michael Weinsten at Lavely & Singer. “They are not impervious to the law.”\n\nWoods then beat back an anti-SLAPP motion that attempted to make the argument that the “cocaine addict” tweet was “a constitutionally protected political insult,” the type made routinely by Woods as “a well-known part of Twitter’s culture of political hyperbole.”\n\nAn appeal abruptly was cut short when the defendant died. That wouldn’t stop Woods. The actor wrote that he hoped the defendant died “screaming my name,” adding, “Learn this. Libel me, I’ll sue you. If you die, I’ll follow you to the bowels of Hell. Get it?”\n\nWoods did make some efforts to pursue the defendant’s estate, but that’s all over now thanks to a settlement. Full terms hasn’t been disclosed, but it does include White’s letter.\n\n“To be clear, my client did not intend for his July 15, 2015 tweet about Mr. Woods to be understood as a statement of fact,” the letter continues. “He regretted having made the tweet, and further regrets any harm caused to Mr. Woods’ reputation by the tweet. His family was not aware of the tweet until after the fact and regrets if any harm came from the tweet being taken literally.”\n\nWoods is done with this Twitter defamation case, but the tables have turned because he’s a defendant in another.\n\nPortia Boulger, an Ohio woman, is suing him for $3 million. She claims he misidentified her as a Nazi on Twitter. Specifically, the Chicago Tribune posted a photograph of a woman at a Donald Trump rally who might have been making a Nazi salute. Other Twitter users asserted it was Boulger, which led Woods to tweet the photograph along with a question: “So-called #Trump ‘Nazi’ is a #BernieSanders agitator/operative?”\n\nThis got retweeted by Donald Trump, Jr.\n\nStill in court over the matter, Woods filed a motion for judgment on the pleadings last month. He argued the case was an attempt to quell his free speech rights.\n\n“First, Plaintiff’s claim for defamation fails as a matter of law because Mr. Woods’ allegedly defamatory question is not a statement of fact,” writes Woods’ attorney. “Nor would a reasonable reader interpret Mr. Woods’ question — seeking clarification — as inferring any factual content.”\n\nLater in the Woods’ brief, it’s argues that the word “Nazi” is “inherently imprecise and subject to myriad subjective interpretations” and that “several courts have consistently held that use of the term ‘Nazi’ is rhetorical hyperbole.”", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/03/gettyimages-643057832_copy.jpg?w=1296&h=730&crop=1", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/uploads/2017/03/gettyimages-643057832_copy.jpg?w=1024"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/03/gettyimages-643057832_copy.jpg?w=1024", "keywords": [], "authors": ["Eriq Gardner"], "canonical_link": "https://www.hollywoodreporter.com/business/business-news/james-woods-drops-lawsuit-cocaine-addict-tweet-getting-trophy-letter-1022660/", "title": "James Woods Drops Lawsuit Over “Cocaine Addict” Tweet After Getting Trophy Letter", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The actor filed a $10 million libel action two years ago. Then, the anonymous defendant died.", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Eriq Gardner", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1022660, "title": "James Woods Drops Lawsuit Over \"Cocaine Addict\" Tweet After Getting Trophy Letter", "published_at": "2017-07-19 15:22:24", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/03/gettyimages-643057832_copy.jpg?w=1024", "comment_count": 0, "topics": "Business News", "body": "James Woods has received a letter that he can now frame and put on his mantel shelf alongside his Emmy and Golden Globe awards. \r\nFrom attorney Kenneth White, the letter states, \"On behalf of my client — the defendant referred to as 'Abe List' in the lawsuit filed by James Woods — and my client's surviving family, I acknowledge that they are not aware of any facts to suggest that Mr. Woods has ever been a cocaine addict or used any other drugs.\"\r\nTo earn this, Woods filed a $10 million libel action in July 2015. The target in the lawsuit was an anonymous Twitter user who responded to Woods' conservative politics by suggesting the actor was a \"cocaine addict.\" In filing the lawsuit, Woods wanted to send a message. \"AL, and anyone else using social media to propagate lies and do harm, should take note,\" stated the complaint handled by Michael Weinsten at Lavely & Singer. \"They are not impervious to the law.\"\r\nWoods then beat back an anti-SLAPP motion that attempted to make the argument that the \"cocaine addict\" tweet was \"a constitutionally protected political insult,\" the type made routinely by Woods as \"a well-known part of Twitter's culture of political hyperbole.\"\r\nAn appeal abruptly was cut short when the defendant died. That wouldn't stop Woods. The actor wrote that he hoped the defendant died \"screaming my name,\" adding, \"Learn this. Libel me, I'll sue you. If you die, I'll follow you to the bowels of Hell. Get it?\"\r\nWoods did make some efforts to pursue the defendant's estate, but that's all over now thanks to a settlement. Full terms hasn't been disclosed, but it does include White's letter.\r\n\"To be clear, my client did not intend for his July 15, 2015 tweet about Mr. Woods to be understood as a statement of fact,\" the letter continues. \"He regretted having made the tweet, and further regrets any harm caused to Mr. Woods' reputation by the tweet. His family was not aware of the tweet until after the fact and regrets if any harm came from the tweet being taken literally.\"\r\nWoods is done with this Twitter defamation case, but the tables have turned because he's a defendant in another.\r\nPortia Boulger, an Ohio woman, is suing him for $3 million. She claims he misidentified her as a Nazi on Twitter. Specifically, the Chicago Tribune posted a photograph of a woman at a Donald Trump rally who might have been making a Nazi salute. Other Twitter users asserted it was Boulger, which led Woods to tweet the photograph along with a question: \"So-called #Trump 'Nazi' is a #BernieSanders agitator/operative?\"\r\nThis got retweeted by Donald Trump, Jr.\r\nStill in court over the matter, Woods filed a motion for judgment on the pleadings last month. He argued the case was an attempt to quell his free speech rights.\r\n\"First, Plaintiff's claim for defamation fails as a matter of law because Mr. Woods' allegedly defamatory question is not a statement of fact,\" writes Woods' attorney. \"Nor would a reasonable reader interpret Mr. Woods' question — seeking clarification — as inferring any factual content.\"\r\nLater in the Woods' brief, it's argues that the word \"Nazi\" is \"inherently imprecise and subject to myriad subjective interpretations\" and that \"several courts have consistently held that use of the term 'Nazi' is rhetorical hyperbole.\"", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "James Woods Drops Lawsuit Over “Cocaine Addict” Tweet After Getting Trophy Letter", "url": "https://www.hollywoodreporter.com/business/business-news/james-woods-drops-lawsuit-cocaine-addict-tweet-getting-trophy-letter-1022660/", "description": "The actor filed a $10 million libel action two years ago. Then, the anonymous defendant died.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/03/gettyimages-643057832_copy.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-07-19T15:22:24+00:00", "modified_time": "2017-07-19T15:33:39+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "James Woods Drops Lawsuit Over “Cocaine Addict” Tweet After Getting Trophy Letter", "description": "The actor filed a $10 million libel action two years ago. Then, the anonymous defendant died.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/03/gettyimages-643057832_copy.jpg?w=1296"}}, "movies": [], "publish_date": 1500477744.0, "source": "https://www.hollywoodreporter.com", "summary": ""}