{"url": "https://www.lennyletter.com/story/troian-bellisario-reveals-mental-health-struggle", "text": "We were swimming our second lap in the lake when I lost the feeling in my toes. When you first jump in water this cold you scream, gasp for air, but immediately laugh because it makes you feel extra-alive. You learn, after a few jumps, you don’t have to fear the cold. If you move around, it fades away. Soon, it’s as if you’re inside a house looking out at a snow flurry as it lightly taps the windows. You know there is cold, all around you, but it can’t hurt you.\n\nFor a while, this kind of numb makes me feel invincible.\n\nBut now, after maybe a half-hour in the water, the cold has returned, and not just outside the window, it’s in my skin. Beneath the surface, I probably looked like a chicken breast sitting under plastic in a refrigerator of a grocery store, pale and goose-pimpled. Then it’s in my joints, making it difficult to move. Soon, it’s in my bones, so much that even though I knew I was kicking my legs, I couldn’t tell you where they ended and the water began. I wasn’t even sure if I had toes anymore.\n\nSuddenly, I’m in very familiar territory. I know I should get out of the water before I hurt myself or make myself sick, but I just don’t. I keep swimming.\n\nHere I am, 31 years old, and I’m still denying my body the one thing it is asking me to do: *take care of it*.\n\n***\n\nWhen I shot the pilot of *Pretty Little Liars*, it was December in Vancouver, and I was 24 years old. We were shooting a summer scene (the exterior of the funeral for Alison, the Queen Bee of Rosewood), and even though I don’t remember exactly how cold it was outside, I can tell you it was too cold to snow. The girls and I were dressed in skimpy black dresses with kitten heels and ballet flats. Later, in editing, they could push the saturation, add a golden filter, and *BAM*, it would look like we were sweating in July. But while we were shooting, well, it was December in Canada.\n\n“Rolling!” yelled the assistant director, and wardrobe would rush in and apologetically remove the giant down coats from our shoulders. Everyone watched, hoping we could get the scene before our jaws locked or our shoulders unintentionally rose around our ears. Eventually, Leslie, our director, yelled “Cut!,”and the beautiful warm jackets reappeared.\n\nWanting to be the *most* professional I could be, I *sniffed* back the snot that was threatening to ruin every take and *forced* my shoulders to stay where they were, even though I could see my breath on the air. I looked around: Lucy, Ashley, and Shay all seemed cold but fine; they looked professional, powerful. *Was I not cut out for this?* I pushed that thought out of my mind. *Suck it up, Bellisario, do your job.*\n\nThere came a point when I mentioned offhand, “Huh, I can’t feel my feet.” “Stop!”a voice screamed, and an angel in the form of a crew member descended upon me and demanded I follow her inside the church we were shooting near.\n\nShe sat me down, removed my shoes, and began to rub my feet. She asked me to let her know when I had feeling in them again. “Don’t worry about my feet! They’re fine!”I tried to sweetly wiggle away from her, my eyes flitting to the crew that was waiting nearby. I was holding up production, a production that costs thousands of dollars per minute, all for my stupid comment about my stupid toes. I started to panic: *Everyone is going to think I’m a diva, that I can’t hack it, that I’m a horrible actor, and they’ll never want to work with me again.*\n\n> I am practiced at ignoring , for the most part, but it’s\n\n> still there, finding new ways to undermine me.\n\nBut the angel remained resolute. She told me that she had worked with people who had lost toes to frostbite, and she wasn’t about to see me lose mine. Eventually, I announced (truthfully) that the feeling in my feet had returned, and she let me go.\n\nI braced myself to be yelled at by someone, anyone, in a position of authority. *How dare you hold up this massive production? How dare you be so weak? So demanding!* But there was no punishment to be found, not even a sideways glance. Everyone just asked me if I felt better and felt ready to return to the scene.\n\n*Why did I need a complete stranger’s permission to take care of myself?*\n\n***\n\nSeven years later (and wiser?), there I was, swimming in a lake for fun, and still I couldn’t do it. My friend and I had casually agreed to try for threetimes around the island in the lake. It was just a fun challenge when we jokingly announced it to the rest of the friends and family. But now, coming around the corner of lap two, I could feel my limbs shutting down. Just like in Vancouver, despite my body desperately needing something, I didn’t want to appear weak or let people down. Where was my angel to take care of me now?\n\n*So what?* You might say. *Don’t be crazy; you can get out of the water anytime. Who cares?* Great question. I ask it of myself all the time. Who cares if I can’t swim that long in cold water? Who cares if I need to stop the scene to take care of my toes? Who cares?\n\n*I do*, said a familiar voice inside my head. *Oh, right. You.*\n\nMy friend is a long-distance swimmer, and she seemed cold but ready to keep going.\n\n“Troian, do you want to stop?”\n\nThat voice, that familiar voice in the back of my skull that tells me it cares. It cares if I demand things of a production, it cares if I quit early, if I fail. It is a voice I know intimately; it is my greatest and best of enemies. I know what that voice will say if I stop. I know the trouble I’ll be in.\n\n“Nope,” I said, my teeth chattering with excitement. “I’m fine!” She wasn’t buying it, but matching my determinism, we went around again anyway. When we came in, who cheered for the cold and weary warriors? Who hoisted us up in honor and fed us warm drinks in celebration? No one, because this was a necessary challenge to no one but myself. There was no great competition, except between my *body* and my *head*.\n\n***\n\nAs someone who struggles with a mental illness, my biggest challenge is that I don’t always know which voice inside me is speaking. My body voice, the one that says, *Troian, I’m cold, get out of the lake*, or my illness: *You told everyone three times, so you can’t disappoint them. You are not enough. Who cares about the difference between two times around and three? I do.*\n\nThere is a part of my brain that defies logic. Once, it completely convinced me I should live off 300 calories a day, and at some point, it told me even that was too much. That part of my brain is my disease, and there was a time when it had absolute authority over me. It almost killed me, and you can see that even though I have lived in recovery for ten years now, it still finds loads of fun, insidious ways to thwart me to this day. It was a difficult journey finding my way back to health. Through hard introspection, intense medical and mental care, a supportive family, friends, and a patient and loving partner, I survived, which is rare.\n\nBut I don’t want to just survive that part of my life. I want to create in rebellion. I want to stop looking at the clocks. I wanna get paint all over the floor and build a wall of feedback in the amp so loud that it starts a mosh pit as I scream back in the face of my disease: *__I AM ENOUGH!__*\n\nIt’s just not that easy. Sometimes I still find myself being pushed by an invisible taskmaster, working to the point of exhaustion, swimming with numb toes. The voice of my disease is with me every day. I am practiced at ignoring it, for the most part, but it’s still there, finding new ways to undermine me. That’s partially why I wrote *Feed*. I wanted to channel that voice into a story and out of myself. I wanted to create a character who also wondered how *she could be enough*.\n\nWriting, producing, and acting in it helped me to get one more degree of separation from my disease in what I know will be a lifetime of work in recovery. It is my greatest hope that someone watching it, struggling with the same challenges I do, might think, *What if I were enough too?* So with all the courage I can muster, I give it to you, I give it to that one person, in hopes that it could make them feel enough.\n\nMaybe by the time you see it, I will have gotten out of the cold water and be warming myself in the sun.\n\n*Troian Bellisario wrote, produced, and stars in the independent feature* (1), *which will be released by Sony Pictures on VOD and on (1) on July 18.*\n\n1) (https://itunes.apple.com/us/movie/feed/id1237474763)", "images": ["https://www.lennyletter.com/wp-content/uploads/2021/06/lenny.png", "https://lennyletter.com/wp-content/uploads/2021/06/lenny-logo.jpg", "https://secure.gravatar.com/avatar/d7cda3eb5afff1b2e7737f8e436856f0?s=96&d=mm&r=g", "https://www.lennyletter.com/wp-content/uploads/2021/06/lenny-logo.jpg", "https://www.lennyletter.com/wp-content/uploads/2021/05/5a2464309ce6da000fcaa26c.jpg"], "top_img": "https://www.lennyletter.com/wp-content/uploads/2021/06/lenny.png", "keywords": [], "authors": [], "canonical_link": "https://www.lennyletter.com/story/troian-bellisario-reveals-mental-health-struggle", "title": "Troian Bellisario Gets Real About Her Struggle with Mental Health", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "max-image-preview:large", "generator": "Site Kit by Google 1.35.0", "msapplication-TileImage": "https://www.lennyletter.com/wp-content/uploads/2021/06/lenny.png"}, "movies": [], "publish_date": null, "source": "https://www.lennyletter.com", "summary": ""}