{"url": "en.wikipedia.org/wiki/Mila_Kunis", "text": "American actress (born 1983)\n\nMilena Markovna \"Mila\" Kunis[a] (born (1983-08-14)August 14, 1983) is an American actress. She began playing Jackie Burkhart on the Fox television series That '70s Show (1998–2006) at the age of 14. Since 1999, Kunis has voiced Meg Griffin on the Fox animated series Family Guy.\n\nKunis's breakout film role came in 2008,[1][2] playing Rachel in the romantic comedy Forgetting Sarah Marshall. She gained further critical acclaim and accolades for her performance in the psychological thriller Black Swan (2010), for which she received the Marcello Mastroianni Award for Best Young Actor or Actress, and nominations for the SAG Award and the Golden Globe Award for Best Supporting Actress. Her other major films include the action films Max Payne (2008) and The Book of Eli (2010), the romantic comedy Friends with Benefits (2011), the fantasy film Oz the Great and Powerful (2013) as the Wicked Witch of the West, and the comedies Ted (2012), Bad Moms (2016) and its sequel, A Bad Moms Christmas (2017).\n\nEarly life\n\nMilena Markovna Kunis was born into a Ukrainian Jewish family on August 14, 1983,[3] in Chernivtsi, a city in the Ukrainian SSR of the Soviet Union (now Ukraine).[4] Her mother, Elvira, is a physics teacher who runs a pharmacy, and her father, Mark Kunis, is a mechanical engineer who works as a cab driver.[5] Kunis has an elder brother, Michael.[6][7] Her grandparents were Holocaust survivors.[8] Her mother tongue and the common language within her family is Russian.[9] While participating in the Conan O'Brien Podcast Kunis confirmed she does not speak Ukrainian stating Russian was the main language at the time she was there. They did not teach the Ukrainian language in school until children were in second grade which was the time she left to come to the States. [10] She stated in 2011 that her parents had \"amazing jobs\", and that she \"was very lucky\" and the family was \"not poor\"; they had decided to leave the Soviet Union because they saw \"no future\" there for Mila and her brother.[11] In 1991, when she was 7 years old, her family moved to Los Angeles, California, with US$250. \"That was all we were allowed to take with us. My parents had given up good jobs and degrees, which were not transferable. We arrived in New York on a Wednesday and by Friday morning my brother and I were at school in L.A.\"[11]\n\nKunis comes from a Jewish family and has cited antisemitism in the Soviet Union as one of several reasons for her family's move to the United States.[12][13][14][15][16] She has stated that her parents \"raised [her] Jewish as much as they could\", although religion was suppressed in the Soviet Union.[17][12] On her second day in Los Angeles, Kunis was enrolled at Rosewood Elementary School, not knowing a word of English. She later recalled: \"I blocked out second grade completely. I have no recollection of it. I always talk to my mom and my grandma about it. It was because I cried every day. I didn't understand the culture. I didn't understand the people. I didn't understand the language. My first sentence of my essay to get into college was like, 'Imagine being blind and deaf at age seven.' And that's kind of what it felt like moving to the States.\"[18]\n\nIn Los Angeles, she attended Hubert Howe Bancroft Middle School. She used an on-set tutor for most of her high school years while filming That '70s Show.[19] She briefly attended Los Angeles Center for Enriched Studies (LACES), but when that school proved to be insufficiently flexible about her acting commitments, she transferred to Fairfax High School,[20] graduating in 2001.[15] She briefly attended University of California, Los Angeles (UCLA) and Loyola Marymount University in Los Angeles.[6][21]\n\nKunis has said that a genealogical DNA test described her ethnicity as 96%[22][23] to 98% Ashkenazi Jewish.[24]\n\nCareer\n\n1994–2000: Career beginnings and television work\n\nAt age nine, Kunis was enrolled by her father in acting classes after school at the Beverly Hills Studios, where she met Susan Curtis, who would become her manager.[25][26] On her first audition she landed the role for a Barbie commercial.[27] Shortly after, she did a commercial for the Lisa Frank product line.[28] Her first television roles took place in 1994, first appearing on Days of Our Lives,[29][30] and a few months later doing her first of two appearances on Baywatch.[31] She had a minor role on the television shows 7th Heaven[19], and Walker, Texas Ranger as well as supporting roles in the films Santa with Muscles, Honey, We Shrunk Ourselves, and the Angelina Jolie film Gia, as the young Gia Carangi.[6]\n\nAt the age of 10, Kunis unsuccessfully auditioned for the role of a Russian Jewish girl who moves to America in the film Make a Wish, Molly.[8] Instead, she was cast in the secondary role of a Mexican girl.[20] In 1998, Kunis was cast as Jackie Burkhart in the Fox sitcom That '70s Show. All who auditioned were required to be at least 18 years old; Kunis, who was 14 at the time, told the casting directors she would be 18 but did not say when. Though they eventually figured it out, the producers still thought Kunis was the best fit for the role.[26] That '70s Show ran for eight seasons.[32] She won two consecutive Young Star Awards as Best Young Actress in a Comedy TV Series in 1999 and 2000 for her performances.[33]\n\nIn 1999, Kunis replaced Lacey Chabert in the role of Meg Griffin on the animated sitcom Family Guy,[34] created by Seth MacFarlane for Fox. Kunis won the role after auditions and a slight rewrite of the character, in part due to her performance on That '70s Show. When Kunis auditioned for the role, she was called back by MacFarlane, who instructed her to speak slower. He then told her to come back another time and enunciate more. Once she claimed that she had it under control, MacFarlane hired her. MacFarlane added: \"What Mila Kunis brought to it was in a lot of ways, I thought, almost more right for the character. I say that Lacey did a phenomenal job, but there was something about Mila – something very natural about Mila. She was 15 when she started, so you were listening to a 15-year-old. Oftentimes with animation they'll have adult actors doing the voices of teenagers and they always sound like Saturday morning voices. They sound oftentimes very forced. She had a very natural quality to Meg that really made what we did with that character kind of really work.\"[35] Kunis was nominated for an Annie Award in the category of Voice Acting in an Animated Television Production in 2007. She also voiced Meg in Family Guy Video Game!, released in 2006. Kunis described her character as \"the scapegoat.\"[36]\n\n2001–2008: Transition to film\n\nIn 2001, she appeared in Get Over It opposite Kirsten Dunst. She followed that up in 2002, by starring in the straight-to-DVD horror film American Psycho 2 alongside William Shatner, a sequel to the 2000 film American Psycho. American Psycho 2 was poorly reviewed by critics,[37] and later, Kunis herself expressed embarrassment over the film.[38] In 2004, Kunis starred in the film adaptation Tony n' Tina's Wedding. Although the film was shot in 2004, it did not have a theatrical release until 2007.[39] Most critics did not like the film, which mustered a 25% approval from Rotten Tomatoes.[40] DVD talk concluded that \"fans would be much better off pretending the movie never happened in the first place\".[41]\n\nIn 2005, Kunis co-starred with Jon Heder in Moving McAllister, which was not released theatrically until 2007.[42] The film received generally poor reviews and had a limited two-week run in theaters.[43][44] She followed up with After Sex starring alongside Zoe Saldana, who had also appeared in Get Over It.[45] In October 2006, she began filming Boot Camp (originally titled Straight Edge).[46] The film was not released in theaters in the United States, but was released on DVD on August 25, 2009.[47]\n\nKunis starred as Rachel Jansen in the 2008 comedy film, Forgetting Sarah Marshall, co-produced by Judd Apatow. The role, which she won after unsuccessfully auditioning for Knocked Up,[2] entailed improvisation on her part.[48] The film garnered positive reviews,[49] and was a commercial success, grossing $105 million worldwide.[50] Kunis's performance was well-received; Joe Morgenstern of The Wall Street Journal praised her \"fresh beauty and focused energy\",[51] while James Berardinelli wrote that she is \"adept with her performance and understands the concept of comic timing\".[52] She was nominated for a Teen Choice Award.[53] In an interview, Kunis credited Apatow with helping her to expand her career from That '70s Show.[2]\n\nAlso in 2008, Kunis portrayed Mona Sax, an assassin, alongside Mark Wahlberg in the action film Max Payne, based on the video game of the same name. Kunis underwent training in guns, boxing, and martial arts for her role.[54] Max Payne was relatively successful at the box office, grossing $85 million worldwide[55] but was poorly reviewed by critics,[56] with several reviewers calling Kunis miscast.[57][58] Travis Estvold of Boise Weekly wrote that she was \"horribly miscast as some sort of undersized, warble-voiced crime boss\".[59] Director John Moore defended his choice of Kunis saying, \"Mila just bowled us over..... She wasn't an obvious choice, but she just wears Mona so well. We needed someone who would not be just a fop or foil to Max; we needed somebody who had to be that character and convey her own agenda. I think Mila just knocked it out of the park.\"[54] She was nominated for another Teen Choice Award for her role in the film.[60]\n\n2009–2012: Film breakthrough and acclaim\n\nFamily Guy in 2009 Kunis promotingin 2009\n\nIn 2009, she appeared in the comedy film Extract with Ben Affleck and Jason Bateman. The film received mostly positive reviews,[61] and grossed $10.8 million at the box office.[62] Roger Ebert, while critical of the film itself, wrote that Kunis \"brings her role to within shouting distance of credibility.\"[63] Director Mike Judge commented that part of what was surprising to learn about Kunis was her ability to make references to the cult animation film Rejected. Judge said: \"As beautiful as Mila is, you could believe that maybe she would cross paths with you in the real world.\"[64] After seeing Kunis perform in Forgetting Sarah Marshall, Judge wanted to cast her in the role of Cindy in Extract: \"I just thought, 'Wow, this girl's perfect.' And she really wanted to do it, which was fantastic.\" Kunis herself stated that \"I'm a huge fan of Mike Judge's from Office Space, so I was, like, 'Okay, this is a very easy decision.' I told them I would do anything needed to be in this production– like craft service, or, say, acting.\"[65]\n\nIn 2010, she starred alongside Denzel Washington in the action film The Book of Eli. Although the film received mixed reviews,[66] it performed well at the box office, grossing over $157 million worldwide.[67] Film critic Richard Roeper praised Kunis's performance, calling it a \"particularly strong piece of work\".[68] Several other reviews were equally positive, including that of Pete Hammond of Boxoffice magazine, who wrote that she's \"ideally cast in the key female role\"[69] Even reviewers who didn't necessarily like the film complimented her performance, such as James Berardinelli, who wrote that \"the demands of the role prove to be within her range, which is perhaps surprising considering she has been thus far pigeonholed into more lightweight parts\",[70] and Colin Covert of the Star Tribune, who wrote that she \"generated a spark and brought a degree of determination to her character, developing an independent female character who's not always in need of rescuing.\"[71] Other critics, such as Claudia Puig of USA Today felt she was miscast, noting that \"she looked as if she dropped in from a Ray-Ban commercial\".[72] Kunis received another Teen Choice Award nomination for her performance.[73][74] Kunis was also cast in a minor role in the 2010 comedy film Date Night, starring Tina Fey and Steve Carell.[75] She garnered several positive reviews for her performance.[76][77][78] Michael Phillips of the Chicago Tribune concluded her performance with James Franco helped save the film and gave it \"a shot in the arm.\"[79]\n\nKunis was nominated for multiple awards, including her first Golden Globe, for the 2010 film Black Swan. She played a rival ballet dancer to the main character, played by Natalie Portman. Director Darren Aronofsky cast Kunis in the film based on her performance in Forgetting Sarah Marshall, and on the recommendation of co-star and close friend Natalie Portman.[8][80] She underwent a training regimen that included cardiovascular exercise, a 1,200-calorie a day diet (she lost 20 pounds that she regained after filming ended), and ballet classes for four hours a day, seven days a week.[1][81][82] During the demanding production, she suffered injuries including a torn ligament and a dislocated shoulder.[83]\n\nBlack Swan received widespread acclaim from critics[84] and was nominated for five Academy Awards, including Best Picture.[85] The film grossed over $106.9 million in the United States and Canada[86] while grossing over $329 million worldwide.[87] Reviews of Kunis's performance were positive,[88][89][90] with Kirk Honeycutt of The Hollywood Reporter stating, \"Kunis makes a perfect alternate to Portman, equally as lithe and dark but a smirk of self-assurance in place of Portman's wide-eyed fearfulness.\"[91] Guy Lodge of In Contention also praised Kunis, saying, \"it's the cool, throaty-voiced Kunis who is the surprise package here, intelligently watching and reflecting her co-star in such a manner that we're as uncertain as Nina of her ingenuousness.\"[92] Kunis's performance won her the Marcello Mastroianni Award for Best Young Actor or Actress at the 67th Venice International Film Festival,[93] and earned her Golden Globe Award[94] and Screen Actors Guild Award nominations for Best Supporting Actress.[95] At the 37th annual Saturn Awards, she was also honored with the Best Supporting Actress award for her performance.[96]\n\nKunis was cast alongside Justin Timberlake in the 2011 romantic comedy Friends with Benefits.[97] Director Will Gluck stated that he wrote the story with Kunis and Timberlake in mind.[98] Friends with Benefits achieved success at the box office, grossing over $149 million worldwide,[99] and received mostly positive reviews with critics praising the chemistry between Kunis and Timberlake.[100] Manohla Dargis of The New York Times wrote that \"Ms. Kunis is fast proving that she's a gift that keeps giving to mainstream romantic comedy\" and \"her energy is so invigorating and expansive and her presence so vibrant that she fills the screen\".[101]\n\nIn 2012, Kunis co-starred with Mark Wahlberg in Ted, her most commercially successful film to date. The film was directed and co-written by Family Guy creator Seth MacFarlane. Kunis played the girlfriend of Wahlberg's character. When MacFarlane first conceived the project, he considered Kunis too young for the role. However, the film remained in development for several years and when it was finally ready to begin production, he ended up casting her.[102] Ted has received generally positive reviews from critics[103] and was a commercial success, grossing $549 million worldwide.[104] Drew McWeeny of HitFix wrote that Kunis \"brings some lovely subtle grace notes to a role that easily could have just been 'the pushy girlfriend'\".[105]\n\n2013–present: Comedic roles\n\nIn 2013, Kunis played Theodora, the youngest of three witches, opposite James Franco, in the Walt Disney Pictures' prequel, Oz the Great and Powerful.[106][107] She dedicated her performance in the film to Margaret Hamilton, the original Wicked Witch of the West in the 1939 film.[108] The film, and Kunis's performance, received mixed reviews from critics.[109] Kim Newman of Empire Magazine wrote that Kunis \"walks away with the honours as the wavering witch Theodora, whose heartbreak brings another, less-expected depth to this 3D spectacle\".[110] In contrast, Todd McCarthy of The Hollywood Reporter found Kunis's performance to be uncertain as her character seemed to be in a state of limbo.[111] Oz the Great and Powerful was a commercial success, grossing over $493 million worldwide.[112]\n\nAlso in 2013, Kunis co-starred in the crime thriller Blood Ties with Clive Owen, Billy Crudup, and Marion Cotillard.[113] The film premiered at the 2013 Cannes Film Festival and had a limited release in the United States in 2014.[114] Blood Ties received mixed reviews.[115] Kunis was also cast in the comedy The Angriest Man in Brooklyn, alongside Robin Williams and Peter Dinklage.[116] The film had a limited theatrical and VOD release[117] and received poor reviews.[118] The Paul Haggis-directed film Third Person co-starring with Liam Neeson, Olivia Wilde and James Franco[119] premiered at the 2013 Toronto Film Festival[120] and had a limited release in 2014, but also received mostly negative reviews.[121] Kunis's performance was praised by some critics; Deborah Young of The Hollywood Reporter wrote that her role gives her \"enormous room to express her talent\" and she \"gives her story a shot of raw intensity\".[122] In October 2014, it was announced Kunis, along with her partners, had launched a new production company called Orchard Farm Productions. The company has a first-look deal with ABC Studios, where the company is based. Under the agreement, the team will develop and produce TV projects for broadcast and cable.[123] In 2015, Kunis co-starred with Channing Tatum in the science fiction film Jupiter Ascending, directed by the Wachowskis.[124][125] While the film grossed over $183.9 million on a $176 million budget,[126] it received mostly negative reviews, with a consensus that the production was \"narratively befuddled\" and a \"visually thrilling misfire\".[127]\n\nKunis in 2018.\n\nKunis co-starred with Kristen Bell and Christina Applegate in the comedy Bad Moms, which was released July 29, 2016.[128] It received mixed reviews from critics, who praised the cast and humor, though did not feel it could \"take full advantage of its assets\".[129] Chris Nashawaty from Entertainment Weekly wrote that \"Kunis manages to be both sympathetic and funny, and she has crack comedic timing\".[130] The film went on to earn more than $183.9 million with a budget of $20 million.[131] Following the financial success of Bad Moms, STX Entertainment reunited Kunis with her co-stars Kristen Bell and Kathryn Hahn for a sequel, A Bad Moms Christmas, which was released on November 1, 2017.[132][133] It went on to receive mixed reviews[134] and gross over $130 million worldwide with a budget of $28 million.[135]\n\nIn 2018, Kunis co-starred with Kate McKinnon in the comedy The Spy Who Dumped Me. The film received mixed reviews[136] and went on to gross over $75 million worldwide with a budget of $40 million.[137] Kunis co-starred with Glenn Close in the film Four Good Days. Principal photography began in September 2019 in Los Angeles,[138] and premiered at the Sundance Film Festival on January 25, 2020.[139] The film received mixed reviews[140] but Kunis was praised for her performance, with Pete Hammond from Deadline Hollywood stating Kunis was \"a revelation\" in the role,[141] while Richard Roeper of the Chicago Sun-Times concluded her performance \"represents the finest work she has done\".[142] In 2021, she co-starred with Allison Janney and Regina Hall in Breaking News in Yuba County, which was filmed in Mississippi.[143] The film was released February 12, 2021,[144] and received negative reviews from critics.[145] On April 30, 2022, it was announced that Kunis would have a guest appearance in the follow-up sitcom, That '90s Show.[146] Kunis is also slated to produce and star in a Netflix film adaptation of Luckiest Girl Alive based on the Jessica Knoll novel of the same name.[147] Luckiest Girl Alive was released in select cinemas on September 30, 2022, before its streaming release on October 7, 2022, by Netflix. [148]\n\nIn the media\n\nEsquire magazine in 2012. Kunis for a spread inmagazine in 2012.\n\nIn 2007, Kunis participated in a video for the website Funny or Die appearing alongside James Franco. The video was a parody of the MTV show The Hills and was a huge success for the website, with 2.4 million views over the next ten years.[149] Shawn Levy, director of Date Night, stated that part of what made him decide to cast Kunis with James Franco in the film was the chemistry he felt they had in the Funny or Die video.[150] In December 2008, Kunis was featured in Gap's \"Shine Your Own Star\" Christmas campaign.[151] In 2010, she was featured in the \"Women We Love\" segment in Esquire with an accompanied video.[152] Kunis was among several female stars photographed by Canadian singer-songwriter Bryan Adams in conjunction with the Calvin Klein Collections for a feature titled American Women 2010, with the proceeds from the photographs donated to the NYC AIDS foundation.[153] During the summer of 2010 Kunis served with Randy Jackson as the Master of Ceremonies for the 9th Annual Chrysalis Foundation Benefit. The Chrysalis Foundation is a Los Angeles-based non-profit organization formed to help economically disadvantaged and homeless individuals to become self-sufficient through employment opportunities.[154]\n\nGQ magazine named Kunis the Knockout of the Year for 2011,[155] with Men's Health naming her one of the \"100 Hottest Women of All-Time\".[156] FHM magazine ranked her number 9 on its 2012 Hot 100 list,[157] but she reached number 1 on their 2013 \"100 Sexiest Women in the World\" list,[158][159] which brought to an end a four-year run by British women.[160] Prior to this in 2008 Kunis stated, \"You've got to base your career on something other than being FHM's top 100 number one girl. Your looks are going to die out, and then what's going to be left?\"[18] Maxim has consistently ranked Kunis on its Hot 100 list, reaching a ranking of number 5 in both 2009 and 2011[161] and number 3 in 2012.[162][163] Esquire magazine named her 2012's Sexiest Woman Alive.[164] She ranked No. 2 on AskMen's list of Top 99 Women for 2013, behind only Jennifer Lawrence.[165] In 2013, she responded to those lists: \"All I can say is, I feel honored to be considered sexy.\"[166]\n\nChristian Dior signed Kunis in 2012 to be the face of its Spring fashion campaign.[167][168] In February 2013, she was named Gemfields global brand ambassador and the face of their advertising campaign.[169] Gemfields is a luxury company that produces emeralds, rubies, and amethysts. She visited Gemfields' mine in Zambia.[170] Kunis appeared wearing Gemfields's Rubies for the world premiere of Jupiter Ascending.[171] In 2013, she appeared in Forbes list of 100 powerful celebrities, ranking #89 on the basis of five criteria (Money, TV/Radio, Press, Social, and Marketability), with her highest ranking as #14 in marketability. She earned $11 million for the year ending in June 2013.[172] In 2014, Kunis appeared in a range of global advertising for Beam, Inc. (makers of Jim Beam bourbon).[173] Her announcement on Conan that she would donate to Planned Parenthood in Vice President Mike Pence's name received praise from supporters of abortion rights; conversely, several anti-abortion advocates criticized her and Beam, Inc. on Twitter, creating the hashtag #BoycottJimBeam.[174][175]\n\nKunis was included on Time magazine's annual list of the 100 most influential people in the world in 2022.[176]\n\nPersonal life\n\nKunis began dating actor Macaulay Culkin in 2002.[177][178] During their relationship, there were rumors of the couple getting married, but Kunis denied them.[179] On January 3, 2011, Kunis's publicist confirmed reports that Kunis and Culkin had ended their relationship, saying, \"The split was amicable, and they remain close friends.\"[177] Kunis began dating her former That '70s Show co-star Ashton Kutcher in April 2012.[180][181] They became engaged in February 2014,[182] and married during the first weekend of July 2015 in Oak Glen, California.[183] The couple have two children: a daughter born in October 2014[184][185] and a son born in November 2016.[186] The family resides in a sustainable farmhouse, designed by the couple and architect Howard Backen, in Beverly Hills.[187]\n\nIn January 2011, she revealed her struggle with chronic iritis that had caused temporary blindness in one eye. Some months earlier she had had surgery that corrected the problem.[188] Kunis also has heterochromia iridum, a condition in which the irises are different colors. Her left eye is brown, while her right eye is green.[158] On September 14, 2011, the Federal Bureau of Investigation (FBI) announced it was investigating the alleged hacking of Kunis's cellphone and email accounts, along with those of other celebrities such as Scarlett Johansson and Vanessa Hudgens.[189][190][191] Christopher Chaney from Jacksonville, Florida, later pleaded guilty in federal court to nine counts of computer hacking.[192]\n\nIn November 2011, Kunis was escorted by Sgt. Scott Moore to a U.S. Marine Corps Ball in Greenville, North Carolina. She had accepted Moore's invitation in July after he posted it as a YouTube video while serving with the 3rd Battalion, 2nd Marine Regiment, in Afghanistan's Helmand province. The event celebrated the Marine Corps' 236th anniversary.[193]\n\nKunis is a supporter of the Democratic Party.[194] In a 2012 interview, she criticized the Republican Party, saying: \"The way that Republicans attack women is so offensive to me. And the way they talk about religion is offensive. I may not be a practicing Jew, but why we gotta talk about Jesus all the time?\"[164] In 2017, Kunis disclosed that she had been making monthly donations to Planned Parenthood in Mike Pence's name.[195] In April 2020, Kunis and Kutcher developed their own wine, named Quarantine Wine, with 100% of the proceeds going to aid during the COVID-19 pandemic.[196] The following year they launched Outside Wine, a blend of red wine, whose profits would benefit The Skate Park Project and Thorn.org.[197]\n\nIn 2022, Kunis and Kutcher started a gofundme page to help two online companies (Airbnb and Flexport) to aid refugees fleeing the violence in Russia's invasion of Ukraine. They exceeded their thirty million dollar goal as of March 18, 2022. The couple promised to donate $3 million of their own money to the cause.[198][199][200]\n\nActing credits and awards\n\nAccording to the review aggregator site Rotten Tomatoes, Kunis's most critically successful films are Gia (1998), Forgetting Sarah Marshall (2008), Extract (2009), Date Night (2010), Black Swan (2010), Friends with Benefits (2011), Ted (2012), Oz the Great and Powerful (2013) and Bad Moms (2016).[201] Her television projects include FOX sitcom That '70s Show (1998–2006) and animated series Family Guy (1999–present).[202]\n\nKunis has received one Golden Globe nomination for Best Supporting Actress and two Screen Actors Guild Awards nominations for Best Supporting Actress and Outstanding Performance by a Cast for her performance in Black Swan (2010).[203][204] Kunis was nominated for an Annie Award for Best Voice Acting for her work in Family Guy and has garnered two Critics' Choice Awards nominations for Best Supporting Actress in Black Swan (2010) and Best Actress in a Comedy in Ted (2012) respectively.[205][206][207]\n\nNotes\n\n^ Ukrainian: Мілена Марківна Куніс ; Russian: Милена Марковна Кунис , romanized: Mila Markovna Kunis", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Mila_Kunis_2018.jpg/220px-Mila_Kunis_2018.jpg", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/0/0f/Mila_Kunis_2018_%28cropped_2%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Mila_Kunis_by_Gage_Skidmore.jpg/190px-Mila_Kunis_by_Gage_Skidmore.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Mila_Kunis_2018_%28cropped_2%29.jpg/220px-Mila_Kunis_2018_%28cropped_2%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Mila_Kunis%2C_2011.jpg/220px-Mila_Kunis%2C_2011.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/7c/Mila_Kunis_2008.jpg/170px-Mila_Kunis_2008.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/20120712_Mila_Kunis_%40_Comic-con_cropped.jpg/190px-20120712_Mila_Kunis_%40_Comic-con_cropped.jpg", "http://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://en.wikipedia.org/static/images/footer/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Mila_Kunis_Esquire_2012.jpg/247px-Mila_Kunis_Esquire_2012.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/9/94/Symbol_support_vote.svg/19px-Symbol_support_vote.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/0/0f/Mila_Kunis_2018_%28cropped_2%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Mila_Kunis", "title": "Mila Kunis", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/0/0f/Mila_Kunis_2018_%28cropped_2%29.jpg", "width": 640, "height": 944}, "title": "Mila Kunis - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}