{"url": "www.celebritynetworth.com/richest-celebrities/actors/rachel-weisz-net-worth/", "text": "What is Rachel Weisz's Net Worth?\n\nRachel Weisz is an English actress and model who has a net worth of $40 million. Weisz is one of the most celebrated actresses of the modern era, having won an Academy Award, a Golden Globe Award, a Laurence Olivier Award, and a British Academy Film Award. After beginning her career with theatre and television roles, Rachel eventually gravitated towards film and started to make a name for herself. Today, she is probably best known for her breakthrough role in \"The Mummy\" and \"The Mummy Returns.\"\n\nThat said, she has continued her career with a number of notable roles in films like \"Enemy at the Gates\" and \"The Lovely Bones,\" and she won an Academy Award for her role in 2005's \"The Constant Gardener.\" While Weisz is a regular fixture in major motion pictures, she also branches out considerably into well-received independent films. These include \"The Deep Blue Sea\" and \"The Favourite.\" She also maintains a considerable presence in the world of theatre.\n\nEarly Life\n\nRachel Hannah Weisz was born on March 7th of 1970 in Westminster, London. Raised in a Jewish household in the London suburb of Hampstead Garden alongside a younger sister, Rachel was encouraged to pursue the arts at a young age. At the age of 14, the exceptionally beautiful Weisz started modeling. During this period, she also started to venture into the acting world.\n\nAfter graduating from secondary school, Rachel studied at Trinity Hall, Cambridge. During her university days, Weisz performed in various school plays and eventually graduated with upper second-class honors.\n\nCareer\n\nRachel began her acting career with primarily television work in various British series and stage work. She also appeared in television films during this early period. By 1994, she had booked her first movie role in \"Death Machine,\" although she played a minor part. That year, she also broke through with a stage production of \"Design for Living.\" She then followed up with roles in movies like \"Chain Reaction\" and \"Stealing Beauty,\" the latter of which earned her the reputation of being a so-called \"English Rose.\"\n\nAfter a few more film roles, Rachel truly broke through with a central role in the film \"The Mummy.\" The 1999 movie proved to be quite successful, raking in over $416 million on a budget of $80 million. However, critics weren't very kind to the acting performances, which they referred to as \"buffoonery.\" In 2001, Weisz reprised her role in \"The Mummy Returns,\" which was even more financially successful than the original film. It raked in $435 million in total on a budget of just under $100 million, but once again failed to impress critics.\n\nThis was the beginning of Rachel's time in the spotlight, and she followed up with roles in major films like \"Beautiful Creatures,\" \"Enemy at the Gates,\" \"About a Boy,\" \"The Runaway Jury,\" and \"The Shape of Things.\" After a few more major film appearances, Rachel made a huge impact with her performance in \"The Constant Gardener.\" The performance won her the Academy Award for Best Supporting Actress in 2006. That year, she also appeared in \"The Fountain.\" In 2009, she received widespread acclaim for her appearance in the theatre revival of \"A Streetcar Named Desire.\"\n\nFrom the 2010s onward, Weisz started to venture more towards independent films and stage work. Her films of this period include \"The Whistleblower\" and \"The Deep Blue Sea.\" That being said, Rachel also found time to appear in major films like \"The Bourne Legacy.\" From the middle of the decade, her most notable films were independent productions like \"The Lobster\" and \"The Favourite.\" The latter performance earned her a BAFTA Award for Best Actress in a Supporting Role, and she was also nominated for an Academy Award for Best Supporting Actress.\n\nTowards the end of the 2010s, Weisz started her own production company called LC6 Productions. The company released the film \"Disobedience\" in 2017. In 2019, she was strongly linked to the Marvel Cinematic Universe, and she was rumored to have a role in the film \"Black Widow.\" In 2021, it was confirmed that she had booked the role of Iron Maiden in the movie.\n\nRelationships\n\nRachel Weisz was once engaged to filmmaker Darren Aronofsky after the pair started dating in 2012. Aronofsky and Weisz had a son together in 2006 but ultimately went their separate ways in 2010. Not long afterward, Rachel began dating her longtime friend and fellow actor Daniel Craig. In 2011, they were married, and they subsequently had one child together. That year, Weisz also became a naturalized US citizen, giving her dual British-American citizenship.\n\nReal Estate\n\nIn 2018, it was widely reported that Rachel Weisz and Daniel Craig had purchased a home in Brooklyn. Apparently, they paid $6.75 million for the house in Cobble Hill. Despite being partially burned in 2016, the 6,600-square-foot property was repaired long before Weisz and her husband purchased it. It features six bedrooms, 14-foot ceilings, and an elevator. Prior to this purchase, the couple was widely rumored to have lived in a multi-million property in Soho.\n\nIn 2019, it was reported that Craig and Weisz had sold a property in East Village for $6 million. This was the exact same price they originally paid for the residence in 2012, which represents a net loss when you consider the various fees associated with a real estate transaction. The condo spans 3,200 square feet and features three bedrooms.", "images": ["http://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://vz.cnwimg.com/wp-content/uploads/2010/12/Rachel-Weisz.jpg"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2010/12/Rachel-Weisz.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/rachel-weisz-net-worth/", "title": "Rachel Weisz Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Rachel Weisz is an English actress and model who has a net worth of $40 million. Weisz is one of the most celebrated actresses of the modern era, having won an Academy Award, a Golden Globe Award, a Laurence Olivier Award, and a British Academy Film Award.", "cnw_share_fb_count": 111, "cnw_share_tw_count": 13, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Rachel Weisz Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/rachel-weisz-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/12/Rachel-Weisz.jpg", "site_name": "Celebrity Net Worth", "description": "Rachel Weisz is an English actress and model who has a net worth of $40 million. Weisz is one of the most celebrated actresses of the modern era, having won an Academy Award, a Golden Globe Award, a Laurence Olivier Award, and a British Academy Film Award."}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2021-09-30T14:58:55+00:00", "published_time": "2021-02-02T16:07:30+00:00", "section": "Actors", "tag": "richest actresses"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/12/Rachel-Weisz.jpg", "title": "Rachel Weisz Net Worth", "description": "Rachel Weisz is an English actress and model who has a net worth of $40 million. Weisz is one of the most celebrated actresses of the modern era, having won an Academy Award, a Golden Globe Award, ..."}}, "movies": [], "publish_date": 1612282050.0, "source": "http://www.celebritynetworth.com", "summary": ""}