{"url": "https://www.vulture.com/2018/01/acs-gianni-versace-cast-real-life-counterparts.html", "text": "Photo: FX Networks/Getty\n\nAs has become a tradition for Ryan Murphy programming, the day has finally come — FX promotional materials aside — that we can gaze upon the actors he’s hired to portray historical figures for The Assassination of Gianni Versace: American Crime Story. Since the world can only handle so much suspense in being exposed to Penélope Cruz’s bleach-blonde Donatella, we put together side-by-side comparisons of Versace’s actors and their real-life counterparts to give you a taste of what’s to come, as well as some historical information to appraise you on who’s who. Knowledge is power, readers!\n\nDarren Criss as Andrew Cunanan\n\nPhoto: FX Networks/Getty\n\nCunanan, a gay gigolo with a genius-level IQ who lived his formative years in California, is known to have murdered at least five people throughout his 1997 killing spree, which began with his murder of an acquaintance in Minneapolis. Cunanan is believed to have suffered from antisocial personality disorder, which in turn made him “crave the limelight and aspire to the top, whether through charm or falsehood,” according to Vanity Fair’s Maureen Orth. Eight days after killing Versace, he committed suicide on a houseboat in Miami.\n\nEdgar Ramírez as Gianni Versace\n\nPhoto: FX Networks/Getty\n\nAt the time of his death, the Versace empire had amassed a reputation as one of the most innovative and popular fashion houses in the world, during which time Gianni also absorbed a devoted celebrity clientele. (“A good designer must cultivate himself. Read, absorb everything,” he once told Charlie Rose in an interview. “To be superficial, you have to be profound.”) He was also open about his sexuality, becoming one of the first prominent celebrities to reveal he was gay in the ’80s. He was 50 years old when murdered by Cunanan.\n\nPenélope Cruz as Donatella Versace\n\nPhoto: FX Networks/Getty\n\nWhile Donatella is now known as the spunky HBIC and artistic director of Versace, things were different back in 1997. At the time of her brother’s murder, she was running her own diffusion label of the brand, Versus Versace, which was created specifically for her by Gianni. Upon his death — which she did not witness — Donatella was given full creative control of the Versace brand, eventually guiding it through numerous iconic and memorable collections throughout her continuing tenure. She’s rarely spoken about Gianni, though she spoke to the Guardian about him on the 20th anniversary of his death. “When my brother was murdered, I had the eyes of the whole world on me and 99 percent of them thought I wasn’t going to make it,” she said in part. “And maybe I thought the same, at first. My brother was the king, and my whole world had crashed around me.” In the days following his murder, Donatella and most of the Versace family retreated to a private Caribbean resort due to safety concerns.\n\nRicky Martin as Antonio D’Amico\n\nPhoto: FX Networks/Getty\n\nD’Amico, an Italian model and fashion designer for Versace Sport, was Gianni’s companion for 15 years. He was eating breakfast inside the Miami mansion when the murder occurred, later describing how he fell into a deep depressive state in the subsequent years. “I had never been through a depression and never saw a therapist as I was advised to: why did I need to tell someone else what had happened when I knew I was this way because Gianni’s death had torn me in two?” he recently told the Guardian in a rare interview. “I was in a nightmare, I felt nothing and gave no importance to anything … the house, the money … because it felt false to have expectations of life.” D’Amico has been living a “simple” life in the Italian countryside with his new long-term partner for several years now.\n\nMike Farrell as Lee Miglin\n\nPhoto: Getty Images\n\nMiglin — a real-estate mogul based in Chicago, who rose from a poor background to achieve his success — was the third victim of Cunanan’s murder spree prior to Versace’s murder. The extremely gruesome May 1997 crime scene, which was widely covered at the time by the Chicago Tribune, was described as a murder “that would be considered vicious in any Chicago neighborhood, let alone the city’s most expensive.” The Miglin family has repeatedly denied that Lee, or anyone else in the extended family circle, ever had a personal connection to Cunanan.\n\nJudith Light as Marilyn Miglin\n\nPhoto: FX Networks/HSN\n\nA former dancer who built a beauty empire at the Home Shopping Network, Miglin was married to her husband, Lee, for nearly 40 years. She has rarely spoken about her husband in the years since his murder, with her only substantial interview appearing in the Chicago Tribune a year after Lee’s death. “I don’t think you heal — you never close up that gaping wound — but you adjust,” she said at the time. “I lived the life of a fairy princess and I had a prince for 38 years, and then one day my prince went to war and didn’t come back.” Miglin’s products on HSN continue to be wildly popular.", "images": ["https://pyxis.nymag.com/v1/imgs/427/a1f/024954c76410320033644c55296996c2ec-dontella-versace.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/427/a1f/024954c76410320033644c55296996c2ec-dontella-versace.1x.rsocial.w1200.jpg", "https://pyxis.nymag.com/v1/imgs/e33/6e7/aed044d06bd5c293490430f400dc112e41-2022Cov4x5-AsianAmericaPkg.w240.jpg", "https://pyxis.nymag.com/v1/imgs/4e5/b38/a5361d2cd87f15b86bcdea01ae4ef9083c--lee-miglin.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/31a/165/7b2cda49d5258316afceb071e56d8d3a8b-women-3.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/b94/95a/fb7fff0abd34f525ad8d4fa1f9ae08d9c5-edgar-ramirez-gianni-versace.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/ddf/a99/2d1bb6c542189e8ae7edb26039b6cdf756-andrew-cunanan.h473.w710.jpg", "https://pyxis.nymag.com/v1/imgs/ef7/afb/e8fff2832c2c35f98d9c72a1c4baef3366-antonio-d-amico.h473.w710.jpg", "https://www.vulture.com/media/components/customer-alert-banner/close_x.svg", "https://www.vulture.com/media/components/customer-alert-banner/alert.svg", "https://pyxis.nymag.com/v1/imgs/427/a1f/024954c76410320033644c55296996c2ec-dontella-versace.rsquare.w700.jpg", "https://pyxis.nymag.com/v1/imgs/c32/3bf/0a393283dc1f3f9257ff8b361ea03216c8-russia-missile.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/5ea/81e/4d3b39a96107c321338c0c9a25557bd47f-zarifa-ghafari.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/267/8bf/0a7166667494e4a1eba8ad1c9707d0eda3-marilyn-miglin.h473.w710.jpg", "https://www.vulture.com/media/components/customer-alert-banner/double_chevron.svg"], "top_img": "https://pyxis.nymag.com/v1/imgs/427/a1f/024954c76410320033644c55296996c2ec-dontella-versace.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["Devon Ivie"], "canonical_link": "https://www.vulture.com/2018/01/acs-gianni-versace-cast-real-life-counterparts.html", "title": "How ACS: Versace Actors Compare to Real-life Counterparts", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "parsely-tags": "history lessons, ryan murphy, fx, the assassination of gianni versace, gianni versace, the assassination of gianni versace: american crime story, tv, penelope cruz, ricky martin, judith light, darren criss, vulture lists, donatella versace, american crime story, featuretype:feature, featuretype:list or roundup", "og": {"title": "See How American Crime Story: Versace Actors Compare to Real-life Counterparts", "url": "https://www.vulture.com/2018/01/acs-gianni-versace-cast-real-life-counterparts.html", "description": "Penélope Cruz as Donatella Versace? Already iconic.", "image": "https://pyxis.nymag.com/v1/imgs/427/a1f/024954c76410320033644c55296996c2ec-dontella-versace.1x.rsocial.w1200.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "How ACS: Versace Actors Compare to Real-life Counterparts", "description": "Penélope Cruz as Donatella Versace? Already iconic.", "image": "https://pyxis.nymag.com/v1/imgs/427/a1f/024954c76410320033644c55296996c2ec-dontella-versace.2x.rsocial.w600.jpg", "card": "summary_large_image", "creator": "@devonsaysrelax", "site": "@vulture"}, "article": {"published_time": "2018-01-17T17:00:26.859-05:00", "tag": "history lessons, ryan murphy, fx, the assassination of gianni versace, gianni versace, the assassination of gianni versace: american crime story, tv, penelope cruz, ricky martin, judith light, darren criss, vulture lists, donatella versace, american crime story", "publisher": "https://www.facebook.com/Vulture"}, "description": "’The Assassination of Gianni Versace: American Crime Story’ has actors portraying real-life people involved in Andrew Cunanan’s serial killing spree, like Penelope Cruz as Donatella Versace, Edgar Ramirez as Gianni, and Darren Criss as Cunanan.", "robots": "max-image-preview:large", "sailthru.tags": "history lessons, ryan murphy, fx, the assassination of gianni versace, gianni versace, the assassination of gianni versace: american crime story, tv, penelope cruz, ricky martin, judith light, darren criss, vulture lists, donatella versace, american crime story", "author": "Devon Ivie", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://assets.nymag.com/media/sites/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1516226426.859, "source": "https://www.vulture.com", "summary": ""}