{"url": "http://www.state.gov/r/pa/ei/bgn/5375.htm#econ", "text": "More information about the United Kingdom is available on the United Kingdom Page and from other Department of State publications and other sources listed at the end of this fact sheet.\n\nU.S.-UNITED KINGDOM RELATIONS\n\nThe United States has no closer Ally than the United Kingdom. Following the end of the American Revolution in 1783, the United Kingdom officially recognized American independence, and in 1785 our two countries established diplomatic relations. Other than a brief break in relations during the War of 1812, the United States and the United Kingdom have remained durable partners and Allies. Our partnership is a foundation of our mutual prosperity and security.\n\nThe strong relationship between the United States and the United Kingdom reflects our common democratic ideals and values, which are reinforced through cooperation on political, security, and economic issues. Along with other European allies, the United States and the United Kingdom work closely together to combat terrorism, stop the proliferation of weapons of mass destruction, and ensure regional security. The United States and the United Kingdom coordinate closely to respond to dangerous and destabilizing actions by Moscow that threaten our security and erode democratic freedoms and institutions including the Kremlin’s war against Ukraine, election interference, cyberattacks, use of chemical weapons, the use of corrupt proxies, and human rights violations. In September 2021 the United States, Australia, and the United Kingdom signed the Australia, United Kingdom, and United States (AUKUS) security partnership agreement, further solidifying security cooperation between allies.\n\nThe United States supports the peace process and devolved political institutions in Northern Ireland and encourages the implementation of the U.S.-brokered 1998 Belfast Agreement, also known as the Good Friday Agreement.\n\nThe United States and the United Kingdom preserve and strengthen the historic bonds between our two nations through educational, cultural, and professional exchange and development opportunities. The UK is a top study abroad destination for U.S. students, and in the 2020/21 academic year, more than 8,028 students from the UK studied in the United States. The Fulbright Program in the United Kingdom is one of the oldest and largest in the world. Since 1948, more than 27,000 scholars, students, and teachers have benefited from Fulbright exchanges between the United States and the United Kingdom. Additionally, close to 17,500 UK citizens come to the United States each year on privately funded exchange programs.\n\nU.S. Assistance to the United Kingdom\n\nThe International Fund for Ireland (IFI), established by the British and Irish governments in 1986, provides funding for projects to sustain the peace process and to generate cross-community engagement and economic opportunity in Northern Ireland (the United Kingdom) and the border counties of Ireland. The U.S. government has contributed more than $549 million to the IFI since its establishment.\n\nBilateral Economic Relations\n\nMutual trade and investment are at the heart of our prosperity, and our commitment to free market values enables our economies to thrive. Following the United Kingdom’s 2020 departure from the European Union, the United States continues to be a strong partner to the United Kingdom and looks forward to advancing mutual international trade priorities rooted in our shared values, while promoting innovation and inclusive economic growth for workers and businesses on both sides of the Atlantic.\n\nThe United States and the United Kingdom are the world’s first and fifth largest economies in the world by GDP. We traded over $273 billion worth of goods and services in 2019. Two-way direct investment totals over $1.3 trillion.\n\nEvery U.S. state has jobs that are connected to an investment by a UK company. Nearly 1.3 million Americans work for UK companies in the United States, and over 1.5 million Britons are directly employed by U.S. firms. The top U.S. exports to the United Kingdom include precious metal and stone, aircraft, machinery, financial and travel services, and agricultural products, such as wine and beer.\n\nLeading on Climate\n\nThe United States and the United Kingdom are leaders in the global fight against climate change and are committed to taking decisive action to reach our shared goal of achieving net-zero emissions no later than 2050 and keeping the goal of limiting warming to 1.5 degree Celsius within reach.\n\nThe United States is committed to reducing emissions by 50-52 percent in 2030 compared to 2005 levels, while the UK’s new 2035 target to slash emissions by 78 percent has also set a high bar for other major economies. The UK hosted the 26th UN Climate Change Conference of the Parties (COP26) in Glasgow, Scotland in 2021, and we will continue to work closely with the UK to secure international commitments that raise ambition on climate action and protect the world from climate change.\n\nThe United Kingdom’s Membership in International Organizations\n\nAlong with France, both the United States and the United Kingdom are among the five permanent members of the UN Security Council (P5) and are founding members of NATO. In addition, the United Kingdom and the United States belong to the Organization for Security and Cooperation in Europe (OSCE), G-20, G-7, Organization for Economic Cooperation and Development (OECD), International Monetary Fund (IMF), World Bank, and World Trade Organization. As our Ally, and a top contributor at NATO, the UK strengthens the Alliance’s ability to deter modern security and defense threats. The UK leads on key NATO efforts, such as cyber and emerging and disruptive technologies, and is a Framework Nation for the Enhanced Forward Presence in Estonia. The United Kingdom also is an observer to the Organization of American States and a Dialogue Partner of the Association of Southeast Asian Nations.\n\nBilateral Representation\n\nPrincipal embassy officials are listed in the Department’s Key Officers List.\n\nThe United Kingdom maintains an embassy in the United States at 3100 Massachusetts Ave. NW, Washington, DC 20008; tel. 202-588-6500.\n\nMore information about the United Kingdom is available from the Department of State and other sources, some of which are listed here:\n\nCIA World Factbook United Kingdom Page\n\nU.S. Embassy\n\nHistory of U.S. Relations With the United Kingdom\n\nU.S. Census Bureau Foreign Trade Statistics\n\nExport.gov International Offices Page\n\nTravel Information", "images": ["https://www.state.gov/wp-content/uploads/2018/11/UK-1024x683.jpg"], "top_img": "https://www.state.gov/wp-content/uploads/2018/11/UK-1024x683.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.state.gov/u-s-relations-with-united-kingdom/", "title": "U.S. Relations With United Kingdom", "meta_data": {"viewport": "width=device-width, initial-scale=1", "msapplication-tap-highlight": "no", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "U.S. Relations With United Kingdom - United States Department of State", "description": "More information about the United Kingdom is available on the United Kingdom Page and from other Department of State publications and other sources listed at the end of this fact sheet. U.S.-UNITED KINGDOM RELATIONS The United States has no closer Ally than the United Kingdom. Following the end of the American Revolution in 1783, the […]", "url": "https://www.state.gov/u-s-relations-with-united-kingdom/", "site_name": "United States Department of State", "image": {"identifier": "https://www.state.gov/wp-content/uploads/2018/11/UK-1024x683.jpg", "width": 1024, "height": 683, "type": "image/jpeg"}}, "article": {"modified_time": "2022-09-09T14:39:59+00:00"}, "twitter": {"card": "summary_large_image"}, "generator": "WordPress 6.0.2", "msapplication-TileImage": "https://www.state.gov/wp-content/uploads/2022/04/cropped-dos_seal-270x270.png"}, "movies": [], "publish_date": null, "source": "http://www.state.gov", "summary": ""}