{"url": "https://www.brides.com/story/miranda-kerr-wedding-hair", "text": "Katy Perry and Orlando Bloom are the A-list couple that no one saw coming. Between their flirtatious first meeting, romantic Valentine's Day proposal, and epic pregnancy announcement, here is everything you need to know about Katy Perry and Orlando Bloom's relationship.\n\nKaty Perry and Orlando Bloom first met at a Golden Globes after-party in 2016 and immediately hit it off. After a year of dating, the couple called their relationship quits, but later reconciled.\n\nOrlando proposed on Valentine's Day in 2019 with a unique ruby engagement ring.\n\nOn March 4, 2020, Katy revealed she was pregnant with Orlando's child in her music video for \"Never Worn White.\"\n\nThe couple welcomed their daughter, Daisy Dove Bloom, on August 26, 2020.\n\nJanuary 10, 2016: A Flirty Encounter\n\nGetty Images\n\nKaty Perry and Orlando Bloom first met at a Golden Globes after-party in 2016. According to onlookers, the two were acting quite flirty and even left the event together.\n\nLater that month, the pair was scene attending the production of \"The Absolute Brightness of Leonard Pelkey.\"\n\nApril 2016: From the Mountains to the Valley\n\nBy April 2016, it was pretty clear that the singer and the movie star were an item since they attended a wedding together in Aspen, Colorado and the music festival, Coachella, on back-to-back weekends.\n\nMay 19, 2016: Are They or Aren't They?\n\nWhile rumors of the budding relationship flourish, the pair was notably seated at different tables for the amfAR Gala during Cannes Film Festival.\n\nMay 20, 2016: Instagram Official\n\nThe American Idol judge finally confirmed her relationship with Bloom by posting a photo of the pair on Instagram. The duo was in France together for the Cannes Film Festival and Katy shared a snap of the two dressed in robes, lying on the grand stairs outside a mansion with the clever caption, \"we cannes't.\"\n\nAugust 4, 2016: Those Paddleboarding Pics\n\nThe paparazzi pictures of their Italian holiday in the summer of 2016 will probably live in infamy. Not only did they ride a paddleboard together in the Mediterranean, but Bloom paddled completely naked. The best part? Katy seemed unbothered by her boyfriend baring it all behind her.\n\nOctober 31, 2016: Couple's Costume\n\nIn the spirit of the 2016 presidential election, Katy and Orlando took their relationship to the next level by dressing as Hillary and Bill Clinton for a star-studded Halloween party. The couple spared no expense dressing in realistic prosthetics, with Katy rocking a red pantsuit. They even hired someone to follow them around the party dressed as a \"Trump troll.\" One point for creativity!\n\nNovember 24, 2016: He's Part of the Family\n\nAfter less than a year of dating, Orlando was invited to celebrate Thanksgiving with Katy and her family. He fit right in with the Perrys, even wearing festive holiday pajamas with the rest of the family, which Katy fortunately documented on Instagram.\n\nMarch 1, 2017: Calling It Quits\n\nIn March 2017, they called their relationship quits. \"Before rumors or falsifications get out of hand we can confirm that Orlando and Katy are taking respectful, loving space at this time,\" their reps said in a statement, per E! News. According to sources, their split was mutual and the pair remained friends.\n\nAugust 11, 2017: Back Together Again?\n\nBut, Orlando and Katy's breakup was seemingly short-lived after they were spotted attending an Ed Sheeran concert together in Los Angeles. The Daily Mail published photos of the pair acting very cuddly and a source even told E! News \"they definitely seemed like they're back together.\"\n\nJanuary 2018: Reconciliation in the Maldives\n\nBy the beginning of 2018, it appeared the couple was giving their relationship another shot. They celebrated the new year with a luxurious vacation to the Maldives as reconciliation rumors raged on.\n\nFebruary 28, 2018: Perry in Prague\n\nThe singer visited her beau in Prague while Bloom was filming his Amazon Prime series Carnival Row. A source told People, \"In the past few months, they have spent a lot of time together. They both love traveling and are trying to share as many fun trips as possible. They are dating, but not necessarily putting a label on it. They are not girlfriend and boyfriend. They do seem very happy together though. Orlando always had the nicest things to say about Katy. He loves spending time with her.”\n\nMarch 21, 2018: \"I'm Not Single\"\n\nIn a very awkward moment, Katy confirmed she was no longer single on an episode of American Idol. \"Can I be in the running?\" Katy asked former Bachelorette Becca Kufrin, who was on air to promote her upcoming season of The Bachelorette. \"I'm not single but I still like you,\" the judge went on to say. While Perry never explicitly said that Orlando was the one who had her heart, their love affair was pretty clear.\n\nApril 27, 2018: A Papal Meeting\n\nPerry and Bloom travel to Italy together and meet Pope Francis at the United to Cure conference at the Vatican. Katy fuels the relationship speculation fire by gushing about her \"darling\" beau in an Instagram post.\n\nSeptember 26, 2018: Red Carpet Debut\n\nGetty Images\n\nWhile the couple had been photographed together before, they had yet to walk a red carpet as a pair until September 2016. They attended the Gala for the Global Ocean in Monte Carlo together and looked absolutely smitten.\n\nFebruary 14, 2019: A Valentine's Day Engagement\n\nOrlando proposed to Katy on Valentine's Day in 2019. He chose a very unique flower-shaped ruby engagement ring to gift his fiancée. The night started with dinner at an Italian restaurant before the couple boarded a helicopter (yes, he proposed in the sky!). When they later landed on a roof, the newly engaged couple was greeted by family, friends, and dozens of flowers.\n\nFebruary 20, 2019: Engagementmoon in the Mountains\n\nA week after they became fiancés, the couple hit the slopes for an engagementmoon. They shared snaps of their ski trip on Instagram with Orlando writing, \"Underneath, we’re grinning from ear to ear.\" Katy jokingly commented, \"Tag me so I don’t like look a random.\"\n\nJune 6, 2019: No Rush to the Altar\n\nWhile appearing on KISS Breakfast With Tom & Daisy, the \"Roar\" singer told the radio hosts she was in no rush to walk down the aisle. “Well yeah, one step at a time. Definitely, you know, trying to, like, lay the good emotional foundation for the lifetime of commitment, which is, like, a big deal, you know?”\n\nSeptember 2019: A Modern Family\n\nPerry got candid about her relationship with Bloom's son, eight-year-old Flynn, on The Ellen Degeneres Show. The singer explained how she's adjusted her own routines to be more inline with \"adulting,\" including becoming a morning person to accommodate his schedule and going to bed at 10 p.m.\n\nNovember 2019: Trip to the Pyramids\n\nIn November, the singer celebrated her 35th birthday visiting the pyramids in Giza, Egypt with Bloom. Orlando reflected on the trip with an Instagram post captioned: \"It’s like looking out over the entire cosmos — Egyptian magic got my heart open to a download of love for my Scorpio’s wonder women both celebrating their #birthday.”\n\nDecember 2019: First Wedding Postponement\n\nSeveral sources revealed to US Weekly that the celebrity couple had intended to wed in December 2019. The supposed nuptials were forced to be rescheduled due to issues with the venue location.\n\nMarch 4, 2020: The Pregnancy Announcement\n\nWhen Katy dropped her music video for her single \"Never Worn White,\" she also dropped another bombshell—she's pregnant! At the end of the music video, Katy is seen cradling her growing baby bump. The song also pays homage to her romance with Orlando with lyrics like, \"Cause I've never worn white/But I wanna get it right/Yeah, I really wanna try with you/No, I've never worn white/But I'm standin' here tonight/Cause I really wanna say 'I do.'\"\n\nMarch 5, 2020: Postponing the Wedding\n\nJust a day after announcing their pregnancy, news broke that the couple postponed their March wedding due to the pandemic. Katy and Orlando planned to tie the knot in Japan but were forced to put the nuptials on hold.\n\nMarch 6, 2020: A Note on Friction\n\nAlmost immediately after the flurry of announcements, Perry sat down with Ryan Seacrest on On Air With Ryan Seacrest. The singer discussed her personal journey and pregnancy while recognizing Bloom for his support in her journey to becoming her best self—despite their relationship not always being completely perfect. “There’s a lot of friction between my partner and I,” she explains, “But, that friction breeds something beautiful. It can breed a lot of light.”\n\nApril 3, 2020: A Sweet Gender Reveal\n\nNearly a month after the couple announced they were expecting, they took to Instagram to share the baby's gender! \"It's a girl,\" wrote Katy on Instagram, underneath a photo of Orlando covered in pink frosting.\n\nAugust 26, 2020: Welcome to the World, Daisy Dove Bloom\n\nOn August 26, 2020, Katy and Orlando welcomed their first child together and named her Daisy Dove Bloom. \"We are floating with love and wonder from the safe and healthy arrival of our daughter,\" the new parents said on Instagram. It seems as though the couple had baby Daisy's name finalized long before the birth. The Instagram photo showed off the new mother's daisy manicure as a sweet nod to the little one. Plus, the singer released a song titled \"Daisies\" in May 2020, which was a clear hint to her daughter's name!\n\nThe birth announcement was originally made by UNICEF since both Katy and Orlando are Goodwill Ambassadors. The singer and actor took the arrival of their daughter as an opportunity to spread UNICEF's message—even creating a donation page on behalf of Baby Bloom. The couple revealed, \"In celebration of the heart we know our daughter already has, we have set up a donation page to celebrate DDB’s arrival. By supporting them, you are supporting a safe start to life and reimagining a healthier world for every child. We hope your ♥️ can bloom with generosity.\"\n\nNovember 2020: A Growing Family\n\nThe new parents adopted a puppy into their growing family amidst talk of Bloom's reduction of work commitments to prioritize time at home.\n\nJune 2021: On the Big Screen\n\nKaty Perry and Orlando Bloom make their first onscreen appearance together in Transmissions From the Future. In the film, Bloom makes a subtle nod to their IRL relationship with the line: \"Tell Daisy we love her.\"\n\nJuly 2021: Summer Getaways\n\nThe pair took social media by storm with a flurry of summer vacation photos from a romantic trip to Italy in June and PDA-filled getaway to Turkey in July. Perry even cheekily commented, \"You forgot to tag me daddy,\" on one of Bloom's posts.\n\nSeptember 30, 2021: A Helping Hand\n\nGetty Images\n\nIn September 2021, the couple attended Variety's Power of Women event on behalf of Perry's Firework Foundation. The songstress called for her fiancés help during an onstage performance, asking him to unzip her corset so she could breathe. Bloom dutifully obliged, even landing a peck on her shoulder, before returning to his seat.\n\nFebruary 2022: Pinky Promises\n\nPhotos of Perry wearing a gold band on her left ring finger sparked rumors of a secret wedding in 2022. Katy set fans at ease by denying the speculation and admitting that new COVID variants were holding up their destination wedding.", "images": ["https://www.brides.com/thmb/9YfqXbef5vaV3RRlwf_8cSstzVs=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/lindsay-d19edccdbce8411395c19bbd8f1f5254.png", "https://www.brides.com/thmb/99L6jKKQkTpEzbaTdVF1AlkUjRE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():gifv()/GettyImages-1169491940-58c564809e4143f2962beff47ecedc12.jpg", "https://www.brides.com/thmb/jwlEhbE3p0F-egRhH6nfcJVN4ZA=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/187214427_597059551697181_1638986705108839687_n-0d64b203459a45b8b4b280d3b53a58f5.jpg", "https://www.brides.com/thmb/gLrcigphztbk3zEouICrwJoOwMk=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__5cd0d8e1254167737e821517__11-5b71710d962641c9959f545ea3ffe0c0.jpeg", "https://www.brides.com/thmb/-X6eLwipPHxVT0a5kzGDmJWHa-E=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/royal-wedding-handout-ce88891c5bc54940b9b328766f4de82e.jpg", "https://www.brides.com/thmb/hPFRbL1BfXFlW9gpCjTs8SUTstQ=/1725x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1344198976-8be331d8b77a419ca757d734a73062f8.jpg", "https://www.brides.com/thmb/CpScQR7dZKa7dgURvBl7FdJNsP4=/200x200/filters:no_upscale():max_bytes(150000):strip_icc()/DSC03763-54bce324f1bd48f5af0910efb178cb7e.jpg", "https://www.brides.com/thmb/hLCNaz80aKzJ1MkGtT2ggFvAibg=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/recirc_03-celebrity-cdfb6ac933ec4f49adc7b79ba5b374b5.jpg", "https://www.brides.com/thmb/HRnH7dr-1In8Pe4lQqOaqtpza6k=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1205194042-7563933ffffa44caa0f765ae09294db6-6c5145a8cc7a431fbb821b5025f0adb3.jpg", "https://www.brides.com/thmb/WmLux9zbtuze8clok3iKmEymRI4=/1725x0/filters:no_upscale():max_bytes(150000):strip_icc()/katy-perry-orlando-bloom-2016-c4dca23b70ec425f877291e4d0fdb198.jpg", "https://www.brides.com/thmb/G1y_P_m3hQRdoj0kht4lNp45viQ=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1127280677-92be3ed93eab4d17b23e137ce6f2897c.jpg", "https://www.brides.com/thmb/NWRo4iW41xB6rEuW2Zu5TDJXUVs=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/celebrityproposalmainimage-7809edc291774212bc766c5b99507175.jpg", "https://www.brides.com/thmb/APm7zypz_Yu-4hyYgMC4-80RZHY=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1138978659-6f4c1e0b72c64de49d003429ec4f0014.jpg", "https://www.brides.com/thmb/vqEXdG6FtjpX4Jt7IskO7b3ybbk=/1024x693/filters:fill(auto,1)/GettyImages-1169491940-58c564809e4143f2962beff47ecedc12.jpg", "https://www.brides.com/thmb/LQ-RE7eC1TgteDArJeAUcNmgvQA=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__brides__proteus__5c66b979ca7b722d52789107__11-658b97287d7a40fba09b1081118fef05.jpeg", "https://www.brides.com/thmb/bmKMXNHcy7MRrwnCfLyucoOKP7E=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/RodinEckenrothGetty-e104207fb584464789d7ae7a7e5f9433.jpg", "https://www.brides.com/thmb/Yh8p7H_AV4aQaYL82EckrhexjEk=/1725x0/filters:no_upscale():max_bytes(150000):strip_icc()/katy-perry-orlando-bloom-red-carpt-2018-f82939a27a6844a3a8581a6ab3c96ffd.jpg", "https://www.brides.com/thmb/PbZdwJVYzQB8RYoKHgoGvx9nNIU=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/nikki-bella-artem-chigvintsev-red-carpet-4e60846d205b40439115c0235fd1081a.jpg", "https://www.brides.com/thmb/W667eSk_01HCI0GoVuWrY2kFb_w=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/JulianFinneyGettyImages-c457cf31a65e4a3cb2dd3533cd0af558-09b37fec2db94f35bee2e73bd8eec3b6.jpg", "https://www.brides.com/thmb/J-GgAJqqoh5EpxcjJZ865bhexw4=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/will-and-jada-pinkett-smith-e3c94b9cce15423b8280609bce700e41.jpg", "https://www.brides.com/thmb/_bhZJ9Xdbo8KRLIUxo2rmhC5atk=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-663907914-c98e38fdb4694807a6de77c646ee0999.jpg", "https://www.brides.com/thmb/IXLlC2dm5miz8CZD04QZUX3IVCg=/900x900/filters:no_upscale():max_bytes(150000):strip_icc()/ScreenShot2021-12-01at2.29.56AM-adbacd4f9e744502b88d9dd628f035cd.png"], "top_img": "https://www.brides.com/thmb/vqEXdG6FtjpX4Jt7IskO7b3ybbk=/1024x693/filters:fill(auto,1)/GettyImages-1169491940-58c564809e4143f2962beff47ecedc12.jpg", "keywords": [], "authors": ["Maggie Kreienberg", "Maggie Kreienberg Is An Editor At", "Brides'S Editorial Guidelines"], "canonical_link": "https://www.brides.com/katy-perry-orlando-bloom-relationship-timeline-4798731", "title": "Katy Perry and Orlando Bloom's Relationship Timeline", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "From the proposal to the pregnancy announcement and beyond, here is everything you need to know about Katy Perry and Orlando Bloom's relationship.", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "BRIDES", "sailthru.author": "Maggie Kreienberg", "sailthru.tags": "news,celebrity-and-royal-weddings", "article": {"section": "Brides"}, "fb": {"app_id": 785196361567992}, "og": {"type": "article", "site_name": "Brides", "url": "https://www.brides.com/katy-perry-orlando-bloom-relationship-timeline-4798731", "title": "Katy Perry and Orlando Bloom's Relationship Timeline", "description": "From the proposal to the pregnancy announcement and beyond, here is everything you need to know about Katy Perry and Orlando Bloom's relationship.", "image": "https://www.brides.com/thmb/vqEXdG6FtjpX4Jt7IskO7b3ybbk=/1024x693/filters:fill(auto,1)/GettyImages-1169491940-58c564809e4143f2962beff47ecedc12.jpg"}, "twitter": {"card": "summary", "site": "@Brides", "title": "Katy Perry and Orlando Bloom's Relationship Timeline", "description": "From the proposal to the pregnancy announcement and beyond, here is everything you need to know about Katy Perry and Orlando Bloom's relationship.", "image": "https://www.brides.com/thmb/vqEXdG6FtjpX4Jt7IskO7b3ybbk=/1024x693/filters:fill(auto,1)/GettyImages-1169491940-58c564809e4143f2962beff47ecedc12.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.230.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.230.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.230.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.230.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.230.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://www.brides.com", "summary": ""}