{"url": "https://www.cnn.com/2017/12/21/us/venus-williams-fatal-accident-no-charges/index.html", "text": "Story highlights Police: Video showed Williams didn't violate other driver's right of way \"No charges will be filed in this case,\" police say\n\nCNN —\n\nNo charges will be filed against tennis star Venus Williams and a second driver over a car crash that left one dead in June, Florida authorities said Wednesday.\n\nThe accident, in which the other driver’s Hyundai Accent crashed into Williams’ Toyota Sequoia, left Jerome Barson dead. It injured his wife, Linda, who was driving when the crash happened at an intersection in Palm Beach Gardens.\n\nAn investigation supported by video surveillance showed Williams did not violate the other driver’s right of way, the Palm Beach Gardens Police said in an investigative report obtained by CNN affiliate WPBF.\n\nTennis star Venus Williams has reached a settlement in the wrongful death suit centered around a fatal car accident, according to court documents.\n\nSurveillance video\n\nPalm Beach Gardens Police obtained surveillance video of the June 9 collision from the perspective of a guard gate of a residential community near the intersection.\n\nOn the basis of the video, police said in a statement shortly after the crash that, “the vehicle driven by Venus Williams lawfully entered the intersection on a circular green traffic signal, and attempted to travel north through the intersection.”\n\nWilliams came to a stop as she traveled north through the intersection “to avoid a collision” when a car going west made a left turn in front of her, according to authorities.\n\nShe then continued north, in accordance with state law, before another car collided with her vehicle, police said.\n\nNegligence lawsuit\n\nTwo weeks after the crash, Jerome Barson died in a hospital. His family filed a wrongful death lawsuit against Williams, citing negligence.\n\nThe lawsuit stated that Barson’s injuries included “severed main arteries, massive internal bleeding, a fractured spine, and massive internal organ damage.”\n\nEarlier this year, Williams’ attorneys filed a protective order, saying they got less than 24 hours’ notice that the Barson family’s counsel was going to download vehicle data from the tennis star’s SUV, CNN affiliate WPEC-TV in West Palm Beach reported.\n\nA judge granted an emergency motion in July that allowed Williams’ SUV to be searched. Both parties were given a chance to download and inspect crash data from the two vehicles involved.\n\nThe tennis star, 37, broke down in tears at Wimbledon in July when reporters questioned her about the wreck.\n\n“There are really no words to describe, like, how devastating and – yeah. I’m completely speechless,” Williams said.", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/170703165649-venus-williams-tease-1.jpg?q=x_4,y_182,h_1974,w_3508,c_crop/w_800", "https://media.cnn.com/api/v1/images/stellar/prod/150511065206-karimi-faith.jpg?q=x_0,y_3,h_1437,w_2554,c_crop/h_270,w_480/c_thumb,g_face,w_100,h_100"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/170703165649-venus-williams-tease-1.jpg?q=x_4,y_182,h_1974,w_3508,c_crop/w_800", "keywords": [], "authors": ["Faith Karimi"], "canonical_link": "https://www.cnn.com/2017/12/21/us/venus-williams-fatal-accident-no-charges/index.html", "title": "Venus Williams, other driver cleared in fatal crash", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Venus Williams, 2nd driver won't be charged in fatal crash, police say | CNN", "description": "No charges will be filed against tennis star Venus Williams and a second driver over a car crash that left one dead in June, Florida authorities said Wednesday.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/170703165649-venus-williams-tease-1.jpg?q=x_4,y_182,h_1974,w_3508,c_crop/w_800", "type": "article", "url": "https://www.cnn.com/2017/12/21/us/venus-williams-fatal-accident-no-charges/index.html", "site_name": "CNN"}, "twitter": {"title": "Venus Williams, 2nd driver won't be charged in fatal crash, police say | CNN", "description": "No charges will be filed against tennis star Venus Williams and a second driver over a car crash that left one dead in June, Florida authorities said Wednesday.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/170703165649-venus-williams-tease-1.jpg?q=x_4,y_182,h_1974,w_3508,c_crop/w_800", "card": "summary_large_image", "site": "@CNN"}, "description": "No charges will be filed against tennis star Venus Williams and a second driver over a car crash that left one dead in June, Florida authorities said Wednesday.", "template_type": "article_leaf", "type": "article", "meta-section": "us", "theme": "us", "article": {"published_time": "2017-12-21T09:27:07Z", "modified_time": "2017-12-21T13:06:11Z", "tag": "accidental fatalities, accidents, accidents, disasters and safety, beaches, business and industry sectors, business, economy and trade, deaths and fatalities, destinations and attractions, florida, north america, palm beach, roads and traffic, society, southeastern united states, sports and recreation, sports figures, technology, tennis, traffic accidents, traffic signals, transportation and warehousing, transportation infrastructure, transportation technology, united states, venus williams, investigations", "publisher": "https://www.facebook.com/CNN"}, "keywords": "accidental fatalities, accidents, accidents, disasters and safety, beaches, business and industry sectors, business, economy and trade, deaths and fatalities, destinations and attractions, florida, north america, palm beach, roads and traffic, society, southeastern united states, sports and recreation, sports figures, technology, tennis, traffic accidents, traffic signals, transportation and warehousing, transportation infrastructure, transportation technology, united states, venus williams, investigations", "author": "Faith Karimi", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1513814400.0, "source": "https://www.cnn.com", "summary": ""}