{"url": "https://en.wikipedia.org/wiki/Jessie_James_Decker", "text": "American country pop singer (born 1988)\n\nFor people with similar names, see Jessica James\n\nMusical artist\n\nJessica Rose James Decker (born April 12, 1988) is an American country pop singer-songwriter, former reality television personality, and entrepreneur. At age 15, after auditioning for and being rejected by most of the country labels in Nashville, Tennessee, Decker began working with Carla Wallace of Big Yellow Dog Music. One of her songs attracted the attention of Mercury Records, which offered her a recording contract. She released her debut album, Jessie James, in 2009. A few years later in 2013, she starred with her husband Eric Decker, a wide receiver in the National Football League, in the E! reality show Eric & Jessie: Game On.\n\nOn April 18, 2014, Decker released an EP through iTunes entitled Comin' Home.[2] On Epic in 2017, she released a five-track EP, Gold, followed by a collaboration on Austin John Winkler's 2016 song titled \"Howlin'\" from his debut EP Love Sick Radio and released a surprise live EP on June 9, 2017, titled Blackbird Sessions. On October 13, 2017, she released her second full-length album and first for Epic Records, Southern Girl City Lights.[3] On This Holiday, her first full-length Christmas album, was released on October 26, 2018.[4]\n\nOn September 30, 2019, Decker stated, \"I have a new chapter that's about to happen with my music...I have new music coming out soon. I'm working on an EP that’ll be dropping soon.\"[5]\n\nOn September 18, 2020, Decker gave ET an update after signing a new record deal with Atlantic/Warner music in January. She revealed that while she was supposed to go on tour with new music this summer, it got postponed due to the pandemic. She says \"I will be putting out a Christmas single, so I will have a Christmas song out in November, but as far as my album I've been working on and recording, we actually decided today we're going to hold off. We're going to wait for the top of the year so we can do it right, 'cause I'm really excited about it.\"[6]\n\nOn October 22, 2021 she released the EP The Woman I've Become The project spawned a headlining tour, which wrapped last month after hitting major cities across the nation. [7] On September 30, 2022 “Grow Young With You” is the first official track from the Big Yellow Dog/Atlantic Records/Warner Music Nashville recording artist since the release of her The Woman I’ve Become EP in 2021.[8]\n\nEarly life [ edit ]\n\nDecker was born Jessica Rose James on April 12, 1988, in Vicenza, in the Italian region of Veneto on an American military base[1][9] to her mother, Karen Johnson and father Robert James. Her stepfather, Steve Parker, who Karen married in the early 2000s, served in the U.S. Air Force.[10] As a result, she lived in Iowa, Kentucky, Texas, Louisiana, and Georgia. She graduated from Warner Robins High School in 2007.[11] Decker has two younger siblings, Sydney Rae Bass (born 1991) and John James (born 1994), two step siblings, Ashley and Alex Parker (from Steve's first marriage) and two siblings-in-law, Anthony Bass and Alison James (formerly Green).\n\nDecker began singing when she was two. She won her first talent contest in Baker, Louisiana, at age nine, singing \"I Want to Be a Cowboy's Sweetheart\". By then, she had already been writing songs on a plastic guitar and had performed at SeaWorld and in Warner Robins, Georgia in 2000. At age fifteen, she made weekly trips to Nashville to hone her songwriting skills.\n\nCareer [ edit ]\n\nMusic [ edit ]\n\nAt seventeen, Decker was introduced to Carla Wallace of independent label Big Yellow Dog Music, who helped her with her songwriting and singing. One of her songs, \"Gypsy Girl\", was written with two writers from Yellow Dog and made it into the hands of record executive David Massey, who brought her to the attention of L.A. Reid. She auditioned for Reid by singing her song \"My Cowboy\", produced by John Rich. Decker soon signed a contract with Mercury Records.[12]\n\nEven though she originally thought that she would be producing a country record, Decker was later told to record a pop album by record executives.[13] She also claimed to have been asked to sound like pop singer Britney Spears.[14] She described the recording process as \"intense\" due to the genre crossing.[13] She described herself in an interview as \"a country girl at heart,\" having grown up listening to this music.[15]\n\nHer debut album, Jessie James, was released in August 2009, debuting at number 23 on the Billboard 200. It was a fusion between country and pop music, with more emphasis placed on the latter as dictated by her label. The album also featured writing credits from Decker and seasoned pop songwriter Kara DioGuardi and Mitch Allan, among others.[15] The album received mixed receptions from critics. Allmusic received the album positively, but found that despite being marketed as such and featuring some country-influenced production, the music on the album was a far cry from country music.[16] Slant thought that the album only superficially pulled together influences from pop, country and hip-hop while failing to pander to any of those audiences.[17] The album's first single, \"Wanted\", produced by Allan, had been released in April and peaked at number 40 on the Billboard Hot 100.\n\nDecker later performed in the Middle East with singer Kid Rock and comedian Carlos Mencia for US troops stationed overseas.[9]\n\nDecker began working on her second album, Sweet American Dreams,[18] in 2010, which was initially planned to be released in late summer.[19] The album was to have the same country-pop sound as her debut, with Decker being given more leeway by Mercury in incorporating country sounds.[15] The first single, \"Boys in the Summer\", released in June, was a minor country success but failed to chart on the Billboard Hot 100. Having struggled with accepting her career path as a pop singer, Decker told her label in the midst of preparations for her album that she did not want to be a pop artist and wanted to record country music.[14] After negotiations, Massey asked Mark Wright from Show Dog-Universal Music, which had facilitated the country release of \"Boys in the Summer\" in November, to help Mercury/IDJ launch Decker in the country genre.[20] Decker began recording in April 2011.[18] \"When You Say My Name\" was produced by Wright and released on January 31, 2012. \"Military Man\" was released on May 22, 2012. She was removed from the Show Dog Universal roster in 2013.[21] Decker released an extended play, Comin' Home, on April 18, 2014, which hit number one on iTunes top albums chart and debuted in the top 5 on Billboard's top country albums chart.[2]\n\nDecker was featured on former Hinder lead singer Austin John's debut solo EP Love Sick Radio, on the track \"Howlin'\". The EP was released April 22, 2016.[22]\n\nShe finished the Lights Down Low tour. On her new label Epic she released a five-track EP, Gold, on February 17, 2017, and released a surprise live EP on June 9, 2017, titled Blackbird Sessions. On October 13, 2017, she released her second full-length album and first for Epic Records, Southern Girl City Lights.\n\nOn November 27, 2017, Decker appeared in \"12 Days of Cracker Barrel\", ending on December 8.[23] Each day got a new YouTube video in the style of the original 12 Days of Christmas song.\n\nOn April 3, 2022, Decker performed \"America the Beautiful\", in front of a nearly 80.000 crowd at WWE's WrestleMania 38, at AT&T Stadium, in Dallas, Texas.[24]\n\nReality television [ edit ]\n\nIn 2013, Decker starred with her husband Eric Decker, a wide receiver in the National Football League, in the E! reality show Eric & Jessie: Game On. It ended its run in April 2014, but returned in September 2017.[25][26] It ran for 20 episodes in three seasons.[27]\n\nOn September 8, 2022, Decker was announced as a contestant on season 31 of Dancing with the Stars. She is partnered with Alan Bersten.[28]\n\nKittenish [ edit ]\n\nDecker launched a clothing line called Kittenish online.[29] Kittenish opened its first physical location in Nashville, Tennessee.[30] A second branch is located near Destin, Florida.[31]\n\nMusical style and influences [ edit ]\n\nDecker co-wrote the majority of the songs on her debut album.[32] The album is of a country-pop fusion genre, revealing her taste for not only country music, but pop and soul music as well.[32]\n\nThe beat for \"Blue Jeans\" was a recording of Decker stepping; this talent stems from her time on the step team at her school.[33] Initially, she faced opposition for her soul music-inspired vocal runs when trying to get signed in Nashville.[32]\n\nShe has listed Christina Aguilera, Jessica Simpson, Bobbie Gentry, Janis Joplin, Shelby Lynne, and Shania Twain as her musical influences.[32][34] She has said that she initially wanted a career similar to those of Gentry and Twain, who were signed to pop labels but found crossover success in both country and pop music.[32]\n\nPersonal life [ edit ]\n\nOn June 22, 2013, Jessie married Eric Decker, an NFL wide receiver who at the time played for the Denver Broncos.[35][36][37]\n\nIn September 2013, it was announced that the couple was expecting their first child together.[38][39] She gave birth to their daughter, Vivianne Rose, in March 2014 in Colorado.[40] Decker gave birth to their second child, Eric Thomas II, in September 2015.[41] Decker announced on October 9, 2017, that they were expecting a third child, another boy.[42] She gave birth to their third child, Forrest Bradley, in March 2018.[43]\n\nDiscography [ edit ]\n\nStudio albums [ edit ]\n\nExtended plays [ edit ]\n\nSingles [ edit ]\n\nNotes:\n\nHoliday singles [ edit ]\n\nMusic videos [ edit ]\n\nOther appearances [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Jessie_James_at_the_Tour_for_the_Troops_concert_in_Incirlik_Air_Base_01_%28cropped%29.JPG/220px-Jessie_James_at_the_Tour_for_the_Troops_concert_in_Incirlik_Air_Base_01_%28cropped%29.JPG", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/4/41/Jessie_James_at_the_Tour_for_the_Troops_concert_in_Incirlik_Air_Base_01_%28cropped%29.JPG", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/4/41/Jessie_James_at_the_Tour_for_the_Troops_concert_in_Incirlik_Air_Base_01_%28cropped%29.JPG", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jessie_James_Decker", "title": "Jessie James Decker", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Jessie_James_at_the_Tour_for_the_Troops_concert_in_Incirlik_Air_Base_01_%28cropped%29.JPG/640px-Jessie_James_at_the_Tour_for_the_Troops_concert_in_Incirlik_Air_Base_01_%28cropped%29.JPG", "width": 640, "height": 869}, "title": "Jessie James Decker - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}