{"url": "https://www.hollywoodreporter.com/live-feed/younger-boss-darren-star-liza-charles-josh-kelsey-kisses-future-1028455", "text": "Younger officially graduated from a love triangle to a love square on Wednesday’s double whammy of an episode.\n\nIn a game of relationship musical chairs, the TV Land series finally pushed forward the long-gestating relationship between Liza (Sutton Foster) and her boss Charles (Peter Hermann), as well as the percolating romance between Liza’s ex Josh (Nico Tortorella) and best friend Kelsey (Hilary Duff).\n\nAfter Charles confessed his feelings to Liza the episode prior, his employee — who is posing as a twentysomething but is actually age-appropriate for forty-something Charles — acted on her uncontrollable sex fantasy and lunged, lips first, towards him. Their intended office romp, however, was interrupted by a janitor and never continued due to the unexpected arrival of a new client: Charles’ ex-wife, played by Jennifer Westfeldt. Liza also stopped short of finally confessing the truth about her age.\n\n“Some of the biggest debates we have in the writers room are about where Liza’s heart lies and what she really wants,” Younger creator Darren Star tells The Hollywood Reporter of Liza ping-ponging between Charles and Josh. “Liza is, in a lot of ways, inauthentic. She discovers a lot of her inner-authenticity in a way by being inauthentic in her roles and relationships. Some of her strongest relationships, like between her and Charles, are built on a shaky foundation. We talk about: How complicit is she in telling this emotional lie? And when and how does it end?”\n\nVeteran show writer Alison Brown, who spoke to THR about the groundbreaking portrayal of Lauren (Molly Bernard) after last week’s episode, said the “touchy” office relationship between Liza and Charles is more difficult for the writers to hash out behind the scenes than blazing a trail with the sexually fluid character. (Last week delivered Younger with its most-watched episode to date.)\n\n“The Liza and Charles relationship is the discussion we are constantly having in the writers room,” she tells THR. “How far do you take this relationship of a boss and a co-worker? That is something we have long conversations about, as opposed to conversations about how to portray Lauren’s sexuality. We have a pretty queer room, we’re very aware.”\n\nFoster had previously summed up the problem as being very simple: “Liza loves two men,” the actress told THR earlier in the season. “There’s a part of her that will always love Josh. And he will always love Liza, so there’s this thing. But the Charles of it all just hasn’t been explored yet, and that’s why I say I’m Team Charles. I want them to have their moment.”\n\nHermann was also jonesing for Liza and Charles to come together and for Charles to find out Liza’s big secret, despite the likely consequences. “It would be a really beautiful aspect to see this age barrier fall between them, but it also would make him have to re-edit everything,” the actor told THR. “That means interactions or moments together where you thought the other person was being their honest self. That’s something to process.”\n\nWednesday night brought their moment, which seemed dead in the water until the end of the episode when Charles called Liza to say that he has no regrets. But even if they decide to take things further, the massive lie of Liza’s true age, and double life, will still be hanging between them.\n\n“This season, we really take things very much to edge,” says Star. “That is why at the end of the first season Liza had to let Josh know the truth about her age, and that’s why she had to tell Kelsey. There’s a level of emotional involvement with people where you don’t want to continue lying to them.”\n\nWith Charles still in the dark, Star classifies their relationship as being “muddy,” and says the arrival of Westfeldt — who is signed on for a guest arc — throws a “monkey wrench” between them and proves to be a real complication. That fact, coupled with Liza’s rise at Empirical Press, makes Charles finding out the truth in the near future seem unlikely.\n\n“It’s important that she has her job,” Star says of the threat of Liza losing the publishing gig if Charles were to find out. “Right now, Liza is very intent on having a job, somewhere. That’s her intent in doing this from the start. Younger is a show about work and people whose work defines them and is really important.”\n\nThe other big development from Wednesday was the long-hinted-at coming together of Josh and Kelsey. During a weekend getaway, the flirty roommates acted on their feelings with a kiss, but Kelsey stopped it there and told Josh it wasn’t right. The moment seemed open-ended, but Star says the mature scene shuts the Josh and Kelsey chapter.\n\n“I thought they resolved something with a lot of integrity,” says Star. “I do feel like it’s a resolution to the story we’ve been telling this season in a small way.”\n\nHow to handle the Josh and Kelsey betrayal was another hot discussion topic for the show’s writers.\n\n“That is something that what we talked a lot about: Would they have sex, could they have sex and what would happen if they did? We decided pretty firmly that it wasn’t something we wanted our characters who we love to do and we felt like that was something they wouldn’t do. It felt off-limits,” says Star.\n\nHe wouldn’t comment on whether Liza will ultimately find out — despite her being otherwise occupied with her brewing Charles relationship — but he says the side romance has come to an end.\n\n“I think it does close the book for now,” he says of Josh and Kelsey and any feelings they might have for each other. “They acknowledge it, it’s on the table. But I think the door is definitely closed for now in a way that preserves the characters. They made a decision based on a level of integrity that they both have.”", "images": ["https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/younger_cast_and_inset_of_darren_star.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/younger_cast_and_inset_of_darren_star.jpg?w=1296&h=730&crop=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/posttruth7_-_h_2017.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/younger_ep407_mp_8752_r-_embed_2017.jpg?w=928", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/younger_cast_and_inset_of_darren_star.jpg?w=1024", "keywords": [], "authors": ["Jackie Strause"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/younger-boss-darren-star-liza-charles-josh-kelsey-kisses-future-1028455/", "title": "‘Younger’ Boss Provides Clarity on Two Open-Ended Character Romances", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "'Younger' creator Darren Star shuts the door on one of the two TV Land series' couples who finally kissed on Wednesday's episode.", "news_keywords": "Darren Star, Younger", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Jackie Strause", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1028455, "title": "'Younger' Boss Provides Clarity on Two Open-Ended Character Romances", "published_at": "2017-08-10 11:21:53", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/younger_cast_and_inset_of_darren_star.jpg?w=1024", "comment_count": 0, "tags": "Younger", "topics": "TV News", "body": "Younger officially graduated from a love triangle to a love square on Wednesday's double whammy of an episode.\r\nIn a game of relationship musical chairs, the TV Land series finally pushed forward the long-gestating relationship between Liza (Sutton Foster) and her boss Charles (Peter Hermann), as well as the percolating romance between Liza's ex Josh (Nico Tortorella) and best friend Kelsey (Hilary Duff). \r\nAfter Charles confessed his feelings to Liza the episode prior, his employee — who is posing as a twentysomething but is actually age-appropriate for forty-something Charles — acted on her uncontrollable sex fantasy and lunged, lips first, towards him. Their intended office romp, however, was interrupted by a janitor and never continued due to the unexpected arrival of a new client: Charles' ex-wife, played by Jennifer Westfeldt. Liza also stopped short of finally confessing the truth about her age.\r\n\"Some of the biggest debates we have in the writers room are about where Liza’s heart lies and what she really wants,\" Younger creator Darren Star tells The Hollywood Reporter of Liza ping-ponging between Charles and Josh. \"Liza is, in a lot of ways, inauthentic. She discovers a lot of her inner-authenticity in a way by being inauthentic in her roles and relationships. Some of her strongest relationships, like between her and Charles, are built on a shaky foundation. We talk about: How complicit is she in telling this emotional lie? And when and how does it end?\"\r\nVeteran show writer Alison Brown, who spoke to THR about the groundbreaking portrayal of Lauren (Molly Bernard) after last week's episode, said the \"touchy\" office relationship between Liza and Charles is more difficult for the writers to hash out behind the scenes than blazing a trail with the sexually fluid character. (Last week delivered Younger with its most-watched episode to date.)\r\n\"The Liza and Charles relationship is the discussion we are constantly having in the writers room,\" she tells THR. \"How far do you take this relationship of a boss and a co-worker? That is something we have long conversations about, as opposed to conversations about how to portray Lauren’s sexuality. We have a pretty queer room, we’re very aware.\"\r\n\r\nFoster had previously summed up the problem as being very simple: \"Liza loves two men,\" the actress told THR earlier in the season. \"There’s a part of her that will always love Josh. And he will always love Liza, so there’s this thing. But the Charles of it all just hasn’t been explored yet, and that’s why I say I’m Team Charles. I want them to have their moment.\"\r\nHermann was also jonesing for Liza and Charles to come together and for Charles to find out Liza's big secret, despite the likely consequences. \"It would be a really beautiful aspect to see this age barrier fall between them, but it also would make him have to re-edit everything,\" the actor told THR. \"That means interactions or moments together where you thought the other person was being their honest self. That's something to process.\"\r\n\r\nWednesday night brought their moment, which seemed dead in the water until the end of the episode when Charles called Liza to say that he has no regrets. But even if they decide to take things further, the massive lie of Liza's true age, and double life, will still be hanging between them.\r\n\"This season, we really take things very much to edge,\" says Star. \"That is why at the end of the first season Liza had to let Josh know the truth about her age, and that's why she had to tell Kelsey. There’s a level of emotional involvement with people where you don’t want to continue lying to them.\"\r\nWith Charles still in the dark, Star classifies their relationship as being \"muddy,\" and says the arrival of Westfeldt — who is signed on for a guest arc — throws a \"monkey wrench\" between them and proves to be a real complication. That fact, coupled with Liza's rise at Empirical Press, makes Charles finding out the truth in the near future seem unlikely.\r\n\"It’s important that she has her job,\" Star says of the threat of Liza losing the publishing gig if Charles were to find out. \"Right now, Liza is very intent on having a job, somewhere. That’s her intent in doing this from the start. Younger is a show about work and people whose work defines them and is really important.\"\r\n\r\nThe other big development from Wednesday was the long-hinted-at coming together of Josh and Kelsey. During a weekend getaway, the flirty roommates acted on their feelings with a kiss, but Kelsey stopped it there and told Josh it wasn't right. The moment seemed open-ended, but Star says the mature scene shuts the Josh and Kelsey chapter.\r\n\"I thought they resolved something with a lot of integrity,\" says Star. \"I do feel like it’s a resolution to the story we’ve been telling this season in a small way.\"\r\nHow to handle the Josh and Kelsey betrayal was another hot discussion topic for the show's writers.\r\n\"That is something that what we talked a lot about: Would they have sex, could they have sex and what would happen if they did? We decided pretty firmly that it wasn’t something we wanted our characters who we love to do and we felt like that was something they wouldn’t do. It felt off-limits,\" says Star.\r\nHe wouldn't comment on whether Liza will ultimately find out — despite her being otherwise occupied with her brewing Charles relationship — but he says the side romance has come to an end.\r\n\"I think it does close the book for now,\" he says of Josh and Kelsey and any feelings they might have for each other. \"They acknowledge it, it’s on the table. But I think the door is definitely closed for now in a way that preserves the characters. They made a decision based on a level of integrity that they both have.\"", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Younger’ Boss Provides Clarity on Two Open-Ended Character Romances", "url": "https://www.hollywoodreporter.com/tv/tv-news/younger-boss-darren-star-liza-charles-josh-kelsey-kisses-future-1028455/", "description": "‘Younger’ creator Darren Star shuts the door on one of the two TV Land series’ couples who finally kissed on Wednesday’s episode.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/younger_cast_and_inset_of_darren_star.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-08-10T11:21:53+00:00", "modified_time": "2017-08-10T17:46:12+00:00"}, "twitter": {"site": "@thr", "creator": "@jackiedstrause", "card": "summary_large_image", "title": "‘Younger’ Boss Provides Clarity on Two Open-Ended Character Romances", "description": "‘Younger’ creator Darren Star shuts the door on one of the two TV Land series’ couples who finally kissed on Wednesday’s episode.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/younger_cast_and_inset_of_darren_star.jpg?w=1296"}}, "movies": [], "publish_date": 1502364113.0, "source": "https://www.hollywoodreporter.com", "summary": ""}