{"url": "https://www.chicagotribune.com/entertainment/chicagoinc/ct-ent-george-clooney-iraqi-refugee-hazim-avdal-20180212-story.html", "text": "David Letterman, left, chats with George Clooney's dad, Nick, and University of Chicago student Hazim Avdal, right, for an episode of “My Next Guest Needs No Introduction\" that premiered Friday on Netflix. (Joe Pugliese / Netflix)\n\nUniversity of Chicago computer science student Hazim Avdal was too busy with schoolwork to watch his interview with David Letterman when it premiered Friday morning. Avdal sat down with the veteran talk show host to explain how he left Iraq after the Islamic State targeted his hometown and received support from George and Amal Clooney to continue his studies in Chicago.\n\nAvdal’s appearance on the new Netflix series “My Next Guest Needs No Introduction” was part of a wide-ranging interview Letterman conducted with George Clooney about his career, his marriage to Amal, their 8-month-old twins and their sponsorship of Avdal, who moved to Chicago in September.\n\nAdvertisement\n\n“I’m hoping that through this Letterman show that (my classmates and friends) will be more aware of the things that happened back in Iraq,” Avdal told the Tribune.\n\nAvdal, 23, grew up as part of the Yazidi religious minority in the Sinjar region of northern Iraq. He graduated high school in 2013 and was accepted to the University of Mosul but was unable to begin his studies because al-Qaeda violence against Yazidis made Mosul unsafe. In 2014, the Islamic State, or ISIS, began the Yazidi genocide.\n\nAdvertisement\n\nThousands of Yazidis were massacred or kidnapped. Women were turned into sex slaves, while children were separated from their families and forced to convert to Islam.\n\nAvdal told the Tribune he was working about six hours from his hometown when the attacks began. He said his family escaped just minutes before ISIS arrived. They went to a refugee camp in Turkey. His mother now lives in Germany, while other relatives are still in Iraq. Avdal’s father died when he was a young boy.\n\nAvdal ended up working in Iraq for Yazda, an organization devoted to supporting the Yazidi community in the aftermath of the genocide. A self-taught programmer, Avdal designed and programmed database management software that helped the organization manage its clients — hundreds of Yazidi women rescued from sexual enslavement.\n\nIt is through this organization that Avdal connected with Amal Clooney, an international human-rights lawyer who represents Nadia Murad, a Yazidi woman who survived enslavement. Avdal said he met Clooney at a ceremony for Murad when she was appointed a goodwill ambassador for the United Nations in September 2016.\n\n“I’ve had the privilege of representing a number of Yazidis who have been the victims of genocide perpetrated by ISIS over the last couple of years; that’s how I met Hazim,” Amal Clooney told Letterman on his show. “And when I met him, I remember being so struck by his courage but also just this amazing spirit and how he spoke about, even after everything he lost, he spoke about a desire for justice, not revenge.”\n\nAvdal also met Matthew Barber, a University of Chicago doctoral student focused on Islamic thought and Syrian and Iraqi history. Barber, the former executive director for Yazda in Iraq, talked up the University of Chicago to Avdal while they worked together for a year. Barber, meanwhile, worked behind the scenes with George Clooney to try to get Avdal into the school.\n\nYazidi refugee Hazim Avdal, left, is pictured on the day in May 2017 he found out he was admitted to the University of Chicago. (Courtesy of Matthew Barber / Handout)\n\n“I was really impressed with his character and his work ethic when I was there, but also his intelligence,” Barber told the Tribune. “Iraq has a standardized high school examination that’s given to all graduating seniors from high school. … The year that Hazim graduated from high school, he was the seventh-highest-scoring student in the whole country of Iraq.”\n\nAvdal found out he was accepted to the University of Chicago in May 2017 during a visit to the admissions office. Barber said Avdal buried his face in his hands and couldn’t speak for several minutes.\n\nAdvertisement\n\nBarber and one of George Clooney’s cousins helped move Avdal into his dorm in September before he began classes. During breaks and holidays, Avdal stays at Clooney’s home near the Oscar winner’s parents in their hometown of Augusta, Ky. Avdal gave Letterman a tour of the home for his show.\n\nAvdal has mixed feelings about appearing on Letterman’s show since it will affect his anonymity. In an interview with The Hollywood Reporter published in September, George Clooney mentioned he and Amal took in a Yazidi refugee who was attending the University of Chicago, but Avdal was not named.\n\n“I want people to know about what’s happening in other parts of the world, particularly in my experience, what happened in my part of the world,” Avdal told the Tribune. “On the other hand, I also want to live my life as a student here at the University of Chicago, just quiet and have my own privacy. So it’s like a trade-off. I will have to find a way to make a balance after (Letterman’s) show comes out.”\n\nAvdal is too busy with his studies to think about potential fame. He plans to graduate with the class of 2021 and do “something meaningful” that would make a difference in Iraq. Barber said thousands of Yazidis whose homes and villages were destroyed by ISIS are still waiting for reconstruction support, while survivors of the genocide and enslavement are trying to put their lives back together.\n\nAvdal is also still settling into his new life in Chicago.\n\n“It’s a big city. I’m a small-town boy. This kind of environment is kind of new to me. The weather is crazy cold. Where I grew up it was warmer and more quiet,” Avdal said. “It was a little bit hard at the beginning, but now I love it.”\n\nAdvertisement\n\ntswartz@tribpub.com\n\nTwitter @tracyswartz\n\n[ Documentary that follows Syrian family resettling in Chicago to air on WTTW ]\n\n[ Chelsea Handler headlining Chicago fundraiser for Syrian refugee programs ]\n\n[ John Stamos kept a piece of Chicago history from his 'ER' days ]", "images": ["https://www.chicagotribune.com/resizer/IvIagkJf56Z8-iFvOTaTUUnUe6Y=/1440x1080/filters:format(jpg):quality(70):focal(1457x672:1467x682)/cloudfront-us-east-1.images.arcpublishing.com/tronc/UTEETDP45DUM5NCCHSFEMXIFD4.jpg", "https://www.chicagotribune.com/pf/resources/icons/Menu_Icon.svg?d=87", "https://www.chicagotribune.com/resizer/UZE9ZYcEzd6PsbW7ataPU1DO8kk=/1440x1080/filters:format(jpg):quality(70):focal(982x199:992x209)/cloudfront-us-east-1.images.arcpublishing.com/tronc/BY5MS6J3UZHBHGHASPMTEGHR54.jpg", "https://www.chicagotribune.com/resizer/Erb_9htpzxjmzlMd904j8w3wufA=/1440x0/filters:format(jpg):quality(70)/www.trbimg.com/img-5a80ff0e/turbine/ct-1518403339-4udvd0733t-snap-image", "https://www.chicagotribune.com/resizer/3XuaKiyTDpJuCZlUp0ObJad90Ic=/1440x1080/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/tronc/Y3DHA3LZBFDHVCJKGOPHOMYV6Q.jpg", "https://www.chicagotribune.com/resizer/mCZ13k0JYp2rh8nhkZAlDCvCrDo=/1200x630/filters:format(jpg):quality(70)/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/BJMOQ46MSBDS3G72GX65WAWV3Q.jpg", "https://www.chicagotribune.com/resizer/Jm67auWxXOK7RdS5f0oNLMXpq_A=/800x0/filters:format(jpg):quality(70)/www.trbimg.com/img-5a80b7e4/turbine/ct-1518385118-2dvs0wzqk8-snap-image", "https://static.themebuilder.aws.arc.pub/tronc/1657752787005.svg"], "top_img": "https://www.chicagotribune.com/resizer/mCZ13k0JYp2rh8nhkZAlDCvCrDo=/1200x630/filters:format(jpg):quality(70)/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/BJMOQ46MSBDS3G72GX65WAWV3Q.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.chicagotribune.com/entertainment/ct-ent-george-clooney-iraqi-refugee-hazim-avdal-20180212-story.html", "title": "George and Amal Clooney sponsor an Iraqi refugee attending U. of C.", "meta_data": {"language": "English (United States), en-US", "viewport": "width=device-width, initial-scale=1", "content-id": "MO3HHS6HH5AOPLMDZ7JLGV4VCY", "apple-itunes-app": "app-id=383137151, app-argument=http://www.chicagotribune.com/deeplinkidMO3HHS6HH5AOPLMDZ7JLGV4VCY", "description": "George and Amal Clooney are sponsoring University of Chicago computer science student Hazim Avdal, who left Iraq after ISIS targeted his hometown.", "twitter": {"description": "George and Amal Clooney are sponsoring University of Chicago computer science student Hazim Avdal, who left Iraq after ISIS targeted his hometown.", "title": "George and Amal Clooney sponsor an Iraqi refugee attending U. of C.", "image": "https://www.chicagotribune.com/resizer/mCZ13k0JYp2rh8nhkZAlDCvCrDo=/1200x630/filters:format(jpg):quality(70)/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/BJMOQ46MSBDS3G72GX65WAWV3Q.jpg", "site": "@chicagotribune", "card": "summary_large_image"}, "og": {"description": "George and Amal Clooney are sponsoring University of Chicago computer science student Hazim Avdal, who left Iraq after ISIS targeted his hometown.", "title": "George and Amal Clooney sponsor an Iraqi refugee attending U. of C.", "image": "https://www.chicagotribune.com/resizer/mCZ13k0JYp2rh8nhkZAlDCvCrDo=/1200x630/filters:format(jpg):quality(70)/arc-anglerfish-arc2-prod-tronc.s3.amazonaws.com/public/BJMOQ46MSBDS3G72GX65WAWV3Q.jpg", "type": "article", "site_name": "Chicago Tribune", "url": "https://www.chicagotribune.com/entertainment/ct-ent-george-clooney-iraqi-refugee-hazim-avdal-20180212-story.html", "locale": "en_US"}, "keywords": "George Clooney,Amal Clooney,Hazim Avdal,David Letterman,University of Chicago", "robots": "noarchive", "distribution": "global", "rating": "general", "googlebot-news": "index", "copyright": "Copyright © 2022, Chicago Tribune", "fb": {"page_id": "5953023255,104061989632161,330360537007411,264870045299,73734231949,53310156364,40762490776,60569705796,121922684499844,182379588445160,62915602634,1987930441432108,119608021389933,745745225518281", "pages": "https://www.facebook.com/chicagotribune", "app_id": 306836229411287, "admins": 100000786395051}, "fb_title": "George and Amal Clooney sponsor an Iraqi refugee attending U. of C.", "y_key": "cee2fe4077f8d050", "msvalidate.01": "AAC9C18F70AC386BC4DCF4DDF9BF1786", "article": {"publisher": "Chicago Tribune", "tag": "Islamic State", "content_tier": "locked"}, "google": "nositelinkssearchbox"}, "movies": [], "publish_date": 1518393600.0, "source": "https://www.chicagotribune.com", "summary": ""}