{"url": "https://en.wikipedia.org/wiki/Glenn_Quinn", "text": "Irish actor\n\nGlenn Martin Christopher Francis Quinn (28 May 1970 – 3 December 2002) was an Irish actor, best known for his portrayal of Mark Healy on the 1990s family sitcom Roseanne and his role as the half-demon Allen Francis Doyle on Angel, a spin-off series of Buffy the Vampire Slayer.\n\nEarly life [ edit ]\n\nGlenn Martin Christopher Francis Quinn was born in Dublin on 28 May 1970, the son of Bernadette Quinn (née Brady) and Murty Quinn. His father was a musician and singer with the Miami Showband, who had seven No. 1 hits in the 1960s and 1970s.[1] He was raised in the Cabinteely suburb of Dublin, and attended Clonkeen College.[2][3] In 1988, at the age of 18 he moved to the United States along with his mother and two sisters, Sonja and Louisa, who settled in Los Angeles.[3] He also had a third sibling whom he never met, his brother, Ciaran, who had been put up for adoption as a baby. Quinn did not know of his existence prior to his death.[4]\n\nCareer [ edit ]\n\nIn 1990, Quinn did television commercials for Pepsi and Ray-Ban, appeared in the music video for the Richard Marx song \"Satisfied\", and had his first speaking line in the pilot of Beverly Hills, 90210 after having endured eight separate auditions for the roles of Brandon Walsh and Steve Sanders[4] (played by Jason Priestley and Ian Ziering, respectively). Casting director Johanna Ray gave him a small role with two speaking lines in the pilot, however Quinn was barely visible in the final broadcast version.\n\nIn 1991, Quinn had his first major film role in the musical film Shout, starring John Travolta and Heather Graham, sharing an on-screen kiss with Gwyneth Paltrow in her debut film.[5]\n\nIn 1990, Quinn was cast as the recurring character Mark Healy, Becky Conner's boyfriend and later husband, in Roseanne in its third season and remained a series regular through its ninth and final season in 1997. In 1992, while still on Roseanne, Quinn also took a main role on the US and UK TV series Covington Cross and in the same year, co-starred with Holly Marie Combs in the slasher film, Dr. Giggles.[6] In 1997, he played dual roles in the horror anthology Campfire Tales.\n\nIn 1999, after seven years of using an American accent on Roseanne, Quinn was pleased when producers cast him in the role of Allen Francis Doyle on the Buffy the Vampire Slayer spin-off series, Angel. Although the character was not written as Irish, he was allowed to use his native Irish accent at the suggestion of series creator, Joss Whedon.[2][6] In an interview with The Irish Times, he said of his accent, \"I've been hiding it for so long that it's amazing to have some freedom. It was like putting on an old pair of shoes. It's bringing my soul back to life.\"[2] Whedon stated that the character was supposed to die early in the first season, but the character became a fan favorite. Whedon informed Quinn and promised him a \"hero's exit\".[7]\n\nHis last film was the dark comedy, R.S.V.P. (2002).\n\nPersonal life [ edit ]\n\nQuinn struggled with substance abuse throughout his life, starting when he was a teenager in Ireland in 1987. Unable to maintain sobriety, he was eventually bought out as the owner of Goldfingers nightclub in Los Angeles in 1997.[2][4][8][9] He returned to Ireland in 1997 to be with his family, who supported him in achieving short periods of sobriety and spent time in a drug and alcohol rehabilitation center. He would later return to Los Angeles to resume his acting career.[10]\n\nDeath [ edit ]\n\nOn 3 December 2002, at the age of 32, Quinn was found dead at a friend's home in North Hollywood, California, where he had been staying for a few months.[11] An autopsy found that he had died from an accidental drug overdose earlier that day.[12]\n\nDuring production of the tenth season of Roseanne, which aired in 2018, it was decided that Quinn's role of Mark Healy would not be recast, and his role was written off the show as having died years ago. It introduced, however, a new Mark Healy, the son of Darlene Conner and David Healy. The series paid tribute to Quinn at the end of one of its episodes, \"Eggs Over, Not Easy.\"[13][14]\n\nIn 2019, during Entertainment Weekly's 20th-anniversary reunion of the cast of Angel, actor David Boreanaz stated that \"Glenn played a great character, but also became a really close friend of mine. God rest his soul.\"[15]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nFilm appearances by Glenn Quinn Year Title Role Notes 1991 Shout Alan 1992 Dr. Giggles Max Anderson 1995 Live Nude Girls Randy Conzini 1997 Campfire Tales Scott Anderson / Paramedic #1 Segments: \"The Locket\" and \"The Campfire\" 1998 Some Girl Jeff 2002 R.S.V.P. Professor Hal Evans\n\nTelevision [ edit ]\n\nVideo games [ edit ]\n\nVideo game credits for Glenn Quinn Year Title Role Notes 1996 Star Wars: X-Wing vs. TIE Fighter Voice 1997 Outlaws \"Rattlesnake\" Dick Farmer Voice Pirate #5 Voice", "images": ["https://upload.wikimedia.org/wikipedia/en/4/45/Glenn_Quinn.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/45/Glenn_Quinn.jpg/220px-Glenn_Quinn.jpg", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/69/P_vip.svg/28px-P_vip.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/4/45/Glenn_Quinn.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Glenn_Quinn", "title": "Glenn Quinn", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/4/45/Glenn_Quinn.jpg", "width": 640, "height": 829}, "title": "Glenn Quinn - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}