{"url": "https://www.usmagazine.com/entertainment/news/bruce-jenner-interview-with-diane-sawyer-read-us-weeklys-live-blog-2015244/", "text": "Bruce Jenner speaks! The former Olympian finally opened up about his transition from male to female in a highly anticipated interview with ABC News' Diane Sawyer. The two-hour special edition of 20/20, titled Bruce Jenner: The Interview, saw the Keeping Up With the Kardashians star speak out for the first time about his transgender identity.\n\nThe motivational speaker, 65, did not hold back, revealing five minutes in to the special, \"I am a woman.\n\nUs Weekly live-blogged the full two hours, which aired Friday, April 24, and, as insiders told Us in the new issue of the magazine, was the first step the father of 10 took \"to reintroduce himself to society as a woman.\" Read the highlights below.\n\n9:00 p.m.: \"We've observed there's a kind of generational divide\" as to how you recognize Jenner's name, Sawyer says — is he the Olympic hero or the Keeping Up With the Kardashians star?\n\n9:01 p.m.: Sawyer and her crew head to Jenner's house in Malibu to talk to Jenner one-on-one. This is the first time the two have met.\n\n9:02 p.m.: Sawyer asks, \"Are you ready?\" Jenner responds, tearing up, \"Diane, Let's do it. It's going to be tough. I've been thinking about this day forever and what I should do with my life. How do I tell my story? How do I tell people what I've been through, and that day is today. I need the tissues — it's gonna be kinda tough but today's the day.\"\n\n9:03 p.m.: \"I would say I've always been confused with my gender identity since I've been this big,\" Jenner admits.\n\n9:04 p.m.: Jenner talks about how he feels he was created. \"Let's give him the soul of a female and see how he deals with that. … I'm not stuck in anybody's body. I'm just who I am as a human being.\"\n\n9:05 p.m.: Bruce lets his hair down. \"Are you a woman,\" Sawyer asks? \"Yes, for all intents and purposes, I am a woman,\" he responds.\n\n9:08 p.m.: After a package reliving Jenner's Olympic victory, Sawyer asks \"Who is that?\" Responds Jenner, \"That is me. That's her.\"\n\n9:09 p.m.: Sawyer asks if Jenner and his family are angling for some publicity for his E! show. \"Oh, we would never do that, Diane,\" he exclaims.\n\n9:10 p.m.: \"I am going to change the world,\" Jenner declares. \"My whole life has been getting me ready for this. It's not just been the past few years as they've been treating me as a joke.\"\n\n9:11 p.m.: This is the last interview Jenner will do as Bruce, Sawyer declares before the first commercial break.\n\n9:15 p.m.: Sawyer and Jenner have traveled back to his hometown of Tarrytown, NY for the first time in nearly 50 years, and he tells the interviewer about how as a young boy, he secretly wore dresses.\n\n9:17 p.m.: \"[I was a] very lonely little boy. I'm still a lonely big boy. I don't socialize a lot,\" Jenner tells Sawyer. \"I've never fit in. When you deal with this issue you don't fit in.\"\n\n9:19 p.m.: Jenner tells Sawyer that he has always been attracted to women. \"I never was attracted to the guys … sexuality was totally different than what my issues were.\"\n\n9:20 p.m.: Sawyer brings up Jenner's first marriage, to Chrystie Crownover, which lasted from 1972 to 1981.\n\n9:24 p.m.: Jenner watches old footage of his Olympic Games, which he's watched so many times he knows the announcer's words by heart — and it still brings him joy.\n\n9:25 p.m.: Jenner's ex-wife Chrystie was the first to know. \"I had bigger issues than just cross-dressing,\" he admits. Chrystie took the news well, and was supportive. They did not separate because of his gender issues, but because he felt \"restless in the marriage,\" Sawyer says.\n\n9:28 p.m.: \"I'm not gay,\" he says. \"I am, as far as I know, heterosexual. I've never been with a guy.\"\n\n9:29 p.m.: Sawyer puts it bluntly: \"Are you a lesbian?\" \"You're going back to the sex thing and it's apples and oranges,\" Jenner says, and clarifies: \"There’s two different things here. Sexuality is who you personally are attracted to — who turns you on — male or female. But gender identity has to do with who you are as a person and your soul, and who you identify with inside, okay?\"\n\n9:30 p.m.: Unlike with Crownover, Jenner's breakup with Thompson had a lot to do with his gender issues, he admits, and acknowledges that he wasn't exactly fair to the women whom he married. He's apologized to them many times since. \"I've apologized for my entire life.\"\n\n9:31 p.m.: Following his second divorce in the '80s, Jenner saw doctors and began taking hormones to begin transitioning. He got plastic surgery, and electrolysis to remove his beard and chest hair.\n\n9:32 p.m.: Jenner's sister says this was the point in time when her brother finally told her about his identity issues. She cried the whole way home that night. \"I thought it was just a passing phase,\" she admits. Maybe he got some counseling and is over it. But now she knows, \"You don't get over this.\"\n\n9:34 p.m.: Sawyer tells the audience that although pronoun usage is an important point in the transgender community, Jenner requests that people continue to use \"he\" and \"him\" to describe him for the time being.\n\n9:43 p.m.: Despite transitioning for five years, Jenner stopped the process. He continued his motivational speaking, but felt like a fraud.\n\n9:44 p.m.: Jenner says that over the years, he has been out in public as a woman — and was hit on by men.\n\n9:48 p.m.: The Kris Jenner era begins — and it turns out that the KUWTK matriarch has known about Jenner's secret all along, because he told her about the hormones he'd been taking. He also told her about cross-dressing, but downplayed the significance.\n\n9:50 p.m.: Sawyer discusses the Kardashian empire, and how Jenner was the punching bag of the family. \"I loved Kris. I had a wonderful life with her. I learned a lot,\" he says. \"I thought we had a pretty good sex life, later on as I heard, maybe we didn't. … But I thought it was pretty good.\"\n\n9:52 p.m.: As for Keeping Up With the Kardashians, Jenner says, \"The entire run, I kept thinking to myself, 'Oh my God, this whole thing, the one real, true story in the family was the one I was hiding and nobody knew about it.' The one thing that could make a difference in people's lives was right here in my soul and I could not tell that story.\"\n\n9:53 p.m.: \"It was tough on her,\" Jenner admits of Kris Jenner. \"Kris is a good woman. I've got no complaints with her. She's a good person.\" Still, if Kris had been more understanding, Jenner says he thinks they'd still be together.\n\n9:55 p.m.: After cameras swarmed Jenner following a recent surgery, Jenner says the thought of ending it all crossed his mind — but quickly passed. \"I want to see how this story ends,\" he tells Sawyer.\n\n9:56 p.m.: ABC asked all three of Jenner's ex-wives for comments, and while Kris Jenner had no comment, Thompson said she hopes people \"exercise kindness\" and Crownover, now Scott, said, \"I support him…and pray for his happiness.\"\n\n10:01 p.m.: Jenner gushes to Sawyer about his 10 children, and tells Sawyer that confessing to them was the hardest part of his journey. \"Those are the only ones in my life I can't let myself hurt them,\" he admits while tears well up in his eyes. \"How do I do this and not hurt my children? I try to explain to them that 'As much of your upbringing was the her as well as the he side. … I'm not going anywhere.'\"\n\n10:02 p.m.: The first Jenner child to know was 33-year-old Brandon, who says he had noticed signs throughout the years. \"I feel like I'm getting an upgraded version of my dad, of a parent,\" Brandon says. \"Obviously there's parts of it that aren't necessarily easy. I'm not handling this perfectly.\"\n\n10:04 p.m.: Jenner's four oldest children contact Sawyer later and say they want to sit down and talk to her in support of their father.\n\n10:05 p.m.: The kids tell Sawyer Jenner says they can ask him anything. Daughter Casey Jenner says her father has told her, \"It's not that I want to dress like a woman, it's that I've spent my whole life dressing up as a man.\"\n\n10:14 p.m.: After Kim Kardashian caught Bruce in a dress, she was the first Kardashian sister to know.\n\n10:16 p.m.: Jenner finally gathered his six younger kids and told them his plans. Their reactions were mixed — especially Khloe's. You'd think she would be the most open-minded, Jenner says, but she has had the toughest time with it because she's had so many losses in her life. Kourtney's only concern is her kids, Jenner says, but he's noticed kids have been the most adaptable.\n\n10:18 p.m.: Still, none of the Kardashians had seen \"her.\" \"With all of the girls, it's tough on them,\" Jenner says. But Kim said she had a breakthrough thanks to husband Kanye West. \"I'm nothing if I can't be me,\" he told her. Jenner says, \"Since then, Kimberly has been by far the most accepting and the easiest to talk to.\"\n\n10:20 p.m.: Sawyer says the ABC News team reached out to the girls, and Kendall and Kylie responded with a statement. \"We love our dad very much,\" they said. \"He has the biggest heart, and all we want is for him to be happy. If he's happy, we're happy.\"\n\n10:28 p.m.: \"I am not a spokesman for the community,\" Jenner says, but there's a lot to talk about — murder, suicide, hate crimes, job discrimination, and many more horrifying statistics.\n\n10:30 p.m.: Jenner gives credit to President Obama for being the first president to say the word \"transgender,\" but admits he is actually a Republican. He is not worried about the Conservative reaction to his coming out.\n\n10:31 p.m.: Jenner discusses his religion. \"I had this feeling, kind of a revelation, that maybe this is my cause in life. This is why God put me on this Earth, do deal with this issue. That was a very powerful moment. It certainly gave me a lot of courage.\"\n\n10:40 p.m.: Jenner says he has not decided whether he will get sexual reassignment surgery, and even if he does, \"I would do it so quietly nobody in the world would ever know,\" he says. The cameras and filming everything — \"To me, it's very degrading. … As far as the term SRS, sexual reassignment surgery, it would be down the line.\"\n\n10:43 p.m.: As for a future marriage, Jenner hasn't thought about finding love again. \"I want to enjoy my life as who I am. It's that simple.\"\n\n10:44 p.m.: \"If this is my only problem I have in life, I've got it made,\" Jenner tells Sawyer. \"If it's only this, I'll be okay. I've got my health, I've got my children, I've got family, I've got seven grandkids now. I'm actually really excited about the future and what I can do.\"\n\n10:45 p.m.: Jenner invites Sawyer to dinner so she can meet \"her\" privately, and takes Sawyer to his closet to show her the dress he planned to wear that night.\n\n10:52 p.m.: Jenner sits down with Sawyer and his sister, and confesses that he has simple goals: \"To be able to have my nail polish on long enough that it actually chips off!\"\n\n10:55 p.m.: Right now, Jenner says, he's not necessarily saying goodbye to his past. \"I'm saying goodbye to people's perception of me,\" he says.\n\n10:59 p.m.: Wrapping things up, Sawyer shares that Jenner has invited her back to interview him in a year and see where it all ends up.", "images": ["https://www.usmagazine.com/wp-content/uploads/backup/1429968979_bruce-jenner-abc-interview_2.jpg?w=1200&h=675&crop=1&quality=86&strip=all", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/bg-subscribe.png", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered-green.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/placeholders/default-usweekly.svg", "https://www.usmagazine.com/wp-content/uploads/backup/1429968979_bruce-jenner-abc-interview_4.jpg?w=300&h=178&crop=1&quality=86&strip=all", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/shop-with-us-new.png", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/placeholders/default-usweekly-square.svg", "https://www.usmagazine.com/wp-content/themes/us-weekly/assets/img/svg-icons/logo-tag-registered.svg"], "top_img": "https://www.usmagazine.com/wp-content/uploads/backup/1429968979_bruce-jenner-abc-interview_4.jpg?w=300&h=178&crop=1&quality=86&strip=all", "keywords": [], "authors": ["Us Weekly Staff", "Jean Bentley"], "canonical_link": "https://www.usmagazine.com/entertainment/news/bruce-jenner-interview-with-diane-sawyer-read-us-weeklys-live-blog-2015244/", "title": "Bruce Jenner Tells Diane Sawyer \"I Am a Woman\": Full Interview Blog", "meta_data": {"viewport": "width=device-width, initial-scale=1", "ir-site-verification-token": "-206090124", "fo-verify": "49e6fc6a-c68d-447f-9978-70e3eac455ac", "post-format": "article", "post-cats": "Entertainment", "theme-color": "#fff", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Us Weekly live blogged Bruce Jenner's revealing interview with Diane Sawyer about being transgender -- get all the details from the ABC News special", "og": {"locale": "en_US", "type": "article", "title": "Bruce Jenner Interview With Diane Sawyer: Read the Complete Live Blog", "description": "Us Weekly live blogged Bruce Jenner's revealing interview with Diane Sawyer about being transgender -- get all the details from the ABC News special", "url": "https://www.usmagazine.com/entertainment/news/bruce-jenner-interview-with-diane-sawyer-read-us-weeklys-live-blog-2015244/", "site_name": "Us Weekly", "updated_time": "2017-12-07T03:36:43+00:00", "image": {"identifier": "https://www.usmagazine.com/wp-content/uploads/backup/1429968979_bruce-jenner-abc-interview_4.jpg?w=300&h=178&crop=1&quality=86&strip=all", "secure_url": "https://www.usmagazine.com/wp-content/uploads/backup/1429968979_bruce-jenner-abc-interview_4.jpg?w=300&h=178&crop=1&quality=86&strip=all", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/UsWeekly", "published_time": "2015-04-25T00:05:00+00:00", "modified_time": "2017-12-07T03:36:43+00:00"}, "author": "Us Weekly Staff", "twitter": {"card": "summary_large_image", "title": "Bruce Jenner Interview With Diane Sawyer: Read the Complete Live Blog", "description": "Us Weekly live blogged Bruce Jenner's revealing interview with Diane Sawyer about being transgender -- get all the details from the ABC News special", "image": "https://www.usmagazine.com/wp-content/uploads/backup/1429968979_bruce-jenner-abc-interview_4.jpg?w=300&h=178&crop=1&quality=86&strip=all", "creator": "@usweekly", "site": "@usweekly"}, "spons": "no", "tragedy": "off", "generator": "WordPress 6.0.2", "msapplication-TileImage": "https://www.usmagazine.com/wp-content/uploads/2020/05/cropped-us-logo.png?w=270&quality=86&strip=all"}, "movies": [], "publish_date": 1429920300.0, "source": "https://www.usmagazine.com", "summary": ""}