{"url": "https://popculture.com/tv-shows/2017/06/13/girls-next-door-where-are-they-now-2017/", "text": "The E! reality show Girls Next Door has been off the air for almost eight years, and it's time to catch up with the cast and see what the former Playboy models' lives look like nowadays. While the stars of the series - Holly Madison, Kendra Wilkinson-Baskett, and Bridget Marquardt - all were all very close living under the same roof for a time, the three of them now live totally different lives. First up, Holly Madison. The 37-year-old former head girlfriend of Hugh Hefner now lives in Las Vegas with her husband Pasquale Rotella, who is a tour promoter. They share two children together, 4-year-old daughter Rainbow Aurora and their 9-month old son Forest Leonardo. Madison went on to compete on Dancing With The Stars after The Girls Next Door ended. She had her own reality show called Holly's World and also starred in a Las Vegas burlesque show Peep Shoe. When Madison isn't on TV, she has been busy penning three memoirs about her life before and after living in the Playboy Mansion, according to E! News. Madison's latest book, which was released in 2016, is titled The Vegas Diaries: Romance, Rolling the Dice and the Road to Reinvention. The New York Times bestselling author blasted her former co-star Kendra Wilkinson in her books and also slammed Hugh Hefner. Hogwarts workout clothes might make me attempt cardio A post shared by Holly Madison (@hollymadison) on Jun 3, 2017 at 2:41pm PDT\n\nKendra Wilkinson-Baskett The 32-year-old reality star is now married to Hank Baskett, and the pair has two children together, 7-year-old Hank Jr. and 2-year-old daughter Alijah. Kendra Wilkinson-Baskett went on to have two of her own reality shows called Kendra and Kendra on Top. She also made appearances on Marriage Boot Camp Reality Stars. Other shows that Kendra has been featured on are Dancing With the Stars and switched places with Kate Gosselin and Celebrity Wife Swap. Currently, Kendra is starring in a Las Vegas play called Sex Tips For Straight Women From A Gay Man. She recently spoke out about how thankful she was to be a part of the production. \"Just when I think it's over for me in this world, new opportunities present themselves,\" Kendra said. \"I'm still here and it's getting bigger and I'm so thankful for these opportunities and to be able to explore life like this.\" She continued by saying: \"I'm birthing something new. It's a fresh new chapter in my life and I have no idea where it's taking me. I am so excited for this opportunity.\" On the opening night of the play, Kendra Wilkinson opened up about whether she would have more children. Judging by her response, Hank Jr. and Alijah won't be getting another sibling. \"Absolutely not. The next baby I will be having is a shot of patron and that will be tonight celebrating opening night of Sex Tips.\" Get sex tips from me & @OfficialJaiRodriguez this week @ParisVegas! For tickets call 1-888-746-7784 or click the link in our bio.? #SexTipsVegas A post shared by Kendra Wilkinson Baskett (@kendra_wilkinson_baskett) on Jun 12, 2017 at 10:00am PDT prevnext", "images": ["https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200"], "top_img": "https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200", "keywords": [], "authors": [], "canonical_link": "https://popculture.com/tv-shows/news/girls-next-door-where-are-they-now-2017/", "title": "'Girls Next Door' - Where Are They Now?", "meta_data": {"description": "The E! reality show Girls Next Door has been off the air for almost eight years, and it's time to [...]", "keywords": "Trending,Hugh Hefner,Playboy", "news_keywords": "Trending,Hugh Hefner,Playboy", "robots": "index, follow, max-image-preview:large", "twitter": {"card": "summary_large_image", "site": "@PopCulture", "creator": "@PopCulture", "title": "'Girls Next Door' - Where Are They Now?", "description": "The E! reality show Girls Next Door has been off the air for almost eight years, and it's time to [...]", "image": "https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200"}, "og": {"title": "'Girls Next Door' - Where Are They Now?", "type": "article", "url": "https://popculture.com/tv-shows/news/girls-next-door-where-are-they-now-2017/", "image": {"identifier": "https://sportshub.cbsistatic.com/i/2021/03/27/14024377-87b5-44da-926d-abcee03cd657/default-1.png?width=1200", "width": 640, "height": 320}, "site_name": "TV", "description": "The E! reality show Girls Next Door has been off the air for almost eight years, and it's time to [...]"}, "fb": {"app_id": 398373180287205, "pages": 1075190092524035}, "google-site-verification": "iPoSsgn-BS2aFT9iphBFS8eF6I23H2Le3DRVOCodjJg", "p": {"domain_verify": "c711bf7a7a8040f2b74003958afd81d4"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1,user-scalable=0", "theme-color": "#263240", "apple-mobile-web-app-capable": "yes"}, "movies": [], "publish_date": 1497308400.0, "source": "https://popculture.com", "summary": ""}