{"url": "http://fortune.com/2017/12/05/chipotle-queso-recipe-change/", "text": "Barely three months after introducing its poorly-received queso, Chipotle Mexican Grill (CMG) is already tweaking its recipe.\n\nThe restaurant chain is struggling to get back on track after two difficult years in the wake of several safety crises and a hack. Chipotle launched the queso in September in the hopes of ending its losing streak, but instead earned poor reviews on social media. The queso was so maligned that one Wall Street firm, RBC Capital Markets, said the product was weighing down on Chipotle’s overall reputation.\n\n“When we rolled out the queso nationwide, we noted that we may tweak the recipe a bit, and we have done that,” company spokesman Chris Arnold said in an emailed statement. “The new recipe still uses only real ingredients with nothing artificial, but has a creamier texture and a great, spicy flavor.”\n\nIn its initial iteration, the queso had an unusual texture because of, ironically, its lack of artificial ingredients. Other establishments add ingredients like stabilizers that are meant to firm up their quesos. Chipotle told Fortune last summer that by adding only two ingredients—corn starch and tapioca starch—to its previous total of 51 that it uses in its food, it was able to avoid two common problems with queso: separation and the formation of a skin. The company had tested the spicy cheese sauce in hundreds of stores in Colorado and Southern California and hoped customers would use it as a dip for chips or added to a burrito.\n\nNonetheless, the product disappointed customers who’d been asking Chipotle for queso for two decades. Chipotle answered, but is now having to make adjustments.\n\nThe brand could use a home run right about now. Last week, CEO and founder Steve Ells said he would step down from the corner office once a replacement was found, conceding that Chipotle may need some new blood.", "images": ["https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1242585998-e1665028070836.jpg?w=256&q=75", "https://content.fortune.com/wp-content/uploads/2017/10/rtx3guvg.jpg?resize=1200,600", "https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1243767517-e1665076497696.jpg?w=256&q=75", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://content.fortune.com/wp-content/uploads/2022/10/GettyImages-1243581035-e1665068106964.jpg?w=256&q=75"], "top_img": "https://content.fortune.com/wp-content/uploads/2017/10/rtx3guvg.jpg?resize=1200,600", "keywords": [], "authors": [], "canonical_link": "https://fortune.com/2017/12/05/chipotle-queso-recipe-change/", "title": "Chipotle Is Changing Its Queso Recipe", "meta_data": {"viewport": "width=device-width", "msapplication-TileColor": "#ffc40d", "theme-color": "#ffffff", "description": "After the original version flopped with customers, Chipotle is changing its queso recipe.", "keywords": "chipotle mexican grill, queso, chipotle queso review, chipotle queso dip, queso at chipotle, is chipotle queso good, chipotle has queso, chipotle, chipotle queso recipe", "og": {"url": "https://fortune.com/2017/12/05/chipotle-queso-recipe-change/", "type": "article", "title": "Chipotle Is Changing Its Queso Recipe", "description": "The product is less liquid-y now.", "site_name": "Fortune", "image": "https://content.fortune.com/wp-content/uploads/2017/10/rtx3guvg.jpg?resize=1200,600", "width": 1024, "height": 683}, "twitter": {"card": "summary_large_image", "title": "Chipotle Is Changing Its Queso Recipe", "description": "The product is less liquid-y now.", "image": "https://content.fortune.com/wp-content/uploads/2017/10/rtx3guvg.jpg?resize=1200,600", "url": "https://fortune.com/2017/12/05/chipotle-queso-recipe-change/"}, "next-head-count": 32}, "movies": [], "publish_date": 1512432000.0, "source": "http://fortune.com", "summary": ""}