{"url": "https://variety.com/2018/film/news/golden-globes-sexual-harassment-protest-black-dresses-1202654958/", "text": "Activists have often turned to fashion to heighten moments of protest. In the wake of President Donald Trump’s inauguration last January, women flooded Washington wearing pink pussycat hats to march on the Capitol. In September, celebrities made a political statement at the 2017 Emmys by wearing blue ACLU ribbons after Trump announced his plans to end DACA.\n\nBut perhaps this year’s Golden Globes could thread Hollywood’s largest display of solidarity as some of the biggest names in show business pledge to don black at the 75th annual event.\n\nWith the influx of sexual misconduct allegations in entertainment — and other industries — since the Harvey Weinstein scandal broke in October, stars of the big and small screen are planning to wear all black to the Beverly Hilton in Los Angeles this Sunday in support of those who have spoken out about sexual harassment and to protest gender inequality.\n\nAlong with the dark ensembles, participants will reportedly be accessorizing with pins created by Time’s Up — the coalition behind the statement.\n\nMichael Buckner/Variety/REX/Shutterstock\n\nShonda Rhimes, Reese Witherspoon, and 300 other prominent women in the entertainment industry are behind the Time’s Up initiative aimed at eradicating abuse, harassment, marginalization and underrepresentation in the work place.\n\nThe alliance almost decided to boycott the Golden Globe Awards entirely, Kerry Washington told the LA Times. But the group eventually decided against it, suggesting that it was important to support their peers who were nominated.\n\nInstead, an agreement was made to wear all black, with the hopes that this unified stand would prompt a larger discussion from the red carpet, leveraging the access to millions of viewers tuned in to watch the awards show, both on camera and online, with the hashtag #WhyWeWearBlack.\n\n“Wearing black is an opportunity to talk about all the other things that we’re doing,” Washington explained to the Times. “We’re saying that we are three-dimensional, fully realized human beings as women. We are participants in this entertainment industry, and we have something to say.”\n\nDespite the all-black attire creating a seemingly similar aesthetic, Cristina Ehrlich, whose clients include Julia Louis-Dreyfus, Greta Gerwig, Laura Dern, Alison Brie, Allison Williams, and Tina Fey, said her clients will still be telling a unique story through fashion.\n\n“People aren’t using words anymore like, ‘I want to look sexy.’ It’s more about, ‘I want to look like I’m a woman of power. I want to look like a woman who is standing my ground,'” Ehrlich told Variety earlier this week.\n\nSeveral women have even requested to wear female designers, she added.\n\n“Because [the Globes] is international and it’s the Hollywood Foreign Press, you really want these women to have a moment that is going to strike as many different audiences as you can,” she said.\n\nStylist Ilaria Urbanati, who works with Dwayne Johnson, Tom Hiddleston, and Armie Hammer, posted about the protest on Instagram in December and confirmed her male clients will be wearing black in unity with women.\n\n“Safe to say this may not be the right time to choose to be the odd man out here,” she wrote.\n\nTo the critics who argued that #WhyWeWearBlack wouldn’t be an effective demonstration, actress Rashida Jones says they’re missing the point entirely.\n\n“This is not a silent protest,” the actress told InStyle. “We wear black to stand in solidarity with our sisters and to say time’s up on this imbalance of power and the abuses that come with it, regardless of what industry you work in. It’s time for every workplace to look more like our world, where women have equal representation.” Online, fellow actors Ashley Judd and Tessa Thompson tweeted their support of Jones’ statements.\n\nViewers will get to see that online solidarity in action on the red carpet Sunday night.", "images": ["https://variety.com/wp-content/themes/pmc-variety-2020/assets/public/lazyload-fallback.gif", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://www.facebook.com/tr?id=315552255725686&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.facebook.com/tr?id=586935388485447&ev=PageView&noscript=1", "https://variety.com/wp-content/uploads/2018/01/triptico_1515370413962.jpg?w=681&h=383&crop=1", "https://variety.com/wp-content/uploads/2018/01/triptico_1515370413962.jpg?w=1024", "https://px.ads.linkedin.com/collect/?pid=1429113&fmt=gif"], "top_img": "https://variety.com/wp-content/uploads/2018/01/triptico_1515370413962.jpg?w=1024", "keywords": [], "authors": ["Rebecca Rubin"], "canonical_link": "https://variety.com/2018/film/news/golden-globes-sexual-harassment-protest-black-dresses-1202654958/", "title": "Why Stars Are Wearing All Black to the Golden Globes", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://variety.com/wp-content/themes/pmc-variety-2020/assets/app/browserconfig.xml", "msapplication-TileImage": "https://variety.com/wp-content/uploads/2018/06/variety-favicon.png?w=128", "msapplication-TileColor": "#eff4ff", "description": "Men and women in Hollywood have planned to silently protest sexual harassment with black dresses on the Golden Globes red carpet.", "alexaVerifyID": "4IBqfMBcohHTnitnTLanYijElhs", "fb": {"admins": 697514199, "pages": 12616252196}, "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "variety", "pmc-page_type": "article", "articleid": 1202654958, "author": "Rebecca Rubin", "pmc-category": "News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-01-06T10:17:51"}, "pmc-tag": "Golden Globes,Time's Up", "title": "Why Stars Are Wearing All Black to the Golden Globes", "pageclass": "article", "pmc-vertical": "film,tv", "pmc-branded-content": "no", "pmc-evergreen": "no", "pmc-primary-category": "News", "pmc-primary-vertical": "film", "pmc-is_vyvip_article": "no"}, "apple-itunes-app": "app-id=416179538", "generator": "WordPress 6.0.2", "author": "Rebecca Rubin", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Variety", "application-name": "Variety", "ia": {"markup_url_dev": "https://variety.com/2018/film/news/golden-globes-sexual-harassment-protest-black-dresses-1202654958/?ia_markup=1"}, "content_type": "Article", "post_id": 1202654958, "title": "Why Stars Are Wearing All Black to the Golden Globes", "published_at": "2018-01-06 10:17:51", "image": "https://variety.com/wp-content/uploads/2018/01/triptico_1515370413962.jpg?w=1024", "comment_count": 19, "tags": "Time's Up", "topics": "News", "appeared_in_print": "No", "body": "Activists have often turned to fashion to heighten moments of protest. In the wake of President Donald Trump's inauguration last January, women flooded Washington wearing pink pussycat hats to march on the Capitol. In September, celebrities made a political statement at the 2017 Emmys by wearing blue ACLU ribbons after Trump announced his plans to end DACA.\r\n\r\nBut perhaps this year's Golden Globes could thread Hollywood's largest display of solidarity as some of the biggest names in show business pledge to don black at the 75th annual event.\r\n\r\nWith the influx of sexual misconduct allegations in entertainment -- and other industries --  since the Harvey Weinstein scandal broke in October, stars of the big and small screen are planning to wear all black to the Beverly Hilton in Los Angeles this Sunday in support of those who have spoken out about sexual harassment and to protest gender inequality.\r\n\r\nAlong with the dark ensembles, participants will reportedly be accessorizing with pins created by Time's Up -- the coalition behind the statement.\r\n\r\n\r\n\r\nShonda Rhimes, Reese Witherspoon, and 300 other prominent women in the entertainment industry are behind the Time's Up initiative aimed at eradicating abuse, harassment, marginalization and underrepresentation in the work place.\r\n\r\nThe alliance almost decided to boycott the Golden Globe Awards entirely, Kerry Washington told the LA Times. But the group eventually decided against it, suggesting that it was important to support their peers who were nominated.\r\n\r\nInstead, an agreement was made to wear all black, with the hopes that this unified stand would prompt a larger discussion from the red carpet, leveraging the access to millions of viewers tuned in to watch the awards show, both on camera and online, with the hashtag #WhyWeWearBlack.\r\n\r\n\"Wearing black is an opportunity to talk about all the other things that we're doing,\" Washington explained to the Times. \"We're saying that we are three-dimensional, fully realized human beings as women. We are participants in this entertainment industry, and we have something to say.\"\r\n\r\nDespite the all-black attire creating a seemingly similar aesthetic, Cristina Ehrlich, whose clients include Julia Louis-Dreyfus, Greta Gerwig, Laura Dern, Alison Brie, Allison Williams, and Tina Fey, said her clients will still be telling a unique story through fashion.\r\n\r\n\"People aren't using words anymore like, 'I want to look sexy.' It's more about, 'I want to look like I'm a woman of power. I want to look like a woman who is standing my ground,'\" Ehrlich told Variety earlier this week.\r\n\r\nSeveral women have even requested to wear female designers, she added.\r\n\r\n\"Because [the Globes] is international and it's the Hollywood Foreign Press, you really want these women to have a moment that is going to strike as many different audiences as you can,\" she said.\r\n\r\nStylist Ilaria Urbanati, who works with Dwayne Johnson, Tom Hiddleston, and Armie Hammer, posted about the protest on Instagram in December and confirmed her male clients will be wearing black in unity with women.\r\n\r\n\"Safe to say this may not be the right time to choose to be the odd man out here,\" she wrote.\r\n\r\nTo the critics who argued that #WhyWeWearBlack wouldn't be an effective demonstration, actress Rashida Jones says they're missing the point entirely.\r\n\r\n\"This is not a silent protest,\" the actress told InStyle. \"We wear black to stand in solidarity with our sisters and to say time's up on this imbalance of power and the abuses that come with it, regardless of what industry you work in. It's time for every workplace to look more like our world, where women have equal representation.\" Online, fellow actors Ashley Judd and Tessa Thompson tweeted their support of Jones' statements.\r\n\r\nViewers will get to see that online solidarity in action on the red carpet Sunday night.", "fragment": "!", "og": {"type": "article", "title": "Why Stars Are Wearing All Black to the Golden Globes", "url": "https://variety.com/2018/film/news/golden-globes-sexual-harassment-protest-black-dresses-1202654958/", "description": "Activists have often turned to fashion to heighten moments of protest. In the wake of President Donald Trump’s inauguration last January, women flooded Washington wearing pink pussycat hats t…", "site_name": "Variety", "image": {"identifier": "https://variety.com/wp-content/uploads/2018/01/triptico_1515370413962.jpg?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2018-01-06T18:17:51+00:00", "modified_time": "2018-03-01T23:51:09+00:00"}, "twitter": {"site": "@variety", "creator": "@rebeccaarubin", "card": "summary_large_image", "title": "Why Stars Are Wearing All Black to the Golden Globes", "description": "Men and women in Hollywood have planned to silently protest sexual harassment with black dresses on the Golden Globes red carpet.", "image": "https://variety.com/wp-content/uploads/2018/01/triptico_1515370413962.jpg?w=1024"}}, "movies": [], "publish_date": 1515262671.0, "source": "https://variety.com", "summary": ""}