{"url": "https://www.cnn.com/2018/05/24/entertainment/morgan-freeman-accusations/index.html", "text": "CNN —\n\nA young production assistant thought she had landed the job of her dreams when, in the summer of 2015, she started work on “Going In Style,” a bank heist comedy starring Morgan Freeman, Michael Caine and Alan Arkin.\n\nBut the job quickly devolved into several months of harassment, she told CNN. She alleges that Freeman subjected her to unwanted touching and comments about her figure and clothing on a near-daily basis. Freeman would rest his hand on her lower back or rub her lower back, she said.\n\nIn one incident, she said, Freeman “kept trying to lift up my skirt and asking if I was wearing underwear.” He never successfully lifted her skirt, she said – he would touch it and try to lift it, she would move away, and then he’d try again. Eventually, she said, “Alan [Arkin] made a comment telling him to stop. Morgan got freaked out and didn’t know what to say.”\n\nFreeman’s alleged inappropriate behavior was not limited to that one movie set, according to other sources who spoke to CNN. A woman who was a senior member of the production staff of the movie “Now You See Me” in 2012 told CNN that Freeman sexually harassed her and her female assistant on numerous occasions by making comments about their bodies.\n\n“He did comment on our bodies… We knew that if he was coming by … not to wear any top that would show our breasts, not to wear anything that would show our bottoms, meaning not wearing clothes that [were] fitted,” she said.\n\nAt 80 years old, Freeman is one of Hollywood’s biggest stars, with a movie career that spans nearly five decades. His starring roles in movies like “Driving Miss Daisy” and “Shawshank Redemption” in the late 1980s and early 1990s made him a household name. He won an Oscar for Best Supporting Actor for 2004’s “Million Dollar Baby,” and has earned four other Oscar nominations. His voiceover work has also become iconic, including his narration for the Academy Award-winning documentaries “The Long Way Home” and “March of the Penguins.”\n\nMorgan Freeman won an Academy Award for Best Supporting Actor for \"Million Dollar Baby.\" Warner Bros.\n\nIn all, 16 people spoke to CNN about Freeman as part of this investigation, eight of whom said they were victims of what some called harassment and others called inappropriate behavior by Freeman. Eight said they witnessed Freeman’s alleged conduct. These 16 people together described a pattern of inappropriate behavior by Freeman on set, while promoting his movies and at his production company Revelations Entertainment.\n\nOf those 16, seven people described an environment at Revelations Entertainment that included allegations of harassment or inappropriate behavior by Freeman there, with one incident allegedly witnessed by Lori McCreary, Freeman’s co-founder in the enterprise, and another in which she was the target of demeaning comments by Freeman in a public setting. One of those seven people alleged that McCreary made a discriminatory remark regarding a female candidate for a job at the Producers Guild of America, where McCreary is co-president.\n\nFour people who worked in production capacities on movie sets with Freeman over the last ten years described him as repeatedly behaving in ways that made women feel uncomfortable at work. Two, including the production assistant on “Going in Style” whose skirt he allegedly attempted to lift, said Freeman subjected them to unwanted touching. Three said he made public comments about women’s clothing or bodies. But each of them said they didn’t report Freeman’s behavior, with most saying it was because they feared for their jobs. Instead, some of the women – both on movie sets and at Revelations – said, they came up with ways to combat the alleged harassment on their own, such as by changing the way they dressed when they knew he would be around.\n\nCNN reached out to dozens more people who worked for or with Freeman. Some praised Freeman, saying they never witnessed any questionable behavior or that he was a consummate professional on set and in the office.\n\nSeveral other times during this investigation, when a CNN reporter contacted a person who had worked with Freeman to try to ask them if they had seen or been subjected to inappropriate behavior by an actor they had worked with – not initially even naming the actor they were asking about – the person would immediately tell them they knew exactly who the reporter had in mind: Morgan Freeman. Some of those people were sources for this investigation while others declined to comment further or did not want what they said used in this story.\n\nThe pattern of behavior described by those who spoke with CNN shows another example of the systematic problems that exist in the entertainment industry. The allegations against Freeman are not about things that happened in private; they are about things that allegedly happened in public, in front of witnesses – even in front of cameras. Before #MeToo, many men in the industry could behave without fear of consequences, because many times when a powerful man did so, it was the victim who suffered repercussions.\n\nCNN reached out to Freeman’s spokesperson for comment and then, at his request, emailed him a detailed list of the accusations against Freeman. The spokesperson did not respond to multiple follow-ups by email seeking comment on the accusations. After this article was published, Freeman released a statement in which he said, “Anyone who knows me or has worked with me knows I am not someone who would intentionally offend or knowingly make anyone feel uneasy. I apologize to anyone who felt uncomfortable or disrespected — that was never my intent.”\n\nCNN also reached out to a spokesperson for McCreary, and then provided her with a detailed list of accusations regarding Freeman’s alleged behavior at Revelations and details of the accusation against her as well as a number of questions for her regarding Freeman’s alleged behavior at Revelations and the environment there. The spokesperson did not respond to multiple follow-ups by email seeking comment.\n\nThe allegations of inappropriate behavior by Freeman are not limited to the confines of his company or to movie sets. Three entertainment reporters who spoke to CNN said Freeman made inappropriate remarks to them during press junkets, which are publicity events for journalists who cover new films, typically attended by the movie’s biggest stars.\n\nOne of the three, CNN entertainment reporter Chloe Melas, the co-author of this article, says she was subjected to inappropriate behavior by Freeman more than a year ago, when she interviewed him at a press junket for “Going in Style.” According to Melas, who was six months pregnant at the time, Freeman, in a room full of people, including his co-stars Arkin and Caine, shook Melas’ hand, not letting go while repeatedly looking her up and down and saying more than once a variation of, “I wish I was there.” She says he also said to her, “You are ripe.” Cameras were on and recording during one of Freeman’s remarks to Melas – “Boy, do I wish I was there” – but not for the rest. As is common practice with such junkets, Melas was the only CNN employee there at the time.\n\nAfterward, Melas reported what had happened to her supervisor, who instructed her to inform CNN human resources. According to Melas, she was told that CNN HR contacted their counterparts at human resources for Warner Bros., which produced and distributed the movie, and which like CNN is owned by Time Warner. Melas said she was also told that Warner Bros. HR could not corroborate the account because only one of Freeman’s remarks was on video and the Warner Bros. employees present did not notice anything. Melas and her supervisor agreed that she would not cover the movie.\n\nAsked for comment, a spokesperson for Warner Bros. confirmed that what Melas was told was accurate, but declined to comment further. A representative for Caine declined to comment. A representative for Arkin said he was not available for comment.\n\nAfter the encounter with Freeman, Melas started making calls to see if other women had experienced anything similar, or whether this was an isolated incident. She soon learned that other women had similar stories – and so she, and later her co-author, began this months-long reporting process.\n\nInside Revelations Entertainment\n\nFreeman and Lori McCreary founded Revelations Entertainment in 1996. Variety reported last year that Freeman started the company with McCreary because he was frustrated by the lack of choice roles for black actors and because he wanted to reveal the truth about serious issues – a mission that inspired the name “Revelations.”\n\nThe company’s credits include a list of ambitious films about religion, apartheid, astronomy and stem cell research. Revelations also produced the film “Along Came a Spider” and the hit CBS show “Madam Secretary,” both of which feature strong female leads.\n\nMorgan Freeman and Lori McCreary, his business partner, speak at an event in New York City in 2016. Craig Barritt/Getty Images\n\nBut former staffers who spoke with CNN say that behind the façade of a progressive and artistic agenda the company’s two founders created what one called a “toxic” work environment. Six former staffers said they witnessed Freeman’s questionable behavior around women, which they said included sexual comments and one said included an incident of unsolicited touching. One female former staffer said she was the target of sexual comments by Freeman.\n\nThe female former employee at Revelations told CNN that Freeman was flanked by a group of men on the set of “Through the Wormhole” when she met the actor for the first time. He “looked me up and down,” she said, and then asked her, “How do you feel about sexual harassment?”\n\n“I was stunned,” she told CNN. “This is the person that I worked for, this is his company, I didn’t expect it at all … I said timidly, ‘I love it’ in a sarcastic way hoping to make light of the situation because I was so confused and then he turned to the guys on the crew … and said, ‘See guys, this is how you do it.’”\n\nOne woman who was a manager at Revelations told CNN that sometimes Freeman would “come over to my desk to say hi and he’d just stand there and stare at me. He would stare at my breasts.”\n\n“If I ever passed him he would stare at me in an awkward way, would look me up and down sometimes stopping and just staring,” she said. “One time he stopped, looked me up and down as I walked into a room of people, and everyone burst out laughing. And I literally froze feeling very uncomfortable and one of the people in the office said, ‘Don’t worry, that’s just Morgan.’”\n\n“That sort of interaction was when I stopped wearing a skirt around the office when he was there,” said the former manager. “I can’t say it was an accident that I’d be wearing a potato sack and a ponytail on certain days when he was there and do my best to avoid him when he was in the office.”\n\nFreeman was not in the office on a daily basis, the former employees said. But when he did show up, he behaved like a “creepy uncle,” in the words of a male former employee. “One time I witnessed Morgan walk up to an intern and start massaging her” shoulder, he said. “The intern got visibly red and wiggled out of his grasp, it was awkward.” The incident stood out to him because Freeman was using only one hand to touch the intern, as his other was injured in a 2008 car accident that was widely covered by the press. Another former employee told CNN she was present when the male former employee told several people about this incident shortly after it occurred.\n\nI stopped wearing a skirt around the office when he was there. A former manager at Revelations, Morgan Freeman's production company\n\nCNN spoke to two male witnesses who each saw a separate occasion in which Freeman asked women to twirl. One instance occurred at the office, while another happened at an off-site company event.\n\nAnother incident stood out to people who spoke with CNN who witnessed it. Two former staffers who were there, and a writer for the show “Madam Secretary” who also attended, each described the scene to CNN.\n\nFor his 79th birthday, Revelations threw Freeman a party in the office. According to the sources, roughly 30 people attended the party, some of whom were new to the company and had never met the actor. McCreary was among those in attendance, the sources said.\n\nPeople at the party had to stand in a circle, a former executive at the company who attended the party told CNN, and tell Freeman who they were and what they did. Then, the former executive said, Freeman went up to women in the circle and would “stand maybe within an inch of their face and just look them up and down and not say anything, and then would move on to the next woman and he’d stand like within an inch of their face and look them up and down and not say anything, and it was really, really strange.” The former executive added, “It was really weird and he did it to every woman but of course he didn’t do it to any of the men. He didn’t speak to any of the men.”\n\nThe writer for “Madam Secretary” who was at the party said, “We saw Morgan go around to the girls in the circle and get really close to their faces, he didn’t do it to the men. I don’t know what he said but we all thought it was strange and couldn’t wait to get the hell out of there. Absolutely there were sexual undertones to it.” After the #MeToo movement began, the same writer said, writers on the show joked – with that incident in mind – “that Morgan would be the next person to be called out.”\n\nMcCreary herself has also been the subject of demeaning comments by Freeman. In front of what was reportedly an audience of 400 people at 2016’s Produced By conference, Freeman described what she was wearing during their first meeting, saying, “She had on a dress cut to here.”\n\n“She wants to be thought of as serious,” said Freeman of McCreary, who was on the same panel. “But you can’t get away from the short dresses.”\n\nFreeman stood by his comments when he appeared a few days later on the “Today” show and host Savannah Guthrie said some people were “surprised” by the remarks he made on the panel.\n\n“It was just something I said in jest about when I first met her, it was more than 20 years ago,” he said to Guthrie. “How is that news?”\n\nThe Hollywood Reporter reported at the time that McCreary “did not visibly react to the comment.” One of the former Revelations executives told CNN that McCreary was visibly upset when she returned to the office.\n\n“I tried to console her and she was clearly upset and I think she was surprised and found it hurtful and embarrassing,” said the former executive. “She was devastated.”\n\nFive sources told CNN that there was no formal human resources department at Revelations at the time. There was a rotation of executives who served as the point of contact for HR issues, but former staffers said they did not feel comfortable talking to senior personnel about their workplace grievances. This prompted some staffers to form a “survivors club” where they gathered to vent about their experiences at Revelations, according to five sources who have been to the gatherings, which take place outside of the office.\n\nWe knew that if he was coming by … not to wear any top that would show our breasts, not to wear anything that would show our bottoms. A senior member of the production staff for the movie \"Now You See Me\"\n\nPublicly, McCreary champions the #MeToo and Time’s Up movements. Two days before January’s Screen Actors Guild awards, at which Freeman accepted a Lifetime Achievement Award, McCreary released a statement on behalf of the Producers Guild of America (PGA), to say that its board ratified new anti-sexual harassment guidelines for its members. “The PGA is indebted to Time’s Up as a resource in creating our protocols,” she said in a press release issued with her co-president Gary Lucchesi, referring to the initiative aimed at fighting harassment and discrimination against women.\n\nYet the former Revelations employee who said Freeman asked her how she felt about sexual harassment also alleged that on a phone call with a member of PGA, McCreary said of a candidate vying for a position at PGA East, “she’ll never be able to do a good job, she has a family.”\n\nTwo former senior level Revelations employees said McCreary would openly mock women who had to leave work early for family commitments and school functions. McCreary also allegedly said that some employees couldn’t handle big workloads because they had to “run home” to their families and therefore couldn’t stay late at work, according to one of the sources. She openly advocated for work-life balance, that source said, but she would make “snide” remarks to those who left work early.\n\nA spokesperson for the PGA said in a statement, “The Producers Guild of America is an Equal Opportunity Employer that does not question or consider marital or parental status in its hiring practices. As soon as CNN notified us about the allegation, we investigated the matter and have found that it has no merit. Lori McCreary is an outstanding PGA President. In all of her work with the Guild, she has been a consistent, vocal, and proactive advocate for women and all who are underrepresented in our community.”\n\nA spokesperson for McCreary did not respond to repeated follow-up requests for comment regarding the allegations against McCreary.\n\nOn set\n\nOne of the former male Revelations employees recounted to CNN what he called the “shocking” remarks that Freeman made while he was on set for a number of Freeman’s movies. What he says he witnessed follows the pattern described by the women who said they were harassed by Freeman.\n\n“[He’d say] things like ‘I’d like to have an hour with her’ or make vulgar and sexual comments about women,” the former employee said. “He would be verbally inappropriate and it was just shocking. You’re more shocked than anything because it’s hard to have the wherewithal to say to him ‘That’s inappropriate.’ You’re just like ‘whoa.’ It’s hard because on any set he is the most powerful person on it. It’s weird because you just don’t expect it from Morgan Freeman, someone who you respect.”\n\nMorgan Freeman at an event in California in 2016. Richard Shotwell/Invision/AP\n\nThe female production assistant (PA) mentioned at the beginning of this story who worked on “Going In Style” said she was in her early 20s when Freeman, then 78 years old, harassed her. She said the experience led to her decision to leave the movie industry.\n\n“It was constant comments about the way I looked,” she said, adding that Freeman often made the comments within earshot of others on the production staff. She said she frequently came home from work in tears.\n\nThe woman recalled a time when she went to the set wearing a dress with a t-shirt over it to cover her exposed back, but “Morgan said to me that I shouldn’t be wearing the shirt over my dress.”\n\nAnother female production assistant who witnessed this particular alleged incident told CNN that Freeman’s behavior towards the younger female production staff was an unchecked and persistent issue during filming. Both women said the t-shirt incident took place in front of a group of people and that they heard at least one other woman publicly chastise Freeman for that particular comment. The behavior was discussed among the women he targeted, the female production assistant said.\n\nA third woman who worked on a recent movie of Freeman’s recalled an incident at the film’s wrap party. “He was looking at my breasts, and I told him, ‘My eyes are up here.’ Then we went to take a group photo and he pressed himself up against me. It was inappropriate.”\n\nCNN spoke to one of the woman’s colleagues on the film, who said that as soon as the photo was taken, the woman walked over and told a group of people what Freeman had done to her.\n\nAnother production assistant, who worked with Freeman on “The Dark Knight,” told CNN that although she was never personally targeted by Freeman, she witnessed some inappropriate comments Freeman made to female members of the crew. She also said that female members of the crew would at times discuss how Freeman had made them feel uncomfortable.\n\n[W]e all joked that Morgan would be the next person to be called out in this #MeToo movement. A writer for \"Madam Secretary,\" a CBS TV show produced by Morgan Freeman's production company\n\n“Morgan did things in a way that an older more established person can get away with because they have that power,” she told CNN. “They can’t be replaced, but you can be replaced very easily, that’s just kind of the dynamic on set. PA’s can be replaced, grips can be replaced, electricians can be replaced, but the actors – once they’re in, they’re in. Had it been somebody else on the crew… I would feel comfortable reporting them because I wouldn’t feel like my job would be in danger by reporting them, but if you report somebody like Morgan Freeman that the movie would lose a lot of money by replacing them or getting them in trouble, then you’re the trouble maker and you’ll get fired because you’re just a PA.”\n\nWith reporters\n\nFreeman’s alleged fixation on how women dressed was apparent when he hit the road to promote his films, as was his alleged pattern of looking women up and down while making sexually suggestive comments to them.\n\nAs the entertainment producer at Chicago’s WGN-TV, Tyra Martin spent hours interviewing Freeman at various press junkets. Over the course of a decade, she said, she sat down with him at least nine times and grew accustomed to his comments about her appearance. But Martin made it clear in an interview with CNN that she was always “in on the joke.” WGN produced videos featuring some of Freeman’s remarks to Martin, describing it as him flirting with her. But Martin felt that one incident crossed a line.\n\n“When I stood up, I pulled my skirt part of my dress down and he did say, ‘Oh, don’t pull it down now.’” Martin said. “That gave me pause but I never felt uncomfortable.”\n\nIt is unclear whether video of that incident exists.\n\nAn entertainment reporter who is a member of the Hollywood Foreign Press Association said Freeman made comments about her skirt and her legs during two different junkets. Much like many of the women in this report and those who declined to go on the record, the reporter said Freeman’s fame and power kept her from speaking out.\n\n“I was just trying to do my job and I brushed it off,” said the reporter, who did not want to be identified for this story because she’s fearful of losing out on interviews with other celebrities.\n\n“You don’t want to put him on the spot because one, he’s famous and two, it’s on camera and three, you just want to do your job.”", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/180523162106-01-morgan-freeman-lead-image.jpg?q=x_0,y_0,h_1968,w_3497,c_fill/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/180523162106-01-morgan-freeman-lead-image.jpg?q=x_0,y_0,h_1968,w_3497,c_fill/w_800", "https://media.cnn.com/api/v1/images/stellar/prod/180523162559-morgan-freeman-million-dollar-baby.jpg?q=x_0,y_0,h_900,w_1599,c_fill/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/180523172421-morgan-freeman-lori-mccreary-file-2016.jpg?q=x_0,y_0,h_1687,w_2997,c_fill/h_270,w_480"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/180523162106-01-morgan-freeman-lead-image.jpg?q=x_0,y_0,h_1968,w_3497,c_fill/w_800", "keywords": [], "authors": ["An Phung Chloe Melas", "An Phung", "Chloe Melas"], "canonical_link": "https://www.cnn.com/2018/05/24/entertainment/morgan-freeman-accusations/index.html", "title": "Morgan Freeman accused of inappropriate behavior, harassment", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Women accuse Morgan Freeman of inappropriate behavior, harassment | CNN", "description": "Eight women accuse Morgan Freeman of inappropriate behavior. They say it happened on movie sets, at his company and in interviews.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180523162106-01-morgan-freeman-lead-image.jpg?q=x_0,y_0,h_1968,w_3497,c_fill/w_800", "type": "article", "url": "https://www.cnn.com/2018/05/24/entertainment/morgan-freeman-accusations/index.html", "site_name": "CNN"}, "twitter": {"title": "Women accuse Morgan Freeman of inappropriate behavior, harassment | CNN", "description": "Eight women accuse Morgan Freeman of inappropriate behavior. They say it happened on movie sets, at his company and in interviews.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180523162106-01-morgan-freeman-lead-image.jpg?q=x_0,y_0,h_1968,w_3497,c_fill/w_800", "card": "summary_large_image", "site": "@CNNent"}, "description": "Eight women accuse Morgan Freeman of inappropriate behavior. They say it happened on movie sets, at his company and in interviews.", "template_type": "article_fullwidth", "type": "article", "meta-section": "entertainment", "theme": "entertainment", "article": {"published_time": "2018-05-24T14:58:42Z", "modified_time": "2018-05-29T03:56:43Z", "tag": "academy awards, alan arkin, arts and entertainment, awards and prizes, business and industry sectors, business, economy and trade, celebrities, celebrity and pop culture, discrimination, entertainment and arts awards, females (demographic group), feminism, gender equality, golf, human resources, human resources and personnel management, journalism and news media, labor and employment, media industry, morgan freeman, movie and video industry, movie awards, movies, pga tour, population and demographics, sex and gender issues, sex discrimination, sexual harassment, societal issues, society, sports and recreation, sports organizations and teams, time's up movement, women workers and professionals, workers and professionals, crime, law enforcement and corrections, crimes against persons, criminal offenses, sex crimes, sexual assault", "publisher": "https://www.facebook.com/CNN"}, "keywords": "academy awards, alan arkin, arts and entertainment, awards and prizes, business and industry sectors, business, economy and trade, celebrities, celebrity and pop culture, discrimination, entertainment and arts awards, females (demographic group), feminism, gender equality, golf, human resources, human resources and personnel management, journalism and news media, labor and employment, media industry, morgan freeman, movie and video industry, movie awards, movies, pga tour, population and demographics, sex and gender issues, sex discrimination, sexual harassment, societal issues, society, sports and recreation, sports organizations and teams, time's up movement, women workers and professionals, workers and professionals, crime, law enforcement and corrections, crimes against persons, criminal offenses, sex crimes, sexual assault", "author": "An Phung,Chloe Melas", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1527116400.0, "source": "https://www.cnn.com", "summary": ""}