{"url": "https://en.wikipedia.org/wiki/Total_Divas_(season_7)", "text": "Season of American television series Total Divas\n\nSeason of television series\n\nTotal Divas is an American reality television series that premiered on July 28, 2013, on E!.[1][2] The series gave viewers an inside look at the lives of WWE Divas from their work within WWE to their personal lives.[3][4][5][6] Season 6 ended on May 10, 2017 (2017-05-10) with 683 thousand viewers.[7]\n\nProduction [ edit ]\n\nIn speculation of the seventh season of Total Divas, on May 16, 2017, it was announced that Eva Marie would not be returning as a series regular, and questions have been raised in regards to Paige remaining on the show. However, Brie, Nikki, Naomi, and Natalya will definitely return as series regulars for the upcoming season. Filming began in June 2017.[8] On June 9, 2017, it was reported that Alexa Bliss and Nia Jax would be joining the upcoming season of Total Divas. However, the rest of the seventh season cast is still to be announced.[9][10] On June 10, 2017, Renee Young confirmed via Twitter that she will not be returning for the seventh season.[11] In a recent interview, it was confirmed Lana would be returning to the show for the upcoming season, along with her storyline of becoming an independent wrestler on the SmackDown brand.[12] On June 29, 2017, it was reported that Carmella would be joining the cast and that Paige wouldn't be returning for the upcoming season.[13] On September 20, 2017, E! revealed that the seventh season will premiere on November 1, 2017.[14]\n\nCast [ edit ]\n\nAlexa Bliss; who joined the cast of Total Divas in season 7. Carmella; who joined the cast of Total Divas in season 7. Nia Jax; who joined the cast of Total Divas in season 7.\n\nMain cast [ edit ]\n\nRecurring cast [ edit ]\n\nGuest stars [ edit ]\n\nEpisodes [ edit ]\n\nNo. in\n\nseries No. in\n\nseason Title Original air date Production\n\ncode U.S. viewers\n\n(millions) 89 1 \"This Is Make or Break\" November 1, 2017 ( ) 701 0.55[15] The women's division get their first ever Money in the Bank ladder match; Nicole pitches the idea of becoming SmackDown Live's General Manager while Bryan's on paternity leave; Lana trains for her debut match, and Nia leaves a bad taste in Maryse's mouth after she questions her wrestling career. 90 2 \"Dressed Like A Champ\" November 8, 2017 ( ) 702 0.50[16] Lana's performance in her debut match leaves a lot to be questioned about her future in the squared circle; Alexa's painful past is triggered during her fashion makeover with Maryse, while Nattie and Trinity offer to babysit Brie's newborn, even though Nattie hates babies. 91 3 \"Breaking All The Rules\" November 15, 2017 ( ) 703 0.62[17] Trinity alters her championship in order to give it a glow; Lana pulls a stunt that could get her fired; Maryse goes all-out for her house guests Carmella and Big Cass, while Brie and Nicole go on a road trip with a breastfeeding infant. 92 4 \"The Diva Divide\" November 29, 2017 ( ) 704 0.54[18] Brie donates her breast milk for a good cause; Maryse puts her house on the market without telling Mike, and Lana's over-enthusiastic desire to improve in the ring gets on Nattie's and Nia's last nerve. 93 5 \"The Bella Rush\" December 6, 2017 ( ) 705 0.56[19] Lana hosts a Bulgarian Name Day Celebration party for Rusev, who is fixated on starting a family; Brie and Nicole find a new rush; Alexa bonds with her new pet, and Nattie acts like an overbearing landlord with the house she purchased for her parents. 94 6 \"Divas Gone Wild\" December 13, 2017 ( ) 706 0.51[20] The ladies head to Cabo to celebrate Nicole's engagement; Brie struggles with trying to feel good about her body, and the tension between Lana and Nattie reaches a climax. 95 7 \"Fake It 'Til You Make It\" December 20, 2017 ( ) 707 0.61[21] Brie is torn between making a comeback in the ring or being the best mother to Birdie; Lana and Nattie resolve their issues; Trinity tries to spice it up in the bedroom with Jon, and Maryse makes a bet with Mike that could change his lifestyle completely. 96 8 \"Single in the City\" January 3, 2018 ( ) 708 0.68[22] The women venture to Brooklyn, New York for the road to SummerSlam; Maryse takes Nia to a Firemen's Fantasy party; Alexa worries about her fiancé, Buddy Murphy, status with the WWE; Nattie continues to better her mic skills, and Lana pushes Rusev to the limit with her affection towards other women. 97 9 \"Three Alarm Fire\" January 10, 2018 ( ) 709 0.51[23] Nia invites a date to the Sex in the City party, which doesn't turn out as she expected; Nattie and Trinity take a voice acting class; Brie starts to feel left out as Nicole lives the busy life of a WWE wrestler, and dreams come true at one of the biggest pay-per-view event, SummerSlam. 98 10 \"Shall We Dance?\" January 17, 2018 ( ) 710 0.59[24] Brie becomes frustrated with Nicole as she accepts the opportunity to be on Dancing with the Stars; Lana and Rusev celebrate their one year anniversary in Bulgaria; Nattie feels the pressure of being champion, while Carmella is overwhelmed with the stress of her future with Big Cass. 99 11 \"Let's Get Naked!\" January 24, 2018 ( ) 711 0.60[25] Brie and Bryan go on a rocky journey cross country in an RV; Trinity isn't feeling Jon's romantic weekend trip, and Rusev tries to give Lana a taste of her own medicine. 100 12 \"Breaking the News\" January 31, 2018 ( ) 712 0.66[26] Nattie isn't impressed when she learns TJ is helping to train Lana in the ring; Maryse and Mike embark on their new responsibilities of becoming parents, and Brie tries to find time with Nicole to go wedding dress shopping.\n\n\n\n\n\nRatings [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Alexa_Bliss_as_Raw_Women%27s_Champion.jpg/175px-Alexa_Bliss_as_Raw_Women%27s_Champion.jpg", "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/32px-Blank_television_set.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Nia_Jax_Live_Event_May_2017.jpg/175px-Nia_Jax_Live_Event_May_2017.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Carmella_SmackDown_2016.jpg/175px-Carmella_SmackDown_2016.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/32px-Flag_of_the_United_States.svg.png"], "top_img": "https://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Total_Divas_(season_7)", "title": "Total Divas (season 7)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "viewport": "width=1000", "og": {"title": "Total Divas (season 7) - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}