{"url": "www.celebritynetworth.com/richest-celebrities/actors/elizabeth-banks-net-worth/", "text": "What is Elizabeth Banks' Net Worth and Salary?\n\nElizabeth Banks is an American actress, producer and director who has a net worth of $50 million. As an actor, Elizabeth Banks is probably most famous for appearing in movies like Definitely Maybe, The Hunger Games, Pitch Perfect, and Lego Movie franchises, Zack and Miri Make a Porno. As a producer/director she is most famous for the Pitch Perfect franchise and the 2019 Charlie's Angels reboot.\n\nEarly Life\n\nElizabeth Banks was born Elizabeth Irene Mitchell in Pittsfield, Massachusetts, in February of 1974. According to Banks herself, she grew up with an \"Irish + WASP + Catholic\" extraction, eventually going on to graduate magna cum laude from the University of Pennsylvania with a communications degree and concentration in theater arts. Then, in 1998 she earned her master's degree in fine arts from the American Conservatory Theater.\n\nActing Career\n\nUpon getting serious about acting and joining the Screen Actors Guild, Banks changed her name to the one we know today since there was already an Elizabeth Mitchell on the SAG rolls. Later that same year, Banks made her on-screen debut in the independent film Surrender Dorothy. A few years after that she then landed a small but memorable part in 2001's Wet Hot American Summer directed by David Wain and starring a cast of many future stars, including Bradley Cooper (she's gone on to reprise her role in two follow-up series to the film on Netflix). In 2002 she played the character of Betty Brant in Spider-Man, followed in 2003 by appearances in Seabiscuit and The 40-Year-Old Virgin alongside Steve Carrell in 2005.\n\nDuring this period she also worked prolifically on television. She earned a recurring role as Dr. Kim Briggs on 15 episodes of Scrubs, and was also nominated for an Emmy Award for Outstanding Guest Actress in a Comedy Series for her work as Avery Jessup on 30 Rock.\n\nIn 2006 Banks appeared in Invincible, a sports drama starring Mark Wahlberg (the two were nominated for \"Best Kiss\" at the MTV Movie Awards for their roles in the film). 2008 was another notable year for Banks's film career, as she starred in Zack and Miri Make a Porno with fellow 40-Year-Old Virgin alum Seth Rogen and director Kevin Smith, and appeared in Oliver Stone's George W. Bush biopic W as Laura Bush.\n\nBanks has mostly worked as a comedic actress but in 2009 she starred in The Uninvited, a remake of the Korean horror film A Tale of Two Sisters. In 2012 she got one of her highest profile roles in The Hunger Games, that of Capitol official Effie Trinket, a character she continued to play throughout the duration of the film series. Then in 2014 she landed the role of Wyldstyle in The Lego Movie, a role she reprised in the film's 2019 sequel. In 2015 she appeared in another biopic, this one based on the life and career of Beach Boys auteur Brian Wilson, Love & Mercy. Then, in 2017, she portrayed the supervillain Rita Repulsa in a feature film version of the Power Rangers franchise.\n\nIn 2018 she appeared in The Happytime Murders, and the following year she starred in the superhero/horror hybrid Brightburn. In 2020 she starred in the FX miniseries Mrs. America alongside Cate Blanchett and Rose Byrne.\n\nDirecting Career\n\nWhile continuing to act prolifically in films and television shows, Banks has also found success as a director since taking over the Pitch Perfect series after starring in and directing the first entry. Pitch Perfect 2 was her feature directorial debut in 2015, and she went on to direct Pitch Perfect 3 in 2017. Then, in 2019, she directed Charlie's Angels, a reboot of the film franchise based on the 1970s action series. Before helming Pitch Perfect 2 she had two directorial credits to her name, a short film called Just A Little Heart Attack in 2011 and a segment of the infamous comedy anthology Movie 43 in 2013.\n\nMiscellaneous Work\n\nBanks has a few video game credits stemming from her work in the Spider-Man and LEGO movies, as well as a voice role in Legoland, Florida's The LEGO Movie: 4D – A New Adventure. She's also appeared in a handful of music videos, including \"Girls Like You\" by Maroon 5 feat. Cardi B and \"Don't Call Me Angel\" by Ariana Grande, Miley Cyrus, and Lana Del Rey for the 2019 Charlie's Angels movie. That same year she made her game show host debut as the host of Press Your Luck on ABC.\n\nBanks is one of the few people to have appeared in both the Muppets franchise and Curb Your Enthusiasm as herself, and in 2020 she was one of the stars to sign on for the public service campaign COVID Is No Joke.\n\nPersonal Life\n\nShe has been married to sportswriter Max Handelman since 2003. The couple met on her first day at the University of Pennsylvania in 1992. They have two children together, sons Felix and Magnus Mitchell.\n\nReal Estate\n\nIn 2007 Elizabeth and Max reportedly paid $1.625 million for a home in Studio City, California. After 13 years, the couple listed this home for sale in May 2020 for $2.4 million.\n\nIn 2018 they paid $6.85 million for a custom-built gated 1-acre hilltop property in nearby Sherman Oaks.\n\nBrownstone Productions\n\nElizabeth and Max co-founded the production company Brownstone Productions in 2002. Their company was the powerhouse studio behind the Pitch Perfect movie franchise. She made her directorial debut with the second installment of the Pitch series which was produced for $30 million and went on to make $300 million worldwide, enough to make it the highest-grossing musical comedy of all time when it was released.", "images": ["http://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://vz.cnwimg.com/wp-content/uploads/2010/11/Elizabeth-Banks.jpg"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2010/11/Elizabeth-Banks.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/elizabeth-banks-net-worth/", "title": "Elizabeth Banks Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Elizabeth Banks is an American actress, producer and director who has a net worth of $50 million. As an actor, Elizabeth Banks is probably most famous for appearing in movies like", "cnw_share_fb_count": 66, "cnw_share_tw_count": 31, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Elizabeth Banks Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/elizabeth-banks-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/11/Elizabeth-Banks.jpg", "site_name": "Celebrity Net Worth", "description": "Elizabeth Banks is an American actress, producer and director who has a net worth of $50 million. As an actor, Elizabeth Banks is probably most famous for appearing in movies like"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2022-04-26T18:58:25+00:00", "published_time": "2019-10-27T05:58:45+00:00", "section": "Actors", "tag": "Elizabeth Banks salary"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/11/Elizabeth-Banks.jpg", "title": "Elizabeth Banks Net Worth", "description": "Elizabeth Banks is an American actress, producer and director who has a net worth of $50 million. As an actor, Elizabeth Banks is probably most famous for appearing in movies like"}}, "movies": [], "publish_date": 1572155925.0, "source": "http://www.celebritynetworth.com", "summary": ""}