{"url": "https://en.wikipedia.org/wiki/Inhumans_(TV_series)", "text": "2017 Marvel Television series\n\nMarvel's Inhumans, or simply Inhumans, is an American television series created by Scott Buck for ABC, based on the Marvel Comics race of the same name. It is set in the Marvel Cinematic Universe (MCU) and acknowledges the franchise's other television series. It was produced by ABC Studios and Marvel Television in association with Devilina Productions, and was co-financed by IMAX Entertainment in a deal that gave the series a theatrical premiere. Buck served as showrunner on the series.\n\nThe series is centered on Black Bolt, portrayed by Anson Mount, and other members of the Inhuman Royal Family. Serinda Swan, Ken Leung, Eme Ikwuakor, Isabelle Cornish, Ellen Woglom, and Iwan Rheon also star. Marvel Studios announced an Inhumans film in 2014 as part of their Phase Three slate of films, with the species first introduced to the MCU in the series Agents of S.H.I.E.L.D. The film was removed from Marvel Studios' slate in April 2016, and the Inhumans series was announced that November, to be partly filmed using IMAX cameras. Buck joined the series in October, and Mount was cast in February 2017. Filming took place from March to June 2017, at the former Naval Air Station Barbers Point airfield in Kalaeloa, Hawaii and various locations on the island of Oahu.\n\nInhumans debuted on IMAX screens on September 1, 2017, the first live-action television series to do so. The theatrical run lasted two weeks, before the series premiered on ABC on September 29 and ran for eight episodes, concluding on November 10. The series was met with unfavorable reviews and low television ratings, and was canceled by ABC in May 2018. Mount reprised his role as an alternate version of Black Bolt in Marvel Studios' MCU film Doctor Strange in the Multiverse of Madness (2022).\n\nPremise [ edit ]\n\nAfter a military coup, the Inhuman Royal Family escape to Hawaii, where they must save themselves and the world.[2]\n\nCast and characters [ edit ]\n\nMain [ edit ]\n\nCrystal's 2,000-pound (910 kg) teleporting canine companion Lockjaw also appears in the series, created through CGI.[17][25] Reiné stated that \"nobody has done a full CG character on a TV series before. So Lockjaw is the first. It's a big responsibility for all of us.\"[26] Mount called Lockjaw the \"goofy sidekick\", but felt that he had been integrated into the plot rather than just used as comic relief.[10] Buck felt Lockjaw's storylines would \"always [be] fairly simple\" as a way to ensure the writers \"don't try to pretend that he's anything other than\" a dog and pull focus from the other characters.[27] Initial designs for Lockjaw had him bigger than his final look, closer to \"the size of a Mini Cooper\".[28]\n\nRecurring [ edit ]\n\nGuest [ edit ]\n\nNicola Peltz as a human recently transformed into an Inhuman on Earth. [37]\n\nMarco Rodriguez as Kitang: The head of the Genetic Council.\n\nTom Wright as George Ashland: The head of the Callisto Aerospace Control Center. [38]\n\nAndra Nechita as Iridia: A young Inhuman who has butterfly wings and the sister of Bronaja. [39]\n\nJason Quinn as Pulsus: An Inhuman with electric based powers.\n\nKala Alexander as Makani: A surfer part of Holo's crew who befriends Gorgon.\n\nAlbert Ueligitone as Pablo: A surfer part of Holo's crew who befriends Gorgon.\n\nMoses Goods as Eldrac: An Inhuman \"Doorway\" that can teleport people anywhere. [38]\n\nMiriam Lucien as a serene Inhuman.\n\nMatt Perfetuo as Sakas[35]\n\nEpisodes [ edit ]\n\nNo. Title Directed by Written by Original air date [40] US viewers\n\n(millions) 1 \"Behold... The Inhumans\" Roel Reiné Scott Buck September 29, 2017 ( ) [a] 3.75[42] During a mission on the island of Oahu to find a newly transformed Inhuman, Triton is attacked by a strike team and escapes by jumping into the ocean. In Attilan, the secret city of the Inhumans on the Moon, Black Bolt, Medusa, and other members of the Inhuman Royal Family learn that a recently destroyed Earth rover might reveal their society to the humans before attending a Terrigenesis ceremony for two members of society named Iridia and Bronaja, where they are exposed to Terrigen Mist to reveal their Inhuman powers. Later, Black Bolt's brother Maximus alerts the other members of the Royal Family to Triton's mission. Unhappy to hear Triton may be dead, Gorgon heads to Earth to find him. Maximus begins a coup on Attilan, including having the same strike team attempt to kill Gorgon on Earth. Karnak learns what Maximus is doing and begins to warn Medusa and her sister Crystal. Maximus attacks and shaves Medusa's head to suspend her powers. Crystal has her dog Lockjaw send Karnak to Earth for safety and does the same with Medusa and Black Bolt. 2 \"Those Who Would Destroy Us\" Roel Reiné Scott Buck September 29, 2017 ( ) [a] 3.75[42] Realizing they have all been stranded and separated on Earth, Karnak and Medusa begin to search for Black Bolt to reunite with him while Gorgon waits for the fight to come to him. Crystal contacts Medusa on Earth, but the call is tracked by Auran. Louise investigates the missing Moon rover and learns of four strange anomalies coming from the Moon and landing in Hawaii. Black Bolt is arrested by the Honolulu Police after his arrival causes a traffic disturbance and he shoplifts new clothes. Auran finds and engages Medusa, who stabs her and escapes. Maximus addresses the people of Attilan as their new king, while Auran wakes up and is seen healing her stab wound. 3 \"Divide and Conquer\" Chris Fisher Rick Cleveland October 6, 2017 ( ) 2.78[43] In flashbacks, a teenage Black Bolt (before undergoing his Terrigenesis) has no interest in the throne, which Maximus craves. After the brothers go through Terrigenesis, Kitang suggests locking up Black Bolt for Attilan's protection, but Agon overrules him. In the present, Black Bolt's fellow inmate Sammy is contacted by Evan Declan and given instructions to befriend the former. Louise watches the prison in the hopes of gaining information, while Medusa learns of Black Bolt's incarceration and heads there on foot. A prison riot ensues and Sammy breaks out Black Bolt, revealing himself as an Inhuman with heat powers. They board Declan's helicopter and escape. Medusa fails to reach them in time and forces a curious Louise to help her chase them. Maximus tasks Auran to kill Gorgon, sending a team which includes the deadly Mordis. Her party forces Gorgon's to retreat. Crystal publicly opposes Maximus as king and escapes Attilan with Lockjaw. Maximus uses the chance to convince the Genetic Council of the Royal Family's incompetence and strengthen his position. Arriving on Earth with Crystal, Lockjaw is wounded in a collision with an ATV. All the while, Karnak is captured by a group of cannabis farmers who decide to keep him alive. 4 \"Make Way for... Medusa\" David Straiton Wendy West October 13, 2017 ( ) 2.30[44] Declan, who is working for Maximus, takes Black Bolt and Sammy to his facility to harvest Black Bolt's DNA for Maximus to undergo further Terrigenesis. Maximus orders Tibor to prepare for the upcoming procedure, while his guards kill the rest of the Genetic Council. After losing the helicopter, Medusa and Louise manage to locate Declan's facility. Black Bolt and Sammy deduce Declan's malevolence and escape before being confronted by Auran's party. Medusa and Louise arrive as Mordis fires at Black Bolt, causing an explosion. Black Bolt escapes with Medusa and Louise, taking an unconscious Locus, a member of Auran's party with the power to locate people, with them to help find their family members. Meanwhile, Gorgon deserts his party in order to protect them and find Karnak, who begins to develop a romantic relationship with Jen, while Reno kills their fellow farmer. Elsewhere, Crystal meets Dave, who gets Audrey to examine and help Lockjaw. 5 \"Something Inhuman This Way Comes...\" Kevin Tancharoen Scott Reynolds October 20, 2017 ( ) 1.98[45] Karnak and Jen escape from Reno, who wounds her. Reno's customer kills him for his unreliability and orders his men to find the pair. Locus criticizes Black Bolt's politics, locating Karnak using her powers. Auran awakens in Declan's facility and secretly contacts Maximus, who orders her to let Declan continue his research on Black Bolt. After recapturing Sammy and learning of his powers, Mordis's party reunites with Auran, who decides to use Declan and Sammy to lure back Black Bolt. After stitching Jen's wounds, Karnak returns to the camp with her. They are later captured by the customers, only for Gorgon to arrive and rescue them. Escaping, Gorgon and Karnak are reunited with Black Bolt and Medusa. A dying Locus tells Medusa of Crystal's presence on Oahu and asks Black Bolt to reconsider his policies. Maximus decides to send more Inhumans to help Auran. Tibor encounters the opposition, who ask him to help overthrow Maximus. Audrey cures Lockjaw, who teleports Crystal and Dave away. The pair continues bonding. In flashbacks, Gorgon and Karnak scold each other for extreme behavior. 6 \"The Gentleman's Name is Gorgon\" Neasa Hardiman Charles Murray October 27, 2017 ( ) 2.05[46] Following a nightmare involving his family, Maximus has Eldrac send the supporting team to Declan's facility with one of them being Bronaja's father Loyolis. Auran sends the message to Medusa. Black Bolt takes Medusa and Louise to find Crystal while tasking Gorgon and Karnak to rescue Declan and Sammy. Crystal creates lightning to signal the others. Gorgon and Karnak defeat Auran's party and rescue the duo. Mordis tries to kill everyone by collapsing the facility, but Gorgon sacrifices himself to save the others. Black Bolt's party reunites with Crystal and Lockjaw and goes to Declan's facility. Audrey brings the police to Dave's barn to expose the Inhumans. Pretending to be Dave's girlfriend, Louise assures the police that Audrey was only being jealous. Meanwhile, Maximus unearths the assassination plot of Tibor and his rebels. After killing Tibor and having the rebels taken away, he has Bronaja pledge his loyalty to him. 7 \"Havoc in the Hidden Land\" Chris Fisher Quinton Peeples November 3, 2017 ( ) 1.96[47] After Gorgon's sacrifice, Auran and her party are returned to Maximus to show good faith. She is disillusioned when she learns that Maximus' deeper agenda is a second chance at Terrigenesis. Triton is revealed to be alive and reunites with the Royal Family, who learn that Black Bolt predicted the coup and is prepared. The Family returns to Attilan for a parley with Maximus. Black Bolt agrees to allow Maximus to undergo Terrigenesis in exchange for reclaiming the throne. After securing Declan, Maximus violates the pact and demands the Family leave. Having learned from Declan's research, Karnak convinces Auran to give him her DNA so that he can use it to revive Gorgon through a second Terrigenesis, which seemingly fails. Triton kills Maximus' bodyguards, captures him, and sends him back to Black Bolt, who prepares to kill him before he tells Black Bolt that Attilan's survival depends on his due to a failsafe. Gorgon awakens with a primitive mind, much to Declan's dismay. 8 \"...And Finally: Black Bolt\" Billy Gierhart Rick Cleveland & Scott Reynolds November 10, 2017 ( ) 1.95[48] Gorgon kills Declan and escapes. Karnak is arrested and locked in the \"quiet room\", later joined by Gorgon, whom he helps remember the past slightly. Maximus reveals that the failsafe needs his fingerprints once an hour to stabilize. Black Bolt plans an evacuation of the people to Earth if he can not topple Maximus. Crystal tells Eldrac of the plan. Maximus is rescued by the Royal Guards, but finds only Declan's body and no Terrigen crystals, which Medusa has entrusted to Louise on Earth. Her boss agrees to provide settlement for the people of Attilan with help from his superiors. Karnak and Gorgon break out and join the Family. Medusa meets with Maximus and tries to reason with him, but to no avail. The Family sends a broadcast throughout Attilan, revealing Maximus' ideology and offering the option of evacuation. Disillusioned, Auran deserts Maximus and joins the evacuation. Black Bolt confronts Maximus, who reveals that he faked the letter from Agon and Rynda discussing Black Bolt's brain surgery, leading to the pair's deaths. Black Bolt locks Maximus in the bunker and leaves through Eldrac, who dies with Attilan. A cryptic message is shown on the Throne of Attilan. Now on Earth, Black Bolt and Medusa address every Inhuman present.\n\na b A version of the first two episodes debuted in IMAX theaters on September 1, 2017, and ran for two weeks, before their television premiere on ABC on September 29.\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nA film based on the Inhumans was first mentioned as being in development in a March 2011 trade report.[49][50] In October 2014, Marvel Studios officially announced the film as part of the Marvel Cinematic Universe's Phase Three, with a release date of November 2, 2018.[51] Producer Kevin Feige said, \"We really do believe the Inhumans can be a franchise or a series of franchises unto themselves. They have dozens of powers and an amazing social structure. With our 20th movie in the Marvel Cinematic Universe, we wanted to continue to refine what that universe is about.\"[52] The following December, the Inhuman species was introduced during the second season of Marvel's Agents of S.H.I.E.L.D. that began a storyline that recurred throughout the series moving forward.[53] In April 2016, the film was officially taken off of Marvel's release schedule, though it was not outright canceled. After the film's cancellation, Jed Whedon, executive producer and showrunner on Agents of S.H.I.E.L.D., noted that series had \"a little more freedom\" and were \"able to do a little bit more\" with the species going into the fourth season, including the potential of introducing some of the \"classic\" Inhumans.[55]\n\nIn May 2016, after ABC had canceled Marvel's Agent Carter and passed on Marvel's Most Wanted, ABC Entertainment president Channing Dungey said that Marvel and ABC were looking \"at series that would be beneficial to both brands\" moving forward.[56] In November, Feige said that \"Inhumans will happen for sure. I don't know when. I think it's happening on television. And I think as we get into Phase 4 as I've always said, it could happen as a movie.\"[57] Shortly after, Marvel Television and IMAX Corporation announced the eight-episode television series Inhumans, to be produced in conjunction with ABC Studios and air on ABC;[3][4] Marvel Studios decided that the characters were better suited to television, and a series would be better than trying to fit the multiple planned franchise films around the studio's existing film franchises.[58] Inhumans was not intended to be a reworking of the planned film, nor a spin-off from Agents of S.H.I.E.L.D.,[3] but it is set in the same shared universe.[5] In December, Scott Buck, the showrunner for the first season of the Marvel Netflix series Iron Fist, was revealed to also be executive producing and showrunning Inhumans.[59] Jeph Loeb and Jim Chory also executive produce the series.[21]\n\nIMAX serves as a financing partner on the series, the first time it had done so for a television series,[3] paying completely for the first two episodes. IMAX had originally approached Marvel about the deal after a successful IMAX event with Game of Thrones in 2015.[60] Because of this deal, Marvel was able to spend more on Inhumans than it has on its other shows, especially for visual effects, which have been criticized in series like Agents of S.H.I.E.L.D. ABC also hoped that partnering with IMAX would attract a larger audience to the series than its previous Marvel shows, similar to the \"buzz-creating, widely watched series\" that Marvel provides to Netflix, and perhaps even draw more viewers to Agents of S.H.I.E.L.D.'s fifth season in the 2017–18 television season.[58][60] Ben Sherwood, president of Disney–ABC Television Group, described the deal as \"a quadruple win—a win for IMAX, a win for Marvel, a win for ABC Studios and a win for ABC to launch a show in an innovative way and get attention\" in an increasingly crowded market for original television series.[60] Buck felt working with IMAX \"gave us a lot more freedom and pushed and encouraged us to think a little bit bigger than we would if it was just a normal network show. We just wanted to think bigger in terms of scope, and what we were seeing, and how we bring these characters to the audience.\"[5] Loeb cautioned that Inhumans was \"a television show that is premiering in an IMAX theater\" rather than a film, but that it would still be a spectacle, and \"a unique way to be able to see TV\".[61]\n\nWriting [ edit ]\n\nBuck said Inhumans would be \"a family drama with one big story leading us through the season\", rather than a procedural series like Agents of S.H.I.E.L.D., and though the initial IMAX release was intended to be \"something that absolutely stands on its own\", he hoped it would \"intrigue people enough to make them want to watch the rest of the show\". On incorporating the more fantastical elements associated with the Inhumans, Buck said they would be leaned on \"to a certain extent, yes, but again, we approach these all as real people who just happen to have these abilities, so they're all very grounded people. ... We want their powers to seem like a very natural part of their personality.\"[5]\n\nThe season is set both on Earth and in the Inhuman city of Attilan, which is on the Moon,[5][58] and tells an original story inspired by elements from the comics, including Paul Jenkins and Jae Lee's 1998-99 Inhumans series.[62] Buck said that the season's story arc \"will be complete by the end of the season, but also open us up to a whole other potential storyline\".[27] The story puts the characters in situations where using their powers would not help them, to allow the audience to \"view the characters as people with super powers, rather than as superheroes only\".[8] Compared to other superhero series such as Marvel's Netflix series, Inhumans is more appropriate for children, though with some \"parental guidance\".[10] It was reported that the \"underpinning scripts\" were a point of contention between ABC and Marvel for the series,[63] with network executives expressing concern to Marvel early on.[64]\n\nCasting [ edit ]\n\nIn late February 2017, Iwan Rheon was cast as Maximus,[21] followed shortly by Anson Mount as Black Bolt.[4] There was no audition for the role of Black Bolt since the character does not speak, with Mount instead cast due to an existing relationship with Loeb, who felt Mount would fit the role.[65] At the start of March, the series added Serinda Swan as Medusa,[12] Ken Leung as Karnak,[16] Eme Ikwuakor as Gorgon, Isabelle Cornish as Crystal,[17] and Ellen Woglom as Louise.[17][19] During the time from her audition to being cast, Swan had also been cast in the HBO series Ballers, which necessitated a negotiation between the two series to ensure Swan would be allowed to appear on both.[66]\n\nMike Moh and Sonya Balmores were also cast in March 2017 as Triton and Auran, respectively.[17] Also in the month, comic writer Charles Soule indicated that the series would feature some NuHumans as well, including some he created in his Inhuman comic book.[67] In June 2017, Henry Ian Cusick revealed he would be portraying Evan Declan in the series.[32]\n\nDesign [ edit ]\n\nCarlos Barbosa served as production designer for the series, with Adam Davis as art director. The pair are architects who had previously worked together on several feature films.[68] Buck noted that there have been a lot of different looks and designs for the Inhumans since their creation, which allowed the crew to \"pick what was the best and most interesting aspects\" for the adaptation. Davis described the comics as storyboards that gave \"very broad strokes\" from which they developed their own \"visual language\". The series contrasts the \"concrete and dark\" look of Attilan with more colorful scenes set on Earth.[28] The sets of the series were designed and built more vertically than usual to accommodate the IMAX release,[62] and to take advantage of the available space. The sets for Attilan are primarily made from stone, due to the limited building materials that would be available on the moon. Davis said that this 'instinctually' lead them to a combination of expressionism and brutalist architecture when designing the city, which also reflected some of the architecture on Honolulu where the Earth scenes are set. The designers also took inspiration from early Russian architecture and styles from the 1960s such as \"massive pure geometric shapes\". This is shown in rooms such as the Royal Hall, which is based on rectangular shapes; the Quiet Room, which is a circle; and the Control Room, based on equilateral triangles.[68] The sets also include a lot of reflective surfaces, which the crew hoped would \"provide more depth to the images\" from the IMAX cameras.[28][68]\n\nAttilan is surrounded by a protective energy field in the shape of a cone, that projects out images of the moon's surface to camouflage the city, and projects in Earth-like imagery like clouds and sunsets. The cone shape was chosen, rather than a more traditional dome shape, so the Quiet Room where Black Bolt spends much of his time could be directly below the apex of the field, and \"if he accidentally produces any sonic waves, the waves are redirected up the side of the cone and out the apex into outer space\" and away from the city.[28] The set decorations were described as \"slightly futuristic yet quaintly old-fashioned\", with elements such as Ancient Greek-inspired statues of the Inhumans' ancestors present in the Royal Hall. The character's apartments and bedrooms are sparse, \"with only essentials\". Black Bolt and Medusa's bedroom has a view of the whole city.[28] Crystal's bedroom was designed to be able to fit Lockjaw, her 2,000-pound (910 kg) dog; because he can teleport, the set's door frames did not have to be sized to the character, but areas such as where he sleeps in her room did.[61] Roland Sanchez served as costume designer for the series. Rheon called the costumes \"very different\" from how they appear in the comics.[22] For instance, Mount does not wear Black Bolt's comic costume of a black outfit with white accents, tuning fork, and mask.[65] Mount said that this was done to make the character \"more accessible to the viewer ... I'm not sure TV is the space for masks.\"[69] Rheon added that the costumes were intended to look strange to the audience to highlight that the Inhumans have been segregated from Earth and human culture for some time.[22] Special effects make-up was provided by Glenn Hetrick and Neville Page's Alchemy Studios.[70]\n\nFilming [ edit ]\n\nFilming for Inhumans began by March 5, 2017, in Downtown Honolulu,[71] under the working title Project Next,[72][71] with Jeff Jur serving as cinematographer.[73] Studio work for the series took place in Kalaeloa, Hawaii at the former Naval Air Station Barbers Point airfield.[74] Additional filming occurred at Diamond Head,[75] and the Hawaii State Capitol building.[76] The first two episodes of the series were shot on Arri Alexa 65 IMAX 2D digital cameras, to accommodate a debut on IMAX screens,[62][73] with major action sequences from subsequent episodes also being shot using the technology to enhance the overall visual quality of the series.[60][58] A new, wider lens was crafted for the cameras specifically for use on the series.[8][19] The first two episodes were shot over 20 days,[77] with the remaining episodes having eight-day shooting schedules.[78] Filming ended on June 12.[79] It was reported that the series underwent multiple reshoots.[80]\n\nABC, Marvel and IMAX chose to produce Inhumans in Hawaii due to the state's tax incentives for filming, and the strong relationship that Disney and ABC have with the state from previous projects. However, with the sole production studio on the islands, Hawaii Film Studio, in use by Hawaii Five-O, new studio space needed to be developed for the project. The Hawaii State Film Office had been interested in developing the former Naval Air Station Barbers Point airfield into a filming studio, and by early 2017 the space had been leased by Navy Region Hawaii to the Hawaiian Department of Business, Economic Development and Tourism, who subleased the complex to the series' production, allowing the production to begin retrofitting the former airfield into a production facility. Jean Higgins, who previously worked in Hawaii on ABC's Lost as a co-executive producer, serves as producer of Inhumans.[74] Inhumans hired around 150 local workers as production crew,[81] and was expected to provide $80–100 million a year to the Hawaiian economy.[74]\n\nVisual effects [ edit ]\n\nMark Kolpack, visual effects supervisor on Agents of S.H.I.E.L.D., stated he would not be involved with Inhumans due to his commitments on S.H.I.E.L.D., despite introducing the species on that series.[82] Eric Grenaudier serves as visual effects supervisor for the series instead,[62] with seven visual effects studios working on the series.[83] Many of the effects are created by Digital Media.[84] Buck noted that Medusa's hair was a very difficult process and \"takes quite a long time in post to make that effect work\",[5] while Grenaudier added that creating Lockjaw and the city of Attilan were also some of the biggest challenges on the series. He noted that the team was trying to create effects that would hold up on an IMAX screen and be equivalent to those seen in the MCU films but with a television budget and schedule.[61] The results of early visual effects were reported to be a point of contention between ABC and Marvel,[63] and after they were poorly received in the first trailer of the series, resulted in a reported additional $100,000 being spent on Medusa's hair.[80]\n\nLockjaw was created by Double Negative, who director Roel Reiné called \"the best house to do creatures\".[73] A life-sized, blue foam \"stuffy\" was used on set as a stand-in for Lockjaw to help the directors frame shots and the actors interact with the character, while a 360-degree camera was used to take lighting references in each scene to help with lighting the CG version. Double Negative began work on Lockjaw in early February 2017, starting to design the final look of the character and creating a rough, simplistic version that could be added to completed sequences as further reference. Marvel gave approval on the final design for Lockjaw in April 2017, during filming of the series' fifth episode, with Double Negative creating a digital model complete with \"animatics, muscles and textures\". Grenaudier said that Lockjaw \"is going to have to be photo-real and interact in a lot of scenes with environments, with other people that are going to be able to play or touch and react with him—obviously it's been done in movies. I'm not talking about Life of Pi, but to try to [do] that on an episodic schedule on a TV budget, it's putting the bar pretty high.\"[61] For Lockjaw's teleportation effect, Reiné wanted \"something really organic\", and created sketches to pitch \"the idea of how Lockjaw would organically dissolve into a sandburst\", which Buck and Marvel both loved.[26] It was reported that the high cost of producing Lockjaw resulted in the character being removed from the series as it progressed.[80]\n\nMusic [ edit ]\n\nAt the 2017 San Diego Comic-Con, Loeb announced Sean Callery as the composer for Inhumans, after he previously composed the score for Marvel's Jessica Jones.[85] Callery recorded his score for Inhumans with a 68-piece orchestra, the largest he had ever worked with for television. He called his score \"the most thematic I've been with any show I've worked on. At its core, it's about a royal family, so there are some grand themes for the kingdom and the family.\"[86] Callery wrote an \"adventurous\" main theme for the series that was featured in the IMAX release, with a \"very, very abridged version\" used in the television episodes. Callery tried to use the show's music to differentiate between scenes set on Earth and those on the Moon, and took four or five days to compose the music for each episode.[87]\n\nMarvel Cinematic Universe tie-ins [ edit ]\n\nWhen announcing the series, Sherwood said that those behind the project had \"worked very carefully\" with Marvel Studios to ensure that \"content-wise we are only enhancing\" the MCU.[58] Buck noted that \"things that have happened on [Agents of] S.H.I.E.L.D. will potentially affect our show as well\" but cautioned that he was focused on getting the new series \"launched\" before attempting any crossovers with other parts of the MCU.[5] Buck further elaborated, \"This exists all in the same universe. Even if we don't cross paths with, say, Agents of S.H.I.E.L.D. or characters from other shows, they are still out there. We all live in the same world. The same things that applied in other shows and occurred also apply to Inhumans as well.\"[88] Elements carried over from Agents of S.H.I.E.L.D. include the alien writing associated with the Inhumans on that series, and the blue Terrigen crystals, which were designed to be consistent with their depiction on Agents of S.H.I.E.L.D.[62] Loeb noted that Hawaii was chosen as the series' setting, in part because Marvel wanted Inhumans to occur in \"a contained area\" as \"a way to minimize its impact on the rest of the MCU\". He added that, as of the premiere of the series, there were no plans for the characters to interact with the Inhumans on Agents of S.H.I.E.L.D such as Daisy Johnson.[89] The final episode of the series sees the destruction of Attilan and its people becoming refugees on Earth, similarly to Thor: Ragnarok which sees the destruction of Asgard. Both also expressed the same sentiment that a place is its people, not a location.[90][91][92]\n\nMarketing [ edit ]\n\nThe first cast image for the series, featuring Ikwuakor, Leung, Mount, Swan, Cornish, and Rheon in costume, was met with backlash from both fans and critics.\n\nABC, IMAX, and Marvel Television looked to create a joint marketing and promotion plan for the series across their proprietary media platforms, which would be the first such cross-platform marketing launch of a television series.[93] This approach was described by industry analysts as \"a can't-miss cross-platform push\".[60]\n\nA teaser for the series was released ahead of Guardians of the Galaxy Vol. 2 IMAX screenings, as well as online, in early May 2017.[94] It followed the release of a cast photo,[5] which Dana Schwartz at Observer.com called \"pretty lame ... Overall, the look of the entire royal family is 'group that met on Craigslist to try to win a costume contest, with varying levels of commitment'\".[95] James Whitbrook of Gizmodo said \"some of these costumes work way better than others\": Black Bolt \"probably comes out the best\", Crystal \"gets some points for effort\", but Medusa looks \"like she's trying to do a particularly low-budget cosplay of Game of Thrones' Sansa Stark\".[96] Analyzing the response to the series on Twitter, marketing firm Amobee counted 27,000 tweets concerning the series between May 4 and 9, with 17 and 7 percent of that specifically mentioning \"hair\" or \"wig\", respectively, referencing Swan's hair in the photo which was particularly criticized.[95][96] 35 percent of the tweets were deemed negative, and just 26 percent positive, with Amobee principle brand analyst Jonathan Cohen saying, \"The high level of audience engagement in Marvel TV shows is a double-edged sword for the company. On one hand, there's great anticipation around any nugget of information for an upcoming TV series. On the other hand, when a segment of that audience is disappointed, that reaction is magnified\".\n\nThe first trailer for the series was screened exclusively at ABC's advertiser upfront presentation on May 17, 2017. Reactions praised the visuals for Lockjaw and quelled some of the criticism regarding the costumes.[98] The first public trailer was released on June 29, after footage had leaked online from the upfront reveal,[99] and was met to mainly negative reactions.[100][101][102] Cast members appeared at San Diego Comic-Con International 2017 to promote the series, where exclusive footage was shown.[103][19] The panel concluded with an extended trailer for the series, which was also released online, and appeared before IMAX screenings of the film Dunkirk. Fans in attendance at the panel enjoyed the footage,[19] with Swan feeling the positive fan response to the completed effects for Medusa's hair was \"vindication\".[84] However, critics were not as positive about the footage.[104] In August, the first episode was released for critics to view ahead of the series' Television Critics Association (TCA) press tour panel, but initial reactions posted online were shortly taken down.[106] At the TCA event, Dungey and Loeb both addressed criticisms of the first episode's quality.[107][108] The panel was cut short by ABC, and was widely considered by critics in attendance to be \"awkward\" and \"uncomfortable\".[106][109] The Washington Post's Michael Cavna called the marketing for the series at this point \"positively awful\", noting \"the harder the show's sales force tries to scrub the early stench, the more the entire enterprise stinks to some Marvel fans\", and that it would need more \"positive word of mouth\" before its release to entice fans to see the series in IMAX.[110] Later in August, exclusive clips from the series were shown at the Edinburgh International Television Festival.[111]\n\nRelease [ edit ]\n\nTheatrical and broadcast [ edit ]\n\nInhumans held the premiere of its first two episodes (totaling 75 minutes) in Los Angeles at Universal CityWalk on August 28, 2017,[112][113] before debuting on 667 IMAX screens in 67 countries on September 1, 2017.[114][115] It ran for two weeks, though, as with all IMAX releases, each theater \"determine[s] showtimes on a week-to-week basis\", so Inhumans did not remain on IMAX screens at some theaters for the stated two weeks.[116] The episodes premiered in IMAX theaters in Italy and Germany on September 15, and in Korea on September 22,[115] eventually playing on more than 1,000 IMAX screens in over 74 countries.[60] ABC then broadcast the series weekly, starting with the first two episodes on September 29, 2017, with those first two episodes featuring an additional 9 minutes of exclusive content outside of the versions screened on IMAX.[93][113] The first season consisted of eight episodes.[3] CTV acquired the broadcast rights for Canada,[117] while Sky acquired them for the United Kingdom.[118]\n\nRichard L. Gelfond, the chief executive of IMAX, stated IMAX was \"confident our exhibition partners will be excited about this. The response from conceptual conversations has been extremely positive.\"[58] Sherwood added that Disney made sure ABC affiliates were on board with the IMAX debut for the series and that they had worked with Marvel Studios so that the theatrical debut of the series could be timed to not interfere with the release of any MCU films—the theatrical run of the series was between the releases of Spider-Man: Homecoming and Thor: Ragnarok.[58][60]\n\nStreaming [ edit ]\n\nInhumans was available on Disney+ at launch, on November 12, 2019.[119]\n\nReception [ edit ]\n\nBox office [ edit ]\n\nThe IMAX presentation of the first two episodes grossed $3.5 million worldwide.[120] The $3.5 million gross was considered a disappointment by IMAX, with Gelfond noting that the poor reception and gross was based on \"misalignment of customer expectations\", who were expecting \"a production akin to a mega-budget blockbuster movie, rather than pilots for a television show\".[120]\n\nRatings [ edit ]\n\nIn January 2018, Dungey stated the series \"didn't perform for us at the level that we would've wanted\" and that the viewership numbers \"were less exciting for us than we hoped they would be\".[128] The series averaged 4.14 million total viewers, including from DVR, ranking 121st among network series in the 2017–18 television season. It also had an average total 18-49 rating of 1.2, which was 80th.[129]\n\nCritical response [ edit ]\n\nThe review aggregator website Rotten Tomatoes reported an 11% approval rating, with an average rating of 3.70/10 based on 47 reviews. The website's consensus states, \"Marvel's Inhumans sets a new low standard for the MCU with an unimaginative narrative, dull design work, weak characters, and disengaging soapy melodrama.\"[130] Metacritic, which uses a weighted average, assigned a score of 27 out of 100 based on 20 reviews, indicating \"generally unfavorable reviews\".[131] Reviews for the first two episodes that released in IMAX were mainly negative from critics.[132] In his review of the first episodes, TVLine's Matt Webb Mitovich said, \"If the pace and ingenuity [from the second half] continues to ramp up, Inhumans, with just six more episodes to go, could prove to be a serviceable Marvel 'event' series – though maybe not enough so that Agents of S.H.I.E.L.D. fans will forgive that series' delayed return.\"[133] Brian Lowry of CNN noted, \"If the eight-episode Inhumans fails, it could shine a spotlight on the fact Marvel has generally lagged behind\" Warner Bros. Television and DC Comics, who produce the Arrowverse series for The CW.[134]\n\nAfter the release of the final episode, Kofi Outlaw of Comicbook.com said, \"In the end, it's hard to avoid the conclusion that Inhumans is anything but a complete failure - one of the worst that the Marvel Cinematic Universe franchise has ever seen... we've never seen a case like Inhumans, where there was a major IMAX theatrical release that fell flat, before a disappointing TV run.\"[135] James Whitbrook at io9 felt \"Inhumans tried to do a lot of things, and did none of them particularly well\". He continued that he would have been \"amazed\" if the series received a second season, and felt once the fifth season of Agents of S.H.I.E.L.D. returned to present-day Earth from space, the \"Attilan Inhumans could make for a really good season-long plotline. Arguably, that's probably what Inhumans should've been instead of its own messy, miserable show.\"[90] In his review for the final episode, Entertainment Weekly's Christian Holub felt Inhumans \"will probably be forgotten in the greater MCU, though it would be kind of fun to check in on them at some point\".[136] Reviewing the season, Matt Liparota of Destructoid concluded, \"Inhumans is a work with almost nothing of value for anyone. It's not even an interesting train wreck. It's just a boring, lifeless slog easily shooting to the top of the list of the worst things the MCU has produced in its near-decade of existence.\"[137] Marc Buxton of Den of Geek was a bit more positive, feeling Inhumans \"ended up being more enjoyable than the dreadful opening two hours would have indicated\" but was \"still Marvel's first swing and a miss... Inhumans just kind of exists in its own low budget bubble... [that] came and went with a whimper\". Buxton wanted a second season for the series, having enjoyed the cast and some of the characters, and hoped Marvel would have \"lean into a proper Inhumans series and not a half assed one\".[92]\n\nCancellation and future [ edit ]\n\nBy September 2017, Buck had a general plan for the first three seasons of the series and said there would always be different places to take the main characters. He added that there was a set point from where work on a second season would start.[27] Nellie Andreeva of Deadline Hollywood labelled the first season \"underwhelming\", and considered the series \"dead\" by March 2018.[138] On May 11, ABC officially canceled Inhumans.[139]\n\nMount acknowledged rumors in October 2019 that a rebooted version of the Inhumans was being planned for Disney+, potentially starring Vin Diesel (the voice of Groot in the MCU films) who had campaigned to portray Black Bolt before Mount was cast. Mount expressed support for such a reboot, hoping the property would get \"another shot\" with \"the right home, the right tone, and the right vision overall\".[140] Mount reprised his role in the Marvel Studios film Doctor Strange in the Multiverse of Madness (2022), portraying a different version of the character from Earth-838 which is an alternate universe to the main MCU. His costume in the film is closer to its comic book design.[141]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/2/2f/Inhumans_%28TV_series%29_logo.jpg/250px-Inhumans_%28TV_series%29_logo.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Global_thinking.svg/10px-Global_thinking.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/21px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/7/72/Symbol_project_class.svg/16px-Symbol_project_class.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/e/e5/Inhumans_TV_series_cast.jpg/220px-Inhumans_TV_series_cast.jpg", "https://upload.wikimedia.org/wikipedia/en/2/2f/Inhumans_%28TV_series%29_logo.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Dragon-149393.svg/18px-Dragon-149393.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Blank_television_set.svg/21px-Blank_television_set.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Wikipetan-manga.png/21px-Wikipetan-manga.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/2/2f/Inhumans_%28TV_series%29_logo.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Inhumans_(TV_series)", "title": "Inhumans (TV series)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/2/2f/Inhumans_%28TV_series%29_logo.jpg", "width": 640, "height": 361}, "title": "Inhumans (TV series) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}