{"url": "https://hellogiggles.com/awards-events/red-carpet/golden-globes/barbra-streisand-calls-out-golden-globes-women-best-director/", "text": "Tonight, attendees of the 2018 Golden Globes united by wearing black and pins that read “Time’s Up” in support of victims of sexual misconduct. Those subtle yet powerful actions set an empowering tone for women and survivors. And that girl power spilled onto the red carpet and awards stage — meaning we’re now certain that women are about to take over the world. This has, for sure, been one of the most woman-forward Golden Globes to date.\n\nAfter a series of sexual misconduct allegations rocked Hollywood in 2017 — having started with Harvey Weinstein — many in Hollywood called for a female revolution. To make their intentions clear, actresses Laura Dern, Amy Poehler, Susan Sarandon, Meryl Streep, Emma Stone, Emma Watson, Michelle Williams, and Shailene Woodley invited activists to join them at the Golden Globes. These fellow women work toward raising awareness about gender inequality, violence against women, and minority rights, to name just a few causes.\n\nThese actresses and activists, along with other prominent figures in Hollywood, hope to begin a new wave within Hollywood with their Time’s Up movement. Their campaign focuses on bringing awareness to victims of sexual misconduct and to put the spotlight on the survivors rather than the abusers.\n\nThe nation has, no doubt, taken notice of Time’s Up at the Golden Globes, and the powerful female talents to appear. With that, here are some of the most empowering moments for women from the ceremony.\n\n1Viola Davis reminded us that we’re *all* worthy.\n\n“There’s no prerequisite to worthiness,” Davis said on the red carpet. “You’re born being worthy, and I think that’s a message that a lot of women need to hear. The women who are still in silence because of trauma, because of shame, due to the assault, they need to understand that it’s not their fault and they’re not dirty. You know, that’s my message tonight.” It’s certainly an important one, so thank you, Viola.\n\n2Alison Brie made a powerful statement through her fashion.\n\nAlison Brie not only made a powerful statement through her fashion by joining many in wearing black as a statement against harassment, but also by wearing a dress-pants combo (as did Christina Hendricks and others). “Tonight is about women wearing the pants so I chose to literally wear the pants,” she said on the red carpet, and we love her for it.\n\n3Nicole Kidman thanked her mother for advocating for women’s rights.\n\nWinner of the Golden Globe for Best Performance by an Actress in a Limited Series Nicole Kidman also revealed that she and her Big Little Lies costars, Reese Witherspoon, Zoë Kravitz, Laura Dern, and Shaleine Woodley pledged allegiance to each other. The girl power here is real.\n\n4Rachel Brosnahan asked us to hold each other accountable.\n\nBrosnahan won the Golden Globe for Best Performance by an Actress in a Television Series for her role in The Marvelous Mrs. Maisel. In her speech, she asked Hollywood to invest, make, and champion women’s stories. Yes, please.\n\n5Elisabeth Moss dedicated her win to Margaret Atwood and the others who speak out against injustice.\n\nMoss won a Golden Globe for Best Performance by an Actress in a Dramatic Television Series for her work in The Handmaid’s Tale. She quoted Margaret Atwood who wrote in the novel, “We were the people who were not in the papers. We lived in the blank white spaces at the edges of print. It gave us more freedom. We lived in the gaps between the stories.”\n\n6The Handmaid’s Tale wins for Best Dramatic Television Series.\n\nThe Handmaid’s Tale’s win shows that people are paying attention and heeding Atwood’s warning about anti-feminist, anti-equal world that seems scarily not so far from reach.\n\n7Laura Dern urges us to speak up and support survivors.\n\nDern won Best Supporting Actress in a TV Series or Movie for her work in Big Little Lies. During her acceptance speech she said, “Speaking out without the fear of retribution is our culture’s new North Star.” Amen, Laura Dern. Amen!\n\n8Oprah Winfrey became the first black woman to receive the Cecil B. DeMille Award\n\nOprah was awarded with the Cecil B. DeMille Award and brought us to actual tears with her moving acceptance speech. “In 1982 Sidney [Poitier] received the Cecil B. DeMille award right here at the Golden Globes and it is not lost on me that at this moment, there are some little girls watching as I become the first black woman to be given this same award,” she said. Not to mention: “I want all the girls watching here now to know that a new day is on the horizon!”\n\n9Natalie Portman called out the Golden Globes for its all-male directing category\n\nWhile presenting the nominees for Best Director: Motion Picture, Portman drew attention to the fact that no women were nominated in the category. “And here are the all-male nominees,” she said. It was quick, but poignant. And we love her for it.\n\n10Reese Witherspoon was one of many women to effectively say, “Time is Up”\n\nBig Little Lies was awarded with the Best Limited Series prize and while accepting with her cast and crew, Witherspoon — a major figure at the center of the Time’s Up initiative — said, “I want to thank everyone who broke their silence this year and spoke up about abuse and harassment. You are so brave and hopefully shows like this, more will be made, so people out there who are feeling silenced by harassment, discrimination, abuse, time is up. We see you, we hear you, and we will tell your stories.”\n\n11Barbra Streisand drew attention to the Globes’ lackluster history with female directors\n\nStreisand was on hand to announce the winner of the final award of the night — Best Motion Picture. But before she did, she drew attention to how few female directors have been nominated in the Globes’ history. “I’m the only woman to get the best director award,” she said of the awards show at hand. “That was 1984 [for Yentl], that was 34 years ago. Folks, time’s up!”\n\nTime’s up, indeed!", "images": ["https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/easy-fall-cocktails-1.jpg?quality=82&strip=all&w=198&h=178&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Dog-Halloween-Costume.jpg?quality=82&strip=all&w=198&h=178&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Kim-Kardashian-Kanye-West.jpg?quality=82&strip=all&w=183&h=133&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Taylor-Swift.jpg?quality=82&strip=all&w=198&h=178&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/jojo-siwa-1.jpg?quality=82&strip=all&w=183&h=133&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/jessica-knoll-chiara-Aurelia-Mila-Kunis-Finn-Wittrock-1.jpg?quality=82&strip=all&w=198&h=178&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Dog-Halloween-Costume.jpg?quality=82&strip=all&w=183&h=133&crop=1", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' width='198' height='178'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' width='183' height='133'%3E%3C/svg%3E", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Serena-Williams-Olympia.jpg?quality=82&strip=all&w=183&h=133&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Zooey-Deschanel.jpg?quality=82&strip=all&w=183&h=133&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2018/01/08/lies-e1515386926103.jpg?quality=82&strip=1&resize=640%2C360", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Taylor-Swift.jpg?quality=82&strip=all&w=183&h=133&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/easy-fall-cocktails-1.jpg?quality=82&strip=all&w=183&h=133&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/jojo-siwa-1.jpg?quality=82&strip=all&w=198&h=178&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/jessica-knoll-chiara-Aurelia-Mila-Kunis-Finn-Wittrock-1.jpg?quality=82&strip=all&w=183&h=133&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Kim-Kardashian-Kanye-West.jpg?quality=82&strip=all&w=198&h=178&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Serena-Williams-Olympia.jpg?quality=82&strip=all&w=198&h=178&crop=1", "https://hellogiggles.com/wp-content/uploads/sites/7/2018/01/08/lies-e1515386926103.jpg?quality=82&strip=all", "https://hellogiggles.com/wp-content/uploads/sites/7/2022/10/Zooey-Deschanel.jpg?quality=82&strip=all&w=198&h=178&crop=1"], "top_img": "https://hellogiggles.com/wp-content/uploads/sites/7/2018/01/08/lies-e1515386926103.jpg?quality=82&strip=all", "keywords": [], "authors": ["Olivia Harvey"], "canonical_link": "https://hellogiggles.com/golden-globes-11-empowering-moments-women/", "title": "Golden Globes 2018: 11 most empowering moments for women", "meta_data": {"viewport": "width=device-width", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "The 2018 Golden Globes were incredibly empowering for women. Here are some of the most powerful moments from the awards show.", "og": {"locale": "en_US", "type": "article", "title": "Golden Globes 2018: 11 most empowering moments for women", "description": "The 2018 Golden Globes were incredibly empowering for women. Here are some of the most powerful moments from the awards show.", "url": "https://hellogiggles.com/golden-globes-11-empowering-moments-women/", "site_name": "HelloGiggles", "image": {"identifier": "https://hellogiggles.com/wp-content/uploads/sites/7/2018/01/08/lies-e1515386926103.jpg?quality=82&strip=all", "width": 1000, "height": 717, "type": "image/jpeg"}}, "article": {"published_time": "2018-01-08T02:16:46+00:00", "modified_time": "2022-09-17T15:44:59+00:00"}, "author": "olivia harvey", "twitter": {"card": "summary_large_image", "label1": "Written by", "data1": "olivia harvey", "label2": "Est. reading time", "data2": "5 minutes"}, "msapplication-TileColor": "#b58c2c", "msapplication-TileImage": "https://hellogiggles.com/wp-content/themes/hello-giggles/favicon/ms-icon-144x144.png", "msapplication-config": "https://hellogiggles.com/wp-content/themes/hello-giggles/favicon/browserconfig.xml", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1515377806.0, "source": "https://hellogiggles.com", "summary": ""}