{"url": "https://web.archive.org/web/20170530061237/http://www.ibtimes.com/who-navi-michael-jackson-impersonator-play-king-pop-lifetime-biopic-2545084", "text": "Navi, who claims to be the world’s number one Michael Jackson impersonator, stars in Lifetime’s movie called “Michael Jackson: Searching for Neverland,” which premiered on May 29. This was Navi’s acting debut, but he has a long affinity to the king of pop.\n\nNavi has been performing as MJ for over 20 years and also worked with the artist as his decoy and was the only impersonator to be invited to Neverland Ranch on the pop icon’s 45th birthday.\n\nRead: Michael Jackson's Kids: Grandma Katherine Raised The Late Pop Icon's Three Children\n\nOn Navi's official website, his biography proclaims that he's “the world's number one Michael Jackson impersonator.”\n\nHis website also states “Navi is the ONLY Michael Jackson tribute that Jackson has applauded on several occasions, given a standing ovation to, invited to his home Neverland, and personally chosen to work as a decoy over a period of many years.”\n\n“Searching for Neverland” portrays the king of pop at the end of his life before he died in 2009. The movie is based on “Remember The Time: Protecting Michael Jackson in His Final Days” by Bill Whitfield, Javon Beard and Tanner Colby. Whitfield and Beard were Jackson’s bodyguards during the last two years of the pop icon’s life. The book focuses on helping Jackson and his children stay out of the paparazzi’s eyes.\n\nNavi told ABC News that he had worked for Jackson as a decoy and the pop icon sometimes has even used him as a body double in order to escape the paparazzi’s eyes.\n\n“I’ve got the most famous face in the world and it’s not mine,” Navi said adding “When I worked for him as a decoy, you know, 2,500 people chasing me and being scared for your life.\"\n\n“I worked for him during the allegations; I worked for him during the promotions of albums and tours. I went to [Jackson’s ranch] Neverland, I did his birthday party, I performed at his birthday party in New York and Los Angeles,” Navi further said.\n\nNavi had spent almost four hours in hair and makeup every day in order look like Jackson while filming for the movie, “Searching for Neverland.” However, he said it was not difficult for him to get into the character because the pop icon had encouraged him a lot during their time together.\n\n“He's very encouraging. He would say, ‘You’re an amazing dancer, do you practice every day?’” Navi continued.\n\n“And I said, ‘Mike, you’re an amazing dancer.’ And he was like, ‘Really? You think so?’ But he was sincere about it and I was thinking, ‘Is this guy kidding me or what?’ … He was so insecure, but when he gets on stage he’s in total command.”\n\nNavi also told ABC News that he accepted the offer to act in the movie because he wanted a platform to let the world know about the man he knew so well. “He’s human, he’s a person, he has emotions and feelings,” Navi said.\n\nDuring an interview with Entertainment Weekly, Navi said that after playing his idol for 28 years on stage, he would retire from the role after the movie airs. He told Entertainment Weekly that he feels as if his career had been leading up to this moment where he could make this film to “do something back for Jackson” and get a chance to show people the last few years of the pop star's life.\n\n“I’m the Michael fan who stood outside the trial at the courthouse in Santa Maria with a sign that said, ‘Smooth, but not a criminal,’” Navi said. “When Michael passed away, I was at the Conrad Murray trial… because I’m a Michael fan and I wear it on my sleeve,” he added.\n\nHe continued, “You’d think that would be the best swan song, but for me, it was this opportunity. If these 28 years [of impersonation] were building up to have this one moment, I’ll accept that, and I’m happy to walk away from the Jackson thing now. I’m happy to be done because I had an opportunity to do something back for Michael.”\n\nNavi underwent plastic surgery to transform into Jackson. However, he stopped the procedures in 2015 and said he would never be able to look exactly like the star, Stuff.co.nz reported.\n\n“I could have gone thinner with the nose, I could have gone bigger with the jawline,” Navi said in 2015. “I could have been precise but I wouldn’t have been Michael Jackson and I wouldn’t have been able to pull it off like him. Even though he went over the top with it and he knew that himself. I always wanted to be the good-looking version of Michael Jackson,” he added.", "images": ["https://web.archive.org/web/20170530061237im_/http://s1.ibtimes.com/sites/www.ibtimes.com/files/2017/05/29/gettyimages-71761009.jpg"], "top_img": "https://web.archive.org/web/20170530061237im_/http://s1.ibtimes.com/sites/www.ibtimes.com/files/2017/05/29/gettyimages-71761009.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20170530061237/http://www.ibtimes.com/who-navi-michael-jackson-impersonator-play-king-pop-lifetime-biopic-2545084", "title": "Who Is Navi? Michael Jackson Impersonator To Play King Of Pop In Lifetime Biopic", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, maximum-scale=1, user-scalable=no", "news_keywords": "michael jackson, navi wiki, michael jackson impersonator, searching for neverland movie, remember the time: protecting michael jackson in his final days, michael jackson movie, michael jackson biopic,", "fb": {"app_id": 263851690471857, "pages": 128026713884051}, "og": {"type": "article", "site_name": "International Business Times", "url": "https://web.archive.org/web/20170530061237/http://www.ibtimes.com/who-navi-michael-jackson-impersonator-play-king-pop-lifetime-biopic-2545084", "title": "Who Is Navi? Michael Jackson Impersonator To Play King Of Pop In Lifetime Biopic", "description": "On Navi's official website, his biography proclaims that he's “the world's number one Michael Jackson impersonator.” Navi was the only impersonator to be invited to MJ's home in Neverland on the occasion of Jackson's 45th birthday.", "image": "https://web.archive.org/web/20170530061237im_/http://s1.ibtimes.com/sites/www.ibtimes.com/files/2017/05/29/gettyimages-71761009.jpg"}, "article": {"publisher": "https://www.facebook.com/IBTimes", "section": "Entertainment", "author": "https://www.facebook.com/shreesha.ghosh", "modified_time": "2017-05-30T00:14:20-04:00", "published_time": "2017-05-30T00:14:20-04:00"}, "twitter": {"site": "@IBTimes", "card": "summary_large_image", "title": "Who Is Navi? Michael Jackson Impersonator To Play King Of Pop In Lifetime Biopic", "url": "https://web.archive.org/web/20170530061237im_/http://www.ibtimes.com/who-navi-michael-jackson-impersonator-play-king-pop-lifetime-biopic-2545084", "description": "On Navi's official website, his biography proclaims that he's “the world's number one Michael Jackson impersonator.” Navi was the only impersonator to be invited to MJ's home in Neverland on the occasion of Jackson's 45th birthday.", "image": "https://web.archive.org/web/20170530061237im_/http://s1.ibtimes.com/sites/www.ibtimes.com/files/2017/05/29/gettyimages-71761009.jpg"}, "msapplication-TileColor": "#000000", "msapplication-TileImage": "http://s1.ibtimes.com/sites/www.ibtimes.com/themes/us_ibtimes/favicons/mstile-144x144.png", "msapplication-config": "http://s2.ibtimes.com/sites/www.ibtimes.com/themes/us_ibtimes/favicons/browserconfig.xml", "description": "On Navi's official website, his biography proclaims that he's “the world's number one Michael Jackson impersonator.” Navi was the only impersonator to be invited to MJ's home in Neverland on the occasion of Jackson's 45th birthday.", "com.silverpop.brandeddomains": "www.pages06.net,aidataconf.com,amp.ibtimes.co.uk,e-amp.newsweek.com,e-sns.newsweek.com,europe.newsweek.com,events.newsweek.com,ibt-dev.co.uk,ibtimes.co.uk,ibtimes.com,idigitaltimes.com,latintimes.com,medicaldaily.com,newsweek.com,player.one,sns.europe.newsweek.com,sns.ibtimes.co.uk,subscription.newsweek.com,www.ibt-dev.co.uk,www.ibtimes.co.uk,www.ibtimes.com"}, "movies": [], "publish_date": 1496117660.0, "source": "https://web.archive.org", "summary": ""}