{"url": "https://www.celebritynetworth.com/richest-celebrities/actors/emilio-estevez-net-worth/", "text": "What is Emilio Estevez's Net Worth?\n\nEmilio is an American actor who has a net worth of $18 million. He is best known for being a member of the Brat Pack, which was a group of prominent actors that frequently appeared together in movies in the 1980s.\n\nEarly Life\n\nEmilio Estevez was born in The Bronx, New York City, on May 12, 1962. He is the oldest child of the artist Janet Sheen and the actor Martin Sheen. He has three siblings: Ramon Estevez, Charlie Sheen, and Renée Estevez. His father Martin's legal name is actually Ramón Estévez, but only one of his siblings, Charlie, adopted their father's stage name as his own last name. Reportedly, Estevez chose to keep his own name and not adopt a stage name for two reasons: he liked the sound of his double 'E' initials, and he wanted to distance himself from being known as \"Martin Sheen's Son\" in his own career.\n\nGrowing up in New York City, Estevez originally was enrolled in the NYC public school system. However, after his father's acting career took off, he switched to private school. His family eventually then moved to California in 1968 after his father was cast in \"Catch-22\", and Estevez attended Santa Monica High School in Malibu, California. He first began acting in high school productions, and after he graduated from high school in 1980, he pursued a career in acting instead of going to college.\n\nActing Career\n\nEstevez's stage debut was in a production of \"Mister Roberts\" in Jupiter, Florida, alongside his father. Then, in 1982, he starred in the ABC-TV film \"In the Custody of Strangers\". As a young actor in the 1980s, Estevez rose to fame as a leading member of the Brat Pack, a group of actors including Rob Lowe, Anthony Michael hall, Demi Moore, Judd Nelson, Andrew McCarthy, Molly Ringwald, and Ally Sheedy, among others. During this period, Estevez starred in Brat Pack films like \"The Outsiders\" (1983), \"The Breakfast Club\" (1985), and \"St. Elmo's Fire\" (1985). Other non-Brat Pack films he also starred in during this time include \"Tex\" (1982), \"Nightmares\" (1983), \"Repo Man\" (1984), \"That Was Then, This Is Now\" (1985), \"Maximum Overdrive\" (1986), \"Stakeout\" (1987), and the two westerns \"Young Guns\" (1988) and \"Young Guns II\" (1990).\n\nEstevez went on after the heyday of the Brat Pack to star in films like \"The Mighty Ducks\" (1992), which was one of Disney's most successful franchises at the time and enjoyed two equally popular sequels: \"D2: The Mighty Ducks\" (1994) and \"D3: The Mighty Ducks\". He also starred in \"Judgment Night\" (1993), \"Loaded Weapon 1\" (1993), \"Another Stakeout\" (1993), \"Late Last Night\" (1999), \"Sand\" (2000), and The L.A. Riot Spectacular\" (2005). He has also worked with both his brother Charlie Sheen, and his father Martin Sheen, on a number of projects. He wrote, directed, and starred alongside his brother Charlie in the comedy \"Men at Work\" (1990). In 1996, he directed and starred in \"The War at Home\", and his father Martin played the father of his character. Estevez has also ventured into the world of voice acting. He voiced the role of Ferryman in the English dub of \"Arthur and the Invisibles\" (2006), and also helped create the English dubbed version of \"The 3 Wise Men\" (2003). Lastly, he has appeared on television in small roles, most notably as a guest star on his brother's sitcom, \"Two and a Half Men\".\n\nDirecting Career\n\nIn addition to acting, Estevez has enjoyed a very successful career as a movie director. He made his directorial debut in 1986, with the movie \"Wisdom\". He actually also wrote and starred in it, which made him the youngest person at the time to write, direct, and star in a major motion picture all at once. Other films he has worked on as a director include \"Bobby\" (2006), \"The Way\" (2011), and \"The Public\" (2018). Projects such as \"The Way\" were produced under his production company, Estevez Sheen Productions, with is affiliated with Warner Bros. In particular, \"Bobby\" was a challenging project for him because it took him over six years to write, and he also almost went bankrupt because domestic box office sales in the US were so low they did not cover all of the film's production costs. Despite these challenges though, for his work on \"Bobby\" he won a Hollywood Film Award, increased his fanbase in Europe, and also received a standing ovation at the Venice Festival. In addition to directing movies, he has also directed episodes for shows like \"Cold Case\", \"Close to Home\", \"The Guardian\", \"CSI: NY\", and \"Numb3rs\".\n\nPersonal Life\n\nEstevez dated model Carey Salley until 1986. Together, they have two children: a son, Taylor Levi Estevez, and a daughter, Paloma Rae Estevez. When Taylor had his first son in 2019, Estevez became a grandfather for the first time. From April 1992 to May 1994, Estevez was married to the singer/choreographer Paula Abdul. Abdul has stated that one of the reasons behind their split was that she wanted children and he did not, since he already had two from a previous relationship. He has also dated actress and his fellow Brat Pack member Demi Moore, and they were briefly engaged at one point. They have maintained a good relationship even after breaking up, and even starring together as a feuding married couple in the film \"Bobby\" (2006).\n\nEstevez is a close friend of Jon Bon Jovi, and has appeared in multiple Bon Jovi music videos. These include the music videos for \"Blaze of Glory\" and \"Say It Isn't So\".\n\nReal Estate\n\nIn the early 2000s, Emilio paid $2.2 million for a home in Malibu. He listed it at one point for $10 million. In December 2016 Tool drummer Danny Carey bought the house for $6.35 million.", "images": ["https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/wp-content/uploads/2010/01/ee.jpg", "https://vz.cnwimg.com/wp-content/uploads/2010/01/em.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw=="], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2010/01/em.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/emilio-estevez-net-worth/", "title": "Emilio Estevez Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Emilio Estevez Net Worth: Emilio Estevez is an American actor who has a net worth of $18 million. Born on May 12, 1962 in Staten Island, New York", "cnw_share_fb_count": 27, "cnw_share_tw_count": 15, "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Emilio Estevez Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/emilio-estevez-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/01/em.jpg", "site_name": "Celebrity Net Worth", "description": "Emilio Estevez Net Worth: Emilio Estevez is an American actor who has a net worth of $18 million. Born on May 12, 1962 in Staten Island, New York"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2022-06-08T20:51:31+00:00", "published_time": "2020-07-17T17:22:13+00:00", "section": "Actors", "tag": "richest actors"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/01/em.jpg", "title": "Emilio Estevez Net Worth", "description": "Emilio Estevez Net Worth: Emilio Estevez is an American actor who has a net worth of $18 million. Born on May 12, 1962 in Staten Island, New York"}}, "movies": [], "publish_date": 1595006533.0, "source": "https://www.celebritynetworth.com", "summary": ""}