{"url": "https://www.cosmopolitan.com/uk/entertainment/a13561434/taylor-swift-joe-alwyn-relationship-timeline/", "text": "Taylor Swift and Joe Alwyn have been dating for a while now, but thanks to his super guarded approach to talking about his personal life, their relationship has mostly stayed shrouded in mystery.\n\n\n\nBut the longer they're together, the more fans are learning about their romance - from Joe's appearance in Taylor's Netflix documentary, to his writing credits on her albums, which were written during London's coronavirus lockdown.\n\nHere's a timeline with as much information as we could find about Taylor Swift and Joe Alwyn's relationship, dating back to 2016.\n\n11 May 2022: Joe spoke out about how Taylor feels about all his sex scenes in new Sally Rooney series Conversations with Friends, because watching your partner of six years sleeping with a bunch of people on TV can't be easy.\n\nWell, it turns out Taylor was basically ready for it, not only has she read the book but she's a huge fan of the whole thing of Joe's work on the series in general.\n\nELEMENT PICTURES/ENDA BOWE\n\n\"I mean she's read the book and she loves the book so she knows it,\" Joe told Extra after being asked about Taylor's response to his sex scenes with costar Alison Oliver. \"She just like couldn't be a bigger fan of the project.\"\n\nSupportive and cute!\n\n\n\nHere's the rest of Taylor and Joe's relationship timeline:\n\n3 May 2016: So where Joe and Tay met isn't 100% clear, which makes the start date to this timeline a tad tricky but, bear with us.\n\nIt's May, 2016 and both attend the Met Gala. I know what you're thinking, this link may seem tenuous given that the whole of Hollywood goes BUT Swift's new song 'Dress' - where she sings: 'Flashback to when you met me/ Your buzz cut/ And my hair bleached' -has provided some fans with the theory that the 2016 event could be significant.\n\nGetty Images\n\nA-ha! At the gala, Joe's hair is certainly shorter and Taylor rocks a bleached blonde bob...\n\n\n\nHowever, this Met Gala is also seemingly full of Taylor-related events as a video of her and (soon to be boyfriend) Tom Hiddleston having a dance-off to Beyonce's Crazy in Love does the rounds on the internet.\n\nJust a month later, she announces she has broken up with boyfriend of a year Calvin Harris and weeks later she's pictured kissing Tom Hiddleston. 'Hiddleswift', as they become to be known, break up in September, 2016.\n\n12 October 2016: Taylor and a whole load of squad members (Is the squad still a thing?) including Lorde, Cara Delevingne, Dakota Johnson and Martha Hunt attend a secret Kings of Leon concert in New York City. It's widely reported that Joe was also there and this is the place where the couple meet.\n\nTaylor and Dakota Johnson in NYC on October 12, 2016 Getty Images\n\n12 November 2016: Taylor is papped going to watch a film with her mother and two of the Haim sisters Este and Alana in Los Angeles. And what film is this? Only Joe Alwyn's film Billy Lynn's Long Halftime Walk.\n\nCoincidence orrrrr?\n\n16 May 2017: Unfortunately, we can't fill you in on what specifically happened over the six months between November 2016 and May 2017 because the couple were so darn good at hiding their relationship.\n\nIn May, the story of their relationship finally breaks. The Sun reports that the pair have been dating in secret for months (seems about right) and that Taylor is \"besotted\" with him.\n\nThey add that she's been spending lots of time in London with him, using wigs, scarves and hats as a disguise.\n\n\"Taylor and Joe are the real deal, this is a very serious relationship,\" a source tells the newspaper. \"...Taylor has flown in via private jets and her security has made it a military-like mission to prevent her from being seen.\"\n\n1 June 2017: As well as Taylor's Mission Impossible-style visits to the UK, Joe also flies to see Taylor in New York, reports E! News.\n\n\"Taylor and Joe have really tried to be on lockdown and have spent most of their time together in private locations where they could get to know each other without the pressure of a public relationship and people making judgement calls,\" a source tells the outlet.\n\n2 June 2017: E! News covers the story a day later, reporting that Joe has finally met... the squad.\n\nTaylor Swift and said ’squad’ at the 2015 VMAs Getty Images\n\nApparently, Selena Gomez and Gigi Hadid, as well as other \"close friends\", had the pleasure of meeting and getting to know their pals' new beau.\n\n5 June 2017: Taylor and Joe are pictured together for the first time in a paparazzi shot. The two are seen enjoying coffee on a balcony in Nashville, Tennessee and Taylor is smiling. Cute! It's reported that Joe is there to meet the parents. Dun dun dunnnn.\n\nAs well as this, reports that Taylor is house-hunting in London - the city where none other than bloomin' Joe lives - also do the rounds.\n\n26 July 2017: Taylor and Joe are photographed again, however, this time they're really trying not to be. Pictures in the Mail Online show the couple wearing hoodies and keeping their eyes to the ground as they leave the singer's New York City apartment.\n\n5 September 2017: Taylor is back with new music and everyone is freaking out trying to guess who and what all the songs are about. After all, she's had a fairly eventful couple of years since her last album.\n\nOne song '...Ready for It?' has fans divided over whether it's about Joe or her former love interest Harry Styles. But then... according to Buzzfeed, Taylor reportedly likes a Tumblr post breaking down the lyrics, with all signs pointing to them being about Joe.\n\n21 September 2017: The secret transatlantic visits show no slowing down and they've reportedly been made easier by Taylor's famous mates.\n\nAccording to The Sun, Cara Delevingne hosted the couple at her house in west London so that they could continue to keep the whole thing on the DL while visiting Joe's family and friends.\n\nTaylor and Cara in NYC in September 2016 Getty Images\n\n\"She's trying to keep a low profile with Joe and staying with Cara has let her do that,\" a source told the tabloid. \"... They can even walk Cara's dog round the local park without anyone batting an eyelid.\"\n\n20 October 2017:\n\nAnother song from Taylor's forthcoming album Reputation drops and it's called 'Gorgeous'. According to fans, Taylor told them the song was about Joe during one of her secret listening sessions.\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nTaylor told fans at the secret sessions that #Gorgeous is about her boyfriend Joe pic.twitter.com/4mxHSz9neL — Taylor Swift News 🕰️ (@TSwiftNZ) October 20, 2017\n\nLyrics include: \"You should take it as a compliment / That I got drunk and made fun of the way you talk / You should think about he consequence / Of your magnetic field being a little too strong /And I got a boyfriend, he's older than us.\"\n\nFirstly, Joe is British and Taylor is American which could explain the whole making fun of the way you talk thing. Secondly, her two previous boyfriends have been in their 30s and therefore older than Joe.\n\n26 October 2017:\n\nTaylor's BFF Ed Sheeran pipes up, telling a radio station he thinks Joe is a \"good dude\".\n\nTaylor and Ed at the 2016 Grammy awards Getty Images\n\nGiving the seal of approval, the 'Shape of You' singer tells Capital London's Breakfast Show: \"He's really nice. Really, really friendly, really good dude\".\n\n3 November 2017: The fourth song from Reputation drops and this time it's 'Call It What You Want' which fans think seems to include a mix of references about both the Kimye feud and Joe.\n\nHere are the lyrics which might be about Joe:\n\n\"My baby's fly like a jet stream/ High above the whole scene\" - potentially referencing that Joe is not as famous as some of Swift's previous love interests.\n\n10 November 2017: Taylor's 15-track album is released in full, proving plenty more lyrics for us to try and dissect. Among the many fan theories pointing to lines about Joe, a couple are:\n\n'Don't Blame Me': \"I've been breaking hearts a long time, and toying with them older guys just to play things for me to use / Don't blame me, your love made me crazy / My drug is my baby / I'll be using for the rest of my life\"\n\nThe fact that Taylor seems to talk about the future in the last line indicates she's singing about a current relationship, i.e. her and Joe.\n\n'Delicate': \"My reputation's never been worse, so you must like me for me / Dark jeans and your Nikes, look at you / Oh damn, never seen that colour blue.\"\n\nIt's fair to say Taylor's public reputation took a bash during the time she met Joe, which she could be hinting at when she describes how the mysterious subject of the song was into her regardless.\n\nHe also has very blue eyes, we might add.\n\n\n\n6 April 2018: Taylor is reportedly keen to buy a £30m house in north London's Crouch End, so she can \"set down roots\" near where Joe and his family live.\n\nA source told The Sun: “Taylor loves the UK and how she can live a relatively normal life without being disturbed,\" the source said. “Setting down roots is something she’s thought long and hard about. She’s set aside £30million ($42million) to find the house of her dreams, which she hopes to one day settle down in with Joe if their relationship continues to grow.\"\n\n29 September 2018: Taylor and Joe are spotted hand-in-hand heading towards the singer's New York City apartment together.\n\nJackson Lee Getty Images\n\n22 November 2018: Would you believe it? Taylor is actually tagging Joe in a post on Instagram! It's all to promote his new movie The Favourite, which he stars in with Olivia Coleman, Emma Stone and Nicholas Hoult. Taylor calls the film \"phenomenal\" and tells her followers to go see it.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n11 December 2018: aTaylor Swift managed to slip into the London premiere of Joe's move Mary Queen Of Scots, and no one noticed. Well, until Izuka Hoyle, who plays courtier Mary Seton, shared an Instagram Story of the pair chatting in the cinema's lobby, along with the caption, \"Romeo take me somewhere we can be alone\".\n\nInstagram Stories\n\nWhile fans are desperate for their first official red carpet moment for Joe and Taylor, a source told The Sun the singer didn't want to distract from her boyfriend's achievements.\n\n\"Taylor didn't want to draw attention to herself because it was really Joe's night\", the insider commented. \"But she did want to support him and knew he would appreciate her being there, so she took steps to try and prevent anyone knowing she was there.\n\n\"It worked in the dark of the cinema but by the time they made it to the party afterwards her cover was blown.\"\n\n6 January 2019: A new year and yet Taylor and Joe still appear to be going strong. The two attended the Golden Globes, separately, of course and then hit up several after-parties following the show.\n\nAll eyes on Taylor at the 2019 InStyle and Warner Bros party Donato Sardella Getty Images\n\nTaylor was spotted at the InStyle/Warner Bros party - where she posed on the red carpet - and then at Fox's and Netflix's soirees, as was Joe. At the Netflix afterparty, \"Taylor Swift, was the star of the party, sitting in a VIP area next to [Netflix CCO Ted] Sarandos. At one point, Sarandos approached Swift and her boyfriend Joe Alwyn to ask for a photo with the star. Swift obliged, but was quickly met with more and more photo requests from other attendees at the party. Security called for backup to her section to give her some privacy, but Swift and Alwyn left the event shortly after,\" per The Hollywood Reporter.\n\nJoe at the FOX, FX And Hulu 2019 Golden Globe Awards After Party Phillip Faraone Getty Images\n\nA reporter for Entertainment Tonight also told his Twitter followers how he'd witnessed \"Joe Alwyn give Taylor Swift a kiss at the Fox afterparty\". Cute!\n\n17 January 2019: Given that Joe is in every film under the sun at the start of 2019 (well, it feels like it, he has parts in The Favourite and Mary Queen of Scots) he conducts some interviews to promote these movies.\n\n\n\nIn one with , he objects to being labelled \"strangely private\" over his and Taylor's refusal to discuss their relationship. He tells the magazine he doesn't think he's had to \"fight for his privacy\" more than anyone else in the public eye and it seems like he's just of the opinion he doesn't have to share one of the more personal sides of his life with the rest of the world.\n\n\"I don't think anyone you meet on the streets would just spill their guts out to you, therefore why should I?\" he says. \"And then that is defined as being 'strangely private'. Fine. But I don't think it is. I think it's normal.\"\n\n10 February 2019: Taylor skipped the Grammys so she could support Joe at the BAFTAs, where his film, The Favourite, won like a million awards. Look how sweet they look together!\n\nGetty Images\n\nGetty Images\n\nPlus, Taylor posted this sweet message on Instagram...\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n24 February 2019: Taylor and Joe reportedly attended not one, not two, but THREE pre-Oscars parties together.\n\nThey were spotted at the Night Before party and the CAA bash as well as another event, with Perez Hilton claiming it was \"PDA all over the place\".\n\n\"Taylor Swift hit up three parties with her boyfriend Joe Alwyn,\" Perez told Australian radio show KIIS FM's Kyle & Jackie O.\n\nHe added: \"They went to such great lengths in 2018 to every avoid being seen in public together. Now finally not only are they going to events and supporting each other. But PDA all over the place.\n\nJoe at the 2019 Oscars Getty Images\n\n24 February 2019: While Joe Alwyn attended the Oscars alone, he was later joined by Taylor Swift at the Vanity Fair party. Other party goers went to great lengths to document the singer's presence, with one catching a lowkey moment of PDA between the pair on video. Adorable.\n\n21 March 2019: Despite it making it very very hard for fans to get updates on how their relationship is going, being secretive is apparently the key to making things work between Taylor Swift and Joe Alwyn.\n\nAccording to a source atPeople, \"Keeping it private from the beginning really helped their relationship. They were able to get to know each other in peace.\"\n\nGetty Images\n\nWhile there are rumours going around that Joe is planning a proposal, Taylor is apparently just happy to be with him whatever happens. \"Taylor really got lucky to meet Joe, and she is the first one to say it,” a source said. “Joe really is one of a kind.”\n\nThe insider added that \"They have a very special relationship. Joe adores Taylor\", before commenting on the fact they're \"very compatible,\" \"respectful\" of each other’s careers, and \"so sweet\" together.\n\nALRIGHT GUYS. We get it. Anyone else feeling very very single right now?\n\n\n\n17 July 2019: Joe has been supporting Taylor during all this nasty Scooter Braun business.\n\nA source told Hollywood Life, \"Taylor‘s loved ones have all rallied around her to support her through this battle, she is not alone in this fight. Her boyfriend Joe has been a total rock in all of this, he is very supportive of her taking a stand… he has got a strong backbone.\"\n\nThe source added: \"Taylor has always been pretty fearless when it comes to speaking her truth but having such a solid and healthy relationship makes her feel that much stronger. What she is going through with Scooter is so challenging, but the good news is that her personal life is all smooth sailing. She is very grateful for that.\"\n\n12 August 2019: Taylor fans think the singer is secretly engaged to Joe, after she shared some particularly telling lyrics from her new album with Vogue.\n\nIn the track, which they describe as both 'haunting' and 'romantic', Taylor sings, \"My heart’s been borrowed and yours has been blue. All’s well that ends well to end up with you.\"\n\nSomething borrowed? Something blue? End up with you? Certainly sounds like a hint towards marriage, doesn't it? Well, Taylor's fans definitely think so, with many taking to Twitter to speculate about whether the singer just announced her engagement.\n\n\"HOLD UP SOMETHING BORROWED SOMETHING BLUE? MS.SWIFT ARE YOU GONNA BE TAYLOR ALWYN?\" one fan wrote, while another added, \"I think Taylor Swift just told us she's engaged. That's it. That's the tweet.\"\n\nA third added, \"If Taylor Swift is secretly engaged to Joe Alwyn I’ll never be calm again.\"\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nMy heart’s been borrowed and yours has been blue. All’s well that ends well, to end up with you. 💙 pic.twitter.com/CECesxb8do — Taylor Swift (@taylorswift13) August 8, 2019\n\n23 August 2019: Taylor releases her new album, Lover, and fans are convinced that these songs - and these lyrics in particular are about Joe.\n\nSong: 'Lover'\n\nLyric: \"I've loved you three summers now, honey, but I want 'em all\"\n\nWhy fans think this is about Joe: Rumour has it, Taylor and Joe started dating in summer 2016 aka three summers ago.\n\n\n\nSong: 'I Think He Knows'\n\nLyric: \"He got that boyish look that I like in a man.\"\n\nWhy fans think this is about Joe: I mean, you've seen him, right?\n\nSong: 'London Boy'\n\nLyric: \"Took me back to Highgate, met all of his best mates. So I guess all the rumours are true. You know I love a London boy. Boy I fancy you.\"\n\nWhy fans think this is about Joe: He was born and raised in London. Simple as that.\n\n6th October 2019: After Taylor does an amazing job of presenting SNL with Phoebe Waller-Bridge, she's pictures with Joe for the first time in ages. They were snapped leaving Japanese restaurant, Zuma, in New York.\n\nGetty Images\n\nGetty Images\n\nGetty Images\n\n5th January 2020: Taylor Swift and Joe Alwyn had a very public date night at the Golden Globes awards, where Taylor was nominated for Best Original Song for 'Beautiful Ghosts' from Cats. She lost out to Elton John and Bernie Taupin for '(I’m Gonna) Love Me Again' from Rocketman, but did get to go to a fancy dinner with her boyfriend. So who's complaining?\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n📹 | Taylor Swift and Joe Alwyn in the audience at the #GoldenGlobes pic.twitter.com/p73tAzzbRy — Taylor Swift News 🕰️ (@TSwiftNZ) January 6, 2020\n\n23 January 2020: Joe Alwyn and Taylor Swift are famously very private about their romance, but fans get to see a different side to their relationship in her Netflix documentary, Miss Americana. In it, not only does Taylor hug Joe backstage at one of her shows, but we also see her tenderly kiss his hand in the back of a taxi.\n\n13 February 2020: Taylor and Joe show some major PDA at the NME Awards, where she wins the award for Best Solo Act In The World. Fans capture videos of her and her boyfriend kissing, hugging, and generally just being really cute together:\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nTaylor and Joe are so precious I’m gonna faint #NMEAwards2020 pic.twitter.com/tRke8KLdtQ — sophie 🌶 (@sophklore) February 12, 2020\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nTaylor winner of Best Solo Act in the World annonced, the hug I’m dying #NMEAwards2020 pic.twitter.com/yaOKMjXiSF — sophie 🌶 (@sophklore) February 13, 2020\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nTaylor winner of Best Solo Act in the World annonced, the hug I’m dying #NMEAwards2020 pic.twitter.com/yaOKMjXiSF — sophie 🌶 (@sophklore) February 13, 2020\n\n29 April 2020: Joe Alwyn shares a little insight into self isolation with Taylor Swift, posting three Instagram Stories of one of her beloved cats.\n\nThe 29-year-old actor posted three photos of the blue-eyed cat named Benjamin Button: in one he lay in a paper shopping bag, before hiding in a cardboard box and under a rug. Taylor also has two other cats; Olivia Benson and Meredith Grey named after TV characters.\n\nInstagram Stories/Joe Alwyn\n\nNovember 2020: Following fan speculation in the summer, Taylor Swift confirms Joe Alwyn did indeed work with her on Folklore - her surprise 8th studio album which dropped in July. At the time, fan speculated about who William Bowery was, an anonymous person credited as co-writer on two songs.\n\nThey came up with theories about why the name was linked to Joe, and the singer has since revealed her boyfriend did indeed write the piano parts for 'Betty' and 'Exile'. Speaking about the surprise collaboration in her new documentary, folklore: the long pond studio sessions on Disney+, Taylor said:\n\n\"There's been a lot of discussion about William Bowery and his identity. He's not a real person... William Bowery is Joe, as we know. And Joe, Joe plays piano beautifully, and he's always just playing and making things up and kind of creating things.\"\n\nShe later revealed, \"I just heard Joe singing the entire, fully formed chorus of 'Betty' from another room. And I just was like, 'Hello,'\" Taylor said. \"It was a step that we would never have taken because why would we have ever written a song together? This was the first time we had a conversation where I came in and I was like, 'Hey, this could be really weird and we could hate this, so could we just, because we're in quarantine and there's nothing else going on, could we just try to see what it's like if we write this song together?'\"\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nAs for his involvement with the song 'Exile'? \"Joe had written that entire piano part and he was singing the Bon Iver part... He was just singing it. And so, I was entranced and I asked if we could keep writing that one. It was pretty obvious that it should be a duet, 'cause he's got such a low voice and it sounded really good sung down there in that register.\"\n\nWe are SO ready for a Joe/Taylor duet album.\n\nNovember 2020: Taylor speaks about Joe during an interview with Paul McCartney for Rolling Stone.\n\nDiscussing Folklore song 'Peace', Taylor explained, \"'Peace' is actually more rooted in my personal life. I know you [McCartney] have done a really excellent job of this in your personal life: carving out a human life within a public life, and how scary that can be when you do fall in love and you meet someone, especially if you’ve met someone who has a very grounded, normal way of living.\n\n\"I, oftentimes, in my anxieties, can control how I am as a person and how normal I act and rationalise things, but I cannot control if there are 20 photographers outside in the bushes and what they do and if they follow our car and if they interrupt our lives. I can’t control if there’s going to be a fake weird headline about us in the news tomorrow.\"\n\nRobert Kamau Getty Images\n\nAsked by McCartney, \"Does your partner sympathise with that and understand?\" Taylor responded, \"Oh, absolutely. ... But I think that in knowing him and being in the relationship I am in now, I have definitely made decisions that have made my life feel more like a real life and less like just a storyline to be commented on in tabloids.\n\n\"Whether that’s deciding where to live, who to hang out with, when to not take a picture — the idea of privacy feels so strange to try to explain, but it’s really just trying to find bits of normalcy. That’s what that song 'Peace' is talking about. Like, would it be enough if I could never fully achieve the normalcy that we both crave?\"\n\nJanuary 2021: After 11 months of not being seen out together (and being locked down because of you know what), Swift and Alwyn are photographed in London, out on a walk with his mum. Cute.\n\nFebruary 2021: Taylor reveals Joe encouraged her to use her platform to speak out about her political views during part of her Miss Americana Netflix documentary. \"As a country musician, I was always told it's better to stay out of [politics],\" she told Vanity Fair. \"The Trump presidency forced me to lean in and educate myself. I found myself talking about government and the presidency and policy with my boyfriend [Joe Alwyn], who supported me in speaking out.\"\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nMarch 2021: Taylor thanks Joe during her GRAMMYs 2021 acceptance speech, and the whole moment is *so* cute. Picking up the gong for Album Of The Year for Folklore at the 63rd GRAMMY Awards, Taylor thanked Joe for both his personal support and his contributions to the album as a songwriter (with Joe working under the pseudonym William Bowery).\n\nTaylor told viewers, \"I will thank all of my collaborators who are on this stage,\" before going on to thank Joe who wasn't on stage at the time.\n\nShe went on, \"Joe, who is the first person that I play every single song that I write and I had the best time writing songs with you in quarantine.\"\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nFYI, Taylor also made history with her GRAMMYs 2021 win becoming the first female artist ever to win Album of the Year three times. 100% something to celebrate.\n\nMay 2021: Taylor takes home the Global Icon award at the 2021 Brits, and thanks Joe once again in her acceptance speech. “I want to thank my friends and family who know exactly who they are: whose opinion of me never changed whether my stock was up or down,\" she said.\n\n\"If there’s one thing that I’ve learned, it’s that you have to look around every day and take note of the people who have always believed in you and never stop appreciating them for it. Never take them for granted.\"\n\n13th September 2021: Taylor took a trip to Belfast to support Joe as he wrapped filming for the BBC's adaptation of Sally Rooney novel Conversations with Friends.\n\nBelfast cocktail bar The Tipsy Bird shared the news by posting an adorable picture of Taylor alongside staff on Instagram. They wrote, \"The one and only @taylorswift graced us with her presence last Friday night💫.\"\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nConfirming that Taylor was indeed in town to visit Joe, they added, \"Taylor was here to support her boyfriend Joe who has just wrapped up filming the TV series Conversations with Friends.\"\n\nPlus, the news that Swifties want to hear: \"We can confirm she is just as lovely as you would expect and was kind enough to take a picture with our team.\"\n\n\n\nCute!\n\nWhat's more, Belfast restaurant Shu also reported seeing Taylor drop in, sharing a series of selfies of the singer with staff. They wrote on Instagram, \"On Thursday evening we had the pleasure of serving Taylor swift! 🤭 Taylor was so lovely and really is a beautiful person inside and out and she kindly agreed to get photos with all our staff!\"\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n23rd November 2021: Taylor supports Joe on set once again by spending time on the film set for his project, The Stars at Noon. A source told E! News, \"Taylor visited her boyfriend on the set of his movie.\"\n\nThe Stars at Noon is an adaptation of Denis Johnson's novel of the same name, with Maid's Margaret Qualley also starring alongside Joe. Set in Nicaragua, the film reportedly was shot in Panama - with Taylor paying a visit to Joe on set.\n\n\n\n17th January 2022: Taylor and Joe headed across the Atlantic to welcome in 2022, reportedly staying in St Ives, Cornwall for a romantic break. They apparently spent three days together in the coastal town, with a source reporting that St Ives is \"particularly special\" to the couple.\n\n\n\nThe insider told The Sun, \"Taylor’s a superstar and obviously very wealthy, so she can travel almost anywhere she wants at any time. But to go that far just for a few days clearly meant a lot to them.\"\n\nRicky Vigil M Getty Images\n\nThe source went on to bring up engagement rumours surrounding Taylor and Joe, saying, \"It feels like things are getting more serious and people think an engagement could be on the cards. That could explain such a long journey to a specific place.\"\n\nThey went on, \"Taylor is keeping her cards close to her chest, but they’re certainly very happy and enjoying their time together.\"\n\nSharing an insight into how the pair got on during the pandemic, the insider added, \"Lockdown made things even more serious and they’ve lived together throughout.\"\n\nAs for what Taylor and Joe got up to on their hols, the publication reports that the couple rented a house rather than staying in a hotel, according to sources, before flying back to Maine in the US. Meanwhile, a friend of the pair reportedly added, \"It sounds a gorgeous trip.\"\n\n8th February 2022: Joe recently shared a little snippet into his relationship with Taylor, during an interview about his upcoming Hulu series - an adaptation of Sally Rooney's Conversations With Friends.\n\nIn the show, Joe's character is in an open relationship, and in a recent interview, (via E!) he was asked if it's something he would consider in his own personal life. \"I think people can do what they want and makes them happy,\" he said. \"I'm obviously happy in a monogamous relationship.\" Aw!\n\n21 April 2022: Joe Alwyn opens up about the constant Taylor Swift engagement rumours, explaining he wouldn't confirm if they were true either way. Fair enough.\n\n\"If I had a pound for every time I think I've been told I've been engaged, then I'd have a lot of pound coins,\" he joked to the Wall Street Journal. \"I mean, the truth is, if the answer was yes, I wouldn't say, and if the answer was no, I wouldn't say.\"\n\nOn the topic of fan attention and interest in their relationship, he added, \"We live in a culture that people expect so much to be given. So that if you're not posting all the time about what you're doing, how you're spending a day or how you made a breakfast, does that make you a recluse?\n\n\"I'd also like to feel slightly less guarded sometimes in interviews or in whatever kind of interactions, but it's just a knee-jerk response to the culture we live in. If you give it to them, it just opens the door.\"\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-swift-confirms-boyfriend-joe-alwyn-worked-on-folklore-1606475172.jpg?crop=1.00xw:0.400xh;0.00160xw,0.0230xh&resize=1200:*", "https://www.cosmopolitan.com/sites/cosmopolitan/assets/images/logos/ipso_regulated_hires.png", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-swift-dating-history-2-1637583481.jpg?crop=1.00xw:0.340xh;0,0.0413xh&resize=300:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-swift-confirms-boyfriend-joe-alwyn-worked-on-folklore-1606475172.jpg?crop=1.00xw:0.400xh;0.00160xw,0.0230xh&resize=1200:*", "keywords": [], "authors": ["Olivia Blair", "Talent Editor", "Olivia Blair Is Talent Editor At Hearst Uk", "Working Predominantly Across Cosmopolitan", "Elle", "Esquire", "Harper'S Bazaar."], "canonical_link": "https://www.cosmopolitan.com/uk/entertainment/a13561434/taylor-swift-joe-alwyn-relationship-timeline/", "title": "Taylor Swift and Joe Alwyn", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=6", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "How Taylor Swift reacted to Joe Alwyn's nudity in Conversations With Friends", "description": "Plus a full timeline of their relationship", "url": "https://www.cosmopolitan.com/uk/entertainment/a13561434/taylor-swift-joe-alwyn-relationship-timeline/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-swift-confirms-boyfriend-joe-alwyn-worked-on-folklore-1606475172.jpg?crop=1.00xw:0.400xh;0.00160xw,0.0230xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 211620818858710}, "article": {"publisher": "https://facebook.com/cosmopolitanuk", "modified_time": "2022-05-11T15:37:16Z", "published_time": "2022-05-11T11:33:00Z", "section": "Entertainment", "opinion": "false"}, "twitter": {"site": "@CosmopolitanUK", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-swift-confirms-boyfriend-joe-alwyn-worked-on-folklore-1606475172.jpg?crop=1.00xw:0.400xh;0.00160xw,0.0230xh&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Taylor Swift and Joe Alwyn - Relationship timeline", "description": "A look back at the relationship between Taylor Swift and British actor Joe Alwyn, from their first meeting to lyric references and more.", "keywords": "Joe Alwyn, Taylor Swift, Taylor Swift's boyfriend, Taylor Swift relationship, Taylor Swift songs about Joe Alwyn, taylor swift joe alwyn house london", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-swift-confirms-boyfriend-joe-alwyn-worked-on-folklore-1606475172.jpg?crop=1.00xw:0.799xh;0,0&resize=320:*", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "sailthru.contenttype": "standard-article", "sailthru.tags": "Entertainment,entertainment,Joe Alwyn,taylor swift", "sailthru.date": "2022-05-11T11:33:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-swift-confirms-boyfriend-joe-alwyn-worked-on-folklore-1606475172.jpg?crop=1.00xw:0.400xh;0.00160xw,0.0230xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/taylor-swift-confirms-boyfriend-joe-alwyn-worked-on-folklore-1606475172.jpg?crop=1.00xw:0.799xh;0,0", "sailthru.socialtitle": "How Taylor Swift reacted to Joe Alwyn's nudity in Conversations With Friends", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1652268780.0, "source": "https://www.cosmopolitan.com", "summary": ""}