{"url": "https://www.hollywoodreporter.com/news/mario-batali-faces-new-wave-sexual-misconduct-claims-1115934", "text": "More women have come forward with sexual misconduct claims against disgraced chef Mario Batali.\n\nSeven women spoke to Vox Media’s Eater in a Wednesday report, detailing alleged inappropriate touching and unwanted kissing from Batali. Eater published video clips of two of the encounters, along with warnings of their potentially distressing nature. Unlike many of the former employees who have previously come forward with allegations against Batali, of the women who spoke to Eater, four were fans who spoke on the record.\n\nFormer Batali fan Natali Tene says the chef groped her at a bar next to his Boston Eataly in April 2017. In addition to the alleged touching, she says he “squeezed her face into his as he kissed her,” according to the article. She provided photo and video of the encounter.\n\nAnother former fan, Sarah Watson, claimed Batali groped her and made a comment about wanting to give her oral sex during their encounter at a nonprofit event Batali had catered in 2016. Another woman, Rebecca Marshall, provided video of Batali kissing her during a similar event in January 2017. She says she laughed and leaned away after he “stuck his tongue in my mouth” because “I didn’t know what else to do.”\n\nTene and another accuser, pastry chef and cookbook author Jenny McCoy, told the outlet they were motivated to come forward after seeing stories about a comeback plan from Batali.\n\nMcCoy initially accused Batali of groping her in a former Eater story, but is now going on the record. “These men, men like Batali, who are powerful and delusional, won’t back down, obviously,” she said. “So we need to keep using our voices, women and men, to make a real change, a real cultural shift — and no longer tolerate this behavior.”\n\nEater also spoke to three former employees who accused Batali of groping and unwanted kissing.\n\nThe new wave of accusations come as the New York Police Department announced an ongoing investigation into Batali.\n\nOn May 21, the NYPD confirmed it was looking into a woman’s claim first made on CBS’ 60 Minutes that Batali drugged and sexually assaulted her in 2005. Batali denied the claim to CBS.\n\nAfter the report, Batali & Bastianich Hospitality Group announced that three of the group’s Las Vegas eateries would shutter. Batali had already stepped down from the company’s day-to-day operations, but B&B announced it has officially severed ties with the former partner. B&B told Eater on Wednesday that Batali’s divestment from the restaurants will be finalized by July 1.\n\nBatali was accused of sexual misconduct by eight women in December, as the #MeToo movement continued to grow. The initial allegations were also published by Eater.\n\nBatali issued an apology and ultimately stepped away from his restaurant empire and Eataly, the Italian marketplace chain he co-owns. He also was fired from his TV series, ABC’s The Chew, on which he served as co-host. (ABC recently canceled the daytime cooking show.)\n\nThe new allegations bring the total accusers to 18; the claims span over a period of at least 20 years.\n\nBatali has denied allegations of nonconsensual sex. He could not be immediately reached for further comment by The Hollywood Reporter.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/12/gettyimages-494965576_copy_-_h_2017.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2017/12/gettyimages-494965576_copy_-_h_2017.jpg?w=1296&h=730&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/12/gettyimages-494965576_copy_-_h_2017.jpg?w=1024", "keywords": [], "authors": ["Jackie Strause"], "canonical_link": "https://www.hollywoodreporter.com/lifestyle/lifestyle-news/mario-batali-faces-new-wave-sexual-misconduct-claims-1115934/", "title": "Mario Batali Faces New Wave of Sexual Misconduct Claims", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Seven women claim Mario Batali groped them in a new Eater report. The former TV chef is currently under investigation by the NYPD.", "news_keywords": "Mario Batali, nsfs, THRX", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Jackie Strause", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1115934, "title": "Mario Batali Faces New Wave of Sexual Misconduct Claims", "published_at": "2018-05-30 13:59:29", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/12/gettyimages-494965576_copy_-_h_2017.jpg?w=1024", "comment_count": 0, "tags": "THRX", "topics": "Lifestyle News", "body": "More women have come forward with sexual misconduct claims against disgraced chef Mario Batali.\r\nSeven women spoke to Vox Media's Eater in a Wednesday report, detailing alleged inappropriate touching and unwanted kissing from Batali. Eater published video clips of two of the encounters, along with warnings of their potentially distressing nature. Unlike many of the former employees who have previously come forward with allegations against Batali, of the women who spoke to Eater, four were fans who spoke on the record.\r\nFormer Batali fan Natali Tene says the chef groped her at a bar next to his Boston Eataly in April 2017. In addition to the alleged touching, she says he \"squeezed her face into his as he kissed her,\" according to the article. She provided photo and video of the encounter.\r\nAnother former fan, Sarah Watson, claimed Batali groped her and made a comment about wanting to give her oral sex during their encounter at a nonprofit event Batali had catered in 2016. Another woman, Rebecca Marshall, provided video of Batali kissing her during a similar event in January 2017. She says she laughed and leaned away after he \"stuck his tongue in my mouth\" because \"I didn't know what else to do.\"\r\nTene and another accuser, pastry chef and cookbook author Jenny McCoy, told the outlet they were motivated to come forward after seeing stories about a comeback plan from Batali.\r\nMcCoy initially accused Batali of groping her in a former Eater story, but is now going on the record. “These men, men like Batali, who are powerful and delusional, won’t back down, obviously,” she said. “So we need to keep using our voices, women and men, to make a real change, a real cultural shift — and no longer tolerate this behavior.”\r\nEater also spoke to three former employees who accused Batali of groping and unwanted kissing.\r\nThe new wave of accusations come as the New York Police Department announced an ongoing investigation into Batali. \r\nOn May 21, the NYPD confirmed it was looking into a woman's claim first made on CBS' 60 Minutes that Batali drugged and sexually assaulted her in 2005. Batali denied the claim to CBS.\r\nAfter the report, Batali & Bastianich Hospitality Group announced that three of the group's Las Vegas eateries would shutter. Batali had already stepped down from the company's day-to-day operations, but B&B announced it has officially severed ties with the former partner. B&B told Eater on Wednesday that Batali's divestment from the restaurants will be finalized by July 1.\r\nBatali was accused of sexual misconduct by eight women in December, as the #MeToo movement continued to grow. The initial allegations were also published by Eater.\r\nBatali issued an apology and ultimately stepped away from his restaurant empire and Eataly, the Italian marketplace chain he co-owns. He also was fired from his TV series, ABC's The Chew, on which he served as co-host. (ABC recently canceled the daytime cooking show.)\r\nThe new allegations bring the total accusers to 18; the claims span over a period of at least 20 years.\r\nBatali has denied allegations of nonconsensual sex. He could not be immediately reached for further comment by The Hollywood Reporter.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Mario Batali Faces New Wave of Sexual Misconduct Claims", "url": "https://www.hollywoodreporter.com/lifestyle/lifestyle-news/mario-batali-faces-new-wave-sexual-misconduct-claims-1115934/", "description": "Seven women claim Mario Batali groped them in a new Eater report. The former TV chef is currently under investigation by the NYPD.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/12/gettyimages-494965576_copy_-_h_2017.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2018-05-30T13:59:29+00:00", "modified_time": "2018-05-30T15:21:02+00:00"}, "twitter": {"site": "@thr", "creator": "@jackiedstrause", "card": "summary_large_image", "title": "Mario Batali Faces New Wave of Sexual Misconduct Claims", "description": "Seven women claim Mario Batali groped them in a new Eater report. The former TV chef is currently under investigation by the NYPD.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/12/gettyimages-494965576_copy_-_h_2017.jpg?w=1296"}}, "movies": [], "publish_date": 1527688769.0, "source": "https://www.hollywoodreporter.com", "summary": ""}