{"url": "https://www.rollingstone.com/music/music-news/dj-khaled-claims-he-was-sabotaged-after-disastrous-edc-set-198229/", "text": "DJ Khaled was clear that he wasn’t the cause of his fraught Electric Daisy Carnival set in Las Vegas last weekend. The rapper/producer, who was scheduled for an hour-long set, performed for less than 20 minutes before fans booed him off the stage, chanting for Yellow Claw, the next DJ, to take over.\n\n“Due to technical difficulties beyond DJ Khaled and Insomniac’s control, Khaled was not able to perform at his scheduled time on Sunday night at EDC,” Insomniac CEO Pasquale Rotella said to Rolling Stone. “He arrived on time and ready to rock the crowd, but equipment issues delayed the performance. Even though there were technical difficulties, he still got onstage and showed his fans love.”\n\nOn Instagram, Khaled reiterated that his EDC set was compromised by technical issues. “They cut my time short and they had me backstage for a hour and half and the sound kept breaking,” he captioned a video clip. “Then I heard my fans and I said I’m go out even if the sound cuts off and even if they cut my time short … I’m here for my fans even if the sound man and promoter don’t have there stuff together I forgive them thoe love is the [key.]”\n\n“They tried to sabotage my sound,” Khaled said in another post. “I still stood on stage wit no sound, and when they got the sound to work they want cut my set short … I still rep for my people,” he continued. “Anyone else would walk off stage.”The rapper continued his rant in a second post to Instagram, claiming that he was “sabotaged.”\n\nThey? Tried to sabotage my sound so many times THEY couldnot get the sound right on my set and i still stood on stage wit no sound and when they got the sound to work they want cut my set short but I still rep for my people anyone else would walk off stage .. i knew my California and Vegas fans was in the building .. THEY? DONT WANT US TO WIN SO WE WIN MORE FOR THERE HEAD TOP!!! It’s all luv thoe .. love is the ?.. I forgive them … love is always the answer ! A post shared by DJ KHALED (@djkhaled) on Jun 19, 2017 at 2:17am PDT\n\nIn the second clip, Khaled tries to make up for the technical difficulties during his time onstage by playing 2Pac’s classic “California Love.” “They want to cut my shit … but this is California,” he says in the video. Las Vegas is, in fact, located in Nevada, as several fans were quick to point out.\n\nEarlier this year, Khaled also caught flack for a subpar performance at the Coachella Music and Arts Festival, where his sound was similarly cut off when he went over his scheduled time by several minutes.", "images": ["https://www.rollingstone.com/wp-content/uploads/2018/06/rs-dj-khaled-4caeb383-25b8-4cfb-acc6-292363c72bbb.jpg?w=500&h=375&crop=1", "https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2022/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-dj-khaled-4caeb383-25b8-4cfb-acc6-292363c72bbb.jpg?w=500&h=375&crop=1", "keywords": [], "authors": ["Joyce Chen"], "canonical_link": "https://www.rollingstone.com/music/music-news/dj-khaled-claims-he-was-sabotaged-after-disastrous-edc-set-198229/", "title": "DJ Khaled Claims He Was ‘Sabotaged’ After Disastrous EDC Set", "meta_data": {"theme-color": "#df3535", "viewport": "width=device-width, initial-scale=1.0", "description": "Fans boo DJ Khaled and make calls for next performer to come on stage after technical difficulties at Electric Daisy Carnival in Las Vegas", "news_keywords": "DJ Khaled, Hip-Hop", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "rollingstone", "pmc-page_type": "article", "articleid": 198229, "author": "Joyce Chen", "pmc-category": "Music,Music News", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2017-06-19T21:21:00"}, "pmc-tag": "DJ Khaled,Hip-Hop", "title": "DJ Khaled Claims He Was ‘Sabotaged’ After Disastrous EDC Set", "pageclass": "article", "pmc-is_free": "no", "pmc-branded-content": "no", "pmc-evergreen": "no"}, "generator": "WordPress 6.0.2", "author": "Joyce Chen", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "RS", "application-name": "RS", "content_type": "Article", "post_id": 198229, "title": "DJ Khaled Claims He Was 'Sabotaged' After Disastrous EDC Set", "published_at": "2017-06-19 21:21:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-dj-khaled-4caeb383-25b8-4cfb-acc6-292363c72bbb.jpg?w=1024", "comment_count": 0, "tags": "Hip-Hop", "topics": "Music News", "body": "DJ Khaled was clear that he wasn't the cause of his fraught Electric Daisy Carnival set in Las Vegas last weekend. The rapper/producer, who was scheduled for an hour-long set, performed for less than 20 minutes before fans booed him off the stage, chanting for Yellow Claw, the next DJ, to take over.\"Due to technical difficulties beyond DJ Khaled and Insomniac's control, Khaled was not able to perform at his scheduled time on Sunday night at EDC,\" Insomniac CEO Pasquale Rotella said to Rolling Stone. \"He arrived on time and ready to rock the crowd, but equipment issues delayed the performance. Even though there were technical difficulties, he still got onstage and showed his fans love.\" On Instagram, Khaled reiterated that his EDC set was compromised by technical issues. \"They cut my time short and they had me backstage for a hour and half and the sound kept breaking,\" he captioned a video clip. \"Then I heard my fans and I said I'm go out even if the sound cuts off and even if they cut my time short ... I'm here for my fans even if the sound man and promoter don't have there stuff together I forgive them thoe love is the [key.]\"    They cut my time short and they had me back stage for a hour and half and the sound kept breaking ... then I heard my fans and I said I'm go out even if the sound cuts off and  even if they cut my time short ... I'm here for my fans even if the sound man and promoter  don't have there stuff together I forgive them thoe love is the ?!!! MY FANS CAME OUT ! SO I CAME OUT !! NO MATTER WHAT! BLESS UP!! #GRATEFUL #JUNE23RD A post shared by DJ KHALED (@djkhaled) on Jun 19, 2017 at 1:50am PDT\n\"They tried to sabotage my sound,\" Khaled said in another post. \"I still stood on stage wit no sound, and when they got the sound to work they want cut my set short … I still rep for my people,\" he continued. \"Anyone else would walk off stage.\"The rapper continued his rant in a second post to Instagram, claiming that he was \"sabotaged.\"    They? Tried to sabotage my sound so many times THEY couldnot  get the sound right on my set and i still stood on stage wit no sound and when they got the sound to work they want cut my set short but I still rep for my people anyone else would walk off stage .. i knew my California and Vegas fans was in the building .. THEY? DONT WANT US TO WIN SO WE WIN MORE FOR THERE HEAD TOP!!! It's all luv thoe .. love is the ?.. I forgive them ... love is always the answer ! A post shared by DJ KHALED (@djkhaled) on Jun 19, 2017 at 2:17am PDT\nIn the second clip, Khaled tries to make up for the technical difficulties during his time onstage by playing 2Pac's classic \"California Love.\" \"They want to cut my shit … but this is California,\" he says in the video. Las Vegas is, in fact, located in Nevada, as several fans were quick to point out.Earlier this year, Khaled also caught flack for a subpar performance at the Coachella Music and Arts Festival, where his sound was similarly cut off when he went over his scheduled time by several minutes.", "fb": {"pages": 10664530778}, "onesignal": "wordpress-plugin", "og": {"type": "article", "title": "DJ Khaled Claims He Was 'Sabotaged' After Disastrous EDC Set", "url": "https://www.rollingstone.com/music/music-news/dj-khaled-claims-he-was-sabotaged-after-disastrous-edc-set-198229/", "description": "Fans boo rapper and make calls for next DJ to come on stage after technical difficulties", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-dj-khaled-4caeb383-25b8-4cfb-acc6-292363c72bbb.jpg?w=500&h=375&crop=1", "width": 1024, "height": 550, "alt": "dj khaled, dj khaled edc, dj khaled edc performance, dj khaled sabotaged, dj khaled grateful, dj khaled vegas, dj khaled new album, dj khaled vegas performance, dj khaled fans, dj khaled son"}, "locale": "en_US"}, "article": {"published_time": "2017-06-19T21:21:00+00:00", "modified_time": "2018-06-25T16:23:34+00:00"}, "twitter": {"site": "@RollingStone", "card": "summary_large_image", "title": "DJ Khaled Claims He Was ‘Sabotaged’ After Disastrous EDC Set", "description": "Fans boo DJ Khaled and make calls for next performer to come on stage after technical difficulties at Electric Daisy Carnival in Las Vegas", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-dj-khaled-4caeb383-25b8-4cfb-acc6-292363c72bbb.jpg?w=1024"}, "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2022/08/cropped-Rolling-Stone-Favicon.png?w=270"}, "movies": [], "publish_date": 1497907260.0, "source": "https://www.rollingstone.com", "summary": ""}