{"url": "en.wikipedia.org/wiki/Troian_Bellisario", "text": "American actress\n\nTroian Avery Bellisario (born October 28, 1985) is an American actress and director. A graduate of the University of Southern California, in 2010, she received her breakthrough role as Spencer Hastings in the Freeform drama series Pretty Little Liars (2010–2017), for which she received worldwide recognition and multiple awards and nominations.\n\nEarly life [ edit ]\n\nBellisario was born and raised in Los Angeles. Her parents are producers Donald P. Bellisario and Deborah Pratt.[2] Donald created Magnum, P.I., Quantum Leap, and NCIS, among other TV series. She has a younger brother,[3] three half-sisters, two half-brothers, and two stepbrothers, actor Sean Murray and producer Chad W. Murray. Her father is of Italian and Serbian descent, and her mother is of African American and Creole descent.[4]\n\nBellisario attended Campbell Hall School in Studio City, California, from kindergarten through twelfth grade,[5] where she was the valedictorian of her class.[6] After high school, Bellisario attended Vassar College for a couple months before taking a break for the sake of her mental health as she felt the institution only enhanced her perfectionist tendencies.[7] She graduated with a Bachelor of Fine Arts degree from the University of Southern California in 2009.[8]\n\nCareer [ edit ]\n\nEarly work [ edit ]\n\nBellisario made her acting debut in the 1988 film Last Rites at the age of three, which was directed, written and produced by her father, Donald P. Bellisario.[9] In 1990, she guest-starred in an episode of her father's series Quantum Leap. In 1998, she co-starred with Mary-Kate and Ashley Olsen in the film Billboard Dad. Beginning in 2006, Bellisario began appearing in a number of independent short films namely, Unspoken, Archer House and Intersect.\n\n2010s [ edit ]\n\nIn November 2009, Bellisario was cast as Spencer Hastings in the TV series Pretty Little Liars based on the book series of the same name by Sara Shepard.[10] In October 2011, Bellisario announced she was in the process of writing and creating her own film, which was successfully funded through Kickstarter on November 16, 2011. Filming ended in December 2011 and the film was officially completed by August 2012.[11]\n\nPretty Little Liars in 2014 Bellisario (far left) with the cast ofin 2014\n\nIn 2014, she starred in the music video for The Head and the Heart's song \"Another Story\".[12] Bellisario also starred in Immediately Afterlife, a short film about two cult members who are the only survivors of their group's mass suicide, playing Bennett, alongside her Pretty Little Liars co-stars Shay Mitchell (Emily), Ian Harding (Ezra Fitz) and Nolan North (Peter Hastings).[13] In 2015, she was cast in a leading role in the American remake of the French-Canadian film Martyrs.[14][15] In 2015, Bellisario and fiancée Patrick J. Adams filmed short film We Are Here in Haida Gwaii, which Bellisario wrote and starred in.[16] In 2017, Bellisario starred in her feature film, Feed, which she also wrote and produced. The film was written based on Bellisario's own experiences with an eating disorder.[17]\n\nOn April 7, 2016, it was announced that Bellisario would be directing season 7, episode 15 of Pretty Little Liars.[18] This made her one of the first in the cast, alongside Chad Lowe, to direct an episode on the series. In 2020, Bellisario appeared as the bride character Jenna Marshall from the episode \"Til Dex Do Us Part\" in Stumptown.[19]\n\nFurther in television, she costarred with Australian actress Jacki Weaver in the television drama film Sister Cities (2016), and opposite Bradley Whitford in the Me Too drama Lauren (2012–2013). In film, Bellisario has received recognition for her performances in C.O.G. (2013), Feed (2017), Clara (2018) and Where'd You Go, Bernadette (2019).\n\n2020s [ edit ]\n\nIn March 2020, Bellisario played the lead role of Claire in the CBS political drama pilot Ways & Means, written by Ed Redlich.[20] The pilot, which also starred Patrick Dempsey, focused on a secret alliance between a disillusioned career politician and an idealist up-and-comer in the gridlocked American system. The show was not picked up.[21]\n\nIn 2022, she appeared in the comedy Doula alongside Arron Shiver (who also wrote the film) and Will Greenberg.[22] The film, produced by Chris Pine and directed by Cheryl Nichols, deals with Bellisario's character hiring her midwife's son as the latter's replacement when she passes away.\n\nPersonal life [ edit ]\n\nBellisario started dating Suits star Patrick J. Adams after they met on the set of the play Equivocation in 2009.[23] The couple briefly split, but after Adams' guest appearance as Hardy in Pretty Little Liars, 2010, the two got back together.[24] Since working on Equivocation and Pretty Little Liars, the couple also worked together on the 2012 short film The Come Up, Suits, and the short film We Are Here. Bellisario and Adams were married on December 10, 2016, in Santa Barbara, California.[25][26] In May of 2018, they attended the royal wedding of Prince Harry and Meghan Markle. The couple has two daughters, born in 2018[27] and 2021.[28]\n\nIn an episode of actress Katie Lowes's podcast, Katie's Crib, Bellisario and Adams revealed that their second child was born in the backseat of their car in the hospital's parking lot due to quick proceeding labor; Adams delivered the baby himself. They were assisted by hospital staff within minutes of the birth, and Bellisario and the baby were both found healthy.[29][30]\n\nBellisario revealed in January 2014 that she went through personal problems through high school, resulting in self-harm and an eating disorder. \"I was the youngest daughter, the perfect little girl. My school was a very intense college prep school. So it was about wanting to please my father and mother and wanting to be perfect to everybody.\"[31]\n\nIn 2014, Bellisario returned to the USC School of Dramatic Arts, her alma mater, to deliver a commencement speech.[32]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nYear Title Role Notes 1988 Last Rites Justin's daughter 1998 Billboard Dad Kristen Bulut 2006 Unspoken Jani Short film 2007 Archer House Tatum Short film 2009 Intersect Victoria Short film 2009 Before the Cabin Burned Down Meg Short film 2010 Consent Amanda 2010 Peep World Film set P.A. 2011 A November Girlfriend Short film 2011 Pleased to Meet You Carson 2012 Jessica Short film 2012 Joyful Girl Belle Short film 2013 C.O.G. Jennifer 2013 Exiles Juliet Short film; also writer and executive producer 2014 Immediately Afterlife Bennett Short film 2015 Surf Noir Lacey Short film 2015 Martyrs Lucie Jurin 2015 Still a Rose Juliet Short film 2015 Amy Amy Short film 2016 In the Shadows of the Rainbow Short film 2017 Chuck Hank and the San Diego Twins Claire 2017 Feed Olivia Grey Also writer and producer 2018 We Are Here Woman Short film; also producer and writer 2018 Clara Clara 2019 Where'd You Go Bernadette Becky 2019 Like Turtles Molly Short film; also producer 2020 Life on Mars Stella Short film; also writer 2022 Doula Deb\n\nTelevision [ edit ]\n\nRadio [ edit ]\n\nWeb [ edit ]\n\nMusic videos [ edit ]\n\nDirector [ edit ]\n\nYear Title Episode(s) Notes 2017 Pretty Little Liars \"In the Eye Abides the Heart\" Directorial debut 2018 Famous in Love \"Guess Who's (Not) Coming to Sundance?\" 2019–present Good Trouble \"Swipe Right\", \"Fragility\", \"Whoosh, Pow, Bang\", \"It's Lonely Out in Space\" 2020 Life on Mars — Short film\n\nAwards and nominations [ edit ]", "images": ["http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Troian_Belisario_at_Paley_Fest2014_%28cropped%29_%28cropped%29.jpg/220px-Troian_Belisario_at_Paley_Fest2014_%28cropped%29_%28cropped%29.jpg", "http://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/Cast_of_Pretty_Little_Liars_at_Paley_Fest2014.jpg/350px-Cast_of_Pretty_Little_Liars_at_Paley_Fest2014.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/9/9f/Troian_Belisario_at_Paley_Fest2014_%28cropped%29_%28cropped%29.jpg", "http://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Troian_Belisario_at_Paley_Fest2014_%28cropped%29_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Troian_Bellisario", "title": "Troian Bellisario", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/9/9f/Troian_Belisario_at_Paley_Fest2014_%28cropped%29_%28cropped%29.jpg", "width": 640, "height": 831}, "title": "Troian Bellisario - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}