{"url": "https://web.archive.org/web/20200422014819/https://greysanatomy.fandom.com/wiki/Grey%27s_Anatomy:_Post-Op", "text": "Grey's Anatomy: Post-Op is an eight-part web series where Gordon James talks to cast, writers, producers, and/or crew members. The series was released in the weeks leading up to the 300th episode of Grey's Anatomy with the first episode released October 4, 2017.\n\nThe guests will look back on the past season of Grey's Anatomy, while each episode will also offer sneak peeks from upcoming season fourteen episodes.\n\nContents show]\n\nEpisodes Edit\n\nEpisode 1: Alexandra Patsavas Edit\n\nGordon welcomes the viewers. He mentions he plays Nurse Gregory, also known as the nurse who never should have left Meredith alone. Moving on.\n\nHe introduces Alexandra Patsavas, music supervisor on the show. He asks what her job entails. She says anything that has to do with music falls on her, even an actor humming or a character referring to a song. She has to make sure it's cleared and can thus be aired. She thinks about score and songs and how they flow into one another, and of course, which recorded songs would enhance the episodes. He asks how she finds songs. She says she always listens to music with possible songs in mind, and how the singer's voice sounds regardless of the lyrics. At the beginning of each season, Shonda tells her how she wants the audience to feel, without telling Alexandra what will happen. She then starts to pull music based on that emotional brief.\n\nGordon asks about her career. She says she made her way to L.A. and was lucky enough to assist a music superviser who taught her the ropes. She has been with the show since the pilot. She remembers Shonda wanted to use songs as score. At first, Alex didn't really understand how they could use songs in the OR.\n\nGordon wants to talk about iconic songs and brings up Chasing Cars by Snow Patrol. He asks how she chose that song. She answers that Snow Patrol is tremendous and that it was a new album that had just been released. She wanted to pitch the best possible song since it would be played over such a pivotal moment. She remembers waking up the next morning to find out that the song had climbed the charts, which were not as mobile back then.\n\nGordon brings up John Legend's \"All of Me\" debuting on the season nine finale. Alexandra explains that in the industry, demos are shared since they are nearly perfect but not yet final versions of the song. John sent that demo to Shonda. Shonda wanted to use it and John allowed it.\n\nNext up is Keep Breathing by Ingrid Michaelson. Alex recalls that it was in the beginning of Ingrid's career. Her voice was perfect for that moment. Alex calls it one of her favorite scenes on the show. She mentioned that they have used Ingrid more than 10 times, which leads to her talking about Sleeping at Last. She adores his music. They used original songs of his as well as covers, because she finds that he has an inspirational way of doing those.\n\nGordon brings up that season 10 had a lot of covers. Alex credits Shonda for that idea. Shonda picked the songs and it was Alex's job to the find the right versions.\n\nGordon asks about the tone of season 14, although he knows she can't tell them a lot. She shares they'll be referencing a more classic Grey's Anatomy. It's been fun to put together compilations for this year. He asks about episode 300 and if she feels pressure. She feels pressure to continue to connect but it's such a good show to work on. She just wants to keep up her end. They have used more than 1,500 songs and they're nearing 1,600 around that 300th episode.\n\nGordon tells her she moves the fans every Thursday with her music. He thanks her for coming. She says it's been fun. He refers viewers to the website for a list of some of Alex's favorite songs.\n\nEpisode 2: Tony Phelan & Joan Rater Edit\n\nGordon welcomes former executive producers and co-showrunners Joan Rater and Tony Phelan. They are married and live together, and while working on Grey's, they used to drive to work separately in order not to always be together. Gordon asks how they came to work on the show. They reply that they were offered three jobs and ended up choosing Law & Order, but after Joan overheard people talking about Grey's Anatomy at a coffee place, they reconsidered and called Shonda. She gave them the job and they joined the team for season two.\n\nGordon mentions they participated in making the musical episode and asks about that. Tony says they both love musicals. Joan says so does Shonda, and they were always singing show tunes in the writers' room. Joan credits Chandra, Kevin, and Sara, as well as the entire cast. They all really brought it. Tony recalls that the network initially shut Shonda's idea down, so it took some convincing. Joan recalls they set up a session on a soundstage. They invited ABC executives. Kevin brought his guitar, and Chandra and Sara sang songs while Shonda told the story. They could immediately see that the executives were sold. Tony says normal prep takes 8 days, while prep for this episode took 3 months. The actors recorded the songs. While shooting, they wore earbuds so they could hear themselves sing. They had to sing along as well as act and perform medical stuff. Also, there was Callie on the gurney and an imaginary Callie, so Sara had to duck and run under the camera to pop up elsewhere.\n\nGordon asks about April's flashmob proposal. Tony says they had Tyce Diorio from So You Think You Can Dance to choreograph. Joan says Nicole Cummins, who plays Paramedic Nicole Cummins, is also a dancer, so they could use her talent on screen.\n\nGordon asks about their favorite episodes. Joan says Wishin' and Hopin' because of Ellis's lucid day. She remembers Shonda really wanted Ellis to be cruel to Meredith. She loved Kate and Ellen's performance and finds the episode beautiful. Tony picks Suicide is Painless because of the Army flashbacks. It was also about assisted suicide. They filmed it in the desert and they all had goggles on because of a wind storm. They were able to nicely weave the flashbacks into the present day medical case. He says the show is elastic enough to allow all sorts of things while still having it feel like the show.\n\nGordon brings up that their last day on set was also Sandra Oh's final day on set. Joan says they were all a wreck. They were all crying. They shot Cristina and Owen's goodbye scene in the OR and gallery, so the last thing Sandra had to do for the show was duck down so that Cristina would be gone when Owen looked up again. Tony directed the episode and he instructed Sandra to duck more as she was still visible. Tony says it was nice that they could all leave together, and he also loved that he got to shoot Ellen and Sandra dancing it out together for the last time. That was fun. The episode had a lot of great stuff to cap off their work on the show.\n\nGordon asks how it feels to have been a part of a show that's now nearing its 300th episode. Joan recalls a moment where they discussed how long the show would run with Shonda. Shonda asked if they could see it run for 7 years, which made them all laugh as they didn't see that happening. And look at the show now!\n\nGordon says goodbye and offers a sneak peek of the next episode.\n\nEpisode 3: Loretta Devine & Michael O'Neill Edit\n\nGordon sits down with Loretta Devine, who played Adele Webber, Richard Webber's wife from season 2 to season 9. Gordon's asks how she came to work on the show and how she starts working with Shonda Rhimes. Loretta explains she auditioned for Richard Webber's wife, and says she knew him from New York, from before the show. Jim and Loretta had a saying when they were shooting the show. \"This is butter, baby. We're doing quality TV.\" and she said it was that was the butter - it was very easy to work with him.\n\nGordon talks about how Adele is first brought into the show. Richard had just had brain surgery, and Adele walks in, worried. Loretta adds that it was very important to her that Adele acted just a little stuck up, and had everything pulled together. Adele's jewelry and clothes had to look flawless, and she was well-spoken and likable. Even though Adele knew that Richard had cheated on her with Ellis Grey, her character was strong enough to go into a room, and take control of him.\n\nGordon asks how the storyline of Adele's Alzheimer's came into place, and if has been there since the beginning. Loretta says the storyline came much later, but around the time it showed up on the show, her mother had been experiencing Alzheimer's. Loretta had done a lot of research about this condition and the things that happen in the mind and the whole thing of going back to your memories from the past. From this, it cuts to a scene in the O.R. where Adele is in the O.R. gallery, and she is screaming at Meredith Grey (who she believes is Ellis Grey) to get away from Richard, so Richard starts singing \"My Funny Valentine\", the song from his and Adele's wedding. Loretta says she included this scene among others to show people and relate to people in the audience who are going through the same thing - a loved one with Alzheimer's. She says the most beautiful moments like these were the most devastating moments.\n\nGordon then talks about his most memorable scene of Adele was when she decides to go to the Alzheimer's home. Loretta feels Adele was doing Richard a favor by letting him go to live his life. She says even though other things happened, they loved each other to the end. This leads to Gordon talking about the episode where Adele is in the Alzheimer's home and she is having sex with another resident. She describes the shooting of this scene as the most awkward scene because she had never done a bedroom scene where someone was embracing and touching her.\n\nGordon inquires if Loretta ever had any fan reactions. She says she used to think, \"Adele pregnant? She got to be 90!\". A fan reaction Loretta names is one with a woman at a gas station. As Adele was pregnant in the show, a fan came up to her in a gas station and asked about her trimester and if she was in good health. Loretta realized that the show was so real to a lot of people.\n\nGordon thanks Loretta for sitting with him today, and introduced Michael O'Neill, the man who portrayed Gary Clark in the unforgettable Season 6 Finale. Gordon asks Michael how it came to be that he ended up on Grey's Anatomy. Shonda Rhimes called Michael at home, and explained the storyline to him, from his wife, Alison Clark, to the shooting. Shonda told him it would be a workplace shooting, so Michael said this frightened him, and Shonda said, \"me too.\" That's when he realized they were collaborating.\n\nO'Neill says Shonda was dealing with a very broad tableau - the ease with we get guns, DNRs, how the hospital deals with patients who have lost spouses when they have no one else. He says it was a 360-degree look at the event that led to the shooting. When Gordon compliments Michael's acting, he credits everything to Shonda because of her writing of the episode. Gordon asks what the process and journey to getting to that dark place. Michael says that someone in his family had been killed, so he knew what it felt like to be mourning. He says people don't recover from that, they adpat from it and learn to cope. He thought he wanted to see what could break a person so badly that they would shoot up a place.\n\nGordon asks what it was like shooting the scenes with the cast and crew, and Michael said it was evident that he was in pain and felt broken. There were moments where cast and crew members came by him and placed their hand on his shoulder to help him feel better. He says he is thankful to have been on Grey's Anatomy and especially the season 6 finale.\n\nGordon thanks Michael and Loretta once again, and says goodbye.\n\nThere's no sneak peek at the end of this episode.\n\nEpisode 4: Fred Einesman and Zoanne Clack Edit\n\nGordon introduces Drs. Fred Einesman and Zoanne Clack, both executive producers and real-life doctors. Zoanne is trained as an emergency medicine physician. Fred became a doctor because he says he was kind of a wild kid and he cut his head open. The doctor in the ER was very young and forgot the anesthesia. Fred gritted his teeth and about halfway through, the doctor realized what he'd done and told him he should grow up to be a doctor, so he did. He went to medical school, but also got a film degree at USC. He and Zoanne are both responsible for making sure the medicine is as accurate as possible.\n\nGordon asks them about people coming up to them on the street and saying that something couldn't have happened in real life. Fred says it's more than just them. The show has many more doctors and they rely on experts because they're both trained in emergency medicine. When they call up the specialists and explain the story, they often hear that that would never happen, so they try to make the case for it. By the time they're done, they are so into the story that they ask when it'll be on TV. They've bought into the idea. Even when they do rare cases, they try to get the facts right.\n\nGordon asks about a man being pregnant, like Shane Herman. Zoanne says that was really fun. She wanted to make it work, so they eventually settled on a teratoma, a special kind of tumor. It secretes HCG, so can cause a positive pregnancy test. He then asks about toxic blood, like Marina Rose Wagner. There was a case of a woman who, when they opened her up, everyone passed out and no one knew why. It's still kind of a medical mystery. Then there's the woman who could hear everything happening inside her body, Hayley May. Zoanne says it's a real thing. They actually got a letter after airing from a mother who had had problems with her child and after seeing the episode, they asked for her to be tested for that and that's what she actually had. Next is Nicole Herman and her inoperable brain tumor. Fred says it's one of the most complicated neurosurgical cases he's read about. Then Gordon talks about an episode he was in, directed by Denzel Washington, and the case of Lou, who attacked Meredith in a postictal fugue state. When she was recovering, her jaw was wired shut. They combined that with barotrauma to make it so Meredith couldn't hear or speak. Fred says it's his favorite episode, because Meredith shows all these emotions without saying a word.\n\nGordon asks them about the 300th episode. Zoanne didn't expect to make it there. She didn't expect to get past season three. She's been on the show for over a decade. She's lived her life on the show. Fred says it's surprising because he was a doctor working full-time in a trauma center. Then he got a call to come help and he thought it'd be for a few episodes, but then it wasn't.\n\nEpisode 5: Mimi Melgaard & Thomas Houchins, Linda Klein & Ryan Blank, and Nicole Cramer Edit\n\nGordon welcomes the viewers to the first part and says we're going behind the scenes this week.\n\nHe meets up with custome designer Mimi Melgaard and custome supervisor Thomas Houchins. They are in the \"gold room\", called that because this is where it all happens. The costumes are put together and tagged here. There are also a couple of prosthetic heads on a shelf, which Mimi loves. Gordon asks how they start. Mimi says it always begins with the scripts. Thomas says the characters have morphed and grown, and the clothes have changed with them.\n\nGordon asks about the laundry. Thomas replies 200 sets of scrubs get laundered and are ready fresh and pressed for when the crew comes in in the morning. He asks how many types of scrubs they have. There are a lot of colors, and changing the color for characters is an easy way to make a scene feel like it's set in another hospital, while they are actually shooting it in the same set.\n\nThey go over a few fan favorites. The first is Meredith's prom dress from Losing My Religion. Mimi loves the sparkles at the bottom. Next up is Izzie's prom dress from the same episode. Mimi first had another dress, but Shonda wanted something bigger. Mimi had to see the scene to know what she wanted exactly. Next is April's wedding dress. Thomas shows the crafty way they came up with to add the ketchup stains to it: they have dry painted some flowers in the same fabric and style as are on dress, so they can just overlay those painted flowers. The final one is Cristina's wedding dress. Mimi shares that wedding dresses have lots of layers and are thereby not easy to cut, so they add a piece of fabric in the back that Ellen Pompeo would have to cut instead of the actual dress. Gordon thanks them for letting him into their closet.\n\nHe then moves to the prop room, where supervising producer Linda Klein and prop master Ryan Blank are waiting. They both make sure that what is shown is accurate. Linda says they have the best of the best. Linda has taught Kelly McCreary a certain stitch, and she also teaches actors how to hold the instruments.\n\nThey have gathered some props. There are a lot of prosthetic body parts that a company makes for them. One of them is a prosthetic version of Scott Foley's head, which they now use in a lot of the surgery scenes. Marika Dominczyk noticed it in one of her scenes and freaked out since she immediately recognized him. Ryan has a great prop story. He recalls a scene where the counters in Meredith's kitchen had to be filled with cupcakes. Back when they were planning the episode, the scene was planned for next Thursday so Ryan contacted a food stylist and it was all planned out perfectly. However, due to a set fire, things got changed around and they had to shoot the cupcake scene earlier. Ryan was informed of this at night, so he went to the grocery store at 2 in the morning, pushed the stock guy out of the way, and started shopping with the guy chasing him down the aisles since the store was closed. He then realized his oven did not have the capacity to make 400 cupcakes, so he found these chocolate muffins, chopped the tops off, and he and his assistants took all the muffins the store had. They worked all night and by 8 in the morning, they had all the frosted cupcakes ready. Gordon thanks him for the story.\n\nGordon then sits down with set decorator Nicole Kramer on the set of Meredith's house. Gordon asks about her process. Nicole says she has been on the show so long that she knows the characters. She and her assistant always think about all the stuff, and where and when and why the characters would have purchased it, where it'd be in the house, et cetera. Gordon says a lot of people don't know that the sets get taken apart and put back together regulary. He wants to talk about that. Nicole says they have to take all the set dressing out, then the grips will take the walls away, and she and her team take pictures and print them for whenever the set it put back together. Nicole continuously updates things to make it look like people actually live there. Gordon asks if the actors have input. Nicole says yes and gives Kelly McCreary as an example. At first, her room was pink and a little girly, but Kelly approached her and said she'd think there should be more (medical) books, action figures, and some more nerdy stuff. Next time the room was shown, it was painted and there were more books and Star Wars figurines. Kelly was pleased. Gordon asks about her favorite set decorations or personal touches. Nicole says in early seasons, she put pictures of her friends and their kids on set. They usually use pictures of crew members, and they also put their names on the OR boards. Most recently, she really loved doing the Jolex loft. It contains a lot of her personal touches, so it has a lot of her own esthetic.\n\nGordon reminds us to watch part two.\n\nEpisode 6: Kevin McKidd and Kelly McCreary Edit\n\nGordon welcomes the viewers to part two. After the crew, it's now part to go behind the scenes with Kevin McKidd.\n\nGordon asks Kevin how he came on the show. Kevin says he met Shonda and Betsy while they were casting for Private Practice. He later got a call that Shonda wanted to see him again, but he was doing a movie in Bucharest. He was flying back to surprise his son on his birthday and they only had 24 hours, so Kevin declined to meet Shonda then. That actually made him stand out to Shonda. Then they actually met later and they talked about Owen Hunt. She had a rough idea where they were going to go with him, but she wasn't sure yet.\n\nGordon asks how he prepared for the PTSD. Kevin says he still has a bunch of books on it in his trailer, because he feels it's import to represent it right. He likes how they have shown that Owen could and can still be functional and succesful as a human being, including reconciling with Cristina and building that relationship after he hurt her physically. There's a lot of stigma around PTSD, so it's their responsibility to show that there is a life beyond it.\n\nGordon asks about directing. Kevin says he started asking around if he could shadow directors, and they were open to the idea. His first chance was directing the short webisodes. As he was finishing editing on those, Rob Corn came down to the set as he was doing an interview about the webisodes and told him that he would get to direct the next episode of the show. Kevin was blown away. Gordon asks if it's helpful to also be an actor. Kevin says he's less technical, but he finds it easier to get actors to where they need to be. Gordon asks about directing himself. He didn't like it at first and found it was scary, as you have to use your brain for two completely different tasks. Gordon asks about being directed by other actors. Chandra was a big inspiration to him. She is very laid-back but focused. Everyone has their own style and it comes out in the way they direct. Directing is an intense job, and it amplifies your personality. Kevin wonders what people think about being directed by him, if they consider him the crazy Scotsman. He knows his hair is really wild while he's directing since he is going through it all the time while thinking.\n\nGordon and Kevin shakes hands.\n\nNext up is Kelly McCreary. They sit down on the sofa in Meredith's house, where a lot of pivotal bonding moments have happened. Gordon asks how she came to be on the show. Kelly says she gives all credit to Linda Lowy, who cast her first in Scandal. Then this role came along, and Kelly just thought it was a recurring role. She didn't know she'd play Ellis and Richard's daughter. Gordon also recalls Maggie's saddest moment so far, the death of her mother. Kelly found out at the beginning of season 13 and it had her really excited. William Harper immediately told her that her mother would die. Kelly is really grateful for the experience. It was challenging to play but she had an amazing scene partner. It had all the emotions so it was great.\n\nGordon asks about Maggie's relationships. First Andrew, a little flirt with Riggs. Kelly thinks of her relationship with Andrew as some sort of a new start for Maggie, doing something she had never done in the past. Just flirting and flingy, and then she actually fell for him. Now Maggie is growing and learning. It was a great lesson to be humbled. With Riggs, he just wasn't into her. It was revelatory about how Maggie processes things when she's not in control or doesn't have all the information, since she likes to make informed decisions.\n\nGordon asks about her favorite scene. Kelly says it happened on this set. Maggie is getting drunk with Callie, Meredith, and Amelia, and Maggie has this existential crisis. She had to do some Battlestar: Galactica research to get all the references, which she thinks were very clever. Gordon thanks her for giving them inside into her character.\n\nGordon says goodbye and tells the viewers that next week is the final installment. He offers a sneak peek at the next episode.\n\nEpisode 7: Krista Vernoff Edit\n\nGordon welcomes the viewers for the final episode, in which we'll look at the future of the show. He welcomes Krista, the writer of the 300th episode. He knows she's busy.\n\nHe asks how she came to be on the show. Krista says she'd been writing for seven years. It was staffing season and Shonda brought her in for a meeting. In the lobby, she started talking with Stacy McKee, now showrunner of the upcoming spinoff, about American Idol. Someone from inside the room yelled not to talk about American Idol without her and Shonda came running out. The meeting was basically a discussion about American Idol and Shonda hired her. Gordon says she knew Shonda before she become known. Krista says Shonda was terrified and bewildered as all writers are when they make their first something. It's been amazing to see her becoming.\n\nGordon notes Krista wrote several key episodes in the first season, among them the one with the woman with the giant abdominal tumor. He asks if she had all of that already set out. Krista says she thinks that's how she became head writer. The key to writing for someone else's show is the ability to voice match. Her writing voice naturally matches Shonda's and Shonda recognized that. She was also the inspiration for the now infamous \"Seriously\", but she credits Shonda for taking it home. It made Shonda crazy when Krista said it in the writer's room, so Shonda put it in one script a dozen times. Shonda has a way of turning things up to eleven.\n\nGordon asks about Into You Like a Train, which she was nominated for an Emmy for. Krista says somebody had the idea to have to people stuck on a pole together. She loves that they are dealing with heavy stuff while the hour is largely comedy. That's what she's been trying to bring back in the fourteenth season. It keeps you laughing until you're crying. That's what she wants.\n\nAnother famous episode is Six Days, Parts 1 and 2, which is very personal for Krista. She wrote it about her own father's death and it's very close to what happened in real life. That week, she laughed and cried harder than she ever did. It was cathartic for her, and it includes her favorite line she's ever written for Grey's Anatomy: \"I don't know how to live in a world where my dad doesn't.\" Gordon thanks her for bringing that emotional moment back up.\n\nAlso famous is the season six premiere, which spans the thirty days after George's death. Shonda made the decision to hit George with a bus. They watched that episode together, and when Meredith puzzled together that it was George, Krista shouted and cried even though she knew it was coming. It was devastating. She was then tasked to write an episode where they have to come back from that. A lot of people have died and grieved on the show, and grieving the death of fictional characters opens the door to our own grief in real life and allowing yourself to feel it.\n\nAnother infamous episode is Disarm. Gordon says the show always gives you a 360 degree look at charactes, and he asks if that's intentional. Krista says they focused more on the shooter's mother rather than the shooter himself. Mental illness is real and sometimes people can't control it. It was a complicated episode to write, as well as her last episode before she left. She continued to watch through Mark and Lexie's death. She was mad and cried. She also watched Cristina's last episode and congratulated Shonda on it. Writing Cristina for Sandra was one of the privileges of her career.\n\nGordon asks what they can expect for the 300th episode. Krista replies she created an Easter egg hunt for the people who have been watching for all those years. There will be people we haven't seen in a while. Gordon asks her to give the fans something. He will give her a name and she has to give one word to describe their upcoming stories. Meredith is medical superhero. Bailey brings the drama. Webber brings the funny. He's satisfied with that.\n\nHe thanks her for all those years of Grey's Anatomy. She appreciates everybody watching the show and continuing to support it, especially the originals who have stayed around. Ellen always jokes she's too perky for the fourteenth season but blames that on the seven-year break. Krista is just really happy to be back.\n\nGordon says goodbye and thanks the viewers for coming on this journey with him. Finally, there's a sneak peek of the 300th episode.\n\nEpisode 8: Debbie Allen Edit\n\nGordon welcomes the viewers to a bonus instalment to talk about the 300th episode itself and get some scoop on the mid-season finale from actor, director, and executive producer Debbie Allen.\n\nGordon asks how she met Shonda Rhimes. They met at the Debbie Allen Dance Academy. She brought her daughter to train with Debbie, and then she got a call if she was interested in directing. Debbie happily accepted the opportunity and she felt so in her skin on the set that it felt like coming home. Her favorite episode to have directed is the dinner table episode. She also fondly commemorates Ellen Pompeo directing her first episode. She thinks Ellen did so well. She loves having actors who become directors because they speak the actors' language.\n\nGordon asks about directing the 300th episode. Debbie says it was epic to have a 300th episode in the first place. It was like they were looking back and forward in time. It shows a lot of progress for both the show and the actors. They have a lot to look forward to.\n\nGordon brings up her first appearance as Catherine Avery. Debbie wasn't sure if it was going to happen when Shonda first brought it up, but it did. The way she was introduced was very remarkable. She's very happy about the marriage between Catherine and Richard. Gordon asks how they created that character. Debbie says she's not new at playing a boss. It required her to learn a lot of medical terms. The OR scenes are like a choreography, but with needles and equipment. Her first surgery scene, her stand-in never got to work since she rehearsed the whole time. Gordon asks where she and Richard are headed. Debbie is glad they're done fighting. The stuff between Maggie and Jackson is getting ready to heat up. Gordon also points out the relationship between Bailey and Catherine. Debbie says it's wonderful. Catherine sees something in Bailey.\n\nGordon asks what it was like to become an executive producer as of season 12. Each producer has a different role and Debbie's is directors. Debbie had no idea what would happen when Shonda offered her the job, but she accepted the offer within 2 hours. She's looking for new talent and her door is wide open to women and people of diverse cultures. She's also interested in the young director.\n\nGordon asks about her favorite episode as a fan of the show. Debbie picks Ring of Fire because it shows that life can hit you out of nowhere when things are going smoothly.\n\nGordon thanks Debbie for taking the time and the viewers for watching. Debbie then tells the viewers to keep watching for a sneak peek for the mid-season finale.\n\nNotes and Trivia Edit\n\nWhile initially announced as a seven-part webisode series, a surprise eighth episode with guest Debbie Allen was released after the 300th episode.\n\nEpisode 5 and 6 were released together as two parts of one episode.", "images": ["https://web.archive.org/web/20200422014819im_/https://vignette.wikia.nocookie.net/greysanatomy/images/8/89/Wiki-wordmark.png/revision/latest?cb=20190621202210", "https://web.archive.org/web/20200422014819im_/https://vignette.wikia.nocookie.net/greysanatomy/images/5/50/GAPostOp.jpg/revision/latest/scale-to-width-down/180?cb=20171109094120", "https://web.archive.org/web/20200422014819im_/https://vignette.wikia.nocookie.net/bourne/images/6/68/Treadstone_Banner_%281%29.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20191125210358", "https://web.archive.org/web/20200422014819im_/https://slot1-images.wikia.nocookie.net/__cb1587492310019/common/extensions/wikia/WikiaBar/images/wikiabarIcon.png", "https://web.archive.org/web/20200422014819im_/https://vignette.wikia.nocookie.net/letsgoluna/images/c/cd/Erik-Luna-article-2-copy.png/revision/latest/zoom-crop/width/100/height/56?cb=20200327133046", "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D", "https://web.archive.org/web/20200422014819im_/https://vignette.wikia.nocookie.net/greysanatomy/images/5/50/GAPostOp.jpg/revision/latest?cb=20171109094120", "https://web.archive.org/web/20200422014819im_/https://vignette.wikia.nocookie.net/spotlightsimagestemporary/images/5/5a/Kenshin.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20200318084702"], "top_img": "https://web.archive.org/web/20200422014819im_/https://vignette.wikia.nocookie.net/greysanatomy/images/5/50/GAPostOp.jpg/revision/latest?cb=20171109094120", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20200422014819/https://greysanatomy.fandom.com/wiki/Grey%27s_Anatomy:_Post-Op", "title": "Grey's Anatomy: Post-Op", "meta_data": {"viewport": "width=device-width, user-scalable=yes", "generator": "MediaWiki 1.19.24", "keywords": "Grey's Anatomy Universe Wiki,greysanatomy,Grey's Anatomy: Post-Op,Gordon James,Grey's Anatomy,Nurse Gregory,The Sound of Silence,Perfect Storm,Sleeping at Last,Tony Phelan,Song Beneath the Song,Nicole Cummins,Paramedic Nicole Cummins", "description": "Grey's Anatomy: Post-Op is an eight-part web series where Gordon James talks to cast, writers, producers, and/or crew members. The series was released in the weeks leading up to the 300th episode of Grey's Anatomy with the first episode released October 4, 2017. The guests will look back on the...", "twitter": {"card": "summary", "site": "@getfandom", "url": "https://web.archive.org/web/20200422014819im_/https://greysanatomy.fandom.com/wiki/Grey%27s_Anatomy:_Post-Op", "title": "Grey's Anatomy: Post-Op | Grey's Anatomy Universe Wiki | Fandom", "description": "Grey's Anatomy: Post-Op is an eight-part web series where Gordon James talks to cast, writers, producers, and/or crew members. The series was released in the weeks leading up to the 300th episode..."}, "fb": {"app_id": 112328095453510}, "og": {"type": "article", "site_name": "Grey's Anatomy Universe Wiki", "title": "Grey's Anatomy: Post-Op", "description": "Grey's Anatomy: Post-Op is an eight-part web series where Gordon James talks to cast, writers, producers, and/or crew members. The series was released in the weeks leading up to the 300th episode of Grey's Anatomy with the first episode released October 4, 2017. The guests will look back on the past season of Grey's Anatomy, while each episode will also offer sneak peeks from upcoming season fourteen episodes. Contents[show] Episodes Episode 1: Alexandra Patsavas Gordon welcomes the viewers...", "url": "https://web.archive.org/web/20200422014819/https://greysanatomy.fandom.com/wiki/Grey%27s_Anatomy:_Post-Op", "image": "https://web.archive.org/web/20200422014819im_/https://vignette.wikia.nocookie.net/greysanatomy/images/5/50/GAPostOp.jpg/revision/latest?cb=20171109094120"}, "apple-itunes-app": "app-id=1002364550, app-arguments=https://greysanatomy.fandom.com/wiki/Grey%27s_Anatomy:_Post-Op"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}