{"url": "https://web.archive.org/web/20181004124208/https://www.worldlifestyle.com/celebs/jennifer-love-hewitt-once-looked-like-she-was-set-up-for-a-list-stardom-but-now-shes-fizzled-from-the-spotlight", "text": "Jennifer Love Hewitt Once Looked Like She Was Set Up For A-List Stardom-But Now She’s Fizzled From The Spotlight\n\nJennifer Love Hewitt at one point seemed to be in the perfect position for A-list stardom, however many people were disappointed to see her fizzle out from the spotlight without a word. She is best known for her roles in Party of Five and I Know What You Did Last Summer, and she was hailed as Hollywood's next big thing in the 1990s. Hewitt began her career as a child actress and singer, and she appeared in national television commercials before joining the cast of the Disney Channel series 'Kids Incorporated'.She was also performing as a backup singer before she recorded her debut studio album at the age of 12, entitled 'Love Songs' which was exclusively released in Japan. Early on in the 21st century, the actress struggled to sustain her early success, and she hasn't been on the big screen since 2012.\n\nThe Beginning\n\nBorn in the Texan city of Waco in 1979, Hewitt began performing at the young age of six. Then, after she relocated to Los Angeles to follow her dreams in show business, the future actress ended up booking over 20 television commercials and she became a regular on the Disney Channel series, and she also went on to land roles in Shaky Ground, The Byrds of Paradise and McKenna. Unfortunately, none of these series went on to receive second seasons.\n\nHer Big Break\n\nHewitt's big break came in 1995 when she was cast as Sarah Reeves Merrin in the Fox family drama Party of Five. She then went on to do four years on the Golden Globe-winning series and then appeared in the spin-off, Time of Your Life. When Hewitt left the show in 1999, she seemed to be set up to enjoy A-list stardom in Hollywood.\n\nThe Scream Queen\n\nAt this point, Hewitt was known as a horror queen since she starred in the 1997 horror film I Know What You Did Last Summer and the 1998 sequel. She kicked off her career on the big screen with the 1992 indie film entitled Munchie and then taking the lead in Little Miss Millions a year later. She found great success in films Sister Act 2: Back in the Habit and Can't Hardly Wait.\n\nA Shining Career\n\nAfter Hewitt decided to leave Party of Five, and her talent shone through with her portrayal of Audrey Hepburn in a 2000 television movie. She then starred in films that were negatively received by critics but where commercially successful such as Heartbreakers, The Tuxedo and Garfield. Then in 2005, the actress decided to head back to the small screen to take the leading role in CBS supernatural drama 'Ghost Whisperer'.\n\nADVERTISEMENT\n\nGolden Globe Nomination\n\nHewitt's talent was truly notarized when she received a Golden Globe nomination for her performance in Lifetime movie The Client List. The film was later adapted into a series that she executive produced. While her career on the small screen took off, her career on the silver screen fizzled out. Her 2008 film Delgo failed at the box office, while 2010's Cafe bypassed theaters altogether. 2012's Jewtopia was critically savaged-leading to it receiving a Rotten Tomatoes rating of just 10 percent.\n\nHer Recording Career\n\nBy this point in her life, her recording artist career had completely depleted. The star had been a Japanese sensation as a teenager due to her 1992 pop debut of 'Love Songs'. Her first two U.S. albums didn't exactly hit, and even if her 2002 fourth studio effort reached number 37 on the Billboard 200, it appears to have been her only saving grace in the recording world.\n\nHer Pregnancy\n\nIn 2014, Hewitt was cast as Agent Kate Callahan in the long-running police procedural Criminal Minds. While the role could have possibly been her dedicated return to household-name status, she was forced to give up the part at the end of the first season when she became pregnant. She gave birth to her second child, Atticus, in June 2015, which was 18 months after having welcomed her daughter Autumn, into the world.\n\nHer Marriage\n\nThe father of Hewitt's beautiful children is her former The Client List castmate, Brian Hallisay. The couple got engaged in the summer of 2013 and they walked down the aisle just a few months later. Hewitt's previous relationships included actors Ross McCall, Jamie Kennedy, and LFO singer Rich Cronin.\n\nADVERTISEMENT\n\nMissing In Action\n\nAlthough Hewitt returned to work very soon after the birth of her first child, it seems that she has been quite MIA since the birth of her second child. It seems as though she has become something of a recluse int he four years since her son, Atticus was born. So, what could have possibly caused the actress the shy away from the spotlight?\n\nCritical Response\n\nIt is possible that Hewitt has been burned by the scathing critical response to many of her films. In 2016, she was actually labeled as Hollywood's worst-reviewed actress in a poll that was based on her Metacritic score. Her score isn't much better on Rotten Tomatoes either, seeing as every single one of her movies rated on the site has been declared as 'rotten'.\n\nDiva Tendencies?\n\nThere are also many rumors that Hewitt has diva tendencies, and this speculation may have possibly deterred casting directors from hiring her. In 2013, for instance, she apparently clashed with the producers over the third season of The Client List. Hewitt apparently requested that her future husband and co-star, Brian Hallisay, play the father of her character's child. The producers of the show weren't exactly convinced and after a very lengthy stalemate, the show was canceled entirely.\n\nHypochondriac?\n\nSince Hewitt admitted that she was a hypochondriac, it is possible that this may have deterred some producers from working with her. The star told The Times of India, \"I am a terrible hypochondriac. I have every illness known to man. And I am pretty sure I have had the bird flu four or five times. I know I drive people mad with my phobias.\"\n\nADVERTISEMENT\n\nBody Image\n\nIn 2008, Hewitt was apparently seen as incredibly hypocritical for her mixed messages on body image. The star was initially praised for her response to a less-than-flattering paparazzi shot; and she said at the time, \"To all girls with butts, boobs, hips and a waist, put on a bikini. Put it on and stay strong.\" Then, later on, that year, Hewitt also celebrated losing 18 pounds in just over two months by taking part in a magazine shoot.\n\nNot Likeable\n\nIt was stunts like this that could possibly explain why Hewitt isn't' really deemed as the most likable of actresses by female cinema-goers. It appears that throughout her career she has had her fair share of critics, and she once declared that she was quitting Twitter due to the overwhelmingly negative responses she had to deal with on the social media platform. Given that propensity for divisiveness, Hollywood probably sees casting Hewitt as a major risk.\n\nUnpopular Show\n\nHewitt's appearance on 'Criminal Minds' proved to be so unpopular that many viewers of the show even petitioned for her to be fired. While Hewitt's character, FBI agent Kate Callahan, was written out of the show, it was only because the star had become pregnant in real life.\n\nChaos Of Hollywood\n\nIt is possible that Hewitt is content to leave the chaos of Hollywood completely behind. In 2015, she suggested that she would be taking some time out for herself, saying to American baby, \"I've been an actress for 25 years and have had to be hungry at times for my career. Because so many of us are busy or driven, we forget to take care of ourselves. I hope to continue to be a little kinder to myself after pregnancy.\"\n\nADVERTISEMENT\n\nRaising Her Family\n\nOf course, it could also have to do with just wanting time to raise her family. The star regularly posts photos of her family life with her husband and her children on social media platforms. However, in an effort to retain her children's privacy, she restricts pictures of Autumn and Atticus to backs of heads and silhouettes. It seems as though she is trying to keep her family life very private.\n\nOut Of The Spotlight\n\nWhile Hewitt has largely stayed out of the spotlight since 2012, she did find herself in the headlines in July 2017 due to her former co-star Scott Wolf. During an appearance on Watch What Happens Live with Andy Cohen, the actor was asked which Party of Five cast member had hooked up with the most fans. Wolf then pointed to Hewitt's head.\n\nBacktracking\n\nWolf soon backtracked on his answer on Twitter, where he wrote, \"The joke I made about @TheReal_Jlh on @BravoWWHL was absurd and obviously not true. She's awesome, these are JOKES people. Sorry Love!\" Even so, in keeping with her new-found low profile, Hewitt didn't publicly respond.", "images": ["https://web.archive.org/web/20181004124208im_/https://s23257.pcdn.co/wp-content/uploads/2016/08/logonew.png", "https://web.archive.org/web/20181004124208im_/https://s23257.pcdn.co/wp-content/uploads/2018/10/09-Jennifer-Love-Hewitt-and-Brian-Hallisay-720x722-1.jpg", "https://web.archive.org/web/20181004124208im_/https://s23257.pcdn.co/wp-content/uploads/2018/10/12-Jennifer-Love-Hewitt-720x882.jpg", "https://web.archive.org/web/20181004124208im_/https://s23257.pcdn.co/wp-content/uploads/2018/10/07-Jennifer-Love-Hewitt-685x1024.jpg", "https://web.archive.org/web/20181004124208im_/https://s23257.pcdn.co/wp-content/uploads/2018/10/20-Jennifer-Love-Hewitt-720x480.jpg", "https://web.archive.org/web/20181004124208im_/https://s23257.pcdn.co/wp-content/uploads/2018/10/19-Watch-What-Happens-Live-with-Andy-Cohen-720x411.jpg", "https://web.archive.org/web/20181004124208im_/https://web.adblade.com/orders_t.php?id=29207", "https://web.archive.org/web/20181004124208im_/https://s23257.pcdn.co/wp-content/uploads/2018/10/03-Jennifer-Love-Hewitt-2-720x738.jpg", "https://web.archive.org/web/20181004124208im_/https://trc.taboola.com/1003311/log/3/unip?en=view_content", "https://web.archive.org/web/20181004124208im_/https://s23257.pcdn.co/wp-content/uploads/2018/10/10-Jennifer-Love-Hewitt-720x960.jpg", "https://web.archive.org/web/20181004124208im_/https://s23257.pcdn.co/wp-content/uploads/2018/10/05-Jennifer-Love-Hewitt-720x803.jpg", "https://web.archive.org/web/20181004124208im_/https://s23257.pcdn.co/wp-content/uploads/2018/10/17-Jennifer-Love-Hewitt-720x935.jpg", "https://web.archive.org/web/20181004124208im_/https://s23257.pcdn.co/wp-content/uploads/2018/10/18-Jennifer-Love-Hewitt-and-her-kid-720x720.jpg", "https://web.archive.org/web/20181004124208im_/https://s23257.pcdn.co/wp-content/uploads/2018/10/14-Jennifer-Love-Hewitt-720x1130.jpg", "https://web.archive.org/web/20181004124208im_/https://www.worldlifestyle.com/favicon.ico", "https://web.archive.org/web/20181004124208im_/https://s23257.pcdn.co/wp-content/uploads/2018/10/16-Jennifer-Love-Hewitt-683x1024.jpg", "https://web.archive.org/web/20181004124208im_/https://s23257.pcdn.co/wp-content/uploads/2018/10/15-Jennifer-Love-Hewitt-720x1000-9.jpg", "https://web.archive.org/web/20181004124208im_/https://s23257.pcdn.co/wp-content/uploads/2018/10/06-Jennifer-Love-Hewitt-720x1137.jpg", "https://web.archive.org/web/20181004124208im_/https://s23257.pcdn.co/wp-content/uploads/2018/10/08-Jennifer-Love-Hewitt-720x1121-2.jpg", "https://web.archive.org/web/20181004124208im_/https://s23257.pcdn.co/wp-content/uploads/2018/10/13-Jennifer-Love-Hewitt-681x1024-2.jpg", "https://web.archive.org/web/20181004124208im_/https://s23257.pcdn.co/wp-content/uploads/2016/08/logo-desktop.png", "https://web.archive.org/web/20181004124208im_/https://s23257.pcdn.co/wp-content/uploads/2018/10/02-young-Jennifer-Love-Hewitt-720x720.jpg", "https://web.archive.org/web/20181004124208im_/https://s23257.pcdn.co/wp-content/uploads/2018/10/04-Jennifer-Love-Hewitt-680x1024.jpg", "https://web.archive.org/web/20181004124208im_/https://s23257.pcdn.co/wp-content/uploads/2018/10/intro-1526482989-760x428.jpg", "https://web.archive.org/web/20181004124208im_/https://s23257.pcdn.co/wp-content/uploads/2018/10/11-Jennifer-Love-Hewitt-720x720.jpg"], "top_img": "https://web.archive.org/web/20181004124208im_/https://www.worldlifestyle.com/favicon.ico", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20181004124208/https://www.worldlifestyle.com/celebs/jennifer-love-hewitt-once-looked-like-she-was-set-up-for-a-list-stardom-but-now-shes-fizzled-from-the-spotlight", "title": "Jennifer Love Hewitt Once Looked Like She Was Set Up For A-List Stardom-But Now She’s Fizzled From The Spotlight", "meta_data": {"fb": {"app_id": 779918478778656, "pages": 360701407356668}, "dxcheck": {"online": "true"}, "viewport": "width=device-width, initial-scale=1", "generator": "WordPress 4.9.7", "ia": {"markup_url_dev": "https://www.worldlifestyle.com/celebs/jennifer-love-hewitt-once-looked-like-she-was-set-up-for-a-list-stardom-but-now-shes-fizzled-from-the-spotlight?ia_markup=1"}, "wp-parsely_version": "1.13.0", "msapplication-TileImage": "https://s23257.pcdn.co/wp-content/uploads/2016/08/cropped-favicon-270x270.png"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}