{"url": "https://www.usatoday.com/story/life/people/2018/04/02/meek-mill-remain-behind-bars-during-appeal-judge-denies-bail-request/479919002/", "text": "Meek Mill to remain behind bars during appeal as judge denies bail request\n\nPHILADELPHIA (AP) — A judge has ruled Meek Mill should remain behind bars while appealing a prison sentence for violating probation, saying the rapper's drug use, arrests and other issues while under supervision merited the jail time.\n\nJudge Genece Brinkley turned down Mill's bid for release on bail in a ruling late Thursday while he appeals the 2- to 4-year sentence she issued for what she said was his fifth probation violation.\n\nThe judge also defended herself against attacks by Mill's legal and public relations team, which continued after her latest decision.\n\n\"This court has impartially and without prejudice presided over numerous proceedings in this matter since 2008, long before his current counsel became involved one week before the violation of probation hearing,\" Brinkley wrote. \"None of the allegations by (the) defendant constitute evidence that this court is unable to act impartially and without personal bias or prejudice with respect to this matter.\"\n\nMore: Meek Mill could be freed: Arresting cop may have lied, DA won't oppose rapper's release\n\nShe said Mill has raised \"unmeritorious claims of impropriety in an attempt to unfairly judge shop.\"\n\nAn attorney for Mill, Joe Tacopina, said in a statement Monday that the latest ruling \"reaffirms the fact she has turned Meek Mill's case into a personal vendetta.\"\n\nHe pointed to a statement two weeks ago by city prosecutors, who said they are not opposed to having Mill released on bail because of what they said was a likelihood the original conviction may be partly or completely reversed. The arresting officer in Mill's case was among the police officers the prosecutor's office has sought to keep off the stand because of credibility questions.\n\nThe DA's office also said it has a policy of generally not requesting more than six to 12 months for technical violations of probation and parole.\n\nBrinkley said in a lengthy opinion that jail time was warranted because during probation, Mill, 30, tested positive for opiates, got arrested in St. Louis and New York and made travel or performance plans without getting the required approval.\n\nMill's lawyers have asked the state Supreme Court to let him out on bail and to replace Brinkley as the presiding judge in the case.\n\nMill was charged in March 2017 with assault for an alleged fight in the St. Louis airport, charges the judge said were later reduced to summary offenses. He was then charged in August with felony reckless endangerment for allegedly driving an all-terrain vehicle in New York City, a matter resolved by \"a negotiated resolution\" through a diversionary program that required him to perform community service", "images": ["https://www.gannett-cdn.com/-mm-/2f860aa9bb0a968180b1376f3ed24e50be5cbfc1/c=211-0-3520-2488/local/-/media/2018/04/02/USATODAY/USATODAY/636582883653992779-AP-MEEK-MILL-98883030.JPG?width=320&height=240", "https://www.gannett-cdn.com/-mm-/f7e1242970c3364e7d8c720132bb597896e4fe25/c=0-190-3732-2298/local/-/media/2018/04/02/USATODAY/USATODAY/636582883653992779-AP-MEEK-MILL-98883030.JPG?auto=webp&format=pjpg&width=1200", "https://www.gannett-cdn.com/appservices/universal-web/universal/icons/icon-instagram_24.png"], "top_img": "https://www.gannett-cdn.com/-mm-/f7e1242970c3364e7d8c720132bb597896e4fe25/c=0-190-3732-2298/local/-/media/2018/04/02/USATODAY/USATODAY/636582883653992779-AP-MEEK-MILL-98883030.JPG?auto=webp&format=pjpg&width=1200", "keywords": [], "authors": [], "canonical_link": "https://www.usatoday.com/story/life/people/2018/04/02/meek-mill-remain-behind-bars-during-appeal-judge-denies-bail-request/479919002/", "title": "Meek Mill to remain behind bars during appeal as judge denies bail request", "meta_data": {"viewport": "width=device-width,initial-scale=1", "HandheldFriendly": "True", "MobileOptimized": 320, "apple-itunes-app": "app-id=504631398, app-argument=https://www.usatoday.com/story/life/people/2018/04/02/meek-mill-remain-behind-bars-during-appeal-judge-denies-bail-request/479919002/life/people", "theme-color": "#ffffff", "og": {"type": "article", "title": "Meek Mill to remain behind bars during appeal as judge denies bail request", "description": "Meek Mill will remain behind bars while appealing a prison sentence after bail was denied on Thursday.", "site_name": "Associated Press", "image": {"identifier": "https://www.gannett-cdn.com/-mm-/f7e1242970c3364e7d8c720132bb597896e4fe25/c=0-190-3732-2298/local/-/media/2018/04/02/USATODAY/USATODAY/636582883653992779-AP-MEEK-MILL-98883030.JPG?auto=webp&format=pjpg&width=1200", "width": 1200, "height": 675}}, "article": {"content_tier": "free", "opinion": "false"}, "fb": {"pages": 13652355666}, "description": "Meek Mill will remain behind bars while appealing a prison sentence after bail was denied on Thursday.", "twitter": {"site": "@usatoday", "creator": "@usatoday", "card": "summary_large_image"}}, "movies": [], "publish_date": 1522623600.0, "source": "https://www.usatoday.com", "summary": ""}