{"url": "https://www.cnn.com/2018/06/08/entertainment/amal-clooney-speech-george-clooney/index.html", "text": "CNN —\n\nGeorge and Amal Clooney may be the ultimate couple goal.\n\nThe actor was awarded the American Film Institute’s Life Achievement Award on Thursday. Don Cheadle, Bill Murray, Anna Kendrick and Cate Blanchett were among those who paid tribute to Clooney’s accomplishments in Hollywood, but it was his wife’s heartfelt speech that moved him to tears.\n\n“Although George’s modesty attributes much of the success we are celebrating here tonight to luck, I think it’s incredible talent and character that got him here and these attributes also make him an amazing husband and father,” Amal said.\n\nIn her tribute – video of which was shared on social media by some in attendance – Amal joked that before she met her husband, she thought she was destined to “be a spinster.”\n\n“I couldn’t sleep when we were apart and I’m told that I would display a particular grin and head tilt when reading his text messages or the letters that he would hide in my bag,” she said. “Five years later, none of that has changed. He is the person who has my complete admiration and also the person whose smile makes me melt every time.”\n\nGeorge began to visibly tear up when Amal spoke about his most recent role – dad to their twins.\n\n“My love, what I have found with you is the great love that I always hoped existed,” she said. “Seeing you with our children, Ella and Alexander, is the greatest joy in my life. You fill our home with laughter and happiness and that’s even before the children have worked out that ‘dada’ is actually Batman, a talking fox, and friends with Mary Poppins.”\n\nThe couple married in Venice, Italy, in 2014 and welcomed their twins in June of last year.\n\n“I’m proud of you,” Amal concluded. “But I also know that when our children find out not only what you have done, but who you are, they will be so proud of you, too.”\n\nTNT will air “AFI Life Achievement Award: A Tribute to George Clooney” on June 21.", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/170126173139-chloe-melas.jpg?c=16x9&q=h_270,w_480,c_fill/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/180608095343-amal-clooney-george-clooney.jpg?q=x_3,y_77,h_1684,w_2993,c_crop/w_800"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/180608095343-amal-clooney-george-clooney.jpg?q=x_3,y_77,h_1684,w_2993,c_crop/w_800", "keywords": [], "authors": ["Chloe Melas"], "canonical_link": "https://www.cnn.com/2018/06/08/entertainment/amal-clooney-speech-george-clooney/index.html", "title": "George Clooney receives AFI Award: Amal Clooney's tribute brought him to tears", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "George Clooney brought to tears by Amal's heartfelt tribute | CNN", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180608095343-amal-clooney-george-clooney.jpg?q=x_3,y_77,h_1684,w_2993,c_crop/w_800", "type": "article", "url": "https://www.cnn.com/2018/06/08/entertainment/amal-clooney-speech-george-clooney/index.html", "site_name": "CNN"}, "twitter": {"title": "George Clooney brought to tears by Amal's heartfelt tribute | CNN", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180608095343-amal-clooney-george-clooney.jpg?q=x_3,y_77,h_1684,w_2993,c_crop/w_800", "card": "summary_large_image", "site": "@CNNent"}, "template_type": "article_leaf", "type": "article", "meta-section": "entertainment", "theme": "entertainment", "article": {"published_time": "2018-06-08T17:21:18Z", "modified_time": "2018-06-08T17:21:18Z", "tag": "amal clooney, celebrities, george clooney", "publisher": "https://www.facebook.com/CNN"}, "keywords": "amal clooney, celebrities, george clooney", "author": "Chloe Melas", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1528412400.0, "source": "https://www.cnn.com", "summary": ""}