{"url": "http://www.cq.com/doc/newsmakertranscripts-4942265?3", "text": "Democratic Vice Presidential Nominee Tim Kaine Delivers Remarks at Campaign Event in Fayetteville, N.C.\n\nKAINE:\n\nHey guys. Great to be with you. Thank you. What a great group. I am so glad, I am so glad to be here in North Carolina, you are very important this year. You're very important. And I'm so glad to be here with Anne. Please have a seat.\n\nWhen I do a campaign event with Anne, it's like going on vacation. This is like fantastic. And the ability to do events last night in Asheville and we're here in Fayetteville today, really means a lot to us.\n\nWe're not in North Carolina by accident. We're here because we're going to win North Carolina. And that's why we're here. That's why we're here.\n\n(APPLAUSE)\n\nAnd what a great group of friends. I've seen folks that I've known for a while and I have seen a Richmond neighbor of mine who drove down because he thought it would be easier to see me here than in Richmond these days, Charlie. But we're just glad to have this chance to be here at the Botanical Garden. This is a beautiful place.\n\nWe have a botanical garden in Richmond, near us about a mile away. And I know how central to the life of a community, a great educational institution like this is. So thank you guys for opening up and hosting.\n\nLet me do a couple of thanks and then I just really want to talk about what's at stake in the election and then I want to get to how do we win it. So, some thank you's and some acknowledgements. Judy didn't really brag about herself when she came and spoke. Judy is a 17 year Army vet. And we, OK, I know.\n\n(APPLAUSE)\n\nThis is a proud Army town, with a great Army and with Pope Field also great Army and great Air Force tradition. I hope you won't mind Marine parents being up here with the Lejuene connection rather than a Fayetteville connection. But, Judy was 17 years but then has been like one of these great serial entrepreneurs starting businesses, numerous businesses since she left active duty.\n\nAnd that is just exactly the kind of thing I wanted to do when I introduced my True Talent Act was to enable people when they are in active duty, to get the kind of skills and training. So that when they get out, they don't have to flounder around, but instead all of their skills, all of their talents, all of their leadership can be put to work just like that.\n\nNot only be economically successful but sharing your talents with the broader community because everybody who's in active duty has a lot of talents to share with the broader community. When they move to veteran status, so Judy you're just an example of the kind of thing I'm working on on, the Armed Services Committee. Give her and everybody like Judy a big round of applause.\n\n(APPLAUSE)\n\nWe had, had fun visiting with some elected officials backstage. I'm one of the few people that have been in local office, state office, federal office and I really appreciate what everybody brings to the table. And it doesn't work unless you work together. My wife talked about Governor Hunt his wife Carolyn, these are dear friends.\n\nI expanded early childhood education dramatically when I was governor. Even though we were in a recession. Even though we were having to cut the budget. This was one thing along with veteran services that we expanded.\n\nKAINE:\n\nBut I wouldn't have been able to do it had I not had Jim Hunt come up and again and again and make the case, and tell my business community and tell my legislators of both parties what a great thing early childhood education is. So thank you guys so much. Thank you.\n\nI visited with Linda Coleman, your great candidate for lieutenant governor, who spoke during the pre-program, give her a round of applause, absolutely ...\n\n(APPLAUSE)\n\n... and also Mitch Colvin who's the mayor pro tem on the Fayetteville City Council and a councilman along with other members of the Fayetteville City Council and the Cumberland County Commission and your delegation to the North Carolina General Assembly.\n\nIt's not easy to be in politics. A lot of sacrifices, family time chief among them, so everybody who is doing that job deserves your thanks. Can you give them a round of applause, and say thanks for what you're doing, and all our candidates?\n\n(APPLAUSE)\n\nAnd I also met the sheriff and all the law enforcement folks who are needed to make an event like this go and keep us safe. Give them a round of applause and thank them for the work they do.\n\n(APPLAUSE)\n\nI am so proud to be on this ticket. I am so proud to be on this ticket. It is a surprise. I grew up in an iron working shop. My dad was an iron worker and welder, and we weren't into politics growing up, and they stood with me on the stage in Philadelphia with the balloons falling, seeing me get on to this ticket and it was just like, could this have happened?\n\nI'm proud for a lot of reasons. Hillary Clinton did call me at 7:32 pm on Friday, July 22nd to ask if I'd join the ticket. That was a memorable moment in my life.\n\nI'm not going to forget it. And of course when she asked I was proud to say yes because Hillary Clinton, as President Obama said during his wonderful speech on the Wednesday night at the Convention, is the most qualified person to be nominated to be a national party's candidate for a very long time and maybe ever. Maybe ever.\n\nTo work with somebody that has that track record, that life of service, of putting kids and families at the center of everything from her Methodist youth group in the suburbs of Chicago when she was a teenager all the way to first lady of Arkansas, first lady of the U.S., U.S. senator, secretary of state - always putting kids and families first, sometimes winning, sometimes losing but never backing down, never backing away, never giving up, always pushing forward to try to lighten the burden and measure our society's success by the success of our families and kids.\n\nSo of course I was proud to say yes when she asked me. But there was another reason I was proud to say yes, or maybe enthusiastic with an exclamation point. And I bet everybody out here will get exactly what I'm talking about.\n\nMy mom was with me on stage - let me see if I can do that - my mom was with me on stage. She's 81. Balloons were falling everywhere. And in the middle of that, after Hillary accepted the nomination, we were there together, my mom said, \"This is the best night of my life.\"\n\n(APPLAUSE)\n\nNow, some of that was because of me. I don't think my mom would have been on stage had I not been the nominee, so - I get a little credit for it - but what my mom was really saying, really saying, is, what a great thing for me to stand on this stage when the Democratic party has nominated a woman to be president of the United States.\n\nThat's what she was saying to me. That's what she was saying to me.\n\n(APPLAUSE)\n\nIf you think about - here's the way we look in Virginia. We're history buffs just like North Carolinians are. Here's the way we look at this thing.\n\nKAINE:\n\nVirginians said in 1776, we're gonna measure the whole stake of this enterprise by equality.\n\nThat's going to be the north star, that's going to be the yardstick. Now when he said it, he wasn't living that way and society wasn't living that way. But it's like a sailor that goes, you know, that navigates by the north star. You may never get to the north star, but you set it out there as the fixed point that you're going to go after.\n\nAnd so our history has been this, from the statement that equality --\n\n(AUDIO GAP)\n\n-- six years later. And we have just nominated a woman. We know we haven't had a woman President. But in Congress right now, we're doing the best job we have ever done in women in the Federal legislature, 19 percent, that's the best job we've ever done.\n\nHold on for this folks. Nineteen percent ranks the United States 75th in the world. Below the global average. Iraq is 26 percent. Afghanistan, 28 percent.\n\nNumber one, Rwanda, 64 percent. So for reasons, some of which I understand, some of which I don't, we have made it hard. We have made it hard for women to be elected to the highest positions in our Federal legislature and as President.\n\nBut we are about to change that. And that's why I'm so excited. That's why I'm so excited. You know. I, I've been in elected politics for 22 years, and I have to tell you, my career on eight and zero in races, and I'm going to be nine and zero after November.\n\nBut my, my career in politics as a strong man has been built on the foundation of support by strong women. My mother, my fantastic wife, campaign managers, campaign donors, cabinet secretaries, volunteers, women are the majority voters in this country.\n\n(APPLAUSE)\n\nI mean, and so, I said yes with an exclamation point because I'm one strong man that is excited about supporting a strong woman to be President for the first time. And I know there's a lot of strong men in this country who feel exactly the same way. Just as strong women have supported us, we're here to support a strong woman to be President of the United States. And that's why I'm so excited.\n\nYou have a strong woman running for the United States Senate. I see some of these, I see some of these stickers. You've got Debra Ross, who's running for the Senate, she couldn't be here today.\n\nWe have done some campaigning against her, please stand strong for her. And stand strong for some sanity in the governor's residence too, with Roy Cooper coming to be governor of Virginia, governor of North Carolina.\n\n(APPLAUSE)\n\nAnd then the last thank you I'll say is just to my wife Anne. We have been partners, I say, you know, wife, lover, girlfriend, my most astute critic, my most energetic supporter, great mom, great public servant in so many ways.\n\nKAINE:\n\nThis whole thing has been an adventure of two and things are a lot of fun when you do them as a couple. You know, we've lived, we've laughed, we've cried, we have memories, and this is gonna be a whole new chapter I have the feeling. And so I'm so happy that she's here with me, can you give my wife a big round of applause?\n\n(APPLAUSE)\n\nThank you. Thank you. Thank you. Thank you so much.\n\nI want to talk really just about two things. I said I'd talk about why the campaign matters. I want to talk about two issues and then do a little bit of how we win this thing. And the two issues I want to talk about jobs, and I want to talk about military veterans, military families.\n\nI want to talk about two, jobs. Jobs. You got to boil this down to make it simple. Donald Trump would be a \"You're fired\" president. Hillary Clinton will be a \"You're hired\" president. OK? Is that simple enough? Is that simple enough?\n\n(APPLAUSE)\n\nLet me start with Hillary and the positive. She'll be a \"You're hired\" president. She asked me to join her - I've been a mayor, governor, done economic development deals, I'm really into creating opportunities, creating jobs. (INAUDIBLE) has a five-point plan that is our five-point plan to start the economy.\n\nJudy talked about it in the first hundred days. This is going to be priority one. Pushing Congress to enact legislation that will be the biggest jump start in jobs since World War II. It's got five pieces to it.\n\nAnd Hillary even gives you the details. The other guy just says, \"We'll be great, believe me.\" Is there anybody here who believes one word that Donald Trump says? No. No. But Hillary gives you the details. So I'll be quick about it.\n\nPoint one is investments. Investments in the economy of tomorrow. Infrastructure. Let's build roads, rail, airports, ports, broadband, electricity grid. I know I'm speaking to your legislators and local officials here.\n\nWhen you do infrastructure projects you hire people today, and that's great, and then you live off the investment because it raises the platform for your success for decades to come. That's number one. Investments in advanced manufacturing. In Virginia we see manufacturing coming back. North Carolina too. It's different. It's a lot of equipment.\n\nSome of the plants don't have as many workers but there are advanced manufacturing opportunities. We've got to push them, especially in North Carolina where you have really built up an expertise in renewable energy - wind and solar, some great projects in this state.\n\nThe new manufacturing and the new energy economy of tomorrow. We'll invest in that.\n\nYou've got great research institutions here. As much as a Virginian hates to admit it, there's some fantastic universities here that do tons of great research. We've got to invest in research because that spins off economically, too. So that's point one. We're going to make investments.\n\nPoint two. We're going to share prosperity. Profit-sharing plans. Let's make it easier for companies to share the prosperity of their success, not harder. And let's make it hard for companies that people at the top to take the money and ship jobs overseas.\n\nLet's make sure we're not giving them tax benefits they can take overseas, but give patriotic companies benefits to keep their patriotic investments right here in this country. That's point two, share prosperity.\n\n(APPLAUSE)\n\nThat's the way I grew up. I grew up in a business household. Hillary did too. Small business. She had a family drape and fabric printing business. My dad ran a shop with five to seven iron workers and welders. And he was management and they were the union.\n\nBut he didn't say, it's management against the union. He didn't say, it's the boss against the employees. He said, It's shared prosperity. He would teach my brothers and me my great welders who put your boys through school.\n\nKAINE:\n\nAnd then he would say, and my business skills will put my workers' kids through school. So shared prosperity. Things like making sure workers have the rights that they need and making sure that we pay equal for equal work.\n\nI mean, what a fancy concept that is. Right? Shared prosperity.\n\nPoint three is we've got to do much, much better on education. Governor Hunt, he knows this, you start early. I went to a church sermon once where it said it's easier to build a child than repair a man.\n\nStart early, saves a lot of challenges on the back end, promotes a lot of success. You go pre-k to smart curricular work and letting teachers in school districts have the flexibility and creativity they need to do the best job for their student, in the way they see fit.\n\n(APPLAUSE)\n\nNot a lot of top down stuff. We can make, we can make college debt free in this country. We can do this. Other nations do it, we can too. We can do it.\n\n(APPLAUSE)\n\nAnd expand, and expand opportunities, expand opportunities in a significant way for apprenticeships in the career and technical training, like my dad's workers got. So that's the third point, education.\n\nFourth point, is trying to make the whole life work balance, thing work out. I talked about equal pay for work a little bit. Secretary Clinton's got something good on, to make it easier for people to afford childcare.\n\nSome people are paying 20 to 30 percent of their income for childcare. We should not have to pay more than about 10 percent of the income for childcare.\n\nSo a childcare tax credit really helps with this. And then another thing that really helps it the minimum wage. We haven't raised the minimum wage in too long. And that will help families succeed.\n\n(APPLAUSE)\n\nAnd, if I could just take a minute on that. I know sometimes we talk about raising minimum wage and there's applause and then we move on to the next thing. I'm going to be real plain about why this matters to Hillary and why this should matter to all of us.\n\nIn this country, right now, what do we tell people growing up? We tell kids, our children, work hard, that's the key to success, work hard. You know hard work is the key, hard work is the key.\n\nBut if you work full time for minimum wage and a lot of people do, about 65 percent of minimum wage workers are women. If you do that, and you have one or two dependents, you will be below the poverty level. So think about that for a minute. We tell, you know work's important.\n\nWe really want you to work hard. But if we say that, but we have a policy that will put you in the poverty level if you do that. If you follow it, if you work hard, then our words ring hollow. We don't really mean what we say.\n\nIf we value work, and if we value workers, and if we value families than we ought to have policies like a livable minimum wage that show we value it. And enable people to live in a decent and dignified way.\n\n(APPLAUSE)\n\nIn a decent and dignified way. And then the last piece of the jobs plan, that Hillary has is, here's how we're going to pay for it. Because, because it's, you can't just say it smoke and mirrors and so she says we will have to have higher taxes on some to pay for it.\n\nAnd what we'll do as we've come out of the recession, there's been a lot of growth but the growth has been kind of at the top. It's not been spread.\n\nWe haven't created that economy that works for everybody. To do the things that will create an economy that works for everybody, we need to go to sort of higher income individuals, very successful financial institutions and companies and have them pay a little bit more.\n\nAnd invest those in the first four priorities, and guess what if we do, they're going to do better too. Because everybody does better with an economy, where there's prosperity and opportunity and ladders of success, that everybody can climb.\n\nKAINE:\n\nThe whole society does better. Now, that's a your hired plan folks. Donald Trump has a different plan and he tends again not to give you too many details. He just says \"Believe me.\"\n\nBut recently - and I am not going to ask you to believe me. Donald Trump says \"Believe me,\" all the time. \"We're gonna build a wall, make Mexico pay for it. Believe me.\" \"We're all gonna be rich, believe me.\" \"We're gonna beat ISIS so fast, believe me.\"\n\n\"Believe me\"? That's all you can do. I mean, come on. You gotta tell people how, so I'm not asking you to believe me on you're hired versus you're fired. I'm going to tell you what a very savvy, independent organization says. Moody's Analytics.\n\nThey're the best economic analysis firm in the country. They're not Democrats. The chief economist, Mark Zandi, was John McCain's head economist in 2008. They looked at the Clinton plan. They looked at the Trump plan. Here's what they found.\n\nIf you put the Clinton plan in effect, by the end of her first four-year term we will have added more than 10 million jobs to this economy and be in a persistent and strong recovery. I told you, she'll be a \"You're hired,\" president. She'll be a \"You're hired\" president.\n\nOn the other hand, you put the Donald Trump plan into effect, by the end of the first term we will have lost 3.5 million jobs and we will be in a quote, \"Lengthy recession.\" Folks, he's gonna be a \"You're fired\" president.\n\nWe cannot afford to hand it over to a \"You're fired\" guy, and my prediction is this. When this campaign is over, and people have forgotten everything about Donald Trump's losing presidential campaign, the two words they will remember about Donald Trump is \"You're fired.\" Right? That's what we know about him. That's what we know about him.\n\n(APPLAUSE)\n\nNow I want to talk about our military, our military families, our Guard, Reserve. Our DOD civilians, our military contractors - it's a big, big thing (inaudible). And what Anne said is true - with Bragg, with Lejeune, with - you have so many assets here. North Carolina is a state that is so committed to the nation's military mission, and we are too.\n\nWith the Pentagon, the biggest naval base in the world, with Quantico where all Marine officers train - we're the same way in Virginia. And maybe I feel this a little extra having a kid in the military. It's rare. There's only two senators who do. I feel this a little bit extra. I feel this a little bit extra.\n\n(APPLAUSE)\n\nHillary Clinton was on the Armed Services Committee when she was a senator and I was governor. And she made working for military families the heart of her work on that committee. And I'm now on that committee and I talk to Republicans who say, you know Hillary, she was a great committee member. She was fantastic. Don't quote me on it, I can't say this in front of - but she was fantastic.\n\nPeople thought when Hillary came to the Senate she'd been first lady, so that was kind of odd. They thought maybe she'll be kind of a celebrity. No, to the contrary, she was master the homework, master the details, get down in it, really focus on it, and she made big strides on military families' issues. She made that a key thing.\n\nAnd I'll tell you, a whole lot of things that she's gonna do, our plan for military and veterans - one of the main things is we're gonna make sure, absolutely, we protect and expand and fortify the G.I. Bill.\n\nIt's one of the greatest things this nation has ever done and my Virginia Senate predecessor, Jim Webb, did the second version of the G.I. Bill for the Iraq and Afghan War, but that even does some additional benefits, not just for military or military families - we are gonna make sure that we are preserving that and we got to absolutely fight for it.\n\nWe know that we have to continue the upgrade of the V.A. You know when President Obama came into office the V.A. was still operating on paper records?\n\nKAINE:\n\nThey didn't even have a computer system that would work that would communicate - if you were trying to get, as a veteran, you're trying to get a G.I. Bill benefit, and you would apply, I want to get tuition for this college, you would have to apply and they're had to mail it to Buffalo to get you know, approval instead of just put it in and press send on (OFF-MIKE).\n\nCompletely antiquated system and we've seen a lot of challenged in the VA. People who it takes too long for them to get their disability approved. It takes too long for them to get a medical appointment.\n\nAnd Hillary Clinton is absolutely rock solid that we've gotta continue and accelerate reforms to the GA. We're not backing away from this nation's commitment to our veterans and the VA system through any kind of risky privatization or anything like that.\n\nWe're gonna focus on it, we're gonna invest in it, we've gonna improve it because that's what we have promised and that's what we owe.\n\n(APPLAUSE)\n\nWe gotta focus on the realities of the lives that military families lead. How many in the room are veteran-active, Guard, Reserve or military family, raise your hand. OK well, this is darn near you know, half or more of the room.\n\nMilitary families have a huge challenge. Here's one thing we can't do, really. We can't make military service easy. It's always gonna be hard. It's always gonna be hard.\n\nBut we can make the life of military families a little bit easier. We can lift their burden a little bit and that's what Hillary and I are set to do.\n\n(APPLAUSE)\n\nWe wanna make sure that we can look at things like paid family leave, minimum wage that I talked about earlier was 65 percent of minimum wage earners being women, focusing on making childcare more accessible.\n\nAnd even think about better ways to take family considerations into account when doing assignments for military deployments. That's the kind of thing that we can do, a lot of -- a lot of agencies of our government do it and we can do that better.\n\n(APPLAUSE)\n\nWe have to make sure that we're providing appropriate mental health treatment. I think you know, for a long time in society, and military's no different, it's a microcosm (ph) society.\n\nThere was a stigma about seeking mental health treatment in a lot of society and maybe in the military it's been a little bit more. And how heartbreaking is it to see the stories about military or veteran suicides? How heart breaking is that?\n\nOr to see the stories that we used to see, we've gotten a little bit better about the Iraq and Afghan war vet and the unemployment rate among that group of people being higher than the national average.\n\nThis is about providing that service after the military is done and making sure on mental health and job training we're doing what we can to support our military and military families.\n\nThat's why I introduced the Troop Talent Act, Judy (ph) as my first bill because I wanted to make sure that we gave people that traction to get into a civilian workforce and just be as successful as you've been and others have been right out of the gate.\n\nI was proud to do that bill and get a lot of it passed as part of the Defense Authorizing Act in 2013. So there's a lot we can do and Hillary and I are gonna do it, we -- we -- this is an issue of passion for us.\n\nIt's an issue of commitment. Now, I wanna get over to the other side. I will say this, Donald Trump says he's gonna be a good guy for the military. He says I'll be great for the military.\n\nDonald Trump says I'll be great for the vets. Can I just break that down for a second with ya?\n\n(LAUGHTER)\n\nOn the military side, on the military side, Donald Trump says I'm gonna be great for the military.\n\nDonald Trump repeatedly during the Republican debates and since, has said quote, \"The American military is a disaster. The American military is a disaster.\" This is the guy who wants to be Commander in Chief.\n\nKAINE:\n\nI don't think in the history of the United States there has been a major party nominee who has talked with such disrespect about the military.\n\nThere are 2 million young men and women who volunteer in a time of war to serve as active guard and reserve. They do it knowing that they could get killed or hurt or so could their friends. We need a Commander in Chief who will not talk about them with contempt and disrespect but will talk about them with respect, and compassion, and support.\n\nAnybody who says the American military is a disaster is unfit to be Commander in Chief. Unfit.\n\n(APPLAUSE)\n\nHe's unfit. And folks - and folks - and folks, that's not the worse thing he's said. That's not the worse thing he's said.\n\nHow about making fun of John McCain for being a POW? He said, I don't consider him a hero because he got captured. Could you be more thickheaded, insensitive, or ignorant than that? It's unbelievable that those words would come out of anybody's mouth, much less the mouth of somebody who wants to be Commander in Chief.\n\nOr how about the way he took after that Virginia family, the Khan family who got up at the convention in a very powerful moment - challenged him for turning his back on some values like freedom of religion? And then he started to go after them. Going after a gold star family, I've got to believe that's in North Carolina that's viewed the same way it's viewed in Virginia.\n\n(APPLAUSE)\n\nThat is not the kind of person that we need in office. Absolutely, absolutely. And let me make - and let me make a comparison, the Khan family, they did stay up and they challenged Donald Trump. They challenged him.\n\nThe week before in Cleveland, they paraded one person after the next up to challenge Hillary Clinton - families who were grieving because they lost people in the raid in Benghazi.\n\nThey put them on stage and they let them trash Hillary Clinton. Did Hillary Clinton turn her attention from the campaign trail to direct her anger and her fire at grieving family members who have every right to grieve? Of course not, that's not what a president does.\n\n(APPLAUSE)\n\nIt's not what a president does and Donald Trump is not ready to be president.\n\nAnd how about vets - you know, he says, I'll be great to the vets, but when it comes to the VA he says, he wants to put the VA on a path to privatization. Now, you know, when that happens, that usually means then the bean counters take over, and it becomes less about providing the service and more about saving a few bucks.\n\nWe got an obligation, we got to meet the obligation, and it can't be turned into some scheme where we are going to figure out how to try to save a few bucks. It's got to be about the service.\n\nAnd I'll tell you something else about Donald Trump in the military, last Friday, Hillary Clinton released her 2015 tax returns and Anne and I released 10 years of our taxes - ten years.\n\n(APPLAUSE)\n\nNow, I did get your permission for that did it? OK, I was just making sure I wasn't in trouble for releasing ten years worth of taxes.\n\nWhy does that matter? Well, you know, Donald Trump isn't releasing his taxes. Every president, even to include Richard Nixon, who wasn't known as the most ethical and transparent of presidents, in recent history, have released taxes.\n\nKAINE:\n\nHow does this connect in with this veterans thing? Here is the way it connects, Donald Trump repeatedly through his life has bragged, I use every trick I can to avoid paying taxes whenever I can.\n\nAnd there have been a couple of years where because of casino applications that he was putting in, he had to release taxes in the '80s and '90s and in those years, a couple of them show that he paid absolutely no federal taxes. None.\n\nSo, you're telling me you're going to be great for the vets and you're telling me you're going to be great for the military, but during your entire professional life, you bragged, you bragged about how little you paid in taxes.\n\nWhat is it that supports the military? What is it supports our vets, our military families, our social services, mental health. It's patriotic American citizens who may not love taxes, but they understand that's part of the social contract, that's part of what connects us to each other.\n\nSo, if you spent your whole life trying to get out of paying anything, you can't come and parachute in and tell me you're going to be great for the military and great for the vets when you've been stiffing them your entire professional life.\n\nThat's why this matters. That's why this matters. So, now let's get to the winning piece, and I'm going to conclude. We have got to win this race. We - it's either going to be a \"You're hired\" president or a \"You're Fired\" president. It's either going to be a kids and family first president or a me first president.\n\nIt's either going to be a bridge builder president or a trash talker president. It's either going to be somebody who will show you their tax return, because you have a right to know whether you're democratic, republican, or independent, or somebody who thinks they can hide that from you.\n\nAnd if they're hiding that from you, who knows what else they're hiding from you. Folks, don't get tricked by Trump. Don't get tricked by Trump. So, we've got to win this race and it's going to be hard. The polls are looking good right now. I'd rather be where we are than where the other guys are, I'll be honest. I'll be honest. However, it's a season of surprises.\n\nPrimaries worked out differently than people thought, pundits proved to be wrong, the GOP nominated somebody that surprised most of us, so it's going to be a season of surprises.\n\nYou have to assume that there will be more and we live in a political climate now, after Citizens United, where anybody can just put 100 million bucks in, create some group like Citizens for Freedom that you don't know who they are, they run any ad they want on T.V., they say any negative thing they can, nobody can - can even find out who they are to hold them accountable if it's not true.\n\nSo, that's what we're going to see. It's going to be tough, it's going to be challenging, Hillary's trying to do something that's never been done in the history of this country and that's never easy. And so, I think this thing's going to be hard. We're here for a reason, we think we can win.\n\nBut at the end of the day, the only way we'll win is because of you. It's not going to be one more T.V. ad that's going to tip this thing, it's not going to be one more negative ad that's going to tip this thing, it's going to be person to person, volunteering, talking to your neighbor.\n\nPeople don't believe what they see on T.V. any more. Maybe that's smart, but they do believe a word from a trusted friend or neighbor or somebody at their church or somebody they go to school with or a coworker, they do believe that. I hope you will think about it.\n\nI know many of you have already done this, but if you haven't yet signed up to help the campaign in the closing stretch, if you would just text together - together to 47246, you will be swept up in this great volunteer army and we will make sure that Hillary wins.\n\nAnd we also have to have the right attitude about it. We have to have the right attitude about it. Participation is sacred. It's sacred. And I've got to give you guys some props here in North Carolina.\n\nKAINE:\n\nYou've got a governor in legislature now that wants to make it harder for people to participate, not easier. They're rowing backward as fast as they can on things like early voting and they're trying to put more hurdles up in the way to make it harder for you to go vote.\n\nAnd you are not taking that lying down, no, you brought a lawsuit against the highest officials in this state.\n\n(APPLAUSE)\n\nAnd you told them, you will not take my vote away without a fight. And you won that lawsuit up until now. And in fact, I used to do civil rights work in Virginia for 17 years, I've worked on voting rights cases.\n\nThe lawsuit in the fourth circuit that struck down North Carolina voting restrictions is a pretty incredible piece of writing. Often a lawsuit like that gets resolved, the court will say, well, that restriction gets in people's way and it burdens their right to vote. It may have not been intended to do that, but that's what it does. And so, restrictions get struck down for that reason.\n\nIt is so rare to see in a court opinion what you saw in the opinion about the North Carolina restrictions.\n\n(APPLAUSE)\n\nWhat the court said -- what the court said is that the highest officials in the state, quote, with surgical precision tried to target and reduce the participation of African-Americans in voting. And so it had to be struck down. It had to be struck down.\n\n(APPLAUSE)\n\nAnd I saw in the paper this morning - I saw in the paper this morning that the governor has gone up to the Supreme Court and said, no, still we really want to do these restrictions. Supreme Court will you let us restrict the ballot and close down access to people?\n\nI tell you, if you meet anybody on this trail who tells you, I don't think my vote matters -- as you're trying to persuade them to vote for Hillary Clinton, and they tell you, I don't think my vote matters, you tell them, it matters to the other side. They are working so hard to keep you from voting, don't let them value your vote more than you value your own vote.\n\nIt is important that you turn out. It is important that you participate.\n\n(APPLAUSE)\n\nNorth Carolina is a key battleground state. And if you do what you know how to do, if you do what you've shown you can do, come November 8th, we will make great history and elect Hillary Clinton.\n\nWe will elect Deborah Ross to the senate. We will elect Roy Cooper governor. We will elect democrats up and down the ballot in North Carolina.\n\n(APPLAUSE)\n\nYou will start to turn the direction of this state and march forward to progressive values. That's what at stake.\n\n(APPLAUSE)\n\nI know you can do it. I know you can do it.\n\n(APPLAUSE)\n\nThank you for having us and have a great day. I look forward to being back.\n\nSEN. TIM KAINE, DEMOCRATIC VICE PRESIDENTIAL CANDIDATE", "images": ["http://www.cq.com/images/cq-logo-white-new.png", "http://www.cq.com/versioned/MjAyMjA5MTZfMTYyNTIwMjQ0/images/app-icon.png"], "top_img": "http://www.cq.com/versioned/MjAyMjA5MTZfMTYyNTIwMjQ0/images/app-icon.png", "keywords": [], "authors": [], "canonical_link": "", "title": "Democratic Vice Presidential Nominee Tim Kaine Delivers Remarks at Campaign Event in Fayetteville, N.C.", "meta_data": {"build-version": "unknown-TAG", "build-time": "unknown-1664650858571", "viewport": "initial-scale=1", "apple-itunes-app": "app-id=1022591312"}, "movies": [], "publish_date": null, "source": "http://www.cq.com", "summary": ""}