{"url": "https://money.cnn.com/2017/11/03/media/cma-media-ban/index.html", "text": "The Country Music Association on Friday reversed its decision to ban reporters from asking questions about the Las Vegas mass shooting during its upcoming awards show.\n\nThe CMA faced criticism after it sent out media guidelines for its \"51st Annual CMA Awards\" which will be held Wednesday, November 8 at Bridgestone Arena in Nashville, Tennessee, and broadcast live on ABC.\n\nThe guidelines asked journalists to avoid discussing several politically charged topics, including the mass shooting at the Route 91 Harvest Festival in Las Vegas last month, which left 58 people dead and more than 500 injured.\n\n\"In light of recent events, and out of respect for the artists directly or indirectly involved, please refrain from focusing your coverage of the CMA Awards Red Carpet and Backstage Media Center on the Las Vegas tragedy, gun rights, political affiliations or topics of the like,\" a section of the guidelines read. \"It's vital, more so this year than in year's past due to the sensitivities at hand, that the CMA Awards be a celebration of Country Music and the artists that make this genre so great.\"\n\nBut on Friday, the organization reversed that edict.\n\n\"CMA apologizes for the recently distributed restrictions in the CMA Awards media guidelines, which have since been lifted,\" it said in a statement to CNNMoney. \"The sentiment was not to infringe and was created with the best of intentions to honor and celebrate Country Music.\"\n\nThe CMA Awards draw some of the music genres' biggest names and for the tenth straight year, it will be hosted by country superstars Carrie Underwood and Brad Paisley.\n\nThe original guidelines included a warning to those who don't heed them, including potentially missing out on covering country music's premiere event.\n\n\"It's an evening to honor the outstanding achievements in Country Music of the previous year and we want everyone to feel comfortable talking to press about this exciting time,\" the guidelines state. \"If you are reported as straying from these guidelines, your credential will be reviewed and potentially revoked via security escort.\"\n\nThe tragedy has stirred a great deal of discussion in the country music community among fans and performers alike, given the genre's association with gun culture.\n\nGun control debate enters country music community: 'Is this the kind of world we want to live in?'\n\nPaisley told Rolling Stone last month that he feels the pressure of handling the tragedy correctly while hosting the awards show.\n\n\"We're not going to ignore it, but we're not going to also dwell on that,\" he said.. \"We have to make sure we honor those we've lost, but we also [have to] celebrate this music, which lives on, and do a good job having the heart we need to have on that night. And also the theme of the show this year is very much about unity and coming together as a format.\"\n\nFriday morning, the singer had slammed the ban in a tweet that urged the CMA to reverse the guidelines.\n\nI'm sure the CMA will do the right thing and rescind these ridiculous and unfair press guidelines. In 3...2....1..... — Brad Paisley (@BradPaisley) November 3, 2017\n\n\"I'm sure the CMA will do the right thing and rescind these ridiculous and unfair press guidelines,\" he wrote. \"In 3...2....1.....\"", "images": ["https://i2.cdn.turner.com/money/dam/assets/171008043632-jason-aldean-snl-tom-petty-las-vegas-cold-open-1024x576.jpg", "https://i.cdn.turner.com/money/video/bvp/images/1.gif", "https://pixel.quantserve.com/pixel/p-D1yc5zQgjmqr5.gif", "https://i.cdn.turner.com/money/images/1.gif", "https://i2.cdn.turner.com/money/dam/assets/171103104617-brad-paisley-carrie-underwood-780x439.jpg", "https://i2.cdn.turner.com/money/.element/img/8.0/newsletters/reliable_sources/rs-with-button_large1x1.jpg", "https://money.cnn.com/.element/cnnm-3.0/img/logo/logo_cnnbusiness.png", "https://money.cnn.com/.element/cnnm-3.0/img/logo/logo_cnn.svg"], "top_img": "https://i2.cdn.turner.com/money/dam/assets/171103104617-brad-paisley-carrie-underwood-780x439.jpg", "keywords": [], "authors": ["Lisa France"], "canonical_link": "https://money.cnn.com/2017/11/03/media/cma-media-ban/index.html", "title": "Country Music Association reverses ban on media questions about Las Vegas shooting", "meta_data": {"viewport": "width=1140", "date": "2017-11-03 11:26:38", "title": "Country Music Association reverses ban on media questions about Las Vegas shooting", "keywords": "Country Music Association, Awards Season, country music, celebrities", "news_keywords": "Country Music Association, Awards Season, country music, celebrities", "author": "Lisa France", "section": "media", "og": {"title": "Country Music Association reverses ban on media questions about Las Vegas shooting", "type": "article", "url": "https://money.cnn.com/2017/11/03/media/cma-media-ban/index.html", "image": {"identifier": "https://i2.cdn.turner.com/money/dam/assets/171103104617-brad-paisley-carrie-underwood-780x439.jpg", "width": 780, "height": 439}, "site_name": "CNNMoney"}, "fb": {"app_id": 521848191196480}, "twitter": {"card": "summary_large_image", "site": "@CNNMoney", "url": "https://money.cnn.com/2017/11/03/media/cma-media-ban/index.html", "title": "Country Music Association reverses ban on media questions about Las Vegas shooting", "image": "https://i2.cdn.turner.com/money/dam/assets/171103104617-brad-paisley-carrie-underwood-540x304.jpg"}, "DC.date.issued": "2017-11-03T11:26:38"}, "movies": [], "publish_date": 1509667200.0, "source": "https://money.cnn.com", "summary": ""}