{"url": "https://www.hollywoodreporter.com/live-feed/bachelor-paradise-corinne-olympios-lawyer-speaks-1015303", "text": "The scandal surrounding Bachelor in Paradise isn’t over yet.\n\nThe lawyer for contestant Corinne Olympios, who was at the center of the alleged misconduct that led to production being suspended on the ABC reality series, is speaking out hours after producer Warner Bros. announced that it had closed its internal investigation into the claim and that production on the current fourth season would resume.\n\n“It needs to be made crystal clear that production of Bachelor in Paradise was shut down because of multiple complaints received from BIP producers and crewmembers on the set. It was not shut down due to any complaint filed by Corinne against anyone,” Olympios‘ lawyer, Martin Singer, said in a statement. “It comes as no surprise that Warner Bros., as a result of its own internal investigation, would state that no wrongdoing had occurred. Our own investigation will continue based on multiple new witnesses coming forward revealing what they saw and heard.”\n\nEarly Tuesday, Warner Bros. TV announced that production would resume on the current fourth season of the spinoff after an internal investigation found no evidence of the alleged misconduct that was first reported on June 11. “We can say, however, that the tape does not support any charge of misconduct by a castmember. Nor does the tape show, contrary to many press reports, that the safety of any castmember was ever in jeopardy,” Warner Bros. said in a statement.\n\nDespite the delay in production, ABC confirmed that Bachelor in Paradise would air this summer as planned. “We appreciate the swift and complete investigation by Warner Bros. into allegations of misconduct on the set of Bachelor in Paradise,” a network spokesperson said in a statement. “Given their results, the series will resume production, and will air this summer on ABC.”\n\nShortly after announcing the cast for this summer’s season on June 6, Warner Bros. halted production to investigate a misconduct incident on the Sayulita, Mexico, set. A producer filed a complaint over an alleged sexual encounter between two contestants who had been drinking, Olympios and DeMario Jackson. It remains unclear if the producer witnessed the incident or had seen the footage, though sources tell The Hollywood Reporter Olympios was “lucid” and “conversational” on the tape. Still, since alcohol was involved, there was a question of whether one or both parties may have been too intoxicated to give consent.\n\nThe season four castmates were sent back to the U.S. the same day Warner Bros. announced the investigation, with most arriving home by June 12. When the cast was told to pack their bags, they were informed that they “might” return. It remains unclear if either Jackson or Olympios will return to continue filming.\n\nBoth Olympios and Jackson lawyered up in the days following the production suspension, with Olympios retaining top Hollywood litigator Singer and Jackson hiring L.A.-based attorney Walter Mosley.\n\nOlympios issued her first and so far only statement about the matter on June 14. “I am a victim and have spent the last week trying to make sense of what happened on June 4,” she said at the time. “Although I have little memory of that night, something bad obviously took place, which I understand is why production on the show has now been suspended and a producer on the show has filed a complaint against the production.\n\n“As a woman, this is my worst nightmare and it has now become my reality. As I pursue the details and facts surrounding that night and the immediate days after, I have retained a group of professionals to ensure that what happened on June 4 comes to light and I can continue my life, including hiring an attorney to obtain justice and seeking therapy to begin dealing with the physical and emotional trauma stemming from that evening.”\n\nWhile many of those associated with the show, including series creator Mike Fleiss, host Chris Harrison and several of the contestants from the current season celebrated Warner Bros.’ decision to resume filming, other insiders are questioning the move after Bachelor in Paradise appeared all but destined for cancellation in recent days following fallout from the scandal.\n\nAs part of its lengthy statement Tuesday, Warner Bros. said it plans to “implement changes to the show’s policies and procedures to enhance and further ensure the safety and security of all participants.”\n\nIt also remains unclear what will happen to the tape of the alleged incident at the center of the investigation, which Warner Bros. said Tuesday it does not plan to release “out of respect for the privacy interests of those involved.” That videotape could be a key piece of evidence in Singer’s ongoing investigation into what transpired.\n\nBefore being selected for Bachelor in Paradise, Olympios appeared on season 21 of The Bachelor, where she competed for Nick Viall’s affections. She placed fourth.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/bachelorinparadise_featuredimage-936x482-h_2017_0.jpg?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/bachelorinparadise_featuredimage-936x482-h_2017_0.jpg?w=1024", "keywords": [], "authors": ["Kate Stanhope Jackie Strause", "Kate Stanhope", "Jackie Strause"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/bachelor-paradise-corinne-olympios-lawyer-speaks-1015303/", "title": "‘Bachelor in Paradise’ Star’s Lawyer Says “Our Own Investigation Will Continue”", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The statement comes hours after Warner Bros. closed its own internal investigation into the misconduct allegation.", "news_keywords": "Bachelor In Paradise", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Jackie Strause", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1015303, "title": "'Bachelor in Paradise' Star's Lawyer Says \"Our Own Investigation Will Continue\"", "published_at": "2017-06-20 13:45:49", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/bachelorinparadise_featuredimage-936x482-h_2017_0.jpg?w=1024", "comment_count": 0, "tags": "Bachelor In Paradise", "topics": "TV News", "body": "The scandal surrounding Bachelor in Paradise isn't over yet.\r\nThe lawyer for contestant Corinne Olympios, who was at the center of the alleged misconduct that led to production being suspended on the ABC reality series, is speaking out hours after producer Warner Bros. announced that it had closed its internal investigation into the claim and that production on the current fourth season would resume.\r\n\"It needs to be made crystal clear that production of Bachelor in Paradise was shut down because of multiple complaints received from BIP producers and crewmembers on the set. It was not shut down due to any complaint filed by Corinne against anyone,\" Olympios' lawyer, Martin Singer, said in a statement. \"It comes as no surprise that Warner Bros., as a result of its own internal investigation, would state that no wrongdoing had occurred. Our own investigation will continue based on multiple new witnesses coming forward revealing what they saw and heard.\"\r\n\r\nEarly Tuesday, Warner Bros. TV announced that production would resume on the current fourth season of the spinoff after an internal investigation found no evidence of the alleged misconduct that was first reported on June 11. \"We can say, however, that the tape does not support any charge of misconduct by a castmember. Nor does the tape show, contrary to many press reports, that the safety of any castmember was ever in jeopardy,\" Warner Bros. said in a statement.\r\nDespite the delay in production, ABC confirmed that Bachelor in Paradise would air this summer as planned. \"We appreciate the swift and complete investigation by Warner Bros. into allegations of misconduct on the set of Bachelor in Paradise,\" a network spokesperson said in a statement. \"Given their results, the series will resume production, and will air this summer on ABC.\"\r\nShortly after announcing the cast for this summer's season on June 6, Warner Bros. halted production to investigate a misconduct incident on the Sayulita, Mexico, set. A producer filed a complaint over an alleged sexual encounter between two contestants who had been drinking, Olympios and DeMario Jackson. It remains unclear if the producer witnessed the incident or had seen the footage, though sources tell The Hollywood Reporter Olympios was \"lucid\" and \"conversational\" on the tape. Still, since alcohol was involved, there was a question of whether one or both parties may have been too intoxicated to give consent.\r\n\r\nThe season four castmates were sent back to the U.S. the same day Warner Bros. announced the investigation, with most arriving home by June 12. When the cast was told to pack their bags, they were informed that they \"might\" return. It remains unclear if either Jackson or Olympios will return to continue filming.\r\nBoth Olympios and Jackson lawyered up in the days following the production suspension, with Olympios retaining top Hollywood litigator Singer and Jackson hiring L.A.-based attorney Walter Mosley.\r\nOlympios issued her first and so far only statement about the matter on June 14. \"I am a victim and have spent the last week trying to make sense of what happened on June 4,\" she said at the time. \"Although I have little memory of that night, something bad obviously took place, which I understand is why production on the show has now been suspended and a producer on the show has filed a complaint against the production.\r\n\r\n\"As a woman, this is my worst nightmare and it has now become my reality. As I pursue the details and facts surrounding that night and the immediate days after, I have retained a group of professionals to ensure that what happened on June 4 comes to light and I can continue my life, including hiring an attorney to obtain justice and seeking therapy to begin dealing with the physical and emotional trauma stemming from that evening.\"\r\nWhile many of those associated with the show, including series creator Mike Fleiss, host Chris Harrison and several of the contestants from the current season celebrated Warner Bros.' decision to resume filming, other insiders are questioning the move after Bachelor in Paradise appeared all but destined for cancellation in recent days following fallout from the scandal.\r\nAs part of its lengthy statement Tuesday, Warner Bros. said it plans to \"implement changes to the show's policies and procedures to enhance and further ensure the safety and security of all participants.\"\r\nIt also remains unclear what will happen to the tape of the alleged incident at the center of the investigation, which Warner Bros. said Tuesday it does not plan to release \"out of respect for the privacy interests of those involved.\" That videotape could be a key piece of evidence in Singer's ongoing investigation into what transpired.\r\nBefore being selected for Bachelor in Paradise, Olympios appeared on season 21 of The Bachelor, where she competed for Nick Viall's affections. She placed fourth.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Bachelor in Paradise’ Star’s Lawyer Says “Our Own Investigation Will Continue”", "url": "https://www.hollywoodreporter.com/tv/tv-news/bachelor-paradise-corinne-olympios-lawyer-speaks-1015303/", "description": "The statement comes hours after Warner Bros. closed its own internal investigation into the misconduct allegation.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/bachelorinparadise_featuredimage-936x482-h_2017_0.jpg?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2017-06-20T13:45:49+00:00", "modified_time": "2017-06-20T15:56:44+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Bachelor in Paradise’ Star’s Lawyer Says “Our Own Investigation Will Continue”", "description": "The statement comes hours after Warner Bros. closed its own internal investigation into the misconduct allegation.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/06/bachelorinparadise_featuredimage-936x482-h_2017_0.jpg?w=1280"}}, "movies": [], "publish_date": 1497966349.0, "source": "https://www.hollywoodreporter.com", "summary": ""}