{"url": "https://www.hollywoodreporter.com/live-feed/mr-robot-season-3-premiere-everything-know-podcast-1046949", "text": "“Mind awake, body asleep. Mind awake, body asleep.”\n\nThe soothing mantra of the hauntingly talented hacker Elliot Alderson (Rami Malek) has likely been ringing in the ears of Mr. Robot fans ever since the Sam Esmail thriller shut down its operations (and very nearly shut down its main character) at the end of season two more than a year ago. Now, “Stage Two” of the Dark Army and Mr. Robot’s (Christian Slater) plan is on the cusp of execution, just in time for the launch of season three on Oct. 11.\n\nOf course, those notions are as alien as the techno-jargon found throughout the series for anyone who hasn’t given Mr. Robot much thought in the year since it aired its most recent episode. But considering the incredibly dense nature of the storytelling (the USA Network drama rarely spells anything out for its viewers, and the season three premiere expects fans to remember the events of this complicated tale in great detail), it’s crucial to remember where everything stands as we prepare to return to a world living in the aftermath of the Five/Nine Hack — at least, a better memory than the one Elliot himself is forced to work with.\n\nFor a truly deep dive into the current standing of Mr. Robot, we invited you to listen to the first episode of our new podcast covering the series, a collaboration with Post Show Recaps hosts Josh Wigler (that’s me!) and Antonio Mazzaro. All season long, we’ll be providing podcast primers on every episode, starting here with an overview of the series and a table-setting for the season ahead:\n\nIn addition to what’s covered in the podcast, read on for some of the fundamentals of what you need to know heading into the new era of Mr. Robot. 1. It’s a Tangled Web Where do we even begin as we attempt to untangle the events of the past two seasons? It’s best to start at the big season one headline: Elliot Alderson, a distressed but incredibly gifted individual, secretly boasts a Hyde to his Jekyll in the form of Mr. Robot, a second personality who takes on the likeness of Elliot’s late father. The two personalities are at war with one another, with Robot intent on overhauling the world through militant revolution, and Elliot intent on preventing himself from causing lasting harm. Through two seasons, the Robot side of Elliot has scored the lion’s share of the victories, all but fully bringing down the global conglomerate E Corp (alternately known in Elliot’s worldview as Evil Corp) through a massive attack known as the Five/Nine Hack, and now on the edge of instituting a second stage of that plan — appropriately called “Stage Two.” There’s a lot more to keep in mind, between Darlene (Carly Chaikin) getting burned and cornered by the dogged Dom DiPierro (Grace Gummer) of the FBI; Angela’s (Portia Doubleday) apparent indoctrination into the mysterious Dark Army; and the boiling feud between two of the most powerful individuals in the world, Phillip Price (Michael Cristofer) and Whiterose (BD Wong). At the heart, however, it’s most critical to understand that the rivalry between the two sides of Elliot has escalated tremendously, thanks to the big season two cliffhanger… I’m never about withholding things arbitrarily,” Sam Esmail tells THR answering Elliot’s fate before the finale’s conclusion.”] 2. The Key Word When season three begins, there’s one buzz word to keep in mind: “disintegration.” That’s how Esmail and others involved in the series describe the relationship between Elliot and Mr. Robot this year, or lack thereof. Season two ended with the Mr. Robot side of Elliot’s personality proving his commitment to his cause by inviting a gunshot wound, potentially taking him off the playing field, but at least keeping the operation in motion. Season two also concluded with confirmation that Elliot survived the injury (it’s hard, if not outright impossible to imagine this show existing without Elliot in the hub of it), but the damage is done: Elliot and Robot’s alliance, as much as one ever really existed, has been blown to bits, thanks to a single bullet. Beyond Elliot and Robot’s dynamic, expect other relationships to disintegrate in their own right, whether that’s Elliot and Darlene — due to her precarious situation with Dom and the FBI — or Angela and Phillip Price — due to her potential newfound loyalty with Whiterose — as just two of many potential examples. 3. America’s Most Wanted Season three stands to bring one of the most important figures in the show’s mythology out of the shadows and back into the light: Tyrell Wellick (Martin Wallström), once on track to become the youngest Chief Technology Officer in E Corp history until a string of self-sabotaging acts turned him into the most wanted man alive. One of them, at least. Tyrell was an instrumental player in the Five/Nine Hack, teaming up with Elliot — or Robot, more accurately — and then disappearing into the ether, almost completely unseen during season two. The season two finale finally brought Tyrell back into the fold, as it was revealed he wasn’t secretly dead, as Robot tried to convince Elliot. But where exactly was Tyrell over the course of the season, and what exactly has he been into in the time since his disappearance from the public eye? We’re bound to find out this year, as Mr. Robot can’t get away with keeping Tyrell in the dark for much longer. Keep an eye out on the inevitable reunion between Tyrell and his wife Joanna (Stephanie Corneliussen), one of the most intimidating character on the show. Related Stories Related Story 'Mr. Robot' Star BD Wong on Trans Representation: \"Every Character on TV Creates a Dialogue\"\n\n4. The Rose Blooms\n\nAnother power player from Robot lore set for an expanded role this season: BD Wong’s Whiterose. Or is it Minister Zhang? Depends on the day and occasion. The veteran actor plays one of the single most fascinating and powerful characters in the series, as both the head of the Dark Army hacker group as well as China’s Minister of State Security. In her private moments, she seems to prefer the Whiterose moniker, so that’s where we’ll settle as well — but that’s about the extent of our confidence when it comes the time-obsessed figure, who comes equipped with some of the most destructive potential of anyone on the show.\n\n“First of all, every trans character on television creates a dialogue about trans people, which is super valuable,” Wong previously told The Hollywood Reporter about playing Whiterose. “We need to get people with the program about what trans people even fucking are. Those of us who embrace trans people, like myself, forget that it doesn’t come easily for people. Here is a character that, for all intents and purposes — there is a poetry of Sam’s utilization of this character as trans — is rather symbolic. What I mean is that he really wants to discuss in a big way on the show the power dynamics associated with gender. There’s a great challenge in being a powerful woman in a powerful white man’s world.”\n\n5. Cannavale Games\n\nAnd now, a new player enters the arena: Bobby Cannavale, of Vinyl, Boardwalk Empire, Oz, and several other films and shows that aren’t associated with HBO. Given the secrecy surrounding the story of Mr. Robot, it’s not a shock that there’s very little information we currently know about Cannavale’s character — but as the only new series regular on the board (Wong’s promotion notwithstanding), and given the caliber of actor enlisted for the role, it’s safe to say Cannavale’s presence will loom large throughout season three.\n\nWith that said, here’s what we do know: Cannavale is playing a used car salesman named Irving. Really, that’s the full extent of what we know. We can make some leaps from there — that perhaps Irving is involved in the mysterious car drama surrounding Tyrell Wellick’s disappearance, for one thing; or that whatever he’s selling, it’s not all that it’s cracked up to be. However he factors into the narrative, Irving stands out as the most intriguing new element in the mix.\n\n6. A Slimmer Robot\n\nSeason two of Mr. Robot clocked in at 12 episodes, many of them equipped with extended runtimes. Between Elliot’s initial incarceration through the first two-thirds of the season, as well as the expanded focus on the greater ensemble, the second year of the award-winning series felt fuller than its first season — for better or for worse, depending on your outlook.\n\nBut season three aims to bring the series back to basics, at least in terms of how it will unfold: a lean 10 episode order, the same amount of installments as seen in season one. Given the current complexity of the narrative, can Mr. Robot accomplish all of its season three business with only ten episodes? That’s one of the big questions heading into the season — but it also presents the possibility for a leaner and tighter thrill-ride than anything the show has put forth before, both an exciting and daunting prospect to consider.\n\n7. The Loose Ends\n\nHow will Darlene escape the FBI’s wrath? What are Angela’s true motives? Should we be worried about Trenton and Mobley, the fsociety hackers last seen in Arizona fielding an unexpected visit from the deadly Dark Army agent Leon, played by Joey Badass? Are we really delving into questions of time travel and parallel universes, as Whiterose has seemingly intimated? And what exactly is inside the Washington Township power plant? Really, the list of lingering questions still in the mix for Mr. Robot is vast, but season three stands ready to tie up at least a few of those loose ends — and at the end of the day, it all comes back to the man (or men) in the title.\n\n“I’ve looked back on the second season and I’ve seen a lot of similarities with The Empire Strikes Back, in terms of Luke/Elliot going away and isolating themselves, while their sister is out there and battling the evil empire,” Esmail previously told THR about how he views the road ahead for season three. “I think this is the return of Elliot. Season three, and the way I’ve been thinking about it, is sort of the return to Elliot — but not the naive Elliot we saw at the beginning of the season. It’s the Elliot we’ve seen go through this horrific experience from the first and second seasons, and with all of that in mind, that’s going to make this new Elliot come into fruition in the next season.\n\nBonus: One Last Listen\n\nStill looking for ways to catch up ahead of season three? Once again, we have you covered on the podcast front, with a second preview show — this one guiding you through 18 key scenes from the series you ought to watch in order to freshen up on all things Robot.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/afabc07e-dbb3-4219-975a-4fa957db68c3.png?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/afabc07e-dbb3-4219-975a-4fa957db68c3.png?w=1024", "keywords": [], "authors": ["Josh Wigler"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/mr-robot-season-3-premiere-everything-know-podcast-1046949/", "title": "‘Mr. Robot’ Season 3: Everything to Know Before the Premiere", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The hacker drama returns October 11, and THR's new podcast series is here to help you get caught up.", "news_keywords": "Mr. Robot", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Josh Wigler", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1046949, "title": "'Mr. Robot' Season 3: Everything to Know Before the Premiere", "published_at": "2017-10-09 09:00:00", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/afabc07e-dbb3-4219-975a-4fa957db68c3.png?w=1024", "comment_count": 0, "tags": "Mr. Robot", "topics": "TV News", "body": "\"Mind awake, body asleep. Mind awake, body asleep.\"\r\nThe soothing mantra of the hauntingly talented hacker Elliot Alderson (Rami Malek) has likely been ringing in the ears of Mr. Robot fans ever since the Sam Esmail thriller shut down its operations (and very nearly shut down its main character) at the end of season two more than a year ago. Now, \"Stage Two\" of the Dark Army and Mr. Robot's (Christian Slater) plan is on the cusp of execution, just in time for the launch of season three on Oct. 11.\r\nOf course, those notions are as alien as the techno-jargon found throughout the series for anyone who hasn't given Mr. Robot much thought in the year since it aired its most recent episode. But considering the incredibly dense nature of the storytelling (the USA Network drama rarely spells anything out for its viewers, and the season three premiere expects fans to remember the events of this complicated tale in great detail), it's crucial to remember where everything stands as we prepare to return to a world living in the aftermath of the Five/Nine Hack — at least, a better memory than the one Elliot himself is forced to work with.\r\nFor a truly deep dive into the current standing of Mr. Robot, we invited you to listen to the first episode of our new podcast covering the series, a collaboration with Post Show Recaps hosts Josh Wigler (that's me!) and Antonio Mazzaro. All season long, we'll be providing podcast primers on every episode, starting here with an overview of the series and a table-setting for the season ahead:\r\n  \r\n\r\n\t\r\n\t\r\n\t \r\n\t\r\n\t\r\n\t\r\n\t \r\n\t\r\n\t\r\n\t\r\n\t \r\n\t\r\n\t\r\n\t\r\n\t \r\n\t\r\n\t\r\n\t\r\n\t \r\n\t\r\n\t\r\n\t\r\n\t \r\n\t\r\n\t\r\n\t\r\n\t \r\n\t\r\n\t\r\n\t\r\n\tIn addition to what's covered in the podcast, read on for some of the fundamentals of what you need to know heading into the new era of Mr. Robot.\r\n\t1. It's a Tangled Web\r\n\tWhere do we even begin as we attempt to untangle the events of the past two seasons? It's best to start at the big season one headline: Elliot Alderson, a distressed but incredibly gifted individual, secretly boasts a Hyde to his Jekyll in the form of Mr. Robot, a second personality who takes on the likeness of Elliot's late father. The two personalities are at war with one another, with Robot intent on overhauling the world through militant revolution, and Elliot intent on preventing himself from causing lasting harm. Through two seasons, the Robot side of Elliot has scored the lion's share of the victories, all but fully bringing down the global conglomerate E Corp (alternately known in Elliot's worldview as Evil Corp) through a massive attack known as the Five/Nine Hack, and now on the edge of instituting a second stage of that plan — appropriately called \"Stage Two.\" \r\n\tThere's a lot more to keep in mind, between Darlene (Carly Chaikin) getting burned and cornered by the dogged Dom DiPierro (Grace Gummer) of the FBI; Angela's (Portia Doubleday) apparent indoctrination into the mysterious Dark Army; and the boiling feud between two of the most powerful individuals in the world, Phillip Price (Michael Cristofer) and Whiterose (BD Wong). At the heart, however, it's most critical to understand that the rivalry between the two sides of Elliot has escalated tremendously, thanks to the big season two cliffhanger...\r\n\t I'm never about withholding things arbitrarily,\" Sam Esmail tells THR answering Elliot's fate before the finale's conclusion.\"]\r\n\t2. The Key Word\r\n\tWhen season three begins, there's one buzz word to keep in mind: \"disintegration.\" That's how Esmail and others involved in the series describe the relationship between Elliot and Mr. Robot this year, or lack thereof. Season two ended with the Mr. Robot side of Elliot's personality proving his commitment to his cause by inviting a gunshot wound, potentially taking him off the playing field, but at least keeping the operation in motion. Season two also concluded with confirmation that Elliot survived the injury (it's hard, if not outright impossible to imagine this show existing without Elliot in the hub of it), but the damage is done: Elliot and Robot's alliance, as much as one ever really existed, has been blown to bits, thanks to a single bullet. \r\n\tBeyond Elliot and Robot's dynamic, expect other relationships to disintegrate in their own right, whether that's Elliot and Darlene — due to her precarious situation with Dom and the FBI — or Angela and Phillip Price — due to her potential newfound loyalty with Whiterose — as just two of many potential examples.\r\n\t3. America's Most Wanted\r\n\tSeason three stands to bring one of the most important figures in the show's mythology out of the shadows and back into the light: Tyrell Wellick (Martin Wallström), once on track to become the youngest Chief Technology Officer in E Corp history until a string of self-sabotaging acts turned him into the most wanted man alive. One of them, at least. Tyrell was an instrumental player in the Five/Nine Hack, teaming up with Elliot — or Robot, more accurately — and then disappearing into the ether, almost completely unseen during season two.\r\n\tThe season two finale finally brought Tyrell back into the fold, as it was revealed he wasn't secretly dead, as Robot tried to convince Elliot. But where exactly was Tyrell over the course of the season, and what exactly has he been into in the time since his disappearance from the public eye? We're bound to find out this year, as Mr. Robot can't get away with keeping Tyrell in the dark for much longer. Keep an eye out on the inevitable reunion between Tyrell and his wife Joanna (Stephanie Corneliussen), one of the most intimidating character on the show.\r\n\t\r\n\t4. The Rose Blooms\r\n\tAnother power player from Robot lore set for an expanded role this season: BD Wong's Whiterose. Or is it Minister Zhang? Depends on the day and occasion. The veteran actor plays one of the single most fascinating and powerful characters in the series, as both the head of the Dark Army hacker group as well as China's Minister of State Security. In her private moments, she seems to prefer the Whiterose moniker, so that's where we'll settle as well — but that's about the extent of our confidence when it comes the time-obsessed figure, who comes equipped with some of the most destructive potential of anyone on the show.\r\n\t\"First of all, every trans character on television creates a dialogue about trans people, which is super valuable,\" Wong previously told The Hollywood Reporter about playing Whiterose. \"We need to get people with the program about what trans people even fucking are. Those of us who embrace trans people, like myself, forget that it doesn't come easily for people. Here is a character that, for all intents and purposes — there is a poetry of Sam's utilization of this character as trans — is rather symbolic. What I mean is that he really wants to discuss in a big way on the show the power dynamics associated with gender. There's a great challenge in being a powerful woman in a powerful white man's world.\"\r\n\t5. Cannavale Games\r\n\tAnd now, a new player enters the arena: Bobby Cannavale, of Vinyl, Boardwalk Empire, Oz, and several other films and shows that aren't associated with HBO. Given the secrecy surrounding the story of Mr. Robot, it's not a shock that there's very little information we currently know about Cannavale's character — but as the only new series regular on the board (Wong's promotion notwithstanding), and given the caliber of actor enlisted for the role, it's safe to say Cannavale's presence will loom large throughout season three.\r\n\tWith that said, here's what we do know: Cannavale is playing a used car salesman named Irving. Really, that's the full extent of what we know. We can make some leaps from there — that perhaps Irving is involved in the mysterious car drama surrounding Tyrell Wellick's disappearance, for one thing; or that whatever he's selling, it's not all that it's cracked up to be. However he factors into the narrative, Irving stands out as the most intriguing new element in the mix.\r\n\t\r\n\t6. A Slimmer Robot\r\n\tSeason two of Mr. Robot clocked in at 12 episodes, many of them equipped with extended runtimes. Between Elliot's initial incarceration through the first two-thirds of the season, as well as the expanded focus on the greater ensemble, the second year of the award-winning series felt fuller than its first season — for better or for worse, depending on your outlook.\r\n\tBut season three aims to bring the series back to basics, at least in terms of how it will unfold: a lean 10 episode order, the same amount of installments as seen in season one. Given the current complexity of the narrative, can Mr. Robot accomplish all of its season three business with only ten episodes? That's one of the big questions heading into the season — but it also presents the possibility for a leaner and tighter thrill-ride than anything the show has put forth before, both an exciting and daunting prospect to consider.\r\n\t7. The Loose Ends\r\n\tHow will Darlene escape the FBI's wrath? What are Angela's true motives? Should we be worried about Trenton and Mobley, the fsociety hackers last seen in Arizona fielding an unexpected visit from the deadly Dark Army agent Leon, played by Joey Badass? Are we really delving into questions of time travel and parallel universes, as Whiterose has seemingly intimated? And what exactly is inside the Washington Township power plant? Really, the list of lingering questions still in the mix for Mr. Robot is vast, but season three stands ready to tie up at least a few of those loose ends — and at the end of the day, it all comes back to the man (or men) in the title.\r\n\t\"I've looked back on the second season and I've seen a lot of similarities with The Empire Strikes Back, in terms of Luke/Elliot going away and isolating themselves, while their sister is out there and battling the evil empire,\" Esmail previously told THR about how he views the road ahead for season three. \"I think this is the return of Elliot. Season three, and the way I've been thinking about it, is sort of the return to Elliot — but not the naive Elliot we saw at the beginning of the season. It's the Elliot we've seen go through this horrific experience from the first and second seasons, and with all of that in mind, that's going to make this new Elliot come into fruition in the next season.\r\n\t\r\n\tBonus: One Last Listen\r\n\tStill looking for ways to catch up ahead of season three? Once again, we have you covered on the podcast front, with a second preview show — this one guiding you through 18 key scenes from the series you ought to watch in order to freshen up on all things Robot.\r\n\t  \r\n\tFollow THR.com/MrRobot for interviews, news, podcasts and more all season long. Mr. Robot returns Oct. 11.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "‘Mr. Robot’ Season 3: Everything to Know Before the Premiere", "url": "https://www.hollywoodreporter.com/tv/tv-news/mr-robot-season-3-premiere-everything-know-podcast-1046949/", "description": "The hacker drama returns October 11, and THR’s new podcast series is here to help you get caught up.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/afabc07e-dbb3-4219-975a-4fa957db68c3.png?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2017-10-09T09:00:00+00:00", "modified_time": "2017-10-10T09:17:17+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "‘Mr. Robot’ Season 3: Everything to Know Before the Premiere", "description": "The hacker drama returns October 11, and THR’s new podcast series is here to help you get caught up.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/afabc07e-dbb3-4219-975a-4fa957db68c3.png?w=1280"}}, "movies": [], "publish_date": 1507539600.0, "source": "https://www.hollywoodreporter.com", "summary": ""}