{"url": "https://www.hollywoodreporter.com/live-feed/bachelorette-rachel-lindsay-criticizes-editing-her-finale-1132842", "text": "The finale of The Bachelorette has sparked another lead from the ABC reality dating franchise to speak out candidly about how her own finale was edited by show producers.\n\nRachel Lindsay, the historic star of The Bachelorette‘s 2017 cycle, got engaged to winner Bryan Abasolo on her season 13 finale. Now, however, she is opening up to say, “I was denied my on-camera happy ending” and “labeled an angry black female.”\n\nLindsay was the first black lead of the long-running franchise, which just wrapped its 14th season of The Bachelorette on Monday night. Lindsay remains the only black star in the franchise’s combined 26 seasons, and though her long overdue casting was praised and her season was initially celebrated for its diversity, the cycle ended up being criticized for race-baiting for drama.\n\nIn a blog post about Becca Kufrin’s finale for Us Weekly, Lindsay details how her TV ending played out differently than the one that just aired. Kufrin accepted a proposal from her winner, Garrett Yrigoyen, who has emerged as a controversial pick given his past social media history of liking several memes espousing offensive rhetoric.\n\nLindsay, who remains happily engaged to Abasolo, says the pretaped portion of the latest finale gave Kufrin and Yrigoyen the “true definition” of a happy ending. After the proposal, the live aftershow saw the couple return to discuss their journey off-camera, including the Instagram scandal. But Lindsay says what she endured on the night of her finale was much worse.\n\n“Becca did not sit on stage for three hours and watch the finale for the first time in front of a live audience,” Lindsay wrote, recalling how her part of the live post-finale special, After the Final Rose, cut into the pretaped portion. “Becca did not have to deal with someone telling her she would live a mediocre life. Becca did not have to deal with being baited with real-time questions about her emotions watching certain scenes. Nope, that was me.”\n\nAs viewers will recall, much of Lindsay’s finale centered around the departure of her runner-up, Peter Kraus, and she criticized the show for focusing more on the breakup than the proposal.\n\n“Let’s just be honest, Becca did not have the finale that I had,” she continued. “There was no controversy and she was not put in a position to face any. She was protected and I was placed on display for three hours and labeled an angry black female. And there will always be that stigma attached to my finale because it has been said that when truth is blurred by misinformation, perception becomes reality and all is lost.”\n\nLindsay summed up what was meant to be a finale recap by challenging ABC and show producers to do better.\n\n“The Bachelor franchise does believe in happy endings — some people get an on-camera happy ending, some people get on off-camera happy ending, and some people get both,” she says. “For Becca, I truly hope she gets both. As for my happy ending, it was not demonstrated within the confines of your television screens, but I am living it every day in real life. So in regards to a future on-camera happy ending and whether or not I will get married on TV, I have no idea but they damn sure owe us one.”\n\nAt the time, Lindsay said that a lot of her relationship with Abasolo was left on the cutting-room floor because their relationship was drama-free. Instead, much of the focus was on Lindsay sending Kraus home early over his hesitance about proposing. “Bryan was the person,” she said of why she sent Kraus home. “I’m only in love with one person through that entire season. I wanted that proposal to be all about Bryan. I wanted him to be the focus.”\n\nThis year’s Bachelor, Arie Luyendyk Jr., also spoke out after his season wrapped to say that he felt “betrayed” by how show producers edited his controversial finale, which resulted in Kufrin being named as the Bachelorette.", "images": ["https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/12/1a5dcf4a-bd27-45b5-9e4e-7ea7eabb33d9_1.png?w=1024", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/12/1a5dcf4a-bd27-45b5-9e4e-7ea7eabb33d9_1.png?w=1024", "keywords": [], "authors": ["Jackie Strause"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/bachelorette-rachel-lindsay-criticizes-editing-her-finale-1132842/", "title": "Ex-Bachelorette Rachel Lindsay Criticizes Show Producers Over Finale Edit", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "Rachel Lindsay, the 2017 historic star of ABC's 'The Bachelorette,' criticizes how the show producers edited her finale and says she was labeled \"an angry black female.\"", "news_keywords": "The Bachelorette", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Jackie Strause", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1132842, "title": "Ex-Bachelorette Rachel Lindsay Criticizes Show Producers Over Finale Edit", "published_at": "2018-08-07 12:43:24", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/12/1a5dcf4a-bd27-45b5-9e4e-7ea7eabb33d9_1.png?w=1024", "comment_count": 0, "tags": "The Bachelorette", "topics": "TV News", "body": "The finale of The Bachelorette has sparked another lead from the ABC reality dating franchise to speak out candidly about how her own finale was edited by show producers.\r\nRachel Lindsay, the historic star of The Bachelorette's 2017 cycle, got engaged to winner Bryan Abasolo on her season 13 finale. Now, however, she is opening up to say, \"I was denied my on-camera happy ending\" and \"labeled an angry black female.\"\r\nLindsay was the first black lead of the long-running franchise, which just wrapped its 14th season of The Bachelorette on Monday night. Lindsay remains the only black star in the franchise's combined 26 seasons, and though her long overdue casting was praised and her season was initially celebrated for its diversity, the cycle ended up being criticized for race-baiting for drama.\r\nIn a blog post about Becca Kufrin's finale for Us Weekly, Lindsay details how her TV ending played out differently than the one that just aired. Kufrin accepted a proposal from her winner, Garrett Yrigoyen, who has emerged as a controversial pick given his past social media history of liking several memes espousing offensive rhetoric.\r\nLindsay, who remains happily engaged to Abasolo, says the pretaped portion of the latest finale gave Kufrin and Yrigoyen the \"true definition\" of a happy ending. After the proposal, the live aftershow saw the couple return to discuss their journey off-camera, including the Instagram scandal. But Lindsay says what she endured on the night of her finale was much worse.\r\n\"Becca did not sit on stage for three hours and watch the finale for the first time in front of a live audience,\" Lindsay wrote, recalling how her part of the live post-finale special, After the Final Rose, cut into the pretaped portion. \"Becca did not have to deal with someone telling her she would live a mediocre life. Becca did not have to deal with being baited with real-time questions about her emotions watching certain scenes. Nope, that was me.\"\r\n\r\nAs viewers will recall, much of Lindsay's finale centered around the departure of her runner-up, Peter Kraus, and she criticized the show for focusing more on the breakup than the proposal.\r\n\"Let’s just be honest, Becca did not have the finale that I had,\" she continued. \"There was no controversy and she was not put in a position to face any. She was protected and I was placed on display for three hours and labeled an angry black female. And there will always be that stigma attached to my finale because it has been said that when truth is blurred by misinformation, perception becomes reality and all is lost.\"\r\nLindsay summed up what was meant to be a finale recap by challenging ABC and show producers to do better.\r\n\"The Bachelor franchise does believe in happy endings — some people get an on-camera happy ending, some people get on off-camera happy ending, and some people get both,\" she says. \"For Becca, I truly hope she gets both. As for my happy ending, it was not demonstrated within the confines of your television screens, but I am living it every day in real life. So in regards to a future on-camera happy ending and whether or not I will get married on TV, I have no idea but they damn sure owe us one.\"\r\nAt the time, Lindsay said that a lot of her relationship with Abasolo was left on the cutting-room floor because their relationship was drama-free. Instead, much of the focus was on Lindsay sending Kraus home early over his hesitance about proposing. \"Bryan was the person,\" she said of why she sent Kraus home. \"I’m only in love with one person through that entire season. I wanted that proposal to be all about Bryan. I wanted him to be the focus.\"\r\nThis year's Bachelor, Arie Luyendyk Jr., also spoke out after his season wrapped to say that he felt \"betrayed\" by how show producers edited his controversial finale, which resulted in Kufrin being named as the Bachelorette.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Ex-Bachelorette Rachel Lindsay Criticizes Show Producers Over Finale Edit", "url": "https://www.hollywoodreporter.com/tv/tv-news/bachelorette-rachel-lindsay-criticizes-editing-her-finale-1132842/", "description": "Rachel Lindsay, the 2017 historic star of ABC’s ‘The Bachelorette,’ criticizes how the show producers edited her finale and says she was labeled “an angry black female.&#822…", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/12/1a5dcf4a-bd27-45b5-9e4e-7ea7eabb33d9_1.png?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2018-08-07T12:43:24+00:00", "modified_time": "2018-08-07T14:18:57+00:00"}, "twitter": {"site": "@thr", "creator": "@jackiedstrause", "card": "summary_large_image", "title": "Ex-Bachelorette Rachel Lindsay Criticizes Show Producers Over Finale Edit", "description": "Rachel Lindsay, the 2017 historic star of ABC’s ‘The Bachelorette,’ criticizes how the show producers edited her finale and says she was labeled “an angry black female.&#822…", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/12/1a5dcf4a-bd27-45b5-9e4e-7ea7eabb33d9_1.png?w=1280"}}, "movies": [], "publish_date": 1533645804.0, "source": "https://www.hollywoodreporter.com", "summary": ""}