{"url": "https://about.usps.com/news/national-releases/2017/pr17_036.htm", "text": "ANAHEIM, CA — Tomorrow, the U.S. Postal Service will celebrate the rich legacy of the Walt Disney Studio’s Ink & Paint Department by dedicating a sheet of 20 Forever stamps featuring 10 classic Disney Villains. Postmaster General Megan J. Brennan will be joined by Disney officials in dedicating the stamps.\n\n“The Postal Service is highlighting the Disney Villains and the pioneering spirit of the Ink and Paint Department that brought many of these characters to life,” said Brennan. “These Forever stamps are our way of saying Disney Villains will forever entertain us and serve as a tribute Disney’s artistry and storytelling skill.”\n\nEach stamp showcases one of 10 classic Disney Villains set against a blue background.\n\nFrom left: the Queen (Snow White and the Seven Dwarfs), Honest John (Pinocchio), Lady Tremaine (Cinderella), the Queen of Hearts (Alice in Wonderland) and Captain Hook (Peter Pan),\n\nFrom left: Maleficent (Sleeping Beauty), Cruella De Vil (One Hundred and One Dalmatians), Ursula (The Little Mermaid), Gaston (Beauty and the Beast) and Scar (The Lion King).\n\nhe words “USA” and “Forever” appear in the top right corner or bottom right corner of each stamp and the name of the classic villain and the movie in which the character appears runs along the left edge.\n\nThe Art of Animation\n\nBeginning in 1923, as part of Walt Disney Animation Studios, Disney’s Ink & Paint Department helped create classic animated films. Its artists brought life to countless memorable characters, including many iconic Disney Villains. One of the first groups of its kind, Disney’s Ink & Paint Department was yet another stop on the road to creating an animated film.\n\nArt director Derry Noyes of Washington, DC, worked closely with Disney Creative Director, David Pacheco and the team at Walt Disney Studio’s Ink and Paint Department to design this issuance.\n\nThe Disney Villains from the Walt Disney Studio’s Ink & Paint Department stamps are being issued as Forever stamps that are always equal in value to the current First-Class Mail service 1-ounce price.\n\nOrdering First-Day-of-Issue Postmarks\n\nCustomers have 60 days to obtain the first-day-of-issue postmark by mail. They may purchase new stamps at their local Post Office, at usps.com/shop, or by calling 800-782-6724. They must affix the stamps to envelopes of their choice, address the envelopes to themselves or others, and place them in a larger envelope addressed to:\n\nFDOI – DISNEY VILLAINS FOREVER STAMPS\n\nUSPS Stamp Fulfillment Services\n\n8300 NE Underground Drive, Suite 300\n\nKansas City, MO 64144-9900\n\nAfter applying the first-day-of-issue postmark, the Postal Service will return the envelopes through the mail. There is no charge for the postmark up to a quantity of 50. There is a 5-cent charge for each additional postmark over 50. All orders must be postmarked by Sept. 15, 2017.\n\nOrdering First-Day Covers\n\nThe Postal Service also offers first-day covers for new stamp issues and Postal Service stationery items postmarked with the official first-day-of-issue cancellation. Each item has an individual catalog number and is offered in the quarterly USA Philatelic, online at usps.com/shop, or by calling 800-782-6724. Customers may request a free issue of USA Philatelic at usps.com/philatelic, by calling 800-782-6724, or by writing to:\n\nU.S. Postal Service\n\nUSA Philatelic Request\n\nPO Box 219014\n\nKansas City, MO 64121-9014\n\nPhilatelic Products\n\nPhilatelic products for this stamp issue are as follows, by item number:\n\n• 475400 Disney Villains Stamp Pane $9.80 • 475406 Press Sheet With Die-Cut $58.80 • 475410 DCP Keepsake (random cover) $11.95 • 475416 First Day Cover Set of 10 $9.30 • 475421 Digital Color Postmark Set of 10 $16.40 • 475430 Ceremony Program $6.95 • 475424 Framed Art (All Characters) $39.95 • 475450 The Queen Framed Art $29.95 • 475451 Honest John Framed Art $29.95 • 475452 Lady Tremaine Framed Art $29.95 • 475453 Queen of Hearts Framed Art $29.95 • 475454 Captain Hook Framed Art $29.95 • 475455 Maleficent Framed Art $29.95 • 475456 Cruella De Vil Framed Art $29.95 • 475457 Ursula Framed Art $29.95 • 475458 Gaston Framed Art $29.95 • 475459 Scar Framed Art $29.95\n\nThe Postal Service receives no tax dollars for operating expenses and relies on the sale of postage, products and services to fund its operations.\n\n###\n\nPlease Note: For broadcast quality video and audio, photo stills and other media resources, visit the USPS Newsroom.\n\nFollow us on twitter.com/USPS and like us at facebook.com/USPS. For more information about the Postal Service, visit usps.com and usps.com/postalfacts.", "images": ["https://about.usps.com/about/global/images/news/phx_corpsite_postalnews.gif", "https://about.usps.com/news/images/facebook.gif", "https://about.usps.com/news/national-releases/2017/images/pr17_036-4.jpg", "https://about.usps.com/news/national-releases/2017/images/pr17_036-3.jpg", "https://about.usps.com/news/images/twitter.gif", "https://about.usps.com/news/national-releases/2017/images/pr17_036-8.jpg", "https://about.usps.com/news/national-releases/2017/images/pr17_036-10.jpg", "https://about.usps.com/news/national-releases/2017/images/pr17_036-6.jpg", "https://about.usps.com/news/national-releases/2017/images/pr17_036-5.jpg", "https://about.usps.com/about/global/images/global/usps_about_logo.gif", "https://about.usps.com/about/global/images/news/usps_about_download_icon.gif", "https://about.usps.com/news/national-releases/2017/images/pr17_036-1.jpg", "https://about.usps.com/news/national-releases/2017/images/pr17_036-7.jpg", "https://about.usps.com/news/national-releases/2017/images/pr17_036-9.jpg", "https://about.usps.com/news/images/yspacer.gif", "http://s7.addthis.com/static/btn/v2/lg-share-en.gif", "https://about.usps.com/news/national-releases/2017/images/pr17_036.jpg", "https://about.usps.com/news/national-releases/2017/images/pr17_036-2.jpg"], "top_img": "https://about.usps.com/news/national-releases/2017/images/pr17_036.jpg", "keywords": [], "authors": [], "canonical_link": "", "title": "Disney villains take center stage on Forever stamps", "meta_data": {}, "movies": [], "publish_date": null, "source": "https://about.usps.com", "summary": ""}