{"url": "https://en.wikipedia.org/wiki/Gigi_Hadid", "text": "American model and television personality (born 1995)\n\nJelena Noura \"Gigi\" Hadid ( JEE-jee; born April 23, 1995) is an American model, television personality, founder and creator director of clothing line \"Guest In Residence\".[4][5][6] In November 2014, she made her debut in the Top 50 Models ranking at Models.com.[7] In 2016, she was named International Model of the Year by the British Fashion Council.[8] Over the span of four years she has made thirty-five appearances on international Vogue magazine covers.[9]\n\nBorn in Los Angeles, she began her modeling career as a child model for Baby Guess. She signed to IMG Models in 2013 and made her New York Fashion Week debut the following year. She has appeared in numerous high fashion campaigns and editorials, and is a spokesmodel for Maybelline.\n\nEarly life\n\nJelena Noura Hadid was born on April 23, 1995,[10] in Los Angeles, California, to Palestinian Jordanian real-estate developer Mohamed Hadid and Dutch former model Yolanda Hadid (née Van den Herik).[11][12] Through her father, she claims descent from Daher Al Omer, Prince of Nazareth and Sheik of Galilee.[13][14] She has a younger sister, Bella, and a younger brother, Anwar, both of whom are also models.[15] She also has two older paternal half-sisters; Marielle and Alana.[10][16] She and her siblings were raised on a ranch in Santa Barbara.[17] The family moved to Beverly Hills after ten years.[18]\n\nIn 2013, Hadid graduated from Malibu High School, where she was the captain of the school's varsity volleyball team, as well as an equestrian.[19][20] Following high school, she moved to New York City to study criminal psychology at The New School. She suspended her studies to focus on her modeling career.[21]\n\nCareer\n\n1997–2012: Early work\n\nHadid's modeling career began when she was two years old[22] after being discovered by co-founder of Guess, Paul Marciano. She started modeling for Baby Guess before stopping to concentrate on school. Hadid eventually returned to modeling in 2011.[23] She resumed working with Marciano, and was named the face of a Guess campaign in 2012. She has shot three campaigns with Guess as an adult.[20][24]\n\n2013–2016: Breakthrough\n\nAfter signing to IMG Models in 2013, Hadid made her New York Fashion Week debut in February 2014, walking for Desigual.[25][26] In the same month, she got her break in high fashion on the cover of Carine Roitfeld's CR Fashion Book.[27] On July 15, 2014, she starred alongside actor and model Patrick Schwarzenegger in fashion designer Tom Ford's Eyewear autumn/winter campaign.[28] She co-hosted the Daily Front Row's Fashion Media Awards event that was held in New York City on September 5, 2014.[29] She has also starred in campaigns for Tom Ford F/W 2014, Tom Ford Velvet Orchard Fragrance and Tom Ford Beauty 2014.[30][31] She was featured on the cover of Galore magazine in 2014.[32][33][34]\n\nHadid in 2016\n\nHadid appeared in the 2015 Pirelli Calendar.[35] In that same year, Hadid was also the brand ambassador for Australian fashion swimwear label Seafolly. In January 2015, she was named the Daily Front Row's Model of the Year,[36] and a Maybelline brand ambassador.[37] In March 2015, Hadid and her then-boyfriend, Cody Simpson, were featured as a part of fashion photographer Mario Testino's project, \"Towel Series.\"[38] By May 2015, Hadid had walked for designers Marc Jacobs, Chanel, Michael Kors, Jean Paul Gaultier, and Max Mara.[39] Hadid appeared in the music video for Taylor Swift's song \"Bad Blood\", which was released in the same month. She has made several appearances alongside her younger sister, Bella. In December 2015, she made her first appearance at the Victoria's Secret Fashion Show.[40]\n\nHadid appeared on several magazine covers, including Vogue (United States, Paris, Italy, Britain, Japan, Spain, Australia, Brazil, the Netherlands, Germany, China), Schön!,[41] Numéro, Allure, W Magazine and Teen Vogue, as well as The Wall Street Journal, Elle (Canada), Dazed and Harper's Bazaar (United States, Malaysia).[42][43][44] Hadid has also shot editorials for VMAN, Elle (United States), Grazia, Cleo, Vogue, Sports Illustrated, Paper Magazine, Vanity Fair and V Magazine. Hadid has also starred in campaigns for Guess, Versace, Penshoppe, Balmain F/W 2015, Topshop, Max Mara, and Stuart Weitzman.[45][46][47]\n\nIn 2016, she walked for Versace, Chanel, Elie Saab, Fendi, Marc Jacobs, Anna Sui, Miu Miu, Balmain, Diane Von Furstenberg, Tommy Hilfiger, Fenty x Puma, Isabel Marant, and Giambattista Valli.[48][49][50][51] In January 2016, she became the global brand ambassador for Tommy Hilfiger, fronting campaigns for underwear, apparel and fragrances.[52] In April 2016, Hadid starred in an interactive campaign including a commercial for the BMW M2.[53] She hosted the 2016 iHeartRadio Much Music Video Awards in Toronto on June 19, 2016.[54] She co-designed a capsule collection with Tommy Hilfiger called Gigi by Tommy Hilfiger, which was released in the fall of 2016 at New York Fashion Week.[55] During the Fall 2016 Fashion Weeks in New York, Milan and Paris, Hadid opened five shows and closed seven.[56] In October, her boot collection for Stuart Weitzman titled the Gigi Boot was revealed,[57] and she became a brand ambassador for Reebok, fronting the #PerfectNever campaign.[58]\n\nOn November 20, 2016, Hadid hosted the American Music Awards alongside Saturday Night Live alum Jay Pharoah.[59] She received backlash for an impression of former First Lady Melania Trump during the show, and later apologized.[60] In December 2016, she made her second appearance at the Victoria's Secret Fashion Show, earning her wings for the first time,[61] and in the same month she won the award for International Model of the Year at the British Fashion Awards, presented to her by Donatella Versace.[8]\n\n2017–present: further recognition and brand collaborations\n\nHadid started off the Spring/Summer campaign season starring in Fendi and Moschino campaigns.[62] she also was the face of the S/S 2017 campaign for Max Mara accessories, Stuart Weitzman[63] and DSQUARED2.[64] The second Tommy Hilfiger and Hadid ready-to-wear collection was presented in February 2017 for the Spring season.[65] Hadid was the photographer of the Versus (Versace) Spring/Summer 2017 campaign which featured Hadid's then-boyfriend, singer Zayn Malik, and model Adwoa Aboah.[66] She also photographed a special summer edition of V Magazine titled Gigi's Journal, which featured Polaroids of fashion industry colleagues, celebrities and close friends.[67]\n\nHadid was featured on four March 2017 Vogue covers; American, British, Chinese, and the inaugural edition of Vogue Arabia.[68][69][70][71] She also appeared on the covers for CR Fashion Book (Spring/Summer 2017), Jolie (April 2017) and The Daily (Spring 2017).[72][73][74] She featured on the May 2017 covers for the Netherlands editions of Vogue, Cosmopolitan and Glamour as well as the June/July 2017 cover of American Harper's Bazaar.[75][76] Hadid has starred in editorials for American Vogue (April 2017) and LOVE Magazine (Spring/Summer 2017).\n\nHadid in a campaign for Stuart Weitzman in 2017\n\nHadid scored her second American Vogue cover in August 2017, sharing the cover with her then-boyfriend, Zayn Malik.[77] During Fall/Winter 2017 Fashion Month in New York, Milan and Paris, Hadid opened the shows for Jeremy Scott, Anna Sui, Versus (Versace), Alberta Ferretti, Missoni, H&M and Balmain; and closed the shows for Isabel Marant, Moschino, Max Mara and Anna Sui. She also released the first season of two new collaborations with Vogue Eyewear and Messika Jewelry.[75] At the Daily Front Row's third annual Fashion Los Angeles Awards, Hadid was honored for the Best Design Debut for her collection with Tommy Hilfiger.[78] She ended 2017 by being named one of Glamour's Women of the Year, alongside Nicole Kidman, Solange Knowles, Muzoon Almellehan and others.[79]\n\nHadid started 2018 with multiple high fashion campaigns, including Valentino, Moschino, Versace and Fendi. She also went on to release her second collaboration with both Vogue Eyewear and Messika Jewelry.[80] In February, during fashion week, she presented the fourth and last season of her capsule collection with Tommy Hilfiger in Milan.\n\nShe appeared on many different international Vogue covers in 2018, including British Vogue in March,[81] Vogue Italia in May and Vogue Brazil in September.[82] She also scored multiple American covers, including the Harper's Bazaar May issue,[83] V Magazine's Fall Preview Cover V114,[84] and W Magazine. She also covered LOVE Magazine's 10th Anniversary edition,[85] Chaos 69, and Chaos True Originals – Disney Special.\n\nIn November 2018, she announced her first collaboration with Reebok designing sneakers for the brand, starting with limited release on December 7 and the full collection to be released later in February 2019.[86] She also returned to the Victoria's Secret Fashion Show for the third time in the same month.[87] In early 2019, she appeared on more international Vogue covers, including Vogue Czechoslovakia, Vogue Arabia, and Vogue Hong Kong.[80]\n\nIn October 2019, Hadid filmed an episode for Food Network cooking competition Beat Bobby Flay. She teamed up with chef Anne Burrell against chef and restaurateur Bobby Flay. The episode was aired in June 2020.[88] Hadid guest-starred in an episode of Scooby-Doo and Guess Who?. The episode was aired on October 1, 2020, on streaming service Boomerang.[89]\n\nGuest In Residence clothing line\n\nGigi Hadid announced she would be the founder and creative director of clothing line \"Guest In Residence\" via Instagram in 2022.[4][5][90]\n\nActivism\n\nHadid at the amFAR Gala in 2015\n\nIn January 2016, Hadid participated in MasterChef and raised $25,000 for Global Lyme Alliance, an organization centered on the pseudoscientific diagnosis[91] of Chronic Lyme disease.[92] In October 2016 she joined other celebrities in supporting the BBC's Children in Need's T-shirt philanthropy project. The shirt, designed by Giles Deacon, sold for $15 with 70% of all the proceeds going to the charity.[93]\n\nIn January 2017, after former President Donald Trump signed Executive Order 13780 (commonly known as a \"Muslim Ban\"), Hadid and her sister, Bella, protested among others in New York City.[94]\n\nHadid announced in May 2018 that she will be working closely with Unicef to help children around the world. On August 25, she went on her first mission with UNICEF to visit their programing in Bangladesh. The trip fell on the eve of the one-year anniversary of the Rohingya refugee crisis.[95]\n\nOn May 3, 2020, Hadid and other celebrities joined forces to play a virtual charity tennis match on Facebook Gaming. Organized by IMG Tennis, the participants all received $25,000 to donate to a charity of their choice. The winners received an additional $1 million to donate. Hadid played for the non-profit organization Feeding America.[96] In June 2020, Hadid auctioned off some of her clothes as part of a charity auction organized by British Vogue that benefitted NHS Charities Together and the NAACP.[97]\n\nHadid has shown support for the Black Lives Matter movement. A percentage of the sales from her quarantine editorial with V Magazine, Gigi's Journal Part II, were donated to four organizations; the Black Lives Matter Global Network Foundation, the NAACP, the ACLU, and Campaign Zero. The organizations also received personal donations from Hadid.[98]\n\nHadid has frequently marched and campaigned for pro-Palestinian causes.[99]\n\nIn 2022, Hadid pledged to donate her earnings from the Fall 2022 shows to help Ukrainian victims of the Russian invasion.[100][101]\n\nPersonal life\n\nHadid revealed in 2014 that she has Hashimoto's thyroiditis.[102]\n\nUkrainian self-styled prankster Vitalii Sediuk lifted her off the ground from behind in 2016 under the pretense of a prank,[103][104] and she was commended on how she defended herself from him.[105][106]\n\nRelationships\n\nHadid dated Australian singer Cody Simpson from 2013 to May 2015.[107] She appeared in his music videos for \"Surfboard\" and \"Flower\".[108] She subsequently dated American singer Joe Jonas from May to November 2015, during which time she directed his band DNCE's music video for \"Cake by the Ocean\".[109]\n\nShe began dating English singer Zayn Malik in late 2015, although they have broken up and reconciled multiple times.[110][111][112] She appeared in Malik's music video for \"Pillowtalk\". They starred on the August 2017 cover of American Vogue,[77] making them the third couple to appear together on a Vogue cover. It courted controversy because of Vogue misnaming them as gender fluid, for which Vogue apologized.[113] They also did a Versus (Versace) campaign as a couple, with Hadid as the photographer.[114][115] In April 2020, she confirmed that she and Malik were expecting their first child during an interview on The Tonight Show Starring Jimmy Fallon, after rumors began to circulate of her pregnancy.[116][117] Their daughter was born in September 2020.[118] The family spent a majority of their time on a farm in rural New Hope, Pennsylvania, where Hadid's mother and younger sister also own land.[119][120]\n\nIn October 2021, Malik entered a no contest plea to four charges of harassment against her mother Yolanda. He was sentenced by a Pennsylvania court to 360 days of probation, and to complete anger management and domestic violence programs.[121] She and Malik reportedly ended their relationship following the incident.[122]\n\nLegal issues\n\nIn 2017, Hadid attempted to travel to Shanghai to participate in the 2017 Victoria's Secret Fashion Show but ultimately could not, as her Chinese visa was reportedly revoked after an online video showing her doing a slant-eyes gesture in imitation of Buddha was criticized as racist by Chinese internet users.[123][124][125] Victoria's Secret declined to comment when asked whether she pulled out of the fashion show on her own, was asked to by the company, or whether Chinese authorities applied any pressure.[125]\n\nIn late January 2019, she was sued by the independent photo agency business Xclusive for sharing an October 2018 photo of herself without the photographer's permission.[126] In 2017, photographer Peter Cepeda took a photo of her, which she later posted on Instagram. He filed a lawsuit against her the following September and it was later settled outside of court.[126]\n\nFilmography\n\nAwards and nominations\n\nSee also", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/9/91/Gigi_Hadid._2015.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/BathingSuit1920s.jpg/32px-BathingSuit1920s.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Gigi_Hadid_2016.png/170px-Gigi_Hadid_2016.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d2/AnnaSui-FW17RTW-Hadids-BW_%28cropped%29.jpg/170px-AnnaSui-FW17RTW-Hadids-BW_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Gigi_Hadid._2015.jpg/220px-Gigi_Hadid._2015.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Gigi_Hadid_Stuart_Weitzman.jpg/220px-Gigi_Hadid_Stuart_Weitzman.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Gigi_Hadid_amFAR_2015.png/170px-Gigi_Hadid_amFAR_2015.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/9/91/Gigi_Hadid._2015.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Gigi_Hadid", "title": "Gigi Hadid", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Gigi_Hadid._2015.jpg/640px-Gigi_Hadid._2015.jpg", "width": 640, "height": 800}, "title": "Gigi Hadid - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}