{"url": "https://www.papercitymag.com/real-estate/montroses-coveted-houses-inside-secret-enclave-heart-houston/", "text": "The first-floor sitting area’s artworks are hung salon-style and include pieces by Wayman Elbridge Adams, Margaret Keane and Paul Jacoulet. Wax pieces over steel console by Jane Moseley from The Hole, NYC.\n\nCoveted by artists, architects, designers, curators and other creatives, the dozens of Arts and Crafts-era bungalows owned by the Menil Foundation frequently have a waiting list, and snagging one is often a matter of timing and luck. Painted in what has become known as Menil gray with white doors and trim, the rows of monochromatic abodes offer a grisaille counterpoint to the surrounding colorful Montrose neighborhood.\n\nDominique de Menil instructed architect Renzo Piano to design The Menil Collection in keeping with the bungalows she had begun buying in the 1960s (to prevent development in the area as well as provide low-cost lodging for artists). Clad in the same gray, the private museum pays homage to the for-lease-only bungalows that have served as housing and studios for fortunate Houstonians over the past five decades.\n\nMany with original wood floors, copious natural light and careful renovations, these tidy structures are a beguiling throwback to another era, inspiring their inhabitants with vintage architecture and design. But the real magic of the Menil bungalows lies in the special community and camaraderie that have blossomed around them.\n\nAs a part of our ongoing series about people living and working in the Menil bungalows, we step inside the design studio of Michael Landrum and Garrett Hunter and the home of The Pass & Provisions chef Seth Siegel-Gardner, ad exec wife Hannah and toddler Levi.\n\nStudio & Offices of Designers Michael Landrum and Garrett Hunter\n\nThe charming gray bungalows first landed on architect Michael Landrum’s radar six years ago, when he joined the Menil Contemporaries, the museum’s organization for young collectors. A native of San Antonio with a masters in architecture from UT Austin, Landrum was new to Houston and had purchased a house in the Museum District.\n\n“I’d been looking for office space for quite a long time and thought, ‘Wouldn’t these bungalows be ideal?’” he says. He scheduled an appointment to see the only one available, a duplex for rent with a two-story work/live space. The leasing agent had scheduled two other people to view the bungalow at the same time, but Landrum was escorted in first.\n\nSHOP Swipe\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNext\n\nHe walked in the front door with its two-story entry surrounded by a mezzanine, and was smitten. Without taking another step, he said, “I’ll take it. You don’t need to show it to anyone else.”\n\nFor the first few years, the bungalow was used as a collaborative between Landrum, architect Karen Lantz and interior designer Garrett Hunter. Lantz eventually moved out, and when the remaining part of the duplex became available, Landrum and Hunter took over both spaces.\n\nHunter, who hails from East Texas, worked for many years under Pam Kuhl at Kuhl-Linscomb before teaming up with Landrum. They turned the double-height entry into a conference room dominated by a 17th-century Italian refectory table, a light installation by Austin artist Andy Coolquitt and large-scale works by New York’s Judith Supine and Eddie Martinez, and L.A. artist Retna. There are also several works by the de Menils’ late great-grandson, artist Dash Snow. The interior walls are painted Menil gray for consistency inside and out.\n\n“It’s furnished like a traditional turn-of-the-century architect’s studio, with a mix of antique and modern furniture and art — very Stanford White,” Landrum says, referring to the late-19th-century architect known for his classical houses for wealthy Rhode Islanders and numerous public, institutional and religious buildings in New York.\n\nThe location of their offices couldn’t be more perfect. “We both agree that the proximity to the Menil is such a benefit — and such an inspiration,” Landrum says. “We do work out of town, but most of our jobs are from this area. It’s such a strong visual connection.”\n\nNeighbors include a social worker, a poet, artists and artisans. “There’s a very strong sense of community here. It’s part of the strength of the Menil,” Landrum says.\n\nThe gray bungalows have become a cultural touchstone, much like the Chateau Marmont Hotel in Los Angeles or the Algonquin Hotel in New York. “I’m constantly surprised when I mention that I practice in Houston to someone from New York or L.A., and they already know about the gray bungalows,” Hunter says.\n\nPart of their mystique can be attributed to their idyllic setting inside the Menil’s 30-acre campus. Many of the bungalows face Menil Park, with its old-growth oak trees and landscaping of oleanders, crape myrtles and bamboo, as originally conceived by Renzo Piano and Dominique de Menil.\n\n“In the past two or three years, the park has been an eruption of outdoor activity,” says Hunter. “It’s a great place to bike.” During the week, they’ll walk to Bistro Menil for lunch or hang out at the Menil bookstore, which a friend operates. Their bungalow has hosted dinners for visiting museum lecturers, out-of-town gallerists and artists. Painter and filmmaker Lola Schnabel used it as her studio space for a week while she was in Houston doing portrait work.\n\n“It was sort of a blast and pretty magical,” Hunter says.\n\n“There’s constantly someone here,” adds Landrum. “People feel part of a unique, intellectual and artistic salon. It’s our responsibility as tenants of the bungalows to continue that patronage of the arts that Dominique de Menil began.”\n\nSETH AND HANNAH SIEGEL-GARDNER\n\nChef Seth Siegel-Gardner’s highly touted restaurants, The Pass & Provisions, are an easy five-minute excursion from the two-bedroom Menil bungalow he shares with wife, Hannah, an ad agency account executive. Seth grew up in the Montrose neighborhood, and it’s where his parents still live — another advantage now that the couple has an 11-month-old son, Levi.\n\nBut what really drew them to the area was the exciting hustle and bustle of the area’s outdoor cafes, shops and a walking culture that doesn’t exist elsewhere in Houston, says Hannah, who grew up in West U. It’s an urban lifestyle they experienced living in Chicago and New York City, where Seth helped man such high-profile kitchens as Maze by Gordon Ramsay. When Hannah was admitted into the London School of Economics and Political Science, Seth took a job as a private chef there.\n\nMoving back to Houston was a bit of a culture shock, happily mitigated by their decision to live in Montrose. “We wanted to be in an area where we could walk to things and capture that part of an urban lifestyle we’d grown accustomed to,” Hannah says.\n\nThey first heard about the bungalows when a childhood friend of Hannah’s, a jewelry designer, moved into one. “The girl living in the one across the street from hers was moving out, and she asked the Menil management if we could get it,” says Hannah.\n\nTiming is everything. The Siegel-Gardners moved into their sunny, 1,200-square-foot bungalow eight years ago. The best thing about it, she says, is the abundance of natural light. “Our bedroom has a skylight, so the plants go wild in there. We also love all the little details, such as the beautiful crown molding and original wood floors.”\n\nOf course, the 85-year-old house has its quirks. “I’ve never lived in a house this old before,” Seth says. “It has its moans and groans, but it has good old bones.” They love the large palm trees in the backyard and are fascinated by the remnants of a trapeze left behind by a former tenant, an acrobat. “\n\n“The best part about it is the neighborhood; we’ve made so many friends,” Seth says. “We’re always running back and forth across the street for potluck dinners, or hanging out with people before walking to a restaurant for dinner.”\n\nUnderbelly restaurant is a favorite, with Blacksmith a go-to destination for coffee and sandwiches, and Hugo’s for weekend brunch. They spend a lot of time in the museums, which are literally out their front door. One of Seth’s favorites is the Cy Twombly Gallery at The Menil Collection (which he calls “a hidden gem”).\n\n“I get off work pretty late and take the dogs for a walk, and it’s nice walking past the Menil, all lit up inside,” he says. “They do a concert series in front of the Rothko Chapel, which is fun. I like going in for a moment, as the deafening silence is a pretty good way to clear your head.”\n\nThe urban walking environment of the Menil bungalows is exactly what the Siegel-Gardners were looking for. “We drive to and from work, that’s it,” Seth says.", "images": ["http://www.papercitymag.com/wp-content/uploads/2016/01/125_e_1215-772x1024.jpg", "https://www.papercitymag.com/wp-content/uploads/2016/01/123_e_1215-1200x800.jpg", "https://www.papercitymag.com/wp-content/uploads/2016/01/121_e_1215-1024x851.jpg", "https://www.facebook.com/tr?id=1451550031690032&ev=PageView&noscript=1", "https://www.facebook.com/tr?id=299625317900477&ev=PageView&noscript=1"], "top_img": "https://www.papercitymag.com/wp-content/uploads/2016/01/123_e_1215-1200x800.jpg", "keywords": [], "authors": ["Rebecca Sherman", "Casey Dunn For Sister Brother Management"], "canonical_link": "https://www.papercitymag.com/real-estate/montroses-coveted-houses-inside-secret-enclave-heart-houston/", "title": "Montrose’s Most Coveted Houses: Inside a Secret Enclave in the Heart of Houston", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no,viewport-fit=cover", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "One of Houston's best neighborhoods is more than a tad secret. It's in the heart of Montrose, but few know how to gain residence there. Connections needed.", "og": {"locale": "en_US", "type": "article", "title": "Montrose's Most Coveted Houses: Inside a Secret Enclave in the Heart of Houston", "description": "Coveted by artists, architects, designers, curators and other creatives, the dozens of Arts and Crafts-era bungalows owned by the Menil Foundation", "url": "https://www.papercitymag.com/real-estate/montroses-coveted-houses-inside-secret-enclave-heart-houston/", "site_name": "PaperCity Magazine", "image": {"identifier": "https://www.papercitymag.com/wp-content/uploads/2016/01/123_e_1215-1200x800.jpg", "width": 1200, "height": 800, "type": "image/jpeg"}}, "article": {"publisher": "https://www.facebook.com/PaperCityMag", "published_time": "2017-01-30T14:33:31+00:00", "modified_time": "2017-05-10T20:07:51+00:00"}, "author": "Rebecca Sherman", "twitter": {"card": "summary_large_image", "creator": "@papercitymag", "site": "@papercitymag", "label1": "Written by", "data1": "Rebecca Sherman", "label2": "Est. reading time", "data2": "7 minutes"}, "google-site-verification": "7e65PyTcjjTX6KBhkv1D3pM5h3E7eOkVKEsVfJ87D0U"}, "movies": [], "publish_date": 1485786811.0, "source": "https://www.papercitymag.com", "summary": ""}