{"url": "https://www.hypable.com/the-100-season-5-lindsey-morgan-interview-clarke-raven/", "text": "The 100 star Lindsey Morgan speaks to Hypable about Raven’s arc in the beginning of The 100 season 5 — specifically staying on the Eligius ship, and reuniting with Clarke.\n\nRaven Reyes has had a rough six years in space.\n\nAlthough The 100 has positioned SpaceKru (Bellamy, Raven, Monty, Harper, Emori, Murphy and Echo) as the most well-functioning faction of Praimfaya survivors, Lindsey Morgan’s Raven was not able to lay down her burdens in the same way that most of her friends have done.\n\nRelated: Will Raven Reyes be happy in The 100 season 5? Lindsey Morgan teases SpaceKru’s post-Praimfaya journey\n\nBecause, as Morgan explains in an exclusive interview with Hypable, Raven feels like she is responsible for stranding them in space, and she had practically made it her life mission to get them back to the ground.\n\nFrom Raven’s perspective, “They wouldn’t be in space and threatened this way if it wasn’t for Raven’s indecision about the bunker,” says Morgan.\n\n“Raven screwed up the plan, and made them come get her, and ruined everyone’s chance of safety. So them being in space is completely Raven’s fault, and leaving Clarke, and ultimately killing Clarke is completely Raven’s fault, and she knows that.”\n\nSo when the opportunity presented itself in The 100 5×03 “Sleeping Giants,” she did not hesitate to sacrifice herself for her friends.\n\nArticle Continues Below\n\nShe lied to Bellamy, telling him there was an escape pod, knowing that this false assurance would give him peace of mind to leave Raven behind and go find his sister.\n\n“Raven is trying to hide her desperation to Bellamy because she doesn’t want him to get suspicious about it,” says Morgan. “Because if he knew the truth, he wouldn’t let her go. But she has to sacrifice herself to get them home safe, otherwise she wouldn’t be able to live with herself.”\n\nAlthough it was a tough scene to watch and film, Morgan counts “Sleeping Giants” among her favorite episodes for Raven.\n\n“I love that she got to make that decision. In a weird way, it gave her peace,” she says. “It was such an amazing way for Raven to pay homage to Clarke. And show gratitude to her friends.”\n\nOf course we know that this is not the end of Raven’s story. How she and Murphy eventually get to the ground, and what happens when they do, are still mysteries.\n\nBut despite not yet being on the ground, Raven and Murphy got to be the second and third person to reunite with Clarke, over the radio, in an extremely emotional scene in 5×04 “Pandora’s Box.”\n\nMorgan describes this scene as “very special, very moving, and just such a shock” for Raven.\n\n“I remember filming that scene, and I just… I was stunned,” Morgan remembers. “It was such an interesting emotion to play, because it was almost like hearing an angel speak, you know? Not to be dramatic! But that’s what it felt like.”\n\nMorgan describes Raven finding out Clarke is alive as “a literal miracle. I don’t think Raven has ever gotten that lucky before.”\n\nClarke and Raven’s relationship has always been a cornerstone of The 100, although sadly, the pair don’t often get to cross storylines.\n\nRegardless, “Clarke means so much to Raven,” Morgan says. “Clarke and Raven are connected in ways that others aren’t. They have such a special and complex relationship, after everything they’ve been through. There’s so much respect and love at the core of it.”\n\nBecause of their connection, and because of Raven’s guilt surrounding Clarke’s death, Morgan says that “it was hard for Raven to imagine her life without [Clarke]. She was just so important to her.”\n\n“To have her be gone, and to reconcile with that, and knowing it was her fault… and then to find out she was alive? It really was a miracle.”\n\nWe will have to wait and see what happens when/if Raven and Clarke reunite on the ground. For now, it is great to see Raven let go of some of her guilt (even as new trouble is brewing), and to be reminded of how much these two women still mean to each other, after all this time.\n\nThis was the second part of our big The 100 season 5 interview with Lindsey Morgan. You can read the first, much longer part of the interview right here.\n\n‘The 100’ season 5 airs Tuesdays at 9/8c on The CW", "images": ["data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201200%20600'%3E%3C/svg%3E", "https://trkn.us/info/?sid=4fc59976-8e24-4b18-9416-5971cd4ba741", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%201000%20481'%3E%3C/svg%3E", "https://w7w5t4b3.rocketcdn.me/wp-content/themes/hypable_redesign/img/app2.png", "https://w7w5t4b3.rocketcdn.me/wp-content/uploads/2018/05/HU504a_0681b.jpg", "https://w7w5t4b3.rocketcdn.me/wp-content/uploads/2018/05/The-100-504-14.png", "https://w7w5t4b3.rocketcdn.me/wp-content/uploads/2018/05/The-100-season-5-episode-3-41.png", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%200%200'%3E%3C/svg%3E"], "top_img": "https://w7w5t4b3.rocketcdn.me/wp-content/uploads/2018/05/HU504a_0681b.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.hypable.com/the-100-season-5-lindsey-morgan-interview-clarke-raven/", "title": "'The 100's' Lindsey Morgan breaks down Raven and Clarke's reunion", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "fb": {"pages": 209289309100902}, "msvalidate.01": "762B221D658703FF83E16F287E9DE924", "robots": "index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1", "description": "The 100 star Lindsey Morgan speaks to Hypable about Raven's arc in the beginning of The 100 season 5 -- specifically staying on the Eligius ship, and reuniting with Clarke.", "og": {"locale": "en_US", "type": "article", "title": "'The 100's' Lindsey Morgan breaks down Raven and Clarke's reunion", "description": "The 100 star Lindsey Morgan speaks to Hypable about Raven's arc in the beginning of The 100 season 5 -- specifically staying on the Eligius ship, and reuniting with Clarke.", "url": "https://www.hypable.com/the-100-season-5-lindsey-morgan-interview-clarke-raven/", "site_name": "Hypable", "image": {"identifier": "https://w7w5t4b3.rocketcdn.me/wp-content/uploads/2018/05/HU504a_0681b.jpg", "width": 1200, "height": 600}}, "article": {"publisher": "http://www.facebook.com/hypable", "published_time": "2018-05-16T12:00:11+00:00", "modified_time": "2018-05-16T13:56:15+00:00"}, "twitter": {"card": "summary_large_image", "creator": "@SelinaWilken", "site": "@hypable"}, "msapplication-TileImage": "https://w7w5t4b3.rocketcdn.me/wp-content/uploads/2019/03/cropped-hypable_logo_circle_icon-270x270.png"}, "movies": [], "publish_date": 1526472011.0, "source": "https://www.hypable.com", "summary": ""}