{"url": "https://deadline.com/2017/11/david-cassidy-hospitalized-organ-failure-1202211631/", "text": "Pop star David Cassidy has been hospitalized in Florida and is suffering from organ failure, according to his publicist.\n\nThe 67-year-old David Cassidy has previously admitted he was stricken with dementia, but now his liver and kidneys are failing, according to his publicist, JoAnn Geffen. She confirmed his hospitalization, noting, “he is now conscious and surrounded by family.”\n\nReports indicate Cassidy has been hospitalized for three days and is in critical condition. He has been in declining health for a while and has been open about his prior financial and health problems.\n\nCassidy, the star of The Partridge Family television show, last performed in March at the B.B. King Blues Club & Grill in New York.\n\nThe singer is suffering from kidney failure and needs a liver transplant, according to at least one report. Cassidy’s health has been in decline for more than two months, and his family has been told to prepare for the worst.\n\nCassidy revealed his dementia diagnosis earlier this year. He has also been open about his struggles with alcohol and drug addition.\n\nIn February, he was a guest on the Dr. Phil show, and talked about falling on stage and forgetting the lyrics to one of his songs during an Agoura Hills, Calif. performance.\n\n“When friends of yours or family members begin to say to you, ‘Remember, I just told you this two days ago,’ and there’s no memory of it, that’s when I began to be very concerned,” he said on the show.\n\nCassidy was arrested for three DUIs since 2010. A judge ordered him to rehab in 2014.\n\nCassidy, who comes from a show business family (father Jack Cassidy was an actor, and stepmother Shirley Jones starred with him on The Partridge Family), skyrocketed to fame for his role as Keith Partridge on the 1970s sitcom The Partridge Family, which aired from 1970-1974. He became a teen idol, fueling his fame with such heart-throb pop hits as I Think I Love You.\n\nAfter that hit, Cassidy strove to become respected as a musician, and managed to produce the hit Cherish, which reached number nine on the Billboard Hot 100 and number two on the UK pop charts. He went on to produce five solo albums during the series run, as well as ten credited to The Partridge Family, most of them million-sellers. Cassidy was also a major concert attraction, playing stadiums and arena-sized shows.\n\nCassidy struggled with his image as a frothy pop star, coming to grips with it and embracing it later in life. However, as he matured and his past glories faded, the ensuing years were not kind financially. The former star declared bankruptcy in 2015, blaming diminishing royalty checks for The Partridge Family, health issues that prevented him from touring, and bad investments.\n\nThe bankruptcy documents claimed: “While he still loves performing for his fans, it is more difficult to travel and perform in various parts of the United States or worldwide due to his health.”", "images": ["https://deadline.com/wp-content/uploads/2017/11/ap_789699849963.jpg?w=512&h=333&crop=1", "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/public/lazyload-fallback.jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://pixel.quantserve.com/pixel?a.1=p-0f0nSqEQ_DwA6&a.2=p-31f3D02tYU8zY", "https://deadline.com/wp-content/uploads/2017/11/ap_789699849963.jpg?w=512", "https://www.facebook.com/tr?id=422369225140645&ev=PageView&noscript=1"], "top_img": "https://deadline.com/wp-content/uploads/2017/11/ap_789699849963.jpg?w=512", "keywords": [], "authors": ["Bruce Haring"], "canonical_link": "https://deadline.com/2017/11/david-cassidy-hospitalized-organ-failure-1202211631/", "title": "David Cassidy Hospitalized With Reported Organ Failure", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "apple-mobile-web-app-status-bar-style": "black-translucent", "msapplication-config": "https://deadline.com/wp-content/themes/pmc-deadline-2019/assets/app/browserconfig.xml", "msapplication-TileImage": "https://deadline.com/wp-content/uploads/2019/04/cropped-icon-512x512.png?w=270", "msapplication-TileColor": "#eff4ff", "description": "Former teen idol David Cassidy has been hospitalized with organ failure in Florida.", "news_keywords": "David Cassidy", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=533209613", "generator": "WordPress 6.0.2", "author": "Bruce Haring", "theme-color": "#fff", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "Deadline", "application-name": "Deadline", "content_type": "Article", "post_id": 1202211631, "title": "David Cassidy Hospitalized With Reported Organ Failure", "published_at": "2017-11-18 13:08:50", "image": "https://deadline.com/wp-content/uploads/2017/11/ap_789699849963.jpg?w=296&h=166&crop=1", "comment_count": 17, "tags": "David Cassidy", "topics": "TV", "body": "Pop star David Cassidy has been hospitalized in Florida and is suffering from organ failure, according to his publicist.\r\n\r\nThe 67-year-old David Cassidy has previously admitted he was stricken with dementia, but now his liver and kidneys are failing, according to his publicist, JoAnn Geffen. She confirmed his hospitalization, noting, \"he is now conscious and surrounded by family.\"\r\n\r\nReports indicate Cassidy has been hospitalized for three days and is in critical condition. He has been in declining health for a while and has been open about his prior financial and health problems.\r\n\r\nCassidy, the star of The Partridge Family television show, last performed in March at the B.B. King Blues Club & Grill in New York.\r\n\r\nThe singer is suffering from kidney failure and needs a liver transplant, according to at least one report.  Cassidy’s health has been in decline for more than two months, and his family has been told to prepare for the worst.\r\n\r\nCassidy revealed his dementia diagnosis earlier this year. He has also been open about his struggles with alcohol and drug addition.\r\n\r\nIn February, he was a guest on the Dr. Phil show, and talked about falling on stage and forgetting the lyrics to one of his songs during an Agoura Hills, Calif. performance.\r\n\r\n\"When friends of yours or family members begin to say to you, 'Remember, I just told you this two days ago,' and there's no memory of it, that's when I began to be very concerned,\" he said on the show.\r\n\r\nCassidy was arrested for three DUIs since 2010. A judge ordered him to rehab in 2014.\r\n\r\nCassidy, who comes from a show business family (father Jack Cassidy was an actor, and stepmother Shirley Jones starred with him on The Partridge Family), skyrocketed to fame for his role as Keith Partridge on the 1970s sitcom The Partridge Family, which aired from 1970-1974. He became a teen idol, fueling his fame with such heart-throb pop hits as I Think I Love You.\r\n\r\nAfter that hit, Cassidy strove to become respected as a musician, and managed to produce the hit Cherish, which reached number nine on the Billboard Hot 100 and number two on the UK pop charts.  He went on to produce five solo albums during the series run, as well as ten credited to The Partridge Family, most of them million-sellers. Cassidy was also a major concert attraction, playing stadiums and arena-sized shows.\r\n\r\nCassidy struggled with his image as a frothy pop star, coming to grips with it and embracing it later in life. However, as he matured and his past glories faded, the ensuing years were not kind financially. The former star declared bankruptcy in 2015, blaming diminishing royalty checks for The Partridge Family, health issues that prevented him from touring, and bad investments. \r\nThe bankruptcy documents claimed: \"While he still loves performing for his fans, it is more difficult to travel and perform in various parts of the United States or worldwide due to his health.\"", "fb": {"pages": 105558754896}, "ia": {"markup_url_dev": "https://deadline.com/2017/11/david-cassidy-hospitalized-organ-failure-1202211631/?ia_markup=1"}, "onesignal": "wordpress-plugin", "fragment": "!", "og": {"type": "article", "title": "David Cassidy Hospitalized With Reported Organ Failure", "url": "https://deadline.com/2017/11/david-cassidy-hospitalized-organ-failure-1202211631/", "description": "Pop star David Cassidy has been hospitalized in Florida and is suffering from organ failure, according to his publicist. The 67-year-old David Cassidy has previously admitted he was stricken with d…", "site_name": "Deadline", "image": {"identifier": "https://deadline.com/wp-content/uploads/2017/11/ap_789699849963.jpg?w=512", "width": 512, "height": 333}, "locale": "en_US"}, "article": {"published_time": "2017-11-18T21:08:50+00:00", "modified_time": "2017-11-18T22:50:13+00:00"}, "twitter": {"site": "@DEADLINE", "card": "summary_large_image", "title": "David Cassidy Hospitalized With Reported Organ Failure", "description": "Former teen idol David Cassidy has been hospitalized with organ failure in Florida.", "image": "https://deadline.com/wp-content/uploads/2017/11/ap_789699849963.jpg?w=512"}, "y_key": "a810be562637c603"}, "movies": [], "publish_date": 1511039330.0, "source": "https://deadline.com", "summary": ""}