{"url": "https://web.archive.org/web/20170524182427/http://patriotcrier.com:80/1-6kk-0", "text": "ELDER PATRIOT – New evidence has been uncovered by a private investigator that proves Jim Comey was a dirty cop who had to go.\n\nAfter former DNC staffer Seth Rich was murdered his family asked people to stop speculating about his involvements and to respect their privacy.\n\nAt the time many of us connected the Wikileaks revelations to his death and concluded he was killed to send a message to other would be leakers by people within the DNC or from within the Clinton campaign. Of course we were dismissed as conspiracy theorists.\n\n\n\n\n\nNow it has been reported that former D.C. homicide detective Rod Wheeler had been hired by Rich’s family to run a parallel investigation to the one being conducted by the F.B.I.\n\nBoth the D.C. police and the F.B.I. had been involved but Wheeler revealed that neither, “The police department nor the FBI have been forthcoming. They haven’t been cooperating at all.\n\nWheeler also confirmed that his sources have told him that “absolutely” there is information on Rich’s laptop that links Rich to Wikileaks.\n\nWheeler also was told by his source inside the D.C. Police Department, “Rod, we were told to stand down on this case and I can’t share any information with you.”\n\nAccording to Wheeler, “That is highly unusual for a murder investigation, especially from a police department. Again, I don’t think it comes from the chief’s office, but I do believe there is a correlation between the mayor’s office and the DNC and that is the information that will come out.” [Tuesday].\n\nIt’s apparent that Wheeler was being guarded in giving his statement but the fact is the F.B.I. has been in possession of Rich’s laptop and the agency’s director at the time, James Comey locked down the contents to protect either certain people at the DNC, or members of Hillary’s campaign team, or Hillary Clinton, or likely all three.\n\nComey’s contention that the DNC server contained proof that Russia hackers affected the election is falling apart as we watch the mad scramble that is ensuing following the recent ransomware attacks.\n\nIn explained the ransomware attack, experts are shooting holes in Comey’s claim that the F.B.I. is capable of tracking attacks backwards.\n\nHector Monsegur, Director of Security Assessments for Rhino Security Labs and a former computer hacker who had been arrested by the FBI informant before turning informant said:\n\n“Attribution is probably the hardest thing the FBI is dealing with here.”\n\n“It’s nearly impossible because you have various hackers from pretty much anywhere. Also, they are aware of techniques to track them down. So you could have an Egyptian hacker who uses Russian software so it looks like it’s Russian but is actually from Egypt.”\n\nComey was definitive that Russia had hacked the DNC’s computers with the intention of helping Donald Trump get elected. Here’s what we’ve learned since Comey made that declaration to congress:\n\nThe F.B.I. never did a forensic examination of the DNC servers. Instead they took the word of the company the DNC hired to look into it.\n\nExperts, ones who worked for the F.B.I., admit that attribution is nearly impossible even if you are in possession of the computers that were hacked.\n\nComey “concluded” that Hillary Clinton did not intend to commit espionage despite overwhelming evidence to the contrary but that the Russians intended to help Donald Trump without presenting a single shred of evidence that the Russians were even involved.\n\nRevelations such as this continue to surface. They are the reason that former Federal Prosecutor Joseph DiGenova said of Comey, “he’s a dirty cop.”\n\nWatch the latest video at video.foxbusiness.com\n\nComey had to go and President Trump did the right thing in firing him. Contrary to the talking points coming out of the D.C. swamp, Trump gave Comey every opportunity to prove his fealty to the law once he had been freed from the constraints put on him by Obama and Loretta Lynch. When Comey continued protecting known criminal behavior to save the swamp he left Donald Trump no choice but to fire him.\n\nAmerica deserves an F.B.I. director who is determined to prosecute criminal behavior no matter where he finds it.", "images": ["https://web.archive.org/web/20170524182427im_/http://patriotcrier.com/wp-content/uploads/2017/05/seth-rich-2.jpg"], "top_img": "https://web.archive.org/web/20170524182427im_/http://patriotcrier.com/wp-content/uploads/2017/05/seth-rich-2.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20170524182427/http://patriotcrier.com/1-6kk-0/", "title": "BOMBSHELL: COMEY KNEW MURDERED DNC STAFFER, SETH RICH, WAS WIKILEAKS SOURCE & COVERED IT UP FOR HILLARY", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "og": {"locale": "en_US", "type": "article", "title": "BOMBSHELL: COMEY KNEW MURDERED DNC STAFFER, SETH RICH, WAS WIKILEAKS SOURCE & COVERED IT UP FOR HILLARY", "description": "ELDER PATRIOT – New evidence has been uncovered by a private investigator that proves Jim Comey was a dirty cop who had to go. After former DNC staffer Seth Rich was murdered his family asked", "url": "https://web.archive.org/web/20170524182427/http://patriotcrier.com/1-6kk-0/", "site_name": "Patriot Crier", "updated_time": "2017-05-16T12:13:35-06:00", "image": {"identifier": "https://web.archive.org/web/20170524182427im_/http://patriotcrier.com/wp-content/uploads/2017/05/seth-rich-2.jpg", "width": 640, "height": 375}}, "article": {"author": "facebook.com/president45donaldtrump", "section": "Featured", "published_time": "2017-05-16T11:21:57-06:00", "modified_time": "2017-05-16T12:13:35-06:00"}, "fb": {"app_id": 2008505042708638}, "twitter": {"card": "summary", "description": "ELDER PATRIOT – New evidence has been uncovered by a private investigator that proves Jim Comey was a dirty cop who had to go. After former DNC staffer Seth Rich was murdered his family asked", "title": "BOMBSHELL: COMEY KNEW MURDERED DNC STAFFER, SETH RICH, WAS WIKILEAKS SOURCE & COVERED IT UP FOR HILLARY", "image": "https://web.archive.org/web/20170524182427im_/http://patriotcrier.com/wp-content/uploads/2017/05/seth-rich-2.jpg"}, "generator": "WordPress 4.7.5"}, "movies": [], "publish_date": 1494955317.0, "source": "https://web.archive.org", "summary": ""}