{"url": "www.cinemablend.com/news/2390371/no-angelina-jolie-did-not-see-the-tomb-raider-reboot", "text": "Although she is a household name now and the perpetual focus of celebrity coverage, there was a time when Angelina Jolie's star was much dimmer. The Oscar-winning actress really became a big name thanks to her starring role in the video game adaptation, Lara Croft: Tomb Raider. The actress starred as Lara Croft in two films that still stand as some of the few decent video game movies. Many people still identify Angelina Jolie with the role, so you might think that she would want to check out the reboot starring Alicia Vikander, which debuted in theaters last weekend. Well, despite earlier reports to the contrary, it seems that Angelina Jolie did not take her kids to see Tomb Raider, as they saw Love, Simon instead.\n\nThe Daily Mail reports that Angelina Jolie was seen in Hollywood taking five of her kids to see the romantic drama and not the video game reboot. Early reports had her checking out her successor, but she actually opted for something a little smaller. If the reviews are any indication, she probably made the right choice between the two. Love, Simon currently rests at a healthy 92% on Rotten Tomatoes, a whopping 41% higher than the 51%-ranked Tomb Raider. Yet Tomb Raider's mediocre score is still enough to best every other video game movie, including Angelina Jolie's Tomb Raider outings.\n\nIt is also worth noting that just because Angelina Jolie didn't see Tomb Raider this time doesn't mean that she hasn't seen it or won't see it. It is entirely possible that she may have thought violent parts of the gritty reboot were too mature for her young children. Hopefully she will see it eventually; her time as the character brought an incredible amount of awareness to the character that probably helped this reboot to seem like a viable option.\n\nTomb Raider probably could have used Angelina Jolie and her family's attendance, though. The film came in second place in its opening weekend to Black Panther (no shame in that), making $23.6 million domestically. However, the film is doing much better overseas. Despite not fairing well critically, things are still moving in the right direction, albeit slowly. We'd like to see Alicia Vikander make a Tomb Raider 2 and get a second crack at the character just like Angelina Jolie did. With any luck, the sequel could actual be a good movie, not just decent for a video game movie. Plus a sequel would provide the opportunity for an Angelina Jolie cameo, paying homage to the woman who first brought this iconic video game character to life.\n\nTomb Raider is in theaters now. Let us know what you thought of the film and for all the latest movie news, stay tuned to CinemaBlend.", "images": ["http://www.cinemablend.com/media/img/missing-image.svg", "https://cdn.mos.cms.futurecdn.net/WCUD9pRpuWPonFF24XozrB-1200-80.jpg", "https://cdn.mos.cms.futurecdn.net/WCUD9pRpuWPonFF24XozrB-320-80.jpg"], "top_img": "https://cdn.mos.cms.futurecdn.net/WCUD9pRpuWPonFF24XozrB-1200-80.jpg", "keywords": [], "authors": ["Nick Evans", "Window.Slicecomponents", "Window.Reliabledomcontentloaded.Then", "Var Componentcontainer", "Document.Queryselector", "Slice-Container-Authorbio", "If Componentcontainer", "Var Data", "Layout", "Default"], "canonical_link": "https://www.cinemablend.com/news/2390371/no-angelina-jolie-did-not-see-the-tomb-raider-reboot", "title": "No, Angelina Jolie Did Not See The Tomb Raider Reboot", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "pub_date": "2018-03-20T21:21:01+00:00", "description": "The Lara Croft character would not have the cultural relevance it does without Angelina Jolie, but that doesn't mean the actress is going to see the new movie.", "robots": "max-image-preview:large", "msapplication-TileColor": "#000000", "msapplication-TileImage": "https://cdn.mos.cms.futurecdn.net/flexiimages/tbhqzd9bso1619422461.png", "og": {"site_name": "CINEMABLEND", "image": {"identifier": "https://cdn.mos.cms.futurecdn.net/WCUD9pRpuWPonFF24XozrB-1200-80.jpg", "width": 1200}, "type": "article", "title": "No, Angelina Jolie Did Not See The Tomb Raider Reboot", "url": "https://www.cinemablend.com/news/2390371/no-angelina-jolie-did-not-see-the-tomb-raider-reboot"}, "article": {"publisher": "https://www.facebook.com/cinemablendnews/", "published_time": "2018-03-20T21:21:01Z", "modified_time": "2018-03-20T21:21:01Z"}, "parsely-type": "post", "parsely-post-id": "7wP8Chaq6SpVW1N9u4dkr9", "parsely-pub-date": "2018-03-20T21:21:01Z", "parsely-title": "No, Angelina Jolie Did Not See The Tomb Raider Reboot", "parsely-link": "https://www.cinemablend.com/news/2390371/no-angelina-jolie-did-not-see-the-tomb-raider-reboot", "parsely-image-url": "https://cdn.mos.cms.futurecdn.net/WCUD9pRpuWPonFF24XozrB.jpg", "parsely-section": "Movies", "parsely-tags": "Category: Movies,Category: News,angelina jolie,Tomb Raider,serversidehawk", "parsely-author": "Nick Evans", "twitter": {"card": "summary_large_image", "site": "@cinemablend", "title": "No, Angelina Jolie Did Not See The Tomb Raider Reboot", "creator": "@cinemablend", "image": "https://cdn.mos.cms.futurecdn.net/WCUD9pRpuWPonFF24XozrB-1200-80.jpg", "account_id": 9696142}, "google-site-verification": "Oo3uNFWgI6psN58Pjx7Zjo3yYih1rOwQViWbItBCpyo", "taboola": {"url": "https://www.cinemablend.com/news/2390371/no-angelina-jolie-did-not-see-the-tomb-raider-reboot"}, "botify-site-verification": "2pzcQZFibLjk9GJgSZgweA8MU9al6utA", "msvalidate.01": "CC462E6DF91492086145CA5EBDCB615E"}, "movies": [], "publish_date": 1521580861.0, "source": "http://www.cinemablend.com", "summary": ""}