{"url": "https://en.wikipedia.org/wiki/Young_Sheldon", "text": "American television sitcom\n\nYoung Sheldon is an American coming-of-age sitcom television series created by Chuck Lorre and Steven Molaro for CBS. The series, set in the late 1980s and early 1990s, is a spin-off prequel to The Big Bang Theory and begins with the character Sheldon Cooper at the age of nine, living with his family in East Texas and going to high school. Iain Armitage stars as young Sheldon, alongside Zoe Perry, Lance Barber, Montana Jordan, Raegan Revord, and Annie Potts. Jim Parsons, who portrays the adult Sheldon Cooper on The Big Bang Theory, narrates the series and is also an executive producer.\n\nDevelopment of the prequel series began in November 2016, from an initial idea that Parsons passed along to The Big Bang Theory producers. The following March, Armitage and Perry were cast, and the series was ordered by CBS. Young Sheldon premiered as a special preview on September 25, 2017, and was picked up for a full season that began airing weekly from November 2, 2017. In March 2021, CBS renewed the series through to a seventh season. The sixth season premiered on September 29, 2022.\n\nPremise [ edit ]\n\nThe series takes place in the late 1980s and early 1990s and follows Sheldon Cooper attending high school in the fictional town of Medford, Texas. As a nine-year-old boy (in the first season[1]) attending high school, he tries to fit into a world full of more socially normal people, including his own family and friends, who do not quite understand how to deal with his unique intellectual capabilities and social ineptitude.[1] At age 11, Sheldon graduates high school and begins attending the fictional university East Texas Tech full time.\n\nIn the series premiere, adult Sheldon states \"nobody I knew in East Texas in 1989 cared about Newtonian physics\".[3][a] Several other episodes make spoken or written references to, or reference historic or pop cultural events from 1990 and 1991.[4][5][b] Episode eighteen from season five, where it is stated that Isaac Asimov has passed away, takes place in 1992.\n\nCast and characters [ edit ]\n\nMain [ edit ]\n\nIain Armitage as Sheldon Cooper, a child prodigy well-versed in various branches of mathematics and science. He states that he decided to pursue physics around the same time as the show began. While academically gifted, Sheldon sometimes lacks a full understanding of social cues, in addition to having a sense of superiority over everyone around him. Nevertheless, Sheldon has proven to love his family and almost always has his heart in the right place. [6] He is Georgie's younger brother and Missy’s fraternal older twin brother. He is age 9 in the first season and age 12 by the fifth. Jim Parsons is the voice of adult Sheldon Cooper, who provides the perspective of an adult recalling his childhood. [1]\n\nHe is Georgie's younger brother and Missy’s fraternal older twin brother. He is age 9 in the first season and age 12 by the fifth. Zoe Perry as Mary Cooper (née Tucker), mother of Sheldon, Missy, and Georgie. She is very protective and patient with Sheldon, but also struggles to understand him at times. She is a devout Southern Baptist, working at her local church, and sometimes objects to Sheldon's atheism. Nevertheless, she deeply loves her son and wants to protect him for as long as she can. [6] Perry's mother, Laurie Metcalf, played Mary on The Big Bang Theory .\n\nPerry's mother, Laurie Metcalf, played Mary on . Lance Barber as George Cooper Sr. , Sheldon, Missy, and Georgie's father; a Vietnam veteran; and the former head football coach at Medford High. George does not share Sheldon's intellect which sometimes leads others, especially Meemaw, to doubt his genetic relationship to Sheldon. He is often at odds with his children and particularly struggles to understand Sheldon, but he does try to be a caring and responsible father. In The Big Bang Theory , it is stated that George Cooper Sr. will pass away when Sheldon is 14 years old in 1995. Barber appeared in a fifth season episode of The Big Bang Theory as one of Leonard's high school bullies, Jimmy Speckerman, before making an appearance via a '90s videotape as his Young Sheldon character in a final season episode.\n\n, Sheldon, Missy, and Georgie's father; a Vietnam veteran; and the former head football coach at Medford High. George does not share Sheldon's intellect which sometimes leads others, especially Meemaw, to doubt his genetic relationship to Sheldon. He is often at odds with his children and particularly struggles to understand Sheldon, but he does try to be a caring and responsible father. In , it is stated that George Cooper Sr. will pass away when Sheldon is 14 years old in 1995. Barber appeared in a fifth season episode of as one of Leonard's high school bullies, Jimmy Speckerman, before making an appearance via a '90s videotape as his character in a final season episode. Montana Jordan as George \"Georgie\" Cooper Jr. , Sheldon and Missy's older brother. Georgie resents the attention his parents pay to Sheldon. He does not do well at school and gets mocked and teased for it by the rest of the family, particularly Sheldon and Meemaw. He does not get along with his brother Sheldon because he's tired of always being compared to his brother. He attends Medford High with Sheldon and plays on the school's football team. [1] At age 17, he drops out of school to work full-time and discovers a talent for sales that will lead him to become the wealthy owner of a tire store chain in The Big Bang Theory , on which he is played by Jerry O'Connell.\n\n, Sheldon and Missy's older brother. Georgie resents the attention his parents pay to Sheldon. He does not do well at school and gets mocked and teased for it by the rest of the family, particularly Sheldon and Meemaw. He does not get along with his brother Sheldon because he's tired of always being compared to his brother. He attends Medford High with Sheldon and plays on the school's football team. At age 17, he drops out of school to work full-time and discovers a talent for sales that will lead him to become the wealthy owner of a tire store chain in , on which he is played by Jerry O'Connell. Raegan Revord as Melissa \"Missy\" Cooper, Georgie's younger sister and Sheldon's fraternal younger twin sister. She teases Sheldon along with Georgie but not as much. She does not share Sheldon's intelligence, but is very perceptive. Occasionally, she does not get along with Sheldon, but she finds in her twin brother a solid confidant and has admitted to not feeling as whole without him. She also shows love for her brother even though she constantly denies it. [1] Courtney Henggeler plays adult Missy in The Big Bang Theory .\n\nCourtney Henggeler plays adult Missy in . Annie Potts as Constance \"Connie\" Tucker, Sheldon, Missy, and Georgie's maternal grandmother, whom they refer to as \"Meemaw\". She is a fun-loving woman who can be sarcastic, and often mocks those around her, especially George. On the other hand, she is patient with Sheldon and sometimes struggles to understand him, whom she affectionately calls 'Moonpie', and advises Mary to trust that Sheldon will find his way. [7] In the fourth season, she was said to be 68 years old. June Squibb plays old Constance in The Big Bang Theory .\n\nIn the fourth season, she was said to be 68 years old. June Squibb plays old Constance in . Emily Osment as Mandy McAllister (season 6;[8] recurring season 5), Georgie's 29-year-old girlfriend, whom he gets pregnant\n\nRecurring [ edit ]\n\nGuest [ edit ]\n\nOriginal cast cameos\n\n\n\nMayim Bialik as Amy Farrah Fowler, Sheldon's wife and the mother of his son, Leonard Cooper, as well as at least one other child. This role is reprised from The Big Bang Theory . She appears as part of the narration.\n\n. She appears as part of the narration. Kaley Cuoco as the voice of the pool water in one of Sheldon's nightmares. Cuoco previously played Penny in The Big Bang Theory . [11]\n\n. Simon Helberg as Howard Wolowitz, an aeronautical engineer and one of Sheldon’s adulthood friends. This role is reprised from The Big Bang Theory . He appears as part of the narration.\n\n. He appears as part of the narration. Bob Newhart as Arthur Jeffries, a scientist who plays the title character of Professor Proton, Sheldon's favorite educational television series. The character is an homage to Mr. Wizard.[12] Newhart reprises his portrayal of the character from The Big Bang Theory.\n\nEpisodes [ edit ]\n\nSeason Episodes Originally aired Rank Avg. viewers\n\n(millions) First aired Last aired 1 22 September 25, 2017 ( ) May 10, 2018 ( 2018-05-10 ) 6 16.30[13] 2 22 September 24, 2018 ( ) May 16, 2019 ( 2019-05-16 ) 5 14.37[14] 3 21 September 26, 2019 ( ) April 30, 2020 ( 2020-04-30 ) 8 11.45[15] 4 18 November 5, 2020 ( ) May 13, 2021 ( 2021-05-13 ) 12 9.45[16] 5 22 October 7, 2021 ( ) May 19, 2022 ( 2022-05-19 ) 8 9.21[17] 6 TBA September 29, 2022 ( ) TBA TBA TBA\n\nProduction [ edit ]\n\nDevelopment [ edit ]\n\nIn November 2016, it was reported that CBS was in negotiations to create a spin-off of The Big Bang Theory centered on Sheldon Cooper as a young boy. The prequel series, described as \"a Malcolm in the Middle-esque single-camera family comedy\" would be executive produced by The Big Bang Theory co-creator Chuck Lorre and producer Steven Molaro, with The Big Bang Theory co-creator Bill Prady expected to be involved in some capacity, and intended to air in the 2017–18 season alongside The Big Bang Theory.[18][19] The initial idea for the series came from Jim Parsons (who portrays the older Sheldon on The Big Bang Theory), who passed it along to The Big Bang Theory producers.[6] On March 13, 2017, CBS ordered the spin-off Young Sheldon series, which was created by Lorre and Molaro. Jon Favreau directed and executive produced the pilot. Parsons, Lorre, Molaro and Todd Spiewak also serve as executive producers on the series, for Chuck Lorre Productions and Warner Bros. Television.[1] On September 27, 2017, CBS picked up the series for a full season of 22 episodes.[20] On January 6, 2018, the show was renewed for a second season, which premiered on September 24 of that same year.[21][22]\n\nOn February 22, 2019, CBS renewed the series for both a third and a fourth season.[23] The third season premiered on September 26, 2019.[24] Warner Bros. Television suspended production on March 13, 2020, due to the COVID-19 pandemic, leaving the third season with only 21 episodes.[25] Production for the fourth season began on September 22, 2020, but was paused on October 9, 2020, for one month, due to a positive COVID-19 test.[26] The fourth season premiered on November 5, 2020.[27]\n\nProduction for the fourth season concluded on March 15, 2021.[28]\n\nOn March 30, 2021, CBS renewed the series for a fifth, sixth, and seventh season.[29] The fifth season premiered on October 7, 2021.[30] The sixth season premiered on September 29, 2022.[31]\n\nCasting [ edit ]\n\nIn early March 2017, Iain Armitage was cast as the younger Sheldon, as well as Zoe Perry as his mother, Mary Cooper. Perry is the real-life daughter of Laurie Metcalf, who portrays Mary Cooper on The Big Bang Theory.[6] Lance Barber stars as George Cooper Sr., Sheldon's father; he had previously appeared in one episode of The Big Bang Theory.[32] Raegan Revord stars as Missy Cooper, Sheldon's twin sister; Revord got the part only after repeatedly asking her mother to be allowed to read for the role.[33] The show also stars Montana Jordan as George Cooper Jr., Sheldon's older brother. Jim Parsons reprises his role as adult Sheldon Cooper, as narrator for the series. In July 2017, Annie Potts was cast as Meemaw, Sheldon's grandmother.[7]\n\nOverlap with the parent series [ edit ]\n\nIn most cases different actors are used to portray a given character in the two series, to account for the age difference. Jim Parsons is a notable exception in that he appears in both series as the same character, though in this series his appearance is limited to voice only. In the Season 4 episode \"Graduation\", Mayim Bialik (as Amy, the wife of adult Sheldon) has a brief voice-over role while Sheldon describes the graduation party for their son Leonard, whom he reveals was named after Leonard Hofstadter and Leonard Nimoy. Bob Newhart appears as Professor Proton in both series; with the appearance in this series, the character is made to look younger. Iain Armitage (Sheldon), Lance Barber (George), and Montana Jordan (Georgie) make a guest appearance in the parent series in a scene in which a VHS tape recorded decades earlier is played.[34] There are other actors who appear in both series but as different characters. This includes Barber, who had another guest appearance in the parent series as a different character, and Kaley Cuoco who stars in the parent series and makes an uncredited voice appearance in this series, voicing an inanimate object.[35][11] Elon Musk makes cameo appearances as himself in both series.[36][37]\n\nThe second-season finale episode aired immediately following the one-hour series finale of the parent series. In a tribute to the parent series finale, several references are made to it in the Young Sheldon episode. The references are both general to the entire parent series, as well as to the series finale in particular. In one scene in the Young Sheldon episode, Sheldon promises his father that when he wins the Nobel Prize, Sheldon will mention him in his acceptance speech. In the parent series finale, Sheldon wins the Nobel Prize, and he does mention his father (amongst others) in the acceptance speech. In another scene in the Young Sheldon episode, Nobel Prize winners are announced out over a montage showing the main characters from the parent series Leonard, Penny, Raj, Howard, Bernadette, and Amy as children. Christine Baranski and Carol Ann Susi, who respectively portray Leonard's mother and Howard's mother in the parent series, make a voice appearance in the montage (a posthumous appearance in the case of Susi). Following the montage, adult Sheldon says that he was wrong about feeling at the moment of the Nobel prize announcement that he would be all alone for the rest of his life.[38]\n\nTitle sequence [ edit ]\n\nThe show's title sequence is played to the song \"Mighty Little Man\" by Steve Burns. The song is the first track in Burns' 2003 album Songs for Dustmites.[39] The background in the first two series shows mountains and a desert, whilst the foreground has Sheldon (usually in bow tie, checked shirt, shorts and cowboy boots) walking out, standing triumphantly, before he notices a cow and backs away from it, before resuming his triumphant look as the logo appears and pans to the sky. Occasionally, a tumbleweed appears, instead of the cow. The title sequence was changed from Season 3 onwards to include the entire Cooper family, as well as showing Sheldon in different costumes, such as Albert Einstein, Mr. Spock, The Flash, an astronaut, and a train engineer.[40] Season 5 features a black bull in place of the cow.\n\nRelease [ edit ]\n\nBroadcast [ edit ]\n\nYoung Sheldon began airing weekly episodes on CBS from November 2, 2017, after The Big Bang Theory. It premiered as a special preview on September 25, 2017.\n\nSyndication [ edit ]\n\nYoung Sheldon entered off-network syndication on Nick at Nite as of November 30, 2020.[41][42]\n\nIn the United Kingdom, Young Sheldon is aired on the free-to-air channel E4, with season 1 premiered on February 22, 2018.[43] Subsequent seasons premiered on November 8, 2018, and October 10, 2019, for seasons 2 and 3 respectively.[43] Season 4 of Young Sheldon premiered on October 20, 2021, on E4 at 9 pm [44] Season 5 of Young Sheldon premiered on April 24, 2022 at 8pm on E4.[45] On September 27, 2021, the series entered syndication in local markets, covering roughly 90% of the United States.[46] The series also entered off-network syndication on TBS and began airing on September 27, 2021.[47]\n\nStreaming [ edit ]\n\nIn May 2020, it was announced that the first three seasons of the series would stream on the WarnerMedia-owned HBO Max service; no release date was announced at that time.[48] The first three seasons were added on September 2, 2020.[49] The fifth season debuted on September 7, 2022.\n\nIn October and November 2021, Netflix in Australia and the United Kingdom picked up the streaming rights to the show.[50]\n\nReception [ edit ]\n\nRatings [ edit ]\n\nViewership and ratings per season of Young Sheldon Season Timeslot (ET) Episodes First aired Last aired TV season Viewership\n\nrank Avg. viewers\n\n(millions) 18–49\n\nrank Avg. 18–49\n\nrating Date Viewers\n\n(millions) Date Viewers\n\n(millions) 1 Thursday 8:30 p.m.[c] 22 September 25, 2017 ( ) 17.21[51] May 10, 2018 ( 2018-05-10 ) 12.44[52] 2017–18 6 16.30 10 3.3[13] 2 22 September 24, 2018 ( ) 10.58[53] May 16, 2019 ( 2019-05-16 ) 13.60[54] 2018–19 5 14.37 11 2.6[14] 3 Thursday 8:00 p.m.[d][56] 21 September 26, 2019 ( ) 8.24[57] April 30, 2020 ( 2020-04-30 ) 10.14[58] 2019–20 8 11.45 20 1.6[15] 4 18 November 5, 2020 ( ) 6.77[59] May 13, 2021 ( 2021-05-13 ) 7.21[60] 2020–21 12 9.45 22 1.2[16] 5 22 October 7, 2021 ( ) 7.12[61] May 19, 2022 ( 2022-05-19 ) 7.06[62] 2021–22 8 9.21 16 1.0[17] 6 TBA September 29, 2022 ( ) 6.88[63] TBA TBD 2022–23 TBD TBD TBD TBD\n\nCritical reception [ edit ]\n\nFor the first season, the review aggregator website Rotten Tomatoes reported a 76% approval rating with an average rating of 6.6/10 based on 46 reviews. The website's consensus reads, \"Young Sheldon's appealing cast and relatable themes bring a fresh—and overall enjoyable—perspective to its central character's familiar story.\"[64] Metacritic, which uses a weighted average, assigned a score of 63 out of 100 based on 25 critics, indicating \"generally favorable reviews\".[65]\n\nAwards and nominations [ edit ]\n\nHome media [ edit ]\n\nThe first season of Young Sheldon was released on DVD and Blu-ray by Warner Bros. on September 4, 2018.[72][73] The second season was released on DVD and manufacture-on-demand Blu-ray on September 3, 2019.[74] The third season was released on DVD and manufacture-on-demand Blu-ray on September 1, 2020 by Warner Bros. Home Entertainment and Warner Archive Collection respectively.[75] The fourth season was released on DVD and Blu-ray on September 7, 2021.[76] The fifth season was released on DVD and Blu-ray on September 6, 2022.[77]\n\nSee also [ edit ]\n\nNotes [ edit ]\n\n^ Dr. Sturgis and Dr. Linkletter, two college physics professors who teach the classes in which Sheldon enrolls, are not introduced until Season 1 Episode 19 and Season 2 Episode 13 respectively. ^ In the clip, ALF is reading a fan letter from Missy, so the footage is not from the original show. ^ Both seasons premiered on a Monday, with all the other episodes in the respective seasons broadcasting at the designated time slot. ^ [55] The eleventh episode of the fourth season aired at 8:30 p.m. due to President Biden's address on the one-year anniversary of the Covid-19 shutdown which aired on 8:00 p.m. on March 11, 2021.", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Ambox_current_red_Asia_Australia.svg/42px-Ambox_current_red_Asia_Australia.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/6/68/Young_Sheldon_title_card.png/250px-Young_Sheldon_title_card.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/6/68/Young_Sheldon_title_card.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/6/68/Young_Sheldon_title_card.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Young_Sheldon", "title": "Young Sheldon", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/6/68/Young_Sheldon_title_card.png", "width": 640, "height": 358}, "title": "Young Sheldon - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}