{"url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/10/01/kendall-jenner-cries-over-pepsi-ad-backlash-in-keeping-up-with-the-kardashians-premiere/", "text": "Gift Article Share\n\nRemember Pepsi’s tone-deaf Kendall Jenner commercial back in April? The one that made people furious, because it appropriated images from Black Lives Matter protests to sell soda? Pepsi quickly pulled the ad after intense criticism — and in the six months since the controversy, Kendall hasn’t publicly responded. That’s because she saved it all for the 14th season premiere of E!’s “Keeping Up With the Kardashians,” which aired Sunday night. The Kardashian family has said that Kendall was very upset over the backlash, and the premiere confirmed that, yes, the 21-year-old supermodel was mortified.\n\nIf only Daddy would have known about the power of #Pepsi. pic.twitter.com/FA6JPrY72V — Be A King (@BerniceKing) April 5, 2017\n\nAlthough the episode ended with Kendall sobbing (“Obviously, if I knew that this was going to be the outcome, I would have never done something like this”), it was a slow build to her breakdown. In fact, the word “Pepsi” never came up during the entire hour. It all started as Kendall called her sisters Kourtney and Khloe Kardashian.\n\nAdvertisement\n\n“Are you okay?” Kourtney said when she answered the phone. “You sound so sad.”\n\n“I’m all right,” Kendall sighed.\n\n“I talked to Simon today,” Kourtney said, likely referring to Simon Huck, a public relations guru and Kim Kardashian West’s close friend. “He was like, ‘The news lasts 24 hours.’ ”\n\n“It’s lasting longer,” Kendall said flatly.\n\nCut to an on-camera interview with Khloe, who explained to the audience: “Kendall did a commercial and basically caused a huge controversy. It sucks, because Kendall’s been taking the blame for it all. Kendall tries really hard to be socially conscious and aware of the jobs that she takes and to really think about how things affect other people, so it weighs really heavy on her heart.”\n\nProducers showed some critical tweets about the commercial, such as, “So many adults had to f‑‑‑ up in so many unique and equally tone deaf ways to make this awful ad, it’s honestly breathtaking.”\n\nAdvertisement\n\nKourtney assured Kendall that she spoke to family friend Russell Simmons, who said that Kendall “can turn this into a positive.” This is never further explained. After they hung up, Kourtney told Khloe that it sounded like Kendall was crying.\n\nLater, Kendall explained why she filmed the commercial in the first place — when she got the offer, she was thrilled to join the list of celebrities who have done Pepsi ads, from Michael Jackson to Beyoncé to Britney Spears.\n\n“I trusted everyone. I trusted the teams,” she told the camera. “But after I saw the reaction and I read what people had to say about it, I most definitely saw what went wrong. I was so stuck, and I really didn’t know what to do, that I completely shut down.”\n\nThe following scene showed Kendall sitting forlornly in her gigantic walk-in closet, talking to Kim on the phone. The new issue? Her father, Caitlyn Jenner, was going on a book tour. Kendall was worried that Caitlyn might say something about the commercial that would make things worse.\n\nAdvertisement\n\n“She just tends to, like, say a lot, and I just would rather everyone just not say anything,” Kendall said. “I mean, God bless her for trying.”\n\n“I know. But Caitlyn is known for saying all the wrong things,” Kim said. She promised to call Caitlyn and let her know it was a very sensitive subject.\n\nSo Kim called Caitlyn and told her not to answer questions about the Pepsi ad — and if she felt compelled, just say something along the lines of, “Kendall had the best intentions with this being something, like, peaceful, and she totally gets everyone’s point of view now. It was not appropriate, and she’s so sorry.”\n\nNaturally, Caitlyn did not follow that advice, and instead talked about the commercial in a radio interview and said Kendall knew all about the ad’s script beforehand and thought it was fine. The episode ended as Kendall went to talk to Kim, about three weeks after the commercial was pulled. She was upset about Caitlyn, and even more about the whole situation.\n\nAdvertisement\n\n“I just feel really, really bad. Like, I feel really bad that anyone was ever offended. I feel really bad that this was taken such a wrong way,” Kendall said. “I genuinely feel like s‑‑‑, and I have no idea how I’m going to bounce back from it.”\n\n“This is the first time you’ve had a scandal,” Kim gently reminded her. “This is your first real experience with something like this.”\n\n“Yeah, but it’s a very bad one,” Kendall shot back.\n\n“A very bad one,” Kim agreed.\n\n“The text messages I would get from people, they’d be like, ‘It’s going to be fine, like, you know everything blows over in, like, a week’s time’ or whatever. And I’m just like, ‘Okay, but it’s been, like, three weeks and it’s not going anywhere,’ ” Kendall said.\n\n“Yeah, but it will,” Kim assured her. “This is just going to be the biggest lesson learned for you.”\n\nAdvertisement\n\n“I really don’t even know what to do at this point. It’s really depressing, and it bothers me every single day,” Kendall said.\n\n“You’re the last person to want to hurt someone or be insensitive, but it’s, like, it really sucks. I think the only thing you can really do is just be real and honest, because you can’t ignore it. Like, you can’t,” Kim said. “It should affect you in a way where you grow from it, and you’re like, “Okay, I’m a better person from it.’ . . . I just wish that you could see that there’s light at the end of the tunnel.”\n\nDespite Kim’s words of wisdom, Kendall still broke down crying to the camera.\n\n“I would never purposely hurt someone, ever,” Kendall said tearfully. “You don’t know when you’re in the moment, and, like, it was the most —” She grappled for the right words. “I just felt so f‑‑‑ing stupid. The fact that I would offend other people or hurt other people was definitely not the intent. And that’s what got me the most, is that I would have ever made anyone else upset.”\n\nAdvertisement\n\nAfter Pepsi pulled the ad, the company apologized for putting Kendall Jenner in an awkward position. Last week, Pepsi chief executive Indra Nooyi told Fortune that she didn’t initially see the ad’s final scene that caused so much “consternation,” in which Jenner handed a cop a can of Pepsi.\n\n“This has pained me a lot because this company is known for diversity, and the fact that everybody who produced the commercial and approved the commercial did not link it to Black Lives Matter made me scratch my head. I had not seen that scene,” Nooyi said. “And I take everything personally. The minute I saw people upset, I pulled it. And you know what, it’s not worth it. There were people on both sides, but at the end of the day, our goal is not to offend anybody.”\n\nRead more:\n\nGiftOutline Gift Article", "images": ["https://www.washingtonpost.com/wp-apps/imrs.php?src=http://www.washingtonpost.com/blogs/style-blog/files/2017/10/Untitled.jpg&w=1440"], "top_img": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://www.washingtonpost.com/blogs/style-blog/files/2017/10/Untitled.jpg&w=1440", "keywords": [], "authors": ["Emily Yahr"], "canonical_link": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/10/01/kendall-jenner-cries-over-pepsi-ad-backlash-in-keeping-up-with-the-kardashians-premiere/", "title": "Kendall Jenner cries over Pepsi ad backlash in ‘Keeping Up With the Kardashians’ premiere", "meta_data": {"description": "Six months later, the model responds to the controversy: “The fact that I would offend other people or hurt other people was definitely not the intent.\"", "og": {"site_name": "Washington Post", "type": "article", "url": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/10/01/kendall-jenner-cries-over-pepsi-ad-backlash-in-keeping-up-with-the-kardashians-premiere/", "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=http://www.washingtonpost.com/blogs/style-blog/files/2017/10/Untitled.jpg&w=1440", "title": "Kendall Jenner cries over Pepsi ad backlash in ‘Keeping Up With the Kardashians’ premiere", "description": "Six months later, the model responds to the controversy: “The fact that I would offend other people or hurt other people was definitely not the intent.\""}, "twitter": {"site": "@WashingtonPost", "card": "summary_large_image", "title": "Kendall Jenner cries over Pepsi ad backlash in ‘Keeping Up With the Kardashians’ premiere", "description": "Six months later, the model responds to the controversy: “The fact that I would offend other people or hurt other people was definitely not the intent.\""}, "last_updated_date": "2021-12-03T06:05:32.208Z", "article": {"published_time": "2017-10-02T03:30:16.000Z", "modified_time": "2021-12-03T06:05:32.208Z", "section": "Arts & Entertainment", "content_tier": "metered"}, "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1", "next-head-count": 70, "apple-itunes-app": "app-id=352509417, app-argument=https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/10/01/kendall-jenner-cries-over-pepsi-ad-backlash-in-keeping-up-with-the-kardashians-premiere/"}, "movies": [], "publish_date": 1506812400.0, "source": "https://www.washingtonpost.com", "summary": ""}