{"url": "jis.gov.jm/president-trump-underscores-us-jamaica-relations/", "text": "INTRODUCTION\n\nInitial Officer Training Programme (IOTP) provides basic military officer training to Officer Cadets (OCdts) and their equivalents from law enforcement and uniformed services. The programme falls within the tactical level of the Professional Military Education (PME) framework of armed forces and is modelled from the Royal Military Academy Sandhursts’ (RMAS) Commissioning Course. It was designed with the direct support and guidance of RMAS Instructing and Support Staff.\n\nRationale\n\nTraditionally, the Jamaica Defence Force’s (JDF) longstanding partnerships with militaries across the world has seen its OCdts being trained in academies in the following countries: United States, England, Canada, China and India. Upon the return of OCdts to the JDF, there is a requirement for doctrine and operating procedure standardization due to the varying concepts and differing contents of the training they had undergone. This is normally done at the Unit level and later, through a Young Officers’ Course. The advent of COVID-19 added a new level of complexity to travel, thus negatively affecting the process of sending OCdts overseas. Additionally, the ongoing expansion and restructuring of the Force to cauterize the ballooning threats to national security has caused an increased demand for newly commissioned Second Lieutenants.\n\nDue to the carefully adapted military and academic curricula, IOTP serves as the course to treat with the aforementioned considerations. The methodology used addresses each issue directly and the course, through the delivery of a bespoke training syllabus, is fit for the JDF and is also relevant to the militaries and organizations within the Caribbean region and in other parts of the world.\n\nConcept\n\nHaving the RMAS approach to training at its core, IOTP is designed with a syllabus that sees male and female integration throughout training. The course focusses on developing military skills and command with a leadership ‘golden thread’. The course structure allows the Instructing Staff to educate, build, develop and scrutinize an OCdt’s ability to decide and communicate accurately and ethically while under pressure and or stress. The expectation is that on commissioning, an OCdt will be fully cognizant of the responsibilities and personal conditions that being an Officer imposes upon them. The product of the IOTP will be an ethical and robust Officer who has the knowledge, skills, attitudes and intellectual agility to adapt their decision-making process and approach to any environment.\n\nLocation\n\nThe home of IOTP is the Caribbean Military Academy (CMA) Newcastle, which is located at the Newcastle Hill Station, St Andrew, Jamaica.\n\nNestled in the cool hills of upper St Andrew and amidst beautiful trees, ferns, ground orchids, delicate wild flowers and a profusion of ginger lilies, is the Newcastle\n\nTraining Depot founded in 1841 by Major General Sir William Maynard Gomm (later Field Marshall). Gomm, a veteran of the wars against revolutionary France and Lieutenant Governor of Jamaica from 1840 to 1841, relentlessly badgered the War Office in London to establish a mountain station for British soldiers in Jamaica soon after taking up his post.\n\nThe idea of the hill station was first raised by Gomm in a letter dated April 7, 1840 to Governor Sir Charles Metcalfe. Gomm pointed out that while Up Park Camp was an ideal location for a barracks, it was subject to the ravages of yellow fever. In Jamaica the\n\nBritish garrison was stationed on the plain at Up Park Camp, Stony Hill, Fort Augusta and Port Royal. Here, on the average, 1 soldier died every 2½ days. According to Russell, the year 1838 was considered a ‘good’ year: only 91 men died. In 1839, 110 men perished and in the following year 121. Initially, the British government was conservative in approving a hill station for the troops in Jamaica. They were concerned about the expense of the venture.\n\nIn May 1841, London finally sanctioned Gomm’s efforts to build what is thought to be the first permanent mountain station in the British West Indies at Newcastle. The site selected was a coffee plantation protruding from the southern face of the grand ridge of the Blue Mountains. The British government paid £4,230 for the Newcastle site.\n\nAt the outbreak of World War II (1939-1945), life at Newcastle changed a little. The British regiment was replaced by Canadian regiments which remained at Newcastle for the duration of the war. With hostilities over in 1945, the Canadians left and once again a British battalion was stationed there.\n\nIn 1958, the West Indies Federation was founded and the infantry regiments of the various Caribbean islands were disbanded and reorganized into the West India Regiment. Newcastle became a training depot, training recruits from all over the West Indies as part of the\n\nnewly formed West Indies Federation. In 1962 when Federation was disbanded, the West India Regiment was also disbanded. Jamaica simultaneously sought her independence, which was achieved on August 6, 1962. With independence, Newcastle was given to the Jamaican government as part of a general settlement of all military lands in Jamaica.", "images": ["https://jis.gov.jm/media/2022/09/Heritage-Competition-2022-Update.png", "https://jis.gov.jm/wp-content/themes/jis/img/goj-header.png", "https://jis.gov.jm/media/2022/05/Honours-and-Awards-Receipients-Banner-2022.jpg", "https://jis.gov.jm/media/2018/10/jis-logo-icon-color.png", "https://jis.gov.jm/media/9-470x290.png", "https://jis.gov.jm/media/2019/11/Ananda-Alert.jpg", "https://jis.gov.jm/media/IMG_0930-1-670x450.jpg", "https://jis.gov.jm/wp-content/themes/jis/img/width-fix.png", "https://jis.gov.jm/media/2020/03/corona-virus-ad.jpg", "http://jis.gov.jm/wp-content/plugins/gtranslate/flags/24/en.png", "https://jis.gov.jm/media/SPRING-VALLEY-TOWN-HALL-2017-36-2-470x290.jpg", "https://jis.gov.jm/media/2022/10/tara2-1024x684.jpg?v=1665092014", "https://jis.gov.jm/media/JapanXedit-470x290.jpg", "https://jis.gov.jm/wp-content/themes/jis/img/side-menu.png", "http://jis.gov.jm/media/favicon.png"], "top_img": "http://jis.gov.jm/media/favicon.png", "keywords": [], "authors": [], "canonical_link": "https://jis.gov.jm/president-trump-underscores-us-jamaica-relations/", "title": "President Trump Underscores US-Jamaica Relations – Jamaica Information Service", "meta_data": {"viewport": "width=device-width, initial-scale=1, shrink-to-fit=no", "mobile-web-app-capable": "yes", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "Jamaica Information Service - The Voice of Jamaica", "robots": "max-image-preview:large", "tec-api-version": "v1", "tec-api-origin": "https://jis.gov.jm", "msapplication-TileImage": "https://jis.gov.jm/media/cropped-favicon-500x500.png"}, "movies": [], "publish_date": null, "source": "http://jis.gov.jm", "summary": ""}