{"url": "en.wikipedia.org/wiki/Royal_Christmas_Message", "text": "Christmas Broadcast made by the Sovereign of the Commonwealth realms to the Commonwealth\n\nThe King's Christmas Message (also known as The Queen's Christmas Message in the reign of a female monarch, formally as His Majesty's Most Gracious Speech,[1][2] and informally as the Royal Christmas Message) is a broadcast made by the sovereign of the United Kingdom and the other Commonwealth realms to the Commonwealth of Nations each Christmas. The tradition began in 1932 with a radio broadcast by King George V on the British Broadcasting Corporation's Empire Service. It is broadcast on television, radio, and the Internet via various providers. It is usually broadcast at 15:00 GMT (3:00 PM).\n\nHistory [ edit ]\n\nThe idea for a Christmas message from the sovereign to the British Empire was first proposed by the founding director-general of the British Broadcasting Corporation (BBC), John Reith, in 1922 when he approached King George V about making a short broadcast on the newly created radio service. The King declined, however, believing that radio was mainly an entertainment.[3] Reith approached the King again ten years later, in 1932,[4] as a way to inaugurate the Empire Service (now the World Service) and the King finally agreed after being encouraged to do so by Queen Mary[3] and Prime Minister Ramsay MacDonald.[5] That year, King George V read the first Royal Christmas Message, which was scripted by Rudyard Kipling; the King was originally hesitant about using the relatively untested medium of radio, but was reassured after a summertime visit to the BBC and agreed to carry out the concept and read the speech from a temporary studio set up at Sandringham House.[6] The 1934 Christmas broadcast was introduced from Ilmington Manor by 65-year-old Walton Handy, a local shepherd, with carols from the church choir and the bells ringing from the town church, and reached an estimated 20 million people in Australia, Canada, India, Kenya, South Africa and the United Kingdom.[6]\n\nWhile his brother, King Edward VIII, abdicated just before his first Christmas as king, King George VI continued his father's Christmas broadcasts; it was in his 1939 reading delivered in the opening stages of the Second World War that he uttered the famous lines: \"I said to the man who stood at the Gate of the Year.\"[7]\n\nFor many years, the King's speech came at the end of an hour-long broadcast of greeting from various parts of the British Empire and Commonwealth which typically included interviews with ordinary people of many occupations such as an innkeeper in an English village, a miner in South Africa, and a lifeguard in Australia with the King's speech serving as a bond tying the Commonwealth together.[3]\n\nGeorge's daughter and successor, Queen Elizabeth II, gave her first Christmas message to the Commonwealth of Nations from her study at Sandringham House, at 3:07 PM on 25 December 1952, some 10 months after her father's death. Five years later, the message was broadcast on television for the first time.[8] It has been an annual television broadcast every year since, with the exception of 1969: that year, no message given because a special documentary film, Royal Family, had been produced during the summer in connection with the investiture of the Prince of Wales. It was therefore decided not to do a broadcast at Christmas, but the Queen issued a written message instead.\n\nUntil 1996, the Christmas broadcast was always produced by the BBC; the monopoly was ended when it was announced that, from 1997, the message would be produced and broadcast alternately by the BBC and its main rival, Independent Television News (ITN), with a biennial rotation.[9] It was reported by The Daily Telegraph that this decision was made after the BBC decided to screen an interview with Diana, Princess of Wales, on its current affairs programme Panorama.[10] This was denied by Buckingham Palace which said the new arrangements \"reflect the composition of the television and radio industries today\".[11] Beginning in 2011, Sky News was added to the rotation.[11]\n\nSky News recorded the Queen's Christmas message for Christmas 2012, the Queen's Diamond Jubilee year, and for the first time it was recorded in 3D.[12] Buckingham Palace are reported to have explained: \"We wanted to do something a bit different and special in this Jubilee year, so doing it for the first time in 3D seemed a good thing, technology wise, to do.\"[12]\n\nUnder the reign of Queen Elizabeth II, the themes and direction of the speech were decided by the Queen and the text was largely written by the Queen herself, sometimes with assistance from Prince Philip (prior to his death in 2021) and her staff. In recent years, the speech became more personal and religious in tone.[13]\n\nBroadcast [ edit ]\n\nThe message typically combines a chronicle of that year's major events, with specific focus on the Commonwealth of Nations, with the sovereign's own personal milestones and feelings on Christmas. It is one of the few instances when the sovereign speaks publicly without advice from any ministers of the Crown in any of the monarch's realms. Planning for each year's address begins months earlier, when the monarch establishes a theme and appropriate archival footage is collected and assembled; the actual speech is recorded a few days prior to Christmas.[6]\n\nTiming:\n\nMessages [ edit ]\n\nGeorge V [ edit ]\n\nGeorge VI [ edit ]\n\n1930s [ edit ]\n\nYear Notes Broadcast\n\npartner 1936 No message was delivered. King Edward VIII abdicated the throne, two weeks prior.[6] None 1937 In his first broadcast as king, the King recalled his father's broadcasts to the Empire and the reverence listeners had for him. George VI said he could not aspire to replace his father's broadcasts but that nevertheless, as this was his first Christmas as King, he thanked the Empire for its support and loyalty during his first year on the throne. He expressed his pledge to be worthy of his subjects' support. Looking back on 1937, he noted the \"shadows of enmity and of fear\" hanging over parts of the world but turned to the message of Christmas, of peace and good will, and expressed hope that that spirit would prevail and continue to be the keystone of people's lives.[6][22][23] BBC 1938 No message was delivered.[6] None 1939 Delivering his message on the first Christmas of the Second World War the King spoke live from Sandringham House to offer a message of reassurance. He spoke of Christmas as a festival of peace and lamented that \"it is the tragedy of this time that there are powerful countries whose whole direction and policy are based on aggression and the suppression of all that we hold dear for mankind.\" He continued, saying: \"It is this that has stirred our peoples and given them a unity unknown in any previous war. We feel in our hearts that we are fighting against wickedness, and this conviction will give us strength from day to day to persevere until victory is assured.\" He spoke of his pride in the Royal Navy's courage and devotion in its battles in the first months of the war as well as the courage of the merchant marine. He also expressed thanks to the British Expeditionary Force and other armies of the Empire saying that \"Their task is hard. They are waiting, and waiting is a trial of nerve and discipline. But I know that when the moment comes for action they will prove themselves worthy of the highest traditions of their great Service.\" He referred to the nations and colonies of the Empire as a \"Family of Nations which is prepared to sacrifice everything that freedom of spirit may be saved to the world\" and referred to the assistance Britain has received from the rest of the Empire. George VI referred to \"the cause of Christian civilisation\" as what unites the Empire and its Allies, adding that \"On no other basis can a true civilisation be built.\" He concluded with words of encouragement from the poem God Knows by Minnie Louise Haskins: 'I said to the man who stood at the Gate of the Year, \"Give me a light that I may tread safely into the unknown.\" And he replied, \"Go out into the darkness, and put your hand into the Hand of God. That shall be to you better than light, and safer than a known way.\"'[6][24][25] BBC\n\n1940s [ edit ]\n\n1950s [ edit ]\n\nYear Notes Broadcast\n\npartner 1950 With the deepening Cold War, the Korean War, Malayan Emergency as well as the risk posed by thermonuclear weapons, the King spoke of \"the grim shadow of war\" hanging over the world. He took as the theme of his message John Bunyan's Pilgrim's Progress, its story of going forward, only to fall back while keeping \"our eyes fixed on the far-off, delectable mountains of peace and good will\" as took from the book the motto \"Whatever comes or does not come. I'll not be afraid\" and the need for each individual to bear his burden, even if it seems insurmountable. The King also expressed his wish for peace saying \"if our world is to survive in any sense that makes survival worthwhile, it must learn to love and not to hate, and to create and not destroy\" warning that mankind must choose between these two paths.[43][44][45] BBC 1951 George VI's final Christmas message was the only broadcast that he pre-recorded, as he had recently undergone lung surgery.[3][6] He spoke of his recovery and the goodwill messages he had received: \"From my peoples in these islands and in the British Commonwealth and Empire – as well as from many other countries – this support and sympathy has reached me and I thank you now from my heart...\"[46]\n\nElizabeth II [ edit ]\n\n1950s [ edit ]\n\nYear Notes Broadcast\n\npartner 1952 In her first Christmas message, from the same desk and chair used by her father and grandfather before him,[6] the Queen spoke of carrying on the tradition of Christmas broadcasts passed on to her by George V and George VI and said she would strive to carry on their work to unite the peoples of the Empire and maintain their ideals and thanked her people for their loyalty and affection in the first months of her reign. She also referred to the British Commonwealth and Empire as an \"immense union of nations\" that was like a family and which \"can be a great power for good – a force which I believe can be of immeasurable benefit to all humanity\".[47][48] This message, and the ones until 1957, were simulcast on television in sound only in the United Kingdom.[ citation needed ] BBC 1953 This message was broadcast from Auckland, New Zealand, during the Queen and the Duke of Edinburgh's six-month royal tour of the Commonwealth and spoke of her trip so far and what she hoped to learn and accomplish from the tour. The Queen referred to the Crown as a \"personal and loving bond\" between herself and her people and spoke of feeling at home in Auckland despite its distance from London. She spoke of the Commonwealth as a \"fellowship\" which bears no resemblance to the empires of the past and in which Britain is but an equal partner. She finished the broadcast with a note of sympathy to those affected by the Tangiwai disaster the night before.[49][50] 1954 The Queen broadcast this message from Sandringham House at the end of a year in which she and her husband, The Duke of Edinburgh, had travelled around the world.[51] 1955 Broadcast live from her study at Sandringham House, the Queen's theme was the opportunities arising from membership of the Commonwealth of Nations. With the launch of ITV in the UK, the sound-only television broadcast was simulcast on both ITV and the BBC Television Service from this year on.[52] 1956 The Duke of Edinburgh spoke from HMY Britannia during a voyage around the Commonwealth before the Queen made her speech live from Sandringham House in which she referred to the Duke's message as the one that gave her and her children the greatest joy listening to and wished him a good journey before expressing her sadness at being separated from him. She also expressed her sympathies to those who, unlike her, do not enjoy a united family or cannot be at home for Christmas or who are alone or have been driven from home and asked listeners to think especially of those who have been driven from their homelands by war or violence, refugees, asking that they be given true refuge and, in a reference to the story of Christ's birth, be given room at the inn. As in previous messages, she compared the Commonwealth to a family in which, despite its differences, \"for the sake of ultimate harmony, the healing power of tolerance, comradeship and love must be allowed to play its part.\"[53] The broadcast was criticised for the Queen's continued refusal to have it televised and for having \"too many ponderous platitudes written into it by her officials\" and for presenting \"a false picture of the Commonwealth as one big happy British family – all Anglo-Saxons under the skin.\"[54] 1957 This year's message, read from the Long Library at Sandringham House, was the first to be televised and was also the 25th anniversary of the first Christmas broadcast on radio. The Queen noted the milestone and the advance of technology that allowed her message to be viewed in her subjects' homes. She added that while change might be bewildering, it is important to hold on to ageless ideals and values such as the importance of religion, morality, honesty and self-restraint and spoke of the need for courage to stand up for what is right, true and honest.[55][56] During this season freak radio conditions caused by sunspots resulted in American police radio transmissions interfering with British television broadcasts. One occasion of interference occurred during the Queen's speech, causing listeners to hear an American police officer say, \"Joe, I'm gonna grab a quick coffee.\"[57] 1958 The reading, coming from the Long Library at Sandringham House, focused on the importance of spiritual and family values and some of the journeys soon to be made around the Commonwealth by the Queen and members of the Royal Family. The Queen also responded to requests that her children be shown in the broadcast by saying that after a great deal of thought she and her husband decided against it as they want their children to grow up as naturally as possible. This was the final Christmas message to be delivered live.[58][59] 1959 The Queen pre-recorded her Christmas message for the first time. The message was filmed in Buckingham Palace a week prior to broadcast and lasted about one minute. It conveyed the Queen's best wishes and her gratitude for the warm wishes she had received. Being pre-recorded allowed the message to be shipped abroad in advance and to be broadcast in Australia and New Zealand on Christmas Day for the first time as time differences and the International Date Line meant that many previous live broadcasts were actually heard on Boxing Day in Australia and New Zealand. As a result of the success of the recording, all subsequent Christmas messages have also been pre-recorded.[60]\n\n1960s [ edit ]\n\n1970s [ edit ]\n\n1980s [ edit ]\n\n1990s [ edit ]\n\n2000s [ edit ]\n\n2010s [ edit ]\n\n2020s [ edit ]\n\nYear Notes Broadcast\n\npartner 2020 At the end of a year shaped by the COVID-19 pandemic, the Queen spoke of her great pride in the \"quiet, indomitable\" spirit of those who have \"risen magnificently\" to the challenges of 2020, adding that \"We need life to go on.\" Speaking of mutual assistance during the crisis, she said that \"Remarkably, a year that has necessarily kept people apart has, in many ways, brought us closer.\" To those who have suffered loss, she said \"You are not alone, and let me assure you of my thoughts and prayers.\" She said what many people want \"for Christmas is a simple hug or a squeeze of the hand\" - but \"even on the darkest nights there is hope in the new dawn\". The Queen singled out young people for their part in helping society during the crisis and noted that 2020 was the bicentennial of the birth of Florence Nightingale when voicing a \"debt of gratitude” to nurses and frontline workers. She also evoked the Parable of the Good Samaritan in praising countless people who have helped strangers during the pandemic. In addition, she noted the centenary commemorations of the entombment of the Unknown Warrior, who as a symbol of \"selfless duty and ultimate sacrifice\" was, for her, a \"source of enduring hope in difficult and unpredictable times\". This was the first Christmas Speech to be available to listen on Amazon Alexa devices.[145][146] BBC 2021 In her final Christmas Message, the Queen marked the death of her consort, the Duke of Edinburgh, which occurred earlier in the year, remarking that \"although it's a time of great happiness and good cheer for many, Christmas can be hard for those who have lost loved ones. This year, especially, I understand why,\" referring as well to the second year of the COVID-19 pandemic. She thanked her subjects for the \"warmth and affection\" shown in the tributes to the Duke of Edinburgh's life, saying she had drawn \"great comfort\" from them. Of Prince Philip, she said: \"His sense of service, intellectual curiosity and capacity to squeeze fun out of any situation were all irrepressible. That mischievous, enquiring twinkle was as bright at the end as when I first set eyes on him.\" She delivered her message while behind a desk in the White Drawing Room at Windsor Castle, accompanied by a single, framed picture of herself and her late husband. She wore a sapphire chrysanthemum brooch which she had worn in 1947, during her honeymoon, and again for her Diamond Wedding celebrations.[147][148] ITN\n\nCharles III [ edit ]\n\nYear Notes Broadcast\n\npartner 2022 TBA ITN\n\nSimilar messages elsewhere [ edit ]\n\nIn 1931, Queen Wilhelmina of the Netherlands delivered her first Christmas message on the airwaves, which was also broadcast to the Dutch East Indies, Suriname and the other Dutch West Indies via shortwave radio station PCJJ. During the reign of her daughter Juliana, the Royal Christmas Message was to become an annual tradition.[149]\n\nThe Pope delivers a Christmas message to the world and heads of state of other countries have adopted the tradition of a message at Christmas, including the King of Sweden, the King of the Belgians, the President of Germany, and the King of Spain beginning in 1975.\n\nOthers have modified the practice by issuing a statement to coincide with the New Year; this is done by the Governors-General of Canada and New Zealand, the Queen of Denmark, the King of Norway, the King of Thailand, the Presidents of China, Finland, France, Hungary, Italy, the Philippines, Poland, Portugal, and the Russian Federation, as well as the Chancellor of Germany. The Archbishop of Canterbury, spiritual leader of the Anglican Communion, also gives a New Year's Day speech. The British Prime Minister issues a short Christmas message and the Prime Minister's New Year Message which extensively reflects on the last year and the governments intentions in the new year.\n\nThe Prime Minister of Canada records a short Christmas greeting.[150]\n\nThe Yang di-Pertuan Agong of Malaysia makes speeches on his official birthday in June and on National Heroes Day in July, while the Prime Minister of Malaysia also makes speeches not only on New Year's Day but also on the night of Eid ul-Fitr and on the eve of Independence Day. The Prime Minister of Singapore gives his speech on this occasion and on the National Day of Singapore. In the past, the Governor of Hong Kong, as the representative of the British monarch, played this role; the tradition was carried on by the Chief Executive of Hong Kong upon the territory's handover to China in 1997.\n\nThe President of the United States also gives out Christmas messages as part of the President's Weekly Address. Some of these messages come out within a few days before Christmas or on Christmas Day. The President may also give out Christmas message to soldiers serving in the U.S. Armed Forces.[151] The opposition party may also give out their Christmas messages as part of their response to the President's weekly address. In addition, beginning in 1986, US President Ronald Reagan and Soviet Union general secretary Mikhail Gorbachev exchanged televised New Year's Day addresses to the other's respective nations. This exchange continued between President George H. W. Bush and Gorbachev until the demise of the Soviet Union.\n\nSee also [ edit ]", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/7/79/P_christianity.svg/31px-P_christianity.svg.png", "http://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Royal_Coat_of_Arms_of_the_United_Kingdom_%28Variant_2%29.svg/100px-Royal_Coat_of_Arms_of_the_United_Kingdom_%28Variant_2%29.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/12px-Commons-logo.svg.png", "http://en.wikipedia.org/static/apple-touch/wikipedia.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Royal_broadcast%2C_Christmas_1934_%28Our_Generation%2C_1938%29.jpg/220px-Royal_broadcast%2C_Christmas_1934_%28Our_Generation%2C_1938%29.jpg", "http://en.wikipedia.org/static/images/footer/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Wikisource-logo.svg/15px-Wikisource-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/7/77/Christmas_broadcast_1957.png/220px-Christmas_broadcast_1957.png"], "top_img": "http://en.wikipedia.org/static/apple-touch/wikipedia.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Royal_Christmas_Message", "title": "Royal Christmas Message", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "viewport": "width=1000", "og": {"title": "Royal Christmas Message - Wikipedia", "type": "website"}}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}