{"url": "https://www.vulture.com/2018/07/emmy-nominations-2018-biggest-snubs-and-surprises.html", "text": "Photo: NBC/HBO\n\nIt wouldn’t be an Emmy Awards nomination day if we didn’t feel both elated about some surprises nods, and furious about the shows and people who were egregiously overlooked — snubbed, if you prefer — by Television Academy voters. Here, without further ado, is a rundown of the key shockers and misguided omissions in the 2018 Emmy nominations.\n\nThe Surprises\n\nAfter eight years, Modern Family was finally left out of the outstanding comedy race. For the first time in the show’s history, none of its cast members were nominated for their performances, either. (The ABC sitcom only snagged one nomination, for outstanding sound mixing.) Ordinarily something like this would belong in the snubbed category, but since it seems long overdue, Modern Family’s absence qualifies as more of a surprise.\n\nIssa Rae’s nomination for outstanding lead actress in a comedy. With Julia Louis-Dreyfus out of contention this year, that left a door open for a newcomer. And Issa Rae, another HBO comedy lead and the star-creator of Insecure, walked right through it.\n\nZazie Beetz’s nod for outstanding supporting actress in a comedy. I wasn’t sure she would get Emmy recognition for her terrific work on the male-dominated Atlanta. But she did, and good for her.\n\nMegan Amram! The Good Place writer (and pioneer in repetitive political tweets) made a web series called An Emmy for Megan and actually got an Emmy nomination for it, proving that blatant and hilarious self-promotion can be very effective.\n\nSo many nominations for Ozark. I wasn’t that surprised to see Jason Bateman nominated for outstanding lead actor, but did the Netflix drama also deserve two nods in the directing category, and five nominations overall? That’s the same number that The Americans earned. The dearly departed FX spy drama didn’t get any directing recognition, but Ozark was honored twice?\n\nKenan Thompson and Aidy Bryant nominated for Saturday Night Live. After 15 seasons on SNL, Thompson finally got his due in the outstanding supporting actor in a comedy category, and Bryant got to join co-stars Kate McKinnon and Leslie Jones in the comedy supporting actress group for the first time.\n\nKatt Williams nominated for Atlanta. His guest starring performance as Earn’s Uncle Willie in the season premiere of Atlanta Robbin’ Season earned him an Emmy nomination, which I did not necessarily expect, but is most definitely deserved.\n\nBruno Mars is now an Emmy nominee. He scored a nod as music director of his special Bruno Mars: 24K Magic Live at the Apollo. You’re one tiny step closer to that EGOT, Mr. Uptown Funk.\n\nJonathan Van Ness got a non-Queer Eye nomination. Queer Eye was (not unexpectedly) nominated for scripted reality series, but so was Gay of Thrones, for outstanding short-form variety series.\n\nBig Mouth has an Emmy nod, too. Honestly, Big Mouth should have gotten one for outstanding animated series. At least it earned one for its tour de force musical exploration of sexual identity, “Totally Gay,” written by Mark Rivers and performed by a pretend cartoon Freddie Mercury.\n\nThe Egregious Oversights\n\nThe Good Place wasn’t nominated for outstanding comedy. Okay, Emmys, so you’re telling me there wasn’t room to honor the most intellectually challenging comedy on TV? Really? Couldn’t you have left out Curb Your Enthusiasm and included this instead?\n\nKilling Eve a no-go for outstanding drama. I thought it might make it in there. I was wrong. But still, good work for nominating Sandra Oh for outstanding actress.\n\nKit Harington and Emilia Clarke weren’t nominated. HBO took a gamble and pushed Game of Thrones’ Daenerys and her lover/nephew Jon Snow as leads rather than supporting contenders, unlike Nikolaj Coster-Waldau and Peter Dinklage. It did not pay off.\n\nOne Day at a Time got totally overlooked. If you can’t spare a nomination for living legend Rita Moreno, something is wrong.\n\nShockingly, Kyle MacLachlan didn’t get a nod for Twin Peaks: The Return. I know it feels like 80 years have passed since The Return aired on Showtime last summer. But it was in contention this year and received nine nominations, including one for David Lynch’s direction, but not one for outstanding limited series or MacLachlan’s performance, in which he resurrected an iconic TV character and played multiple challenging roles. I’m totally going to be eating an entire cherry pie in disgust tonight.\n\nMore than half of the Pearson family got snubbed. Sterling K. Brown and Milo Ventimiglia both were recognized for their performances on This Is Us, but the other two members of the Big Three — Chrissy Metz and Justin Hartley — and the family matriarch, played by Mandy Moore, got no love.\n\nMargo Martindale and Miriam Shor didn’t get nominated for their work on The Americans. Both Martindale (a previous winner) and Shor were phenomenal in The Americans’ final season, but neither made the cut for best guest actress in a drama. One of these women made a phenomenal zharkoe stew and the other died of cancer. What more do you want, Emmys?!\n\nBoJack Horseman came up empty. Speaking of character actress Margo Martindale, a sublime season of BoJack Horseman came away with no accolades today. Getting screwed over is pretty on-brand for BoJack, but that doesn’t make it right.\n\nWill and Grace lost out on multiple fronts. Megan Mullally was the only main cast member to get nominated. Sean Hayes, Debra Messing, and Eric McCormack were all passed over, and so was the series, once an Emmy darling, for outstanding comedy. Reboots: good for ratings, not always good for awards.\n\nJane the Virgin, Vulture’s best show on TV, got a grand total of … zero nominations. Actually, no CW shows were acknowledged by Emmy this year. Something tells me this will come up in a future musical number on Crazy Ex-Girlfriend.", "images": ["https://pyxis.nymag.com/v1/imgs/e33/6e7/aed044d06bd5c293490430f400dc112e41-2022Cov4x5-AsianAmericaPkg.w240.jpg", "https://pyxis.nymag.com/v1/imgs/31a/165/7b2cda49d5258316afceb071e56d8d3a8b-women-3.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/eae/2e1/6e5d2a777f4679f07b4c64745938bb3ffd-12-the-good-place-issa.rsquare.w700.jpg", "https://www.vulture.com/media/components/customer-alert-banner/close_x.svg", "https://www.vulture.com/media/components/customer-alert-banner/alert.svg", "https://pyxis.nymag.com/v1/imgs/5ea/81e/4d3b39a96107c321338c0c9a25557bd47f-zarifa-ghafari.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/c32/3bf/0a393283dc1f3f9257ff8b361ea03216c8-russia-missile.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/eae/2e1/6e5d2a777f4679f07b4c64745938bb3ffd-12-the-good-place-issa.1x.rsocial.w1200.jpg", "https://www.vulture.com/media/components/customer-alert-banner/double_chevron.svg"], "top_img": "https://pyxis.nymag.com/v1/imgs/eae/2e1/6e5d2a777f4679f07b4c64745938bb3ffd-12-the-good-place-issa.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["Jen Chaney"], "canonical_link": "https://www.vulture.com/2018/07/emmy-nominations-2018-biggest-snubs-and-surprises.html", "title": "Emmy Nominations 2018: The 20 Biggest Snubs and Surprises", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "parsely-tags": "emmys, emmys 2018, emmy awards, tv, awards, featuretype:list or roundup", "og": {"title": "Emmy Nominations 2018: The 20 Biggest Snubs and Surprises", "url": "https://www.vulture.com/2018/07/emmy-nominations-2018-biggest-snubs-and-surprises.html", "description": "Yay Issa Rae and Zazie Beetz! Boo for not nominating The Good Place!", "image": "https://pyxis.nymag.com/v1/imgs/eae/2e1/6e5d2a777f4679f07b4c64745938bb3ffd-12-the-good-place-issa.1x.rsocial.w1200.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "Emmy Nominations 2018: The 20 Biggest Snubs and Surprises", "description": "Yay Issa Rae and Zazie Beetz! Boo for not nominating The Good Place!", "image": "https://pyxis.nymag.com/v1/imgs/eae/2e1/6e5d2a777f4679f07b4c64745938bb3ffd-12-the-good-place-issa.2x.rsocial.w600.jpg", "card": "summary_large_image", "creator": "@chaneyj", "site": "@vulture"}, "article": {"published_time": "2018-07-12T19:11:51.762Z", "tag": "emmys, emmys 2018, emmy awards, tv, awards", "publisher": "https://www.facebook.com/Vulture"}, "description": "The 2018 Emmy Award nominations feature their share of surprises (Issa Rae getting a nomination for Insecure) and snubs (The Good Place not making the cut for outstanding comedy).", "robots": "max-image-preview:large", "sailthru.tags": "emmys, emmys 2018, emmy awards, tv, awards", "author": "Jen Chaney", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://assets.nymag.com/media/sites/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1531422711.762, "source": "https://www.vulture.com", "summary": ""}