{"url": "https://en.wikipedia.org/wiki/Mine_(Taylor_Swift_song)", "text": "2010 single by Taylor Swift\n\n\"Mine\" is a song written and recorded by American singer-songwriter Taylor Swift for her third studio album Speak Now (2010). Produced by Swift and Nathan Chapman, it combines country pop and pop rock with lyrics about the ups and downs of a young love, inspired by Swift's tendency to run away from love for fears of heartbreak. Big Machine Records released \"Mine\" as Speak Now's lead single for digital download on August 3, 2010, two weeks earlier than intended because of an unauthorized internet leak. In the United States, the single impacted country radio on August 16, 2010.\n\nMusic critics praised \"Mine\" for its narrative and mature perspective on love, although some deemed the song formulaic and likened it to Swift's previous country pop songs. The single was a top-ten hit and received recording certifications in Australia, Canada, and Japan. In the United States, \"Mine\" peaked at number three on the Billboard Hot 100, number two on Billboard's Hot Country Songs chart, and number one on Billboard's Adult Contemporary chart. The Recording Industry Association of America (RIAA) certified the single triple platinum for crossing three million units based on sales and streaming.\n\nSwift and Roman White directed the music video for \"Mine\", which chronicles a romance with a happy ending between Swift and her love interest (played by English actor Toby Hemingway). The video received media praised for its narrative and won Video of the Year at the 2011 CMT Music Awards. During promotion of Speak Now, Swift performed \"Mine\" on televised events in the United States and Japan, and included the song on the set list of her Speak Now World Tour (2011–2012). She also included it on the set lists for select dates of her world tours Red (2013–2014), 1989 (2015) and Reputation (2018).\n\nBackground and release [ edit ]\n\nIn an interview with Rolling Stone, Swift revealed that \"Mine\" was inspired by an unnamed crush in mind, saying \"I was reflecting back on a boy I liked at a certain time.\"[1] She also told MTV that the song is about what it would be like if she actually let her guard down.[2] During a live Ustream chat with fans on July 20, 2010, Swift explained that the song is about \"her tendency to run from love\" after seeing many relationships end in goodbye and breakups.[3] She continued, \"I think I've developed this pattern of sort of running away when it comes time to fall in love and to stay in a relationship. The song is sort of about finding the exception to that and finding someone who would make you believe in love and realize that it could work out.\"[3][4]\n\n\"Mine\" was one of the fourteen tracks in Speak Now that was written solely by Swift. She also co-produced the song with Nathan Chapman, who co-produced all of Swift's studio albums. It was originally planned to be released on August 16, 2010, however, after the leak of an unauthorized low-quality mp3 file of the song, Big Machine Records decided to ship the song to country radio and iTunes twelve days earlier than planned on August 4, 2010.[5][6][7] Swift commented that \"a leak is so out of my comfort zone, but it ended up good in the end. It made me so emotional that I started crying.\"[2][8]\n\nComposition [ edit ]\n\n\"Mine\" (2010) A sample of \"Mine\" by Taylor Swift. The song is a country-pop song, which drew comparisons to Swift's previous works. Problems playing this file? See media help.\n\n\"Mine\" is an uptempo country pop song with elements of mainstream pop music.[9][10] In the Los Angeles Daily News, Sam Gnerre characterized the song as a blend of country and pop rock.[11] KILT-FM described \"Mine\" as \"an uptempo song that's unmistakably Taylor\" with \"a big chorus and [is] very singable.\"[12] Blake Boldt of Engine 145 explained that the song \"is a mishmash of ideas bolted together by a terrific power-pop chorus that will stick in your brain after the second or third listen.\"[13] The song is set in the time signature of common time, and has a moderate tempo of 121 beats per minute. It is written in the key of G major and Swift's vocals span one octave, from G 3 to D 5 .[14] It follows the chord progression of C 2 –G 5 –D 5 –C 2 –D 5 .[14] Alan Macpherson of The Guardian noted that the song \"reprises the joyous rush of Swift's breakthrough hit, \"Love Story\", but depicts love as an adult process rather than a teenage dream.\"[15]\n\nDave Heaton of PopMatters described the song as a \"song of rebirth\" with a \"fairly complex\" narrative.[16] He summarized the content of the lyrics, writing \"[i]t starts in the past, at the start of a relationship, and then lets us know it's a flashback. They’re sitting on the couch reminiscing. It then jumps back to the beginning and steps us through the couple’s years together, but all the while shifting perspective, jumping between their separate memories.\"[16] James Dinh of MTV noted that the song \"features an uplifting country/pop melody and a big chorus\" and it talks about \"the wonders of being in a happy relationship after surviving a rocky past.\"[17] Priya Elan of The Guardian believed that \"Mine\" depicts \"a stop-start relationship between a normal guy and girl\".[18] Leah Greenblatt of Entertainment Weekly interpreted the song's message to be about \"young love blossoming — in this specific case, young college love.\"[19]\n\nCritical reception [ edit ]\n\nThe song received mostly positive reviews by music critics. Billboard gave the single a four-and-a-half rating.[20] Rob Sheffield of Rolling Stone praised Swift's lyrical craftsmanship, calling the song's couplets \"You made a rebel of a careless man's careful daughter\" as a \"brilliant throwaway detail.\"[21] Bobby Peacock of Roughstock gave the song three-and-a-half stars out of five, lauding its catchy yet melodious hook. However, he pointed out that the song reflects her earlier works in the first two albums and he wished that Swift would \"try something a little more out of the ordinary.\"[22] Nick Levine of Digital Spy gave the song four stars out of five, commenting that although the song was \"formulaic,\" the formula was executed convincingly.[23] Chrissie Dickinson of the Chicago Tribune noted that \"Mine\" is an epitome of Swift's classic song-craft, calling it \"simple but honest expressions of emotion.\"[24] Anthony Benigno of the Daily News said that although the track is reminiscent of Swift's previous hits, he added, \"the song's origins are grounded more in failed relationships than storybook ones.\"[25]\n\nBlake Boldt of Engine 145 gave the song a thumbs-down, criticizing Swift's failure to deliver an expected \"big payoff\" through the song. He contended that this failure proves that \"Swift's songwriting skills are still raw, still needing that one last polish in order to shine.\"[13]\n\nAccolades [ edit ]\n\nChart performance [ edit ]\n\nTwo days after its official release, it was estimated that \"Mine\" would sell approximately 350,000 digital downloads with a possible debut in the top three on the Billboard Hot 100.[33] On the week ending August 21, 2010, the song debuted at number one on the Hot Digital Songs due to 297,000 digital downloads, which led to its appearance on the Billboard Hot 100 at number three. This consequently made Swift the second female artist in the history of the Hot 100 to have multiple tracks debut in the top five during a calendar year (the first being Mariah Carey).[34] With 297,000 downloads, \"Mine\" became the eighth-biggest debut sales week ever for a digital song, and the fourth-best of 2010.[35] The song also debuted at number 26 on the Hot Country Songs on the week ending August 21, 2010, where it peaked at number two, having been blocked by Darius Rucker's \"Come Back Song\" at number one on the week ending November 13, 2010.[36] \"Mine\" also reached number one on the Adult Contemporary,[37] number seven on the Adult Pop Songs[38] and number 12 on the Pop Songs.[39] At the end of 2010, \"Mine\" was ranked at number 46 on the Billboard Hot 100 song of the year.[40] On August 21, 2014, the song was certified triple platinum by the RIAA.[41] As of November 2017, \"Mine\" has sold 2.3 million copies in the United States.[42]\n\n\"Mine\" achieved moderate success outside the United States. The song debuted and peaked at number seven in Canada with 15,000 digital downloads sold in the week of August 2, 2010.[43][44] It was certified platinum by Music Canada.[45] On the week ending August 22, 2010, the song entered in Australia and peaked at number nine.[46] It was certified gold by the Australian Recording Industry Association (ARIA) for shipments exceeding 35,000 copies.[47] On the week ending August 9, 2010, it debuted at number 30 in New Zealand, and peaked at number 16 the following week after its release.[48] The song debuted and peaked at number 30 on the week ending October 30, 2010, on the United Kingdom.[49] In Ireland, it peaked at number 38 and spent a total of two weeks on the chart.[50] In mainland Europe, \"Mine\" peaked at number 70 on the Eurochart Hot 100 Singles Chart,[51] number 48 on Belgium (Flanders)[52] and number 48 on Sweden.[53]\n\nMusic video [ edit ]\n\nDevelopment and release [ edit ]\n\nThe accompanying music video for \"Mine\" was directed by Swift and Roman White, who had directed Swift's previous music videos such as \"You Belong with Me\" and \"Fifteen\", and this making Swift's first time to be the director for her music video.\"[54] White explained that the video features \"a lot of time travel, which would explain how those two crazy kids end up with kids of their own in the end.\"[55] He further added that \"the song has a lot of dark elements, but it also has a lot of happy elements\" and he praised Swift for her involvement with the production of the music video.[56] Swift chose her friend Jaclyn Jarrett, the daughter of professional wrestler Jeff Jarrett, to play the younger version of herself in the video.[57] Kyra Angle, the daughter of professional wrestler Kurt Angle, also made an appearance in the music video.[57] The music video was shot in Kennebunkport, Maine,[58] where several scenes took place in Ram Island Farm, Cape Elizabeth, and Christ Church on Dane Street. Christ Church served as the venue for the wedding scene.[59] The video features Swift marrying a groom played by British actor Toby Hemingway, who was cast by Swift after watching Feast of Love. She was impressed with Hemingway and thought \"it would be perfect to put him in the video.\"[60] The video premiered on August 27, 2010, on CMT,[61] in a live half-hour special event which included a behind-the-scenes look of the video.[62] Swift returned to Kennebunkport, Maine to share the premiere with local residents, which attracted approximately 800 people, including former President George H. W. Bush, who brought his grandchildren to see Swift.[63]\n\nSynopsis [ edit ]\n\nThe video begins with Swift entering the coffee shop. As she sits down, she notices that couple, opposite where she is sitting, is arguing, reminding Swift about her parents arguing when she was very young. A waiter (Toby Hemingway) comes by, just to take Swift's order, who looks up and she infatuates him, resulting in a romantic relationship between the two. They are seen moving in together and unpacking boxes. After some time of dating, Swift's lover proposes to her on a rowboat and she cheerfully accepts. Later, the two are seen arguing, resulting in Swift running away from the house, crying, just like she did when she was younger as she saw her parents arguing. He follows her, and the two reconcile the relationship. They get married and have two sons. In the end, time returns to when Swift was ordering her food at the coffee shop.[64] Throughout the video, there are some scenes of Swift singing the verses of the song while walking barefoot on a green pasture amongst photos of her and her family. The photos are hanging on a white string in between two large trees. Swift is seen with her hair loose and wearing a white dress with a thin belt around the waist.\n\nReception [ edit ]\n\nTanner Stransky of Entertainment Weekly felt the video was \"rather sweet\" and \"heartwarming\" in a sense that the song \"seems to have a happy ending.\"[65] Leah Collins of the Dose.ca lamented the video for its typical fairytale element even though the plot ended with a blissful marriage. She concluded her review by writing, \"Swift happens to include dirty diapers and recreating scenes from The Notebook.\"[66] Tamar Anitai of MTV described the video as \"a coming-of-age story\" where Swift is depicted to endure \"many adult life cycle events and major milestones.\"[54] In a different perspective, James Montgomery of MTV compared the music video with Katy Perry's \"Teenage Dream,\" writing that although both videos are \"essentially about the same thing: the fantasies of young, thoroughly modern women,\" the fantasies are \"about as different as the women presenting them.\"[67] A reviewer from The Improper Bostonian also compared the music video with Perry's \"Teenage Dream\" and noticed that the two music videos presented two contrasting end points, writing \"for Swift, it’s a marriage, a home and babies. For Perry, its independence and the ability to define your own life.\"[68]\n\nLive performances [ edit ]\n\nOn June 11, 2010, Swift performed the song for the first time at a small, intimate concert that aired as a part of CMA Music Festival: Country’s Night to Rock on ABC on September 1, 2010.[69] She also performed \"Mine\" and \"You Belong With Me\" at the 2010 NFL Opening Kickoff event.[70] On October 5, 2010, Swift performed the song live on the Italian X Factor.[71] On October 9, 2010, she performed an acoustic version of \"Mine\" during Grand Ole Opry's 85th birthday celebration.[72] She later performed the song as well as an acoustic cover of Coldplay's \"Viva la Vida\" in the BBC Radio 2 studio on October 21, 2010.[73]\n\nSwift sang \"Mine\" on several other occasions. On October 24, 2010, Swift appeared on The Paul O'Grady Show, where she performed the song.[74] On October 25, 2010, Swift sang \"Mine\" with two other songs from Speak Now on Speak Now: Taylor Swift Live From New York City, a special programme which was streamed live on CMT.com, MTV.com, VH1.com and other MTV Networks websites in Europe, Asia, Australia and Latin America to celebrate the release of her new album.[75] She performed the song on Today show concert on October 26, 2010.[76] She was scheduled to give a live performance at JetBlue's T5 Terminal at New York John F. Kennedy International Airport where she sang \"Mine\" and several songs from Speak Now.[77]\n\nOn October 27, 2010, she visited Scholastic Corporation headquarters to talk about the importance of reading and writing and perform the song to a 200 grade-schoolers and middle-schoolers at the publisher's downstairs auditorium.[78] She later performed the song on Live With Regis and Kelly.[79] On November 2, 2010, Swift made an appearance on Dancing with the Stars where she performed \"Mine\" and \"White Horse\" for the show's 200th episode.[80][81] Swift was invited to perform in BBC Radio 1's first Teen Awards in London, where she sang \"Mine\", \"Love Story\" and \"Speak Now.\"[82] On November 19, 2010, she performed the song on the Japanese program Music Station.[83] \"Mine\" is the second song on the set for the Speak Now World Tour (2011–12).[84]\n\n\"Mine\" was performed as the surprise song for the concerts in Indianapolis and Saitama during The Red Tour; and on December 8, 2015, Swift dedicated an acoustic performance of the song to 17-year old Rachel Erlandsen, who had died in a car crash before she was able to attend Swift's Australian leg of her 1989 World Tour in Brisbane.[85] It was most recently performed on her Reputation Stadium Tour in June 2018 as the surprise song for her show in Louisville.[86]\n\nPersonnel [ edit ]\n\nPersonnel are adapted from Tidal.[87]\n\nTaylor Swift – vocals, songwriter, producer, acoustic guitar\n\nNathan Chapman – producer, acoustic guitar, electric guitar, banjo, digital piano, piano, synthesizer\n\nBrian Sutton – acoustic guitar\n\nJohn Gardner – drums\n\nNick Buda – drums\n\nShannon Forrest – drums\n\nGrant Mickelson – electric guitar\n\nMike Meadows – electric guitar\n\nPaul Sidoti – electric guitar\n\nRob Hajacos – fiddle\n\nTim Lauer – hammond B3\n\nAl Wilson – percussion\n\nEric Darken – percussion\n\nTim Lauer – piano\n\nSmith Curry – steel guitar\n\nCharts [ edit ]\n\nCertifications [ edit ]\n\nCertifications and sales for \"Mine\" Region Certification Certified units/sales Australia (ARIA)[110] 2× Platinum 140,000^ Canada (Music Canada)[111] Platinum 80,000* Japan (RIAJ)[112] Gold 100,000* New Zealand (RMNZ)[113] Gold 7,500* United Kingdom (BPI)[114] Silver 200,000 United States (RIAA)[115] 3× Platinum 3,000,000 * Sales figures based on certification alone.\n\n^ Shipments figures based on certification alone.\n\nSales+streaming figures based on certification alone.\n\nRelease history [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/7/76/Taylor_Swift_-_Speak_Now_World_Tour_Sydney_2012.jpg/170px-Taylor_Swift_-_Speak_Now_World_Tour_Sydney_2012.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Gnome-mime-sound-openclipart.svg/50px-Gnome-mime-sound-openclipart.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/5/56/Taylor_Swift_-_Mine.png/220px-Taylor_Swift_-_Mine.png", "https://upload.wikimedia.org/wikipedia/en/5/56/Taylor_Swift_-_Mine.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/94/Symbol_support_vote.svg/19px-Symbol_support_vote.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/f/f9/Double-dagger-14-plain.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/5/56/Taylor_Swift_-_Mine.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Mine_(Taylor_Swift_song)", "title": "Mine (Taylor Swift song)", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/5/56/Taylor_Swift_-_Mine.png", "width": 640, "height": 640}, "title": "Mine (Taylor Swift song) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}