{"url": "https://people.com/parents/thomas-rhett-wife-lauren-adoption-journey-daughter-willa/", "text": "It's only been a little over a week since Thomas Rhett and his wife Lauren welcomed their new daughter Willa Gray home from Uganda, but the 18-month-old has quickly settled into family life, even joining Dad for her first onstage appearance this past weekend.\n\nBut the road that brought Willa to Nashville, Tennessee, was anything but smooth, the country star and his wife tell PEOPLE.\n\n\"I don't think anyone can fully prepare you for the journey of adopting someone, especially from a third-world country where there are so many different laws,\" says Thomas Rhett, 27. \"Every day you wake up with a whole new set of challenges that you never even heard of.\"\n\nKailey Dickerson\n\nIn April 2016, Willa — known then by her nickname \"Blessing\" — was just one of many needy orphans in a children's home Lauren visited while working in Uganda with the Christian charity 147 Million Orphans. At the time, Lauren and Thomas Rhett had been trying to get pregnant with no luck and had just begun to consider adoption.\n\n\"When I met Willa, her story was pretty intense,\" Lauren says of the toddler, who'd been brought to the children's home soon after her birth in November 2015. \"All orphans have heart-wrenching stories, but it felt like this specific baby was ours. I think that the Lord knew what he was doing when he did not let us get pregnant.\"\n\nWant all the latest pregnancy and birth announcements, plus celebrity mom blogs? Click here to get those and more in the PEOPLE Babies newsletter.\n\nKailey Dickerson\n\nRELATED VIDEO: Thomas Rhett and Wife Lauren Welcome Daughter Willa Gray: \"Everyone Is Where They're Supposed to Be\"\n\nLauren, in Uganda without Thomas Rhett (who was on tour), spent the next two days \"attached\" to the little girl. \"She was a total orphan and didn't have any biological relatives, no one. Her life was going to be at the children's home unless someone else tried to give her a home,\" Lauren says. \"So I thought, 'We need to find her a home.' I thought we'd be the helpers — and then Thomas Rhett said, 'We'll do it!' \"\n\nAnd with those words, the couple began their year-long adoption journey. It took Thomas Rhett some time to find a break in his touring schedule long enough to travel to Uganda to meet the baby who had captured their hearts, and admits laughingly, \"When I did, she didn't want anything to do with me!\"\n\n\"I reached for her and she was like, 'Who the crap are you with that beard?' But I was astonished at how quickly I bonded with her — and how immediately, she just felt like she was my child.\"\n\nKailey Dickerson\n\nBut the couple soon learned that making Willa their child legally would be far more complicated. To comply with Uganda's complex adoption laws, they were required to foster the baby in the country over the course of a year. That meant nearly a dozen trips back and forth to the East African nation — each time not knowing how long they would stay because of legal requirements, and tearful farewells after each one.\n\n\"I went over with Lauren in December for about seven weeks, and the room we were staying in with Willa almost started to feel like home,\" the singer says. \"The hardest part was never knowing when it was going to end. I'm pretty sure every flight was booked a day before we left either place because you can't plan it. We'd get there and realize we had to be there another two weeks. Things moved at a snail's pace.\"\n\nCourtesy Akins Family\n\nFROM PEN: Adoption Holds a Special Place in Katherine Heigl's Heart\n\nThe couple would stay with Willa in a guest house near the children's home and parent her as best they could during their visits before returning her to the children's home when they had to leave. \"It was hard — it's totally different parenting there,\" Lauren says. \"The babies are being taken care of sometimes by a 10-year-old.\"\n\nShe continues, \"You want to instill your own values and rules and make sure she eats certain things, and that was out of the question while we were fostering her. But you think, 'The Lord has gotten us this far, and I'm just going to have to trust that he's going to take care of the rest.' \"\n\nIn the meantime, life in America became a little more — wonderfully — complicated as well. The couple learned they were pregnant (with a girl, due in August), which meant Lauren's window for travel was closing.\n\nAnd then finally, in March, they received good news: It looked like they were getting close to being able to bring Willa home. Lauren, approaching the third trimester of her pregnancy, traveled back to Uganda once again — this time with her mother, hoping that she'd be flying back with a toddler in her arms.\n\nKailey Dickerson\n\nKailey Dickerson\n\nAs the days and the red tape ticked by, Thomas Rhett flew out to join his wife for the one week he had off between shows. \"When I left Uganda, it was a terrifying moment,\" he says. \"I knew I had to go play shows, but Lauren and her mom Lisa were literally there indefinitely.\"\n\nHe continues, \"That's a scary place to be in as the husband — being 7,000 miles away from your 25-week-pregnant wife and your daughter, not knowing if they were going to come home in two weeks or two months.\"\n\nBut the couple knew that no matter how long it would take to finalize the adoption, they couldn't leave Willa again. \"Willa was so attached to me and Lauren, and Lauren's mom, that to bring her back to the orphanage at that point would have been completely detrimental,\" the singer says.\n\n\"Her whole life has been nothing but being passed around. Different caretakers every day, different kids picking her up. Bringing her back to the orphanage wasn't an option.\"\n\nCourtesy Akins Family\n\nLauren Akins/Instagram\n\nNearly a month after Lauren arrived in Uganda, they learned that Willa would, at last, be legally theirs. \"I think the judge knew my time was running out,\" Lauren says. \"Bless his heart, I'm so thankful. I wanted to run up and hug him so hard when he gave us the court ruling.\"\n\n\"He changed her life and our lives,\" she explains. \"He knew how long we had been working with the children's home and he knew that our family is a family and that our roots are in Uganda too and that we'll be back. But for a while, I thought I'd be there forever.\"\n\nLauren knew they were close to their happy ending, but finalizing the last legal details of the adoption meant that she was getting into dangerous territory with her pregnancy.\n\n\"It had been a little over six weeks since my last checkup and I just didn't want to think something could go wrong. My doctor really wanted me to come home and make sure everything was okay,\" she says. So, with only days until Willa would be ready to travel, Lauren had to return, leaving her mother to bring the toddler home.\n\n\"It felt weird leaving one daughter and making sure the other one is okay. But I couldn't do it another way,\" Lauren adds. \"It killed me not being able to bring [Willa] home, but looking back, I think it was a blessing in disguise because I got to be home and nest before she got here — and catch up on my sleep so I wasn't so jet-lagged!\"\n\nLauren's dad, an airline pilot himself, joined her mom in Uganda, and the two made the 7,000-mile journey to Nashville with their new granddaughter on May 11.\n\n\"Seeing her there felt like a dream,\" Lauren recalls of her first glimpse of Willa when her parents drove up to the private hangar where they met.\n\nBut one more unexpected complication was awaiting the new family at the airport. \"The Predators, Nashville's hockey team who had made it to the finals, had tweeted out the night before to fans telling them to meet the team at the hangar right next door for a sendoff,\" she explains. \"So we pulled up in the car and expected it to be low-key, but holy crap, half of Nashville was there!\"\n\nA few fans noticed Thomas Rhett, but Willa and Lauren's mom were able to slip by unnoticed before the new family headed home at last.\n\n\"It's something we've worked for and hoped for so long and it's just a dream come true,\" Lauren says. \"She really does live up to her nickname in Uganda: She is just the biggest little Blessing that ever has walked the earth.\"\n\nFor more from Thomas Rhett's new family of three — soon to be four! — pick up the latest issue of PEOPLE, on newsstands now.", "images": ["https://people.com/thmb/o4ncejyR45ycsF3qdjFsxZmvqTI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/thomas-rhett-1-1-982f9682f0a1452ba79ea507ce032653.jpg", "https://people.com/thmb/2tIjVT9kQt7oHBtWoxQ5P4D9ACo=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/thomas-rhett-2-1-61cf4966a24c43518fd9718aee921854.jpg", "https://people.com/thmb/StkO8H85b7KtZHw4xXZeoXr504g=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(517x269:519x271)/lauren-akins-12ac7330ebbb4bd8a0b4bda29c0266fe.jpg", "https://people.com/thmb/x7LgzGebUd-l6KEHwAxFpKmAJEc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(359x0:361x2)/amber-heard-baby-juicing-d00edf2047a945c087d39da29c1f9d83.jpeg", "https://people.com/thmb/BQEshEgICAl-k5_uxFXtlNqy71Q=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(582x517:584x519)/thomas-rhett-lauren-akins-39a6b4491a4340d08a698ae4395406d0.jpg", "https://people.com/thmb/epCedrsrJ7mBXLEvCn9CdJjXo8M=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(979x569:981x571)/Lauren-Akins-2-9537cb240fee47ceb5f6aabf38847012.jpg", "https://people.com/thmb/2Zfq08e8Rlxy0QOtKnqGdCTA8QE=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/thomas-rhett-daughter-3-1-1eae383d38ac486fb940411d431a3c9a.jpg", "https://people.com/thmb/_eKjamMQkRrAeUTYg1R9Ee9dVss=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(237x0:239x2)/laura-atkins-willa-1-85cd3ada2da6481e868b16bdf65ba880.jpg", "https://people.com/thmb/BqljC573KwkZLB1VHH4QC56sx6Y=/1500x1500/filters:fill(auto,1)/thomas-rhett-5-7c08a44bc06b4b5ca34c756bf634bd27.jpg", "https://people.com/thmb/q5PVEtyf1lHH5r1ZVuBl1ofIPks=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(798x19:800x21)/hoda-kotbe-1-8050f749e69b4a12a23dc4aace31e5e6.jpg", "https://people.com/thmb/W42W1beQPzfY1VXA9DNjzyU3MKw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Thomas-Rhett-ad3420a9909e4d23bdaf1c5ef7059472.jpg", "https://people.com/thmb/Wsgw6kpyrBk3diqE-HBUHILvuDA=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/thomas-rhett-4-3a7c929f02684757b3d63fb241409da8.jpg", "https://people.com/thmb/e4WMMDSRVTn7UsgVmUojgwge-BQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(539x0:541x2)/Thomas-Rhett-and-Lauren-daughter-Willa-bday-2-ae537db30d63404682307ba2b6778945.jpg", "https://people.com/thmb/FxEoHkcX0d6v7N-ypg1qSl07_5A=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(979x707:981x709)/kelly-clarkson-2000-f0af8818f75946068656cb4d01656717.jpg", "https://people.com/thmb/d-yqWx8OhEOxCgE5PpJJMc5f1KY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(607x0:609x2)/thomas-rhett-lauren-2000-f917a02849544960af838e072faba3eb.jpg", "https://people.com/thmb/ECjyBvcK4rbeZ9O2mSOr9vyme-o=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(4043x557:4045x559)/david-henrie-600266c6594d4994bb94c12723d3d31b.jpg", "https://people.com/thmb/1SOomwNWMnrsLugJA0PCAWiBDMs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(559x0:561x2)/thomas-rhett-1-2000-eed93d26cc98497eb1c6bdcd51acdb46.jpg", "https://people.com/thmb/0Bgdl4Q20MJgcndP8H-fknMIzpM=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/thomas-rhett-5-7c08a44bc06b4b5ca34c756bf634bd27.jpg", "https://people.com/thmb/4oi_BFlSiEpMYnWdfSKdTlLo-EI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/thomas-rhett-66f19e0683e940edb0043438e0ec4bfe.jpg", "https://people.com/thmb/gEabYbeXon9hx6Suq86ZYFsVlng=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(730x0:732x2)/thomas-rhett-3-a2da4fa29b154418a0bd94b483503384.jpg", "https://people.com/thmb/o8sGHesVsqkuJFku9CN3X0N-b1w=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/thomas-rhett-6-1-83ba864e49c44d4fba6cd8320c53e04f.jpg", "https://people.com/thmb/mdfmGF8iKodaxQLqp5Aj621ZcYU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(899x509:901x511)/lauren-akins-4f1c7a509bde4cfb9883e241482d315a.jpg", "https://people.com/thmb/Lje7sGaj3HgeS-yLg9z5JSNPfrU=/300x150/filters:no_upscale():max_bytes(150000):strip_icc()/people_magazine_sub-e6689738996d40f38f154099e1751481.png", "https://people.com/thmb/T5zacWNxVnBbehWuaIvyX_B-88E=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(449x299:451x301)/thomas-rhett-lauren-akins-a204c1e48b294948acfff49866fef946.jpg", "https://people.com/thmb/ezLl15iHQVdH-Ec1cPJBtbE-48I=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/thomas-rhett-ftr-ceeb53c8e4184c949f43ff402f3e7f1f.jpg"], "top_img": "https://people.com/thmb/BqljC573KwkZLB1VHH4QC56sx6Y=/1500x1500/filters:fill(auto,1)/thomas-rhett-5-7c08a44bc06b4b5ca34c756bf634bd27.jpg", "keywords": [], "authors": ["Eileen Finan"], "canonical_link": "https://people.com/parents/thomas-rhett-wife-lauren-adoption-journey-daughter-willa/", "title": "Thomas Rhett and Wife Talk Emotional Adoption Journey", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "\"Immediately, she just felt like she was my child,\" Thomas Rhett tells PEOPLE of 18-month-old daughter Willa Gray, whom he and wife Lauren recently adopted", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "PEOPLE", "sailthru.author": "Eileen Finan", "article": {"section": "People", "opinion": "false", "author": "https://www.facebook.com/peoplemag"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "og": {"type": "article", "site_name": "Peoplemag", "url": "https://people.com/parents/thomas-rhett-wife-lauren-adoption-journey-daughter-willa/", "title": "Thomas Rhett and Wife Talk Emotional Adoption Journey", "description": "\"Immediately, she just felt like she was my child,\" Thomas Rhett tells PEOPLE of 18-month-old daughter Willa Gray, whom he and wife Lauren recently adopted", "image": "https://people.com/thmb/BqljC573KwkZLB1VHH4QC56sx6Y=/1500x1500/filters:fill(auto,1)/thomas-rhett-5-7c08a44bc06b4b5ca34c756bf634bd27.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "Thomas Rhett and Wife Talk Emotional Adoption Journey", "description": "\"Immediately, she just felt like she was my child,\" Thomas Rhett tells PEOPLE of 18-month-old daughter Willa Gray, whom he and wife Lauren recently adopted", "image": "https://people.com/thmb/BqljC573KwkZLB1VHH4QC56sx6Y=/1500x1500/filters:fill(auto,1)/thomas-rhett-5-7c08a44bc06b4b5ca34c756bf634bd27.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.19.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.19.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.19.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.19.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.19.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}