{"url": "https://www.cnn.com/2018/05/19/europe/royal-wedding-meghan-markle-prince-harry-intl/index.html", "text": "Windsor, England CNN —\n\nBritain’s Prince Harry and American actress Meghan Markle sealed their wedding vows with a kiss on the steps outside St. George’s Chapel in Windsor on Saturday, after a groundbreaking ceremony that didn’t challenge royal norms so much as drive a gilded coach and horses through them.\n\nThis 15th century royal peculiar – a church under the direct jurisdiction of the monarch – echoed to the sounds of a fiery Chicago preacher, a soulful gospel choir and the first black winner of a prestigious British music prize, as a constellation of A-list Americans rubbed shoulders with the bluest-blooded of British royalty.\n\nIf anyone came expecting a traditional high-church British state occasion, they must have left sorely disappointed. For everyone else, including the millions who tuned in across the world, this was an electrifying affair that will live long in the memory.\n\nConvention was broken almost from the start. After ascending the 20 or so steps to the chapel’s West Door, the bride entered to a traditional fanfare by the State Trumpeters. But then, instead of the customary rousing organ voluntary – Bach or Wagner, perhaps – Meghan set off down the aisle to a haunting and ethereal cantata composed by Handel for the birthday of Queen Anne in 1714.\n\nIn a striking image, the outspoken biracial American divorcée walked unescorted, followed by her 10 bridesmaids and page boys.\n\nAlmost every part of the ceremony made a statement. Meghan’s elegant white dress with an open bateau neckline was by British designer Clare Waight Keller, the first female artistic director for the Givenchy fashion house. The 16-foot-long veil was held in place by a diamond bandeau tiara lent to her by the Queen.\n\nMeghan walks down the aisle in St George's Chapel. DANNY LAWSON/AFP/Getty Images\n\nThe royal wedding, in pictures\n\nOnly when she reached the chapel’s Quire was Markle accompanied for her final steps to the foot of the altar by Prince Charles, Harry’s father. Even then, he stepped back. There was no one needed to “give her away.”\n\nHarry, flanked by his brother and best man Prince William, looked emotional as he waited for Meghan, dressed in the frockcoat uniform of the Blues and Royals. As she reached his side, Harry appeared to say: “You look amazing. I missed you.”\n\nHarry and Meghan exchange vows. Owen Humphreys/pool photo via AP\n\nVideo Ad Feedback 01:46 - Source: CNN See Meghan Markle walk herself down the aisle\n\nVideo Ad Feedback 13:43 - Source: CNN Bishop Michael Curry's full royal wedding address\n\nHands clasped, the couple listened to a stirring, soulful address by Bishop Michael Curry, the first African-American head of the Episcopal Church in the United States. Extemporising in the custom of American episcopalianism, Curry invoked the civil rights leader Martin Luther King Jr. to deliver a powerful ode to love.”We must discover the power of love, the power, the redemptive power of love,” he thundered. “And when we do that, we will make of this whole world a new world. But love, love is the only way.”\n\nHis impassioned preaching style was a marked departure from the usually conservative tone of a British royal wedding. Harry could be seen saying “Wow” to Meghan as Curry’s speech ended. Other members of the royal family looked decidedly bemused.\n\nIt was followed by a performance of the Ben E. King classic “Stand by Me” by The Kingdom Choir, a group of 20 gospel singers, another of the elements that gave the ceremony an air of diversity that has been almost entirely absent from any royal wedding that has gone before.\n\nOnly with the couple’s marriage vows did the ceremony come closer to resembling a traditional state occasion – but even then the language was unconventional for a royal ceremony. Harry and Meghan chose the colloquial texts of Common Worship, the standard Church of England liturgy published in 2000, over the distinctly more austere phrasing of the 1662 Book of Common Prayer used for the marriage of the Duke and Duchess of Cambridge in 2011.\n\nThere was no promise by Markle to “obey” her husband. Rather, she pledged to “love him, comfort him, honor and protect him.” Harry chose to wear a wedding ring, unlike his brother.\n\nMeghan was all smiles as she said her vows and gave Harry his wedding ring. The crowd could be faintly heard cheering outside as the couple were proclaimed husband and wife by the Archbishop of Canterbury, Justin Welby, the most senior cleric in the Church of England.\n\nHarry and Meghan kiss outside the West Door. BEN STANSALL/AFP/Getty Images\n\nHarry and Meghan ride in an open carriage. David Fisher/REX/Shutterstock\n\nAs they signed the register, the rich tones of the cello played by award-winning young musician Sheku Kanneh-Mason again emphasized the couple’s desire to break the mold. The ceremony ended with the Etta James version of “Amen/This Little Light of Mine,” a gospel song that became synonymous with the US civil rights movement.\n\nAfter their joyful kiss on the steps, the couple – now the Duke and Duchess of Sussex – then set off on a procession through the streets of Windsor in an open carriage drawn by four Windsor Grey horses.\n\nThey were waved off by a bridal party that included Harry’s nephew and niece, Prince George and Princess Charlotte, as well as the couple’s godchildren and the children of their closest friends.\n\nPrincess Charlotte waves after the wedding. Andrew Matthews/PA Wire via AP\n\nWell-wishers take pictures as Harry and Meghan pass in their carriage. Matt Cardy/Getty Images\n\nMore than 100,000 people thronged the streets to cheer the couple as they passed, authorities said. Some had camped out for days to get the best possible spot, while others rose before dawn to make their way to Windsor amid a party atmosphere.\n\nThe biggest cheers were reserved for Meghan and Harry, though Princess Charlotte drew some “awwws” after appearing on the big screen. As people began to disperse and head towards the exits, it began to dawn that an event that so many had looked forward to for so long was over. “Mummy, can we do it all again tomorrow?” one little girl asked.\n\nFrom the Commonwealth and beyond: Thank you to the amazing crowds in Windsor for the incredible reception for the newly-married Duke and Duchess of Sussex #RoyalWedding pic.twitter.com/VMpBUTr39T — The Prince and Princess of Wales (@KensingtonRoyal) May 19, 2018\n\nAmong the host of famous guests who witnessed the ceremony were Oprah Winfrey, George and Amal Clooney – dressed in an eye-catching yellow dress and hat – tennis star Serena Williams, actor Idris Elba and singer James Blunt.\n\nThe Queen, wearing a lime silk dress, was accompanied by Prince Philip. Hours before the ceremony, Elizabeth conferred the titles of Duke of Sussex, Earl of Dumbarton and Baron Kilkeel on Prince Harry, making Meghan the first-ever Duchess of Sussex.\n\nA host of other royals were also present, including the Princess Royal, Prince Andrew and his daughters, Princesses Eugenie and Beatrice. Catherine’s sister Pippa Middleton and their parents also attended.\n\nGuests from Markle’s side included her mother, Doria Ragland, who watched with tears in her eyes as her daughter walked down the aisle.\n\nAlso present were cast members from “Suits” – the legal drama in which she made her name – including Abigail Spencer, Sarah Rafferty, Gina Torres and Gabriel Macht.\n\nAmal and George Clooney arrive on Saturday. GARETH FULLER/AFP/Getty Images\n\nThe presence of Harry’s late mother, Princess Diana, was also subtly felt at the ceremony. “Guide me o thou great redeemer” was sung at Diana’s funeral, at her memorial service in 2007 and at Kate and William’s wedding in 2011, and again on Saturday.\n\nHarry’s aunt Lady Jane Fellowes, Diana’s sister, gave the reading from the Book of Solomon.\n\nMeghan’s father, Thomas Markle Sr., was supposed to attend until health concerns ruled him out. But in remarks to the US celebrity website TMZ, he said his daughter looked “beautiful” and described her wedding as “emotional and joyful.”\n\nAll 600 of the guests were invited to an afternoon reception hosted by the Queen at Windsor Castle’s St. George’s Hall, at which Elton John – who was a friend of Princess Diana – performed.\n\nThe guests were also to enjoy the famously non-traditional lemon and elderflower sponge cake chosen by Harry and Meghan.\n\nThe wedding cake is to be served at the Reception. It was designed by Claire Ptak and features elderflower syrup made at The Queen’s residence in Sandringham from the estate’s own elderflower trees, as well as a light sponge cake uniquely formulated for the couple. #royalwedding pic.twitter.com/kt5lE4tEn9 — The Prince and Princess of Wales (@KensingtonRoyal) May 19, 2018\n\nOnly 200 of the couple’s closest friends and family will celebrate with them into the night at a second, evening reception hosted by Prince Charles at Frogmore House, south of Windsor Castle. In one last departure from custom, the bride will give a speech.\n\nMeghan, who began the day as a TV star, will end it by Harry’s side as the newly minted Duchess of Sussex, whose thoroughly modern wedding broke the royal mold.\n\nTimeline: From blind date to ‘I will’", "images": ["https://media.cnn.com/api/v1/images/stellar/prod/180519080205-49-royal-wedding-harry-meghan.jpg?q=x_0,y_0,h_1687,w_2997,c_fill/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/220911071617-meghan-hug-windsor.jpg?c=16x9&q=w_250,c_fill", "https://media.cnn.com/api/v1/images/stellar/prod/140929103347-laura-smith-spark-profile-image.jpg?q=x_2,y_0,h_898,w_1596,c_crop/h_270,w_480/c_thumb,g_face,w_100,h_100", "https://media.cnn.com/api/v1/images/stellar/prod/180519173206-88-royal-wedding-meghan-chapel.jpg?q=x_3,y_145,h_1684,w_2993,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/180426114549-royal-wedding-harry-meghan-branding-logo-large-169.png?q=h_40,w_370,x_0,y_0/w_1280", "https://media.cnn.com/api/v1/images/stellar/prod/180519135150-66-royal-wedding-carriage-crowd.jpg?q=x_0,y_107,h_1684,w_2993,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/210309105047-prince-harry-oprah-interview.jpg?q=x_0,y_0,h_1080,w_1919,c_fill/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/201215074825-meghan-harry-0107-file.jpg?q=x_3,y_14,h_1684,w_2993,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/210311070550-prince-william-0311.jpg?q=x_5,y_193,h_2648,w_4706,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/191031093626-diane-abbott.jpg?q=x_4,y_81,h_2063,w_3667,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180519143325-amal-clooney-and-george-clooney.jpg?q=x_180,y_152,h_1586,w_2820,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/201011050533-meghan-markle-prince-harry.jpg?q=x_0,y_355,h_1688,w_3000,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/210226144846-prince-harry-uk-media-biz-video-thumbnail-lon-orig-na.jpg?q=x_239,y_75,h_941,w_1673,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180519091447-18-royal-wedding-unfurled.jpg?q=x_3,y_67,h_1583,w_2814,c_crop/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/190925141854-06-royals-tour-0925.jpg?q=x_3,y_245,h_1684,w_2993,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/210319081208-file-01-meghan-markle-prince-harry-2019.jpg?q=x_2,y_49,h_1163,w_2067,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180519065119-09-meghan-markle-wedding-gown.jpg?q=x_0,y_0,h_1160,w_2063,c_fill/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/180519134101-60-royal-wedding-charlotte.jpg?q=x_363,y_1553,h_1134,w_2016,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/210214213820-harry-meghan-baby-announcement.jpg?q=x_2,y_0,h_1078,w_1915,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180519150448-82-royal-wedding-harry-meghan.jpg?q=x_3,y_137,h_1684,w_2993,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180519132213-52-royal-wedding-kiss.jpg?q=x_222,y_161,h_1526,w_2712,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/180519045404-03-guest-fashion-royal-wedding-oprah.jpg?q=x_3,y_127,h_1371,w_2436,c_crop/h_144,w_256", "https://media.cnn.com/api/v1/images/stellar/prod/210304073957-screengrab-meghan.jpg?q=x_0,y_0,h_1080,w_1919,c_fill/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180519150448-82-royal-wedding-harry-meghan.jpg?q=x_3,y_137,h_1684,w_2993,c_crop/h_270,w_480", "https://media.cnn.com/api/v1/images/stellar/prod/201125053041-restricted-file-02-meghan-markle-2019.jpg?q=x_88,y_232,h_884,w_1572,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/210306112611-02-harry-meghan-oprah-handout.jpg?q=x_2,y_0,h_1123,w_1995,c_crop/w_250", "https://media.cnn.com/api/v1/images/stellar/prod/180519150448-82-royal-wedding-harry-meghan.jpg?q=x_3,y_137,h_1684,w_2993,c_crop/w_800", "https://media.cnn.com/api/v1/images/stellar/prod/201014105955-meghan-markle-social-media-mxp-vpx-00003220.jpg?q=x_310,y_174,h_742,w_1319,c_crop/w_250"], "top_img": "https://media.cnn.com/api/v1/images/stellar/prod/180519150448-82-royal-wedding-harry-meghan.jpg?q=x_3,y_137,h_1684,w_2993,c_crop/w_800", "keywords": [], "authors": ["Laura Smith-Spark"], "canonical_link": "https://www.cnn.com/2018/05/19/europe/royal-wedding-meghan-markle-prince-harry-intl/index.html", "title": "Prince Harry and Meghan Markle marry in trailblazing ceremony", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "og": {"title": "Prince Harry and Meghan Markle marry in trailblazing ceremony | CNN", "description": "The couple sealed their wedding with a joyous kiss after a groundbreaking ceremony that didn't challenge royal norms so much as drive a gilded coach and horses through them.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180519150448-82-royal-wedding-harry-meghan.jpg?q=x_3,y_137,h_1684,w_2993,c_crop/w_800", "type": "article", "url": "https://www.cnn.com/2018/05/19/europe/royal-wedding-meghan-markle-prince-harry-intl/index.html", "site_name": "CNN"}, "twitter": {"title": "Prince Harry and Meghan Markle marry in trailblazing ceremony | CNN", "description": "The couple sealed their wedding with a joyous kiss after a groundbreaking ceremony that didn't challenge royal norms so much as drive a gilded coach and horses through them.", "image": "https://media.cnn.com/api/v1/images/stellar/prod/180519150448-82-royal-wedding-harry-meghan.jpg?q=x_3,y_137,h_1684,w_2993,c_crop/w_800", "card": "summary_large_image", "site": "@CNN"}, "description": "The couple sealed their wedding with a joyous kiss after a groundbreaking ceremony that didn't challenge royal norms so much as drive a gilded coach and horses through them.", "template_type": "article_leaf", "type": "article", "meta-section": "world", "meta-branding": "royal-wedding", "theme": "world", "article": {"published_time": "2018-05-19T04:01:21Z", "modified_time": "2018-05-19T18:00:06Z", "tag": "british royal family, celebrities, europe, meghan markle, northern europe, prince harry, royal wedding of prince harry and meghan markle, royalty and monarchy, society, united kingdom, weddings and engagements, thomas markle, queen elizabeth ii, prince charles, prince william, arts and entertainment, celebrity and pop culture, north america, united states, prince george of cambridge, princess diana, belief, religion and spirituality, christianity, church of england, religious groups, marriage, prince andrew, prince philip, palaces and castles, windsor castle, catherine, duchess of cambridge", "publisher": "https://www.facebook.com/CNN"}, "keywords": "british royal family, celebrities, europe, meghan markle, northern europe, prince harry, royal wedding of prince harry and meghan markle, royalty and monarchy, society, united kingdom, weddings and engagements, thomas markle, queen elizabeth ii, prince charles, prince william, arts and entertainment, celebrity and pop culture, north america, united states, prince george of cambridge, princess diana, belief, religion and spirituality, christianity, church of england, religious groups, marriage, prince andrew, prince philip, palaces and castles, windsor castle, catherine, duchess of cambridge", "author": "Laura Smith-Spark", "fb": {"app_id": 80401312489}}, "movies": [], "publish_date": 1526684400.0, "source": "https://www.cnn.com", "summary": ""}