{"url": "https://www.hollywoodreporter.com/news/julia-louis-dreyfus-life-breast-cancer-diagnosis-1139702", "text": "Weeks after returning to the set of Veep for its seventh and final season, Julia Louis-Dreyfus is opening up about the breast cancer diagnosis that forced her to press pause on production of the hit HBO comedy.\n\nSpeaking with InStyle for a profile published Tuesday, the 57-year-old actress explained how she’s changed from her battle against the disease, which she was diagnosed with in September 2017.\n\n“I do feel different, but I can’t quite articulate how. I’ve come out the other side of this, and I’m still not exactly sure how to define the difference other than to say I’m grateful, of course, but it’s more than that,” she told the magazine. “It’s bigger.”\n\nLouis-Dreyfus also stressed that she’s hopeful to close this chapter in her life, which included three rounds of chemotherapy.\n\n“I’m not someone who likes looking back. I look forward. That’s how I operate. We’ll finish an episode, and I am just ready for the next thing,” she added. “I’m always just moving on, you know?”\n\nPart of the “next thing” for Louis-Dreyfus is advocating for other breast cancer patients. The Seinfeld alum has signed on to her first cancer awareness initiative, helping Carolina Herrera designer Wes Gordon design a T-shirt for Saks Fifth Avenue’s 20th year raising money through its Key to the Cure program.\n\n“Saks Fifth Avenue asked if I wanted to be their Key to the Cure ambassador, and it seemed like a good fit and the timing worked out well,” said Louis-Dreyfus, adding that the money raised will benefit the AiRS (Alliance in Reconstructive Surgery) Foundation, which offers financial support to breast cancer patients who can’t afford reconstructive surgery. The limited-edition shirt will sell for $35 at Saks stores during the month of October.\n\n“There are plenty of women who decide not to get reconstruction, which is fine,” said Louis-Dreyfus. “But if you want it and can’t afford it, that’s heartbreaking to me. The gap between the haves and the have-nots in our country — it’s a very wide divide right now. I’m lucky enough to be in a union where I get fabulous benefits. Not everyone is so lucky.”\n\nAside from helping others, the Emmy-winning star said in another interview with the Associated Press that she couldn’t be happier to settle back into her character Selina Meyer’s shoes on the set of Veep. “I feel good. I feel strong. I’ve got energy and, yeah, back to my old tricks,” she said. “It feels like I never left.”\n\nOn Aug. 16, Louis-Dreyfus took to social media to share a touching moment before the first shot of season seven. “I really appreciate everyone coming back — working it out to come back. I’m very grateful, thank you very much,” the actress said in a video, addressing her cast and crew. “So deeply grateful to be back together with all these superb people,” she captioned the post.\n\nAfter Louis-Dreyfus announced her breast cancer diagnosis, the show catered its schedule around its star while she underwent treatment. Season six of Veep, which aired its finale in June 2017, ended with Meyer deciding to run for president again and rescinding her plan to settle into life as an ex-president.\n\nVeep is expected to return next spring.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/08/gettyimages-468844246-h_2017_0.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/gettyimages-468844246-h_2017_0.jpg?w=1296&h=730&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/gettyimages-468844246-h_2017_0.jpg?w=1024", "keywords": [], "authors": ["Evan Real"], "canonical_link": "https://www.hollywoodreporter.com/tv/tv-news/julia-louis-dreyfus-life-breast-cancer-diagnosis-1139702/", "title": "Julia Louis-Dreyfus on Life After Breast Cancer Diagnosis: “I’m Grateful”", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "'Veep' star Julia Louis-Dreyfus opens up about her road to recovery after breast cancer in new interviews.", "news_keywords": "Julia Louis-Dreyfus, Veep", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Evan Real", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1139702, "title": "Julia Louis-Dreyfus on Life After Breast Cancer Diagnosis: \"I'm Grateful\"", "published_at": "2018-09-04 13:36:21", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/gettyimages-468844246-h_2017_0.jpg?w=1024", "comment_count": 0, "tags": "Veep", "topics": "TV News", "body": "Weeks after returning to the set of Veep for its seventh and final season, Julia Louis-Dreyfus is opening up about the breast cancer diagnosis that forced her to press pause on production of the hit HBO comedy.\r\nSpeaking with InStyle for a profile published Tuesday, the 57-year-old actress explained how she's changed from her battle against the disease, which she was diagnosed with in September 2017.\r\n\"I do feel different, but I can’t quite articulate how. I’ve come out the other side of this, and I’m still not exactly sure how to define the difference other than to say I’m grateful, of course, but it’s more than that,\" she told the magazine. \"It’s bigger.\"\r\nLouis-Dreyfus also stressed that she's hopeful to close this chapter in her life, which included three rounds of chemotherapy.\r\n\"I’m not someone who likes looking back. I look forward. That’s how I operate. We’ll finish an episode, and I am just ready for the next thing,\" she added. “I’m always just moving on, you know?\"\r\nPart of the \"next thing\" for Louis-Dreyfus is advocating for other breast cancer patients. The Seinfeld alum has signed on to her first cancer awareness initiative, helping Carolina Herrera designer Wes Gordon design a T-shirt for Saks Fifth Avenue's 20th year raising money through its Key to the Cure program.\r\n\"Saks Fifth Avenue asked if I wanted to be their Key to the Cure ambassador, and it seemed like a good fit and the timing worked out well,\" said Louis-Dreyfus, adding that the money raised will benefit the AiRS (Alliance in Reconstructive Surgery) Foundation, which offers financial support to breast cancer patients who can't afford reconstructive surgery. The limited-edition shirt will sell for $35 at Saks stores during the month of October.\r\n\"There are plenty of women who decide not to get reconstruction, which is fine,\" said Louis-Dreyfus. \"But if you want it and can’t afford it, that’s heartbreaking to me. The gap between the haves and the have-nots in our country — it’s a very wide divide right now. I’m lucky enough to be in a union where I get fabulous benefits. Not everyone is so lucky.\"\r\nAside from helping others, the Emmy-winning star said in another interview with the Associated Press that she couldn't be happier to settle back into her character Selina Meyer's shoes on the set of Veep. \"I feel good. I feel strong. I've got energy and, yeah, back to my old tricks,\" she said. \"It feels like I never left.\"\r\nOn Aug. 16, Louis-Dreyfus took to social media to share a touching moment before the first shot of season seven. \"I really appreciate everyone coming back — working it out to come back. I'm very grateful, thank you very much,\" the actress said in a video, addressing her cast and crew. \"So deeply grateful to be back together with all these superb people,\" she captioned the post.\r\nAfter Louis-Dreyfus announced her breast cancer diagnosis, the show catered its schedule around its star while she underwent treatment. Season six of Veep, which aired its finale in June 2017, ended with Meyer deciding to run for president again and rescinding her plan to settle into life as an ex-president. \r\nVeep is expected to return next spring.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Julia Louis-Dreyfus on Life After Breast Cancer Diagnosis: “I’m Grateful”", "url": "https://www.hollywoodreporter.com/tv/tv-news/julia-louis-dreyfus-life-breast-cancer-diagnosis-1139702/", "description": "‘Veep’ star Julia Louis-Dreyfus opens up about her road to recovery after breast cancer in new interviews.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/gettyimages-468844246-h_2017_0.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2018-09-04T13:36:21+00:00", "modified_time": "2018-09-04T15:01:31+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Julia Louis-Dreyfus on Life After Breast Cancer Diagnosis: “I’m Grateful”", "description": "‘Veep’ star Julia Louis-Dreyfus opens up about her road to recovery after breast cancer in new interviews.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/08/gettyimages-468844246-h_2017_0.jpg?w=1296"}}, "movies": [], "publish_date": 1536068181.0, "source": "https://www.hollywoodreporter.com", "summary": ""}