{"url": "https://web.archive.org/web/20170315014327/http://riverdale.wikia.com:80/wiki/Hermione_Lodge", "text": "\"Yeah, we're surviving, Ronnie, by our wits, because that's what we Lodge women do. If Dad could see us now.\" —Hermione to Veronica[src]\n\nHermione Lodge is a recurring character on Riverdale. She is portrayed by Marisol Nichols.\n\nHermione is the wife of Hiram Lodge and the mother of Veronica Lodge.\n\nContents show]\n\nCharacter description Edit\n\nHermione has now returned to Riverdale, eager to start afresh with her daughter following the scandalous incarceration of her husband.[3]\n\nBiography Edit\n\nEarly life Edit\n\nHermione grew up in Riverdale, during that time, she would go on to date Fred Andrews. After she broke up with him, she married Hiram Lodge and the two moved to New York City. Together they had a daughter, Veronica. After Hiram was arrested for fraud and embezzlement, Hermione and Veronica left the New York City and moved back to Riverdale. Hermione owns the luxurious apartment building, The Pembrooke, where she currently resides with her daughter.\n\nSeason 1 Edit\n\nHermione and her daughter, Veronica, pulled up to the Pembrooke, their new place of residence. She informed her daughter that while it may be small, the apartment is of top quality. Not to mention that it's the only piece of property in her name, and not her husband's. She was welcomed by Smithers, as they entered the building. Having been craving one of Pop Tate's cheeseburgers since noon, she and Veronica headed to the shoppe soon after. Her next move was to seek out employment, starting with Fred Andrews at Andrews Construction. She noticed on his website that he was in need of a seasonal hire. They briefly discussed their complicated past, in which she left him for the rich kid. Fred explained that If it was up to him, he would hire Hermione, however, it isn't that simple, he can't have the wife of Hiram Lodge, who is currently on trial for fraud and embezzlement, balancing his books. Hermione returned home to find a bag of money, awaiting her.[4]\n\nIn spite of her forced smile, Hermione is unquestionably miserable at her new place of employment, Pop's Chock'lit Shoppe. Although, her first week is going better than Veronica's. Their surviving by their wits because that's what the Lodge women do. She couldn't even imagine what Hiram would say if he saw them in their current state, which for Hermione, was more of a Joan Crawford/Mildred Pierce look. As a red-headed boy entered the diner, who she referred to as a heart-breaker, Hermione quickly caught on to the awkward exchange going on between him and her daughter. It wasn't long before she discovered that he was Fred Andrews' son, Archie. Hoping it would force them to get past their issues, Hermione volunteered Archie to walk Veronica home. [5]\n\nBefore she left for work, Hermione asked Veronica how her date with Chuck Clayton went, unfortunately, it didn't go well. That night, she worked catering for the Taste of Riverdale. Once there, she had brief run-ins with a couple familiar faces, the first being Fred Andrews. It wasn't long before she met face-to-face with her former rival, Alice Cooper. From her, Hermione learned that Veronica was being slut-shamed at school. After discovering what Veronica and Betty had resorted to in order to expose Chuck Clayton and the football team, Hermione managed to negotiate a lesser punishment for the two avenging angels. [6]\n\nA brief tiff took place between Hermione and Cheryl Blossom, as she worked the night shift at the diner. Cheryl wanted to make sure that all her money went into the register, since the Lodges are known for having sticky fingers. In response to Cheryl's nasty attitude, Hermione informed her that she went to school with Cheryl's mother, and that she didn't know the difference between having money, and having class either. Right outside the diner, behind a dumpster, Hermione engaged in a heated argument with the leader of the Southside Serpents. She would later come to find out that her clandestine meeting, wasn't so clandestine after all, as Veronica confronted her on the topic, she reminded Veronica that she grew up in Riverdale, Southside serpents may be dangerous thugs, but she attended high school with some of them.\n\nHermione secretly donated a large sum of money to Mayor McCoy's re-election campaign, in exchange, Lodge industry gets the Twilight Drive-In. That night, she and Fred attended the drive-in together, they recalled senior year at the drive-in, where they shared a kiss, briefest of flings, Hermione said. In an ally, behind the drive-in, Hermione handed FP Jones, a brown bag filled with money, he claimed the money was short, and that he'd have to pay Hiram a visit, but as long as he's in jail, the serpents will have to deal with her. She is confronted by Veronica immediately following her return home, Veronica witnessed the transaction that took place at the drive-in. Hermione explained that she was handling business for Hiram, who had hired the serpents to decrease the value of the drive-ins land, so that they could purchase it at a cheaper price. Hiram is a business man, he saw an opportunity, so he took it, besides, old Riverdale was dying out regardless. The only way for them to regain their wealth, is through business opportunities such as the drive-in. [7]\n\nAs Hermione worked her shift at the diner, Fred arrived to pick up his order, before leaving, he asked her out on a date, to which Hermione replied, they're both married, and that the outing at the Twilight Drive-In the previous night, was not a date. With the shoppe empty, Hermione began to clean, it wasn't until she heard a noise that she made her way to the front. Inside a box laying on the ground, was a dangerous rattle snake, she jumped back and screamed, then calling Fred for assistance in disposing of it. Fred would always be there for her, but he wondered why she wouldn't call the police or animal control, Hermione explained that she couldn't do that because she didn't trust the police, or half the people in Riverdale for that matter, only Fred. The snake was a message to her, from the Southside Serpents, Hiram owes them money. She then thanked Fred but insisted that she couldn't tell him anything else as she doesn't want to get him any more involved than he already is.\n\nIn spite of her feelings towards Penelope Blossom, Hermione attended the memorial of Jason Blossom to pay her respect, however, Penelope took it as a opportunity for Hermione to gloat. She unexpectedly ran into Fred at the memorial, she didn't think he would make it, after the incident that took place at the shoppe last night, Fred decided to finally give Hermione that Job as his book keeper. Later, at the The Pembrooke, Hermione explained to Veronica the antagonistic relationship between their family and the Blossoms, but she still felt bad for them due to the loss of their son. She then decided to tell Veronica about the incident from the prior night with the Serpents. [8]\n\nDuring Hermione's first day on the job as the bookkeeper for Andrews Construction, she made an unsettling discovery, Fred only had enough money in the bank to pay his guys for two more weeks. Fred would be putting his business at risk if he didn't fire some people, but he explained that he was waiting to here about the bid for the new development, in which the construction for could put him back in the black. However, he didn't know who the buyer was, but since Mayor McCoy was handling all the arrangements for the buyer, Fred figured he'd present her with the bid, and he'd like for Hermione to be his co-host, to which she agreed, Hermione also offered to have the diner at her place, since it's nicer. She then playfully touched Fred's chest, which quickly escalated to kissing, unbeknownst to either of them that Veronica was watching. Interrogation ensued immediately following her arrival home. Veronica asked if she'd be getting a divorce from Hiram after the kiss with Fred.\n\nShe was sorry that Veronica had to witness that, she also had no idea what would happen once Hiram returned, it just happened, and she doesn't know what she can do to help Veronica through it. As planned, she held the diner party at her home, from Mayor McCoy, she learned that the buyer was already in the process of accepting another bid, it would take the signature of two share holders to stop the process. The next day, she approached Veronica with the motion to award Fred the construction contract, Veronica refuse to sign, just as Hermione refused to stop seeing him, but Veronica's refusal was no difficult task to over come, Hermione forged her signature. Hermione and Fred then attended the 75th annual Variety Show together, they applauded as Veronica took the stage with Josie and the Pussycats, then as Archie took the stage. Afterwards, Hermione congratulated Fred on winning the contract for the new development, although, Veronica was not too happy to here that. [9]\n\nAfter forging Veronica's signature for the new development contract, Hermione would come to learn that this treacherous act would not go unpunished. Veronica retaliated like only a Lodge woman would, she began with purchasing a number of expensive items, which they could no afford, the money that they did have was barely enough to cover their living expenses. Another encounter with FP Jones, the leader of the Southside Serpents, led Hermione to wonder if he was there, at Andrews Construction to shake her down for the supposed money she still owed him. However, FP explained that he had already been compensated by Hiram. That night, she informed Veronica that she would not go out clubbing due to the fact that it was a school night, but Veronica had a get out of jail free pass, so Hermione submitted.\n\nVeronica wanted her mother to tell the truth about forging her signature. Hermione admitted that what she did was wrong, and that she'd tell Hiram, but this did not prevent Veronica from leaving. She awaited her daughter's return, so that the two of them could negotiate their terms. She has feelings for Fred Andrews, but she can't say what it means yet, as she doesn't know. As for Hiram, he made his own decisions, which distanced him from Hermione, now she has to make own decisions about moving forward with her life, she asked Veronica to accept her affair until they get more information. In return, Veronica demanded that whatever was happening between her and Fred couldn't happen at the Pembrooke, and that she'd have to tell Hiram about forging her signature.\n\nHermione agreed to both as long as the online shopping came to an end. With that, the negotiation had come to a closing, and both sides were happy with the arrangement. As promised, with Veronica at her side, Hermione told Hiram the truth about the contract with Andrews construction, and how she forged her daughter's signature. From Veronica, she learned that Polly Cooper was on the run, and needed a place to live, so Hermione provided her with a room, telling Polly she could stay for as long as she needed to. [10]\n\nPhysical Appearance Edit\n\nHermione is a very attractive middle-aged woman with tan skin, warm brown eyes, and long, wavy black hair. She is of average height, about 5'4\" with a thin build. When not in her standard Pop's Chock'lit Shoppe employee uniform, Hermione often dresses very stylish and classy.\n\nRelationships Edit\n\nAppearances Edit\n\nSeason 1 Edit\n\nGallery Edit\n\nImages Edit\n\nAdd an image\n\nVideos Edit\n\n02:21 Riverdale Marisol Nichols and Mädchen Amick Interview The CW", "images": ["https://web.archive.org/web/20170315014327im_/http://vignette1.wikia.nocookie.net/riverdalearchie/images/5/56/Season_1_Episode_4_The_Last_Picture_Show_Hermione_on_her_laptop.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312181923", "https://web.archive.org/web/20170315014327im_/http://vignette2.wikia.nocookie.net/riverdalearchie/images/b/bb/Season_1_episode_7_In_a_Lonely_Place_Hermione_Veronica_3.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20170313195347", "https://web.archive.org/web/20170315014327im_/http://vignette3.wikia.nocookie.net/riverdalearchie/images/e/ea/Season_1_Episode_1_The_River%27s_Edge_Hermione_on_laptop.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312181136", "https://web.archive.org/web/20170315014327im_/http://vignette1.wikia.nocookie.net/riverdalearchie/images/d/d1/Season_1_Episode_1_The_River%27s_Edge_Hermione_drinking.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312181136", "https://web.archive.org/web/20170315014327im_/http://vignette4.wikia.nocookie.net/riverdalearchie/images/6/6b/Season_1_Episode_4_The_Last_Picture_Show_Hermione_1.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20170311024707", "https://web.archive.org/web/20170315014327im_/http://vignette3.wikia.nocookie.net/riverdalearchie/images/6/61/Season_1_Episode_7_In_a_Lonely_Place_Hermione_Veronica_2.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20170313195332", "https://web.archive.org/web/20170315014327im_/http://vignette4.wikia.nocookie.net/riverdalearchie/images/1/1a/Season_1_Episode_6_Faster%2C_Pussycats%21_Kill%21_Kill%21_Hermione_and_Fred_kissing.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312182544", "https://web.archive.org/web/20170315014327im_/http://vignette3.wikia.nocookie.net/riverdalearchie/images/7/7f/Season_1_Episode_4_The_Last_Picture_Show_Hermione_talking_to_Cheryl.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312181926", "https://web.archive.org/web/20170315014327im_/http://vignette4.wikia.nocookie.net/riverdalearchie/images/d/d7/Season_1_Episode_1_The_River%27s_Edge_Hermione_and_Veronica_at_Pembrooke.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312181132", "https://web.archive.org/web/20170315014327im_/http://vignette1.wikia.nocookie.net/riverdalearchie/images/5/5b/Riverdale_Marisol_Nichols_and_M%C3%A4dchen_Amick_Interview_The_CW/revision/latest/scale-to-width-down/185?cb=20170222193946", "https://web.archive.org/web/20170315014327im_/http://a.wikia-beacon.com/__track/view?cb=1489493951&c=1063533&lc=en&lid=75&x=riverdalearchie&y=c6&u=0&a=2343&s=oasis&beacon=&n=0&nojs=1", "https://web.archive.org/web/20170315014327im_/http://vignette3.wikia.nocookie.net/riverdalearchie/images/2/20/Season_1_Episode_4_The_Last_Picture_Show_Hermione_3.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20170312173534", "https://web.archive.org/web/20170315014327im_/http://vignette4.wikia.nocookie.net/riverdalearchie/images/a/a5/Season_1_Episode_1_The_River%27s_Edge_Hermione_returns_home.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312181137", "https://web.archive.org/web/20170315014327im_/http://vignette2.wikia.nocookie.net/riverdalearchie/images/b/b4/Season_1_Episode_7_In_a_Lonely_Place_Hermione_1.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20170313154951", "https://web.archive.org/web/20170315014327im_/http://vignette2.wikia.nocookie.net/riverdalearchie/images/e/ea/Season_1_Episode_4_The_Last_Picture_Show_Hermione_after_transaction.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312181137", "https://web.archive.org/web/20170315014327im_/http://vignette3.wikia.nocookie.net/riverdalearchie/images/2/29/Season_1_Episode_4_The_Last_Picture_Show_Hermione_explaining.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312181921", "https://web.archive.org/web/20170315014327im_/http://vignette2.wikia.nocookie.net/riverdalearchie/images/0/07/Hermione_Lodge_Promotional_Photo.jpg/revision/latest?cb=20170104012733", "https://web.archive.org/web/20170315014327im_/http://vignette1.wikia.nocookie.net/riverdalearchie/images/3/3b/Season_1_Episode_6_Faster%2C_Pussycats%21_Kill%21_Kill%21_Hermione_smiling_at_diner.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312182549", "https://web.archive.org/web/20170315014327im_/http://vignette3.wikia.nocookie.net/riverdalearchie/images/d/d7/Season_1_Episode_4_The_Last_Picture_Show_Hermione_2.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20170311024726", "https://web.archive.org/web/20170315014327im_/http://vignette2.wikia.nocookie.net/riverdalearchie/images/0/07/Hermione_Lodge_Promotional_Photo.jpg/revision/latest/top-crop/width/240/height/240?cb=20170104012733", "https://web.archive.org/web/20170315014327im_/http://pixel.quantserve.com/pixel/p-8bG6eLqkH6Avk.gif", "https://web.archive.org/web/20170315014327im_/http://vignette2.wikia.nocookie.net/riverdalearchie/images/9/97/Season_1_Episode_4_The_Last_Picture_Show_Hermione_at_drive_in.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312181920", "https://web.archive.org/web/20170315014327im_/http://vignette1.wikia.nocookie.net/riverdalearchie/images/8/85/Season_1_Episode_4_The_Last_Picture_Show_Hermione_smiling_with_fred.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312181925", "https://web.archive.org/web/20170315014327im_/http://vignette3.wikia.nocookie.net/riverdalearchie/images/8/89/Season_1_Episode_4_The_Last_Picture_Show_Hermione_with_bag_of_money.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312181929", "https://web.archive.org/web/20170315014327im_/http://vignette4.wikia.nocookie.net/riverdalearchie/images/2/20/Season_1_Episode_5_Heart_of_Darkness_Hermione_and_Penelope.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312182235", "https://web.archive.org/web/20170315014327im_/http://vignette3.wikia.nocookie.net/riverdalearchie/images/e/e8/Season_1_Episode_1_The_River%27s_Edge_Hermione_at_Andrews_construction.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312181135", "https://web.archive.org/web/20170315014327im_/http://vignette3.wikia.nocookie.net/riverdalearchie/images/9/91/Season_1_Episode_5_Heart_of_Darkness_Hermione_and_Fred.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312182234", "https://web.archive.org/web/20170315014327im_/http://slot1.images.wikia.nocookie.net/__cb1489493951/common/extensions/wikia/WikiaBar/images/wikiabarIcon.png", "https://web.archive.org/web/20170315014327im_/http://vignette2.wikia.nocookie.net/riverdalearchie/images/b/be/Season_1_Episode_4_The_Last_Picture_Show_Hermione_telling_Veronica_the_truth.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312181926", "https://web.archive.org/web/20170315014327im_/http://vignette2.wikia.nocookie.net/riverdalearchie/images/6/66/Season_1_Episode_1_The_River%27s_Edge_Hermione_asking_for_a_job.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312181134", "https://web.archive.org/web/20170315014327im_/http://vignette2.wikia.nocookie.net/riverdalearchie/images/0/07/Hermione_Lodge_Promotional_Photo.jpg/revision/latest/scale-to-width-down/350?cb=20170104012733", "https://web.archive.org/web/20170315014327im_/http://vignette2.wikia.nocookie.net/riverdalearchie/images/b/b4/Season_1_Episode_4_The_Last_Picture_Show_Hermione_with_Veronica.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312182233", "https://web.archive.org/web/20170315014327im_/http://vignette1.wikia.nocookie.net/riverdalearchie/images/b/b6/Season_1_Episode_4_The_Last_Picture_Show_Hermione_and_Veronica.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312181138", "https://web.archive.org/web/20170315014327im_/http://vignette3.wikia.nocookie.net/riverdalearchie/images/8/87/Season_1_Episode_5_Heart_of_Darkness_Hermione_decline_Fred%27s_offer.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312182235", "https://web.archive.org/web/20170315014327im_/http://vignette2.wikia.nocookie.net/riverdalearchie/images/9/9a/Season_1_Episode_6_Faster%2C_Pussycats%21_Kill%21_Kill%21_Hermione_closeup.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312182546", "https://web.archive.org/web/20170315014327im_/http://b.scorecardresearch.com/p?c1=2&c2=6177433&c3=&c4=&c5=&c6=&c7=http%3A%2F%2Friverdale.wikia.com%2Fwiki%2FHermione_Lodge%3Fcomscorekw%3Dwikiacsid_tv&c15=&cv=2.0&cj=1", "https://web.archive.org/web/20170315014327im_/http://vignette3.wikia.nocookie.net/riverdalearchie/images/0/01/Season_1_Episode_4_The_Last_Picture_Show_Hermione_and_FP.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312181138", "https://web.archive.org/web/20170315014327im_/http://vignette3.wikia.nocookie.net/riverdalearchie/images/f/fa/Season_1_Episode_5_Heart_of_Darkness_Hermione_telling_Fred_about_the_threat.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312182238", "https://web.archive.org/web/20170315014327im_/http://vignette2.wikia.nocookie.net/riverdalearchie/images/5/5b/Season_1_Episode_6_Faster%2C_Pussycats%21_Kill%21_Kill%21_Hermione_first_day_on_the_job.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312182547", "https://web.archive.org/web/20170315014327im_/http://vignette4.wikia.nocookie.net/riverdalearchie/images/8/89/Wiki-wordmark.png/revision/latest?cb=20170123235932", "https://web.archive.org/web/20170315014327im_/http://vignette2.wikia.nocookie.net/riverdalearchie/images/b/b9/Season_1_Episode_5_Heart_of_Darkness_Hermione_washing_dishes.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312182239", "https://web.archive.org/web/20170315014327im_/http://vignette4.wikia.nocookie.net/riverdalearchie/images/3/34/Season_1_Episode_6_Faster%2C_Pussycats%21_Kill%21_Kill%21_Hermione_close_up.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312182545", "https://web.archive.org/web/20170315014327im_/http://vignette1.wikia.nocookie.net/riverdalearchie/images/2/20/Season_1_Episode_5_Heart_of_Darkness_Hermione_opening_box.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312182236", "https://web.archive.org/web/20170315014327im_/http://vignette3.wikia.nocookie.net/riverdalearchie/images/7/76/Season_1_Episode_5_Heart_of_Darkness_Hermione_scared.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312182236", "https://web.archive.org/web/20170315014327im_/http://vignette3.wikia.nocookie.net/riverdalearchie/images/d/df/Season_1_Episode_5_Heart_of_Darkness_Hermione_talking_to_Fred.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312182238", "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D", "https://web.archive.org/web/20170315014327im_/http://vignette1.wikia.nocookie.net/riverdalearchie/images/1/1e/Season_1_Episode_4_The_Last_Picture_Show_Hermione_serving.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312181924", "https://web.archive.org/web/20170315014327im_/http://vignette3.wikia.nocookie.net/riverdalearchie/images/7/7a/Season_1_Episode_5_Heart_of_Darkness_Hermione_smiling.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312182237", "https://web.archive.org/web/20170315014327im_/http://vignette3.wikia.nocookie.net/riverdalearchie/images/7/78/Season_1_Episode_6_Faster%2C_Pussycats%21_Kill%21_Kill%21_Hermione_talking.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312182549", "https://web.archive.org/web/20170315014327im_/http://vignette3.wikia.nocookie.net/riverdalearchie/images/b/b5/Season_1_Episode_6_Faster%2C_Pussycats%21_Kill%21_Kill%21_Hermione_and_Fred_hug.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312182543", "https://web.archive.org/web/20170315014327im_/http://vignette1.wikia.nocookie.net/riverdalearchie/images/f/fb/Season_1_Episode_6_Faster%2C_Pussycats%21_Kill%21_Kill%21_Hermione_explaining_to_Veronica_the_kiss.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312182546", "https://web.archive.org/web/20170315014327im_/http://vignette2.wikia.nocookie.net/riverdalearchie/images/4/4d/Season_1_Episode_4_The_Last_Picture_Show_Hermione_4.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20170312173553", "https://web.archive.org/web/20170315014327im_/http://vignette2.wikia.nocookie.net/riverdalearchie/images/2/26/Hermione_Lodge_Promotional_Image.jpg/revision/latest/zoom-crop/width/240/height/240?cb=20170124190805", "https://web.archive.org/web/20170315014327im_/http://vignette2.wikia.nocookie.net/riverdalearchie/images/a/a0/Season_1_Episode_4_The_Last_Picture_Show_Hermione_close_up.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312181921", "https://web.archive.org/web/20170315014327im_/http://vignette3.wikia.nocookie.net/riverdalearchie/images/9/92/Season_1_Episode_6_Faster%2C_Pussycats%21_Kill%21_Kill%21_Hermione_listening_to_the_proposal.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312182548", "https://web.archive.org/web/20170315014327im_/http://vignette3.wikia.nocookie.net/riverdalearchie/images/9/98/Season_1_Episode_1_The_River%27s_Edge_Hermione_recieves_a_bag_of_money.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312181137", "https://web.archive.org/web/20170315014327im_/http://vignette1.wikia.nocookie.net/riverdalearchie/images/9/99/Season_1_Episode_4_The_Last_Picture_Show_Hermione_vs_FP.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312181928", "https://web.archive.org/web/20170315014327im_/http://vignette2.wikia.nocookie.net/riverdalearchie/images/3/37/Season_1_Episode_6_Faster%2C_Pussycats%21_Kill%21_Kill%21_Hermione_looking_Veronica_in_her_eyes.png/revision/latest/zoom-crop/width/240/height/240?cb=20170312182548"], "top_img": "https://web.archive.org/web/20170315014327im_/http://vignette2.wikia.nocookie.net/riverdalearchie/images/0/07/Hermione_Lodge_Promotional_Photo.jpg/revision/latest?cb=20170104012733", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20170315014327/http://riverdale.wikia.com/wiki/Hermione_Lodge", "title": "Hermione Lodge", "meta_data": {"viewport": "width=device-width, initial-scale=1.0, user-scalable=yes", "generator": "MediaWiki 1.19.24", "keywords": "Riverdale Wiki,riverdalearchie,Hermione Lodge,Character,Hiram Lodge,Veronica Lodge,Marisol Nichols,Roberto Aguirre-Sacasa,Lee Toland Krieger,Chapter One: The River's Edge,Riverdale,Season 1,The CW", "description": "Hermione Lodge is a recurring character on Riverdale. She is portrayed by Marisol Nichols...", "twitter": {"card": "summary", "site": "@getfandom", "url": "https://web.archive.org/web/20170315014327im_/http://riverdale.wikia.com/wiki/Hermione_Lodge", "title": "Hermione Lodge | Riverdale Wiki | Fandom powered by Wikia", "description": "Hermione Lodge is a recurring character on Riverdale. She is portrayed by Marisol Nichols. Hermione is the wife of Hiram Lodge and the mother of Veronica Lodge."}, "fb": {"app_id": 112328095453510}, "og": {"type": "article", "site_name": "Riverdale Wiki", "title": "Hermione Lodge", "description": "Hermione Lodge is a recurring character on Riverdale. She is portrayed by Marisol Nichols. Hermione is the wife of Hiram Lodge and the mother of Veronica Lodge.", "url": "https://web.archive.org/web/20170315014327/http://riverdale.wikia.com/wiki/Hermione_Lodge", "image": "https://web.archive.org/web/20170315014327im_/http://vignette2.wikia.nocookie.net/riverdalearchie/images/0/07/Hermione_Lodge_Promotional_Photo.jpg/revision/latest?cb=20170104012733"}, "apple-itunes-app": "app-id=422467074, app-arguments=http://riverdale.wikia.com/wiki/Hermione_Lodge"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}