{"url": "https://en.wikipedia.org/wiki/Guardians_of_the_Galaxy_%E2%80%93_Mission:_Breakout!", "text": "Theme park attraction at Disney California Adventure theme park in Anaheim.\n\nGuardians of the Galaxy – Mission: Breakout! is an accelerated drop tower dark ride attraction at the Disney California Adventure park at the Disneyland Resort. Based on the characters from the Marvel Cinematic Universe (specifically those from the Guardians of the Galaxy films), it depicts Rocket recruiting guests to attempt to free the remaining Guardians of the Galaxy from display within the Collector's fortress.[1]\n\nThe attraction uses the same infrastructure and ride system as the previous attraction, The Twilight Zone Tower of Terror.[3] It features several actors of the cast from the Marvel Studios film series reprising their characters.[4] While the attraction is inspired by the Marvel Cinematic Universe, it is set in a separate shared universe along with the other Avengers Campus attractions.[5][6][7]\n\nIt opened on May 27, 2017, to coincide with the release of Guardians of the Galaxy Vol. 2.[1][2]\n\nDevelopment [ edit ]\n\nAnnounced at the 2016 San Diego Comic-Con, the attraction replaced The Twilight Zone Tower of Terror, which closed on January 3, 2017.[1][8][9][10] It is the first Disney attraction based on Marvel Comics characters in the United States, and was incorporated into Avengers Campus at Disney California Adventure in June 2021.[11][12][13][14] It was then surrounded by a layer of markings on the ground that imply a cosmic energy which resulted when the fortress was transported from across the galaxy to the campus. The markings are inspired by the Kirby Krackle, based on the artwork of the late Marvel Comics artist Jack Kirby.[15]\n\nChris Pratt, Zoe Saldana, Dave Bautista, Benicio del Toro, and Bradley Cooper reprise their roles as Peter Quill / Star-Lord, Gamora, Drax, Taneleer Tivan / The Collector, and the voice of Rocket, respectively.[16][17] Vin Diesel did not reprise his role of Groot, and was replaced by voice actor Fred Tatasciore. Due to Marvel's 1994 contract with Universal Parks & Resorts (pre-dating Disney's 2009 purchase of Marvel Entertainment), the Marvel brand is not allowed to be used as part of the ride's title or advertising.[18] James Gunn directed all of the scenes involving the cast.\n\nRide experience [ edit ]\n\nThe attraction is based in the Collector's fortress-esque collection called the Tivan Collection, as seen in the film Guardians of the Galaxy. The Collector (Taneleer Tivan) is showing off his latest acquisitions, the Guardians of the Galaxy, in customized display cases. However, Rocket has secretly escaped his case and asks the guests for help. Guests then board a gantry lift, where they help Rocket try to free the other Guardians.[1]\n\nQueue and preshow [ edit ]\n\nGuests first pass through the entrance sign and begin in the outdoor queue area. There are extended queue areas on both sides of the path. After passing the gold statue, guests enter the main floor which is meant to resemble the interior of the Collector's archive.[19] The archive itself houses a number of interactive artifacts. A video plays on loop of the Collector and his new assistant revealing that they have a new addition to the Tivan Collection, the Guardians of the Galaxy themselves. It is revealed through their banter that the Guardians, specifically Peter Quill, were tricked into coming to visit as they thought they too were going to be given a tour of the facility. The Collector has their glass cases electrified so that the team cannot escape, yet Rocket is still determined to get out (and later, it is revealed that he managed to escape his case). The Collector reveals to the guests that they can access the facility once their biological signs are scanned into the system and then all they have to do is raise their hands for clearance.\n\nAfterwards, the guests are led into the Collector's office where another video of himself begins playing. Suddenly Rocket, portrayed through an audio animatronic, enters the room through a vent and hijacks the video to explain his plan for rescuing his friends. (In the event of an animatronic malfunction, a CGI version of Rocket will appear on the screen to hijack the Collector's spiel) The guests will use their access passes (their hand scan) for access in the lift while Rocket rides on top to blow up the generator so that the Guardians, as well as the other creatures in the collection, can escape. The Guardians will then reunite with Mantis who will arrive with their ship so that they can make a quick getaway. On his way out of the Collector's office, Rocket grabs Quill's walkman.\n\nRide [ edit ]\n\nMission Breakout has two \"gantry lifts\", two boarding levels and one shaftway, allowing guests to board one lift while the shaft is in use by the other. Both gantry lifts are pushed into and pulled out of the shaftway by a mechanical arm in front of the exit doors.[20]\n\nAfter guests are seated in the gantry lift, the Collector tells the riders that \"this is the moment you've been waiting for.\" However, Rocket unplugs the system and inserts Quill's walkman, queued up to one of six classic rock songs. The lift quickly rises up to the generator room where Rocket blows it up, opening the cages and freeing the team, but also cutting the power to the gantry lift. Rocket tries to regain control as the lift accelerates up and down, and guests see the Guardians entangled in various situations, as well as getting a brief view of Disneyland. As soon as the on-ride camera takes photos of the riders, the lift begins to drop once again. Rocket finally restores power and the lift drops down to show the Guardians reunited along with Mantis and Cosmo the Spacedog. Quill and Gamora thank the guests for their help, but as the lift resets itself, Drax is heard asking why they are thanking them as all the guests did was sit through the whole ordeal and did not actually do any fighting.\n\nAs guests leave the gantry lift and exit down a corridor, the sounds of the escaping creatures can be heard. The Collector can be heard over the intercom, upset over the loss of the Guardians and his creatures. Howard the Duck can also occasionally be heard, mocking the Collector's misfortune and bidding guests farewell.\n\nMusic and drop sequences [ edit ]\n\nTyler Bates, composer of the Guardians of the Galaxy films, wrote the incidental music for the attraction's queue.[21] There are six different drop sequences of the ride, each synced to its own visuals and songs,[22] some of which were suggested by Gunn.[23][24]\n\n\"I Want You Back\" by The Jackson 5: The first scenario is of the Guardians jumping from their confinement, only for Drax to get captured by a tentacled monster. The second scenario shows Quill kicking a rat-like creature into the cages before being attacked by a group of them.\n\n\"Hit Me with Your Best Shot\" by Pat Benatar: The first scenario shows Peter Quill shooing away the tentacled monster, ending with the both of them and Gamora (who is in the same scenario) running from a fleet of security drones. The next scenario shows a giant, gargoyle-like creature jumping up and roaring at the guests. Drax jumps out of the creature's mouth, punches it on the nose and laughs. He then says to the guests, \"You're welcome!\"\n\n\"Give Up the Funk\" by Parliament: The first scenario has Quill and Gamora in the tentacles of the tentacled monster, with Quill and Gamora asking Rocket for help. The following scenario shows Quill kicking a rat-like creature into the cages before being attacked by a group of them.\n\n\"Free Ride\" by The Edgar Winter Group: The first scenario is of the Guardians shooting at the oncoming attacks before Baby Groot pushes a red button that turns off the artificial gravity. The next scenario, respectively, shows everything floating while Quill tells Baby Groot to press the button that puts on the artificial gravity. He does, but everything in the collection falls, including the Gantry Lift.\n\n\"Burning Love\" by Elvis Presley: The first scenario is of the Guardians jumping from their confinement, only for Drax to get captured by the tentacled monster. The second scenario shows the giant, gargoyle-like creature jumping up and roaring at the guests. Drax jumps out of the creature's mouth, punches it on the nose and laughs. He then says to the guests, \"You're welcome!\"\n\n\"Born to Be Wild\" by Steppenwolf: The first scenario has Quill and Gamora in the tentacles of the tentacled monster, with Quill and Gamora shouting at Rocket for help. The following scene, respectively, shows Quill shooing away the monster, ending with the both of them and Gamora (who is in the same scenario) running from a fleet of security drones.\n\nCast [ edit ]\n\nCollector's archive [ edit ]\n\nWithin the waiting area, guests are allowed to view the many items in the Collector's archive. The artifacts are expected to be in rotation.[29] Various items from Guardians of the Galaxy, the Marvel Universe, and inactive audio-animatronics from Disney attractions are present including:\n\nMore items are located in the Collector's office including:\n\nIn addition, in the video message from the Collector there is a maquette of a ghost dog from The Haunted Mansion on the table.\n\nWhen guests enter the maintenance room before entering the gantry lift more items can be found such as:\n\nMonsters After Dark [ edit ]\n\nIn August 2017, it was announced that the attraction would receive a new experience during Halloween Time at the Disneyland Resort called Guardians of the Galaxy – Monsters After Dark. The experience is offered after sunset each night from early September through October 31. The storyline of Monsters After Dark takes place chronologically after the events of Mission Breakout!; the Guardians have just escaped but accidentally left Groot behind. Rocket returns and has guests distract all of the escaped creatures so he can find and rescue Groot. One of the creatures in Monsters After Dark is Surtur's Fire Dragon, which also appears in Thor: Ragnarok. The experience also features a new song titled \"Monsters After Dark\" written by Tyler Bates.[35][36] On October 31, the attraction operated as Monsters After Dark all day.[37] The song was released as a digital single on iTunes on November 2, 2017.[38] It returned for the Halloween season in 2018 and 2019 with no changes.\n\nThe ghost of Yondu Udonta (Michael Rooker) briefly appears wandering the hallways of the archive in the pre-show.[39]\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Global_thinking.svg/10px-Global_thinking.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/7/72/Symbol_project_class.svg/16px-Symbol_project_class.svg.png", "https://upload.wikimedia.org/wikipedia/en/1/10/Guardians_of_the_Galaxy_%E2%80%93_Mission_Breakout%21_Logo.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b1/Fastpass_availability_icon.svg/20px-Fastpass_availability_icon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/Disney_California_Adventure_%2846839185762%29.jpg/290px-Disney_California_Adventure_%2846839185762%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/44/Attraction_transfer_icon.svg/20px-Attraction_transfer_icon.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/10/Guardians_of_the_Galaxy_%E2%80%93_Mission_Breakout%21_Logo.jpg/250px-Guardians_of_the_Galaxy_%E2%80%93_Mission_Breakout%21_Logo.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/1/10/Guardians_of_the_Galaxy_%E2%80%93_Mission_Breakout%21_Logo.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Guardians_of_the_Galaxy_%E2%80%93_Mission:_Breakout!", "title": "Guardians of the Galaxy – Mission: Breakout!", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/1/10/Guardians_of_the_Galaxy_%E2%80%93_Mission_Breakout%21_Logo.jpg", "width": 640, "height": 360}, "title": "Guardians of the Galaxy – Mission: Breakout! - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}