{"url": "https://people.com/tv/kim-kardashian-life-after-paris-robbery-2/", "text": "It’s been one year since Kim Kardashian West‘s terrifying Paris heist — and she has come a long way.\n\nOn Oct. 3, 2016, the Keeping Up with the Kardashians star was robbed at gunpoint at the No Address Hotel during Paris Fashion Week, when masked men stole millions of dollars worth of jewelry from her in the middle of the night — including a $4 million ring. (For more on the incident, here’s everything you need to know.)\n\nIn the 12 months since, Kardashian West has undergone a mental and physical transformation, celebrated career milestones and confirmed that she’s expecting her third child with husband Kanye West. Here’s a look back at how she rebuilt her life over the course of a challenging, eventful year.\n\nSpotlight Shutdown\n\nMultiple sources confirmed to PEOPLE that the star was deeply shaken by the traumatic experience, and following the robbery, Kardashian West, 36, immediately returned to the United States and retreated entirely from the spotlight — both physically and digitally.\n\n“She has zero desire to resume her old life,” a source told PEOPLE. “She’s still figuring out what she wants to do. Her whole life has basically changed. Before, she was like a social butterfly — now she’s much more withdrawn.”\n\nThe star remained hunkered down at home in Los Angeles, spending time with West, 40, and their two kids: daughter North, 4, and son Saint, 1, with sources telling PEOPLE that Kardashian West would only leave her house “for overnight visits with the kids to Kris [Jenner]‘s and for important appointments.”\n\n“The only ‘positive’ thing about the robbery is that Kim changed pace,” a source told PEOPLE at the time. “Instead of working nonstop, her life has slowed down significantly. She seems happy about this.”\n\n“She very much likes spending every day with her kids,” the source added. “In the past, it was very hard for her to be away from her kids for work. Now she gets to wake up with her kids and go to sleep with her kids.”\n\nRinging in her 36th birthday just 18 days after the heist, Kardashian West kept things extremely low-key — a noticeable departure from her usual lavish celebrations. While she was scheduled to ring in the birthday at Las Vegas’ Hakkasan Nightclub, she canceled the appearance and stayed home with her family.\n\nFilming KUWTK Resumes\n\nThree weeks after the robbery, production officially resumed on the family’s reality show, and Kardashian West began stepping out in public here and there, either to grab frozen yogurt with friend Jonathan Cheban or to attend one of West’s concerts.\n\nOf her choice to step back in front of KUWTK cameras,sources told PEOPLE Kardashian West did take a break from filming directly after the robbery but gradually resumed a few weeks later — though it wasn’t due to any pressure from her famous siblings.\n\n“No one is pressuring her,” one insider said. “She has the best support from her family.”\n\nHer First Public Appearance\n\nSources told PEOPLE the incident “scared everyone” in the Kardashian/Jenner orbit.\n\n“They’re not taking chances,” one insider said. “It was a really scary situation for the entire family, and it’s just not worth it to put themselves out there unnecessarily. When something like this happens, everything changes. It changes the whole family — how and where they travel.”\n\nBy mid-November, Kardashian West began planning to re-emerge into the public eye “slowly,” according to sources. To mark her first public appearance since the robbery, she selected the 2016 Angel Ball — which honored her late father Robert Kardashian, who died of esophageal cancer in 2003 — but West’s hospitalization for exhaustion that same night spurred a change of plans.\n\nShe ultimately skipped the black-tie gala, flying back to Los Angeles from New York City to be by her husband’s side — and her first public appearance ended up being her longtime makeup artist Mario Dedivanovic’s Masterclass on Jan. 13 in Dubai.\n\nSplash News Online\n\n“Kim was very emotional before the trip, and part of it was because she started thinking about the robbery,” a source told PEOPLE. “She’s getting sick of having to relive that awful night and just wants to move on.”\n\nA second insider told PEOPLE the star was “nervous before she left, but says it was the right decision.”\n\n“She was excited to spend time with her fans,” added the source.\n\nSocial Media Return\n\nThough her family and friends gradually took over her website and app to share exclusive content, Kardashian West’s Twitter and Instagram accounts remained completely dark for three full months after the robbery.\n\nShe officially returned to social media right before the Dubai trip, sharing a family photo of her, West and their two kids, on Instagram on Jan. 3.\n\nShe also debuted an heartwarming two-and-a-half-minute video on her website, offering fans a glimpse into life at home with her family. The home video montage included footage shot both before and after the Paris incident.\n\nLifestyle Changes\n\nThe robbery spurred a series of changes in Kardashian West’s life, from her physical appearance to her personal security.\n\n“[She will have] a much heavier security team,” a source told PEOPLE. “There will be a focus on security personnel who aren’t in traditional clothing, and a lot more undercover security.”\n\nOne month after the heist, Kardashian West also parted ways with family bodyguard Pascal Duvier, who was under her employment the night of the robbery but happened to be out shadowing her sisters, Kourtney, 37, and Kendall, 21, when the intruders broke in.\n\n“Pascal no longer works for Kim and Kanye, but he wasn’t fired,” a source told PEOPLE. “He instead reassigned himself to another family for professional reasons. Pascal thought that he did let down Kim and didn’t do his job properly in Paris. They all agreed that it was better for Kim and Kanye to hire a completely new security team.”\n\nINSTAR\n\nAs for her physical appearance? Kardashian West debuted a much more toned-down look than her previous glam self — swapping out her eye-catching diamonds for a much more subtle wedding band and ditching her chainmail and latex dresses in favor of baggy t-shirts, sweatpants and a fresh, contour-free face.\n\n“She’s definitely acting like a new Kim,” a source told PEOPLE. “She wears both minimal makeup and jewelry. The new Kim seems less flashy. It’s like she doesn’t need that now to be happy.”\n\nWorking on Her Marriage\n\nThe combination of Kardashian West’s robbery and West’s subsequent health crisis (spurred by his November hospitalization for exhaustion) led to months of marital strain as the couple was bombarded with rumors of divorce.\n\nNevertheless, the two worked hard to get back on track, and by early 2017, things appeared to be on the up and up.\n\n“They seem to be doing much better,” a source told PEOPLE in February, adding that Kardashian West seemed “much happier.”\n\n“They’re having fun together again,” the source said. “The struggles that they had for the past few months seem to have mostly past.”\n\nAt the time, the source confirmed West was still in therapy and receiving medical help.\n\n“It all seems to be helping him recover,” the source said. “Kim has nothing but great things to say about Kanye.”\n\nReliving the Terror\n\nPart of Kardashian West’s healing process after the robbery included having to relive the incident over and over again, especially as French authorities continued to make major headway in the case.\n\nOver the course of this year, the star and her family have openly discussed the robbery in several interviews — and on emotional episodes of KUWTK, which documented the aftermath in great detail.\n\n“Well, we are damned if we do and damned if we don’t,” sister Khloé told PEOPLE of the family’s decision to include that aspect of their lives on their reality show. “We are so vulnerable and [have opened] up our lives so much in the past that interestingly enough, if we don’t show things fans get really angry — they feel as if that was taken away from them.”\n\n“And I think for Kim, it was maybe therapeutic for her,” she added. “It’s also something that disgustingly happens to a lot of other people, and we always come from a place of honesty.”\n\nCareer Milestones\n\n2017 has been an exciting year for Kardashian West professionally: In addition to appearing on a slew of high-profile magazine covers and explanding her line of Kimoji merch, the reality star followe little sister Kylie Jenner‘s lead and launched her own beauty line in June.\n\nStefanie Keenan/Getty\n\nThe first product she created, a $48 crème contour and highlight kit, sold out in just three hours, bringing in an estimated $14.4 million. (The kits come in four different shades and include a contour pen, a highlight pen and a double-ended blending brush.)\n\nShe has since expanded the line with the launch of powder highlighter and contour kits.\n\nExpanding the Family\n\nAfter two high-risk pregnancies, Kardashian West is taking a different route for baby no. 3: surrogacy.\n\nIn June, sources confirmed to PEOPLE that the star and her husband had hired a surrogate to carry their third child. By Sept. 6, PEOPLE confirmed the surrogate is pregnant. A separate source later confirmed that Kardashian West and West are “thrilled” to be expecting a daughter in January.\n\n“The entire family is over the moon,” one insider said. “Kim had been looking for a surrogate for months until recently, when she found the perfect candidate. Given her health scares in the past, Kim felt the need to hire a surrogacy agency that helped serve as the liaison in finding a healthy woman who would be a great surrogate option for her and Kanye. Both of them have been super involved in the process.”\n\n“They want everything to be perfect and for the baby to be extremely healthy,” the source continued. “They don’t want any complications, and Kim is providing an ideal eating regimen and diet so everyone knows what the baby is consuming before it’s born.”\n\n“They can’t wait to add a new addition to their family and are just so incredibly happy,” another source said. “North isn’t the most thrilled to be a big sister again — she’s had the tendency to get really jealous about Saint and wants all of the attention to herself, but Kim and Kanye think it’s just a phase and are hoping she will grow out of it.”\n\nKardashian West confirmed that she and her husband are expecting in a recent sneak peek at this season of KUWTK.\n\n“What happens every time I say, ‘Guess what?’ ” she asked her sister Khloé, 33, in the teaser.\n\n“Pregnant, or the person’s pregnant,” Khloé responded.\n\n“We’re having a baby!” Kardashian West exclaimed.\n\nSeeing the Silver Lining\n\nKardashian West has often reflected on how her harrowing experience turned her into a “different person.”\n\n“It was probably no secret, you see it on the show — me being flashy — but I was definitely materialistic before,” she told Ellen DeGeneres in April. “Not that there’s anything bad about having things and working hard to get those things — and I’m really proud of everyone that’s around me that’s successful. But I’m so happy that my kids get this me. And that this is who is raising my kids. Because I just don’t care about that stuff anymore, I really don’t.”\n\n“I know this sounds crazy, but I know that was meant to happen to me,” she continued. “I don’t want to start crying, but … I’m such a different person. I really feel like things happen in your life to teach you things.”\n\nKeeping Up with the Kardashians airs Sundays (9 p.m. ET) on E!", "images": ["https://people.com/thmb/dqA8uVL6brhoHlWrnfe5mCGbgbI=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(536x0:538x2)/kim-kardashian31-d03b7e9054ce457e806f8770750df246.jpg", "https://people.com/thmb/OiPcGm2h6NL_5s7Lh25AF9TRyec=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(686x0:688x2)/kim-kardashian-5-2000-86eca71c425f4fb28e6754de79a2afbb.jpg", "https://people.com/thmb/T-og_NYyUi2Pcoa3sBGx-aGlTyA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/kanye-west-1-37d956c79c1148f4a02975375e336c18.jpg", "https://people.com/thmb/nF9zTl6naxdJGmHy_qPPx0hM2xg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(694x0:696x2)/kim-kardashian-b1b6419f83c2469e8d0868101bcbac3a.jpg", "https://people.com/thmb/4xpCwAfpuQ88dKsqa-TLBg-_yC4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(744x0:746x2)/kim-kardashian-15-66dcc22e57c348dc9aeb4aef3aac97bf.jpg", "https://people.com/thmb/Ye5_B7_SH5cRZDc3zS2b8X7PQQs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(626x0:628x2)/gettyimages-698979122-copy-1-12e16a5a4b754834949346db2296a1cf.jpg", "https://people.com/thmb/KCCNaEGVAH3Az-bo6IGPGjZsxuQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/pascal-duvier-d6959b1a032c48a89f33fc8d0884d8ec.jpg", "https://people.com/thmb/3o2KqeWpS7R3iJT-42QXX1hpA34=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/kim-kardashian7-3ec9fb43d0364b27b1095bfcf07ba92e.jpg", "https://people.com/thmb/vXmEMcxAoiamp_8aOmbT1eS6fiY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/scott-disick1-70ac242326db4c8c997acebc0d2818b5.jpg", "https://people.com/thmb/BWnrylgghH-5z1AYTNuaxjhMMX4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/kim-kardashian7-fc7cf1e4492d4c6786ffa1bb6d1443c6.jpg", "https://people.com/thmb/sHVbRudvbBKfMsHDa6suEi0jvQY=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(650x0:652x2)/kim-kardashian15-2000-b710237a20b34510b547219b3602f59e.jpg", "https://people.com/thmb/tLdBXl4HQbp0zE6NCVoVDnOjvP0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/kanye-west-kim-kardashian-17fa4dac93e241c789e6fac4ee03db87.jpg", "https://people.com/thmb/IcotDq7Vrysl5v65sul-1mk9_Og=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/kim-kanye-c1e1322d1f8d45f5bf6e4fe45a2d2afb.jpg", "https://people.com/thmb/3yi-EkOW-ks76WGJYFBgANu3dE4=/1175x2000/filters:fill(auto,1)/kim-kardashian5-47c560b128b74a328dde93d40a7dcb25.jpg", "https://people.com/thmb/HaqAOIiRpI7eY3nKXOh6cszSjBU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(579x0:581x2)/kim-kardashian1-2-2000-019aa607c44c404eac2e3086e096b460.jpg", "https://people.com/thmb/i55whmTWN7oe3-gsVZ0CqKpOioo=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(698x0:700x2)/kim-kardashian-paris-recovery-2000-0588c38caa8341969ba1970ff6887bfa.jpg", "https://people.com/thmb/3d8OPWA4hERELZuXHNWenBujIFU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(839x318:841x320)/kim-kardashian-3-428f0fbf9f074b71b2ed60cef49c0779.jpg", "https://people.com/thmb/Lje7sGaj3HgeS-yLg9z5JSNPfrU=/300x150/filters:no_upscale():max_bytes(150000):strip_icc()/people_magazine_sub-e6689738996d40f38f154099e1751481.png", "https://people.com/thmb/Dbf0wS-QvFh_wRSlAns7JjRjqQw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(329x0:331x2)/kim-k-660-216e4aeb026b42dfb3aea5cfb96ea45e.jpeg", "https://people.com/thmb/LWkhsvELyg8oM0JNlhPIf3J1ZdU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/gettyimages-611942696-2000-3160bc8cfcb44e378fc1c03a4dc4e844.jpg", "https://people.com/thmb/dlCQZbCQvrr5oR22Se7FZOqjnFk=/650x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(580x0:582x2)/kim-kardashian12-f4069dfa07d14932ad3332025452955c.jpg"], "top_img": "https://people.com/thmb/3yi-EkOW-ks76WGJYFBgANu3dE4=/1175x2000/filters:fill(auto,1)/kim-kardashian5-47c560b128b74a328dde93d40a7dcb25.jpg", "keywords": [], "authors": ["Aurelie Corinthios"], "canonical_link": "https://people.com/tv/kim-kardashian-life-after-paris-robbery-2/", "title": "Kim Kardashian: How She Rebuilt Her Life After Paris Robbery", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "In the past year, the star has undergone a mental and physical transformation, celebrated career milestones and confirmed that she's expecting her third child with husband Kanye West", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "PEOPLE", "sailthru.author": "Aurelie Corinthios", "article": {"section": "People", "opinion": "false", "author": "https://www.facebook.com/peoplemag"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "og": {"type": "article", "site_name": "Peoplemag", "url": "https://people.com/tv/kim-kardashian-life-after-paris-robbery-2/", "title": "Kim Kardashian: How She Rebuilt Her Life After Paris Robbery", "description": "In the past year, the star has undergone a mental and physical transformation, celebrated career milestones and confirmed that she's expecting her third child with husband Kanye West", "image": "https://people.com/thmb/3yi-EkOW-ks76WGJYFBgANu3dE4=/1175x2000/filters:fill(auto,1)/kim-kardashian5-47c560b128b74a328dde93d40a7dcb25.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "Kim Kardashian: How She Rebuilt Her Life After Paris Robbery", "description": "In the past year, the star has undergone a mental and physical transformation, celebrated career milestones and confirmed that she's expecting her third child with husband Kanye West", "image": "https://people.com/thmb/3yi-EkOW-ks76WGJYFBgANu3dE4=/1175x2000/filters:fill(auto,1)/kim-kardashian5-47c560b128b74a328dde93d40a7dcb25.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.19.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.19.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.19.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.19.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.19.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}