{"url": "https://abc.go.com/news/insider/abc-25-days-of-christmas-2018-schedule", "text": "ABC celebrates the most wonderful time of the year with special \"25 Days of Christmas\" programming starting Dec. 1. The network joins Freeform, Disney Channel, Disney XD and Disney Junior in this fan-favorite TV event. The ABC Christmas specials and Christmas movies extravaganza features a December filled with special Christmas-themed episodes, the return of The Great Christmas Light Fight and The Great American Baking Show: Holiday Edition and timeless animated classics and holiday films. The celebration continues after Christmas with New Year's-themed programming ringing in 2019. Watch on the ABC app from your smartphone and tablet (iOS and Android), computer on ABC.com and connected devices (Roku, AppleTV and Amazon Fire TV). See the schedule below!\n\nNOW PLAYING\n\nWATCH THE GREAT CHRISTMAS LIGHT FIGHT SEASON PREMIERE HERE\n\nWATCH THE WONDERFUL WORLD OF DISNEY: MAGICAL HOLIDAY CELEBRATION NOW\n\nMONDAY, DEC. 3\n\nTHE GOOD DOCTOR – Winter Finale – \"Quarantine\" – Dr. Shaun Murphy and Dr. Alex Park treat two patients who collapse at the local airport and whose symptoms point to an infection that may become airborne. The staff races to contain the infection before it spreads to the rest of the people in the ER, resulting in a hospital quarantine during the holidays. (Part one of a two-part episode) (10:00-11:00 p.m.) WATCH THE WINTER FINALE HERE!\n\nTHURSDAY, DEC. 6\n\nA CHARLIE BROWN CHRISTMAS – Celebrate the joy of the holidays with the classic animated Christmas-themed PEANUTS special, \"A Charlie Brown Christmas,\" created by the late cartoonist Charles M. Schulz. In the digitally remastered 1965 special, Charlie Brown complains about the overwhelming materialism that he sees everywhere during the Christmas season. Lucy suggests that he become director of the school Christmas pageant and Charlie Brown accepts, but it proves to be a frustrating struggle. When an attempt to restore the proper spirit with a forlorn little fir Christmas tree fails, Charlie Brown needs Linus' help to learn what the real meaning of Christmas is. In addition, another PEANUTS special based on the works of Charles Schulz, \"Charlie Brown's Christmas Tales,\" will also air with the Emmy®-winning classic. (8:00-9:00 p.m.)\n\nTHE GREAT AMERICAN BAKING SHOW: HOLIDAY EDITION – Season Premiere – \"Cake and Pastry Week\" – On your marks, get set, bake! It's a double dose of spice this holiday season when the most festive and friendliest competition on television returns with new host Emma Bunton (Spice Girls), Anthony \"Spice\" Adams, veteran judge Paul Hollywood (\"The Great British Baking Show\") and new judge, three-time James Beard Award-winning pastry chef Sherry Yard. The heat is on in the kitchen when 10 bakers enter the tent in the two-hour Season 4 premiere of \"The Great American Baking Show: Holiday Edition.\" Based on the hit U.K. series \"The Great British Baking Show,\" \"The Great American Baking Show: Holiday Edition\" features bakers from across the country battling through 18 total challenges with six challenges throughout each two-hour themed episode, all in the hopes of being crowned \"America's Best Amateur Baker.\" (9:00-11:00 p.m.)\n\nFRIDAY, DEC. 7\n\nTHE VICTORIA'S SECRET FASHION SHOW HOLIDAY SPECIAL – (Rebroadcast. OAD: 12/2/18) (9:00–10:01 p.m.)\n\nSATURDAY, DEC. 8\n\nTHE GREAT AMERICAN BAKING SHOW: HOLIDAY EDITION – \"Cake and Pastry Week\" – (Rebroadcast. OAD: 12/6/18) (8:00-10:00 p.m.)\n\nSUNDAY, DEC. 9\n\nDANCING WITH THE STARS: JUNIORS – Season Finale – \"The Finale (Holiday Special)\" – The remaining celebrity kid couples advance to the finals on the holiday-themed season finale of \"Dancing with the Stars: Juniors.\" The night kicks off with all 12 Juniors kid couples, their mentors, judges Mandy Moore, Val Chmerkovskiy and Adam Rippon, and hosts Jordan Fischer and Frankie Muniz dancing to Whitney Myer's \"Dancing in the Stars.\" For their first dance, the finalist couples will each reprise a favorite dance they performed during the season, which will also feature their mentor. For their second dance, each couple will perform a no-holds-barred freestyle to a special holiday-themed song. At the end of the night, based on the studio audience vote combined with the judges' scores, one couple will be crowned the champion, culminating an incredible season, and take home the all-new Juniors Mirrorball trophy. (8:00-9:00 p.m.)\n\nMONDAY, DEC. 10\n\nCMA COUNTRY CHRISTMAS – The ninth annual \"CMA Country Christmas\" features iconic entertainer Reba McEntire, who returns as host for the second year and will also perform during the holiday music special. Joining Reba are legendary acts and country favorites including Tony Bennett, Dan + Shay, Brett Eldredge, Amy Grant, Diana Krall, Dustin Lynch, Martina McBride, Old Dominion, Brad Paisley, Michael W. Smith, Lindsey Stirling, The Isaacs and Brett Young, taking the stage for a night filled with Christmas classics and festive one-of-a-kind collaborations. (8:00-10:00 p.m.)\n\nTHE GREAT CHRISTMAS LIGHT FIGHT – \"607 – All Stars\" – This special episode of \"The Great Christmas Light Fight Clip Show\" showcases the most spectacular and over-the-top Christmas displays in America. (10:00-11:00 p.m.)\n\nTUESDAY, DEC. 11\n\nTHE CONNERS - \"O Sister, Where Art Thou?\" – When Becky helps Harris keep a secret from Darlene, it opens up a can of worms that causes a rift between the two sisters. Jackie supports Peter with his Nordic history project, and Dan reunites with an old friend, on an all-new episode of \"The Conners,\" TUESDAY, DEC. 11 (8:00-8:31 p.m. EST), on The ABC Television Network, streaming and on demand. Katey Sagal, Jay R. Ferguson and Matthew Broderick guest star.\n\nTHE KIDS ARE ALRIGHT – \"Christmas 1972\" – When Peggy's successful brother, Tom (guest star Nat Faxon), drops in for Christmas, Mike immediately oozes with jealousy. Thus begins Mike's one-sided competition with Tom, using his kids as pawns to help. After Tom gives the Clearys an extravagant Christmas gift, pride prevents Mike from taking it – putting him at odds with the rest of the family. Meanwhile, Timmy mistakenly receives $100 from his great-aunt for Christmas and contemplates whether he should do \"the right thing\" or keep it. Elsewhere, Eddie forgets to get Wendi a Christmas present and panic sets in. (8:31-9:00 p.m.)\n\nBLACK-ISH – \"Christmas in Theater Eight\" – The Johnsons have a tradition of going to the movies on Christmas and they can never agree on what to see. Dre wants to see an important film about Rosa Parks, but they all want to see the latest action-packed superhero blockbuster. Junior becomes embarrassed about taking a gap year after he runs into his ex-girlfriend Megan at the theater. (9:00–9:30 p.m.)\n\nWEDNESDAY, DEC. 12\n\nTHE GOLDBERGS – \"Yippee Ki Yay Melon Farmer\" – Much to Beverly's chagrin, Barry is thrilled that he gets to celebrate Christmas now that he is engaged to Lainey. Meanwhile, Murray's brother Marvin (guest star Dan Fogler returns) makes a promise to Adam with a surprising outcome. (8:00-8:30 p.m.)\n\nAMERICAN HOUSEWIFE – \"Saving Christmas\" – Katie strives to keep her long-separated parents apart when her father, Marty (Patrick Duffy), arrives in time to surprise the Otto family for Christmas. Anna-Kat does her best to help Trip win Taylor back but has a hard time getting past a very persistent Pierce (Milo Manheim). Meanwhile, Oliver thinks no one will remember him as the mask-wearing villain in the school's production of \"The Nutcracker\" but quickly takes center stage when a series of mishaps damages his costume. (8:30-9:00 p.m.)\n\nMODERN FAMILY – \"Stuck in a Moment\" – Hayley wants to give the family a Christmas gift they will never forget if she can just figure out the perfect time. Meanwhile, Claire is mad that Phil has once again borrowed the family Christmas tree for a house-showing; and Jay, Gloria and Joe have to deal with some unwelcome visitors over the holidays. (9:00-9:31 p.m.)\n\nWATCH MITCH AND CAM PRACTICE \"SILENT NIGHT\"\n\nSINGLE PARENTS – \"The Magic Box\" – When Owen shows up unexpectedly on Christmas Eve with a gift for Angie, she desperately seeks out help from Will to find a present for Owen last minute. While doing so, Angie learns how bad Will is at giving Sophie good Christmas presents, or so it seems. While Graham begins to doubt the existence of Santa Claus altogether, the group worries Miggy may still believe in him. Meanwhile, Douglas invites Poppy, who is dealing with her first Christmas without Rory, to compete in a series of cutthroat Christmas-themed competitions. (9:31-10:00 p.m.)\n\nA MILLION LITTLE THINGS – Winter Finale – \"christmas wishlist\" – With the holidays quickly approaching, Delilah struggles with telling Sophie and Danny about her pregnancy; and although Jon's absence makes this time of year especially difficult, the gang comes together to help the Dixons embrace the Christmas spirit. (10:00-11:00 p.m.)\n\nTHURSDAY, DEC. 13\n\nDISNEY PREP & LANDING – Walt Disney Animation Studios brings you a half-hour holiday special tale of an elite unit of elves known as Prep & Landing. After working tirelessly on Prep & Landing for 227 years, an elf named Wayne is upset when he doesn't receive an expected promotion to be the Director of Naughty List Intelligence. Instead, Magee, the North Pole Christmas Eve Command Center Coordinator (NPCECCC for short), partners Wayne with Lanny, an idealistic rookie who has an undying enthusiasm for Christmas. During their Christmas Eve mission, Wayne and Lanny encounter unexpected challenges that push them to their limits. Will the elves be able to guide Dasher, Dancer and the rest of the reindeer pulling Santa's sleigh through a raging snowstorm to ensure a merry Christmas for all? (8:00-8:30 p.m.)\n\nPREP & LANDING 2: NAUGHTY VS. NICE – The yuletide adventures of Christmas elves Lanny and Wayne continue. With the Big 2-5 fast approaching, Wayne and Lanny must race to recover classified North Pole technology that has fallen into the hands of a computer-hacking Naughty Kid! Desperate to prevent Christmas from descending into chaos, Wayne seeks out the foremost Naughty Kid expert to aid in the mission, a bombastic member of the Coal Elf Brigade who also happens to be his estranged brother, Noel. (8:30-9:00 p.m.)\n\nTHE GREAT AMERICAN BAKING SHOW: HOLIDAY EDITION – \"Cookie and Bread Week\" – It's sugar, spice and everything nice this holiday season when the bakers return to the tent for cookie and pastry weeks on \"The Great American Baking Show: Holiday Edition\" (9:00-11:00 p.m.)\n\nFRIDAY, DEC. 14\n\nFRESH OFF THE BOAT – \"Cousin Eddie\" – The battle begins between mother and son when Eddie informs Jessica that he wants to spend Christmas with friend Nicole in New York. But Jessica insists that tradition prevails and he needs to spend the holiday with the family, so he does everything within his power to try and get her to crack and allow him to go. Meanwhile, Louis and Evan do their best to try and help an overwhelmed Emery decide on which one of his numerous friends to invite to the family's Christmas Eve dinner. (8:00-8:30 p.m.)\n\nSPEECHLESS – \"J-I--JINGLE T-H--THON\" – A Christmas tree fire leads Maya to tell a small lie with big consequences. Meanwhile, Ray struggles to live in Pepper's shadow as Dylan twists the knife, and JJ encourages Kenneth to stand up to his sisters (guest stars Niecy Nash and Lisa Leslie), on the holiday episode of \"Speechless.\" (8:30–9:00 p.m.)\n\nSATURDAY, DEC. 15\n\nTHE GREAT CHRISTMAS LIGHT FIGHT – \"603/604\" – (Rebroadcast. OAD: 12/3/18) (8:00-10:00 p.m.)\n\nSUNDAY, DEC. 16\n\nTHE SOUND OF MUSIC – The ABC Television Network will air the Rodgers & Hammerstein cinematic treasure \"The Sound of Music.\" Celebrate the Oscar®-winning classic with popular favorites \"Edelweiss,\" \"My Favorite Things,\" \"Climb Every Mountain,\" \"Do-Re-Mi,\" \"Sixteen Going on Seventeen,\" \"The Lonely Goatherd\" and \"The Sound of Music.\" (7:00-11:00 p.m.)\n\nMONDAY, DEC. 17\n\nTHE GREAT CHRISTMAS LIGHT FIGHT – Season Finale – \"605/606\" – \"The Great Christmas Light Fight\" showcases the most spectacular and over-the-top Christmas displays in America. (8:00-10:00 p.m.)\n\nIN MEMORIAM – ABC NEWS – Hosted by \"Good Morning America\" co-anchor Robin Roberts and conceived by ABC late-night host Jimmy Kimmel, \"The Year in Memoriam 2018\" celebrates the legendary stars and icons the world lost this year and the legacies they left behind. Roberts and Kimmel join forces once again for a unique tribute to learn more about these beloved stars, through stories shared by those closest to them, including Gladys Knight, Patti LaBelle, Smokey Robinson and Kelly Clarkson reflecting on the legendary Queen of Soul, Aretha Franklin; Cindy McCain, Joe Lieberman and Lindsey Graham honoring politician and war hero John McCain; Loni Anderson, Marilu Henner, Lee Corso and John Schneider celebrating the iconic Burt Reynolds; Benedict Cumberbatch, Hank Azaria and Neil deGrasse Tyson memorializing physicist and pop-culture icon Stephen Hawking, as well as Jeb Bush, Reba McEntire and Condoleezza Rice remembering the former first lady Barbara Bush.​ (10:00-11:00 p.m.)\n\nWEDNESDAY, DEC. 19\n\nOLAF'S FROZEN ADVENTURE – (Rebroadcast. OAD: 11/29/18) (8:00-8:30 p.m.) in \"Olaf's Frozen Adventure,\" Olaf (voice of Josh Gad) teams up with Sven on a merry mission. It's the first holiday season since the gates reopened and Anna (voice of Kristen Bell) and Elsa (voice of Idina Menzel) host a celebration for all of Arendelle. When the townspeople unexpectedly leave early to enjoy their individual holiday customs, the sisters realize they have no family traditions of their own. So, Olaf sets out to comb the kingdom to bring home the best traditions, and save Anna and Elsa's \"first Christmas in forever.\" \"Olaf's Frozen Adventure\" features the original cast of Arendelle characters, including Olaf, voiced by Josh Gad (\"Marshall,\" \"Book of Mormon\"); Anna, voiced by Kristen Bell (\"Frozen,\" \"Bad Moms\"); Elsa, voiced by Idina Menzel (Broadway's \"Wicked,\" \"Rent\" and \"If/Then\"; Fox's \"Glee\"); and Kristoff, voiced by Jonathan Groff (Broadway's \"Hamilton,\" Netflix's \"Mindhunter\")\n\nSHREK THE HALLS – DreamWorks Animation's \"Shrek the Halls,\" a half-hour of entertainment starring America's favorite ogre and his friends, features the voices of Mike Myers, Eddie Murphy, Cameron Diaz and Antonio Banderas. Just when Shrek thought he could finally sit back, relax and enjoy his happily ever after with his new family, the most joyous of all holidays arrives. It's Christmas Eve and everyone is filled with holiday cheer – except for Shrek. He isn't exactly the picture of yuletide joy, but for the sake of Fiona and the kids, he tries to get into the spirit of things as only an ogre can. Unfortunately, everyone seems to have their own ideas about what Christmas is all about, so when Donkey, Puss In Boots, Gingerbread Man and the whole gang try to join in on the fun, Shrek's plans for a cozy family celebration end up spiraling into one truly unforgettable Christmas. (8:30-9:00 p.m.)\n\nTHURSDAY, DEC. 20\n\nA CHARLIE BROWN CHRISTMAS – (Rebroadcast. OAD: 12/6/18) (8:00-9:00 p.m.)\n\nTHE GREAT AMERICAN BAKING SHOW: HOLIDAY EDITION – Season Finale – \"Semi-Final and Final\" – Six bakers remain for another week of decadent and delicious challenges, but in the end, only one will be named \"America's Best Amateur Baker\" on \"The Great American Baking Show: Holiday Edition.\" (9:00-11:00 p.m.)\n\nFRIDAY, DEC. 21\n\nI WANT A DOG FOR CHRISTMAS, CHARLIE BROWN! – \"I Want a Dog for Christmas, Charlie Brown!\" centers on ReRun, the lovable but ever-skeptical younger brother of Linus and Lucy. It's Christmas vacation and, as usual, ReRun's big sister is stressing him out, so he decides to turn to his best friend, Snoopy, for amusement and holiday cheer. However, his faithful but unpredictable beagle companion has plans of his own, giving ReRun reason to ask Snoopy to invite his canine brother, Spike, for a visit. The cast of \"I Want a Dog for Christmas, Charlie Brown!\" includes Jimmy Bennett as ReRun, Adam Taylor Gordon as Charlie Brown, Ashley Rose Orr as Lucy Van Pelt, Corey Padnos as Linus Van Pelt, Hannah Leigh Dworkin as Sally, Nick Price as Schroeder, Jake Miner as Pig Pen/Franklin, Kaitlyn Maggio as the little girl and Bill Melendez as Snoopy. (8:00-9:00 p.m.)\n\nTHE GREAT CHRISTMAS LIGHT FIGHT – \"607 – All Stars\" – (Rebroadcast. OAD: 12/10/18) (9:00-10:00 p.m.)\n\nSATURDAY, DEC. 22\n\nCMA COUNTRY CHRISTMAS – (Rebroadcast. OAD: 12/10/18) (8:00-10:00 p.m.)\n\nSUNDAY, DEC. 23\n\nDISNEY PREP & LANDING – (Rebroadcast. OAD: 12/13/18) (8:00-8:30 p.m.)\n\nPREP & LANDING 2: NAUGHTY VS. NICE – (Rebroadcast. OAD: 12/13/18) (8:30-9:00 p.m.)\n\nTHE YEAR: 2018 – ABC NEWS – \"The Year: 2018\" is an entertaining two-hour look at the most iconic and memorable moments of 2018. Hosted by Robin Roberts and the award-winning team of ABC News anchors including George Stephanopoulos, Michael Strahan, Amy Robach and David Muir, \"The Year: 2018\" brings audiences a news-filled, star-studded look at the most unforgettable and unbelievable moments of the year. The eighth annual network special will deliver an eye-opening, uplifting and often hilarious look at the year's biggest names, hottest trends and lowest moments. (9:00-11:00 p.m.)\n\nMONDAY, DEC. 24\n\nBEAUTY & THE BEAST – The 1991 classic animated film features an epic adventure with Belle, Beast and all the characters you love and the music you'll never forget. (8:00-10:00 p.m.)\n\nTUESDAY, DEC. 25\n\nDISNEY PARKS MAGICAL CHRISTMAS DAY PARADE – This Christmas, Disney Parks celebrates the joy of the season as hosts Jordan Fisher and Sarah Hyland share this magical holiday tradition with families around the globe. Co-hosted by Jesse Palmer, the Christmas Day celebration will be merrier than ever before, bringing together the adored Christmas Day parade, special musical performances, surprise celebrity guests and heartwarming family stories to celebrate the most wonderful time of the year. Joining the festivities as parade correspondents are Freeform's \"grown-ish\" actor Trevor Jackson and star of Freeform's upcoming series \"Good Trouble,\" Cierra Ramirez. (10:00 a.m.–12:00 p.m. EST, 9:00-11:00 a.m. CST/MST/PST; airtimes vary, check listings)\n\nTHURSDAY, DEC. 27\n\nHAPPY NEW YEAR, CHARLIE BROWN – The ABC Television Network and the PEANUTS gang will ring in the new year with the animated PEANUTS special \"Happy New Year, Charlie Brown,\" created by late cartoonist Charles M. Schulz, along with \"She's a Good Skate, Charlie Brown.\" In \"Happy New Year, Charlie Brown,\" the PEANUTS gang is ringing in 1986, and Marcie and Peppermint Patty are throwing a big New Year's Eve bash. Charlie Brown plans to celebrate the holiday by curling up with a big book that weighs nearly as much as he does, Tolstoy's \"War and Peace.\" The book's weight doesn't stop him from lugging it to Lucy's pre-party dance class, where he cuts a mean rug with a rollicking Patty. With just 1131 pages to go, Charlie Brown takes another break, this time for the party, and summons the courage to invite his true love, the little red-haired girl. She doesn't respond, but hapless Chuck shows up anyway – with Tolstoy in tow. Then, he settles down with the book – on a porch swing in a snowstorm – and in so doing, misses the evening's big surprise. In \"She's a Good Skate, Charlie Brown,\" disaster strikes as Peppermint Patty heads to her first major ice-skating competition with coach Snoopy and faithful companion, Marcie, by her side. As always, the unassuming Woodstock flies in to save the day. (8:00-9:00 p.m.)\n\nRUDOLPH'S SHINY NEW YEAR – It's Rudolph to the rescue when Happy, the Baby New Year, goes missing, in \"Rudolph's Shiny New Year,\" the classic Rankin/Bass stop-motion animated holiday special. Father Time asks the most famous reindeer of all, Rudolph, to find the next Baby New Year before midnight on New Year's Eve. Red Skelton narrates and voices Father Time, while Frank Gorshin and Morey Amsterdam also provide voices for characters. (9:00-10:00 p.m.)\n\nMONDAY, DEC. 31\n\nDICK CLARK'S PRIMETIME NEW YEAR'S ROCKIN' EVE WITH RYAN SEACREST – Ranked as the No. 1 music special of 2017, \"Dick Clark's Primetime New Year's Rockin' Eve with Ryan Seacrest\" returns this year, marking the 47th anniversary of America's largest celebration of the year and the most watched annual New Year's tradition. The special will include 5½ hours of special performances and reports on New Year's celebrations from around the globe. Ryan Seacrest will serve as host and executive producer of the prime-time festivities and lead the traditional countdown to midnight from Times Square in New York City, as he has for the last 13 years, with live onsite reporting from actress and comedian Jenny McCarthy. Performers will be announced soon. (Beginning at 8 p.m.)\n\nDAYTIME\n\nFRIDAY, DEC. 21\n\nGENERAL HOSPITAL – \"Toys for Tots\" returns to Port Charles for its sixth consecutive year with a very special episode to support the \"Marine Toys for Tots Foundation.\" With the whole town in the holiday spirit, the in-story celebration includes a reading from \"'Twas the Night Before Christmas\" and a surprise visit from Santa and his helpers passing out gifts to the children at General Hospital. Meanwhile, Michael and Willow continue to grow closer; Cameron looks to make amends when his good deed goes horribly wrong; and Anna gets a second chance to make new holiday memories. (weekdays, 3:00-4:00 p.m.; check local listings)\n\n-- ABC --", "images": ["https://assets-cdn.watchdisneyfe.com/delta/assets/common/close.png", "https://assets-cdn.watchdisneyfe.com/delta/assets/common/search.png", "https://assets-cdn.watchdisneyfe.com/delta/assets/common/account.png", "https://assets-cdn.watchdisneyfe.com/delta/assets/abc/abc-nav.png", "https://assets-cdn.watchdisneyfe.com/delta/assets/common/ENT-Icon-Menu.svg", "https://cdn.video.abc.com/abcvideo/video_fep/thumbnails/source/ABCSPECIAL_20101207_ACHARLIEBROWNCHRISTM_SPECIAL_dfb59c51-66e0-48e4-becb-32dc7c48666f_3408251_source.jpg", "https://cdn1.edgedatg.com/aws/v2/abc/ABCUpdates/blog/2256951/6739864df95f01014631549ffc5e8e55/652x368-Q70_6739864df95f01014631549ffc5e8e55.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://assets-cdn.watchdisneyfe.com/delta/assets/common/ENT_heroLogo_Hulu@2x.png"], "top_img": "https://cdn1.edgedatg.com/aws/v2/abc/ABCUpdates/blog/2256951/6739864df95f01014631549ffc5e8e55/652x368-Q70_6739864df95f01014631549ffc5e8e55.jpg", "keywords": [], "authors": [], "canonical_link": "https://abc.com/news/insider/abc-25-days-of-christmas-2018-schedule", "title": "ABC's 25 Days of Christmas 2018 Schedule", "meta_data": {"og": {"url": "https://abc.com/news/insider/abc-25-days-of-christmas-2018-schedule", "app_id": 137585909851, "site_name": "ABC", "image": "https://cdn1.edgedatg.com/aws/v2/abc/ABCUpdates/blog/2256951/6739864df95f01014631549ffc5e8e55/652x368-Q70_6739864df95f01014631549ffc5e8e55.jpg", "description": "See ABC's 25 Days of Christmas 2018 schedule!", "title": "ABC's 25 Days of Christmas 2018 Schedule | ABC Updates", "locale": "en_US"}, "twitter": {"card": "summary_large_image", "site": "@{twitter.account}", "image": "https://cdn1.edgedatg.com/aws/v2/abc/ABCUpdates/blog/2256951/6739864df95f01014631549ffc5e8e55/652x368-Q70_6739864df95f01014631549ffc5e8e55.jpg"}, "fb": {"app_id": 137585909851}, "apple-itunes-app": "app-id=364191819, app-argument=https://abc.com/watch-live", "keywords": "ABC's 25 Days of Christmas 2018 Schedule, ABC Updates blogs", "description": "See ABC's 25 Days of Christmas 2018 schedule!", "google-play-app": "app-id=com.disney.datg.videoplatforms.android.abc", "msApplication-PackageFamilyName": "ABC.ABCPlayer", "msvalidate.01": "0EABD001D404EA9DDE2025E9E4F14CAF", "msApplication-ID": "App", "msapplication-TileColor": "#2D2D2D", "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no", "msapplication-TileImage": "//cdn1.edgedatg.com/tml/assets/content/abc/abc-icon-2021.png", "google-site-verification": "J8rQKaTUp41LleWIqACFUI7j_iS4bNJvNc2KwTwOcQ8", "format-detection": "telephone=no"}, "movies": [], "publish_date": null, "source": "https://abc.go.com", "summary": ""}