{"url": "https://en.wikipedia.org/wiki/Death_of_Diana,_Princess_of_Wales", "text": "1997 fatal car crash\n\nIn the early hours of 31 August 1997, Diana, Princess of Wales, died from injuries sustained earlier that day in a car crash in the Pont de l'Alma tunnel in Paris, France. Dodi Fayed, Diana's partner, and Henri Paul, the driver of the Mercedes-Benz W140 S-Class, were pronounced dead at the scene. Her bodyguard, Trevor Rees-Jones, was severely injured, but survived the crash.\n\nSome media claimed the erratic behaviour of the paparazzi following the car, as reported by the BBC, had contributed to the crash.[3] In 1999, a French investigation found that Paul, who lost control of the vehicle at high speed while intoxicated by alcohol and under the effects of prescription drugs, was solely responsible for the crash. He was the deputy head of security at the Hôtel Ritz and had earlier goaded paparazzi waiting for Diana and Fayed outside the hotel.[4] Anti-depressants and traces of an anti-psychotic in his blood may have worsened Paul's inebriation.[5] In 2008, the jury at a British inquest, Operation Paget, returned a verdict of unlawful killing through grossly negligent driving by Paul and the following paparazzi vehicles.[6] Some media reports claimed Rees-Jones survived because he was wearing a seat belt, but other investigations revealed that none of the occupants of the car were wearing them.[7]\n\nDiana was 36 years old when she died.[8] Her death caused an unprecedented outpouring of public grief in the United Kingdom and worldwide,[9][10] and her funeral was watched by an estimated 2.5 billion people. The royal family were criticised in the press for their reaction to Diana's death. Public interest in Diana has remained high and she has retained regular press coverage in the years after her death.\n\nCircumstances [ edit ]\n\nEvents preceding the crash [ edit ]\n\nOn Saturday, 30 August 1997, Princess Diana left the Olbia Airport, Sardinia on a private jet and arrived at Le Bourget Airport[17] in Paris with Egyptian film producer Dodi Fayed, the son of businessman Mohamed Al-Fayed.[18][19] They had stopped there en route to London, having spent the preceding nine days together on board Mohamed's yacht Jonikal on the French and Italian Riviera. They had intended to stay there for the night. Mohamed was and remains the owner of the Hôtel Ritz Paris and resided in an apartment on Rue Arsène Houssaye, a short distance from the hotel, just off the Avenue des Champs Elysées.\n\nHenri Paul, the deputy head of security at the Ritz, had been instructed to drive the hired black 1994[12][13][14][15] armoured[16] Mercedes-Benz S280 sedan (W140[11] S-Class) in order to elude the paparazzi;[22] a decoy vehicle left the Ritz first from the main entrance on Place Vendôme, attracting a throng of photographers. Diana and Fayed then departed from the hotel's rear entrance,[23] Rue Cambon, at around 00:20 on 31 August CEST (22:20 on 30 August UTC), heading for the apartment in Rue Arsène Houssaye. They did this to avoid the nearly thirty photographers waiting in front of the hotel.[23] Diana and Fayed were the rear passengers; Trevor Rees-Jones, a member of the Fayed family's personal protection team, was in the (right) front passenger seat. The occupants were not wearing seat belts.[b] After leaving the Rue Cambon and crossing the Place de la Concorde, they drove along Cours la Reine and Cours Albert 1er – the embankment road along the right bank of the River Seine – into the Place de l'Alma underpass.[25]\n\nThe crash [ edit ]\n\nAt 00:23, Paul lost control of the car at the entrance to the Pont de l'Alma underpass. The car struck passing a Fiat, swerved to the left of the two-lane carriageway and collided head-on with the thirteenth pillar that supported the roof, as there are no guard rails.[26] It was travelling at an estimated speed of 105 km/h (65 mph)[27] – more than twice the tunnel's 50 km/h (31 mph) speed limit. It spun, hit the stone wall of the tunnel backwards and came to a stop. The impact caused substantial damage, particularly to the front half of the vehicle. Witnesses arriving shortly after the crash reported smoke.[29] Witnesses also reported that photographers on motorcycles \"swarmed the Mercedes sedan before it entered the tunnel\".[30]\n\nAftermath [ edit ]\n\nPont de l'Alma Tunnel east entrance, 1998, the site of the crash\n\nPont de l'Alma Tunnel west entrance, 2007, showing pillars and lack of guard rails\n\nWith the four occupants still in the wrecked car, the photographers, who had been driving slower and were some distance behind the Mercedes, reached the scene. Some rushed to help, tried to open the doors and help the victims, while some of them took pictures. Police arrived around ten minutes after the crash at 00:30 and an ambulance was on site five minutes later, according to witnesses.[32] France Info radio reported that one photographer was beaten by witnesses who were horrified by the scene.[30] Five of the photographers were arrested directly.[29] Later, two others were detained and around twenty rolls of film were taken directly from the photographers.[30] Police also impounded their vehicles afterwards.[30] Firefighters also arrived at the scene to help remove the victims.[33]\n\nRees-Jones was still conscious, with multiple serious facial injuries and a head contusion.[34] The front occupants' airbags had functioned normally.[35] Diana, who had been sitting in the right rear passenger seat, was also still conscious but critically injured.[36] The crash mostly affected the righthand side of her body, indicating that she was sitting sideways in her seat at the time of impact.[37] Her ribs and arm were fractured and her right collar bone was dislocated, and she suffered from swelling and bruising to the brain.[37] She was reported to murmur repeatedly, \"Oh my God\", and after the photographers and other helpers were pushed away by police, \"Leave me alone.\"[36] In June 2007, the Channel 4 documentary Diana: The Witnesses in the Tunnel claimed that the first person to touch Diana was off-duty physician Frederic Mailliez,[38] who chanced upon the scene. Mailliez reported that Diana had no visible injuries but was in shock. She was reported to have been extremely disturbed and removed a drip by force while shouting incoherently.[40] After being sedated and removed from the car at 01:00, she went into cardiac arrest and, following external cardiopulmonary resuscitation, her heart started beating again.[41] Diana was moved to the SAMU ambulance at 01:18, left the scene at 01:41 and arrived at the Pitié-Salpêtrière Hospital at 02:06.[42]\n\nFayed had been sitting in the left rear passenger seat and was pronounced dead shortly afterwards.[43] Paul was also pronounced dead on removal from the wreckage. Both were taken directly to the Institut Médico-Légal (IML), the Paris mortuary, not to a hospital. Paul was later found to have a blood alcohol level of 1.75 grams per litre of blood, about 3.5 times the legal limit in France.[34]\n\nDiana's injuries were extensive, and resuscitation attempts, including internal cardiac massage, were unsuccessful. Her heart had been displaced to the right side of the chest,[45] which tore the upper left pulmonary vein and the pericardium.[40] Diana died at the hospital at 03:00.[47] The anaesthetist Bruno Riou announced her death at 06:00 at a news conference held at the hospital.[29][48]\n\nLater that morning, French prime minister Lionel Jospin and Interior Minister Jean-Pierre Chevènement visited the hospital.[49] At around 17:00, Diana's former husband, Charles, who was then Prince of Wales, and her two older sisters, Lady Sarah McCorquodale and Lady Jane Fellowes, arrived in Paris. The group visited the hospital along with French president Jacques Chirac and thanked the doctors for trying to save her life.[51] Charles accompanied Diana's body to the UK later the same day.[52] They departed from Vélizy – Villacoublay Air Base and landed at RAF Northolt and a bearer party from the Queen's Colour Squadron transferred her coffin, which was draped with the royal standard with an ermine border, to a hearse. Her remains were finally taken to the Hammersmith and Fulham mortuary in London for a post-mortem examination later that day.[53]\n\nInitial media reports stated Diana's car had collided with the pillar at 190 km/h (120 mph), and that the speedometer's needle had jammed at that position.[34] It was later announced that the car's speed upon collision was 95–110 km/h (59–68 mph), about twice as fast as the speed limit of 50 km/h (31 mph). In 1999, a French investigation concluded the Mercedes had come into contact with another vehicle (a white Fiat Uno) in the tunnel.[54] The driver of the Fiat was never conclusively traced, although many believed the driver was Le Van Thanh. The specific vehicle was not identified.[55][54]\n\nIt was remarked by Robin Cook, the British Foreign Secretary, that if the crash had been caused in part by being hounded by paparazzi, it would be \"doubly tragic\".[23] Diana's younger brother, the Earl Spencer, also blamed tabloid media for her death.[56] An 18-month French judicial investigation concluded in 1999 that the crash was caused by Paul, who lost control at high speed while intoxicated.[57]\n\n\"No charges were brought against the paparazzi who had been pursuing the princess' car.\"[58]\n\nMourning [ edit ]\n\nMembers of the public were invited to sign a book of condolence at St James's Palace.[59] A book of condolence was also set up by the British embassy in the US.[60] All 11,000 light bulbs at Harrods department store, owned by Mohamed Al-Fayed, were turned off and not switched on again until after the funeral.[59] Throughout the night, members of the Women's Royal Voluntary Service and the Salvation Army provided support for people queuing along the Mall.[61] More than one million bouquets were left at her London residence, Kensington Palace,[62] while at her family's estate of Althorp the public was asked to stop bringing flowers as the volume of both visitors and flowers in the surrounding roads was said to be causing a threat to public safety.[63]\n\nBy 10 September, the pile of flowers outside Kensington Gardens was 5 feet (1.5 m) deep in places and the bottom layer had started to compost.[64] The people were quiet, queuing patiently to sign the book and leave their gifts.[65] Fresh flowers, teddy bears, and bottles of champagne were later donated and distributed among the sick, the elderly and children. Cards, personal messages and poems were collected and given to Diana's family.[66]\n\nFuneral and burial [ edit ]\n\nEarly on, it was uncertain if Diana would receive a ceremonial funeral, since she had lost the status of Her Royal Highness following her divorce from Prince Charles in 1996.[67]\n\nDiana's death was met with extraordinary public expressions of grief,[68][10] and her funeral at Westminster Abbey on 6 September drew an estimated 3 million mourners and onlookers in London.[69][70] Outside the Abbey and in Hyde Park crowds watched and listened to proceedings on large outdoor screens and speakers as guests filed in, including representatives of the many charities of which Diana was patron. Attendees included US First Lady Hillary Clinton and French First Lady Bernadette Chirac, as well as celebrities including Italian tenor Luciano Pavarotti and two friends of Diana, George Michael and Elton John.[36][71] John performed a rewritten version of his song \"Candle in the Wind\" that was dedicated to her, known as \"Goodbye England's Rose\" or \"Candle in the Wind 1997\";[72] the single became the best-selling single since UK and US singles charts began in the 1950s, with total sales exceeding 33 million units.[73] Protocol was disregarded when the guests applauded the speech by Earl Spencer, who strongly criticised the press and indirectly criticised the Royal Family for their treatment of her.[74] The funeral is estimated to have been watched by 31.5 million viewers in Britain.[75] Precise calculation of the worldwide audience is not possible, but it was estimated to be around 2.5 billion.[76] The ceremony was broadcast to 200 countries and in 44 languages.[77]\n\nAfter the end of the ceremony, Diana's coffin was driven to Althorp in a Daimler hearse.[78] Mourners cast flowers at the funeral procession for almost the entire length of its journey and vehicles even stopped on the opposite carriageway of the M1 motorway as the cars passed.[79]\n\nIn a private ceremony, Diana was buried on an island in the middle of a lake called The Oval, which is part of the Pleasure Garden at Althorp.[80] In her coffin, she wears a black Catherine Walker dress and black tights, and is holding a rosary in her hands. The rosary had been a gift from Mother Teresa of Calcutta, a confidante of Diana, who had died the day before her funeral. A visitors' centre is open during summer months, with an exhibition about Diana and a walk around the lake. All profits were donated to the Diana, Princess of Wales Memorial Fund.[81]\n\nReactions [ edit ]\n\nRoyal family [ edit ]\n\nQueen Elizabeth II expressed her dismay at Diana's death.[82] Then-Prince Charles woke his sons before dawn to share the news.[83] Upon announcement of the death, the website of the Royal Family temporarily removed all its content and replaced it with a black background, displaying a picture of Diana accompanied by her name and dates of birth and death. An online book of condolence was also made available on the website for the public to post their personal tributes.[84] On Sunday morning after Diana's death, the Queen, Princes Charles, William and Harry all wore black to church services at Crathie Kirk near Balmoral Castle.[85] The royal family later issued a statement, saying Charles, William and Harry were \"taking strength from\" and \"deeply touched\" by and \"enormously grateful\" for the public support.[86][87] Princes Andrew and Edward met the mourners outside Kensington Palace as a precautionary measure to test the public mood,[86] and Edward visited St James's Palace to sign the book of condolences.[88] On their way from Crathie Kirk to Balmoral, the Queen, Prince Philip, Charles, William and Harry viewed the floral tributes and messages left by the public.[86][89]\n\nCharles and his sons returned to London on Friday, 5 September.[90] They made an unannounced visit to see the floral tributes left outside Kensington Palace.[86][91] The Queen, who returned to London from Balmoral accompanied by Prince Philip, the Queen Mother, and Princess Margaret, agreed to a television broadcast to the nation.[92][88] She viewed the floral tributes in front of Buckingham Palace and visited the Chapel Royal at St James's Palace, where Diana's body was remaining, and met crowds that were in line to sign the books of condolence.[86][93] Diana's brother, Earl Spencer, and her former sister-in-law, Sarah, Duchess of York also visited St James's Palace.[87]\n\nThe Royal Family was criticised for a rigid adherence to protocol, and their efforts to protect the privacy of Diana's grieving sons were interpreted as a lack of compassion.[94] In particular, the refusal of Buckingham Palace to fly the Royal Standard at half-mast provoked angry headlines in newspapers.[94][95] The Palace's stance was one of royal protocol: no flag could fly over Buckingham Palace, as the Royal Standard is only flown when the monarch is in residence, and the Queen was then in Scotland. The Royal Standard never flies at half-mast as it is the Sovereign's flag and there is never an interregnum or vacancy in the monarchy, as the new monarch immediately succeeds his or her predecessor. Finally, as a compromise, the Union Flag was flown at half-mast as the Queen left for Westminster Abbey on the day of the funeral.[92] This set a precedent, and Buckingham Palace has subsequently flown the Union Flag when the monarch is not in residence.[96]\n\nA rift between Prince Charles and the Queen's private secretary, Sir Robert Fellowes (Diana's brother-in-law), was reported in the media over the nature of the funeral, with Charles demanding a public funeral and Fellowes supporting the Queen's idea of a private one.[97] The Palace later issued a statement denying such rumours.[97] Discussions were also held with the Spencer family and the British royal family as to whether Diana's HRH style needed to be restored posthumously, but Diana's family decided that it would be against Diana's wishes and no formal offer was made.[98] The funeral committee at Buckingham Palace wanted William and Harry to have a bigger role in their mother's funeral and Downing Street officials suggested that they could walk in the funeral cortège,[99] but faced opposition from Prince Philip, who reportedly stated \"They've just lost their mother. You're talking about them as if they are commodities.\"[86] Prince Harry said in 2017 that the death of his mother caused severe depression and grief.[100] William was 15 and Harry was 12 when Diana died.[101]\n\nPoliticians [ edit ]\n\nPresident Bill Clinton's remarks on Diana's death\n\nBritish Prime Minister Tony Blair said that he was \"utterly devastated by the death of the Princess\".[67][102] US President Bill Clinton said that he and his wife, Hillary Clinton, were \"profoundly saddened\" when they found out about her death.[29] Kofi Annan, the United Nations Secretary-General said that her death \"has robbed the world of a consistent and committed voice for the improvement of the lives of suffering children worldwide\".[85] In Australia, the Deputy Prime Minister, Tim Fischer, condemned the paparazzi for their overzealous coverage of Diana.[103] Russian President Boris Yeltsin praised Diana's charity work in a statement saying, \"All know of Princess Diana's big contribution to charitable work, and not only in Great Britain\".[104][105] Among other politicians who sent messages of condolences were Australian Prime Minister John Howard, South African President Nelson Mandela, Canadian Prime Minister Jean Chrétien, New Zealand Prime Minister Jim Bolger, and Israeli Prime Minister Benjamin Netanyahu.[104] The Australian House of Representatives and the New Zealand House of Representatives also passed parliamentary motions of condolence.[106][107] The Government of Canada, as well as individual provinces in the country, set up online and in-person books of condolences in their parliament buildings and memorial services were held across the country.[108]\n\nFollowing her death, delegates at an international conference in Oslo to ban landmines paid their tributes to Diana, who was an avid campaigner for banning the explosive devices.[109] The Ottawa Treaty, which created an international ban on the use of anti-personnel landmines, was adopted in Oslo, in September 1997 and signed by 122 States in Ottawa on 3 December 1997.[110] Diana's work on the landmines issue has been described as influential in the signing of the treaty.[111]\n\nPublic [ edit ]\n\nIn London, thousands of people carried bouquets and stood outside Buckingham Palace after the news of her death.[85] People started bringing flowers within an hour after the news was shared.[82] The BBC flew its flags at half-mast.[85] Both radio and television aired the British national anthem, \"God Save the Queen\", in response to Diana's death, as is precedent for the death of a member of the Royal Family.[82] An elegy was published by Ted Hughes to mark her death.[112] Sporting events in the UK were rearranged, with demands for Scotland's Football Association chief executive to resign due to their delayed response to reschedule Scotland's World Cup qualifier.[113]\n\nPeople in the US were shocked at her death.[114] In San Francisco, around 14,000 people marched through the city in a procession on 5 September to pay tribute to Diana, honouring her for her work on behalf of AIDS patients.[115] In Los Angeles, more than 2,500 people transformed a baseball field into a candle-lit altar in a memorial service prepared by an AIDS organisation.[115] In Paris, thousands of people visited the site of the crash and the hospital where Diana died, leaving bouquets, candles and messages.[116] People brought flowers and also attempted to visit the Hotel Ritz.[116] On the eve of the funeral, 300 members of the British community in Paris took part in a service of commemoration.[115] Landmine victims in Angola and Bosnia also honoured Diana with separate services, pointing out how her efforts had helped raise awareness about the damage caused by landmines.[115] In Bosnia, a landmine survivor, Jasminko Bjelic, who had met Diana only three weeks earlier, said, \"She was our friend.\"[85] In Egypt, the homeland of Dodi Fayed, people visited the British embassy in Cairo to pay their tributes and sign a book of condolences.[117] Following her death many celebrities including actors and singers blamed the paparazzi and condemned their reckless behavior.[118][119]\n\nMother Teresa, who met Diana a few months before her death, expressed her sorrow and prayers were held at the Missionaries of Charity for Diana.[104] The Bishop of Bradford David Smith and the Bradford Council of Mosques held prayers by the Christian and Muslim communities.[120] Jonathan Sacks led prayers by the Jewish community at the Western Marble Arch Synagogue, and Cardinal Basil Hume presided over the Roman Catholic requiem mass held at Westminster Cathedral.[120] Mother Teresa died on 5 September 1997, the day before Diana's funeral.\n\nSocial and economic impact [ edit ]\n\nDuring the four weeks following her funeral, the suicide rate in England and Wales rose by 17% and cases of deliberate self-harm by 44.3% compared with the average for that period in the four previous years. Researchers suggest that this was caused by the \"identification\" effect, as the greatest increase in suicides was by people most similar to Diana: women aged 25 to 44, whose suicide rate increased by over 45%.[121] Another research showed that 50% of Britons and 27% of Americans were deeply affected by her death as if someone they knew had died. It also concluded that in general women were more affected than men in both of the countries.[122] The same research showed that Diana's \"charitable endeavors\" and \"ability to identify with ordinary people\" were among the main factors that caused her to be admired and respected by the people.[122] In the weeks after her death counselling services reported an increase in the number of phone calls by the people who were seeking help due to grief or distress.[123]\n\nDiana's death mostly affected people who were already vulnerable and could identify with her as \"a public figure perceived as psychologically troubled but who seemed to have made a constructive adjustment\".[124] Another research described Diana's death and funeral as traumatic stressors with psychological impacts that could \"be equated with traditional stressors identified in the trauma research literature\".[125] In the days after her funeral, an increase in the number of inappropriate hospital admissions was observed, whereas the number of admissions for traumatic injuries decreased for at least three months, showing a possible change in people's driving habits.[126][127] Her death was also associated with \"30% reduction in calls to the police and a 28% drop in public order offences\", yet despite its effect on increasing depression and traumatic stress, no significant increase was observed in the number of psychiatric emergencies in Edinburgh.[128]\n\nThe national grieving for Diana had economic effects. In the short term, the Centre for Economics and Business Research (CEBR) estimated that retail sales dropped 1% that week. Traffic congestion in central London as crowds went to the palaces to pay homage likewise adversely affected productivity, and the CEBR estimated that would cost businesses £200 million, or a total loss of 0.1% of gross domestic product for the third quarter of 1997. However, in the long run the CEBR expected that to be offset by increased tourism and memorabilia sales.[129]\n\nReception [ edit ]\n\nSome criticised the reaction to Diana's death at the time as being \"hysterical\" and \"irrational\". As early as 1998, philosopher Anthony O'Hear identified the mourning as a defining point in the \"sentimentalisation of Britain\", a media-fuelled phenomenon where image and reality become blurred.[130] Oasis bandleader Noel Gallagher responded to the reaction with, \"The woman's dead. Shut up. Get over it\".[131] These criticisms were repeated on the tenth anniversary of the crash, when journalist Jonathan Freedland of The Guardian expressed the opinion that, \"It has become an embarrassing memory, like a mawkish, self-pitying teenage entry in a diary ... we cringe to think about it.\"[132] In 2010, Theodore Dalrymple suggested \"sentimentality, both spontaneous and generated by the exaggerated attention of the media, that was necessary to turn the death of the princess into an event of such magnitude thus served a political purpose, one that was inherently dishonest in a way that parallels the dishonesty that lies behind much sentimentality itself\".[133]\n\nThe reactions following Diana's death were subject to criticism by Christopher Hitchens. His 1998 documentary Princess Diana: The Mourning After accused the British media of playing an essential role in creating a national, unchallengeable, and at times hysterical cult of personality surrounding Diana, whereas previously they had been extremely critical of her and the monarchy after she had separated and divorced from Charles, and was having an affair with Dodi Fayed. Hitchens claimed the public were behaving irrationally and that many appeared to not even know why they were mourning. He also scrutinised the level of censorship against criticism of Diana and the monarchy but was accused, in a review by The Independent, of exaggerating on this point.[134] Private Eye's sales dropped by one third after it ran a cover titled \"Media to Blame\", which attempted to criticise the instant switch in the media and the public's opinion of Diana after her death from critical to complimentary.[135]\n\nHitchens's views were later supported by Jonathan Freedland of The Guardian, who also questioned the reason behind the \"outburst of mass hysteria\" following Diana's death and described it as \"an episode when the British public lost its characteristic cool and engaged in seven days of bogus sentimentality, whipped up by the media, and whose flimsiness was demonstrated when it vanished as quickly as it had appeared\".[132] Comparing Diana's funeral to that of Winston Churchill, Peter Hitchens observed the \"difference in the self-discipline of the people and their attitudes\" at the two historical events, with them being more restrained at Churchill's funeral but \"un-English\" at Diana's.[136]\n\nSome cultural analysts disagreed. Sociologist Deborah Steinberg pointed out that many Britons associated Diana not with the Royal Family but with social change and a more liberal society: \"I don't think it was hysteria, the loss of a public figure can be a touchstone for other issues.\"[137] Carol Wallace of People magazine said that the fascination with Diana's death had to do with \"the fairy tale failing to end happily – twice, first when she got divorced and now that she died\".[138]\n\nReflecting back on the event in the 2021 Apple TV+ docuseries The Me You Can't See, Diana's son Prince Harry said that he was surprised by the extent to which the public reacted to his mother's death. Referring to the day of her funeral, he said: \"I'm just walking along and doing what was expected of me, showing the one-tenth of the emotion that everybody else was showing. This was my mum, you never even met her.\"[139]\n\nMemorials [ edit ]\n\nFlame of Liberty, the unofficial Diana memorial in Paris, France, the day after the 20th anniversary of her death. The ground is covered with flowers and other tributes, and the chain fence covered with The, the unofficial Diana memorial in Paris, France, the day after the 20th anniversary of her death. The ground is covered with flowers and other tributes, and the chain fence covered with love locks\n\nIn the years after her death, many memorials were commissioned and dedicated to her. As a temporary memorial, the public co-opted the Flamme de la Liberté (Flame of Liberty), a monument near the Pont de l'Alma tunnel related to the French donation of the Statue of Liberty to the US. The messages of condolence have since been removed and its use as a Diana memorial has discontinued, though visitors still leave messages in her memory. A permanent memorial, the Diana, Princess of Wales Memorial Fountain, was opened by the Queen in Hyde Park in London on 6 July 2004,[140] followed by a statue in the Sunken Garden of Kensington Palace, which was unveiled by her sons on 1 July 2021.[141]\n\nFollowing her death, a member of the Millennium Dome's board suggested the project be refashioned and extended \"to accommodate, for example, a hospital, businesses, charities, private residences, and the whole thing named 'the Princess Diana Centre'\". The idea was later scrapped.[142]\n\nInquests [ edit ]\n\nUnder English law, an inquest is required in cases of sudden or unexplained death.[143][144] A French judicial investigation had already been carried out but the 6,000-page report was never published.[145] On 6 January 2004, six years after Diana's death, an inquest into the crash opened in London held by Michael Burgess, the coroner of the Queen's Household.[144] The coroner asked the Metropolitan Police commissioner, Sir John Stevens, to make inquiries in response to speculation that the deaths were not an accident.[144][146] Forensic scientist Angela Gallop was commissioned to examine the forensic evidence.[147] The police investigation reported its findings in Operation Paget in December 2006.[148]\n\nIn January 2006, Lord Stevens explained in an interview on GMTV that the case is substantially more complex than once thought. The Sunday Times wrote on 29 January 2006 that agents of the British secret service were cross-examined because they were in Paris at the time of the crash. It was suggested in many journals that these agents might have exchanged the blood test from Henri Paul with another blood sample (although no evidence for this has been forthcoming).[149][150]\n\nThe inquests into the deaths of Diana and Fayed opened on 8 January 2007, with Dame Elizabeth Butler-Sloss acting as Deputy Coroner of the Queen's Household for the Diana inquest and Assistant Deputy Coroner for Surrey in relation to the Fayed inquest. Butler-Sloss originally intended to sit without a jury;[151] this decision was later overturned by the High Court of Justice,[152] as well as the jurisdiction of the coroner of the Queen's Household. On 24 April 2007, Butler-Sloss stepped down, saying she lacked the experience required to deal with an inquest with a jury.[153] The role of coroner for the inquests was transferred to Lord Justice Scott Baker, who formally took up the role on 13 June as Coroner for Inner West London.[154]\n\nOn 27 July 2007, Baker, following representations for the lawyers of the interested parties, issued a list of issues likely to be raised at the inquest, many of which had been dealt with in great detail by Operation Paget:\n\nWhether driver error on the part of Henri Paul caused or contributed to the cause of the collision Whether Henri Paul's ability to drive was impaired through drink or drugs Whether a Fiat Uno or any other vehicle caused or contributed to the collision Whether the actions of the Paparazzi caused or contributed to the cause of the collision Whether the road/tunnel layout and construction were inherently dangerous and, if so, whether this contributed to the collision Whether any bright/flashing lights contributed to or caused the collision and, if so, their source Whose decision it was that Diana and Dodi Al Fayed should leave from the rear entrance to the Ritz and that Henri Paul should drive the vehicle Henri Paul's movements between 7 and 10 pm on 30 August 1997 The explanation for the money in Henri Paul's possession on 30 August 1997 and in his bank account Whether Andanson, a photographer who followed the princess in the week before her death, was in Paris on the night of the collision Whether Diana's life would have been saved if she had reached hospital sooner or if her medical treatment had been different Whether Diana was pregnant Whether Diana and Dodi Al Fayed were about to announce their engagement Whether and, if so in what circumstances, the Princess of Wales feared for her life The circumstances relating to the purchase of the ring The circumstances in which Diana's body was embalmed Whether the evidence of Tomlinson throws any light on the collision Whether the British or any other security services had any involvement in the collision Whether there was anything sinister about (i) the Cherruault burglary or (ii) the disturbance at the Big Pictures agency Whether correspondence belonging to Diana (including some from Prince Philip) has disappeared, and if so the circumstances.[155]\n\nThe inquests officially began on 2 October 2007 with the swearing of a jury of six women and five men. Lord Justice Baker delivered a lengthy opening statement giving general instructions to the jury and introducing the evidence.[156] The BBC reported that Mohamed Al-Fayed, having earlier reiterated his claim that his son and Diana were murdered by the Royal Family, immediately criticised the opening statement as biased.[157]\n\nThe inquest heard evidence from people connected with Diana and the events leading to her death, including Rees-Jones, Mohamed Al-Fayed, Paul Burrell, Diana's stepmother, and the former head of MI6.[158]\n\nLord Justice Baker began his summing up to the jury on 31 March 2008.[159] He opened by telling the jury \"no-one except you and I and, I think, the gentleman in the public gallery with Diana and Fayed painted on his forehead sat through every word of evidence\" and concluded that there was \"not a shred of evidence\" that Diana's death had been ordered by Prince Philip or organised by the security services.[160] He concluded his summing up on Wednesday, 2 April 2008.[161] After summing up, the jury retired to consider five verdicts, namely unlawful killing by the negligence of either or both the following vehicles or Paul; accidental death or an open verdict.[159] The jury decided on 7 April 2008 that Diana had been unlawfully killed by the \"grossly negligent driving of the following vehicles [the paparazzi] and of the Mercedes driver Henri Paul\".[162][163] Princes William and Harry released a statement in which they said that they \"agree with their verdicts and are both hugely grateful\".[164] Mohamed Al-Fayed also said that he would accept the verdict and \"abandon his 10-year campaign to prove that Diana and Dodi were murdered in a conspiracy\".[165]\n\nThe cost of the inquiry exceeded £12.5 million, the coroner's inquest cost £4.5 million; a further £8 million was spent on the Metropolitan Police investigation. It lasted 6 months and heard 250 witnesses, with the cost heavily criticised in the media.[166]\n\nRelated lawsuits [ edit ]\n\nNine photographers, who had been following Diana and Dodi in 1997, were charged with manslaughter in France.[2] France's \"highest court\" dropped the charges in 2002.[2]\n\nThree photographers who took pictures of the aftermath of the crash on 31 August 1997 had their photographs confiscated and were tried for invasion of privacy for taking pictures through the open door of the crashed car.[2][167] The photographers, who were part of the \"paparazzi\", were acquitted in 2003.[2]\n\nConspiracy theories [ edit ]\n\nAlthough the initial French investigation found that Diana had died as a result of an accident, several conspiracy theories have been raised.[168] Since February 1998, Fayed's father, Mohamed Al-Fayed, has claimed that the crash was a result of a conspiracy,[169] and later contended that the crash was orchestrated by MI6 on the instructions of the Royal Family.[170] His claims were dismissed by a French judicial investigation[5] and by Operation Paget.[171] On 7 April 2008, Lord Justice Baker's inquest into the deaths of Diana and Fayed ended with the jury concluding that they were the victims of an \"unlawful killing\" by Henri Paul and the drivers of the following vehicles.[172] Additional factors were \"the impairment of the judgment of the driver of the Mercedes through alcohol\" and \"the death of the deceased was caused or contributed to by the fact that the deceased was not wearing a seat belt, the fact that the Mercedes struck the pillar in the Alma Tunnel rather than colliding with something else\".[162]\n\nOn 17 August 2013, Scotland Yard revealed that they were examining the credibility of information from a source that alleged that Diana was murdered by a member of the British military.[173][174]\n\nIn the media [ edit ]\n\nAfter Dark television discussion – After Diana – broadcast on A specialtelevision discussion –– broadcast on Channel 4 on 13 September 1997\n\nActor George Clooney was critical of several tabloids and paparazzi agencies following Diana's death. A few of the tabloids boycotted Clooney following the outburst, stating that he \"owed a fair portion of his celebrity\" to the tabloids and photo agencies in question.[175] In September 1997, a number of supermarket chains in the US removed the September 9 issue of the National Enquirer, which bore the title \"Di Goes Sex Mad\".[176] The paper's editor described the incident as \"an unfortunate circumstance\", which was not meant to coincide with her death.[177] Another American tabloid, Globe, issued an apology for its headline \"To Di For\".[177]\n\nDiana was ranked third in the 2002 Great Britons poll sponsored by the BBC and voted for by the British public, after Sir Winston Churchill (1st) (a distant cousin), and Isambard Kingdom Brunel (2nd), just above Charles Darwin (4th), William Shakespeare (5th), and Isaac Newton (6th). That same year, another British poll named Diana's death as the most important event in the country's last 100 years.[178] Historian Nick Barrett criticised this outcome as being \"a pretty shocking result\".[179]\n\nLater in 2004, the CBS programme 48 Hours broadcast photos from the crash scene which were \"part of a 4,000-page French government report\". They showed an intact rear side and centre section of the Mercedes, including one of an unbloodied Diana with no outward injuries crouched on the rear floor with her back to the right passenger seat – the right rear door is fully open. The release of these pictures was poorly received in the UK, where it was felt that the privacy of Diana was being infringed.[180] Buckingham Palace, Prime Minister Tony Blair and Diana's brother condemned the action, while CBS defended its decision saying that the pictures \"are placed in journalistic context – an examination of the medical treatment given to Princess Diana just after the crash\".[181]\n\nOn 13 July 2006, Italian magazine Chi published photographs that showed Diana amid the wreckage of the car crash;[182] the photos were released despite an unofficial blackout on such photographs being published.[183][c] The editor of Chi defended his decision by saying he published the photographs simply because they had not been previously seen, and he felt the images were not disrespectful to the memory of Diana.[183]\n\nThe British newspaper, the Daily Express, was criticised for continued and sustained coverage of Diana following her death. A 2006 report in The Guardian showed that the newspaper had mentioned her in numerous recent news stories, with headlines including, \"Perhaps Diana should have worn seatbelt\", \"Diana inquiry chief's laptop secrets stolen\", \"£250,000 a year bill to run Diana fountain\" and \"Diana seatbelt sabotage probe\".[184]\n\nThe events from Diana's death to her funeral became the subject of a 2006 film, The Queen, with Helen Mirren in the title role.[185]\n\nInternet coverage [ edit ]\n\nDiana's death occurred at a time when Internet use in the developed world was booming, and several national newspapers and at least one British regional newspaper had already launched online news services. BBC News had set up online coverage of the general election earlier in 1997[186] and as a result of the widespread public and media attention that Diana's death resulted in, BBC News swiftly created a website featuring news coverage of Diana's death and the events that followed it. Diana's death helped BBC News officials realise how important online news services were becoming, and a full online news service was launched on 4 November that year, alongside the launch of the BBC's rolling news channel BBC News 24 on 9 November.[187]\n\nMedia Coverage [ edit ]\n\nAt 1:42am, BBC One was airing the 1970 film Borsalino, until the film was interrupted to give the announcement of the crash. News anchor Martyn Lewis gave the initial announcement on both BBC One and on BBC Two a few minutes later. At 1:52am, ITV was airing the film “Night Of The Hunter” when an ITN newsflash interrupted a scheduled ad break. Tim Willcox gave the initial announcement to ITV viewers. At 2:30am, BBC One joined BBC World overnight instead of closing down, with news anchor Nik Gowing covering the crash. The latter also gave the announcement of her death on BBC World, which was hastily rebroadcast on BBC One. Meanwhile, ITN anchor Dermot Murnaghan covered the crash and announced her death on ITV, while Kay Burley covered the crash with other 2 news anchors on Sky News.\n\nSee also [ edit ]\n\nReferences [ edit ]\n\nNotes [ edit ]\n\n^ Nine paparazzi originally charged with manslaughter , but charges were dropped. ^ Although there are conflicting reports (such as BBC and CNN ), the investigation Operation Paget report notes \"Operation Paget's view is that none of the seat belts were being worn at the time of the impact, including that of Trevor Rees-Jones.\" (Page 421) [1] ^ The photographs, taken minutes after the crash, show her slumped in the back seat while a paramedic attempts to fit an oxygen mask over her face.\n\nCitations [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/f/f3/After_Dark_special_edition_on_13_September_1997.jpg/220px-After_Dark_special_edition_on_13_September_1997.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Flowers_for_Princess_Diana%27s_Funeral.jpg/1200px-Flowers_for_Princess_Diana%27s_Funeral.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Wikinews-logo.svg/40px-Wikinews-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/ae/Flag_of_the_United_Kingdom.svg/21px-Flag_of_the_United_Kingdom.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/EC1835_C_cut.jpg/16px-EC1835_C_cut.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Alma_tunnel_Paris.jpg/220px-Alma_tunnel_Paris.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Flamme_de_la_Libert%C3%A9_Place_de_l%27Alma_2017-09-01_3.jpg/220px-Flamme_de_la_Libert%C3%A9_Place_de_l%27Alma_2017-09-01_3.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Alma_flamme_de_la_Libert%C3%A9_%2B_tunnel.jpg/220px-Alma_flamme_de_la_Libert%C3%A9_%2B_tunnel.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Diana%2C_Princess_of_Wales_1997_%282%29.jpg/220px-Diana%2C_Princess_of_Wales_1997_%282%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Mercedes_W140_front_20070609.jpg/220px-Mercedes_W140_front_20070609.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Correspondence_regarding_death_of_Diana%2C_Princess_of_Wales_%281997%29_%2820393151714%29.jpg/220px-Correspondence_regarding_death_of_Diana%2C_Princess_of_Wales_%281997%29_%2820393151714%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/Flag_of_France.svg/21px-Flag_of_France.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/EC1835_C_cut.jpg/24px-EC1835_C_cut.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Flowers_for_Princess_Diana%27s_Funeral.jpg/240px-Flowers_for_Princess_Diana%27s_Funeral.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Flowers_for_Princess_Diana%27s_Funeral.jpg/1200px-Flowers_for_Princess_Diana%27s_Funeral.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Death_of_Diana,_Princess_of_Wales", "title": "Death of Diana, Princess of Wales", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/Flowers_for_Princess_Diana%27s_Funeral.jpg/640px-Flowers_for_Princess_Diana%27s_Funeral.jpg", "width": 640, "height": 409}, "title": "Death of Diana, Princess of Wales - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}