{"url": "ew.com/movies/2017/04/26/jonathan-demme-dead-celebs-react/", "text": "Jonathan Demme, the Oscar-winning director of The Silence of the Lambs, Philadelphia, Rachel Getting Married, and much more, died Wednesday at age of 73.\n\nDemme’s varied career not only covered feature films; he was an accomplished director of concert films and documentaries as well, working with an equally diverse array of talent, from Oprah Winfrey and Laura Dern to Justin Timberlake and Spalding Gray.\n\nAs news of the filmmaker’s death continues to spread, celebrities and influencers within the entertainment industry have begun sharing their reactions on social media. See a selection of remembrances below.\n\n“A big hearted, big tent, compassionate man- in full embrace in his life of people in need- and of the potential of art, music, poetry and film to fill that need- a big loss to the caring world.” — Meryl Streep\n\n“Jonathan taught us how big a heart a person can have, and how it will guide how we live and what we do for a living. He was the grandest of men.” — Tom Hanks\n\n“I am heart-broken to lose a friend, a mentor, a guy so singular and dynamic you’d have to design a hurricane to contain him. Jonathan was as quirky as his comedies and as deep as his dramas. He was pure energy, the unstoppable cheerleader for anyone creative. Just as passionate about music as he was about art, he was and will always be a champion of the soul. JD, most beloved, something wild, brother of love, director of the lambs. Love that guy. Love him so much.” — Jodie Foster\n\n“I am really shocked and very sad to hear about Jonathan’s passing. He was one of the best, and a really nice guy as well who had such a great spirit. My condolences to his family.” — Anthony Hopkins\n\n“Jonathan Demme came into my life when he directed me in Melvin and Howard. I won an Oscar for that role and I can’t imagine that having happened with any other director. He was pure magic. Brilliant technically but he never let that make him isolated. He included everyone on that set in the making of the movie in the most edgy, thrilling, wildly collaborative way. He did the same thing in Philadelphia. And, there, we never forgot for a moment that that film could change the experience of being HIV positive in this country and it did. The heartbeat and the integrity of it began with Jonathan’s goodness and sense of justice. I’m so proud to have been in it.\n\nI think the last public appearance he may have made was to host the NYC screening of my son, Charlie McDowell’s film, The Discovery. It can’t have been easy for him to go to NYC from Nyack and do that a couple of weeks before his death. But Jonathan celebrated and honored creativity more fiercely than anyone I have ever known. My daughter worked with him in The Manchurian Candidate. We all admired him so much. I send all of our family’s love to his beautiful family and I will hold him where he’s always been, in my heart, forever.” — Mary Steenburgen\n\n“Whenever I ran into Jonathan, he was filled with enthusiasm and excitement about a new project. He took so much joy in moviemaking. His pictures have an inner lyricism that just lifts them off the ground — even a story like The Silence of the Lambs. I have great admiration for Jonathan as a filmmaker — I love the freshness of his style and his excellent use of music, from Buddy Holly to Miklos Rozsa. There’s so much more to be said, and I hardly know where to begin. I also loved him as a friend, and to me he was always young. My young friend. The idea that he’s gone seems impossible to me.” — Martin Scorsese", "images": ["https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F07%2F14%2FJosh-Hartnett-The-Faculty-071422.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Few.com%2Fimg%2Fmisc%2F300x250_magazines_and_more.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F08%2F05%2FBrett-Goldstein-Hannah-Waddingham-Three-Rounds-080522-2.jpg", "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F04%2Fgettyimages-523360674-2000.jpg", "data:image/svg+xml,%3Csvg%20xmlns='http://www.w3.org/2000/svg'%20viewBox='0%200%20100%20100'%3E%3C/svg%3E", "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2022%2F08%2F16%2FBetter-Call-Saul_081622_4.jpg"], "top_img": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F04%2Fgettyimages-523360674-2000.jpg", "keywords": [], "authors": ["Dan Heching", "April", "At Am Edt"], "canonical_link": "https://ew.com/movies/2017/04/26/jonathan-demme-dead-celebs-react/", "title": "Celebrities react to the death of Jonathan Demme: 'He could do anything'", "meta_data": {"viewport": "width=device-width,initial-scale=1", "theme-color": "#111", "keywords": "entertainment, entertainment news, ew, entertainment weekly", "news_keywords": "entertainment, entertainment news, ew, entertainment weekly", "description": "Jonathan Demme, Oscar-winning director of The Silence of the Lambs, died Wednesday at 73.", "robots": "max-image-preview:large", "og": {"title": "Celebrities React to the Death of Jonathan Demme: 'He Could Do Anything'", "type": "article", "site_name": "EW.com", "url": "https://ew.com/movies/2017/04/26/jonathan-demme-dead-celebs-react/", "description": "Jonathan Demme, Oscar-winning director of The Silence of the Lambs, died Wednesday at 73.", "image": {"identifier": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F04%2Fgettyimages-523360674-2000.jpg", "width": 2000, "height": 1000}}, "pinterest": {"url": "https://ew.com/movies/2017/04/26/jonathan-demme-dead-celebs-react/", "media": "https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F04%2Fgettyimages-523360674-2000.jpg"}, "twitter": {"card": "summary_large_image", "url": "https://ew.com/movies/2017/04/26/jonathan-demme-dead-celebs-react/", "title": "Celebrities React to the Death of Jonathan Demme: 'He Could Do Anything'", "description": "Jonathan Demme, Oscar-winning director of The Silence of the Lambs, died Wednesday at 73.", "site": "@ew", "image": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=face&w=2000&h=1000&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F6%2F2017%2F04%2Fgettyimages-523360674-2000.jpg"}, "fb": {"app_id": 2485718348341688, "pages": 52150999700}, "article": {"opinion": "false"}, "url": "https://ew.com/movies/2017/04/26/jonathan-demme-dead-celebs-react/"}, "movies": [], "publish_date": 1493161200.0, "source": "http://ew.com", "summary": ""}