{"url": "https://www.sofeminine.co.uk/fashion-trends/vanessa-hudgens-coachella-festival-fashion-s1806422.html", "text": "Coachella is the one festival we love more for its trend inspo than for its tunes, and no one dresses better for the occasion than the definition of #goals, Vanessa Hudgens. Whether it's her mermaid mane or her embellished threads, every year we eagerly await the moment she showcases her outfit game... and then cry into our sorry pile of flash tattoos and glitter. So, while you wait for this year's big reveal, here's a look at all the times she proved she was the queen of boho.\n\n1. Case in point, these lit nails!\n\nNo outfit is complete without a magnificent mani, and this intricate nail art is pretty magnificent. Plus, they're a pretty good excuse for getting out of putting up that sh*tty ass tent. Lol.\n\n2. When she went all kinds of sexy mermaid...\n\nand dyed her tresses for days HOT pink. This is ombre done oh-so-right.\n\n3. When she brought back the noughties coin waist belt (remember those?!)\n\nand made it look nothing like before.\n\n4. When she made the kaftan a field-side thang\n\nVanessa nailed this look. Loving those mirrored shades too!\n\n5. When she outdid our poor attempt at experimenting with hair chalk\n\nAnd looked ah-mazing, naturally.\n\n6. Then there was the time she donned the pretty embellished bindi\n\nVanessa gets extra style points for matching her pink lippy to her hair AND rocking loose braids before they became a thing. Appaz she's pretty psychic as well as down right beautiful. Gee that woman's got it all.\n\n7. When she went where many festival goers have been before, only we failed\n\nNothing says Coachella more than a floral crown, and heck, why not go full on matchy-matchy with turquoise tresses too? Always one step ahead that VH.\n\n8. When she showed us she's got the most fashionable gal pals ever\n\nWhat a good looking squad - Vanessa's gal pals are just as 'chella chic as she is. And you know what they say, friends that pose upside down together stay together...\n\n9. And now for the time she told the story of Coachella...\n\nThrough a series of yoga poses, as you do. Namaste Nessy, namaste.\n\n10. When she introduced us to another one of her many talents: Jewellery layering\n\nIt's all in the detail - crochet, coloured hair and she even matched her mani to her accessories.\n\n11. When she did the whole shebang and it still wasn't too much\n\nWith her tousled long locks, jewelled head piece and striking printed dress, VH proves exactly why she's our Coachella queen.\n\n12. The time she made us want to learn how to crochet\n\nThis look ticks all the festival fashion boxes in one: feathers, coin accessories and crochet. No wonder she looks so smug!\n\n13. When she showed us that no festival is complete without glitter tats and floppy hats\n\nAKA the perfect components to watch the sun set over another day in 'chella paradise, don'tcha know!\n\n14. And the time she made suede and shade a thing\n\nA suede jacket is the perfect cover up for chilly nights at 'chella, and it's just common knowledge that no festival wardrobe is complete without denim shorts. Glow sticks optional obvs.\n\n15. When her nails upstaged every outfit we've ever owned\n\nHer embellished 2016 set will go down in history as the mani of our dreams. FACT.\n\n16. When she went matchy matchy with her sissy and gave us sibling goals\n\nWe're feeling those seventies vibes ladies. *runs to Hobbycraft to purchase peacock feathers in bulk.*\n\n17. When she made crochet and dungarees a thing\n\nHow come we never look this good in our dunga's, aye?\n\n18. Or how about that time she donned cliche festival chic but still made it work?\n\nAnyone else would look out of place in a kaftan and flowers in their hair, but not our girl Nessy.\n\n19. Or when she partied with Emily Ratajkowski and it was everything\n\nTwo of our biggest girl crushes together in one photo. *sigh*\n\n​Vanessa we salute you. Fancy bringing us along this year?\n\n© Instagram\n\nWho's your Coachella style hero? Let us know @SoFeminineUK\n\nYou might also like:\n\nThe 18 Curvy Women On Instagram Who Prove Big Is Beautiful\n\nThe Best Outfit Ideas For Your Festival Style\n\nHow To Pull Off Pink And Still Look Classy With It", "images": ["https://assets.afcdn.com/manage/redacteur/default_s50.png", "https://static.afcdn.com/relen/lazyload.png", "https://assets.afcdn.com/story/20170410/1071562_w944h530c1cx187cy189.webp", "https://assets.afcdn.com/story/20170410/1071562_w1200h630c1cx187cy189.jpg"], "top_img": "https://assets.afcdn.com/story/20170410/1071562_w1200h630c1cx187cy189.jpg", "keywords": [], "authors": ["Rose Adams"], "canonical_link": "https://www.sofeminine.co.uk/fashion-trends/vanessa-hudgens-coachella-festival-fashion-s1806422.html", "title": "14 Times Vanessa Hudgens Was The Queen Of Coachella", "meta_data": {"viewport": "width=device-width, initial-scale=1", "HandheldFriendly": "true", "format-detection": "telephone=no", "dailymotion-domain-verification": "dmgk9kl5le4mk5ntk", "robots": "max-video-preview:-1", "og": {"locale": "en_GB", "type": "article", "title": "14 Times Vanessa Hudgens Was The Queen Of Coachella", "description": "Slaying the 'chella style game YoY", "image": {"identifier": "https://assets.afcdn.com/story/20170410/1071562_w1200h630c1cx187cy189.jpg", "width": 1200, "height": 630}, "url": "https://www.sofeminine.co.uk/fashion-trends/vanessa-hudgens-coachella-festival-fashion-s1806422.html", "site_name": "sofeminine"}, "fb": {"app_id": 293962547317905}, "twitter": {"card": "summary_large_image", "title": "14 Times Vanessa Hudgens Was The Queen Of Coachella", "description": "Slaying the 'chella style game YoY", "image": {"src": "https://assets.afcdn.com/story/20170410/1071562_w1200h630c1cx187cy189.jpg"}, "app": {"id": {"iphone": 356346063, "googleplay": "com.aufeminin.aufemininnews"}, "name": {"iphone": "sofeminine Buzz", "googleplay": "sofeminine Buzz"}, "url": {"iphone": "sofemininenews://story?id=1806422", "googleplay": "sofemininenews://story?id=1806422"}, "country": "GB"}}, "al": {"iphone": {"app_store_id": 356346063, "app_name": "sofeminine Buzz", "url": "sofemininenews://story?id=1806422"}, "android": {"package": "com.aufeminin.aufemininnews", "app_name": "sofeminine Buzz", "url": "sofemininenews://story?id=1806422"}}, "article": {"section": "Fashion", "modified_time": "2016-04-11T15:45:00+00:00", "author": "Rose Adams", "published_time": "2016-04-11T15:45:00+00:00"}, "description": "Coachella is the one festival we love more for its trend inspo than for its tunes, and no one dresses better for the occasion than the definition of #goals, Vanessa..."}, "movies": [], "publish_date": null, "source": "https://www.sofeminine.co.uk", "summary": ""}