{"url": "https://www.vulture.com/2017/10/fall-tv-2017-lessons-for-network-tv.html", "text": "Photo: ABC/NBC/CBS\n\nNetwork execs hoping the new fall season would shake up the gloomy narrative surrounding the broadcast TV industry aren’t finding many reasons for optimism in the early Nielsen numbers. Year-to-year declines, particularly among younger viewers, have been positively brutal: NBC, CBS, and Fox all saw their premiere week Nielsen averages among adults under 50 decline between 16 and 24 percent. ABC claimed a victory of sorts by remaining flat compared to 2016, but that’s only because last year’s premiere week numbers were particularly awful.\n\nNetwork suits will note that these early numbers matter far less than they used to, and that’s true — to a point. Ratings are mostly about setting rates for advertising, and advertising can now represent less than half a network’s overall income. (Broadcasters also make money selling their shows to streaming outlets and international buyers, or getting folks to subscribe to streaming services they control, such as Hulu and CBS All Access.) Still, much like opening-weekend box office in the film world, how TV shows perform in the first few weeks of the season can often be predictive of their ultimate worth to a network. That makes these fall numbers worth paying attention to, and even worthy of drawing a few initial impressions from. Here are three early takeaways from the Nielsen tea leaves.\n\nNetwork Audiences Want Comfort Food\n\nAt a time when real-world events seem unrelentingly grim, audiences appear to be turning to TV for the small-screen equivalent of comfort food. The trend toward warm and fuzzy began last season with the unexpectedly huge success of NBC’s This Is Us, an unashamed tearjerker whose message of family unity and love was the perfect antidote to the nastiness of the 2016 presidential election. With the state of the union even more depressing (at least for the 55 percent of the country unhappy with President Trump), the Peacock’s family drama returned last week to record ratings. And although this season brought no direct This Is Us clones, there’s early evidence to suggest shows that tap into the same uplifting Zeitgeist are connecting with audiences.\n\nABC’s The Good Doctor, with Freddie Highmore as a pediatric surgeon with autism, is shaping up as the new season’s first breakout hit, giving ABC its best numbers for a new drama since 2014’s launch of How to Get Away With Murder. (It’s already been picked up for a full season.) Similarly, Fox’s The Orville has also generated some decent numbers during its first few weeks on the air. A couple of Sunday airings boosted by Fox’s NFL lead-in exposed the Seth MacFarlane–created Star Trek homage to nearly 12 million viewers; the show’s debut was Fox’s best drama launch since Empire. Ratings have fallen back to Earth since the show shifted to its regular Thursday slot, but even so, it’s still helped Fox to its best numbers on the night in over two years. MacFarlane is known for his crass, even cynical humor, but Orville offers a more optimistic, even earnest worldview — and in 2017, his fans seem to be embracing it. Likewise, early ratings for ABC’s new comedy The Mayor, in which a millennial rapper (accidentally) rides a hope-and-change message into public office, are encouraging.\n\nTo be sure, simply serving up sweetness and light doesn’t guarantee an audience. ABC’s pseudo-spiritual Jason Ritter drama Kevin (Probably) Saves the World, for example, probably won’t be around for too long after a decidedly weak premiere on Tuesday. And dark dystopias remain popular, or at least in the cultural Zeitgeist: Hulu’s The Handmaid’s Tale just cleaned up at the Emmys, and while there’s no way of knowing how many people are actually watching — the service doesn’t release ratings — it’s certainly become a pop-culture phenom. AMC’s The Walking Dead franchise is also still a massive hit, even if same-day ratings for its Fear the Walking Dead spinoff are down by more than a third this season. But as one network exec told Vulture last week, viewers seem to be in the mood for shows which offer a bit of inspiration in a world gone mad. Indeed, it’s probably no coincidence left-leaning MSNBC has seen a massive Nielsen surge since Trump’s inauguration, or that Stephen Colbert — he of the sharply written anti-Trump monologues — is now TV’s most-watched late-night show. While a riveting Rachel Maddow sermon or Colbert rant aren’t exactly “heartwarming,” they can serve as nightly salves for angry liberals (or even some Never Trump conservatives) looking for a way to deal with the current occupant of 1600 Pennsylvania Avenue. “People want things that make them feel good,” the exec says.\n\nFamiliarity Is Breeding Success\n\nCritics love to complain whenever a new TV reboot, revival, or spinoff is announced. Almost instinctively, these kinds of shows are dismissed as money grabs or proof of creative bankruptcy. But viewers this fall don’t seem to share those concerns, at least so far. More than 15 million people checked out NBC’s resurrection last week of Will & Grace, a series which limped off the air in 2006 and didn’t have anywhere near the sort of successful syndicated afterlife of a Friends or Seinfeld. CBS’s special sneak preview of Young Sheldon, its prequel/spinoff of The Big Bang Theory, did even better: Its audience tally is at 23 million viewers and counting, the biggest new comedy launch on TV since 2011. And over at HBO, the long-delayed ninth season of Curb Your Enthusiasm has already racked up 2.3 million viewers, a bigger number than any episode from season seven (the last time Curb aired in the fall) and on par with the show’s season eight premiere (which was boosted by a True Blood lead-in).\n\nIt’s early, of course. Fox’s The X-Files reboot a couple years back opened huge and then faded fast, though it still did well enough to secure a renewal. NBC’s Will & Grace return seems particularly likely to suffer a sharp ratings drop-off in the next few weeks now that viewers who just wanted to see what all the revival fuss about have their curiosity sated. But even if they don’t do quite as spectacularly in the linear ratings going forward, the new economics of TV make these shows almost certain near-term successes. NBC renewed W&G for next season before seeing a single Nielsen number, in part because of a bigger deal with Hulu for the show’s old and new episodes. Reanimating the corpses of Will Truman and Grace Adler dramatically increased the digital worth of the original W&G episodes, making the show’s revival profitable from the word go. Young Sheldon, meanwhile, offers CBS the best possible chance to hold on to TBBT’s ratings magic once the original show signs off in a couple seasons: Even if it does two-thirds the ratings of the mothership series, it’ll represent a big win for the Eye.\n\nThe Sophomore Slump Is Real\n\nIt was once common for hit freshman shows to return the next season and score even better ratings. Viewers who heard good buzz about a newcomer would catch up with reruns over the summer and then hop on the bandwagon the next fall. Peak TV has all but buried that practice: Networks now expect almost every series, new or returning, to lose some ground each year due to increasing competition, or because audience shift to nonlinear platforms are not measured by Nielsen. But even in this age of diminished expectations, the ratings declines for some of last season’s big drama “hits” have been shocking. Sure, NBC’s This Is Us actually returned stronger than ever, but that’s an outlier for network dramas. Fox’s Lethal Weapon, CBS’s Bull, and ABC’s Designated Survivor, however, all began their second seasons down around 40 percent compared to where they launched one year ago (and that’s including three days of DVR replays). The Eye’s MacGyver reboot did even worse, losing more than half of its 2016 premiere demo ratings when it came back last Friday.\n\nIt’s worth noting that all of the aforementioned shows had already suffered significant audience erosion over the course of their first seasons, losing millions of viewers after their initial launches. Lethal Weapon, after premiering in September 2016 with a 2.9 rating, was down to a 1.8 live plus three rating among adults under 50 when it signed off last March. Its premiere last week came in at a 1.7 rating, virtually on par with its finale numbers. In other words, Lethal Weapon isn’t anywhere near the hit it appeared to be last fall, but it didn’t bleed all that many viewers over the summer. A similar scenario played out with the other returning dramas. The question now is whether these sophomore shows stabilize, or keep declining as the season grinds on. History suggests the erosion will continue.", "images": ["https://pyxis.nymag.com/v1/imgs/e33/6e7/aed044d06bd5c293490430f400dc112e41-2022Cov4x5-AsianAmericaPkg.w240.jpg", "https://pyxis.nymag.com/v1/imgs/31a/165/7b2cda49d5258316afceb071e56d8d3a8b-women-3.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/4ec/fab/93b55a6497b7b8a57b10f2e8457453e29a-05-fall-tv-split.rsquare.w700.jpg", "https://pyxis.nymag.com/v1/imgs/4ec/fab/93b55a6497b7b8a57b10f2e8457453e29a-05-fall-tv-split.1x.rsocial.w1200.jpg", "https://www.vulture.com/media/components/customer-alert-banner/close_x.svg", "https://www.vulture.com/media/components/customer-alert-banner/alert.svg", "https://pyxis.nymag.com/v1/imgs/5ea/81e/4d3b39a96107c321338c0c9a25557bd47f-zarifa-ghafari.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/c32/3bf/0a393283dc1f3f9257ff8b361ea03216c8-russia-missile.2x.rsquare-zoom.w75.jpg", "https://www.vulture.com/media/components/customer-alert-banner/double_chevron.svg"], "top_img": "https://pyxis.nymag.com/v1/imgs/4ec/fab/93b55a6497b7b8a57b10f2e8457453e29a-05-fall-tv-split.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["Josef Adalian"], "canonical_link": "https://www.vulture.com/2017/10/fall-tv-2017-lessons-for-network-tv.html", "title": "In the Age of Trump, Comfort Food TV Is Working", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "parsely-tags": "fall tv 2017, tv, network tv, the good doctor, young sheldon, this is us, reboots, revivals, will & grace, curb your enthusiasm, the orville, msnbc, the late show with stephen colbert, the industry, fall tv, vulture homepage lede, featuretype:news-commentary and analysis, featuretype:feature", "og": {"title": "In the Age of Trump, Comfort Food TV Is Working", "url": "https://www.vulture.com/2017/10/fall-tv-2017-lessons-for-network-tv.html", "description": "And two more early lessons about the 2017 fall season.", "image": "https://pyxis.nymag.com/v1/imgs/4ec/fab/93b55a6497b7b8a57b10f2e8457453e29a-05-fall-tv-split.1x.rsocial.w1200.jpg", "site_name": "Vulture", "type": "article"}, "twitter": {"title": "In the Age of Trump, Comfort Food TV Is Working", "description": "And two more early lessons about the 2017 fall season.", "image": "https://pyxis.nymag.com/v1/imgs/4ec/fab/93b55a6497b7b8a57b10f2e8457453e29a-05-fall-tv-split.2x.rsocial.w600.jpg", "card": "summary_large_image", "creator": "@tvmojoe", "site": "@vulture"}, "article": {"published_time": "2017-10-05T14:31:33.811-04:00", "tag": "fall tv 2017, tv, network tv, the good doctor, young sheldon, this is us, reboots, revivals, will & grace, curb your enthusiasm, the orville, msnbc, the late show with stephen colbert, the industry, fall tv, vulture homepage lede", "publisher": "https://www.facebook.com/Vulture"}, "description": "In the Trump era, audiences are flocking to TV comforts. A ratings breakdown for network hits like This Is Us, Young Sheldon, and The Good Doctor.", "robots": "max-image-preview:large", "sailthru.tags": "fall tv 2017, tv, network tv, the good doctor, young sheldon, this is us, reboots, revivals, will & grace, curb your enthusiasm, the orville, msnbc, the late show with stephen colbert, the industry, fall tv, vulture homepage lede", "author": "Josef Adalian", "fb": {"app_id": 158902697551841}, "type": "Article", "vertical": "Vulture", "apple-mobile-web-app-title": "Vulture", "application-name": "Vulture", "msapplication-TileColor": "#00bcf1", "msapplication-TileImage": "https://assets.nymag.com/media/sites/vulture/icon.144x144.png"}, "movies": [], "publish_date": 1507228293.811, "source": "https://www.vulture.com", "summary": ""}