{"url": "https://web.archive.org/web/20190407172726/https://the100.fandom.com/wiki/The_Warriors_Will", "text": "“ If you put us in the arena, I won't be losing a daughter. Gaia will win. I will have her take my life - right after I take your brother's. ” — Indra to Octavia\n\nThe Warriors Will is the tenth episode of the fifth season of The 100. It is the sixty-eighth episode of the series overall.\n\nMonty strives to show Wonkru an alternative to war, and to the valley itself. Meanwhile, Abby's health continues to deteriorate, along with McCreary's patience.[1]\n\nContents show]\n\nPlot Edit\n\nOctavia is contemplating her next move when Miller and Brell bring bad news that there are now divisions among Wonkru. Some of them want to follow the real commander, Madi. Brell suggests that the only way to unite Wonkru behind Blodreina is to remind them the rule - that anyone against Wonkru is an enemy of Wonkru. That means, she should put the traitors - Bellamy, Indra and Gaia - to fight to the death in the pit. She would then use fear to make Wonkru follow her.\n\nWhile the plan might work, Octavia is worried that Bellamy might die. She still cares deeply about him. So, she goes to Indra to look for ideas on a different strategy. She brings up how Indra accepted her and trained her as her second when her own people didn't believe in her. She gets teary as she wonders why Indra would betray her. Indra doesn't have a way for Octavia out of this. She warns Octavia that she plans to kill Bellamy and let Gaia kill her. That way, she doesn't lose a daughter. This gets Octavia even more worried. Since she knows Indra's weaknesses, she asks Monty to go tell Bellamy to help him win. But Monty refuses and asks Octavia to face Bellamy herself. Monty then shows Octavia that he's been able to revive the hydrofarm and it's just a matter of time before the ground above is ready for growing crops as well. So, there is no need to fight for the valley. He shows Octavia an apple blossom flower that he had been able to grow... but Octavia plucks it and walks out, angrily.\n\nOctavia is left with no choice but to go talk to Bellamy herself. She starts by reminding him of how he used to protect her when she was a kid. She wonders why he's changed so much that he would poison her. Bellamy insists that he hasn't changed. He only did it to protect her. She's the one who changed by becoming Blodreina. Octavia tries to help him win the fight by telling him Indra's weakness - Indra's shoulder is still weak since she was shot by Pike years ago. She asks Bellamy to take advantage of that and kill Indra during the fight to the death. Bellamy refuses and insists that he won't fight. He asks Octavia to call off the fight instead if she really wants to save him. Octavia replies \"Will see\" and walks out. She starts crying. She then slits her wrists and paints her face with the blood, ready for the fight.\n\nBefore the fight in the arena, Bellamy wants to convince Indra and Gaia that they should all refuse to fight to see if Octavia would actually execute them herself. Indra admits that Octavia might not kill her or Bellamy but she would kill Gaia. So, Indra concludes that she must kill Bellamy to save her daughter. She promises to make it quick. She then strategizes with Gaia on how to fake a convincing fight before killing her. Gaia insists that all she cares about is to keep Madi safe... and that means killing Octavia. But Indra advises her against it because Octavia's guards would kill her right away. Octavia announces the start of the fight. After fighting for a couple minutes, Gaia is knocked down, but after regaining consciousness, she throws a spear aimed at Octavia. Luckily, it misses Octavia. Instead of retaliating, Octavia orders her guards to stand down; and instead throws the spear back on the floor and asks Gaia to continue fighting.\n\nSuddenly, Monty and Harper interrupt the fight. Monty is carrying a flowering plant. He reveal to everyone that the hydrofarm can now be used to grow food again, that they don't have to go fight, and that Octavia knew about it. This causes Octavia to lose credibility and many people start shouting \"Nou Blodreina nowe!\" (\"Red Queen no more!) In the chaos, Octavia slips away and burns down the hydrofarm. This leaves Wonkru with no choice but to follow her to fight for the valley.\n\nDisheartened, Octavia packs her things and starts walking towards the valley. Miller follows and invites anyone else who would like to join them. Since they have no choice, they all follow Octavia as they march towards the valley.\n\nMeanwhile at the valley, McCreary takes away Abby's drugs until she agrees to treat him. So, Abby uses Vinson to bring the drugs to her by pretending that he's coming for a medical check up. Unfortunately, Vinson gets busted by McCreary's guards. They attack him and he starts biting them. Abby uses the opportunity to get her hands on the drugs.\n\nOn their way to the valley, Madi insists that she wants to go back to the bunker to help her people but Clarke forces her to stay in the rover. They find that Octavia had kept the worms inside a bottle in the trunk. Clarke drops the bottle, releasing the worms onto the ground. Madi then starts getting scary memory flashes of the commanders before her - including Lexa and even Becca - because of the flame. When she mentions her plans to remove the flame, Madi asks her to destroy it because otherwise she will put it back in. However, when Madi goes to sleep, Clarke is unable to remove the flame after noticing Madi crying. Clarke tells Madi that she thinks of her as her child and she doesn't want to see her die young and horribly like the other commanders.\n\nUpon arriving at the valley, Clarke and Madi are shocked to see McCreary's people killing the defectors. When one of the prisoners is left to bury the dead, Madi and Clarke approach him and force him to tell them what's going on. He explains that McCreary is in charge now and that Diyoza is in hiding. They ask where to find Abby. After that, Madi kills him immediately. Clarke and Madi head to the gas station medical room. They find Abby lying on the floor, unconscious, due to overdosing.\n\nCast Edit\n\nStarring Edit\n\nGuest Starring Edit\n\nBarbara Beall as Brell\n\nAlbert Nicholas as Cosser\n\nStew McLean as McCreary's Guard #1\n\nDarian Martin as Royal Guard\n\nJesse Stretch as Huge Wonkru Guard\n\nMichael Patric as Nash\n\nMonique Ganderton as Aurora Blake (archive footage; uncredited)\n\nOlivia Steele Falconer as Young Octavia (archive footage; uncredited)\n\nJulia Dominczak as Anthem Singer (uncredited)\n\nHugo Raymudo as Hugo (uncredited)\n\nQuotes Edit\n\nPaxton McCreary (to Abby) : \"You don't look so good, Doc.\" Abigail Griffin: \"That makes two of us. Your lungs, they're, I can hear the fluid filling up in them. You're drowning. You're not even getting wet.\"\n\nOctavia Blake: You betrayed me, Indra. Indra: \"I betrayed Blodreina.\" Octavia Blake: \"What's the difference?\" Indra: \"Octavia kom Skaikru was my second.\"\n\nBellamy Blake: \"You either call this thing off and make a deal to share the valley, or you watch me die in that arena today because I'm not fighting. There's no coming back from this, O. If you do this, there's no coming back.\" Octavia Blake: \"I know you're still trying to save me, Bell, but you can't save someone who's already dead.\"\n\nBecca (through Madi) : \"No! Stop! Wait! Don't do this! Try it again, please. You're making a mistake. I can save you. I can save all of you. No! Stop! With my serum, you don't have to live in the bunker anymore! The Flame can change everything! No! You think he's saving you, but he's killing you!\"\n\nOctavia Blake: \"Must be nice, playing Adam and Eve in the garden of Eden while the rest of us fight to survive.\" Monty Green: \"Actually, No. It's awful.\" Harper McIntyre: \"Not as awful as fighting a war you don't need to fight.\" Octavia Blake: \"You fight to live, or you die. That is how we survived even when this farm stopped feeding us. If you were, you'd understand. The farmers won't save the world, Monty. The warriors will.\"\n\nNotes and Trivia Edit\n\nMadi meets Abigail Griffin for the first time, however, Abby is unconscious.\n\nThis episode includes a flashback of Becca's death. Madi sees it as a memory induced by the Flame.\n\nThis episode marks Paige Turco's 50th episode on The 100 .\n\n. Octavia Blake burns down the hydrofarm that Monty and Harper revived.\n\nBody Count Edit\n\n4 Wonkru defectors – shot by McCreary Cosser\n\ndefectors – shot by McCreary 2 Eligius prisoners - killed by Vinson\n\nNash (Eligius prisoner) – throat slit by Madi\n\nBecca – burnt alive by Second Dawn cult (in flashback)\n\nBehind the Scenes Edit\n\nJason Rothenberg confirmed on Twitter that Henry Ian Cusick directed this episode. [2] This is the second time a cast member directed an episode of The 100 , the first was The Other Side , which was also directed by Cusick.\n\nThis is the second time a cast member directed an episode of , the first was , which was also directed by Cusick. In November 2017, the title of this episode was reported to be \"The Last\".[3] However, in February 2018, Rothenberg revealed that after several real episode titles leaked, production decided to leak fake titles as decoys.[4] In June 2018, the real title, \"The Warriors Will\" was announced.[1]\n\nProduction Notes Edit\n\nMultimedia Edit\n\nMusic Edit\n\nImages Edit\n\nVideo Edit\n\nThe 100 5x10 Promo \"The Warriors Will\" (HD) Season 5 Episode 10 Promo The 100 5x10 Sneak Peek \"The Warriors Will\" (HD) Season 5 Episode 10 Sneak Peek The 100 5x10 Sneak Peek 2 \"The Warriors Will\" (HD) Season 5 Episode 10 Sneak Peek 2\n\nAdd a photo to this gallery\n\nSee Also Edit", "images": ["https://web.archive.org/web/20190407172726im_/https://vignette.wikia.nocookie.net/thehundred/images/8/85/5x10_-_Clarke_and_Madi.jpeg/revision/latest?cb=20180628021738", "https://web.archive.org/web/20190407172726im_/https://vignette.wikia.nocookie.net/fliplinefancustomers/images/0/01/Community-Page-Header.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20181211033656", "https://web.archive.org/web/20190407172726im_/https://vignette.wikia.nocookie.net/sacred-lies/images/9/92/Sacred_lies_episode_1.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20180828210510", "https://web.archive.org/web/20190407172726im_/https://slot1-images.wikia.nocookie.net/__cb8370028370012/common/extensions/wikia/WikiaBar/images/wikiabarIcon.png", "https://web.archive.org/web/20190407172726im_/https://vignette.wikia.nocookie.net/messaging/images/7/76/Avatar5.jpg/revision/latest/scale-to-width-down/50?format=jpg", "data:image/gif;base64,R0lGODlhAQABAIABAAAAAP///yH5BAEAAAEALAAAAAABAAEAQAICTAEAOw%3D%3D", "https://web.archive.org/web/20190407172726im_/https://vignette.wikia.nocookie.net/thehundred/images/5/53/The_100_5x10_Sneak_Peek_2_%22The_Warriors_Will%22_%28HD%29_Season_5_Episode_10_Sneak_Peek_2/revision/latest/scale-to-width-down/185?cb=20181128153718", "https://web.archive.org/web/20190407172726im_/https://vignette.wikia.nocookie.net/messaging/images/c/cf/Avatar6.jpg/revision/latest/scale-to-width-down/50?format=jpg", "https://web.archive.org/web/20190407172726im_/https://slot1-images.wikia.nocookie.net/__cb8310028310012/common/skins/common/images/magnify-clip.png", "https://web.archive.org/web/20190407172726im_/https://vignette.wikia.nocookie.net/thehundred/images/8/85/5x10_-_Clarke_and_Madi.jpeg/revision/latest/scale-to-width-down/350?cb=20180628021738", "https://web.archive.org/web/20190407172726im_/https://vignette.wikia.nocookie.net/americanhorrorstory/images/5/50/S8_BTS_Witches_Sarah_Stevie_and_Lily.jpg/revision/latest/zoom-crop/width/100/height/56?cb=20180828071752", "https://web.archive.org/web/20190407172726im_/https://vignette.wikia.nocookie.net/thehundred/images/4/4d/The_100_5x10_Sneak_Peek_%22The_Warriors_Will%22_%28HD%29_Season_5_Episode_10_Sneak_Peek/revision/latest/scale-to-width-down/185?cb=20181128153706", "https://web.archive.org/web/20190407172726im_/https://images.wikia.nocookie.net/__cb35/thehundred/images/8/89/Wiki-wordmark.png", "https://web.archive.org/web/20190407172726im_/https://vignette.wikia.nocookie.net/thehundred/images/b/b0/The_100_5x10_Promo_%22The_Warriors_Will%22_%28HD%29_Season_5_Episode_10_Promo/revision/latest/scale-to-width-down/185?cb=20180720172317", "https://web.archive.org/web/20190407172726im_/https://static.wikia.nocookie.net/a657b2c8-1610-43dd-87ab-cc11065933fe/scale-to-width-down/50"], "top_img": "https://web.archive.org/web/20190407172726im_/https://vignette.wikia.nocookie.net/thehundred/images/8/85/5x10_-_Clarke_and_Madi.jpeg/revision/latest?cb=20180628021738", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20190407172726/https://the100.fandom.com/wiki/The_Warriors_Will", "title": "The Warriors Will", "meta_data": {"viewport": "width=device-width, user-scalable=yes", "generator": "MediaWiki 1.19.24", "keywords": "The 100 Wiki,thehundred,The Warriors Will,Season 5,Episode Guide,The Warriors Will/Transcript,Sic Semper Tyrannis,Henry Ian Cusick,The Dark Year,Indra,Octavia,Season Five,The 100", "description": "The Warriors Will is the tenth episode of the fifth season of The 100. It is the sixty-eighth episode of the series overall. Monty strives to show Wonkru an alternative to war, and to the valley itself. Meanwhile, Abby's health continues to deteriorate, along with McCreary's patience.", "twitter": {"card": "summary", "site": "@getfandom", "url": "https://web.archive.org/web/20190407172726im_/https://the100.fandom.com/wiki/The_Warriors_Will", "title": "The Warriors Will | The 100 Wiki | FANDOM powered by Wikia", "description": "The Warriors Will is the tenth episode of the fifth season of The 100. It is the sixty-eighth episode of the series overall. Monty strives to show Wonkru an alternative to war, and to the valley..."}, "fb": {"app_id": 112328095453510}, "og": {"type": "article", "site_name": "The 100 Wiki", "title": "The Warriors Will", "description": "The Warriors Will is the tenth episode of the fifth season of The 100. It is the sixty-eighth episode of the series overall. Monty strives to show Wonkru an alternative to war, and to the valley itself. Meanwhile, Abby's health continues to deteriorate, along with McCreary's patience.", "url": "https://web.archive.org/web/20190407172726/https://the100.fandom.com/wiki/The_Warriors_Will", "image": "https://web.archive.org/web/20190407172726im_/https://vignette.wikia.nocookie.net/thehundred/images/8/85/5x10_-_Clarke_and_Madi.jpeg/revision/latest?cb=20180628021738"}, "apple-itunes-app": "app-id=1002383181, app-arguments=https://the100.fandom.com/wiki/The_Warriors_Will"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}