{"url": "https://www.thecut.com/2017/08/kathy-griffin-donald-trump-interview.html", "text": "Kathy Griffin walked into her home office just before noon in late June, still wearing pajamas. The comedian, who regularly stays up late, had just woken up to news of President Trump’s latest Twitter tear. Trump had covered a wide range of topics in a series of tweets, from denouncing Robert Mueller’s investigation into Russian interference in the election to House Democratic leader Nancy Pelosi and Senate Democratic leader Chuck Schumer — or, as Trump called him in a tweet that morning, “Cryin’ Chuck.”\n\n“Why are people still expecting me to apologize and grovel to a man that tweets like this?” Griffin vented to me. “I’m a comedian; he’s our fucking president.”\n\nIt had been 23 days since a photograph of Griffin holding a Donald Trump mask covered in fake blood completely altered her life. Cooked up as satire in a single afternoon, it first appeared on TMZ and then spread across social media rapidly, uniting Republicans and Democrats in outrage. Griffin released a video apology almost immediately after the photo’s release, but the damage was done; the next day, Trump intensified the backlash by tweeting a claim that his son Barron, 11, was having a difficult time dealing with the image. And members of the First Family, including Trump’s two older sons, launched an aggressive public campaign against Griffin.\n\nIn the following days, the Secret Service opened an investigation; Griffin was fired from the CNN New Year’s Eve broadcast that she had co-hosted with Anderson Cooper for ten years; a lucrative endorsement contract was canceled, and so were 15 scheduled live performances, owing to bomb threats, which she estimates cost her more than a million dollars. Thousands of death threats rolled in, some of her close friends abandoned her, and even her beloved Fox News–loving mother, Maggie Griffin, joked to her daughter that she would not have her support.\n\nA carefully choreographed apology tour might have helped Griffin move past the controversy — the video she filmed the day the photo was released felt hasty, and a defensive press conference a few days later was widely criticized after Griffin (who had, after all, fired the first salvo against Trump) presented herself as a victim. But moving on doesn’t seem to be on Griffin’s mind: The short promotional video she just released for her new Laugh Your Head Off tour of Europe, Australia, and New Zealand concludes with an image of her in the same blouse she wore in the infamous Trump photo, holding a globe in her hand instead of a Trump mask. And she’s still angry with the president.\n\n“President Trump just pardoned Joe Arpaio, who was essentially running a concentration camp in the Arizona desert,” she tells me over the phone this past weekend. “He said there are some good Nazis, and he’s kicking out young adults who were brought here as kids by their parents, and I’m the one who has to continue to apologize?”\n\nBetween these two conversations, I visited Griffin at her home in Los Angeles a number of times (we first met a dozen years ago at a party; in the last year, after she reached out to me via Twitter DM, we began discussing politics regularly). She paid $10.5 million last year for a 13,000-square-foot mansion with all the trappings; her next-door neighbors are Kim Kardashian and Kanye West. “I’ve moved in next door to my act!” she tells me. (She says they’re excellent neighbors and don’t make any noise. When I was with Griffin, Kardashian sent her a text message to see how she was feeling.)\n\nGriffin, who made her career by mocking celebrities, is not the most likely comedian to be martyred over the inalienable right to criticize the president. But in the past couple of years, her act has become more and more political. She says that has led some of her fans to bristle. “Comedians talk about what their audience is faced with every day, we try to relate to our audience,” she says. “I’m obsessed with politics. I always have been, and now, with Trump, many people are obsessed with politics, so that’s going to be a big part of my act.”\n\nIn the course of our talks, the theme she returned to most forcefully was the right to provoke with humor. Griffin describes a visit to an LGBT center in Los Angeles, during which an AIDS patient asked her to mock him so he could feel normal, as a defining moment in her career, and an example of the value of seemingly outrageous comedy. “I would be abandoning my principles as a comic and a human being if I backed off President Trump or any public person,” she tells me. “Comics by their nature are anti-Establishment. They are charged with the often unenviable task of going after people in power. I will never abdicate that responsibility.”\n\nGriffin fears the impact of what happened to her will resonate further. “When the president tweeted about me the morning after I released the image, it served as an executive order of sorts to his family and supporters to go after me,” she says. “You may say I deserved it, but just think about it … the president of the United States and his family are going after a stand-up comic who had a show on the Bravo network called My Life on the D-List. If that isn’t punching down, I don’t know what is.”\n\nGriffin says she isn’t a victim: “I am in a position of privilege, I will be fine,” she says. “But what about any American citizen, whether they’re artists or not, who innocently post a shocking photo on social media — will they face a federal investigation?” Griffin also worries about the “chilling effect” created by the retribution wielded by a vengeful president and his army of supporters. She thinks that just as she’s taken responsibility for her provocative image, Trump “has to take responsibility for the power he holds with his Twitter account.”\n\nEven if one agrees with Griffin’s sentiments, it’s fair to wonder what the image of Trump’s severed head signified beyond the obvious interpretation, and whether Griffin should have realized how much blowback it would create, given the hyperpolarized media environment that surrounds the president.\n\nRick Wilson, a longtime Republican political consultant who denounced Trump early and hasn’t wavered since, says he found Griffin’s image “way outside the boundaries and unhelpful against the cause. I understand how strong passions against Trump run, mine do very frequently, but people are always looking for reasons to delegitimize you.” Charlie Sykes, a conservative political commentator and former radio host who is famously anti-Trump, tells me that Griffin gave Trump and his supporters a big gift by releasing the image. “The moment I saw the picture, I knew [the outcry from Trump and his supporters] was going to happen. It’s a useful meme for Trump: It’s the left that incites violence, it’s the left that engages in hate.”\n\nPhoto: Robert Maxwell\n\nThe photos were improvised in an afternoon: Tyler Shields, a celebrity photographer known for his provocative images (he once shot an image of a black man hanging a member of the KKK), was taking some updated portraits of Griffin, and afterward, they decided to create some spoof images involving Trump. Griffin dispatched her assistant to find a Trump mask and a friend made fake blood using ketchup. They wanted to comment on Trump’s infamous comments about Megyn Kelly — “blood coming out of her eyes, blood coming out of her wherever” — after she questioned him about his history of sexist comments in the first Republican presidential debate in 2015.\n\nWith Griffin’s permission, Shields (who did not respond to requests for comment) released the image — although he didn’t tell her where it would go first. Shields, according to Griffin, chose to give it to TMZ, and the Trump-friendly tabloid’s framing — “Kathy Griffin wants Donald Trump’s head … but she wants it bloody and detached from his body” — didn’t ponder any deeper meanings. Griffin, perhaps naively, assumed that no one would ever think she actually wants to kill anyone, much less the president of the United States. But that’s exactly what some people thought.\n\nChelsea Clinton tweeted, “This is vile and wrong. It is never funny to joke about killing a president.” Will & Grace star Debra Messing, who regularly tweets about her distaste for Trump, tweeted, “It wasn’t right when peoplel [sic] hung lynched Obama effigies, just as what Kathy Griffin did isn’t right now.”\n\nWhen I first saw the photo on Twitter, I assumed it was a private, unfortunate gag that had leaked somehow. (Despite Griffin’s reputation as a shock comic, she is also an astute manager of her image and her act who keeps a First Amendment attorney on retainer.)\n\nI called Griffin as the heat was building, but at that point she wasn’t at all concerned. Her first question was, “Oh, is it getting around?” I discouraged her from posting the photo on her own accounts, which have millions of followers, but there was no stopping her — she told me that she was well-versed in dealing with controversy. After it became clear that Griffin stood behind the image, a brewing controversy turned into a full-on firestorm. Three hours later, I got an Instagram alert on my phone: Griffin had posted her apology video.\n\nIt was a call from Rosie O’Donnell that made Griffin realize the mistake she had made. O’Donnell arguably has had more ire directed at her from Trump than any other celebrity, but she confirmed to me that she asked Griffin a simple question: “What is James Foley’s mom going to think when she sees this?” Foley, an American journalist, was beheaded by ISIS in 2014 while on assignment in Syria.\n\nGriffin’s apology appeared to satiate her liberal fan base, but Republicans continued to be outraged. Her hope was that things would calm down over the next few days and she could try to return to normal life. But they didn’t. The next morning, as many expected, Trump tweeted about the incident: “Kathy Griffin should be ashamed of herself. My children, especially my 11 year old son, Barron, are having a hard time with this. Sick!”\n\nThe First Lady, Melania Trump, released a statement questioning Griffin’s mental health saying, “[A] photo opportunity like this is simply wrong and makes you wonder about the mental health of the person who did it.” The reaction from Trump’s sons and daughter-in-law was even more aggressive. Donald Trump Jr. tweeted repeatedly about Griffin and even tweeted at CNN anchor Jake Tapper asking him if Griffin would be fired. Lara Trump, who is married to Trump’s son Eric, appeared on Sean Hannity’s program on Fox News to denounce Griffin. (The White House declined multiple requests to comment on this story.)\n\nIt’s hard to imagine any other U.S. president, much less his family, going after any entertainer the way Trump and his family went after Griffin. Wilson told me that he finds it ironic that Trump, who rode into the White House on a platform of decrying political correctness, has presided over the development of a “highly refined outrage culture, particularly around himself. There is no humor. He and his supporters will go to DEFCON 1 if they sense there’s something that offends him.” Wilson added that he has also dealt with death threats and loss of business because of his commentary about Trump.\n\nSykes and Wilson both tell me they refuse to accept that Trump was truly offended by Griffin’s image. On June 23, it was revealed that Al Baldasaro, a member of New Hampshire’s House of Representatives and a top Trump supporter, was a guest of Trump’s at a bill-signing at the White House. During the 2016 campaign, Baldasaro said on two occasions that Hillary Clinton should have been shot by a firing squad.\n\nAs the photo spread around the internet, Griffin’s social media was flooded with detailed and gruesome death threats. The agency that represented Griffin for television work had to shut down their switchboard because they were flooded with angry calls. In the week after, she received death threats via mail — some of the messages, which I reviewed, were stunning and frightening in their specificity.\n\nFox News featured the Griffin controversy throughout their programming, and their opinion hosts talked about it length. While many news programs have blurred the image of Trump’s head, Hannity showed it in its original form repeatedly over the past 89 days, even though he claims that the image could incite violence against Trump. A Fox News spokeswoman declined an interview on Hannity’s behalf.\n\nThere’s a chance that Griffin could have recovered from the controversy much sooner, had she not made the fateful decision to hold a press conference with her newly retained attorney Lisa Bloom just three days after the photo was released. Bloom, known as an attorney who specializes in women’s advocacy, is a ubiquitous presence on cable television whose fame has increased as she has been retained by clients who have accused President Trump and former Fox News host Bill O’Reilly of sexual assault and harassment, respectively.\n\nBefore the press conference, Griffin received text messages and emails from friends, begging her not to go through with it; they felt it would only further inflame the situation. But Griffin felt that she would look erratic if she canceled, and she was also feeling wounded by all the attacks. It was a disaster: Griffin appeared defensive and nervous instead of resolute. She talked as if she had been the victim of an unprovoked attack. “None of the points I wanted to make in that press conference came across because I said I was a victim and acted like a victim. I take responsibility for that,” she says.\n\nIn the aftermath, Griffin says she couldn’t even find a reputable crisis-management expert to take her on as a client, and she still hasn’t found a publicist. Entreaties from her team are met with responses like, “We aren’t taking on new clients right now” — Hollywood speak for “we don’t want you.” Griffin decided to leave WME, the agency that has represented her for television projects, but she is staying with her longtime concert agent at ICM.\n\nMeanwhile, other stars who’ve made statements that have landed them in the crosshairs of the Secret Service — like Johnny Depp, who made a Trump assassination joke on camera — have seen the ensuing controversy swiftly go away (it helps that Trump didn’t tweet about Depp).\n\nFor the past two and a half months, Griffin, who says she traveled to 80 cities last year as part of her comedy concert tour, has been in hibernation. She’s gone to five social functions and a few business meetings. In July, Griffin’s sister Joyce was diagnosed with cancer and Griffin shaved her head in solidarity. The thousands of death threats have trickled to mere hundreds. The Secret Service investigation, after an hour-long interview, remained open for two months, stoking Griffin’s fear that somehow the levers of government power might be used against her, until her lawyer was finally informed that the inquiry had closed.\n\nIn the past few years, Griffin, who has always been a political junkie, has contributed thousands of dollars to elected officials like Barack Obama and Minnesota senator Al Franken, according to federal records. She co-hosted a town hall with California congressman Ted Lieu, and she’s appeared regularly on MSNBC to talk about LGBT and women’s advocacy. Griffin says she was supposed to host a fundraiser for House Minority Leader Nancy Pelosi at her home the week after the photo was released. In July, she adds, she was slated to speak at Politicon, a convention of political and media leaders from both parties, in Pasadena, California. All of that went away almost immediately. Franken admonished her publicly and Pelosi’s office canceled the fundraiser.\n\nBut getting fired by CNN was the most public indignity for Griffin because it involved business and personal relationships that had been fraught with tension for years. Griffin credits CNN president Jeff Zucker with reinvigorating her career in 2003 when she was doing stand-up at the Laugh Factory in Los Angeles. According to EW, Zucker, then president of NBC Entertainment, came to see her act and they eventually struck a deal for Griffin to have her own reality show on the NBC-owned Bravo Network called My Life on the D-List.\n\nBut since Zucker became CNN chief, he and Griffin had clashed regularly, she says. New Year’s Eve is a big money-making opportunity for entertainers, and the CNN gig didn’t pay very well. In 2015, Griffin says she called Zucker directly to see if he could bump up her compensation. The broadcast was receiving record ratings, Griffin was doing a lot of the work as the comedian to Cooper’s straight man, and the broadcast had gone from 90 minutes to four-and-a-half hours since she started doing it.\n\nGriffin says Zucker was livid and told her that he could get comedian Samantha Bee to take her place. Zucker, Griffin says, called her agent and publicist to say she was fired. They eventually made up, but not before Zucker cut Griffin’s pay (she did get a raise in 2016).\n\nGriffin also says that before the 2017 broadcast, Zucker called her at home to tell her she could only do four jokes about Trump (the first time there had ever been limits on her material during the special). When Griffin pushed back, she says Zucker said to her, “I don’t need this, you don’t need this. He’s come after me harder than anybody. I have to deal with this guy.” Griffin reluctantly agreed to the limit. Zucker, through a CNN spokeswoman, declined to comment.\n\nGriffin’s best-known celebrity friendship, going back 17 years, is with CNN anchor Anderson Cooper. But after TMZ published the photo, Cooper came under tremendous pressure to repudiate it. Without reaching out to Griffin, he tweeted the same night: “For the record, I am appalled by the photo shoot Kathy Griffin took part in. It is clearly disgusting and completely inappropriate.” Griffin acknowledges that Cooper was in an untenable position, but she feels that their long friendship afforded her a call or text message beforehand.\n\nIn the following days, Griffin says four of Cooper’s CNN colleagues reached out repeatedly to Griffin to check on her and offer private support (I independently confirmed this). But Cooper didn’t contact Griffin until August 10, CNN confirmed to me.\n\nOn July 26, when asked about Griffin on Andy Cohen’s talk show, Watch What Happens Live with Andy Cohen, Cooper claimed that Griffin was still a friend. “Yeah, we’re still friends, and look I said what I said about — I didn’t think what she said was appropriate, but I wish her the best and I hope she bounces back,” he told Cohen.\n\nThe fact that Cooper was telling people publicly they were friends, while not checking in with her, hurt Griffin deeply. When he finally reached out to her in a series of text messages, she told him their friendship was over.\n\nA source close to Cooper tells me that Cooper was “shocked and upset by the photo, and while he was not ready to talk to her personally about it, he still considered her to be a friend, and was publicly supportive when asked about the controversy.”\n\nOther celebrities were more solicitous. Advice and support flooded in from Hollywood friends, actors, and comics. One critically revered comedian, Griffin says, reassured her that her career wasn’t over and that every comic would give their right arm for the act she’d have after the controversy died down. A comedic movie legend said the incident would be a landmark in the way comedy is viewed. Jerry Seinfeld and Jamie Foxx made supportive comments publicly. Amy Schumer sent Griffin a funny video that Griffin played for me but declined to let me describe. When a couple who live in her gated community, but whom Griffin had never known or met, dropped off a cake and a note, Griffin was so touched that she broke down crying in her bed.\n\nDespite all the private support, no entertainers were willing to speak to me on the record about Griffin. For this story, I reached out to a number of celebrities, especially comics, that Griffin is close friends with. They’ve been calling and texting Griffin in the past few months to check in on her. A few of them even initially told me that they would talk to me for this story, but when I reached out to their publicists to set up phone interviews, I was politely turned away.\n\nThere was also some unsolicited advice. An iconic actress told Griffin to stay at home and out of the limelight until Trump was impeached (it’s unclear when the actress thought that would happen). Former Today show host Billy Bush, who knows what getting caught up in a Trump-related scandal is like, suggested, in a note Griffin shared with me, that she stay quiet for a while and take up meditation.\n\nThe most disturbing advice came via email from a member of the board of directors of the CBS Corporation, Arnold Kopelson, an Academy Award–winning producer who Griffin used to consider a friend. Kopelson emailed Griffin with a prewritten letter to President Trump that he said she should mail to him, and which Griffin shared with me.\n\nThe letter includes phrases like, “Now with my world crumbling around me, I am listening for the first time about the great things you have done and are doing. How stupid I was to follow the lies from the ‘Left.’ It took my terrible mistake to finally see the false news,” and “I do not deserve what I am asking of you. I am begging you to open your heart and forgive me.” Kopelson said that Griffin should “exclusively release the letter to Fox Broadcasting,” adding, “Do not send to the other networks.” “If you don’t do exactly what I’ve written, your career is over,” Kopelson wrote. A spokesman for CBS Corporation declined to comment. When I called Kopelson for comment, he said, “I’m tied up” as soon as I explained the reason for the call, and hung up the phone. Kopelson did not respond to a request for comment via email.\n\nGriffin tells me that Kopelson’s email was indicative of “men who control the checkbooks,” who, despite the entertainment industry’s liberal reputation, tend to be more conservative and don’t like people who rock the boat. She acknowledged that revealing details about people like Kopelson, Cooper, and Zucker is unusual, and could harm her future employment prospects.\n\nBut Griffin occupies an unusual space in comedy: Like her late friend and mentor Joan Rivers, she has constantly struggled to be taken seriously, but managed to build a substantial fan base that has enriched her and made her very famous. Her concert agent showed me Ticketmaster data indicating that over the past 13 years, Griffin has sold over 1.2 million tickets to her shows.\n\nGriffin says she wants to focus on First Amendment issues now. She’s hoping to organize a First Amendment concert with the ACLU, and she’s working on a documentary film of her upcoming international tour, as well as a docu-series, although none of these projects has come to fruition yet.\n\nIn the meantime, although she’s still too worried about her physical safety to tour America, Griffin is off around the world. Her act will feature plenty of Trump jokes, despite the fact that some of her friends have suggested she take it easy on the president for a while.\n\nRick Wilson thinks she has no alternative. “The way Trump wins is if he shuts people up permanently and scares them off from being vocal critics,” he said. “She has to go back to war.”\n\nProduction Credits:\n\nPhotos by Robert Maxwell\n\nHair by Joseph Chase using GHD tools and R&CO at Exclusive Artists\n\nMakeup by Mandy O’Hanlon for Hourglass Cosmetics", "images": ["https://pyxis.nymag.com/v1/imgs/d12/117/d6fdb73b72abb948452ad28c9f23d3ea90-KathyGLead.1x.rsocial.w1200.jpg", "https://pyxis.nymag.com/v1/imgs/e33/6e7/aed044d06bd5c293490430f400dc112e41-2022Cov4x5-AsianAmericaPkg.w240.jpg", "https://pyxis.nymag.com/v1/imgs/31a/165/7b2cda49d5258316afceb071e56d8d3a8b-women-3.2x.rsquare-zoom.w75.jpg", "https://www.thecut.com/media/components/customer-alert-banner/double_chevron.svg", "https://pyxis.nymag.com/v1/imgs/d12/117/d6fdb73b72abb948452ad28c9f23d3ea90-KathyGLead.2x.h600.w512.jpg", "https://www.thecut.com/media/components/customer-alert-banner/close_x.svg", "https://pyxis.nymag.com/v1/imgs/c32/3bf/0a393283dc1f3f9257ff8b361ea03216c8-russia-missile.2x.rsquare-zoom.w75.jpg", "https://pyxis.nymag.com/v1/imgs/5ea/81e/4d3b39a96107c321338c0c9a25557bd47f-zarifa-ghafari.2x.rsquare-zoom.w75.jpg", "https://www.thecut.com/media/components/customer-alert-banner/alert.svg", "https://pyxis.nymag.com/v1/imgs/876/19a/c9b081ac894610cdb48e9a7e8aa7b3294b-KathyG2.w710.jpg"], "top_img": "https://pyxis.nymag.com/v1/imgs/d12/117/d6fdb73b72abb948452ad28c9f23d3ea90-KathyGLead.1x.rsocial.w1200.jpg", "keywords": [], "authors": ["Yashar Ali"], "canonical_link": "https://www.thecut.com/2017/08/kathy-griffin-donald-trump-interview.html", "title": "Kathy Griffin Isn’t Apologizing Anymore", "meta_data": {"viewport": "width=device-width,initial-scale=1,shrink-to-fit=no", "parsely-tags": "kathy griffin, donald trump, president trump, culture, cut homepage lede, power, top story, featuretype:profile, featuretype:q&a", "og": {"title": "Kathy Griffin Isn’t Apologizing Anymore", "url": "https://www.thecut.com/2017/08/kathy-griffin-donald-trump-interview.html", "description": "The comedian lost jobs, money, and friends after releasing a provocative image of President Trump. But she refuses to bend the knee.", "image": "https://pyxis.nymag.com/v1/imgs/d12/117/d6fdb73b72abb948452ad28c9f23d3ea90-KathyGLead.1x.rsocial.w1200.jpg", "site_name": "The Cut", "type": "article"}, "twitter": {"title": "Kathy Griffin Isn’t Apologizing Anymore", "description": "The comedian lost jobs, money, and friends after releasing a provocative image of President Trump. But she refuses to bend the knee.", "image": "https://pyxis.nymag.com/v1/imgs/d12/117/d6fdb73b72abb948452ad28c9f23d3ea90-KathyGLead.2x.rsocial.w600.jpg", "card": "summary_large_image", "site": "@TheCut"}, "article": {"published_time": "2017-08-27T21:00:00.520-04:00", "tag": "kathy griffin, donald trump, president trump, culture, cut homepage lede, power, top story", "publisher": "https://www.facebook.com/cut"}, "description": "The comedian lost jobs, money, and friends after releasing a provocative image of President Trump. But she refuses to bend the knee.", "robots": "max-image-preview:large", "sailthru.tags": "kathy griffin, donald trump, president trump, culture, cut homepage lede, power, top story", "author": "Yashar Ali", "fb": {"app_id": 343556435754245}, "type": "Article", "vertical": "The Cut", "apple-mobile-web-app-title": "The Cut", "application-name": "The Cut", "msapplication-TileColor": "#ff5656", "msapplication-TileImage": "https://assets.nymag.com/media/sites/thecut/icon.144x144.png"}, "movies": [], "publish_date": 1503882000.52, "source": "https://www.thecut.com", "summary": ""}