{"url": "https://www.lifeandstylemag.com/posts/dean-unglert-lesley-murphy-dating-151937/", "text": "Three down, one to go! Dean Unglert and Lesley Murphy have reportedly called it quits less than two months after The Bachelor Winter Games finale. The couple quickly hit it off on the reality dating competition, but they couldn't seem to handle the long distance. Now, Dean and Lesley are both seemingly confirming the breakup with similar cryptic messages on social media.\n\n\"It is very recent, but they have been rocky for a few weeks now,\" a source told E! News. \"Distance and traveling were a factor. They are both going to continue to be friendly and are on good terms, but their romantic relationship has ended.\" One day after news of their split broke, Dean seemed to hint at love lost on Instagram. \"As I’ve gotten older, I’ve learned that although everyone DESERVES love, it’s not something we’re entitled to,\" he wrote. \"Love takes work. Love is compromise. Love is earned. I still have a lot of work to do on myself, a lot to prove to myself, before I’m ready for something like that.\"\n\nLesley quickly followed suit, hinting Dean was unable to fully commit. \"I came back to Winter Games because I’ve seen this franchise work miracles before,\" she explained. \"I know it’s imperative to find someone who chooses us and acknowledges our many layers, who can be open and vulnerable, and most importantly, who is ready. To meet someone and be met. To be chosen and to choose. To love and to be loved. This is everything.\"\n\nShe continued, \"All we need is that same energy reciprocated, and despite how open and loving you attempt to be, people can only meet you as deeply as they’ve met themselves… Out with the old, in with the true. It was a long winter, and I’m excited for a new season. Let the spring cleaning commence.\" Dean and Lesley join Clare Crawley and Benoit Beauséjour-Savard, who just called off their engagement, and Ashley Iaconetti and Kevin Wendt, who also could not make it work post-filming. This means Australians Lily McManus and Courtney Dober are officialy the last couple standing!\n\nFrom the very first episode, Dean, 26, seemed drawn to Lesley, 30, — and vice versa. And while the pair did not win the competition, Dean did present Lesley, who underwent a double mastectomy in 2017, with a key to his apartment at the World Tell All special. At the time, Dean had only good things to say about his girlfriend. \"She's a very courageous person. She's strong, and that's first and foremost what attracted me to her,\" he told Entertainment Tonight. \"Of course, she's beautiful, and if you want to talk about someone who's kind to everyone, it's her! It's kind of annoying when we go places and she literally makes friends with every single person we meet.\"\n\nBachelor Nation was first introduced to Lesley on Season 17 of The Bachelor where she competed for Sean Lowe's heart — and ultimately lost to Catherine Giudici. Dean competed on Rachel Lindsay's season of The Bachelorette and was famously in a love triangle involving Kristina Schulman and Danielle Lombard on Bachelor in Paradise before he signed up for the winter spinoff. We have a feeling he'll be back for round two in Mexico this summer.\n\nLove The Bachelor? Be sure to join our Bachelor Facebook group to chat about all the latest updates, exclusive interviews, and juicy gossip!", "images": ["https://www.lifeandstylemag.com/wp-content/uploads/2018/04/dean-unglert-lesley-murphy-split.jpg?resize=940%2C529&quality=86&strip=all", "https://www.lifeandstylemag.com/wp-content/themes/ami-bauer/assets/build/images/placeholders/placeholder-1x1.svg", "https://www.lifeandstylemag.com/wp-content/themes/ami-bauer/assets/build/images/placeholders/placeholder-16x9.svg", "https://www.lifeandstylemag.com/wp-content/uploads/2018/04/dean-unglert-lesley-murphy-split.jpg?resize=1000%2C600&quality=86&strip=all"], "top_img": "https://www.lifeandstylemag.com/wp-content/uploads/2018/04/dean-unglert-lesley-murphy-split.jpg?resize=1000%2C600&quality=86&strip=all", "keywords": [], "authors": ["Emma Hernandez"], "canonical_link": "https://www.lifeandstylemag.com/posts/dean-unglert-lesley-murphy-dating-151937/", "title": "Are Dean Unglert and Lesley Murphy Dating? Bachelor Winter Games Stars Split", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "theme-color": "#ffffff", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Three down, one to go! Dean Unglert and Lesley Murphy have reportedly called it quits less than two months after The Bachelor Winter Games finale. The", "og": {"locale": "en_US", "type": "article", "title": "Are Dean Unglert and Lesley Murphy Dating? Bachelor Winter Games Stars Split", "description": "Three down, one to go! Dean Unglert and Lesley Murphy have reportedly called it quits less than two months after The Bachelor Winter Games finale. The couple quickly hit it off on the...", "url": "https://www.lifeandstylemag.com/posts/dean-unglert-lesley-murphy-dating-151937/", "site_name": "Life & Style", "updated_time": "2018-04-09T19:28:32+00:00", "image": {"identifier": "https://www.lifeandstylemag.com/wp-content/uploads/2018/04/dean-unglert-lesley-murphy-split.jpg?resize=1000%2C600&quality=86&strip=all", "secure_url": "https://www.lifeandstylemag.com/wp-content/uploads/2018/04/dean-unglert-lesley-murphy-split.jpg?resize=1000%2C600&quality=86&strip=all", "width": 1200, "height": 630}}, "article": {"publisher": "https://www.facebook.com/LifeStyleWeekly", "published_time": "2018-04-09T19:20:00+00:00", "modified_time": "2018-04-09T19:28:32+00:00"}, "author": "Emma Hernandez", "twitter": {"card": "summary_large_image", "title": "Lesley Murphy Reveals the Real Reason Behind Dean Unglert Split", "description": "Three down, one to go! Dean Unglert and Lesley Murphy have reportedly called it quits less than two months after The Bachelor Winter Games finale. The couple quickly hit it off on the...", "image": "https://www.lifeandstylemag.com/wp-content/uploads/2018/04/dean-unglert-lesley-murphy-split.jpg?resize=1000%2C600&quality=86&strip=all", "creator": "@heycoffeeeyes", "site": "@Life_and_Style"}, "fb": {"admins": 593583017, "pages": 229184533343}, "generator": "WordPress 6.0.2", "msapplication-TileImage": "https://www.lifeandstylemag.com/wp-content/uploads/2020/11/android-chrome-384x384-1.png?fit=270%2C270&quality=86&strip=all"}, "movies": [], "publish_date": 1523301600.0, "source": "https://www.lifeandstylemag.com", "summary": ""}