{"url": "https://en.wikipedia.org/wiki/Henrik,_Prince_Consort_of_Denmark", "text": "Prince Consort\n\nPrince Henrik of Denmark ( Danish pronunciation: [ˈhenˀʁek]; born Henri Marie Jean André de Laborde de Monpezat; 11 June 1934 – 13 February 2018)[1] was the husband of Margrethe II of Denmark. He served as her royal consort from Margrethe's accession on 14 January 1972 until his death.\n\nHenrik was born in the French commune of Talence near Bordeaux to an old French family, the Laborde de Monpezats. He spent his early years in Tonkin in French Indochina (now part of Vietnam), where his family had lived for many years. The family spent the Second World War at the family home in Cahors, France. They returned to French Indochina after the war. However, they were forced to flee following the defeat of the French in the First Indochina War. After completing his education in France and Vietnam, Henrik served in the French Army during the Algerian War. Prior to his marriage to Margrethe, he worked in the diplomatic service. He married Margrethe at the Holmen Church on 10 June 1967 and became her prince consort when she succeeded her father, King Frederick IX, as monarch of Denmark on 14 January 1972.[3]\n\nHe had two sons, Crown Prince Frederik (born 1968) and Prince Joachim (born 1969), and eight grandchildren. Throughout his time as prince consort, Henrik voiced his displeasure with never being granted the title of king.[4] A keen winemaker, Henrik produced his own wine at his estate in France. He also published many works of poetry. He was the first male consort to a Danish monarch. Henrik retired from his royal duties on 1 January 2016, at the age of 81. He died at Fredensborg Palace on 13 February 2018, after a short illness.\n\nEarly life [ edit ]\n\nHenrik as a baby in 1934–35\n\nHenrik was born in Talence, Gironde, France. He was the son of André de Laborde de Monpezat (6 May 1907 in Mont-de-Marsan – 23 February 1998 in Le Cayrou) and his wife, Renée Doursenot (26 October 1908 in Périgueux – 11 February 2001 in Le Cayrou[5]) (married in 1948[6][7][8][9]). He had two younger brothers, Étienne and Jean-Baptiste, and two older sisters, Françoise, Mme. Bardin and Maurille, Mme. Beauvillain (d. 2015). He was raised as a Catholic.[10]\n\nHe spent his first five years in Hanoi in Tonkin in French Indochina (now part of Vietnam), where his father looked after family business interests.[11] In 1939, the family returned to Le Cayrou, where they remained during the Second World War.[5] Henrik received homeschooling until 1947, when he went to a Jesuit school in Bordeaux.[11] He returned to Hanoi in Tonkin in 1950, where increasing unrest forced him to fight the Việt Minh, to protect his family's lands.[12] He graduated from the French secondary school in Hanoi in 1952.[11] Originally wanting to study to become a pianist at Conservatoire de Paris, he instead chose an education more in line with his father's wishes.[13] Between 1952 and 1957 he simultaneously studied law and political science at the Sorbonne, Paris, and Chinese and Vietnamese at the École Nationale des Langues Orientales (now known as INALCO). He also studied in Hong Kong in 1957 and Saigon in 1958.[11]\n\nHe served as an infantry conscript in the French Army in the Algerian War between 1959 and 1962.[12] He then joined the French Foreign Ministry, working as a Secretary at the embassy in London from 1963 to 1967.[11] While there, he met Princess Margrethe, who was studying at the London School of Economics.[13] The couple secretly dated for a year before Henrik proposed.[13]\n\nMarriage [ edit ]\n\nHenrik in 1966\n\nOn 10 June 1967 he married Princess Margrethe, the heir presumptive to the Danish throne, at the Naval Church of Copenhagen. At the time of the wedding his name was Danicised to Henrik and he was given the title HRH Prince Henrik of Denmark. Prior to the wedding, the Prince converted to Lutheranism.[10] The Queen and Prince Henrik had two children, Crown Prince Frederik and Prince Joachim, and eight grandchildren.\n\nPrince Henrik's native language was French, and his second language was Danish. He also spoke fluent English, German, Chinese, and Vietnamese. Although he quickly learned Danish after marrying Margrethe, Danes joked about his grasp of Danish and his thick French accent.[14]\n\nDifficulties with the Danish monarchy [ edit ]\n\nWhen Queen Margrethe II ascended the throne, Henrik became the first male consort in Danish history.[13] This meant there were no clear descriptions of his duties. He defined his own role as a supporter of and counsellor to the Queen. However, he felt frustrated with the lack of recognition in title, stating that there was no way to differentiate between his own title and those of his sons and grandsons.[13]\n\nIn 2002, Henrik fled Denmark and went to stay at the couple's Château de Cayx in Cahors in southern France. The cause of his departure from Denmark was a New Year's Day reception in which his son, Crown Prince Frederik, had been appointed as host in the absence of Queen Margrethe. Henrik felt \"pushed aside, degraded and humiliated\"[15] by being relegated to \"third place in the royal hierarchy\".\n\n\"For many years, I have been Denmark's number two\", he said. \"I have been satisfied with that role, but I don't want to be relegated to number three after so many years.\" Henrik \"fled\" Denmark to reflect on his status in the Danish Royal Family. Queen Margrethe flew to France to meet her husband.[15] Henrik stressed that neither his wife nor son were to blame for the incident. The Prince Consort spent three weeks in Caix, and did not appear with his wife as expected at the wedding of Willem-Alexander of the Netherlands and Máxima Zorreguieta.[16] After three weeks, Henrik returned to Denmark.\n\nPrince Henrik with his wife Queen Margrethe II of Denmark in 2010.\n\nOn 30 April 2008, shortly before the wedding of his younger son, Prince Joachim, to Marie Cavallier, the Queen conferred the new Danish title \"Count of Monpezat\" (Danish: Greve af Monpezat) on both of her sons and made it hereditary for their male-line descendants, both male and female.[17] The Queen's private secretary Henning Fode commented, \"The Queen and the Prince Consort have considered this for quite some time, and it has led to the belief that it was the right thing to do.\"[17] In fact, Henrik had mentioned this possibility as far back as 1996 in his published memoir: \"During our generation, the future sovereign will perhaps receive approval to see 'Monpezat' added to the dynastic name of 'Oldenburg-Glücksburg'\".[18] While being interviewed by the French weekly Point de Vue in October 2005, Henrik raised the issue shortly after the birth of Crown Prince Frederik's first son, Prince Christian, who is expected to inherit the Danish crown one day: \"It also makes him very proud and happy that Monpezat will be added to this small grandson's future name as Prince of Denmark. 'It is a great joy for me that his French roots will also be remembered.'\"[19]\n\nIn her New Year's speech to the Danish people on 31 December 2015, Queen Margrethe announced that Prince Henrik would 'wind down' and give up most of his official duties beginning on 1 January 2016. On 14 April 2016, Prince Henrik renounced the title of Prince Consort, which he had been given in 2005.[20][21]\n\nCultural interests and hobbies [ edit ]\n\nSculpture made by Prince Henrik near a road.\n\nLike his wife, Prince Henrik was deeply interested in art and culture. He was particularly fond of wooden figures and jade, building up collections which he exhibited in 2017 at the museum in Koldinghus.[22] Although he never achieved his ambition of becoming a concert pianist, he continued to play the piano throughout his life. In 2013, he accompanied the pop group Michael Learns to Rock on the piano as they recorded \"Echo\", a number which was presented to the king of Thailand.[23][13]\n\nHenrik wrote many poems in his native language (French), some of which have been published in the collections Chemin faisant (1982), Cantabile (2000), Les escargots de Marie Lanceline (2003), Murmures de vent (2005), Frihjul (Roue-Libre, 2010), Fabula (2011), La part des anges (2013), and Dans mes nuits sereines (2014). The symphonic suite Cantabile by Frederik Magle is based on Henrik's poetry collection Cantabile and was premiered by the Danish National Symphony Orchestra at two concerts celebrating Henrik's 70th and 75th birthdays in 2004 and 2009. Henrik said about writing poetry (translated from Danish): \"I see poetry as an opportunity for immersion in a superficial time dominated by news and entertainment that makes us rootless and restless. Poetry takes us closer to the true nature of the world, in poetry we can approach the eternal questions such as love, loneliness and death.\"[24]\n\nHenrik was also an excellent cook, inspired by French gastronomic traditions. He usually planned the family meals in collaboration with the court chef, always including his own spices on the table, some from his childhood estates in Asia. In addition to his cookbooks, Henrik often appeared in television programmes showing how he prepared meals in Fredensborg Castle in Denmark or at his French home, the Château de Cayx.[13]\n\nDeath [ edit ]\n\nIn August 2017, Henrik announced he did not wish to be buried next to the Queen, citing his longtime complaint of only being named Prince Consort, and not King Consort.[25][26] The decision is said to have broken a tradition that began in 1559,[27] and at the time, Queen Margrethe is said to have accepted her husband's decision.[25][26]\n\nOn 6 September 2017, it was announced that Prince Henrik was suffering from dementia.[28] On 28 January 2018, he was hospitalized at Rigshospitalet, following a visit to Egypt.[29] It was later revealed that he had a benign tumor in the left lung.[30] His health however worsened, causing Crown Prince Frederik to cut short his visit to South Korea where he was to attend the 2018 Winter Olympics in Pyeongchang.[31] On 13 February 2018, Prince Henrik was transferred from Rigshospitalet to Fredensborg Palace, where the Danish Royal Court stated he wished to spend the remaining days of his life. The Royal Court added that the condition of the Prince remained serious.[32] On 14 February 2018, it was announced that Prince Henrik had died in his sleep at Fredensborg Palace late on 13 February, surrounded by his wife and sons.[1]\n\nFollowing his death, the Court announced there would be a month of royal mourning.[33] Henrik's casket was placed in The Palace Chapel at Christiansborg for a castrum doloris, where in the following two days, more than 19,000[34] people went to pay their respects.[35] He was cremated, after a funeral in Christianborg Palace Chapel in Copenhagen, on 20 February, with half of the ashes scattered across Danish seas and half placed in the private part of the gardens at Fredensborg Palace.[2]\n\nIssue [ edit ]\n\nPrince Henrik had two sons and eight grandchildren, all born at Rigshospitalet in Copenhagen:\n\nIn 2008, Queen Margrethe II announced that her male-line descendants would bear the additional title of Count or Countess of Monpezat, in recognition of Prince Henrik's ancestry.[17]\n\nTitles, styles and honours [ edit ]\n\nCoat of arms of Prince Henrik of Denmark Armiger Prince Henrik of Denmark\n\nTitles and styles [ edit ]\n\nBefore 10 June 1967: Count Henri de Laborde de Monpezat (courtesy title without any legal basis)* [36]\n\n10 June 1967 – 2005: His Royal Highness Prince Henrik of Denmark\n\n2005 – 14 April 2016: His Royal Highness The Prince Consort of Denmark [37]\n\n14 April 2016 – 13 February 2018: His Royal Highness Prince Henrik of Denmark[21]\n\n* Use is disputed, see section \"French nobility and French title of \"count\" controversy\" below\n\nFrench nobility and French title of \"count\" controversy [ edit ]\n\nSince late in the nineteenth century, some members of the Laborde de Monpezat family bear a title of \"count\", but this title is a courtesy title without any legal basis.[36]\n\nNeither the French nobility of the de Laborde de Monpezat family nor this french title of \"count\" are acknowledged as historically and legally valid by most recent reference authors, specialists of the French nobility who do not consider that the de Laborde de Monpezat family belongs to the French nobility.[38][39] This family is listed in the Encyclopédie de la fausse noblesse et de la noblesse d'apparence (English: Encyclopedia of False and Seeming Nobility)[38] his name is not in the Catalogue de la noblesse française (English: Catalog of French Nobility) (2002) from Régis Valette[40] and the author Charondas describes in his book A quel titre (Volume 37, 1970) the Laborde de Monpezat as \"false nobles, low folk in the 17th century, not received in the states of Béarn due to 'alleged nobility and as having never had nobility in their family.\"[41] The family's surname was \"Monpezat\" by the time of the French Revolution, without title, until 14 July 1860, when it was changed by imperial decree to \"de Laborde-Monpezat\", and legally changed again on 19 May 1861 to \"de Laborde de Monpezat\".[8]\n\nAlthough Danish law never required that royal spouses be of aristocratic origin, no heir's marriage to a person who lacked male-line descent from royalty or titled nobility had been accepted as dynastic by the sovereign in the course of Denmark's history as a hereditary monarchy, until the marriage of the heir presumptive, Princess Margrethe, in June 1967 to \"Count\" Henri de Laborde de Monpezat.[42][43] Six months later Margrethe's first cousin, Prince Ingolf of Denmark, married an untitled commoner and was demoted to a count, and when another cousin, Prince Christian of Denmark, also wed a Dane, Anne Dorte Maltoft-Nielsen, in 1971, he forfeited his dynastic position.[43]\n\nHonours [ edit ]\n\nNational honours and awards [ edit ]\n\nNational honours:[11]\n\nForeign honours and awards [ edit ]\n\nForeign honours:[11]\n\nPublications [ edit ]\n\nPrince Henrik translated several books into Danish and published several other books.\n\nIn 1981, under the pseudonym H.M. Vejerbjerg he and the Queen translated Simone de Beauvoir's Tous les hommes sont mortels .\n\nhe and the Queen translated Simone de Beauvoir's . Chemin faisant , 1982, a volume of French poems.\n\n, 1982, a volume of French poems. Destin oblige , 1996, his memoirs as Prince Consort.\n\n, 1996, his memoirs as Prince Consort. Ikke Altid Gåselever ( not always foie gras ), 1999, a selection of favourite recipes.\n\n( ), 1999, a selection of favourite recipes. Cantabile , 2000, poems.\n\n, 2000, poems. Les escargots de Marie Lanceline , 2003.\n\n, 2003. Murmures de vent , 2005, poems.\n\n, 2005, poems. Frihjul, 2010, poems.\n\nReferences [ edit ]\n\nBibliography [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/ba/Flag_of_Germany.svg/23px-Flag_of_Germany.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Flag_of_Greece.svg/23px-Flag_of_Greece.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/DEN_Medal_for_the_Ruby_Jubilee_of_Queen_Margarethe_of_Denmark_ribbon.svg/70px-DEN_Medal_for_the_Ruby_Jubilee_of_Queen_Margarethe_of_Denmark_ribbon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/DK_Hjemmevaernets_Fortjensttegn_Ribbon.png/70px-DK_Hjemmevaernets_Fortjensttegn_Ribbon.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Prince_Henrik..21-05_2005.jpg/220px-Prince_Henrik..21-05_2005.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/StribGlStrandvej.JPG/220px-StribGlStrandvej.JPG", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f9/DEN_Golden_Wedding_Commemorative_Medal_of_Queen_Margrethe_II_and_Prince_Henrik.png/70px-DEN_Golden_Wedding_Commemorative_Medal_of_Queen_Margrethe_II_and_Prince_Henrik.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Flag_of_Slovakia.svg/23px-Flag_of_Slovakia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Flag_of_South_Korea.svg/23px-Flag_of_South_Korea.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/DNK_Order_of_Danebrog_Grand_Cross_BAR.png/70px-DNK_Order_of_Danebrog_Grand_Cross_BAR.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Flag_of_Mexico.svg/23px-Flag_of_Mexico.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e4/Order_of_the_Elephant_Ribbon_bar.svg/70px-Order_of_the_Elephant_Ribbon_bar.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Henrik%2C_Prince_Consort_of_Denmark_%281934-35%29.jpg/220px-Henrik%2C_Prince_Consort_of_Denmark_%281934-35%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Flag_of_Romania.svg/23px-Flag_of_Romania.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/1/12/Flag_of_Poland.svg/23px-Flag_of_Poland.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Flag_of_Denmark.svg/20px-Flag_of_Denmark.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/DRK_Fortjensttegn_Ribbon.png/70px-DRK_Fortjensttegn_Ribbon.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Flag_of_Portugal.svg/23px-Flag_of_Portugal.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/ae/Flag_of_the_United_Kingdom.svg/23px-Flag_of_the_United_Kingdom.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fe/Flag_of_Egypt.svg/23px-Flag_of_Egypt.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Flag_of_Thailand.svg/23px-Flag_of_Thailand.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Flag_of_Bulgaria.svg/23px-Flag_of_Bulgaria.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/Flag_of_Nepal.svg/16px-Flag_of_Nepal.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/9a/Flag_of_Spain.svg/23px-Flag_of_Spain.svg.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Coat_of_arms_of_Henrik%2C_Prince_Consort_of_Denmark.svg/120px-Coat_of_arms_of_Henrik%2C_Prince_Consort_of_Denmark.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Royal_Wedding_Stockholm_2010-Konserthuset-421.jpg/220px-Royal_Wedding_Stockholm_2010-Konserthuset-421.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/Flag_of_Morocco.svg/23px-Flag_of_Morocco.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/DEN_Prince_Henriks_75th_Birthday_Medal_ribbon.svg/70px-DEN_Prince_Henriks_75th_Birthday_Medal_ribbon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/6/6b/Royal_Wedding_Stockholm_2010-Konserthuset-420.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Flag_of_Croatia.svg/23px-Flag_of_Croatia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Flag_of_Estonia.svg/23px-Flag_of_Estonia.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/c/c3/Flag_of_France.svg/23px-Flag_of_France.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Flag_of_Iceland.svg/21px-Flag_of_Iceland.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/BF_HT_Ribbon.png/70px-BF_HT_Ribbon.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Flag_of_Lithuania.svg/23px-Flag_of_Lithuania.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Flag_of_Finland.svg/23px-Flag_of_Finland.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Order_of_the_Dannebrog_R.svg/70px-Order_of_the_Dannebrog_R.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/CFHT25_R.png/70px-CFHT25_R.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f6/Flag_of_Denmark_%28state%29.svg/23px-Flag_of_Denmark_%28state%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Royal_Wedding_Stockholm_2010-Konserthuset-420.jpg/220px-Royal_Wedding_Stockholm_2010-Konserthuset-420.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/0/05/Flag_of_Brazil.svg/22px-Flag_of_Brazil.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Flag_of_Latvia.svg/23px-Flag_of_Latvia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/DK_Mili_Idraetsforbunds_HT_Ribbon.png/70px-DK_Mili_Idraetsforbunds_HT_Ribbon.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Monarchy_Of_Denmark_April_2010.jpg/220px-Monarchy_Of_Denmark_April_2010.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Norway.svg/21px-Flag_of_Norway.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bb/Medal_DK_Fremragende_R.png/70px-Medal_DK_Fremragende_R.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/DEN_Medal_of_Merit_ribbon.svg/70px-DEN_Medal_of_Merit_ribbon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/DEN_Medal_for_the_Silver_Jubilee_of_Queen_Margarethe_of_Denmark_ribbon.svg/70px-DEN_Medal_for_the_Silver_Jubilee_of_Queen_Margarethe_of_Denmark_ribbon.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Queen_Margrethe_II_and_Prince_Henrik_of_Denmark_welcome_George_W._Bush_and_Laura_Bush.jpg/220px-Queen_Margrethe_II_and_Prince_Henrik_of_Denmark_welcome_George_W._Bush_and_Laura_Bush.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Flag_of_Belgium_%28civil%29.svg/23px-Flag_of_Belgium_%28civil%29.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/Flag_of_Jordan.svg/23px-Flag_of_Jordan.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Royal_coat_of_arms_of_Denmark.svg/100px-Royal_coat_of_arms_of_Denmark.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Naval_Ensign_of_Denmark.svg/23px-Naval_Ensign_of_Denmark.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/03/Flag_of_Italy.svg/23px-Flag_of_Italy.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/DRK_Haederstegn_Ribbon.png/70px-DRK_Haederstegn_Ribbon.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/9e/Flag_of_Japan.svg/23px-Flag_of_Japan.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Flag_of_Greenland.svg/23px-Flag_of_Greenland.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4c/Flag_of_Sweden.svg/23px-Flag_of_Sweden.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Flag_of_Austria.svg/23px-Flag_of_Austria.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Flag_of_Luxembourg.svg/23px-Flag_of_Luxembourg.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Flag_of_the_Netherlands.svg/23px-Flag_of_the_Netherlands.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/06/Groenlands_Fortjenstmedalje_Ribbon.png/70px-Groenlands_Fortjenstmedalje_Ribbon.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6a/Hendrik%2C_prins_van_Denemarken.jpg/220px-Hendrik%2C_prins_van_Denemarken.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/6/6b/Royal_Wedding_Stockholm_2010-Konserthuset-420.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Henrik,_Prince_Consort_of_Denmark", "title": "Henrik, Prince Consort of Denmark", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.4", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6b/Royal_Wedding_Stockholm_2010-Konserthuset-420.jpg/640px-Royal_Wedding_Stockholm_2010-Konserthuset-420.jpg", "width": 640, "height": 883}, "title": "Henrik, Prince Consort of Denmark - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}