{"url": "http://www.music-news.com/news/UK/113901/Janet-Jackson-thanks-incredible-father-Joe-Jackson-amid-terminal-cancer-reports", "text": "NEWS Janet Jackson thanks 'incredible' father Joe Jackson amid terminal cancer reports Newsdesk Share with :\n\n\n\n\n\nJanet Jackson has thanked her \"incredible\" father Joe Jackson amid reports he has been hospitalised with terminal cancer.\n\n\n\nThe 52-year-old was honoured at the 2018 Radio Disney Music Awards with the Impact Award, which has now been renamed the Janet Jackson Award.\n\n\n\nDuring her speech, Janet spoke about how her parents encouraged and supported her hugely successful career.\n\n\n\n\"It's beautiful, it's humbling to be recognised as someone that has had a positive impact, but if I have been fortunate enough to impact others it is only because I, myself, have been greatly impacted by positive people in my life,\" she said at the ceremony on Friday (22Jun18), which was broadcast on TV the following evening.\n\n\n\n\"My mother nourished me with the most extravagant love imaginable, my father, my incredible father, drove me to be the best that I can. My siblings set an incredibly high standard for artistic excellence... Sometimes, having an impact can be as simple as a smile, a handshake, or a hug.\"\n\n\n\nThe 89-year-old Jackson family patriarch has been battling the illness \"for some time,\" according to TMZ.com, and is reportedly at the end stages of his life. Family members, including Joe's 88-year-old wife Katherine Jackson, have been visiting him in hospital.\n\n\n\nNews of Joe's health crisis comes after his son Jermaine Jackson revealed the family was initially denied access to visit him.\n\n\n\n\"No one knew what was going on - we shouldn't have to beg, plead, and argue to see our own father, especially at a time like this,\" he told The Daily Mail. \"We have been hurting. We were not being told where he was and couldn't get the full picture. Even from the doctor. My mother was worried sick.\n\n\n\n\"He's very very frail, he doesn't have long,\" he added. \"The family needs to be by his bedside - that's our only intention in his final days.\"\n\n", "images": ["http://www.music-news.com/images/news/cover/113901.jpg", "http://www.music-news.com/Content/Images/newsletter-signup.gif"], "top_img": "http://www.music-news.com/images/news/cover/113901.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.music-news.com/news/UK/113901/Janet-Jackson-thanks-incredible-father-Joe-Jackson-amid-terminal-cancer-reports", "title": "Janet Jackson thanks 'incredible' father Joe Jackson amid terminal cancer reports", "meta_data": {"viewport": "width=device-width,maximum-scale=1.0", "description": "Janet Jackson thanks 'incredible' father Joe Jackson amid terminal cancer reports - The Number One music magazine feat. band & artist news, reviews, interviews, videos & gossip UK & worldwide.", "keywords": "Janet Jackson thanks 'incredible' father Joe Jackson amid terminal cancer reports - music, news, music news,music-news reviews, Alternative, indie, metal, dance, hardcore, rock, pop, artists, audio, video, classic, hip hop, rap, soul, r&b, lennon, ash, sex pistols, radiohead, blur, hendrix, oasis, muzik, underworld, Limp Bizkit, Backstreet Boys,  U2, Korn,  Eminem,  *NSYNC,  Madonna,  Radiohead,  Marilyn Manson,  Pearl Jam, Britney Spears ,  Nelly , Metallica , Christina Aguilera , Prince, Blink-182,  Blur, Oasis, Travis, REM, Smashing Pumpkins, Manics, Supergrass, Pulp, Beck, Nirvana, Stereophonics, Beatles, U2, Foo Fighters, Suede, Stone Roses, Moby, David Bowie, Prodigy, top, fifty, 100, albums, singles, live, films, books, quotes, competitions, webcasts, webchats, radio, E-cards, angst, gigs, tickets, buy tickets, concerts, Real Audio, Microsoft media player, magazine, free, e-mail, email, shop, my, Cds, Cd's, Cd, contests, hits", "google-site-verification": "bDOS26sz2s-cSAyT3mz9xz63qHr4jxrYbQcimMBBXAw", "verification": "59ce4d17a6a39ea29e3fa8dae1d51917", "apple-mobile-web-app-title": "Music-News.com", "application-name": "Music-News.com", "msapplication-TileColor": "#231f20", "msapplication-TileImage": "/Content/Images/Favicons/mstile-144x144.png", "msapplication-config": "/Content/Images/Favicons/browserconfig.xml", "theme-color": "#ffffff", "og": {"site_name": "Music-News.com", "image": "/images/news/cover/113901.jpg", "url": "https://www.music-news.com/news/UK/113901/Janet-Jackson-thanks-incredible-father-Joe-Jackson-amid-terminal-cancer-reports", "title": "Janet Jackson thanks 'incredible' father Joe Jackson amid terminal cancer reports", "description": "The singer was honoured at the 2018 Radio Disney Music Awards with the Impact Award."}}, "movies": [], "publish_date": null, "source": "http://www.music-news.com", "summary": ""}