{"url": "https://web.archive.org/web/20180724065739/https://www.forbes.com/sites/katetalbot/2018/07/24/5-social-media-lessons-to-learn-from-kylie-jenner/", "text": "With over 250 million social media followers and a $900 million dollar empire, there’s no denying that Kylie Jenner has mastered the art of social media storytelling to further her popularity and promote her makeup line. In doing so, she’s leveraged her personal brand with direct to consumer commerce to create engaging content and distribute it effectively across new media channels.\n\nFor those looking to be like Kylie and expand their brand and social media presence, here are five social media lessons to learn from her empire.\n\nKnow Your Audience\n\nAs a global influencer and youngest member of one of the most famous families, Kylie has cornered the fashion and beauty market. She’s tapped into the demographic of millennials and Gen Z’ers who are passionate about new trends and have grown up with reality TV and social media. Because of this, she speaks to her followers similarily how she’d talk to her own friends and family and focuses her content distribution across Snapchat, Instagram, and YouTube. According to market research that demographic find Instagram to be the top platform for brand discoverability, YouTube for shopping recommendations, and Snapchat to document their shopping experiences. For Kylie, she focuses on those channels with her brand and sales strategy to have a comprehensive approach to social media execution -- making sure she maximizes her audience reach. The KylieCosmetics brand positioning and messaging reflect her knowledge base of this demographic and produce products around these insights including “On Wednesday Matte Lip Kit” -- a reference to Mean Girls -- and the slang lingo “Damm Gina Gloss.\"\n\nTip: Understand your target audience to create an in-depth social media strategy. Have a laser focus on brand positioning and messaging that relates to that demographic.\n\nPromote Your Products\n\nThe power of the KylieCosmetics brand is that her social media followers are real fans. They want to know all the ins and outs of her daily life from what she cooks for breakfast to which club she is celebrating her birthday at or any photos of her baby, Stormi. Since her audience is glued to every Snapchat Story or Instagram Post, she uses this to her advantage and creates content specifically about her new collections. For every three to four photos on her Instagram that highlight her personal life, she then includes a product shot which also receives a magnitude of likes and comments. On Snapchat, she shows her followers all the behind-the-scenes aspects of producing KylieCosmetics with trips to her factory, telling her fans when an upcoming collection launches and promoting her flash sales with selfies.\n\nTip: Integrate fun, authentic content that intrigues your community, alongside products that increase sales. Take your followers throughout your daily life so that they connect with you, and they’ll want to purchase your products. Think strategically about your content and how many posts you create that are personal in nature and how many are sales driven.\n\nIgnore The Haters\n\nWith trolls commenting on her social content, Kylie shows that you have to move beyond negative press and focus on your vision and dream. With $630 million in sales since launching in 2016, the data and numbers can silence the haters. In ignoring the negative, she can focus on providing the community that adores her with exclusive access at her pop-up shops and appearances, and she creates a special bond with fans as she replies and reposts their content across social media channels.\n\nTip: Every entrepreneurial pursuit will have obstacles, but continue to believe in your business and address any valid concerns. Listen to feedback from the community to better your product and content, but remember to reward your community that wants you to succeed with special offers and experiences. Overall, it is better to continue to post content than to let negativity deter you from your passions.\n\nPartner With Influencers\n\nKylie already has a built-in network of influencers, but she maximizes reach through partner collections with her Mom, Kris and sisters, Kim, Khloe, and Kourtney. With each partnership launch, there is a large-scale digital campaign with YouTube videos and social media posts -- as each Kardashian has millions of followers. Beyond her family, she also taps into beauty influencers like MakeupShayla and Nicol Concilio to provide outside credibility for the makeup line through their own Instagram posts and YouTube tutorials where they share their thoughts on the makeup.\n\nTip: Find influencers within your niche that have reach beyond your community that can provide validation through social media content for your product or services. You can find influencers in a variety of ways. These include: working with influencer agencies, utilizing influencer apps that connect brands and influencers, search hashtags to find relevant influencers within your industry and then reach out by email or direct message on social channels to start a relationship.\n\nUse Content To Educate\n\nWhether it’s a Snapchat Story or YouTube Tutorial, Kylie uses social media video to educate her community. She showcases her collections by swatching her arm with the various highlighters or eyeshadows and with makeup video guides on YouTube. By breaking down the makeup in a simplified manner, her followers can learn and follow along to create a similar look. Her makeup tutorial videos on YouTube have millions of views, showing that her community is interested in learning how to recreate her looks and finding new makeup tricks.\n\nTip: Utilize social media video to teach your community how to utilize your products best. This can be through YouTube tutorials or the newly launched, IGTV. Use long-form video to help your followers learn more about your product or services in a way that is digestible and entertaining.\n\nLessons Into Action\n\nBy understanding how Kylie has been able to take her brand to the next level through producing continuous content across multiple social media platforms that educate and excites her community, you can mirror her execution to scale your business. These five lessons in content and community can help lead to increased brand affinity and sales, and in doing so, social media becomes a marketing channel that delivers incredible results.", "images": ["https://web.archive.org/web/20180724065739im_/https://secure.gravatar.com/avatar/b4d7f243146f0a4481f8b3ed800f466c?s=400&d=mm&r=g", "https://web.archive.org/web/20180724065739im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fkatetalbot%2Ffiles%2F2018%2F07%2FFollow-your-dreams-2-500x500.png", "https://web.archive.org/web/20180724065739im_/https://specials-images.forbesimg.com/dam/imageserve/682103750/960x0.jpg?fit=scale"], "top_img": "https://web.archive.org/web/20180724065739im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fkatetalbot%2Ffiles%2F2018%2F07%2FFollow-your-dreams-2-500x500.png", "keywords": [], "authors": ["Kate Talbot"], "canonical_link": "https://web.archive.org/web/20180724065739/https://www.forbes.com/sites/katetalbot/2018/07/24/5-social-media-lessons-to-learn-from-kylie-jenner/", "title": "5 Social Media Lessons To Learn From Kylie Jenner", "meta_data": {"viewport": "width=device-width,initial-scale=1", "apple-itunes-app": "app-id=588647136", "fb": {"app_id": 123694841080850}, "og": {"site_name": "Forbes", "title": "5 Social Media Lessons To Learn From Kylie Jenner", "image": "https://web.archive.org/web/20180724065739im_/https://thumbor.forbes.com/thumbor/600x315/https%3A%2F%2Fblogs-images.forbes.com%2Fkatetalbot%2Ffiles%2F2018%2F07%2FFollow-your-dreams-2-500x500.png", "updated_time": "2018-07-24T01:56:26-04:00", "url": "https://web.archive.org/web/20180724065739/https://www.forbes.com/sites/katetalbot/2018/07/24/5-social-media-lessons-to-learn-from-kylie-jenner/", "description": "With over 250 million social media followers and a $900 million dollar empire, there’s no denying that Kylie Jenner has mastered the art of social media storytelling to further her popularity and promote her makeup line. Learn five social media lessons from her strategy to use for your own brand.", "type": "article"}, "twitter": {"site": "@forbes", "card": "summary_large_image", "title": "5 Social Media Lessons To Learn From Kylie Jenner", "description": "With over 250 million social media followers and a $900 million dollar empire, there’s no denying that Kylie Jenner has mastered the art of social media storytelling to further her popularity and promote her makeup line. Learn five social media lessons from her strategy to use for your own brand.", "image": "https://web.archive.org/web/20180724065739im_/https://thumbor.forbes.com/thumbor/600x300/https%3A%2F%2Fblogs-images.forbes.com%2Fkatetalbot%2Ffiles%2F2018%2F07%2FFollow-your-dreams-2-500x500.png", "creator": "@katetalbot"}, "description": "With over 250 million social media followers and a $900 million dollar empire, there’s no denying that Kylie Jenner has mastered the art of social media storytelling to further her popularity and promote her makeup line. Learn five social media lessons from her strategy to use for your own brand.", "author": "Kate Talbot", "article": {"publisher": "https://www.facebook.com/forbes", "author": "Kate Talbot", "section": "Leadership", "section_url": "https://www.forbes.com/women-at-forbes//", "id": "blogAndPostId/blog/post/5375-197", "published": "2018-07-24", "modified": "2018-07-24"}}, "movies": [], "publish_date": 1532386800.0, "source": "https://web.archive.org", "summary": ""}