{"url": "http://www.newslocker.com/en-us/news/celebrity/saturday-savings-lucy-hales-cute-muscle-tank-is-only-43/", "text": "Actor testifies Kevin Spacey abused him when he was a teen during 1986 encounter Kevin Spacey accuser Anthony Rapp claimed in court Friday he was frozen as he was pinned underneath the \"House of Cards\" actor during an alleged sexual assault when Rapp was only 14 years old. \"I was frozen. I was pinned underneath him. I felt like a deer in headlights, I didn’t really know what to do,\" Rapp recalled as he took the stand to testify in his civil lawsuit against Spacey. Rapp, a \"Rent\" on Broadway star, had some experience acting at age 14 and says he used to hang Read more\n\nSylvester Stallone, Jennifer Flavin enjoy a date in NYC as divorce is reportedly dismissed Sylvester Stallone and wife Jennifer Flavin stepped out for a date night in New York City Thursday, looking very much in love as reports swirled the pair's divorce has been officially dismissed. The \"Rocky\" actor and the former model appeared to be in good spirits, smiling and holding hands after recently rekindling their romance. The two were spotted leaving The Polo Lounge in New York City Thursday looking happier than ever, a couple of weeks after it was announced the couple had d Read more\n\nKesha and Dr. Luke trial will take place in summer 2023: judge After almost a decade, the legal fight between pop singer Kesha and producer Dr. Luke is headed to trial in New York next summer, a judge said Friday. Manhattan Judge Jennifer Schecter said jury selection could start in either late June or early July, asking the two sides to choose and let her know. She broached the dates at the end of a hearing that worked through some of the legal issues and arguments that need to be resolved before the trial can start. The \"TiK ToK\" singer and the Grammy-nomi Read more\n\nYe calls out Kim Kardashian and Pete Davidson, talks Lizzo, Ice Cube and more Rapper Kanye West dropped countless celebrity names in his exclusive bombshell interview with Fox News’ Tucker Carlson. In the wide-ranging interview, West — who now goes by Ye — got candid about his ex-wife Kim Kardashian and how she’s portrayed in the media. The \"Jesus Walks\" rapper also claimed the \"liberal\" media attacks his \"good friend\" Lizzo for losing weight, and gave insight into his discussions with Ice Cube about how the Black community is viewed in Read more\n\nFlorence Pugh Wows in Valentino at 'The Wonder' Premiere in London! (Photos) Florence Pugh continues to give us wow moments on the red carpet!\n\nThe 26-year-old actress looked beautiful while walking the carpet for the 2022 BFI London Film Festival premiere of her movie The Wonder on Friday evening (October 7) at the Royal Festival Hall in London, England.\n\nFlorence was joined at the event by co-stars Niamh Algar, Toby Jones, Elaine Cassidy, and Kila Lord Cassidy, as well as director Sebastian Lelio.\n\nThe Wonder will hit theaters on November 2, and will be available to stre Read more\n\nNBC Announces 'America's Got Talent: All Stars' Season - Judges & Host Revealed! NBC has announced a new edition of America’s Got Talent!\n\nThe network will be airing a new spinoff called America’s Got Talent: All-Stars, which will “feature winners, finalists, fan favorites, and viral sensations from previous seasons of the mothership series and Got Talent franchises around the world,” according to Deadline.\n\nNBC previously aired two seasons of America’s Got Talent: The Champions back in 2019 and 2020 and this sounds like it will be a similar vers Read more\n\nEva Mendes Clears Up False Reports About Her Acting Career, Reveals Her 'Dream Project' Eva Mendes would like to make one thing clear – she did not quit acting.Reports broke last month that the 48-year-old star quit the business due to a lack of roles available. She has since focused on other things such as her sponge business Skura Style and her family with Ryan Gosling.However, the narrative that she “quit” Hollywood doesn’t check out, and she is explaining why. She also revealed what her “dream project” has been.Click inside to check out what Read more\n\nBen Affleck & Jennifer Garner Seen Going Separate Ways After a School Visit Together Former couple Ben Affleck and Jennifer Garner started their day together on Friday.\n\nThe 50-year-old Oscar-winning filmmaker and actor and the 50-year-old actress were spotted leaving their son Samuel‘s school and heading their separate ways on Friday morning (October 7) in Los Angeles.\n\nIt’s Halloween season and Jennifer is clearly getting ready for the big day. She took to her Instagram account to share a compilation of some of her former costumes while poking fun at herself for nev Read more\n\nDwayne Johnson Reveals Whether He's Going to Run for President Dwayne Johnson is addressing his political aspirations.\n\nThe 50-year-old former wrestler and actor spoke out about whether he’d run for the office of President of the United States one day during an interview with CBS Sunday Morning, airing this weekend.\n\nHe expressed interest in running for president as early as 2017, and last year met with people in politics to conduct “a small amount of research and analysis to see” what a presidential run in the future could look like, via V Read more\n\nJoni Mitchell Is Not Dead; Rep Responds After False Report Joni Mitchell is alive and well.\n\nA false death report spread on the internet on Friday morning (October 7) after People magazine accidentally posted an obituary that appears to have been pre-written.\n\nJoni‘s rep spoke out to confirm she is doing well amid the erroneous report, which scared fans into thinking that she might have actually died.\n\nClick inside to read more…\n\n“I can confirm all is well so this was done in error,” Joni‘s rep told Variety.\n\nPeople‘s ar Read more\n\nBroadway's 'Funny Girl' hosts a 'Glee' reunion between Lea Michele and Darren Criss Darren Criss watched his friend and former \"Glee\" co-star sing \"Don't Rain on My Parade,\" this time not as Rachel Berry, but as Fanny Brice. In the hit Fox show, Michele played Berry, who was an aspiring Broadway performer. On various occasions throughout the duration the show, Michele belts out one of musical's signature songs, \"Don't Rain on My Parade.\"In a truly full circle moment, a fictional story became reality when Michele took over as Fanny Brice, a role famously held by Barbra Str Read more\n\nSharon Osbourne Blasts Black Lives Matter Organization, Seemingly Throws Support Behind Kanye West Kanye West is receiving support from an unexpected source amid the controversy that brewed up after he wore a White Lives Matter shirt during a recent appearance – Sharon Osbourne.The 45-year-old provocateur followed things up by making an appearance on Fox’s Tucker Carlson Tonight where he spoke to host Tucker Carlson about a variety of topics. He has received support from a handful of celebrities, with Sharon being the latest to weigh in on the situation.Sharon‘s support see Read more\n\nDua Lipa Addresses Her Relationship Status Amid Trevor Noah Romance Rumors Dua Lipa is setting the record straight on her romantic life.\n\nThe 27-year-old “Don’t Start Now” singer opened up about her love life during the latest episode of her Dua Lipa: At Your Service podcast on Friday (October 7), which featured guest star Charli XCX.\n\nDuring their conversation, Dua opened up about dating, following recent headlines and speculation after she was spotted having a night out with The Daily Show‘s Trevor Noah.\n\nFind out what she said… Read more\n\nDraymond Green Violently Punches Jordan Poole in Shocking Practice Footage Video Draymond Green attacked Jordan Poole during practice, and it was all caught on camera.\n\nThe 32-year-old Golden State Warriors player was seen viciously punching his 23-year-old teammate, knocking him to the ground during team practice.\n\nIn footage obtained by TMZ, the teammates can be seen trash-talking at each other, with the argument eventually turning physical.\n\nClick inside to read more…\n\nDraymond is captured walking up to Jordan, and as he pushes Draymond away with two hands to the ches Read more\n\nJames McAvoy Debuts 'His Dark Materials' Season 3 Trailer - Watch Now! James McAvoy speaks on stage during the His Dark Materials interview at New York Comic Con 2022 on Thursday (October 6) in New York City.Here’s the season 3 synopsis: Based on “The Amber Spyglass,” the final novel in Philip Pullman’s award-winning trilogy, in the final chapter of this epic fantasy series, Lyra (Dafne Keen), the prophesied child, and Will (Amir Wilson), the bearer of The Subtle Knife, must journey to a dark place from which no one has ever returned.As her Read more", "images": ["https://static.addtoany.com/buttons/share_save_120_16.gif", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/10/931/523/lea-michele-darren-criss-perform.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/02/1200/675/kanye-west-pete-davidson-kim-kardashian-getty.jpg?ve=1&tl=1", "http://www.newslocker.com/images/newslocker-cube.png", "http://www.newslocker.com/images/rss.png", "http://www.newslocker.com/images/share-linkedin.png", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/10/1200/675/kevinSpacey.jpeg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/10/1200/675/GettyImages-597569672.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/10/1200/675/sly-wife.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/06/1200/675/beyonce.jpg?ve=1&tl=1", "http://www.newslocker.com/images/share-facebook.png", "http://www.newslocker.com/images/newslocker-logo.png", "http://www.newslocker.com/images/share-twitter.png", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/10/1200/675/436b45c1-kushner-kloss-copy.jpg?ve=1&tl=1", "http://akns-images.eonline.com/eol_images/Entire_Site/2017314/rs_600x600-170414120302-600.Lucy-Hale-Saturday-Savings.jl.041417.jpg?downsize=450:*&crop=450:350;left,top", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/10/931/523/aurora-culpo-sophia-culpo-olivia-culpo.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2018/09/1200/675/Alan-Alda-Getty2.jpg?ve=1&tl=1", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2022/10/1200/675/Kesha-Dr-Luke.jpg?ve=1&tl=1"], "top_img": "http://akns-images.eonline.com/eol_images/Entire_Site/2017314/rs_600x600-170414120302-600.Lucy-Hale-Saturday-Savings.jl.041417.jpg?downsize=450:*&crop=450:350;left,top", "keywords": [], "authors": [], "canonical_link": "https://www.newslocker.com/en-us/news/celebrity/saturday-savings-lucy-hales-cute-muscle-tank-is-only-43/", "title": "Saturday Savings: Lucy Hale's Cute Muscle Tank Is Only $43", "meta_data": {"description": "Work out in style, like Lucy Hale.The Pretty Little Liars actress is looking super cute in her Nike leggings and color-matchingSpiritual Gangster muscle tank (which is now only $43). If...", "og": {"title": "Saturday Savings: Lucy Hale's Cute Muscle Tank Is Only $43 - Celebrity news - NewsLocker", "description": "Work out in style, like Lucy Hale.The Pretty Little Liars actress is looking super cute in her Nike leggings and color-matchingSpiritual Gangster muscle tank (which is now only $43). If...", "type": "website", "url": "https://www.newslocker.com/en-us/news/celebrity/saturday-savings-lucy-hales-cute-muscle-tank-is-only-43/", "image": "http://akns-images.eonline.com/eol_images/Entire_Site/2017314/rs_600x600-170414120302-600.Lucy-Hale-Saturday-Savings.jl.041417.jpg?downsize=450:*&crop=450:350;left,top", "site_name": "Newslocker"}, "fb": {"admins": 1335791813}, "robots": "index", "google-site-verification": "wAInSoPxz3OEgOXCHtETx-x7ukmlX40FRoiPZpO7ww4", "msvalidate.01": "2F0DB39856FAA0E47C70E9E1FF8653AA"}, "movies": [], "publish_date": 1492261200.0, "source": "http://www.newslocker.com", "summary": ""}