{"url": "www.inquisitr.com/4695812/tom-cruise-dating-in-disguise-women-chosen-by-scientology-not-quite-yet-holmes-is-queen-of-secretive-romance/", "text": "Tom Cruise has seemingly been all about his movie career since his high-profile marriage to Katie Holmes met its demise. The action star has steadily starred in film after film, yet has been at the center of several dating rumors.\n\nAs the International Business Times reports, \"The actor was mistakenly linked to an Australian journalist and then was associated to his Mission: Impossible 6 co-star and Crown actress Vanessa Kirby.\"\n\nAll rumors until now have been stamped out as false.\n\nHowever, the latest claims include those stating that members of the Church of Scientology have once again been playing matchmaker for the Top Gun star and that Cruise has reportedly been secretly dating over the past little while. Interestingly enough, Tom has reportedly been using a disguise to enjoy dates with the ladies, much like Katie Holmes did in the initial stages of her romance with Jamie Foxx.\n\nA source told the publication about Cruise's tactics to keep his love life out of the spotlight.\n\n\"Tom's back on the dating scene, but nobody knows it's him. His face is way too recognizable for him to stroll into the bars, so he has his makeup artist create a silicone mask. Seems like Tom took his Mission: Impossible role to heart. It's just what Ethan Hunt would do in the movies.\"\n\nIt's also been claimed that the disguise, which includes makeup, takes a full five hours to apply. If this rumor all sounds a little far-fetched, that's because it is completely untrue, according to Gossip Cop. Tom Cruise does not go through some elaborate process to secretly step out on dates. In fact, there has not been any confirmation that Tom Cruise has dated anyone since Katie Holmes.\n\nKatie Holmes, however, continues to attempt to keep her romance with Jamie Foxx a secret, despite the fact that the pair has been spotted on numerous occasions over the past year on beach getaways and romantic locales like Paris. Most recently the mysterious duo were spotted celebrating Jamie's 50th birthday at a Santa Monica beach hotel last week, as Page Six relays.\n\nKatie Holmes and Jamie Foxx were spotted on another romantic beach getaway https://t.co/ZwdutxFdYe pic.twitter.com/dhoszJ2wg3 — Travel + Leisure (@TravelLeisure) December 19, 2017\n\n— Travel + Leisure (@TravelLeisure) December 19, 2017\n\nOnlookers at the hotel stated that the duo appeared to be quite awkward while Katie kept looking around cautiously. The couple was also seen walking along the beach while Foxx had his arm around the beauty. This report is similar to the one earlier this year that stated Katie Holmes and Jamie Foxx were spotted strolling along the beach hand-in-hand in Malibu.", "images": ["https://imgb.srgcdn.com/d258d2ec-e52b-4489-9950-908cc366bacf.jpg", "https://secure.gravatar.com/avatar/784fcf0a3514f31a582147119c01ff3d?s=800", "https://imgb.srgcdn.com/fe42e24b-1fa1-4cf2-b7ef-0bcd25a6f5c9.png", "https://imgb.srgcdn.com/1740626a-9ecf-4723-b66a-d7ca5e1d678c.jpg", "http://www.inquisitr.com/static/inquisitr/images/favicon-32x32.png", "https://imgb.srgcdn.com/14800743-abae-4146-ae2e-3b7a37ab5d23.jpg", "https://imgb.srgcdn.com/a5ba8e20-c5b5-4c82-ae2b-4f343261a07b.jpg", "https://imgb.srgcdn.com/6977b3f9-ffc5-44c5-866c-e80c13668077.jpg"], "top_img": "http://www.inquisitr.com/static/inquisitr/images/favicon-32x32.png", "keywords": [], "authors": [], "canonical_link": "https://www.inquisitr.com/4695812/tom-cruise-dating-in-disguise-women-chosen-by-scientology-not-quite-yet-holmes-is-queen-of-secretive-romance/", "title": "Tom Cruise Dating In Disguise, Women Chosen By Scientology? Not Quite, Yet Holmes Is Queen Of Secret Romance", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimal-ui, user-scalable=no", "msapplication-TileImage": "/static/inquisitr/favicon-128x128.png", "robots": "max-image-preview:large", "og": {"locale": "en_US", "type": "article", "title": "Tom Cruise Dating In Disguise, Women Chosen By Scientology? Not Quite, Yet Holmes Is Queen Of Secret Romance", "url": "https://www.inquisitr.com/4695812/tom-cruise-dating-in-disguise-women-chosen-by-scientology-not-quite-yet-holmes-is-queen-of-secretive-romance/", "site_name": "The Inquisitr", "description": "Tom Cruise Dating In Disguise, Women Chosen By Scientology? Not Quite, Yet Holmes Is Queen Of Secret Romance", "updated_time": "2021-08-16 18:13:43Z"}, "article": {"modified_time": "2021-08-16 18:13:43Z", "published_time": "2017-12-21 10:44:10Z", "section": "Rumors"}, "description": "Tom Cruise Dating In Disguise, Women Chosen By Scientology? Not Quite, Yet Holmes Is Queen Of Secret Romance", "keywords": "Rumors", "twitter": {"card": "summary_large_image"}}, "movies": [], "publish_date": 1513853050.0, "source": "http://www.inquisitr.com", "summary": ""}