{"url": "https://en.wikipedia.org/wiki/Ron_Goldman", "text": "American murder victim (1968–1994)\n\nRonald Lyle Goldman (July 2, 1968 – June 12, 1994) was an American restaurant waiter and a friend of Nicole Brown Simpson, the ex-wife of the American football player O.J. Simpson. He was murdered, along with Brown, at her home in Los Angeles, California, on June 12, 1994. Simpson was acquitted of their killings in 1995 but found liable for both deaths in a 1997 civil lawsuit.\n\nEarly life [ edit ]\n\nGoldman was born on July 2, 1968. He grew up in the community of Buffalo Grove, Illinois, near Chicago. His parents divorced in 1974, however, when he was six years old, and after spending a brief time in the custody of his mother, Sharon Rufo (née Fohrman), he was raised by his father, Frederic Goldman (born December 6, 1940). Goldman lived with his father and his younger sister.\n\nGoldman was raised Jewish. He attended high school at Adlai E. Stevenson High School in Lincolnshire, Illinois. He was a student at Illinois State University for one semester, where he planned to major in psychology, and he also had an interest in becoming a pledge in Sigma Nu fraternity. After his family relocated to Southern California when he was 18 years old, however, Goldman discontinued his studies and followed his family.\n\nPrior to relocating with his family, Goldman worked as a camp counselor and had experience volunteering with children suffering from cerebral palsy.[2][3]\n\nIn California [ edit ]\n\nWhile living in Los Angeles, Goldman took some classes at Pierce College.[2] He learned to surf and enjoyed playing beach volleyball, rollerblading, and nightclubbing.[4]\n\nUpon arriving in California, Goldman lived independently from his family and supported himself by working as an employment headhunter and tennis instructor. He then had a string of waiter jobs.[2] He also occasionally worked as a model for Barry Zeldes, owner of Z90049 (the store next to the California Pizza Kitchen in Brentwood Gardens, where he had worked before Mezzaluna).[5] Not long before his death, he had earned an Emergency Medical Technician's license, but he did not pursue that career.[2]\n\nInstead, Goldman told friends that he wanted to open a bar or restaurant in the Brentwood area.[2] He had shared with friends his vision of opening a future restaurant or bar characterized not by a name, but by the ankh, an Egyptian religious symbol of life that matched the tattoo on his shoulder.[5] According to his friend, Jeff Keller, he wanted to learn all facets of the restaurant-bar business, and occasionally worked as a promoter[5] at a Century City dance club called Tripps.[2] For Memorial Day, he participated with a group of event promoters in organizing a party at Renaissance, a club and restaurant on the Third Street Promenade in Santa Monica.[5]\n\nGoldman had also expressed aspirations to act and to be on a show, and he appeared as a contestant on the short-lived game show Studs in 1992. He had dated Jacqui Bell for nearly two years before she broke off their relationship three months before his death.[6][7]\n\nFriendship with Nicole Brown Simpson [ edit ]\n\nAccording to a June 15, 1994 Los Angeles Times article published three days after his death, Goldman met Brown only six weeks prior to the date they were murdered, when he borrowed her Ferrari. The two grew increasingly friendly, occasionally meeting for coffee and dinner in the weeks before their deaths. According to police and friends, however, the relationship between the two was platonic. One article noted that he had borrowed her car when he met his friend, Craig Clark, for lunch. According to Clark, he told him it was her car, but that he did not say she was his girlfriend. Instead, Goldman said they were friends.[8]\n\nDeath [ edit ]\n\nOn the evening of Sunday, June 12, 1994, Goldman worked a server shift at Mezzaluna Trattoria, a restaurant located at 11750 San Vicente Boulevard in Brentwood, California. Brown called to report that her mother accidentally left her sunglasses on the table when they dined there earlier in the evening. Goldman was not their server. After a search turned up the glasses in a street gutter outside the restaurant, Goldman agreed to drop them at her home after work.\n\nThe Los Angeles Times reported that Goldman \"punched out at 9:33 pm and stayed another 15 minutes to have bottled water at the bar.\" Before returning the sunglasses, he stopped by his Brentwood apartment at 11663 Gorham Avenue and spoke briefly to his roommate, Mezzaluna's bartender Stewart Tanner, before he left. The two had plans to go out later that evening.[5]\n\nGoldman and Brown were stabbed to death on the walkway leading to the condominium at 875 South Bundy Drive. Police found their bodies shortly after midnight. During a reconstruction of the events, the police came to believe he had arrived during or shortly after Nicole's death.[citation needed] Goldman's family believe that Goldman died trying to save Brown from her attacker and that he was the man eyewitnesses heard shouting that night.[9]\n\nGoldman was killed 20 days before his 26th birthday. He is buried at Pierce Brothers Valley Oaks Memorial Park in Westlake Village, California.[5][10]\n\nAftermath [ edit ]\n\nSimpson was tried for the killings of both Brown and Goldman. In October 1995, after a public trial that lasted nearly nine months, he was acquitted. In 1997, Fred Goldman (Ron's father) filed a civil lawsuit against Simpson. The jury found him liable for the wrongful death of Goldman and awarded the Goldman family $33 million. Simpson was subsequently jailed for an unrelated armed robbery at a Las Vegas hotel in 2008.[11][12] Both Fred and Kim Goldman were present at the robbery trial, and after Simpson's conviction, Fred Goldman expressed his satisfaction and referred to it as a \"bittersweet\" moment.[13]\n\nThe rights to Simpson's book, If I Did It, a first-person account of how he would have committed the murders had he committed them, were awarded to the Goldman family in August 2007. They were granted the proceeds from the book in 2007 as part of the multi-million dollar civil jury award against him they had been trying to collect for over a decade. They own the copyright, media rights, and movie rights.[14] They also acquired Simpson's name, likeness, life story, and right of publicity in connection with the book, according to court documents, ensuring he would not be able to profit from the book. After renaming the book If I Did It: Confessions of the Killer, the Goldman family published it in September 2007 through Beaufort Books.[15] Denise Brown, Nicole Brown's sister, criticized the Goldmans for publishing the book and accused them of profiting from Nicole and Ron's deaths.[16]\n\nFilmmaker Ezra Edelman, who directed and produced the documentary O.J.: Made in America, won the Academy Award for Best Documentary Feature, and dedicated the award to both Goldman and Brown in his acceptance speech. Fred Goldman was among those who Edelman interviewed in the documentary.\n\nIn an interview with Barbara Walters, Fred Goldman admitted that shortly after Simpson's acquittal, he was approached by a stranger who offered to sell him an untraceable high-powered rifle to kill Simpson or to hire someone to kill Simpson for him, but Goldman refused.[17]\n\nIn an interview with 20/20, Kim Goldman said that one day some time after Simpson's acquittal, she was driving in her car when she saw him in a parking lot in Los Angeles. She considered running him over to get vengeance, but didn't do it.[18]\n\nFrederic Goldman sued O.J. Simpson for $96 million over his son’s death. He is applying for a renewal of his old judgment against Simpson, claiming Simpson owes him $96 million over the murder of his son.[19]\n\nFoundation [ edit ]\n\nThe Goldman family contributed a portion of proceeds from the If I Did It book sales to the newly founded Ron Goldman Foundation for Justice.[20] It provides grants for multiple organizations and programs that provide resources to victims and survivors of violent crimes.[21] One of the largest donors to the foundation is Las Vegas executive Mark Goldman, Fred Goldman's first cousin.\n\nPortrayals [ edit ]\n\nGoldman was portrayed by Paul Witten in the 1995 TV movie The O.J. Simpson Story. He was portrayed by Russ Russo in Reenactment of the Century. He was portrayed by Drew Roy in the 2019 film The Murder of Nicole Brown Simpson.\n\nSee also [ edit ]\n\nMurder of Michael Nigg, unsolved killing (in 1995) of Goldman's friend and fellow Mezzaluna waiter\n\nO.J. Simpson robbery case\n\nReferences [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/thumb/0/0d/Ronald_goldman.jpg/220px-Ronald_goldman.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/0/0d/Ronald_goldman.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/0/0d/Ronald_goldman.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Ron_Goldman", "title": "Ron Goldman", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/0/0d/Ronald_goldman.jpg", "width": 640, "height": 856}, "title": "Ron Goldman - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}