{"url": "https://www.elitedaily.com/p/15-thanksgiving-friends-quotes-for-instagram-captions-this-turkey-day-3344824", "text": "Pretty much every TV show offers up some love for the end-of-year holidays with fun Christmas and Halloween episodes. Heck, there are even a bunch of iconic New Year’s Eve TV episodes. But one special day, Thanksgiving, often seems to be looked over. However, on Friends, Thanksgiving is the holiday that always gets the most shine. The iconic NBC sitcom made it a point to give fans some of the most memorable Turkey Day moments ever, and it's still one of the best shows to watch for hours on end while you're full of stuffing and mashed potatoes. To nail the perfect social media post for the holiday, try one of these Friends Thanksgiving quotes for your Instagram captions and watch the likes roll in. The show may have ended years ago, but the iconic quips are just as relevant and hilarious today as they ever were.\n\nIn total, there are 10 Thanksgiving-themed episodes of Friends, which means there's no shortage of hilarious quotes to fit whatever pic you share. The holiday episodes gave fans so many iconic moments, from that overly competitive football game to Monica’s unforgettable turkey head dance. Since pretty much everyone has seen Friends, these episodes make for the perfect Instagram caption mine over the holidays, since they’re packed with memorable lines.\n\nSo, fill up your plate with turkey and green beans, pass the gravy, and snap the perfect Turkey Day selfie to celebrate. You won't have any problem captioning your holiday pics with these 20 iconic Friends quotes from Monica, Phoebe, Chandler, Ross, Rachel, and Joey — any of which are sure to be a hit among all the Friends fans in your life this Thanksgiving.\n\nWarner Bros.\n\n1. \"I know this isn't the kind of Thanksgiving that all of you all planned, but for me, this has been really great, you know, I think because it didn't involve divorce or projectile vomiting.\"\n\n2. \"I'm very thankful that all of your Thanksgivings sucked.\"\n\n3. \"Set another place for Thanksgiving. My entire family thinks I have VD.\"\n\n4. \"Oh, sweet Lord! This is what evil must taste like!\"\n\n5. \"OK guys, I have exactly 28 minutes before I have to baste again.\"\n\n6. “I just gotta change my pants. What was I thinking? Jeans have no give!”\n\n7. \"The game is over? We eat now?\"\n\n8. \"It wouldn't be Thanksgiving without a little emotional scarring.\"\n\n9. \"Oh. And I'm also thankful for thongs.\"\n\n10. \"Well, Judy, you did it. She's finally full.\"\n\nWarner Bros.\n\n11. “Remember when Ross tried to say ‘butternut squash’ and it came out, ‘squatternut bosh?’”\n\n12. \"What is with everyone today? It's Thanksgiving, not truth day!\"\n\n13. “Everyone's here. Ross, Rachel and the boy who hates Thanksgiving.”\n\n14. \"Turkeys are beautiful, intelligent animals.\" \"No, they're not. They're ugly and stupid and delicious.\"\n\n15. \"Look at her holding those yams. Those are our two worst enemies, Ross: Rachel Green and complex carbohydrates.\"\n\n16. “I don't know what to pick. Am I more thankful for my divorce or my eviction? Hmm.”\n\n17. \"You can't have Thanksgiving without turkey. That's like Fourth of July without apple pie or Friday with no two pizzas.\"\n\n18. “I love macaroni and cheese. I love the way this box feels against my cheek.”\n\n19. \"Everyone, we're using our fancy china, and it's very expensive, so please be careful. Just to be clear, comedy with the plates will not be well-received.\"\n\n20. \"Don't you put words in people's mouths. You put turkey in people's mouths.\"", "images": ["https://imgix.bustle.com/uploads/image/2020/11/16/1c03f580-f363-412c-8ad1-0c43d766566c-season-5-all-thanksgivings-1536202881.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=15353773&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2022/10/3/639c6ae6-d0aa-475f-9e02-17f45ab27f78-getty-1336638292.jpg?w=138&h=138&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/uploads/image/2019/11/12/a0792525-5ec8-42f5-89e1-cd7058e1cedf-friends-thanksgiving-today-main-001-190912_705f8070bba1187852471bff064fcc20.jpg?w=414&h=207&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/9/26/ed2c7624-e18b-407a-8eda-23ce633c9ad4-bridgerton_costumes_season-2.jpg?w=138&h=138&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.7107&fp-y=0.372", "https://imgix.bustle.com/uploads/image/2020/11/16/1c03f580-f363-412c-8ad1-0c43d766566c-season-5-all-thanksgivings-1536202881.jpg?w=374&h=210&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/getty/2020/10/22/1789f9a1-57c2-4fb0-944c-e4d0771ce853-getty-1281224250.jpg?w=138&h=138&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2019/11/12/661cebe9-8cff-4266-838b-6c239037aa05-dsc_1746-h_2019.jpg?w=414&h=233&fit=crop&crop=faces&auto=format%2Ccompress", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1"], "top_img": "https://imgix.bustle.com/uploads/image/2020/11/16/1c03f580-f363-412c-8ad1-0c43d766566c-season-5-all-thanksgivings-1536202881.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.elitedaily.com/entertainment/thanksgiving-friends-quotes-instagram-captions", "title": "20 Friends Quotes That Are Perfect For Your Thanksgiving Instagram Captions", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@elitedaily", "card": "summary_large_image"}, "article": {"publisher": "https://www.facebook.com/EliteDaily"}, "og": {"site_name": "Elite Daily", "url": "https://www.elitedaily.com/entertainment/thanksgiving-friends-quotes-instagram-captions", "type": "article", "title": "20 ‘Friends’ Quotes That Are Perfect For Your Thanksgiving Instagram Captions", "description": "The Thanksgiving episodes of 'Friends' are some of the show's most iconic, and they're a goldmine for hilarious quotes about the holiday.", "image": {"identifier": "https://imgix.bustle.com/uploads/image/2020/11/16/1c03f580-f363-412c-8ad1-0c43d766566c-season-5-all-thanksgivings-1536202881.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "The Thanksgiving episodes of 'Friends' are some of the show's most iconic, and they're a goldmine for hilarious quotes about the holiday."}, "movies": [], "publish_date": null, "source": "https://www.elitedaily.com", "summary": ""}