{"url": "www.wmagazine.com/story/halle-berry-done-with-love-alex-da-kid", "text": "With just a few weeks left in the year, another relationship bites the dust. Halle Berry, fresh out of a short-lived courtship, has apparently announced that she is “done with love,” and will not be looking to start up a new relationship any time soon. While documenting her workout on Instagram Stories, the Oscar-winning actress posted a photo of exercise ropes on the ground, a seemingly innocuous snapshot of post-workout bliss. But what was significant about this particular photo was the apparent heart shape of the ropes, as Berry followed up the photograph with another one, where she drew a red heart around the shape of the rope and added the text “Done with love” and three muscle emojis. Turns out, these heart shaped rope photos were indicative of the break-up Berry had just endured from former boyfriend, British producer Alex Da Kid\n\nBefore dating Alex Da Kid, Berry was involved in a few whirlwind relationships, so it’s understandable if she would like to officially take a break. The Kingsman 2 actress was previously married to baseball player David Justice, and then married to singer Eric Benét, before being caught up in heated and highly publicized custody battles over her daughter with former partner Gabriel Aubry, and divorce from her most recent ex-husband Olivier Martinez, with whom she has a son.\n\nHalle Berry/[Instagram](http://instagram.com/halleberry/)\n\nAlex Da Kid—born Alexander Grant and responsible for producing hits like Eminem and Rihanna’s “Love The Way You Lie”—and Berry both shared the same black-and-white snapshot with the caption “My balance” on their Instagram accounts in September, as an official announcement of their romance. The couple made just a few public appearances together, one of them being at a Halloween party this year, where they both dressed up as mummies. After Berry and Grant ended their short-lived relationship, according to a report from Us Weekly. As of right now, it is not clear whether or not the split was amicable, but Berry’s Instagram Stories post indicates that she will be steering clear of any new relationships for the time being.\n\nRelated: An Exploration of Halle Berry’s Ever-Changing Hairstyles and Age-Defying Beauty\n\nHalle Berry Presents a Dramatic Interpretation of Britney Spears’s “Oops, I Did It Again”", "images": ["https://imgix.bustle.com/wmag/2017/08/04/59847b1004027c40d5041253_halle.jpg?w=414&h=233&fit=crop&crop=faces&auto=format%2Ccompress", "https://pixel.quantserve.com/pixel/p-xPmcrFNGfHkBg.gif", "https://imgix.bustle.com/wmag/2017/08/04/59847b1004027c40d5041253_halle.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "https://sb.scorecardresearch.com/p?c1=2&c2=17519299&cs_ucfr=0&cv=2.0&cj=1", "https://imgix.bustle.com/uploads/getty/2022/10/5/47b5fa0f-fc48-4cb1-9604-6f5821fa832d-getty-1430611960.jpg?w=160&h=160&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.5093&fp-y=0.3502", "https://www.facebook.com/tr?id=1636673763227734&ev=PageView&noscript=1", "https://imgix.bustle.com/wmag/2017/12/14/5a32c432499a6c4ea286ad42_IMG_4045.PNG?w=374&h=665&fit=crop&crop=faces&auto=format%2Ccompress", "https://imgix.bustle.com/uploads/image/2022/8/29/9f122c0b-8ad0-4d04-b2cf-3379547870db-tswifty.jpeg?w=160&h=160&fit=crop&crop=focalpoint&auto=format%2Ccompress&fp-x=0.532&fp-y=0.228"], "top_img": "https://imgix.bustle.com/wmag/2017/08/04/59847b1004027c40d5041253_halle.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "keywords": [], "authors": [], "canonical_link": "https://www.wmagazine.com/story/halle-berry-done-with-love-alex-da-kid", "title": "Halle Berry Is Officially “Done with Love”", "meta_data": {"viewport": "width=device-width,initial-scale=1", "referrer": "unsafe-url", "twitter": {"site": "@wmag", "card": "summary_large_image", "creator": "@brkmrn"}, "article": {"publisher": "https://www.facebook.com/wmagazine"}, "og": {"site_name": "W Magazine", "url": "https://www.wmagazine.com/story/halle-berry-done-with-love-alex-da-kid", "type": "article", "title": "Halle Berry Is Officially \"Done with Love\" After Latest Breakup", "description": "The Oscar-winning actress posted a cryptic photo to her Instagram Stories, most likely in reference to her recent breakup with British producer Alex Da Kid.", "image": {"identifier": "https://imgix.bustle.com/wmag/2017/08/04/59847b1004027c40d5041253_halle.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "width": 1200, "height": 630}}, "description": "The Oscar-winning actress posted a cryptic photo to her Instagram Stories, most likely in reference to her recent breakup with British producer Alex Da Kid."}, "movies": [], "publish_date": null, "source": "http://www.wmagazine.com", "summary": ""}