{"url": "https://detroit.cbslocal.com/2018/03/01/survivor-ghost-island-season-premiere-recap/", "text": "By Mickie McLeod\n\nThe graveyard for bad Survivor decisions will haunt the dreams of the newest castaways. Welcome to Survivor: Ghost Island!\n\nLast night was the two-hour premiere of the 36th season of Survivor: Ghost Island: a secluded land filled with past mistakes from the previous 35 seasons. Did you miss the premiere? I always got you covered!\n\n\"Only Time Will Tell\" - Jeff Probst, Kellyn Bechtold, Bradley Kleihege, and Morgan Ricke on the third episode of Survivor: Ghost Island, airing Wednesday, March 7 (8:00-9:00 PM, ET/PT) on the CBS Television Network. Photo: Robert Voets/CBS Entertainment Ã\u0082Â©2018 CBS Broadcasting, Inc. All Rights Reserved.\n\nThe One-Million Dollar Adventure had begun as the 20 castaways battled it out among two tribes, Naviti (Purple buffs) and Malolo (Orange buffs). Who will Outwit, Outplay, and Outlast on the season with new twists, new challenges, and most of all, GHOST ISLAND?\n\n\"Only Time Will Tell\" - Jeff Probst, Desiree Afuye, and Chelsea Townsend on the third episode of Survivor: Ghost Island, airing Wednesday, March 7 (8:00-9:00 PM, ET/PT) on the CBS Television Network. Photo: Robert Voets/CBS Entertainment Ã\u0082Â©2018 CBS Broadcasting, Inc. All Rights Reserved.\n\nThese 20 castaways don't know what \"Ghost Island\" is all about, but we sure do! Survivor is the greatest competitive, social experience to play. One bad mistake in Survivor will end your game quick. Ghost Island is filled with relics from the past 35 seasons from previous castaways whose torch was snuffed too soon. On this season, castaways will be sent to Ghost Island to reverse the curse. This is one season you do not want to miss!\n\nFirst Hour\n\nThings are changing up this season! Unlike recent seasons, there was no \"shipwreck\" start, which meant gathering as many materials as needed for the Tribe's camp. Instead, this season began with a mini-challenge to declare what tribe will earn what materials. The first tribe to finish received an entire shelter-building kit, along with eggs, and flint for fire. The tribe that lost the challenge received minimal items such as rice, a pot, and very little fishing gear. THIS is how you start a season of Survivor!\n\nThe Malolo Tribe won the challenge, leaving Naviti with very few supplies to start the game.\n\nNaviti (Purple)\n\n\"Only Time Will Tell\" - Desiree Afuye, Chelsea Townsend, Kellyn Bechtold, Angela Perkins, Bradley Kleihege, Domenick Abbate, Domenick Abbate, Chris Noble, Sebastian Noel, and Wendell Holland on the third episode of Survivor: Ghost Island, airing Wednesday, March 7 (8:00-9:00 PM, ET/PT) on the CBS Television Network. Photo: Robert Voets/CBS Entertainment Ã\u0082Â©2018 CBS Broadcasting, Inc. All Rights Reserved.\n\nThe two tribes parted ways to their camps. In this first hour, we're introduced to the castaways from each tribe and got to know them a little more.\n\nSome that were highlighted in this episode included a male model named Chris, who took a leadership role right away on the tribe. There's Domenick, who was shown to be an outspoken player and someone Chris didn't like. A few other highlights of the tribe were Morgan, a Killer Whale Trainer whose bubbly personality is infectious, and Sebastian, a fisherman who is now nicknamed \"See-Bass\" because he is \"Se-bas.\" Get it?\n\nMalolo (Orange)\n\n\"Only Time Will Tell\" - Brendan Shapiro, Jenna Bowman, Stephanie Johnson, James Lim, Laurel Johnson, Libby Vincek, and Michael Yerger on the third episode of Survivor: Ghost Island, airing Wednesday, March 7 (8:00-9:00 PM, ET/PT) on the CBS Television Network. Photo: Robert Voets/CBS Entertainment Ã\u0082Â©2018 CBS Broadcasting, Inc. All Rights Reserved.\n\nMalolo has a tribe filled with a variety of characters. There's a young man, a Real Estate Agent named Michael, who told his tribe that he's 23. He's 18 but thinks his age could be a disadvantage in the game. Donathan is a younger Kentucky raised Caregiver who shared that he's gay and has never done crazy adventures or anything like the game of Survivor. Also on the Malolo tribe, there's a lady named Stephanie, a cool Yoga Instructor who wears rainbow leggings (she gets my vote). The most involved castaway on this episode was a man named Jacob, the Seth Rogan-like guy (in my opinion), is a Jewish Music Teacher!\n\nImmunity Challenge\n\nThis was a brutal first challenge. The challenge contained each tribe retrieving giant-sized puzzle pieces onto a large sled. After the puzzles were on the sled, the tribe then had to pull their sled through a large obstacle. Once completing the obstacle, the first tribe to solve their giant puzzle cube won Immunity! Every castaway on each tribe was pulling their heart out, sweating, and fighting hard. It was a close battle, but it was Naviti who won this first Immunity Challenge, sending Malolo to Tribal Council.\n\n\"Only Time Will Tell\" - Jeff Probst and Tribes Naviti and Malolo on the third episode of Survivor: Ghost Island, airing Wednesday, March 7 (8:00-9:00 PM, ET/PT) on the CBS Television Network. Photo: Robert Voets/CBS Entertainment Ã\u0082Â©2018 CBS Broadcasting, Inc. All Rights Reserved.\n\nThe twist was that Navita got to choose what castaway from the losing tribe, Malolo, would face Ghost Island overnight. This meant that although the person would be alone on the spooky Ghost Island, they would be safe from being voted out at Tribal Council. Because of his outspokenness after the challenge, it was Jacob who was chosen to be the first person to check-in at Ghost Island-Inn.\n\nGhost Island\n\nGHOST ISLAND IS IN PLAY! All of the original relics from past seasons, old snuffers, former fake idols, misplayed advantages and artifacts hung and rose from the dead among this spooky island. A post labeled \"smash of urn\" greeted Jacob as he arrived. After smashing his urn, he received a game ticket which led him to the Ghost Island campfire. The Ghost Island campfire spirits offered Jacob a game to play, and he had to choose between three bamboo boxes to retrieve a key. If Jacob chose the right box, he would receive a key to an advantage... and he did!\n\n\"Can You Reverse the Curse?\" - Jacob Derwin on Survivor: Ghost Island. The Emmy Award-winning series returns for its 36th season with a special two-hour premiere, Wednesday, Feb. 28 (8:00-10:00 PM, ET/PT) on the CBS Television Network. Photo: Michele Crowe/CBS Entertainment Ã\u0082Â©2018 CBS Broadcasting, Inc. All Rights Reserved.\n\nIf you're a Survivor nerd like I am, you'd recognize this one: the original Legacy Advantage from Survivor season 34. This Legacy Advantage is on Ghost Island because Sierra from Survivor: Game Changers was voted out with the advantage in her pocket. The Legacy Advantage is a type of advantage that gives you Immunity from Tribal Council in the first merger or final six. Because of the curse, Jacob was given the advantage, not for himself, but to give away to someone on the opposite tribe. He decided to give it away to Morgan.\n\nTribal Council\n\nThis season is one you must not miss! As quoted, this Tribal Council was \"throwing it down\" right away. The game was on! Stephanie, also known as \"Gonzalez\" had stood up right away during Tribal before voting and whispered to a guy on her tribe, Brendan. This created a HUGE target on Gonzalez' back. Her cockiness got in her way and needless to say, she was the first one voted off of Survivor: Ghost Island.\n\nSecond Hour\n\nNaviti (Purple)\n\nDuring the night, Dominick found a Hidden Immunity Idol after searching through the forest in the pure dark. This Hidden Immunity wasn't just any regular Idol though; it was from the 26th season of Survivor where Andrea was voted out with it in her pocket. Now that Dom has it, will he have the chance to reverse the curse and play the idol as it deserves?\n\n\"Can You Reverse the Curse?\" - Domenick Abbate and Chris Noble on Survivor: Ghost Island. The Emmy Award-winning series returns for its 36th season with a special two-hour premiere, Wednesday, Feb. 28 (8:00-10:00 PM, ET/PT) on the CBS Television Network. Photo: Michele Crowe/CBS Entertainment Ã\u0082Â©2018 CBS Broadcasting, Inc. All Rights Reserved.\n\nWith confidence in his pocket (an idol) Dom approaches Chris to form a trusting bond with him. Chris isn't a fan of Dom and Dom knows it. Dom seems to be a strategic player, so he decided to make a fake Hidden Immunity Idol to show Chris. Along with the fake idol, Dom shared the actual note that came along with the real one. He gave the \"fake\" idol with the real note to Chris, hoping to build trust with him. Will Chris soon realize that the idol given to him is fake?\n\n\"Can You Reverse the Curse?\" - Morgan Ricke, Sebastian Noel, Domenick Abbate, Chelsea Townsend, and Kellyn Bechtold on Survivor: Ghost Island. The Emmy Award-winning series returns for its 36th season with a special two-hour premiere, Wednesday, Feb. 28 (8:00-10:00 PM, ET/PT) on the CBS Television Network. Photo: Robert Voets/CBS Entertainment Ã\u0082Â©2018 CBS Broadcasting, Inc. All Rights Reserved.\n\nMeanwhile, Morgan received the unexpecting surprise; Sierra's original Legacy Advantage from Survivor: Game Changers. The Legacy was willed from Jacob on Malolo, as he earned it from his stay at Ghost Island. She is thrilled and plans to keep her Ghost Island gift as a secret.\n\nMalolo (Orange)\n\nJacob is heading back from Ghost Island and is debating what to tell his tribe what the island is all about. He decided to keep the original Legacy Advantage that he gave to Morgan, a secret as well. Instead, he planned to tell his tribe that he received an \"idol\" during his stay and made a fake one out of shells and string, similar to Dom's creation at Naviti.\n\n\"Can You Reverse the Curse?\" - Jacob Derwin on Survivor: Ghost Island. The Emmy Award-winning series returns for its 36th season with a special two-hour premiere, Wednesday, Feb. 28 (8:00-10:00 PM, ET/PT) on the CBS Television Network. Photo: Michele Crowe/CBS Entertainment Ã\u0082Â©2018 CBS Broadcasting, Inc. All Rights Reserved.\n\nAfter arriving back from Ghost Island, Jacob feels like he's in a lot of trouble. Fortunately, he has the fake \"Immunity Idol\" he just made at Ghost Island. He decided to stretch the truth and even show his tribe the fake, (and poorly made) idol. When asked if he received a note with it, he awkwardly said he \"forgot\" it on the island. The only person who seemed to believe this dramatic lie is Jacob himself. His tribe is totally on to him.\n\nImmunity Challenge\n\nThe Immunity Challenge in the second hour was a physical challenge through the water. The tribes raced through water obstacles, retrieved buoys deep down in the ocean, and shot them into baskets. The first tribe that shot all their buoys into their basket won Immunity!\n\n\"Can You Reverse the Curse?\" - Donathan Hurley and James Lim on Survivor: Ghost Island. The Emmy Award-winning series returns for its 36th season with a special two-hour premiere, Wednesday, Feb. 28 (8:00-10:00 PM, ET/PT) on the CBS Television Network. Photo: Robert Voets/CBS Entertainment Ã\u0082Â©2018 CBS Broadcasting, Inc. All Rights Reserved.\n\nDonathan, the Kentucky, unadventurous guy on the Malolo tribe was having a difficult time. He refused to swim down to retrieve buoys, leaving James the only one to retrieve them at the obstacle. The challenge was all about a personal achievement for Donathan, who ended up pushing himself through his fears and retrieved the buoys.\n\n\"Can You Reverse the Curse?\" - Donathan Hurley, Stephanie Gonzalez, Libby Vincek, James Lim, Brendan Shapiro, Jenna Bowman, Michael Yerger, and Laurel Johnson at Tribal Council on Survivor: Ghost Island. The Emmy Award-winning series returns for its 36th season with a special two-hour premiere, Wednesday, Feb. 28 (8:00-10:00 PM, ET/PT) on the CBS Television Network. Photo: Robert Voets/CBS Entertainment Ã\u0082Â©2018 CBS Broadcasting, Inc. All Rights Reserved.\n\nHowever, Donathan's setback caused them to lose once again. This left Malolo no choice but to head back to Tribal Council. Because of their win, Naviti got to choose what castaway from Malolo would be safe from Tribal, but be sent to Ghost Island for the night. Since his performance in the challenge made his tribe suffer, Naviti sent Donathan to Ghost Island.\n\n\"Can You Reverse the Curse?\" - Jacob Derwin on Survivor: Ghost Island. The Emmy Award-winning series returns for its 36th season with a special two-hour premiere, Wednesday, Feb. 28 (8:00-10:00 PM, ET/PT) on the CBS Television Network. Photo: Robert Voets/CBS Entertainment Ã\u0082Â©2018 CBS Broadcasting, Inc. All Rights Reserved.\n\nOnce arrived at Ghost Island, following Jacob's lead, Donathan smashed an urn. The urn did not give him a \"game\" like Jacob received. That meant Donathan was left alone for the night with no advantage or a chance to play a relic from previous seasons.\n\nTribal Council\n\n\"Can You Reverse the Curse?\" - Stephanie Gonzalez, Donathan Hurley, Libby Vincek, James Lim, Stephanie Johnson, Brendan Shapiro, Jenna Bowman, Michael Yerger, Laurel Johnson, and Jeff Probst at Tribal Council on Survivor: Ghost Island. The Emmy Award-winning series returns for its 36th season with a special two-hour premiere, Wednesday, Feb. 28 (8:00-10:00 PM, ET/PT) on the CBS Television Network. Photo: Robert Voets/CBS Entertainment Ã\u0082Â©2018 CBS Broadcasting, Inc. All Rights Reserved.\n\nDuring the challenge, James screwed up badly with Donathan and created a target on his back. However, Jacob has a larger one because of the suspicion of his \"idol\" from Ghost Island. Stephanie thought it was a good idea to flirt with Jacob, hoping he would trust her and confess his lie to her. She played him good, and he told her the truth about his fake idol. Will she still want to vote him out, after she now has someone who can trust her in this game?\n\n\"Can You Reverse the Curse?\" - Stephanie Gonzalez, Donathan Hurley, and Libby Vincek at Tribal Council on Survivor: Ghost Island. The Emmy Award-winning series returns for its 36th season with a special two-hour premiere, Wednesday, Feb. 28 (8:00-10:00 PM, ET/PT) on the CBS Television Network. Photo: Robert Voets/CBS Entertainment Ã\u0082Â©2018 CBS Broadcasting, Inc. All Rights Reserved.\n\nStephanie thought about it but deep down knew she couldn't trust Jacob in the long run. No one did. Jacob even referred to himself as a neurotic person on this tribe, which was not a good look for him. This Tribal Council was pretty predictable, and Jacob was the second person voted off on this season of Survivor: Ghost Island.\n\n\"Can You Reverse the Curse?\" - Jacob Derwin on Survivor: Ghost Island. The Emmy Award-winning series returns for its 36th season with a special two-hour premiere, Wednesday, Feb. 28 (8:00-10:00 PM, ET/PT) on the CBS Television Network. Photo: Robert Voets/CBS Entertainment Ã\u0082Â©2018 CBS Broadcasting, Inc. All Rights Reserved.\n\nIt's only six days in on this season of Survivor! This is one season you don't want to miss. Being someone who has watched since season one, I love seeing elements from past seasons merged! What relic do you hope comes back? Will these castaways finally reverse these curses? Tweet me @mick_cloudy and let's talk Survivor!\n\n\n\nYou can watch this season of Survivor: Ghost Island, Wednesdays at 8 pm on CBS 62 and don't miss my weekly recaps every Thursday morning right here on CBSDetroit.com!", "images": ["https://assets3.cbsnewsstatic.com/hub/i/r/2018/03/01/38e6340b-9811-4d7e-8782-bd2428971e10/thumbnail/620x414/4fd78f1f1ef792b3422bd9707eb89bd1/110483_05012b.jpg", "https://assets2.cbsnewsstatic.com/hub/i/r/2018/03/01/e949cde7-c720-4bf9-90e6-33855bc857a3/thumbnail/620x414/2397e5c2a11391889b5a6c81729d6849/110483_04956b.jpg", "https://detroit.cbslocal.com/assets/show/detroit/logo-square-32.svg", "https://assets3.cbsnewsstatic.com/hub/i/r/2018/03/01/bf1e6c91-26e9-456b-9f31-a05087586802/thumbnail/620x930/955e0f1c5aa184475b72fb838c257e23/110483_07806b.jpg", "https://assets3.cbsnewsstatic.com/hub/i/r/2018/03/01/32f3249e-7fdc-4f40-b968-efe9a6b833be/thumbnail/1200x630/405a3181f48fdd622e611a8714f28b85/110483_03444b.jpg", "https://assets3.cbsnewsstatic.com/hub/i/r/2018/03/01/e63b000d-1a7e-42fe-9134-84fb4833cd86/thumbnail/620x413/6a5db72c6ae2e57fb469ad01e370d6ac/110483_09658b.jpg", "https://assets3.cbsnewsstatic.com/hub/i/r/2018/03/01/4015aba3-4ca0-438d-af08-2f379d4653b5/thumbnail/620x930/f167835c69d877e199f020bf073714a2/110483_01154b.jpg", "https://assets3.cbsnewsstatic.com/hub/i/r/2018/03/01/f1dec79a-3a28-4386-a87c-fbf8fe91d360/thumbnail/620x413/d0adbfe7bf7a2c01ac8383d1470f1878/110483_09623b.jpg", "https://assets1.cbsnewsstatic.com/hub/i/r/2018/03/01/12ab9e68-a1e0-4bfa-93d0-78437b821466/thumbnail/620x424/4c4fcffbd4a6ad1c881ca6d34b52ad99/110483_09684b.jpg", "https://assets3.cbsnewsstatic.com/hub/i/r/2018/03/01/51d7cd22-9970-42c6-afb5-8cca92c2f735/thumbnail/620x413/8442581e142789c766efbcf20042024c/110483_09692b.jpg", "https://assets3.cbsnewsstatic.com/hub/i/r/2018/03/01/ed4f0160-af63-43ec-9fd2-41ea2c06a814/thumbnail/620x459/bae54dea27d2d522c10e3f4b46d061a7/110483_09633b.jpg", "https://assets1.cbsnewsstatic.com/hub/i/r/2018/03/01/1d3d6388-2034-4538-af79-38b95aa38ffd/thumbnail/620x413/07690ee617cc6bc0a7ee18539bffca96/110483_02431b.jpg", "https://assets2.cbsnewsstatic.com/hub/i/r/2018/03/01/b9d5ab4b-874b-445f-9639-b9808fafcbf7/thumbnail/620x928/47645230b955608fa8adb5575b79b254/110483_05271b.jpg", "https://assets1.cbsnewsstatic.com/hub/i/r/2018/03/01/92c20dc1-1ccc-4cc7-b911-b7fbcb6bee4b/thumbnail/620x443/a4d0732095b467002768d2d491f90067/110484_8463b.jpg", "https://assets1.cbsnewsstatic.com/hub/i/r/2018/03/01/49369805-5b27-4b99-9acf-6077376bb62c/thumbnail/620x414/692288439af2312b439b842eb1060aa7/110483_05091b.jpg", "https://assets2.cbsnewsstatic.com/hub/i/r/2018/03/01/fddbbc84-c349-4ad4-8cc3-1b307392dbac/thumbnail/620x414/2ff6d0a6662e49a0825f889bf0b1921e/110484_11656b.jpg", "https://assets1.cbsnewsstatic.com/hub/i/r/2018/03/01/cd1e8719-0dc7-447b-a3ce-50d5638864cf/thumbnail/620x414/8802eacb061c7899ecdb220684f51032/110484_11768b.jpg", "https://www.facebook.com/tr?id=418549723649035&ev=PageView&noscript=1"], "top_img": "https://assets3.cbsnewsstatic.com/hub/i/r/2018/03/01/32f3249e-7fdc-4f40-b968-efe9a6b833be/thumbnail/1200x630/405a3181f48fdd622e611a8714f28b85/110483_03444b.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.cbsnews.com/detroit/news/survivor-ghost-island-season-premiere-recap/", "title": "Survivor: Ghost Island - Season Premiere Recap", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1, user-scalable=0", "color-scheme": "only light", "robots": "index, follow, max-image-preview:large", "description": "Last night was the two-hour premiere of the 36th season of SURVIVOR: GHOST ISLAND a secluded land filled with past mistakes from the previous 35 seasons. Did you miss the premiere? I always got you covered!", "al": {"web": {"url": "https://www.cbsnews.com/detroit/news/survivor-ghost-island-season-premiere-recap/"}, "ios": {"app_name": "CBS News", "app_store_id": 334256223, "url": "cbsnewsapp://cbsnews.com/detroit/news/survivor-ghost-island-season-premiere-recap/"}, "android": {"app_name": "CBS News", "package": "com.treemolabs.apps.cbsnews", "url": "cbsnewsapp://cbsnews.com/detroit/news/survivor-ghost-island-season-premiere-recap/"}}, "og": {"type": "article", "url": "https://www.cbsnews.com/detroit/news/survivor-ghost-island-season-premiere-recap/", "title": "Survivor: Ghost Island - Season Premiere Recap", "description": "Last night was the two-hour premiere of the 36th season of SURVIVOR: GHOST ISLAND a secluded land filled with past mistakes from the previous 35 seasons. Did you miss the premiere? I always got you covered!", "image": {"identifier": "https://assets3.cbsnewsstatic.com/hub/i/r/2018/03/01/32f3249e-7fdc-4f40-b968-efe9a6b833be/thumbnail/1200x630/405a3181f48fdd622e611a8714f28b85/110483_03444b.jpg", "width": 1200, "height": 630}}, "fb": {"app_id": 1536620209892267, "pages": 178397465506996}, "article": {"publisher": "https://www.facebook.com/CBSDetroit/", "content_tier": "free", "opinion": "false"}, "twitter": {"dnt": "on", "app": {"country": "US", "name": {"iphone": "CBS News", "ipad": "CBS News", "googleplay": "CBS News"}, "id": {"iphone": 334256223, "ipad": 334256223, "googleplay": "com.treemolabs.apps.cbsnews"}, "url": {"iphone": "cbsnewsapp://cbsnews.com/detroit/news/survivor-ghost-island-season-premiere-recap/", "ipad": "cbsnewsapp://cbsnews.com/detroit/news/survivor-ghost-island-season-premiere-recap/", "googleplay": "cbsnewsapp://cbsnews.com/detroit/news/survivor-ghost-island-season-premiere-recap/"}}, "site": "@CBSDetroit", "title": "Survivor: Ghost Island - Season Premiere Recap", "description": "Last night was the two-hour premiere of the 36th season of SURVIVOR: GHOST ISLAND a secluded land filled with past mistakes from the previous 35 seasons. Did you miss the premiere? I always got you covered!", "image": "https://assets3.cbsnewsstatic.com/hub/i/r/2018/03/01/32f3249e-7fdc-4f40-b968-efe9a6b833be/thumbnail/1200x630/405a3181f48fdd622e611a8714f28b85/110483_03444b.jpg", "card": "summary_large_image"}, "theme-color": "#101010", "apple-mobile-web-app-capable": "yes", "apple-mobile-web-app-title": "CBS News", "apple-mobile-web-app-status-bar-style": "black"}, "movies": [], "publish_date": 1519862400.0, "source": "https://detroit.cbslocal.com", "summary": ""}