{"url": "https://www.cosmopolitan.com/entertainment/celebs/a8673228/prince-harry-meghan-markle-dating-timeline/", "text": "Meghan Markle and Prince Harry’s love story is truly what fairy tales are made of (you know, minus all that drama with the royal family). From meeting while Meghan was working as an actor to getting married, having two cute babies, and leaving the British royal family to be sorta normal, they’ve been through it all. And even after facing tons of unfair scrutiny from the public and press, they only seem stronger.\n\nWhile you’re trying to figure out if you have a shot at running into them in Los Angeles, let’s take a trip down memory lane and see how these two royals fell in love.\n\nOctober 31, 2016\n\nThe Sunday Express reports that Prince Harry has been secretly dating Suits star Meghan Markle. According to one source, Harry is “happier than he’s been for many years” and “there’s definitely chemistry between them.”\n\n\n\nGetty\n\nNovember 2, 2016\n\nBoth Toronto paper Star and Us Weekly report that Harry and Meghan attended a Halloween party together in Canada following a “bait-and-switch” situation at Heathrow Airport. (Meghan lives in Toronto when Suits is filming.) People, meanwhile, reports that Harry has already introduced his new girlfriend to his father, Prince Charles. According to one source, “Harry is pretty serious about her and she is pretty serious about him.”\n\nMeghan at an E! event in May 2016. Getty\n\nNovember 8, 2016\n\nHarry confirms his relationship by releasing a rare statement that includes a plea to the media and social media trolls to stop the “wave of abuse and harassment.” According to Harry, there have been “nightly legal battles” to stop papers from publishing defamatory stories while Meghan’s mother has been fighting photographers at front door.\n\n“Prince Harry is worried about Ms. Markle’s safety and is deeply disappointed that he has not been able to protect her. It is not right that a few months into a relationship with him that Ms. Markle should be subjected to such a storm. He knows commentators will say this is ‘the price she has to pay’ and that ‘this is all part of the game.’ He strongly disagrees. This is not a game—it is her life and his.”\n\nDecember 7, 2016\n\nWhile at a flower shop in Toronto, Meghan is pictured wearing a necklace with the letters “M” and “H.” According to Entertainment Tonight, the 14-karat gold Maya Brenner Asymmetrical Letter necklace is $240, with an additional $60 for each letter.\n\nDecember 14, 2016\n\nMeghan and Harry are spotted holding hands in public for the first time after catching The Curious Incident of the Dog in the Nighttime on London’s West End. The Sun reports that the couple, who wore his-and-hers beanies, admired Christmas lights along Piccadilly. The day before, Meghan and Harry are spotted picking out a six-foot Christmas tree together.\n\nHarry in London, December 2016. Getty\n\nDecember 20, 2016\n\nUs Weekly reports that Queen Elizabeth II is “fully supportive” of Harry’s relationship with Meghan. According to one source, the Queen is “delighted to see Harry in a loving relationship.”\n\nJanuary 6, 2017\n\nMeghan and Harry embark on their first official vacation together after spending New Year’s in London. Us Weekly reports the couple jetted off to the Norwegian fjords to catch the Northern Lights, staying with Harry’s close friend expedition guide and polar consultant Inge Solheim at his luxury property in Tromsø. According to a source at The Sun, Harry “put a lot of thought into it and wanted to make it as romantic and special as possible.”\n\nFebruary 2, 2017\n\nMeghan and Harry are spotted holding hands in London after dinner at the exclusive Soho House, where they reportedly first met last June through mutual friend Markus Anderson, a consultant at the private members’ club. Sources tell The Sun that the actor, who is currently on a break from filming Suits, has “virtually moved in” with Harry at his cottage in Kensington Palace. One friend predicts a spring engagement: “I know that sounds a bit crazily soon, but he’s head over heels and they can’t bear to be apart.”\n\nMarch 4, 2017\n\nMeghan joins Harry at a friend’s wedding in Montego Bay, Jamaica. According to People, Meghan wore a long floral dress and sunglasses while Harry served as one of 14 ushers in a navy blue blazer and pants.\n\nGetty\n\nApril 7, 2017\n\nIn an announcement and final post, Meghan’s lifestyle website, The Tig, shuts down after nearly three years. Despite speculations that this is a sign Meghan and Harry will soon tie the knot, a source tells People that the actor’s decision to close the site is related to her filming schedule for Suits and her humanitarian work.\n\nApril 13, 2017\n\nHarry secretly flies to Toronto to spend Easter weekend with Meghan, according to photos obtained by E! News. The site reports that Harry arrived with a large duffel bag and sported a baseball hat to hide his face outside Meghan’s building.\n\nApril 14, 2017\n\nTMZ publishes photos of Meghan wearing a new ring on her left index finger while out in Toronto. The ring contains one important detail: the initial “H.”\n\nMay 7, 2017\n\nMeghan and Harry share their first public kiss following Harry’s participation in the annual Audi Polo Challenge in Ascot, England. The smooch happens outside the polo fields on a parking lot. That same weekend, Meghan is seen cheering on the prince from the sidelines in a stylish navy blue dress and white blazer combo.\n\nDAVID HARTLEY/REX/Shutterstock\n\nDAVID HARTLEY/REX/Shutterstock\n\nMay 20, 2017\n\nMeghan is Harry’s date at Pippa Middleton’s wedding reception, held at the Middletons’ $8 million estate in Bucklebury. According to E! News, Meghan’s absence from the ceremony was per royal protocol to ensure royals like Harry don’t upstage civilian events. Following the ceremony, Harry reportedly drove straight to Kensington Palace, where Meghan had been staying for a few days, to pick up his date. FYI, church door to palace, it’s about a three-hour round-trip drive, so it must be ~love~.\n\nJune 19, 2017\n\nDaily Mail reports that Harry has given Meghan a gold ring—for her thumb. According to one source, Harry gave the ring about six weeks ago and Meghan has “happily” informed people on the set of Suits that it indeed is from the royal and that it’s actually too big for her thumb. The ring is the latest piece of jewelry Harry has given his lady, joining a collection that includes a blue-and-white bracelet (which matches his own), a Cartier Love bracelet, a Maya Brenner necklace with the initials “M” and “H,” and a gold arrow ring.\n\nSeptember 5, 2017\n\nSpeaking to Vanity Fair in a rare interview, Meghan opens up about being “really happy and in love” with Harry. She also confirms that they met in July 2016 and managed to date under the radar for a few months before the press caught on.\n\n“I can tell you that at the end of the day, I think it’s really simple. We’re two people who are really happy and in love. We were very quietly dating for about six months before it became news, and I was working during that whole time, and the only thing that changed was people’s perception. Nothing about me changed. I’m still the same person that I am, and I’ve never defined myself by my relationship.”\n\nIn the same interview, Meghan also says “there will be a time” when they come forward and share more of their life together with the public, but for now, they want to keep things as private as possible. “This is for us. It’s part of what makes it so special, that it’s just ours. But we’re happy. Personally, I love a great love story.”\n\nCourtesy of Vanity Fair/Peter Lindbergh\n\nSeptember 24, 2017\n\nMeghan and Harry make their first public appearance together at an official royal event, except for one minor detail: They sit 18 seats apart due to royal protocol.\n\nGetty\n\nSeptember 25, 2017\n\nMeghan and Harry sit together at the Invictus Games. The pictures are everything.\n\nGetty\n\nNovember 27, 2017\n\nPrince Charles announces the engagement of Meghan and Harry, who will wed in spring 2018!\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nOn the news of Prince Harry and Ms. Meghan Markle's engagement, The Prince of Wales, speaking for himself and The Duchess of Cornwall, said: \"We're thrilled. We're both thrilled. We hope they'll be very happy indeed.\" — Clarence House (@ClarenceHouse) November 27, 2017\n\nIn a statement, Clarence House confirms that Harry proposed in London in early November after receiving a blessing from Meghan’s parents. The Queen and close members of the royal family were also informed.\n\nGetty\n\nHarry’s family along with Meghan’s parents release separate statements congratulating the couple on their engagement.\n\n\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nThe Duke and Duchess of Cambridge said of the engagement:\n\n'We are very excited for Harry and Meghan. It has been wonderful getting to\n\nknow Meghan and to see how happy she and Harry are together.' — The Prince and Princess of Wales (@KensingtonRoyal) November 27, 2017\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nThe Queen and The Duke of Edinburgh are delighted for the couple and wish them every happiness. https://t.co/aAJ23uSbao — The Royal Family (@RoyalFamily) November 27, 2017\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nMs. Markle's parents, Mr. Thomas Markle and Doria Ragland have wished the couple 'a lifetime of happiness.' pic.twitter.com/H4kpTgpkYE — The Prince and Princess of Wales (@KensingtonRoyal) November 27, 2017\n\nHarry and Meghan’s announcement also includes a brief meeting with press at Kensington Palace Gardens.\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nWATCH: Prince Harry and Meghan Markle make first public appearance since announcing their engagement (and we get a glimpse at the ring)! pic.twitter.com/0W2AlfXVDn — TODAY (@TODAYshow) November 27, 2017\n\nAccording to People, Harry proposed with a three-stone diamond ring he designed with British jeweler Cleave and Company. The center stone is from Botswana, while the two side stones are from Princess Diana’s personal collection.\n\nIn their first joint interview since announcing their engagement, Harry and Meghan reveal to the BBC’s Mishal Husain that the surprise proposal happened over a typical roast chicken dinner at their cottage.\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nDecember 20, 2017\n\nMeghan joins Harry and members of the royal family for Queen Elizabeth’s annual Christmas lunch at Buckingham Palace.\n\nGetty Images\n\nDecember 21, 2017\n\nMeghan and Harry release three official engagement photos taken by Alexi Lubomirski earlier in the week at Frogmore House, Windsor.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nDecember 25, 2017\n\nBreaking royal tradition, Meghan attends Christmas services with the royal family at St. Mary Magdalene Church in Sandringham.\n\nGetty Images\n\nUpon seeing Queen Elizabeth for the first time that day, Kate and Meghan curtsy while William and Harry bow as per royal etiquette. It’s Meghan’s first royal curtsy in public, FYI.\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nMeghan Markle demonstrates that she's mastered the royal curtsy! pic.twitter.com/VyQ3H6Eku6 — TODAY (@TODAYshow) December 25, 2017\n\nJanuary 1, 2018\n\nMeghan and Harry spend New Year’s in the French Riveria, according to Daily Mail. The couple reportedly traveled via British Airways, boarded the flight separately, and occupied three rows of economy seats with bodyguards in tow.\n\nJanuary 9, 2018\n\nMeghan and Harry make their second official public appearance as a couple together, this time with a visit to Brixton in south London for a meeting with members of Reprezent 107.3FM, a youth radio station.\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nPrince Harry and Ms. Meghan Markle arrive at POP Brixton to visit @ReprezentRadio 🎧 pic.twitter.com/NsxphnLDod — The Prince and Princess of Wales (@KensingtonRoyal) January 9, 2018\n\nJanuary 18, 2018\n\nDuring an official royal visit to a castle in Cardiff, Meghan and Harry are presented with a cake made entirely out of cheese.\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nA wedding cake made out of Welsh cheese for Harry and Meghan. pic.twitter.com/ZnEdelW0Xm — Richard Palmer (@RoyalReporter) January 18, 2018\n\nIt’s during the visit that Meghan breaks royal protocol, giving a 10-year-old fan a quick autograph. According to People, Meghan wrote “Hi Kaitlin” and added a heart and smiley face.\n\nGetty\n\nMarch 8, 2018\n\nPeople reports that Meghan was secretly baptized into the Church of England in a ceremony conducted by the Archbishop of Canterbury. The quiet ceremony, which took place at St. James’s Palace in London, was attended by a few members of the royal family, including Prince Harry and Charles. Queen Elizabeth II, the head of the Church of England, was not present.\n\nGetty\n\nMarch 12, 2018\n\nMeghan and Harry are spotted sharing a little laugh after Liam Payne’s performance during a Commonwealth Day celebration at Westminster Abbey. In this video, courtesy of The Telegraph’s Anita Singh, Meghan can be seen bursting into a laugh after Harry raises his eyebrows at the end of Liam’s song.\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nHarry and Meghan’s reaction to this Liam Payne performance is my favourite thing today pic.twitter.com/NyqN3YYXoH — Anita Singh (@anitathetweeter) March 12, 2018\n\nMarch 22, 2018\n\nPhotos of Meghan and Harry’s wedding invitations are released. Taken at the workshop of Barnard and Westwood in London, the photos confirm that Harry’s legal name, “Henry,” was printed on the invitations and that a lunch reception at St George’s will be held following the ceremony.\n\nVictoria Jones - WPA Pool/Getty Images\n\nMarch 23, 2018\n\nMeghan and Harry make a surprise appearance in Belfast and visit the Titanic Museum and an event at the Eikon Centre in Lisburn. For security reasons, the trip was kept secret.\n\nGetty\n\nApril 6, 2018\n\nMeghan and Harry step out for the Invictus Games tryouts for the U.K. team. Meghan’s long army green coat, the Lawson in Monterey by Babaton, is an immediate favorite among royal watchers.\n\nGetty\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nApril 21, 2018\n\nMeghan and Harry attend the Queen’s official birthday party at Royal Albert Hall.\n\nGetty\n\nGetty\n\nMay 14, 2018\n\nMeghan’s dad, Thomas Markle Sr.—previously confirmed as the one who would walk her down the aisle—pulls out of the wedding following reports that he had worked with paparazzi to stage and sell photos of himself reading a picture book on Great Britain. In addition, he tells TMZ he suffered a heart attack six days prior. Kensington Palace releases a brief statement on the matter: “This is a deeply personal moment for Ms. Markle in the days before her wedding. She and Prince Harry again ask for understanding and respect to be extended to Mr. Markle in this difficult time.”\n\nGetty\n\nMay 17, 2018\n\nMeghan releases a statement via Kensington Palace on her dad. “Sadly, my father will not be attending our wedding. I have always cared for my father and hope he can be given the space he needs to focus on his health.” In the statement, Meghan thanks “everyone who has offered generous messages of support.”\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nA statement from Ms. Meghan Markle: pic.twitter.com/TjBNarmuBU — The Prince and Princess of Wales (@KensingtonRoyal) May 17, 2018\n\nLater that day, Meghan and Harry are spotted heading to wedding rehearsals in Windsor, two days before their big day.\n\nGetty\n\nMay 18, 2018\n\nVia Kensington Palace, Meghan announces on the eve of her wedding that Prince Charles will be the one to walk her down the aisle. Charles says he “is pleased to be able to welcome Ms. Markle to The Royal Family in this way.”\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nAn update on the #RoyalWedding: pic.twitter.com/wfJ6ZFyzHi — The Prince and Princess of Wales (@KensingtonRoyal) May 18, 2018\n\nThe engaged couple are spotted one last time heading from Kensington Palace to Windsor Castle before Meghan and her mother arrive at Cliveden House Hotel, while Harry is spotted with his brother and best man, William, outside Windsor Castle greeting crowds. While walking into the hotel, Meghan tells reporters she feels “wonderful, thank you.”\n\nGetty\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nMs. Meghan Markle arrives at Cliveden House Hotel, accompanied by her mother Ms. Doria Ragland #RoyalWedding pic.twitter.com/SqOFhb0Wr5 — The Prince and Princess of Wales (@KensingtonRoyal) May 18, 2018\n\nGetty\n\nGetty\n\nGetty\n\nGetty\n\nMay 19, 2018\n\nMeghan and Harry are married! Meet the Duke and Duchess of Sussex:\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nThe congregation stands as the newly-married Duke and Duchess of Sussex process through St George's Chapel #RoyalWedding pic.twitter.com/gAD70k14U0 — The Prince and Princess of Wales (@KensingtonRoyal) May 19, 2018\n\nGetty\n\nGetty\n\nGetty\n\nGetty\n\nGetty\n\nGetty\n\nMay 21, 2018\n\nKensington Palace releases three official royal wedding portraits of the Duke and Duchess of Sussex.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nMay 22, 2018\n\nMeghan and Harry step out for their first official royal duty as the Duke and Duchess of Sussex. The occasion: Prince Charles’s 70th Birthday Patronage Celebration at Buckingham Palace Gardens.\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nVery funny moment as The Duke of Sussex, watched by his new bride, gets bombed by bumblebee as he gives a warm and witty speech to mark Prince Charles’s 70th birthday pic.twitter.com/HTOeZzIJmr — Rebecca English (@RE_DailyMail) May 22, 2018\n\nJune 9, 2018\n\nMeghan takes her place on the Buckingham Palace balcony for the very first time during the Trooping of the Colour celebrations.\n\nGetty\n\nAugust 16, 2018\n\nThe couple reportedly goes on a secret Italian getaway with George and Amal Clooney at their Lake Como villa. Apparently, Harry spends most of this time playing basketball while Meghan helps to look after the Clooneys’ twins, but these details (as well as the entire trip) are not officially confirmed by the palace.\n\nOctober 12, 2018\n\nMeghan and Harry attend Princess Eugenie’s wedding to Jack Brooksbank.\n\nGetty\n\nOctober 15, 2018\n\nOn the very same day as the start of the couple’s first-ever royal tour, Kensington Palace officially confirms that the Duke and Duchess of Sussex are expecting their first child. According to reports, they first broke the news to their family at Eugenie’s wedding on October 12.\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nTheir Royal Highnesses The Duke and Duchess of Sussex are very pleased to announce that The Duchess of Sussex is expecting a baby in the Spring of 2019. pic.twitter.com/Ut9C0RagLk — The Prince and Princess of Wales (@KensingtonRoyal) October 15, 2018\n\nNovember 24, 2018\n\nA royal source has leaked news that Harry and Meghan are moving out of Kensington Palace and into Frogmore Cottage on the Windsor Estate early next year. This news remains unconfirmed by the palace, but it doesn’t come as a surprise since the couple will soon need more room to raise their baby.\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nInstead the Queen has given them Frogmore Cottage in Windsor. It’s within the private Home Park and faces the beautiful grounds of Frogmore House. It’s where they had their private evening wedding party & where their gorgeous engagement pictures were shot. pic.twitter.com/uByYVm7pWC — Emily Andrews (@byEmilyAndrews) November 23, 2018\n\nMay 6, 2019\n\nMeghan gives birth to her and Harry’s first baby, Archie! Unlike Kate Middleton, Meghan opted out of giving birth in the Lindo Wing in a London Hospital and doing a “step out” right after giving birth. Two days later, they gave a quick interview and took a few pictures with Archie, which they then shared with the world.\n\nDOMINIC LIPINSKI Getty Images\n\nSeptember 29, 2019\n\nIn a matter of months, Archie already goes on a royal tour with his parents and meets Archbishop Desmond Tutu!\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nDecember 23, 2019\n\nMeghan and Harry’s Christmas card features Archie front and center, and a body-language expert suggested it shows that the couple wants to be seen as “cool, stylish, and rather different.”\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nMerry Christmas from Sussexes!\n\nPrince Harry and Duchess Meghan opted for an environmentally friendly e-card this year, sharing a new family portrait with friends, family, colleagues and charities (including all their patronages).\n\n\n\nPhoto taken by @Janina Gavankar, ©SussexRoyal. pic.twitter.com/caUaCuig4k — Omid Scobie (@scobie) December 23, 2019\n\nJanuary 8, 2020\n\nWelp! Meghan and Harry officially announce they’re stepping back from their royal duties.\n\n“After many months of reflection and internal discussions, we have chosen to make a transition this year in starting to carve out a progressive new role within this institution. We intend to step back as ‘senior’ members of the Royal Family and work to become financially independent while continuing to fully support Her Majesty the Queen. It is with your encouragement, particularly over the last few years, that we feel prepared to make this adjustment. We now plan to balance our time between the United Kingdom and North America, continuing to honour our duty to the Queen, the Commonwealth, and our patronages.”\n\nMarch 27, 2020\n\nShocking everyone, the Sussexes move from their new home on Vancouver Island to Los Angeles, where they can be closer to Meghan’s mom, friends, and their new team of agents and business managers.\n\nMarch 30, 2020\n\nMeghan and Harry sign out of the @SussexRoyal Instagram account forever as they move on to the next chapter of their lives. Although they won’t be active on that account anymore, they reassured their followers that “the work continues” and they “look forward to reconnecting.”\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nMay 6, 2020\n\nIt’s Archie’s 1st birthday! To celebrate, Harry records Meghan reading Duck! Rabbit! to Archie and it’s the most adorable thing ever. (You can check out the video right this way.)\n\nAugust 12, 2020\n\nThe Sussex fam buys a brand-new house in Santa Barbara!\n\n“The Duke and Duchess of Sussex moved into their family home in July of this year,” the couple’s rep told People. “They have settled into the quiet privacy of their community since their arrival and hope that this will be respected for their neighbors as well as for them as a family.”\n\nOctober 6, 2020\n\nIn honor of hosting a Time 100 talk, the Sussexes pose for a new portrait together.\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nPrince Harry and Duchess Meghan are hosting a @TIME #Time100Talks episode on improving the digital world and creating more compassionate communities online. “Engineering a Better World” will take place virtually on October 20 and is open to all: https://t.co/BSqfG5WBaG pic.twitter.com/wzvPGxUOz0 — Omid Scobie (@scobie) October 16, 2020\n\nNovember 25, 2020\n\nIn an essay for the New York Times, Meghan opens up about having a miscarriage over the summer.\n\n“It was a July morning that began as ordinarily as any other day: Make breakfast. Feed the dogs. Take vitamins. Find that missing sock. Pick up the rogue crayon that rolled under the table. Throw my hair in a ponytail before getting my son from his crib. After changing his diaper, I felt a sharp cramp. I dropped to the floor with him in my arms, humming a lullaby to keep us both calm, the cheerful tune a stark contrast to my sense that something was not right. I knew, as I clutched my firstborn child, that I was losing my second.”\n\n“We have learned that when people ask how any of us are doing, and when they really listen to the answer, with an open heart and mind, the load of grief often becomes lighter—for all of us,” she continued. “In being invited to share our pain, together we take the first steps toward healing.”\n\nRead her moving full essay here.\n\nDecember 4, 2020\n\nHarry and Meghan are spotted buying their first California Christmas tree! A family saw them out and about as they ran festive errands.\n\n“Meghan and Prince Harry came into my work today and we sold them their Christmas Tree,” @ImaJaaaaaames wrote in a since-deleted tweet, per People. “We had our lot empty when they got there—their agent promoted them a good time to come instead of us shutting it down. There was one family in there and their stoked little son ran through trees up to Harry and asked if he worked here, not knowing who that is.”\n\nDecember 24, 2020\n\nThe couple drops their holiday card!\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nFebruary 14, 2021\n\nHarry and Meghan announce they’re expecting a baby!\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nBaby news! “We can confirm that Archie is going to be a big brother,” says a spokesperson for Harry and Meghan. “The Duke and Duchess of Sussex are overjoyed to be expecting their second child.” pic.twitter.com/GrqSiBxaXa — Omid Scobie (@scobie) February 14, 2021\n\nFebruary 19, 2021\n\nThe Queen takes back Meghan Markle and Prince Harry’s royal patronages. The couple release a statement via their spokesperson, saying, “As evidenced by their work over the past year, the Duke and Duchess of Sussex remain committed to their duty and service to the UK and around the world and have offered their continued support to the organizations they have represented regardless of official role. We can all live a life of service. Service is universal.”\n\nMarch 7, 2021\n\nMeghan Markle and Prince Harry sit down for a two-hour tell-all interview with Oprah, where they open up about everything from their decision to step back from royal duties, the racism and bullying Meghan experienced living in England, and their life in California:\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nMay 6, 2021\n\nThe Sussexes celebrate Archie’s birthday with a cute new pic:\n\nCOURTESY THE DUKE AND DUCHESS OF SUSSEX\n\nJune 4, 2021\n\nMeghan and Harry welcome their baby daughter, Lilibet Diana! They announce the news on their Archewell website:\n\n“It is with great joy that Prince Harry and Meghan, the Duke and Duchess of Sussex, welcome their daughter, Lilibet ‘Lili’ Diana Mountbatten-Windsor, to the world. Lili was born on Friday, June 4, at 11:40 a.m. in the trusted care of the doctors and staff at Santa Barbara Cottage Hospital in Santa Barbara, CA. She weighed 7 lbs 11 oz. Both mother and child are healthy and well and settling in at home. Lili is named after her great-grandmother, Her Majesty the Queen, whose family nickname is Lilibet. Her middle name, Diana, was chosen to honor her beloved late grandmother, the Princess of Wales. This is the second child for the couple, who also have a 2-year-old son named Archie Harrison Mountbatten-Windsor. The Duke and Duchess thank you for your warm wishes and prayers as they enjoy this special time as a family.”\n\nSeptember 15, 2021\n\nThe couple is part of Time’s Most Influential People roundup of 2021!\n\nThis content is imported from Instagram. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nNovember 11, 2021\n\nMeghan and Harry make a return to the red carpet at the 2021 Salute to Freedom Gala in New York City, looking AMAZING:\n\nGetty Images\n\nNovember 20, 2021\n\nMeghan opens up about Archie and Lili to Ellen DeGeneres, saying, “I think it’s just, everyone tells you—well, someone told H and I: ‘When you have one kid, it’s a hobby, and two children is parenting. Suddenly we realized, ‘Oh, right.’ Everyone talks about what it’s like for the second child, but no one talks about the adjustment for the first child when the second one comes along. So I think they have this moment of, ‘Oh, this is fun. Oh, this how it is now.’”\n\nThis content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nDecember 23, 2021\n\nMeghan and Harry reveal the very first photo of Lili in an adorable family Christmas portrait.\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nWe're grateful to Archewell Foundation and Prince Harry and Meghan, The Duke and Duchess of Sussex for their support of our efforts to welcome Afghan families to the US. This generous donation will help the transition of families into new communities. https://t.co/vBKyU92YoF pic.twitter.com/H0DqCvJuZd — Team Rubicon (@TeamRubicon) December 23, 2021\n\nApril 14, 2022\n\nMeghan and Harry make a secret trip to visit the Queen!\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\n𝐁𝐑𝐄𝐀𝐊𝐈𝐍𝐆: A Sussex spokesperson confirms that, prior to arriving in The Hague for @InvictusGamesNL, Prince Harry and Duchess Meghan stopped in the UK this morning to visit the Queen. It was a Windsor visit that their team recently revealed the duke \"hoped to do\". — Omid Scobie (@scobie) April 14, 2022\n\nApril 16, 2022\n\nMeghan and Harry appear at the Invictus Games opening ceremony and have the sweetest moment onstage:\n\nGetty Images\n\nJune 3, 2022\n\nThe Sussexes reunite with the royal family for their first official event in years:\n\nGetty Images\n\nJune 6, 2022\n\nAmid celebrating Lilibet’s birthday in England, Meghan and Harry share a brand-new super-sweet photo of her:\n\nThis content is imported from Twitter. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n\nFor Lilibet’s first birthday, Prince Harry and Duchess Meghan invited close friends and family for an \"intimate backyard picnic\" at Frogmore Cottage, Windsor on Saturday. Claire Ptak (who made the couple's 2018 wedding cake) baked a special order for the party.\n\n\n\n📷 @misanharriman pic.twitter.com/gXFM0l3FIT — Omid Scobie (@scobie) June 6, 2022\n\nAnd that brings us up to date! Stay tuned for more developments in Harry and Meghan’s love story.\n\nThis content is imported from {embed-name}. You may be able to find the same content in another format, or you may be able to find more information, at their web site.", "images": ["https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/prince-harry-duke-of-sussex-and-meghan-duchess-of-sussex-news-photo-1654695834.jpg?crop=1.00xw:0.692xh;0.00170xw,0.0845xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7", "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/gettyimages-884683060-1578927926.jpg?crop=0.956xw:0.355xh;0.0204xw,0.0405xh&resize=300:*"], "top_img": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/prince-harry-duke-of-sussex-and-meghan-duchess-of-sussex-news-photo-1654695834.jpg?crop=1.00xw:0.692xh;0.00170xw,0.0845xh&resize=1200:*", "keywords": [], "authors": ["Peggy Truong", "Shannon Barbour", "Entertainment Writer", "Peggy Is Cosmopolitan.Com S Entertainment Writer", "Specializing In Leonardo Dicaprio", "This Is Us", "The Royals.", "News Writer", "Shannon Is A News Writer At Cosmopolitan.Com", "When She'S Not Obsessing About Cardi B"], "canonical_link": "https://www.cosmopolitan.com/entertainment/celebs/a8673228/prince-harry-meghan-markle-dating-timeline/", "title": "Prince Harry and Meghan Markle Dating Timeline", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=6", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "Behold: A Definitive Timeline of Prince Harry and Meghan Markle’s Entire Relationship", "description": "This royal love story is a good one.", "url": "https://www.cosmopolitan.com/entertainment/celebs/a8673228/prince-harry-meghan-markle-dating-timeline/", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/prince-harry-duke-of-sussex-and-meghan-duchess-of-sussex-news-photo-1654695834.jpg?crop=1.00xw:0.692xh;0.00170xw,0.0845xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 162305873819997, "pages": 8358247707}, "article": {"publisher": "https://facebook.com/Cosmopolitan", "modified_time": "2022-06-15T00:16:53Z", "published_time": "2022-06-08T20:16:00Z", "section": "Celebs", "opinion": "false"}, "twitter": {"site": "@Cosmopolitan", "card": "summary_large_image", "image": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/prince-harry-duke-of-sussex-and-meghan-duchess-of-sussex-news-photo-1654695834.jpg?crop=1.00xw:0.692xh;0.00170xw,0.0845xh&resize=640:*"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "title": "Prince Harry and Meghan Markle Dating Timeline - How Did Meghan Meet Harry", "description": "From their first meeting to their engagement, wedding, and kids, here is everything to know about Prince Harry and Meghan Markle's relationship and marriage.", "keywords": "meghan markle, prince harry, timeline, meghan markle engaged, prince harry engaged, meghan markle prince harry dating timeline, meghan markle prince harry engagement announcement, prince harry meghan markle relationship", "auto-publish": "never", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/prince-harry-duke-of-sussex-and-meghan-duchess-of-sussex-news-photo-1654695834.jpg?crop=0.726xw:1.00xh;0.138xw,0&resize=320:*", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebrities & Entertainment,entertainment,celebs", "sailthru.date": "2022-06-08T20:16:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/prince-harry-duke-of-sussex-and-meghan-duchess-of-sussex-news-photo-1654695834.jpg?crop=1.00xw:0.692xh;0.00170xw,0.0845xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/prince-harry-duke-of-sussex-and-meghan-duchess-of-sussex-news-photo-1654695834.jpg?crop=0.726xw:1.00xh;0.138xw,0", "sailthru.socialtitle": "Behold: A Definitive Timeline of Prince Harry and Meghan Markle’s Entire Relationship", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1654719360.0, "source": "https://www.cosmopolitan.com", "summary": ""}