{"url": "https://en.wikipedia.org/wiki/Tiffany_Pollard", "text": "American television personality (born 1982)\n\nTiffany Pollard (born January 6, 1982)[1] is an American television personality. She came to public prominence for her participation on the first two seasons of VH1's Flavor of Love (2006–2007). Pollard was given the nickname \"New York\" by rapper Flavor Flav. She is also known colloquially by her self-proclaimed nickname \"HBIC\" (\"Head Bitch in Charge\"), which she exclaimed in the Flavor of Love series to taunt her competitors.[2] Her temperamental nature often led to tension with the other women on the show.\n\nPollard starred in the show's spin-off I Love New York (2007–2008). In recent years, Pollard took part in the 17th series of Celebrity Big Brother in early 2016, finishing in fourth place. In 2017, Pollard began hosting Brunch with Tiffany, a talk show series featured on VH1's YouTube channel, which was later picked up debuting on the VH1 television network. In 2022, Pollard began hosting Hot Haus, a queer sex reality competition on OutTV.[3] She has also twice previously hosted the Fenty Beauty holiday gift guide.[4][5]\n\nTelevision appearances [ edit ]\n\nPollard first achieved public prominence for starring on hit shows with among the largest audiences seen on basic television, VH1's Flavor of Love (2006–2007) and I Love New York (2007–2008).[6] Over 7.5 million people watched Pollard during the Flavor of Love season 2 finale.[6]\n\n2006: Breakout with Flavor of Love [ edit ]\n\nFlavor of Love [ edit ]\n\nPollard (then age 23) clashed with virtually all the other contestants. Although these feuds were, in general, nothing more than screaming matches, an incident in the penultimate episode of season one led to violence. After her elimination, an outraged Brooke \"Pumkin\" Thompson spat on Pollard after the two had exchanged words.[7] Of all the women on the show Pollard had the most tension with Thompson all throughout the show. Pollard vowed to \"whoop Pumkin's ass\", and attempted to do so at the season one reunion.[8] The moment was rated number one on various VH1 and MTV reality show specials, including VH1's 20 Greatest Celebreality Fights.[citation needed] The final two contestants journeyed to Puerto Vallarta, Mexico, where Flavor Flav chose Nicole \"Hoopz\" Alexander over Pollard, to be his mate.[9]\n\nFlavor of Love 2 [ edit ]\n\nAfter his relationship did not work out with Alexander, Flavor Flav chose to do a second season of his dating show and invited Pollard (then age 24) to help him eliminate contestants halfway through the season. She agreed and was later added as a participant.[10] In the finale, Flav chose Deelishis over Pollard.[11] Pollard verbally fought with Flav in the season finale, asking why he had brought her back only to be ultimately eliminated.[12]\n\nVH1 spinoffs [ edit ]\n\nI Love New York [ edit ]\n\nI Love New York was Pollard's first reality television series on VH1. The series is a spin-off of another relationship competition series, the Flavor of Love, which featured Pollard as a finalist in two consecutive seasons. In July 2006, VH1 published a casting call for contestants for a new series tentatively titled The Flavorette. Various blogs speculated that the star of this program could be Flavor of Love season 1 contestant Rain, Hoopz (Nicole Alexander) or Pollard. Before the season 2 Flavor of Love finale, Pollard denied having her own show but after the finale aired, she confirmed she was the \"Flavorette\" and that she was already down to the final three contestants. The show premiered on Monday, January 8, 2007, and was the most-watched series debut in VH1 history with 4.426 million viewers.[13] Its season 1 finale brought in 4.8M million viewers and its reunion show ratings held 5.01 million viewers. Spin-offs from the series include I Love Money, New York Goes to Hollywood, Real Chance of Love, New York Goes to Work, and Frank the Entertainer in a Basement Affair.\n\nI Love New York 2 [ edit ]\n\nI Love New York 2 premiered October 8, 2007 on VH1.[14] In the finale of I Love New York 2, contestant \"Tailor Made\" (real name George Weisgerber) proposed to Pollard, but was turned down. The finale earned 5.4 million viewers. During the I Love New York 2 reunion special, Tailor Made proposed a second time and Pollard accepted. The reunion special earned 4.86 million viewers.[15][16]\n\nNew York Goes to Hollywood [ edit ]\n\nNew York Goes to Hollywood premiered August 4, 2008 on VH1. The eight-episode season follows Pollard as she tries to establish herself as an actress in Hollywood, California.\n\nNew York Goes to Work [ edit ]\n\nNew York Goes to Work premiered on May 4, 2009. The reality show followed Pollard as she searches for a regular job.[17] The jobs were selected by fans (via text messaging) from a list of three possible jobs for each episode. Pollard would receive a $10,000 bonus each week if she were able to impress her employer. However, if she quit, failed, or was fired, she would not receive a bonus for the week. Pollard won $45,000 over the series, and earned bonuses in four jobs (in episodes 1, 2, 5, and 6); she lost, failed in, or quit four jobs (in episodes 3, 4, 7, and 8); and come to a draw in the season finale. At the end of the series, a mobile poll was presented giving three choices for New York's next task, and the most votes were cast for I Love New York 3.\n\nI Love New York 3 [ edit ]\n\nProduction for I Love New York 3 was set to kick off sometime in the first quarter of 2010; however, prior to that time frame, VH1 requested immediate cancellation of the \"celebreality\" franchise and shelved plans for I Love New York 3. In the summer of 2011, Pollard hinted that I Love New York 3 was cancelled due to the murder-suicide case of Ryan Jenkins, who was a former contestant of Megan Wants a Millionaire.[18]\n\nBrunch with Tiffany [ edit ]\n\nIn 2020, Pollard's VH1 digital series Brunch with Tiffany, was picked up by VH1. The show was previously in production since 2017. The series \"follows Pollard as she gathers around the tables of the hottest restaurants with her famous friends for free-flowing conversations and cocktails.\" The pilot episode premiered September 7 and featured Cyn Santana and Fizz.[19][20]\n\nOther appearances [ edit ]\n\nOn April 14, 2015, Pollard appeared on an episode of the E! Network's series, Botched, where she detailed her botched surgeries that have left her breasts sagging with extra skin. She appeared on the show in hopes of getting them corrected, so she could resume her reality TV career.[21][22][23] In 2016, Pollard entered the Celebrity Big Brother house in the United Kingdom to participate in the show's 17th season. She was involved in an infamous misunderstanding in which Pollard believed that David Gest had died of cancer inside the house; it subsequently turned out the deceased was David Bowie, the ex-husband of Pollard's fellow housemate Angie Bowie.[citation needed] Throughout her time on the show, Pollard proved popular with the British public and achieved the most votes to save her over her fellow contestants on at least one occasion. On February 5, Pollard made the final and came in fourth place, ranking higher than any other American female who had been on the show.[24] Due to her popularity on the show, Pollard appeared in many UK publications including New! magazine. She also became a regular fixture on the Big Brother spin off show Big Brother's Bit on the Side, during Big Brother 17 (UK). In 2016, Pollard was a main cast member on TV One's The Next :15.[25] Pollard was also a cast member on the first season of Family Therapy with Dr. Jenn.\n\nIn 2017, Pollard's VH1 digital series Brunch with Tiffany premiered. The series follows Pollard as she informally interviews a celebrity guest over brunch. The pilot featured The Real Housewives of New York star Sonja Morgan.[26] That same year Pollard participated in VH1's Scared Famous.[27] Later that year she was a cast member on Famously Single. In 2018, she reunited with Flavor Flav on Braxton Family Values. She also appeared on Hip Hop Squares. In 2019, Pollard was a guest judge on RuPaul's Drag Race season 11.[28] The same year, she returned to Botched because of complications from a breast implant surgery.[29] The same year Pollard also appeared on Action Bronson's show Traveling the Stars: Action Bronson and Friends Watch Ancient Aliens. In 2020, she took part in the eleventh season of Celebrity Ex on the Beach, as the ex of David McIntosh.[30] In 2021, Pollard was a cast member on The TS Madison Experience. In 2022, Pollard began hosting Hot Haus, a queer sex reality competition OutTV.\n\nActing roles [ edit ]\n\nPollard's first film role was in the comedy First Sunday (2008). She appeared in a supporting role, acting alongside Ice Cube, Regina Hall, and C. J. Sanders.\n\nPollard participated in a 2009 national tour of the Vagina Monologues with an all-black cast, most of whom are also former reality show contestants.[31] Pollard also appeared in a play called The Clean Up Woman in 2009, and in The Trial of the Chicago 7 in 2010.\n\nBusiness ventures [ edit ]\n\nIn November 2021, Pollard launched a limited edition nail polish lacquer line entitled HBIC Ink.[32]\n\nImpact and legacy [ edit ]\n\nDoreen St. Félix of The New Yorker referred to Pollard's Flavor of Love season one performance as \"one of the most memorable [...] on reality television.\"[33] In May 2018, a Brooklyn museum called THINK 1994 hosted an exhibit called \"David's Dead: A Celebration of Tiffany Pollard\" focused on an incident on Big Brother UK when Pollard mistakenly told the house that fellow housemate David Gest had died, and the chaos that ensued when she told other housemates the news.[34]\n\nPollard has been referred to as the \"queen of reaction memes\" due to the number of gifs used of her on social media.[35][36][37] A notable example is of Pollard exclaiming \"Beyoncé!?\".[38] This moment has even been featured by Beyoncé on tour as the intro to \"Sorry\".[39]\n\nPersonal life [ edit ]\n\nPollard was born in Utica, New York to Michelle Rothschild-Patterson (also known as \"Sister Patterson\") and Alex Pollard.[40] Pollard has used the surnames of both her parents, who are unmarried.[41] She attended John F. Kennedy Middle School and graduated from Thomas R. Proctor High School.[42]\n\nPollard was engaged to the I Love New York season 1 winner Patrick \"Tango\" Hunter for a six-month period until Hunter called off the engagement on the reunion show.[43] She was also engaged to George \"Tailor Made\" Weisgerber, the winner of I Love New York 2. She announced on episode 6 of her show, New York Goes to Hollywood, that she had officially separated from Weisgerber.[44]\n\nPollard suffered a miscarriage of her child after she dealt with significant stress from her mother who was strongly chastised by psychologist Jenn Mann on Family Therapy with Dr. Jenn for refusing to believe Pollard was pregnant.[45]\n\nIn an episode of Brunch with Tiffany, Pollard revealed that she has bipolar disorder.[46]\n\nIn 2019, Pollard decided to remove her breast implants. The procedure was documented on the reality television series Botched.[47]\n\nOn November 23, 2020, during the I Love New York: Reunited special, Pollard announced her third engagement.[48] As of 2021 , Pollard's fiancé remains a mystery. It was later revealed that her fiancé was one Jimmy Stewart.[49]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nYear Title Role Notes 2008 First Sunday Omunique's Client 2014 The Shop Kiana\n\nTelevision [ edit ]\n\nTheater [ edit ]\n\nWeb [ edit ]\n\nYear Title Notes 2017–2019 Brunch with Tiffany Host; on VH1's YouTube channel for three seasons[1] October 16, 2019 People TV \"Tiffany Pollard Takes Us Behind the Scenes of Her Greatest 'HBIC' Moments\"\n\nAwards and nominations [ edit ]\n\nYear Result Award Category Recipient 2006 Won Fox Reality Awards Favorite Fight Flavor of Love 2006 Won Fox Reality Awards Favorite Villain Flavor of Love 2007 Nominated Fox Reality Awards Most Memorable Reality Performer Flavor of Love, Flavor of Love 2, and I Love New York 2020 Nominated 12th Annual Shorty Awards Video Brunch with Tiffany[52]", "images": ["https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Tiffany_Pollard_for_wiki.png/1200px-Tiffany_Pollard_for_wiki.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Tiffany_Pollard_for_wiki.png/220px-Tiffany_Pollard_for_wiki.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Tiffany_Pollard_for_wiki.png/1200px-Tiffany_Pollard_for_wiki.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Tiffany_Pollard", "title": "Tiffany Pollard", "meta_data": {"generator": "MediaWiki 1.40.0-wmf.3", "referrer": "origin-when-cross-origin", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/Tiffany_Pollard_for_wiki.png/640px-Tiffany_Pollard_for_wiki.png", "width": 640, "height": 865}, "title": "Tiffany Pollard - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}