{"url": "https://www.cbssports.com/wwe/news/ronda-rousey-appears-at-royal-rumble-after-signing-full-time-contract-with-wwe/", "text": "WWE is about to get even more \"Rowdy.\"\n\nRonda Rousey made her WWE debut late Sunday night to close the 2018 Royal Rumble, and it was announced just moments after the show went off the air that the former UFC bantamweight champion has indeed signed a full-time contract with WWE.\n\n\"This is my life now. First priority on my timeline for the next several years. This is not a smash-and-grab; this is not a publicity stunt,\" Rousey told ESPN's Ramona Shelburne in a story that broke immediately after the show. \"When I first met with Triple H, I told him, 'There are other things I can do with my time that'll make way more money, but I won't enjoy nearly as much.'\n\n\"And I don't think that trying to make as much money as possible every single day is the best thing for my happiness. I want to wrestle, and I want to be part of this company, and I want the people that love this sport to accept me and respect me as being part of the sport. I know that'll take time, but I also know that I'm capable of anything.\"\n\nRousey added: \"It's funny -- it's kind of like acting, in that it was something I always wanted to do but I never thought was in the cards for me. And now that I realize I really do have this opportunity, I feel like my 6-year-old self would totally kick my ass if I didn't take it.\"\n\nAfter the first 30-Woman Royal Rumble was won by Asuka, WWE's women's champions Alexa Bliss (Raw) and Charlotte Flair (SmackDown) made their way into the ring with Asuka looking back and forth between the two as they held their championships high. At that moment, \"Bad Reputation\" hit and Rousey made her way to the ring. Rousey immediately pointed at the WrestleMania sign and went to shake Asuka's hand only for Asuka to slap it away. She again pointed at the sign and left the ring, heading to ringside to shake the hand of WWE COO (and storyline Raw commissioner) Stephanie McMahon before smiling, waving to the crowd, hitting some fans' hands and leaving.\n\nA long-time WWE fan, Rousey borrowed her \"Rowdy\" nickname from Roddy Piper with the legend's permission and formed her own mixed martial arts version of the \"Four Hoursewomen\" promoting her relationship with Shayna Baszler, Jessamyn Duke and Marina Shafir. (Baszler is now a full-time wrestler in WWE's NXT developmental program.)\n\nRousey's last in-ring moment in WWE drew a massive reaction as she crashied WrestleMania 31 to aid The Rock in a confrontation with Triple H and McMahon, hip tossing Triple H before grabbing hold of McMahon's arm. Since then, Rousey and WWE have been somewhat inseparable even as she continued working in MMA.\n\nShe has attended multiple WWE events over the years, including the recent Mae Young Classic as she sat in the crowd cheering on Baszler. Rousey, along with Duke and Shafir, egged on WWE's version of the \"Four Horsewomen\" -- Flair, Sasha Banks, Becky Lynch and Bayley -- across the entrance ramp, and WWE even released a video of a confrontation between the groups in the parking lot. (Shafir is the wife of NXT superstar Roderick Strong, so she is already somewhat involved in the world of WWE.)\n\nRousey has been visible in the WWE product as of late, but five months after that WrestleMania 31 appearance, she was still competing in MMA and defeated Bethe Correia via knockout at UFC 190. Three months after that, she suffered her first defeat to Holly Holm in stunning fashion at UFC 193, and one year later, her MMA career basically ended when Amanda Nunes embarrassed her in 48 seconds at UFC 207.\n\nRousey, who began her MMA career with a 12-0 record and defeated five consecutive women in under 66 seconds while defending her title from 2013-15, now appears to have moved on from the sport for good.\n\nIt has not been much of a secret that Rousey has spent the past few months training for a foray into professional wrestling, but now we know for sure that it is her profession of choice. While Rousey could theoretically fight before WrestleMania 34 in April, it seems as if her first match will come on WWE's biggest stage of the year.\n\nEither way, she's excited for the opportunity and to take part in something athletic where the pressure is somewhat off her shoulders with a focus more on her character.\n\n\"It's cool to be in a venue where everything is not taken so literally -- that you can say the things that are on your mind, that you would never say ... like, 'What do you mean, I was just in character!' It's freeing, because there's not so much criticism -- because people know it is all for fun, and it is entertainment,\" she told ESPN.\n\n\"They're not judging you; they're like, 'You're a great heel!' It seems like a safer place to express myself, in a weird way.\"", "images": ["https://sportshub.cbsistatic.com/i/r/2022/09/16/9ad29a10-2745-4604-af5b-d8b8908bb28c/thumbnail/140x140/bfad6ac521aac1186a18511d7d3a5307/logan-paul-wwe-ustasi.png", "https://sportshub.cbsistatic.com/i/r/2018/01/29/f2c4591d-aab5-4bd4-a5ac-f6d4b303cc1c/thumbnail/1200x675/d50f62003f458d5a3045ab67b8b3c543/ronda-rousey-wwe-royal-rumble.jpg", "https://sportshub.cbsistatic.com/i/r/2022/09/07/8a20f08c-27ca-4fad-9d5e-1b7d3ffa295f/thumbnail/140x140/2df1d62f5ce602de6ef588f4fd8ce166/shawn-michaels-wwe.jpg", "https://sportshub.cbsistatic.com/i/r/2020/08/24/bc7e3fae-6d3a-47cb-8dde-23ffd2538be9/thumbnail/140x140/5a7efb59161ab24283c5002617e4c6aa/roman-reigns-summerslam-wwe.jpg", "https://sportshub.cbsistatic.com/i/r/2018/03/28/25ceeedc-0642-4098-9b6f-01488ccf53c8/thumbnail/140x140/95d333c772c8ba456ca126679c7ffc47/usatsi-10492226-1.jpg", "https://sportshub.cbsistatic.com/i/r/2022/08/26/49ddd3ec-d357-4af3-93cb-aba3cce11cdc/thumbnail/140x140/31e00eaeff2323fdcdbcdd03bd26b6b7/theory-john-cena.jpg", "https://sportshub.cbsistatic.com/i/r/2018/04/08/f6dbc241-424d-4810-b0a0-bed1e6666d19/thumbnail/140x140/900049015d46229301cfad48862fffd0/black.jpg", "https://sportshub.cbsistatic.com/i/r/2018/04/06/df4cce75-b8ba-43f1-910a-1f95b42a874b/thumbnail/140x140/e7118b73e029703240fed2424700a94b/rousey.jpg", "https://sportshub.cbsistatic.com/i/r/2022/09/27/c8b663fc-149b-4de7-bfa7-a0b6ee47002b/thumbnail/140x140/2dd406bddff5ea1db0370dded88ee148/gettyimages-524262072-2.jpg", "https://sportshub.cbsistatic.com/i/r/2022/10/06/a3e50363-7e73-4fd0-9eb0-b624d0e90b60/thumbnail/140x140/4025a06f72f1f490cdb12c2c20e113f3/bayley-bianca-belair-raw.jpg", "https://sportshub.cbsistatic.com/i/r/2018/01/29/f2c4591d-aab5-4bd4-a5ac-f6d4b303cc1c/thumbnail/140x140/fa8844b54ddfaa391425e144d7b13494/ronda-rousey-wwe-royal-rumble.jpg"], "top_img": "https://sportshub.cbsistatic.com/i/r/2018/01/29/f2c4591d-aab5-4bd4-a5ac-f6d4b303cc1c/thumbnail/1200x675/d50f62003f458d5a3045ab67b8b3c543/ronda-rousey-wwe-royal-rumble.jpg", "keywords": [], "authors": ["Adam Silverstein", "Min Read", "Brent Brookhouse", "Austin Nivison", "Shakiel Mahjouri", "Brian Campbell", "Pete Blackburn"], "canonical_link": "https://www.cbssports.com/wwe/news/ronda-rousey-appears-at-royal-rumble-after-signing-full-time-contract-with-wwe/", "title": "Ronda Rousey appears at Royal Rumble after signing full-time contract with WWE", "meta_data": {"google": "notranslate", "description": "Rousey will be a permanent fixture of WWE going forward after making her debut Sunday night", "og": {"site_name": "CBSSports.com", "title": "Ronda Rousey appears at Royal Rumble after signing full-time contract with WWE", "description": "Rousey will be a permanent fixture of WWE going forward after making her debut Sunday night", "image": "https://sportshub.cbsistatic.com/i/r/2018/01/29/f2c4591d-aab5-4bd4-a5ac-f6d4b303cc1c/thumbnail/1200x675/d50f62003f458d5a3045ab67b8b3c543/ronda-rousey-wwe-royal-rumble.jpg", "type": "article", "url": "https://www.cbssports.com/wwe/news/ronda-rousey-appears-at-royal-rumble-after-signing-full-time-contract-with-wwe/"}, "article": {"opinion": "false", "content_tier": "free", "publisher": "https://www.facebook.com/cbssports"}, "fb": {"pages": 25902406772, "app_id": 297742330311988, "admins": 100002967552623}, "twitter": {"account_id": 14885860, "card": "summary_large_image", "site": "@cbssports", "creator": "@SilversteinAdam", "title": "Ronda Rousey appears at Royal Rumble after signing full-time contract with WWE - CBSSports.com", "description": "Rousey will be a permanent fixture of WWE going forward after making her debut Sunday night", "image": "https://sportshub.cbsistatic.com/i/r/2018/01/29/f2c4591d-aab5-4bd4-a5ac-f6d4b303cc1c/thumbnail/1200x675/d50f62003f458d5a3045ab67b8b3c543/ronda-rousey-wwe-royal-rumble.jpg"}, "msapplication-tooltip": "CBSSports.com features live scoring and news for NFL football, MLB baseball, NBA basketball, NHL hockey, college basketball and football. CBSSports.com is also your source for fantasy sports news.", "msapplication-starturl": "https://www.cbssports.com/", "msapplication-window": "width=1024;height=768", "msapplication-navbutton-color": "#1483b2", "google-site-verification": "EdjXVFTZ6BgUzS3Void8cMiXXzE6bXDvNg-Yjl3VZj8", "viewport": "width=device-width, maximum-scale=1"}, "movies": [], "publish_date": null, "source": "https://www.cbssports.com", "summary": ""}