{"url": "https://www.hollywoodreporter.com/news/george-takei-accused-sexually-assaulting-model-1981-1056698", "text": "A former model and actor is accusing Star Trek icon George Takei of sexual assault in 1981. The accuser, Scott R. Brunton, who was 23 at the time of the alleged incident, claims that Takei took advantage of him when he was most vulnerable.\n\n“This happened a long time ago, but I have never forgotten it,” Brunton tells The Hollywood Reporter in an interview. “It is one of those stories you tell with a group of people when people are recounting bizarre instances in their lives, this always comes up. I have been telling it for years, but I am suddenly very nervous telling it.”\n\nBrunton says he was living in Hollywood in 1981, working as a waiter and beginning a career as a commercial actor and model when he met a 43- or 44-year-old Takei one evening at Greg’s Blue Dot bar. The men exchanged numbers and would call one another from time to time as well as run into each other at clubs, Brunton says. When Brunton broke up with his then-boyfriend, he spoke with Takei. “He said, ‘Let me know what your new number is’ and I did. And not long after we broke up and I moved out, George called me,” Brunton recalls.\n\nTakei, as Brunton tells it, invited him to dinner and the theater. “He was very good at consoling me and understanding that I was upset and still in love with my boyfriend,” Brunton says. “He was a great ear. He was very good about me spilling my heart on my sleeve.”\n\nThe two men went back to the actor’s condo for a drink the same night. “We have the drink and he asks if I would like another,” Brunton recalls. “And I said sure. So, I have the second one, and then all of a sudden, I begin feeling very disoriented and dizzy, and I thought I was going to pass out. I said I need to sit down and he said sit over here and he had the giant yellow beanbag chair. So I sat down in that and leaned my head back and I must have passed out.”\n\n“The next thing I remember I was coming to and he had my pants down around my ankles and he was groping my crotch and trying to get my underwear off and feeling me up at the same time, trying to get his hands down my underwear,” Brunton says. “I came to and said, ‘What are you doing?!’ I said, ‘I don’t want to do this.’ He goes, ‘You need to relax. I am just trying to make you comfortable. Get comfortable.’ And I said, ‘No. I don’t want to do this.’ And I pushed him off and he said, ‘OK, fine.’ And I said I am going to go and he said, ‘If you feel you must. You’re in no condition to drive.’ I said, ‘I don’t care I want to go.’ So I managed to get my pants up and compose myself and I was just shocked. I walked out and went to my car until I felt well enough to drive home, and that was that.”\n\nTHR spoke to four longtime friends of Brunton — Norah Roadman, Rob Donovan, Stephen Blackshear and Jan Steward — who said that he had confided in them about the Takei encounter years ago.\n\nTakei’s rep, Julia Buchwald, told THR, “George is traveling in Japan and Australia and not reachable for comment.” Takei, now 80, rose to fame playing Hikaru Sulu on the original Star Trek television series. He is also an author and activist and has been an outspoken advocate for LGBTQ rights.\n\nIn a series of tweets and in a Facebook post Saturday morning, Takei denied the allegations.\n\n“The events he describes back in the 1980s simply did not occur, and I do not know why he has claimed them now. I have wracked my brain to ask if I remember Mr. Brunton, and I cannot say I do,” he said. “Right now it is a he said / he said situation, over alleged events nearly 40 years ago. But those that know me understand that non-consensual acts are so antithetical to my values and my practices, the very idea that someone would accuse me of this is quite personally painful.”\n\nBrunton claims that he met up with Takei years after the incident in Portland, Brunton’s current home, while the actor was there on a book tour. “I wanted to see him,” Brunton says. “I always wanted to ask him — I just felt really betrayed. I thought I was a friend and here I am later, just another piece of meat. So I called him up at the hotel — I figured out which hotel he was at — and he said ‘Hi, Scott. I remember you.’ I wanted to ask him why. We met for coffee, and I just couldn’t bring myself to do it. It was just too uncomfortable.”\n\nBrunton says he considered going to the media with the story for years, but he assumed no one would take him seriously. “Who’s going to believe me? It’s my word against his,” he says.\n\nBrunton’s reasoning changed after the Harvey Weinstein scandal, and specifically when Takei spoke out regarding allegations leveled against Kevin Spacey.\n\nOn Oct. 29, Anthony Rapp, an actor starring in the latest Star Trek series, claimed to BuzzFeed News that Spacey sexually assaulted him while he was a minor in 1986. Spacey later apologized and came out as gay in response. “When power is used in a non-consensual situation, it is a wrong,” Takei said of the Spacey claim in a statement to THR on Oct. 30. “For Anthony Rapp, he has had to live with the memory of this experience of decades ago. For Kevin Spacey, who claims not to remember the incident, he was the older, dominant one who had his way. Men who improperly harass or assault do not do so because they are gay or straight — that is a deflection. They do so because they have the power, and they chose to abuse it.”\n\nBrunton says he found Takei’s response infuriating. “I don’t want anything from him but an apology,” he says. “I am sure he’ll disown all this, I don’t know, maybe not.”\n\nFriends, I’m writing to respond to the accusations made by Scott R. Bruton. I want to assure you all that I am as shocked and bewildered at these claims as you must feel reading them. /1 — George Takei (@GeorgeTakei) November 11, 2017\n\nThe events he describes back in the 1980s simply did not occur, and I do not know why he has claimed them now. I have wracked my brain to ask if I remember Mr. Brunton, and I cannot say I do. /2 — George Takei (@GeorgeTakei) November 11, 2017\n\nBut I do take these claims very seriously, and I wanted to provide my response thoughtfully and not out of the moment. /3 — George Takei (@GeorgeTakei) November 11, 2017\n\nRight now it is a he said / he said situation, over alleged events nearly 40 years ago. But those that know me understand that non-consensual acts are so antithetical to my values and my practices, the very idea that someone would accuse me of this is quite personally painful. /4 — George Takei (@GeorgeTakei) November 11, 2017\n\nBrad, who is 100 percent beside me on this, as my life partner of more than 30 years and now my husband, stands fully by my side. I cannot tell you how vital it has been to have his unwavering support and love in these difficult times. /5 — George Takei (@GeorgeTakei) November 11, 2017\n\nThanks to many of you for all the kind words and trust. It means so much to us. Yours in gratitude, George /end — George Takei (@GeorgeTakei) November 11, 2017\n\nUpdates:\n\nNov. 11, 7 a.m.: This story has been updated with remarks from Takei denying the allegations.", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2017/11/gettyimages-522765532_-_h_2017.jpg?w=1024", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/gettyimages-522765532_-_h_2017.jpg?w=1296&h=730&crop=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/gettyimages-522765532_-_h_2017.jpg?w=1024", "keywords": [], "authors": ["Ryan Parker"], "canonical_link": "https://www.hollywoodreporter.com/news/general-news/george-takei-accused-sexually-assaulting-model-1981-1056698/", "title": "George Takei Accused of Sexually Assaulting Former Model in 1981", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The 'Star Trek' icon denies a claim by Scott R. Brunton, who says he was groped at the actor's Los Angeles condo.", "news_keywords": "Harassment in Hollywood, nsfs, THRX", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "Ryan Parker", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1056698, "title": "George Takei Accused of Sexually Assaulting Former Model in 1981", "published_at": "2017-11-10 18:09:54", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/gettyimages-522765532_-_h_2017.jpg?w=1024", "comment_count": 0, "tags": "THRX", "topics": "News", "body": "A former model and actor is accusing Star Trek icon George Takei of sexual assault in 1981. The accuser, Scott R. Brunton, who was 23 at the time of the alleged incident, claims that Takei took advantage of him when he was most vulnerable.\r\n\"This happened a long time ago, but I have never forgotten it,\" Brunton tells The Hollywood Reporter in an interview. \"It is one of those stories you tell with a group of people when people are recounting bizarre instances in their lives, this always comes up. I have been telling it for years, but I am suddenly very nervous telling it.\"\r\nBrunton says he was living in Hollywood in 1981, working as a waiter and beginning a career as a commercial actor and model when he met a 43- or 44-year-old Takei one evening at Greg's Blue Dot bar. The men exchanged numbers and would call one another from time to time as well as run into each other at clubs, Brunton says. When Brunton broke up with his then-boyfriend, he spoke with Takei. \"He said, 'Let me know what your new number is' and I did. And not long after we broke up and I moved out, George called me,\" Brunton recalls.\r\nTakei, as Brunton tells it, invited him to dinner and the theater. \"He was very good at consoling me and understanding that I was upset and still in love with my boyfriend,\" Brunton says. \"He was a great ear. He was very good about me spilling my heart on my sleeve.\"\r\nThe two men went back to the actor's condo for a drink the same night. \"We have the drink and he asks if I would like another,\" Brunton recalls. \"And I said sure. So, I have the second one, and then all of a sudden, I begin feeling very disoriented and dizzy, and I thought I was going to pass out. I said I need to sit down and he said sit over here and he had the giant yellow beanbag chair. So I sat down in that and leaned my head back and I must have passed out.\"\r\n\"The next thing I remember I was coming to and he had my pants down around my ankles and he was groping my crotch and trying to get my underwear off and feeling me up at the same time, trying to get his hands down my underwear,\" Brunton says. \"I came to and said, 'What are you doing?!' I said, 'I don't want to do this.' He goes, 'You need to relax. I am just trying to make you comfortable. Get comfortable.' And I said, 'No. I don't want to do this.' And I pushed him off and he said, 'OK, fine.' And I said I am going to go and he said, 'If you feel you must. You're in no condition to drive.' I said, 'I don't care I want to go.' So I managed to get my pants up and compose myself and I was just shocked. I walked out and went to my car until I felt well enough to drive home, and that was that.\"\r\nTHR spoke to four longtime friends of Brunton — Norah Roadman, Rob Donovan, Stephen Blackshear and Jan Steward — who said that he had confided in them about the Takei encounter years ago.\r\nTakei's rep, Julia Buchwald, told THR, \"George is traveling in Japan and Australia and not reachable for comment.\" Takei, now 80, rose to fame playing Hikaru Sulu on the original Star Trek television series. He is also an author and activist and has been an outspoken advocate for LGBTQ rights.\r\nIn a series of tweets and in a Facebook post Saturday morning, Takei denied the allegations.\r\n\"The events he describes back in the 1980s simply did not occur, and I do not know why he has claimed them now. I have wracked my brain to ask if I remember Mr. Brunton, and I cannot say I do,\" he said. \"Right now it is a he said / he said situation, over alleged events nearly 40 years ago. But those that know me understand that non-consensual acts are so antithetical to my values and my practices, the very idea that someone would accuse me of this is quite personally painful.\"\r\nBrunton claims that he met up with Takei years after the incident in Portland, Brunton's current home, while the actor was there on a book tour. \"I wanted to see him,\" Brunton says. \"I always wanted to ask him — I just felt really betrayed. I thought I was a friend and here I am later, just another piece of meat. So I called him up at the hotel — I figured out which hotel he was at — and he said 'Hi, Scott. I remember you.' I wanted to ask him why. We met for coffee, and I just couldn't bring myself to do it. It was just too uncomfortable.\"\r\nBrunton says he considered going to the media with the story for years, but he assumed no one would take him seriously. \"Who's going to believe me? It's my word against his,\" he says.\r\nBrunton's reasoning changed after the Harvey Weinstein scandal, and specifically when Takei spoke out regarding allegations leveled against Kevin Spacey.\r\nOn Oct. 29, Anthony Rapp, an actor starring in the latest Star Trek series, claimed to BuzzFeed News that Spacey sexually assaulted him while he was a minor in 1986. Spacey later apologized and came out as gay in response. \"When power is used in a non-consensual situation, it is a wrong,\" Takei said of the Spacey claim in a statement to THR on Oct. 30. \"For Anthony Rapp, he has had to live with the memory of this experience of decades ago. For Kevin Spacey, who claims not to remember the incident, he was the older, dominant one who had his way. Men who improperly harass or assault do not do so because they are gay or straight — that is a deflection. They do so because they have the power, and they chose to abuse it.\"\r\nBrunton says he found Takei's response infuriating. \"I don't want anything from him but an apology,\" he says. \"I am sure he'll disown all this, I don't know, maybe not.\"\r\n\r\n\tFriends,\r\n\t\t\r\n\t\tI'm writing to respond to the accusations made by Scott R. Bruton. I want to assure you all that I am as shocked and bewildered at these claims as you must feel reading them. /1\r\n\t— George Takei (@GeorgeTakei) November 11, 2017\r\n\r\n\tThe events he describes back in the 1980s simply did not occur, and I do not know why he has claimed them now. I have wracked my brain to ask if I remember Mr. Brunton, and I cannot say I do. /2\r\n\t— George Takei (@GeorgeTakei) November 11, 2017\r\n\r\n\tBut I do take these claims very seriously, and I wanted to provide my response thoughtfully and not out of the moment. /3\r\n\t— George Takei (@GeorgeTakei) November 11, 2017\r\n\r\n\tRight now it is a he said / he said situation, over alleged events nearly 40 years ago. But those that know me understand that non-consensual acts are so antithetical to my values and my practices, the very idea that someone would accuse me of this is quite personally painful. /4\r\n\t— George Takei (@GeorgeTakei) November 11, 2017\r\n\r\n\tBrad, who is 100 percent beside me on this, as my life partner of more than 30 years and now my husband, stands fully by my side. I cannot tell you how vital it has been to have his unwavering support and love in these difficult times. /5\r\n\t— George Takei (@GeorgeTakei) November 11, 2017\r\n\r\n\tThanks to many of you for all the kind words and trust. It means so much to us.\r\n\t\t\r\n\t\tYours in gratitude,\r\n\t\t\r\n\t\tGeorge /end\r\n\t— George Takei (@GeorgeTakei) November 11, 2017\r\nUpdates: \r\nNov. 11, 7 a.m.: This story has been updated with remarks from Takei denying the allegations.", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "George Takei Accused of Sexually Assaulting Former Model in 1981", "url": "https://www.hollywoodreporter.com/news/general-news/george-takei-accused-sexually-assaulting-model-1981-1056698/", "description": "The ‘Star Trek’ icon denies a claim by Scott R. Brunton, who says he was groped at the actor’s Los Angeles condo.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/gettyimages-522765532_-_h_2017.jpg?w=1024", "width": 1024, "height": 577}, "locale": "en_US"}, "article": {"published_time": "2017-11-10T18:09:54+00:00", "modified_time": "2017-11-22T16:41:10+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "George Takei Accused of Sexually Assaulting Former Model in 1981", "description": "The ‘Star Trek’ icon denies a claim by Scott R. Brunton, who says he was groped at the actor’s Los Angeles condo.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2017/11/gettyimages-522765532_-_h_2017.jpg?w=1296"}}, "movies": [], "publish_date": 1510337394.0, "source": "https://www.hollywoodreporter.com", "summary": ""}