{"url": "https://www.rollingstone.com/tv/tv-recaps/o-j-simpson-the-lost-confession-5-wtf-moments-124047/", "text": "O.J. Simpson recounted the “hypothetical” way he might have killed his ex-wife Nicole Brown Simpson and her friend, Ron Goldman, in a controversial two-hour special on Fox Sunday night, aptly titled, O.J. Simpson: The Lost Confession?\n\nOver the course of the special, Simpson described to publisher Judith Regan, in increasing detail, the series of events that could have hypothetically led to Nicole and Goldman’s 1994 deaths. He made mention of a friend named “Charlie” who was with him at the time of the murders, though at certain points throughout the interview, he alternated between talking about Charlie and speaking in the first person.\n\nThe interview was originally conducted in 2006 in supposed conjunction with the release of his book, If I Did It. Backlash over both the proposed Fox special and the book quashed both before they could reach the public, but on Sunday, the footage finally aired, to mixed reviews. (If I Did It was eventually published by Beafort Books in September 2007, and the Goldman family won 90 percent of the proceeds of the sale of the book rights; an attorney for the Goldman family said they “welcomed” the airing of the tapes, saying that the special allowed “everyone to make their own judgment.”)\n\n“I think Charlie is O.J. This is no hypothetical,” said Christopher Darden, who was one of the prosecutors in the 1994 trial and also part of a panel of experts on Sunday night’s special. “I think he confessed to murder.”\n\nMalcolm LaVergne, Simpson’s current attorney, said Monday the idea that the hypothetical account amounted to a confession was “a joke.”\n\n“This was scripted by Judith Regan, the publisher of the book,” LaVergne told CBS This Morning. “Mr. Simpson went along because quite frankly, he got a lot of money up front to go along with this.”\n\nSimpson’s own take on speaking out about a hypothetical murder appeared to be one of acceptance.\n\n“It’s very difficult for me because it’s hypothetical,” he said during the interview. “I know and I accept the fact that people are going to feel whatever way they gonna feel.” Here, the five most WTF moments from the Sunday night special.\n\nSimpson said that though Nicole and Goldman were “physically dead,” they had essentially “killed” him too.\n\nThe former NFL running back told Regan that he felt conflicted about his feelings toward Nicole and that he was worried that she was “losing herself” following their divorce. When Regan asked him point-blank whether he felt lost as well, he responded with a surprisingly phrased answer: “In many ways, yeah. It was almost like Ron and Nicole were physically dead and it’s almost like they killed me. Who I was was attacked and murdered also in that short period of time.” He also said it “really, really bothered” him that a lot of people seemed to want him to be convicted of the murders.\n\nSimpson’s friend “Charlie” was the one who alerted him to go to Nicole’s house that day.\n\n“I don’t know why he had been by Nicole’s house, but he told me, ‘You wouldn’t believe what’s going on over there,'” Simpson said. “And I thought, ‘Whatever’s going on over there’s gotta stop.'” So, according to Simpson, both he and Charlie got into his infamous white Bronco and drove to Nicole’s house. Once they had parked in a nearby alleyway, Simpson said he pulled a knife out from under his seat and “I believe [Charlie] took it.”\n\n“Charlie” may have been Simpson’s imaginary friend or a second side to Simpson’s personality, executive producer Terry Wrong told Fox in a teleconference; and though he appeared in the book If I Did It, it’s important to note that Charlie was never mentioned in the actual 1994 court case.\n\nHe talked about “blood and stuff” that was at the scene of the crime and laughingly reminded Regan that he was speaking in hypotheticals.\n\n“As things got heated, I just remember Nicole fell and hurt herself and this guy kind of got into this karate thing,” he said, describing the hypothetical moment when the confrontation escalated. “And I said, ‘Well, you think you can kick my ass?’ And I remember I grabbed the knife – I do remember that portion, taking a knife from Charlie – and to be honest after that I don’t remember, except I’m standing there and there’s all kind of stuff around and …” As he trailed off, Regan picked up the thread and asked, “What kind of stuff?” to which he replied, “Blood and stuff.”\n\nHe then added with a laugh, “I hate to say this, but this is hypothetical. I don’t think any two people could be murdered the way they were without everybody being covered in blood.”\n\nAt times, Simpson used verb tenses that sounded more definitive than speculative.\n\nWhen Regan asked Simpson about the infamous glove that was left at the scene of the crime, and the passage in his book that said he removed it before taking the knife from Charlie, Simpson spoke in first person. “You know, I have no conscious memory of doing that [removing the glove] but obviously I must have because they found the glove there,” he said. No murder weapon was ever found, though police officials have continued to look for one as recently as 2016.\n\nHe described in excruciating detail the process of getting rid of the evidence.\n\nSimpsons recalled having to dispose of bloody clothes following the hypothetical killing. When Regan asked Simpson directly, “And you had left your keys and wallet in your pants pocket and you had to go back and get it?” a momentarily stumped Simpson replied, “You know, to be honest, I think – I know that to be true, yes.” Regan immediately followed up by asking him whether he believed in heaven and hell, and whether he thought he would see his late wife again someday. “Yes,” he replied confidently. “Hey, look, I’ve cursed her. I’ve been to her gravesite and why – what the hell? Look at these kids. Look at Sydney with no mother. I’ve done that. I’ve done that.”", "images": ["https://www.rollingstone.com/wp-content/themes/vip/pmc-rollingstone-2022/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=204436500352178&ev=PageView&noscript=1", "https://www.rollingstone.com/wp-content/uploads/2018/06/oj-simpson-confession-fox-moments-wtf-read-2018-e5701fad-a8c9-4ad7-9b00-824b81695c7b.jpg?w=500&h=375&crop=1", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1"], "top_img": "https://www.rollingstone.com/wp-content/uploads/2018/06/oj-simpson-confession-fox-moments-wtf-read-2018-e5701fad-a8c9-4ad7-9b00-824b81695c7b.jpg?w=500&h=375&crop=1", "keywords": [], "authors": ["Joyce Chen"], "canonical_link": "https://www.rollingstone.com/tv-movies/tv-movie-recaps/o-j-simpson-the-lost-confession-5-wtf-moments-124047/", "title": "‘O.J. Simpson: The Lost Confession?’: 5 WTF Moments", "meta_data": {"theme-color": "#df3535", "viewport": "width=device-width, initial-scale=1.0", "description": "O.J. Simpson recalls a friend named Charlie and \"blood\" at the hypothetical scene of the crime in Fox's two-hour special based on a 2006 interview.", "news_keywords": "O.J. Simpson", "robots": "max-image-preview:large", "cXenseParse": {"pmc-lob": "rollingstone", "pmc-page_type": "article", "articleid": 124047, "author": "Joyce Chen", "pmc-category": "TV & Movies,TV & Movies Recaps", "pmc-over_1_year": "yes", "pmc-post_type": "post", "recs": {"publishtime": "2018-03-12T19:57:00"}, "pmc-tag": "O.J. Simpson", "title": "‘O.J. Simpson: The Lost Confession?’: 5 WTF Moments", "pageclass": "article", "pmc-is_free": "no", "pmc-branded-content": "no", "pmc-evergreen": "no"}, "generator": "WordPress 6.0.2", "author": "Joyce Chen", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "RS", "application-name": "RS", "content_type": "Article", "post_id": 124047, "title": "'O.J. Simpson: The Lost Confession?': 5 WTF Moments", "published_at": "2018-03-12 19:57:00", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/oj-simpson-confession-fox-moments-wtf-read-2018-e5701fad-a8c9-4ad7-9b00-824b81695c7b.jpg?w=1024", "comment_count": 0, "tags": "O.J. Simpson", "topics": "TV & Movies Recaps", "body": "O.J. Simpson recounted the \"hypothetical\" way he might have killed his ex-wife Nicole Brown Simpson and her friend, Ron Goldman, in a controversial two-hour special on Fox Sunday night, aptly titled, O.J. Simpson: The Lost Confession?Over the course of the special, Simpson described to publisher Judith Regan, in increasing detail, the series of events that could have hypothetically led to Nicole and Goldman's 1994 deaths. He made mention of a friend named \"Charlie\" who was with him at the time of the murders, though at certain points throughout the interview, he alternated between talking about Charlie and speaking in the first person.The interview was originally conducted in 2006 in supposed conjunction with the release of his book, If I Did It. Backlash over both the proposed Fox special and the book quashed both before they could reach the public, but on Sunday, the footage finally aired, to mixed reviews. (If I Did It was eventually published by Beafort Books in September 2007, and the Goldman family won 90 percent of the proceeds of the sale of the book rights; an attorney for the Goldman family said they \"welcomed\" the airing of the tapes, saying that the special allowed \"everyone to make their own judgment.\")\"I think Charlie is O.J. This is no hypothetical,\" said Christopher Darden, who was one of the prosecutors in the 1994 trial and also part of a panel of experts on Sunday night's special. \"I think he confessed to murder.\" Malcolm LaVergne, Simpson's current attorney, said Monday the idea that the hypothetical account amounted to a confession was \"a joke.\"\"This was scripted by Judith Regan, the publisher of the book,\" LaVergne told CBS This Morning. \"Mr. Simpson went along because quite frankly, he got a lot of money up front to go along with this.\"Simpson's own take on speaking out about a hypothetical murder appeared to be one of acceptance.\"It's very difficult for me because it's hypothetical,\" he said during the interview. \"I know and I accept the fact that people are going to feel whatever way they gonna feel.\" Here, the five most WTF moments from the Sunday night special.Simpson said that though Nicole and Goldman were \"physically dead,\" they had essentially \"killed\" him too.The former NFL running back told Regan that he felt conflicted about his feelings toward Nicole and that he was worried that she was \"losing herself\" following their divorce. When Regan asked him point-blank whether he felt lost as well, he responded with a surprisingly phrased answer: \"In many ways, yeah. It was almost like Ron and Nicole were physically dead and it's almost like they killed me. Who I was was attacked and murdered also in that short period of time.\" He also said it \"really, really bothered\" him that a lot of people seemed to want him to be convicted of the murders.Simpson's friend \"Charlie\" was the one who alerted him to go to Nicole's house that day.\"I don't know why he had been by Nicole's house, but he told me, 'You wouldn't believe what’s going on over there,'\" Simpson said. \"And I thought, 'Whatever's going on over there's gotta stop.'\" So, according to Simpson, both he and Charlie got into his infamous white Bronco and drove to Nicole's house. Once they had parked in a nearby alleyway, Simpson said he pulled a knife out from under his seat and \"I believe [Charlie] took it.\"\"Charlie\" may have been Simpson's imaginary friend or a second side to Simpson's personality, executive producer Terry Wrong told Fox in a teleconference; and though he appeared in the book If I Did It, it's important to note that Charlie was never mentioned in the actual 1994 court case. He talked about \"blood and stuff\" that was at the scene of the crime and laughingly reminded Regan that he was speaking in hypotheticals.\"As things got heated, I just remember Nicole fell and hurt herself and this guy kind of got into this karate thing,\" he said, describing the hypothetical moment when the confrontation escalated. \"And I said, 'Well, you think you can kick my ass?' And I remember I grabbed the knife – I do remember that portion, taking a knife from Charlie – and to be honest after that I don't remember, except I'm standing there and there's all kind of stuff around and …\" As he trailed off, Regan picked up the thread and asked, \"What kind of stuff?\" to which he replied, \"Blood and stuff.\"He then added with a laugh, \"I hate to say this, but this is hypothetical. I don't think any two people could be murdered the way they were without everybody being covered in blood.\"At times, Simpson used verb tenses that sounded more definitive than speculative.When Regan asked Simpson about the infamous glove that was left at the scene of the crime, and the passage in his book that said he removed it before taking the knife from Charlie, Simpson spoke in first person. \"You know, I have no conscious memory of doing that [removing the glove] but obviously I must have because they found the glove there,\" he said. No murder weapon was ever found, though police officials have continued to look for one as recently as 2016.He described in excruciating detail the process of getting rid of the evidence.Simpsons recalled having to dispose of bloody clothes following the hypothetical killing. When Regan asked Simpson directly, \"And you had left your keys and wallet in your pants pocket and you had to go back and get it?\" a momentarily stumped Simpson replied, \"You know, to be honest, I think – I know that to be true, yes.\" Regan immediately followed up by asking him whether he believed in heaven and hell, and whether he thought he would see his late wife again someday. \"Yes,\" he replied confidently. \"Hey, look, I've cursed her. I've been to her gravesite and why – what the hell? Look at these kids. Look at Sydney with no mother. I've done that. I've done that.\"", "fb": {"pages": 10664530778}, "onesignal": "wordpress-plugin", "og": {"type": "article", "title": "'O.J. Simpson: The Lost Confession?': 5 WTF Moments", "url": "https://www.rollingstone.com/tv-movies/tv-movie-recaps/o-j-simpson-the-lost-confession-5-wtf-moments-124047/", "description": "O.J. Simpson recalls a friend named Charlie and “blood” at the hypothetical scene of the crime in Fox’s two-hour special based on a 2006 interview", "site_name": "Rolling Stone", "image": {"identifier": "https://www.rollingstone.com/wp-content/uploads/2018/06/oj-simpson-confession-fox-moments-wtf-read-2018-e5701fad-a8c9-4ad7-9b00-824b81695c7b.jpg?w=500&h=375&crop=1", "width": 1024, "height": 686, "alt": "WTF Moments from 'O.J. Simpson: The Lost Confession?'"}, "locale": "en_US"}, "article": {"published_time": "2018-03-12T19:57:00+00:00", "modified_time": "2018-06-25T15:44:45+00:00"}, "twitter": {"site": "@RollingStone", "card": "summary_large_image", "title": "‘O.J. Simpson: The Lost Confession?’: 5 WTF Moments", "description": "O.J. Simpson recalls a friend named Charlie and \"blood\" at the hypothetical scene of the crime in Fox's two-hour special based on a 2006 interview.", "image": "https://www.rollingstone.com/wp-content/uploads/2018/06/oj-simpson-confession-fox-moments-wtf-read-2018-e5701fad-a8c9-4ad7-9b00-824b81695c7b.jpg?w=1024"}, "msapplication-TileImage": "https://www.rollingstone.com/wp-content/uploads/2022/08/cropped-Rolling-Stone-Favicon.png?w=270"}, "movies": [], "publish_date": 1520884620.0, "source": "https://www.rollingstone.com", "summary": ""}