{"url": "https://abcnews.go.com/GMA/Culture/gisele-bundchen-rose-rock-bottom/story?id=58216587", "text": "The supermodel also shared the most important lesson she teaches her children.\n\nSupermodel Gisele Bundchen opened up about how she rose up after hitting \"rock bottom,\" her relationship with Tom Brady and the biggest life lessons she teaches her children.\n\nBundchen told \"Good Morning America\" anchor Robin Roberts that right now she is in the valley of her life.\n\n\"I'm a very visual person so that's why I describe it as the mountain and the valley,\" she said. \"Both of them are incredibly important, because from the mountaintop you can have a broader view of what's happening,\"\n\n\"You can see things from the top. There's a lot of sun on the mountaintop ... which is being on top of my career,\" Bundchen explained. \"And then the valley is ... you know, is the quieter place. It's the families, the home. It's where you do the work that doesn't get seen, but it's so important.\"\n\nGisele Bundchen attends the Green Carpet Fashion Awards Italia 2017 during Milan Fashion Week Spring/Summer 2018, Sept. 24, 2017, in Milan, Italy. Venturelli/Getty Images, FILE\n\nA native of Brazil, Bundchen now lives outside of Boston with her husband, Tom Brady, the New England Patriots' quarterback.\n\nThe couple have two children together, and Bundchen said she has \"always wanted to be a mom\" and \"have a family.\"\n\n\"When I became a mother,\" she added, \"it really became my priority.\"\n\n\"I just wanted to be with my kids,\" she said. \"I couldn't ... see anything more important than being there for them ... and to be there for my husband too.\"\n\n\"Good Morning America\" anchor Robin Roberts interviews Gisele Bundchen about her new book, \"Lessons.\" ABC News\n\nDespite this, transitioning from an international supermodel to domestic life took some time to adjust to, she said.\n\n\"I was actually living what I love so much, which is being a mom, and a nurturer, and taking care of my family,\" Bundchen said. \"It was just very different than what I was used to. So it took some time to adjust.\"\n\nNew England Patriots quarterback Tom Brady kisses his wife, Gisele Bundchen, following Patriots training camp at the Gillette Stadium practice facility in Foxborough, Mass., Aug. 3, 2018. John Tlumacki/The Boston Globe via Getty Images, FILE\n\nBundchen opens up about her deeply personal journey to self-acceptance in her new book, \"Lessons: My Path to a Meaningful Life.\"\n\nIn the book, she details how she used to suffer from crippling panic attacks in her 20s.\n\n\"That was definitely rock bottom for me,\" Bundchen said of that time period.\n\nOne panic attack was so severe Bundchen said it led her to contemplate suicide.\n\nShe said she is sharing these \"very private\" and \"very vulnerable\" stories now \"with the hopes that people don't feel alone.\"\n\n\"It was like I was trapped and I couldn't breathe, and even outside of my own balcony,\" she recalled of a severe panic attack she had years ago. \"And from that moment on, you know, I realized that my life needed to change.\"\n\nAfter overcoming the urge to jump from that balcony, Bundchen committed to a full lifestyle change: Trading in cigarettes, wine and sugary coffee drinks for a clean, plant-based diet.\n\n\"Good Morning America\" anchor Robin Roberts interviews Gisele Bundchen about her new book, \"Lessons.\" ABC News\n\nShe said she is teaching her children health habits and asks them to help tend the family's garden.\n\n\"They also learn that it takes time to grow -- like we plant the seed and then they have to wait,\" she said.\n\nBundchen also credits the discovery of meditation and yoga with saving her life. She described meditation as \"being in the place in the seat of the observer versus in the monkey mind.\"\n\n\"Somebody told me a quote that I thought was fantastic one time: 'The mind is an instrument, don't let it play you,'\" she added.\n\nShe said she also finds a sense of peace in the steadiness of her husband.\n\n\"He's very calm and very centered,\" she said. \"And I feel like, you know, I'm very emotional and very changeable.\"\n\n\"What I've learned from him is to kind of take a breath,\" she said. \"Take a breath.\"\n\nGisele Bundchen and Tom Brady attend the Heavenly Bodies: Fashion & The Catholic Imagination Costume Institute Gala at Metropolitan Museum of Art, May 7, 2018, in New York City. Jackson Lee/Getty Images, FILE\n\nWhile in the past Bundchen has been vocal about wanting Brady to retire from football, she now says he will stop playing when he is ready.\n\nBrady recently said he would like to play five more years.\n\n\"I never seen someone love something as much as he loves football, and it makes me happy,\" Bundchen said. \"If I said anything in the past it's because ... you have a concern.\"\n\n\"Good Morning America\" anchor Robin Roberts interviews Gisele Bundchen about her new book, \"Lessons.\" ABC News\n\nWhen it comes to her family, \"I'm like, you know, no one is going to hurt someone I love. You know?\"\n\n\"You just feel very protective of them,\" she added. \"So obviously if someone hurts my children, my husband, anyone I love, I get like a lioness.\"\n\nWhen her 8-year-old son asked her, \"Mom, What's a celebrity?\" Bundchen said she made it clear that just because someone is famous does not mean they're more important.\n\n\"I said, 'You know, a celebrity is simply someone that has a job that is more public than other jobs ... It doesn't mean that the job is more important than other jobs,\" she added. \"It's just simply is a more visible job.'\"\n\nOf all the life lessons she shares in her new book, Bundchen said she believes the most important is to: \"Just live your life with love.\"", "images": ["https://s.abcnews.com/images/GMA/gisele-bundchen1-abc-ml-181002_hpMain_16x9_992.jpg", "https://s.abcnews.com/images/US/vegas-stabbings_hpMain_20221007-090546_1x1_144.jpg", "https://s.abcnews.com/images/International/bridge-gty-ml-221008_1665242585018_hpMain_1x1_144.jpg", "https://s.abcnews.com/images/US/john-lynch-points-house-damage-abc-jt-221007_1665185645263_hpMain_1x1_144.jpg", "https://s.abcnews.com/images/GMA/gisele-bundchen-tom-brady-gty-mt-181001_hpEmbed_10x7_992.jpg", "https://s.abcnews.com/images/Politics/uvalde-1-gty-er-221007_1665161778549_hpMain_1x1_144.jpg", "https://s.abcnews.com/images/GMA/gisele-bundchen-tom-brady-met-gala-gty-mt-181001_hpEmbed_2x3_992.jpg", "https://s.abcnews.com/images/GMA/gisele-bundchen-abc-ml-181002_hpMain_16x9_992.jpg", "https://s.abcnews.com/images/GMA/gisele-bundchen-gty-mt-181001_hpMain_16x9_992.jpg", "https://s.abcnews.com/assets/dtci/random/svg/gma_logo.svg", "https://s.abcnews.com/images/Politics/trump-white-house-oval-office-gty-jt-221004_1664919462010_hpMain_1x1_144.jpg", "https://s.abcnews.com/images/GMA/gisele-robin-abc-ml-181001_hpEmbed_2_16x9_992.jpg", "https://s.abcnews.com/images/GMA/gisele-robin2-abc-ml-181001_hpMain_2_16x9_992.jpg", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://s.abcnews.com/images/GMA/gisele-bundchen-abc-ml-181002_hpMain_16x9_992.jpg", "keywords": [], "authors": ["Abc News"], "canonical_link": "https://goodmorningamerica.com/culture/story/gisele-bundchen-rose-rock-bottom-58216587", "title": "Gisele Bundchen on how she rose up from 'rock bottom'", "meta_data": {"description": "The supermodel also shared the most important lesson she teaches her children.", "keywords": "children, Gisele Bundchen, Robin Roberts, Tom Brady", "copyright": "2022 ABC News Internet Ventures. All rights reserved.", "author": "ABC News", "robots": "index, follow", "fb": {"admins": 704409894, "app_id": 4942312939, "pages": 55845270277}, "fb_title": "Gisele Bundchen on how she rose up from 'rock bottom'", "og": {"site_name": "ABC News", "url": "https://goodmorningamerica.com/culture/story/gisele-bundchen-rose-rock-bottom-58216587", "title": "Gisele Bundchen on how she rose up from 'rock bottom'", "description": "The supermodel also shared the most important lesson she teaches her children.", "image": "https://s.abcnews.com/images/GMA/gisele-bundchen-abc-ml-181002_hpMain_16x9_992.jpg", "type": "article", "locale": "en_US"}, "lastPublishedDate": "2018-10-03T06:47:58Z", "article": {"opinion": "false", "content_tier": "free"}, "twitter": {"app": {"name": {"iphone": "ABC News", "ipad": "ABC News", "googleplay": "ABC News"}, "id": {"iphone": 300255638, "ipad": 306934135, "googleplay": "com.abc.abcnews"}, "url": {"iphone": "abcnewsiphone://link/prism-story,58216587", "ipad": "abcnewsipad://link/prism-story,58216587", "googleplay": "https://goodmorningamerica.com/culture/story/gisele-bundchen-rose-rock-bottom-58216587"}}, "card": "summary_large_image", "site": "@ABC", "creator": "ABC News", "title": "Gisele Bundchen on how she rose up from 'rock bottom'", "description": "The supermodel also shared the most important lesson she teaches her children.", "url": "https://goodmorningamerica.com/culture/story/gisele-bundchen-rose-rock-bottom-58216587", "image": {"identifier": "https://s.abcnews.com/images/GMA/gisele-bundchen-abc-ml-181002_hpMain_16x9_992.jpg", "width": 640, "height": 360}}, "al": {"iphone": {"url": "abcnewsiphone://link/prism-story,58216587", "app_store_id": 300255638, "app_name": "ABC News - Breaking US & World News"}, "ipad": {"url": "abcnewsipad://link/prism-story,58216587", "app_store_id": 380520716, "app_name": "ABC News for ipad"}, "android": {"url": "android-app://com.abc.abcnews/abcnews/goodmorningamerica.com/culture/story/gisele-bundchen-rose-rock-bottom-58216587", "app_name": "ABC News Breaking Latest News", "package": "com.abc.abcnews"}, "web": {"url": "https://goodmorningamerica.com/culture/story/gisele-bundchen-rose-rock-bottom-58216587"}}, "viewport": "initial-scale=1.0, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": null, "source": "https://abcnews.go.com", "summary": ""}