{"url": "https://www.hollywoodreporter.com/news/dolores-oriordan-dead-cranberries-singer-was-46-1074715", "text": "Dolores O’Riordan, lead singer of Irish rock band The Cranberries, died suddenly on Monday. She was 46.\n\nO’Riordan died in London, where she was recording, publicist Lindsey Holmes said.\n\n“No further details are available at this time,” said Holmes, adding that the singer’s family was “devastated” by the news.\n\nThe official Cranberries Twitter account posted a note from bandmates Noel and Mike Hogan and Fergal Lawler later on Monday: “We are devastated on the passing of our friend Dolores. She was an extraordinary talent and we feel very privileged to have been part of her life from 1989 when we started the Cranberries. The world has lost a true artist today.”\n\nFormed in Limerick, Ireland, at the end of the 1980s, The Cranberries became international stars in the 1990s with hits including “Zombie” and “Linger” that melded alternative rock edge with Celtic-infused pop tunefulness.\n\nIrish President Michael D. Higgins said in a statement that O’Riordan and the band “had an immense influence on rock and pop music in Ireland and internationally.”\n\nHe added, “To all those who follow and support Irish music, Irish musicians and the performing arts, her death will be a big loss.”\n\nO’Riordan was The Cranberries’ chief lyricist and co-songwriter, and her powerful, sometimes wailing voice was key to the band’s distinctive sound.\n\nThe group’s 1993 debut album Everybody Else Is Doing It, So Why Can’t We? sold millions of copies and produced the hit single “Linger.”\n\nThe follow-up, No Need to Argue, sold in even greater numbers and contained “Zombie,” a howl against Northern Ireland’s turbulence that topped the singles charts in several countries.\n\nThe band released three more studio albums before splitting up in 2003. O’Riordan released a solo album, Are You Listening, in 2007, and another, No Baggage, in 2009.\n\nThe members of The Cranberries subsequently reunited in 2009 and released the album Roses in 2012.\n\nThe group released the acoustic album Something Else last year and had been set to tour Europe and North America. The tour was cut short because O’Riordan was suffering from back problems.\n\nIn 2014, O’Riordan was accused of assaulting three police officers and a flight attendant during a flight from New York to Ireland. She pleaded guilty and was fined 6,000 euros ($6,600).\n\nMedical records given to the court indicated she was mentally ill at the time of the altercation. After her court hearing, O’Riordan urged other people suffering mental illness to seek help.\n\nShe is survived by her ex-husband, former Duran Duran tour manager Don Burton, and their three children.\n\nSeveral of O’Riordan’s fellow musicians and fans paid tribute on Twitter.\n\nI once met Delores O’Riordan when I was 15. She was kind and lovely, I got her autograph on my train ticket and it made my day. She had the most amazing voice and presence. So sorry to hear that she’s passed away today x — James Corden (@JKCorden) January 15, 2018\n\nNooooo!! Have always adored her songs and voice https://t.co/asBAt1RJl1 — josh groban (@joshgroban) January 15, 2018\n\nAbsolutely shocked to hear about the passing of Dolores O’Riordan! @The_Cranberries gave us our first big support when we toured with them around France years ago! Thoughts are with her family and friends — Kodaline (@Kodaline) January 15, 2018\n\nthis is horrible news to wake up to. rest in peace dolores. https://t.co/KqPvlIs7r0 — Diplo (@_diplo_) January 15, 2018\n\nMy first time hearing Dolores O’Riordan’s voice was unforgettable. It threw into question what a voice could sound like in that context of Rock. I’d never heard somebody use their instrument in that way. Shocked and saddened to hear of her passing, thoughts are with her family. — Hozier (@Hozier) January 15, 2018\n\nSo sad to hear of Dolores O’Riordan passing. I remember as a young girl, hearing The Cranberries for the first time and wanting to be just like her. — Michelle Branch (@michellebranch) January 15, 2018", "images": ["https://www.hollywoodreporter.com/wp-content/uploads/2018/01/68985374.jpg?w=1024", "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/68985374.jpg?w=2000&h=1126&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://cdn.shopify.com/s/files/1/0238/6647/products/2019_37_540x.jpg", "https://www.hollywoodreporter.com/wp-content/themes/vip/pmc-hollywoodreporter-2021/assets/public/lazyload-fallback.gif", "https://www.facebook.com/tr?id=352999048212581&ev=PageView&noscript=1"], "top_img": "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/68985374.jpg?w=1024", "keywords": [], "authors": ["The Associated Press"], "canonical_link": "https://www.hollywoodreporter.com/news/general-news/dolores-oriordan-dead-cranberries-singer-was-46-1074715/", "title": "Cranberries Singer Dolores O’Riordan Dies at 46", "meta_data": {"theme-color": "#fff", "viewport": "width=device-width, initial-scale=1.0", "description": "The performer died suddenly Monday in London, according to her publicist.", "news_keywords": "autoplay, Obituaries", "robots": "max-image-preview:large", "generator": "WordPress 6.0.2", "author": "the Associated Press", "apple-mobile-web-app-capable": "yes", "mobile-web-app-capable": "yes", "apple-touch-fullscreen": "YES", "apple-mobile-web-app-title": "The Hollywood Reporter", "application-name": "The Hollywood Reporter", "content_type": "Article", "post_id": 1074715, "title": "Cranberries Singer Dolores O'Riordan Dies at 46", "published_at": "2018-01-15 09:33:18", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/68985374.jpg?w=1024", "comment_count": 0, "tags": "Obituaries", "topics": "News", "body": "Dolores O'Riordan, lead singer of Irish rock band The Cranberries, died suddenly on Monday. She was 46.\r\nO'Riordan died in London, where she was recording, publicist Lindsey Holmes said.\r\n\"No further details are available at this time,\" said Holmes, adding that the singer's family was \"devastated\" by the news.\r\nThe official Cranberries Twitter account posted a note from bandmates Noel and Mike Hogan and Fergal Lawler later on Monday: \"We are devastated on the passing of our friend Dolores. She was an extraordinary talent and we feel very privileged to have been part of her life from 1989 when we started the Cranberries. The world has lost a true artist today.\" \r\nFormed in Limerick, Ireland, at the end of the 1980s, The Cranberries became international stars in the 1990s with hits including \"Zombie\" and \"Linger\" that melded alternative rock edge with Celtic-infused pop tunefulness.\r\nIrish President Michael D. Higgins said in a statement that O'Riordan and the band \"had an immense influence on rock and pop music in Ireland and internationally.\"\r\nHe added, \"To all those who follow and support Irish music, Irish musicians and the performing arts, her death will be a big loss.\"\r\nO'Riordan was The Cranberries' chief lyricist and co-songwriter, and her powerful, sometimes wailing voice was key to the band's distinctive sound.\r\nThe group's 1993 debut album Everybody Else Is Doing It, So Why Can't We? sold millions of copies and produced the hit single \"Linger.\"\r\nThe follow-up, No Need to Argue, sold in even greater numbers and contained \"Zombie,\" a howl against Northern Ireland's turbulence that topped the singles charts in several countries.\r\nThe band released three more studio albums before splitting up in 2003. O'Riordan released a solo album, Are You Listening, in 2007, and another, No Baggage, in 2009.\r\nThe members of The Cranberries subsequently reunited in 2009 and released the album Roses in 2012.\r\nThe group released the acoustic album Something Else last year and had been set to tour Europe and North America. The tour was cut short because O'Riordan was suffering from back problems.\r\nIn 2014, O'Riordan was accused of assaulting three police officers and a flight attendant during a flight from New York to Ireland. She pleaded guilty and was fined 6,000 euros ($6,600).\r\nMedical records given to the court indicated she was mentally ill at the time of the altercation. After her court hearing, O'Riordan urged other people suffering mental illness to seek help.\r\nShe is survived by her ex-husband, former Duran Duran tour manager Don Burton, and their three children.\r\nSeveral of O'Riordan's fellow musicians and fans paid tribute on Twitter.\r\n\r\n\tI once met Delores O’Riordan when I was 15. She was kind and lovely, I got her autograph on my train ticket and it made my day. She had the most amazing voice and presence. So sorry to hear that she’s passed away today x\r\n\t— James Corden (@JKCorden) January 15, 2018\r\n\r\n\tNooooo!! Have always adored her songs and voice https://t.co/asBAt1RJl1\r\n\t— josh groban (@joshgroban) January 15, 2018\r\n\r\n\tAbsolutely shocked to hear about the passing of Dolores O'Riordan! @The_Cranberries gave us our first big support when we toured with them around France years ago! Thoughts are with her family and friends\r\n\t— Kodaline (@Kodaline) January 15, 2018\r\n\r\n\tthis is horrible news to wake up to. rest in peace dolores. https://t.co/KqPvlIs7r0\r\n\t— Diplo (@_diplo_) January 15, 2018\r\n\r\n\tMy first time hearing Dolores O'Riordan's voice was unforgettable. It threw into question what a voice could sound like in that context of Rock. I'd never heard somebody use their instrument in that way. Shocked and saddened to hear of her passing, thoughts are with her family.\r\n\t— Hozier (@Hozier) January 15, 2018\r\n\r\n\tSo sad to hear of Dolores O’Riordan passing. I remember as a young girl, hearing The Cranberries for the first time and wanting to be just like her.\r\n\t— Michelle Branch (@michellebranch) January 15, 2018\r\n\r\n\tShocked and heartbroken over Dolores O’Riordan’s death. The Cranberries were pinnacle in showing me that it was possible to fully embrace masculine and feminine energy in one cohesive sound. She was a true pioneer\r\n\t— Foster The People (@fosterthepeople) January 15, 2018", "fb": {"pages": 14425952749}, "fragment": "!", "og": {"type": "article", "title": "Cranberries Singer Dolores O’Riordan Dies at 46", "url": "https://www.hollywoodreporter.com/news/general-news/dolores-oriordan-dead-cranberries-singer-was-46-1074715/", "description": "The performer died suddenly Monday in London, according to her publicist.", "site_name": "The Hollywood Reporter", "image": {"identifier": "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/68985374.jpg?w=1024", "width": 1024, "height": 576}, "locale": "en_US"}, "article": {"published_time": "2018-01-15T09:33:18+00:00", "modified_time": "2018-01-15T15:20:36+00:00"}, "twitter": {"site": "@thr", "card": "summary_large_image", "title": "Cranberries Singer Dolores O’Riordan Dies at 46", "description": "The performer died suddenly Monday in London, according to her publicist.", "image": "https://www.hollywoodreporter.com/wp-content/uploads/2018/01/68985374.jpg?w=3000"}}, "movies": [], "publish_date": 1516008798.0, "source": "https://www.hollywoodreporter.com", "summary": ""}